{"wiki_id": "http://www.wikidata.org/entity/Q5258378", "itemLabel": "Dennis Edney", "itemDescription": "Canadian lawyer", "wikipedia_url": "https://en.wikipedia.org/wiki/Dennis_Edney", "wikipedia_page": {"main": "Dennis Edney is a Canadian defence lawyer based in Edmonton, Alberta, Canada. Originally from Dundee, Scotland, he is noted for his involvement in high-profile cases, including Brian Mills, R. v. Trang, as defence attorney for Abdullah and Omar Khadr, who were captured in the War on Terror, for Fahim Ahmad, and for representing the entire Khadr family. He also represented Canadian Abdulrahman El Bahnasawy charged in the US with plotting to carry out mass shootings of civilians at concerts, to bomb New York Times Square, and to bomb the city's subway system.Edney was born in Dundee, Scotland, and worked as a building contractor, when he first immigrated to Canada.Edney received his law degree in 1987 from the University of Northumbria and has since appeared at all levels of court, including the Supreme Court of Canada and the United States Supreme Court. He was appointed as Foreign Attorney Consultant by the U.S. Pentagon to participate in the legal defence of Omar Khadr, at Guantanamo Bay Naval Base, Cuba.", "link_mentions": [{"page": "Ahmed Khadr", "response": ["Khadr remains a controversial figure. Canadian attorney Dennis Edney, lawyer for the Khadr family, has challenged the assumption that Khadr was a member of al-Qaeda, saying in 2001 that he was \"really interested in obtaining one piece of evidence that would show indeed that Mr. Khadr was actually a terrorist. To me, it's just folklore.\" Khadr's imam in Canada, Ali Hindy, spoke after his death, saying \"I don't think that he was al-Qaeda, but I think he felt that now he became part of Afghanistan.\" His friends described him as being \"proud of [being a] Canadian citizen\". Some politicians and media have suggested that he disliked the country."]}, {"page": "Omar Khadr", "response": ["thumb|The interior of the courtroom where the tribunal hearing is held.After the Military Commissions Act of 2006 was signed in October 2006, new charges were sworn against Khadr on February 2, 2007. He was charged with Murder in Violation of the Law of War, Attempted Murder in Violation of the Law of War, Conspiracy, Providing Material Support for Terrorism and Spying. However, these charges did not exist in law prior to the Military Commission Act of 2006 (MCA), which postdated the time that the alleged offenses were committed, and are not recognized as war crimes in international law. Canadian attorney Dennis Edney was barred from appearing at the October arraignment, after he criticized Kuebler's efforts, stating that the military lawyer had focused his energy on lobbying Canadian authorities to have Khadr repatriated, at the cost of preparing for the actual trial.", "On August 13, 2013, Khadr's lawyers,  Dennis Edney and Nathan Whitling, filed a brief arguing that under Canada's International Transfer of Offenders Act, it was not legal to hold Khadr in an adult institution, because the eight-year sentence he received from the U.S. military commission could only be interpreted as a youth sentence and he should be detained in a provincial jail rather than a federal prison."]}, {"page": "Abdullah Khadr", "response": ["Khadr's lawyers tried to have a publication ban bar media from reporting on the bail hearing held for the suspect. Prosecutor Robin Parker opposed this request, citing the open courts principle. Justice Anne Molloy of Ontario's Superior Court of Justice refused to order the publication ban, and ultimately denied bail.  He was represented by Nathan Whitling, Dennis Edney and James Silver.Levy, Harold. Toronto Star, \"Khadr loses bid to ban coverage of bail hearing\", December 23, 2004 In court Khadr wore a black T-shirt reading \"For the Future of Islam.\" His maternal grandmother Fatmah el-Samnah offered to act as his surety, putting up her $300,000 house as collateral. The motion for bail was opposed by the prosecutor Robin Parker, who referred to United States claims that the forged passport Khadr had purchased in Pakistan was to allow him to travel to a country without an extradition treaty with the United States. Judge Molloy found there was an unacceptable risk that Khadr would flee, and also that the public confidence in the administration of justice would be undermined were she to grant Khadr bail. A second application for bail, brought by Khadr before Justice Gary Trotter, was also refused.", "Dennis Edney, one of Abdullah's lawyers, said, \"When a U.S. government or any foreign government steps into a Canadian court they have to arrive with clean hands.\""]}, {"page": "Steven Blaney", "response": ["On August 13, 2013, in response to a brief from Dennis Edney arguing that Omar Khadr should be held in a youth facility not an adult prison, because he was a minor when the crimes he was convicted of occurred, Blaney asserted that the  Harper government would fight to keep Khadr in adult prisoner for the full term of his sentence."]}, {"page": "Fahim Ahmad", "response": ["Ahmad was arrested on June 2, 2006.Teotonio, Isabel. Toronto man planned widespread terror attacks, jury hears. Toronto Star, April 12, 2010. Retrieved 2011-03-20. He was charged with receiving and providing terrorist training, and intent to harm or kill with explosives. He was represented by attorney Dennis Edney."]}, {"page": "William C. Kuebler", "response": ["Canadian attorney Dennis Edney was barred from appearing at the October arraignment after an early dispute over comments Kuebler had made to the Canadian press critical of Khadr's father."]}, {"page": "Guantanamo Bay attorneys", "response": ["| Dennis Edney || Abdullah Khadr and Omar Khadr ||"]}, {"page": "Canadian response to Omar Khadr", "response": [" His lawyer Dennis Edney has summarised the differential response towards Khadr stating that \"one of the problems\" with defending the youth is that he's a member of the Khadr family rather than \"a Smith or an Arar\"Humphreys, Adrian. National Post, \"Khadr helped al-Qaeda with GPS, November 2, 2006"]}, {"page": "Edney", "response": ["* Dennis Edney, Canadian defense attorney"]}, {"page": "Category talk:Guantanamo Bay attorneys", "response": ["*Dennis Edney"]}, {"page": "Heather Marsh", "response": ["She has covered investigations of leaked material and individual human rights cases as well as breaking news of global events. In one unpublished interview with Guantanamo defence attorney Dennis Edney, the two discuss blackmail attempts of witnesses by the FBI and the possibility that Omar Khadr's plea deal was signed without legal counsel. The interview was subsequently leaked to Cryptome. The interview discusses the delaying of publication until after Edney returns from Guantanamo; when he returned from Guantanamo he was fired from the case and forbidden to speak of it."]}]}}