{"wiki_id": "http://www.wikidata.org/entity/Q5258852", "itemLabel": "Dennis Peacock", "itemDescription": "English footballer (born 1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dennis_Peacock", "wikipedia_page": {"main": "Dennis Peacock (born 19 April 1953) is an English retired professional footballer who played as a goalkeeper. He played for Nottingham Forest from 1971 until 1975.", "link_mentions": [{"page": "Terry Curran", "response": ["Terry Curran was born in Kinsley, near Hemsworth, West Riding of Yorkshire on 20 March 1955, he signed for Fourth Division Doncaster Rovers in July 1973 from non-league football. He made 68 appearances for Rovers scoring 11 goals in two seasons. Brian Clough was wanting to sign him but was put off by the asking price of £140,000 so he controversially told Curran's brother of his interest so Curran would not sign a new contract, thus reducing the transfer fee. He signed for Nottingham Forest in August 1975 with Rovers receiving £50,000 plus keeper Dennis Peacock and winger Ian Miller. In two seasons, he played 48 games scoring 12 goals for Forest, helping them gain promotion to Division One in the 1976–77 season. Curran lost favour after a disagreement with Forest assistant manager Peter Taylor, and made a written transfer request in August 1977, which was accepted. He was loaned out to Bury during October 1977 and eventually switched to Derby County in a £50,000 move the following month."]}, {"page": "Willie Boyd", "response": ["He was signed by English Division 4 club Doncaster Rovers in February 1980, enabling the club to sell the current keeper, Dennis Peacock, for some much needed funds. His debut was in a 3–2 defeat at Peterborough United on 22 March 1980. The following season Boyd played in all games bar one as Rovers gained promotion to Division 3.", "After making a total of 118 League and Cup appearances, it was at the end of the 1982–83 season that Boyd retired from the professional game hampered by his knee injury, with Dennis Peacock having made a return to the club at the beginning of that season as the first choice keeper."]}, {"page": "1975–76 Nottingham Forest F.C. season", "response": ["| GK || Dennis Peacock || Doncaster Rovers || "]}]}}