{"wiki_id": "http://www.wikidata.org/entity/Q5257787", "itemLabel": "Denise Welch", "itemDescription": "English Television presenter and actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Denise_Welch", "wikipedia_page": {"main": "Jacqueline Denise Welch (born 22 May 1958) is an English actress, television personality, and writer. Her roles include Natalie Barnes in Coronation Street (1997–2000), Steph Haydock in Waterloo Road (2006–2010, 2022–present) and Trish Minniver in Hollyoaks (2021–2022). Welch also appears as a regular panellist on the ITV chat show Loose Women (2005–2013, 2018–present).\nWelch's other acting roles include the television dramas Spender (1991–1993), Soldier Soldier (1993–1995), and Down to Earth (2004–2005). In 2011, she was a contestant on the sixth series of Dancing on Ice, where she was partnered with professional skater Matt Evers. In 2012, Welch won the ninth series of Celebrity Big Brother.\n\n", "link_mentions": [{"page": "University Challenge", "response": ["|Team ITV (Russell Kane, Denise Welch, Kaye Adams, Ranj Singh)"]}, {"page": "Byker Grove", "response": ["| Polly Bell || Denise Welch || 1990–91 (2 series)"]}, {"page": "London Palladium", "response": ["*2017: The Wind in the Willows starring Rufus Hound, Simon Lipkin, Neil McDermott, Gary Wilmot and Denise Welch"]}, {"page": "Tim Healy (actor)", "response": ["Healy appeared in the film Purely Belter as the abusive father of delinquent teenager Gerry and appeared in Coronation Street as Paul Jones, the father of barman Sean Tully. Healy previously appeared on the show in 1976 as a bingo caller. In 2002 Healy appeared as DS Philip Carter In an episode of Silent Witness. 2003, Healy appeared as Inspector Colin Duggan in an episode of the BBC drama Murder in Mind. In 2009, Healy appeared in the BBC drama Waterloo Road as a Security Guard, Dave Miller, a love interest for Steph Haydock, played by former real life wife, Denise Welch. In 2013, Healy appeared as Eric in the Sky Living Sitcom The Spa for one series.", "When Healy's wife, Denise Welch, was a guest on The Paul O'Grady Show, an apparently aged man came on the show to talk about a subject. He sounded unwell while Welch was speaking, and to her and everyone's surprise, he revealed himself to be Healy. Healy starred in the third series of the ITV comedy Benidorm playing a cross dresser called Lesley. He later became a regular in the fourth series in 2011. His character is really called Les and has a son, Liam.", "Healy married actress Denise Welch in 1988. They had two sons before divorcing in 2012; their oldest son, Matthew, is the lead singer of The 1975. Healy married Joan Anderton in 2015. He is an avid supporter of Newcastle United FC."]}, {"page": "The Jealous God", "response": ["The novel was adapted as a feature film and released to British cinemas in 2005. The writer-director was Steven Woodcock. Jason Merrells played Vincent, Denise Welch played Maureen, and Mairead Carty played Laura. Other actors featured were Marcia Warren (Mrs Dungarvan), Andrew Dunn (Matthew) and Roy Walker (the Monsignor). Allan Gill School boy #4 (uncredited)"]}, {"page": "Through the Keyhole", "response": ["| 7 || Dave BerryJulian ClaryBarbara Windsor || Gino D'AcampoNeil MorrisseyDenise Welch || 15 December 2013 || 3.58"]}, {"page": "Consett", "response": ["*Denise Welch (born 1958), television star of Coronation Street, Soldier Soldier and Waterloo Road"]}, {"page": "Alderley Edge", "response": ["Footballers who live in Alderley Edge include Joleon Lescott and Manchester United players Dwight Yorke, Rio Ferdinand and Michael Carrick. David Beckham and his wife Victoria Beckham previously resided in Alderley Edge. A number of Coronation Street actors, including Helen Flanagan, Denise Welch and Richard Fleeshman, also live in the village. Additionally musicians Bernard Sumner and Peter Hook both live in the village."]}, {"page": "Gabrielle Glaister", "response": ["Glaister returned to soap acting in 2000 when she appeared in Coronation Street as Debs Brownlow, the sister of Natalie Horrocks, played by Denise Welch. Her next soap role was in Channel 5 soap Family Affairs from September 2004 playing Trish Wallace until September 2005. In 2019, Glaister took the role of Hilary Benshaw in Emmerdale, playing rival to Nicola King as they both vied to be elected as a local councillor."]}, {"page": "Octagon Theatre, Bolton", "response": ["*Denise Welch performed in the world premiere production of \"The Ancient Secret of Youth and the Five Tibetans\" by Jim Cartwright."]}, {"page": "Soldier Soldier", "response": ["*Denise Welch as Marsha Stubbs (Series 3-5)"]}, {"page": "Geno Washington", "response": ["Geno appears in the movie A Bit of Tom Jones?, which had its London premiere in 2009. The film, which was made by Tred Films in Tredegar in South Wales, stars Jonny Owen and Roger Evans, with a cast including Matt Berry, John Henshaw and Denise Welch. The film won the BAFTA Cymru \"Best Film\" award in 2010."]}, {"page": "Monkseaton", "response": ["*Denise Welch – actress, dancer and television presenter"]}, {"page": "Bobby Davro", "response": ["*In 2012, he returned to the Derngate Theatre in a production of Cinderella alongside Denise Welch."]}, {"page": "Ebchester", "response": ["*Denise Welch, actress (Coronation Street and Waterloo Road) and TV presenter (Loose Women)."]}, {"page": "Holby City", "response": ["Holby City has featured a number of famous guest stars. Emma Samms, Antonio Fargas, Ronald Pickup and Leslie Phillips made appearances within the show's first few series, and Anita Dobson, Peter Bowles and Susannah York all appeared in the fiftieth episode. Other notable guest stars include Paul Blackthorne, Suzanne Shaw, Geoffrey Hutchings, Richard Todd, Johnny Briggs, Terence Rigby, Michael Obiora, and Lionel Jeffries. Richard Briers appeared as patient George Woodman in the Christmas episode \"Elliot's Wonderful Life\", Eric Sykes played Roger Ludlow, a patient with Alzheimer's disease and Phill Jupitus starred as morbidly obese patient Andy Thompson. Kieron Dyer was in four episodes as an injury prone footballer, Denise Welch had a recurring role as risk manager Pam McGrath, mother of nurse Keri, Clarke Peters appeared for five episodes in 2009 as the father of nurse Donna Jackson, and Graeme Garden had a recurring role from 2003 to 2007 as cardiothoracic consultant Edward Loftwood. Cascade Brown played Sophie Hindmarsh in 2004, Antonio Fargas appeared in 2003 as Victor Garrison, a patient with Parkinson's disease, Sheridan Smith appeared for six episodes in 2001 as teenage stalker Miranda Locke, and David Soul made two appearances as Professor Alan Fletcher. The BBC's William Gallagher wrote in a November 2001 column that Soul's guest-appearance had begun a trend for American actors appearing in UK shows. In 2012, Ron Moody guest starred as patient Vincent Mancini, a war veteran."]}, {"page": "The Chart Show", "response": ["* 1995 - Denise Welch - You Don't Have To Say You Love Me"]}, {"page": "Loose Women", "response": ["Long-running panellists Carol McGiffin, Denise Welch, Jane McDonald and Lisa Maxwell departed from the programme in 2013.", "Denise Welch and Carol McGiffin returned to the show after 5 years away on 7 June 2018 and 5 July 2018 respectively.", "| style=\"text-align:center\" |Denise Welch", "* Loose Women in New York: Let Loose in the City, was released on 8 November 2010. This special featured Carol McGiffin, Sherrie Hewson, Lisa Maxwell and Denise Welch going on a holiday to New York.", "* Christmas with the Loose Women was released in November 2011. This one was also a special extended episode, and was presented by Andrea McLean, Carol McGiffin, Denise Welch and Lisa Maxwell."]}, {"page": "Have I Been Here Before?", "response": ["|Denise Welch"]}]}}