{"wiki_id": "http://www.wikidata.org/entity/Q5257639", "itemLabel": "Denise Coffey", "itemDescription": "British actor and director", "wikipedia_url": "https://en.wikipedia.org/wiki/Denise_Coffey", "wikipedia_page": {"main": "Denise Coffey (born 12 December 1936) is an English actress, director and playwright.", "link_mentions": [{"page": "Do Not Adjust Your Set", "response": ["It helped launch the careers of Denise Coffey, David Jason, Eric Idle, Terry Jones and Michael Palin; the last three became members of the Monty Python comedy troupe soon afterward. Although originally conceived as a children's programme, it quickly acquired a fandom amongst adults, including future Python members John Cleese and Graham Chapman."]}, {"page": "M. R. James", "response": ["On Christmas Day 1987, The Teeth of Abbot Thomas, a James parody by Stephen Sheridan, was broadcast on Radio 4. It starred Alfred Marks (as Abbot Thomas), Robert Bathurst, Denise Coffey, Jonathan Adams and Bill Wallis."]}, {"page": "David Jason", "response": ["Jason started his television career in 1964 playing the part of Bert Bradshaw in Crossroads. In 1967, he played spoof super-hero Captain Fantastic, among other roles, in the children's comedy series Do Not Adjust Your Set (Rediffusion London/ITV) with Eric Idle, Terry Jones, Denise Coffey, and Michael Palin. Humphrey Barclay, who recruited Jason to appear in Do Not Adjust Your Set (partly to counter the more highbrow style of Idle, Jones, and Palin), admired his sense of timing. The programme ended in 1969, and the character then appeared for a time in the Thames Television children's programme Magpie. Jason appeared in the BBC comedy series Hugh and I in 1967, which starred Hugh Lloyd and Terry Scott as two friends who lived together in South London. He appeared in the Randall and Hopkirk (Deceased) episode \"That's How Murder Snowballs\" (1969) as Abel, a framed performer in a major London theatre."]}, {"page": "I'm Sorry I Haven't a Clue", "response": ["* Denise Coffey (1979, 1981, 1983, 1991, 1997)"]}, {"page": "Eric Idle", "response": ["Idle started at Cambridge only a year after future fellow-Pythons Graham Chapman and John Cleese. He became Footlights President in 1965 and was the first to allow women to join the club. Idle starred in the children's television comedy series Do Not Adjust Your Set co-starring his future Python castmates Terry Jones and Michael Palin. Terry Gilliam provided animations for the show. The show's cast also included comic actors David Jason and Denise Coffey. Idle also appeared as guest in some episodes of the television series At Last the 1948 Show, which featured Cleese and Chapman in its principal cast.\"Missing episodes of Monty Python precursor At Last the 1948 Show found\", The Guardian, 16 September 2015. Retrieved 16 September 2015."]}, {"page": "Georgy Girl", "response": ["* Denise Coffey as Peg"]}, {"page": "Shaw Festival", "response": ["In 1980, Christopher Newton joined the company as Artistic Director and continued to foster its development with the addition of a third theatre, the Royal George.  Outstanding directors such as Derek Goldby, Denise Coffey, and Neil Munro (who became Resident Director in the early 1990s) were hired, and the acting ensemble was carefully developed until it was widely recognized to be one of the best in the world."]}, {"page": "Rikki Fulton", "response": ["In 1981, Fulton played Oliphant in the Scottish Theatre Company's production of Robert Kemp's play, Let Wives Tak Tent.Stevenson, Randall (1981). Scottish Theatre Company: First Days, First Nights, in Murray, Glen (ed.), Cencrastus No. 7, Winter 1981 - 82, pp. 10 - 13. In 1982, he made an appearance in the film Gorky Park, where he played a KGB officer. Director Michael Apted chose Fulton for the role because \"he [Apted] had never seen such cruel eyes\". He also performed in Bill Forsyth's Local Hero and Comfort and Joy. In 1985, under the pseudonym \"Rabaith\", Fulton, along with Denise Coffey, adapted the French playwright Molière's, Le Bourgeois Gentilhomme as A Wee Touch o' Class. He performed in the lead role at that year's Edinburgh Fringe; the Festival re-booked it for the following year and it went on tour throughout Scotland."]}, {"page": "The Adventure Game", "response": ["| 4 || 14 June 1980 || 18 October 1980 || 29 || Denise Coffey, Dr. Garry Hunt, Toby Freeman"]}, {"page": "The Burkiss Way", "response": ["The first season of the show starred Denise Coffey, Chris Emmett, Nigel Rees and Fred Harris. From season 2 onwards, the show starred Jo Kendall, Chris Emmett, Nigel Rees and Fred Harris. The series had three producers, announced as \"Simon Brett of Stepney\", \"John Lloyd of Europe\", and \"David Hatch 'of the BBC Hatch'\"."]}, {"page": "Theatre 625", "response": ["|Maurice Denham,Priscilla Morgan,Avis Bunnage,Denise Coffey,Marcus Hammond,Margaret Heald,Winifred Dennis,Norman Scace,Keith Anderson,Richard Hampton,Malcolm Taylor,Don McKillop"]}, {"page": "Julie Stevens (English actress)", "response": ["In 1964, Stevens appeared in the British comedy film Carry On Cleo playing the slave girl Gloria. She also co-starred with Denise Coffey in the 1969–71 ITV comedy series Girls About Town, and appeared in the children's historical comedy series Cabbages and Kings (1972) opposite Johnny Ball and Derek Griffiths."]}, {"page": "Christopher Newton", "response": ["As artistic director, he brought in directors such as Tadeusz Bradecki, Derek Goldby, Denise Coffey, Jackie Maxwell and Neil Munro. Newton also carefully developed the acting company, cultivating talented younger actors with challenging roles and effectively turning company members Jim Mezon, Heath Lamberts, and Fiona Reid into stars.  Newton also widened the mandate of the Shaw Festival (the performance of plays written and set in Bernard Shaw's lifetime, 1856–1950) by programming the works of lesser known playwrights such as Granville Barker, whose entire oeuvre was performed at the Shaw Festival in a series of highly praised productions directed by Neil Munro."]}, {"page": "Captain Fantastic (TV series)", "response": ["The title character was a bowler-hatted, plastic-mac wearing and umbrella carrying superhero played by David Jason. Denise Coffey also appeared as the villainous Mrs Black."]}, {"page": "Natasha Pyne", "response": ["Pyne began her acting career at the Royal Court in a production of John Osborne's Inadmissible Evidence in 1964  Pyne played Ophelia in a Charles Marowitz's adaptation of Shakespeare's 'Hamlet' at the Open Space Theatre at Tottenham Court Road in July 1969. Pyne starred in the Denise Coffey directed production of Brandon Thomas's Charley's Aunt and Oscar Wilde's The Importance of being Earnest at the Young Vic in 1977. She returned to the Royal Court in 1990 in Robert Holman's Rafts and Dreams."]}, {"page": "End of Part One", "response": ["The cast included Sue Holderness, Denise Coffey, Fred Harris, Dudley Stevens, David Simeon, and Tony Aitken. Coffey had appeared in The Burkiss Way's first 6 episodes, but Harris was the only permanent cast member to appear in End of Part One. One of the directors was future feature film director Geoffrey Sax."]}, {"page": "The Boy Who Grew Too Fast", "response": ["| Denise Coffey "]}, {"page": "David Gooderson", "response": ["David Gooderson (born 24 February 1941) is an English actor who has appeared in several television roles. As well as portraying Davros, creator of the Daleks in the Doctor Who serial Destiny of the Daleks, he has appeared in Lovejoy, Mapp & Lucia and A Touch of Frost amongst other roles. Gooderson has also appeared in many radio programmes for the BBC, including The Next Programme Follows Almost Immediately with Bill Wallis, David Jason, Denise Coffey and Jonathan Cecil and Huddwinks with Roy Hudd and others."]}, {"page": "Clarence Derwent Awards", "response": ["* 1970 Denise Coffey as Aurora Botterill in The Bandwagon"]}, {"page": "Deborah Norton", "response": ["| Innocent Bystanders || Gordon Graham || Denise Coffey || Royal Court Theatre"]}, {"page": "Friday Night, Saturday Morning", "response": ["| 11 December 1981 || Geoffrey Robertson || Robyn Archer, Lord Colville, Jan Kavan, Jessica Mitford, Jill Tweedie, Christopher Logue, Denise Coffey, Phillip Hodson"]}, {"page": "Dawn French's Girls Who Do Comedy", "response": ["*Denise Coffey"]}, {"page": "List of people from Aldershot", "response": ["* Denise Coffey - actress"]}, {"page": "Alexei Sayle's Merry-Go-Round", "response": ["The continuing adventures of Bobby Chariot were chronicled. Now free from any obligation to be Alexei's warm-up man, he traversed a series of other career cul-de-sacs under the appalling management of the repulsive \"Edna\" (played by Denise Coffey). Meanwhile, Alexei Sayle himself was depicted as living in a Teletubbies-style burrow somewhere in the posh part of North London."]}, {"page": "Sir Henry at Rawlinson End (film)", "response": ["*Denise Coffey as Mrs E"]}, {"page": "Alison and Maud", "response": ["Alison and Maud is a radio programme written by Sue Limb which aired in two series from December 2002 to April 2004. There were twelve 25 minute episodes in total and it was originally broadcast on BBC Radio 4 and has subsequently been repeated on BBC Radio 7 and BBC Radio 4 Extra. It stars Denise Coffey and Miriam Margolyes together with other cast members of Limb's previous Radio 4 comedy series The Wordsmiths at Gorsemere."]}, {"page": "List of British films of 1983", "response": ["|Another Time, Another Place || Michael Radford || Phyllis Logan, Denise Coffey || Drama ||"]}, {"page": "The Next Programme Follows Almost Immediately", "response": ["The programme starred Bill Wallis, David Jason, Denise Coffey, David Gooderson and Jonathan Cecil. The basic story revolved around a comedy factory, Allied British Comedy, with manager CMD (Wallis) and secretary/announcer Iris (Coffey)."]}, {"page": "Bonzo Dog Doo-Dah Band", "response": ["Around this time they were also hired as the resident band on Do Not Adjust Your Set, an afternoon children's television comedy show notable for starring several future members of Monty Python (Eric Idle, Terry Jones and Michael Palin), Denise Coffey, and David Jason in the cast. The band performed every week as well as sometimes participating in sketches."]}, {"page": "Doctor in Distress (film)", "response": ["*Denise Coffey as Food seller at Railway Station"]}, {"page": "The Wild and the Willing", "response": ["* Denise Coffey as Jane"]}, {"page": "Just a Minute", "response": ["*Denise Coffey"]}, {"page": "List of The Tomorrow People serials", "response": ["| colspan=\"5\" | Guest Cast: Jean Marsh (Eliza Jeffries / Doctor Culex), Connie Booth (Doctor Lucy Connor), Denise Coffey (Aunt Ruth Tanner), Roger Sloman (Inspector Platt), Adam Blackwood (Doctor Poole), Sally Sagoe (Mrs Jackson), Deborah Vale and Tessa Vale (The Twins), Jeff Harding (General Damon), Bazil Otoin (Jim), Richard Rees (Doctor Leong), Janet Amsden (Commander Scott), Nicky Twining (Richie Conrad) "]}, {"page": "Farewell Performance", "response": ["* Denise Coffey – Dickie"]}]}}