{"wiki_id": "http://www.wikidata.org/entity/Q5261565", "itemLabel": "Frances Vane, Marchioness of Londonderry", "itemDescription": "British noble", "wikipedia_url": "https://en.wikipedia.org/wiki/Frances_Vane,_Marchioness_of_Londonderry", "wikipedia_page": {"main": "Frances Anne Vane, Marchioness of Londonderry (17 January 1800 – 20 January 1865) was a wealthy English heiress and noblewoman. She was the daughter of Sir Henry Vane-Tempest, 2nd Baronet. She married Charles William Stewart, 1st Baron Stewart. She became a marchioness in 1822 when Charles succeeded his half-brother as 3rd Marquess of Londonderry.", "link_mentions": [{"page": "George Spencer-Churchill, 8th Duke of Marlborough", "response": ["His paternal grandparents were George Spencer-Churchill, 6th Duke of Marlborough, and Lady Jane Stewart, daughter of Admiral George Stewart, 8th Earl of Galloway. His maternal grandparents were Charles Vane, 3rd Marquess of Londonderry and Frances Vane, Marchioness of Londonderry."]}, {"page": "Frances Anne Vane, Marchioness of Londonderry", "response": ["#REDIRECT Frances Vane, Marchioness of Londonderry"]}, {"page": "Frances Anne Emily Vane-Tempest", "response": ["#REDIRECT Frances Vane, Marchioness of Londonderry"]}, {"page": "2nd (Seaham) Durham Artillery Volunteer Corps", "response": ["The town of Seaham had been largely built by Charles Vane, 3rd Marquess of Londonderry, who owned Seaham Colliery and constructed Seaham Harbour. In 1860, his widow, Frances Vane, Marchioness of Londonderry, equipped a company raised for the 2nd Durham AVC from the colliery. Two further companies were raised by the Mann brothers, local timber merchants, and a fourth from the bottlemakers of John Candlish's Londonderry Bottle Works.Beckett, p. 62.Londonderry at Burke's."]}, {"page": "Frances Vane", "response": ["* Frances Vane, Marchioness of Londonderry, English heiress and noblewoman"]}, {"page": "Martha Wilmot", "response": ["Wilmot toured the southwest of Ireland the following summer, and was presented at the lord lieutenant's court in Dublin Castle in 1810. There she met the future Lady Morgan, Sydney Owenson, author of The Wild Irish Girl. She moved to live with her parents in Clifton, Derbyshire in 1810 and married Rev. William Bradford in 1812. The couple had one son and two daughters, living at Sussex Downs, Storrington. She travelled to France with Katherine in 1817, and visited her at Moulins in 1818. When her husband was appointed chaplain to the British embassy in Vienna, the family moved there in 1819. Living there for there for the next 10 years, they were friends with Charles William, the British ambassador, and his wife Frances Vane, Marchioness of Londonderry. From 1820 to 1821, Wilmot and her family toured Italy, with her diaries of the period held in the Royal Irish Academy (RIA). The family returned to Storrington in 1829 when her husband was appointed chaplain-in-ordinary to King George IV."]}, {"page": "Lady Frances Anne Londonderry", "response": ["#REDIRECT Frances Vane, Marchioness of Londonderry"]}, {"page": "Frances Vane-Tempest, Marchioness of Londonderry and Countess of Antrim", "response": ["#REDIRECT Frances Vane, Marchioness of Londonderry"]}, {"page": "Frances Vane-Tempest, Marchioness of Londonderry", "response": ["#REDIRECT Frances Vane, Marchioness of Londonderry"]}, {"page": "Frances Vane-Tempest, Countess of Antrim", "response": ["#REDIRECT Frances Vane, Marchioness of Londonderry"]}]}}