{"wiki_id": "http://www.wikidata.org/entity/Q5262008", "itemLabel": "Derek Hall", "itemDescription": "English football player (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Hall_(footballer,_born_1965)", "wikipedia_page": {"main": "Derek Robert Hall (born 5 January 1965) is an English former professional footballer. He was born in Ashton-under-Lyne and is currently senior coach at Port Adelaide Lion F.C. in the South Australian Premier League.\nHall began his career as an apprentice with Coventry City, turning professional in October 1982 and making his only league appearance for the Sky Blues later that season. He joined Torquay United on loan in March 1984, earning himself a permanent move on a free transfer at the end of the season.\nIn July 1985 he moved to Swindon Town, again on a free transfer, but struggled to settle at the County Ground and moved to Southend United on a free the following August. He settled in well at Roots Hall, playing 123 times over the next 3 seasons, scoring 15 goals in the process, before moving to Halifax Town on a free transfer in July 1989. His next move, after 4 goals in 49 games for Halifax, took him to Hereford United, once more on a free transfer, in July 1991. He was appointed captain of the Hereford side and was ever-present in the 1993–94 season, before becoming part of Greg Downs's clearout at Edgar Street, Hall moving to Rochdale for a fee of £10,000 in August 1994. He made only 24 appearances for 'Dale, scoring twice and despite not being a regular had a chant (to the tune of Wonderwall) invented in his honour.He joined Altrincham on loan in December 1995 and was released by Rochdale at the end of the season, joining non-league Hyde United. He later moved on to Stalybridge Celtic, Curzon Ashton and Woodley Sports, also playing for Buxton and managing them during the 1998–99 season, before rejoining Curzon Ashton in July 2000 as player-coach. He emigrated to Australia in June 2002, but was back as assistant manager of Curzon Ashton by at least November 2005.Currently Derek is the Senior Coach at Port Adelaide Lion which plays in the South Australian Premier League in Adelaide, Australia, and Coaching Director at the J & L Consulting Football (Soccer) Academy", "link_mentions": [{"page": "List of Torquay United F.C. seasons", "response": ["|align=left|Derek HallMario Walsh||5"]}, {"page": "Derek Hall", "response": ["Derek Hall may refer to:", "*Derek Hall (Australian footballer) (born 1970), Australian rules footballer", "*Derek Hall (cricketer) (1932–1983), English cricketer", "*Derek Hall (footballer, born 1965), English footballer", "*Derek Hall (academic) (1924–1975), president of Corpus Christi College, Oxford"]}, {"page": "Nathan Munson", "response": ["Born in Colchester, Gilberd School student Munson was brought through the Colchester United youth system and was handed his first-team debut by Roy McDonough at the end of the 1992–93 season. The game against Wrexham finished 4–3 to the Welsh club, conceding an 89th-minute winner from Steve Watkin on 8 May 1993. His next appearance for the club came in bizarre circumstances as Colchester became the first club to have two goalkeepers sent off in the same fixture. The game against Hereford United on 16 October 1993 saw John Keeley sent off in the 43rd minute, the U's already 1–0 down from a Chris Pike goal. Roy McDonough covered in goal until half time, where he conceded another goal to Pike. Munson was brought on at half time but was sent off in the 68th minute after conceding to Chris Fry and Pike once again, giving him a hat-trick, scoring against three different goalkeepers in the same game. McDonough returned to goal following Munson's dismissal and conceded again, this time to Derek Hall in the 88th minute to result in a disastrous 5–0 loss."]}, {"page": "List of Rochdale A.F.C. players (25–99 appearances)", "response": ["|Derek Hall"]}]}}