{"wiki_id": "http://www.wikidata.org/entity/Q5261836", "itemLabel": "Derek Brewer", "itemDescription": "Cricket administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Brewer_(cricket_administrator)", "wikipedia_page": {"main": "Derek Michael Brewer (born 1958) was the Secretary and Chief Executive of Marylebone Cricket Club (MCC) from 2011 to 2017. Brewer was appointed chief executive at the end of 2011 following Keith Bradshaw's unexpected resignation and stepped down from the post in October 2017.\n\nBrewer attended Leighton Park School before going up to Aston University, graduating with a BSc degree in Business Administration; he also played cricket for Warwickshire 2nd XI as a bowler. He then forged a career in banking and finance, before making his name as Chief Executive of Nottinghamshire CCC from 2005 until 2012.As MCC's Secretary and Chief Executive since May 2012, Brewer's first task was high profile in overseeing Lord's Cricket Ground's hosting archery competitions for London2012, and then, within just two weeks, returning Lord's as a world-class cricket venue in readiness for 2012's last Test match of the season between the then top two world cricketing nations: England and South Africa.Annually Lord's hosts the English One Day Cricket Final as well as prestigious international matches. In addition, Brewer has dealt with ongoing controversy and internal club disputes (including Sir John Major's public committee resignation) over a redevelopment plan that included construction of residential flats on some of the MCC site.Brewer was also responsible for MCC's monitoring of the Spirit of Cricket and guardianship of the Laws of Cricket.", "link_mentions": [{"page": "Leighton Park School", "response": ["*Derek Brewer, Secretary and Chief Executive of Marylebone Cricket Club"]}, {"page": "Derek Brewer", "response": ["Brewer was one of the most recognized Chaucer scholars of modern times—his Chaucer and His World (1978, reissued 2000) \"could be said to have started a whole new genre in historical literary biography.\"Derek Brewer Obituary, The Daily Telegraph (online) He was also the founder in 1972 of an academic press named for him, D. S. Brewer, now Boydell & Brewer, which made a mark publishing scholarly work neglected by the larger presses.", "He died in Cambridge, England, a month after the death of his wife Elisabeth. Obituaries in all the main British newspapers and blogs in the US speak highly of his love of literature and the profession,Derek Brewer Obituary, Unlocked Wordhoard (blog) his advocacy of struggling academics of the medieval period to get their work published,Derek Brewer Obituary, The Independent his encouragement of female students (a rarity in the medieval field during much of his lifetime), and his courtesy and friendliness.Derek Brewer Obituary, The Guardian", "*Geoffrey Chaucer, The Parlement of Foulys. Ed. Derek Brewer. London: Nelson, 1960.", "*Chaucer, the Critical Heritage. Ed. Derek Brewer. London, Boston: Routledge & Kegan Paul, 1978. .", "*Studies in Medieval English Romances: Some New Approaches. Ed. Derek Brewer. Cambridge: Brewer, 1988.", "*A Companion to the Gawain-Poet.  Ed. Derek Brewer and Jonathan Gibson.  Cambridge: D.S. Brewer, 1997.  ."]}, {"page": "Old Leightonians Cricket Club", "response": ["The Old Leightonians Cricket Club was founded by Graham Carter and Martin Wigram on Sunday 27 February 1977 at the Jolly Farmer pub in Puttenham, Surrey, with Carter taking the jobs of Club Secretary and Statistician while Wigram assumed the role of Fixture Secretary. A list of eight fixtures was drawn up for the 1977 season, beginning with the annual fixture against the Leighton Park School 1st XI. Held on 21 May, a side made up of Leighton Park alumni from the 1950s, 1960s and 1970s was assembled to take part in the club's inaugural match. Dominic Beer faced the first ball and Andrew Moss top-scored with 51 not out as the OLCC declared on 177–8. In reply, the school 1st XI were well set on 106–1 before the OL captain, Derek Brewer, swung the match decisively in the old boys' favour with a devastating spell of 14–8–18–7, which remained the best figures for over 30 years. Brewer finished the match with a hat-trick as the school 1st XI were bowled out for 128, giving the OLCC a 49-run victory. Later that season the club embarked on its first tour, playing three games in Suffolk at the start of July.", "* Derek Brewer, active 1977–2005. Stalwart of the OLCC, especially during the early years, making 44 appearances for the club. In the OLCC's first ever game, Brewer claimed 7–18, which for more than 33 years were the best figures recorded by an OLCC bowler. He has the distinction of taking two hat-tricks, in 1977 and 1979. Formerly the chief executive of Nottinghamshire County Cricket Club from 2005 to 2011, Brewer is now the Secretary & chief executive of the MCC.", "* 1978–80, 1987: Derek Brewer BC"]}, {"page": "Derek Brewer (cricketer)", "response": ["#REDIRECT Derek Brewer (cricket administrator)"]}]}}