{"wiki_id": "http://www.wikidata.org/entity/Q526761", "itemLabel": "Catherine Webb", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Catherine_Webb", "wikipedia_page": {"main": "Catherine Webb (born 1986) is a British author, educated at the Godolphin and Latymer School, London, and the London School of Economics. She was 14 years old when she completed Mirror Dreams, which was written during her school holidays. Her father is author and publisher Nick Webb and he suggested she should send the manuscript to an agent he knew, who eventually offered to represent her. The book was published in 2002 by Atom Books, part of Time Warner (now Hachette Book Group), and Webb was named Young Trailblazer of the Year by the magazine CosmoGirl UK. She has published eight young adult novels, all with Atom Books, and studied at the Royal Academy of Dramatic Art, from which she graduated in 2010.A lifelong Londoner, Webb enjoys walking through the areas she describes in her books – Bethnal Green, Clerkenwell, and along the River Thames – comparing the city of London as it is now with how it was at various times in the past. She appeared in CosmoGirl in 2006/7 in an interview. She also appeared in online interviews with CBBC and nzgirl when she was 15, and also with the Telegraph, which described her as a teen queen.Catherine Webb also writes fantasy novels for adults under the name Kate Griffin, and she writes science-fiction as Claire North.", "link_mentions": [{"page": "List of fantasy authors", "response": ["* Claire North, pseudonym for Catherine Webb, author of The First Fifteen Lives of Harry August", "* Catherine Webb, (born 1986) author of Mirror Dreams"]}, {"page": "Urban fantasy", "response": ["* Catherine Webb (Matthew Swift and Magicals Anonymous series)"]}, {"page": "Devil in the arts and popular culture", "response": ["*Catherine Webb's Waywalkers (2003)"]}, {"page": "List of young adult writers", "response": ["*Catherine Webb: Mirror Dreams, Mirror Wakes, Timekeepers, Waywalkers"]}, {"page": "Godolphin and Latymer School", "response": ["* Catherine Webb, author"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Catherine Webb (Stage Electrics and Lighting Design Diploma 2010)"]}, {"page": "Kate Griffin", "response": ["* Kate Griffin, a pseudonym used by fantasy author Catherine Webb"]}, {"page": "List of fiction employing parallel universes", "response": ["*In Mirror Dreams (2002) and Mirror Wakes (2003) by Catherine Webb, there are mirror universes, one a magical universe where technology barely works, the other a scientific universe where magic barely works. The inhabitants can physically visit each other's worlds in dreams."]}, {"page": "List of time travel works of fiction", "response": ["| Catherine Webb"]}]}}