{"wiki_id": "http://www.wikidata.org/entity/Q5262394", "itemLabel": "Derek Taunt", "itemDescription": "British cryptographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Taunt", "wikipedia_page": {"main": "Derek Roy Taunt (16 November 1917(Note 1) – 15 July 2004) was a British mathematician who worked as a codebreaker during World War II at Bletchley Park.\nTaunt attended Enfield Grammar, then the City of London School. He studied mathematics at Jesus College, Cambridge between 1936 and 1939. He was accepted as a research student by G. H. Hardy, but this was postponed by the outbreak of World War II. Taunt registered with the Joint Recruiting Board, and was initially allocated to work on ballistics at Kemnal Manor in Chislehurst, preparing range tables for new weapons. Finding that the task required only trivial mathematics (\"more like advanced arithmetic than real mathematics\"), he sought more appropriate work.\nIn August 1941 he was moved to Bletchley Park and assigned to Hut 6, the section in charge of decrypting German Army and Air Force Enigma signals. While there, he was best man at the marriage of co-workers Bob Roseveare and Ione Jay.\nAfter his wartime work, he returned to Cambridge, and worked on group theory. He was a research student (1945), wrote a doctoral dissertation under Philip Hall, won a Smith's Prize in 1949, and was a Lecturer from 1949 with the honorific title of 'Cayley Lecturer' from 1965 until retirement in 1982. As a Fellow of Jesus College he was at various times a director of studies, tutor, bursar, and from 1979 to 1982 was President.  In 1982 he became Emeritus Fellow, \"with most of the privileges and none of the duties of a Fellow.\" His doctoral students include Roger Carter.\nOn 18 December 1952 Taunt was elected a member of the London Mathematical Society. He was married to the English artist Angela Verren with who he had three children.", "link_mentions": [{"page": "Bletchley Park", "response": ["Denniston recognised, however, that the enemy's use of electromechanical cipher machines meant that formally trained mathematicians would also be needed; Oxford's Peter Twinn joined GC&CS in February 1939; Cambridge's Alan Turing and Gordon Welchman began training in 1938 and reported to Bletchley the day after war was declared, along with John Jeffreys. Later-recruited cryptanalysts included the mathematicians Derek Taunt, in  Jack Good, Bill Tutte, Appendix 4 in  and Max Newman; historian Harry Hinsley, and chess champions Hugh Alexander and Stuart Milner-Barry. Joan Clarke was one of the few women employed at Bletchley as a full-fledged cryptanalyst."]}, {"page": "Index of cryptography articles", "response": ["Derek Taunt   •"]}, {"page": "Cryptanalysis of the Enigma", "response": ["Foremost amongst the knowledge needed for identifying cribs was the text of previous decrypts. Bletchley Park maintained detailed indexes of message preambles, of every person, of every ship, of every unit, of every weapon, of every technical term and of repeated phrases such as forms of address and other German military jargon. For each message the traffic analysis recorded the radio frequency, the date and time of intercept, and the preamble—which contained the network-identifying discriminant, the time of origin of the message, the callsign of the originating and receiving stations, and the indicator setting. This allowed cross referencing of a new message with a previous one. Thus, as Derek Taunt, another Cambridge mathematician-cryptanalyst wrote, the truism that \"nothing succeeds like success\" is particularly apposite here.", "With a combination of probable plaintext fragment and the fact that no letter could be enciphered as itself, a corresponding ciphertext fragment could often be tested by trying every possible alignment of the crib against the ciphertext, a procedure known as crib-dragging. This, however, was only one aspect of the processes of solving a key. Derek Taunt has written that the three cardinal personal qualities that were in demand for cryptanalysis were (1) a creative imagination, (2) a well-developed critical faculty, and (3) a habit of meticulousness. Skill at solving crossword puzzles was famously tested in recruiting some cryptanalysts. This was useful in working out plugboard settings when a possible solution was being examined. For example, if the crib was the word WETTER (German for \"weather\") and a possible decrypt before the plugboard settings had been discovered, was TEWWER, it is easy to see that T with W are stecker partners. These examples, although illustrative of the principles, greatly over-simplify the cryptanalysts' tasks."]}, {"page": "Bursar", "response": ["* Codebreaker Derek Taunt (1917–2004), Jesus College, Cambridge"]}, {"page": "Howard Smith (diplomat)", "response": ["Educated at Sidney Sussex College, Cambridge,Obituary: Sir Howard Smith The Independent, 10 May 1996 Smith worked at Bletchley Park during World War II and later  became the British ambassador to Moscow.Derek Taunt, \"Breaking German Naval Enigma\", p. 111 in Action this Day, edited by Ralph Erskine and Michael Smith, 2001, . At college in Cambridge, Smith was a contemporary of Asa Briggs, playing chess with him and recommending Briggs to fellow Cambridge mathematician Gordon Welchman for service in Hut 6."]}, {"page": "Hut 6", "response": ["* Helen C. Stanley-Baker, Oxford mathematics studentBletchley Park Summary of Service, 2013* Derek Taunt, Cambridge research student ", "* Derek Taunt, \"Hut 6: 1941-1945\", pp. 100–112 in Codebreakers: The Inside Story of Bletchley Park', edited by F. H. Hinsley, and Alan Stripp, Oxford University Press, 2003"]}, {"page": "List of people associated with Bletchley Park", "response": ["* Derek Taunt, arrived in Bletchley Park in August 1941, worked in Hut 6 (mathematician, later bursar of Jesus College, Cambridge)"]}, {"page": "Roger Carter (mathematician)", "response": ["Roger W. Carter is an emeritus professor at the University of Warwick. He defined Carter subgroups and wrote the standard reference Simple Groups of Lie Type. He obtained his PhD at the University of Cambridge in 1960 and his dissertation was entitled Some Contributions to the Theory of Finite Soluble Groups, with Derek Taunt as thesis advisor."]}, {"page": "Category talk:Academics of the University of Cambridge", "response": ["Derek Tauntnot yet classified"]}, {"page": "Bob Roseveare", "response": ["Roseveare met his future wife in Hut 6, Ione Jay, full name Katherine Ione Jay. They married on 7 August 1947, with Derek Taunt as best man. His friend from Marlborough, Nigel Forward, Dennis Babbage and three others in Hut 6 also met their wives there. "]}, {"page": "List of people from the London Borough of Enfield", "response": ["*Derek Taunt "]}, {"page": "Derek", "response": ["*Derek Taunt (1917–2004), British mathematician and codebreaker"]}, {"page": "Enfield Grammar School", "response": ["*Derek Taunt, mathematician and Bletchley Park codebreaker"]}, {"page": "List of Old Citizens", "response": ["*Derek Taunt – Mathematician and cryptologistDerek Taunt – Daily Telegraph"]}, {"page": "Signals intelligence in modern history", "response": ["Denniston recognised, however, that the enemy's use of electromechanical cipher machines meant that formally trained mathematicians would be needed as well; Oxford's Peter Twinn joined GC&CS in February 1939; Cambridge's Alan Turing and Gordon Welchman began training in 1938 and reported to Bletchley the day after war was declared, along with John Jeffreys. Later-recruited cryptanalysts included the mathematicians Derek Taunt, Jack Good, Bill Tutte, Appendix 4 and Max Newman; historian Harry Hinsley, and chess champions Hugh Alexander and Stuart Milner-Barry."]}, {"page": "Angela Verren", "response": ["Verren was born in Hampstead in north London and studied at King's College, London. For many years Verren painted and sketched in Britain and abroad at Tuscany and Greece and had exhibitions in both London and Cambridge, with her works often showing forms abstracted from nature. After marrying the Cambridge mathematician Derek Taunt and raising three children, Verren resumed her painting and exhibition career. In 1970 she met the artist Ben Nicholson who became a good friend and a great influence on her art, and who wrote the introduction to her 1978 solo exhibition at the Crane Kalman Gallery in London. After Nicholson's death, Verren became the copyright holder for his artworks."]}]}}