{"wiki_id": "http://www.wikidata.org/entity/Q5262123", "itemLabel": "Derek Lambert", "itemDescription": "Journalist, Author", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Lambert_(author)", "wikipedia_page": {"main": "Derek (William) Lambert (10 October 1929 – 10 April 2001.) was educated at Epsom College and was both an author of thrillers in his own name, writing also as Richard Falkirk, and a journalist.\nAs a foreign correspondent for the Daily Express, he spent time in many exotic locales that he later used as settings in his novels, the first of which, Angels in the Snow, was published in 1969. Between 1972 and 1977 he wrote a series of six novels beginning with Blackstone about a member of the Bow Street Runners in the 1820s.\nHis 1975 novel Touch the Lion's Paw was adapted to film as Rough Cut.", "link_mentions": [{"page": "1985 in literature", "response": ["*Derek Lambert – The Man Who Was Saturday"]}, {"page": "1983 in literature", "response": ["*Derek Lambert – The Judas Code"]}, {"page": "1982 in literature", "response": ["*Derek Lambert – The Red Dove"]}, {"page": "1980 in literature", "response": ["* Derek Lambert –  I, Said the Spy"]}, {"page": "1978 in literature", "response": ["*Derek Lambert – The Saint Peter's Plot"]}, {"page": "1977 in literature", "response": ["*Derek Lambert – Blackstone on Broadway"]}, {"page": "1976 in literature", "response": ["*Derek Lambert – Blackstone Underground"]}, {"page": "1975 in literature", "response": ["*Derek Lambert – Touch the Lion's Paw"]}, {"page": "1974 in literature", "response": ["*Derek Lambert "]}, {"page": "1973 in literature", "response": ["*Derek Lambert "]}, {"page": "1972 in literature", "response": ["*Derek Lambert "]}, {"page": "1969 in literature", "response": ["*Derek Lambert "]}, {"page": "Horrorscope", "response": ["*Horrorscope, a novel by Derek Lambert"]}, {"page": "Vendetta", "response": ["*Vendetta, a novel by Derek Lambert"]}, {"page": "Rough Cut (1980 film)", "response": ["Rough Cut is a 1980 American heist film written by Larry Gelbart, directed by Don Siegel, and starring Burt Reynolds, Lesley-Anne Down and David Niven. It was based on the novel Touch the Lion's Paw (1975) by Derek Lambert."]}, {"page": "Blackstone (novel)", "response": ["Blackstone is a 1972 historical thriller novel by the British writer Derek Lambert, published under the pen name Richard Falkirk. It is the first in a series of novels featuring Edmund Blackstone, a member of the Bow Street Runners in the 1820s.Burton p.233 Blackstone is assigned the job of protecting the young Princess Victoria, a task he initially considers a waste of time but which soon proves to be dangerous.", "Category:Novels by Derek Lambert "]}, {"page": "Deaths in April 2001", "response": ["*Derek Lambert, 71, English author."]}, {"page": "Touch the Lion's Paw", "response": ["Touch the Lion's Paw is a 1975 thriller novel by the British writer Derek Lambert. The plot revolves around a major diamond heist carried out in Amsterdam.Burton p.233", "Category:Novels by Derek Lambert "]}, {"page": "Angels in the Snow", "response": ["Angels in the Snow is a 1969 thriller novel by the British writer Derek Lambert. It is set amongst the western community in the Soviet capital Moscow, mainly journalists and diplomats. Lambert was working as the Daily Express correspondent in Moscow at the time and had to smuggle the manuscript back to Britain. It was a critical and commercial success.Burton p. 233. ", "Category:Novels by Derek Lambert"]}, {"page": "The Yermakov Transfer", "response": ["The Yermakov Transfer is a 1974 thriller novel by the British writer Derek Lambert. The life of the Soviet President is threatened by a plan to kidnap him on the Trans-Siberian Express.Burton p.233", "Category:Novels by Derek Lambert "]}, {"page": "The Red House (Lambert novel)", "response": ["The Red House is a 1972 thriller novel by the British writer Derek Lambert. A leading Soviet Astronaut defects to the West.Burton p.233", "Category:Novels by Derek Lambert "]}, {"page": "The Kites of War", "response": ["The Kites of War is a 1969 thriller novel by the British writer Derek Lambert. It is set on the Chinese-Indian frontier, where Lambert had worked as a foreign correspondent.Burton p.233", "Category:Novels by Derek Lambert "]}, {"page": "I, Said the Spy", "response": ["I, Said the Spy is a 1980 thriller novel by the British writer Derek Lambert.Burton p.233", "Category:Novels by Derek Lambert "]}, {"page": "The Saint Peter's Plot", "response": ["The Saint Peter's Plot is a 1978 thriller novel by the British writer Derek Lambert. During the closing stage of the Second World War, the Nazis hatch a plot to save their leaders from disaster.Burton p.233", "Category:Novels by Derek Lambert "]}, {"page": "The Red Dove", "response": ["The Red Dove is a 1982 thriller novel by the British writer Derek Lambert.Stone p.258", "Category:Novels by Derek Lambert "]}, {"page": "The Judas Code", "response": ["The Judas Code is a 1983 thriller novel by the British writer Derek Lambert.Stone p.405 During the Second World War in neutral Lisbon, British intelligence work to try and lure Nazi Germany and the Soviet Union into a vicious attritional war with each other.", "Category:Novels by Derek Lambert "]}, {"page": "The Man Who Was Saturday", "response": ["The Man Who Was Saturday is a 1985 thriller novel by the British writer Derek Lambert. An American defector to the Soviet Union schemes to return home against the best efforts of the KGB.Stone p.433", "Category:Novels by Derek Lambert "]}, {"page": "The Killing House (novel)", "response": ["The Killing House is a 1997 thriller novel. It is the final novel of the British writer Derek Lambert and features a plot set against the backdrop of the Northern Irish peace process.Burton p.233", "Category:Novels by Derek Lambert "]}, {"page": "Blackstone's Fancy", "response": ["Blackstone's Fancy is a 1973 historical thriller novel by the British writer Derek Lambert, published under the pen name Richard Falkirk. It is the second in a series of novels featuring Edmund Blackstone, a member of the Bow Street Runners in the pre-Victorian era. Blackstone gets mixed up in the world of prizefighting.Bailey p.152", "Category:Novels by Derek Lambert "]}, {"page": "Beau Blackstone", "response": ["Beau Blackstone is a 1973 historical thriller novel by the British writer Derek Lambert, published under the pen name Richard Falkirk. It is the third in a series of six novels featuring Edmund Blackstone, a member of the Bow Street Runners in the pre-Victorian era.Nash & Kilda p.165 Blackstone goes undercover amongst a gang of navvies working on a new railway, and is called on for plans to thwart the first Great Train Robbery.", "Category:Novels by Derek Lambert "]}, {"page": "Blackstone and the Scourge of Europe", "response": ["Blackstone and the Scourge of Europe is a 1974 historical thriller novel by the British writer Derek Lambert, published under the pen name Richard Falkirk.Adamson p.222 It is the fourth in a series of six novels featuring Edmund Blackstone, a member of the Bow Street Runners in the pre-Victorian era. It is 1820 and George IV orders Blackstone to the island of St Helena, where the imprisoned former French Emperor Napoleon may be plotting to escape.", "Category:Novels by Derek Lambert "]}, {"page": "Blackstone Underground", "response": ["Blackstone Underground is a 1976 historical thriller novel by the British writer Derek Lambert, published under the pen name Richard Falkirk. It is the fifth in a series of six novels featuring Edmund Blackstone, a member of the Bow Street Runners in the pre-Victorian era.Pronzini & Muller p.240  While trying to decide how to rescue a boy sentenced to death from Newgate Prison, Blackstone is called upon to thwart a gang plotting to rob the Bank of England.", "Category:Novels by Derek Lambert "]}, {"page": "Blackstone on Broadway", "response": ["Blackstone on Broadway is a 1977 historical thriller novel by the British writer Derek Lambert, published under the pen name Richard Falkirk. It is the final entry in a series of six novels featuring Edmund Blackstone, a member of the Bow Street Runners in the pre-Victorian era.Pronzini & Muller p.240 Blackstone is assigned to assist the New York City police force, but has his own schemes to pursue while there.", "Category:Novels by Derek Lambert "]}]}}