{"wiki_id": "http://www.wikidata.org/entity/Q5262330", "itemLabel": "Derek Saunders", "itemDescription": "English footballer (1928-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Saunders", "wikipedia_page": {"main": "Derek Saunders (6 January 1928 – 3 March 2018) was an English footballer who played for Chelsea during the 1950s.", "link_mentions": [{"page": "Ted Drake", "response": ["Without much ado he was appointed manager of First Division Chelsea in June 1952. This is so due to the rivalry between the Gunners and the Blues being non existent at the time. Upon Drake's arrival at Chelsea, he made a series of sweeping changes, doing much to rid the club of its previous amateurish, music hall image. He discarded the club's Chelsea pensioner crest and with it the Pensioners nickname, and insisted a new one be adopted. From these changes came the Lion Rampant Regardant crest and the Blues nickname. He introduced scouting reports and a new, tougher, training regime based on ballwork, a rare practice in English football at the time. The club's previous policy of signing unreliable big-name players was abandoned; Drake instead used his knowledge of the lower divisions and the amateur game to recruit little-known, but more reliable players. These included John McNichol, Frank Blunstone, Derek Saunders, Jim Lewis and Peter Sillett"]}, {"page": "London XI", "response": ["Team: Ron Reynolds (Tot), Peter Sillett (Che), Jim Fotheringham (Ars), Stan Willemse (Che), Ken Armstrong (Che), Derek Saunders (Che), Harry Hooper (Wes), Johnny Haynes (Ful), Cliff Holton (Ars), Eddie Firmani (Cha), Billy Kiernan (Cha).", "Team: Jack Kelsey (Ars), Stan Charlton (Ars), Peter Sillett (Che), Ken Coote (Bre), Bill Dodgin (Ars), Derek Saunders (Che), Roy Dwight (Ful), Jimmy Greaves (Che), Cliff Holton (Ars), Johnny Haynes (Ful), Billy Kiernan (Cha)."]}, {"page": "Ware F.C.", "response": ["* Derek Saunders"]}, {"page": "List of Chelsea F.C. players", "response": ["! scope=\"row\" data-sort-value=\"Saunders, Derek\" |  Derek Saunders"]}, {"page": "History of Chelsea F.C.", "response": ["In 1954–55, the club's jubilee year, everything clicked. The team found a consistency rate not previously there as Chelsea unexpectedly won the First Division title. It included goalkeeper Charlie 'Chic' Thomson, amateur players Derek Saunders and Jim Lewis, central midfielder Johnny \"Jock\" McNichol, wingers Eric \"Rabbit\" Parsons and Frank Blunstone, defender Peter Sillett and future England manager Ron Greenwood in central defence, as well old club stalwarts, right back Ken Armstrong, left-back Stan Willemse and veteran defender John Harris. Perhaps the only genuine star in the side was captain, top-scorer (with 21 league goals) and England international Roy Bentley."]}, {"page": "Jim Lewis (footballer, born 1927)", "response": ["In the days when the disparity between the pay of amateur and professional footballers was minimal, Lewis never turned professional, although his Chelsea teammate Derek Saunders, who also played for Walthamstow, did. He juggled his playing time with working as a salesman for Thermos flasks which, unlike many of his fellow players, allowed him to have a car. With Roy Bentley established as the Chelsea's centre forward, Lewis was switched to either outside or inside left. He made his Chelsea debut in October 1952 against Charlton Athletic and scored in a 2–2 draw."]}, {"page": "Stan Willemse", "response": ["Born in Brighton, Willemse served in the Royal Marines during the Second World War, and began his football career with Brighton & Hove Albion before signing for Londoners Chelsea in 1949 for £6,000, a sum which helped fund rebuilding work at Brighton's Goldstone Ground. He earned a reputation as a hard-tackling defender whilst with the club, and formed the backbone of the team which won the League Championship in 1954–55, alongside the likes of Roy Bentley, Ken Armstrong, Eric Parsons and Derek Saunders, playing 39 games that season."]}, {"page": "Derek", "response": ["*Derek Saunders (1928–2018), English footballer", "*Derek Saunders (1928–2018), English footballer"]}, {"page": "1954–55 Chelsea F.C. season", "response": ["|  Derek Saunders"]}, {"page": "Football at the 1952 Summer Olympics – Men's team squads", "response": ["| MF ||align=\"left\"| Derek Saunders || January 6, 1928 || 24 || ? ||align=\"left\"|  Walthamstow Avenue F.C. || 1 || 0 || 120 || – || – || –"]}, {"page": "1955 FA Charity Shield", "response": ["|LH ||6 || Derek Saunders"]}, {"page": "Deaths in March 2018", "response": ["*Derek Saunders, 90, English footballer (Chelsea F.C.).Derek Saunders 1928–2018"]}]}}