{"wiki_id": "http://www.wikidata.org/entity/Q526048", "itemLabel": "Richard Leach Maddox", "itemDescription": "English photographer, inventor and physician", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Leach_Maddox", "wikipedia_page": {"main": "Richard Leach Maddox (4 August 1816 – 11 May 1902) was an English photographer and physician who invented lightweight gelatin negative plates for photography in 1871.", "link_mentions": [{"page": "David Gill (astronomer)", "response": ["The invention of dry plate photography by Richard Leach Maddox made Gill realise that the process could be used to create images of the stars and to more easily determine their relative positions and brightness. This led to a massive project in collaboration with the Dutch astronomer J.C. Kapteyn, and the compiling of an index of brightness and position for some half a million southern stars. The work was published as Cape Photographic Durchmusterung in 3 volumes between 1896 and 1900. Gill also played a leading role in the organising of the Carte du Ciel, an ambitious international venture aimed at mapping the entire sky. He initiated the idea of a geodetic survey along the 30th meridian east stretching from South Africa to Norway, resulting in the longest meridian yet measured on Earth."]}, {"page": "Gelatin silver process", "response": ["The gelatin silver process was introduced by Richard Leach Maddox in 1871 with subsequent considerable improvements in sensitivity obtained by Charles Harper Bennett in 1878."]}, {"page": "List of English inventions and discoveries", "response": ["* 1871: The dry plate process, the first economically successful and durable photographic medium, invented by Richard Leach Maddox (1816–1902)."]}, {"page": "Freelan Oscar Stanley", "response": ["After leaving school, Francis Edgar Stanley married Augusta May Walker (1848-1927) and opened a portrait studio. His first technique was \"crayon\" or charcoal which he supplemented with his \"Improvement to the Atomizer,\" a forerunner of the modern air brush which he patented in 1876. In 1882, Francis began experimenting with photography about which he quickly became passionate. Following the tragic conflagration of his brother's factory, Francis suggested that the two work together to create a new photographic product. By 1885, the Stanley brothers had established the Stanley Dry Plate Company in Lewiston, Maine. The first primitive dry photo plate was invented by the English physician Richard Leach Maddox in 1871. Charles Bennett discovered important improvements upon the original formula but, ten years later, most photographers were still using the wet plate collodion process. By perfecting their factory process and marketing their product across the country, the Stanley Company quickly rose to predominance at a time when the market for factory-made (rather than studio-made) photo materials was just opening. The brothers quickly amassed a small fortune and, in 1890, they moved their business to Watertown, Massachusetts and bought homes in nearby Newton."]}, {"page": "Richard Maddox", "response": ["#REDIRECT Richard Leach Maddox"]}, {"page": "List of British innovations and discoveries", "response": ["*Dry plate process also known as gelatine process, is the first economically successful durable photographic medium – Richard Leach Maddox"]}, {"page": "Maddox (surname)", "response": ["*Richard Leach Maddox (1816–1902), British photographer"]}, {"page": "Richard Madox (disambiguation)", "response": ["*Richard Leach Maddox, photographer and physician"]}, {"page": "Richard L. Maddox", "response": ["#REDIRECT Richard Leach Maddox"]}, {"page": "Charles Harper Bennett", "response": ["He improved the gelatin silver process developed by Richard Leach Maddox, first in 1873 by a method of hardening the emulsion, making it more resistant to friction, and later in 1878 Bennett discovered that by prolonged heating the sensitivity of the emulsion could be greatly increased. This increased sensitivity resulting enabled shooting at 1/25 second, paving the way for the snapshot."]}, {"page": "Conservation and restoration of photographic plates", "response": ["* Gelatin dry plate negative: This process was invented by Richard Leach Maddox in 1871, but it was not commonly used until 1878 when the process became commercially successful. Because of the advances this process made in photography, it soon replaced the wet plate process in the 1880s. The collodion binder formerly used was replaced by gelatin which already contained the light-sensitive silver salts. This meant that the emulsion was already present and did not have to be painted on the glass plate right before exposure - which now only took less than one second. Because of this advancement, photographers did not have to carry their portable darkroom, but could develop later on. After 1878 when further improvements were made to the gelatin emulsion, gelatin glass plates began being mass-produced by companies such as Wratten & Wainright, Keystone Dry Plate Works, and notably the Eastman Dry Plate Company. This led to the advanced use and production of photographic glass plates until around 1925 and the development of the modern photography industry."]}, {"page": "Walton Adams", "response": ["Photography historian S. K. May on the Southampton Victorian Photographers website speculates that Adams possibly worked with Richard Leach Maddox, the inventor of lightweight gelatin dry plates. Dr. Maddox was a medical practitioner and his interest in the possibilities of photography to aid medical practice brought him into contact with a small network of photographers in Southampton, one of which was Adams.  There is a reference to Adams as the co-inventor of this process in the National Portrait Gallery's photographic archives."]}]}}