{"wiki_id": "http://www.wikidata.org/entity/Q5262262", "itemLabel": "Derek Payne", "itemDescription": "English footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Payne", "wikipedia_page": {"main": "Derek Richard Payne (born 26 April 1967) is an English former professional footballer who played as a midfielder, making over 200 appearances in the Football League.", "link_mentions": [{"page": "Tommy Mooney", "response": ["After just one season at Southend he arrived at Watford – initially on loan, before eventually signing for £95,000 in July 1994 as a 'makeweight' alongside midfielder Derek Payne, with Keith Dublin moving in the opposite direction."]}, {"page": "Mick Bodley", "response": ["In July 1996, Peterborough United manager Barry Fry, who had worked with Bodley at Barnet, Southend and Birmingham, paid his former club £75,000 for his services. Bodley took part in the club's record league win, against his former club Barnet in Division Three in September 1998: Peterborough won 9–1, and Bodley's own goal meant they actually scored all ten. Bodley played more than 100 games in all competitions, and was appointed club captain, before he and teammate Derek Payne were allowed to leave Peterborough on a free transfer for Isthmian League Premier Division club St Albans City, strengthening their squad prior to the FA Trophy semi-final. Bodley played six league games for the club and took part in both legs of the Trophy semi-final, which St Albans lost 4–3 on aggregate. In the 1999 close season he became manager Garry Hill's first signing for Dagenham & Redbridge, soon to be followed by Payne. Awarded the captaincy, Bodley led his players to the Isthmian League title, and with it promotion to the Conference National; they lost only five games all season, and finished the campaign with ten successive victories."]}, {"page": "Second Time Lucky", "response": ["* Derek Payne as Colonel Anderson"]}, {"page": "PFA Team of the Year (1990s)", "response": ["!scope=row|Derek Payne"]}]}}