{"wiki_id": "http://www.wikidata.org/entity/Q5263008", "itemLabel": "Derrick Evans", "itemDescription": "British exercise instructor", "wikipedia_url": "https://en.wikipedia.org/wiki/Derrick_Evans_(fitness_instructor)", "wikipedia_page": {"main": "Derrick Errol Evans  (born 15 November 1952), better known as \"Mr Motivator\", is a Jamaican-born British fitness instructor. He rose to fame in 1993 through appearances on the UK breakfast television show GMTV, where he performed live fitness sessions and offered tips and advice to viewers. In response to the popularity of his fitness sessions, he released a number of fitness and workout videos in the 1990s. \nThe name 'Motivator' was carefully chosen by Derrick to show his enthusiasm for fitness and also his association with Leicester and the famous secondary boys school he attended in the Highfieldss area of the city. He could have named himself Mr ' Moativator' to show his affiliation with  the 'Moat Boys' school located on Melbourne Road, Leicester. The school has now been renamed Moat Community College and has moved to Maidstone Road, Leicester. The old Moat Boys' building still exists and has been coverted to a Commmunity Medical Centre.", "link_mentions": [{"page": "Kenton, London", "response": ["* TV exercise instructor Mr Motivator (Derrick Evans) lived in Kenton"]}, {"page": "Tessa Sanderson", "response": ["When Sky News was launched in 1989, she worked as a sports reporter for the channel. She also appeared alongside Cilla Black as a co-host on ITV's Surprise Surprise. In 2005, she took part in the one-off special, Strictly African Dancing, as part of the Africa Lives season on the BBC. She performed a \"traditional 'dance celebrating the return home of the menfolk'\" and was voted into third place by the viewers. Sanderson starred in the fitness videos \"Cardiofunk\" (1990) \"Body Blitz\" (circa 1992) with Derrick Evans.", "Tessa: My Life in Athletics, Sanderson's autobiography, was published in 1986. In 1990 Sanderson sued various newspapers and was awarded £30,000 in damages by the High Court of Justice over claims that by starting an affair with Derrick Evans (later known as Mr Motivator), she had \"stolen another woman's husband.\" Sanderson contended that her affair with Evans had begun only after his marriage had broken up."]}, {"page": "Morph (TV series)", "response": ["In May 2019, Morph and Chas appeared in an advert for Tesco as part of the company's centenary celebrations, which also featured celebrities Anneka Rice and Derrick Evans (the latter more commonly known as Mr. Motivator)."]}, {"page": "Manchester Parish", "response": ["* Derrick Evans, \"Mr. Motivator\", fitness instructor"]}, {"page": "Mr Motivator", "response": ["#REDIRECT Derrick Evans (fitness instructor)"]}, {"page": "List of people with surname Evans", "response": ["*Derrick Evans (born 1952), Jamaican-born British exercise instructor known as Mr. Motivator"]}, {"page": "Mr. Motivator", "response": ["#REDIRECT Derrick Evans (fitness instructor)"]}, {"page": "List of people from Leicester and Leicestershire", "response": ["*Derrick Evans (TV fitness instructor, Mr Motivator)"]}, {"page": "List of Celebrity Juice episodes", "response": ["| Derrick Evans", "| Derrick Evans"]}, {"page": "Derrick Evans", "response": ["Derrick Evans may refer to:", "* Derrick Evans (politician) (born 1985), West Virginia politician", "* Derrick Evans (fitness instructor) (born 1952), Jamaican-born British fitness instructor"]}]}}