{"wiki_id": "http://www.wikidata.org/entity/Q5262154", "itemLabel": "Derek Longmuir", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Longmuir", "wikipedia_page": {"main": "Derek Longmuir (born 19 March 1951, Edinburgh, Scotland) is a Scottish former drummer and a founding member of the 1970s pop group, Bay City Rollers. His elder brother, Alan Longmuir, played bass guitar in the group.", "link_mentions": [{"page": "Bay City Rollers", "response": ["The group's line-up had many changes over the years, but the classic line-up during its heyday included guitarists Eric Faulkner and Stuart Wood, singer Les McKeown, bassist Alan Longmuir, and drummer Derek Longmuir. The current line-up (since 2018) includes original guitarist Stuart \"Woody\" Wood, singer Ian Thomson, bassist Marcus Cordock, and drummer Jamie McGrory.", "In 1964, a trio called the Ambassadors was formed in Edinburgh, Scotland, by 16-year-old Alan Longmuir on acoustic guitar, his younger brother Derek Longmuir on drums, and their older cousin Neil Porteous on acoustic guitar. The group never performed publicly under this name, just a family wedding where they covered \"Wake Up Little Susie\". They changed their name to the Saxons, and Derek invited a friend from school, Gordon \"Nobby\" Clark, to be the lead singer. Porteous moved from acoustic to electric guitar, and Alan Longmuir followed suit by changing to electric bass.Coy, W. (2005), Bay City Babylon: The Unbelievable But True Story of the Bay City Rollers, pp 12–13. Hats Off Books,  The Saxons played occasional dance hall concerts while the band members completed their schooling or worked during the day (Alan apprenticed as a plumber). Porteous left the band in July 1965, with new guitarist Dave Pettigrew filling the spot after answering an advertisement placed by the band in an Edinburgh newspaper. Pettigrew was more advanced musically than the others, and pushed the band to improve. Their repertoire included American R&B/pop songs such as \"Please Mr. Postman\" and \"Heat Wave\". They played at least one gig at the Gonk Club as the Deadbeats, but they discovered a conflict: another band was playing locally as Rock Bottom and the Deadbeats.", "More successful now, the Saxons moved out of the Longmuirs' back room to practise in Hermiston at a church. They played a couple of contemporary Kinks numbers but favoured American songs, including a new one: \"C.C. Rider\" by Mitch Ryder and the Detroit Wheels. Desiring a better name for the band, they settled on \"Rollers\", but needed a more powerful American-sounding term in front of that. Derek Longmuir threw a dart at a map of the United States, landing first on Arkansas. This did not meet anyone's approval, so a second dart was thrown. It landed near Bay City, Michigan. The band agreed on the name, the Bay City Rollers. Short-term members from this period included bassist David Paton (from 1969 to 1970) and keyboardist Billy Lyall (1969–71), who went on to be founding members of another Edinburgh band, Pilot.", "In late 1973, McKeown recorded lead vocals on \"Remember (Sha-La-La-La)\", and a lead-in to a series of UK chart hits. 16-year-old Stuart Wood completed the \"classic five\" line-up in February 1974, a week after the band had debuted the \"Remember\" single on Top of the Pops. (John Devine had mimed the piano part). By early 1975, the band was well on the way to achieving global success. The \"classic five\" line-up consisted of: Alan Longmuir, Derek Longmuir, Stuart \"Woody\" Wood, Eric Faulkner and Les McKeown.", "As the Rollers' popularity waned, the shuffling of personnel continued; Mitchell quit the band. He was replaced by guitarist Pat McGlynn. Further struggles involved the direction of their sound, as the members wished to pursue more sophisticated styles. They settled on David Bowie's producer, Harry Maslin, and in August 1977 released It's a Game as a four-piece group, comprising McKeown, Wood, Faulkner and Derek Longmuir. The It's a Game tour was recorded in 1977 at Japan's Budokan Hall, and was later released in 2001 as Rollerworld: Live at the Budokan 1977.", "The classic line-up (minus Derek Longmuir) performed a one-off New Year's Eve millennium concert, the last official Bay City Rollers concert (1999–2000) in the shadow of Edinburgh Castle in Scotland. Interest was rekindled in the UK by various television documentaries about the group; and a new television-advertised compilation of greatest hits, Very Best of the Bay City Rollers, entered the UK Albums Chart, on release in 2004 at No. 11.", "* Derek Longmuir – drums, percussion (1964–1981, 1982–1983, 1996)"]}, {"page": "List of drummers", "response": ["* Derek Longmuir (Bay City Rollers)"]}, {"page": "1952 in British music", "response": ["*19 March – Derek Longmuir, drummer (Bay City Rollers)"]}, {"page": "Once Upon a Star", "response": ["*Derek Longmuir – drums"]}, {"page": "Alan Longmuir", "response": ["Alan Longmuir (20 June 1948 – 2 July 2018) was a Scottish musician and a founding member of the 1970s pop group, the Bay City Rollers.  He played the bass guitar in the band whilst his younger brother Derek Longmuir was drummer."]}, {"page": "Rollin' (Bay City Rollers album)", "response": ["*Derek Longmuir – drums, congas, tambourine"]}, {"page": "Bay City Rollers (album)", "response": ["* Derek Longmuir – Drums"]}, {"page": "Wouldn't You Like It?", "response": ["*Derek Longmuir – drums, backing vocals, percussion; spoken word on \"Derek's End Piece\""]}, {"page": "Rock n' Roll Love Letter", "response": ["*Derek Longmuir – Drums"]}, {"page": "Dedication (Bay City Rollers album)", "response": ["*Derek Longmuir – drums, percussion, backing vocals"]}, {"page": "It's a Game (Bay City Rollers album)", "response": ["#\"Sweet Virginia\" (Faulkner, Wood, Derek Longmuir, Les McKeown, Pat McGlynn)", "*Derek Longmuir – Drums, vocals"]}, {"page": "Strangers in the Wind", "response": ["*Derek Longmuir – Drums, vocals"]}, {"page": "Elevator (The Rollers album)", "response": ["*Derek Longmuir – Drums, percussion"]}, {"page": "Ricochet (Bay City Rollers album)", "response": ["*Derek Longmuir – drums, percussion"]}, {"page": "Voxx (album)", "response": ["*Derek Longmuir – Drums, percussion"]}, {"page": "Derek", "response": ["*Derek Longmuir (born 1951), drummer with the Bay City Rollers"]}, {"page": "The Krofft Superstar Hour", "response": ["* Bay City Rollers (Eric Faulkner, Derek Longmuir, Leslie McKeown, Stuart 'Woody' Wood) - Themselves"]}, {"page": "Longmuir", "response": ["*Derek Longmuir (born 1951), Scottish drummer"]}]}}