{"wiki_id": "http://www.wikidata.org/entity/Q526770", "itemLabel": "Ted Grant", "itemDescription": "South African activist (1913-2006)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ted_Grant", "wikipedia_page": {"main": "Edward Grant (born Isaac Blank; 9 July 1913 – 20 July 2006) was a South African Trotskyist who spent most of his adult life in Britain. He was a founding member of the group Militant and later Socialist Appeal.", "link_mentions": [{"page": "July 20", "response": ["*2006 – Ted Grant, South African-English theorist and activist (b. 1913)"]}, {"page": "State capitalism", "response": ["* Against the Theory of State Capitalism by Ted Grant"]}, {"page": "1913", "response": ["** Ted Grant, South African Trotskyist (d. 2006)"]}, {"page": "Fourth International", "response": ["After the Second World Congress in 1948, the International Secretariat attempted to open communications with Josip Broz Tito's regime in Yugoslavia. In their analysis, it differed from the rest of the Eastern Bloc because it was established by the partisans of World War II who had fought against Nazi occupation, as opposed to by Stalin's invading armies. The British RCP, led by Jock Haston and supported by Ted Grant, were highly critical of this move."]}, {"page": "List of pseudonyms", "response": ["|Ted Grant"]}, {"page": "Independent Labour Party", "response": ["From the mid-1930s onwards the ILP also attracted the attention of the Trotskyist movement, and various Trotskyist groups worked within it, notably the Marxist Group, of which C. L. R. James, Denzil Dean Harber and Ted Grant were members. There was also a group of ILP members, the Revolutionary Policy Committee, who were sympathetic to the CPGB and eventually left to join that party. From the late 1930s the ILP had the support of several key figures in the tiny Pan-Africanist movement in Britain, including George Padmore and Chris Braithwaite, as well as left-wing writers such as George Orwell, Reginald Reynolds and Ethel Mannin."]}, {"page": "Shachtmanism", "response": ["Regardless of its origins in the American SWP, Shachtmanism's core belief is opposition to the American SWP's defence of the Soviet Union. This originated not with Shachtman but Joseph Carter (1910–1970) and James Burnham (1905–1987), who proposed this at the founding of the SWP in 1938. C. L. R. James (1901–1989) referred to the implied theory, from which he dissented, as Carter's little liver pill. The theory was never fully developed by anybody in the Workers Party and Shachtman's book, published many years later in 1961, consists earlier articles from the pages of New International with some political conclusions reversed. Ted Grant (1913–2006) has alleged that some Trotskyist thinkers, including Tony Cliff (1917–2000), who have described such societies as \"state capitalist\" share an implicit theoretical agreement with some elements of Shachtmanism.Ted Grant: \"The Marxist theory of the state (Once more on the theory of 'state capitalism')\" , Appendix to Russia: From revolution to counter-revolution. Cliff, who published a critique of Shachtmanism in the late 1940s,Tony Cliff: \"The theory of bureaucratic collectivism: A critique\" (1948) at Marxists.org. would have rejected this allegation."]}, {"page": "Socialist Appeal (UK, 1992)", "response": ["It was founded by supporters of Ted Grant and Alan Woods after they were expelled from the Militant group in the early 1990s.", "Socialist Appeal was also the name of two British Trotskyist newspapers associated with Ted Grant in the 1940s: one was the newspaper of the Workers International League and immediately following that of the  Revolutionary Communist Party.", "* Ted Grant Internet Archive"]}, {"page": "Tommy Sheridan", "response": ["The argument was resolved when Sheridan and his supporters won a vote at a special conference held in Bridlington in October 1991, defeating the faction around Militant founder Ted Grant who argued against abandoning the Labour Party. The result was a split in the Militant in what has become known as the 'Scottish Turn'; Scottish Militant Labour had gained six councillors in Glasgow by 1993, including Sheridan. With a strong Scottish National Party (SNP), Scottish Militant Labour argued in favour of founding a new, left-wing political party. Discussions were held with other left-wing and Scottish republican groups and a new group was formed in 1996 known initially as the Scottish Socialist Alliance. In 1998, the new Scottish Socialist Party was formed from the SSA. Differences over political strategy and priorities within the Committee for a Workers' International (CWI) soon surfaced, especially on the issue of Scottish independence, leading to a split within the CWI and Sheridan along with the majority of Scottish supporters left the organisation."]}, {"page": "Isaac Blank", "response": ["#REDIRECT Ted Grant"]}, {"page": "Peter Taaffe", "response": ["\"I came into contact with Socialist Fight in 1960\" writes Taaffe.The Rise of Militant, p. 10 Socialist Fight was the newspaper of a small group of mainly (but not entirely) industrial militants in Liverpool going by the name of the Revolutionary Socialist League (RSL), and led by Jimmy Deane and Ted Grant.", "Earlier in 1964, Ted Grant, Liverpudlians Jimmy Deane (who was National Secretary) and Keith Dickenson, Ellis Hillman, John Smith, and others on the executive of the RSL decided to launch the Militant newspaper \"without complete unanimity\" Taaffe writes.Rise of Militant p. 17. Jimmy Deane was National Secretary until 1965. Before his death he made his minutes of these meetings available. cf http://www.warwick.ac.uk/services/library/mrc/ead/325col.htm", "By the 1980s, the Militant tendency had become the most prominent Trotskyist organisation in Britain. Two books by Peter Taaffe: The Rise of Militant and Liverpool – A City That Dared to Fight (with Tony Mulhearn) describe this period. The Labour Party under Michael Foot (and later Neil Kinnock) moved to purge Militant from the party. In 1983, Peter Taaffe, along with the other four members of the Militant newspaper's editorial board (Ted Grant, Keith Dickinson, Lynn Walsh, and Clare Doyle), were expelled from the Labour Party.", "Taaffe stated that those ten months had been one of \"profound debate\" culminating in the special October 1991 in which the majority had overwhelming support. Many opponents of the \"Scottish turn\" will remain loyal supporters of Militant, Taaffe predicted. Immediately after the special conference, Taaffe stated that Ted Grant and his group took steps to set up \"their own small premises and their own staff and are raising their own funds. We regret Ted Grant has split in this way. He made a vital contribution...\"", "*History of British Trotskyism By Ted Grant", "*Militant's Real History: In reply to Ted Grant and Rob Sewell by Peter Taaffe (this is a reply to Ted Grant's History of British Trotskyism and Rob Sewell's Postscript to it)"]}, {"page": "Jock Haston", "response": ["In contrast to the official British section of the Fourth International, the Revolutionary Socialist League (RSL), the WIL was to experience serious growth in this period recruiting supporters from the CPGB, the RSL and from within the Labour Party. Again, unlike the official section, the WIL accepted the Fourth International Proletarian Military Policy (PMP) although not without an internal struggle that pitted a minority around Haston, Millie Lee (né Kuhn) and Sam Levy against Ted Grant and Gerry Healy. Haston emerged the victor from this factional tussle, and the PMP was adapted to the needs of the WIL.", "With the turn of the war against the Nazis, the RCP was at pains to look for any signs of the coming revolutionary upheavals that were expected in line with the perspectives of the Fourth International as outlined in the famous Transitional Program. The leading theoretician of the RCP, Ted Grant, was therefore far seeing when he sought to tailor the political demands of the movement to the actual movement rather than succumbing to a rosy view of events. This realistic view of events was also prompted by the agreement of the RCP leadership with the documents of the Goldman-Morrow-Heijenoort minority in the American Socialist Workers Party.", "Under pressure from the FI the RCP dissolved itself in 1949. Most of its former members, including Haston, and joined Healy in \"The Club\". Haston, demoralised by the problems that Trotskyism had been undergoing in Britain since the end of the war, and facing harassment from Healy, resigned from the movement in February 1950. He remained active in the Labour Party for the rest of his life, becoming a lecturer for the National Council of Labour Colleges and then educational director for the Electrical, Electronic, Telecommunications and Plumbing Union (EEPTU).Ted Grant, History of British Trotskyism, London: Wellred Publications, 2002, p. 299"]}, {"page": "Edward Grant (disambiguation)", "response": ["Edward Grant, Eddie Grant, Ted Grant, or similar names may also refer to:", "* Ted Grant (1913–2006), South African politician", "* Wildcat (Ted Grant), a DC Comics superhero"]}, {"page": "List of contributors to Marxist theory", "response": ["|Ted Grant"]}, {"page": "Germiston", "response": ["* Ted Grant, Trotskyist politician and theorist"]}, {"page": "Anil Moonesinghe", "response": ["Through the group he got to know Max Shachtman, becoming familiar with his theory of 'bureaucratic revolution'. He was also familiar with Jock Haston and Ted Grant. Within the RCP he went by the Pseudonym 'Anil Kumaran'."]}, {"page": "Jeanne Hoban", "response": ["The three of them joined the Revolutionary Communist Party (RCP), and Jeanne was elected to its National Executive. She fell out early with Gerry Healy, who was most prominent in the RCP at the time, but remained close to Ted Grant. She was associated with the group around Tony Cliff, the so-called State-Caps after their characterisation of the USSR as state-capitalist. The group would later become the Socialist Workers Party (SWP)."]}]}}