{"wiki_id": "http://www.wikidata.org/entity/Q5264708", "itemLabel": "Desmond Dupré", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Desmond_Dupr%C3%A9", "wikipedia_page": {"main": "Desmond John Dupré (19 December 1916, London — 16 August 1974, Tonbridge, Kent) was an English lutenist, guitarist, gambist and a prominent figure in the 20th century revival of early music. He was known particularly for his recordings on lute and viola da gamba, notably with counter-tenor Alfred Deller.", "link_mentions": [{"page": "Alfred Deller", "response": ["Lutenist Desmond Dupré performed with him, initially as a guitarist; other accompanists included harpsichordist and musicologist Walter Bergmann. In later years, he worked with lutenist Robert Spencer and harpsichordists Harold Lester and William Christie. His recordings include the lute songs of Dowland, operas by Handel, Britten's A Midsummer Night's Dream, songs and semioperas by Purcell (such as The Fairy Queen), traditional English folk songs, works by Thomas Tallis, and the Bach alto repertoire. He recorded for HMV, Vanguard Classics, and Harmonia Mundi."]}, {"page": "The Skye Boat Song", "response": ["Alfred Deller recorded a version for his album Western Wind in 1958, together with Desmond Dupré on guitar and John Sothcott on recorder. It was performed to great acclaim and recorded by artist and social activist Paul Robeson in 1959 and 1960."]}, {"page": "Posh Nosh", "response": ["The arty and refined opening and closing theme for Posh Nosh is taken from the traditional Scottish ballad \"The Raggle Taggle Gypsies\", in a 1956 recording by countertenor Alfred Deller to guitar accompaniment by Desmond Dupré. It uses the following verses from the ballad:"]}, {"page": "Black Is the Color of My True Love's Hair", "response": ["| Alfred Deller, Desmond Dupré, Mark Deller"]}, {"page": "List of people from Tonbridge", "response": ["*Desmond Dupré, (1916–1974), lutenist and early music pioneer"]}, {"page": "Desmond Dupre", "response": ["#REDIRECT Desmond Dupré"]}, {"page": "Can She Excuse My Wrongs", "response": ["There are vintage recordings of the song by singers such as Alfred Deller (counter-tenor),Deller's extensive discography includes versions of \"Can She Excuse\" for solo voice and for vocal consort (on Vanguard). see Alfred Deller (1912–1979) - A discography  and Sir Peter Pears (tenor), who worked with the lutenists Desmond Dupré and Julian Bream respectively. The song’s highest chart performance was achieved by Sting (sometimes described as a baritone, although he has also been included among tenors in non-classical music) and Edin Karamazov (lute), who included a version in their 2006 album Songs from the Labyrinth."]}, {"page": "Folksongs (Alfred Deller album)", "response": ["Folksongs is a 1972 album by the countertenor Alfred Deller with his son Mark Deller and lutenist Desmond Dupré.Billboard 20 May 1972 p.39The Gramophone 2003The Grove Book of Opera Singers 2008 p115 \"often accompanied by the lutenist Desmond Dupré. In addition to actual folksongs it includes three songs composed by Thomas Morley and one by Robert Jones.", "# \"The Three Ravens\" – Alfred Deller & Desmond Dupré (2:52)", "# \"Black is the Colour of My True Love's Hair\" – Alfred Deller & Desmond Dupré (1:53\t)", "# \"Sweet Nymph, Come to thy Lover\" Thomas Morley – Alfred Deller, Desmond Dupré and Mark Deller (1:41)", "# \"I go before my darling\" by Thomas Morley – Alfred Deller, Mark Deller and Desmond Dupré (1:26)", "# \"The Oak and the Ash\" – Alfred Deller & Desmond Dupré (3:11)", "# \"Barbara Allen\" – Alfred Deller & Desmond Dupré (2:36)", "# \"Lord Randall\" – Alfred Deller & Desmond Dupré (4:04)", "# \"The Water Is Wide\" (English version of Waly, Waly) – Alfred Deller & Desmond Dupré (2:35)", "# \"The Tailor and the Mouse\" – Alfred Deller & Desmond Dupré\t (1:31)", "# \"Down by the Sally Gardens\" – Alfred Deller & Desmond Dupré (2:21)", "# \"I Will Give my Love an Apple\" – Alfred Deller & Desmond Dupré (1:47)", "# \"Miraculous Love's wounding\" by Thomas Morley – Alfred Deller, Desmond Dupré and Mark Deller (2:57\t)", "# \"Sweet Kate\" by Robert Jones – Alfred Deller, Mark Deller and Desmond Dupré (1:36)", "# \"Bushes and Briars\" (collected by Vaughan Williams 1908) – Alfred Deller & Desmond Dupré (2:36\t)", "# \"The Foggy, Foggy Dew\" – Alfred Deller & Desmond Dupré (2:10)", "# \"She Moved Through the Fair\" – Alfred Deller & Desmond Dupré (3:44\t)", "# \"Evening Prayer\" – Alfred Deller & Desmond Dupré"]}, {"page": "Willow song", "response": ["*Shakespeare Songs\tDeller Consort, Alfred Deller with Desmond Dupré (lute) Harmonia Mundi Musique d'Abord – HMA195202"]}, {"page": "Shakespeare Songs (Alfred Deller album)", "response": ["Will There Really Be a Morning?: Life: A Guide 1134137575 Fred Sedgwick - 2013 The first is by the extraordinary countertenor Alfred Deller, and you can find it on Shakespeare's Songs by the Deller Consort, on Harmonia Mundi.Michael Neill editor William Shakespeare, THE OXFORD SHAKESPEARE: Othello: The Moor of Venice 0199535876 2008   'Shakespeare Songs' Harmonia Mundi Musique d'abord HMA 195202 Performers: Alfred Deller (counter-tenor) and ...Luca Cerchiari, Laurent Cugny, Franz Kerschbaumer Eurojazzland: Jazz and European Sources, Dynamics, and Contexts - 2012 1584658649-  ... with singer (countertenor) Alfred Deller for the aforementioned Harmonia Mundi France cd Shakespeare Songs and Consort Music. Deller is accompanied by lutenist Desmond Dupré and the Deller Consort, Philip Todd and Max Worthley tenors, Maurice Bevan baritone.Naomi Miller  Reimagining Shakespeare for Children and Young Adults -1135363358 2013 Page 73 Note For those who are interested: Shakespeare Songs, performed by Alfred Deller and Desmond Dupre on lute, is released by Harmonia Mundi. France, HMA 190202."]}, {"page": "Saltire Music Group", "response": ["*John Dowland Music Of Love And Friendship,  Saltire Singers with Desmond Dupré, Musical Heritage Society\tMHS 870"]}]}}