{"wiki_id": "http://www.wikidata.org/entity/Q5261804", "itemLabel": "Derek Benfield", "itemDescription": "British actor and playwright (1926-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Benfield", "wikipedia_page": {"main": "Derek Benfield (11 March 1926 – 10 March 2009) was a British playwright and actor.\nHe was born in Bradford, West Riding of Yorkshire, and educated at Bingley Grammar School. He was the author of the stage farce Running Riot and played Patricia Routledge's character's husband in Hetty Wainthropp Investigates (1996–1998).\nArguably Benfield's best known character portrayal was as transport company foreman Bill Riley in the UK television series The Brothers in the early 1970s. Before this, he starred as Frank Skinner in the 1970 cult sci-fi series broadcast on UK ITV, Timeslip. Some of his other television roles included Walter Greenhalgh in Coronation Street (1961–1969), Albert the Clerk in Rumpole of the Bailey (1978–80), and characters in Breakaway (1980) and First of the Summer Wine (1988).\nHis film credits include small roles in Crossplot (1969), I Don't Want to Be Born (1975) and Lifeforce (1985). His plays included the farces Post Horn Gallop and Wild Goose Chase, both about the fictional exploits of the eccentric Lord and Lady Elrood and visitors to their castle.\nHe also appeared with Colin Baker as John Hallam in the Doctor Who audio play Catch-1782 produced by Big Finish Productions.", "link_mentions": [{"page": "Timeslip", "response": ["Simon, whose mother has died recently, has been taken on holiday in 1970 by the Skinner family – father Frank (Derek Benfield), mother Jean (Iris Russell) and daughter Liz – to the village of St Oswald. Frank had served at the (now abandoned) naval research base in St Oswald during World War II, where he had suffered amnesia. This has left him with no recollection of what happened during his time there. A local girl, Sarah, disappears through an invisible time barrier, witnessed by a local man, but nobody believes him when he tells the story in the pub where the Skinners are staying; but his story attracts a man called Charles Traynor (Denis Quilley), who arrives in the village and reveals that he was Skinner's commanding officer at the base during the war. Traynor had ordered Skinner to destroy the apparatus which the scientists at the base were working on, and he is eager to learn from Skinner if he succeeded in the task. This is because a German expeditionary team attacked and took over the base for a short time in 1940. The German commander, Gottfried (Sandor Elès), is now a prominent scientist, kidnapped and forced to work on the other side of the Iron Curtain, and Traynor is concerned that if the research work done at the base had fallen into his hands, it could be used against the West. While out playing near the ruins of the naval base, Liz and Simon encounter the Time Barrier for the first time. They are transported back to 1940, to the very day the Germans took over the base. There they encounter both Traynor, who is commander of the base, and Liz's father, a young naval recruit (played by John Alkin). A link is maintained to the present via Liz's mother, who is able to communicate telepathically with her daughter. After crossing the Time Barrier Liz and Simon encounter the teenage girl Sarah who fell through the barrier and help her return to the present day. When the Germans arrive, Liz and Simon are initially captured, but then escape and succeed in helping young Frank Skinner carry out Traynor's orders to destroy the secret apparatus – a prototype laser weapon – before the Germans can seize it. They escape back through the Time Barrier, but instead of returning to St Oswald in their time of 1970, they find themselves in an icy wilderness.", "Derek Benfield later went on to appear in regular roles in The Brothers (1972–76) and Hetty Wainthropp Investigates (1996–98). He also enjoyed a successful career as a playwright. He died in 2009.", "*Frank Skinner: Derek Benfield"]}, {"page": "Room at the Top (1959 film)", "response": ["* Derek Benfield as Man in bar"]}, {"page": "Great Expectations", "response": ["* 1959 – BBC television version aired in 13 parts, starring Dinsdale Landen as Pip, Helen Lindsay as Estella, Colin Jeavons as Herbert Pocket, Marjorie Hawtrey as Miss Havisham and Derek Benfield as Landlord."]}, {"page": "Dominic Monaghan", "response": ["Although Monaghan held many occupations when he was younger, he always wanted to be an actor. After his second year at St. Anne's, Monaghan became a regular in school plays such as Oliver Twist, A Christmas Carol and Bugsy Malone before joining the Manchester Youth Theatre. There, he was scouted for Hetty Wainthropp Investigates, in which he starred alongside Patricia Routledge and Derek Benfield as Hetty's under-aged sidekick, Geoffrey Shawcross, for four series. Monaghan has since credited Routledge as \"an amazing teacher\" who taught him some \"very valuable lessons\" that have influenced his acting career. He made his feature-film debut as Russian sailor Sasha in the TV film Hostile Waters."]}, {"page": "Patricia Routledge", "response": ["In 1989 Routledge accepted the lead role of Hetty Wainthropp in an ITV mystery drama, Hetty Wainthropp: Missing Persons. ITV opted not to pursue a series after the pilot episode, but in 1996 the BBC produced the first series of Hetty Wainthropp Investigates, with Routledge again in the lead role. The show co-starred Dominic Monaghan as her assistant and Derek Benfield as her husband. It was first aired in January 1996, and ran until the autumn of 1998, with one special episode in 1999. Monaghan, who went on to enjoy a Hollywood career, has since credited Routledge as \"an amazing teacher\" who taught him some \"very valuable lessons\" in acting."]}, {"page": "Hetty Wainthropp Investigates", "response": ["Hetty Wainthropp Investigates is a British crime drama television series, starring Patricia Routledge as the title character, Henrietta \"Hetty\" Wainthropp,\"A Minor Operation,\" Hetty Wainthropp Investigates, original air date 16 January 1998 that aired for four series between 3 January 1996 and 4 September 1998 on BBC One. The series, spawned from a pilot episode entitled \"Missing Persons\" aired by ITV in 1990, was co-created by writers David Cook and John Bowen, co-starred Derek Benfield as Hetty's patient husband Robert, and Dominic Monaghan as her assistant and lodger Geoffrey Shawcross.", "* Derek Benfield as Robert Wainthropp"]}, {"page": "Rumpole of the Bailey", "response": ["* Albert HandysideAlbert is called \"Mr. Tree\" by Henry in both his appearances in Series 1, but his last name is thereafter Handyside. (Derek Benfield) (Series 1–2 and Special): The original clerk of Chambers. Fired in the third episode, he remains friendly with Rumpole and gets him the occasional case from the firm of solicitors that he joins as a clerk."]}, {"page": "Doomwatch", "response": ["Cast: John Paul as Dr Spencer Quist, Simon Oates as Dr John Ridge, John Nolan as Geoff Hardcastle, Jean Trend as Dr Fay Chantry, Joby Blanshard as Colin Bradley, Vivien Sherrard as Barbara Mason, Glyn Houston as Gerald Marlowe, Trevor Bannister as Lewis, Derek Benfield as Arnold Payne, John Trayhorn as Jimmy Brookes, Terry Bale as Walsh, Roy Purcell as Doctor Barton, Rhoda Lewis as Mrs. Freeman, Barbara Bolton as Mrs. Jones, Bill Weston as Nicholls, Norman Florence as Donovan, Frances Pidgeon as Secretary, Michael Elwyn as Duncan.", "Cast: John Paul as Dr Spencer Quist, John Barron as The Minister, John Bown as Commander Neil Stafford, Joby Blanshard as Colin Bradley, Vivien Sherrard as Barbara Mason, Tim Nicholls as BBC Reporter, Raymond Mason as Critchley, David Landon as Assistant, Wensley Pithey as Ericson, Derek Benfield as Dr Ridley, Robert Raglan as General, Robert James as G.L.C. Man, Michael Lees as Ministry of Defence Man, Patrick Jordan as Lt.-Cmdr. Morrison."]}, {"page": "Theatre 625", "response": ["|Alan Dobie,Doris Wellings,Eve Pearce,Eileen Winterton,Derek Benfield,André Morell,Sian Davies,John Dearth,Reginald Barratt,Donald Eccles,Frazer Hines,Harry Littlewood,Kevin Stoney,Brian Peck,Jeremy Spenser,David Valla,Malcolm Taylor,Michael Davis"]}, {"page": "Lifeforce (film)", "response": ["* Derek Benfield as Physician"]}, {"page": "First of the Summer Wine", "response": ["The adults around the young people act as supporting characters. Peter Sallis and Maggie Ollerenshaw play David and Violet Clegg, Norman's parents. Derek Benfield portrays Mr Scrimshaw, the manager of the shop where Ivy, Dilys, Sherbert, Norman and Seymour work."]}, {"page": "The Brothers (1972 TV series)", "response": ["Bill, the foreman (Derek Benfield), demonstrated how the workplace of the 1970s was changing. His elevation from the shop floor to a key member of the board was met with resistance from both ends, and the subsequent decades allow this to be seen in context, one way that management and workers may work closer together to maintain the company's competitive outlook. The character of Paul Merroney can in hindsight be viewed as a prototype for the new Thatcher-inspired generation of corporate go-getters.", "| scope=\"col\" colspan=\"1\" style=\"background:#F0F8FF\"| Derek Benfield"]}, {"page": "Catch-1782", "response": ["*John Hallam — Derek Benfield"]}, {"page": "R3 (TV series)", "response": ["*Tom Collis – Derek Benfield"]}, {"page": "List of Last of the Summer Wine characters", "response": ["* Mr Scrimshaw (Derek Benfield; 1988-89) appeared in every episode of the prequel series."]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Derek Benfield (Acting Diploma 1949)"]}, {"page": "Immortality, Inc.", "response": ["This story was first adapted as the opening episode for the third series of the BBC science-fiction anthology series Out of the Unknown, starring Derek Benfield as Tom Clarke (a renamed Thomas Blaine). The master videotape for the episode was later wiped by the corporation, and only brief video and audio clips are known to exist."]}, {"page": "Hammer House of Mystery and Suspense", "response": ["| Cristina Raines, Marius Goring, Simon Williams, Tony Anholt, Zienia Merton, Tom Chadbon, Michael Elwyn, Derek Benfield, Lewis Fiander"]}, {"page": "Bingley Grammar School", "response": ["* Derek Benfield, actor"]}, {"page": "Little Problems", "response": ["| Derek Benfield"]}, {"page": "Nikki Kelly", "response": ["In the 1970s, Kelly performed in the original productions of such stage plays as There Goes the Bride (1974) and Snatch 69 (1975) and in several overseas tours, including No Sex Please, We're British in Sweden, Confessions of a Window Cleaner in Zimbabwe, and Who Goes Bare in South Africa.  At the peak of the television fame in the late 1980s, Kelly  appeared as an Olympic volleyball player in Dig Volley Spike at the Old Red Lion Theatre in Islington and performed opposite John Inman in a production of Derek Benfield's farce Bedside Manners, which opened at the Salisbury Playhouse in March 1989 and toured for seven months."]}, {"page": "1926 in the United Kingdom", "response": ["** Derek Benfield, actor (died 2009)"]}, {"page": "Derek", "response": ["*Derek Benfield (1926–2009), British actor and playwright"]}, {"page": "List of former Coronation Street characters", "response": ["|Walter Greenhalgh || Derek Benfield || 1967"]}, {"page": "John Bowen (British author)", "response": ["In the mid 1990s, the BBC commissioned Bowen and David Cook to create the TV detective drama Hetty Wainthropp Investigates, based on Cook's 1988 novel Missing Persons. The character of Hetty Wainthropp was loosely based on Cook's mother, Beatrice, and was portrayed by Patricia Routledge alongside Derek Benfield as her long-suffering husband Robert, and Dominic Monaghan as her sleuthing side-kick, Geoffrey."]}, {"page": "2009 in British television", "response": ["| Derek Benfield"]}, {"page": "2009 in the United Kingdom", "response": ["**Derek Benfield, actor (b. 1926)"]}, {"page": "Deaths in March 2009", "response": ["*Derek Benfield, 82, British actor."]}, {"page": "Diana Barrington", "response": ["In 1963 Barrington was part of the Alexandra Repertory Company at The Alexandra, Birmingham; she appeared in plays including Fish Out of Water by Derek Benfield, Noël Coward's Hay Fever, Jean Anouilh's Becket and W. Somerset Maugham's The Constant Wife."]}, {"page": "Hadleigh (TV series)", "response": ["| Garfield Morgan, Jonathan Newth, Ivor Dean, Derek Benfield, Robert Cartland, John Owens, Terrance Denville"]}, {"page": "Benfield", "response": ["* Derek Benfield (1926–2009), British playwright and actor"]}, {"page": "List of Coronation Street characters (1963)", "response": ["| Derek Benfield", "| Derek Benfield"]}, {"page": "Crane (TV series)", "response": ["3. The Cannabis Syndicate. Crane and Mahmoud work together to stop a murder for sale syndicate which wants them both dead. Peter Reynolds as Austin Crispin, Derek Benfield as Osman, David Graham as Sharif Mohammed, John Herrington as the doctor, Nicholas Evans as the servant."]}, {"page": "List of Minder episodes", "response": ["|colspan=\"3\"|Guest stars: Derek Benfield as Brown, Diana Malin as Debbie."]}, {"page": "The Flaxton Boys", "response": ["* Derek Benfield – Sgt. Brophy"]}, {"page": "The Girl (1987 film)", "response": ["* Derek Benfield ...  Janitor"]}]}}