{"wiki_id": "http://www.wikidata.org/entity/Q5262373", "itemLabel": "Derek Spencer", "itemDescription": "British politician (born 1936)", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Spencer", "wikipedia_page": {"main": "Sir Derek Harold Spencer, QC (born 31 March 1936) is a British Conservative Party politician.", "link_mentions": [{"page": "1983 United Kingdom general election", "response": ["|Derek Spencer"]}, {"page": "1987 United Kingdom general election", "response": ["|Derek Spencer"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Sir Derek Spencer"]}, {"page": "Jim Marshall (British politician)", "response": ["In 1968, he became a lecturer at Leicester Polytechnic remaining until 1974, and in 1971 he was elected to Leicester City Council, becoming leader of the council in 1973. He contested the Harborough seat in 1970. In the February general election of 1974 he contested the constituency of Leicester South, and unseated the Conservative MP, Tom Boardman, in the October election that year.  He held the seat until his death, with the exception of the period 1983–1987, when he lost the seat to the Conservative Derek Spencer by seven votes.  During his time out of parliament, he worked as a supply teacher and market trader: building up a stronger, more community oriented reputation."]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Derek Spencer"]}, {"page": "Solicitor General for England and Wales", "response": ["|Sir Derek Spencer "]}, {"page": "2004 Leicester South by-election", "response": ["Leicester South was first won by Jim Marshall in 1974. He lost the seat to the Conservative Party candidate, Derek Spencer, in the 1983 general election by a mere 7 votes, but won it back at the 1987 election. Marshall won the constituency with a majority of 13,243 (31.4%) at the 2001 election."]}, {"page": "Leicester South (UK Parliament constituency)", "response": ["The seat was held by Derek Spencer for the Conservative Party between the general elections of 1983 and 1987. Its electorate demonstrated increased Labour support thereafter in local and national elections. A 2004 by-election caused by the death of Labour MP Jim Marshall was fought under the shadow of the Iraq War, and was won by Parmjit Singh Gill who became at the time the only Liberal Democrat MP from an ethnic minority. He held the seat for a year before being defeated by Labour candidate Sir Peter Soulsby at the 2005 general election. Soulsby subsequently resigned in order to seek election as Mayor of Leicester in 2011, giving Leicester South its second by-election in the space of seven years; this time the seat was safely held by Labour.", "| Derek Spencer"]}, {"page": "Brighton Pavilion (UK Parliament constituency)", "response": ["| Derek Spencer"]}, {"page": "List of close election results", "response": ["|Conservative Party challenger Derek Spencer defeated Labour Party incumbent Jim Marshall 21,424–21,417."]}, {"page": "Derek Harold Spencer", "response": ["#REDIRECT Derek Spencer"]}, {"page": "United Kingdom general election records", "response": ["|Derek Spencer", "* 1992: Michael Ancram, Bryan Davies, Warren Hawksley, John Horam, Gerry Malone, Piers Merchant, Richard Ottaway, Nick Raynsford, John Spellar, Derek Spencer, Iain Sproat, Mark Robinson, Paul Tyler"]}, {"page": "Derek", "response": ["*Derek Spencer (born 1936), British politician"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Sir Derek Spencer; MP for Leicester South (1983–1987) and Brighton Pavilion (1992–1997)"]}, {"page": "List of people with surname Spencer", "response": ["* Derek Spencer (born 1936), British politician"]}, {"page": "Second Major ministry", "response": ["| Sir Derek Spencer"]}, {"page": "List of MPs who lost their seat in the 1997 United Kingdom general election", "response": ["|Derek Spencer"]}]}}