{"wiki_id": "http://www.wikidata.org/entity/Q5262200", "itemLabel": "Derek Monaghan", "itemDescription": "Footballer (born 1959)", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Monaghan", "wikipedia_page": {"main": "Derek James Monaghan (born 20 January 1959) is an English former footballer who played as a forward for West Bromwich Albion, Port Vale, and Redditch United.", "link_mentions": [{"page": "Derek James Monaghan", "response": ["#REDIRECT Derek Monaghan"]}, {"page": "1984–85 Port Vale F.C. season", "response": ["The pre-season saw four new arrivals: veteran striker Ally Brown (Walsall); winger Peter Griffiths (Stoke City); and both forward Derek Monaghan and reliable defender Alan Webb (West Bromwich Albion). This came after John Rudge stated that \"Vale's reputation has been built on grit and determination and I will be looking to bring in the player who is willing to die for the cause\". Attempts to re-sign Brian Horton failed once again, whilst Martin Henderson had his contract cancelled after failing to report for pre-season training – he later signed with Spalding United. Just before the season began Gary Brazil was signed on loan from Sheffield United.", "On the financial side, a loss was made of £7,793 due to a 20% drop in attendance figures. The wage bill stood at £389,341, whilst gate receipts took in £128,954 and the lottery raised £191,000. The club's shirt sponsors were EDS. Five players left on free transfers, most significant were the departures of: Terry Armstrong and Derek Monaghan (retired); Colin Tartt (Shepshed Charterhouse); and Ian Griffiths (Wigan Athletic). Billy Kellock also refused terms, and so joined Halifax Town, whilst John Ridley joined Stafford Rangers as a player-coach. Vale received £700 following a tribunal claim, becoming the first Football League club to take a non-league club to a tribunal.", "|align=\"left\"|FW||align=\"left\"| Derek Monaghan", "| July 1984 || FW ||  || Derek Monaghan || West Bromwich Albion || Free transfer || ", "| May 1985 || FW ||  || Derek Monaghan || Redditch United || Free transfer || "]}]}}