{"wiki_id": "http://www.wikidata.org/entity/Q5271122", "itemLabel": "Diana Churchill", "itemDescription": "daughter of Sir Winston Churchill", "wikipedia_url": "https://en.wikipedia.org/wiki/Diana_Churchill", "wikipedia_page": {"main": "Diana Spencer-Churchill (11 July 1909 – 20 October 1963) was the eldest daughter of British statesman Sir Winston Churchill and Clementine Churchill, Baroness Spencer-Churchill.", "link_mentions": [{"page": "1963", "response": ["* October 20 – Diana Churchill, daughter of Winston Churchill (b. 1909)"]}, {"page": "List of suicides", "response": ["*Diana Churchill (1963), Eldest daughter of British Prime Minister Winston Churchill, barbiturate overdose"]}, {"page": "Duncan Sandys", "response": ["In 1935, Duncan Sandys married Diana Churchill, daughter of the future prime minister Winston Churchill. They divorced in 1960.", "From his first marriage, with Diana Churchill:"]}, {"page": "Chris Martin", "response": ["Christopher Anthony John Martin was born on 2 March 1977 in Exeter, Devon, England, and is the oldest of five children. His father, Anthony John Martin, of Whitestone House, Exeter, is a retired chartered accountant, and his mother, Alison Martin, who is from Zimbabwe, is a music teacher. His family's caravan and motorhome sales business, Martins of Exeter, was founded in 1929 by his grandfather John Besley Martin, CBE (a High Sheriff-also Mayor in 1968 of Exeter). It was sold by his father to a former employee in 1999.Burke's Peerage, 1999. vol. 2, p. 1689 William Willett, the man who campaigned for and made daylight saving time a recognised practice, was Martin's great-great-grandfather.Jonathan Dekel. \"Daylight Saving Time's Coldplay connection\", Canada.com; accessed 21 June 2015. Martin's paternal aunt Elisabeth Jane (daughter of John Besley Martin) married Hon. Julian George Winston Sandys, son of Conservative politician Duncan Sandys by his wife Diana Churchill, daughter of Prime Minister Winston Churchill. The Conservative politician David Martin is his paternal uncle."]}, {"page": "List of political families in the United Kingdom", "response": ["****** Duncan Sandys, politician; married to Diana Churchill, daughter of Sir Winston"]}, {"page": "The Gathering Storm (2002 film)", "response": ["* Nancy Carroll as Diana Churchill"]}, {"page": "Edwina Sandys", "response": ["She is the eldest daughter and second child of Baron Duncan-Sandys and Diana Churchill, and a granddaughter of the statesman Sir Winston Churchill."]}, {"page": "Diana Sandys", "response": ["#REDIRECT Diana Churchill"]}, {"page": "John Spencer-Churchill (artist)", "response": ["His paternal grandparents were Lord Randolph Churchill, the third son of the 7th Duke of Marlborough, and his wife, Lady Frances Vane, and Lady Randolph Churchill (née Jennie Jerome), an American who was the daughter of Leonard Jerome, one of the richest and most influential men in New York City in the middle to late 19th century, and a frequent business partner of Cornelius Vanderbilt.Burrows & Wallace  Through the Jerome family, he was a cousin of Clare Sheridan, the sculptor. Through his uncle Winston, he was a first cousin of Diana Churchill, Randolph Churchill, Sarah Tuchet-Jesson, Lady Audley, Marigold Churchill, and Mary Soames, Baroness Soames."]}, {"page": "John Farrow", "response": ["Farrow was a notorious playboy in his youth, being linked to Dolores del Río and Diana Churchill among others. He married Felice Lewin on 18 August 1924. They had one daughter, Felice Patricia Farrow (1925–1997). The marriage ended in divorce in September 1927. Farrow began a relationship with Lila Lee in 1928, and they became engaged. However, they never married and their relationship ended in 1933 after Lee discovered Farrow was being unfaithful to her."]}]}}