{"wiki_id": "http://www.wikidata.org/entity/Q5274523", "itemLabel": "Diederick Santer", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Diederick_Santer", "wikipedia_page": {"main": "Diederick Santer (born 3 July 1969) is a British television producer and is best known for his work on the popular BBC television soap opera EastEnders, a post which he assumed on 23 October 2006 and left on 1 March 2010. He was Chief Executive of production company Kudos from 2015 to 2019, and is currently Chief Creative Officer of BritBox International.\nHe is the son of the retired Anglican Bishop Mark Santer.\n\n", "link_mentions": [{"page": "EastEnders", "response": ["On 21 September 2004, Berridge quit as executive producer of EastEnders following continued criticism of the show. Kathleen Hutchison was swiftly appointed as the Executive Producer of EastEnders, and was tasked with quickly turning the fortunes of the soap. During her time at the soap Hutchison axed multiple characters, and reportedly ordered the rewriting of numerous scripts. Newspapers reported on employee dissatisfaction with Hutchison's tenure at EastEnders. In January 2005, Hutchison left the soap and John Yorke (who by this time, was the BBC Controller of Continuing Drama Series) took total control of the show himself and became acting Executive Producer for a short period, before appointing Kate Harwood to the role. Harwood stayed at EastEnders for 20 months before being promoted by the BBC. The highly anticipated return of Ross Kemp as Grant Mitchell in October 2005 proved to be a sudden major ratings success, with the first two episodes consolidating to ratings of 13.21 to 13.34 million viewers.\"Ross Kemp signs to EastEnders\", BBC. URL last accessed on 24 February 2007.\"Kemp's EastEnders return extended\", BBC. URL last accessed on 24 February 2007. On Friday 11 November 2005, EastEnders was the first British drama to feature a two-minute silence.\"Alfie accepts Nana's fate \" Retrieved 24 September 2006 This episode later went on to win the British Soap Award for 'Best Single Episode'.\"British Soap Awards 2005 – The Winners \" Retrieved 24 September 2006 In October 2006, Diederick Santer took over as Executive Producer of EastEnders. He introduced several characters to the show, including ethnic minority and homosexual characters to make the show 'feel more 21st Century'. Santer also reintroduced past and popular characters to the programme.", "EastEnders has always featured a culturally diverse cast which has included black, Asian, Turkish, Polish and Latvian characters. \"The expansion of minority representation signals a move away from the traditional soap opera format, providing more opportunities for audience identification with the characters and hence a wider appeal\". Despite this, the programme has been criticised by the Commission for Racial Equality, who argued in 2002 that EastEnders was not giving a realistic representation of the East End's \"ethnic make-up\". They suggested that the average proportion of visible minority faces on EastEnders was substantially lower than the actual ethnic minority population in East London boroughs, and it therefore reflected the East End in the 1960s, not the East End of the 2000s. The programme has since attempted to address these issues. A sari shop was opened and various characters of different ethnicities were introduced throughout 2006 and 2007, including the Fox family, the Ahmeds, and various background artists.\"The art of storytelling\", The Guardian. Retrieved 27 March 2007. This was part of producer Diederick Santer's plan to \"diversify\", to make EastEnders \"feel more 21st century\". EastEnders has had varying success with ethnic minority characters. Possibly the least successful were the Indian Ferreira family, who were not well received by critics or viewers and were dismissed as unrealistic by the Asian community in the UK.", "In October 2009, a 12-part Internet spin-off series entitled EastEnders: E20 was announced. The series was conceived by executive producer Diederick Santer \"as a way of nurturing new, young talent, both on- and off-screen, and exploring the stories of the soaps' anonymous bystanders.\" E20 features a group of sixth-form characters and targets the \"Hollyoaks demographic\". It was written by a team of young writers and was shown three times a week on the EastEnders website from 8 January 2010. A second 10-part series started in September 2010, with twice-weekly episodes available online and an omnibus on BBC Three. A third series of 15 episodes started in September 2011."]}, {"page": "Peggy Mitchell", "response": ["In 2009 Peggy ran as an independent candidate in the local council elections against Archie's wishes. Writers wanted a storyline that allowed Peggy to stand up for her beliefs, and felt that running for local government would allow her to speak passionately about the community. After a scene showed Janine Butcher (Charlie Brooks) asking Peggy, \"Where would Tony Blair have been without Alastair Campbell?\", Campbell responded by giving advice to Peggy in a video blog. A response from Peggy was then recorded, thanking Campbell for his input. Peggy pulled out of the election at Archie's request ahead of their wedding, however the storyline set up a later episode in which Boris Johnson made a guest appearance in EastEnders. On 1 October 2009, Johnson appeared in the show as himself, visiting Walford and The Queen Victoria and conversing with Peggy. Johnson commented on his appearance: \"It was, of course, a tremendous honour to step inside that most venerable of London landmarks, The Queen Vic, and share a scene with another of the capital's icons, the fabulous Barbara Windsor.\" Executive producer Diederick Santer stated: \"We couldn't let the visit pass without the Mayor entering London's most famous pub, The Queen Vic, and meeting its formidable and politically active landlady Peggy Mitchell.\" The episode was watched by 8 million viewers, winning EastEnders a 38% audience share in the timeslot.", "On 28 October 2009 it was announced that Windsor had quit the show and would leave in 2010 after 15 years. She said: \"EastEnders has been wonderful to me and it's no secret that it changed my life all of those years ago. I'll be so sad to leave Peggy behind; she's such a wonderful character to play. I have had the pleasure of working with a marvellous cast and crew and have made many lasting good friends. To have had the honour of showing the Queen around the set is something that will stay with me forever.\" Executive producer Diederick Santer said: \"Barbara has contributed so much to EastEnders over the last 15 years, plus countless episodes, and countless amazing storylines. Peggy Mitchell is a truly iconic character, and along with Steve McFadden and Ross Kemp, Barbara has made the Mitchells the premier family of British soap.\" Windsor filmed her final scene on 16 July 2010. Peggy's final episode, which aired on 10 September 2010, was preceded by a number of television trailers in August and a new section on the EastEnders website dedicated to the character. The episode ended with a special reworking of the piano version of the EastEnders theme tune known as \"Julia's Theme\", called \"Peggy's Theme\". Tribute was then paid to her in a clip programme, Peggy Mitchell: Queen of the Vic.  Peggy's final episode attracted 10.1 million viewers, and was the second most-watched programme in the week of 6–12 September."]}, {"page": "Patsy Palmer", "response": ["In 2005, Palmer publicly criticised EastEnders, branding the storylines ridiculous and unbelievable and stating that she \"wouldn't go back to EastEnders\". However, in October 2007 the BBC announced that Palmer would be returning to the soap as a full-time character; she made her comeback on-screen in April 2008. Palmer has commented \"I can't wait to explore what Bianca has been doing with her life and seeing what she is going to get up to next\", and EastEnders executive producer, Diederick Santer, added, \"I'm delighted to welcome Patsy Palmer home to EastEnders. Bianca is one of the most popular characters the show has ever had\". In 2014, Palmer announced that she was leaving the series. She reprised the role again in the autumn of 2019 for a short stint. In February 2020, it was announced that Palmer would be reprising her role as Bianca again, with scenes set to air later in the year. However, this was later cancelled due to the Coronavirus pandemic restrictions."]}, {"page": "Haddon Hall", "response": ["The 1985 documentary TV series Treasure Houses of Britain showcases Haddon Hall at the very end of the last episode. The interior and exterior of Haddon Hall (including the Long Gallery) were used in 1986 as Prince Humperdinck's castle in The Princess Bride. In 1990, the hall was the set for the castle of the giants at Harfang in the BBC's adaptation of The Silver Chair, one of C.S. Lewis's Chronicles of Narnia. Franco Zeffirelli chose Haddon Hall as the location for his 1996 film Jane Eyre, and the Hall featured in the 1998 film Elizabeth. It also appeared in the 2005 film version of Pride & Prejudice. It was the setting in 2006 of Thornfield Hall in Diederick Santer's 2006 BBC television version of Jane Eyre\"Thornfield Hall in Masterpiece Theatre's Jane Eyre, hookedonhouses.net, 12 January 2009 and in Cary Fukunaga's 2011 film of Jane Eyre. The hall was the setting for A Tudor Feast at Christmas, a BBC2 documentary recreation of a Tudor banquet (first broadcast Christmas 2006) by the team of academics from Tales from the Green Valley,\"A Tudor Feast at Christmas and was a location for the BBC Television series Gunpowder (2017). In 2015, in the first episode of the Channel 4 programme Time Crashers, the hall was the setting for a 1588 Elizabethan era feast."]}, {"page": "Santer", "response": ["*Diederick Santer (born 1969), British television producer"]}, {"page": "Patrick Trueman", "response": ["Yolande Trueman (Angela Wynter) was introduced in 2003 as a love interest for Patrick. Following their screen marriage in 2004, the characters were involved in the BBC's season \"Taking Care\", which covered issues \"surrounding a different kind of childhood\". The Truemans were involved in a storyline about fostering after they decided to foster a 14-year-old boy, JJ, following an encounter with him at their Bed and Breakfast. In 2007, executive producer Diederick Santer used Patrick and Yolande to cover a storyline about racism, that according to the producer, was inspired by the 2007 Celebrity Big Brother race row, sparked by supposed racist bullying of Bollywood actress Shilpa Shetty by UK celebrity Jade Goody. In the storyline, the characters Jay Brown and Sean Slater used racist phrases to the Truemans, and their reaction to the insults. Santer commented, \"The Celebrity Big Brother race row kicked off as I took charge of my first scripts. I thought it was fascinating because it showed there was a real need for a debate about race in Britain. [Big Brother] didn’t do it particularly well, so I thought it could be something EastEnders should do. Our stuff won’t be overly moralistic or preachy but it will tackle this serious issue head on.\" Wynter was axed from EastEnders in 2008, ending Patrick and Yolande's screen union. Discussing Wynter's axing, Rudolph Walker said: \"I really enjoyed working with Angela, because apart from anything else, she was a tremendous help to me – we've known each other a long time. I have to be thankful for the time she was in the show, and I'm in regular contact with her. I know she does watch EastEnders and while she obviously misses being part of the cast, she still enjoys it. Whether she's keeping an eye on Patrick or Rudolph, I can't be sure!\""]}, {"page": "Kim Medcalf", "response": ["In 2001, Medcalf took over the role of Sam Mitchell from Danniella Westbrook. She filmed her first scenes with Barbara Windsor in Spain, which aired in January 2002. She won the best newcomer award in 2002. Medcalf opted to leave EastEnders in 2005. Medcalf's final scenes were filmed in September 2005 and screened in November of that year. Her character escaped imprisonment as an accessory to the murder of Den Watts and left to join her brother, Grant Mitchell, in Brazil. Her final scenes aired on 17 November 2005. The role was again recast to Westbrook in 2009, with producer Diederick Santer opting to bring the original actress back."]}, {"page": "Yolande Trueman", "response": ["Following their screen marriage in 2004, the Truemans were involved in the BBC's \"Taking Care\" season, which covered issues \"surrounding a different kind of childhood\". As part of this, scriptwriters decided that the Truemans would foster a 14-year-old boy, JJ, following an encounter with him at their Bed and Breakfast. In 2007, executive producer Diederick Santer used Patrick and Yolande to cover a storyline about racism, that according to the producer, was inspired by the 2007 Celebrity Big Brother race row, sparked by the racist bullying of Bollywood actress Shilpa Shetty by UK celebrity Jade Goody. In the storyline, the characters Jay Brown and Sean Slater used racist phrases to the Truemans, and their reaction to the insults. Santer commented, \"The Celebrity Big Brother race row kicked off as I took charge of my first scripts. I thought it was fascinating because it showed there was a real need for a debate about race in Britain. [Big Brother] didn’t do it particularly well, so I thought it could be something EastEnders should do. Our stuff won’t be overly moralistic or preachy but it will tackle this serious issue head on.\""]}, {"page": "Harold Legg", "response": ["Since his retirement, Dr Legg makes several brief cameos in the soap, his returns relating to storylines concerning other long-running characters. In 2000, executive producer John Yorke brought him back for the death of Ethel Skinner, in 2004 Louise Berridge brought him back for the funeral of Mark Fowler (Todd Carty), and he was brought back for one episode in 2007 by Diederick Santer, to provide counsel for the character Dot Branning (June Brown)."]}, {"page": "Dot Cotton", "response": ["Executive producer Diederick Santer has discussed the \"wonderfully dysfunctional mother-son relationship\" Nick shares with Dot and her perpetual willingness to give Nick another chance regardless of his history of wrongdoing. Santer explained: \"There's that thing where you sort of dare to hope that someone's changed, which is really tragic. They've let you down a hundred times, and yet you still hope that the hundred and first time they'll have changed.\" Actor Leslie Grantham has stated that Dot is the \"one friend in [Nick's] life\", while series story producer Dominic Treadwell-Collins has affirmed: \"Dot's always going to forgive him. And that's the beauty of Nick and Dot.\" Concurring with this sentiment, John Altman (Nick) agreed: \"No matter what he does, she'll forgive him. So did a lot of gangsters' mothers throughout history. Probably Al Capone's mother thought he was a sweet lad, you know.\"", "Brown was nominated for the 'Best Actress' BAFTA award for Dot's single-hander EastEnders episode in 2009; she became the first soap actress nominated in the category since 1988, when Jean Alexander was shortlisted for her role as Hilda Ogden in Coronation Street. The show's executive producer, Diederick Santer, described Brown's BAFTA nomination as his proudest moment of 2009, saying: \"I'm not one to complain to the referee, but it's beyond me why she didn't win. Week in, week out, she turns out amazing performances. The audience knew it and we knew it. With the greatest respect to the actress who won, you could hear the audience in the Royal Festival Hall that night sigh with disappointment. It was a missed opportunity by BAFTA – of which I'm a member – to connect with a big audience.\" Brown has also won 'Best Actress' for her role as Dot at the Inside Soap Awards in 2001 and 2004, as well as the 'Outstanding Achievement' award in 2003, and 'Best Couple' in 2005 with John Bardon, as Dot and Jim Branning. She and Bardon also won 'Best On-Screen Partnership' at the British Soap Awards in both 2002 and 2005, while in 2005, Brown won a 'Lifetime Achievement' award for her role, again at the British Soap Awards. The role also resulted in several award nominations including a 'Most Popular Actress' nomination at the National Television Awards in 2005, and a 'Best Actress' nomination at the 2007 TV Quick and TV Choice Awards among others. Dot was also voted the 46th best television character in a television poll entitled The 100 Greatest Television Characters."]}, {"page": "Charlie Brooks", "response": ["In April 2008, Brooks returned to EastEnders for a guest stint. She was later confirmed to be coming back as a regular character. She said, \"I had doubts to begin with, mainly because of Kiki, as I know how full-on EastEnders can be, and then there's that stigma about going back to a soap. But I'm so pleased I did, it was the right decision. Especially with what's going on at the moment, I feel really lucky to have a job and I need the security because of Kiki. I was just going to go back for a year, but I had a meeting with the boss last week and we're going to go for another year. So lots more time to get up to much mischief\". Executive producer Diederick Santer said, \"I couldn't be more pleased that Charlie Brooks is re-joining EastEnders. With her appearances last month, she reminded us what a fine actress she is, and what an intriguing, watchable and engaging character she plays as Janine\". She temporarily departed in September 2012, and returned in April 2013 before departing again in March 2014."]}, {"page": "Sonia Fowler", "response": ["On 25 October 2009 it was announced that Cassidy would return to the soap to reprise her role as Sonia, along with Coulson, Gaffney and Anderson. The characters would reunite with Bianca who returned in 2008. Cassidy is quoted as saying \"To be invited back to EastEnders is such an honour and I am very, very excited that Sonia is coming back. For me, to be reunited with the original Jacksons is a dream come true and I think it will be a fantastic storyline.\" A source told entertainment website Digital Spy: \"Everything's being kept hush-hush about the Jacksons' return at the moment, but there are certainly a load of questions to be answered. Will the frosty relationship between Carol and Bianca thaw? Are Sonia and Martin still together? And how will Robbie react when he learns of his beloved Wellard's death? Everyone's so pleased to have them back.\" The family returned for Bianca's second wedding to Ricky Butcher as part of the show's 25th anniversary. Executive producer Diederick Santer explained that he wanted great stories to get people talking, saying \"The wedding is the perfect opportunity for us to bring back the much-loved Jackson characters – Carol, Sonia, Robbie and Billie.\" In December 2010, it was announced Cassidy would return to EastEnders, as Sonia in order to facilitate a temporary storyline departure for co-star Palmer, who was due to take maternity leave. Sonia's one-off return was broadcast on 21 January 2011."]}, {"page": "Sam Mitchell (EastEnders)", "response": ["Sam Mitchell (also Butcher and Hunter), is a fictional character from the BBC soap opera EastEnders. The third member of the Mitchell family to be introduced, Sam arrived as a 15-year-old school girl in July 1990, played by Danniella Westbrook. The actress quit in 1993, but Sam was reintroduced from 1995 to 1996 and from 1999 to 2000. In both her 1996 and 2000 exits, Sam was written out earlier than the producers intended due to off-screen controversies surrounding Westbrook. In early 2002, the character was introduced for a fourth time, but the role was recast to another actress, Kim Medcalf, who stayed in the role until late 2005. Diederick Santer later decided to reintroduce the character for a brief stint in 2009 and he opted to bring Westbrook back. Sam resurfaced in September 2009 for a short stint and departed in January 2010, before then reappearing for another short stint from August until September that year. In 2016, Westbrook agreed to reprise the role once again in the events that surrounded the funeral for her on-screen mother Peggy Mitchell (Barbara Windsor); this started on 30 June that and finished after four episodes on 8 July. In January 2022, it was announced that Sam would be returning to the show, this time played by Kim Medcalf again.", "Westbrook returned to the show in 2009 in part of a shock storyline. Speaking of her comeback, she said, \"I'm really happy to be coming back, it feels just like coming home. I'm really looking forward to working with Barbara [Windsor], Steve [McFadden], Sid [Owen] and Patsy [Palmer] and I'm over the moon to be working with the new boss Diederick Santer. I can't wait to get the scripts to see what Sam Mitchell has been up to since she was last in the Square.\"", "Westbrook was contracted for three months, and although it was extended slightly, she departed from the show at the end of her storyline in the episode broadcast on 11 January 2010. In an interview given with Digital Spy, Diederick Santer said: \"When Danniella and I first sat down to talk about her return, we discussed a particular storyline with a specific length of contract. These plans haven't changed. Danniella has done brilliantly and I hope that she will be back with us at some point in the future.\" Westbrook filmed her final scenes at the end of October 2009."]}, {"page": "EastEnders spin-offs", "response": ["In October 2009, a spin-off series entitled EastEnders: E20 was announced. Conceived by executive producer Diederick Santer, it was developed \"as a way of nurturing new, young talent, both on- and off-screen, and exploring the stories of the soaps' anonymous bystanders.\" EastEnders: E20 characters are a group of sixth form students and it targets the \"Hollyoaks demographic\". It was written by a team of young writers and was shown on the EastEnders website in January 2010. A second series was commissioned for later in 2010, and a third series for 2011."]}, {"page": "Nick Cotton", "response": ["Nick has been described by EastEnders' executive producer Diederick Santer as \"the show's premier villain\". An EastEnders Revealed documentary chronicling the character's time on the show deemed him a liar, a thief and a murderer who \"thrived on the pain and the misery of those near to him\". Co-star Charlie Clements (Bradley Branning) has stated: \"You think of soap bad guys, Nick Cotton is definitely up there with the best of them\", while Leslie Grantham (Den Watts) opined that \"There is no redeeming feature about Nick Cotton whatsoever\". This assessment is shared by series story producer Dominic Treadwell-Collins, who has explained: \"It's good to have an out and out villain. I think sometimes you can get a character and go 'Oh, they should have a good side as well, and maybe we should redeem them a little bit.' With Nick, it doesn’t matter. You can go full pelt, foot-on-the-accelerator bad guy.\" John Altman has discussed the fact that he cannot remember his character ever once being nice, blaming Nick's unruliness on his father's absence during his childhood. Santer has discussed the \"wonderfully dysfunctional mother-son relationship\" Nick shares with his mother, Dot Cotton (June Brown), and her perpetual willingness to give Nick another chance, regardless of his history of wrongdoing. Santer explained: \"There's that thing where you sort of dare to hope that someone's changed, which is really tragic. They’ve let you down a hundred times, and yet you still hope that the hundred and first time they’ll have changed.\" Grantham has stated that Dot is the \"one friend in [Nick's] life\", while Treadwell-Collins has affirmed: \"Dot's always going to forgive him. And that's the beauty of Nick and Dot.\" Concurring with this sentiment, Altman agreed: \"No matter what he does, she’ll forgive him. So did a lot of gangsters' mothers throughout history. Probably Al Capone's mother thought he was a sweet lad, you know.\"", "On 2 October 2008 it was reported that Nick would return to EastEnders on Christmas Day that year after more than seven years away. Executive producer Diederick Santer spoke of his excitement at Nick's return, hailing the character as an \"EastEnders legend\" and \"one of the show's best-remembered and best-loved villains\". Altman stated: \"After an absence of seven years, I am thrilled to return to Albert Square. The BBC have always given me great storylines as Nick Cotton and I look forward to seeing if Nick will once again spread fear and loathing throughout the Square!\" June Brown revealed that she had been asking producers to bring Altman back to the soap for 6 or 7 years, as the two of them share such a good working relationship. After spending time in Walsall, Cotton returns; walking normally again, and he is accompanied by his seven-year-old daughter, Dotty. He explained that he had met Dotty's mother Sandy Gibson while living in a squat, and that she was an alcoholic who had recently died, leaving him with custody of Dotty. Altman explained: \"Nick needed something, because I think if he didn’t have little Dotty, for him to walk through that door, she would just have treated him as a complete outcast.\" The actor described other changes to his character since his last appearance, detailing how he had become a plumber, begun dressing more smartly, stopped gelling his hair back and no longer wore an earring."]}, {"page": "Janine Butcher", "response": ["Four years after her initial departure, Brooks was asked to reprise the role by executive producer Diederick Santer as part of a storyline that was dubbed \"Frank Week\". Mike Reid died in July 2007, and due to the popularity of the character he played, Santer decided that Frank would also be killed off in the serial. A funeral was held for the character as a tribute to both the actor and the \"iconic\" character he played. ", "In December 2009, the show's executive producer, Diederick Santer teased about upcoming storylines involving Janine and her flatmate Ryan Malloy (Neil McDermott), saying: \"There's something really interesting with Ryan and Janine [...]. They're both people who don't know how to love. So will they fall in love? And if they do, can they cope with it? Will they understand the alien feelings coursing through their bodies?\" In August 2010, Janine proposes to Ryan. Brooks said that the idea of getting married would be daunting for the character, but added that she believes Janine is genuinely in love with Ryan. She commented: \"It's easy to assume that Janine is playing games or using him for sex, but [...] Ryan clearly adores her too, so he may be the man to tame her wild ways.\" Brooks hinted at possible trouble for the couple if Janine discovers that Ryan fathered a baby with Stacey Branning (Lacey Turner), saying \"Janine will be absolutely destroyed when she finds out. She wants Ryan all to herself, and the idea of a baby snatching his attention away would be devastating. All she needs is to be loved.\" McDermott stated that he believed Ryan was the right man for Janine, and that they could be perfect for each other, saying: \"Janine's never loved any of the men she's been with before. She has only ever been in it for the money. Ryan understands her and knows why she does the things she does. They both forgive one another's mistakes very easily, and that's why their partnership works.\""]}, {"page": "Kate Harwood", "response": ["Harwood spent over 15 years working at the BBC, including as Script Editor and Script Executive, before becoming an executive producer in the BBC Drama Serials department. As a producer, she has worked on dramas including The Beggar Bride, Close Relations, The Echo, David Copperfield, Man and Boy and BAFTA winner Charles II: The Power and The Passion (released in the US under the title The Last King: the Power and the Passion of Charles II, in a heavily edited version on the A&E cable network). In her role as executive producer in BBC drama serials, she was responsible for programmes including Crime and Punishment, Daniel Deronda, The Lost World, and Final Demand. Harwood was appointed the executive producer of EastEnders in February 2005, a position she retained until October 2006, when she was succeeded by Diederick Santer. As well as being responsible for the introduction of several new families, such as the Brannings and the Foxes, she introduced such characters as Sean Slater and May Wright, as well as the departures of many popular characters such as Sharon Watts and Dennis Rickman, Chrissie Watts, Kat Moon and Alfie Moon, Sam Mitchell, Nana Moon, Jake Moon, Little Mo Mitchell, Johnny Allen and Pauline Fowler and oversaw numerous high-profile storylines, such as Pauline Fowler’s murder; Billy and Honey’s wedding and daughter being born with Down's Syndrome; and the domestic abuse storyline between Denise Fox and Owen Turner as well as the discovery of Den Watts' body under the Queen Vic. She was also responsible for such ratings-winners as Dennis Rickman’s stabbing and the critically acclaimed return of the Mitchell brothers, which drew respective audiences of 12 and 13 million viewers. Other storylines, however, such as a brief lesbian affair between Sonia and Naomi, \"Get Johnny Week\", and the handling of Pauline Fowler's departure were not as well received, and prompted further media criticism; in July 2006, EastEnders fell to just 3.9 million viewers, its lowest-ever viewing figure. Her final episode aired on 4 January 2007. In December 2012, Harwood took the position of BBC Head of Drama, replacing John Yorke."]}, {"page": "Mohammed George", "response": ["George was arrested on 8 December 2006 for a suspected assault on girlfriend Emma Archibald during an argument outside a restaurant. She corroborated the claims, in what started as an argument over who should empty the dishwasher.  George was cautioned by the police for having swung a bag of rubbish, and was subsequently suspended by EastEnders Executive Producer Diederick Santer for two months. He apologised to the BBC and the show's producers."]}, {"page": "EastEnders theme tune", "response": ["The theme has also been remixed into a much slower and less dramatic version for use with EastEnders Revealed and a rock version for use with EastEnders Xtra. Subsequent spin-offs Ricky & Bianca, Perfectly Frank and EastEnders: Slaters in Detention have used the softer guitar version. 2010 internet spin-off EastEnders: E20 features a new remix of the theme tune, which was chosen by producer Deborah Sathe, executive producer Diederick Santer, Simon May, director Michael Keillor and BBC Radio 1Xtra's DJ Ace from entries in a competition launched on Annie Mac's BBC Radio 1 show. The winner was announced on 4 December 2009 as Carl Darling."]}, {"page": "Mickey Miller", "response": ["Mickey Miller is a fictional character from the BBC soap opera EastEnders, played by Joe Swash. He made his first appearance on 15 April 2003. Introduced as a guest character, Mickey proved popular and was turned into a regular by executive producer Louise Berridge. The character is portrayed as a wheeler-dealer, involved in various money-making scams. A family was built around the character in 2004 when the other Millers moved to Albert Square. It was announced on 25 February 2008 that the characters of Mickey and his stepfather Keith had been axed by EastEnders' executive producer Diederick Santer. Mickey left on 1 July 2008. In July 2011, it was announced Swash would reprise his role for the departure storyline of his screen brother Darren and appeared for two episodes on 19 and 20 September 2011.", "In February 2008, it was announced that Mickey and his stepfather Keith were being axed from EastEnders. The characters were two of several axed by executive producer Diederick Santer that year. Others included Gus Smith, Steven Beale, and Honey Mitchell. Their axing lead to further disbandment of the Miller/Swann family. Both Mickey and Keith survived the axe in 2006 when Rosie and Demi Miller were written out. Darren Miller and Dawn Swann, the only remaining family members, were kept on."]}, {"page": "Dawn Swann", "response": ["In March 2009, it was announced that Tointon, along with Groves, had been axed from the show, as producers had decided not to renew her contract. Tointon said she was excited about her exit storylines, but was also reportedly upset by the axing, saying \"I was heartbroken when they told me and I have to admit I did cry. I just have to dust myself down and get back out there. I've already told them that if they do plan to kill Dawn, I will refuse to close my eyes in the dying scenes.\" She said she felt sad for Dawn after hearing she would embark on an affair with Garry's boss, Phil Mitchell (Steve McFadden), but understood that it was probably right for her contract to not be renewed, as she hadn't had many storylines in 2008, saying \"you can only go as far as your storylines take you.\" Following the axing, executive producer Diederick Santer said, \"Dawn and Garry have some fantastic stuff to come — this spring and summer sees their love truly put to the test — and they go with our thanks and very best wishes.\" After the exit was aired, Tointon said she did not think it was very good: \"Well it was interesting on the boat. Well... it was better than leaving in a black cab. When I watched it, I didn't think it was very good. But I did my best.\" She later admitted that the show's producers were probably right to axe the character and she was getting annoyed that Dawn did not learn from her past mistakes."]}, {"page": "Frank Butcher", "response": ["The sudden death of Mike Reid in July 2007, given his identification with the role, made the future return of the character unlikely. Executive producer, Diederick Santer, announced in November 2007 that the character would die off-screen; this would ultimately happen at the end of March 2008, when it was revealed that Frank had succumbed to throat cancer. On-screen, Frank was brought back to Walford to be cremated and was given a send-off in a special week of episodes, dubbed Frank Week, which saw his former wives Peggy and Pat reigniting their old feud. Throughout the episode of his funeral on 1 April, old clips of Frank's time in the serial were played as flashbacks, including Frank and Pat's wedding from 1989 and Frank naked in a revolving bow-tie from 2000."]}, {"page": "Dean Wicks", "response": ["Dean Wicks (known as Deano in his initial stint) is a fictional character from the BBC soap opera EastEnders played by Matt Di Angelo. He made his first appearance on 2 January 2006. It was announced on 18 August 2007 that the characters of Deano and his sister Carly Wicks (Kellie Shirley) were being axed by executive producer Diederick Santer. Deano made his final appearance on 7 February 2008. On 15 January 2014, it was announced that Deano, now called Dean, would be returning and Di Angelo would begin filming the following month.EastEnders: Matt Di Angelo returning as Deano Wicks – EastEnders News – Soaps – Digital Spy Di Angelo took a three-month break from the soap from January to April 2015, with a one-off appearance in February to tie in with the show's 30th anniversary celebrations. In October 2015, it was announced that Di Angelo would be leaving the show in early 2016. The character is arrested for attempted rape with his final scenes set in court airing on 4 and 5 February 2016. On 19 August 2016, Dean is acquitted of attempted rape after standing trial off-screen."]}, {"page": "Peter Beale", "response": ["In May 2009, Executive producer Diederick Santer praised the younger cast of EastEnders, including Law. Stuart Heritage from The Guardian expressed a dislike for Peter in April 2010, saying he should be written out, \"before his increasingly spectacular haircut goes power mad and starts to colonise the entire set. Also, his voice has been breaking for what seems like seven full years, so he could probably use his new-found free time to consult a doctor or something.\""]}, {"page": "Stacey Slater", "response": ["Although Stacey and Bradley split up at Christmas 2007 when her affair with Max is revealed, they reunite in December 2009 following Stacey's diagnosis with bipolar disorder (see below). Executive producer Diederick Santer commented on the storyline, saying \"Bradley and Stacey are together – that's what I want, that's what the audience wants and that's what the characters want. Together, they're very strong and they can take on the world. She's good with him, she takes her medication and on the face of it, she's the Stacey Slater we've always known. As ever with Stacey, though, there's a lot hidden. There are a lot of vulnerabilities there but she and Bradley want to make a go of things.\"", "After losing her friend Danielle Jones, Stacey began acting strangely in May 2009, and the character has to come to terms with the prospect that, like her mother, she also suffers from bipolar disorder. The storyline was developed as of the BBC's Headroom campaign, which aims to encourage people to look after their mental wellbeing. Series Consultant Simon Ashdown had been developing the storyline for about a year. To accurately reflect the issue, EastEnders worked closely with various charities such as Mind and MDF The BiPolar Organisation, medical practitioners and bipolar sufferers when researching the storyline. The story was moulded around what Stacey would do in that situation and what the research led the team to believe was the most truthful way events would develop. Executive producer Diederick Santer said that the initial buildup of the storyline was an extension of how the character has always been, \"a character of highs and lows, of great passions and dark moods,\" but these highs and lows would become more contrasted, and viewers would realise that Stacey's mood is more complex than just being upset over her losses, adding, \"It's the beginning of us getting to really know and understand who Stacey is and what makes her behave the way she does.\" Turner hoped that she could do the storyline justice, saying that she believed it was great that EastEnders continued to raise awareness of the issue."]}, {"page": "Keith Miller (EastEnders)", "response": ["Keith Miller is a fictional character from the BBC soap opera EastEnders, played by David Spinx. He made his first appearance on 6 September 2004. It was announced on 25 February 2008 that the characters of Keith and Mickey had been axed by EastEnders' executive producer Diederick Santer. He left the show on 1 July 2008.\"'Enders boss axes Mickey and Keith\", Digital Spy. URL last accessed 2008-02-25."]}, {"page": "Darren Miller", "response": ["In December 2009, the show's executive producer Diederick Santer was asked what his favourite storyline of the year had been. He replied \"I loved the way the 'Who's The Daddy?' story with Heather played, too. As time goes on, I expect we'll discover more about what happened that night. It makes sense to me – he's a horny, drunk 18-year-old! Everyone thinks that they did it in the [toilet] cubicle, but it's surely clear that they went home?\""]}, {"page": "Emma Barton", "response": ["Barton joined the cast of EastEnders as Honey in November 2005 and played the role until September 2008 when the character was one of several written out by executive producer Diederick Santer that year. Following a brief return in 2014, it was announced on 6 September 2015 that Barton would return to the role permanently in November that year.Radio Times, 6 September 2015., Radiotimes.com, Retrieved 6 September 2015."]}, {"page": "Kathy Beale", "response": ["In 2010, Taylforth said that she wished that Kathy could come back from the dead and that it was a mistake to kill her off. Earlier that year executive producer Diederick Santer revealed that he would like to have brought back Kathy from the dead but vowed not to revive deceased characters. Taylforth reiterated her desire to return to EastEnders in 2013 and that she heard a writer in 2011 saying that producers wanted her to return and asked her if she could think of a way to bring Kathy back. She revealed that producer John Yorke told her that killing off Kathy was \"one of the biggest mistakes they've ever made\", and the writer who had decided to kill off Kathy regretted it afterwards, though said it was a \"good idea at the time\". EastEnders spokespeople stated there were currently no plans for Taylforth to return and that some of the producers who had said they wanted Kathy to return had since left.  In 2014, Taylforth revealed that she doubts whether Kathy is really dead and said that many EastEnders viewers have written with proposed storylines on how she could make a return to the show."]}, {"page": "Bradley Branning", "response": ["On 13 November 2009, it was announced that Clements had quit the show and would depart in 2010, saying it is \"time to move on and take on some new roles\". Executive producer Diederick Santer promised \"a big exit\" for the character, saying \"I know viewers will miss him hugely, just as all of us who have worked with him will miss him too.\" Santer commented in December 2009: \"I always see departures as an opportunity. They're a shame if a much-loved actor wants to move on, but they're a chance to give characters an exciting and significant exit. Bradley's departure relates to some of the stories we're playing either side of the 25th anniversary and I can certainly promise a memorable exit for him.\""]}, {"page": "Robbie Jackson", "response": ["On 25 October 2009, it was announced that Gaffney would once again reprise his role, along with other Jackson family members Carol, Sonia and Billie. Gaffney is quoted as saying \"I am really looking forward to returning to EastEnders for what looks set to be a really exciting storyline. I was thrilled when Diederick [Santer, executive producer] called me personally to ask for Robbie to return once more and working alongside Lindsey [Coulson], Natalie [Cassidy] and Patsy [Palmer] again makes it all the more special. I'm sure with the family being reunited it will mean that there must be a lot of drama in store.\" A source told entertainment website Digital Spy: \"Everything's being kept hush-hush about the Jacksons' return at the moment, but there are certainly a load of questions to be answered. Will the frosty relationship between Carol and Bianca thaw? Are Sonia and Martin still together? And how will Robbie react when he learns of his beloved Wellard's death? Everyone's so pleased to have them back.\" The family will return for Bianca's second wedding to Ricky Butcher as part of the show's 25th anniversary. Executive producer Diederick Santer explained that he wanted great stories to get people talking, saying \"The wedding is the perfect opportunity for us to bring back the much-loved Jackson characters – Carol, Sonia, Robbie and Billie.\""]}, {"page": "Steven Beale", "response": ["The character was eventually to make his return in September 2007, reintroduced by executive producer Diederick Santer as part of a storyline that saw Ian being stalked and terrorised by a mystery person, claiming to be his deceased ex-wife Cindy. After weeks of watching Ian tormented, viewers saw Ian lured to the top of a deserted block of flats, where Ian came face to face with his harasser, Steven. For several weeks, Ian was kept locked up in the derelict flat, while Steven returned to Albert Square to bond with his brother and sister, Peter and Lucy. Aaron Sidwell was cast in the role of Steven, making him the fourth actor to play him. It was Sidwell's first television role, and he has described it as \"a bit daunting...but everyone was really welcoming...the first few directors I worked with were fantastic...After we did rehearsal, after we did a take, they'd always give me feedback...I needed it.\" He added, \"I have been so lucky. Not many people get the chance to work on such a huge show, and my entrance was pretty impressive. I still wake up and think: 'Oh my God, I'm in EastEnders.' It's brilliant.\" Describing the motives behind Steven's actions, Sidwell said \"[Steven] was raised for 13 years thinking he was Ian's son...but he wasn't...He sees Ian as the cause of Cindy's death, because Cindy died in prison, and she went to prison because Ian put her there...so that's how he kind of sees that it's Ian's fault...very narrow-minded... Steven is..a messed up kid and when I first got the part I was given a catchphrase that describes him as a person...'look at me'...he wants to be in the limelight 100%...he wants people to be thinking about him [all the time]...that's why he got angry with Ian because Ian wasn't thinking about him... he's the most important person in the world.\"", "The storyline eventually reached its climax in October 2007. Steven's games were uncovered, and during the confrontation that followed, Steven threatened to kill himself, but accidentally shot Ian's wife Jane (Laurie Brett) and a resulting emergency hysterectomy meant that Jane could no longer have children of her own. The storyline has been described by The Guardian journalist, Stephen Armstrong, as having \"a whiff of Brontë about it\", which producer Diederick Santer agreed with. Santer added, \"It's a classic madwoman in the attic story, but I hate those articles where someone who works in popular television says what they do is like Dickens. It's about the balance. That story works because it has an old character whom the audience love – Ian Beale – as well as new characters who have an appeal for teenagers fresh to the show. Soap audiences like continuity. They dip in and out and if they haven't watched for a few weeks, then tune in to find no one they recognise, it can be disconcerting.\""]}, {"page": "Ricky Butcher", "response": ["Richard \"Ricky\" Butcher is a fictional character from the BBC soap opera EastEnders, played by Sid Owen. Introduced as a school boy in 1988, Ricky is one of the longest-running male protagonists to feature in EastEnders. Owen originally left the role in 2000 to pursue a music career. However, he reprised the role in 2002 before being axed by producer Louise Berridge in 2004. In 2008, producer Diederick Santer introduced the character for a third time, along with his wife Bianca Jackson (Patsy Palmer). Ricky is portrayed as unintelligent, simplistic, easily led and bossed around by dominant personalities. On 26 February 2011, it was announced that Owen would take a temporary break from the show.  The character exited on 19 July 2011, returning five months later on 13 December 2011. Ricky left EastEnders on 17 January 2012. Ricky returned to EastEnders on 20 June 2012 for the wedding of his sister, Janine Butcher (Charlie Brooks), before departing for the final time on 29 June 2012. In April 2016 he had voiced his interest in returning to EastEnders during an appearance on Celebrity Juice.", "It was announced on 29 October 2007 that Patsy Palmer would be reprising the role of Bianca in EastEnders. A day later, it was announced that Sid Owen would also be returning to the show as Ricky. Owen commented: \"It will be interesting to see what has been happening to Ricky and Bianca over the last few years. Although I must admit I'm not looking forward to her nagging me by shouting his name.\" Executive producer Diederick Santer commented: \"First Patsy comes home, now Sid! Ricky and Bianca were a hugely popular and well-loved partnership on the show [...] Seeing Bianca back on the show is exciting in itself, but to throw Ricky into the equation gives things an added dimension. Ricky's a great and much-loved character in his own right, but what's really exciting to me is the two of them together. There's so much history, drama and passion to explore [...] There'll always be a connection between Ricky and Bianca\". To promote the characters' return, the BBC began airing trailers across the BBC network in March 2008. One trailer utilised Bianca's \"trademark holler\" of Ricky's name, which is so loud that it smashes the windows of The Queen Victoria public house. The trailer featured the Righteous Brothers' song \"Hung on You\".", "In 2008, when it was announced that both Ricky and Bianca were being reintroduced, executive producer Diederick Santer described them as \"a hugely popular and well-loved partnership on the show\". Other media sources branded them two of \"the most popular characters on the soap\" and an \"iconic couple\". However, Hazel Davis of The Guardian was critical about their reintroduction. She commented, \"It's a no-brainer on the show's part. Last year, ratings for EastEnders were at an all-time low. But, just for once, wouldn't it be nice if a soap opera actually introduced new characters with verve and staying power rather than digging up the oldies?\". Conversely, Mark Wright from The Stage said that the decision to bring these much-loved characters back \"is very welcome\". He comments, \"Previous returns have been all about the numbers and not about the story, which is the cardinal sin in this game. While there is, of course, the resultant publicity that comes with any new or returning soap character being announced, the storyline possibilities for Ricky and Bianca arriving back in the Square are good. Bianca is turning up with a brood of kids in tow, all belonging to different fathers (how many of them can we expect to see over the next couple of years?). Like it! Ricky arrives with a glamorous WAG [...] on his arm. [...] I sense friction along the way, especially when Ricky realises he never got over Bianca (how could he?). All very well thought through and positive. This sounds like a soap getting back in touch with its roots.\"."]}, {"page": "Max Branning", "response": ["In May 2009, Wood said he hoped his character would get back with his wife, Tanya (Jo Joyner), saying: \"He believes Tanya still loves him. I think she does too.\" Later in 2009 Max gets into debt and tries to con various Walford residents. On conning single mother Heather Trott (Cheryl Fergison), Wood said \"Max has got a conscience but he's thinking about his own survival. He wants to keep his family at all costs.\" On hiding Max's debt problems from Tanya, Wood commented: \"Max thinks he can wriggle out of situations and admitting to debt would be a blow to his manhood. But Tanya would have understood and he'd have kept his family. [...] The problem between Max and Tanya has always been honesty. If Tanya finds out she may never trust Max again.\" When Tanya discovers Max's lies, she leaves him. This storyline facilitated Joyner's temporary departure on maternity leave. The show's executive producer Diederick Santer commented: \"Yet again, Max has messed up, hasn't he? He's learned to keep it in his trousers, but financially, he's corrupt. He's taken his eye off the ball business-wise and like a lot of people in the last year or two, he's found it tough going. His inability to show weakness or to share his problems with Tanya has been his downfall. He has to rebuild his life now and his long-term objective is to get Tanya back. Jo Joyner is of course returning to the Square but whether Max gets Tanya back is another thing. I don't know if he's good enough for her.\" Santer also revealed that some planned storyline material for Max and Tanya was put on hold until Tanya's return from maternity leave."]}, {"page": "Bianca Jackson", "response": ["Bianca Jackson  (also Butcher) is a fictional character from the BBC soap opera EastEnders played by Patsy Palmer. The character was introduced by executive producer Leonard Lewis and appeared initially from 1993 to 1999, when Palmer opted to leave. In 2002 executive producer John Yorke brought the character back for a special spin-off show. She returned to EastEnders as a full-time character in April 2008, reintroduced by executive producer Diederick Santer. Palmer took maternity leave in 2010 and Bianca left the series in January 2011. The character returned in December 2011 after Palmer signed a \"working mums\" contract, which granted her leave from the soap between April and November 2012. The actress quit EastEnders in 2014 and Bianca departed in September that year. Palmer reprised the role on 2 September 2019 for a guest stint and a second guest stint was scheduled for 2020, but later cancelled due to the COVID–19 pandemic.", "Despite Palmer's earlier reservations, it was announced on 29 October 2007 that she would be reprising the role of Bianca. EastEnders executive producer Diederick Santer said he was \"delighted\" that Bianca was returning, commenting: \"Millions grew up with her and, like the audience, I can't wait to see her back in the show. I'm really looking forward to the next chapter in her story.\"", "Bianca's most notable initial storyline upon her return was a pedophilia plot revolving around her new boyfriend Tony King (Chris Coghill), and her 15-year-old step daughter, Whitney. The idea for the storyline was conceptualized by writer Simon Ashdown and other scriptwriters, when they were brainstorming ideas for Bianca's return to EastEnders. They had seen a documentary about homelessness and had been struck by an image of a woman and child at a bus stop with nowhere to go, a scene that was used to similar effect in Bianca and her family's return episode. They considered the homeless family's predicament and were left pondering \"What might happen to them? They would be easy prey... What if a pedophile noticed the child, who might be, say, 12, and pretended to be the woman's saviour? She would be too grateful to notice that this was unusual behaviour, that he seemed to have few friends or family\". They pitched the idea to John Yorke, controller of BBC drama production, who said that \"It drew a sharp intake of breath. Most EastEnders stories that have been good and successful have been the ones that caused the sharp intake of breath, so they're always the kind of stories you look for.\" However, pedophilia as a storyline had been pitched before, but the idea had been vetoed because they could not find the right storyline and characters to proceed and, as the topic was so controversial, producers had been unwilling to take the risk. Diederick Santer commented, \"We knew that something like 16% of under-16s have been sexually abused at some point, but if you can't find a story, it's an issue that sits there, dead, on the show.\" It has been noted in the media that pedophilia is a subject rarely shown on pre-watershed terrestrial television, and although EastEnders had broached it in 2001 with Kat Slater (Jessie Wallace) and her abusive uncle Harry (Michael Elphick), this was scripted to have happened in the past and focused on the effect it had on the victim as an adult.", "The character of Bianca Jackson has received critical acclaim from critics and fans alike. EastEnders executive producers Diederick Santer and Jon Sen have described Bianca as \"one of the most popular characters EastEnders has ever had\", and an \"iconic creation\", respectively. James Rampton, journalist for The Independent, has commented that she is \"adored\". Palmer has suggested that viewers \"rooted\" for Bianca because \"people love a stroppy girl\". In 2000, she commented, \"[Bianca] makes them laugh. A character like that is about living out your fantasies. Everybody would love to be like Bianca and really say what they think.\" Following her exit from the serial in September 1999, Palmer said that members of the public would approach her to plead with her to return to EastEnders, as they missed her character and relationship with Ricky. She commented in 2000, \"It makes me feel bad. I sometimes think I should go back [to EastEnders] for everyone else's sake.\" When the character departed the serial in 1999, Molly Blake of the Birmingham Evening Post said \"Good riddance!\" She described Bianca as a \"king-sized pain in the backside [...] A screeching and screaming virago with a big mouth and pea-sized brain\" and a \"prize slapper [who] tormented all those whose paths [she] crossed.\""]}, {"page": "Carol Jackson", "response": ["Having originally appeared between 1993 and 1997 and again in 1999 and despite Coulson ruling out a return to the programme in 2008, it was announced on 25 October 2009 that Carol would return to the show in 2010 along with her children Robbie, Sonia and Billie. Coulson is quoted as saying, \"I'm thrilled to be returning to EastEnders after all these years. I'm also excited and intrigued to find out what Carol and her family have been up to since we last saw her and where she will be going next.\" A source told entertainment website Digital Spy: \"Everything's being kept hush-hush about the Jacksons' return at the moment, but there are certainly a load of questions to be answered. Will the frosty relationship between Carol and Bianca thaw? Are Sonia and Martin still together? And how will Robbie react when he learns of his beloved Wellard's death? Everyone's so pleased to have them back.\" The family will return for Bianca's second wedding to Ricky Butcher (Sid Owen) as part of the show's 25th anniversary. Executive producer Diederick Santer explained that he wanted great stories to get people talking, saying \"The wedding is the perfect opportunity for us to bring back the much-loved Jackson characters – Carol, Sonia, Robbie and Billie.\""]}, {"page": "Diane Butcher", "response": ["The character reappeared in March 2008. Sophie Lawrence was asked to reprise the role by executive producer Diederick Santer as part of a storyline that has been dubbed \"Frank Week\". Mike Reid died in 2007 and due to the popularity of the character he played, Santer decided that Frank would also be killed off in the serial. A funeral was held for the character as a tribute to both the actor and the \"iconic\" character he played. Lawrence was one of several actors brought back to the show especially for the storyline. She was joined by Charlie Brooks, who played her younger sister Janine and Sid Owen as her brother Ricky."]}, {"page": "Simon Wicks", "response": ["Berry was reportedly asked to reprise the role of Simon in 2004 by executive producer Louise Berridge, though a return at this time did not materialise. In 2007, the executive producer of EastEnders, Diederick Santer, stated that Wicksy was the character he would most like to see return to the serial. He commented, \"I'd love to see what he's like today. What is this golden boy, who had the world and the women of Walford at his feet, doing now? Has he delivered on his early promise? I loved Nick Berry playing him – Simon was a likeable but complex character. Maybe I should ask him to come back…\" He confirmed his desire to get the character back to website Walford Web in 2010, but added that it was not to be; he did not state whether or not Berry had been approached."]}, {"page": "Tanya Branning", "response": [" In a July 2008 interview with the Sunday People, Joyner revealed that she was disappointed that Tanya's wild child past had not been explored more in the aftermath of her character burying Max alive, saying \"I didn't think Tanya would be as mumsy at first. She was quite hard in her past and it would have been fun to have that side come out. Tanya has a really naughty side. When she was young she was a lot like Stacey Slater. That hasn't really come out yet but she definitely has it in her.\" Joyner temporarily left the show in December 2009 for maternity leave. Her departure was facilitated through a storyline in which Max hid financial problems from the family and Tanya left him. The show's executive producer Diederick Santer revealed that some planned storyline material for Max and Tanya was put on hold until Joyner's return from maternity leave. On 6 May 2010, Joyner filmed a single episode that was broadcast on 23 June, and she made her full-time return on 27 September 2010."]}, {"page": "Clare Bates", "response": ["In September 2007, an official BBC press report announced that actress Gemma Bissix had agreed to reprise the role of Clare, ten years after her initial departure. Bissix was approached about returning by the executive producer of EastEnders, Diederick Santer, following her successful stint as soap villain Clare Devine in Channel 4's Hollyoaks."]}, {"page": "Rob Minter", "response": ["Executive producer Diederick Santer commented on Laing and Drew's skills for the kidnap storyline. The producer told the news website Digital Spy: \"Dr. May and Rob - Amanda Drew and Stuart Laing - have led Dawn and the audience a merry dance this year. They have both given fantastic, gripping performances and we have loved having them. We wish them both all the best for the future.\""]}, {"page": "Owen Turner", "response": ["In December 2009, Harwood's successor Diederick Santer was asked if anything in the year had not gone as he expected it to. He replied: \"Something else I didn't expect has been the way that the audience took Owen to their hearts to the extent that they did. It was really satisfying though, to 'redeem' a character in the audience's eyes in the way we did.\""]}, {"page": "Gemma Bissix", "response": ["On 19 September 2007,  it was announced that Bissix would be reprising her role as Clare Bates in EastEnders, ten years after she had last appeared in the soap.BBC – EastEnders – News – Gemma Bissix Returns She was reintroduced by the executive producer of EastEnders, Diederick Santer, and returned on-screen on 1 February 2008. Of her decision to return to EastEnders, Bissix has said \"I'm ecstatic. It really is fantastic. Clare's a deeper character [than Clare was in Hollyoaks] – I've got more scope with her and it's more of a challenge. I'm back home...\".\"Gemma Bissix: \"I'm back home\"\", Digital Spy. URL last accessed 3 February 2008. It was announced on 23 May 2008 that Bissix was leaving the soap once again in Summer 2008.BBC – EastEnders – News – Gemma Bissix set to leave"]}, {"page": "Billie Jackson", "response": ["It was announced in October 2009 that the character, now called Billie, would be rejoining the soap along with the rest of the Jackson clan, excluding Alan and Blossom, for a storyline to mark the 25th anniversary of EastEnders in February 2010. At the time the casting for the character had not been finalised; however, it was confirmed in November 2009 that the original actor, Devon Anderson, would be reprising the role 13 years after he had last been seen in the soap. Anderson commented, \"I'm really happy to be back at EastEnders playing the role of Billie Jackson again. It was my first acting role and I can't wait to get started again. It is also very exciting that all of the Jackson family will be reunited and I'm sure that will be eventful for the viewers.\" Executive producer Diederick Santer added, \"Viewers will remember Devon as the original Billie Jackson, the cute kid with the big hair. Devon, like Billie, is all grown up, and 12 years on, I'm delighted to welcome this talented young actor back to the show.\" He later described the character as \"interesting\", saying \"He's a troubled soul, torn between being a good son to his mother and trying to have an exciting London life. And when your mother's Carol Jackson, that's quite a feat.\" A source told the media website Digital Spy, \"Billie's become a young man since the last time we saw him - he might even [be] referred to by his proper name Will. He's still the apple of his mother's eye but is he the angelic family man she wants him to be?\""]}]}}