{"wiki_id": "http://www.wikidata.org/entity/Q5270039", "itemLabel": "Di Jones", "itemDescription": "Welsh footballer (1867-1902)", "wikipedia_url": "https://en.wikipedia.org/wiki/Di_Jones", "wikipedia_page": {"main": "David Jones, known as Di Jones (1867 – 27 August 1902) was a Welsh footballer who played as a full-back for Oswestry, Chirk, Bolton Wanderers and Manchester City in the late 19th century. He also won 14 caps for the Welsh national team.", "link_mentions": [{"page": "Oswestry", "response": ["* Di Jones (1867 in Trefonen – 1902) Welsh international footballer, 340 club caps for Bolton Wanderers F.C. and Manchester City F.C."]}, {"page": "David Jones", "response": ["* Di Jones (1866–1902), Welsh footballer"]}, {"page": "Chirk", "response": ["* Di Jones, Welsh international footballer (resident)"]}, {"page": "Billy Meredith", "response": ["Meredith's performances for Northwich gained the attention of several other clubs in the Football League. Bolton Wanderers full-back Di Jones, a former Chirk player, spoke with him about a possible move, but Bolton secretary J.J. Bentley felt Meredith was too inexperienced and his frame too slight. Lawrence Furniss, an official at Ardwick, had first noticed him while refereeing a Northwich match. Meredith also played in both meetings between the clubs that season. Later in 1894, Ardwick, by then known as Manchester City, vigorously pursued Meredith's signature. Two club officials travelled to Wales to meet the player. One was secretary-manager Joshua Parlby, the other either Furniss or chairman John Chapman. The pair were met with suspicion. Anecdotes by contemporary figures suggest they were initially chased away by locals, and were only allowed to speak to Meredith after they bought drinks for his mining colleagues. Meredith did not wish to abandon life in Chirk. His mother was particularly against the idea: \"It is all very well for you gentlemen to leave your big cities and come to our villages to steal our boys away ... Our boys are happy and healthy, satisfied with their work and innocent amusements ... if Billy takes my advice he will stick to his work and play football for his own amusement when work is finished.\" Meredith did eventually sign for Manchester City, but as an amateur. He continued to work at the pit for at least a year, commuting back and forth for matches."]}, {"page": "List of Manchester City F.C. players", "response": ["|align=\"left\"|Di Jones||  || Full back || 1898–1902||118||1|| ||"]}, {"page": "Lot Jones", "response": ["Jones was born in Chirk, Denbighshire and was the son of Elizabeth Jones (1864–)Baptism Register, Trefonen Parish Church, page 18 and grandson of Lot Jones (1831–), a coal minerBritish Census 1881 RG11; Piece: 2661; Folio: 85; Page: 18; GSU roll: 1341639. and labourer.British Census 1891 RG12; Piece: 2118; Folio: 176; Page: 27; GSU roll: 6097228. He was treated as a son of his grandfather, Lot. His biological uncle was the footballer, Di Jones. As a youth he worked as a pit minerBritish Census 1901 Class: RG13; Piece: 2546; Folio: 178; Page: 19. and was one of several footballers to emerge from the area around the start of the 20th century, along with Billy Meredith and George Wynn. He signed for Manchester City in January 1903 from Rushton Druids, but did not establish himself immediately. He made only a single appearance in his first full season, scoring a goal in a 2–1 defeat to West Bromwich Albion in April 1904, and by the time he received his next opportunity he had been at the club for two years. From January 1905 until the end of the 1905–06 season Jones played in around half of his club's matches."]}, {"page": "List of association footballers who died while playing", "response": ["|  Di Jones"]}, {"page": "Trefonen", "response": ["* Di Jones, former Welsh footballer"]}, {"page": "1894 FA Cup Final", "response": ["|FB || 3 ||Di Jones"]}, {"page": "List of Manchester City F.C. records and statistics", "response": ["*Di Jones (2)"]}, {"page": "1898–99 Manchester City F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Di Jones", "| Di Jones", "| Di Jones"]}, {"page": "Robert Lee Roberts", "response": ["Roberts was born in Beaumaris on the island of Anglesey, but had joined Chester by 1888, where he became team captain. His only international appearance came on 8 February 1890 against Ireland at the Old Racecourse, Shrewsbury, when he was called up in the absence of Di Jones. The match ended in a 5–2 victory for the Welsh."]}, {"page": "1899–1900 Manchester City F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Di Jones"]}, {"page": "1900–01 Manchester City F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Di Jones"]}, {"page": "1901–02 Manchester City F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Di Jones"]}, {"page": "List of Wales international footballers born outside Wales", "response": ["* Di Jones"]}, {"page": "1898–99 Small Heath F.C. season", "response": ["The visit to league leaders Manchester City produced a two-goal defeat. Playing into the sun and wind, Small Heath were mostly on the defensive, and Clutterbuck played well to keep City at bay. On change of ends, the visitors improved, but City full backs Di Jones and Dick Ray were on top form. In the last twenty minutes, City were on top, and Fred Williams scored twice, the second coming from a penalty after Billy Meredith was fouled.\"Manchester City v. Small Heath\". Manchester Guardian: p.7. 10 April 1899. Off the field, the West Midlands clubs submitted a complaint to the football authorities about attempts by the southern clubs to poach their players, which led to the suspension of \"an agent of a well-known Southern club\" and the temporary closure of Thames Ironworks' ground.\"An Impending Sensation\". The North-Eastern Daily Gazette: p.3. 15 April 1899.\"The Football Association\". The Yorkshire Herald: p.7. 8 May 1899."]}, {"page": "1888–89 Bolton Wanderers F.C. season", "response": ["|align=\"left\"|FB||align=\"left\"| Di Jones"]}, {"page": "Walter Whitehead", "response": ["Among Whitehead's patients were Joseph Nuttall, a renowned professional swimmer of the time, and the footballers Di Jones and Charlie Burgess."]}]}}