{"wiki_id": "http://www.wikidata.org/entity/Q5276894", "itemLabel": "Geoffrey Kerr", "itemDescription": "British actor and playwright (1895-1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Geoffrey_Kerr", "wikipedia_page": {"main": "Geoffrey Kerr (26 January 1895 – 1 July 1971) was a British stage and film actor and writer, during the middle of the 20th century, part of a British family with a strong stage and theatre tradition spanning several generations.", "link_mentions": [{"page": "Under the influence", "response": ["* Under the Influence, a 1954 fantasy novel written by actor Geoffrey Kerr"]}, {"page": "June Walker", "response": ["In 1926, she married British actor Geoffrey Kerr. The couple divorced in 1943; their son was actor John Kerr. She appeared with her son in a 1954 episode of NBC's Justice. It was his first acting engagement. "]}, {"page": "The Ghost Goes West", "response": ["The film is an adaptation of Eric Keown's short story \"Sir Tristam Goes West\", and was written by Robert E. Sherwood and Geoffrey Kerr, though Clair and Lajos Biro have been alleged by contemporary sources to have done uncredited writing on the screenplay."]}, {"page": "John Kerr (actor)", "response": ["Kerr was born November 15, 1931, in New York City to British-born Geoffrey Kerr and American-born June Walker.  Both were stage and film actors, and his grandfather was Frederick Kerr, a British trans-Atlantic character actor  in the period 1880–1930; Kerr developed an early interest in following in their footsteps."]}, {"page": "My Husband and I (1956 TV series)", "response": ["My Husband and I was a short-lived black-and-white British sitcom starring Evelyn Laye and her husband Frank Lawton, who played themselves. It ran for seven episodes in 1956. My Husband and I was written by Geoffrey Kerr and James Leasor. It was made for the ITV network by Associated-Rediffusion."]}, {"page": "The Runaround (1931 film)", "response": ["The Runaround is a 1931 comedy-drama film that was photographed entirely in Technicolor. It was directed by William James Craft, from a screenplay by Alfred Jackson and Barney Sarecky, based on a story by Zandah Owen.  The film stars Mary Brian, Joseph Cawthorn, Marie Prevost, Johnny Hines, and Geoffrey Kerr.  Produced and directed by RKO Radio Pictures, it premiered in New York City on August 7, 1931, and was released national on August 22.  It was the first film to be shot in a new Technicolor process which removed grain, resulting in a much improved color. The film was released in Great Britain as Waiting for the Bride.", "* Geoffrey Kerr as Fred White"]}, {"page": "List of comedy films of the 1930s", "response": ["|The Runaround|| William James Craft||Geoffrey Kerr, Mary Brian, Johnny Hines|| United States ||"]}, {"page": "The Great Day", "response": ["* Geoffrey Kerr as Dave Leeson"]}, {"page": "Love's Boomerang", "response": ["* Geoffrey Kerr as Saville Mender"]}, {"page": "The Man from Home (1922 film)", "response": ["* Geoffrey Kerr as Horace Granger-Simpson"]}, {"page": "London Calling (play)", "response": ["London Calling is a comedy play in three acts, written by Geoffrey Kerr, produced by John Golden, and directed by Dan Jarratt. The play was first performed at Little Theatre, Rochester, New York, on October 18, 1930.Bordman, Gerald Martin. American Theatre: a Chronicle of Comedy and Drama 1930-1969. (Page 9) Oxford, 1996  The star of the original production was British-born thespian St. Clair Bayfield. Geoffrey Kerr had previously performed in The Stork (1925) and also wrote short stories on the side for Vanity Fair magazine.New York Times Review 18th October 1930 ", "*Geoffrey Kerr  -  George Craft"]}, {"page": "Frederick Kerr", "response": ["Kerr's wife was Lucy Dowson — they had one son, Geoffrey Kerr, who followed in his father's theatrical footsteps. His grandson was actor John Kerr."]}, {"page": "Bertha Belmore", "response": ["In the United Kingdom, Belmore's notable stage appearances included Mrs Trellis in Guy Bolton's Give Me A Ring (1935, Hippodrome, London); Frau Lucher in Robert E. Sherwood's Reunion in Vienna (1934, Lyric Theatre, London); Emily Peabody in Yes, Madam? (1934, Manchester Opera House); Miss Pink in R. P. Weston's Please Teacher! (1935, Hippodrome, London); Emmeline Ray in K. R. G. Browne, Bert Lee and Desmond Carter's Big Business (1937, Hippodrome, London); Mrs. Simmons in Geoffrey Kerr's Oh! You Letty (1937 – 1938, Palace Theatre, London); Guy Bolton's Bobby Get Your Gun (1938 – 1939, Adelphi Theatre); Margot Neville and Gerald Kirby's Giving the Bride Away (1939, Manchester Opera House); Nurse McClintock in Guy Bolton's  Nap Hand (1940, Aldwych Theatre); Nurse Ironside in R. F. Delderfield's Peace Comes To Peckham (1947, Princes Theatre, London); and Emily Bompard in Austin Melford's Blue For A Boy (1950, Her Majesty's Theatre). She was active as a character actress in British cinema from 1933 to 1940; appearing mainly in comedies. From 1948-1953 she made several appearances on American television, including The Philco Television Playhouse (1948-1950), The Chevrolet Tele-Theatre (1949), The Trap (1950), The Web (1951), Martin Kane (1951), The Ford Theatre Hour (1951), Studio One in Hollywood (1951), and The Goldbergs (1953)."]}, {"page": "Once a Lady", "response": ["*Geoffrey Kerr as Jimmy Fenwick"]}, {"page": "The Mirage (1920 film)", "response": ["* Geoffrey Kerr ...  Richard Dalziell "]}, {"page": "Torn Sails", "response": ["Torn Sails is a 1920 British silent drama film directed by A. V. Bramble and starring Milton Rosmer, Mary Odette and Geoffrey Kerr.BFI.org It was based on the 1897 novel Torn Sails by Allen Raine. Like much of her work, it is set in a small Welsh village.", "* Geoffrey Kerr as Ivor Parry "]}, {"page": "Just Suppose", "response": ["*Geoffrey Kerr as Count Anton Teschy"]}, {"page": "12.10", "response": ["12.10 is a 1919 British silent thriller film directed by Herbert Brenon and starring Marie Doro, Ben Webster, and Geoffrey Kerr. It was the first film made by British & Colonial Kinematograph Company which had ambitious plans to break into the American market. It was made at Walthamstow Studios, and had considerable success on its release.Low p.137", "* Geoffrey Kerr as Geoffrey Brooke"]}, {"page": "Women Love Once", "response": ["Women Love Once is a 1931 American pre-Code drama film directed by Edward Goodman and written by Zoë Akins. The film stars Paul Lukas, Eleanor Boardman, Juliette Compton, Geoffrey Kerr, Judith Wood and Marilyn Knowlden. The film was released on July 4, 1931, by Paramount Pictures.", "*Geoffrey Kerr as Allen Greenough"]}, {"page": "Yellow Jack (play)", "response": ["* Geoffrey Kerr as Stackpoole"]}, {"page": "October 1930", "response": ["*The Geoffrey Kerr comedy play London Calling opened at the Little Theatre in Rochester, New York."]}, {"page": "Esme Beringer", "response": ["Esme Beringer's film appearances included All the World's a Stage (1917), The October Man (1947), Something in the City (1950), and Castle in the Air (1952). She also made some early television appearances, in Craven House (1950), and The Monster of Killoon (1952, by Geoffrey Kerr)."]}]}}