{"wiki_id": "http://www.wikidata.org/entity/Q5273400", "itemLabel": "Dick Southwood", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Dick_Southwood", "wikipedia_page": {"main": "Leslie Frank \"Dick\" Southwood (18 January 1906 – 7 February 1986) was an English rower who competed in the 1932 Summer Olympics and in the 1936 Summer Olympics representing Great Britain.\nSouthwood was born in Fulham and was educated at Latymer Upper School. He initially joined Auriol Rowing Club but Jack Beresford spotted his sculling potential and persuaded him to join Thames Rowing Club. He competed unsuccessfully in the Wingfield Sculls in 1931. In 1932 he competed in the single sculls rowing for Great Britain at the 1932 Summer Olympics but in the final suffered an attack of cramp in the shoulder and finished fourth. He won the Wingfield Sculls in 1933, beating the holder Denis Guye.\nIn 1936 Southwood partnered Jack Beresford in the double sculls for Great Britain rowing at the 1936 Summer Olympics in Berlin. With Adolf Hitler watching, Beresford and Southwood came from a length down to pass the Germans with 200 metres to go and won the gold medal. Beresford thus won his fifth Olympic medal and wrote later that it was \"the sweetest race I ever rowed.\"\nBeresford and Southwood paired up again in 1939 in the centenary double sculls at Henley Royal Regatta. They dead-heated with Scherli and Broschi of Trieste, who were the reigning European champions.Southwood died in Little Wittenham, Oxfordshire at the age of 80.", "link_mentions": [{"page": "Thames Rowing Club", "response": ["| Dick Southwood", "| Dick Southwood"]}, {"page": "Jack Beresford", "response": ["In the 1936 Summer Olympics in Berlin, Beresford was the flag bearer for the British delegation in the Opening Ceremonies, which were filmed by Leni Riefenstahl. The scene was included in her documentary Olympia, which is sometimes described as a Nazi propaganda film. Rowing at the 1936 Summer Olympics in Berlin, with Adolf Hitler watching, Beresford and Dick Southwood his partner in the Double sculls, came from a length down to pass the favoured Germans with just 200 metres to go, thus giving Beresford his fifth Olympic medal and third gold.  Beresford would later write it was \"the sweetest race I ever rowed.\"  Beresford was presented with an oak sapling by Hitler, as were all gold medal winners.Hitler's Olympic oak gift to Briton axed. The Guardian (19 August 2007). Retrieved on 6 July 2018.  Beresford's was planted in the grounds of Bedford School.", "In the inaugural Centenary Double Sculls – now the Double Sculls Challenge Cup – at Henley in 1939, Beresford, together with Dick Southwood, raced a memorable final against the European Champions, Scherli and Broschi of Trieste which resulted in a dead-heat."]}, {"page": "Great Britain at the 1936 Summer Olympics", "response": ["*Jack Beresford, Dick Southwood — Double Scull Rowing", "* Dick Southwood"]}, {"page": "Great Britain at the 1932 Summer Olympics", "response": ["* Single scull - Dick Southwood - Fourth"]}, {"page": "Wingfield Sculls", "response": ["|1933||\tDick Southwood||Thames Rowing Club||\t21.11\t||\tLRC to Mortlake (Putney Bridge being repaired)"]}, {"page": "Double Sculls Challenge Cup", "response": ["On the centenary of the regatta in 1939 a Centenary Double Sculls event was introduced. The crews in the final were Jack Beresford and Dick Southwood of Thames Rowing Club against Giorgio Scherli and Ettore Broschi of Trieste, who were the reigning European champions. The result was a dead-heat.Henley Royal Regatta Results of Final Races 1839–1939 Henley Royal Regatta Results of Final Races 1946–2003 (currently to 2009) Henley Royal Regatta - Results"]}]}}