{"wiki_id": "http://www.wikidata.org/entity/Q5273025", "itemLabel": "Dick Horsfall", "itemDescription": "English cricketer (1920-1981)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dick_Horsfall", "wikipedia_page": {"main": "Richard Horsfall (26 June 1920 – 25 August 1981) was an English cricketer, who played first-class cricket for Essex between 1947 and 1955, and then played for a single season for Glamorgan in 1956. He was a right-handed middle-order batsman.\nHorsfall was born at Todmorden, Yorkshire. Having played Lancashire League cricket for Todmorden since 1936, Horsfall was recruited by Essex for the 1947 season and played in around half the team's first-class matches in his first season. In the game against Hampshire at Bournemouth, he scored 170, putting on 225 for the third wicket with Frank Vigar, who made 125. The following season, though he did not improve on his highest score, he played in every Essex County Championship match and made 1407 runs at an average of 31.97. He was awarded his county cap, and was also picked for a team representing the South of England which played the new county champions, Glamorgan, in an end of season game.In 1949, Horsfall's cricket was affected for the first time by the back injury that would plague the rest of his career. He appeared in only six first-class matches, and though he returned to just over half of Essex's matches in 1950, his batting was less successful. His only century in these two seasons came in a match against the Combined Services. In 1951, however, he was fully fit and, playing in every Essex match, he made 1655 runs at an average of 35.21. His best score was 206, made in 270 minutes against Kent at Blackheath, and he shared a third wicket partnership of 343 with Paul Gibb which was the Essex county record until beaten by Mark Waugh and Nasser Hussain, who made an unbroken 347 against Lancashire in 1992. The 206 remained Horsfall's highest first-class score and was his only double-century.\nThe 1952 and 1953 seasons were equally successful. In 1952, Horsfall made 1560 runs at an average of 33.91 and the 1953 return was his best: 1731 runs at an average of 37.63 and including five centuries. In its reports on the two seasons, Wisden Cricketers' Almanack described Horsfall as \"strong-driving\"; he was a fast scorer throughout his career. The back injury returned, though, in 1954 and although he played regularly, he was not suited to slow pitches in a damp summer and his aggregate fell to 912 runs and an average of 21.20. Worse followed in 1955, with only 721 runs in 25 matches at an average of only 17.16, and at the end of the season he was not retained by Essex.\nHorsfall was signed by Glamorgan for the 1956 season and made a promising start with an unbeaten 77 in a pre-season two-day friendly match against Gloucestershire. But when the first-class cricket started he was out of form and managed only 76 runs in nine innings. After five matches, he was dropped from the side and his contract was cancelled. He returned to Lancashire League cricket with Todmorden in the 1957 season.\nHorsfall died at Halifax, Yorkshire, aged 61.", "link_mentions": [{"page": "Horsfall", "response": ["*Dick Horsfall (1920–1981), English cricketer, played for Essex and Glamorgan"]}, {"page": "1947 English cricket season", "response": ["Essex matches were noted for high scores as Essex themselves scored more runs than anyone except Middlesex but also conceded the most. Their two outstanding players were the cousins Peter and Ray Smith who both completed the double. These two, bowling leg break and off break respectively, effectively carried the Essex attack. Outstanding prospect Trevor Bailey was the sole pace bowler of any effect but he was only available in the latter half of the season and then injuries limited his bowling, though he topped the county's batting averages. The other all-rounder Frank Vigar took 59 championship wickets bowling leg breaks but was expensive. Bailey, Vigar and the Smiths were half of the eight Essex players who scored 1,000 runs in the season, the other four being captain Tom Pearce, Chick Cray, Dickie Dodds and Doug Insole. Wicketkeeper Tom Wade had a very good season with 77 victims, 38 of them stumped. Essex were also represented by Bill Dines, Bill Morris, Denys Wilcox, Dick Horsfall, Frank Rist, Harry Crabtree, Len Clark and Sonny Avery.Playfair, pp. 100–102."]}, {"page": "Todmorden Cricket Club", "response": ["Former Todmorden amateur players include Harold Dawson, Dick Horsfall and Derek Shackleton. at lancashireleague.com Television weatherman John Kettley played for Todmorden Second and Third Eleven, he was once selected for the First Eleven."]}, {"page": "Richard Horsfall", "response": ["#REDIRECT Dick Horsfall"]}, {"page": "List of Glamorgan County Cricket Club players", "response": ["* Dick Horsfall (1956) : R. Horsfall"]}, {"page": "List of Marylebone Cricket Club players (1946–1977)", "response": ["* Dick Horsfall (1950) : R. Horsfall (Essex, Glamorgan)"]}]}}