{"wiki_id": "http://www.wikidata.org/entity/Q52716006", "itemLabel": "Tudor Evans", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Tudor_Evans", "wikipedia_page": {"main": "Tudor Evans  is a British Labour Co-operative politician who has been the leader of Plymouth City Council since May 2018 and councillor for Ham ward since 1988. He has led the Labour group on Plymouth City Council since 1998, including serving as leader of the council from 1998 to 2000, from 2003 to 2007 and from 2012 to 2016.", "link_mentions": [{"page": "Tudor (name)", "response": ["*Tudor Evans, British politician"]}, {"page": "List of people with surname Evans", "response": ["*Tudor Evans, British politician"]}, {"page": "Pacific 1860", "response": ["*Mr Stirling - Tudor Evans"]}, {"page": "Plymouth City Council", "response": ["The council is run using the leader and cabinet model, where the Leader of the Council – normally Leader of the Majority Party – is selected by fellow councillors, who also select the Executive, commonly referred to as the Cabinet. The current Leader of the Council is Nick Kelly of the Conservative Party and the Opposition Group Leader is Tudor Evans of the Labour Party.", "|  Tudor Evans (Lab)*** || style=\"background-color:\" | "]}, {"page": "2012 Plymouth City Council election", "response": ["Following the election, the Labour Party had an overall majority on the council, meaning their group leader Tudor Evans returned as council leader. Labour's newly elected councillor in Devonport, Kate Taylor, was one of the youngest councillors in the country at eighteen years old. The UK Independence Party lost its only seat on the council."]}, {"page": "2014 Plymouth City Council election", "response": ["Turnout in this election fell to 37%, compared to 62% when the defending councillors were last elected. Following this election, the Labour group had a majority of councillors. This meant that Labour group leader Tudor Evans remained the leader of Plymouth City Council. The UK Independence Party won seats on the council for the first time, and came second in several seats in the city with close results in St Budeaux and Plymstock Radford wards."]}, {"page": "2016 New Year Honours", "response": ["* Councillor Tudor Evans, Leader, Plymouth City Council. For political service and services to Local Government."]}, {"page": "2016 Plymouth City Council election", "response": ["After the election, the Conservatives and Labour held twenty-seven seats on the council each, with the other three held by UKIP councillors. Labour group leader Tudor Evans had led the council before the election, but the result cast control of the council into doubt. A coalition between the Conservatives and UKIP took control, with Conservative group leader Ian Bowyer becoming the new leader of the council."]}, {"page": "Alison Hernandez", "response": ["Within days of her election, it was reported that Hernandez was being investigated by police over allegations she failed to properly declare election expenses that were submitted in her role as an election agent for Kevin Foster, Conservative candidate in the Torbay constituency during the 2015 general election. Hernandez was under investigation by the Independent Police Complaints Commission which is managing the probe by West Mercia Police in connection with the United Kingdom general election, 2015 party spending investigation. She faced calls from opposition politicians, including Plymouth City Council leader Tudor Evans, to step aside from the role of Police and Crime Commissioner while the investigation was ongoing. Hernandez addressed these concerns during her swearing in ceremony on 10 May: \"I've had over 91,000 people elect me to office. I'm here for the people of Devon and Cornwall and the Isles of Scilly. I'm here to do a job – the police need support.\""]}, {"page": "2018 Plymouth City Council election", "response": ["Following this election, the Labour group had a majority of councillors. This meant that Labour group leader Tudor Evans became the new leader of Plymouth City Council. Leader of the Labour Party Jeremy Corbyn visited Plymouth to celebrate the result. Outgoing council leader Ian Bowyer remained leader of the Conservative group."]}, {"page": "2021 Plymouth City Council election", "response": ["Kevin Neil, who was elected in 2018, was suspended from the Labour Party when a police investigation was launched into him. He continues to sit as an independent following the closure of the police investigation, pending an internal investigation by the party. Chaz Singh, who was first elected in 2011, left the Labour Party in September 2019 saying that his party membership was incompatible with his Sikh faith. The Labour group leader Tudor Evans said that Singh's resignation followed a conversation about Singh's conduct. Margaret Corvid, who was first elected in 2018, was suspended from the Labour Party in December 2019 over accusations of antisemitism over comments she made in 2007 about \"Zionist collaboration with the Nazis\". She was reinstated in February 2020 after apologising and saying that her views had changed, pointing to her speech in June 2018 in support of the Working Definition of Antisemitism developed by the International Holocaust Remembrance Alliance.", "Keir Starmer, the leader of the Labour Party, visited Plymouth on 7 April to campaign for the party. The Labour leader of the council Tudor Evans said that his party had already delivered most of the promises from the four-year plan published in 2018 with the remaining promises in the process of being fulfilled. The party's manifesto for the 2021 election said it would \"create thousands of jobs and build more low-cost housing for rent or sale, with more help to older people, veterans, single people and residents with disabilities\". Evans highllighted the diversity in backgrounds and careers that Labour candidates came from as a \"brilliant reflection of Plymouth\".", "On the night of the results, Tudor Evans, the leader of the council and the Labour group, said his party \"had their backsides kicked\", and that he would \"find out what the voters were telling us, what they want to see different and make sure we do change\". The Conservative group leader Nick Kelly said he was \"absolutely ecstatic\" with the results. The Green Party saw their best ever result in Plymouth, falling only 101 votes short in Plympton Chaddlewood."]}]}}