{"wiki_id": "http://www.wikidata.org/entity/Q527607", "itemLabel": "Harold Harding", "itemDescription": "British civil engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Harding", "wikipedia_page": {"main": "Sir Harold John Boyer Harding (6 January 1900 – 27 March 1986) was a British civil engineer. Harding was educated at Christ's Hospital and the City and Guilds College (part of Imperial College London), interrupting his studies 1918–19 with a one-year period spent as a cadet in the Officers' Training Corps.  Following graduation Harding worked for Mowlem where he specialised in tunnelling work for London Underground including the reconstruction of Piccadilly Circus tube station and the expansion of the Central line. In the 1930s he and Mowlem were instrumental in introducing geotechnical processes to the UK.Upon the outbreak of the Second World War, Harding was placed in charge of defence and emergency repair of underground services in London. He built pre-cast concrete petrol barges and eight of the Mulberry Harbour segments used in the Normandy Landings. He was also a founding director of Soil Mechanics Ltd, a subsidiary of Mowlem dedicated to work in geotechnics. After the war Harding was involved with investigations into the feasibility of construction of a Channel Tunnel and sat on the tribunal investigating the Aberfan disaster of 1966.\nHarding was elected president of the Institution of Civil Engineers, was the founding chairman of the British Tunnelling Society, fellow of the City and Guilds of London Institute and fellow of Imperial College. He was also a founder fellow of the Fellowship of Engineering and governor of three separate academic institutions: Westminster Technical College. Northampton Engineering College, and Imperial College.  He received a knighthood in 1968.", "link_mentions": [{"page": "Aberfan disaster", "response": ["On 25 October 1966, after resolutions in both Houses of Parliament, the Secretary of State for Wales formally appointed a tribunal to inquire into the disaster. Before the tribunal began, Elwyn Jones, the Attorney General, cautioned the media that commenting on matters to be investigated by the tribunal could lay them open to the same consequences as contempt of court. Sitting alongside Lord Justice Davies on the inquiry were the civil engineer Harold Harding and Vernon Lawrence, the former Clerk to the Monmouthshire County Council. The inquiry had an initial public meeting on 2 November 1966 and took evidence in public for 76 days, spread over the next five months; during that time 136 witnesses testified. The tribunal report stated \"much of the time of the Tribunal could have been saved if ... the National Coal Board had not stubbornly resisted every attempt to lay the blame where it so clearly must rest—at their door\"."]}, {"page": "List of people educated at Christ's Hospital", "response": ["*Harold Harding – Civil engineer"]}, {"page": "Harry Harding", "response": ["*Harold Harding (1900–1986), British civil engineer", "*Harold Hardinge, English cricketer and footballer"]}, {"page": "British Tunnelling Society", "response": ["The British Tunnelling Society (BTS) is a professional association established in London, UK, in 1971 by tunnelling professionals, led by Sir Harold Harding. The BTS is a learned society of the Institution of Civil Engineers, its mission being to provide a forum for meetings and discussion on tunnel-related matters.", "Named in honour of Sir Harold Harding, The Harding Prize is awarded annually.https://www.britishtunnelling.org.uk/?sitecontentid=66632F49-E21D-4C90-BD2D-08B22EFFC559  The entry to the award consists of an original paper relating to any aspect of tunnelling which the entrant considers to be of interest to others in the tunnelling industry and is open to those aged 33 or younger on 1 January of the same year. The papers are then reviewed by a group of BTS committee members and the writers of selected papers are invited to make an oral presentation to the April BTS meeting. The winner is decided by members of the BTS Committee.", "* Sir Harold Harding (1971–1973)"]}, {"page": "Harding (surname)", "response": ["*Harold Harding (1900–1986), British civil engineer"]}, {"page": "Westminster Technical College", "response": ["It was attended by Anthony Hunt, and Katie Stewart. Harold Harding was a School governor at the college. The Who Tour 1965 and The Who Tour 1966 played at the college."]}, {"page": "List of fellows of Imperial College London", "response": ["* Sir Harold Harding"]}]}}