{"wiki_id": "http://www.wikidata.org/entity/Q528639", "itemLabel": "Mark-Anthony Turnage", "itemDescription": "English composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark-Anthony_Turnage", "wikipedia_page": {"main": "Mark-Anthony Turnage CBE (born 10 June 1960) is an English composer of classical music.", "link_mentions": [{"page": "Charles Baudelaire", "response": ["* English composer Mark-Anthony Turnage composed settings of two of Baudelaire's poems, \"Harmonie du soir\" and \"L'Invitation au voyage\", for soprano and seven instruments."]}, {"page": "Ceres", "response": ["*Ceres (2005), an orchestral work by Mark-Anthony Turnage"]}, {"page": "Opera", "response": ["Another feature of late 20th-century opera is the emergence of contemporary historical operas, in contrast to the tradition of basing operas on more distant history, the re-telling of contemporary fictional stories or plays, or on myth or legend. The Death of Klinghoffer, Nixon in China, and Doctor Atomic by John Adams, Dead Man Walking by Jake Heggie, and Anna Nicole by Mark-Anthony Turnage exemplify the dramatisation onstage of events in recent living memory, where characters portrayed in the opera were alive at the time of the premiere performance."]}, {"page": "John Paul Jones (musician)", "response": ["In February and March 2011 he appeared in the onstage band in Mark-Anthony Turnage's opera Anna Nicole, about the Playboy model Anna Nicole Smith, at the Royal Opera House, Covent Garden, in London."]}, {"page": "Eadweard Muybridge", "response": ["* Wayne McGregor – in 2011 UK choreographer collaborated with composer Mark-Anthony Turnage and artist Mark Wallinger on a piece entitled Undance, inspired by Muybridge's \"action verbs\""]}, {"page": "Anna Nicole Smith", "response": ["Anna Nicole, an opera by Mark-Anthony Turnage about Smith, premiered on February 17, 2011, at the Royal Opera House, to mixed reviews.\"Anna Nicole, the opera by Anne Midgette, The Washington Post (February 17, 2011)"]}, {"page": "Coraline", "response": ["An opera by Mark-Anthony Turnage, based on the novella, made its world premiere at the Barbican Centre in London on 27 March 2018."]}, {"page": "Ralph Vaughan Williams", "response": ["Composers of the generation after Vaughan Williams reacted against his style, which became unfashionable in influential musical circles in the 1960s; diatonic and melodic music such as his was neglected in favour of atonal and other modernist compositions.Kennedy (1989), p. 200; and Frogley and Thomson, p. 1 In the 21st century this neglect has been reversed. In the fiftieth anniversary year of his death two contrasting documentary films were released: Tony Palmer's O Thou Transcendent: The Life of Vaughan Williams and John Bridcut's The Passions of Vaughan Williams.Frogley and Thomson, p. 2 British audiences were prompted to reappraise the composer. The popularity of his most accessible works, particularly the Tallis Fantasia and The Lark Ascending increased, but a wide public also became aware of what a reviewer of Bridcut's film called \"a genius driven by emotion\".Morrison, Richard. \"Always up for a lark ascending\" , The Times, 22 August 2008; Walker, Lynne. \"Just Williams—Almost 50 years after his death, the composer Ralph Vaughan Williams is finally being celebrated on film. About time too.\" , The Independent, 28 November 2007; and \"Portrait of a genius driven by emotion\" , Western Morning News, 28 November 2007 Among the 21st-century musicians who have acknowledged Vaughan Williams's influence on their development are John Adams, PJ Harvey, Sir Peter Maxwell Davies, Anthony Payne, Wayne Shorter, Neil Tennant and Mark-Anthony Turnage.Frogley and Thomson, pp. 2–3"]}, {"page": "Piano quintet", "response": ["*Mark-Anthony Turnage"]}, {"page": "Aldeburgh Festival", "response": ["From the beginning, the Festivals were characterised by an eclectic range of music, from the classics – Bach, Haydn, Mozart – to contemporary work, with young composers in particular being commissioned. By 1982, Britten–Pears archivist Rosamund Strode calculated that the Festival had to that date presented new works by over 75 composers, with world premieres of 15 operas.Article in 1982 Aldeburgh Festival Programme Book Concert goers were over the ensuing years to see new works not only by Britten himself, but by composers such as Lennox Berkeley, Richard Rodney Bennett, Elliott Carter, Hans Werner Henze, Alfred Schnittke, Toru Takemitsu, Michael Tippett, Mark-Anthony Turnage and Malcolm Williamson, many of whom came to the Festival as composer-in-residence.  Later, young composers continued to be encouraged with the foundation of the biennial Benjamin Britten Composers' Competition.  Many new works were presented under the baton of Oliver Knussen, himself a notable contributor to the new works presented at the Festival."]}, {"page": "Mexia, Texas", "response": ["The city of Mexia, the confusion over its correct pronunciation and the city motto are all the subject of an Act 1 Aria in Mark-Anthony Turnage's Opera Anna Nicole staged by the Royal Opera House, Covent Garden, London.  Various imagined residents such as the Town Mayor and head of the Chamber of Commerce also feature alongside of the Operas namesake."]}, {"page": "Mercury Prize", "response": ["* Mark-Anthony Turnage – Your Rockaby"]}, {"page": "Simon Rattle", "response": ["Since his appointment, Rattle has reorganised the Berlin Philharmonic into a foundation, meaning its activities are more under the control of the members rather than politicians. He has also ensured that orchestra members' wages have increased quite dramatically, after falling over the previous few years. He gave his first concert as principal conductor of the BPO on 7 September 2002, leading performances of Thomas Adès' Asyla and Mahler's Symphony No. 5, performances which received rave reviews from the press worldwide and were recorded for CD and DVD release by EMI. Early collaborative projects in the Berlin community with Rattle and the BPO involved a choreographed performance of Stravinsky's The Rite of Spring danced by school children, documented in Rhythm Is It!, and a film project with Mark-Anthony Turnage's Blood on the Floor. He has also continued to champion contemporary music in Berlin. The orchestra has established its first education department during Rattle's tenure."]}, {"page": "City of Birmingham Symphony Orchestra", "response": ["Rattle was named music director of the CBSO in 1990.  That same year, the post of Radcliffe Composer in Association was created, with Mark-Anthony Turnage filling the role. In 1995 Judith Weir became Fairbairn Composer in Association, followed in 2001 by Julian Anderson."]}, {"page": "BBC Symphony Orchestra", "response": ["In 2000, the orchestra appointed its first associate composer, Mark-Anthony Turnage. John Adams became the BBC Symphony Orchestra's artist in association in June 2003. The composer and conductor Oliver Knussen took up the post of artist-in-association in July 2009.\"Oliver Knussen becomes BBC Symphony Orchestra’s new Artist in Association\", BBC Symphonnewy Orchestra. Retrieved 1 August 2012 The orchestra's commitment to new music continues. In 2013, the music journalist Tom Service wrote, \"I've heard the BBC Symphony give concerts that I don't think any other orchestra in the world could do as brilliantly … That supreme virtuosity in new music makes them unique among London's big orchestras.\"Service, Tom. \"Conductor Sakari Oramo: the Finn's First Night at the Proms\", The Guardian, 10 July 2013"]}, {"page": "Chicago Symphony Orchestra", "response": ["* Mark-Anthony Turnage (2006–2010)"]}, {"page": "The Proms", "response": ["* Mark-Anthony Turnage (50th birthday)"]}, {"page": "2000 in music", "response": ["*February 16 – The Silver Tassie, an opera by Mark-Anthony Turnage, receives its première at the London Coliseum, performed by the English National Opera."]}, {"page": "1960 in music", "response": ["*June 10 – Mark-Anthony Turnage, composer"]}, {"page": "2003 in music", "response": ["**A two-day festival of the music of Mark-Anthony Turnage is given at the Barbican Centre, London, with three world premieres and chamber concerts by the Nash Ensemble and the Birmingham Contemporary Music Group.Ivan Hewett, \"Momentum: The Music of Mark-Anthony Turnage: Barbican, London EC2, Jan 18–19\", The Times (January 18, 2003): 10; Richard Morrison, \"Blood on the Floor\", The Times (January 20, 2003): 17."]}, {"page": "Royal College of Music", "response": ["In addition to the college's permanent staff, faculty members at 2012 included well-known musicians such as Dmitri Alexeev, Barry Douglas, Håkan Hardenberger, John Lill, Colin Matthews, Sir Roger Norrington, Mark-Anthony Turnage, Roger Vignoles and principals of the major London orchestras including the London Symphony, BBC Symphony, London Philharmonic, Philharmonia and the Royal Philharmonic Orchestras.\"Faculties\", Royal College of Music prospectus 2012, accessed 6 January 2012"]}, {"page": "Gavin Bryars", "response": ["In 2020, Bryars composed Altissima Luce for Sound World’s Coronavirus Fund for Freelance Musicians, a project supporting struggling musicians during the UK’s Covid 19 lockdown. It was included on the album Reflections alongside specially written pieces by other composers such as Nico Muhly, Mark-Anthony Turnage, Evelyn Glennie and Sally Beamish."]}, {"page": "Mark Anthony Turnage", "response": ["#REDIRECT Mark-Anthony Turnage"]}, {"page": "Deutsche Grammophon", "response": ["Contemporary composers whose works were released by Deutsche Grammophon include Hildur Guðnadóttir,  Sofia Gubaidulina, Oliver Knussen, Mark-Anthony Turnage, Mohammed Fairouz, Péter Eötvös, Luigi Nono, Sven Helbig, Jonny Greenwood, Bryce Dessner, Witold Lutosławski, Philip Glass, Tori Amos and Max Richter."]}, {"page": "John Scofield", "response": ["Also during this period he began to work with British composer Mark-Anthony Turnage. He appeared as a soloist on Turnage's Blood on the Floor: Elegy for Andy. They collaborated on Scorched, an album  of Turnage's orchestrations of Scofield's compositions, largely from the Blue Matter period. John Patitucci and Peter Erskine performed at the live premiere of Scorched at the Alte Oper in Frankfurt in September 2002  with the Radio-Symphony-Orchestra Frankfurt and the hr-Bigband. The performance was recorded and released by Deutsche Grammophon.Cf. credits on album.", "| 2004 || Scorched || with Mark-Anthony Turnage || Deutsche Grammophon || ", "|1998||Mark-Anthony Turnage||Blood on the Floor||Decca||"]}, {"page": "Nine Lessons and Carols", "response": ["|Words: a version of a medieval English carolMusic: Mark-Anthony Turnage"]}, {"page": "Evelyn Glennie", "response": ["*Mark-Anthony Turnage: Fractured Lines (Chandos, 2002)"]}, {"page": "Esa-Pekka Salonen", "response": [";Mark-Anthony Turnage"]}, {"page": "Ballet (music)", "response": ["* Mark-Anthony Turnage"]}, {"page": "List of operas by title", "response": ["* Anna Nicole, Mark-Anthony Turnage, 2011"]}, {"page": "List of 21st-century classical composers", "response": ["|Mark-Anthony Turnage || 1960 ||  || British ||  ||"]}, {"page": "Thomas Adès", "response": ["In 2000, he was composer-in-residence of the Ojai Festival in California (along with Mark-Anthony Turnage), under the artistic direction of Ernest Fleischmann. While there, performances included:"]}, {"page": "New York City Opera", "response": ["On October 1, 2013, the company filed for Chapter 11 bankruptcy in the United States Bankruptcy Court for the Southern District of New York, citing an inability to raise sufficient funding to continue the 2013/14 season. The company's last production was the U.S. premiere of Mark-Anthony Turnage's Anna Nicole. The case was before Judge Sean Lane."]}, {"page": "Anna Nicole", "response": ["Anna Nicole is an English opera in 2 acts and 16 scenes, with music by Mark-Anthony Turnage to an English libretto by Richard Thomas. Based on the life of American model Anna Nicole Smith, the opera received its première on 17 February 2011 at the Royal Opera House, Covent Garden, London, directed by Richard Jones. A recording of the opera was broadcast on BBC Four and BBC iPlayer on 25 March 2011. The broadcast drew in 67,700 viewers. The opera received its first London revival at Covent Garden in September 2014.", "Category:Operas by Mark-Anthony Turnage"]}, {"page": "Stephen Cleobury", "response": ["In 1982 Cleobury succeeded Philip Ledger as Director of Music for the Choir of King's College, Cambridge, where he also taught music. He led the annual Festival of Nine Lessons and Carols at the King's College Chapel on Christmas Eve, which was established in 1918 and broadcast live by the BBC from 1928. Cleobury's most notable contribution was, from 1984, the incorporation of specially commissioned modern works to complement the traditional carols. Among the composers contributing were Thomas Adès, John Tavener and Mark-Anthony Turnage. Harrison Birtwistle's The Gleam, which requires the choristers to stamp their feet and shout, caused some controversy. The high-profile performance of these commissions allowed the widespread dissemination of sophisticated contemporary choral music."]}, {"page": "BBC Symphony Chorus", "response": ["The Chorus was directed from 1989 to 2015 by Stephen Jackson.Private Eye, Tuesday December 8, 2015, page 19, Music & Musicians In his time, he prepared a huge repertoire for more than fifty maestri, including Bernard Haitink, Pierre Boulez, Simon Rattle and Roger Norrington, and composer-conductors such as Luciano Berio and John Adams. Jackson regularly conducted the BBC Symphony Chorus himself, in the concert hall, on tour and in the recording studio.Trinity Laban Conservatoire of Music and Dance,, Stephen Jackson He particularly extended the range of the ensemble's large-scale a cappella choral repertoire, including Rachmaninov's Vespers (All-Night Vigil), Schoenberg's Friede auf Erden and Poulenc's Figure humaine; recorded works by Carl Rütti and Judith Bingham; and commissioned works by Richard Rodney Bennett, Mark-Anthony Turnage and Stephen Montague.BBC Total Immersion Day: Richard Rodney Bennett, November 27, 2016; Philip Glass at 80, January 28, 2017; concert programmes, BBC Symphony Chorus biography"]}, {"page": "2003 in British music", "response": ["*18 January - A two-day festival of the music of Mark-Anthony Turnage is given at the Barbican Centre, London, with three world premieres and chamber concerts by the Nash Ensemble and the Birmingham Contemporary Music Group.Ivan Hewett, \"Momentum: The Music of Mark-Anthony Turnage: Barbican, London EC2, 18-19 Jan\", The Times (18 January 2003): 10; Richard Morrison, \"Blood on the Floor\", The Times (20 January 2003): 17."]}, {"page": "2000 in British music", "response": ["*16 February – The Silver Tassie, an opera by Mark-Anthony Turnage, receives its première at the London Coliseum, performed by the English National Opera."]}, {"page": "1998 in British music", "response": ["*Mark-Anthony Turnage – Evening Songs"]}, {"page": "Ensemble Modern", "response": ["* 1996: Mark-Anthony Turnage: Blood on the Floor (DVD) (Arthaus Musik 100 430)"]}, {"page": "The Country of the Blind", "response": ["*The composer Mark-Anthony Turnage wrote a chamber opera based on the story, completed in 1997."]}, {"page": "1997 in British music", "response": ["*Mark-Anthony Turnage – Twice Through the Heart"]}, {"page": "Scottish Chamber Orchestra", "response": ["The SCO's work in contemporary music has included collaborations with Gordon Crosse,Northcott, Bayan, \"Recordings: Crosse: Elegy, Op.1 (1959-61); Symphony No.1, Op.13A (1976); Dreamsongs, Op.43 (1978)\" (June 1981).  Tempo (New Ser.), 137: 49-51. John McLeod,MacDonald , Calum, \"The Music of John McLeod\" (April 1982).  The Musical Times, 123 (1670): pp. 255-258 and Peter Maxwell Davies, notably the series of Strathclyde Concertos.Johnson, David, \"Reports: Scotland\" (May 1984).  The Musical Times, 125 (1695): pp. 284-285.Warnaby, John, \"Record Review - Maxwell Davies: Strathclyde Concerto No. 9 / Strathclyde Concerto No. 10 / Carolisima\" (July 1997).  Tempo (New Ser.), 201: pp. 53-55.  Einojuhani Rautavaara's Autumn Gardens received its world premiere with the SCO in 1999.  The SCO premiered Sally Beamish's Concerto for Orchestra (Sangsters) in November 2002.  The SCO has commissioned over 100 new works, from composers including Peter Maxwell Davies (the SCO's Composer Laureate), Mark-Anthony Turnage, Judith Weir, Sally Beamish, Karin Rehnqvist, Lyell Cresswell, James MacMillan, Hafliði Hallgrímsson, Einojuhani Rautavaara, Stuart MacRae, Edward Harper and Martin Suckling (appointed SCO Associate Composer in 2013)."]}, {"page": "List of compositions for cello and orchestra", "response": ["*Mark-Anthony Turnage"]}, {"page": "List of compositions for cello and piano", "response": ["*Mark-Anthony Turnage"]}, {"page": "Birmingham Contemporary Music Group", "response": ["2002: Mark-Anthony Turnage: The Torn Fields"]}, {"page": "Meltdown (festival)", "response": ["| Mark-Anthony Turnage, Asian Dub Foundation, Blur, Cicala Mvta, Clinic, Evan Parker, Jarvis Cocker, Jim O'Rourke, Luc Bondy, Radiohead, Elliott Smith, Tom McRae, Clearlake, Richard Alston Dance Company, Smog"]}]}}