{"wiki_id": "http://www.wikidata.org/entity/Q528822", "itemLabel": "Daniela Nardini", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniela_Nardini", "wikipedia_page": {"main": "Daniela Nardini (born 26 April 1968, Largs) is a Scottish actress who played Anna Forbes in the BBC Two television series This Life. The role earned her a BAFTA Best Actress award in 1998 and also earned her a Scottish BAFTA. She won a second Scottish BAFTA in 2009 for her role in Annie Griffin's New Town.", "link_mentions": [{"page": "Blake's 7", "response": [" This featured Derek Riddell as Blake, Colin Salmon as Avon, Daniela Nardini as Servalan, Craig Kelly as Travis, Carrie Dobro as Jenna, Dean Harris as Vila, Owen Aaronovitch as Gan, Michael Praed, Doug Bradley and India Fisher. The new series was broadcast by BBC Radio 7 and repeated during mid-2010 as three one-hour episodes: Rebel (written by Ben Aaronovitch), Traitor (Marc Platt) and Liberator (James Swallow). B7 Productions also produced series of 30-minute prequel audio episodes named Blake's 7: The Early Years, which explored the earlier histories of the central characters."]}, {"page": "Largs", "response": ["* Daniela Nardini actress, was born in Largs."]}, {"page": "Royal Conservatoire of Scotland", "response": ["*Daniela Nardini"]}, {"page": "The Big Fat Quiz of the Year", "response": ["Diane Youdale (the one-time Gladiator Jet) provided a live guest question. The mystery guest was Todd Watkins, who gained fame for kissing a 77-year-old woman on a The Word segment called \"The Hopefuls\".  Recorded guest questions were provided by Mr. Motivator, Goldie, Andi Peters, Tony Mortimer, Melinda Messenger, Daniela Nardini, Sally Gunnell, The Shamen's Mr. C, the members of Hanson and Charles Dance (doing a dramatic reading from the autobiography of Vanilla Ice). The children of Goldsmith Community Hall made an appearance acting out the cloning of Dolly the sheep played by Hannah MacDonald. Providing the song lyric as news story segment was Martyn Lewis, reporting on \"Livin' la Vida Loca\". In the penultimate round, Carr announced that he had hired the gunge tank from Noel's House Party and the losers would be gunged, however Ross convinced Carr himself to go in it and was gunged by Jet."]}, {"page": "Taggart", "response": ["* Daniela Nardini (Episode: Death without Dishonour)"]}, {"page": "This Life (1996 TV series)", "response": ["* Daniela Nardini as Anna Forbes"]}, {"page": "James Nesbitt", "response": ["In March 2004, he appeared in Tony Marchant's Passer By, playing Joe Keyes, a man who witnesses a woman being accosted by some men on a train and chooses not to help. Keyes later discovers that the woman was raped but cannot bring himself to admit in court that he did nothing to help her. Nesbitt described Keyes as \"like a better man than me: a good father and husband. But, once he has made a wrong decision, he can't control everything in his life, as he thinks he is weak. He loses the respect of his wife, his son and at work, and has to reach the lowest possible point before finding redemption.\"Jardine, Cassandra (9 March 2004). \"'I have made catastrophic choices...'\". The Daily Telegraph (Telegraph Media Group). Retrieved 28 February 2009. As a result of these serious roles, he was named the sixth most powerful figure in TV drama in a listing compiled by industry experts for the Radio Times.Staff (5 July 2004). \"Julie Walters tops TV power list\". BBC News. Retrieved 10 January 2008. In September 2004, he starred as Jack Parlabane in the ITV adaptation of Christopher Brookmyre's Quite Ugly One Morning. The producers originally wanted Scottish actor Douglas Henshall to play Glaswegian Parlabane but ITV executives overruled them and cast Nesbitt.Staff (16 February 2004). \"Star is set to be Quite Ugly One Morning in TV drama\". Edinburgh Evening News (The Scotsman Publications). Retrieved 17 April 2008. He was given coaching to perfect the accent but it was soon discarded on the advice of both the director and his co-star Daniela Nardini.Thomas, Liz (25 April 2005). \"Going underground\". The Stage (The Stage Newspaper). Retrieved 9 January 2008. Also in 2004, he filmed the roles of Ronnie Cunningham in Millions (Danny Boyle, 2004), and Detective Banner in Match Point (Woody Allen, 2005). He was considering taking time off from acting and did not really want the role in Match Point. He sent in an audition tape and was accepted for the part. Nesbitt's character appears at the end of the film and he read only that part of the script, so did not know the full circumstances of the crime Banner investigates. Despite his initial reluctance, Nesbitt enjoyed working with Allen, and complimented him on his directing style.Nesbitt, James. Television interview with Michael Parkinson. Parkinson. ITV. 9 June 2007."]}, {"page": "Finborough Theatre", "response": [",Break Away, Finborough Theater, London, The Guardian. Retrieved 15 November 2011 Simon Vinnicombe's Year 10, Joy Wilkinson's Fair  which transferred to the West End; Waterloo Day with Robert Lang; Sarah Phelps’ Modern Dance for Beginners, subsequently produced at the Soho Theatre; Carolyn Scott-Jeffs'  comedy Out in the Garden, which transferred to the Assembly Rooms, Edinburgh; the London premiere of Larry Kramer's The Destiny of Me ; The Women's War – an evening of original suffragette plays; Steve Hennessy’s Lullabies of BroadmoorLullabies of Boradmoor: A Broadmoor Quartet, British Theater Guide. Retrieved 15 November 2011 (about the Finborough Road murder of 1922); the Victorian era comedy Masks and Faces;Masks and Faces, British Theater Guide. Retrieved 15 November 2011 Etta JenksEtta Jenks, British Theater Guide. Retrieved 15 November 2011 with Clarke Peters and Daniela Nardini; The Gigli ConcertThe Gigli Concert, British Theater Guide. Retrieved 15 November 2011 with Niall Buggy, Catherine Cusack and Paul McGann which transferred to the Assembly Rooms, Edinburgh);  Hortensia and the Museum of Dreams with Linda Bassett, Albert's Boy by James Graham starring Victor Spinetti, Peter Oswald’s Lucifer Saved with Mark Rylance, Blackwater Angel, the UK debut of Irish playwright Jim Nolan with Sean Campion, the first London revival for over seventy years of Loyalties by John Galsworthy, the world premiere of Plague Over England by Nicholas de Jongh which subsequently transferred to the West End at the Duchess Theatre, the first revival of Hangover Square, adapted by Fidelis Morgan from the novel by Patrick Hamilton, the UK premiere of the musical Ordinary Days by Adam Gwon and a season of plays by William Saroyan."]}, {"page": "Tube Tales", "response": ["Starring: Daniela Nardini", "Cast: (in alphabetical order) Buster Bevis (Father); Helen Coker (Bride To Be); Mark Frost (Dude); Sky Glover (Girlfriend); Simon Greenall (Business Man); Dominic Holland (Cello Player); Daniela Nardini (Heroine); Matthew Xia (Boyfriend)."]}]}}