{"wiki_id": "http://www.wikidata.org/entity/Q5289697", "itemLabel": "Dolway Walkington", "itemDescription": "Irish rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Dolway_Walkington", "wikipedia_page": {"main": "Dolway Bell Walkington (25 January 1867 – 18 April 1926) was an Irish rugby union player and solicitor. Walkington played club rugby for North of Ireland FC and international rugby for Ireland, winning eight caps. Although captaining Ireland twice, he is more often remembered for his poor eyesight and the fact that he occasionally wore a monocle while playing, removing it when required to make a tackle.", "link_mentions": [{"page": "1926 in Ireland", "response": ["*18 April – Dolway Walkington, Irish national rugby union captain (born 1867)."]}, {"page": "1867 in Ireland", "response": ["* 25 January – Dolway Walkington, Irish national rugby union captain (died 1926)."]}, {"page": "List of Ireland national rugby union players", "response": ["|Dolway Walkington"]}, {"page": "1887 Home Nations Championship", "response": ["Ireland: Dolway Walkington (NIFC), CR Tillie (Dublin Uni.), DF Rambaut (Dublin Uni.), R Montgomery (Cambridge University), JH McLaughlin (Derry), RG Warren (Lansdowne) capt., Victor Le Fanu (Cambridge University), Thomas Lyle (Dublin Uni.), EJ Walsh (Lansdowne), JS Dick (Queen's College, Cork), R Stevenson (Lisburn), J Macauley (Limerick), J Chambers (Dublin Uni.), J Johnston (Belfast Albion), HJ Neill (NIFC)", "Ireland: Dolway Walkington (NIFC), Maxwell Carpendale (Monkstown), DF Rambaut (Dublin Uni.), R Montgomery (Cambridge University), PJ O'Connor (Lansdowne), RG Warren (Lansdowne) capt., Victor Le Fanu (Cambridge University), T Taggart (Dublin Uni.), EJ Walsh (Lansdowne), JS Dick (Queen's College, Cork), R Stevenson (Lisburn), W Davison (Belfast Academy), J Chambers (Dublin Uni.), J Johnston (Belfast Albion), HJ Neill (NIFC)"]}, {"page": "1888 Home Nations Championship", "response": ["Ireland: Dolway Walkington (NIFC), Maxwell Carpendale (Monkstown), DF Rambaut (Dublin U.), CR Tillie (Dublin U.), RG Warren (Landsdowne), JH McLaughlin (Derry), HJ Neill (NIFC) capt., EW Stoker (Wanderers), FO Stoker (Wanderers), WG Rutherford (Tipperary), T Shanahan (Landsdowne), CM Moore (Dublin U.), J Moffatt (Belfast Academy), RH Mayne (Belfast Academy), W Ekin (Queen's College)"]}, {"page": "1890 Home Nations Championship", "response": ["Ireland: Dolway Walkington (NIFC), RW Dunlop (Dublin U.), RW Johnston (Dublin U.), T Edwards (Landsdowne), RG Warren (Landsdowne) capt., AC McDonnell (Dublin U.), J Moffat (Belfast Academy), HT Galbraith (Belfast Academy), J Waites (Bective Rangers), JH O'Conner (Bective Rangers), R Stevenson (Dungannon), J Roche (Wanderers), WJN Davis (Bessbrook), EF Doran (Landsdowne), LC Nash (Queen's Co. Cork)", "Ireland: Dolway Walkington (NIFC), RW Dunlop (Dublin U.), RW Johnston (Dublin U.), T Edwards (Landsdowne), Benjamin Tuke (Bective Rangers), RG Warren (Landsdowne) capt., JN Lytle (NIFC), EG Forrest (Wanderers), J Waites (Bective Rangers), JH O'Conner (Bective Rangers), R Stevenson (Dungannon), J Roche (Wanderers), WJN Davis (Bessbrook), Victor Le Fanu (Landsdowne), LC Nash (Queen's Co. Cork)"]}, {"page": "1891 Home Nations Championship", "response": ["Ireland Dolway Walkington (NIFC) capt., RW Dunlop (Dublin U.), S Lee (NIFC), R Montgomery (NIFC), Benjamin Tuke (Bective Rangers), AC McDonnell (Dublin U.), JN Lytle (NIFC), EG Forrest (Wanderers), J Waites (Bective Rangers), JH O'Conner (Bective Rangers), CV Rooke (Dublin U.), J Roche (Wanderers), WJN Davis (Bessbrook), Victor Le Fanu (Landsdowne), LC Nash (Queen's Co. Cork)", "Ireland Dolway Walkington (NIFC) capt., RW Dunlop (Dublin U.), S Lee (NIFC), HG Wells (Bective Rangers), Benjamin Tuke (Bective Rangers), ED Cameron (Bective Rangers), JN Lytle (NIFC), RD Stokes (Queens College), J Moffatt (Belfast Albion), JH O'Conner (Bective Rangers), JH O'Conor (Bective Rangers), J Roche (Wanderers), WJN Davis (Bessbrook), EF Frazer (Bective Rangers), LC Nash (Queen's Co. Cork)", "Ireland Dolway Walkington (NIFC), RW Dunlop (Dublin U.), S Lee (NIFC), HG Wells (Bective Rangers), R Pedlow (Bessbrook), ED Cameron (Bective Rangers), T Fogarty (Garryowen), RD Stokes (Queens College), FO Stoker (Wanderers), JS Jameson (Lansdowne), R Stevenson (Dungannon) capt., J Roche (Wanderers), WJN Davis (Bessbrook), CV Rooke (Dublin U.), L.C. Nash (Queen's Co. Cork)"]}]}}