{"wiki_id": "http://www.wikidata.org/entity/Q5298340", "itemLabel": "Dorothy Buxton", "itemDescription": "British activist (1881-1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dorothy_Buxton", "wikipedia_page": {"main": "Dorothy Frances Buxton (née Jebb; 3 March 1881 – 8 April 1963) was an English humanitarian, social activist and commentator on Germany.", "link_mentions": [{"page": "Ellesmere, Shropshire", "response": ["* Dorothy Buxton (née Jebb) (1881 in Ellesmere – 1963) humanitarian,  British Library of Political and Economic Science, Code PA742 retrieved 11 March 2018 social activist and commentator on Germany."]}, {"page": "Save the Children", "response": ["The Save the Children Fund was founded in London, England, on 15 April 1919 by Eglantyne Jebb and her sister Dorothy Buxton as an effort to alleviate starvation of children in Germany and Austria-Hungary during the Allied blockade of Germany of World War I which continued after the Armistice."]}, {"page": "Charles Kay Ogden", "response": ["It evolved into an organ of international comment on politics and the war, supported in the background by a group of Cambridge academics including Edward Dent (who sent Sassoon's work), Theo Bartholomew and Goldsworthy Lowes Dickinson.Jean Moorcroft Wilson, Siegfried Sassoon: The Making of a War Poet (1998), p. 254. A survey of the foreign press filled more than half of each issue, being the Notes from the foreign press supplied by Dorothy Buxton which appeared there from October 1915 onwards until 1920,Oxford Dictionary of National Biography, entry on Dorothy Buxton. and its circulation rose to over 20,000. Buxton was in fact then leading a large team translating and collating articles from up to 100 foreign newspapers; for instance Italian articles were supplied in translation in numbers by Dent.Lawrence Haward, Edward J. Dent (1956), p. 24. This digest of European press coverage was exclusive to the Magazine, and gave it disproportionate influence in political circles. For example, Robert Reid, 1st Earl Loreburn, used the Notes from the foreign press to advocate to the Marquess of Lansdowne in 1916 against bellicose claims and attitudes on the British side.", "During 1917 the Magazine came under heavy criticism, with its neutral use of foreign press extracts being called pacifism, particularly by the pro-war patriotic Fight for Right Movement headed by Francis Younghusband. Dorothy Buxton's husband Charles Roden Buxton was closely associated with the Union of Democratic Control. Sir Frederick Pollock who chaired Fight for Right wrote to The Morning Post in February 1917 charging the Magazine with pacifist propaganda, and with playing on its connection with the University as if it had official status.C. K. Ogden: A Collective Memoir, p. 38. Gilbert Murray, a supporter of Fight for Right but also a defender of many conscientious objectors and the freedom of the press, intervened to protest, gaining support from Bennett and Hardy.Duncan Wilson, Gilbert Murray (1987), p. 236. John George Butcher, Conservative Member of Parliament for the City of York, asked a question in Parliament about government advertising in the Magazine, during November 1917. The parliamentary exchange had two Liberal Party politicians, William Pringle and Josiah Wedgwood, pointing out that the Magazine was the only way they could read German press comments."]}, {"page": "International Save the Children Union", "response": ["The International Save the Children Union () was a Geneva-based international organisation of children's welfare organisations founded in 1920 by Eglantyne Jebb and her sister Dorothy Buxton, who had earlier founded Save the Children in the UK. The intention was to create 'a powerful international organisation, which would extend its ramifications to the remotest corner of the globe'.  "]}, {"page": "Noel Buxton", "response": ["Inspired by the abolitionism of his great-grandfather, he established the Noel Buxton Trust in 1919. This had a commitment to \"a worldwide view of human welfare\". The initial grant was made to the Fight the Famine Council, which was led by Eglantyne Jebb and his sister-in-law Dorothy Buxton which later became the Save the Children Fund. The charity is still functioning has recently funded the Family Rights Group, the Community Chaplaincy Association working with ex-prisoners, and Excellent, a charity supporting sustainable development with subsistence communities in Africa."]}, {"page": "Timeline of young people's rights in the United Kingdom", "response": ["| In the aftermath of the Great War social reformer Eglantyne Jebb and her sister Dorothy Buxton documented the terrible misery in which the children of Central, Eastern and Southern Europe were plunged, and believing there was no such thing as an \"enemy\" child, founded the Save the Children Fund in London to address their needs. The Save the Children International Union (SCIU) was founded in Geneva in 1920 with Save the Children and Swedish Rädda Barnen as leading members.UNICEF Company history. Retrieved 4 September 2008. Jebb went on to draft the Declaration of the Rights of the Child."]}, {"page": "Dorothy Frances Jebb", "response": ["#REDIRECT Dorothy Buxton"]}, {"page": "Dorothy Frances Buxton", "response": ["#REDIRECT Dorothy Buxton"]}, {"page": "April 1919", "response": ["* British activist Eglantyne Jebb was arrested in London for distributing pamphlets in an effort to raise awareness and funding for the relief of German and Austrian children stricken by food shortages by the German blockade that was prolonged despite the signing of the 1918 armistice. Despite going to trial and being found guilty of unlawful protest, Jebb's impassioned speech during the trial so impressed the prosecuting counsel that he offered to pay her fine. It motivated Jebb and her sister Dorothy Buxton to establish the Save the Children fund the following May."]}, {"page": "Lewis Bernard Golden", "response": ["In 1920 L. B. Golden was appointed general secretary of Save the Children Fund, which had been founded in May 1919 to alleviate child starvation in post-war Europe. As the Fund's first general secretary, he worked closely with its founders, Dorothy Buxton and Eglantyne Jebb, who recruited him with a view to establishing the charity on sustainable, business-like foundations. As a salaried member of staff, he took on work which Buxton had been undertaking on a voluntary basis. Whilst Jebb took responsibility for the organisation's policy and overall vision, Golden, with his managerial background, was relied upon to run the administrative side. Golden drove forward the Fund's publicity and fundraising agenda, by taking the innovative step of taking out full-page advertisements in daily newspapers. His particular achievement was the organisation of the Russian famine relief operation in 1921–1922. Despite criticism from those who believed that the severity of the famine was exaggerated, and those opposed to the feeding of \"Soviet\" children, the campaign was a success, with Save the Children Fund distributing over 121 million children's meals."]}]}}