{"wiki_id": "http://www.wikidata.org/entity/Q5290963", "itemLabel": "Dominik Diamond", "itemDescription": "Scottish television and radio personality", "wikipedia_url": "https://en.wikipedia.org/wiki/Dominik_Diamond", "wikipedia_page": {"main": "Paul Dominik Diamond (born 31 December 1969) is a Scottish television and radio presenter and newspaper columnist. He is best known as the original presenter of Channel 4's video gaming programme GamesMaster, as host of The Dominik Diamond Breakfast Show on XFM Scotland and as a columnist for the Daily Star. After moving to Canada in 2009 he has hosted radio shows for stations in Toronto, Halifax, Nova Scotia and Calgary, where he was host of the Morning Show on Jack FM from 2015 to 2018.", "link_mentions": [{"page": "List of Scots", "response": ["* Dominik Diamond (born 1969)"]}, {"page": "1969", "response": ["* December 31 – Dominik Diamond, Scottish presenter and newspaper columnist"]}, {"page": "Arbroath", "response": ["*Dominik Diamond (born 1969), TV presenter"]}, {"page": "Simon Pegg", "response": ["Pegg moved to Stratford-upon-Avon, Warwickshire when he was 16 and studied English literature and theatre at Stratford-upon-Avon College. He graduated from the University of Bristol in 1991 with a BA in Theatre, Film, and Television, titling his undergraduate thesis \"A Marxist overview of popular 1970s cinema and hegemonic discourses\". While there, he performed as a member of a comedy troupe called \"David Icke\" and the Orphans of Jesus, alongside David Walliams, Dominik Diamond, and Jason Bradbury."]}, {"page": "Dominic", "response": ["*Dominik Diamond (born 1969), Scottish broadcaster, writer, radio presenter and former host of GamesMaster"]}, {"page": "CFNY-FM", "response": ["In November 2013, the station faced criticism when Dean Blundell Show cohost Derek Welsman made on-air comments about a criminal trial on which he had been the jury foreman, resulting in allegations both of homophobia—the case involved allegations of sexual assault against a client of a gay bathhouse—and of potentially causing a mistrial by publicly discussing aspects of the jury deliberations.\"Dean Blundell show apologizes for ‘homophobic’ juror jokes\". Toronto Star, December 12, 2013. The station announced the show's suspension on December 12, 2013,\"Dean Blundell Show suspended from Toronto’s Edge 102.1\". Toronto Star, December 12, 2013. and the show was ultimately cancelled on January 6, 2014. With the firings of Blundell and Welsman, the station's morning show was taken over by \"Fearless Fred\" Kennedy\"‘Fearless Fred’ Kennedy to fill in for cancelled Dean Blundell on 102.1 the Edge\". canada.com, January 8, 2014. until March 18, 2014, when former CILQ-FM evening show host Dominik Diamond was announced as the morning show's new host.\"Corus' 102.1 the Edge Announces New On-Air Lineup\". Broadcaster, March 18, 2014."]}, {"page": "Patrick Moore", "response": ["Moore appeared in other television and radio shows, including the BBC Radio 4 panel show Just a Minute. From 1992 until 1998, he played the role of GamesMaster, a character who knew everything about video games, in the Channel 4 television series GamesMaster. GamesMaster would issue video game challenges and answered questions about cheats and tips. The show's host, Dominik Diamond, said that Moore did not understand anything he said on the show, but recorded his contributions in single takes."]}, {"page": "Daily Star (United Kingdom)", "response": ["Other regular features in the Daily Star include Wired, a daily gossip column edited by James Cabooter, \"Hot TV\", a television news column edited by Ed Gleave and Peter Dyke, Mike Ward's weekly television review page and \"Forum\", a daily page devoted to readers' text messages, which are apparently printed verbatim. Opinion columns by Dominik Diamond and Vanessa Feltz were discontinued in 2008. Until he died in 2012, the chief football writer was Brian Woolnough, lured from The Sun in 2001 for a £200,000 pay packet."]}, {"page": "GamesMaster", "response": ["Dominik Diamond was the host for six of the original seven series while amateur astronomer Sir Patrick Moore featured as the GamesMaster. He was replaced in 2021 with Sir Trevor McDonald. The show's format consists of a mixture of game reviews, small \"features\", tips and challenges. Challenges form the biggest section of the show and generally consist of \"average\" players and celebrities, often competing against each other for the coveted Golden Joystick. The show was a hit from its initial series with high ratings and an audience made up mostly of adolescent boys, tuning in to hear Diamond's double entendres and sexual innuendos.", "Although it featured game reviews, most of the programme was about challenges where game players would compete against one another for the title of \"GamesMaster Champion\". Contestants who were successful at their challenges were rewarded with the coveted \"GamesMaster Golden Joystick\" trophy. Dominik Diamond usually presented the programme with Sir Patrick Moore appearing in pre-recorded inserts as the 'Games Master'. During these challenges, Dominik was joined by a host of commentators. These included Derrick Lynch, Kirk Ewing, Julian Rignall, Rik Henderson, Dave Perry, Tim Boone and Neil West amongst others.", "Each location the series was set in, a plot device occurred after Auntie Marisha blew up the newly pine-fitted kitchen at the end of series 2, causing the oilrig to be evacuated. Dominik Diamond was later revealed to be burnt to death while trying to escape, giving way to Dexter Fletcher to present series 3, when in reality Diamond left the programme. Diamond would later return in series 4 onwards in Hell and then in Heaven for series 5, continuing on from his whereabouts after his death in series 2 (although the opening title sequence of the fifth series offers an alternative \"death\", with Diamond being run over by a bus and flat-lining while in hospital). He then fell from Heaven in the opening credits to series 6 continuing a bit of continuity there, but that was dropped for the series 7 titles where Diamond travelled to the island setting of series 7 during a dream sequence.", "It is believed that Dominik Diamond, along with the programme's producers, wanted to make a more adult programme that would air in a late night, more mainstream time slot. (Series 8 was going to be set on a pirate ship with buxom wenches as the Golden Joystick assistants.) There was also talk of a spin-off programme being made that would seek to emulate the US talk shows of the time. Whether this would have meant a programme that focused far less on games is unknown. No confirmation exists that any pilots of this concept were ever made; Channel 4 did not see the potential of a gaming programme for an older, adult audience.", "Dominik Diamond returned to games television first as an interviewee in the 1999 documentary Games Wars, in which he commented that boys getting turned on by Lara Croft was tragic and \"desperately sad\". He then returned to presenting in 2004 with a show on Bravo, called When Games Attack. This programme was largely feature-based and contained plenty of Dominik's trademark humour. Prior to its broadcast, Dominik featured in a sizable Edge interview, with his longtime producer Johnny Finch. Both of them were quite vocal in stating their contempt for other shows about video games that were doing a bad job."]}, {"page": "Sensible Software", "response": ["In 2013, book publishers Read-Only Memory released Sensible Software 1986–1999. This comprehensive retrospective on the entire history of the company was written by renowned Zzap!64 games journalist Gary Penn in conversational style. It features 19 different contributors including extensive interviews with Jon Hare and other Sensibles, plus games luminaries of the era including David Darling (entrepreneur), Dominik Diamond and Peter Molyneux. Chris Yates declined to be interviewed for the book.  Half art book and half retrospective analysis the book is the first of its kind to cover the creative, business and technical issues that shaped the whole era of early games development in the UK and Sensible Software in particular. The historical importance of this book has been recognised by BAFTA who hold copies in both their library in Central London and their historical archive."]}, {"page": "XFM Scotland (2006)", "response": ["Normal XFM Scotland programmes were launched by breakfast presenter Dominik Diamond on 4 January 2006. The first record to be played on XFM Scotland was 'Loaded' by Primal Scream. (The first record to be played on Beat 106 was \"Revolution\" by The Beatles.)", "*Dominik Diamond"]}, {"page": "Dominic Diamond", "response": ["#REDIRECT Dominik Diamond"]}, {"page": "Gun Fight", "response": ["Taito used a control scheme similar to Western Gun for the run-and-gun shooter Front Line (1982). In 1995, GamesMaster host Dominik Diamond called Sega's arcade game Virtual On: Cyber Troopers \"a futuristic version of the old Gun Fight game.\""]}, {"page": "Fantasy Football League", "response": ["Fantasy Football League is a British television comedy programme hosted by David Baddiel and Frank Skinner. It was inspired by the Fantasy Football phenomenon which started in the early 1990s and followed on from a BBC Radio 5 programme hosted by Dominik Diamond, although the radio and TV versions overlapped by several months. Three series were broadcast from 14 January 1994 to 10 May 1996 (followed by episodes during Euro 96). The show then moved to ITV for live specials on alternate nights throughout the 1998 World Cup and then again through Euro 2004."]}, {"page": "Extreme Celebrity Detox", "response": ["*Tai chi: Dominik Diamond, Jilly Goolden, Catherine McQueen, Jack Osbourne"]}, {"page": "Strathallan School", "response": ["*Dominik Diamond — Television Presenter"]}, {"page": "Talk 107", "response": ["In January 2008, Simon Pia and Heather Dees' drivetime slot was given to Dominik Diamond and Marisa de Andrade, who had both been presenting weekend breakfast since November 2007. On 30 March 2008, Sheridan was dropped as a presenter and he follows ex-presenters, Mike Graham and Susan Morrison, in the station's transformation. From September 2008, the station began broadcasting a live Sunday afternoon sports programme with the TV presenter Jeremy Kyle, networked from TalkSport in London."]}, {"page": "Gamezville", "response": ["During an interview with GamesMaster Magazine about his new game show When Games Attack, Dominik Diamond declared that \"Gamezville is the equivalent to eating your own shit, the producers must have thought 'Oh because we have black people in it must be street.'\""]}, {"page": "Virtual On: Cyber Troopers", "response": ["In a December 1995 GamesMaster preview of the arcade game, Dominik Diamond called Virtual On \"a futuristic version of the old Gun Fight game.\" Reviewing the arcade version, a Next Generation critic described the game as \"phenomenally intriguing\". He found the use of full three-dimensional movement, heat-seeking projectiles, and defensive sprints to be strong innovations which set the game above rival Namco's Cyber Sled. He additionally praised the 60 frames per second frame rate, quick-moving camera, use of robots as combatants, and dynamic combat strategies, and expressed concern that US gamers would pass by the game due to its distinctively Japanese character designs and initially confusing up-close combat."]}, {"page": "When Games Attack", "response": ["When Games Attack is a British television show, that originally aired on Bravo from 2004 to 2005. The show is presented by Dominik Diamondhttps://www.broadcastnow.co.uk/gamertv-to-produce-new-bravo-series/1099007.article and created by Jonny Ffinch with whom he had previously worked on GamesMaster. Its focus was video games."]}, {"page": "Rob Brydon's Annually Retentive", "response": ["| Alistair McGowan, Dominik Diamond"]}, {"page": "Tony Moorey", "response": ["In 1998, after various production jobs at Piccadilly he found a job at the BBC in London making trails for Edwina Currie, Dominik Diamond, David Mellor and other programmes on Radio Five Live. He also commissioned music from, among others, New Order."]}, {"page": "Mega (magazine)", "response": ["Mega City was the games news section where all the Mega Drive news was announced. Also included in this section were features like the Editorial column, 'Q's in the News', 'Bull Durham's World of PR' and 'Busman's Holiday'. Q's in the News was a list of questions that was printed in the News section. The Mega Drive related questions ranged from easy to hard. There were also five screen grabs from games, which were altered and skewered, from which you had to answer, or guess, what game the shot was from. Mainly because of Bull Durham's first name, Mega used this character to bust PR bluffs and blunders in the Mega Drive marketing world, with hilarious consequences. Busman's Holiday featured a Q&A style interview with people working in the video game industry like musician Rob Hubbard, EA Marketing Manager Simon Jeffrey, Games' Tester Danny Curley, GamesMaster host Dominik Diamond and a familiar games journalist called Andy Dyer.", "Mega would feature interviews with people who were involved in the video games scene. Celebrity interviews included Dominik Diamond, Robert Llewellyn (Kryten from Red Dwarf), Pat Sharp, Andy Crane and 'The man with the cyber-razor cut' Jimmy of Sega adverts. Discussions would usually involve what they were doing at the moment and occasionally even Sega related stuff. The Pat Sharp interview focused on the heading 'Is Sonic Killing Rock 'n' Roll?'.", "; Neil West – Editor (1992–1993) : West worked on Sega Power in 1990, becoming deputy editor.  He also contributed to several other Future titles like Commodore Format, Amiga Format and Amiga Power  It was during this time that he also appeared many times on games TV shows such as GamesMaster, co-commentating with host Dominik Diamond on the latest games challenge. Also co-hosted, with Jane Goldman, the Games World reviews show House of Games broadcast on satellite TV.", "; Josse Bilson – Staff Writer : A Staff Writer on the newly acquired Sega Zone in 1993.  When Future Publishing sold the magazine to Maverick Magazines in early 1994, Bilson moved over to Mega as Staff Writer. Has also appeared on GamesMaster as a co-commentator during the fourth season. Appeared on GamesMaster in 1994 as co-commentator next to host Dominik Diamond. Later worked on PlayStation Power magazine."]}, {"page": "BBC Radio 5 (former)", "response": ["* Sportscall (with Dominik Diamond)", "* Fantasy Football League (with Dominik Diamond)", "* Dominik Diamond"]}, {"page": "Capital Scotland", "response": ["XFM Scotland programmes were launched by breakfast presenter Dominik Diamond on 4 January 2006 with Loaded by Primal Scream as the first song played on the relaunched station. A major marketing campaign was launched a year later in a bid to try to regain lost listeners since the rebrand. By September 2007, the station was only reaching audience shares of 2.6% in the West and 4.1% in the East.", "*Dominik Diamond"]}, {"page": "Gamepad (TV series)", "response": ["It was replaced in 2004 by a new show called When Games Attack. It was hosted by Dominik Diamond, the person who previously hosted GamesMaster for Channel 4."]}, {"page": "Celtic F.C. supporters", "response": ["* Dominik Diamond, Scottish presenter and newspaper columnist"]}, {"page": "Richard Herring's interview podcasts", "response": ["| Dominik Diamond – Remote record"]}]}}