{"wiki_id": "http://www.wikidata.org/entity/Q5292760", "itemLabel": "Don Hayward", "itemDescription": "Welsh rugby union and rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Don_Hayward", "wikipedia_page": {"main": "Donald James Hayward (30 June 1925 – 16 February 1999) was a Welsh international prop who played club rugby for Newbridge and Wigan RLFC. He won 15 caps for Wales, and was selected to play in the British Lions on the 1950 tour of Australia and New Zealand. Hayward is considered to be one of the finest forwards to represent Wales in the early post-war period. He was an excellent lineout specialist and was an aggressive mauler in the loose. Hayward was also an extremely strong tackler and played with total conviction.", "link_mentions": [{"page": "1999 in Wales", "response": ["*16 February - Don Hayward, Wales and British Lions international rugby player, 73"]}, {"page": "1999 in New Zealand", "response": ["* 16 February – Don Hayward, rugby union and rugby league player (born 1925)"]}, {"page": "1925 in Wales", "response": ["*30 July - Don Hayward, Wales international rugby player (died 1999 in New Zealand)"]}, {"page": "Sydney University Liberal Club", "response": ["1953 - Don Hayward", "1954 - Don Hayward", "* Don Hayward, Victorian Minister for Education 1992–96"]}, {"page": "Newbridge RFC", "response": ["*  Don Hayward", "*  Don Hayward"]}, {"page": "1950 British Lions tour to New Zealand and Australia", "response": ["|Don Hayward ||Lock|||| Newbridge|| 3"]}, {"page": "1951–52 South Africa rugby union tour of Europe", "response": ["Wales: Gerwyn Williams (Llanelli), Ken Jones (Newport), Malcolm Thomas (Newport), Bleddyn Williams (Cardiff), Lewis Jones (Llanelli), Cliff Morgan (Cardiff), Rex Willis (Cardiff), Billy Williams (Swansea), Dai Davies (Somerset Police), Don Hayward (Newbridge), Rees Stephens (Neath), Roy John (Neath), Len Blyth (Swansea), John Gwilliam (Edinburgh Wanderers) (capt.), Allen Forward (Pontypool)"]}, {"page": "Allen Forward", "response": ["During the 1951/52 season, Forward faced the touring South African team twice. His first encounter was as part of a joint Pontypool / Newbridge team that met the Springboks on 18 October 1951. Forward was only one of two internationals in the joint club side, the other being Don Hayward. South Africa won 15–6. His second encounter, playing in his usual role as a flanker, was his second international cap for Wales, and his second international defeat. The game was played at the National Stadium in Cardiff and Wales lost 6–3.Stent (1952), p.160"]}, {"page": "Hayward (surname)", "response": ["*Don Hayward (1925–1999), Welsh international rugby union player"]}, {"page": "June 1925", "response": ["*Born: Don Hayward, rugby player, in Pontypool, Wales (d. 1999)"]}, {"page": "Deaths in February 1999", "response": ["*Don Hayward, 73, Welsh rugby player."]}]}}