{"wiki_id": "http://www.wikidata.org/entity/Q5293602", "itemLabel": "Don Taylor", "itemDescription": "British director and playwright (1936-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/Don_Taylor_(English_director_and_playwright)", "wikipedia_page": {"main": "Donald Victor Taylor (30 June 1936 – 11 November 2003) was an English writer, director and producer, active across theatre, radio and television for over forty years. He is most noted for his television work, particularly his early 1960s collaborations with the playwright David Mercer, much of whose early work Taylor directed for the BBC.", "link_mentions": [{"page": "Antigone (Sophocles play)", "response": ["* 1986 – Don Taylor, prose (The Theban Plays, Methuen Drama; )"]}, {"page": "Oedipus Rex", "response": ["In 1986, an English-language version starring Michael Pennington, John Gielgud, and Claire Bloom, and directed by Don Taylor was produced by the BBC as part of a trilogy of fimed presentations of The Theban Plays. It presented the actors in modern dress.", "Don Taylor's 1986 translation/adaptation of Oedipus Rex using the English title Oedipus the King formed part of the BBC's Theban Plays trilogy. It starred Michael Pennington as Oedipus, with Claire Bloom as Jocasta, Sir John Gielgud as Tiresias, and John Shrapnel as Creon.", "* Don Taylor, 1986 - prose"]}, {"page": "Children's Crusade", "response": ["* A Long March To Jerusalem (1978), a play by Don Taylor about the story of the Children's Crusade."]}, {"page": "Oedipus at Colonus", "response": ["* Don Taylor, 1986 - prose", "* Don Taylor's 1986 television adaptation starring Anthony Quayle and Juliet Stevenson"]}, {"page": "1936 in television", "response": ["**Don Taylor, director (died 2003)"]}, {"page": "BBC Television Shakespeare", "response": ["* Directed by Don Taylor", "Director Don Taylor initially planned a representational setting for the film; Verona, Milan and the forest were all to be realistic. However, he changed his mind early in preproduction and had production designer Barbara Gosnold go in the opposite direction, choosing a stylised setting. To this end, the forest is composed of metal poles with bits of green tinsel and brown sticks stuck to them (the cast and crew referred to the set as \"Christmas at Selfridges\"). Whilst the set for Verona was more realistic, that for Milan featured young extras dressed like cherubs. This was to convey the idea that the characters lived in a \"Garden of Courtly Love\", slightly divorced from everyday reality.Willis, p. 212. Working in tandem with this idea, upon Proteus' arrival in Milan, after meeting Silvia, he is left alone on stage, and the weather suddenly changes from calm and sunny to cloudy and windy, accompanied by a thunderclap. The implication being that Proteus has brought a darkness within him into the garden of courtly delights previously experienced by Silvia."]}, {"page": "Verity Lambert", "response": ["Although Lambert was not Newman's first choice to produce the series—Don Taylor and Shaun Sutton had both declined the position—he was very keen to ensure that Lambert took the job after his experience of working with her at ABC. \"I think the best thing I ever did on that was to find Verity Lambert,\" he told Doctor Who Magazine in 1993. \"I remembered Verity as being bright and, to use the phrase, full of piss and vinegar! She was gutsy and she used to fight and argue with me, even though she was not at a very high level as a production assistant.\""]}, {"page": "The Two Gentlemen of Verona", "response": ["In 1983, the play was adapted for the BBC Television Shakespeare series, as the fourth episode of the sixth season. Directed by Don Taylor, it starred Tyler Butterworth as Proteus, John Hudson as Valentine, Tessa Peake-Jones as Julia and Joanne Pearce as Silvia. For the most part, the adaptation is taken verbatim from the First Folio, with some very minor differences. For example, omitted lines include the Duke's \"Knowing that tender youth is soon suggested\" (3.1.34), and Julia's \"Her eyes are grey as glass, and so are mine\" (4.4.189). Other differences include a slightly different opening scene to that indicated in the text. Whereas the play seems to open with Valentine and Proteus in mid-conversation, the adaptation begins with Mercatio and Eglamour attempting to formally woo Julia; Mercatio by showing her a coffer overflowing with gold coins, Eglamour by displaying a parchment detailing his ancestry. Neither Eglamour nor Mercatio appear in the text. However, there is no dialogue in this scene, and the first words spoken are the same as in the text (\"Cease to persuade my loving Proteus\"). Eglamour is also present in the final scene, albeit once again without any dialogue, and, additionally, the capture of Silvia and the flight of Eglamour is seen, as opposed to merely being described. The music for the episode was created by Anthony Rooley, who wrote new arrangements of works from Shakespeare's own time, such as John Dowland's \"Lachrimae\". Performed by The Consort of Musicke, other musicians whose music was used include William Byrd, Thomas Campion, Anthony Holborne, John Johnson, Thomas Morley and Orazio Vecchi.", "Taylor initially planned a representational setting for the film; Verona, Milan and the forest were all to be realistic. However, he changed his mind early in preproduction and had production designer Barbara Gosnold go in the opposite direction – a stylised setting. To this end, the forest is composed of metal poles with bits of green tinsel and brown sticks stuck to them (the cast and crew referred to the set as \"Christmas at Selfridges\"). Whilst the set for Verona remained relatively realistic, that for Milan featured young actors dressed like cherubs as extras. This was to convey the idea that the characters lived in a 'Garden of Courtly Love', which was slightly divorced from the everyday reality represented by Verona. Working in tandem with this idea, upon Proteus' arrival in Milan, after meeting Silvia, he is left alone on screen, and the weather suddenly changes from calm and sunny to cloudy and windy, accompanied by a thunderclap. The implication being that Proteus has brought a darkness within him into the garden of courtly delights previously experienced by Silvia. Although the production is edited in a fairly conventional manner, much of it was shot in extremely long takes, and then edited into sections, rather than actually shooting in sections. Director Don Taylor would shoot most of the scenes in single takes, as he felt this enhanced performances and allowed actors to discover aspects which they never would were everything broken up into pieces.See also  and  Both essays are reprinted in "]}, {"page": "Eyam", "response": ["* The Roses of Eyam by Don Taylor; first performed 1970, broadcast on TV in 1973; published by Heinemann, 1976.Preview on Google Books"]}, {"page": "Sydney Newman", "response": ["Shaun Sutton was one of the drama producers who worked under Newman at the BBC, and later succeeded the Canadian as Head of Drama. He later wrote that Newman \"galvanised television drama ... [He created] a climate in which boldness paid.\" In contrast, Don Taylor, who was a director in the drama department at the time, later claimed that he felt Newman was unsuited to the position of Head of Drama, writing: \"To put it brutally, I was deeply offended that the premier position in television drama, at a time when it really was the National Theatre of the Air, had been given to a man whose values were entirely commercial, and who had no more than a layman's knowledge of the English theatrical tradition, let alone the drama of Europe and the wider world.\"", "After the series had been conceived, Newman initially approached Don Taylor and then Shaun Sutton to produce it, although both declined. He then decided on his former production assistant at ABC, Verity Lambert, who had never produced, written or directed, but she readily accepted his offer. As Lambert became the youngest—and only female—drama producer at the BBC, there were some doubts as to Newman's choice, but she became a success in the role. Even Newman clashed with her on occasion, however, particularly over the inclusion of the alien Dalek creatures on the programme. Newman had not wanted any \"bug-eyed monsters\" in the show, but he was placated when the creatures became a great success."]}, {"page": "Iphigenia in Aulis", "response": ["* Don Taylor, 2004"]}, {"page": "Play of the Month", "response": ["| (play);Don Taylor (additional dialogue)"]}, {"page": "David Mercer (playwright)", "response": ["Much of Mercer's television work for the BBC was made in collaboration with the director Don Taylor. This dated from the beginning of Mercer's career as a television dramatist with the play trilogy, The Generations, an attempt to depict the decline of an idealistic form of socialism over 60 years through the members of three generations of one family. This was composed of Where the Difference Begins (1961),  a tale about two brothers, one who has abandoned socialism, while the other is a Labour Party intellectual; A Climate of Fear (1962) a piece in which a scientist in Britain's nuclear programme discovers his children have joined CND; and the non-naturalistic The Birth of a Private Man (1963), an account of an activists disenchantment with protest who attempts to match left-wing attitudes with the emerging 'affluent' society. The hero of the last play dies at the Berlin Wall facing a stream of bullets from both east and west."]}, {"page": "Juggernaut (1974 film)", "response": ["Bryan Forbes left the project, however, as did his replacement, Don Taylor. Picker then turned to Richard Lester, with whom he had made a number of films at United Artists, notably A Hard Day's Night.  Lester was finishing work on the Musketeers films in Spain when he got a call from Denis O'Dell saying \"We just fired our second director and I've got a Russian ship and we've got to leave on 18 February. Will you take it on?\"Soderbegh p 112"]}, {"page": "Don Taylor", "response": ["*Don Taylor (American filmmaker) (1920–1998), actor and director", "*Don Taylor, American bass vocalist with Foggy River Boys/The Marksmen in 1954", "*Don Taylor (English director and playwright) (1936–2003), stage, television and film producer", "*Don Taylor (sportscaster) (born 1959), Canadian television and radio presenter", "*Don Taylor (Australian politician) (born 1928), Deputy Premier of Western Australia", "*Don Taylor (footballer) (1920–1994), Australian rules half-back", "*Don Taylor (cricketer) (1923–1980), New Zealand cricketer", "*E. Don Taylor (1937–2014), Jamaican-born Episcopal Bishop of Virgin Islands"]}, {"page": "Experimental Theatre Club", "response": ["The club has staged the first productions of many new works, including Epitaph for George Dillon, written by John Osborne in 1957 and directed by Don Taylor.Pembroke College Record, 2003—04, page 80.", "*Don Taylor"]}, {"page": "Helen Grace", "response": ["On stage, she appeared as the wife of Gregor Antonescu (played by David Suchet) in a revival of Terence Rattigan's Man and Boy at the Duchess Theatre, London. She has also appeared in Tennessee Williams' The Glass Menagerie at the Theatre Royal York (November 1999) alongside Honor Blackman, and in Don Taylor's The Road To The Sea at the Orange Tree Theatre, Richmond (2003). During 2007–2008, she played the role of Marjorie Houseman (Baby's mother) in the stage version of Dirty Dancing at the Aldwych Theatre in London's West End."]}, {"page": "Don Taylor (American filmmaker)", "response": ["The son of Mr. and Mrs. D. E. Taylor, Donald Ritchie Taylor was born in Freeport, Pennsylvania on December 13, 1920. (Another source says that he was born \"in Pittsburgh and raised in Freeport, Pa.\") He studied speech and drama at Penn State University and hitchhiked to Hollywood in 1942. He was signed as a contract player at Metro-Goldwyn-Mayer and appeared in small roles. Drafted into the United States Army Air Forces (AAF) during World War II, he appeared in the Air Forces's Winged Victory Broadway play and movie (1944), credited as \"Cpl. Don Taylor.\""]}, {"page": "Chiswick School", "response": ["* Don Taylor – director and playwright"]}, {"page": "Barbara Jefford", "response": ["* \"On This Shaven Green\" by Don Taylor, BBC Radio 4 16 September 2003. With John Wood, Edward Petherbridge."]}, {"page": "W11 Opera", "response": ["*1980\tMak the Sheep Stealer*, Herbert Chappell, Don Taylor"]}, {"page": "Frances Grey (actress)", "response": ["|  || Moliere, or the League of Hypocrites || Armande || Don Taylor || BBC Radio 4"]}, {"page": "The Roses of Eyam", "response": ["The Roses of Eyam is a historical drama by Don Taylor about The Great Plague that swept Britain in 1665/66. It is  largely based on the events that happened in the 'Plague Village' of Eyam in Derbyshire, between September 1665 and December 1666.Historical background BBC Local History - Derbyshire, Feb 2004 Published in 1970, The Roses of Eyam had its world premiere at The Northcott Theatre in Exeter, Devon on 23 September 1970.‘The Roses of Eyam’ at Maddog. June 2005", "A television production  of The Roses of Eyam was broadcast on BBC2 on 12 June 1973 and produced at the BBC's Pebble Mill Studios. Don Taylor himself adapted the stage play for television and he directed it."]}, {"page": "1936 in British television", "response": ["* 30 June – Don Taylor, director (died 2003)"]}, {"page": "The Comical History of Don Quixote", "response": ["The complete work itself, according to writer-director Don Taylor, is actually three separate plays, and in total takes more than seven hours to perform.https://www.amazon.com/dp/B000000UL1| \"Don Quixote: The Musical\" It is seldom, if ever, revived today, and was not a success at its premiere, although some of Purcell's compositions for it (From rosy bow'rs, for instance) have become fairly well known. In 1994, an attempt was made at \"reconstructing\" it, in a version entitled Don Quixote: The Musical. This edition featured much of the play's original music, but used an entirely new libretto (in fairly modern English) written by Taylor, and setting the story as a play within a play, with D'Urfey and others appearing as characters in it. The production starred Paul Scofield as Don Quixote, and Roy Hudd as Sancho Panza.http://www.radiodramareviews.com/id370.html| Don Quixote: The Musical"]}, {"page": "Oliver Cromwell in popular culture", "response": ["*Cromwell was played by Bernard Hepton in the 12-part radio series God's Revolution, which was written by Don Taylor, broadcast on BBC Radio 4 in 1998 and rebroadcast on BBC Radio 7 in 2010."]}, {"page": "Don Taylor (director born 1936)", "response": ["#REDIRECT Don Taylor (English director and playwright)"]}, {"page": "Don Taylor (English director)", "response": ["#REDIRECT Don Taylor (English director and playwright)"]}, {"page": "Don Taylor (British director and playwright)", "response": ["#REDIRECT Don Taylor (English director and playwright)"]}, {"page": "Don Taylor (British director)", "response": ["#REDIRECT Don Taylor (English director and playwright)"]}, {"page": "Theatre Night", "response": ["|Tim Ironside-Wood (p);Don Taylor (d)", "|Louis Marks (p);Don Taylor"]}, {"page": "Deaths in November 2003", "response": ["*Don Taylor, 67, British theatre and television director."]}, {"page": "British Academy Television Award for Best Specialist Factual", "response": ["| Omnibus: Woman from the ShadowsOmnibus: The Confessions of Marian Evans || Don Taylor"]}]}}