{"wiki_id": "http://www.wikidata.org/entity/Q5290479", "itemLabel": "Dominic Brunt", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Dominic_Brunt", "wikipedia_page": {"main": "Dominic Adam Brunt (born 15 April 1970) is an English actor, director and producer, known for portraying the role of Paddy Kirk in the ITV soap opera Emmerdale. For his role as Paddy, Brunt has been nominated in various categories at the British Soap Awards, Inside Soap Awards and the National Television Awards. As well as acting, Brunt also produces and directs horror films alongside Joanne Mitchell; he also co-hosts an annual zombie film festival with Emmerdale co-star Mark Charnock.", "link_mentions": [{"page": "Emmerdale", "response": ["| 7  || Dominic Brunt || Paddy Kirk || 1997–present ( years)"]}, {"page": "Macclesfield", "response": ["* Dominic Brunt (born 1970) actor,IMDb Database retrieved December 2017 played vet Paddy Kirk in ITV's Emmerdale "]}, {"page": "Zoe Tate", "response": ["Zoe sets up a veterinary practice with Paddy Kirk (Dominic Brunt). She is devastated when she discovers Frank has died. She begins dating Sophie Wright (Jane Cameron), the nanny for Frank and Kim's son James Tate (Sam Silson). They break up when Zoe wants to start a family but Sophie does not. Zoe initially resists the married Becky Cairns' (Sarah Neville) advances but later has a fling with her. She later develops a crush on truck driver, Frankie Smith (Madeleine Bowyer). Chris is kidnapped by Liam Hammond (Mark Powley), who reveals he is Frank's illegitimate child. Zoe rescues her brother and shoots Liam dead. Chris and Zoe try to cover up the crime and a jury reaches a verdict of lawful killing. Zoe then gets together with Frankie. Zoe is not happy when Chris moves Charity Dingle into Home Farm and gives her a job as his assistant. However, Charity and Zoe begin an affair, but when Zoe starts exhibiting obsessive behaviour towards Charity, it ends. Zoe starts blackmailing Charity, who confesses the affair to Chris. He chooses Charity over Zoe and she becomes depressed. Zoe then begins talking to her deceased father and she sets fire to the church. During one of her early schizophrenic episodes she ends up having"]}, {"page": "Viv Hope", "response": ["In 1997, Viv unsuccessfully tries to stop Kelly running away with Tom Bainbridge, a teacher whom she has an affair with. Viv blames Terry when Donna collapses after drinking alcopops and moves back into the post office.She also starts a campaign against Andy Hopwood (Kelvin Fletcher) at school and tries to seduce Paddy Kirk (Dominic Brunt), but he rejected Viv's advances."]}, {"page": "Scott Windsor", "response": ["Scott and Dawn reconcile after a short split but Scott is not in love with her and when he learns that Zoe is planning to emigrate and take Jean with her, Scott reacts badly. He is delighted when Zoe asks him to go with them and be there for Jean, and thinks nothing of leaving Dawn but Zoe soon realises that Scott and Viv are plotting to stop them leaving. In revenge, she plots to make Scott think she is in love with him and he believes her, even proposing marriage but she refuses, claiming she would 'rather stick needles in her eyes'. Scott, enraged, attacks Zoe and she stabs him with a syringe full of Ketamine in self-defence and stabs him a second time while he is unconscious. Paddy Kirk (Dominic Brunt) catches Zoe about to complete injecting Scott again and stops her but Scott is left fighting for his life. He makes a full recovery and is determined to get revenge, relishing the chance to take her to court for attempted murder. However, his bullying of Paddy, the only witness, causes the case to collapse and Zoe is acquitted."]}, {"page": "Robert Sugden", "response": ["The character returned to the series on 23 October 2014, and became the show's main antagonist throughout 2015. During that year, Robert had an affair Aaron Livesy (Danny Miller) – which led to the events of Robert killing Katie on the day he married Chrissie White (Louise Marwood); embarking on a feud with Aaron's mother Chas Dingle (Lucy Pargeter) and adopted father Paddy Kirk (Dominic Brunt); getting beat up and blackmailed by Chas' brother Cain (Jeff Hordley); and being shot by Aaron's ex-partner-in-crime Ross Barton (Michael Parr) in the Who Shot Robert Sugden? storyline, in the light of his affair with Aaron and role in Katie's death both getting exposed.", "Paddy Kirk (Dominic Brunt), after finding Robert and Aaron in the portacabin together after they had sex, sends Chrissie a note saying to \"Rein your cheating husband in.\" Later Robert gets drunk and turns on a grain machine and buries Paddy in grain. He goes back and turns it off when he realises that Paddy might die. He hears Andy when attempting to save Paddy and flees, leaving Andy to deal with the situation. As Paddy lies in the hospital, Robert then threatens to harm his son Leo if Paddy says anything. Later, Paddy tells Aaron that Robert tried to kill him which leads to Aaron booking a cabin for him and Robert to try and trick him into confessing about Paddy and Katie on tape. However his plan doesn't work and Robert is soon holding a bound and gagged Aaron at gunpoint after knocking him unconscious with a glass vase. Robert struggles to kill Aaron, and as he's about to pull the trigger, Paddy bursts into the cabin and Robert shoots him in the arm. Robert sews up Paddy's arm after being convinced to do so by both Aaron and Paddy. He releases both of them."]}, {"page": "Emily Kirk", "response": ["When Butch is seriously injured in a bus crash, it soon becomes clear that he is going to die. He and Emily marry at his hospital bed before Butch dies. Alone again, Emily keeps a low profile until she meets Ed Willis (James Midgley). Although her friends think they are well suited, Emily does not feel anything romantic for him. On a night she is supposed to be seeing Ed, Emily has sex with her close friend Paddy Kirk (Dominic Brunt), who had also married into the Dingle family. Paddy and Emily's relationship goes from strength to strength. They get engaged and marry in a surprise wedding after their friends Marlon Dingle (Mark Charnock) and Tricia Dingle (Sheree Murphy) call off their nuptials at the last moment. Emily is desperate for children, so she and Paddy decide to become foster parents. After a couple of false starts, the couple forge a close bond with Debbie Jones (Charley Webb). But when it was revealed that Debbie is Charity (Emma Atkins) and Cain Dingle's (Jeff Hordley) daughter, Emily is bereft. However, she remains close to Debbie and supports her through tough times."]}, {"page": "FairyTale: A True Story", "response": ["The film got its UK premiere in Bradford, the city it was filmed and set in, on the 8th of February 1998. It was shown simultaneously at the Pictureville Cinema (which is based in the National Science and Media Museum), and Bradford Odeon just over the road. The Bradford premiere was attended by the likes of Dominic Brunt (among other Emmerdale stars), politician Gerry Sutcliffe, the lord mayor of Bradford Tony Cairns, Frances Griffiths' daughter Christine Lynch, the films stars Phoebe Nicholls, Tim McInnerny, Florence Hoath, and Elizabeth 'Lizzie' Earl, along with the director Charles Sturridge. The after party was based at the Bradford Alhambra which is situated in between the National Science and Media Museum, and the Bradford Odeon."]}, {"page": "Laurel Thomas", "response": ["Laurel later divorces Ashley and begins a relationship with Marlon, who proposes to her in 2013. When out in town with Rhona Goskirk (Zoe Henry), who is busy looking for painkillers to feed her addiction, Laurel is violently carjacked by Ross Barton (Michael Parr), which leads to Laurel becoming very paranoid and too frightened to leave the house. She becomes obsessed with trying to find her attacker, and when she does, she threatens him with a pair of scissors. Ross attacks her in self-defence, but Marlon arrives before any real damage is done. She is mortified when Ross moves to the village and is revealed to be a relative of Moira Barton's (Natalie J. Robb). She attempts to frame him in order to send him to jail, but Moira calls the police and Laurel is arrested but released without charge. Laurel later feels uncomfortable in early 2014 when Marlon's ex-wife Donna Windsor (Verity Rushworth) returns to the village with his secret four-year-old daughter April (Amelia Flanagan). She is later very sympathetic towards Donna when she discovers that she is dying from terminal mesothelioma, and agrees to act as a mother figure to April after Donna dies. Laurel is concerned by how worried Marlon is by Donna's shocking illness, which leads to many arguments and Laurel moving in with Rhona and Paddy Kirk (Dominic Brunt), but they later reconcile. Donna eventually commits suicide by throwing herself from a multi-storey car park when doing illegal dealings with Ross, and Laurel later discovers that Marlon kissed Donna before she died. Laurel also admits that she drunkenly kissed Ashley when she was drowning her sorrows, and the pair forgive one another. Laurel and Marlon marry in September 2014."]}, {"page": "Cain Dingle", "response": ["It soon transpires that Cain had a incestuous fling with his cousin Charity Dingle (Emma Atkins) back when they were teenagers. He is later outraged when Charity begins dating Chris and attacks her for this, but she marries Chris regardless. Cain's resolve to complicate things in their marriage comes out of coincidence when local residents Paddy (Dominic Brunt) and Emily Kirk (Kate McGregor) foster a preteen schoolgirl, Debbie Jones (Charley Webb), in the village and the trio closely befriend the Dingles. When Cain sees a picture of Debbie's biological mother, he realises that Debbie is his and Charity's daughter. He blackmails Charity, threatening to tell Chris, so Charity tells him and spends time with Cain - eventually rekindling their affair and Chris catches them. Cain and Debbie leave the village but return so he can clear his name and admit his love for Charity; she ends the relationship when she realises she cannot live with him while on bail, due to pregnancy. She moves on to Tom King (Ken Farrington), and they plan to marry. Sadie King (Patsy Kensit), Tom's daughter-in-law, hires Cain to make Tom think Charity has been unfaithful but Charity clears her name and leaves the village. Sadie and Cain end up in bed; when she rejects him, he kills her dog."]}, {"page": "Darren Osborne", "response": ["Dawson was nominated for \"Sexiest Male\" at the 2004 British Soap Awards, for \"Sexiest Male\" and \"Best Villain\" at the 2005 Inside Soap Awards. and for \"Funniest Performance\" in 2007 at the Inside Soap Awards. In 2009, he was nominated for \"Best Actor\" at the British Soap Awards, \"Best Actor\" and \"Funniest Performance\" at the Inside Soap Awards. Dawson was nominated for \"Best Actor\", \"Funniest Performance\" and \"Sexiest Male\" in 2010 for his role as Darren at the Inside Soap Awards. Also in 2010, at the British Soap Awards, Dawson was nominated for the \"Sexiest Male\" award. In 2011 he received a nomination for \"Sexiest Male\" at the British Soap Awards. In 2012 Dawson was again nominated for \"Best Actor\" and for \"Best On-Screen Partnership\" at the British Soap Awards. In 2012 Dawson was nominated for \"Best Actor\" at the 2012 TV Choice Awards. At the 2012 Inside Soap Awards Dawson was nominated for \"Best Actor\" and \"Sexiest Male\". In August 2017, Dawson was longlisted for Funniest Male at the Inside Soap Awards. He made the viewer-voted shortlist, but lost out to Dominic Brunt, who portrays Paddy Kirk in Emmerdale."]}, {"page": "Chris Tate", "response": ["By then, Chris' marriage has grown complicated and his feud with Cain has intensified. This is due to the revelation that Charity had a baby when she was 13 and given it up adoption, after a preteen schoolgirl named Debbie jones (Charley Webb) arrives in the village and claims that Debbie is her daughter. Not only is this true, but Debbie's father is revealed to Cain as well - even though Debbie had been earlier adopted by Butch's wife Emily (Kate McGregor) and her new husband Paddy Kirk (Dominic Brunt) as the child's foster parents. When Chris learns about this, he grows increasingly paranoid with the thought that Charity would cheat on him with Cain and that their parenthood of Debbie would complicate things in the process. Chris soon orders his right-hand man Terry Woods (Billy Hartman) to spy on them. At first Terry realizes Chris' paranoia is getting out of hand, but this later turns up to be true when the pair end up catching Charity giving Cain a passionate kiss."]}, {"page": "Edna Birch", "response": ["Having lived in the village for many years, Edna first appears when she opposes the matching of local vicar Ashley Thomas (John Middleton) and pub landlady Bernice Blackstock (Samantha Giles). Edna is pleased when her teenage granddaughter Eve Birch (Raine Davison) comes to live with her, however, Eve becomes involved in a hit-and-run accident with her boyfriend, Marc Reynolds (Anthony Lewis), which kills her teacher. Eve manipulates Edna into believing Marc is a bad influence and Edna refuses to believe stories of Eve's misbehaviour until her friend Betty Eagleton (Paula Tilbrook) spots Eve kicking Edna's beloved dog Batley (Bracken). Finally seeing her true colours, Edna sends Eve back to live with her father, Peter Birch (Philip Bird), in France. Edna is heartbroken when Batley becomes ill and has to be put down; she struggles with his death. When vet Paddy Kirk (Dominic Brunt) finds a homeless dog, Tootsie (Sky/Dusty), he asks Edna to care for her. Despite her initial reluctance, Edna agrees and she brings happiness into her life.", "Dogs have always been a key aspect to Edna's character. She was originally the owner of a Yorkshire Terrier called Batley, portrayed by Bracken. In February 2002, producers killed off the character as part of \"a heart wrenching story\". Batley's final scene features her placing a paw on Edna's arm as the vet administers a fatal injection. A show spokesperson praised the scenes, commenting, \"it was very moving scene and she gave a stunning performance as Batley.\" Stelfox found the scenes emotional to film and cried for many days afterwards. Writers decided to introduce a new dog for Edna in the form of Papillon Tootsie, portrayed by Sky. After initially being taken in by vet Paddy Kirk (Dominic Brunt) and his wife Emily Kirk (Kate McGregor), Edna decides to take Tootsie in. In one story, Edna risks her own life to protect Tootsie. After noticing a car driven by Sam Dingle heading towards them, Edna interjects and is thrown into a ditch by impact. Tootsie alerts villagers to Edna and she is taken to hospital, where she learns that she has a broken hip. Sky died in 2008, so the role was recast to Dusty. Stelfox expressed her sadness at Sky's death and called her \"a very special dog and a good friend\". The actress opined that Dusty has a \"very different\" personality. In a 2012 interview, Stelfox praised Dusty, calling her \"very sweet\", and said that she was very good at being silent during filming.", "The character's hat attracted attention from fans of the soap. The Liverpool Echo printed a poem on 24 August 2004 written by George Flannery in dedication to the character's hat. In the poem, Flannery described Edna as \"a grumpy mad old bat\". In 2012, three cast members - Dominic Brunt (Paddy Kirk), Tom Lister (Carl King) and Sian Reese-Williams (Gennie Walker) - created a folk rock band with two other friends. The band was named \"Edna's Hat\" in reference to the character's hat."]}, {"page": "The British Soap Awards", "response": ["| \"Best On-Screen Partnership\" || David Neilson & Julie Hesmondhalgh (Roy Cropper & Hayley Patterson in Coronation Street) || Dean Sullivan & Sue Jenkins (Jimmy & Jackie Corkhill in Brookside)Bill Tarmey & Liz Dawn (Jack & Vera Duckworth in Coronation Street)Dominic Brunt & Lisa Riley (Paddy Kirk & Mandy Dingle in Emmerdale)", "| \"Best Comedy Performance\" || Nina Wadia (Zainab Masood in EastEnders) || Simon Gregson (Steve McDonald in Coronation Street)Dominic Brunt (Paddy Kirk in Emmerdale)Hollie-Jay Bowes (Michaela McQueen in Hollyoaks)", "| \"Best On-Screen Partnership\"Presented by Katie Price and Peter Andre|| Nitin Ganatra & Nina Wadia (Masood Ahmed & Zainab Masood in EastEnders) || Simon Gregson & Katherine Kelly (Steve McDonald & Becky Granger in Coronation Street)Mark Charnock & Dominic Brunt (Marlon Dingle & Paddy Kirk in Emmerdale)Nico Mirallegro & Marc Silcock (Barry \"Newt\" Newton & Eli in Hollyoaks)", "| \"Best Comedy Performance\" || Craig Gazey (Graeme Proctor in Coronation Street) || Nina Wadia (Zainab Masood in EastEnders)Dominic Brunt (Paddy Kirk in Emmerdale)Bronagh Waugh (Cheryl Brady in Hollyoaks)", "| \"Best Comedy Performance\"Presented by Tommy Cannon and Bobby Ball|| Patti Clare (Mary Taylor in Coronation Street) || Ian Kelsey (Howard Bellamy in Doctors)Ricky Norwood (Fatboy in EastEnders)Dominic Brunt (Paddy Kirk in Emmerdale)Nicole Barber-Lane (Myra McQueen in Hollyoaks)", "| \"Best Comedy Performance\"Presented by Rebecca Front|| Dolly-Rose Campbell (Gemma Winter in Coronation Street) || Elisabeth Dermot Walsh (Zara Carmichael in Doctors)Tameka Empson (Kim Fox-Hubbard in EastEnders)Dominic Brunt (Paddy Kirk in Emmerdale)Nicole Barber-Lane (Myra McQueen in Hollyoaks)", "| \"Best On-Screen Partnership\"Presented by Mark Curry and Yvette Fielding||Roger Griffiths & Kara-Leah Fernandes (Mitch & Bailey Baker in EastEnders) ||Simon Gregson & Kate Ford (Steve & Tracy McDonald in Coronation Street)Ian Midlane & Adrian Lewis Morgan (Al Haskey & Jimmi Clay in Doctors)Dominic Brunt & Lucy Pargeter (Paddy Kirk & Chas Dingle in Emmerdale)Nick Pickard & Alex Fletcher (Tony & Diane Hutchinson in Hollyoaks)", "| \"Best Male Dramatic Performance\"Presented by Ashley Walters|| Adam Woodward (Brody Hudson in Hollyoaks) ||Rob Mallard (Daniel Osbourne in Coronation Street)Ian Midlane (Al Haskey in Doctors)Zack Morris (Keegan Baker in EastEnders)Dominic Brunt (Paddy Kirk in Emmerdale)"]}, {"page": "Debbie Dingle", "response": ["She was introduced as the foster child of Paddy Kirk (Dominic Brunt) and Emily Kirk (Kate McGregor) before being revealed as the daughter of Charity Dingle (Emma Atkins) and Cain Dingle (Jeff Hordley). She has featured in many storylines on Emmerdale including  her relationships with Andy Sugden (Kelvin Fletcher), which lead to her pregnancy at 15, Jasmine Thomas (Jenna Louise Coleman) and Scott Windsor (Ben Freeman), her daughter Sarah being diagnosed with a blood disorder, her disastrous relationship with Cameron Murray (Carl King's, Gennie Walker's and Alex Moss's real killer) (Dominic Power), which sparked the 2013 week of episodes known as \"The Woolpack Siege,\"; a relationship with Pete (Anthony Quinlan), who she later marries and her affair with Ross (Michael Parr), a relationship with Tom Waterhouse later revealed as Joe Tate (Ned Porteous) and being conned by him but later forgiving him and getting back together, accidentally having Ross as the victim of an acid attack, learning Sarah suffers from heart failure and needs a transplant, and dealing with the false revelation that Cain killed Joe (although it was later revealed that he is alive).", "Upon arriving in Emmerdale in December 2002, Debbie was fostered by Paddy (Dominic Brunt) and Emily Kirk (Kate McGregor). When Debbie shows Sam Dingle (James Hooton) a photograph of her biological mother, he recognizes the young woman as his cousin, Charity Dingle (Emma Atkins). They eventually meet and she gets close to her stepfather, Chris Tate (Peter Amory), but after meeting her biological father, Cain Dingle (Jeff Hordley), the trio become a family and Chris is sidelined. This affects him extremely, resulting in him cancelling plans to adopt Debbie."]}, {"page": "Lucy Pargeter", "response": ["In June 2019, Pargeter won the Best Actress award at The British Soap Awards; she was also nominated for Best Female Dramatic Performance and Best On-Screen Partnership, alongside Dominic Brunt."]}, {"page": "Bait", "response": ["* Bait, a 2014 British film directed by Dominic Brunt"]}, {"page": "Chas Dingle", "response": ["Chas' main storylines have focused on her turbulent relationship with Carl King (Tom Lister), becoming a prime suspect in the murder of Tom King (Ken Farrington), discovering she has a half-sister Gennie Walker (Sian Reese-Williams), rebuilding a relationship with her son Aaron Dingle (Danny Miller) who she abandoned as a child, her relationship with Paddy Kirk (Dominic Brunt), disputing with her niece Debbie Dingle (Charley Webb) after having an affair with Debbie's ex-partner Cameron Murray (Dominic Power), her grief over the loss of her father Shadrach Dingle (Andy Devine), sister Gennie and best friend Katie Sugden (Sammy Winward), developing PTSD, discovering her son's childhood abuse at the hands of his father Gordon Livesy (Gary Mavers), discovering she is pregnant with Paddy's child who won't survive birth and becoming pregnant again with their second daughter, Eve.", "Chas also develops a relationship with her half-sister, Gennie Walker (Sian Reese-Williams). Laurel Thomas (Charlotte Bellamy) tells her that Shadrach put Gennie up for adoption after her mother died in childbirth, believing he couldn't bring her home to his wife, Faith. After coming to terms with this, she helps her father write to Gennie and feels neglected when Shadrach seems obsessed with his new daughter. Chas and Gennie become friends and Chas advises Gennie on how to care for her mother. Chas also manages to rebuild her relationship with her son, Aaron (now Danny Miller). She discovers his whereabouts, with help from her cousin Marlon's wife, Donna (Verity Rushworth), who has arrested Aaron for drug offences. Initially he is not pleased to see her but after the Dingles rescue him from the McFarlanes, he moves in with them. Aaron is pleased when Chas stands up for him when Lisa (Jane Cox) throws him out for encouraging Belle Dingle (Eden Taylor-Draper) to steal, so they move in with Paddy Kirk (Dominic Brunt). Initially, Chas enrolls him at the local school but he refuses to go and starts work at the garage with Cain Dingle (Jeff Hordley) and Debbie Dingle (Charley Webb).", "In late 2017, producers reunited Chas and Paddy Kirk (Dominic Brunt). A few months later, Chas discovers she is pregnant. Laura Morgan of Digital Spy observed, \"It's obvious why the Emmerdale writers love these two together – they have a strong bond, a shared history, and are first and foremost best mates who are not afraid to take the mickey out of each other. We've watched them co-parent Aaron over the years, but to see them have a biological child would be a whole new world.\" Chas initially decides to have an abortion, but she changes her mind while she is at the clinic and tells Paddy that she wants to be a mother again."]}, {"page": "Paul Lambert (Emmerdale)", "response": ["Paul returns again in March 2015 after Val is hospitalised after collapsing, whilst suffering from HIV. Paul is shocked by his mother's condition and sits at her bedside whilst she is in a coma and begs her to recover. He is also introduced to Val's employee Finn Barton (Joe Gill). When a doctor tells Val's family to prepare for the worst, Paul is devastated. Val wakes from her coma and Paul is relieved that his mother is OK. Paul notices that Finn is attracted to one of the hospital nurses, Darren Thompson (Danny Horn). He then goes to the village and visits his half-sister and cousin Bernice Blackstock (Samantha Giles) at her Beauty Salon and she shows him round her premises. He also is introduced to Val's other employee Tracy Shankley (Amy Walsh) when she asks Val's husband Eric Pollard (Chris Chittell) for a place to stay. Paul also visits Marlon (Mark Charnock) and Laurel Dingle (Charlotte Bellamy). He helps Laurel prepare for a job interview with Bernice and tells her that he would like to stay for longer but has things to sort out back home. Paul goes for drinks in the pub with Jimmy, Paddy Kirk (Dominic Brunt) and Chas Dingle (Lucy Pargeter) and promises to keep in touch and asks for updates on Val's recovery. He also says goodbye to Bernice then leaves."]}, {"page": "Carl King", "response": ["Carl has an on and off relationship with Chas Dingle (Lucy Pargeter). Carl and Chas end their relationship. Lister explained that Carl never stopped loving Chas but the relationship ended when \"that door was basically slammed in his face when Chas's son Aaron fell into the mix and gave his mum an ultimatum – him or Carl. So Chas chose her son\". Pargeter explained that Chas could not reunite with Carl while Aaron Livesy (Danny Miller) is around due to his ultimatum. Chas begins a relationship with Paddy Kirk (Dominic Brunt). Pargeter said that Chas loves Paddy as a friend and she could not \"love anybody the way she loved – or still loves – Carl, really\". She added that Chas has \"never moved on because there was never closure\" in the relationship. Carl begins a relationship with Lexi Nicholls (Sally Oliver). Lister said that Lexi proposes as she knows \"there's something there between Carl and Chas and Lexi's envious of that. Obviously Lexi knows that Carl killed his father, but she doesn't know that Chas was the reason. Lexi decides to go all-guns blazing and propose. I think rather than being backed into a corner, part of Carl thinks that if Chas has knocked him back, he'll try and do right by Lexi\". Lister told Kris Green of Digital Spy that Carl enters the relationship with the best intentions instead of \"wishing he was with Chas all the time\" who will always be in the \"background\". The actor said that viewers would be unsure whether Carl would go through with the wedding to Lexi or whether Carl would instead reunite with Chas. On his wedding day to Lexi, Carl tells Chas that he can not marry Lexi because he still loves her. Pargeter explained that \"Chas is completely screwed up by the revelation\" and is \"desperate to get things back on track with Carl, but she's got Aaron to contend with. So Carl pours his heart out and she has to be as strong as she can\". When Chas rejects Carl he marries Lexi but the marriage soon after ends when Carl admits he does not love Lexi.", "Nicola insists Carl move out of Mill Cottage and he reconciles with Chas again after telling her partner, Paddy Kirk (Dominic Brunt), about their affair. They are happy together for a while but, now getting bored, Carl begins an affair with Eve Jenson (Suzanne Shaw). Chas proposes to him and implies she is pregnant. Carl accepts and gives her money for the wedding and ends things with Eve but on the day, Chas reveals Carl's affair with Eve to the village and jilts him. Carl becomes bitter towards Chas for stealing his money and is accused of starting a fire near her house, which engulfs the village and kills Terry Woods (Billy Hartman) and Viv Hope (Deena Payne). Carl is arrested but later freed. He and Chas have a one-night stand months later and he comforts her when her son, Aaron Livesy (Danny Miller), is charged with murder. Carl borrows money from Scarlett to hire a lawyer for Aaron but when Aaron refuses to take it, invests it in his business instead. Disgusted, Scarlett discovers what he has done and leaves the village."]}, {"page": "Marlon Dingle", "response": ["Marlon comes to Emmerdale to stay with his uncle Zak Dingle (Steve Halliwell). He tells his family that he has heard about the new road development and hoped there would be some work going. His cousin Butch Dingle (Paul Loughran) offers to put in a good word with the local security firm. Marlon supports Zak when he is diagnosed with testicular cancer and he befriends Paddy Kirk (Dominic Brunt). Marlon finds employment as a chef at Kathy Glover's (Malandra Burrows) tea rooms and wine bar. When co-owner Eric Pollard's (Chris Chittell) marriage ends, he puts Marlon in charge of his business. Marlon is initially overwhelmed by the responsibility. Kathy later hires Carlos Diaz (Gary Turner) to work at the diner and Marlon goes to work at The Woolpack. Bernice Blackstock (Samantha Giles) is impressed by Marlon's cooking and they share a kiss, but it leads nowhere. New barmaid Tricia Stokes (Sheree Murphy) regularly flirts with Marlon and they soon begin dating."]}, {"page": "Paddy Kirk", "response": ["Paddy Dingle (also Kirk) is a fictional character from the British soap opera Emmerdale, played by Dominic Brunt. He has been married four times: to Mandy Dingle (Lisa Riley) in 1999, to Emily Dingle (Kate McGregor) in 2002, to Rhona Goskirk (Zoe Henry) in 2012 and to Chas Dingle (Lucy Pargeter) in 2020. He has also had several affairs since arriving, notably with Viv Hope (Deena Payne) and Tess Harris (Nicola Stephenson). His other storylines in the series have included discovering his biological father and dealing with the loss of his child. He also went on to marry Chas Dingle."]}, {"page": "Dawn Woods", "response": ["Dawn then begins a relationship with Scott Windsor (Ben Freeman). They start seeing each other just before she divorces Terry and the only person Dawn tells is Bob, who disapproves due to him being married to Scott's mother Viv Hope (Deena Payne). Scott and Dawn move in together but Dawn is devastated and angry when Scott leaves her to flee to America with Zoe Tate (Leah Bracknell), the mother of his daughter, Jean Tate (Megan Pearson). Scott had kept it a secret from everyone and sends Dawn a letter in the post explaining that as she was his step-sister, and if their relationship went further, people would think it was weird, and he had \"convinced\" himself not to love her, and he was leaving with Zoe to be with his daughter in Home Farm, not wanting stay with her and TJ while Zoe left with Jean. Dawn then goes to Spain to stay with her mother because she could not bear to see Scott and Zoe. Dawn ignores Bob's telephone calls, unaware that he is contacting her to inform her that Scott was in critical condition in hospital after being injected with ketamine after attempting to rape Zoe. Viv's daughter Donna Windsor (Verity Rushworth) finally manages to get through to Bob in hospital, and he tells her about Dawn's letter from Scott. The letter was then discovered by Viv, and Dawn flies back from Spain just in time for Scott to wake up. Although Dawn initially forgives him, when Paddy Kirk (Dominic Brunt) drops out as a witness against Zoe at her trial, Dawn discovers that Scott had been blackmailing and threatening Paddy, and as a result Zoe is found not guilty of attempted murder. Scott then attacks Paddy and while Dawn and Marlon Dingle (Mark Charnock) try to break up the fight, he punches her by mistake. A shaken Dawn locks herself in her house with T.J and calls the police. Scott is arrested for assault, and he tries to claim he was provoked by Paddy but is shocked to discover that the assault charges were for hurting Dawn. Dawn has seen Scott's true colours, and finally realizes he is capable of what Zoe claimed he had done, and Dawn ends their relationship for good as she is scared he would rape her. While Scott was serves a prison sentence for the assault, Dawn dates Danny Daggert (Cleveland Campbell), but breaks up with him after she realizes she isn't ready to settle down. After his release, Scott takes revenge on Dawn for rejecting him by reporting her for benefit fraud. Dawn had been taking odd jobs to better support T.J and is officially charged and serves three weeks of a six-week prison sentence."]}, {"page": "Jo Stiles", "response": ["Jo also attempts to help her recently separated boss, Paddy Kirk (Dominic Brunt) find someone by inventing a chatroom girlfriend for him called Fireblade. Paddy books a ticket to Portugal to track down Fireblade. When Paddy returns with Toni (Kerry Stacey), Danny's cousin, Jo knows she is not Fireblade and becomes desperate to stop Toni taking Paddy for a ride. Paddy and Toni soon reveal that they were winding her up as payback."]}, {"page": "Toni Daggert", "response": ["Toni meets Paddy Kirk (Dominic Brunt) while on holiday  in Portugal and agrees to return to Emmerdale with him and pretend to be his internet girlfriend, Fireblade. The whole scheme is designed to upset Paddy’s receptionist Jo Stiles (Roxanne Pallett) who had invented the sexy stranger to boost Paddy’s confidence. After the joke was plays out, Toni revealed herself to be the fun-loving cousin of local boy Danny Daggert and settled into life in the village and takes a job in the Woolpack after impressing landlady  Diane Sugden (Elizabeth Estensen) and got a job behind the bar. She has a one-night stand with Ivan Jones (Daniel Brocklebank) much to Nicola Blackstock's (Nicola Wheeler) fury. Toni sets her sights on Paddy's business partner Hari Prasad (John Nayagam) and flirts with him, hoping for a date. Toni is oblivious to Paddy's feelings for her and when he confesses she accuses him of trying to ruin her chances with Hari. Things are awkward for a while but she and Paddy come through it."]}, {"page": "Celebrities Under Pressure", "response": ["*Show 2 - Dominic Brunt, Jennie McAlpine, Barry McGuigan"]}, {"page": "Hari Prasad", "response": ["In November 2005, an Inside Soap columnist reported that John Nayagam had joined the cast as vet Hari Prasad. Producer Kathleen Beedles said the character would be popular with the ladies of the village, and praised Nayagam for being \"a wonderfully charismatic actor\". Hari was introduced as an old university friend of Paddy Kirk's (Dominic Brunt), who buys into his veterinary practice to save it from going under. A writer from What's on TV described Hari as a \"slippery vet\" and \"a real charmer and would like to be a millionaire playboy but his current wage packet frustrates his ambitions\"."]}, {"page": "Charity Dingle", "response": ["Chris and Charity eventually realise that Zoe is ill and she has to be sectioned. While in hospital, she is diagnosed with schizophrenia. Charity supports Zoe when she realizes she is pregnant and considers giving the baby up for adoption, revealing she had a baby girl that she put up for adoption. Charity is shocked when Paddy (Dominic Brunt) and Emily Kirk's (Kate McGregor) foster daughter, Debbie Jones (Charley Webb), realises that Charity is her birth mother. Charity initially refuses contact with Debbie but comforts her when her mother dies. Despite her reserve, she and Debbie bond so Charity files for custody and wins, much to Paddy and Emily's dismay. Charity is delighted when Chris and Debbie bond and he suggests adopting her. Cain later realizes that he is Debbie's father and bonds with his daughter, leading him and Charity to begin an affair. Chris sees them and throws her out. A month later, Charity goes to Home Farm to discuss her marriage, hoping they will reconcile. However, Chris knows that he has an inoperable brain tumour and frames Charity for his murder, before committing suicide. The police arrest Charity after finding her fingerprints on Chris's glass and her signature on an order for poison. She and Cain blame each other so Charity is released on bail when she learns that she is pregnant and moves in with Marlon. After getting drunk, they sleep together. Charity realises Zoe knows that Chris killed himself and kisses her but Zoe testifies that Charity killed Chris so Charity is found guilty and sentenced to life imprisonment. While in prison, she gives birth to a son who she names Noah (Alfie Mortimer). Unsure of Noah's paternity, she arranges for Zoe, Cain and Marlon to do a DNA test and the results show that Chris is Noah's father. Charity strikes a deal with Zoe - she can have custody of Noah in return for £20,000 and evidence that Chris committed suicide. Zoe agrees and Charity is released. Zoe refuses to allow Charity any contact with Noah, who she calls Christopher, and plans to adopt him but permission is refused, due to already having 2 children (Chris's eldest son, Joseph (Oliver Young), and her daughter, Jean (Megan Pearson), running Home Farm and her mental health issues. Social Services ask Charity to decide if she wants to raise him or put him up for adoption elsewhere. She chooses to raise him and Zoe returns him to Charity."]}, {"page": "Cottingley, Bradford", "response": ["*Dominic Brunt – lived in the house of the Cottingley Fairy hoax in the early 2000s"]}, {"page": "Belle Dingle", "response": ["Belle is born on Christmas Day 1998 to Zak (Steve Halliwell) and Lisa Dingle (Jane Cox). Lisa is unaware that she is pregnant until she goes into labour and local vet Paddy Kirk (Dominic Brunt) delivers Belle. When Belle is seven years old, she goes missing after she is left at home under the care of her uncle Shadrach Dingle (Andy Devine), who has fallen asleep. Daz Eden (Luke Tittensor) visits, bringing his pet ferret Spike. Although being warned not to, Belle lets the ferret out of his cage and in a panic, chases him through the fields. As she pursues him, she falls down a mine shaft. Daz is forced to leave the house, and when he finds her, dives in to help her out, but discovers that they are trapped, with the risk of freezing or drowning in the water. Daz manages to keep Belle afloat, until they are eventually rescued by the Dingles and the fire brigade. Belle acts as ring bearer at her cousin Marlon Dingle's (Mark Charnock) wedding to Donna Windsor (Verity Rushworth) and she briefly moves in with Marlon shortly after."]}, {"page": "Aaron Livesy", "response": ["Aaron clashes with Victoria Sugden (Isabel Hodgins) but they eventually become friends and Aaron helps rescue her when she falls into a frozen lake. Aaron convinces his cousin, Belle Dingle (Eden Taylor-Draper), to take the day off school and is also caught stealing so Lisa (Jane Cox) throws him out. Consequently, he and Chas move into Smithy Cottage with Paddy Kirk (Dominic Brunt) and Chas gives him the choice of going to college or getting a job so he gets a job at Cain's garage. Aaron begins dating Victoria and loses his virginity to her but they break up when he discovers her relationship with her foster brother, Daz Eden.  When Aaron ignites a bale of hay at the Bartons' farm Holly's father, John (James Thornton), hits him and locks him in a stable. Aaron reports John to the police but later drops the charges.", "A high-profile storyline for the character was when he began to question his sexual orientation. As the storyline progressed, Aaron was seen struggling to come to terms with his sexuality, before admitting the truth to his friend and guardian Paddy Kirk (Dominic Brunt). Miller admits that he was apprehensive when the Emmerdale writers approached him and told him they were making Aaron gay. Miller said \"Being a straight actor and having to kiss another lad, I'm not going to lie, I was a bit worried about it, because it's a great test of your acting skills.\"", "Miller's co-star, Dominic Brunt has praised the storyline and told Media and Entertainment website, Digital Spy, that \"It's done more realistically than I've seen in a soap.\" He went on to describe Aaron as being a homophobic homosexual, who doesn't like what he is. Miller has stated that he is enjoying the challenge presented by the storyline saying \"It's definitely been a big challenge – I feel a big responsibility to get this right and portray it in a way that makes it real, because there are so many lads who are going through what Aaron is going through\". Miller's co-star James Sutton, who previously played a gay character in Hollyoaks, has said that Miller did not need any advice for the role and said, \"We've chatted but I've given him no advice – he's a great actor, he doesn't need me to give him any pointers\"."]}, {"page": "Nicola King", "response": ["Nicola undergoes a personality change and falls out with Emily but they reconcile. She seduces   Robert Sugden (Karl Davies) much to the annoyance of the village due to Robert's age. Nicola is bridesmaid when Emily marries Paddy Kirk (Dominic Brunt) in October 2002. Nicola frequently clashes with Viv Hope (Deena Payne), and local siren Chloe Atkinson (Amy Nuttall). She dumps Robert by allowing him to see her having sex with builder Syd Woolfe (Nathan Gladwell) in her living room. Nicola's relationship with Syd comes to a halt when she finds out he is also having an affair with Chloe who is dating  Scott Windsor (Ben Freeman).."]}, {"page": "Mandy Dingle", "response": ["Mandy comes to Emmerdale for her cousin Tina Dingle's (Jacqueline Pirie) wedding to Luke McAllister (Noah Huntley). She later returns to live with her uncle Zak Dingle (Steve Halliwell), having been disowned by her father, Caleb (Mike Kelly). She finds work as a barmaid at The Woolpack, where her feisty personality makes her an instant hit with the locals. Mandy is initially very promiscuous but the arrival of vet Paddy Kirk (Dominic Brunt) proves to be a turning point in Mandy's life. She falls in love with Paddy and is willing to settle down and get married, but their romance suffers problems. Mandy's cousin Butch Dingle (Paul Loughran) overhears Paddy ridiculing their family and he tells Mandy, who orders Paddy out of her house. Paddy leaves for Ireland where he has a job and returns to the village the following month. He and Mandy reconcile after he apologises to her family.", "Mandy returns during the episode broadcast on 4 January 2019. She arrives unexpectedly for her cousin Marlon Dingle's (Mark Charnock) wedding to Jessie Grant (Sandra Marvin). Her former husband Paddy Kirk (Dominic Brunt) is \"uncomfortable by her presence\" when she acts as a witness alongside him. Paddy's partner Chas Dingle (Lucy Pargeter) later fights with Mandy outside the church. Riley commented that once she learned that a stunt coordinator would be involved, she knew that Mandy was back. The actress also explained where Mandy has been, saying \"She's been living in Southampton for the past 17 years with her son – who's called Vinny (Bradley Johnson) – and she's been very happy. She's got a bit of money now, and she isn't as downtrodden as she once was. But she's not been invited to the wedding!\" On 10 July 2019, it was announced that Riley would be returning once again on a permanent basis, and Mandy reappeared on 12 September 2019. Riley described it as \"amazing, absolutely wonderful\" to be back filming for Emmerdale, and that she is \"loving every second\". She also confirmed that she wants to stay on the soap for a long tenure. Riley stated that Mandy needs \"a good old-fashioned job in the village\", opining that employment would be good for her character. She also stated that Mandy should apologise to and thank her family."]}, {"page": "Mark Charnock", "response": ["Mark Charnock (born 28 August 1968) is an English actor, known for his role in ITV's Emmerdale as Marlon Dingle, a role he has played since 1996.  Charnock and Emmerdale co-star Dominic Brunt produce a yearly Zombie Film Festival in the Leeds Cottage road cinema theatre.", "Charnock was born on 28 August 1968, and was educated at Canon Slade School, Hull University and Webber Douglas Academy of Dramatic Art. With fellow Emmerdale co-star Dominic Brunt, he hosted Leeds' first ever zombie festival on 20 April 2008."]}, {"page": "Rhona Goskirk", "response": ["Rhona Goskirk is a fictional character from the British ITV soap opera Emmerdale, played by Zoë Henry. She made her first screen appearance during the episode broadcast on 17 September 2001. The character was introduced by series producer Steve Frost and appeared initially in 2001 and 2002. She returned to Emmerdale as a full-time character on 31 March 2010, reintroduced by series producer Gavin Blyth. She has been through a diverse range of storylines, including a romantic bond with comedic chef Marlon Dingle (Mark Charnock); giving birth to their son Leo Goskirk, who has Down Syndrome; marrying Paddy Kirk (Dominic Brunt); becoming addicted to painkillers, discovering Paddy's affair with her friend Tess Harris (Nicola Stephenson) after Tess' death; pursuing a manipulative relationship with Tess's widower Pierce Harris (Jonathan Wrather), her near-death in the soap's biggest stunt known as \"No Return Week\", marital rape at the hands of Pierce; becoming infertile after a farming accident; and bringing Pierce to justice for killing her boyfriend Graham Foster (Andrew Scarborough) amid feuding with Graham's estranged boss and ex-wife Kim Tate (Claire King).", "Rhona first appeared in the village in September 2001 as a locum, helping Paddy Kirk (Dominic Brunt) and covering for Zoe Tate (Leah Bracknell), whilst she was on holiday. She begins dating with local chef Marlon Dingle (Mark Charnock) in light of his ex-girlfriend, Tricia Fisher (Sheree Murphy), departing the village after their relationship had ended. However, Tricia soon reappeared and Rhona left not long after. Rhona returned in June 2002 to cover for Zoe as she was incapable of work, due to mental illness. She and Marlon soon resumed their relationship and realized they had several shared interests, including Laurel and Hardy films and design. When Tricia found out, she was very upset but Rhona left again in December."]}, {"page": "Inside Soap Awards", "response": ["| Dominic Brunt (Paddy Kirk in Emmerdale)", "| Joe Duttine (Tim Metcalfe in Coronation Street)Dominic Brunt (Paddy Kirk in Emmerdale)Ashley Taylor Dawson (Darren Osborne in Hollyoaks)", "| Dominic Brunt and Lucy Pargeter (Paddy Kirk and Chas Dingle in Emmerdale)", "| Rob Mallard (Daniel Osbourne, Coronation Street)Simon Gregson (Steve McDonald, Coronation Street)James Bye (Martin Fowler, EastEnders)Zack Morris (Keegan Butcher-Baker, EastEnders)Dominic Brunt (Paddy Kirk, Emmerdale)Mark Charnock (Marlon Dingle, Emmerdale)Imran Adams (Mitchell Deveraux, Hollyoaks)Nick Pickard (Tony Hutchinson, Hollyoaks)", "| Patti Clare (Mary Taylor, Coronation Street)Ricky Champ (Stuart Highway, EastEnders)Dominic Brunt (Paddy Kirk, Emmerdale)Lysette Anthony (Marnie Nightingale, Hollyoaks)", "| Sam Aston and Dolly-Rose Campbell (Chesney Brown and Gemma Winter, Coronation Street)Dominic Brunt and Lucy Pargeter (Paddy Kirk and Chas Dingle, Emmerdale)Imran Adams and Ross Adams (Mitchell Deveraux and Scott Drinkwell, Hollyoaks)"]}, {"page": "Skin (1995 film)", "response": ["*  Dominic Brunt as Martin"]}, {"page": "Soapstar Superchef", "response": ["|Dominic Brunt, Mark Charnock"]}, {"page": "Accrington Academy", "response": ["Dominic Brunt, actor, known for his part in Emmerdale as Paddy Kirk."]}, {"page": "Brunt", "response": ["*Dominic Brunt, English actor"]}, {"page": "Bob Hope (Emmerdale)", "response": ["As part of his job as a sales representative for Naughty Nylons, Bob comes to Emmerdale for business. He and Viv Windsor are immediately attracted to each other and they begin a relationship. Bob moves in with Viv and tries to make friends with her daughter Donna Windsor (Verity Rushworth). He proposes while drunk and he and Viv marry the following year. Bob's daughter Dawn moves to the village and gets engaged to his friend, Terry Woods (Billy Hartman), who is 27 years older than her. They later have a son T.J. Woods (Connor Lee). Viv and Bob separate, after Viv has a one-night stand with a limousine driver, but in the same year they reconcile after her affair with married Paddy Kirk (Dominic Brunt), and they become engaged again. Bob is reunited with his former and ex-wife, American exotic dancer Vonda Lockhart (Lorelei King) and learns he has a daughter Roxy Lockhart (Chloe Procter), after Viv tracks her down to invite her to their second wedding. Bob and Viv marry in a double wedding with Viv's daughter Donna and Marlon Dingle."]}, {"page": "Ross Kirk", "response": ["Ross Kirk is a fictional character from the British ITV soap opera, Emmerdale, played by Samuel Anderson. He appeared from 2007 to 2009. A cousin of Paddy Kirk (Dominic Brunt), Ross is a police officer and during his 15 months in the village he has an affair with Donna Windsor-Dingle (Verity Rushworth), and after being convicted of murder is imprisoned. After his release, he leaves the village."]}, {"page": "Gennie Walker", "response": ["Her main storylines have focused on getting to know her family, the Dingles, which includes her birth father Shadrach Dingle (Andy Devine), developing unrequited feelings for Paddy Kirk (Dominic Brunt) and Bob Hope (Tony Audenshaw), her relationship with Jamie Hope (Alex Carter), her relationship and subsequent marriage to Nikhil Sharma (Rik Makarem) and being murdered by Cameron Murray (Dominic Power) after being involved in a car accident with him and Debbie Dingle (Charley Webb).", "Gennie is accidentally knocked off her motorbike by Ross Kirk (Samuel Anderson) while on her way to meet her biological father Shadrach Dingle (Andy Devine). She recovers in hospital and becomes friends with Ross and his cousin Paddy (Dominic Brunt), when they visit her in hospital. Paddy invites her to Eli Dingle's (Joseph Gilgun) 28th birthday party, and while she is there, Gennie meets Shadrach and realises that she has found her father and she later reluctantly talks to Shadrach. He tells how he started looking for her after his godson Daniel Thomas died of sudden infant death syndrome. Shadrach had planned to leave his wife for Gennie's mother, Shirley Pascoe, but she died in childbirth. Feeling unable to take her home, he gave her up for adoption."]}, {"page": "List of longest-serving soap opera actors", "response": ["|Dominic Brunt || Paddy Dingle || Emmerdale || 1997– ||  years ||"]}]}}