{"wiki_id": "http://www.wikidata.org/entity/Q529281", "itemLabel": "Pete Trewavas", "itemDescription": "British rock musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Pete_Trewavas", "wikipedia_page": {"main": "Peter Trewavas (born 15 January 1959, Middlesbrough, North Yorkshire, England) is an English musician, known as the bassist of Marillion. He joined in 1982, replacing Diz Minnitt, while acting occasionally as a backing vocalist and acoustic guitarist.\nAlthough he was born in Middlesbrough, Trewavas spent much of his childhood in the Buckinghamshire town of Aylesbury. It was in Aylesbury that he became involved in several bands, having most success with The Metros, before taking up his long term role in Marillion.\nAlthough still a full member of Marillion, Trewavas is also a member of the progressive rock supergroup Transatlantic. In 2004, Trewavas co-founded another group called Kino, with John Mitchell (Arena), John Beck (It Bites) and Chris Maitland (ex-Porcupine Tree).\nIn 2011, Pete Trewavas joined up with his longtime friend Eric Blackwood to form the duo Edison's Children. The new project was designed to be a creative outlet for Pete Trewavas (who has traditionally recorded in a \"band\" or \"group\" format on bass and acoustic guitar), in which he could also play lead guitar, lead vocals, drum programming and keyboards as well as have full creative control over the writing and producing of the record with. The 72-minute concept album In The Last Waking Moments... about a man fighting to understand if a recent bizarre happening was reality or a descent into madness, was released on 11.11.11.The Edison's Children project would result in the release of the single \"A Million Miles Away (I Wish I Had A Time Machine)\". The song debuted on American Commercial Radio in June 2012 and by September it had reached the FMQB U.S. Commercial Radio Top 40 where it remained for 10 weeks (and stayed in the top 100 for 25 weeks) peaking at No. 32.Edison's Children did live performances in Montreal, Wolverhampton England and Port Zelande Netherlands opening up for Marillion's \"Brave\" performances during the Marillion 2013 Weekend. The Montreal show was recorded and released as a B-Side on their \"In the Last Waking Moments...\"-EP Single. The UK show was released on their latest album \"Somewhere Between Here and There\".\nEdison's Children released their second album, The Final Breath Before November, on 13 December 2013. It was mixed by Jakko Jakszyk, lead singer of King Crimson, John Mitchell, lead guitarist of It Bites, and Arena and Robin Boult, lead guitarist of Fish. The album featured Eric Blackwood on lead vocals and guitar and composition again along with Henry Rogers of DeeExpus and Touchstone. Pete Trewavas co-wrote and produced the album with Eric Blackwood and played lead guitar and lead vocals on many of tracks along with bass and programming for the symphonic orchestration.\nEdison's Children is expecting their third album \"Somewhere Between Here and There\", a \"bridge album\" containing 7 new songs and 6 original mixes from The Final Breath Before November by King Crimson's Jakko Jakszyk and John Mitchell, along with the live version of A Million Miles Away from Wolves UK to be released in June 2015. Work has already begun on a 4th epic album which is expected to be much \"harder\" than the more symphonic The Final Breath Before November.\nOn 17 September 2012, during a Marillion concert at The Junction in Cambridge, Steve Hogarth announced that Trewavas was now called \"Sweet Pea Tremendous\" as it was the result of putting his name into an anagram solver.\nTrewavas has also appeared in Prog Aid, the charity project set up to raise money for victims of the 2004 tsunami.\nTrewavas was a guest musician on English progressive rock band Big Big Train's 2007 album, The Difference Machine.\nThough primarily a bassist, Trewavas has been known to write keyboard parts during his time with Transatlantic, and has played acoustic guitar on Marillion songs, particularly \"Faith\" and \"Now She'll Never Know\". With Edison's Children however, Trewavas commonly plays lead guitar, lead vocals, symphonic orchestral programming, guitar synthesizer, drum programming and several middle-eastern instrumentation.\nOn 11 January 1999 Trewavas was hit by a car when cycling home from the studio Racket Club. He suffered multiple injuries and spent time in intensive care, and underwent surgery in his leg.Trewavas is a fan of the Football team Manchester United F.C.", "link_mentions": [{"page": "January 15", "response": ["*  1959   – Pete Trewavas, English bass player and songwriter"]}, {"page": "Marillion", "response": ["After the split, the band found Steve Hogarth, the former keyboardist and vocalist of The Europeans and the duo How We Live. Hogarth first stepped into Pete Trewavas garage 24 January 1989 and got the job three months later on April 25,Seasons End sleeve notes CD Remaster 1997 as the group had already recorded some demos of the next studio album, which eventually would have become Seasons End. Hogarth was a significant contrast to Fish, coming from a new wave musical background instead of progressive rock. He had also never owned a Marillion album before joining the band.", "thumb|275px|right| Marillion in 2007, left to right: Steve Rothery, Steve Hogarth, Pete Trewavas (front row), Mark Kelly, Ian Mosley (back row) The band's management organised the biggest promotional schedule since they had left EMI and Steve Hogarth secured interviews with prominent broadcasters on BBC Radio, including Matthew Wright, Bob Harris, Stuart Maconie, Simon Mayo and Mark Lawson. Marbles also became the band's most critically acclaimed album since Afraid of Sunlight, prompting many positive reviews in the press.Betty Clarke The Guardian, 30 April 2004.Tim Jones Record Collector, May 2004, Issue 297.Jon Hotten Classic Rock, May 2004, Issue 66.Roger Newell Guitarist, June 2004Simon Gausden Powerplay, June 2004Guitar, June 2004The Star, June 2004 The band released \"You're Gone\" as the lead single from the album. Aware that it was unlikely to gain much mainstream radio airplay, the band released the single in three separate formats and encouraged fans to buy a copy of each to get the single into the UK Top Ten. The single reached No. 7, making it the first Marillion song to reach the UK Top Ten since \"Incommunicado\" in 1987 and the band's first Top 40 entry since \"Beautiful\" in 1995. The second single from the album, \"Don't Hurt Yourself\", reached No. 16. Following this, they released a download-only single, \"The Damage (live)\", recorded at the band's sell-out gig at the London Astoria. All of this succeeded in putting the band back in the public consciousness, making the campaign a success. In September 2004 Marillion returned for shows in Mexico, USA and ended in Canada Quebec City on 13 October 2004.", "Marillion's music has changed stylistically throughout their career. The band themselves stated that each new album tends to represent a reaction to the preceding one, and for this reason their output is difficult to 'pigeonhole'. Although the band has featured two very distinct and different vocalists, the core instrumental line-up of Steve Rothery (lead guitar, and the sole 'pre-Fish' original member), Pete Trewavas (bass), Mark Kelly (keyboards) and Ian Mosley (drums) has been unchanged since 1984.", "*Pete Trewavas – bass guitars, backing vocals, additional studio guitars, additional studio samples and effects (1982–present)", "* Pete Trewavas – bass guitars, backing vocals, additional studio guitars, additional studio samples and effects", "* Pete Trewavas – bass guitars, backing vocals, additional studio guitars, additional studio samples and effects", "* Pete Trewavas – bass guitars, backing vocals, additional studio guitars, additional studio samples and effects", "* Pete Trewavas – bass guitars, backing vocals, additional studio guitars, additional studio samples and effects", "* Pete Trewavas – bass guitars, backing vocals, additional studio guitars, additional studio samples and effects", "* Pete Trewavas – bass guitars, backing vocals, additional studio guitars, additional studio samples and effects"]}, {"page": "Fish (singer)", "response": ["On 26 August 2007, Fish performed at the 'Hobble on The Cobbles' show at the Market Square in Aylesbury. He was accompanied on stage by his four former Marillion bandmates from the classic line-up (Mark Kelly, Steve Rothery, Ian Mosley and Pete Trewavas) for one song: 'Market Square Heroes'. This was the first time they had performed together in nearly two decades. In a press interview following the event, Fish denied this would lead to a full reunion, claiming that \"Hogarth does a great job with the band ... We forged different paths over the 19 years.\""]}, {"page": "Transatlantic (band)", "response": ["Transatlantic is a multinational progressive rock supergroup consisting of Neal Morse (ex–Spock's Beard), Roine Stolt (Kaipa, the Flower Kings), Pete Trewavas (Marillion, Edison's Children) and Mike Portnoy (ex–Dream Theater).  They formed in 1999 as a side project to their full-time bands, but disbanded in 2002. They then reunited in 2009. ", "Originally intending to include Fates Warning guitarist Jim Matheos, Morse and Portnoy tapped Flower Kings guitarist/vocalist Roine Stolt when Matheos was unable to participate. The band completed their lineup by adding bassist and progressive rock veteran Pete Trewavas from the group Marillion and Edison's Children.", "On 10 March 2013, Pete Trewavas announced at the Marillion Weekend Convention in Port Zélande, the Netherlands, that he would be going to Nashville in the Summer to record new material with Transatlantic. Neal Morse confirmed this to DPRP.", "* Pete Trewavas – bass, vocals", "* An interview with Pete Trewavas on the Whirlwind (November 2009) "]}, {"page": "Aylesbury", "response": ["*Pete Trewavas, musician, member of Marillion"]}, {"page": "Ian Mosley", "response": ["In 2001, Mosley joined saxophonist Ben Castle, son of entertainer Roy Castle, and they recorded a jazz-themed album together, Postmankind. The album also featured guest performances by John Etheridge, Steve Hackett and Marillion members Steve Rothery and Pete Trewavas.", "Mosley played on fellow Marillion bandmate Pete Trewavas' and Eric Blackwood's Edison's Children album In The Last Waking Moments..., playing drums on the epic 16 minute \"The Awakening\"."]}, {"page": "Mark Kelly (keyboardist)", "response": ["Kelly has played keyboards with Travis for their headlining set at the Isle of Wight Festival (10–12 June 2005), and at T in the park in 2005. He played Keyboards for Edison's Children's new album \"In The Last Waking Moments...\" (featuring fellow Marillion member Pete Trewavas and Eric Blackwood), for the song The \"Other\" Other Dimension as well as performing vocals with Steve Hogarth and Andy Ditchfield (DeeExpus) on the Edison's Children track The Awakening in 2011."]}, {"page": "Fugazi (album)", "response": ["*Pete Trewavas – bass"]}, {"page": "Clutching at Straws", "response": ["All songs written by Fish, Mark Kelly, Ian Mosley, Steve Rothery and Pete Trewavas.", "*Pete Trewavas – bass, backing vocals"]}, {"page": "Misplaced Childhood", "response": ["*Steve Rothery – guitars; additional bass guitar;Misplaced Childhood 1998 remastered edition - Pete Trewavas' sleevenotes photography (1998 remastered edition)", "*Pete Trewavas – bass guitar"]}, {"page": "Brave (Marillion album)", "response": ["All music by Steve Hogarth/Steve Rothery/Mark Kelly/Pete Trewavas/Ian Mosley. All lyrics by Hogarth except as indicated.", "*Pete Trewavas – bass, backing vocals", "* Pete Trewavas "]}, {"page": "Neal Morse", "response": ["Neal Morse (born August 2, 1960) is an American singer, musician and composer based in Nashville, Tennessee. In 1992, he formed the progressive rock band Spock's Beard with his brother Alan and released an album which was moderately successful. In 1999, he joined Dream Theater's co-founder and then drummer Mike Portnoy, together with Flower Kings' Roine Stolt and Marillion's Pete Trewavas they formed the super-group Transatlantic. In 2002, Neal Morse became a born again Christian, left Spock's Beard and began a Christian rock solo career, releasing many progressive rock concept albums about his new religious faith. In the meantime, he continued to play with Transatlantic and formed three new bands with Portnoy, Yellow Matter Custard, Flying Colors and The Neal Morse Band.", "While with Spock's Beard, Morse released two solo albums of more conventional straightforward rock music. In 1999, he joined former Dream Theater co-founder Mike Portnoy, Flower Kings' Roine Stolt and Marillion's Pete Trewavas to form the supergroup Transatlantic. The band has released five studio albums (SMPT:e, Bridge Across Forever, The Whirlwind, Kaleidoscope and The Absolute Universe) plus live albums from the tours behind each studio disc: Live in America, Live in Europe, Whirld Tour 2010: Live in London, More Never Is Enough and KaLIVEoscope. In concert, the group has included Daniel Gildenlöw of Pain of Salvation, and occasionally Ted Leonard, Morse's eventual replacement in Spock's Beard."]}, {"page": "Mike Portnoy", "response": ["Portnoy is known for his many side projects and tribute bands. He is a founding member of Liquid Tension Experiment, an instrumental progressive rock band featuring fellow Dream Theater members John Petrucci and Jordan Rudess along with bassist Tony Levin. He is also a founding member of Transatlantic, a progressive rock \"super-group\" featuring former Spock's Beard keyboardist/vocalist Neal Morse, Flower Kings guitarist Roine Stolt and Marillion bassist Pete Trewavas. Outside of Transatlantic, Portnoy has worked with Neal Morse extensively, appearing on most of his solo albums. He is a member of The Neal Morse Band, featuring guitarist/vocalist Eric Gillette, bassist Randy George, and 2nd keyboardist/vocalist Bill Hubauer. Portnoy has also recorded and/or toured/performed live with OSI, Hail!, Stone Sour, Fates Warning, Overkill and G3. Over the years, Portnoy has created tribute bands to the Beatles, Led Zeppelin, Rush, and the Who."]}, {"page": "Steve Hogarth", "response": ["Marillion heard the tape and were interested enough to ask for a meeting with the singer. Later accounts of this first meeting record that Hogarth turned up at band member Pete Trewavas' house with his demo tapes contained in a red plastic fire bucket – the audition taking place in Trewavas' garage, due to the presence of cats in the house (see below). The band were immediately impressed by his vocal prowess. Hogarth himself, however, took a little longer to make up his mind, holding as he did at the time a potentially lucrative offer to tour the U.S. on keyboards with the The. As he later recalled in a 2001 interview by Classic Rock, he had a choice \"between the most hip band in the world, and the least...\".Dave Ling (May 2001) Interview with Steve Hogarth Classic Rock In the end he accepted the position with Marillion, won over as the band wanted an equal partner and were offering a potentially permanent arrangement."]}, {"page": "Marbles (album)", "response": ["All songs written by Steve Hogarth, Steve Rothery, Mark Kelly, Pete Trewavas, Ian Mosley.", "* Pete Trewavas – bass guitar"]}, {"page": "Script for a Jester's Tear", "response": ["* Pete Trewavas – bass"]}, {"page": "Market Square Heroes", "response": ["*Pete Trewavas - bass"]}, {"page": "Kayleigh", "response": ["*Pete Trewavas – bass", "Category:Songs written by Pete Trewavas"]}, {"page": "The Sea Within", "response": ["In the live concerts he will then be replaced by Casey McPherson, who from bassist, will move to the role of lead guitarist, being replaced momentarily by Pete Trewavas, of Marillion, for only two concerts, and definitively by Jonas Reingold."]}, {"page": "Seasons End", "response": ["*Pete Trewavas: bass", "*Pete Trewavas"]}, {"page": "Holidays in Eden", "response": ["*Pete Trewavas – bass and backing vocals"]}, {"page": "A Singles Collection", "response": ["*Pete Trewavas – bass"]}, {"page": "Afraid of Sunlight", "response": ["*Pete Trewavas – bass and backing vocals"]}, {"page": "Made Again", "response": ["* Pete Trewavas – bass"]}, {"page": "The Best of Both Worlds (Marillion album)", "response": ["*Pete Trewavas – bass"]}, {"page": "This Strange Engine", "response": ["* Pete Trewavas – bass, backing vocals"]}, {"page": "Radiation (album)", "response": ["The first element was that Rothery decided he wanted a different guitar sound. They placed a ban on digital delay and chorus which had been Rotherys sound for years. He borrowed a Gretsch from Dave Gregory, and played on a Harmony guitar on the bluesy \"Born To Run\". Mark Kelly used a new Roland JP8000, an analogue synth which was very versatile, and he placed a ban on string synths. Pete Trewavas used quite a lot of his old Rickenbacker fuzz bass on the album.The Web UK Magazine 1998", "*Pete Trewavas – bass, acoustic guitar (on \"Now She'll Never Know\") and backing vocals"]}, {"page": "Unplugged at the Walls", "response": ["* Pete Trewavas - acoustic bass guitar, acoustic guitar on \"Blackbird\" and \"Now She'll Never Know\""]}, {"page": "Marillion.com", "response": ["*Pete Trewavas – bass, additional guitar (on \"Tumble Down the Years\"), and backing vocals"]}, {"page": "Anoraknophobia", "response": ["Bassist Pete Trewavas, said the band had not had any tracks left over from previous sessions which could have been used, so the entire album was written \"from scratch\". Since they had been unfashionable in the eyes of the media and had been largely ignored by the music press, Marillion deliberately attempted to create a modern sound and distance themselves further from their neo-progressive rock past. In an interview with the BBC, Hogarth spoke about the band's new musical direction and the album's diverse influences: \"With this album there's been a massive invasion of black influence–there's rap, there's groove, there's funk, there's trip hop, blues, jazz, dub.\" Thus, the songs \"Between You and Me\" and \"Map of the World\" have drawn comparisons to U2, while the nine-minute \"Quartz\", which contains a rap section, has been compared to the sound of Massive Attack.", "*Pete Trewavas – bass, additional guitar (on \"When I Meet God\") and vocals"]}, {"page": "List of bass guitarists", "response": ["* Pete Trewavas (Marillion)"]}, {"page": "B'Sides Themselves", "response": ["*Pete Trewavas – bass, backing vocals"]}, {"page": "John Wesley (guitarist)", "response": ["Other musicians Wesley has worked beside include Sean Malone; Steve Hogarth and Steve Rothery of Marillion as well as a live performer for the Marillion side project Edison's Children featuring Marillion's Pete Trewavas and starring Neil Armstrong's son guitarist Rick Armstrong. He has also performed as an occasional fill-in bassist and lead guitarist for Florida-based group Sister Hazel."]}, {"page": "It Bites", "response": ["Beck and Dalton reunited in 2005 as members of the band Kino, a progressive rock band which also featured Marillion bass player Pete Trewavas and British prog scene regular John Mitchell (Arena and others) on lead vocals and guitar. The band initially featured former Porcupine Tree drummer Chris Maitland, but the latter was later replaced by Dalton. Kino's album 'Picture' was well-received on the British prog rock scene during 2005, and the band performed versions of the It Bites songs \"Kiss Like Judas\" and \"Plastic Dreamer\" at live concerts."]}, {"page": "Chris Thompson (English musician)", "response": ["Also in 1986, Thompson sang vocals on a solo album by ex-Genesis guitarist Steve Hackett. The album featured performances by artists such as Brian May (Queen), Pete Trewavas (Marillion), Ian Mosley (also from Marillion), and Bonnie Tyler. However, the album, entitled Feedback 86, was not released until 2002."]}, {"page": "Assassing", "response": ["*Pete Trewavas - bass", "Category:Songs written by Pete Trewavas"]}, {"page": "SMPT:e", "response": ["All songs by Neal Morse, Mike Portnoy, Pete Trewavas, and Roine Stolt, except where noted.", "*Pete Trewavas — bass, lead (all but 4) and backing vocals, Moog Taurus pedals"]}, {"page": "Bridge Across Forever", "response": ["All songs by Neal Morse, Roine Stolt, Mike Portnoy, and Pete Trewavas, except where noted.", "*Pete Trewavas — Warwick Bass, Taurus Bass Pedals and Vocals, Organ on Bonus Disc Track 4"]}, {"page": "He Knows You Know", "response": ["* Pete Trewavas - bass", "Category:Songs written by Pete Trewavas"]}, {"page": "Garden Party (Marillion song)", "response": ["*Pete Trewavas - bass", "Category:Songs written by Pete Trewavas"]}, {"page": "Punch and Judy (song)", "response": ["*Pete Trewavas - bass", "Category:Songs written by Pete Trewavas"]}]}}