{"wiki_id": "http://www.wikidata.org/entity/Q5292764", "itemLabel": "Don Heath", "itemDescription": "English footballer (born 1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/Don_Heath", "wikipedia_page": {"main": "Don Heath (born 26 December 1944) is an English former professional footballer who played as an outside right.\nBeginning his football career as an apprentice at local club Middlesbrough in 1962, Heath did not play first team football until he signed a professional contract with Norwich City. Making a total of 105 league appearances for the club. He was sold to Swindon Town in 1967 for £7,000.Heath made his début for Swindon on 16 September 1967 in a game versus Northampton Town that his new club won 4–0. He was a member of the squad that won the 1969 League Cup and also the 1970 Anglo-Italian Cup before injury forced him out of the first team. With the arrival of Arthur Horsfield at the club, he was side-lined for much of the 1970 season before playing his last game for Swindon on 14 March 1970.He moved to Oldham Athletic in July 1970 and was a central figure in their successful promotion season of 1970–71. Peterborough United obtained his services on a free transfer the following season before he moved once more, this time to Hartlepool United where his league playing career finished.\nHeath went on to play for non-league clubs Gateshead United, Crook Town and South Bank before retiring and taking a job working for ICI in the North of England.", "link_mentions": [{"page": "Stockton-on-Tees", "response": ["* Don Heath, footballer, winner of the League Cup in 1969, when his Swindon team beat Arsenal 3–1"]}, {"page": "1969 Football League Cup Final", "response": ["|OR ||7 || Don Heath"]}, {"page": "List of Swindon Town F.C. players", "response": ["|Don Heath ||||FW||1967–70 ||106||3"]}, {"page": "Bob Enevoldsen", "response": ["* The Music of Bob Enevoldsen, (Nocturne, 1954; Fresh Sound, 2006) with  Marty Paich,  Howard Roberts,  Harry Babasin, Don Heath, Roy Harte", "* Smorgasbord, (Liberty, 1956) with Howard Roberts, Don Heath, Marty Paich, Red Mitchell, Larry Bunker"]}, {"page": "Heath (name)", "response": ["*Don Heath (born 1944), English football (soccer) player"]}, {"page": "List of Norwich City F.C. players (25–99 appearances)", "response": ["|Don Heath"]}]}}