{"wiki_id": "http://www.wikidata.org/entity/Q5290471", "itemLabel": "Dominic Bradley", "itemDescription": "Irish politician (born 1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dominic_Bradley", "wikipedia_page": {"main": "Dominic Bradley (Irish Doiminic Ó Brolcháin ) is a former Social Democratic and Labour Party (SDLP) Member of the Northern Ireland Assembly for Newry and Armagh. As an MLA, he was the SDLP Spokesperson for Education and for the Irish language.A graduate of St. Paul's High School, Bessbrook, Bradley is a teacher from County Armagh. He acted as Director of Elections for Seamus Mallon MP and for the SDLP in the Newry and Mourne District Council area.Membership:\n\nMember of the National Executive Association for School's Drama\nFounder of Tí Chulainn Cultural Activity Centre, An Mullach Bán.\nMember of National Executive National Association of Teachers of Irish.Bradley is an Irish language speaker, and is education editor of the daily newspaper Lá Nua. He writes in Irish for a number of other newspapers. In October 2011, he was sanctioned by speaker for talking too long without asking a question.", "link_mentions": [{"page": "Seamus Mallon", "response": ["Mallon did not contest his seat in the Stormont Assembly in the 2003 elections, and stood down at the 2005 Westminster election. Dominic Bradley was nominated to contest the seat Mallon vacated, however failed to re-capture the seat as Conor Murphy of Sinn Féin won."]}, {"page": "List of members of the 2nd Northern Ireland Assembly", "response": ["|Dominic Bradley", "|Dominic Bradley"]}, {"page": "List of Queen's University Belfast people", "response": ["* Dominic Bradley – Social Democratic and Labour Party MLA for Newry and Armagh"]}, {"page": "Kingsmill massacre", "response": ["However, a 2011 report by the HET concluded that Provisional IRA members were responsible and that the event was planned before the Reavey and O'Dowd killings which had taken place the previous day, and that South Armagh Republican Action Force was a covername. It added: \"There is some intelligence that the Provisional IRA unit responsible was not well-disposed towards central co-ordination but there is no excuse in that. These dreadful murders were carried out by the Provisional IRA and none other\". Responding to the report, Sinn Féin spokesman Mitchel McLaughlin said that he did \"not dispute the sectarian nature of the killings\" but continued to believe \"the denials by the IRA that they were involved\".SF: Kingsmills families need truth 'like other victims' BBC News 22 June 2011Pete Baker, Sinn Féin rejects HET findings on Kingsmill massacre Slugger O'Toole 22 June 2011 SDLP Assemblyman Dominic Bradley called on Sinn Féin to \"publicly accept that the HET's forensic evidence on the firearms used puts Provisional responsibility beyond question\" and to stop \"deny[ing] that the Provisional IRA was in the business of organising sectarian killings on a large scale\"."]}, {"page": "St Paul's High School, Bessbrook", "response": ["*Dominic Bradley, former SDLP politician and former MLA for Newry and Armagh (2003-2016); formerly the school's Head of Year and Acting Head of Irish."]}, {"page": "1960 in Northern Ireland", "response": ["**Dominic Bradley, SDLP MLA."]}, {"page": "List of members of the 3rd Northern Ireland Assembly", "response": ["|Dominic Bradley", "|Dominic Bradley"]}, {"page": "Newry and Armagh (Assembly constituency)", "response": ["| rowspan=5|Dominic Bradley(SDLP)"]}, {"page": "Committee for Culture, Arts and Leisure", "response": ["|  || Dominic Bradley"]}, {"page": "List of Ulster University people", "response": ["*Dominic Bradley, Social Democratic and Labour Party (SDLP) MLA for Newry and Armagh"]}, {"page": "2016 Northern Ireland Assembly election", "response": ["* Dominic Bradley (Newry and Armagh)"]}, {"page": "List of members of the 4th Northern Ireland Assembly", "response": ["|Dominic Bradley", "|Dominic Bradley"]}, {"page": "2001 AAA Championships", "response": ["|Dominic Bradley || 13.83"]}]}}