{"wiki_id": "http://www.wikidata.org/entity/Q529485", "itemLabel": "Chelsy Davy", "itemDescription": "Zimbabwean businesswoman and lawyer", "wikipedia_url": "https://en.wikipedia.org/wiki/Chelsy_Davy", "wikipedia_page": {"main": "Chelsy Yvonne Davy (born 13 October 1985) is a Zimbabwean businesswoman who is the owner and founder of the jewelry brand \"Aya\" and the travel agency \"Aya Africa\".", "link_mentions": [{"page": "Prince Harry, Duke of Sussex", "response": ["Chelsy Davy, the daughter of Zimbabwean, South Africa-based businessman Charles Davy, was referred to as Harry's girlfriend in an interview conducted for his 21st birthday, and Harry said he \"would love to tell everyone how amazing she is but once I start talking about that, I have left myself open.... There is truth and there is lies and unfortunately I cannot get the truth across.\" Davy was present when Harry received his Operational Service Medal for Afghanistan and also attended his graduation ceremony when he received his flying wings from his father. In early 2009, it was reported the pair had parted ways after a relationship that had lasted for five years."]}, {"page": "Stowe School", "response": ["* Chelsy Davy, (born 1985), former girlfriend of Prince Harry"]}, {"page": "Chelsea (name)", "response": ["*Chelsy Davy (born 1985), owner and founder of AYA Travel,  ex-girlfriend of Prince Harry, Duke of Sussex.", "*Chelsy Davy, (born 1985) on-off ex-girlfriend of Prince Harry"]}, {"page": "WAGs", "response": ["In July 2006 The Sun carried an article on the \"RAGs\" (\"Royals and Girlfriends\"), a term introduced for young female members of the British Royal Family, as well as Kate Middleton, then girlfriend and now wife of Prince William, and Chelsy Davy, then girlfriend of Prince Harry.The Sun, 3 July 2006 Subsequently, under the heading \"Windsor Mads outdo the Wags\", Jasper Gerard reported in the Sunday Times on festivities involving \"the Windsor Mads (mothers and daughters), as Fergie [Sarah, Duchess of York] and Eugenie celebrated Beatrice's forthcoming 18th birthday\".Sunday Times, 16 July 2006"]}, {"page": "Concert for Diana", "response": ["*Chelsy Davy", "* Kate Middleton, now Prince William's wife, and Chelsy Davy, the now ex-girlfriend of Prince Harry, attended the concert. It has been rumoured that they were involved in helping to plan the event.\"William Invites Kate To The Concert For Diana \". The Royal List."]}, {"page": "List of white Africans of European ancestry", "response": ["*Chelsy Davy, onetime girlfriend of Prince Harry"]}, {"page": "Webster Shamu", "response": ["He has business interests in common with Charles Davy, the father of Chelsy Davy, the former girlfriend of Prince Harry, through Davy's HHK Safaris, which incorporates Shamu's Famba Safaris. HHK Safaris and Shamu were investigated for illegal ivory trading in 2007."]}, {"page": "List of alumni of the University of Cape Town", "response": ["*Chelsy Davy, ex-girlfriend of Britain's Prince Harry"]}, {"page": "Chelsea Davy", "response": ["#Redirect Chelsy Davy"]}, {"page": "Chelsy Davey", "response": ["#Redirect Chelsy Davy"]}, {"page": "Chelsea Davey", "response": ["#Redirect Chelsy Davy"]}, {"page": "List of wedding guests of Prince William and Catherine Middleton", "response": ["*Chelsy Davy (friend of Prince Harry's)"]}]}}