{"wiki_id": "http://www.wikidata.org/entity/Q5297992", "itemLabel": "Doris Storey", "itemDescription": "British swimmer, Olympic athlete, British Empire Games gold medallist", "wikipedia_url": "https://en.wikipedia.org/wiki/Doris_Storey", "wikipedia_page": {"main": "Doris Storey (21 December 1919 – 21 October 2005), later known by her married name Doris Quarmby, was an English breaststroke swimmer from Leeds who competed for Great Britain in the 1936 Summer Olympics and for England at the 1938 British Empire Games.\nIn 1936 she finished sixth in the 200 metre breaststroke event having injured her arm in a fall before the final.\nAt the 1938 Empire Games in Sydney, Australia she won the gold medal in the 220 yards breaststroke competition. She was also a member of the English relay team which won the gold medal in the 3×110 yards medley contest.", "link_mentions": [{"page": "1938 British Empire Games", "response": ["|Doris StoreyLorna FramptonMargery Hinton||3:57.7"]}, {"page": "Swarcliffe", "response": ["In 2005, Norman Harding, a trade unionist, tenants' leader and socialist, published Staying Red: Why I Remain a Socialist, detailing his life and political activities while living at 40 Eastwood Crescent. In 2008, he was writing book about Doris Storey, the winner of two Olympic swimming gold medals at the 1938 British Empire Games in Sydney, Australia. Mr. Harding lived in the Swarcliffe area, until his death in December, 2013. The Leeds-born musician, Andrew Edge, grew up in the area, attending Swarcliffe School. He used two photographs taken in Swarcliffe, of a sunrise and sunset, for his Northern Sky album in 1996 (BMG Austria).Northern Sky (1996), by Andrew Edge. CD liner notes. Record company: BMG Records, Austria. Album bar code: 4321-37102-2."]}, {"page": "1938 European Aquatics Championships", "response": ["| Doris Storey ||align=\"right\"| 3:06.0"]}, {"page": "Norman Harding", "response": ["In 2007, the Leeds Tenants' Federation awarded Harding a glass plaque for \"outstanding contributions to the community\". In 2008, it was reported that Harding was working on a book about the Leeds-born Doris Storey; the winner of two Olympic swimming gold medals at the 1938 British Empire Games in Sydney, Australia. Harding lived at Woodview Court, Swarcliffe, with his wife, until his death in December 2013."]}, {"page": "List of Commonwealth Games medallists in swimming (women)", "response": ["|Doris StoreyLorna FramptonMargery Hinton"]}, {"page": "England at the 1938 British Empire Games", "response": ["| Doris Storey      || 18     || Machinist    ||2 x gold "]}]}}