{"wiki_id": "http://www.wikidata.org/entity/Q5298438", "itemLabel": "Dorothy Gow", "itemDescription": "composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Dorothy_Gow", "wikipedia_page": {"main": "Dorothy Alice Gow (30 November 1892 – 1 November 1982) was an English composer. She was born in London, the youngest of six children from a Scottish family. The Music Society performed her works as early as 1922, and after this initial success, Gow began studying at the Royal College of Music when she was in her thirties. Gow was living at 184 Earls Court Road at the time of the 1901 census.  She studied composition with Vaughan Williams at the Royal College of Music and with Egon Wellesz in Vienna. She never married and died in London.", "link_mentions": [{"page": "List of women composers by birth date", "response": ["* Dorothy Gow (1893–1982)"]}, {"page": "List of string quartet composers", "response": ["*Dorothy Gow (1892–1982): String Quartet No. 1, Fantasy String Quartet (1932), String Quartet No. 2 (1933), String Quartet in One Movement (1947)."]}, {"page": "Elizabeth Maconchy", "response": ["In 1923, at the age of sixteen, she moved to London to enrol at the Royal College of Music. At the RCM Maconchy studied under Charles Wood and Ralph Vaughan Williams. Her contemporaries at the college included Grace Williams, Dorothy Gow, and Ina Boyle. Early compositions such as the violin sonata and Piano Concertino of 1927 already show the influence of European composers, especially Bartok.LeFanu, Nicola: Elizabeth Maconchy, Some Biographical and Musical Notes As a student, Maconchy was awarded the Blumenthal Scholarship in 1927, and the Octavia Scholarship of 1930, which allowed her to continue her studies in Prague. Her first public recognition came in 19 March 1930 with a performance of her Piano Concerto, conducted by her teacher there, Karel Jirak. This was followed on 30 August by a BBC Proms performance of her cantata The Land, conducted by Henry Wood,BBC Proms Archive which was inspired by the long poem of the same name by Vita Sackville-West."]}, {"page": "Grace Williams", "response": ["Williams was born in Barry, Glamorgan, the daughter of William Matthews Williams and Rose Emily Richards Williams. Both of her parents were teachers; her father was also a noted musician. She learned piano and violin as a girl, playing piano trios with her father and her brother Glyn, and accompanying her father's choir.  At the County School she began to develop her interest in composition under the guidance of the music teacher Miss Rhyda Jones, and in 1923 she won the Morfydd Owen scholarship to Cardiff University (University College of South Wales and Monmouthshire), where she studied under Professor David Evans. In 1926 she began studying at the Royal College of Music, London, where she was taught by Gordon Jacob and Ralph Vaughan Williams. Other notable female composers studying with Williams at the RCM were Elizabeth Maconchy, Dorothy Gow and Imogen Holst, the daughter of Gustav Holst. In 1930 she was awarded a travelling scholarship, and chose to study with Egon Wellesz in Vienna, where she remained till 1931."]}, {"page": "Oboe quintet", "response": ["|Dorothy Gow"]}, {"page": "1936 in British music", "response": ["*Dorothy Gow – Oboe Quintet"]}]}}