{"wiki_id": "http://www.wikidata.org/entity/Q5292160", "itemLabel": "Don Anthony", "itemDescription": "British hammer thrower (1928-2012)", "wikipedia_url": "https://en.wikipedia.org/wiki/Don_Anthony", "wikipedia_page": {"main": "Donald William James Anthony MBE (6 November 1928 – 28 May 2012) was a British hammer thrower. He competed at the 1956 Summer Olympics.Anthony placed 4th in the Empire Games in Vancouver in 1954. The former Watford Harrier held the England record in the event which he broke several times during his decade long international athletics career. He later competed for Polytechnic Harriers. He was a founder member of the Hammer Circle.\nHe was a former pupil at Watford Boys Grammar School. \nIt was as an administrator, educator and sporting pioneer that he truly made his mark. Whilst on National Service in Cyprus in 1955, Anthony first played the game of volleyball and, on his return home to a job as an assistant lecturer at Manchester University he established a national governing body for the sport. Anthony remained president of England Volleyball. Volleyball England’s Hall of Fame bears his name.\nHe traveled the world to promote peace and the values of the Olympic Games through UNESCO and the Olympic Solidarity movement. He was a familiar face at the International Olympic Academy in Greece and oversaw the establishment of Britain’s own National Olympic Academy in 1982.\nAs a journalist, he was responsible for uncovering much of Britain’s early Olympic heritage and also ensured that William Penny Brookes’ Olympian Games in Much Wenlock received their rightful place in the history of the modern Games. In 1994, Anthony welcomed Juan Antonio Samaranch to Much Wenlock to mark the centenary of the IOC. Wenlock was the name of one of the London 2012 games mascots.\nHe worked closely with Baron Pierre de Coubertin’s great nephew, Antoine de Navacelle, in the establishment of the Coubertin awards which combined sport with the world of business ethics.", "link_mentions": [{"page": "Watford Grammar School for Boys", "response": ["* Don Anthony, Represented Great Britain in the 1956 Summer Olympics in the Hammer Throw. Dedicated his life to the Olympic movement."]}, {"page": "2011 Birthday Honours", "response": ["*Dr. Don Anthony. For services to Sport."]}, {"page": "Deaths in May 2012", "response": ["*Don Anthony, 83, British Olympic hammer thrower."]}, {"page": "Donald Anthony", "response": ["#REDIRECTDon Anthony"]}, {"page": "England at the 1954 British Empire and Commonwealth Games", "response": ["| Don Anthony                         || 25 ||Hammer||None"]}, {"page": "England at the 1958 British Empire and Commonwealth Games", "response": ["| Don Anthony                          ||Hammer||"]}, {"page": "List of British champions in hammer throw", "response": ["| Don Anthony"]}, {"page": "Athletics at the 1958 British Empire and Commonwealth Games – Men's hammer throw", "response": ["|  ||align=left| Don Anthony ||align=left|  || || || || || || ||  ||"]}, {"page": "Athletics at the 1954 British Empire and Commonwealth Games – Men's hammer throw", "response": ["| 4 ||align=left| Don Anthony ||align=left|  ||  || q", "|  ||align=left| Don Anthony ||align=left|  ||  ||"]}]}}