{"wiki_id": "http://www.wikidata.org/entity/Q5294816", "itemLabel": "Donald Maxwell", "itemDescription": "British artist (1877-1936)", "wikipedia_url": "https://en.wikipedia.org/wiki/Donald_Maxwell", "wikipedia_page": {"main": "Donald Maxwell (14 April 1877 – 25 July 1936) was an English writer and illustrator, still notable for his topographical paintings. Several of his works were displayed as prints in railway carriages.", "link_mentions": [{"page": "Clapham", "response": ["* Donald Maxwell"]}, {"page": "1936 in literature", "response": ["*July 25 – Donald Maxwell, English travel writer and illustrator (born 1877)"]}, {"page": "1877 in literature", "response": ["*April 14 – Donald Maxwell, English travel writer and illustrator (died 1936)"]}, {"page": "Kismet (musical)", "response": ["A 1989 recording on Jay Records that includes some songs from the film version and Timbuktu! as bonus tracks was conducted by John Owen Edwards with  Donald Maxwell (Hajj), Valerie Masterson (Marsinah), David Rendall (Caliph), Judy Kaye (Lalume), Richard Van Allan (Wazir), Bonaventura Bottone and Rosemary Ashe.\"Kismet – First complete recording\", JAY Records, accessed December 23, 2015  A 1991 Sony Broadway version with new orchestrations by conductor Paul Gemignani stars Samuel Ramey (Hajj), Ruth Ann Swenson (Marsinah), Jerry Hadley (Caliph), Julia Migenes (Lalume), Dom DeLuise (Wazir) and Mandy Patinkin (Marriage arranger).\"Kismet: a musical Arabian night – studio cast recording 1991\", Masterworks Broadway, accessed December 23, 2015"]}, {"page": "Borstal, Rochester", "response": ["Its name came from Anglo-Saxon burg-steall \"fort site\" or \"place of refuge\",The Place Names of Kent, Judith Glover, 1976, Batsford.  likely referring to the hill there.  The hill is now the home to Fort Borstal. However, local resident Donald Maxwell argued that a 'borstal' was \"a track up a chalk hill\", claiming to have heard local farmers use the term in this way.The Church Times, 26 July 1929", "The artist Donald Maxwell lived at No. 3 Borstal Villas from 1908 to 1930. Retrieved 18 August 2010."]}, {"page": "List of British artists", "response": ["* Donald Maxwell (1877–1936) – English illustrator and painter in oils and watercolours"]}, {"page": "1936 in art", "response": ["* Donald Maxwell, English illustrator and travel writer (b. 1877)"]}, {"page": "Haddon Hall (opera)", "response": ["The piece followed Sullivan's only grand opera, Ivanhoe (1891). Haddon Hall was performed with some regularity by amateur operatic societies in Britain in the first three decades of the 20th century, but it has rarely been performed since then.Bond, Ian. \"Haddon Hall: Reported Productions\", St. David's Players, accessed March 11, 2018 Its last professional production for over a century was a British provincial tour by one of Carte's touring companies in 1899.Rollins and Witts, p. 108 The National Gilbert & Sullivan Opera Company presented the first professional staging in August 2018 in Buxton and Harrogate, England, in 2018 at the 25th International Gilbert and Sullivan Festival, starring Richard Suart and Donald Maxwell. A recording was made by The Prince Consort in 2000,Shepherd, Marc (ed.) The Prince Consort Haddon Hall (2000)\", Gilbert and Sullivan Discography, 11 July 2010, accessed 28 February 2018 and the first complete professional recording was released in 2020 by Dutton featuring the BBC Singers and BBC Concert Orchestra, conducted by John Andrews.\"On record: classical — April 5\", The Times, 5 April 2020"]}, {"page": "East Farleigh", "response": ["East Farleigh appears in the Domesday Book as Ferlaga from the Saxon words referring to a passage (over the river in this case). The nearby village of West Farleigh has the same roots.British History on Line: Edward Hasted 1798 notes on the village The 12th-century church is dedicated to St Mary and is a listed building.1 East Farleigh House was the home of the noted artist Donald Maxwell from 1930 to 1936, and he is buried in the churchyard."]}, {"page": "Church Times", "response": ["*Donald Maxwell (artist)"]}, {"page": "North East of Scotland Music School", "response": ["*Donald Maxwell (voice)"]}, {"page": "Ezra's Tomb", "response": ["Aluzair.gif|Ezra's Tomb by British war artist Donald Maxwell, ."]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Donald Maxwell, artist and illustrator"]}]}}