{"wiki_id": "http://www.wikidata.org/entity/Q5295155", "itemLabel": "Donald Sinclair", "itemDescription": "British hotel owner", "wikipedia_url": "https://en.wikipedia.org/wiki/Donald_Sinclair_(hotel_owner)", "wikipedia_page": {"main": "Donald William Sinclair (10 July 1909 – 1981) was the co-proprietor of the Gleneagles Hotel in Torquay, Devon, England, United Kingdom. He helped manage the hotel after an extensive career as an officer in the Merchant Navy and the Royal Navy. During the Second World War, Sinclair twice survived the sinking of the ships on which he was serving.\nSinclair is primarily known for being the inspiration for the character Basil Fawlty, played by John Cleese, in the television sitcom Fawlty Towers that Cleese co-wrote. This was owing to Sinclair's allegedly stuffy, snobbish and eccentric treatment of his guests, including Cleese and other members of the Monty Python cast. Cleese later played a character named Donald Sinclair in the 2001 film Rat Race.\n\n", "link_mentions": [{"page": "Fawlty Towers", "response": ["The idea of the show came from Cleese after he stayed at the Gleneagles Hotel in Torquay, Devon in 1970 (along with the rest of the Monty Python troupe), where he encountered the eccentric hotel owner Donald Sinclair. Stuffy and snobbish, Sinclair treated guests as though they were a hindrance to his running of the hotel (a waitress who worked for him stated \"it was as if he didn't want the guests to be there\"). Sinclair was the inspiration for Cleese's character Basil Fawlty.", "In May 1970, the Monty Python comedy group stayed at the now demolished Gleneagles Hotel in Torquay, Devon while filming on location in Paignton. John Cleese was fascinated with the behaviour of the owner, Donald Sinclair, later describing him as \"the rudest man I've ever come across in my life\". Among such behaviour by Sinclair was his criticism of Terry Gilliam's \"too American\" table etiquette and tossing Eric Idle's briefcase out of a window \"in case it contained a bomb\". Asked why would anyone want to bomb the hotel, Sinclair replied, \"We've had a lot of staff problems\". Michael Palin states Sinclair \"seemed to view us as a colossal inconvenience\". Rosemary Harrison, a waitress at the Gleneagles under Sinclair, described him as \"bonkers\" and lacking in hospitality, deeming him wholly unsuitable for a hotel proprietor. \"It was as if he didn't want the guests to be there.\" Cleese and his then wife Connie Booth stayed on at the hotel after filming, furthering their research of its owner. Demolished in 2015, the building was replaced by a new retirement home named Sachs Lodge in memory of Andrew Sachs who played Manuel in the sitcom and who died in 2016."]}, {"page": "July 10", "response": ["*1909 – Donald Sinclair, English lieutenant and businessman (d. 1981)"]}, {"page": "John Cleese", "response": ["Cleese achieved greater prominence in the United Kingdom as the neurotic hotel manager Basil Fawlty in Fawlty Towers, which he co-wrote with his wife Connie Booth. The series won three BAFTA awards when produced, and in 2000 it topped the British Film Institute's list of the 100 Greatest British Television Programmes. In a 2001 poll conducted by Channel 4 Basil Fawlty was ranked second (behind Homer Simpson) on their list of the 100 Greatest TV Characters. The series also featured Prunella Scales as Basil's acerbic wife Sybil, Andrew Sachs as the much abused Spanish waiter Manuel, and Booth as waitress Polly, the series' voice of sanity. Cleese based Basil Fawlty on a real person, Donald Sinclair, whom he had encountered in 1970 while the Monty Python team were staying at the Gleneagles Hotel in Torquay while filming inserts for their television series. Reportedly, Cleese was inspired by Sinclair's mantra, \"I could run this hotel just fine if it weren't for the guests.\" He later described Sinclair as \"the most wonderfully rude man I have ever met,\" although Sinclair's widow has said her husband was totally misrepresented in the series. During the Pythons' stay, Sinclair allegedly threw Idle's briefcase out of the hotel \"in case it contained a bomb,\" complained about Gilliam's \"American\" table manners, and threw a bus timetable at another guest after he dared to ask the time of the next bus to town."]}, {"page": "Torquay", "response": ["A number of sketches for the Monty Python's Flying Circus television show (1969–74) were filmed on location in and around both Torquay and neighbouring Paignton. It was while staying in Torquay at the Gleneagles Hotel with the Python team in 1971, that John Cleese found inspiration (and the setting, although not the actual film location) for the popular sitcom Fawlty Towers (1975, 1979). Incidents during the Pythons' stay are said to include the owner, Donald Sinclair, having thrown Eric Idle's suitcase out of a window in case it contained a bomb. Cleese later described the eccentric owner as, \"the most wonderfully rude man I have ever met\", although Mr. Sinclair's widow has since said her husband was totally misrepresented in the comedy."]}, {"page": "Donald Sinclair", "response": ["Donald Sinclair may refer to:", "*Donald Sinclair (hotel owner) (1909–1981), owner of the Gleneagles Hotel in Torquay and the inspiration for the character Basil Fawlty in Fawlty Towers", "*Donald Sinclair (veterinary surgeon) (1911–1995), inspiration for the character Siegfried Farnon in James Herriot's novels and their film and TV adaptations All Creatures Great and Small", "*Donald Sinclair (Ontario politician) (1829–1900), Canadian politician", "*Donald Sinclair (diplomat), former Canadian ambassador to Israel"]}, {"page": "Basil Fawlty", "response": ["Known for his quotable rants, the character was inspired by Donald Sinclair, an eccentric hotel owner whom Cleese had encountered when he stayed at his hotel (Gleneagles Hotel in Torquay, England) along with the rest of Monty Python in May 1970.", "Fawlty Towers was inspired by the Monty Python team's stay in the Gleneagles Hotel in Torquay. Cleese and Booth stayed on at the hotel after filming for the Python show had finished. The owner, Mr Donald Sinclair, was very rude, throwing a bus timetable at a guest who asked when the next bus to town would arrive and placing Eric Idle's suitcase behind a wall in the garden in case it contained a bomb (actually it contained a ticking alarm clock). He also criticised the American-born Terry Gilliam's table manners for being too American (he had the fork in what Sinclair considered to be the wrong hand while eating). Cleese used the name \"Donald Sinclair\" for his character in the 2001 film Rat Race. In the episode \"The Builders\", Fawlty refers to a local hotel or restaurant called \"Gleneagles\" while talking to Miss Gatsby and Miss Tibbs. Cleese once lived in London's Basil Street.YouTube"]}, {"page": "The Builders", "response": ["*Basil tells his guests that they must go to \"Gleneagles\" for their dinners - this is a reference to the Gleneagles Hotel which Donald Sinclair, the hotel manager on which John Cleese based Basil Fawlty, ran in Torquay, the town where Fawlty Towers is set, and where the Monty Python team had stayed when Cleese gained his inspiration for Fawlty Towers."]}, {"page": "Donald Sinclair (Fawlty Towers)", "response": ["#REDIRECT Donald Sinclair (hotel owner)"]}, {"page": "Sinclair (surname)", "response": ["*Donald Sinclair (hotel owner) (1909–1981), owner of the Gleneagles Hotel in Torquay, England; inspiration for the character Basil Fawlty, played by John Cleese, in the British television sitcom Fawlty Towers", "*Donald Sinclair (veterinary surgeon) (1911–1995), British veterinary surgeon, inspiration for a character in the All Creatures Great and Small franchise", "*Donald Sinclair (disambiguation)"]}, {"page": "Gleneagles Hotel, Torquay", "response": ["The Gleneagles Hotel was a hotel in Torquay, Devon, England. The 41-bed establishment, which opened in the 1960s, was the inspiration for Fawlty Towers, a British situation comedy first broadcast in the mid-1970s. John Cleese, and his then wife Connie Booth, were inspired to write the series after they had stayed at the hotel and witnessed the eccentric behaviour of its owner, Donald Sinclair (who sold the hotel in 1973). Later the hotel was managed by Best Western. In February 2015 the hotel closed. It will be replaced by retirement apartments.", "The Gleneagles was not originally built as a hotel but was modified to become one. The hotel was first opened in 1963 and was managed by Donald Sinclair. It was initially described as \"upmarket\" because it advertised private bathrooms in every room. In the early 1970s, cast members of Monty Python's Flying Circus stayed at the Gleneagles for a planned three weeks, while filming in Paignton. Due to Sinclair's rudeness towards them, which included criticising Terry Gilliam's \"too American\" table etiquette and tossing Eric Idle's briefcase out of a window \"in case it contained a bomb\", the cast left the hotel apart from John Cleese and his wife, Connie Booth. Cleese described Sinclair as \"the most marvellously rude man I've ever met\" and based his Basil Fawlty character on him when he and Booth created Fawlty Towers five years later. Sinclair sold the Gleneagles in 1973. For the rest of its existence, the hotel retained a reminder of Sinclair's legacy: the 41 rooms all had names such as Coral or Mimosa. This was introduced in the Sinclair era of Gleneagles."]}]}}