{"wiki_id": "http://www.wikidata.org/entity/Q5296655", "itemLabel": "Donnie Gillies", "itemDescription": "Scottish footballer (born 1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Donnie_Gillies", "wikipedia_page": {"main": "Donald George Gillies (born 20 June 1951) is a Scottish former footballer, who played initially as a forward but latterly as a right back. He made over 230 Football League appearances and 45 Scottish League appearances in the 1970s in the years after the Second World War.", "link_mentions": [{"page": "Donald Gillies", "response": ["*Donnie Gillies (born 1951), Scottish footballer"]}, {"page": "Bristol derby", "response": ["|style=\"text-align:left;\"|Donnie Gillies||style=\"text-align:left;\"|||1973–1980||200||26||1980–1982||59||0"]}, {"page": "Coventry City 2–2 Bristol City (1977)", "response": ["As a result of many Bristol City supporters being delayed in traffic as they travelled to the game, the kick-off in the Coventry–Bristol City game was delayed by five minutes, to avoid crowd congestion. Coventry took a  lead with goals in the 15th and 51st minutes, both scored by midfielder Tommy Hutchison. Bristol City then scored through Gerry Gow and Donnie Gillies to level the match at  after 79 minutes. With five minutes remaining, the supporters and players received the news that Sunderland had lost to Everton and that a draw would be sufficient for both Coventry and Bristol City to escape relegation at Sunderland's expense. As a result, the last five minutes were played out with neither team's players attempting to score and the match finished as a  draw.", "Coventry began the match in attacking style, seeking to secure the win which for them was the only way to be certain of survival. Committing several players to attack left Coventry vulnerable, and Bristol City twice found themselves with the ball behind Coventry's defence. The two chances fell to Chris Garland and Jimmy Mann, but neither was able to beat Coventry goalkeeper Les Sealey. Two minutes after Mann's miss, Coventry took the lead. A free kick by Mick Coop was parried weakly by Bristol City goalkeeper John Shaw and fell to Tommy Hutchison, who scored his second goal of the season with a powerful shot. Bristol City had several chances to equalise just before half-time – first through a goal-line clearance by McDonald, then through  Trevor Tainton, whose 20-yard shot was saved by Sealey. The final Bristol City chance of the half resulted from a Coventry defensive mix-up; Yorath allowed a pass from Donnie Gillies through to Sealey, but the goalkeeper was not expecting it and the ball only narrowly missed the Coventry goal. The score remained  to Coventry at half-time.", "|2 || Donnie Gillies"]}]}}