{"wiki_id": "http://www.wikidata.org/entity/Q5294842", "itemLabel": "Donald Johnson", "itemDescription": "British politician (1903-1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Donald_Johnson_(British_politician)", "wikipedia_page": {"main": "Donald McIntosh Johnson (17 February 1903 – 5 November 1978) was a British general practitioner, author and politician who was a member of parliament for nine years. He regarded himself as a 'Cassandra' (one whose prophecies were true but never believed), and he was described by one observer as \"an eccentric man of considerable personal charm and egotistical obstinacy\" who had failed to prove it was possible to be both a Conservative and Independent MP at the same time.", "link_mentions": [{"page": "Carlisle (UK Parliament constituency)", "response": ["|| 1955 || Dr Donald Johnson|| Conservative"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| Donald Johnson"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| Donald Johnson"]}, {"page": "Don Johnson (disambiguation)", "response": ["Don or Donald Johnson may also refer to:", "* Donald Johnson (born 1968), American tennis player", "* Donald Johnson (British politician) (1903–1978), British Member of Parliament", "* Donald Johnson, English musician and member of Manchester band A Certain Ratio"]}, {"page": "Bewdley (UK Parliament constituency)", "response": ["*Liberal: Donald Johnson"]}, {"page": "1943 Chippenham by-election", "response": ["Elsewhere in the country, elements within both the Liberal and Labour parties had grown to dislike the electoral pact. At the 1942 Liberal Assembly a motion calling on the Liberal leader Sir Archibald Sinclair, to stop signing the endorsement letter, attracted the support of a third of the meeting.  The chairman of the Liberal Action Group, which opposed the electoral truce, was 30-year-old Dr Donald Johnson. He argued that \"Democracy should be practised as well as fought for\".Liberal Crusader by Gerard De Groot Johnson decided to contest the Chippenham by-election as an Independent Liberal and resigned from the party in order to do so. Before doing so he attended the Liberal Assembly in July 1943 in an attempt to rally activists in the party to support him in Chippenham.Trial By Ballot by Ivor RM Davies He had no link with Chippenham, but did have a track record as a parliamentary candidate. In the 1935 general election he was the Liberal Party's candidate in Bury. In May 1937 he was chosen as the Liberal candidate at the 1937 Bewdley by-election and finished a decent second. Johnson worked as a part-time Demonstrator of Anatomy at Oxford University from 1937. As war threatened in July 1939 he enlisted in the Royal Army Medical Corps (TA), being commissioned as a captain and serving in Bristol. During the Blitz on London, Johnson's Belgian first wife Christiane Coussaert whom he had married in 1928 was killed by German bombs.\"The Chippenham By-Election\", The Times, 21 August 1943. Johnson moved to Woodstock, Oxfordshire where he bought the Marlborough Arms Hotel.\"Dr Donald Johnson\" (Obituary), The Times, 7 November 1978."]}, {"page": "Donald Johnson (politician)", "response": ["#REDIRECT Donald Johnson (British politician)"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Donald Johnson; MP for Carlisle (1955–1964)"]}, {"page": "Donald McIntosh Johnson", "response": ["#REDIRECT Donald Johnson (British politician)"]}, {"page": "Radical Action", "response": ["The organisation was founded in 1941 as the Liberal Action Group. It included some prominent members of the Liberal Party who disagreed with the war-time electoral pact in which the Liberals, Conservative Party and Labour Party agreed not to stand candidates against each other. Initially, its leading figures were Lancelot Spicer, Honor Balfour and Everett Jones, while Philip Fothergill became treasurer and Donald Johnson was the first chairman.Chris Cook, A Short History of the Liberal Party: 1900 - 2001, pp.268-269Peter Barberis, Encyclopedia of British and Irish Political Organizations, p.316"]}]}}