{"wiki_id": "http://www.wikidata.org/entity/Q5298462", "itemLabel": "Dorothy Howell", "itemDescription": "English composer and pianist", "wikipedia_url": "https://en.wikipedia.org/wiki/Dorothy_Howell_(composer)", "wikipedia_page": {"main": "Dorothy Gertrude Howell (25 February 1898 – 12 January 1982) was an English composer and pianist.", "link_mentions": [{"page": "Lamia (disambiguation)", "response": ["* Lamia, symphonic poem by English composer Dorothy Howell"]}, {"page": "1919 in music", "response": ["*Dorothy Howell – Lamia"]}, {"page": "Royal Academy of Music", "response": ["Former students include John Barbirolli, Judith Bingham, Harrison Birtwistle, Dennis Brain, Alan Bush, Doreen Carwithen, Rebecca Clarke, Jacob Collier, Clifford Curzon, Edward Gardner, Lesley Garrett, Evelyn Glennie, Eleanor Greenwood, Dorothy Howell, Katherine Jenkins, Elton John, Annie Lennox, Felicity Lott, Moura Lympany, Vanessa-Mae, Denis Matthews, Michael Nyman, Ashan Pillai, Simon Rattle, Arthur Sullivan, Eva Turner, Maxim Vengerov, Henry Wood and Carol Anne Williams"]}, {"page": "List of women composers by birth date", "response": ["* Dorothy Howell (1898–1982)"]}, {"page": "Lamia", "response": ["English composer Dorothy Howell composed a tone poem Lamia which was played repeatedly to great acclaim under its dedicatee Sir Henry Wood at the London Promenade concerts in the 1920s. It has been recorded more recently by Rumon Gamba conducting the BBC Philharmonic Orchestra for Chandos Records in a 2019 release of British tone poems."]}, {"page": "List of people from Birmingham", "response": ["*Dorothy Howell – Musician"]}, {"page": "Tobias Matthay", "response": ["Many of his pupils went on to define a school of 20th century English pianism, including York Bowen, Myra Hess, Clifford Curzon, Harold Craxton, Moura Lympany,  Irene Scharrer, Lilias Mackinnon, Guy Jonson, Vivian Langrish, Eileen Joyce, jazz \"syncopated\" pianist Raie Da Costa, Harriet Cohen, Dorothy Howell, and the duo Bartlett and Robertson. He taught many Americans, including Ray Lev, Eunice Norton, and Lytle Powell, and he was also the teacher of Canadian pianist Harry Dean, English composer Arnold Bax and English conductor Ernest Read."]}, {"page": "Lamia (poem)", "response": ["Poe's closing lines also echo several lines near the middle of \"Lamia\".Campbell, Killis. \"The Origins of Poe\", The Mind of Poe and Other Studies. New York: Russell & Russell, Inc., 1962: 154–155. The book Unweaving the Rainbow by Richard Dawkins takes its title from the above-quoted passage: it is an explicit attempt to demonstrate that this view of \"cold philosophy\" is incorrect and that science reveals, rather than destroys, the true beauty of the natural world. The poem also inspired symphonic poems by Edward MacDowell (1888)Edward MacDowell. Lamia, Op.29, score at IMSLP and Dorothy Howell (1918).Dorothy Howell. Lamia, score (Novello) at Music Sales"]}, {"page": "John Blackwood McEwen", "response": ["In 1898 McEwen accepted an invitation from  Sir Alexander Mackenzie, principal of the RAM, to become professor of harmony and composition. He held the post for the next 26 years. Among his students were the composers William Alwyn, Dorothy Howell and Priaulx Rainier. He was known as an exacting teacher, who emphasised discipline, but encouraged a liberal aesthetic outlook in his pupils.Obituary: Sir John McEwen\", The Manchester Guardian, 18 June 1948, p. 3"]}, {"page": "Society of Women Musicians", "response": ["The Society of Women Musicians was a British group founded in 1911 for mutual cooperation between women composers and performers, in response to the limited professional opportunities for women musicians at the time. The founders included Katharine Emily Eggar, a composer, Marion Scott, a musicologist, and Gertrude Eaton, a singer. 37 women came to the first meeting, held on 11 July 1911 at the Women's Institute, 92 Victoria Street, including Rebecca Helferich Clarke, Alma Haas, and Liza Lehmann, who later became the group's first president.Grove, SWM The first concert was held on 25 January 1912 in the small room of Queen's Hall.Concert Programmes.org Regular concerts followed at the same venue and at the Aeolian and Wigmore Halls. They featured premieres from women composers such as Ethel Barns, Rebecca Clarke, Katharine Eggar, Dorothy Howell, Liza Lehmann, Fiona McCleary (1900–1986), Marion Scott and Ethel Smyth. In later years there were also premieres from Ruth Gipps, Elisabeth Lutyens, Elizabeth Maconchy and Elizabeth Poston."]}, {"page": "Howell (name)", "response": ["*Dorothy Howell (composer) (1898–1982), British composer and pianist", "*Dorothy Howell (screenwriter), (1899–1971), American screenwriter", "*Dorothy Howell Rodham (born 1919), American political matriarch"]}, {"page": "Marius Stravinsky", "response": ["Stravinsky's discography includes world premiere recordings of Ignaz Brüll’s Violin Concerto and Symphony in E minor, Salomon Jadassohn’s Symphony No.1, and Pavel Pabst’s Piano Concerto, on the Cameo Classics Label.  During his tenure as Chief Conductor & Artistic Director, Stravinsky also released recordings of major works by Maurice Blower, Dorothy Howell, Joseph Holbrooke and Sergey Zhukov with the Karelia Philharmonic Orchestra."]}, {"page": "Places of worship in Malvern, Worcestershire", "response": ["Notable people in cemetery: Edward Elgar, English composer; Dorothy Howell, English composer"]}, {"page": "Antoinette Kirkwood", "response": ["Antoinette Kirkwood (26 February 1930 - 28 January 2014) was an English composer born in London.  She studied piano and composition with Dorothy Howell at the Royal Academy in London and often accompanied her mother, who was a lieder singer. For four years beginning in 1969, she was a member of  the Executive Committee of the Composers’ Guild of Great Britain, now the British Association of Composers and Songwriters. Radio Éireann broadcast her Symphony, op 8, composed in 1953. This “very notable achievement” established that Kirkwood “can write a memorable tune in a definite key” that will captivate the listener"]}, {"page": "List of music students by teacher: G to J", "response": ["===Dorothy Howell==="]}, {"page": "British Symphony Orchestra", "response": ["However, the series of concerts of the British Symphony Orchestra had to be abandoned owing to lack of support. Roze's final concert with the orchestra took place at the Queen's Hall on 23 February 1920.  The players \"gave an excellent performance of Hubert Bath's symphonic poem The Vision of Hannele [1913], perhaps the best of his more ambitious works.\" The concert also included Two Dances by Dorothy Howell."]}, {"page": "1920 in British music", "response": ["*Dorothy Howell – Two DancesMike, Celia, \"Howell, Dorothy\", in The Norton/Grove Dictionary of Women Composers (Julie Anne Sadie and Rhian Samuel, eds.).  The MacMillan Press (London & Basingstoke), p. 231 (1994, )."]}, {"page": "Dorothy Howell", "response": ["Dorothy Howell may refer to:", "* Dorothy Howell (composer) (1898–1982), English composer and pianist", "* Dorothy Howell (screenwriter) (1899–1971), American screenwriter"]}, {"page": "List of women classical pianists", "response": ["*Dorothy Howell (1898–1982), composer and pianist"]}]}}