{"wiki_id": "http://www.wikidata.org/entity/Q5292506", "itemLabel": "Don Dearson", "itemDescription": "Welsh footballer (1914-1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/Don_Dearson", "wikipedia_page": {"main": "Donald John Dearson (13 May 1914 – 24 December 1990) was a Welsh footballer who won three caps for his country and played in the Football League for Birmingham (renamed Birmingham Cty in 1943), Coventry City and Walsall.", "link_mentions": [{"page": "Barry Town United F.C.", "response": ["|DF|| Don Dearson"]}, {"page": "Ynysybwl", "response": ["* Don Dearson -  Footballer, Welsh international"]}, {"page": "1990–91 in English football", "response": ["24 December 1990 – Don Dearson, 76, played 131 league games for Birmingham City during a career which was disrupted by the Second World War, before spending the final few seasons of his career with Coventry City and Walsall."]}, {"page": "1990 in Wales", "response": ["**Don Dearson, footballer, 76"]}, {"page": "Ken Leek", "response": ["Leek was born on 26 July 1935 in Ynysybwl, South Wales, where he lived next door to Birmingham City and future Welsh international footballer Don Dearson. He attended two rugby-playing schools before taking up football himself at the age of 14. He also spent two years in national service."]}, {"page": "List of Walsall F.C. seasons", "response": ["|Don Dearson"]}, {"page": "James Bye (footballer)", "response": ["Bye was born in 1920 in the Aston district of Birmingham, the son of Arthur Bye and his wife Lillian née Featherstone, and attended St Peter's School in Harborne. He played youth football for Bournbrook Alliance, from where he signed amateur forms with Birmingham as a 14-year-old. He played for Shirley Juniors, a team \"fostered\" by Birmingham's vice-chairman, David Wiseman, before turning professional with Birmingham \"immediately on reaching 17\". He played for the youth team and for the Central League side before making his senior debut in the FA Cup third-round tie against Halifax Town on 7 January 1939, standing in at right half for the injured Don Dearson. Birmingham won 2–0. He made his first appearance in the First Division three weeks later, in a 5–0 defeat away to Preston North End, and played in the first three games of the 1939–40 Football League season, which was then abandoned when the Second World War started."]}, {"page": "1945–46 Birmingham City F.C. season", "response": ["!scope=\"row\"| Don Dearson"]}, {"page": "1938–39 Birmingham F.C. season", "response": ["Thirty-two players made at least one appearance in nationally organised first-team competition, and there were fifteen different goalscorers. Half-back Don Dearson played in 42 of the 46 matches over the season, and Fred Harris was the leading scorer with 17 goals, of which 14 were scored in the league. Harry Morris, son of the Harry Morris who played for the club in the 1880s and was a member of the board of directors for nearly 30 years, took over as chairman from Howard Cant.", "Birmingham began the 1939–40 Football League season in the Second Division, but the onset of the Second World War caused the League to be abandoned after three Second Division matches had been played. They fielded the same eleven for all three matches: Harry Hibbs, Cyril Trigg, Billy Hughes, James Bye, Arthur Turner, Ray Shaw, Jackie Brown, Don Dearson, Ted Duckhouse, Fred Harris and Tom Farrage. Farrage was killed in action in September 1944, serving as a private in the 10th Battalion, the Parachute Regiment during Operation Market Garden."]}, {"page": "1937–38 Birmingham F.C. season", "response": ["Twenty-four players made at least one appearance in nationally organised competition, and there were thirteen different goalscorers. Half-back Norman Brunskill played in 37 of the 43 matches over the season, and full-back Cyril Trigg, half-back Dai Richards, and forwards Don Dearson and Frank White played in 36. Dearson and Charlie Wilson Jones were joint leading scorers with nine goals, all scored in the league. This was the last season under the chairmanship of Howard Cant, who first took office in 1911. He was succeeded by Harry Morris, son of the former player and director, also called Harry Morris."]}, {"page": "1939–40 Birmingham F.C. season", "response": ["Birmingham began the 1939–40 Football League season in the Second Division, but the onset of the Second World War caused the League to be abandoned after three rounds of Second Division matches had been played. They fielded the same eleven for all three matches: Harry Hibbs, Cyril Trigg, Billy Hughes, James Bye, Arthur Turner, Ray Shaw, Jackie Brown, Don Dearson, Ted Duckhouse, Fred Harris and Tom Farrage. Farrage was killed in action in September 1944, serving as a private in the 10th Battalion, the Parachute Regiment during Operation Market Garden. With two wins and a draw, they stood second in the table, behind Luton Town on goal average.", "!scope=row|Don Dearson"]}]}}