{"wiki_id": "http://www.wikidata.org/entity/Q5301775", "itemLabel": "Douglas Macmillan", "itemDescription": "British civil servant and charity founder", "wikipedia_url": "https://en.wikipedia.org/wiki/Douglas_Macmillan", "wikipedia_page": {"main": "Douglas Macmillan MBE (10 August 1884 – 9 January 1969) was a British civil servant, and founder of the Macmillan Cancer Support charity, now one of the largest charities in the UK.\n\n", "link_mentions": [{"page": "Sidcup", "response": ["*Douglas Macmillan (1884–1969), founder of Macmillan Cancer Support, lived in Knoll Road from 1924 until 1966, and also ran his charity from that address. Bexley Civic Society placed a blue plaque on the house in 2010"]}, {"page": "Pimlico", "response": ["*Douglas Macmillan, founder of Cancer Relief – lived at 15 Ranelagh Road"]}, {"page": "Castle Cary", "response": ["Notable people from the town include the 18th-century diarist James Woodforde who was curate between 1765 and 1775 and Douglas Macmillan, founder of the Macmillan Cancer Relief charity.  The Macmillan Way walking trail passes through the town."]}, {"page": "Macmillan Cancer Support", "response": ["The charity was founded 1911 as the Society for the Prevention and Relief of Cancer, by Douglas Macmillan following the death of his father from the disease. In 1924, the name was changed to the National Society for Cancer Relief, which it retained until 1989 when it was changed to Cancer Relief Macmillan Fund by the ladies, later changed again to Macmillan Cancer Relief. From 5 April 2006, Macmillan Cancer Relief became known as Macmillan Cancer Support, as this more accurately describes its role in supporting people who have cancer. It has adapted the principles of being a \"source of support for everyone\" and a \"force for change in the world\".", "Douglas Macmillan was a vegetarian. In 1909, he wrote an open letter to all Christians entitled Shall We Slay which encouraged orthodox Christians to consider vegetarianism."]}, {"page": "Andy Wilkinson", "response": ["Born in Stone, Wilkinson grew up supporting his local side Stoke City. He attended Alleyne's High School from 1997 to 2000. His mother Carolyn worked as a nurse for Douglas Macmillan and his brother Gareth is a solicitor. He has a daughter, Eva and a son, William. Wilkinson married his fiancé Emma on 25 May 2011 at local church of Whitmore parish."]}, {"page": "1884 in the United Kingdom", "response": ["* 10 August – Douglas Macmillan, founder of Macmillan Cancer Support (died 1969)"]}, {"page": "Sidcot School", "response": ["*Douglas Macmillan, British civil servant, and founder of the Macmillan Cancer Support charity."]}, {"page": "Sexey's School", "response": ["*Douglas Macmillan, founder of Macmillan Cancer Support."]}, {"page": "Douglas MacMillan", "response": ["#REDIRECT Douglas Macmillan"]}, {"page": "Wymondham High Academy", "response": ["* Macmillan: Named after Douglas Macmillan, founder of Macmillan Cancer Support. House colour: red."]}, {"page": "List of people from the London Borough of Bexley", "response": ["*Douglas Macmillan (1984–1969), founder of Macmillan Cancer Support, lived in Knoll Road, Sidcup, from 1924 until 1966, and also ran his charity from that address. Bexley Civic Society placed a blue plaque on the house in 2010."]}]}}