{"wiki_id": "http://www.wikidata.org/entity/Q5301032", "itemLabel": "Doug Wright", "itemDescription": "English Test and County cricketer (1914-1998)", "wikipedia_url": "https://en.wikipedia.org/wiki/Doug_Wright_(cricketer)", "wikipedia_page": {"main": "Douglas Vivian Parson Wright (21 August 1914 – 13 November 1998), better known as Doug Wright, was an English cricketer. A leg-spinner for Kent and England from 1932 to 1957 he took a record seven hat-tricks in first-class cricket. He played for Kent for 19 seasons and was their first professional captain from late 1953 to 1956. Don Bradman said he was the best leg-spinner to tour Australia since Sydney Barnes, and Keith Miller thought he was the best leg-spinner he had seen apart from Bill O'Reilly. He toured Australia in 1946–47 and 1950–51, but was dogged by ill-luck and was considered to be the \"unluckiest bowler in the world\".\n\nCutting a leg-break is always dangerous, and cutting Wright is a form of suicide. Why a bowler of his skill failed to get more test-match wickets always mystified me; there was of course the marked tendency to bowl no-balls, but he sent down so many good ones, and worried and beat the batsmen so often, that he should have had better results...he seemed always likely to get wickets. It is one of the toughest problems of captaincy to know when to remove a man like that from the firing-line.\nJohnnie Moyes", "link_mentions": [{"page": "August 21", "response": ["*1914 – Doug Wright, English cricketer and coach (d. 1998)"]}, {"page": "Sidcup", "response": ["* Doug Wright (1914–98), cricketer (Kent and England), born in Sidcup"]}, {"page": "Colin Cowdrey", "response": ["Ramadhin was forced to bowl a heart-breaking 98–35–179–2, the most overs by a bowler in a first-class innings and was never the same force again. May declared on 583/4, setting the West Indies 286 to win in 60 overs and they narrowly avoided defeat, ending the match on 70/7. After this England won three Tests by an innings to take the series 3–0, with Cowdrey making back to back centuries with his 152 in the Second Test at Lords after coming in at 34/3, 55 in the Third at Trent Bridge and 68 in the Fourth at Headingley. He finished with 435 runs (72.50), the first time he had averaged over 36 in a Test series. This was the year that he took over from Doug Wright as the captain of Kent with Les Ames as the manager, although it would be ten years before the county reaped the rewards. "]}, {"page": "1947 in sports", "response": ["* Most wickets – Doug Wright 51 @ 33.31 (BB 7–105)First-Class Bowling in Australia 1946–47 (ordered by wickets)"]}, {"page": "Wisden Cricketers of the Year", "response": ["|  Doug Wright"]}, {"page": "1939 in sports", "response": ["* Wisden Cricketers of the Year – Learie Constantine, Bill Edrich, Walter Keeton, Brian Sellers, Doug Wright"]}, {"page": "Keith Miller", "response": ["Miller made his Ashes debut in the first Test in Brisbane. Bradman opted for six front-line bowlers, with Miller as high as number five in the batting order.Perry, p. 186. Australia batted first, with Miller coming in at 3/322.Pollard (1988), p. 381. He played aggressively to reach his fifty in just 80 minutes, striking a six onto the roof of the members' stand at long on, the biggest hit at the ground at the time, before being trapped leg before wicket by Doug Wright for 79 as Australia made 645.Perry, p. 188.Whitington, p. 112. Miller was given the new ball along with Lindwall and he took his first Ashes wicket, bowling Hutton as England closed at 1/21. The following day, the pitch had turned into a sticky wicket following a heavy tropical storm. Miller bowled off breaks at medium pace and mixed in a large amount of bouncers.Perry, p. 189.  On the unpredictable surface, Edrich was struck around 40 times on the body. Miller cut through the English top order, removing Edrich, Washbrook, Compton and Jack Ikin on the fourth morning, finishing with 7/60 as England made 141 and were forced to follow on. Miller took two wickets, including the dismissal of Hutton with first ball of the second innings as England fell to defeat by an innings and 334 runs and Miller had match figures of 9/77.Perry, p. 191.Whitington, pp. 112–113.", "England had started the Third Test at Sydney strongly. Australia took its first wicket when Miller caught Washbrook from Johnson with a horizontal diving catch at slip. England were still in control at 1/128 when Miller came on to bowl.Perry, p. 295. He removed Hutton and Reg Simpson before bowling Compton for a duck. In the space of four overs from Miller, England were now 4/137. Miller had contributed to all four wickets. Miller ended with 4/37 as England were bowled out for 290 on the second day. Miller batted patiently on the third day, reaching 96 by stumps with Australia at 6/362. The next day, with his century four runs away, Miller arrived late, leaving his batting partner Johnson waiting at the players' gate.Perry, p. 296. Miller progressed to 145 not out despite the interruption. It has been a patient innings by his standards, taking almost a day.Whitington, pp. 204–205. England collapsed for 123, leaving Australia to take an innings victory.Perry, pp. 296–297. In the first innings of the Fourth Test in Sydney, Miller scored 44 and did not take a wicket, but he was heading for consecutive Test centuries in the second innings. He reached 99 when a leg break from Doug Wright spun across him and clipped the off bail.Perry, p. 299. The innings helped Australia to set England a target of 503. Miller took 3/27 on the final day, helping to cut through the middle order as Australia won by 274 runs.Perry, p. 300.Pollard (1990), p. 43.Whitington, p. 206. Miller was out for seven and a duck in the Fifth Test at the MCG. He took 4/76 in the first innings, joining Lindwall in cutting down the middle order, despite which England won by eight wickets.Pollard (1990), p. 44. Miller topped the Test batting averages with 350 runs at 43.75,Pollard (1990), p. 45. and for the entire first-class season, he scored 1332 runs at 78.35, the highest among all comers. His bowling was also strong, with 17 wickets at 17.70, second only to Jack Iverson (21 wickets at 15.23). However, an attack by Morris (182) and Miller (83) in a Shield match dispirited Iverson, and he never played Test cricket again.Perry, p. 301.Pollard (1990), p. 46."]}, {"page": "Kent County Cricket Club", "response": ["The rebuilding of the side continued under David Clark's captaincy – Clark would later become chairman the club. Colin Cowdrey, the first man to play 100 Test matches made his Kent debut in 1950 and was appointed captain in 1957, following Doug Wright who was the first professional to captain Kent. Wright took over 2,000 wickets with his brisk leg breaks and googlies between 1932 and 1957 and became the only player to take seven hat-tricks – six of them taken for Kent.Doug Wright, Obituary, Wisden Cricketers' Almanack, 1999. Retrieved 2018-10-24.", "As part of the redevelopment of Kent's home ground, the St Lawrence Ground in Canterbury, the county planned to develop a \"legends' walkway\" at the entrance to the ground.Kent cricket joins forces with KRNM for the Legends' Walkway , Kent County Cricket Club, 2011-01-14. A public vote was held to select 12 former players of the club to honour in the walkway. The 12 players were named in June 2011. They included Alfred Mynn, who played for the county in the 19th century, Les Ames, Colin Blythe, Tich Freeman and Frank Woolley from the first half of the 20th century, Godfrey Evans and Doug Wright from the 1930s–50s era, and Colin Cowdrey, Alan Knott, Brian Luckhurst, John Shepherd and Derek Underwood from the teams of the 1960s and 70s.Kent cricket announce Legends' Walkway results , Kent County Cricket Club, 2011-06-02. Retrieved 2016-06-15.Top 12 for the Legends' Walkway..., Canterbury Times, 2011-06-03.Retrieved 2016-06-15. The first bricks were produced for the walkway in April 2012First Legends' Walkway bricks produced, Kent County Cricket Club, 2012-04-26. Retrieved 2016-06-15. although they were removed during development of the ground in 2017–18 and moved adjacent to the Nackington Road entrance."]}, {"page": "Walter Robins", "response": ["As a selector in 1948, Robins was involved in two controversial decisions: the dropping of Hutton for the third Test of the 1948 series against Australia, and the omission of Doug Wright from the fourth Test of the same series. Hutton was dropped on the grounds that he had displayed deficiencies against the pace of the Australian bowlers Ray Lindwall and Keith Miller. His replacement was the Gloucestershire batsman George Emmett, who scored 10 and 0 in the match; Hutton was speedily reinstated. Wright's omission from the Leeds Test, which deprived England of the services of their leading spinner probably, in the view of the cricket historian Simon Wilde, cost them victory in the match."]}, {"page": "Norman Yardley", "response": ["England adopted an aggressive strategy in the second Test, but could not avoid a second defeat. Yardley frequently changed his bowlers to unsettle the Australians in their first innings, and took two for 35 himself as England briefly held the advantage.Bowes, p. 189. However, the lower order batsmen mounted a recovery, Yardley being criticised for his reluctance to bowl Doug Wright. The England captain then arrested a batting collapse by adding 87 with Denis Compton, scoring 44 himself, but Australia led by 135 on first innings. Yardley took two wickets in two balls in Australia's second innings, narrowly missing a hat-trick when Keith Miller only just got his bat down on the ball to avoid being bowled, and had figures of two for 36, but Australia scored 460 for seven and bowled England out for 186. In between Tests, Yardley scored his only century of the season, but his contributions to the third Test were minimal. He scored 22 and bowled four wicketless overs. However, the home side fought back in the match, for which Len Hutton was dropped. England scored 363 and bowled out Australia for 221. They scored 174 for three before declaring, but rain intervened to prevent Yardley pushing for a win."]}, {"page": "Freddie Brown (cricketer)", "response": ["In the second Test at the Melbourne Cricket Ground, Australia were dismissed for 194 and England were reduced to 54/5 before Brown came in to top-score with 62 in England's 197. He won the crowd over with this innings, especially when he hit Ian Johnson straight down the ground for six and through the covers for four. He bowled well and took 4/26 as Australia were out for 181, but England could only score 150 as the hosts won by 28 runs to take a 2–0 lead in the series.Fingleton, pp. 100–117. In the third Test, Brown made his highest Test score of 79 with another defiant innings after England had been reduced to 137/4. Injuries to Bailey and Doug Wright seriously depleted England's bowling and Brown had to bowl 44 overs to support Bedser and debutant John Warr. He took a commendable 4/153 as Australia totalled 426 before bowling England out again to win the match by an innings and secure the series victory.Fingleton, pp. 141–146."]}, {"page": "Bernard Fitzalan-Howard, 16th Duke of Norfolk", "response": ["The announcement that the Duke would manage the MCC cricket team in Australia in 1962–63 came as a complete surprise. He was a keen cricketer, who was President of the MCC in 1956–57 and was still a member of its powerful committee. He had managed his own tour of the West Indies with a Duke of Norfolk's XI in 1956–67, which had included the England players Tom Graveney, John Warr, Doug Wright and Willie Watson, and would organise another in 1969–70."]}, {"page": "St Lawrence Ground", "response": ["Cricketing feats to have taken place on the ground include the first triple century scored in top-class cricket, by WG Grace in 1876 playing for the MCC against Kent.Rajesh S (2010) An early pioneer, CricInfo, 2010-08-02. Retrieved 2018-03-30. As of 2018 it remains the only triple century to have been scored on the ground.Batting records, Kent County Cricket Club Annual 2017, p.183–196. Canterbury: Kent County Cricket Club. Kent leg-spinner Doug Wright took his seventh first-class hat-trick on the ground in 1949, a world record that remains to this day. Six of Wright's hat-tricks were taken while playing for Kent, although only the last was taken on the ground.Easterbrook B (1969) The heritage of our cricket grounds, Wisden Cricketers' Almanack, 1969. Retrieved 2017-05-19.Robertson D (2014) A Special Centenary – Doug Wright, Kent County Cricket Club, 2014-08-18. Retrieved 2018-03-30.Hat-tricks, Bowling Records, Kent County Cricket Annual 2017, p.199. Canterbury: Kent County Cricket Club."]}, {"page": "Neil Harvey", "response": ["His next match for Victoria was against Wally Hammond's English tourists. After the fall of three early wickets, Harvey joined captain Lindsay Hassett. He dominated a partnership of 120, making 69 in his second match against the guileful leg spin of Doug Wright. His opponents had no doubt that he would become a Test player. English wicket-keeper Godfrey Evans congratulated him by proclaiming \"We'll be seeing you in England next year [for Australia's 1948 tour of that country]\". He ended his debut first-class season with 304 runs at 50.66."]}, {"page": "Vinoo Mankad", "response": ["Mankad was included in the India squad that toured England in 1946. Leading up to the First Test of the three-match series, he had played 11 first-class games on the tour averaging 20.9 with the bat and 14.2 with the ball, having picked 44 wickets, the best for India thus far as a bowler. He made his debut at the Lord's opening the batting for India before being bowled out for 14 by England spinner Doug Wright. After \"long spells of bowling\" in England's first innings, Mankad top-scored for his team with 67 in the second innings. India went on to lose the match by ten wickets. However, Wisden wrote in praise of Mankad calling him a \"valuable all-round player\" alongside teammates Lala Amarnath and Vijay Hazare. Former England Test cricketer Patsy Hendren rated Mankad as India's \"best all-rounder\". In the Second Test in Manchester, Mankad claimed a five-wicket haul in England's first innings. He contributed 42 with the bat and picked two wickets in a drawn cause in the final Test at the Oval. Mankad completed the tour with a double of a thousand runs and hundred wickets, the first tourist to achieve the feat since Learie Constantine of the West Indies in 1928. He finished with 1,120 runs at 28.00 and 129 wickets at 20.76 apiece. John Arlott wrote of him: \"From his first over in England, Mankad was a good slow left-hander. By the end of the tour, there is little doubt that he was the best slow left-arm bowler in the world.\" Wisden chose him as one of its five Cricketers of the Year."]}, {"page": "Ray Lindwall", "response": ["In the Fourth Test at Adelaide Lindwall came the closest to a hat-trick in his entire Test career. He finished England's innings by clean bowling three batsmen in four deliveries,Pollard (1988), p. 387. with the unsuccessful ball barely missing Doug Wright's stumps to end with 4/52. Lindwall took the last four wickets in two overs, conceding two runs. He took 2/60 and scored 20 in another drawn match. Lindwall came into the final Test on his home ground in Sydney with a match haul of 10/73 in a Shield match. He continued his productive series with 7/63 in the first innings on a flat pitch, managing to generate enough pace to knock the bat out of Denis Compton's hands.Perry (2001), p. 221. Lindwall took two further wickets in the second innings as Australia took a 3–0 series win with another innings victory. Lindwall topped the bowling averages on either side with 18 wickets at 20.38,Pollard (1988), p. 389. in addition to his 160 runs at 32.00."]}, {"page": "Australian cricket team in England in 1948", "response": ["In contrast, Australia's batsmen had relatively little difficulty against the hosts' attack. England's bowling was largely reliant on Alec Bedser and against a powerful Australian batting line-up he managed only 18 wickets at 38.22. Alec Coxon, Dick Pollard, Edrich, Barnett and Yardley provided his seam support. Jim Laker, Jack Young, Eric Hollies and Doug Wright were the spinners in action. Bedser was the only English bowler to take more than nine wickets. Morris led the runscoring and century-making with 696 runs at 87.00 and three triple-figure scores, supported by Bradman (508 at 72.57) and Barnes (329 at 82.25). With the first three batsmen in such form, Australia regularly made strong starts to their innings, averaging more than 120 for their first two wickets."]}, {"page": "Stan McCabe", "response": ["Despite Hammond's best attempts, McCabe was able to gain the strike and runs came quickly. McCabe reached his century in 140 minutes and England declined to take the new ball while he was batting. By lunch, he and Barnett had added 67 in only 50 minutes, although the latter had made only 20 of these; the total was 6/261, with McCabe on 105. Having reached his century, McCabe lifted his scoring rate, scoring his last 132 runs in 95 minutes. Boundaries came much more readily and he took 44 runs from a three over spell by leg spinner Doug Wright. As he ran out of partners, he became more aggressive; in the last ten overs of his innings, he took 80% of the strike and hit 16 boundaries. He was the last man out, attempting to loft the spin of Verity, after a final wicket partnership with Leslie Fleetwood-Smith of 77 in 28 minutes, of which he scored 72. He finished with 232 from 235 minutes with 34 boundaries and one six, an innings in which Bradman summoned his players not to miss a ball, as \"they would never see anything like it again.\" Bradman later said that McCabe \"held us all spellbound\",Whitington, p. 253. and it was reported that the Australian captain trembled while watching the innings. While McCabe was at the crease, his partners contributed a total of only 58 runs, meaning that he had outscored them by a ratio of 4:1. Upon his return to the pavilion Bradman greeted him with the words: \"If I could play an innings like that, I'd be a proud man, Stan\". This has also been reported as Bradman saying \" I wish I could bat like that\". Bradman later wrote that \"Towards the end [of McCabe's innings] I could scarcely watch the play. My eyes filled as I drank in the glory of his shots\". It was regarded by English captains Arthur Gilligan and Bob Wyatt to be the best innings that they had ever witnessed, as did former England bowler Sydney Barnes—regarded as one of the best of all time—who said that he would not have been able to stop McCabe.McHarg, p. 56.  Neville Cardus said that the innings was one of the greatest in Test history.Harte and Whimpress,  p. 377. Wisden reported that McCabe played \"an innings the equal of which has probably never been seen in the history of Test cricket; for the best part of four hours he maintained a merciless punishment of the bowling\". McCabe's biographer Jack McHarg said that the innings “was a sort of encyclopedia of attacking batsmanship, a triumph of character, technique and judgement”.McHarg, p. 50. Cardus said"]}, {"page": "Don Tallon", "response": ["Tallon now felt secure about his place in the team for the rest of the series. This led to increased confidence in his play in the Third Test at Melbourne (MCG). After keeping tidily and scoring 35 in the first innings, Tallon combined with Ray Lindwall in the second innings for a 154-run partnership in just 92 minutes. Described by Wisden as a \"hurricane\", the partnership was marked by Tallon's powerful driving and cutting.Piesse, p. 150. Lindwall reached his century, but Tallon fell for 92 to Doug Wright. Tallon's 92 remained the highest score by an Australian wicketkeeper until Rod Marsh equalled it with 92 not out in the 1970–71 Ashes series and surpassed it with 132 against New Zealand in 1973–74.p190, Richard Whitington, Captains Outrageous? Cricket in the seventies, Stanley Paul, 1972"]}, {"page": "List of Test cricketers", "response": ["Doug Wright ·"]}, {"page": "Aubrey Faulkner", "response": ["In 1925, Faulkner started a cricket school in London called the Faulkner School of Cricket, the first of its kind, and was credited with shaping some future Test players, including Doug Wright, Ian Peebles and Denis Tomlinson. The school was in a cramped reformed garage with poor electric light bulbs. Faulkner did not discriminate in his school based on class or upbringing, giving every student the same attention level. In 1926, his book Cricket: Can it be Taught? was published. The school was never a financial success even though Faulkner would work seven days a week due to his reluctance to charge more, but it did achieve worldwide fame."]}, {"page": "Merv Harvey", "response": ["In the first match of the season, Harvey's Victorians faced the touring England cricket team led by Wally Hammond.Coleman, p. 560. In the first innings, Harvey made 21 of the team's 189 before being caught and bowled by leg spinner Doug Wright. He then made 57 before being dismissed by Alec Bedser as the hosts fell for only 204 in pursuit of 449 for victory, losing by 244 runs."]}, {"page": "Len Wilkinson", "response": ["On the tour, there were three more senior spinners than Wilkinson: Tom Goddard, Hedley Verity, and Doug Wright. Despite this, Wilkinson debuted in the first Test of the series, being chosen ahead of Wright to play against South Africa alongside Verity and Goddard. He was the fifth bowler England used, turned to ahead of Goddard, and finished with match figures of 2/111. Retrieved on 17 December 2008. Wilkinson did not play the second Test, but played in the third and fourth, finishing with match figures of 4/115 Retrieved on 17 December 2008. and 1/45 Retrieved on 17 December 2008. respectively on pitches that were considered perfect for batting. Although the selectors lost confidence in Wilkinson's bowling after he managed seven wickets at 38.71 in Tests, he finished the tour top of the bowling averages with 44 wickets at an average of 18.86."]}, {"page": "Roly Jenkins", "response": ["Roly Jenkins (24 November 1918 – 22 July 1995) was an English cricketer, almost exclusively for Worcestershire County Cricket Club as a leg spinner in the period immediately after World War II. Along with Doug Wright and Eric Hollies, Jenkins was a star of the last generation of English leg-spinners before a more defensive mindset, followed by the advent of one-day cricket, all but killed off home grown wrist spinners."]}, {"page": "Bob Berry (cricketer)", "response": ["By the end of the 1950 season, Berry was not even first-choice left-arm spinner for Lancashire, his long-time friend Malcolm Hilton being often preferred as the spin alternative to the off-spin of Roy Tattersall. Hilton was reckoned as the more devastating bowler on a turning wicket, and could also bowl flatter and faster than Berry, which meant that he was at times used to open the bowling. Berry was known for flight and spin, but was also inclined to be more expensive than Hilton. Nonetheless, it was Berry who was picked for the 1950–51 Marylebone Cricket Club (MCC) tour to Australia and New Zealand under Freddie Brown. He had a poor tour on pitches not designed for spin and was not chosen for any of the Test matches, with Doug Wright being preferred. Hilton was picked for the 1951–52 tour to India, and Berry did not play Test cricket again."]}, {"page": "Fred Ridgway", "response": ["Though in 1948 he was badly affected by injury, 1949 proved to be Ridgway's best year, for he took 105 wickets for 22.88 runs each, which ranked him as the fourth-best pace bowler in the country after Bedser, Gladwin and Les Jackson. Ridgway's most notable performance was on the featherbed Trent Bridge wicket, where he took six for 79 in the first innings, and paved the way for an easy Kent victory. Apart from teammate Doug Wright in the second innings, no visiting bowler at Trent Bridge bettered those figures all year, but Ridgway's most notable feat that year was his striking consistency: with only one haul of eight or more in a match he still took 90 wickets in 20 county games. Moreover, playing against Sussex,Cricketarchive.com Ridgway \"shared in a record partnership of 161 for the ninth wicket\" with Brian Edrich.Cricketarchive.com This partnership, just under half the total of 379, was made in a losing cause."]}, {"page": "Tommy Greenhough", "response": ["After the retirement of Doug Wright, Eric Hollies and Roly Jenkins, together with the disappearance from the county scene of Bruce Dooland and Gamini Goonesena, Greenhough stood as the last county leg spinner of any standing in an era when overgrassed pitches and bowling tactics changing rapidly from the enterprising attack of the 1940s to rigid containment rapidly removed this style of bowling from prominence.Wellings, E.M.; “Googly Bowlers and Captains Retire” Greenhough had nothing like the spin of Wright or Jenkins, but could disguise his googly exceptionally well, although he bowled from a quite long run-up for a slow bowler. During 1959 and 1960, Greenhough formed an extremely valuable complement to Brian Statham – at the time probably the greatest post-war English bowler – but for the remainder of his career a succession of injuries, and form lapses, prevented him reaching the potential those two seasons suggested."]}]}}