{"wiki_id": "http://www.wikidata.org/entity/Q5307277", "itemLabel": "Drew Rutherford", "itemDescription": "Scottish footballer (1953-2005)", "wikipedia_url": "https://en.wikipedia.org/wiki/Drew_Rutherford", "wikipedia_page": {"main": "Drew Rutherford (4 October 1953 – 14 December 2005) was a professional footballer who played most of his career for St Johnstone F.C.\nAlthough Edinburgh-born, Rutherford lived most of his life in Fife and started his professional career at East Fife. After four years with the Methil club, he signed for St Johnstone which was where he remained for most of his playing days.\nPlaying in the centre of defence for St Johnstone over a span of nine seasons, he set a record for most appearances. This record stood until 2009, when it was surpassed by goalkeeper Alan Main. Rutherford was also club captain and a popular player with the club's supporters. His time at Perth began in February 1977 and he made a total of 342 appearances (plus five as a substitute) before leaving the club in May 1985. Despite being a defender, he managed 18 goals for St Johnstone.\nAfter leaving St Johnstone he had a short spell with another Fife club, Cowdenbeath, before retiring from the game.\nRutherford was held in such high regard by St Johnstone fans that, despite twenty years having passed since his time at the club, a benefit night was organised to raise funds after hearing of his illness. Although Rutherford himself was too ill to attend, his family was represented along with many of his former teammates.\nRutherford died in 2005 from cancer.", "link_mentions": [{"page": "Alan Main", "response": ["Despite turning 41 in 2008, Main was still the number-one keeper for St Johnstone going into 2009. In April 2009, he overtook Drew Rutherford to become the player with the most appearances for the club. He also signed a one-year contract extension until May 2010, making him a part of the squad promoted back to the Scottish Premier League for the first time in seven years. At 42, Main was the oldest registered player in the Scottish Premier League during the 2009–10 season."]}, {"page": "Andrew Rutherford", "response": ["* Drew Rutherford (1953–2005), footballer"]}]}}