{"wiki_id": "http://www.wikidata.org/entity/Q5304569", "itemLabel": "Dr Zeus", "itemDescription": "Punjabi singer and music producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Dr_Zeus", "wikipedia_page": {"main": "Baljit Singh Padam (Punjabi: ਬਲਜੀਤ ਸਿੰਘ ਪਦਮ), better known by his stage name Dr. Zeus, is a British Indian music composer, singer and music producer. He rose to fame in 2003 with his song \"Kangna\", which was voted the best song on BBC Asian Network in the same year. His other hits are \"Don't Be Shy\" and \"Jugni Ji\", which won the best single award in 2012. He has worked with singer Kanika Kapoor for the song \"Jugni Ji\" and with musician Jaz Dhami for the song \"Zulfa\". His song \"Aag Ka Dariya\" features on the Four Lions film soundtrack. A music video was also produced featuring Czech model Yana Gupta and singers Ravindra & DJ Shortie.", "link_mentions": [{"page": "List of Punjabi singers", "response": ["* Dr Zeus"]}, {"page": "Hunterz", "response": ["Hunterz performed at the University of Sheffield on 8 February 2010, along with Imran Khan, Veronica and Dr Zeus. In the promotion for this performance, he gave an interview on BBC Radio Sheffield, where he officially announced that his new upcoming album in 2010 will be in collaboration with Rishi Rich."]}, {"page": "Snoop Dogg discography", "response": ["|Dr Zeus, Zora Randhawa, Nargis Fakhri"]}, {"page": "Moseley School", "response": ["*Dr Zeus (MS), singer"]}, {"page": "Dr. Zeus", "response": ["#REDIRECT Dr Zeus"]}, {"page": "Baljit Singh", "response": ["*Dr Zeus (Baljit Singh Padam), Bhangra musician from the UK"]}, {"page": "List of bhangra artists", "response": ["*Dr Zeus"]}, {"page": "UK Asian Music Awards", "response": ["*Best Producer: Dr Zeus"]}, {"page": "Jaz Dhami", "response": ["* 2013: Zulfa ft. Dr Zeus", "* 2014: Zulfa Reprise ft. Dr Zeus", "* 2015: Beparwaiyan Refix ft. Dr Zeus & Fateh"]}, {"page": "Ravi Apnabeat", "response": ["In December 2011 Apnabeat launched a radio show on ALL FM. The show specialises in Asian / Bhangra music with interviews with celebrities from the music scene. Guests on the show have included Bhangra singers H-Dhami, Shin from DCS (Band), Panjabi Hit Squad, Dr Zeus, Panjabi MC, Bhinda Jatt, and Sukh the director of the Simply Bhangra website."]}, {"page": "Desi hip hop", "response": ["Desi hip hop has crossed paths with Western hip-hop multiple times, notably when musicians from both sides of the world collaborate. American rapper Snoop Dogg has worked with different artists such as rapper Dr Zeus Bohemia (rapper), and the band RDB. Bohemia also collaborated with hip-hop artists such as Kurupt, Sean Kingston, Iraj Weeraratne and Baby Bash & The Game (rapper). The group RDB also worked with different hip hop artists such as T-Pain and Ludacris. In 2016, famous Indian rapper Badshah worked with dancehall musician Sean Paul in a song called \"Move Your Body\" with DJ Shadow Dubai. Desi rappers born and/or raised in the West have also bridged the cultures within their music, incorporating desi influences into their music. Anik Khan has blended Queens culture with Bengali influences into his music, and similarly, rappers Riz MC and Heems of the group Swet Shop Boys incorporate many South Asian influences in their music. In 2017, Pakistani rapper Ali Kaz collaborated with WWE music producer Jim Johnston for the theme song of WWE wrestler Jinder Mahal. In 2017, Badshah also did international collaboration with Major Lazer as a commercial promotion of Tuborg Brewery."]}, {"page": "Mister You", "response": ["|\"Jugni ji\" (DJ Kayz feat. Mister You, Dr Zeus & Sophia Akkara)"]}, {"page": "Gippy Grewal", "response": ["| || Veet Baljit || Dr Zeus  ", "| || Navi Kamboz || Dr Zeus"]}, {"page": "Angrej Ali", "response": ["| Dr Zeus"]}, {"page": "Preet Harpal", "response": ["| Dr Zeus", "|Dr Zeus", "| Dr Zeus"]}, {"page": "Mitro – Mitro", "response": ["The music is by Honey Singh, Gurmeet Singh, Dr Zeus and Sachin Ahuja."]}, {"page": "Kanika Kapoor", "response": ["** 2012 Best Single for \"Jugni Ji\", with Dr Zeus", "** 2015 Bollywood Record of the Year for \"Lovely\" with Dr Zeus"]}, {"page": "Geeta Zaildar", "response": ["| Dr Zeus"]}]}}