{"wiki_id": "http://www.wikidata.org/entity/Q5300748", "itemLabel": "Doug Millward", "itemDescription": "English footballer (1931-2000)", "wikipedia_url": "https://en.wikipedia.org/wiki/Doug_Millward", "wikipedia_page": {"main": "Horace Douglas Millward (10 July 1931 – 23 October 2000) was an English former professional footballer. During his career he made over 100 appearances for Ipswich Town.\nHe coached Baltimore Bays and Baltimore Comets.", "link_mentions": [{"page": "St Mirren F.C.", "response": ["*Doug Millward (June 1965 – Dec 66)"]}, {"page": "Millward", "response": ["* Doug Millward (1931–2000), English Association football (soccer) player", "* Doug Millward (footballer, born 1862), English Association football (soccer) player"]}, {"page": "Baltimore Bays", "response": ["In 1966 several groups of entrepreneurs were exploring the idea of forming a professional soccer league in United States and Canada.  Two of these groups merged to form the National Professional Soccer League (NPSL) and franchise rights were awarded to ten ownership groups.  Two of these ownership groups, one lead by Earl Foreman and another by Murdaugh Stuart Madden, sought to locate a team in Washington, D.C. and placed bids for a lease at the District of Columbia Stadium.  After the lease was awarded to Foreman's group, whose team would become the Washington Whips, Madden looked for another location for his team, eventually selling his franchise rights for $60,000 to the Baltimore Orioles in a deal announced on 28 November 1966.  A month later, the team hired Clive Toye to act as the team's Vice President and General Manager.    On 10 January 1967, the team name of Bays was revealed. Baltimore Orioles owner Jerold Hoffberger, who was also the owner of National Brewing Company chose the team's kit colors red and gold to match the brewing company's color scheme.  Former Ipswich Town forward Doug Millward was brought in to be the club's head coach.", "* Doug Millward (1967)"]}, {"page": "Baltimore Comets", "response": ["Looking to build off what was considered positive momentum in public interest in professional soccer, in January 1974 the North American Soccer League announced Baltimore as one of six cities awarded an expansion team for the upcoming 1974 season. Former Baltimore Bays head coach Doug Millward returned to the city to manage the team.  The Comets played their first game at home on 4 May 1974 at Memorial Stadium in Baltimore.  The team finished in second place in the Eastern Division qualifying for the playoffs as a wild card.  Peter Silvester, on loan from Southend United F.C. was named 1974 league MVP. On 15 August 1974, Baltimore lost 0 - 1 in the quarterfinals to the Boston Minutemen at Alumni Stadium.  The Comets participated in the 1975 NASL Indoor tournament as part of Region 3 playing at the Bayfront Center in St. Petersburg, Florida and loses the two matches in which they played."]}, {"page": "2000–01 in English football", "response": ["* 23 October 2000: Doug Millward, 69, played 143 league games as a forward for Ipswich Town under Alf Ramsey between 1955 and 1963, scoring 35 goals and being part of their title winning team in 1962. Became manager of St Mirren in Scotland in 1965 before furthering his career to the USA a year later and staying there until his death."]}, {"page": "1961–62 Ipswich Town F.C. season", "response": ["! scope=row| Doug Millward"]}, {"page": "1962–63 Ipswich Town F.C. season", "response": ["|Doug Millward"]}, {"page": "1960–61 Ipswich Town F.C. season", "response": ["|Doug Millward"]}]}}