{"wiki_id": "http://www.wikidata.org/entity/Q530676", "itemLabel": "Brian Glover", "itemDescription": "British character actor, writer and professional wrestler (1934-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Glover", "wikipedia_page": {"main": "Brian Glover (2 April 1934 – 24 July 1997) was an English actor and writer. He worked as a teacher and professional wrestler before commencing an acting career which included films, many roles on British television and work on the stage. His film appearances include Kes (1969), An American Werewolf in London (1981) and Alien 3 (1992).\nDescribed by The New York Times as a \"robust character actor\" who played \"gruff but likable roles\", he had a \"string of roles playing tough guys and criminals\". He once said, \"You play to your strengths in this game, and my strength is as a bald-headed, rough-looking Yorkshireman\". Glover was also known as the voice of the Tetley tea commercials. The Independent described him upon his death as \"one of Britain's best-loved actors\".", "link_mentions": [{"page": "April 2", "response": ["*  1934   – Brian Glover, English wrestler and actor (d. 1997)"]}, {"page": "Nikita Khrushchev", "response": ["* English actor Brian Glover portrayed Khrushchev in the British 1983 television film Red Monarch, a biopic of Stalin."]}, {"page": "A Midsummer Night's Dream", "response": ["* The 1981 BBC Television Shakespeare production was produced by Jonathan Miller and directed by Elijah Moshinsky. It starred Helen Mirren as Titania, Peter McEnery as Oberon, Phil Daniels as Puck, Robert Lindsay as Lysander, Geoffrey Palmer as Quince and Brian Glover as Bottom."]}, {"page": "Whatever Happened to the Likely Lads?", "response": ["|The Lads try to avoid learning the result of an England football match before the TV highlights are shown that evening. Flint (Brian Glover) tries to spoil it for them, having bet them £10 that they won't get through the day without learning the result. The lads arrive at the point of viewing the TV highlights none the wiser about the score, except for Terry seeing a newspaper headline that says \"England F...\". When Flint tracks them down to Bob's new house, an angry Terry pays him off with £10 (borrowed from Bob). After all that, the match turns out to have been postponed due to a waterlogged pitch: \"England Flooded Out...\""]}, {"page": "1997 in film", "response": ["| Snow White: A Tale of Terror || PolyGram Filmed Entertainment / Interscope Communications || Michael Cohn (director); Tom Szollosi, Deborah Serra (screenplay); Sigourney Weaver, Sam Neill, Monica Keena, Gil Bellows, David Conrad, Miroslav Taborsky, Brian Glover, Andrew Tiernan, Anthony Brophy, Chris Bauer, Frances Cuka, Bryan Pringle, Taryn Davis, Joanna Roth, John Edward Allen, Dale Wyatt || Gothic, Fantasy, Horror || Live action", "| style=\"text-align:center;\"| 24 || Brian Glover || style=\"text-align:center;\"| 63 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "The Famous Five (novel series)", "response": ["The  Famous Five television series was produced by Southern Television and Portman Productions for ITV in the UK, in 26 episodes of thirty minutes (including time for advertisements). It starred Michele Gallagher as Georgina, Marcus Harris as Julian, Jennifer Thanisch as Anne, Gary Russell as Dick, Toddy Woodgate as Timmy, Michael Hinz as Uncle Quentin and Sue Best as Aunt Fanny. It also starred Ronald Fraser, John Carson, Patrick Troughton, James Villiers, Cyril Luckham and Brian Glover. The screenplays were written by Gloria Tors, Gail Renard, Richard Carpenter and Richard Sparks. The episodes were directed by Peter Duffell, Don Leaver, James Gatward and Mike Connor. The series was produced by Don Leaver and James Gatward. Most of the outdoor filming was done in the New Forest and parts of Dorset and Devon.The series was set in the present day, fifteen years after Blyton's last novel in the series."]}, {"page": "1992 in film", "response": ["| Alien 3 || 20th Century Fox || David Fincher (director); David Giler, Walter Hill, Larry Ferguson (screenplay); Sigourney Weaver, Charles S. Dutton, Charles Dance, Lance Henriksen, Pete Postlethwaite, Holt McCallany, Paul McGann, Danny Webb, Brian Glover, Ralph Brown, Vincenzo Nicoli, Christopher John Fields, Peter Guinness, Leon Herbert, DeObia Oparei, Christopher Fairbank, Phil Davis, Niall Buggy, Clive Mantle || Sci-fi, Horror || Live action"]}, {"page": "1991 in film", "response": ["| Kafka || Miramax Films || Steven Soderbergh (director); Lem Dobbs (screenplay); Jeremy Irons, Theresa Russell, Joel Grey, Ian Holm, Jeroen Krabbé, Armin Mueller-Stahl, Alec Guinness, Brian Glover, Keith Allen, Simon McBurney, Robert Flemyng, Ion Caramitru, Josef Abrhám, Guy Fithen, Ondřej Havelka, Jerome Flynn, Ewan Stewart, Petr Jákl || Mystery, Thriller || Live action"]}, {"page": "1985 in film", "response": ["| Ordeal by Innocence || Cannon Films || Desmond Davis (director); Alexander Stuart (screenplay); Donald Sutherland, Faye Dunaway, Christopher Plummer, Sarah Miles, Ian McShane, Diana Quick, Annette Crosbie, Michael Elphick, George Innes, Valerie Whittington, Phoebe Nicholls, Michael Maloney, Cassie Stuart, Anita Carey, Ron Pember, Kevin Stoney, Brian Glover || Mystery || Live action"]}, {"page": "1982 in film", "response": ["| Britannia Hospital || EMI Films || Lindsay Anderson (director); David Sherwin (screenplay); Leonard Rossiter, Graham Crowden, Malcolm McDowell, Joan Plowright, Jill Bennett, Marsha Hunt, Brian Pettifer, John Moffatt, Fulton Mackay, Vivian Pickles, Barbara Hicks, Peter Jeffrey, Mary MacLeod, Robin Askwith, Dave Atkins, Mark Hamill, Frank Grimes, Gladys Crosbie, Richard Griffiths, Arthur Lowe, Alan Bates, Dandy Nichols, Betty Marsden, Liz Smith, T.P. McKenna, Michael Medwin, Roland Culver, Valentine Dyall, Tony Haygarth, John Gordon Sinclair, Brian Glover, Mike Grady, Kevin Lloyd, Robert Pugh, Robbie Coltrane, Patsy Byrne, Edward Hibbert || Black Comedy, Sci-Fi || Live action"]}, {"page": "1981 in film", "response": ["| An American Werewolf in London || Universal Pictures / PolyGram Pictures / The Guber-Peters Company || John Landis (director/screenplay); David Naughton, Jenny Agutter, Griffin Dunne, John Woodvine, Brian Glover, Lila Kaye, David Schofield, Paul Kember, Frank Oz, Don McKillop, Rik Mayall, Sean Baker, Sydney Bromley, Frank Singuineau, Will Leighton, Michael Carter, Anne-Marie Davies, Albert Moses, Alan Ford, Christine Hargreaves, Linzi Drew, Nina Carter, Vic Armstrong, John Landis || Horror, Comedy || Live action"]}, {"page": "1977 in film", "response": ["| Jabberwocky || Columbia Pictures (United States/Canada) / Warner Bros. (international) / Python Films / Umbrella Films || Terry Gilliam (director/screenplay); Charles Alverson (screenplay); Michael Palin, Harry H. Corbett, John Le Mesurier, Warren Mitchell, Annette Badland, Max Wall, Deborah Fallender, Jerold Wells, Bernard Bresslaw, Rodney Bewes, John Bird, Neil Innes, Terry Jones, Brian Glover, Graham Crowden, Terry Gilliam, David Prowse || Fantasy, Comedy || Live Action"]}, {"page": "Margery Allingham", "response": ["A film version of Tiger in the Smoke was made in 1956 and a highly popular series of Campion adaptations, now available on DVD, was shown by the BBC in 1989–90. It is titled simply Campion and stars Peter Davison as Campion and Brian Glover as Lugg."]}, {"page": "Porridge (1974 TV series)", "response": ["* Brian Glover as Cyril Heslop"]}, {"page": "Alien 3", "response": ["Set right after the events of Aliens (1986), Ripley and an Alien organism are the only survivors of the Colonial Marine spaceship Sulaco following an escape pod's crash on a planet housing a penal colony populated by violent male inmates. Additional roles are played by Charles Dance, Brian Glover, Charles S. Dutton, Ralph Brown, Paul McGann, Danny Webb, Lance Henriksen, Holt McCallany, Pete Postlethwaite, and Danielle Edmond.", "* Brian Glover as Harold Andrews, the prison warden. He believes Ripley's presence will cause disruption amongst the inmates and attempts to control the rumors surrounding her and the creature. He rejects her claims about the existence of such a creature, only to be killed by it."]}, {"page": "University of Sheffield", "response": ["Writers who attended the university include two-times Booker Prize winner Hilary Mantel, Lee Child, Andrew Grant, Brooke Magnanti (Belle de Jour), Lindsay Ashford and Katie B. Edwards. Actors and actress Brian Glover, Ian Hallard, Rachel Shelley and Eddie Izzard were students at the university. Notable Sheffield alumni in religion includes Dean of Westminster Abbey Wesley Carr, Dean of Christ Church of Oxford Martyn Percy, General Secretary of Action of Churches Together in Scotland Stephen Smyth, and Archbishop of Sydney Glenn Davies. Many pioneers were students at the university, including first British astronaut Helen Sharman, Polar explorer Roy Koerner, and the first female pilot to fly solo from London to Australia Amy Johnson. Sheffield students have also excelled in sports. Jessica Ennis-Hill and Hollie Webb are Olympic gold medalists. Bryony Page and Nick Beighton have won medals at the Olympics and Paralympics respectively. Notable alumni in sports also include Herbert Chapman, Zara Dampney, Catherine Faux, Tim Robinson and David Wetherill."]}, {"page": "Minder (TV series)", "response": ["As the series progressed, the guest stars became more prestigious, including Derek Jacobi as criminal Freddy Fenton, Brian Glover as Arthur's old army buddy Yorkie, Suzi Quatro as Terry's singer girlfriend Nancy, and Michael Kitchen as 'Maltese Tony'. Later series starring Cole and Waterman featured Billy Connolly playing Tick-tack, a bookie and grifter, Brian Blessed as bent copper DI Dyer, Ian McShane as gangster Jack Last, Roy Kinnear as Fat Charlie and Andrew Sachs as Sidney."]}, {"page": "Albert Campion", "response": ["In 1989 and 1990, the first eight of the novels (excluding The Crime at Black Dudley) were adapted over two seasons, with each story shown in two hour-long episodes. Peter Davison played Campion, Brian Glover was Lugg and Andrew Burt was Oates."]}, {"page": "O Lucky Man!", "response": ["* Brian Glover as Plantation foreman / Bassett (Power Station Guard)"]}, {"page": "Peter Tinniswood", "response": ["For ITV in 1983 Tinniswood wrote The Home Front, again set in the north of England. It starred Brenda Bruce as Mrs Place, a nosey, arrogant mother who lorded it over her three children. Two years later ITV produced Mog, based on Peter's 1970 novel and starring Enn Reitel as the title character. The episodes were written by Ian La Frenais and Dick Clement, but it was not a success. Also in 1985 was South Of The Border starring Brian Glover as Edgar Rowley, a Yorkshireman forced to migrate to the south of England."]}, {"page": "Brompton Cemetery", "response": ["* Brian Glover (1934–1997) – television and film actor"]}, {"page": "Jabberwocky (film)", "response": ["* Brian Glover as Armourer"]}, {"page": "The Secret Agent", "response": ["Various scenes from the novel were also dramatised in Joseph Conrad's The Secret Agent (1987), a 60-minute UK documentary featuring Frances Barber, Hywel Bennett, Jim Broadbent and Brian Glover."]}, {"page": "Richard Beckinsale", "response": ["From 1974 to 1977, Beckinsale starred as prison inmate Lennie Godber alongside Ronnie Barker in the hit BBC sitcom Porridge. Beckinsale expressed relief at landing the role, owing to his concern about being typecast as Geoffrey from The Lovers. Barker had suggested actor Paul Henry for the role of Godber, owing to Henry’s being from Birmingham (as Godber was meant to be), but director Sydney Lotterby chose Beckinsale instead. Beckinsale initially played Godber with a Birmingham accent, but this was eventually abandoned. Actor Brian Glover, who played the character Cyril Heslop on Porridge, stated that Heslop's line \"I read a book once; green it was\" from the first episode, New Faces, Old Hands, was actually Beckinsale's idea."]}, {"page": "List of Porridge characters", "response": ["Cyril Heslop was played by Brian Glover. Heslop is prominent in Season 1 of the show and was briefly Fletcher's cellmate. He was also one of the three new arrivals, along with Fletcher and Godber, into Slade Prison in the first episode of the series, having been given three years for breaking and entering. Heslop is quite dim and slow-witted, once being described by Mr. Mackay as \"thick as two short planks.\""]}, {"page": "List of people from Yorkshire", "response": ["| Brian Glover"]}, {"page": "Mike Read", "response": ["Great Expectations; A Christmas Carol; Cliff - The Musical (which closed after three months) and Ricky Nelson...Teenage Idol. Read took one of the lead roles in the Cliff musical, touring with it and appearing for the three-month run in the West End at the Prince of Wales Theatre. His production Betjeman (based on his musical settings of poems by Sir John Betjeman) has occasionally been staged for charities, including the Royal Marsden Hospital and Children With Leukaemia. Actors appearing in his musicals and shows have included Nyree Dawn Porter, Brian Glover, Colin Baker, Anton Rogers, Jeremy Irons, Alvin Stardust and Bernard Cribbins."]}, {"page": "La Cage aux Folles (musical)", "response": ["| style=\"text-align:center;\" | Brian Glover", "The show had its West End premiere at the London Palladium on May 7, 1986 with the same creative team as the Broadway production. Hearn transferred with the production, which was made possible through an agreement with the American and British actors' unions, allowing him to come over in exchange for Robert Lindsay appearing in Me and My Girl on Broadway. The production also starred Denis Quilley as Georges,Billington, Michael, \"A gay night at home with the boys\", The Guardian, 9 May 1986, p. 12 Jonathon Morris as Jean-Michel, Brian Glover as Edouard Dindon, Julia Sutton as Mme. Dindon, Phyllida Law as Jacqueline, Wendy Roe as Anne and Donald Waugh as Jacob. The show closed in London after 301 performances. Its short run and financial failure were partly blamed on the AIDS crisis, and producers were uncomfortable about portraying gay lives onstage quite so openly in mainstream musicals for some time afterwards.\"I Love The Nightlife\",  The Stage, June 6, 2007"]}, {"page": "List of fictional butlers", "response": ["| Magersfontein Lugg || in the Albert Campion novels, written by Margery Allingham || Wally Patch, Brian Glover || 1930 ||"]}, {"page": "Return of the Saint", "response": ["| 1–12 || 26 November 1978 || \"Signal Stop\" || Ciaran Madden, Frederick Jaeger, Ian Cullen, Brian Glover, Sabina Franklyn, Ralph Arliss, Heather Wright, Royston Tickner, George Sweeney, Renu Setna, Graham Ashley, Kevin Selway"]}, {"page": "Kes (film)", "response": ["* Brian Glover as Mr Sugden"]}, {"page": "The Company of Wolves", "response": ["*Brian Glover as Amorous Boy's father"]}, {"page": "Nick Bottom", "response": ["Actors who have played the role on film include Paul Rogers, James Cagney and Kevin Kline. In the BBC Television Shakespeare version, he is played by Brian Glover. In BBC One's ShakespeaRe-Told, he is played by comedian Johnny Vegas. "]}, {"page": "The Ragged-Trousered Philanthropists", "response": ["*A 6 x 60-minute radio adaptation was transmitted as a \"Classic Serial\" on BBC Radio 4 in 1989. It starred Sean Barrett, Brian Glover and Peter Vaughan. It was produced by Michael Bakewell and dramatised by Gregory Evans."]}, {"page": "What the Butler Saw (play)", "response": ["* Brian Glover – Sergeant Match"]}, {"page": "Play of the Month", "response": ["|Tom Courtenay,Michael Hordern,Alun Armstrong,Hilda Braid,Keith Chegwin,Kenneth Colley,Paul Copley,Christopher Guard,Brian Glover,Tony Haygarth,David Jackson,Kevin McNally,John Normington,Terry Scully,Nina Thomas,Raymond Westwell"]}, {"page": "List of people from Sheffield", "response": ["*Brian Glover, actor and wrestler"]}, {"page": "1942: A Love Story", "response": ["Naren's father Diwan Hari Singh (Manohar Singh) is a loyal British employee working for the brutal British General Douglas (Brian Glover), who is infamous in tracking down and executing citizens who are believed to be revolutionaries. Rajjo's father Raghuvir Pathak (Anupam Kher) is a revolutionary fighting against British rule, as he holds a grudge against Douglas for murdering his son. When Naren asks Raghuvir for Rajjo's hand in marriage, Raghuvir becomes livid by this. However, Naren declares that he is willing to sacrifice everything for Rajjo, and convinces Raghuvir of his love for her. Raghuvir relents, but tells Naren to talk to his father first. When Naren does so, Hari is angry that his son has chosen the daughter of a revolutionary, but pretends that he will do anything for Naren's happiness.", "*Brian Glover as General Douglas, a ruthless British general and the main antagonist."]}, {"page": "Britannia Hospital", "response": ["* Brian Glover as Painter"]}, {"page": "You Bet!", "response": ["|bgcolor=\"ddffdd\"| Brian Glover"]}, {"page": "Shadows (TV series)", "response": ["Guest actors included John Nettleton, Gareth Thomas, Jenny Agutter, Pauline Quirke, Brian Glover, June Brown, Rachel Herbert, Jacqueline Pearce and Gwyneth Strong.", "Starring: Alex Scott, Shelagh Fraser, Brian Glover, Hugh Morton, Margot Field, Carolyn Courage, Graham Kennedy"]}, {"page": "Campion (1989 TV series)", "response": ["Campion is a British television mystery drama first broadcast on the BBC on 22 January 1989. Each of the eight stories featured across the two series, broadcast in 1989 and 1990 respectively, are adapted from the Albert Campion mystery novels written by Margery Allingham. The series starred Peter Davison as Albert Campion, Brian Glover as his manservant Magersfontein Lugg and Andrew Burt as his policeman friend Stanislaus Oates.http://www.tv.com/shows/campion/ ", "* Brian Glover as Magersfontein Lugg "]}, {"page": "Mystery Mile", "response": ["The story was adapted for television by the BBC, the last of eight Campion stories starring Peter Davison as Campion and Brian Glover as Lugg. Originally broadcast as two separate hour-long episodes, the original UK air date was 9 March 1990. The series was shown in the United States by PBS."]}, {"page": "Stephen Lowe (playwright)", "response": ["Lowe has worked with many leading directors including Bill Alexander, Alan Ayckbourn, Annie Castledine, Jonathan Chadwick, Anthony Clark, Stephen Daldry, Alan Dossor, Richard Eyre, Bill Gaskill, David Leveaux,  and Danny Boyle, who early in his career was assistant director on Lowe’s play Tibetan Inroads.   His theatre and television work has featured actors such as Bruce Alexander, Warren Clarke, George Costigan, Kenneth Cranham, Sharon Duce, Emma Fielding, Brian Glover, Nigel Hawthorne, Bill Paterson, Neil Pearson, Kathryn Pogson, Linus Roache, Colin Tarrant, Marjorie Yates, Harriet Walter and Rachel Weisz."]}]}}