{"wiki_id": "http://www.wikidata.org/entity/Q5300674", "itemLabel": "Doug Loft", "itemDescription": "British footballer (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Doug_Loft", "wikipedia_page": {"main": "Douglas James Loft (born 25 December 1986) is an English professional footballer who plays as a midfielder for National League South club Tonbridge Angels.\nA non-League player at Hastings United, Loft moved to Championship club Brighton & Hove Albion in January 2006. He remained on the fringes of the first-team throughout his stay and was loaned out to Dagenham & Redbridge in February 2009. He signed with Port Vale in June 2009, where he found regular first-team football. Voted as the club's Player of the Year in 2012, Loft helped the club secure promotion to League One the following season. He signed for Gillingham in June 2014, before moving to Colchester United in July 2016. He signed with Shrewsbury Town in July 2018 and in January 2019 rejoined Dagenham & Redbridge on loan. He signed with non-League side Billericay Town in July 2019 and moved to Tonbridge Angels in June 2021.", "link_mentions": [{"page": "Maidstone", "response": ["*Doug Loft (born 1986), footballer"]}, {"page": "Micky Adams", "response": ["Adams was announced as manager of Port Vale in June 2009, having been a late applicant for the post vacated by Dean Glover. However \"legal complications\" meant he would only sign a contract nearly two months later. Chairman Bill Bratt stated that Adams' first goal would be to stabilise the club, following the \"Valiants\" fall from the second tier to near the bottom of the English Football League within ten years. He made his first signing on 15 June, bringing in 21-year-old midfielder Tommy Fraser, who had played for Adams at Brighton. After confirming the signing of Adam Yates, who was linked to the club before his arrival, Adams signed Doug Loft, who had also played under him at Brighton. On 21 July, Adams had appointed veteran striker Geoff Horsfield as player-assistant manager.", "In preparation for League One football, Adams signed winger Kaid Mohamed to replace the departing Ashley Vincent. He also signed defenders Chris Robertson and Carl Dickinson, midfielders Chris Lines and Anthony Griffith, and forward Gavin Tomlin. On 22 September, Rob Page was put in temporary charge of first team affairs at Vale Park after Adams took the decision to take time off work to have hip replacement surgery. The club overstretched itself financially, meaning that as they lay outside the play-offs in January Adams could only sign largely untried youngsters on loan whilst releasing higher paid players either on free transfers or on loan. Their promotion push fell away but they ended the season in ninth place – far exceeding their original aim of avoiding relegation. During this time he had to deal with issues such as sacking defender Daniel Jones for physically attacking captain Doug Loft during training, and had to deal with months of speculation over his own future after chairman Norman Smurthwaite took until May before offering him a new one-year rolling contract. He signed the contract the following month."]}, {"page": "John McGreal", "response": ["After Kevin Keen left Colchester following the club's relegation to League Two on 26 April 2016, McGreal was appointed his successor on 4 May. He did not take charge of Colchester until after the final game of the 2015–16 season, in which his assistant Steve Ball was named caretaker. The club signed a number of players in preparation for the 2016–17 season, including defenders Luke Prosser (who he appointed as captain) and Lewis Kinsella; midfielders Brennan Dickenson, Craig Slater and Doug Loft; and forwards Courtney Senior, Kurtis Guthrie, and Denny Johnstone. However top-scorer George Moncur was sold to Barnsley for £500,000. In his first match in charge on 6 August, McGreal guided his side to a 1–1 opening day draw away to Hartlepool United. He earned his first win on 13 August as his side defeated Cambridge United 2–0 at the Colchester Community Stadium. After three wins and one draw in Colchester's opening five league fixtures, McGreal was nominated for the League Two Manager of the Month award for August. After an eleven-game winless run, McGreal's side went undefeated in December, earning ten points from a possible twelve which propelled Colchester up the League Two table away from the relegation zone. In turn, McGreal was shortlisted for the League Two Manager of the Month award for December. He won the award on 6 January 2017, becoming the first Colchester manager to win the award since Paul Lambert in January 2009. Later that month he signed Sean Murray on a free transfer from Swindon Town. The \"U's\" finished the season eighth in the table, one place and one point behind Blackpool in the play-offs, who would go on to achieve promotion. McGreal released eight players, whilst also losing top-scorer Chris Porter, who left on a free transfer to sign with Crewe Alexandra."]}, {"page": "Carl Dickinson", "response": ["He was appointed as club captain in August 2014, taking the armband from the departed Doug Loft. He scored his first goal for the \"Valiants\" and only his fourth career goal in a 3–1 victory at Doncaster Rovers on 16 August, earning himself a mention on the Football League team of the week in the process. However, he was dropped from the starting line-up two months later after admitting \"I haven't been good enough for the standards I set myself every day\". After returning to the first team he stated that a talk with manager Rob Page helped him to calm down as he had put \"a bit too much pressure\" on himself after taking over the captaincy. He remained in poor form however, but said the criticism from the fans did not affect him after providing the assist for Tom Pope in the win against nearby rivals Walsall on 14 February."]}, {"page": "Sean McAllister", "response": ["McAllister failed to find a club before the start of the 2012–13 season, despite a trial at Oxford United. In October 2012, he went on trial at Port Vale, after personally ringing manager Micky Adams to enquire about a vacancy in midfield created when Doug Loft picked up an injury. He signed an eight-week contract with Vale on 9 November. The League Two club were in administration, and applied for special permission to sign McAllister after asking the Football League for leniency after they underwent a shortage of available midfielders. He made his debut from the bench at Vale Park on 17 November, replacing Rob Taylor 74 minutes into a 2–2 draw with York City. However, he would only feature twice more for Vale, and left the club on 8 January 2013, with Adams saying \"it's unfortunate we weren't able to offer Sean more first-team opportunities, but that underlines the competition for places we have among the squad, but he's a great kid, a model professional and I'd recommend him anywhere.\""]}, {"page": "Daniel Jones (footballer)", "response": ["He started the 2013–14 season in the first eleven, but had to fight for his place after missing with a groin strain. He picked up the club's first red card of the season on 19 October, when he was dismissed for two bookable offences 20 minutes into a 2–1 defeat to Sheffield United at Bramall Lane. Two months later he was sidelined for several weeks after picking up a foot injury. He returned to the first team on the left-side of midfield in February. On 14 April 2014, Jones was sacked by Port Vale following a training ground bust-up that left club captain Doug Loft with a facial injury."]}, {"page": "Calvin Andrew", "response": ["Andrew joined League Two club Port Vale on 26 November 2012 on a two-month contract; the move came days after the club failed to secure Lee Hughes on loan. The move reunited him with former Brighton manager Micky Adams, and Andrew said that \"I think I'll do well here and score a lot of goals\". Assistant manager Mark Grew said that his arrival was a \"big plus\" and that he would provide cover for top goalscorer Tom Pope as both players were \"big and strong\" strikers. He made his full debut at Vale Park on 4 December, in a 2–0 defeat to Bradford City in the Football League Trophy. Though often on the bench, he ended the month with \"a hard-working and eye-catching display\" on the left side of midfield in a 3–2 win over Dagenham & Redbridge. After his short-term contract expired, he agreed to extend his stay until the end of 2012–13. He scored his first goal for the Vale after he was given the rare chance to start a match as a striker on 23 February, in a 1–0 win over Torquay United at Plainmoor, after a Doug Loft shot deflected off Andrew into the net. Vale secured promotion with a third-place finish, with Andrew making 24 appearances. He was not offered a new contract at the end of the season and was released as a free agent."]}, {"page": "Chris Robertson (footballer, born 1986)", "response": ["He signed with newly promoted League One club Port Vale in June 2013. Upon securing him to a two-year contract, manager Micky Adams noted that Robertson had experience of League One football and had made a good impression on him during his time at Torquay. He opened the 2013–14 season in a centre-back partnership with Carl Dickinson. On 1 April he was sent off during a 2–1 win over Crawley Town after the referee mistakenly thought he had made a tackle from behind, when in fact the culprit was club captain Doug Loft. He ended the campaign with 44 appearances to his name, but said that he was not taking his future at the club for granted despite being one of only a few players contracted until 2015."]}, {"page": "List of people from Kent", "response": ["*Doug Loft (born 1986) – footballer"]}, {"page": "Anthony Griffith (footballer)", "response": ["On 28 August 2010, Griffith scored from 25-yards at Vale Park past Torquay United's Scott Bevan in a 2–1 reverse. The goal would prove to be more important to Griffith himself and the Torquay opposition than to his own club, the fine strike his first in the Football League, and his first in Port Vale colours. It also ended the Gulls' run without conceding a league goal at the 998-minute mark, a club record but not a Football League record. He started the season strongly, forming a solid midfield partnership with Gary Roberts. Despite losing his place to Doug Loft following an injury that kept him sidelined for a month, he returned to post 45 appearances in 2010–11.", "He returned to Port Vale on loan in March 2013 until the end of the 2012–13 season. After a slow start, he soon returned to top form and won plaudits and 'man of the match' awards for his performances. He made ten appearances during his loan spell, helping the club to win promotion into League One with a third-place finish in League Two. He re-joined Port Vale on a permanent basis in July 2013, signing a one-year contract. He went on to build an impressive partnership in midfield with Chris Lines in the 2013–14 season; Griffith providing the tough-tackling and Lines providing the creative playmaking. Despite making 45 appearances across the season he was not offered a new contract in the summer. In summer 2014 Griffith had a trial with League Two club Mansfield Town. He later returned to Vale Park to train, with coach Mark Grew saying \"The manager is always ready to help someone like Griff who has been such a good servant to the club.\" He was voted onto Port Vale's team of the 2010s by readers of The Sentinel, alongside Doug Loft, in February 2020."]}, {"page": "2008–09 Brighton & Hove Albion F.C. season", "response": ["| Doug Loft", "| Doug Loft || Dagenham & Redbridge || 2 February 2009 || 8 May 2009"]}]}}