{"wiki_id": "http://www.wikidata.org/entity/Q5301135", "itemLabel": "Dougie Vipond", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Dougie_Vipond", "wikipedia_page": {"main": "Douglas Vipond (born 15 October 1966) is a Scottish broadcaster and drummer.", "link_mentions": [{"page": "Elderslie", "response": ["*Dougie Vipond (1966–present) – television presenter and drummer of Deacon Blue."]}, {"page": "Royal Conservatoire of Scotland", "response": ["*Dougie Vipond"]}, {"page": "Deacon Blue", "response": ["Deacon Blue are a Scottish pop rock band formed in Glasgow during 1985. The line-up of the band consists of vocalists Ricky Ross and Lorraine McIntosh, keyboard player James Prime and drummer Dougie Vipond. The band released their debut album, Raintown, on 1 May 1987 in the United Kingdom and in the United States in February 1988. Their second album, When the World Knows Your Name (1989), topped the UK Albums Chart for two weeks, and included \"Real Gone Kid\" which became their first top ten single in the UK Singles Chart and reached number one in Spain.", "Taking their name from the 1977 Steely Dan song \"Deacon Blues\", Deacon Blue were formed in 1985 following Ricky Ross's move from Dundee to Glasgow.  Along with Ross, the group originally consisted of Lorraine McIntosh, James Prime, Dougie Vipond, Ewen Vernal and Graeme Kelling.", "* Dougie Vipond – drums, percussion "]}, {"page": "Reporting Scotland", "response": ["*Dougie Vipond (now with Landward)"]}, {"page": "Raintown (album)", "response": ["*Dougie Vipond – drums, percussion"]}, {"page": "James Prime", "response": ["Deacon Blue was formed in Glasgow in 1985 by Ricky Ross and comprised Prime, Graeme Kelling on guitar, vocalist Lorraine McIntosh, bass guitarist Ewen Vernal and Dougie Vipond on drums. Their 1987 debut album, Raintown, was well received and followed by others such as When The World Knows Your Name (1989) and Whatever You Say, Say Nothing (1993), with a succession of hits such as \"Real Gone Kid\" (no. 8 in the UK), \"I'll Never Fall in Love Again\" (no. 2) and \"Twist and Shout\" (no.10). The band grew to be one of Scotland's best-known acts of the 1980s, but split in 1994. They reformed later to produce several more albums; including Walking Back Home (1999), Homesick (2001), The Hipsters (2012), A New House (2014),Believers (2016) and City of Love (2020)."]}, {"page": "Sportscene", "response": ["* Sportscene Results is broadcast on Saturday afternoons on BBC One Scotland and occasionally BBC Scotland (formerly BBC Two Scotland). The show rounds up all of the day's main football scores, whilst debating the major Scottish football stories of the week. It sends reporters to every game in the Scottish Premiership, certain games in the Scottish Championship, as well as Scottish Cup and Scottish League Cup games. BBC Scotland had historically produced a Saturday teatime results round-up programme as an opt-out from Grandstand initially known as Scoreboard which launched on 16 August 1975, but in 1989 a new programme called Afternoon Sportscene was launched. It ran for the entire duration of the time allocated for the day's results, starting at some point between 1 and 5 minutes before the network aired English counterpart Final Score. At the start of the 2001/02 season the programme was renamed Sportscene Results to co-inside with the programme and Final Score, becoming programmes in their own right. Sportscene Results is presented by David Currie previous presenters have included Peter Thomson, Sandy McLeish, Murdoch McPherson, Brian Marjoribanks, Alastair Alexander, Gordon Hewitt, Bill McFarlan, Rob Maclean, Jim Craig, Dougie Donnelly, Hazel Irvine, Alison Walker, Dougie Vipond, Stuart Cosgrove and Eilidh Barbour. The show gives football experts like Pat Nevin and Tony Higgins an opportunity to give their views on the days results and the past week of football. ", "* Grandstand from Scotland / Sunday Grandstand from Scotland (sometimes branded Scottish Grandstand or Grandstand Scotland) was the name of BBC Scotland's sports programme broadcast as an occasional opt-out from the network version of Grandstand on BBC One Scotland from 1961 - 2006 and BBC Two Scotland from 1989 - 2006. it was initially broadcast as a opt-out from the FA Cup Final throughout the 1960s and 1970s but in subsequent years from 1981 the programme was occasionally broadcast to incorporate local and network sporting events if there was live or highlights coverage of Scottish football, rugby, golf, snooker etc. Presenters have included Peter Thomson, Sandy McLeish, Murdoch McPherson, Brian Marjoribanks, Gordon Hewitt, Dougie Donnelly, Bill McFarlan, Hazel Irvine, Rob Maclean, Jill Douglas, Alison Walker and Dougie Vipond.", "Sportscene's main anchors are David Currie and Jonathan Sutherland. Previous Sportscene presenters include Peter Thomson, Sandy McLeish, Bill Malcolm, Archie Henry, Murdoch McPherson, Brian Marjoribanks, Alastair Alexander, Charles Munro, Archie Macpherson, Gordon Hewitt, Andrew Alexander, Dougie Donnelly, Bill McFarlan, Jim Craig, Derek Johnstone, Louise Welsh, Hazel Irvine, Jock Brown, Mark Souster, Alison Walker, Mike Abbott, Richard Gordon, Jill Douglas, Gary Parker, John Beattie, Dougie Vipond, Stuart Cosgrove and Eilidh Barbour."]}, {"page": "Douglas Vipond", "response": ["#REDIRECT Dougie Vipond"]}, {"page": "Dougie (given name)", "response": ["*Dougie Vipond (born 1966), Scottish musician and television personality"]}, {"page": "When the World Knows Your Name", "response": ["*Dougie Vipond – drums"]}, {"page": "Park Mains High School", "response": ["*Dougie Vipond, TV presenter & Deacon Blue drummer"]}, {"page": "Fellow Hoodlums", "response": ["*Dougie Vipond – drums"]}, {"page": "Whatever You Say, Say Nothing", "response": ["*Dougie Vipond – drums"]}, {"page": "Ooh Las Vegas", "response": ["*Dougie Vipond – drums"]}, {"page": "Riches (album)", "response": ["*Dougie Vipond – drums"]}, {"page": "Our Town – The Greatest Hits", "response": ["*Dougie Vipond – drums"]}, {"page": "Riches & More", "response": ["*Dougie Vipond – drums"]}, {"page": "Homesick (Deacon Blue album)", "response": ["*Dougie Vipond – drums"]}, {"page": "The Very Best of Deacon Blue", "response": ["*Dougie Vipond – drums"]}, {"page": "Singles (Deacon Blue album)", "response": ["*Dougie Vipond – drums"]}]}}