{"wiki_id": "http://www.wikidata.org/entity/Q530344", "itemLabel": "Anna Shaffer", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Anna_Shaffer", "wikipedia_page": {"main": "Anna Maureen Barth Shaffer (born 15 March 1992) is a British actress. She gained prominence through her roles as Romilda Vane in the Harry Potter films and Ruby Button in the E4 soap opera Hollyoaks. As of 2019, she plays Triss Merigold in the Netflix adaptation of The Witcher.", "link_mentions": [{"page": "1992 in American television", "response": ["|Anna Shaffer"]}, {"page": "1992 in film", "response": ["**Anna Shaffer, British actress"]}, {"page": "List of Harry Potter cast members", "response": ["| colspan=\"3\" | Anna Shaffer"]}, {"page": "Harry Potter and the Half-Blood Prince (film)", "response": ["Helen McCrory plays Narcissa Malfoy, Draco’s mother and Bellatrix’s sister and David Legeno plays werewolf, Fenrir Greyback. Jessie Cave, Anna Shaffer and Freddie Stroma play Gryffindor  students, Lavender Brown, Romilda Vane and Cormac McLaggen while Rob Knox plays Ravenclaw, Marcus Belby."]}, {"page": "MuggleNet", "response": ["On October 31, 2014, the site announced MuggleNet Live! 2015: Expo Patronum. It was described as  The convention was held on April 18, 2015, in London, England, and featured several special guests from the films, including Afshan Azad (Padma Patil), Jon Campling (unnamed Death Eater), Jessie Cave (Lavender Brown), Warwick Davis (Professor Filius Flitwick & Griphook), Alfred Enoch (Dean Thomas),  Rohan Gotobed (young Sirius Black), wand combat choreographer Paul Harris, Robbie Jarvis (teenage James Potter), Georgina Leonidas (Katie Bell), Harry Melling (Dudley Dursley), graphic design team MinaLima (Miraphora Mina and Eduardo Lima), Nick Moran (Scabior), Chris Rankin (Percy Weasley), Anna Shaffer (Romilda Vane), Nick Shirm (Zacharias Smith), Natalia Tena (Nymphadora Tonks), and art director  Gary Tomkins."]}, {"page": "Camden School for Girls", "response": ["* Anna Shaffer (born 1992), actress"]}, {"page": "List of former Hollyoaks characters", "response": ["| Ruby Button || Anna Shaffer || 2011–2014, 2017–2018"]}, {"page": "Jack Osborne", "response": ["Jack supports Frankie when her daughter Steph (Carley Stenson) reveals she is dying from cervical cancer. When Steph dies in a fire at Il Gnosh, he gets deeply concerned for Frankie when she sets a table for Steph for Christmas dinner. On Christmas Eve 2010, while taking his dog for a walk with Duncan in a nearby woods, they both discover India Longford's (Beth Kingston) body, leading Jack to call the police. Jack becomes a grandfather when Suzanne Ashworth (Suzanne Hall) gives birth to Darren's twins Francine and Jack Osborne, named after Frankie and himself, and Frankie and Jack also take in Frankie's granddaughter Esther Bloom (Jazmine Franks) and Duncan's sister Ruby Button (Anna Shaffer). The Osborne house becomes even more crowded when Darren and his new fiancée Nancy Hayton (Jessica Fox) move in."]}, {"page": "1992 in the United Kingdom", "response": ["* 15 March – Anna Shaffer, actress"]}, {"page": "Amy Barnes", "response": ["Leanne starts vandalising Amy's sausage posters placed around the village. Leanne follows Amy and Lee to the filming of a new advert. She attempts to ruin the set by pushing Lee down a ski slope and later climbs into bed with him. Leanne tries to convince Ste that Amy is mentally ill like Kathy. After an argument with Amy, Leanne is found injured at the bottom of the SU bar stairs. She accuses Amy of assault and she is charged. Ruby Button (Anna Shaffer) then bullies and taunts Amy in the classroom. Amy then cries due to being bullied by Ruby, forcing Pete to make Amy take leave. Amy is faced wirth a prison sentence and repeatedly argues with Leanne in public. She later breaks down and ends her relationship with Lee over trust issues. Leanne drops the charges and Amy reconciles with Lee. He buys Amy a new car and Dodger Savage (Danny Mac) agrees to give her driving lessons. She soon finds herself attracted to Dodger. She drunkenly has sex with Dodger, but insists it is a one-night stand. She reconciles with Lee, he later finds out she slept with Dodger. They break up after Lee broadcasts details of their personal life over student radio. Amy realises Lee loves her and proposes to him."]}, {"page": "Color-blind casting", "response": ["|2019 || Yennefer is played by half-Indian actress Anya Chalotra, who was a white brunette in the original, similarly done with Vilgefortz (Mahesh Jadu). White character Fringilla Vigo is played by black actress Mimi Ndiweni; Istredd (Royce Pierreson) and Triss Merigold (Anna Shaffer) are also white in books, yet are played by actors of color."]}, {"page": "List of British Jewish entertainers", "response": ["*Anna Shaffer (born 1992)"]}, {"page": "Tom Cunningham", "response": ["Sienna kidnaps Charlie and Oscar and then goes back to Tom and threatens him, so he leaves with Sienna and she takes him to the Roscoes' garage but just before he goes in, he throws Charlie's toy on the ground. Dodger later sees this and tries to open the door but it's locked. He hears a car running as Sienna is trying to poison them. The police arrive and Tom is yelling for help. When the door is opened, Sienna drives out and tries to hit Darren with the car but Dodger gets in the way so she swerves and crashes. Tom then runs out and is greeted by Esther and Ruby Button (Anna Shaffer). Darren then runs over to him and hugs him. On his 14th birthday, Tom is shocked as Frankie and Jack have agreed to adopt him."]}, {"page": "List of characters in The Witcher series", "response": ["In the TV series, Triss Merigold is portrayed by Anna Shaffer.", "| rowspan=\"2\" colspan=\"2\" | Anna Shaffer"]}, {"page": "Highgate Wood Secondary School", "response": ["* Anna Shaffer- English actress, best known for her role as Ruby Button in teen soap opera Hollyoaks, and for her role as Romilda Vane in the Harry Potter film series."]}, {"page": "List of British actors", "response": ["* Anna Shaffer (born 1992)"]}, {"page": "The Witcher (TV series)", "response": ["* Anna Shaffer as Triss Merigold, a sorceress, the court mage of Temeria and advisor to King Foltest.", "In September 2018, Netflix announced that Henry Cavill would play Geralt of Rivia. He was selected from more than 200 actors; Cavill actively campaigned for the role, being a long-time fan of the video game adaptations. In October 2018, Freya Allan and Anya Chalotra were cast as Princess Cirilla and Yennefer of Vengerberg respectively, while Jodhi May, Björn Hlynur Haraldsson, Adam Levy, MyAnna Buring, Mimî M. Khayisa (then known as Mimi Ndiweni), and Therica Wilson-Read also joined. More casting was announced later that month, including Eamon Farren, Joey Batey, Lars Mikkelsen, Royce Pierreson, Maciej Musiał, Wilson Radjou-Pujalte, and Anna Shaffer."]}, {"page": "Gallifrey One", "response": ["| colspan=\"3\" |Paul McGann, Lalla Ward, Louise Jameson, Katy Manning, Anneke Wills, Frazer Hines, Philip Hinchcliffe, Catrin Stewart, Roger Murray-Leach, Danny Webb, Jimmy Vee, Peter Purves, Hattie Hayridge, Daphne Ashbrook, John Leeson, Gareth David-Lloyd, Naoko Mori, Prentis Hancock, Simon Fisher-Becker, Mat Irvine, Deep Roy, Michael Troughton, Nicholas Briggs, Nicholas Pegg, Barnaby Edwards, Amy Pemberton, Rachael Stott, Nick Abadzis, Paul Cornell, Ryan Carnes, Anna Shaffer, Christine Adams, Dominic Glynn, Sam Watts, John Peel, Tony Lee, Gary Russell, Richard Dinnick, David Gerrold, Chase Masterson, June Hudson, Howard BurdenConvention Guests Gallifrey 2017 GallifreyOne.com. Retrieved 16 February 2017."]}, {"page": "Ricky Campbell", "response": ["Ricky is later seen again in December, when he becomes part of Lee Hunter's Boy Band Guy Candy, also becomes friends with Duncan's sister Ruby Button (Anna Shaffer) when she arrives in January. Ricky left Hollyoaks in August 2012 on results day after messing up his exams."]}, {"page": "Rae Wilson", "response": ["Langford later wrote that Rae's murder and the subsequent blaming of Brendan were predictable, but made \"compelling drama\", and that Rae had been killed in \"a rather gruesome and shocking fashion\". Inside Soap polled its readers on which Hollyoaks character they most wanted to be murdered by Silas. Rae and Theresa were voted as favourites to survive, while Leanne and Ruby Button (Anna Shaffer) were voted to be his next victims."]}, {"page": "Holly Cunningham", "response": ["In November 2012, a fourteen-year-old Holly returns during Cindy and Tony's, Doug Carter (PJ Brennan) and Ste Hay's (Kieron Richardson) double wedding. During the reception a mini bus carrying Ruby Button (Anna Shaffer), Jono Johnson (Dylan Llewellyn), George Smith (Steven Roberts), Sinead O'Connor (Stephanie Davis) and Neil Cooper (Tosin Cole) and driven by Maddie Morrison (Scarlett Bowman) crashes through the wedding venue, after swerving to avoid hitting Ste's daughter Leah Barnes (Ela-May Demircan) on the way to Jono and Ruby's own wedding. Though the accident kills Neil, Maddie, Rhys and Jono, Holly, Cindy and Tony are all left uninjured and Holly returns to Switzerland."]}, {"page": "List of action films of the 2010s", "response": ["|Wade Barrett, Anna Shaffer, Gary Daniels"]}, {"page": "Diane O'Connor", "response": ["Sinead is involved in a bus crash which kills her friends, Diane is left shocked when the nurse reveals that Sinead is pregnant. Diane begins teaching at Hollyoaks College and is completely unaware that Sinead and Ruby Button (Anna Shaffer) are bullying Esther Bloom (Jazmine Franks) following the bus crash. Diane asks Sinead whether she was involved in the bullying and she denies it and blames Ruby. New headteacher Patrick Blake (Jeremy Sheffield) promotes Diane to head of the Anti-Bullying scheme, but she is left shocked when Ruby reveals to Diane that Sinead was also involved in the bullying. Diane kicks Ruby out of her home and she is run over by Jack Osborne's (Jimmy McKenna) car. Ruby does not sustain any serious injuries and returns home the next day. Diane and Sinead agree to keep her involvement in the bullying secret but is caught out when Dylan Shaw's (Mikey Riddington-Smith) video of Esther is shown at The Dog, the video reveals her bullies in front of Patrick. Some time later, Diane has a drunken one-night stand with Tony Hutchinson (Nick Pickard) and embarrassed upon her awakening, she secretly leaves his bedroom nonetheless Tony notices. Diane is stunned to discover her pregnancy after. Sinead gives birth to a baby girl, who she calls Katy O'Connor."]}, {"page": "Sinead O'Connor (Hollyoaks)", "response": ["Sinead befriends Amber Sharpe (Lydia Lloyd-Henry) and her father, Rob, is promoted to headmaster when they accidentally knock Mr. Forsyth unconscious. Sinead's stepmother, Diane, asks Sinead to inject her with her IVF drugs and it begins to affect their relationship. Finn tells Sinead that he is worried Diane may forget about her step-children if she has a child of her own. Diane takes a pregnancy test which is negative but finds an abandoned baby at the hospital and brings him home. She tells Sinead she wants to keep him but is forced to ask Lynsey Nolan (Karen Hassan) for medical advice when he falls ill. Lynsey threatens to contact the authorities, but Anita Roy (Saira Choudhry) tells Lynsey to back off. Sinead develops an attraction to Taylor Sharpe (Shaun Blackstock) and despite distraction from Taylor's brother Arlo Davenport (Travis Yates) they begin dating. Sinead reads Amber's diary and she claims that Rob has fathered the baby she is carrying. Sinead and Diane later uncover that Finn is the father of Amber's baby and she ends her relationship with Taylor. Rob's disgruntled ex-employee, Eva Strong (Sheree Murphy), steals Amber's diary and Sinead convinces Rob to reinstate Eva in exchange for the diary. Eva, however, keeps pages and with the evidence, imprisons Rob. It is later revealed that Rob's relationship with Diane started when she was his pupil and Sinead's mother is still alive. Sinead and Ruby Button (Anna Shaffer) begin teasing Esther Bloom (Jazmine Franks) when Esther pretends that Sinead is her girlfriend."]}, {"page": "Bart McQueen", "response": ["Bart puts the record straight and tells the McQueen's that Jasmine is transgender not him. Bart goes to see Jason to apologise and they end up kissing again but are caught by Seth. Bart starts bullying Jason is school to fit in. Bart begins flirting with Ruby Button (Anna Shaffer) and takes her joy riding to impress her, however Jason walks in front of the car. When Bart realises that Jason deliberately stepped into the road he cools things off with Ruby and agrees to support Jason as a friend. Bart gets a part-time as a cleaner in Cinergy Spa. Bart remains close with Jason and it is clear Jason still wants to be with him Bart nearly kisses Jason but starts a relationship with Sinead O'Connor (Stephanie Davis). Myra and Sinead's stepmother, Diane O'Connor (Alex Fletcher), try to stop Sinead and Bart seeing each other so Bart runs away with Sinead. However, when they begin to run short on money, Bart decides to call Jason for some help. Sinead is annoyed about this when Jason turns up. They find an empty farm house, and Jason tells Sinead that Bart loves him not her, and she runs away. Bart and Jason are left in the house when the owner comes home and throws them in a basement, threatening them with a hunter's gun. In an attempt to leave, Bart is pushed to floor and gets a head injury. Jason, thinking he is unconscious, admits his love for him, and Bart tells Jason the same. They kiss again, but Sinead is outside the window and hears all. Bart tries to make it up with Sinead, but is unsuccessful, and the trio return home."]}, {"page": "Duncan Button", "response": ["Duncan's sister Ruby (Anna Shaffer) arrives in the village to get away from their reality TV obsessed parents. Duncan joins a boy band, Guy Candy, with:Ricky, Bart McQueen (Jonny Clarke), Seth Costello (Miles Higson) and Taylor Sharpe (Shaun Blackstock) who is later replaced with Gaz Bennett (Joel Goonan). The band is managed by Lee Hunter (Alex Carter) and struggles to achieve success."]}, {"page": "Leanne Holiday", "response": ["Leanne is one of three new characters created for the Hollyoaks online spin-off Hollyoaks: Freshers who also appear in the main show, along with Jamil Fadel (Sikander Malik) and Doug Carter (PJ Brennan). Newcomer Jessica Forrest was cast in the role having previously studied drama and film studies at the University of Manchester. On joining the show, Forrest said: \"I suppose I was quite scared. At first, I’d heard all this stuff about ‘the industry’, but I soon found out that Hollyoaks is a real team effort – and it’s actually the least intimidating place that I’ve ever worked. Everyone is so approachable and so friendly – you walk down the corridor, and people are smiling at you!\" Forrest also commented that now she is acting, she feels she is where she \"belongs\". The character and casting were announced 15 July 2010. Anna Shaffer originally auditioned for the role of Leanne, but she was later cast as Ruby Button. Hollyoaks: Freshers was created due to the success of spin-off Hollyoaks: The Morning After The Night Before in 2009. The shows executive producer, Lee Hardman, said \"Hollyoaks: The Morning After The Night Before was a huge success for us and we hope to build on that success with Hollyoaks: Freshers, which will explore the concept of multi-layered storytelling - engaging the audience across multiple, digital platforms.\" Jody Smith, Channel 4's cross platform commissioner for drama, entertainment and comedy, added: \"Freshers is an exciting new direction for Hollyoaks. We're introducing a batch of new characters with over 60 minutes of original online drama and social media, telling their back-stories and journey to Hollyoaks before they arrive on TV. It will be a fun, fast-moving adventure, featuring some cast favourites and many surprises along the way.\" Forrest began filming her scenes in June 2010. Forrest originally commuted from Manchester to Liverpool, where Hollyoaks is filmed, for the role. The actress later relocated to Liverpool."]}, {"page": "Ruby Button", "response": ["Ruby Button is a fictional character from the British Channel 4 soap opera, Hollyoaks, played by Anna Shaffer. Shaffer's casting was announced in December 2010 and it was revealed that Ruby would be introduced as the sister of Duncan Button (Dean Aspen). Shaffer originally auditioned for the role of Leanne Holiday, in which she was not successful. Shaffer began filming her scenes in late 2010 and relocated to Liverpool for filming. Ruby made her first appearance in the episode broadcast on 3 January 2011. In October 2013, it was announced that Shaffer had quit the role and would leave in February 2014. In October 2017, speculation emerged indicating Shaffer was to reprise the role very soon and on 16 November 2017, it was confirmed that Ruby would be back for Frankie Osborne's funeral later that month. She returned on 23 November 2017, departing in the following episode, broadcast on 24 November 2017. She made another return for a guest stint at the end of April 2018, making her final appearance on 30 April.", "In December 2010, the Liverpool Echo reported that eighteen-year-old Shaffer would be joining the cast of Hollyoaks as Ruby, the sister of Duncan Button (Dean Aspen). Shaffer originally auditioned for the role of Leanne Holiday, but she was later cast as Ruby. Shaffer relocated to Liverpool, where Hollyoaks is filmed, for the role. She began filming her scenes in late 2010. Shaffer made her first on-screen appearance as Ruby in the episode broadcast on 3 January 2011. In May 2011, it was speculated that Shaffer would be leaving Hollyoaks. However, this was denied and a show spokesperson told Digital Spy \"We don't want to spoil the storylines for the viewers, however we can confirm that Anna Shaffer is with Hollyoaks for the foreseeable future.\""]}, {"page": "List of American films of 2011", "response": ["| Harry Potter and the Deathly Hallows – Part 2 || Warner Bros. Pictures / Heyday Films || David Yates (director); Steve Kloves (screenplay); Daniel Radcliffe, Rupert Grint, Emma Watson, Helena Bonham Carter, Robbie Coltrane, Warwick Davis, David Bradley, Tom Felton, Ralph Fiennes, Michael Gambon, John Hurt, Jason Isaacs, Gary Oldman, Alan Rickman, Maggie Smith, Jim Broadbent, Timothy Spall, David Thewlis, Emma Thompson, Julie Walters, Mark Williams, Bonnie Wright, Matthew Lewis, James Phelps, Oliver Phelps, Chris Rankin, Natalia Tena, Evanna Lynch, Adrian Rawlins, Geraldine Somerville, Ciarán Hinds, Domhnall Gleeson, Clémence Poésy, Kelly Macdonald, Helen McCrory, Miriam Margoyles, Gemma Jones, Jessie Cave, Afshan Azad, Anna Shaffer, Georgina Leonidas, Devon Murray, Freddie Stroma, Alfred Enoch, Katie Leung, Ralph Ineson, Scarlett Byrne, Josh Herdman, George Harris, Guy Henry, Nick Moran, Dave Legeno, Alfie McIlwain, Ellie Darcey-Alden, Leslie Phillips || Fantasy || "]}, {"page": "List of Hollyoaks characters (2011)", "response": ["Ruby Button, played by Anna Shaffer, is the younger sister of Duncan Button (Dean Aspen). She made her first on-screen appearance on 3 January 2011. In December 2010, the Liverpool Echo announced that eighteen-year-old Shaffer would be joining the cast as Ruby. They said the character \"will cause mayhem at the expense of her brother\". Ruby has been described as \"sneaky\". Shaffer also announced her character during the Hollyoaks Christmas Music Show in 2010.si In a poll run by Inside Soap to see which Hollyoaks character out of Ruby, Leanne Holiday (Jessica Forrest), Rae Wilson (Alice Barlow) and Theresa McQueen (Jorgie Porter) readers most wanted Silas Blissett (Jeff Rawle) to kill off next. Ruby came in second place with 21% of the vote.", "Pete is first seen in Northern Ireland when Cheryl Brady (Bronagh Waugh), Lynsey Nolan (Karen Hassan) and Mercedes Fisher (Jennifer Metcalfe) see him on their visit, he reveals he is moving to Hollyoaks. On Pete's arrival in the village he starts working as the headmaster at Hollyoaks High. He hires Amy Barnes (Ashley Slanina-Davies) as a classroom assistant, he reveals to her that he used to be as bad as Brendan before he was paralysed. He warns Brendan that he is going to get revenge on him. He agrees to keep an eye on Ste Hay (Kieron Richardson) for Amy. He tells Warren Fox (Jamie Lomas) about Brendan's past. He makes all students aware he is not to be messed with through his no-nonsense schooling. Pete helps tutor pupil Ruby Button (Anna Shaffer) through her reading difficulties. Ruby becomes infatuated with Pete and eventually kisses him during one of her tutorials. Pete develops feelings for Amy, but she doesn't notice his attentions.", "Jono meets up with Bart in Abersoch with his friends Maddie and Tilly. Jono reveals that he and Maddie will be joining the Hollyoaks Sixth Form College in September. Jono arrives in Hollyoaks alongside Maddie to attend Ruby Button's (Anna Shaffer) party. He then starts college and makes friends with Neil Cooper (Tosin Cole). Jono and Neil claim to know all about dating females to impress the rest of the students. Jono turns up at Ruby's birthday party because he feels guilty that non-of friends attended. He shares a kiss with Ruby, and they decide to go on a date. Maddie attempts to put Jono off Ruby, by teasing him about her age. She starts belittling her and embarrassing the pair. Jono becomes ashamed of Ruby and tries to keep their relationship a secret. The first time they have sex is cut short as Jono does not last long. This causes awkwardness between the two and they decide to sleep together again to correct it. Ruby begins to want their relationship to become official, but when Maddie orders Jono to reveal who he is dating, he lies about her identity to impress her. When Ruby claims that she is with Jono, he humiliates her in front of his friends who laugh at her. Ruby dumps Jono. They reconcile their relationship when Jono gains the courage to tell her how he feels in front of his friends.", "Neil arrives in Hollyoaks village and joins the sixth form college. He begins working for Tony Hutchinson (Nick Pickard), who offers him driving lessons. Neil prepares to take his driving test and the group rely on him to drive them to a gig once he has passed. Neil fails his driving test but lies that he has passed. While driving the group to the gig Neil crashes Bart McQueen's (Jonny Clarke) car, angering him. Neil begins sending Mitzeee (Rachel Shenton) gifts, leading her to believe she has a stalker. Neil eventually tells her he is her admirer but did not send her the majority of gifts. Neil accompanies Jono and Bart on holiday to Amsterdam and gets to meet Lethal Bizzle. Lacey Kane (Georgia Bourke) invites Neil to watch a film and she tells Ally Gorman (Daniel O'Connor) that Neil is coming on to her and he threatens Neil. Neil joins his friends on a journey in a stolen minibus for Jono and Ruby Button's (Anna Shaffer) wedding. The bus crashes and everyone presumes Neil is dead. Maddie is the last to escape from the wreckage and Neil awakes and begs her for help. Maddie leaves Neil to die as the bus explodes. The bus explodes and Maddie blames Esther for the crash but before she can continue the flaming minibus door slams into her killing her.", "Michaela asks Sam, Danny, Louis and Laurence if they can form a band. However, they are not impressed with Michaela's vocals. They remove Michaela from the band which makes her dump Sam. They invite Matt to join as their drummer and Sam reconciles with Michaela. Laurence and Louis move in with Frankie Osborne (Helen Pearson) and Ruby Button (Anna Shaffer) plants stolen money on them. They forgive her when she tells Frankie the truth. Michaela tells Sam that a scout is going to visit the band's performance at the SU Bar. They nearly mess their performance up after a technical fault and think that the scout did not show. Michaela uploads video footage of the performance and sends it to the scout. Louis reveals that they have been offered a developmental contract in London. The band then leave to start a new life in London."]}, {"page": "Anna shaffer", "response": ["#REDIRECT Anna Shaffer"]}, {"page": "Maddie Morrison", "response": ["Bart and his girlfriend, Sinead along with Ruby Button (Anna Shaffer) and Esther Bloom (Jazmine Franks), decide to go on holiday to Abersoch after Bart and Sinead completed their GCSE exams. Bart travels to Abersoch ahead of the girls and they later arrives to find him sleeping on the sofa with Maddie. Maddie tells Sinead that she is Bart's ex-girlfriend and reveals that she is joining the same sixth form college as him. Maddie attends Ruby's and Esther's party in Hollyoaks. Maddie goes to Bart's party and after discovering that he is no longer in a relationship with Sinead, flirts with him. Sinead sees this and kisses Maddie's boyfriend, Toby (Alex Roe), leaving Maddie angry. Sinead insists that she did not know that Toby was Maddie's boyfriend and Maddie forgives her. Sinead tells Maddie that Bart has feelings for trans man, Jason Costello (Victoria Atkin). Maddie then exposes Bart's feelings to the other six formers. Maddie encourages Sinead to begin a relationship with Gaz to keep her away from Bart. Gaz tells Maddie that he prefers her to Sinead and attempts to kiss her, but she refuses. Gaz tells Maddie that he is going to end his relationship with Sinead. Maddie explains this to Tilly, who urges her to tell Sinead, but she refuses. Maddie tells Sinead that Gaz has attempted to kiss her, but she refuses to believe it. Tilly urges Maddie once again when Sinead plans to leave with Gaz. Maddie tells Sinead that Gaz was going to end their relationship; Sinead and Bart reconcile."]}, {"page": "Doug Carter", "response": ["Doug bumps into Jenny (Daisy Turner), whom he knows as \"Bex\", and it is revealed he was once in a relationship with her. They decide to leave together and scam Brendan and Warren Fox (Jamie Lomas). The plan fails and Jenny arranges a date with Silas Blissett (Jeff Rawle), who she intends to drug and steal from. He realises what she is going to do and drugs her before murdering her. Doug is distraught and accuses Brendan of murdering her but he is not charged. Doug and Riley meet Ruby Button (Anna Shaffer) who lies about her identity. Doug takes Ruby to go back to the flat where they kiss, she gets drunk. Doug discovers Ruby's age and takes her home. Seth Costello (Miles Higson) confides in Doug about his father Carl's affair with Mercedes Fisher (Jennifer Metcalfe), behind Riley's back. Warren gets Doug to tell him of the affair and threatens him to keep quiet. Riley is later angry with Doug for keeping the secret. When Silas murders Rae, Brendan is arrested and Doug blames Cheryl Brady (Bronagh Waugh) for giving him an alibi at the time of Jenny's murder. Lynsey Nolan (Karen Hassan) tells Doug that Silas is going to murder again on Halloween and he believes her. He helps her to try and figure who is next victim shall be. However, they fail to stop him from killing again - but he unintentionally kills his daughter, Heidi Costello (Kim Tiddy)."]}, {"page": "George Smith (Hollyoaks)", "response": ["Phoebe is attacked by a thug and is saved by Deena who takes Phoebe and George back to her home. Phoebe thinks that Deena has an ulterior motive, while George thinks she is being friendly. Phoebe finds a photograph of a missing boy she knows and realises that Deena is involved in human trafficking. Deena and Graham Hardman (Steve Marsh) become violent in their attempts to stop George and Phoebe escaping. George escapes and tells Callum that he thinks Phoebe did not. George later finds Phoebe's bracelet and assumes she is safe. He then agrees to stay at Callum's for a while. George struggles to get along with Lacey Kane (Georgia Bourke). Phoebe returns and tells George that Deena and Graham are watching him. Phoebe leads George to Deena, who takes him back to her house and locks him up. Phoebe tells him that she betrayed him to save her dog's life. Deena arranges for George to have sex with a man, who turns out to be an under cover police officer. Phoebe and George decide to run away from the police to avoid being sent into care. Maddie and Callum take George to see his parents. George reveals that he was bullied which eventually led to him leaving home. After he threw his old identity off a cliff, George realises that his family presumed that he killed himself. George reveals that his name is actually Andrew Palmer and returns to his parents who are shocked that he is alive. George plans to go to Jono and Ruby Button's (Anna Shaffer) wedding. Maddie steals a mini van and plans to drive them so they can elope to Gretna Green. They discover the van they have stolen has the wedding cakes from Tony Hutchinson (Nick Pickard), Cindy Cunningham (Stephanie Waring), Ste Hay (Kieron Richardson) and Doug Carter's (PJ Brennan) double wedding. George feels ill and the sight of the cake makes him feel worse so he switches seats with Neil. On their way to drop the wedding cakes off, Bart and Esther try to drive them off the road so they can stop the wedding. Maddie realises the brakes are not working and has to swerve off the road to avoid Leah Barnes (Ela-May Demirican). Maddie crashes in to the wedding venue of the double wedding and the car is upturned. Neil is killed. Maddie helps George escape and he helps her free herself. George thanks Maddie for saving his life and then realises that if he had not switches seats with Neil, Neil would not have died. The van explodes and a falling piece of debris kills Maddie."]}, {"page": "Esther Bloom", "response": ["Esther Bloom is a fictional character from the British Channel 4 soap opera Hollyoaks, played by actor Jazmine Franks. The character made her first on-screen appearance on 18 January 2011. Franks had previously auditioned for roles in the show. She did not think that she had secured the part of Esther and concentrated on her studies until she was informed. As an open lesbian, Esther is comfortable with her sexuality. Since her inception she has shared a friendship with the character Ruby Button (Anna Shaffer) but has long been subjected to her \"bitchy\" comments. She is characterised as having a \"selfless consideration for others\" despite being a \"proverbial punchbag\" for many characters. Esther found confidence when she decided to pursue a fashion career. Franks has said that upon doing so Esther's style also changed.", "Esther is a lesbian and according to a writer from E4.com, Esther is comfortable with her sexuality. She forms a close friendship with fellow character Ruby Button (Anna Shaffer) but is \"she often finds herself at the receiving end of Ruby's bitchy barbs\". She eventually grows in confidence when she decides to follow a career in fashion. While another stated that Esther had long been the \"proverbial punchbag\" of many a Hollyoaks female. Esther is \"overlooked and underloved\" and is one of the serial's characters that do not get their chance in the \"spotlight that they so deserve\". She also has a \"selfless consideration for others\".", "On 11 April 2018, it was announced that Franks had decided to leave the show and had already filmed her final scenes in March. The actress stated that she had enjoyed her time in the role and cited the departure of on-screen grandmother Frankie as a reason for Esther being written out. Franks stated that the show's producer Bryan Kirkwood brought her departure about. He told her \"look, we just think we've come to an end with Esther.\" She was in agreement with him because of her character's lengthy tenure and storylines. Anna Shaffer reprised her role as Esther's foster sister Ruby Button for the character's exit. Esther decides to move to Spain with Ruby after Darcy Wilde (Aisling Jarrett-Gavin) poisons her and she argues with Jack. Esther final scenes aired on 30 April 2018.", "Esther breaks into Frankie (Helen Pearson) and Jack Osborne's (James McKenna) house and takes shelter in the attic. Tom Cunningham (Ellis Hollins) mistakes her for an intruder and knocks her unconscious with a cricket bat. Esther is taken to hospital and Jack tells the police that he hit her to protect Tom. Esther regains consciousness and tells Frankie that she is her granddaughter. She reveals that her father had died and she knew Frankie was his birth mother. Frankie realises that she is telling the truth and invites her to stay with them. When Jack and Gilly Roach (Anthony Quinlan) ask Esther to move out, she threatens to tell the police that Tom is responsible for hitting her. Tom then confesses to the police that he hit Esther. Tom is ordered to face court for his actions and Esther tries to defend his actions, but he is still found guilty. Esther, Ruby Button (Anna Shaffer) and Ricky Campbell (Ashley Margolis) truant from school and play kissing games, then Esther reveals that she is a lesbian. Ruby kisses Esther and Ricky to decide who is the best kisser. Duncan Button (Dean Aspen) develops feelings for Esther, unaware of her sexuality, so she rebuffs his advances. Esther kisses Seth Costello (Miles Higson) as a joke, which humiliates him. Ruby films the kiss and uploads it to her website. Esther feels guilty and refuses kiss Seth again. She tells Ruby that she is in a relationship with Sinead. Ruby questions Sinead who laughs off Esther's lies, but forgives her. Ruby and Sinead make Esther think that Jason is interested in her. They set up a date between the pair, although Jason is unaware of Esther's interest. When she tells Jason that his transgender status would not effect a potential relationship, he reveals that he still likes men. Esther is humiliated and Jason accuses Ruby and Sinead of bullying Esther. Ruby writes a love letter to Amy and addresses it from Esther. After more pranks, Esther soon stands up to Ruby. Ruby apologizes and Esther forgives her."]}, {"page": "Hollyoaks: Enjoy the Ride", "response": ["\"Enjoy the Ride\" is a storyline from the British soap opera Hollyoaks, broadcast between 12 and 16 November 2012 on Channel 4. The storyline focuses on the double wedding of Tony Hutchinson (Nick Pickard) and Cindy Cunningham (Stephanie Waring) alongside Ste Hay (Kieron Richardson) and Doug Carter (PJ Brennan). Jono (Dylan Llewellyn) and Ruby Button (Anna Shaffer) plan to elope to Gretna Green so Maddie Morrison (Scarlett Bowman) steals a minibus. Bart McQueen (Jonny Clarke) and Esther Bloom (Jazmine Franks) plan to stop the wedding. They momentarily distract Maddie, causing her to swerve off the road. Maddie is unable to stop due to the minibus' faulty brakes and crashes into the venue of the double wedding, endangering the wedding party and the occupants of the minibus. The minibus later explodes, causing further danger for the characters. The storyline was announced by the Daily Star on 21 October 2012. They reported that the disaster is the biggest in Hollyoaks yet. Steven Roberts, who plays George Smith, said that after the crash \"no one will be the same, everyone is going to be affected by it in some way\". To promote the storyline a televised advertisement was shown, featuring clips filmed specifically for the trailer. It revealed no details about the plot and was instead about the subtext of the storyline. Filming took place on location at Knowsley Hall, which Pickard described as a \"very grand setting for a big Hollyoaks disaster\". The scenes were filmed over a full week with two days dedicated to the stunt sequences. The filming of the stunts used dummies and stunt doubles and employed a mix of CGI effects and live action.", "In the run-up to Ste Hay (Kieron Richardson) and Doug Carter's (PJ Brennan) double wedding alongside Tony Hutchinson (Nick Pickard) and Cindy Cunningham (Stephanie Waring), Tony confronts Rhys Ashworth (Andrew Moss) about his affair with Cindy. Rhys tells Tony that Cindy ended the affair. Tony tells Rhys to leave Hollyoaks village otherwise Tony will tell Rhys' wife Jacqui McQueen (Claire Cooper) about the affair. Jono (Dylan Llewellyn) and Ruby Button (Anna Shaffer) have a joint stag and hen party, planning to elope to Gretna Green the next day. Esther Bloom (Jazmine Franks), who is being bullied by Maddie Morrison (Scarlett Bowman) attends. Jono comforts Maddie when she is upset and Maddie attempts to kiss Jono but he rejects her; Esther witnesses this. Esther confronts Maddie, who threatens her if she reveals this."]}, {"page": "List of Hollyoaks characters (2013)", "response": ["When Fraser Black's (Jesse Birdsall) daughter Grace Black (Tamara Wall), arrives in the village, it's not long before Trevor and Grace both give into their feelings for each other and kiss. Angry by this, Fraser makes sure Trevor plead guilty to giving Ruby Button (Anna Shaffer) drugs which led her to having a heart attack. Jim McGinn (Dan Tetsell) visits Trevor and reveals that Fraser killed his dad in order for him to help get Fraser locked up. Sam Lomax (Lizzie Roper) promises Trevor to get him out of prison if he confesses to who his boss is; unaware to Jim, Trevor has set him up to be the fall guy and pins everything on him.", "In August 2013, Ziggy begins a relationship with Ruby Button (Anna Shaffer), but has an affair with Frankie Osborne (Helen Pearson) and the relationship ends. He is a model who finds himself out of work quite a lot. He begins modelling for a lonely wives website with help from Nana McQueen (Diane Langton), which puts his potential relationship with Leela Lomax (Kirsty-Leigh Porter) in jeopardy, after she catches him flexing his muscles in the toilets whilst they are on a date. However, they later reconcile. George Smith (Steven Roberts) confides in Ziggy about meeting a man that he came across on an online dating site. Ziggy tells George to go for it, but later discovers that the man was actually Danny Lomax (Stephen Billington) – Leela's father. Leela visits Ziggy and they have sex in a customer's car at the mechanics'. George arrives and talks to Ziggy about Danny, not realising Leela is in the garage and can hear. She blames Ziggy for playing a part in the breakup of her family and ends their relationship. In 2015 he marries Leela, however he is actually in love with her sister Tegan Lomax (Jessica Ellis) . On Christmas Day 2015, Ziggy finally gets together with Tegan, but tragically dies from a brain injury which he got after saving Leela from an explosion caused by Leela's ex-boyfriend Cameron Campbell (Cameron Moore).", "Frank is a football manager who hires Jim McGinn (Dan Tetsell) and his nightclub for a private function. Frank complains about the lack of female company and invites Sinead and Ruby Button (Anna Shaffer) back to his hotel for a party with his football team. He propositions Sinead with £200 in exchange for sex but she refuses. Sinead later returns to accept his offer but she steals his wallet when Frank leaves the room.", "| A doctor who treats Ruby Button (Anna Shaffer) after she is run over by Jack Osborne (Jimmy McKenna).", "| Sinead O'Connor (Stephanie Davis) arranges to meet the punter for sex in her flat. However Sinead changes her plans and asks Ruby Button (Anna Shaffer) to babysit. The punter arrives and Ruby fears that he will assault her."]}, {"page": "List of Hollyoaks characters (2014)", "response": ["| An examiner for Ziggy Roscoe's (Fabrizio Santino) driving exam. Despite being called a \"cow\" by his girlfriend, Ruby Button (Anna Shaffer), she passes him."]}, {"page": "Class (2016 TV series)", "response": ["* Anna Shaffer as Rachel Chapman, Ram's girlfriend", "On 4 April 2016, the main cast of the programme was unveiled. Greg Austin, Fady Elsayed, Sophie Hopkins and Vivian Oparah star as four Sixth Formers, with Austin playing a character named Charlie, while Katherine Kelly portrays Miss Quill, a Coal Hill Academy teacher. Nigel Betts reprises his role as Mr. Armitage from \"Into the Dalek\", \"The Caretaker\" and \"Dark Water\" from the eighth series of Doctor Who. Paul Marc Davis appears in a recurring role in the programme. Anna Shaffer portrays a character named Rachel in the programme."]}, {"page": "For Tonight We Might Die", "response": ["At the prom, Matteusz cheers April up by inviting her to dance with him and Charlie. Tanya is able to attend, while Ram attends with his date, Rachel (Anna Shaffer). April experiences pains from being linked to Corakinus, and Corakinus appears and kills Rachel, severs Ram's leg, and crushes Quill's gun. The Doctor (Peter Capaldi) arrives to rescue them. Corakinus states that he is here for the Cabinet of Souls, the resting place for Charlie's people after they die; the Kin believe it to be a weapon. Charlie says that the Cabinet is empty. Tanya, with assistance from the Doctor, turns on the gym's flood lights to eliminate the shadows that give the Kin substance. "]}]}}