{"wiki_id": "http://www.wikidata.org/entity/Q5302004", "itemLabel": "Douglas Straight", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Douglas_Straight", "wikipedia_page": {"main": "Sir Douglas Straight (22 October 1844 – 4 June 1914) was an English lawyer, Member of Parliament, judge and journalist.Straight was born in London and was educated at Harrow School. \nUntil 1865 he engaged in journalism, but then became a lawyer and soon developed an extensive practice, especially at the Central Criminal Court, London. During this time, Straight still maintained his literary interests.  In 1867, he wrote an anonymous memoir of his time at Harrow entitled Harrow Recollections. By an Old Harrovian and signed the preface with the name Sidney Daryl. This was a pseudonym he would use for a number of publications in this era. He wrote plays and stories and about topics that interested him. In 1868, for instance, he compiled Routledge's Handbook of Quoits and Bowls.From 1870 until 1874 Straight was a member of the House of Commons as Conservative Member of Parliament for Shrewsbury. In 1879 he was made a judge of the High Court of Judicature at Allahabad in India. To mark this appointment Vanity Fair caricatured him: The Hon Mr Justice Straight, the new Judge. After thirteen years of judicial service abroad he was knighted soon after his return from India in 1892.In 1876, Straight was admitted by redemption to the Freedom of the Worshipful Company of Bowyers of the City of London. He served two terms of office as Master in 1900–1902 and 1910–1912.\nFour years later Straight began work again as a journalist, as joint editor of the Pall Mall Magazine (1893–1896) and then editor of the Pall Mall Gazette (from 1896). He was a well known society personage during this time and as an editor he corresponded with many of the famous literary names of the day. Straight retired \"from everything except the task of trying to enjoy himself\" in 1909, and died in London five years later, aged 69.", "link_mentions": {}}}