{"wiki_id": "http://www.wikidata.org/entity/Q5302055", "itemLabel": "Douglas Vernon", "itemDescription": "English footballer (1905-1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Douglas_Vernon", "wikipedia_page": {"main": "Douglas Sydney Vernon (19 May 1905 – 26 March 1979) was an English amateur footballer who made five appearances for Southampton in the Football League in 1929. He also played for Wycombe Wanderers, with whom he won an FA Amateur Cup winner's medal in 1931.", "link_mentions": [{"page": "Doug Vernon", "response": ["#REDIRECT Douglas Vernon"]}, {"page": "1928–29 Southampton F.C. season", "response": ["Transfers continued throughout the season for Southampton. In September the club signed outside-left Johnny Arnold from Oxford City, and in October they brought in inside-left Herbert Coates from the Royal Navy. Before the end of the year the club also signed Newport County centre-forward Archie Waterston, and broke their transfer record with the £1,000 signing of outside-right Bobby Weale from Swindon Town. Due to ongoing injury problems for his side's regular centre-forward Haines, in February 1929 Chadwick brought in former Royal Air Force aircraftsman Douglas Vernon to help with the end of season run-in. The final signings of the season were goalkeeper Bert Scriven from Totton and inside-left Ernie Warren from Third Division North side Lincoln City in March 1929. During the season, \"big offers\" had also been made by various clubs to sign players including Ted Hough, Arthur Bradford, Stan Cribb and Dick Rowley, although the club's directors had \"wisely resisted\" them.", "!scope=\"row\"|Douglas Vernon", "Despite winning just one of their three matches during the month, in January the Saints moved up to third in the table, keeping up with leaders Chelsea and Middlesbrough. 2–1 wins over struggling sides Bristol City and Wolverhampton Wanderers in February helped them to remain in the running, holding off fellow challengers Grimsby Town who were in the middle of a five-game winning run. However, the team began struggling for goals due to Haines being injured, with his replacement Douglas Vernon failing to score in his five league appearances. A string of three consecutive losses in March saw the team as low as seventh in the table, although wins over Nottingham Forest and Millwall at the tail end of the month brought them back into the top four. Southampton continued to pick up wins, but Grimsby's ongoing form saw them pull ahead of the Saints and third-placed Bradford Park Avenue; the club finished in fourth with 17 wins, 14 draws and 11 losses, five points behind the first promotion place.", "!scope=\"row\"|Douglas Vernon"]}, {"page": "1929–30 Southampton F.C. season", "response": ["Several players left Southampton at the end of the 1928–29 season. In May, inside-forward Tommy Taylor joined Welsh side Rhyl Athletic, while centre-forward Douglas Vernon – signed as an emergency replacement for Willie Haines in February – was recalled by the Royal Air Force. In June, the club sold outside-left Billy Murphy to fellow Second Division club Oldham Athletic, with fellow winger Reg Watson moving the other way as part of the deal. Also in June, the Saints signed inside-forward Bill Fraser from Aldershot Town in an \"unusually complicated deal\" including an initial payment of £60, another £200 from a friendly match between the two sides, £50 if he made 20 appearances for the first team during the season (which he did not), and a 5% share of any future transfer fee. The following month, inside-left Charlie Petrie and Scottish centre-forward Archie Waterston both moved to the Third Division North – the former joined York City, while the latter joined Tranmere Rovers. In August, Southampton brought in two more players – inside-right Oswald Littler joined from Rochdale (after a Football Association suspension for the player was lifted upon appeal by the club), and full-back Arthur Roberts signed from Ardsley Athletic.", "!scope=\"row\"|Douglas Vernon"]}]}}