{"wiki_id": "http://www.wikidata.org/entity/Q5314367", "itemLabel": "Duncan Glasfurd", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Duncan_Glasfurd", "wikipedia_page": {"main": "Brigadier General Duncan John Glasfurd (23 November 1873 – 12 November 1916) was a British Army and later Australian Army colonel and temporary brigadier general in the First World War. He was mentioned in despatches for his role in evacuating Anzac Cove. He was mortally wounded by a German shell at Flers.", "link_mentions": [{"page": "List of Australian Army generals", "response": ["|Brigadier General ||  ||1873||1916|| Ross Mallett,  Brigadier General Duncan Glasfurd , General Officers of the First AIF, adfa.edu.au (British officer)"]}, {"page": "John Gellibrand", "response": ["When the First World War broke out on 4 August 1914, Gellibrand offered his services to the commandant of the 6th Military District (Tasmania). On 20 August 1914, he was appointed to the Australian Imperial Force (AIF) as a captain, and given the post of Deputy Assistant Quartermaster General (DAQMG) on the staff of the 1st Division. Staff college graduates like Gellibrand were scarce in Australia; only six Australian Army officers had graduated from staff colleges. There were also four of the British Army's graduates on secondment. For the 1st Division's General Staff (G) Branch, the division commander, Major General William Bridges, chose two of Gellibrand's Camberley classmates, Lieutenant Colonel Brudenell White from the Australian Army, and Major Duncan Glasfurd from the British Army, and Captain Thomas Blamey, an Australian Army officer who had graduated from the Staff College, Quetta. The Administration (A) Branch was headed by the AA & QMG, Colonel Victor Sellheim. Lieutenant Colonel W. G. Patterson was his deputy, the DAA & QMG. As DAQMG, Gellibrand was responsible for logistics; Major Cecil Foott, an Australian 1913 Camberley graduate, was the Deputy Assistant Adjutant General (DAAG), responsible for personnel matters. On 23 September 1914 Gellibrand was promoted to major, the usual rank for his post."]}, {"page": "Raymond Leane", "response": ["After the battalion moved to France, its first serious fighting was during the Battle of Pozières on the night of 5/6 August, when it was committed to defend ground captured by the Australian 2nd Division. On receiving his orders, Leane immediately reconnoitred the position with his company commanders, during which they were pinned down by a German barrage and two of them were wounded. His brigade commander, Brigadier General Duncan Glasfurd and his superior commanders believed that a strong German counterattack would follow the tremendous barrage then falling on the Australian-held positions. Glasfurd therefore ordered Leane to place two companies north of Pozières, but Leane was convinced that this would overcrowd the area and result in needless casualties. His plan was to garrison his two trenches with one company each and hold his two reserve companies well to the rear of the village and he confronted Glasfurd and demanded written orders. Glasfurd then gave Leane a written order that his two reserve companies were to be sent forward, but Leane remained defiant, stationing only one company north of Pozières. According to Bean, while disobedience of orders is a dangerous practice in general, in this case later events proved that Leane was fully justified in this action. According to the historian Craig Deayton, Leane was already the dominant influence in the brigade, and was proving to be a \"difficult subordinate\" for Glasfurd. Leane was not alone in his approach, as the commanding officer of the flanking 14th Battalion, Lieutenant Colonel Charles Dare, adopted the same disposition and disobeyed his own brigade commander in doing so. Leane later described the relief of the previous garrison as the worst he experienced in the whole war, conducted as it was under a tremendous German bombardment. When he visited his front lines in the early morning, he found remnants of his two companies, scattered among shell holes rather than trenches, and surrounded by dead and wounded."]}]}}