{"wiki_id": "http://www.wikidata.org/entity/Q5312321", "itemLabel": "Duff Hart-Davis", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Duff_Hart-Davis", "wikipedia_page": {"main": "Peter Duff Hart-Davis (born 3 June 1936), generally known as Duff Hart-Davis is a British biographer, naturalist and journalist, who writes for The Independent newspaper. He is married to Phyllida Barstow and has one son and one daughter, the journalist Alice Hart-Davis. He lives at Owlpen, in Gloucestershire.\nHe is the eldest son of the publisher Rupert Hart-Davis and the brother of television broadcaster and author Adam Hart-Davis and Bridget, the dowager Lady Silsoe. His biography of his godfather, the adventurer and writer Peter Fleming, entitled Peter Fleming: A Biography, was published in 1974.", "link_mentions": [{"page": "Georgette Heyer", "response": ["Despite her popularity and success, Heyer was largely ignored by critics other than Dorothy L. Sayers, who reviewed An Unfinished Clue and Death in the Stocks for The Sunday Times. Although none of her novels was ever reviewed in a serious newspaper,Byatt (1975), p. 297. according to Duff Hart-Davis, \"the absence of long or serious reviews never worried her. What mattered was the fact that her stories sold in ever-increasing numbers\". Heyer was also overlooked by the Encyclopædia Britannica. The 1974 edition of the encyclopædia, published shortly after her death, included entries on popular writers Agatha Christie and Sayers, but did not mention Heyer.Fahnestock-Thomas (2001), p. 261."]}, {"page": "Adam Hart-Davis", "response": ["He was married to Adrienne Alpin (m. 1965–1995), with whom he had two sons, Damon and Jason Hart-Davis.  His second wife is psychologist Dr. Susan Blackmore, whom he married on 19 June 2010. His siblings are the journalist Duff Hart-Davis and Bridget, the dowager Lady Silsoe. He is an uncle of the journalist Alice Hart-Davis."]}, {"page": "Peter Fleming (writer)", "response": ["Peter Fleming was the godfather of the British author and journalist Duff Hart-Davis, who wrote Peter Fleming: A Biography (published by Jonathan Cape in 1974).  Duff's father Rupert Hart-Davis, a publisher, was good friends with Peter, who gave him a home on the Nettlebed estate for many years and gave financial backing to his publishing ventures."]}, {"page": "1936 in literature", "response": ["**Duff Hart-Davis, English biographer and journalist"]}, {"page": "Philip de László", "response": ["In 1939, Portrait of a Painter. The Authorized Life of Philip de László by Owen Rutter, written in conjunction with de László, was published. In 2010, Yale University Press published De László, His Life and Art by Duff Hart-Davis and Dr. Caroline Corbeau-Parsons. His reputation still remains largely as a society portrait painter, but well numbered amongst his sitters were industrialists and scientists, politicians and painters, men and women of letters and many other eminent, as well as ordinary, people. Family members and a team of editors are compiling a catalogue raisonné published online and in progress. His oeuvre currently numbers almost 4,000 works, including drawings."]}, {"page": "London Library", "response": ["Vice-presidents have included Lord Lyttelton, Sir Isaiah Berlin, Sir Rupert Hart-Davis, Lord Kenyon, Lord Rayne, Hon. Sir Steven Runciman, Dame Veronica Wedgwood, Dame Rebecca West, Paul Boateng, Lady Antonia Fraser, Caroline Michel, Jeremy Paxman Alexandra Schulman and Josie Rourke. Trustees have included Philip Ziegler, Correlli Barnett, Bamber Gascoigne, Lewis Golden, John Gross, Duff Hart-Davis, Sir Charles Johnston, Sir Oliver Millar, Anthony Quinton, Christopher Sinclair-Stevenson, and Claire Tomalin."]}, {"page": "List of Old Etonians born in the 20th century", "response": ["*Duff Hart-Davis (born 1936), author and journalist"]}, {"page": "William Berry, 1st Viscount Camrose", "response": ["* The House the Berrys Built by Duff Hart-Davis. Concerns the history of the Daily Telegraph from its inception to 1990."]}, {"page": "Peter de la Billière", "response": ["De la Billière was educated at St Peter's Court School, in Broadstairs, Kent,Wellesley House: Alumni  and Harrow School. A \"Peter de la Billière\" is mentioned as pupil evacuee of St Peter's Court sent to Crediton, Devon in Our Land at War by Duff Hart-Davis."]}, {"page": "North Yemen Civil War", "response": ["According to Duff Hart-Davis, the British mercenary leader Jim Johnson had originally considered buying their own aircraft, a Lockheed Constellation 749.Hart-Davis, 2012. Chapter 6: Manna from Heaven. page 136. He then flew to Teheran to try to persuade the Iranians to do an air drop.Hart-Davis, 2012. Chapter 6: Manna from Heaven. page 137. Hart-Davis further claims that success was finally achieved by an adviser to the mercenaries, the MP Neil \"Billy\" McLean, who privately (without the British government's knowledge) flew to Tel Aviv to meet Moshe Dayan, defense minister, and Meir Amit, head of Mossad.Hart-Davis, 2012. Chapter 6: Manna from Heaven. page 138. According to \"Haaretz\" newspaper, Tony BoyleTony Boyle had been a pilot in the Royal Air Force, then Aide-de-Camp to the Governor of Aden. He had never been in the SAS, pace Haaretz. (Hart-Davis, 2012. page xvi) contacted David Karon, the head of the Middle East department in the Tevel (Cosmos) section of the Mossad, and met with IAF commander Ezer Weizman and his officers. It was decided that the airdrops would be made. Haaretz suggested the crew of the airdrops were British; while according to Hart-Davis the crew were Israeli (including the pilot named Arieh Oz), with Tony Boyle on board as an observer.Hart-Davis, 2012. Chapter 6: Manna from Heaven. page 147. Three decades after the war, former Mossad director, Shabtai Shavit, and Ariel Sharon both said Israel had been clandestinely involved in Yemen, though both remained vague concerning the nature and scale of the involvement. The airlifts were originally codenamed Operation Gravy, but were later renamed Operation Porcupine. The IAF's largest transport plane, a Stratofreighter, was recruited for the British operation. According to Jones, what is clear however is that some of the mercenary air drops to the royalists (code-named \"Mango\") were organized by the British using an aircraft, which were contracted privately from IAF to the British mercenary operation and were either using Israeli air bases or Israeli transport planes themselves making the drops.Jones, C. Britain and the Yemen Civil War, 1962–1965. Sussex Academic Press (2004). p.136 "]}, {"page": "David Trustram Eve, 2nd Baron Silsoe", "response": ["Educated at Elm Park Preparatory School, County Armagh, Sandroyd School, Winchester College and Christ Church, Oxford, he was called to the Bar in 1955.  In 1963 he married Bridget Min Hart-Davis, daughter of Sir Rupert Hart-Davis and sister of Duff Hart-Davis and  Adam Hart-Davis.  He took silk in 1972."]}, {"page": "Category talk:British journalists", "response": ["Duff Hart-Davisnot yet classified"]}, {"page": "Raoul Millais", "response": ["*Duff Hart-Davis, Raoul Millais: his life and work (1998) "]}, {"page": "Alan Hillgarth", "response": ["Hillgarth was born George Hugh Jocelyn Hillgarth Evans (called \"Hugh\" by his family) at 121, Harley Street, Marylebone, London, second of three sons (there were also two daughters) of Willmott Henderson Hillgarth Evans, a leading London surgeon specialising in skin diseases, and his wife Ann Frances, daughter of Rev. George Piercy, a pioneer Methodist minister in China.Franco's Friends: How British Intelligence Helped Bring Franco to Power in Spain, Peter Day, Biteback Publishing Ltd, 2011 Hugh changed his name to \"Alan Hugh Hillgarth Evans\" in 1926, and in 1928 discontinued use of the surname \"Hillgarth Evans\" in favour of \"Hillgarth\".Man of War, Duff Hart-Davis, Arrow Books, 2013, pp. 9–10, 76–78Ian Fleming and Operation Golden Eye: Keeping Spain out of World War II, Mark Simmons, Casemate Publishing, 2018"]}, {"page": "Hart-Davis", "response": ["* Duff Hart-Davis (born 1936), British biographer, naturalist and journalist"]}, {"page": "List of British people with German ancestry", "response": ["* Duff Hart-Davis, biographer and journalist, son of Rupert Hart-Davis"]}, {"page": "The Daily Telegraph", "response": ["* The House The Berrys Built by Duff Hart-Davis. Concerns the history of The Daily Telegraph' from its inception to 1986. Illustrated with references and illustrations of William Ewart Berry, 1st Viscount Camrose (later called Lord Camrose). "]}, {"page": "Alice Hart-Davis", "response": ["Born in Builth Wells, the daughter of the biographer and journalist Duff Hart-Davis, and a granddaughter of publisher and biographer Rupert Hart-Davis,Hart-Davis family websiteDaily Telegraph 5 January 2008 Alice Hart-Davis was brought up in Henley-on-Thames and educated at Headington School before reading history at St Edmund Hall, Oxford. She is also a niece of the broadcaster Adam Hart-Davis."]}, {"page": "Family of David Cameron", "response": ["Cameron is a nephew of Sir William Dugdale, brother-in-law of Katherine, Lady Dugdale (died 2004, former lady-in-waiting to the queen), who was chairman of Aston Villa Football Club. Birmingham-born documentary filmmaker Joshua Dugdale is his cousin. Cameron's other notable relations include Adam Hart-Davis, Duff Hart-Davis, Ferdinand Mount (Sir Ferdinand Mount Bt FRSL),  John Julius Norwich (The Viscount Norwich CVO), Boris Johnson who is the current prime minister of the U.K., Jo Johnson who was a Conservative MP for Orpington, Rachel Johnson (8th cousins)."]}, {"page": "Take Over (James Bond)", "response": ["Peter Fleming's biographer Duff Hart-Davis could not imagine anybody \"harder-headed than Peter\" in such matters, yet Peter Fleming readily agreed to read the manuscript.", "Privately Peter Fleming thought the novel unusually incompetent, the story \"implausible and silly,\" the style \"a tasteless pastiche of the original\", and the novel utterly and suspiciously devoid of sex. Yet the matter intrigued him. No matter how Peter Fleming looked at the matter, \"a lot of energy was at work here.\" Vera allegedly had \"no literary background\" nor did she apparently show any \"inclination\" to write fiction. Further, she worked full-time, had a house to run and an ailing husband to care for. Peter Fleming believed that under normal circumstances it would have been remarkable enough for someone like herself and in her position to write over one hundred thousand words in eight months. Duff Hart-Davis, himself also a novelist, notes that \"the sheer energy needed to put 100,000 words on paper is enormous,\" and could not discern where Vera's \"momentum could have emanated.\"", "Peter Fleming read this manuscript and dismissed the stories as \"tosh.\" According to author Duff Hart-Davis, the works were \"crude, devoid of literary merit, and all almost exactly the same\" despite purportedly being the work of different authors with distinct prose styles."]}, {"page": "Fighter Pilot (TV series)", "response": ["A book of the television series was produced by Colin Strong and co-written with the author, Duff Hart-Davis."]}, {"page": "Duff (given name)", "response": ["*Duff Hart-Davis (born 1936), British biographer, naturalist and journalist"]}, {"page": "Convent of Poor Clares, Woodchester", "response": ["Duff Hart-Davis visited the convent for a 1998 article in The Independent on Sunday and met the Mother Abbess, Sister Mary Anthony, and a Sister Mary Therese. Hart-Davis reported that the nuns' primary source of income was the production of altar breads, of which they made five million a year, earning them £25,000. The nuns also had a vegetable garden and an orchard and kept bees, cows, and chickens. Hart-Davis also wrote about the nuns' Christmas celebrations and reported that they did not have a television, but borrowed one for Christmas and Easter."]}]}}