{"wiki_id": "http://www.wikidata.org/entity/Q5314266", "itemLabel": "Duncan Barrett", "itemDescription": "writer and editor who specialises in biography and memoir", "wikipedia_url": "https://en.wikipedia.org/wiki/Duncan_Barrett", "wikipedia_page": {"main": "Duncan Barrett is a writer and editor who specialises in biography and memoir. After publishing several books in collaboration with other authors, he published his first solo book, Men of Letters, in 2014. Barrett also works as an actor and theatre director.", "link_mentions": [{"page": "Oral history", "response": ["Writers who use oral history have often discussed its relationship to historical truth. Gilda O'Neill writes in Lost Voices, an oral history of East End hop-pickers: \"I began to worry. Were the women's, and my, memories true or were they just stories? I realised that I had no 'innocent' sources of evidence - facts. I had, instead, the stories and their tellers' reasons for remembering in their own particular ways.'  Duncan Barrett, one of the co-authors of The Sugar Girls describes some of the perils of relying on oral history accounts: \"On two occasions, it became clear that a subject was trying to mislead us about what happened – telling a self-deprecating story in one interview, and then presenting a different, and more flattering, version of events when we tried to follow it up. ... often our interviewees were keen to persuade us of a certain interpretation of the past, supporting broad, sweeping comments about historical change with specific stories from their lives.\" Alessandro Portelli argues that oral history is valuable nevertheless: \"it tells us less about events as such than about their meaning [...] the unique and precious element which oral sources force upon the historian ... is the speaker's subjectivity.\""]}, {"page": "Dominion War", "response": ["The resurgence in the conflict provided opportunities to introduce problems such as post-conflict psychological trauma in \"The Siege of AR-558\" and injury when the character of Nog undergoes leg amputation in \"It's Only a Paper Moon\". Moore has said that the plot of this episode was agreed on after an \"extended argument\" between Behr and Deep Space Nine creator Rick Berman and that such discussions were a common occurrence when war casualties were considered. Michele and Duncan Barrett perceive the allusions made to the traumas of World War I.", "Academics have noted how the Dominion War plotlines have explored the human psyche as much as outer space. Lincoln Geraghty praises the ending to the story arc and Star Trek: Deep Space Nine as a series, and believes this is indicative of how the series manipulates the Star Trek ethos, identifying a theme of ambiguity as part of its continuing narrative. Karin Blair, writing in 1997 at the time of Season Five, felt that the series was reflecting trends for American culture to re-consider its place in the global community. Michele and Duncan Barrett comment on the \"declining faith in rationalism that haunts Deep Space Nine\" in their book Star Trek: The Human Frontier. Back cover.", "While television commentators and fans have noted associations with the Yugoslav Wars in the 1990s, some academics have noted parallels between the portrayal of the Dominion War and other historical conflicts. Michele and Duncan Barrett identify a number of themes relating to World War I in Star Trek, especially \"in the bleak and costly alliances and endless casualty sheets that characterize the protracted Dominion War in DS9.\""]}, {"page": "Silvertown", "response": ["The Sugar Girls, by Duncan Barrett and Nuala Calvi, tells the true stories of women who worked at Tate & Lyle's Silvertown factories, and features much detail on the area."]}, {"page": "Star Trek: The Motion Picture", "response": ["According to Michele and Duncan Barrett, Roddenberry had a decidedly negative view of religion that was reflected in the Star Trek television series episodes; in the episode \"Who Mourns for Adonais?\", for example, the god Apollo is revealed to be a fraud, an alien rather than a divine being from Earth's past.Barrett, 142. When Apollo suggests that humans need a new pantheon of gods, Kirk dismisses the idea with the words, \"We find the one quite sufficient.\" In comparison, religious scholar Ross Kraemer says that Roddenberry \"pulled his punches\" regarding religion and in the television show religion was not absent but highly private.Kraemer et al, 9. Barrett suggests that with the Star Trek feature films this attitude of not addressing religious issues shifted."]}, {"page": "North Sea flood of 1953", "response": ["* The 2012 non-fiction book, The Sugar Girls, by Duncan Barrett and Nuala Calvi, describes the effects of the flood in East London, and on workers at Tate & Lyle's East End factories."]}, {"page": "Ronnie Le Drew", "response": ["* Zippy and Me: My Life Inside Britain’s Most Infamous Puppet, Ronnie Le Drew, Nuala Calvi, Duncan Barrett, Unbound Publishing, 2019, 416 pages, "]}, {"page": "Mortal Coil (Star Trek: Voyager)", "response": ["In this episode, Neelix's religious faith is seriously challenged; he eventually chooses to live without it. Chakotay serves as a counterpoint to his perspective, encouraging Neelix not to abandon all faith. In Star Trek: The Human Frontier, Michèle and Duncan Barrett discuss this episode as an example of Star Trek's shifting attitudes towards religion, specifically Voyager's treatment of religious faith and how it can change. The Barretts contrast this episode with \"Sacred Ground,\" in which the rationalist Captain Janeway (Kate Mulgrew) is forced to accept the possibility of forces outside rational explanation. Both episodes are considered as illustrations of how \"Star Trek articulates the conflicts between religion and science that continue to recur in modern western thought.\""]}, {"page": "Joe Thomas (actor)", "response": ["After entering the performing arts via the Footlights, Thomas performed with fellow University of Cambridge students at the Edinburgh Festival Fringe in a production of All's Well That Ends Well directed by author Duncan Barrett."]}, {"page": "Barrett (name)", "response": ["* Duncan Barrett (born 1983), English author"]}, {"page": "Ronald Skirth", "response": ["Many years later, after retiring from a career as a teacher, he wrote a memoir of his years in the army, describing his disillusionment with the conduct of the war and his conversion to pacifism. In 2010 the memoir was published as The Reluctant Tommy, edited by Duncan Barrett.", "In 2010 the memoir was published in book form by Macmillan, as The Reluctant Tommy: Ronald Skirth's Extraordinary Memoir of the First World War, edited by Duncan Barrett.  Barrett wrote in an introduction that he felt that Skirth's story \"deserved as wide an audience as possible—and to be read in its protagonist's own words\".Skirth and Barrett 2010, p.xv.  Skirth's daughter Jean, who had given permission for the memoir to be published remained uncertain whether publishing the memoir was what her father would have wanted, but believed that it was important that his story should be widely known. "]}, {"page": "The Reluctant Tommy", "response": ["The Reluctant Tommy is a book compiled by Duncan Barrett from the memoirs of Ronald Skirth, a member of the Royal Garrison Artillery during the First World War.  His experiences during the Battle of Messines, the Battle of Passchendaele and the Second Battle of the Piave River, which Skirth calls the Battle of the Asiago Plateau, were detailed in this book. The book captured attention due to Skirth's actions during the war to avoid enemy casualties.  The manuscript was known only by the family for decades before finally being published in 2010. The book received favourable reviews on publication, but was also criticised for significant historical inaccuracies.", "In 2010 the memoir was published in book form by Macmillan, as The Reluctant Tommy: Ronald Skirth's Extraordinary Memoir of the First World War, edited by Duncan Barrett.  Barrett wrote in an introduction that he felt that Skirth's story \"deserved as wide an audience as possible—and to be read in its protagonist's own words\".  Skirth's daughter Jean, who had given permission for the memoir to be published remained uncertain whether publishing the memoir was what her father would have wanted, but believed that it was important that his story was widely known.  The book carried a foreword by Channel 4 News anchor Jon Snow, in which he wrote about his grandfather Lieutenant-General Sir Thomas D'Oyly Snow. Referring to the popular description of the lower ranks as \"lions led by donkeys\", Snow acknowledged that \"If Ronald Skirth was a 'lion', Thom Snow was ultimately a 'donkey'.\""]}, {"page": "The Sugar Girls", "response": ["The Sugar Girls: Tales of Hardship, Love and Happiness in Tate & Lyle's East End is a bestselling work of narrative non-fiction based on interviews with women who worked in Tate & Lyle's East End factories in Silvertown from the mid-1940s onwards. Written by Duncan Barrett and Nuala Calvi, it was published by Collins in 2012. The authors were inspired to write it by Jennifer Worth's Call the Midwife.Call the Midwife, The Sugar Girls blog, 20 February 2012.", "In the same article, Calvi also commented on the discrepancy between the way the East End of London is often represented – 'linked in the popular imagination with gangsters, criminals and prostitutes (or the grim squalor of Call the Midwife)' – and the reality of life for the families of the women she interviewed – 'honest, hard-working families' who 'brought up their children to contribute to the family income'.  In a separate article, her co-author Duncan Barrett made a similar point: 'The women we spoke to recalled the great pride their mothers would take in keeping their houses spotless and how, despite a lack of money, families would always make do, helping out the neighbours when they could, knowing that the favour would always be returned. When we handed in the manuscript of the book, our publishers were a little surprised, perhaps expecting the predicable Dickensian East End of much misery-memoir writing. 'This is a lot jollier than we expected,' they told us.'"]}, {"page": "Call the Midwife (book)", "response": ["The success of Call the Midwife led publishers to release many similar real-life stories about nurses, midwives, and life in the East End of London in the 1950s, most notably Edith Cotterill’s Nurse on Call (Ebury, 2010), and Dot May Dunn’s midwife memoir Twelve Babies on a Bike (Orion, 2010). They both went into the Sunday Times bestseller lists.  Some writers acknowledged the inspiration they took from Worth’s writing – Duncan Barrett and Nuala Calvi, authors of The Sugar Girls, wrote that their \"aim was to capture a lost way of life, just as Jennifer Worth had done\", describing the midwife books as their \"touchstone\"."]}, {"page": "Duncan barrett", "response": ["#REDIRECT Duncan Barrett "]}, {"page": "GI Brides", "response": ["GI Brides: The Wartime Girls Who Crossed the Atlantic for Love is a bestselling book by Duncan Barrett and Nuala Calvi, authors of The Sugar Girls.  It was published by HarperCollins on 29 August 2013."]}, {"page": "Men of Letters", "response": ["Men of Letters: The Post Office Heroes who Fought the Great War is a book by Duncan Barrett, co-author of The Sugar Girls and GI Brides and editor of The Reluctant Tommy.  It was published by AA Publishing on 1 August 2014 and officially launched on 4 August to marked the hundredth anniversary of Britain's declaration of war."]}, {"page": "Shindig! (magazine)", "response": ["Shindig! was set up to explore music and pop culture from the late 1960s, covering obscure cult and collectable acts as well as mainstream artists such as the Who, the Byrds and the Kinks. It also covers new acts related to its genres of interest. Noted contributors include writers Kris Needs, John Harris, Simon Matthews and Duncan Barrett and the comedian Stewart Lee. Radio 2's Stuart Maconie, Rough Trade Records' Geoff Travis and David Fricke, the veteran US rock writer and senior editor of Rolling Stone, are high-profile fans of the magazine."]}]}}