{"wiki_id": "http://www.wikidata.org/entity/Q5318011", "itemLabel": "Dwayne Mattis", "itemDescription": "English footballer (born 1981)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dwayne_Mattis", "wikipedia_page": {"main": "Dwayne Anthony Mattis (born 31 July 1981) is a professional footballer. He is a midfielder who joined League Two Macclesfield Town in January 2012.\nMattis began his career as a trainee with Huddersfield Town, debuting on 1 May 1998 in the First Division match which Huddersfield drew 2–2 with Crystal Palace. Mattis came on as a 38th minute substitute for Jon Dyson.\nMattis played his second match - the final game of 1998–99 - eight days later, but did not play again until the second game of 2001–02, more than two years later. However, this was the breakthrough season for Mattis, who played a total of 29 league matches that season. Another full season followed, but in 2003–04 Mattis played only five games, including just one full match - the 6–2 defeat at Scunthorpe United.\nReleased at the season's end, Mattis joined Bury and made his debut on 7 August 2004 in the 3–1 home win over Yeovil Town. He has appeared regularly for the club since then.\nMattis has represented the Republic of Ireland at under-21 level.\nOn 10 January 2007, Mattis joined Barnsley after two unsuccessful bids despite offers from MK Dons. The final fee was £50,000 rising to £75,000 if Barnsley avoid relegation, plus a 20% sell on fee.\nIn September 2007 he signed for Walsall on a month-long loan deal but suffered a broken leg in a 0–0 draw with Tranmere Rovers and was sent back to Barnsley where he is expected to be out for three months.Mattis was released by Barnsley on 30 June 2008, after having his contract terminated by mutual consent. On 3 July 2008, he signed a permanent contract with Walsall returning to the club he had a successful loan spell with during the previous season. He was released by Walsall on 10 May 2010 along with six other players. He signed a two-year deal with Chesterfield F.C. on 21 May 2010. He made a flying start to his Chesterfield career, scoring in his first three games against Barnet in the league, against Middlesbrough in the League Cup and Port Vale in the league.\nFollowing an injury and subsequent operation, appearances in the first team were limited and in January 2012, his contract was cancelled by mutual consent. On 20 January 2012, he signed a contract until the end of the 2011–12 season with Macclesfield. In May 2012, Mattis was released by Macclesfield due to the expiry of his contract.", "link_mentions": [{"page": "Chesterfield F.C.", "response": ["Since the 2010–11 season, Chesterfield have played their home games at the £13 million B2net Stadium. The first match was against Derby County in a pre-season friendly, which Derby won 5–4, Craig Davies becoming the first goalscorer at the stadium. The first competitive fixture was against Barnet, which ended in a 2–1 win after Dwayne Mattis scored the opening League goal at the ground in the first half. Chesterfield suffered their first home league defeat at the B2net Stadium after a 2–1 loss at Burton Albion on 13 November 2010. The highest attendance at the B2net Stadium was 10,089 at home to Rotherham United which they won 5–0 with Jack Lester getting a hat-trick. On 13 August 2012, it was announced that the Stadium was to be renamed the Proact Stadium."]}, {"page": "Rhys Weston", "response": ["After spending time on trial with a club in Romania, Weston was signed by Walsall, also of League One, on 16 July 2007. He made his debut for the club on 18 August in a 1–0 defeat at Leyton Orient. He played in fifty games in 2007–08 before penning a new two-year deal in March. On 20 September 2008, he was sent off for the first time in his career. The match was a bad tempered affair at Brighton's Withdean Stadium, Weston was dismissed after 15 minutes and was followed by teammate Netan Sansara on 33 minutes, despite this a 44th minute Dwayne Mattis header earned the \"Saddlers\" a 1–0 win. Weston played 31 games that season and scored the third goal of his career on Boxing Day, a 64th-minute winner against Stockport County at the Bescot Stadium. He made thirty appearances in the 2009–10 season, before manager Chris Hutchings decided against offering him a fresh contract at the end of the season."]}, {"page": "2003–04 Huddersfield Town A.F.C. season", "response": ["|19||Dwayne Mattis||||MF||2 (3)||0||0 (1)||0||0||0||0||0||0||0||2 (4)||0"]}, {"page": "Mattis", "response": ["* Dwayne Mattis (born 1981), professional footballer"]}, {"page": "2002–03 Huddersfield Town A.F.C. season", "response": ["|33||Dwayne Mattis||||MF||27 (6)||1||1||0||1 (1)||0||1||1||30 (7)||2"]}, {"page": "2001–02 Huddersfield Town A.F.C. season", "response": ["|33||Dwayne Mattis||||MF||21 (8)||1||2||0||0 (1)||0||3||0||0||0||26 (9)||1"]}, {"page": "1998–99 Huddersfield Town A.F.C. season", "response": ["|Dwayne Mattis||||MF||0 (2)||0||0||0||0||0||0 (2)||0"]}, {"page": "2008–09 Barnsley F.C. season", "response": ["|align=center|Dwayne Mattis"]}, {"page": "Technique Stadium", "response": ["The first competitive league fixture (Football League Two) was against Barnet on 7 August 2010. The game finished with a 2–1 victory to Chesterfield. Dwayne Mattis and Jack Lester were the goalscorers."]}, {"page": "Will Grigg", "response": ["Having courted interest from West Bromwich Albion, Grigg signed a scholarship at League One side Walsall in the summer of 2008. Assigned the number 24 shirt, he made his league debut as an 89th-minute substitute for Dwayne Mattis in a 0–0 draw with Cheltenham Town on 20 December 2008. Grigg was an unused substitute for a 2–1 defeat away to Tranmere Rovers on 28 December 2008 and made no further appearances in the first team squad during the 2008–09 season. Grigg made no appearances during the 2009–10 season, but was an unused substitute on 20 occasions. Grigg featured regularly as a second-half substitute during the 2010–11 season and made his first start for Walsall in a 1–0 FA Cup second round defeat at Torquay United on 27 November 2010. He made his first league start in a 1–0 away win against Charlton Athletic on 12 December 2010. He scored his first senior goal in a 2–2 league draw against Bristol Rovers on 11 January 2011. Grigg finished the 2010–11 season having made 30 appearances and scored 4 goals. Grigg made 32 appearances and 4 four goals during the 2011–12 season."]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Dwayne Mattis||||1999–2004||50 (19)||2||3 (1)||0||1 (2)||0||5||1||0||0||59 (22)||3"]}, {"page": "2010–11 Chesterfield F.C. season", "response": ["|align=\"left\"| Dwayne Mattis", "| Dwayne Mattis"]}, {"page": "2011–12 Macclesfield Town F.C. season", "response": ["|12 ||MF || ||31 ||Dwayne Mattis || 1 || 0 || 0 || 0 || 1", "| Dwayne Mattis"]}, {"page": "2011–12 Chesterfield F.C. season", "response": ["|Dwayne Mattis", "| Dwayne Mattis"]}, {"page": "2009–10 Walsall F.C. season", "response": ["|Dwayne Mattis"]}]}}