{"wiki_id": "http://www.wikidata.org/entity/Q5314310", "itemLabel": "Duncan Chisholm", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Duncan_Chisholm", "wikipedia_page": {"main": "Duncan Chisholm (born 31 October 1968) is a Scottish fiddle player and composer. He has released six solo albums as a solo artist. His studio album, Affric, released in 2012, was longlisted for the Scottish Album of the Year (SAY) Award. In 2018, he released a sixth studio album, titled Sandwood. He tours with the Scottish Gaelic singer Julie Fowlis' band. He is also a founder member of the folk rock group Wolfstone. He played fiddle for Runrig.", "link_mentions": [{"page": "List of folk musicians", "response": ["*Duncan Chisholm"]}, {"page": "HMY Iolaire", "response": ["A memorial was erected in 1958 at Holm, outside Stornoway. A stone pillar sticks out of the water at the site of the wreck, which can be seen to starboard as the car ferry approaches the harbour entrance. The community-led commemoration of the centenary was marked in a number of ways including by musicians such as Julie Fowlis and Duncan Chisholm, as well as local artists such as Malcolm Maclean. The disaster has been included in the Arts and Humanities Research Council \"Living Legacies (1914-18)\" project, led by Abertay University and The Centre for History, University of the Highlands and Islands and the resulting app highlights the nature and extent of the loss felt by families and communities."]}, {"page": "Wolfstone", "response": ["The roots of Wolfstone go back to when fiddler Duncan Chisholm met guitarist Stuart Eaglesham at a pub session. An idea becoming realised, Stuart's brother and keyboard player, Struan Eaglesham, was offered a place in the line-up, as was piper Allan Wilson from Bonar Bridge. Roger Niven from the Black Isle played guitar, but was soon replaced by Andy Murray. In 1989, Wolfstone performed their opening show at the first Highland Traditional Music Festival in Dingwall, supplemented by sequenced bass and drums. Following this, the band ran the usual Highlands and Islands village dance hall circuit, gaining live experience. It was clear that this was a worthwhile venture, the gigs earning them more than their day jobs. During this period, Wolfstone recorded two albums - Wolfstone and Wolfstone II respectively - on Rowan Records, utilising sequencing machines over a standard rhythm section. These albums were produced by David Foster, who also contributed vocals to some of the tracks. However, he parted ways with Wolfstone in 1990 over disagreement on the band's direction. Also in 1990, Orcadian Ivan Drever joined the band on vocals, guitars, and songwriting duties. Soon, Wolfstone were offered a recording contract with Iona Records in Glasgow, and in 1991, began work on Unleashed, allowing them to guest drummer John Henderson and bassist Neil Hay for a decidedly more authentic sound. Mid-process, they were offered a support slot at Runrig's major Loch Lomond Midsummer event,Morton, Tom: Going Home, page 200. Mainstream, 1991.  alongside such acts as CapercaillieMorton, Tom: Going Home, page 201, 202. Mainstream, 1991. and Hothouse Flowers.Morton, Tom: Going Home, page 197, 201. Mainstream, 1991. This exposure brought the band larger gigs and shows, playing to new audiences. Ultimately, Unleashed was a success, achieving silver status in the UK.", "1992 saw Wolfstone enter the studio once again to record their follow-up album, The Chase. By this time, piper Allan Wilson had left the band, and his position was filled for several years by a string of different session musicians, including Roddy McCourt, Dougie Pincock, Gordon Duncan and Martyn Bennett. The Chase proved a success, achieving gold status. The band were once again made busy touring, with the addition of TV appearances, for example the 1993 edition of Children in Need. An EP entitled Burning Horizons was released in 1993, consolidating bassist Wayne Mackenzie and drummer Mop Youngson as full-time members. In 1994, Wolfstone signed to Green Linnet Records, which consequently saw the release of Year of the Dog. About this time, the Celtic Records label reissued the band's early albums, Wolfstone and Wolfstone II.  Duncan Chisholm says: \"We disown those two albums. The band we are in does not reflect what was going on then; a different line up with different ideas and objectives; anyone buying those two albums is not buying a Wolfstone recording. We would never promote them and we certainly wouldn't sell them to anyone.\" Despite this, the first of these albums received a positive reception from AllMusic. In late 1994, the position of piper was finally consolidated when Stevie Saint joined the band full-time. He has remained in the line-up ever since. In 1996, Wolfstone released their fourth album, The Half Tail.", "Wolfstone perform pieces from the traditional folk and Celtic repertoire permeated with rock and roll sensibilities. This was perhaps most obvious on the early Wolfstone and Wolfstone II albums which featured prominent walking bass-lines. As well as this, the band is also a source of both original tunes and songs. Previous material stemmed, though not exclusively, from collaborations between Ivan Drever and Duncan Chisholm, as well as Drever's own compositions. Only more recently have Duncan Chisholm and Stuart Eaglesham written songs together. Wolfstone's songs vary greatly in subject matter. They explore emigration and displacement (\"Burning Horizons\", \"Braes of Sutherland\"), social injustice (\"Close It Down\", \"Brave Foot Soldiers\") and conflict (\"White Gown\", \"Brave Boys\"), amongst other things. They have also recorded several traditional songs which happen to work well in a rock setting", "* Duncan Chisholm – fiddle (1989–present)", "* The Lewis Blue (1998) (An album by Duncan Chisholm and Ivan Drever, lead members of Wolfstone at the time of release)"]}, {"page": "Sandwood Bay", "response": ["In January 2018 Scottish fiddle player Duncan Chisholm released his sixth solo album, inspired by Sandwood Bay, entitled Sandwood. In December of the same year the Scots Trad Music Awards named the album their album of the year. Duncan Chisholm participated in a subsequent podcast hosted by Matthew Bannister as part of his \"Folk on Foot\" broadcasts, in which folk musicians revisit specific geographic locations that have inspired them in their creative works. Chisholm took Bannister to Sandwood Bay to discuss how this affected him in the making of his 2018 album. "]}, {"page": "List of Scottish musicians", "response": ["*Duncan Chisholm, fiddle player, founder member of Wolfstone"]}, {"page": "Scottish fiddling", "response": ["The West Coast, Gaelic, and Highland styles also include the Inner and Outer Hebrides and Argyllshire. These regions place great value upon the pipe march, due to the significance of the bagpipe in their respective cultures. The Cape Breton style of fiddle music is related to these styles of music, the Cape Bretoners having come from the Highlands to Nova Scotia in the 1800s. West coast fiddlers include Angus Grant (Senior), Iain MacFarlane (Glenfinnan), Archie MacAlistair (Campbeltown), Alasdair White (Lewis), Allan Henderson (Mallaig), Eilidh Shaw (Taynuilt) and Eilidh Steel (Helensburgh). Highland fiddlers include the late Donald Riddell (d. 1992), and his former pupils Duncan Chisholm (Kirkhill), Bruce MacGregor (Inverness), Sarah-Jane Summers (Inverness), Alexander Grant of Battangorm (1856–1942), and Lauren MacColl (Fortrose).", "*Duncan Chisholm", "Notable fiddlers from Scotland today include Aly Bain,  Bruce MacGregor, Johnny Cunningham, Duncan Chisholm, John Martin, John McCusker, Chris Stout, Iain MacFarlane, Charlie McKerron, Eilidh Shaw, Ryan Young, Douglas Lawrence, Gregor Borland, Catriona MacDonald, Alasdair White, Paul Anderson, and Aidan O'Rourke.", "*Duncan Chisholm"]}, {"page": "Murdo Macfarlane", "response": ["In 1974, Macfarlane wrote the song \"Cànan nan Gàidheal\"  (\"Language of the Gaels\") which criticized the tendency of Gaels to switch to English.Murchadh MacPhàrlain. Dir. Iain MacLeòid. BBC News. BBC Alba, 2000. 04 Jan. 2017. The song has been recorded by Dick Gaughan, Catherine-Ann MacPhee, Karen Matheson, Tannas, Dan ar Braz and Tide Lines. An Irish-language version, Teangaidh or Teanga na nGael, has been recorded by the Irish group Cór Thaobh a' Leithid. and by the singer/songwriter Gráinne Holland. An instrumental version was recorded by Scottish fiddler Duncan Chisholm."]}, {"page": "Scots Trad Music Awards", "response": ["* Online Performance of 2020: Duncan Chisholm's Covid Ceilidh", "* Album of the Year :  Sandwood by Duncan Chisholm", "* Composer of the Year:  Duncan Chisholm", "* Album of the Year: Live at Celtic Connections by Duncan Chisholm", "* Instrumentalist of the Year: Duncan Chisholm", "* Album of the Year: Farrar by Duncan Chisholm"]}, {"page": "The Chase (Wolfstone album)", "response": ["*Duncan Chisholm: fiddle"]}, {"page": "Blazin' Fiddles", "response": ["*Duncan Chisholm from Kirkhill on fiddle."]}, {"page": "Bothy Culture", "response": ["To celebrate the 20th anniversary of Bothy Culture, and the 25th anniversary of the Celtic Connections festival, arranger and conductor Greg Lawson's GRIT Orchestra, named after Bennett's final album Grit (2003) and containing some 100 traditional folk, classical and jazz musicians, performed the show Bothy Culture and Beyond at the SSE Hydro, Glasgow as part of the festival on 27 January 2018. The shows were billed as a \"music-vision-dance-bike spectacular,\" and feature Lawson's rearrangements of the tracks from the album, as well as visual spectacles, including internationally famous Scottish stunt cyclist Danny MacAskill, whose appearance was inspired by the film The Ridge (2014), in which MacAskill performed a stunt to the soundtrack of Bennett's \"Blackbird\". The show was Lawson and the GRIT Orchestra's second tribute to a Bennett album, following their Celtic Connections tribute to his final album Grit in 2015, although the orchestra was even bigger for Bothy Culture and Beyond, adding a backline of Scottish fiddlers including Duncan Chisholm, Chris Stout and Aidan O'Rourke. Lawson was a friend of Bennett, and when asked why he chose to perform Bothy Culture, he said:"]}, {"page": "Seven (Wolfstone album)", "response": ["The band \"split up\" in 1998, where they found themselves £40,000 in debt as, throughout their career, \"they had seen a lot of people make money out of the band, but very little of that ever trickled down to the band members.\" The \"split\" was picked up by the newspapers and national radio in a particularly negative way and to the casual reader may have led to the impression that the wider interest in traditional music was in decline, and many people were annoyed by the coverage. Furthermore, the band could not \"really plan any future work as Wolfstone\" whilst still under the contract of their record label Green Linnet Records. A collaboration album between Drever and the band's bassist Wayne Mackenzie, originally released as Drever-Mackenzie in 1997, was re-released as Wolfstone album entitled This Strange Place in 1998 as a contract filler. The album, which features a much softer tone than Wolfstone, was released to mixed reviews when issued as a Wolfstone album, with many fans unaware that this was a repackaging of a side-project release and that the band had not \"mellowed\". Drever and the band's fiddlist Duncan Chisholm recorded their side-project collaboration album The Lewis Blue, released on Wolfstone's former label Iowa Records in 1998, before Drever himself left Wolfstone, leaving Eaglesham by default to become the sole leading force in the band.", "*Duncan Chisholm – vocals, fiddle."]}, {"page": "Kris Drever", "response": ["*Farrar – Duncan Chisholm (2008)"]}, {"page": "Ivan Drever", "response": ["Ivan Drever is a Scottish folk singer, songwriter and guitarist. He often tours with fiddler Duncan Chisholm who founded the Celtic rock band Wolfstone which Drever joined in 1990 but left in later years. Drever has mixed traditional folk with some rock and roll sounds.", "In 1989 he released his debut album, Homeland. In 1990 Drever joined Wolfstone where he played guitar, cittern, whistle, mandola and pipes as well as providing lead vocals and songwriting but pursued a flourishing career of solo and duo work. In 1998 Drever and Duncan Chisholm released their own album, Lewis Blue. In the early 1990s Drever released a duo album with fellow Wolfstone member, Struan Eaglesham. 'Long December Night' is a recent duo album (also released as DVD) with Duncan Chisholm. Apart from his continuing collaboration with Duncan Chisholm, Drever has often joined up with other musicians, either as a duo with Bruce MacGregor, as Band with \"The Vast Majority\" or with former Wolfstone members Mop Youngston and Andy Murray as \"The Black Sheep\" in 2007. Due to Mop Yongston's illness, they could not continue touring. This project, however, has been revived as the Ivan Drever Band. The current line-up now includes Finlay Wells (bass), Iain Coates (drums) and Andy Murray (guitar). In 1998, he took a side-project from Wolfstone with the album This Strange Place, although this album was marketed as a Wolfstone album. That same year, he and Duncan Chisholm issued their collaboration album, The Lewis Blue.", "with Duncan Chisholm"]}, {"page": "Unleashed (Wolfstone album)", "response": ["*Duncan Chisholm: fiddle"]}, {"page": "Year of the Dog (album)", "response": ["*Duncan Chisholm: fiddle"]}, {"page": "The Half Tail", "response": ["#*Duncan Chisholm", "*Duncan Chisholm: fiddle"]}, {"page": "Almost an Island", "response": ["# \"Where the Summers Go\" (Duncan Chisholm/Stuart Eaglesham) – 4:07", "*Duncan Chisholm – fiddle, backing vocals"]}, {"page": "Terra Firma (Wolfstone album)", "response": ["*Duncan Chisholm: fiddle"]}, {"page": "This Strange Place", "response": ["Wolfstone's The Half Tail was released in 1996 to success. Following this, Ivan Drever worked on a side-project involving some of Wolfstone's line-up, but primarily with bassist Wayne Mackenzie. The project, entitled \"This Strange Place\", resulted in a ten-track album recorded for Green Linnet records. Green Linnet, however, ultimately released the album as a Wolfstone recording, and so the band's popularity waned as fans were led to believe that Drever's mellow style was the new direction Wolfstone were taking. Drever later left the band before the release of Seven in 1999. Drever and Duncan Chisholm released The Lewis Blue in 1998 which was noted, musically, as being closer to being a Wolfstone album than This Strange Place."]}, {"page": "Burning Horizons", "response": ["*Duncan Chisholm: fiddle"]}, {"page": "Canaich", "response": ["Canaich is the fourth solo album by Scottish fiddler Duncan Chisholm. It was released in early 2010. The album forms the second part of his intended \"Strathglass Trilogy\" which began with the release of Farrar in 2008.", "Category:Duncan Chisholm albums"]}, {"page": "Farrar (album)", "response": ["Farrar is the third solo album by Scottish fiddler Duncan Chisholm. It was released in 2008. The album forms the first part of Chisholm's \"Strathglass Trilogy\", and won him the MG Scots Alba Album of the Year 2008.", "Category:Duncan Chisholm albums"]}, {"page": "Coast (folk rock band)", "response": ["On 9 April 2010, it was announced that Coast would play their first non-UK show at the annual Tønder Festival in Denmark at the end of August 2010. Coast played on the same stage as the Scottish folk rock bands Wolfstone and The Chair. In May 2010, Eastham and then-bassist Adam Bowden collaborated with the Kent-based musician Trevor Osborne to record and produce the England World Cup song \"Go Win for England\". The track was recorded under the pseudonym The Bulldog Brothers and released on the Awen Records label.-  That summer, Coast were runners-up in a competition run by the Southampton-based radio station Wave 105.2 to support Bon Jovi at the O2 arena in London in June 2010. Coast played at the Tønder Festival on 27 and 29 August 2010. The award winning Scottish fiddler Duncan Chisholm from Wolfstone joined Coast onstage to play fiddle on the song \"The Beat of You\", co-written by Coast lead singer Eastham and Iain Bayne.", "On 7 November 2010, Radio Borders gave Coast's new single, \"The Beat of You\" from their upcoming album, its first radio airplay. The single features Duncan Chisholm from Wolfstone. \"The Beat of You\" was released on 19 November 2010 in download format only. Coast released their second album, The Turning Stone, on 7 May 2011 through their own Ruabhal Records label. The band performed an album launch show at The Ironworks in Inverness on the same date. They were supported by Donald MacDonald and The Islands and The Gritters. Eddie Jordan from the Scottish new wave band Fiction Factory joined Coast on stage, playing the accordion on the song \"Oceanos\".", "* Duncan Chisholm (Wolfstone) - fiddle (Tønder Festival 2010, \"The Beat of You\" single, Folk im Schlosshof Festival 2011)"]}, {"page": "Chisholm (surname)", "response": ["* Duncan Chisholm (born 1968), Scottish fiddle player and composer", "* Geoffrey Duncan Chisholm (1931–1994), British urologist"]}, {"page": "The Lewis Blue", "response": ["The Lewis Blue is an album by Scottish Celtic musicians Ivan Drever and Duncan Chisholm, released in 1998. At the time, both musicians were members of Wolfstone (though Drever left shortly after The Lewis Blue's release).", "Category:Duncan Chisholm albums"]}, {"page": "Bruce MacGregor (musician)", "response": ["MacGregor was a pupil of Donald Riddell CBE, who also taught fellow fiddlers Highland Duncan Chisholm and Iain MacFarlane, who both joined MacGregor in the first Blazin' Fiddles line-up.", "* Bruce MacGregor, Duncan Chisholm & Iain MacFarlane - Portrait of a Highland Fiddler"]}, {"page": "Scottish Album of the Year Award", "response": ["* Duncan Chisholm – Affric"]}]}}