{"wiki_id": "http://www.wikidata.org/entity/Q5318860", "itemLabel": "Dymoke White", "itemDescription": "British politician (1888-1968)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dymoke_White", "wikipedia_page": {"main": "Sir Rudolph Dymoke White, 2nd Baronet, DL (11 June 1888 – 25 May 1968) was a Conservative Party politician in England who served as Member of Parliament (MP) for Fareham in Hampshire from 1939 to 1950.\nHe was elected unopposed at a by-election in 1939, after the sitting MP Thomas Inskip was elevated to peerage as Viscount Caldecote.Fareham had been a safe Conservative seat since the constituency was established in 1885, with a Conservative returned unopposed as recently as 1931, and where contested elections had produced huge Conservative majorities (the Tories' 30% majority in 1939 was a lowpoint by Fareham standards). However at the 1945 general election, which the Labour Party won in a landslide, White's majority in Fareham was cut to only 5% of the votes.The Fareham constituency was abolished in boundary changes for the  1950 general election, and White did not contest the new Gosport and Fareham constituency.", "link_mentions": [{"page": "Fareham (UK Parliament constituency)", "response": ["| Dymoke White"]}, {"page": "List of United Kingdom by-elections (1931–1950)", "response": ["|Dymoke White"]}, {"page": "White baronets", "response": ["*Sir (Rudolph) Dymoke White, 2nd Baronet (1888–1968)", "*Sir Headley Dymoke White, 3rd Baronet (1914–1971)"]}, {"page": "1939 Fareham by-election", "response": ["The Conservative candidate, Dymoke White, was returned unopposed.  During World War II, unopposed by-elections were common, since the major parties had agreed not to contest by-elections when vacancies arose in seats held by the other parties; contests occurred only when independent candidates or minor parties chose to stand, and the Common Wealth Party was formed in 1942 with the specific aim of contesting war-time by-elections."]}, {"page": "Sir Rudolph Dymoke White, 2nd Baronet", "response": ["#REDIRECT Dymoke White "]}, {"page": "Sir Dymoke White, 2nd Baronet", "response": ["#REDIRECT Dymoke White"]}, {"page": "Sir Rudolph White, 2nd Baronet", "response": ["#REDIRECT Dymoke White"]}, {"page": "Sir Rudolph Dymoke White", "response": ["#REDIRECT Dymoke White"]}, {"page": "Rudolph Dymoke White", "response": ["#REDIRECT Dymoke White"]}, {"page": "Dymoke (disambiguation)", "response": ["*Dymoke White, 2nd Baronet (1888–1968), Conservative Party politician in England who served as Member of Parliament (MP) for Fareham in Hampshire from 1939 to 1950"]}]}}