{"wiki_id": "http://www.wikidata.org/entity/Q5318715", "itemLabel": "Dylan Evans", "itemDescription": "British psychologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Dylan_Evans", "wikipedia_page": {"main": "Dylan Evans (born August 18, 1966) is a British former academic and author who has written books on emotion and the placebo effect as well as the theories of Jacques Lacan.", "link_mentions": [{"page": "Jacques Lacan", "response": ["Lacan was involved with the Parisian surrealist movement of the 1930s, associating with André Breton, Georges Bataille, Salvador Dalí, and Pablo Picasso. For a time, he served as Picasso's personal therapist. He attended the mouvement Psyché that Maryse Choisy founded and published in the Surrealist journal Minotaure. \"[Lacan's] interest in surrealism predated his interest in psychoanalysis,\" former Lacanian analyst and biographer Dylan Evans explains, speculating that \"perhaps Lacan never really abandoned his early surrealist sympathies, its neo-Romantic view of madness as 'convulsive beauty', its celebration of irrationality.\"Evans, Dylan, \"\"From Lacan to Darwin\" \", in The Literary Animal; Evolution and the Nature of Narrative, eds. Jonathan Gottschall and David Sloan Wilson, Evanston: Northwestern University Press, 2005 Translator and historian David Macey writes that \"the importance of surrealism can hardly be over-stated... to the young Lacan... [who] also shared the surrealists' taste for scandal and provocation, and viewed provocation as an important element in psycho-analysis itself\".David Macey, \"Introduction\" in Jacques Lacan (1994) The Four Fundamental Concepts of Psycho-Analysis, London:Penuin Books, pp. xv-xvi", "André Green objected that \"when you read Freud, it is obvious that this proposition doesn't work for a minute. Freud very clearly opposes the unconscious (which he says is constituted by thing-presentations and nothing else) to the pre-conscious. What is related to language can only belong to the pre-conscious\". Freud certainly contrasted \"the presentation of the word and the presentation of the thing... the unconscious presentation is the presentation of the thing alone\"Sigmund Freud, On Metapsychology (Penguin 1984) p. 207 in his metapsychology. Dylan Evans, however, in his Dictionary of Lacanian Psychoanalysis, \"... takes issue with those who, like André Green, question the linguistic aspect of the unconscious, emphasizing Lacan's distinction between das Ding and die Sache in Freud's account of thing-presentation\". Green's criticism of Lacan also included accusations of intellectual dishonesty, he said, \"[He] cheated everybody... the return to Freud was an excuse, it just meant going to Lacan.\"", "Lacan often used an algebraic symbology  for his concepts: the big other (l'Autre) is designated A, and the little other (l'autre) is designated a.Lacan, J., The Seminar of Jacques Lacan: Book II: The Ego in Freud's Theory and in the Technique of Psychoanalysis 1954–1955 (W. W. Norton & Company, 1991),  He asserts that an awareness of this distinction is fundamental to analytic practice: \"the analyst must be imbued with the difference between A and a, so he can situate himself in the place of Other, and not the other\". Dylan Evans explains that:", "* The big other designates radical alterity, an other-ness which transcends the illusory otherness of the imaginary because it cannot be assimilated through identification. Lacan equates this radical alterity with language and the law, and hence the big other is inscribed in the order of the symbolic. Indeed, the big other is the symbolic insofar as it is particularized for each subject. The other is thus both another subject, in its radical alterity and unassimilable uniqueness, and also the symbolic order which mediates the relationship with that other subject.\"Dylan Evans, An Introductory Dictionary of Lacanian Psychoanalysis (London: Routledge, 1996), p. 133;  translation modified.", "\"It is the mother who first occupies the position of the big Other for the child\", Dylan Evans explains, \"it is she who receives the child's primitive cries and retroactively sanctions them as a particular message\". The castration complex is formed when the child discovers that this other is not complete because there is a \"lack (manque)\" in the other. This means that there is always a signifier missing from the trove of signifiers constituted by the other. Lacan illustrates this incomplete other graphically by striking a bar through the symbol A; hence another name for the castrated, incomplete other is the \"barred other\".Lacan, J., \"The Agency of the Letter in the Unconscious\" in Écrits and Seminar V: Les formations de l'inconscient", "Other critics have dismissed Lacan's work wholesale.  called it an \"incoherent system of pseudo-scientific gibberish\", and quoted linguist Noam Chomsky's opinion that Lacan was an \"amusing and perfectly self-conscious charlatan\".Roustang, François, Lacanian Delusion The former Lacanian analyst Dylan Evans (who published a dictionary of Lacanian terms in 1996) eventually dismissed Lacanianism as lacking a sound scientific basis and as harming rather than helping patients, and has criticized Lacan's followers for treating his writings as \"holy writ\". Richard Webster has decried what he sees as Lacan's obscurity, arrogance, and the resultant \"Cult of Lacan\". Others have been more forceful still, describing him as \"The Shrink from Hell\" and listing the many associates—from lovers and family to colleagues, patients, and editors—left damaged in his wake. Roger Scruton included Lacan in his book Fools, Frauds and Firebrands: Thinkers of the New Left, and named him as the only 'fool' included in the book—his other targets merely being misguided or frauds."]}, {"page": "Keanu Reeves", "response": ["In 1999, Reeves starred in the critically acclaimed science fiction film The Matrix, the first installment in what would become The Matrix franchise. Reeves portrays computer programmer Thomas Anderson, a hacker using the alias \"Neo\", who discovers humanity is trapped inside a simulated reality created by intelligent machines. Written and directed by the Wachowskis, Reeves had to prepare by reading Kevin Kelly's Out of Control: The New Biology of Machines, Social Systems, and the Economic World, and Dylan Evans's ideas on evolutionary psychology. The principal cast underwent months of intense training with martial arts choreographer Yuen Woo-ping to prepare for the fight scenes. The Matrix proved to be a box office success; several critics considered it to be one of the best science fiction films of all time. Kenneth Turan of the Los Angeles Times felt it was a \"wildly cinematic futuristic thriller that is determined to overpower the imagination\", despite perceiving weaknesses in the film's dialogue. Janet Maslin of The New York Times credited Reeves for being a \"strikingly chic Prada model of an action hero\", and thought the martial arts stunts were the film's strongest feature. The Matrix received Academy Awards for Best Film Editing, Best Sound Editing, Best Visual Effects, and Best Sound."]}, {"page": "The Matrix", "response": ["The cast were required to be able to understand and explain The Matrix. French philosopher Jean Baudrillard's Simulacra and Simulation was required reading for most of the principal cast and crew. In early 1997, the Wachowskis had Reeves read Simulacra and Simulation, Kevin Kelly's Out of Control: The New Biology of Machines, Social Systems, and the Economic World, and Dylan Evans's ideas on evolutionary psychology even before they opened up the script, and eventually he was able to explain all the philosophical nuances involved. Moss commented that she had difficulty with this process.", "In The Matrix, a copy of Jean Baudrillard's philosophical work Simulacra and Simulation, which was published in French in 1981, is visible on-screen as \"the book used to conceal disks\", and Morpheus quotes the phrase \"desert of the real\" from it. The term \"desert of the real\" first originated from Jorge Luis Borges' short story \"On Exactitude in Science\" (1946), which Baudrillard references in his essay. \"The book was required reading\" for the actors prior to filming. However, Baudrillard himself said that The Matrix misunderstands and distorts his work. Some interpreters of The Matrix mention Baudrillard's philosophy to support their claim \"that the [film] is an allegory for contemporary experience in a heavily commercialized, media-driven society, especially in developed countries\". \"The influence of [Baudrillard] was brought to the public's attention through the writings of art historians such as Griselda Pollock and film theorists such as Heinz-Peter Schwerfel\". In addition to Baudrillard, the Wachowskis were also significantly influenced by Kevin Kelly's Out of Control: The New Biology of Machines, Social Systems, and the Economic World, and Dylan Evans’s ideas on evolutionary psychology. The film makes several references to Lewis Carroll's Alice's Adventures in Wonderland. Comparisons have also been made to Grant Morrison's comic series The Invisibles, with Morrison describing it in 2011 as \"(it) seemed to me (to be) my own combination of ideas enacted on the screen\". Comparisons have also been made between The Matrix and the books of Carlos Castaneda."]}, {"page": "Index of philosophy articles (D–H)", "response": ["* Dylan Evans"]}, {"page": "Mirror stage", "response": ["Dylan Evans argues that Lacan's earliest versions of the mirror stage, while flawed, can be regarded as a bold pioneering in the field of ethology (the study of animal behavior) and a precursor of both cognitive psychology and evolutionary psychology. In the 1930s, zoologists were increasingly interested in the then-new field of ethology, but not until the 1960s would the larger scientific community believe that animal behavior offered any insights into human behavior.", "*An Introductory Dictionary of Lacanian Psychoanalysis - Dylan Evans"]}, {"page": "Very Short Introductions", "response": ["| 081 || Emotion || Dylan Evans ||    (2nd ed.) || Emotion: The Science of Sentiment, 2001 || psychology"]}, {"page": "Oscar Zárate", "response": ["Oscar Zárate (born 1942) is an Argentine comic book artist and illustrator. Zarate studied architecture and had a successful career in advertising in Argentina. He moved to Europe in 1971 and began to work in earnest as an illustrator. He has drawn for the UK comics magazine Crisis. In the Introducing... and ...For Beginners book series he illustrated texts written by  Richard Appignanesi, Alexei Sayle, Dylan Evans, J P McEvoy, Angus Gellatly, Rupert Woodfin and Christopher Marlowe. He is perhaps best known in the United States as the artist for the graphic novel A Small Killing written by Alan Moore, the  a full-length story about a once idealistic advertising executive haunted by his boyhood self.", "* Introducing Evolutionary Psychology (Icon Books, 1999) — written by Dylan Evans"]}, {"page": "List of people with surname Evans", "response": ["*Dylan Evans (born 1966), British academic and author"]}, {"page": "List of atheist authors", "response": ["* Dylan Evans (born 1966): British academic and author who has written books on emotion and the placebo effect as well as the theories of Jacques Lacan."]}, {"page": "Edge Foundation, Inc.", "response": [", contributors included Anthony Aguirre, Stephon Alexander, John Allen Paulos, Adam Alter, Alun Anderson, Ross Anderson, Scott Atran, Mahzarin Banaji, Thomas Bass, Sue Blackmore, Paul Bloom, Giulio Boccaletti, Stefano Boeri, Josh Bongard, Nick Bostrom, Stewart Brand, David Buss, William Calvin, Nicholas Carr, Sean M. Carroll, Nicholas Christakis, George M. Church, Andy Clark, Gregory Cochran, James Croak, Satyajit Das, Richard Dawkins, Aubrey De Grey, Daniel Dennett, Emanuel Derman, Keith Devlin, Rolf Dobelli, George Dyson, David Eagleman, Brian Eno, Juan Enriquez, Dylan Evans, Christine Finn, Stuart Firestein, Helen Fisher, Susan Fiske, Tecumseh Fitch, Richard Foreman, Howard Gardner, Amanda Gefter, David Gelernter, Neil Gershenfeld, Gerd Gigerenzer, Marcelo Gleiser, Nigel Goldenfeld, Rebecca Goldstein, Daniel Goleman, Alison Gopnik, Joshua Greene, Jonathan Haidt, Diane Halpern, Kevin Hand, Haim Harari, Sam Harris, Marti Hearst, Roger Highfield, W. Daniel Hillis, Donald D. Hoffman, Gerald Holton, Bruce Hood, Nicholas Humphrey, Jennifer Jacquet, Xeni Jardin, Daniel Kahneman, Kevin Kelly, Douglas Kenrick, Christian Keysers, Vinod Khosla, Marcel Kinsbourne, Jon Kleinberg, Brian Knutson, Bart Kosko, Kai Krause, Lawrence Krauss, Rob Kurzban, George Lakoff, Jaron Lanier, Jonah Lehrer, Garrett Lisi, Seth Lloyd, Stephen M. Kosslyn, Gary Marcus, Hazel Rose Markus, John McWhorter, Thomas Metzinger, Geoffrey Miller, Evgeny Morozov, P.Z. Myers, David Myers, Richard Nisbett, Tor Norretranders, Hans-Ulrich Obrist, Gloria Origgi, Neri Oxman, Mark Pagel, Greg Paul, Irene Pepperberg, Clifford Pickover, Steven Pinker, David Pizarro, Ernst Pöppel, V.S. Ramachandran, Lisa Randall, Martin Rees, Andrew Revkin, Matt Ridley, Matthew Ritchie, Jay Rosen, Carlo Rovelli, David Rowan, Rudy Rucker, Douglas Rushkoff, Paul Saffo, Scott D. Sampson, Robert Sapolsky, Dimitar Sasselov, Richard Saul Wurman, Roger Schank, Kathryn Schulz, Gino Segre, Charles Seife, Terrence Sejnowski, Martin Seligman, Michael Shermer, Clay Shirky, Lee Smolin, Dan Sperber, Tom Standage, Victoria Stodden, Linda Stone, Nassim Taleb, Don Tapscott, Max Tegmark, Richard Thaler, John Tooby, Eric Topol, J. Craig Venter, Eric Weinstein, Frank Wilczek, Dave Winer and Milford Wolpoff. "]}, {"page": "Placebo in history", "response": ["Dylan Evans argues that placebos are linked with activation of the acute-phase response so will work only on subjective conditions such as pain, swelling, stomach ulcers, depression, and anxiety that are linked to this."]}, {"page": "List of British philosophers", "response": ["* Dylan Evans"]}, {"page": "Risk intelligence", "response": ["The UK philosopher and psychologist Dylan Evans defines it as \"a special kind of intelligence for thinking about risk and uncertainty\", at the core of which is the ability to estimate probabilities accurately."]}, {"page": "Power Balance", "response": ["Power Balance headquarters, which was located in Laguna Niguel, California at the time, denied that they made any medical or scientific claims about their products.Power Balance band is placebo, say expert, BBC News, 22 November 2010 However, the company had been the focus of significant criticism, particularly for false advertising. The Power Balance bracelet has been described as \"like the tooth fairy\" <Ref Name=Hall2/> and a \"very successful marketing scam\".'Power' wristbands might be the biggest scam , The Age, June 20, 2010 Dylan Evans, a lecturer in behavioral science at Cork University's School of Medicine and author of Placebo: Mind over Matter in Modern Medicine, stated \"I was really impressed by the marketing. They have managed to get away without deceiving anyone in the sense of an overt lie. There are no claims on the packaging itself. They don't make any reference at all to any health outcomes. They leave that as an inference that most people will draw.\""]}, {"page": "Introducing... (book series)", "response": ["| Evolution ||  || Dylan Evans || Howard Selina || 176 ||  ||  ", "| Evolutionary Psychology ||  || Dylan Evans || Oscar Zárate || 176 ||  ||  "]}, {"page": "Wild man syndrome", "response": ["*Dylan Evans"]}, {"page": "Lacanianism", "response": ["As this concept developed further, the stress fell less on its historical value and more on its structural value.Dylan Evans, An Introductory Dictionary of Lacanian Psychoanalysis In his fourth seminar, \"La relation d'objet\", Lacan states that \"the mirror stage is far from a mere phenomenon which occurs in the development of the child. It illustrates the conflictual nature of the dual relationship. \""]}, {"page": "Geoma Records", "response": ["In spring 2014, Geoma, agreed on a deal with Kobalt Label Services to fulfil their worldwide digital distribution and partner with their current physical distributor Cargo Records. After 2015, off from releasing records Geoma signed a new distribution deal with Republic of Music / Universal for worldwide distribution. In 2016, they planned releases with artists such as Mikey Bromley, Dylan Evans and Joey Devries. Geoma has also extended their arm to producing compilation albums.", "* Dylan Evans"]}, {"page": "Utopia Experiment", "response": ["The Utopia Experiment was an experiment by Dylan Evans, set up in 2006 at Netherton Farm, near Culbokie on the Black Isle peninsula in the Scottish highlands. It involved a group of volunteers improvising a post-apocalyptic lifestyle. It was time-limited to 18 months, and was originally intended to serve as both a learning community (where everyone had a skill of knowledge they could teach the others) and a working community (where everyone would contribute by working)."]}, {"page": "Introducing Evolution", "response": ["Introducing Evolution is a 2001 graphic study guide to Evolution written by Dylan Evans and illustrated by Howard Selina. The volume, according to the publisher's website, \"provides a step-by-step guide to ‘Darwin’s dangerous idea’ and takes a fresh look at the often misunderstood concepts of natural selection and the selfish gene.\""]}, {"page": "List of books featured on Book of the Week in 2015", "response": ["* The Utopia Experiment – Dylan Evans"]}]}}