{"wiki_id": "http://www.wikidata.org/entity/Q5312785", "itemLabel": "Duke Garwood", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Duke_Garwood", "wikipedia_page": {"main": "Duke Garwood (born 1969) is a London-based, English multi-instrumentalist.\n\n", "link_mentions": [{"page": "Morcheeba", "response": ["Morcheeba are an English electronic band formed in the mid-1990s with founding members vocalist Skye Edwards and the brothers Paul and Ross Godfrey. They mix influences from trip hop, rock, folk rock and downtempo, and have produced ten regular studio albums since 1995, two of which reached the UK top ten. Edwards left the band in 2003, after which the brothers used a number of singers before she rejoined in 2009. They recruit additional members for their live performances and have toured internationally. In 2014 Paul Godfrey resigned from the band. Edwards and Ross Godfrey later formed Skye & Ross and released a self-titled album in September 2016. Their latest studio album as Morcheeba, Blackest Blue, was released in May 2021 and was preceded by singles \"Sounds of Blue\", \"Oh Oh Yeah\" and \"The Moon\". It features collaborations with Brad Barr from The Barr Brothers, and Duke Garwood, whom Edwards described as \"a diamond geezer\".", "Blaze Away, Morcheeba's ninth album, was released on 1 June 2018. The album featured the singles \"Never Undo\", \"Blaze Away\" and \"It's Summertime\". On 14 May 2021, Morcheeba released their tenth album, Blackest Blue. It features collaborations with Duke Garwood and Brad Barr and was preceded by singles \"Sounds of Blue\", \"Oh Oh Yeah\" and \"The Moon\". Blackest Blue did not enter the Official Albums UK Top 100 Chart, but peaked at number 14 on the Official Album Downloads Chart Top 100."]}, {"page": "Mark Lanegan", "response": ["Mark William Lanegan (born November 25, 1964) is an American singer, songwriter, author and musician. First becoming prominent as the lead singer for Screaming Trees, he has also been a member of Queens of the Stone Age and The Gutter Twins. He has released 11 solo studio albums since 1990, as well as three collaboration albums with Isobel Campbell and two with Duke Garwood. ", "On April 16, 2013, Lanegan and Duke Garwood released their first studio collaboration, Black Pudding.", "Lanegan's second collaborative album with Duke Garwood, With Animals, was released on August 24, 2018. The pair toured Europe in October 2018 to support the release."]}, {"page": "Heavenly Recordings", "response": ["In 2012 the label released the debut single from  Temples, \"Shelter Song.\" In 2013, they signed Mark Lanegan and Duke Garwood for their collaborative album Black Pudding; both artists are now signed to Heavenly individually. Temples’ debut album Sun Structures, released in 2014, was Heavenly’s 100th album release, a UK Top 10 hit and Rough Trade’s Number 1 Album of the Year.", "* Duke Garwood"]}, {"page": "Ipecac Recordings", "response": ["* Mark Lanegan & Duke Garwood"]}, {"page": "Ipecac Recordings discography", "response": ["|Mark Lanegan / Duke Garwood"]}, {"page": "Fire Records (UK)", "response": ["*Duke Garwood"]}, {"page": "Archie Bronson Outfit", "response": ["The band released their second album, Derdang Derdang on 3 April 2006. The album was recorded in Nashville in the summer of 2005 and produced by Jacquire King. The album received generally excellent reviews, with Uncut, musicOMH and Mojo awarding it four stars out of five. The London listing magazine Time Out awarded it five stars out of five. Both albums Fur and Derdang Derdang feature occasional collaborator and a secret fourth member at the time Duke Garwood on clarinet and rhaita (a Moroccan reed instrument). Archie Bronson Outfit performed a showcase at the 2006 South by Southwest festival in Austin, Texas. The band used to perform on stage accompanied by an illuminated plastic goose. In December 2006, Mojo voted Derdang Derdang fifth best album of 2006 in their end of year poll beating such notables as Cat Power and Sonic Youth."]}, {"page": "Latitude Festival", "response": ["<BR>Duke Garwood"]}, {"page": "Seasick Steve", "response": ["He has toured the UK extensively since 2007 being supported by performers including Duke Garwood, Gemma Ray, Billie the Vision and the Dancers, Amy LaVere, Melody Nelson and Joe Gideon & The Shark. His tours in October 2008 and January 2009 were all sold out and included performances at the Royal Albert Hall, the Edinburgh Queen's Hall, the Grand Opera House in Belfast, the Apollo in Manchester, the City Hall in Newcastle and the London Hammersmith Apollo."]}, {"page": "Mark Lanegan discography", "response": ["===With Duke Garwood===", "|+ List of albums released in collaboration with Duke Garwood", "| \"Cold Molly\"(with Duke Garwood)", "| \"Needle of Death\"(with Duke Garwood)"]}, {"page": "Alexander Tucker (musician)", "response": ["Due to the wider audience gained through this release, more collaborations followed, including work with Stephen O'Malley of Sunn O))) & Khanate on his Ginnungagap side project, and in 2008 as Stephen O'Malley and Alexander Tucker Duo. Other collaborations have included providing the soundtrack to Lali Chetwynd's performance piece at Tate Britain and playing with JOMF, Duke Garwood, Little Wet Horse and more recently with Daniel O'Sullivan and Dave Smith of Guapo under The Stargazers Assistant moniker, and with Jussi Lehtisalo of Circle in Grumbling Fur. In 2008 he recorded and performed the soundtrack for Phil Coy's film Wordland. A second album on ATPR, Furrowed Brow was recorded in his home county of deepest darkest Kent and released in November 2006. One reviewer stated \"Furrowed Brow is without a doubt Tucker’s most accomplished foray into the recorded sphere of everything musical, a great improvement upon his Old Fog collection of 2005\", and another similarly noted that it was \"a bold statement of a record and Alexander Tucker's finest collection of work so far.\" The depth of genres covered by Tucker's work was also noted in Chris Parkin's review for Time Out magazine: \"this astonishing second album is haunted by John Fahey’s mystical guitar style, but Tucker reinterprets and paints over any old influence with a dense and doomy mix of detuned guitars, looped drones and warped harmonies. It’s the equivalent of dubstep for folk traditionalists.\""]}, {"page": "Smoke Fairies", "response": ["* Backing vocals on Duke Garwood's \"Garden of Ashes\" album (Heavenly Recordings, 2017)"]}, {"page": "Le Guess Who?", "response": ["|Beak (band), Bo Ningen,  Duke Garwood, Tim Hecker"]}, {"page": "Blues Funeral", "response": ["*Duke Garwood - guitar (2, 12)"]}, {"page": "Silence Yourself", "response": ["*Duke Garwood – clarinet (11)"]}, {"page": "Heavy Love (Duke Garwood album)", "response": ["Heavy Love is a studio album by English musician Duke Garwood. It was released in February 2015 under Heavenly Recordings.", "Category:Duke Garwood albums"]}, {"page": "Black Pudding (album)", "response": ["Black Pudding is a collaborative album by Mark Lanegan and the multi-instrumentalist Duke Garwood. It was recorded by Justin Smith at Pink Duck Studios and mixed by Alain Johannes at 11AD studios. The album was released in the United Kingdom by Heavenly Recordings on May 13, 2013, and in the United States by Ipecac the following day. The only single from the album, \"Cold Molly\", was released on April 20, 2013, as a Record Store Day exclusive.", "Music written by Duke Garwood and Mark Lanegan, except where noted.", "* Duke Garwood – All Instruments", "Category:Duke Garwood albums"]}, {"page": "Dreamboatsafari", "response": ["Dreamboatsafari is a studio album by the English multi-instrumentalist Duke Garwood. It was released by Fire Records on 25 January 2011.", "* Duke Garwood – vocals, guitar (1-3, 5-13), bass guitar (4, 10), bulbul tarang (13), horns (3), keyboards (4, 9), saxophone (8-9), piano (8)", "Category:Duke Garwood albums"]}, {"page": "The Sand That Falls", "response": ["The Sand That Falls is the third studio album by the English multi-instrumentalist Duke Garwood. It was released by Fire Records in 2009.", "Category:Duke Garwood albums"]}, {"page": "He Was a Warlock", "response": ["He Was a Warlock is an EP by the English multi-instrumentalist Duke Garwood. It was released by Fire Records on May 25, 2009.", "Category:Duke Garwood albums"]}, {"page": "Emerald Palace", "response": ["Emerald Palace is the second studio album by the English multi-instrumentalist Duke Garwood. It was released by Butterfly Recordings on 27 March 2007.", "* Duke Garwood - guitar, horns"]}, {"page": "Holy Week (album)", "response": ["Holy Week is the first studio album by the English multi-instrumentalist Duke Garwood. It was released through Loog Records on 12 September 2005.", "Category:Duke Garwood albums"]}]}}