{"wiki_id": "http://www.wikidata.org/entity/Q5318022", "itemLabel": "Dwayne Plummer", "itemDescription": "English professional footballer (born 1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dwayne_Plummer", "wikipedia_page": {"main": "Dwayne Plummer (born 12 May 1978) is an English former professional football forward. He featured in a Paul Gascoigne skills video as a youngster. He has also represented the Cayman Islands in a 5–0 friendly defeat to American club side D.C. United, but he never played for them in a full international after FIFA ruled that he did not meet eligibility requirements.", "link_mentions": [{"page": "Cayman Islands national football team", "response": ["In 2000, given the status of the Cayman Islands as one of the British overseas territories, the national team attempted to use this as a loophole to call up a number of uncapped players possessing British passports but who had no specific links to the islands. Barry McIntosh, a football agent, was called in to scout players for an upcoming FIFA World Cup qualifier against Cuba and ultimately he secured eight players i.e. Wayne Allison (Tranmere Rovers), Ged Brannan (Motherwell), David Barnett (Lincoln City), Martin O'Connor (Birmingham City), Dwayne Plummer (Bristol City), Barry Hayles (Fulham), Neville Roach (Southend United) and Neil Sharpe (Boreham Wood). With the exception of Allison the players all appeared in a 5–0 friendly defeat against D.C. United but before they could appear in any official internationals FIFA stepped in and barred the players from representing the Cayman Islands due to their failure to satisfy the existing rules for national team eligibility.Footballers whose loved ones have told them who to play for, The Guardian, 5 March 2008 Of the eight players only Hayles went on to play international football, appearing for Jamaica ten times."]}, {"page": "Plummer (surname)", "response": ["*Dwayne Plummer (born 1978), English footballer"]}, {"page": "Tristan Plummer", "response": ["Tristan Daine Plummer (born 30 January 1990) is an English professional footballer who plays for Bitton. He is the younger brother of Dwayne Plummer.Gogglebox star Tristan Plummer on his time playing in Portugal englishplayersabroad.com"]}, {"page": "List of Bristol Rovers F.C. players (25–99 appearances)", "response": ["* Dwayne Plummer played one unofficial game for the Cayman Islands national team in 2000, before being declared ineligible to represent them. He is English-born."]}]}}