{"wiki_id": "http://www.wikidata.org/entity/Q5312007", "itemLabel": "Dudley Tyler", "itemDescription": "footballer (born 1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dudley_Tyler", "wikipedia_page": {"main": "Dudley Tyler (born 21 September 1944) is an English former footballer, born in Salisbury, who played as a winger in the Football League for West Ham United and Hereford United.", "link_mentions": [{"page": "Hereford United F.C.", "response": ["The 1971–1972 season saw the club finish second in the Southern League and gain national prominence due to its exploits in the FA Cup. Charles had departed the club in October 1971 and his successor Colin Addison inherited a side that defeated top-flight Newcastle United in the FA Cup. The star player was Dudley Tyler; Ronnie Radford and Ricky George's goals earned the club a Fourth Round tie against West Ham United where they were defeated in a replay at Upton Park. The Cup run played a part in the club's successful election to the Fourth Division, replacing Barrow."]}, {"page": "1972–73 West Ham United F.C. season", "response": ["|Dudley Tyler"]}, {"page": "Ricky George", "response": ["In January 1971, George was sold to Hereford United where he joined his former Hastings and Barnet teammate Billy Meadows. He took a while to find his feet at Edgar Street under manager John Charles but would soon become involved in arguably the greatest FA Cup shock of all time. Hereford met Newcastle United, of the First Division, in the Third Round at St James' Park and came away with a remarkable 2–2 draw. George was the substitute that day, played for the last 20 minutes and provided a cross that Meadows came within inches of converting. The replay at Edgar Street saw George named as the substitute again. When Malcolm Macdonald put Newcastle 1–0 up late in the game, George was brought on for the injured Roger Griffiths and played a key part in Hereford's triumph. He won possession on the left wing which ultimately led to Ronnie Radford's famous equalising goal. The game went into extra time and George's fresh legs paid dividends. Controlling a pass from Dudley Tyler on the edge of the area, he turned and shot into the bottom left hand corner of the goal, sparking a pitch invasion. Along with Ronnie Radford, George has become part of FA Cup folklore and his achievement is frequently referred to, particularly in the build-up to the FA Cup Third Round."]}, {"page": "List of Hereford United F.C. records and statistics", "response": ["|Dudley Tyler"]}, {"page": "Hereford United 2–1 Newcastle United", "response": ["Almost immediately Newcastle were on the attack as Macdonald latched onto a misdirected header from Ronnie Radford and broke into the Hereford penalty area. However Fred Potter in the Hereford goal saved well at the feet of 'Supermac'. Hereford's Dudley Tyler had a couple of shots in the early stages which McFaul was equal to, before Addison was booked for a late challenge on Irving Nattrass, a foul the Newcastle centre half did not appreciate. From the resulting free kick on the Newcastle left, Potter made a brave save with Pat Howard poised to score.", "|MF ||8 || Dudley Tyler"]}, {"page": "Dudley (given name)", "response": ["*Dudley Tyler (born 1944), English footballer"]}, {"page": "1973–74 West Ham United F.C. season", "response": ["West Ham were knocked out of the FA Cup in a third round replay by Third Division Hereford United. Hereford's team included Dudley Tyler, who had re-signed for them after leaving West Ham earlier in the season. West Ham had been within two minutes of defeat at home, before a solo goal by Pat Holland took the tie to a replay at Edgar Street, where Hereford came from behind to win 2–1.", "|Dudley Tyler"]}]}}