{"wiki_id": "http://www.wikidata.org/entity/Q531883", "itemLabel": "Gervase of Tilbury", "itemDescription": "English canonist and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Gervase_of_Tilbury", "wikipedia_page": {"main": "Gervase of Tilbury (Latin: Gervasius Tilberiensis; c. 1150–1220) was an English canon lawyer, statesman and cleric. He enjoyed the favour of Henry II of England and later of Henry's grandson, Emperor Otto IV, for whom he wrote his best known work, the Otia Imperialia.", "link_mentions": [{"page": "Ghost", "response": ["From the medieval period an apparition of a ghost is recorded from 1211, at the time of the Albigensian Crusade.Mark Gregory Pegg (2008) A Most Holy War. Oxford University Press, New York: 3–5, 116–117.  Gervase of Tilbury, Marshal of Arles, wrote that the image of Guilhem, a boy recently murdered in the forest, appeared in his cousin's home in Beaucaire, near Avignon. This series of \"visits\" lasted all of the summer. Through his cousin, who spoke for him, the boy allegedly held conversations with anyone who wished, until the local priest requested to speak to the boy directly, leading to an extended disquisition on theology. The boy narrated the trauma of death and the unhappiness of his fellow souls in Purgatory, and reported that God was most pleased with the ongoing Crusade against the Cathar heretics, launched three years earlier. The time of the Albigensian Crusade in southern France was marked by intense and prolonged warfare, this constant bloodshed and dislocation of populations being the context for these reported visits by the murdered boy."]}, {"page": "Werewolf", "response": ["In folklore, a werewolf (, \"man-wolf\"), or occasionally lycanthrope  ( lukánthrōpos, \"wolf-human\"), is a human with the ability to shapeshift into a wolf (or, especially in modern film, a therianthropic hybrid wolflike creature), either purposely or after being placed under a curse or affliction (often a bite or scratch from another werewolf) with the transformations occurring on the night of a full moon. Early sources for belief in this ability or affliction, called lycanthropy , are Petronius (27–66) and Gervase of Tilbury (1150–1228).", "There is evidence of widespread belief in werewolves in medieval Europe. This evidence spans much of the Continent, as well as the British Isles. Werewolves were mentioned in Medieval law codes, such as that of King Cnut, whose Ecclesiastical Ordinances inform us that the codes aim to ensure that “…the madly audacious werewolf do not too widely devastate, nor bite too many of the spiritual flock.’ Liutprand of Cremona reports a rumor that Bajan, son of Simeon I of Bulgaria, could use magic to turn himself into a wolf.Antapodosis 3.29 The works of Augustine of Hippo had a large influence on the development of Western Christianity, and were widely read by churchmen of the medieval period; and these churchmen occasionally discussed werewolves in their works. Famous examples include Gerald of Wales's Werewolves of Ossory, found in his Topographica Hibernica, and in Gervase of Tilbury's Otia Imperiala, both written for royal audiences.", "Gervase reveals to the reader that belief in such transformations (he also mentions women turning into cats and into snakes) was widespread across Europe; he uses the phrase \"que ita dinoscuntur\" when discussing these metamorphoses, which translates to \"it is known\". Gervase, who was writing in Germany, also tells the reader that the transformation of men into wolves cannot be easily dismissed, for \"...in England we have often seen men change into wolves\" (\"Vidimus enim frequenter in Anglia per lunationes homines in lupos mutari…\").Gervase of Tilbury, Otia Imperiala, Book I, Chapter 15, translated and edited by S.E. Banks and J.W. Binns, (Oxford: Oxford University Press, 2002), 86 - 87. Further evidence of the widespread belief in werewolves and other human-animal transformations can be seen in theological attacks made against such beliefs. Conrad of Hirsau, writing in the 11th century, forbids the reading of stories in which a person's reason is obscured following such a transformation. Conrad specifically refers to the tales of Ovid in his tract. Pseudo-Augustine, writing in the 12th century, follows Augustine of Hippo's argument that no physical transformation can be made by any but God, stating that \"...the body corporeally [cannot], be changed into the material limbs of any animal.'Pseudo-Augustine, Liber de Spiritu et Anima, Chapter 26, XVII", "Marie de France's poem Bisclavret (c. 1200) is another example, in which the eponymous nobleman Bisclavret, for reasons not described, had to transform into a wolf every week. When his treacherous wife stole his clothing needed to restore his human form, he escaped the king's wolf hunt by imploring the king for mercy and accompanied the king thereafter. His behavior at court was gentle, until his wife and her new husband appeared at court, so much so that his hateful attack on the couple was deemed justly motivated, and the truth was revealed. This lai (a type of Breton sung-poem) follows many themes found within other werewolf tales - the removal of clothing and attempting to refrain from the consumption of human flesh can be found in Pliny the Elder, as well as in the second of Gervase of Tilbury's werewolf stories, about a werewolf by the name of Chaucevaire. Marie also reveals to us the existence of werewolf belief in Breton and Norman France, by telling us the Franco-Norman word for werewolf: garwulf, which, she explains, are common in that part of France, where \"...many men turned into werewolves\".Marie de France, \"Bisclavret\", translated by Glyn S. Burgess and Keith Busby, in The Lais of Marie de France (London: Penguin Books, 1999), 68. Gervase also supports this terminology when he tells us that the French use the term \"gerulfi\" to describe what the English call \"werewolves\".Gervase of Tilbury, Otia Imperiala, Book I, Chapter 15, translated and edited by S.E. Banks and J.W. Binns, (Oxford: Oxford University Press, 2002), 87. Melion and Biclarel are two anonymous lais that share the theme of a werewolf knight being betrayed by his wife."]}, {"page": "Carpathian Mountains", "response": ["\"Inter Alpes Huniae et Oceanum est Polonia\" (\"Between the Hunic Alps and the ocean lies Poland\") by Gervase of Tilbury, has described in his Otia Imperialia (\"Recreation for an Emperor\") in 1211. Thirteenth- to fifteenth-century Hungarian documents named the mountains Thorchal, Tarczal, or less frequently Montes Nivium (\"Snowy Mountains\")."]}, {"page": "Henry the Young King", "response": ["There was a perception amongst his contemporaries, and the next generation, that his death in 1183 marked a decline both in the tournament and knightly endeavour. His one-time chaplain, Gervase of Tilbury, remarked on his passing: \"Assuredly, as he was a solace to the world while he lived, so it was a blow to all chivalry when he died in the very glow of youth.\"Nempe in ipso adolescentie feruore, ut uiuens mundo fuit solatium, ita moriens uniuerse milicie fuit exitium.Gervase of Tilbury, Otia imperialia, ed and trans S.E. Banks and J.W. Binns(Oxford: Oxford University Press, 2002), pg. 487.", "Another description says \"He was tall in stature and distinguished in appearance; his face expressed merriment and mature judgment in good measure; fair among the children of men, he was courteous and cheerful. Gracious to all, he was loved by all; amiable to all, he was incapable of making an enemy. He was matchless in warfare, and as he outstripped them all in valour, cordiality, and the outstanding graciousness of his manners, his true generosity, and true integrity...Otia Imperialia of Gervase of Tilbury (c.1145-c.1225)", "* Gervase of Tilbury, Otia imperialia, ed and trans S.E. Banks and J.W. Binns(Oxford: Oxford University Press, 2002)"]}, {"page": "List of locations associated with Arthurian legend", "response": ["*Mount Etna,Loomis, Roger Sherman Wales and the Arthurian Legend, pub. University of Wales Press, Cardiff 1956 and reprinted by Folcroft Press 1973, Chapter 5 King Arthur and the Antipodes, pps. 70-71. the burial place of King Arthur according to Flouriant et Florete, Guillem de Torroella and Gervase of Tilbury. "]}, {"page": "Beaucaire, Gard", "response": ["Beaucaire has a legend of the formidable drac, a monster that rises from the depths of the sea to seize and devour its prey. One day the monster grabbed a young laundress and brought her to his cave. The story says the woman expected the worst, but the drac explained that what he wanted was a nanny for his son, the draconnet. Thus the washerwoman fed the little monster for seven years before she was set free. But one day at the fair the drac came to the market, having taken on a human appearance. The washerwoman recognized her former captor and incited the crowd to riot. Furious at being unmasked, the drac blinded the washerwoman. According to Gervase of Tilbury who wrote this tale in 1214, she remained blinded until the end of her days."]}, {"page": "Mount Etna", "response": ["What were originally Welsh conceptions concerning a dwarf king of a paradisal, Celtic underworld became attached to the quasi-historic figure of Arthur as \"Ruler of the Antipodes\" and were then transplanted into a Sicilian milieu, by Bretons impressed by the already otherworldly associations of the great, volcanic mountain of their new home. Mediaevalist Roger Sherman Loomis quotes passages from the works of Gervase of Tilbury and Caesarius of Heisterbach (dating from the late twelfth century) featuring accounts of Arthur's returning of a lost horse which had strayed into his subterranean kingdom beneath Etna. Caesarius quotes as his authority for the story a certain canon Godescalcus of Bonn, who considered it a matter of historical fact of the time of Emperor Henry's conquest of Sicily circa 1194. Caesarius employs in his account the Latin phrase in monte Gyber (\"within Etna\") to describe the location of Arthur's kingdom.Bruce, Christopher W. (1999). The Arthurian Name Dictionary. Taylor & Francis. .Loomis, Roger Sherman Wales and the Arthurian Legend, pub. University of Wales Press, Cardiff 1956 and reprinted by Folcroft Press 1973, Chapter 5 King Arthur and the Antipodes, pp. 70–71.Loomis, Roger Sherman, Arthurian Tradition And Chrétien de Troyes pub. Columbia University Press, New York 1948, pp. 66 & 306."]}, {"page": "13th century in literature", "response": ["*1214 – Gervase of Tilbury – Otia Imperialia", "*1228 (probable) – Gervase of Tilbury, English lawyer, statesman and writer (born c. 1150)"]}, {"page": "Tarasque", "response": ["There is also a brief notice on the tarasque which occurs in Gervase of Tilbury (Gervais de Tilbury). Gervase assigns the habitat of the tarasque () to be an abyss near the city-gates of Arles and the rock/cliff beneath the castle/fort at Tarascon."]}, {"page": "Peak Cavern", "response": ["and also mentions the shepherd story recorded by Gervase of Tilbury. The name of the cave was changed to \"Peak Cavern\" in 1880 in order not to cause offence to Queen Victoria during a visit for a concert. More recently the cave has been promoted using its older, more vulgar name."]}, {"page": "Morgan le Fay", "response": ["According to Gerald of Wales in De instructione principis, a noblewoman and close relative of King Arthur named Morganis carried the dead Arthur to her island of Avalon (identified by him as Glastonbury), where he was buried.Faedo, Avalon Revisited, p. 134. Writing in the early 13th century in Speculum ecclesiae, Gerald also claimed that \"as a result, the fanciful Britons and their bards invented the legend that some kind of a fantastic goddess (dea quaedam phantastica) had removed Arthur's body to the Isle of Avalon, so that she might cure his wounds there,\" for the purpose of enabling the possibility of King Arthur's messianic return. In his encyclopaedic work, Otia Imperialia, written around the same time and with similar derision for this belief, Gervase of Tilbury calls that mythical enchantress Morganda Fatata (Morganda the Fairy). Morgan retains this role as Arthur's otherworldly(in Sicily) healer in much of later tradition. "]}, {"page": "Randolph Stow", "response": ["The Girl Green as Elderflower is often considered to be closely linked to Stow's life. After dealing with a bout of malaria in Papua New Guinea, he moved to East Bergholt in Suffolk in England from 1969 to 1981, his ancestral county, and he used traditional tales from that area, many of which he translated from Latin himself, to inform his novel. The regional stories Stow used for the novel were collected by William of Newburgh, Gervase of Tilbury, Gerald the Welshman, Ralph Coggeshall, Roger Howden, and Walter Map. Many of the characters in the novel are based on Stow's friends. He conducted research in advance of publication for several years. In 1978, he and John Constable's great-great-grandson were in a serious car accident, which finally spurred Stow to begin writing the novel. On New Year's Day 1979, he began writing and finished thirty-two days later."]}, {"page": "Veil of Veronica", "response": ["Firm records of the Veil begin only in 1199, when two pilgrims, Gerald de Barri (Giraldus Cambrensis) and Gervase of Tilbury, made two accounts at different times of a visit to Rome, making direct reference to the existence of the Veil of Veronica. Shortly after that, in 1207, the cloth became more prominent when it was publicly paraded and displayed by Pope Innocent III, who also granted indulgences to anyone praying before it.Duffy, Patrick. \"St Veronica's Towel\", Catholic Ireland, July 12, 2012 This procession, between St Peter's and the Santo Spirito Hospital, became an annual event and on one such occasion in 1300 Pope Boniface VIII, who had it translated to St. Peter's in 1297, was inspired to proclaim the first Jubilee in 1300. During this Jubilee the Veronica was publicly displayed and became one of the  (\"Wonders of the City\") for the pilgrims who visited Rome. For the next two hundred years, the Veil, retained at Old St Peter's, was regarded as the most precious of all Christian relics; there Pedro Tafur, a Spanish visitor in 1436, noted:"]}, {"page": "Roquemaure, Gard", "response": ["Winemaking was probably introduced into Rhône valley by Greek colonists around 600 BC.. Archaeological excavations carried out at La Ramière suggests that wine, or possibly olive oil, was being produced at the site in the second half of the 1st century AD.. The earliest written mention of viticulture in Roquemaure is by Gervase of Tilbury in his Otia Imperialia which was completed around 1214. An English translation of the Latin text is:"]}, {"page": "Tilbury (disambiguation)", "response": ["*Gervase of Tilbury, (fl.late 12th century), English lawyer and writer"]}, {"page": "Early world maps", "response": ["The Ebstorf Map was an example of a European mappa mundi, made by Gervase of Ebstorf, who was possibly the same man as Gervase of Tilbury,Gervase of Tilbury, Otia Imperialia, (Oxford Medieval Texts), Oxford, 2002, p. xxxiv. some time in the thirteenth century. It was a very large map: painted on 30 goatskins sewn together, it measured about . The head of Christ was depicted at the top of the map, with his hands on either side and his feet at the bottom. The Map was a greatly elaborated version of the medieval tripartite or T and O map; it was centred on Jerusalem with east at the top of the map. It represented Rome in the shape of a lion, and had an evident interest in the distribution of bishoprics.Gervase of Tilbury, Otia Imperialia, (Oxford Medieval Texts), Oxford, 2002, p. xxxv The original was destroyed in the bombing of Hanover in 1943 during World War II, but some photographs and colour copies remain."]}, {"page": "Gervasius", "response": ["* Gervase of Tilbury (Gervasius Tilberiensis in Latin) (c. 1150–1220), English canon lawyer, statesman and cleric"]}, {"page": "Gervase", "response": ["* Gervase of Tilbury (c. 1150–c. 1228), English chronicler", "* Gervase of Ebstorf, author of the Ebstorf Map created c. 1234; possibly the same man as Gervase of Tilbury"]}, {"page": "Parc Montsouris", "response": ["Another possible origin of 'Montsouris' is common with the name of a former principal roadway, today's rue de la Tombe Issoire: after leaving the city to the south, it passed through a Roman-era cemetery that had fallen into disuse from the 4th century, Paris, the Early Roman City: The Saint-Jacques Necropolis and it may have been one these abandoned tombs that an influential 13th-century writer declared to be the burial place of \"Ysoré\", a defeated giant of popular legend. Les Légendes Epiques, Bedier, Joseph - excerpt from Gervase of Tilbury's Otia Imperialia (~1212) No matter the veracity of the story, many of the area's landmarks had taken the 'tombe Issoire' name by the 18th century, and if 'Issoire' emerged from 'Ysoré', 'Montsouris' could be a 'mont Ysoré' that evolved over time."]}, {"page": "West Tilbury", "response": ["*Gervase of Tilbury.  Born in the 1150s, author of the 'Otia Imperialia', a medieval work which enjoyed a wide currency in the later Middle Ages and was twice translated into French.  Some thirty manuscripts of his writing survive, one of which (in the Vatican library), has corrections and additions in Gervase's own hand.  It was intended as a volume of instruction and entertainment for the Roman Emperor Otto IV (c.1175–1218), the son of Queen Matilda of England and grandson to Henry II of England."]}, {"page": "Gervasius of Tilbury", "response": ["#REDIRECT Gervase of Tilbury"]}, {"page": "Names of Poland", "response": ["Many ancient tribes in Europe derived their names from the nature of the land they inhabited. Gervase of Tilbury wrote in his Otia imperialia (\"Recreation for an Emperor\", 1211): Inter Alpes Huniae et Oceanum est Polonia, sic dicta in eorum idiomate quasi Campania.(translation: \"Between the Hunnic Alps and the Ocean there is Poland, thus called \"Countryside\" in their idiom.\") Polans may have used Polska to describe their own territory in the Warta River basin. During the 10th century, they managed to subdue and unite the Slavic tribes between the rivers Oder and Bug River into a single feudal state and in the early 11th century, the name Polska was extended to the entire ethnically Polish territory. The lands originally inhabited by the Polans became known as Staropolska, or \"Old Poland\", and later as Wielkopolska, or \"Greater Poland\", while the lands conquered towards the end of the 10th century, home of the Vistulans (Wiślanie) and the Lendians, became known as Małopolska, or \"Lesser Poland.\""]}, {"page": "List of encyclopedias by date", "response": ["* Otia Imperialia by Gervase of Tilbury, 1214"]}, {"page": "Anglo-Latin literature", "response": ["*Gervase of Tilbury (c. 1150 – c. 1228)"]}, {"page": "Ebstorf Map", "response": ["The Ebstorf Map was an example of a mappa mundi (a Medieval European map of the world) similar to the Hereford Map in England. It was made by Gervase of Ebstorf, who was possibly the same man as Gervase of Tilbury, some time between 1234-1240.", "The arguments for Gervase of Tilbury's being the mapmaker are based on the name Gervase, which was an uncommon name in Northern Germany at the time, and on some similarities between the world views of the mapmaker and Gervase of Tilbury. The editors of the Oxford Medieval Texts edition of Gervase of Tilbury's Otia Imperialia conclude that although their being the same man is an \"attractive possibility\", to accept it requires \"too many improbable assumptions\"."]}, {"page": "Gervase of tilbury", "response": ["#REDIRECT Gervase of Tilbury "]}, {"page": "King Arthur's messianic return", "response": ["A number of locations were suggested for where Arthur would actually return from. The earliest-recorded suggestion was Avalon. In his 12th-century Historia Regum Britanniae, Geoffrey of Monmouth asserted that Arthur \"was mortally wounded\" at Camlann but was then carried \"to the Isle of Avallon (insulam Auallonis) to be cured of his wounds\", with the implication that he would at some point be cured and return therefrom made explicit in Geoffrey's later Vita Merlini.Geoffrey of Monmouth, Historia Regum Britanniae Book 11.2; Geoffrey of Monmouth, Life of Merlin: Vita Merlini ed. and trans. B. Clarke (Cardiff: University of Wales Press, 1973). Another tradition held that Arthur was awaiting his return beneath some mountain or hill. First referenced by Gervase of Tilbury in his Otia Imperialia (c.1211), this was maintained in British folklore into the 19th century and R.S. Loomis and others have taken it as a tale of Arthur's residence in an underground (as opposed to an overseas) Otherworld.R. S. Loomis, \"The Legend of Arthur’s Survival\" in R. S.  Loomis (ed.) Arthurian Literature in the Middle Ages (Oxford: Oxford University Press, 1959), pp.64–71 at pp.68–71. Other less common concepts include the idea that Arthur was absent leading the Wild Hunt, or that he had been turned into a crow or raven.T. Green, Concepts of Arthur (Stroud: Tempus, 2007), pp.259, 261-2; T. Green, \"The Historicity and Historicisation of Arthur\", fn.22 from Arthurian Resources, retrieved on 14-03-2008."]}, {"page": "Headless men", "response": ["By the 7th or 8th century, there had been composed a Letter of Pharasmenes to Hadrian, whose accounts of marvels such as bearded women (and headless men) became incorporated into later texts. This included De Rebus in Oriente mirabilibus (also known as Mirabilia), its Anglo-Saxon translation, Gervase of Tilbury's treatise, and the Alexander legend attributed to .", "The Latin text in the recension known as the Fermes Letter was translated verbatim in Gervase of Tilbury's Otia Imperialia (ca. 1211) which describes a \"people without heads\" (\"Des hommes sanz testes\") of a golden colour, measuring 12 feet tall and 7 feet wide, living on an isle in the River Brisone (in Ethiopia)."]}, {"page": "Gervase of Ebstorf", "response": ["He may or may not be the same man as Gervase of Tilbury, author of the Otia Imperialia, \"Recreation for an Emperor\", written for Emperor Otto IV.Gervase of Tilbury, Otia Imperialia, Oxford Medieval Texts, Oxford, 2002, p. xxxiv", "The connection between Gervase of Tilbury and Gervase of Ebstorf can \"only remain hypothetical\";Evelyn Edson, Mapping Time and Space: How Medieval Mapmakers viewed their World, The British Library, 1997 the arguments for Gervase of Tilbury being the mapmaker are based on the name Gervase, which was an uncommon name in Northern Germany at the time, and on some similarities between the world view of the mapmaker and of Gervase of Tilbury.Gervase of Tilbury, Otia Imperialia, Oxford Medieval Texts, Oxford, 2002, p. xxxv"]}, {"page": "Thomas Madox", "response": ["* History and Antiquities of the Exchequer of the Kings of England ... from the Norman Conquest to the End of the Reign of ... Edward II, London, 1711, 752 pp. plus annexes. An index was printed in Baronia Anglica, and a second edition, in 2 vols., with the index, was published in London in 1769. (vol. 1, vol. 2)Appended was a copy of the Dialogue concerning the Exchequer (De Scaccario), erroneously ascribed to Gervase of Tilbury, now believed to be by Richard FitzNeal; also a Latin dissertation by Madox on the Great Roll of the Exchequer (the Pipe rolls). An English translation of these appendices, made by \"a Gentleman of the Inner Temple\", appeared at London in 1758."]}, {"page": "Dusios", "response": ["In the Gaulish language, DusiosXavier Delamarre, Dictionnaire de la langue gauloise (Éditions Errance, 2003), p. 158. The Latinized form would be dusius, most often in the plural dusii. was a divine beingPerhaps a deus. As late as the 13th century, Thomas Cantipratensis asserted that some people still regard groves as consecrated to dusii and entered them to sacrifice to \"their own gods\" (suis diis, dative plural of deus); see discussion under Surviving tradition below. The 19th-century Celiticist Henri d'Arbois de Jubainville regarded the dusii as divinities who might be compared to aquatic deities of the Homeric tradition in Greece as lovers who begat children with mortal women; see \"Esus, Tarvos trigaranus,\" Revue Celtique 19 (1898), pp. 228, 234–235, 251 online. With reference to a highly speculative etymological connection between dusios and the English word \"dizzy,\" Arbois de Jubainville  saw the effects of these spirits as comparable to those of the Greek nymphs or Italic lymphae. J.A. MacCulloch, The Religion of the Ancient Celts (Forgotten Books edition 2007, originally pub. 1911), p. 232 online thought that the dusii \"do not appear to represent the higher gods reduced to the form of demons by Christianity, but rather a species of lesser divinities, once the object of popular devotion.\" among the continental CeltsGalli as designated by Augustine and Isidore (see following). In antiquity, Galli refers both to inhabitants of the geographical region Gallia as it was delineated by the Greeks and Romans, and to peoples who spoke a form of Celtic (that is, who spoke gallice, \"in Gaulish\") or who were perceived by the Greeks and Romans as ethnically \"Celtic.\" See J.H.C. Williams, Beyond the Rubicon: Romans and Gauls in Republican Italy (Oxford University Press, 2001), pp. 1–17 et passim. who was identified with the god Pan of ancient Greek religion and with the gods Faunus, Inuus, Silvanus, and Incubus of ancient Roman religion. Like these deities, heBoth ancient Greek and Latin categorize nouns within three grammatical genders: masculine, feminine, and neuter. Although grammatical gender is distinguished from biological gender, Latin places humans (homines), animals (animalia), and anthropomorphic beings perceived as having sexual characteristics in their gender-specific category. Some \"monsters\" are neuter (the sea monster ketos in Greek, for instance). The dusii are masculine in both grammatical gender and in their sexual behavior in all the sources in which they appear, with the possible exception of Gervase of Tilbury, who seems to think they can also be female; see below. The Greco-Roman deities to whom they are compared are aggressively masculine, often depicted as ithyphallic. might be seen as multiple in nature,The multiplicity of the group of deities to which the dusii belong — Pan/panes, Faunus/fauni, Inuus/inui, Silvanus/silvani, Incubus/incubi — is related to the question of monotheistic tendencies in ancient religion: \"Lower gods were executors or manifestations of the divine will rather than independent principles of reality. Whether they are called gods, demons, angels, or numina, these immortal beings are emanations of the One\": Michele Renee Salzman, \"Religious koine in Private Cult and Ritual: Shared Religious Traditions in Roman Religion in the First Half of the Fourth Century CE,\" in A Companion to Roman Religion (Blackwell, 2007), p. 113. The name of Pan was sometimes etymologized as meaning \"All\"; although scientific linguistics has shown this derivation to be incorrect, it appears in the Homeric Hymn to Pan (6th century BC) and influenced theological interpretations in antiquity, including the speculations of Plato: see H.J. Rose and Robin Hard, The Routledge Handbook of Greek Mythology (Routledge, 2004), p. 215 online, and David Sedley, Plato's Cratylus (Cambridge University Press) pp. 96–97 online, where Pan as \"all\" is connected to the logos: \"This is the climax of the divine etymologies.\" The \"all-ness\" of Pan accounted for his multiple manifestations, reflected by nominal plurals. On the distinction between modern scientific and ancient theological etymology, see Davide Del Bello, Forgotten Paths: Etymology and the Allegorical Mindset (Catholic University of America Press, 2007). and referred to in the plural (dusioi), most commonly in Latin as dusii. Although the Celtic Dusios is not described in late-antique sources independently of Greek and Roman deities, the common functionality of the others lay in their ability to impregnate animals and women, often by surprise or force. Dusii continue to play a role in the magico-religious belief systems of Gaul and Francia as a type of incubus in early-medieval paganism and Christianity.", "Gervase of Tilbury (ca. 1150–1228) deals with dusii in his chapter on lamiae and \"nocturnal larvae\". Although he draws directly on Augustine, calling the dusii incubi and comparing them to Silvanuses and Pans, he regards them as sexually threatening to both men and women.Gervase of Tilbury, Otia Imperialia, tertia decisio LXXXVI, p. 41 in the edition of Liebrecht online."]}, {"page": "Henry VI, Holy Roman Emperor", "response": ["The emperor strongly relied on high-ranking clergy like the archbishops Philip of Cologne and Conrad of Mainz. Several contemporary accounts of his life given by ecclesiastical chroniclers like Godfrey of Viterbo or Peter of Eboli in his Liber ad honorem Augusti (on the emperor's conquest of Sicily) paint a bright picture of Henry's rule; while the annals by Otto of Sankt Blasien are considered more objective. In his Arnoldi Chronica Slavorum the chronicler Arnold of Lübeck concentrates on the dispute between the Hohenstaufen and Welf dynasties from a pronounced Welf perspective, while Gislebert of Mons tells of Henry's policies in Hainaut and Flanders. The Hohenstaufen rule in Italy and the Mezzogiorno is documented by the chronicles of Archbishop Romuald of Salerno and Richard of San Germano. Henry's conflict with King Richard I of England is rendered by Roger of Hoveden and Gervase of Tilbury, expressing their negative attitudes towards the emperor."]}, {"page": "Tower of London in popular culture", "response": ["One of the earliest traditions associated with the Tower was that it was built by Julius Caesar; the story was a popular amongst writers and antiquaries. The earliest recorded attribution of the Tower to the Roman ruler dates to the mid-14th century in a poem by Sir Thomas Gray. The origin of the myth is uncertain, although it may be related to the fact that the Tower was built in the corner of London's Roman walls. Another possibility is that someone misread a passage from Gervase of Tilbury in which he says Caesar built a tower at Odnea in France. Gervase wrote Odnea as Dodres, which is close to the French for London, Londres. Today, the story survives in William Shakespeare's Richard II and Richard III, and as late as the 18th century some still regarded the Tower as built by Caesar."]}]}}