{"wiki_id": "http://www.wikidata.org/entity/Q5318161", "itemLabel": "Dwight Gayle", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Dwight_Gayle", "wikipedia_page": {"main": "Dwight Devon Boyd Gayle (born 17 October 1989) is an English professional footballer who plays as a striker for Premier League club Newcastle United.\nGayle began his career in the Arsenal Academy. After being released as a teenager, over the following seasons he worked his way back up through the English football pyramid via stints at Ryan, Stansted, Bishop's Stortford, Dagenham & Redbridge and Peterborough United, before establishing himself in the Premier League with Crystal Palace. In 2016, he signed for Newcastle United.", "link_mentions": [{"page": "West Bromwich Albion F.C.", "response": ["|2019|| Dwight Gayle"]}, {"page": "Chingford", "response": ["* Dwight Gayle, current Newcastle United striker, is from Chingford."]}, {"page": "Dagenham & Redbridge F.C.", "response": ["Record transfer fee received: Dwight Gayle to Peterborough United, £700,000 (2013)."]}, {"page": "Essex Senior Football League", "response": ["*Dwight Gayle – left Stansted to play for Dagenham & Redbridge, Peterborough United and Crystal Palace."]}, {"page": "Robert Green", "response": ["On 20 November 2016, Green committed a high-profile error when he dropped the ball under his crossbar onto the foot of Newcastle United striker Dwight Gayle to tap the ball home in a 2–0 defeat. On 17 December 2016, Green kept his 8th League clean sheet for Leeds, this equalled the tally already for Leeds' clean sheet for the whole of the previous 2015–16 season with goalkeeper predecessor Marco Silvestri."]}, {"page": "Cameron Jerome", "response": ["On 2 September 2013, Jerome joined Crystal Palace on loan for the 2013–14 season. He made his debut for the club on 14 September, coming on as a 64th-minute substitute for Dwight Gayle in a 2–0 defeat away at Manchester United. After a poor start to the season Ian Holloway left Palace by mutual consent and Tony Pulis was appointed manager on 23 November. Despite Jerome criticising Pulis towards the end of his time at Stoke, he started and scored against his former club Cardiff City on 7 December. In total Jerome played 29 times for the Eagles scoring twice as they finished in 11th position."]}, {"page": "History of Newcastle United F.C.", "response": ["Starting the 2016-17 season, Rafa Benítez signed 12 new players full-time and also acquired 5 players on loan, whilst 8 players left the club and another 12 on loan. New signings Dwight Gayle and Matt Ritchie proved popular scoring a combined total of 39 goals, finishing among the top goalscorers that season. Despite failing to improve on their dominant success in the 2009/10 championship season, the club remained in contention for the trophy throughout; threatened only by Brighton & Hove Albion Newcastle enjoyed a 3-game winning streak to the final day of the season and lifted the Football League Championship trophy on 8 May 2017 following a 3–0 win over Barnsley. Rafa Benítez denied speculation that he would leave the club following promotion to the Premier League and confirmed his commitment to the club for the foreseeable future. Shortly prior to the season's finish, the club was subject to raids by HMRC following suspicions of tax evasion.  Managing Director Lee Charnley was arrested during the raid, but was later released without charge."]}, {"page": "Stansted F.C.", "response": ["Players who have gone on to play League football include Gary Hart, who played for Brighton & Hove Albion, Alfie Potter, who went on to play for Oxford United, Dwight Gayle, who went on to play for Crystal Palace and Newcastle United, and Lewis Amos, who went on to play professionally in America for Northern Virginia Royals and Tulsa Revolution."]}, {"page": "David Nugent", "response": ["Nugent, Jordan Rhodes and Dwight Gayle were linked to join Championship club Middlesbrough, and on 14 August 2015, Nugent signed a three-year contract with the club for an undisclosed fee, reported to be an initial £2 million, to be doubled if the club secured promotion. He made his debut for the club on 15 August 2015, in a 3–0 home win against Bolton Wanderers. On 12 September 2015, he scored his first goal for the club in a 2–0 win over Milton Keynes Dons at the Riverside."]}, {"page": "Damien Delaney", "response": ["He scored his first ever goal in the Premier League in a 3–3 draw against Liverpool, with his initial 25-yard shot deflected slightly into the net by Glen Johnson. Palace were 3–0 down at the time, but Delaney's goal combined with two goals from Dwight Gayle made it 3–3. Delaney was a regular for Palace for their first four seasons back in the Premier League and stayed at the club until the end of the 2017–18 season, making a total of 193 appearances in all competitions, scoring seven goals."]}, {"page": "John Still (footballer)", "response": ["He presided over the reconstruction of Dagenham & Redbridge's squad in 2011–12 as his team finished in 19th position. At the beginning of the following season, Still was assured by the Dagenham board that no players would be sold; information which he then relayed to his players. In January 2013, striker Dwight Gayle was sold to Championship team Peterborough United for a club-record fee of £470,000, which left Still feeling \"a bit undermined\". In February 2013, with the Daggers sitting in 16th place in the League Two table, the club was approached by Conference Premier club Luton Town for permission to speak to Still about their vacant managerial job. Still agreed to join Luton, with Dagenham waiving the full compensation fee \"in light of the fantastic job he has done for the [club]\". Before leaving Dagenham, Still was the then-longest serving Football League manager, having spent nine years at the club.", "He has won praise for his man-management and talent spotting skills, especially his ability to discover young players in non-League football at the sixth tier and below, develop them and then sell them – often for a significant profit. Players that Still has developed that have gone on to play at a higher level include Marlon King, Craig Mackail-Smith, Paul Benson, Sam Saunders, Danny Green, and Dwight Gayle. Dagenham & Redbridge managing director Steve Thompson has stated that Still's ability to do this kept the club consistently able to compete while operating on a far smaller budget than its rivals. Still's reputation for nurturing talent, combined with his vast array of contacts within the game gained through decades of coaching, have also led to highly rated young players from Premier League academies joining his teams on loan. Examples include Marlon Pack and Matt Ritchie at Dagenham, and Cameron McGeehan, Pelly Ruddock Mpanzu and Elliot Lee at Luton."]}, {"page": "List of Newcastle United F.C. records and statistics", "response": ["* Current player with most goals – Dwight Gayle, 34 (as of 12 December 2020)", "* 2017  Jamaal Lascelles,  Jonjo Shelvey,  Dwight Gayle (Championship)"]}, {"page": "EFL Awards", "response": ["* Dwight Gayle"]}, {"page": "List of West Bromwich Albion F.C. seasons", "response": ["|align=left|Dwight Gayle"]}, {"page": "PFA Fans' Player of the Year", "response": ["| Championship ||  Dwight Gayle || Newcastle United ||"]}]}}