{"wiki_id": "http://www.wikidata.org/entity/Q5314596", "itemLabel": "Duncan Russell", "itemDescription": "English football manager (1958-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Duncan_Russell", "wikipedia_page": {"main": "Duncan Russell (12 March 1958 – 18 August 2017) was an English football manager who was in charge of Conference National side Mansfield Town and Hucknall Town.", "link_mentions": [{"page": "Mansfield Town F.C.", "response": ["Caretaker manager Duncan Russell led Mansfield to an FA Trophy final appearance in 2010–11, Louis Briscoe scoring a late extra-time winner against Luton in the semi-final second leg. The Stags lost 1–0 to Darlington at Wembley Stadium after a 120th-minute extra-time goal by Chris Senior. A league position of 12th was not good enough for Russell to keep his job; Paul Hall replaced him as interim manager during the close season.", "|align=left|Duncan Russell"]}, {"page": "Hucknall Town F.C.", "response": ["|  2013||Duncan Russell"]}, {"page": "Adam Murray", "response": ["Murray rejoined Mansfield Town, only 20 miles from his home in Derby, on a three-month loan deal on 1 October 2010, with a view to a permanent move taking place in January. On 5 January 2011, Murray made his transfer permanent despite manager David Holdsworth having been replaced by Duncan Russell. He ended the 2010–11 campaign with seven goals in 41 games for the \"Stags\", who went on to reach the final of the FA Trophy at Wembley Stadium. Murray was substituted 18 minutes into extra-time of the final, with the only goal of the game being scored by Darlington with just one minute left to play. He was appointed club captain in August 2011 and signed a new contract three months later. Mansfield won 13 of their last 15 matches of the 2011–12 season to qualify for the play-offs. They went on to lose to York City in the play-off semi-finals despite Murray and Gary Roberts dominating much of the midfield play."]}, {"page": "Paul Hall (footballer)", "response": ["In July 2010, Hall was named youth team coach at Mansfield Town, but left the club just two months later when financial trouble forced the club to shut down their youth team. He subsequently joined Spalding United as a player, and made his debut for the Tulips on 2 October 2010 in a 3–0 defeat. Hall returned to Mansfield on 19 November 2010 when he was hired as Duncan Russell's assistant manager. On 30 March 2011, Hall was registered as a player to help ease the injury crisis at Mansfield Town, after the club could only name three healthy substitutes in the match against Crawley Town the day before. He made three appearances before the end of the season. Hall left his assistant manager role on 7 June 2011."]}]}}