{"wiki_id": "http://www.wikidata.org/entity/Q531520", "itemLabel": "Nick Faldo", "itemDescription": "English professional golfer", "wikipedia_url": "https://en.wikipedia.org/wiki/Nick_Faldo", "wikipedia_page": {"main": "Sir Nicholas Alexander Faldo,  (born 18 July 1957) is an English professional golfer and television commentator. A top player of his era, renowned for his dedication to the game, he was ranked No. 1 on the Official World Golf Ranking for a total of 97 weeks. His 41 professional wins include 30 victories on the European Tour and six major championships: three Open Championships (1987, 1990, 1992) and three Masters (1989, 1990, 1996).\nFaldo has since become a television commentator for major golf championships. In 2006, he became the lead golf analyst for CBS Sports. In 2012, Faldo joined the BBC Sport on-air team for coverage of the Open Championship.", "link_mentions": [{"page": "England", "response": ["Golf has been prominent in England; due in part to its cultural and geographical ties to Scotland, the home of Golf. There are both professional tours for men and women, in two main tours: the PGA and the European Tour. England has produced grand slam winners: Cyril Walker, Tony Jacklin, Nick Faldo, and Justin Rose in the men's and Laura Davies, Alison Nicholas, and Karen Stupples in the women's. The world's oldest golf tournament, and golf's first major is The Open Championship, played both in England and Scotland. The biennial golf competition, the Ryder Cup, is named after English businessman Samuel Ryder who sponsored the event and donated the trophy.Fry, Peter (July 2000). Samuel Ryder: The Man Behind the Ryder Cup. Wright Press. Nick Faldo is the most successful Ryder Cup player ever, having won the most points (25) of any player on either the European or US teams.\"Sir Nick Faldo drives on in business world\". BBC. Retrieved 29 December 2013"]}, {"page": "July 18", "response": ["*1957 – Nick Faldo, English golfer and sportscaster"]}, {"page": "University of Michigan", "response": ["U-M's golf course is located south of Michigan Stadium and Crisler Center. It was designed in the late 1920s by Alister MacKenzie, the designer of Augusta National Golf Club in Augusta, Georgia, home of the Masters Tournament. The course opened to the public in the spring of 1931. The University of Michigan Golf Course was included in a listing of top holes designed by what Sports Illustrated calls \"golf's greatest course architect\". The U-M Golf Course's signature No. 6 hole—a  par 4, which plays from an elevated tee to a two-tiered, kidney-shaped green protected by four bunkers—is the second hole on the Alister MacKenzie Dream 18 as selected by a five-person panel that includes three-time Masters champion Nick Faldo and golf course architect Tom Doak. The listing of \"the best holes ever designed by Augusta National architect Alister MacKenzie\" is featured in SI's Golf Plus special edition previewing the Masters on April 4, 2006."]}, {"page": "1957", "response": ["* July 18 – Nick Faldo, British golfer"]}, {"page": "Masters Tournament", "response": ["Nicklaus has the most Masters wins, with six between 1963 and 1986. Tiger Woods won five between 1997 and 2019. Palmer had won four between 1958 and 1964. Five have won three titles at Augusta: Jimmy Demaret, Sam Snead, Gary Player, Nick Faldo, and Phil Mickelson. Player, from South Africa, was the first non-American player to win the tournament, in 1961; the second was Seve Ballesteros of Spain, the champion in 1980 and 1983.", "During this period, no golfer suffered more disappointment at the Masters than Greg Norman. In his first appearance at Augusta in 1981, he led during the second nine but ended up finishing fourth. In 1986, after birdieing holes 14 through 17 to tie Nicklaus for the lead, he badly pushed his 4-iron approach on 18 into the patrons surrounding the green and missed his par putt for a closing bogey.  In 1987, Norman lost a sudden-death playoff when Larry Mize holed out a remarkable 45-yard pitch shot to birdie the second playoff hole.  Mize thus became the first Augusta native to win the Masters. In 1996, Norman tied the course record with an opening-round 63 and had a six-stroke lead over Nick Faldo entering the final round. However, he stumbled to a closing 78 while Faldo, his playing partner that day, carded a 67 to win by five shots for his third Masters championship. Norman also led the 1999 Masters on the second nine of the final round, only to falter again and finish third behind winner José María Olazábal, who won his second green jacket. Norman finished in the top five at the Masters eight times but never won.", "By tradition, the winner of the previous year's Masters Tournament puts the jacket on the current winner at the end of the tournament. In 1966, Jack Nicklaus became the first player to win in consecutive years and he donned the jacket himself. When Nick Faldo (in 1990) and Tiger Woods (in 2002) repeated as champions, the chairman of Augusta National put the jacket on them.", "The defending champion, as host, selects the menu for the dinner. Frequently, Masters champions have served cuisine from their home regions prepared by the Masters chef. Notable examples have included haggis, served by Scotsman Sandy Lyle in 1989, and bobotie, a South African dish, served at the behest of 2008 champion Trevor Immelman. Other examples include German Bernhard Langer's 1986 Wiener schnitzel, Britain's Nick Faldo's fish and chips, Canadian Mike Weir's elk and wild boar, and Vijay Singh's seafood tom kah and chicken panang curry. The 2011 dinner of Phil Mickelson was a Spanish-themed menu in hopes that Seve Ballesteros would attend, but he was too sick to attend and died  weeks later.", "The first winner of the Masters Tournament was Horton Smith in 1934, and he repeated in 1936. The player with the most Masters victories is Jack Nicklaus, who won six times between 1963 and 1986. Tiger Woods has five wins, followed by Arnold Palmer with four, and Jimmy Demaret, Gary Player, Sam Snead, Nick Faldo, and Phil Mickelson have three titles to their name. Player was the tournament's first overseas winner with his first victory in 1961.  Two-time champions include Byron Nelson, Ben Hogan, Tom Watson, Seve Ballesteros, Bernhard Langer, Ben Crenshaw, José María Olazábal, and Bubba Watson.", "|align=center|1996 ||  Nick Faldo (3) || align=center|276 || align=center|−12 || 5 strokes ||  Greg Norman || align=center|450,000", "|align=center|1990 ||  Nick Faldo (2) || align=center|278 || align=center|−10 || Playoff ||  Raymond Floyd || align=center|225,000", "|align=center|1989 ||  Nick Faldo || align=center|283 || align=center|−5 || Playoff ||  Scott Hoch || align=center|200,000"]}, {"page": "Greg Norman", "response": ["At the 1989 Masters, Norman missed a 12-foot par putt on the 72nd hole, which would have put him into a playoff with Nick Faldo and Scott Hoch. Norman had another chance at a major in 1989, this time at the Open Championship at Royal Troon. He played a final round of 64, starting his round with six straight birdies, forcing his way into a playoff with Mark Calcavecchia and Wayne Grady. Going into the final playoff hole, Norman and Calcavecchia were tied, but two successive bunker shots by Norman gave Calcavecchia the victory.", "Norman won the Doral-Ryder Open and Memorial Tournament in 1990. He also missed the cut for the first time at Augusta National in the 1990 Masters. In the 1990 Open Championship at St Andrews, Norman began with two rounds of 66, leaving himself sharing the lead with Nick Faldo after 36 holes and the pair four shots ahead of the rest of the field. Faldo then shot a third round of 67, but Norman could only manage 76. Norman finished the tournament tied for sixth place, while Faldo won by five shots. Although 1990 was not Norman's strongest majors year, he finished at the top of the PGA Tour money list for the second time in his career and won the Vardon Trophy and Byron Nelson Award. Later that year, he won the Australian Masters in his home country for a final and record sixth time.", "After a career slump in the early 1990s, Norman turned to renowned coach Butch Harmon for help. Together, the two rebuilt Norman's game by solving mechanical problems that had crept into his swing. As a result of this training, Norman earned his second major at Royal St George's in the 1993 Open Championship. There, in ideal conditions, Norman defeated a leaderboard consisting of Nick Faldo, Bernhard Langer and Corey Pavin. Norman's final round 64 was the lowest score by a winner in Open history until Henrik Stenson's 63 at the 2016 Open Championship.", "The following year, Norman opened the 1996 Masters Tournament with a course record-tying 63 which put him at the top of the leaderboard. He held the lead through three days of play. Norman took a six-stroke lead into the final round and lost the tournament to Nick Faldo by five strokes, shooting a Sunday 78 to Faldo's 67. In January 1997, Norman won his largest winner's check to date, one million dollars, when he won the Andersen Consulting World Championship of Golf. Norman then won two tournaments in 1997, but they were his final victories on the PGA Tour. In 1998, Norman missed part of the season after suffering hip and shoulder injuries. He contended in the 1999 Masters tournament, tying for the lead with five holes remaining before finishing third, three strokes behind, and again in the 1999 Open Championship, eventually finishing 6th, three strokes behind.", "| Nick Faldo", "| Nick Faldo", "| Mike Clayton,  Nick Faldo, John Morse", "| Nick Faldo", "| Nick Faldo", "| 1993 ||The Open Championship (2)||1 shot deficit ||−13 (66-68-69-64=267) ||2 strokes || Nick Faldo"]}, {"page": "The Open Championship", "response": ["In 1976, 19-year-old Spaniard Seve Ballesteros gained attention in the golfing world when he finished second. He would go on to win three Opens (1979, 1984, 1988), and was the first continental European to win since Arnaud Massy in 1907. Other multiple winners in this period were Englishman Nick Faldo with three (1987, 1990, 1992), and Australian Greg Norman with two (1986, 1993).", "|align=\"center\" | 122nd || align=center|1993 ||  Greg Norman (2) || align=\"center\" |  267 ||align=\"center\" | −13 || 2 strokes ||  Nick Faldo || align=\"center\" | 1,000,000 || align=\"center\" | 100,000 || Royal St George's", "|align=\"center\" | 121st || align=center|1992 ||  Nick Faldo (3) || align=\"center\" |  272 || align=\"center\" | −12 || 1 stroke ||  John Cook || align=\"center\" | 950,000 || align=\"center\" | 95,000 || Muirfield", "|align=\"center\" | 119th || align=center|1990 ||  Nick Faldo (2) ||align=\"center\" |  270 || align=\"center\" | −18 || 5 strokes ||  Mark McNulty Payne Stewart || align=\"center\" | 825,000 || align=\"center\" | 85,000 || St Andrews", "|align=\"center\" | 116th || align=center|1987 ||  Nick Faldo ||align=\"center\" |  279 || align=\"center\" | −5 || 1 stroke ||  Paul Azinger Rodger Davis || align=\"center\" | 650,000 || align=\"center\" |75,000 || Muirfield"]}, {"page": "U.S. Open (golf)", "response": ["|align=center|1988 ||  Curtis Strange || align=center|278 || align=center|−6 || Playoff ||  Nick Faldo || align=center|180,000 || The Country ClubComposite Course || Brookline, Massachusetts"]}, {"page": "PGA Championship", "response": ["|align=center|1992||  Nick Price || align=center|278 || align=center|−6 || 3 strokes ||  John Cook Nick Faldo Jim Gallagher Jr. Gene Sauers || align=center|280,000 ||Bellerive Country Club||St. Louis, Missouri"]}, {"page": "1996 in sports", "response": ["* Masters Tournament - Nick Faldo"]}, {"page": "1992 in sports", "response": ["* British Open – Nick Faldo"]}, {"page": "1990 in sports", "response": ["* Masters Tournament – Nick Faldo", "* British Open – Nick Faldo"]}, {"page": "1989 in sports", "response": ["* Masters Tournament – Nick Faldo"]}, {"page": "1987 in sports", "response": ["* British Open – Nick Faldo"]}, {"page": "Ernie Els", "response": ["| Nick Faldo,  Peter Lonard", "| Nick Faldo,  Mark McCumber"]}, {"page": "Louisbourg", "response": ["Annually, the community hosts the Louisbourg Crab Fest. A large golf course and residential resort is planned near the community; designed by Nick Faldo, the resort was expected to open in 2010 but development stalled in the recession.Resort Web Page"]}, {"page": "Jack Nicklaus", "response": ["With his win in the 1971 PGA Championship, Nicklaus became the first golfer to win all four majors twice. In this championship, Nicklaus was the only player to break 70 consecutively in the first two rounds under windy conditions; he finished at seven-under-par 281. Nicklaus finished second twice and fifth in the remaining three major championships for the year. While he finished tied for second in the Masters with Johnny Miller, Nicklaus made a big enough impression on a young Nick Faldo (watching on TV in England) in order for Faldo to take up the game seriously."]}, {"page": "List of \"-gate\" scandals and controversies", "response": ["| Sandwichgate || 2008 || During practice at the 2008 Ryder Cup, photographers had taken pictures of Europe's captain Nick Faldo holding a list of players' initials, seemingly outlining the partnerships for the coming days. He denied the list had any part in his tactics, and claimed it was a list of sandwich orders. This was met with extreme skepticism from the media and Faldo eventually admitted they were in fact possible player pairings and he'd been \"caught out\".|| "]}, {"page": "Alastair Campbell", "response": ["In 2003 and 2004, he ran a series for The Times newspapers, analysing greatness in sport to answer the question \"Who is the greatest sports star of all time?\" Although his conclusion was Muhammad Ali, as part of the process; he interviewed and profiled sports stars from around the world, including Ian Botham, Nick Faldo, Ben Ainslie, Michael Phelps, Martina Navratilova, Shane Warne, Alex Ferguson, Bobby Charlton and Lance Armstrong. Campbell later said that he \"fell hook, line and sinker\" for the Armstrong legend. He subsequently worked with Armstrong, campaigning for cancer charities, but drew criticism from Armstrong's nemesis David Walsh for being so supportive and defending him so passionately. Campbell later said that Walsh had been right."]}, {"page": "Culture of the United Kingdom", "response": ["The modern game of golf originated in Scotland, with the Fife town of St Andrews known internationally as the \"home of golf\".Keay (1994) op cit page 839. \"In 1834 the Royal and Ancient Golf Club declared St. Andrews 'the Alma Mater of golf'\". and to many golfers the Old Course, an ancient links course dating to before 1574, is considered to be a site of pilgrimage.Cochrane, Alistair (ed) Science and Golf IV: proceedings of the World Scientific Congress of Golf. Page 849. Routledge In 1764, the standard 18 hole golf course was created at St Andrews when members modified the course from 22 to 18 holes.Forrest L. Richardson (2002). \"Routing the Golf Course: The Art & Science That Forms the Golf Journey\". p. 46. John Wiley & Sons Golf is documented as being played on Musselburgh Links, East Lothian, Scotland as early as 2 March 1672, which is certified as the oldest golf course in the world by Guinness World Records.Links plays into the record books BBC. Retrieved 28 September 2011 The oldest known rules of golf were compiled in March 1744 in Leith.Historical Rules of Golf \"The first rules of golf compiled by the Gentlemen Golfers of Leith\". The oldest golf tournament in the world, and the first major championship in golf, The Open Championship, first took place in Ayrshire, Scotland in 1860, and today it is played on the weekend of the third Friday in July.The Open Championship – More Scottish than British  PGA Tour. Retrieved 28 September 2011 Golf's first superstar Harry Vardon, a member of the fabled Great Triumvirate who were pioneers of the modern game, won the Open a record six times. Since the 2010s, three Northern Irish golfers have had major success; Graeme McDowell, Darren Clarke and four time major winner Rory McIlroy.Northern Ireland, world golf capital Belfast Telegraph. Retrieved 3 November 2014. The biennial golf competition, the Ryder Cup, is named after English businessman Samuel Ryder who sponsored the event and donated the trophy.Fry, Peter (July 2000). Samuel Ryder: The Man Behind the Ryder Cup. Wright Press. Sir Nick Faldo is the most successful British Ryder Cup player."]}, {"page": "List of sports announcers", "response": ["* Nick Faldo – ABC (US) 2004–2007, CBS 2007–present, BBC Sport 2012–2014, Sky Sports 2016"]}]}}