{"wiki_id": "http://www.wikidata.org/entity/Q531099", "itemLabel": "Claudie Blakley", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Claudie_Blakley", "wikipedia_page": {"main": "Claudie Blakley (born 4 January 1974) is an English actress. Blakley trained at the Central School of Speech and Drama. In 1998, she won the Ian Charleson Award for her performance in The Seagull at the West Yorkshire Playhouse in Leeds. She is best known for her role as Emma Timmins in the BBC drama series Lark Rise to Candleford.Other notable roles include Mabel Nesbitt in Robert Altman's Oscar-winning Gosford Park and Charlotte Lucas in Joe Wright's 2005 version of Pride and Prejudice. In the autumn of 2007, she was seen in the BBC serial Cranford as Martha.\nIn 2010, Blakley played the role of Cynthia Lennon in the BBC television production of Lennon Naked, a drama based on the period in the life of John Lennon from the years 1964 to 1971. In 2013, she appeared in the premiere of the play Chimerica.", "link_mentions": [{"page": "Gosford Park", "response": ["* The Hon. Mabel Nesbitt (Claudie Blakley) daughter of a glove factory owner, grew up in Leicester, and married to Freddie, who only married her believing her to be wealthy."]}, {"page": "2001 in film", "response": ["| Gosford Park || USA Films || Robert Altman (director); Julian Fellowes (screenplay); Eileen Atkins, Bob Balaban, Alan Bates, Charles Dance, Stephen Fry, Michael Gambon, Richard E. Grant, Derek Jacobi, Kelly Macdonald, Helen Mirren, Jeremy Northam, Clive Owen, Ryan Philippe, Maggie Smith, Kristin Scott Thomas, Emily Watson, Camilla Rutherford, Geraldine Somerville, Tom Hollander, Natasha Wightman, James Wilby, Claudie Blakley, Laurence Fox, Trent Ford, Jeremy Swift, Sophie Thompson, Meg Wynn Owen, Adrian Scarborough, Frank Thornton, Ron Webster || Black Comedy, Mystery || Live action"]}, {"page": "2002 in film", "response": ["| The Cat's Meow || Lions Gate Films || Peter Bogdanovich (director); Steven Peros (screenplay); Kirsten Dunst, Eddie Izzard, Edward Herrmann, Cary Elwes, Joanna Lumley, Jennifer Tilly, Claudia Harrison, James Laurenson, Ronan Vibert, John C. Vennema, Ingrid Lacey, Victor Slezak, Chiara Schoras, Claudie Blakley, Steven Peros || Historical, Drama || Live Action"]}, {"page": "Cynthia Lennon", "response": ["The Beatles' Hamburg days were the subject of the 1994 film Backbeat, with Jennifer Ehle portraying Cynthia Powell.  The film characterises Lennon and Cynthia's relationship as one that will eventually be doomed by their wanting different things from life but with Lennon not wanting to hurt her.  Cynthia later complained that the film made her out \"as a clingy, dim, little girlfriend in a headscarf\". In another film covering the early years of the pre-fame Beatles, the 1979 Birth of the Beatles, she was portrayed by Wendy Morgan. She was portrayed in 2000 television film In His Life: The John Lennon Story by Gillian Kearney; the negative aspects of John's treatment of her were not overlooked.  Cynthia was subsequently portrayed in the troubled, Ono-centric 2005 American musical Lennon, with her character – played by Julia Murney – gaining a little more prominence during one of the show's rewrites.  Her life had a more central role in the 2010 BBC Four film Lennon Naked, with Claudie Blakley playing the part. Her character was absent from the 2009 British film Nowhere Boy, which purported to cover the story of Lennon from 1955 to 1960 but focused on his relationships with his aunt and mother."]}, {"page": "London to Brighton", "response": ["* Claudie Blakley as Tracey "]}, {"page": "Ed Reardon's Week", "response": ["|Ed discovers there's money to be made in getting involved in the medical trials testing Moldova's latest miracle appetite suppressant. Guest starring Claudie Blakley as Dr Liz Newcombe, Lisa Coleman as Eli "]}, {"page": "Playing the Field", "response": ["*Claudie Blakley ... Kelly Powell"]}, {"page": "Vital Signs (TV series)", "response": ["Vital Signs is a British television drama series airing on ITV from 2006. It stars Tamzin Outhwaite as a supermarket check-out operator who decides to become a doctor. The series co-stars William Beck, Fraser Ayres, Eve Best, Claudie Blakley, Lucinda Dryzek, Beth Goddard, Alfie Hunter, Brooke Kinsella, Harry Lloyd, Peter Rnic and Steven Waddington. The filming of the show is based in numerous London hospitals and medical schools; predominantly the show has been shot in St George's Hospital and Medical School."]}, {"page": "Severance (film)", "response": ["Eventually the group reaches the lodge, which is old and in serious disrepair, but the manager, Richard (Tim McInnerny), convinces the wary but tired group to enter. Inside, Harris (Toby Stephens) discovers a file cabinet full of cryptic Palisade documents, written in Russian. The group discusses the documents, leading Harris to relate a story he'd heard about the lodge: the lodge was previously a mental institution, and in the early 20th century a Palisade-made nerve gas was used to clear it out after the inmates took over. Jill (Claudie Blakley) responds with the story she'd heard: the lodge was a \"reeducation center\" for Russian war criminals, and after an escape a Palisade-made nerve gas was used to clear escapees out of nearby buildings. Both mention a lone survivor who swore revenge on Palisade. Steve (Danny Dyer) starts to tell his own story about the lodge's past as a clinic staffed by busty nurses when he finds a human tooth in the meat pie the group is eating for dinner. Chastising Gordon (Andy Nyman) for serving a pie he just found in the kitchen, everyone goes to bed.", "*Claudie Blakley as Jill"]}, {"page": "Dirty Filthy Love", "response": ["Directed by Adrian Shergold, the film was first broadcast by ITV on 26 September 2004. It was written by Jeff Pope and Ian Puleston-Davies, who suffers from OCD himself. In addition to Michael Sheen, the cast features Shirley Henderson, Anastasia Griffith, Adrian Bower and Claudie Blakley.", "* Claudie Blakley as Kathy"]}, {"page": "A Christmas Carol (2000 film)", "response": ["* Claudie Blakley as Ellie"]}, {"page": "The Night Watch (Waters novel)", "response": ["* Claudie Blakley as Nancy"]}, {"page": "Ed Stone Is Dead", "response": ["Ed Stone Is Dead was a 2002 BBC sitcom starring Richard Blackwood, Daniel Brocklebank, Bill Paterson and Claudie Blakley. It centers on Ed Stone (Blackwood) who is accidentally killed by the grim reaper Nigel (Paterson) and becomes half-dead."]}, {"page": "List of American films of 2005", "response": ["| Pride & Prejudice || Focus Features / Working Title Films || Joe Wright (director); Deborah Moggach (screenplay); Keira Knightley, Matthew Macfadyen, Brenda Blethyn, Donald Sutherland, Tom Hollander, Rosamund Pike, Jena Malone, Judi Dench, Carey Mulligan, Talulah Riley, Simon Woods, Tamzin Merchant, Claudie Blakley, Kelly Reilly, Rupert Friend, Cornelius Booth, Penelope Wilton, Peter Wight, Meg Wynn Owen, Sinead Matthews || Romance, Drama ||"]}, {"page": "Cranford (TV series)", "response": ["| Claudie Blakley"]}, {"page": "Michelle Duncan", "response": ["Further television work includes: New Tricks  Call the Midwife. Duncan lent her voice to an adaptation of \"The Little Mermaid\" by Hans Christian Andersen at Little Angel Puppet Theatre in 2006 alongside Dame Judi Dench, Sir Michael Gambon, Rory Kinnear, Claudie Blakley, Rosamund Pike, Claire Rushbrook and Peter Wight."]}, {"page": "Lark Rise to Candleford (TV series)", "response": ["| Emma Timmins || Claudie Blakley || colspan=\"4\" "]}, {"page": "Daniel Evans (actor)", "response": ["He appeared in the controversial play Cardiff East by Peter Gill at the Royal National Theatre in 1997, and as the title role in Peter Pan, alongside Ian McKellen and Claudie Blakley."]}, {"page": "Bright Star (film)", "response": ["* Claudie Blakley as Mrs Dilke"]}, {"page": "He Knew He Was Right (TV serial)", "response": ["*Claudie Blakley — Camilla French"]}, {"page": "Ian Charleson Awards", "response": ["*Claudie Blakley, for Nina in The Seagull (West Yorkshire Playhouse)Brooke, Richard. \"Carrying the torch forward\". Sunday Times. 25 April 1999."]}, {"page": "Ring Around the Bath", "response": ["* Claudie Blakley as Alison Bartholomew"]}, {"page": "Return to Cranford", "response": ["| Claudie Blakley"]}, {"page": "Washington D.C. Area Film Critics Association Award for Best Ensemble", "response": ["| style=\"text-align:center;\"| 2005 || Pride & Prejudice || Claudie Blakley "]}, {"page": "Lennon Naked", "response": ["Sitting with his wife Cynthia (Claudie Blakley), Lennon reads the negative critical reception of Magical Mystery Tour, while comparing Cynthia to Brigitte Bardot, with whom he plans to meet after he returns from India. Lennon finds a letter addressed to him, with the word \"Breathe\" written on it—later revealed to have been written by Yoko Ono (Naoko Mori). Later, after finding his father in a neighbour's house, Freddie reveals that he has a 19-year-old girlfriend named Pauline, with whom he wants to live. Lennon accuses Freddie of leaving him again and throws him out of the house.", "* Claudie Blakley as Cynthia Lennon"]}]}}