{"wiki_id": "http://www.wikidata.org/entity/Q532522", "itemLabel": "Angela Douglas", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Angela_Douglas", "wikipedia_page": {"main": "Angela Douglas (born 29 October 1940), born Angela McDonagh, is an English actress.\n\n", "link_mentions": [{"page": "Jean Anouilh", "response": ["* The Scenario. Forum Theatre, Billingham: 29 November 1976. Directed by Stuart Burge. With Trevor Howard, Gary Bond, John Bluthal, Angela Douglas."]}, {"page": "Douglas (surname)", "response": ["* Angela Douglas (born Angela McDonagh in 1940), English actress"]}, {"page": "2002 in film", "response": ["| The Four Feathers || Paramount Pictures / Miramax Films || Shekhar Kapur (director); Mark Pellington, Bruce Joel Rubin, Greg Brooker, Michael Schiffer, Risa Bramon Garcia, Hossein Amini (screenplay); Heath Ledger, Wes Bentley, Djimon Hounsou, Kate Hudson, Rupert Penry-Jones, Kris Marshall, Michael Sheen, Alex Jennings, James Cosmo, Angela Douglas, Tim Pigott-Smith, Lucy Gordon, James Hillier || Action, Drama || Live Action"]}, {"page": "Snowdon", "response": ["In 1968, scenes representing the Khyber Pass were filmed for Carry On... Up the Khyber on the lower part of the Watkin Path. In 2005, Angela Douglas, one of the stars of the film, unveiled a plaque at the precise location where filming took place to commemorate the location filming. It now forms part of the North Wales Film and Television Trail run by the Wales Screen Commission."]}, {"page": "Kenneth More", "response": ["Some felt More's popularity declined when he left his second wife to live with Angela Douglas.\"An interview with Peter Yeldham.\" Memorable TV. Retrieved: 12 June 2012. Film writer Andrew Spicer thought that \"More's persona was so strongly associated with traditional middle class values that his stardom could not survive the shift towards working class iconoclasts\" during that decade.Spicer, Andrew. \"Kenneth More.\" BFI Screenonline. Retrieved: 6 May 2012. Another writer, Christopher Sandford, felt that \"as the sixties began and the star of the ironic, postmodernist school rose, More was derided as a ludicrous old fogey with crinkly hair and a tweed jacket.\"Sandford, Christopher. \"Quiet Hero: Happy (Belated) Birthday to British Actor Kenneth More (September 20, 1914 – July 12, 1982).\" Bright Lights Film Journal, 29 September 2014.", "More was married three times. His first marriage in 1940 to actress Mary Beryl Johnstone (one daughter, Susan Jane, born 1941) ended in divorce in 1946. He married Mabel Edith \"Bill\" Barkby in 1952 (one daughter, Sarah, born 1954) but left her in 1968 for Angela Douglas, an actress (born, like More, in Gerrards Cross) 26 years his junior, causing considerable estrangement from friends and family. He was married to Douglas (whom he nicknamed \"Shrimp\") from 17 March 1968 until his death."]}, {"page": "Gerrards Cross", "response": ["*Angela Douglas, actress, born in Gerrards Cross 29 October 1940."]}, {"page": "Brigadier Lethbridge-Stewart", "response": ["Little was shown of Lethbridge-Stewart's life outside UNIT in the television series. Planet of the Spiders referred to a relationship with a woman called Doris. By Battlefield, he was married to her (played by Angela Douglas). It was Courtney's own belief that the Brigadier had been in a previous marriage to a woman named Fiona, and that he and Doris were having an affair; his first marriage ended due to his work.Briggs, Nick, \"Marching in Time,\" Doctor Who Magazine. #228, 2 August 1995, Marvel Comics UK Ltd. p. 37 (interview with N. Courtney). See also the Spearhead From Space DVD commentary."]}, {"page": "Theatre 625", "response": ["|Angela Douglas,Bee Duffell,Philip Grout,Jimmy Thompson,Patrick Tull,Jimmy Gardner,David Battley,Job Stewart,Harold Innocent,Brian Steele,Noel Davis,Derek Needs,Henzie Raeburn,Dudley Jones"]}, {"page": "Lockleaze", "response": ["The Channel 4 sitcom Teachers was filmed at Lockleaze school. Lockleaze provided a backdrop in the 1962 film Some People directed by Clive Donner, starring Kenneth More, Angela Douglas and Ray Brooks. The film is about a youth worker (Kenneth More) trying to help a group of teenagers in Bristol. In the film, several Lockleaze landmarks were shown, including Purdown, the communication tower and the large gas holders which once stood just off Lockleaze Road. Lockleaze was also the setting for the series finale of BBC Three's 2016 drama miniseries Thirteen, starring Jodie Comer."]}, {"page": "Juke Box Jury", "response": ["* 16 March 1963 - Katie Boyle, Angela Douglas, David Gell, Sid James", "* 11 May 1963 - Carole Carr, Angela Douglas, Del Shannon, Johnny Tillotson", "* 3 August 1963 - Jimmy Henney, Janette Scott, Angela Douglas, Jimmy Young", "* 21 December 1963 – Alma Cogan, Angela Douglas, Rolf Harris, Mitch Murray and a 'surprise guest'", "* 23 January 1965 - Angela Douglas, Virginia Lewis, Wolf Mankowitz, Del Shannon", "* 17 July 1965 - Ray Brooks, Angela Douglas, Stubby Kaye, Millie"]}, {"page": "Carry On Up the Khyber", "response": ["Angela Douglas makes her fourth and final appearance in the series. Terry Scott returned to the series after his minor role in the first film of the series, Carry On Sergeant a decade earlier. The film is, in part, a spoof of Kiplingesque movies and television series about life in the British Raj, both contemporary and from earlier, Hollywood, periods. The title is a play on words in the risqué Carry On tradition, with \"Khyber\" (short for \"Khyber Pass\") being rhyming slang for \"arse\".", "A diplomatic operation ensues on the part of the British, who fail to publicly prove that the incident was an aberration. The Governor's wife (Joan Sims), in the hope of luring the Khasi into bed with her, takes a photograph of an inspection in which many of the soldiers present are found wearing underpants, and takes it to him. With this hard evidence in hand, the Khasi would be able to muster a ferocious Afghan invasion force, storm the Khyber Pass and capture India from the British; but Lady Ruff-Diamond insists that he sleep with her before she parts with the photograph. He delays on account of her unattractiveness, eventually taking her away with him to Bungdit Din's palace. Meanwhile, the Khasi's daughter, Princess Jelhi (Angela Douglas), reveals to the British Captain Keene (Roy Castle), with whom she has fallen in love, that the Governor's wife has eloped, and a team is dispatched to ensure the return of both her and the photograph.", "*Angela Douglas as Princess Jelhi"]}, {"page": "Gideon's Way", "response": ["Many well-known British actors appear in guest roles, including Patrick Allen, Keith Baxter, George Cole, Harry Fowler, Gordon Jackson, Ronald Lacey, Anton Rodgers, Rosemary Leach, Gerald Harper, Victor Maddern, Richard Carpenter and John Hurt. There was an early role for Donald Sutherland in the episode \"The Millionaire's Daughter\". Several actors, including Mike Pratt, Angela Douglas, Jean Marsh and Kay Walsh, appear twice in the series, cast in different roles."]}, {"page": "Espionage (TV series)", "response": ["| The Gentle Spies || 23 October 1963 || David Greene || Barry Foster, Angela Douglas, Godfrey Quigley, Joan Hickson, Michael Hordern, Eric Pohlmann"]}, {"page": "List of Brookside characters", "response": ["|Lady Hilary Cuddington || Angela Douglas || 1999–2000"]}, {"page": "Carry On Cowboy", "response": ["Carry On Cowboy is a 1965 British comedy Western film, the eleventh in the series of 31 Carry On films (1958–1992). It was the first film to feature series regulars Peter Butterworth and Bernard Bresslaw. Series regulars Sid James, Kenneth Williams, Jim Dale, Charles Hawtrey and Joan Sims all feature, and Angela Douglas makes the first of her four appearances in the series. Kenneth Williams, usually highly critical of all the Carry on films he appeared in, called the film \"a success on every level\" in his diary, taking pride in its humour and pathos.", "The Rumpo Kid hears of the new Marshal, and tries all he can to kill the Marshal without being caught, including sending out a pack of Indians, led by their Chief Big Heap (Charles Hawtrey) and hanging the Marshal after framing him for cattle rustling. Knutt is saved by the prowess of Annie Oakley (Angela Douglas), who has arrived in Stodge to avenge Earp's death and has taken a liking to Knutt."]}, {"page": "Carry On Screaming!", "response": ["Carry On Screaming! is a 1966 British black comedy horror film, the twelfth in the series of 31 Carry On films (1958–1992). It was the last of the series to be made by Anglo-Amalgamated before the series moved to The Rank Organisation. Of the regular cast, it features Kenneth Williams, Jim Dale, Charles Hawtrey, Joan Sims, Bernard Bresslaw and Peter Butterworth. It also features Harry H. Corbett in his only series appearance and Fenella Fielding making her second and final appearance. Angela Douglas makes the second of her four Carry On appearances.  Carry On Screaming is a parody of the Hammer horror films, which were also popular at the time.", "The film opens in the Edwardian era in Hocombe Woods, where Doris Mann (Angela Douglas) and Albert Potter (Jim Dale) are courting. When Albert searches the woods for a peeping Tom, Doris is abducted by a monster named Oddbod (Tom Clegg), which leaves a finger behind. Albert, finding the finger, rushes to the police station and reports the matter to Detective Constable Slobotham (Peter Butterworth), who in turn tells his superior, the henpecked Detective Sergeant Sidney Bung (Harry H. Corbett), who has been investigating similar disappearances in the same woods.", "* Angela Douglas as Doris Mann"]}, {"page": "Oil Strike North", "response": ["* Angela Douglas - Julie Ward"]}, {"page": "Cardiac Arrest (TV series)", "response": ["* Angela Douglas as Isobel Trimble (series 2–3)", "Throughout series 3, there is a touching subplot concerning the growing love interest between Mr Docherty and his personal secretary, Mrs Isobel Trimble (Angela Douglas), his attempts to ask her to marry him and their ultimate engagement in the series finale."]}, {"page": "Follow That Camel", "response": ["Follow That Camel is a 1967 British comedy film, the 14th in the series of 31 Carry On films (1958–1992). Like its predecessor Don't Lose Your Head, it does not have the words \"Carry On\" in its original title (though for screenings outside the United Kingdom it was known as Carry On In The Legion, and it is alternatively titled Carry On ... Follow That Camel). It parodies the much-filmed 1924 book Beau Geste, by PC Wren, and other French Foreign Legion films.  This film was producer Peter Rogers's attempt to break into the American market; Phil Silvers (in his only Carry On) is heavily featured in a Sergeant Bilko-esque role. He appears alongside Carry On regulars Kenneth Williams, Jim Dale, Charles Hawtrey, Joan Sims, Peter Butterworth and Bernard Bresslaw. Angela Douglas makes the third of her four Carry On appearances.  Anita Harris makes the first of her two Carry On appearances.", "*Angela Douglas as Lady Jane Ponsonby"]}, {"page": "List of The Avengers (TV series) episodes", "response": ["| Caroline Blakiston, Angela Douglas, Geoffrey Palmer, Neil Wilson"]}, {"page": "Bill Bryden", "response": ["In the same year, he met actress Angela Douglas at a dinner party arranged by mutual friend Marsha Hunt. They lived together in west London and were married at City Hall, New York City, in February 2009."]}, {"page": "Digby, the Biggest Dog in the World", "response": ["Digby, the Biggest Dog in the World is the title character of a British children's fantasy-adventure comedy film released in 1973 starring Jim Dale, and directed by Joseph McGrath. A large supporting cast of British movie stalwarts includes Spike Milligan, Angela Douglas, Norman Rossington, Milo O'Shea, Dinsdale Landen and Victor Spinetti. The production included composer Edwin Astley and cinematographer Harry Waxman. The film was based on the 1960 novel The Biggest Dog in the World by Ted Key.", "*Angela Douglas - Janine "]}, {"page": "The Four Feathers (2002 film)", "response": ["* Angela Douglas as Aunt Mary"]}, {"page": "Ardmore Studios", "response": ["* Murder in Eden (film) (1961) - (distributed by J. Arthur Rank Film Distributors) - (with Angela Douglas)"]}, {"page": "Shadow Run (film)", "response": ["* Angela Douglas as Bridget"]}, {"page": "List of Carry On films cast members", "response": ["* Angela Douglas (4) played leading roles in Cowboy, Screaming, Follow that Camel and Up the Khyber.", "!Shirley Eaton!!Eric Barker!!Bill Owen!!Terence Longdon!!Leslie Phillips!!June Whitfield!!Esma Cannon!!Liz Fraser!!Dilys Laye!!Angela Douglas!!Jacki Piper!!Kenneth Cope!!Bernard Cribbins"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Angela Douglas"]}, {"page": "List of Western films of the 1960s", "response": ["|Carry On Cowboy || Gerald Thomas || Sid James, Jim Dale, Joan Sims, Angela Douglas, Kenneth Williams || United Kingdom || comedy Western"]}, {"page": "List of adventure films of the 1960s", "response": ["|Follow That Camel||Gerald Thomas||Phil Silvers, Kenneth Williams, Jim Dale, Charles Hawtrey, Joan Sims, Angela Douglas||United Kingdom||Adventure comedy (in German)", "|Carry On Up the Khyber|| Gerald Thomas|| Sid James, Kenneth Williams, Charles Hawtrey, Roy Castle, Joan Sims, Terry Scott, Angela Douglas||United Kingdom|| Adventure comedy"]}, {"page": "List of science fiction films of the 1970s", "response": ["|Digby, the Biggest Dog in the World||Joseph McGrath||Jim Dale, Spike Milligan, Angela Douglas||United Kingdom||"]}, {"page": "The Shakedown (1959 film)", "response": ["* Angela Douglas as Model"]}, {"page": "Doctor at Large (TV series)", "response": ["Back at St Swithin's, Mike is admitted for mumps and despite the attractions of Nurse Parker (Angela Douglas), is keen to get out. With Mollie Maureen as a nervous patient, James Bree as a boring patient and Desmond Jones as his boring brother."]}, {"page": "List of Coronation Street characters (1961)", "response": ["| Angela Douglas"]}, {"page": "Maroc 7", "response": ["* Angela Douglas as Freddie"]}, {"page": "Deceit (2000 miniseries)", "response": ["* Angela Douglas as Anne Barlow"]}, {"page": "Some People (film)", "response": ["Kenneth More agreed to play his role for nothing apart from his expenses because he had no other offers around the time, and the movie was for a good cause: all proceeds were to go to the Duke of Edinburgh's Award Scheme who commissioned the film and the National Playing Fields Association. During filming he began an affair with one of the cast, Angela Douglas, who became his wife.Kenneth More, More or Less, Hodder & Staughton, 1978 p 184-185", "* Angela Douglas as Terry", "* Valerie Mountain dubbed Angela Douglas's singing voiceValerie Mountain, Allmusic entry Valerie Mountain And The Eagles – Some People Discogs. Retrieved 1 December 2018"]}, {"page": "The Comedy Man", "response": ["* Angela Douglas - Fay Trubshaw"]}, {"page": "The Wind of Change (film)", "response": ["* Angela Douglas as Denise"]}, {"page": "Murder in Eden (film)", "response": ["* Angela Douglas ...  Beatnik "]}, {"page": "It's All Happening (film)", "response": ["It's All Happening is a 1963 British musical film directed by Don Sharp and starring Tommy Steele, Michael Medwin and Angela Douglas. ", "* Angela Douglas - Julie Singleton ", "Filming took place at Shepperton Studios in January 1963. Angela Douglas, who has a leading role, recalled in her memoirs that Steele \"was terrific, making me feel good, putting me at ease\" and that \"they were a marvelous crew, fun and relaxed.\""]}, {"page": "Design for Loving", "response": ["* Angela Douglas - Bernie's Secretary"]}]}}