{"wiki_id": "http://www.wikidata.org/entity/Q532184", "itemLabel": "Sebastian Shaw", "itemDescription": "stage actor; movie actor; author", "wikipedia_url": "https://en.wikipedia.org/wiki/Sebastian_Shaw_(actor)", "wikipedia_page": {"main": "Sebastian Lewis Shaw (29 May 1905 – 23 December 1994) was an English actor, director, novelist, playwright and poet. During his 65-year career, he appeared in dozens of stage performances and more than 40 film and television productions.\nShaw was born and brought up in Holt, Norfolk, and made his acting debut at age eight at a London theatre. He studied acting at Gresham's School and the Royal Academy of Dramatic Art. Although he worked primarily on the London stage, he made his Broadway debut in 1929, when he played one of the two murderers in Rope's End. He appeared in his first film, Caste, in 1930 and quickly began to create a name for himself in films. He described himself as a \"rotten actor\" as a youth and said his success was primarily due to his good looks. He claimed to mature as a performer only after returning from service in the Royal Air Force during World War II.\nShaw was particularly known for his performances in productions of Shakespeare plays which were considered daring and ahead of their time. In 1966, he joined the Royal Shakespeare Company, where he remained for a decade and delivered some of his most acclaimed performances. He also wrote several poems and a novel, The Christening, in 1975. In 1983, he appeared in the third installment of the original Star Wars Trilogy, Return of the Jedi, in a brief but significant role as the redeemed Anakin Skywalker, as well as Skywalker's ghost in the original 1983 theatrical release of the film.", "link_mentions": [{"page": "May 29", "response": ["*1905 – Sebastian Shaw, English actor, director, and playwright (d. 1994)"]}, {"page": "Sebastian Shaw", "response": ["Sebastian Shaw is the name of:", "* Sebastian Shaw (actor) (1905–1994), English film and stage actor", "* Sebastian Shaw (comics), a character from the X-Men comic books by Marvel Comics", "* Sebastian Shaw (serial killer) (1967–2021), Vietnamese-born American serial killer", "* Sebastian Shaw, British TV actor on Coronation Street"]}, {"page": "1930s", "response": ["* Sebastian Shaw"]}, {"page": "1905", "response": ["* May 29 – Sebastian Shaw, English actor (d. 1994)"]}, {"page": "Cymbeline", "response": ["A decade later, John Barton's 1974 production for the RSC (with assistance from Clifford Williams) featured Sebastian Shaw in the title role, Tim Pigott-Smith as Posthumus, Ian Richardson as Iachimo, and Susan Fleetwood as Imogen. Charles Keating was Cloten. As with contemporary productions of Pericles, this one used a narrator (Cornelius) to signal changes in mood and treatment to the audience. Robert Speaight disliked the set design, which he called too minimal, but he approved the acting."]}, {"page": "A Midsummer Night's Dream", "response": ["* A 1968 film version was directed by Peter Hall. The cast included Paul Rogers as Bottom, Ian Holm as Puck, Diana Rigg as Helena, Helen Mirren as Hermia, Ian Richardson as Oberon, Judi Dench as Titania, and Sebastian Shaw as Quince. This film stars the Royal Shakespeare Company, and is directed by Peter Hall."]}, {"page": "Return of the Jedi", "response": ["** Sebastian Shaw as Anakin Skywalker", "In this version of Return of the Jedi, Sebastian Shaw's portrayal of Anakin's spirit is replaced by Hayden Christensen, who portrayed Anakin in Attack of the Clones and Revenge of the Sith. All three films of the trilogy were released individually on Limited Edition DVDs on September 12, 2006, with the original unaltered versions included as bonus features. These were collected in a box set on November 4, 2008."]}, {"page": "Hayden Christensen", "response": ["Stock footage of Christensen was used in the 2004 DVD-release edition of Return of the Jedi, where he was inserted to replace Sebastian Shaw as the force ghost of the redeemed Anakin Skywalker. This was one of the most controversial changes.Johnson, Derek. \"Star Wars fans, DVD, and cultural ownership: an interview with Will Brooker; Interview\", Velvet Light Trap, September 22, 2005, pg. 36–44. Lucas wanted Anakin's inner person to return to who he was before he turned to the dark side. Christensen insisted this was done without his knowledge, an act that was confirmed by Lucasfilm itself in the featurette \"Return of the Jedi: What has changed?\" as seen on the official website to commemorate the 2006 DVDs."]}, {"page": "Darth Vader", "response": ["The character has been portrayed by numerous actors: David Prowse physically portrayed Vader while James Earl Jones voiced him in the original trilogy, and Sebastian Shaw portrayed the unmasked Anakin in Return of the Jedi, as well as the character's spirit in the original release of that film. Jake Lloyd played Anakin Skywalker as a child in The Phantom Menace, the first film of the prequel trilogy, while Hayden Christensen played him as a young adult in the following two films.", "During production of Return of the Jedi, the casting crew sought an experienced actor for the role of Anakin Skywalker since his death was unquestionably the emotional climax of the film, and Sebastian Shaw was selected for the role. When Shaw arrived at the set for filming, he ran into his friend Ian McDiarmid, the actor playing the Emperor. When McDiarmid asked him what he was doing there, Shaw responded, \"I don't know, dear boy, I think it's something to do with science-fiction.\" His presence during the filming was kept secret from all but the minimum cast and crew, and Shaw was contractually obliged not to discuss any film secrets with anyone, even his family. The unmasking scene, directed by Richard Marquand, was filmed in one day and required only a few takes, with no alteration from the original dialogue. Lucas personally directed Shaw for his appearance in the final scene of the film, in which he plays Anakin's Force spirit. Shaw's likeness in this scene was replaced with that of Christensen in the 2004 DVD release. This attempt to tie the prequel and original trilogies together was one of the most controversial changes in a Star Wars re-release. Shaw received more fan mail and autograph requests from Return of the Jedi than he had for any role in the rest of his career. He later reflected that he enjoyed his experience on the film and expressed particular surprise that an action figure was made of his portrayal."]}, {"page": "Holt, Norfolk", "response": ["The school's former pupils include Benjamin Britten, W. H. Auden, Lord Reith, Sir Alan Lloyd Hodgkin, President Erskine Childers, Sir Christopher Cockerell, Donald Maclean, Sir Lennox Berkeley, Sir Stephen Spender, Richard Hand, Tom Wintringham, Sir James Dyson, Ralph Firman, Sir Peter Brook, Paddy O'Connell, Sebastian Shaw, Olivia Colman, Sienna Guillory, John Tusa, Tom Youngs and Michael Cummings.", "*Sebastian Shaw (1905–1994), actor"]}, {"page": "1997 in film", "response": ["| Return of the Jedi (Special Edition) || 20th Century Fox / Lucasfilm || Richard Marquand (director); Lawrence Kasdan, George Lucas (screenplay); Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Anthony Daniels, David Prowse, James Earl Jones, Ian McDiarmid, Kenny Baker, Peter Mayhew, Frank Oz, Alec Guinness, Sebastian Shaw, Michael Pennington, Kenneth Colley, Michael Carter, Denis Lawson, Tim Rose, Dermot Crowley, Caroline Blakiston, Warwick Davis, Jeremy Bulloch, Femi Taylor, Annie Arbogast, Jack Purvis, Mike Edmonds, Jane Busby, Nicki Reade, Debbie Lee Carrington, Sadie Corre, Tony Cox, Phil Fondacaro, Ben Burtt, Richard Marquand, Mike Quinn, Deep Roy, Phil Tippett, Larry Ward, Robert Watts || Sci-Fi, Fantasy || Live action"]}, {"page": "1994 in film", "response": ["| style=\"text-align:center;\"| 23 || Sebastian Shaw || style=\"text-align:center;\"| 89 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "1987 in film", "response": ["* High Season, directed by Clare Peploe, starring Jacqueline Bisset, James Fox, Irene Papas, Kenneth Branagh, Lesley Manville, Robert Stephens, and Sebastian Shaw"]}, {"page": "1983 in film", "response": ["| Return of the Jedi || 20th Century Fox / Lucasfilm || Richard Marquand (director); Lawrence Kasdan, George Lucas (screenplay); Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Anthony Daniels, David Prowse, James Earl Jones, Ian McDiarmid, Kenny Baker, Peter Mayhew, Frank Oz, Alec Guinness, Sebastian Shaw, Michael Pennington, Kenneth Colley, Michael Carter, Denis Lawson, Tim Rose, Dermot Crowley, Caroline Blakiston, Warwick Davis, Jeremy Bulloch, Femi Taylor, Annie Arbogast, Jack Purvis, Mike Edmonds, Jane Busby, Nicki Reade, Debbie Carrington, Sadie Corre, Tony Cox, Phil Fondacaro, Ben Burtt, Richard Marquand, Mike Quinn, Deep Roy, Phil Tippett, Larry Ward, Robert Watts || Sci-Fi, Fantasy || Live action "]}, {"page": "1966 in film", "response": ["* It Happened Here, starring Sebastian Shaw – (U.K.)"]}, {"page": "BBC Television Shakespeare", "response": ["After the war, Shakespearean adaptations were screened much less frequently, and tended to be more 'significant' specifically made-for-TV productions. In 1947, for example, O'Ferrall directed a two-part adaptation of Hamlet, starring John Byron as Hamlet, Sebastian Shaw as Claudius and Margaret Rawlings as Gertrude (5 & 15 December). Other post war productions included Richard II, directed by Royston Morley, and starring Alan Wheatley as Richard and Clement McCallin as Bolingbroke (29 October 1950); Henry V, again directed by Morley, and starring Clement McCallin as Henry and Olaf Pooley as The Dauphin (22 April 1951); an original Sunday Night Theatre production of The Taming of the Shrew, directed by Desmond Davis, and starring Margaret Johnston as Katherina and Stanley Baker as Petruchio (20 April 1952); a TV version of John Barton's Elizabethan Theatre Company production of Henry V, starring Colin George as Henry and Michael David as The Dauphin (19 May 1953); a Sunday Night Theatre live performance of Lionel Harris' musical production of The Comedy of Errors, starring David Pool as Antipholus of Ephesus and Paul Hansard as Antipholus of Syracuse (16 May 1954); and The Life of Henry the Fifth, the inaugural programme of BBC's new World Theatre series, directed by Peter Dews, and starring John Neville as Henry and John Wood as The Dauphin (29 December 1957).", "The Prefaces to Shakespeare episode for All's Well That Ends Well was presented by Sebastian Shaw who had played the King of France in a 1968 RSC production directed by John Barton. The Shakespeare in Perspective episode was presented by comedian and television writer Barry Took."]}, {"page": "List of Star Wars characters", "response": ["| Anakin:Jake Lloyd (The Phantom Menace), Hayden Christensen (Attack of the Clones, Revenge of the Sith and Return of the Jedi [Special Edition]), Sebastian Shaw (Return of the Jedi)Voice: Matt Lanter (The Clone Wars, Rebels and Forces of Destiny), Hayden Christensen (The Rise of Skywalker; archive audio on Rebels and The Clone Wars)Vader:David Prowse (Episodes IV–VI), Hayden Christensen (Revenge of the Sith and Obi-Wan Kenobi), Spencer Wilding and Daniel Naprous (Rogue One)Voice: James Earl Jones (Episodes III–VI, Rebels and Rogue One)"]}, {"page": "Timon of Athens", "response": ["Rarely performed, Timon of Athens was produced for TV as part of the BBC Television Shakespeare series in 1981 with Jonathan Pryce as Timon, Norman Rodway as Apemantus, John Welsh as Flavius, and John Shrapnel as Alcibiades, with Diana Dors as Timandra, Tony Jay as the Merchant, Sebastian Shaw as the Old Athenian, and John Fortune and John Bird as Poet and Painter. This Elizabethan/Jacobean historical period drama production was directed by Jonathan Miller."]}, {"page": "Donald Swann", "response": ["* 1958 – London Sketches (Donald Swann & Sebastian Shaw)"]}, {"page": "Man and Superman", "response": ["In 1946. the BBC Third Programme broadcast the entire play for the first time. The production was directed by Peter Watts. It starred John Garside, Leonard Sachs, Sebastian Shaw, Grizelda Hervey amongst others. "]}, {"page": "BBC television drama", "response": ["The Times credited the ambition of BBC television drama in its review of a July 1938 modern dress version of Julius Caesar, while also criticising some of the production's technical failings. \"From the moment when Mr. Sebastian Shaw and Mr. Anthony Ireland were discovered sitting at a café table, discussing the political situation over a glass of beer, looking like two Fascist officers, yet speaking the lines assigned to Brutus and Cassius, the attention of the audience was riveted... The penumbrascope, a device for providing a background by means of shadows, which came into play for the first time in this production, was used so carelessly that its edges were often visible. The essence of stagecraft is illusion, which must not be shattered by such accidents. Caesar's ghost was also very unconvincing, nor did the handful of people listening to the funeral orations suggest an excited mob.\" Greater praise was given by the same paper to Felicity's First Season, broadcast in September 1938 and, unusually for the time, written directly for television. \"The play relies on dialogue throughout, and there is a skilful use of film to suggest the journey to Scotland. While there are few characters and little change of scenery, enormous cocktail parties, balls, and jumble sales seemed to be in progress just out of sight. The result was something between a stage play and a film—that is to say, good television entertainment.\""]}, {"page": "It Happened Here", "response": ["The film had an estimated cast of 900, all volunteers, with several professional actors among them Sebastian Shaw and Reginald Marsh. A number of the extras in the film were members of British science fiction fandom, and a portion was previewed at a science fiction convention in Peterborough.Linwood, Jim. \"The Third Reich: My Part in its Downfall\"; e*I*25 (Vol. 5 No. 2), April 2006 (Earl Kemp, ed.)Skyrack #71, 20 Oct. 1964 (Ron Bennett, ed.) Many of the British fascists in the film were former members of the British Union of Fascists, and similarly, German ex-servicemen portrayed SS and Wehrmacht soldiers and airmen.Kevin Brownlow: How It Happened Here. UKA Press, London/Amsterdam/Shizuoka 2007, . The key role of Pauline, a nurse evacuated from Salisbury to London, was played by Pauline Murray. The film was partially shot in Grim's Dyke. Though the cast was almost entirely amateur, It Happened Here helped to launch the career of its cinematographer, Peter Suschitzky, who went on to work on such films as The Rocky Horror Picture Show and The Empire Strikes Back."]}, {"page": "David Prowse", "response": ["Prowse played the physical form of Darth Vader in the original Star Wars trilogy. Prowse spoke the dialogue during filming, but George Lucas wanted a \"darker voice\" than Prowse's relatively jovial West Country accent, and had James Earl Jones provide a more sinister, malevolent voice for the character. Prowse stated he was originally told he would be seen and heard at the end of Return of the Jedi when Vader's mask was removed. Instead, actor Sebastian Shaw was used.Pirani, Adam. \"Sebastian Shaw: The Return of Anakin Skywalker\", Starlog, July 1987, Vol. 11, Iss. 120, p. 56–57, 96. Upon Prowse's death, Lucas stated that:David brought a physicality to Darth Vader that was essential for the character. He made Vader leap off the page and on to the big screen, with an imposing stature and movement performance to match the intensity and undercurrent of Vader’s presence. David was up for anything and contributed to the success of what would become a memorable, tragic figure.In the 2004 documentary Empire of Dreams, actress Carrie Fisher, who played Princess Leia in the original trilogy films, quipped that they nicknamed Prowse \"Darth Farmer\" (a jibe regarding his West Country accent). In the lightsaber fight scenes between Vader and Luke Skywalker (Mark Hamill), Prowse, who was not a very skilled swordsman and kept breaking the staffs used as the lightsabers, was replaced by the scene's fight choreographer, the stuntman and fencing coach Bob Anderson. Prowse felt sidelined by Anderson during the making of Return of the Jedi in particular, and said he was only able to persuade director Richard Marquand that he should be the one to throw the Emperor down the shaft after Marquand had tried and failed for a week to film the scene successfully without him."]}, {"page": "Changes in Star Wars re-releases", "response": ["In the scene where Anakin Skywalker is unmasked, the 2004 edition digitally removed his eyebrows to reflect Anakin burning on Mustafar at the end of Revenge of the Sith. Actor Sebastian Shaw's brown eyes were also digitally changed to blue to match Hayden Christensen's eye color.", "At the end of the film, Darth Vader is redeemed by killing the Emperor to save Luke Skywalker's life, then dies of his injuries shortly after, and appears to Luke as Anakin Skywalker alongside the Force spirits of Yoda and Obi-Wan Kenobi. In the 1983 theatrical release, Sebastian Shaw plays this Force spirit in addition to an unmasked Vader. Hayden Christensen later played Anakin in the prequel trilogy films Attack of the Clones and Revenge of the Sith. To reflect this, the 2004 edition of Return of the Jedi replaced Shaw's appearance as the Force spirit with Christensen. Some considered the change controversial, with Den of Geek rating it as the worst change to the original trilogy. The Digital Bits notes that the 2019 restoration made it more obvious where Anakin's head was replaced."]}, {"page": "The Spy in Black", "response": ["The Spy in Black stars Conrad Veidt, Valerie Hobson and Sebastian Shaw, with Marius Goring and Torin Thatcher as two German submarine officers. Grant Sutherland, a minister in Powell's The Edge of the World (1937), appears in this film as a Scottish air raid warden.", "In March 1917, Captain Hardt (Conrad Veidt), a World War I German U-boat commander, is ordered to lead a mission to attack the British Fleet at Scapa Flow, rendezvousing at the Old Man of Hoy. He sneaks ashore on the Orkney Islands to meet his contact, Fräulein Tiel (Valerie Hobson). Tiel has taken over the identity of a new local schoolteacher, Miss Anne Burnett (June Duprez), who female German agents had intercepted and chloroformed en route to the island. Hardt finds himself attracted to her, but Tiel shows no interest. The Germans are aided by a disgraced Royal Navy officer, the former Commander Ashington (Sebastian Shaw) who, according to Tiel, has agreed to aid the Germans after losing his command due to drunkenness, and Tiel implies that she has slept with Ashington to obtain his cooperation.", "* Sebastian Shaw as Lt. Ashington/Cmdr. David Blacklock"]}, {"page": "Albany (London)", "response": ["* Sebastian Shaw, actor."]}, {"page": "Reilly, Ace of Spies", "response": ["* Sebastian Shaw as Reverend Thomas"]}, {"page": "Leslie Norman (director)", "response": ["In 1939, prior to joining the British Army, Norman co-directed with Anthony Hankey the thriller Too Dangerous to Live starring Sebastian Shaw and Anna Konstam."]}, {"page": "1905 in the United Kingdom", "response": ["* 3 May – Sebastian Shaw, actor (died 1994)"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Sebastian Shaw (Acting Diploma 1926)"]}, {"page": "Rope (play)", "response": ["* Wyndham Brandon - Sebastian Shaw", "* Wyndham Brandon - Sebastian Shaw"]}, {"page": "The Great War (TV series)", "response": ["The Great War is a 26-episode documentary series from 1964 on the First World War. The documentary was a co-production of the Imperial War Museum, the British Broadcasting Corporation, the Canadian Broadcasting Corporation and the Australian Broadcasting Commission. The narrator was Michael Redgrave, with readings by Marius Goring, Ralph Richardson, Cyril Luckham, Sebastian Shaw and Emlyn Williams. Each episode is  long."]}]}}