{"wiki_id": "http://www.wikidata.org/entity/Q5321697", "itemLabel": "E. A. Markham", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/E._A._Markham", "wikipedia_page": {"main": "Edward Archibald \"Archie\" Markham FRSL (1 October 1939 – 23 March 2008) was a Montserratian poet, playwright, novelist and academic. He moved to the United Kingdom in 1956, where he remained for most of his life, writing as well as teaching at various academic institutions. He was known for writing subtle, witty and intelligent poetry, which refused to conform to the conventions, and stereotypes, of British and Caribbean poetry alike.", "link_mentions": [{"page": "List of English-language poets", "response": ["*E. A. Markham (1939–2008, Mo/E)"]}, {"page": "Montserrat", "response": ["* E. A. Markham, poet and author"]}, {"page": "List of poets", "response": ["*E. A. Markham (1939–2008), Montserrat poet, playwright and novelist"]}, {"page": "Anthology of Twentieth-Century British and Irish Poetry", "response": ["* E. A. Markham"]}, {"page": "Archie Markham", "response": ["#REDIRECT E. A. Markham"]}, {"page": "Enga Province", "response": ["Enga was part of Western Highlands District until just before Papua New Guinea independence in 1975, when most of the Enga-speaking part of the District (with the notable exclusion of the Baiyer River region which is inaccessible by road other than from Mount Hagen) was separated into a discrete District. Eminent international poet and writer E. A. Markham worked and lived in Wabag as a VSO volunteer in 1983-84 and wrote A Papua New Guinea Sojourn about the province and his time in it."]}, {"page": "Hinterland: Caribbean Poetry from the West Indies and Britain", "response": ["Hinterland: Caribbean Poetry from the West Indies and Britain is a 1989 poetry anthology edited by E. A. Markham. In a long introductory essay Markham writes:", "* E. A. Markham"]}, {"page": "T. S. Eliot Prize", "response": ["*E. A. Markham, A Rough Climate"]}, {"page": "List of alumni of University of Wales, Lampeter", "response": ["From the world of clergy, the college's alumni include seven Archdeacons (George Austin, Carl Cooper, Owen Evans, Judy French, John Griffiths, John Holliman and Lawrence Thomas), several bishops, and one Archbishop of Wales (Alwyn Rice Jones). The list of educators includes a President of Washington & Jefferson College (John C. Knapp) and a Vice-Chancellor of Edge Hill University (John Cater). Academics who studied at the college went on to teach at University College Cork (Graham Allen), Oxford Brookes University (William Gibson), Wuhan University (James R. Lewis), and St David's College itself (William Henry Harris, Dic Edwards and Daniel Silvan Evans). The list of alumni also includes one member of the Senedd (Rhodri Glyn Thomas), a founding member of the Social Democratic Party (Sue Slipman), a polar explorer (Hannah McKeand), and several writers and poets (Ian Marchant, E. A. Markham, Adrian Mourby, Peter Paphides and Fred Secombe)."]}, {"page": "Caribbean literature", "response": ["*E. A. Markham"]}, {"page": "Peak Literary Festival", "response": ["Previous festival authors included Clare Short, Tariq Ali, Matthew Parris, Gervase Phinn, Brian Turner, the Dowager Duchess of Devonshire, Clive Aslet (Country Life editor), James Geary (editor of Time Magazine), Roger Protz (editor of the Campaign for Real Ale (CAMRA), Jane Fearnley Whittingstall, Colin Tudge, David Rothenberg, David and Ben Crystal, Martin Gurdon, Mark Gwynne Jones, E. A. Markham, Meg Hutchinson, Wendy Holden, Dugald Steer, Martyn Ware (The Human League), Russel Senior and Nick Banks (Pulp), Mark Waddington (CEO of Warchild), Nick Temple (editor of Global Ideas Bank), Susanne Garnett (Director of Village Aid), Ann Widdecombe, Anne Fine, Gary Younge, Stuart Mcleane, Jeanette Orrey, Sue Cowley, Margaret Dickinson, Moazzam Begg, Edwina Currie, Don Shaw, Immaculee Ilibagiza. Speakers at previous Countrybookshop events include Ellen MacArthur, Joe Simpson, Simon Yates, Roy Hattersley, Richard Whiteley and Judith Miller."]}, {"page": "1993 in poetry", "response": ["* E. A. Markham, Letter from Ulster and the Hugo Poems"]}, {"page": "1989 in poetry", "response": ["* E. A. Markham, editor, Hinterland: Caribbean Poetry from the West Indies and Britain"]}, {"page": "1984 in poetry", "response": ["* E. A. Markham, Human Rites"]}, {"page": "Bloodaxe Books", "response": ["*Hinterland, edited by E. A. Markham, a Caribbean anthology, 1989."]}, {"page": "2008 in literature", "response": ["*March 23 – E. A. Markham, Montserrat poet, writer and activist (born 1939)"]}, {"page": "Icarus (magazine)", "response": ["Notable contributors have included John Montague, Seamus Heaney, Paul Durcan, Louis MacNeice, Matthew Sweeney, E. A. Markham, Donald Davie, Dermot Bolger, John F. Deane, Thomas Kinsella, W. R. Rodgers, Frank O’Connor, Edward Lucie-Smith, Eavan Boland, Seamus Deane, Gerald Dawe, Caitriona O'Reilly, Sinéad Morrissey, Justin Quinn, Thom Gunn, Colm Tóibín, Vona Groarke, Brian Keenan, Eilis Ni Dhuibhne, Desmond Hogan, Monk Gibbon, Arland Ussher, Ciaran Carson, Kevin Barry, Cyrus Cassells."]}, {"page": "E A Markham", "response": ["#REDIRECT E. A. Markham "]}, {"page": "E.A. Markham", "response": ["#REDIRECT E. A. Markham "]}, {"page": "EA Markham", "response": ["#REDIRECT E. A. Markham "]}, {"page": "2008 in poetry", "response": ["* March 23 – E. A. Markham, 68, Montserrat-born British poet and writer. "]}, {"page": "Deaths in March 2008", "response": ["*E. A. Markham, 68, Montserrat-born British poet and writer."]}, {"page": "Caribbean poetry", "response": ["* E. A. Markham", "* E. A. Markham, Hinterland: Caribbean Poetry from the West Indies and Britain, Newcastle upon Tyne: Bloodaxe, 1989."]}, {"page": "Neil Astley", "response": ["Astley's stated aim has been to achieve editorial breadth and balance by publishing what he believes to be the best of many different kinds of poetry: \"The only positive discrimination I have exercised has been in favour of literary quality\", which has involved commissioning several anthologies designed to redress imbalances in the availability of writing by women or minorities, including Jeni Couzyn's Bloodaxe Book of Contemporary Women Poets (1985), E. A. Markham's Hinterland: Caribbean Poetry from the West Indies and Britain (1989), Deryn Rees-Jones's Modern Women Poets (2005), published as the companion anthology to a critical study, Consorting with Angels (2005), Jeet Thayil's Bloodaxe Book of Contemporary Indian Poets (2008), Out of Bounds: British Black & Asian Poets (ed. Jackie Kay, James Procter and Gemma Robinson, 2012), and three anthologies of emerging black and minority ethnic poets mentored through the Complete Works project established by Spread the Word, Ten: new poets (ed. Bernardine Evaristo and Daljit Nagra, 2010), Ten: the new wave (ed. Karen McCarthy Woolf, 2014) and 'Ten: poets of the new generation (ed. Karen McCarthy Woolf, 2017)."]}, {"page": "Numbers (magazine)", "response": ["* E. A. Markham"]}, {"page": "Markham (surname)", "response": ["* E. A. Markham (1939–2008), a poet and writer, born in Harris, Montserrat"]}, {"page": "Ferdinand Dennis", "response": ["Calling Voices of the Crossing (2000) \"a fine anthology of 14 memoirs by writers from Africa, the Caribbean, India and Pakistan\" (E. A. Markham, Attia Hosain, Beryl Gilroy, John Figueroa, David Dabydeen, Mulk Raj Anand, Dom Moraes, Buchi Emecheta, Rukhsana Ahmad, G. V. Desani, Homi Bhabha, James Berry, Farrukh Dhondy and Nirad Chaudhuri), the New Statesman reviewer Robert Winder wrote: \"...the memoirs in this book, while not the major works of any of the writers concerned, might be as significant as their more ambitious work.... They are more direct, eye-opening tributes to the spirited resolve that underpins all literature, not just 'colonial' literature.\"Robert Winder, \"The longest journey. Post-imperial writing is suffused by a sense of exile and loss. But what the authors have most in common is the pursuit of individual freedom...\", New Statesman, 13 March 2000."]}, {"page": "International Book Fair of Radical Black and Third World Books", "response": ["Those who attended the Book Fair came from the Caribbean, Africa, Asia, Central America, the US, as well as the UK and other parts of Europe, not only to exhibit, order and distribute books but to take part in the accompanying programme of events that, alongside political discussion, showcased different cultural presentations including poetry and prose readings, drama, music and film. The many notable participants over the years included John Agard, Ama Ata Aidoo, Tariq Ali, May Ayim, Imruh Bakari, Biyi Bandele, Amiri Baraka, James Berry, Valerie Bloom, Jean Binta Breeze, Yvonne Brewster, Dennis Brutus, Robert Chrisman, Merle Collins, Carolyn Cooper, Fred D'Aguiar, Melvin Edwards, Nuruddin Farah, Edouard Glissant, Lorna Goodison, Roy A. K. Heath, Tim Hector, bell hooks, Gus John, Linton Kwesi Johnson, June Jordan, Jackie Kay, Shake Keane, James Kelman, Talib Kibwe, Errol Lloyd, Earl Lovelace, Jack Mapanje, E. A. Markham, Paule Marshall, Pauline Melville, Louise Meriwether, Adrian Mitchell, Nancy Morejon, Lionel Ngakane, Pitika Ntuli, Odia Ofeimun, Olu Oguibe, Ben Okri, Kole Omotoso, Oku Onuora, Horace Ové, Alex Pascall, Okot p'Bitek, Caryl Phillips, John Pilger, Cecil Rajendra, Sonia Sanchez, Lawrence Scott, Mongane Wally Serote, Janice Shinebourne, Lemn Sissay, Mikey Smith, Pearl Springer, Wangui wa Goro, and Randy Weston.White, Harris & Beezmohun (eds), A Meeting of the Continents: The International Book Fair of Radical Black and Third World Books – Revisited, 2005."]}, {"page": "List of black British writers", "response": ["* E. A. Markham (1939–2008)"]}, {"page": "Edward Archibald Markham", "response": ["#REDIRECT E. A. Markham"]}, {"page": "News for Babylon", "response": ["News for Babylon: the Chatto book of Westindian-British poetry was a 1984 anthology of West Indian and black British poetry, edited by James Berry and published by Chatto & Windus. The anthology included work by Wilson Harris, Faustin Charles, Rudolph Kizerman, Valerie Bloom, John Agard, Fred D'Aguiar, Samuel Selvon, E. A. Markham, Grace Nichols, Linton Kwesi Johnson, Archie Pool and Benjamin Zephaniah. A Poetry Review reviewer commented on the way that the language seemed \"to slip unselfconsciously from Creole to standard English between or within poems, creating a dialogue or polyphony of discourses in which the unequal encounter of two cultures is directly enacted.\"'News for Babylon', Poetry Review, Vol. 74, No 2. Reprinted online here. "]}]}}