{"wiki_id": "http://www.wikidata.org/entity/Q5326032", "itemLabel": "Earl Okin", "itemDescription": "British musician and comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Earl_Okin", "wikipedia_page": {"main": "Earl Okin (born 31 January 1947) is an English singer-songwriter, musician and comedian.", "link_mentions": [{"page": "List of comedians", "response": ["* Earl Okin (born 1947)"]}, {"page": "List of British comedians", "response": ["*Earl Okin (born 1947)"]}, {"page": "Spicks and Specks (TV series)", "response": ["| Beccy Cole & Earl Okin", "| Lenka & Earl Okin"]}, {"page": "Mouth trumpet", "response": ["*Earl Okin"]}, {"page": "Hollywood's Comedy Nights", "response": ["|Earl Okin"]}, {"page": "Fairport's Cropredy Convention appearances", "response": ["* Earl Okin", "*Earl Okin", "*Earl Okin"]}, {"page": "Kyra Vayne", "response": ["In 1961 she went to New York with the Players' Theatre under the name of the Strollers. Eventually her first CD was issued, with arias from '’Prince Igor'’, '’The Queen of Spades'’ and '’Tosca'’ (Earl Okin \"rediscovered\" this soprano and Preiser released two CD sets made from her old, private records and broadcast tapes)."]}, {"page": "TwickFolk", "response": ["Guests who have appeared at TwickFolk include Nels Andrews, Les Barker, Sally Barker, Ben Bedford, Alyssa Bonagura, Maggie Boyle and Paul Downes, Chuck Brodsky, The Carrivick Sisters, Olivia Chaney, Cathryn Craig and Brian Willoughby, Racker Donnelly, Charlie Dore and Julian Littman, Kris Drever, Gareth Dunlop, Ana Egge, Carrie Elkin, Dave Ellis and Boo Howard, Mark Erelli, Stephen Fearing, David Francey, Vin Garbutt, Dick Gaughan, Grand Union, Melissa Greener, Tim Grimm, Jeni Hankins, Harp and a Monkey, Jack Harris, Hatful of Rain, Fabian Holland, Rebecca Hollweg, Jacquelyn Hynes, Luke Jackson, Robb Johnson, Diana Jones, Kara, Martin Karran and Sara O'Keeffe, Will Kaufman, Sam Kelly Trio, Billy Kemp, Lau, Sarah McQuaid, Kelley McRae, Madison Violet, Emily Maguire, Flossie Malavialle, Iain Matthews, Megson, Jim Moray, Jess Morgan, Elliott Morris, Pete Morton, Linde Nijland, Maz O'Connor, O'Hooley & Tidow, Earl Okin, Ellis Paul, Rod Picott, Rebecca Pronsky, Kim Richey, Justin Rutledge, Liz Simcock, Stephen Simmons, Soiree, Southern Tenant Folk Union, Sunjay, Suntrap, Vicki Swan & Jonny Dyer, Miranda Sykes and Rex Preston, Kath Tait, Greg Trooper, Dan Walsh, Kevin Welch, Dan Wilde, Winter Wilson and Chris Wood.", "File:2014 02 16 Earl Okin TwickFolk.jpg|Earl Okin at TwickFolk, February 2014"]}, {"page": "Not in Our Name CD", "response": ["*Earl Okin – singer, songwriter, musician, arranger, comedian", "# \"Tony Blair – Tory Lite\" – Earl Okin (Earl Okin & Independent Music Group)"]}, {"page": "Songs from a Basement", "response": ["#REDIRECT Earl Okin "]}, {"page": "Songs From A Basement", "response": ["#REDIRECT Earl Okin"]}]}}