{"wiki_id": "http://www.wikidata.org/entity/Q5336515", "itemLabel": "Eddie Straiton", "itemDescription": "British veterinarian", "wikipedia_url": "https://en.wikipedia.org/wiki/Eddie_Straiton", "wikipedia_page": {"main": "Edward Cornock Straiton OBE (27 March 1917 – 30 October 2004), known as \"the TV vet\", was a Scottish veterinarian, author, and television host. He was the studio-based technical advisor for the BBC television series All Creatures Great and Small.Born at Clydebank, Dunbartonshire, Straiton studied at Glasgow veterinary school. He started his veterinarian practice in the 1940s and practised in Penkridge, Staffordshire. He began his TV career serving as a host on the television show Farming Today in 1957, giving advice on animal health. His broadcasting reached its peak audience when, in 1977, he took up a regular slot on BBC Radio's Jimmy Young Show. He also wrote a series of popular veterinary books (by \"the TV Vet\") on farm animals and domestic pets. The books sold almost a million copies worldwide.He was appointed an Officer of the Order of the British Empire (OBE) in the 1998 New Year Honours, for services to the veterinary profession and to agriculture.", "link_mentions": [{"page": "All Creatures Great and Small (1978 TV series)", "response": ["Watkinson died in May 2013 after suffering a stroke. He was 84.\"JACK WATKINSON MRCVS\"  - Hollin Rigg Vets website Watkinson was the on-location technical advisor; his studio-based counterpart was Eddie Straiton. \"He was an incredible character, an absolutely astonishing man,\" remembered Robert Hardy. Along with Donald and Brian Sinclair, Alf Wight dedicated his 1972 book All Creatures Great and Small to Straiton."]}, {"page": "University of Glasgow School of Veterinary Medicine", "response": ["* Eddie Straiton, veterinary surgeon, author and television presenter known as \"the TV Vet\""]}, {"page": "Deaths in October 2004", "response": ["*Eddie Straiton, 87, British veterinarian.Eddie Straiton"]}]}}