{"wiki_id": "http://www.wikidata.org/entity/Q5337520", "itemLabel": "Edgar Wilson", "itemDescription": "British association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Edgar_Wilson_(footballer)", "wikipedia_page": {"main": "Edgar Wilson was an English footballer who played as a forward. He was a regular member of the Newton Heath LYR team (who would later become Manchester United) in the 1889–90 season, during which he scored six goals in 19 appearances in the Football Alliance, including Newton Heath's 9–1 win at home to Small Heath on 7 April 1890. He also played in Newton Heath's 6–1 defeat away to Preston North End in the first round of the FA Cup on 18 January 1890, and was part of the side that won a third consecutive Manchester and District Challenge Cup.", "link_mentions": [{"page": "1889–90 Newton Heath LYR F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Edgar Wilson"]}, {"page": "T. Craig", "response": ["He made his Football Alliance debut the following week in a 2–0 away defeat to Sunderland Albion, then made another appearance in a 7–0 defeat away to Grimsby Town on 8 February. On 15 March, he filled in at right half for the absent Roger Doughty, before an extended run on the left side of the forward line that lasted until the end of the season, filling in first for George Owen for seven games at inside left, then for Edgar Wilson for one game at outside left. During that run of eight games, he scored three goals, the first in a 9–1 home win over Small Heath on 7 April, then in a 2–1 home win over Birmingham St George's on 19 April and a 2–1 home defeat to Sheffield Wednesday on 26 April. He would have had a further two goals from a home match against Grimsby Town on 4 January, but the match was ordered to be replayed due to the poor state of the pitch. On 3 May, he played at inside right in the final of the Manchester Cup against Royton at Brooke's Bar, and scored a hat-trick as Newton Heath won 5–2, their fourth Manchester Cup title."]}, {"page": "Edgar Wilson (disambiguation)", "response": ["Edgar Wilson was a member of the US House of Representatives for Ohio between 1899–1903.", "Edgar Wilson may also refer to:", "* Edgar Wilson (footballer), English footballer", "* Edgar Wilson (died 1976), American businessman, namesake of the Edgar Wilson Award"]}]}}