{"wiki_id": "http://www.wikidata.org/entity/Q5336391", "itemLabel": "Eddie Paynter", "itemDescription": "English cricketer (1901-1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eddie_Paynter", "wikipedia_page": {"main": "Edward Paynter (5 November 1901 – 5 February 1979) was an English cricketer: an attacking batsman and excellent fielder. His Test batting average of 59.23 is the seventh highest of all time, and second only to Herbert Sutcliffe amongst Englishmen; against Australia alone Paynter averaged an extraordinary 84.42.\nBorn in Oswaldtwistle, Lancashire, Paynter did not make his first-class debut for Lancashire County Cricket Club until the relatively advanced age of 24 in July 1926. He made a slow start to his career, however, not establishing himself as a first-team player until 1930 and only scoring his first century in July of the following year, making exactly 100 against Warwickshire in his 48th first-class match. He scored 102 against the touring New Zealanders in the very next game, and in August made his Test debut against the same opposition. However, the match was ruined by rain, with no play possible on the first two of the game's scheduled three days, and Paynter made just three in his only innings.\nPerhaps the most famous of his Test appearances came against Australia, on the \"Bodyline tour\" of 1932/33. At Brisbane Paynter was taken to hospital suffering from tonsillitis, yet with England in difficulty at 216/6 in reply to Australia's 340, came out to bat. After spending the night in hospital, he made his way to 83 and helped his team to an unlikely first-innings lead, and though he only fielded for a couple of hours, returned for the second innings and had the honour of hitting the winning runs – with a six off McCabe. Paynter averaged a fine 61.33 over his five innings on this tour.\nPaynter was then out of the England side for a time, but in 1937 his county form – 2,904 runs and a five-hour triple century against Sussex brought him a recall against New Zealand, as well as Wisden Cricketer of the Year recognition in the next year's Almanack. In 1938 Paynter had another outstanding series against Australia, averaging 101.75 and hitting 216 not out at Nottingham, at the time an England record for Ashes Tests in England. He also filled in very competently as wicket-keeper when Les Ames was injured at Lord's. Paynter was again very successful the following winter against South Africa, scoring three centuries and two fifties in eight innings, including 243 at Durban, to average 81.62.\nThe Second World War brought an effective end to Paynter's career, though he did play a few special and festival games after the war. His final first-class innings was 75 not out for a Commonwealth XI against the Bombay Governor's XI in 1950/51; he then stood for one season (1951) as a first-class umpire. He spent the rest of his working life stacking wool in a Yorkshire mill. He died at the age of 77 in Keighley, Yorkshire.", "link_mentions": [{"page": "Bodyline", "response": ["Voce missed the fourth Test of the series, being replaced by a leg spinner, Tommy Mitchell. Larwood continued to use bodyline, but he was the only bowler in the team using the tactic; even so, he used it less frequently than usual and seemed less effective in high temperatures and humidity.Frith, pp. 274, 277, 293. England won the game by eight wickets, thanks in part to an innings of 83 by Eddie Paynter who had been admitted to hospital with tonsillitis but left in order to bat when England were struggling in their innings.Frith, pp. 288–91. Voce returned for the final Test, but neither he nor Allen were fully fit,Frith, p. 309 and despite the use of bodyline tactics, Australia scored 435 at a rapid pace, aided by several dropped catches.Frith, p. 314. Australia included a fast bowler for this final game, Harry Alexander who bowled some short deliveries but was not allowed to use many fielders on the leg side by his captain, Woodfull.Frith, pp. 315–18. England built a lead of 19 but their tactics in Australia's second innings were disrupted when Larwood left the field with an injured foot; Hedley Verity, a spinner, claimed five wickets to bowl Australia out;Frith, pp. 324–25. England won by eight wickets and won the series by four Tests to one.Frith, pp. 328, 330."]}, {"page": "November 5", "response": ["*  1901   – Eddie Paynter, English cricketer (d. 1979)"]}, {"page": "Bill O'Reilly (cricketer)", "response": ["O'Reilly took 3/164 on a batting paradise in the First Test at Trent Bridge as England scored 8/658 and forced Australia to follow on and hold on for a draw.Harte, p. 377. In the Second Test at Lord's O'Reilly took 4/93 in the first innings and trapped Eddie Paynter for 99 to end a 222-run partnership with Hammond. In reply to England's 494, Australia were in danger of being forced to follow on; O'Reilly came in and made 42, featuring in a partnership of 85 in only 46 minutes with Bill Brown that enabled Australia to save the match: having been dropped by Paynter, he hit Hedley Verity for consecutive sixes to take Australia past the follow-on mark.Wisden, pp. 224–226.  Brown recalled \"It was a nice day, and a nice wicket. O'Reilly came in, and I told him I'd take the quicks—Wellard and Farnes—and Tiger [O'Reilly] took Verity.\" Australia reached 422 and O'Reilly took 2/53 in the second innings as the match petered into a draw."]}, {"page": "Wisden Cricketers of the Year", "response": ["|  Eddie Paynter"]}, {"page": "1937 in sports", "response": ["* Wisden Cricketers of the Year – Tom Goddard, Joe Hardstaff, Jr., Leonard Hutton, Jim Parks, Sr., Eddie Paynter"]}, {"page": "Douglas Jardine", "response": ["Following Jardine's appointment, a meeting was arranged with Nottinghamshire captain Arthur Carr and his two fast bowlers Larwood and Voce at London's Piccadilly Hotel. Jardine explained his belief that Bradman was weak against bowling directed at leg stump and that if this line of attack could be maintained, it would restrict Bradman's scoring to one side of the field, giving the bowlers greater control of his scoring. Jardine asked Larwood and Voce if they could bowl accurately on leg stump and make the ball rise up into the body of the batsman. The bowlers agreed that they could, and that it might prove effective, but Jardine stressed that bowling accurately was vitally important, or Bradman would dominate the bowling. Larwood believed that Jardine saw Bradman as his main target and wished to attack him psychologically as well as in a cricketing sense. At the same time, other Australian batsmen were also discussed.Hamilton, pp. 130–31.Frith, pp. 43–44. Larwood and Voce practised the plan over the remainder of the 1932 season with mixed success.Frith, pp. 45–48.Douglas, pp. 113–17. Jardine also visited Frank Foster who had toured Australia in 1911–12 to discuss field placings appropriate to Australian conditions. Foster had bowled leg theory on that tour with his fielders placed close in on the leg-side, as had George Hirst in 1903–04.Frith, pp. 18–19. During the second half of the season, the team to tour Australia was announced. The selection of four fast bowlers and a few medium pacers was very unusual at the time, and it was commented on by the hosts' media, including Bradman.Frith, pp. 54–55. The selection of Eddie Paynter, who did not have a strong record, to replace the ill Kumar Shri Duleepsinhji was very likely a choice of Jardine. He had a history of good performances against Yorkshire, and Jardine considered that a player's record against northern counties was a good indication of his potential at international level.Douglas, pp. 105, 120–21.", "Once the fourth Test got underway, England won the match to take the series. Partly prompted by Jardine, Eddie Paynter scored 83 having released himself from hospital.Douglas, p. 147. Jardine went on to make a painstaking 24, at one point facing 82 balls without scoring a single run. He was not proud of his batting performance, being shamefaced to Australian Test opener Jack Fingleton,Douglas, p. 149. and describing his batting to Bill O'Reilly as being \"like an old maid defending her virginity.\"Frith, p. 296. England also won the final Test ending on 28 February, with a final clash taking place between Jardine and Larwood. After a long bowling spell, Larwood was furious when Jardine sent him in to bat as nightwatchman but went on to score 98 runs. Later, Larwood broke his foot while bowling in the second innings, but Jardine was not convinced that he was seriously injured. He made him stay on the field until Bradman was out. Larwood, partly through this injury and partly through political repercussions from this series, never played another Test.Douglas, pp. 152–53. Also in this match, Jardine enraged Harry Alexander by asking him not to run on the pitch as he was damaging it and giving his side an advantage. He proceeded to bowl hostile bouncers at Jardine, who was struck painfully to the delight of the crowd.Douglas, pp. 150–51."]}, {"page": "Lancashire County Cricket Club", "response": ["Under the captaincy of Peter Eckersley, Lancashire finished second in the championship in 1929 and reclaimed the title in 1930, with ten victories and no defeats that season. After four titles in five seasons, the early 1930s saw a number of retirements including McDonald and Dick Tyldesley in 1931 and Ernest Tyldesley in 1935: no Lancashire batsman has matched Tyldesley's 100 centuries in first-class cricket. Lancashire won the championship outright for the last time in 1934, the same year that Len Hopwood performed the double of 1,000 runs and 100 wickets (a feat he repeated in 1935) and Cyril Washbrook began to work his way into the team. The captain, Peter Eckersley, retired in 1935 to become an MP. The later half of the 1930s was a period of rebuilding up until the war, with the opening partnership of Cyril Washbrook and Eddie Paynter the highlight. Paynter scored 322 in five hours for Lancashire against Sussex in 1937 having come down on the sleeper train from the victorious Old Trafford Test against New Zealand. He put on 268 in 155 minutes with Cyril Washbrook and celebrated his innings that evening at Brighton's Ice Palace. Retrieved on 21 October 2007.", "|align=left|1. Archie MacLaren2. Neil Fairbrother3. Eddie Paynter", "|align=left|1. Johnny Tyldesley2. Eddie Paynter3. Charlie Hallows"]}, {"page": "Oswaldtwistle", "response": ["* Eddie Paynter, England international test cricketer, born in Oswaldtwistle"]}, {"page": "Hedley Verity", "response": ["Yorkshire made a poor start to the 1932 season. The team lost heavily to Lancashire, for whom Eddie Paynter scored 152 runs and hit Verity for five sixes.Hodgson, p. 132. Although Verity had figures of eight for 107, he was expected to be more successful as the pitch conditions were perfect for spin bowling. Neville Cardus wrote that his figures were \"bad for the pitch. He can spin the ball keenly enough, but lacks a plan in his control of length. Moreover, he seldom gets the batsman guessing while the ball is in the air.\"Cardus (1982), p. 335. However, Yorkshire improved their form in the rest of the season to retain the County title.Hodgson, pp. 132, 135. Between them, Verity and Bowes took 352 wickets in the season, and Verity took 162 wickets at an average of 13.88 to finish second in the national bowling averages. Verity's best performance of the season came at Headingley on 12 July, the third and final day of Yorkshire's match against Nottinghamshire. After heavy rain on the second day, Brian Sellers, the Yorkshire captain, closed his team's innings while they still trailed by 71 runs. When Nottinghamshire began their second innings, Verity did not concede any runs from his first nine overs. Subsequently, the pitch became difficult to bat on as it dried in the sun and Verity took all 10 wickets while 10 runs were hit from his bowling. Making the ball spin sharply, he took seven wickets in 15 deliveries, including a hat-trick.Hill, pp. 53–55. His bowling figures of 10 for 10 beat the previous record for fewest runs conceded while taking all 10 wickets, and remain the best bowling analysis in first-class cricket. He is the only Yorkshire bowler to take all 10 wickets in an innings on two separate occasions. Yorkshire won the match by 10 wickets. Despite Verity's success, he was not selected for any Gentlemen v Players matches, nor in the Test match against India. His only representative cricket came in a Test trial at the end of July, in which he did not bowl as the match was washed out by rain."]}, {"page": "The Gabba", "response": ["|Eddie Paynter (83) & Hedley Verity (23*)"]}, {"page": "Herbert Sutcliffe", "response": ["Like most top-class players, Sutcliffe occasionally played in charity matches during the war, including three to raise money for the Red Cross in 1940. In one of these, he played for a Yorkshire XI against a Bradford League XI at Park Avenue and scored 127, which was his last-ever century. The League team included Eddie Paynter, Manny Martindale and Learie Constantine, who scored a brilliant century in what Sutcliffe described as \"a gem of an innings\".Hill, p.182."]}, {"page": "Hugh Bartlett", "response": ["With 1548 runs at 57.33, Bartlett finished fifth in the averages (behind Wally Hammond, Joe Hardstaff, Jr., Len Hutton and Eddie Paynter). Wisden elected him as a Cricketer of the Year in the 1939 edition. He hit 40 sixes in 1938, second only to Arthur Wellard. Immediately after his innings against Australia, when Arthur Fagg dropped out, Bartlett was added to the English team to tour South Africa that winter. He toured and scored 358 runs at an average of 51.14 in the first-class matches but did not play in any of the Tests. A year later, he was selected for the planned Indian tour under the captaincy of Jack Holmes, but the Second World War led to its cancellation."]}, {"page": "List of Test cricket triple centuries", "response": ["# Batting second, in a three-day match, Hammond shared a stand of 149 with Eddie Paynter (36) for the third wicket, on the way to an England total of 548 for 7 declared.  New Zealand had batted first, scoring 158.  Hammond reached 300 in 287 minutes, going between 200 and 300 in 48 minutes. It has been estimated that he received about 355 balls to get there. Hammond hit 10 sixes in his innings, three off them off consecutive balls from Jack Newman.  The third day was affected by rain, and the match was drawn. Hammond made 227 in his previous innings against New Zealand and finished the two-match series with a batting average of 563."]}, {"page": "Geoff Pullar", "response": ["He was, in any case, a skilled batsman, rarely lifting the ball off the surface while driving elegantly and adept at accumulating by flicking the ball off his toes towards fine leg. Preferring to play off the front foot, Pullar was also a good puller of the ball and could crack a square cut. In his younger days he had been compared to Charlie Hallows and Eddie Paynter, two of Lancashire's crowd pleasing greats – he had the artistry of the former and the pugnacious aggression and watchful determination of the latter."]}]}}