{"wiki_id": "http://www.wikidata.org/entity/Q5339257", "itemLabel": "Edmund Ayrton", "itemDescription": "English organist", "wikipedia_url": "https://en.wikipedia.org/wiki/Edmund_Ayrton", "wikipedia_page": {"main": "Dr. Edmund Ayrton (1734 – 22 May 1808) was an English organist who was Master of the Children of the Chapel Royal.", "link_mentions": [{"page": "1808 in music", "response": ["*May 22 – Edmund Ayrton, English organist (born 1734)"]}, {"page": "Ayrton", "response": ["* Edmund Ayrton (1734–1808), English organist"]}, {"page": "William Hawes", "response": ["Hawes was born in London, and was for eight years (1793–1801) a chorister of the Chapel Royal, where he studied music, mainly under Edmund Ayrton. He subsequently held various musical posts, being master of the choristers at St Paul's Cathedral in London from 1812 to 1846."]}, {"page": "Thomas Attwood (composer)", "response": ["The son of a musician in the royal band, Attwood was born in London, probably in Pimlico. At the age of nine he became a chorister in the Chapel Royal, where he received training in music from James Nares and Edmund Ayrton. In 1783 he was sent to study abroad at the expense of the Prince of Wales (afterwards King George IV), who had been favourably impressed by his skill at the harpsichord. After two years in Naples, Attwood proceeded to Vienna, where he became a favourite pupil of Mozart. On his return to London in 1787 he held for a short time an appointment as one of the chamber musicians to the Prince of Wales."]}, {"page": "Southwell Minster", "response": ["* Edmund Ayrton 1755–1764"]}, {"page": "Edward R. Ayrton", "response": ["The Ayrton family originated in Yorkshire. Edward's similarly-named forebear, Edward Ayrton (1698-1774), was mayor of Ripon in 1760, laying the foundations for the family's subsequent prominence. The mayor's son was the leading organist and choirmaster, Dr. Edmund Ayrton (1734-1808) and his son in turn - the mayor's grandson and the great-grandfather of the archeologist - was the theatre-reviewer William Ayrton (1777-1858)."]}, {"page": "Burials and memorials in Westminster Abbey", "response": ["* Dr. Edmund Ayrton (d. 1808)"]}, {"page": "William Ayrton (music critic)", "response": ["Ayrton was the younger son of Dr. Edmund Ayrton, and was born in London. The Ayrton family originated in Yorkshire and William's grandfather Edward Ayrton was mayor of Ripon in 1760, laying the foundations for the family's subsequent prominence."]}, {"page": "Charles Smart Evans", "response": ["Evans was a chorister under Dr. Edmund Ayrton, and in 1808 a gentleman of the Chapel Royal. His name appears among the alto singers in the chorus of the \"Ancient Concerts\" of 1798, and he took part with John Braham and others in the music performed at Weber's funeral in 1826."]}, {"page": "List of musicians at English cathedrals", "response": ["* 1755–64 Edmund Ayrton"]}, {"page": "List of music students by teacher: A to B", "response": ["===Edmund Ayrton==="]}, {"page": "Master of the Children of the Chapel Royal", "response": ["* 1780 Edmund Ayrton"]}, {"page": "Gentleman of the Chapel Royal", "response": ["* Edmund Ayrton"]}, {"page": "Charles Smith (singer)", "response": ["Born in London, he was a grandson of Edward Smith who was page to the Princess Amelia, and son of Felton Smith, a chorister at Christ Church, Oxford. At the early age of five, he became a pupil of Thomas Costellow for singing. Then, in 1796, on the advice of Samuel Arnold, he became a chorister at the Chapel Royal under Edmund Ayrton, where he sang the principal solo in the anthem on the marriage of Charlotte Augusta Matilda, the princess royal, to the Prince of Würtemberg on 18 May 1797."]}, {"page": "William Carnaby (composer)", "response": ["Carnaby was born in London in 1772, and was educated in the Chapel Royal as a chorister under James Nares and Edmund Ayrton. He was subsequently organist at Eye, Suffolk and at Huntingdon. In 1805 he took the degree of Mus. Doc. at Cambridge, where he entered at Trinity Hall. In July 1808 he proceeded Mus. Doc., on which occasion his exercise, described as \"a grand musical piece,\" was performed at Great St Mary's on Sunday 7 July."]}]}}