{"wiki_id": "http://www.wikidata.org/entity/Q5337491", "itemLabel": "Edgar Thurston", "itemDescription": "British indologist (1855-1935)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edgar_Thurston", "wikipedia_page": {"main": "Edgar Thurston CIE (1855– 12 October 1935) was a superintendent at the Madras Government Museum who contributed to studies in the zoology, ethnology and botany of India and published works related to his work at the museum. Thurston was educated in medicine and lectured in anatomy at the Madras Medical College while also holding his position at the museum. His early works were on numismatics and geology and these were followed by researches in anthropology and ethnography. He succeeded Frederick S. Mullaly as the superintendent of ethnography for the Madras Presidency.", "link_mentions": [{"page": "Miscegenation", "response": ["In the 19th century, when the British Straits Settlement shipped Chinese convicts to be jailed in India, the Chinese men then settled in the Nilgiri mountains near Naduvattam after their release and married Tamil Paraiyan women, having mixed Chinese-Tamil children with them. They were documented by Edgar Thurston. Paraiyan is also anglicized as \"pariah\"."]}, {"page": "Kamma (caste)", "response": ["The tradition holds that the Kammas, along with Velamas and Reddis, evolved out of the community of Kapus (cultivators) in the post-Kakatiya period. A popular legend collected by Edgar Thurston narrates that Kammas originated from the youngest son of a certain Belthi Reddi, who managed to recover his mother's ear-ornament (called \"kamma\" in Telugu) that had been appropriated by Emperor Prataparudra's minister. The other sons of Belthi Reddi are similarly said to have given rise to the other prominent caste communities of the Telugu people."]}, {"page": "Nagarathar", "response": ["The Nagarathar or Nattukkottai Chettiar were originally salt traders and historically an itinerant community of merchants and claim Chettinad as their traditional home. How they reached that place, which at the time comprised adjacent parts of the ancient states of Pudukkottai, Ramnad and Sivagangai, is uncertain, with various communal legends being recorded. There are various claims regarding how they arrived in that area. Among those are a fairly recently recorded claim that they were driven there because of persecution by a Chola king and an older one, recounted to Edgar Thurston, that they were encouraged to go there by a Pandyan king who wanted to take advantage of their trading skills. The legends converge in saying that they obtained the use of nine temples, with each representing one exogamous part of the community."]}, {"page": "Connemara Public Library", "response": ["|01||Edgar Thurston||146x146px|alt|| 1896 ||1908 ||"]}, {"page": "Raja Ravi Varma", "response": ["The British administrator Edgar Thurston was significant in promoting the careers of Varma and his brother. Varma received widespread acclaim after he won an award for an exhibition of his paintings at Vienna in 1873. Varma's paintings were also sent to the World's Columbian Exposition held in Chicago in 1893 and he was awarded three gold medals.Kilimanoor Chandran, Ravi Varmayum Chitrakalayum(in Malayalam), Department of Culture, Kerala, 1998. He travelled throughout India in search of subjects. He often modelled Hindu Goddesses on Indian women, whom he considered beautiful. Ravi Varma is particularly noted for his paintings depicting episodes from the story of Dushyanta and Shakuntala, and Nala and Damayanti, from the Mahabharata. Ravi Varma's representation of mythological characters has become a part of the Indian imagination of the epics. He is often criticized for being too showy and sentimental in his style but his work remains very popular in India. Many of his fabulous paintings are housed at Laxmi Vilas Palace, Vadodara."]}, {"page": "Kumari Kandam", "response": ["Most European and American geologists dated Lemuria's disappearance to a period before the emergence of modern humans. Thus, according to them, Lemuria could not have hosted an ancient civilization. However, in 1885, the Indian Civil Service officer Charles D. Maclean published The Manual of the Administration of the Madras Presidency, in which he theorized Lemuria as the proto-Dravidian urheimat. In a footnote in this work, he mentioned Ernst Haeckel's Asia hypothesis, which theorized that the humans originated in a land now submerged in the Indian Ocean. Maclean added that this submerged land was the homeland of the proto-Dravidians. He also suggested that the progenitors of the other races must have migrated from Lemuria to other places via South India. This theory was also cursorily discussed by other colonial officials like Edgar Thurston and Herbert Hope Risley, including in the census reports of 1891 and 1901. Later, Maclean's manual came to be cited as an authoritative work by the Tamil writers, who often wrongly referred to him as a \"scientist\" and a \"Doctor\"."]}, {"page": "Kurmi", "response": ["The second half of the nineteenth century also largely overlapped with the coming of age of ethnology—interpreted then as the science of race—in the study of societies the world over. Although later to be discredited, the methods of this discipline were eagerly absorbed and adopted in British India, as were those of the emerging science of anthropology. Driven in part by the intellectual ferment of the discipline and in part by the political compulsions in both Britain and India, two dominant views of caste emerged among the administrator-scholars of the day.  According to Susan Bayly:  Those like (Sir William) Hunter, as well as the key figures of H. H. Risley (1851–1911) and his protégé Edgar Thurston, who were disciples of the French race theorist Topinard and his European followers, subsumed discussions of caste into theories of biologically determined race essences, ... Their great rivals were the material or occupational theorists led by the ethnographer and folklorist William Crooke (1848–1923), author of one of the most widely read provincial Castes and Tribes surveys, and such other influential scholar-officials as Denzil Ibbetson and E. A. H. Blunt."]}, {"page": "Government Museum, Chennai", "response": ["| 4 || Edgar Thurston || Superintendent || 1885–1908"]}, {"page": "Humcha", "response": ["Edgar Thurston mentions that the Bhairarasas or Santaras were among the powerful BuntThurston, Edgar; K. Rangachari (1909). Castes and Tribes of Southern India Volume 1.Pg. 152 Madras: Government Press chiefs who seem to have exercised control over a greater part of the Tuluva country before the rise of the Vijayanagara Empire. The Santaras were Jains and had matrimonial relations with the Saivite Alupa royal family of the canara region. The Santaras built a number of Jain monuments and were responsible for the spread of Jainism in the Tulu Nadu and Malenadu region of Karnataka. During this period the Santara ruler Veera Pandya Bhairarasa erected the monolith of Bahubali in Karkala."]}, {"page": "Gerrhopilus thurstoni", "response": ["The specific name, thurstoni, is in honor of British zoologist Edgar Thurston.Beolens, Bo; Watkins, Michael; Grayson, Michael (2011). The Eponym Dictionary of Reptiles. Baltimore: Johns Hopkins University Press. xiii + 296 pp. . (Typhlops thurstoni, p. 265)."]}, {"page": "Kaisar-i-Hind Medal", "response": ["* Edgar Thurston, for distinguished service in the advancement of the interests of the British Raj"]}, {"page": "Interracial marriage", "response": ["In the 19th century, when the British Straits Settlement shipped Chinese convicts to be jailed in India, the Chinese men then settled in the Nilgiri mountains near Naduvattam after their release and married Tamil Paraiyan women, having mixed Chinese-Tamil children with them. They were documented by Edgar Thurston. Paraiyan is also anglicized as \"pariah\".", "Edgar Thurston described the colony of the Chinese men with their Tamil pariah wives and children: \"Halting in the course of a recent anthropological expedition on the western side of the Nilgiri plateau, in the midst of the Government Cinchona plantations, I came across a small settlement of Chinese, who have squatted for some years on the slopes of the hills between Naduvatam and Gudalur, and developed, as the result of ' marriage ' with Tamil pariah women, into a colony, earning an honest livelihood by growing vegetables, cultivating coffee on a small scale, and adding to their income from these sources by the economic products of the cow. An ambassador was sent to this miniature Chinese Court with a suggestion that the men should, in return for monies, present themselves before me with a view to their measurements being recorded. The reply which came back was in its way racially characteristic as between Hindus and Chinese. In the case of the former, permission to make use of their bodies for the purposes of research depends essentially on a pecuniary transaction, on a scale varying from two to eight annas. The Chinese, on the other hand, though poor, sent a courteous message to the effect that they did not require payment in money, but would be perfectly happy if I would give them, as a memento, copies of their photographs.\" Thurston further describe a specific family: \"The father was a typical Chinaman, whose only grievance was that, in the process of conversion to Christianity, he had been obliged to 'cut him tail off.' The mother was a typical Tamil Pariah of dusky hue. The colour of the children was more closely allied to the yellowish tint of the father than to the dark tint of the mother; and the semimongol parentage was betrayed in the slant eyes, flat nose, and (in one case) conspicuously prominent cheek-bones.\" Thurston's description of the Chinese-Tamil families were cited by others, one mentioned \"an instance mating between a Chinese male with a Tamil Pariah female\". A 1959 book described attempts made to find out what happened to the colony of mixed Chinese and Tamils."]}, {"page": "Paraiyar", "response": ["The Church Mission Society converted many Paraiyars to Christianity by the early 19th century. During the British Raj, the missionary schools and colleges admitted Paraiyar students amid opposition from the upper-caste students. In 1893, the colonial government sanctioned an additional stipend for the Paraiyar students. The colonial officials, scholars, and missionaries attempted to rewrite the history of the Paraiyars, characterising them as a community that enjoyed a high status in the past. Edgar Thurston (1855–1935), for example, claimed that their status was nearly equal to that of the Brahmins in the past. H. A. Stuart, in his Census Report of 1891, claimed that Valluvars were a priestly class among the Paraiyars, and served as priests during Pallava reign. Robert Caldwell, J. H. A. Tremenheere and Edward Jewitt Robinson claimed that the ancient poet-philosopher Thiruvalluvar was a Paraiyar."]}, {"page": "Billava", "response": ["L. K. Ananthakrishna Iyer recounted the community's belief that billava means bowmen and that it \"applied to the castemen who were largely employed as soldiers by the native rulers of the district\". Edgar Thurston had reached a similar conclusion in 1909."]}, {"page": "Naduvattam, Tamil Nadu", "response": ["In the 19th century, when the British Straits Settlement shipped Chinese convicts to be jailed in India, the Chinese men then settled in the Nilgiri mountains near Naduvattam after their release and married Tamil Paraiyan women, having mixed Chinese-Tamil children with them. They were documented by Edgar Thurston. Alt URL Alt URL http://www.bulletin247.com/english-news/show/unravelling-chinese-link-can-boost-nilgiris-tourism Alt URL Paraiyan is also anglicized as \"pariah\".", "Edgar Thurston described the colony of the Chinese men with their Tamil pariah wives and children: \"Halting in the course of a recent anthropological expedition on the western side of the Nilgiri plateau, in the midst of the Government Cinchona plantations, I came across a small settlement of Chinese, who have squatted for some years on the slopes of the hills between Naduvatam and Gudalur, and developed, as the result of ' marriage ' with Tamil pariah women, into a colony, earning an honest livelihood by growing vegetables, cultivating coffee on a small scale, and adding to their income from these sources by the economic products of the cow. An ambassador was sent to this miniature Chinese Court with a suggestion that the men should, in return for monies, present themselves before me with a view to their measurements being recorded. The reply which came back was in its way racially characteristic as between Hindus and Chinese. In the case of the former, permission to make use of their bodies for the purposes of research depends essentially on a pecuniary transaction, on a scale varying from two to eight annas. The Chinese, on the other hand, though poor, sent a courteous message to the effect that they did not require payment in money, but would be perfectly happy if I would give them, as a memento, copies of their photographs.\" Thurston further described a specific family: \"The father was a typical Chinaman, whose only grievance was that, in the process of conversion to Christianity, he had been obliged to 'cut him tail off.' The mother was a typical Tamil Pariah of dusky hue. The colour of the children was more closely allied to the yellowish tint of the father than to the dark tint of the mother; and the semimongol parentage was betrayed in the slant eyes, flat nose, and (in one case) conspicuously prominent cheek-bones.\" Thurston's description of the Chinese-Tamil families were cited by others, one mentioned \"an instance mating between a Chinese male with a Tamil Pariah female\" A 1959 book described attempts made to find out what happened to the colony of mixed Chinese and Tamils."]}, {"page": "Chinese people in India", "response": ["Some Chinese convicts were deported from the early history of Straits Settlements entirely inhabited by Teochew and some Hakka immigrants were sent to be jailed in Madras in India, the \"Madras district gazetteers, Volume 1\" reported an incident where the Chinese convicts escaped and killed the police sent to apprehend them: \"Much of the building work was done by Chinese convicts sent to the Madras jails from the Straits Settlements (where there was no sufficient prison accommodation) and more than once these people escaped from the temporary buildings' in which they were confined at Lovedale. In 1866 seven of them got away and it was several days before they were apprehended by the Tahsildar, aided by Badagas sent out in all directions to search. On 28 July in the following year twelve others broke out during a very stormy night and parties of armed police were sent out to scour the hills for them. They were at last arrested in Malabar a fortnight later. Some police weapons were found in their possession, and one of the parties of police had disappeared—an ominous coincidence. Search was made all over the country for the party, and at length, on 15 September, their four bodies were found lying in the jungle at Walaghát, half way down the Sispára ghát path, neatly laid out in a row with their severed heads carefully placed on their shoulders. It turned out that the wily Chinamen, on being overtaken, had at first pretended to surrender and had then suddenly attacked the police and killed them with their own weapons.\" Other Chinese convicts in Madras who were released from jail then settled in the Nilgiri mountains near Naduvattam and married Tamil Paraiyan women, having mixed Chinese-Tamil children with them. They were documented by Edgar Thurston. Alt URL Alt URLhttp://www.bulletin247.com/english-news/show/unravelling-chinese-link-can-boost-nilgiris-tourism Alt URL Paraiyan is also anglicized as \"pariah\".", "Edgar Thurston described the colony of the Chinese men with their Tamil pariah wives and children: \"Halting in the course of a recent anthropological expedition on the western side of the Nilgiri plateau, in the midst of the Government Cinchona plantations, I came across a small settlement of Chinese, who have squatted for some years on the slopes of the hills between Naduvatam and Gudalur, and developed, as the result of ' marriage ' with Tamil pariah women, into a colony, earning an honest livelihood by growing vegetables, cultivating coffee on a small scale, and adding to their income from these sources by the economic products of the cow. An ambassador was sent to this miniature Chinese Court with a suggestion that the men should, in return for monies, present themselves before me with a view to their measurements being recorded. The reply which came back was in its way racially characteristic as between Hindus and Chinese. In the case of the former, permission to make use of their bodies for the purposes of research depends essentially on a pecuniary transaction, on a scale varying from two to eight annas. The Chinese, on the other hand, though poor, sent a courteous message to the effect that they did not require payment in money, but would be perfectly happy if I would give them, as a memento, copies of their photographs.\" Thurston further describe a specific family: \"The father was a typical Chinaman, whose only grievance was that, in the process of conversion to Christianity, he had been obliged to 'cut him tail off.' The mother was a typical Tamil Pariah of dusky hue. The colour of the children was more closely allied to the yellowish tint of the father than to the dark tint of the mother; and the semimongol parentage was betrayed in the slant eyes, flat nose, and (in one case) conspicuously prominent cheek-bones.\" Thurston's description of the Chinese-Tamil families were cited by others, one mentioned \"an instance mating between a Chinese male with a Tamil Pariah female\" A 1959 book described attempts made to find out what happened to the colony of mixed Chinese and Tamils."]}, {"page": "C. Raja Raja Varma", "response": ["The British administrator Edgar Thurston was significant in promoting the careers of both Varma brothers."]}, {"page": "Vadama", "response": ["Also, in some parts of  Kerala, as Nambudiri Brahmacharis were not commonly found,Frequently Asked Questions a Brahmachari belonging to the Vadadesa Vadama was required to pour water into the hands of a Nambudiri sanyasi as part of the rituals connected with the latter's breakfast.\"Castes and Tribes of South India\", Edgar Thurston and K. Rangachari, Government Press, 1909"]}, {"page": "Nilgiri Mountains", "response": ["In the 19th century, when the British Straits Settlement shipped Chinese convicts to be jailed in India, the Chinese men settled in the Nilgiri mountains near Naduvattam after their release and married Tamil Paraiyan women, having mixed Chinese-Tamil children with them. They were documented by Edgar Thurston."]}, {"page": "Herbert Hope Risley", "response": ["Another event that occurred in 1901 and which related to Risley was the official approval of an India-wide ethnographic survey, intended to be conducted over a period of eight years and using in part the anthropometrical methodology established for Risley's survey of Bengal. Superintendents were appointed to each Province and Presidency and grants of £5000 per annum were given for the eight-year period. Bates considers that the results of this effort, which included works by Edgar Thurston and Robert Vane Russell, were rarely \"quite so thorough, even by Risley's standards.\""]}, {"page": "Chindians", "response": ["Some Chinese \"convicts\" deported from the Straits Settlements were sent to be jailed in Madras in India. The \"Madras district gazetteers, Volume 1\" reported an incident where the Chinese convicts escaped and killed the police sent to apprehend them: \"Much of the building work was done by Chinese convicts sent to the Madras jails from the Straits Settlements (where there was no sufficient prison accommodation) and more than once these people escaped from the temporary buildings' in which they were confined at Lovedale. In 186^ seven of them got away and it was several days before they were apprehended by the Tahsildar, aided by Badagas sent out in all directions to search. On 28 July in the following year twelve others broke out during a very stormy night and parties of armed police were sent out to scour the hills for them. They were at last arrested in Malabar a fortnight later. Some police weapons were found in their possession and one of the parties of police had disappeared—an ominous coincidence. Search was made all over the country for the party and at length, on 15 September, their four bodies were found lying in the jungle at Walaghát, half way down the Sispára ghát path, neatly laid out in a row with their severed heads carefully placed on their shoulders. It turned out that the wily Chinamen, on being overtaken, had at first pretended to surrender and had then suddenly attacked the police and killed them with their own weapons.\" Other Chinese convicts in Madras who were released from jail then settled in the Nilgiri mountains near Naduvattam and married Tamil Paraiyan women, having mixed Chinese-Tamil children with them. They were documented by Edgar Thurston. Alt URL Alt URL Alt URL Paraiyan is also anglicised as \"pariah\".", "Edgar Thurston described the colony of the Chinese men with their Tamil pariah wives and children: \"Halting in the course of a recent anthropological expedition on the western side of the Nilgiri plateau, in the midst of the Government Cinchona plantations, I came across a small settlement of Chinese, who have squatted for some years on the slopes of the hills between Naduvatam and Gudalur and developed, as the result of ' marriage ' with Tamil pariah women, into a colony, earning an honest livelihood by growing vegetables, cultivating coffee on a small scale and adding to their income from these sources by the economic products of the cow. An ambassador was sent to this miniature Chinese Court with a suggestion that the men should, in return for monies, present themselves before me with a view to their measurements being recorded. The reply which came back was in its way racially characteristic as between Hindus and Chinese. In the case of the former, permission to make use of their bodies for the purposes of research depends essentially on a pecuniary transaction, on a scale varying from two to eight annas. The Chinese, on the other hand, though poor, sent a courteous message to the effect that they did not require payment in money, but would be perfectly happy if I would give them, as a memento, copies of their photographs.\" Thurston further describe a specific family: \"The father was a typical Chinaman, whose only grievance was that, in the process of conversion to Christianity, he had been obliged to 'cut him tail off.' The mother was a typical Tamil Pariah of dusky hue. The colour of the children was more closely allied to the yellowish tint of the father than to the dark tint of the mother and the semimongol parentage was betrayed in the slant eyes, flat nose and (in one case) conspicuously prominent cheek-bones.\" Thurston's description of the Chinese-Tamil families were cited by others, one mentioned \"an instance mating between a Chinese male with a Tamil Pariah female\" A 1959 book described attempts made to find out what happened to the colony of mixed Chinese and Tamils."]}, {"page": "Asian Educational Services", "response": ["This firm has a very active publication programme that aims to preserve knowledge, in the form of old books, from being lost. An extensive list of about 200 travelogues gives a vivid picture of India specifically, and Asia generally. Many of the big names in Asian exploration and in the field of history have been reprinted. W. W. Hunter, H. H. Wilson, Max Muller, Rhys Davids, H. H. Risley, Edgar Thurston, G. Forrest, G. B. Malleson, Nicholas Greenwood, William Muir, Vincent A. Smith, Emerson Tennent, Wilhelm Geiger, Monier-Willams, Sven Hedin, Richard F. Burton, Francis Younghusband, William Moorcroft, M. Auriel Stein, Marco Polo, Heuin Tsang, Al-Beruni, William of Rubruck, and many more share this shelf space. Travelogues of people who, in the Middle Ages, frequented India such as F. Bernier, J. B. Tavernier, John Fryer, N. Mannuchi, Abbe Carre, J. Ovington, Alexander Hamilton, J. Neuihoff, P. Baldeaus, Father Montserrat, Ippolito Desideri, etc., have been given a new lease on life."]}]}}