{"wiki_id": "http://www.wikidata.org/entity/Q5338643", "itemLabel": "Edith Picton-Turbervill", "itemDescription": "British politician (1872-1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edith_Picton-Turbervill", "wikipedia_page": {"main": "Edith Picton-Turbervill OBE (13 June 1872 – 31 August 1960) was an English social reformer, writer and Labour Party politician. From 1929 to 1931, she served as the Member of Parliament for The Wrekin in Shropshire.", "link_mentions": [{"page": "Erskine Childers (author)", "response": ["In 1894, while he was living in Glendalough, he bought a Dublin Bay Water Wag, a 13-foot type of sailing boat usually sailed in Dún Laoghaire, pear-shaped with a single gaff-rigged sail. He sailed this boat on Lough Dan, close to Glendalough, and he and his brother Henry used to take friends for a sail in the Water Wag.Edith Picton-Turbervill's contribution to Myself when Young edited by the Countess of Oxford and Asquith. Bigger and better boats followed: by 1895 he was taking the half-deck Marguerite across the Channel and in 1897 there was a long cruise to the Frisian Islands, Norderney and the Baltic with Henry in the thirty-foot cutter Vixen: a voyage he repeated in the following spring."]}, {"page": "The Wrekin (UK Parliament constituency)", "response": ["| Edith Picton-Turbervill"]}, {"page": "Royal High School, Bath", "response": ["* Edith Picton-Turbervill OBE, Labour MP from 1929 to 1931 for The Wrekin"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|Edith Picton-Turbervill"]}, {"page": "List of National Labour MPs", "response": ["* Edith Picton-Turbervill (The Wrekin) also voted against the Government in a division the following day. She was re-adopted as the Labour candidate for her constituency at the 1931 general election but was defeated for re-election. "]}, {"page": "1960 in Wales", "response": ["*31 August – Edith Picton-Turbervill, social reformer, writer and politician, 88"]}, {"page": "1938 in Wales", "response": ["*Edith Picton-Turbervill – Myself When Young"]}, {"page": "Kathleen Simon, Viscountess Simon", "response": ["Lady Simon was most concerned about less conspicuous forms of servitude, including indentured labour, peonage, and debt bondage. Deeming it incompatible with the principles of trusteeship under the League of Nations, she publicly opposed the policy of utilising forced labour in East Africa. For several decades, she fought for the emancipation of Mui tsai, domestically enslaved girls in China, along with MP's Edith Picton-Turbervill and Eleanor Rathbone."]}, {"page": "James Baldwin-Webb", "response": ["He was elected as MP for The Wrekin at the General Election of October 1931, taking it from a Labour Member, Edith Picton-Turbervill, and held it at the 1935 general election."]}, {"page": "Church League for Women's Suffrage", "response": ["The first woman to preach in a Church of Ireland church, which was done with the approval of the Archbishop of Dublin and the church's governors, was Edith Picton-Turbervill. She was speaking in Ireland under the auspices of the CLWS."]}, {"page": "List of British political memoirs", "response": ["* Life is Good: An Autobiography by Edith Picton-Turbervill (1939)"]}, {"page": "Ralph Durand", "response": ["Soon after his return from his travels, he met Violet Picton Warlow, and they were married in 1904.Stephen Foote, introduction to Guernsey Under German Rule, 2nd edition, Guernsey Society, 2018 Her father, Colonel John Picton Warlow, had inherited Ewenny Priory and changed his name to Picton Turbervill as a condition of his inheritance. Violet was his eldest daughter in a large family which included Edith Picton-Turbervill, one of the first female members of parliament.Edith Picton-Turbervill, Life is Good: An Autobiography, London, 1939"]}]}}