{"wiki_id": "http://www.wikidata.org/entity/Q5338516", "itemLabel": "Edith Coates", "itemDescription": "singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Edith_Coates", "wikipedia_page": {"main": "Edith Coates OBE (31 May 1908 – 7 January 1983) was an English operatic mezzo-soprano. A highly gifted actress with a striking stage presence, Coates initially found success in larger dramatic roles before transitioning into portraying mainly character parts in the 1950s. She began her career with Lilian Baylis's opera company at the Old Vic in 1924. She stayed with the company when it moved to the Sadler's Wells Theatre and remained with them up to 1946. Coates career was put on hold while the London stages were closed during World War II. There is no doubt that the war limited her career as it occurred during her prime singing years; though she was also said not to have been excessively ambitious. In 1947 Coates joined the Royal Opera, London where she remained until her retirement from the stage in 1967.", "link_mentions": [{"page": "1983 in music", "response": ["*January 7 – Edith Coates, operatic mezzo-soprano, 74"]}, {"page": "English National Opera", "response": ["Lawrance Collingwood joined the company as resident conductor alongside Corri.  With the increased number of productions, guest conductors were recruited, including Geoffrey Toye and Anthony Collins. The increasing success of the new ballet company helped to subsidise the high cost of opera productions, enabling a further increase in the size of the orchestra, to 48 players.Gilbert, p. 58 Among the singers in the opera company were Joan Cross and Edith Coates.\"Sadler's Wells\", The Times, 18 April 1931, p. 8 In the 1930s, the company presented standard repertoire operas by Mozart, Verdi, Wagner and Puccini, lighter works by Balfe, Donizetti, Offenbach and Johann Strauss, some novelties, among which were operas by Holst, Ethel Smyth and Charles Villiers Stanford, and an unusual attempt at staging an oratorio, Mendelssohn's Elijah.", "Recordings of individual scenes and numbers were made by Sadler's Wells singers from the company's earliest days. In 1972 an LP set was issued bringing together many of these recordings, prefaced with a tribute to Lilian Baylis recorded in 1936. Among the singers in the set are Joan Cross, Heddle Nash, Edith Coates, Joan Hammond, Owen Brannigan, Peter Pears, Peter Glossop and Charles Craig. The conductors include Lawrance Collingwood,  Reginald Goodall and Michael Mudie.Blyth, Alan. \"Historical Stars of The Old Vic and Sadler's Wells\", The Gramophone, November 1972, p. 126"]}, {"page": "Joan Sutherland", "response": ["* La fille du régiment—Joan Sutherland (Marie), Luciano Pavarotti (Tonio), Monica Sinclair (La Marquise de Berkenfield), Jules Bruyère (Hortensius), Spiro Malas (Sulpice), Eric Garrett (Le Caporal), Edith Coates (La Duchesse de Crakentorp), Orchestra & Chorus of the Royal Opera House, Covent Garden, Richard Bonynge. Recorded: Kingsway Hall, London, 17–28 July 1967. Original LP release: SET 372-3 (two LPs), CD release: 414 520-2 DH2 (two CDs)."]}, {"page": "Peter Grimes", "response": ["Peter Grimes has been produced many times at the Royal Opera House. The first was in 1947, conducted by Karl Rankl and with Peter Pears, Joan Cross and Edith Coates reprising their roles from the Sadler's Wells premiere. The most recent was in 2011 with Andrew Davis conducting, and starring Ben Heppner, Amanda Roocroft and Jonathan Summers.\"Peter Grimes\" Royal Opera House Collections Online. Retrieved 8 March 2017", "|Edith Coates"]}, {"page": "Candide (operetta)", "response": ["The first London production debuted at the Saville Theatre on Shaftesbury Avenue on 30 April 1959 (after playing for a short time at the New Theatre Oxford and the Manchester Opera House). This production used Lillian Hellman's book with an additional credit 'assisted by Michael Stewart', and it was directed by Robert Lewis with choreography by Jack Cole. The cast included Denis Quilley as Candide, Mary Costa as Cunegonde, Laurence Naismith as Dr. Pangloss and Edith Coates as the Old Lady. The Musical Director was Alexander Faris."]}, {"page": "Gloriana", "response": ["|Edith Coates"]}, {"page": "Karl Rankl", "response": ["Having recruited and trained a largely British company of singers, Rankl, with Webster's strong support, persuaded international singers including Elisabeth Schwarzkopf, Ljuba Welitsch, Hans Hotter and Paolo Silveri to appear with the company, singing in English. The company performed a wide repertory of German, Italian, Russian and English opera. It made its debut in January 1947 with Carmen, in a performance greeted by The Times as \"worthy of the stage on which it appeared ... It revealed in Mr. Karl Rankl a musical director who knew how to conduct opera.\"\"The Royal Opera\", The Times, 15 January 1947, p. 6 The company, headed by Edith Coates and including Dennis Noble, Grahame Clifford, David Franklin and Constance Shacklock, was warmly praised. In the next two operas presented by the company, Rankl was thought a little stolid in The Magic Flute, but was praised for \"weaving Strauss's flexible rhythms\" in Der Rosenkavalier.\"Covent Garden Opera\", The Times, 21 March 1947, p. 6, and 23 April 1947, p/ 7 Rankl tackled the Italian repertoire, and new English works, winning praise for his Rigoletto, though with Peter Grimes he was compared to his disadvantage with the original conductor, Reginald Goodall.\"The Royal Opera\", The Times, 1 November 1947, p. 6, and \"Covent Garden Opera\", The Times, 29 November 1947, p. 6 A production of The Masteringers with Hotter as Sachs was judged \"a further stage in the consolidation of the Covent Garden company\".\"Covent Garden\", The Times, 22 January 1948, p. 6 Despite the good notices for his early seasons, Rankl had to cope with a vociferous public campaign by Beecham against the very idea of establishing a company of British artists; Beecham maintained that the British could not sing opera, and had produced only half a dozen first rate operatic artists in the past 60 years.\"Opera Trust Criticized. Sir T. Beecham Calls for Inquiry\", The Times, 6 January 1949, p. 2"]}, {"page": "The Bohemian Girl", "response": ["The opera \"remained in the repertories of British touring companies until the 1930s and was revived in 1932 at Sadler's Wells\".Burton, p. 522 Since World War II, it has been staged in a production by Dennis Arundell at Covent Garden in 1951 with Beecham conducting and a cast consisting of Roberta Peters, Anthony Marlowe, Jess Walters, Edith Coates, Howell Glynne and Murray Dickie,Harold Rosenthal. Covent Garden - The Bohemian Girl (August 15). Opera, October 1951, Vol.2 No.10, p598-600. by the Belfast Operatic Society at the 1978 Waterford International Festival of Light Opera, in Ireland,Actor Emer Gillespie on ulsteractors.com by Castleward Opera, Strangford, in Northern Ireland in 2006 and by Opera South, Haslemere, in England in 2008.Opera South shows on operasouth.co.uk "]}, {"page": "The Midsummer Marriage", "response": ["|Edith Coates", "* Gala GL100.524 (1997): Richard Lewis; Joan Sutherland; Adele Leigh; Edith Coates; John Lanigan; Monica Sinclair; Otakar Kraus; Covent Garden Chorus and Orchestra; John Pritchard, conductor. Live recording of the 1955 premiere."]}, {"page": "Trinity Laban Conservatoire of Music and Dance", "response": ["* Edith Coates (mezzo-soprano, OBE)"]}, {"page": "Gladys Ripley", "response": ["Dido and Aeneas Isobel Baillie (Belinda), Edith Coates (Sorceress), Joan Fullerton, Edna Hobson. Gladys Ripley (Second Witch), Sylvia Patriss (Spirit), Trefor Jones (Sailor), Joan Hammond (Dido), Dennis Noble (Aeneas), Constant Lambert (conductor)", "Die Walküre Kirsten Flagstad, Rudolf Bockelmann, Maria Müller, Mae Craven, Elsa Stenning, Thelma Bardsley, Linda Seymour, Evelyn Arden, Edith Coates, Gwladys Garside, Gladys Ripley, Wilhelm Furtwängler (conductor) Wilhelm Furtwängler Conducts Excerpts from the 1937 Covent garden Performances of Die Walküre and Götterdämmerung Black Top / Wagner - Die Walküre, Act 3 Grammofono / Wagner: Die Walküre, Act 3 Myto"]}, {"page": "The Olympians", "response": ["|Edith Coates"]}, {"page": "Powell Lloyd", "response": ["Lloyd studied singing at Morley College and later with Amy Martin and Herbert Oliver. He began his career as an actor at the Old Vic in his early 20s, excelling in the plays of William Shakespeare. During this time he also sang in the opera chorus. In 1923 he began to appear as a soloist with Lilian Baylis's opera company at the Old Vic; mostly in buffo roles. While there he met his future wife, operatic mezzo-soprano Edith Coates. The couple married in 1933 and often performed together.Lloyd, Powell biography at operissimo.com (in German)"]}, {"page": "Dido and Aeneas discography", "response": ["|Joan HammondIsobel BaillieDennis NobleEdith Coates", "|Kirsten FlagstadMaggie TeyteThomas HemsleyEdith Coates"]}, {"page": "Clive Carey", "response": ["Clive Carey became a teacher of singing at the RCM. His pupils there over a number of decades until his death in 1968 included: Edith Coates, Rita Hunter, Arnold Matters, Elsie Morison, Margaret Nisbett, John Noble, Alberto Remedios, Betty Roe, Eric Shilling, Joan Sutherland, Ava June and David Ward. "]}, {"page": "1977 Silver Jubilee and Birthday Honours", "response": ["*Edith Coates (Edith Mary Lloyd). For services to singing."]}, {"page": "Emelie Hooke", "response": ["On 19 October 1953, she sang Gerhilde in Wagner's Die Walküre at Covent Garden under the conductor Fritz Stiedry, other roles being sung by Ramón Vinay, Sylvia Fisher, Hans Hotter, Edith Coates, Joan Sutherland and Monica Sinclair.Royal Opera House A recording of a 1946 performance of the opera under Sir Thomas Beecham and the BBC Symphony Orchestra also exists.Die Walküre, operone.de"]}, {"page": "Inglis Gundry", "response": ["In 1938 Gundry wrote his first opera Naaman, The Leprosy of War which remains unperformed. He went on to write 12 more operas, including The Logan Rock which premiered at the Minack Theatre on the cliffs at Porthcurno in 1956 with mezzo Edith Coates and conductor Marcus Dods. His eighth opera The Prince of Coxcombs won Morley College's opera composition contest in 1960. His final opera, Galileo, was written in 1996."]}, {"page": "The Parlour", "response": ["The première, on 5 May 1966, took place at the New Theatre, Cardiff, where the City of Birmingham Symphony Orchestra was conducted by Bryan Balkwill. The cast included Edith Coates and Edward Byles in leading roles, Noreen Berry, John Gibbs, Anne Pashley and Janet Hughes. It was produced by John Moody, and Elizabeth Friendship's set design received praise from reviewers. However, the reviewer in Opera magazine dismissed the music as \"feeble in content, too long, and mis-timed in its relation to the dramatic action\". The BBC, broadcasting a recording made at the Odeon Theatre, Llandudno, in November of the same year, described the première as \"highly successful\", and said that the opera, despite being Williams' first, displays a \"confident professionalism and the theatrical awareness\"."]}]}}