{"wiki_id": "http://www.wikidata.org/entity/Q5337404", "itemLabel": "Edgar Oldroyd", "itemDescription": "English county cricketer (1888-1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edgar_Oldroyd", "wikipedia_page": {"main": "Edgar Oldroyd (1 October 1888 – 29 December 1964) was an English first-class cricketer, who played for Yorkshire County Cricket Club between 1919 and 1931.   John Arlott commented in 1981 that \"one credited Edgar Oldroyd of Yorkshire with being 'the best sticky-wicket batsman in the world'\".Born in Healey, Batley, Yorkshire, England, Oldroyd was a right-handed batsman, who played 383 games for his county, and one further first-class game. He made a total of 15,925 runs at an average of 35.15, with thirty six hundreds. He also took 203 catches. His right arm off break and medium bowling took 42 wickets at an average of 39.47.\nOldroyd died in Truro, Cornwall, in December 1964, aged 76.", "link_mentions": [{"page": "Len Hutton", "response": ["By 1933, Hutton was regularly opening the batting for the Pudsey St Lawrence first team in the Bradford Cricket League. By close observation of his opening partner, the former Yorkshire county batsman Edgar Oldroyd, Hutton further developed his batting technique, especially in defence. The local press soon identified Hutton as a player of promise, particularly after he scored a match-winning 108 not out in the Priestley Cup.Howat, pp. 10–11. Senior figures within Yorkshire cricket identified him as a potential successor to Percy Holmes as an opening partner to Sutcliffe; at this stage in his career, Hutton was also considered a promising leg spin bowler.Howat, pp. 13–15. In the 1933 season Hutton was selected for the Yorkshire Second Eleven. Although he failed to score a run in either of his first two innings, over the season he scored 699 runs at an average of 69.90.Howat, pp. 12–13. Yorkshire appointed Cyril Turner as Hutton's mentor; Hedley Verity and Bowes also offered Hutton guidance in his early career.Howat, p. 17.Hodgson, p. 139."]}, {"page": "John Arlott", "response": ["He was also invited in 1981 to select his Best XI from players who, for a wide variety of reasons, were never capped by England. His team was John Langridge Sussex, Maurice Hallam Leicestershire, Emrys Davies Glamorgan, Edgar Oldroyd Yorkshire, Jack Newman Hampshire, Harry Martyn (WK) Somerset, Peter Sainsbury Hampshire, Wilf Wooller (Captain) Glamorgan, Don Shepherd Glamorgan, Charles Kortright Essex and Tom Wass Nottinghamshire. \"The side bats down to No. 7. There are seven bowlers...it has at least six good catchers and a number of cricketers of competitive quality and good temperament: and it would be good to watch.\""]}, {"page": "List of Yorkshire County Cricket Club players", "response": ["* Edgar Oldroyd (1910–1931) : E. Oldroyd"]}, {"page": "1930 English cricket season", "response": [" || Edgar Oldroyd || 33 || 1285 || 164* || 51.40 || 3 "]}, {"page": "Alfred Goulder", "response": ["Born in Attercliffe, Sheffield, Yorkshire, England, Goulder was a left arm orthodox spinner and left-handed tail end batsman, who made his debut against an 'All England XI' at Bramall Lane, Sheffield, at the end of July 1929.  He did not bat as Alan Barber (100) and Edgar Oldroyd (143) put on 203 for the second wicket, to help Yorkshire post 320 for 4.  He bowled 11 overs and took the wickets of Eddie Dawson and Alan Shipman for 21, before rain forced the abandonment of the final day's play.  His second, and final game, was the County Championship clash against Derbyshire again at Bramall Lane, in August.  Batting at number eleven, he fell leg before wicket to Tommy Mitchell for three runs, and his only success with the ball came when he dismissed Stan Worthington, caught by Frank Dennis, for six.  He finished with a first-class career bowling average of 30.00."]}, {"page": "Oldroyd", "response": ["*Edgar Oldroyd (born 1888), English cricketer "]}, {"page": "Herbert Sutcliffe's cricket career (1919–1927)", "response": ["Yorkshire could be well satisfied with their third-place finish in the County Championship as the team was still in transition.  The retirement of David Denton brought Edgar Oldroyd fully into the picture and Arthur Dolphin played less matches than previously as Reg Allen became the favoured wicket-keeper for a time.  Norman Kilner ceased to be a regular and eventually joined Warwickshire.  Macaulay, Sutcliffe's future business partner, was now the first choice opening bowler.  Sutcliffe was one of six Yorkshire batsmen who scored 1,000 runs in the championship."]}, {"page": "Herbert Sutcliffe's cricket career (1928–1932)", "response": ["Largely on account of Sutcliffe's runs and the bowling of Bowes and Verity, Yorkshire were able to win 15 of their last 16 games and retain their County Championship title.Webber, p.69.  Although Frank Greenwood was still the club captain, he only played in 6 championship matches and it was newcomer Brian Sellers who led Yorkshire in most of their matches.  Sellers soon became one of Yorkshire's greatest captains.  Percy Holmes missed several matches and Sutcliffe sometimes opened with Wilf Barber who now became a first team regular, especially as Edgar Oldroyd had retired.  Seam bowler Arthur Rhodes was a regular player in 1932, replacing the retired Emmott Robinson.  Bowes and Verity took well over 100 wickets each with Macaulay now playing a supporting role."]}, {"page": "History of English cricket from 1919 to 1939", "response": ["Yorkshire were strong in all departments. The mainstay of the team was their world-class opening batsman Herbert Sutcliffe, whose career spanned the whole inter-war period. He had two significant opening partners in Percy Holmes and the young Len Hutton. Maurice Leyland was another regular England batsman and Yorkshire could also rely on Wilf Barber, Arthur Mitchell and Edgar Oldroyd. Opposing batsmen always knew that they would face a formidable attack, not least the two all-time greats Wilfred Rhodes through the 1920s and his successor Hedley Verity in the thirties. Yorkshire also called upon England bowlers George Macaulay, Roy Kilner, Abe Waddington, Bill Bowes and Frank Smailes. The redoubtable Emmott Robinson was a good bowler too, as was his namesake Ellis Robinson (no relation) in the late 1930s. Yorkshire's main wicket-keepers were Arthur Dolphin, who had made his debut in 1905, and Arthur Wood; they both played for England."]}]}}