{"wiki_id": "http://www.wikidata.org/entity/Q5337048", "itemLabel": "Ederyn Williams", "itemDescription": "British University Department Head", "wikipedia_url": "https://en.wikipedia.org/wiki/Ederyn_Williams", "wikipedia_page": {"main": "Ederyn Williams (born 21 September 1946) is a British academic, commentator and writer whose work focuses on social presence theory and technology transfer.", "link_mentions": [{"page": "Telecomsoft", "response": ["Telecomsoft was a British video game publisher and a division of British Telecom. The company was founded by Dr. Ederyn Williams in 1984 and operated three separate labels: Firebird, Rainbird, and Silverbird. The first employee was James Leavey, seconded from elsewhere in BT, who, along with Tony Rainbird, became the driving force behind the company in the early days."]}, {"page": "List of people with surname Williams", "response": ["*Ederyn Williams (born 1946), British academic and businessman"]}, {"page": "Warwick Ventures", "response": ["The company was set up as an academic department within the University of Warwick by Ederyn Williams in 2000. In 2010 it was spun-out as a separate company to manage the intellectual property portfolio belonging to the University. The business development managers employed by the company work with academic inventors at the University to identify, protect and develop intellectual property (IP) resulting from their research.  This IP is then commercialised through licensing and the formation of spin-out companies.", "* 2000–2011 \tEderyn Williams\t(Director and Founder of Warwick Ventures; CEO of Warwick Ventures Ltd.)"]}, {"page": "Social presence theory", "response": ["Social presence theory explores how the \"sense of being with another\" is influenced by digital interfaces in human-computer interactions. Developed from the foundations of interpersonal communication and symbolic interactionism, social presence theory was first formally introduced by John Short, Ederyn Williams, and Bruce Christie in The Social Psychology of Telecommunications. Research on social presence theory has recently developed to examine the efficacy of telecommunications media, including SNS communications. The theory notes that computer-based communication is lower in social presence than face-to-face communication, but different computer-based communications can affect the levels of social presence between communicators and receivers.", "On a continuum of social presence, the face-to-face medium is considered to have the most social presence; and written, text-based communication the least.Biocca, Harms, & Burgoon 2003. Inter-party and interpersonal exchanges are two aspects of interactions identified by Short, Williams, and Christie. It is assumed in Social Presence Theory that in any interaction involving two parties, both parties are concerned with acting out certain roles and developing or maintaining some sort of personal relationship.Short, John, Ederyn Williams, and Bruce Christie 1976.", "*Ederyn Williams "]}, {"page": "Queen's Award for Enterprise Promotion", "response": ["* Ederyn Williams, director, Warwick Ventures, University of Warwick, Coventry, Warwickshire."]}]}}