{"wiki_id": "http://www.wikidata.org/entity/Q5339543", "itemLabel": "Edmund Hart Turpin", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Edmund_Hart_Turpin", "wikipedia_page": {"main": "Edmund Hart Turpin (4 May 1835, Nottingham – 25 October 1907, Middlesex) was an organist, composer, writer and choir leader based in Nottingham and London.", "link_mentions": [{"page": "John Stainer", "response": ["His work as a composer was much esteemed during his lifetime but is not well known today. The Crucifixion is one of the few major works of his that is still regularly performed. It is often given in Anglican churches during Holy Week and forms part of the repertoire of numerous choirs. He also made a lasting contribution to the music of Christmas in his Christmas Carols New and Old (1871), produced in collaboration with the Revd. H. R. Bramley, which marked an important stage in the revival of the Christmas carol. The book includes Stainer's arrangements of what were to become the standard versions of \"What Child Is This\", \"God Rest Ye Merry Gentlemen\", \"Good King Wenceslas\", \"The First Nowell\", and \"I Saw Three Ships\", among others. He was a skilled musician and accompanist and Walter Galpin Alcock, who was taught composition by Arthur Sullivan at the National Training School for Music, recalls Sullivan saying \"I was at St Paul's yesterday, listening to Dr Stainer extemporising. My dear young friends, he is a genius, and I hope you will miss no chance of hearing him.\" John Stainer was also a close friend of Edmund Hart Turpin, the later Hon. Secr. of the Royal College of Organists for more than fifty years.Charles William Pearc, A Biographical Sketch of Edmund Hart Turpin, 1911"]}, {"page": "St Bride's Church", "response": ["* Edmund Hart Turpin 1888–1907"]}, {"page": "Nottingham Cathedral", "response": ["*Edmund Hart Turpin 1850 – 1865"]}, {"page": "Catholic Apostolic Church", "response": ["Each service in the full form started with an act of confession, followed by absolution, reading of the scriptures, anthems, psalms and the recital of the creed. The fourfold ministry would then offer the four Pauline divisions of prayer – supplications, prayers, intercessions and giving of thanks, with the addition of collects for the seasons and with the Lord's prayer placed in the centre. Following this, the angel would offer a prayer of universal intercession, at which time also incense would be offered. The service would close with an anthem and a universal blessing from the angel. Shorter forms followed almost the same course but without the four divisions of prayer, without incense and in a less elaborate form. Much of the music in the Catholic Apostolic Church is composed by Edmund Hart Turpin, former secretary of the Royal College of Organists.", "Aside from Irving, notable members include Thomas Carlyle, Baron Carlyle of Torthorwald (1803–1855), who was given responsibility for northern Germany. (This is not Thomas Carlyle the essayist (1795–1881), although Irving knew both men.). Besides Thomas Carlyle, Edward Wilton Eddis contributed to the Catholic Apostolic Hymnal; Edmund Hart Turpin contributed much to catholic apostolic music."]}, {"page": "John Pyke Hullah", "response": ["Hullah was born at Worcester. He was a pupil of William Horsley from 1829, and entered the Royal Academy of Music in 1833. He wrote an opera to words by Dickens, The Village Coquettes, produced in 1836;J. Hullah & C. Dickens, The village coquettes: a comic opera in two acts (Richard Bentley, London 1836). See Walter Dexter, Dickens's Correspondence with John Hullah: hitherto unpublished from the collection of the Count de Suzannet (Walter Dexter, London 1933). The Barbers of Bassora in 1837;J. Hullah & John Maddison Morton, The barbers of Bassora: a comic opera in two acts (Chapman & Hall, London c. 1837). and The Outpost in 1838, the last two at Covent Garden. From 1839, when he went to Paris to investigate various systems of teaching music to large masses of people, he identified himself with Wilhem's system of the fixed \"do,\" in contrast to the moveable \"do\" of the Tonic sol-fa. His adaptation of Wilhem's system was taught with enormous success from 1840 to 1860. His first-ever lesson was given at the Battersea College for training teachers (now University St Mark and St John Plymouth), in 1840, at the instigation of educationalist and college Principal James Kay Shuttleworth. One of his famous pupils was Edmund Hart Turpin.Edmund Hart Turpin , cyberhymnal.org, retrieved 16 December 2014"]}, {"page": "Royal College of Organists", "response": ["The first members of the College of Organists were:Charles William Pearce, A Biographical Sketch of Edmund Hart Turpin, 1911, p. 25", "Edmund Hart Turpin, was made a fellow of the Royal College of Organist without examination in 1869, and became a member shortly afterwards. From 1875 he succeeded Richard Limpus as honorary secretary of the Royal College of Organists.Charles William Pearce, A Biographical Sketch of Edmund Hart Turpin, 1911"]}, {"page": "Turpin", "response": ["* Edmund Hart Turpin (1835–1907), British organist, composer and choir leader"]}, {"page": "Hymns Ancient and Modern", "response": ["Henry Williams Baker wrote and translated many of the hymns which it contains, and his ability, his profound knowledge of hymnology, and his energetic discharge of the duties of chairman of its committee for twenty years, mainly contributed to its success. Not all the hymns in these sources were already provided with tunes. Therefore, composers like William Henry Monk, the editor of the 1861 edition, John Bacchus Dykes and Frederick Ouseley, John Stainer, Henry Gauntlett and Edmund Hart Turpin provided new hymn tunes. Among the hymns with newly-composed tunes were Eternal Father, Strong to Save and Praise to the Holiest in the Height (John Bacchus Dykes), Onward, Christian Soldiers (Arthur Sullivan) and Abide with Me (William Henry Monk).John Monsell, Hymns Ancient and Modern: De negentiende-eeuwse Engelse gezangindustrie, in: Tim Dowley, Christelijke muziek door de eeuwen heen, 2013, p. 170-171"]}, {"page": "Church of Christ the King, Bloomsbury", "response": ["In 1853, a fine organ was erected by Gray and Davison. It was a three manuals organ with pedals, containing 13 stops on the Great-organ, 12 stops on the Swell-organ, 10 stops on the Choir-organ and 8 on the pedal. In total there were 6 couplers. A specification of the organ as it now is can be found on the National Pipe Organ Register. One of the first organists was Edmund Hart Turpin. In 1903 a sub bass 16 ft was added to the choir-organ.Charles William Pearce, A Biographical Sketch of Edmund Hart Turpin, 1911"]}, {"page": "Edwin Lemare", "response": ["Edwin H. Lemare was born in Ventnor, on the Isle of Wight on 9 September 1865.Nelson Barden (January 1986) \"Edwin H. Lemare\", The American OrganistKeller, G., Kruseman, P. (1932) Geïllustreerd Muzieklexicon, p. 390 His birth year is sometimes erroneously stated as 1866, including in Lemare's own autobiography Organs I Have Met. He received his early musical training as a chorister and organist under his father (a music seller, also called Edwin Lemare) at Holy Trinity Church. He then spent three years at the Royal Academy of Music from 1876 on a Goss Scholarship, where he studied under Sir George Alexander Macfarren, Walter Cecil Macfarren, Dr Charles Steggall and Dr Edmund Hart Turpin. He obtained the F.R.C.O. in 1886. He became an organ professor and examiner for the Associated Board of the Royal Schools of Music in 1892."]}, {"page": "James Turpin (organist)", "response": ["He was born in Nottingham on 15 December 1840 into a musical family which ran a dealership in musical instruments at 20 Chapel Bar, Nottingham. His brother Edmund Hart Turpin was organist at Nottingham Cathedral and James succeeded him in this position in 1866.Charles William Pearce, A Biographical Sketch of Edmund Hart Turpin, 1911 James Turpin was an excellent musician, being amongst many other good things, a capable organist and a painstaking teacher.Charles William Pearce, A Biographical Sketch of Edmund Hart Turpin, 1911 He achieved his FRCO in 1875.Nottinghamshire Guardian - Friday 16 July 1875 He graduated Mus Bac at the Cambridge University in 1880.Graduation, books.google.nl, retrieved 7 November 2014", "*Music-master at Berkhampstead School Charles William Pearce, A Biographical Sketch of Edmund Hart Turpin, 1911"]}, {"page": "Henry Houseley", "response": ["Henry Houseley was born on 20 September 1851 in Sutton in Ashfield, Nottinghamshire.Birth, hymnary.org, retrieved 18 December 2014 He received his musical education in Nottingham and London from James Turpin, and Edmund Hart Turpin.Education, cyberhymnal.org, Retrieved 18 December 2014 In London Henry Houseley studied at the Royal College of Organists, earning an FRCO.FRCO, hymnary.org, retrieved 18 December 2014 He served as organist at St. Luke's Church, Derby, England; St. Thomas' Church, Nottingham.Local appointments, cyberhymnal.org, Retrieved 18 December 2014 Furthermore, he was also organist to the Nottingham Harmonic Society and music lecturer at the college in Nottingham.Music lecturer, cyberhymnal.org, Retrieved 18 December 2014 Being in England, he wrote most of his piano and organ music."]}, {"page": "Edward Wilton Eddis", "response": ["The Hymns for the Use of the Churches, however, only provided hymntexts, no music. In 1872, Edmund Hart Turpin, organist of the central church on Gordon Square, helped to bridge this gap by publishing the Hymn Tunes.Charles William Pearce, A Biographical Sketch of Edmund Hart Turpin, 1911 For each of the 320 hymns in the 1871 edition of the Hymns for the Use of the Churches it contains a tune without the lyrics.Edmund Hart Turpin, Hymn Tunes, 1939 Furthermore, it provides four metrical chants, one of which was written by Edmund Hart Turpin. Most of the hymn tunes were taken from other hymnbooks such as the Hymns Ancient and Modern. In total 39 tunes were newly written by Edmund Hart Turpin. The musical style of the Hymn Tunes is comparable to that of the Hymns Ancient and Modern, the famous hymnal which resulted out of the Oxford Movement in 1861. A comparison of the Hymn tunes with the Hymns for the Use of the Churches shows that most of these new tunes were to support the hymns of Edward Wilton Eddis."]}]}}