{"wiki_id": "http://www.wikidata.org/entity/Q5336322", "itemLabel": "Eddie Mooney", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Eddie_Mooney", "wikipedia_page": {"main": "Eddie Mooney (born 6 August 1957) is an English rock and pop vocalist/bassist. He is best known as a member of The Fortunes.", "link_mentions": [{"page": "Larne", "response": ["*Eddie Mooney, musician (The Dakotas, The Fortunes)"]}, {"page": "The Fortunes", "response": ["On 10 January 2008, Rod Allen died after suffering for two months from liver cancer. The remaining members of the band said they would continue touring and recruited the Dakotas lead singer Eddie Mooney. During 2008, the band regrouped, recorded a new album Play On, and appeared in Las Vegas, the Netherlands and Belgium as well as the UK. They toured Canada, the Netherlands, and Sweden, in addition to the UK during 2009. The band had a busy schedule in the UK, Netherlands, Germany, and Italy during 2010 and 2011, appearing in Belgium at the Vostertfeesten Festival in August 2010. Drummer Paul Hooper left the band in early 2010 and was replaced by Glenn Taylor, formerly of Marmalade. The band then released a new studio album, Another Road.", "* Eddie Mooney (born 6 August 1957, Stoke-on-Trent) – lead vocals, bass (2007–present)"]}, {"page": "Burnage", "response": ["The district is notable for being the childhood home of Liam and Noel Gallagher, of the British rock band Oasis, who attended St. Bernard's RC Primary School on Burnage Lane and St Mark's RC High School (now The Barlow Roman Catholic High School) on Parrs Wood Road. Lead singer and bassist of 60s and 70s pop band the Fortunes, Eddie Mooney has lived in Burnage for many years."]}, {"page": "Horley", "response": ["*Eddie Mooney vocalist with 60s bands the Fortunes and the Dakotas (band) has lived in Horley in recent years"]}, {"page": "The Dakotas (band)", "response": ["The Dakotas reformed in the late 1980s and recruited vocalist Eddie Mooney and session musician Toni Baker. After original drummer Tony Mansfield left to pursue a career in finance and Mike Maxfield suffered a stroke, drummer Pete Hilton and guitarist Alan Clare were added. In recent years, the band has appeared on nostalgia 1960s package tours in their own right, as well as backing artists such as Peter Noone of Herman's Hermits, Wayne Fontana and John Walker of the Walker Brothers. In 2004 the Dakotas worked with British comedian Peter Kay on hit TV series Phoenix Nights, and Max and Paddy. Toni Baker co-wrote all the music with Peter Kay.", "In December 2007, Eddie Mooney was invited to front the Fortunes whose lead singer, Rod Allen died after a sudden illness. This led to him joining the band full-time. Since December 2010 the Dakotas gained a new bass player in Marius Jones, and a new frontman in Ronnie Ravey, taking the band back to the original formula of a 5 piece outfit.", "* Eddie Mooney appeared on PBS television in the U.S. as a member of The Walker Brothers."]}, {"page": "Eddie mooney", "response": ["#REDIRECT Eddie Mooney "]}, {"page": "List of people from Stoke-on-Trent", "response": ["*Eddie Mooney (born 1957), guitarist."]}]}}