{"wiki_id": "http://www.wikidata.org/entity/Q5336391", "itemLabel": "Eddie Paynter", "itemDescription": "English cricketer (1901-1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eddie_Paynter", "wikipedia_page": {"main": "Edward Paynter (5 November 1901 – 5 February 1979) was an English cricketer: an attacking batsman and excellent fielder. His Test batting average of 59.23 is the seventh highest of all time, and second only to Herbert Sutcliffe amongst Englishmen; against Australia alone Paynter averaged an extraordinary 84.42.\nBorn in Oswaldtwistle, Lancashire, Paynter did not make his first-class debut for Lancashire County Cricket Club until the relatively advanced age of 24 in July 1926. He made a slow start to his career, however, not establishing himself as a first-team player until 1930 and only scoring his first century in July of the following year, making exactly 100 against Warwickshire in his 48th first-class match. He scored 102 against the touring New Zealanders in the very next game, and in August made his Test debut against the same opposition. However, the match was ruined by rain, with no play possible on the first two of the game's scheduled three days, and Paynter made just three in his only innings.\nPerhaps the most famous of his Test appearances came against Australia, on the \"Bodyline tour\" of 1932/33. At Brisbane Paynter was taken to hospital suffering from tonsillitis, yet with England in difficulty at 216/6 in reply to Australia's 340, came out to bat. After spending the night in hospital, he made his way to 83 and helped his team to an unlikely first-innings lead, and though he only fielded for a couple of hours, returned for the second innings and had the honour of hitting the winning runs – with a six off McCabe. Paynter averaged a fine 61.33 over his five innings on this tour.\nPaynter was then out of the England side for a time, but in 1937 his county form – 2,904 runs and a five-hour triple century against Sussex brought him a recall against New Zealand, as well as Wisden Cricketer of the Year recognition in the next year's Almanack. In 1938 Paynter had another outstanding series against Australia, averaging 101.75 and hitting 216 not out at Nottingham, at the time an England record for Ashes Tests in England. He also filled in very competently as wicket-keeper when Les Ames was injured at Lord's. Paynter was again very successful the following winter against South Africa, scoring three centuries and two fifties in eight innings, including 243 at Durban, to average 81.62.\nThe Second World War brought an effective end to Paynter's career, though he did play a few special and festival games after the war. His final first-class innings was 75 not out for a Commonwealth XI against the Bombay Governor's XI in 1950/51; he then stood for one season (1951) as a first-class umpire. He spent the rest of his working life stacking wool in a Yorkshire mill. He died at the age of 77 in Keighley, Yorkshire.", "link_mentions": {}}}