{"wiki_id": "http://www.wikidata.org/entity/Q533981", "itemLabel": "Katharine O'Shea", "itemDescription": "British aristocrat", "wikipedia_url": "https://en.wikipedia.org/wiki/Katharine_O%27Shea", "wikipedia_page": {"main": "Katharine Parnell (née Wood; 30 January 1846 – 5 February 1921), known before her second marriage as Katharine O'Shea, and usually called by friends Katie O'Shea and by enemies Kitty O'Shea, was an English woman of aristocratic background, whose decade-long secret adultery with Charles Stewart Parnell led to a widely publicized divorce in 1890 and his political downfall.\n\n", "link_mentions": [{"page": "List of Irish people", "response": ["* Katharine O'Shea – mistress of Charles Stewart Parnell"]}, {"page": "Tim Healy (politician)", "response": ["Initially a passionate supporter of Parnell, he became disenchanted with his leader after Healy opposed Parnell's nomination of Captain William O’Shea to stand for a by-election in Galway city. At the time O’Shea was separated from his wife, Katharine O'Shea, with whom Parnell was secretly living. Healy objected to this, as the party had not been consulted and he believed Parnell was putting his personal relationship before the national interest. When Parnell travelled to Galway to support O’Shea, Healy was forced to back down."]}, {"page": "Charles Stewart Parnell", "response": ["Parnell's leadership was first put to the test in February 1886, when he forced the candidature of Captain William O'Shea, who had negotiated the Kilmainham Treaty, for a Galway by-election. Parnell rode roughshod over his lieutenants Healy, Dillon and O'Brien who were not in favour of O'Shea. Galway was the harbinger of the fatal crisis to come. O'Shea had separated from his wife Katharine O'Shea, sometime around 1875, but would not divorce her as she was expecting a substantial inheritance. Mrs. O'Shea acted as liaison in 1885 with Gladstone during proposals for the First Home Rule Bill. Parnell later took up residence with her in Eltham, Kent, in the summer of 1886, and was a known overnight visitor at the O'Shea house in Brockley, Kent. When Mrs O'Shea's aunt died in 1889, her money was left in trust."]}, {"page": "Littlehampton", "response": ["St Mary's is the Anglican parish church while St Catherine's is the principal Catholic church. In the cemetery, which is on the northern side of the town, lies the grave of Katharine O'Shea (\"Kitty O'Shea\") (1845–1921), the wife of Charles Stewart Parnell."]}, {"page": "John Redmond", "response": ["In  November 1890 the Irish Parliamentary Party split over Parnell's leadership when his long-standing  adultery with Katharine O'Shea was revealed in a spectacular divorce case. Redmond stood by Parnell and worked to keep the minority faction active. When Parnell died in 1891, Redmond became MP for Waterford and took over leadership of the Parnellite faction of the split party. Redmond lacked Parnell's oratory and charisma but did demonstrate both his organisational ability and his considerable rhetorical skills. He raised funds for the Parnell Monument in Dublin."]}, {"page": "Irish Parliamentary Party", "response": ["Parnell successfully exposed an attempt to use the forged Pigott Papers to associate him and his party with crime and violence; he was vindicated in February 1890.  Gladstone invited Parnell to his country house (Hawarden in Flintshire) to discuss a renewed Home Rule bill. This was the high point of Parnell's career. However, since 1880 he had had a family relationship with a married woman Katharine O'Shea who bore him three children. Her divorce proceedings first came to court late in 1890, in which Parnell was named co-respondent. This was a political scandal for English Victorian society. Gladstone reacted by informing Parnell that if he were re-elected leader of the Irish Party, Home Rule would be withdrawn. Parnell did not disclose this to his party and was selected leader on 25 November."]}, {"page": "William Wood, 1st Baron Hatherley", "response": ["Wood was born in London, the second son of Sir Matthew Wood, 1st Baronet,thepeerage.com William Page Wood, 1st and last Baron Hatherley an alderman and Lord Mayor of London who became famous for befriending Queen Caroline and braving George IV. Sir Evelyn Wood and Katharine O'Shea were his nephew and niece respectively."]}, {"page": "Kitty O'Shea", "response": ["#REDIRECT Katharine O'Shea"]}, {"page": "Michael Davitt", "response": ["When Parnell's extramarital affair with Katharine O'Shea was exposed in 1890, Davitt asked him to step down. He came to oppose Parnell's leadership for a number of reasons, including his belief that Parnell had misled him about the affair, insistence that the cause was more important that the individual, and fears that the revelations would harm the IPP–Liberal alliance. When Parnell refused to step down, Davitt sided with the anti-Parnellite Irish National Federation and became one of Parnell's most vociferous critics, \"reveal[ing] a rather unpleasant talent for personal invective\" according to Boyce. This put him in odd company, as the anti-Parnellites were dominated by social conservatives and proponents of Catholic clericalism, with whom Davitt had little in common. In his later writings, he balanced criticism of Parnell's failings with appreciation for his accomplishments."]}, {"page": "History of Ireland (1801–1923)", "response": ["In 1889, the scandal surrounding Parnell's divorce proceedings split the Irish party, when it became public that Parnell, popularly acclaimed as the 'Uncrowned King of Ireland', had for many years been living in a family relationship with Mrs. Katharine O'Shea, the long-separated wife of a fellow MP. When the scandal broke, religious non-conformists in Great Britain, who were the backbone of the pro-Home Rule Liberal Party, forced its leader W. E. Gladstone to abandon support for the Irish cause as long as Parnell remained leader of the IPP. Inside Ireland, the Catholic Church turned against him.  Parnell fought for control but lost. He died in 1891. But the Party and the country remained split between pro-Parnellites and anti-Parnellites, who fought each other in elections."]}, {"page": "Katherine Parnell", "response": ["#REDIRECT Katharine O'Shea"]}, {"page": "Daily Irish Independent", "response": ["The Daily Irish Independent was an Irish newspaper launched in the 1890s to promote the pro-Parnellite cause following the split in the Irish Parliamentary Party over Parnell's continuing leadership. The party had split following the revelation that Parnell had been involved in a long-running relationship with Katharine O'Shea, the wife of a fellow MP, and was the father of most of her children. "]}, {"page": "John J. O'Kelly", "response": ["Sceilg was unusual among Irish Republicans in that he regarded Daniel O'Connell and T.M. Healy as political heroes. This apparently reflected local patriotism (both men came from south-western Ireland near to Sceilg's own birthplace) and Sceilg's own devout Catholicism, which led him to exalt O'Connell's achievement of Catholic Emancipation and Healy's claims that the adultery of Charles Stewart Parnell with Katharine O'Shea made Parnell unfit for political leadership. Sceilg was also explicitly hostile to the Spanish Republic declared in 1931, believing it to be anti-Catholic and supported by pro-British Freemasons."]}, {"page": "Kilmainham Treaty", "response": ["In gaol Parnell had begun to turn over in his mind the possibility of coming to an arrangement with the Government. He had been corresponding with Mrs Katharine O'Shea who engaged her husband Captain O'Shea in April 1882 to act as a go-between for negotiations on behalf of Parnell. O'Shea contacted Gladstone on 5 MayLyons, p.65 having been informed by Parnell that if the Government would settle the rent-arrears problem on the terms he proposed, he was confident that he would be able to curtail outrages (violent crimes). He further urged for the quick release of the League's organizers in the West, Sheridan and Boyton, who would then work for pacification. This shocked Forster, but impressed Gladstone."]}, {"page": "O'Shea", "response": ["*Katharine O'Shea (1846–1921), English wife of Irish politician, Charles Stewart Parnell"]}, {"page": "John Philip Nolan", "response": ["When the Irish Parliamentary Party split over Charles Stewart Parnell's long-term family relationship with Katharine O'Shea, the separated wife of a fellow MP, Nolan sided with his deposed leader and seconded the motion to retain Parnell as chairman at the ill-fated party meeting in Committee Room 15 of the House of Commons. He went on to become whip of the pro-Parnellite rump of the split party, the Irish National League.  He lost the Galway North seat to an Anti-Parnellite, Denis Kilbride, in 1895 and stood unsuccessfully as a Parnellite for Louth South in 1896.  He was re-elected unopposed at Galway North after the reunification of the Parliamentary Party in 1900. But at the National Convention of 8 January 1902 he was expelled from the United Irish League on the ground of his 'harsh and unparalleled oppression of his Mweenish tenantry'.Freeman's Journal, 9 January 1902 p. 7 In 1906 he stood as an independent Nationalist and lost the Galway North seat for the last time."]}, {"page": "Irish National League", "response": ["In December 1890 both the INL and the IPP split on the issues of Parnell's long standing family relationship with Katharine O'Shea, the earlier separated wife of a fellow MP, Capt. O'Shea, and their subsequent divorce proceedings. The majority of the League, which opposed Parnell, broke away to form the \"Anti-Parnellite\" Irish National Federation (INF) under John Dillon. John Redmond assumed the leadership of the  minority Pro-Parnellite (INL) group who remained faithful to Parnell. Despite the split, in the 1892 general election the combined factions still retained the Irish nationalist pro-Home Rule vote and their 81 seats."]}, {"page": "Irish National Federation", "response": ["The Irish National Federation (INF) was a nationalist political party in Ireland. It was founded in 1891 by former members of the Irish National League (INL), after a split in the Irish Parliamentary Party (IPP) on the leadership of Charles Stewart Parnell. Parnell had refused to resign his leadership of the party after being named in divorce proceedings against Katharine O'Shea by the former MP William O'Shea. In the aftermath of the divorce, William Ewart Gladstone, leader of the Liberal Party, had declared that he would not work with Parnell, damaging the parliamentary alliance between the IPP and the Liberals."]}, {"page": "J. J. Clancy (North County Dublin MP)", "response": ["Clancy had long been a strong supporter of the Irish leader Charles Stewart Parnell.  When a majority of the Irish Parliamentary Party turned against Parnell in November 1890, following what amounted to a demand by the Liberal leader, Gladstone, that Parnell should stand down over his involvement with Katharine O'Shea, Clancy rapidly emerged as one of Parnell's key defenders.  On the third day of the Irish Party's week-long debate on Parnell's leadership in Committee Room 15 of the House of Commons, Clancy proposed an amendment that attempted to compromise by seeking further views from Gladstone and the other British Liberal Party leaders.  Although this move held off a decision for another three days, it was ultimately unsuccessful.  Clancy was among the minority who stayed with Parnell when the party split on 6 December 1890 into the pro-Parnellite Irish National League (INL) and the anti-Parnellite Irish National Federation (INF).  He later joined the editorial staff of the Irish Daily Independent, which was founded to support the Parnellite cause."]}, {"page": "Katharine Parnell", "response": ["#REDIRECT Katharine O'Shea"]}, {"page": "Katherine O'Shea", "response": ["#REDIRECT Katharine O'Shea"]}, {"page": "Joseph Biggar", "response": ["In early 1886 Parnell insisted on nominating Captain O'Shea, the separated husband of Katharine O'Shea with whom he lived in a family relationship, as the nationalist candidate for Galway – a move widely viewed as an attempt to buy O'Shea's silence. T.M. Healy, who initially opposed the nomination together with Biggar, describes Biggar's attitude to the issue:T. M. Healy, Letters and Leaders of My Day. Chapter 19. Captain O'Shea, Nationalist or Liberal? (1886)"]}, {"page": "Richard Power (Parnellite MP)", "response": ["Power was a major supporter of Charles Stewart Parnell during his leadership crisis after the Katharine O'Shea divorce controversy.Timothy Michael Healy, \"Letters and Leaders of my Day. Chapter 25: Parnell's Downfall\" (1890). London: Thornton Butterworth. Despite this, he remained popular on both sides of the party.The Times, 2 December 1891 He was reported to have caught a chill at Parnell's funeral, which left his lungs weak. He was married only a few days before his death.The Times, 1 December 1891"]}, {"page": "Roman Catholic Diocese of Meath", "response": ["Charles Stewart Parnell's relationship with Mrs Katharine O'Shea led to the Bishop of Meath having a letter read at masses in the diocese in condemnation of the relationship. As Parnell was popular, this caused a backlash which eventually led to the cathedral removing to Mullingar, County Westmeath permanently. The diocesan school, St. Finian's College also moved to Mullingar from Navan. The incumbent bishop is Thomas Deenihan."]}, {"page": "William O'Shea", "response": ["Captain William Henry O'Shea (1840 – 22 April 1905) was an Irish soldier and Member of Parliament.  He is best known for being the ex-husband of Katharine O'Shea, the long-time mistress of the Irish nationalist leader Charles Stewart Parnell.", "Around 1880, his wife,Wexford born Katharine O'Shea, entered into a relationship with the Irish nationalist leader Charles Stewart Parnell, with whom she had three children. O'Shea, who was already separated from his wife, knew of the relationship.", "In 1886, following insinuations of the Parnell affair and O'Shea's complicity in it appearing in the Pall Mall Gazette, O'Shea abstained from voting on the Irish Home Rule bill and resigned his parliamentary seat the following day.  However, he only filed for divorce in 1890 after his wife's aunt, from whom he was expecting a large inheritance, died in 1889 leaving her estate in trust for his wife (thus allegedly violating the terms of O'Shea's marriage contract).  However, that will was overturned upon appeal, and the aunt's legacy was shared among Katharine O'Shea's siblings.", "After the divorce the two surviving children of Parnell and Katharine O'Shea were given into Captain O'Shea's custody."]}, {"page": "Henry Harrison (Irish politician)", "response": ["Only six months later, following the divorce case involving Katharine O'Shea, the Irish Parliamentary Party split over Parnell's leadership. Harrison strongly supported Parnell, acted as his bodyguard and aide-de-camp, and after Parnell's death devoted himself to the service of his widow Katharine. From her he heard a completely different version of the events surrounding the divorce case from that which had appeared in the press, and this was to form the seed of his later books."]}, {"page": "Henry Campbell (MP)", "response": ["When the Irish Parliamentary Party split in December 1890 over the leadership of Parnell following the divorce case involving Katharine O'Shea, Campbell remained loyal to Parnell, and after Parnell's death in October 1891, to the Parnellite party.  However he did not contest the 1892 general election."]}, {"page": "Page Wood baronets", "response": ["The Wood, later Page Wood Baronetcy, of Hatherley House in the County of Gloucester, is a title in the Baronetage of the United Kingdom. It was created on 16 December 1837 for Matthew Wood, Lord Mayor of London from 1815 to 1817 and Whig Member of Parliament for the City of London from 1817 to 1843. The fifth Baronet assumed the additional surname of Page. Two other members of the family have also gained distinction. William Wood, 1st Baron Hatherley, Lord High Chancellor of Great Britain from 1868 to 1872, was the second son of the first Baronet while Field Marshal Sir Evelyn Wood was the fifth son of the second Baronet. Also, Katharine O'Shea, known for her relationship with Charles Stewart Parnell, was the daughter of the second Baronet. The theosophist and political activist Annie Besant (born Annie Wood), was the great-granddaughter of the 1st Baronet's father."]}, {"page": "James Patrick Mahon", "response": ["Mahon had served alongside William O'Shea as an MP, and the two were close friends. He introduced him and Katharine O'Shea, his wife, to Parnell. After Parnell was named in the O'Sheas' divorce case in 1890, Mahon split with Parnell, siding with the Irish National Federation. However, Parnell attended Mahon's funeral in Glasnevin Cemetery a few months later."]}, {"page": "Newcastle Programme", "response": ["Between 1886 and 1891, Home Rule dominated Liberal policy debates but two events damaged their Irish allies. In 1887, The Times published letters, implicating Charles Stewart Parnell, the Irish Home Rule party leader, in the Phoenix Park murders of a government minister and a civil servant, although a high-profile government inquiry later discovered the letters to be forgeries. In 1890, the divorce of Katharine O'Shea, which identified Parnell as Mrs O'Shea's lover, split the Irish party and scandalised nonconformist Liberals. The split in the Irish Home Rule party in 1890 weakened the likelihood of a successful Home Rule Bill. At the 1891 meeting of the NLF in Newcastle upon Tyne Gladstone reaffirmed the primacy of Home Rule, but associated it with reforms on the mainland by adopting various proposals of the NLF Council, in particular: land reform; reform of the Lords; shorter parliaments; district and parish councils; registration reform and abolition of plural voting; local veto on drink sales; employers' liability for workers' accidents; Scottish and Welsh disestablishment. The Newcastle programme was to be the solution to these dilemmas, a manifesto for British government."]}, {"page": "Sir Matthew Wood, 1st Baronet", "response": ["# John-Page Wood (1796–1866), who became a Church of England vicar in Essex His daughter Katharine Wood (1846–1921) was better known by her married name of Katharine O'Shea. Popularly known as Kitty O'Shea, her relationship with the Irish leader Charles Stewart Parnell led to a political scandal which caused his downfall. John's son Evelyn Wood (1838–1919) was a Field Marshal and a recipient of the Victoria Cross."]}, {"page": "Western Wood (MP)", "response": ["Wood was the fourth child, and second son, of Sir Matthew Wood, 1st Baronet (1768–1843) and his wife Maria née Page. His father had been a Lord Mayor of London, and was a Member of Parliament (MP) for 36 years. His brother William (1801–1881) was a barrister and Liberal MP who was ennobled as Lord Hatherley and became Lord Chancellor; his older brother John (1796–1866) was the father of Katharine O'Shea, whose divorce from her husband and remarriage to Charles Stuart Parnell became a major political scandal in 1890."]}]}}