{"wiki_id": "http://www.wikidata.org/entity/Q5337527", "itemLabel": "Edgar Wood", "itemDescription": "English architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Edgar_Wood", "wikipedia_page": {"main": "Edgar Wood (17 May 1860 – 1935) was a British architect, artist and draftsman who practised from Manchester at the turn of the 20th century and gained a considerable reputation in the United Kingdom. He was regarded as a proponent of the Arts and Crafts movement which was prevalent between 1860 and 1910.\nWood's work is principally domestic, but he designed several churches and small commercial buildings. He worked as an individual designer, mostly with only one assistant, and confined himself to the smaller type of building that he could control personally. Although he was active in Manchester for over twenty years, most of his work is in nearby towns, such as Rochdale, Oldham and Middleton (of which he was native), and in outlying districts such as Bramhall and Hale.\nHe contributed to Manchester in various ways. He was a founder of the Northern Art Workers' Guild in 1896, one of the major provincial societies within the Arts and Crafts Movement and was president of the Manchester Society of Architects from 1911 to 1912. Wood retired in 1921 and twenty one of his architectural works are listed.", "link_mentions": [{"page": "Arts and Crafts movement", "response": ["* Edgar Wood Centre – Manchester, England – 1905"]}, {"page": "Charles Holden", "response": ["In 1895 and 1896 Holden submitted designs to Building News Designing Club competitions using the pseudonym \"The Owl\". Although the number of competing submissions made was not always large, from nine competition entries, Holden won five first places, three second places and one third place. In 1897, he entered the competition for the RIBA's prestigious Soane Medallion for student architects. Of fourteen entries, Holden's submission for the competition's subject, a \"Provincial Market Hall\", came third. Holden described the design as being inspired by the work of John Belcher, Edgar Wood and Arthur Beresford Pite.Holden, draft letter to John Betjeman, quoted in ."]}, {"page": "Altrincham", "response": ["Royd House was built between 1914 and 1916, by local architect Edgar Wood, as his own residence. It has a flat concrete roof, a concave façade, and is faced in Portland red stone and Lancashire brick. It is regarded as one of the most advanced examples of early 20th-century domestic architecture, and is referenced in architectural digests. It has been a Grade I listed building since 1975, one of six such buildings in Trafford. The Grade II listed clock outside the main transport interchange was built in 1880."]}, {"page": "Hale, Greater Manchester", "response": ["Royd House is situated on Hale Road. The house was designed by architect Edgar Wood and built for himself as his home. It is regarded as one of the most advanced examples of early-20th century domestic architecture and is referenced in a number of architectural digests. Royd House is a Grade I listed building."]}, {"page": "Middleton, Greater Manchester", "response": ["Several of Middleton's buildings were designed by Edgar Wood, a local-born influential architect of his day. Several in Middleton are landmarks and are notable."]}, {"page": "Longsight", "response": ["thumb|Former First Church of Christ, Scientist by Edgar Wood thumb|right|Slade HallThe area of Longsight contains many of the notable buildings of Victoria Park. Daisy Bank Road is a particularly good example, featuring Edgar Wood's Grade I listed First Church of Christ, Scientist and the Edwardian art nouveau Chadlington House, as well as the residences of Charles Hallé and Emmeline Pankhurst. Pankhurst's family house is also situated on the edge of Longsight at Plymouth Grove."]}, {"page": "Raymond Unwin", "response": ["In 1893 he married Richard Barry Parker's sister Ethel, and formed a partnership in 1896 based in Buxton, Derbyshire. The partners preferred the simple vernacular style and made it their aim to improve housing standards for the working classes. They were also members of the Northern Art Worker's Guild and were close friends of Edgar Wood (1860–1935) the leading Arts and Crafts architect in the North of England and a founding member of the group."]}, {"page": "Hale Barns", "response": ["Halecroft Park is near the centre of Hale Barns and was crowned North West region winner in the prestigious 'Britain's Best Park' competition. Designed by Edgar Wood, the ornamental gardens of Halecroft Park were created in 1891 as part of Halecroft House. The park was winner of the Green Flag Award 3 years running (2003–2006) for setting a standard for parks and green spaces in England and Wales. "]}, {"page": "Victoria Park, Manchester", "response": ["thumb|Edgar Wood building", "The area has over 20 listed buildings and among its many significant buildings is the notable Grade I listed First Church of Christ, Scientist (now the Edgar Wood Centre) in Daisy Bank Road, the work of the Middleton architect Edgar Wood. Also of significance are Summerville on Daisy Bank Road; Hirstwood by Edward Salomons; Alfred Waterhouse's Xaverian College; and St Chrysostom's Church, the Anglican parish church designed by George T Redmayne at the corner of Oxford Place and Anson Road. St Chrysostom's Church backs onto the University of Manchester's oldest hall of residence, Dalton-Ellis Hall. Redmayne was the architect of the original Dalton Hall."]}, {"page": "Lindley, Huddersfield", "response": ["The Lindley Clock Tower is the most prominent landmark in Lindley, Lindley Clock Tower standing at the junction between Lidget Street and Daisy Lea Lane.  This Art Nouveau clock tower was designed by the Manchester architect Edgar Wood in 1900 and erected by James Nield Sykes JP, in 1902.  The tower also features four buttress figures, four gargoyles and four friezes. The top of the tower is accessible via the doorway at its foot."]}, {"page": "Garage (residential)", "response": ["The architecture of garages was ignored in the architectural journals despite famous architects such as Edwin Lutyens, Richard Barry Parker and Edgar Wood all designing garages for their wealthy clients. Charles Harrison Townsend was one of the few architects who put pen to paper (in The Builder in 1908) on the subject and recommended that the walls be glazed brick for ease of washing, air gratings to be low (petrol fumes are heavier than air), and drains half open to avoid build-up of gases."]}, {"page": "Marco Almaviva", "response": ["Almaviva was born in Novi Ligure (Province of Alessandria, Italy). His father, Armando Vassallo, a leading sculptor of the 20th-century style, the first teacher and close friend of Francesco Messina, was one of the most representative of the close of figurativists who shone by their research potential and originality, mostly inspired by the classicism and archaic/modernizing that were supreme in 1930s Italy .F. Sborgi, Vicende alternative all'interno degli Anni Venti, in La scultura a Genova e in Liguria III, Il Novecento, Carige, Genova, 1989, pp. 82-85. By the time Vassallo moved from Genoa to Novi, he had taken part in two Venice Biennals (1928 and 1930), and the 1925 Exposition des Arts Décoratifs in Paris; he had established relationships and worked with major exponents of art and culture, from Adolfo Wildt to Arturo Martini, from Edgar Wood to Rino Valdameri, Giovanni Pastrone and Gabriele D'Annunzio, on the poster of the major film Cabiria. By this time, Vassallo had already begun to express dissent with fascist regime as far as art was concerned, and this was to lead to him openly criticising its leaders and his consequent exclusion from the public exhibition circuit. Vassallo's last showing was in September 1933 together with Arturo Martini, with whom he shared the pressing need to Italian art and sculpture.\"La II mostra d'arte\", Il Secolo XIX, January 30, 1933, p. 3."]}, {"page": "Architecture of Manchester", "response": ["The Church of Christ, Scientist in Fallowfield, designed by Edgar Wood opened in 1907. Nikolaus Pevsner considered it \"the only religious building in Lancashire that would be indispensable in a survey of twentieth century church design in all England.\" and \"one of the most original buildings of that time in England, or indeed anywhere.\""]}, {"page": "Royd House", "response": ["Royd House is a Grade I listed building in Hale, Greater Manchester. It was designed by architect Edgar Wood as his own home and was built between 1914 and 1916. The building is regarded as one of the most advanced examples of early twentieth century domestic architecture. It is one of six Grade I listed buildings in Trafford."]}, {"page": "List of British architects", "response": ["*Edgar Wood (1860–1935)"]}, {"page": "Edgar Wood Centre", "response": ["The Edgar Wood Centre is a former Church of Christ, Scientist building in Fallowfield, Manchester, England. The church was designed by Edgar Wood in 1903. Nikolaus Pevsner considered it  \"the only religious building in Lancashire that would be indispensable in a survey of twentieth century church design in all England.\" It is a Grade I listed building and has been on the Heritage at Risk Register published by Historic England.", "The building was designed by the architect Edgar Wood for the Christian Scientists' first church in Britain.  Construction began in 1903–4.  A shortage of space and money led to modifications to the design, and further work took place in 1905–7.", "thumb|left|Edgar Wood Centre: the gateway", "It was designed by Edgar Wood in Expressionist style with Art Nouveau details, and later used as offices.  It is in red brick, partly rendered, with a slate roof.  The building has a Y-shaped plan, with a main range and two splayed wings, and with a cylindrical turret with a conical roof in an angle.  In the gable end is a semicircular-headed doorway with splayed sandstone sides, above which is a cruciform-shaped window.  At the other end is a porch with a segmental-headed arch.  In the roof are tall dormer windows. ", "The church closed in 1971 and was heavily vandalised before reopening as the Edgar Wood Centre in 1975.  In turn, this closed in 2003, and the building is currently used as a Universal Church of the Kingdom of God centre. It was placed on the English Heritage Register of Buildings at Risk 2007, but is no longer listed as \"At Risk.\" The church is a Grade I listed building since 18 December 1963.  Most of the furnishings and stained glass have been removed.", "First Church of Christ, Scientist (Manchester) (now Edgar Wood Centre)", "First Church of Christ, Scientist (Manchester) (now Edgar Wood Centre)", "First Church of Christ, Scientist (Manchester) (now Edgar Wood Centre)", "First Church of Christ, Scientist (Manchester) (Edgar Wood Centre)", "First Church of Christ, Scientist (Manchester) (Edgar Wood Centre)", "First Church of Christ, Scientist (Manchester) (now Edgar Wood Centre)"]}, {"page": "Halecroft", "response": ["Halecroft is a Grade II* listed building in Hale, Greater Manchester (). The building was designed by architect Edgar Wood and was built in 1890; it is an example of Wood's work influenced by the Arts and Crafts Movement. It is one of 11 Grade II* listed buildings in Trafford. Halecroft is two storeys high with a one-storey 20th century extension."]}, {"page": "Manchester School of Painters", "response": ["Jackson was a good friend of the Middleton born architect, Edgar Wood and through his influence he became involved in the Arts and Crafts Movement and mural painting. In 1892 Jackson designed a murial entitled Seedtime and Harvest for the Old Road Unitarian Chapel, thumb|upright=0.70|Hand Loom Weaver, Manchester Art Gallery "]}, {"page": "St Anne's Academy", "response": ["* Edgar Wood, architect"]}, {"page": "Emmanuel Hoyle", "response": ["Hoyle purchased the Banney Royd mansion,  on a seven-acre estate in Edgerton, Huddersfield, in 1918; it had been built in 1902, for local accountant W H Armitage, to the designs of architect Edgar Wood. Hoyle died in May 1939, aged 72, when the baronetcy became extinct. At the time of his death Joseph Hoyle and Sons employed 2,000 people."]}, {"page": "Richard Harding Watt", "response": ["The author of a citation in the National Heritage List for England describes the Knutsford houses as \"a series of eccentric buildings which are of considerable interest and importance\" which \"transformed the townscape of Knutsford\".  The architectural historians Nikolaus Pevsner and Edward Hubbard state that \"any Royal Fine Art Commission now would veto such monstrous desecration of a small and pleasant country town\".  Yet they accept that younger critics might dub him \"the Gaudí of England\".  They describe his motifs as a mixture of Classical, Italianate, Byzantine, and \"Unprecedented\", and comment on his liking for towers with a jagged outline, domes, and random fenestration.  The authors of the later edition of the Buildings of England series refer to \"his penchant for scrounging bits of demolished buildings and putting them together in novel and exotic-looking ways\".  However they express the opinion that some of his works equate to those of Edgar Wood and Charles Rennie Mackintosh."]}, {"page": "Grade I listed buildings in Greater Manchester", "response": ["The oldest Grade I listed structure in Greater Manchester is the Parish Church of St Mary the Virgin in Eccles, completed in the 13th century but greatly expanded since then. There are eight listed manor houses, the earliest of which date from the 14th century;  Wardley Hall, still in use today as the residence of the Roman Catholic Bishop of Salford, has the preserved skull of St Ambrose Barlow – one of the Forty Martyrs of England and Wales – on display in a niche at the top of the main staircase. Three buildings are attributed to engineer George Stephenson. One of them, Liverpool Road railway station, is the oldest surviving railway station in the world. The newest Grade I listed building in Greater Manchester is Royd House, built and designed by Edgar Wood in 1916 as his residence. Twenty-two buildings, almost half of the total, were completed in the ."]}, {"page": "Gaskell Memorial Tower and King's Coffee House", "response": ["The statue was designated as a Grade II* listed building on 18 January 1949. Grade II* is the middle of the three grades of listing designated by English Heritage, and is granted to \"particularly important buildings of more than special interest\".  The architectural historian Nikolaus Pevsner did not know what to make of Watt's works.  He described Watt's buildings in Knutsford as a \"monstrous desecration of a small and pleasant country town\", yet conceded that younger critics might call him the \"Gaudí of England\".  Referring specifically to the tower and former coffee house he criticised its \"remorseless imposing of crazy grandeur on poor Knutsford\".  Later writers have been kinder.  Hartwell et al. in the Buildings of England series consider that Watt's houses elsewhere in the town show him to be the equal of Edgar Wood and Mackintosh.  Describing the tower and former coffee house they comment that they \"may floor the unwary\"."]}, {"page": "Listed buildings in Burnley", "response": ["|A house designed by Edgar Wood with Modernist, Arts and Crafts, and Vernacular Revival features.  It is in sandstone with a flat concrete roof covered in asphalt.  The house has a square plan, with a wing at the rear, in two storeys and with three bays on each side.  Three steps lead up to the doorway, which has a shallow canopy, and to the right is a two-storey canted bay window.  The windows are mullioned, some also with transoms, and around the top of the house is a parapet with flat coping containing pairs of small flat-headed openings, and raised over the bay window.", "|The wall was designed by Edgar Wood.  It is in sandstone, it is about  high and raised at the ends, and has a flat coping.  At the left end is a round-headed doorway."]}, {"page": "Listed buildings in Oldham", "response": ["|Built as a solicitors' office, and designed by Edgar Wood, it has an ashlar front, it is in brick at the rear, and has a stone flagged roof and weatherboarding in the gables.  There are two storeys, and three bays separated by pilasters.  Above the central doorway is a large Art Nouveau panel including a thrusting keystone and carvings of trees, and in the upper floor are three small windows.  The outer bays have a five-light mullioned and transomed window with a segmental head in each floor.  In the roof are three gabled dormers, and at the rear is a two-storey canted bay window with a parapet."]}, {"page": "Listed buildings in Heywood, Greater Manchester", "response": ["Heywood is a town in the Metropolitan Borough of Rochdale, Greater Manchester, England, and it is unparished.  The town and the surrounding countryside contain 18 listed buildings that are recorded in the National Heritage List for England.  Of these, two are listed at Grade II*, the middle grade, and the others are at Grade II, the lowest grade.  Until the coming of the Industrial Revolution the area was rural, and during the 19th century cotton mills were built.  The earliest listed buildings are a house and a farmhouse with farm buildings.  The later listed buildings include cotton mills and a chimney, churches and associated structures, a railway warehouse, a library, a house designed by Edgar Wood, and two war memorials.", "|A house by Edgar Wood in brick with sandstone dressings and a stone-slate roof.  It has two storeys, four bays, and a garage at the northeast.  In the corner is a recessed porch with a semicircular opening.  The gables are coped, with the coping extending to the front as a parapet.  The windows on the front are casements with mullions and transoms, and there are canted bay windows on the right side and at the rear."]}, {"page": "Listed buildings in Middleton, Greater Manchester", "response": ["Middleton is a town in the Metropolitan Borough of Rochdale, Greater Manchester, England, and it is unparished.  The town and the surrounding countryside contain 44 listed buildings that are recorded in the National Heritage List for England.  Of these, one is listed at Grade I, the highest of the three grades, seven are at Grade II*, the middle grade, and the others are at Grade II, the lowest grade.  Until the coming of the Industrial Revolution Middleton was a village, then came the industries of silk, cotton and coal.  The oldest listed buildings consist of a church and vicarage, country houses, a school, a public house, and a bridge.  The Rochdale Canal passes through the area, and locks and a bridge on it are listed.  The later listed buildings include more churches, houses and schools, a drinking fountain, a bank, a club, a cotton mill, a park feature, and war memorials.  The architect Edgar Wood lived in the town and he, sometimes with his partner Henry Sellars, designed some of the later listed buildings.", "|The school, designed by Edgar Wood, is in brick with a slate roof and a tile crested ridge.  There are two storeys and 20 bays with four bays later added to each end.  In the ground floor is an arcade with eight round-arched openings, and in the upper floor is a hall.  The outer bays and the additions are gabled, and the windows are casements.  At the rear are two porches, and in the roof are four dormers.", "|The drinking fountain was designed by Edgar Wood, and was relocated in the late 20th century.  It is in gritstone and brick, and has is a central pier on a brick base with a semicircular arch passing through it. The pier has a moulded cap with dome finials on the corners.  In the base are two stone troughs for horses and dogs.", "|The church, later used for other purposes, was the first church designed by Edgar Wood.  It is in red brick with decoration in orange and yellow brick, it has roofs of Welsh slate, and consists of a main body and flanking lower aisles.  The entrance front has a round-headed arch above which is an arcade of nine round-arched windows, and it is flanked by pilasters with bands of red and yellow brick.  At the top is a gable with chequerwork decoration.  The aisles are also gabled with decoration in the gables, and contain three arched windows.  All the gables have finials.  Along the sides are eight bays with lancet windows.", "|A pair of houses by Edgar Wood in brick with rendered upper floors, stone dressings and a clay tile roof.  They have two storeys with attics, four bays and a rear wing.    In the outer bays are two-storey canted bay windows containing mullioned windows, also with transoms in the ground floor.  The doorway has an elliptical head with brick and stone voussoirs.  The first two bays are gabled, and there is a dormer in the roof of the fourth bay.  In the left return is a large porch.  The garden wall has alternating brick and Portland stone, iron-railed sections and two gate portals with ogee lintels.", "|A terrace of four houses by Edgar Wood in common brick with dressings in red engineering brick and a slate roof.  They have two storeys, and consist of two inner houses, and two outer houses with an L-shaped plan and gables protruding forward.  The entrances to the outer houses are in porches on the sides, and at their fronts is a canted bay window.  The inner houses have a bay window in the angles, there is a double doorway with a flat porch.  Above all the porches is a small segmental fanlight.", "|A pair of semi-detached houses by Edgar Wood, and containing early Art Nouveau features, they are in Ruabon brick with terracotta dressings, and have roofs of Welsh and Westmorland slate with blue ridge tiles.  They consist of a central three-storey cross-wing flanked by two-storey blocks with attics.  The central block is gabled with finials and has canted corners.  Each side block has a recessed entrance bay, outside which is a gabled bay with a two-storey bow window and a Diocletian window in the attic.  Most of the windows are replacement casements.", "|The bank, designed by Edgar Wood, is faced with pink terracotta and has a tiled roof.  It has three storeys and three gabled bays.  The main doorway has a round arch, a blocked archivolt and coat of arms above.  Also in the ground floor are two secondary doorways and three mullioned and transomed windows.  The windows in the upper floors are also mullioned and transomed.", "|The church and associated buildings were designed by Edgar Wood and are arranged around a courtyard garden.  The church is in brick on a stone plinth, with stone dressings, buttresses, and a stone-slate roof with coped gables and a finial, and consists of a nave and aisles.  At the west end facing the street is a five-light arched window, to the left is a porch and an archway linking to the school.  Around the rest of the courtyard are one and two storey buildings with casement windows and a canted bay window.", "|A pair of houses by Edgar Wood in brick on a projecting plinth with stone dressings, quoins, and a stone-slate roof.  There are two storeys with attics, four bays, and a rear wing.  The central doorways have flat hoods, fanlights, and moulded lintels.  In the outer bays are canted bay windows, on the left bay with two storeys, and on the right bay with one, and in the roof are two gabled dormers.", "|Originally a photographic studio, later converted into a house, it was designed by Edgar Wood, and is in brick with a tiled roof.  It has two storeys and three bays.  On the front the left bay projects forward, it has a flat roof in reinforced concrete and a stone-capped parapet.  The entrance is in this bay and has a large wooden canopy.  The windows are casements, that in the right part of the ground floor with ten lights.  The left return is gabled and has a two-storey canted bay window.  At the rear is a two-storey two-bay extension with a canted bay window and a six-light oriel window.", "|The house, designed by Edgar Wood and Henry Sellers, is in brick with a flat roof in reinforced concrete.  It has two storeys and three bays, with a later extension to the rear and a garage to the left.  The central doorway has a round-headed fanlight with a dentilled transom.  To the left is a two-storey canted bay window, and the windows are mullioned, also with transoms in the ground floor.  At the top is a stone-coped parapet.", "|Designed by Edgar Wood, the structure is in sandstone, and consists of 21 steps leading up to a semicircular enclosure with seats and an inscription.", "|A row of three shops by Edgar Wood and Henry Sellers in brick with tiles and a flat reinforced concrete roof.  They have two storeys and in the ground floor are replaced shop fronts.  In the upper floor each shop has mullioned windows flanked by tiled pilasters, above which is a tiled white panel with chevrons in green tiles, rising to form a parapet.", "|The surviving part of a school by Edgar Wood and Henry Sellers.  It is in brick with dressings in Portland stone and a flat roof in reinforced concrete, and consists of a central hall with classrooms to the north, south and east.  There is a single storey, a six-bay central section, and a lower three-bay range to the east.  At the east end of the hall is a tower-like chimney with pilastered corners.  The boundary walls, railings, gate piers and the arched entrance gateway are included in the listing.", "|The school was designed by Edgar Wood and Henry Sellers, and is in brick with dressings in Portland stone and concrete roofs.  There is a central nine-bay hall with a tower at each end.  Cloisters extend forward to the entrances on the street, and they enclose a single-storey office block with a concave front and a garden.  Behind the hall are ranges of classrooms.  The hall has a hipped roof and round-arched windows with impost blocks and keystones.  The entrances on the street have rusticated arches and banded corner pilasters.", "|The club was designed by Edgar Wood and is in brick with concrete dressings and a roof of Westmorland green slate.  It has one storey and six bays, the sixth bay being larger and canted, and a flat-roofed porch at the south.  The first five bays contain round-headed windows, and the sixth bay has rectangular windows."]}, {"page": "Listed buildings in Rochdale", "response": ["|The chapel was designed by Edgar Wood in Arts and Crafts style, and was extended in 1902 and later.  It is in red brick with stone dressings, quoins and bands, and has a T-shaped plan.  In the gabled entrance front, steps lead up to a round-headed doorway, above which is a panel and seven stepped lancet windows.  The gable apex is rendered and decorated with a sculpted Tree of Life.  Flanking the doorway are sloping buttresses.  Along the south side is a single-storey extension, with a projecting gable at the east end and a two-storey cross-wing at the west.", "|A house by Edgar Wood, with elements of Vernacular architecture, in rendered brick with stone dressings and a tiled roof.  It has two storeys, four bays, and a projecting single-storey rear wing to the left.  The first bay contains a flat-headed archway leading to the rear, and above it is a mullioned oriel window.  In the second bay are sloping projecting bricks and stepped windows reflecting the staircase, and the third bay contains a projecting gabled wing with an elliptical-headed doorway, a dated lintel, mullioned and transomed windows, and decorative bargeboards.  In the right bay is a diagonally-set Tudor-style two-storey bay window."]}, {"page": "Listed buildings in Hale, Greater Manchester", "response": ["Hale was originally a rural area, but with the coming of the railway in 1849, it grew and became a commuter area for Manchester.  The village became the home for Edgar Wood, an architect who designed buildings in the Arts and Crafts style.  The house he designed for himself is listed, together with a number of other houses he designed.  Other similar houses were designed by John N. Cocker, who was influenced by Wood, and these too are listed.  Most of the earlier listed buildings are houses and associated structures, farmhouses, farm buildings, a chapel, and a Sunday school.  The railway station was rebuilt in about 1886, and its platform buildings and footbridge are listed.  The other listed buildings include a church and two war memorials.", "|A detached house by Edgar Wood, it is in brick, partly rendered, on a stone plinth, with stone dressings, quoins, buttresses, and a red clay tile roof.  There are two storeys with attics, a five-bay front, a single-storey wing at the rear, and a 20th-century extension to the left.  At the left corner is a diagonally-set two-storey bay window.  On the front are three unequal gables with bargeboards, one pargetted with a weathervane, another tile-hung with a finial.  The doorway has a Tudor arched head above which is an elaborate cartouche, and the windows are mullioned, some also with transoms.", "|A brick house by Edgar Wood with stone dressings and a stone-slate roof.  It has an asymmetrical plan, two storeys with attics, three bays, and a later rear extension.  The left bay has a two-storey canted bay window, and there is a single-storey canted bay window in the right bay.  In the right gable end is a doorway that has a semicircular head with a keystone, and above it is an upper floor room that is gabled and weatherboarded.  The windows are mullioned, some with transoms.", "|A brick house by Edgar Wood with a stone-slate roof, an asymmetrical plan, and two storeys with attics.  There are four bays, a single-storey diagonal wing, and a three-storey canted tower with a coped gable.  There is a hipped porch, two gables, and mullioned windows, one also with a transom, and on the left side is a two-storey canted bay window.", "|A brick house by Edgar Wood with a clay tile roof and crested ridge tiles, an asymmetrical plan, two storeys with attics, and three bays.  In the left bay is a projecting gabled wing with a bow window, and in the centre bay is a gabled porch with a semicircular-headed doorway.  In the right return is a two-storey canted bay window.  The windows are mullioned, some with transoms.", "|A brick house by Edgar Wood with a blue slate roof, two storeys, and a projecting semi-octagonal wing at the left.  There is a central single-storey porch with a hipped roof on timber columns with balustrading and a semicircular doorway.  In the left gable end is a polygonal bay window and a garage.  The windows are casements, and there is a dormer window.", "|A brick house by Edgar Wood that has a stone-slate roof with coped gables, an asymmetrical plan, two storeys, and a long left single-storey wing on the left.  The front has two gables, a two-storey canted bay window to the left and a doorway to the right with a stone surround and a flat hood, and a segmental lunette above it.  There are canted bay windows in the right return and in the wing, and the windows are mullioned, some also with transoms.", "|A brick house by Edgar Wood that has a stone-slate roof with coped gables.  There is an asymmetrical plan, two storeys, and three bays.  The central bay projects, it is gabled, and has a doorway with a dentilled architrave and a flat hood.  In the left return is a two-storey canted bay window.  The windows are mullioned, some with transoms.", "|A house, later apartments, by Edgar Wood in brick with stone dressings, thin stone quoins, and a clay tile roof.  It has an asymmetrical plan, two storeys with attics, and three bays.  The central bay projects, and contains a hipped porch.  There are two canted bay windows, one in the left gable with two storeys, and the other at the rear with one storey.  The windows are casements, some with transoms.", "|The house was designed by Edgar Wood for his own use.  It is in brick with coped stepped parapets, moulded brick corners, and a flat concrete roof.  The house has two storeys, a Y-shaped plan with the base at the rear, and has three concave sides.  There is a recessed porch with plain columns, a coffered ceiling, and above it is a mullioned window set in a coloured tile panel, and there are mullioned and mullioned and transomed windows elsewhere.  At the rear, which is flat, are three bays with a central canted bay window and a pierced parapet."]}, {"page": "Listed buildings in Manchester-M14", "response": ["|Originally a Christian Science church, it was designed by Edgar Wood in Expressionist style with Art Nouveau details, and later used as offices.  It is in red brick, partly rendered, with a slate roof.  The building has a Y-shaped plan, with a main range and two splayed wings, and with a cylindrical turret with a conical roof in an angle.  In the gable end is a semicircular-headed doorway with splayed sandstone sides, above which is a cruciform-shaped window.  At the other end is a porch with a segmental-headed arch.  In the roof are tall dormer windows.", "|The gateway, designed by Edgar Wood in Art Nouveau style, is in red brick with some sandstone, and has a slate roof.  It consists of a segmental arch with a steep gable containing a small semi-cylindrical oriel window.  At the sides are canted buttresses with flat tops."]}, {"page": "First Church of Christ, Scientist, Brisbane", "response": ["Early examples of this evolution in design include the 1910 First Church in Berkeley, California designed by renowned architect Bernard Maybeck. Other outstanding examples, in the UK and Europe, include the First Church (1903) in Manchester England, an Arts and Crafts design by Edgar Wood; the First Church in The Hague, a modernist design by Hendrik Berlage (1925); Salvisberg's First Church (1936) in Basel, and Hans Hofmann's First Church (1938) in Zurich.Ivey, Prayers in Stone, p. 200"]}, {"page": "Listed buildings in Stafford (Outer Area)", "response": ["|A house designed by Edgar Wood, it is in brick with stone dressings, a stone-coped parapet and a concrete roof.  There are two storeys and an attic, and a double depth plan.  The windows are mullioned, and the terrace has a stone-coped wall."]}, {"page": "Listed buildings in Hebden Royd", "response": ["|The lodge was designed by Edgar Wood in Arts and Crafts style. It is in stone and has a stone slate roof with coped gables. There are two storeys, an L-shaped plan, and a front of two bays. In the left bay is an arched carriage entry and a four-light mullioned window above, and the right bay contains a two-storey canted bay window. The doorway in the archway has chamfered jambs and a false keystone. At the rear is an outshut, and a semi-octagonal stair tower."]}, {"page": "Listed buildings in Holme Valley (central area)", "response": ["|The Sunday school was designed by Edgar Wood and James Henry Sellers and has Arts and Crafts features.  It is in stone and has a flat roof and a parapet.  There is a single storey, a bowed front, and sides of six bays.  In the centre of the front is a door in a recessed porch with an architrave, and a tent gable above.  Set back above this is a mullioned and transomed window, over which is an inscription and a decorative parapet."]}, {"page": "Listed buildings in Almondbury", "response": ["|The house, designed by Edgar Wood, is in stone with a stone slate roof and two storeys.  At the west is a coped gable with cut kneelers, in the angle is a wooden porch, and on the south front are two shallow canted bay windows with parapets rising above the eaves.  On the west front are raked buttresses, and a blocked doorway with a fanlight and a semicircular hood.  At the rear is a corbelled chimney and a canted staircase projection with a hipped roof.  The windows have mullions, and some also have transoms."]}, {"page": "Listed buildings in Huddersfield (Greenhead Ward)", "response": ["|The house, which was partly remodelled and extended in 1900 by Edgar Wood, is in stone with a hipped slate roof. There are two storeys, four bays on the front with a shallow canted bay window extending to the left, and the flat-roofed extension on the right. In the third bay, steps with vase-shaped balusters and moulded handrails lead up to a porch with Tuscan pilasters. The extension contains nine small oblong windows on the front and two in the end.", "|The house is in stone and has hipped tile roofs and two storeys, and the windows are mullioned and transomed. It was partly redecorated in 1909 by Edgar Wood and J. Henry Sellars. The external part of the redecoration is a long canted mullioned and transomed window with a parapet and an idiosyncratic moulded pattern.", "|A pair of semi-detached houses on a corner site designed by Edgar Wood, with entrances to both roads. They are in stone with slate roofs, gables and overhanging eaves, and have two storeys and attics. The windows are mullioned and transomed, and there are two two-storey canted bay windows, one with a flat top, and the other rising higher with a parapet. One doorway has a flat top on console-shaped brackets, and the other has attachments in Arts and Crafts style."]}, {"page": "Listed buildings in Huddersfield (Lindley Ward)", "response": ["Lindley is a ward of Huddersfield in the metropolitan borough of Kirklees, West Yorkshire, England.   It contains 122 listed buildings that are recorded in the National Heritage List for England.  Of these, four are listed at Grade II*, the middle of the three grades, and the others are at Grade II, the lowest grade.   The ward is to the northwest of the centre of Huddersfield, and includes the districts of Birchencliffe, Lindley, Oakes, Quarmby, and Salendine Nook.  Most of the ward is residential, with some of the northern part being rural.  In the rural part most of the listed buildings are farmhouses and farm buildings, and in the residential part they are houses and associated structures.  The other listed buildings include mill buildings, two guide stones, a boundary stone, a commemorative cross, a public house, churches, chapels and associated structures, and a clock tower.  The clock tower was designed by Edgar Wood, who had family connections with the area, and a number of the listed buildings in the 1890s and 1900s were designed by him.", "|Additions, including a chancel and a vestry, were made in 1895–96 by Edgar Wood.  The church is in stone with a slate roof, and is in Gothic style.  It consists of a nave with aisles, a transept, a chancel, and a southwest tower.  The tower has a pyramidal roof with a finial.", "|A large house designed by Edgar Wood with Arts and Crafts features and later extended, it is in stone with a stone slate roof and coped gables.  There are two storeys and attics.  On the front is a gabled two-storey porch with ball finials, and above the doorway is a cornice with a decorative cartouche.  To the right is a two-storey canted bay window with a parapet, and the other windows are mullioned and transomed.", "|A terrace of three houses designed by Edgar Wood, they are in stone with overhanging eaves and a stone slate roof.  There are two storeys and each house has two bays, the right bay gabled, and the middle gable the largest.  The doorways are in the left bay, and each has an oblong fanlight, a plain hood, and a shaped lintel.  Above the doorways are two-light casement windows, and the other windows are mullioned and transomed.", "|Designed by Edgar Wood, dwarf walls with coping run along the front of the gardens.  They contain simple stone piers, and simple timber gates.", "|The building was designed by Edgar Wood, and is in stone with a stone slate roof and two storeys.  On the right is a carriage arch with a moulded surround and a hood mould, and above it is a mullioned window and a gable.  Elsewhere are mullioned or mullioned and transomed windows, and the doorway within the archway has a four-centred arched head.  To the left is a single-storey extension and at the rear is a tower with a pyramidal roof.", "|A house designed by Edgar Wood in Neo-Tudor style with art nouveau features, it is in stone and has a stone slate roof with coped gables.  There are two storeys and an irregular plan.  The two-storey porch is gabled with a finial, and has diagonal buttresses with moulded cornices.  The doorway is round-arched with foliage corbels, a decorative keystone, and a deep hood mould.  Above the doorway is a window with a moulded hood mould.  The windows are mullioned and transomed.", "|The clock tower was designed by Edgar Wood, and the sculpture and roof are by Thomas Stirling Lee.  The tower is in stone, and the octagonal pagoda roof is in copper.   The tower has diagonal corner buttresses rising to pinnacles with gargoyles, a semicircular stair turret, a clock face on each side, and an arcade below the eaves.  The doorway has a lintel with an inscription, a central sculpted figure, further sculpted figures to the sides, and another one above.  The windows have art nouveau tracery."]}, {"page": "Listed buildings in Penistone", "response": ["|The former vicarage was designed by Edgar Wood, and is in stone with a stone slate roof.  There are two storeys at the front and three at the rear, and a front of three bays.  The doorway is recessed, with splayed jambs, and a deep lintel.  Over the doorway is a panel with two small lights and the date,  and to the right is a canted bay window.  The other windows are mullioned, some with transoms.  At the rear and on the left return are three-storey canted bay windows, each with a coped gable."]}]}}