{"wiki_id": "http://www.wikidata.org/entity/Q5335564", "itemLabel": "Ed West", "itemDescription": "British author and blogger", "wikipedia_url": "https://en.wikipedia.org/wiki/Ed_West_(journalist)", "wikipedia_page": {"main": "Ed West is a British author, journalist and blogger, who is the deputy editor of UnHerd. He was previously deputy editor of The Catholic Herald and a columnist for The Daily Telegraph and The Spectator. He began his career with the lads mag Nuts Magazine, and has also written for the Evening Standard, The Guardian, The i, The Week, and Spiked.He is the son of British journalist Richard West and Irish journalist Mary Kenny and the brother of the journalist Patrick West.\nWhile working at men's magazines, West wrote a number of short humour books, including one called How to Pull Women (2006), which he later described on his blog for The Daily Telegraph as \"embarrassing.\"West's book, The Diversity Illusion, which examines the adverse effects of mass immigration on British society, was published in April 2013. Reviewing the book, Peter Oborne described West as \"one of the most interesting of the rising generation of political writers, who delights in destroying liberal pieties.\" Oborne also said \"At its worst, though, West's book can come over as an anti-Islamic rant.\" The Observer described the book as a \"brazen and breezily written polemic\" whose \"arguments are repeatedly undermined by reality.\" The Sunday Times included the book in their list of \"Political Books of the Year\". The book's 2015 reissue was chosen as one of The Sunday Times's Political Books of the Year.\nWest's 2020 book Small Men on the Wrong Side of History focuses on the failures of post-war conservativism.", "link_mentions": [{"page": "Mary Kenny", "response": ["Kenny married journalist and writer Richard West in 1974 and the couple raised two children: Patrick and Ed West, both journalists. Richard died in 2015."]}, {"page": "Patrick West", "response": ["He is the son of British journalist Richard West and Irish journalist Mary Kenny, the brother of the journalist Ed West, and cousin of actors Timothy West and Samuel West."]}, {"page": "Richard West (journalist)", "response": ["He was the grandson of the classics scholar Walter Leaf and the great-grandson of poet John Addington Symonds, and was married to the Irish journalist Mary Kenny. His sons, Patrick West and Ed West, are both journalists, and Richard was the first cousin of the actor Timothy West."]}, {"page": "Criticism of multiculturalism", "response": ["Journalist Ed West argued in his 2013 book, The Diversity Illusion, that the British political establishment had uncritically embraced multiculturalism without proper consideration of the downsides of ethnic diversity. He wrote:"]}, {"page": "Big Society", "response": ["The Daily Telegraphs Ed West predicted in 2010 that \"The Big Society can never take off\", placing the blame on the socialist ideology held by some of the British public. Also writing for The Daily Telegraph, Mary Riddell said \"the sink or swim society is upon us, and woe betide the poor, the frail, the old, the sick and the dependent\" whilst Gerald Warner felt that \"of all the Blairesque chimeras pursued by David Cameron, none has more the resonance of a political epitaph than 'Big Society'\". Sir Stephen Bubb, Chief Executive of ACEVO, welcomed the idea of the Big Society but claimed that Cameron was \"undermining\" it. His concerns were about cuts in government money going to charities coming \"too far and too fast\". He later said the project had become a \"wreck\". Steven Kettell of the University of Warwick has written of the intrinsic \"problems surrounding the government's call to put religious groups at the centre of the Big Society agenda\"."]}, {"page": "Norman Dennis", "response": ["The Daily Telegraph news blogger, Ed West, described Dennis as \"a key analyst of late 20th-century British society whose influence, I suspect, will stretch long into the 21st\"."]}, {"page": "Islam: The Untold Story", "response": ["Writing in The Daily Telegraph, Christopher Howse, a commentator on religious issues, was critical of the documentary, awarding it two stars out of five and labelling it \"disjointed\". He argued that it placed too much emphasis on historiography but that its \"crowning annoyance\" was Holland's habit of pausing mid-sentence. In contrast, Ed West, also of The Daily Telegraph, praised the documentary, stating that it was \"atmospheric and intelligent\". Noting it would make many viewers uncomfortable, he argued that the Islamic world had to accept \"higher criticism\" and \"embrace the pain of doubt\" in order to improve life for themselves and for their non-Muslim neighbours."]}, {"page": "The War We Never Fought", "response": ["A month before The War We Never Fought's publication, Ed West in The Daily Telegraph said that the book had provoked criticism not only from the Left, but also from the free-market libertarian Right."]}, {"page": "Ed West", "response": ["Ed West may refer to:", "* Ed West (American football) (born 1961), American football tight end", "* Ed West (fighter) (born 1983), American mixed martial artist", "* Ed West (journalist), British journalist"]}, {"page": "Michael Hanlon", "response": ["Hanlon turned heads, including that of Ed West, when he abandoned his skepticism about global warming.  According to the Daily Telegraph, this followed a visit to the Greenland ice cap when he saw the extent of the melt for himself."]}, {"page": "Blue Labour: Forging a New Politics", "response": ["Rowenna Davis, another veteran Blue Labour contributor, lauds the British peoples’ inherent conservative desires for order, strength, stability and community, which has been ignored by the ‘modernising’ liberal forces of the political establishment. The concessions made to the free market and finance capital, Davis argues, have been antithetical to true small-c conservative values. Ed West elaborates this line of thought more explicitly, noting the negative consequences of the otherwise-noble New Left commitment to the rights of women and sexual and racial minorities. West sees results of this progressivism as including familial breakdown, social fragmentation due to mass immigration, and the elimination of a commitment to socialism."]}, {"page": "Peter Whittle (politician)", "response": ["In 2006 Whittle founded the New Culture Forum (NCF), a think tank whose mission is described as \"challenging the cultural orthodoxies dominant in the media, academia, education, and British culture in its widest sense.\" Speakers at NCF events, including for its annual keynote Smith Lecture, have included Martin Amis, Dame Vivien Westwood, Jeremy Hunt, Michael Gove, Nigel Farage, Justin Webb, Sir Anthony Seldon, Petroc Trelawny, Ed Vaizey, Melanie Phillips, Brendan O'Neill and Owen Jones. Writers for the New Culture Forum have included Douglas Murray, Julie Bindel, Ed West and Dennis Sewell."]}, {"page": "Racism in the UK Conservative Party", "response": ["Amber Rudd was the Home Secretary following Theresa May, and served under May's premiership as Prime Minister. Although Rudd was seen as having a more relaxed attitude towards race and immigration, her 2016 conference speech was criticised by the leader of the Labour Party, Jeremy Corbyn, as fanning \"the flames of xenophobia and hatred\" by forcing firms to declare the percentage of foreign workers they employ. LBC radio host James O'Brien likened the speech to Chapter 2 of Adolf Hitler's Mein Kampf; this analogy was criticised by Ed West in The Spectator."]}, {"page": "55 Tufton Street", "response": ["New Culture Forum (NCF) is a right wing think tank, founded and directed by Peter Whittle and advised by Matthew Elliott, whose mission is described as \"challenging the cultural orthodoxies dominant in the media, academia, education, and British culture in its widest sense.\" Speakers at NCF events, including for its annual keynote Smith Lecture, have included Martin Amis, Dame Vivien Westwood, Jeremy Hunt MP, Michael Gove MP, Nigel Farage MEP, Justin Webb, Sir Anthony Seldon, Petroc Trelawny, Ed Vaizey MP, Melanie Phillips, Brendan O'Neil and Owen Jones. Writers for the New Culture Forum have included Douglas Murray, Julie Bindel, Ed West, and Dennis Sewell."]}, {"page": "UnHerd", "response": ["The site's columnists include Giles Fraser, Ed West, Tanya Gold, John Gray, James Bloodworth, Matthew Goodwin, Maurice Glasman, Julie Bindel, Michael Tracey, and Douglas Murray."]}, {"page": "Small Men on the Wrong Side of History", "response": ["#REDIRECT Ed West (journalist)"]}]}}