{"wiki_id": "http://www.wikidata.org/entity/Q5339528", "itemLabel": "Edmund Hakewill-Smith", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Edmund_Hakewill-Smith", "wikipedia_page": {"main": "Major General Sir Edmund Hakewill-Smith,  (17 March 1896 – 15 April 1986) was a senior British Army officer who served in both the First and Second World Wars.", "link_mentions": [{"page": "Albert Kesselring", "response": ["Kesselring's own trial began in Venice on 17 February 1947.von Lingen, Kesselring's Last Battle, p. 109. The British military court was presided over by Major General Sir Edmund Hakewill-Smith, assisted by four lieutenant colonels. Colonel Richard C. Halse—who had already obtained the death penalty for von Mackensen and Mälzer—was the prosecutor.von Lingen, Kesselring's Last Battle, p. 107. Kesselring's legal team was headed by Hans Laternser, a skilful German lawyer who specialised in Anglo-Saxon law, had represented several defendants at the Nuremberg Trials, and later represented Generalfeldmarschall Erich von Manstein. Kesselring's ability to pay his legal team was hampered because his assets had been frozen by the Allies, but his legal costs were eventually met by friends in South America and relatives in Franconia.von Lingen, Kesselring's Last Battle, pp. 92–96."]}, {"page": "52nd (Lowland) Infantry Division", "response": ["The division was briefly deployed to France, following the Dunkirk evacuation, as part of the Second British Expeditionary Force (2BEF) to cover the withdrawal of Allied forces near Cherbourg during Operation Ariel.Chappell, p. 34 The division returned to the United Kingdom and, like most of the rest of the British Army after Dunkirk, began training to repel an expected German invasion, which never occurred. From May 1942 until June 1944, the 52nd was trained in a mountain warfare capacity, originally for a proposed invasion of Norway. However, the division was never employed in this role. Following June 1944, the 52nd Division was reorganised and trained in airlanding operations. As part of this new role, the division was transferred to the First Allied Airborne Army. By this time, the 52nd Division was under the command of Major-General Edmund Hakewill-Smith.", "|Brigadier Edmund Hakewill-Smith (acting)", "|Major-General Edmund Hakewill-Smith", "|Major-General Edmund Hakewill-Smith(GOC Lowland District)"]}, {"page": "Neil Ritchie", "response": ["After being replaced as the Eighth Army commander Ritchie was, from September 1942, appointed to command the 52nd (Lowland) Infantry Division.Mead, p. 387 The division was then being trained in mountain warfare, in the United Kingdom, and relinquished command to Major-General Edmund Hakewill-Smith in November 1943."]}, {"page": "Battle of the Scheldt", "response": ["As part of his newly focused efforts to assist Simonds, Montgomery assigned the 52nd Lowland Division of the British Army to the First Canadian Army.Copp & Vogel, 1985 page 56. The 52nd division, recruited in the Lowlands of Scotland, was a mountain division, requiring men with unusual strength and stamina in order to fight in the mountains, making it into something of an elite division within the British Army. Simonds greatly appreciated having the Lowlanders under his command and told Major-General Edmund Hakewill-Smith that the 52nd was to play the decisive role in taking Walcheren island. As such, Simonds ordered Hakewill-Smith to start preparing an amphibious operation as Simonds planned to land the 52nd division on Walcheren at the same time the Canadians attacked the island."]}, {"page": "Military Knights of Windsor", "response": ["*1951: Major-General Sir Edmund Hakewill-Smith, KCVO CB CBE MC"]}, {"page": "Operation Blackcock", "response": ["Operation Blackcock was an operation to clear German troops from the Roer Triangle, formed by the towns of Roermond and Sittard in the Netherlands and Heinsberg in Germany during the fighting on the Western Front in the Second World War.Operation \"Blackcock\" It was conducted by the British Second Army between 13 and 26 January 1945. The objective was to drive the German 15th Army back across the rivers Roer and Wurm and move the frontline further into Germany. The operation was carried out by Lieutenant-General Neil Ritchie's XII Corps by three divisions: the 7th Armoured Division (Major-General Lewis Lyne), the 43rd (Wessex) Infantry Division (Major-General Ivor Thomas) and the 52nd (Lowland) Infantry Division (Major-General Edmund Hakewill-Smith). The operation, named after the Scottish black male grouse, is relatively unknown despite the sometimes fierce battles that were fought for each and every village and hamlet within the Roer Triangle.British Report about Operation Blackcock (PDF, 74 pages)"]}, {"page": "Constables and Governors of Windsor Castle", "response": ["| Major General Sir Edmund Hakewill-Smith || 4 Sep 1964 || 31 Dec 1972 || London Gazette, issue no.39791, 4 September 1964London Gazette, issue no.45868, 2 January 1973"]}, {"page": "Battle of Mughar Ridge", "response": ["During 7–8 November rearguards of the Seventh and Eighth Ottoman Armies delayed the advance of Lieutenant General Harry Chauvel's Desert Mounted Corps, Major General Edmund Hakewill-Smith's (or Major General J. Hill's) 52nd (Lowland) Division, and Major General Philip C Palin's 75th Division.Preston 1921, p. 58 The Desert Mounted Corps consisted of the Anzac Mounted Division (Major General Edward Chaytor), the Australian Mounted Division (Major General Henry W Hodgson) and the Yeomanry Mounted Division (Major General George Barrow). The 52nd (Lowland) Division and 75th Division formed part of Lieutenant General Edward Bulfin's XXI Corps."]}, {"page": "John Aldam Aizlewood", "response": ["He served in World War I on the Western Front and was awarded the Military Cross twice while serving with the Machine Gun Corps. After the war he became a Brigade Major in India in 1927 and attended the Staff College, Quetta from 1932 to 1933, alongside future generals John Grover and Edmund Hakewill-Smith. From 1938 to 1939 he was Commanding Officer of the 4th/7th Royal Dragoon Guards."]}, {"page": "General Smith", "response": ["*Sir Edmund Hakewill-Smith (1896–1986), British Army major general"]}, {"page": "Sir Edmund Hakewill-Smith", "response": ["#REDIRECT Edmund Hakewill-Smith"]}, {"page": "Edmund Smith", "response": ["*Edmund Hakewill-Smith (1896–1986), South African-born British General"]}, {"page": "Hakewill", "response": ["* Edmund Hakewill-Smith (1896–1986), South African-born British General"]}, {"page": "1944 Birthday Honours", "response": ["*Colonel (temporary Major-General) Edmund Hakewill-Smith, , (13349), late The Royal Scots Fusiliers."]}, {"page": "List of Knights and Dames Commander of the Royal Victorian Order appointed by Elizabeth II (1952–77)", "response": ["|Edmund Hakewill-Smith, CB, CBE, MC"]}, {"page": "Evacuation of Novorossiysk (1920)", "response": ["On the night of March 26, in Novorossiysk warehouses were burning, and tanks with oil and shells were exploding. The evacuation was conducted under the cover of the second battalion of the Royal Scots Fusiliers under command of Lieutenant-Colonel Edmund Hakewill-Smith and the Allied squadron commanded by Admiral Seymour, which fired towards the mountains, preventing the Reds from approaching the city."]}]}}