{"wiki_id": "http://www.wikidata.org/entity/Q5336557", "itemLabel": "Eddie Waring", "itemDescription": "English rugby league coach, commentator and TV presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Eddie_Waring", "wikipedia_page": {"main": "Edward Marsden Waring, MBE (21 February 1910 – 28 October 1986) was a British rugby league football coach, commentator and television presenter.", "link_mentions": [{"page": "I'm Sorry, I'll Read That Again", "response": ["As with Round the Horne, the cast's adventures would sometimes be episodic with cliff-hanger endings each week as with \"The Curse of the Flying Wombat\" (3rd series), and \"Professor Prune And The Electric Time Trousers\" (7th series). Christmas specials normally included a spoof of a traditional pantomime (or several combined). They had few qualms about the use of puns – old, strained or inventive – and included some jokes and catchphrases that would seem politically incorrect by the mid-1990s. Garden's impressions of the legendary rugby league commentator Eddie Waring and the popular Scottish TV presenter Fyfe Robertson, Oddie's frequent send-ups of the game-show host Hughie Green, and Cleese's occasional but manic impressions of Patrick Moore (astronomer and broadcaster) built these people into eccentric celebrities in a way that the Mike Yarwood, Rory Bremner, Spitting Image and Dead Ringers programmes did for other TV presenters with similar disrespect years later."]}, {"page": "Dewsbury", "response": ["*Eddie Waring (1910–1986), rugby league coach, commentator and television presenter."]}, {"page": "List of sports announcers", "response": ["* Eddie Waring – BBC Sport 1951–1981"]}, {"page": "Mike Yarwood", "response": ["* Eddie Waring - rugby league commentator"]}, {"page": "Frank Bough", "response": ["In 1977, Bough was a guest on the Morecambe and Wise Christmas special, performing a song and dance routine in a sailor's outfit with other TV personalities, including film critic Barry Norman, tv presenter Michael Aspel and rugby league commentator Eddie Waring. The programme's 21.3 million viewers remain a British record. Bough later said that he had to give Waring dancing lessons before the sketch, which was based on a comic version of the song \"There is Nothing Like a Dame\" from the musical South Pacific."]}, {"page": "Waring", "response": ["*Eddie Waring (1910–1986), British sports commentator"]}, {"page": "Plug (comics)", "response": ["|A boy obsessed with rugby league, with Randolph, his pet rat (The Original Dirty Rat). His name was a play on Eddie Waring, a popular TV sports commentator at the time."]}, {"page": "It's a Knockout", "response": ["It featured teams representing a town or city competing tasks in absurd games, generally dressed in large foam rubber suits. Games were played in the home town's park, with weather often turning grassland into mud. The team scoring most points would advance to the next stage. Teams could double points in one round by choosing to \"play their Joker\". The games were originally refereed by Rugby League's Eddie Waring but eventually refereed by former international football referee Arthur Ellis from 1969 to 1982.", "In the United Kingdom, participants came from the heats of It's a Knockout. The original presenter was McDonald Hobley, but he stayed for just one series before handing over to Katie Boyle, who in turn was replaced by David Vine and Eddie Waring. It was not until 1971 that the presenter most associated with the role, Stuart Hall, took over presenting the UK heats and also provided the British commentary for the international version along with Waring, who was better known as the BBC's Rugby League commentator."]}, {"page": "Cec Thompson", "response": ["Thompson took up rugby league when working near Hunslet. In 1951, the rugby commentator Eddie Waring wrote: \"If Cec Thompson is not chosen for the Great Britain squad to face New Zealand, the selectors must be racists.\" Four years after his potential was spotted by a Hunslet scout, he played for Great Britain in 1951, only the second black player to do so (the first was Roy Fisher). However, his debut in the game with New Zealand was headlined in the Daily Herald as \"Hunslet's Darkie one of Britain's heroes.\" In 1953, he transferred to Workington Town in Cumbria."]}, {"page": "List of Monty Python's Flying Circus episodes", "response": ["**featuring Cardinal Richelieu as Petula Clark; Julius Caesar as Eddie Waring; Florence Nightingale as Brian London; Ivan the Terrible as a sales assistant at Freeman, Hardy and Willis; W. G. Grace as a music box; Napoleon as the R101 disaster; and John the Baptist as Graham Hill"]}, {"page": "Brian Cant", "response": ["Cant also appeared in television series for adults. In the 1960s he appeared in two Doctor Who stories, in 1965 as Kert Gantry in The Daleks' Master Plan and in 1968 as Tensa in The Dominators. In 1979 he presented the BBC programme The Great Egg Race, and was one of the guest presenters of the 1982 series of the game show It's a Knockout after Eddie Waring retired. In 1998 Cant parodied his previous contributions as a narrator in 'The Organ Gang', a weekly segment in Lee and Herring's This Morning with Richard Not Judy, a BBC TV Sunday afternoon comedy show. He also made three appearances in the BBC1 daytime drama Doctors, each time as a different character, the last in 2011."]}, {"page": "Dewsbury Rams", "response": ["Managed by Eddie Waring, Dewsbury enjoyed huge success during the Second World War when their side was boosted by the inclusion of a number of big-name guest players. Dewsbury won the Wartime Emergency League in 1941–42 and again the following season, though that championship was declared null and void when it was discovered they had played an ineligible player. They were also runners-up in 1943–44.", "* Eddie Waring 1943-44"]}, {"page": "Bomb (kick)", "response": ["In Australian rugby league, the bomb was popularised by Easts' and Parramatta's John \"Bomber\" Peard in the 1970s. However, by the 1980s, it became increasingly seen as a negative or unexciting tactic, and a rule change was made to lessen its effect: A bomb (or any type of kick) caught on the full in the in-goal area by the defending side now resulted in an automatic 20 metre tap restart, sometimes colloquially known as defusing the bomb. Grubber kicks or cross kicks are now often used in preference to bombing into the in-goal area. In the 1970s the phrase \"up and under\" became associated with Rugby League in Britain, when it became the catchphrase of Eddie Waring,Eric Partridge, Tom Dalzell, Terry Victor.The concise new Partridge dictionary of slang and unconventional, Routledge, 2007, ,  p. 677 an English rugby league coach, commentator and television presenter.Dave Russell. Looking north: northern England and the national imagination, Manchester University Press, 2004, , . p. 260"]}, {"page": "Mark Calderwood", "response": ["Calderwood scored over 40-tries in his first season at the Leeds Rhinos Academy which earned him a call up into the first team during 2001. He made his début against London from the bench in the first match of the season he scored his first try for the Leeds Rhinos in a Challenge Cup semi-final against St. Helens, and went to score 12-tries in the rest of the 2001 season. He also won the Eddie Waring Memorial Award as the best try in the 2001 Challenge Cup. He gained international and representative experience with England and Yorkshire. At the end of the 2001's Super League VI he was selected by John Kear for the England Under-21 tour to South Africa. He scored 4-tries in the first match, when England won 112–6 and a further 2-tries in the second match."]}, {"page": "London and South East Merit League", "response": ["In 1965 Gordon Anderton placed an advert in the London Evening Standard saying that anyone interested in starting a rugby league side should meet at a Hackney pub and from this about half a dozen enthusiasts began to train in the National Sports Centre at Crystal Palace. Brian Blessed was the first coach, training moved to Hackney marshes and within twelve months the London Amateur Rugby League Association was formed, with Eddie Waring as its first president. It was soon renamed the Southern Amateur Rugby League as teams from outside London joined."]}, {"page": "The Goodies and the Beanstalk", "response": ["*Eddie Waring - himself ", "Notably absent is Graeme Garden's celebrated and oft-used impersonation of Eddie Waring, who appears as himself in his role of presenter of It's A Knockout."]}, {"page": "Alex Murphy (rugby league)", "response": ["In 1998 Murphy was awarded the OBE for services to the game of rugby league. In 2000 his autobiography, Saint and Sinner was published. Murphy was also employed as a commentator by BBC television for a number of years working alongside long-time league commentators Eddie Waring, and later former dual rugby international Ray French. He also worked for Australia's Nine Network as an expert commentator during the 1994 Kangaroo tour."]}, {"page": "List of The Goodies guest stars", "response": ["|Eddie Waring (as himself) ||||| \"The Goodies and the Beanstalk\" — \"The Goodies Rule – O.K.?\""]}, {"page": "The Goodies Rule – O.K.?", "response": ["| Eddie Waring||||"]}, {"page": "Earthanasia", "response": ["It is very late on Christmas Eve and Bill and Graeme are preparing for Christmas. Bill has bought himself a skateboard, while Graeme has bought a skateboard destruction kit (a gun, a hammer and a bomb with a detonator). A carol service on the radio is interrupted by an announcement that the world is going to end at midnight, because the United Nations has decided that this is the best route forward, with the ever-worsening problems of racism, over-population, inflation and pollution. Bill decides to enjoy the last 27-and-a-half minutes in an orgy of self-indulgence. Meanwhile, Graeme thinks about his accomplishments: Giant Kittens, Monster Cods and Eddie Waring impressions."]}, {"page": "Don Fox", "response": ["Don Fox played right-, i.e. number 10, and scored 2-conversions in Wakefield Trinity's 10-11 defeat by Leeds in the 1967–68 Challenge Cup \"Watersplash\" Final during the 1967–68 season at Wembley Stadium, London on Saturday 11 May 1968, in front of a crowd of 87,100. The match was played on a waterlogged pitch and the score was 11-7 to Leeds when Ken Hirst scored a try under the posts for Wakefield Trinity with the final play of the game. Tries were worth three points at that time, making the score 11-10, but a simple 2-point conversion was all that was needed to give Wakefield an unassailable one-point lead, and win the game. Wakefield Trinity fans were jubilant as the conversion from in front of the posts is by far the easiest kick in rugby league. Fox had already scored two more difficult conversions in the game, and he was such a prolific kicker that it realistically should have presented no problem. However, the waterlogged state of the pitch made this a more difficult proposition, and Fox lost his footing and sliced the ball wide of the posts. The final whistle was blown immediately afterwards, giving Leeds a dramatic one-point victory. Commentator Eddie Waring said of Fox, 'He's a poor lad', a remark which became a widely quoted piece of commentary. Fox had already been chosen to win the Lance Todd Trophy for his performance in the match, but he was disconsolate and trudged off the pitch. Interviewed by David Coleman on television later, he was asked if the trophy was any consolation and replied \"not really, no\".Blogspot.com The boots he was wearing during the game are now on display at Wakefield Museum."]}, {"page": "Eric Clay", "response": ["Clay became widely recognised due to his regular Saturday afternoon appearances on Grandstand during the 1960s, although he is often better remembered as the Sergeant Major. This nickname, conferred by broadcaster Eddie Waring, \"captured the way he controlled a game, like a battle-hardened veteran showing the raw recruits who was in charge\"."]}, {"page": "Kirklees College", "response": ["* Eddie Waring, rugby league commentator"]}, {"page": "Challenge Cup", "response": ["The BBC has been the predominant broadcaster, showing every final live since 1958 (except the 1982 Final Replay shown as highlights). Eddie Waring was the first commentator for BBC coverage. When he retired, commentary was covered by Ray French and he continues to work for the BBC albeit in semi-retirement, with his last Challenge Cup Final in 2008. From 2009, the present day main commentator is Dave Woods. He usually commentates with Brian Noble, Jonathan Davies, Iestyn Harris or Ian Millward. Nowadays, the BBC continues to broadcast the tournament with Clare Balding hosting from 2006 to 2012 until her move to Channel 4 Racing. Mark Chapman was secondary host in 2012 when Balding was unavailable for the cup and international matches, and previous hosts for the BBC are John Inverdale and Steve Rider. The current main hosts (2018) are Mark Chapman and Super League Show presenter Tanya Arnold."]}, {"page": "1986 in British television", "response": ["|Eddie Waring"]}, {"page": "Sandy Orford", "response": ["Bradford Northern beat Dewsbury in the Championship play-off semi-final during the 1942–43 season. However, Dewsbury's manager, Eddie Waring, appealed to the Rugby Football League, claiming that Bradford Northern had fielded Wakefield Trinity's Sandy Orford as a guest player, and that Orford was ineligible because prior to the semi-final, he had played only three league matches for Bradford Northern, rather than the regulatory minimum of four league matches, the semi-final actually being Orford's fourth league match. Bradford Northern was disqualified, and Dewsbury went on to a 33-16 aggregate victory over Halifax in the Championship Final. However, a month later, Bradford appealed to the Rugby Football League, claiming that Dewsbury had fielded Castleford's Frank Smith as a guest player, and that Smith was ineligible because prior to the semi-final, he had played only three league matches for Dewsbury, rather than the regulatory minimum of four league matches, though he had played in a number of cup matches. Bradford Northern's appeal was upheld and the Rugby Football League Council fined Dewsbury £100 (based on increases in average earnings, this would be approximately £11,780 in 2013), stripped them of the Championship title, and declared the Championship during the 1942–43 season void."]}, {"page": "Melville De Lloyd", "response": ["Mel De Lloyd began his rugby union career playing alongside his brothers at Resolven RFC, aged seventeen he then played alongside Bill Clement for Llanelli RFC, he was spotted by Eddie Waring, and was recommended to rugby league club Warrington, he made his début for Warrington on Saturday 26 September 1936, he played  in Warrington's 8-4 victory over Barrow in the 1937 Lancashire County Cup Final during the 1936–37 season at Central Park, Wigan on Saturday 23 October 1937, during World War II he appeared as a guest player for Wakefield Trinity making his début for during March 1941, playing 9-matches up to May 1941, he also he appeared as a guest player Keighley, during a game against Hull F.C. on Saturday 3 January 1942 he was sent off after disputing a decision by the referee, Mr L. Dolby, alleged that De Lloyd had later \"struck him\", on Wednesday 7 January 1942, the Rugby Football League disciplinary committee suspended De Lloyd indefinitely (sine die), the suspension was lifted 10-months later in October 1942, he resumed playing having missed 14-games, he scored 1-try, 3-conversions, and 3-drop goals for a total of 15-points in the 21-0 victory over Huddersfield in the first leg of the 1943 Yorkshire County Cup semi-final during the 1943–44 season at Lawkholme Lane on Saturday 13 November 1943, during his time at Keighley they appeared in two Yorkshire Cup finals, the only Yorkshire Cup finals that Keighley have appeared in, the 7-10 aggregate defeat (2-5 at Odsal Stadium on Saturday 27 November 1943, and 5-5 at Lawkholme Lane on Saturday 4 December 1943) to Bradford Northern in the 1943 Yorkshire County Cup Final during the 1943–44 season, and the 3-17 defeat by Wakefield Trinity in the 1951 Yorkshire County Cup Final during the 1951–52 season at Fartown Ground, Huddersfield on Saturday 27 October 1951, after the war he resumed playing for Warrington, playing his last game for them on Saturday 11 October 1947, he then signed for Keighley in 1947, eventually retiring from playing in 1952, he appears to have scored no drop-goals (or field-goals as they are currently known in Australasia) for Wakefield Trinity, nor Keighley, but prior to the 1974–75 season all goals, whether; conversions, penalties, or drop-goals, scored 2-points, consequently prior to this date drop-goals were often not explicitly documented, therefore '0' drop-goals may indicate drop-goals not recorded, rather than no drop-goals scored. In addition, prior to the 1949–50 season, the archaic field-goal was also still a valid means of scoring points."]}, {"page": "1943–44 Northern Rugby Football League Wartime Emergency League season", "response": ["Dewsbury had a relatively successful time during the war years. Managed by Eddie Waring, and with the side boosted by the inclusion of a number of big-name guest players, the club won the Wartime Emergency League in 1941–42 and again the following season 1942–43  (though that championship was declared null and void when it was discovered they had played an ineligible player). They were also runners-up in the Championship in 1943–44, Challenge Cup winners in 1942–43 and Yorkshire Cup Final appearances in this season 1940–41 and winners in 1942–43."]}]}}