{"wiki_id": "http://www.wikidata.org/entity/Q5338646", "itemLabel": "Edith Pretty", "itemDescription": "British landowner and donator", "wikipedia_url": "https://en.wikipedia.org/wiki/Edith_Pretty", "wikipedia_page": {"main": "Edith May Pretty (née Dempster; 1 August 1883 – 17 December 1942) was an English landowner on whose land the Sutton Hoo ship burial was discovered after she hired Basil Brown, a local excavator and amateur archeologist, to find out if anything lay beneath the mounds on her property.\n\n", "link_mentions": [{"page": "British Museum", "response": ["In addition, the British Museum's collections covering the period AD 300 to 1100 are among the largest and most comprehensive in the world, extending from Spain to the Black Sea and from North Africa to Scandinavia; a representative selection of these has recently been redisplayed in a newly refurbished gallery. Important collections include Latvian, Norwegian, Gotlandic and Merovingian material from Johann Karl Bähr, Alfred Heneage Cocks, Sir James Curle and Philippe Delamain respectively. However, the undoubted highlight from the early mediaeval period is the magnificent items from the Sutton Hoo royal grave, generously donated to the nation by the landowner Edith Pretty. The late mediaeval collection includes a large number of seal-dies from across Europe, the most famous of which include those from the Town of Boppard in Germany, Isabella of Hainault from her tomb in Notre Dame Cathedral, Paris, Inchaffray Abbey in Scotland and Robert Fitzwalter, one of the Barons who led the revolt against King John in England. There is also a large collection of medieval signet rings, prominent among them is the gold signet ring belonging to Jean III de Grailly who fought in the Hundred Years' War, as well as those of Mary, Queen of Scots and Richard I of England. Other groups of artifacts represented in the department include the national collection of (c.100) icon paintings, most of which originate from the Byzantine Empire and Russia, and over 40 mediaeval astrolabes from across Europe and the Middle East. The department also includes the national collection of horology with one of the most wide-ranging assemblage of clocks, watches and other timepieces in Europe, with masterpieces from every period in the development of time-keeping. Choice horological pieces came from the Morgan and Ilbert collections. The department is also responsible for the curation of Romano-British objects – the museum has by far the most extensive such collection in Britain and one of the most representative regional collections in Europe outside Italy. It is particularly famous for the large number of late Roman silver treasures, many of which were found in East Anglia, the most important of which is the Mildenhall Treasure. The museum purchased many Roman-British objects from the antiquarian Charles Roach Smith in 1856. These quickly formed the nucleus of the collection. The department also includes ethnographic material from across Europe including a collection of Bulgarian costumes and shadow puppets from Greece and Turkey. A particular highlight are the three Sámi drums from northern Sweden of which only about 70 are extant."]}, {"page": "Sutton Hoo", "response": ["The site was first excavated by Basil Brown under the auspices of the landowner Edith Pretty, but when its significance became apparent, national experts took over. During the 1960s and 1980s, the wider area was explored by archaeologists and many other individual burials were revealed. The artefacts comprise what is considered the greatest treasure ever discovered in the United Kingdom. Those found in the burial chamber include a suite of metalwork dress fittings in gold and gems, a ceremonial helmet, a shield and sword, a lyre, and silver plate from the Byzantine Empire.", "In 1910, a mansion with fifteen bedrooms was built a short distance from the mounds. In 1926 the mansion and its arable land was purchased by Colonel Frank Pretty, a retired military officer who had recently married. In 1934, Pretty died, leaving a widow, Edith Pretty, and young son, Robert Dempster Pretty.Carver, Sutton Hoo, pp. 3–4, 153. Following her bereavement, Edith became interested in Spiritualism, a popular religious movement that purported to enable the living to communicate with the dead.", "The ship-burial treasure was presented to the nation by the owner, Edith Pretty, and was at the time the largest gift made to the British Museum by a living donor. The principal items are now permanently on display at the British Museum. A display of the original finds excavated in 1938 from Mounds 2, 3 and 4, and replicas of the most important items from Mound 1, can be seen at the Ipswich Museum."]}, {"page": "Shackleford", "response": ["Norney Grange, designed by Charles Voysey, is the highest architecturally graded listed building in the Norney part of the parish, a rectangular late 1897-1903 built, roughcast stone home with yellow limestone dressings.  Its interior is just as remarkable as its exterior, with among many carved features, a green marble chimney breast in end room to left and a half-dome ceiling with gallery landing to the rear. The house features prominently in the 2021 film The Dig, standing in as Edith Pretty's house at Sutton Hoo, Suffolk.  "]}, {"page": "1939 in archaeology", "response": ["*May: Sutton Hoo ship burial unearthed by Basil Brown and Edith Pretty in Suffolk, England. On July 28 the Sutton Hoo helmet is excavated."]}, {"page": "Woodbridge School", "response": ["* Vincent Burrough Redstone, 2nd Master and Suffolk Historian, who suggested to Edith Pretty that the Sutton Hoo Ship-burial should be excavated.Weaver Michael (1999 The Newsletter of the Sutton Hoo Society vol30 pp1–2|url=http://suttonhoo.org/wp-content/uploads/2016/02/Saxon30.pdf "]}, {"page": "Carey Mulligan", "response": ["| Edith Pretty"]}, {"page": "List of biographical films", "response": ["||Edith Pretty"]}, {"page": "1939 in the United Kingdom", "response": ["* May–September –The Sutton Hoo treasure – an Anglo-Saxon ship burial – is excavated.  On 28 July the Sutton Hoo helmet is uncovered. The principal treasures are presented to the British Museum by the landowner, Edith Pretty, at this time its largest ever gift from a living donor.Libraries and Culture, Stanley Chodorow"]}, {"page": "Edith May Pretty", "response": ["#REDIRECT Edith Pretty"]}, {"page": "Our Top Ten Treasures", "response": ["| 100px ||2 || Sutton Hoo ship burial || Early Anglo-Saxon, 7th century || Basil Brown and Edith Pretty || 1940 || Woodbridge, Suffolk"]}, {"page": "Pretty", "response": ["* Edith Pretty (1883–1942), English landowner and amateur archaeologist"]}, {"page": "Sutton Hoo helmet", "response": ["The helmet and the other artefacts from the site were determined to be the property of Edith Pretty, owner of the land on which they were found. She donated them to the British Museum, where the helmet is on permanent display in Room 41.", "Items with only marginal amounts of gold or silver, such as the Sutton Hoo helmet, were not eligible for treasure trove; instead, they became the property of the landowner, Edith Pretty, outright. An inquest for the remaining items, comprising 56 categories of objects, was held on 14 August 1939. The 14-person jury found that the objects did not constitute treasure trove, and thus belonged to Pretty; the dispositive issue was that, as the coroner put it, given \"the labour and publicity involved in dragging the ship up to the trench\", presumably accompanied by \"attendant publicity and subsequent feasting\", it was \"impossible to be of the opinion that these articles were buried or concealed secretly\". Within days, however, Pretty donated the entirety of the find to the British Museum. Even had the gold and silver objects been declared treasure trove, ownership of the remaining objects, including the helmet, would have remained with Pretty; donation was thus one of the sole vehicles by which the museum could have taken possession of the finds."]}, {"page": "Sutton, Suffolk", "response": ["* Edith Pretty (1883–1942), the landowner on whose land the Sutton Hoo burials were discovered. "]}, {"page": "List of people who have declined a British honour", "response": ["*Edith Pretty, benefactor (sometime in period 1940–1942)"]}, {"page": "Index of women scientists articles", "response": ["*Edith Pretty"]}, {"page": "Robert Dempster & Sons Ltd", "response": ["#REDIRECT Edith Pretty"]}, {"page": "Dempster (surname)", "response": ["* Edith Pretty (née Dempster) (1883–1942), English landowner who donated the Sutton Hoo treasure"]}, {"page": "The Dig (2021 film)", "response": ["In 1939, Suffolk landowner Edith Pretty hires local self-taught archaeologist-excavator Basil Brown to tackle the large burial mounds at her rural estate in Sutton Hoo near Woodbridge. At first, she offers the same money he received from the Ipswich Museum, the agricultural wage, but he says it is inadequate; so she ups her offer by 12% to £2 a week (approximately £120 in 2020), which he accepts.", "Mark Bridge of The Times noted that archaeologists had taken issue with the film's portrayal of Peggy Piggott as inexperienced and only hired because her light weight would not disturb the delicate site. By 1939, Piggott was an experienced archaeologist in her own right, and had studied archaeology at the University of Cambridge and the University of London. She was also presented as being married to an older, more experienced male archaeologist, when in reality Stuart Piggott was only two years her senior (27 and 29, respectively), and they had met while both students. In addition, Charles Phillips was in his late 30s but is played by Ken Stott in his 60s, and the landowner Edith Pretty was in her mid 50s but is played by Carey Mulligan in her mid 30s (the 53-year-old Nicole Kidman originally was slated to play Pretty)."]}, {"page": "John Shewell Corder", "response": ["* Tranmer House, 1910. Home of Edith Pretty during the 1938-39 excavation of the Sutton Hoo Anglo-Saxon burial mounds."]}, {"page": "Tranmer House", "response": ["Tranmer House is a country house in Sutton Hoo, Woodbridge, Suffolk, England, dating from 1910. The house is located on the Sutton Hoo Anglo-Saxon burial site, and in 1938 was the home of Edith Pretty. In June 1938, Pretty employed Basil Brown to undertake the excavation of a range of burial mounds on the estate, leading to Brown's discovery in May 1939 of a ship burial, \"one of the most important archaeological discoveries of all time\". The house is now owned by the National Trust.", "Tranmer House, then called Sutton Hoo House, was designed in 1910 by John Shewell Corder, an architect based in Ipswich, for a Suffolk artist, John Chadwick Lomax. In 1926 the Sutton Hoo estate was bought by Edith Pretty and her husband, Frank, for £15,250. Edith Pretty, born Edith Dempster in 1883, inherited a considerable fortune from her father upon his death in 1925. Following Frank Pretty's death in 1934, Edith Pretty developed an interest in excavating the burial mounds that lay to the north-east of Tranmer House and engaged a local archaeologist, Basil Brown, to undertake two digs, in 1938 and 1939. During the second dig, Brown located the Anglo-Saxon ship burial site under Mound 1, \"the largest Anglo-Saxon ship burial ever discovered\". The trove of treasure within made Sutton Hoo \"the richest intact early medieval grave in Europe with a burial chamber full of dazzling riches\".", "Edith Pretty died in 1942, having gifted the Sutton Hoo treasure to the British Museum. The house was sold by her son's trustees in the late 1940s, and was owned by a number of local farming families until bought by the Tranmers. Following the death of Annie Tranmer, the house and the Sutton Hoo burial site were bequeathed to the National Trust in 1998. The Trust renamed the house in acknowledgement of the donation."]}, {"page": "Vincent Burrough Redstone", "response": ["Vincent Burrough Redstone (1853 - 26 April 1941) was a Suffolk historian who suggested to Edith Pretty that the Sutton Hoo Ship-burial should be excavated. He was a master of Woodbridge  School and secretary of the Suffolk Institute of Archaeology. He retired from Woodbridge School in 1921 and spent the remainder of his life researching historical topics.  \"Scarfe\" (1958), 8-9  He was particularly noted for his study of Huguenot settlement in Suffolk.", "===Meeting with Edith Pretty and the Sutton Hoo excavations==="]}]}}