{"wiki_id": "http://www.wikidata.org/entity/Q5335816", "itemLabel": "Eddie Annand", "itemDescription": "Scottish footballer (born 1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eddie_Annand", "wikipedia_page": {"main": "Edward Annand (born 24 March 1973 in Glasgow) is a Scottish footballer who plays as a striker for Arthurlie after signing in November 2006.", "link_mentions": [{"page": "Sligo Rovers F.C.", "response": ["Despite this 1994 proved to be one of the most successful of the club's history under the popular Scot. The first trophy was won early in the season in the First Division Shield with Waterford United being beaten 2–1 over two legs. Another addition that year was the installation of floodlights at the historic Showgrounds. Rovers began with a 4–0 over Home Farm. With three games to spare, promotion was guaranteed with a 2–0 away win over Athlone Town, with the First Division title secured with a 1–0 home win over Bray Wanderers. The club's best day of the season was set up by Eddie Annand's winning goal in the FAI Cup semi-final over Limerick at the Showgrounds. The final against Premier Division Derry City was fixed for 15 May at Lansdowne Road on what proved to be another wet day. The game was won by Gerry Carr's header and captain Gavin Dykes lifted the trophy. McStay left at the end of the season to return to Celtic and he would be replaced by Wimbledon cup final hero Lawrie Sanchez but only after caretaker Chris Rutherford had guided Rovers to their first European win, beating Maltese side Floriana 3–2 on aggregate in the Cup Winners' cup. Padraig Moran, one of the club's all-time leading goalscorers, scored Rovers' first European goal. The next round pitted Rovers against big name opposition in the shape of Belgian side Club Brugge. Despite Johnny Kenny's goal in the first leg Rovers lost 2–1 at the Showgrounds and then 3–1 in the return leg."]}, {"page": "1998–99 Scottish Premier League", "response": ["|  Eddie Annand || Dundee"]}, {"page": "Scottish Football League monthly awards", "response": ["| Eddie Annand"]}, {"page": "List of Sligo Rovers F.C. seasons", "response": ["|Eddie Annand", "|Eddie Annand"]}, {"page": "List of Dundee F.C. seasons", "response": ["|Eddie Annand"]}, {"page": "1997–98 Scottish First Division", "response": ["|style=\"text-align:left;\"|  Eddie Annand (Dundee)"]}, {"page": "2000–01 Dundee F.C. season", "response": ["| Eddie Annand"]}, {"page": "Annand", "response": ["* Eddie Annand, Scottish footballer"]}, {"page": "Gordon Burns (footballer)", "response": ["A period of vast investment in the playing squad at Ayr from millionaire Chairman Bill Barr saw the arrivals of high-calibre players such as Neil Duffy, Pat McGinlay, Eddie Annand, John Hughes, James Grady, Andy Walker, Glynn Hurst and Gary Teale. This left youngsters like Burns sidelined, and in 1999 he was signed by legendary Manager John Lambie (footballer, born 1941) for Partick Thistle on loan with a view to a permanent move. He made 6 appearances in an impressive spell, but chances of a permanent move were scuppered when Ayr demanded a transfer fee and he was recalled to Somerset Park."]}, {"page": "2004–05 Dumbarton F.C. season", "response": ["|  Eddie Annand"]}, {"page": "2005–06 Dumbarton F.C. season", "response": ["|  Eddie Annand"]}, {"page": "1993–94 League of Ireland First Division", "response": ["The First Division was contested by 10 teams and Sligo Rovers F.C. won the division. Under player manager Willie McStay and with a team that also included Riccardo Gabbiadini and Eddie Annand, Rovers also completed a treble when they won the First Division Shield and the FAI Cup. "]}]}}