{"wiki_id": "http://www.wikidata.org/entity/Q533972", "itemLabel": "Mary Barnes", "itemDescription": "British artist (1923-2001)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Barnes", "wikipedia_page": {"main": "Mary Edith Barnes (9 February 1923 – 29 June 2001) was an English artist and writer who suffered from schizophrenia and became a successful painter. She is particularly known for her documentation of her experience at R. D. Laing's experimental therapeutic community at Kingsley Hall, London.\nShe is referenced in the book The Psychopath Test by Jon Ronson and Thomas Szasz's Schizophrenia.", "link_mentions": [{"page": "R. D. Laing", "response": ["* The play Mary Barnes by David Edgar (1979) was a theatrical indictment of traditional psychiatry, chronicling the six-year journey through the illness of Barnes, a middle-aged former nurse diagnosed as schizophrenic, kept in padded cells and drugged and shocked into numbness. Set in 1960s London and based on the personal accounts of Barnes and therapist Joseph Berke, the play follows her years as a resident of Kingsley Hall, where the innovative treatment approach begins her path to recovery. Starring Patti Love, it was broadcast on BBC Radio 7 on 7 November 2009, and also in December 2011 on Radio 4 Extra."]}, {"page": "Kingsley Hall", "response": ["The idea of starting this type of community was an initiative suggested by Mary Barnes an artist and former nurse and, first resident as patient.", "One notable resident of this experiment was Mary Barnes. Along with resident psychiatrist Joseph Berke, Mary later went on to write Two Accounts of a Journey Through Madness, describing her stay at Kingsley Hall and use of her mental condition as a vehicle for painting and creative expression. Her account became famous in the 1970s when it was used as the basis for the play Mary Barnes by David Edgar. Another notable resident was the renowned Norwegian author Axel Jensen.", "* Mary Barnes: Two Accounts of a Journey Through Madness – Epilogue"]}, {"page": "Tomintoul", "response": ["The artist and writer Mary Barnes died there in 2001 after living there for some time."]}, {"page": "Joseph Berke", "response": ["Joseph H. Berke, M.D., (January 17, 1939 – January 11, 2021) was an American–born psychotherapist, author and lecturer. He studied at Columbia College of Columbia University and graduated from the Albert Einstein College of Medicine in New York.Brief biography at Janus Head  Berke moved to London in 1965 where he worked with R. D. Laing in the 1960s when the Philadelphia Association was being established. Berke was a resident at Kingsley Hall, where he helped Mary Barnes, a nurse who had been diagnosed with schizophrenia, emerge from madness.Mary-Barnes obituary from telegraph.co.uk Barnes later became an artist and writer. A stage play based on the book that Berke and Barnes wrote together (Mary Barnes: Two Accounts of a Journey Through Madness) was adapted as a stage play by David Edgar. A film adaptation of the book is currently under consideration. Berke collaborated on a number of projects with Laing, including the Dialectics of Liberation international conference in London, July 15–30 1967, where he was the principal organizer.", "* Mary Barnes: Two Accounts of a Journey through Madness (with Mary Barnes)(2002) 3rd Edition, New York: Other Press", "* Mary Barnes"]}, {"page": "Mary Edith Barnes", "response": ["#REDIRECT Mary Barnes"]}, {"page": "Free Association Books", "response": ["Authors who have published with them include Mary Barnes, Martin Bernal, Christopher Bollas, Janine Chasseguet-Smirgel (for English translations), Michael Fordham, André Green, Donna Haraway, Oliver James, Ludmilla Jordanova, Joel Kovel, Michel Odent, Paul Roazen, Adam Jukes and Eugene Victor Wolfenstein"]}, {"page": "Social construction of schizophrenia", "response": ["Other notable practitioners and authors within the humanistic tradition that have viewed schizophrenia as a social construction include psychiatrist Thomas Szasz (1920–2012), Joseph Berke, R.D. Laing, Erich Fromm and Mary Barnes. Szasz viewed the diagnoses as a fabrication that is borderline abusive in terms of treatment. Szasz has protested against the taxonomic classifications of mental illness and reification of these as 'science' and has long argued against institutionalisation as a fundamental deprivation of liberty. In Berke's and Barnes's book two accounts of a journey through madness, Berke explores themes of psychosis as an enriching experience. Berke argues that the invalidation of schizophrenic experiences labelled 'sick or mad' is a uniquely western standpoint insofar as dream states and altered perception are not considered valid modes of interpolation of the truth within westernised culture."]}, {"page": "SPACE (studios)", "response": ["Noted for its focus on emerging art and historical/projects, since 2009 the exhibition programme at SPACE has been curated by Paul Pieroni. The programme has featured exhibitions and projects by a diverse group of artists, including Bernadette Corporation, Raymond Pettibon, Destroy All Monsters, Jamie Shovlin, Kathy Acker, Nam June Paik, Lucky Dragons, Jo Spence, Roy Ascott, LuckyPDF, Mary Barnes, Stewart Home and Hex. In June 2012, SPACE in collaboration with Studio Voltaire, presented a major two-venue retrospective of British photographer Jo Spence."]}, {"page": "Carole Ruggier", "response": ["Ruggier trained as an actress at The Arts Educational School in London and worked extensively in theatre in leading and character roles. Productions include Julius Caesar, Twelfth Night, The Cherry Orchard, The Accrington Pals by Peter Whelan, The Card adapted by Joyce Holliday, Outskirts by Hanif Kureshi, Stags and Hens by Willy Russell, Trafford Tanzi, Good Golly, Miss Molly, I Don't Want to Set the World on Fire, Lady Audley's Secret, The Country Wife, The Wizard of Oz, Chicago, Gypsy, and The Threepenny Opera. In the United States, play roles include The Secret Rapture by 'David Hare, Disneyland It Ain't by Sue Townsend, Chamber Music',  Mary Barnes, and Alfie. She has produced plays in London, Florida, and Los Angeles, including Take 5, Beached, Disneyland It Ain't, Cochon Flambe, Solos in Harmony, and Nagasaki Dust."]}, {"page": "Deaths in June 2001", "response": ["*Mary Barnes, 86, English artist and writer."]}, {"page": "List of Albert Einstein College of Medicine people", "response": ["*Joseph H. Berke, psychiatrist who helped Mary Barnes, a nurse with schizophrenia, emerge from madness. She became a famous artist and writer."]}]}}