{"wiki_id": "http://www.wikidata.org/entity/Q5339386", "itemLabel": "Edmund Colledge", "itemDescription": "British academic and priest", "wikipedia_url": "https://en.wikipedia.org/wiki/Edmund_Colledge", "wikipedia_page": {"main": "Edmund Colledge (14 August 1910 – 16 November 1999) was an English academic, military officer, and Roman Catholic priest. He is chiefly known for his scholarly publications on European medieval literature, in particular spiritual writers from that era. His 1962 anthology, The Medieval Mystics of England, is still widely used in university courses to this day. Chief among his works is his edition of A book of showings to the anchoress Julian of Norwich (published by the Pontifical Institute of Mediaeval Studies, Toronto, 1978) which he co-edited with James Walsh.", "link_mentions": [{"page": "Patricia Routledge", "response": ["Katherine Patricia Routledge was born on 17 February 1929 in Birkenhead. Her father was a haberdasher and gentlemen's outfitter.  She was educated at Birkenhead High School, and the University of Liverpool. She gained a degree with honours in English Language and Literature. She was involved in the University's dramatic society, where she worked closely with the academic Edmund Colledge, who both directed and acted in several of the society's productions. It was Colledge who persuaded her to pursue an acting career. After graduating, she trained at the Bristol Old Vic Theatre School and returned to Liverpool to begin her acting career at the Liverpool Playhouse."]}, {"page": "Revelations of Divine Love", "response": ["In 1910, Gabriel Meunier produced an edition in French, Révélations de l’amour divin, with a second edition made in 1925. During the 1970s, several new versions of the book were published: Marion Glasscoe, A Revelation of Divine Love, produced by the University of Exeter in 1976, and revised in 1989; Roland Maisonneuve's edition, Le Petit Livre des révélations (1976); Etienne Baudry, Une revelation de l'amour de Dieu: version brève des \"Seize révélations de l'amour divin\" (Begrolles en Mauges, 1977); and  A Book of Showings to the Anchoress Julian of Norwich, an edition in two volumes by Edmund Colledge and James Walsh (PIMS, 1978)."]}, {"page": "Meister Eckhart", "response": ["Eckhart was probably born in the village of Tambach, near Gotha, in the Landgraviate of Thuringia,Bernard McGinn, The Mystical Thought of Meister Eckhart, (New York: Crossroad Publishing Company, 2001), p.2, points out that previous scholarship which had placed Eckhart's birth in Hochheim is incorrect: Hochheim is used in the sources to indicate Eckhart's family name, not his birthplace. perhaps between 1250 and 1260.Walter Senner, ‘Meister Eckhart’s Life, Training, Career, and Trial’ in Jeremiah Hackett (ed.), A Companion to Meister Eckhart (Leiden: Brill, 2012), 7–84. It was previously asserted that he was born to a noble family of landowners, but this originated in a misinterpretation of the archives of the period.Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981, p.5. In reality, little is known about his family and early life. There is no authority for giving him the Christian name of Johannes, which sometimes appears in biographical sketches: his Christian name was Eckhart; his surname was von Hochheim.", "Eckhart joined the Dominicans at Erfurt, probably when he was about eighteen, and it is assumed he studied at Cologne.This supposition is founded on Eckhart’s frequent citation, with respect, of Albert the Great, who had taught at Cologne until his death in 1280, and more particularly, his statement in his 1294 Easter Sermon that \"Albert often used to say: 'This I know, as we know things, for we all know very little. (Bernard McGinn, The Mystical Thought of Meister Eckhart (New York: Crossroad Publishing Company, 2001), p.2.) He may have also studied at the University of Paris, either before or after his time in Cologne.The evidence for Eckhart's studies in Cologne is similarly circumstantial as recounted in Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981, p.7.", "Then follows a long period of which it is known only that he spent part of the time at Strasbourg.cf. Urkundenbuch der Stadt Strassburg, iii. 236. It is unclear what specific office he held there: he seems chiefly to have been concerned with spiritual direction and with preaching in convents of Dominicans.Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981, p.10.", "Eckhart was one of the most influential 13th-century Christian Neoplatonists in his day, and remained widely read in the later Middle Ages.As McGinn, Eckhart, p.1, points out, about three hundred manuscripts containing Eckhart's German sermons, both authentic and pseudonymous, survive. Some early twentieth-century writers believed that Eckhart's work was forgotten by his fellow Dominicans soon after his death. In 1960, however, a manuscript (\"in agro dominico\") was discovered containing six hundred excerpts from Eckhart, clearly deriving from an original made in the Cologne Dominican convent after the promulgation of the bull condemning Eckhart's writings, as notations from the bull are inserted into the manuscript.Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981, p.19. The manuscript came into the possession of the Carthusians in Basel, demonstrating that some Dominicans and Carthusians had continued to read Eckhart's work.", "It is also clear that Nicholas of Cusa, Archbishop of Cologne in the 1430s and 1440s, engaged in extensive study of Eckhart. He assembled, and carefully annotated, a surviving collection of Eckhart's Latin works.Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981, p.20. As Eckhart was the only medieval theologian tried before the Inquisition as a heretic, the subsequent (1329) condemnation of excerpts from his works cast a shadow over his reputation for some, but followers of Eckhart in the lay group Friends of God existed in communities across the region and carried on his ideas under the leadership of such priests as John Tauler and Henry Suso.Christianity through the Centuries, Earle E. Cairns, Zondervan, 1996", "Interest in Eckhart's works was revived in the early nineteenth century, especially by German Romantics and Idealist philosophers.McGinn, Eckhart, p.1. Franz Pfeiffer's publication in 1857 of Eckhart's German sermons and treatises added greatly to this interest.This was in the second volume of his Deutsche Mystiker (Stuttgart). Pfeiffer's edition included 111 sermons and 18 treatises, as well as a number of sayings and fragments – but many of these are now recognised to be later works falsely attributed to Eckhart. (Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981, p.62)", "Since the mid-nineteenth century scholars have questioned which of the many pieces attributed to Eckhart should be considered genuine, and whether greater weight should be given to works written in the vernacular, or Latin. Although the vernacular works survive today in over 200 manuscripts, the Latin writings are only found in a handful of manuscripts. Denifle and others have proposed that the Latin treatises, which Eckhart prepared for publication very carefully, were essential to a full understanding of Eckhart.Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981, p.62.", "In 1923, Eckhart's Essential Sermons, Commentaries, Treatises and Defense (also known as the Rechtsfertigung, or Vindicatory Document) was re-published. The Defense recorded Eckhart's responses against two of the Inquisitional proceedings brought against him at Cologne, and details of the circumstances of Eckhart's trial. The excerpts in the Defense from vernacular sermons and treatises described by Eckhart as his own, served to authenticate a number of the vernacular works.Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981, p.63. Although questions remain about the authenticity of some vernacular works, there is no dispute about the genuine character of the Latin texts presented in the critical edition.Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981, p.64.", "One difficulty with Eckhart's Latin writings is that they clearly represent only a small portion of what he planned to write. Eckhart describes his plans to write a vast Opus Tripartitum (Three-Part Work). Unfortunately, all that exists today of the first part, the Work of Propositions, is the Prologue illustrating the first proposition (with Eckhart intending the first part alone to consist of over one thousand propositions).Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981, p.64. This Prologue exists in two manuscripts discovered by Denifle – one discovered in Erfurt in 1880, and the other in Kues in 1886. The second part, called the Work of Questions, no longer exists. The third part, the Work of Commentaries, is the major surviving Latin work by Eckhart, consisting of a Prologue, six commentaries, and fifty-six sermons.Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981, p.65. It used to be thought that this work was begun while Eckhart was in Paris between 1311 and 1313; however, recent manuscript discoveries mean that much of what survives must be dated to before 1310.Bernard McGinn, The Harvest of Mysticism, (2005), p.98.", "*Expositio Libri Genesis (Commentary on the Book of Genesis).LW 1:185–444. The Prologue and the commentary on Genesis 3 are translated into English in Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981, pp.82–121.", "*Expositio sancti Evangelii secundum Iohannem (Commentary on John)LW 3. The commentary on John 1:1–14 is translated into English in Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981, pp.122–173. The commentary on John 14.8 is translated into English in Meister Eckhart: Teacher and Preacher, trans. and ed. by Bernard McGinn and Frank Tobin, New York and London: Paulist Press/SPCK, 1987, pp.182–205.", "*The Defense.Selections are translated into English in Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981, pp.71–76.", "Questions concerning the authenticity of the Middle High German texts attributed to Eckhart are much greater than for the Latin texts. The problems involve not only whether a particular sermon or treatise is to be judged authentic or pseudonymous, but also, given the large number of manuscripts and the fragmentary condition of many of them, whether it is even possible to establish the text for some of the pieces accepted as genuine.Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981, p. 66. Eckhart's sermons are versions written down by others from memory or from notes, meaning that the possibility for error was much greater than for the carefully written Latin treatises.", "*The final vernacular treatise accepted as genuine by the critical edition is entitled Von Abgescheidenheit (On Detachment).DW 5:400–434. All four vernacular treatises are translated into English in Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press, 1981. However, this treatise is generally today not thought to be written by Eckhart.Bernard McGinn, The Harvest of Mysticism, (2005), p.632.", "* Meister Eckhart, The Essential Sermons, Commentaries, Treatises and Defense, trans. and ed. by Bernard McGinn and Edmund Colledge, New York: Paulist Press and London: SPCK, 1981. Re-published in paperback without notes and a foreword by John O’Donohue as Meister Eckhart, Selections from His Essential Writings, (New York, 2005)."]}, {"page": "Classics of Western Spirituality", "response": ["* Julian of Norwich: Showings, translated by Edmund Colledge and James Walsh (1978, )", "* Meister Eckhart: The Essential Sermons, Commentaries, Treatises, and Defense, translated by Edmund Colledge (1981, )"]}]}}