{"wiki_id": "http://www.wikidata.org/entity/Q5337267", "itemLabel": "Edgar Granville, Baron Granville of Eye", "itemDescription": "British politician (1898-1998)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edgar_Granville,_Baron_Granville_of_Eye", "wikipedia_page": {"main": "Edgar Louis Granville, Baron Granville of Eye (12 February 1898 – 14 February 1998) was a British politician.\nEdgar Granville was educated at High Wycombe and in Australia, where he lived for some years. He served in the First World War with the Australian Imperial Force in Gallipoli, Egypt, and France. He was a scout with the Australian Light Horse and was wounded with the 4th Light Horse at Gallipoli. He was president of the Gallipoli Association.\nGranville was elected as Liberal Member of Parliament (MP) for Eye in Suffolk in 1929. He played a wide role within the Liberal Party, chairing their Agricultural Group, as secretary of the Foreign Affairs Group and as vice-president of the Young Liberals. Becoming a Liberal National for the 1931 general election, he served as Parliamentary Private Secretary to then Home Secretary, Sir Herbert Samuel, then to Sir John Simon, Foreign Secretary, in the National Governments of the 1930s.\nGranville served in the Royal Artillery as an officer in the Second World War, resigning his commission in August 1940. In 1942, he left the Liberal Nationals and became an Independent, rejoining the Liberals in 1945. He stood again in 1945 as a Liberal, facing both Conservative and Labour opposition, but won by 949 votes. He won again in 1950 with an even smaller majority – 627 – but could not overcome the Conservatives in the 1951 election and lost his seat.\nIn 1952 Granville joined the Labour Party, and stood once again for Eye in 1955, losing by just 898 votes despite the fact that Labour had previously been a distant third. He was elevated to the House of Lords 12 September 1967, made a life peer with the title Baron Granville of Eye, of Eye in the County of Suffolk. His year of birth is sometimes incorrectly given as 1899, but birth records have confirmed the actual year. He is one of the few peers to have celebrated their 100th birthday, although he died just two days later.\nHe was managing director of E. L. Granville & Co. Ltd, chair and furniture manufacturers, of High Wycombe.\nGranville was survived by his wife Elizabeth and a daughter Linda Gounalakis.", "link_mentions": {}}}