{"wiki_id": "http://www.wikidata.org/entity/Q5334641", "itemLabel": "Ed Chapman", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Ed_Chapman_(artist)", "wikipedia_page": {"main": "Ed Chapman (born 1971), in Darwen, Lancashire is a mosaic artist, the son of artist Margaret Chapman who was from the Northern School.Chapman became a professional artist in the 1990s. His artistic influences include Chuck Close, Robert Rauschenberg, and Jamie Reid. His work has sold in more than 25 countries, and has been exhibited in galleries in the UK and around the world.\nHe has created several 'firsts' in mosaic, including Jimi Hendrix from Fender guitar picks, tennis star  Andy Murray on carpet made from household items like tomato sauce and lipstick, Albert Einstein in metal, a chewing gum mosaic, a bullets mosaic and several others. Among his mosaics are portraits of David Bowie, Nelson Mandela, David Beckham in penny coins, Alan Sugar (done in sugar cubes) and Eric Cantona. Annie Lennox, Lemmy the founding member of Motörhead and chef Gordon Ramsay are among the clients who have commissioned a work by him. His portrait of Richard Burton incorporating 500 million-year-old Welsh slate was commissioned by the actor's widow Sally Burton in 2015 to mark 90 years since the actor's birth. The portrait is at Swansea University.\nChapman's mosaic of Jimi Hendrix, made of 5000 Fender guitar picks was auctioned for £23,000/$35000, one of the highest prices ever paid for a mosaic piece of art - with proceeds going to Cancer Research UK.", "link_mentions": [{"page": "Darwen", "response": ["*Ed Chapman (artist) born at Bull Hill, in Darwen, went to St. Cuthbert's Primary School 1975–81."]}, {"page": "Edward Chapman", "response": ["*Ed Chapman (artist) (born 1971), British artist, best known for mosaic portraits", "*Ed Chapman (baseball) (1905–2000), American major league player"]}, {"page": "Chapman (surname)", "response": ["*Ed Chapman (artist), British artist"]}, {"page": "Mr. Brainwash", "response": ["On February 14, 2010, Guetta opened his second show in New York City. The show Life Is Beautiful: Icons covered  of an abandoned warehouse in the Meat Packing District to create a gallery. According to Anthony Haden-Guest, a portrait of Jim Morrison made of broken vinyl records in a simplistic version of the style of mosaicist Ed Chapman was sold for $100,000.Haden-Guest, Anthony. \"The Art of 'Mr. Brainwash' \", The Daily Beast, 18 February 2010. Massive cans were created for the show, ranging in size from  to  and are now embodied as prints in a series."]}]}}