{"wiki_id": "http://www.wikidata.org/entity/Q5345632", "itemLabel": "Edward Tomkins", "itemDescription": "British diplomat (1915-2007)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Tomkins", "wikipedia_page": {"main": "Sir Edward Emile Tomkins  (16 November 1915 – 20 September 2007) was a British diplomat, who served as British Ambassador to the Netherlands from 1970 to 1972, and British Ambassador to France from 1972 to 1975. He owned Winslow Hall in Winslow, Buckinghamshire, often attributed to Christopher Wren, from 1959.\n\n", "link_mentions": [{"page": "List of ambassadors of the United Kingdom to France", "response": ["*1972–1975: Sir Edward Tomkins"]}, {"page": "Patrick Gibson, Baron Gibson", "response": ["Gibson was educated at Eton and Magdalen College, Oxford.  He became a stockbroker in 1937, and he joined the Middlesex Yeomanry on the outbreak of the Second World War.  He served in North Africa, but was captured at Derna in Libya in April 1941.  He was held as a prisoner-of-war at Camp 41 near Parma in northern Italy, where he shared a room with Edward Tomkins and Nigel Strutt, all three becoming firm friends.  Strutt was repatriated on medical grounds, and Gibson and Tomkins were moved to another camp.  He and Tomkins escaped from the new camp, and spent 81 days walking  south to Bari, crossing the Apennines and German lines, to return to Allied-held territory.  Gibson then served with Special Operations Executive and the Foreign Office."]}, {"page": "Tomkins (surname)", "response": ["*Sir Edward Tomkins (1915–2007), British ambassador"]}, {"page": "List of ambassadors of the United Kingdom to the Netherlands", "response": ["* 1970–1972: Sir Edward Tomkins"]}, {"page": "List of Légion d'honneur recipients by name (T)", "response": ["| Edward Tomkins"]}, {"page": "Deaths in September 2007", "response": ["*Sir Edward Tomkins, 91, British diplomat, ambassador to The Netherlands and France."]}, {"page": "Sir Edward Tomkins", "response": ["#REDIRECT Edward Tomkins"]}, {"page": "Sir Edward Tompkins", "response": ["#REDIRECT Edward Tomkins"]}, {"page": "Nigel Strutt", "response": ["Strutt joined the Essex Yeomanry in 1937, and moved to Africa to become an honorary aide-de-camp to the governor of Northern Rhodesia. He joined the Essex Yeomanry Royal Horse Artillery on the outbreak of the Second World War. He served as a forward observation officer in North Africa and was severely wounded in 1941 near Bardia, in Libya, losing his right eye. After recovering from his injuries, he was offered a staff position as an ADC in Palestine, but asked to be returned to his regiment instead.  However, before he could rejoin his comrades, he was captured by a German patrol and sent to a prisoner-of-war camp in northern Italy.  In Camp 41, near Parma, he shared a room with Edward Tomkins and Pat Gibson, all three becoming firm friends.  He was best man at Tomkins's wedding in 1955."]}, {"page": "Index of World War II articles (E)", "response": ["# Edward Tomkins"]}, {"page": "1969 Birthday Honours", "response": ["* B4025168 Flight Sergeant Kenneth Edward Tomkins, for services with the Kenya Air Force."]}, {"page": "1975 Birthday Honours", "response": ["*Sir Edward Tomkins, K.C.M.G., C.V.O., H.M. Ambassador, Paris."]}, {"page": "List of Knights and Dames Grand Cross of the Order of St Michael and St George", "response": ["|Sir Edward Tomkins"]}, {"page": "Samuel Tomkins", "response": ["*General William Percival Tomkins (1841–1922), Colonel-Commandant, Royal Engineers; grandfather of Edward Tomkins."]}]}}