{"wiki_id": "http://www.wikidata.org/entity/Q5343816", "itemLabel": "Edward Jones", "itemDescription": "officer in the British Army, born 1936", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Jones_(British_Army_officer)", "wikipedia_page": {"main": "General Sir Charles Edward Webb Jones  (25 September 1936 – 14 May 2007) was a senior officer in the British Army. He served as Quartermaster-General and as Britain's military representative to the North Atlantic Treaty Organisation (NATO). He retired from the Army in 1995 to become Gentleman Usher of the Black Rod (or simply Black Rod) in the British Parliament's House of Lords, serving in that office until 2001.\n\n", "link_mentions": [{"page": "Black Rod", "response": ["* 9 May 1995 – 8 May 2001: General Sir Edward Jones"]}, {"page": "Dennis Skinner", "response": ["|1995 and 1996||\"New Labour, New Black Rod!\"||A reference to Labour's election campaign slogan, \"New Labour, New Britain\" and to new Black Rod, Sir Edward Jones."]}, {"page": "Edward Jones", "response": ["* Edward Jones (English architect) (born 1939), English architect who designed the Saïd Business School", "* Edward Jones (Welsh architect) (1796–1835), Welsh-born architect and surveyor", "* Edward Jones (harpist) (1752–1824), Welsh harpist and author", "* Edward Jones (statistician) (1856–1920), co-founder of Dow Jones & Company", "* Edward Jones Investments, an investment company (founded 1922, formerly known as Edward D. Jones & Co., L.P.)", "* Edward D. Jones (1893–1982), investment banker, founder of Edward Jones Investments", "* Edward Jones (English politician) (died 1609), English politician", "* Edward Jones (North Carolina politician) (1950–2012), American state legislator", "* Edward Jones (martyr) (died 1590), Catholic martyr", "* Edward Jones (bishop) (1641–1703), Bishop of St Asaph", "* Edward Jones (Methodist preacher) (c. 1741–after 1806), nicknamed \"Ginshop\" Jones, Welsh Calvinistic Methodist preacher in London", "* Edward Jones (missionary) (1807–1865), African American missionary to the colony of Sierra Leone", "* Edward Jones (Canon of Windsor) (1653–1737), Canon of Windsor", "* Edward Jones (football manager), English football manager of the Egypt national team 1949–1952", "* Edward Jones (lacrosse) (1881–1951), British lacrosse player", "* Edward Jones (rugby league), rugby league footballer of the 1910s for Wales, and Broughton Rangers", "* Edward Jones (cricketer) (1896–1978), Welsh cricketer", "* Red Borom (Edward Jones Borom, 1915–2011), American baseball player", "* The Edward Jones Dome (formerly TWA Dome), 1995 opened multi-purpose stadium in St. Louis, once home to the Rams of the NFL", "* \"The boy Jones\" (Edward Jones, 1824–1893), notorious intruder into Buckingham Palace between 1838 and 1841", "* Edward Jones (British Army officer) (1936–2007), British army general"]}, {"page": "1st Green Jackets (43rd and 52nd)", "response": ["The regiment was based at Knook Camp, near Warminster, in 1959. The regiment, led by Lieutenant Colonel Michael Harbottle, was an infantry demonstration battalion from 1959 to 1962. Brigadier, later General Sir Antony Read had a key role in the planning stages for the new regiment and in its move to the Green Jackets Brigade. Major, later Colonel John Tillett was second-in-command of the regiment at Warminster. In accordance with the tradition of rifle regiments not carrying colours; in 1962 in High Wycombe, Buckinghamshire, the 1st Green Jackets (43rd and 52nd) marched the 43rd and 52nd colours for the last time. On that occasion the regiment provided a Guard of Honour for Queen Elizabeth II which was commanded by Captain Edward Jones.Draper, p. 16 Major Dennis Fox was involved in the production of the 1962 film The Longest Day and members of the regiment took part as extras in the film."]}, {"page": "Quartermaster-General to the Forces", "response": ["*1988–1991 General Sir Edward Jones"]}, {"page": "Edward Jones (army)", "response": ["#REDIRECT Edward Jones (British Army officer)"]}, {"page": "Deaths in May 2007", "response": ["*Sir Edward Jones, 70, British Army general, Black Rod (1996–2001), heart attack."]}, {"page": "Charles Edward Webb Jones", "response": ["#REDIRECT Edward Jones (British Army officer)"]}, {"page": "Edward Jones (British army officer)", "response": ["#REDIRECT Edward Jones (British Army officer) "]}, {"page": "Tod Sweeney", "response": ["Sweeney retired from the British Army in 1974. He was director general of the Battersea Dogs Home from 1974 to 1988. He was the subject of a This is Your Life programme presented by Eamonn Andrews on 20 March 1985. Guests who appeared on the programme included Katie Boyle, Richard Todd and former Oxford and Bucks Light Infantry soldiers: General Sir Antony Read, General Sir Edward Jones (British Army officer), Major Sandy Smith (British Army officer), Major John Stevenson and Jack \" Bill \" Bailey. Sweeney was chairman of the 43rd & 52nd Old Comrades Association. In retirement he lived in Warwickshire and later in Shepton Mallet, Somerset."]}, {"page": "General Jones", "response": ["*Sir Edward Jones (British Army officer) (1936–2007), British Army general"]}, {"page": "Charles Phibbs Jones", "response": ["His son was General Sir Edward Jones who, like his father, became a member of the Army Board.Obituary: General Sir Edward Jones The Times, 17 May 2007"]}, {"page": "List of British Army full generals", "response": ["| Sir Edward Jones"]}, {"page": "List of permanent representatives of the United Kingdom to NATO", "response": ["| 85px || General || Sir Edward Jones || 1992 || 1995"]}, {"page": "Babington family", "response": ["* Sir Edward Jones (1936-2007), British General who served as Black Rod, great-grandson of Angel Babington [daughter of Rev. Hume Babington (1804-1878)]"]}]}}