{"wiki_id": "http://www.wikidata.org/entity/Q5342759", "itemLabel": "Edward Ellington", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Ellington", "wikipedia_page": {"main": "Marshal of the Royal Air Force Sir Edward Leonard Ellington,  (30 December 1877 – 13 June 1967) was a senior officer in the Royal Air Force. He served in the First World War as a staff officer and then as director-general of military aeronautics and subsequently as controller-general of equipment. In the inter-war years he held command positions in the Middle East, in India and then in Iraq. He served as Chief of the Air Staff in the mid-1930s and in that role he implemented a plan, known as 'Scheme F'.  This scheme implemented an increase in the size of the Royal Air Force to 187 squadrons (five bomber squadrons for every two fighter squadrons, reflecting the dominance of the bomber strategy at the time) within three years to counter the threat from Hitler's Germany. He also broke up the command known as \"Air Defence of Great Britain\" to create RAF Fighter Command, RAF Bomber Command, RAF Coastal Command and RAF Training Command. He then served as Inspector-General of the RAF until his retirement in 1940.", "link_mentions": [{"page": "1967", "response": ["** Edward Ellington, British military officer; Marshal of the Royal Air Force (b. 1877)"]}, {"page": "1877", "response": ["* December 30 – Edward Ellington, British military officer; Marshal of the Royal Air Force (d. 1967)"]}, {"page": "Marshal of the Royal Air Force", "response": ["|1 January 1937||100px||Sir Edward Ellington||1877||1967|| Chief of the Air Staff 1933–1937"]}, {"page": "Air vice-marshal", "response": ["| Edward Ellington"]}, {"page": "Air Defence of Great Britain", "response": ["| 1 January 1929 || 5 September 1931 || Air Marshal Sir Edward Ellington"]}, {"page": "Cyril Newall, 1st Baron Newall", "response": ["On 1 September 1937, Newall was appointed as Chief of the Air Staff, the military head of the RAF, in succession to Sir Edward Ellington. The promotion was unexpected; of the prospective candidates mooted for the job, Newall has been widely seen by historians as the least gifted. The most prominent candidate was Hugh Dowding, the head of RAF Fighter Command and senior in rank to Newall by three months, who had been informally told by Ellington in 1936 that he was expected to be appointed as the new Chief of the Air Staff. The decision was taken by the Air Minister, Viscount Swinton, without consulting Ellington for advice.Wright, pp. 60–63"]}, {"page": "Edward B. Ellington", "response": ["Ellington married Marion Florence Leonard, and they had at least one child, a son, Edward Ellington (born in Kensington in 1877), who became a senior figure in the Royal Air Force."]}, {"page": "Marshal of the air force", "response": ["|United Kingdom||1937||75px||Sir Edward Ellington||Marshal of the Royal Air Force||1877||1967||Promoted 1 January 1937."]}, {"page": "Richard Williams (RAAF officer)", "response": ["A series of mishaps with Hawker Demons at the end of 1937, which resulted in one pilot dying and four injured, subjected the Air Force to harsh public criticism. In 1939 Williams was dismissed from his post as CAS and \"effectively banished overseas\", following publication of the Ellington Report that January. Its author, Marshal of the Royal Air Force Sir Edward Ellington, criticised the level of air safety observed in the RAAF, though his interpretation of statistics has been called into question.Stephens, The Royal Australian Air Force, pp. 55–57 The Federal government praised Williams for strengthening the Air Force but blamed him for Ellington's findings, and he was criticised in the press.Odgers, The Royal Australian Air Force, p. 53 Beyond the adverse report, Williams was thought to have \"made enemies\" through his strident championing of the RAAF's independence. A later CAS, George Jones, contended that Ellington had been \"invited to Australia in order to inspect Williams rather than the air force and to recommend his removal from the post of Chief of the Air Staff if necessary\".Coulthard-Clark, The Third Brother, pp. 114–115 The government announced that it was seconding him to the RAF for two years.Gillison, Royal Australian Air Force 1939–1942, p. 53"]}, {"page": "No. 41 Squadron RAF", "response": ["During the 1930s, displays, sports, competitions, tactical exercises and flying practice were a part of regular activity. In the summer of 1934, 41 Squadron even performed a flying display for South Bucks Mothers' Union. On 1 July 1935, 41 Squadron escorted an Imperial Airways aircraft to Brussels, with the Duke and Duchess of York on board, where they attend functions for British Week at the International Exhibition.The Times, 27 June, 1 July, 2 July, & 3 July 1935 During this period, 41 Squadron was also visited by a number of British and foreign government and military dignitaries. One of the first was Japanese General Matsui Iwane who, after World War II, was held accountable and executed for the 1937 'Rape of Nanjing', in which his armies murdered an estimated 300,000 Chinese civilians. British dignitaries included Prime Minister, Ramsay MacDonald, the Chief of Air Services, Marshal of the Royal Air Force Hugh Trenchard GCB DSO, the Air Officer Commanding in Chief Air Defence of Great Britain, Air Marshal Sir Edward Ellington KCB CMG CBE, and the Air Officer Commanding Fighting Area, Air Defence of Great Britain, Air Vice-Marshal Hugh Dowding, CB CMG."]}, {"page": "Adrian Carton de Wiart", "response": ["Carton de Wiart was already well connected in European circles, his two closest cousins being Count Henri Carton de Wiart, Prime Minister of Belgium from 1920 to 1921, and Baron Edmond Carton de Wiart, political secretary to the King of Belgium and director of La Société Générale de Belgique. While on leave, he travelled extensively throughout central Europe, using his Catholic aristocratic connections to shoot at country estates in Bohemia, Austria, Hungary, and Bavaria. Following his return to England, he rode with the famous Duke of Beaufort's Hunt where he met, among others, the future field marshal, Sir Henry Maitland Wilson, and the future air marshal, Sir Edward Ellington. He was promoted to captain on 26 February 1910. The Duke of Beaufort was the honorary colonel of the Royal Gloucestershire Hussars, and from 1 January 1912 until his departure for Somaliland in 1914 Carton de Wiart served as the regiment's adjutant."]}, {"page": "Edward Ellington (military officer)", "response": ["#REDIRECT Edward Ellington"]}, {"page": "No. 1 Squadron RAAF", "response": ["No. 1 Squadron began receiving new Demons in November 1936.No. 1 Squadron, Operations Record Book (1925–1946), p. 114 In January 1937, it relinquished its Bulldogs to No. 21 Squadron, which was to hold them until they could be transferred to the soon-to-be-formed No. 2 Squadron.Coulthard-Clark, The Third Brother, p. 231 By the end of February, No. 1 Squadron's strength was 12 Demons and one Moth, 11 officers and 108 airmen.No. 1 Squadron, Operations Record Book (1925–1946), p. 121 The unit was redesignated No. 1 (Bomber) Squadron in August 1937. Towards the end of the year, it was plagued by several Demon accidents, resulting in a series of inquiries and a review of RAAF procedures in 1938 by Marshal of the RAF Sir Edward Ellington; the so-called Ellington Report and its criticism of air safety standards led to the removal of Air Vice-Marshal Richard Williams from his position as Chief of the Air Staff, which he had held since the formation of the Air Force.Coulthard-Clark, The Third Brother, pp. 114–118, 344–348 No. 1 Squadron received the RAAF's first three CAC Wirraways on 10 July 1939.No. 1 Squadron, Operations Record Book (1925–1946), p. 162 As the likelihood of war increased, the squadron's role was altered to incorporate reconnaissance as well as bombing, resulting in the transfer out of all Demons and Wirraways and the transfer in from other units of nine Avro Ansons on 28–29 August 1939; at the end of the month its personnel comprised nine officers and 122 airmen.No. 1 Squadron, Operations Record Book (1925–1946), p. 163"]}]}}