{"wiki_id": "http://www.wikidata.org/entity/Q5344237", "itemLabel": "Edward Lye", "itemDescription": "English priest", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Lye", "wikipedia_page": {"main": "Edward Lye  (1694–1767) was an 18th-century scholar of Old English and Germanic philology.\nHis Dictionarium Saxonico et Gothico-Latinum, published posthumously in 1772, was a milestone in the development of Old English lexicography, surpassed only by, and substantially contributing to Joseph Bosworth's Dictionary of the Anglo-Saxon language of 1838.", "link_mentions": [{"page": "Hecate", "response": ["Strmiska (2005) claimed that Hecate, conflated with the figure of Diana, appears in late antiquity and in the early medieval period as part of an \"emerging legend complex\" known as \"The Society of Diana\"Magliocco, Sabina. (2009). Aradia in Sardinia: The Archaeology of a Folk Character. Pp. 40–60 in Ten Years of Triumph of the Moon. Hidden Publishing. associated with gatherings of women, the Moon, and witchcraft that eventually became established \"in the area of Northern Italy, southern Germany, and the western Balkans.\"Michael Strmiska, Modern paganism in world cultures, ABC-CLIO, 2005, p. 68. This theory of the Roman origins of many European folk traditions related to Diana or Hecate was explicitly advanced at least as early as 1807Francis Douce, Illustrations of Shakspeare, and of Ancient Manners, 1807, p. 235-243. and is reflected in etymological claims by early modern lexicographers from the 17th to the 19th century, connecting hag, hexe \"witch\" to the name of Hecate.John Minsheu and William Somner (17th century), Edward Lye of Oxford (1694–1767), Johann Georg Wachter, Glossarium Germanicum (1737), Walter Whiter, Etymologicon Universale (1822) Such derivations are today proposed only by a minoritye.g. Gerald Milnes, Signs, Cures, & Witchery, Univ. of Tennessee Press, 2007, p. 116; Samuel X. Radbill, \"The Role of Animals in Infant Feeding\", in American Folk Medicine: A Symposium Ed. Wayland D. Hand. Berkeley: University of California Press, 1976."]}, {"page": "Totnes", "response": ["* Linguist Edward Lye, who wrote the first dictionary of Anglo-Saxon, was born in Totnes."]}, {"page": "River Wye", "response": ["The meaning of the river's name is not clear. Possibly the earliest reference to the name is Guoy in Nennius' early 9th Century Historia Brittonum and the modern Welsh name is Gwy. The Wye was much later given a Latin name, Vaga, an adjective meaning 'wandering'. The Tithe map references a Vagas Field in both Whitchurch and Chepstow.The Tithe map (1844) Philologists such as Edward Lye and Joseph Bosworth in the 18th and early 19th centuriesBosworth, Joseph A Dictionary of the Anglo-saxon Language (1838) suggested an Old English derivation from wæg, \"wave\"."]}, {"page": "Rape (county subdivision)", "response": ["One suggested etymology of the word, from Edward Lye in the 18th century, is in the Icelandic territorial division , meaning 'district or tract of land'. However, this is rejected in the New English Dictionary, and according to the English Place-Name Society is 'phonologically impossible'."]}, {"page": "Franciscus Junius (the younger)", "response": ["Junius remained resident in England for more than twenty years, but upon the revolt against Charles I in 1642, he joined the Earl and his wife to the Low Countries. Soon after his return in Holland, Junius became interested in the history of the Dutch language, an interest that quickly spread to the oldest phases of other Germanic languages.  As a result, he published a commentary on an Old High German paraphrase of the Song of Songs, the first edition of a collection of Old English poems, and the first edition, together with an extensive dictionary, of the Gothic Gospels. Upon his death a number of lexicographical works remained unpublished, of which an English etymological dictionary was published posthumously. Samuel Johnson's Dictionary used two main sources for its Teutonic etymologies: Junius's Etymologicum Anglicanum (in a posthumous edition edited by Edward Lye) and Stephen Skinner's Etymologicon Linguæ Anglicanæ.", "::Published posthumously in an edition by Edward Lye, who included a life of Junius and George Hickes's Anglo-Saxon grammar."]}, {"page": "Wigmore, Herefordshire", "response": ["The misidentification goes back to Edward Lye, who recorded a Wicinga-mere (introducing an association with Vikings) as a villa in agro Herefordiensi.Dictionarium Saxonico- et Gothico-Latinum (1772), cited by Joseph Bosworth, A dictionary of the Anglo-Saxon language (1838). Also compare Thomas Wright, The history of Ludlow and its neighbourhood; forming a popular sketch of the history of the Welsh border (1852), p. 12: \"In 921 King Edward built Wicinga-mere (Wigmore); which was attacked the same year by the Danes, who had again entered the Marches of Wales.\""]}, {"page": "Lye (disambiguation)", "response": ["*Edward Lye (1694–1767), English scholar"]}, {"page": "King Edward VI Community College", "response": ["*Edward Lye, an 18th-century scholar of Old English and Germanic philology."]}, {"page": "Owen Manning", "response": ["Manning completed the Saxon dictionary of his friend Edward Lye, and published it.‘Dictionarium Saxonico et Gothico-Latinum. Accedunt Fragmenta Versionis Ulphilanæ, necnon Opuscula quædam Anglo-Saxonica. Edidit, nonnullis Vocabulis auxit, plurimis Exemplis illustravit, et Grammaticam utriusque Linguæ præmisit Owen Manning,’ 2 vols. London, 1772. He also translated and annotated ‘The Will of King Alfred,’ from the original in Thomas Astle's library; this was printed in 1788, under the editorship of Sir Herbert Croft. "]}]}}