{"wiki_id": "http://www.wikidata.org/entity/Q5346518", "itemLabel": "Edwin Hill", "itemDescription": "British inventor", "wikipedia_url": "https://en.wikipedia.org/wiki/Edwin_Hill_(engineer)", "wikipedia_page": {"main": "Edwin Hill (25 November 1793 -  6 November 1876) was a Victorian postal official, the older brother of Rowland Hill, who invented a mechanical system to make envelopes and who campaigned for legal and political change.", "link_mentions": [{"page": "Highgate Cemetery", "response": ["* Edwin Hill, older brother of Rowland Hill and inventor of the first letter scale and a mechanical system to make envelopes"]}, {"page": "Science and invention in Birmingham", "response": ["1839: After many years of research, innovation and campaigning, Rowland Hill (of Kidderminster and later Birmingham) is given a two-year contract to run his new postal system. Hill is an English teacher, inventor and social reformer. He campaigns for a comprehensive reform of the postal system, based on the concept of penny postage and his solution of prepayment facilitates the safe, speedy and cheap transfer of letters. Hill later serves as a government postal official, and he is usually credited with originating the basic concepts of the modern postal service, including the invention of the postage stamp (his brother Edwin Hill helps the service with further innovations)."]}, {"page": "Thomas Wright Hill", "response": ["#Edwin Hill (1793–1876), mechanical inventor and writer on currency"]}, {"page": "Rowland Hill", "response": ["Another was Edwin Hill (1793-1876), who was the first British Controller of Stamps  from 1840 until 1872, and invented a mechanical system to make envelopes.I.D. Hill, \"Hill, Edwin (1793–1876)\", Oxford Dictionary of National Biography, Oxford University Press, September 2004; online edn, January 2008. Retrieved 13 October 2009. Yet another was the prison inspector Frederic Hill (1803-1896).Deborah Sara Gorham, ‘Hill, Rosamond Davenport (1825–1902)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, May 2007 "]}, {"page": "Edwin Hill", "response": ["Edwin Hill may refer to:", "* Edwin Hill (engineer) (1793–1876), British inventor (of envelope manufacturing machine), Controller of Stamps", "* Edwin Hill-Trevor, 1st Baron Trevor (1819–1894), styled as Lord Edwin Hill until 1862", "* Edwin Hill (born 1970), American novelist"]}, {"page": "Edwin Hill (U.K.)", "response": ["#REDIRECT Edwin Hill (engineer)"]}, {"page": "Edwin Hill (United Kingdom)", "response": ["#REDIRECT Edwin Hill (engineer)"]}]}}