{"wiki_id": "http://www.wikidata.org/entity/Q5346672", "itemLabel": "Edwin Moon", "itemDescription": "British aviation pioneer", "wikipedia_url": "https://en.wikipedia.org/wiki/Edwin_Moon", "wikipedia_page": {"main": "Squadron Leader Edwin Rowland Moon DSO* (8 June 1886 – 29 April 1920) was an English aviation pioneer who served in the Royal Naval Air Service and Royal Air Force during the First World War. He was a prisoner of war and he was twice awarded a DSO.", "link_mentions": [{"page": "Royal Naval Air Service", "response": ["* Edwin Moon – aviation pioneer, awarded the DSO. Forced landing in East Africa, led to capture by German forces"]}, {"page": "HMS Hyacinth (1898)", "response": ["Hyacinth remained on the Cape Station until the end of the war. On 23 March 1916 she sank the German merchant ship  in Dar-es-Salaam. In January 1917 she was stationed off Tanganyika, where she served as the depot ship for the Royal Naval Air Service. On 6 January, Squadron Leader Edwin Moon was on a reconnaissance flight with Commander Richard Bridgeman as observer, when they were forced to land with engine trouble and came down in a creek of the Rufiji River delta. Moon and Bridgeman wandered for days in the river delta before eventually building a makeshift raft which was swept out to sea. Bridgeman died of exposure but Moon was blown back to shore where he was taken into captivity. Moon was awarded a bar to his Distinguished Service Order for the display of \"the greatest gallantry in attempting to save the life of his companion\", together with the Royal Humane Society's silver medal for his attempts to save Bridgeman's life and the Legion of Honour – Croix de Chevalier. Bridgeman's body was recovered from the sea and is buried in Dar es Salaam Commonwealth War Graves Commission Cemetery. Hyacinth was paid off in August 1919 and sold for scrap on 11 October 1923.Colledge, p. 169"]}, {"page": "Moonbeam", "response": ["* Moonbeam II, plane flown by aviation pioneer Edwin Moon in 1910"]}, {"page": "Southampton Old Cemetery", "response": ["The headstone of the grave of the aviation pioneer, Squadron Leader Edwin Moon, was made from the propeller of the aircraft in which he was killed in 1920."]}, {"page": "North Stoneham", "response": ["The aviation pioneer, Edwin Moon, selected the flat field at North Stoneham Farm for his first flight in 1910, on what is now Southampton Airport. also known colloquially as Eastleigh. "]}, {"page": "The Wool House", "response": ["During the early part of the 20th century, the premises were occupied by The Moonbeam Engineering Company Limited who built motor launches and later expanded to include the sale of wrought iron propellers and marine engines for export around the world. Edwin Moon used a corner of the workshop to realise his dream of constructing and flying an aircraft of his own design which he flew from land at North Stoneham in 1910, on fields which subsequently became Southampton International Airport."]}, {"page": "Rowland Moon", "response": ["#REDIRECT Edwin Moon"]}, {"page": "Moon (surname)", "response": ["*Edwin Moon (1886–1920), British aviation pioneer and war hero"]}, {"page": "List of people from Hampshire", "response": ["*Edwin Moon, pilot, was born in Southampton"]}]}}