{"wiki_id": "http://www.wikidata.org/entity/Q5342045", "itemLabel": "Edward Brueton", "itemDescription": "Footballer (1871-?)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Brueton", "wikipedia_page": {"main": "Edward Brueton (1871 – after 1893) was an English footballer born in Penn, Staffordshire, who played in the Football League as a goalkeeper for Small Heath. He joined Small Heath from Stafford Rangers on trial in September 1894. Without even playing reserve team football, he stood in for regular goalkeeper Charles Partridge in the home game against Preston North End on 29 September, conceded four goals – the game finished as a 4–4 draw – and was back in non-league football with Willenhall Swifts by November.", "link_mentions": [{"page": "1894–95 Small Heath F.C. season", "response": ["thumb|right|upright|Beneficiary Fred Wheldon|alt=Head and shoulders of a young clean-shaven man with dark hair parted on the left of centre. He is looking to his right, and is wearing a light-coloured sports shirt with dark collar and trim.The Leicester Chronicle suspected that \"it will be a long time, perhaps, before we have another match so keenly contested\". The visitors scored early on, but Small Heath's shoot-on-sight policy produced goals for Hands, after a clash with Mobley left Preston goalkeeper James Trainer on the floor, and for Wheldon, before Edward Brueton, deputising in goal for the injured Partridge, let in a soft goal just before half-time. The second half brought \"more finesse and less vigour\" from the home side, but Preston grew stronger, took the lead, and Small Heath \"appeared to be done with\". Then Trainer could only turn Mobley's lob in off the post, the same player gave his side the lead, but \"before the Small Heath contingent had finished congratulating one another\", \"North End charging down the field finely from the centre kick scored again before the whistle sounded\" to make the final score 4–4. Match receipts totalled nearly £250, a ground record."]}]}}