{"wiki_id": "http://www.wikidata.org/entity/Q5345868", "itemLabel": "Edward Whitehead", "itemDescription": "English businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Whitehead", "wikipedia_page": {"main": "Walter Edward Whitehead (1908-1978), also known as Commander Whitehead, was an iconic advertisement representative of Schweppes Tonic Water, playing himself as a suave and cosmopolitan man of taste and distinction in a widely-distributed advertising campaign of the 1950s and 1960s. He was also a successful executive, being head of Schweppes' American operations.", "link_mentions": [{"page": "David Ogilvy (businessman)", "response": ["\"The man in the Hathaway shirt\" with his aristocratic eye patch which used George Wrangel as model; \"The man from Schweppes is here\" introduced Commander Edward Whitehead, the elegant bearded Brit, bringing Schweppes (and \"Schweppervescence\") to the U.S.; a famous headline in the automobile business, \"At 60 miles an hour the loudest noise in this new Rolls-Royce comes from the electric clock\";"]}, {"page": "Ogilvy (agency)", "response": ["To familiarize Americans with Schweppes, the agency created a spokesman named Commander Whitehead. Edward Whitehead, who was the company's president, was introduced as the Commander in a 1952 advertisement, which showed him arriving in New York with a briefcase labeled as the secrets of Schweppes. The campaign resulted in Schweppes becoming the standard tonic used in the country. The campaign continued into the 1960s."]}, {"page": "Edward whitehead", "response": ["#REDIRECT Edward Whitehead "]}, {"page": "List of people from Aldershot", "response": ["* Edward Whitehead - former Royal Navy officer better known for advertising Schweppes tonic water"]}, {"page": "Whitehead (surname)", "response": ["*Edward Whitehead (1908–1978), spokesman and later president of Schweppes"]}, {"page": "List of people from Hampshire", "response": ["*Edward Whitehead, advertising mascot, was born in Aldershot"]}, {"page": "Commander Whitehead", "response": ["#REDIRECT Edward Whitehead"]}]}}