{"wiki_id": "http://www.wikidata.org/entity/Q5343138", "itemLabel": "Edward Gordon Duff", "itemDescription": "British librarian", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Gordon_Duff", "wikipedia_page": {"main": "Edward Gordon Duff (16 February 1863 – 28 September 1924), known as Gordon Duff, was a British bibliographer and librarian known for his works on early English printing.", "link_mentions": [{"page": "John Rylands Research Institute and Library", "response": ["Librarians at John Rylands before its merger include Edward Gordon Duff in 1899 and 1900 and Henry Guppy between 1899 and 1948 (joint Librarian with Duff until 1900). Duff was responsible for the original library catalogue, compiled between 1893 and 1899: Catalogue of the Printed Books and Manuscripts in the John Rylands Library, Manchester; ed. E. G. Duff. Manchester: J. E. Cornish, 1899. 3 vols. The cataloguing of the books was done by Alice Margaret Cooke, a graduate of the Victoria University.Enriqueta Rylands, First Impressions, University of Manchester, Retrieved 5 January 2016 Dr Guppy began publication of the Bulletin of the John Rylands Library in 1903; it later became a journal publishing academic articles and from autumn 1972 the title was changed to the Bulletin of the John Rylands University Library of Manchester (further slight changes have occurred since).Publication was suspended for a few years (1909–13) but it has been published continuously since 1914, either two or three issues a year"]}, {"page": "Prince's Park, Liverpool", "response": ["During his time in Liverpool, James Martineau had a house in the park. Around 1863, the housing in the vicinity of the park contained the home of the parents of Edward Gordon Duff. Immediately prior to World War I, the headquarters of the 6th Rifle Battalion were based at Prince's Park Barracks. In 1918 the park was acquired by Liverpool City Council, becoming a fully public park."]}, {"page": "Wolvercote Cemetery", "response": ["* Edward Gordon Duff (1861–1924), bibliographer"]}, {"page": "Duff (surname)", "response": ["* Edward Gordon Duff, British bibliographer and librarian"]}, {"page": "Henry Guppy (librarian)", "response": ["Guppy was born in London and educated at City of London School. Before moving to the John Rylands he was Sub-Librarian of Sion College. When appointed librarian in 1899 it was jointly with Edward Gordon Duff; he became sole Librarian from October 1900. He was created Commander of the Order of the British Empire (CBE) in 1937. He was active in the Library Association of Great Britain and among his notable achievements are contributions to the reconstruction of the university library of Louvain between the World Wars and the founding of the Bulletin of the John Rylands Library in 1903. During much of his tenure in Manchester he resided at Buxton, where he died. He was survived by his wife Matilda, with whom he had two daughters, Lilian and Alberta."]}, {"page": "E. Gordon Duff", "response": ["#REDIRECT Edward Gordon Duff"]}, {"page": "List of Wadham College, Oxford people", "response": ["* Edward Gordon Duff, bibliographer and librarian"]}, {"page": "Joyce Pelgrim", "response": ["Very little is known about his early life. Most of the details about his life are known from the works of Edward Gordon Duff, who also wrote the article about him in the Dictionary of National Biography."]}, {"page": "Lists of English translations from medieval sources", "response": ["*Fifteenth century English books; a bibliography of books and documents printed in England and of books for the English market printed abroad (1917).Duff, E. Gordon (Edward Gordon). (1917). Fifteenth century English books; a bibliography of books and documents printed in England and of books for the English market printed abroad. [London]: Printed for the Bibliographical society at the Oxford university press. By British bibliographer Edward Gordon Duff (1861–1924).Gordon Goodwin (1887). \"Duff, William\". In Dictionary of National Biography. 16. London. pp. 131-132."]}, {"page": "List of English translations from medieval sources: C", "response": ["* William Caxton (1905).Duff, E. Gordon (Edward Gordon)., Chaucer, G., Caxton, W., Caxton Club. (1905). William Caxton. Chicago: The Caxton Club. By British bibliographer Edward Gordon Duff (1861–1924).Gordon Goodwin (1887). \"Duff, William\". In Dictionary of National Biography. 16. London. pp. 131-132."]}]}}