{"wiki_id": "http://www.wikidata.org/entity/Q5345230", "itemLabel": "Edward Savage", "itemDescription": "British footballer (born 1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Savage_(footballer)", "wikipedia_page": {"main": "Edward William J. Savage (born 15 November 1989) is an English footballer and former child actor.", "link_mentions": [{"page": "List of former EastEnders characters", "response": ["| Edward Savage"]}, {"page": "Laura Beale", "response": ["Laura Dunn first appeared in Albert Square when she is employed by local businessman Ian Beale (Adam Woodyatt) to work as a nanny for his children, Peter (Joseph Shade), Lucy (Casey Anne Rothery) and Steven Beale (Edward Savage). She becomes attracted to Ian but her attempts to get closer to him are unnoticed. Laura is protective of Ian and eventually he starts to see her as loyal and faithful, but mostly ends up using her for sex. Eventually, Laura demands more commitment and calls off their arrangement when he refuses. She later confinds to Ian's next-door neighbour Garry Hobbs (Ricky Groves) about this and they kiss; Ian is furious when he finds out and threatens to sack Laura. She later resigns and plans to leave Ian, but changes her mind upon learning that Ian is declared bankrupt due to his monetary troubles; she decides to stay for the sake of Ian's children and they become a couple. Laura tries to raise money to buy the fish and chip shop so they can run it together, secretly borrowing money from Ian's former wife Mel Healy (Tamzin Outhwaite). Eventually, Ian proposes marriage to Laura; she accepts despite facing opposition from her wealthy father, who distrusts Ian because of his narcissism and bankruptcy. In 2001, Ian and Laura get married. She later discovers that Ian has found out about an inheritance she received and wonders if Ian only wants her money. Ian convinces her this is not true."]}, {"page": "Steven Beale", "response": ["Steven Beale is a fictional character from the BBC soap opera EastEnders, played by Edward Farrell from 1989 to 1990, Stuart Stevens from 1992 to 1998, Edward Savage from 1998 to 2002, and Aaron Sidwell from 2007 to 2017. It was announced on 22 February 2008 that the character would be written out at the end of Sidwell's contract, and made his on-screen departure on 9 May 2008. On 2 May 2016, it was announced that Sidwell had returned to the role. Steven made his return on 27 May 2016. On 9 August 2017, it was announced that Sidwell would leave the show again. Steven made his final exit on 8 September 2017 when the character was killed off during a high-profile stunt week.", "Before his first screen birthday, Steven was central to storylines surrounding his parents and stepfather Ian, including a special week of off-set episodes filmed in Devon, where Ian discovered that his best friend Simon was Steven's real father and that he had reunited with Cindy. The love triangle between Simon, Cindy and Ian, and the events surrounding Steven's paternity dominated the soap during 1990; it has been described by writer Colin Brake as the year's \"big story\". Steven was written out of the serial after actors Nick Berry and Michelle Collins decided to leave the show. His exit aired on 27 December 1990, though in the on-screen events it was Boxing Day, Steven's first birthday. In 1992, Michelle Collins reprised her role of Cindy, and Steven was also reintroduced, played by a different actor, Stuart Stevens. On-screen, Simon abandoned Cindy and Steven. Ian traced them to a bedsit and brought them back to Walford, where Steven was brought up as Ian's real son. Steven was written out once again in 1996, when Collins quit for a second time. In the on-screen events, Cindy absconded with Steven and his brother Peter following Cindy's failed attempt to have Ian assassinated. Upon his return in 1997 – where Ian once again regained custody – Steven's role was recast to another actor, Edward Savage. As the character aged, his actor was given a more substantial role in the serial, Steven remaining with Ian following the death of his mother, who died in prison during child birth. Savage remained in the role until 2002, when he opted to leave. On-screen, Steven discovered that Ian had been lying about his paternity. He began rebelling, and was found to be the author of several mysterious poison pen letters. When he was caught, he demanded to travel to New Zealand, so he could meet his real father, Simon Wicks. A BBC source commented to the Daily Star, \"Regular viewers will know Steven is a deeply troubled boy. But his unmasking as the poison pen author is going to shock everyone on the Square. The lad is almost inviting punishment. It's as if he wants Ian and [his stepmother] Laura to wash their hands of him. Could Steven be a new Nick Cotton in the making?\""]}, {"page": "John Hampden Grammar School", "response": ["* Edward Savage, actor and footballer"]}, {"page": "Savage (surname)", "response": ["*Edward Savage (footballer) (born 1989), English actor"]}, {"page": "List of EastEnders characters (1989)", "response": ["Steven Beale is played by Edward Farrell from 1989 to 1990, Stuart Stevens from 1992 to 1996, Edward Savage from 1997 to 2002, and Aaron Sidwell from 2007 to 2008 and 2016 to 2017. Steven is born on 26 December 1989 to Cindy Beale and Simon Wicks (Michelle Collins and Nick Berry). Cindy is married to Ian Beale (Adam Woodyatt), and she convinces him that he is Steven's father.  Cindy tells Ian the truth when she and Simon reconcile. They leave Walford with Steven in December 1990; however, Ian and Cindy reconcile in 1992, and Ian raises Steven as his son, even after Cindy's death in 1998. Steven goes to live in New Zealand with his biological father Simon in 2002, but returns to Walford in 2007. However Steven's return has disastrous consequences for Ian and his family, and he flees in 2008 after being disowned by Ian. Steven made his return on 27 May 2016 and was killed off on 8 September 2017 during a high-profile stunt week."]}, {"page": "List of EastEnders characters (1993)", "response": ["Lucy Beale, played by Eva Brittin-Snell from 1993 to 1996, Casey Anne Rothery from 1996 until 2004, Melissa Suffield from 2004 to 2010 and Hetti Bywater from 2012 to 2015 is the daughter of Ian (Adam Woodyatt) and Cindy Beale (Michelle Collins). She is the twin sister of Peter (Thomas Law), and has three half siblings, older brother Steven (Edward Savage, Aaron Sidwell), younger sister Cindy (Eva Sayer) and younger brother Bobby (Alex Francis). Apart from her on-screen birth, the character has few storylines of her own until 2004 when the role was recast to an older actress. Storylines featuring Lucy have since focused upon her teenage rebellion. In 2010, Suffield left EastEnders, after she was allegedly axed due to \"unruly behaviour.\" On 14 November 2011, it was announced Lucy would be returning in 2012 with Bywater taking over the role. She returned on 12 January 2012. In February 2014 it was announced that the character would be killed off. She made her final appearance on 22 April 2014 when her father goes to identify her body. In July 2007, Gareth McLean of The Guardian lamented the lack of strong female characters in EastEnders, noting that Lucy \"is yet to come into her own\". Fellow Guardian critic Grace Dent commented on the repetitive nature of EastEnders storylines by comparing Lucy's relationship with Jane (Laurie Brett) to the fraught mother-daughter bond between Kat (Jessie Wallace) and Zoe Slater (Michelle Ryan).", "Peter Beale, played by Francis Brittin-Snell from 1993 to 1996, Alex Stevens from 1997 to 1998, Joseph Shade from 1998 to 2004, James Martin from 2004 to 2006, Thomas Law from 2006 until 2010 and Ben Hardy from 2013 onwards, is the son of Ian (Adam Woodyatt) and Cindy Beale (Michelle Collins). He is the twin brother of Lucy (Hetti Bywater), and has three half siblings, older brother Steven (Edward Savage, Aaron Sidwell), younger sister Cindy (Eva Sayer) and younger brother Bobby (Alex Francis). Peter left EastEnders on 24 December 2010, with a return not ruled out but unconfirmed. Peter was introduced in 1993 along with his twin sister Lucy, and was originally played by Francis Brittin-Snell as a baby and toddler from 1993 to 1996. In 1997, the role was given to Alex Stevens and he played Peter until 1998. Joseph Shade took over until 2004 and James Martin played him from 2004 until 2006. It was announced on 17 August 2006 that actor Thomas Law had been cast as Peter. Law said of the role: \"I couldn't believe it when I heard that I got the part, I'm really excited as I am a big fan of EastEnders.\" He made his first appearance on 31 August 2006. He is described on the EastEnders website as being laid back, and Ian's \"golden boy\". In May 2009, Executive producer Diederick Santer praised the younger cast of EastEnders, including Law. Stuart Heritage from The Guardian expressed a dislike for Peter in April 2010, saying he should be written out, \"before his increasingly spectacular haircut goes power mad and starts to colonise the entire set. Also, his voice has been breaking for what seems like seven full years, so he could probably use his new-found free time to consult a doctor or something.\""]}, {"page": "Aaron Sidwell", "response": ["Sidwell was born in 1988 in Maidstone, Kent and grew up in the village of Kingswood, Kent. He was given a drama scholarship when he was eleven years old at Bethany School. He started his acting career on stage and was a member of All Saints Choir. He worked for several years on the stage. Shortly after leaving, his big break came when he was cast as Steven Beale in the BBC soap opera, EastEnders; he took over the role from Edward Savage, who last appeared in 2002. Sidwell left the role in 2008."]}, {"page": "List of British former child actors", "response": ["*Edward Savage (born 1989)"]}, {"page": "Edward Savage", "response": ["Edward Savage may refer to:", "*Edward Savage (footballer) (born 1989), English footballer and former actor ", "*Edward Savage (artist) (1761–1817), American portrait painter and engraver", "*Edward Savage 1628 MP for Midhurst (UK Parliament constituency)", "*Edward Savage (died c. 1622), MP for Newton and Stockbridge"]}, {"page": "Edward Savage (actor)", "response": ["#REDIRECT Edward Savage (footballer)"]}, {"page": "List of EastEnders characters (2000)", "response": ["Laura Beale, played by Hannah Waterman, is employed by local businessman Ian Beale (Adam Woodyatt) as a nanny for his children, Peter (Joseph Shade), Lucy (Casey Anne Rothery) and Steven Beale (Edward Savage). The two eventually become a couple, but when Laura announces that she wants a baby, Ian has a secret vasectomy. When Laura becomes pregnant, Ian throws her out, believing that the baby cannot be his. However, it is later revealed that Ian is the father of Laura's child after all. Laura was killed off on 30 April 2004 after falling down the stairs and breaking her neck, with her arch-enemy Janine Butcher (Charlie Brooks) being accused of murdering her."]}]}}