{"wiki_id": "http://www.wikidata.org/entity/Q5342955", "itemLabel": "Edward Ford", "itemDescription": "English courtier", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Ford_(courtier)", "wikipedia_page": {"main": "Sir Edward William Spencer Ford  (24 July 1910 – 19 November 2006) was a courtier in the Royal Households of King George VI and Queen Elizabeth II.  He is perhaps best known for writing to the Queen's private secretary regarding the 40th year of the Queen's reign, having hoped that the Queen would experience an annus mirabilis but instead finding 1992 an annus horribilis.  She used the phrase in a speech to describe a year in which one of her four children was divorced, two more formally separated from their spouses, and Windsor Castle caught fire.", "link_mentions": [{"page": "Farouk of Egypt", "response": ["As Farouk was extremely popular with the Egyptian people, it was decided by the Prime Minister, Ali Maher, that Farouk should not return to Britain as that would be unpopular, though one of the regents, Prince Mohammad Ali, had wanted Farouk to keep trying to be admitted on a full-time basis to the Royal Military Academy as a means of getting him out of the country. Since under Egyptian law women could not inherit the throne, Farouk's cousin Prince Mohammad Ali was next in line to the throne. Prince Mohammad Ali was to spend the next 16 years scheming to depose Farouk so he could become king.  Egypt was in the process of negotiating a treaty that would reduce some of the British privileges in Egypt and make the country more independent in exchange for keeping Egypt in the British sphere of influence. The ambitions of Benito Mussolini to dominate the Mediterranean led the Wafd—traditionally the anti-British party—to want to keep the British presence in Egypt, at least as long as Mussolini kept calling the Mediterranean Mare Nostrum. For both the Wafd and the British, it was convenient to keep Farouk in Egypt so that when he signed the new Anglo-Egyptian treaty, it would not be seen as under duress as it would be if Farouk was living in Britain. Sir Miles Lampson believed he together with assorted other British officials like the king's tutor, Edward Ford, could mould Farouk into an Anglophile. Lampson's plans were derailed when it emerged that Farouk was more interested in duck-hunting than Ford's lectures and that the king had \"bragged\" he would \"have the hell\" with the British, saying they had humiliated him for long enough.", "Sir Edward Ford, who served as the king's tutor, described him as a relaxed, gregarious and easy-going teenager whose first act upon meeting him in Alexandria was to take him swimming in the Mediterranean. However, Ford also described Farouk as incapable of learning and \"totally incapable of concentration\". Whenever Ford began a lesson, Farouk would immediately find a way to end it by insisting that he take Ford out for a drive to see the Egyptian countryside. In an interview in 1990, Ford described Farouk as: \"He was half a private schoolboy of nine or ten and half a sophisticated young man of twenty-three, able to sit next to a great man like Lord Rutherford and impress him a great deal, usually by bluffing. He did have a very good eye, a royal eye. In England, he was able to spot the most valuable rare book in the Trinity College library in Cambridge. It may have been pure luck. But it impressed everyone. And he spoke wonderful English and Arabic\". In turn, Farouk explained to Ford why upper-class Egyptian men were still using the titles left over from the Ottoman Empire such as pasha, bey and effendi, which Ford learned that a pasha was equivalent to being an aristocrat, a bey was equivalent to a title of knighthood and an effendi to being an esquire. Ford wrote in his notebook: \"A pasha may perhaps be defined as a person who looks important, a bey thinks himself important, an effendi hopes to be important\". When Farouk went on his tour of Upper Egypt in January 1937, going down the Nile on the royal yacht Kassed el Kheir, Ford complained that Farouk never asked for a single lesson, as he was more interested in watching the latest films from Hollywood. Despite the fact that Upper Egypt was the poorest region in Egypt, various mudirs (governors) and sheikhs held camel races, gymnastic events, stick boxing matches, banquets and concerts in honor of the king, which led Ford to write of a \"record of unrivaled stardom, of which Greta Garbo might well be envious\"."]}, {"page": "Annus horribilis", "response": ["The \"sympathetic correspondent\" was later revealed to be her former assistant private secretary, Sir Edward Ford. The unpleasant events which happened to the royal family in this year include:How the royal family bounced back from its 'annus horribilis', The Guardian, 24 May 2012"]}, {"page": "Robert Brand, 1st Baron Brand", "response": ["* Virginia Brand (1918–1995), who married John Metcalfe Polk (1908–1948), the son of Frank Polk, the former United States Under Secretary of State, in 1952. After Polk's death in 1948, Virginia married Maj. Edward Ford (1910–2006), son of Lionel Ford, in 1949."]}, {"page": "Private Secretary to the Sovereign", "response": ["|Lieutenant-Colonel Sir Edward Ford, "]}, {"page": "Deaths in November 2006", "response": ["*Sir Edward Ford, 96, British assistant and private secretary to King George VI and Queen Elizabeth II (1946–1967)."]}, {"page": "2006 in the United Kingdom", "response": ["** Edward Ford, courtier, Private Secretary to the British monarch (1946–1967) (born 1910)"]}, {"page": "Chester Square", "response": ["*Edward Ford, private secretary to Queen Elizabeth II, lived at No. 16 during the 1950s "]}, {"page": "1910 in the United Kingdom", "response": ["* 24 July – Edward Ford, courtier (died 2006)"]}, {"page": "West Downs School", "response": ["*Sir Edward Ford (courtier);"]}, {"page": "List of University of Oxford people in British public life", "response": ["| Edward Ford"]}, {"page": "Edward Ford", "response": ["Edward Ford may refer to:", "* Edward Ford (surgeon) (1746–1809), British surgeon", "* Edward Ford (courtier) (1910–2006), courtier in the Royal Household of King George VI and Queen Elizabeth II", "* Edward Ford (soldier) (1605–1670), English soldier and inventor", "* Edward Ford (physician) (1902–1986), Australian soldier, academic and physician", "* Edward Ford (born 1914), brother of United States President Gerald Ford"]}, {"page": "Lionel Ford", "response": ["*Edward Ford (1910-2006), a courtier in the Royal Household of King George VI and Queen Elizabeth II, who married the widow Virginia Brand Polk, daughter of Robert Brand, 1st Baron Brand, in 1949."]}, {"page": "Index of World War II articles (E)", "response": ["# Edward Ford (courtier)"]}, {"page": "Neville Ford", "response": ["Ford was born at Repton, the son of the Rev Lionel Ford and his wife May Talbot. His father was then headmaster of Repton School and in 1910 became headmaster of Harrow School. His mother was the daughter of education campaigner Lavinia Talbot and Edward Stuart Talbot, who was Bishop of Rochester, Southwark and Winchester. Ford's brother Sir Edward Ford became assistant private secretary first to King George VI and then to Queen Elizabeth II."]}, {"page": "Edward William Spencer Ford", "response": ["#REDIRECT Edward Ford (courtier)"]}]}}