{"wiki_id": "http://www.wikidata.org/entity/Q5342223", "itemLabel": "Edward Carter Preston", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Carter_Preston", "wikipedia_page": {"main": "Edward Carter Preston (7 July 1885 – 2 March 1965)  was an English artist, born and died in Liverpool. He was a renowned sculptor and medallist. The artist designed the bronze memorial plaques presented to the families of British servicemen and women who died during the First World War. Another major commission for the artist began in 1931 when the architect Giles Gilbert Scott asked him to produce a series of sculptures for the Liverpool Anglican Cathedral. The project was an immense undertaking which occupied the artist for the next thirty years. The work for the cathedral included fifty sculptures, ten memorials and several reliefs.\nPreston is the brother-in-law of sculptor Herbert Tyson Smith. He was the father of the potter Julia Carter Preston.", "link_mentions": [{"page": "Distinguished Flying Cross (United Kingdom)", "response": ["The decoration, designed by Edward Carter Preston, is a cross flory,  wide. The horizontal and bottom bars are terminated with bumps, the upper bar with a rose. The decoration's face features aeroplane propellers, superimposed on the vertical arms of the cross, and wings on the horizontal arms. In the centre is a laurel wreath around the RAF monogram, surmounted by a heraldic Imperial Crown."]}, {"page": "Air Force Cross (United Kingdom)", "response": ["* The medal is a silver cross,  in height and  wide, representing aircraft propeller blades, with wings between the arms. It was design by Edward Carter Preston."]}, {"page": "Liverpool Cathedral", "response": ["In 1931, Scott asked Edward Carter Preston to produce a series of sculptures for Liverpool Cathedral. The project was an immense undertaking which occupied the artist for the next thirty years. The work for the cathedral included fifty sculptures, ten memorials and several reliefs. Many inscriptions in the cathedral were jointly written by Dean Dwelly and the sculptor who subsequently carved them."]}, {"page": "Commemorative plaque", "response": ["After the First World War, the families of British and British Empire (now Commonwealth) service men and women killed during the conflict were presented with bronze Memorial Plaques. The plaques, of about  in diameter, were designed by the eminent sculptor and medallist, Edward Carter Preston."]}, {"page": "War Medal 1939–1945", "response": ["The War Medal 1939–1945 is a disc,  in diameter. The non-swivelling straight bar suspender is attached to the medal with a single-toe claw mount and a pin through the upper edge of the medal. The British issue medals were struck in  cupro-nickel, while those awarded in Canada (about 700,000) were struck in silver. The medal is sometimes incorrectly referred to as the \"Victory Medal\" for the Second World War.Crompton, Ann, Edward Carter Preston 1885 – 1965, (Liverpool): University of Liverpool Art Gallery, 1999, ", "The reverse shows a lion standing wanton on the body of a double-headed dragon. The dragon's heads are those of an eagle and a dragon, to signify the principal occidental and oriental enemies during the Second World War. At the top, just to the right of centre are the years \"1939\" and \"1945\" in two lines. The initials \"ECRP\" of designer Edward Carter Preston are near the rim at the nine o'clock position. Preston also designed the bronze memorial plaque which was presented to the next-of-kin of British servicemen and women who fell during the First World War."]}, {"page": "Edward Carter", "response": ["*Edward Carter Preston (1885–1965), English artist"]}, {"page": "List of medallists", "response": ["*Edward Carter Preston (1885-1965)"]}, {"page": "3rd World Scout Jamboree", "response": ["For the event a memorial sculpture by sculptor Edward Carter Preston was erected in 1931 at an entrance to the park, now within the grounds of Arrowe Park Hospital. It was commissioned by the Boy Scout Movement, and unveiled by Lord Hampton, the Headquarter's Commissioner. After restoration in the early 1980s, it was re-unveiled in 1983 by the then Chief Scout Major-General Michael Walsh."]}, {"page": "Memorial Plaque (medallion)", "response": ["It was decided that the design of the plaque, was to be chosen from submissions made in a public competition.  Over 800 designs were submitted  and the competition was won by the sculptor and medallist Edward Carter Preston using the pseudonym Pyramus, receiving two first place prizes of £250 for his winning and also an alternative design. The name Pyramus comes from the story of Pyramus and Thisbē which is part of Ovid's Metamorphoses, a Roman tragedy narrative poem."]}, {"page": "Mercantile Marine War Medal", "response": ["The Memorial Plaque is a medallion designed by Edward Carter Preston, struck in bronze and  in diameter, which shows Britannia with two dolphins behind her and a male lion in the foreground. Around the perimeter the medallion is inscribed \"HE*DIED*FOR*FREEDOM*\" at left and \"*AND*HONOVR\" at right. The deceased's full name is in relief in a rectangular frame above the lion's head. The exergue depicts the defeat of the Prussian eagle by the British lion. More than a million plaques were produced to commemorate the sacrifice of military and mercantile marine men and women who fell between 4 August 1914 and 30 April 1920.The Great War Memorial Plaque – The Memorial Plaque (Access date 30 March 2015)"]}, {"page": "Korea Medal", "response": ["Designed by Edward Carter Preston, the Korea Medal is in the form of a  diameter disc. All medals were of cupro-nickel, except for the Canadian version that was made of silver."]}, {"page": "Herbert Tyson Smith", "response": ["George Herbert Tyson Smith (1883–1972), was an English sculptor born in Liverpool. He executed many works in the Liverpool and Merseyside area, in particular war memorials. He was the brother-in-law of fellow Liverpool sculptor Edward Carter Preston. Carter Preston designed the \"Next of Kin Memorial Plaque\"\"The Next of Kin Memorial Plaque\" The Great War 1914-1918. Retrieved 21 October 2012 He was the uncle of the potter Julia Carter Preston."]}, {"page": "List of people with surname Preston", "response": ["*Edward Carter Preston (1885–1965), English artist"]}, {"page": "Julia Carter Preston", "response": ["Born in Liverpool, the youngest of four daughters of the sculptor Edward Carter Preston and his wife Marie (née Tyson Smith), a watercolourist and the sister of the sculptor Herbert Tyson Smith, Julia Carter Preston attended the Liverpool Institute High School for Girls, Blackburne House.Preston's obituary in The Daily Telegraph 18 January 2012 While studying at the Liverpool College of Art in the 1940s she discovered a passion for ceramics and chose to specialise in pottery, passing her pottery examination and gaining a National Diploma in Art in 1951. Following this, Carter Preston taught ceramics at several colleges in Liverpool and became Head of Ceramics and taught pottery at the Liverpool College of Art when John Lennon and Stuart Sutcliffe were students there. She held this post until the mid-1970s. During the 1960s she worked for a period as Wedgwood's official lecturer in the north-west. In 1960 she married Michael Pugh Thomas, a marine biologist and environmental scientist.Brown, E. Myra, Julia Carter Preston - Publisher: National Museums & Galleries on Merseyside (1999)  There were no children of the marriage."]}, {"page": "Ann Compton (art historian)", "response": ["* Edward Carter Preston 1885-1965: Sculptor, Painter, Medallist"]}]}}