{"wiki_id": "http://www.wikidata.org/entity/Q5342180", "itemLabel": "Edward Cadogan", "itemDescription": "British politician (1880-1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Cadogan", "wikipedia_page": {"main": "The Honourable Sir Edward Cecil George Cadogan, KBE, CB (15 November 1880 – 13 September 1962) was a British, Conservative politician.\nCadogan was a younger son of the 5th Earl Cadogan and his wife, Beatrix, a daughter of the 2nd Earl Craven. He was educated at Eton and Balliol College, Oxford before training as a barrister.\nFrom 1911 to 1921, he was Secretary to the Speaker of the House of Commons, James Lowther and also fought in World War I as a Major in the Suffolk Yeomanry. Lowther retired in 1921 and Cadogan was awarded the CB that year. A year later, he entered the Commons as Member of Parliament (MP) for Reading in 1922. He subsequently represented the seats of Finchley and Bolton and was a member of the Indian Statutory Commission from 1927 to 1930.\nCadogan was interested in penal reform, and particularly in the problems of young offenders.  He chaired a committee which unanimously recommended abolishing the sentence of whipping (except in prisons), a provision adopted by Home Secretary James Chuter Ede in the Criminal Justice Act 1948.  He was knighted in 1939 and fought with the RAF during World War II. He died unmarried and childless in 1962.", "link_mentions": [{"page": "List of MPs elected in the 1924 United Kingdom general election", "response": ["|Hon. Edward Cadogan"]}, {"page": "Simon Commission", "response": ["*Edward Cadogan, MP for Finchley (Conservative)"]}, {"page": "Alexander Cadogan", "response": ["Cadogan was brought up in a distinguished and wealthy aristocratic family as the seventh son and youngest child of George Cadogan, 5th Earl Cadogan, and his first wife Lady Beatrix Jane Craven, daughter of William Craven, 2nd Earl of Craven. He was the brother of Henry Cadogan, Viscount Chelsea, Gerald Cadogan, 6th Earl Cadogan, William Cadogan, and Sir Edward Cadogan. He was educated at Eton and Balliol College, Oxford,thepeerage.com Rt. Hon. Sir Alexander George Montagu Cadogan where he read History."]}, {"page": "Finchley (UK Parliament constituency)", "response": ["| Edward Cadogan"]}, {"page": "Reading (UK Parliament constituency)", "response": ["| Edward Cadogan"]}, {"page": "List of MPs elected in the 1931 United Kingdom general election", "response": ["|Hon. Edward Cadogan"]}, {"page": "List of United Kingdom by-elections (1931–1950)", "response": ["|Edward Cadogan"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|Hon. Edward Cadogan"]}, {"page": "List of MPs elected in the 1922 United Kingdom general election", "response": ["|Hon. Edward Cadogan"]}, {"page": "Edward Cecil George Cadogan", "response": ["#REDIRECT Edward Cadogan"]}, {"page": "Bolton (UK Parliament constituency)", "response": ["| Sir Edward Cadogan", "However, in the by-election held in 1940 no other parties contested the seat due to the War-time electoral pact meaning that the Conservative candidate Edward Cadogan was elected unopposed."]}, {"page": "Records of members of parliament of the United Kingdom", "response": [":Edward Cadogan: 1924, 1940 b"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Sir Edward Cadogan; MP for Reading (1922–1923), Finchley (1924–1935) and Bolton (1940–1945)"]}, {"page": "T. Atholl Robertson", "response": ["Robertson faced a new Conservative opponent in 1924 and was unable to hold his seat, losing to the Hon. Edward Cadogan by 4,335 votes. He tried to regain the seat at the 1929 general election but the Labour Party now also stood a candidate and although he again came second to Cadogan, Robertson was still 4,855 votes in arrears, with Labour in third place.F W S Craig, British Parliamentary Election Results 1918–1949; Political Reference Publications, Glasgow, 1949 p424 After a period of reflection, Robertson decided to resign as prospective Parliamentary candidate for Finchley and was replaced by Lady Crosfield who had fought Islington North in 1929 and was the wife of Sir Arthur Crosfield the former Liberal MP for Warrington.The Times, 11 June 1930 p11"]}, {"page": "Edward Cadogan (disambiguation)", "response": ["Edward Cadogan (1880–1962) was a British politician.", "Edward Cadogan may also refer to:", "*Edward Cadogan (rower) (1833–1890), British clergyman and rower who won Silver Goblets at Henley Royal Regatta", "*Edward Cadogan (cricketer) (1908–1993), English cricketer"]}, {"page": "Eton Manor Boys' Club", "response": ["In 1909 four Old Etonian philanthropists founded Eton Manor Boys' Club to provide sporting facilities separate from the Eton Christian Mission. They were Gerald V. Wellesley; Arthur Villiers, the second son of Victor Child Villiers, 7th Earl of Jersey; Edward Cadogan, the sixth son of George Cadogan, 5th Earl Cadogan; and Alfred Wagg of the City of London Wagg banking family. Gerald Wellesley passed on the leadership of the club to Arthur Villiers after the Great War; Villiers remained the primary guiding force behind the club until its closure.Geraldine Bedell, \"To the Manor born\", The Guardian, 28 July 2007. He lived at Eton Manor Boys' Club from 1913 until his death in 1969."]}, {"page": "1940 Bolton by-election", "response": ["The Bolton by-election of 1940 was held on 13 September 1940.  The by-election was held due to the death of the incumbent Conservative MP, John Haslam.  It was won by the Conservative candidate Edward Cadogan, who was unopposed due to the War-time electoral pact."]}, {"page": "Cadogan, Edward", "response": ["#redirectEdward Cadogan"]}]}}