{"wiki_id": "http://www.wikidata.org/entity/Q5346823", "itemLabel": "Edwin Smith", "itemDescription": "English cricketer (born 1934)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edwin_Smith_(cricketer,_born_1934)", "wikipedia_page": {"main": "Edwin Smith (born 2 January 1934) is a former county cricketer who played for Derbyshire between 1951 and 1971 and took over 1200 wickets.\nSmith was born in Grassmoor, Derbyshire. He played his entire first-class career for Derbyshire, playing 503 First Class matches in a career spanning 20 years from 1951 to 1971.\nSmith was primarily an off-spin bowler and took 1217 first-class wickets at an average of 25.84, with 51 5 wicket innings and a best performance of 9 for 46. He was also a useful lower middle order batsman and scored nearly 7000 runs with a highest score of 90.England had a number of very good off-spin bowlers during Smith's career, including Jim Laker, Fred Titmus, David Allen and Ray Illingworth, which restricted his opportunities to play Test cricket.", "link_mentions": [{"page": "Ed Smith", "response": ["Ed, Eddie, Edgar, Edward, Edwin Smith and similar may refer to:", "*Edwin Smith (Medal of Honor) (1841–?), American Civil War sailor and Medal of Honor recipient", "*Edwin Smith (cricketer, born 1934), Derbyshire cricketer", "*Edwin Smith (cricketer, born 1848) (1848–1880), English cricketer", "*Edwin Smith (cricketer, born 1860) (1860–1939), English cricketer", "*Edwin Smith (rower) (1922–1997), New Zealand rower, silver medalist at the 1950 Empire Games", "*Edwin Smith (footballer), Crystal Palace football's second best goalscorer of all time", "*Edwin Smith (metallurgist) (1931–2010), metallurgy scientist", "*Edwin Smith (Egyptologist) (1822–1906), American antiquities collector", "*Edwin Smith (photographer) (1912–1971), English photographer", "*Edwin Smith (architect) (1870–1965), New South Wales Government Architect 1929–1935"]}, {"page": "Derbyshire County Cricket Club", "response": ["There have been more downs than ups in post-war years. Though runs came regularly from Arnold Hamer and less consistently from the West Indian Laurie Johnson and captain Donald Carr, the batting remained the weak point right up to the beginning of covered pitches in the 1980s. However, a series of seam bowlers served England as well as Derbyshire. The list began with Copson and continued with Cliff Gladwin, Les Jackson, Harold Rhodes, Alan Ward, Mike Hendrick and, most recently, Devon Malcolm and Dominic Cork. Spin was in short supply apart from the steady work of Edwin Smith and the under-rated all-rounder Geoff Miller, the current national selector of the England team and noted after-dinner speaker. The signing of Eddie Barlow, the famous South African, in 1976 and the lengthy period under the captaincy of Kim Barnett, starting in 1983, meant the side were rarely uncompetitive.", "|Edwin Smith || 1,209"]}, {"page": "Michael Page (cricketer)", "response": ["Page was born in Blackpool. He began his career with Nottinghamshire and Lancashire, for whom he played briefly for the Second XI, though it was with Derbyshire that he was to decide to play first-class cricket. He signed a professional contract in 1964. Page's Derbyshire debut, in June 1964, was a steady one, as he scored 25 and aided team-mate Edwin Smith in a seventh-wicket partnership of 57 against Worcestershire. In August of the same year he scored 112 against Leicestershire at Chesterfield, the first of nine centuries which included a career-best of 162 against LeicestershireLeicestershire v Derbyshire 1969 in 1969."]}, {"page": "Derbyshire County Cricket Club in 1951", "response": ["The club retained a virtually unchanged squad with only one newcomer -  Edwin Smith who played on for 20 years."]}, {"page": "List of Marylebone Cricket Club players (1946–1977)", "response": ["* Edwin Smith (1956–1967) : E. Smith (Derbyshire)"]}, {"page": "Grassmoor, Hasland and Winsick", "response": ["*Edwin Smith (born 1934), cricketer"]}]}}