{"wiki_id": "http://www.wikidata.org/entity/Q5344126", "itemLabel": "Edward Levett Darwin", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Levett_Darwin", "wikipedia_page": {"main": "Capt. Edward Levett Darwin (12 April 1821 – 23 April 1901) was the author under the pen-name High Elms of The Game-preserver's Manual: Containing Instructions in All That Relates to Getting Up and Maintaining a Good Head of Game (1859), which shows keen observation of the habits of various animals, and went through at least five editions.\nEdward Levett Darwin was the son of Sir Francis Sacheverel Darwin and his wife Jane Harriet Ryle.  He was a cousin of Sir Francis Galton and half-cousin of Charles Darwin, their shared ancestor being their grandfather, physician and poet Erasmus Darwin.He grew up at Breadsall Priory, near Derby.  He was a captain in the Derby Regiment of Militia from 1856. In 1850 he married Harriett Jessopp, (1825 – 1889), daughter of Francis and Ann Jessopp of Derby. (Francis Jessopp was once Derby's solicitor and an attorney, owner of Jacobean House and under-sheriff for the county of Derbyshire.) The 1851 Census records Darwin and his wife residing at Dale House in Matlock Bath with his occupation as solicitor (attorney), while Kelly's Directory of 1855 records him as a solicitor living in Matlock Bath. Darwin had settled in the area where Erasmus Darwin had recommended the waters to Josiah Wedgwood.\nEdward Levett Darwin is buried along with his wife in the churchyard of St John the Baptist's Church at Burbage, Derbyshire.", "link_mentions": [{"page": "Buxton", "response": ["Buxton's popularity was boosted by a recommendation from Erasmus Darwin of the waters there and at Matlock, addressed to Josiah Wedgwood I. The Wedgwood family often visited Buxton and recommended the area to their friends. Two of Charles Darwin's half-cousins, Edward Levett Darwin and Reginald Darwin, settled there.Charles Darwin, Frederick Burkhardt and Sydney Smith. The Correspondence of Charles Darwin, Cambridge University Press, Cambridge, 1985  The arrival of the railway in 1863 stimulated growth: the population of 1,800 in 1861 exceeded 6,000 by 1881.Railways of the Peak District, Blakemore & Mosley, 2003 "]}, {"page": "Matlock Bath", "response": ["In 1698 warm springs were discovered and a bath house was built. As the waters became better known, access was improved by the building of the bridge into Old Matlock and in 1783, the opening of a new entrance at the south of the valley. Princess Victoria of Kent's royal visit in 1832 confirmed Matlock as a society venue of the time. Victoria's party visited a pair of museums and a petrifying well.RA VIC/MAIN/QVJ (W) 23 October 1832 (Queen Victoria's handwriting). Retrieved 2013-05-24 John Ruskin and Lord Byron were visitors, Byron comparing it with alpine Switzerland, leading to a nickname of Little Switzerland.  Erasmus Darwin had recommended the area to Josiah Wedgwood I for its beauty and soothing waters, and members of the families vacationed and settled there. Edward Levett Darwin, son of Francis Sacheverel Darwin, lived at Dale House in Matlock Bath, where he was a solicitor."]}, {"page": "Sir John Lubbock, 3rd Baronet", "response": ["He largely rebuilt the family home of High Elms,The name of the Lubbock family estate, High Elms, would later be the pseudonym under which Edward Levett Darwin, cousin of Charles Darwin, authored his book Gameskeeper's Manual. near Downe village in Kent. His property was on the other side of the village to the land belonging to Down House, and when Charles Darwin and Emma Darwin were house-hunting in 1842, Darwin told his sister all about Down House, noting that Lubbock was the owner of  and was building a grand house nearby. Darwin said: \"I believe he is very reserved & shy & proud or fine—so I suspect he will be no catch, & will never honour us\". When word reached Sir John William Lubbock, he went home and hinted at a great piece of news without immediately disclosing what it was. His son, John, wondered whether the news might be the announcement of a pony of his own, and was disappointed at first to learn that it was merely the news that Charles Darwin would soon be living at Down House. The families were on friendly terms, and young John Lubbock frequently visited Down House, becoming a close friend of Darwin's. In 1846, Lubbock rented land near Down House to Darwin, who had it planted as woodland and laid out with the Sandwalk which became Darwin's daily walk."]}, {"page": "Darwin–Wedgwood family", "response": ["* Edward Levett Darwin (12 April 1821 – 23 April 1901), married Harriett Jessopp during 1850. A solicitor in Matlock Bath, Derbyshire, Edward Levett Darwin was the author, using the pseudonym \"High Elms\", of Gameskeeper's Manual, a guide for tending game on large estates which shows keen observation of the habits of various animals."]}, {"page": "Francis Sacheverel Darwin", "response": ["* Edward Levett Darwin (12 April 1821 – 1901)", "He transmitted his love of natural history to his son Edward Levett Darwin, author (under the name of \"Hugh Elms\") of a 'Gamekeeper's Manual' (4th edition 1863), which shows keen observation of the habits of various animals."]}, {"page": "Breadsall Priory", "response": ["The physician and poet Erasmus Darwin, grandfather of Charles Darwin, moved to Breadsall shortly before his death in 1802. The house was subsequently home to his son Sir Francis Sacheverel Darwin (1786–1859).  Sir Francis' son Edward Levett Darwin, author of the Gameskeeper's Manual (under the pseudonym \"High Elms\"), learnt natural history in its grounds."]}, {"page": "Edward L. Darwin", "response": ["#REDIRECT Edward Levett Darwin"]}, {"page": "Erasmus Darwin Leavitt Jr.", "response": ["Leavitt Curiously, there was an Edward Levett Darwin, born in 1821 in Derbyshire, England, who was the grandson of Erasmus Darwin. first achieved professional prominence in 1873 for his design of a novel pumping engine. From 1874–1904 he served as consulting engineer for the Calumet and Hecla Mining Company, where he designed more than 40 types of engines for a variety of uses for the company's Michigan mines. Each huge stationary steam engine was named, much like a steam locomotive or ship, with names including the Arcadia, Chippewa, Frontenac, Mackinac, Marquette, and Superior."]}, {"page": "Darwin (surname)", "response": ["**Edward Levett Darwin (1821–1901), solicitor and author"]}]}}