{"wiki_id": "http://www.wikidata.org/entity/Q5343766", "itemLabel": "Edward Jewesbury", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Jewesbury", "wikipedia_page": {"main": "Reginald Edward Oliphant Jewesbury (6 August 1917 – 31 March 2001) was an English actor, notable for his film, stage and television work and as a member of the Renaissance Theatre Company. In his later years he appeared in such television comedies as Yes Minister and Blackadder II.In 1995 he appeared in Richard III as King Henry VI of England.", "link_mentions": [{"page": "Henry VI of England", "response": ["In screen adaptations of these plays Henry has been portrayed by: James Berry in the 1911 silent short Richard III; Terry Scully in the 1960 BBC series An Age of Kings which contained all the history plays from Richard II to Richard III; Carl Wery in the 1964 West German TV version König Richard III; David Warner in The Wars of the Roses, a 1965 filmed version of the Royal Shakespeare Company performing the three parts of Henry VI (condensed and edited into two plays, Henry VI and Edward IV) and Richard III; Peter Benson in the 1983 BBC version of all three parts of Henry VI and Richard III; Paul Brennen in the 1989 film version of the full cycle of consecutive history plays performed, for several years, by the English Shakespeare Company; Edward Jewesbury in the 1995 film version of Richard III with Ian McKellen as Richard; James Dalesandro as Henry in the 2007 modern-day film version of Richard III; and Tom Sturridge as Henry to Benedict Cumberbatch's Richard III in the 2016 second BBC series The Hollow Crown, an adaptation of Henry VI (condensed into two parts) and Richard III."]}, {"page": "Yes Minister", "response": ["* Various Chief Whips, usually acting in Yes Minister as a \"gatekeeper\" to the unseen Prime Minister.  The first Chief Whip, Vic Gould, was played by Edward Jewesbury in two episodes of Yes Minister.Opening episode, \"Open Government\", broadcast on 25 February 1980 Gould was initially intended to be a more prominent character in the series, as the writers thought he would continually force Hacker to pursue policies unappealing to Sir Humphrey, and thus lead to greater conflict.  They quickly found that Gould's character was largely unnecessary, and that the Hacker/Sir Humphrey conflicts worked just as well without him. In \"Party Games\", a later Chief Whip, played by James Grout and identified as \"Jeffrey\", conspires with Sir Humphrey to ensure that Hacker becomes Prime Minister. In 2 episodes of Yes, Prime Minister, Jeffrey is now played by Peter Cartwright. (In the novelizations, the character is given the full name of Jeffrey Pearson.)  Jeffrey is clueless about an alleged Cabinet plot against the Prime Minister ... because there is none, and Hacker is pursuing a false trail laid by Sir Humphrey. "]}, {"page": "2000 in film", "response": ["| Beautiful People || Trimark Pictures || Jasmin Dizdar (director/screenplay); Rosalind Ayres, Julian Firth, Charles Kay, Charlotte Coleman, Edward Jewesbury, Danny Nussbaum, Heather Tobias, Roger Sloman, Walentine Giorgiewa, Faruk Pruti, Dado Jehan, Nicholas Farrel || Comedy || Live action", "| The 10th Kingdom || NBC / Hallmark Entertainment || David Carson, Herbert Wise (directors); Simon Moore (screenplay); Kimberly Williams, John Larroquette, Scott Cohen, Dianne Wiest, Rutger Hauer, Ed O'Neill, Camryn Manheim, Ann-Margret, Daniel Lapaine, Hugh O'Gorman, Dawnn Lewis, Jeremiah Birkett, Warwick Davis, Robert Hardy, Edward Jewesbury, John Hallam, Edward Highmore, Frank Middlemass, Peter Vaughan, Lucy Punch, Natasha Collins, John Shrapnel, Jimmy Nail, Aden Gillett, Gudrun Ure, Amelda Brown, Liz May Brice, Moira Lister, Timothy Bateson, Jeffry Wickham, Sheila Steafel, Adam James, Nigel Whitmey, Leon Herbert, James Cosmo, Adam Levy, Bob Barrett, Douglas Blackwell, Marcus Clarke || Fantasy || Live action", "| Dungeons & Dragons || New Line Cinema || Courtney Solomon (director); Carroll Cartwright, Topper Lilien (screenplay); Justin Whalin, Marlon Wayans, Jeremy Irons, Thora Birch, Bruce Payne, Zoe McLellan, Kristen Wilson, Edward Jewesbury, Lee Arenberg, Richard O'Brien, Tom Baker || Fantasy, Comedy || Live action"]}, {"page": "1995 in film", "response": ["| Richard III || United Artists || Richard Loncraine (director/screenplay); Ian McKellen (screenplay); Ian McKellen, Annette Bening, Jim Broadbent, Robert Downey Jr., Kristin Scott Thomas, Maggie Smith, Adrian Dunbar, Dominic West, John Wood, Nigel Hawthorne, Edward Hardwicke, Tim McInnerny, Jim Carter, Tres Hanley, Roger Hammond, Donald Sumpter, Bill Paterson, Kate Steavenson-Payne, Christopher Bowen, Matthew Groom, Marco Williamson, Edward Jewesbury, Michael Elphick, Stacey Kent || Drama || Live action"]}, {"page": "1996 in film", "response": ["| A Midwinter's Tale || Rank Film Distributors / Castle Rock Entertainment || Kenneth Branagh (director/screenplay); Michael Maloney, Richard Briers, Hetta Chamley, Joan Collins, Nicholas Farrell, Mark Hadfield, Gerard Horan, Celia Imrie, Jennifer Saunders, Julia Sawalha, John Sessions, Ann Davies, James D. White, Robert Hines, Allie Byrne, Adrian Scarborough, Brian Pettifer, Patrick Doyle, Shaun Prendergast, Carol Starks, Edward Jewesbury, Katy Carmichael, Paul Randles || Romance, Comedy || Live action"]}, {"page": "1989 in film", "response": ["| Henry V || The Samuel Goldwyn Company / BBC Films || Kenneth Branagh (director/screenplay); Kenneth Branagh, Paul Scofield, Derek Jacobi, Ian Holm, Emma Thompson, Alec McCowen, Judi Dench, Christian Bale, James Larkin, Simon Shepherd, Brian Blessed, Charles Kay, Nicholas Ferguson, Edward Jewesbury, Danny Webb, Ian Holm, Jimmy Yuill, John Sessions, Shaun Prendergast, Patrick Doyle, Michael Williams, Robbie Coltrane, Richard Briers, Geoffrey Hutchings, Robert Stephens, Michael Maloney, Nigel Greaves, Harold Innocent, Richard Easton, Colin Hurley, Geraldine McEwan, David Lloyd Meredith, Christopher Ravenscroft, David Parfitt, James Simmons, Paul Gregory, Tom Whitehouse, Fabian Cartwright, Stephen Simms, Jay Villiers, Richard Clifford, Julian Gartside || Drama || Live action"]}, {"page": "Henry VI, Part 3", "response": ["Richard Loncraine's 1995 filmic adaptation of Richard Eyre's 1990 stage production of Richard III features considerably less material from 3 Henry VI than had Olivier's film. Starring Ian McKellen as Richard (reprising his role from the stage production), John Wood as Edward, Nigel Hawthorne as George and Annette Bening as Queen Elizabeth, the film begins prior to the Battle of Tewkesbury, with Henry VI (portrayed by Edward Jewesbury) still in power. The opening scene depicts Henry and his son Edward (played by Christopher Bowen) preparing for the forthcoming battle. However, a surprise attack is launched on their headquarters by Richard, and both are killed. This scene is without dialogue. The last line of 3 Henry VI is also used in the film; Edward's \"For here I hope begins our lasting joy\" appears as a subtitle after the coronation of Edward and is altered to read \"And now, they hope, begins their lasting joy\", with \"they\" referring to the House of York. The film then moves on to the coronation of Edward IV (again without dialogue), before Richard delivers the opening speech of Richard III as an after-dinner toast to the new king. Like Olivier's film, Loncraine includes several characters in the coronation scene who are not present in the text of 3 Henry VI; Buckingham (played by Jim Broadbent), Richmond (played by Dominic West) and Elizabeth Plantagenet (played by Kate Steavenson-Payne). Richmond will later go on to be Henry VII, and Elizabeth (King Edward's daughter) will become his queen. As with Jane Shore, Elizabeth is mentioned several times in Richard III, although she never appears in the text. Loncraine's film also used a line from 3 Henry VI in its poster campaign – \"I can smile and murder whiles I smile\" (3.2.182), although \"whiles\" was changed to \"while.\" This line is also included in the film – after Richard concludes his opening speech to Edward, he enters the men's room and continues in soliloquy form to line twenty-seven of Richard III before then referring back to the earlier play \"Why, I can smile and murder while I smile/And wet my cheeks with artificial tears/And frame my face to all occasions\" (ll. 182-185). The film then moves on to the arrest of George."]}, {"page": "Sleeping Murder", "response": ["*Edward Jewesbury as Mr Sims"]}, {"page": "Richard III (1995 film)", "response": ["* Edward Jewesbury as King Henry VI"]}, {"page": "Ace of Wands (TV series)", "response": ["4 episodes. Ceribraun (Oscar Quitak) sets out to steal a huge diamond called the Eye of Ra which it is claimed will turn people into chalk. Tarot traces him and is made prisoner of a talking computer who plans to use giant chess pieces to crush him to death. Featuring Edward Jewesbury as Mr Quince, Nicholas Smith as Fredericks, Charles Morgan as the Computer."]}, {"page": "Dungeons & Dragons (2000 film)", "response": ["* Edward Jewesbury as Vildan Vildir "]}, {"page": "In the Bleak Midwinter (film)", "response": ["* Edward Jewesbury as Nina's Father"]}, {"page": "List of Blackadder characters", "response": ["*Kate's Father (Edward Jewesbury) – the father of \"Bob\", or rather Kate. As he had grown too old to support himself and his daughter, he was in favour of the idea of Kate becoming a prostitute. Instead, she decided to go to London, disguise herself as a boy, and seek her fortune. (\"Bells\")"]}, {"page": "The Kraken Wakes", "response": ["| Capt. Winters RN || Edward Jewesbury || William Oxborrow"]}, {"page": "Espionage (TV series)", "response": ["| The Frantick Rebel || 12 February 1964 || Michael Powell || Roger Livesey, Stanley Baxter, Jill Bennett, Bernard Bresslaw, Max Adrian, Graham Crowden, Gordon Gostelow, Edward Jewesbury, Declan Mulholland, Edna Doré, Patsy Byrne, Pauline Boty"]}, {"page": "Uncle Fred Flits By", "response": ["The story was adapted into a radio drama in 1955, broadcast on the BBC Home Service, with D. A. Clarke-Smith as Uncle Fred, Derek Hart as Pongo, Brian Haines as Wilberforce Robinson, Alison Leggatt as Connie Parker, T. St. John Barry as Claude Parker, Joan Harrison as Julia Parker, and Edward Jewesbury as Mr Roddis. Clarke-Smith had voiced Mr Roddis in the 1939 radio adaptation."]}, {"page": "The Dark Island", "response": ["*Edward Jewesbury — George Hammond"]}, {"page": "Highlander: The Series (season 5)", "response": ["* Edward Jewesbury ... Jason Landry"]}, {"page": "Bells (Blackadder)", "response": ["*Edward Jewesbury as Kate's Father"]}, {"page": "Crown Court (TV series)", "response": ["Regular actors included William Mervyn, John Barron, John Horsley, Edward Jewesbury, Richard Warner, Richard Caldicot, Basil Dignam, Laurence Hardy, Frank Middlemass, and Basil Henson as judges, John Alkin, David Ashford, Keith Barron, Jonathan Elsom, Bernard Gallagher, Peter Jeffrey, Charles Keating, Maureen Lipman, T. P. McKenna, Dorothy Vernon, Richard Wilson, William Simons and Robert Stephens were among the most common faces as barristers.", "* Edward Jewesbury as The Hon. Mr. Justice Bragge"]}, {"page": "I, Claudius (TV series)", "response": ["* Edward Jewesbury as Titus"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Edward Jewesbury"]}, {"page": "Sexton Blake (TV series)", "response": ["* Edward Jewesbury as  Dr. John Mangini"]}, {"page": "Churchill and the Generals", "response": ["* Edward Jewesbury - Neville Chamberlain"]}, {"page": "Persuasion (1960 TV series)", "response": ["* Edward Jewesbury as Charles Musgrove"]}, {"page": "Look Back in Anger (1989 film)", "response": ["Look Back in Anger is a 1989 British videotaped television production of John Osborne's play. It features Kenneth Branagh, Emma Thompson, Siobhan Redmond, Gerard Horan, and Edward Jewesbury. It was directed by Judi Dench; and produced by Humphrey Barclay, Moira Williams, and First Choice Productions for Thames Television.", "* Colonel Redfern - Edward Jewesbury"]}, {"page": "The Mauritius Penny", "response": ["* Edward Jewesbury as Maitland "]}, {"page": "Jewesbury", "response": ["#REDIRECT Edward Jewesbury"]}, {"page": "Deaths in March 2001", "response": ["*Edward Jewesbury, 83, English actor,."]}, {"page": "Cultural depictions of prime ministers of the United Kingdom", "response": ["*Edward Jewesbury in Churchill and the Generals (1979)"]}, {"page": "Forgotten (TV series)", "response": ["* Edward Jewesbury as Bernard Clivedon "]}]}}