{"wiki_id": "http://www.wikidata.org/entity/Q5344798", "itemLabel": "Edward Pearce", "itemDescription": "English political journalist and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Pearce_(journalist)", "wikipedia_page": {"main": "Edward Robin Pearce (28 March 1939 – 9 February 2018) was an English political journalist and writer, known for being a leader writer for The Daily Telegraph and The Guardian, and writing a number of biographies of political figures.", "link_mentions": [{"page": "Hillsborough disaster", "response": ["The journalist Edward Pearce was criticised for writing a controversial article in the aftermath of the disaster, at a time when a number of victims' funerals were taking place. His column in The Sunday Times on 23 April 1989, included the text:"]}, {"page": "Michael Heseltine", "response": ["* Edward Pearce, The Golden Talking-Shop, Oxford University Press, 2016, , a history of the Oxford Union Society during the first half of the twentieth century, based on official minutes."]}, {"page": "Rab Butler", "response": ["Edward Pearce wrote of his legislative record that \"Rab's failure was more brilliant than most politicians' success.\"Pearce 1997, p. 14."]}, {"page": "John Biffen", "response": ["As Leader of the House, Biffen used the guillotine to cut short debate on the European Communities (Amendment) Act 1986. Edward Pearce has written that Biffen \"was widely thought the best post-war floor leader\".Ramsden, John (ed.), The Oxford Companion to 20th-Century British Politics (Oxford University Press, 2002), p. 55."]}, {"page": "Antony Lambton", "response": ["Following the scandal, Lambton retired, separated from his wife and bought Villa Cetinale, a 17th-century villa in Tuscany, where he lived with Claire Ward, née Baring, mother of actress Rachel Ward and daughter of the cricketer Giles Baring.Anonymous.  Lord Lambton (obituary), The Times 2 January 2007. Retrieved 7 August 2007.Edward Pearce, \"Obituary: Lord Lambton\", The Guardian 2 January 2007. Retrieved 7 August 2007. Note that Claire Ward is called Clare Ward here. He never divorced his wife Bindy, who died in 2003."]}, {"page": "Peter Shore", "response": ["He fought for the leadership again after Foot resigned, but obtained a dismal vote of 3%, being unsupported by any Constituency Labour Party. Shore served as Shadow Leader of the House of Commons for four years under Neil Kinnock but his influence with the leadership was negligible and he was not re-elected to the Shadow Cabinet in 1985. He stood down from the front bench in 1987 and thereafter served on the Foreign Affairs Select Committee, devoting himself to European Union questions. Edward Pearce wrote in his Guardian obituary of Shore that \"he had now become a right-wing figure, cluckingly approved of by Conservatives\"."]}, {"page": "The Moral Maze", "response": ["Notable former panellists include Rabbi Hugo Gryn (who died in 1996), Janet Daley, Edward Pearce, Geoffrey Robertson, Michael Mansfield, politician Michael Gove, Claire Fox, Ian Hargreaves, Kenan Malik, scientist Steven Rose, philosophers Simon Blackburn and Roger Scruton, and historian David Starkey, who often attracted controversy for his blunt manner."]}, {"page": "Belfast Castle", "response": ["The vast country estates of the Donegall family, which had been inherited by the Shaftesbury family in October 1883, were largely broken up and sold off under The 9th Earl of Shaftesbury during the 1890s and during the first decade of the twentieth-century. While the town of Belfast had been sold off by The 3rd Marquess of Donegall back in the 1850s, the Donegall family continued to own a large estate in County Antrim and large parts of Inishowen until these passed to the Shaftesburys in October 1883. Under the various Land Acts passed by the British Parliament during the 1880s, 1890s and early twentieth-century (especially under the Wyndham Land Act of 1903 F.S.L. Lyons, Ireland Since The Famine, pp. 218-219. Fontana Press, London, 1985 (paperback; originally published by Fontana in 1963). Philip Bull, Land, Politics and Nationalism: A Study of the Irish Land Question, pp. 155-157. Gill and Macmillan, Dublin, 1996 (paperback edition). D.J. Hickey and J.E. Doherty, A New Dictionary of Irish History From 1800, pp. 259-260. Gill and Macmillan, Dublin, 2003. Jonathan Bardon, A History of Ulster, p. 418. The Blackstaff Press, Belfast, 2001 (hardback, updated edition).), the huge country estates in Ireland, including those of the Shaftesbury family in Ulster, were broken up and sold off, mainly being sold to the tenant farmers who actually lived on and farmed the land. R.F. Foster, Modern Ireland, 1600-1972, p. 381 and pp. 412-414. Penguin Books, London, 1989 (paperback edition). Edward Pearce, Lines of Most Resistance: The Lords, The Tories and Ireland, 1886-1914, pp. 104-106, p. 383, and p. 395. Little, Brown and Company, London, 1999. D.J. Hickey and J.E. Doherty, A New Dictionary of Irish History From 1800, pp. 258-260. Gill and Macmillan, Dublin, 2003. Joseph Byrne, Byrne's Dictionary of Irish Local History, p. 160, pp. 174-176, pp. 252-253, and p. 329. Mercier Press, Cork, 2004."]}, {"page": "John Carlisle (British politician)", "response": ["In one of his interventions in a 1987 House of Commons debates, he claimed that \"the system of apartheid in South Africa has worked in terms of government\", although he claimed not to support it.\"The Commonwealth and South Africa Hansard, HC Deb, 13 November 1987, vol 122 cc676-741, 737-38 Nevertheless, this defence of the South African government prompted journalist Edward Pearce to label him \"the member for Bloemfontein West\".Almanac of British Politics, Robert Waller"]}, {"page": "Encounter (magazine)", "response": ["Edward Pearce, a regular contributor to the magazine in the 1980s, claimed that Encounter's editors reassigned him from political writing to theatre criticism after he repeatedly used his Encounter column to criticise the Thatcher government.", "* Edward Pearce (66)"]}, {"page": "Queen Elizabeth Sixth Form College", "response": ["* Edward Pearce, political journalist, (1950–7)"]}, {"page": "1980 Labour Party leadership election (UK)", "response": ["Over the weekend following the announcement of Callaghan's resignation Foot faced pressure to run, including from his wife. Indeed, he commented that if he did not run \"my wife might divorce me.\" Foot also said he believed he could bring peace to the Labour Party, which was badly divided. Political journalist William Russell reported that Foot's intervention meant the prospects of a Healey win on the first ballot went from  being \"fair\" to being \"dashed\". For Shore the impact was arguably even more significant. Edward Pearce would later write that while Shore had initially been seen as \"a serious leadership contender, as candidate of the left against Healey\", the nomination of Foot meant that his prospects \"went to nothing\". Foot's profile was given a boost when Callaghan asked him, in his position as deputy leader, to replace him at Prime Minister's Questions, until a new leader was elected."]}, {"page": "Wilfred Fienburgh", "response": ["Commentators have expressed varying views of Fienburgh. Anthony Howard described him (in The Times 7 November 2000) as \"rather louche\", and Denis Healey asserted in his autobiography The Time of My Life (1989) that Fienburgh's \"good looks and big brown eyes often led him astray\". Edward Pearce, writing in The Guardian, described him as a \"delightful and amusing Labour politician\". Peter Hitchens in his book The Abolition of Britain described him as \"one of the most talented men on the party's Left\". Fienburgh was allegedly involved in an altercation with Jennie Lee during the Labour Party conference in 1952, according to Lee's biographer Patricia Hollis."]}, {"page": "Edward Pearce", "response": ["Eddie or Edward Pearce may refer to:", "* Edward Pearce (businessman) (1862–1928), Chairman of the Shanghai Municipal Council", "* Edward Pearce (journalist) (1939–2018), English political journalist and writer", "* Edward Pearce (politician) (1833–1922), New Zealand businessman", "* Edward Pearce, Baron Pearce (1901–1990), British judge", "* Edward Pearce (British Army officer), British Army general, father of Edward Lovett Pearce", "es:Edward Pearce"]}, {"page": "Giles Baring", "response": ["He married firstly, on 25 May 1935, Mona Montgomerie Mullins, the daughter of Colonel Willoughby Brooking Mullins of Ambersham House, Midhurst, Sussex, and they had one daughter, Claire Leonora Baring, born 29 February 1936 and died 4 August, 2019, who was married to (and then divorced from) the Hon. Peter Alistair Ward (a son of the 3rd Earl of Dudley). (accessed 14 October 2007) Claire Baring then lived with the late Lord Lambton (d. 30 December 2006) at Villa Cetinale in Italy until his death, but they never married.Anonymous. Lord Lambton (obituary). The Times 2 January 2007. . Retrieved 7 August 2007.Edward Pearce. \"Obituary: Lord Lambton\" The Guardian 2 January 2007. Retrieved 7 August 2007. Note that Claire Ward is called Clare Ward here."]}, {"page": "List of Question Time episodes", "response": ["|Edward Pearce, Nancy Seear, John Smith, Norman Tebbit"]}, {"page": "2018 in literature", "response": ["**Edward Pearce, English biographer and playwright, 78 (born 1939)"]}, {"page": "Deaths in February 2018", "response": ["*Edward Pearce, 78, English political journalist and writer."]}, {"page": "List of advocates of republicanism in the United Kingdom", "response": ["*Edward Pearce (1939–2018), New Statesman contributorGarner, Clare; Cohen, Nick; Jury, Louise (3 March 1996). New republicans: there are more than you think. The Independent."]}, {"page": "Simpkin & Marshall", "response": ["Simpkin & Marshall was a British bookseller, book wholesaler and book publisher. The firm was founded in 1819 and traded until the 1940s.Simpkin & Marshall, britishmuseum.org. Retrieved 1 November 2021. For many decades the firm was Britain's largest book wholesalerChester W, Topp, Victorian Yellowbacks & Paperbacks, 1849-1905, Volume VIII, Denver, Colorado: The Heritage Antiquarian Bookshop, 2008, pp. xi-xii. and a respected family-owned company,Edward Pearce, \"Trading as: self-employed or New Age serf?\", The Guardian, 6 August 1994, p. 25. but it was acquired by the media proprietor Robert Maxwell and went bankrupt in 1954, an event which, according to Lionel Leventhal, \"sounded a warning to the book trade about Captain Robert Maxwell's way of doing business\".\"Bookselling can kill you\", The Bookseller, 12 August 2004. Retrieved 6 November 2021.", "In the early 1950s Simpkin Marshall, as the firm was then commonly known, was a book wholesaler with debts of $A575,000.Paul McGeough and John Lyons, \"Cap'n Crook\", The Sydney Morning Herald, 21 December 1991, p. 43. Robert Maxwell purchased it for the sum of $A115,000 and it continued to operate as a publishing warehouse company and a wholesale book distribution company within his business empire.\"Christopher Downes: charismatic theatre dresser\", The Independent, 22 December 2003, p. p. 50. He used the company to raise funds, on which it paid interest, but then made generous interest-free loans to his private companies. In four years, he \"ran the company into the ground\". According to Edward Pearce, Maxwell had used the \"high reputation of the old-fashioned family company he had taken over... for purposes of predatory credit\". Simpkin, Marshall was declared insolvent in 1954Robert Verkalk, \"The mystery of Robert Maxwell's death\", The Independent, 10 March 2006, p. 2. and its assets and good will were purchased by Hatchards.FOB: Firms Out of Business Search Results 141 - 150 of 153, Harry Ransom Center, hrc.utexas.edu. Retrieved 6 November 2021."]}]}}