{"wiki_id": "http://www.wikidata.org/entity/Q5346207", "itemLabel": "Edwin Ardener", "itemDescription": "British social anthropologist/academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Edwin_Ardener", "wikipedia_page": {"main": "Edwin Ardener (1927–1987) was a British social anthropologist and academic. He was also noted for his contributions to the study of history. Within anthropology, some of his most important contributions were to the study of gender, as in his 1975 work in which he described women as \"muted\" in social discourse.A graduate of the LSE, Ardener took up an Oxford lectureship in social anthropology at the invitation of E. E. Evans-Pritchard. His ethnographic research concentrated on Africa, particularly on Cameroon. His history of the Bakweri of Cameroon in the nineteenth century is regarded as definitive. In his works about Cameroon, he also wrote about a form of witchcraft in Cameroon known as Nyongo.One of his best-known contributions to anthropology came in the 1975 article \"\"The Problem\" revisited\", in Perceiving Women, a volume edited by his wife and fellow anthropologist Shirley Ardener. In this essay he advanced the theory that women have been a muted group, comparatively unheard in social discourse, whose relative silence might also be seen as a function of the dominant group's deafness to them. He identified a problematic tendency in anthropological methodology to talk only to men and about women, thereby ignoring at least half the sample of people they were supposed to be observing. Ardener diagnosed the problem as a result of the fact that ethnographic methods were both devised and verified by male anthropologists, who did not realise what they were overlooking.", "link_mentions": [{"page": "John Rupert Firth", "response": ["His approach can be considered as resuming that of Malinowski's anthropological semantics, and as a precursor of the approach of semiotic anthropology.Edwin Ardener (editor) (1971) Social anthropology and language, Milton B. Singer (1984) Man's glassy essence: explorations in semiotic anthropology Anthropological approaches to semantics are alternative to the three major types of semantics approaches: linguistic semantics, logical semantics, and General semantics.Winfried Nöth (1995) Handbook of semiotics p.103 Other independent approaches to semantics are philosophical semantics and psychological semantics."]}, {"page": "Ewale a Mbedi", "response": ["Historians and anthropologists such as Edwin Ardener, Ralph A. Austen, and Jonathan Derrick suggest that the Ewale narrative is \"quite plausible because it is not very pretentious in either chronological or ideological terms.\" The gap between Ewale and the first Duala leaders corroborated in European sources is logically sound and does not suggest a great deal of mythology.Austen and Derrick 9. Nor is Ewale an obviously mythologised heroic figure. Nevertheless, Ewale occupies a nebulous position between history and myth, meaning that he may have been several generations further into the past than modern Duala oral histories place him.Ardener and Ardener 363-4."]}, {"page": "Mbongo", "response": ["Mbongo does not seem to be a historical figure. Rather, he is a symbol of the ancient past and an inhabitant of a mythological age.Ardener and Ardener 364. Edwin Ardener calls him a \"shadowy\" figure and ascribes him to a \"proto-tradition\" of the coastal peoples.Ardener 28. Edwin Ardener and Shirley Ardener place Mbongo in the \"legendary or mythical stratum\" of Sawa oral histories.Ardener and Ardener 363.", "The Sawa highly esteem descent from Mbongo as a marker of ethnic inclusion. A Bakweri honorific, mokpel'anembongo, translates as \"free-born and descended from Mbongo\".Austen and Derrick 14. Edwin Ardener proposes that the names of many of Cameroon's coastal ethnic groups historically derived from the name Mbongo. For example, in 1668, a Dutch writer named O. Dapper, drawing from the records of Samuel Blommaert, described a people called the Kalbongos at the Rio del Rey: \"The people who live higher up the river [from a coastal trading settlement], by them called Kalbongos, are bold men, but villainous rogues.\"Dapper, Dr. O. (1668). Naukeurige Beschrijvinge der Afrikanische Gewesten. Amesterdam. Quoted in Ardener 14. Dapper also recorded names such as Kalbanges, which may also derive from some form of Mbongo's name.Ardener 15–16. A later writer, John Barbot, wrote,  The name of Old Calabar, known as Calborch to the Dutch, may also derive from Calbongo, and ultimately Mbongo."]}, {"page": "Monneba", "response": ["Edwin Ardener equates Monneba with the Duala leader referred to in traditional genealogies as Mulobe a Ewale or Mulabe a Ewale.Ardener 16. This individual is placed one generation after Ewale a Mbedi, the eponymous father of the Duala people. Later academics Austen and Derrick accept the Monneba/Mulabe connection as \"very reasonable\".Austen and Derrick 15."]}, {"page": "Feminist anthropology", "response": ["*Edwin Ardener"]}, {"page": "Muted group theory", "response": ["Muted group theory (MGT), created by Edwin Ardener and Shirley Ardener in 1975, is a communication theory that focuses on how marginalized groups are muted and excluded via the use of language. The main idea of MGT is that \"Language serves its creators better than those in other groups who have to learn to use the language as best they can.\"", "in 1968, Edwin Ardener pointed out a phenomenon where anthropologists had difficulties reproducing models of the society from women's perspectives, if they (the models) do not conform to those generated by men. ", "thumbnail|Ardener's Dominant Group vs Muted Group|336x336pxMuted Group Theory was firstly developed in the field of cultural anthropology by the British anthropologist, Edwin Ardener. The first formulation of MGT emerges from one of Edwin Ardener's short essays, entitled \"Belief and the Problem of Women,\" in which Ardener explored the \"problem\" of women. In social anthropology, the problem of women is divided in two parts: technical and analytical. The technical problem is that although half of the population and society is technically made up of women, ethnographers have often ignored this half of the population. Ardener writes that \"those trained in ethnography evidently have a bias towards the kinds of model that men are ready to provide (or to concur in) rather than towards any that women might provide.\"Ardener, Edwin, & Chapman, Malcolm. (2007). The voice of prophecy and other essays. New York: Berghahn Books.  He also suggests that the reason behind this is that men tend to give a \"bounded model of society\" akin to the ones that ethnographers are attracted to.  Therefore, men are those who produce and control symbolic production in a society. This leads to the analytical part of the problem which attempts to answer the question: \"[…] if the models of society made by most ethnographers tend to be models derived from the male portion of that society, how does the symbolic weight of the other mass of persons express itself?\"", "Edwin Ardener saw that MGT had pragmatic as well as analytical potentials.  Edwin Ardener always maintained that MGT was not only, or even primarily, about women - although women comprised a conspicuous case in point. In fact, he also drew on his personal experience as a sensitive boy among hearty boys in an all-boys London secondary school. As a result of his early encounters with other boys, he identified with other groups in society for whom self-expression was constrained."]}, {"page": "Semiotic anthropology", "response": ["*Edwin Ardener (editor) (1971) Social anthropology and language, "]}, {"page": "Purity and Danger", "response": ["*Edwin Ardener in Man, New Series, 2:1 (1967), p. 139."]}, {"page": "Co-cultural communication theory", "response": ["Co-cultural communication theory was built upon the frameworks of muted group theory and standpoint theory. The cornerstone of co-cultural communication theory is muted group theory as proposed in the mid 1970s by Shirley and Edwin Ardener. The Ardeners were cultural anthropologists who made the observation that most other cultural anthropologists practicing ethnography in the field were talking only to the leaders of the cultures, who were by and large adult males. The researchers would then use this data to represent the culture as a whole, leaving out the perspectives of women, children and other groups made voiceless by the cultural hierarchy (S. Ardener, 1975).Ardener, Shirley, 1975. The Ardeners maintained that groups which function at the top of the society hierarchy determine to a great extent the dominant communication system of the entire society (E. Ardener, 1978).Ardener, Edwin, 1978. Ardener's 1975 muted group theory also posited that dominant group members formulate a \"communication system that support their perception of the world and conceptualized it as the appropriate language for the rest of society\".Orbe, 1998a, p. 20."]}, {"page": "Peter Taylor (environmentalist)", "response": ["Born in January 1948, Taylor was educated at Cowbridge Grammar School in Glamorgan, Wales from where he won an Open Scholarship to St Catherine's College, Oxford University. He graduated with honours in Natural Sciences from the School of Zoology in 1970. As a student he led a successful inter-university biological expedition to East Africa; After six years of what he describes in his autobiography Shiva's Rainbow as an adventurer and explorer, including a solo vehicle-crossing of the Sahara and climbing the Eiger, he returned to Oxford to study Social Anthropology under the linguistic anthropologist Edwin Ardener. Taylor has been a member of the Institute of Biology and is a Certified Biologist, a former member of the International Union of Radioecologists, the International Society for Radiation Protection and the British Ecological Society. He is currently a member of the Royal Anthropological Institute."]}, {"page": "September 1927", "response": ["*Born: Edwin Ardener, British anthropologist and historian (d. 1987)"]}, {"page": "Journal of the Anthropological Society of Oxford", "response": ["The Journal of the Anthropological Society of Oxford is a peer-reviewed academic journal of anthropology that was established in 1970. Publishing the print edition was discontinued in 2000 and in 2009 the journal was re-launched as an open access online journal without publishing fees (diamond open access). All the back-issues and occasional papers are available online. The editor-in-chief is Bob Parkin who has also written about the history of the journal.Oxford Anthropology as an Extra-Curricular Activity p 149 ff Malcolm Chapman also discusses the history in his introduction to Edwin Ardener's essays."]}, {"page": "Nyongo society", "response": ["The Nyongo Society is the name of a supposed group of witches believed to exist in Cameroon and Nigeria. The legends were first written about in the 1950s by British social anthropologist, Edwin Ardener, while describing what he called the Nyongo Terror in the present-day Southwest Province in Cameroon. Today the belief in this society can be found from the coast of Cameroon to the Bakossi and Beti peoples in the interior of the country. It is even found amongst the northern parts of the country with the Bamileke and Bamenda peoples."]}, {"page": "Shirley Ardener", "response": ["Shirley G. Ardener is a pioneer of research on women (doing women’s studies more-or-less avant la lettre) and a committed anthropological researcher working with Bakweri people in Cameroon since the 1950s, initially with her husband Edwin Ardener (1927–1987).", "* Kingdom on Mount Cameroon (annotated edition of papers by Edwin Ardener) Berghahn Books, 1996\t"]}]}}