{"wiki_id": "http://www.wikidata.org/entity/Q5341509", "itemLabel": "Edward Adolf Sonnenschein", "itemDescription": "English classics scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Adolf_Sonnenschein", "wikipedia_page": {"main": "Edward Adolf Sonnenschein (20 November 1851 – 2 September 1929, Bath) was an English classical scholar and writer on Latin grammar and verse.", "link_mentions": [{"page": "Mason Science College", "response": ["* Edward Adolf Sonnenschein,  Classical Scholar and writer on Latin grammar and verse"]}, {"page": "Sonnenschein", "response": ["* Edward Adolf Sonnenschein (1851–1929), English Classical Scholar and writer on Latin grammar and verse"]}, {"page": "List of Old Gowers", "response": ["* Professor Edward Adolf Sonnenschein, Litt. D. (OG 1867–68), philologist, Professor of Classics and Dean of the Faculty of Arts, the University of Birmingham"]}, {"page": "William Stallybrass", "response": ["He was the son of the publisher William Swan Sonnenschein and the nephew of the classical scholar Edward Adolf Sonnenschein, and was colloquially known at Oxford as \"Sonners\" for his former surname;\"Milestones, Nov. 8, 1948\", Time, 8 November 1948. Archived from the original on 1 February 2011. in 1917, together with his father, he took the surname of his great-grandfather, the Reverend Edward Stallybrass.\"Stallybrass, William Teulon Swan (1883–1948)\", The Encyclopaedia of Oxford, ed. Christopher and Edward Hibbert, London: Macmillan, 1988, , p. 440.\"Oxford's Stallybrass\", Time, 13 October 1947. "]}, {"page": "Swan Sonnenschein & Co.", "response": ["#REDIRECT Edward Adolf Sonnenschein"]}, {"page": "Adolf Sonnenschein", "response": ["#REDIRECT Edward Adolf Sonnenschein"]}, {"page": "List of University of Birmingham academics", "response": ["* Edward Adolf Sonnenschein, classical scholar and writer on Latin grammar and verse"]}, {"page": "William Swan Sonnenschein", "response": ["He was one of six children of Adolphus (Adolf) Sonnenschein, a teacher and writer originally from Moravia (now the Czech Republic) and his first wife, Sarah Robinson Stallybrass. One of his brothers was the English classical scholar Edward Adolf Sonnenschein."]}]}}