{"wiki_id": "http://www.wikidata.org/entity/Q5344469", "itemLabel": "Edward Miller Mundy", "itemDescription": "British politician (1750-1822)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Miller_Mundy_(1750%E2%80%931822)", "wikipedia_page": {"main": "Edward Miller Mundy (18 October 1750 – 18 October 1822) was an English landowner and Tory politician who was MP for the Derbyshire constituency.", "link_mentions": [{"page": "Edwin Tennyson d'Eyncourt", "response": ["On 1 March 1859, Tennyson d'Eyncourt was married to Lady Henrietta Pelham-Clinton (1819–1890), the youngest surviving daughter of Henry Pelham-Clinton, 4th Duke of Newcastle and his wife, the former Georgiana Elizabeth Mundy (daughter and heiress of Edward Miller Mundy of Shipley Hall). Together, they were the parents of:"]}, {"page": "Derbyshire (UK Parliament constituency)", "response": ["|rowspan=\"3\"| Edward Miller Mundy || rowspan=\"3\"|Tory"]}, {"page": "Nutbrook Canal", "response": ["The first moves to build a canal were made in 1791, when Edward Miller Mundy, the owner of Shipley Hall, and Sir Henry Hunloke of Wingerworth, owner of the West Hallam collieries, investigated the possibility of building a canal without an Act of Parliament. However, an Act was sought in 1792, but it was defeated in March, by objections from landowners who wanted it to be owned by a public company, rather than the mine owners. The canal engineer William Jessop was asked to produce a detailed design for the canal, which he estimated would cost £12,542 (),, and John Nuttall surveyed the route and produced detailed plans. The Act of Parliament authorising construction was obtained on 3 June 1793, and allowed the owners to raise £13,000, with a further £6,500 if required. Shares were given to investors by a formal agreement, as the canal was not a public company; public status would have prevented the colliery owners from obtaining their 50 per cent reduction of tolls on the Erewash Canal."]}, {"page": "Henry Pelham-Clinton, 4th Duke of Newcastle", "response": ["On his return to England in 1807, Pelham-Clinton embarked upon life with many personal advantages, and with a considerable fortune. He married at Lambeth, 18 July 1807, a great heiress, Georgiana Elizabeth, daughter of Edward Miller Mundy of Shipley, Derbyshire.", "On 18 July 1807 Pelham-Clinton married Georgiana Elizabeth, the only child and heiress of Edward Miller Mundy of Shipley Hall, and his second wife, Georgiana (née Chadwick) Willoughby (the former wife of Thomas Willoughby, 4th Baron Middleton and second daughter of Evelyn Chadwick of West Leake). They had eight sons and six daughters, including:"]}, {"page": "Lord Charles FitzRoy (British Army officer)", "response": ["On 20 June 1795, FitzRoy married Frances Mundy (d. 1797; the daughter of Edward Miller Mundy, MP) and they had one son, Sir Charles FitzRoy who was the governor of New South Wales, governor of Prince Edward Island and governor of Antigua. After his wife's death, he married Lady Frances Stewart (d. 1810; the eldest daughter of Robert Stewart, 1st Marquess of Londonderry) and they had three children:"]}, {"page": "Edward Miller Mundy (1800–1849)", "response": ["Edward Miller Mundy (10 November 1800 – 29 January 1849) was an English Conservative politician who sat in the House of Commons from 1841 to 1849.", "Miller was the son of Edward Miller Mundy and his wife Nelly Barton, daughter of James Barton, of Penwortham, Lancashire. His grandfather, who was also named Edward Miller Mundy, was a Member of Parliament for Derbyshire from 1784 until his death in 1822.Gentleman's Magazine 1849 Miller's father died in 1834, leaving him Shipley Hall."]}, {"page": "Mundy (surname)", "response": ["* Edward Miller Mundy (1750–1822), English MP for the Derbyshire constituency and Sheriff of Derbyshire", "* Edward Miller Mundy (1800–1849), English MP for the South Derbyshire constituency "]}, {"page": "Edward Miller Mundy (1750-1822)", "response": ["#REDIRECT Edward Miller Mundy (1750–1822)"]}, {"page": "George Mundy", "response": ["Admiral Sir George Mundy, KCB (3 March 1777 – 9 February 1861) was an officer of the British Royal Navy during the early nineteenth century, serving principally in the French Revolutionary and Napoleonic Wars. Born in Shipley Hall, Derbyshire, the son of politician Edward Miller Mundy, George Mundy joined the Navy at a young age and served in several of the principal actions of the French Revolutionary Wars. He subsequently held a succession of frigate commands during the Napoleonic Wars and was active in the blockade of the French coast and in assisting Spanish irregular forces during the Peninsular War. After the war Mundy remained in service and in 1830 was captain of the royal yacht Royal George. He was knighted in 1837 and continued to rise through the ranks, eventually becoming a full admiral in 1849.", "George Mundy was born at Shipley Hall, Derbyshire in 1777, one of five sons of Edward Miller Mundy, the prominent MP for Derbyshire, and his first wife, Frances Meynell. In July 1789, he entered the Royal Naval Academy and in 1792 graduated to become a midshipman in the frigate HMS Blanche. Over the next year he moved to HMS Pegasus and then the ship of the line HMS Victory and the frigate HMS Juno. In Juno he was embroiled in the Siege of Toulon at the start of the French Revolutionary Wars, when his ship sailed into Toulon harbour after it had been evacuated by the allies and came under heavy fire from French Republican gun batteries and escaped with significant damage.Gentleman's Magazine, 1861, p. 354"]}, {"page": "Robert Miller Mundy", "response": ["Robert Miller Mundy was born in Shipley Hall. Mundy was the son of Edward Miller Mundy and his third wife Catherine Coffin, widow of Richard Barwell. His father was a Member of Parliament for Derbyshire from 1784 until his death in 1822;Gentleman's Magazine 1849 his nephew, Edward Miller Mundy, held the same seat in 1841-49."]}, {"page": "List of United Kingdom by-elections (1818–1832)", "response": ["|25 November 1822||Derbyshire||u*||Edward Miller Mundy||Francis Mundy||Death"]}, {"page": "Edward Miller Mundy", "response": ["Edward Miller Mundy may refer to:", "* Edward Miller Mundy (1750–1822), MP for Derbyshire 1784–1822", "* Edward Miller Mundy (1800–1849), MP for South Derbyshire 1841–49"]}, {"page": "List of MPs elected in the 1796 British general election", "response": ["|Edward Miller Mundy"]}, {"page": "Alfred Mundy", "response": ["Alfred Miller Mundy was born on 9 January 1809 in Derbyshire. He was the third son of Edward Miller Mundy (d. 1834) and his wife Nelly Mundy (née Barton). Edward was the owner of the manor of Shipley in Derbyshire, having succeeded his father and namesake to his estate in 1822.", "Alfred's paternal grandfather- Edward Miller Mundy was the first of the Miller Mundys to own the manor of Shipley, having inherited it through his mother Hester Mundy (née Miller) on the condition that he take the name Miller. He was also the Tory MP for the constituency of Derbyshire.", "He was appointed by the Governor to the Legislative Council on 15 June 1843, originally as a non-official appointee, then as Colonial Secretary from 15 June 1848 to 14 June 1849 when he returned to England on leave of absence. His brother Edward Miller Mundy, who was M.P. for the constituency of South Derbyshire had died childless on 29 January 1849 and Alfred resigned on succeeding to the family estate, which included lucrative coal mines. He was Sheriff of Derbyshire in 1855, and a J.P. and D.L. for that county and a J.P. for Nottinghamshire. He died on 30 March 1877 while on holiday in Nice.", "*Alfred Edward Miller Mundy (28 November 1849 – 1920) married Ellen Mary Palmer-Morewood of Alfreton Hall fame. She deserted him for the young Charles John Chetwynd-Talbot, Earl of Shrewsbury. They divorced in 1881 and she later became the Countess of Shrewsbury."]}, {"page": "List of MPs elected in the 1784 British general election", "response": ["|  Edward Miller Mundy"]}, {"page": "List of MPs in the first United Kingdom Parliament", "response": ["| Edward Miller Mundy"]}, {"page": "List of MPs elected in the 1806 United Kingdom general election", "response": ["| Edward Miller Mundy"]}, {"page": "List of MPs elected in the 1802 United Kingdom general election", "response": ["| Edward Miller Mundy"]}, {"page": "List of MPs elected in the 1790 British general election", "response": ["|  Edward Miller Mundy"]}, {"page": "List of MPs elected in the 1807 United Kingdom general election", "response": ["| Edward Miller Mundy"]}, {"page": "List of MPs elected in the 1812 United Kingdom general election", "response": ["| Edward Miller Mundy"]}, {"page": "List of MPs elected in the 1818 United Kingdom general election", "response": ["| Edward Miller Mundy"]}]}}