{"wiki_id": "http://www.wikidata.org/entity/Q53468737", "itemLabel": "Cammy Logan", "itemDescription": "association football player (born 2002)", "wikipedia_url": "https://en.wikipedia.org/wiki/Cammy_Logan", "wikipedia_page": {"main": "Cammy Logan (born 28 January 2002) is a Scottish professional footballer who plays as a defender for Edinburgh City, on loan from Heart of Midlothian. He has previously played for Cove Rangers.", "link_mentions": [{"page": "Heart of Midlothian F.C. Reserves and Academy", "response": ["* Cammy Logan"]}, {"page": "2018–19 Heart of Midlothian F.C. season", "response": ["In addition a number of the Hearts squad were called up to represent Scotland at youth level. Callumn Morrison and Jamie Brandon were called up to the under-21 squad, Morrison was also called up to the under-20 squad, Harry Cochrane and Chris Hamilton to the under-19 squad, Harry Stone, Cammy Logan, Connor Smith and Aaron Hickey to the under-17 squad and Jay Charleston-King and Leo Watson to the under-16 squad. In addition Bobby Burns was called up to represent Northern Ireland at under-21 level."]}, {"page": "Chris Hamilton (footballer, born 2001)", "response": ["He made his senior debut for Hearts on 13 May 2018, in a 1–0 league defeat away at Kilmarnock. He was one of four Hearts youth players to make their debuts in that match, alongside Cammy Logan, Leeroy Makovora and Connor Smith. "]}, {"page": "Cameron Logan", "response": ["#REDIRECT Cammy Logan"]}, {"page": "Connor Smith (footballer, born 2002)", "response": ["He made his senior debut for Heart of Midlothian on 13 May 2018, in a 1–0 league defeat away at Kilmarnock. He was one of four Hearts youth players to make their debuts in that match, alongside Chris Hamilton, Cammy Logan, and Leeroy Makovora. Smith was subsequently loaned to Cowdenbeath, Arbroath, Cove Rangers and Queen's Park."]}, {"page": "Leeroy Makovora", "response": ["He made his senior debut for Heart of Midlothian on 13 May 2018, in a 1–0 league defeat away at Kilmarnock. He was one of four Hearts youth players to make their debuts in that match, alongside Chris Hamilton, Cammy Logan, and Connor Smith."]}]}}