{"wiki_id": "http://www.wikidata.org/entity/Q5344350", "itemLabel": "Edward Marten Dunne", "itemDescription": "British politician (1864-1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Marten_Dunne", "wikipedia_page": {"main": "Lieutenant-Colonel Edward Marten Dunne (27 August 1864 – 23 February 1944) was a British army officer and Liberal politician.\nHe was the third son of Thomas Dunne of Gatley Park and Bircher Hall, Herefordshire and his wife, Harriet (née Russell). His maternal grandfather was General Sir Edward Lechmere Graves Russell of Ashford Hall, Ludlow, Shropshire.Following education at Wellington College, Berkshire and the Royal Military College, Sandhurst, he received a commission as an officer in the Border Regiment in 1884. He subsequently entered the Staff College, Camberley, passing out of the institution in 1891. In 1896 his father died, and he resigned his commission.In 1899 he married Grace Daphne Rendel, daughter of Lord Rendel, former Liberal MP for Montgomeryshire. On the outbreak of the Second Boer War in the same year, he volunteered to return to the army, becoming brigade major at Aldershot. Following the war the couple moved to Gatley Park, an estate adjoining Wigmore Castle.In 1905 Dunne unsuccessfully contested a by-election at Kingswinford for the Liberals. In the following year a general election was held, and he was elected to serve as Member of Parliament for Walsall. He was only an MP for one term: at the next general election in January 1910 he was defeated by his Conservative opponent. He was chosen as Liberal candidate for the Melton Division of Leicestershire at the next election in December, but was not elected.On the outbreak of the First World War, Dunne was appointed to the staff of the 50th (Northumbrian) Division in Newcastle-upon-Tyne. In 1915 he was transferred to Chester, as part of the headquarters staff of the Western Command. He spent the latter part of the war on secondment to the War Office.Following the war, he settled back into country life in Herefordshire, where he was appointed a deputy lieutenant on 15 January 1919. He was high sheriff of the county in 1922, and served as a county alderman on Herefordshire County Council, where he chaired the education committee.Dunne had two daughters and a son. The latter was Philip Russell Rendel Dunne, who sat as Conservative MP for Stalybridge and Hyde from 1935 to 1937.E M Dunne died in February 1944, aged 79.", "link_mentions": [{"page": "List of political families in the United Kingdom", "response": ["*Edward Marten Dunne (1864–1944), Liberal MP 1906–1910."]}, {"page": "Philip Dunne (Ludlow MP)", "response": ["Philip Dunne was born in Ludlow, Shropshire, and has an ancestry of politicians and courtiers. He is the son of Sir Thomas Dunne KG, the former Lord Lieutenant of Herefordshire and Worcestershire, who in turn is the son of Philip Russell Rendel Dunne (who briefly sat in the Commons), who in turn was the son of Edward Marten Dunne (who also sat in the Commons). Philip Dunne was educated at Abberley Hall School, followed by Eton College and Keble College, Oxford, where he was awarded a degree in Philosophy, Politics and Economics. At Oxford he was part of the Bullingdon Club."]}, {"page": "Walsall (UK Parliament constituency)", "response": ["| Edward Marten Dunne"]}, {"page": "Philip Dunne (Stalybridge and Hyde MP)", "response": ["He was the son of Lieutenant-Colonel Edward Marten Dunne (1864–1944), Liberal Member of Parliament (MP) for Walsall (1906–1910), of Gatley Park, Leominster, Herefordshire, by his wife Hon. Grace Rendel (d.1952), J.P., third daughter and co-heiress of the only Lord Rendel of Hatchlands."]}, {"page": "Edward Dunne (disambiguation)", "response": ["*Edward Marten Dunne, British army officer and MP"]}]}}