{"wiki_id": "http://www.wikidata.org/entity/Q5341504", "itemLabel": "Edward Addison", "itemDescription": "Royal Air Force air marshals", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Addison", "wikipedia_page": {"main": "Air Vice Marshal Edward Barker Addison,  (4 October 1898 – 4 July 1987) was a senior Royal Air Force (RAF) officer who served as Air Officer Commanding No. 100 Group from 1943 to 1945 during the Second World War. The group jammed Axis radar and communications systems from the air and Addison was its only commander.", "link_mentions": [{"page": "The Blitz", "response": ["In June 1940, a German prisoner of war was overheard boasting that the British would never find the , even though it was under their noses. The details of the conversation were passed to an RAF Air Staff technical advisor, Dr. R. V. Jones, who started a search which discovered that  Lorenz receivers were more than blind-landing devices. Jones began a search for German beams; Avro Ansons of the Beam Approach Training Development Unit (BATDU) were flown up and down Britain fitted with a 30 MHz receiver. Soon a beam was traced to Derby (which had been mentioned in  transmissions). The first jamming operations were carried out using requisitioned hospital electrocautery machines.Mackay 2003, pp. 88–89. The counter-operations were carried out by British Electronic Counter Measures (ECM) units under Wing Commander Edward Addison, No. 80 Wing RAF. The production of false radio navigation signals by re-transmitting the originals became known as meaconing using masking beacons (). Up to nine special transmitters directed their signals at the beams in a manner that subtly widened their paths, making it harder for bomber crews to locate targets; confidence in the device was diminished by the time the  was ready to conduct big raids."]}, {"page": "No. 100 Group RAF", "response": ["The group disbanded on 17 December 1945. During its existence it had one commander, Air Vice-Marshal Edward Addison."]}, {"page": "Operation Steinbock", "response": ["The Lorenz blind-landing equipment had been the basis for the Knickebein although results were disappointing, partly because British countermeasures spearheaded by No. 80 Wing RAF under the command of Edward Addison which inhibited its use as a bombing aid. A similar adaptation of existing equipment in the form of I.F.F sets (FuG 25 and FuG 25a Erstling) brought into existence Egonverfahren, a ground-control procedure for crews on bomber operations. For Steinbock it was made available to the pathfinder unit I./KG 66.Mackay 2011, pp. 285–287."]}, {"page": "Addison (name)", "response": ["* Edward Addison (1898–1987), Royal Air Force air vice marshal"]}, {"page": "Index of World War II articles (E)", "response": ["# Edward Addison"]}, {"page": "Moresby Hall", "response": ["Later the Fletcher family owned Moresby Hall for a 250-year period. During this period it underwent some changes by architect Inigo Jones  around 1620 and later between 1670 and 1690, by either William Thackery or Edward Addison."]}, {"page": "Kampfgeschwader 1", "response": ["The Luftwaffe targeted ports in January 1941.,Wakefield 1999, p. 104. In February port-targets became top priority, but planners persisted in operating against cities in the interior.Hooton 2010, p. 88. III Gruppe bombed Cardiff and Salisbury on 2/3 January, Dungeness (3/4 January), Hastings (9/10 January), Portsmouth (10/11 January), Southampton (19/20 January). III Gruppe completed January operations with bombing operations against Stechford, The Wash, twice on 22 January, Stetchford–Margate–Hayes and Portsmouth on 28 January. On 29 and 30 January 1941 III Gruppe bombed Newcastle and then Stechford and London respectively.Goss 2010, pp. 225–229. Night operations were complicated at this time with the emergence of Wing Commander Edward Addison's No. 80 Wing RAF which was dedicated to the jamming of high-frequency German beams; though the success of British countermeasures in 1940 and 1941 were minimal.Wakefield 1999, pp. 108."]}, {"page": "The Secret War (TV series)", "response": ["This episode documented how British intelligence became aware of various  navigation beams, such as ,  and  and the countermeasures developed to combat them in what became known as the Battle of the Beams. It is largely based on the book Most Secret War, which was written by Jones, who appears in the series. The episode contains rare footage of The Blitz including the Coventry Blitz. Interviewees include Albert Speer, Sir Robert Cockburn and Air vice-marshal Edward Addison."]}, {"page": "No. 80 Wing RAF", "response": ["thumb|right|AVM Edward Addison", "The main role of RCM/80 Wing initially was jamming the German radio navigation system Knickebein, which assisted  Luftwaffe bombers raiding targets in the UK. Its founding commander was Wing Commander Edward Addison, a signals specialist who had recently returned from the Middle East. The technical design of countermeasures was handled by a section under Dr Robert Cockburn at the Telecommunications Research Establishment at Swanage, Dorset. Both organisations were given the highest priority.Jones, p. 176."]}]}}