{"wiki_id": "http://www.wikidata.org/entity/Q5342863", "itemLabel": "Edward Fanshawe", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Fanshawe_(British_Army_officer)", "wikipedia_page": {"main": "Lieutenant-General Sir Edward Arthur Fanshawe,  (4 April 1859 – 13 November 1952) was a British Army general of the First World War, who commanded the 11th (Northern) Division at Gallipoli and the V Corps on the Western Front during the Battle of the Somme, the Third Battle of Ypres, and the 1918 German spring offensive. He was the second eldest of three brothers who rose to command divisions or corps during the war.", "link_mentions": [{"page": "11th (Northern) Division", "response": ["* Major General Sir Edward Fanshawe (August 1915 – July 1916)"]}, {"page": "31st Division (United Kingdom)", "response": ["* Maj-Gen Edward Fanshawe from 26 July 1915"]}, {"page": "V Corps (United Kingdom)", "response": ["* GOC: Lt-Gen Edward Fanshawe", "* GOC: Lt-Gen Sir Edward Fanshawe", "* GOC: Lt-Gen Sir Edward Fanshawe", "* Jul 1916-Apr 1918 Lieutenant-General Edward Fanshawe, p. 237"]}, {"page": "Order of battle for the Battle of the Somme", "response": ["* V Corps. Corps Commander: Lieutenant-General Edward Fanshawe"]}, {"page": "Edward Fanshawe", "response": [":For the Army officer of the same name, see Edward Fanshawe (British Army officer)", "Born the eldest surviving son of General Sir Edward Fanshawe, and the nephew of Admiral Sir Arthur Fanshawe, Fanshawe was educated at the Royal Naval Academy, Portsmouth where he came second from the top in a very talented year and was commended for both his artistic and writing ability.Admiral Sir Edward Gennys Fanshawe GCB, published 1904 Fanshawe joined the Royal Navy in 1828. During the Oriental Crisis of 1840 he took part in the capture of Acre. He was subsequently given command of  and then .", "* Admiral Sir Edward Gennys Fanshawe GCB, published 1904, edited by Alice Fanshawe and illustrated with Edward Fanshawe's own drawings"]}, {"page": "Edward Arthur Fanshawe", "response": ["#REDIRECT Edward Fanshawe (British Army officer)"]}, {"page": "E. A. Fanshawe", "response": ["#REDIRECT Edward Fanshawe (British Army officer)"]}, {"page": "Sir Edward Fanshawe", "response": ["#REDIRECT Edward Fanshawe (British Army officer)"]}, {"page": "Fanshawe (surname)", "response": ["*Sir Edward Fanshawe (1814–1906), British naval officer", "*Sir Edward Fanshawe (British Army officer) (1859–1952) ", "*Edward Fanshawe (British Army officer), (1859–1952) British general"]}, {"page": "XXIII Corps (United Kingdom)", "response": ["* August 1918 – November 1918 Lieutenant General Edward FanshaweObituary in The Times, 19 November 1952, p. 10"]}, {"page": "Eric de Burgh", "response": ["In 1923, he married Mary Fanshawe, daughter of General Sir Edward Fanshawe; they had two daughters. He was the maternal grandfather of singer Chris de Burgh."]}, {"page": "Operations on the Ancre, January–March 1917", "response": ["The 18th (Eastern) Division surrounded and swiftly captured Irles on 10 March and the 7th and 46th divisions were ordered to occupy Bucquoy on 14 March, after air reconnaissance reported it almost empty. Protests were made by Major-General George Barrow, the 7th Division commander, Brigadier-General H. Cumming, commander of the 91st Brigade, Major-General William Thwaites of the 46th (North Midland) Division and the commander of the 137th Brigade, after patrols had reported that the village was protected by many machine-guns and three belts of wire, despite two days of wire-cutting bombardments. The V Corps commander, Lieutenant-General Edward Fanshawe, insisted that the attack go ahead and agreed only a delay until moonrise at  The artillery bombardment was fired from  alerting the German defenders, who repulsed the attack. The 91st Brigade lost  and the 137th Brigade  the Germans withdrew two days later."]}, {"page": "Frederick Hammersley (British Army officer)", "response": ["Between 1906 and 1911, Hammersley commanded the 3rd Brigade, Aldershot Command, but was relieved of his position due to repeatedly showing signs of shell shock.Col Michael Hickey, Gallipoli (John Murray Publishers Ltd, 1998), 263. Instead he was given command of Northumbrian Division in September 1911. Despite his shell shock, upon the outbreak of the First World War, he was put in command of West Lancashire Division in August 1914 and shortly thereafter of the newly formed 11th (Northern) Division, part of Kitchener's volunteer army. In this capacity, Hammersley commanded the Landing at Suvla Bay by his division during the Gallipoli Campaign. However, his ability to oversee such an operation was subsequently called into question, and the Dardanelles Commission openly criticised his command. The orders given by General Hammersley were deemed to be confused and the work of his staff defective.Paragraphs 108 and 109 of the Dardanelles Commission final report, 1919 On 23 August 1915, he was removed from the front-line in a state of collapse and was replaced by Major-General Edward Fanshawe.Alan Moorehead, Gallipoli (Harper Perennial Modern Classics; Reprint edition, 2002), 102. He was invalided back to England, suffering from battle fatigue. Lord Kitchener had warned that he should be watched to ensure that \"the strain of trench warfare is not too much for him\"."]}, {"page": "Neil Douglas Findlay", "response": ["Findlay, the first British general to be killed in the war and described as one of the army's best artillery officers, was buried at the churchyard in Courchamps under a bronze cross. His body was exhumed and moved to Vailly British Cemetery on 15 June 1938. His replacement with the 1st Infantry Division was Brigadier General Edward Fanshawe, who later became a corps commander. There is a plaque in his memory at Kenmuir Mount Vernon Church in Kenmuir near Mount Vernon, Glasgow. Findlay was married to Alma Lloyd and had two daughters."]}, {"page": "First attack on Bullecourt", "response": ["Bullecourt was  from the road at Vis-en-Artois and under  at Fontaine-lès-Croisilles, the first objective of the Cavalry Corps advancing in front of the Third Army. Gough suggested that the Fifth Army could support the attack but for lack of means, only on a narrow front and Bullecourt was substituted for Quéant, which was a much more formidable objective, behind four defensive positions. The attack would then pivot to the right flank to capture the junction of the Hindenburg Line and the Drocourt–Quéant Switch Line (). If successful, the 4th Cavalry Division would pass through to meet the Cavalry Corps from Arras. Fifth Army attacks on 2 April captured the German outpost villages from Doignies to Croisilles and Gough ordered that risks be taken to advance as much heavy artillery as possible. On 5 April Gough issued orders to the two Fifth Army corps V Corps (Lieutenant-General Edward Fanshawe) and 1st Anzac Corps (Lieutenant-General William Birdwood) for an attack on a  front with Bullecourt in the centre."]}]}}