{"wiki_id": "http://www.wikidata.org/entity/Q5344622", "itemLabel": "Edward Nicholl", "itemDescription": "British officer of the Royal Naval Reserve and Conservative Member of Parliament (1862-1939)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Nicholl", "wikipedia_page": {"main": "Commander Sir Edward Nicholl  (17 June 1862 –  30 March 1939) was a British officer of the Royal Naval Reserve who subsequently became a Conservative Member of Parliament (MP).\nNicholl was born at Ada Terrace, Pool, Cornwall . When he was 'no more than three years of age' the family moved to Redruth. He left school at 12 and went to work as an Assistant Timekeeper at the Carn Brea Railway Works. Two years later he started an Engineering Apprenticeship with the Great Western Railway at Carn Brea. He left home at 18 to continue the apprenticeship in Swindon.In 1889 was granted a Commission in the Royal Naval Reserve. He was knighted in 1916 for war services.He was elected at the 1918 general election as MP for Penryn and Falmouth but did not seek re-election in 1922 general election.In the King's Birthday Honours 1928, he was made a Knight Commander of the Order of the British Empire, for \"political and public services\".", "link_mentions": [{"page": "Cornish wrestling", "response": ["The different regional associations within Cornwall merged into the Cornwall County Wrestling Association (\"CCWA\") in September 1923, under the patronage of Commander Sir Edward Nicholl and presidency of Lord St Levan, to help standardize the rules, facilitate the competing of Duchy championships, mitigate the risk of clashing tournaments and  promote Cornish Wrestling throughout Cornwall and indeed Worldwide. In 1923 there were 21 affiliated local associations. Note that the Newquay and Port Isaac associations indicated that they wanted nothing to do with the CCWA.Cornish Wrestling, County Association Formed, Western Morning News, 13 September 1923."]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["|Sir Edward Nicholl"]}, {"page": "Nicholl", "response": ["* Edward Nicholl (1862–1939), British officer of the Royal Naval Reserve "]}, {"page": "Penryn and Falmouth (UK Parliament constituency)", "response": ["| Sir Edward Nicholl"]}, {"page": "Edward Nichols", "response": ["* Edward Nicholl (1862–1939), British navy officer and MP"]}, {"page": "Martial arts timeline", "response": ["* 1923 - The different regional Cornish wrestling associations within Cornwall merged into the Cornwall County Wrestling Association (\"CCWA\") , under the patronage of Commander Sir Edward Nicholl and presidency of Lord St Levan.CORNISH WRESTLING, The Advertiser (Adelaide) 9 October 1928, p14."]}, {"page": "List of Cornish soldiers, commanders and sailors", "response": ["* Sir Edward Nicholl, commander, RNR"]}, {"page": "Denis Shipwright", "response": ["On 17 December 1921 Shipwright was adopted as Conservative candidate for Penryn and Falmouth, succeeding the retiring Conservative MP Sir Edward Nicholl. Shipwright was only 23 years old but his record of serving throughout the war was noted.The Times, 19 December 1921, p. 7. He had begun a business career as a Director of Porthia China Clays Ltd. During his election campaign Shipwright's election address pledged him to a strong Navy, and a foreign policy which aimed at securing an honourable peace with a just settlement of reparations and war debts. In domestic policy he sought economy without decreasing safety and efficiency. The Liberal Party's national split was mirrored in Penryn and Falmouth with Sir Courtenay Mansel fighting as the official candidate but opposed by George Hay Morgan who was a former MP for Truro; there was also a Labour Party candidate. Shipwright won the election with 11,566 votes and a majority of 2,687 over Mansel. To celebrate his election, the ex-servicemen of Falmouth ceremoniously dragged his motor car up hill to the station when he caught the train to London to take his seat.See picture, The Times, 21 November 1922, p. 16."]}, {"page": "1916 Birthday Honours", "response": ["*Commander Edward Nicholl "]}, {"page": "1928 Birthday Honours", "response": ["*Sir Edward Nicholl  For political and public services."]}, {"page": "List of Knights Bachelor appointed in 1916", "response": ["|Cdr Edward Nicholl, RNR"]}]}}