{"wiki_id": "http://www.wikidata.org/entity/Q5340093", "itemLabel": "Edna Savage", "itemDescription": "British singer (1936-2000)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edna_Savage", "wikipedia_page": {"main": "Edna Savage (21 April 1936 – 31 December 2000) was a traditional pop singer in the United Kingdom.\nSavage was born in Warrington, Lancashire, England.\nShe had two elder sisters. Her father was a landscape gardener; her mother an amateur singer. She left school at 15 (common in the UK in those days). At first she trained as a telephone operator, but after a few bands had her sing for them locally, she quit the telephone job to sing professionally.\nShe auditioned twice for the BBC before making her first broadcast, in 1954. She recorded a number of records, only one of which charted, \"Arrivederci Darling\" in 1956, which made it to No. 19 in the UK Singles Chart. In 1957 she participated in the UK qualifying heat for the Eurovision Song Contest. In addition to being briefly married to fellow singer Terry Dene, Savage married three more times.She died at the age of 64.", "link_mentions": [{"page": "George Martin", "response": ["* Edna Savage – \"Arrivederci Darling\" (1955)"]}, {"page": "United Kingdom in the Eurovision Song Contest 1957", "response": ["| 3 || style=\"text-align:left;\" | Edna Savage ||  || Eliminated"]}, {"page": "A Tear Fell", "response": ["*\"A Tear Fell\" was recorded in the United Kingdom by Jill Day and Edna Savage. "]}, {"page": "Produced by George Martin", "response": ["#\"Arriverderci Darling\" – Edna Savage and the Nuffield Centre Chorus"]}, {"page": "Arrivederci Roma", "response": ["The recording of \"Arrivederci Darling\"  by British singer Anne Shelton remained in the UK Singles Chart for four weeks (December 17, 1955, to January 7, 1956, peaking at number 17). Another recording by Edna Savage was in the UK chart for one week (January 14, 1956, at number 19).", "*Edna Savage (1955)"]}, {"page": "List of contestants from the UK national selection for the Eurovision Song Contest", "response": ["| Edna Savage"]}, {"page": "Dorothy Bromiley", "response": ["Bromiley successfully auditioned for the role of Gloria in the Hollywood film The Girls of Pleasure Island (Paramount, 1952). Her major roles in several British films include sixth former Paulette at Angel Hill Grammar School (aged 26 at the time) in It's Great to Be Young (1956) in which Bromiley's singing voice for the Paddy Roberts/ Lester Powell Ray Martin song \"You are My First Love\" was dubbed by Edna Savage (and by Ruby Murray in the pre-credits sequence), Rose in A Touch Of The Sun (1956) co-starring with Frankie Howerd, Sarah in Zoo Baby (1957) with Angela Baddeley, Small Hotel (1957), Angela in The Criminal (1960) and a minor role in The Servant (1963), the latter two directed by Losey."]}, {"page": "My Prayer", "response": ["*Edna Savage (1956) (Parlophone R4226)"]}, {"page": "Terry Dene", "response": ["After being arrested for public drunkenness and breaking a shop window in 1958, and ripping out a telephone box from the wall whilst claiming his passionate love for Edna Savage, Dene was branded as a 'bad apple' and the exemplifier of the 'evil of rock and roll' by the press, and was then conscripted into the Army for national service. He was originally expected to report to Winchester Barracks, where he was due to join the King's Royal Rifle Corps on 7 July 1958, but his call-up was initially deferred until contractual commitments had been completed. When he finally did go in, it was so badly handled by the press (who filmed and publicised his arrival at the barracks) that after two months Dene had to be discharged on psychological grounds as his mental health had deteriorated considerably. By that time the press had almost ruined his career, and the Army offered him a pension as a form of compensation which Dene refused. Dene later joined the Larry Parnes' stable of stars and toured with them around Britain.", "Dene married his fellow pop singer Edna Savage in 1958. They later divorced. He married and divorced another three times, and he is now settled with an Italian countess, Lucia Liberati, whom he met in London in 2000."]}, {"page": "Deaths in December 2000", "response": ["*Edna Savage, 64, British pop singer."]}, {"page": "Beautiful Love (1931 song)", "response": ["*Edna Savage (1959)."]}, {"page": "Warrington", "response": ["*Edna Savage (1936 in Warrington – 2000), traditional pop singer "]}]}}