{"wiki_id": "http://www.wikidata.org/entity/Q5342094", "itemLabel": "Edward Burroughs", "itemDescription": "Bishop of Ripon; Dean of Bristol; British Anglican bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Burroughs", "wikipedia_page": {"main": "Edward Arthur Burroughs (1 October 1882 – 23 August 1934) was an eminent Anglican bishop in the first half of the 20th century.Born into an ecclesiastical family — his father was William Edward Burroughs (1845–1931), rector of the Mariners' Church, Dún Laoghaire and later prebendary of Exeter Cathedral — and educated at Harrow School and Balliol College, Oxford, he was ordained in 1908. He was Fellow, Lecturer and Tutor at Hertford College, Oxford and an Honorary Chaplain to the King before being appointed Dean of Bristol in 1922. Four year later he was ordained to the episcopate as Bishop of Ripon. At the opening ceremony  of the Hostel of the Resurrection in Leeds in 1928 Burroughs caused controversy when he described modern universities such as Leeds as \"counterfeit presentations\" when compared to the \"real thing(s)\" of Oxford and Cambridge. His comments denounced by others at the ceremony, Burroughs was forced to withdraw his words in a statement to the press the following week.An eminent author, he died on 23 August 1934.", "link_mentions": [{"page": "Edward Burrough", "response": ["After his death, his collected works were published by E. Hookes in 1671 as The Memorable Works of a Son of Thunder and Consolation: Namely, that True Prophet, and Faithful Servant of God, and Sufferer for the Testimony of Jesus, Edward Burroughs, who Dyed a Prisoner for the Word of God, in the City of London, the Fourteenth of the Twelfth Moneth, 1662."]}, {"page": "List of Old Harrovians", "response": ["*Edward Burroughs (1882–1934), Bishop of Ripon"]}, {"page": "John Phillips (bishop of Portsmouth)", "response": ["Phillips was made a deacon on Trinity Sunday 1934 (27 May) at Christ Church, Harrogate (his title), by Edward Burroughs, Bishop of Ripon; and ordained a priest the next Trinity Sunday (16 June 1935) at Ripon Cathedral, by Geoffrey Lunt, Bishop of Ripon. He served two curacies at Yorkshire parishes,Who's Who 1971 p2525  and then became a vicar, additionally joining the Royal Naval Volunteer Reserve (RNVR) as a chaplain during World War II, eventually becoming Director of Service Ordinands."]}, {"page": "David Porter (bishop)", "response": ["He was born in Wandsworth, London and educated at Hertford College, Oxford.Who's Who, 1970, London, A & C Black, 1971 . He studied for ordination at Wycliffe Hall, Oxford before a curacy in Leeds (at Wrangthorn St Augustine). He was made a deacon at Michaelmas 1929 (22 September) at his title church and ordained a priest in Advent 1930 (19 December) at Ripon Minster — both times by Edward Burroughs, Bishop of Ripon. From 1935 — in which year he announced his engagementThe Times Tuesday, Sep 10, 1935; pg. 15; Issue 47165; col C Forthcoming Marriages:The Rev DB Porter and Miss Elliot — he was Vicar of All Saints', Highfield, OxfordshireAll Saints', Highfield incumbency details. www.headington.org.uk. and then from 1943 of St Cuthbert's Church, Darlington. From there he became Rector of Church of St John the Evangelist, Edinburgh\"Scottish Episcopal Clergy, 1689-2000\" Bertie, DM Edinburgh T & T Clark ,  and from 1954 to 1961 Dean of Edinburgh. In 1962 he was appointed suffragan Bishop of Aston, where he remained until retirement. He was consecrated a bishop on 2 February 1962, by Michael Ramsey, Archbishop of Canterbury, at Westminster Abbey. In 1972 he retired to Brockhampton, Gloucestershire, where he died."]}, {"page": "Francis West (bishop)", "response": ["West was educated at Berkhamsted School and Magdalene College, Cambridge.Who was Who 1897-1990, London, A & C Black, 1991  He was ordained as a deacon on 11 June 1933 (Trinity Sunday) at Leeds Parish Church and priest the next Trinity Sunday, 27 May 1934, at Christ Church, Harrogate — both times by Edward Burroughs, Bishop of Ripon. He was a curate at St Agnes LeedsChurch Web Site and then chaplain of Ridley Hall, Cambridge. After wartime service as a Chaplain to the ForcesDuring which he was Mentioned in Despatches he was vicar of Upton then Archdeacon of NewarkThe Times, Tuesday, 8 July 1947; pg. 7; Issue 50807; col C New Archdeacon of Newark before his ordination to the episcopate. He was consecrated a bishop on 2 February 1962 by Michael Ramsey, Archbishop of Canterbury, at Westminster Abbey. He was also an author – among others he wrote \"Sparrows of the Spirit\", 1957; \"The Country Parish Today and Tomorrow\", 1960; “F. R. B.: a portrait of Bishop F. R. Barry”, 1980; and \"The Story of a Wiltshire Country Church\", 1987.British Library web site accessed 18:14 21 September 2008"]}, {"page": "Anthony Williams (bishop)", "response": ["Williams was ordained in the Church of England as a deacon in 1915 and as a priest in 1916. From 1915 to 1918, he served his curacy at St John's Church, Kidderminster in the Diocese of Worcester. From 1918 to 1920, he was a curate at Christ Church, High Harrogate in the Diocese of Ripon. From 1921 to 1931, he served as Chaplain to the Bishop of Ripon (Thomas Strong and then Edward Burroughs). He was additionally Vicar of St Mary the Virgin, North Stainley between 1921 and 1925, and Rector of St John the Baptist's Church, Kirby Wiske between 1925 and 1931.'Williams, Anthony Lewis Elliott', Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2016; online edn, Oxford University Press, 2014; online edn, April 2014 accessed 30 April 2017"]}, {"page": "John Taylor (bishop of Sodor and Man)", "response": ["Taylor was made a deacon on Trinity Sunday (22 May 1910) and ordained a priest the next Trinity Sunday (11 June 1911) — both times by Frederic Chase, Bishop of Ely, at Ely Cathedral. He was interviewed for a commission as a Temporary Chaplain to the Forces on 17 January 1917. It was noted that he could speak French but he asked to serve at \"home only\" and was appointed to the Royal Military Academy at Woolwich.Index Card Museum of Army Chaplaincy In October, 1918, he was attached to an Essex Battalion based at Hastings but remained there for only two months before demobilisation and appointment to the headship of St Lawrence College, Ramsgate.TNA Service Record Later he was Rector of HodnetNational Archives with Weston-under-Redcastle (1928–32; for the two years, he was also Rural Dean) then Principal of Wycliffe Hall, Oxford\"Ecclesiastical News New Principal Of Wycliffe Hall\", The Times, 30 July 1932; p. 13. — a post he held until his appointment as a bishop.Ecclesiastical News New Bishop Of Sodor And Man The Times, Tuesday 21 September 1954; p. 10; Issue 53042; col. C. He was also, alongside his main appointments, an examining chaplain to Bertram Pollock, Bishop of Norwich (1911–42); Edward Burroughs and Geoffrey Lunt, Bishops of Ripon (1932–42); and John Kempthorne and Edward Woods, Bishops of Lichfield (1935–42); an honorary canon of Norwich Cathedral (1938–42); and president of the London College of Divinity from 1945 onwards."]}, {"page": "Dean of Bristol", "response": ["*1922–1926 Edward Burroughs (afterwards Bishop of Ripon, 1926)"]}]}}