{"wiki_id": "http://www.wikidata.org/entity/Q5343429", "itemLabel": "Edward Herbert, 3rd Earl of Powis", "itemDescription": "British Earl", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Herbert,_3rd_Earl_of_Powis", "wikipedia_page": {"main": "Edward James Herbert, 3rd Earl of Powis (5 November 1818 – 7 May 1891), styled Viscount Clive between 1839 and 1848, was a British peer and politician.", "link_mentions": [{"page": "Selwyn College, Cambridge", "response": ["The foundation stone of the college was laid by Edward Herbert, 3rd Earl of Powis in a ceremony on 1 June 1881, following a lunch in King's College, Cambridge. A Charter of Incorporation was granted by Queen Victoria on 13 September 1882, and the west range of Old Court was ready for use by the college's official opening (with the Master's installation) on 10 October 1882, in time for Michaelmas term. Selwyn's first 28 undergraduates joined the original master and twelve other Fellows at the then Public Hostel of the university in 1882."]}, {"page": "University Pitt Club", "response": ["*Edward Herbert, 3rd Earl of Powis (1818–1891), British peer and politician. "]}, {"page": "George Selwyn (bishop of Lichfield)", "response": ["The Selwyn Memorial Committee was founded in Spring 1878.  The college's first Master, Arthur Lyttelton, was elected on 10 March 1879, the Archbishop of Canterbury Archibald Tait was invited to become Visitor on 28 June 1878, and the college's founders purchased a six-acre (24,000 m2) farm land site between Grange Road, West Road and Sidgwick Avenue on 3 November 1879 at a cost of £6,111 9s 7d and the building of Old Court, as it is now known, began in 1880. The foundation stone of the college was laid by Edward Herbert, 3rd Earl of Powis in a ceremony on 1 June 1881. A Charter of Incorporation was granted by Queen Victoria on 13 September 1882, and the west range of Old Court was ready for use by the college's official opening (with the Master's installation) on 10 October 1882. Selwyn's first 28 undergraduates joined the original Master and twelve other Fellows at the then Public Hostel of the university in 1882. It became an Approved Foundation of the University in 1926, and was granted full collegiate status on 14 March 1958."]}, {"page": "Edward Herbert", "response": ["*Edward Herbert, 3rd Earl of Powis (1818–1891), British peer and politician; MP for Shropshire North"]}, {"page": "High Steward (academia)", "response": ["*Edward Herbert, 3rd Earl of Powis (1863–91)"]}, {"page": "1891 in Wales", "response": ["*7 May – Edward Herbert, 3rd Earl of Powis, 72"]}, {"page": "Francis Morse", "response": ["He was admitted as a deacon by Rt. Revd. Edward Stanley Bishop of Norwich in January 1844The Times, Weds Jan 31 1844, page 5 and ordained in 1845 and was a curate in the Church of St Editha, Tamworth in 1849. There was some controversy in 1853 when he was proposed for the St Mary's Church, Shrewsbury by the Edward Herbert, 3rd Earl of Powis but a court case ensued to prevent him from taking the incumbency.The Times, Mon  Dec 5 1853, page 9"]}, {"page": "Edward James Herbert, 3rd Earl of Powis", "response": ["#REDIRECT Edward Herbert, 3rd Earl of Powis"]}, {"page": "Bangor University", "response": ["* Edward Herbert, 3rd Earl of Powis, 1884–1891"]}, {"page": "Herbert family", "response": ["************ Edward Herbert, 3rd Earl of Powis"]}, {"page": "List of English cricketers (1826–1840)", "response": ["|Edward Herbert, 3rd Earl of Powis"]}, {"page": "List of Cambridge Town Club and Cambridgeshire cricketers", "response": ["* Edward Herbert, 3rd Earl of Powis (1837–1838) : E. J. Herbert"]}, {"page": "Henry John Dobson", "response": ["*The Rt Hon Edward Herbert, 3rd Earl of Powis"]}]}}