{"wiki_id": "http://www.wikidata.org/entity/Q5343063", "itemLabel": "Edward Gardner", "itemDescription": "British conductor", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Gardner_(conductor)", "wikipedia_page": {"main": "Edward Gardner  (born 22 November 1974) is an English conductor.", "link_mentions": [{"page": "City of Birmingham Symphony Orchestra", "response": ["In addition to Oramo, principal guest conductors of the CBSO have included Edward Gardner, who held the post from September 2011 through July 2016.  In May 2018, the CBSO announced the appointment of Kazuki Yamada as its next principal guest conductor, effective with the 2018–2019 season.  Yamada is currently contracted as CBSO principal guest conductor through 2023.  In September 2021, the CBSO announced the appointment of Yamada as its next chief conductor and artistic advisor, effective 1 April 2023, with an initial contract of 4.5 years.  The CBSO's current associate conductor is Michael Seal, and its current assistant conductor is Jaume Santonja Espinós."]}, {"page": "London Philharmonic Orchestra", "response": ["In 2003, Edward Gardner first guest-conducted the LPO.  In July 2019, the LPO announced the appointment of Gardner as its next principal conductor, effective with the 2021-2022 season, with an initial contract of five years. In October 2018, Karina Canellakis first guest-conducted the LPO. In April 2020, the LPO announced the appointment of Canellakis as its new principal guest conductor, the first female conductor ever named to the post, effective from September 2020."]}, {"page": "The Proms", "response": ["| Edward Gardner"]}, {"page": "Royal Academy of Music", "response": ["Former students include Olga Athaide Craen, John Barbirolli, Judith Bingham, Harrison Birtwistle, Dennis Brain, Alan Bush, Doreen Carwithen, Rebecca Clarke, Jacob Collier, Clifford Curzon, Edward Gardner, Lesley Garrett, Evelyn Glennie, Eleanor Greenwood, Dorothy Howell, Katherine Jenkins, Elton John, Annie Lennox, Felicity Lott, Moura Lympany, Vanessa-Mae, Denis Matthews, Michael Nyman, Elsie Southgate, Eva Ruth Spalding, Florence Margaret Spencer Palmer, Ashan Pillai, Simon Rattle, Cecile Stevens, Arthur Sullivan, Eva Turner, Maxim Vengerov, Henry Wood and Carol Anne Williams."]}, {"page": "English National Opera", "response": ["Among the conductors associated with the company have been Colin Davis, Reginald Goodall, Charles Mackerras, Mark Elder and Edward Gardner. The current music director of ENO is Martyn Brabbins.  Noted directors who have staged productions at ENO have included David Pountney, Jonathan Miller, Nicholas Hytner, Phyllida Lloyd and Calixto Bieito. ENO's current artistic director is Daniel Kramer. In addition to the core operatic repertoire, the company has presented a wide range of works, from early operas by Monteverdi to new commissions, operetta and Broadway shows.", "On 29 November 2005, Doran resigned as artistic director.Malvern, Jack. \"ENO boss exits on a low note\" , The Times, 30 November 2005. To replace him, Smith divided the duties between Loretta Tomasi as chief executive and John Berry as artistic director. These elevations from within the organisation were controversial, because they were neither advertised nor cleared at the top level of the Arts Council. Smith received severe press criticism for his action, and in December 2005 he announced his resignation.Higgins, Charlotte. \"The final act: English National Opera chief quits and blames 'persistent hostility'\" , The Guardian, 22 December 2005 In the same week, Caetani's appointment as the next ENO music director was cancelled.Malvern, Jack. \"ENO chief sacked before he starts\"  The Times, 29 December 2005 Berry was at first criticised in the press for his choice of singers for ENO productions,Canning, Hugh. \"Opera: Billy rides the storm\" , The Times, 11 December 2005.Christiansen, Rupert. \"The arts column: The man who is eroding ENO's identity\" , The Daily Telegraph, 15 March 2006 but the appointment of Edward Gardner as music director from 2007 received considerable praise. The Observer commented that Gardner was \"widely credited with breathing fresh life into English National Opera\".Hill, Amelia and Vanessa Thorpe. \"Young faces on the podium are adding verve to Britain's orchestras\" , The Observer, 13 December 2009", "* Edward Gardner (2007–2015)"]}, {"page": "Karol Szymanowski", "response": ["In 1994, a renowned director Charles Dutoit recorded both of his Violin Concertos with Montreal Symphony Orchestra. English conductor, Sir Simon Rattle, called him “one of the greatest composers of this [20th] century” and produced a series of important recordings with the Birmingham Symphony Orchestra. In 2004, Scottish violinist Nicola Benedetti won the BBC Young Musician of the Year with a performance of Szymanowski’s Violin Concerto No. 1. In 2008 his opera King Roger, which is regarded as his masterpiece, was performed at Edinburgh International Festival under the baton of Valery Gergiev and his renowned Mariinsky opera company. In 2012 Gergiev led the London Symphony Orchestra's performance of all four of the composer’s symphonies at the Edinburgh International Festival. In 2015 opera King Roger was staged in London's Royal Opera House and was produced by Kasper Holten. In the past two decades, his music has enjoyed a great revival and has been performed around the world. It has been recorded by many prominent conductors and musicians such as Pierre Boulez, Edward Gardner, Vladimir Jurowski, Mark Elder and Krystian Zimerman."]}, {"page": "Grammy Award for Best Choral Performance", "response": ["*Edward Gardner (conductor); Hakon Matti Skrede (chorus master) (Susan Bickley, Gábor Bretz, Sara Jakubiak & Stuart Skelton (soloists); Thomas Trotter (accompanist); Bergen Philharmonic Orchestra (orchestra); Bergen Cathedral Choir, Bergen Philharmonic Choir, Choir of Collegium Musicum, Evard Grieg Kor (choirs))"]}, {"page": "Dies Natalis (cantata)", "response": ["* Chandos CHAN 10590 (rec. 2009): Susan Gritton; BBC Symphony Orchestra; Edward Gardner, conductor"]}, {"page": "Bluebeard's Castle", "response": ["|Edward Gardner"]}, {"page": "List of Old Etonians born in the 20th century", "response": ["*Edward Gardner (conductor) (born 1975), music director, English National Opera"]}, {"page": "The Jewel Box", "response": ["After the Nottingham premiere and subsequent performances in Opera North's territory of northern England, the opera was performed in the United States by Skylight Opera Theatre (1993), Wolf Trap Opera (1994), Chicago Opera Theater (1996), and New Jersey State Opera (1996). In England, it was revived by Bampton Classical Opera in 2006 for the 250th anniversary of Mozart's birth, with the orchestra conducted by Edward Gardner.."]}, {"page": "Peter Grimes", "response": ["|2019||Stuart Skelton,Erin Wall,Roderick Williams,Susan Bickley||Edward Gardner, Grieg Hall, Bergen Philharmonic Orchestra, Bergen Philharmonic Choir, Edvard Grieg Kor, Royal Northern College of Music Chorus, Choir of Collegium Musicum||CD: Chandos CHAN 5250\"Britten; Peter Grimes, Op.33"]}, {"page": "BBC Symphony Chorus", "response": ["As well as featuring in dedicated studio recordings for BBC Radio 3, the BBC Symphony Chorus's discography consists of over 120 commercial recordings, many featuring collaborations with the BBC Symphony Orchestra. Recent commercial recordings include Brett Dean’s Vexations and Devotions under David Robertson; Szymanowski’s Stabat mater, Harnasie and Symphony No. 3 under Edward Gardner; and Holst's First Choral Symphony, Elgar's The Dream of Gerontius, Op. 38, and Berlioz's Romeo and Juliet (Roméo et Juliette), all under the baton of its President, Sir Andrew Davis.", "|Szymanowski||Stabat Mater, Op. 53; Harnasie, Op. 55||Edward Gardner||CHSA5123||2013 / 2013", "|Szymanowski||Symphony No. 3, ‘The Song of the Night’, Op. 27||Edward Gardner||CHSA 5143||2014 / 2014"]}, {"page": "Glagolitic Mass", "response": ["* Edward Gardner conducting the Bergen Philharmonic Orchestra (rec. 2015, Chandos)"]}, {"page": "Orchestra of the Age of Enlightenment", "response": ["A group of period instrumentalist players formed the OAE as a self-governing ensemble in 1986, and took its name from the historical period in the late 18th century where the core of its repertoire is based. The OAE does not have a principal conductor, but chooses conductors individually. Having no permanent music director gives the orchestra flexibility to work with some of the world’s greatest conductors and soloists across a wide range of music.  The current Principal Artists are Sir Simon Rattle, Vladimir Jurowski, Iván Fischer, John Butt, Sir Mark Elder and András Schiff.  Sir Roger Norrington and William Christie are Emeritus Conductors, as were the late Frans Brüggen and Sir Charles Mackerras.  Other conductors to have worked with the OAE at its invitation include Marin Alsop, Anu Tali, Yannick Nézet-Séguin, Sian Edwards, Edward Gardner, Suzi Digby, Robin Ticciati, Joanna Tomlinson, Philippe Herreweghe, Gustav Leonhardt, René Jacobs, Harry Bicket, Christopher Hogwood, Sigiswald Kuijken, Ivor Bolton, Monica Huggett, and Bruno Weil."]}, {"page": "Glyndebourne Festival Opera", "response": ["* Edward Gardner (2004–2007)"]}, {"page": "Louis Lortie", "response": ["Throughout his career, Lortie has collaborated with conductors including Thomas Adès, Francesco Angelico, Andrea Battistoni, Stephan Blunier, Andrei Boreyko, Ricardo Chailly, Michael Christie, Thomas Dausgaard, Andrew Davis, Augustin Dumay, Charles Dutoit, Michal Dworzynski, Mark Elder, Thierry Fischer, Edward Gardner, Paavo Jarvi, Grant Llewellyn, Yannick Nézet Séguin, Thomas Sondergard, Robert Spano and many more.", "* Camille Saint-Saëns, Complete piano concertos n°1, n°2, n°3, n°4, n¨5, Allegro appassionato Op.70 & Rapsodie d'Auvergne Op.73, Louis Lortie, piano, BBC Philarmonic, conductor, Edward Gardner . 2 CD Chandos 2018-2019"]}, {"page": "Piano Concerto No. 5 (Saint-Saëns)", "response": ["*Louis Lortie and the BBC Philharmonic Orchestra (complete piano concertos n°1, n°2, n°3, n°4, n°5),  conducted by Edward Gardner (en). 2 CD Chandos 2018-2019"]}, {"page": "Colin Matthews", "response": ["From 2001 to 2010 Matthews was Associate Composer with the Hallé Orchestra, and is now their Composer Emeritus. During this period he wrote a number of works for them, as well as a project involving the orchestration of all 24 of Debussy's Preludes, completed in May 2007 and recorded by Sir Mark Elder on the Hallé label. Alphabicycle Order, a major work for children's chorus, narrator and orchestra to poems by Christopher Reid, was premiered by the Hallé under Edward Gardner as part of the 2007 Manchester International Festival, and is also recorded on the Hallé label, together with the Horn Concerto. Commissioned by the Hallé Orchestra as part of their Mahler centenary celebrations, his Crossing the Alps for Chorus and Organ, on a text by William Wordsworth (The Prelude, Book VI), was first performed by the Hallé Choir, conducted by Markus Stenz, at the Bridgewater Hall, Manchester, in January 2010.  Its German premiere, also under Stenz, was in the Philharmonie in Cologne, in January 2011, with the MDR Radio Chorus."]}, {"page": "Viola Concerto (Walton)", "response": ["|Edward Gardner"]}, {"page": "Bergen Philharmonic Orchestra", "response": ["American conductor Andrew Litton became principal conductor in 2003 and artistic director in 2005. In 2002 the orchestra began to record the complete orchestral works of Edvard Grieg, the first Norwegian orchestra to do so. Norwegian conductor Ole Kristian Ruud and the orchestra recorded the final of the 7 CDs for BIS., in 2005.  Litton now has the title of conductor laureate with the orchestra.  The orchestra's current chief conductor is Edward Gardner, since October 2015, with an initial contract of 3 seasons.  In January 2017. the orchestra announced the extension of Gardner's contract in Bergen through 2021.  In September 2019, the orchestra further extended Gardner's contract through 2023.  In June 2021, the orchestra announced a 1-year extension of Gardner's contract through July 2024.  In November 2021, the orchestra announced the appointment of Sir Mark Elder as its next principal guest conductor, effective 1 August 2022, with an initial contract of three years through 31 July 2025.", "*Edward Gardner (2015–present)"]}, {"page": "National Youth Orchestra of Great Britain", "response": ["Each course is directed by a distinguished conductor.  These have included Vladimir Jurowski, Marin Alsop, Jiri Belohlavek, Pierre Boulez, Sir Adrian Boult, Sir Malcolm Sargent, Semyon Bychkov, Paul Daniel, Sir Andrew Davis, Sir Colin Davis, Sir Mark Elder, Iván Fischer, Edward Gardner, Antonio Pappano, Hugo Rignold, Andrew Litton, Keith Lockhart, Sir Roger Norrington, Tadaaki Otaka, Geoffrey Paterson, Sir Simon Rattle and Mstislav Rostropovich. Walter Susskind was a founder conductor of the NYO and was the main conductor on several courses, well into the 1950s.https://books.google.co.uk/books?isbn=0802035884 Later in the NYO's history, Christopher Seaman was the main conductor on a number of courses."]}, {"page": "Choir of King's College, Cambridge", "response": ["* Edward Gardner (choral scholar) – Director of Music, English National Opera"]}, {"page": "Alison Balsom", "response": ["She has a son with the English conductor Edward Gardner. In 2017, she married film director Sir Sam Mendes. Their daughter was born later that year."]}, {"page": "Gurre-Lieder", "response": ["* Edward Gardner, Bergen Philharmonic Orchestra and members of the Gothenburg Symphony Orchestra, Stuart Skelton (Waldemar), Alwyn Mellor (Tove), Anna Larsson (Wood Dove), James Creswell (Peasant), Wolfgang Ablinger-Sperrhacke (Klaus the Jester), Sir Thomas Allen (Narrator), Bergen Philharmonic Choir, Choir of Collegiûm Mûsicûm Bergen, Edvard Grieg Kor, Orphei Drängar, and Students from the Royal Northern College of Music, Håkon Matti Skrede (Director). Chandos 5172(2) Hybrid SA-CD (2016)"]}, {"page": "Jennifer Pike", "response": ["Her extensive discography includes recordings with Chandos, Sony and ABC Classics. She has recorded with the Bergen Symphony and Sir Andrew Davis, the BBC Philharmonic and Rumon Gamba, the Tasmanian Symphony Orchestra and the City of Birmingham Symphony and Edward Gardner."]}, {"page": "Gardner (surname)", "response": ["*Edward Gardner (disambiguation)", "**Edward Gardner (MP) (1912–2001), British  politician", "**Edward Gardner (conductor) (born 1974), British conductor", "*Edward Gardner, a character in the 1997 French-American fantasy drama movie FairyTale: A True Story"]}, {"page": "Chants d'Auvergne", "response": ["*Kate Royal: Recital, with the Academy of St Martin in the Fields conducted by Edward Gardner (\"Baïlèro\", \"La delaïssàdo\" and \"Malurous qu'o uno fenno\")"]}, {"page": "Erwartung", "response": ["* Chandos: Sara Jakubiak; Bergen Philharmonic Orchestra; Edward Gardner, conductor (2020)"]}, {"page": "Symphony No. 1 (Walton)", "response": ["| Edward Gardner"]}, {"page": "CBSO Youth Orchestra", "response": ["The orchestra was founded in October 2004 as the successor to the Midland Youth Orchestra, an independent youth orchestra established by the then CBSO general manager Blyth Major and which operated from 1956 until being wound up in response to falling membership in summer 2004.  The orchestra recruits young orchestral musicians in the 14-21 age range and performs two concerts annually under the direction of the CBSO's Music Director or one of the CBSO's regular guest conductors.  These have included Andris Nelsons, Edward Gardner, Sakari Oramo, Andrew Litton, Jac van Steen, Paul Daniel, Martyn Brabbins, Thomas Sondergard, Alan Buribayev, Alexander Vedernikov and Mike Seal. Soloists have included Alison Balsom, Alina Pogostkina, Jean-Efflam Bavouzet, Christine Rice, Katarina Karnéus, Guy Johnston, Leon McCawley, Chloë Hanslip, Martin Roscoe, Tasmin Little, Peter Donohoe and Lore Lixenberg."]}, {"page": "Crouch End Festival Chorus", "response": ["Led by musical director David Temple, the choir has appeared in the BBC Proms concert series and has performed under the baton of conductors including Esa Pekka-Salonen, Semyon Bychkov, Edward Gardner and Valery Gergiev. CEFC also features on the sound track of films and TV series such as Disney's Prince Caspian, the BBC's Doctor Who and Amazon Prime Video's Good Omens TV series."]}, {"page": "Kate Royal", "response": ["*Kate Royal: Academy of St Martin in the Fields, Edward Gardner (EMI Classics, 2007)", "*Midsummer Night: Orchestra of English National Opera & Crouch End Festival Chorus, Edward Gardner (2007) EMI Records Ltd. Barcode 0094639441952"]}, {"page": "Mark Wigglesworth", "response": ["In January 2014, English National Opera (ENO) named Wigglesworth its next music director, succeeding Edward Gardner effective September 2015. Shortly into his tenure, Wigglesworth expressed disapproval of proposals by ENO management for economising measures, such as a reduction in the contract of the ENO chorus. On 22 March 2016, he resigned from the music directorship of ENO, effective at the close of the 2015–2016 season. The resignation report indicated that he was to honour existing conducting commitments with the company.  In a separate letter to ENO musicians, Wigglesworth said:"]}]}}