{"wiki_id": "http://www.wikidata.org/entity/Q5344824", "itemLabel": "Edward Penny", "itemDescription": "British painter (1714-1791)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Penny", "wikipedia_page": {"main": "Edward Penny  (1 August 1714 – 16 November 1791) was an English portrait and historical painter, one of the founder members of the Royal Academy.", "link_mentions": [{"page": "1791", "response": ["* November 16 – Edward Penny, British painter (b. 1714)"]}, {"page": "1714", "response": ["** Edward Penny, British painter (d. 1791)"]}, {"page": "Knutsford", "response": ["* Edward Penny RA (1714 in Knutsford – 1791) an English portrait and historical painter, one of the founder members of the Royal Academy  Dictionary of National Biography, 1885-1900, Volume 44, Penny, Edward retrieved 16 July 2018"]}, {"page": "James Barry (painter)", "response": ["Soon after his return from the continent Barry had been chosen a member of the Royal Academy of Arts; and in 1782 he was appointed professor of painting in the room of Edward Penny with a salary of £30 a year. Among other things, he insisted on the necessity of purchasing a collection of pictures by the best masters as models for the students, and proposed several of those in the Orleans collection. This recommendation was not relished, and in 1799 Barry was expelled from the Academy soon after the appearance of his Letter to the Dilettanti Society, an eccentric publication, full of enthusiasm for his art and at the same time of contempt for the living professors of it. Barry remained the only academician ever to be expelled by the Academy until Brendan Neiland in July 2004."]}, {"page": "Royal Academy of Arts", "response": ["The instrument of foundation, signed by George III on 10 December 1768, named 34 founder members and allowed for a total membership of 40. The founder members were Reynolds, John Baker, George Barret, Francesco Bartolozzi, Giovanni Battista Cipriani, Augustino Carlini, Charles Catton, Mason Chamberlin, William Chambers, Francis Cotes, George Dance, Nathaniel Dance, Thomas Gainsborough, John Gwynn, Francis Hayman, Nathaniel Hone the Elder, Angelica Kauffman, Jeremiah Meyer, George Michael Moser, Mary Moser, Francis Milner Newton, Edward Penny, John Inigo Richards, Paul Sandby, Thomas Sandby, Dominic Serres, Peter Toms, William Tyler, Samuel Wale, Benjamin West, Richard Wilson, Joseph Wilton, Richard Yeo, Francesco Zuccarelli. William Hoare and Johann Zoffany were added to this list by the King in 1769."]}, {"page": "John Manners, Marquess of Granby", "response": ["Granby returned to England as a hero: a painting by Edward Penny, The Marquess of Granby Relieving a Sick Soldier, showed him acting as a man of charity rather than as a soldier and this assured his appeal to the people.  He sought to steer a path independent of party politics but supported the Treaty of Paris.  He trusted George Grenville who promptly appointed him Master-General of the Ordnance under his ministry on 14 May 1763. Granby was also made Lord Lieutenant of Derbyshire on 21 February 1764."]}, {"page": "St Peter's Church, Congleton", "response": ["Internally there are galleries on the north, south and west sides, and Georgian box pews.  The pulpit dates from the 17th century and, at the time Richards was writing, it was the only pulpit in Cheshire to be placed in front of the sanctuary in the middle of the nave.   Between the nave and the aisles are square piers supporting Tuscan columns.  The marble font dates from 1742 and a brass candelabrum from 1748.  The reredos is dated 1743 and its panels contain the Lord's Prayer, the Ten Commandments and the Apostles' Creed.  The east window is Palladian in style and is flanked by mural paintings of Saint Peter and Saint Paul by Edward Penny of Knutsford.  The royal coat of arms of William III dated 1702 are at the east end of the north gallery."]}, {"page": "William Redmore Bigg", "response": ["Bigg was born in Felsted in Essex to William and Grace Bigg. He enrolled in the Royal Academy schools in 1778 where he studied under Edward Penny  (1714–1791) whose forte was depicting acts of charity. Bigg's greatest delight was in painting children. His first work in this genre to be exhibited in 1778 was Schoolboys giving Charity to a Blind Man. A year later he painted a similar work, A Lady and her Children relieving a Distressed Cottager. Apart from these his Palemon and Lavinia, the Shipwrecked Sailor Boy, and Youths relieving a Blind Man were very well received, and all were engraved. His subject choice and execution place him with Wheatley and George Morland. Bigg produced many small portraits in oil and pastel, as well as rustic genre paintings. His genre paintings and portraits have great charm and were highly popular in his day, the best engravers being used to render his work.Donald Heald"]}, {"page": "Richard Houston", "response": ["* John Manners, Marquess of Granby, on horseback, after Edward Penny; and full-lengths of ", "* 'The Death of General Wolfe,' after Edward Penny; "]}, {"page": "List of Royal Academicians", "response": ["| Edward Penny   ||align=\"center\" |  1768  ||  Foundation member; first Professor of Painting 1768–82"]}, {"page": "Listed buildings in Congleton", "response": ["|The church replaced an earlier church on the site, and its tower was completed in 1786.  Additions were made in 1839–40.  The tower is in stone with, at the top, a parapet containing blind arcading and crocketed pinnacles.  The body of the church is in brick with stone dressings and a stone-slate roof in Neoclassical style,  Along the sides are two tiers of windows, the upper ones round-headed, and the lower ones with segmental heads.  At the east end is a Venetian window.  Inside the church are galleries on three sides, box pews, a finely carved reredos, and paintings of Saint Peter and Saint Paul by Edward Penny."]}, {"page": "James Walker (engraver)", "response": ["Walker's earliest published plate bears the date 2 July 1780. During the following three years he published: portraits, after George Romney and others; domestic scenes, The Spell, and The Village Doctress, after James Northcote; a scene from Cymbeline, after Edward Penny."]}, {"page": "George Bower (priest)", "response": ["He was the nephew of Edward Penny, who left him notes of his lectures as first professor of painting at the Royal Academy."]}, {"page": "The Academicians of the Royal Academy", "response": ["* Edward Penny"]}]}}