{"wiki_id": "http://www.wikidata.org/entity/Q5345426", "itemLabel": "Edward Steere", "itemDescription": "English cleric and bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Steere", "wikipedia_page": {"main": "Edward Steere (1828 - 26 August 1882) was an English Anglican colonial bishop in the 19th century.He was educated at London University and ordained in 1850. After curacies in Devon and Lincolnshire, he joined William Tozer (Bishop in Central Africa) on a mission to Nyasaland in 1863. He was appointed Bishop in Central Africa in 1874 and died on 26 August 1882.Edward Steere spent several years in Zanzibar, 1864–68, 1872–74, and 1877–82. In 1873 he placed the foundation stone at Christ Church, Zanzibar, in Stone Town, Zanzibar. The cathedral was based on a vision of Edward Steere's who actively contributed to the design; its unique concrete roof shaped in an unusual barrel vault was Steere's idea. Edward Steere also worked with David Livingstone to abolish slavery in Zanzibar. He is buried behind the altar in the church. David Livingstone's aides James Chuma and Abdullah Susi also were part of an expedition lead by Steere. Chuma was captain of the expedition and both men acted as interpreters.Steere was a considerable linguist and published works on several East African languages and dialects, including Shambala, Yao, Nyamwezi, and Makonde. But he is especially known for his work on Swahili, publishing a Handbook of Swahili in 1870, and he also translated or revised the translation into Swahili of a large part of the Bible.", "link_mentions": [{"page": "Skegness", "response": ["Several notable religious figures either lived in the town or served it in some capacity: Edward Steere (1828–1882) was curate from 1858 to 1862,Charles Alexander Harris, \"Steere, Edward\", in Sidney Lee (ed.), Dictionary of National Biography, vol. 54 (New York: The Macmillan Co., 1898), p. 141. For the dates, see The Church of England Pulpit, and Ecclesiastical Review, vol. 14 (1882), p. 120. George William Clarkson (1897–1977) was rector from 1944 to 1948,\"Clarkson, Rt Rev. George William\", Who Was Who (online ed., Oxford University Press, December 2019). Retrieved 3 July 2020. Roderick Wells (born 1936) was rector from 1971 to 1978,\"Wells, Ven. Roderick John\", Who's Who (online ed., Oxford University Press, December 2019). Retrieved 3 July 2020. and Kenneth Thompson (1909–1975) lived in the town.\"Thompson, Rt Rev. Kenneth George\", Who Was Who (online ed., Oxford University Press, December 2019). Retrieved 3 July 2020."]}, {"page": "Bemba language", "response": ["The orthographical system in common use, originally introduced by Edward Steere, is quite phonetic. Its letters, with their approximate phonetic values, are given below."]}, {"page": "Stone Town", "response": ["#The Anglican cathedral of Christ Church, on Mkunazini Road, was built at the end of the 19th century by Edward Steere, third bishop of Zanzibar. The cathedral was constructed in a large area at the centre of Stone Town that previously hosted the biggest slave market of Zanzibar; the place was deliberately chosen to celebrate the end of slavery, and the altar was in the exact spot where the main whipping post of the market used to be. A monument to the slaves, as well as a museum on the history of slavery, are besides the church."]}, {"page": "Kingskerswell", "response": ["*Edward Steere, who became the Bishop of Nyasaland in 1874, had his first curacy at St Mary's church. He married Mary Beatrice Brown of Barton Hall in 1858."]}, {"page": "Edwin Dodgson", "response": ["Dodgson was appointed as Principal of the (UMCA) Kiungani School in Zanzibar in 1879, where he served under Bishop Edward Steere.  However, as his brother Charles noted, \"the ague was too much for him there\". In 1880 he was appointed by the Society for the Propagation of the Gospel (SPG) as missionary and school teacher to Tristan da Cunha, a post which the Bishop of St Helena had been attempting to fill since 1866. Dodgson volunteered to fill the post and the SPG undertook to provide a stipend of £100 a year."]}, {"page": "List of Old Gowers", "response": ["* The Rt. Rev. Edward Steere (OG 1842–44), Bishop of Central Africa"]}, {"page": "The Heart of a Monkey", "response": ["The Heart of a Monkey is a Swahili fairy tale collected by Edward Steere in Swahili Tales.Edward Steere (1870), Swahili Tales, \"The Story of the Washerman's Donkey\".  Andrew Lang included it in The Lilac Fairy Book.Andrew Lang (1910), The Lilac Fairy Book, \"The Heart of a Monkey \"  It is Aarne-Thompson 91.D. L. Ashliman, The Monkey's Heart: folktales of Aarne-Thompson type 91 It originated from the Panchitantara."]}, {"page": "The Nunda, Eater of People", "response": ["The Nunda, Eater of People is an abridged version of a Swahili fairy tale titled \"Sultan Majnun\" (), collected by Edward Steere (1828–1882) in Swahili Tales, as told by natives of Zanzibar (1870).Steere, Edward. Swahili tales. London: Bell & Daldy. 1870. pp. 197-283. Andrew Lang included it in The Violet Fairy Book (1901).Lang, Andrew. The Violet Fairy Book. London; New York: Longmans, Green. 1901. pp. 247-262.", "Edward Steere noted the resemblance of the hero's name, Sit-in-the-kitchen, with Cinderella, another folktale character that sits in the ashes.\"Preface\". Steere, Edward. Swahili tales. London: Bell & Daldy. 1870. p. viii. "]}, {"page": "Universities' Mission to Central Africa", "response": ["In 1874, Tozer was succeeded as bishop by Edward Steere, who pursued the mission's aim of returning to establish a presence at Lake Nyasa.Wilson (1971) pp. 35–41  Rather than attempting the arduous river navigation that had doomed the first mission, they set out for Lake Malawi this time overland, developing a network of mission stations toward the lake. Prominent among these were the stations at Magila and Masasi: Magila had been chosen after an initial site the mission had sought at Vuga, the capital of the Kilindi kingdom, was ruled out by the suspicious Kilindi chief. The site for the mission village at Masasi was reportedly chosen by African converts whom the missionaries were attempting to lead back to the homes from which they had been captured by slavers: though sure that the site was not their original home, they said it resembled it enough to settle.Wilson (1971) p. 42 Via these routes, two missionaries, Charles Janson and William Percival Johnson, first reached the lake in 1884; Janson died there, but he lent his name to a ship the UMCA commissioned for use in ministering around the lake.Keable (1912) which Steere's successor, Charles Alan Smythies, was able to use to travel widely through Africa on mission work.Keable (1912) 112 He oversaw the establishment on Likoma Island, in the lake, of a mission station, and then of an entire new diocese with its own bishop and its own cathedral,Keable (1912) 134-6 St Peter's, is still standing in the 21st century."]}, {"page": "Christ Church, Zanzibar", "response": ["It was built in seven years, the foundation stone being laid on Christmas Day 1873 until the opening on Christmas 1879, based on a vision of Edward Steere, third Anglican bishop of Zanzibar, who actively contributed to the design. As most buildings in Stone Town, it is made mostly of coral stone. It has a unique concrete roof shaped in an unusual barrel vault (that was Steere's idea) and the overall structure mixes Perpendicular Gothic and Islamic details.The Cathedral  The cathedral was consecrated in 1903 and named after Canterbury Cathedral.", "Edward Steere died of a heart attack when the cathedral was almost completed, and was buried behind the altar. Inside the church there is a cross that was made from the wood of the tree that grows on the place where David Livingstone's heart was buried, in Chitambo.Saint Monica's Tours  "]}, {"page": "William Percival Johnson", "response": ["William Percival Johnson (12 March 1854 in St Helens, Isle of Wight – October 1928 in Liuli, Tanganyika) was an Anglican missionary to Nyasaland.Johnson of Nyasaland: a study of the life and work of William Percival Johnson  Bertram Herbert Barnes – 1933  \"CHAPTER I The Call to Africa WILLIAM PERCIVAL JOHNSON was born at Vernon 1854 Villa, St. Helens, in the Isle of Wight, on March 12, 1854. He was the third son of John Johnson, a lawyer of Ryde, and Mary Percival, his second wife, ...\" After education at Bedford School (1863–1873) and graduation from University College, Oxford he went to Africa with the Universities' Mission to Central Africa, under the Bishop Edward Steere.Tanzania notes and records Issues 31–35; Issues 31–35 Tanzania Society – 1951 \"The second Englishman was William Johnson, a Cambridge rowing \"blue\" who had come out to the Universities' Mission to Central Africa, of which Bishop Steere was the head. He was later to make himself a name as a great pioneer missionary \""]}, {"page": "Christianity in Malawi", "response": ["David Livingstone reached the lake he named Lake Nyasa, now Lake Malawi in 1859. Livingstone's famous appeal, made at a great meeting in the Senate House at Cambridge on December 4, 1857 led to the founding of the Universities' Mission to Central Africa (UMCA), and the first missionary expedition of the Universities' Mission to Central Africa arrived in Malawi in 1861. Missionaries included Bishop Edward Steere, William Tozer, Charles Alan Smythies, Chauncy Maples who drowned on Lake Nyasa, and W. Percival Johnson, a graduate of University College, Oxford, who was to remain in Malawi for 40 years and to translate the Bible into Chichewa language. The Dutch Reformed Church (DRC) established a base at Nkhoma then expanded to other parts of central Malawi, including Mlanda and Mchinji, and into Mozambique, Zambia, and Zimbabwe. The history of Roman Catholicism in Malawi begins with the entry of French White Fathers in 1899."]}, {"page": "Steere (surname)", "response": ["* Edward Steere (1828–1882), English bishop in Zanzibar and linguist"]}, {"page": "List of landmarks in Stone Town", "response": ["|The Church of Christ was built in the heart of Stone Town by Bishop Edward Steere at the site of the former slave market. The church was deliberately built to celebrate the end of slavery and the church's altar is built upon the site where the main whipping post of the market used to be. A monument to the slaves, as well as a museum on the history of slavery, are besides the church."]}, {"page": "John Farler", "response": ["Farler was baptised at St Mary Redcliffe on 17 June 1845,Family Search and educated at St John's College, Cambridge. He was ordained in 1874.'University and City Intelligence' \"Jackson's Oxford Journal\" (Oxford, England), Saturday, September 26, 1874; Issue 6339 After a curacy in Lambourn he was Chaplain to Edward Steere, the Bishop of NyasalandC. A. Harris, ‘Steere, Edward (1828–1882)’, rev. Andrew Porter, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, Sept 2012 , accessed 17 Oct 2017 from 1875 to 1882.\"The African Worker and the Universities’ Mission to Central Africa in Zanzibar, 1864-1900 Liebst, M p24:London, King's College (Journal of East Asian Studies), 2014  On his return to England he was the incumbent at St Giles, Reading before returning to Nyasaland in 1895. He died there on 30 May 1907.Deaths The Times (London, England), Tuesday, Apr 21, 1908; pg. 14; Issue 38626"]}, {"page": "Francis Roger Hodgson", "response": ["Francis Roger Hodgson (1853 – April 4, 1920)Hampsted Death Records 1920 https://www.findmypast.co.uk/transcript?id=BMD/D/1920/4/AZ/000418/079 was a British Anglican missionary and Bible translator in Zanzibar (1876–1888) and parish priest in Devon, England. The Anglican church appointed Hodgson as Archdeacon of Zanzibar (1882–1889),The Hodgsons of Sherborne, 1881-1922.retrieved at http://oldshirburnian.org.uk/wp-content/uploads/2014/02/Hodgsons-of-Sherborne-by-Michael-Hanson.pdf with Hodgson taking over both mission compound oversight and Bible translation work from Bishop Edward Steere. Their gradual church growth came from caring for slaves, refugees, and the marginalized. Christianity in Zanzibar started as a religion for slaves."]}, {"page": "Arthur Cornwallis Madan", "response": ["In 1880 he was sent to Zanzibar, where he learned Swahili and assisted bishop Edward Steere in his language research and translation work. When Steere died in August 1882, Madan finished Steere's manuscript of a Swahili grammar until the end of the year. (\"A handbook of the Swahili language as spoken at Zanzibar, edited for the Universities' Mission to Central Africa\")."]}]}}