{"wiki_id": "http://www.wikidata.org/entity/Q5341724", "itemLabel": "Edward Green Balfour", "itemDescription": "British surgeon and orientalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Balfour", "wikipedia_page": {"main": "Edward Green Balfour (6 September 1813 – 8 December 1889) was a Scottish surgeon, orientalist and pioneering environmentalist in India. He founded museums at Madras and Bangalore, a zoological garden in Madras and was instrumental in raising awareness on forest conservation and public health in India. He published a Cyclopaedia of India, several editions of which were published after 1857, translated works on health into Indian languages and wrote on a variety of subjects.", "link_mentions": [{"page": "George Balfour (Liberal politician)", "response": ["Balfour was the son of the George Balfour, of Montrose and an older brother of Edward Green Balfour. He was educated at the Addiscombe Military Seminary and became a lieutenant in the Madras Artillery in 1825. From 1832, he served with Malacca Field Force and was Staff Officer of Artillery with the Malacca Field Force from 1832 to 1833 when it was active in the capture of Chusan, Canton, and Amoy. He was adjutant of Artillery from 1833 to 1842, and A.A.G. from 1834 to 1835, He was with the  Field Force in the ceded districts, and in action of Zorapore in 1839 when he became Brigade Major in India. From 1840 to 1842 he was in China with the China Force. He was agent for captured property in China from 1841 to 1842 and receiver of public money paid by China under the Treaty of Nanking."]}, {"page": "Arignar Anna Zoological Park", "response": ["In 1854, Edward Green Balfour, the then director of the Government Central Museum at Madras, persuaded the Nawab of the Carnatic to donate his entire animal collection to the museum. This attracted large crowds and became the nucleus of the Madras Zoo, which was founded in 1855. Balfour started the zoo on the museum premises, and a year later it had over 300 animals, including mammals, birds and reptiles. It was later transferred to the Madras Corporation and shifted to People's Park near Chennai Central railway station at Park Town in 1861, as it was growing. The municipal zoological garden occupied one end of the  park and was open free to the public."]}]}}