{"wiki_id": "http://www.wikidata.org/entity/Q5345775", "itemLabel": "Edward Walford", "itemDescription": "British clergy, genealogist and editor", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Walford", "wikipedia_page": {"main": "Edward Walford (1823–1897) was a British magazine editor and a compiler of educational, biographical, genealogical and touristic works, perhaps best known for his 6 Volumes of Old and New London  (the first two of which were written by Walter Thornbury), 1878.", "link_mentions": [{"page": "Council of Chalcedon", "response": ["* Edward Walford, translator, The Ecclesiastical History of Evagrius: A History of the Church from AD 431 to AD 594, 1846. Reprinted 2008. Evolution Publishing, . "]}, {"page": "Justinian I", "response": ["* Evagrius Scholasticus, Ecclesiastical History, translated by Edward Walford (1846), reprinted 2008. Evolution Publishing, ."]}, {"page": "Pope Leo IV", "response": ["Leo IV had the figure of a rooster placed on the Old St. Peter's Basilica or old Constantinian basilicaST PETER'S BASILICA.ORG - Providing information on St. Peter's Basilica and Square in the Vatican City - The Treasury Museum  which has served as a religious icon and reminder of Peter's denial of Christ since that time, with some churches still having the cockerel on the steeple today. It is reputed that Pope Gregory I had previously said that the cock (rooster) \"was the most suitable emblem of Christianity\", being \"the emblem of St Peter\".John G. R. Forlong, Encyclopedia of Religions: A-d - Page 471The Antiquary: a magazine devoted to the study of the past, Volume 17 edited by Edward Walford, John Charles Cox, George Latimer Apperson - page 202  After Leo IV, Pope Nicholas I, who had been made a deacon by Leo IV, decreed that the figure of the cock (rooster) should be placed on every church.How the Chicken Conquered the World - By Jerry Adler and Andrew Lawler - Smithsonian magazine, June 2012 "]}, {"page": "Justin II", "response": ["*Edward Walford, translator (1846) The Ecclesiastical History of Evagrius: A History of the Church from AD 431 to AD 594, Reprinted 2008. Evolution Publishing, . "]}, {"page": "Khosrow II", "response": ["* Edward Walford, translator, The Ecclesiastical History of Evagrius: A History of the Church from AD 431 to AD 594, 1846. Reprinted 2008. Evolution Publishing, .  — a primary source containing detailed information about the early reign of Khosrow II and his relationship with the Romans."]}, {"page": "Tiberius II Constantine", "response": ["* Edward Walford, translator (1846) The Ecclesiastical History of Evagrius: A History of the Church from AD 431 to AD 594, Reprinted 2008. Evolution Publishing, . "]}, {"page": "Henotikon", "response": ["* Edward Walford, translator, The Ecclesiastical History of Evagrius: A History of the Church from AD 431 to AD 594, 1846. Reprinted 2008. Evolution Publishing  – contains a complete English translation of the Henotikon."]}, {"page": "Order of the Indian Empire", "response": ["*Sir William Robert Brooke (Director General of Telegraphs, IndiaEdward Walford )"]}, {"page": "Walford's County Families", "response": ["Walford's County Families is the short title of a work, partly social register, partly \"Who's Who\", which was produced in Britain in the 19th and 20th centuries, initially under the editorship of Edward Walford. It served as a guide or handbook to the British upper classes and landed gentry (in this case referred to in the title under the term, county families, for which see county family). The title of the annual volumes making up the series varied, and they are sometimes referred to simply as Walford or Walford's. According to the British Library catalogue, they were published from 1860 to 1920."]}, {"page": "John George Dodson, 1st Baron Monk Bretton", "response": ["Lord Monk Bretton married Caroline-Florence, second daughter of William John Campion of Danny, Hurstpierpoint, Sussex, by Harriet Kemp (daughter of Thomas Read Kemp) in 1856. They had one son and three daughters. They lived at 6, Seamore Place in Mayfair, and at Conyboro', near Lewes, Sussex. In 1878 Edward Walford described Seamore Place as follows: \"Seamore Place is the name of a row of handsome but somewhat old-fashioned mansions, which occupy a sort of cul de sac at the western end of Curzon Street. They are only nine in number, and their chief fronts look westward over Hyde Park\". Lord Monk Bretton died in May 1897, aged 71, and was succeeded in the barony by his only son John William Dodson.", "* Edward Walford, Old and new London, chapter 28, Mayfair, 1878."]}, {"page": "National Rifle Association of the United Kingdom", "response": ["In 1878 Edward Walford wrote \"These annual gatherings are attended by the élite of fashion, and always include a large number of ladies, who generally evince the greatest interest in the target practice of the various competitors, whether it be for the honour of carrying off the Elcho Shield, the Queen's or the Prince of Wales's Prize, or the shield shot for by our great Public Schools, or the Annual Rifle Match between the Houses of Lords and Commons.\"'Putney', Old and New London: Volume 6  (1878), pp. 489–503. Date accessed: 17 May 2014."]}, {"page": "George Walter Thornbury", "response": ["His first major work was Lays and legends of the New World (1851). It followed a history of the Buccaneers, Monarchs of the Main, (1855), Shakspeare's England during the reign of Elizabeth (1856, 2 Vols.) and Art and nature at home and abroad (1856, 2 Vols.). His Old and New London: a Narrative of its History, its People, and its Places was first published in 2 volumes in 1872, and in an undated edition of 1878 in 6 volumes, the last four being by Edward Walford.M. Clare Loughlin-Chow, ‘Thornbury, (George) Walter (1828–1876)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 3 Jan 2015 Many of these works are available online in full text from the Internet Archive Digital Library.", "* Old and New London: a Narrative of its History, its People, and its Places (1873–74, 2 Vols.) Continued in an undated edition of 1878 in 6 volumes, the last four being by Edward Walford. Full text available from the Internet Archive Digital Library"]}, {"page": "Philostorgius", "response": ["* Photios, Epitome of the Ecclesiastical History of Philostorgius, tr Edward Walford, (London: Henry G. Bonn, 1855)"]}, {"page": "Tuck shop", "response": ["\"Tucker\" may originate with the lacework at the top of 19th Century women's dresses, but the origin of its use in regard to food probably arises from the popular shops run in England by various members of the Tuck family between 1780 and 1850. The earliest reference found is to Thomas Tuck whose \"Tuck's Coffee House\" in Norwich, United Kingdom was popular among the city's literary circles in the late 18th Century. There was a library for the use of customers, and it was located on Gentleman’s Walk in the heart of the city. It is mentioned as a place of legal negotiation in public notices published in the Norfolk Chronicle on 9 February 1782 and 12 and 19 April 1783. In 1820, William Joseph Tuck was a confectioner at Duncan Place, Hackney, outside London. Hackney and nearby London Fields were fashionable for picnic outings and holidays at the time. The London Directory of 1846 records his son Thomas James Tuck as a baker at \"The Bun House\" in Duncan Place. Edward Walford in his Old and New London: Volume 5 of 1879 states: \"In the short thoroughfare connecting the London Fields with Goldsmiths' Row there is a shop which in bygone times was almost as much noted for its 'Hackney Buns' as the well-known Bun-house at Chelsea was for that particular kind of pastry.\" "]}, {"page": "Second Council of Ephesus", "response": ["* Edward Walford, translator, The Ecclesiastical History of Evagrius: A History of the Church from AD 431 to AD 594, 1846. Reprinted 2008. Evolution Publishing, ."]}, {"page": "Walford (disambiguation)", "response": ["* Edward Walford (1823–1897), English author and historian "]}, {"page": "Hungerford Market", "response": ["thumb|200px|\"Old Hungerford Market (from a view published in 1805)\". The bust of Sir Edward Hungerford (d.1711) is visible set high into the north wall.Position in north wall as stated in Edward Walford, 1878, p.131  Engraving by R.C. West, 1805, published in Edward Walford's \"Old and New London\", 1878 "]}, {"page": "Surrey Institution", "response": ["The architect employed was Joseph T. Parkinson, son of James Parkinson who owned the Rotunda, opened in 1787. The building had been the final home of the Leverian Museum, housing the collection of Sir Ashton Lever, but had fallen into disrepair.Old and New London volume 6, Edward Walford, Cassell & Company, page 382 The Institution renovated it to include a large lecture hall capable of accommodating 500 people, and a galleried library of 60 feet in length; it opened on 1 May 1808. Other facilities in the building included committee rooms; a library with lending facilities; a reading room, chemical laboratory and contemporary philosophical apparatus."]}]}}