{"wiki_id": "http://www.wikidata.org/entity/Q535822", "itemLabel": "Sally Gardner", "itemDescription": "British children's writer and illustrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Sally_Gardner", "wikipedia_page": {"main": "Sally Gardner is a British children's writer and illustrator. She won both the Costa Children's Book Award and the Carnegie Medal for Maggot Moon (Hot Key Books, 2012). Under her pseudonym Wray Delaney she has also written adult novels.", "link_mentions": [{"page": "List of children's literature writers", "response": ["*Sally Gardner – The Countess's Calamity, I, Coriander, The Red Necklace"]}, {"page": "Carnegie Medal (literary award)", "response": ["* * Sally Gardner, Maggot Moon (Hot Key Books), 11+", "* Sally Gardner, Tinder (Orion), 11+"]}, {"page": "List of people with dyslexia", "response": ["*Sally Gardner, English author and illustrator"]}, {"page": "Guardian Children's Fiction Prize", "response": [": – Sally Gardner, Maggot Moon (Hot Key Books), Age 12+", ": – Sally Gardner, The Silver Blade (Orion)"]}, {"page": "Nestlé Smarties Book Prize", "response": ["* 9–11 years: I, Coriander by Sally Gardner (Orion)", "Kids' Club Award: The Countess's Calamity by Sally Gardner", "::* 6–8 years: The Countess's Calamity by Sally Gardner"]}, {"page": "Kate Greenaway Medal", "response": ["* David Roberts, Tinder (Orion Books), by Sally Gardner"]}, {"page": "Calling card (crime)", "response": ["* In the novel, The Red Necklace by Sally Gardner, the villainous Count Kalliovski leaves a necklace of red silk set with garnets upon each of his murder victims, making it appear as though the victim's throat has been slit."]}, {"page": "Costa Book Awards", "response": ["|align=\"left\"|Sally GardnerMaggot Moon"]}, {"page": "Romani people in fiction", "response": ["* 2007:  In Sally Gardner's novel The Red Necklace, the main character Yann and his companion Têtu are Gypsy along with the antagonist Kalliovski."]}, {"page": "Sally gardner", "response": ["#REDIRECT Sally Gardner "]}, {"page": "Booktrust Teenage Prize", "response": ["**The Red Necklace by Sally Gardner"]}, {"page": "David Roberts (illustrator)", "response": ["Roberts has also illustrated the series Wings & Co: The Fairy Detective Agency by Sally Gardner (Operation Bunny: the fairy detective agency's first case, Three Pickled Herrings and The Vanishing of Billy Buckle as of 2013) and the covers for a reprint of Enid Blyton's St Clare's books."]}, {"page": "National Book Awards Children's Book of the Year", "response": ["* I, Coriander by Sally Gardner"]}, {"page": "Tom Hiddleston", "response": ["Hiddleston was the voiceover for BBC's documentary on the Galapagos Island in 2006. He also narrated the audiobook The Red Necklace by Sally Gardner in 2007,Gardner, Sally. The Red Necklace. Amazon.com. Retrieved 17 April 2012. Hiddleston played the leading role of Edward in Hogg's second feature, Archipelago (2010). His TV credits include Magnus Martinsson in the BBC detective drama Wallander (2008), Bill Hazledine in Suburban Shootout (2006), John Plumptre in the BBC costume drama TV film Miss Austen Regrets (2008) and William Buxton in the BBC drama series Return to Cranford (2009). In 2007, he joined a list of British actors, including Kate Winslet and Orlando Bloom, to have guest starred in the long-running medical drama Casualty."]}, {"page": "I, Coriander", "response": ["I, Coriander is a young adult novel by Sally Gardner, published in 2005, a historical fantasy set in London at the time of the Puritan Commonwealth. The novel traces the time period of the beheading of Charles the 1st through the Restoration of Charles the 2nd. It won the Nestlé Children's Book Prize Gold Award.Nestlé Children's Book Prize  It was also shortlisted for the British Children's Book of the Year and the Stockton Children's Book of the Year,British Book Awards as well as longlisted for the Carnegie Medal.The CILIP Carnegie Medal & Kate Greenaway Children's Book Awards"]}, {"page": "The Countess's Calamity", "response": ["The Countess's Calamity is a children's book written and illustrated by Sally Gardner, published in 2003.The Countess's Calamity at WorldCat It won the Nestlé Smarties Book Prize Bronze Award.Nestlé Children's Book Prize  It is the first of the Tales from the Box series about sentient toys."]}, {"page": "The Red Necklace", "response": ["The Red Necklace  is a young adult historical novel by Sally Gardner, published by Orion in 2007. It is a story of the French Revolution, interwoven with gypsy magic. The audiobook is narrated by Tom Hiddleston."]}, {"page": "Opera North: history and repertoire, seasons 1981–82 to 1989–90", "response": ["|1981–82 || Macbeth ||  Verdi ||  John Rawnsley (Macbeth), Elizabeth Vaughan (Lady Macbeth), Anthony Roden (Macduff) ||  David Lloyd-Jones ||  Michael Geliot ||  John Gunter/Sally Gardner"]}, {"page": "Concorde Book Award", "response": ["|Sally Gardner"]}, {"page": "Kitschies", "response": ["*Winner - \"The Door That Led to Where\" by Sally Gardner, art direction and design by Jet Purdie"]}, {"page": "Big Day Out (disambiguation)", "response": ["* Boolar's Big Day Out, a children's book by Sally Gardner"]}, {"page": "2012 Costa Book Awards", "response": ["*Sally Gardner, Maggot Moon"]}, {"page": "Emirates Airline Festival of Literature", "response": ["In 2014, there were about 169 attending authors in the sixth Festival, which was also the Festival’s most significant. The Festival continued with the previous year’s format, replacing The Lighter Side with Friday Rhythms, an evening of poetry and music with an innovative rock/poetry fusion performance by LiTTLe MaCHiNe. In addition, the Festival introduced new sessions, Literary Idol, a cross between Dragons’ Den and Pop Idol, and Big Ideas, where authors went up on stage to speak on a topic of their choice along with the Festival Prologue, a series of three-day workshops held on the weekend before the Festival. Among the author attendees were Saud AlSanousi, Paddy Ashdown, Pam Ayres, Henry Blofeld, Eoin Colfer, Nicholas Evans, Richard and Judy, Vivian French, Sally Gardner, Joanne Harris, Christina Lamb, Andrew Motion, Jeremy Paxman, Sir Tim Rice, Ahdaf Soueif, and many more."]}, {"page": "Nina Lowry", "response": ["Collins married Edward Lucas Gardner (1912–2001), a barrister and recorder, in 1950. They had a son and also a daughter,  the writer Sally Gardner.Blog Tour: Tinder by Sally Gardner Retrieved 11/9/21. Noreen's marriage to Gardner was dissolved in 1962. Noreen married Richard John Lowry (1924–2001), a barrister, on 24 April 1963."]}, {"page": "Theatre-fiction", "response": ["* Sally Gardner, The Red Necklace (2007)"]}, {"page": "Wray Delaney", "response": ["#REDIRECT Sally Gardner"]}, {"page": "An Almond for a Parrot", "response": ["An Almond for a Parrot was published in 2016 by English author Sally Gardner (who writes children’s fiction) under the pseudonym Wray Delaney,An Almond for a Parrot by Wray Delaney Retrieved 10/9/21. this is an adult novel set in London in 1756, and has been described as an erotic fairytale.A sexual odyssey across 18th-century London has shades of Sarah Waters and the Brothers Grimm Retrieved 10/9/21. It takes its title from a tract by Elizabethan writer Thomas Nashe. "]}, {"page": "Maggot Moon", "response": ["Maggot Moon is a young adult novel written by Sally Gardner, illustrated by Julian Crouch, and published February 12, 2013 by Candlewick Press. The book takes place in an alternate timeline of 1956 as the characters live in \"The Motherland,\" telling a tale of what could have happened had the Nazis won the Second World War."]}]}}