{"wiki_id": "http://www.wikidata.org/entity/Q5354350", "itemLabel": "Eleanor Oldroyd", "itemDescription": "English sports broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Eleanor_Oldroyd", "wikipedia_page": {"main": "Eleanor Oldroyd (born in Bury, Lancashire, 2 June 1962) is a British sports broadcaster with BBC Radio.\n\n", "link_mentions": [{"page": "BBC Radio 5 Live", "response": ["* Weekend Breakfast with Chris Warburton and Eleanor Oldroyd"]}, {"page": "List of sports announcers", "response": ["* Eleanor Oldroyd – BBC Radio 2010-2018", "* Eleanor Oldroyd – BBC Radio 5 Live 1994–present"]}, {"page": "BBC Radio Shropshire", "response": ["* Eleanor Oldroyd (previously on BBC Radio 5 Live and BBC Radio 1)"]}, {"page": "Oxford High School, England", "response": ["* Eleanor Oldroyd, BBC Radio Sport presenter"]}, {"page": "Newsbeat", "response": ["Previous reporters and main presenters include Eleanor Oldroyd, Carolyn Atkinson, Claire Bradley, Tina Daheley, Claire Cavanagh, Dominic Byrne, Georgina Bowman, Anna Foster, Tulip Mazumdar, Chris Smith, Declan Harvey and Sinead Garvan."]}, {"page": "Fighting Talk", "response": ["* Eleanor Oldroyd - Sports journalist (labelled \"The First Lady of Fighting Talk\")"]}, {"page": "5 live Sport", "response": ["Eleanor Oldroyd"]}, {"page": "Nick Mullins", "response": ["Mullins is a supporter of Leicester City. He was previously married to Radio 5 Live presenter Eleanor Oldroyd, and they have two children. In 2016, Mullins married Melissa Platt. Platt was a reporter for Sky Sports but is now the Head of Communications for Wasps Rugby Club and the Head of Media for the Rugby Players' Association (RPA)."]}, {"page": "List of current BBC newsreaders and reporters", "response": ["| Eleanor Oldroyd || Saturday Breakfast, The Friday Sports Panel"]}, {"page": "Phil Williams (presenter)", "response": ["Three years in a similar role at BBC Radio 1 followed before Williams transferred to Radio 5 Live, initially as an entertainment reporter. He formerly hosted the Weekend Breakfast show, firstly with Anna Foster, and then with Eleanor Oldroyd on Saturdays and with Caroline Barker on Sundays. From 13 May 2013 he switched to the late-night show – presenting the show from Mondays to Wednesdays, 10:30pm1am, and also on Thursdays 10pm1am, when BBC One's political discussion show Question Time was off-season. He left the station after presenting his final programme on 8 May 2019. In November 2019, he stood in for OJ Borg on BBC Radio 2's late night show."]}, {"page": "Oldroyd", "response": ["*Eleanor Oldroyd (born 1962), English sports broadcaster"]}, {"page": "2012 BBC Sports Personality of the Year Award", "response": ["*A representative from BBC Radio 5 Live - this year, Eleanor Oldroyd."]}, {"page": "Sussex International Piano Competition", "response": ["The international jury for the second edition of the competition was drawn from across the music industry and included composer/pianist John McCabe (President of the British Music Society), Philip Fowke (UK), Yuki Negishi (Japan), Judith Clark (Brighton Philharmonic Orchestra) and the competition’s 2010 inaugural winner Arta Arnicane (Latvia).  Patrons of the event include Karl Jenkins, Rick Wakeman, and BBC presenters Katie Derham, Ken Bruce, John Inverdale and Eleanor Oldroyd.  "]}, {"page": "The Boat Races 2015", "response": ["The television historian and former Oxford rower Dan Snow (who represented the Dark Blues in the 1999, 2000 and 2001 races) said: \"Most televised sport is a carnival of misogyny so it is great news that the Boat Race is leading the way in ensuring that women take their rightful place alongside men.\" The BBC sports broadcaster Eleanor Oldroyd suggested that scheduling the races on the same course and day was \"a game-changing move\" for female sport, and \"now they've achieved equality – same course, same distance, same , same BBC TV coverage, to an expected global audience of 100 million\". The television presenter Clare Balding opted to cover the women's race instead of the 2015 Grand National, claiming that the combined rowing event would have a \"ripple effect all across society, business and sport\"."]}, {"page": "Chris Warburton", "response": ["Christopher Ernest John Warburton is a British radio and podcast presenter who works for BBC Radio 5 Live. He presented the news and technology programme Saturday Edition on the station until October 2014, and since then has presented Saturday Breakfast alongside Eleanor Oldroyd and Sunday Breakfast, originally alongside Sam Walker, from 6am to 9am on both days. In addition, Warburton presented In Short, the best of BBC Radio 5 Live programme from 2013 to 2018. Retrieved 10 January 2018  He has also covered for presenters on BBC Radio 6 Music and You and Yours on BBC Radio 4. Retrieved 10 January 2018 Prior to this he presented the breakfast show on BBC Wiltshire."]}]}}