{"wiki_id": "http://www.wikidata.org/entity/Q535218", "itemLabel": "Hans Matheson", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Hans_Matheson", "wikipedia_page": {"main": "Hans Matheson (born 7 August 1975) is a Scottish actor and musician. In a wide-ranging film and television career he has taken lead roles in diverse films such as Doctor Zhivago, Sherlock Holmes, The Tudors, Tess of the d'Urbervilles, Clash of the Titans and 300: Rise of an Empire. In addition to acting, Matheson sings and plays guitar, violin and harmonica, and released an album of his songs in 2019.", "link_mentions": [{"page": "Boris Pasternak", "response": ["In 2002, the novel was adapted as a television miniseries. Directed by Giacomo Campiotti, the serial starred Hans Matheson, Alexandra Maria Lara, Keira Knightley, and Sam Neill."]}, {"page": "Ennio Morricone", "response": ["In the late 1990s, he collaborated with his son Andrea on the Ultimo crime dramas, resulting in Ultimo (1998), Ultimo 2 – La sfida (1999), Ultimo 3 – L'infiltrato (2004) and Ultimo 4 – L'occhio del falco (2013).Ultimo (OST) (1999) senscritique.com For Canone inverso (2000) based on the music-themed novel of the same name by the Paolo Maurensig, directed by Ricky Tognazzi and starring Hans Matheson, Morricone won Best Score awards in the David di Donatello Awards and Silver Ribbons.BFI page for Canone Inverso – Making Love (2000) accessed 20 August 2020."]}, {"page": "Robert Devereux, 2nd Earl of Essex", "response": ["* In the 2005 The Virgin Queen, Hans Matheson played the ill-fated Earl of Essex."]}, {"page": "Tess of the d'Urbervilles", "response": ["**2008: A four-hour BBC adaptation, written by David Nicholls, aired in the United Kingdom in September and October 2008 in four parts,Tess of the D'Urbervilles – Thomas Hardy's classic novel for BBC One. – BBC. – 21 January 2008. and in the United States on the PBS series Masterpiece Classic in January 2009 in two parts.David Wiegand, \"Compelling performances rescue 'Tess'\": San Francisco Chronicle, 2 January 2009. The cast included Gemma Arterton (Tess), Hans Matheson (Alec), Eddie Redmayne (Angel), Ruth Jones (Joan), Anna Massey (Mrs d'Urberville), and Kenneth Cranham (Reverend James Clare).Tess Of The D'Urbervilles – vibrant young cast line-up for dramatic adaptation of Hardy classic for BBC One. – BBC. – 17 March 2008.Tess of the d'Urbervilles (2008). – IMDb."]}, {"page": "Isle of Lewis", "response": ["* Hans Matheson, plays the title role in a television serialisation of Boris Pasternak's novel, Doctor Zhivago"]}, {"page": "Mordred", "response": ["Virtually everywhere Mordred appears, his name is synonymous with treason. He appears in Dante's Inferno in the lowest circle of Hell, set apart for traitors: \"him who, at one blow, had chest and shadow / shattered by Arthur's hand\" (Canto XXXII).Inferno, Canto XXXII, lines 61–62 (Mandelbaum translation). Mordred is especially prominent in popular modern era Arthurian literature, as well as in film, television, and comics.Torregrossa, Michael A., \"Will the 'Reel' Mordred Please Stand Up? Strategies for Representing Mordred in American and British Arthurian Film\" in Cinema Arthuriana: Twenty Essays (Rev. edn.), ed. Kevin J. Harty. Jefferson, NC: McFarland, 2002 (pb. 2009), pp. 199–210. He has been portrayed on screen by Leonard Penn (The Adventures of Sir Galahad 1949), Brian Worth (The Adventures of Sir Lancelot 1956–1957), David Hemmings (Camelot 1967), Robert Addie (Excalibur 1981), Nickolas Grace (Morte d'Arthur 1984), Simon Templeman (The Legend of Prince Valiant 1991–1994), Jason Done (Merlin 1998), Craig Sheffer (Merlin: The Return 2000), Hans Matheson (The Mists of Avalon 2001), and Asa Butterfield and Alexander Vlahos (Merlin 2008–2012), among others. In such modern adaptations, Morgause is often conflated with (and into) the character of Morgan le Fay, who may be Mordred's mother or alternatively his lover or wife. A few works of the Middle Ages and today, however, portray Mordred as less a traitor and more a conflicted opportunist, or even a victim of fate.The New Arthurian Encyclopedia, p. 394. Even Malory, who depicts Mordred as a villain, notes that the people rallied to him because, \"with Arthur was none other life but war and strife, and with Sir Mordred was great joy and bliss.\""]}, {"page": "2001 in film", "response": ["| The Mists of Avalon || TNT / Constantin Film / Stillking Films / Wolper Organization || Uli Edel (director); Gavin Scott (screenplay); Anjelica Huston, Julianna Margulies, Joan Allen, Samantha Mathis, Edward Atterton, Michael Vartan, Caroline Goodall, Michael Byrne, Hans Matheson, Mark Lewis Jones, Clive Russell, Biddy Hodson, Ian Duncan, Tamsin Egerton, Freddie Highmore, Christopher Fulford, David Calder, Hugh Ross, Edward Jewesbury, Noah Huntley, Karel Dobrý, Klára Issová, Tony Curran || Drama, Fantasy || Live action"]}, {"page": "1998 in film", "response": ["| Les Misérables || Columbia Pictures / Mandalay Entertainment || Bille August (director); Rafael Yglesias (screenplay); Liam Neeson, Geoffrey Rush, Uma Thurman, Claire Danes, Hans Matheson, Jon Kenny, John McGlynn, Kelly Hunter, Lennie James, Peter Vaughan, Julian Rhind-Tutt, David Birkin, Ben Crompton, Patsy Byrne, Frank O'Sullivan, Christopher Adamson, Tim Barlow, Shannon McCormick, Reine Brynolfsson, Kathleen Byron, Toby Jones, Edward Tudor-Pole, Gillian Hanna || Drama || Live action", "| Still Crazy || Columbia Pictures || Brian Gibson (director); Dick Clement, Ian La Frenais (screenplay); Stephen Rea, Billy Connolly, Jimmy Nail, Timothy Spall, Bill Nighy, Juliet Aubrey, Helena Bergström, Bruce Robinson, Hans Matheson, Lee Williams, Rachael Stirling, Alphonsia Emmanuel, Phil Daniels, Zoe Ball, Frances Barber, Rupert Penry-Jones || Comedy || Live action"]}, {"page": "1999 in film", "response": ["| Still Crazy || Columbia Pictures || Brian Gibson (director); Dick Clement, Ian La Frenais (screenplay); Stephen Rea, Billy Connolly, Jimmy Nail, Timothy Spall, Bill Nighy, Juliet Aubrey, Helena Bergstrom, Bruce Robinson, Hans Matheson, Lee Williams, Rachael Stirling, Alphonsia Emmanuel, Phil Daniels, Zoe Ball, Frances Barber, Rupert Penry-Jones || Comedy || Live action"]}, {"page": "Stornoway", "response": ["*Hans Matheson - actor"]}, {"page": "Ken Narita", "response": ["* 300: Rise of an Empire (Aeschylus (Hans Matheson)"]}, {"page": "The Virgin Queen (TV serial)", "response": ["| Robert Devereux, 2nd Earl of Essex || Hans Matheson  || 3, 4"]}, {"page": "Deathwatch (2002 film)", "response": ["* Hans Matheson as Private Jack Hawkstone. He carries a harmonica, playing it to lift morale."]}, {"page": "Les Misérables (1998 film)", "response": ["* Hans Matheson as Marius Pontmercy"]}, {"page": "Still Crazy", "response": ["* Hans Matheson as Luke Shand"]}, {"page": "Half Light (film)", "response": ["Half Light is a 2005 British mystery-horror drama film starring Demi Moore and Hans Matheson. It was directed by Craig Rosenberg, who also penned the screenplay.", "*Hans Matheson as Angus McCulloch"]}, {"page": "Tube Tales", "response": ["Starring: Hans Matheson and Carmen Ejogo", "Cast: (in alphabetical order) Tim Barlow (Elderly Drunk); Darren Carr (Black Boy); Jim Carter (Ticket Inspector); Emma Cunniffe (Drained Young Woman); Clint Dyer (Walkman Boy); Jello Edwards (Middle Aged Woman); Annette Ekblom (Boy's Mum); Carmen Ejogo (Girl); Simon Kunz (White Pinstripe Suit Man); Hans Matheson (Michael); Simon Pegg (Clerk); Sean Pertwee (Driver); Lee Ross (Male Reveller); Don Warrington (Preacher)."]}, {"page": "Hans (name)", "response": ["* Hans Matheson (born 1975), Scottish actor"]}, {"page": "Nero (2004 film)", "response": ["* Hans Matheson - Nero"]}, {"page": "The Mists of Avalon (miniseries)", "response": ["* Hans Matheson as Mordred", "The Mists of Avalon was watched by more than 30 million \"unduplicated viewers\" during its premiere; the first episode \"was the highest-rated original movie of the summer on basic cable.\" Critical reception was mixed but generally positive. USA Today gave the miniseries three stars out of four, crediting its success to Margulies, Huston and Allen as well as Gavin Scott's adaptation. Reviews from Entertainment Weekly  and The San Francisco Chronicle were also somewhat positive.  Hollywood.com said simply that the series \"works\" and that \"instead of glorifying these legendary characters, Avalon fleshes out their weaknesses, desires and ultimate failures.\" Kendal Butler of  Culture Vulture felt that Hans Matheson as the adult Mordred \"promptly walks off with the show\" but that the overall production was hampered by \"cheesiness\" and failed to adequately convey the religious contention between the pagan beliefs and Christianity that were central to the novel.Review: The Mists of Avalon ,  Kendal Butler ,  Culture Vulture"]}, {"page": "Doctor Zhivago (novel)", "response": ["* A 2002 British television serial stars Hans Matheson, Keira Knightley, Alexandra Maria Lara, and Sam Neill. It was broadcast by ITV in the UK in November 2002 and on Masterpiece Theatre in the US in November 2003."]}, {"page": "I Am Dina", "response": ["* Hans Matheson as Tomas"]}, {"page": "Rikiya Koyama", "response": ["*Sherlock Holmes: Lord Coward (Hans Matheson)"]}, {"page": "List of biographical films", "response": ["||Hans Matheson"]}, {"page": "Nick Moran", "response": ["Moran's first hit film appearance was in 1990 alongside Roger Daltrey and Chesney Hawkes, in Buddy's Song (1990). His first lead role was later that year, in Vera Neubauer's Don't Be Afraid (1990). He then went on to star with Britpack waifs Hans Matheson and Samantha Morton in a Coky Giedroyc short, The Future Lasts a Long Time (1996). In Lock, Stock and Two Smoking Barrels (1998), he shared the screen with Jason Statham, Dexter Fletcher, Jason Flemyng, Vinnie Jones and British singer Sting, who played the role of his father, JD."]}, {"page": "Nero in the arts and popular culture", "response": ["*Nero (Hans Matheson)"]}, {"page": "Tokuyoshi Kawashima", "response": ["* The Mists of Avalon – Mordred (Hans Matheson)"]}, {"page": "Jimmy Nail discography", "response": ["* Strange Fruit, Jimmy Nail, Billy Connolly, Hans Matheson "]}, {"page": "The Tudors", "response": ["| Hans Matheson"]}, {"page": "Doctor Zhivago (TV series)", "response": ["Doctor Zhivago is a 2002 British television drama serial directed by Giacomo Campiotti and starring Hans Matheson, Keira Knightley and Sam Neill. The teleplay by Andrew Davies is based on the 1957 novel of the same title by Boris Pasternak.", "* Hans Matheson ..... Yuri Zhivago", "*Interview with Hans Matheson"]}, {"page": "List of The Tudors characters", "response": ["| align=\"center\"| Hans Matheson (2008)"]}, {"page": "Shunsuke Sakuya", "response": ["*Sherlock Holmes (Lord Coward (Hans Matheson))"]}, {"page": "Matheson (surname)", "response": ["*Hans Matheson, Scottish actor"]}, {"page": "List of Scottish Gaelic-speaking people", "response": ["* Hans Matheson"]}, {"page": "Paolo Maurensig", "response": ["Of Canone inverso, the New York Times Book Review said in 1999 that Maurensig's writing, especially the interlocking narratives, recalled German Romantic writers such as E. T. A. Hoffmann and Joseph von Eichendorff, and also Isak Dinesen. Reviewer Jonathan Keates said, \"The mournful beauty of this sparely proportioned, soberly recounted story owes much to the sense Maurensig subtly imparts that Jeno's loneliness is a species of infection communicating itself to every other character in the book. Drawing on the artistic techniques of both the 18th and the 19th centuries, he pronounces a gloomy verdict on the various types of human alienation created by the 20th.\" NPR said that the book had developed a \"cult following.\"NPR : Music - PT Summer Books The novel was made into a film in 1999 directed by Ricky Tognazzi starring Hans Matheson and Mélanie Thierry, and with an award-winning score by Ennio Morricone.BFI page for Canone Inverso - Making Love (2000) accessed 20 August 2020."]}, {"page": "List of Scottish actors", "response": ["*Hans Matheson (born 1975)"]}, {"page": "List of British films of 2006", "response": ["|Half Light||Craig Rosenberg ||Demi Moore, Hans Matheson ||Thriller ||"]}, {"page": "List of Italian films of 2000", "response": ["| Canone inverso || Ricky Tognazzi ||Hans Matheson, Mélanie Thierry, Gabriel Byrne  ||Drama  || Five David di Donatello (Best Cinematography, Best Editing, Best Production Design, Best Score and a special \"Scuola David Award\"), three Silver Ribbons (Best Cinematography, Best Editing and Best Score), Best Feature Film award and Audience Award for Best Feature at 2001 Newport Beach Film Festival."]}, {"page": "Tess of the D'Urbervilles (2008 TV serial)", "response": ["The cast features Gemma Arterton as Tess, Hans Matheson as Alec, Eddie Redmayne as Angel, Ruth Jones as Joan, Anna Massey as Mrs d'Urberville and Kenneth Cranham as Rev Clare.Tess Of The D'Urbervilles – vibrant young cast line-up for dramatic adaptation of Hardy classic for BBC One. - BBC. - 17 March 2008.", "thumb|left|Gemma Arterton and Hans Matheson shooting on location.", "*Hans Matheson as Alec D'Urbeville - Alec is the self-centered and manipulative eldest son of Tess' supposed illustrious relatives, the D'Urbervilles. After going to work at The Slopes — Alec's family home — Tess falls into his clutches. He is the \"tragic mischief\" and she is easily seduced by his apparent charm and generosity."]}, {"page": "Sherlock Holmes (2009 film)", "response": ["* Hans Matheson as Lord Coward, the Home Secretary who is Blackwood's right-hand man and assisted Blackwood in all his murders and was one of the few of his allies aware of Blackwood's usage of technology to feign magical powers."]}, {"page": "Still Crazy (soundtrack album)", "response": ["# \"Live for Today\" - Hans Matheson - (C. Langer)"]}, {"page": "Mojo (play)", "response": ["The original cast was Hans Matheson (Silver Johnny), Tom Hollander (Baby), Aidan Gillen (Skinny), Matt Bardock (Sweets), David Westhead (Mickey), and Andy Serkis (Potts).Review of Mojo by Matt Wolf in Variety, 21 August 1995, accessed 25 August 2020."]}, {"page": "2002 in British television", "response": ["**ITV broadcasts the first episode of a three part version of the 1957 novel Doctor Zhivago. Adapted by Andrew Davies, it stars Hans Matheson as Zhivago and Keira Knightley as Lara."]}, {"page": "Clash of the Titans (2010 film)", "response": ["* Hans Matheson as Ixas, a soldier from Argos who accompanies Perseus."]}]}}