{"wiki_id": "http://www.wikidata.org/entity/Q5364983", "itemLabel": "Ellen Pollock", "itemDescription": "British actress (1902-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ellen_Pollock", "wikipedia_page": {"main": "Ellen Pollock (29 June 1902 – 29 March 1997) was a British character actress, mainly appeared on stage in London's West End. She also appeared in several films and TV productions.\nA devotee of Bernard Shaw, she was president of the Shaw Society from 1949. In their obituary, the Independent wrote \"Pollock is believed to have played, in a career spanning 72 years, more Shavian heroines than anyone else. She directed London seasons of his plays; and it was during the London premiere of one of his lesser-known works – Farfetched Fables (Watergate, 1950) – that she announced Shaw's death from the stage.\"Pollock's dedication to acting began as a seven-year-old, when she saw Sarah Bernhardt on stage; she knew then that she wanted to be an actress herself. Pollock was also a theatre director and a teacher of drama at RADA and Webber Douglas Academy of Dramatic Art; and her varied television work included several appearances in The Forsyte Saga for the BBC.She outlived both husbands, Captain Leslie Hancock and the artist James Proudfoot. She had one child with Captain Hancock. Pollock was the subject of TV's This Is Your Life in 1992.Ellen Pollock's mother, Hedwig Kahn, was the sister of Otto Hermann Kahn (wealthy investment banker, collector, philanthropist, and patron of the arts) and composer Robert Kahn.", "link_mentions": [{"page": "1902", "response": ["* June 29 – Ellen Pollock, British actress (d. 1997)"]}, {"page": "1997 in film", "response": ["| style=\"text-align:center;\"| 29 || Ellen Pollock || style=\"text-align:center;\"| 94 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actress || "]}, {"page": "The Provoked Wife", "response": ["One of the first radio adaptations was broadcast on the BBC Third Programme on 15 June 1948.http://genome.ch.bbc.co.uk/5e472ce7ee774f7da4bcdbc64c198fed The production was adapted by Ronald Simpson, and the cast included Norman Shelley as Sir John Brute, Lydia Sherwood as Lady Brute, Ellen Pollock as Lady Fanciful."]}, {"page": "Never Mind the Quality, Feel the Width", "response": ["Notable guest artistes included film actors Dennis Price as a Savile Row tailor and Rupert Davies as a Roman Catholic bishop, Fred Emney, Harold Bennett, David Kossoff (playing himself), Jack Smethurst, Dad's Army stars Frank Williams (playing another clergyman) and Bill Pertwee, comedian Dick Bentley, Roy Marsden, Victor Maddern, future Coronation Street stars Barbara Knox (as Barbara Mullaney) and Roy Barraclough, George A. Cooper, Rita Webb, On the Buses star Michael Robbins, and Ellen Pollock as Manny's mother Ruby."]}, {"page": "The Pallisers", "response": ["*Ellen Pollock: Lady Baldock"]}, {"page": "Finders Keepers (1966 film)", "response": ["*Ellen Pollock as Grandma"]}, {"page": "1902 in the United Kingdom", "response": ["* 29 June – Ellen Pollock, character actress (died 1997)"]}, {"page": "So Evil, So Young", "response": ["So Evil, So Young is a 1961 British Technicolor reform school prison film produced by the Danzigers, directed by Godfrey Grayson, and starring Jill Ireland and Ellen Pollock.", "* Ellen Pollock as Miss Smith"]}, {"page": "Horror Hospital", "response": ["When attempts to break into the pop business leave him with nothing but a bloody nose, songwriter Jason Jones (Robin Askwith) decides to take a break with 'Hairy Holidays', an outfit run by shifty, gay travel agent Pollock (Dennis Price). After failing to chat Jason up, Pollock sends him to pseudo-health farm Brittlehurst Manor. On the train journey there, Jason meets Judy (Vanessa Shaw) who is travelling to the same destination to meet her long-lost aunt. Both are unaware that the health farm (i.e. \"Horror Hospital\") is a front for Dr. Storm (Michael Gough) and his lobotomy experiments that turn wayward hippies into his mindless zombie slaves. The wheelchair-bound doctor surrounds himself with an entourage that includes Judy's aunt, erstwhile brothel madam Olga (Ellen Pollock), dwarf Frederick (Skip Martin) and numerous zombie biker thugs. Dr. Storm also has a Rolls Royce car, fitted with a giant blade that decapitates escapees and interfering parties. Abraham (Kurt Christian) arrives at the Horror Hospital \"looking for his chick\" and is promptly whacked around the head by the motorcycle zombies. Frederick, fed up at literally being Storm's whipping boy, helps the kids escape—paving the way for the '70s' youth to put the final spanner/wrench in the works to Storm's scheme.", "* Ellen Pollock\t– \tAunt Harris"]}, {"page": "List of British films of 1955", "response": ["|The Time of His Life||Leslie S. Hiscott ||Richard Hearne, Ellen Pollock||Comedy||"]}, {"page": "List of British films of 1961", "response": ["|So Evil, So Young||Godfrey Grayson||Jill Ireland, Ellen Pollock||Drama||"]}, {"page": "List of British films of 1966", "response": ["|Who Killed the Cat?||Montgomery Tully||Mary Merrall, Ellen Pollock||Mystery||"]}, {"page": "Spare a Copper", "response": ["* Ellen Pollock as Lady Hardstaff"]}, {"page": "List of British films of 1930", "response": ["|Too Many Crooks||George King||Laurence Olivier, Dorothy Boyd, Ellen Pollock||Comedy short||"]}, {"page": "List of British films of 1939", "response": ["|Shadow of Death||Harry S. Marks ||Donald Calthrop, Ellen Pollock||Drama short||"]}, {"page": "The Galloping Major (film)", "response": ["* Ellen Pollock as Horsey Lady"]}, {"page": "Non-Stop New York", "response": ["* Ellen Pollock as Miss Harvey"]}, {"page": "Sons of the Sea (film)", "response": ["* Ellen Pollock as Margaret Hulls"]}, {"page": "The Wife's Family", "response": ["*Dolly White -\tEllen Pollock"]}, {"page": "Too Many Crooks (1930 film)", "response": ["*Ellen Pollock as The Other Girl "]}, {"page": "Moulin Rouge (1928 film)", "response": ["*Ellen Pollock as Girt"]}, {"page": "The Informer (1929 film)", "response": ["* Ellen Pollock as Prostitute"]}, {"page": "The Time of His Life", "response": ["The Time of His Life is a 1955 British comedy film directed by Leslie S. Hiscott and starring Richard Hearne, Ellen Pollock, Richard Wattis and Robert Moreton. The screenplay concerns a man who is released from prison and goes to live with his socialite daughter.", "When newly released prisoner Mr. Pastry (Richard Hearne) arrives to stay, he proves an embarrassment to his social climbing daughter Lady Florence (Ellen Pollock). As president of the society for the rehabilitation of ex-convicts, she attempts to hide the fact her father is an ex-con. She locks Mr. Pastry in his bedroom, and even plots to have him sent to Australia. But Lady Florence's children see Mr. Pastry differently, and he helps them through a problem, prompting even his daughter to see Mr. Pastry in a new light.", "* Ellen Pollock as Lady Florence"]}, {"page": "The Long Knife", "response": ["* Ellen Pollock as Mrs Cheam"]}, {"page": "Kiss the Bride Goodbye", "response": ["Factory girl Joan Dodd (Medina) and Jack Fowler (Hanley) are in love and expect to marry in due course. When Jack is called up for war service however, Joan's socially-ambitious mother (Ellen Pollock) seizes the chance to meddle in her daughter's life by encouraging the attentions of Joan's older boss Adolphus Pickering (Claud Allister), who is infatuated with her. Pickering proposes marriage, and under pressure from her mother, Joan accepts.", "* Ellen Pollock as Gladys Dodd"]}, {"page": "Night Birds (film)", "response": ["* Ellen Pollock as Flossie"]}, {"page": "The Golden Link", "response": ["* Ellen Pollock as Mme Sonia"]}, {"page": "Bedelia (film)", "response": ["* Ellen Pollock as McKelvey's Housekeeper"]}, {"page": "The Street Singer (1937 film)", "response": ["* Ellen Pollock ...  Gloria Weston "]}, {"page": "Warning to Wantons", "response": ["* Ellen Pollock as Baroness de Jammes "]}, {"page": "Don Chicago", "response": ["* Ellen Pollock as Lady Vanessa"]}, {"page": "The Hypnotist (1957 film)", "response": ["* Ellen Pollock ...  Miss Barbara Barton"]}, {"page": "It's a Bet", "response": ["* Ellen Pollock as Mrs. Joe "]}, {"page": "The Fake (1953 film)", "response": ["* Ellen Pollock - Miss Fossett"]}, {"page": "Aren't Men Beasts!", "response": ["* Ellen Pollock as Vamp"]}, {"page": "Who Killed the Cat?", "response": ["Who Killed the Cat? is a 1966 British crime film directed by Montgomery Tully and starring Mary Merrall, Ellen Pollock and Amy Dalby. It was based on the 1956 play Tabitha by Arnold Ridley and Mary Cathcart Borer.", "* Ellen Pollock - Ruth Prendergast"]}, {"page": "Master Spy", "response": ["* Ellen Pollock as Doctor Morrell "]}, {"page": "The Happy Family (1936 film)", "response": ["* Ellen Pollock - Leo Hutt"]}, {"page": "List of horror films of 1973", "response": ["| Robin Askwith, Ellen Pollock, Martin Grace "]}, {"page": "Splinters in the Air", "response": ["* Ellen Pollock as Charles' Wife  "]}, {"page": "Something in the City", "response": ["Something in the City is a 1950 British comedy film directed by Maclean Rogers and starring Richard Hearne, Garry Marsh and Ellen Pollock. It includes an early uncredited performance by Stanley Baker as a police constable.", "* Ellen Pollock as Mrs. Holley"]}, {"page": "Not So Dusty (1956 film)", "response": ["* Ellen Pollock as Agatha Lincoln"]}]}}