{"wiki_id": "http://www.wikidata.org/entity/Q5361084", "itemLabel": "Elin Jones", "itemDescription": "Welsh politician and AM (born 1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Elin_Jones", "wikipedia_page": {"main": "Elin Jones MS (born 1 September 1966), is a Welsh politician, born in Lampeter, who has represented Ceredigion for Plaid Cymru as a Member of the Senedd since 1999, and has been the Llywydd of the Senedd since 2016.\n\n", "link_mentions": [{"page": "List of Welsh people", "response": ["*Elin Jones AM (born 1966), Plaid Cymru"]}, {"page": "Plaid Cymru", "response": ["In September 2008, a senior Plaid assembly member spelled out her party's continuing support for an independent Wales. Then Welsh Minister for Rural Affairs, Elin Jones, told delegates at Plaid's annual conference in Aberystwyth that the party would continue its commitment to independence under the coalition with Welsh Labour.", "After weeks of negotiations involving all four parties in the Assembly, Plaid Cymru and Labour agreed to form a coalition government. Their agreed \"One Wales\" programme included a commitment for both parties to campaign for a Yes vote in a referendum on full law-making powers for the Assembly, to be held at a time of the Welsh Assembly Government's choosing. Ieuan Wyn Jones was subsequently confirmed as Deputy First Minister of Wales and Minister for the Economy and Transport. Rhodri Glyn Thomas was appointed Heritage Minister. He later stood down, and Alun Ffred Jones took over. Ceredigion AM Elin Jones was appointed to the Rural Affairs brief in the new 10-member cabinet. Jocelyn Davies became Deputy Minister for Housing, and later, Regeneration.", "In May 2011, Ieuan Wyn Jones announced he would stand down as leader within the first half of the Assembly term. A leadership election was held in which three candidates eventually stood: Elin Jones, Dafydd Elis-Thomas and Leanne Wood; Simon Thomas withdrew his candidacy before ballots were cast.", "On 15 March 2012, Plaid Cymru elected Leanne Wood as its new leader. She received 55% of the vote, over second-placed Elin Jones with 41%. Wood was the party's first female leader, and its first not to be a fluent Welsh speaker. Soon after her election as leader she appointed former MP Adam Price to head an economic commission for the party \"focussed on bringing together tailor-made policies in order to transform our economy\". On 1 May 2012, it was confirmed Leanne Wood would not be taking the £23,000 pay increase that every other party leader in the Assembly receives.", "| style=\"width:200px;\"| Elin Jones", "*Elin Jones, MS for Ceredigion"]}, {"page": "Senedd", "response": ["After each election, the Senedd elects one Member of the Senedd to serve as Llywydd (Presiding Officer) of the Senedd, and another to serve as Dirprwy Lywydd (Deputy Presiding Officer). Elin Jones, Plaid Cymru MS, has been Llywydd since 2016, having taken over from Rosemary Butler. The Llywydd also acts as Chair of the Senedd Commission. Both the Llywydd and the Dirprwy Lywydd typically don't vote in simple-majority votes."]}, {"page": "Cardiff University", "response": ["*Elin Jones, MS for Ceredigion, Presiding Officer of the National Assembly for Wales and Welsh Government Minister for Rural Affairs"]}, {"page": "Simon Thomas (politician)", "response": ["When a party leadership election was triggered by the resignation of Ieuan Wyn Jones, Thomas announced his candidacy on 1 December 2011. The following 6 February, he withdrew in favour of Elin Jones, running to become her deputy leader. The election was won by Leanne Wood."]}, {"page": "Ieuan Wyn Jones", "response": ["Jones reshuffled the party leadership with Jocelyn Davies as Business Manager; Elin Jones as Chief Whip and Agriculture & Rural Development spokeswoman; Phil Williams as Economic Development spokesman; and Helen Mary Jones as Environment, Transport and Planning and Equal Opportunities spokeswoman. Jones described his cabinet as \"strong... capable of taking on Labour in the Assembly as well as making a vital contribution in promoting a positive policy agenda.\""]}, {"page": "Politics of Wales", "response": ["The Senedd consists of 60 elected members. They use the title Member of the Senedd (MS) or Aelod o'r Senedd (AS). The Senedd's Llywydd, or presiding officer, is Plaid Cymru member Elin Jones."]}]}}