{"wiki_id": "http://www.wikidata.org/entity/Q5363613", "itemLabel": "Elizabeth Thomas", "itemDescription": "English poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Thomas_(poet)", "wikipedia_page": {"main": "Elizabeth Thomas (1675 – 1731) was a British poet.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Elizabeth Thomas (1675–1731, E)"]}, {"page": "1722 in literature", "response": ["*Elizabeth Thomas – Miscellany Poems on Several Subjects"]}, {"page": "1730 in literature", "response": ["*Elizabeth Thomas – The Metamorphosis of the TownVirginia Blain et al., eds. \"Thomas, Elizabeth\". The Feminist Companion to Literature in English. New Haven and London: Yale UP, 1990, pp. 1075–1076."]}, {"page": "Mary Astell", "response": ["After the death of her mother and aunt in 1688, Astell moved to Chelsea, London, where she became acquainted with a circle of literary and influential women, including Lady Mary Chudleigh, Elizabeth Thomas, Judith Drake, Elizabeth Elstob, and Lady Mary Wortley Montagu.Sowaal, Alice. \"Mary Astell\", Stanford Encyclopedia of Philosophy (2005), 16 December 2006. These helped develop and publish her work, as did William Sancroft, previously Archbishop of Canterbury. Believing himself bound by his previous oath to James II, he refused to swear allegiance to William III after the 1688 Glorious Revolution and became a Nonjuror. He provided financial support and an introduction to her future publisher; Astell later dedicated a collection of poetry to him."]}, {"page": "Oxford period poetry anthologies", "response": ["Henry Aldrich – Sir William Alexander, Earl of Stirling – Jacob Allestry – Mary Astell – William Austin – Sir Robert Ayton – William Basse – Richard Baxter – Francis Beaumont – Sir John Beaumont – Joseph Beaumont – Thomas Beedome – Aphra Behn – Edward Benlowes – Henry Bold – Anne Bradstreet – Richard Brathwait – Alexander Brome – Sir Thomas Browne – William Browne of Tavistock – John Bunyan – Robert Burton – Samuel Butler – Thomas Campian – Thomas Carew – James Carkesse – William Cartwright – Patrick Cary – Margaret Cavendish, Duchess of Newcastle – William Cavendish, Duke of Newcastle – John Chalkhill – William Chamberlayne – George Chapman – John Cleveland – John Collop – Richard Corbett – Charles Cotton – Abraham Cowley – Richard Crashaw – Hugh Crompton – John Cutts, Lord Cutts – Alicia D'Anvers – Thomas D'Urfey – John Dancer – George Daniel – Samuel Daniel – Sir William Davenant – Robert Davenport – Thomas Dekker – Sir John Denham – John Digby, Earl of Bristol – John Donne – Michael Drayton – William Drummond of Hawthornden – John Dryden – Richard Duke – 'Ephelia' – Sir George Etherege – Mary Evelyn – Thomas Fairfax, Lord Fairfax – Mildmay Fane, Earl of Westmorland – Sir Richard Fanshawe – Henry Farley – George Farquhar – Owen Feltham – Anne Finch, Countess of Winchilsea – Thomas Flatman – Richard Flecknoe – Giles Fletcher – John Fletcher – Phineas Fletcher – John Ford – Simon Ford – Thomas Forde – Sidney Godolphin – James Graham, Marquis of Montrose – Fulke Greville, Lord Brooke – William Habington – Henry Hall – John Hall – Henry Halswell – William Hammond – Samuel Harding – Sir John Harington – Christopher Harvey – Sir R. Hatton – Robert Hayman – Robert Heath – Edward Herbert, Lord Herbert of Cherbury – George Herbert – Robert Herrick – Thomas Heyrick – Thomas Heywood – N. Hookes – John Hoskyns – Anne Howard – Sir Robert Howard – James Howell – Sir Francis Hubert – Lucy Hutchinson – Thomas James – Ben Jonson – Thomas Ken – Anne Killigrew – Thomas Killigrew – King James VI and I – Henry King – Ralph Knevet – Sir Francis Kynaston – Sir Roger L'Estrange – Emilia Lanier – Richard Leigh – Martin Lluelyn – Richard Lovelace – Andrew Marvell – Thomas Middleton – John Milton – Mary Mollineux – Henry More – Thomas Morton – Pierre Antoine Motteux – Nicholas Murford – Thomas Nabbes – John Norris – Dudley North, Lord North – John Oldham – Philip Pain – Clement Paman – Martin Parker – Francis Daniel Pastorius – Thomas Philipott – Katherine Philips – Alexander Pope – Walter Pope – Samuel Pordage – Edmund Prestwich – Laurence Price – Francis Quarles – Alexander Radcliffe – Thomas Randolph – Edward Ravenscroft – Eldred Revett – Henry Reynolds – Samuel Rowlands – Joseph Rutter – Charles Sackville, Earl of Dorset – George Sandys – Sir Charles Sedley – William Shakespeare – Sir Edward Sherburne – Thomas Shipman – James Shirley – Thomas Southerne – Thomas Stanley – Matthew Stevenson – Sir John Stradling – William Strode – Sir John Suckling – Joshua Sylvester – Lady Elizabeth Tanfield – Nahum Tate – John Tatham – Edward Taylor – John Taylor – Elizabeth Thomas – Elizabeth Tipper – Benjamin Tompson – Aurelian Townsend – Thomas Traherne – Henry Vaughan – George Villiers, Duke of Buckingham – Luke Wadding – Edmund Waller – Rowland Watkyns – John Webster – Anne Wharton – Robert Wild – Roger Williams – Humphrey Willis – John Wilmot, Earl of Rochester – Gerrard Winstanley – George Wither – William Wood – Sir Henry Wotton – James Wright – Lady Mary Wroth"]}, {"page": "Elizabeth Thomas", "response": ["Elizabeth Thomas may refer to:", "*Elizabeth Thomas (poet) (1675–1731), British poet", "*Elizabeth Thomas (poet/novelist) (1770/1–1855), British novelist and poet", "*Elizabeth Thomas (Egyptologist) (1907–1986), American Egyptologist", "*Elizabeth Caruthers (died 1857), American pioneer settler who sometimes identified as Elizabeth Thomas"]}, {"page": "Mary Chudleigh", "response": ["Mary Chudleigh, Lady Chudleigh (August 1656–1710) was an English poet who belonged to an intellectual circle that included Mary Astell, Elizabeth Thomas, Judith Drake, Elizabeth Elstob, Lady Mary Wortley Montagu, and John Norris. In her later years she published a volume of poetry and two volumes of essays, all dealing with feminist themes. Two of her books were published in four editions during the last ten years of her life. Her poetry on the subject of human relationships and reactions has appeared in several anthologies. Her feminist essays are still in print.Sandra M. Gilbert and Susan Gubar, \"Lady Mary Chudleigh.\" The Norton Anthology of Literature by Women: The Traditions in English, New York: W. W. Norton, 1996, p. 161.", "*Elizabeth Thomas, Pylades and Corinna (London, 1731)"]}, {"page": "Judith Drake", "response": ["Judith Drake (fl. 1670s–1723) was an English intellectual and author who was active in the last decade of the 17th century. She was part of a circle of intellectuals, authors, and philosophers which included Mary Astell, Lady Mary Chudleigh, Elizabeth Thomas, Elizabeth Elstob, Lady Mary Wortley Montagu, and John Norris.Sowaal, Alice. \"Mary Astell.\" Stanford Encyclopedia of Philosophy. (2005) 16 December 2006 <http://plato.stanford.edu/entries/astell/>. She was married to James Drake F.R.S., physician and Tory pamphleteer. She is remembered in the field of feminist literature for her 1696 essay, An Essay in Defence of the Female Sex.Smith, Hannah. \"Abstract: English 'Feminist' Writings and Judith Drake's An Essay in Defence of the Female Sex (1696).\" The Historical Journal. Cambridge University Press, 2001. 18 December 2006 <http://journals.cambridge.org/action/displayAbstract?fromPage=online&aid=85583>."]}, {"page": "1731 in poetry", "response": ["* February 3 – Elizabeth Thomas (born 1675), English poet"]}, {"page": "1730 in poetry", "response": ["* Elizabeth Thomas, The Metamorphosis of the Town; or, A View of the Present Fashions, published anonymously* \"Scriblerus Tertius\" a pen name, possibly of Thomas Cooke, The Candidates for the Bays"]}, {"page": "1722 in poetry", "response": ["* Elizabeth Thomas, Miscellany Poems on Several Subjects, published anonymously"]}, {"page": "Elizabeth Thomas (Poet)", "response": ["#REDIRECT Elizabeth Thomas (poet) "]}, {"page": "Thomas (surname)", "response": ["*Elizabeth Thomas (disambiguation), multiple people", "**Elizabeth Thomas (poet) (1675–1731), British poet", "**Elizabeth Thomas (poet/novelist) (1770/1–1855), British novelist and poet", "**Elizabeth Thomas (Egyptologist) (1907–1986), American Egyptologist"]}, {"page": "1675 in poetry", "response": ["* August 31 – Elizabeth Thomas (died 1731), English poet"]}, {"page": "Richard Gwinnett", "response": ["Gwinnett was the son of George Gwinnett of Shurdington, Gloucestershire. He was a pupil of Francis Gastrell at Christ Church, Oxford. He remained there some seven years, when he proceeded to London, and took rooms in the Temple, although he was in no way connected with the legal profession. While in London he became engaged to Elizabeth Thomas, well known as Dryden's 'Corinna,' but owing to his consumptive tendencies the marriage was postponed, and he withdrew to his father's residence in Gloucestershire. During the next sixteen years (1700–16) much correspondence passed between the lovers, Mrs. Thomas writing as 'Corinna,' Gwinnett as 'Pylades.' Their letters were subsequently published in two volumes entitled 'Pylades and Corinna; or memoirs of the lives, amours, and writings of R. G. and Mrs. E. Thomas, jun.... containing the letters and other miscellaneous pieces in prose and verse, which passed between them during a Courtship of above sixteen years ... Published from their original manuscripts (by Philalethes) ... To which is prefixed the life of Corinna, written by herself.' In 1716, on the death of his father, Gwinnett returned to London to press his suit, but the wedding was again deferred owing to the illness of the lady's mother. Early in the following spring Gwinnett suffered a relapse, and died on 16 April 1717.", "He was the author of a play entitled 'The Country Squire, or a Christmas Gambol,' first published in the second volume of 'Pylades and Corinna,' the collected correspondence of Gwinnett and Elizabeth Thomas, London, 1732. Another edition of the play appeared in 1734. Portraits of Gwinnett were engraved by Van der Gucht and G. King for the 'Pylades and Corinna' volumes."]}, {"page": "Corina (disambiguation)", "response": ["* Corinna, pen name of English poet Elizabeth Thomas (1675–1731)"]}, {"page": "Charles Dryden (English writer)", "response": ["John Dryden, who was a believer in astrology, calculated his son's horoscope, and on the strength of it prophesied in 1697 that he would soon recover his health, injured by a fall at Rome. \"Corinna\" (Elizabeth Thomas) constructed an elaborate fiction upon this basis, showing that Dryden had foretold three periods of danger to his son; at one of which Charles fell from a (non-existent) tower of the Vatican five stories high and was \"mashed to a mummy\" for the time. cites Wilson, Life of Congreve. Malone reprints this narrative, cites Malone Life of Dryden vol. ?, pp. 404–420. which is only worth notice from the use made of it in Sir Walter Scott's Guy Mannering."]}, {"page": "Corinna (given name)", "response": ["*Corinna, pen name of English poet Elizabeth Thomas (1675–1731)"]}]}}