{"wiki_id": "http://www.wikidata.org/entity/Q5361141", "itemLabel": "Elinor Darwin", "itemDescription": "Irish born illustrator, engraver and portrait painter (1871-1954)", "wikipedia_url": "https://en.wikipedia.org/wiki/Elinor_Darwin", "wikipedia_page": {"main": "Elinor Mary Darwin (née Monsell; 1879–1954) was an Irish born illustrator, engraver and portrait painter. Her illustrations were included in several of her husband, Bernard Darwin's books for children.", "link_mentions": [{"page": "1871 in art", "response": ["* May ? – Elinor Darwin, née Monsell, Irish-born engraver and portrait painter (died 1954)"]}, {"page": "1954 in Ireland", "response": ["*2 May – Elinor Darwin, engraver and portrait painter (born 1871)."]}, {"page": "Elinor Monsell", "response": ["#REDIRECT Elinor Darwin"]}, {"page": "Elinor Mary Darwin", "response": ["#REDIRECT Elinor Darwin"]}, {"page": "Elinor Mary Monsell", "response": ["#REDIRECT Elinor Darwin"]}, {"page": "John Samuel Bewley Monsell", "response": ["He married Anne, daughter of Bolton Waller, of Shannon Grove and Castletown on 15 January 1835. Their eldest son, Thomas, died on the way to the Crimean War in 1855, aged 18, in a shipwreck off Italy; their eldest daughter Elizabeth Isabella died in Torquay at the age of 28 in 1861. Another daughter, Jane Diana, married the Rev. C. W. Furse in 1859. Through his son William Thomas Monsell, a magistrate and inspector of facturers, Monsell was grandfather to the artist Elinor Darwin (née Monsell).Lodge's Peerage, Baronetage, Knightage and Companionage of the British Empire, John Lodge, 1907, p. 707The New Extinct Peerage 1884-1971 Containing Extinct, Abeyant, Dormant and Suspended Peerages with Genealogies and Arms, L. G. Pine, Heraldry Today, London, 1972, p. 115Burke's Peerage and Baronetage, 107th ed., 2003, vol. 2, p. 2038"]}, {"page": "1871 in Ireland", "response": ["*? May – Elinor Darwin, née Monsell, engraver and portrait painter (died 1954 in England)."]}, {"page": "List of 20th-century women artists", "response": ["*Elinor Darwin (1871–1954), engraver, portrait painter"]}, {"page": "Darwin (surname)", "response": ["**Elinor Darwin (1871–1954), illustrator, engraver and portrait painter, wife of Bernard Darwin", "**Ursula Frances Elinor Darwin, birth name of Ursula Mommens (1908–2010), potter"]}, {"page": "Hope Bagenal", "response": ["He resumed his architectural career in 1917 and moved into Leaside, a cottage in the Lea Valley, with his extended family in a house partly dating back to early 1800s, surrounded by ancient woodland. The house in due course became a refuge and meeting place for numerous visitors, from explorers (Sandy Wollaston) to musicians (Toni and Rosi Grunschlag), from psychiatrists (John Layard and Donald Winnicott) to artists (Elinor Darwin and Margaret Calkin James), all held captive by the genius loci of the valley and the warmth and hospitality of the family who lived there."]}, {"page": "List of Irish painters", "response": ["* Elinor Darwin (1871–1954)"]}, {"page": "List of Irish women artists", "response": ["*Elinor Darwin (1879–1954), illustrator, engraver, portrait painter"]}]}}