{"wiki_id": "http://www.wikidata.org/entity/Q5363270", "itemLabel": "Elizabeth Norton", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Norton", "wikipedia_page": {"main": "Elizabeth Norton is a British historian specialising in the queens of England and the Tudor period. She obtained a Master of Arts in archaeology and anthropology from the University of Cambridge, being awarded a Double First Class degree, and a master's degree in European archaeology from the University of Oxford. She is the author of thirteen non-fiction books.", "link_mentions": [{"page": "Jane Seymour", "response": ["*Is the title character of Jane Seymour: Henry VIII's True Love by Elizabeth Norton."]}, {"page": "Anne of Cleves", "response": ["Anne is the subject of several biographies: Julia Hamilton's Anne of Cleves (1972), and Mary Saaler's Anne of Cleves: Fourth Wife of Henry VIII (1995), Elizabeth Norton's Anne of Cleves: Henry VIII's Discarded Bride (2009), and Heather Darsie's Anna, Duchess of Cleves: The King's Beloved Sister (2019). Retha Warnicke has written an academic study on Anne's marriage called The Marrying of Anne of Cleves. Royal Protocol in Early Modern England (2000)."]}, {"page": "Hanworth", "response": ["*Elizabeth I, who lived there in the 1540s in the household of her stepmother, Catherine Parr, the sixth wife of Henry VIII, and Catherine's fourth husband, Thomas Seymour.Elizabeth Norton, The Temptation of Elizabeth Tudor, 2015, St Ives: Head of Zeus Ltd."]}, {"page": "Surbiton", "response": ["* Elizabeth Norton – historian and author"]}, {"page": "University Challenge", "response": ["|Hertford College, Oxford (Soweto Kinch, Elizabeth Norton, Adam Fleming, Isabelle Westbury)"]}, {"page": "Murray Edwards College, Cambridge", "response": ["* Elizabeth Norton, writer and historian"]}, {"page": "Steyning", "response": ["*Elizabeth Norton, historian and author, grew up in Steyning and was educated at Steyning Grammar School"]}, {"page": "Steyning Grammar School", "response": ["*Elizabeth Norton, historian"]}, {"page": "Geoffrey Boleyn", "response": ["Geoffrey Boleyn's father was an elder Geoffrey Boleyn (died 1440), of Salle in Norfolk, son of Thomas Boleyn (died 1411) of Salle and his wife Agnes.The Boleyn Women, Elizabeth Norton (Stroud: Amberley, 2013) here. His mother Alice, whose arms he quartered with those of Boleyn, was daughter and heiress of Sir John Bracton of Norfolk. Geoffrey and Alice Boleyn of Salle are commemorated by a monumental brass in Salle Church, which shows the two figures frontally, standing, set side by side, with a memorial inscription beneath (referring also to their children) and a scroll flying between them with a Latin prayer, \"God be merciful to us sinners\".\"Deus propicius esto nobis peccatoribus\": S. Badham, 'Geoffrey Boleyn, 1440, and wife Alice, Salle, Norfolk' Monumental Brass Society, Brass of the Month, May 2011. Around 1730 Thomas Martin of Palgrave saw two subsidiary brass groups in the slab showing their five sons and their four daughters: these have long been missing.W.L.E. Parsons, Salle, The Story of a Norfolk Parish, its Church, Manors and People, (Jarrold & Sons Ltd., Norwich 1937), p.42.F. Blomefield, An Essay Towards a Topographical History of the County of Norfolk VIII (William Miller, London 1808), p.275.", "Historian Elizabeth Norton describes the Geoffrey Boleyn who died in 1440 as their great-uncle.E. Norton, The Boleyn Women (Amberley Publishing 2013), chapter 1."]}, {"page": "Mistresses of Henry VIII", "response": ["Kelly Hart's study The Mistresses of Henry VIII was published in 2009.  In 2010, Mary Boleyn: The True Story of Henry VIII's Favourite Mistress by Josephine Wilkinson was published, and in 2012, Alison Weir published Mary Boleyn: The Great and Infamous Whore. In 2013, this was followed by Bessie Blount: Mistress to Henry VIII by Elizabeth Norton."]}, {"page": "Boleyn family", "response": ["*Elizabeth Norton, The Boleyn Women"]}, {"page": "George Wyatt (writer)", "response": ["Sir George Wyatt (1553–1624) from Allington CastleSir George Wyatt Retrieved 24/4/21. was an English sixteenth-century writer and politician. He was the first biographer of Henry VIII's second queen, Anne Boleyn.p.22, Elizabeth Norton, Jane Seymour:Henry VIII's True Love His grandfather Sir Thomas Wyatt the Elder, was a famous poet, as well as a cousin and early admirer of Anne's."]}, {"page": "Richard Roose", "response": ["Elizabeth Norton argues that while Boleyn \"was no murderess\", the case of the poisoned pottage is indicative of her unpopularity, \"that anything could be believed of her\"."]}, {"page": "Dead Man's Plack", "response": ["Elizabeth Norton, a historian specialising in the queens of England, concludes that \"the evidence certainly does not suggest that [Æthelwald] was murdered\" and that the story related by William of Malmesbury is \"a later elaboration\" of the reason behind Ælfthryth's foundation of nearby Wherwell Abbey, \"which was popularly considered to have been carried out as an act of atonement.\""]}, {"page": "John Fowler (by 1520 – c. 1575)", "response": ["He was a Member of Parliament (MP) for New Shoreham in March 1553, Hythe in 1555, Winchelsea in 1558, Weymouth in 1559, and  West Looe in 1563. Fowler was heavily involved in helping Thomas Seymour, 1st Baron Seymour of Sudeley attempt to influence Seymour's nephew, Edward VI of England, as Fowler was a Groom of the Privy Chamber to the boy king.p.126, Elizabeth Norton, The Temptation of Elizabeth Tudor, 2015: Head of Zeus Ltd."]}, {"page": "List of alumni of Hertford College, Oxford", "response": ["* Elizabeth Norton, historian and author"]}, {"page": "Lancelot de Carle", "response": ["Thirteen extant copies remain of Lancelot de Carle's poem: two printed versions and eleven manuscripts. They are held in the British Library, the Royal Library of Belgium, the Bibliothèque nationale de France and departmental archives in Bordeaux, Soissons and Valenciennes. Although the two printed copies are identical, none of the manuscripts precisely matches any of the others. The history of some of the versions remains unclear; no documentary evidence establishes that any of them is Carle's original. Georges Ascoli, a French literary scholar, examined most of the extant versions of the poem in 1920, and selected one that he believed closest to Carle's original. Ascoli included a transcript of the manuscript version in the Bibliothèque Nationale known as f. fr. 12795. The transcript in Georges Ascoli's La Grande-Bretagne Devant l'Opinion Française, Depuis la Guerre de Cent Ans Jusqu'à la Fin du XVIe siècle includes a line-by-line listing of all the variations between f. fr. 12795 and the other versions, along with some explanatory notes. There is a complete English translation of Lancelot de Carle's poem in Susan Walters Schmid's Anne Boleyn, Lancelot de Carle, and the Uses of Documentary Evidence. An English summary of the poem can be found among the Letters and Papers of the Reign of Henry VIII and in Elizabeth Norton's Anne Boleyn: In Her Own Words & the Words of Those Who Knew Her."]}, {"page": "Claire Ridgway", "response": ["Through her website, Ridgway was involved in running historical tours through her company History Tours of Britain. The first tour was in 2010, with subsequent tours until 2012. These tours were based around Hever Castle in Kent, with notable guest speakers such as Eric Ives, John Guy, Julia Fox and Elizabeth Norton. The company was closed due to Ridgway wanting to focus on her writing.UK Company No. 07576296"]}, {"page": "Christmas University Challenge", "response": ["The 2021 series was won by the University of Edinburgh whose team of Catherine Slessor, Thomasina Miers, Miles Jupp and Phil Swanson beat Hertford College, Oxford and their team of Soweto Kinch, Elizabeth Norton, Adam Fleming and Isabelle Westbury."]}, {"page": "Norton, Elizabeth", "response": ["#redirectElizabeth Norton"]}, {"page": "Elizabeth Norton (artist)", "response": ["The Pacific Art League of Palo Alto has dedicated a solo-exhibition gallery in her name, the \"Elizabeth Norton studio\" and the \"Elizabeth Norton Distinguished Service Award\"."]}, {"page": "List of people from Sussex", "response": ["* Elizabeth Norton (born 1986)"]}, {"page": "University Challenge 2021–22", "response": ["The winning University of Edinburgh team consisted of Catherine Slessor, Thomasina Miers, Miles Jupp and Phil Swanson. The second placed Hertford College team consisted of Soweto Kinch, Elizabeth Norton, Adam Fleming and Isabelle Westbury."]}, {"page": "A Godly Meditation of the Soul", "response": ["A Godly Meditation of the Soul was a book by Marguerite of Angouleme, translated by Elizabeth I of England.Elizabeth Norton, 2015, The Temptation of Elizabeth Tudor, St. Ives: Head of Zeus Ltd."]}]}}