{"wiki_id": "http://www.wikidata.org/entity/Q5367639", "itemLabel": "Elsie Wagstaff", "itemDescription": "British actress (1899-1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/Elsie_Wagstaff", "wikipedia_page": {"main": "Elsie Wagstaff (1 July 1899 –  16 July 1985) was an English actress. Educated at the Guildhall School of Music, her stage work began in the chorus in 1919, and one of her first leading roles was as Sadie Thompson in an adaptation of Somerset Maugham's Rain. In 1928, she appeared on Broadway in John Van Druten's Diversion, and in Arnold Ridley and Bernard Merivale's The Wrecker. She also worked sporadically in films, and with some regularity on television.", "link_mentions": [{"page": "1985 in film", "response": ["| style=\"text-align:center;\"| 1 || Elsie Wagstaff || style=\"text-align:center;\"| 86 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actress || style=\"text-align:left;\"| "]}, {"page": "Heavens Above!", "response": ["* Elsie Wagstaff Lady on Parish Council"]}, {"page": "Frankenstein and the Monster from Hell", "response": ["* Elsie Wagstaff as Wild one"]}, {"page": "Barnacle Bill (1957 film)", "response": ["*Elsie Wagstaff as Mrs Gray"]}, {"page": "Crimes at the Dark House", "response": ["*Elsie Wagstaff as Mrs. Catherick"]}, {"page": "Whistle Down the Wind (film)", "response": ["* Elsie Wagstaff as Auntie Dorothy"]}, {"page": "Saturday Night and Sunday Morning (film)", "response": ["* Elsie Wagstaff as Mrs Seaton "]}, {"page": "The Dark Tower (1943 film)", "response": ["* Elsie Wagstaff as Eve"]}, {"page": "Eight O'Clock Walk", "response": ["* Elsie Wagstaff as Mrs Peskitt"]}, {"page": "Appointment with Crime", "response": ["*Elsie Wagstaff as Mrs. Wilkins  "]}, {"page": "The Balloon Goes Up", "response": ["The Balloon Goes Up is a 1942 British, black-and-white, comedy, musical, war film, directed by Redd Davis and starring Ronald Shiner, Ethel Revnell, Gracie West, Donald Peers and Elsie Wagstaff.BFI.org It was produced by New Realm Pictures."]}, {"page": "The Snake Woman", "response": ["In the tiny Northumbrian village of Bellingham in 1890, herpetologist Dr. Horace Adderson (John Cazabon) has successfully been keeping his wife Martha's (Dorothy Frere) unnamed mental illness under control by regularly injecting her with snake venom. When Martha dies giving birth to their daughter, local midwife Addie Harker (Elsie Wagstaff), who villagers believe is a witch, proclaims that the baby - who doesn't blink and is cold to the touch - is pure evil, the 'devil's offspring' and must be destroyed. She is stopped before she can stab the new-born with scissors. But she runs to the local pub and an angry mob follow her to Adderson's laboratory and set it and his house ablaze. Just before they arrive, Dr. Murton (Arnold Marlé), who delivered the baby, saves her by giving her to a sympathetic local shepherd (Stevenson Lang) to watch her for the night. Murton does not know that Adderson was killed by a snakebite as his lab burned and believes that Adderson will return for the child in the morning. Murton then leaves Bellingham for an extended period of research in Africa.", "* Elsie Wagstaff as Aggie Harker  "]}, {"page": "Meet Sexton Blake!", "response": ["* Elsie Wagstaff as Mrs Baird"]}, {"page": "The Golden Link", "response": ["* Elsie Wagstaff as Mrs West"]}, {"page": "John Halifax (film)", "response": ["* Elsie Wagstaff as Jael"]}, {"page": "Old Mother Riley at Home", "response": ["* Elsie Wagstaff - Mrs. Ginochie"]}, {"page": "The Woman in White (1966 TV series)", "response": ["* Elsie Wagstaff as Mrs. Clements"]}, {"page": "You Pay Your Money", "response": ["* Elsie Wagstaff as Ada Seymour "]}, {"page": "Lassie from Lancashire", "response": ["Struggling young actress Jenny (Marjorie Browne) joins her dad (Mark Daly) when he moves into Aunt Hetty's (Elsie Wagstaff) boarding house. Aunt Hetty overworks them, but Jenny is lucky enough to find love in the form of aspiring songwriter Tom (Hal Thompson). But their romance is threatened and nearly destroyed by Margie (Marjorie Sandford), the jealous star actress of the local pierrot troupe. However, the young lovers move on to bigger and better things after winning a London West End theatre contract.", "* Elsie Wagstaff as Aunt Hetty  "]}, {"page": "Celia (1949 film)", "response": ["* Elsie Wagstaff as Aunt Nora  "]}, {"page": "Frankenstein (Hammer film series)", "response": ["| style=\"text-align:center;\"| Elsie Wagstaff"]}, {"page": "Great Expectations (1967 TV series)", "response": ["* Elsie Wagstaff as Sarah Pocket"]}, {"page": "Mary Britten, M.D.", "response": ["Actors who appeared in individual episodes of the series include Peter Vaughan, Richard O'Sullivan, Irene Handl, Elsie Wagstaff, Frazer Hines and Neil Hallett."]}, {"page": "Charlesworth at Large", "response": ["* Elsie Wagstaff as Mrs. Pawson"]}, {"page": "Deadline Midnight (TV series)", "response": ["A large number of other actors appeared in episodes of the show including Michael Caine, Derek Farr, Harry H. Corbett, Sarah Miles, Nanette Newman, Sydney Tafler, Valerie White, Alethea Charlton, Nyree Dawn Porter, Jane Merrow, George Coulouris, Claire Gordon, Kenneth Cope, Richard Pearson, Dilys Laye, Ronald Lacey, Larry Martyn, Warren Mitchell, Frank Pettingell, Esmond Knight, John Welsh, Michael Robbins, Pamela Brown, Meredith Edwards, Billy Milton, Reginald Marsh, George Woodbridge, Peter Illing, John Ringham, William Kendall, Stratford Johns, John Barrie, Richard Vernon, John Barron, Anthony Sharp, Wensley Pithey, Bernard Archard, Patricia Burke, Bernard Kay, Derek Newark, Timothy West, Frederick Jaeger, Charles Lloyd Pack, Rita Webb, John Arnatt, Neil Hallett, Derek Francis, Arthur Brough, Elsie Wagstaff, Tenniel Evans, Carmen Silvera, Patrick Newell, Desmond Llewelyn, Jennifer Hilary, Allan Cuthbertson, Lloyd Lamble, David Hemmings and James Beck."]}, {"page": "Mary Barton (TV series)", "response": ["* Elsie Wagstaff as Aunt Alice"]}]}}