{"wiki_id": "http://www.wikidata.org/entity/Q5363013", "itemLabel": "Elizabeth Inverarity", "itemDescription": "opera singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Inverarity", "wikipedia_page": {"main": "Elizabeth Inverarity, later \"Mrs. Charles T. Martyn\" (born Edinburgh, 23 March 1813; died Newcastle-on-Tyne, 27 December 1846), was a Scottish opera soprano, popular singer and actress of the early 19th century, in England and in America. She also composed some ballads with her husband Charles Martyn, a bass from Bristol.\nThe daughter of James Inverarity, an Edinburgh merchant, and his wife Helen (McLagan), Inverarity began her career in Edinburgh as a singer of Scottish ballads. After early studies with a Mr. Thorne of the Theatre Royal, Edinburgh, she became in 1829 a student of Alexander Murray, a singing teacher and prominent violinist. He introduced her to the public at the Assembly Rooms in April of that year. Murray arranged her appearances in a series of concerts in Edinburgh in 1830, and in autumn of that year persuaded her family that she should travel to Italy for further vocal training. When she reached London, however, she was introduced to Sir George Smart, a prominent conductor and vocal instructor, and decided to study with him.She debuted at Covent Garden in Rossini's Cinderella (14 December 1830) and also appeared in Spohr's \"Azor and Zemira\" (1831), Meyerbeer's \"Robert le diable\" (1832), and Rossini's The Maid of Judah (1832), among other productions.\nAfter her marriage in 1834, she and her husband continued to perform, in England, Scotland, and America for a number of years. They were joined at times by her sister Barbara. In 1839 the Martyns were brought to New York by theater manager Edmund Simpson and premiered Beethoven's Fidelio at the Park Theater. They later became music teachers in Newcastle. She is buried in Jesmond Old Cemetery in Newcastle, in the same plot as her sister Barbara, who had died in 1845.\nShe was a grandniece of the Scottish poet Robert Fergusson.An engraving (by John Henry Robinson) of her exists, from a portrait by Alfred Edward Chalon. The portrait was exhibited at the Royal Academy in 1839. Another engraving was by William Sharp from a portrait by William Booth.", "link_mentions": {}}}