{"wiki_id": "http://www.wikidata.org/entity/Q5360293", "itemLabel": "Eli Marsden Wilson", "itemDescription": "English artist (1877-1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eli_Marsden_Wilson", "wikipedia_page": {"main": "Eli Marsden Wilson, A.R.E., A.R.C.E. (24 June 1877 – 13 November 1965) was an English artist who had 17 pictures exhibited at the Royal Academy.\nHe was born in Ossett, Yorkshire, the only son of Alfred Wilson, a foreman beamer, and Emma Marsden, and had five sisters.After studying at Wakefield College of Art, he moved to the Royal College of Art in London, where he became a pupil of Sir Frank Short. The first picture Wilson exhibited at the R.A. in 1905 was an etching of Ossett Market as it was in Victorian times. In London he lived in Chelsea, then Acton. Also in 1905, he married Hilda Mary Pemberton (born 1871), the daughter of civil engineer Frederick Blake Pemberton and his wife Lucy.A Quaker, vegetarian, and pacifist, he was a conscientious objector in World War I and as such was imprisoned in 1917 for two years.In September 1922 he was commissioned by Princess Marie Louise to produce miniature etchings for Queen Mary's Dolls' House, at Windsor Castle. In November 2012 some of the etchings were shown on the BBC programme 'Antiques Roadshow', by his brother's great-grandson and great-great-granddaughters.His late-1920s painted freeze, made of four panels, showing prehistoric England, can be seen in the Geological section of the Natural History Museum in South Kensington. The museum also holds his oil paintings, \"Scene in Wealden Times\" and two versions of \"Nant Ffrancon Valley, North Wales\".He and Hilda moved to a cottage in Blewbury, Berkshire (now in Oxfordshire). Hilda died in 1957 and Wilson's pupil, Mary Cockburn, subsequently became his live-in companion. He died at his home, 9 Faraday Road, Acton, London, in November 1965, and was cremated at Mortlake, London, on 19 November.Wilson was elected an Associate of the Royal Society of Painters, Etchers and Engravers (A.R.E.) in 1907, and served as Chairman of the Ealing Art Group from 1935 to 1947.", "link_mentions": [{"page": "Ossett", "response": ["* Eli Marsden Wilson, A.R.E., A.R.C.E. (1877–1965) was a successful Ossett-born artist who had seventeen pictures exhibited at the Royal Academy. After studying at Wakefield College of Art, he moved to the Royal College of Art in London where he became a pupil of Sir Frank Short. The first picture Wilson exhibited at the R.A. in 1905 was an etching of Ossett Market as it was in Victorian times. There is a copy of \"Ossett Market\" by E. M. Wilson on display in Wakefield Art Gallery."]}, {"page": "Queen Mary's Dolls' House", "response": ["Painters, including Eli Marsden Wilson, Edith Mary Hinchley and Gladys Kathleen Bell, also provided miniature pictures. Two pen-and-ink drawings by G. Howell-Baker were supplied by his sister, who wrote to say that he had recently died when the request for his contribution arrived from the palace."]}, {"page": "Blewbury", "response": ["In the 20th century the village attracted a number of notable artists and writers. Writers have included Elizabeth Ferrars, Alt URL Dick Francis (from 1954 to 1980), Kenneth Grahame, Marguerite Steen,\"Who Was Who: 1971–1980\", London, A. & C. Black GB Stern, Barbara Euphan Todd and Ben Fergusson.  Artists have included William Nicholson,Sophie Bowness (2004). Nicholson, Sir William Newzam Prior (1872–1949). Oxford Dictionary of National Biography (online edition). Oxford University Press. . father of abstract painter Ben Nicholson, illustrator Susan Beatrice « Twissie » Pearse children's book illustrator, including Amelia Anne series, H Davis Richter known for much-reproduced interiors and Eli Marsden Wilson. The tradition continues, and keen amateur artists receive direction from the professional artists Roy East and Ron Freeborn. The village used to have an art gallery devoted to the work of local artists."]}, {"page": "Frank Short", "response": ["As head of the Engraving School at the Royal College of Art, South Kensington from 1892 to 1920 and the inaugural Professor of Engraving from 1920 to 1924, Short had enormous influence on younger painter-etchers and engravers, including Myra Kathleen Hughes RE, Percival Gaskell RE, Margaret Kemp-Welch RE, Martin Hardin RE, Job Nixon RE, Robert Austin RA, PPRE, Mary Annie Sloane, ARE, Malcolm Osborne RA, PPRE, Henry Rushbury RA, RE, Dorothy Woollard RE, Frederick Griggs RA, RE, Stanley Anderson RA, RE, Constance Mary Pott, and Eli Marsden Wilson ARE amongst many others. [3] It is well recorded that Short was an outstanding and inspirational teacher."]}, {"page": "Royal Society of Painter-Printmakers", "response": ["Notable members (and their date of election to a full fellowship) included: Mary Nimmo Moran (1881), William Strang (1881), Joseph Pennell (1882), Auguste Rodin (1882), Charles William Sherborn (1884), Herbert Dicksee (1885), Walter Sickert (1887), Sir David Young Cameron (1895), Margaret Kemp-Welch (1901), Sir Frank Brangwyn (1903), Anna Airy (1908), Eugène Béjot (1908), Ernest Stephen Lumsden (1915), William Walcot (1920), Edmund Blampied (1921), Gerald Brockhurst (1921), Robert Austin (1927), Dame Laura Knight (1932), Sir William Russell Flint (1933), Charles Tunnicliffe (1934), Geoffrey Wedgwood (1934), Joan Hassall (1948), James T.A. Osborne (1957), Gwenda Morgan (1962), and Robert Tavener (1966).  Others were elected as an Associate but did not achieve the full fellowship, such as Eli Marsden Wilson (1907), John Nicolson (1923) and Salomon van Abbé (1923)."]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Eli Marsden Wilson"]}]}}