{"wiki_id": "http://www.wikidata.org/entity/Q5362670", "itemLabel": "Liz Dawn", "itemDescription": "English actress (1939-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Liz_Dawn", "wikipedia_page": {"main": "Sylvia Ann Ibbetson  (née Butterfield; 8 November 1939 – 25 September 2017), known professionally as Elizabeth Dawn or Liz Dawn, was an English actress, best known for her role as Vera Duckworth in the long-running British soap opera Coronation Street. First starting on the serial in 1974, she had a recurring role as a factory worker until her husband, Jack, (played by Bill Tarmey) first appeared in 1979. She played the character of Vera for 34 years. For her role in the soap, she received the Lifetime Achievement Award at the 2008 British Soap Awards. She was appointed an MBE in the 2000 Queens Birthday Honours.", "link_mentions": [{"page": "Coronation Street", "response": ["The show's production team was tested when many core cast members left the programme in the early 1970s. When Arthur Leslie died suddenly in 1970, his character, Rovers landlord Jack Walker, died off screen shortly afterwards.Little. (2000) p.67. Anne Reid quit as Valerie Barlow; her character was killed off in 1971, electrocuting herself with a faulty hairdryer. Ratings reached a low of eight million in February 1973, when Pat Phoenix quit as Elsie Tanner and Doris Speed (Annie Walker) took two months' leave due to bereavement.Little. (2000) p.86. The audience of ITV's other flagship soap opera Crossroads increased markedly at this time, as its established cast, such as Meg Richardson (Noele Gordon), grew in popularity. These sudden departures forced the writing team to quickly develop characters who had previously stood in the background. The roles of mostly younger characters including Bet Lynch (Julie Goodyear), Deirdre Hunt (Anne Kirkbride), Rita Littlewood (Barbara Knox), Mavis Riley (Thelma Barlow) and Ivy Tildsley (Lynne Perrie) were built up between 1972 and 1973 (with Perrie's character being renamed to the better-known \"Tilsley\"), and characters such as Gail Potter (Helen Worth), Blanche Hunt (Patricia Cutts/Maggie Jones), and Vera Duckworth (Liz Dawn) first appearing in 1974. These characters would remain at the centre of the programme for many years, with Gail still being in the show nearly half a century after her first appearance.Little. (2000) p.93.Little. (2000) p.79. Comic storylines had been popular in the series in the 1960s but had become sparse during the early 1970s. These were re-introduced by new producer Bill Podmore who joined the series in 1976. He had worked on Granada comedy productions prior to his appointment.Little. (2000) p.107. ", "In July 2002, Gail married Richard Hillman (Brian Capron), a recently-introduced financial advisor who had already left Duggie Ferguson (John Bowe) to die after he fell down a set of ladders during an argument, and murdered his ex-wife Patricia (Annabelle Apsion), before going on to kill neighbour Maxine Peacock (Tracy Shaw); and attempt to kill both his mother-in-law Audrey Roberts (Sue Nicholls) and her longtime friend, Emily Bishop (Eileen Derbyshire), for financial gain due to his mounting debts. After confessing his crimes to Gail in a two-episode handler in February 2003, Hillman left the street for two weeks before returning with the intent of killing himself as well as Gail, her children Sarah and David (Jack P. Shepherd), and grand-daughter Bethany, before driving them into a canal – though the Platt family survived whilst Richard drowned. This came just months after Sarah had survived serious injuries after being passenger in a stolen car which crashed. The storyline received wide press attention, and viewing figures peaked at 19.4 million, with Hillman dubbed a \"serial killer\" by the media. Todd Grimshaw (Bruno Langley) became Corrie's first regular homosexual character. In 2003, another gay male character was introduced, Sean Tully (Antony Cotton). The bigamy of Peter Barlow (Chris Gascoyne) and his addiction to alcohol, later in the decade, Maya Sharma's (Sasha Behar) revenge on former lover Dev Alahan (Jimmi Harkishin), Charlie Stubbs's (Bill Ward) psychological abuse of Shelley Unwin (Sally Lindsay), and the deaths of Mike Baldwin (Johnny Briggs), Vera Duckworth (Liz Dawn) and Fred Elliott (John Savident). In 2007, Tracy Barlow (Kate Ford) murdered Charlie Stubbs and claiming it was self-defence; the audience during this storyline peaked at 13.3 million. At the 2007 British Soap Awards, it won Best Storyline, and Ford was voted Best Actress for her portrayal. Other storylines included Leanne Battersby (Jane Danson) becoming a prostitute and the show's first bisexual love triangle (between Michelle Connor (Kym Marsh), Sonny Dhillon (Pal Aron), and Sean Tully (Antony Cotton)).", "In July 2007, after 34 years in the role of Vera Duckworth, Liz Dawn left the show due to ill health. After conversation between Dawn and producers Kieran Roberts and Steve Frost, the decision was made to kill Vera off. In January 2008, shortly before plans to retire to Blackpool, Vera's husband Jack (William Tarmey) found that she had died in her armchair.", "Coronation Street became known for the portrayal of strong female characters,Geraghty, Christine. Women and Soap Opera, Polity Press, London, 1991. () including original cast characters like Ena, Annie and Elsie, and later Hilda Ogden (Jean Alexander), who first appeared in 1964; all four became household names during the 1960s.Little. (2000) p.5. Warren's programme was largely matriarchal, which some commentators put down to the female-dominant environment in which he grew up. Consequently, the show has a long tradition of psychologically-abused husbands, most famously Stan Ogden (Bernard Youens) and Jack Duckworth (Bill Tarmey), husbands of Hilda and Vera Duckworth (Liz Dawn), respectively."]}, {"page": "2017", "response": ["* September 25 – Liz Dawn, English actress (b. 1939)"]}, {"page": "Through the Keyhole", "response": ["| 8 || Patti ColdwellLord LichfieldEve Pollard || Gordon HoneycombeLiz Dawn || 3 June 1988"]}, {"page": "Betty Williams (Coronation Street)", "response": ["Betty was the longest-serving barmaid of the soap's public house, The Rovers Return. She first served behind the bar in 1969 and had been shown to work there for 42 years, as of 2011. There have been brief breaks however, as storylines have led to the character being fired or quitting her post. She was fired by Annie Walker (Doris Speed), who accused her of theft, and she quit her post in 1995 when Jack (Bill Tarmey) and Vera Duckworth (Liz Dawn) took over as landlords. In the summer of 2009, Betty was sacked again temporarily by manager Poppy Morales. In a storyline that aired in February 2010, Betty – at 90 years old – was named Manchester's Oldest Barmaid. In a plot twist, a 91-year-old rival comes forward, resulting in Betty fearing she killed her, when the rival consumes a two-month-old hotpot."]}, {"page": "Richard Hillman", "response": ["In the course of events surrounding Richard's plight to avoid financial bankruptcy and allow his property company called \"Kellet Holdings\" to remain afloat, he ended up leaving his business partner Duggie Ferguson (John Bowe) to die after the latter ends up having a fatal accident; murdering his ex-wife Patricia (Annabelle Apsion) with a shovel when she attempts to expose his fraudulent dealings; clashing with Gail's former ex-husband Martin (Sean Wilson) on certain family occasions; forming a subsequent entrepreneurship with fellow businessman Steve McDonald (Simon Gregson); swindling neighbours Jack Duckworth (Bill Tarmey) and his spouse Vera (Liz Dawn) from their life savings in an investment scam; kidnapping local gossip Norris Cole (Malcolm Hebden) to stop him from investigating the truth about Kellett Holdings and after he prevents his childhood friend Rita Fairclough (Barbara Knox) from being conned as well; befriending Gail's eldest son Nick Tilsley (Adam Rickitt) when he gets invited to their wedding; attempting to bribe the street's Councillor Curly Watts (Kevin Kennedy) with the discovery that a Bail Hostel operation threatens to jeopardize his development plans; forcing Patricia's best-friend Charlotte Morris (Joanne Zorian) to leave Weatherfield after she threatens to uncover the true circumstances behind her fate; plotting to kill his mother-in-law Audrey Roberts (Sue Nicholls) by setting her house on fire, after which he exploits his failure to doing so with the conclusion that she has Alzheimer's disease; becoming enemies with Audrey's companion Archie Shuttleworth (Roy Hudd) in light of setting fire to her house; killing Audrey's co-worker Maxine Peacock (Tracy Shaw) with a crowbar after using it to unsuccessfully murder Norris' roommate Emily Bishop (Eileen Derbyshire) as part of his plan to extract her house as a result of his equity release scheme that Emily signed with his company; and framing Sarah's troublesome ex-boyfriend Aiden Critchley (Dean Ashton) for the crime of both Emily's attack and Maxine's murder in retribution for Aidan causing an earlier car crash that nearly killed Sarah and left her hospitalized for a while."]}, {"page": "Fred Feast", "response": ["Dogged by ill health for most of the 1990s, he made a short-lived comeback starting in 1996 when Liz Dawn asked him to play the bartender in her video Liz Dawn's House Party. An appearance on the regional celebrity Yorkshire TV quiz show Cryer's Crackers followed, as did a guest role in Heartbeat in 1998. The same year he took on the small role of pigeon fancier Arthur in the hit film Little Voice, set in Scarborough and starring Brenda Blethyn, Jane Horrocks, Ewan McGregor, Michael Caine and Jim Broadbent. Feast also appeared in pantomimes, and on television chat shows during his two-year return in the public eye."]}, {"page": "Elsie Tanner", "response": ["During her time, Elsie took a diverse range of jobs, including shop worker, croupier, machinist, factory supervisor, café worker and model. At the start of the series, Elsie worked in the department store \"Miami Modes\", before moving on to \"Sylvia's Separates\" dress shop in the 1970s. She also worked under Mike Baldwin (Johnny Briggs) alongside Vera Duckworth (Liz Dawn), Ivy Tilsley (Lynne Perrie) and Ida Clough (Helene Palmer) at Baldwin's Casuals clothing factory, where she spent some time as supervisor."]}, {"page": "Frankie Baldwin", "response": ["After a while, Frankie began to settle into the street more - especially after striking up a bond with Vera Duckworth (Liz Dawn). When Vera was ill, Frankie took care of her by doing her chores for her, filling in her job for her and advised her husband Jack (Bill Tarmey) to be more sensitive and attentive to Vera's needs. This led to Frankie securing a permanent position at the cafe, where she works with enemy Leanne."]}, {"page": "Vera Duckworth", "response": ["Vera Duckworth (also Burton) is a fictional character from the British ITV soap opera Coronation Street, portrayed by Liz Dawn. Vera is known for her long-standing marriage to Jack Duckworth (Bill Tarmey); they became one of the best-loved couples in television history. Vera was often shown in a comedic light.", "Originally, actress Liz Dawn was only contracted for a couple of episodes, but producers saw potential in the character of Vera and brought her back two years later for another short stint, before finally making Vera a regular from December 1976. The character remained in the series until 2008, when due to Dawn wanting to leave the show because of ill health, the character was killed off."]}, {"page": "Jack Duckworth", "response": ["Jack's storylines have focused on his long-standing marriage to his wife Vera (Liz Dawn) which has been complex and at times been described as \"rocky\". Other storylines include coping with his wayward son Terry (Nigel Pivaro) and his hobby for pigeon keeping. In his final storyline, he was portrayed as having incurable non-Hodgkin lymphoma. Jack has been characterised through his \"joyless and gloomy\" life in which he has a string of dead-end jobs and his wife's death, but continued to pass witty remarks on life. Television critics have described Jack as a loveable rogue type character and have favoured his relationship with Vera. His exit storyline was fairly documented in the media, receiving positive reactions and many state he is fondly remembered for his love of pigeons.", "Whilst Jack is working a fairground ride, the waltzer, he meets Vera Burton (Liz Dawn), and they soon begin a relationship. When Vera announces that she is pregnant with his baby, Jack agrees to marry her. Even after discovering this is a false alarm, Jack still takes her hand in marriage. During a trip to the United States, Jack confesses to being two years younger than Vera is aware, as he had lied at their wedding, making out that he was older than he really was in an attempt to impress a young Vera. Since they had not been legally married, they make their marriage official by tying the knot in the famous Little White Wedding Chapel in Las Vegas. A pregnant Vera gives birth to a son, whom they named Terry (Nigel Pivaro).", "Jack's relationship with Vera Burton (Liz Dawn) was always up and down, they had a rocky marriage and sometimes Jack appeared to show little care for her. Tarmey describes the first few decades in the following manner: \"He would never knowingly hurt people and he loves Vera, although he doesn't always like her. He will defend her to the death, unless the chap slagging her off is bigger than he is! Jack is not a thief either!\" In their \"hey-day\" they were dubbed as the modern day Stan (Bernard Youens) and Hilda Ogden (Jean Alexander) In their early days, Jack and Vera both had their fair share of dalliances. In 1982, whilst Vera was entertaining her own boyfriend, Jack had developed an attraction towards Bet Lynch (Julie Goodyear). Tarmey recalls the scenes in which Jack and Bet flirt, stating he was nervous and had to have Goodyear's help. They believed the storyline was a turning point for the two and was written with wit. Dawn opines: \"It was very cleverly written, because Vera knew that Jack had a girlfriend on the side but she didn't know the other woman was Bet. So she chose Bet as someone to confide in, and she really opened her heart. It was quite moving as well as funny.\" This led to a classic showdown in the Rovers."]}, {"page": "Bill Tarmey", "response": ["*\"I'll Be with You Soon\" (duet with Liz Dawn) (1989), Westmoor Music"]}, {"page": "Roy Cropper", "response": ["Bill Webster (Peter Armitage) and Jim McDonald (Charles Lawson) find a cast-iron fireplace while renovating the flats and decide to sell it, but Jamie tells Roy they are stealing it and tries to blackmail them for £5. Roy gets a new job washing-up in a big hotel. To help Tricia out, he buys her TV for £30. Martin Platt (Sean Wilson) takes Roy on to help out in the cafe. Roy is interested to hear that Don Brennan (Geoffrey Hinsliff) has a ghost and offers the benefit of his experience, lending Vera Duckworth (Liz Dawn) books on ghosts and haunted houses. Vera and her husband Jack (Bill Tarmey) are alarmed to find Roy camping in their cellar at night searching for any signs of a ghost. He hasn't found anything."]}, {"page": "Rovers Return Inn", "response": ["(Bill Tarmey and Liz Dawn)", "Newton & Ridley puts The Rovers Return up for sale. Possible owners are Jack (Bill Tarmey) and Vera Duckworth (Liz Dawn) and Jim (Charles Lawson) and Liz McDonald (Beverley Callard). Liz had previously run The Queens pub for the company in 1993. Though they had lived through financial hardship for much of their lives, Jack came into a large inheritance gained from the deaths of his brother Clifford (Dave King) and his wife, Elsie (Ursula Jones), in a car accident. Combined with the money made from selling No. 9, Jack and Vera have the cash ahead of the McDonalds and are allowed to buy The Rovers Return. As Jack has a criminal record, Vera is made the licensee. Vera, who always had elevated ideas of her own status, feels she has finally made something of her life. Unfortunately, the Duckworths' lack of business experience and workshy nature quickly landed them in trouble and in 1997 they discovered they owed over £17,000 in taxes. Desperate, they were forced to turn to Alec Gilroy (Roy Barraclough), who had returned from Southampton, who paid them £20,000 in exchange for a 50% share of the pub. The Duckworths and Alec had a poor business relationship, and it wasn't long before he decided he wanted out of the partnership and paid them £30,000 for the remainder of the business. The two accepted on the condition they were allowed to continue living and working in the pub.", "Bet was saved as heroic Kevin was led home, refusing to be taken to hospital. Vera Duckworth (Liz Dawn) had sarcastically suggested that the cause had been Bet smoking in bed, though Jack knew who was to blame. As Bet was led away in the ambulance she joked \"Can you give me a minute, love, give me time to put my face on...?\". Once the emergency services established everyone had been safely accounted for, they set about extinguishing the fire itself, starting with the main bar and working their way down to the cellar where the fire had originated. The Rovers was completely destroyed as the fire brigade and police examined the pub and quickly established the fire had been caused by an electrical fault after looking over the fuse box, and clear out the loose debris."]}, {"page": "Tyrone Dobbs", "response": ["After his mother abandons him, Tyrone moves into Jack (Bill Tarmey) and Vera Duckworth's (Liz Dawn) bed and breakfast establishment and adopts a greyhound, Monica. While seeking a partner for Monica, Tyrone meets and begins dating Maria Sutherland (Samia Smith), a kennel maid and they get engaged in 2002. Fiz Brown (Jennie McAlpine), however, tries to come between them. She succeeds and has a brief relationship with Tyrone but he ends it and realises he is better suited to Molly Compton (Vicky Binns). They live with Jack and Vera at number 9 and plan to buy somewhere of their own but they buy Jack and Vera out when they decide to move to Blackpool. Vera, however, dies in January 2008. Jack stays with Tyrone and Molly at Number 9 and the family atmosphere is soon enhanced with the arrival of Molly's aunt, Pam Hobsworth (Kate Anthony)."]}, {"page": "Ray Langton", "response": ["* Ray made a brief cameo appearance in Viva Las Vegas!, a VHS spin-off written by Russell T. Davies and released in 1998, as Buswell was living in Las Vegas at the time. In the storyline Ray is working as a barman and unexpectedly meets Vera Duckworth (Liz Dawn), who is holidaying there. When Vera brings him up to date on some of the things that have happened in Weatherfield since his departure, Ray assumes she must be joking and responds by telling her he's now married to a man and is hiding from his evil twin."]}, {"page": "Lily Live!", "response": ["The guests on tonight's show were Gayle Tuesday, Liz Dawn, The Beautiful South, and Mary Unfaithful. Lily opened the show with Don't Tell Mama. Then later sung I Can't Give You Anything But Love as a duet with Liz Dawn."]}, {"page": "Terry Duckworth", "response": ["Terry returns five years later with a pregnant girlfriend, Lisa Horton (Caroline Milmoe). Several months after his return, he is arrested for GBH and Lisa tells Jack (Bill Tarmey) and Vera (Liz Dawn) that Terry is in prison. He is released in order to marry Lisa, but uses the ceremony as an opportunity to escape briefly and is recaptured several days later. Terry has further three years added to his sentence. In September that year, Lisa gives birth to a son, whom she names Tommy (Darryl Edwards). The following year,"]}, {"page": "The British Soap Awards", "response": ["| \"Best On-Screen Partnership\" || David Neilson & Julie Hesmondhalgh (Roy Cropper & Hayley Patterson in Coronation Street) || Dean Sullivan & Sue Jenkins (Jimmy & Jackie Corkhill in Brookside)Bill Tarmey & Liz Dawn (Jack & Vera Duckworth in Coronation Street)Dominic Brunt & Lisa Riley (Paddy Kirk & Mandy Dingle in Emmerdale)", "| \"Best On-Screen Partnership\" || Bill Tarmey & Liz Dawn (Jack & Vera Duckworth in Coronation Street)", "| \"Lifetime Achievement Award\" || Liz Dawn (Vera Duckworth in Coronation Street) || N/A", "The 2018 awards were broadcast live for the first time on 2 June 2018. Liz Dawn, who played Vera Duckworth in Coronation Street, was remembered during the ceremony, having died in September 2017."]}, {"page": "Alec Gilroy", "response": ["Alec returned permanently in April 1996. In May 1997 he was made redundant from Sunliners. This didn't keep Alec down for too long, however, as he began a partnership with Jack (Bill Tarmey) and Vera Duckworth (Liz Dawn) at The Rovers Return, since Alec helped bail Jack and Vera out of a VAT bill."]}, {"page": "Sooty Heights", "response": ["# \"Dog Brain of Britain\" (13 November 2000)[Guest Starring: Liz Dawn as Liz, Danielle Nicholls as Nesta Table and Steve Money as Security Officer"]}, {"page": "Halton Moor", "response": ["Actress Liz Dawn, known for portraying Vera Duckworth in Coronation Street (as a regular from 1976 to 2008) grew up on the estate."]}, {"page": "Crown Court (TV series)", "response": ["Other (then or subsequently) famous names to appear on the show included Eleanor Bron, Warren Clarke, Tom Conti, Brian Cox, Honey Bane, Philip Bond, Michael Elphick, Sheila Fearn, Colin Firth, Brenda Fricker, Derek Griffiths, Nigel Havers, Ian Hendry, Gregor Fisher, Ben Kingsley, Ian Marter, Mark McManus, Vivien Merchant, Mary Miller, Geraldine Newman, Judy Parfitt, Robert Powell, Peter Sallis, Anthony Sharp, Michael Sheard, Barbara Shelley, Juliet Stevenson, Patrick Troughton, Mary Wimbush, Peter Capaldi and Mark Wing-Davey, Bernard Hill and Liz Dawn."]}, {"page": "Inside Soap Awards", "response": ["| Bill Tarmey & Liz Dawn"]}, {"page": "Steve November", "response": ["In September 2005, it was announced that November would replace Tony Wood as the producer of Coronation Street. He was credited as producer from February 2006 and one of his first decisions was to write out four characters. While working on Coronation Street, November became the series producer of ITV's drama series The Royal. In November 2007, it was announced that November had decided to leave his role at Coronation Street. He remained with the show until 2008 until Kim Crowther took over his role. During his tenure he notably axed Bruce Jones' character, Les Battersby and oversaw the departure of long-standing character Vera Duckworth played by Liz Dawn."]}, {"page": "Ivy Tilsley", "response": ["Ivy's biggest tragedy occurs in 1989 when Brian is stabbed to death outside a nightclub; she never fully recovers from his loss. She is later horrified to learn of Gail's relationship with Martin Platt (Sean Wilson), who is 11 years her junior. In 1990, when Gail discovers she is pregnant and plans to have an abortion, Martin persuades her not to. Upon announcing the pregnancy to the family, Ivy is mortified, insisting that Gail and Martin get married so that the child doesn't have the Tilsley name. The couple's son, David (Thomas Ormson), is born on Christmas Day 1990; Gail and Martin eventually marry in September 1991. With Martin hoping to formally adopt Nicky and Sarah (as well as observing Nicky referring to Martin as his father), Ivy felt the memories of Brian and Bert were being pushed out of her grandchildren's lives, and attempted to smear Martin and Gail's reputations to the social worker overseeing the adoptions, but to no avail. Though Martin and Gail are comfortable as atheists, Ivy becomes obsessed with ensuring Nicky is raised within the Catholic faith he was christened into, believing it was what Brian would have wanted. Ivy further upsets the Platts by manipulating Nicky's passion for football, making him a member of the local Catholic church's football team, thus causing Martin to walk Nicky off the pitch. Ivy again causes friction with the Platts when Sarah repeats her threat if she and Nicky change their surnames from Tilsley to Platt, they won't inherit a penny from her will. At the intervention Don and her best friend Vera Duckworth (Liz Dawn), Ivy bitterly accepts Martin as Nicky and Sarah's adoptive father for the sake of maintaining contact with her grandchildren."]}, {"page": "Paul Clayton (Coronation Street)", "response": ["When the character's return was announced in 2007, it was revealed that the character would pick up where his on-screen father Terry left off. Tom Hudson stated that the character would develop to become a \"loveable rogue\", but would become much more of a rogue than lovable. He also said that the character would take interest in various of the Street's ladies. Following the character's return, Tom revealed that a role on the show was what he'd always hoped for, having watched the show with his mother as a child. Around the time that Liz Dawn, who played the character of Paul's paternal grandmother, Vera Duckworth, was revealed to be leaving the show, Tom claimed that he would miss the actor, even though he understood that her ill health forced her to leave. Prior to the character's departure in 2008, Tom claimed that he had enjoyed his role on the show, but had other things planned. Tom also said that the character would definitely return in later years, resembling his on-screen father; he also stated that the storyline in which the character would exit was what Tom had hoped for."]}, {"page": "List of former Emmerdale characters", "response": ["| Mrs. Winterbottom || Liz Dawn || 2015"]}, {"page": "List of former Coronation Street characters", "response": ["|Vera Duckworth || Liz Dawn || 1974, 1976–2008, 2010"]}, {"page": "Corpus Christi Catholic College", "response": ["* Liz Dawn (1946-1951) - British Actress"]}, {"page": "Jackie Dobbs", "response": ["Liverpudlian Jackie first appeared in March 1998 as the cellmate of Deirdre Rachid (Anne Kirkbride); Jackie was in prison for ABH. Jackie's introduction was part of a high-profile storyline that saw Deirdre framed by her boyfriend and wrongfully imprisoned. Jackie first appeared in a specially constructed prison cell at Granada Studios. Deirdre's conviction was quashed within three weeks and she was released; Jackie soon followed her to the soap's primary setting of Weatherfield on parole, needing a friend to turn to, having been dumped by her partner and left homeless. Jackie moved to the area with her teenage son Tyrone (Alan Halsall), squatting in Curly Watts' (Kevin Kennedy) vacant premises. She became a factory worker for Mike Baldwin (Johnny Briggs), where she had numerous run-ins with Janice Battersby (Vicky Entwistle) over flirtations with Janice's husband Les Battersby (Bruce Jones). Jackie remained on the show for one year before leaving in the midst of a property feud with Curly, who had returned to Coronation Street to find her formally renting his house. Jackie fled back to Liverpool with her husband Darren (James McMartin), though Tyrone stayed behind as a lodger with Jack (Bill Tarmey) and Vera Duckworth (Liz Dawn)."]}, {"page": "List of longest-serving soap opera actors", "response": ["|Liz Dawn || Vera Duckworth || Coronation Street || 1974, 1976–2008, 2010 ||  years || "]}, {"page": "Molly Dobbs", "response": ["After briefly working in her father's shop and at Kirk's kennels, Molly then starts working for Dev Alahan (Jimmi Harkishin) at his corner shop. Molly begins dating Tyrone Dobbs (Alan Halsall) and lives with him and his foster parents Jack (Bill Tarmey) and Vera Duckworth (Liz Dawn). Molly forms a close bond and friendship with Vera and asks her for advice about her relationship with Tyrone. Molly is devastated when Vera dies in January 2008."]}, {"page": "List of Coronation Street characters (2007)", "response": ["Doreen's character has been described as lively, bubbly and flirty. She has been revealed to have been a former member of Charlie Roscoe's Exotic Dancers, joining the troupe at only fifteen years old. One of Doreen's eyes is noticeably partially sighted. This has been claimed as an accident in which involved a lychee and a chopstick. Doreen was considered as a new love interest for Jack Duckworth (Bill Tarmey), following the death of his wife Vera (Liz Dawn), but this plan was shelved. "]}, {"page": "List of Coronation Street characters (1978)", "response": ["Ida Clough (also Bulmer) was played by Helene Palmer. Ida first appeared in 1978 she was a machinist at Baldwin's Casuals and was always militant and behind anyone who wanted to strike. Over the years she worked alongside Ivy Tilsley (Lynne Perrie), Vera Duckworth (Liz Dawn), Elsie Tanner (Pat Phoenix) and Shirley Armitage (Lisa Lewis)."]}, {"page": "List of Coronation Street characters (1989)", "response": ["Tina Fowler, played by Michelle Holmes, made her first screen appearance on 13 March 1989. Tina was employed as a barmaid in The Rovers Return following the departure of Gloria Todd (Sue Jenkins). She was interviewed by landlady Bet Gilroy (Julie Goodyear) in the pub during opening hours and given the job shortly afterwards. Curly Watts (Kevin Kennedy) set his sights on Tina however she rejected him. Rovers cellarman Jack Duckworth (Bill Tarmey) became infatuated with Tina, she kept Jack at bay until one day when, for a laugh, she agreed to go out with him on what Jack thought was a date. Tina was happy to spend Jack's money but when he tried to get frisky with her she demanded he drive her home. Jack's wife Vera (Liz Dawn) was furious when she found out about Jack and Tina's \"date\" and was even more furious when Tina revealed that she only went out with him for a joke which resulted in Vera throwing a pint which missed Tina and drenched landlord Alec Gilroy (Roy Barraclough)."]}, {"page": "List of Coronation Street characters (2009)", "response": ["Connie Rathbone was a close friend of Jack Duckworth (Bill Tarmey). She first appears on 17 April 2009, when she discovers one of Jack's missing pigeons and returns it to him. Connie and Jack get friendly as they chat about them both being widows. As Connie's visits become more frequent, Tyrone (Alan Halsall) gets annoyed, seeing it as an insult to Jack's deceased wife Vera's (Liz Dawn) memory. In May, Connie invites Jack on holiday to Spain with her. Jack is afraid of what Tyrone will think of him and Connie going on holiday together, he lies and says he is going to Blackpool. In July, he visits Connie at her house and is amazed to discover that she is rich and lives in a lavish mansion. Tyrone is initially hostile towards Connie as he sees her as an insult to memories of Vera and believing she is after Jack's money, but realises this is not the case after seeing her big house. Jack moves in with Connie in September 2009 to give Tyrone and Molly more space."]}, {"page": "1939 in British television", "response": ["**Liz Dawn, actress (Coronation Street) (died 2017)"]}, {"page": "List of Coronation Street characters (1979)", "response": ["Jack Duckworth was introduced by executive producer Bill Podmore, and portrayed by Bill Tarmey. The character debuted on-screen during the episode aired on 28 November 1979, initially on a recurring basis. Tarmey made further appearances in 1981 and 1982, before joining full time in 1983. In April 2010, Tarmey announced his decision to leave the soap, and Jack's final appearance was broadcast on 8 November 2010. Jack's storylines have focused on his long-standing marriage to his wife Vera (Liz Dawn), which has often been described as \"complex\" and \"rocky\", as well as dealing with wayward son Terry (Nigel Pivaro) and his hobby for pigeon keeping. In his final storyline Jack was portrayed as having incurable non-Hodgkin lymphoma. Jack has been characterised through his \"joyless and gloomy\" life in which he has a string of dead end jobs but continued to pass witty remarks on life. Critics have described Jack as a loveable rogue type character and have favoured his relationship with Vera."]}, {"page": "Coronation Street Live (2000 episode)", "response": ["Vera Duckworth (Liz Dawn) is critical but stable at Weatherfield General, having had an allergic reaction to the antibiotics. Tyrone Dobbs (Alan Halsall) and Maria Sutherland (Samia Ghadie) convince Vera's husband, Jack (Bill Tarmey) to go home and rest, as he has been at Vera's bedside all night. However, when Martin Platt (Sean Wilson) advises them that Jack should not stay away for too long, Tyrone panics and phones Curly Watts (Kevin Kennedy) to ask him to fetch Jack. Curly, who is speaking on the phone in The Kabin is overheard by Norris Cole (Malcolm Hebden), who misinterprets the conversation and believes that Vera has died.", "* Liz Dawn as Vera Duckworth"]}, {"page": "Tommy Duckworth", "response": ["Terry's parents, Jack Duckworth (Bill Tarmey) and Vera Duckworth (Liz Dawn) take in their grandson. They love having him around but find it a physical and financial struggle, as Vera gave up her job to look after the baby. At one point, she starts stealing from Bettabuys just to put food on the table, but looks forward to Terry's release and imagines them rebuilding their relationships as one big family. However, Terry has no intention of being a father and promptly hands Tommy over to Lisa's parents, who also want to raise their grandson, knowing that they would pay him a fixed sum every year in return for custody. Terry hands him over on Christmas Eve and is ready to make a quick departure. However, Lisa's father, Jeff Horton (Dicken Ashworth), forces Terry to tell Jack and Vera what he has done, not wanting to be arrested for kidnap. Terry tells his parents, who are horrified and Jack does not believe that Terry did it to help his parents. Jack disowns Terry and punches him before he and Jeff leave with Tommy, leaving the Duckworths (especially Vera) heartbroken. The Hortons immediately go on an extended holiday and the Duckworths struggle to accept that Tommy would not be coming back. However, their financial burden is lifted and Vera is able to return to work. After Jack and Vera re-establish contact with the Hortons. Tommy saw his grandparents on a semi-regular basis for most of his young life."]}, {"page": "List of Coronation Street characters (1995)", "response": ["Cliff walks out on Elsie just before Christmas 1994 to stay at No. 9 Coronation Street and reconnect with Jack. However, Elsie tracks him down and, shortly after New Year's Day 1995, barges her way into the Duckworth household. Cliff, having told Jack and his wife Vera (Liz Dawn) that he too was married to a Vera, is shocked. When Elsie introduces herself, Vera says: \"I thought you were Vera?\" to which Elsie replies, \"No, you're Vera!\" before dragging Cliff home, with Cliff pathetically promising to keep in touch.", "Gary Mallett is played by Ian Mercer. He moves to Weatherfield with his wife, Judy (Gaynor Faye), on 2 October 1995, after buying Jack and Vera Duckworth's house. She and Gary are happy together, but Judy longs for a child. Sadly, nothing happened so when she meets Zoe Tattersall (Joanne Froggatt), a young woman who was considering giving her baby up for adoption, Judy convinces Zoe to allow her and Gary to adopt the baby; a girl who she and Gary name Katie Joyce. Zoe, however, regrets her decision and soon takes Katie back and renames her Shannon. Judy and Gary are heartbroken by this, and this did not improve when Shannon died of meningitis a few months later. Eventually, Judy discovers that she is pregnant and is thrilled to discover that she is expecting twins. On 25 December 1998, she gives birth to Rebecca and William Mallett. Nine months later, Judy collapses in the backyard and dies after suffering a pulmonary embolism caused by injuries sustained in a road accident caused by Terry Duckworth (Nigel Pivaro). When Terry arrives at his parents', Jack (Bill Tarmey) and Vera Duckworth's (Liz Dawn), house on Christmas Day, Gary punches him and blames him for Judy's death. The following year, Gary decides to leave Weatherfield with Rebecca and William on 1 October 2000. They move to Blackpool to live with Gary's new girlfriend Paula Shipley (Joanne Rowden) and her son Warren (Dean Worswick), selling the house back to Jack and Vera Duckworth."]}, {"page": "List of Coronation Street characters (1994)", "response": ["In January 1995, Tricia and Jamie moved into No. 1 Coronation Street. Tricia befriended her neighbour Vera Duckworth (Liz Dawn), Jack's wife. Tricia was evicted by her landlord Mike Baldwin (Johnny Briggs) after giving him a good run for his money. Percy Sugden helped Tricia secure the house, meaning Mike could not get in, and Jamie even emptied a bowl of water over him whilst the rest of the street were all laughing. Despite this, Tricia and Jamie moved out after Deidre persuaded Mike to let her rent one of his flats he owned on Crimea Street. She befriended her new neighbour (after initial tension between the pair), Deirdre Rachid (Anne Kirkbride), who helped look after Jamie whilst Tricia worked. Facing financial difficulties, Tricia attempted to get money from Mike by offering to have sex with him but he refused. In January 1996, Tricia was imprisoned for a week for failing to pay a fine for her TV licence. On release, she was overjoyed to be reunited with Jamie. In May, Tricia's unemployment benefits were stopped when she was found to be working as a cleaner for Mike but this time Mike offered to help and gave her a job as a machinist at his factory."]}, {"page": "Helene Palmer", "response": ["She began her career as an entertainer in British nightclubs during the 1960s and 1970s. She collaborated and became friends with many well-known English actors and comedians in the clubs, including Lynne Perrie, Pat Phoenix, Liz Dawn, Freddie Starr and Les Dawson."]}, {"page": "List of Coronation Street characters (1974)", "response": ["Vera Duckworth (also Burton), played by Liz Dawn, first appearing in August 1974 and last appearing in the 6,734th episode on 18 January 2008, where the character peacefully died in her sleep at the age of 70 from heart failure. Her funeral was held on 22 January 2008. She reappeared posthumously for a single appearance on the 8 November 2010 episode, in which her husband Jack (Bill Tarmey) died."]}]}}