{"wiki_id": "http://www.wikidata.org/entity/Q5361330", "itemLabel": "Elis James", "itemDescription": "Welsh comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Elis_James", "wikipedia_page": {"main": "Owain Elis James (born 3 November 1980) is a Welsh comedian, broadcaster and actor originally from Haverfordwest. He grew up in Carmarthen and later lived in Cardiff. He is now based in London. He is bilingual in Welsh and English and has performed stand-up in both languages.", "link_mentions": [{"page": "Haverfordwest", "response": ["* Elis James, stand-up comedian and actor, was born in Haverfordwest in 1980 but was raised in Carmarthen."]}, {"page": "The News Quiz", "response": ["* Elis James"]}, {"page": "Cardiff University", "response": ["*Elis James, stand up comedian and actor"]}, {"page": "Carmarthen", "response": ["*Elis James (born 1980), comedian"]}, {"page": "Al Murray", "response": ["In October 2018 Murray fronted the HISTORY TV series Al Murray: Why Does Everyone Hate The English, appearing both as Al Murray and his alter-ego The Pub Landlord. The series looks at the historical rivalries between England and its closest neighbours and features comedians Antoine de Caunes, Elis James, Andrew Maxwell, Fred MacAulay and Henning Wehn representing their respective nations."]}, {"page": "Radio X (United Kingdom)", "response": ["*Elis James "]}, {"page": "8 Out of 10 Cats", "response": ["Joe Wilkinson guest starred as the Banker's assistant. The guests were Nicola Adams, Rob Beckett, Gemma Collins, Mia Cross, Corinne Davies, Susie Dent, Matt Forde, John Fothergill, Stephen Frost, Nick Helm, Elis James, Dave Johns, Tony Law, Alice Levine, Mark Olver, Rachel Riley, John Robins, Katherine Ryan, Nong Skett, Andy Smart and Holly Walsh. "]}, {"page": "Danny Gabbidon", "response": ["Since retiring from playing Gabbidon now works in the media providing football punditry, he primarily works with BBC Radio Wales where he co-commentates on club matches for the Welsh Football clubs.  He also contributes to a weekly BBC Welsh Football podcast along with comedian Elis James and fellow Welsh International Iwan Roberts."]}, {"page": "Fighting Talk", "response": ["|Elis James", "* Elis James - Comedian "]}, {"page": "Sweat the Small Stuff", "response": ["|Elis JamesRita Ora"]}, {"page": "Rhod Gilbert", "response": ["In 2006, Gilbert hosted the BBC Radio Wales comedy panel show Jest a Minute, live from The Comedy Store in London. The second series of Jest a Minute was recorded in late 2008 in Cardiff's Glee Club, hosted by Gilbert and featuring regular team captains Chris Corcoran and Lloyd Langford, and guests from the comedy circuit such as Elis James, Greg Davies, Lucy Porter and Jon Richardson. A third series was also broadcast."]}, {"page": "Gipsy Hill", "response": ["*Elis James, comedian, broadcaster and actor"]}, {"page": "1980 in Wales", "response": ["*3 November – Elis James, comedian"]}, {"page": "Isy Suttie", "response": ["Suttie appeared in the S4C Welsh learners programme Hwb as a Welsh learner (which she is in real life) in a regular sketch called \"Y Wers Gymraeg\" (\"The Welsh Lesson\"), starring her partner Elis James.", "Suttie is engaged to Welsh comedian Elis James. The couple have two children, a daughter born in October 2014 and a son born in January 2019."]}, {"page": "Miles Jupp", "response": ["During 2014, Jupp narrated for the BBC television documentary series, Building Dream Homes. He appeared in the film Grimsby as a police officer in 2016. On 27 April 2016, Jupp was announced to voice Blackberry in the forthcoming adaptation of Watership Down. In 2015, Jupp appeared as a team captain on The Really Welsh Christmas Quiz, alongside fellow comedians Chris Corcoran, Elis James and Omar Hamdi."]}, {"page": "Iwan Roberts", "response": ["Roberts currently works in the media. He is bilingual, speaking fluent Welsh, and provides Welsh-language commentary for Sky Sports and BBC Radio Cymru. He also works for BBC Cymru Wales. He writes regularly for the local press in Norfolk, commenting on Norwich City and also contributes to the weekly podcast 'Elis James Feast of Football' with comedian Elis James and fellow Welsh former international player Danny Gabbidon."]}, {"page": "The Unbelievable Truth (radio show)", "response": ["| Elis James, Maeve Higgins, Reginald D. Hunter, David O'Doherty", "| Elis James, Maeve Higgins, Reginald D. Hunter, David O'Doherty", "| Holly Walsh, Mark Steel, Elis James, Frankie Boyle", "| Holly Walsh, Mark Steel, Elis James, Frankie Boyle", "| Richard Osman, Elis James, Sindhu Vee, Alan Davies", "| Richard Osman, Elis James, Sindhu Vee, Alan Davies"]}, {"page": "Football Weekly", "response": ["Other occasional contributors include Jim Burke, Gregg Bakowski, Sean Ingle, Ryan Hunn, Elis James, Jacqui Oatley, Musa Okwonga, Rory Smith and Troy Townsend. James, Oatley and Carruthers are occasional guest hosts in the absence of Rushden, while MacInnes is a previous guest host of the show."]}, {"page": "Chortle Awards", "response": ["*Club comic: Paul Sinha (nominees: Ed Gamble, Elis James, Felicity Ward)", "*Radio Award: Bridget Christie Minds The Gap (Nominees: Elis James & John Robins on XFM; Susan Calman is Convicted and Tom Wrigglesworth: Utterly At Odds With The Universe)", "*Radio Award : Elis James & John Robins - Radio X (Nominees: Alexei Sayle's Imaginary Sandwich Bar, Deborah Frances-White Rolls The Dice, Mark Steel's In Town)"]}, {"page": "Chris Corcoran", "response": ["Along with Elis James, Corcoran regularly performed as 'Mr Chairman' in Chris Corcoran's Committee Meeting, a live comedy show at The Ponty Muni Arts Centre in Pontypridd. In 2013 the two made a BBC Three pilot called The Committee Meeting based on their stand-up show as part of the channel's \"Comedy Feeds\" season, available to watch on the BBC's iPlayer. The pilot guest-starred Colin Baker.", "* The Really Welsh Christmas Quiz, alongside fellow comedians Miles Jupp, Elis James and Omar Hamdi"]}, {"page": "List of Mock the Week episodes", "response": ["|Rob Beckett, Elis James and Sara Pascoe"]}, {"page": "Bro Myrddin Welsh Comprehensive School", "response": ["* Elis James – Comedian and actor"]}, {"page": "Celebrity Mastermind", "response": ["| rowspan=\"4\"| 29 December 2018 || Elis James || Wales national football team || =2nd"]}, {"page": "Bandit (TV series)", "response": ["Bandit is a Welsh language music television show on S4C, produced by Boomerang Plus. It included live performances, videos and interviews and was presented by Huw Stephens, Elis James, Sarra Elgan, Rhydian Bowen Phillips and Huw Evans. The programme aimed to raise the profile of Welsh-language popular music but also included music from Wales with lyrics in other languages (usually English). The last episode of Bandit was broadcast on 28 December 2011, after a decade of being on the air. The special show was presented by Stephens and Evans."]}, {"page": "British Comedy Guide", "response": ["* Elis James's Pantheon of Heroes"]}, {"page": "Russell Howard's Good News", "response": ["| 3 || 4 November 2010 || 1.28 || 2 || 6 || Elis James"]}, {"page": "1980 in British radio", "response": ["*3 November – Elis James, Welsh comedian"]}, {"page": "Zipline Creative", "response": ["The first radio comedy series produced by Zipline Creative, Social Club FM, was a BBC Radio Wales sitcom based in a Valleys social club, starring Elis James, Chris Corcoran Vern Griffiths and Nadia Kamil. It ran for two series from 2012-2013 and was very well received critically. It subsequently gained a cult following with prominent comedy enthusiasts and a spin-off TV pilot was produced for BBC Three's Comedy Feeds. The show was written by Elis James (8 Out of Ten Cats, The Committee) and Gareth Gwynn (The News Quiz, The Armstrong And Miller Show) and produced by Sony Award Winning Producer Ben Walker."]}, {"page": "Hop Farm Festival", "response": ["*Elis James"]}, {"page": "The Rob Brydon Show", "response": ["| 3 ||  || Sir Bruce Forsyth || Sophie Ellis-Bextor || Elis James"]}, {"page": "National Theatre Wales", "response": ["* NHS70 (2018). A season of one-person plays celebrating the NHS taking place in intimate settings all over Wales, including new work by Maria Fusco, Alan Harris and Elis James."]}, {"page": "Josh Widdicombe", "response": ["Widdicombe hosts 1990s football nostalgia podcast and live shows called ‘Quickly Kevin, Will He Score?’. Guests include footballers such as Iain Dowie, Darren Huckerby, Pat Nevin and Matthew Le Tissier as well as comedians such as Elis James, Tom Parry, Ivo Graham and Matt Forde. In 2019 Widdicombe began hosting panel show Hypothetical with James Acaster for UK television channel Dave. In 2020, Widdicombe started a parenting podcast with fellow comedian Rob Beckett, titled Lockdown Parenting Hell. It was renamed Parenting Hell following the third national lockdown. It is a podcast about bringing up children, experiences, tips and face palm moments. In 2021 it was announced that Widdicombe had written a book: Watching Neighbours Twice a Day… How 90s TV (Almost) Prepared Me For Life, which was published in September 2021. It made the Sunday Times bestseller list."]}, {"page": "The Alternative Comedy Memorial Society", "response": ["* Elis James"]}, {"page": "Elis James (comedian)", "response": ["#REDIRECT Elis James"]}, {"page": "Gareth Gwynn", "response": ["Gwynn began his career in 2007 writing for BBC Radio 4 on Listen Against and continued to do so until 2011. Between 2008-9, Gwynn wrote for shows on BBC Radio 4 and BBC Radio 7 including Look Away Now, I Guess That's Why They Call It The News and Newsjack. In 2009 he became a recipient of the BBC Radio Comedy Writers Bursary. For BBC Radio 4 he writes for The Now Show and The News Quiz and for BBC Radio Wales he is a writer for the sketch shows Elis James' Pantheon of Heroes and Here Be Dragons."]}, {"page": "Matt Rees (comedian)", "response": ["He has supported Elis James. He performed as part of the Pleasance Reserve at Edinburgh Festival Fringe in 2012."]}, {"page": "Benjamin Partridge", "response": ["Partridge has written for radio, television and live performance. He writes for the CBBC show Horrible Histories,\"The British Comedy Guide\" on BBC Radio Wales he is one of the cast and a co-writer of Elis James's Pantheon of HeroesBBC \"Pantheon of Heroes\" and he also co-writes and produced the second series of Here Be Dragons, which won Bronze at the Radio Academy Awards in 2014. He also devised the BBC Radio 4 panel show It's Your Round.\"The British Comedy Guide\""]}, {"page": "Richard Herring's interview podcasts", "response": ["|Elis James", "|John Robins and Elis James"]}, {"page": "Crackanory", "response": ["Live action actors in the second series included Simon Farnaby, Martha Howe-Douglas, Rosie Cavaliero, Michael Fish, Alice Lowe, Elis James, Victoria Wicks, Lucy Montgomery, Dominic Coleman, Tom Meeten and Sara Pascoe."]}, {"page": "John Robins (comedian)", "response": ["In February 2014, he started hosting the Elis James and John Robins show on XFM (now Radio X) with fellow comedian Elis James. In August 2014, the show moved to Saturdays, and was broadcast weekly 1-4pm. It is also a popular podcast, with a cult following, with over 12 million downloads as of July 2017.", "Robins won Best Compère at the 2015 Chortle Awards. In the second half of 2016, Robins embarked on a tour show with co-host Elis James called \"The Elis James and John Robins Experience\".", "After five years broadcasting on Radio X (previously XFM), the Elis James and John Robins show aired its final episode on the station on Saturday 30 March 2019. On 2 April 2019, Robins announced that he and Elis James would be hosting a new show on BBC Radio 5 Live. The BBC show has been broadcast since 31 May 2019, and all episodes are downloadable as podcasts.", "* Elis James and John Robins (BBC Radio 5 Live)"]}, {"page": "Alan Davies: As Yet Untitled", "response": ["| Ardal O'Hanlon, Roisin Conaty, Rob Delaney and Elis James", "| David Baddiel, Beattie Edmondson, Elis James and Sindhu Vee  "]}, {"page": "Crims", "response": ["* Elis James as Luke ", "On the radio show and podcast Elis James hosts with comedian John Robins, James' starring role in Crims became a running gag, with Robins heavily implying that Crims was of poor quality, and pretending to believe that it was called 'Crimes', while mocking the fact that James, despite portraying a  teenager, was 34 at the time of Crims' broadcast."]}]}}