{"wiki_id": "http://www.wikidata.org/entity/Q5363104", "itemLabel": "Elizabeth Larner", "itemDescription": "British actor and singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Larner", "wikipedia_page": {"main": "Elizabeth Larner (born 1932) is a British actress and a singer with a powerful soprano voice. While her main career was the musical theatre, appearing both in London's West End and on Broadway, she also played Ammonia in the BBC situation comedy Up Pompeii!. She later appeared in The Two Ronnies, supporting Ronnie Barker as \"Piggy Malone\" and Ronnie Corbett as \"Charley Farley\" in the 1981-2 comic detective mystery serial Band of Slaves.\nElizabeth Larner appeared on television from the mid-1950s. Her singing gained notice in the original London Coliseum production of Kiss Me, Kate when the star of the show Patricia Morison was ill. Larner was her understudy; she had previously been a member of the chorus. She then toured as Kate/Lilli in Kiss Me, Kate with Christopher Hewett as Fred/Petruchio, and played leading roles in West End productions of Wish You Were Here, Kismet, and Camelot with Laurence Harvey as Arthur. She recruited millions more admirers with her numerous television appearances. She recorded an album of \"vocal gems\" from The New Moon and Rose-Marie with Andy Cole in one of HMV's (EMI) first stereo recordings. {To hear her voice from this recording, it is now partly available - The New Moon tracks at least - as a \"filler\" in the recent re-release of the June Bronhill/Edmund Hockridge version of The Desert Song - EMI CFP 3359872}.  She continued to contribute to the various HMV/EMI studio recordings of musicals up until the late 60s. Her film work in the 1970s includes appearances in Song of Norway (1970) and Royal Flash (1975).\nDuring the 1980s, she was living in the New York City area and appeared in two Broadway productions: as Mrs. Bumble/Mrs. Bedwin in the 1984 Cameron Mackintosh revival of Oliver! with Ron Moody and Patti LuPone, and as Lady Diss/Mrs. Brown in the 1986 first American production of Me and My Girl with Robert Lindsay, Maryann Plunkett and Jane Connell. She also appeared in an Off-Off-Broadway cabaret revue, Don't Cry, Baby, It's Only a Movie, with lyrics by Fran Landesman and music by Jason McAuliffe. By the 1990s, she had retired to Venice, Florida where she still resides.", "link_mentions": [{"page": "Up Pompeii!", "response": ["The series is set in ancient, pre-eruption Pompeii, with the players bearing Latinised names suggestive of their character. Howerd is the slave Lurcio (pronounced Lurk-io); his bumbling old master Ludicrus Sextus (Max Adrian, then Wallas Eaton), the promiscuous wife is Ammonia (Elizabeth Larner), their daughter Erotica (Georgina Moon) and their virginal son Nausius (Kerry Gardner). Other regulars are Senna the Soothsayer (Jeanne Mockford) who constantly warns of impending death and destruction and, in series one, Plautus (Willie Rushton) a semi-godlike figure, making pithy comments from a location somewhere between the clouds and Mount Olympus. Guest stars included several actresses from the Carry On film series, including Barbara Windsor, Wendy Richard and Valerie Leon."]}, {"page": "The Two Ronnies", "response": ["The last serial to include Piggy Malone and Charley Farley, in which an all-girls orchestra is sold into white slavery by a demented Chinaman. Elizabeth Larner plays Mrs Bumstead, who notices a mysterious blind man appearing on the cruise ship. Location filmed on board P&O SS Canberra cruise out of Southampton. This concluded The Two Ronnies' serials collection, as the last three series did not include any."]}, {"page": "Camelot (musical)", "response": ["The London production opened in August 1964 at the Theatre Royal, Drury Lane, and featured Laurence Harvey as Arthur, Elizabeth Larner as Guenevere and Barry Kent as Lancelot. It played for 518 performances."]}, {"page": "Triangle (1981 TV series)", "response": ["* Elizabeth Larner – Jo Bailey"]}, {"page": "Elizabeth larner", "response": ["#REDIRECT Elizabeth Larner "]}, {"page": "List of Are You Being Served? characters", "response": ["* Elizabeth Larner (\"Diamonds Are A Man's Best Friend\", as the Sweater Customer)"]}, {"page": "The Four Musketeers (musical)", "response": ["Harry Secombe played D'Artagnan, with Aubrey Woods as Richelieu. Also in the original London cast were: Elizabeth Larner, Glyn Owen, John Junkin, Stephanie Voss, Jeremy Lloyd, Sheena Marshe and Kenneth Connor."]}, {"page": "List of fictional Romans", "response": ["* Ammonia - the promiscuous wife of Ludicrus Sextus in the British TV series Up Pompeii! and its spinoff film. She was portrayed by Elizabeth Larner in the original TV series and the spinoff Further Up Pompeii. In the 1971 film, she was portrayed by Barbara Murray.Ammonia (Character) Up Pompeii (1971) Dir: Bob Kellett"]}, {"page": "Up Pompeii! (series 1)", "response": ["| Elizabeth Larner"]}, {"page": "Larner", "response": ["*Elizabeth Larner (born 1931), British actress and a singer with a powerful soprano voice"]}, {"page": "Kenneth Alwyn", "response": ["* Camelot (Theatre Royal, Drury Lane, London, 1964) starring Laurence Harvey and Elizabeth Larner"]}, {"page": "Larner, Elizabeth", "response": ["#redirectElizabeth Larner"]}]}}