{"wiki_id": "http://www.wikidata.org/entity/Q5362754", "itemLabel": "Elizabeth Farren", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Farren", "wikipedia_page": {"main": "Elizabeth Farren (c. 1759 – 23 April 1829) was an Irish actress of the late 18th century. Born in Cork in 1759 her father, George Farren was a surgeon. His drinking habits brought on early death and his widow returned to Liverpool. Her mother went on the stage to support herself and her children. Elizabeth first appeared on the London stage in 1777 as Miss Hardcastle in She Stoops to Conquer and the following year appeared at Drury Lane which, along with the Haymarket Theatre became her primary venues for the rest of her acting career. She had over 100 characters in her repertoire including Shakespeare and various contemporary comedies and dramas. She was often compared to Frances Abington, who was her only real rival. Her last appearance was in April 1797, two months before her marriage to Edward Smith-Stanley, 12th Earl of Derby. They had a son and two daughters.", "link_mentions": [{"page": "Thomas Lawrence", "response": ["Sometime before his eighteenth birthday in 1787 Lawrence arrived in London, taking lodgings in Leicester Square, near to Joshua Reynolds' studio. He was introduced to Reynolds, who advised him to study nature, rather than the Old Masters. Lawrence set up a studio at 41 Jermyn Street and installed his parents in a house in Greek Street. He exhibited several works in the 1787 Royal Academy exhibition at Somerset House, and enrolled as a student at the Royal Academy but did not stay long, abandoning the drawing of classical statues to concentrate on his portraiture. In the Royal Academy exhibition of 1788 Lawrence was represented by five portraits in pastels and one in oils, a medium he quickly mastered. Between 1787 and his death in 1830 he would miss only two of the annual exhibitions: once, in 1809, in protest about the way his paintings had been displayed and once, in 1819, because he was abroad. In 1789 he exhibited 13 portraits, mostly in oil, including one of William Linley and one of Lady Cremorne, his first attempt at a full-length portrait.Levey 2005: 77–79 The paintings received favourable comments in the press with one critic referring to him as \"the Sir Joshua of futurity not far off\" and, aged just twenty, Lawrence received his first royal commission, a summons arriving from Windsor Palace to paint the portraits of Queen Charlotte and Princess Amelia.Levey 2005: 76–77 The queen found Lawrence presumptuous (although he made a good impression on the princesses and ladies-in-waiting) and she did not like the finished portrait, which remained in Lawrence's studio until his death. When it was exhibited at the Royal Academy in 1790, however, it received critical acclaim.Levey 2005: 85–90 Also shown that year was another of Lawrence's most famous portraits, that of the actress Elizabeth Farren, soon to be the Countess of Derby, \"completely Elizabeth Farren: arch, spirited, elegant and engaging\", according to one newspaper.Levey 2005: 92", "Lawrence's reputation as an artist fell during the Victorian era. Critic and artist Roger Fry did something to restore it in the 1930s, when he described Lawrence as having a \"consummate mastery over the means of artistic expression\" with an \"unerring hand and eye\".Roger Fry (Reflections on British Painting, 1934) quoted in Levey 2005: 309 At one time Lawrence was more popular in the United States and France than he was in Britain, and some of his best known portraits, including those of Elizabeth Farren, Sarah Barrett Moulton (known to her family as Pinkie), and Charles Lambton (the \"Red Boy\") found their way to the United States during the early 20th century enthusiasm there for English portraits. Sir Michael Levey acknowledges that Lawrence is still dismissed by some art historians; his explanation is that \"He was a highly original artist, quite unexpected on the English scene: self-taught, self-absorbed in perfecting his own personal style, and in effect self-destructing, since he left behind no significant followers or creative influence. Leaving aside Sargent, his sole successor has been not in painting, but in fashionable, virtuoso photography.\"Levey 2005: 312–13", "The most extensive collections of Lawrence's work can be found in the Royal Collections and the National Portrait Gallery in London. The Tate Britain, the National Gallery and the Dulwich Picture Gallery house smaller collections of his work in London. There are a few examples of his work in the Holburne Museum of Art and the Victoria Art Gallery in Bath, and in Bristol City Museum and Art Gallery. In the United States, The Huntington Library houses Pinkie, and Lawrence's portraits of Elizabeth Farren, Lady Harriet Maria Conyngham, and the Calmady children are in the Metropolitan Museum of Art. In Europe, the Musée du Louvre has a few examples of Lawrence's work, and the Vatican Pinacoteca has a swagger portrait of George IV (presented by the king himself) as almost its only British work."]}, {"page": "Earl of Derby", "response": ["The earldom was inherited by his distant relative Sir Edward Stanley, 5th Baronet, of Bickerstaffe, a descendant of a younger brother of the second Earl, who became the 11th Earl of Derby (see below for earlier history of the Baronetcy). He had previously represented Lancashire in Parliament and after he succeeded in the earldom he served as Lord Lieutenant of Lancashire. Lord Derby married Elizabeth Hesketh. His residence was Bickerstaffe Hall near Ormskirk, Lancashire. The 11th Earl's younger brother was the Hon. and Rev. John Stanley, Rector of Bury Parish Church 1743–1778. Edward's eldest son, James, Lord Stanley, was commonly called Lord Strange. Edward outlived James (who died in 1771) and was succeeded by James' son Edward, the 12th Earl. He held political office as Chancellor of the Duchy of Lancaster and also founded The Derby horse-race. Lord Derby married Lady Elizabeth Hamilton, daughter of James Hamilton, 6th Duke of Hamilton. His second marriage was to a Drury Lane actress, Elizabeth Farren."]}, {"page": "Edward Smith-Stanley, 12th Earl of Derby", "response": ["Lady Derby died at the age of 44 on 14 March 1797. Six weeks later, on 1 May 1797, Lord Derby married the actress Elizabeth Farren, daughter of George Farren. She bore him a daughter:", "File:Portrait of Elizabeth Farren, by Thomas Lawrence.jpg|Portrait of Elizabeth Farren, by Thomas Lawrence, 1790"]}, {"page": "Anne Seymour Damer", "response": ["She exhibited regularly at The Royal Academy from 1784 to 1818. She was a close friend to members of Georgian high society, including Horace Walpole and the Whig politician Charles James Fox. It is believed that Damer was a lesbian and was in a relationship with the actress Elizabeth Farren.", "During the period 1784–1818, Damer exhibited 32 works as an honorary exhibitor at the Royal Academy. Her work, primarily busts in Neoclassical style, developed from early wax sculptures to technically complex ones in works in terracotta, bronze, and marble. Her subjects, largely drawn from friends and colleagues in Whig circles, included Lady Melbourne, Nelson, Joseph Banks, George III, Mary Berry, Charles James Fox and herself. She executed several actors' portraits, such as the busts of her friends Sarah Siddons and Elizabeth Farren (as the Muses Melpomene and Thalia).", "Damer's friends included a number of influential Whigs and aristocrats. Her guardian and friend Horace Walpole was a significant figure, who helped foster her career and on his death left her his London villa, Strawberry Hill. She also moved in literary and theatrical circles, where her friends included the poet and dramatist Joanna Baillie, the author Mary Berry, and the actors Sarah Siddons and Elizabeth Farren. She frequently took part in masques at the Pantheon and amateur theatricals at the London residence of the Duke of Richmond, who was married to her half-sister.The Letters of Horace Walpole: Earl of Orford, Horace Walpole, H.G. Bohn, 1861. Internet Archive", "A romance between Damer and Elizabeth Farren, who was mentioned by Thrale, is the central storyline in the 2004 novel Life Mask by Emma Donoghue."]}, {"page": "Knowsley Hall", "response": ["This section describes mainly the rooms which are normally open to the public.  The Entrance Hall is panelled in carved oak and is hung with early 18th-century paintings of the house and the park.Anon. p. 2.  The Grand Staircase has a collection of oil paintings on leather.Anon. p. 4.  The morning room is a light family room overlooking the gardens and parkland.  The Breakfast Room has pale blue panels with paintings, one of which is a portrait of Charlotte, wife of the 7th Earl.Anon. p. 5.  The Walnut Drawing-Room contains a number of portraits, including one of the second wife of the 12th Earl, the actress Elizabeth Farren.Anon. p. 6. The library contains a collection of books on natural history brought together by the 13th Earl.Anon. p. 9.  The Stucco Room, decorated in Rococo style, was created in the 18th century to link the Royal Lodging with the rest of the house is now a ballroom with a sprung floor.Anon. p. 10.  The State Dining Room is hung with portraits of family members.Anon. pp. 3–4.  The room was designed by Foster to look like a great hall with doors  high and contains two Gothic fireplaces and an ormolu chandelier.  It was reworked in 1890, adding a bay window, a carved dado and a roof consisting of a large rectangular lantern supported on brackets which is glazed round its sides.Pevsner and Pollard, p. 221.  The hall now measures  and is  high."]}, {"page": "York Theatre Royal", "response": ["York Theatre Royal was built in 1744 on, and among, the site of the medieval St. Leonard's Hospital.\"History\", York Theatre Royal. Retrieved 19 November 2011 Parts of the old hospital can still be seen in the modern building, including archways and walls. Under the stage lies a well, which is believed to be dated from the Roman era of York's history.  The 1744 theatre replaced a theatre in Minster Yard, built by Thomas Keregan, with the encouragement of the City Corporation, in 1734.  Twenty five years after its construction, in 1769, Tate Wilkinson paid £500 for a Royal Patent, and, accordingly, it was renamed the Theatre Royal. Wilkinson ran a company that included theatres in Hull, Leeds, Pontefract, Wakefield and other Yorkshire towns. His company was reckoned to be the leading provincial company, and he attracted many of the finest actors of the period, including John Philip Kemble and his sister Sarah Siddons, Dorothea Jordan and Elizabeth Farren, to act in York. Since Wilkinson's time the theatre has undergone several renovations and upgrades. In the late 1800s the theatre was refurbished into the Victorian style, including, in 1880, a new Victorian Gothic frontage, which is decorated with carved heads representing Elizabeth I and characters from Shakespeare's plays. The latest major redevelopment was an extensive renovation of the theatre, with a new modernist foyer (architect:  Patrick Gwynne), in 1967. The theatre has been designated a Grade II* listed building by English Heritage."]}, {"page": "John Bell (publisher)", "response": ["*Volume 6. The Distrest Mother translated by Ambrose Philips from the Andromaque by Jean Racine illustrated with Mr William Farren as Oresters. The Earl of Essex by Henry Jones illustrated with Mr William Wroughton as the Earl of Essex. Medea by Richard Glover illustrated with Mrs Sarah Siddons as Medea.The Gamester altered by Charles Johnson from James Shirley and illustrated with Mrs Elizabeth Farren as Penelope. The Battle of Hastings (play) by Richard Cumberland illustrated with Mr Robert Bensley as Harold.Bell, John, 1745–1831, British theatre (1791), Volume 6, Publisher: J. Bell Year, 1791. Illustrations: Mr Farren, Mr Wroughton, Mrs Siddons, Mrs Farren, Mr Bensley"]}, {"page": "Thomas Knight (actor)", "response": ["In 1787 Knight married at Bath, Margaret Farren, sister of the Countess of Derby (Elizabeth Farren).  "]}, {"page": "Marlborough gem", "response": ["Once in the Marlborough collection, the gem was often redrawn: Giovanni Battista Cipriani painted a version of the gem,Sherwin's engraving after Cipriani, from Jacob Bryant, A New System, or, An Analysis of Ancient Mythology (London, 1775), was illustrated by Jean H. Hagstrum, \"Eros and Psyche: Some Versions of Romantic Love and Delicacy\", Critical Inquiry 3.3 (Spring 1977:521-542) fig. 1. Francesco Bartolozzi engraved it, James Tassie cast it in opaque coloured glass paste,Tassie, Catalogue... pl. xlii. and for Josiah Wedgwood, first William Hackwood reproduced a low relief from Tassie's cast, and then John Flaxman modeled it at a larger scale;Images from Liverpool , Lady Charlotte Schreiber,  The Schreiber collection. Catalogue of English porcelain, earthenware, enamels... (Victoria & Albert Museum), cat. no. 1279 \"Pair of oval plaques\" with Flaxman's  \"Sacrifice to Hymen\" forming the pendant. both versions were executed in Wedgwood & Bentley's white-on-blue jasperware that imitated cameos; the 'Marlborough Gem' first appeared in Wedgwood's 1779 catalogue. The Wedgwood plaque, available in several sizes, appears mounted on Parisian and London furniture, and a marble relief of the scene is set in the chimneypiece of the red drawing room at the original home of the Marlborough gems.A chimneypiece at the Marlborough seat, Blenheim Palace, in Woodstock is carved with a representation of the design. J.Boardman with D. Scarisbrick, C. Wagner and E. Zwierlein-Diehl The Marlborough Gems (Oxford University Press 2009), p.34 It became so familiar that the caricaturist James Gillray engraved a parody of it in 1797, lampooning the long-delayed marriage of Lord Derby to the actress Elizabeth Farren, who is travestied as a tall, lanky veiled figure, who is offered a countess's coronet instead of the winnowing fan of pomegranates, with the plump cherubic Lord Derby at her side. By 1870 the Marlborough collection cataloguer observed, \"the design has been reproduced in all sorts and materials of art, perhaps oftener than any other similar subject.\""]}, {"page": "The Natural Son", "response": ["The original Drury Lane cast included Thomas King as Jack Hustings, William Parsons as Dumps, Robert Bensley as Ruefull, John Moody as Major O'Flaherty, Sophia Baddeley as Sir Jeffrey Latimer, James Wrighten as David, John Palmer as Blushenly, Jane Pope as Miss Phoebe Latimer, Charlotte Tidswell as Penelope and Elizabeth Farren as Lady Paragon.Hogan p.760"]}, {"page": "The Heiress (1786 play)", "response": ["The original Drury Lane cast included Thomas King as Sir Clement Flint, John Palmer as Lord Gayville, William Parsons as Alscrip, Robert Baddeley as Chignon, John Bannister as Mr Blandish, James Aickin as Mr Rightly, Robert Palmer as Prompt, Jane Pope as Mrs Alscrip, Charlotte Tidswell as Tiffany and Elizabeth Farren as Lady Emily.Hogan p.855-56"]}, {"page": "Farren", "response": ["* Elizabeth Farren (c. 1759 – 1829), English actress"]}, {"page": "First Love (play)", "response": ["The original Drury Lane cast included Richard Wroughton as Lord Sensitive, Thomas King as Sir Miles Mowbray, John Palmer as Frederick Mowbray, John Bannister as David, Robert Palmer as Mr Wrangle, Richard Suett as Billy Bustler, Elizabeth Farren as Lady Ruby, Jane Pope as Mrs Wrangle, Charlotte Tidswell as Mrs Kate and Dorothea Jordan as Sabrina Rosny."]}, {"page": "James Fennell", "response": ["Returning to London, he appeared at Covent Garden Theatre 12 October 1787 as Othello, and acted in other plays. Harris, the manager, offered to engage him and pay his forfeit (£200) to Jackson, but he returned to Edinburgh in time for the season of 1788. He worked diligently and conscientiously. He was to play Jaffier in Venice Preserv'd, the part of Pierre being assigned to an actor named Woods. A proposal that the parts should be exchanged led to a riot in the theatre and a bitter controversy, Fennell offering at one point to reveal a 'scene of villainy.' The Edinburgh lawyers took part against him, and addressed a letter to the manager (15 July 1788) signed by Henry Erskine (dean of faculty), and 182 advocates and writers.Appendix to the History of the Scottish Stage Fennell began an action against his persecutors, but ultimately consented to a compromise. He received £500, and his adversaries agreed to take tickets for a benefit. They also invited him to show himself once more on the stage. He appeared accordingly as Othello. He gave one more performance in Edinburgh and went to London. He played Othello 25 Aug. at York, and was, says his employer, Tate Wilkinson, 'well received'.Wandering Patentee, iii. 85 Three days later he enacted Don Felix to the Violente of Elizabeth Farren."]}, {"page": "Samuel Jackson Pratt", "response": ["As well as his poems, novels and 'miscellanies', Pratt drew upon his theatre experience to write ten plays, although three were never performed or published. His first play, Joseph Andrews, was an adaptation of Henry Fielding's novel of the same name, and was acted at Theatre Royal, Drury Lane on 20 April 1778, with the role of Fanny being played by Mary Robinson.Oxford Journals Pratt would eventually write the epitaph for Mary Robinson's tombstone. The play has never been published. His most successful dramatic work was The Fair Circassian, an adaptation of John Hawkesworth's novel Almoran and Hamet, and was first performed at Drury Lane on 27 November 1781. The leading part was written for Pratt's friend, the actress Mrs Siddons, but she was unavailable and the part was played by Elizabeth Farren (later Countess of Derby) instead.  The Fair Circassian was published in many editions, and is still in print today.Amazon's page for this play His 1783 comedy The School for Vanity was also staged at Drury Lane."]}, {"page": "Elizabeth Warren (disambiguation)", "response": ["* Elizabeth Farren (c. 1759–1829), Irish actress"]}, {"page": "List of women in the Heritage Floor", "response": ["| Elizabeth Farren"]}, {"page": "Elizabeth Farren, Countess of Derby", "response": ["#REDIRECT Elizabeth Farren"]}, {"page": "Eliza Farren", "response": ["#redirect Elizabeth Farren"]}, {"page": "John Jones (engraver)", "response": ["* Elizabeth Farren and Thomas King as Sir Peter and Lady Teazle, after John Downman; "]}, {"page": "Elizabeth Smith-Stanley, Countess of Derby", "response": ["Five years after the marriage, Lady Derby embarked in a very public affair with the 3rd Duke of Dorset. She eventually separated from her husband, which caused a scandal and led to her effective exile from society, especially after it was learned that she would not be marrying the Duke. Lady Derby moved abroad, only returning once her husband attracted embarrassing press attention for his very public relationship with the actress Elizabeth Farren, whom he married soon after Lady Derby's death in 1797.", "During this period, Lord Derby began a high-profile – but unconsummated – relationship with the actress Elizabeth Farren. From 1781 onwards, the affair was much caricatured in the press, with Derby being comically described as a desperate man unable to convince Farren to a private audience. Amidst this attention, Lady Derby quietly returned to London and gradually began appearing at events, later moving in with her brother the 8th Duke of Hamilton. By 1784, she was accepted in society enough to again be seen accompanying the Duchess of Devonshire. According to historian Hannah Greig, it appears that Lady Derby's social fate was tied to her estranged husband's – as Lord Derby's social capital decreased, hers went up."]}, {"page": "James Nixon (painter)", "response": ["thumb|Portrait of Elizabeth Farren (1759–1829), later Countess of Derby, c.1780, miniature by James Nixon", "Nixon painted Elizabeth Farren and other theatrical celebrities, as well as figures of Shakespearean characters. He sent some portraits in oil to the Royal Academy, and in 1786 a series of ten designs illustrating Tristram Shandy. His portraits of Dr. Francis Willis, the Duchess of Devonshire, Elizabeth Hartley, and the sisters Jenny and Nelly Bennet were engraved."]}]}}