{"wiki_id": "http://www.wikidata.org/entity/Q5365899", "itemLabel": "Ellis Harrison", "itemDescription": "Welsh association football player (born 1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ellis_Harrison", "wikipedia_page": {"main": "Ellis Wade Harrison (born 29 January 1994) is a Welsh professional footballer who plays as a centre-forward for Fleetwood Town.\nHe previously made 185 Football League appearances for Bristol Rovers, 17 for Ipswich Town and also played for Hartlepool United and for Wales at under-21 level.", "link_mentions": [{"page": "Bristol Rovers F.C.", "response": ["The Bristol Rovers Academy currently operates at The City Academy Bristol and Sir Bernard Lovell School. Current first-team squad members Cameron Hargreaves, Alfie Kilgour and Luca Hoole both graduated from the Academy to earn professional contracts. In May 2021, U16s player Kyrie Pierre joined Aston Villa for an undisclosed six-figure fee, a record fee received by the Academy for a player.  Perhaps the most successful former member of the academy is Scott Sinclair, who was signed by Chelsea in 2005 for £200,000, with further payments to the club possible, depending on performance. He currently plays for Championship club Preston North End. Other former Academy players currently contracted to teams in the Premier League or English Football League include Ryan Broom (Plymouth Argyle), Ellis Harrison (Fleetwood Town), Chris Lines (Stevenage), Tom Lockyer (Luton Town), Matt Macey (Hibernian) and Ollie Clarke (Mansfield Town)."]}, {"page": "Darrell Clarke", "response": ["In June 2017, Clarke signed a new five-year contract. He was named as EFL manager of the week after overseeing a 6–0 win away at Northampton Town on 7 October despite missing his preferred centre-backs. However speaking later in December he said he felt \"let down\" by the club for its wage policy and infrastructure, saying they were \"30 years behind\" other clubs. He further admitted some of his players were struggling with the increased expectations following recent successes, though Rovers still managed to end the 2017–18 campaign in 13th-place. Billy Bodin was sold to Preston North End for an undisclosed fee in January 2018. In June 2018 he graduated with the FA's highest coaching qualification (FA Level 5 UEFA Pro). The following month he sold forward Ellis Harrison to Ipswich Town for an undisclosed fee believed to be in the region of £750,000. He left his post on 13 December 2018 following a run of seven defeats in ten matches; at the time of his departure he was the fourth-longest serving manager in the EFL."]}, {"page": "Harrison (name)", "response": ["*Ellis Harrison (born 1994), English footballer"]}, {"page": "List of people from Newport", "response": ["* Ellis Harrison"]}, {"page": "Lee Brown (footballer)", "response": ["Brown started on the opening day of the 2017–18 season in a 1–0 defeat to Charlton Athletic. He also played the following Tuesday in a 4–1 EFL Cup victory over Cambridge United in which he got two assists; a 40-yard pass to Billy Bodin for the first goal and a delightful cross to Ellis Harrison for the third goal. Following the 1–1 draw with Wigan Athletic, it was confirmed that Brown would leave Rovers at the end of the season, having made over 321 appearances for the club, in order to be closer to London. Manager Darrell Clarke confirmed his last game, the forthcoming home fixture with Gillingham, would see Brown take the captain's armband."]}, {"page": "2010–11 Bristol Rovers F.C. season", "response": ["|align=\"left\"|42||align=\"left\"|FW||align=\"left\"| Ellis Harrison"]}, {"page": "Billy Bodin", "response": ["Bodin did not score in the 2016–17 season until 26 November when he scored a volley in a 3–2 defeat to Chesterfield. By the turn of the year he was on 4 goals thanks to a Boxing Day hat trick in a 4–1 victory over Coventry City. All scored with his left foot he scored a screamer from the edge of the box into the far top corner, a long shot from 25 yards and completed his hattrick with a penalty. He kicked off 2017 in style with a screamer at the hands of Northampton Town during a 5–0 thrashing. Picking the ball up 30 yards from goal, Bodin chopped past the defender before unleashing a rising shot off of his weaker right foot into the top corner giving Adam Smith no chance. The goal was overshadowed however by teammate Ellis Harrison scoring 4 goals."]}]}}