{"wiki_id": "http://www.wikidata.org/entity/Q5372175", "itemLabel": "Emily Gerard", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Emily_Gerard", "wikipedia_page": {"main": "(Jane) Emily Gerard (7 May 1849 – 11 January 1905) was a Scottish 19th-century author best known for the influence her collections of Transylvanian folklore had on Bram Stoker's 1897 novel Dracula.", "link_mentions": [{"page": "Transylvania", "response": ["Following the publication of Emily Gerard's The Land Beyond the Forest (1888), Bram Stoker wrote his gothic horror novel Dracula in 1897, using Transylvania as a setting. With its success, Transylvania became associated in the English- and Spanish-speaking world with vampires. Since then it has been represented in fiction and literature as a land of mystery and magic. For example, in Paulo Coelho's novel The Witch of Portobello, the main character, Sherine Khalil, is described as a Transylvanian orphan with a Romani mother, in an effort to add to the character's exotic mystique. The so-called Transylvanian trilogy of historical novels by Miklós Bánffy, The Writing on the Wall, is an extended treatment of the 19th- and early 20th-century social and political history of the country. Among the first actors to portray Dracula in film was Bela Lugosi, who was born in Lugos (now Lugoj), in present-day Romania."]}, {"page": "Vampire", "response": ["Drawing on past works such as The Vampyre and Carmilla, Stoker began to research his new book in the late 19th century, reading works such as The Land Beyond the Forest (1888) by Emily Gerard and other books about Transylvania and vampires. In London, a colleague mentioned to him the story of Vlad Ţepeş, the \"real-life Dracula\", and Stoker immediately incorporated this story into his book. The first chapter of the book was omitted when it was published in 1897, but it was released in 1914 as \"Dracula's Guest\".Marigny, pp. 82–85. Many experts believe, this deleted opening was based on the Austrian princess Eleonore von Schwarzenberg."]}, {"page": "Airdrie, North Lanarkshire", "response": ["*Emily Gerard – writer, whose works inspired Bram Stoker's Dracula and coined the term Nosferatu"]}, {"page": "Crossroads (folklore)", "response": ["In the 1885 historical essay Transylvanian Superstitions, Emily Gerard describes how crossroads were often avoided as a matter of course, and describes a Romanian belief that a demon could be summoned at a crossroad by drawing a magic circle, offering copper coin as payment, and reciting an incantation.http://www.gutenberg.org/cache/epub/52165/pg52165.txt"]}, {"page": "Vlad the Impaler", "response": ["The stories about Vlad made him the best-known medieval ruler of the Romanian lands in Europe. However, Bram Stoker's Dracula, which was published in 1897, was the first book to make a connection between Dracula and vampirism. Stoker had his attention drawn to the blood-sucking vampires of Romanian folklore by Emily Gerard's article about Transylvanian superstitions (published in 1885). His limited knowledge about the medieval history of Wallachia came from William Wilkinson's book entitled Account of the Principalities of Wallachia and Moldavia with Political Observations Relative to Them, published in 1820."]}, {"page": "Scholomance", "response": ["An early source on the Scholomance and Dracula folklore was the article \"Transylvanian Superstitions\" (1885), written by Scottish expatriate Emily Gerard. It has been established for certain this article was an important source that Bram Stoker consulted for his novel, Dracula. Gerard also published similar material in Land Beyond the Forest (1888), which Stoker might have also read, and other commentators stated this was Bram Stoker's direct source for Scholomance in his novel.", "A mistaken idea that \"Scholomance\" was a neologism first reported in 1885 by Emily Gerard was at one time current in English-speaking circles.    The terms \"Scholomance\" and \"Scholomonariu\" appear in the Austrian journal Österreichische Revue in 1865.; reissued: "]}, {"page": "Solomonari", "response": ["Emily Gerard later wrote on the topic of \"Scholomance\", although she only referred to its attendees as \"scholars\", and did not specifically employ the term Solomanari or the equivalent."]}, {"page": "Nosferatu (word)", "response": ["The etymological origins of the word nosferatu are difficult to determine. There is no doubt that it achieved currency through Bram Stoker's 1897 novel Dracula and its unauthorised cinematic adaptation, Nosferatu (1922). Stoker identified his source for the term as 19th-century British author and speaker Emily Gerard. It is commonly thought that Gerard introduced the word into print in an 1885 magazine article, \"Transylvanian Superstitions\", and in her travelogue The Land Beyond the Forest (\"Transylvania\" is Latin for \"beyond the forest\", literally \"across/through the forest\"). She merely refers to it as the Romanian word for vampire: "]}, {"page": "Gerard", "response": ["*Emily Gerard (1849–1905), Scottish author"]}, {"page": "Emily (given name)", "response": ["* Emily Gerard (1849–1905), British author"]}, {"page": "Madame de Lasziwska", "response": ["#REDIRECT Emily Gerard"]}, {"page": "Chesters (estate)", "response": ["Emily Gerard, a writer who inspired Bram Stoker's Dracula, was born here in 1849."]}, {"page": "John Robison (inventor)", "response": ["He married twice, firstly in 1816 to Jean Grahame who died in 1824 and secondly to Miss Benson who died in 1837. His granddaughters were the novelists Emily Gerard (1849-1905) and Dorothea Gerard (1855-1915)."]}, {"page": "Never Mind the Balkans, Here's Romania", "response": ["Some reviewers described the author as 'a British Ion Luca Caragiale', and one perceived a direct link to foreign travel writers of previous centuries in Romania, such as John Paget, James Henry Skene, Emily Gerard and Sacheverell Sitwell. Another likened Ormsby's style to that of a portrait artist, and, in terms of contemporary peers, he was compared to Irish writer Philip Ó Ceallaigh. However, one journalist suggested that the book represents an indictment of Romania by a foreign guest. General public response to the book was positive, at home and abroad. Three of Ormsby's stories were subsequently included in the 2011 anthology Bucharest Tales, published by New Europe Writers."]}, {"page": "Dorothea Gerard", "response": ["Dorothea Mary Stanislaus Gerard (Mme Longard de Longgarde, 9 August 1855 – 29 September 1915) was a Scottish-born novelist and romance-writer who often wrote about controversial and unconventional subjects and \"whose general conservatism co-existed with a piercing eye for relations across national and ethnic divides, for antisemitism and other forms of prejudice.\" At first she wrote for pleasure with her less prolific older sister Emily Gerard but later carved an independent career publishing about forty books between 1890 and 1916 mostly for Tauchnitz editions signifying her target audience was mainly English-speaking visitors travelling in Europe.John Sutherland, The Stanford Companion to Victorian Fiction, Stanford University Press (1989) - Google Books pgs. 242-243", "Dorothea Gerard was born in 1855 at Rochsoles House in New Monkland, Lanark, Scotland, the youngest daughter of Colonel Archibald Gerard (1812–1880) of Rochsoles, Lanarkshire, and Euphemia Erskine née Robison (1818–1870), the oldest daughter of the renowned inventor Sir John Robison (1778–1843). She had three sisters and three brothers including General Sir Montagu Gilbert Gerard (1842–1905). Dorothea Gerard was also descended from Alexander Gerard (1728–1795) a philosophical writer, Archibald Alison (1757–1839) a Scottish Episcopalian minister and writer, and Gilbert Gerard (1760–1815) a minister of the Church of Scotland and theological writer. Her sister Emily Gerard born in 1849 at Chesters, Jedburgh, Roxburghshire, Scotland was also a novelist, and the two collaborated on several novels.  The family background was originally Scottish Episcopalian, but when their mother converted to Catholicism in 1848 her children were raised as Catholic.", "==Collaboration with Emily Gerard==", "In 1877 Dorothea began to write novels, with her first major work being a collaboration with her sister Emily Gerard under the joint pseudonym E. D. Gerard. Reata; or What's in a Name (1880) concerned a Mexican girl's attempts to adapt to European customs and was published in Blackwood’s Magazine. Three subsequent novels published by the pair in the same magazine were Beggar My Neighbour (1882), The Waters of Hercules (1885), and A Sensitive Plant (1891). Referring to one of their joint novels, The Saturday Review called them \"one of the most fascinating of our lady novelists.\"Vesna Goldsworthy, Inventing Ruritania: The Imperialism of the Imagination, Yale University Press (1998) – Google Books pg. 61", "===As E. D. Gerard with her sister Emily Gerard==="]}]}}