{"wiki_id": "http://www.wikidata.org/entity/Q5374806", "itemLabel": "Emrys Jones", "itemDescription": "British actor (1915-1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Emrys_Jones_(actor)", "wikipedia_page": {"main": "John Emrys Whittaker Jones (22 September 1915 – 10 July 1972) was an English actor.After making his stage debut in Donald Wolfit's company in 1937; his film debut came in Powell and Pressburger's One of Our Aircraft Is Missing in 1942, and he began to develop a career in the British cinema of the 1940s. Due to his boyish looks he would often be cast as young innocents in films such as: The Wicked Lady (1945); The Rake's Progress (1945); Nicholas Nickleby (1947); and Powell and Pressburger's The Small Back Room (1949).When he was relegated to second features in the 1950s he concentrated on his stage career, maturing into an accomplished character actor in the process. The latter half of his career was mostly spent on television in such programmes as Softly, Softly; Out of the Unknown; Dixon of Dock Green; Doomwatch; Z-Cars; and perhaps most memorably as 'The Master of the Land of Fiction' in the Doctor Who serial, The Mind Robber.He was successively married to actresses Pauline Bentley and Anne Ridler, and died of a heart attack in Johannesburg, South Africa in 1972; where he was in a stage production, playing Winston Churchill.", "link_mentions": [{"page": "Robbie Ross", "response": ["* In films he was portrayed by Dennis Price in Oscar Wilde (1960), Emrys Jones in The Trials of Oscar Wilde (1960), Michael Sheen in Wilde (1997), and by Edwin Thomas in The Happy Prince (2018)."]}, {"page": "Bettina Welch", "response": ["Her other stage roles include Australian productions of Harvey with Joe E. Brown, Simon and Laura and The Deep Blue Sea with Googie Withers and John McCallum, the lead role opposite Emrys Jones in Double Image, and a featured role with Sir Robert Helpmann in Nude with Violin by Noël Coward.  "]}, {"page": "The Wicked Lady", "response": ["Barbara learns of a planned gold shipment from a former tenant farmer of Skelton's, Ned Cotterill (Emrys Jones), who will be one of the guards. Jackson is against the idea of hijacking the gold, as the coach will have double the usual protection, but Barbara talks him into it. The robbery does not go smoothly. When Cotterill pursues them, Barbara shoots at his horse and kills Cotterill by accident. Her conscience is not disturbed for long.", "*Emrys Jones as Ned Cotterill"]}, {"page": "Doomwatch", "response": ["Cast: John Paul as Dr Spencer Quist, Simon Oates as Dr John Ridge, Robert Powell as Tobias Wren, Joby Blanshard as Colin Bradley, Emrys Jones as Colonel Smithson, Jeremy Young as Vincent Llewellyn, Ray Mort as Jones, Edward Evans as Dai, Michael Newport as Bryn, David Davies as Davies, Eliza Ward as Elizabeth Llewellyn, Mary Hignett as Mrs. Adams, Jay Neill as Laing."]}, {"page": "Theatre 625", "response": ["|Gwen Ffrangcon-Davies,Gerald James,Meg Wynn Owen,Emrys Jones,Pauline Delaney,John Rees,Charles Williams,Sheila Irwin,Willie Jonah,Ilario Bisi-Pedro"]}, {"page": "One of Our Aircraft Is Missing", "response": ["* Emrys Jones as Bob Ashley, wireless operator", "The actors that were gathered for the film included recognised stage and screen talents such as Eric Portman, Hugh Williams and Godfrey Tearle as well as newcomers such as Peter Ustinov making his film debut. Although mainly centred on male roles, Powell encouraged Pressburger to create a number of significant female characters. The result were strong, credible roles for both Pamela Brown and Googie Withers as female Dutch Resistance leaders.Arthur, Nigel. \"...One of Our Aircraft is Missing (1942).\" BFI Screenonline, 13 February 2012. Retrieved: 18 May 2012. The main leads, Hugh Burden, Eric Portman, Hugh Williams, Emrys Jones, Bernard Miles, and Godfrey Tearle, formed the crew of \"B for Bertie\" and introduced themselves and their characters' positions on board the bomber in a progressive sequence that was filmed, like most of the aircraft interiors, in a Vickers Wellington \"shell\" supplied by the RAF, with working features such as lighting and electrically powered turrets.Powell 1986, p. 393."]}, {"page": "The Small Back Room", "response": ["* Emrys Jones as Joe"]}, {"page": "The Listerdale Mystery", "response": ["The stage adaptation was further adapted into two TV plays - one in 1938 and another in 1947. It was also later adapted into a TV movie version, starring Emrys Jones, which aired on BBC TV on 26 December 1958."]}, {"page": "The Mind Robber", "response": ["The serial is set outside of time and space in a world where fictional characters and mythological creatures including Medusa and the Minotaur exist. In the serial, the English fiction writer \"the Master\" (Emrys Jones) tries to recruit the time traveller the Second Doctor (Patrick Troughton) to replace the Master's role as the creative power in this realm because of the Master's advancing age."]}, {"page": "The Trials of Oscar Wilde", "response": ["*Emrys Jones as Robbie Ross"]}, {"page": "The History of Mr Polly", "response": ["A film version of the same name was made in 1949 by Anthony Pellisier, with John Mills as Polly. It was adapted by the BBC as a six-part television serial shown between 28 August – 10 October 1959, with Emrys Jones as Polly, and again as a five-part adaptation starring Andrew Sachs, shown between 2 and 30 March 1980. The 1959 version no longer exists. A feature-length version, starring Lee Evans was shown on ITV in May 2007."]}, {"page": "1972 in Wales", "response": ["*10 July – Emrys Jones, actor, 56 (heart attack)"]}, {"page": "Miss Pilgrim's Progress", "response": ["*Emrys Jones as The Vicar"]}, {"page": "Three Cases of Murder", "response": ["* Emrys Jones as George Wheeler (\"You Killed Elizabeth\" segment)"]}, {"page": "The Life and Adventures of Nicholas Nickleby (1947 film)", "response": ["*Emrys Jones as Frank Cheeryble "]}, {"page": "List of British films of 1949", "response": ["|Blue Scar || Jill Craigie || Emrys Jones, Gwynneth Vaughan || Drama ||", "|Dark Secret||Maclean Rogers||Dinah Sheridan, Emrys Jones||Crime||"]}, {"page": "List of British films of 1953", "response": ["|Deadly Nightshade||John Gilling||Emrys Jones, Zena Marshall||Crime||"]}, {"page": "List of British films of 1961", "response": ["|  Ticket to Paradise || Francis Searle || Emrys Jones, Patricia Dainton || Romance ||"]}, {"page": "List of British films of 1962", "response": ["|Serena||Peter Maxwell||Patrick Holt, Emrys Jones, Honor Blackman||Crime||"]}, {"page": "Ghost Squad (TV series)", "response": ["* 51.  Hideout: Also features Emrys Jones and John Boyd-Brent."]}, {"page": "Emrys Jones, actor", "response": ["#REDIRECT Emrys Jones (actor)"]}, {"page": "Holiday Camp (film)", "response": ["*Emrys Jones as Michael Halliday"]}, {"page": "Emrys", "response": ["*Emrys Jones (geographer), Professor of Geography at the London School of Economics", "*Emrys Jones (actor) (1915–1972), English actor"]}, {"page": "The Hunchback of Notre Dame (1966 TV series)", "response": ["* Emrys Jones as Charmolue"]}, {"page": "List of Royal Variety Performances", "response": ["| Tommy Trinder, Latona, Graham and Chandel, The Victoria Palace Boys and Girls, Dave King and Julia Channing, The Crazy Gang, Ruby Murray, Benny Hill with Olivia Dale, Jeremy Hawk and Ronnie Brody, Patricia Kirkwood with Robert Beatty, Douglas Byng, George Carden, Walter Crisham, John Gregson, Bobby Howes, Hugh McDermott, Terence Morgan and Brian Reece, Cyril Stapleton with the BBC Show Band and The Stargazers, Lena Horne, John Warner, Eleanor Drew, Dorothy Reynolds, Newton Blick, Yvonne Coulette, James Cairncross, Michael Meacham, Christine Finn, Michael Aldridge, Pat Heywood, Joseph Greig, Bob Harris, Johnnie Ray, Robert Dhery, Colette Brosset, Jacques Legras, Christian Duvalein, Pierre Olaf and Company, Alfred Drake, George Jessel, Doretta Morrow and Company, Leslie Henson, Jimmy Edwards, Richard Attenborough, Diana Dors, Edmund Willard, Bruce Seton, Emrys Jones, Lupino Lane, The Chinese Classical Theatre Company, Moscow State Folk Dance Company. Channing Pollock"]}, {"page": "List of acts that have appeared on the Royal Variety Performance", "response": ["*Emrys Jones: 1955 (London)"]}, {"page": "Give Me the Stars", "response": ["* Emrys Jones - Jack Ross"]}, {"page": "Beware of Pity", "response": ["*Emrys Jones as Lt. Joszi Molnar"]}, {"page": "Blue Scar", "response": ["Olwen Williams (Gwyneth Vaughan) is a miner's daughter from a mining town in South Wales, where the mine has recently been nationalised. She is keen to move on from her impoverished upbringing to a more fulfilling lifestyle. An opportunity is presented to her when she wins a singing scholarship to a music college in Cardiff. She decides to leave her hometown to take up this opportunity, which means being away from Tom Thomas (Emrys Jones), a local miner who is in love with her."]}, {"page": "Emrys Jones", "response": ["Emrys Jones may refer to:", "* Emrys Jones (actor) (1915–1972), English actor", "* Emrys Jones (literary scholar) (1931–2012), English academic", "* Emrys Jones (geographer) (1920–2006), geographer and urban planner", "* Emrys Jones (drama professor) (1905–1973), professor of drama who had worked aboard vessels in Canada's north, in his youth"]}, {"page": "Serena (1962 film)", "response": ["Serena is a 1962 black-and-white, British B film crime thriller directed by Peter Maxwell and stars Patrick Holt, Emrys Jones and Honor Blackman. The title of the film is the name of one of the characters, Serena Vaughan, who may have figured in a murder.\"Film details: 'Serena (1962).\" British Film Institute. Retrieved: 29 August 2016. Serena was part of a double bill and was later released to the home media market with Impact (1963), also directed by Peter Maxwell.\"DVD: Impact/Serena.\" Amazon. Retrieved: 29 August 2016.", "Detective Chief Inspector Gregory (Patrick Holt) from Scotland Yard, and his partner, Sergeant Conway (Bruce Beeby), are called in to investigate the shotgun murder of a woman at Rosehill Cottage, a remote Surrey cottage. The victim appears to be Ann Rogers (Honor Blackman), the wife of womanising artist Howard Rogers (Emrys Jones). Her face, however, is so badly disfigured by the two shotgun blasts, it is hard to be sure of her identity. Rogers looks for a birthmark that would positively prove the body belongs to his wife, but it is not there. ", "* Emrys Jones as Howard Rogers "]}, {"page": "Dial M for Murder (Sunday Night Theatre)", "response": ["*Emrys Jones as Tony Wendice"]}, {"page": "Deadly Nightshade (film)", "response": ["Deadly Nightshade is a 1953 British crime drama film directed by John Gilling. It stars Emrys Jones, Zena Marshall and John Horsely. A convict on the run (Emrys Jones) switches identities with a lookalike, only to find himself in even deeper trouble.", "*Emrys Jones as Matthews / Barlow"]}, {"page": "James Bernard (elocutionist)", "response": ["Bernard had early ambitions for the stage. Interviewed in 1936, he said: 'It has been my fate, to be always associated with the stage but not on it. I have never fulfilled my early ambition, but I have taught many other people who have been successful.’Manchester Evening News, August 13, 1936. His role was to teach others and to fashion their early careers through his many friends and contacts in the theatre world. Those of his students who achieved success on the London stage included Reginald Tate (Prof. Bernard Quatermass in the BBC’s 1953 'The Quatermass Experiment'), David Olive, Veronica Turleigh, Emrys Jones, and Robert Donat.‘Robert Donat Papers’. Letter Nov 12, 1942 (Bernard to Donat) written on the back of an article from The Country House and Estate, December 1925, ‘Month in the Dramatic World’."]}, {"page": "This Was a Woman", "response": ["This Was a Woman is a 1948 British crime film directed by Tim Whelan and starring Sonia Dresdel, Walter Fitzgerald and Emrys Jones.Keaney p.200 It was made at the Riverside Studios with sets designed by the art directors Ivan King and Andrew Mazzei. Based on a successful play by former film actress Joan Morgan, its plot concerns an outwardly respectable family dominated by a murderous matriarch."]}, {"page": "Dark Secret (film)", "response": ["Dark Secret is a 1949 British crime film directed by Maclean Rogers and starring Dinah Sheridan, Emrys Jones and Irene Handl.Chibnall & McFarlane p.65 It was a remake of the 1933 film The Crime at Blossoms, also directed by Rogers.", "* Emrys Jones as Chris Merryman  "]}, {"page": "Ticket to Paradise (1961 film)", "response": ["Ticket to Paradise is a 1961 British romance film directed by Francis Searle and starring Emrys Jones, Patricia Dainton and Vanda Hudson.Gifford p.696", "* Emrys Jones as Jack Watson "]}]}}