{"wiki_id": "http://www.wikidata.org/entity/Q5372428", "itemLabel": "Emily Williamson", "itemDescription": "Co-Founder of the RSPB", "wikipedia_url": "https://en.wikipedia.org/wiki/Emily_Williamson", "wikipedia_page": {"main": "Emily Williamson, née Bateson (17 April 1855 – 12 January 1936), was an English philanthropist. She was co-founder of the Royal Society for the Protection of Birds (RSPB) with Eliza Phillips in 1891. The society started as the Plumage League; it became the Society for the Protection of Birds, and was granted 'Royal' status in 1904. In 1891 she also established the Gentlewomen's Employment Association in Manchester.", "link_mentions": [{"page": "Victorian era", "response": [";1889: Emily Williamson founds the Royal Society for the Protection of Birds."]}, {"page": "Royal Society for the Protection of Birds", "response": ["* The Plumage League was founded by Emily Williamson at her house in Didsbury, Manchester, as a protest group campaigning against the use of great crested grebe and kittiwake skins and feathers in fur clothing. The house is now in Fletcher Moss Botanical Garden."]}, {"page": "Princess Helena of the United Kingdom", "response": ["Helena was devoted to nursing, and took the lead at the charitable organisations she represented. She was also an active campaigner, and wrote letters to newspapers and magazines promoting the interests of nurse registration. Her royal status helped to promote the publicity and society interest that surrounded organisations such as the Royal British Nurses' Association. The RBNA still survives today with Aubrey Rose as president. Emily Williamson founded the Gentlewomen's Employment Association in Manchester; one of the projects which came out of this group was the Princess Christian Training College for Nurses, in Fallowfield, Manchester."]}, {"page": "Didsbury", "response": ["*Emily Williamson, a pioneer of wildlife protection, was a resident of Didsbury from 1882 to 1912. She founded the Plumage League in 1889 and went on to co-found the Royal Society for the Protection of Birds (RSPB) in 1904. In 1989 a plaque was placed on her former home, the Croft, to honour the centenary of the organisation, although it did not actually mention Williamson by name.https://www.rspb.org.uk/about-the-rspb/about-us/media-centre/press-releases/made-in-manchester--commemorative-plaque-unveiled-for-rspb-founder/"]}, {"page": "Environmentalism", "response": ["These ideas also inspired various environmental groups in the UK, such as the Royal Society for the Protection of Birds, established in 1889 by Emily Williamson as a protest group to campaign for greater protection for the indigenous birds of the island. The Society attracted growing support from the suburban middle-classes as well as support from many other influential figures, such as the ornithologist Professor Alfred Newton. By 1900, public support for the organisation had grown, and it had over 25,000 members. The Garden city movement incorporated many environmental concerns into its urban planning manifesto; the Socialist League and The Clarion movement also began to advocate measures of nature conservation.Gould, (1988) pp. 16, 23–24, 36–38, 84–86."]}, {"page": "Wildlife management", "response": ["The Royal Society for the Protection of Birds was founded as the Plumage League in 1889 by Emily Williamson at her house in Manchester as a protest group campaigning against the use of great crested grebe and kittiwake skins and feathers in fur clothing. The group gained popularity and eventually amalgamated with the Fur and Feather League in Croydon to form the RSPB. The Society attracted growing support from the suburban middle-classes as well as support from many other influential figures, such as the ornithologist Professor Alfred Newton."]}, {"page": "Brook, Surrey", "response": ["Brook was home to Emily Williamson, co-founder of the RSPB, from 1912 to 1931, as well as Asif Zardari, and his wife the former Pakistan Premier Benazir Bhutto, who bought the Rockwood Estate in 1995."]}, {"page": "Fletcher Moss Botanical Garden", "response": ["Robert Williamson's old house, the Croft, was the location of the first meeting of the organisation later to become known as the Royal Society for the Protection of Birds (RSPB).  In 1889, Emily Williamson née Bateson (Robert's wife) formed a group called the \"Plumage League\" to protest against the breeding of birds for plumage to be used in women's hats, a highly fashionable practice at the time. The group gained popularity and eventually amalgamated with \"The Fur, Fin and Feather Folk\" in Croydon, and formed the RSPB."]}, {"page": "Williamson (surname)", "response": ["* Emily Williamson (1855–1936), English philanthropist"]}, {"page": "Women and animal advocacy", "response": ["In 1889 in England, the Plumage League was founded by Emily Williamson, at her house, as a protest group campaigning against the use of great crested grebe and kittiwake skins and feathers in fur clothing. Also in 1889 the Fur, Fin and Feather Folk (an animal rights group) was founded in England by Eliza Phillips, Etta Lemon, Catherine Hall, Hannah Poland and others. The groups gained in popularity and amalgamated in 1891 to form the Society for the Protection of Birds in London. The Society gained its Royal Charter in 1904. The original members of the Society were all women who campaigned against the fashion of the time for women to wear exotic feathers in hats, and the consequent encouragement of \"plume hunting\"."]}, {"page": "Etta Lemon", "response": ["Margaretta \"Etta\" Louisa Lemon  ( Smith; 22 November 1860 – 8 July 1953) was a British bird conservationist and a founding member of what is now the Royal Society for the Protection of Birds (RSPB). She was born into an evangelical Christian family in Kent, and after her father's death she increasingly campaigned against the use of plumage in hatmaking, which had led to billions of birds being killed for their feathers. She founded the Fur, Fin and Feather Folk with Eliza Phillips in Croydon in 1889, which two years later merged with Emily Williamson's Manchester-based Society for the Protection of Birds (SPB), also founded in 1889. The new organisation adopted the SPB title, and the constitution for the merged society was written by Frank Lemon, who became its legal adviser. Etta married Frank Lemon in 1892, and as Mrs Lemon she became the first honorary secretary of the SPB, a post she kept until 1904, when the society became the RSPB.", "The Fur, Fin and Feather Folk society merged in 1891 with the Society for the Protection of Birds (SPB), also founded in 1889 by philanthropist Emily Williamson at Didsbury, Manchester. The SPB was also all-female, and had similar objectives and the same subscription rate. The amalgamation was brokered by the Royal Society for the Prevention of Cruelty to Animals (RSPCA) which did not itself wish to take up the plumage cause; as a moderate mainstream organisation, it was politic for it to keep some distance from what was seen as an extremist movement.Boase (2021) p.66. Although the new organisation adopted the SPB title, in practice the London group provided most of its administration. The constitution for the newly merged society was written by Frank Lemon, who also served as its legal advisor. Etta married Lemon in 1892, and as Mrs Lemon she became the first honorary secretary, a post she kept until 1904. In 1898 she was elected a Fellow of the Zoological Society of London."]}, {"page": "Robert Wood Williamson", "response": ["From 1879 to 1908 he worked as a Manchester solicitor. In 1882 he married Emily Williamson, co-founder of the Royal Society for the Protection of Birds. He was president of Manchester Law Society, and a Member of the Council of the London Law Society in 1902. From 1903 to 1910 he was a member of the Court of Governors of Victoria University of Manchester. "]}, {"page": "Eliza Phillips", "response": ["After the loss of her second husband in 1885, Phillips made a central contribution to the history of the protection of bird life in Britain. The focus of these groups was opposition to the use of bird feathers in ladies' fashions and the plumage trade. The Society for the Protection of Birds was formed by the 1891 amalgamation of The Plumage League, an anti-plumage group based in Didsbury, Manchester, run by Emily Williamson and the ‘Fur, Fin and Feather Folk’ whose afternoons meetings were established in 1889 at Phillips's house with Catherine Hall, Hannah Poland and other women, in Croydon. Phillips became head of publications. "]}, {"page": "Wildlife law in England and Wales", "response": ["The Royal Society for the Protection of Birds was founded as the Plumage League in 1889 by Emily Williamson at her house in Manchester as a protest group campaigning against the use of great crested grebe and kittiwake skins and feathers in fur clothing. The group gained popularity and eventually amalgamated with the Fur and Feather League in Croydon to form the RSPB. The Society attracted growing support from the suburban middle-classes as well as support from many other influential figures, such as the ornithologist Professor Alfred Newton."]}]}}