{"wiki_id": "http://www.wikidata.org/entity/Q5372860", "itemLabel": "Emma Jane Guyton", "itemDescription": "Novelist and editor", "wikipedia_url": "https://en.wikipedia.org/wiki/Emma_Jane_Guyton", "wikipedia_page": {"main": "Emma Jane Guyton or Worboise (née Worboys; 1825–1887) was an English novelist, biographer and editor. Her more than 50 novels feature strong Christian values and were popular in their time.", "link_mentions": [{"page": "1887 in literature", "response": ["*August 25 – Emma Jane Guyton (Worboise), English novelist and magazine editor (born 1825)"]}, {"page": "1825 in literature", "response": ["*April 20 – Emma Jane Guyton (Worboise), English novelist and magazine editor (died 1887)"]}, {"page": "Thomas Arnold", "response": ["The Life of Doctor Arnold, published two years after his death by one of Arnold's former pupils, Arthur Penrhyn Stanley, is seen as one of the best works of its class in the language and added to his growing reputation. A popular life of Arnold by the novelist Emma Jane Guyton also appeared.Emma Jane Worboise [Guyton], The Life of Thomas Arnold D. D., London, 1859. In 1896 his bust was unveiled in Westminster Abbey alongside that of his son, Matthew. The Times asserted, \"As much as any who could be named, Arnold helped to form the standard of manly worth by which Englishmen judge and submit to be judged.\" However, his reputation suffered as one of the Eminent Victorians in Lytton Strachey's book of that title published in 1918."]}, {"page": "Clevedon", "response": ["*Emma Jane Guyton (1825–1887, born Worboise), novelist and editor, died in Clevedon.ODNB entry: Retrieved 20 July 2011. Subscription required. "]}, {"page": "Mrs Etherington Guyton", "response": ["#REDIRECT Emma Jane Guyton"]}, {"page": "Emma Jane Worboise", "response": ["#REDIRECT Emma Jane Guyton"]}, {"page": "Emma Worboise", "response": ["#REDIRECT Emma Jane Guyton"]}, {"page": "Emma Guyton", "response": ["#REDIRECT Emma Jane Guyton"]}, {"page": "Guyton (disambiguation)", "response": ["*Emma Jane Guyton, English novelist and editor"]}, {"page": "Literature of Birmingham", "response": ["Protestant religion remained a theme common to much of Birmingham's literary output during the 19th century. John Inglesant – the \"philosophical romance\" that was the first and best-known work of the Birmingham novelist Joseph Henry Shorthouse – became a publishing triumph in the atmosphere of highly charged religious controversy of the 1880s, seeing its author \"fêted throughout the literary world\", the object of admiration from writers as varied as Charlotte Mary Yonge, T. H. Huxley and Edmund Gosse, and the subject of an invitation to breakfast at 10 Downing Street by William Gladstone. The result of 30 years of study and over 10 years of writing, the novel told the story of a 17th-century English soldier and diplomat, his travels through England and Italy and his excursions through the principal religious philosophies of the time – Puritanism, Anglicanism, Roman Catholicism, Quietism and Humanism – as a recreation of Shorthouse's own intellectual journey from Quakerism to the Church of England . Shorthouse wrote four other novels and a book of short stories over subsequent years, all of which catalogued their protagonists \"protracted torments of conscience\". Emma Jane Guyton published over fifty popular and oft-reprinted novels between 1846 and 1882, most of which used their commonplace domestic settings to communicate an ecumenical Protestant or strongly anti-Catholic message. Ashted-born George Mogridge started writing for children on religious and moral issues in 1827 after a varied early life that included periods working as a japanner in Birmingham's metal trades and living as a tramp in France. He eventually wrote 226 successful and widely marketed books, including stories, collections, verse and plays; anonymously and under more than 20 pseudonyms including Old Humphrey, Ephraim Holding, Old Father Thames, Peter Parley, Grandfather Gregory, Amos Armfield, Grandmamma Gilbert, Aunt Upton, and X.Y.Z. At the time of his death in 1854 it was estimated that his books had sold a total of over 15 million copies across Britain and America."]}, {"page": "Mrs Guyton", "response": ["#REDIRECT Emma Jane Guyton"]}, {"page": "List of women writers (A–L)", "response": ["*Emma Jane Guyton (1825–1887, England), nv. & editor"]}]}}