{"wiki_id": "http://www.wikidata.org/entity/Q537725", "itemLabel": "David Bellos", "itemDescription": "British translator and author", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Bellos", "wikipedia_page": {"main": "David Bellos (born 1945) is an English-born translator and biographer. Bellos is Meredith Howland Pyne Professor of French Literature and Professor of Comparative Literature at Princeton University in the United States. He was director of Princeton's Program in Translation and Intercultural Communication from its inception in 2007 until July 1, 2019.", "link_mentions": [{"page": "Georges Perec", "response": ["Perec's most famous novel La Vie mode d'emploi (Life: A User's Manual) was published in 1978. Its title page describes it as \"novels\", in the plural, the reasons for which become apparent on reading. La Vie mode d'emploi is a tapestry of interwoven stories and ideas as well as literary and historical allusions, based on the lives of the inhabitants of a fictitious Parisian apartment block. It was written according to a complex plan of writing constraints, and is primarily constructed from several elements, each adding a layer of complexity. The 99 chapters of his 600-page novel move like a knight's tour of a chessboard around the room plan of the building, describing the rooms and stairwell and telling the stories of the inhabitants. At the end, it is revealed that the whole book actually takes place in a single moment, with a final twist that is an example of \"cosmic irony\". It was translated into English by David Bellos in 1987.", "David Bellos, who has translated several of Perec's works, wrote an extensive biography of Perec: Georges Perec: A Life in Words, which won the Académie Goncourt's bourse for biography in 1994.", "In 1992 Perec's initially rejected novel Gaspard pas mort (Gaspard not dead), which was believed to be lost, was found by David Bellos amongst papers in the house of Perec's friend . The novel was reworked several times and retitled \"The Letter Vanishes\" by James Gibbons, Bookforum, December/January 2006 and published in 2012; its English translation by Bellos followed in 2014 as Portrait of a Man after the 1475 painting of that name by Antonello da Messina.\"Georges Perec's Lost Novel\" by David Bellos, The New York Review of Books, 8 April 2015 The initial title borrows the name Gaspard from the Paul Verlaine poem \"Gaspar Hauser Chante\" (inspired by Kaspar Hauser, from the 1881 collection Sagesse) and characters named \"Gaspard\" appear in both W, or the Memory of Childhood and Life: A User's Manual, while in MICRO-TRADUCTIONS, 15 variations discrètes sur un poème connu he creatively re-writes the Verlaine poem 15 times.", "| Things: A Story of the Sixties, trans. by Helen Lane (New York: Grove Press, 1967);Things: A Story of the Sixties in Things: A Story of the Sixties & A Man Asleep trans. by David Bellos and Andrew Leak (London: Vintage, 1999)", "| W, or the Memory of Childhood, trans. by David Bellos (London: Harvill, 1988)", "| Memories, trans./adapted by Gilbert Adair (in Myths and Memories London: Harper Collins, 1986);I Remember, trans. by Philip Terry and David Bellos (Boston: David R. Godine, 2014)", "| Life: A User's Manual, trans. by David Bellos (London: Vintage, 2003)", "|Thoughts of Sort, trans. by David Bellos (Boston: David R. Godine, 2009)", "| 53 Days, trans. by David Bellos (London: Harvill, 1992)", "| The Art of Asking Your Boss for a Raise, trans. by David Bellos (Verso, 2011)", "| Portrait of a Man Known as Il Condottiere, translated by David Bellos (Chicago: University of Chicago Press, 2014)", "* Georges Perec: A Life in Words by David Bellos (1993)"]}, {"page": "Life: A User's Manual", "response": ["Life A User's Manual (the original title is La Vie mode d'emploi) is Georges Perec's most famous novel, published in 1978, first translated into English by David Bellos in 1987. Its title page describes it as \"novels\", in the plural, the reasons for which become apparent on reading. Some critics have cited the work as an example of postmodern fiction, but Perec preferred to avoid labels and his only long-term affiliation with any movement was with the Oulipo or OUvroir de LIttérature POtentielle.", "Another variation comes from the presence of Lists 39 and 40 in the 10th sub-group; Lists 39 and 40 would sometimes number their own sub-group as the one to be tampered with in a given chapter. According to Perec's biographer, David Bellos, this self-reflexive aspect of Lists 39 and 40 \"allowed him to apply 'gap' in such cases by not missing out any other constraint in the group ('gapping the gap') or by missing out a constraint in a group not determined by the bi-square number ('wronging the wrong') or by not getting anything wrong at all ('gapping the wrong')\". The 41st and 42nd lists collectively form ten \"couples\" (such as \"Pride & Prejudice\" and \"Laurel & Hardy\") which are exempt from the disruptions of the \"Gap\" and \"Wrong\" lists that affect the first forty lists.Bellos, David (2010). Georges Perec: A Life in Words, p. 601. Harvill Press, London. . It is important to note that Perec acknowledged the lists were often mere prompts; certain chapters include far fewer than 42 of their prescribed elements."]}, {"page": "Jules Maigret", "response": ["Between 1931 and 1972, 75 novels and 28 short stories about Maigret were published, starting with Pietr-le-Letton (\"Peter the Lett\") and concluding with Maigret et Monsieur Charles (\"Maigret and Monsieur Charles\"). The Maigret stories were also adapted for television and radio. Penguin Books published new translations of 75 books in the series over as many months; the project was begun in November 2013 by translators David Bellos, Anthea Bell, and Ros Schwartz."]}, {"page": "Prix Goncourt", "response": ["*1994 – David Bellos, Georges Perec"]}, {"page": "Romain Gary", "response": ["* Ajar, Émile (Romain Gary), Hocus Bogus, Yale University Press, 2010, 224p,  (translation of Pseudo by David Bellos, includes The Life and Death of Émile Ajar)"]}, {"page": "Southend-on-Sea", "response": ["* David Bellos, professor/translator"]}, {"page": "Jacques Tati", "response": ["As David Bellos puts it, \"Tati, from l'Ecole des facteurs to Playtime, is the epitome of what an auteur is (in film theory) supposed to be: the controlling mind behind a vision of the world on film\".Jacques Tati, His Life and Art, David Bellos, Random House", "Tati biographer David Bellos noted that Tati had approached everybody from Darryl F Zanuck to the prime minister Georges Pompidou in a bid to get the movie completed. \"His personal overdrafts began to mount, and long before Play Time was finished, Tati was in substantial debt to the least forgiving of all creditors, the Collectors of Taxes.\" When Tati failed to pay off his loans, his films were impounded by the banks. Tati was forced to sell the family house of Saint-Germain shortly after the death of his mother, Claire Van Hoof, and move back into Paris. Spectra Films was then placed into administration, concluding in the liquidation of the company in 1974, with an auction of all movie rights held by the company for little more than 120,000 francs.", "At the Lido de Paris, Tati met and fell in love with the young Czech-Austrian dancer Herta Schiel, who had fled Vienna with her sister Molly at the time of the Anschluss. In the summer of 1942, Herta gave birth to their daughter, Helga Marie-Jeanne Schiel. Tati refused to recognise the child, reportedly due to pressure from his sister, Nathalie. As  a result, he was forced by Leon Volterra to depart from the Lido at the end of the 1942 season.David Bellos, \" La postérité de M. Hulot \", sur non-fiction, 25 mars 2008."]}, {"page": "Ismail Kadare", "response": ["He soon became entranced by literature.David Bellos (2011). Is That a Fish in Your Ear?; Translation and the Meaning of Everything, Farrar, Straus and Giroux, ISBN 9780865478572. At age 12, Kadare wrote his first short stories, which were published in the Pionieri (Pioneer) journal in Tirana, a communist magazine for children. In 1954 he published his first collection of poems, Frymëzime djaloshare (Boyish inspirations). In 1957 he published a poetry collection entitled Ëndërrimet (Dreams).", "Kadare is considered to be one of the greatest living writers. The London newspaper The Independent said of Kadare: \"He has been compared to Gogol, Kafka and Orwell. But Kadare's is an original voice, universal but deeply rooted in his own soil\".Shusha Guppy (27 February 1999).  \"The Books Interview: Ismail Kadare – Enver's never-never land\" The Independent. The New York Times said his fiction has been compared with that of Gabriel García Márquez, as well as Milan Kundera, and The Christian Science Monitor wrote he has also been compared with Dostoevsky and Isak Dinesen. Translator and biographer David Bellos wrote that \"In some ways, he's like Balzac.\"  Critic Richard Eder called him \"a supreme fictional interpreter of the psychology and physiognomy of oppression.\"", "Some of his works have been translated into English by David Bellos, though not from the Albanian original, but rather from French translations."]}, {"page": "Viktor Shklovsky", "response": ["Viktor Shklovsky's Theory of Prose was published in 1925. Shklovsky himself is still praised as \"one of the most important literary and cultural theorists of the twentieth century\" (Modern Language Association Prize Committee); \"one of the most lively and irreverent minds of the last century\" (David Bellos); \"one of the most fascinating figures of Russian cultural life in the twentieth century\" (Tzvetan Todorov)"]}, {"page": "American Literary Translators Association", "response": ["* October 3–6, 2012 in Rochester, New York: \"The Translation of Humor, or, the Humor of Translation,\" featuring a keynote by David Bellos"]}, {"page": "International Booker Prize", "response": ["The 2016 prize was judged by Boyd Tonkin (Chair), Tahmima Anam, David Bellos, Daniel Medin and Ruth Padel. The nominees for the seventh Man Booker International Prize were announced on 14 April 2016. The six nominees were chosen from a longlist of thirteen.The Man Booker International Prize 2016 Longlist Announced Retrieved 15 April 2016. Han became the first Korean author to win the prize and, under the new format for 2016, Smith became the first translator to share the prize. British journalist Boyd Tonkin, who chaired the judging panel, said that the decision was unanimous. He also said of the book \"in a style both lyrical and lacerating, it reveals the impact of this great refusal both on the heroine herself and on those around her. This compact, exquisite and disturbing book will linger long in the minds, and maybe the dreams, of its readers.\""]}, {"page": "Les Vacances de Monsieur Hulot", "response": ["Tati biographer David Bellos has described the film as \"Sublime\" and stated \"It was through this film that I first fell in love with France. I think that is true of a lot of people.\" The journalist Simon O'Hagan, on the occasion of the film's 50th anniversary in 2003, wrote that the film \"might contain the greatest collection of sight gags ever committed to celluloid, but it is the context in which they are placed and the atmosphere of the film that lift it into another realm. The central character is an unforgettable amalgam of bafflement at the modern world, eagerness to please and just the right amount of eccentricity - i.e. not too much - his every effort to fit in during his seaside holiday merely succeeds in creating chaos out of orderliness. Puncturing the veneer of the comfortably off at play is by no means the least of Tati's concerns. But, [there is] an elegiac quality [too], the sense that what Tati finds funny he also cherishes.\"Beauty and the Beach, Simon O'Hagan, The Independent on Sunday, Arts Section, p.6, 20 July 2003"]}, {"page": "The File on H.", "response": ["The French translation of 1989 (revised in 1996) was by Jusuf Vrioni. It appears in volume 4 of Ismail Kadare's collected works (Ismail Kadare: Oeuvres). The English version by David Bellos, published in 1997, was made on the basis of the French translation."]}, {"page": "Monsieur Hulot", "response": ["The name of \"Monsieur Hulot\" is believed to echo \"Charlot,\" the French name for Charlie Chaplin’s character The Tramp.  However, \"Hulot is more distracted than the Tramp, he cannot disentangle himself from situations as effortlessly, and he is not as central a character, he is not ‘the reason for the film.'\"Phil Powrie, The cinema of France (Wallflower Press, 2006), 65.  As theorized by David Bellos, Hulot may even represent an inversion of The Tramp: “Hulot tilts forwards whereas Chaplin tilts back; Chaplin’s puppet-like waddle is very different from Hulot’s ‘springy glide’; and there is a difference in costume too: the bowler, tails, huge pants, cane and cigarette are replaced by a pipe, various accessories, pants that are too short, a sports blazer and a Homburg, although the striped socks are borrowed from Keaton.”  "]}, {"page": "Georges Perec: A Life in Words", "response": ["Georges Perec: A Life in Words is an authoritative biography of Georges Perec by David Bellos, Professor of French and Comparative Literature and Director of the Program in Translation and Intercultural Communication at Princeton University, who also translated Perec's major novel Life: A User's Manual (1978) from French into English. His prize-winning biography contains a full list of Perec's works."]}, {"page": "Bellos", "response": ["*David Bellos, English translator and biographer, father of Alex Bellos"]}, {"page": "W, or the Memory of Childhood", "response": ["* Georges Perec, W, or the Memory of Childhood trans. by David Bellos (London: Harvill, 1988)", "* Georges Perec, W, or the Memory of Childhood trans. by David Bellos (Boston: David R. Godine, Publisher, 2002)"]}, {"page": "Scott Moncrieff Prize", "response": ["* Commended: David Bellos for his translation Portrait of a Man by Georges Perec (MacLehose Press)"]}, {"page": "Independent Foreign Fiction Prize", "response": ["*Fred Vargas, Have Mercy On Us All (translated by David Bellos)", "*Ismail Kadare, The Successor (David Bellos; French; Canongate)", "* Ismail Kadare, Agamemnon's Daughter (translated by David Bellos from the French)", "* Ismail Kadare, The Siege (translated by David Bellos from the Albanian via French)"]}, {"page": "Seeking Whom He May Devour", "response": ["In 2004, it became the second of her novels to be translated into English (by award-winning translator David Bellos), and was shortlisted for the Crime Writers' Association Gold Dagger."]}, {"page": "Have Mercy on Us All", "response": ["Have Mercy on Us All (, lit. \"Leave quickly and come back late\") is a 2001 novel by French author Fred Vargas. The novel was her first to be translated into English in 2003 by David Bellos. It was made into a film released in 2007."]}, {"page": "Viola Garvin", "response": ["Viola Garvin was born at Benwell, the eldest daughter of J. L. Garvin, later the long-time editor of The Observer; her older brother Gerard was killed in the First World War. She was named for Francis Thompson's \"The Making of Viola\" and for Viola Meynell, the subject of the poem.Katharine Garvin, p. 36.David Ayerst, Garvin of the Observer, London / Sydney: Croom Helm, 1985, , p. 26. She was educated at South Hampstead High SchoolKatharine Garvin, p. 71. and at Somerville College, Oxford,Constance Savery, \"Work Diary. 2nd-4th February 1969\". Manuscript collection, Knight Library, University of Oregon. Savery remembered Garvin's \"dark haunting eyes\" and recalled that \"she shone like a planet at Somerville. No glitter, just 'the soft journey that a planet goes'\".Giles Brindley, Oxford: Crime, Death and Debauchery, Stroud: Sutton, 2006, , n. p.. and then became assistant literary editor at The Observer in 1926; she later became literary editor,Katharine Garvin, pp. 58, 62. but was let go when her father's contract was not renewed in 1942.Ayerst, pp. 219, 280.\"Briefs\", The Bookseller, 30 June 1979, p. 2946.Jeremy Lewis, David Astor: A Life in Print, London: Jonathan Cape, , p. 123.Stephen E. Koss, The Rise and Fall of the Political Press in Britain, Volume 2 The Twentieth Century, London: Hamish Hamilton, 1984, , p. 612. She also worked as a translator from the French: for example in 1930 of Jacques Chardonne's EvaCarlos Peacock, Painters and Writers: An Anthology, London: Tate Gallery, 1949, , p. 18. and after leaving The Observer, of Romain Gary's Forest of Anger (1944),David Bellos, Romain Gary: A Tall Story, London: Harvill Secker, 2010, , p. 102. Rémy's The Messenger (1954)Publishers Weekly 166.14 (1954) p. 2361. and Constantin de Grunwald's Peter the Great (1956).C. Bickford O'Brien, \"Review: Peter the Great by Constantin de Grunwald, Viola Garvin\", The American Slavic and East European Review 16.1 (February 1957), 91–92, ."]}, {"page": "The Illusionist (2010 film)", "response": ["The Illusionist () is a 2010 French British animated film directed by Sylvain Chomet. The film is based on an unproduced script written by French mime, director and actor Jacques Tati in 1956. Controversy surrounds Tati's motivation for the script, which was written as a personal letter to his estranged eldest daughter, Helga Marie-Jeanne Schiel in collaboration with his long-term writing partner Henri Marquet, between writing for the films Mon Oncle and Play Time.\"In the Works: A black and white doc about shades of grey\"  by Alison Willmore. 02-21-2007. The Independent Eye film blog\"Cut The Cute\" by Ian Johns (17 February 2007) in The Times\"Chomet Tackles Tati Script\"  Time Out. New York. Stefanou Eleni Stefanou (2007)\"La postérité de M. Hulot\", David Bellos (2008-03-25)\"Jacques Tati Deux Temps Trois Mouvements\" . Matthieu Orlean (8 May 2009). Cinémathèque Française", "Tati's biographer, David Bellos, reviewing The Illusionist in Senses of Cinema was highly critical of Chomet's adaptation stating \"the film is a disaster\". \"The great disappointment for me and I think for all viewers is that what Chomet does with the material is… well, nothing. The story he tells is no more than the sketchily sentimental plotline of L'Illusionniste. It's really very sad. All that artistry, all that effort, and all that money… for this\".The Illusionist by David Bellos.  2010-10-11. Senses of Cinema. Accessed 2010-10-11"]}, {"page": "List of translators into English", "response": ["*David Bellos"]}, {"page": "Hélène Berr", "response": ["The Diary, written in French, contains some English. It was translated by David Bellos and the entire diary has been translated besides 2 sentences. The first sentence appears on page 48 (of the English copy). \"Refait l'Ancien dans la matinée.\" The meaning of this sentence has not been established. The second sentence that has not been translated was on page 261. \"Nous serons de la même fournée.\" Madame Loewe says this sentence to reassure Hélène. In common tongue, this phrase means, \"We'll be in the same boat.\" Madame Loewe is trying to reassure Hélène that she is not alone and that if they are taken they will be taken together. It was meant to reassure her. However, the literal translation of that sentence is, \"We will be in the same oven.\" To quote David Bellos (the translator), \"I cannot reproduce in English the hideous lurch into prophecy made by this phrase in French, and so I have left it alone.\"", "*Hélène Berr: The Journal of Hélène Berr, Translated by David Bellos with notes by the translator and an afterword by Mariette Job, 2008, McClelland & Stewart, Toronto, "]}, {"page": "The Siege (Kadare novel)", "response": ["The Siege (also known as The Castle) is a novel by Albanian author Ismail Kadare, first published in 1970 in Tirana as Kështjella. It tells about the Albanian-Ottoman war during the time of Skanderbeg. It was translated into French by Jusuf Vrioni and then from French into English by David Bellos under the title The Siege. Bellos in his afterword suggests that the book is patterned after Marin Barleti's work The Siege of Shkodra. The narrator of the novel is however not an Albanian fighting for Skanderbeg but a member of the besieging Ottoman army."]}, {"page": "Chronicle in Stone", "response": ["The current edition was translated by David Bellos. He was chosen by Kadare, as he had received a Booker Prize for translation work."]}, {"page": "Translation", "response": ["According to Walter Benjamin:While a poet's words endure in his own language, even the greatest translation is destined to become part of the growth of its own language and eventually to perish with its renewal. Translation is so far removed from being the sterile equation of two dead languages that of all literary forms it is the one charged with the special mission of watching over the maturing process of the original language and the birth pangs of its own.Gregory Hays, in the course of discussing Roman adapted translations of ancient Greek literature, makes approving reference to some views on the translating of poetry expressed by David Bellos, an accomplished French-to-English translator. Hays writes:"]}, {"page": "Cambridge Literary Review", "response": ["CLR3 was dedicated to the theme of 'translation', though the term was taken very loosely, the editors stating that the contents were \"not so much straight translations, as meditations on or digressions from the manifold practices, protocols and theories of translation.\".\"Editorial\" , Cambridge Literary Review 3 June 2010, Retrieved 9 November 2010 This issue featured new work from poets Anne Blonstein, Jonty Tiplady, Rich Owens, as well as translations from Osip Mandelstam, Henri Deluy, Charles Baudelaire, and Hermann Hesse. The prose and essay sections featured Kurt Schwitters, Eric Hazan, Jeremy Hardingham, André Gide and Emily Critchley. A notable essay on the translation of difficult poetry by J. H. Prynne was published, alongside theoretical and historical studies by Nick Jardine, David Bellos, Lydia Davis and others."]}, {"page": "International Association of Professional Translators and Interpreters", "response": ["*David Bellos"]}, {"page": "Alex Bellos", "response": ["Bellos lives in London and is married with children. His father David Bellos is a translator and academic  and his mother is Hungarian."]}, {"page": "PEN/Heim Translation Fund Grants", "response": ["The voting members of the Advisory Board were Esther Allen, David Bellos, Susan Bernofsky, Edwin Frank, Michael F. Moore, and Jeffrey Yang.", "The names of eleven winners were announced. The voting members of the Advisory Board were David Bellos, Susan Bernofsky, Edwin Frank, Michael Reynolds, Natasha Wimmer, and Jeffrey Yang, and Michael F. Moore served as the non-voting Chair."]}]}}