{"wiki_id": "http://www.wikidata.org/entity/Q5370908", "itemLabel": "Emerson Bainbridge", "itemDescription": "English mining engineer, philanthropist and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Emerson_Bainbridge", "wikipedia_page": {"main": "Emerson Muschamp Bainbridge (5 December 1845 – 12 May 1911) was an English mining consulting engineer,  philanthropist and Liberal Party politician who sat in the House of Commons from 1895 to 1900.", "link_mentions": [{"page": "Willoughby Norrie, 1st Baron Norrie", "response": ["Jocelyn Norrie died on 7 March 1938. He remarried later that year, to Patricia Merryweather Bainbridge (daughter of Emerson Bainbridge), on 28 November. They also had three children:"]}, {"page": "Gainsborough (UK Parliament constituency)", "response": ["| Emerson Bainbridge"]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["| Emerson Bainbridge"]}, {"page": "Bainbridge (name)", "response": ["*Emerson Bainbridge (1845–1911), British mining engineer and MP"]}, {"page": "Emerson Muschamp Bainbridge", "response": ["#REDIRECT Emerson Bainbridge"]}, {"page": "John Dodsley Webster", "response": ["Webster has very little recorded work in the centre of Sheffield, probably due to the loss of records, however, in addition to the already mentioned Medical School on Leopold Street, examples do exist. He designed the Norfolk Street section of St Pauls Parade to the south of the Peace Gardens, built between 1898 and 1901 as an extension to the Pinstone Street section, it is finished in warm coloured brick with red sandstone dressing. It has been rebuilt behind the facade and now houses retail and offices. In 1881 he designed 38–40 Fargate for the grocer Arthur Davy, it was claimed to be the largest provision shop in the country at the time, it now houses a branch of WHSmith. The Bainbridge building on the corner of Surrey Street and Norfolk Street were designed for the local Member of parliament and businessman Emerson Bainbridge in 1894, it has a prominent corner two-storey oriel window over the entrance. The building was rebuilt behind the facade in 1978 and housed a branch of the Halifax Bank for many years, it stands vacant as of 2020.\"Pevsner Architectural Guides: Sheffield\", Harman and Minnis, Yale University Press, , Gives details of City Centre architecture."]}]}}