{"wiki_id": "http://www.wikidata.org/entity/Q5378888", "itemLabel": "Enid Russell-Smith", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Enid_Russell-Smith", "wikipedia_page": {"main": "Dame Enid Mary Russell Russell-Smith, DBE (3 March 1903 – 12 July 1989) was a British civil servant.", "link_mentions": [{"page": "St Aidan's College, Durham", "response": ["In 1963, Scott was succeeded as principal by Dame Enid Russell-Smith,'RUSSELL-SMITH, Dame Enid (Mary Russell)', Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2008; online edn, Oxford University Press, Dec 2012 ; online edn, Nov 2012 accessed 7 April 2013 who handed over to Irene Hindmarsh in 1970.'HINDMARSH, Irene', Who's Who 2013, A & C Black, an imprint of Bloomsbury Publishing plc, 2013; online edn, Oxford University Press, Dec 2012 ; online edn, Nov 2012 accessed 7 April 2013 It was during her tenure as principal that it was agreed that St Aidan's should become a mixed college. The first male students were admitted in 1981.", "*Dame Enid Russell-Smith (1963–1970)"]}, {"page": "List of Dames Commander of the Order of the British Empire", "response": ["*1953: The Baroness Asquith of Yarnbury, Cynthia Colville, Mary Coulshed, Catherine Fulford, Elisabeth Kelly, Flora MacLeod of MacLeod, Enid Russell-Smith"]}, {"page": "Saint Felix School", "response": ["* Enid Russell-Smith DBE – civil servantJonathan Bradbury, ‘Smith, Dame Enid Mary Russell Russell- (1903–1989)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 5 Jan 2013"]}, {"page": "Evelyn Sharp, Baroness Sharp", "response": ["In 1926, she joined the Civil Service as an administrator, at first in the Board of Trade then after 18 months the Ministry of Health. Although the Sex Disqualification (Removal) Act had been enacted in 1919, the examinations to enter the administrative grades at the civil service had only been opened to women in 1925. The first three in 1925 were Alix Kilroy (a college friend), Enid Russell-Smith and Mary Smieton; all three would later be named Dames Commander of the Order of the British Empire."]}]}}