{"wiki_id": "http://www.wikidata.org/entity/Q5372236", "itemLabel": "Emily Joyce", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Emily_Joyce", "wikipedia_page": {"main": "Emily Sian Joyce (born April 12, 1969) is an English actress best known for playing the role of Janet Dawkins in the BBC comedy series My Hero, between 1999 and 2006.", "link_mentions": [{"page": "Cracker (British TV series)", "response": ["*Emily Joyce as Janice"]}, {"page": "Yes Minister", "response": ["Jay and Lynn collaborated again to produce a stage play which ran from 13 May to 5 June 2010, at Chichester Festival Theatre. This production revived at the Gielgud Theatre, in London's West End from 17 September 2010 until 15 January 2011. The principal cast was David Haig as Jim Hacker, Henry Goodman as Sir Humphrey, Jonathan Slinger as Bernard Woolley and Emily Joyce as Claire Sutton, Hacker's special policy advisor. This production, while following the spirit and tone of the original series in many respects, was set contemporaneously at Chequers, the Prime Minister's country residence, with BlackBerrys frequently in evidence,Remarkably, Sir Humphrey was able to show Bernard Woolley how to disable the Prime Minister's BlackBerry. and even included a topical reference to a coalition agreement which Sir Humphrey had drafted (the Conservatives and Liberal Democrats having formed a coalition government in Britain in May 2010).Antony Jay & Jonathan Lynn (2010) Yes, Prime Minister (the play) (Faber & Faber). In reality, during the negotiations that led to the coalition government in 2010, the two parties appear largely to have shunned support available to them from the civil service: see David Laws (2010) 22 Days in May and Rob Wilson (2010) 5 Days To Power, who concluded that, \"probably the influence of the civil service, including the Cabinet Secretary, in pushing the [parties] together to avoid a financial crisis has been overplayed\". The plot was a little more provocative and risqué than most of those seen previously (including a debate about the ethics of procuring a twelve-year-old as a sexual partner for a visiting dignitary,Yes, Prime Minister, act 1, scene 2 (pages 36–40) a proposition which it is suggested might be spun in the national interest as a \"euro-job\")Yes, Prime Minister, act 2, scene 1 (page 61). The suggestion of \"euro-job\" was prompted by Hacker's objection to \"Anglo-Kumranistan Liaison Project\" as \"a bit of a mouthful\": ibid. and included some stronger expletives (reflecting perhaps their widely reported use among New Labour's hierarchy between 1997 and 2010).See, for example, Alastair Campbell (2007) The Blair Years; Andrew Rawnsley (2010) The End of the Party; Anthony Seldon  & Guy Lodge (2010) Brown at 10. There was also a higher element of traditional farce.David Haig interviewed in Country Life, 8 September 2010", "The play features a new character, Claire Sutton, who is introduced by the Prime Minister as head of the policy unit at Number Ten. She is a 21st-century successor to Dorothy Wainwright, but less haughty and seemingly more willing to get her hands dirty. She is described by Jay and Lynn as in her late thirties, attractive and intelligent. She calls Hacker by his first name (\"Fiscal mechanics, Jim\"), whereas Dorothy addressed him as \"Prime Minister\". In response to a sarcastic interjection about \"starving permanent secretaries\", Sir Humphrey patronises her as \"dear lady\" (as he did \"that Wainwright female\" in the TV series).Jay & Lynn (2010) Yes, Prime Minister, especially pages 14, 32 and 81-3. Emily Joyce, who played Claire both at Chichester and in London, was forty-one when the play opened. The character was retained in the new TV series that followed the play."]}, {"page": "Northolt", "response": ["* The popular BBC comedy series My Hero, produced between 2000 and 2006, and featuring Ardal O'Hanlon and Emily Joyce, was set in Northolt."]}, {"page": "My Hero (British TV series)", "response": ["My Hero is a British television sitcom, created by Paul Mendelson, that broadcast for six series on the BBC between 2000 and 2006.My Hero at the BBC Comedy Guide. The series follows the everyday adventures of a dim-witted Ultronian superhero known as \"Thermoman\", portrayed by Ardal O'Hanlon, and his human wife, Janet, played by Emily Joyce. \"Thermoman\" is a multi-powered superhero who originates from the planet Ultron. In an attempt to do his best to fit in with life on earth, he creates the human alias of George Sunday. However, due to his unfamiliarity with human life, his antics usually lead to many misunderstandings. Although Thermoman is intrinsically very intelligent, his problem understanding earthly customs makes him look like an idiot to people who do not know who he really is.", "* Emily Joyce as Janet Dawkins; George's wife", "Janet Dawkins (Emily Joyce) is a nurse at the Northolt Health Centre. She first meets Thermoman when he rescues her from death, after she falls into the Grand Canyon whilst on holiday. She subsequently begins to date George Sunday, unaware that he is in fact Thermoman until after their first date. Although she loves George, she is frequently exasperated and confused by his behaviour."]}, {"page": "Joyce (name)", "response": ["*Emily Joyce (born 1969), British actress"]}, {"page": "The Curious Incident of the Dog in the Night-Time", "response": ["The production transferred to the Apollo Theatre in Shaftesbury Avenue, London, from March 2013. On 19 December, during a performance, parts of the ceiling fell down, injuring around 80 of the over 700 patrons inside. It re-opened at the Gielgud Theatre on 24 June 2014. The new West End cast was led by Graham Butler as Christopher Boone, with Sarah Woodward as Siobhan, Nicolas Tennant as Ed, Emily Joyce as Judy, Gay Soper as Mrs Alexander, Vicky Willing as Mrs Shears and Daniel Casey as Mr. Shears.  In 2015 the cast was Sion Daniel Young as Christopher Boone, with Rebecca Lacey as Siobhan, Nicolas Tennant as Ed, Mary Stockley as Judy, Jacqueline Clarke as Mrs Alexander, Indra Ové as Mrs Shears, Stephen Beckett as Roger Shears, Matthew Trevannion as Mr Thompson, Pearl Mackie as No. 40/Punk Girl, Sean McKenzie as Reverend Peters and Kaffe Keating plays alternate Christopher. They were joined by Mark Rawlings, Penelope McGhie, Naomi Said and Simon Victor."]}, {"page": "List of My Hero episodes", "response": ["My Hero is a BBC sitcom set in Northolt, west London. It starred Ardal O'Hanlon as Ultronian superhero George Sunday and Emily Joyce as his human wife, Janet. Six series were broadcast between 2000 and 2006.My Hero at the BBC Comedy Guide. Each series featured a varying number of episodes, with the first and second series containing six episodes, series three through five containing ten episodes each and series six containing eight episodes.My Hero at Big Bear Films home page"]}, {"page": "The Spaceship", "response": ["*Melissa Paterson (Emily Joyce) – Despite being the ship's security officer, Melissa never wears the regulation uniform. "]}, {"page": "Sydenham High School", "response": ["*Emily Joyce, actress"]}, {"page": "Palais de Tokyo", "response": ["|Emily Joyce"]}, {"page": "List of Dalziel and Pascoe cast members", "response": ["*Emily Joyce"]}, {"page": "Happy Now? (play)", "response": ["* Bea – Emily Joyce"]}, {"page": "Emily (given name)", "response": ["* Emily Joyce (born 1969), British actress"]}, {"page": "Mutual Friends", "response": ["Mutual Friends is a British comedy drama television series broadcast in six episodes on BBC One in from 26 August until 30 September 2008. The series starred Marc Warren, Alexander Armstrong, Keeley Hawes, Sarah Alexander, Claire Rushbrook, Emily Joyce, Naomi Bentley and Joshua Sarphie as a group of old friends whose lives are thrown into chaos when one of their group commits suicide.", "Emily Joyce as Sarah - 6 episodes, 2008"]}, {"page": "Universal Soldier: Regeneration", "response": ["Former UniSol Luc Deveraux (Jean-Claude Van Damme), who is undergoing rehabilitation therapy in Switzerland with Dr. Sandra Fleming (Emily Joyce) with the goal of rejoining society, is taken back by the military to participate in the mission. As the deadline nears its expiration, the prime minister announces the release of the prisoners. The terrorists, having gotten what they wanted, rejoice and shut off the bomb. Dr. Colin, however, is not pleased with the outcome, as he feels his side of the business is not done. As the NGU is programmed not to harm the terrorists, Dr. Colin unleashes his second UniSol: a cloned and upgraded version of Andrew Scott (Dolph Lundgren) – Deveraux's nemesis – who quickly kills Commander Topov. However, Dr. Colin never considered Scott's mental instability, and he is killed by his own creation. Scott then reactivates the bomb before heading out to hunt the children."]}, {"page": "My Almost Famous Family", "response": ["*Emily Joyce as Jill, Annabelle's mother and owner of the studio"]}, {"page": "Siobhan Hewlett", "response": ["| 2012 || Donny's Brain || Hampstead Theatre || Trish Gail || With Emily Joyce, Ryan Early, Nikesh Patel, Skye Lourie"]}, {"page": "Grafters", "response": ["* Emily Joyce – Laura"]}, {"page": "Toby Swift", "response": ["| Claudia Harrison, Emily Joyce, Stephen Hogan, Lizzy Watts and Paul Rider"]}, {"page": "List of Elstree Studios productions", "response": ["| Messiah 2: Vengeance is Mine || Drama || BBC Northern Ireland, Vengeance Films || || || || David Richards || Frances Grey, Gillian Taylforth, Emily Joyce, Dani Biernat"]}, {"page": "Being Eileen", "response": ["The single episode featured several guest cast members, such as Emily Joyce and Rufus Jones who played  husband and wife Miranda and Julian. Oliver Watton appeared as \"Steward\", whilst Caspar Phillipson appeared as Teppo. Fraser Ayres, Juga Leppajarvi and Andrei Aleen appeared as Brian, Bavval and Hans respectively. Liv Olsen appeared as \"Sleepy Elf\", whilst Nigel Harris played \"Santa\". Amrita Acharia and Matt Green appeared as \"Bride\" and \"Groom\", whilst finally, Mel Oskar appeared as \"Receptionist\". In the first episode of the series, \"Missing\", Adam Abbou, Casey-Lee Jolleys and Lewis Pryor all appeared as Tyler, Julie and Edward. Imara Rodgers and Emily Forrest played minor parts, and Joan Hempson, Stephen Aintree and Alex Watson played Hilda, Sid and \"Fireman\". In the second episode, \"Homeless\", Daniel Hayes appeared as Luke, Pearce Quigley played Dave, Pauline Fleming as Margie and Will Travis as Ken. Rosina Carbone appeared as Miss Igoe, Vicki Gates as Pat, and Ozzie Yue played \"Taxi Driver\". Finally, Adam Stevens played Keith, both in \"Homeless\" and in \"Birthday\". In \"Ay Carumba\", Phil Perez appeared as Carlos, a zumba teacher. Perez said of his character and how he got the role, \"My character has a lot of confidence. I originally auditioned for a much smaller part but was then given one of the lead parts in the third episode. It was a great laugh and the scenes when I am teaching them how to dance are very funny\". Along with Perez, Kevin Harvey, Conrad Nelson, Tanya Vital, Ian Munzberger, Debra Redcliffe and Taylor Perry played Mr Brown, \"Olympic Coach\", Lynda, Carl, Kim and Ben respectively. Eileen O'Brien played Rita, Sue Jenkins was Maureen and Susan Twist played Beedie. O'Brien, Jenkins and Twist all reprised their roles in \"Birthday\". In \"Monopoly\", Derek Barr, Susan Cormack and Emma Herron appeared as Derek, Barb and Carol, respectively, and Justin Edwards was credited as the voice on Eileen's Spanish tape. In \"DIY\", Lenny Wood appeared as Gavin, Sue Devaney as Carmel, James Devlin as Rodger, Naveen Riley Mohamed as Trace, Warren Donnelly as \"Security Guard\", Emily Pennington as Viv and Russ Booth as \"Workman\". Along with Stevens, O'Brien, Jenkins and Twist reprising their roles in \"Birthday\" - the final episode of the series - Rachel McGuiness appeared as Angela, and Barron reprised his role from \"Lapland\" as Maurice."]}, {"page": "Rachel Joyce (writer)", "response": ["She is the sister of actress Emily Joyce."]}, {"page": "Waterloo Road (series 7)", "response": ["* Emily Joyce as Viv O'Donnell; Radio presenter and Andi's mother (1 episode)"]}, {"page": "The Curious Incident of the Dog in the Night-Time (play)", "response": ["| align=\"center\" | Emily Joyce"]}, {"page": "The Christmas Haunting", "response": ["*Valerie Fergus-Johnson — Emily Joyce"]}, {"page": "In Exile (TV series)", "response": ["*Emily Joyce as Ellen"]}, {"page": "Helen West (TV series)", "response": ["* Emily Joyce as WDC Amanda Scott"]}, {"page": "The Band (musical)", "response": ["| align=\"center\" colspan=\"1\"|Emily Joyce"]}, {"page": "Hero of the Hour", "response": ["* Emily Joyce as Sylvie"]}]}}