{"wiki_id": "http://www.wikidata.org/entity/Q537783", "itemLabel": "Paul Mariner", "itemDescription": "English footballer and manager (1953-2021)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Mariner", "wikipedia_page": {"main": "Paul Mariner (22 May 1953 – 9 July 2021) was an English football player and coach.\nA centre forward during his playing days, Mariner began his career with Chorley. He became a professional player in 1973 with Plymouth Argyle, where he scored 61 goals in 155 appearances and is considered to have been one of the club's best ever players. He joined Ipswich Town in 1976, where he achieved domestic and European success under the guidance of Bobby Robson. He was called up to play for the England national team during his time at Portman Road, and went on to represent his country at the 1980 European Championships and the 1982 World Cup. In total, Mariner played 35 times for England, scoring 13 goals. He spent two years with Arsenal and then Portsmouth before finishing his career abroad. He played for clubs in Australia, the US, and Malta.\nHe took up coaching during his time with Albany Capitals and focused on it fully when he retired from playing. After spending time working in Japan, he returned to America to coach, firstly in Arizona and then at Harvard University. He joined Major League Soccer club New England Revolution in 2004 as a member of Steve Nicol's coaching staff. After five years in Massachusetts, Mariner returned to Plymouth Argyle in 2009 as their head coach. He succeeded Paul Sturrock as the club's manager two months later before returning to his role as head coach upon the arrival of Peter Reid. In January 2011, he returned to Major League Soccer as director of player development at Toronto FC.\nMariner was the color commentator for New England Revolution of MLS. Starting in 2020, he commentated for some of the Revolution games, and shared the duty with Charlie Davies.", "link_mentions": [{"page": "May 22", "response": ["*  1953   – Paul Mariner, English footballer, coach, and manager (d. 2021)"]}, {"page": "Plymouth Argyle F.C.", "response": ["|1975|| Paul Mariner", "|1976|| Paul Mariner", "* 2009  Paul Mariner"]}, {"page": "2021", "response": ["** Paul Mariner, English football player and manager (b. 1953)"]}, {"page": "Bobby Robson", "response": ["He moved on to Ipswich Town in 1969 and it was there that he established his reputation as a successful manager, supported by the club chairman John Cobbold and then later by his brother Patrick Cobbold. He won the vacant job at the Suffolk club after a chance encounter with Town director Murray Sangster while scouting at Portman Road for Chelsea manager Dave Sexton. After four mediocre seasons, Robson led Ipswich to fourth place in the First Division and success in the Texaco Cup in the 1972–73 season. In the following nine seasons, Ipswich finished lower than sixth place in the First Division only once, in the 1977–78 season. However, that season was a success with a 1–0 victory over Arsenal in the FA Cup final. His reign at Ipswich lasted 13 years, during which time the club twice finished as League runners-up, and made regular appearances in European competitions, capturing the UEFA Cup in 1981 with a 5–4 aggregate victory over Dutch side AZ 67 Alkmaar. About that team, Robson said: \"We played with two strikers, no wingers, Eric Gates sitting off the front two, two semi-wide midfield players in Arnold Muhren and Frans Thijssen and Johnny Wark sitting in the holding role\". During his 13-year tenure, he brought in only 14 players from other clubs, most notably Allan Hunter, Bryan Hamilton and Paul Mariner, relying instead on players developed through Ipswich's youth programmes, including Terry Butcher, George Burley, John Wark, Mick Mills, Colin Viljoen, Alan Brazil, Trevor Whymark, Brian Talbot, Kevin Beattie and Eric Gates, who all went on to play international football. His imports included Dutch players Frans Thijssen and Arnold Mühren. Robson was not a tactical genius but he showed a talent for developing new players, with his good interpersonal skills, caring attitude, hard work and enthusiasm helping them to achieve their best."]}, {"page": "Chorley", "response": ["*Paul Mariner (1953–2021), (England international footballer)"]}, {"page": "1982 FIFA World Cup", "response": ["* Paul Mariner"]}, {"page": "Iron Maiden", "response": ["Over the course of several decades, the band's cover illustrations and iconography have appeared in various TV productions, music videos by artists representing popular music in the broad sense, and in press publications. The distinctive cover illustrations, especially the group's mascot and logo, have become part of celebrity clothing (especially t-shirts) worn privately, as well as at prestigious industry events, including fashion shows. Among hundreds of others can be found: Lady Gaga, Paris Hilton, Rihanna, Madonna, Rowan Atkinson, Taylor Swift, Taylor Hill, Selena Gomez, David Beckham, David Hasselhoff, Diego Maradona, Kelly Rowland, Taryn Manning, Olivia Munn, Travis Scott, Cameron Diaz, Dolph Ziggler, Justin Bieber, Hilary Duff, Kirsten Dunst, Nicole Kidman, Drew Barrymore, Charlize Theron, Lindsay Lohan, Miley Cyrus, Holly Madison, David Banks, Jaden Smith, Michael Fassbender, Sam Worthington, Taylor Momsen, Kat Von D, Keith Urban, Amy Poehler, Paul Gascoigne, Marc Overmars, Faustino Asprilla, Juicy J, Kourtney Kardashian, DJ Mustard, Odell Beckham Jr, Ann Sydney, Kylie Jenner, Benicio del Toro, Pilar Rubio, Slaven Bilic, Pablo Zabaleta, Anushka Sharma, Terry Butcher, Ian Wright, Patrick Vieira, Paul Mariner, Stuart Pearce, Iggy Azalea, Bjorn Einar Romoren."]}, {"page": "Ipswich Town F.C.", "response": ["Robson led Ipswich to two major trophies and several seasons in top flight European football. The successful period began in 1973 when the club won the Texaco Cup and finished fourth in the league, qualifying for the UEFA Cup for the first time. In the 1974–75 season they reached the semi-finals of the FA Cup for the first time, losing to West Ham United after a replay, and finished third in the league. By the late 1970s, Robson had built a strong side with talent in every department, introducing the Dutch pair Arnold Mühren and Frans Thijssen to add flair to a team that featured British internationals including John Wark, Terry Butcher and Paul Mariner, although the Ipswich squad perhaps lacked the depth of established big clubs like Liverpool and Manchester United. Ipswich regularly featured in the top five of the league and in the UEFA Cup. At their peak in the 1979–80 season, they beat Manchester United 6–0 in a league game at Portman Road, a game where United goalkeeper Gary Bailey also saved three penalties. The defeat cost United two points – the margin which eventually separated them and champions Liverpool. Major success came in 1978 when Ipswich beat Arsenal at Wembley Stadium to win their only FA Cup trophy. The triumph was followed by a UEFA Cup victory in 1981 with a 5–4 victory over AZ Alkmaar in the two-legged final. The run to the final included a 4–1 win at St Etienne, captained by Michel Platini. The club also finished as league runners-up in 1981 and 1982."]}, {"page": "George Graham (footballer, born 1944)", "response": ["Graham quickly discarded the likes of Paul Mariner, Tony Woodcock, Stewart Robson and Tommy Caton, and replaced them with new signings and youth team products. He also imposed much stricter discipline than his predecessors, both in the dressing room and on the pitch. Arsenal's form immediately improved, so much so that the club were top of the League at Christmas 1986, the club's centenary, for the first time in a decade. The key players in the upturn were young defender Tony Adams and high-scoring winger Martin Hayes."]}, {"page": "Billy Rafferty", "response": ["Rafferty began his league career with Coventry City after joining them from Port Glasgow but found opportunities few and far between. A move to Blackpool in 1972 saw him play and score more regularly before joining Plymouth Argyle a year later.\"Billy Rafferty\". Greens on Screen. Retrieved 24 January 2010. With his striking partner, Paul Mariner, he became an important player in the Argyle side that won promotion to the Football League Second Division in 1975. Their partnership contributed 47 goals to the campaign, with Rafferty scoring 26."]}, {"page": "2003–04 Plymouth Argyle F.C. season", "response": ["*17 January 2004: Billy Rafferty and Paul Mariner make a guest appearance at Home Park. Argyle played Rushden & Diamonds on that day and won 3–0."]}, {"page": "Jürgen Klinsmann", "response": ["In November 2010, Klinsmann was hired as a technical consultant for Major League Soccer (MLS) club Toronto FC to advise on an overhaul of the club's coaching and playing personnel, leading the club to hire Aron Winter as head coach and Paul Mariner as technical director the following year. Both Winter and Mariner would later be fired by the club during a last place finish in the 2012 season."]}, {"page": "Football records and statistics in England", "response": ["|  Paul Mariner"]}, {"page": "British Home Championship", "response": ["|  Trevor Francis Glenn Hoddle Kevin Keegan Paul Mariner Bryan Robson Ray Wilkins Sammy McIlroy Asa Hartford John Wark Alan Curtis Peter Nicholas Ian Rush"]}]}}