{"wiki_id": "http://www.wikidata.org/entity/Q5372829", "itemLabel": "Emma Harrison", "itemDescription": "entrepreneur", "wikipedia_url": "https://en.wikipedia.org/wiki/Emma_Harrison_(entrepreneur)", "wikipedia_page": {"main": "Emma Louise Harrison CBE (née Cridland), (born 13 August 1963) was a key shareholder of A4e (Action for employment) and the company's chairperson until 24 February 2012. Harrison's father, Roy Cridland, founded the company A4e before appointing Harrison as a director of the business in 1991 when the company was worth £125,000.", "link_mentions": [{"page": "Lynne Franks", "response": ["She has also made various other television appearances. In November 2007, Franks was a contestant on the seventh series of I'm a Celebrity...Get Me Out of Here!, and contributed to the third series of Grumpy Old Women in the same year.BBC programme listings, BBC. Retrieved 27 June 2010. She was a member of the 'Bizchicks' team of entrepreneurs who competed on the Eggheads quiz show in November 2008, alongside teammates including the former dragon, Rachel Elnaugh, Laura Tenison and Emma Harrison, in order to raise money for The Nema Foundation, a charity running projects to relieve child poverty in Mozambique.Rachel Elanugh's personal blog. Episode aired on 10 November 2008. Retrieved 26 June 2010."]}, {"page": "Emma Harrison", "response": ["Emma Harrison is an actress, model and dancer, best known for the role of Joanna Hartman in the Australian soap-opera Neighbours.", "Born in Christchurch, New Zealand, and raised in Australia, Harrison started modelling at the age of 15, when she was spotted in the audience of a beauty contest and was signed by a local modelling agency. She started her television career with commercials, including Palmolive, and KFC.Emma Harrison Official Bio ", "In cinema, Harrison appeared in the Coen Brothers' Intolerable Cruelty, Robert Altman's The Company and in Street Fighter as Nicola.Emma Harrison Official Site – Film ", "Emma Harrison currently resides in Los Angeles and Burleigh Heads, Queensland, Australia.", "*Emma Harrison official site"]}, {"page": "Thornbridge Hall", "response": ["From 2002, Thornbridge Hall has been owned by Jim and Emma Harrison, owners of Thornbridge Brewery and A4e respectively, and is both a private family home and a venue for events, including weddings. The gardens are open to the public every Wednesday and Thursday, between April and September."]}, {"page": "The House I Grew Up In", "response": ["# Emma Harrison, 23 August"]}, {"page": "A4e", "response": ["A4e was originally a Sheffield-based training company, putting unemployed steel workers through a 'getting-back-to-work' course. A4e was a company started by Emma Harrison's father and she joined the company after graduating in engineering.", "In August 2009, A4e was featured in two episodes of Benefit Busters. Chairman, Emma Harrison, also appeared on Secret Millionaire.", "On 23 February 2012, Chairman Emma Harrison stepped down from her role as David Cameron's personal adviser on problem families, due to her firm being investigated over allegations of multiple fraud. The following day, she stepped down as chairman of A4e amid growing pressure over the company's behaviour.", "They opened in Australia during 2009 after winning Job Services Australia contracts from the Australian Government in Sydney and Gunnedah. The Government at the time was accused by the Sydney Morning Herald of a conflict of interest in awarding contracts to A4e due to links back to the UK and Emma Harrison.", "Emma Harrison resigned as chairman of A4e on 24 February 2012 amid criticism of 'improper' conflicts of interest regarding government contracts and allegations of fraud from whistleblowers.", "\"The time has come for full disclosure. With more questions over A4e and David Cameron's former family tsar Emma Harrison coming by the day, ministers must now come clean and tell the public exactly what they know and when they were informed about all allegations of fraud at A4e... the Government needs to make clear what new safeguards are being put in place to prevent this spreading any further, and with huge questions hanging over the entire Work Programme – and billions of pounds of public money at stake – ministers must publish all provider performance data immediately.\"\"The time has come for full disclosure over A4e - Byrne\" , Labour Party, London, 9 March 2012. Retrieved on 10 March 2012.", "==Payments to Emma Harrison=="]}, {"page": "Emma harrison a4e", "response": ["#REDIRECT Emma Harrison (entrepreneur)"]}, {"page": "2010 New Year Honours", "response": ["* Emma Harrison – Chair, A4e. For services to Unemployed People and to the Voluntary Sector."]}]}}