{"wiki_id": "http://www.wikidata.org/entity/Q5372729", "itemLabel": "Emma Barton", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Emma_Barton", "wikipedia_page": {"main": "Emma Louise Barton (born 26 July 1977) is an English actress. She is perhaps best known for the role of Honey Mitchell in EastEnders which she has portrayed on and off since November 2005. Before her role in EastEnders, Barton appeared in Spooks and on stage in plays including Grease. In 2019, Barton competed in the seventeenth series of Strictly Come Dancing, paired with professional Anton du Beke.", "link_mentions": [{"page": "EastEnders", "response": ["In the early 2000s, EastEnders covered the issue of euthanasia  with Ethel Skinner's (Gretchen Franklin) death in a pact with her friend Dot Cotton (June Brown), the unveiling of Kat Slater's (Jessie Wallace) sexual abuse by her uncle Harry (Michael Elphick) as a child (which led to the birth of her daughter Zoe (Michelle Ryan), who had been brought up to believe that Kat was her sister), the domestic abuse of Little Mo Morgan (Kacey Ainsworth) by husband Trevor (Alex Ferns) (which involved marital rape and culminated in Trevor's death after he tried to kill Little Mo in a fire), Sonia Jackson (Natalie Cassidy) giving birth at the age of 15 and then putting her baby up for adoption, and Janine Butcher's (Charlie Brooks) prostitution, agoraphobia and drug addiction. The soap also tackled the issue of mental illness and carers of people who have mental conditions, illustrated with mother and daughter Jean (Gillian Wright) and Stacey Slater (Lacey Turner); Jean suffers from bipolar disorder, and teenage daughter Stacey was her carer (this storyline won a Mental Health Media Award in September 2006\"Mental Health Media Awards 2006\" BBC. Retrieved 28 February 2008.). Stacey went on to struggle with the disorder herself. The issue of illiteracy was highlighted by the characters of middle-aged Keith (David Spinx) and his young son Darren (Charlie G. Hawkins). EastEnders has also covered the issue of Down syndrome, as Billy (Perry Fenwick) and Honey Mitchell's (Emma Barton) baby, Janet Mitchell (Grace), was born with the condition in 2006. EastEnders covered child abuse with its storyline involving Phil Mitchell's (Steve McFadden) 11-year-old son Ben (Charlie Jones) and lawyer girlfriend Stella Crawford (Sophie Thompson), and child grooming involving the characters Tony King (Chris Coghill) as the perpetrator and Whitney Dean (Shona McGarty) as the victim."]}, {"page": "Portsmouth", "response": ["Comedian and actor Peter Sellers was born in Southsea, and Arnold Schwarzenegger briefly lived and trained in Portsmouth. Other actors who were born or lived in the city include EastEnders actresses Emma Barton and Lorraine Stanley, and Bollywood actress Geeta Basra. Cryptozoologist Jonathan Downes was born in Portsmouth, and lived there for a time. Ant Middleton, former SBS, current television presenter and author was born in Portsmouth."]}, {"page": "Havant and South Downs College", "response": ["*Emma Barton – actor."]}, {"page": "Sharon Watts", "response": ["When Bobby kills Dennis' (now Bleu Landau) pet spider, Sharon tells Jane and Ian she will go to the police about Bobby killing Lucy. Bobby and Dennis's feud leads to Dennis going missing; when Ian and Phil find him, a drunk and distracted Phil crashes the car, leaving Dennis severely injured. Ian takes the blame for the crash in exchange for Phil convincing Sharon not to go to the police; Sharon ends her friendship with Ian. Gavin visits and supports Sharon in the hospital, and offers her a chance to live with him in Hong Kong when Dennis recovers, but Sharon declines, promising to still keep in touch. Phil then pledges to always stand by her and Dennis. Sharon is stunned when Phil admits he was driving, so Sharon leaves him and renews her friendship with Ian. She does not believe Phil when he says he is dying from cirrhosis, and she moves into Ian's house until Dennis is discharged. Gavin visits her again, saying he wants a second chance of having a family. Sharon then learns from Phil's daughter Louise Mitchell (Tilly Keeper), whom Phil had tracked down earlier that morning, that Phil has collapsed and is in hospital. At the hospital, Sharon realises Phil was telling the truth, but he has discharged himself to get drunk. When Dennis is discharged from the hospital, Sharon calls Gavin, telling him that they are coming with him. A week and a half later, Sharon returns with Dennis for Billy (Perry Fenwick) and Honey Mitchell's (Emma Barton) second engagement party only to find Phil collapsed on the floor from coughing up blood. She, Ronnie, Billy, Honey, Ben and Jay all find out at the hospital that unless Phil stops drinking and undergoes an urgent liver transplant, he is likely to have only twelve months left to live. Ronnie tries to convince Sharon to visit Phil, but Sharon tells her that Phil caused Dennis's injuries. Sharon then has the locks changed and tells Ronnie that she will not let Phil come back. Phil files for divorce and Sharon agrees, moving in with Ronnie when Phil moves back in with his family. Sharon supports Phil who is trying to come to terms with Peggy's impending death. However, Sharon shares an intimate moment with her apologetic first husband Grant who is briefly back in Walford on her tip off, before making amends with Peggy. She carries on supporting Phil following Peggy's death. Soon after, Sharon is incensed by Bobby's attack on Jane, revealing the truth about Lucy to Ben in her anger and worry. Despite this, Sharon gives Bobby moral support during police questioning until DI Samantha Keeble (Alison Newman) tells her to leave. Sharon and Phil receive letters saying their divorce is close to being finalised, but Sharon tells Shirley that they are back together. Sharon and Shirley pack away Peggy's things so Phil can move back in but when he finds out, he is angry. However, Sharon tells him that Peggy will never be coming back and he cries in her arms."]}, {"page": "Strictly Come Dancing", "response": ["| style=\"background:silver;\"|Emma Barton", "|colspan=\"2\"| Emma Barton & Anton Du Beke, Karim Zeroual & Amy Dowden", "| Emma Barton"]}, {"page": "Mel Owen", "response": ["Mel returns to Walford as she is working for her sister-in-law, Ciara Maguire (Denise McCormack), to track down money and jewellery that was stolen from Ciara in a recent robbery that took place in the area, and Ciara is keeping Mel's son, Hunter Owen (Charlie Winter), from her until she finds the money. Mel eventually discovers that Sharon Mitchell (Letitia Dean) has the money and Mel double-crosses her so the money is returned and Mel is able to see Hunter again. Ciara does not have the full amount, so in retaliation, she tells Hunter that Steve died in a car explosion, not a heart attack as Mel claimed and that he was a villain who killed Saskia Duncan (Deborah Sheridan-Taylor). Mel is forced to tell Hunter that Steve  killed Saskia and that Steve framed Matthew Rose (Joe Absolom) and his death was a result of a car chase. Mel later compares Hunter to Steve and asks for them to start again. Mel decides to remain in Walford, accepting Sharon's offer to reopen the nightclub, which she agrees to name E20 in tribute to Steve to keep Hunter happy. Jack Branning (Scott Maslen) pursues Mel but Hunter sabotages Jack's car to prevent them going to France. Before the club's opening, Hunter finds out Phil was involved in Steve's death and Hunter blames Phil, so he has sex with Louise (now played by Tilly Keeper) in the office, knowing Phil will see it on CCTV. Phil is enraged and threatens to attack Hunter with a baseball bat but Mel seduces Phil and threatens to show Sharon the CCTV footage of their kiss to stop him from hurting Hunter. Mel and Jack argue after Mel tries to reunite Billy and Honey Mitchell (Emma Barton) by claiming that Billy has moved on. The argument leads to passion and Jack and Mel have sex. Ian decides he wants to marry Mel again and constantly tries to woo her, including offering Hunter a job at his restaurant. However, his efforts always go in vain."]}, {"page": "Janine Butcher", "response": ["In August 2021, Scarlett (now played by Tabitha Byron) contacts Kat's son Tommy Moon (Sonny Kendall) and reveals that she has been in foster care due to Janine's neglect, and is about to be taken into care. In September 2021, Janine is seen impersonating as a doctor, under her former pseudonym \"Judith Bernstein\", and seduces Zack Hudson (James Farrar). It is hinted that Janine has been impersonating a doctor to persuade Social Services that she is good enough to look after Scarlett. Janine later returns to Albert Square and confronts Kat, warning her about the lengths she will go to get Scarlett back. Janine attempts to reason with Kat, and reveals that she lost her fortune at some point after her departure from Walford, but this fails when Zack reveals Janine pseudonym, and her scam as a doctor is uncovered. Kat reveals the truth to social services, and soon Scarlett goes missing. Janine is accused of abducting Scarlett, however, she finds her hiding at the Mitchell’s with Tommy. Janine tries to get Scarlett to return with her but a scuffle unfolds with Tommy. Whilst trying to retrieve Scarlett, she pulls her cardigan and accidentally throws it onto the open flame of the stove, starting a fire. Tommy locks himself, Scarlett and Janine in his bedroom in an attempt to keep Janine from taking Scarlett. Once they realize the house is on fire, Janine takes control of the situation, and manages to get Scarlett to safety out the front door of the house, but has to go back for Tommy who ran into one of the bedrooms in a panic. She lifts Tommy out of a window, but let's go when an explosion caused by the fire knocks her back. Tommy survives and is taken to hospital, and Janine manages to escape when the firefighters arrive. Despite saving Tommy, Kat still goes against Janine in court to get custody of Scarlett and succeeds in doing so. This leads to Janine deciding to remain in Walford to fight for Scarlett. Despite struggling to get a job, she starts working at The Queen Vic. However her former business partner, Dr Cole, returns and offers Janine money to continue to impersonate her as a doctor, but Janine turns it down, wanting to prove to Kat and Scarlett that she has changed. Her fling with Zack continues and they sleep together. Kat later discovers that Janine has told Tommy about Michael, who is also his biological father, and kicks her out. Janine is forced to lodge with Billy, Jay Brown (Jamie Borthwick), and his ex-wife Honey Mitchell (Emma Barton). She later forces Jay to give her a job at the car lot so that herself, her nephew Liam Butcher (Alfie Deegan) and Billy, can sell stolen cars to customers and incriminate Jay for car theft. They successfully manage to steal cars and Janine forges Jay's signature on the documents. Jay confronts Janine about the stolen cars and she reveals the truth. He later decides to join in on the scam, but Janine plants a stolen necklace from one of the stolen cars into Jay's belongings, and calls the police, leading to Jay's arrest. When it is revealed that Janine had orchestrated the scam, she is evicted by Honey. "]}, {"page": "Horndean Technology College", "response": ["*Emma Barton - Actress"]}, {"page": "Robert Sugden", "response": ["Robert asks Chrissie's sister, Rebecca White (Emily Head) to come to the village to help him with his vendetta against Chrissie. She sends a DNA test off to prove Lawrence is not Chrissie's biological father. When the topic of marriage comes up Aaron is embarrassed when Robert jokingly dismisses the idea. After rejecting Rebecca's advances Robert confides in Victoria that he is going to propose to Aaron. Robert asks Paddy for his blessing to marry Aaron, but Paddy tells him that he's not good enough for Aaron. Rebecca meets Robert at the scrap yard to apologise for making advances towards him. Lachlan overhears their conversation and threatens to make false sexual abuse allegations against Robert. Aaron suddenly appears and shoves Lachlan's head into a barrel of water before warning him to stay away from Robert. Robert arranges to meet Aaron at a barn so he can propose. Aaron reveals he has Lachlan tied up in the boot of his car and Robert reprimands Aaron for his actions. Lachlan escapes and they are forced to give chase and stop him from falling off a cliff. Lachlan tells Aaron that Robert is sleeping with Rebecca. With Lachlan back in the boot, Robert admits to Aaron that he is bisexual and did have an affair with Rebecca before getting serious with Chrissie. Robert tells Aaron that when he was 15 he had a feelings for a male farmhand. Jack caught them together and beat Robert. They never spoke of it again and Robert admits to feeling like a disappointment to his father. Aaron tells Robert that he loves him and Robert decides to propose but realises he has left the ring in the car. While driving back to the village Aaron tells Robert that he doesn't think he will be enough for him after romancing Chrissie and Rebecca, then him. Robert angrily reveals that he was going to ask Aaron to marry him. Aaron takes his eyes off the road Robert yells for him to watch out and they crash into lake after Emma Barton pushing her husband James Barton  off which he lands on Ashley's car and causing a huge car crash involving Ashley, Pierce Harris, Rhona and Paddy."]}, {"page": "Billy Mitchell (EastEnders)", "response": ["Billy's other major scenarios have seem him getting involved in criminal activities with both Phil and his brother Grant Mitchell (Ross Kemp); working for Phil's archenemy Steve Owen (Martin Kemp); being blackmailed by Phil and Steve's common nemesis Dan Sullivan (Craig Fairbrass) into getting leverage against his two rivals, which leads to Dan kidnapping their lover Mel Healy (Tamzin Outhwaite); his complicated relationship with Janine Butcher (Charlie Brooks); his marriage to Little Mo Slater (Kacey Ainsworth), which follows after her domestic abuse from his sworn enemy her abusive husband Trevor (Alex Ferns) and a subsequent incident where Little Mo gets raped by her old acquaintance Graham Foster (Alex McSweeney) before finding it hard to cope raising their son; a feud with local mobster Andy Hunter (Michael Higgs), which involves Billy and his friend Minty Peterson (Cliff Parisi) trying to stop Andy from marrying Phil and Grant's sister Sam (Kim Medcalf); working for Andy's gangland successor Johnny Allen (Billy Murray); his marriage to Honey Mitchell (Emma Barton); working for local gang boss Terry Bates (Nicholas Ball) up until he later witnesses Terry murdering his former errand boy Jase Dyer (Stephen Lord); becoming the guardian of Jase's young son Jay Brown (Jamie Borthwick) in the aftermath of Jase's murder; a short relationship with fellow resident Jean Slater (Gillian Wright); being reunited with his childhood girlfriend Julie Perkins (Cathy Murphy); and discovering that their dead son has a daughter – Lola Pearce. In 2014, Billy becomes romantically obsessed with Lucy Beale (Hetti Bywater). Later, he reunites with Honey, becomes the manager of a funeral parlour, from which he is later sacked, and cheats on Honey with Tina Carter (Luisa Bradshaw-White) – the result of which ends their relationship.", "Towards the first anniversary of their marriage, Little Mo is raped by her friend Graham Foster (Alex McSweeney) – which angers Billy. She discovers she is pregnant as a result of the assault and Billy presses her to have an abortion. However, Little Mo refuses and leaves Walford to clear her head – returning with baby Freddie to see Graham convicted of rape. Billy and Little Mo reunite, but their marriage eventually ends after he admits to being unable to love Freddie due to comparing him with Graham. Later, Billy starts a relationship with newcomer Honey Edwards (Emma Barton), whom he manages during her spell as a model. The relationship prospers, despite initial disapproval from Honey's father Jack (Nicky Henson), who takes time to accept Billy. Honey falls pregnant and accepts Billy's marriage proposal. Their wedding is postponed when Honey is hospitalised, they reschedule, however the second ceremony goes awry because of a practical joke played on Billy during his stag night. Billy's aunt Peggy Mitchell (Barbara Windsor) then arranges a surprise wedding. Billy and Honey have just time enough to complete their vows before Honey goes into labour. She delivers a girl, Janet, but the Mitchells are devastated to discover she suffers from Down syndrome. Honey rejects her baby, she goes into depression, contemplating infanticide, and demands Janet be put up for adoption. Billy is opposed, but, after agonising over the decision, eventually consents. After Janet is taken into foster care, she suffers a health scare and is hospitalised – forcing Honey to acknowledge she loves her baby and so Janet is brought home.", "The character Honey Edwards (Emma Barton) was introduced in November 2005. Her pregnancy was the start of an ongoing storyline about Down syndrome (DS) as, in September 2006, Honey and Billy's baby Janet was diagnosed with the disorder shortly after her birth. EastEnders' producers began to work on the DS plot in February 2006. Real parents with children who have Down Syndrome were approached to act as consultants in the making of the storyline, meeting with writers and the actors who play Billy and Honey. On-screen, Honey was shown to be devastated, rejecting her baby and wanting to have her adopted, while Billy wanted to keep his daughter, placing strain on the couple, who married in the serial the day of Janet's birth."]}, {"page": "Honey Mitchell", "response": ["Honey Mitchell (also Edwards) is a fictional character from the BBC soap opera EastEnders, played by Emma Barton. She made her first appearance in the show on 22 November 2005. The character left the show on 2 September 2008. Barton briefly reprised the role of Honey in 2014, appearing from 27 May to 6 June 2014, however, it was later confirmed in September 2015 that the character would be making a permanent return, and Honey returned full-time from 12 November 2015. She took a break in 2020, departing on 17 January. She returned in the episode broadcast on 24 September 2020.", "Actress Emma Barton was chosen to play Honey Edwards in September 2005, after a successful screen test with Perry Fenwick. Barton commented, \"I can’t wait to join EastEnders and play Honey. She’s a really sweet girl, who always wants to do the best for everyone but she’s not exactly the brightest star in the sky.\" Barton was axed from the show in April 2008. The character is widely known as Honey, though the character's \"real\" name is Susan, which is sometimes used in the series."]}, {"page": "MasterChef (British TV series)", "response": ["* 2014: Sophie Thompson, Christopher Biggins, Todd Carty, Tina Hobley, Kiki Dee, JB Gill, Wayne Sleep, Alison Hammond, Tania Bryer, Amanda Burton, Jason Connery, Ken Morley, Millie Mackintosh, Emma Barton, Russell Grant, Alex Ferns, Leslie Ash, Jodie Kidd, Charley Boorman and Susannah Constantine."]}, {"page": "Aunt Sal", "response": ["She returns in July 2007 for her nephew Phil Mitchell's (Steve McFadden) wedding to Stella Crawford (Sophie Thompson) and portentously notes that Stella would never be a Mitchell. She also returns when Peggy throws her a birthday party on 17 December 2007 and again on Christmas Day 2007 when she drunkenly infuriates Phil. On 8 July 2008 she returns again to keep an eye on Billy (Perry Fenwick) and Honey Mitchell (Emma Barton) whilst they look after The Queen Vic as Peggy is away. She makes another appearance on 14 August 2008 for Peggy and Archie Mitchell's (Larry Lamb) engagement party. Sal straight away speaks her mind about Archie, not knowing that he is next to her. She spends Christmas Eve 2008 with Peggy, complaining about the price of her taxi and joking about Jean Slater's (Gillian Wright) health condition. She is next seen on 2 March 2009 when Janine Butcher (Charlie Brooks) invited her to dinner. Janine gets her drunk before extracting information about Peggy's past, so she can use something to humiliate Peggy. Sal reveals to Janine that she and her sister, Peggy were involved in pole dancing for the gangland in the 1960s. Janine couriers a huge photo of Peggy pole-dancing to ruin her political campaign. Peggy is humiliated and everyone finds out about her past."]}, {"page": "Anton Du Beke", "response": ["| Emma Barton", "| Emma Barton", "| Emma Barton", "| Emma Barton", "| Emma Barton", "| Emma Barton", "| Emma Barton", "| Emma Barton", "In series 14, Du Beke was partnered with actress Lesley Joseph. They were eliminated in week 5. In series 15 in 2017, Du Beke was paired with television presenter Ruth Langsford. In 2018 Anton was partnered with Fashion Journalist Susannah Constantine. They finished last (the first time Du Beke had ever done this) with an average of 12.00 (Du Beke's lowest). For the 17th series, he was partnered with Emma Barton. In Week 9, Du Beke received his first 10s in all 17 series for their American Smooth; the couple received a total of fifteen 10s during the series. They finished joint runners-up alongside Karim Zeroual and Amy Dowden, but lost out to Kelvin Fletcher and Oti Mabuse. In 2020 Du Beke was partnered with former home secretary Jacqui Smith. They were eliminated in week 2 (first), Du Beke's second time finishing last.", "|Emma Barton", "Series 17 – with celebrity partner Emma Barton; placed 2nd"]}, {"page": "Marlowe Theatre", "response": ["The Marlowe Theatre's pantomime is produced with Evolution Pantomimes, who produce number of pantomimes across the country. Past stars in The Marlowe Theatre pantomimes have included Natalie Imbruglia, Martine McCutcheon, Danniella Westbrook, Shelia Ferguson, Shaun Williamson, Daniel MacPherson, Robert Powell, Lewis Collins, Emma Barton, Adrian Edmonson, John Thompson, John Partridge, Toyah Willcox, Samantha Womack, Rita Simons and Gareth Gates."]}, {"page": "List of EastEnders television spin-offs", "response": ["An EastEnders-themed episode of Pointless Celebrities aired on 8 September 2018, featuring cast members Natalie Cassidy, Dean Gaffney, Perry Fenwick, Emma Barton, Lisa Hammond, Luisa Bradshaw-White, Jamie Borthwick and Madhav Sharma."]}, {"page": "Sara Cogan", "response": ["Her most recent role was as a midwife named Cheryl in EastEnders, alongside Emma Barton (Honey Mitchell) and Perry Fenwick (Billy Mitchell), in a storyline about Down syndrome."]}, {"page": "Roxy Mitchell", "response": ["Roxy struggles to be a good mother to Amy, especially when Ronnie suggests that Roxy take Amy shopping, but not knowing this, Jack books a trip to Paris, which upsets Roxy when she finds out, and when Roxy wants to buy an expensive gift for Amy's birthday, her credit card is declined. Roxy asks Ronnie to lend her the money, so Ronnie asks her to help Amy with her homework but afterwards Roxy says she enjoyed it so much she does not want any money for it. Roxy is then upset to discover that Ronnie and Jack plan to move out of London, taking Amy with them. Roxy is also angry when Jack decides to sell the house Ronnie and Roxy co-own, but he tells her she well get half of the money from the sale. Donna helps Roxy to realise that letting Amy live with Jack and Ronnie will be the best thing for Amy, but then Roxy suspects Jack of having an affair with Billy's partner Honey Mitchell (Emma Barton) and tells Ronnie this, but Jack denies it. Roxy also agrees to move away to be near Amy but soon changes her mind. Roxy fears that Amy will not remember her, and she starts drinking heavily but when Phil tells her off and she forgets to collect Amy from school, she realises her problems and asks Donna if she can change. Donna suggests that the best thing she can do for Amy may be to allow Ronnie to adopt her. After an emotional discussion, Ronnie agrees to the adoption. Roxy then starts using drugs again. On Ronnie's hen night, Roxy tells Ronnie that she is not going to the wedding and will be in Tenerife instead. Ronnie insists that Roxy is at the wedding and also asks her to move to Essex with her, Jack and Amy. A few nights later, Roxy embarrasses herself at the market traders' party after taking cocaine. She calls Glenda, who collects her."]}, {"page": "List of EastEnders characters (2007)", "response": ["In April 2015, Derek visits Kat (Jessie Wallace) and Alfie Moon (Shane Richie) after Kat attempts suicide. Kat refuses to tell Derek why she did it but assures him that it will not happen again. Alfie then tells Derek that he felt he had let Kat down but he would help her get better. Derek is satisfied with this and leaves. In July, he visits Shirley Carter (Linda Henry) and Buster Briggs (Karl Howman) to discuss them gaining custody of their granddaughter, Jade Green (Amaya Edward). Buster informs Derek of his criminal record and Derek tells Shirley that single people can adopt children as well, prompting Shirley to nearly split up with Buster. In May 2016, Derek visits Billy and his partner Honey Mitchell (Emma Barton) after Jay returns to live with them after being convicted of a child sex offence to assess Jay being around their children, Janet (Grace) and Will Mitchell (Freddie Phillips). Billy and Honey insist Jay is innocent but Derek informs them that Jay's contact with their children must be supervised. Derek returns in August after Honey reports Jay to the police for possession of drugs which he had been dealing, to reassess their living arrangements. Derek tells Honey that he is concerned about her children's welfare due to the presence of the drugs and implies that Jay might be a danger to Janet and William, causing Jay to decide to move out of the flat. After Jay's home assessment discovers he is living with an underage Louise (now played by Tilly Keeper) at Phil's house, Derek visits Sharon Mitchell (Letitia Dean) and despite Sharon insisting that she and Phil trust Jay, Derek tells her if Jay does not move out, Louise may have to be taken into care as her needs come first.", "Mrs Patel is later mentioned on 9 August 2007 during a telephone conversation between Dot Branning (June Brown) and Charlie Slater (Derek Martin). On 9 November it is revealed that Mrs Patel is Billy Mitchell's (Perry Fenwick) new landlady. She gives him one month's notice to vacate the flat along with his wife Honey (Emma Barton) and baby Janet because she wants a professional couple with no children to live there. Eventually, Mrs Patel decides to evict the couple from the flat. However, Billy changes the locks so Mrs Patel cannot enter. When Billy is out buying nappies, Mrs Patel gets help from her nephews to get into the flat and remove Honey, the children and all their belongings. She offers Billy money as a good will gesture but Billy refuses to accept it.", "Later, Terry leads a gang of hitmen to storm The Queen Victoria public house - believing Jase is there on a date with his girlfriend Dawn Swann (Kara Tointon). Not finding him, Terry orders his gang to smash up the pub and they end up taking hostages; which consists of the pub's landlady Peggy Mitchell (Barbara Windsor), her nieces Roxy (Rita Simons) and Ronnie (Samantha Womack); her close friend Patrick Trueman (Rudolph Walker); and his wife Yolande Trueman (Angela Wynter). While his gang observes the hostages, Terry confronts Jase in the cellar and has him attacking - knocking down his pregnant wife Honey (Emma Barton) down into some empty beer kegs. Jase rushes her to hospital after Terry leaves the area with his gang members. He later appears at the hospital, then later visits Jase's flat to turn Jay against his biological father. Though he achieves with his scheme, Terry - along with Bird - is eventually arrested after Jase teams up with Peggy's son Phil (Steve McFadden) to claim that Terry's actions had resulted in the death of Phil's relative, Will (Toby Warpole).", "William \"Will \"Mitchell, played by Toby Walpole until 2014, and Freddie Phillips from 2015,BBC One - EastEnders, 12/11/2015 is the son of Billy (Perry Fenwick) and Honey Mitchell (Emma Barton).\"Honey and William Mitchell\", Walford Web. Retrieved 16 July 2008"]}, {"page": "Jase Dyer", "response": ["Jase arrives in Walford in search of his estranged son, Jay (Jamie Borthwick). He flirts with a pregnant Honey Mitchell (Emma Barton), angering her husband Billy (Perry Fenwick). When Billy finds Jase's letter regarding visits to a probation office, he tells the community that Jase is a criminal, causing them to shun him. When Jay discovers his father has been in prison, he reacts badly and is arrested for carving \"LIAR\" into a bus shelter, referring to Jase's lies about where he had been all his life. In wake of this, despite the initial animosity, Jase and Jay begin to bond.", "In 2007, Jase's primary storyline was arriving to Walford to salvage the relationship with his son. Keeping on eye on him to make a fresh start with him. Saving Dawn's baby Summer by catching her at a first floor from a burning house window at the hands of baby-stealer borderline psychopath Dr. May Wright (Amanda Drew). Having a brief fling with Roxy Mitchell. Proposing to his girlfriend Dawn Swann realising how much he loves her.Green, Kris (4 June 2008). \"Jase proposes to Dawn\". Digital Spy. Hachette Filipacchi UK. Retrieved 14 May 2012. Jase was caught flirting with Honey Mitchell (Emma Barton) much to her husband Billy's (Perry Fenwick) disgust.\"Jase drives jealous Billy crazy\". What's on TV. (IPC Media). 30 July 2007. Retrieved 19 July 2012.", "In an interview in Digital Spy Perry Fenwick admitted \"It's gutting for Billy and for me.\"Green, Kris (23 August 2008). \"Perry Fenwick praises new Walford plot\". Digital Spy. Hachette Filipacchi UK. Retrieved 23 October 2012. He also quoted as saying: \"You will see a real similarity between these two. Here are two men so desperate to provide for their families that they have been driven down this path of violence. \"Their paths collide but things go horribly wrong. I don't think Billy has thought things through. He doesn't expect to suddenly get caught up in what is effectively a gang war.\" Jase's profile on the BBC Online stated his death was leaving bereft Dawn and angry son Jay out for revenge when Jase died in hospital. He may be gone but never forgotten - least of all by Billy Mitchell who stood by and watched him die, and will forever live with the guilt... His death brought to the exit of another character, Honey Mitchell (Emma Barton).\"Honey Mitchell (Emma Barton)\". EastEnders. BBC Online. 2005. Retrieved 28 October 2012. Billy attempts to fix his marriage, but Honey cannot trust him and leaves Walford.Green, Kris (2 September 2008). \"Honey leaves Walford\". Digital Spy. Hachette Filipacchi UK. Retrieved 28 October 2012. His death turns in devastation as Jay lashes out at Dawn as he struggles to cope with the aftermath of his father's brutal murder by a criminal gang. When Jase's fiancée Dawn asks to say a few words about him, his son Jay objects and announces to the mourners that it's her fault that his father is dead.", "For his portrayal of Jase, Lord was nominated for Best Newcomer at the 2008 British Soap Awards but lost out to Coronation Street's Michelle Keegan (Tina McIntyre). A writer stated \"Jase will attract, intrigue and entertain the audience in equal measure.\" The Daily Mirror's Nicola Methven and Polly Hudson branded Jase a \"beefcake\" and \"the new Albert Square hunk who will soon be breaking Walford hearts.\" While a What's on TV writer said Jase is \"broodingly sexy\", \"highly attractive\" and that \"women lust after him\". Kevin O'Sullivan, writing for the Sunday Mirror, commented Jase was \"another pointless newcomer\". Kris Green writing for Digital Spy commented that Jase may have is eye on the women, Jane Beale (Laurie Brett) and Honey Mitchell (Emma Barton). The writer hilariously wrote his money's on Pat Evans (Pam St. Clement)."]}, {"page": "Jack Branning", "response": ["Jack returns to visit Dot and Amy for Christmas in December 2015. Ronnie is initially annoyed but later kisses him. He then finds out she tried to have Vincent Hubbard (Richard Blackwood) killed but admits he has missed her and they reignite their relationship. At Mick Carter's (Danny Dyer) stag party, he and Mick kiss as part of a dare. Mick later tells Jack that Roxy's fiancé Dean Wicks (Matt Di Angelo) raped his wife, Linda Carter (Kellie Bright). Jack removes Amy from Roxy's care and warns Roxy that Dean is controlling her. She later realises that he is right, so she ends her relationship with Dean. Jack is furious that Ronnie did not tell him about Dean's history, but reconciles with her while helping Billy propose to his former wife Honey Mitchell (Emma Barton), and Jack decides to stay in Walford for Ronnie. When Roxy arrives at Ronnie's house desperate for her help after Dean attempts to rape her, Jack, unaware of Roxy's ordeal, persuades Ronnie not to answer the door. Roxy leaves without Amy when she returns from the police station. Before leaving, she has a conversation with Ronnie, leading to Ronnie telling Jack that she needs a break and they cannot love each other again as she is broken and he leaves with Amy, promising her they will return to Walford soon."]}, {"page": "Rainie Cross", "response": ["Tanya Franks returned to the role of Rainie Cross for a stint on 16 June 2014. Her return was kept a secret by the cast and crew of EastEnders, and followed the surprise returns of Laurie Brett, Nicholas Bailey and Emma Barton as Jane Beale, Anthony Trueman and Honey Mitchell respectively. All of these returns were under new executive producer Dominic Treadwell-Collins."]}, {"page": "List of EastEnders characters (2005)", "response": ["Honey Mitchell, played by Emma Barton, is employed by Yolande Trueman (Angela Wynter) as a \"honey trap\" to see if her husband Patrick (Rudolph Walker) is willing to commit adultery. During the set up Honey meets Billy Mitchell (Perry Fenwick). They soon become attracted to each other, and finally become a couple in December 2005. Honey becomes pregnant by Billy, and gives birth to a girl, Janet, on their wedding day in September 2006. Honey and Billy have a second child, Will Mitchell, November 2007. However Billy's lies and deceptions ultimately lead to Honey leaving Billy in September 2008."]}, {"page": "List of EastEnders characters (2006)", "response": ["When Oliver first appears, he is knocked over by Dot Branning (June Brown) and is locked out of his house naked. Mo Harris (Laila Morse) picks the lock for him, but as his towel is caught in the door, he then has just his hands to cover himself. Cousins gives Honey Edwards (Emma Barton) advice about her unborn baby, finds Ben Mitchell (Charlie Jones) when he runs away, and talks to Little Mo Mitchell (Kacey Ainsworth) about her baby Freddie (Alex Kilby and Tom Kilby), thinking that she is suffering from stress. He then develops romantic feelings for Little Mo.", "Jack Edwards, played by Nicky Henson, is the father of Honey Mitchell (Emma Barton). The character was to have been played by former musician David Essex, originally for only 3 weeks, but Essex pulled out when the role expanded and he was unable to commit to the increased time. The role was re-cast and Nicky Henson played the part.", "The Reverend David Walsh, played by Jeremy Child, is a vicar, first seen renting a pornographic film in Walford Video for a sermon he is writing. He later visits Billy Mitchell (Perry Fenwick) and Honey Edwards (Emma Barton), who want to get married in a church, but when Reverend Walsh discovers that Billy is divorced, he tells Honey and Billy they cannot get married in the church. He is later blackmailed by Peggy Mitchell (Barbara Windsor), who threatens to tell everyone that he rented a porn film. After this, he marries Billy and Honey in September.", "In November 2009 PC Lance arrests Owen Turner (Lee Ross) for breach of his licence conditions. He appears again in May 2010 to inform Billy about a car accident that has injured his ex-wife Honey Mitchell (Emma Barton) and killed her father Jack Edwards (Nicky Henson). In October 2010, he attends the Jacksons' house after Billie Jackson (Devon Anderson) is found dead after a party. In December he attends the Jacksons' again with a colleague when Bianca Butcher (Patsy Palmer) is accused of stealing perfume. They search the house and Bianca loses her temper, accidentally slapping Lance. She is then arrested and driven away.", "Caroline Bishop, played by Una Stubbs, is the maternal aunt of Honey Mitchell (Emma Barton), and acted as a surrogate mother to Honey when her mother Janet died during childbirth. Caroline is outgoing, eccentric and vivacious, and visits Albert Square for Honey's second wedding to Billy Mitchell (Perry Fenwick). Jack (Nicky Henson) brings her with him to Walford, which makes Peggy Mitchell (Barbara Windsor) jealous.", "Janet Mitchell is the daughter of Billy and Honey Mitchell (Perry Fenwick and Emma Barton). Janet is diagnosed with Down's syndrome shortly after her birth, and Honey finds it hard to cope, so they put Janet up for adoption. Janet is given to a foster family, but after she is taken into hospital for major surgery, Billy and Honey decide to keep her. Janet leaves Walford with her brother, Will Mitchell, and Honey in September 2008 after her parent's marriage breaks down, however Janet and William have continued to visit Billy in Walford since then.", "Bryan Nolan, played by Mark Springer, is a charge nurse who works in the special care baby unit at Walford General Hospital. He looks after Janet Mitchell when she is born with Down's syndrome. Janet's parents Billy and Honey Mitchell (Perry Fenwick and Emma Barton) warm to Bryan, and Honey is upset when he is away on an NHS training course. Bryan hears that Honey wants to see him, and leaves the training course. He finds Billy and Honey's address and visits Honey, convincing her to give Janet a chance. He gives Janet a hat when she leaves hospital to go home.", "| A consultant paediatrician who works at Walford General Hospital, and advises Billy (Perry Fenwick) and Honey Mitchell (Emma Barton) about what to do when they discover that their baby, Janet had Down's syndrome. She gives them leaflets but Honey snaps at her.", "| A cardiologist who visits Billy (Perry Fenwick) and Honey Mitchell (Emma Barton) with the results of tests on their newborn daughter Janet. He reveals that Janet has holes between the ventricles and atria of her heart, which is common in children with Down's syndrome. He informs them of an operation Janet could have to correct it.", "| rowspan=\"2\"| Kim and her husband Tony are prospective foster parents of Janet Mitchell. When Janet's parents, Honey Mitchell (Emma Barton) and Billy Mitchell (Perry Fenwick), decide to have her adopted, Kim and Tony come to Walford to collect Janet. Kim sees that Billy is upset and suggests that they let Billy and Honey say goodbye to Janet alone. The next day, Janet has to have a heart operation, and Billy and Honey decide to have her back."]}, {"page": "List of EastEnders characters (1998)", "response": ["Billy Mitchell, played by Perry Fenwick, is a distant relative of Phil Mitchell (Steve McFadden). He is first seen as Jamie Mitchell (Jack Ryder)'s abusive guardian, and Jamie is eventually taken away from Billy by Phil. Billy has failed marriages with Little Mo Morgan and Honey Edwards (Kacey Ainsworth and Emma Barton), and sees the birth of his children, Janet (who has Down's syndrome) and Will Mitchell. In 2011, he makes contact with his granddaughter, Lola Pearce (Danielle Harold) for the first time."]}, {"page": "List of EastEnders characters (2001)", "response": ["Derek returns a few months later to help Denise Fox (Diane Parish) with a meeting in the community centre. Derek and Denise organise an Easter fair and he tries to get Carmel and Denise talking again after they fall out. He accepts a job at the Minute Mart and irritates his co-worker, Honey Mitchell (Emma Barton), when he makes fun of her display and constantly takes breaks. He annoys her further when they both attend Kim Fox-Hubbard's (Tameka Empson) quiz night alongside Billy Mitchell (Perry Fenwick) and Derek has to join their team, but they win the quiz thanks to Derek's knowledge. When Derek confronts shoplifter Keegan Baker (Zack Morris), Honey is pleased to have him working at the shop. While talking with Honey, Derek reveals that he has been chosen as the new face of the Minute Mart. Yolande Trueman (Angela Wynter) then visits and asks to speak with Derek and she informs him that he could lose his job and be kicked out of the back to work programme for failing to disclose his criminal record. Derek has another run-in with Keegan when he tries to steal a magazine and Keegan throws the magazine at Derek and calls him a queer. When Honey leaves Derek in charge of the shop Yolande calls and tells him that he is sacked. Upset, Derek lashes out at Johnny Carter (Ted Reilly) and berates him for not standing up to Keegan and tells him about the struggles of being a gay man while it was illegal. Johnny tracks Derek down at his flat and questions why he quit at the Minute Mart. Derek explains that he has a conviction that he failed to disclose from when he was younger as he had a boyfriend who was twenty, which was below the age of consent for homosexuals and that he was arrested and imprisoned for nine months. Johnny tells him that he can get pardoned for his conviction and Derek agrees. In December 2017, Honey mentions that Derek has left Walford and she is short staffed."]}, {"page": "Dominic Treadwell-Collins", "response": ["Treadwell-Collins also reintroduced several characters who had previously featured in the show, including Sonia Fowler (Natalie Cassidy) Stacey Branning (Lacey Turner), Dean Wicks (Matt Di Angelo), Les Coker (Roger Sloman), Jane Beale (Laurie Brett), Kathy Beale (Gillian Taylforth), Honey Mitchell (Emma Barton) Jack Branning (Scott Maslen), and Steven Beale (Aaron Sidwell) who all returned permanently, while the likes of Peggy Mitchell (Barbara Windsor), Nick Cotton (John Altman) and Grant Mitchell (Ross Kemp) returning for guest appearances. The characters of Shabnam Masood, Rebecca Fowler, Ben Mitchell, Martin Fowler, Louise Mitchell, Jordan Johnson and Belinda Peacock were also reintroduced, but the roles were recast to Rakhee Thakrar, Jasmine Armfield, Harry Reid, James Bye, Tilly Keeper, Joivan Wade and Carli Norris respectively."]}, {"page": "List of EastEnders characters (2008)", "response": ["| Billy (Perry Fenwick) and Honey Mitchell's (Emma Barton) bank manager, who gives them a loan."]}, {"page": "Ronnie Mitchell", "response": ["After two further months of rehabilitation, Vincent Hubbard (Richard Blackwood), a man who it is revealed Ronnie was seeing in the autumn of 2013, visits her. Roxy breaks down and admits that, while she was in her coma, she slept with Charlie in their upsets. Ronnie forgives her and tries to move forward, but has doubts about her marriage. When Vincent's wife Kim Fox-Hubbard (Tameka Empson) discovers that Ronnie and Vincent had dated before, she accuses Ronnie of having an affair with him, but she assures her that they are no longer together. On returning home, Ronnie sets up cameras to spy on Charlie and Roxy, paranoid they might sleep together again. Roxy starts a secret relationship with Dean Wicks (Matt Di Angelo), and Ronnie is furious when she finds out, as Dean raped Linda Carter (Kellie Bright). Dean finds Ronnie's hidden cameras, and Roxy moves out, feeling violated. Ronnie kisses and sleeps with Vincent again, despite them both being married. Ronnie admits she doesn't love Charlie, and ends their marriage. Charlie and Roxy come up with a plan to flee to France with Matthew, but Roxy secretly tells Ronnie and they plan to double cross Charlie and get him arrested. However, events backfire and Ronnie nearly loses Matthew, though Charlie returns to Walford soon after. Ronnie asks Vincent to help her get rid of Charlie, and he disappears, with Roxy finding his discarded wallet. She later asks Honey Mitchell (Emma Barton) to move in with her."]}, {"page": "Archie Mitchell", "response": ["At some point, Archie discovers that Peggy's daughter Sam (Danniella Westbrook) is back in Walford - having returned from Brazil despite being on the run for covering up the murder of the Queen Vic's original landlord and Phil's old enemy, Den Watts (Leslie Grantham). He soon observes a feud between Sam and Roxy, as the pair have never got on properly; with Roxy growing frustrated to learn that Sam's return has been kept from her. Archie later sees Roxy in the Square, following a row, and she tells him. He also learns of Sam's engagement to Janine's brother Ricky (Sid Owen) and gives them a gift - which they decline. When Sam is arrested, Archie puts up her bail money on the condition he can have his family back. He and Peggy celebrate, but their children return the money and their cousin Billy (Perry Fenwick) makes it clear to Archie that his family - including Peggy - still do not trust him. Outraged, Archie vows to get revenge on his family by taking The Queen Vic from them. He forms a partnership with Janine to carry out his scheme. He first plans to burn the pub down and frame Billy for the incident, but Peggy discovers this - though Archie is able to convince her that he was not involved and they kiss briefly. Archie later causes his family to lose the bail money for Sam by convincing her to abscond the country. This prompts Phil to borrow money from a loan shark named Isaacs, who later assaults him for not meeting the repayments; in response, Phil gets a loan from his stepson Ian Beale (Adam Woodyatt) - which is secured on The Queen Vic, thereby meaning that ownership of the pub would pass to Ian if Phil does not repay him in two weeks. Archie uses this opportunity to try and secure the Queen Vic by convincing Ian to sell the debt to him, but Ian refuses. Janine carries out Archie's scheme by seducing Ian, and recording them having sex together. She then blackmails him into selling the debt to Archie, whom she claims to be in a relationship with; Ian is forced to agree when he fears the pair will expose the recording to his wife Jane (Laurie Brett) and threaten Ben should the latter get involved. Archie later proposes to Janine for her efforts, and she accepts. Billy soon discovers Archie's plot upon hearing him and Janine talking about their engagement. After discovering that Billy had overheard their plans, they convince Billy to let them make him an offer so he could be on their side; Billy reluctantly agrees when they persuade his ex-wife Honey (Emma Barton) to bring their children over for Christmas and New Year to spend time with their father."]}, {"page": "Children in Need 2008", "response": ["* Emma Barton from EastEnders performed \"You to Me are Everything\""]}, {"page": "List of EastEnders characters (2009)", "response": ["In January 2016, Billy Mitchell (Perry Fenwick) and his fiancée Honey (Emma Barton) learn that Joel and his wife Stephanie have died in a speedboating accident. Although Billy is reluctant to tell Ronnie, they eventually do, leaving Ronnie shaken. She and Honey later go and put flowers on Joel's grave.", "In January 2016, Ronnie learns from Billy (Perry Fenwick) and Honey Mitchell (Emma Barton) that Joel and Stephanie have died in a speedboat accident."]}, {"page": "Celebrity Mastermind", "response": ["| rowspan=\"4\"|21 December 2014 || Emma Barton ||The Carry On Films|| 3rd"]}, {"page": "List of awards and nominations received by EastEnders", "response": ["| I'm a Survivor || Emma Barton (Honey Mitchell) || "]}, {"page": "Mitchell family", "response": ["By December 2020, a total of ten Mitchell blood relatives appear on the programme: Phil; his sons Ben (Max Bowden) and Raymond Dawkins; Ben's daughter Lexi Pearce (Isabella Brown); Sam's son Ricky (Henri Charles); Roxy's daughter Amy (Abbie Knowles); Phil's second cousin Billy (Perry Fenwick) and his children, Janet (Grace) and son Will (Freddie Phillips); and Billy's granddaughter Lola Pearce (Danielle Harold). There are others that marry into the family, like Billy's ex-wife Honey (Emma Barton), while Ben's best-friend Jay Brown, sometimes credited as Jay Mitchell, is also considered to be part of the family.", "Roxy and Ronnie's relationship becomes complicated when Roxy has a one-night stand with Ronnie's on-off boyfriend, Jack Branning (Scott Maslen), and gets pregnant, giving birth to a daughter that she names Amy Mitchell that November. Suzy Branning (Maggie O'Neill), Phil's latest girlfriend, reveals on Christmas Day 2008 that Roxy's husband, Sean Slater (Robert Kazinsky), is not Amy's father, resulting in their divorce. Billy marries Honey Edwards (Emma Barton), and have two children together: Janet, who has Down's Syndrome, and William. Billy and Honey divorce several years later, and Honey moves away with the children."]}]}}