{"wiki_id": "http://www.wikidata.org/entity/Q5372072", "itemLabel": "Emily Blatchley", "itemDescription": "Missionary in China", "wikipedia_url": "https://en.wikipedia.org/wiki/Emily_Blatchley", "wikipedia_page": {"main": "Emily Blatchley (c. 1842 – 26 July 1874) was a British Protestant Christian missionary to China with the China Inland Mission. She pioneered the work of single women missionaries in China and served as personal secretary to the founder of the mission, James Hudson Taylor.", "link_mentions": [{"page": "Highgate Cemetery", "response": ["* Emily Blatchley, pioneering Protestant Christian missionary to China"]}, {"page": "Hudson Taylor", "response": ["In 1868 another child, Charles, was born into the Taylor family, and in 1870, Taylor and his wife made the difficult decision to send their older three surviving children (Bertie, Freddie, and Maria—Samuel died earlier that year) home to England with Miss Emily Blatchley. In July, Noel was born, though he died of malnutrition and deprivation two weeks later due to Maria's inability to nurse him. Maria herself died several days later, with the official cause of death being cholera. Her death shook Taylor deeply, and in 1871, his own health began deteriorating further, leading to his return to England later that year to recuperate and take care of business items.", "Back in England, Taylor was married to Jane Elizabeth Faulding who had been a fellow missionary since 1866. Hudson and \"Jennie\" returned to China in late 1872 aboard the MM Tigre. They were in Nanjing when Jennie gave birth to stillborn twins—a boy and a girl in 1873. Two years later, the Taylors were forced to return once again to England because of the death of the mission secretary and their children's caretaker, Emily Blatchley."]}, {"page": "Herbert Hudson Taylor", "response": ["On arrival in China, the family adopted Chinese clothing and food and set off to find a place to establish a mission center in Zhejiang. On the way, Herbert almost drowned when he fell overboard into the Grand Canal of China during their travels. Another scare happened shortly afterward when he was bitten by a dog on the face. His sister, Grace Dyer Taylor died of meningitis near Hangzhou within the first year. When he was six the family was nearly killed by a rioting mob during the Yangzhou riot in 1868. Finally in 1870 he was sent home with his surviving siblings with Emily Blatchley to live in London, separated from his parents. His mother died in China soon after they arrived home."]}, {"page": "Grace Dyer Taylor", "response": ["On board the tea clipper Lammermuir, Grace shared a cabin with Emily Blatchley, who was in charge of teaching the Taylor children. Jennie Faulding was one of the first to take note of Grace's apparent conversion to Christianity along with a number of the crew while they sailed across the Indian Ocean. The Lammermuir was almost wrecked by two typhoons before arriving in battered shape at Shanghai. No lives were lost, but the passengers and crew were weary and exhausted on their arrival."]}, {"page": "Frederick Howard Taylor", "response": ["Howard Taylor was three when his father founded the China Inland Mission. He was born in London during his parents’ first furlough in England together. In 1866 at the age of four he was taken with his parents, 3 siblings  and sixteen other missionaries to China aboard the Lammermuir (clipper) as part of the famous Lammermuir Party. During the 4-month long voyage the ship was nearly wrecked by 2 typhoons. His sister, Grace Dyer Taylor died of meningitis the first year. When he was six the family was nearly killed by a rioting mob during the Yangzhou riot in 1868. Finally in 1870 he was sent home with his surviving siblings with Emily Blatchley to live in London, separated from his parents. His mother died in China soon after they arrived home in 1870."]}, {"page": "List of Protestant missionaries in China", "response": ["| Emily Blatchley"]}, {"page": "Jennie Faulding Taylor", "response": ["Jane Elizabeth Faulding was the daughter of a piano manufacturer in London. She was an 1865 graduate of the Home and Colonial Training College along with her friend, Emily Blatchley. She attended the weekly prayer meeting at the home of Hudson & Maria Taylor in the East End of London in 1865. She was influenced by the Taylors and their book: \"China's Spiritual Need and Claims\", that spoke of the desperate need for the Gospel message to be brought to the Chinese before they died \"without God and without hope in the world\"."]}, {"page": "Lammermuir Party", "response": ["The badly damaged ship caused a local stir in Shanghai. Emily Blatchley noted:", "* Emily Blatchley, London, Secretary to Hudson Taylor, Editor of the Occasional Papers, and governess for the Taylor children. d. July 1874 in London from tuberculosis."]}, {"page": "William David Rudland", "response": ["After his marriage to Mary, they moved to Zhenjiang where he set up the mission press. A few weeks later, Taylor asked him to visit the new mission house in Yangzhou. Yangzhou Riot. On the night they arrived, riots broke out. Taylor went to the Prefect to discuss the problem. While he was gone, rioters broke through the stone walls, looting and burning everything they could get their hands on. William, Mary, Maria Taylor, and Emily Blatchley became trapped on the third floor. William very carefully lowered eight-month pregnant Mary down from the balcony to the waiting arms of Henry Reid. Mary, her sister Annie, and the Taylor children made their way to the well room to hide. William did his best to hold off the rioters so the others could escape. A rioter struck him in the head and cut his arm. He lowered himself down from the third floor then rushed to the well room to help the others find a safe home until the soldiers arrived to break up the riots.  Almost a year later the Chinese government awarded him a permanent disability."]}, {"page": "Yangzhou riot", "response": ["When the riot broke out the following members of the China Inland Mission were in Yangzhou : Mr. and Mrs. Hudson & Maria Taylor with four children (Herbert, Frederick, Samuel & Maria), Miss Emily Blatchley, Miss Louise Desgraz, Mr. and Mrs. William David Rudland, and Messrs. George Duncan and Henry Reid."]}, {"page": "Blatchley", "response": ["*Emily Blatchley (1842–1874), British Protestant Christian missionary to China with the China Inland Mission"]}, {"page": "List of domestic workers", "response": ["* Emily Blatchley, governess and missionary"]}]}}