{"wiki_id": "http://www.wikidata.org/entity/Q5386099", "itemLabel": "Eric Batten", "itemDescription": "English rugby union footballer, and rugby league footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Eric_Batten", "wikipedia_page": {"main": "Frederick \"Eric\" E. Batten (13 June 1914 – 3 September 1993) was an English rugby union and professional rugby league footballer who played in the 1930s, 1940s and 1950s, and coached rugby league in the 1950s. He played club level rugby league (RU) for Sandal RUFC, and representative level rugby league (RL) for Great Britain and England, and at club level for Wakefield Trinity (Heritage № 393) (two spells, including the second as a World War II guest), Hunslet, Featherstone Rovers (Heritage № 178) (four spells, including the first three as a World War II guest) (captain), Leeds (two spells, including the first as a World War II guest), Castleford (Heritage № 221) (World War II guest) and Bradford Northern, as a wing, i.e. number 2 or 5, and coached at club level for Featherstone Rovers, and Batley. Eric Batten appeared in eight Challenge Cup Finals; two for Leeds, five for Bradford Northern, and one for Featherstone Rovers, winning three, and losing five, he scored a total of 443 tries during his career, he his third on the all-time try scorers list behind Brian Bevan (796 tries), and Billy Boston (571 tries),", "link_mentions": [{"page": "Featherstone Rovers", "response": ["Eric Batten came in as player-coach in the summer of 1951. From rock bottom strugglers, Featherstone were gradually transformed into a fit and competitive side, capable of matching the best in the league on their day. Rovers' first visit to Wembley Stadium was in the 1952 Challenge Cup Final, the first to be televised. They were defeated 18–10 by Workington Town in front of a crowd of 72,093.", "* Eric Batten", "|1950–51 season || 1953–54 season || Eric Batten || ", "| 1951–56 || Eric Batten || 210 || 102 || 100 || 8 || 48.57% || Challenge Cup Runners-Up (1952)"]}, {"page": "Batley Bulldogs", "response": ["|Eric Batten || October 1956 – April 1958"]}, {"page": "Ernest Ward", "response": ["Bradford Northern played in five of the six Challenge Cup finals between 1944 and 1949, the first two finals; the 1943–44 Challenge Cup Final against Wigan, and the 1944–45 Challenge Cup Final against Huddersfield were played over two-legs, five Bradford Northern players played in all five of these finals, they were; Eric Batten, Vic Darlison, Donald Ward, Ernest Ward, and Frank Whitcombe."]}, {"page": "List of Bradford Bulls internationals", "response": ["* Eric Batten won caps for England while at Hunslet in 1938 against Wales, in 1939 against France, Wales, in 1940 against Wales, in 1941 against Wales, in 1943 against Wales, while at Bradford Northern in 1944 against Wales, in 1945 against Wales (2 matches), in 1946 against France (2 matches), Wales, in 1947 against France, in 1948 against France, and won caps for Great Britain while at Bradford Northern in 1946 against Australia (2 matches), New Zealand, in 1947 against New Zealand "]}, {"page": "Billy Batten", "response": ["Batten was known for his trademark \"Batten Leap\" – his ability to hurdle players. He passed this trick on to his son Eric Batten, but the tactic was later outlawed because of its potential dangers.", "Billy Batten had two brothers who were also famous players and the Batten dynasty continued with his three sons who all played at the top level, with Eric appearing in a record eight Challenge Cup Finals. Batten's marriage to Annie (née Glover) (birth registered second ¼ 1889 in Hemsworth district) was registered during first ¼ 1909 in Wakefield district. They had children; William Batten (birth registered during third ¼ 1909 in Hemsworth district), Sydney M. Batten (birth registered during third ¼ 1911 in Hemsworth district), Mary Batten (birth registered during first ¼ 1913 in Hemsworth district), Frederick E. Batten (birth registered during third ¼ 1914 in Hemsworth district), Florence M. Batten (birth registered during third ¼ 1916 in Hemsworth district), Emily Batten (birth registered during second ¼ 1919 in Hemsworth district), Ann V. Batten (birth registered during third ¼ 1923 in Hemsworth district), and Robert Batten (birth registered during first ¼ 1927 in Hemsworth district). Batten's sons; Eric Batten, Billy Batten Jr. and Bob Batten (Castleford 1951–55), were also top class rugby league footballers, as was Billy Batten, Jr.'s son, the rugby league footballer Ray Batten, he was also the uncle of the rugby league footballer Stan Smith."]}, {"page": "Batten (surname)", "response": ["* Eric Batten, English rugby league footballer"]}]}}