{"wiki_id": "http://www.wikidata.org/entity/Q5388442", "itemLabel": "Erik", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Erik_(British_singer)", "wikipedia_page": {"main": "Erik (born Erica Harrold) began her career as a session singer for artists such as M People, Tom Jones, Swing Out Sister, Jason Donovan, Vic Reeves and Errol Brown. She was the featured vocalist in the 1991 dance single \"Unity\", by the group of the same name. It was a club hit and peaked at No. 64 on the UK Singles Chart. Under her original name, Erik also recorded vocals for the single \"No More\", by Unique 3, in 1991.\nIn 1993, she started her solo career. She signed to PWL Records and released the Mike Stock & Pete Waterman-produced single \"Looks Like I'm in Love Again\", which peaked at No. 46 on the UK chart. Her next single, \"The Devil and the Deep Blue Sea\", was never officially released. In 1994, she released a cover of the Cheryl Lynn classic \"Got to Be Real\", which became her biggest hit. Later that year, she released her last single, \"We Got the Love\", which peaked at No. 55, originally recorded by Lindy Layton.In January 2010, an album titled Real, including her work recorded at PWL Studios during 1993-1994 was released through iTunes. It includes eight previously unreleased songs.", "link_mentions": [{"page": "List of one-word stage names", "response": ["* Erik, British singer", "* Erik  (born 1984), American wrestler"]}, {"page": "List of songs produced by Stock Aitken Waterman", "response": ["| Key West feat. Erik", "| Erik", "| Eriksen, Hermansen, Martin"]}, {"page": "Got to Be Real", "response": ["==Erik version==", "In 1993, British singer Erik released a cover of \"Got to Be Real\", produced by Pete Waterman and Dave Ford. To date, it is her most well-known song, resulting in a UK club smash hit and peaking at number 42 on the UK Singles Chart.https://www.officialcharts.com/artist/29514/erik/", "Pan-European magazine Music & Media commented, \"It's the second time around for this pop/dance ditty from the mid-'80s. With three mixes to chose from, hit potential is greatly enhanced.\" Andy Beevers from Music Week gave the song four out of five. He wrote, \"Erik has taken Cheryl Lynn's late Seventies dancefloor anthem and interpreted it in a bang up-to-date disco house style. The result has been solid club support and its abundance of catchy hooks should earn some radio plays.\" "]}, {"page": "Eric (disambiguation)", "response": ["Eric, Erik, Erich, or Erick may also refer to:", "* Erik (album), a 2004 album by Erik Rubin", "* Erik (HBC vessel), a propeller driven steamship", "* Erik (The Phantom of the Opera), the title character from Gaston Leroux's 1910 novel Le Fantôme de l'Opéra", "* Erik (Vietnamese singer)", "* Erik (British singer)", "* Erik (album), a 2004 album by Erik Rubin", "* Erik (wrestler), American professional wrestler"]}]}}