{"wiki_id": "http://www.wikidata.org/entity/Q5387716", "itemLabel": "Eric Webster", "itemDescription": "English footballer and manager (1931-2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eric_Webster", "wikipedia_page": {"main": "Eric Webster (24 June 1931 – 24 January 2016) was an English association football player and coach.", "link_mentions": [{"page": "Stockport County F.C.", "response": ["The club was relegated back to the Fourth Division at the end of the 1969–70 campaign, and remained in the fourth tier until 1991. Eric Webster managed Stockport on five separate occasions, four of which were as caretaker manager during the 1980s, having first joined the club in 1974 as youth coach.Freeman & Harnwell, pp. 83–84 Following the introduction of automatic promotion and relegation between the Football League and the Football Conference at the start of the 1986–87 season, Stockport faced the prospect of non-League football, with just six points from 13 games. However, Colin Murphy was brought in for his second spell as manager, and Stockport gained 45 points from their final 31 games to remain in the division, although Murphy left shortly after the season."]}, {"page": "Hyde United F.C.", "response": ["|align=\"left\"| Eric Webster||align=centre|Manager||align=centre|1968||align=centre|1972"]}, {"page": "Oshor Williams", "response": ["It was at County that Williams found his feet, becoming a favourite with the Stockport fans. A quick Winger with an eye for goal, Williams was at his most dangerous with the ball at his feet attacking the opposition full back. He acted as the captain whenever skipper Tommy Sword was unavailable. In four-and-a-half seasons at Edgeley Park, Williams played 216 games in all competitions, scoring 31 goals, before being surprisingly sold to Port Vale for £7,000 in November 1984. Under Jimmy McGuigan's stewardship, the \"Hatters\" struggled in the lower half of the Fourth Division table in 1979–80, 1980–81, and 1981–82. Their form improved slightly under new boss Eric Webster in the 1982–83 and 1983–84 campaigns."]}, {"page": "History of Stockport County F.C.", "response": ["After the club was relegated at the end of they 1969–70 campaign, the 1970s and 1980s were times of mediocrity and struggles against relegation. In October 1972 Stockport eliminated West Ham United from the League Cup, helped by goalkeeper Alan Ogley,Freeman & Harnwell, p.54 whose save was voted Stockport's 'Save of the century' in 2002.Nelson, p.45 Stockport were eliminated in the next round against Norwich City. George Best made three appearances for Stockport in 1975, all home matches, scoring two goals.Nelson, p.51Freeman & Harnwell, pp.56-57 In February 1984, Stockport competed in the Associate Members' Cup; a competition that Stockport chairman, Yugoslavian hotelier Dragan Lukic helped create. The match, against Crewe Alexandra finished 2–2 after extra time and was decided in Stockport's first penalty shoot-out, which they lost 3–0. Eric Webster managed Stockport on five separate occasions, four of which were as caretaker manager during the 1980s, having first joined in 1974 to look after the youth set up.Freeman & Harnwell, pp. 83–84 Webster signed Micky Quinn from Wigan Athletic and also received £2,000 from Wigan for the transfer. After 16 years service with the club, Webster was awarded a testimonial match against Manchester City in August 1990. Following the introduction of automatic promotion and relegation between the Football League and the Conference at the start of the 1986–87 season, Stockport faced the prospect of non-League football, with just six points from 13 games. However, Colin Murphy was brought in for his second spell as manager, and Stockport gained 45 points from their final 31 games to survive, although Murphy left shortly after the end of the season."]}, {"page": "Brian Lloyd", "response": ["Ahead of the start of the following season Lloyd was back at Stockport County, who were now managed by Jimmy McGuigan. He missed just one game in two seasons back at Edgeley Park, and even managed to get on the scoresheet against Bradford City in 1982. County hovered above the Fourth Division re-election zone in 1981–82 and 1982–83 under the stewardship of Eric Webster. Lloyd dropped into non-league football, having spells with North Wales sides Bangor City (Alliance Premier League and Northern Premier League), Colwyn Bay (North West Counties League), Rhyl and Lex XI."]}]}}