{"wiki_id": "http://www.wikidata.org/entity/Q5388807", "itemLabel": "Erik Routley", "itemDescription": "British hymnologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Erik_Routley", "wikipedia_page": {"main": "Erik Reginald Routley (; 31 October 1917 – 8 October 1982) was an English Congregational minister, composer and musicologist. He was educated at Lancing College and Magdalen and Mansfield Colleges in Oxford. He was chaplain of Mansfield from 1948 to 1959 and then held appointments as minister in Edinburgh and Newcastle before becoming Professor of Church Music at Westminster Choir College, Princeton, New Jersey in 1975.\nHis publications include Congregational Praise (1951), The University Carol Book (1961), A Short History of English Church Music (1977) and other critical and historical works on hymnody, church music and carols. He wrote the preface to the Summit Choir Book, and composed several hymn tunes. such as SHARPTHORNE and ABINGDON.  Routley also wrote hymn texts, including \"All who love and serve your city\" and the translation \"There in God's garden stands the Tree of Wisdom\".", "link_mentions": [{"page": "Mansfield College, Oxford", "response": ["* Erik Routley, composer and musicologist"]}, {"page": "Carol (music)", "response": ["*The University Carol Book ed. Erik Routley (1961)"]}, {"page": "Lancing College", "response": ["* Erik Routley (1917–1982), Congregational minister, composer and musicologist"]}, {"page": "Be Thou My Vision", "response": ["The hymn is sung to the melody noted as “Slane” in hymnals, an Irish folk tune in  time, first published as \"With My Love on the Road\" in Patrick Joyce's Old Irish Folk Music and Songs in 1909.Patrick Joyce, Old Irish Folk Music and Songs, 1909, p. 151 The tune is a more elemental distillation of earlier forms, such as \"The Hielan's o' Scotland' and \"By the Banks of the Bann,\" also compiled in Joyce (1909). The words of \"Be Thou My Vision\" were first combined with this tune in 1919 (harmonised by  Leopold L Dix, 1861-1935), and in a new version harmonised by David Evans in 1927. A further version was harmonised by Erik Routley for the English Hymnal.Corymbus. Be Thou My Vision"]}, {"page": "Henry Francis Lyte", "response": ["Leon Litvack has written in the Oxford Dictionary of National Biography that although Lyte's \"poetic energies were directed at scripturally and evangelically minded audiences, his lyric gift was universally appreciated. The example of ‘Abide with me’ is instructive: intensely personal and contemplative, yet nationally popular—even being sung (always, after its publication in 1861, to W. H. Monk's tune, ‘Eventide’) on secular occasions such as at football matches, and especially, since 1927, at the English cup final.\"  The 20th-century hymnologist Erik Routley referred to the \"much-loved H. R. Lyte\" who \"though scriptural and evangelical in his emphases, always writes good literature and is rarely deserted by an exquisite lyric gift. Perhaps the centrally 'romantic' hymn of all hymns is the intensely personal yet, as it has proved, wholly universal hymn, 'Abide with me.'\"Erik Routley, A Panorama of Christian Hymnody (Collegeville, Minnesota: The Liturgical Press, 1979), 45."]}, {"page": "Caleb Simper", "response": ["There is still some demand for simple, practical church music. However, history has not been kind to the efforts of a group of Victorian musicians who produced  many oratorios and cantatas in this category. In his A Short History of English Church Music, Erik Routley traced John Stainer's The Crucifixion (1887) as the archetypal work that others imitated, and often diluted. "]}, {"page": "Calvin Hampton", "response": ["Hampton also composed music for the church and the concert stage. In 1974, he composed music for Walter Leyden Brown's production of Herman Melville's Pierre, or the Ambiguities, which was produced at La MaMa Experimental Theatre Club in the East Village of Manhattan.La MaMa Archives Digital Collections. \"Production: Herman Melville's  Pierre, or the Ambiguities (1974)\". Accessed August 7, 2018. Before Hampton's death, Erik Routley, an authority on church music, called Hampton \"the greatest living composer of hymn tunes.\" His settings of the Episcopal liturgy are also used in Catholic churches, and his choral works are innovative and challenging pieces of sacred music."]}, {"page": "Once in Royal David's City", "response": ["In The English Carol, Erik Routley notes that Mann's unaccompanied arrangement of Gauntlett's original hymn changes the character of the work into one which emphasises the acoustic space of the chapel: \"with subtle art that arrangement turns the homely children's hymn into a processional of immense spaciousness.\""]}, {"page": "Nearer, My God, to Thee", "response": ["The Methodist Hymn Book of 1933 includes Horbury and two other tunes, \"Nearer To Thee\" (American) and \"Nearer, My God, To Thee\" (T C Gregory, 1901–?),Methodist Hymn Book, 1933, Hymn 468 while its successor Hymns and Psalms of 1983 uses Horbury and \"Wilmington\" by Erik Routley.Hymns and Psalms, 1983, Hymn 451 Songs of Praise includes Horbury, \"Rothwell\" (Geoffrey Shaw) and \"Liverpool\" (John Roberts/Ieuan Gwyllt, 1822–1877)Songs of Praise, 1931, Hymn 586 Liverpool also features in the BBC Hymn Book of 1951BBC Hymn Book, 1951, Hymn 332 and the Baptist Hymn Book of 1962 (with Propior Deo)Baptist Hymn Book, 1962, Hymn 598 The original English Hymnal includes the hymn set to Horbury,English Hymnal, 1933, Hymn 444 while its replacement New English Hymnal drops the hymn. Hymns Ancient and Modern included Horbury and \"Communion\" (S S Wesley),Hymns Ancient and Modern Standard Edition, 1922, Hymn 277 although later versions, including Common Praise, standardise on Horbury.Common Praise, 2000, Hymn 526"]}, {"page": "Sussex Carol", "response": ["An earlier version using a different tune and a variation on the first line, \"On Christmas night true Christians sing\", was published as early as 1878 in Henry Ramsden Bramley and John Stainer's Christmas Carols New and Old.Henry Ramsden Bramley and John Stainer, Christmas Carols New and Old (London: Novello, Ewer & Co., ca 1878) The carol has been arranged by a number of composers. Vaughan Williams' setting is found in his Eight Traditional English Carols.Ralph Vaughan Williams, Eight Traditional English Carols, (Stainer & Bell, 1919) Several years earlier, Vaughan Williams had included the carol in his Fantasia on Christmas Carols, first performed at the 1912 Three Choirs Festival at Hereford Cathedral.Ralph Vaughan Williams, Fantasia on Christmas Carols (Stainer & Bell, 1912) Erik Routley's arrangement in the 1961 University Carol Book adds a modal inflection to the setting.Erik Routley, \"Sussex Carol\" in The University Carol Book (reprint: Banks Music Publications, 2007) The carol often appears at the King's College \"Festival of Nine Lessons and Carols\", where it is performed in arrangements by either David Willcocks or Philip Ledger, both former directors of music at the chapel.Order of Service 2002, kings.cam.ac.ukOrder of Service 2005, kings.cam.ac.uk, p.20 Willcocks's arrangement appears in the first OUP Carols for Choirs.Willcocks, Jacques, Carols for Choirs (Oxford University Press)"]}, {"page": "How Great Thou Art", "response": ["===Erik Routley (1982)===", "Eminent British hymnologist Erik Routley (born 31 October 1917; died 1982) so disliked both the hymn and its melody, he wrote a new text, “O Mighty God” and re-harmonised the Swedish tune in 1982. This was one of his last works before his death. His translation was included as hymn 466 in Rejoice in the Lord: A Hymn Companion to the Scriptures (1985).Erik Routley, ed. Rejoice in the Lord: A Hymn Companion to the Scriptures (Grand Rapids, MI: Wm. B. Eerdmans, 1985)."]}, {"page": "Hymnology", "response": ["Hymnology (from Greek ὕμνος hymnos, \"song of praise\" and -λογία -logia, \"study of\") is the scholarly study of religious song, or the hymn, in its many aspects, with particular focus on choral and congregational song. It may be more or less clearly distinguished from hymnody, the creation and practice of such song. Hymnologists, such as Erik Routley, may study the history and origins of hymns and of traditions of sung worship, the biographies of the women and men who have written hymns that have passed into choral or congregational use, the interrelationships between text and tune, the historical processes, both folk and redactional, that have changed hymn texts and hymn tunes over time, and the sociopolitical, theological and aesthetic arguments concerning various styles of sung worship."]}, {"page": "Immortal, Invisible, God Only Wise", "response": ["\"Immortal, Invisible, God Only Wise\" is a Christian hymn with words by the Free Church of Scotland minister, Walter Chalmers Smith, usually sung to the tune, \"St. Denio\", originally a Welsh ballad tune, which became a hymn (under the name \"Palestrina\") in  (\"Hymns of the Sanctuary\", 1839) edited by John Roberts (Welsh bardic name: ) (1822–1877).Jacqui James, Between the Lines: Sources for Singing the Living Tradition, 2nd edition (Boston: Skinner House Books, 2001), 35.  Of this hymn, musicologist Erik Routley has written:", "\"[Immortal, Invisible] should give the reader a moment's pause.  Most readers will think they know this hymn, the work of another Free Kirk minister.  But it never now appears as its author wrote it, and a closer look at it in its fuller form shows that it was by no means designed to be one of those general hymns of praise that the parson slams into the praise-list when he is in too much of a hurry to think of anything else but a hymn about the reading of Scripture.  Just occasionally editorial tinkering changes the whole personality of a hymn; it has certainly done so here.\"Erik Routley, A Panorama of Christian Hynmnody (Collegeville, Minnesota: Liturgical Press, 1979), 132. When first published in Hymns of Christ and the Christian Life (1867), the hymn had six verses. https://archive.org/details/hymnschristandc00smitgoog (pp. 210–211)."]}, {"page": "Choir of Leeds Parish Church", "response": ["The parish church uses the New English Hymnal and its 2006 supplement \"New English Praise\" 2006; the Worcester Psalter edited by Sir Ivor Atkins provides the pointing of the psalms. Other collections include Anthems for Unison and Two-Part Singing, Volumes and 2 RSCM, Anthems for Men's Voices, the Favourite Anthem Book Volume 5, Sing Low Novello edited by Dr Barry Rose, Advent for Choirs edited by Malcolm Archer & Stephen Cleobury, Lent, Passiontide and Easter for Choirs edited by Lionel Dakers and John Scott, Hilariter [RSCM Ripon and Leeds] - a resource book for Eastertide edited by Simon Lindley, The University Carol Book - edited by Dr Erik Routley and Hymns for Choirs edited by Sir David Willcocks, and 100 Carols for Choirs edited by Sir David Willcocks and John Rutter."]}, {"page": "Personent hodie", "response": ["The carol became more prominent in England after being arranged for unison voices and orchestra in 1916 by Gustav Holst (1874–1934), where in its organ reduction it is often used as a processional hymn in church and cathedral services.Personent hodie arranged by Gustav Holst at the Choral Public Domain Library, URL accessed 4 January 2009 Holst's version often forms part of the Festival of Nine Lessons and Carols, and was last featured in the service broadcast by BBC2 from King's College Chapel, Cambridge in 2011 following the sixth lesson.Nine Lessons and Carols 2011 order of service at the Choir of King's College, Cambridge website, URL accessed 31 December 2011 This arrangement is sometimes referred to as \"Theodoric\" in reference to the composer's middle name (Theodore)Erik Routley, An English-speaking Hymnal Guide, (London: Liturgical Press, 1979), p.140 and, in this setting, is the tune used for Percy Dearmer's hymn God is love, his the care.God is love, his the care, at Hymnary.org, URL accessed 20 May 2020"]}, {"page": "Eric Routley", "response": ["#redirectErik Routley"]}, {"page": "Wych Cross", "response": ["A hymn tune named WYCH CROSS was composed by Erik Routley, who was born in Brighton, about 20 miles south of Wych Cross."]}, {"page": "Routley, Erik", "response": ["#REDIRECT Erik Routley"]}, {"page": "Routley", "response": ["*Erik Routley (1917–1982), English composer and musicologist"]}, {"page": "The Babe in Bethlem's Manger", "response": ["The writer of the carol is not known. However, the lyrics are traditionally described as being a traditional folk hymn from the English county of Kent. However Erik Routley noted that its composition was \"very much of the 18th century\". It was first published in print in 1871 by the Church of England's Reverend Henry Ramsden Bramley and hymn writer John Stainer in Christmas Carols New and Old. Bramley included the commonly used tune for the carol. Christopher Chope's 1894 Carols for use in Church attributed the words as being Kentish, which was later confirmed by R R Terry in 1923 in his Old Christmas Carols anthology. The carol later passed into North America and was later published in the Evangelical Lutheran Church's Wartburg Hymnal in 1918. In 1960, it was published in the Church of Ireland's The Church Hymnal."]}]}}