{"wiki_id": "http://www.wikidata.org/entity/Q538826", "itemLabel": "Mat Collishaw", "itemDescription": "English artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mat_Collishaw", "wikipedia_page": {"main": "Matthew \"Mat\" Collishaw Hon. FRPS (born 1966) is an English artist based in London\n\nCollishaw's work uses photography and video. His best known work is Bullet Hole (1988), which is a closeup photo of what appears to be a bullet hole wound in the scalp of a person's head, mounted on 15 light boxes. Collishaw took the original image from a pathology textbook that actually showed a wound caused by an ice pick. Bullet Hole was originally exhibited in Freeze, the group show organised by Damien Hirst in 1988 that launched the YBA (Young British Artists). It is now in the collection of the Museum of Old and New Art in Hobart, Australia.", "link_mentions": [{"page": "Camberwell", "response": ["The core of the later-to-be YBAs, graduated from the Goldsmiths BA Fine Art degree course in the classes of 1987–90. Liam Gillick, Fiona Rae, Steve Park and Sarah Lucas, were graduates in the class of 1987. Ian Davenport, Michael Landy, Gary Hume, Anya Gallaccio, Henry Bond and Angela Bulloch, were graduates in the class of 1988; Damien Hirst, Angus Fairhurst, Mat Collishaw, Simon Patterson, and Abigail Lane, were graduates from the class of 1989; whilst Gillian Wearing, and Sam Taylor-Wood, were graduates from the class of 1990. During the years 1987–90, the teaching staff on the Goldsmiths BA Fine Art included Jon Thompson, Richard Wentworth, Michael Craig-Martin, Ian Jeffrey, Helen Chadwick, Mark Wallinger, Judith Cowan and Glen Baxter. Collishaw has a studio in a pub in Camberwell. as does the sculptor Anish Kapoor.Architects Journal June 2012 http://www.architectsjournal.co.uk/news/daily-news/caseyfierro-unwraps-anish-kapoor-studio/8625145.article"]}, {"page": "Young British Artists", "response": ["The core of the YBA group graduated from the Goldsmiths BA Fine Art degree course in the classes of 1987–90. Liam Gillick, Fiona Rae, Steve Park and Sarah Lucas, were graduates in the class of 1987. Ian Davenport, Michael Landy, Gary Hume, Anya Gallaccio, Lala Meredith-Vula, Henry Bond, Angela Bulloch, were graduates in the class of 1988; Damien Hirst, Angus Fairhurst, Mat Collishaw, Simon Patterson, and Abigail Lane, were graduates from the class of 1989; whilst Gillian Wearing, and Sam Taylor-Wood, were graduates from the class of 1990. During the years 1987–1990, the teaching staff on the Goldsmiths BA Fine Art included Jon Thompson, Richard Wentworth, Michael Craig-Martin, Ian Jeffrey, Helen Chadwick, Mark Wallinger, Judith Cowan and Glen Baxter.", "There was a less prominent predecessor organized by artist Angus Fairhurst, featuring himself, Damien Hirst, Abigail Lane, and Mat Collishaw in a small show called \"Progress by Degree\" at the Bloomsbury Gallery of the University of London (Institute of Education) shortly before Freeze.Blanché, Ulrich (2018). Damien Hirst. Gallery Art in a Material World. Baden-Baden, Tectum Verlag, p. 68.", "* Mat Collishaw", "* Mat Collishaw"]}, {"page": "Tracey Emin", "response": ["Like the George Michael and Kenny Goss neon, Emin created a unique neon work for her supermodel friend Kate Moss called Moss Kin. In 2004, it was reported that this unique piece had been discovered dumped in a skip in east London. The piece, consisting of neon tubing spelling the words Moss Kin, had been mistakenly thrown out of a basement, owned by the craftsman who made the glass. The artwork was never collected by Moss and had therefore been stored for three years in the basement of a specialist artist used by Emin in the Spitalfields area. It was accidentally dumped when the craftsman moved.\"Emin artwork found dumped in skip\" , BBC, 9 June 2004. Retrieved 25 February 2008. The term used in the work Kin is a recurring theme of Emin's to describe those dear to her, her loved ones. Other examples can be seen in a monoprint called MatKin dedicated to her then boyfriend artist Mat Collishaw and released as an aquatint limited edition in 1997.Lot 110: Tracey Emin (b. 1963), Invaluable.com. Retrieved 6 May 2016. Emin created a nude drawing of Kate Moss known as Kate (2000), signed and dated as 1 February 2000 in pencil by the artist.  In 2006 the same image was released as a limited edition etching, but renamed as Kate Moss 2000 (2006).", "Monoprint drawings of mothers and children that Emin drew during a pregnancy in 1990 were included in a 2010 joint exhibition with Paula Rego and Mat Collishaw at the Foundling Museum.", "For the Venice Biennale, she produced a series of new purple neon works, for example, Legs I (2007). This 2007 series of Legs neon works were directly inspired by the Purple Virgin (2004) watercolour series. For example, Legs IV (2007) directly follows the watercolour lines of the Purple Virgin 9 (2004). For a joint 2010 exhibition with Paula Rego and Mat Collishaw she decorated the front of the Foundling Museum with the neon words \"Foundlings and fledglings are angels of this earth\".", "*Film about joint 2010 exhibition with Paula Rego and Mat Collishaw at the Foundling Museum – The Guardian"]}, {"page": "List of contemporary artists", "response": ["* Mat Collishaw (born 1966), photographer, video artist"]}, {"page": "Groucho Club", "response": ["The club has a large collection of contemporary art curated by Nicki Carter, a graduate of Goldsmiths' during the YBA period, erstwhile waitress and now longest serving employee of the club. The Groucho Club Collection includes works by: Gavin Turk, Marc Quinn, Ian Davenport, Gary Hume, Alison Watt, Damien Hirst, Josef O’Connor, Sir Peter Blake, Mat Collishaw, Hayden Kays, Conrad Shawcross, Polly Morgan, Jim Lambie and Stella Vine and Carl Hopgood."]}, {"page": "Centre for Chinese Contemporary Art", "response": [" During the British Art Show the Centre displayed works by British artist Mat Collishaw."]}, {"page": "Freeze (art exhibition)", "response": ["Freeze was orchestrated by Damien Hirst, who was then a student at Goldsmiths College of Art. He was assisted by Luigi Scalera, a young architecture graduate working for the London Docklands Development Corporation, who identified and made available the derelict building for the exhibition together with modest funding for painting the interior.  Hirst and his collaborators intentionally imitated the look of Charles Saatchi's first gallery in St John's Wood that had opened a few years earlier. Saatchi, an art collector, attended Freeze and purchased a piece of art by Mat Collishaw. Michael Craig-Martin, a tutor at Goldsmiths Art College, used his influence in the London art world to convince Norman Rosenthal and Nicholas Serota to visit the exhibition.", "The catalogue for Freeze had surprisingly high production values for a student exhibition. It was designed by Tony Arefin and included an essay by art critic Ian Jeffrey. The catalogue was funded by the property developers Olympia and York. The title of the show came from the catalogue's description of Mat Collishaw's macro photograph Bullet Hole which showed a gunshot wound to a human head (taken from a pathology textbook).", "*Mat Collishaw"]}, {"page": "Stuart Semple", "response": ["2011 Semple was made an Ambassador for mental health charity Mind.\"Mind news section\", 8 September 2011. Retrieved on 8 September 2011. He initiated the Creative Therapies fund within the organisation which he launched with Stephen Fry and Melvyn Bragg and curated the exhibition & auction \"Mindful\" \"Mindful Exhibition\" that included works from Jake & Dinos Chapman, Mat Collishaw, Tracey Emin, Mona Hatoum, Sarah Lucas and Sebastian Horsley.Gosling, Emily (2011) \"Semple Minds\", \"Design Week\", 31 August 2011. Retrieved 25 October 2011.", "In 2011 Semple curated the Mindful exhibition in 25,000 sqft Old Vic Tunnels featuring artists including Jake and Dinos Chapman, Tracey Emin, Mona Hatoum, Mat Collishaw, Sebastian Horsley, Sarah Lucas, Barney Bubbles, Liliane Lijn, Tessa Farmer and Semple. It coincided with a gala dinner at The Imperial War Museum hosted by Stephen Fry and Lord Melvyn Bragg to raise funds for the Mind creative therapies fund and explore the relationship between creativity and mental health.Kos Earle, Nico (2011). \"Stuart Semple: Open Your Mind\" , Glass Magazine, 23 September 2011. Retrieved 27 October 2011.Jeffreys, Tom (2011). \"Mental Health and Art as Therapy- an Interview with Stuart Semple\" , \"Spoonfed.com\", 6 September 2011. Retrieved 27 October 2011."]}]}}