{"wiki_id": "http://www.wikidata.org/entity/Q5387244", "itemLabel": "Eric Parsons", "itemDescription": "English footballer (1923-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eric_Parsons", "wikipedia_page": {"main": "Eric George Parsons (9 November 1923 – 7 February 2011) was a footballer who played for West Ham United, Chelsea and Brentford in England.", "link_mentions": [{"page": "Johnny McNichol", "response": ["While at Brighton, McNichol had worked in a local garage, wanting to keep up his skills in case injury put an early end to his football career. When he joined Chelsea, his decision to remain living in the area had upset Drake. In addition, he bought a newsagent's shop in Hove, so not only did he have to travel by train from the south coast – as did teammates Stan Willemse and Eric Parsons – he further annoyed the Chelsea management by getting up even earlier each morning to open the shop before coming in to training. His wife Connie, whom he had known since childhood, ran the business in his absence. He claimed to have \"earned more working in that shop than playing for Chelsea. Even in that championship season.\""]}, {"page": "List of West Ham United F.C. seasons", "response": ["|Eric Parsons"]}, {"page": "List of West Ham United F.C. players", "response": ["| Eric Parsons"]}, {"page": "Eddie Chapman (footballer)", "response": ["After the war, his opportunities in the West Ham first team were limited by the presence of players such as Eric Parsons, Terry Woodgate, Kenny Bainbridge and Harry Hooper, and were not helped by a persistent back injury. He scored his first league goal during his debut, a home game against Coventry City during the 1948–49 season. He made 1 FA Cup appearance against Luton on 8 January 1949. He played his last of 7 senior league games for West Ham the same season, having scored 3 goals for the club."]}, {"page": "West London derby", "response": ["* Eric Parsons – First Chelsea, then Brentford."]}, {"page": "Stan Willemse", "response": ["Born in Brighton, Willemse served in the Royal Marines during the Second World War, and began his football career with Brighton & Hove Albion before signing for Londoners Chelsea in 1949 for £6,000, a sum which helped fund rebuilding work at Brighton's Goldstone Ground. He earned a reputation as a hard-tackling defender whilst with the club, and formed the backbone of the team which won the League Championship in 1954–55, alongside the likes of Roy Bentley, Ken Armstrong, Eric Parsons and Derek Saunders, playing 39 games that season."]}, {"page": "List of Worthing inhabitants", "response": ["* Eric Parsons, footballer was born in Worthing in 1923 and lived locally until his passing in 2010."]}, {"page": "1923 in the United Kingdom", "response": ["** Eric Parsons, footballer (died 2011)"]}, {"page": "2011 in association football", "response": ["* 7 February – Eric Parsons, English footballer (87)"]}, {"page": "1954–55 Chelsea F.C. season", "response": ["|  Eric Parsons"]}, {"page": "Parsons (surname)", "response": ["*Eric Parsons (born 1923), English footballer"]}, {"page": "1955 FA Charity Shield", "response": ["|OR ||7 || Eric Parsons"]}, {"page": "2011 in the United Kingdom", "response": ["*7 February – Eric Parsons, footballer (b. 1923)"]}, {"page": "Deaths in February 2011", "response": ["*Eric Parsons, 87, British footballer."]}, {"page": "Sport in Worthing", "response": ["Peter Bonetti and Eric Parsons (football), Donald Smith, Arthur Somerset, Neil Lenham and Jason Lewry (cricket), Martin Lee (tennis), David Evans and David Leadbetter (golf), Angela Barnwell (freestyle swimming), David Bryant (bowls), Lisa John (ten-pin bowling), Byron Dafoe (ice hockey), Lewis Crathern (kitesurfing), Alan Warren (sailing)."]}, {"page": "Rabbit (nickname)", "response": ["* Eric Parsons (1923–2011), English footballer"]}, {"page": "History of Brentford F.C. (1954–1986)", "response": ["Prior to the beginning of the 1957–58 Third Division South season, former Brentford full back Malky MacDonald was appointed as manager. \"The Terrible Twins\" strike partnership of Jim Towers and George Francis was in imperious form during the first four seasons of MacDonald's reign, accounting for nearly 200 goals. Towers' 37 during 1958–59 made him the Third Division's top-scorer (a total just two goals away from Jack Holliday's club record), plus the 'Twins' accounted for 51 of the Bees' 78 league goals scored during the season. Manager MacDonald was able to field a settled side in the late 1950s and early 1960s, at differing times being able to draw on goalkeeper Gerry Cakebread, full backs Ken Horne, Tom Wilson, half backs George Bristow, Ian Dargie, Ken Coote, Billy Goundry and supporting forwards Johnny Rainford, Dennis Heath, Len Newcombe, George McLeod and Eric Parsons."]}, {"page": "1956–57 Brentford F.C. season", "response": ["Brentford had a dream start to the 1956–57 season, winning the opening four matches and sitting atop the table. Three subsequent defeats dropped the Bees to as low as 13th-place, before top spot was again reached after another three wins in September 1956. Forwards Jeff Taylor and George Francis (supported by Jim Towers) were in imperious form, with Taylor having scored 9 goals and Francis 8 goals after 10 matches. A 4–0 defeat away to Ipswich Town on 22 September ended the run and Brentford won just three of next 20 league matches, with Taylor and Francis completely losing form and Towers spending periods out injured. The signing of Chelsea forward Eric Parsons had little impact. The Bees reached their nadir on 19 January 1957, losing 7–0 to Walsall, a scoreline which equalled the club's record defeat. Three matches later, Brentford lost 5–1 to Northampton Town and completed a slide from 1st position on 18 September 1956 to 17th on 16 February 1957. Jim Towers' return to full fitness coincided with the team's return to form in March, with George Francis scoring five goals amidst a run of four consecutive wins. After victory over Southend United on 12 March, chairman Frank Davis announced that manager Bill Dodgin Sr. would be leaving Griffin Park at the end of the campaign. Brentford lost just two of the remaining 11 matches of the season and battled to an 8th-place finish.", "|Eric Parsons", "| style=\"text-align:left;\" |Eric Parsons", "| style=\"text-align:left;\" |Eric Parsons", "| Eric Parsons"]}, {"page": "1957–58 Brentford F.C. season", "response": ["|Eric Parsons", "| style=\"text-align:left;\" |Eric Parsons", "| style=\"text-align:left;\" |Eric Parsons"]}, {"page": "1958–59 Brentford F.C. season", "response": ["|Eric Parsons", "| style=\"text-align:left;\" |Eric Parsons", "| style=\"text-align:left;\" |Eric Parsons"]}, {"page": "1959–60 Brentford F.C. season", "response": ["|Eric Parsons", "| style=\"text-align:left;\" |Eric Parsons", "| style=\"text-align:left;\" |Eric Parsons"]}, {"page": "1960–61 Brentford F.C. season", "response": ["|Eric Parsons", "| style=\"text-align:left;\" |Eric Parsons", "| Eric Parsons"]}, {"page": "1961–62 Brentford F.C. season", "response": ["Future Nottingham Central MP Jack Dunnett joined the board in July 1961 and took over as chairman from Frank Davis three months later. For the first time since relegation to the Third Division South in 1953, Brentford conducted an end-of-season clearout in a bid to reduce the squad size and wage bill. Ken Horne, Billy Goundry, George Bristow, Dennis Heath and Eric Parsons, who had each made over 100 appearances for the club, were released, as were five other bit-part players. Most galling for the Brentford supporters was the sale of forwards Jim Towers and George Francis (who had accounted for 299 goals between them since 1954) to divisional and local rivals Queens Park Rangers for a combined £8,000 fee. £6,000 Cardiff City forward Brian Edgley was signed as a replacement and Ray Reeves and Jimmy Belcher were brought in to strengthen the back lines. The signings took the squad size to just 16 players, six of whom held a part-time status (Cakebread, Dargie, Gelson, Gitsham, Reeves and Ryecraft) and of those, two (Gelson and Ryecraft) were juniors who had yet to make their senior debuts. In addition, assistant trainer Jack Holliday (the club's record goalscorer) was sacked and trainer Fred Monk resigned in April 1962."]}, {"page": "Brian Moore (footballer, born 1933)", "response": ["The club awarded Moore a testimonial match, jointly with Geoff Hallas, who had also seen his career cut short through injury earlier in the season. The match featured a number of big names in the All Star XI team, such as Jimmy Scoular, Cliff Holton, Roy Paul and Trevor Ford, and also included former West Ham players Harry Hooper and Eric Parsons. Proceeds for the match were due to be halved between the two players, totalling £991 11s 3d from gate receipts and £15 0s 3d from donations for each player. However, a dispute between Moore and his former club, due to his subsequent registration with Cambridge United, meant that he received only £500."]}, {"page": "Geoff Hallas", "response": ["The club awarded Hallas a testimonial match, jointly with Brian Moore, who had also seen his professional career cut short through injury that season. The match featured a number of big names in the All Star XI team, such as Jimmy Scoular, Cliff Holton, Roy Paul and Trevor Ford, and also included former West Ham players Harry Hooper and Eric Parsons. His benefit received from the match totalled £991 11s 3d from gate receipts and £15 0s 3d from donations."]}, {"page": "Parsons, Eric", "response": ["#redirectEric Parsons"]}]}}