{"wiki_id": "http://www.wikidata.org/entity/Q5386110", "itemLabel": "Eric Bedser", "itemDescription": "English cricketer (1918-2006)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eric_Bedser", "wikipedia_page": {"main": "Eric Arthur Bedser (4 July 1918 – 24 May 2006) was a cricketer who played for Surrey County Cricket Club. He was the elder identical twin brother of Alec Bedser (1918–2010), widely regarded as one of England's top bowlers of the 20th century. Eric was an all-rounder, a useful right-handed batsman and right-arm off-spin bowler.\nEric Bedser was born in Reading, Berkshire 10 minutes before his twin brother Alec. The twins were regarded as 'inseparable' throughout their lives, and they often dressed identically. Their father served in the Royal Flying Corps in the First World War, later becoming a bricklayer. He also played cricket and football.\nThe Bedser brothers began playing cricket together at age seven for local school sides and Woking Cricket Club. Both twins also played football for Surrey Boys, and considered a professional career in that sport. They were educated at Maybury Junior School and Monument Hill Central School. From the age of 14, the twins worked as clerks at a solicitor's office in Lincoln's Inn Fields. They were spotted by Surrey coach Alan Peach in 1938 and joined the Surrey county squad staff at the Oval, making their first-class debuts in the same match in June 1939. There is a famous story that when Eric and Alec were first selected for Surrey, they agreed they couldn't both be fast bowlers, as at that time they were. A flip of the coin saw Alec win the toss, and Eric consequently took up off-spin bowling, at which he became very adept in a Surrey county team that was dominated by famous spinners such as Jim Laker and Tony Lock, and concentrated on his batting.\nThe pair were called up for duty with the Royal Air Force in 1939, serving in France and being evacuated from Dunkirk. They later served variously together throughout the war, in North Africa and Italy. Eric was promoted to Warrant Officer (and Alec refused a similar promotion, staying a flight sergeant so they could stay together), and both being demobilised in 1946, and returned to cricket at Surrey.\n\nBedser enjoyed a successful first-class career, a member of the Surrey team that won seven successive County Championships from 1952 to 1958, despite many of the side's best players being away playing for England. Despite being called to a Test Trial in 1950, in which Laker took 8 wickets for 2 runs, one of which was scored by Eric, he was never called to play in a Test himself: he played for England only once, in a first-class tour match in Tasmania. As a result, Eric's record will always be lacking when compared with Alec's, who played in 51 Test matches, although Eric often accompanied Alec on overseas tours.\nIn a first-class career that lasted twenty-three years, Bedser played in 457 matches for Surrey, scoring 14,716 runs at the useful batting average of 24.00, and taking 833 wickets at the good bowling average of 24.95. He passed 1,000 runs in six seasons.\nAfter retiring from playing cricket he went into business with his brother. Among other business interests, they co-operated with Ronald Straker in a successful stationery firm, Straker-Bedser, which was later taken over by Ryman in 1977. While Alec became a selector for England, Eric served on various committees at Surrey. He was president of Surrey County Cricket Club in 1990.\nNeither twin married, living together in a house that they built with their father in 1953 in Woking, until Eric died aged 87 in Woking.", "link_mentions": {}}}