{"wiki_id": "http://www.wikidata.org/entity/Q538578", "itemLabel": "Hugh Hudson", "itemDescription": "British film director", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Hudson", "wikipedia_page": {"main": "Hugh Hudson (born 25 August 1936) is an English film director. He was among a generation of British directors who would begin their career making documentaries and television commercials before going on to have success in films. Hudson directed the 1981 Academy Award and BAFTA Award Best Picture Chariots of Fire, a film ranked 19th in the British Film Institute's list of Top 100 British films.\n\n", "link_mentions": [{"page": "British Rail", "response": ["In the Southwest, the South West Main Line from Bournemouth to Weymouth was electrified along with other infill 750 V DC 3rd rail electrification in the south. In 1988, the line to Aberdare was reopened. A British Rail advertisement (\"Britain's Railway\", directed by Hugh Hudson) featured some of the best known railway structures in Britain, including the Forth Rail Bridge, Royal Albert Bridge, Glenfinnan Viaduct and London Paddington station. London Liverpool Street station was rebuilt, opened by Queen Elizabeth II, and a new station was constructed at Stansted Airport in 1991. The following year, the Maesteg line was reopened. In 1988, the Windsor Link Line, Manchester was constructed and has proven to be an important piece of infrastructure.", "In 1989, the ITV sketch show Spitting Image parodied Hugh Hudson's 1988 British Rail, Britain's Railway advert on the plans of the then Conservative British Government to privatise the railways featuring many of the show's puppets (including the show's portrayal of Prime Minister Margaret Thatcher), numerous BR trains and landmarks and even a cardboard cutout of Thomas the Tank Engine."]}, {"page": "Barney Bubbles", "response": ["After leaving college in 1963 Fulcher worked as an assistant at the design company Michael Tucker + Associates in London.Reasons to Be Cheerful: The Life & Work of Barney Bubbles, 2nd edition, Paul Gorman (Adelita 2010)  Its clients included Pirelli. In a rare interview in November 1981 in The Face, Bubbles described Tucker's discipline as \"very Swiss; very hard; unjustified, very grey; and he taught me everything about typography.\" Tucker's studio produced the posters for Hugh Hudson's Pirelli-sponsored film The Tortoise & The Hare (1967), for which Fulcher designed the poster lettering on a freelance basis."]}, {"page": "Chariots of Fire", "response": ["Chariots of Fire is a 1981 British historical sports drama film directed by Hugh Hudson, written by Colin Welland, and produced by David Puttnam. It is based on the true story of two British athletes in the 1924 Olympics: Eric Liddell: a devout Scottish Christian who runs for the glory of God, and Harold Abrahams, an English Jew who runs to overcome prejudice. Ben Cross and Ian Charleson star as Abrahams and Liddell, alongside Nigel Havers, Ian Holm, John Gielgud, Lindsay Anderson, Cheryl Campbell, Alice Krige, Brad Davis, and Dennis Christopher in supporting roles. ", "Producer David Puttnam was looking for a story in the mold of A Man for All Seasons (1966), regarding someone who follows his conscience, and felt sports provided clear situations in this sense.Goodell, Gregory. Independent Feature Film Production: A Complete Guide from Concept Through Distribution. New York: St. Martin's Press, 1982. p. xvii. He discovered Eric Liddell's story by accident in 1977, when he happened upon a reference book on the Olympics while housebound from the flu in a rented house in Los Angeles.Nichols, Peter M. The New York Times Essential Library, Children's Movies: A Critic's Guide to the Best Films Available on Video and DVD. New York: Times Books, 2003. p. 59.Hugh Hudson in Chariots of Fire – The Reunion (2005 video; featurette on 2005 Chariots of Fire DVD)", "Ian Charleson wrote Eric Liddell's speech to the post-race workingmen's crowd at the Scotland v. Ireland races. Charleson, who had studied the Bible intensively in preparation for the role, told director Hugh Hudson that he didn't feel the portentous and sanctimonious scripted speech was either authentic or inspiring. Hudson and Welland allowed him to write words he personally found inspirational instead.Ian McKellen, Hugh Hudson, Alan Bates, et al. For Ian Charleson: A Tribute. London: Constable and Company, 1990. pp. 37–39. ", "Puttnam chose Hugh Hudson, a multiple award-winning advertising and documentary filmmaker who had never helmed a feature film, to direct Chariots of Fire. Hudson and Puttnam had known each other since the 1960s, when Puttnam was an advertising executive and Hudson was making films for ad agencies. In 1977, Hudson had also been second-unit director on the Puttnam-produced film Midnight Express.Round, Simon. \"Interview: Hugh Hudson\". The Jewish Chronicle. 10 November 2011.", "Director Hugh Hudson was determined to cast young, unknown actors in all the major roles of the film, and to back them up by using veterans like John Gielgud, Lindsay Anderson, and Ian Holm as their supporting cast. Hudson and producer David Puttnam did months of fruitless searching for the perfect actor to play Eric Liddell. They then saw Scottish stage actor Ian Charleson performing the role of Pierre in the Royal Shakespeare Company's production of Piaf, and knew immediately they had found their man. Unbeknownst to them, Charleson had heard about the film from his father, and desperately wanted to play the part, feeling it would \"fit like a kid glove\".Ian McKellen, Hugh Hudson, Alan Bates, et al. For Ian Charleson: A Tribute. London: Constable and Company, 1990. pp. xix, 9, 76.", "All of the Cambridge scenes were actually filmed at Hugh Hudson's alma mater Eton College, because Cambridge refused filming rights, fearing depictions of anti-Semitism. The Cambridge administration greatly regretted the decision after the film's enormous success.", "Vangelis, a Greek-born electronic composer who moved to Paris in the late 1960s, had been living in London since 1974. Director Hugh Hudson had collaborated with him on documentaries and commercials, and was also particularly impressed with his 1979 albums Opera Sauvage and China.MacNab, Geoffrey. \"Everyone Was a Winner when British Talent Met the Olympic Spirit\". The Independent. 13 April 2012. David Puttnam also greatly admired Vangelis's body of work, having originally selected his compositions for his previous film Midnight Express.Hubbert, Julie. Celluloid Symphonies: Texts and Contexts in Film Music History. University of California Press, 2011. p. 426. Hudson made the choice for Vangelis and for a modern score: \"I knew we needed a piece which was anachronistic to the period to give it a feel of modernity. It was a risky idea but we went with it rather than have a period symphonic score.\" The soundtrack had a personal significance to Vangelis: After composing the iconic theme tune he told Puttnam, \"My father is a runner, and this is an anthem to him.\"McLaughlin, John. \"In Chariots They Ran\". Runner's World. February 2012.", "| Hugh Hudson", "| Hugh Hudson", "| rowspan=\"2\"| Hugh Hudson", "| Hugh Hudson", "| Hugh Hudson", "| Hugh Hudson", "Abrahams' fiancée is misidentified as Sybil Gordon, a soprano at the D'Oyly Carte Opera Company. In fact, in 1936, Abrahams married Sybil Evers, who sang at the D'Oyly Carte, but they did not meet until 1934.Ryan (2012), p. 188. Also, in the film, Sybil is depicted as singing the role of Yum-Yum in The Mikado, but neither Sybil Gordon nor Sybil Evers ever sang that role with D'Oyly Carte,Stone, David. Sybil Gordon  at the Who Was Who in the D'Oyly Carte Opera Company website, 11 July 2002. Retrieved 8 November 2009Stone, David. Sybil Evers  at the Who Was Who in the D'Oyly Carte Opera Company website, 28 January 2002. Retrieved 8 November 2009 although Evers was known for her charm in singing Peep-Bo, one of the two other \"little maids from school\". Harold Abrahams' love of and heavy involvement with Gilbert and Sullivan, as depicted in the film, is factual.Hugh Hudson's commentary to the 2005 Chariots of Fire DVD", "A Blu-ray of the film was released on 10 July 2012 in North America, and was released 16 July 2012 in the UK. The release includes nearly an hour of special features, a CD sampler, and a 32-page \"digibook\".Sluss, Justin. \"1981 Hugh Hudson Directed Film Chariots of Fire Comes to Blu-ray in July\" . HighDefDiscNews.com.", "A stage adaptation of Chariots of Fire was mounted in honour of the 2012 Olympics. The play, Chariots of Fire, which was adapted by playwright Mike Bartlett and included the iconic Vangelis score, ran from 9 May to 16 June 2012 at London's Hampstead Theatre, and transferred to the Gielgud Theatre in the West End on 23 June, where it ran until 5 January 2013.Rees, Jasper. \"Chariots of Fire Is Coming!\" The Arts Desk. 18 April 2012. It starred Jack Lowden as Eric Liddell and James McArdle as Harold Abrahams, and Edward Hall directed. Stage designer Miriam Buether transformed each theatre into an Olympic stadium, and composer Jason Carr wrote additional music.\"Cast Announced for Hampstead Theatre's Chariots of Fire; Opens May 9\". Broadway World. 2 April 2012.Girvan, Andrew. \"Black Watch's Lowden plays Eric Liddell in Chariots of Fire\" . What's on Stage. 9 March 2012.Chariots of Fire – Hampstead Theatre   Vangelis also created several new pieces of music for the production.Twitter: Chariots Tweeter, 16 April 2012, 18 April 2012.Rees, Jasper. \"Chariots of Fire: The British Are Coming... Again\". The Daily Telegraph. 3 May 2012. The stage version for the London Olympic year was the idea of the film's director, Hugh Hudson, who co-produced the play; he stated, \"Issues of faith, of refusal to compromise, standing up for one's beliefs, achieving something for the sake of it, with passion, and not just for fame or financial gain, are even more vital today.\"Jury, Louise. \"Theatre to Run Chariots of Fire with Vangelis Tracks\". London Evening Standard. 30 January 2012.", "Category:Films directed by Hugh Hudson"]}, {"page": "Cinema of the United Kingdom", "response": ["Goldcrest producer David Puttnam has been described as \"the nearest thing to a mogul that British cinema has had in the last quarter of the 20th century.\" Under Puttnam, a generation of British directors emerged making popular films with international distribution. Some of the talent backed by Puttnam — Hugh Hudson, Ridley Scott, Alan Parker, and Adrian Lyne — had shot commercials; Puttnam himself had begun his career in the advertising industry. When Hudson's Chariots of Fire (1981) won 4 Academy Awards in 1982, including Best Picture, its writer Colin Welland declared \"the British are coming!\".\"This week's new theatre and dance\". The Guardian. Retrieved 19 July 2012. When Gandhi (1982), another Goldcrest film, picked up a Best Picture Oscar, it looked as if he was right."]}, {"page": "Neil Kinnock", "response": ["Mandelson and his team had revolutionised Labour's communications – a transformation symbolised by a party election broadcast popularly known as \"Kinnock: The Movie\". This was directed by Hugh Hudson and featured Kinnock's 1985 conference speech, and shots of him and his wife Glenys walking on the Great Orme in Llandudno (so emphasising his appeal as a family man and associating him with images of Wales away from the coal mining communities where he grew up), and a speech to that year's Welsh Labour Party conference asking why he was the \"first Kinnock in a thousand generations\" to go to university."]}, {"page": "Ridley Scott", "response": ["In 1968, Ridley and Tony Scott founded Ridley Scott Associates (RSA), a film and commercial production company. Working alongside Alan Parker, Hugh Hudson and cinematographer Hugh Johnson, Ridley Scott made many commercials at RSA during the 1970s, including a 1973 Hovis bread advertisement, \"Bike Round\" (underscored by the slow movement of Dvořák's \"New World\" symphony rearranged for brass), filmed in Gold Hill, Shaftesbury, Dorset. A nostalgia themed television advert that captured the public imagination, it was voted the UK's favourite commercial in a 2006 poll. In the 1970s the Chanel No. 5 brand needed revitalisation having run the risk of being labelled as mass market and passé. Directed by Scott in the 1970s and 1980s, Chanel television commercials were inventive mini-films with production values of surreal fantasy and seduction, which \"played on the same visual imagery, with the same silhouette of the bottle.\""]}, {"page": "Vangelis", "response": ["On 11 December 2011, Vangelis was invited by Katara's Cultural Village in the state of Qatar to conceive, design, direct, and compose music for the opening of its world-class outdoor amphitheater. The event was witnessed by a number of world leaders and dignitaries participating in the 4th Forum of the United Nations Alliance of Civilizations held in the city of Doha. British actor Jeremy Irons performed in the role of master of ceremonies, and the event featured a light show by German artist Gert Hof. It was filmed for a future video release by Oscar-winning British filmmaker Hugh Hudson."]}, {"page": "Christopher Lambert", "response": ["Around that time, director Hugh Hudson had just finished his Academy Award-winning film Chariots of Fire (1981), and Warner Brothers was desperate to hire him to direct another film. After looking at all their available scripts he chose to do a film adaptation of novelist Edgar Rice Burroughs' iconic character Tarzan, a man who was raised by an unknown species of great apes in the jungle. Wanting an unknown actor to play the part, Hudson tested many young actors. Lambert got the role partly due to his myopia, because when he took off his glasses it seemed he was always looking into the distance."]}, {"page": "Heaven's Gate (film)", "response": ["* Revolution (1985) – a historical epic film, starring Al Pacino, that was also made by a high-profile director (Hugh Hudson); it, too, was a failure on release and led to problems for its studio. Since then, it, too received a new cut that was more positively reviewed."]}, {"page": "2000 in film", "response": ["| I Dreamed of Africa || Columbia Pictures || Hugh Hudson (director); Paula Milne, Susan Shiliday (screenplay); Kim Basinger, Vincent Perez, Eva Marie Saint, Daniel Craig, Liam Aiken, Garrett Strommen, Lance Reddick, Connie Chiume, Mary Craig || Drama, Adventure || Live action"]}, {"page": "John Gielgud", "response": ["In the 1980s Gielgud appeared in more than twenty films. Morley singles out as noteworthy The Elephant Man (1980), as the chairman of the Royal London Hospital, Chariots of Fire (1981), as the Master of Trinity College, Cambridge, Gandhi (1982), as Lord Irwin (the latter two winning Academy Awards as Best Picture), The Shooting Party (1984) and Plenty (1985), directed by David Lynch, Hugh Hudson, Richard Attenborough, Alan Bridges and Fred Schepisi respectively. Tony Palmer's Wagner (1983) was the only film in which Gielgud, Richardson, and Olivier played scenes together. Gielgud made cameo appearances in films of little merit, lending distinction while not damaging his own reputation. He told an interviewer, \"They pay me very well for two or three days' work a month, so why not? It's nice at my age to be able to travel all over the world at other people's expense.\"Appleyard, Bryan. \"'Brideshead': a brilliant and sensual impact\", The Times, 13 October 1981, p. 8"]}, {"page": "1999 in film", "response": ["* My Life So Far, directed by Hugh Hudson, starring Colin Firth, Rosemary Harris, Irène Jacob and Malcolm McDowell (U.K.)"]}, {"page": "1989 in film", "response": ["| Lost Angels || Orion Pictures || Hugh Hudson (director); Michael Weller (screenplay); Donald Sutherland, Adam Horovitz, Amy Locane, Don Bloomfield, Celia Weston, Graham Beckel, Patricia Richardson, Ron Frazier, Joe D'Angerio, William O'Leary, Kevin Corrigan, Gary Riley, Michael Cunningham, Leonard Porter Salazar, Jonathan Del Arco, Celia Newman, David Herman, Max Perlich, Nina Siemaszko, Kevin Tighe, John C. McGinley, Frances Fisher, Lee Wilkof, James N. Harrell, Jack Gold, Keone Young, Park Overall, Pauly Shore || Drama || Live action", "* Lost Angels, directed by Hugh Hudson, starring Donald Sutherland, Adam Horovitz and Amy Locane"]}, {"page": "1985 in film", "response": ["*Revolution, directed by Hugh Hudson, starring Al Pacino, Donald Sutherland, Nastassja Kinski - (U.K.)", "| Revolution || Warner Bros. || Hugh Hudson (director); Robert Dillon (screenplay); Al Pacino, Donald Sutherland, Nastassja Kinski, Dexter Fletcher, Sid Owen, Joan Plowright, Dave King, Steven Berkoff, John Wells, Annie Lennox, Richard O'Brien, Paul Brooke, Frank Windsor, Jesse Birdsall, Graham Greene, Robbie Coltrane || Historical, Drama || Live action"]}, {"page": "1984 in film", "response": ["| Greystoke: The Legend of Tarzan, Lord of the Apes || Warner Bros. || Hugh Hudson (director); P.H. Vazak, Michael Austin (screenplay); Ralph Richardson, Ian Holm, James Fox, Christopher Lambert, Andie MacDowell, Cheryl Campbell, Paul Geoffrey, Ian Charleson, Nigel Davenport, Nicholas Farrell, Richard Griffiths, Hilton McRae, David Suchet, John Wells, Paul Brooke, Ailsa Berk, Mak Wilson, Emil Abossolo-Mbo, Deep Roy, Tali McGregor, Peter Kyriakou, Danny Potts, Eric Langlois, Peter Elliott, John Alexander, Christopher Beck || Adventure || Live action", "*Greystoke: The Legend of Tarzan, Lord of the Apes, directed by Hugh Hudson, starring Christopher Lambert, Andie MacDowell, Ralph Richardson in his final role - (U.K.)"]}, {"page": "1981 in film", "response": ["*Chariots of Fire, directed by Hugh Hudson, starring Ben Cross, Ian Charleson, Nigel Havers, Ian Holm – (U.K.)", "| Chariots of Fire || Warner Bros. / The Ladd Company / Allied Stars Ltd / Goldcrest Films / Enigma Productions || Hugh Hudson (director); Colin Welland (screenplay); Ben Cross, Ian Charleson, Nigel Havers, Cheryl Campbell, Alice Krige, Lindsay Anderson, Dennis Christopher, Nigel Davenport, Brad Davis, Peter Egan, John Gielgud, Ian Holm, Patrick Magee, Nicholas Farrell, Struan Rodger, David Yelland, Daniel Gerroll, Richard Griffiths || Historical, Drama || Live action"]}, {"page": "1936 in film", "response": ["*August 25 – Hugh Hudson, English director"]}, {"page": "1987 United Kingdom general election", "response": ["The Labour campaign was a marked change from previous efforts; professionally directed by Peter Mandelson and Bryan Gould, it concentrated on presenting and improving Neil Kinnock's image to the electorate. Labour's first party political broadcast, dubbed Kinnock: The Movie, was directed by Hugh Hudson of Chariots of Fire fame, and concentrated on portraying Kinnock as a caring, compassionate family man. It was filmed at the Great Orme in Wales and had \"Ode to Joy\" as its music. He was particularly critical of the high unemployment that the government's economic policies had resulted in, as well as condemning the wait for treatment that many patients had endured on the National Health Service. Kinnock's personal popularity jumped 16 points overnight following the initial broadcast."]}, {"page": "Peter Mandelson", "response": ["In 1986 Mandelson ran the campaign at the Fulham by-election in which Labour defeated the Conservative Party. For the 1987 election campaign, Mandelson commissioned film director Hugh Hudson, whose Chariots of Fire (1981) had won an Oscar as Best Picture, to make a party political broadcast promoting Neil Kinnock as a potential prime minister. Tagged \"Kinnock – the Movie\", it led to the party leader's approval rating being raised by 16%Steven Fielding \"Labour Party Election Broadcast (21 May 1987)\", BFI screenonline or 19% in pollsTim Walker \"Why Chariots of Fire director Hugh Hudson won't make broadcasts for Ed Miliband\", The Telegraph, 14 July 2012 and was even repeated in another PPB slot. The election, held on 11 June 1987, returned Margaret Thatcher's Conservatives for the third time, although Labour gained 20 seats, and, this time, convincingly pushed the SDP-Liberal Alliance into third place. Opponents termed the Labour Party's election campaign \"a brilliantly successful election defeat\"."]}, {"page": "Maurice Jarre", "response": ["|Hugh Hudson"]}, {"page": "Cave of Altamira", "response": ["In 2016, British Director Hugh Hudson released the film Altamira (called Finding Altamira outside Spain) about the discovery of the caves, starring Antonio Banderas and with music by Mark Knopfler released on the soundtrack album Altamira."]}, {"page": "List of film and television directors", "response": ["*Hugh Hudson"]}, {"page": "List of documentary films", "response": ["|Fangio: Una vita a 300 all'ora||1981||Hugh Hudson||"]}, {"page": "David Puttnam", "response": ["Puttnam's next film was his most successful yet. Chariots of Fire (1981), the first feature directed by Hugh Hudson, became a massive hit and won the Academy Award for Best Picture. It was produced in association with Goldcrest Pictures.", "Puttnam, who had produced Ian Charleson's star-making film Chariots of Fire, contributed a chapter to the 1990 book, For Ian Charleson: A Tribute.Ian McKellen, Alan Bates, Hugh Hudson, et al. For Ian Charleson: A Tribute. London: Constable and Company, 1990. pp. 7–11."]}, {"page": "César Award for Best Foreign Film", "response": ["|colspan=\"2\"|Greystoke: The Legend of Tarzan, Lord of the Apes||/||Hugh Hudson"]}, {"page": "6th Golden Raspberry Awards", "response": ["|Hugh Hudson for Revolution"]}, {"page": "Tony Scott", "response": ["Scott took time out in 1975 to direct a television adaptation of the Henry James story The Author of Beltraffio.Tony Scott obituary. The Guardian. Retrieved 21 August 2012 After the feature film successes of fellow British directors Hugh Hudson, Alan Parker, Adrian Lyne and his elder brother during the late 1970s, all of whom had graduated from directing advertising commercials, he received initial overtures from Hollywood in 1980. His eldest brother Frank died, aged 45, of skin cancer during the same year."]}, {"page": "Opéra sauvage", "response": ["*A documentary on the Chariots of Fire (1981) special-edition DVD-video relates that director Hugh Hudson intended to use the 7/4 piece \"L'Enfant\", which he was particularly fond of, as the opening titles over the first scene on the beach, until Vangelis talked him into letting him compose the iconic Chariots of Fire theme. The director then had \"L'Enfant\" being played in the film by a brass band as source music. A re-recorded version of \"Hymne\" was used as the score cue for Eric Liddell's first race in the Scottish highlands."]}, {"page": "List of Old Etonians born in the 20th century", "response": ["*Hugh Hudson (born 1936), film director"]}, {"page": "Barbara Broccoli", "response": ["In 2012, during the festivities surrounding the 2012 Summer Olympics in London, Broccoli co-produced Chariots of Fire, the London stage adaptation of the 1981 film of the same title. Broccoli's involvement with Chariots of Fire extended back to 1980, when she introduced her friend Dodi Fayed to the screenplay; he later co-financed the film and became its executive producer.Jury, Louise. \"Chariots of Fire Will Run in West End... to Honour Dodi Fayed\". London Evening Standard,  April 19, 2012. She co-produced the play along with Hugh Hudson, who directed the 1981 Oscar-winning film."]}, {"page": "Adrian Lyne", "response": ["Lyne was among a generation of British directors in the 1970s, including Ridley Scott, Alan Parker, Tony Scott and Hugh Hudson, who would begin their career making television commercials before going on to have major success in films. Their techniques in making commercials were admired and copied by major names in the film industry, with Lyne stating: \"I remember making this advertisement up in Yorkshire when I got a message that Stanley Kubrick had called. He'd seen an ad I'd made for milk in which I'd used a particular type of graduated filter. He wanted to know exactly which filter I'd used.\""]}, {"page": "Ian Charleson", "response": ["In 1979, producer David Puttnam and director Hugh Hudson had done months of searching for the actor to play the lead of the evangelical Scot Eric Liddell in their upcoming film about the Olympics. They then saw Charleson performing the role of Pierre in Piaf, and knew immediately they had found their man. Unbeknownst to them, the actor had heard about the film from his father, and desperately wanted to play the part, feeling it would \"fit like a kid glove\".Ian McKellen, Hugh Hudson, Alan Bates, et al. For Ian Charleson: A Tribute. London: Constable and Company, 1990. pp. xix, 9, 76. This mutual affinity led to Charleson's best-known film role and success – as the athlete and missionary Eric Liddell in Chariots of Fire (1981). He prepared for the role by studying the Bible intensively, and he himself wrote Liddell's stirring post-race address to the workingmen's crowd.McKellen, Bates, Hudson, et al. pp. 37–39. This film and role made him an international celebrity.\"Charleson, Ian (1949–1990)\". Screenonline.  British Film Institute. Retrieved 29 December 2017.", "In 1990, following his death, 20 of Charleson's friends, colleagues, and family members, including Ian McKellen, Alan Bates, Hugh Hudson, Richard Eyre, Sean Mathias, Hilton McRae, Ruby Wax, and David Rintoul, contributed to a book of reminiscences about him, called For Ian Charleson: A Tribute, published in October 1990. All royalties from the sale of the book went to the Ian Charleson Trust, a charitable foundation which operated from 1990 to 2007.", "Hugh Hudson, who had directed him in Chariots of Fire, dedicated his 1999 film My Life So Far  \"In loving memory of Ian Charleson\". The 2005 videos \"Wings on Their Heels: The Making of Chariots of Fire\" and \"Chariots of Fire: A Reunion\" are both also dedicated to his memory.", "* Ian McKellen, Alan Bates, Hugh Hudson, et al. For Ian Charleson: A Tribute. London: Constable and Company, 1990. "]}, {"page": "BAFTA Award for Best Film", "response": ["| style=\"background:#ccc;\"| Chariots of Fire || style=\"background:#ccc;\"| Hugh Hudson || style=\"background:#ccc;\"| David Puttnam || style=\"background:#ccc;\"|  United Kingdom"]}, {"page": "Tchéky Karyo", "response": ["| Hugh Hudson"]}, {"page": "Greystoke: The Legend of Tarzan, Lord of the Apes", "response": ["Greystoke: The Legend of Tarzan, Lord of the Apes is a 1984 adventure film directed by Hugh Hudson based on Edgar Rice Burroughs' novel Tarzan of the Apes (1912). Christopher Lambert stars as Tarzan (though the name Tarzan is never used in the film's dialogue) and Andie MacDowell as Jane; the cast also includes Ralph Richardson (in his final role), Ian Holm, James Fox, Cheryl Campbell, and Ian Charleson.", "=== Hugh Hudson ===", "A new director became attached to the project – Hugh Hudson whose debut feature Chariots of Fire had been a surprise box office hit.  \"Towne's script was brilliant\", said Hudson. \"It was only half finished and overlong but all the jungle stuff was there and it was fascinating. I said yes at once.\"", "Category:Films directed by Hugh Hudson"]}, {"page": "BFI Top 100 British films", "response": ["| 19 || Chariots of Fire  || 1981 || Hugh Hudson"]}, {"page": "Golden Globe Award for Best Foreign Language Film", "response": ["| rowspan=\"5\" style=\"text-align:center;\" | 1981 || colspan=\"2\" style=\"background:#B0C4DE;\" | Chariots of Fire  || style=\"background:#B0C4DE;\" | Hugh Hudson|| style=\"background:#B0C4DE;\" |UK"]}, {"page": "Revolution (1985 film)", "response": ["Revolution is a 1985 British historical drama film directed by Hugh Hudson, written by Robert Dillon, and starring Al Pacino, Donald Sutherland, and Nastassja Kinski. The film stars Pacino as a New York fur trapper who involuntarily gets enrolled in the Revolutionary forces during the American Revolutionary War.", "The film was the idea of producer Irwin Winkler who felt the American Revolution would make an ideal subject for a film. After having just made The Right Stuff Winkler did not want to tell a story about real people so decided to focus on a fictional father and son. Winkler had a development deal at Warner Bros and they agreed to finance a script by Robert Dillon. Warners did not like the script enough to agree to finance it, so Winkler bought it back, attached Hugh Hudson as director and took the project to other studios to see if they were interested. He showed the script to Sandy Lieberson of Goldcrest, who was enthusiastic.Eberts and Ilott p 346-348", "A reviewer for the UK-based Time Out called it \"an almost inconceivable disaster which tries for a worm's eye view of the American Revolution [...] maybe the original script had a shape and a grasp of events. If so, it has gone. There has clearly been drastic cutting, and nothing is left but a cortege of fragments and mismatched cuts. It's also the first 70 mm movie that looks as if it was shot hand-held on 16 mm and blown up for the big screen. Director? I didn't catch the credit. Was there one?\" Vincent Canby of The New York Times called it \"a mess, but one that's so giddily misguided that it's sometimes a good deal of fun for all of the wrong reasons. Characters who have met briefly early in the film later stage hugely emotional, tearful reconciliations.\" Pauline Kael commented that \"everything in this picture, which goes from the beginning of the American War of Independence in 1776 to the end of combat in 1783, seems dissociated. The director, Hugh Hudson, plunges us into gritty, muddy restagings of famous campaigns, but we don't find out what's going on in these campaigns, or what their importance is in the course of the war. [...] Hudson and the scriptwriter, Robert Dillon, present the war as a primal Oedipal revolt of the Colonies against the parent country, and the relationships of the characters are designed in Oedipal pairs; Hudson also stages torture orgies to indicate how sadistic the redcoats are, and scenes are devised to set up echoes of the Rocky series and Rambo. This is a certifiably loony picture; it's so bad it puts you in a state of shock.\"", "* Worst Director - Hugh Hudson (lost to George Cosmatos)", "Revolution was rush-released in December 1985 for the Christmas market and for Academy Award consideration. Dissatisfied with the version of the film released to theatres, Hugh Hudson released a new cut, Revolution: Revisited, on DVD in 2009. This has an added narration by Pacino (recorded for this release) and numerous scenes have been trimmed or deleted outright (running at 115 minutes, the Director's Cut is approximately 10 minutes shorter than the theatrical version). Also included is a conversation with Pacino and Hudson discussing the film being rushed for a U.S. Christmas release, being trashed by the critics, and other issues relating to making and releasing the film. ", "Category:Films directed by Hugh Hudson"]}, {"page": "Hugh hudson", "response": ["#REDIRECT Hugh Hudson"]}, {"page": "Lumière and Company", "response": ["Category:Films directed by Hugh Hudson"]}, {"page": "Foxes (film)", "response": ["The film was the feature directorial debut from Adrian Lyne. Producer David Puttnam had enjoyed success hiring debutant directors with a background in TV commercials (Ridley Scott, Alan Parker, Hugh Hudson) and that is were Lyne came from."]}, {"page": "Patrick Doyle", "response": ["|Hugh Hudson"]}, {"page": "Gualtiero Jacopetti", "response": ["* Fangio: Una vita a 300 all'ora (Fangio: A Life at 300 an Hour) directed by Hugh Hudson, 1981"]}, {"page": "AFI's 100 Years...100 Cheers", "response": ["| 100 || data-sort-value=\"Chariots of Fire\"| Chariots of Fire || Hugh Hudson || 1981"]}]}}