{"wiki_id": "http://www.wikidata.org/entity/Q53858170", "itemLabel": "Charles Cyril Gerahty", "itemDescription": "judge (1888-1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Cyril_Gerahty", "wikipedia_page": {"main": "Sir Charles Cyril Gerahty (17 June 1888 – 6 June 1978) was a British colonial judge who became Chief Justice of Trinidad.\nHe was born near Epping, Essex, the second son of civil servant Charles Echlin Gerahty, of a family from Dungannon, County Tyrone.\nHe entered the Middle Temple in 1906 to study law and was called to the bar on 23 June 1909. After military service in the First World War he joined the British Colonial Legal Service and served in a judicial capacity in Cyprus before being appointed Attorney General there in 1926. In 1932 he moved to the Straits Settlements as a puisne judge and in 1934 to Malta as Legal Advisor to the government there. From 1937 to 1943 he was Chief Justice of Trinidad.He was knighted in the 1939 Birthday Honours.He died in Sussex in 1978. He had married Ethel Murray in 1915; their son, born in Cyprus, was Colonel Peter Gerahty.", "link_mentions": [{"page": "Chief Justice of Trinidad and Tobago", "response": ["*1937–1943: Charles Cyril Gerahty"]}, {"page": "1939 Birthday Honours", "response": ["* Charles Cyril Gerahty, Colonial Legal Service, Chief Justice, Trinidad."]}, {"page": "Peter Gerahty", "response": ["Peter Echlin Gerahty was born in Cyprus, the eldest son of Sir Charles Cyril Gerahty QC. He was  educated at Malvern College, Malvern, Worcestershire. Gerahty was commissioned into the Oxfordshire and Buckinghamshire Light Infantry in September 1941 and was posted to the 5th Oxfordshire and Buckinghamshire Light Infantry. He served with 9th Parachute Battalion from July 1944 to September 1944 when he transferred to the 2nd Oxfordshire and Buckinghamshire Light Infantry (the 52nd) and joined the battalion at Bulford, Wiltshire."]}, {"page": "Gerahty", "response": ["* Charles Cyril Gerahty (1888–1978), British colonial judge "]}]}}