{"wiki_id": "http://www.wikidata.org/entity/Q5387779", "itemLabel": "Eric Winstone", "itemDescription": "English bandleader", "wikipedia_url": "https://en.wikipedia.org/wiki/Eric_Winstone", "wikipedia_page": {"main": "Eric Winstone (born 1 January 1913 in London, died 2 May 1974 in Pagham, Sussex) was an English big band leader, conductor and composer.", "link_mentions": [{"page": "The Beverley Sisters", "response": ["Immediately after the war they toured with Eric Winstone and his Orchestra, and began making regular appearances on the BBC's early television programmes. They also performed for NBC in the US with surviving members of the Glenn Miller Orchestra. After their return to Britain, promoter Val Parnell booked them to appear at the London Palladium with Gracie Fields; although Fields refused, without explanation, to appear with them, the following year they performed with Danny Kaye. The BBC gave them their own television series, initially called Three Little Girls on View but later renamed as Those Beverley Sisters, which ran for seven years and on which they gave live performances of popular songs of the day."]}, {"page": "Juke Box Jury", "response": ["* 18 June 1960 - Digby Wolfe, Millicent Martin, Carole Carr, Eric Winstone", "* 6 May 1961 – Tony Bennett, June Thorburn, Eric Winstone and a 'surprise guest'"]}, {"page": "Marion Keene", "response": ["Marion Davis with Eric Winstone Orchestra"]}, {"page": "Polygon Records discography", "response": ["*\tP. 1071\tEric Winstone and his Orchestra\tFrustration / Anticipation\tMay-53", "*\tP. 1084\tEric Winstone and his Orchestra / Laurie Johnson and his Orchestra\tCat Walk / Slow Train Blues\tNov-53", "*\tP. 1094\tEric Winstone and his Orchestra\tCobblers Song / Robbers March\tJan-54", "*\tP. 1153\tEric Winstone and his Orchestra\tFanfare Boogie / Slow Joe\tFeb-55", "*\tP. 1173\tEric Winstone and his Orchestra\tOpus One Mambo / Rhythm And Blues\tJun-55", "*\tP. 1175\tEric Winstone and his Orchestra (*Stan Roderick on trumpet)\tHeartbreak* / Deep Sleep\tJul-55"]}, {"page": "Michael Holliday", "response": ["In March 1953, he joined the Eric Winstone Band, another Butlin's contracted band that toured when the summer season's work was over. They also broadcast occasionally on BBC Radio."]}, {"page": "The Right Person", "response": ["It was shot in Eastmancolor and Cinemascope by Walter J. Harvey. The music was by Eric Winstone."]}, {"page": "Coleridge Goode", "response": ["His primary early influences as a bassist were Walter Page, Slam Stewart and Jimmy Blanton. Moving to London in 1942, Goode subsequently worked with Johnny Claes, Eric Winstone, Lauderic Caton and Dick Katz, became a founder member of the Ray Ellington Quartet and recorded with Django Reinhardt in 1946, alongside Stephane Grappelli.John Stevenson, \"Coleridge Goode obituary\", The Guardian, 11 October 2015. Later Goode played in Tito Burns' sextet and led his own group, before being invited to join Harriott's new band in 1958. In 1967 he recorded with Chris McGregor, Dudu Pukwana, Ronnie Beer, and Laurie Allan on Gwigwi Mrwebi's Mbaqanga Songs. During the 1960s and 1970s, Goode worked extensively with pianist/composer Michael Garrick. Goode was still performing in the house band at Laurie Morgan's Sunday jam sessions at the King's Head in Crouch End into his 90s.\"Coleridge Goode\" , The Jazz Site."]}, {"page": "Radio Luxembourg", "response": ["*Sundays: 6:00 pm – Butlin's Beaver Club – with \"Uncle\" Eric Winstone."]}, {"page": "Laura (1945 song)", "response": ["*Eric Winstone and His Band Song: Alan Lane. Recorded in London on June 6, 1945. It was released by EMI on the HMV Records label as catalogue number BD 5893"]}, {"page": "List of British big band leaders", "response": ["*Eric Winstone"]}, {"page": "Johnny Douglas (conductor)", "response": ["* Eric Winstone"]}, {"page": "Who Is Dr Who", "response": ["|Eric Winstone and his Orchestra"]}, {"page": "Eddie Mordue", "response": ["Born in South Shields in January 1928, Edwin Mordue moved to London in 1941 aged 13 and toured with 'Archie's Juvenile Band'. During the Second World War, he played tenor saxophone with the Eric Winstone Band where he met singer Julie Dawn, whom he married after the war. The couple went on to record and perform with Frank Sinatra, Gene Kelly and Sammy Davis, Jr.. Eddie joined the Jack Nathan Band in 1951, a regular at the London Palladium and the emerging West End jazz scene, then worked as a freelance, loaning his sound to the benefit of Nat King Cole and Billie Holiday's last concert."]}, {"page": "Dennis Hale (vocalist)", "response": ["Dennis Hale ( 1922 1960), born Dennis Godfrey Hoare, was a vocalist with a number of bands and performers, including the Oscar Rabin Band, Jack Parnell, Johnny Douglas, Teddy Foster (1945 to 1946), and Eric Winstone (1946 to 1948).Info from the Slough Observer 16 September 1960 + 10 September 1961 and The Dennis Hale fan magazine issue 4"]}, {"page": "President Records", "response": ["President Records continued to diversify into various music markets with the acquisition in 1991 of the Dansan Records catalogue, set up by Tommy Sanderson in the late 1970s and renowned for having produced some of the best recordings ever made for ballroom dancing. Recordings by Andy Ross & His Orchestra, Bryan Smith & the Dixieland Seven and the Eric Winstone Orchestra (amongst others) are still popular sellers."]}, {"page": "Kenny Graham", "response": ["After the end of the war, he played in many of the leading British dance bands of the era, including those led by Nat Temple, Nat Gonella, Ambrose, Leslie \"Jiver\" Hutchinson and Eric Winstone, as well as in Victor Feldman's Sextet, before forming Kenny Graham's Afro-Cubists in April 1950. The band sought to develop \"an amalgam of bebop, African and Cuban rhythms and super-modern harmonies\". Kenny Graham's Afro-Cubists, British modern jazz. Retrieved 18 November 2014  Although \"artistically successful\" and acclaimed for its innovative style, the band did not gain a large enough audience and the original band folded in March 1952 when trumpeter Jo Hunter and drummer Dicky DeVere left. However, a new band of Afro-Cubists performed at the opening night of the Flamingo Club in Soho in August 1952. \"The Ember Story\" at JeffreyKruger.com  Retrieved 16 May 2014 Graham also played baritone sax in Jack Parnell's band, and tenor with other bands, occasionally reconvening the Afro-Cubists for recordings and performances. The Afro-Cubists recorded two EPs in 1954, Afro-Cadabra and Excerpts from Caribbean Suite, with a band including saxophonist Eddie Mordue and drummer Phil Seamen. Kenny Graham's Afro-Cubists, Discogs.com. Retrieved 18 November 2014"]}, {"page": "Sweet & Swing", "response": ["The programme begins shortly after the conclusion of the previous music slot at 9:00pm. Howard Caine commences each episode with the greeting \"A very good evening to you\" and then proceeds to play the show's theme tune, Slow Train Blues by Eric Winstone."]}, {"page": "Helen McKay", "response": ["During the 1930s, McKay was a vocalist in the Lew Stone dance band. In the 1940s McKay was a contributor to the war effort with ENSA concerts on the BBC Forces Programme. McKay was a member of the Debonaires, a quartet, including Alex Dore, Nadia Dore and Harry Brooker. The Debonaires sang with the Ambrose Orchestra, Felix Mendelssohn's Hawaiian Serenaders, Eric Winstone and his band, and also had a late night radio show."]}, {"page": "Clare Deniz", "response": ["Her husband had to serve abroad during the war, and she worked with musicians including the bandleader Eric Winstone as well as the trumpeters Johnny Claes and Leslie Hutchinson. She later joined the West Indian Swing Stars, with Bertie King on saxophone, Coleridge Goode on bass, and Lauderic Caton on guitar. She later worked with Frank's Spirits of Rhythm, with Jimmy Skidmore on tenor saxophone."]}, {"page": "Julie Dawn", "response": ["After Italy entered the Second World War, her parents were interned until 1945. Julie Dawn joined Harry Roy's band in 1940 and toured with them; he left them in 1941 and joined the Eric Winstone Quartet. She made recordings with him after he formed a band, and also with Harry Leader and Billy Thorburn.", "In 1944 she worked with Carroll Gibbons and the Savoy Orpheans. For three weeks she toured France, Belgium and Holland with Geraldo  to entertain troops, and towards the end of the war she performed in Germany with Eric Winstone."]}, {"page": "Winstone, Eric", "response": ["#redirectEric Winstone"]}, {"page": "Eric Winstone Band", "response": ["#REDIRECT Eric Winstone"]}, {"page": "Frank Deniz", "response": ["Deniz joined the Merchant Navy in May 1940, in between voyages playing music with contemporaries including Eric Winstone and Edmundo Ros, and forming his own band, the Spirits of Rhythm. In 1944 he was wounded when his ship was torpedoed on approaching Anzio."]}]}}