{"wiki_id": "http://www.wikidata.org/entity/Q5393231", "itemLabel": "Ernest Hatch", "itemDescription": "British politician (1859-1927)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernest_Hatch", "wikipedia_page": {"main": "Sir Ernest Frederic George Hatch, 1st Baronet, KBE (12 April 1859 – 17 August 1927) was a British politician.\nHe was the son of John William Hatch of London and Matilda Augusta Snell of Callington, Cornwall. Following a private education, he went into business as a wine merchant, and in 1894 established Hatch, Mansfield and Company, working with James Mansfield, who became managing director.Hatch was unsuccessful Conservative parliamentary candidate for the Gorton Division of Lancashire at a by-election in 1889 and at the succeeding general election in 1892. On his third attempt, in the 1895 election, he was elected as Gorton's MP.\nHatch remained as Conservative member for Gorton until 1904, when his disagreement with Joseph Chamberlain over free trade led to him crossing the floor to the Liberal Party. At the next general election in 1906 he had little support from Liberal activists for his candidature, and accordingly withdrew.In 1908 he was created a baronet, \"of Portland Place, in the Metropolitan Borough of St Marylebone\". He was appointed chairman and treasurer of University College Hospital, LondonDuring the First World War he chaired the Government Commission on Belgian Refugees, and was made a commander of the Belgian Order of the Crown. He was also Chairman of Council of the Beyond Seas Association for Reception of Officers and Relatives from beyond the seas, and for this he was appointed Knight Commander of the Order of the British Empire (KBE) in the 1920 New Year Honours.Ernest Hatch married Lady Constance Blanche Godolphin Osborne in 1900, aunt of John Osborne, later Duke of Leeds. They had one daughter, and the baronetcy became extinct on Sir Ernest's death in 1927.", "link_mentions": [{"page": "1927", "response": ["** Ernest Hatch, British politician (b. 1859)"]}, {"page": "Manchester Gorton (UK Parliament constituency)", "response": ["|rowspan=\"2\"| Ernest Hatch"]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["| Ernest Hatch "]}, {"page": "List of MPs elected in the 1900 United Kingdom general election", "response": ["| Ernest Hatch "]}, {"page": "1927 in the United Kingdom", "response": ["* 17 August – Sir Ernest Hatch, politician (born 1859)"]}, {"page": "Sir Ernest Hatch, 1st Baronet", "response": ["#REDIRECT Ernest Hatch"]}, {"page": "Ernest Frederick George Hatch", "response": ["#REDIRECT Ernest Hatch"]}, {"page": "Ernest Frederic George Hatch", "response": ["#REDIRECT Ernest Hatch"]}, {"page": "Hatch baronets", "response": ["#REDIRECT Ernest Hatch"]}, {"page": "List of elected British politicians who have changed party affiliation", "response": ["|Ernest Hatch"]}, {"page": "1889 Gorton by-election", "response": ["The Conservatives, who were backed by their Liberal Unionist allies, selected Ernest Hatch. Hatch was aged 29, a wine merchant from London but had been active in the Gorton constituency for his party since June 1888.The Times, 9 March 1889 p12"]}, {"page": "Hatch Baronets", "response": ["#REDIRECT Ernest Hatch"]}, {"page": "James Mansfield (English cricketer)", "response": ["Mansfield became a wine merchant in the city of London in partnership with the MP Sir Ernest Hatch, and was managing director and later chairman of Hatch Mansfield & Co. He died in Westminster Hospital after a heart attack; he was not married."]}]}}