{"wiki_id": "http://www.wikidata.org/entity/Q5393216", "itemLabel": "Ernest Hare", "itemDescription": "British actor (1900-1981)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernest_Hare", "wikipedia_page": {"main": "Ernest Dudley Hare (5 December 1900, Highgate, London - 1981, London) was an English stage and film actor.", "link_mentions": [{"page": "I Want to Be Happy", "response": ["* Carl Fenton and His Orchestra (1924, Billy Jones, Ernest Hare, Wilfred Glenn, Elliot Shaw, vocal, peaking at #5 over three weeks)"]}, {"page": "My Buddy (song)", "response": ["\"My Buddy\" is a popular song with music written by Walter Donaldson, and lyrics by Gus Kahn. The song was published in 1922 and early popular versions were by Henry Burr (1922), Ernest Hare (1923) and Ben Bernie (also 1923)."]}, {"page": "Crown Court (TV series)", "response": ["An untransmitted pilot called Doctor's Neglect? was eventually broadcast as part of a repeat run on satellite channel Legal TV over 30 years later. Like the first transmitted episode, this was a civil case—in this instance relating to negligence. The pilot story differs in style in some important respects. In particular, it features informal conversations between the barristers in their quarters as well as them giving advice to clients. Neither aspect figured in episodes from the broadcast run itself, which strictly confined legal discussions to the courtroom. The episode also has no jury; the case is decided by a judge alone. David Ashford, a regular in the programme's early stages as barrister Charles Lotterby, plays a different barrister called Derek Jones. Actors Ernest Hare and David Neal make their only appearances, as a judge and barrister respectively."]}, {"page": "Ernie Hare", "response": ["Thomas Ernest Hare (March 16, 1883 – March 9, 1939) was an American singer who recorded prolifically during the 1920s and 1930s, finding fame as a radio star on the Happiness Boys radio program.", "Hare's recording career began in 1918. He was Al Jolson's understudy in the Broadway musical Sinbad during 1919–20. He recorded with the Cleartone Four, the Crescent Trio, the Harmonizers Quartet, and the Premier Quartet. He made a series recordings with Al Bernard in the late 1910s and the start of the 1920s. As a soloist, he worked under a variety of names (Wallace Daniels, Arthur Grant, Henry Jones, Robert Judson, Walter Lang, Walter Leslie, Roy Roberts, Bob Thomas, Bob Thompson, \"Hobo\" Jack Turner, and Frank Mann).Gracyk, Tim. Popular Acoustic Era Recording Artists, \"The Happiness Boys -- Comic Team of Billy Jones and Ernest Hare.\" Gracyk.com", "* Ernest Hare recordings at the Discography of American Historical Recordings."]}, {"page": "James Alexander Brennan", "response": ["James Alexander Brennan (November 18, 1885 – August 24, 1956) was an American songwriter.    Sometimes identified as Jas. H. Brennan, he collaborated with lyricist Jack Caddigan (1879–1952) on several songs published by Leo Feist and Oliver E. Story.   One of his more popular songs was \"Little Red School House\" which he wrote with Al Wilson in 1922.  It was originally sung by the American Quartet and also by The Happiness Boys, Billy Jones and Ernest Hare.  Brenda Lee sang it twice on TV, once at the age of 10 with Red Foley and later at 16 with Perry Como."]}, {"page": "All by Myself (Irving Berlin song)", "response": ["It was introduced in The Music Box Revue of 1922. Popular recordings in 1921 were by Ted Lewis, Frank Crumit, Aileen Stanley, Benny Krueger's Orchestra, Vaughn De Leath and by Ben Selvin (vocal by Ernest Hare)."]}, {"page": "Dale Wimbrow", "response": ["| \"Wife o'Mine\" || Ernest Hare || 1928 || Victor || composer "]}, {"page": "Hull Repertory Theatre Company", "response": ["*Ernest Hare, 1932"]}, {"page": "Alabama Jubilee (song)", "response": ["*1927: Al Bernard & Ernest Hare"]}, {"page": "Hare (surname)", "response": ["* Ernest Hare (1900-?), English actor"]}, {"page": "Starr and Company", "response": ["| colspan=2                  | Ernest Hare"]}, {"page": "Operaphone Records", "response": ["*Ernest Hare"]}, {"page": "Together (1980 TV series)", "response": ["*Ernest Hare as Derek Harding"]}, {"page": "Anthony Franchini", "response": ["Franchini lived in a hotel in New York City upon arriving back to the States.  There, he met up again with Colucci and Sullo and the three held a jam session in Franchini's room.  Frank Ferera, who resided in a room above Franchini's, overheard the music and was impressed to the point that he requested that Franchini make a record with him.  Thus Franchini began recording with Ferera in 1919, a few months before Helen Louise Greenus (Ferera's wife and recording partner) disappeared at sea.  Ferera asked Franchini to be his recording partner in 1920.  Together they became one of the most popular recordings artists in the 1920s.  Labels that released Ferrera and Franchini duets include Brunswick, Columbia, Emerson, Gennett, Lyric, Okeh, Pathé, Paramount, and Victor.  During their association, the duo of \"Ferera and Franchini\" typically recorded four to six sessions every single day.  Besides records released under their names they also recorded behind Anna Case, Vernon Dalhart, Ernest Hare, Billy Jones, and Bert Williams.  Altogether, more than 3500 sides were recorded by Ferera and Franchini.  On top of this, he was also an active session musician in his own right, accompanying Dalhart on some of Dalhart's early country music recordings and diversely performing Spanish music in Victor's ethnic catalog.  This period of activity was financially a time of great prosperity for Franchini."]}, {"page": "Don't Bring Lulu", "response": ["The sheet music is credited to Billy Rose, Lew Brown, and Ray Henderson. It was originally a novelty song and was often recorded by male singers in a comic style, including Billy Jones and Ernest Hare for example, with additional dialogue. A praised recording was the 1960 single by Dorothy Provine, backed by Whisper Song. She also performed the song for the American television series The Roaring 20's, which was aired during 1960-1962.", "* Ernest Hare and Billy Jones", "* Sam Lanin and His Orchestra (vocals: Ernest Hare)"]}, {"page": "Champ Butler", "response": ["In July 1951, Butler scored with another revival of a 1931 hit, \"Them There Eyes\", which had achieved success for Gus Arnheim. This made No. 22, receiving much radio airplay, and selling 500,000 copies. In September that year, Butler charted with a revival of an even older song, \"Down Yonder\", which had been a hit for Ernest Hare and Billy Jones in 1921. In 1951, it was competing with a number of other cover versions which also charted. Peaking at No. 17 during a 15-week run, the song became Butler's biggest hit, and sold nearly a million copies. The record was in the collection of Dwight Eisenhower, who later became President."]}]}}