{"wiki_id": "http://www.wikidata.org/entity/Q5393074", "itemLabel": "Ernest Ford", "itemDescription": "cricketer (1855-1900)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernest_Ford_(cricketer)", "wikipedia_page": {"main": "Ernest Claudius Bramhall Ford (23 July 1855 – 19 June 1900) was an English cricketer. Ford was a right-handed batsman who fielded as a wicket-keeper. He was born at Cheltenham, Gloucestershire, and was educated a Clifton College.Ford made his first-class debut for Gloucestershire against Surrey at The Oval in 1874. He made five further first-class appearances for the county, the last of which came against Sussex in 1875 at the County Ground, Hove. In his six first-class matches, he scored a total of 75 runs at an average of 10.71, with a high score of 32 not out.He died at Southend-on-Sea, Essex, on 19 June 1900.", "link_mentions": [{"page": "Ernest Ford", "response": ["thumb|right|Ernest Ford, an 1895 portrait", "Ford was born in Warminster, Wiltshire, England, the son of Edward Ford, the vestry clerk and organist there.  From 1868 to 1873, he sang in the chorus at Salisbury Cathedral.  He studied under Arthur Sullivan at the Royal Academy of Music in London, where, in 1875, he received the first Goss Scholarship. Ford studied in Paris under Édouard Lalo and also toured America.  There, his motet, a setting of the Psalm Domine Deus, was performed at a celebration of the 250th anniversary of the founding of Harvard University.  During the 1880s, Ford was the official accompanist at the Saturday Popular Concerts at St James's Hall, London.  He also wrote a number of operas and operettas in the 1880s and early 1890s, including Daniel O' Rourke (1884); Nydia (a duologue by Justin H. M. Carthy, 1889); Joan (Robert Martin, 1890); and Weatherwise (1893).Stone, David. \"Ernest Ford\", Who Was Who in the D'Oyly Carte Opera Company, The Gilbert and Sullivan Archive, 11 January 2013, accessed 25 March 2015", "By 1911, Ford was teaching singing as a Professor of Music at the Guildhall School of Music,Albert Ernest Ford in the 1911 England Census, accessed 25 March 2015 and beginning in 1916 he taught composition there.", "Ford married Alice Maria Philp (born 1875) in 1896 at St. James' church in Muswell Hill.Marriages and Banns, London, England, 1754–1921 for Albert Ernest Ford, Ancestry.com, accessed 25 March 2015 (pay to view) They had two daughters, Frances Lily Helen Dixon Ford (1897–1957) and Eileen Carlota Ford (born 1899). He died in Marylebone in London at the age of 61. In his will he left £976 8s 10d to his widow.Albert Ernest Ford in the England & Wales, National Probate Calendar (Index of Wills and Administrations), 1858–1966, Ancestry.com, accessed 25 March 2015 (pay to view)"]}, {"page": "List of Gloucestershire County Cricket Club players", "response": ["* Ernest Ford (1874–1875) : E. C. B. Ford"]}]}}