{"wiki_id": "http://www.wikidata.org/entity/Q5394482", "itemLabel": "Ernie George", "itemDescription": "Welsh rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernie_George", "wikipedia_page": {"main": "Ernest \"Ernie\" Edward George (1871 – 28 November 1952) was a Welsh international rugby union forward who played club rugby for a variety of teams, but is most associated with Pontypridd and Cardiff. George was capped three times for Wales between 1895 and 1896.\n\n", "link_mentions": [{"page": "Pontypridd RFC", "response": ["Pontypridd RFC are generally accepted to have been formed in 1876Smith (1980), pg 26. by a number of young local men who had moved into the area during the Industrial Revolution of the late 19th century. However, the first reported match involving Pontypridd was played on 18 December 1873 against Roath (Cardiff).https://newspapers.library.wales/view/3386390/3386398/81/football  They were represented at a meeting in Tenby in 1880 that would later lead to the formation of the Welsh Rugby Union in 1881Smith (1980), pg 37. and had a player, Edward Treharne, named in the very first Welsh International side also in 1881, who also played for Cowbridge Grammar School as a student.Smith (1980), pg 38. Pontypridd supplied two more players to the Welsh team before the turn of the century, Tom Williams and Ernie George."]}, {"page": "1952 in Wales", "response": ["*28 November – Ernie George, Wales international rugby player, c.81"]}, {"page": "Llantwit Major RFC", "response": ["*  Ernie George (3 caps)"]}, {"page": "1895 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea), Tom Pearson (Cardiff), Owen Badger (Llanelli), Arthur Gould (Newport) capt., Evan Lloyd (Llanelli), Selwyn Biggs (Cardiff), Fred Parfitt (Newport), Tom Graham (Newport), Arthur Boucher (Newport), Ernie George (Pontypridd), Jim Hannan (Newport), Harry Packer (Newport), Charles Nicholl (Llanelli), Frank Mills (Cardiff), Tom Pook (Newport)", "Wales: Billy Bancroft (Swansea), Tom Pearson (Cardiff), Owen Badger (Llanelli), Arthur Gould (Newport) capt., Thomas (Newport), David Morgan (Llanelli), Ralph Sweet-Escott (Cardiff), Albert Jenkin (Swansea), Arthur Boucher (Newport), Ernie George (Pontypridd), Jim Hannan (Newport), Harry Packer (Newport), Charles Nicholl (Llanelli), Frank Mills (Cardiff), Wallace Watts (Newport)"]}, {"page": "1896 Home Nations Championship", "response": [";Wales: Billy Bancroft (Swansea), Cliff Bowen (Llanelli), Owen Badger (Llanelli), Arthur Gould (Newport) capt., Bert Dauncey (Newport), David Morgan (Llanelli), Ben Davies (Llanelli), Albert Jenkin (Swansea), Arthur Boucher (Newport), Ernie George (Pontypridd), Sam Ramsey (Treorchy), Harry Packer (Newport), Charles Nicholl (Llanelli), Frank Mills (Cardiff), Wallace Watts (Newport)"]}, {"page": "Tom Pook", "response": ["Pook came to note as a rugby player as part of first class Welsh team, Newport. Pook was part of the Newport team who during 1891/92 completed the season as 'invincibles' having not lost a single match. In 1895, Pook was selected to represent Wales in the country's second game of the 1895 Home Nations Championship, against Scotland. Under the captaincy of Wales rugby legend Arthur Gould, Pook was one of three Welsh players to make their début in the match. The other's being Pontypridd's Ernie George and Llanelli's Evan Lloyd. Wales initially threatened to pull out of the game, due to the team's belief that the Raeburn Place pitch was frozen, but agreed to compete when the playing field was shortneded by 20 yards to avoid a dangerous section of the field.Godwin (1984) pg 43. Wales lost the game 5-4 and Pook did not represent Wales again."]}, {"page": "David Daniel (rugby union)", "response": ["Daniel failed to be reselected for three years, but in 1894, the year after Wales had won the Triple Crown, he was brought back into the pack as a replacement for Newport's David Samuel. Daniel kept his place throughout the Championship, which saw Wales lose to England and Ireland, but win at home to Scotland. Despite the fact the Daniel had held down a position for the full series, the next season he was again replaced, this time by William Elsey who was in turn replaced by Ernie George after a single game."]}, {"page": "William Elsey (rugby union)", "response": ["Elsey came to note as a rugby player while playing for first class Welsh team Cardiff. Despite being English born there was a two-year residency rule that allowed non-Welsh born players representing the Wales national team, and in 1895 he was selected to represent Wales as part of the Home Nations Championship. Elsey was brought into the Welsh pack for the Championship opener against England. The Welsh team had changed much since the previous match of the lase season, with only six of the original fifteen reselected, though only Elsey and Swansea's Tom Jackson were new caps amongst the forwards. The match was played at St. Helen's, Swansea with Wales led out by Arthur 'Monkey' Gould, in a team that contained over 100 caps from just seven players, against an English team fielding 10 new caps. Despite being in a far more experienced team, Elsey found himself on the losing side as the English won 14-6, scoring four tries. The Welsh points game from two tries, one of which was scored by Elsey. Even with a score on his international debut, Elsey was replaced for the next match of the Championship by Ernie George and never represented Wales again."]}]}}