{"wiki_id": "http://www.wikidata.org/entity/Q5392730", "itemLabel": "Ernest Barker", "itemDescription": "British political scientist (1874-1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernest_Barker", "wikipedia_page": {"main": "Sir Ernest Barker  (23 September 1874 – 17 February 1960) was an English political scientist who served as Principal of King's College London from 1920 to 1927.", "link_mentions": [{"page": "Erasmus", "response": ["According to Ernest Barker, \"Besides his work on the New Testament, Erasmus laboured also, and even more arduously, on the early Fathers. Among the Latin Fathers he edited the works of St Jerome, St Hilary, and St Augustine; among the Greeks he worked on Irenaeus, Origen and Chrysostom.\"Ernest Barker (1948) Traditions of Civility, chapter 4: The Connection between the Renaissance and the Reformation, pp. 93–94, Cambridge University Press"]}, {"page": "First Crusade", "response": ["It is difficult to assess the motives of the thousands of participants for whom there is no historical record, or even those of important knights, whose stories were usually retold by monks or clerics. As the secular medieval world was so deeply ingrained with the spiritual world of the church, it is quite likely that personal piety was a major factor for many crusaders. Even with this popular enthusiasm, Urban was ensured that there would be an army of knights, drawn from the French aristocracy. Aside from Adhemar and Raymond, other leaders he recruited throughout 1096 included Bohemond of Taranto,Ernest Barker (1911). \"Bohemund\". In Chisholm, Hugh (ed.) Encyclopædia Britannica. 4. (11th ed.). Cambridge University Press. pp. 135–136. a southern Italian ally of the reform popes; Bohemond's nephew Tancred;Chisholm, Hugh, ed. (1911). \"Tancred (crusader)\". Encyclopædia Britannica. 26. (11th ed.). Cambridge University Press. pp. 394–395. Godfrey of Bouillon,Louis René Bréhier (1909). \"Godfrey of Bouillon\". In Catholic Encyclopedia. 6. New York: Robert Appleton Company. who had previously been an anti-reform ally of the Holy Roman Emperor; his brother Baldwin of Boulogne;Ernest Barker (1911). \"Baldwin I (king of Jerusalem)\". In Chisholm, Hugh (ed.) Encyclopædia Britannica. 3. (11th ed.). Cambridge University Press. pp. 245–246. Hugh I, Count of Vermandois,Bull, Marcus, “The Capetian Monarchy and the Early Crusade Movement: Hugh of Vermandois and Louis VII,” Nottingham Medieval Studies 40 (1996), 25–46. brother of the excommunicated Philip I of France; Robert Curthose,David, C. Wendell (1920). Robert Curthose. Cambridge: Harvard university press. brother of William II of England; and his relatives Stephen II, Count of Blois,Brundage, James A. “An Errant Crusader: Stephen of Blois.” Traditio, Volume 16. Fordham University (1960). pp. 380–395. and Robert II, Count of Flanders.Knappen, Marshall M., “Robert II of Flanders in the First Crusade,” in The Crusades and Other Historical Essays Presented to Dana C. Munro by His Former Students, ed. Louis J. Paetow (New York: Crofts, 1928), pp. 79–100. The crusaders represented northern and southern France, Flanders, Germany, and southern Italy, and so were divided into four separate armies that were not always cooperative, though they were held together by their common ultimate goal.", "Two encyclopedia articles appeared in the early 20th century that are frequently called out by Crusader historians. The first of these is Crusades,Bréhier, Louis René. (1908). \"Crusades\". In Herbermann, Charles (ed.). Catholic Encyclopedia. 4. New York: Robert Appleton Company. by French historian Louis R. Bréhier, appearing in the Catholic Encyclopedia, based on his L'Église et l'Orient au Moyen Âge: Les Croisades.Bréhier, L. (1907). L'église et l'Orient au moyen âge: les croisades. Paris: Lecoffre, J. Gabalda. The second is The Crusades,Barker, Ernest (1911). \"Crusades\". In Chisholm, Hugh (ed.). Encyclopædia Britannica. 7 (11th ed.), Cambridge University Press. pp. 524–552. by English historian Ernest Barker, in the Encyclopædia Britannica (11th edition). Collectively, Bréhier and Barker wrote more than 50 articles for these two publications.Louis René Bréhier (1868–1951) (1913). In Herbermann, Charles (ed.). Catholic Encyclopedia. 4. New York: Robert Appleton Company.Ernest Barker (1874–1960) (1911). In Chisholm, Hugh (ed.). Encyclopædia Britannica. Index (11th ed.), Cambridge University Press. Barker's work was later revised as The Crusades and Bréhier published Histoire anonyme de la première croisade.Bréhier, L. (1924). Histoire anonyme de la première croisade. Paris: H. Champion. According to the Routledge Companion, these articles are evidence that \"not all old things are useless.\""]}, {"page": "Bohemond I of Antioch", "response": ["Bohemond I of Antioch (3 March 1111), also known as Bohemond of Taranto, was the Prince of Taranto from 1089 to 1111 and the Prince of Antioch from 1098 to 1111.Ernest Barker (1911). \"Bohemund\". In Chisholm, Hugh (ed.). Encyclopædia Britannica. 4. (11th ed.). Cambridge University Press. pp. 135-136. He was a leader of the First Crusade, leading a contingent of Normans on the quest eastward. Knowledgable about the Byzantine Empire through earlier campaigns with his father, he was the most experienced military leader of the crusade.Edgington, Susan (2006). \"Bohemond I of Antioch (d. 1111)\". In The Crusades - An Encyclopedia. pp. 175–176."]}, {"page": "James Fitzjames Stephen", "response": ["His book Liberty, Equality, Fraternity was called the \"finest exposition of conservative thought in the latter half of the 19th century\" by Ernest Barker.Ernest Barker, Political Thought in England: 1848 to 1914 (London: Thornton Butterworth, 1915), p. 150. It was listed as one of Ten Conservative Books to read in the chapter of that name in The Politics of Prudence by Russell Kirk. According to Princeton University political theorist Greg Conti, Stephen's political thought had liberal characteristics, even though he has frequently been characterized as conservative or religious authoritarian. According to Conti, Stephen \"articulated robustly both technocratic and pluralistic visions of politics. Perhaps more stridently than any Victorian, he put forward an argument for the necessity and legitimacy of expert rule against claims for popular government. Yet he also insisted on the plurality of perspectives on public affairs and on the ineluctable conflict between them.\""]}, {"page": "Fifth Crusade", "response": ["The secondary sources are well-represented in the Bibliography, below. Tertiary sources include works by Louis Bréhier in the Catholic Encyclopedia,Bréhier, Louis René (1908). \"Crusades\". In Herbermann, Charles (ed.). Catholic Encyclopedia. 4. New York: Robert Appleton Company. Ernest Barker in the Encyclopedia Britannica,Barker, Ernest (1911). \"Crusades\". In Chisholm, Hugh (ed.). Encyclopædia Britannica. 7 (11th ed.), Cambridge University Press. pp. 524–552. and Philip Schaff in the Schaff-Herzog Encyclopaedia of Religious Knowledge. Other works include The Mohammedan Dynasties by Stanley Lane-Poole and Bréhier's Crusades (Bibliography and Sources),Bréhier, Louis René (1908). \"Crusades (Sources and Bibliography)\". In Herbermann, Charles (ed.). Catholic Encyclopedia. 4. New York: Robert Appleton Company. a concise summary of the historiography of the Crusades."]}, {"page": "The City of God", "response": ["* The City of God. Translation by John Healey. Introduction by Ernest Barker. New York: E. P. Dutton & Co., 1945."]}, {"page": "A Dance to the Music of Time", "response": ["|Professor Sir Ernest Barker, and \"Sligger\" Urquhart. Not Sir Maurice Bowra as often suggested."]}, {"page": "Manchester Grammar School", "response": ["The tenure of Michael George Glazebrook as High Master, beginning in 1888, saw the introduction of three changes according to pupil Ernest Barker: a system of prefects to keep order, the singing of school songs conducted by John Farmer, and the wearing of school-caps and school-hats.Ernest Barker (1953) Age and Youth, page 267, Oxford University Press"]}, {"page": "The Outline of History", "response": ["In the years leading up to the writing of The Outline of History Wells was increasingly preoccupied by history, as many works testify. (See, for example, The New Machiavelli, Marriage, An Englishman Looks at the World, The Wife of Sir Isaac Harman, Mr. Britling Sees It Through, etc.) During World War I, he tried to promote a world history to be sponsored by the League of Nations Union, of which he was a member. But no professional historian would commit to undertake it, and Wells, in a financially sound position thanks to the success of Mr. Britling Sees It Through and believing that his work would earn little, resolved to devote a year to the project. His wife Catherine (Jane) agreed to be his collaborator in typing, research, organisation, correspondence, and criticism. Wells relied heavily on the Encyclopædia Britannica (11th ed., 1911), and standard secondary texts. He made use of the London Library, and enlisted as critical readers \"a team of advisers for comment and correction, chief among them Ernest Barker, Harry Johnston, E. Ray Lankester, and Gilbert Murray. The sections were then rewritten and circulated for further discussion until Wells judged that they had reached a satisfactory standard.\"Michael Sherborne, H.G. Wells: Another Kind of Life (Peter Owen, 2010), p. 252. The bulk of the work was written between October 1918 and November 1919."]}, {"page": "Gilbert Murray", "response": ["Two years later, Wells called on Murray, and Murray's New College colleague Ernest Barker, to lend their names as advisers on his The Outline of History. Their names duly appeared on the title page.The other advisers were E. Ray Lankester, Harry Johnston. Murray had to give evidence in the plagiarism case Deeks v. Wells that arose in 1925.McKillop, The Spinster and the Prophet covers this all thoroughly"]}, {"page": "E. T. Whittaker", "response": ["Edmund Taylor Whittaker was born in Southport, in Lancashire, the son of John Whittaker Esq. and his wife, Selina Septima Taylor. He was described as an \"extremely delicate child\", necessitating his mother to home school him until he was eleven years old, when he was sent off to Manchester Grammar School. Ernest Barker, a classmate of Whittaker's at the Grammar School with whom he shared the office of prefect, later recalled his personality: \"He had a gay, lively, bubbling spirit: he was ready for every prank: he survives in my memory as a natural actor; and I think he could also, on occasion, produce a merry poem.\"Ernest Barker (1953) Age and Youth, p 280, Oxford University Press While at the school, Whittaker studied on the \"classical side\", devoting three-fifths of his time to Latin and Greek. Whittaker struggled with the poetry and drama which was required by the upper school, and expressed gratitude for being allowed to leave these studies behind and specialise in mathematics."]}, {"page": "List of Balliol College, Oxford people", "response": ["* Sir Ernest Barker"]}, {"page": "Otto von Gierke", "response": ["**vol 4. Die Staats- und Korporationslehre der Neuzeit (1913) Section V, §§14-8 translated by Ernest Barker as Natural law and the theory of society, 1500 to 1800 (1934)."]}, {"page": "Maurice Reckitt", "response": ["Reckitt was born on 19 May 1888 in Beverley, Yorkshire, to Arthur Benington Reckitt and Helen Annie Thomas. His background was wealthy, with the family business Reckitt's of Hull manufacturing a well-known brand of bluing. His sister was Eva Collet Reckitt, founder of Collet's, the London bookshop. He graduated from St John's College, Oxford, in 1907 with second-class honours in history.{{sfn|\"Reckitt, Maurice At Oxford, and elsewhere throughout his life, he studied under Sir Ernest Barker, H. A. L. Fisher, G. K. Chesterton, A. R. Orage, John Neville Figgis, P. E. T. Widdrington, and V. A. Demant."]}, {"page": "List of people associated with the London School of Economics", "response": ["* Sir Ernest Barker, political scientist, Principal of King's College London, 1920–1927"]}, {"page": "Lewis Williams Douglas", "response": ["Upon his discharge in February 1919, Douglas returned to Jerome, Arizona, where he renewed his acquaintance with Margaret \"Peggy\" Zinsser, with whom he soon fell in love. The following year he taught at Amherst (where he worked as a teaching assistant to Ernest Barker and R. H. Tawney) and Hackley School. After marrying Peggy on June 18, 1921, the young couple moved to Jerome, where Lewis took a job at his father's United Verde Extension mine."]}, {"page": "Crusades", "response": ["Tertiary sources. Three works stand out as excellent references. These are: Louis Bréhier's multiple works on the CrusadesLouis René Bréhier (1868–1951) (1913). In Herbermann, Charles (ed.). Catholic Encyclopedia. 4. New York: Robert Appleton Company. in the Catholic Encyclopedia; the works of Ernest BarkerErnest Barker (1874–1960) (1911). In Chisholm, Hugh (ed.). Encyclopædia Britannica. Index (11th ed.), Cambridge University Press. in the Encyclopædia Britannica (11th edition), later expanded into a separate publication; and The Crusades—An Encyclopedia (2006), edited by historian Alan V. Murray."]}, {"page": "Sir Ernest Barker", "response": ["#REDIRECT Ernest Barker"]}, {"page": "Henry William Carless Davis", "response": ["*Ernest Barker, H. W. Carless Davis, C. R. L. Fletcher, Arthur Hassall, L. G. Wickham Legg, F. Morgan, Why We Are at War: Great Britain's Case, by Members of the Oxford Faculty of Modern History (Oxford: Clarendon Press, 1914)"]}, {"page": "The Public and its Problems", "response": ["Whether Dewey's communitarian bent makes his conception of democracy incompatible with liberalism is a matter of scholarly debate. One the one hand, Dewey belongs to a pluralist tradition that views the individual as the intersecting fusion of diverse social groups and overlapping associations – including the state itself. In this sense, Dewey's liberalism follows the likes of Arthur Bentley, Ernest Barker and Mary Parker Follett.Rogers, Melvin L. (April 21, 2010). \"Introduction: Revisiting The Public and Its Problems\". Contemporary Pragmatism. 7(1): 24. doi:10.1163/18758185-90000152. ISSN 1875-8185. On the other hand, by arguing that proper democracy requires the cultivation of certain personal qualities in all spheres of life, Dewey departs from the kind of liberal neutrality that some associate with John Rawls.Talisse, Robert B. (2017). \"Deweyan Democracy and the Rawlsian Problematic: A Reply to Joshua Forstenzer\". Transactions of the Charles S. Peirce Society. 53, no. 4: 579–583. Robert B. Talisse, for instance, argues that Dewey's conception of democracy as a way of life is incompatible with genuine pluralism.Talisse, Robert B. (2003). \"Can Democracy Be a Way of Life? Deweyan Democracy and the Problem of Pluralism\". Transactions of the Charles S. Peirce Society. 39, no. 1: 1–21. Talisse claims that Dewey's conception of democracy imposes a specific vision of good onto others, thereby relinquishing the pluralist aspirations of liberalism. Joshua Forstenzer has replied to Talisse's objection by holding that Deweyan democracy relies upon only a \"thin\" definition of the good – as opposed to a robust, comprehensive doctrine.Forstenzer, Joshua (2017). \"Deweyan Democracy, Robert Talisse, and the Fact of Reasonable Pluralism: A Rawlsian Response\". Transactions of the Charles S. Peirce Society. 53, No. 4: 553–578. For Forstenzer, no political system can ever be neutral vis-à-vis substantive definitions of the good; on his view, Deweyan democracy may invite the cultivation of certain democratic virtues, but it remains sufficiently broad for people of diverse backgrounds, faiths, and cultural traditions to live according to their own principles — to a large extent at least. Similarly, Shane J. Ralston argues that Deweyan democracy and pluralism are entirely compatible.Ralston, Shane J. (2008). \"In Defense of Democracy as a Way of Life: A Reply to Talisse's Pluralist Objection\". Transactions of the Charles S. Peirce Society. 44, no. 4: 629–60. More specifically, Ralston claims that Dewey offers a set of pluralist procedures that allow democracy as a way of life to include a robust respect of value-diversity, illustrating her argument with a real-life case studies.Ralston, Shane J. (2009). \"Deweyan Democracy and Pluralism: A Reunion\". Social Philosophy Today. 25: 223–240."]}, {"page": "Barker (surname)", "response": ["* Ernest Barker (1874–1960), an English political scientist and writer"]}, {"page": "Michael George Glazebrook", "response": ["Glazebrook worked briefly at Harrow and then was called to Manchester Grammar School in 1888 to replace Dill as High Master. Years later one of the students, Ernest Barker, recalled his presence:", ":[Glazebrook] gave me the impression of competence and of being in the general trend and current of educational advance; but I did not feel, though I may well have been mistaken, that he had the scholarship either of his predecessor or successor. He had married a lady who was kind to us boys, and in a stately way he sought to be kind himself. But in those days he seemed to me very 'high and lifted up' (I did not feel like that when I came to know him on more equal terms, thirty years later, when he was a Cannon of Ely and I was the principal of a London school.)Ernest Barker (1953) Age and Youth, page 268, Oxford University Press"]}, {"page": "List of Old Mancunians", "response": ["* Principal of King's College London, Sir Ernest Barker"]}, {"page": "A. E. Levett", "response": ["But some Oxford dons welcomed the new influence. Professor Ernest Barker, for instance, taught both Elizabeth Levett and her gifted contemporary Maude Clarke before departing Oxford to become principal of King's College, London."]}]}}