{"wiki_id": "http://www.wikidata.org/entity/Q539265", "itemLabel": "Imtiaz Dharker", "itemDescription": "contemporary British poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Imtiaz_Dharker", "wikipedia_page": {"main": "Imtiaz Dharker (born 31 January 1954) is a Pakistan-born British poet, artist, and video film maker. She won the Queen's Gold Medal for her English poetry and was appointed Chancellor of Newcastle University from January 2020.In 2019, she was considered for the position of Poet Laureate following the tenure of Dame Carol Ann Duffy, but withdrew herself from contention in order, as she stated, to maintain focus on her writing.\"I had to weigh the privacy I need to write poems against the demands of a public role. The poems won,\" said Dharker. For many Dharker is seen as one of Britain's most inspirational contemporary poets. She was elected a Fellow of the Royal Society of Literature in 2011. In the same year, she received the Cholmondeley Award from the Society of Authors. In 2016, she received an Honorary Doctorate from SOAS University of London.\nDharker was born in Lahore, Punjab, Pakistan. She grew up in Glasgow where her family moved when she was less than one year old. She was married to Simon Powell, the founder of the organisation Poetry Live, who died in October 2009 after an 11 year battle with cancer.With Poetry Live, she reads to over 25,000 students a year, travelling across the country with poets including Duffy, Simon Armitage, John Agard, Gillian Clarke, Daljit Nagra, Grace Nichols, Owen Sheers, Jackie Kay and Maura Dooley. Dharker divides her time between London, Wales, and Mumbai. She says she describes herself as a \"Scottish Muslim Calvinist\" adopted by India and married into Wales.  Her daughter, Ayesha (whose father is Anil Dharker), is an actress in international films, television and stage.Dharker is a prescribed poet on the British AQA GCSE English syllabus. Her poems Blessing, This Room and The right word were included in the AQA Anthology Different Cultures, Cluster 1 and 2 respectively. Her poem Tissue appears in the 2017 AQA poetry anthology for GCSE English Literature. Her poems Living Space and In Wales, wanting to be Italian also appear in the Eduqas WJEC poetry anthology for GCSE English Literature.Dharker was a member of the judging panel for the 2008 Manchester Poetry Prize, with Gillian Clarke and Dame Carol Ann Duffy. In 2011, she judged the Foyle Young Poets of the Year Award with the poet Glyn Maxwell. In 2012 she was nominated a Parnassus Poet at the Festival of the World, hosted by the Southbank Centre as part of the Cultural Olympiad 2012, the largest poetry festival ever staged in the UK, bringing together poets from all the competing Olympic nations.She was the poet in residence at the Cambridge University Library from January–March 2013. In July 2015, she appeared on the popular BBC Radio 4 programme Desert Island Discs and spoke about growing up in Glasgow and her decision to leave her family and elope to India, as well as her marriage to Powell.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Imtiaz Dharker (born 1954, P/W)"]}, {"page": "List of poets", "response": ["*Imtiaz Dharker (born 1954), Pakistan-born British poet, artist and filmmaker"]}, {"page": "Simon Armitage", "response": ["In March 2020 Armitage launched a podcast, The Poet Laureate Has Gone To His Shed, also broadcast on BBC Radio 4. While working on the medieval poem The Owl and the Nightingale he invited a series of guests to visit him in his garden writing-shed. His guests were Guy Garvey, Kae Tempest, Testament, Maxine Peake, Antony Gormley, Lily Cole, Sam Lee, Melanie Plimmer, Jackie Kay, Laura Ashe, and Chris Packham; the programme broadcast on 27 May was made while self-isolating during the COVID-19 pandemic, and was the last of the first series. A second series started on 3 July 2021, featuring Johnny Marr, Amanda Owen, Imtiaz Dharker, J. K. Rowling, Jo Whiley, Gillian Burke, John Tiffany,  Sabrina Verjee and Prince Charles."]}, {"page": "Newcastle University", "response": ["The current Chancellor is the British poet and artist Imtiaz Dharker. She assumed the position of Chancellor on 1 January 2020. The vice-chancellor is Chris Day, a hepatologist and former pro-vice-chancellor of the Faculty of Medical Sciences.", "*Imtiaz Dharker (2020–)"]}, {"page": "Royal Society of Literature", "response": [": Imtiaz Dharker", "| Imtiaz Dharker"]}, {"page": "Dharavi", "response": ["Dharavi, Slum for Sale (2009) by Lutz Konermann and Rob Appleby is a German documentary. In a programme aired in the United Kingdom in January 2010, Kevin McCloud and Channel 4 aired a two-part series titled Slumming It which centered around Dharavi and its inhabitants. The poem \"Blessing\" by Imtiaz Dharker is about Dharavi not having enough water. For The Win, by Cory Doctorow, is partially set in Dharavi. In 2014, Belgian researcher Katrien Vankrunkelsven made a 22-minute film on Dharavi which is entitled The Way of Dharavi."]}, {"page": "Queen's Gold Medal for Poetry", "response": ["* 2014: Imtiaz Dharker"]}, {"page": "Gillian Clarke", "response": ["Clarke has published numerous collections of poetry for adults and children (see below), as well as dramatic commissions and numerous articles in a wide range of publications. She is a former editor of The Anglo-Welsh Review (1975–84) and the current president of Tŷ Newydd. Several of her books have received a Poetry Book Society Recommendation. In 1999 Gillian Clarke received the Glyndŵr Award for an \"Outstanding Contribution to the Arts in Wales\" during the Machynlleth Festival. She was on the judging panel for the 2008 Manchester Poetry Prize. Clarke reads her poetry for teenagers who are taking their English GCSE school exams. She is part of the GCSE Poetry Live team that also includes John Agard, Simon Armitage, Carol Ann Duffy, Imtiaz Dharker, Moniza Alvi, Grace Nichols, Daljit Nagra and Choman Hardi."]}, {"page": "T. S. Eliot Prize", "response": ["*2013 – Imtiaz Dharker, Ian Duhig and Vicki Feaver"]}, {"page": "Ayesha Dharker", "response": ["She is the daughter of Imtiaz Dharker, a poet, artist and documentary film-maker, and Anil Dharker, a columnist and an ex-editor of the Indian men's magazine Debonair.SAWNET: Who's Who: Ayesha Dharker  Her father is from India and her mother, born in Lahore, was raised in Scotland, United Kingdom."]}, {"page": "Cholmondeley Award", "response": ["* Imtiaz Dharker"]}, {"page": "AQA Anthology", "response": ["*Imtiaz Dharker: \"Blessing\"", "*Imtiaz Dharker: \"Blessing\"", "*Imtiaz Dharker: \"This Room\"", "*'The Right Word' by Imtiaz Dharker"]}, {"page": "2001 in poetry", "response": ["* Imtiaz Dharker, I Speak for the Devil ( Poetry in English ), first foreign edition brought out from United Kingdom by Bloodaxe (first India edition: Penguin Books India, 2003)Web page titled \"Imtiaz Dharker\" , Poetry International website, retrieved July 10, 2010"]}, {"page": "1994 in poetry", "response": ["* Imtiaz Dharker, Postcards from God ( Poetry in English ), Viking PenguinWeb page titled \"Imtiaz Dharker\" , Poetry International website, retrieved July 10, 2010"]}, {"page": "1989 in poetry", "response": ["* Imtiaz Dharker, Purdah ( Poetry in English ),Oxford University Press, DelhiWeb page titled \"Imtiaz Dharker\" , Poetry International website, retrieved July 10, 2010"]}, {"page": "1954 in poetry", "response": ["** Imtiaz Dharker, Pakistan-born British"]}, {"page": "List of people from Lahore", "response": ["* Imtiaz Dharker"]}, {"page": "Poems on the Underground", "response": ["Launched in 1986, the Poems on the Underground programme was the idea of three writers, Judith Chernaik, Gerard Benson, and Cicely Herbert whose aim was to bring poetry to a wider audience. Judith Chernaik, Cicely Herbert, Imtiaz Dharker, and George Szirtes now select poems for inclusion in the programme. London Underground provides space on its fleet of trains, and they and POTU's partners also display the poems on their websites during the duration of the print display. The posters are designed by Tom Davidson."]}, {"page": "Blessing (poem)", "response": ["#REDIRECT Imtiaz Dharker"]}]}}