{"wiki_id": "http://www.wikidata.org/entity/Q5393062", "itemLabel": "Ernest Fernyhough", "itemDescription": "British politician (1908-1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernest_Fernyhough", "wikipedia_page": {"main": "Ernest Fernyhough (24 December 1908 – 16 August 1993) was a British Labour Party politician.", "link_mentions": [{"page": "List of MPs elected in the 1950 United Kingdom general election", "response": ["|Ernest Fernyhough"]}, {"page": "List of MPs elected in the October 1974 United Kingdom general election", "response": ["|Ernest Fernyhough"]}, {"page": "List of MPs elected in the February 1974 United Kingdom general election", "response": ["|Ernest Fernyhough"]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*Ernest Fernyhough (1908–1993)"]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|Ernest Fernyhough"]}, {"page": "Waverley Route", "response": ["The Waverley Route's fate was decided at a meeting of the MCEP on 21 May chaired by Peter Shore, Secretary of State for Economic Affairs, and attended by Willie Ross, Marsh, Tom Urwin, Ray Gunter, Dick Taverne and Ernest Fernyhough. Two supporters of the line - Antony Crosland and Lord Brown of Machrihanish - were absent. After hearing arguments on both sides, Shore summarised the Committee's opinion in favour of closure throughout \"as quickly as possible\", noting that the effect on the movement of freight traffic would be minimal and that inconvenience for some passengers was an inevitable consequence of any closure. Following the meeting, Ross escalated the matter to the Prime Minister, Harold Wilson, begging him \"to look at the cumulative consequences of our course of action on our standing in Scotland\". Marsh countered with a memorandum which stated that closure would affect \"only about 200 regular travellers [...], of whom all but 30 would be adequately catered for by alternative bus services\", and that the subsidy required to continue the passenger service would run into more than several million pounds per year. He was supported by Peter Shore, who sent a separate memorandum referring to the Central Borders study and its lack of support for the line. The Prime Minister replied to Ross on 5 June indicating that he saw no reason to reopen the MCEP's decision. An official statement by Richard Marsh in the House of Commons on 15 July 1968 confirmed the Waverley Route's demise. A petition against closure, with 11,678 signatures presented to the Prime Minister in December 1968 by a Hawick housewife, Madge Elliot, accompanied by David Steel and the Earl of Dalkeith, MP for Edinburgh North, was to no avail. The line closed on Monday 6 January 1969, one of 37 lines closed by Marsh during his 18-month term of office. It was the largest railway closure in the United Kingdom until the closure of the Great Central Main Line a few months later."]}, {"page": "Jarrow (UK Parliament constituency)", "response": ["| Ernest Fernyhough"]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| Ernest Fernyhough"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| Ernest Fernyhough"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| Ernest Fernyhough"]}, {"page": "List of MPs elected in the 1964 United Kingdom general election", "response": ["| Ernest Fernyhough"]}, {"page": "List of MPs elected in the 1966 United Kingdom general election", "response": ["| Ernest Fernyhough"]}, {"page": "Labour government, 1964–1970", "response": ["|rowspan=3|Under-Secretary of State for Employment||Ernest Fernyhough||6 April 1968 – 13 October 1969|| ", "|Ernest Fernyhough||7 January 1967 – 6 April 1968|| "]}, {"page": "List of United Kingdom by-elections (1931–1950)", "response": ["|Ernest Fernyhough"]}]}}