{"wiki_id": "http://www.wikidata.org/entity/Q5398505", "itemLabel": "Esme Percy", "itemDescription": "actor (1887-1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Esme_Percy", "wikipedia_page": {"main": "Saville Esmé Percy (8 August 1887 – 17 June 1957) was an English actor who specialized in the plays of G.B. Shaw and appeared in 40 films between 1930 and 1956. He was born in London and died in Brighton.", "link_mentions": [{"page": "Lost Horizon", "response": ["* A one-hour adaptation by James Hilton and Barbara Burnham was broadcast on the BBC National Programme at 20:30 on 1 August 1935, with a cast that included Esme Percy as \"the High Lama\", Ben Welden as \"Barnard\", Barbara Couper as \"Miss Brinklow\", Jon Swinley as \"Conway\" and Cathleen Cordell as \"Lo Tsen\". It was broadcast again on 2 August 1935, 30 and 31 January 1936, 30 October 1939 and 9 April 1945."]}, {"page": "John Le Mesurier", "response": ["He first appeared on television in 1938 as Seigneur de Miolans in the BBC broadcast of The Marvellous History of St Bernard. During the Second World War Le Mesurier was posted to British India, as a captain with the Royal Tank Regiment. Following the war, he returned to acting and made his film debut in 1948, starring in the second feature comedy short Death in the Hand, opposite Esme Percy and Ernest Jay.", "On his return to Britain, Le Mesurier returned to acting; he initially struggled for work, finding only a few minor roles. In February 1948 he made his film debut in the second feature comedy short Death in the Hand, which starred Esme Percy and Ernest Jay. He followed this with equally small roles in the 1949 film Old Mother Riley's New Venture—where his name was misspelt on the credits as \"Le Meseurier\"—and the 1950 crime film Dark Interval. During the same period he also frequently appeared on stage in Birmingham."]}, {"page": "Cultural depictions of Napoleon", "response": ["*Invitation to the Waltz (1935), played by Esme Percy"]}, {"page": "Rupert Baxter", "response": ["*Esme Percy portrayed Baxter in the 1933 film Summer Lightning."]}, {"page": "Murder!", "response": ["Sir John feels responsible, as he was the one who had recommended that Diana take the touring job in order for her to get more life experience. It also turns out that Diana has been a fan of his since childhood. She is beautiful, and seems far too honest and straightforward to be a criminal of any kind. Using skills he has learned in the theatre, Sir John investigates the murder with the help of the stage manager Ted Markham (Edward Chapman) and his wife Doucie (Phyllis Konstam). They narrow the possible suspects down to one male actor in the troupe, Handel Fane (Esme Percy), who often plays cross-dressing roles.", "* Esme Percy as Handel Fane"]}, {"page": "The Man of Destiny", "response": ["The play was written for Ellen Terry and Richard Mansfield, but was first performed, on 1 July 1897, at the Grand theatre, Croydon with Murray Carson and Florence West in the principal roles.Violet M. Broad & C. Lewis Broad, Dictionary to the Plays and Novels of Bernard Shaw, A. & C. Black, London, 1929, p.225.  The play was the first Shaw work performed in the German language when it was given in a translation by Siegfried Trebitsch at the Schauspielhaus in Frankfurt on 20 April 1903. On 28 March 1928, the play had its first radio broadcast with Esme Percy as Napoleon."]}, {"page": "Caesar and Cleopatra (film)", "response": ["* Esme Percy as Major Domo"]}, {"page": "Esmé", "response": ["*Esme Percy (1887–1957), British actor"]}, {"page": "Vivien Leigh on stage and screen", "response": ["| Esme Percy"]}, {"page": "Pygmalion (1938 film)", "response": ["* Esme Percy as Count Aristid Karpathy"]}, {"page": "The Lady's Not for Burning", "response": ["| Esme Percy", "| Esme Percy"]}, {"page": "List of adventure films of the 1930s", "response": ["|Song of Freedom||J. Elder Wills||Paul Robeson, Elisabeth Welch, Esme Percy||United Kingdom||Adventure drama"]}, {"page": "The Invader (1935 film)", "response": ["* Esme Percy as Jose "]}, {"page": "Esmé Percy", "response": ["#REDIRECT Esme Percy"]}, {"page": "List of British films of 1948", "response": ["|Death in the Hand||  A. Barr-Smith ||Esme Percy, Ernest Jay, Cecile Chevreau|| Short mystery ||"]}, {"page": "21 Days", "response": ["Larry Durrant (Laurence Olivier) is a disappointment to his family. Henry Wallen (Esme Percy), the long-missing and disreputable foreign husband of Larry's lover Wanda (Vivien Leigh) shows up on her doorstep. He tries to extort money from the lovers and, in the ensuing fight, Larry accidentally kills him.", "* Esme Percy as Henry Wallen"]}, {"page": "Jeannie (film)", "response": ["* Esme Percy"]}, {"page": "Accused (1936 film)", "response": ["* Esme Percy as Morel  "]}, {"page": "It Happened in Paris (1935 film)", "response": ["It Happened in Paris is a 1935 British romantic comedy film directed by Robert Wyler and starring John Loder, Nancy Burne, and Esme Percy.IMDB entry The film marked Reed's directorial debut, and after working on this film with Wyler he was the sole director on his next film Midshipman Easy. The film is also notable for John Huston's contributions to the screenplay, and for the involvement of Carol Reed, who is mentioned by some sources to assisted and in others to have co-directed the film.", "* Esme Percy as Pommier "]}, {"page": "Lisbon Story (1946 film)", "response": ["* Esme Percy as Mariot  "]}, {"page": "The Lucky Number", "response": ["*Esme Percy as Chairman"]}, {"page": "Land Without Music", "response": ["*Esme Percy as Austrian Ambassador"]}, {"page": "Bitter Sweet (1933 film)", "response": ["* Esme Percy as Hugh Devon  "]}, {"page": "Eurydice (Anouilh play)", "response": ["BBC THIRD PROGRAMME, 5/2/51. Cast included Paul Scofield, Esme Percy and Sebastian Cabot. Held at The British Library National Sound Archive, Find Format: T11629WR C1"]}, {"page": "Summer Lightning (film)", "response": ["* Esme Percy – Baxter"]}, {"page": "The Frog", "response": ["* Esme Percy as Philo Johnson"]}, {"page": "A Woman Alone (1936 film)", "response": ["* Esme Percy - General Petroff"]}, {"page": "The Ghosts of Berkeley Square", "response": ["* Esme Percy as Vizier"]}, {"page": "The Amateur Gentleman (1936 film)", "response": ["* Esme Percy as John Townsend "]}, {"page": "Abdul the Damned (film)", "response": ["* Esme Percy - Ali - Chief Eunuch"]}, {"page": "Our Fighting Navy", "response": ["* Esme Percy as Diego de Costa "]}, {"page": "List of composers depicted on film", "response": ["| Esme Percy"]}, {"page": "Death in the Hand", "response": ["Death in the Hand  is a 1948 British short mystery film directed by  A. Barr-Smith, starring Esme Percy, Ernest Jay and Cecile Chevreau. The film marked the debut of John Le Mesurier. It was made by the small independent company Vandyke Productions.", "In a seaside guest house, a nervous piano player, Cosmo Vaughan (Esme Percy), tells a tale of how he read the palms of passengers on board a train and forecast their deaths. But is Mr Vaughan quite what he appears?", "*Esme Percy as Cosmo Vaughan"]}, {"page": "Jump for Glory", "response": ["* Esme Percy as Robinson"]}, {"page": "Gravelhanger", "response": ["The show starred Peter Coke, Olaf Pooley, Ursula Howells, Christopher Rhodes, Jean Cadell, James Raglan, and Esme Percy."]}]}}