{"wiki_id": "http://www.wikidata.org/entity/Q5392696", "itemLabel": "Ernest Alfred Vizetelly", "itemDescription": "English writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernest_Alfred_Vizetelly", "wikipedia_page": {"main": "Ernest Alfred Vizetelly (1853–1922) was an English journalist and author.", "link_mentions": [{"page": "Les Rougon-Macquart", "response": ["In an \"Introduction\" of his last novel, Le Docteur Pascal, Zola gave a recommended reading order, although it is not required, as each novel stands on its own.The reading order recommended by Zola can be found in Ernest Alfred Vizetelly's  Emile Zola, novelist and reformer: an account of his life & work (1904),  ppg.348-364."]}, {"page": "L'Assommoir", "response": ["L'Assommoir has often been translated, and there are several unexpurgated modern editions available. In the 1880s, Ernest Alfred Vizetelly produced an English language translation of the novel with some edits designed not to offend the sensibilities of British audiences. Along with his father, Vizetelly had translated a number of Zola's books. However, the salacious nature of Zola's work (even in edited form) would see the Vizetellys vilified in parliament and later prosecuted for obscenity.Robin Buss, The Guardian: Emile Zola - Apostle of the gutter"]}, {"page": "Thérèse Raquin", "response": ["* 1887, Translation by Ernest Alfred Vizetelly"]}, {"page": "Henry Vizetelly", "response": ["He had four sons by his first wife,\"Obituary Notice of Frank H. Vizetelly\"  from Dictionary of American Biography notably Ernest Alfred Vizetelly (1853–1922) who reworked some of his father's Zola translations and published these bowdlerized versions in the 1890s. By his second wife, Elizabeth Anne Ansell, he had a daughter and a son, Frank Horace Vizetelly (1864–1938), who was a lexicographer, etymologist and editor."]}, {"page": "Ernest A. Vizetelly", "response": ["#REDIRECT Ernest Alfred Vizetelly"]}, {"page": "Ernest Vizetelly", "response": ["#REDIRECT Ernest Alfred Vizetelly"]}, {"page": "E. A. Vizetelly", "response": ["#REDIRECT Ernest Alfred Vizetelly"]}, {"page": "Frank Horace Vizetelly", "response": ["Vizetelly was born in England, the only son of Henry Vizetelly and his second wife, Elizabeth Anne Ansell. His half-brother was Ernest Alfred Vizetelly (1853–1922). After an education in France and England, he joined his father's publishing house in 1882; the firm and his father were eventually ruined by convictions for obscenity resulting from the publication of the novels of Émile Zola."]}, {"page": "Orsini affair", "response": ["Orsini fled the scene of the assassination attempt, but was arrested shortly afterwards. He stood trial and was condemned to die by the guillotine. He left a detailed testament, and also addressed two letters to Napoleon III. He was executed on 13 March 1858,Benedict Anderson, Under Three Flags: Anarchism and the Anti-Colonial Imagination (2005), p. 115 note 89; Google Books. with Pieri who had also planned to take part in the attack but had been arrested, at La Roquette. Camillo di Rudio, another assassin, was convicted but later had his death sentence commuted to hard labour; later in the USA he took part in the Battle of the Little Big Horn, serving under Custer. Antonio Gomez, who was Orsini's servant, was also sentenced to hard labour.Blumberg, p. 172 note 57; Google Books.Ernest Alfred Vizetelly, Court Life of the Second French Empire, 1852–1870 (1908), pp. 114–20; archive.org. One of Orsini's letters to Napoleon was read out in court by his counsel; the second was published officially after his death.Cambridge Modern History vol. 9 (1934), p. 375; Google Books."]}, {"page": "George Montbard", "response": ["In My Days of Adventure; The Fall of France, 1870–71, Ernest Alfred Vizetelly, who had hired Montbard as an illustrator, writes that at that time Montbard \"was a Republican—in fact, a future Communard\" and did not appreciate an unexpected meeting in the street with Napoleon III, who took an interest in the sketch he was making. He refused to shave his \"revolutionary beard\" at the request of the chamberlain.Ernest Alfred Vizetelly, My Days of Adventure; The Fall of France, 1870–71, London: Chatto & Windus, 1914, , pp. 23–24, online at the Internet Archive, pdf pp. 43–44."]}, {"page": "Vizetelly", "response": ["** Ernest Alfred Vizetelly (1853–1922), journalist and author"]}]}}