{"wiki_id": "http://www.wikidata.org/entity/Q5392837", "itemLabel": "Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernest_Brudenell-Bruce,_3rd_Marquess_of_Ailesbury", "wikipedia_page": {"main": "Ernest Augustus Charles Brudenell-Bruce, 3rd Marquess of Ailesbury PC (8 January 1811 – 18 October 1886), styled Lord Ernest Bruce from 1821 until 1878, was a British courtier and politician. He served as Vice-Chamberlain of the Household between 1841 and 1846 and again between 1852 and 1858. An MP for 46 years, he succeeded his elder brother in the marquessate in 1878.", "link_mentions": [{"page": "Jervaulx Abbey", "response": ["The standing remains of the abbey include part of the church and claustral buildings and a watermill. The lordship of East Witton, including the site of the abbey, was granted by Henry VIII to Matthew Stuart, 4th Earl of Lennox, and Margaret, his wife, the king's niece, and after passing through various hands the property came into the possession of the Bruce family, one of whom was created Earl of Ailesbury in 1805. The estate was purchased from the trustees of Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury, in 1887 by S. Cunliffe Lister Esq. of Swinton Park for £310,000."]}, {"page": "Marquess of Ailesbury", "response": ["The 2nd Marquess was succeeded by his younger brother, Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury, who had previously sat in the House of Commons for 46 years under the name of Lord Ernest Bruce. The 3rd Marquess was succeeded by his grandson, George Brudenell-Bruce, 4th Marquess of Ailesbury, the only son of George John Brudenell-Bruce. The 4th Marquess died bankrupt at an early age and was succeeded by his uncle, Henry Brudenell-Bruce, 5th Marquess of Ailesbury, who had previously represented Chippenham in Parliament under the name of Lord Henry Bruce. As of 2013 the titles are held by the 5th Marquess's great-grandson, Michael Brudenell-Bruce, 8th Marquess of Ailesbury, the titles having descended from father to son.", "*Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury (1811–1886)"]}, {"page": "Lord Lieutenant of Berkshire", "response": ["*Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury 16 January 1884–18 October 1886"]}, {"page": "George Brudenell-Bruce, 2nd Marquess of Ailesbury", "response": ["Born in Lower Grosvenor Street, London, Bruce was the oldest son of Charles Brudenell-Bruce, 1st Marquess of Ailesbury, and his first wife the Hon. Henrietta Hill, oldest daughter of Noel Hill, 1st Baron Berwick. He was the brother of Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury, and the half-brother of Lord Charles Brudenell-Bruce. He was baptised at St George's, Hanover Square, with King George III and Queen Charlotte as his godparents. He was educated at Eton College and Christ Church, Oxford. In 1856, he succeeded to his father's titles and, in 1868, to those of his distant cousin James Brudenell, 7th Earl of Cardigan."]}, {"page": "Lord Charles Bruce", "response": ["Bruce was the son of Charles Brudenell-Bruce, 1st Marquess of Ailesbury, by his second wife Maria Elizabeth Tollemache, daughter of the Honourable Charles Tollemache, of Harrington, Northamptonshire. George Brudenell-Bruce, 2nd Marquess of Ailesbury, and Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury, were his elder half-brothers.thepeerage.com Rt. Hon. Lord Charles William Brudenell-Bruce"]}, {"page": "Ernest Augustus Charles Brudenell-Bruce, 3rd Marquess of Ailesbury", "response": ["#REDIRECT Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury"]}, {"page": "William Hare, 3rd Earl of Listowel", "response": ["Lord Listowel married Lady Ernestine Mary, younger daughter of Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury, in 1865. He died in June 1924, aged 91, and was succeeded in his titles by his eldest son Richard.  Two of his grandsons, William Hare, 5th Earl of Listowel, and John Hare, 1st Viscount Blakenham, both became government ministers. Lady Listowel died in 1936."]}, {"page": "Deene Park", "response": ["Seven of the Brudenell family were Earls of Cardigan – the most notable being the 7th Earl who led the Charge of the Light Brigade at the Battle of Balaclava (1854). The 7th Earl died childless in 1868, and while the Earldom of Cardigan merged with the Marquessate of Ailesbury, the Deene Park estate passed, after the death in 1915 of his widow, to the descendants of his second cousin Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury.Obituary of Marian Brudenell "]}, {"page": "Henry Brudenell-Bruce, 5th Marquess of Ailesbury", "response": ["Ailesbury was the third son of Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury, and his wife the Hon. Louisa Elizabeth, daughter of John Horsley-Beresford, 2nd Baron Decies. He was educated at Windlesham House School and Eton College."]}, {"page": "EAC Brudenell-Bruce", "response": ["#REDIRECT Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury"]}, {"page": "Ernest Augustus Charles Brudenell-Bruce III, 3rd Marquess of Ailesbury", "response": ["#REDIRECT Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury"]}, {"page": "Lord Ernest Brudenell-Bruce", "response": ["#REDIRECT Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury"]}, {"page": "Noel Hill, 1st Baron Berwick", "response": ["Through his daughter Henrietta, he was a grandfather of Lady Maria Carolina Ann Brudenell-Bruce (wife of the Count de Montreville), Lady Augusta Frederica Brudenell-Bruce (wife of Frederick Wentworth), George Brudenell-Bruce, 2nd Marquess of Ailesbury, Lady Elizabeth Brudenell-Bruce (wife of H.E. Lensgreve Christian Danneskiold-Samsøe), and Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury."]}, {"page": "Lord Ernest Bruce", "response": ["#REDIRECT Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury"]}, {"page": "Florence Brudenell-Bruce", "response": ["The daughter of Andrew Brudenell-Bruce, a wine merchant and descendant of Ernest Brudenell-Bruce, 3rd Marquess of Ailesbury, 9th Earl of Cardigan; and French artist Sophie Brudenell-Bruce, she has three elder siblings: a brother, Henry, and two sisters, Alice and Christabel, the latter married with two daughters."]}]}}