{"wiki_id": "http://www.wikidata.org/entity/Q539897", "itemLabel": "Stephen Morris", "itemDescription": "English drummer", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Morris_(musician)", "wikipedia_page": {"main": "Stephen Paul David Morris (born 28 October 1957) is an English drummer who is best known for his work with the rock band New Order and, previously, Joy Division. He also wrote and performed in The Other Two, a band consisting of Morris and his girlfriend and later wife, Gillian Gilbert. Morris also participated in the New Order spin-off band Bad Lieutenant. He is known for his precise drumming that seamlessly weaves with New Order's and Joy Division's drum machine sounds.", "link_mentions": [{"page": "Cheshire", "response": ["Cheshire has produced notable musicians such as Rick Astley, Joy Division members Ian Curtis and Stephen Morris, One Direction member Harry Styles, the members of The 1975, Take That member Gary Barlow, The Cult member Ian Astbury,Larkin, Colin (2011) The Encyclopedia of Popular Music, Bish Bash Books, , p. 461 Catfish and the Bottlemen member Van McCann, Girls Aloud member Nicola Roberts, Stephen Hough, John Mayall,John Mayall biographical details.  www.johnmayall.com website. Accessed on 21 February 2008. The Charlatans member Tim Burgess, and Nigel Stonier."]}, {"page": "Joy Division", "response": ["Joy Division were  an English rock band formed in Salford in 1976. The group consisted of vocalist Ian Curtis, guitarist/keyboardist Bernard Sumner, bassist Peter Hook and drummer Stephen Morris.", "In August 1977, Warsaw placed an advertisement in a music shop window seeking a replacement drummer. Stephen Morris, who had attended the same school as Curtis, was the sole respondent. Deborah Curtis, Ian's wife, stated that Morris \"fitted perfectly\" with the band, and that with his addition Warsaw became a \"complete 'family. To avoid confusion with the London punk band Warsaw Pakt, the band renamed themselves Joy Division in early 1978, borrowing the name from the sexual slavery wing of a Nazi concentration camp mentioned in the 1955 novel House of Dolls. In December, the group recorded their debut EP, An Ideal for Living, at Pennine Sound Studio and played their final gig as Warsaw on New Year's Eve at the Swinging Apple in Liverpool. Billed as Warsaw to ensure an audience, the band played their first gig as Joy Division on 25 January 1978 at Pip's Disco in Manchester.", "* Stephen Morris – drums, percussion (1977–1980)", " bar:Stephen text:\"Stephen Morris\""]}, {"page": "New Order (band)", "response": ["New Order are  an English rock band formed in 1980 by vocalist and guitarist Bernard Sumner, bassist Peter Hook and drummer Stephen Morris. The band formed after the demise of Joy Division, following the suicide of lead singer Ian Curtis; they were joined by Gillian Gilbert on keyboards later that year. New Order's integration of post-punk with electronic and dance music made them one of the most acclaimed and influential bands of the 1980s.Ankeny, Jason. \"[ New Order > Biography]\". AllMusic. Retrieved on 24 August 2009. They were the flagship band for Manchester-based independent record label Factory Records and its nightclub The Haçienda, and worked in long-term collaboration with graphic designer Peter Saville.", "Between 1977 and 1980, Ian Curtis, Peter Hook, Stephen Morris, and Bernard Sumner were members of the post-punk band Joy Division, often featuring heavy production input from producer Martin Hannett.Rambali, Paul. \"New Order\". The Face, July 1983. Curtis took his own life on 18 May 1980, the day before Joy Division were scheduled to depart for their first American tour, and prior to the release of the band's second album, Closer. The rest of the band decided soon after Curtis's death that they would carry on.Savage, Jon. \"Joy Division: Someone Take These Dreams Away.\" Mojo. July 1994. Prior to his death, the members of Joy Division had agreed not to continue under the Joy Division name should any one member leave. On 29 July 1980, the still unnamed trio debuted live at Manchester's Beach Club.Flowers, Claude. New Order + Joy Division: Dreams Never End. London: Omnibus Press, 1995. Pg. 44.Johnson, Mark. An Ideal For Living: An History Of Joy Division. London: Bobcat Books, 1984. Pg. 69.Middles, Mick. From Joy Division to New Order: The Factory Story. London: Virgin Books, 1996. Pg. 160. Rob Gretton, the band's manager for over 20 years, is credited for having found the name New Order in an article in The Guardian titled \"The People's New Order of Kampuchea\". The band adopted this name, despite its previous use for former Stooge Ron Asheton's band The New Order. The group states that the name New Order (as was also the case with \"Joy Division\") does not draw a direct line to National Socialism or Fascism.NewOrderStory [DVD]. Warner Bros., 2005.", "In November 2015, Peter Hook sued Bernard Sumner, Stephen Morris and Gillian Gilbert. In an objection, it was revealed that Sumner, Morris and Gilbert had set up a new company behind Hook's back, that it has generated an income of £7.8 million in four years while Hook received only a fraction of that. The three members argued they had treated Hook fairly and that his stake in the band's royalties was reasonable, despite the fact that in four years, Hook had only received \"1.25 per cent of the band's royalties and other income from merchandising and performances\". The judge ruled that there was \"at least a reasonable prospect\" of Hook proving that he was not getting a fair share of royalties and other income and rejected Sumner and Morris's lawyer argument. The judge was willing to hear the case but urged the parties to come to an agreement rather than suffer legal costs of around £900,000. \"Blue Monday for New Order as Peter Hook Sues The for Many Millions of Pounds\". Telegraph.co.uk. 30 November 2015. Retrieved 5 Dec 2015. On 20 September 2017, the band announced that a full and final settlement had been reached in the dispute.", "In June 2009, Sumner formed a new band called Bad Lieutenant with Phil Cunningham (guitar) and Jake Evans (guitar and vocals). Their album Never Cry Another Tear was released on 5 October 2009. In addition to Cunningham and Evans the album also features appearances by Stephen Morris (drums), Jack Mitchell (drums), Tom Chapman (bass) and Alex James (bass). The live band included Morris on drums and Tom Chapman on bass.", "In 1990 Gillian Gilbert and Stephen Morris formed their own band, The Other Two. The Other Two released its first single \"Tasty Fish\" in 1991 and released two albums, The Other Two & You in 1993 and Super Highways in 1999. They have also been involved in scoring television soundtracks, like Making Out. In 2007, Gilbert and Morris remixed two tracks for the Nine Inch Nails remixes album Year Zero Remixed.", "Drummer Stephen Morris plays a mixture of acoustic and electronic drums, and in many cases plays along seamlessly with sequenced parts. All the band members could and did switch instruments throughout gigs, as evidenced on Jonathan Demme's video for \"The Perfect Kiss\" and the concert videos Taras Shevchenko (recorded in New York, November 1981) and Pumped Full of Drugs (Tokyo, May 1985). During such live gigs, Sumner alternated between guitar, keyboards, melodica and (on the track \"Confusion\") bass; Gilbert switched between keyboards and guitar, Morris between drums and keyboards, and Hook played both bass and electronic drums. Taras Shevchenko is also notable for the fact all four members of the group have left the stage before the final song, \"Temptation\", comes to a complete end.", "* Stephen Morris – drums, percussion, keyboards, programming (1980–1993, 1998–2007, 2011–present)", " bar:Stephen text:\"Stephen Morris\""]}, {"page": "October 28", "response": ["*  1957   – Stephen Morris, English drummer "]}, {"page": "Roland Octapad", "response": ["* Stephen Morris (New Order)"]}, {"page": "Siouxsie and the Banshees", "response": ["Joy Division's Peter Hook, who saw the group in concert in Manchester in 1977, said: \"Siouxsie and the Banshees were one of our big influences [...] The Banshees first LP was one of my favourite ever records, the way the guitarist and the drummer played was a really unusual way of playing and this album showcases a landmark performance\". Joy Division drummer Stephen Morris was influenced by the Banshees Mk1 from their 1977's John Peel session because their \"first drummer Kenny Morris played mostly toms\" and \"the sound of cymbals was forbidden\". He added, \"The Banshees had that [...] foreboding sound, sketching out the future from the dark of the past\". Joy Division producer Martin Hannett saw a difference between the Banshees' first main lineup and the other bands of 1977: \"Any harmonies you got were stark, to say the least, except for the odd exception, like Siouxsie. They were interesting\". The Cure's leader, Robert Smith, declared in 2003: \"Siouxsie and the Banshees and Wire were the two bands I really admired. They meant something.\" He also pinpointed what the 1979 Join Hands tour brought him musically. \"On stage that first night with the Banshees, I was blown away by how powerful I felt playing that kind of music. It was so different to what we were doing with the Cure. Before that, I'd wanted us to be like the Buzzcocks or Elvis Costello, the punk Beatles. Being a Banshee really changed my attitude to what I was doing\"."]}, {"page": "1957", "response": ["* October 28 – Stephen Morris, British drummer"]}, {"page": "Ian Curtis", "response": ["At a July 1976 Sex Pistols gig at Manchester's Lesser Free Trade Hall, Curtis encountered three childhood school friends named Bernard Sumner, Peter Hook and Terry Mason. The trio informed Curtis—whom they had seen at earlier punk gigs at The Electric Circus—of their intentions to form a band and Curtis informed them of his then-recent efforts to do likewise,Curtis, Deborah (1995). p. 36. before proposing himself as both their singer and lyricist. Initially, Mason became the band's drummer, but his rehearsal sessions were largely unproductive and he briefly became the band's manager.Curtis, Deborah (1995). p. 48. The group then unsuccessfully attempted to recruit several drummers before selecting Stephen Morris in August 1977.Suicide in the Entertainment Industry: An Encyclopedia of 840 Twentieth Century Cases  p. 73. The band was later managed by Rob Gretton, who—having already seen Joy Division perform live at local venues such as Rafters—offered to become their manager in 1978.Curtis, Deborah (1995). pp. 61-62.", "At the time of the recording of the band's second album, Curtis's condition was particularly severe, with him enduring a weekly average of two tonic-clonic seizures.researchgate.net On one occasion during these recordings, Curtis's bandmates became concerned when they noted he had been absent from the recording studio for two hours. The band's bassist, Peter Hook, discovered Curtis unconscious on the floor of the studio's toilets, having hit his head on a sink following a seizure. Despite instances such as this, Hook stated that, largely through ignorance of the condition, he, Sumner and Morris did not know how to help. Nonetheless, Hook was adamant that Curtis never wanted to upset or concern his bandmates, and would \"tell [us] what [we] wanted to hear\" if they expressed any concern as to his condition. In one incident, at a concert held before almost 3,000 people at the Rainbow in Finsbury Park in April 1980, the lighting technicians at the venue—contrary to instructions given to them by Rob Gretton prior to the gig—switched on strobe lights midway through Joy Division's performance, causing Curtis to almost immediately stagger backwards and collapse against Stephen Morris's drum kit in the throes of an evident seizure. He had to be carried offstage to the band's dressing room to recuperate.", "In a 2007 interview with The Guardian, Stephen Morris expressed regret that nobody had realised during Curtis's life the distress he was in, even though it was evident in his lyrics. Bassist Peter Hook reflected on the tragedy of the timing of Curtis's death, just before what might have been a breakthrough to fame. Hook also claimed that, prior to the release of the 2007 documentary Joy Division, a specialist in epilepsy had viewed the combination of drugs that Curtis had been prescribed for his condition and expressed concerns about the drugs' safety."]}, {"page": "Closer (Joy Division album)", "response": ["* Stephen Morris – drums (all except tracks 2 and 9), electronic drums (tracks 2, 4, 8, 9), percussion (all except track 2)"]}, {"page": "Orchestral Manoeuvres in the Dark", "response": ["The group's songs have been covered or sampled by acts including Gary Barlow, Howard Jones, MGMT, Owen Pallett, Boy George, Kid Cudi, Good Charlotte, Leftfield, Scooter, NOFX, Nada Surf, Angel Olsen and the Royal Philharmonic Orchestra. OMD are also the subject of two 2001 tribute albums, which feature interpretations by the likes of White Town, the Faint, Mahogany and Acid House Kings.Messages: Modern Synthpop Artists Cover OMD. AllMusic. Retrieved 17 August 2013.Raggett, Ned. Pretending to See the Future: A Tribute to OMD review. AllMusic. Retrieved 8 July 2013. David Guetta, who contributed a remix to 2003's The OMD Singles, described the opportunity to rework the band's material as \"a thrill for any electronic musician\". The official biography OMD: Pretending to See the Future (2018) features tributes from OMD collaborators Vince Clarke, Moby and Kraftwerk's Karl Bartos, along with peers like New Order's Stephen Morris, U2's Adam Clayton and the Teardrop Explodes' David Balfe.Houghton (2019), pp. 91–92 (Clayton)"]}, {"page": "List of drummers", "response": ["* Stephen Morris (Joy Division, New Order)"]}, {"page": "Power, Corruption & Lies", "response": ["* Stephen Morris – drums, synthesizers and programming"]}, {"page": "Trans-Europe Express (album)", "response": ["In the late 1970s, the album influenced post-punk band Joy Division; bassist Peter Hook related: \"We were introduced to Kraftwerk by [singer] Ian Curtis, who insisted we play Trans Europe Express before we went on stage every time. The tape was played at the venue over the PA system, to be heard by everyone. The first time was Pips [a Manchester club well known for its 'Bowie Room']. Ian got thrown out for kicking glass around the dance floor in time to the track. It took us ages of pleading to get him back in.\" Drummer Stephen Morris also confirmed that Joy Division \"used to play Trans-Europe Express before we went on stage, to get us into the zone. It worked because it gets up a lot of momentum. Trans-Europe Express just seemed to express an optimism even if people see it as machine music\". Morris also said: \"It reminds me of Cabaret, the film, with all of the 1920s singing. ... When you get that marriage between humans and machines, and you get it right, it's fantastic. I have to say it's my favourite Kraftwerk album.\" In the mid-1980s, Siouxsie and the Banshees' rendition of \"The Hall of Mirrors\", on their album Through the Looking Glass, was one of the few cover versions that Ralf Hütter hailed in glowing terms as \"extraordinary\"."]}, {"page": "Chris Cornell", "response": ["Theodore Decker of the Columbus Dispatch, the daily newspaper in Columbus, Ohio, where Cornell was due to play his next show, noted that Ian Curtis, the lead singer of the British post-punk band, Joy Division, whom Cornell had said in a 1994 Rolling Stone interview was popular with the members of Soundgarden, took his own life on May 18, 1980, exactly 37 years before Cornell, and by the same method as well. Curtis, known for lyrics that, as Cornell's sometimes had, explored despair and depression, had become legendary as a result after his death, Decker recalled. However, Stephen Morris, one of Curtis's bandmates (who later became New Order) recalled Curtis not as the \"brooding rock deity\" Decker said he became posthumously but as \"an ordinary bloke just like you or me.\" Decker recalled the other deaths of musicians who had risen from Seattle's grunge scene in the early 1990s and called on Cornell's fans to remember that he, too, was a human being who might still be alive if he had gotten the help he needed."]}, {"page": "Macclesfield", "response": ["Macclesfield was the home town of Ian Curtis and Stephen Morris of Joy Division, and Gillian Gilbert, who along with Stephen Morris was a member of New Order. A memorial to Curtis is located in Macclesfield Crematorium. Other Macclesfield acts to have gained recognition include The Macc Lads and Marion. Silk Brass Band, the Macclesfield-based brass band, won the National Championship of Great Britain Third Section Final in 2002. Having been promoted from the third section in 2002, they have since consistently competed in the Second, First and Championship sections of the UK's brass band grading system.https://brassbandresults.co.uk/bands/silk-brass-macclesfield/ The blues singer John Mayall was born here in 1933.  More recently, local band the Virginmarys has achieved national and international success. Chart-topping UK band The 1975 come from Macclesfield.", "* Stephen Morris (born 1957) drummer IMDb Database retrieved December 2017 in the bands Joy Division, New Order, The Other Two & Bad Lieutenant", "* The Other Two (active 1990–2011) an English dance act consisting of Stephen Morris and Gillian Gilbert of New Order "]}, {"page": "Peter Hook", "response": ["In 1979, Hook and Stephen Morris were questioned as suspects in the Yorkshire Ripper case. Joy Division's touring schedule coincided with Peter Sutcliffe's movements which led to police suspicion. Following gigs in Halifax, Huddersfield, Leeds and Manchester, Hook and Morris were questioned."]}, {"page": "Bernard Sumner", "response": ["Sumner and remaining band members Peter Hook and Stephen Morris started a new band named New Order, joined by keyboardist Gillian Gilbert in October 1980.Savage, Jon. \"Joy Division: Someone Take These Dreams Away.\" Mojo. July 1994. Though Hook, Morris and Gilbert also contributed vocals on some early tracks, Sumner emerged as the band's permanent singer and lyricist, alongside playing guitar and keyboards. Through a series of splits and reformations, the band has released ten studio albums.", "Bad Lieutenant included fellow New Order member Phil Cunningham and Jake Evans of Rambo & Leroy. Stephen Morris of New Order and Blur bassist Alex James also performed on the band's debut album. Sumner provided vocals, guitar and lyrics."]}, {"page": "Kevin Haskins", "response": ["The beginnings of the post-punk scene had a strong effect on Haskins. He cited as drummers who \"had an influence on me namely, Stephen Morris from Joy Division and Kenny Morris from Siouxsie and the Banshees. I liked how Stephen played sixteenth notes on the hi hat and he used this wonderful electronic drum called The Synare drum which I ran out and bought immediately! With Kenny I loved how he would use the tom tom drums rather than hi hats and cymbals.\""]}, {"page": "The Charlatans (English band)", "response": ["The Charlatans announced details of their twelfth studio album Modern Nature, to be released on 26 January 2015 on their new label BMG Rights Management. Featuring eleven new tracks (including the recent limited edition 7\" \"Talking in Tones\"), Modern Nature was produced by The Charlatans and Jim Spencer and mixed by Craig Silvey. The album features contributions from the band's temporary drummers Peter Salisbury (of The Verve), Stephen Morris (of New Order) and Gabriel Gurnsey (of Factory Floor), as well as producer Dave Tolan, backing singers Melanie Marshall and Sandra Marvin, strings by Sean O'Hagan and brass courtesy of Jim Paterson from Dexys Midnight Runners."]}, {"page": "24 Hour Party People", "response": ["* Tim Horrocks as Stephen Morris (Joy Division/New Order drummer)"]}, {"page": "Unknown Pleasures", "response": ["Joy Division formed in Salford in 1976 during the first wave of punk rock. Bernard Sumner and Peter Hook had separately attended a Sex Pistols show at the Manchester Lesser Free Trade Hall on 4 June 1976 and both embraced that band's simplicity, speed and aggression.Ott, 6 Forming a band with their friend Terry Mason on drums, Sumner on guitar and Hook on bass, they advertised for a singer. Ian Curtis, whom Sumner and Hook already knew, applied and, without having to audition, was taken on.Savage, Jon. \"Joy Division: Someone Take These Dreams Away\". Mojo. July 1994. After a number of changes of drummer, Stephen Morris joined the band—at that time called Warsaw—in August 1977. To avoid confusion with the London punk band Warsaw Pakt, they renamed themselves Joy Division in late 1977.Reynolds, 111", "*Stephen Morris – drums, percussion"]}, {"page": "Marquee Moon", "response": ["Writing for Rolling Stone, Rob Sheffield called Marquee Moon \"one of the all-time classic guitar albums\" whose tremulous guitar twang was an inspiration behind bands such as R.E.M. and Joy Division. Joy Division's Stephen Morris cited it as one of his favorite albums, while R.E.M.'s Michael Stipe said his love of Marquee Moon was \"second only to [Patti Smith's] Horses\".;  English guitarist Will Sergeant said it was also one of his favorite records, and that Verlaine and Lloyd's guitar playing was a major influence on his band Echo & the Bunnymen. Verlaine's jagged, expressive sound on the album made a great impression on Red Hot Chili Peppers guitarist John Frusciante when he started developing as a guitarist in his early 20s. In his words, it reminded him that \"none of those things that are happening in the physical dimension mean anything, whether it's what kind of guitar you play or how your amp's set up. It's just ideas, you know, emotion.\""]}, {"page": "The Other Two (duo)", "response": ["The Other Two was an English dance band consisting of Stephen Morris and Gillian Gilbert of New Order. The band name refers to the fact that the other New Order members, Bernard Sumner and Peter Hook, had already embarked on side projects by the time the first The Other Two record was released. Their debut single \"Tasty Fish\" was released in 1991 and peaked at 41 in the UK Singles Chart."]}, {"page": "Gillian Gilbert", "response": ["She then was in a punk band with three girls, The Inadequates, who rehearsed at premises next to Joy Division. In a 1987 interview with Option, Gilbert reflected on the first time she became familiar with Joy Division: \"We didn't have a car and us three needed a lift home. So we asked them, and they said, 'Alright, but you have to buy one of our singles.' So we did and got it home and played it on this horrible record player. We'd known Stephen before. We thought, 'My God, this sounds horrible.'\" She would later begin dating Stephen Morris."]}, {"page": "Blue Monday (New Order song)", "response": ["\"Blue Monday\" is a song performed by English rock band New Order. It was released as a 12-inch single on 7 March 1983 through Factory Records. It appeared on certain cassette and CD versions of the band's second studio album, Power, Corruption & Lies (1983). The track was written and produced by Gillian Gilbert, Peter Hook, Stephen Morris, and Bernard Sumner.", "New Order appeared on the BBC's Top of the Pops, on 31 March 1983, to promote the song. New Order insisted on performing \"Blue Monday\" live. The performance was dogged by technical problems, and was unrepresentative of the recording. In the words of drummer Stephen Morris, \"Blue Monday was never the easiest song to perform, anyway, and everything went wrong. The synthesisers went awry. It sounded awful\". In 1985, \"Blue Monday\" and \"Thieves Like Us\" were officially released in Poland as a 7\" single in a different sleeve by Tonpress under license from Factory Records and sold over 50,000 copies and reached number 5 on the year-end single chart.Andrzej Buda Historia rocka, popu i hip-hopu wedlu krytykow, Wydawnictwo Niezalezne: 33, 2006,  In 1988, \"Blue Monday\" was officially remixed by Quincy Jones and John Potoker under the title \"Blue Monday 1988\" (with the instrumental flip being titled \"Beach Buggy\"); Jones was the owner of Qwest Records, New Order's record label in the United States. The single reached number 3 on the British chart, number 4 on the Australian chart, and topped the dance chart in the United States. A further official remix/reissue in 1995, with a mix by Hardfloor as the lead track, also made the British Top 20. The song has sold 1.21 million copies in the UK as of October 2015. Overall it has sold over 3 million copies worldwide.", "* Stephen Morris – keyboards, programming", "Category:Songs written by Stephen Morris (musician)"]}, {"page": "Technique (album)", "response": ["Sumner also wrote all of the lyrics. When recording on the island of Ibiza, the band was heavily influenced by the environment around them and became fascinated by Balearic club music. Gillian Gilbert recalled, \"We had Mike (Johnson, engineer) with us, so there was always somebody doing something, but it was the beginning of us not being together in the studio when we were doing things. It was like, 'oh you do your drums today, and I'll do the vocals tonight...' The songs were sort of there but there were huge chunks missing. You'd leave blocks and say, 'will you fill that in? I'm off now.'\" The band had chosen to record in Ibiza at Hook's urging after a series of records made in \"dark and horrible\" London studios. Stephen Morris described the sound of the Balearic beat clubs on the island they began to visit as \"mad! They'd put an acid record on and then the next one would be a Queen one—it was schizophrenic, really. It'd be something really Spanish and then something really daft. It was a really odd mix but it all seemed to make sense when you were there. I don't know why that was. Maybe because we were all a bit out of our brains.\"", "* Stephen Morris – drums, synthesizers and programming"]}, {"page": "Low-Life", "response": ["The album's artwork is the only New Order release to feature photographs of the band members on its cover. The CD comes packaged with drummer and keyboardist Stephen Morris on the front cover, while inside the case are four photographs and a semi-transparent piece of paper with the band's name, allowing the owners to choose which band member is seen through the sleeve.", "John Bush of AllMusic wrote that Low-Life was \"in every way, the artistic equal\" of Power, Corruption & Lies, as well as \"the point where the band's fusion of rock and electronics became seamless.\" The A.V. Clubs Josh Modell similarly noted that the album \"completely locked the disco influences into sync with New Order's pop leanings.\" David Quantick, writing in Uncut, felt that Low-Life was \"the first New Order album that sounds like an album\", with Bernard Sumner's \"most human lyrics\" complementing Gillian Gilbert and Stephen Morris' \"pop axis\" and Peter Hook's \"breath-taking\" bass performances. In 2000, Q magazine placed Low-Life at number 97 in its list of the 100 Greatest British Albums Ever. Low-Life, alongside New Order's 1989 album Technique, was included in the book 1001 Albums You Must Hear Before You Die."]}, {"page": "Brotherhood (New Order album)", "response": ["Brotherhood saw the band further exploring their mix of post-punk and electronic styles, with the track listing being conceptually divided into \"disco and rock sides\". Stephen Morris stated that the album \"was kind of done in a schizophrenic mood that we were trying to do one side synthesizers and one side guitars\", which he retrospectively stated \"didn't quite work\"."]}, {"page": "Winston Tong", "response": ["Tong joined Tuxedomoon in 1977.  He sporadically recorded and performed live with the group, and also recorded solo material including the electropop dance album Theoretically Chinese in 1985, a 9-song album produced by Alan Rankine featuring guests such as Stephen Morris of New Order, Dave Formula, and Jah Wobble, as well as many other familiar musicians from Tong's past. The album and its subsequent singles, \"Theoretical China\" and \"Reports From The Heart\", were released on Les Disques du Crepuscule."]}, {"page": "Republic (album)", "response": ["* Stephen Morris – drums, synthesizers and programming", "* Gillian Gilbert, Peter Hook, Stephen Morris, Bernard Sumner and Stephen Hague – writer"]}, {"page": "Lust for Life (Iggy Pop album)", "response": ["According to Pop, Bowie's celebrated riff on \"Lust for Life\" was inspired by the Morse code opening to the American Forces Network news in Berlin. At various points in the song, the melody is doubled by the entire band; in Alomar's words, \"You can't play a counter-rhythm to that, you just had to follow.\" Joy Division drummer Stephen Morris declared, \"On Lust for Life the drums sound not huge but massive! The loudest cymbals known to man, that riff! I wanted to sound like that, still do.\""]}, {"page": "The Peter Saville Show Soundtrack", "response": ["Although The Peter Saville Show Soundtrack is credited to New Order, only New Order members Stephen Morris, Peter Hook and Phil Cunningham were involved in producing the music - Bernard Sumner was not present for the recording. This was a compact disc-only release, limited to 3000 copies. It was released by London Records with the catalogue number \"SAVILLE1.\""]}, {"page": "Sparks (band)", "response": ["Steve Jones of the Sex Pistols said that he constantly listened to Kimono My House back in 1974 at Paul Cook's room. \"We'd sit in his bedroom for hours listening to them\".  Joy Division cited \"Number One Song in Heaven\" as a primary influence during the recording of \"Love Will Tear Us Apart\". Joy Division's drummer Stephen Morris stated: \"When we were doing 'Love Will Tear Us Apart', there were two records we were into: Frank Sinatra's Greatest Hits and Number One Song in Heaven by Sparks. That was the beginning of getting interested in Giorgio Moroder\". Peter Hook of New Order cited Moroder's production on \"The Number One Song in Heaven\" as a major influence when his band changed musical style to produce electro/dance-rock songs like \"Temptation\" in 1982. New Order also delivered an extended live version of \"When I'm With You\" that same year in Milano.In his autobiography, Peter Hook relates a New Order concert in Milan in 1982 where they did a cover of the 1979 Sparks track, \"When I'm With You\". Hook also wrote that New Order's \"Temptation\" and \"Hurt\" were inspired in part by Giorgio Moroder's \"production on the wonderful Sparks track 'Number One Song in Heaven.  When they started playing music, singer Dave Gahan. Look In. Sacred DM. 5 December 1981. and composer Martin Gore. Look In. Sacred DM. 12 December 1981. of Depeche Mode cited them as one of their favorite bands. Gore also later covered \"Never Turn Your Back on Mother Earth\" on his Counterfeit e.p. in 1989. Other early electronic acts like the Human League,Easlea, Daryl (2009). \"In an interview recently, the Human League cited that record as the thing that got them excited and focused on what they were doing.\" and Erasure, also mentioned the group. Nick Rhodes of Duran Duran stated about \"This Town ain't...\": \"There was something about them that was very different. I was immediately fascinated with that song.\"Easlea, Daryl (2009)."]}, {"page": "True Faith (song)", "response": ["Category:Songs written by Stephen Morris (musician)"]}, {"page": "The Perfect Kiss", "response": ["\"The Kiss of Death\" is a typical New Order dub version: it is a mostly instrumental remix of the A-side with added effects; it notably features the opening of the album version. \"Perfect Pit\" is a short recording of synthesized bass and drum parts that sounds like Gillian Gilbert and Stephen Morris practicing.", "Jonathan Demme directed the song's video, which is unlike any other New Order clip; set in the band's practice room, it simply depicts the band playing the song from beginning to end, in the vein of Demme's 1984 Talking Heads concert film Stop Making Sense. According to Factory Records owner Tony Wilson, Demme was looking forward to filming dynamic shots of Stephen Morris behind the drum kit and was dismayed to find that the drums in the song were all programmed.", "Category:Songs written by Stephen Morris (musician)"]}, {"page": "Regret (New Order song)", "response": ["Category:Songs written by Stephen Morris (musician)"]}, {"page": "Procession (New Order song)", "response": ["Though all of New Order's songs are credited as group compositions, it is stated in Peter Hook's memoir Substance: Inside New Order that the chief composer of \"Procession\" is Stephen Morris.", "Category:Songs written by Stephen Morris (musician)"]}, {"page": "Ceremony (New Order song)", "response": ["Category:Songs written by Stephen Morris (musician)"]}, {"page": "Everything's Gone Green", "response": ["As usual per New Order and Joy Division's releases, the recording date and location of the music is not disclosed on the original sleeve. The single was originally released in Belgium on Factory Benelux and bears the catalogue number FBN8. The single was later released in New Zealand in 1982 and was made available in the UK through import copies. The artwork was designed by Peter Saville with computer graphics on the cover designed by Stephen Morris and Gillian Gilbert.", "Category:Songs written by Stephen Morris (musician)"]}]}}