{"wiki_id": "http://www.wikidata.org/entity/Q5393568", "itemLabel": "Ernest Milton", "itemDescription": "Footballer (1897-1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernest_Milton", "wikipedia_page": {"main": "Ernest Milton (7 August 1897 – 2 September 1984) was an English footballer who played as a left or right back for Sheffield United in The Football League. Born in Kimberworth near Rotherham he also had a spell for Kilnhurst Town as well as guesting for Birmingham, Rotherham County and Barnsley during World War I.", "link_mentions": [{"page": "Rotherham County F.C.", "response": ["* Ernest Milton"]}, {"page": "1925 FA Cup Final", "response": ["The match kicked-off at 3pm and started brightly, the first 20 minutes providing the best football of the day according to The Times. Cardiff's Hardy later noted how nervous he and his teammates were at the start of the match, describing the side as \"shaking like kittens\". United's forward pairing of Gillespie and Tunstall proved testing to the Cardiff defence early on and the majority of the opening period was spent in the Welsh side's half. Johnson nearly gave United the lead when he received David Mercer's cross unmarked in the opposition area but he was unable to immediately control the ball, which allowed Blair to close in and block his effort. Cardiff's best chance of the first half fell to Nicholson, who received the ball near the edge of the opposition penalty area. Despite having space to run into, Nicholson chose to shoot early but his effort went well over the bar. Nicholson caused issues for the United defence on the edge of their area that drew a foul from Ernest Milton on Willie Davies, but the resulting effort was wasted. Cardiff had few further opportunities in the first half; the Devon and Exeter Gazette described how Cardiff \"placed the ball too square, so that speed was lost\".", "|DF || Ernest Milton"]}, {"page": "Albert Milton", "response": ["After retiring from football Milton returned to Sunderland, where he obtained work with MacColl and Pollock's Engine Works, where he remained for 18 months before moving on to manage the Colliery Tavern, in Monkwearmouth. Alongside work Milton assisted local football teams, including Sunderland Rovers, as a coach. Albert was the brother of Ernest Milton and Alf Milton, both professional footballers. Another brother, Allan, was also a promising footballer who played for the family's local team Kimberworth Wesleyans."]}, {"page": "Len Birks", "response": ["He was sold to Sheffield United for 'a substantial sum' in October 1924 as the Blades sought a replacement for regular left back Ernest Milton. Birks initially failed to settle at Bramall Lane however and missed out on a place in the 1925 FA Cup Final with the ageing Milton being preferred. Never a fully established first team player, Birks did give good service to the Blades during his time playing over 200 games in all competitions."]}]}}