{"wiki_id": "http://www.wikidata.org/entity/Q5393426", "itemLabel": "Ernest L. Ransome", "itemDescription": "American engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernest_L._Ransome", "wikipedia_page": {"main": "Ernest Leslie Ransome (1852–1917) was an English-born engineer, architect, and early innovator in reinforced concrete building techniques.  Ransome devised the most sophisticated concrete structures in the United States at the time.\nErnest was the son of Frederick Ransome, who had patented a process for producing artificial stone in 1844.  Ernest was apprenticed to his father's factory in Ipswich.  By the 1870s Ernest had moved to the USA and was the superintendent of the Pacific Stone Company in San Francisco.  In 1884 after experimenting with reinforced concrete sidewalks, he patented (U.S. Patent 305,226) a system of ferro-concrete with the iron rods twisted to improve the bond, then developed a patented Ransome system for practical reinforced concrete construction.  In 1886 Ransome built two small underpass bridges in the Golden Gate Park in San Francisco which survive today, and which are the first reinforced concrete bridges in North America, and among the first three or four in the world.After a long string of accomplishments Ransome continued to meet with skepticism and resistance.  His techniques were vindicated when his 1897 Pacific Coast Borax Refinery in Bayonne, NJ in 1902 went through a massive building fire hot enough to melt brass; the concrete frame was only slightly damaged and thereby concrete framed industrial architecture was shown to have a key superiority over competing steel and iron framed structures.  \n\nThe Pacific Coast Borax fire was, it appears, the triumph and vindication of Ransome's professional life.  That Company's building at Bayonne, erected in 1897, had been his first work on the East Coast and is also reputedly the first complete reinforced concrete factory to be erected on that side of the country.  The fire and Ransome's great and growing reputation as an inventor and constructor combined to give a kind of charisma to reinforced concrete as the material of the new industrial age; and Ransome was only one of a number of forceful new engineering personalities who appeared upon the scene as exponents and exploiters of this miraculous seemingly material.  \nLikewise Ransome's two experimental buildings at Stanford survived the 1906 San Francisco earthquake essentially without damage while the university's newer, conventional brick structures literally crumbled around them.  The published analysis of these two buildings by fellow engineer John B. Leonard did much to advance the safety of buildings in post-1906 San Francisco and nationwide.  \nIn his later career Ransome focused on mixing equipment, formwork, and integrated building systems.  In 1912 Ransome and Alexis Saurbrey co-authored Reinforced Concrete Buildings.  Ransome's son was the notable American geologist Frederick Leslie Ransome (1868-1935).", "link_mentions": {}}}