{"wiki_id": "http://www.wikidata.org/entity/Q5396618", "itemLabel": "Es Devlin", "itemDescription": "stage designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Es_Devlin", "wikipedia_page": {"main": "Esmeralda \"Es\" Devlin  (; born 24 September 1971) is an English artist and stage designer who works in a range of media, often mapping light and projected film onto kinetic sculptural forms.", "link_mentions": [{"page": "Hamlet", "response": ["Benedict Cumberbatch played the role for a 12-week run in a production at the Barbican Theatre, opening on 25 August 2015. The play was produced by Sonia Friedman, and directed by Lyndsey Turner, with set design by Es Devlin. It was called the \"most in-demand theatre production of all time\" and sold out in seven hours after tickets went on sale 11 August 2014, more than a year before the play opened."]}, {"page": "Wire (band)", "response": ["With Gotobed back in the line-up (now using his birth name, Robert Grey), the group initially reworked much of their back catalogue for a performance at Royal Festival Hall in 2000. Wire's reception during a short tour in early May of the US, and a number of UK gigs, convinced the band to continue. Two EPs and an album, Send (2003), followed, as well as collaborations with stage designer Es Devlin and artists Jake and Dinos Chapman."]}, {"page": "Pet Shop Boys", "response": ["The second single to be taken from the album was the UK top twenty \"Minimal\". The duo filmed the video to the single in Paris with Dan Cameron. The single was the first of theirs to be playlisted by London's biggest radio station, Capital Radio, in a decade. Pet Shop Boys began a worldwide tour in support of Fundamental in June 2006 in Norway. The show was designed and directed by Es Devlin, the award-winning British theatre designer, and choreographed by Hakeem Onibudo. Between 15 June and 10 September 2006, Pet Shop Boys played a series of concert dates across Europe, mainly at assorted festivals and outdoor venues. These included two dates at the Tower of London on 28 June and 29, and a single show at Thetford Forest. These dates also included performances of Battleship Potemkin, in Germany and Spain. On 1 May 2006, Battleship Potemkin was also performed at the Swan Hunter shipyard, in Newcastle upon Tyne, with Pet Shop Boys accompanied by the Northern Sinfonia orchestra.", "When they first began touring, in 1989, they were heavily influenced by opera and theatre staging. Derek Jarman staged their first tour, making a series of films to be projected behind the costumed singers and dancers. In 1991, they brought in David Alden and David Fielding, from the English National Opera, to create the staging and costume design, for a show which made little attempt to involve or even acknowledge the audience and pushed the choreography and staging centre-stage. Subsequent tours have used artist Sam Taylor-Wood and architect Zaha Hadid for stage design. The Fundamentalism tour in 2006–2007 was conceived and designed by theatre designer Es Devlin, with choreography by Hakeem Onibudo. Es Devlin also conceived the 2009–2010 Pandemonium Tour as well as the Electric Tour beginning in 2013."]}, {"page": "Cirque du Soleil", "response": ["* Under the Same Sky: In October 2019, Cirque du Soleil announced the creation of the tent production Under the Same Sky with Es Devlin as director, writer, and set designer. Originally set to premiere in Montreal in April 2020, it has since been postponed to 2023 due to the COVID-19 pandemic."]}, {"page": "Scenic design", "response": ["Notable scenic designers, past and present, include: Adolphe Appia, Boris Aronson, Alexandre Benois, Alison Chitty, Antony McDonald, Barry Kay, Caspar Neher, Cyro Del Nero, Aleksandra Ekster, David Gallo, Edward Gordon Craig, Es Devlin, Ezio Frigerio, Christopher Gibbs, Franco Zeffirelli, George Tsypin, Howard Bay, Inigo Jones, Jean-Pierre Ponnelle, Jo Mielziner, John Lee Beatty, Josef Svoboda, Ken Adam, Léon Bakst, Luciano Damiani, Maria Björnson, Ming Cho Lee, Motley, Natalia Goncharova, Nathan Altman, Nicholas Georgiadis, Oliver Smith, Ralph Koltai, Emanuele Luzzati, Neil Patel, Robert Wilson, Russell Patterson, Brian Sidney Bembridge, Santo Loquasto, Sean Kenny, Todd Rosenthal, Robin Wagner, Tony Walton, and Roger Kirk."]}, {"page": "Evening Standard Theatre Awards", "response": ["* 2014 – Es Devlin for American Psycho"]}, {"page": "Critics' Circle Theatre Award", "response": ["| rowspan=\"2\" |Es Devlin"]}, {"page": "Complicité", "response": ["|2011 || The Master and Margarita || Simon McBurney || Based on the novel by Mikhail Bulgakov, text by Simon McBurney, the company and Edward Kemp || Set Design: Es Devlin, Lighting: Paul Anderson, Sound: Gareth Fry, Costume: Christina Cunningham, Video Design: Finn Ross, 3D Animation Luke Halls, Puppetry Blind Summit Theatre ||David Annen, Thomas Arnold, Josie Daxter, Johannes Flaschberger, Tamzin Griffin, Amanda Hadingue, Richard Katz, Sinéad Matthews, Clive Mendus, Yasuyo Mochizuki, Tim McMullan, Ajay Naidu, Henry Pettigrew, Paul Rhys, Cesar Sarachu, Angus Wright||"]}, {"page": "Machinal", "response": ["The 2014 Broadway production received four 2014 Tony Award nominations: Best Scenic Design of a Play (Es Devlin), Best Costume Design of a Play (Michael Krass), Best Lighting Design of a Play (Jane Cox) and Best Sound Design of a Play (Matt Tierney).Gans, Andrew. \"68th Annual Tony Awards Nominations Announced; 'Gentleman's Guide' Leads the Pack\"  playbill.com, April 29, 2014"]}, {"page": "Sally Potter", "response": ["In 2007 Potter directed Georges Bizet's Carmen for English National Opera at the London Coliseum, starring Alice Coote and designed by Es Devlin."]}, {"page": "Onedotzero", "response": ["In 2008, onedotzero held two events in the BFI IMAX. They commissioned British musician Nitin Sawhney to collaborate with stage designer Es Devlin and onedotzero industries for a one-off show. They also hosted a night featuring audiovisual acts The Light Surgeons, D-Fuse AV and Hexstatic. The festival also featured installations by artists including Jason Bruges, Troika, Doodlearth and Hexstatic."]}, {"page": "Die tote Stadt", "response": ["* 2010: Finnish National Opera, with Klaus Florian Vogt, Camilla Nylund, and Markus Eiche, conducted by Mikko Franck, staged by Kasper Holten, designed by Es Devlin (DVD: Opus Arte 2013); same production as performed at New National Theatre Tokyo (March 2014) with Torsten Kerl and Meagan Miller (TV: NHK Premium Theater: 12 May 2014)"]}, {"page": "1971 in the United Kingdom", "response": ["* 24 September – Es Devlin, set designer"]}, {"page": "London Design Festival", "response": ["Previous winners are Dame Vivienne Westwood, Tom Dixon, Daniel Charny, Ross Atkin, Neri Oxman, Hussein Chalayan, Grace Wales Bonner, Eva Jiricna, Es Devlin, Paul Priestman, Margaret Calvert, Julian Melchiorri, Sir David Adjaye, Kenneth Grange, Bethan Laura Wood, Daan Roosegaard, Edward Barber and Jay Osgerby, Marjan Van Aubel, Peter Brewin and Will Crawford, the Bourellec brothers, Nicolas Roope, Roland Lamb, Lord Richard Rogers, Daniel Rybakken, Dieter Rams, David Constantine, Alexandra Daisy Ginsberg, Jane Ni Dhulchaointigh, Rosario Hurtado and Roberto Feo, Vidal Sassoon, Sir Ken Adam, Peter Saville, Marc Newson, Sir Paul Smith, Dame Zaha Hadid, Thomas Heatherwick, Sir Terence Conran, and Ron Arad."]}, {"page": "Church of St John-at-Hackney", "response": ["In 2018, St John at Hackney partnered with nearby St Luke's Homerton Terrace to form Hackney Church, and was designated a City Centre Resource Church. In the same year, St John at Hackney embarked on a multimillion-pound Restoration project, working with John Pawson and Es Devlin, among others. In 2019, the church will also open new community facilities in the adjacent Hackney Gardens development to enable it to grow its outreach work and community activity. The church also partners with the nearby Hackney Church Brew Co., whose profits help to fund the church's work with the homeless and vulnerable.", "In 2018, St John at Hackney embarked on a multimillion-pound Restoration project, including a £1.84 million-pound grant from the National Lottery Heritage Fund. The design team includes internationally renowned designer John Pawson CBE, with other contributors including critically acclaimed visual artist Es Devlin OBE. In 2019, the church will also open new community facilities in the adjacent Hackney Gardens development to enable it to grow its outreach work and community activity."]}, {"page": "Fraser T. Smith", "response": ["In August 2021, Dave and Smith were nominated for the Ivors with Apple Music 2021 in the Best Contemporary Song category for \"Children of the Internet\" (Reference: Dave and Smith subsequently won. This was their third Ivor Novello win in four years. The pair were awarded best contemporary song for Children of the Internet. The song is performed by Future Utopia. This was producer Smith’s new project and features Dave and Es Devlin."]}, {"page": "Nick Grimshaw", "response": ["Interested in live music production, Grimshaw interned with the stage designer Es Devlin in 2017."]}, {"page": "Devlin (surname)", "response": ["* Es Devlin  (born 1971), English stage designer"]}, {"page": "Susannah Waters", "response": ["In 2005 and 2007, Waters worked with Sir Thomas Allen, leading a large-scale education project at the Sage Gateshead Music Centre on Mozart’s Così fan tutte (2005) and Don Giovanni (2007), and culminating in the creation and performance of youth versions of the two operas. In 2013, Waters directed a new main stage community opera for Glyndebourne Festival Opera, co-devised with the composer Orlando Gough, librettist Stephen Plaice, and designer Es Devlin. In November 2013, she directed Chabrier’s L’Etoile for New Sussex Opera, and in May 2014 she directed a new production of Harrison Birtwistle’s Down by the Greenwood Side for the Brighton Festival."]}, {"page": "Laurence Olivier Award for Best Set Design", "response": ["| Es Devlin", "| Es Devlin", "| Es Devlin", "|Es Devlin"]}, {"page": "Laurence Olivier Award for Best Costume Design", "response": ["| Es Devlin"]}, {"page": "Expo 2020", "response": ["|  |||| || Es Devlin Studio"]}, {"page": "UK Theatre Awards", "response": ["| 1999 || Edward Hall for Twelfth Night at The Watermill, West Berkshire Playhouse ||Es Devlin for the Bush Theatre's Howie The Rookie at the Bush Theatre || || || Northern Stage"]}, {"page": "Songs for Sorrow", "response": ["|Es Devlin||\"Toy Boy\"||28"]}, {"page": "VH1 Storytellers (Kanye West album)", "response": ["Direction and production design was done by Es Devlin, while lighting design was handled by Martin Phillips and John McGuire."]}, {"page": "List of people from the Royal Borough of Kingston upon Thames", "response": ["* Es Devlin, Stage designer (1971)"]}, {"page": "The Prisoner's Dilemma (play)", "response": ["Robert Bowman (as Roman) and was directed by Michael Attenborough, with design by Es Devlin"]}, {"page": "Motley Theatre Design Course", "response": ["* Es Devlin Olivier Award-winning set and costume designer, 2012 Summer Olympics closing ceremony, Rage, Mika Imaginarium World Tour & Live Parc des Princes Paris, Pet Shop Boys Pandemonium World Tour & Fundamental World Tour, Take That Circus Live UK Stadium Tour, Lady Gaga's Monster Ball US Arena Tour, Kanye West Glow in the Dark US Arena Tour & Touch The Sky US Arena Tour, Shakira The Sun Comes Out World Tour, Goldfrapp Head First Tour, Muse Resistance Tour, Liceu, De Nederlandse Opera, Royal Danish Opera, Greek National Opera, Finnish National Opera, Theater an der Wien,  Semperoper Dresden Oper Leipzig, Oper Frankfurt, Staatsoper Hamburg, Royal Opera House, English National Opera, Glyndebourne Festival Opera, Rambert Dance Company, Cullberg Ballet, Russell Maliphant"]}, {"page": "Imogen Heap discography", "response": ["|Es Devlin"]}, {"page": "Batman Live", "response": ["The production was mounted by acclaimed professionals, and was co-directed by James Powell,Batman Live – O2 Arena, 31 August 2011, dealj.wordpress.com who has worked on Les Miserables and Dirty Dancing.JAMES POWELL BROADWAY AND THEATRE CREDITS, www.broadwayworld.com The crew included Anthony Van Laast, widely known for his work on Mamma Mia!, as the creative director, and renowned car designer Prof.Gordon Murray, who crafted the Batmobile especially for the show,Batman takes on the world with £12m stage extravaganza, www.theguardian.comBatman Live Worldwide Arena Tour, www.warnerbros.com as well as composer James Seymour Brett, who created and arranged the music,Batman Live World Arena Tour, jamesseymourbrett.com Es Devlin as the production designer, Luke Halls and Sam Pattinson as the video designers and Patrick Woodroffe as the lighting designer.BATMAN LIVE – WORLD ARENA TOUR 2011, https://esdevlin.com The crew also included Jack Galloway as costume designer, Jake Berry as technical director and Simon Baker as sound designer. The circus sequences were created and managed by Bryan Donaldson and Juliette Hardy-Donaldson.\"Batman Live World Tour \", à Paris Bercy, du 21 au 25 décembre, musicalsineurope.com"]}, {"page": "2012 in art", "response": ["* August 12 – Damien Hirst's representation of the British Union Flag forms the arena centrepiece for the 2012 Summer Olympics closing ceremony in London. Es Devlin is designer for the ceremony and the creative director and choreographer is Kim Gavin"]}, {"page": "The Hunt (2012 film)", "response": ["* Es Devlin, Designer"]}, {"page": "2012 Summer Olympics closing ceremony", "response": ["The closing ceremony of the London 2012 Summer Olympics, also known as A Symphony of British Music, was held on 12 August 2012 in the Olympic Stadium, London. The chief guest was Prince Harry of Wales representing Queen Elizabeth II. The closing ceremony was created by Kim Gavin, Es Devlin, Stephen Daldry, David Arnold and Mark Fisher. The worldwide broadcast began at 21:00 BST (UTC+1) and finished on 13 August 2012 at 00:11, lasting three hours and eleven minutes.", "The creative director and choreographer was Kim Gavin, with Es Devlin responsible for design and David Arnold as musical director. When Arnold was announced in his role he said that doing the closing ceremony was an honour and a once-in-a-lifetime opportunity, while Gavin stated that he was really excited and honoured to be involved. Devlin said that she was delighted to be part of the \"greatest show on earth\". Hugh Robertson, Minister for Sport and the Olympics, stated that he was delighted to have a high-quality team working on the ceremony, while Boris Johnson stated that \"we have the best of British creating the spectacular bookends of our Games\". Stephen Daldry was the executive producer and Mark Fisher was in charge of production design. The ceremony cost £20 million, with the artists paid just £1 for contractual purposes. Around 4,100 performers took part, comprising 3,500 adult volunteers, 380 schoolchildren from the six original host boroughs, and 250 professionals. There had been around 15 rehearsals for the volunteers at the Three Mills Studio and at a full-scale site in Dagenham, East London.", "Gavin said that \"the show we are putting on is very shiny, it's very colourful. We don't want to bang on about our culture. We just want to have fun\".  Es Devlin added that it \"has to make sense in Bognor and Bogotá.\" She said that the creators had happily indulged in the chance to \"visually draw on everything\" that British imagination can offer. David Arnold said \"It's going to be beautiful, cheeky, cheesy, camp, silly and thrilling\", and added that \"we could have done this 15 times over, and not had the same show, and it would still have been full of amazing British music\". He thought that it should be the \"greatest after party\" and was \"really a celebration of Britishness in terms of [all] the arts\". Arnold himself had devoted two years working on the ceremony and had turned down all other work including Skyfall, but said that it was the \"most fun\" he had \"ever had in music\". In the handover section Rio aimed to express \"multicultural embrace.\" Daniela Thomas stated that Rio \"want to show you how sophisticated we mix things, what we do with the things you believe we are, how we mix with pop culture.\""]}]}}