{"wiki_id": "http://www.wikidata.org/entity/Q5394603", "itemLabel": "Ernie Lotinga", "itemDescription": "British actor and comedian (1876-1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernie_Lotinga", "wikipedia_page": {"main": "Ernest Lotinga (19 March 1875–28 October 1951) was a British comedian and film actor.  Lotinga became known for the Josser character whom he portrayed in a series of comedy films during the 1930s.", "link_mentions": [{"page": "Phonofilm", "response": ["# Acci-Dental Treatment (1929) directed by Thomas Bentley with Ernie Lotinga as Jimmy JosserSilentEra entry", "# Doing His Duty (1929) comedy short of Ernie Lotinga playing \"Jimmy Josser\", directed by Hugh Croise", "# Josser, KC (1929) comedy short with Ernie Lotinga playing \"Jimmy Josser\" (possible duplicate of Doing His Duty)", "# Nap (1928) with Ernie Lotinga as Josser, directed by Hugh Croise", "# The Orderly Room (July 1928) comedy short with Ernie Lotinga as Jimmy Josser, directed by Hugh Croise", "# The Raw Recruit (July 1928) comedy short with Ernie Lotinga as Jimmy Josser, directed by Hugh Croise", "# Spirits (1929) comedy short with Ernie Lotinga as Jimmy Josser"]}, {"page": "Hetty King", "response": ["In 1901, she married actor and writer Ernie Lotinga (1876–1951), who was born in Sunderland. He was a music hall comedian, singer and theatre proprietor, billed as Dan Roe from 1898, who appeared in films in the 1920s and 1930s, often as the comic character PC Jimmy Josser. They had one child and divorced in 1917, a decree nisi being granted on 16 March by Sir Samuel Evans on the grounds of King's misconduct with the vaudeville artist and actor Jack Norworth. The divorce was not contested.Cambrian Daily Leader 23 March 1917 Her second marriage, in 1918, was to Alexander Lamond.", "*Ernie Lotinga – Filmography "]}, {"page": "List of people from Sunderland", "response": ["* Ernie Lotinga (actor)"]}, {"page": "List of British films of 1935", "response": ["| Smith's Wives || Manning Haynes || Ernie Lotinga, Kay Walsh || Comedy ||"]}, {"page": "List of British films of 1934", "response": ["|Josser on the Farm||T. Hayes Hunter||Ernie Lotinga, Betty Astell||Comedy||"]}, {"page": "List of British films of 1932", "response": ["|Josser in the Army||Norman Lee||Ernie Lotinga, Hal Gordon||Comedy||", "|Josser Joins the Navy||Norman Lee||Ernie Lotinga, Cyril McLaglen||Comedy||", "|Josser on the River||Norman Lee||Ernie Lotinga, Molly Lamont||Comedy||"]}, {"page": "List of British films of 1931", "response": ["|Doctor Josser K.C.||Norman Lee ||Ernie Lotinga, Molly Lamont, Binnie Barnes||Comedy||", "|P.C. Josser||Milton Rosmer||Ernie Lotinga, Robert Douglas||Comedy||"]}, {"page": "List of British films of 1936", "response": ["|Love Up the Pole||Clifford Gulliver||Ernie Lotinga, Vivienne Chatterton, Wallace Lupino||Comedy||"]}, {"page": "Ernest Lotinga", "response": ["#REDIRECT Ernie Lotinga"]}, {"page": "Josser on the Farm", "response": ["Josser on the Farm  is a 1934 British comedy film directed by T. Hayes Hunter and starring Ernie Lotinga, Betty Astell and Garry Marsh.BFI.org It was part of the series of Josser films featuring Lotinga.", "* Ernie Lotinga - Jimmy Josser"]}, {"page": "Smith's Wives", "response": ["Smith's Wives is a 1935 British comedy film directed by H. Manning Haynes and starring Ernie Lotinga, Beryl de Querton and Tyrell Davis. A farcical situation occurs when a vicar and a bookmaker with the same surname are mistaken for each other. It was based on the play Facing the Music by James Darnley. It was Lotinga's only film in which he didn't play his trademark character Jimmy Josser.Sutton p.109-112", "* Ernie Lotinga as Jimmy Smith"]}, {"page": "Josser on the River", "response": ["Josser on the River is a 1932 British comedy film directed by Norman Lee and starring Ernie Lotinga, Molly Lamont and Charles Hickman.BFI.org", "* Ernie Lotinga - Jimmy Josser"]}, {"page": "List of Elstree Studios productions", "response": ["| Doctor Josser K.C. ||  Norman Lee || Ernie Lotinga, Jack Hobbs, Molly Lamont", "| Josser in the Army || War comedy || rowspan=\"3\" | Norman Lee || Ernie Lotinga, Betty Norton, Jack Hobbs", "| Josser Joins the Navy || rowspan=\"2\" | Comedy || Ernie Lotinga, Cyril McLaglen, Jack Hobbs", "| Josser on the River || Ernie Lotinga, Molly Lamont, Charles Hickman"]}, {"page": "Love Up the Pole", "response": ["Love Up the Pole is a 1936 British comedy film directed by Clifford Gulliver and starring Ernie Lotinga, Vivienne Chatterton and Wallace Lupino. It was made at the Cricklewood Studios in London, and distributed by Butcher's Film Service which specialised in low-budget British films.Wood p.91", "* Ernie Lotinga as Jimmy Josser  "]}, {"page": "Josser in the Army", "response": ["Josser in the Army is a 1932 British war comedy film directed by Norman Lee and starring Ernie Lotinga, Betty Norton, Jack Hobbs. It was part of the Josser series of films featuring Lotinga. It was made at Elstree Studios by British International Pictures.Wood p.75", "* Ernie Lotinga as Jimmy Josser  "]}, {"page": "Josser Joins the Navy", "response": ["Josser Joins the Navy is a 1932 British comedy film directed by Norman Lee and starring Ernie Lotinga, Cyril McLaglen and Jack Hobbs. It was made at Elstree Studios by British International Pictures.Wood p.72 It was part of a series of films featuring Lotinga in his Josser character.", "* Ernie Lotinga as Jimmy Josser  "]}, {"page": "Doctor Josser K.C.", "response": ["Doctor Josser K.C. is a 1931 British comedy film directed by Norman Lee and starring Ernie Lotinga, Jack Hobbs and Molly Lamont. Made at Elstree StudiosWood p.71 it was part of the Josser series of comedies featuring Lotinga. It is sometimes confused with another production P.C. Josser although they are separate films made at different studios by different directors.", "* Ernie Lotinga as  Jimmy Josser"]}, {"page": "P.C. Josser", "response": ["P.C. Josser is a 1931 British comedy film directed by Milton Rosmer and starring Ernie Lotinga, Robert Douglas and Garry Marsh. It was made by Gainsborough Pictures at the Islington Studios in London.Wood p.69 It is sometimes confused with another film Doctor Josser K.C. which was released the same year.", "* Ernie Lotinga as Jimmy Josser  "]}, {"page": "Josser", "response": ["* Jimmy Josser, a character played by Ernie Lotinga in a series of British comedy films and shorts (1928–1934?) and on the stage"]}, {"page": "Mary Naylor", "response": ["Florence Mary Naylor was born in Carlton, Nottingham, England to Cyril Naylor and Hannah Naylor (née Robinson), both of Nottingham. Mary started singing on an orange crate to attract customers while her parents sold fruit and vegetables in the open markets across the Midlands. She attended Standhill Infant School for five years, then graduated from Porchester Senior School, with a great portion of her education on the road while on tour. Mary started piano lessons on her 7th birthday, and accordion on her 9th. By age 11, Mary was awarded the gold medal Senior Grade Piano Examination,Note: The medal is in the personal collection of Mary Naylor. meaning that if she chose, she could be licensed to be a piano teacher herself. Between the ages of ten and twelve, Mary, her younger sister and brother, Margaret and Ernest, starred in Nottingham's Madame Haine's Accordion Band,.\" Mary also became a popular solo act between movies at Nottingham's movie theaters and in dance halls with Ernie Lotinga and his orchestra, and at Nig-Nog Concert fundraising events.", "At the age of twelve, Mary was \"discovered\" by show runner and comedian, Ernie Lotinga, and he brought her to London for a three week run at the Hackney Empire in the show, \"King of Polonia\" in August/September of 1938."]}]}}