{"wiki_id": "http://www.wikidata.org/entity/Q5405273", "itemLabel": "Euan MacKie", "itemDescription": "archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Euan_MacKie", "wikipedia_page": {"main": "Euan Wallace MacKie (10 February 1936 - 2 November 2020) was a British archaeologist and anthropologist. He was a prominent figure in the field of Archaeoastronomy.", "link_mentions": [{"page": "Xunantunich", "response": ["In 1959–60, the Cambridge Expedition to British Honduras arrived in the colony, and its archaeologist member, Euan MacKie, carried out several months of excavation at Xunantunich.   He excavated the upper building on Structure A-11 in Group B and a newly discovered residential structure, A-15, just outside the main complex.  Using the European method of detailed recording of the stratigraphy of the superficial deposits (the masonry structures themselves were not extensively cut into) he was able to infer that both buildings had been shattered by a sudden disaster which marked the end of the Classic period occupation.   An earthquake was tentatively proposed as the cause; it is inferred purely on the basis of the excavated evidence, and also on the very damaged state of the top building of Structure A-6 ('El Castillo'). He was also able to confirm the later part of the pottery sequence constructed by Thompson.  The detailed report by MacKie is  \"Excavations at Xunantunich and Pomona, Belize, in 1959–60\".   British Archaeological Reports (Int.  series),  251,  1985:  Oxford.", "There is evidence of Xunantunich being settled as early as the ceramic phase of the Preclassic period. The findings have been insubstantial to prove that Xunantunich was a site of importance. It was not until the Samal phase in AD 600–670 that Xunantunich began to grow significantly in size. Architectural constructions boomed in Hats’ Chaak phase (AD 670–750) when Xunantunich's connection with the polity Naranjo solidified. Left in a state of abandonment at approximately AD 750 due to an unknown violent event (see Euan MacKie's work in 1959–60, above, which may be relevant here), Xunantunich did not re-establish itself as a strong presence in the region until Tsak’ phase in AD 780–890."]}, {"page": "Nebra sky disc", "response": ["Euan MacKie suggests that the Nebra disc may be linked to the solar calendar reconstructed by Alexander Thom from his analysis of standing stone alignments in Britain."]}, {"page": "Christian Maclagan", "response": ["* What Mean These Stones? D. Douglas, 1894 (described as a \"slight and idiosyncratic work\" by Euan MacKie)."]}, {"page": "Euan Mackie", "response": ["#REDIRECT Euan MacKie "]}, {"page": "1936 in Scotland", "response": ["** Euan MacKie, archaeologist and anthropologist"]}, {"page": "List of people educated at Whitgift School", "response": ["*Euan MacKie, archaeologist and anthropologistBenny Josef Peiser; Trevor Palmer; M. E. Bailey (1998). Natural catastrophes during Bronze Age civilisations: archaeological, geological, astronomical and cultural perspectives. Archaeopress. "]}, {"page": "Deaths in November 2020", "response": ["*Euan MacKie, 84, British archaeologist and anthropologist.Euan Wallace Mac Kie"]}]}}