{"wiki_id": "http://www.wikidata.org/entity/Q5415055", "itemLabel": "Eva Gray", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Eva_Gray", "wikipedia_page": {"main": "Eva Gray is a stage and screen actress. Eva is known for her performance as Marilyn Monroe and also as Trudy Lite – International Celebrity Life Coach to the Stars, hosting the satirical television comedy series 'The Trudy Lite Show' and 'The Trudy Lite Chat Show'. Eva moved from London to Teignmouth in Devon in 2014 to enable her to care for her older brother, who suffers from Paranoid Schizophrenia. She has a home studio with voiceover and green screen equipment to enable her to continue her acting and voice over career from her home.", "link_mentions": [{"page": "Robert Calvert", "response": ["*Mirror Mirror (1978, premiered at Pentameters Theatre with Eva Gray in the role of Eleanor Bryant, reprised in 2013 and in April 2019)"]}, {"page": "Royal Academy of Dramatic Art", "response": ["* Eva Gray – (The Trudy Lite Show, The Trudy Lite Chat Show, Marilyn Monroe, Sooty Heights)"]}, {"page": "John Symonds", "response": ["Symonds wrote twenty-six plays but not many were performed. He won critical praise in 1961 for his ITV play, I, Having Dreamt, Awake, about a prodigal son and con-man who returns home from America, after manufacturing a fortune, to impress his poor relations in London. The Poison Maker, his final work for the stage was performed at the Old Red Lion Theatre in 2006, adapted and directed by the actress Vicki Carpenter who played Florence, with Eva Gray as Pansy."]}, {"page": "Eva (name)", "response": ["* Eva Gray (born 1971), British actress"]}, {"page": "Gray (surname)", "response": ["*Eva Gray, British actress"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Eva Gray (BA Acting)"]}, {"page": "Sooty Heights", "response": ["* Eva Gray – Portrayed Portia du Pont, who was created to be a glamorous and beautiful presenter of a fictional TV show called \"Vets and Pets\", which Sooty and his friends are fans of.", "# \"Vets and Pets\" (2 October 2000)Guest Starring: Eva Gray"]}, {"page": "List of British actors", "response": ["* Eva Gray (born 1970)"]}, {"page": "David Schaal", "response": ["In 2012, Schaal wrote and directed the play Brotherly Love for The Real London Ensemble starring Eva Gray. He then appeared in British soap Hollyoaks in September 2013, playing the role of Ken, who is falsely accused of sexually interfering with Robbie Roscoe (Charlie Wernham). In March 2021, he appeared in an episode of the BBC soap opera Doctors as Colin Turner. and Later in the year, appeared as a Police officer DS Foden in EastEnders"]}, {"page": "The Last Salute", "response": ["Actors who appeared in individual episodes include Christopher Villiers, Hilary Mason, John Junkin, Eva Gray, Lill Roughley, Paul Brooke, Christopher Benjamin, Frances White, and Geoffrey Beevers."]}]}}