{"wiki_id": "http://www.wikidata.org/entity/Q5418931", "itemLabel": "Ewart Grogan", "itemDescription": "British explorer and politician (1874-1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ewart_Grogan", "wikipedia_page": {"main": "Ewart Scott Grogan (1874–1967) was an English explorer, politician, and entrepreneur.  He was the first person in recorded history to walk the length of Africa, from Cape Town to Cairo.", "link_mentions": [{"page": "List of Old Wykehamists", "response": ["*  Ewart Grogan, explorer and colonist"]}, {"page": "Grogan", "response": ["* Ewart Grogan (1874–1967), British explorer of Africa, prominent Kenyan businessman"]}, {"page": "Ewart", "response": ["* Ewart Grogan (1874–1967), British explorer, politician, and entrepreneur"]}, {"page": "Richard Mohun", "response": ["A ship named Sir Harry Johnson took them from Zanzibar to the African mainland in the German colony of Tanganyika..  The expedition then proceeded to the settlement of Fort Johnston at the southern tip of Lake Nyasa where they replenished their food stocks with fish from the Shire River..  Mohun's party then proceeded along the western bank of the lake to the settlement of Karonga in North-Eastern Rhodesia.  The expedition probably used the Stevenson Road which connected Karonga to Zombe at the southern tip of Lake Tanganyika.  At Longwe the group encountered Ewart Grogan, the British explorer then in the process of completing the first crossing of Africa from south to north. Captain Verhellen drew Grogan's attention to a group of pale Southern Reedbucks.  Grogan shot one and sent its pelt to the Zoological Society of London where it was regarded as potentially the first sighting of a new form of the species.."]}, {"page": "Ewart Scott Grogan", "response": ["#REDIRECT Ewart Grogan"]}, {"page": "Ewart S. Grogan", "response": ["#REDIRECT Ewart Grogan"]}, {"page": "Ol Donyo Sabuk", "response": ["The early notorieties of the ranch captured the imagination of many people during the First World War, when the castle served as a military hospital for British officers. The wild parties held in the castle, where the notorious colonial maverick Colonel Ewart Grogan reputedly led the wine-tossing and supervised wife-sharing orgies, only spiced the sideshows that attracted international media. Hence the castle was baptised \"Kilavu\" by the locals, meaning Club house in Kamba."]}, {"page": "Julian Smith (author)", "response": ["In December 2010, Harper Perennial published his book Crossing the Heart of Africa: An Odyssey of Love and Adventure, an account of retracing the 1898-1900 route of British explorer Ewart Grogan across Africa. In 2007, Smith traveled from South Africa to Sudan, crossing eight countries in two months by bus, bicycle and ferry. Grogan's journey was itself the first transect of the continent from south to north, done in part to convince his beloved's stepfather that he was worth marrying.", "* \"Julian Smith travels from South Africa to Sudan on the trail of British explorer Ewart Grogan,\" The Oregonian 12/3/10"]}, {"page": "1920 East Africa Protectorate general election", "response": ["|Ewart Grogan|| || ||"]}, {"page": "1938 Kenyan general election", "response": ["|Ewart Grogan|| || ||"]}, {"page": "1952 Kenyan general election", "response": ["|rowspan=2|Nairobi West(3 June)||Ewart Grogan||align=right|770||align=right|71.6||Elected"]}, {"page": "Thomas Lowry (racehorse breeder)", "response": ["Educated at Christ's College, Christchurch and at Jesus College, Cambridge University, Lowry inherited the family property, Okawa, of 20,000 acres,Bill Francis, Tom Lowry: Leader in a Thousand, Trio, Wellington, 2010, p. 25. in the Hawke's Bay region of the North Island when his father died in 1880.Francis, p. 23. He married Helen (\"Marsie\") Watt, daughter of the New Zealand shipping magnate James Watt, in 1897.Francis, p. 23. One of Marsie's sisters married Robert Baden-Powell's brother Francis; another married the British explorer Ewart Grogan.Francis, p. 24."]}, {"page": "Stanbic Holdings Plc", "response": ["Stanbic Bank Kenya Limited (SBK) was established in 1958 when Ottoman Bank incorporated its first subsidiary in the region. This was after acquiring Torr's Hotel from Ewart Grogan and converting it to its head office. In 1969, Ottoman Bank sold its Kenyan operations to National and Grindlays Bank (NGB Kenya) making its exit from the East African market.History of the Bank , from the Ottoman Bank's Archives and Research Centre . Retrieved 2 February 2008."]}, {"page": "1944 Kenyan general election", "response": ["|Ewart Grogan||align=right|89||align=right|38.0||Defeated"]}, {"page": "List of big-game hunters", "response": ["Quentin Oliver Grogan (1883–1962) was an English born big game hunter in East Africa, and the younger brother of Ewart Grogan. Arriving in Kenya 1905 to assist with his brother’s businesses, Grogan instead took to hunting elephant. Hunting widely on Kenya, Uganda and the Belgian Congo, Grogan was one of four hunters to receive a license to hunt in the Lado Enclave, although he remained there to poach elephant once his license expired. In 1909 Grogan guided Theodore Roosevelt’s safari when it came to the Lado Enclave to hunt for white rhinoceros. Grogan eventually settled on a farm at Turi in the White Highlands in 1915 and remained there until 1933 when he sold up and moved to South Africa. Grogan shot between 250 and 300 elephant in his life, he tried various rifles on elephant including a .256 Mannlicher, a .280 Ross and a .450 Nitro Express, finally settling on a .318 Westley Richards bolt actioned rifle and a .577 Nitro Express double rifle by Westley Richards."]}, {"page": "Too Early for Birds", "response": ["In the next show, the stories of Wangari Maathai, Mohammed Hassan Timothy Njoya, Ewart Grogan and William Northrup McMillan were stitched together by the story of the Lumboka-Chetambe War."]}, {"page": "List of Kenyan European people", "response": ["*Ewart Grogan – politician"]}, {"page": "William Bowker", "response": ["In 1907, together with Ewart Grogan and others, he was involved in an altercation with three Kikuyu men in Nairobi. The incident achieved notoriety at the time due to the heavy handedness of Bowker and his accomplices. Despite his protestations of innocence, the government was keen to set an example and arrested him for illegal assembly, later sentencing him to fourteen days imprisonment and a fine of 250 rupees."]}]}}