{"wiki_id": "http://www.wikidata.org/entity/Q5416272", "itemLabel": "Evelyn, Princess Blücher", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Evelyn,_Princess_Bl%C3%BCcher", "wikipedia_page": {"main": "Evelyn Fürstin Blücher von Wahlstatt (10 September 1876 – 20 January 1960), diarist and memoirist, wrote a standard account of life as a civilian aristocrat in Germany during World War I.", "link_mentions": [{"page": "Gebhard Leberecht von Blücher", "response": ["The marshal's grandson, Count Gebhard Bernhard von Blücher (1799–1875), was created Prince Blücher of Wahlstatt (Serene Highness) in Prussia, a hereditary title in primogeniture, the other members of his branch bearing the title count or countess. In 1832, he bought Raduň Castle in the Opava District and in 1847 the lands at Wahlstatt, Legnickie Pole, all of which remained in the family until the flight and expulsion of Germans from Poland and Czechoslovakia in 1945, which forced the family into exile in their mansion Havilland Hall in Guernsey, acquired by the 4th prince and his English wife, Evelyn, Princess Blücher. Later the family moved to Eurasburg, Bavaria. The present head of the House of Blücher von Wahlstatt is Nicolaus, 8th Prince Blücher of Wahlstatt (born 1932), the heir apparent is his son, hereditary count Lukas (born 1956).  "]}, {"page": "Lions led by donkeys", "response": ["Evelyn, Princess Blücher, an Englishwoman who lived in Berlin during the First World War, in her memoir published in 1921, recalled hearing German general Erich Ludendorff praise the British for their bravery and remembered hearing firsthand the following statement from the German General Headquarters (Grosses Hauptquartier): \"The English Generals are wanting in strategy. We should have no chance if they possessed as much science as their officers and men had of courage and bravery. They are lions led by donkeys.\""]}, {"page": "Evelyn Princess Blucher", "response": ["#REDIRECT Evelyn, Princess Blücher"]}, {"page": "Kenneth Dewar", "response": ["In 1914, Dewar was appointed commander (second-in-command) of the battleship Prince of Wales, then flagship of the 5th Battle Squadron in the 2nd Fleet (Home Fleets).  On 28 July, Dewar married Gertrude Margaret Stapleton-Bretherton, the sister of Evelyn, Princess Blücher, in a service at St. Bartholomew's Church in Rainhill on Merseyside.  The service was conducted by the Archbishop of Liverpool and the Bishop of Portsmouth.  Dewar's best man was the Honourable Reginald Plunkett, who later became known as Reginald Plunkett-Ernle-Erle-Drax, and would go on to achieve high rank in the Navy. Dewar and Gertrude had one son together, Kenneth Malcolm J. Dewar."]}, {"page": "Evelyn Princess Bluecher", "response": ["#REDIRECT Evelyn, Princess Blücher "]}, {"page": "Evelyn Princess Blücher", "response": ["#REDIRECT Evelyn, Princess Blücher"]}, {"page": "Bartholomew Bretherton (jockey)", "response": ["* Evelyn, Princess Blücher"]}, {"page": "Evelyn, Princess Blucher", "response": ["#REDIRECT Evelyn, Princess Blücher"]}, {"page": "Blücher (surname)", "response": ["*Gebhard von Blücher (1865–1931), husband of Evelyn, Princess Blücher"]}, {"page": "St Bartholomew's Church, Rainhill", "response": ["Surrounding the church is a cemetery. Buried there are the members of the Stapleton-Bretherton family who owned the surrounding land and Rainhill Hall. They include Evelyn, Princess Blücher (1876-1960) and her husband Prince Gebhard Blücher von Wahlstatt (1865-1931), a descendant of General-Field-Marshal Gebhard Leberecht von Blücher (1742–1819) who commanded the Prussian Army at the Battle of Waterloo in 1815.Dyckhoff SJ, Christopher (1994). A Quiet Place: A History of Loyola Hall St. Helens, p.7"]}, {"page": "Bartholomew Bretherton", "response": ["* Evelyn, Princess Blücher"]}, {"page": "Mary Stapleton-Bretherton", "response": ["* Evelyn, Princess Blücher"]}]}}