{"wiki_id": "http://www.wikidata.org/entity/Q5418910", "itemLabel": "Ewan Hooper", "itemDescription": "Scottish actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Ewan_Hooper", "wikipedia_page": {"main": "Ewan Hooper (born 23 October 1935 in Dundee) is a Scottish actor who is a graduate from, and now an Associate Member of, RADA. Hooper was the motivating force in the foundation of the Greenwich Theatre, which opened in 1969. Hooper was the founder director of the Scottish Theatre Company formed in Glasgow in the 1980s. He is best remembered as the priest in Dracula Has Risen from the Grave, along with a recurring role as Camp Controller Alec Foster in Jimmy Perry and David Croft's Hi-de-Hi!.", "link_mentions": [{"page": "James Maxwell (actor)", "response": ["* She Stoops to Conquer by Oliver Goldsmith with Una Stubbs, Ewan Hooper, Andy Serkis and Lorraine Ashbourne (1990)"]}, {"page": "Hi-de-Hi!", "response": ["*Alec Foster (Ewan Hooper) (Series 8, Series 9) Camp Controller – Foster was appointed by Joe Maplin to take charge of the camp midway through the 1960 season. Foster had served as a Sergeant in the RAF during the war, and made himself very unpopular with the entertainments staff. Foster invited Peggy to grant him sexual favours, in return for which he would make her a Yellowcoat. When Gladys confronted Foster about this, he propositioned her in the same way, causing Spike to come to her rescue. When Spike challenged him, Foster punched him in the face, giving him a black eye. During his time at the camp, Foster was cruel and rude to every member of the staff, and sacked Peggy and Clive. He was recalled to head office and his decisions were reversed by Joe Maplin, after Sammy Morris called in a favour which Maplin owed him. He returned later in the season to inspect the staff, and sacked Ted after he asked for a pay rise. Foster then hired Jimmy Jasper as the new camp host, but was forced to reinstate Ted because Jasper's act was a disaster with the campers. Foster returned once again in the final episode to break the news to the staff that their services would not be required the following season, and presented them with a copy of Joe Maplin's autobiography, titled How I Done It."]}, {"page": "Theatre 625", "response": ["|Mary Miller,Gwen Nelson,Ewan Hooper,Doreen Aris,Billy Russell,Brian Cant,Leslie Anderson,Jonathan Holt,Maryann Turner"]}, {"page": "Personal Services", "response": ["* Ewan Hooper as Edward"]}, {"page": "Royal Exchange, Manchester", "response": ["* Hindle Wakes by Stanley Houghton. Directed by Helena Kaut-Howson (MEN Award) with Ewan Hooper and Sue Johnston. See IRA bombing above. (1996) and (1998)", "* Much Ado About Nothing. Directed by Helena Kaut-Howson (MEN Award) with Josie Lawrence (MEN Award), Michael Muller and Ewan Hooper (MEN Award) (1997)"]}, {"page": "How I Won the War", "response": ["* Ewan Hooper as Dooley"]}, {"page": "Dracula Has Risen from the Grave", "response": ["Dracula Has Risen from the Grave also stars Veronica Carlson, Barry Andrews, Barbara Ewing, Ewan Hooper, and Michael Ripper. It was followed by Taste the Blood of Dracula in 1970.", "In 1905, in an East European village, a young altar boy (Norman Bacon) discovers the corpse of a young woman crammed inside a church bell, another victim of Count Dracula. One year later, following the events of the previous film, Dracula has been destroyed. Monsignor Ernst Mueller (Rupert Davies) comes to the village on a routine visit only to find the altar boy is now a frightened mute and the priest (Ewan Hooper) has lost his faith. The villagers refuse to attend Mass at the church because the shadow of Dracula's castle touches it. To bring to an end the villagers' fears, Mueller climbs to the castle to exorcise it.", "* Ewan Hooper as Priest"]}, {"page": "Morley College", "response": ["*Ewan Hooper"]}, {"page": "Greenwich Theatre", "response": ["Greenwich Council bought the site for demolition in 1962, but agreed to support the idea of a new theatre if there was enough local enthusiasm to justify it. Ewan Hooper, a local actor and director, accepted the challenge of rallying support. A new building was designed by architect Brian Meeking within the old shell and it eventually reopened as the Greenwich Theatre in 1969.", "On 21 October 1969 the theatre re-opened with Martin Luther King, a new piece of musical theatre written by Ewan Hooper, Artistic Director. Alan Vaughan Williams directed."]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Ewan Hooper (Acting Diploma 1957)"]}, {"page": "Black Hearts in Battersea", "response": ["*DR FIELD ..... Ewan Hooper"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Ewan Hooper"]}, {"page": "Masaaki Tsukada", "response": ["| Kinky Boots || George || Ewan Hooper ||"]}, {"page": "Hindle Wakes (play)", "response": ["It was the play in performance at the Royal Exchange Theatre during the 1996 Manchester bombing and the play with which the theatre reopened in December 1998 after almost two-and-a-half years of repair works following the bomb damage. Both productions were directed by Helena Kaut-Howson with Ewan Hooper as Mr Jeffcote, Sue Johnston as Mrs Jeffcote, Colin Prockter as Mr Hawthorn, Nicholas Gleaves as Alan Jeffcote and Sophie Stanton as Fanny Hawthorn. The production won a MEN Award."]}, {"page": "List of Scottish actors", "response": ["*Ewan Hooper (born 1935)"]}, {"page": "Toast (play)", "response": ["*Ewan Hooper - Walter Nelson (Nellie)"]}, {"page": "Brian Finch", "response": ["In 1972 Finch wrote An Arrow for Little Audrey a Thirty-Minute Theatre production starring Geoffrey Hughes. He wrote 13 episodes of the TV series The Tomorrow People in 1973. He wrote for the Hunter's Walk series from 1973 to 1974  a police series set in Rushden Northamptonshire starring Ruth Madoc and Ewan Hooper."]}, {"page": "What the Butler Saw (The Avengers)", "response": ["*Ewan Hooper as Sergeant Moran"]}, {"page": "Scottish Theatre Company", "response": ["The Scottish Theatre Company was started in 1980 under the direction of Dundee-born actor Ewan Hooper who had revived the Greenwich Theatre, London in 1969,http://www.greenwichtheatre.org.uk/> but for most of its 8 years it was directed by his successor Tom Fleming. From its production base in Glasgow, where its home theatre was the Theatre Royal, it set out its policy of presenting Scottish and international classic drama, and commissioned new plays of Scottish drama.  It was launched with a performance of Let Wives Tak Tent, Robert Kemp's translation into Scots of Molière's L'Ecole des Femmes, at the McRobert Centre at the University of Stirling on 16 March 1981.Stevenson, Randall (1981), Scottish Theatre Company: First Days, First Nights, in Murray, Glen (ed.), Cencrastus No. 7, Winter 1981-82, pp. 10 - 13,  It toured nationally and appeared at the Edinburgh International Festival. The company represented British Theatre at the International Theatre Biennale in Warsaw in 1986 with Sir David Lyndsay's Ane Satyre of the Thrie Estaites.http://www.thestage.co.uk/news/newsstory.php/27939/scottish-actor-and-director-tom-fleming-dies "]}, {"page": "Arkangel Shakespeare", "response": ["* Ewan Hooper - Menenius"]}, {"page": "In Denial of Murder", "response": ["* Ewan Hooper as Charles Hale"]}, {"page": "List of Minder episodes", "response": ["|colspan=\"3\"|Guest stars: George Sewell as Frankie Simmons, Ewan Hooper as Quinn, Patricia Quinn as Monica Mason, John Tordoff as Max, Valentino Musetti as Gerry."]}, {"page": "Theatre of Scotland", "response": ["The political and funding climate changed radically after the failure of the devolution referendum of 1979 and the election of a Conservative government under Margaret Thatcher. The Scottish Arts Council encouraged theatre companies to function as business, finding funding in ticket sales and commercial sponsorship. In 1981 the actor Ewan Hooper was given £50,000 to found the Scottish Theatre Company based in Glasgow and designed to promote the work of Scottish writers. The company found touring difficult as there were insufficient large venues that could generate the necessary income outside of the major cities. Works in the first season included McGrath's Animal (1979) and Bryden's Civilians (1981). Artistic successes were accompanied by financial disaster and the company was £120,000 in debt by the end of its second season. Despite some critical triumphs, the company was wound down in 1987. 7:84 also encountered a period of financial instability, but new structures, new management and an emphasis on encouraging new writing led to works such as Rona Munro's (b. 1959) Bold Girls (1990).J. MacDonald, \"Theatre in Scotland\" in B. Kershaw and P. Thomson, The Cambridge History of British Theatre: Volume 3 (Cambridge: Cambridge University Press, 2004), , pp. 218-19. By the last two decades of the twentieth century a substantial body of Scottish theatrical writing had built up. There was also a change from a habit of one writer working with one company to several companies drawing on a community of writers. Scottish play writing became increasingly internationalised, with Scottish writers adapting classic texts, such as Liz Lochhead's version of Molière's Tartuffe (1985) and The Misanthrope (1973/2005) or Edwin Morgan's translation of Cyrano de Bergerac (1992). Scottish playwrights were also increasingly preoccupied with wider European culture, as can be seen in Jo Clifford's (b. 1955) Loosing Venice (1985) and David Greig's (b. 1969) Europe (1995).J. MacDonald, \"Theatre in Scotland\" in B. Kershaw and P. Thomson, The Cambridge History of British Theatre: Volume 3 (Cambridge: Cambridge University Press, 2004), , p. 223."]}, {"page": "Greg Hersov", "response": ["* The Tempest with Pete Postlethwaite, Samantha Robinson and Ewan Hooper (2007)"]}, {"page": "Plantagenet (radio plays)", "response": ["*Baldwin – Ewan Hooper", "*Doctor/Langton – Ewan Hooper"]}, {"page": "List of LGBT-related films of 2005", "response": ["| Kinky Boots ||  || United StatesUnited Kingdom || Comedy, drama || Joel Edgerton, Chiwetel Ejiofor, Sarah-Jane Potts, Jemima Rooper, Nick Frost, Linda Bassett, Robert Pugh, Ewan Hooper, Stephen Marcus, Mona Hammond, Kellie Bright, Joanna Scanlan, Geoffrey Streatfeild and Leo Bill ||"]}, {"page": "Act of Will", "response": ["*Ewan Hooper\t     ...\tAlfred Crowther"]}, {"page": "1935 in Scotland", "response": ["* 23 October – Ewan Hooper, actor"]}, {"page": "Shirleymander", "response": ["*QC, Father - Ewan Hooper"]}, {"page": "Literature in modern Scotland", "response": ["The political and funding climate changed radically after the failure of the devolution referendum of 1979 and the election of a Conservative government under Margaret Thatcher. The Scottish Arts Council encouraged theatre companies to function as business, finding funding in ticket sales and commercial sponsorship. In 1981 the actor Ewan Hooper was given £50,000 to found the Scottish Theatre Company based in Glasgow and designed to promote the work of Scottish writers. The company found touring difficult as there were insufficient large venues that could generate the necessary income outside of the major cities. Works in the first season included McGrath's Animal (1979) and Bryden's Civilians (1981). Artistic successes were accompanied by financial disaster and the company was £120,000 in debt by the end of its second season. Despite some critical triumphs, the company was wound down in 1987. 7:84 also encountered a period of financial instability, but new structures, new management and an emphasis on encouraging new writing led to works such as Rona Munro's (b. 1959) Bold Girls (1990).J. MacDonald, \"Theatre in Scotland\" in B. Kershaw and P. Thomson, The Cambridge History of British Theatre: Volume 3 (Cambridge: Cambridge University Press, 2004), , pp. 218–19. By the last two decades of the twentieth century a substantial body of Scottish theatrical writing had built up. There was also a change from a habit of one writer working with one company to several companies drawing on a community of writers. Scottish play writing became increasingly internationalised, with Scottish writers adapting classic texts such Liz Lochhead's version of Molière's Tartuffe (1985) and The Misanthrope (1973/2005) or Edwin Morgan's translation of Cyrano de Bergerac (1992). Scottish playwrights were also increasingly preoccupied with wider European culture, as can be seen in Jo Clifford's (b. 1955) Losing Venice (1985) and David Greig's (b. 1969) Europe (1995).J. MacDonald, \"Theatre in Scotland\" in B. Kershaw and P. Thomson, The Cambridge History of British Theatre: Volume 3 (Cambridge: Cambridge University Press, 2004), , p. 223."]}, {"page": "Dracula (Hammer film series)", "response": ["| Ewan Hooper"]}, {"page": "Jane Howell", "response": ["Howell directed plays with the Hornchurch Repertory Company in the early 1960s, then joined the English Stage Company at the Royal Court Theatre. She was artistic director of the Northcott Theatre at Exeter University from 1971 to 1974, where she directed the world premiere of Edward Bond's Bingo in 1973, starring Bob Peck. Subsequently, Howell and John Dove directed the London premiere of Bingo at the Royal Court Theatre; the cast included John Gielgud, Arthur Lowe, Ewan Hooper, Oliver Cotton, and Paul Jesson. At the Royal Court Theatre, Howell initiated a Schools Scheme in 1966, which evolved into the Young Peoples' Theatre. Among her other work, she directed Edward Bond's Narrow Road to the Deep North in 1968 at the Belgrade Theatre, Coventry, David Mercer's Cousin Vladimir, in 1978 at the Aldwych Theatre, London for the Royal Shakespeare Company, and a 1989 production of Shakespeare's Coriolanus for the Young Vic Theatre, London. In 1983, She directed Kevin Kline in Richard III for Joseph Papp's Shakespeare in the Park at the Delacorte Theater in Central Park."]}, {"page": "Moonfleet (1984 TV series)", "response": ["* Ewan Hooper as Magistrate Maskew"]}]}}