{"wiki_id": "http://www.wikidata.org/entity/Q5415553", "itemLabel": "Evan Stephens", "itemDescription": "Latter-day Saint composer and hymn writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Evan_Stephens", "wikipedia_page": {"main": "Evan Stephens (28 June 1854 – 27 October 1930) was a Latter-day Saint composer and hymn writer.  He was also the director of the Mormon Tabernacle Choir for 26 years (1890–1916).", "link_mentions": [{"page": "List of U.S. state songs", "response": ["| State hymn: \"Utah, We Love Thee\"(state song from 1937 to 2003)Utah State Hymn - \"Utah We Love Thee\" from pioneer.utah.gov \"Pioneer: Utah's Online Library\" page. Retrieved on 2008-09-08 || colspan=\"2\" | Evan Stephens|| 2003"]}, {"page": "Tabernacle Choir", "response": ["From its first national tour in 1893, under the direction of Evan Stephens, to the Chicago World's Fair, the choir has performed in locations around the world, including:"]}, {"page": "Willard, Utah", "response": ["* Evan Stephens, Mormon Tabernacle Choir director"]}, {"page": "1930 in music", "response": ["*October 27 – Evan Stephens, Mormon composer and hymn-writer, 76"]}, {"page": "Joseph Fielding Smith", "response": ["Smith married his first wife, Louie Emily \"Emyla\" Shurtliff (born June 16, 1876) on April 26, 1898. In March 1899, church president Lorenzo Snow called him on a mission to Great Britain, which he completed (May 1899 - July 1901), leaving Louie in Salt Lake City. On May 12, 1899, Smith was set apart as a missionary and ordained a seventy by his father. A small group of missionaries, including Smith and his older brother, Joseph Richards Smith, left the next day for England. After his return from the British mission, Smith and his wife had two daughters, Josephine and Julina. Louie died of complications of a third pregnancy on March 28, 1908. For part of this time Smith was a member of the Mormon Tabernacle Choir for part of the time that Evan Stephens was the conductor.Michael Hicks. The Mormon Tabernacle Choir: A Biography"]}, {"page": "Utah, We Love Thee", "response": ["\"Utah We Love Thee\" is the official state hymn of Utah. The song was written by Utah resident Evan Stephens in 1895. It was performed at celebrations held in 1896 when Utah became the 45th state. Evan Stephens was the Mormon Tabernacle Choir conductor from 1890 to 1916. The Utah State legislature made \"Utah We Love Thee\" the official Utah state song in 1937. In 2003, the Utah legislature voted to replace it with a new state song, \"Utah…This Is The Place\", and make \"Utah, We Love Thee\" the official state hymn."]}, {"page": "Hymns in The Church of Jesus Christ of Latter-day Saints", "response": ["About half of the new hymn tunes that were composed for the Psalmody were written by members of the Church Music Committee, which included Evan Stephens, George Careless, Ebenezer Beesley, Joseph J. Daynes, and Thomas C. Griggs. These men were accomplished musicians, composers, and Mormon Tabernacle Choir conductors. Many of their Psalmody hymn tunes have a pronounced \"instrumental\" feel, as if they were more suited for organ performance than choir or congregational singing.", "*\"Land of the Mountains High\" by Evan Stephens (this song is also known as Utah, We Love Thee; it was the official state song of the State of Utah for many years, until it was replaced as such by Utah…This Is The Place, at which time it was redesignated as the official state hymn)", "*\"Sacred the Place of Prayer and Song\" by Evan Stephens", "*\"Sweet Is the Hour When Thus We Meet\" by Evan Stephens"]}, {"page": "Hymns of The Church of Jesus Christ of Latter-day Saints (1985 book)", "response": ["| 11 ||  What Was Witnessed in the Heavens? || John S. Davis || Evan Stephens || ", "| 17 ||  Awake, Ye Saints of God, Awake! || Eliza R. Snow || Evan Stephens || ", "| 18 ||  The Voice of God Again Is Heard || Evan Stephens || Evan Stephens || ", "| 23 ||  We Ever Pray for Thee || Evan Stephens || Henry A. Tuckett || Adapt.: Evan Stephens", "| 33 ||  Our Mountain Home So Dear || Emmeline B. Wells || Evan Stephens || ", "| 35 ||  For the Strength of the Hills || Felicia D. Hemans || Evan Stephens || Adapt.: Edward L. Sloan", "| 55 ||  Lo, the Mighty God Appearing! || William Goode || Evan Stephens || ", "| 61 ||  Raise Your Voices to the Lord || Evan Stephens || Evan Stephens || ", "| 74 ||  Praise Ye the Lord || Isaac Watts || Evan Stephens || ", "| 91 ||  Father, Thy Children to Thee Now Raise || Evan Stephens || Evan Stephens || ", "| 118 ||  Ye Simple Souls Who Stray || Charles Wesley || Evan Stephens || ", "| 120 ||  Lean on My Ample Arm || Theodore E. Curtis || Evan Stephens || ", "| 183 ||  In Remembrance of Thy Suffering || Evan Stephens || Evan Stephens || ", "| 229 ||  Today, While the Sun Shines || Luella Clark || Evan Stephens || ", "| 243 ||  Let Us All Press On || Evan Stephens || Evan Stephens || ", "| 254 ||  True to the Faith || Evan Stephens || Evan Stephens || ", "| 312 ||  We Ever Pray for Thee (Women) || Evan Stephens || Henry A. Tuckett || Adapt.: Evan Stephens", "| 330 ||  See, the Mighty Angel Flying (Men's Choir) || Robert B. Thompson || Evan Stephens || ", "| 337 ||  O Home Beloved (Men's Choir) || Evan Stephens || Joseph Parry ||"]}, {"page": "Homosexuality and The Church of Jesus Christ of Latter-day Saints", "response": ["Former LDS historian D. Michael Quinn has suggested that early church leaders had a more tolerant view of homosexuality given that during the 19th century, the Church (like American society as a whole) was relatively tolerant of same-sex intimate relationships. However, at the time, many such relationships had no sexual component, and among those that did, the evidence is usually circumstantial. Quinn also states that several active and prominent members of the church in Utah were not disciplined after publicizing that they were living in romantic relationships with their same-sex domestic partners, although there is no clear evidence these relationships involved sex. These included Evan Stephens, who had been director of the Mormon Tabernacle Choir until 1916 and is the author of numerous standard church hymns, who remained single but had intimate relationships and shared the same bed with a series of male domestic partners and traveling companions. Some of these relationships were described under a pseudonym in The Children's Friend. Also notable were Louise B. Felt and May Anderson, the church's first two general presidents of the Primary, who lived together in the same bedroom for decades and were referred to by Primary leaders as the \"David and Jonathan\" of Primary. Quinn's interpretations of previous leaders' views and the nature of the relationships of Evan Stephens, and Felt and Anderson have been challenged as a distortion of history. Kimball Young has cited the early church's practice of sealing men to each other as evidence of latent homosexuality."]}, {"page": "Anthony C. Lund", "response": ["Lund's left BYU to direct the Mormon Tabernacle Choir in 1916, and BYU had difficult replacing him.Alexander, Thomas G. Mormonism in Transition: A History of the Latter-Day Saints, 1890-1930 p. 174 Lund replaced Evan Stephens as choir director. He implemented a European choral sound, and directed the choir in its first electrical recordings on the Victor Label. Lund held the position of choir director until his death in 1935. He was succeeded as director of the choir by J. Spencer Cornwall."]}, {"page": "Criticism of The Church of Jesus Christ of Latter-day Saints", "response": ["Gay historian D. Michael Quinn has hypothesized that early church leaders had a more tolerant view of homosexuality. He writes that several early church leaders and prominent members, including Louie B. Felt, May Anderson, Evan Stephens, and presiding patriarch Joseph Fielding Smith, may have either had homosexual tendencies or were involved in homosexual relationships. George Mitton and Rhett S. James do not dispute that some early members may have had homosexual tendencies, but they call Quinn's assertion of tolerance a distortion of church history that has  little support from other historians. They state the current leadership of the church \"is entirely consistent with the teachings of past leaders and with the scriptures.\"George L. Mitton, Rhett S. James A Response to D. Michael Quinn's Homosexual Distortion of Latter-day Saint History  Review of Same-Sex Dynamics among Nineteenth-Century Americans: A Mormon Example by D. Michael Quinn Provo, Utah: Maxwell Institute, 1998. Pp. 141–263"]}, {"page": "Even Stevens (disambiguation)", "response": ["* Evan Stephens, Latter-day Saint composer and hymn writer"]}, {"page": "List of Utah state symbols", "response": ["| Utah's original state song from 1936 to 2003.  The song was written in 1895 by Evan Stephens for celebrations held in 1896, when Utah became a state."]}, {"page": "List of Brigham Young University buildings", "response": ["|Wymount Terrace (W05D) Stephens (Evan)||W05D||||1963||Named for former Mormon Tabernacle Choir director Evan Stephens||"]}, {"page": "Rhett S. James", "response": ["In response to writings by D. Michael Quinn, James has also co-written with George L. Milton apologetic defenses of Joseph Smith and Evan Stephens."]}, {"page": "Charles John Thomas", "response": ["In 1887, Thomas served as a Mormon missionary in Great Britain.  After his return to Salt Lake City, he was head of music for the Salt Lake Temple.  He also was appointed by Evan Stephens to direct a choir made up of those members of the Tabernacle Choir that did not go to the World's Fair in Chicago in 1893 and thus provide music at the Tabernacle while most of the Tabernacle Choir was absent."]}, {"page": "Joseph J. Daynes", "response": ["Evan Stephens, who conducted the Mormon Tabernacle Choir for many years while Daynes accompanied them, said of Daynes: \"He was, without doubt, one of the greatest organists of his time. In my experience I never heard his equal as an accompanist for the choir and soloists and he was the very best sight reader I ever knew.\""]}, {"page": "List of Brigham Young University residence halls", "response": ["|Wymount Terrace (W05D) Stephens (Evan)||W05D||1963||Named for former Mormon Tabernacle Choir director Evan Stephens."]}, {"page": "The Church of Jesus Christ of Latter-day Saints in Wales", "response": ["*Evan Stephens"]}, {"page": "LGBT Mormon people and organizations", "response": ["Others individuals at the LGBT-Mormon intersection include Lino Brocka, Cam Clarke, Reed Cowan, C. Jay Cox, Nate Dushku, Angela Ellsworth, Steven Fales, Antonio A. Feliz, Michael Glatze, John C. Hamer, Todd Herzog, Roy Jeffs, Konrad Juengling, Manny MUA, Sue-Ann Post, W. H. Pugmire, John W. Bryant, Patriarch Joseph Fielding Smith, and evidence exists that this list may include historical figures like May Anderson, Louie B. Felt, Evan Stephens, David Hyrum Smith, and John C. Bennett."]}]}}