{"wiki_id": "http://www.wikidata.org/entity/Q541502", "itemLabel": "Glyn Simon", "itemDescription": "British bishop (1903-1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Glyn_Simon", "wikipedia_page": {"main": "William Glyn Hughes Simon (14 April 1903 – 14 June 1972) was the Anglican Archbishop of Wales from 1968 to 1971.", "link_mentions": [{"page": "Llandaff Cathedral", "response": ["In 1941, a parachute mine exploded near the south aisle of the cathedral, resulting in the roof of the nave collapsing and the shattering of the windows. Charles Nicholson was hired to rebuild the roof, and made the decision to remove the altarpiece that Rossetti had added to the north aisle. In 1949, Nicholson was replaced with George Pace of York, who in coordination with the dean at the time, Glyn Simon, saw a number of improvements in the modern style, though many fittings were clearly still influenced by the Gothic."]}, {"page": "Jesus College, Oxford", "response": ["The founders' hopes that their college would produce prominent Welsh clergy were fulfilled in no small measure when a former student, A. G. Edwards, was elected the first Archbishop of Wales when the Church in Wales was disestablished in 1920. Two later Archbishops of Wales, Glyn Simon (Archbishop from 1968 to 1971) and Gwilym Owen Williams (Archbishop 1971–1982) were also educated at the college. Celticists associated with the college include Sir John Rhys, Sir John Morris-Jones, and Sir Thomas (T. H.) Parry-Williams, whilst the list of historians includes the college's first graduate, David Powel, who published the first printed history of Wales in 1584, the Victorian historian J. R. Green, and the historian Richard J. Evans. Angus Buchanan won the Victoria Cross during the First World War. Record-breaking quadriplegic solo sailor Hilary Lister was also a student here, whilst from the field of arts and entertainment there are names such as Magnus Magnusson, presenter of Mastermind, the National Poet of Wales Gwyn Thomas, and television weather presenters Kirsty McCabe and Siân Lloyd. Nigel Hitchin, the Savilian Professor of Geometry at Oxford since 1997, studied at the college, as did Edward Hinds (a physicist who won the Rumford Medal in 2008), Chris Rapley (director of the Science Museum), and the zoologists Edward Bagnall Poulton and James Brontë Gatenby."]}, {"page": "St Stephen's House, Oxford", "response": ["* Glyn Simon – former Archbishop of Wales"]}, {"page": "Susan Howatch", "response": ["She had settled in Salisbury out of love for the beauty of the town, but found herself increasingly drawn to Salisbury Cathedral; eventually she began to study Anglican Christianity in earnest. (Quotations from contemporary Anglican writers, such as Glyn Simon, Bishop of Llandaff (1958–1970), often appear as chapter headings). She experienced a spiritual epiphany, and concluded that she should continue to write novels, but to \"set forth my discoveries in the light of faith, no matter how feeble and inadequate my beginner's faith was.\"Myers, Doris T. \"Forgiven Sinners: Susan Howatch's Church Novels\". Anglican Theological Review, Winter 1998. This personal turning point culminated in Howatch's most successful and popular works, the Starbridge series."]}, {"page": "Archbishop of Wales", "response": ["Successive archbishops have not only represented different geographical areas but also different tendencies within Anglicanism. In the mid-twentieth century linguistic issues were prominent in the successive incumbencies of Edwin Morris (who spoke no Welsh) and of Glyn Simon (who sympathised with advocates of the use of the Welsh language). Morris in some ways represented the broad churchmanship characteristic of the first occupant of the newly created post, A. G. Edwards, whereas Simon in many respects inherited the Anglo-Catholic outlook of the second archbishop, Charles Green (but without his authoritarianism). Towards the end of his period in office Gwilym Williams was one of three leading Welsh figures in a deputation to guarantee the status of the language which had been challenged by Margaret Thatcher. He was also decisive in the decision to ordain women priests. The former archbishop of Canterbury, Rowan Williams, subsequently Master of Magdalene College, Cambridge, was Archbishop of Wales and Bishop of Monmouth.", "| 60px Glyn Simon"]}, {"page": "Bishop of Swansea and Brecon", "response": ["|align=\"center\"| 1953 ||align=\"center\"| 1958 ||Glyn Simon ||"]}, {"page": "William Simon", "response": ["* Glyn Simon (William Glyn Hughes Simon, 19031972), Archbishop of Wales"]}, {"page": "Bishop of Llandaff", "response": ["| 60px Glyn Simon"]}, {"page": "William Glyn Hughes Simon", "response": ["#REDIRECT Glyn Simon"]}, {"page": "List of people from Swansea", "response": ["*Glyn Simon, archbishop of Wales"]}, {"page": "Kenneth Kirk", "response": ["The title of his last published work, Beauty and Bands, is that of a sermon he gave at the episcopal consecration of Glyn Simon in Brecon Cathedral."]}, {"page": "Aneirin Talfan Davies", "response": ["He wrote an anonymous satire in the Western Mail (under the pen name of Theomemphus), to which he was a frequent contributor, following Bishop Glyn Simon's attack on the workings of the Electoral College of the Church in Wales (1961). He was a prominent Anglican and Christian themes characterised much of his writing. He was a regular worshipper at Eglwys Dewi Sant in Cardiff and at Llandaff Cathedral."]}, {"page": "1972 in Wales", "response": ["*14 June (at Goathurst) – Glyn Simon, Archbishop of Wales (1968–71), 69"]}, {"page": "1971 in Wales", "response": ["**Glyn Simon, Bishop of Llandaff (retired)"]}, {"page": "1970 in Wales", "response": ["*Archbishop of Wales – Glyn Simon, Bishop of Llandaff"]}, {"page": "1969 in Wales", "response": ["*Archbishop of Wales – Glyn Simon, Bishop of Llandaff"]}, {"page": "1968 in Wales", "response": ["*Archbishop of Wales – Glyn Simon, Bishop of Llandaff"]}, {"page": "Simon (surname)", "response": ["* Glyn Simon (1903–72), Archbishop of Wales (1968–71)"]}, {"page": "Eryl Thomas", "response": ["An Anglesey man, after education at St John's College, Oxford, Eryl Thomas served curacies in the Diocese of St Asaph before being appointed to a parish (Risca) in South Wales then as Warden of St Michael's College, Llandaff. He was appointed Dean of Llandaff in 1954,“Who was Who” 1897-2007 London, A & C Black, 2007   and in this post completed the restoration of the war-damaged cathedral begun under his predecessor Glyn Simon.", "There is some suggestion that Thomas was considered as a candidate for episcopal appointments during the 1950s,Jones, O.W,1981, Glyn Simon: His Life and Opinions, Llandyssul, GomerPeart-Binns J.S, 1990: Edwin Morris, Archbishop of Wales, Llandyssul, Gomer Press. but was not in the event chosen to head a diocese until 1968 when he was elected and consecrated as Bishop of Monmouth. He was translated to Llandaff in 1970."]}, {"page": "St Michael's College, Llandaff", "response": ["* Glyn Simon (later Bishop of Llandaff and Archbishop of Wales)"]}]}}