{"wiki_id": "http://www.wikidata.org/entity/Q5418915", "itemLabel": "Ewan Morrison", "itemDescription": "writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ewan_Morrison", "wikipedia_page": {"main": "Ewan Morrison is a Scottish author and screenwriter, described as \"the most fluent and intelligent writer of his generation here in Scotland\" by Booker judge Stuart Kelly.", "link_mentions": [{"page": "Tropic of Cancer (novel)", "response": ["In Sexual Politics (1970), Kate Millett wrote that Miller \"is a compendium of American sexual neuroses\", showing \"anxiety and contempt\" toward women in works such as Tropic of Cancer. In 1980, Anatole Broyard described Tropic of Cancer as \"Mr. Miller's first and best novel\", showing \"a flair for finding symbolism in unobtrusive places\" and having \"beautiful sentence[s]\". Julian Symons wrote in 1993 that \"the shock effect [of the novel] has gone\", although \"it remains an extraordinary document\". A 2009 essay on the book by Ewan Morrison described it as a \"life-saver\" when he was \"wandering from drink to drink and bed to bed, dangerously close to total collapse\"."]}, {"page": "Young adult fiction", "response": ["There are those who have critiqued commercial YA novels and franchises for implicitly promoting capitalism and reactionary ideologies even when the books may seem progressive. Such critics include author Ewan Morrison who says: \"The dystopian narratives which are currently consuming the minds of millions of teens worldwide are now communicating right-wing ideas.\" Another critic is Andrew O'Hehir who, in describing commercial YA novels, wrote: \"They are propaganda for the ethos of individualism, the central ideology of consumer capitalism, which also undergirds both major political parties and almost all American public discourse.\""]}, {"page": "Close Your Eyes", "response": ["*Close Your Eyes, a 2013 novel by Ewan Morrison"]}, {"page": "Allison McKenzie", "response": ["* Swung (2014) Writer Ewan Morrison – Director Colin Kennedy  – Produced by Sigma – Marcia"]}, {"page": "Emily Ballou", "response": ["Ballou has also written episodes of BBC One/FX Taboo, Channel 4/AMC Humans, BBC One's Case Histories (series 2, \"Nobody's Darling\"), ITV's Scott & Bailey, National Geographic's TV movie American Blackout, co-written with Ewan Morrison, and Family, directed by Shaun Gladwell in the anthology film The Turning, adapted from Tim Winton's book of short stories and screened in the Berlinale Special Galas section of the 64th Berlin International Film Festival."]}, {"page": "Glenfiddich Spirit of Scotland Awards", "response": ["| Ewan Morrison"]}, {"page": "Robert Wringham", "response": ["Wringham was the founder of New Escapologist, a lifestyle magazine that ran from 2007 to 2017. The magazine advocated the escape from employment and some notable contributors were Alain de Botton, Will Self, Richard Herring, Ewan Morrison, Tom Hodgkinson, Luke Rhinehart and Caitlin Doughty. Wringham continues the magazine \"out of love or maybe habit\"If you don't know the story... Twitter as a newsletter and blog."]}, {"page": "New Escapologist", "response": ["* Ewan Morrison, author of Tales from the Mall"]}]}}