{"wiki_id": "http://www.wikidata.org/entity/Q5418983", "itemLabel": "Ewen MacIntosh", "itemDescription": "Welsh actor and comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Ewen_MacIntosh", "wikipedia_page": {"main": "Ewen Douglas MacIntosh (born 25 December 1973) is a British actor and comedian known for his role as Keith Bishop in The Office.", "link_mentions": [{"page": "The Office", "response": ["|Keith Bishop(Ewen MacIntosh)||Kevin Malone(Brian Baumgartner)||César(Alfredo )"]}, {"page": "Dave Benson Phillips", "response": ["In 2013, Phillips made a guest appearance in Sooty. Phillips plays himself in an award-winning mockumentary webseries called Getting Back with Dave Benson Phillips which began in 2017. The series by Andrew River was invited to showcase at MCM London Comic Con and the cast includes Pat Sharp and Ewen MacIntosh. The series and spin off In Production are available to watch on YouTube. He has most recently been seen working as a professional wrestler, after having also done so whilst working as a blue coat at Pontins."]}, {"page": "Improverts", "response": ["*Ewen MacIntosh (The Office)"]}, {"page": "Heads Up with Richard Herring", "response": ["* Episode 1: Chris Brooks (radio presenter)|, Malcolm \"The Rock\" Harwood, Ewen MacIntosh"]}, {"page": "The Office (British TV series)", "response": ["* Keith Bishop (Ewen MacIntosh): Keith works in the accounts department. Heavy set, slow-talking and apparently emotionless, he is a man of few words. When he does speak, his comments can be eloquent and sometimes disturbing.", "*Ewen MacIntosh as Keith Bishop"]}, {"page": "Bedlam Theatre", "response": ["* Ewen MacIntosh (The Office (UK TV series))"]}, {"page": "List of The Office (British TV series) episodes", "response": ["Brent tries to be a friend and an entertainer as well as a boss, and is often annoying as a result. His sycophantic assistant Gareth Keenan (Mackenzie Crook) annoys and is often pranked by sales representative Tim Canterbury (Martin Freeman), whose relationship with receptionist Dawn Tinsley (Lucy Davis) is a major story arc, despite her engagement to warehouse worker Lee (Joel Beckett). Minor characters include droning and crass office worker Keith Bishop (Ewen MacIntosh), Brent's brash and sexist friend Chris Finch (Ralph Ineson) and Brent's bosses Jennifer Taylor-Clarke (Stirling Gallacher) and later Neil Godwin (Patrick Baladi)."]}, {"page": "List of Never Mind the Buzzcocks episodes", "response": ["|Ewen MacIntosh and Keedie"]}, {"page": "C. J. de Mooi", "response": ["De Mooi announced in 2021 that he had started working on a new television sitcom, which he would be writing and producing. In February, the title of the show was announced to be Together. Plot details are not known at present, but De Mooi has described it as \"a modern twist on a classic sitcom scenario\". The show, which is set to film its pilot in July 2021, is currently set to star Ewen MacIntosh, John Challis and Sally Thomsett, who is making her first appearance on screen since 1978."]}, {"page": "Life's Too Short (TV series)", "response": ["* Ewen MacIntosh (episode 6)", "On 22 June 2011 it was announced that Sting and Steve Carell would be filming cameos for the series. The teaser trailer released on the same day featured Keith Chegwin, Les Dennis and Shaun Williamson as well as the three main stars. On 11 July Gervais hinted on his blog that a Doctor Who-related cameo would be in the show, as well as posting a link to a YouTube video of him and Davis filmed on the set of Life's Too Short. Earlier in that week he had blogged about how \"Matt Groening's favourite character from The Office will make a cameo in Life's Too Short\", along with an on-set photograph of actor Ewen MacIntosh who played Big Keith in The Office."]}, {"page": "Celebrity Mastermind", "response": ["| Ewen MacIntosh || Twin Peaks ||2nd"]}, {"page": "Totally Top Trumps", "response": ["*Ewen MacIntosh"]}, {"page": "Driving Home for Christmas", "response": ["In 2009, 21 years after the song was first released, an original video was made in aid of Shelter; all proceeds from digital download were donated to the charity. The celebrities who featured in the video were Mike Read, David Hamilton, Martin Shaw, Kristian Digby, Gail Porter, Lizzie Cundy, Ewen MacIntosh, Carol Decker, Giles Vickers-Jones, and Lionel Blair. On the project, Rea stated: \"I wanted to do something special this Christmas and what better way than to help keep a roof over people's heads when they need it most – at Christmas. By teaming up with Shelter we can hopefully make a difference\"."]}, {"page": "The Peacock and Gamble Podcast", "response": ["Ray Peacock (real name Ian Boldsworth) met Ed Gamble at a revue at Durham University. Their first podcast work together was the Ray Peacock Podcast, which was co-hosted with \"Little Raji James who used to be in EastEnders but ruined it\" - Peacock's actor friend, Raji James. Ed Gamble first joined the cast in episode 4 of the first series, and became a permanent host from series 2 onwards. Raji's role in the show was mainly as the butt of the jokes, with features such as \"Raji's Autobiography\" and \"Letters for Raji\" being written by Peacock and Gamble on his behalf, exaggerating traits such as his poor grammar and his floundering career. The Ray Peacock Podcast was successful, spawning live shows (attended by special guests such as Harry HillThe Ray Peacock Podcast - Episode 33 and The Office actor Ewen MacIntoshThe Ray Peacock Podcast - Episode 32), but ended after four series, as the presenters felt they were spending too much time making fun of Raji."]}, {"page": "Rich Keeble", "response": ["From September 2015 he has been heard as the voiceover for the Property Partner television advert. In May 2016 he voiced comedy online commercials for ITV2's Love Island. On 12 September 2016, a series of online videos featuring his voice and starring Ewen MacIntosh were released for Recycle Week. In January 2017, he narrated the audiobook for James Smythe's, The Explorer, published by Harper Audio. He also narrated the audiobook of Mesut Özil's autobiography Gunning for Greatness, and provided voices for the feature film Finding Fatimah, as well as for the video games Total War: Warhammer, Elite Dangerous: Horizons, and Eve: Valkyrie."]}, {"page": "Buy Me Up TV", "response": ["Buy Me Up TV is a BBC Radio 2 sitcom set behind the scenes of a 24-hour shopping channel. It was written by James Eldred and Justin Edwards. A pilot episode aired in March 2007, with a further four episodes following in March 2008. It starred Justin Edwards, Katherine Jakeways, Alex MacQueen, Greg Proops, Ewen MacIntosh, Colin Hoult.", "* Ewen MacIntosh as Ewen"]}, {"page": "The Lobster", "response": ["* Ewen MacIntosh as Hotel Guard"]}, {"page": "List of British films of 2015", "response": ["|| Director: Kenton Hall  Cast: Scarlet Hall, Hero Hall, Colin Baker, Ewen MacIntosh, Sarah Warren, Kenton Hall"]}, {"page": "List of British films of 2016", "response": ["|| Director: Savvas D. Michael  Cast: Dexter Fletcher, Daniel Caltagirone, Count Prince Miller, Ewen MacIntosh"]}, {"page": "The Confusion of Tongues", "response": ["The Confusion of Tongues is a 2014 multi-narrative comedy film written and directed by James Fair. The film stars an ensemble cast, which includes Sadie Frost, Gemma Atkinson, Ewen MacIntosh, Kate O'Toole, Paul Henshall and Katie Sheridan. The story follows a group of Birmingham residents who descend upon a local pub in order to win a lucrative pub quiz.", "Local pub owners, Helen (Kate O'Toole) and Derek (Paul Henshall), are preparing for Birmingham's biggest and hardest pub quiz and everyone has their eyes on the prize. Nearby residents include Mary (Selina Giles) who seeks to find common ground with her daughter Gemma (Katie Cleaver), whilst Kelvin (Rory Mullen) is determined not to let his lover, Angel (Gemma Atkinson), discover his financial ruin and enlists the help of his window cleaner, Barry (Ewen MacIntosh) in a crazy plan to burgle his house and claim on the insurance. Local author Ashley (Nicholas A. Newman) has finished his long-awaited epic novel and is having difficulty promoting it, much to the misfortune of his literary agent (Tom Bonington).", "* Ewen MacIntosh as Barry"]}, {"page": "A Dozen Summers", "response": ["A Dozen Summers is a 2015 family comedy film. It was written and directed by Kenton Hall and stars Scarlet Hall, Hero Hall, Colin Baker, Ewen MacIntosh, Sarah Warren and Kenton Hall. It received a limited UK cinema release on 21 August 2015.", "* Ewen MacIntosh as Gary"]}, {"page": "Finding Fatimah", "response": ["* Ewen MacIntosh as Lionel"]}, {"page": "Smoking Guns", "response": ["Smoking Guns is a 2016 British crime comedy film written and directed by Savvas D. Michael.  The film is produced by John Pavlakos, Andrew Neophytou and executive produced by Hollywood Producer Steven Paul, Lara Minassian and Andrew Downer. It stars Dexter Fletcher, Daniel Caltagirone, Count Prince Miller, Ewen MacIntosh, Paul Anastasi, Andreas Karras, Jamie Crew, Tommy O'Neil and Mem Ferda."]}, {"page": "List of Old Reptonians", "response": ["* Ewen MacIntosh, actor in The Office"]}, {"page": "Changing of the Seasons (song)", "response": ["The single's music video, directed by BREWER, debuted in the United Kingdom on 27 August 2013. The video, shot in black-and-white, features a cameo from British actor, Ewen MacIntosh."]}, {"page": "Ewen Macintosh", "response": ["#REDIRECT Ewen MacIntosh"]}, {"page": "Eight Rounds Rapid", "response": ["Their second album Object D’Art was released in 2017, previewed by a new video for \"I Like It\" starring Ewen MacIntosh."]}, {"page": "The Bromley Boys", "response": ["David meets and become close friends with three adult Bromley FC fans (TJ Herbert, Mark Dymond, Ewen MacIntosh) who encourage and support him. Dave also meets, and rapidly falls in love with, Ruby McQueen (Savannah Baker), the pretty and bright teenage daughter of Charlie McQueen (Jamie Foreman), the tough scary Chairman of the football club."]}]}}