{"wiki_id": "http://www.wikidata.org/entity/Q5416340", "itemLabel": "Evelyn Hellicar", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Evelyn_Hellicar", "wikipedia_page": {"main": "Evelyn Hellicar (1862–1929) was an English architect.\n\n", "link_mentions": [{"page": "Bickley", "response": ["*Evelyn Hellicar (1862–1929), architect."]}, {"page": "Bromley", "response": ["The second church was built in brick and stone on the present site, and designed by Evelyn Hellicar, son of the then vicar of St Peter and St Paul's. It was completed in 1898 in the Perpendicular Gothic style and consecrated by William Walsh, Bishop of Dover, on 22 October that year. The tower, though, was not completed until 1904. Like St Peter and St Paul's, St Mark's was heavily damaged in the London Blitz of 1941. Only the tower survived intact."]}, {"page": "Hambledon, Surrey", "response": ["*Evelyn Hellicar, architect"]}, {"page": "Nether Compton", "response": ["Many of the buildings in the village date from when it was improved in the last decades of the 19th century, Colonel John R. P. Goodden having inherited Compton House in 1883. Architect Evelyn Hellicar (1862–1929) is responsible for a number of the buildings.Hellicar obituary, RIBA Journal, 21 September 1929, p. 772  These include Sheriff's Lodge (1889). The Grade II listed former village school, built c. 1843, is now a private home."]}, {"page": "Thomas Graham Jackson", "response": ["Jackson's pupils and assistants included Evelyn Hellicar."]}, {"page": "List of Carnegie libraries in Europe", "response": ["**Bromley 1908, designed by Evelyn Hellicar (1862–1929),The Bromley Record, June 1906, page 98 now demolished."]}, {"page": "Evelyn hellicar", "response": ["#REDIRECT Evelyn Hellicar "]}, {"page": "Thomas Charles Dewey", "response": ["He endowed and was closely associated with St Mark's Church, Westmoreland Road, Bromley; which was designed by Evelyn Hellicar.  Dewey's daughter Daisy married the curate-in-charge of the church, Rev L J Lewin, in May 1905.The Bromley Record, May 1905, p 81  ", "He was also patron of Evelyn Hellicar, architect.  In 1898 Hellicar extended the house and in 1902 he designed the music pavilion within the grounds; the design of which was exhibited at the Royal Academy of Arts.  In 1904 he designed and built Peak House, Sidmouth for Dewey."]}, {"page": "Sydney Vacher", "response": ["Vacher was born in Kensington,England & Wales, Civil Registration Birth Index, 1837-19151861 England Census the son of Thomas Brittain Vacher (1805–80). He entered a partnership with Evelyn Hellicar in the late 1880s.Hellicar Obituary. Journal of the Royal Institute of British Architects, 21 September 1929, p772 Their office was at 35 Wellington Street, The Strand, London.  Together they won the competition to design the Valley Primary School, Shortlands, Kent in 1889.", "*1890: Design for Post Office, Hertford (with Evelyn Hellicar)"]}, {"page": "Peak House, Sidmouth", "response": ["Peak House in Sidmouth, Devon, is a building designed by Evelyn Hellicar. It was finished in 1904 and is entirely made of beer stone. It is a Grade II Listed building."]}, {"page": "St Mark's Church, Bromley", "response": ["In 1897 the decision was made. The site at the foot of Westmorland Road was purchased by Thomas Dewey and Eley Soames for £500. In 1896 a meeting was held at South Hill Wood, Mr Dewey's house in Westmorland Road, when the plans of the architect, Evelyn Hellicar, son of the Vicar of Bromley, were approved."]}]}}