{"wiki_id": "http://www.wikidata.org/entity/Q5415317", "itemLabel": "Evan Baillie", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Evan_Baillie", "wikipedia_page": {"main": "Evan Baillie (1741 – 28 June 1835) was a British West Indies merchant, landowner and Whig politician who sat in the House of Commons from 1802 to 1812.\nBaillie was the third son of Hugh Baillie of Dochfour, Inverness and his wife Emilia Fraser, the daughter of Alexander Fraser. His early life was obscure and he suffered \"fatal neglect\" in formal education. He entered the army in early life and served in part of the American war.He was first in the West Indies in 1759–60, serving with the 4th Foot in Martinique, as his 1835 Inverness Courier obituary makes clear. Baillie himself seems to have been a staff officer to General Howe at the Siege of Havana in the adjutant's department. He then transferred to the 19th Regiment (later the Green Howards) as a lieutenant, and retired on half-pay. He then seems to have spent most of the next 15 years in partnership with his brothers, Alexander and James, who had begun a partnership in St Kitts known as Smith and Baillies, which was eventually based in Grenada and later in St Vincent as the partnership of Garraway and Baillie. A 1779 letter from his brother James to his cousin, William Baillie of Dunain, then serving in India, indicates that he had returned to Britain in about 1774 and settled in Bristol.\nA 1775 letter from John Alves in Inverness to the same William Baillie, Alves's brother-in-law confirms that he had bought at the same time, for £10,000, the estate of Kinmylies, Inverness, from the army agent, George Ross of Pitkerrie, who intended to concentrate on developing Cromarty. Alves also indicates that he was believed in 1775 to have married in the West Indies, marrying Mary Gurley of St Peter's Hope, St Vincent, in 1777. He founded what became the firm of Evan Baillie, Son & Co in Bristol, and was a common councilman for Bristol in 1785. He was sheriff of Bristol for 1786–87 but declined becoming mayor. In 1789 he was member of a committee of merchants to defend the slave trade, in all branches of which he had from time to time invested and financed.During the French Revolutionary War he raised the Bristol Volunteer Infantry in 1797 and served as their Lieutenant-Colonel (Colonel in 1798). After the short-lived Peace of Amiens he re-raised them as the Royal Bristol Volunteer Infantry.On the death of his brother Alexander in 1798 Baillie succeeded to the family estates in Inverness-shire. He was also partner in an Inverness hemp manufacturers and other businesses. He continued to purchase more land in Scotland as a result of concerns about the effects of the war with France and effects of abolition of slavery.In 1802 Baillie became an alderman of Bristol. Also in 1802, he was elected unopposed as Member of Parliament for Bristol. He was unopposed again in 1806 and 1807. He noted how feeble were attempts in parliament to oppose slave trade abolition bill but he was not among those who made last stand against it. By 1811, he was suffering poor health and was concerned for his son Peter (by then MP for the Inverness burghs) who died in 1812. He therefore decided not to stand in the 1812 election.Baillie retired to Scotland and left the business operations to his sons. He resigned as alderman of Bristol in 1821 pleading old age, but survived to the age of 94.His wife Mary Gurley was the daughter of Peter Gurley of St. Vincent. Their sons Peter Baillie, Hugh Duncan Baillie and James Evan Baillie all became members of parliament. Baillie's brother James Baillie was also an MP and West Indies merchant.", "link_mentions": {}}}