{"wiki_id": "http://www.wikidata.org/entity/Q54174766", "itemLabel": "Ian Hunter", "itemDescription": "British painter", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Hunter_(artist)", "wikipedia_page": {"main": "Ian Hunter (27 April 1939 – 1 March 2017) was a British artist and Dean of Saint Martin's School of Art (now Central Saint Martins) in London.Hunter was born in Leeds, Yorkshire, but his family moved to Scarborough. He studied at the Scarborough School of Art. His friend Ian Parkinson inspired him to be an artist and they both studied at the Leicester College of Art and Design. He became a lecturer at the Luton School of Art, the Guildford School of Art and the Farnham College of Art. He was based for a year at Stout University, Menomonie, Wisconsin, in the United States. He then moved to the Falmouth School of Art and the Cheltenham School of Art, where he became the Head of Fine Art. In the 1980s, he became the Dean of Art at Central St Martins. He was appointed as a full professor, but took early retirement. Later he was Head of Fine Art at the Winchester College of Art, before moving to southern Spain in 1999 where he joined the Andalucian International Artists group and became a member of the Asociacion Espanola de Pintores y Escultures.\nHunter mainly painted in oils, typically including human figures, but also produced sculptures using wood and canvas. At the age of 73, he started to paint using an iPad, influenced by David Hockney. At the end of his life, he moved to Scotland.\nHe exhibited widely, including at the Barbican Centre, Hayward Gallery, and Royal Academy of Arts in London. He held a major solo exhibition in 1983 at Newlyn Art Gallery in Cornwall.Ian Hunter met his first wife Maureen Blowman in Scarborough and they married in 1960. He married his second wife Susie Lee in 1975.", "link_mentions": [{"page": "Ian Hunter", "response": ["Ian Hunter may refer to:", "* Ian Hunter (actor) (1900–1975), South African-born British actor", "* Ian Hunter (artist) (1939–2017), British artist and Dean of Saint Martin's School of Art", "* Ian Hunter (cricketer) (born 1979), British cricketer", "* Ian Hunter (impresario) (1919–2003), British classical music and talent promoter", "* Ian Hunter (politician) (born 1960), South Australian Labor Party politician", "* Ian Hunter (rugby union) (born 1969), English rugby player and media marketer", "* Ian Hunter (Scottish footballer) (fl. 1960s), Scottish footballer (Falkirk)", "* Ian Hunter (singer) (born 1939), English singer-songwriter, former frontman of Mott the Hoople", "** Ian Hunter (album), his debut 1975 solo album", "* Ian Hunter (soccer) (born 1961), Australian footballer", "* Ian Hunter (visual effects supervisor), visual effects artist "]}, {"page": "List of British artists", "response": ["* Ian Hunter (1939–2017) – Dean of Saint Martin's School of Art"]}, {"page": "Scarborough TEC", "response": ["*Ian Hunter – painter and Dean of Fine Art at Central Saint Martins, London"]}]}}