{"wiki_id": "http://www.wikidata.org/entity/Q5424000", "itemLabel": "F. Percy Smith", "itemDescription": "British nature documentary pioneer", "wikipedia_url": "https://en.wikipedia.org/wiki/F._Percy_Smith", "wikipedia_page": {"main": "Frank Percy Smith (12 January 1880–24 March 1945) was a British naturalist and early nature documentary pioneer working for Charles Urban, where he pioneered the use of time-lapse and microcinematography.", "link_mentions": [{"page": "History of film", "response": ["Regular newsreels were exhibited from 1910 and soon became a popular way for finding out the news the British Antarctic Expedition to the South Pole was filmed for the newsreels as were the suffragette demonstrations that were happening at the same time. F. Percy Smith was an early nature documentary pioneer working for Charles Urban and he pioneered the use of time lapse and micro cinematography in his 1910 documentary on the growth of flowers."]}, {"page": "List of documentary films", "response": ["|Strength and Agility of Insects, The||1911||F. Percy Smith||"]}, {"page": "Charles Urban", "response": ["Urban made many kinds of non-fiction film at the Charles Urban Trading Company, including travel films, war reportage, exploration films, sports films, advertising films and natural history films. Filmmakers who worked for him include Jack Avery, Joseph Rosenthal, Charles Rider Noble, Harold Mease Lomas, the mountaineer Frank Ormiston-Smith, George Rogers, J. Gregory Mantle and the naturalist F. Percy Smith. Smith made one of Urban's most successful films, The Balancing Bluebottle (1908), which featured a fly balancing objects such as a wine cork with its legs."]}, {"page": "Time-lapse photography", "response": ["F. Percy Smith pioneered the use of time-lapse in nature photography with his 1910 silent film The Birth of a Flower.", "Time-lapse photography of biological phenomena was pioneered by Jean Comandon in collaboration with Pathé Frères from 1909, by F. Percy Smith in 1910 and Roman Vishniac from 1915 to 1918. Time-lapse photography was further pioneered in the 1920s via a series of feature films called Bergfilme (Mountain films) by Arnold Fanck, including Das Wolkenphänomen in Maloja (1924) and The Holy Mountain (1926)."]}, {"page": "Fight for the Dardanelles", "response": ["Fight for the Dardanelles (1915) is a British silent documentary film, directed by F. Percy Smith and produced and edited by Charles Urban."]}, {"page": "Charles Urban Trading Company", "response": ["The company made its name with coverage of the Russo-Japanese War of 1904-5 from Joseph Rosenthal (with the Japanese) and George Rogers (with the Russians). Other notable cameramen working for Urban were Charles Rider Noble (filming in the Balkans), H.M. Lomas (Malaya, Borneo, hunting films), John Mackenzie (the Balkans), mountaineer F. Ormiston-Smith (Switzerland, Sweden), and the naturalists F. Martin Duncan and F. Percy Smith. The CUTC also made fiction films, including several science fiction and trick films made by Walter R. Booth. Charles Urban ceased to have any connection with the company (beyond his name being used) after 1910. It ceased production during the First World War."]}, {"page": "Stuart A. Staples", "response": ["In 2017, the British Film Institute released Minute Bodies, a film he directed and scored with Christine Ott and Thomas Belhom of films by the naturalist F. Percy Smith."]}, {"page": "Percy Smith", "response": ["* F. Percy Smith (1880–1945), English naturalist and pioneer photographer"]}, {"page": "To Demonstrate How Spiders Fly", "response": ["To Demonstrate How Spiders Fly is a 1909 British short  silent animated documentary film, directed by F. Percy Smith, featuring a close-up of an animated model spider throwing its silken thread to take to the air. The film features \"the first of several animated creatures to appear in Smith's films\", and according to Jenny Hammerton of BFI Screenonline was made in the belief, \"that he could cure people of their fear of spiders by showing them blown up images of their eight legged foes on the cinema screen.\""]}, {"page": "The Acrobatic Fly", "response": ["The Acrobatic Fly (also known as The Balancing Bluebottle) is a 1910 British short  silent documentary film, directed by F. Percy Smith, featuring close-ups of a housefly secured to the head of a match and juggling objects with its feet. The film, \"is one of a series of Smith films on similar subjects around this time,\" and according to Mark Duguid of the BFI is, \"near identical to, though briefer than, a sequence in his 1911 release The Strength and Agility of Insects.\""]}, {"page": "The Strength and Agility of Insects", "response": ["The Strength and Agility of Insects is a 1911 British short  silent documentary film, directed by F. Percy Smith, featuring close-ups of houseflies and other insects secured and juggling various objects with their feet. The films in this series, which included The Acrobatic Fly (1910), \"caused an absolute furore when they were first shown to the public,\" and, according to Jenny Hammerton of the BFI, Smith, whose stated intention \"was of course to entertain the public, but also to demonstrate the strength and agility of those insects we might unthinkingly squash or swat when they settle on our lunch,\" \"was forced to justify his methods in the press, guaranteeing that there was no trickery involved and certainly no cruelty.\""]}, {"page": "Secrets of Nature", "response": ["The Secrets of Nature series was initiated in 1922 by Harry Bruce Woolfe, a former film distributor who had established himself with successful dramatised documentaries of the First World War, such as Zeebrugge and Mons, prior to setting up British Instructional Films in 1919 with the ambition of creating popular informational films. He recruited F. Percy Smith, who had established himself alongside fellow film pioneer F. Martin Duncan on the Urban Science series for Charles Urban before the war, to head up the series. Woolfe and Smith were joined by Natural History Museum curator W.P. Pycraft, ornithologist Edgar Chance, bird photographer Walter Higham, naturalist Charles Head, fellow Charles Urban Trading Company alumni H.M. Lomas of A Trip through British North Borneo (1907), and Woolfe's old friend, ornithologist and natural history cinematography pioneer Oliver G. Pike, who had established himself before the war with In Birdland (1907) and St Kilda, its People and its Birds (1908). He also obtained assistance from the entomologist Harold Maxwell-Lefroy.", "A 1927 British 12-minute short black-and-white silent documentary film, directed and shot by F. Percy Smith, featuring the sexual elements of pollination in dandelion, globe thistle, daisy, cornflower, carline thistle and everlastings. The film was included on the 2010 BFI DVD Secrets of Nature: Pioneering Natural History Films.", "A 1927 British 13-minute short black-and-white silent documentary film, directed and shot by F. Percy Smith, featuring stop motion photography, micro-cinematography and animated sequences of mold, growing on household food such as cheese, spreading in flower-like patterns described by Total Film as \"hypnotic, like a living lava lamp pulsing across the screen.\" \"This extraordinary work of art and science, beautifully entwined,\" is described by Luke McKernan of The Bioscope, \"as close to that of avant garde animators of the period as it is to the plain exposition of science lecture.\" The film was included on the 2010 BFI DVD Secrets of Nature: Pioneering Natural History Films."]}, {"page": "Florian Pumhösl", "response": ["In 2005, Pumhösl held a solo show, Animated Map, at Neue Kunsthalle St. Gallen, Switzerland. Consisting of a film, a book, Pumhösl's Eetkamer glass paintings, and a correspondent exhibition, the project examined Pre-Columbian cotton lace from Chacay civilization, central coast of Peru (900-1532); a Picture clock (c. 1830); F. Percy Smith's film Fight for the Dardanelles (1915); László Moholy-Nagy's Schwarz-rotes Gleichgewicht (1922); the Bauhaus traveling exhibition installed by Hannes Meyer (1929); Georges Vantongerloo's Untitled (3 Concrete Studies) (c. 1931); and the former St. Gallen Public Warehouse erected in the beginning of the 20th century by Robert Maillart, and where the Neue Kunsthalle is now housed. The book, Animated Map, was published by Verlag der Buchhandlung Walter König in 2007, with texts by Peiro Aguirre, Burkhard Meltzer and Florian Pumhösl."]}, {"page": "F. Martin Duncan", "response": ["He was recruited by Charles Urban for the newly formed Charles Urban Trading Company in 1903. Together they launched a film series, The Unseen World, showcased at the Alhambra Theatre in London from 17 August 1903, which showed scenes of animal life, with particular emphasis on micro-cinematographic views. The shows were advertised as being shown by the 'Urban-Duncan Micro-Bioscope'. Among the films shown were Circulation of Blood in a Frog's Foot, Red Sludge Worms and the notorious The Cheese Mites, the views of which were preceded by a scene of a man (played by Duncan himself) horrified by what he sees when he views a piece of Stilton through a magnifying glass. Duncan continued to work for Urban until 1908, when he was succeeded by F. Percy Smith."]}, {"page": "Agnes Mary Field", "response": ["Field joined British Instructional Films in 1926, as its education manager. She went on to work for the Gaumont Film Company. In 1928, she took over from F. Percy Smith and writing, directing, and editing the Secrets of Nature , a short black-and-white documentary film series, consisting of 144 films produced by British Instructional Films, with titles including \"The Private Life of a Gull\", \"Plants of the Underworld\", and \"Mighty Atoms\".\"Secrets of Nature\", British Pathé. She traveled to the Farne Islands to film birds, and made another film at the London Zoo. The timing of her career meant that she was one of the first British women to be an established, professional film director and producer, and she oversaw the transition to sound in instructional films."]}, {"page": "Henderina Scott", "response": ["Her further slow motion time-lapse photography showed plant activity such as the opening of buds, pollination by a bee and the opening of a shoot, among others. This was substantially before the better-known early time-lapse photographs of flowers by F. Percy Smith."]}]}}