{"wiki_id": "http://www.wikidata.org/entity/Q542190", "itemLabel": "Carole Shelley", "itemDescription": "British actress (1939-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/Carole_Shelley", "wikipedia_page": {"main": "Carole Augusta Shelley (16 August 1939 – 31 August 2018) was a British actress who made her career in the United States. Her many stage roles included Gwendolyn Pigeon in The Odd Couple, the character of Madame Morrible in the original Broadway cast of the musical Wicked. She won the Tony Award for Best Actress in a Play for her performance in The Elephant Man in 1979.", "link_mentions": [{"page": "August 31", "response": ["*2018 – Carole Shelley, British-American actress (b. 1939)"]}, {"page": "Jean Anouilh", "response": ["* The Waltz of the Toreadors. Union Square Theatre (off-Broadway): 25 September 1985. Directed by Richard Russell Ramos. With Lee Richardson, Tammy Grimes, Carole Shelley, Alvin Epstein."]}, {"page": "Shelley (name)", "response": ["* Carole Shelley (1939–2018), English actress"]}, {"page": "Hercules (1997 film)", "response": ["* Amanda Plummer, Carole Shelley and Paddi Edwards as Clotho, Lachesis, Atropos, the three Fates who predict Hades' failed attempt to conquer Olympus. Nancy Beiman served as the supervising animator for the three characters."]}, {"page": "1997 in film", "response": ["| Jungle 2 Jungle || Walt Disney Pictures / TF1 International || John Pasquin (director); Bruce A. Evans, Raynold Gideon (screenplay); Tim Allen, Martin Short, Sam Huntington, Lolita Davidovich, David Ogden Stiers, JoBeth Williams, Valerie Mahaffey, Leelee Sobieski, Luis Ávalos, Frankie J. Galasso, Carole Shelley, Bob Dishy, Dominic Keating, Rondi Reed, Oni Faida Lampley || Comedy, Family || Live action", "| Hercules || Walt Disney Pictures || Ron Clements, John Musker (directors/screenplay); Barry Johnson (screenplay); Tate Donovan, Danny DeVito, James Woods, Susan Egan, Rip Torn, Samantha Eggar, Bobcat Goldthwait, Matt Frewer, Patrick Pinney, Hal Holbrook, Barbara Barrie, Amanda Plummer, Carole Shelley, Paddi Edwards, Paul Shaffer, Jim Cummings, Wayne Knight, Keith David, Charlton Heston, Lillias White, Cheryl Freeman, LaChanze, Roz Ryan, Vanéese Y. Thomas, Joshua Keaton, Roger Bart, Frank Welker, Mary Kay Bergman, Corey Burton, Kathleen Freeman, Bug Hall, Aaron Michael Metchik, Tawatha Agee, Jack Angel, Bob Bergen, Rodger Bumpass, Jennifer Darling, Debi Derryberry, Bill Farmer, Sherry Lynn, Phil Proctor, Jan Rabson, Fonzi Thornton, Erik von Detten, Robert Gant, Kellen Hathaway, Shelton Becton, Milt Grayson, Mickie McGowan, Denise Pickering, Riley Steiner, Ken Williams || Fantasy, Comedy, Family || Animation"]}, {"page": "1994 in film", "response": ["| Quiz Show || Hollywood Pictures || Robert Redford (director/screenplay); John Turturro, Rob Morrow, Ralph Fiennes, David Paymer, Paul Scofield, Hank Azaria, Christopher McDonald, Adam Kilgour, Johann Carlo, Elizabeth Wilson, Allan Rich, Mira Sorvino, George Martin, Paul Guilfoyle, Griffin Dunne, Michael Mantell, Martin Scorsese, Neil Ross, Barry Levinson, Shawn Batten, Jeffrey Nordling, Carole Shelley, Le Clonche du Rand, Calista Flockhart || Drama || Live action"]}, {"page": "1987 in film", "response": ["| The Aristocats (re-release) || Walt Disney Pictures || Wolfgang Reitherman (director); Ken Anderson, Larry Clemmons, Eric Cleworth, Vance Garry, Julius Svendsen, Frank Thomas, Ralph Wright (screenplay); Phil Harris, Eva Gabor, Liz English, Gary Dubin, Dean Clark, Scatman Crothers, Hermione Baddeley, Roddy Maude-Roxby, Sterling Holloway, Pat Buttram, George Lindsey, Paul Winchell, Lord Tim Hudson, Vito Scotti, Thurl Ravenscroft, Charles Lane, Nancy Kulp, Monica Evans, Carole Shelley, Bill Thompson, Peter Renaday, Robie Lester, Ruth Buzzi || Animation, Comedy, Adventure, Musical || Animation"]}, {"page": "1991 in film", "response": ["| The Super || 20th Century Fox / Largo Entertainment || Rod Daniel (director); Sam Simon (screenplay); Joe Pesci, Vincent Gardenia, Rubén Blades, Madolyn Smith, Stacey Travis, Carole Shelley, Kenny Blank, Steven Rodriguez, Beatrice Winde, Eileen Galindo || Comedy || Live action"]}, {"page": "1980 in film", "response": ["| The Aristocats (re-release) || Walt Disney Productions / Buena Vista Distribution || Wolfgang Reitherman (director); Ken Anderson, Larry Clemmons, Eric Cleworth, Vance Gerry, Julius Svendsen, Ralph Thomas, Ralph Wright (screenplay); Phil Harris, Eva Gabor, Sterling Holloway, Scatman Crothers, Paul Winchell, Lord Tim Hudson, Thurl Ravenscroft, Dean Clark, Liz English, Gary Dubin, Roddy Maude-Roxby, Vito Scotti, Pat Buttram, George Lindsey, Hermione Baddeley, Charles Lane, Nancy Kulp, Monica Evans, Carole Shelley, Bill Thompson, Peter Renaday, Mel Blanc, Ruth Buzzi, Robie Lester || Romance, Musical, Comedy || Live action"]}, {"page": "Helen Hayes", "response": ["In 1982, Hayes dedicated Riverside's The Shakespeare Center with New York theatre producer, Joseph Papp,Brochure of the Riverside Shakespeare Company, 1982, p. 3. and in 1985 she returned to the New York stage in a benefit for the company with a reading of A Christmas Carol with Raul Julia, Len Cariou, Mary Elizabeth Mastrantonio, Carole Shelley, Celeste Holm and Harold Scott, directed by W. Stuart McDowell.Tomasson, Robert E. \"Helping Those Who Help;Scrooge's Return\", The New York Times, November 24, 1985, p. 78 The next year Hayes performed a second benefit for the Riverside Shakespeare Company, this time at the Marquis Theatre, the construction of which had been made possible by the demolition of the Helen Hayes Theatre three years before. The production featured Rex Smith, Ossie Davis and F. Murray Abraham, and was produced by McDowell and directed by Robert Small, with Hayes narrating."]}, {"page": "Cabaret (musical)", "response": ["The Broadway production was nominated for ten Tony Awards, winning four for Cumming, Richardson and Rifkin, as well as the Tony for Best Revival of a Musical. This production featured a number of notable replacements later in the run: Jennifer Jason Leigh, Susan Egan, Joely Fisher, Gina Gershon, Debbie Gibson, Teri Hatcher, Melina Kanakaredes, Jane Leeves, Molly Ringwald, Brooke Shields, and Lea Thompson as Sally; Michael C. Hall, Raúl Esparza, Neil Patrick Harris, Adam Pascal, Jon Secada, Norbert Leo Butz and John Stamos as the Emcee; Boyd Gaines and Michael Hayden as Cliff; Tom Bosley, Dick Latessa, Hal Linden, Laurence Luckinbill, and Tony Roberts as Herr Schultz; and Blair Brown, Polly Bergen, Mariette Hartley and Carole Shelley as Fräulein Schneider.", "*Fräulein Schneider: Blair Brown, Carole Shelley, Polly Bergen, Alma Cuervo, Mariette Hartley"]}, {"page": "The Aristocats", "response": ["* Carole Shelley as Amelia Gabble – Abigail's twin sister, a goose who befriends the cats."]}, {"page": "Rue McClanahan", "response": ["In 2003, she appeared alongside Mark Hamill in the two-hander Six Dance Lessons in Six Weeks at the Coconut Grove Playhouse in Miami.  She chose not to continue with the production and was replaced by Polly Bergen for the Broadway performances.  The same year, she appeared in the musical romantic comedy film The Fighting Temptations as Nancy Stringer, which costarred Cuba Gooding, Jr., Beyoncé Knowles, Mike Epps, and Steve Harvey. On Broadway, she replaced Carole Shelley as Madame Morrible in the musical Wicked on May 31, 2005. She played the role for eight months until January 8, 2006. She was replaced by Carol Kane on January 10, 2006."]}, {"page": "Hay Fever (play)", "response": ["In a 1970 revival at the Helen Hayes Theatre, the cast included Roberta Maxwell as Sorel, Sam Waterston as Simon, Sudie Bond as Clara, Shirley Booth as Judith, John Williams as David, John Tillinger as Sandy, Marian Mercer as Myra, and Carole Shelley as Jackie."]}, {"page": "Tony Award for Best Actress in a Musical", "response": ["| Carole Shelley"]}]}}