{"wiki_id": "http://www.wikidata.org/entity/Q5423921", "itemLabel": "F. J. Foakes-Jackson", "itemDescription": "church historian", "wikipedia_url": "https://en.wikipedia.org/wiki/F._J._Foakes-Jackson", "wikipedia_page": {"main": "Frederick John Foakes Jackson (10 August 1855 – 1 December 1941) was a Church historian.  For thirty-four years he taught at Jesus College, Cambridge, serving as dean from 1895 to 1916.  Then, at the age of 61, he became the Briggs Professor of Christian Institutions at Union Theological Seminary, New York City, finally becoming emeritus in 1933.  He is probably best known for the massive five volume work The Beginnings of Christianity—an edition, translation, commentary, and study of the Acts of Apostles—that he conceived and edited with Kirsopp Lake.", "link_mentions": [{"page": "Foakes", "response": ["*F. J. Foakes-Jackson (1855–1941), Church historian"]}, {"page": "Kirsopp Lake", "response": ["He is probably best known for the massive five-volume work The Beginnings of Christianity—an edition, translation, commentary, and study of the Acts of the Apostles—that he conceived and edited with F. J. Foakes-Jackson and, among palaeographers, for the 10-volumes series of Dated Greek Manuscripts to the year 1200—edited with his second wife, Silva New—, one of the leading repertoires of facsimiles of Greek manuscripts.", "While at Harvard Lake laboured to bring forth the monumental five volume work The Beginnings of Christianity. Beginnings was a project that had been conceived during conversations with F. J. Foakes-Jackson while Lake was still at the Leiden University, sometime before 1912 (vol. v, p. vii). It sought to investigate the view \"that Christianity in the first century achieved a synthesis between the Greco-Oriental and the Jewish religions in the Roman Empire.  The preaching of repentance, and of the Kingdom of God begun by Jesus passed into the sacramental cult of the Lord Jesus Christ. But the details are complex and obscure.  What were the exact elements in this synthesis? How was it effected?\" (vol. i, p. vii). The undertaking began at Cambridge University in the form of a seminar, presided over by F. C. Burkitt.  It \"was largely attended by scholars of the most varied interests in the University, not only theological, but historical, classical, mathematical, and Oriental [...] Lake paid frequent visits from Leiden\" and \"the United States and Canada were not unrepresented\" (vol. v, p. vii). The project was to be a grand endeavour. The five volumes that were ultimately published only comprise \"Part I\". As they explain: \"Before, however, attempting to reconstruct this history we believed it necessary to study Acts in the light of the results of modern criticism. [...] Later on we hope to return to the subject and reconsider the narrative of the life of Jesus, and the influence on the Church of his own teaching and of the teaching of others about him\" (vol. ii, p. v). As it turned out they were never able to \"return to the subject\" and complete the project. \"In sum,\" writes Baird, \"The Beginnings of Christianity is a monumental work—the most extensive investigation of a NT book by English-speaking scholarship\" (cf. vol. v, p. ix).Baird, W. (2003). History of New Testament Research, vol. 2, p. 410. Minneapolis: Fortress Press."]}, {"page": "F J Foakes-Jackson", "response": ["#Redirect F. J. Foakes-Jackson "]}, {"page": "F J Foakes Jackson", "response": ["#Redirect F. J. Foakes-Jackson"]}, {"page": "Frederick John Foakes Jackson", "response": ["#Redirect F. J. Foakes-Jackson"]}, {"page": "F. J. Foakes Jackson", "response": ["#Redirect F. J. Foakes-Jackson"]}, {"page": "List of General Theological Seminary people", "response": ["* F. J. Foakes-Jackson (1855–1941), church historian"]}, {"page": "Timeline of Eastern Orthodoxy in Greece (717–1204)", "response": ["*1027 Byzantine-Fatimid treaty is concluded in 1027 between Constantine VIII and Ali az-Zahir allowing for the rebuilding of the Church of the Resurrection, permitting the emperor to select the Patriarch of Jerusalem, and to ensure that those who had unwillingly converted to Islam under al-Hakim could return to Christianity,Helene Ahrweiler, Angeliki E. Laiou. Studies on the Internal Diaspora of the Byzantine Empire. Dumbarton Oaks, 1998. p. 139.Guenter B. Risse. Mending Bodies, Saving Souls: A History of Hospitals. Oxford University Press, USA, 1999. p. 139. thus the Byzantine emperors became protectors of the Christians.F. J. Foakes-Jackson. An Introduction to the History of Christianity, A. D. 590–1314. London: Macmillan, 1921. p. 148."]}, {"page": "Isaac Newton University Lodge", "response": ["* F. J. Foakes-Jackson, Church Historian and Dean of Jesus College, Cambridgehttps://masonicperiodicals.org/periodicals/fvl/issues/fvl_20081887/page/3/articles/ar00302/?highlight=%22Isaac%20Newton%20University%20Lodge%22&from=search"]}]}}