{"wiki_id": "http://www.wikidata.org/entity/Q5423943", "itemLabel": "F. L. Lucas", "itemDescription": "British writer and scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/F._L._Lucas", "wikipedia_page": {"main": "Frank Laurence Lucas  (28 December 1894 – 1 June 1967) was an English classical scholar, literary critic, poet, novelist, playwright, political polemicist, Fellow of King's College, Cambridge, and intelligence officer at Bletchley Park during World War II.\nHe is now best remembered for his scathing 1923 review of T. S. Eliot's The Waste Land, and for his book Style (1955; revised 1962), an acclaimed guide to recognising and writing good prose. His Tragedy in Relation to Aristotle's 'Poetics' (1927, substantially revised in 1957) was for over fifty years a standard introduction. His most important contribution to scholarship was his four-volume old-spelling Complete Works of John Webster (1927), the first collected edition of the Jacobean dramatist since that of Hazlitt the Younger (1857), itself an inferior copy of Dyce (1830). Eliot called Lucas \"the perfect annotator\", and subsequent Webster scholars have been indebted to him, notably the editors of the new Cambridge Webster (1995–2007).Lucas is also remembered for his anti-fascist campaign in the 1930s, and for his wartime work at Bletchley Park, for which he received the OBE.", "link_mentions": [{"page": "Theseus", "response": ["* F. L. Lucas's epic poem Ariadne (1932) is an epic reworking of the Labyrinth myth: Aegle, one of the sacrificial maidens who accompany Theseus to Crete, is Theseus's sweetheart, the Minotaur is Minos himself in a bull-mask, and Ariadne, learning on Naxos of Theseus's earlier love for Aegle, decides to leave him for the Ideal [Dionysus]."]}, {"page": "T. E. Lawrence", "response": ["Lawrence's biographers have discussed his sexuality at considerable length and this discussion has spilled into the popular press.The Sunday Times pieces appeared on 9, 16, 23, and 30 June 1968, and were based mostly on the narrative of John Bruce. There is no reliable evidence for consensual sexual intimacy between Lawrence and any person. His friends have expressed the opinion that he was asexual,E.H.R. Altounyan in Lawrence, A. W., 1937.Knightley and Simpson, 1970, p. 29 and Lawrence himself specifically denied any personal experience of sex in multiple private letters.Brown, 1988, letters to E. M. Forster (21 Dec 1927), Robert Graves (6 Nov 1928), F. L. Lucas (26 March 1929). There were suggestions that Lawrence had been intimate with Dahoum, who worked with him at a pre-war archaeological dig in Carchemish,C. Leonard Woolley in A. W. Lawrence, 1937, p. 89 and fellow serviceman R. A. M. Guy,Wilson, 1989, chapter 32. but his biographers and contemporaries found them unconvincing.Wilson, 1989, chapter 27."]}, {"page": "Battle of the Bulge", "response": ["At Bletchley Park, F. L. Lucas and Peter Calvocoressi of Hut 3 were tasked by General Nye (as part of the enquiry set up by the Chiefs of Staff) with writing a report on the lessons to be learned from the handling of pre-battle Ultra. The report concluded that \"the costly reverse might have been avoided if Ultra had been more carefully considered\". \"Ultra intelligence was plentiful and informative\" though \"not wholly free from ambiguity\", \"but it was misread and misused\". Lucas and Calvocoressi noted that \"intelligence staffs had been too apt to assume that Ultra would tell them everything\". Among the signs misread were the formation of the new 6th Panzer Army in the build-up area (west bank of the Rhine about Cologne); the new 'Star' (signals control-network) noted by the 'Fusion Room' traffic-analysts, linking \"all the armoured divisions [assembling in the build-up area], including some transferred from the Russian front\"; the daily aerial reconnaissance of the lightly defended target area by new Arado Ar 234 jets \"as a matter of greatest urgency\"; the marked increase in railway traffic in the build-up area; the movement of 1,000 trucks from the Italian front to the build-up area; disproportionate anxiety about tiny hitches in troop movements, suggesting a tight timetable; the quadrupling of Luftwaffe fighter forces in the West; and decrypts of Japanese diplomatic signals from Berlin to Tokyo, mentioning \"the coming offensive\"."]}, {"page": "Antigone (Sophocles play)", "response": ["* 1954 – F. L. Lucas, verse translation"]}, {"page": "The Bacchae", "response": ["* F. L. Lucas, 1954: verseLucas, F. L., Greek Drama for Everyman (Dent 1954)"]}, {"page": "Protesilaus", "response": ["The poem in the Palatine Anthology (VII.141) on Protesilaus by Antiphilus of Byzantium in turn inspired F. L. Lucas's poem \"The Elms of Protesilaus\" (1927).New Statesman, 17 Dec. 1927, p.325, reprinted in The Best Poems of 1928, ed. Thomas Moult (Cape, London, 1928;  Harcourt, Brace & Co, N.Y., 1928) and included with revisions in Lucas’s Time and Memory (1929) and From Many Times and Lands (1951)"]}, {"page": "Ariadne", "response": ["* Ariadne (1932), an epic poem by F. L. Lucas."]}, {"page": "Oedipus Rex", "response": ["* F. L. Lucas, 1954 — verse"]}, {"page": "Oresteia", "response": ["* F. L. Lucas, 1954 – verse Agamemnon"]}, {"page": "The Clouds", "response": ["* F. L. Lucas, 1954 – verse"]}, {"page": "Pierre de Ronsard", "response": ["*F. L. Lucas, \"The Prince of Court-Poets\", an essay on Ronsard in Studies French and English (London, 1934), pp. 76–114. (Online. Revised edition 1950; reprinted in The Cassell Miscellany (London, 1958)."]}, {"page": "Catharsis", "response": ["F. L. Lucas opposes, therefore, the use of words like purification and cleansing to translate catharsis; he proposes that it should rather be rendered as purgation. \"It is the human soul that is purged of its excessive passions.\"Lucas, F. L. (1927) Tragedy in Relation to Aristotle's Poetics, p. 24 Gerald F. Else made the following argument against the \"purgation\" theory: It presupposes that we come to the tragic drama (unconsciously, if you will) as patients to be cured, relieved, restored to psychic health. But there is not a word to support this in the \"Poetics\", not a hint that the end of drama is to cure or alleviate pathological states. On the contrary it is evident in every line of the work that Aristotle is presupposing \"normal\" auditors, normal states of mind and feeling, normal emotional and aesthetic experience.Else, Gerald F. Aristotle's Poetics: The Argument, p. 440. Cambridge, Massachusetts (1957)"]}, {"page": "Greek Anthology", "response": ["* F. L. Lucas, A Greek Garland: A Selection from the Palatine Anthology (text of 149 poems, introduction, notes, and verse translations; Oxford, 1939)"]}, {"page": "Abyssinia Crisis", "response": ["| style=\"text-align: left;\" | [From a letter by F. L. Lucas of King's College, Cambridge, British anti-appeasement campaigner, to The Daily Telegraph, 25 July 1935]"]}, {"page": "George Crabbe", "response": ["Q. D. Leavis said of Crabbe: \"He is (or ought to be—for who reads him?) a living classic.\" His classic status was also supported by T. S. Eliot in an essay on the poetry of Samuel Johnson in which Eliot grouped Crabbe together favourably with Johnson, Pope and several other poets. Eliot said that \"to have the virtues of good prose is the first and minimum requirement of good poetry.\" Critic Arthur Pollard believes that Crabbe definitely met this qualification. Critic William Caldwell Roscoe, answering William Hazlitt's question of why Crabbe had not in fact written prose rather than verse said \"have you ever read Crabbe's prose? Look at his letters, especially the later ones, look at the correct but lifeless expression of his dedications and prefaces—then look at his verse, and you will see how much he has exceeded 'the minimum requirement of good poetry'.\" The critic F. L. Lucas summed up Crabbe's qualities: \"naïve, yet shrewd; straightforward, yet sardonic; blunt, yet tender; quiet, yet passionate; realistic, yet romantic.\" Crabbe, who is seen as a complicated poet, has been and often still is dismissed as too narrow in his interests and in his way of responding to them in his poetry. \"At the same time as the critic is making such judgments, he is all too often aware that Crabbe, nonetheless, defies classification\", says Pollard."]}, {"page": "John Webster", "response": ["*The short story 'A Christmas in Padua' in F. L. Lucas's The Woman Clothed with the Sun (1937) retells the final hours in December 1585 of Vittoria Accoramboni (the original of Webster's White Devil), slanting the narrative from her perspective."]}, {"page": "Prometheus Bound", "response": ["* F. L. Lucas, 1954 — verse"]}, {"page": "Pervigilium Veneris", "response": ["There are translations into English verse by the 17th-century poet Thomas Stanley (1651); by the 18th-century  \"graveyard school\" poet Thomas Parnell (1679-1718); by Sir Arthur Quiller-Couch in The Vigil of Venus and Other Poems by \"Q\"; by F. L. Lucas (1939; reprinted in his Aphrodite, Cambridge, 1948); and by Allen Tate (1947; see his Collected Poems)."]}, {"page": "Peripeteia", "response": ["*F. L. Lucas, \"The Reverse of Aristotle\": a discussion of Peripeteia (Classical Review, August–September 1922)"]}, {"page": "Medea (play)", "response": ["* F. L. Lucas, 1924 – verseLucas, F. L., Euripides: Medea; verse translation, with introduction and notes (Oxford University Press, 1924)"]}, {"page": "Hippolytus (play)", "response": ["*F. L. Lucas, 1954, verse "]}, {"page": "Penguin poetry anthologies", "response": ["Valentine Ackland - Rafael Alberti - Manuel Altolaguirre - W. H. Auden - George Barker - Clive Branson - J. Bronowski - Albert Brown - Roy Campbell - Maurice Carpenter - Christopher Caudwell - Richard Church - Elisabeth Cluer - John Cornford - Nancy Cunard - Charles Donnelly - Eric Edney - A. M. Elliott - Redmayne Fitzgerald - Edgar Foxall - Francis Fuentes - Roy Fuller - R. Gardner - Pedro Garfias - Geoffrey Grigson - Julio D. Guillén - Bernard Gutteridge - Hans Haflin - Charlotte Haldane - J. C. Hall - Bill Harrington - Margot Heinemann - J. F. Hendry - Miguel Hernández - Brian Howard - T. A. R. Hyndman - Luis Perez Infante - W. B. Keal - L. Kendall - H. M. King - A. S. Knowland - Laurie Lee - John Lepper - C. Day-Lewis - Jack Lindsay - F. L. Lucas - Antonio García Luque - Somhairle Macalastair - Hugh MacDiarmid - Donagh MacDonagh - Antonio Machado - Louis MacNeice - H. B. Mallalieu - Ewart Milne - Pablo Neruda - T. E. Nicholas - George Orwell - Aileen Palmer - Felix Paredes - Geoffrey Parsons - Herbert L. Peacock - José Herrera Petere - Plá y Bertran - Kathleen Raine - Herbert Read - Stanley Richardson - Edgell Rickword - J. T. Roderick - Jacques Roumain - Sagittarius - Blanaid Salkeld - Zofia Schleyen - Bernard Spencer - H. G. Sutcliffe - Luis de Tapia - Ruthven Todd - Miles Tomalin - González Tuñón - Lorenzo Varela - José Moreno Villa - Rex Warner - Sylvia Townsend Warner - Tom Wintringham - L. J. Yates"]}, {"page": "Battle of the Metaurus", "response": ["F. L. Lucas's short story \"The Fortune of Carthage\" (Athenaeum, 28 January 1921) is about the battle's prelude, from Claudius Nero's viewpoint. It focuses on the dilemma the Roman consul faced in Apulia on intercepting Hasdrubal's letter to Hannibal. The closing section gives Hannibal's perspective in the aftermath of the battle. The story was admired by T. E. Lawrence."]}, {"page": "Poems of Today", "response": ["Lascelles Abercrombie - J. Redwood Anderson - W. H. Auden - George Barker - Julian Bell - Laurence Binyon - Edmund Blunden - Cicely Boas - Guy Boas - Lilian Bowes Lyon - A. C. Boyd - Robert Bridges - Hilton Brown - Roy Campbell - G. M. Cookson - Frances Cornford - W. H. Davies - Cecil Day-Lewis - Walter De la Mare - John Drinkwater - Clifford Dyment - Richard Eberhart - Robin Flower - John Freeman - John Gawsworth - Wilfrid Gibson - Lord Gorell - C. L. Graves - I. Sutherland Groom - Thomas Hardy - Phyllis Hartnoll - Christopher Hassall - A. P. Herbert - Gerard Manley Hopkins - E. V. Knox - D. H. Lawrence - John Lehmann - F. L. Lucas - Louis MacNeice - Charles Madge - John Masefield - Huw Menai - E. H. W. Meyerstein - Harold Monro - Edwin Muir - Seán O'Casey - Wilfred Owen - Herbert E. Palmer - Ruth Pitter - Frederic Prokosch - John Pudney - Herbert Read - James Reeves - Michael Roberts - V. Sackville-West - Siegfried Sassoon - Geoffrey Scott - Edith Sitwell - Osbert Sitwell - Stephen Spender - L. A. G. Strong - Jan Struther - Dorothy Margaret Stuart - A. S. J. Tessimond - Dylan Thomas - W. J. Turner - James Walker - Rex Warner - Dorothy Wellesley - Laurence Whistler - Humbert Wolfe - W. B. Yeats - Andrew Young"]}, {"page": "Frank Lawrence Lucas", "response": ["#REDIRECT F. L. Lucas"]}, {"page": "List of University of Cambridge people", "response": ["*F. L. Lucas (King's)"]}, {"page": "Cheshire Regiment", "response": ["A night-encounter between new recruits to the Cheshires on their way to the Somme and a new Brigade of the West Kents, going the same way, was the subject of a 1935 poem by F. L. Lucas, ‘Morituri - August 1915, on the road from Morlancourt’, which ends:Lucas, F. L., Poems, 1935 (Cambridge, 1935), p.91"]}, {"page": "Battle of Bailén", "response": ["F. L. Lucas's novel The English Agent – A Tale of the Peninsular War (1969), the account of a British Army officer gathering information before the first British landings, is about the Battle of Bailén and its aftermath."]}, {"page": "Aristomenes", "response": ["Aristomenes is the hero of Messene Redeemed (1940), a verse drama by F. L. Lucas, based on Pausanias, about Messenian history."]}, {"page": "Jessie Weston (scholar)", "response": ["It also caused her to be dismissed as a theosophist by F. L. Lucas, in a hostile review of Eliot's poem. The interpretation of the Grail quest as mystical and connected to self-realisation, which she added to the anthropological layer of reading, was to become increasingly popular during the 1920s. According to Richard Barber in The Holy Grail: Imagination and Belief, the Wasteland as theme in the Grail romances is of minor importance until the last works of the cycle, and the emphasis on fertility is \"an interpretation which has haunted twentieth-century literature to a degree quite disproportionate to its basis in fact\". The book appears in the film Apocalypse Now amongst those kept by the character Kurtz, along with The Golden Bough."]}, {"page": "Farsala", "response": ["The geographer Strabo speaks of two towns, Old Pharsalos, Παλαιοφάρσαλος (Palaeopharsalos) and Pharsalos, existing in historical times. His statement (9.5.6) that the Thetideion, the temple to Thetis south of Scotussa, was “near both the Pharsaloi, the Old and the New”, seems to imply that Palaeopharsalos was not itself close by Pharsalos. Although the battle of 48 BC is called after Pharsalos, four ancient writers – the author of the Bellum Alexandrinum (48.1), Frontinus (Strategemata 2.3.22), Eutropius (20), and Orosius (6.15.27) – place it specifically at Palaeopharsalos. In 198 B.C. Philip V had sacked Palaeopharsalos (Livy 32.13.9). If that town had been close to Pharsalos he would have sacked both, and Livy would have written “Pharsalus” instead of “Palaeopharsalus”. The British scholar F. L. Lucas demonstrated (Annual of the British School at Athens, No. XXIV, 1919–21) that the battle of 48 BC must have been fought north of the Enipeus, near modern-day Krini. It has been suggestedJohn D. Morgan in “Palae-pharsalus – the Battle and the Town”, The American Journal of Archaeology, Vol. 87, No. 1, Jan. 1983 that Krini was built on the site of Palaeopharsalos, where the old road south from Larissa emerged from the hills on to the Pharsalian Plain."]}, {"page": "Buchanites", "response": ["The Buchanites are the subject of a 1937 novella by F. L. Lucas, The Woman Clothed with the Sun, which takes the form of an account, written by a Scottish minister in middle age, of his youthful bewitchment by Elspeth Buchan and of his curious sojourn in the Buchanite communes of Dumfriesshire and Kirkcudbrightshire. They are also the subject of a 2002 short story by Emma Donoghue, \"Revelations\"."]}, {"page": "Elspeth Buchan", "response": ["Buchan and her followers are the subject of a 1937 novella by F. L. Lucas, The Woman Clothed with the Sun, which takes the form of an account, written by a Scottish minister in middle age, of his youthful bewitchment by Elspeth and of his curious sojourn among the Buchanites.Lucas, F. L., The Woman Clothed with the Sun (London, 1937; New York, 1938)"]}, {"page": "F.L. Lucas", "response": ["#REDIRECT F. L. Lucas"]}]}}