{"wiki_id": "http://www.wikidata.org/entity/Q5444185", "itemLabel": "Fergus I. M. Craik", "itemDescription": "British psychologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Fergus_I._M._Craik", "wikipedia_page": {"main": "Fergus Ian Muirden Craik FRS (born 17 April 1935, Edinburgh, Scotland) is a cognitive psychologist known for his research on levels of processing in memory.  This work was done in collaboration with Robert Lockhart at the University of Toronto in 1972 and continued with another collaborative effort with Endel Tulving in 1975. Craik has received numerous awards and is considered a leader in the area of memory, attention and cognitive aging. Moreover, his work over the years can be seen in developmental psychology, aging and memory, and the neuropsychology of memory.He studied at the University of Edinburgh and gained his bachelor of science in psychology in 1960. In 1965, he received his PhD from the University of Liverpool. He began his academic career at Birkbeck College, and then moved to Toronto, Ontario, Canada to pursue an academic career at the University of Toronto in 1971.  Currently, he is a Senior Scientist at the Rotman Research Institute in Toronto. In recent times, he was elected a Fellow of the Royal Society in 2008.", "link_mentions": [{"page": "Reading comprehension", "response": ["Reading comprehension involves two levels of processing, shallow (low-level) processing and deep (high-level) processing. Deep processing involves semantic processing, which happens when we encode the meaning of a word and relate it to similar words. Shallow processing involves structural and phonemic recognition, the processing of sentence and word structure, i.e. first-order logic, and their associated sounds. This theory was first identified by Fergus I. M. Craik and Robert S. Lockhart."]}, {"page": "Levels of Processing model", "response": ["The Levels of Processing model, created by Fergus I. M. Craik and Robert S. Lockhart in 1972, describes memory recall of stimuli as a function of the depth of mental processing.  Deeper levels of analysis produce more elaborate, longer-lasting, and stronger memory traces than shallow levels of analysis. Depth of processing falls on a shallow to deep continuum. Shallow processing (e.g., processing based on phonemic and orthographic components) leads to a fragile memory trace that is susceptible to rapid decay. Conversely, deep processing (e.g., semantic processing) results in a more durable memory trace.Craik, F. I. M., & Lockhart, R. S. (1972). Levels of processing: A framework for memory research. Journal of Verbal Learning and Verbal Behavior, 11(6), 671.  "]}, {"page": "Craik", "response": ["* Fergus I. M. Craik (born 1935), Scottish psychologist"]}, {"page": "List of cognitive scientists", "response": ["* Fergus I. M. Craik"]}, {"page": "Fergus (name)", "response": ["* Fergus I. M. Craik (born 1935), Scottish cognitive psychologist"]}, {"page": "Fergus I M Craik", "response": ["#REDIRECT Fergus I. M. Craik "]}, {"page": "Fergus I.M. Craik", "response": ["#REDIRECT Fergus I. M. Craik "]}, {"page": "Fergus IM Craik", "response": ["#REDIRECT Fergus I. M. Craik "]}, {"page": "Fergus Craik", "response": ["#REDIRECT Fergus I. M. Craik"]}]}}