{"wiki_id": "http://www.wikidata.org/entity/Q5442158", "itemLabel": "Felix Cassel", "itemDescription": "British politician (1869-1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Felix_Cassel", "wikipedia_page": {"main": "Sir Felix Maximilian Schoenbrunn Cassel, 1st Baronet, PC, QC, JP (16 September 1869 – 22 February 1953) was a German-born British barrister and politician who served as Judge Advocate-General, the senior civilian lawyer of the War Office (and later also the Air Ministry) responsible for the administration of courts-martial, from 1915 to 1934.\nCassel was born into a Jewish family in Cologne, Germany. His father was Louis Schoenbrunn Cassel and his uncle was the philanthropist Sir Ernest Cassel. He was educated at Elstree School and Harrow School (1883–1888), and won a scholarship to Corpus Christi College, Oxford, where he obtained firsts in classical mods in 1891 and jurisprudence in 1892.He was called to the Bar at Lincoln's Inn in 1894 and took silk in 1906, practising in Chancery. He became a bencher of Lincoln's Inn in 1912 and treasurer in 1935.In 1907, he was elected to London County Council as Municipal Reform Party member for West St Pancras,  serving until 1910. In the December 1910 general election, he was elected to the House of Commons as Conservative member for St Pancras West, a seat he held until October 1916, when he resigned it by talking the Chiltern Hundreds. He had previously been defeated standing for Hackney Central in the January 1910 general election.In 1914, he was commissioned into the 19th (County of London) Battalion (St Pancras), London Regiment, and served in France until August 1915, when he was recalled to London to assist the Judge Advocate-General. He was promoted to the temporary rank of captain on 21 June 1915. In October 1915 he was appointed Judge Advocate-General himself, despite opposition from some MPs, who were worried about his German origins. He resigned his commission on 7 October 1916.Cassel was created a baronet in the 1920 New Year Honours. On 8 June 1937, he was sworn of the Privy Council, entitling him to the style \"The Right Honourable\".\nHe chaired the Board of Trade committee on compulsory insurance from 1935 to 1937. He was appointed an honorary fellow of Corpus Christi College, Oxford, in 1942, and was a member of the Council of Legal Education from 1943. He also took part in his family's philanthropic work, chairing the Cassel Educational Trust and the management committee of the Cassel Hospital. He was also a member of the council of the King Edward VII Sanatorium in Midhurst, Sussex. He was master of the Worshipful Company of Musicians from 1939 to 1944. He endowed three annual Cassel Scholarships at Lincoln's Inn. He was a justice of the peace for Hertfordshire and served as High Sheriff of Hertfordshire in 1942–1943.On 18 November 1908, he married Lady Helen Grimston, daughter of the Earl of Verulam, who died in 1947. They had three sons and two daughters, one of whom, Josephine, married the physiologist and mountaineer Griffith Pugh in 1939. Cassel's county estate was at Putteridge Bury, near Luton. He died in hospital at Midhurst on 22 February 1953 aged 83 and was succeeded in the baronetcy by his son, Francis (1912–1969).", "link_mentions": [{"page": "Judge Advocate General of the Armed Forces", "response": ["*7 October 1916: Sir Felix Cassel"]}, {"page": "Ernest Cassel", "response": ["Cassel's nephew was the barrister Sir Felix Cassel, who later became Judge Advocate-General to the Forces."]}, {"page": "List of Old Harrovians", "response": ["*Sir Felix Cassel (1869–1953), 1st Baronet, Judge Advocate General"]}, {"page": "List of MPs elected in the December 1910 United Kingdom general election", "response": ["| Felix Cassel "]}, {"page": "List of United Kingdom by-elections (1900–1918)", "response": ["|Felix Cassel"]}, {"page": "Putteridge Bury", "response": ["Queen Mary and King George V often visited Putteridge Bury with the Prince of Wales and on 1 December 1926 the King planted an oak tree in the lawn to the south of the house. Between the wars, it was owned by Sir Felix Cassel, the Judge Advocate-General to the Forces.Biography of Cassel, Oxford Dictionary of National Biography"]}, {"page": "List of British Jewish politicians", "response": ["*Felix Cassel (1910–1916) Conservative MP"]}, {"page": "High Sheriff of Hertfordshire", "response": ["*1942 The Rt Hon Sir Felix Cassel – Luton"]}, {"page": "Felix Maximilian Schoenbrunn Cassel", "response": ["#Redirect Felix Cassel"]}, {"page": "Sir Felix Cassel, 1st Baronet", "response": ["#REDIRECT Felix Cassel"]}, {"page": "Cassel baronets", "response": ["The Cassel Baronetcy, of Lincoln's Inn in the City of London, is a title in the Baronetage of the United Kingdom. It was created on 26 January 1920 for the lawyer and Conservative politician Felix Cassel. He was Judge Advocate General between 1915 and 1934. Cassel was succeeded by his eldest son, the second Baronet. He died unmarried and was succeeded by his younger brother, the third Baronet. He was a barrister and judge. As of 2015 the title is held by his eldest son, the fourth Baronet, who succeeded in 2001. He is the former husband of the life peer Ann Mallalieu, Baroness Mallalieu.", "*Sir Harold Felix Cassel, 3rd Baronet (1916–2001)", "The heir apparent is the present holder's only son Alexander James Felix Cassel (b. 1974)."]}, {"page": "St Pancras West (UK Parliament constituency)", "response": ["| Felix Cassel", "*Unionist: Felix Cassel", "Felix Cassel's resignation on becoming a Judge Advocate General of the Armed Forces required a by-election."]}, {"page": "Sir Felix Maximilian Schoenbrunn Cassel, 1st Baronet", "response": ["#REDIRECT Felix Cassel"]}, {"page": "Elstree School", "response": ["*Felix Cassel (1869–1953), lawyer.G. R. Rubin, ‘Cassel, Sir Felix Maximilian Schoenbrunn, first baronet (1869–1953)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, May 2008 accessed 18 Sept 2011"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Felix Cassel"]}, {"page": "List of members of London County Council 1889–1919", "response": ["| Felix Cassel"]}, {"page": "Thomas Milvain", "response": ["Milvain gave up the seat in 1905 when he was appointed Judge Advocate General, a position that he held until his death in 1916. He was succeeded by Felix Cassel who had served as his deputy. In 1912, Milvain was appointed a Companion of the Order of the Bath and was knighted."]}, {"page": "1937 Coronation Honours", "response": ["* Sir Felix Cassel, Bt., KC"]}, {"page": "Cassel (surname)", "response": ["*Felix Cassel, British Judge Advocate-General"]}, {"page": "1916 St Pancras West by-election", "response": ["The St Pancras West by-election of 1916 was held on 16 October 1916.  The by-election was held due to the resignation of the incumbent Conservative MP, Felix Cassel to become Judge Advocate General of the Armed Forces.  It was won by the Conservative candidate Richard Barnett, who was unopposedPage 44, British Parliamentary Election Results 1885–1918, edited by F. W. S. Craig due to the War-time electoral pact."]}, {"page": "1920 New Year Honours", "response": ["* Felix Cassel, , Judge Advocate-General."]}, {"page": "Griffith Pugh", "response": ["On 5 September 1939, Pugh married Josephine Helen Cassel, daughter of Sir Felix Cassel and Lady Helen Grimston, and they had four children: David Sheridan Griffith Pugh, Simon Francis Pugh, "]}, {"page": "Mary Cholmondeley, Lady Delamere", "response": ["Lady Delamere was born Ruth Mary Clarisse Ashley on 22 July 1906 in Stanmore. She was the youngest daughter of Colonel Wilfrid Ashley, 1st Baron Mount Temple and Amalia Mary Maud Cassel.L. G. Pine, The New Extinct Peerage 1884-1971: Containing Extinct, Abeyant, Dormant and Suspended Peerages With Genealogies and Arms (London, U.K.: Heraldry Today, 1972), page 202. Hereinafter cited as The New Extinct Peerage. Her older sister was Edwina Mountbatten, Countess Mountbatten of Burma. Lady Delamere's paternal grandfather, Evelyn Ashley, was Under-Secretary of State for the Colonies, a Member of Parliament, and the younger son of Anthony Ashley-Cooper, 7th Earl of Shaftesbury. Her maternal grandfather, Sir Ernest Cassel, was a Prussian-born Jewish banker and capitalist who became a British subject and converted to Catholicism. She was a first cousin of Sir Felix Cassel, 1st Baronet."]}]}}