{"wiki_id": "http://www.wikidata.org/entity/Q544064", "itemLabel": "Rhona Brankin", "itemDescription": "Scottish politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Rhona_Brankin", "wikipedia_page": {"main": "Rhona Brankin (born 19 January 1950) is a former Scottish Labour-Co-operative politician who served as the Member of the Scottish Parliament (MSP) for the Midlothian constituency. She was first elected in 1999 and was re-elected in 2003 and 2007. She was one of six female Labour MSPs to stand down in 2011.", "link_mentions": [{"page": "Scotland", "response": ["Tuition is handled by the Student Awards Agency Scotland (SAAS), which does not charge fees to what it defines as \"Young Students\". Young Students are defined as those under 25, without children, marriage, civil partnership or cohabiting partner, who have not been outside of full-time education for more than three years. Fees exist for those outside the young student definition, typically from £1,200 to £1,800 for undergraduate courses, dependent on year of application and type of qualification. Postgraduate fees can be up to £3,400. The system has been in place since 2007 when graduate endowments were abolished. Labour's education spokesperson Rhona Brankin criticised the Scottish system for failing to address student poverty."]}, {"page": "Wendy Alexander", "response": ["Organisationally, she called for a new approach to candidate selection, including primary systems to give all Labour supporters a chance to be involved in choosing their local member. Policy initiatives included establishing a Literacy Commission with Rhona Brankin to investigate child literacy standards in Scottish schoolsRebus creator turns government inspector Guardian, 24 June 2008 (subsequently embraced by all parties in the Parliament),Fifth of Scots have poor literacy BBC, 4 December 2009 supporting investment in the early years, including nursery places for all vulnerable 2-year-olds, more one-on-one tuition in schools, personalised care plans for those with chronic conditions and legislation providing for a modern apprenticeship for every qualified school leaver who sought one."]}, {"page": "Tuition fees in the United Kingdom", "response": ["The system has been in place since 2007 when graduate endowments were abolished. Labour's education spokesperson Rhona Brankin criticised the Scottish system for failing to address student poverty. Scotland has fewer disadvantaged students than England, Wales or Northern Ireland and disadvantaged students receive around £560 a year less in financial support than their counterparts in England do."]}, {"page": "Lothians (Scottish Parliament electoral region)", "response": ["| rowspan=\"3\"| Rhona Brankin(Labour)"]}, {"page": "List of breast cancer patients by survival status", "response": ["*Rhona Brankin, Scottish politician, Member of the Scottish Parliament"]}]}}