{"wiki_id": "http://www.wikidata.org/entity/Q5444255", "itemLabel": "Ferguson Rodger", "itemDescription": "British psychiatrist", "wikipedia_url": "https://en.wikipedia.org/wiki/Ferguson_Rodger", "wikipedia_page": {"main": "Thomas Ferguson Rodger CBE FRCP Glas FRCP Ed FRCPsych (4 November 1907 – 1 June 1978) was a Scottish physician who was Professor of Psychological Medicine at the University of Glasgow from 1948 to 1973, and Emeritus Professor thereafter. He joined the Royal Army Medical Corps during the Second World War and rose to become a consultant psychiatrist with the rank of Brigadier.\nHis son was Scottish lawyer Alan Rodger, Baron Rodger of Earlsferry, who became Lord President of the Court of Session and subsequently Justice of the Supreme Court of the United Kingdom.", "link_mentions": [{"page": "Alan Rodger, Baron Rodger of Earlsferry", "response": ["Alan Ferguson Rodger, Baron Rodger of Earlsferry,  (18 September 1944 – 26 June 2011) was a Scottish academic, lawyer, and Justice of the Supreme Court of the United Kingdom.", "Alan Rodger was born on 18 September 1944 in Glasgow, to Professor T Ferguson Rodger, Professor of Psychological Medicine at the University of Glasgow, and Jean Margaret Smith Chalmers, and educated at the independent Kelvinside Academy in the city. He studied at the University of Glasgow, graduating with an MA, and at the University's School of Law, taking an LLB. He then studied at New College, Oxford—under David Daube, Regius Professor of Civil Law—where he graduated with an MA (by decree) and DPhil, and was Dyke Junior Research Fellow at Balliol College, Oxford, from 1969 to 1970 and a Fellow of New College from 1970 to 1972."]}, {"page": "Michael Bond (physician)", "response": ["Upon completing his PhD in 1971, Bond was promoted to Lecturer in Neurosurgery at Glasgow. He was a locum Consultant Neurosurgeon in Oxford in 1972, and in 1973 was appointed to the Chair in Psychological Medicine at Glasgow, succeeding Professor Ferguson Rodger. Whilst continuing his research, Bond was appointed Vice-Principal of the University in 1986, and took on the additional role of Administrative Dean of the Faculty of Medicine in 1991. He stepped down from these posts in 1997, and retired from the Chair in 1998, but maintains his involvement in the University, mainly within its Alumni and Development Office. He chaired the fundraising committees for the University Medical School's new teaching accommodation, the Wolfson Medical School Building, completed in 2002, and for the Glasgow Cardiovascular Research Centre, completed in 2005. He is currently leading the appeal for the Beatson Pebble Appeal's new facilities at the Wolfson Wohl Cancer Research Centre at the University's Garscube Estate."]}, {"page": "T Ferguson Rodger", "response": ["#REDIRECTFerguson Rodger"]}, {"page": "Thomas Ferguson Rodger", "response": ["#REDIRECTFerguson Rodger"]}, {"page": "1907 in Scotland", "response": ["* 4 November – Ferguson Rodger, physician (died 1978)"]}, {"page": "War Office Selection Boards", "response": ["On a more local level, Assistant Adjutant-General Colonel Frederick Hubert Vinden observed that there was a very high failure rate at Officer Cadet Training Units (OCTUs): he visited each board in 1941, and pinpointed failings in the Command Interview Board as making poor selections of officer candidates and thus causing the failures. Psychiatrist Eric Wittkower of the RAMC had been conducting research on \"problem\" officers who had broken down or caused disruption, and concluded that these men lacked  'ability or qualities of personality adequate to withstand the stresses of their job.' When Wittkower and Vinden met in a pub after Vinden's visit to the final OCTU on his tour, the result was a discussion about how to improve officer selection by utilising psychological methods. Wittkower had been passed a copy of the selection methods used by the Wehrmacht, and so Vinden and Wittkower met with psychiatrists Thomas Ferguson Rodger, A. T. M. Wilson and Ronald Hargreaves, and the head of Scottish Command, Sir Andrew Thorne, who had been military attaché in Berlin in the 1930s and seen the German methods being used. The group made plans to experiment with and adapt these methods for use by the British Army. Army psychiatry was dominated by psychiatrists from the Tavistock Clinic, and so many figures from that organisation were involved in officer selection from the earliest experiments.", "In summer 1941, Wittkower and Ferguson Rodger conducted experiments with the German officer selection tests at the Company Commander's School in Edinburgh headed by Alick Buchanan-Smith. The procedure involved: "]}]}}