{"wiki_id": "http://www.wikidata.org/entity/Q544272", "itemLabel": "Bertie Mee", "itemDescription": "English footballer and manager (1918-2001)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bertie_Mee", "wikipedia_page": {"main": "Bertram Mee OBE (25 December 1918 – 22 October 2001) was an English footballer who played as a winger for Derby County and Mansfield Town. Mee was also a manager, noted for leading Arsenal to their first Double win in 1971.", "link_mentions": [{"page": "Arsenal F.C.", "response": ["Arsenal tentatively appointed club physiotherapist Bertie Mee as acting manager in 1966. With new assistant Don Howe and new players such as Bob McNab and George Graham, Mee led Arsenal to their first League Cup finals, in 1967–68 and 1968–69. Next season saw a breakthrough: Arsenal's first competitive European trophy, the 1969–70 Inter-Cities Fairs Cup. And the season after, an even greater triumph: Arsenal's first League and FA Cup double, and a new champions of England record. This marked a premature high point of the decade; the Double-winning side was soon broken up and the rest of the decade was characterised by a series of near misses, starting with Arsenal finishing as FA Cup runners up in 1972, and First Division runners-up in 1972–73."]}, {"page": "2001", "response": ["** Bertie Mee, English football player and coach (b. 1918)"]}, {"page": "1918", "response": ["** Bertie Mee, English football player, manager (d. 2001)"]}, {"page": "Ian Ure", "response": ["He moved south of the border in 1963 for a transfer fee of £62,500 to play for Arsenal. He only missed one match for Arsenal in his first season, but injury and a loss of form restricted his appearances in 1964–65 and 1965–66, although he still managed more than 20 matches each season. Ure was restored to the Arsenal lineup by Bertie Mee, however, and played 44 matches in 1966–67. Ure continued to feature regularly for Arsenal as the 1960s went on, but during this time made a couple of errors in 'big' matches, exemplified by his mistake in the 1969 League Cup Final versus Swindon Town, which allowed Roger Smart to score Swindon's opening goal; Swindon went on to win 3–1 after extra time."]}, {"page": "Football in Iran", "response": ["British Army XI lineup  included players such as Wilf Mannion, Migger and Bick, Bertie Mee, Jimmy McCabe."]}, {"page": "George Graham (footballer, born 1944)", "response": ["Bertie Mee's Arsenal were looking for a replacement for Joe Baker, and paid £50,000 plus Tommy Baldwin in 1966 to bring Graham to Highbury. He made his debut on 1 October 1966 at home to Leicester City, and although the result was a 4–2 defeat he immediately became a regular in the Arsenal side. He was Arsenal's top scorer in both 1966–67 and 1967–68, having started out as a centre forward for the club, but later moved back into midfield as an inside forward with John Radford moving from the wing to central striker."]}]}}