{"wiki_id": "http://www.wikidata.org/entity/Q544461", "itemLabel": "Angus Konstam", "itemDescription": "Scottish historian and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Angus_Konstam", "wikipedia_page": {"main": "Angus Konstam (born 2 January 1960) is a Scottish author and historian. Born in Aberdeen, Scotland and raised on the Orkney Islands, he has now moved back to Orkney. He has written more than a hundred books on maritime history, naval history, historical atlases, and other historical non-fiction. As well as being a widely published historian, Konstam is also regarded as one of the world's leading authorities on the history of piracy. \n\n", "link_mentions": [{"page": "Jolly Roger", "response": ["An early use of a black flag with skull, crossbones, and hourglass is attributed to pirate captain Emanuel Wynn in 1700, according to a wide variety of secondary sources.See, e.g., Angus Konstam, Pirates: 1660–1730; Douglas Botting, The Pirates; ; etcetera.  Reportedly, these secondary sources are based on the account of Captain John Cranby of HMS Poole and are verified at the London Public Record Office.", "The gallery below showing pirate flags in use from 1693 (Thomas Tew's) to 1724 (Edward Low's) appears in multiple extant works on the history of piracy.See, inter alia, Douglas Botting (1978), The Pirates,  Alexandria, VA: TimeLife Books, Inc., pp. 48–49; Angus Konstam (1999), The History of Piracy, , Italy: Lyons Press, pp. 98–101. Some of these flags are verified by contemporary accounts such as Johnson's. As to Low's flag, for instance, Johnson writes, \"Low goes aboard of this ship, [the Merry Christmas], assumes the title of admiral, and hoists a black flag, with the figure of death in red, at the main-topmast head.\" Charles Johnson (1724), A General History of the Robberies and Murders of the Most Notorious Pirates,, ed. by David Cordingly (2002), Globe Pequot, , p. 307. Likewise, Bartholomew Roberts' flag is described in the same edition of Johnson, p. 202, thus: \"The jack had a man portrayed in it, with a flaming sword in his hand, and standing on two skulls, subscribed A.B.H. and A.M.H.\"  Roberts' other flag, showing a man and a skeleton holding up an hourglass, appears in an engraving on p. 278 of Johnson's original 1724 text (reproduced here).  Kennedy's flag is as described by one of his victims, Captain J. Evans of the Greyhound Galley, according to a letter written to Johnson in the second edition of the History (1726), on p. 331 (note, however, that this capture was in 1716, and thus probably does not refer to the same Walter Kennedy who sailed first with Roberts and then on his own account from 1720–23).  For Wynn's flag, see the preceding footnote.  The origin of the flags for Blackbeard, Tew, Every, Condent, Worley and Bonnet are far more obscure.  Ed Foxe believes that the versions of the latter six pirates' Jolly Rogers shown in the secondary sources are taken from an undated, unsourced manuscript in Britain's National Maritime Museum.  All the secondary sources cited in the gallery below are in agreement except as to the background colour of Every's flag.", "File:Flag of Henry Every red.svg|Popular version of Henry Every's Jolly Roger. Reportedly, Every also flew a version with a black background.The red version of this flag appears in Angus Konstam, Pirates: 1660–1730, Oxford: Osprey Publishing Ltd., 1998, , p. 44.  Black versions appear in Botting, p. 48; Konstam, The History of Pirates, p. 99; Sherry, illustrated p. 97, ascribed p. 96."]}, {"page": "HMS Dorsetshire (40)", "response": ["Admiral John Tovey, the British commander, ordered Dorsetshire and the destroyer  to pick up survivors. A reported U-boat sighting forced the two ships to break off the rescue effort. Historians Holger Herwig and David Bercuson state that only 110 men were rescued: 85 aboard Dorsetshire and 25 aboard Maori.Bercuson & Herwig, p. 297 Historian Angus Konstam, however, writes that his research indicated a total of 116 saved, 86 on Dorsetshire (one of whom died), 25 on Maori, 3 rescued by  and a further 2 picked up by the German weather ship . "]}, {"page": "List of Aberdonians", "response": ["*Angus Konstam (born 1960), writer and historian"]}, {"page": "Military history of the Russian Empire", "response": ["The Russians, enjoying a 3 to 1 numerical advantage, expected Charles XII to wait for reinforcements before attacking; but in another daring move, the Swedish forces, under cover of a blizzard, opted instead for a surprise attack on the Russian line. Caught off-guard, thinly stretched, and vulnerable to penetration by the skilled Swedish army, the ensuing battle quickly turned into a rout, with the panicked Russian troops attempting to swim over the frigid Narova River, many drowning in its freezing waters. The remainder of the Russian troops were mopped up with ease; only three groups, Peter's elite troops and one light infantry brigade, actually put up a reasonable fighting retreat, using supply wagons as improvised defenses. The Battle of Narva, as it came to be called, was a crushing defeat for Peter's young army, with the vast majority of the Russian forces destroyed and nearly all of its siege equipment captured. The Swedes suffered only 700 casualties, while more than 6,000 Russian troops were killed and another 20,000 captured.Angus Konstam, Peter the Great's Army (1): Infantry (Osprey 1993)."]}, {"page": "Golden Age of Piracy", "response": ["Of recent definitions, that given by Pringle appears to have the widest range, an exception to an overall trend among historians from 1909 until the 1990s, toward narrowing the Golden Age.  As early as 1924, Philip Gosse described piracy as being at its height \"from 1680 until 1730.\" In his highly popular 1978 book The Pirates for TimeLife's The Seafarers series, Douglas Botting defined the Golden Age as lasting \"barely 30 years, starting at the close of the 17th Century and ending in the first quarter of the 18th.\"Douglas Botting, 1978, The Pirates, p. 20.  Botting's definition was closely followed by Frank Sherry in 1986.Frank Sherry, 1986, Raiders and Rebels: The Golden Age of Piracy, P. 7.  In a 1989 academic article, Professor Marcus Rediker defined the Golden Age as lasting only from 1716 to 1726.Marcus Rediker, 1989, \"'Under the Banner of King Death': The Social World of Anglo-American Pirates 1716–1726\", William and Mary Quarterly, ser. 3, 38 (1981), 203-227. Angus Konstam in 1998, reckoned the era as lasting from 1700 until 1730.F; Konstam, supra, p. 5.", "Perhaps the ultimate step in restricting the Golden Age was in Konstam's 2005 The History of Pirates, in which he retreated from his own earlier definition, called a 1690–1730 definition of the Golden Age \"generous,\" and concluded that \"The worst of these pirate excesses was limited to an eight-year period, from 1714 until 1722, so the true Golden Age cannot even be called a 'golden decade.'\"Angus Konstam, 2005, The History of Pirates, p. 96."]}, {"page": "Operation Catechism", "response": ["Historians hold differing views over whether the final attacks on Tirpitz were necessary. Angus Konstam has written that the battleship posed no threat to Allied shipping from April 1944 due to the damage inflicted in Operations Source and Tungsten. He argued that the subsequent attacks were motivated by Churchill and other members of the War Cabinet having an \"obsession\" with destroying Tirpitz, and that Operations Obviate and Catechism were mainly undertaken for propaganda purposes. Patrick Bishop has observed that \"the zeal of the pursuit, whipped on by Churchill, seems excessive now, but wartime created its own dynamic\", and that Operation Catechism contributed little towards ending the war. Similarly, Niklas Zetterling and Michael Tamelander have judged that although \"the British were not fully aware that the Germans had written off Tirpitz as an offensive weapon in autumn 1944, their final efforts appear almost overzealous\". The official history of British intelligence in World War II states that Dönitz's use of the battleship to tie down Allied resources was successful, and \"in her last days she briefly excelled\" in this role."]}, {"page": "Angus (given name)", "response": ["* Angus Konstam (born 1960), Scottish author and historian"]}, {"page": "Little Peter's Journey to the Moon", "response": ["In 2010 a biography of Otto Klemperer by Eva Weissweiler published in Germany stated that Peter and Anneli were based on the children of Oskar Kohnstamm, in whose sanatorium von Bassewitz had been a patient.Eva Weissweiler: Otto Klemperer: Ein deutsch-jüdisches Künstlerleben, Köln, 2010, p.85 f. Peter Kohnstamm (1908–1995) was the father of Angus Konstam."]}, {"page": "Konstam, Angus", "response": ["#REDIRECT Angus Konstam"]}]}}