{"wiki_id": "http://www.wikidata.org/entity/Q544524", "itemLabel": "Brynle Williams", "itemDescription": "Welsh politician (1949-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Brynle_Williams", "wikipedia_page": {"main": "Brynle Williams (9 January 1949 – 1 April 2011) was a North Wales Assembly Member (AM) for the Welsh Conservative Party in the National Assembly for Wales. Elected from the North Wales Regional list, he was Shadow Minister for Rural Affairs from 2007 to 2011. Williams, who was a farmer from North Wales, was a colourful political figure who was respected for his straight talking and campaigning on rural issues; although privately he admitted he never saw himself as a politician.Williams rise to prominence began in 1997–98 when he joined protesters blockading the Port of Holyhead on Anglesey over the importation of Irish beef. He later became a leader in the UK fuel protests in 2000.", "link_mentions": [{"page": "2003 National Assembly for Wales election", "response": ["| Brynle Williams"]}, {"page": "Fuel protests in the United Kingdom", "response": ["Brynle Williams who was one of the organisers of the protests later became a member of the Welsh Assembly for the Conservative party."]}, {"page": "Cilcain", "response": ["*Brynle Williams (1949–2011), Cilcain farmer and Conservative member of the National Assembly for Wales."]}, {"page": "North Wales (Senedd electoral region)", "response": ["|rowspan=\"2\"|Brynle Williams(Con)"]}, {"page": "2011 National Assembly for Wales election", "response": ["*Brynle Williams, Welsh Conservative, North Wales electoral region (died 1 April 2011)."]}, {"page": "Shambo", "response": ["On 20 August, Welsh Assembly Shadow Minister for Rural Affairs Brynle Williams said immediate action would be vital if other animals at Skanda Vale proved positive, and the assembly government said test results were due \"soon\" and that it would move \"swiftly\" if necessary. Bhakti, a fifteen-year-old Jersey bullock and Dakshini, a nine-month-old buffalo calf, which had tested positive for TB, were slaughtered on 24 August 2007."]}, {"page": "Members of the 3rd National Assembly for Wales", "response": ["| Brynle Williams"]}, {"page": "List of people with surname Williams", "response": ["*Brynle Williams (1949–2011), Welsh politician"]}, {"page": "2011 in the United Kingdom", "response": ["**Brynle Williams, Welsh politician and activist (b. 1949)"]}, {"page": "2011 in Wales", "response": ["* 1 April – Brynle Williams, politician, 62"]}, {"page": "2007 National Assembly for Wales election", "response": ["| style=\"background: #9999FF\" | Brynle Williams"]}, {"page": "Deaths in April 2011", "response": ["*Brynle Williams, 62, Welsh activist (fuel protests) and politician, AM for North Wales (from 2003)."]}, {"page": "Antoinette Sandbach", "response": ["In the 2007 Welsh Assembly election, Sandbach contested the Labour-held constituency of Delyn. She lost, but achieved a swing of 3.7% from Labour to Conservative and Labour narrowly held the seat by just 511 votes. Sandbach contested the Delyn parliamentary constituency in the 2010 general election, but lost again, though achieving a larger swing of 6.7% from Labour to Conservative. Following the death of Brynle Williams in 2011, she became a Conservative Regional Assembly Member for North Wales."]}, {"page": "List of members of the Senedd", "response": ["|Brynle Williams"]}, {"page": "Members of the 2nd National Assembly for Wales", "response": ["| Brynle Williams", "| Brynle Williams"]}, {"page": "Prescott punch", "response": ["After the incident Evans was moved away by the police and Prescott walked into the venue, with the BBC describing him as appearing to be \"clearly shaken\" by the events. In his 2008 memoir, Prezza: My Story : Pulling No Punches, Prescott recalls wondering at this point whether the incident would make the newspapers at all. He was also concerned that the video footage would not show the height advantage Evans had over him and that the reporting would portray Prescott as a \"sixteen-stone bruiser\". During the rally a convoy of vehicles drove past the theatre, honking their horns in support of the protest. The convoy was led by Brynle Williams, a leader of the 2000 fuel protests."]}]}}