{"wiki_id": "http://www.wikidata.org/entity/Q5449996", "itemLabel": "Findlay Napier", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Findlay_Napier", "wikipedia_page": {"main": "Findlay Napier (born November 1978) is a Scottish singer songwriter and teaching artist. He was a member of Scottish folk group Back of the Moon and runs music writing courses.", "link_mentions": [{"page": "Valentina Tereshkova", "response": ["In 1997, London-based electronic pop group Komputer released a song entitled \"Valentina\" which gives a more-or-less direct account of her career as a cosmonaut. It was released as a single and appears on their album The World of Tomorrow. The 2000 album Vostok 6 by Kurt Swinghammer is a concept album about Tereshkova. The 2015 album The Race for Space by Public Service Broadcasting also has a song featuring the Smoke Fairies entitled \"Valentina\". In the same year, Findlay Napier's album VIP: Very Interesting Persons included a song \"Valentina\", written in her honour by Napier and Boo Hewerdine. In 2015, a short film entitled Valentina's Dream was released by Meat Bingo Productions. The film stars Rebecca Front as Tereshkova and is based on an interview by the former cosmonaut where she expressed a desire to journey to Mars."]}, {"page": "Royal Conservatoire of Scotland", "response": ["*Findlay Napier"]}, {"page": "List of Scottish musicians", "response": ["*Findlay Napier"]}, {"page": "George C. Parker", "response": ["\"The Man Who Sold New York\", a song about George C. Parker written by Boo Hewerdine and Findlay Napier, appears on Napier's 2013 album VIP: Very Interesting Persons."]}, {"page": "Back of the Moon", "response": ["They formed in 2000 under the name Gillian Frame & Back of the Moon, with Findlay Napier joining in 2001, and signed with Foot Stompin'Records. They released their first album, Gillian Frame and Back of the Moon in 2001, after Frame won the BBC Radio Scotland Young Traditional Musician award the year before. They changed their name in 2003 to simply Back of the Moon, after releasing their second album. In 2003, they won \"Best Up and Coming Act at the Scots Trad Music Awards and \"Best Celtic Group\" at Festival Interceltique de Lorient. In 2005, they won \"Best Folk Band\" at the Scots Trad Music Awards.", "* Findlay Napier (guitar, vocals) (joined early 2001)", "* Findlay Napier (guitar, vocals)"]}, {"page": "Nancy Kerr", "response": ["* 2017: Shake the Chains (with Findlay Napier, Hannah Martin, Greg Russell and Tim Yates)"]}, {"page": "Napier (surname)", "response": ["* Findlay Napier (born 1978), Scottish musician, guitarist and songwriter"]}, {"page": "Findlay Napier and the Bar Room Mountaineers", "response": ["#REDIRECT Findlay Napier"]}, {"page": "Megan Henwood", "response": ["* The Story Song Scientists EP (2019) – with Findlay Napier"]}, {"page": "Rebecca Loebe", "response": ["|Filthy Jokes  (as Rebecca Loebe & Findlay Napier)|| EP || 2018"]}, {"page": "Edgelarks", "response": ["Martin is a singer-songwriter and multi-instrumentalist from Devon. Writing on fiddle, viola, and banjo, and drawing on UK traditions, she has been commended by Mike Harding. 2012 saw Martin selected to be part of the National Theatre's War Horse School, working with John Tams, Nancy Kerr, John Kirkpatrick and Chris Parkinson. She was also involved in The Nursery Rhyme Project for the Bristol Old Vic, co-writing and performing in a show exploring one of our oldest oral traditions. She worked with Greg Russell, Nancy Kerr, Tim Yates, and Findlay Napier on the protest song project Shake The Chains."]}, {"page": "Katie Morag (TV series)", "response": ["*Findlay Napier as Uncle Sven"]}, {"page": "Moniack Mhor", "response": ["Courses include fiction, non-fiction, poetry, playwriting, travel writing and song writing courses given by names such as Morag Joss, William McIlvanney, Carol Ann Duffy, Andrew O'Hagan, Alasdair Gray, Findlay Napier and Bella Hardy."]}]}}