{"wiki_id": "http://www.wikidata.org/entity/Q544290", "itemLabel": "Edwin Jarvis", "itemDescription": "character in Marvel Comics", "wikipedia_url": "https://en.wikipedia.org/wiki/Edwin_Jarvis", "wikipedia_page": {"main": "Edwin Jarvis is a supporting character in the Marvel Comics titles Iron Man and The Avengers. He is the loyal household butler of the Stark family. Since the 1990s, the character has appeared heavily in media adaptations of Iron Man and Avengers stories.\nIn 2012, Edwin Jarvis was ranked 25th in IGN's list of \"The Top 50 Avengers\". In the Marvel Cinematic Universe, Jarvis serves as the basis for an artificial intelligence known as J.A.R.V.I.S., voiced by Paul Bettany, while Edwin Jarvis himself was portrayed by James D'Arcy in the ABC television series Agent Carter and the 2019 film Avengers: Endgame.", "link_mentions": [{"page": "Hulk", "response": ["In the 2014 \"AXIS\" storyline, when a mistake made by the Scarlet Witch causes various heroes and villains to experience a moral inversion, Bruce Banner attended a meeting between Nick Fury Jr. and Maria Hill of S.H.I.E.L.D. and the Avengers who refused to turn over Red Skull. Later when he sided with Edwin Jarvis and tried to prevent his teammates from executing the Red Skull, the Hulk was thrown aside by Luke Cage. The Hulk's sorrow at his friends' betrayal awakened a new persona known as the bloodthirsty Kluh (described as the Hulk's Hulk, being the ruthless part of himself that even the Hulk repressed) with this new version easily defeating the Avengers, sneering that the Hulk they knew was nothing more than a \"sad piece of 'Doc Green's' ID.\" Kluh then leaves to wreak havoc, with Nova attempting to stop him after witnessing his rampage with the remaining good heroes. As with the other inverted Avengers and X-Men, Kluh was restored to Hulk when Brother Voodoo was summoned back to life by Doctor Doom so that Daniel Drumm's ghost can possess the Scarlet Witch and undo the inversion."]}, {"page": "Iron Man", "response": ["In the \"Siege\" storyline, Tony Stark is seen under the care of Dr. Donald Blake and Maria Hill when Asgard is attacked. Thor is ambushed by Osborn and the Sentry, but rescued by Hill. Osborn declares martial law and unleashes Daken and the Sentry on Broxton to root out Thor and Hill. Hill returns to Stark's hiding place to move him to a safer location and are joined by Speed of the Young Avengers, who has a set of Iron Man's MK III armor that Edwin Jarvis had given Captain America.  While Osborn is battling the New Avengers, Stark appears and disables Osborn's Iron Patriot armor. Osborn orders the Sentry to annihilate Asgard, rather than allow the Avengers to have it. After Asgard falls, Stark stands alongside his fellow heroes, as Osborn exclaims they are all doomed and he 'was saving them from him' pointing up towards a Void-possessed Sentry. As the Void tears apart the teams, Loki gives them the power to fight back through the Norn Stones. The Void kills Loki, enraging Thor. Tony tells Thor to get the Void away from Asgard, which allows Tony to drop a commandeered H.A.M.M.E.R. Helicarrier on the Void. Thor is forced to killed Sentry when the Void resurfaces. Sometime later, the Super-Human Registration Act is repealed and Tony is given back his company and armor. As a symbol for their heroics and their new unity, Thor places an Asgardian tower on Stark Tower where the Watchtower once stood.", "In Iron Man Noir, Tony Stark is an industrialist in the 1930s. He is also an adventurer, whose exploits are recorded in Marvels: A Magazine Of Men's Adventure. He is initially accompanied by his associate James Rhodes, his personal assistant Giulietta Nefaria and his biographer Vergil Munsey. When Nefaria is revealed as working with the Nazis (specifically Baron Zemo and Baron von Strucker) and Vergil is killed, their role in the story is taken by Stark's new biographer Pepper Potts. His heart having been damaged on an earlier adventure, Stark keeps it going with repulsor technology installed and recharged by Stark Industries engineer Edwin Jarvis.Iron Man: Noir #3"]}, {"page": "Electro (Marvel Comics)", "response": ["Later, separately, he was hired by the Skrull Pagon (posing as Elektra) to free Karl Lykos (also known as Sauron) from The Raft, a maximum-security prison for supervillains.New Avengers #1. Marvel Comics. After causing a riot, Electro tried to run away with his waitress girlfriend, but was captured by the New Avengers, subsequently fainting when faced with the prospect of being beaten up by Luke Cage, using Spider-Man's webbing to protect himself from Electro.New Avengers #4. Marvel Comics. Later, Electro joined Chameleon's \"Exterminators\", seeking to take advantage of Peter Parker and his loved ones. During the \"Civil War\" storyline, Electro was among the villains in Hammerhead's unnamed villain army when Iron Man and S.H.I.E.L.D. raided the hideout.Civil War: War Crimes (February 2007). Marvel Comics. In \"Secret Invasion,\" Electro appears as member of Hood's crime syndicate and attacked a Skrull force. After the Skrull posing as Edwin Jarvis kidnaps the baby of Luke Cage and Jessica Jones, the Avengers and the Fantastic Four begin going after everyone who is associated with the Skrulls. Because of this, Electro is confronted by Wolverine in an alley where, after a battle, he leaves Dillon beaten and unconscious.New Avengers #48. Marvel Comics."]}, {"page": "Enn Reitel", "response": ["Reitel does voiceovers for The X Factor. He played the Town Crier and The Maggot in Tim Burton's Corpse Bride and played Auric Goldfinger in the 2004 video game GoldenEye: Rogue Agent. It is his voice that provides the vocals on Lemon Jelly's \"Nice Weather For Ducks\" in 2002. He narrated the in-game promo spot for the Praying Mantis PMC in Metal Gear Solid 4: Guns of the Patriots. He also does Lorenzo Belli's voice from Capcom's survival horror game Haunting Ground. He was also the voice of Billy the ventriloquist dummy in James Wan's movie Dead Silence. He also provided voice performance for the audiobook of the sixth book in Eoin Colfer's Artemis Fowl series, The Time Paradox. Reitel also provided the voice for Delvin Mallory in The Elder Scrolls V: Skyrim and the Wizard Zabodon in The Big Knights. He also provided the voice of Ost Ordura in Kingdoms of Amalur: Reckoning and Alfred Pennyworth in Batman: The Telltale Series. He also played Male Altmer and Dunmer in The Elder Scrolls Online. He also provided voices of The Time Keeper in Skylanders: Swap Force, Laufey in Hulk and the Agents of SMASH, Master Ding in Kung Fu Panda: Legends of Awesomeness, Sebastian Oliver in Adr1ft, Olgan in Baten Kaitos Origins, Bootstrap Bill Turner in Pirates of the Caribbean: Dead Man's Chest, A Male Pedestrian in Infamous, Deraegis in Batman: The Brave and the Bold, Five Leaf Clover Guy, Japanese Deputy, Robertson, Boss Guraji and Fox in TripTank, Edwin Jarvis in Marvel Heroes, An English Spy in American Dad!, Billy in Dead Silence and The Dreamer in The Secret World. In May 2014, Reitel replaced Ade Edmondson as the voice of the Animal in the Peperami adverts.", "|2013||Marvel Heroes || Edwin Jarvis||"]}, {"page": "Chameleon (Marvel Comics)", "response": ["Chameleon encounters an alternate Uncle Ben from another future who has been transferred into the 'main' timelined by Hobgoblin of 2211, attempting to influence Ben to kill Edwin Jarvis for his current involvement with this timeline's May Parker by arguing that, since the multiverse means every action possible is being committed, you might as well do what feels good. When Ben rejects the suggestion, Chameleon kills and replaces him. This fools Spider-Man 2211 whom he then kills when he arrives to try to return 'Ben' to his reality. After discovering the body, Sandman's father was framed for Ben's murder, and Sandman went to Spider-Man for help."]}]}}