{"wiki_id": "http://www.wikidata.org/entity/Q545777", "itemLabel": "John Arthur Jarvis", "itemDescription": "British swimmer and water polo player", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Arthur_Jarvis", "wikipedia_page": {"main": "John Arthur Jarvis (24 February 1872 – 9 May 1933) was an English competitive swimmer who represented Great Britain in three Olympic Games, and was a well-known amateur athlete of the late 19th century and early 20th century.  He participated in Swimming at the 1900 Summer Olympics in Paris and won two gold medals in the 1000-metre and the 4000-metre freestyle events. He also won a gold medal in the water polo tournament.Jarvis was born in Leicester. He was inducted into the International Swimming Hall of Fame as an \"Honor Swimmer\" in 1968.", "link_mentions": [{"page": "May 9", "response": ["*1933 – John Arthur Jarvis, English swimmer (b. 1872)"]}, {"page": "1900 Summer Olympics", "response": ["The muddied waters of the Seine hosted the swimming events in 1900. Run with the current, the races produced very fast times by the standards of the day. John Arthur Jarvis of Great Britain, Frederick Lane of Australia and the German Ernst Hoppenberg each won two titles. Lane received a 50-pound bronze statue of a horse as a prize. A couple of unusual events were held. The obstacle race required both swimming underneath and climbing over rows of boats while Charles de Venville stayed submerged for over a minute to"]}, {"page": "Water polo at the 1900 Summer Olympics", "response": ["German sources do not list Hans Aniol, Max Hainle, or Herbert von Petersdorff as members of the Berliner Swimming Club, mentioning Gustav Erpf, Asmus Simonsen, and Max Schöne instead, but Mallon notes that there is proof contemporary to the tournament for the participation of only the former trio. Three members of the Brussels Swimming and Water Polo Club, Georges Romas, Guillaume Séron, and A. R. Upton, are also left off of some lists despite evidence that they participated in the first round. The roster for the Osborne Swimming Club of Manchester as listed by the International Olympic Committee is Thomas Coe, John Henry Derbyshire, Peter Kemp, William Lister, Arthur G. Robertson, Eric Robinson, and George Wilkinson. Lister, however, had died two weeks prior to the Games, while Derbyshire, Robinson, and Wilkinson all played water polo matches in England either during the tournament or too soon after it to have traveled back from Paris in time. A list of players contemporary to the match does not include Robertson, but does list Coe and Kemp in addition to Robert Crawshaw, William Henry, John Arthur Jarvis, Victor Lindberg, and Frederick Stapleton. Lindberg has been considered the first New Zealand Olympian, although he \"was born in Fiji to Swedish and Irish parents, lived in New Zealand from a young age and, in Paris, represented a British club.\""]}, {"page": "Alex Raisbeck", "response": ["As a reward for winning the First Division title, the Liverpool squad were sent to Paris for a team holiday where they met swimmer John Arthur Jarvis following his victory in a race in the Seine. In his later years with Liverpool, mounting injuries began to take their toll on Raisbeck's body and his appearances for the club steadily decreased each season. During the 1908–09 season, he developed a knee injury that kept him out of the first-team for four months and the extended time away from the club led him to become homesick and he eventually informed the club of his wish to return to Scotland. The club's board were initially unwilling to allow their captain to leave but relented when he told them it was for health reasons. He played his final match for the club on 30 April 1909, a 1–0 victory over Newcastle United that saw Liverpool avoid relegation. During his time at Anfield, he made 341 appearances in all competitions, scoring 19 goals."]}, {"page": "Great Britain at the 1900 Summer Olympics", "response": ["|align=left| John Arthur Jarvis || 14:28.6 || 1 Q || 13:40.2 || ", "|align=left| John Arthur Jarvis || 1:01:48.4 || 1 Q || 58:24.0 || "]}, {"page": "Swimming at the 1906 Intercalated Games", "response": ["| John Derbyshire  William Henry  John Arthur Jarvis  Henry Taylor"]}, {"page": "Swimming at the 1900 Summer Olympics – Men's 1000 metre freestyle", "response": ["The men's 1000 metre freestyle was an event on the Swimming at the 1900 Summer Olympics schedule in Paris. It was the middle length of the three freestyle events. It was held on 11 August and 12 August 1900. 16 swimmers from 6 nations competed. The event was won by John Arthur Jarvis of Great Britain. Otto Wahle of Austria took silver, while Zoltán Halmay of Hungary earned bronze.", "John Arthur Jarvis was the dominant long distance swimmer of the time, and a heavy favourite in this event. He was in the midst of a run of British titles in the 880 yard (1898-1901), mile (1897-1902) and long-distance (1898-1904)."]}, {"page": "Swimming at the 1900 Summer Olympics – Men's 4000 metre freestyle", "response": ["The men's 4000 metre freestyle was an event on the Swimming at the 1900 Summer Olympics schedule in Paris. It was the longest of the three freestyle events. It was held on 15 August and 19 August 1900. 29 swimmers from 7 nations competed. The event was won by John Arthur Jarvis of Great Britain, completing a double with the 1000 metre freestyle. Zoltán Halmay of Hungary took silver, with Louis Martin of France earning bronze.", "John Arthur Jarvis was the dominant long distance swimmer of the time and a heavy favourite in this event. He was in the midst of a run of British titles in the 880 yard (1898-1901), mile (1897-1902) and long-distance (1898-1904)."]}, {"page": "Mixed teams at the Olympics", "response": ["John Arthur Jarvis,"]}, {"page": "List of Olympic medalists in water polo (men)", "response": ["|rowspan=2 valign=top| (Osborne Swimming Club of Manchester)Thomas CoeRobert CrawshawWilliam HenryJohn Arthur JarvisPeter KempVictor Lindberg (NZL)Frederick Stapleton"]}, {"page": "Otto Wahle", "response": ["At age 20, Wahle competed in three events at the 1900 Summer Olympics in Paris, France. He competed in the 200 metre freestyle and won his heat, but, for an unknown reason, he did not compete in the final. He also entered the 1000 metre freestyle; in his heat he came second behind Hungarian swimmer Zoltán Halmay, but he still qualified for the final the next day. In the final he was beaten by John Arthur Jarvis from Great Britain but finished ahead of Halmay to win the silver medal. Wahle also won a silver medal in the 200 metre obstacle event. After winning his heat, Wahle missed the gold medal by under two seconds to Australian swimmer Frederick Lane."]}, {"page": "Otto Scheff", "response": ["Scheff was born in Berlin, he was still at school in 1906 and it was only for the intervention of the Austrian Olympic Committee he was allowed three weeks leave to compete in the 1906 Intercalated Games in Athens. At those Games he competed in three events, first up was the 1 mile freestyle race, it was a straight final with Scheff coming in third for the bronze medal behind winner Henry Taylor and second place John Arthur Jarvis both from Great Britain, three days later Scheff got revenge on the two British swimmers by winning the gold medal by two seconds in the 400 metre freestyle, he was also part of the 4×250 metre freestyle relay team, but they didn't finish the race."]}, {"page": "List of people from Leicester and Leicestershire", "response": ["*John Arthur Jarvis (swimmer, 1900 Olympic medallist)"]}, {"page": "John Jarvis", "response": ["*John Arthur Jarvis (1872–1935), British swimmer"]}, {"page": "Index of World War II articles (J)", "response": ["# John Arthur Jarvis"]}, {"page": "Jarvis (name)", "response": ["** John Arthur Jarvis (1872–1933), swimmer"]}, {"page": "History of swimming", "response": ["The second Olympic games in Paris in 1900 featured 200 m, 1000 m, and 4000 m freestyle, 200 m backstroke, and a 200 m team race (see also Swimming at the 1900 Summer Olympics). There were two additional unusual swimming events (although common at the time): an obstacle swimming course in the Seine river (swimming with the current), and an underwater swimming race. The 4000 m freestyle was won by John Arthur Jarvis in under one hour, the longest Olympic swimming race until the 10k marathon swim was introduced in 2008. The backstroke was also introduced to the Olympic Games in Paris, as was water polo. The Osborne Swimming Club from Manchester beat club teams from Belgium, France and Germany quite easily."]}, {"page": "John Jarvis (swimmer)", "response": ["#REDIRECT John Arthur Jarvis"]}, {"page": "Mixed team at the 1900 Summer Olympics", "response": ["|John Arthur Jarvis (GBR)"]}, {"page": "James H. Tyers", "response": ["Tyers' primary competition included John Derbyshire and John Arthur Jarvis.  In 1896, Tyers received a suspension for using \"strong language\" at a meet.Whitaker, Joseph. An Almanack for the Year of Our Lord 1897, p. 646 (1896)  Tyers became a professional in 1898.(23 April 1898). J.H. Tyers, Sydney Morning Herald"]}, {"page": "Joseph Nuttall", "response": ["Other notable English swimmers of Nuttall's time included James H. Tyers, John Derbyshire, and John Arthur Jarvis.  Nuttall also had notable races against English swimmer James Finney (in 1890), American swimmer James L. McCusker (including in 1893 and 1904), and Australians Ernest Cavill in 1894 and his brother Percy Cavill in 1904.(23 February 1905). Nuttall and Cavill to Meet, Daily Miami MetropolisLambie, James. The Story of Your Life: A History of the Sporting Life Newspaper (1859-1998), p. 179 (2010) (relating story of August 19, 1893 one mile match between McCusker and Nuttall)"]}, {"page": "List of 1900 Summer Olympics medal winners", "response": ["|rowspan=2 valign=top| (Osborne Swimming Club of Manchester)Thomas CoeRobert CrawshawWilliam HenryJohn Arthur JarvisPeter KempFrederick Stapleton"]}]}}