{"wiki_id": "http://www.wikidata.org/entity/Q5451084", "itemLabel": "Fiona McIntosh", "itemDescription": "fencer, writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Fiona_McIntosh_(fencer)", "wikipedia_page": {"main": "Fiona McIntosh (born 24 June 1960) is a Scottish writer and retired fencer.", "link_mentions": [{"page": "Great Britain at the 1984 Summer Olympics", "response": ["* Fiona McIntosh", "* Ann Brannon, Linda Ann Martin, Fiona McIntosh, Liz Thurley, Katie Arup"]}, {"page": "Great Britain at the 1988 Summer Olympics", "response": ["* Fiona McIntosh", "* Ann Brannon, Linda Ann Martin, Fiona McIntosh, Linda Strachan, Liz Thurley"]}, {"page": "Great Britain at the 1992 Summer Olympics", "response": ["* Fiona McIntosh", "* Fiona McIntosh, Linda Strachan, Julia Bracewell, Amanda Ferguson, Sarah Mawby"]}, {"page": "Great Britain at the 1996 Summer Olympics", "response": ["* Fiona McIntosh"]}, {"page": "British Fencing Association", "response": ["* Fiona McIntosh, four-time British foil Champion, winner of the 1990 Commonwealth Fencing Championships and a total of 12 Commonwealth medals, four-time Olympian and finalist in Barcelona 1992, author and magazine writer"]}, {"page": "List of fencers", "response": ["* Fiona McIntosh, four-time British foil Champion, winner of the 1990 Commonwealth Fencing Championships and a total of 12 Commonwealth medals, four-time Olympian and finalist in Barcelona 1992, author and magazine writer"]}, {"page": "Fiona McIntosh", "response": ["Fiona McIntosh (born 1960) is an English-born Australian author of adult and children's books. She was born in Brighton, England and between the ages of three and eight, travelled a lot to Africa due to her father's work. At the age of nineteen, she travelled first to Paris and later to Australia, where she has lived ever since. In 2007, she released a crime novel, Bye Bye Baby, under the pen name of Lauren Crow; however, the pen name was dropped for the republished edition of Bye Bye Baby and for the sequel, Beautiful Death.", "* Fiona McIntosh's website", "* Fiona McIntosh's Facebook Page"]}, {"page": "Fencing at the 1984 Summer Olympics – Women's foil", "response": ["| Fiona McIntosh|| "]}, {"page": "Fencing at the 1984 Summer Olympics – Women's team foil", "response": ["* Fiona McIntosh"]}, {"page": "Richard Kruse", "response": ["He made his Olympic debut at the 2004 Games in Athens, Greece. Competing in the men's individual foil. He received a bye in the first round, beat China's Wang Haibin in round two and Dan Kellner of the United States in the third round before being defeated 8–15 by Andrea Cassarà in the quarter-finals. His eighth-place finish was the best by a British fencer since the 1992 Summer Olympics in Barcelona, when Fiona McIntosh was eighth in the women's foil, and the best by a British man since the 1964 Summer Olympics in Tokyo, when Bill Hoskyns won the silver medal in the individual épée. In 2006 Kruse won the silver medal in the men's foil event at the European Fencing Championships."]}, {"page": "Fencing at the 1988 Summer Olympics – Women's foil", "response": ["| Fiona McIntosh|| "]}, {"page": "Fencing at the 1988 Summer Olympics – Women's team foil", "response": ["* Fiona McIntosh"]}, {"page": "Fencing at the 1992 Summer Olympics – Women's foil", "response": ["| 33 (32) ||align=left| Fiona McIntosh||align=left|  || 7 || 5 || 2 || 3 || .400 || 15 || 20 || -5 || ", "| 4 || – || – || 32 ||align=left| Fiona McIntosh ||align=left| ", "| Fiona McIntosh|| "]}, {"page": "Fencing at the 1992 Summer Olympics – Women's team foil", "response": ["* Fiona McIntosh"]}, {"page": "Fencing at the 1996 Summer Olympics – Women's foil", "response": ["| 34 || Fiona McIntosh|| "]}, {"page": "List of alumni of Fitzwilliam College, Cambridge", "response": ["*Fiona McIntosh — fencer"]}]}}