{"wiki_id": "http://www.wikidata.org/entity/Q545038", "itemLabel": "William Thomas Blanford", "itemDescription": "British geologist and naturalist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Thomas_Blanford", "wikipedia_page": {"main": "William Thomas Blanford  (7 October 1832 – 23 June 1905) was an English geologist and naturalist. He is best remembered as the editor of a major series on  The Fauna of British India, Including Ceylon and Burma.", "link_mentions": [{"page": "List of biologists", "response": ["*William Thomas Blanford (1832–1905), English geologist and naturalist,Abbreviation in zoology: Blanford editor of The Fauna of British India, Including Ceylon and Burma."]}, {"page": "Jungle cat", "response": ["In 1836, Brian Houghton Hodgson proclaimed the red-eared cat commonly found in Nepal to be a lynx and therefore named it Lynchus erythrotus; Edward Frederick Kelaart described the first jungle cat skin from Sri Lanka in 1852 and stressed upon its close resemblance to Hodgson's red cat. William Thomas Blanford pointed out the lynx-like appearance of cat skins and skulls from the plains around Yarkant County and Kashgar when he described Felis shawiana in 1876."]}, {"page": "Pallas's cat", "response": ["'Manul' is the Pallas's cat's name in the Kyrgyz language. It is called 'manol' in the Mongolian language. The common name 'Pallas's cat' was coined by William Thomas Blanford in honour of Peter Simon Pallas. The alternate spelling 'Pallas' cat' is also used."]}, {"page": "Wollaston Medal", "response": ["*1883 William Thomas Blanford"]}, {"page": "Agamura", "response": ["Category:Taxa named by William Thomas Blanford"]}, {"page": "Bunopus", "response": ["Category:Taxa named by William Thomas Blanford"]}, {"page": "List of ornithologists", "response": ["*William Thomas Blanford – England"]}, {"page": "Timeline of ornithology", "response": ["*1889 (– 1898) –  Eugene William Oates and William Thomas Blanford publish the bird volumes of The Fauna of British India, Including Ceylon and Burma."]}, {"page": "1883 in science", "response": ["* Wollaston Medal for Geology: William Thomas Blanford"]}]}}