{"wiki_id": "http://www.wikidata.org/entity/Q545303", "itemLabel": "Dean Saunders", "itemDescription": "Welsh association football player and manager (born 1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dean_Saunders", "wikipedia_page": {"main": "Dean Nicholas Saunders (born 21 June 1964) is a Welsh football manager and former professional footballer.\nAs a player, he as a striker in a career which lasted from 1982 until 2001. He played for Liverpool and Aston Villa in the 1990s, and set a new British transfer record when he joined the former from Derby County. He began at his hometown club Swansea City before also playing for Brighton, Oxford United, Bradford City, Nottingham Forest and Sheffield United as well as spells at Galatasaray and Benfica. He was capped 75 times at senior level for Wales between 1986 and 2001, scoring 22 times, making him one of the nation's highest-scoring and most-capped players of all time, although Wales never qualified for any major international competitions while Saunders was playing for them.\nFollowing his retirement from playing in 2001, he entered football coaching and then management, firstly of Wrexham and since then of Doncaster Rovers, Wolverhampton Wanderers, Crawley Town and Chesterfield.", "link_mentions": [{"page": "June 21", "response": ["*  1964   – Dean Saunders, Welsh footballer and manager"]}, {"page": "Oxford", "response": ["They play at the Kassam Stadium (named after former chairman Firoz Kassam), which is near the Blackbird Leys housing estate and has been their home since relocation from the Manor Ground in 2001. The club's notable former managers include Ian Greaves, Jim Smith, Maurice Evans, Brian Horton, Ramon Diaz and Denis Smith. Notable former players include John Aldridge, Ray Houghton, Tommy Caton, Matt Elliott, Dean Saunders and Dean Whitehead. Oxford City F.C. is a semi-professional football club, separate from Oxford United. It plays in the Conference South, the sixth tier, two levels below the Football League in the pyramid. Oxford City Nomads F.C. was a semi-professional football club who ground-shared with Oxford City and played in the Hellenic league."]}, {"page": "1964", "response": ["** Dean Saunders, Welsh football manager and former professional footballer"]}, {"page": "Wolverhampton Wanderers F.C.", "response": ["Following relegation, Norwegian Ståle Solbakken became the club's first overseas manager but his tenure lasted only six months before a poor run of results saw him replaced by Dean Saunders in January 2013. Saunders failed to bring any upturn, culminating in both the club's relegation to EFL League One, a level the club had not played at since 1989, and Saunders's own dismissal. Following this, Kenny Jackett was appointed in May 2013 in the retitled position of head coach, and led the team back to the EFL Championship in his first season, setting a new club record points total of 103 which is also an all-time record for the most points accumulated by any team during a Tier 3 season."]}, {"page": "Peter Shilton", "response": ["Shilton helped the Derby side of Mark Wright, Dean Saunders and Ted McMinn finish fifth in the league, and they only missed out on competing in the UEFA Cup due to the ban on English clubs in European competition (which ran from 1985 to 1990) arising from the Heysel disaster. In 1991, Derby were relegated and Shilton started to consider his playing future. He was 42 years old and was ready to become a coach or manager. In early 1991, he had rejected an offer to replace Stan Ternent as Hull City manager for geographical reasons."]}, {"page": "Wrexham A.F.C.", "response": ["The 2008–09 season started well, with a 5–0 home victory against Stevenage Borough, however a run of poor results followed, with Wrexham being left in the mid-table battle, only four points above the relegation zone and only keeping two clean sheets all season. Following a 3–0 home defeat against Rushden and Diamonds, and fans calling for his dismissal, Little left Wrexham by mutual consent. Since then, Dean Saunders has taken over the management of Wrexham, with his first game against Forest Green Rovers ending in a victory. Wrexham's first full season in the Conference Premier ended in a disappointing 10th place. The following year, 2009–10, ended in a similar fashion with Wrexham finishing in 11th position, well off the pace of the promotion battle.", "* 2008–2011 Dean Saunders"]}, {"page": "Chesterfield F.C.", "response": ["|Dean Saunders|| Welsh||2015"]}, {"page": "Peterborough United F.C.", "response": ["thumb|left|Chart of table positions for Peterborough since joining the Football League.The following season arguably remains the most successful in the club's history. After an inconsistent start the team hit form during the Autumn when they knocked Wimbledon and Newcastle United out of the League Cup. The reward was a home tie with a Liverpool team containing Bruce Grobbelaar, Jan Mølby, Steve McManaman, Dean Saunders and Mark Wright. Garry Kimble scored the only goal after 19 minutes prompting wild celebrations and a place in the quarter-finals. In the league, the team went from strength to strength and surged up the table. Middlesbrough ended the League Cup run after a replay and there was further disappointment when the team missed out on a trip to Wembley in the Football League Trophy when they lost to Stoke City over two legs in the area final."]}, {"page": "Doncaster Rovers F.C.", "response": ["Rovers struggled in the 2011–12 season; seven games into the season, Rovers failed to win a game ( no wins, one draw, six losses). This led to the sacking of manager Sean O'Driscoll and assistant manager Richard O'Kelly. On 23 September 2011, Dean Saunders was unveiled as the new boss, leaving Wrexham. His reign started unbeaten in three games. With the controversial help of football agent Willie McKay, Rovers brought in several players on loans and short-term contracts, and on low wages, including El Hadji Diouf, Pascal Chimbonda, Herita Ilunga, Carl Ikeme, Frédéric Piquionne, and Habib Beye. However, Doncaster were relegated to League One with three games still to play. Many supporters blamed the failure to stay in the Championship on McKay's involvement, others felt it was worth the try. At the end of the 2011–12 season, chairman John Ryan deemed the McKay \"experiment\" over as it \"didn't work\" and \"wouldn't work in the third tier\" anyway."]}, {"page": "Oxford United F.C.", "response": ["Former Liverpool defender Mark Lawrenson was named as Oxford's new manager, but was unable to prevent relegation to the Second Division. He was sacked three months into the 1988–89 Second Division campaign after a dispute with the chairman over the £1 million sale of striker Dean Saunders to Derby County;Brodetsky pp.79–80 Derby were owned by Robert Maxwell, father of the then Oxford United chairman, Kevin Maxwell. Following Robert Maxwell's death in 1991, his personal estate, including the club, became insolvent.Brodetsky p.83 After a long search for a new owner, during which BioMass Recycling Ltd took over the club, Brian Horton was named as Oxford's new manager. He remained in charge until September 1993, when he moved to Manchester City in the recently formed FA Premier League. Horton led United to mid-table finishes during his management spell, apart from a 21st-place finish at the end of the 1991–92 season. A 2–1 win over Tranmere Rovers, and a win for Blackburn Rovers over Plymouth Argyle, meant United survived relegation by two points. Oxford, now in the renamed Football League Division One, briefly restored Maurice Evans as manager, before turning to Bristol City manager Denis Smith. Despite Smith's efforts, Oxford was relegated to Division Two at the end of the 1993–94 season, with just four wins in the last eleven games."]}, {"page": "John Gregory (footballer)", "response": ["On 27 December 2014, after being Crawley Town manager for just over a year Gregory stepped down as manager due to health problems; on the same day Crawley Town named Welsh former international and former Wolverhampton Wanderers manager Dean Saunders as interim manager."]}, {"page": "Wales national football team", "response": ["|align=\"left\"|Dean Saunders", "|align=\"left\"|Dean Saunders"]}, {"page": "Football in England", "response": ["The early Premier League years saw the transfer record fee in English football broken many times in a relatively short period of time, and rise at a rate barely comparable with even that of the late 1970s. The biggest fee paid by an English club during the Football League era was the £2.9million paid by Liverpool for Dean Saunders in July 1991. The national record was broken the following summer when Blackburn Rovers paid £3.3million for Alan Shearer. The national record was broken again in June 1993 when Manchester United signed Roy Keane for £3.75million. Blackburn then broke the national record in the 1994 close season by signing 21-year-old Norwich City striker Chris Sutton for £5million. In 1995, the record fee was broken three times in the space of six months. At the turn of the year, Andy Cole arrived at Manchester United in a deal worth £7million. After the season's end, Arsenal paid £7.5million to Inter Milan for Dutch forward Dennis Bergkamp, but Bergkamp had just spent days with his new club when Liverpool paid £8.5million for Nottingham Forest striker Stan Collymore. A year later, Alan Shearer became the most expensive player not only in England but in the world when he left Blackburn Rovers to sign for Newcastle United in a £15million deal. This fee, however, remained unsurpassed for more than four years."]}, {"page": "Niall Quinn", "response": ["His most notable game for City was 20 April 1991 when he scored early on and saved a penalty as City beat Derby County 2–1, relegating Derby in the process.Who has saved and scored a penalty in the same match?, The Guardian, 20 October 2004 City goalkeeper Tony Coton had been sent off before half time for fouling Dean Saunders to concede the penalty. At this time teams rarely named goalkeepers as substitutes, so Quinn replaced Coton in goal. Other notable games included the Manchester derby on 7 November 1993, in which he scored twice in the first half to put City 2–0 up against United by half time, although a remarkable United comeback saw City lose 3–2."]}, {"page": "Crawley Town F.C.", "response": ["The 2014–15 season saw Crawley struggle for form, and Gregory resigned for health reasons near the end of 2014, with the club in the relegation zone. Dean Saunders was appointed to replace him on an interim basis, and despite an upturn in form, was unable to get the club out of trouble. On Sunday 3 May 2015, Crawley were relegated to League Two, following a 1–2 defeat at home to Coventry City. Saunders' short-term deal was not renewed after the season ended, and he was replaced by Mark Yates."]}, {"page": "Mark Lawrenson", "response": ["After his time at Liverpool, he was appointed Oxford United manager in 1988. His time at the club was frustrating and he resigned after star striker Dean Saunders was sold by the board of directors without Lawrenson's approval. Over that winter, he made a brief playing comeback in the Football Conference, making two appearances for Barnet. Lawrenson also managed Peterborough United from 6 September 1989 until 9 November 1990."]}, {"page": "Romania national football team", "response": ["Romania was successful, however, in reaching another World Cup in the United States in 1994. Despite losing in Belgium and suffering a heavy 5–2 defeat in Czechoslovakia, Romania went into their last match at Cardiff Arms Park with Wales needing a win to pip them to a place in the finals. Goals from Gheorghe Hagi and Dean Saunders meant the game was finely balanced, before Wales were awarded a penalty. Paul Bodin of Swindon Town stepped up but hit the woodwork and Romania went on to win 2–1, Florin Răducioiu's late goal proving unnecessary as Czechoslovakia dropped a point in Belgium and were eliminated."]}, {"page": "Robin Friday", "response": ["Friday's style of play was based around his exceptional ball skills, described by Cardiff doctor Leslie Hamilton as \"absolutely fabulous\", and his instinctive footballing vision, which enabled him both to execute flamboyant individual moves and to create attacks for his teammates. Jimmy Andrews, his manager at Cardiff, later called Friday \"the complete centre-forward\" and placed him on a par with Alan Shearer, while Maurice Evans claimed that he could have played for England, and was at least on a level with international strikers he had worked with such as John Aldridge and Dean Saunders. This opinion was shared by Hamilton and Friday's Reading teammate John Murray, both of whom firmly declared in separate interviews that Friday would have been good enough for the England team had he \"sorted his head out\", in Hamilton's words."]}, {"page": "Graeme Souness", "response": ["Souness took over at Anfield just before Liverpool surrendered their defence of the English league title to Arsenal. He made a major reorganisation of the squad in his first six months as manager, bringing in Dean Saunders for an English record of £2.9 million as well as defenders Mark Wright and Rob Jones and midfielder Mark Walters. He also gave a regular place in the team to 19-year-old midfielder Steve McManaman, whose debut had come under Dalglish in December 1990, and a debut to one of Dalglish's last signings, teenage midfielder Jamie Redknapp. And at the end of that campaign, he gave a professional contract to 17-year-old striker Robbie Fowler.", "1992–93 was an even more frustrating season for Souness. Just after the start of the season, he sold Dean Saunders to Aston Villa. While Saunders was a key player in Villa's near-successful title challenge, his successor Paul Stewart proved to be a huge disappointment, scoring just one league goal from 32 appearances over the next two seasons, struggling with injuries as well as inconsistent form. Top scorer Ian Rush was having a difficult time getting goals, and Liverpool spent most of the season in the bottom half of the table. They entered March still only in 15th place, but an excellent final quarter of the season, in which Rush scored 11 Premier League goals, saw them finish sixth. This time there was no success in any of the cup competitions, meaning that there would be no European action for Liverpool in the 1993-94 season. Aside the six seasons when Liverpool were banned from European competitions, this was the first time since 1963 that Liverpool had failed to qualify for Europe.", "In November 1997, Souness was appointed by Benfica's new chairman João Vale e Azevedo, who promised to return the club to its former glory. The Scottish manager brought several British players from the Premier League, including defenders Steve Harkness and Gary Charles, midfielders Michael Thomas and Mark Pembridge and forwards Dean Saunders and Brian Deane, as well as refusing to sign emerging talent Deco. 18 months later, Souness left the club and stated, \"Vale e Azevedo lies when he looks in the eyes. Be careful, this man is dangerous.\""]}, {"page": "Peter Beardsley", "response": ["Liverpool were top of the league at this stage, but in the new year were overhauled by Arsenal and the title went to Highbury at the end of the season. And with the arrival of Dean Saunders for a national record fee of £2.9 million after the end of the season, Beardsley's days at Anfield were looking even more numbered, despite the sale of David Speedie."]}, {"page": "John Bond (footballer)", "response": ["In December 1984 he was appointed manager of Swansea City who were struggling to avoid being relegated from the First to Fourth Divisions in successive seasons. He immediately released some of the younger players (most notably Dean Saunders) to bring in some older heads. They ended the season just one place clear of relegation, but the following season started badly and with the Swans on the brink of bankruptcy, Bond left on 20 December 1985 and Swansea were relegated at the end of the season to complete their demise since the John Toshack era."]}, {"page": "Chris Kirkland", "response": ["Kirkland was going to join Cardiff City on emergency loan, in February 2011, as cover for goalkeeper Tom Heaton but the deal fell through after he picked up a virus. On 12 October 2011, Kirkland joined Championship Doncaster Rovers on loan until January after attracting interest from new manager Dean Saunders. However, after less than a week into his loan spell at the Keepmoat Stadium, Kirkland was sent back to parent club Wigan following another back spasm."]}, {"page": "Ronny Rosenthal", "response": ["During the 1990–91 season, Rosenthal faced continued fierce competition for a place in the first team from Liverpool's established strikers Ian Rush and Peter Beardsley, and then from mid-season signing David Speedie. He played 16 times in the league, and scored five goals as Liverpool finished second in the league. In 1991–92, Rosenthal played 20 times in the league, but it was a frustrating league campaign for both player and club, as the Reds finished sixth in the league and Rosenthal only found the net three times. Liverpool did win the FA Cup that season, but Rosenthal was not selected for the final. Despite the pre-season departure of both Speedie and Beardsley, Rosenthal was now faced with competition for a place from new signing Dean Saunders. 1992–93 was slightly better, as Rosenthal played 27 games in the new Premier League, and scored six goals, but it was another frustrating season for Liverpool, who finished sixth in the league once again and spent most of the season occupying even lower positions. Saunders had been sold to Aston Villa early in the season, while new signing Paul Stewart proved to be a major disappointment. A memorable occasion during that first Premier League season came when Rosenthal hit the crossbar with a shot on an open goal in a league match against Aston Villa."]}, {"page": "1992–93 FA Premier League", "response": ["Shortly before the season began, newly promoted Blackburn Rovers signed Southampton's 21-year-old England international striker Alan Shearer for a new British record fee variously reported as £3.3 million, £3.4 million, or £3.6 million. Several other players moved for fees of £2 million or more, including Arsenal's David Rocastle, who joined Leeds United, Dean Saunders, who moved from Liverpool to Aston Villa, and Teddy Sheringham, who left Nottingham Forest for Tottenham Hotspur."]}, {"page": "John Toshack", "response": ["In November 2004, Toshack was appointed as manager of the Wales national team for the second time after being named as the \"unanimous\" choice of the FAW. He was named in a three-man shortlist for the role alongside Frenchman Philippe Troussier and Welsh former international player Dean Saunders. Toshack's appointment was unpopular with some senior players with Robbie Savage claiming he could face a player mutiny if appointed. In total, seven players announced their international retirement within months of Toshack's appointment, including Savage, captain Gary Speed, who had been critical of Toshack's opinions previously, Mark Pembridge and Andy Melville. Former Wales manager Mark Hughes also questioned Toshack's suitability for the role, stating that UEFA coaching qualifications which Toshack did not possess should be considered a prequisite for the job."]}, {"page": "Dalian Atkinson", "response": ["Atkinson joined Aston Villa for £1.6 million in July 1991, and became one half of another impressive partnership alongside Dean Saunders, when Saunders arrived from Liverpool a year after Atkinson arrived there from Real Sociedad. The partnership was broken up in 1995 when both players were sold to Turkish clubs – Saunders to Galatasaray and Atkinson to Fenerbahçe for £1.7 million."]}]}}