{"wiki_id": "http://www.wikidata.org/entity/Q545807", "itemLabel": "Thomas of Britain", "itemDescription": "Old French poet,  author of a Tristan", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_of_Britain", "wikipedia_page": {"main": "Thomas of Britain (also known as Thomas of England) was a poet of the 12th century. He is known for his Old French poem Tristan, a version of the Tristan and Iseult legend that exists only in eight fragments, amounting to around 3,300 lines of verse, mostly from the latter part of the story. It is calculated that this represents about one sixth of the original.", "link_mentions": [{"page": "List of French-language poets", "response": ["*Thomas of Britain"]}, {"page": "Thomas the Rhymer", "response": ["He is often cited as the author of the English Sir Tristrem, a version of the Tristram legend, and some lines in Robert Mannyng's Chronicle may be the source of this association. It is not clear if the name Rhymer was his actual surname or merely a sobriquet.. \"Robert de Brunne\" here is another name for Robert Mannyng. Scott goes on to quote another source from a manuscript in French, but Thomas of \"Engleterre\" is likely Thomas of Britain."]}, {"page": "Matter of Britain", "response": ["|Thomas of Britain||12th||Tristan and Iseult"]}, {"page": "Tristan", "response": ["Tristan (Latin/Brythonic: Drustanus; ), also known as Tristram or Tristain and similar names, is the hero of the legend of Tristan and Iseult. In the legend, he is tasked with escorting the Irish princess Iseult to wed Tristan's uncle, King Mark of Cornwall. Tristan and Iseult accidentally drink a love potion during the journey and fall in love, beginning an adulterous relationship that eventually leads to Tristan's banishment and death. The character's first recorded appearance is in retellings of British mythology from the 12th century by Thomas of Britain and Gottfried von Strassburg, and later in the Prose Tristan. He is featured in Arthurian legends, including the seminal text Le Morte d'Arthur, as a skilled knight and a friend of Lancelot.", "Most early versions fall into one of two branches: the \"courtly\" branch represented in the retellings in Thomas of Britain's Tristan and his German successor Gottfried von Strassburg, and in the Folie Tristan d'Oxford; and the \"common\" branch, including the works of medieval French literature. ", "Thomas of Britain draws on the Roman de Brut for historical details, and follows its example in matters of style.Foulon, Charles (1959]. \"Wace\", Arthurian Literature in the Middle Ages. (Loomis, Roger Sherman, ed.) Oxford: Clarendon Press. pp. 102–103. {{ISBN}0198115881}} Gottfried draws more on the learned tradition of medieval humanism than on the chivalric ethos shared by his literary contemporaries. "]}, {"page": "Knights of the Round Table", "response": ["| Tristan poems of Béroul and Thomas of Britain, 12th century", "Bleoberis de Ganis is a Knight of the Round Table from Gaul or perhaps Vannes (as Ganis, also Ganes, Gannes, Gaunes, Gaunnes), first mentioned by Chrétien de Troyes in his Erec and Enide as Bliobleheris. He appeared by variants of this name in many works, including as Barant le Apres (Berrant) and Bleoberys in Thomas Malory's Le Morte d'Arthur (also Bleoberis, Bleoboris, Bleoheris), as Bleobleheris (also Bliobliheri) and Bleheris in (respectively) the First Continuation and the Second Continuation of Perceval, as two different characters named Bleheris and Blidoblidas in Meriaduec, as two different characters named Bleherris and Blias, lord Bliodas in Of Arthour and of Merlin, as Bleoris in Henry Lovelich's Merlin, as Bleos von Bliriers in Diu Crône, as Bleriz in Povest o Tryschane, as Bliobleherin in Erec, as Bliobleeris in La Vengeance Raguidel, as Bliobleris de Gannes in the French prose cycles (also Biblioberis, Bla(h)aris, Bleob(l)eris, Bleobleheris, Bleosblieris, Bliaires, Blihoble(h)eris, Bliobeheri, Blioberis, Blyob(l)eris; -de Ga(u)n(n)es), as Blioblieris in Le Bel Inconnu and in Wigalois, as Briobris in La Tavola Ritonda, as Pleherin in Tristrant, and as Pliopliheri in Parzival. His name is considered to have been derived from the 12th-century Welsh storyteller known as Bledhericus or Bleheris (possibly Bledri ap Cydifor), who is mentioned in several texts, including being credited by Thomas of Britain and Wauchier de Denain as the original source of their early Arthurian poems. References to the narrative authority of Master Blihis repeat in the Elucidation, in which Blihos-Bliheris appears in character as the final opponent for Gawain.", "He appears in almost all versions of the legend of Tristan and Iseult, beginning with the verse works of Thomas of Britain and Béroul. In the early material, Morholt is the brother of the Queen of Ireland and the uncle of Tristan's future love (both mother and daughter are named Iseult). He comes to Cornwall to collect tribute owed to his country, but Tristan agrees to battle the champion on the remote Saint Samson's Isle in order to release his people from the debt. Tristan mortally wounds Morholt, leaving a piece of his sword in the Irishman's skull, but Morholt stabs him with a poisoned spear and escapes to Ireland to die. The injured Tristan eventually travels to Ireland incognito to receive healing from Iseult the Younger, but is found out when the queen discovers the piece of metal found in her brother's head fits perfectly into a chink in Tristan's blade."]}, {"page": "Gottfried von Strassburg", "response": ["Gottfried states that the Tristan of Thomas of Britain, an Anglo-French work of around 1160, was the source of his work. He explains that he bases himself on Thomas because he \"told the tale correctly\", distancing himself from the less courtly versions of the story represented by Béroul in Old French and Eilhart von Oberge in Middle High German."]}, {"page": "Iseult", "response": ["The Irish princess, Iseult of Ireland (also Iseult La Belle or Iseult la Blonde, \"Iseult the Fair\"), is the daughter of King Anguish of Ireland and Queen Iseult the Elder. She is a main character in the Tristan poems of Béroul, Thomas of Britain, and Gottfried von Strassburg and in the opera Tristan und Isolde by Richard Wagner."]}, {"page": "Anglo-Norman literature", "response": ["Wace and Benoît de Sainte-More compiled their histories at his bidding, and it was in his reign that Marie de France composed her poems. An event with which he was closely connected, viz. the murder of Thomas Becket, gave rise to a whole series of writings, some of which are purely Anglo-Norman. In his time appeared the works of Béroul and Thomas of Britain respectively, as well as some of the most celebrated of the Anglo-Norman romans d'aventure. It is important to keep this fact in mind when studying the different works which Anglo-Norman literature has left us. We will examine these works briefly, grouping them into narrative, didactic, hagiographic, lyric, satiric and dramatic literature."]}, {"page": "Chivalric romance", "response": ["Originally, this literature was written in Old French, Anglo-Norman and Occitan, later, in Spanish, English and German – amongst the important Spanish texts were Cantar de Mio Cid and Book of the Knight Zifar; notable later English works being King Horn (a translation of the Anglo-Norman (AN) Romance of Horn of Mestre Thomas), and Havelok the Dane (a translation of the anonymous AN Lai d'Haveloc); around the same time Gottfried von Strassburg's version of the Tristan of Thomas of Britain (a different Thomas to the author of 'Horn') and Wolfram von Eschenbach's Parzival translated classic French romance narrative into the German tongue."]}, {"page": "Bibliography of King Arthur", "response": ["* Tristan by Thomas of Britain c. 1170s", "**Tristrams saga ok Ísöndar 1226 (Norse reworking Tristan by Thomas of Britain)", "* Sir Tristrem c. 1300 (English reworking of Tristan by Thomas of Britain)"]}, {"page": "Tristan and Iseult", "response": ["Different versions of the legend have been recorded in many texts written in various languages across the medieval Europe, with origins possibly even beyond it. The tale has initially come down in two main forms, known as the courtly branch and the common branch, beginning with the 12th-century poems of Thomas of Britain and Béroul, the latter likely reflecting a now lost original version. A subsequent tradition emerged in the 13th century in the wake of the greatly expanded Prose Tristan, merging the romance of Tristan with the legend of King Arthur. Following the 19th-century revival, the story has continued to be popular in the modern era in numerous treatments, notably Wagner's opera adaptation.", "The story and character of Tristan vary from author to author; even the spelling of his name varies a great deal, although \"Tristan\" is the most popular spelling. Nevertheless, there are two main traditions of the Tristan legend. The early tradition comprised the French romances of Thomas of Britain and Béroul, two poets from the second half of the 12th century. Later traditions come from the vast Prose Tristan (c. 1240), which was markedly different from the earlier tales written by Thomas and Béroul.", "Some scholars suggest that the 11th-century Persian story Vis and Rāmin must have been the model for the Tristan legend because the similarities are too great to be coincidental.Stewart Gregory (translator), Thomas of Britain, Roman de Tristan, New York: Garland Publishers, 1991. Fakhr al-Dīn Gurgānī, and Dick Davis. 2008. Vis & Ramin. Washington, DC: Mage publishers. The evidence for the Persian origin of Tristan and Iseult is very circumstantialGrimbert, Joan T. 1995. Tristan and Isolde: a casebook. New York: Garland Pub. and several theories have been suggested as to how this Persian story could have reached the West. Some suggested story-telling exchanges during the Crusades in a Syrian court, and through minstrels who had free access to both Crusader and Saracen camps in the Holy Land.Grimbert, Joan T. 1995. Tristan and Isolde: a casebook. p. 21.", "The earliest representation of what scholars name the \"courtly\" branch of the Tristan legend is in the work of Thomas of Britain, dating from 1173. Only ten fragments of his Tristan poem, representing six manuscripts, have ever been located: the manuscripts in Turin and Strassburg are now lost, leaving two in Oxford, one in Cambridge and one in Carlisle. In his text, Thomas names another trouvère who also sang of Tristan, though no manuscripts of this earlier version have been discovered. There is also a passage telling how Iseult wrote a short lai out of grief that sheds light on the development of an unrelated legend concerning the death of a prominent troubadour, as well as the composition of lais by noblewomen of the 12th century.", "A 158-line fragment of a Dutch version (c. 1250) of Thomas of Britain's Tristan exists. It is being kept in the Austrian National Library in Vienna, Series nova 3968. A short Tristan narrative, perhaps related to the Béroul text, exists in six Welsh manuscripts dating from the late 16th to the mid 17th century.The Tristan Legend Hill. Leeds England: Leeds Medieval Studies. 1973."]}, {"page": "Medieval French literature", "response": ["* Tristan – Thomas of Britain (1155–1178)"]}, {"page": "Thomas d'Angleterre", "response": ["#REDIRECT Thomas of Britain"]}, {"page": "Roman de Brut", "response": ["The emphasis Wace placed on the rivalries between his knights and on the role of love in their lives had a profound effect on writers of his own and later generations.  His influence can be seen in some of the very earliest romances, including the Roman d'Enéas and the Roman de Troie, and in Renaud de Beaujeu's Le Bel Inconnu and the works of Gautier d'Arras.  Thomas of Britain's romance Tristan draws on the Brut for historical details, particularly the story of Gormon, and follows its example in matters of style.  His influence is especially evident in the field of Arthurian romance, later writers taking up his hint that many tales are told of the Round Table and that each of its members is equally renowned.  There are general resemblances between the Brut and the poems of Chrétien de Troyes, in that both are Arthurian narratives in octosyllabic couplets, as well as stylistic similarities, but there are also specific signs of Chrétien's debt.  He adapts Geoffrey's narrative of Mordred's last campaign against Arthur in his romance of Cligès, and various passages in the Brut contribute to his account of the festivities at Arthur's court in Erec and Enide.{{sfn|Arnold|1938|p=xcvi</ref>  There are likewise verbal reminiscences of the Brut in Philomela and Guillaume d'Angleterre, two poems sometimes attributed to Chrétien.  It is certain that Marie de France had read Wace, but less certain how many passages in her Lais show its influence, only the raids by the Picts and Scots in Lanval being quite unambiguous.  Two of the Breton lais written in imitation of Marie de France also show clear signs of indebtedness to the Brut.  It gave to Robert Biket's Lai du Cor certain elements of its style and several circumstantial details, and to the anonymous Melion a number of plot-points.  The description of Tintagel in the Folie Tristan d'Oxford included details taken from the Roman de Brut.  In the early 13th century Le Chevalier aux Deux Epees was still demonstrating the influence the Roman de Brut could exert.  In this case the author seems to have been impressed by Wace's account of Arthur's birth, character, battles, and tragic death.  Robert de Boron based his verse romance Merlin, which only survives in fragmentary form, on the Roman de Brut, with some additions from the Historia Regum Britanniae, and also drew on the Brut for his prose romance Didot Perceval.  The story of Robert's Merlin was continued in the prose Suite Merlin, one of the romances in the Lancelot-Grail or Vulgate Cycle, which likewise takes and adapts Wace's narrative, especially when describing Arthur's Roman war.  The final sections of the Mort Artu, another Vulgate romance, take their narrative basis from Wace's account of the end of Arthur's reign, and his influence also appears in the Livre d'Artus, a romance loosely associated with the Vulgate Cycle.  Much later, the mid-15th century Recueil des croniques et anchiennes istories de la Grant Bretaigne by Jean de Wavrin, a compilation of earlier chronicles, takes its British history up to the beginning of the Arthurian period from an anonymous French adaptation of Wace's Brut dating from c. 1400, though with substantial additions taken from the romances."]}, {"page": "Thomas of England", "response": ["#REDIRECT Thomas of Britain"]}, {"page": "Hoel", "response": ["Hoel was later attached to the Tristan and Iseult legend by such poets as Béroul and Thomas of Britain. In these stories, Hoel is duke of Brittany and the father of Tristan's unloved wife, Iseult. Hoel takes Tristan in when the young knight has been banished from the kingdom of king Mark of Cornwall, and Tristan later helps him in battle and becomes fast friends with his son Kahedin and his daughter Iseult. Tristan convinces himself to marry this second Iseult, mostly because she shares the name of his first love, Iseult of Ireland. In early versions of the story, Tristan remains in Hoel's land until he dies of poison minutes before Iseult of Ireland, a great healer, arrives to cure him. The Prose Tristan has the hero returning to Britain and to his first love, never to see his wife again. This version was followed by the Post-Vulgate Cycle and by Thomas Malory's Death of Arthur.Curtis, Renée L. (trans.) The Romance of Tristan. Oxford University Press (Oxford), 1994. ."]}, {"page": "Modena Cathedral", "response": ["\"Winlogee\" most likely corresponds to Arthur's wife, Guinevere. Loomis suggested the names derived from Breton; \"Winlogee\" is similar to the Breton name Wenlowen, and Guinevere's name is rendered as the related Gwendoloena in the Latin romance De Ortu Waluuanii. The Abduction of Guinevere is a very popular and ancient element of the Arthurian legend, first appearing in written form in Caradoc of Llancarfan's mid-12th-century Life of Gildas. This version describes Arthur's queen as being kidnapped by King Melwas of the Summer Country and taken to Glastonbury; Arthur only recovers her with the help of Saint Gildas. Later versions call the kidnapper Meleagant and name the queen's lover Lancelot, rather than Arthur himself, as her rescuer. Interesting in the context of the Modena Archivolt is the shadowy early tradition in which the character known as Yder, Ider, or some variant was the queen's lover and rescuer. This tradition is mostly lost but is mentioned in Thomas of Britain's Tristan and survives, in greatly manipulated form, in other romances, the most important of which is Yder. One such romance, Durmart le Galois, includes a scene in which Ydier participates in a rescue of Guinevere, and rides unarmed, as Isdernus does on the Modena Archivolt."]}, {"page": "12th century in literature", "response": ["**c. 1155–1173 Tristan by Thomas of Britain (\"courtly branch\"; Old French)"]}, {"page": "Prose Tristan", "response": ["The first part of the work stays closer to the traditional story as told by verse writers like Béroul and Thomas of Britain, but many episodes are reworked or altered entirely. Tristan's parents are given new names and backstories, and the overall tone has been called \"more realistic\" than the verse material though there are moments where characters sing. Tristan's guardian Governal takes him to France, where he grows up at the court of King Pharamond. He later arrives at the court of his uncle Mark, King of Cornwall, and defends his country against the Irish warrior Morholt. Wounded in the fight, he travels to Ireland where he is healed by Iseult, a renowned doctor and Morholt's niece, but he must flee when the Irish discover he has killed their champion. He later returns, in disguise, to seek Iseult as a bride for his uncle. When they accidentally drink the love potionControversially, Tristan does not fall in love with Iseult \"love at first sight.\" Instead, he falls in love with her because the pagan knight Palamedes falls in love with her first. prepared for Iseult and Mark, they engage in a tragic affair that ends with Tristan being banished to the court of Hoel of Brittany. He eventually marries Hoel's daughter, also named Iseult."]}, {"page": "Tristan (disambiguation)", "response": ["* Tristan, a 12th-century French poem by Thomas of Britain"]}, {"page": "Brangaine", "response": ["Brangaine plays essentially the same role in the early poetic versions of Béroul and Thomas of Britain, and their respective German successors Eilhart von Oberge and Gottfried von Strassburg. She is the inadvertent catalyst in the development of the story's central romance: before Tristan takes Iseult back to Cornwall to be the wife of his uncle King Mark, Iseult's mother (also named Iseult) entrusts Brangaine with a love potion meant for Iseult and her new husband to drink on their wedding night. However, Tristan and Iseult find the potion on the boat ride to Cornwall, and mistaking it for regular wine, they drink it. So begins their unstoppable passion."]}, {"page": "Roman d'Enéas", "response": ["The vivid female characters of this romance discuss with each other and with themselves the meaning of love in a light but touching way that was new in vernacular literature, and  modeled on Ovid rather than on Virgil. At about this time—or a little later—other authors, such as Chrétien de Troyes and Thomas of Britain, were also learning to pause their narratives to allow their characters to consider the nature and power of love."]}, {"page": "Chivalric sagas", "response": ["The first known Old Norse translations of European romances occurred under the patronage of king Hákon Hákonarson of Norway, and seem to have been part of a programme of Europeanisation. The earliest dated work is a 1226 translation by one Brother Robert of Tristan by Thomas of Britain. The Old Norse work, Tristrams saga ok Ísöndar, is especially valuable since the original Old French poem is only preserved in fragments. Elis saga ok Rósamundu, a translation of  Elie de Saint Gille, is similarly attributed to an Abbot Robert, presumably the same man having been promoted within his order. King Hákon also commissioned Möttuls saga, an adaptation of Le mantel mautaillé, Ívens saga, a reworking of Chrétien de Troyes's Yvain and Strengleikar, a collection of ballads principally by Marie de France.", "* Tristrams saga ok Ísöndar (Thomas of Britain's Tristan)"]}, {"page": "Category talk:Arthurian legend", "response": ["Thomas of BritainStub"]}, {"page": "Brother Robert", "response": ["Brother Robert was a cleric working in Norway who adapted several French literary works into Old Norse during the reign of King Haakon IV of Norway (1217–1263). The most important of these, Tristrams saga ok Ísöndar, based on Thomas of Britain's Tristan, is notable as the only example of Thomas' \"courtly branch\" of the Tristan and Iseult legend that has survived in its entirety. It was the earliest Scandinavian version of the story, and is thought to be the first Norwegian adaptation of an Old French work. Its success may have inspired the spate of translations during King Haakon's reign.Schach, The Saga of Tristram and Ísönd, p. xiii."]}]}}