{"wiki_id": "http://www.wikidata.org/entity/Q5451015", "itemLabel": "Fiona Armstrong", "itemDescription": "Freelance Scottish television journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Fiona_Armstrong", "wikipedia_page": {"main": "Fiona Armstrong, Lady MacGregor (born 28 November 1956), is a British television journalist and is Lord Lieutenant of Dumfries. She is also the author of several books and has written for newspapers and made television programmes on Scottish topics including fishing and Scottish clans.", "link_mentions": [{"page": "List of Scots", "response": ["* Fiona Armstrong (born 1956)"]}, {"page": "November 28", "response": ["*1956 – Fiona Armstrong, English-Scottish journalist and author"]}, {"page": "Channel 4 News", "response": ["*Fiona Armstrong (1990–91)"]}, {"page": "Order of precedence in Scotland", "response": ["#*Lord Lieutenant of Dumfries (Fiona Armstrong)"]}, {"page": "List of Have I Got News for You episodes", "response": ["|Fiona Armstrong"]}, {"page": "Lorraine Kelly", "response": ["In January 1993, Kelly helped launch GMTV by presenting a range of programmes. Her first job was presenting the new Top of the Morning. In March, when Fiona Armstrong walked out of the main GMTV show, Kelly moved to the main breakfast show with Eamonn Holmes. In June 1994, Kelly went on maternity leave, but shortly afterwards she was sacked from the main presenting roles, she returned in November 1994 to do a mother and baby slot.Piers Morgan's Life Stories-Lorraine Kelly  ITV programme, https://www.imdb.com/title/tt4878784/ This led to her becoming the presenter of Nine O'Clock Live. The show proved so popular that it was moved to the earlier 08:35 slot, retitled Lorraine Live."]}, {"page": "ITV News", "response": ["News at 545 was replaced by the News at 540 in 1989 (following the introduction of the ITV National Weather forecast), and a new presenting team was formed comprising Carol Barnes, Nicholas Owen, Trevor McDonald, Fiona Armstrong, and Alastair Stewart. The programme lasted until March 1992 when it was renamed and relaunched, in line with other ITN bulletins.", "ITN's regular newscasting team in the 1980s included Alastair Burnet, Sandy Gall, Leonard Parkin, Alastair Stewart, Trevor McDonald, Julia Somerville, Carol Barnes, Fiona Armstrong, John Suchet, Nicholas Owen, and a host of well-known reporters and correspondents."]}, {"page": "List of people associated with University College London", "response": ["* Fiona Armstrong (German literature), journalist"]}, {"page": "ITV Evening News", "response": ["On 4 April 1988 the News at 545 underwent some cosmetic changes, with the animated visual 'roll' logo and electronic theme music being dropped in favour of a new computer-generated opening sequence and a more contemporary theme tune; the studio images were still inlaid using chromakey, although these were now also generated by computer. The programme was moved to the main newsroom within the ITN headquarters building, and full-length reports were now featured as part of the programme. ITN dispensed with the \"main\" presenter and relief host format, and instead a \"team\" of newscasters - Alastair Stewart, Fiona Armstrong, Nicholas Owen, Trevor McDonald, Sue Carpenter and Carol Barnes - began presenting the show on a \"rotation\" basis. On 13 February 1989, the introduction of a national weather forecast at the end of the programme led to the bulletin's timeslot starting earlier at 5:40pm, being extended in length and the title being changed to News at 540.", "*Fiona Armstrong (1985–1991)"]}, {"page": "List of people from Preston", "response": ["*Fiona Armstrong (born 1956)  — journalist, newsreader"]}, {"page": "Darcus Howe", "response": ["Howe was interviewed by Fiona Armstrong for BBC News on 9 August 2011 at the time of the 2011 England riots.\"London Riots: BBC Interview Gets Testy\" , Huffington Post, 10 August 2011. During the interview, Armstrong twice referred to him as \"Marcus Dowe\", then asked: \"You are not a stranger to riots yourself, I understand, are you? You have taken part in them yourself.\" Howe denied this, saying: \"I have never taken part in a single riot. I've been part of demonstrations that ended up in a conflict. Have some respect for an old West Indian Negro, and stop accusing me of being a rioter. Because you wanted for me to get abusive, you just sound idiotic—have some respect.\"Hughes, Sarah Anne. \"BBC apologizes to Darcus Howe for ‘poorly phrased question’\" , The Washington Post, 11 August 2011."]}, {"page": "Sir Gregor MacGregor, 6th Baronet", "response": ["On 8 February 1958, he married Fanny Butler and they had two children: Malcolm Gregor Charles MacGregor (b. 23 March 1959) and Ninian Hubert Alexander MacGregor (b. 30 June 1961). Lady MacGregor died on 10 August 2016.MacGREGOR of MacGREGOR His oldest son married television journalist Lord Lieutenant of Dumfries Fiona Armstrong."]}, {"page": "BBC Breakfast", "response": ["* Fiona Armstrong (2012)"]}, {"page": "ITV Weekend News", "response": ["*Fiona Armstrong (1985–1992)"]}, {"page": "ITV Breakfast", "response": ["| 1993 || Fiona Armstrong ||  ||  ||  ||  || || "]}, {"page": "ITN World News", "response": ["*Fiona Armstrong – 1990–92"]}, {"page": "Michael Wilson (presenter)", "response": ["Sky News names Sunday Telegraph's Mark Kleinman as City editor where he presented the first weekday programme with Fiona Armstrong.GMTV promo - Michael Wilson  However, their partnership did not last long as ratings dipped. Fiona left and Wilson founded the 6-7am GMTV News Hour, with Eamonn Holmes and Lorraine Kelly taking up the Monday to Friday roles as main GMTV presenters, with Anne Davies as newsreader and relief presenter.  The News Hour broke television early morning viewing records by achieving one million viewers in less than six months."]}, {"page": "List of ITV journalists and newsreaders", "response": ["*Fiona Armstrong – presenter for Border Television's regional news programme Lookaround; later a newscaster on ITN's News at Ten"]}, {"page": "Scott Brown (broadcaster)", "response": ["Brown, a former local radio presenter, was a continuity announcer for Grampian Television (now STV North) during the mid - late 1990s. He also presented various regional programmes including Grampian Headlines regional news bulletins, the BAFTA-nominated children's programme Wize Up alongside announcing colleagues Rachael Robertson and Kate Fraser and the antiques show Under The Hammer alongside Fiona Armstrong - a programme he continued to present after Grampian's in-house presentation department was closed during the summer of 1998.BFI entry - Scott Brown"]}, {"page": "List of GMTV presenters and reporters", "response": ["| Fiona Armstrong"]}, {"page": "List of GMTV programmes", "response": ["* Fiona Armstrong", "Lorraine Kelly first began presenting Top of the Morning in January 1993. In March when Fiona Armstrong walked out of the main GMTV show, Lorraine moved to the GMTV slotGMTV with Lorraine TV.com and Fern Britton and Amanda Redington took over hosting Top of the Morning. Top of the Morning was produced by an independent production company.GMTV Licence Variation Ofcom, 28 April 1994"]}, {"page": "List of ITV News on air staff", "response": ["*Fiona Armstrong (1985–1993)"]}, {"page": "2010 in British television", "response": ["|Fiona Armstrong and Julia Somerville join the BBC News Channel as regular presenters. They will be joined by Zeinab Badawi and Carole Walker as the BBC seeks to fight accusations that it has an ageist policy."]}, {"page": "Eric Wallace", "response": ["That night's edition of Lookaround broke the news of Wallace's death and featured an extensive tribute. Following the tribute, anchorwoman and close friend Fiona Armstrong wept openly on air."]}, {"page": "Journalism, Media and Communication, University of Central Lancashire", "response": ["Honorary Fellows include Mark Thompson, Richard Frediani (Head of News at Granada), Lucy Meacock, Kate Adie, Anna Ford and Fiona Armstrong."]}, {"page": "1956 in Scottish television", "response": ["*28 November - Fiona Armstrong, television journalist"]}, {"page": "Fiona Kathryne Armstrong", "response": ["#REDIRECT Fiona Armstrong"]}, {"page": "Border Life", "response": ["* Fiona Armstrong"]}, {"page": "Timeline of non-flagship BBC television channels", "response": ["*15 February – Fiona Armstrong and Julia Somerville join the BBC News Channel as regular presenters. They will later be joined by Zeinab Badawi and Carole Walker as the BBC seeks to fight accusations that it has an ageist policy."]}, {"page": "Lakeland Book of the Year", "response": ["The Lakeland Book of the Year, also known as the Hunter Davies Lakeland Book of the Year is an award given annually for a book \"set in or featuring Cumbria in some way\", and is named for the Lake District of north west England. It was founded by writer Hunter Davies in 1984 and is administered by Cumbria Tourism. The judges in 2021, for books published in 2020, were Hunter Davies, Eric Robson and Fiona Armstrong. The prizes are traditionally announced at a gala lunch in June, although in 2020 the proceedings took place online because of COVID-19. The 2021 shortlist of 18 titles was announced in August 2021 and  it is expected that the winners will be announced at an event on 19 October 2021 at the Roundthorn Country House Hotel."]}]}}