{"wiki_id": "http://www.wikidata.org/entity/Q545318", "itemLabel": "Ben Swift", "itemDescription": "British racing cyclist", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Swift", "wikipedia_page": {"main": "Benjamin Ian Swift (born 5 November 1987) is an English professional track and road racing cyclist, who currently rides for UCI WorldTeam Ineos Grenadiers. Swift won the scratch race at the 2012 UCI Track Cycling World Championships and the men's elite road race at the 2019 and 2021 British National Road Race Championships. His cousin, Connor Swift, is also an English professional road racing cyclist, and the 2018 British champion.", "link_mentions": [{"page": "Bradley Wiggins", "response": ["Wiggins was team leader of  again at the start of 2011. He opted not to enter the Giro d'Italia, concentrating instead on shorter events and the classics before undertaking altitude training to improve his climbing for the Tour de France. His season began at the Tour of Qatar in February, before winning the team pursuit at the Manchester round of the 2009–10 Track World Cup Classics, with a time of three minutes 55.438, the fifth-fastest time. He then came second in the -long time trial on the sixth stage of the Paris–Nice in March, 20 seconds behind Tony Martin of . He finished third overall, behind Martin and  rider Andreas Klöden. In April he rode Paris–Roubaix, and then the Tour de Romandie, finishing third in time trial on stage and helped lead-out teammate Ben Swift to victory on the final stage. In March he finished second in the time trial on the third stage of the Critérium International, four seconds down on Klöden. In May he won the -long time trial on stage four of the Bayern–Rundfahrt, beating 's Cancellara by 33 seconds, and finished the event in 14th place overall, while also helping teammate Geraint Thomas to win the event."]}, {"page": "British Cycling", "response": ["In 2003, the first six riders joined British Cycling's new Olympic Academy for junior riders, under the leadership of Rod Ellingworth, with a budget of £100,000 for the first year. Among the first cohort were Ed Clancy and Mark Cavendish, although the latter was almost passed over due to his relatively poor performance in lab tests, with coaches Ellingworth, John Herety and Simon Lillistone lobbying Keen to include him due to his potential. The Academy used a training base in Tuscany from 2006 to 2010, and has since returned to Italy, basing itself in Montichiari since 2016. Other notable riders who participated in the Academy programme include Kennaugh, Geraint Thomas, Ian Stannard, Ben Swift and Simon Yates. That year Keen left his role, whilst continuing to work with British Cycling in a consultancy capacity until the 2004 Summer Olympics: Brailsford was appointed  as his replacement."]}, {"page": "Tour of Britain", "response": ["The 2007 Tour of Britain was extended to seven days, with the extra day being used to run a stage in Somerset for the first time. Instead of finishing in London, the 2007 race started in London and finished in Glasgow, which used the event to boost its bid to host the 2014 Commonwealth Games. French rider Romain Feillu won overall by just 0.49 seconds over Spaniard (and stage four winner in Bradford) Adrian Palomares. His victory margin remains the smallest in modern race history. Mark Cavendish won the race's opening two stages (a 2.5 km prologue at Crystal Palace Park and in Southampton) as well as the points competition, while Yorkshire's Ben Swift won the mountains competition.", "The sixth edition, the 2009 Tour of Britain, was also raced over eight days, Saturday 12 to Saturday 19 September. The race started in Scunthorpe and finished in London. Boasson Hagen was the dominant overall winner, claiming a record four-consecutive stage victories (in Peebles, Blackpool, Stoke-on-Trent and Bideford) en route to the title. In his first season as a pro, Katusha–Alpecin rider Ben Swift memorably took his maiden career victory ahead of team-mate Filippo Pozzato in Yeovil."]}, {"page": "List of British cyclists", "response": ["* Ben Swift"]}, {"page": "Herne Hill Velodrome", "response": ["The track held meetings featuring star internationals such as Jacques Anquetil, Fausto Coppi, Reg Harris and Tom Simpson during the 1950s and 1960s. The future of the track then became less certain. A campaign was fought to retain it during the early 2000s following a dispute between the landlord, Dulwich Estate, and the leaseholder, Southwark Council. A feature, said the journalist Richard Williams, was \"a lease long enough to make it worthwhile to undertake the necessary refurbishment of the grandstand, which is closed for safety reasons, and the 450‑metre track itself.\" Bill Wright of British Cycling, formed by the merger of the National Cyclists Union with the British League of Racing Cyclists in the 1950s, said: \"The problem is that the venue is underfunded and deteriorating, and desperately in need of refurbishment but cannot get the investment it needs unless landlords Dulwich Estate renew their lease, something Dulwich Estate is reluctant to do. The estate, which also owns the land of some of the area’s prestigious public schools such as Dulwich College and Alleyn's School, is legally required to get the best return on its investment for benefactors. However, it also has a commitment to community upkeep.\"Cited http://www.eastlondonlines.co.uk/2010/09/from-hackney-to-herne-hill-campaign-to-save-olympic-velodrome/ A supporter of the campaign was Olympic gold medallist Bradley Wiggins, who started racing at Herne Hill when he was 12.Cited Bradley Wiggins, \"Looking down from Herne Hill, I can see the future is bright\", Guardian, 8 April 2007, https://www.theguardian.com/sport/2007/apr/08/cycling.news The campaign has also attracted support from British racing cyclists Victoria Pendleton and Ben Swift, as well as local residents Jo Brand and James Nesbitt."]}, {"page": "Daniele Bennati", "response": ["At the Vuelta a España, Bennati took his first win of the 2012 season in a very close finish on stage 18, edging 's sprinter Ben Swift. He dedicated his victory to the memory of Wouter Weylandt and of his grandfather. Bennati left  at the end of the 2012 season, and joined Bjarne Riis'  on a two-year contract from the 2013 season onwards."]}, {"page": "2006–07 UCI Track Cycling World Cup Classics", "response": ["| Team pursuit ||  Paul Manning Robert Hayles Bradley Wiggins Ed Clancy ||  Alexei Bauer  Evgeny Kovalev  Ivan Kovalev  Nikolay Trusov ||  Jonathan Bellis  Steven Burke  Ben Swift  Andrew Tennant"]}, {"page": "Geraint Thomas", "response": ["Thomas focused on track cycling for the 2012 season, competing at the Summer Olympics in London. As such, the Giro d'Italia was his road race priority, before turning his focus to the track. In March, Thomas did ride Paris–Nice, where he helped Bradley Wiggins take overall victory. On 4 April Thomas was a member of the British team pursuit team that won gold at the UCI Track Cycling World Championships in Melbourne, with a new world record of 3:53.295 seconds. He also teamed up with Ben Swift to take the silver medal in the madison. Thomas then returned to the road, winning the prologue of the Tour de Romandie.", "::1st Madison (with Ben Swift), Dortmund", "::2nd 15px|link=Silver medal Madison (with Ben Swift)"]}, {"page": "2007 Tour of Britain", "response": ["French rider Romain Feillu won the overall race, Mark Cavendish won the Points competition and Ben Swift won the Mountains competition.", "Britons Paul Manning, Ben Swift, Rob Partridge, Mark Cavendish and John Bellis all finished in the top 10.", "*Leader of the King of the Mountains competition – Ben Swift", "*Leader of the King of the Mountains competition – Ben Swift", "*Leader of the King of the Mountains competition – Ben Swift ( BAR)", "The points competition and sprinters award were won by Mark Cavendish while Ben Swift won the King of the Mountains competition."]}, {"page": "British National Road Race Championships", "response": ["| 2014 || Peter Kennaugh || Ben Swift || Simon Yates", "| 2019 || Ben Swift || Ian Stannard || John Archibald", "| 2021 || Ben Swift || Fred Wright || Ethan Hayter"]}, {"page": "Culture of Yorkshire", "response": ["Yorkshire hosted the grand depart of the 2014 Tour de France. The county has produced many successful racing cyclists over the years. Notable male cyclists include Brian Robinson, the first British rider to finish and to win stages of the Tour de France, Barry Hoban, winner of eight Tour de France stages and two stages of the Vuelta a España, Malcolm Elliott, winner of the points classification at the 1989 Vuelta a España, Ed Clancy, a double Olympic and five time World Championship gold medallist on the track and Ben Swift, also a track cycling World Champion. Successful female cyclists include Beryl Burton, a double road cycling and five time track cycling World Champion, former individual pursuit World Champion Yvonne McGregor and World Championship track gold medallist and Olympic road racing silver medallist Lizzie Armitstead."]}, {"page": "UCI Track Cycling World Championships – Men's madison", "response": ["|Ben SwiftGeraint Thomas"]}, {"page": "British National Time Trial Championships", "response": ["| 2013|| Alex Dowsett || Matthew Bottrill || Ben Swift"]}, {"page": "Great Britain at the 2008 Summer Olympics", "response": ["|align=left|Ben Swift"]}]}}