{"wiki_id": "http://www.wikidata.org/entity/Q5460643", "itemLabel": "Florence Hoath", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Florence_Hoath", "wikipedia_page": {"main": "Florence Angela L. Hoath (born 12 July 1984) is a retired British actress.\nThe daughter of British actress Tina Martin, Hoath was born in London and made her film debut in the 1993 screen adaptation of Secret Rapture at the age of eight. Since then she has starred in a number of film and television productions, including the 2005 Doctor Who episodes \"The Empty Child\" and \"The Doctor Dances\". Also in that year, Hoath was cast to play the regular role of George Fitzgerald in Channel 5's daytime soap Family Affairs, but the show was cancelled weeks after her introduction, the final episode being broadcast in December 2005.\nHoath's last screen credit was a role in the 2008 television miniseries Lost in Austen. In an interview published in Doctor Who magazine during March 2015, she confirmed she was no longer acting.", "link_mentions": [{"page": "1997 in film", "response": ["| FairyTale: A True Story || Paramount Pictures / Warner Bros. Pictures / Icon Productions || Charles Sturridge (director); Ernie Contreras (screenplay); Florence Hoath, Elizabeth Earl, Peter O'Toole, Harvey Keitel, Paul McGann, Bill Nighy, Phoebe Nicholls, Anna Chancellor || Fantasy || Live action"]}, {"page": "1998 in film", "response": ["| The Governess || Sony Pictures Classics || Sandra Goldbacher (director/screenplay); Minnie Driver, Tom Wilkinson, Jonathan Rhys Meyers, Harriet Walter, Florence Hoath || Drama || Live action"]}, {"page": "Family Affairs", "response": ["|George Fitzgerald || Florence Hoath || 2005"]}, {"page": "The Doctor Dances", "response": ["The episode is set in London in 1941. In the episode, the alien time traveller the Ninth Doctor (Christopher Eccleston), his travelling companion Rose Tyler (Billie Piper), the con man Captain Jack Harkness (John Barrowman), and the homeless woman Nancy (Florence Hoath) investigate a spaceship which crashed the same time patients at a nearby hospital began turning into living dead beings with gas masks for faces."]}, {"page": "FairyTale: A True Story", "response": ["* Florence Hoath as Elsie Wright", "The film got its UK premiere in Bradford, the city it was filmed and set in, on the 8th of February 1998. It was shown simultaneously at the Pictureville Cinema (which is based in the National Science and Media Museum), and Bradford Odeon just over the road. The Bradford premiere was attended by the likes of Dominic Brunt (among other Emmerdale stars), politician Gerry Sutcliffe, the lord mayor of Bradford Tony Cairns, Frances Griffiths' daughter Christine Lynch, the films stars Phoebe Nicholls, Tim McInnerny, Florence Hoath, and Elizabeth 'Lizzie' Earl, along with the director Charles Sturridge. The after party was based at the Bradford Alhambra which is situated in between the National Science and Media Museum, and the Bradford Odeon."]}, {"page": "List of Family Affairs characters", "response": ["Georgina (George) Fitzgerald was played by Florence Hoath from September to December 2005 when the series ended."]}, {"page": "1984 in the United Kingdom", "response": ["** Florence Hoath, actress"]}, {"page": "Lizzie Hopley", "response": ["Her radio plays have included The Elizabethan Beauty LawRadio – Pick of the day, Phil Daoust. The Guardian, 9 December 2005 (which starred Annette Badland as Queen Elizabeth), The Cenci Family (nominated for a Sony Radio Academy Award) for BBC Radio 4 and SalomeBBC – Drama on 3 – Salome (which starred Ian Brooker, Florence Hoath and Kenneth Cranham) for BBC Radio 3."]}, {"page": "Florence (given name)", "response": ["* Florence Hoath (born 1984), British actress"]}, {"page": "The Governess", "response": ["*Florence Hoath ..... Clementina Cavendish"]}, {"page": "List of fantasy films of the 1990s", "response": ["|FairyTale: A True Story ||Charles Sturridge ||Florence Hoath, Peter O'Toole, Elizabeth Earl ||United Kingdom||"]}, {"page": "List of British films of 1994", "response": ["|A Pin for the Butterfly||Hannah Kodicek||Ian Bannen, Florence Hoath||Drama||Co-production with the Czech Republic"]}, {"page": "List of British films of 1997", "response": ["|FairyTale: A True Story||Charles Sturridge ||Florence Hoath, Elizabeth Earl, Phoebe Nicholls ||Historical fantasy || Based on the legend of the Cottingley Fairies"]}, {"page": "Lost in Austen", "response": ["* Florence Hoath as Catherine \"Kitty\" Bennet"]}, {"page": "Doctor Who (series 1)", "response": ["David Tennant had been offered the role of the Doctor when he was watching a pre-transmission copy of Casanova with Davies and Gardner. Tennant initially believed the offer was a joke, but after he realised they were serious, he accepted the role and first appeared in the series finale \"The Parting of the Ways\".Aldridge and Murray pp. 196–197 Tennant was announced as Eccleston's replacement on 16 April 2005. Other recurring characters for the series included Camille Coduri as Rose's mother Jackie Tyler, and Noel Clarke as Rose's boyfriend Mickey Smith. Other actors and television presenters who appeared in the series included Mark Benton, Zoë Wanamaker, Simon Callow, Eve Myles, Penelope Wilton, Annette Badland, David Verrey, Matt Baker, Andrew Marr, Corey Johnson, Simon Pegg, Anna Maxwell-Martin, Tamsin Greig, Shaun Dingwall, Florence Hoath, Richard Wilson, Jo Joyner, Davina McCall, Paterson Joseph, Anne Robinson, Trinny Woodall, and Susannah Constantine."]}, {"page": "I Dreamt I Dwelt in Marble Halls", "response": ["* The aria is played and sung by the character Clementina Cavendish (Florence Hoath) in the 1998 film The Governess."]}, {"page": "The Demon Headmaster (1996 TV series)", "response": ["* Florence Hoath as Bess (episodes 4–6) "]}, {"page": "Back to the Secret Garden", "response": ["Geraldine (Florence Hoath), who is jealous of Lizzie, learns that Ms. Sowerby gave the key to Lizzie, and persuades Steven to steal it in revenge for Lizzie's rejection of his feelings. When Lizzie finds the key missing, she assumes that Robert has taken it, knowing of his animosity towards her. She goes to find the key with Robert and discovers that it was Steven (Justin Girdler) who took it, on Geraldine's instructions, and threw the key in the pond. Lizzie confronts Geraldine, who initially denies it, but confesses when Martha punishes her for being a liar.", "* Florence Hoath as Geraldine"]}, {"page": "Innocent Lies", "response": ["* Florence Hoath - Angela Cross"]}, {"page": "Tom's Midnight Garden (film)", "response": ["* Florence Hoath ... Hatty (12/13 years)"]}, {"page": "A Pin for the Butterfly", "response": ["A Pin for the Butterfly is a 1994 British-Czech drama film directed by Hannah Kodicek and starring Ian Bannen, Hugh Laurie and Florence Hoath. A Pin for the Butterfly (1994): at the BFI The screenplay concerns a young girl who tries to come terms with growing up in Stalinist Czechoslovakia. It was screened at the 1994 Cannes Film Festival.", "* Florence Hoath ...  Marushka "]}, {"page": "Lu Kemp", "response": ["| Ian Brooker, Kenneth Cranham, Tony Curran, Paul Dinnen, Florence Hoath, Sally Hawkins, Karl Johnson, Gerrard McArthur, Fenella Woolgar"]}, {"page": "19th Youth in Film Awards", "response": ["*Florence Hoath - FairyTale: A True Story"]}, {"page": "Young Artist Award for Best Leading Young Actress in a Feature Film", "response": ["|Florence Hoath || Fairy Tale: A True Story||Paramount Pictures"]}, {"page": "The Haunting of Helen Walker", "response": ["*Florence Hoath as Flora Goffe"]}]}}