{"wiki_id": "http://www.wikidata.org/entity/Q5467233", "itemLabel": "Forbes Collins", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Forbes_Collins", "wikipedia_page": {"main": "Forbes Collins (born 29 July 1941) is a British actor.\nHe is best known for his role as King John in the popular comedy Maid Marian and Her Merry Men. He also starred in the episode All About Scoring, Innit? in the drama, Minder, playing Arklow, as well as appearing as Jonas in Jesus of Nazareth (1977), some episodes of the first series of Blackadder, Worzel Gummidge series 2, episode 4 as Sergeant Beetroot and playing the Chief Officer in Doctor Who's Vengeance on Varos.\nCollins also played Zacky Martin in Poldark (1975), playing a leading male member in the village of Sawle and supporter of Captain Poldark, whose house Nampara was nearby.  When the villagers of Sawle try one of their own for murder, Zacky is prominent in leading the process, advocating using \"the old way\".  This uses a candle which, should it stop burning before the end, is taken as 'proof' of guilt.  In Poldark, with 'sentence' passed, as the 'guilty' man (who professes his genuine guilt) is taken away, the viewer sees that the wick in the candle had been pre-cut, and the flame would have naturally extinguished anyway.  In the quietly memorable and chilling scene that follows, the 'guilty' man is hurled from the cliffs to his death.\nOther appearances include the 1974 \"Dixon of Dock Green\" episode, \"Seven For A Secret - Never To Be Told\".  His character, Pengelly, appears to have withheld information from Dock Green police who are investigating the death of a woman in a gas explosion.  He has also played policemen himself, notably Chief Superintendent Bailey in three episodes of the P. D. James-penned Adam Dalgliesh story, \"Shroud For A Nightingale\" (which TV mini-series starred Roy Marsden as Dalgliesh). His film career includes roles in The Hiding Place (1975), Intimate Games (1976), Black Joy (1977), Gulag (1985), Hitler's SS: Portrait in Evil (1985), Biggles (1986) and The Lady and the Highwayman (1988).", "link_mentions": [{"page": "Maid Marian and Her Merry Men", "response": ["The programme was much appreciated by children and adults alike, and has been likened to Blackadder, not only for its historical setting and the presence of Tony Robinson (as well as early, uncredited, script editing work being undertaken by Richard Curtis), but also for its comic style. It is more surreal than Blackadder, however, and drops even more (deliberate) anachronisms. Many of the show's cast such as Howard Lew Lewis, Forbes Collins, Ramsay Gilderdale and Patsy Byrne had previously appeared in various episodes of Blackadder alongside Robinson. Like many British children's programmes, there is a lot of social commentary sneakily inserted, as well as witty asides about the Royal family, buses running on time, etc. Many of the plots spoofed or referenced film and television shows including other incarnations of Robin Hood in those media.", "* King John (Forbes Collins, who also played John's brother, Richard the Lionheart, in the episode \"The Whitish Knight\", and Queen Eleanor, Guy of Gisbourne's mother, the joke being that all Royals look alike): a violent and unstable monarch. He is narcissistic and insecure, and becomes very angry at the thought of being unpopular with the peasants. His brother, who was thought to be a wise ruler who would bring England back to a Golden Age, is identical."]}, {"page": "1977 in film", "response": ["| Jesus of Nazareth || ITC Entertainment / RAI / NBC || Franco Zeffirelli (director/screenplay); Anthony Burgess, Suso Cecchi d'Amico (screenplay); Robert Powell, Anne Bancroft, Ernest Borgnine, Laurence Olivier, Christopher Plummer, Anthony Quinn, Rod Steiger, James Earl Jones, Peter Ustinov, Claudia Cardinale, Valentina Cortese, James Farentino, Stacy Keach, Tony Lo Bianco, James Mason, Ian McShane, Donald Pleasence, Fernando Rey, Ralph Richardson, Michael York, Olivia Hussey, Cyril Cusack, Ian Holm, Yorgo Voyagis, Ian Bannen, Marina Berti, Regina Bianchi, Maria Carta, Lee Montague, Renato Rascel, Oliver Tobias, Norman Bowler, Robert Beatty, John Phillips, Ken Jones, Nancy Nevinson, Renato Terra, Roy Holder, Jonathan Adams, Oliver Smith, Murray Salem, Tony Vogel, Michael Cronin, Derek Godfrey, Renato Montalbano, John Duttine, Keith Skinner, Cyril Shaps, John Tordoff, Francis de Wolff, Mark Eden, Bruno Barnabe, Simon MacCorkindale, Forbes Collins, Martin Benson, Carl Forgione, Donald Sumpter, Pino Colizzi, Robert Brown, Harold Bennett, Abdelmajid Lakhal || Epic, Drama || Live Action"]}, {"page": "Jesus of Nazareth (TV series)", "response": ["* Forbes Collins as Jonas"]}, {"page": "List of Maid Marian and Her Merry Men episodes", "response": ["#The Whitish Knight: A mysterious white knight is seen around Worksop, who may be King John's brother, returning from the crusades. Meanwhile the fate of Rip-Off, the giant teddy bear is to be determined. (This episode features Forbes Collins in a dual role as King John and his brother Richard.)"]}, {"page": "Play of the Month", "response": ["|David Leland,Gabrielle Lloyd,Richard Durden,Patrick Stewart,Allan Surtees,Barry Jackson,John Kane,Alan Gerrard,Forbes Collins,Reg Pritchard,Eric Mason,Edwin Finn,John Herrington,George Cormack,Trevor Lawrence,Carl Forgione,Brian Grellis"]}, {"page": "The Hiding Place (film)", "response": ["* Forbes Collins as Mason Smit"]}, {"page": "List of The Professionals episodes", "response": ["| Michael Kitchen, James Cosmo, Ed Devereaux, Billy Murray, Barbara Kellerman, Forbes Collins, Sean Caffrey, Keith Marsh"]}, {"page": "Hammer House of Mystery and Suspense", "response": ["| Season Hubley, Leigh Lawson, Norman Bird, William Hootkins, Oscar Quitak, Forbes Collins, Christopher Ellison"]}, {"page": "Witchsmeller Pursuivant", "response": ["* Forbes Collins as Dopey Jack, A Peasant"]}, {"page": "The Black Seal", "response": ["* Forbes Collins as the Trusting Father"]}, {"page": "Cultural depictions of Richard I of England", "response": ["*Forbes Collins in \"The Whitish Knight\" episode of the BBC children's comedy series Maid Marian and her Merry Men (1989), in which he also played Prince John."]}, {"page": "Cultural depictions of John, King of England", "response": ["*Forbes Collins in the BBC children's comedy series Maid Marian and her Merry Men (1989) plays John as a cowardly, overweight, dimwitted buffoon."]}, {"page": "List of Minder episodes", "response": ["|colspan=\"3\"|Guest stars: Karl Howman as Danny Varrow, Sean Caffrey as Leo Rafferty, Forbes Collins as Arklow, Adrienne Posta as Jenny, George Sweeney as Clifton Fields, Anthony Douse as Ronnie Raikes, Martin Neil as Reporter."]}, {"page": "Just Ask for Diamond", "response": ["* Forbes Collins - Henry von Falkenberg "]}, {"page": "John Wycliffe: The Morning Star", "response": ["*Forbes Collins as \"Peasant\""]}, {"page": "The Fruit Machine (1988 film)", "response": ["* Forbes Collins - John Schlesinger"]}, {"page": "List of LGBT-related films of 1988", "response": ["| ||  || United Kingdom || Drama || Emile Charles, Tony Forsyth, Robert Stephens, Robbie Coltrane, Clare Higgins, Bruce Payne, Carsten Norgaard, Kim Christie, Louis Emerick, Julie Graham and Forbes Collins ||a.k.a. Wonderland"]}]}}