{"wiki_id": "http://www.wikidata.org/entity/Q5460883", "itemLabel": "Florentia Sale", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Florentia_Sale", "wikipedia_page": {"main": "Florentia Sale (née Wynch; 13 August 1790 – 6 July 1853) was an Englishwoman who travelled the world while married to her husband, Sir Robert Henry Sale, a British army officer. She was dubbed \"the Grenadier in Petticoats\" for her travels with the army, which took her to regions such as Mauritius, Burma and India, and various other areas under the control of the British Empire.", "link_mentions": [{"page": "First Anglo-Afghan War", "response": ["The majority of the British troops returned to India, leaving 8,000 in Afghanistan, but it soon became clear that Shuja's rule could only be maintained with the presence of a stronger British force. The Afghans resented the British presence and the rule of Shah Shuja. As the occupation dragged on, the East India Company's first political officer William Hay Macnaghten allowed his soldiers to bring their families to Afghanistan to improve morale;Dupree, L. Afghanistan. Princeton: Princeton Legacy Library, 1980. p. 379 this further infuriated the Afghans, as it appeared the British were setting up a permanent occupation.Perry, James Arrogant Armies, Edison: CastleBooks, 2005 pp. 120–21 Macnaughten purchased a mansion in Kabul, where he installed his wife, crystal chandelier, a fine selection of French wines, and hundreds of servants from India, making himself completely at home. Macnaughten, who had once been a judge in a small town in Ulster before deciding he wanted to be much more than a small town judge in Ireland, was known for his arrogant, imperious manner, and was simply called \"the Envoy\" by both the Afghans and the British. The wife of one British officer, Lady Florentia Sale created an English style garden at her house in Kabul, which was much admired and in August 1841 her daughter Alexadrina was married at her Kabul home to Lieutenant John Sturt of the Royal Engineers. The British officers staged horse races, played cricket and in winter ice skating over the frozen local ponds, which astonished the Afghans who had never seen this before."]}, {"page": "Petticoat", "response": ["The early feminist Mary Wollstonecraft was disparaged by Horace Walpole as a \"hyena in petticoats\". Florentia Sale was dubbed \"the Grenadier in Petticoats\" for travelling with her military husband Sir Robert Henry Sale around the British Empire."]}, {"page": "Mohan Lal Kashmiri", "response": ["During the First Anglo-Afghan War, he was instrumental in setting up and expanding the British intelligence network in Afghanistan and is also alleged to have had a major hand in arranging the assassination, by poisoning, of Mir Masjidi Khan, a major Afghan resistance leader.Lady Florentia Sale, Journal of the Disasters in Afghanistan, 1841-42, 1843, p.141 He found out and handed over to the British authorities secret letters written by the rulers of Kandahar to Mehrab Khan, the ruler of Kalat, exhorting him not to allow passage to the invading British army. He managed to obtain the services of very important functionaries like Mohammed Tahir, Haji Khan Kakari, Abdul Majeed Khan, Akhundzada Ghulam and Mullah Nasooh in Kandahar and Sardar Abdul Rashid Khan, a nephew of the Emir Sardar Dost Mohammad Khan in Ghazni. He played a major role in securing the release of British prisoners held hostage in Bamiyan. He tried to bring peace between the British and the Afghans during such inflammatory situations."]}, {"page": "1842 retreat from Kabul", "response": ["Performances included Shakespeare's A Midsummer Night's Dream. It was considered a special honour to be invited to evening soirées hosted by Lady Florentia Sale, the wife of Brigadier-General Robert Henry Sale. Such social gatherings often saw the serving of salmon and stew with madeira, port and champagne. Under these conditions, many of the East India Company troops were sent back to their garrisons in India."]}, {"page": "Lady Florentia Sale", "response": ["#REDIRECT Florentia Sale"]}, {"page": "Lady Sale", "response": ["#REDIRECT Florentia Sale"]}, {"page": "The Great Game: Afghanistan", "response": ["#Bugles at the Gates of Jalalabad by Stephen Jeffreys – Four buglers outside Jalalabad keep watch for survivors from the Massacre of Elphinstone's Army, while Lady Florentia Sale reads her diary."]}, {"page": "Mir Masjidi Khan", "response": ["Sahibzada Mir Masjidi Khan (died 1841) is one of many celebrated Afghan resistance leaders from Shamali Plain who opposed the installation of Shuja Shah Durrani (or 'Shah Shujah') as Emir of Afghanistan by the Government of British India during the First Anglo-Afghan War. He kept up a fierce struggle against the occupation forces in and around Kabul and Northern Afghanistan, until his death.Lady Florentia Sale, Journal of the Disasters in Afghanistan', 1841-42, Pub. 1843, pp.140-141"]}, {"page": "Alexander Wynch", "response": ["He was father of George Wynch, and so grandfather of Florentia Sale, wife of Robert Henry Sale. His daughter Frances became notorious when she eloped with Sir William Jervis Twysden, 7th Baronet."]}, {"page": "Sale (surname)", "response": ["*Florentia Sale (1790–1853), English writer"]}, {"page": "Begum Johnson", "response": ["Her sister Sophia married Alexander Wynch, grandfather of Florentia Sale, author of A Journal of the Disasters in Afghanistan, 1841–42. Frances spent the first few years of her life in south India (the Madras Presidency) and much of her later life in Eastern India (the Bengal Presidency)."]}]}}