{"wiki_id": "http://www.wikidata.org/entity/Q5460354", "itemLabel": "Flora Solomon", "itemDescription": "British activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Flora_Solomon", "wikipedia_page": {"main": "Flora Solomon, OBE (née Benenson; 28 September 1895 – 18 July 1984) was an influential Zionist. She was the first woman hired to improve working conditions at Marks & Spencer in London. She was the mother of Peter Benenson, founder of Amnesty International.", "link_mentions": [{"page": "Kim Philby", "response": ["Alexander Orlov (born Lev Feldbin; code-name Swede), Philby's controller in Madrid, who had once met him in Perpignan, France, also defected. To protect his family, still living in the USSR, Orlov said nothing about Philby, an agreement Stalin respected. On a short trip back from Spain, Philby tried to recruit Flora Solomon as a Soviet agent; she was the daughter of a Russian banker and gold dealer, a relative of the Rothschilds, and wife of a London stockbroker. At the same time, Burgess was trying to get her into MI6. But the rezident (Russian term for spymaster) in France, probably Pierre at this time, suggested to Moscow that he suspected Philby's motives. Solomon introduced Philby to the woman who would become Philby's second wife, Aileen Furse. Solomon went to work for the British retailer Marks & Spencer."]}, {"page": "Victor Rothschild, 3rd Baron Rothschild", "response": ["Flora Solomon claims in her autobiography that in August 1962, during a reception at the Weizmann Institute, she told Rothschild that she thought that Tomás Harris and Kim Philby were Soviet spies."]}, {"page": "Benenson", "response": ["*Flora Solomon (née Benenson), (1895–1984) Russian-born British social activist"]}, {"page": "Tomás Harris", "response": ["In 1962, Flora Solomon – a friend of Kim Philby – told Victor Rothschild, who had worked with MI6 during World War II, that she thought that Philby and Tomás Harris had been Soviet spies,Biography of Flora Solomon since the 1930s. \"Those two were so close as to give me an intuitive feeling that Harris was more than a friend.\"Solomon, F. Baku to Baker Street (1984) p. 226"]}, {"page": "Flora Benenson", "response": ["#REDIRECT Flora Solomon"]}, {"page": "1946 New Year Honours (MBE)", "response": ["* Flora Solomon. For services to Government Departments in connection with welfare work."]}]}}