{"wiki_id": "http://www.wikidata.org/entity/Q546155", "itemLabel": "Trevor Colman", "itemDescription": "British politician (born 1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Trevor_Colman", "wikipedia_page": {"main": "Bernard Trevor Colman (born 27 August 1941) is a former UK Independence Party politician.  He was a Member of the European Parliament (MEP) for South West England. He represented the 2nd seat in the constituency.", "link_mentions": [{"page": "Graham Booth", "response": ["Booth retired from his role as a UKIP MEP on 1 October 2008 and was replaced by the next candidate on the list, Trevor Colman. He continued to be a keen activist in and around the bay until his death in December 2011."]}, {"page": "List of members of the European Parliament for the United Kingdom (2004–2009)", "response": ["Trevor Colman (from 1 October 2008)"]}, {"page": "List of members of the European Parliament (2004–2009)", "response": ["|Trevor Colmanfrom 1 October 2008||United Kingdom||South West England||UKIP||IND/DEM", "|30 September 2008||Graham Booth||United Kingdom||UKIP||IND/DEM||Replaced by Trevor Colman"]}, {"page": "South West England (European Parliament constituency)", "response": ["| colspan=\"3\" | Trevor ColmanAppointed in 2008 to replace Graham Booth.UKIP"]}, {"page": "Sir James Smith's School", "response": ["*Trevor Colman - UKIP MEP for South West England. (2008–14)‘COLMAN, (Bernard) Trevor’, Who's Who 2015, A & C Black, an imprint of Bloomsbury Publishing plc, 2015; online edn, Oxford University Press, 2014 ; online edn, Oct 2014 accessed 2 Dec 2014"]}, {"page": "St Breward", "response": ["* Trevor Colman, former UKIP MEP was born and raised in St Breward."]}, {"page": "Europe of Freedom and Democracy", "response": ["In March 2010 it was announced that MEP Nikki Sinclaire had had the UKIP whip withdrawn. Sinclaire had refused to join the EFD on the grounds that it was a grouping with \"extreme views\" and consequently had not sat with her UKIP colleagues in the European parliament. In June 2010 MEP Mike Nattrass also left the EFD, albeit on other grounds than Sinclaire, stating that \"I don't share the same principles of some of the Group, on balance, the majority of the Group want to stay in the EU and I've always believed that we should leave.\" Nattrass later rejoined the group in December 2012. In March 2011 MEP Trevor Colman left the EFD, allegedly due to an \"unresolved dispute over financial and staffing issues.\" However Colman continued to represent UKIP as a Non-Attached MEP. On 24 May 2011, British MEP David Campbell Bannerman defected to the Conservative Party, and the European Conservatives and Reformists (ECR) group.", "| 10As of May 2014, 24  MEPs belong to the United Kingdom Independence Party but one of these – Trevor Colman is no longer a member of the Europe of Freedom and Democracy group. Mike Nattrass rejoined the EFD in december 2012"]}, {"page": "List of members of the European Parliament (2009–2014)", "response": ["#Trevor Colman"]}]}}