{"wiki_id": "http://www.wikidata.org/entity/Q5478613", "itemLabel": "Melanie Hill", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Melanie_Hill", "wikipedia_page": {"main": "Melanie Jane Hill (born 11 January 1962) is an English actress, best known for playing Hazel Redfern in Auf Wiedersehen, Pet (1985–1986), Aveline in Bread (1986–1991), Rita Dolan in Kay Mellor drama Playing the Field (1998–2002),  Maggie Budgen in the BBC One school-based drama series Waterloo Road (2012–2015), Julie Travers in BBC One drama series The Syndicate (2015) and Cathy Matthews in ITV soap opera Coronation Street (2015–present)", "link_mentions": [{"page": "Auf Wiedersehen, Pet", "response": [":Barry (Timothy Spall) is a bright, well-meaning West Midlander from the Black Country (he mentions connections with West Bromwich and Wolverhampton and has a poster of Wolverhampton Wanderers F.C. on the wall of his office). He is an electrician with a large vocabulary and a motorbike, and is also dull, bumbling and bashful. His tendency to inadvertently bore others and to look on the bleak side of things are mocked by his mates, but they retain some affection for him. He has been married twice, first to a local girl named Hazel (played by Melanie Hill), who left him for another woman, which is found out in the third series. He then later marries the glamorous Russian Tatiana played by Branka Katic. Both marriages end in divorce, but at the end of the special two part series he is reconciled with Tatiana especially now that she is expecting Barry's child, a result of an encounter back in UK.", "*Melanie Hill as Hazel Taylor: 1st Wife of Barry (Series 2)"]}, {"page": "Scarborough, North Yorkshire", "response": [" were filmed on location in Scarborough and surrounds. Also shot in the Scarborough (borough) & North York Moors are over 90 films, documentaries and various TV programmes. Films include An Inspector Calls, Miranda, Dancing Queen, Beltenebros, The Brides in the Bath, Screwed, The Damned United, Scarborough, A is for Acid and Saint Maud. Television series filmed in the area include Heartbeat, its spin-off series The Royal, CBBC's All at Sea, BBC1's Rosie, BBC1's Remember Me, German TV crime drama, The Search, scenes from the second series of Five Days and an episode each of Barbara, Coronation Street & Last of the Summer Wine. The 2015 series of The Syndicate starring Anthony Andrews, Melanie Hill and Lenny Henry also filmed scenes in Scarborough.  A sitcom named  Scarborough was filmed in the town in 2019. The show being the brainchild of Derren Litten the creator of ITV hit Benidorm was based on a group of friends who meet up for Karaoke nights in the town. The show first aired on BBC1 on 6 September 2019 in a primetime Friday night slot (9:30 pm) the day before transmission the first two episodes were given a 'world premiere' to an audience at the Stephen Joseph Theatre. The third series of reality TV show Celebs on the Farm, was filmed on location in the outskirts of the town, in 2021."]}, {"page": "Cape Wrath (TV series)", "response": ["* Melanie Hill as Brenda Ogilvie"]}, {"page": "Sean Bean", "response": ["Bean has married five times and divorced four times. He married his secondary school sweetheart Debra James on 11 April 1981, and they were divorced in 1988. He met actress Melanie Hill at RADA, and they were married on 27 February 1990. Their first daughter was born in October 1987, and their second was born in September 1991. Their marriage ended in divorce in August 1997. During the filming of Sharpe, Bean met actress Abigail Cruttenden, and they were married on 22 November 1997. Their daughter was born in November 1998. They were divorced in July 2000. In addition to his three children, Bean has four grandchildren."]}, {"page": "Bread (TV series)", "response": ["The only Boswell daughter was Aveline (Gilly Coman/Melanie Hill), a colourful, enduring model who married Protestant vicar Oswald Carter (Giles Watling) at the end of series 4 (to staunchly-Catholic Nellie's outrage); after trying to conceive throughout series 5, Aveline gives birth to Ursula in series 6.", "| Melanie Hill || 35 || 5–7 || 1989–1991", "The theme tune was sung by the cast members and was released on BBC Records but failed to make the UK singles chart. The theme was re-recorded for the fifth series of the show, due to BBC1's transition from mono to NICAM stereo sound – the original theme had been recorded in mono - and also to allow Graham Bickley and Melanie Hill, who joined the cast in Series 5 replacing the original Joey and Aveline respectively, to replace the originals in the vocals."]}, {"page": "Brassed Off", "response": ["|Melanie Hill"]}, {"page": "Juliet Bravo", "response": ["A number of famous names, either of the time or of the future, appeared in the show. They included David Ryall, Kevin Whately, Eric Richard, Jeff Rawle, Jean Boht, Patricia Hayes, Peter Jeffrey, Peter Martin, Brenda Fricker, David Daker, Andrew Burt, Frances White, Malcolm Terris, Joe Gladwin, Sara Sugarman, Tenniel Evans, Nadim Sawalha, Jack Smethurst, John Savident, William Gaunt, Colin Baker, Kenneth Waller, Rita May, Stephen Yardley, John Woodvine, Stephen McGann, Leslie Schofield, Alan Parnaby, Shirley Stelfox, Maggie Ollerenshaw, John Quarmby, Neil Morrissey, Del Henney, Iain Cuthbertson, Leslie Sands, Hilda Braid, Melanie Hill, John Challis, Paul Chapman, Simon Williams, Christopher Ettridge, George Irving, Bill Wallis, Carolyn Pickles, Jonathan Newth, Kenneth Cope, Sally Whittaker, Karl Howman, Diana Coupland, Martin Jarvis, Rosalind Ayres, Yvette Fielding, Bert Parnaby, Robert Glenister, Mona Hammond, Steve Hodson, Danny O'Dea and Bernard Kay."]}, {"page": "Norris Cole (Coronation Street)", "response": ["Norris leaves to stay with Emily in Edinburgh following her return from volunteering with her nephew Spider in Peru He sells The Kabin to Brian Packham (Peter Gunn) and Cathy Matthews (Melanie Hill), to the fury of Rita. On 7 June 2019, after a final drink at the Rovers with his friends, Norris leaves Coronation Street for Scotland with Emily's niece Freda Burgess. As the taxi drives away, Norris reminisces about his time on the street and says he will miss it and all the people on it. In 2020, Norris and Freda move into Stillwaters, a gated retirement community and are joined by Ken Barlow (William Roache) and Claudia Colby (Rula Lenska) for a short time. The following year, Norris makes contact with Rita and Ken via text message with an important announcement; However, when Ken calls Norris, a Paramedic answers and tells him Norris is being rushed to hospital following a suspected stroke. Ken, Rita and Mary arrive at the hospital, only to be told by Freda that Norris has died. Norris’ funeral took place on 24 September 2021."]}, {"page": "Roy Cropper", "response": ["In April 2015, Roy meets a widow called Cathy Matthews (Melanie Hill) at the allotment who tells him that her husband Alan has died and Roy reveals his own struggle with grief when Hayley died. Roy gets on well with Cathy and decide to meet up to go to places such as the art gallery. Carla thinks against this and takes it as disrespect to his late wife Hayley. In July 2015, Roy visits Cathy at her house and is shocked to discover that she keeps all her rubbish piled up in the living room. Roy thinks that she needs support but Cathy is against the idea and will not take no for an answer. Roy prepares to go to Deirdre's 60th birthday party after spending the day with Cathy when Carla tells him the terrible news that Deirdre died, Roy reflects on the first time he met Deirdre and feels upset that she has died, Cathy comforts him."]}, {"page": "Crocodile Shoes", "response": ["* Melanie Hill as Emma Shepperd"]}, {"page": "Weatherfield", "response": ["The Kabin is also at the junction of Coronation Street and Viaduct Street. The Kabin mainly sells newspapers, magazines, traditional sweets and seasonal goods (Christmas, Easter, Halloween). Originally opened by Rita Sullivan (Barbara Knox) as the Korner Kabin on Rosamund Street, it moved to its current location in 1990. In late 2009, Rita sells The Kabin to employee Norris Cole (Malcolm Hebden) so that she can go travelling. When she returns, she is re-employed by Norris. The Kabin, along with D&S Alahan's Corner Shop and The Joinery wine bar, is involved in the tram crash in December 2010. The tram rips through the shop and the flats above, with Rita inside the shop. After initially believing that Rita is out at a friend's, Norris and Emily Bishop (Eileen Derbyshire) raise the alarm and Rita is eventually rescued. In 2019, Norris announces to Rita that he is selling The Kabin and later sells it to Brian Packham (Peter Gunn) and Cathy Matthews (Melanie Hill). Rita then finds out and tells Brian she is quitting as she does not want to work for them. Brian and Cathy apologise to Rita and offer her the job of manageress. ", "Roy's Rolls is a café, situated on Victoria Street, which is owned by Roy Cropper (David Neilson). Hayley Cropper (Julie Hesmondhalgh), Roy's wife, was co-owner until her death in 2014. It was managed by Anna Windass (Debbie Rush) until she went to prison in 2017. Mary Taylor (Patti Clare) is a stand-in waitress here. Roy's fiancée Cathy Matthews (Melanie Hill) worked here until they separated in 2016. Shona Ramsey (Julia Goulding) and Aggie Bailey (Lorna Laidlaw) are currently employed at the café. It was formally located at 12 Rosamund Street before Roy bought Gail out of the business and moved to the current premises in 1999.", "When the shop is sold to Dev in 2008, Mel leaves to pursue her police career. Ryan Connor (Sol Heras) and Katy Armstrong (Georgia May Foote) work here in the build–up to their affair, which leads to both the breakdown of Katy's relationship with Chesney Brown (Sam Aston) and Ryan's departure. Chesney later begins working here when the market where he works is closed down. He is later given the role of manager. Gemma Winter (Dolly-Rose Campbell) is employed to work here in 2016. Cathy Matthews (Melanie Hill) started working here in 2017."]}, {"page": "Amy Barlow", "response": ["When Todd Grimshaw (Bruno Langley) and his boyfriend Billy Mayhew (Daniel Brocklebank) become guardians of Billy's goddaughter, Summer Spellman (Matilda Freeman), Tracy brings Amy to meet Summer. Amy and Summer do not interact and, in Billy and Todd's absence, they argue and Amy accuses Summer of hitting her. When Amy and Summer have their hair done for school and are not allowed highlights, Summer uses bleach and other products to do so for Amy and Asha Alahan (Tanisha Gorey). Amy's hair turns orange and Todd, Amy and Summer lie to Tracy that Amy wants a sleepover with Summer for a chance to fix it, but Tracy finds out about the hair. In September 2017, Amy and Asha put blue paint on the window wipers of Roy's car, angering Cathy Matthews (Melanie Hill) and Brian Packham (Peter Gunn), who make Amy and Asha put on a Boney M tribute act for their punishment. Wanting to be friends with Amy and Asha, Summer uses shaving foam to draw an inappropriate image on a teacher's car, but is caught, which results in Billy and Todd being called in. Simon attempts to force Summer to smoke cigarettes he found, but Summer takes them for herself and smokes them when she is emotional. Summer is found unconscious by Simon and Amy and is taken to hospital, where it turns out she smoked spice and Billy and Todd make amends. Peter and his partner, Toyah Battersby (Georgia Taylor), find out from Simon, Amy, Aadi and Asha that Simon had the cigarette. Amy is not happy when Steve and Tracy get back together. After lying about her whereabouts, Steve and Tracy turn up at one of Amy's friends party, where Amy is caught kissing a boy. Amy helps Summer to look for Billy, but are put in danger when a homeless man tricks them into finding out his whereabouts, but Peter gets them away."]}, {"page": "When Saturday Comes (film)", "response": ["*Melanie Hill – Mary Muir"]}, {"page": "Playing the Field", "response": ["*Melanie Hill ... Rita Dolan"]}, {"page": "Waterloo Road (TV series)", "response": ["The series 10 characters consisted of Headteacher Vaughan Fitzgerald (Neil Pearson), Deputy Headteacher Lorna Hutchinson (Laura Aikman), Head of English Christine Mulgrew (Laurie Brett), Head of Modern Languages George Windsor (Angus Deayton), Home Economics Teacher and Housemistress Maggie Budgen (Melanie Hill); History Teacher Audrey McFall (Georgie Glen), GPD Teacher Guy Braxton (Regé-Jean Page), Science Teacher Marco D'Olivera (Stefano Braschi), Geography Teacher Olga Fitzgerald (Pooky Quesnel) and School Secretary Sonya Donnegan (Victoria Bush). An extensive set of pupils were prominent in the final series, including Rhiannon Salt (Rebecca Craven), Lenny Brown (Joe Slater), Lisa Brown (Caitlin Gillespie), Darren Hughes (Mark Beswick), Shaznay Montrose (Je'Taime Morgan Hanleyand), Justin Fitzgerald (Max Bowden), Leo Fitzgerald (Zebb Dempster), Kenzie Calhoun (Charlotte Beaumont), Scott Fairchild (Andrew Still), Carrie Norton (Tahirah Sharif), Bonnie Kincaid (Holly Jack), Dale Jackson (Finlay MacMillan) and Abdul Bukhari (Armin Karima)."]}, {"page": "Cardiac Arrest (TV series)", "response": ["* Melanie Hill as Sister Pamela Lockley (series 1)"]}, {"page": "Shopping (1994 film)", "response": ["*Melanie Hill - Sarah"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Melanie Hill (Acting Diploma 1983)"]}, {"page": "Leeds city centre", "response": ["*1989 – Melanie Hill"]}, {"page": "The Fugitives (TV series)", "response": ["*Melanie Hill as Glenda Banks, a single mother struggling to bring up Mel and her younger sister Kelly on a tight budget. Like mother, like daughter, their fiery personalities clash and they argue often. Despite this, she is a loving and devoted mum, heartbroken when Mel runs away."]}, {"page": "Carla Connor", "response": ["Months later, Tracy begins blackmailing Carla, threatening to tell Nick about her and Robert if she does not persuade Nick to sell the Bistro to Robert and leave Weatherfield. Robert and Leanne both put in matching offers for the Bistro, so Tracy demands £10,000 from Carla. Carla convinces Nick to sell the Bistro to Robert; he does, but Tracy continues taunting Carla. Closer to the wedding, Robert finds out what Tracy has been doing to Carla but they stay together. Nick and Carla break up when he feels guilty after throwing a mug at Carla, causing her to cut her face. They get back together when she supports him. On the wedding day, Tracy tries to ruin proceedings by sending the flowers to the wrong address. Carla feels guilty, so she tells Nick about the one-night stand with Robert; he manages to forgive her. Tracy then announces that she has been blackmailing Carla, which Nick finds more difficult to accept. They eventually marry but Nick instantly regrets it, leaving the venue and Carla in tears. Carla asks Roy to get his car so that she can flee Weatherfield. However, she instead gets in her own car. In front of her, Tracy taunts her and Carla speeds up her car to run Tracy over. Tracy moves but a truck drove by Tyrone Dobbs (Alan Halsall) and his girlfriend Fiz Stape (Jennie McAlpine) comes into her path and she swerves, knocking over Roy's partner, Cathy Matthews (Melanie Hill) before crashing into the postbox. Carla escapes unharmed, but Cathy lies on the ground motionless. Tyrone crashes into the Platt household, but he and Fiz also escape unharmed, with the help from Nick's half-brother David Platt (Jack P. Shepherd). Roy goes with Cathy to the hospital and as he is Carla, who is being held back by police, tries to apologise for what she has done. The next day, Carla decides to leave for Devon even though the car crashes are pending investigation. Before leaving, she visits the hospital to see Cathy. Cathy forgives her but Roy finds it more difficult to. She tells Roy she is leaving, but Cathy insists that he reconciles with Carla, however, he declares, \"Carla is who she is, and will never change\". Carla then says an emotional farewell to Johnny, Michelle, Aidan, and Kate. Tracy walks out of her florists and Carla declares, \"We're done\". She then gets in Johnny's car to depart. However, a bus comes and Roy dashes over. Johnny stops the car, with Roy and Carla sharing a final farewell. He forgives her for running over Cathy but tells her she should try to love herself. Carla then kisses Roy on the cheek before getting back in the car and leaving Weatherfield for a new life in Devon."]}, {"page": "Confessions of a Killer (The Bill)", "response": ["* June and Jim's Marriage Breakdown: A short lived marriage between Sergeant June Ackland and DC Jim Carver was brought to an abrupt end when Jim ended up £63,000 in debt after becoming addicted to gambling. When June remortgaged her home to pay off the debts, she had to return from a brief retirement to pay her second mortgage off. Whilst June was on a cruise without Jim, his ex-wife Marie (Melanie Hill) died of exposure after falling asleep whilst drunk, leaving Jim devastated. As he discovered June had returned to work, he was determined to get her back, but her resentment towards Jim led her to having an affair with PC Roger Valentine."]}, {"page": "Fatal Consequences (The Bill)", "response": ["At St. Hugh's hospital, Sergeant June Ackland attends to a female victim of domestic assault, trying her utmost to assist a nurse deal with the chaos of Halloween admissions to the hospital. As she exits the waiting room, PC Jim Carver is revealed to be there after hiding behind a newspaper to not be seen by June. The nurse takes him to room and he claims he was putting up a shelf that collapsed onto him. As the nurse leaves him to attend to another issue, June enters his cubicle after hearing him talk to the nurse. She is skeptical about his claim about the shelf, suspecting he is being abused by his wife Marie (Melanie Hill). While he fails to open up about the abuse, they end up reminiscing on their 20 years together at Sun Hill. Back at the station, the ambulance finally arrives for Juliet. Elsewhere at the station, DCs Rob Thatcher and Eva Sharpe interview a boy who was found in possession of Alan Best's phone and wallet. His son Gary continues to spiral as he awaits the news of his father, expecting he won't be found alive. After snapping at PC Honey Harman and Sergeant Dale Smith earlier in the evening, he then demands Rob gives him two minutes with the boy, unaware his horrified mother is standing right next to him. Back at the hospital, June begins getting emotional about why Jim needs to leave Marie for his own sake, the nurse interrupts and reveals that Juliet has been brought in. Finding Inspector Gold and Sergeant Murphy, they watch on in horror as the crash team fail to revive Juliet. As she succumbs to her injuries, June follows a distraught Sheelagh outside and tries to comfort her, however she snaps and runs off. June is later told the victim of domestic assault has left, unaware that she is the wife of the man arrested for Juliet's murder, and she shows up at Sun Hill to discover her husband has committed murder. As Jim comforts June at the hospital, Marie arrives and begins to cause a scene, unaware that they are only emotional because Juliet died. After changing her tone, she goes to leave with Jim, making a point of saying that Jim walked into a cupboard door, confirming June's suspicions that Marie has been abusing him. Back at the station, Sheelagh hears a voice call her name in the yard, but she doesn't see her ex-lover Des Taviner appear from behind a car, revealing to the viewers that he survived the Area Car crash and explosion several episodes earlier. In custody, a team swarm around Juliet's killer Mark Nevett, but while Superintendent Okaro orders them to get off him, PC Gabriel Kent reveals he has swallowed his tongue. As Rob and Eva find Alan Best's body, news reaches Gary at the station, who storms into custody and attacks Ellis as he heads back to his cell under guard. Ellis runs off out of the open door and into the yard, chased onto the roof by Gary and Smithy. Ellis knocks Smithy over on the roof, then proceeds to swing a metal bar at Gary; as he drops his guard, Gary flies at him, causing them both to fall off the roof and land on a passing van. The end credits are preceded by fireworks exploding in the skies above the station.", "* Marie Carver - Melanie Hill"]}, {"page": "List of people from Sunderland", "response": ["* Melanie Hill (1962–), actress"]}, {"page": "1962 in the United Kingdom", "response": ["*11 January – Melanie Hill, actress"]}, {"page": "The Hawk (1993 film)", "response": ["The Hawk is a 1993 British film starring Helen Mirren, George Costigan, Rosemary Leach, Owen Teale and Melanie Hill.", "* Melanie Hill as Norma"]}, {"page": "Dorothée Jemma", "response": ["| Melanie Hill"]}, {"page": "The Bill (series 19)", "response": ["After the show moved focus onto more soap opera type storylines in series 18, several long-term plots from this series focused on the personal lives of the characters. PC Nick Klein, who became addicted to cocaine in series 18, escalated into a crack addict that resulted in him having a stint in rehab. PC Luke Ashton was involved in a plot over a number of months that saw him come to terms with his homosexuality, marrying and later divorcing PC Kerry Young before leaving the show, actor Scott Neal's second stint ending after just over a year. Sergeant June Ackland took centre stage as she began a relationship with new character Gabriel Kent, portrayed by former Grange Hill and EastEnders actor Todd Carty, only for it to be revealed he was her long lost son; Kent would go on to become one of the show's most notorious villains. PC Jim Carver also had a major, long-term storyline, marrying victim of crime Marie Graham (Melanie Hill), later becoming subject to domestic violence."]}, {"page": "The Syndicate", "response": ["*Melanie Hill as Julie Travers"]}, {"page": "List of Waterloo Road characters", "response": ["*Maggie Budgen (Melanie Hill, series 8−10; supporting series 7), also Maggie Croft, is the Housemistress in Scotland and later a Home Economics Teacher, who is also the senior canteen assistant at both of the school's iterations. Maggie sells mail order cosmetics during school hours, which Grantly disapproves of until he sets himself up in competition. They later call a truce and begin working together, and Maggie supports Grantly after the death of his wife. They become romantically involved soon after, and Grantly proposes on the journey to Scotland. Maggie thrives at the schoolhouse, coming to see the children under her care as her own family. When Grantly suffers kidney failure, she begs the staff to consider becoming a donor and is delighted when Tom agrees. She also begins teaching when a strike leaves the school understaffed. In series 9, she supports Grantly's return to school and is devastated when he dies. She finds support in Connor Mulgrew, who she helps in his aspiration to become a chef."]}, {"page": "Hill (surname)", "response": ["*Melanie Hill (born 1962), English actor"]}, {"page": "The Street (British TV series)", "response": ["* Melanie Hill as Val Taylor"]}, {"page": "List of American films of 2007", "response": ["| Stardust || Paramount Pictures || Matthew Vaughn (director/screenplay); Jane Goldman (screenplay); Claire Danes, Michelle Pfeiffer, Robert De Niro, Charlie Cox, Sienna Miller, Ricky Gervais, Jason Flemyng, Rupert Everett, Ian McKellen, Peter O'Toole, Mark Strong, Kate Magowan, Joanna Scanlan, Sarah Alexander, Mark Heap, Julian Rhind-Tutt, Adam Buxton, David Walliams, Nathaniel Parker, Ben Barnes, Henry Cavill, David Kelly, Melanie Hill, Mark Williams, Jake Curran, Olivia Grant, George Innes, Dexter Fletcher, Eliot (Coco) Sumner, Mark Burns || Romance, Fantasy, Adventure"]}, {"page": "List of Cape Wrath characters", "response": ["Brenda Ogilvie (played by Melanie Hill) is the mother of Jezebel and the Brogans' neighbour. Her real name was Briony Thompson. It was revealed in the last episode that before she had come to Meadowlands, Brenda had been going out with a man who'd asked her out to a party, however when the relationship became serious he mistreated Brenda (then Briony Thompson) and demoralised her and daughter Jezebel calling her chubby. But because he had invited her to parties and social events Brenda loved him because she could be accepted, but that soon turned sour as he'd cover her up."]}, {"page": "Big Brother Panto", "response": ["Ten former Big Brother housemates took part. From Big Brother 1 were Nick Bateman and Melanie Hill, from series two was Narinder Kaur, from Big Brother 3 was Tim Culley, Jade Goody and Spencer Smith, from the fourth series was Anouska Golebiewski and the fifth series' was represented by Victor Ebuwa, Kitten Pinder and Marco Sabba. The housemates were paid for appearing.", "| Melanie Hill"]}, {"page": "White Girl (2008 film)", "response": ["White Girl is a 2008 BBC film directed by Hettie MacDonald and starring Anna Maxwell Martin, Holly Kenny, Daniel Mays, Melanie Hill, Jay Simpson, and Jade Islam. Written by Abi Morgan, it was made as part of the BBC's White Season. It portrays a white family who move from an area of Leeds that has predominantly White British inhabitants to an area of Bradford composed of inhabitants of South Asian heritage.", "*Melanie Hill – Sonya"]}, {"page": "Ella Smith (actress)", "response": ["In 2007, she was in Channel 4's Cape Wrath, in which she played the regular role of Jezebel Ogilvie, the daughter of Brenda Ogilvie (Melanie Hill). She also starred in ITV's series Sold as Phoebe."]}, {"page": "Shed Productions", "response": ["2005 also saw Shed's first foray into the realms of children's television when seven-part drama The Fugitives was commissioned by CITV. Starring Maureen Lipman, Jack Ellis and Melanie Hill, the show centred on two runaway teenagers and tackled head-on the serious subject of human cloning."]}, {"page": "NCS: Manhunt", "response": ["* Melanie Hill as Detective Sergeant Ruby Sparks"]}, {"page": "List of former Emmerdale characters", "response": ["|Avril Kent || Melanie Hill || 2005"]}]}}