{"wiki_id": "http://www.wikidata.org/entity/Q547039", "itemLabel": "Simon Schaffer", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Schaffer", "wikipedia_page": {"main": "Simon J. Schaffer (born 1 January 1955) is a professor of the history and philosophy of science at the Department of History and Philosophy of Science at the University of Cambridge and was editor of The British Journal for the History of Science from 2004 to 2009.", "link_mentions": [{"page": "Charles Babbage", "response": ["It was during this period that Babbage tried to enter politics. Simon Schaffer writes that his views of the 1830s included disestablishment of the Church of England, a broader political franchise, and inclusion of manufacturers as stakeholders. He twice stood for Parliament as a candidate for the borough of Finsbury. In 1832 he came in third among five candidates, missing out by some 500 votes in the two-member constituency when two other reformist candidates, Thomas Wakley and Christopher Temple, split the vote. In his memoirs Babbage related how this election brought him the friendship of Samuel Rogers: his brother Henry Rogers wished to support Babbage again, but died within days. In 1834 Babbage finished last among four.- Note some confusion as to the dates. In 1832, Babbage, Herschel and Ivory were appointed Knights of the Royal Guelphic Order, however they were not subsequently made knights bachelor to entitle them to the prefix Sir, which often came with appointments to that foreign order (though Herschel was later created a baronet)."]}, {"page": "History of science and technology", "response": ["*Simon Schaffer"]}, {"page": "Joseph Priestley", "response": ["Priestley's work on \"airs\" is not easily classified. As historian of science Simon Schaffer writes, it \"has been seen as a branch of physics, or chemistry, or natural philosophy, or some highly idiosyncratic version of Priestley's own invention\".Schaffer, 152. Furthermore, the volumes were both a scientific and a political enterprise for Priestley, in which he argues that science could destroy \"undue and usurped authority\" and that government has \"reason to tremble even at an air pump or an electrical machine\".Qtd. in Kramnick, 11–12; see also Schofield (2004), 121–24.", "Considering the extent of Priestley's influence, relatively little scholarship has been devoted to him. In the early 20th century, Priestley was most often described as a conservative and dogmatic scientist who was nevertheless a political and religious reformer.McEvoy (1983), 47. In a historiographic review essay, historian of science Simon Schaffer describes the two dominant portraits of Priestley: the first depicts him as \"a playful innocent\" who stumbled across his discoveries; the second portrays him as innocent as well as \"warped\" for not understanding their implications better. Assessing Priestley's works as a whole has been difficult for scholars because of his wide-ranging interests. His scientific discoveries have usually been divorced from his theological and metaphysical publications to make an analysis of his life and writings easier, but this approach has been challenged recently by scholars such as John McEvoy and Robert Schofield. Although early Priestley scholarship claimed that his theological and metaphysical works were \"distractions\" and \"obstacles\" to his scientific work, scholarship published in the 1960s, 1970s, and 1980s maintained that Priestley's works constituted a unified theory. However, as Schaffer explains, no convincing synthesis of his work has yet been expounded.Schaffer, 154–57. More recently, in 2001, historian of science Dan Eshet has argued that efforts to create a \"synoptic view\" have resulted only in a rationalisation of the contradictions in Priestley's thought, because they have been \"organized around philosophical categories\" and have \"separate[d] the producers of scientific ideas from any social conflict\".Eshet, 131."]}, {"page": "Reproducibility", "response": ["The first to stress the importance of reproducibility in science was the Irish chemist Robert Boyle, in England in the 17th century. Boyle's air pump was designed to generate and study vacuum, which at the time was a very controversial concept. Indeed, distinguished philosophers such as René Descartes and Thomas Hobbes denied the very possibility of vacuum existence. Historians of science Steven Shapin and Simon Schaffer, in their 1985 book Leviathan and the Air-Pump, describe the debate between Boyle and Hobbes, ostensibly over the nature of vacuum, as fundamentally an argument about how useful knowledge should be gained. Boyle, a pioneer of the experimental method, maintained that the foundations of knowledge should be constituted by experimentally produced facts, which can be made believable to a scientific community by their reproducibility. By repeating the same experiment over and over again, Boyle argued, the certainty of fact will emerge.", "The air pump, which in the 17th century was a complicated and expensive apparatus to build, also led to one of the first documented disputes over the reproducibility of a particular scientific phenomenon. In the 1660s, the Dutch scientist Christiaan Huygens built his own air pump in Amsterdam, the first one outside the direct management of Boyle and his assistant at the time Robert Hooke. Huygens reported an effect he termed \"anomalous suspension\", in which water appeared to levitate in a glass jar inside his air pump (in fact suspended over an air bubble), but Boyle and Hooke could not replicate this phenomenon in their own pumps. As Shapin and Schaffer describe, “it became clear that unless the phenomenon could be produced in England with one of the two pumps available, then no one in England would accept the claims Huygens had made, or his competence in working the pump”. Huygens was finally invited to England in 1663, and under his personal guidance Hooke was able to replicate anomalous suspension of water. Following this Huygens was elected a Foreign Member of the Royal Society. However, Shapin and Schaffer also note that “the accomplishment of replication was dependent on contingent acts of judgment. One cannot write down a formula saying when replication was or was not achieved”.Steven Shapin and Simon Schaffer, Leviathan and the Air-Pump, Princeton University Press, Princeton, New Jersey (1985)."]}, {"page": "Literature of Kashmir", "response": ["*Mir Tafazzul Hussain Khan Kashmiri (1727-1800), originally from Kashmir,Hamid Afaq Qureshi, The Mughals, the English & the rulers of Awadh, from 1722 A.D. to 1856 A.D., New Royal Book Co (2003), p.79Amaresh Misra, Lucknow, fire of grace: the story of its revolution, renaissance and the aftermath, HarperCollins Publishers India (1998), p. 57Purnendu Basu, Oudh and the East India Company, 1785-1801, Maxwell Company (1943), p. 22 born in SialkotSimon Schaffer, The Brokered World: Go-Betweens and Global Intelligence, 1770-1820, Science History Publications (2009), p. 53 where his parents moved and himself based in Lucknow where he served as Prime Minister (or diwan) to the Nawab of Oudh Asaf-ud-Daula thanks his erudition. He was called \"khan-e-allama\" (the Scholarly Khan)Surendra Mohan, Awadh Under the Nawabs: Politics, Culture, and Communal Relations, 1722-1856, Manohar Publishers & Distributors (1997), p.80 due to his deep scholarship on many subjects but is best known today for having translated Sir Isaac Newton's Philosophiæ Naturalis Principia Mathematica from Latin into Arabic.Edited by Bernard Lightman, The Circulation of Knowledge Between Britain, India and China, BRILL (2013), p.67"]}, {"page": "National Maritime Museum", "response": ["* 2015: Simon Schaffer"]}, {"page": "Science and technology studies", "response": ["* Simon Schaffer"]}, {"page": "1955 in science", "response": ["* January 1 – Simon Schaffer, English historian of science."]}, {"page": "Dan David Prize", "response": ["|Lorraine Daston, Evelyn Fox Keller, Simon Schaffer"]}, {"page": "In Our Time (radio series)", "response": ["The programme is considered one of the BBC's most successful projects, acknowledged to have \"transformed the landscape for serious ideas at peak listening time\". Frequent contributors to the programme since 1998 include A. C. Grayling, Angie Hobbs, Ian Stewart, Simon Schaffer, Martin Palmer,  John Mullan, Steve Jones,  Carolin Crawford, Paul Cartledge, Rana Mitter, and Julia Lovell."]}, {"page": "Erasmus Prize", "response": ["| 100px 100px || 2005 || Simon Schaffer and Steven Shapin || || "]}, {"page": "Simon schaffer", "response": ["#REDIRECT Simon Schaffer "]}, {"page": "Steven Shapin", "response": ["His books on 17th-century science include the \"classic book\" Leviathan and the Air-Pump: Hobbes, Boyle, and the Experimental Life (1985, with Simon Schaffer); his \"path-breaking book\" A Social History of Truth (1994), The Scientific Revolution (1996, now translated into 18 languages), and, on modern entrepreneurial science, The Scientific Life (2008).  A collection of his essays is Never Pure (2010). His current research interests include the history of dietetics and the history and sociology of taste and subjective judgment, especially in relation to food and wine.", "His honors include the John Desmond Bernal Prize (2001) and the Ludwik Fleck Prize of the Society for Social Studies of Science (1996), the Robert K. Merton Prize of the American Sociological Association, the Herbert Dingle Prize of the British Society for the History of Science (1999), a Guggenheim Fellowship (1979), the Derek Price Prize of the History of Science Society, a Fellowship at the Center for Advanced Study in the Behavioral Sciences, and, with Simon Schaffer, the Erasmus Prize (2005). He is a Fellow of the American Academy of Arts and Sciences. In 2014, he received the George Sarton Medal of the History of Science Society for career contributions to the field.", "* With Simon Schaffer, Leviathan and the Air-Pump: Hobbes, Boyle, and the Experimental Life; including a translation of Thomas Hobbes, Dialogus physicus de natura aeris by Simon Schaffer, Princeton, N.J.: Princeton University Press, 1985; 1989; new edition, 2011"]}, {"page": "Schaefer", "response": ["*Simon Schaffer (born 1955), English academic"]}, {"page": "Michael Hunter (historian)", "response": ["Hunter has been a wary defender of his turf, with scholars Steven Shapin and Simon Schaffer observing he has been \"consistently hostile\" to their more recent work on Robert Boyle. "]}, {"page": "Tarner Lectures", "response": ["| 2010 || Professor Simon Schaffer || When the stars threw down their spears: Histories of Astronomy and Empire"]}, {"page": "Robert Sharrock", "response": ["He also supplied prefaces to three of the physical treatises of Robert Boyle: Some Considerations touching the Usefulness of Experimental Philosophy (1663); New Experiments Physico-Mechanical (1665); and A Defence of the Doctrine touching the Spring and Weight of the Air (1669). Sharrock edited New Experiments and translated it into Latin.John B. West, Robert Boyle's landmark book of 1660 with the first experiments on rarified air, p. 33, J Appl Physiol 98: 31–39, 2005; PDF.Steven Shapin and Simon Schaffer, Leviathan and the Air Pump (1985), p. 236."]}, {"page": "George Sarton Medal", "response": ["*2013 – Simon Schaffer"]}, {"page": "1955 in the United Kingdom", "response": ["**Simon Schaffer, academic and historian of science and philosophy"]}, {"page": "Varndean College", "response": ["* Simon Schaffer, historian"]}, {"page": "List of important publications in philosophy", "response": ["* Steven Shapin and Simon Schaffer, Leviathan and the Air-Pump: Hobbes, Boyle, and the Experimental Life, 1985"]}, {"page": "Leviathan and the Air-Pump", "response": ["Leviathan and the Air-Pump: Hobbes, Boyle, and the Experimental Life (published 1985) is a book by Steven Shapin and Simon Schaffer. It examines the debate between Robert Boyle and Thomas Hobbes over Boyle's air-pump experiments in the 1660s. In 2005, Shapin and Schaffer were awarded the Erasmus Prize for this work."]}, {"page": "Experiments and Observations on Different Kinds of Air", "response": ["While working as a companion for Lord Shelburne, Priestley had a great deal of free time to engage in scientific investigations. The Earl even set up a laboratory for him. Priestley's experiments during his years in Calne were almost entirely confined to \"airs\" and from this work emerged his most important scientific texts: the six volumes of Experiments and Observations on Different Kinds of Air.See Gibbs 67–83 for a description of all of his experiments during this time; Thorpe, 170ff. These experiments helped repudiate the last vestiges of the theory of four elements; as one early biographer writes: \"taken collectively, [Priestley] did more than those of any one of his contemporaries to uproot and destroy the only generalisation by which his immediate predecessors had sought to group and connect the phenomena of chemistry\", however \"he was wholly unable to perceive this fact.\"Thorpe, 167–68. Priestley's work on \"airs\" is not easily classified. As historian of science Simon Schaffer points out, it \"has been seen as a branch of physics, or chemistry, or natural philosophy, or some highly idiosyncratic version of Priestley's own invention.\"Schaffer, 152. Also, the volumes were both a scientific and a political enterprise for Priestley; he argued in them that science could destroy \"undue and usurped authority,\" writing that the government has \"reason to tremble even at an air pump or an electrical machine.\"Qtd. in Kramnick, 11–12; see also Schofield, Vol. 2, 121–124."]}, {"page": "David Cayley", "response": ["| Simon Schaffer"]}, {"page": "Johann Wolfgang von Goethe", "response": ["* \"Goethe and the Science of the Enlightenment\" In Our Time, BBC Radio 4 discussion with Nicholas Boyle and Simon Schaffer (February 10, 2000)."]}, {"page": "Hobbes–Wallis controversy", "response": ["The Dialogus physicus, sive De natura aeris attacked Robert Boyle and other friends of Wallis who were forming themselves into a society (incorporated as the Royal Society in 1662) for experimental research. The full Latin title of the bookDialogus physicus, sive, De natura aeris conjectura sumpta ab experimentis nuper Londini habitis in Collegio Greshamensi, item de duplicatione cubi mentioned Gresham College as the experimental base of Boyle's group (see Gresham College and the formation of the Royal Society), followed immediately by a reference to the duplication of the cube, which in Hobbes's latest version was included as an appendix. Hobbes chose to take as the manifesto of the new academy Boyle's New Experiments touching the Spring of the Air (1660). Hobbes saw the whole approach as a direct contravention of the method of physical inquiry enjoined in the De Corpore. He had reasoned out his own conclusions years before from speculative principles, and he warned them that if they were not content to begin where he had left off, their work would come to naught. This attack from Hobbes was one of several at the time: other opponents of Boyle were Franciscus Linus and Henry More.Steven Shapin and Simon Schaffer, Leviathan and the Air-Pump (1985), p. 155, and translation of the Dialogus, pp. 345-391. The issues at stake now had broadened out, and this was a choice Hobbes made, with their implications reaching beyond those of the first phase."]}, {"page": "Walter Warner", "response": ["Warner was a friend of Robert Payne, chaplain to Cavendish;Aloysius Martinich, Hobbes: A Biography (1999), p. 24. and this connection is frequently used to associate Warner with the Welbeck Academy. In 1634 Warner and Hobbes discussed refraction.Stuart Clark, Vanities of the Eye: Vision in Early Modern European Culture (2007), p. 334. This acquaintance was later brought up against Hobbes in the Hobbes-Wallis controversy.Steven Shapin and Simon Schaffer (1985), Leviathan and the Air-Pump, p. 83."]}, {"page": "Awards, lectures and medals of the Royal Society", "response": ["|Wilkins-Bernal-Medawar Lecture||align=center|2005 ||Given annually on \"some aspect of the social function of science\" the Wilkins-Bernal-Medawar lecture was created as a merger of the Wilkins, Bernal and Medawar lectures previously hosted by the Royal Society. ||align=center|Simon Schaffer  2019||"]}, {"page": "Shia Islam in the Indian subcontinent", "response": ["He translated Principia of Sir Issac Newton with remarkable ambition. Simon Schaffer writes:Simon Schaffer, \"The Asiatic Enlightenments of British Astronomy\", in: \"The brokered world: Go-Betweens and Global Intelligence, 1770–1820\", pp. 60-61, Watson Publishing International LLC, (2009)."]}, {"page": "Jack Gallagher (historian)", "response": ["When a team of students of Trinity College, Cambridge, won University Challenge in 1974 (Christopher Vane, Frederick \"Wynn\" Jolley, Simon Schaffer, and Paul Hopkins), Gallagher was part of a Trinity fellows team (with Sir James Lighthill, John Bradfield, Tony Weir), which defeated them in the annual televised contest between the series champions and a team of fellows from the same institution."]}, {"page": "Hartlib Circle", "response": ["Hartlib was noted as a follower of Francis Bacon and Comenius, but his background in the German academies of the period gave him a broad view of other methods and approaches, including those of Petrus Ramus, Bartholomäus Keckermann, and Jacobus Acontius. Further, the Hartlib Circle was tolerant of hermetic ideas; Hartlib himself had an interest in sigils and astrology.Keith Thomas, Religion and the Decline of Magic (1971), p. 270 and p. 346. Boyle too attempted to straddle the opening divide between experimental chemistry and alchemy, by treating the latter in a less esoteric way; he did distance himself to an extent from the Hartlib group on moving to Oxford around 1655.Steven Shapin and Simon Schaffer, Leviathan and the Air-Pump (1985), pp. 71-2."]}]}}