{"wiki_id": "http://www.wikidata.org/entity/Q5478876", "itemLabel": "Frances O'Grady", "itemDescription": "British trade unionist; General Secretary of the TUC", "wikipedia_url": "https://en.wikipedia.org/wiki/Frances_O%27Grady", "wikipedia_page": {"main": "Frances Lorraine O'Grady (born 9 November 1959) is the General Secretary of the British Trades Union Congress (TUC), the first woman to hold the position.\n\n", "link_mentions": [{"page": "Bank of England", "response": ["| Frances O'Grady                 "]}, {"page": "Bob Crow", "response": ["Following Crow's death, tributes were offered by figures from the trade union movement. TUC Secretary-General Frances O'Grady called him \"an outstanding trade unionist, who tirelessly fought for his members, his industry and the wider trade union movement\". Manuel Cortes, leader of the TSSA rail union, stated that Crow \"was admired by his members and feared by employers, which is exactly how he liked it... It was a privilege to campaign and fight alongside him because he never gave an inch.\" Tributes were also offered by politicians on the political left. Livingstone asserted that the RMT leader was \"broadly right on most key issues\" and that \"He fought really hard for his members.\" Leader of the Labour Party Ed Miliband commented that \"I didn't always agree with him politically but I always respected his tireless commitment to fighting for the men and women in his union. He did what he was elected to do, was not afraid of controversy and was always out supporting his members across the country.\""]}, {"page": "General Secretary of the Trades Union Congress", "response": ["Since January 2013, the incumbent position was held by Frances O'Grady.", "*Frances O'Grady (1 January 2013 – )", ":2003: Frances O'Grady"]}, {"page": "Brendan Barber", "response": ["He became General Secretary of the TUC in June 2003. On 18 April 2012, he announced his retirement, enabling a successor to be elected in September at Trades Union Congress 2012. Frances O'Grady was elected his successor."]}, {"page": "Power Inquiry", "response": ["*Frances O'Grady"]}, {"page": "Ethical trade", "response": ["On 17 September 2014, over 500 textile workers rallied for an increase in minimum wages in the industrial suburb of Phnom Penh, Cambodia. The frequent protests regarding the poor working conditions and decline in real wages have become a critical issue for the Cambodian Prime Minister, as the prolonged strikes could result in reduced orders from retail firms such as Gap Inc, Nike and H & M that outsource to Cambodian factories. Recent findings gathered from workers indicate that over 33% of garment workers are medically underweight, earning around £51 per month as minimum wage, and subjected to the conditions of modern-day slavery. The general secretary of the Trade Union Congress, Frances O'Grady, stated that \"European-based corporations have a responsibility to ensure that workers' rights are respected in their supply chains.\" Hence outlining the need for ethical trade practices."]}, {"page": "Compass (think tank)", "response": ["The 2007 Robin Cook Memorial Conference \"Shaping Our Global World\", included speakers such as Ken Livingstone, Dave Prentis, Frances O'Grady, Jon Cruddas and Helena Kennedy as well as panels and seminars organised by groups such as Unison, Friends of the Earth, War on Want, Liberty, the Fabian Society and the Citizen Organising Foundation."]}, {"page": "Martin Firrell", "response": ["* UK Digital Billboards Union City art inspired by Clare Short, Frances O'Grady, and Satish Kumar, 2019."]}, {"page": "Bertrand Russell Peace Foundation", "response": ["*Mike Cooley, 'Architect or Bee? The Human Price of Technology', Foreword by Frances O'Grady (2017)"]}, {"page": "Great Lives", "response": ["|Frances O'Grady, trade uninionist", "|Frances O'Grady, trade unionist "]}, {"page": "1959 in the United Kingdom", "response": ["**Frances O'Grady, British trades union leader"]}, {"page": "Apprenticeship Ambassadors Network", "response": ["In 2011, recipient Sir Alan Jones, former Chairman, Semta, received his award during the National Apprenticeship Service Awards in June. Boris Johnson, Mayor of London, Frances O'Grady, TUC Deputy General Secretary, Allan Cook CBE, Chairman Atkins Plc, and John Armitt, Chairman, Olympic Development Authority also received Honorary Apprenticeship Awards for 2011 at a ceremony at Lancaster House on 14 December 2011."]}, {"page": "Renewal (magazine)", "response": ["In 2007, Martin McIvor took over as editor. In 2012, Ben Jackson took over as editor. In 2016, Florence Sutcliffe-Braithwaite and James Stafford took over as editors. In the early-mid 2010s, the journal carried articles from such authors as Lord Stewart Wood, Lisa Nandy MP, and Rachel Reeves and Martin McIvor, and interviews with Frances O'Grady, and Thomas Piketty."]}, {"page": "List of the first women holders of political offices in Europe", "response": ["* Deputy General Secretary of the Trades Union Congress – Frances O'Grady – 2003", "* General Secretary of the Trades Union Congress – Frances O'Grady – 2013"]}, {"page": "Milham Ford School", "response": ["* Frances O'Grady (b.1959), trade unionist; the first woman to hold the post of Secretary General of the TUC"]}, {"page": "List of Question Time episodes", "response": ["|Matthew Hancock, Andy Burnham, Tom Solomon, Frances O'Grady, Angela Hartnett"]}, {"page": "Julian Priestley", "response": ["In his memory, an annual Juilian Preistley lecture was established by former colleagues of his and is hosted by the UK European Movement. The first lecture was given in 2018 by Richard Corbett MEP, the second in 2019 by the TUC General Secretary Frances O'Grady and the third in 2021 (postponed from 2020 due to Covid) by former Irish diplomat Bobby McDonagh."]}, {"page": "Liz Truss", "response": ["Truss also outlined plans to reform childcare, intended to overhaul childcare qualifications, and provide more choice of quality education and care for parents. The proposed reforms were broadly welcomed by some organisations such as the charity 4Children, the Confederation of British Industry and the College of West Anglia. However, the proposals met opposition from others. The TUC general secretary Frances O'Grady and the then Shadow Education Secretary Stephen Twigg were among those criticising the reforms, echoed by some parents and childcare bodies, such as the charity National Day Nurseries Association."]}, {"page": "Guy Opperman", "response": ["Opperman is a member of the Advisory Board of the High Pay Centre and has co-authored an essay with Green Party MP Caroline Lucas and TUC General Secretary Frances O'Grady entitled \"Better Business: Moral Matters\". In the essay he contrasts community-focussed businesses in his Northumberland seat with the lack of responsibility demonstrated by the banking sector."]}, {"page": "2010 United Kingdom student protests", "response": ["At the end of the march, a rally took place outside Tate Britain where demonstrators were addressed by the UCU general secretary Sally Hunt, who introduced a series of clips displayed on a giant plasma screen featuring Clegg giving a series of promises to the electorate on tuition fees, all of which he had subsequently broken. Hunt stated that making the public university system in Britain \"the most expensive in the world\" was unfair, that discouraging young people from going to college was not progressive, and that the increase in tuition fees represented further debts for students. The rally was also addressed by NUS President Aaron Porter and the Trades Union Congress Deputy general secretary Frances O'Grady. O'Grady offered the message to the government that: \"Don't you dare tell us we're all in this together. The deficit certainly wasn't caused by the students.\" The protest was scheduled to end at 2 pm, but slightly overran. The Metropolitan Police were expecting 20,000 demonstrators to turn out, well below the 50,000 figure most widely quoted in the press after the event, and did not expect any violence, so deployed only 225 officers to police the event."]}, {"page": "Ruth Davidson", "response": ["Before the United Kingdom European Union membership referendum held on 23 June 2016, she campaigned against British withdrawal from the European Union.theguardian.com: Ruth Davidson enjoys her Nicola Sturgeon moment in EU debate the guardian.com / Susie Boniface: Ruth Davidson was the star at Wembley. Can’t we have more politicians like her?  (opinion)The Daily Telegraph online, 22 June 2016: Ruth Davidson's rise is about much more than the EU referendum or the Conservative leadership  On 21 June 2016, she participated in the BBC's Wembley Arena Debate, as a panellist for the \"Remain\" campaign with Frances O'Grady and Mayor of London, Sadiq Khan; and former Mayor of London and Conservative MP Boris Johnson, Labour MP Gisela Stuart and Conservative MP Andrea Leadsom, who argued on behalf of the \"Leave\" campaign as part of a cross-party debate. The referendum saw 52% of British voters decide to leave the European Union, while 62% of the Scottish electorate who cast their vote backed remaining in the EU. Years later Davidson reflected: \"Turns out we were 4% not good enough - but for such things the world turns - and I'll never quite forgive myself for not getting that 4%.\""]}, {"page": "2012 in the United Kingdom", "response": ["*10 July – The Trades Union Congress confirms the appointment of its first female General Secretary. Frances O'Grady will take up the role at the end of the year."]}, {"page": "Frances O’Grady", "response": ["#REDIRECT Frances O'Grady"]}, {"page": "2016 United Kingdom European Union membership referendum", "response": ["EU Referendum: The Great Debate was held at Wembley Arena on 21 June and hosted by David Dimbleby, Mishal Husain and Emily Maitlis in front of an audience of 6,000. The audience was split evenly between both sides. Sadiq Khan, Ruth Davidson and Frances O'Grady appeared for Remain. Leave was represented by the same trio as the ITV debate on 9 June (Johnson, Leadsom and Stuart). Europe: The Final Debate with Jeremy Paxman was held the following day on Channel 4."]}, {"page": "Trades Union Congress", "response": ["The Trades Union Congress (TUC) is a national trade union centre, a federation of trade unions in England and Wales, representing the majority of trade unions. There are 48 affiliated unions, with a total of about 5.5 million members. The current General Secretary is Frances O'Grady.", "Frances O'Grady became elected to be the leader of the TUC in 2012. The TUC endorsed a remain vote at the 2016 European Union membership referendum, and O'Grady participated in a televised debate."]}, {"page": "Tom McGuinness (artist)", "response": ["In 2018 Frances O'Grady, General Secretary of the Trades Union Congress, exhibited his painting of Murton colliery in County Durham in her office. This is the same county as the other places mentioned (above) in his career."]}, {"page": "Timeline of Oxford", "response": ["** 9 November: Frances O'Grady, trade unionist"]}, {"page": "Peston on Sunday", "response": ["|  Damian Green, Trevor Noah, Frances O'Grady and Josh Widdicombe with Lisa Nandy and Dominic Raab"]}, {"page": "Aftermath of the 2016 United Kingdom European Union membership referendum", "response": ["The TUC has said that they fear any Brexit deal might harm workers' interests and lead to workers in many industries losing their jobs. Frances O'Grady of the TUC said that unless the government provides a deal that is good for working people, the TUC will strongly \"throw our full weight behind a campaign for a popular vote so that people get a say on whether that deal is good enough or not.\""]}, {"page": "WebRoots Democracy", "response": ["Published in March 2015, Viral Voting: Future-proofing UK elections with an #onlinevoting option examined the benefits of online voting, the challenges faced for its implementation, and its estimated impact on voter turnout and elections. The report estimated that online voting could boost voter turnout by up to 9 million, reduce the cost-per-vote by a third, and enable voters with vision impairments to cast a secret ballot. It contains forewords by the MPs Graham Allen and Chloe Smith, as well as the General Secretary of the Trades Union Congress, Frances O'Grady."]}, {"page": "2018 British Isles heat wave", "response": ["There were fears of over 1,000 excess deaths during the heat wave. The Environmental Audit Committee of MP's reported fears 7,000 heat-related UK deaths annually by 2050 unless the government acts promptly. Chair of the committee, Mary Creagh said, \"The government must stop playing pass the parcel with local councils and the NHS and develop a strategy to protect our ageing population from this increasing risk\". At risk, groups include elderly people, small children and people with heart and/or lung conditions. There were calls for government regulations to protect an ageing population from the effects of heat, effects include increased risk of death. During the 2003 European heat wave in some areas of the UK there were 42% increased deaths in nursing homes and the MP's wanted hospitals and care homes to be inspected to find out if they could cope with extreme heat. The TUC and others called for regulations about maximum workplace temperatures. Frances O'Grady of the TUC stated, \"With heatwaves becoming more common, we need clear and sensible rules to protect working people. We've had legal minimum temperatures at work for a long time, which work very well. The government must now act quickly on the recommendation by MPs for maximum limits on how hot workplaces can get\". Also, dress codes for work and school uniform policy should be relaxed during heatwaves to improve work productivity and school learning. Ministers withdrew money for climate change adaptation officers in local authorities. Lack of \"joined-up thinking\" between government departments and lack of communication between the government and the public added to the death toll. Heatwave alerts are put out only if temperatures are over 30 °C, but heat-related deaths start at 25 degrees.Regular heatwaves 'will kill thousands BBCHeat-related deaths will treble by 2050 unless government takes urgent action, warn MPs 'The IndependentUK heatwave creating summer crisis for NHS, says Labour The GuardianUnions say action needed to protect UK workers in heatwave The Guardian There were excess deaths during the 2018 heat wave but the cause is not yet known.Deaths spiked during UK heatwave BBC"]}, {"page": "Frances Ogrady", "response": ["#redirect Frances O'Grady"]}, {"page": "2021 Go North West strike", "response": ["On 17 April, picketing drivers were joined by over 100 members of other community groups, such as the National Education Union, in a show of support for the strike. The following day, The Guardian published an article that discussed Go-Ahead as one of many companies accused of using \"fire and rehire\" practices during the course of the COVID-19 pandemic, along with British Gas, University Hospitals Birmingham NHS Foundation Trust, and Compass Group-subsidiary ESS, among others. The article also contained a statement from Frances O'Grady, the General Secretary of the Trades Union Congress, who said that almost one of every ten British workers had been affected by \"fire and rehire\" practices during the pandemic. On 20 April, BBC News published an article discussing how Go North West had logged 38 separate incidents of strikers intimidating, assaulting, and attacking non-striking employees since the start of the strike. Unite denied these incidents, stating they had no record of strikers being involved in any such incidents and that the union would take action against any striker who was found to have been involved."]}]}}