{"wiki_id": "http://www.wikidata.org/entity/Q5486856", "itemLabel": "Frank Gillard", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Gillard", "wikipedia_page": {"main": "Francis George Gillard CBE (1 December 1908 – 20 October 1998) was a BBC executive,  reporter and radio innovator.", "link_mentions": [{"page": "Round the Horne", "response": ["The sketch angered the strongly-conservative Member of Parliament Sir Cyril Black, who wrote to the BBC to complain. Frank Gillard, the BBC's director of radio, wrote to Dennis Morris, the chief of the Light Programme, asking Round the Horne to \"watch its step, particularly over the next few weeks and keep itself within reasonable bounds\". Instead, Took and Feldman wrote a riposte that Horne read at the end of the following programme, addressed to the \"minority of killjoys\" who complained:"]}, {"page": "Masterpiece (TV series)", "response": ["The success of the broadcast of the 1967 version of The Forsyte Saga on NET (the precursor of PBS) led Stanford Calderwood, then serving as president of WGBH, to investigate whether the BBC would sell programs to the station. Suggestions for the series format came from, among others, Frank Gillard in the UK and Christopher Sarson in the US. In looking for an underwriter for the series, Calderwood eventually met with Herb Schmertz of Mobil Corporation. Schmertz was able to gain funding for the show, and with Joan Wilson of WGBH-TV bought the US distribution rights for fifty hours of British dramas for about $1 million per year. He and several other men, including Frank Marshall, met in London and made a selection of programs to be broadcast."]}, {"page": "BBC Radio", "response": ["One of the stations called Radio London (\"Big L\") was so successful that the BBC was told to copy it as best they could. This led to a complete overhaul by Frank Gillard the BBC's Director of Radio of the BBC output creating the four analogue channels that still form the basis of its broadcasting today. The creator of BBC Radio One told the press that his family had been fans of Radio London.", "|1963|| Frank Gillard"]}, {"page": "Children's Hour", "response": ["The programme's closure was decided in 1964 by Frank Gillard following an enormous decline in listenership—by the end of 1963, the number of listeners had fallen to 25,000. Gillard said that most of them were \"middle-aged and elderly ladies who liked to be reminded of the golden days of their youth\", and that young listeners had instead turned to watching television, listening to the BBC Light Programme or to pirate radio. There was considerable complaint about the closing of the service and questions were raised in Parliament."]}, {"page": "BBC Radio London", "response": ["Local radio arrived in London as part of the second wave of BBC local stations, following a successful pilot project headed by Frank Gillard, who on visiting the United States discovered local radio stations of varying formats and was to bring this concept to Britain."]}, {"page": "Wellington School, Somerset", "response": ["*Frank Gillard CBE, BBC broadcaster and administrator"]}, {"page": "BBC Studios Natural History Unit", "response": ["By the early 1950s, Hawkins had been promoted to Head of Programmes, West Region and was keen to translate his success to the developing medium of television. At the time, radio still commanded much higher audiences than the fledgling television service, but Hawkins was not alone in recognising the potential for natural history programmes for the newer medium. His vision was shared by Frank Gillard, the regional Head, and the two men would become the driving force behind the establishment of the Natural History Unit (NHU) in Bristol."]}, {"page": "1999 British Academy Television Awards", "response": ["*Frank Gillard"]}, {"page": "1998 in the United Kingdom", "response": ["* 20 October – Frank Gillard, radio broadcaster (born 1909)"]}, {"page": "List of former BBC newsreaders and journalists", "response": ["* Frank Gillard – worked as a BBC war correspondent from 1941 until 1945. He later became the director of the BBC's western region, and then the Director of Radio, a role he held from 1964 until 1969. He died in 1998."]}, {"page": "1909 in the United Kingdom", "response": ["* 1 December – Frank Gillard, radio broadcaster (died 1998)"]}, {"page": "1945 in radio", "response": ["*8 May – Victory in Europe Day in Western Europe. At 12:30 President of Germany Karl Dönitz broadcasts on his country's surrender to the nation. At 15:00 BST in the United Kingdom, the Prime Minister, Winston Churchill, makes a speech to the nation on the BBC from 10 Downing Street, and at 21:00 King George VI speaks to the British Empire from Buckingham Palace. Wynford Vaughan-Thomas reports from Lüneburg and Frank Gillard from Kassel. On 9 May (Moscow Time) the surrender is announced on Radio Moscow by Yuri Levitan."]}, {"page": "Gillard (disambiguation)", "response": ["* Frank Gillard (1909–1998), British radio broadcaster and administrator"]}, {"page": "Eric Lloyd Williams", "response": ["Frank Gillard, BBC: \"Works very hard and has no pretensions. He insists on driving his own recording truck about the front, and he stays up all night for the sake of getting an authentic recording of an artillery barrage.\""]}, {"page": "Desmond Hawkins", "response": ["In 1955 Desmond became Head of Programmes in Bristol, and Frank Gillard was promoted to be the West Region Controller.  The two of them had enough clout in the BBC to establish in a formal sense in 1957 a specialist unit in the West Region to provide wildlife programmes for the national network – the Natural History Unit."]}, {"page": "List of University of Exeter people", "response": ["* Frank Gillard - broadcaster and BBC executive"]}, {"page": "List of World War II war correspondents (1942–43)", "response": ["*Frank Gillard, BBC"]}, {"page": "John Tidmarsh", "response": ["Back in Bristol with the Western Daily Press in the autumn of 1948, Tidmarsh began to specialise in sport, reporting each week on Bristol Rovers. After doing a \"live\" commentary one Saturday for the newly created Hospital Radio Service, the BBC Controller in West Region, the former war correspondent Frank Gillard, offered him a job, initially as a resident freelance, reporting and presenting the regional magazine The Week in the West. He later joined the staff as the regional organiser of coverage for national television news."]}, {"page": "Frank Gillard Awards", "response": ["The Frank Gillard Awards are awards for BBC Local Radio stations in the UK. They are named after Frank Gillard who initiated the BBC's local radio network. The award is a head of Frank Gillard and is  given as Gold, Silver and Bronze degrees.", "The annual Frank Gillard Awards were launched in 2000 in memory of the war correspondent and founder of BBC Local Radio."]}, {"page": "1998 in British radio", "response": ["* 20 October – Frank Gillard, broadcaster and executive (born 1909)"]}, {"page": "Dominic Bruce", "response": ["The BBC series Colditz (1972–74), was such a success that it was quickly repeated. In order to make up the episodes to a sixty-minute slot (the BBC had hoped to sell the series to the US, hence the use of Robert Wagner, so they had to be only fifty minutes in length to include commercials) a select group of six Colditz escapers were interviewed individually by the famous war correspondent Frank Gillard and shown immediately after the repeat programmes were broadcast. Bruce was one of the interviewees. The documentary series was called Six from Colditz, and Bruce's interview was listed on 17 April 1973, and also on 17 January 1974 in the Radio Times. Transcripts of Bruce's interview, with Gillard, which aired in 1973, exist."]}, {"page": "Gerard Mansell", "response": ["He joined the BBC in 1951, starting in the foreign news department. He advanced by 1961 to head of the Overseas Service's features and talks section. In 1965, Frank Gillard made Mansell controller of the Home Service. In 1965, he created The World at One, installing Andrew Boyle as editor and William Hardcastle as anchorman. Mansell sought also to distance the station from the nostalgic war-time nickname \"the good old Home\" and make it more modern and informal. In 1963, to bring a \"lighter and brighter sound\" to the station, he replaced the Bow Bells theme with Handel's Water Music. The desire for informality also affected news and current affairs programming, with more relaxed and informal conversation as part of the news output."]}, {"page": "Deaths in October 1998", "response": ["*Frank Gillard, 89, British BBC reporter and radio innovator."]}, {"page": "1909 in radio", "response": ["* December 1 – Frank Gillard, English radio reporter and executive (died 1998)"]}, {"page": "1945 in British radio", "response": ["* 8 May – Victory in Europe Day in Western Europe. At 15:00 BST in the UK, the Prime Minister, Winston Churchill, makes a speech to the nation on the BBC from 10 Downing Street, and at 21:00 King George VI speaks to the British Empire from Buckingham Palace. Wynford Vaughan-Thomas reports from Lüneburg and Frank Gillard from Kassel."]}, {"page": "List of honorary graduates of the University of Exeter", "response": ["* Frank Gillard CBE (LLD)"]}]}}