{"wiki_id": "http://www.wikidata.org/entity/Q5488648", "itemLabel": "Frank Newby", "itemDescription": "structural engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Newby", "wikipedia_page": {"main": "Frank Newby (26 March 1926 – 10 May 2001) was one of the leading structural engineers of the 20th century, working with such architects as Philip Powell and Hidalgo Moya, Eero Saarinen, Cedric Price,James Gowan (architect) James Stirling, and the practice of Skidmore, Owings and Merrill (SOM), and such engineers as Ove Arup and Felix Samuely.", "link_mentions": [{"page": "London Zoo", "response": ["The Snowdon Aviary was designed by Cedric Price, Frank Newby and Antony Armstrong-Jones, 1st Earl of Snowdon, and was built in 1964. It was Britain's first public, walk-through aviary.", "The Snowdon Aviary, built-in 1964 by Cedric Price, Lord Snowdon and Frank Newby, made pioneering use of aluminium and tension for support. A year later the Casson Pavilion, designed by Sir Hugh Casson and Neville Conder,  was opened as an elephant and rhinoceros house. The Pavilion was commissioned \"to display these massive animals in the most dramatic way\" and designed to evoke a herd of elephants gathered around a watering hole."]}, {"page": "Antony Armstrong-Jones, 1st Earl of Snowdon", "response": ["Snowdon co-designed (in 1963, with Frank Newby and Cedric Price) the \"Snowdon Aviary\" of the London Zoo (which opened in 1964); he later said it was one of his creations of which he was most proud, and affectionately called it the \"birdcage\". He also had a major role in designing the physical arrangements for the 1969 investiture of his nephew Prince Charles as Prince of Wales.Royal, by Robert Lacey, 2002."]}, {"page": "University of Leicester", "response": ["Image:Leicester University Engineering Building.jpg|The Engineering Building, designed by James Stirling, James Gowan and Frank Newby"]}, {"page": "1964 in architecture", "response": ["**The Snowdon Aviary, London Zoo, designed by Lord Snowdon, Cedric Price and Frank Newby, is completed."]}, {"page": "List of University of Cambridge people", "response": ["*Frank Newby (Trinity)"]}, {"page": "Cedric Price", "response": ["After graduating, Price worked briefly for Erno Goldfinger, Denys Lasdun, the partnership of Maxwell Fry and Jane Drew, and applied unsuccessfully for a post at London County Council, working briefly as a professional illustrator before starting his own practice in 1960. He worked with The Earl of Snowdon and Frank Newby on the design of the Snowdon Aviary at London Zoo (1961). He later also worked with Buckminster Fuller on the Claverton Dome."]}, {"page": "Aviary", "response": ["The Snowdon Aviary in London Zoo was designed by Antony Armstrong-Jones, 1st Earl of Snowdon, Cedric Price and Frank Newby, and built in 1962–1964.ZSL Architecture, ZSL, retrieved on June 3, 2008."]}, {"page": "Newby", "response": ["*Frank Newby (1926–2001), eminent structural engineer"]}, {"page": "This Is Tomorrow", "response": ["* Group Ten: Robert Adams, Frank Newby, Peter Carter, Colin St. John Wilson"]}, {"page": "Derek Walker (architect)", "response": ["In 1980 Walker was involved with Norman Foster and Frank Newby in a controversial scheme to expand the Whitney Museum in New York City using air rights purchased from nearby properties to build a mixed-use skyscraper which would include a new wing for the museum. When a furore developed, the museum denied it had solicited the team.The Whitney Museum repulses Norman Foster's first assault on New York, 1980. "]}, {"page": "List of structural engineers", "response": ["* Frank Newby"]}, {"page": "Ecclesfield School", "response": ["* Frank Newby, structural engineer, designed the Skylon for the Festival of Britain and the aviary for London Zoo"]}, {"page": "Anthony Hunt", "response": ["Hunt was impressed by the Festival of Britain's Skylon, engineered by Frank Newby and Felix Samuely of FJ Samuely & Partners, two of the most influential engineers at the time. This inspired him to seek employment with the firm, which he achieved. It was with FJ Samuely & Partners that Hunt really developed his passion for structural engineering, working on projects such as Eero Saarinen's American Embassy in London."]}, {"page": "Gold Medal of the Institution of Structural Engineers", "response": ["| 1985 ||  Frank Newby || F J Samuely & Partners"]}]}}