{"wiki_id": "http://www.wikidata.org/entity/Q5485215", "itemLabel": "Frank Barton", "itemDescription": "English footballer (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Barton_(English_footballer)", "wikipedia_page": {"main": "Frank Barton (born 22 October 1947) is an English retired footballer who played as a midfielder during the 1960s and 1970s.Barton also gained international honours with England Youth team playing for his country in 5 international games in which he scored the first goal of a 3-0 victory over Spain at Swindon in 1966. He also obtained his English Football Association Full Coaching Certification in 1968 at the Lilleshall Training Centre.He went on to play for Seattle Sounders of the North American Soccer League from 1979 until 1982. He also played indoor soccer for Seattle, the Wichita Wings and the Tacoma Stars.In 1994, Barton became an assistant coach with the Seattle Sounders in the American Professional Soccer League.Barton currently serves as a head coach with Emerald City Football Club in Seattle.", "link_mentions": [{"page": "Barton-upon-Humber", "response": ["|Frank Barton"]}, {"page": "Grimsby Town F.C.", "response": ["|1975 ||  Frank Barton ||–"]}, {"page": "List of Grimsby Town F.C. players", "response": ["|align=\"left\"|Frank Barton||||MF||1973–1975||123||15"]}, {"page": "List of footballers in England by number of league appearances", "response": ["!scope=row data-sort-value=\"Barton, Frank\"|Frank Barton"]}, {"page": "Lincolnshire derby", "response": ["! scope=\"row\" style=\"text-align:left;\"| Frank Barton"]}, {"page": "Kieran Barton", "response": ["Barton, son of English footballer Frank Barton, went to the United States in 1979 when his father signed with the Seattle Sounders of the North American Soccer League. Frank Barton remained in the United States after his retirement from professional football and Kieran Barton graduated from Mount Si High School in Snoqualmie, Washington. He attended Whitworth College in Spokane, Washington, playing on the men's soccer team from 1989 to 1993. He graduated in 1993 with bachelor's degree in biology."]}]}}