{"wiki_id": "http://www.wikidata.org/entity/Q5488911", "itemLabel": "Frank Paton", "itemDescription": "British artist (1855-1909)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Paton", "wikipedia_page": {"main": "Frank Paton (23 November 1855 – 13 November 1909) was an English artist of the Victorian and Edwardian eras, best known for his paintings of animals and scenes of rural life.  He was a successful artist during his lifetime and could even count Queen Victoria as an admirer of his work.  His most famous compositions, \"Fairest of Them All\" and \"Puss in Boots\" (1880), have adorned many a wall in the form of plates and posters.  In addition, his series of printed Christmas cards published between 1880 and 1909 have become an affordable way for those interested in Paton's art to begin a collection.", "link_mentions": [{"page": "Stepney", "response": ["Others born in Stepney are entertainer Des O'Connor, actor Steven Berkoff, Steven Berkoff: The real East Enders, The Independent 4 January 2007 accessed 10 May 2007 playwright Arnold Wesker, gardener Rachel De Thame, television executive Alan Yentob, artist Frank Paton, drummer Kenney Jones, musician and writer Jah Wobble,Jah Wobble, Memoirs of a Geezer, p. 1. singer Kenny Lynch and his sister Maxine Daniels, singer Charles Coborn, footballers Ledley King, Ashley Cole, Mark Lazarus and Darren Purse, Heavyweight boxer \"Bombardier\" Billy Wells, former armed robber and businessman Roy Shaw, former British featherweight boxing champion Sammy McCarthy, sportswriter Norman Giller, and Labour politician Wes Streeting."]}, {"page": "Walton-on-the-Naze", "response": ["* Frank Paton, artist, moved to Walton-on-the-Naze shortly before his death in 1909."]}, {"page": "Paton (surname)", "response": ["*Frank Paton (1855–1909), English artist of the Victorian and Edwardian eras"]}, {"page": "List of Vanity Fair artists", "response": ["| Frank Paton||Paton, Frank"]}, {"page": "November 1909", "response": ["*Died: Frank Paton, 54, English illustrator"]}]}}