{"wiki_id": "http://www.wikidata.org/entity/Q5483291", "itemLabel": "Leon Herbert", "itemDescription": "actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Leon_Herbert", "wikipedia_page": {"main": "Leon Herbert is an English actor, director, writer and producer. Herbert is known for appearances in films including Salome's Last Dance (1988), Scandal (1989), Batman (1989), Alien 3 (1992), Double X: The Name of the Game (1992), Point of No Return (1993), The Girl with the Hungry Eyes (1995), Fierce Creatures (1997), Lucinda's Spell (1998), South West 9 (2001), 9 Dead Gay Guys (2002) and Dark Floors (2008).\nHerbert made his directorial debut with the 2003 film Emotional Backgammon. He also appeared on the television series Come Dine with Me, as well as an episode of the BBC soap opera Doctors as Lenny Rutter.", "link_mentions": [{"page": "2000 in film", "response": ["| The 10th Kingdom || NBC / Hallmark Entertainment || David Carson, Herbert Wise (directors); Simon Moore (screenplay); Kimberly Williams, John Larroquette, Scott Cohen, Dianne Wiest, Rutger Hauer, Ed O'Neill, Camryn Manheim, Ann-Margret, Daniel Lapaine, Hugh O'Gorman, Dawnn Lewis, Jeremiah Birkett, Warwick Davis, Robert Hardy, Edward Jewesbury, John Hallam, Edward Highmore, Frank Middlemass, Peter Vaughan, Lucy Punch, Natasha Collins, John Shrapnel, Jimmy Nail, Aden Gillett, Gudrun Ure, Amelda Brown, Liz May Brice, Moira Lister, Timothy Bateson, Jeffry Wickham, Sheila Steafel, Adam James, Nigel Whitmey, Leon Herbert, James Cosmo, Adam Levy, Bob Barrett, Douglas Blackwell, Marcus Clarke || Fantasy || Live action"]}, {"page": "1989 in film", "response": ["| Scandal || Miramax Films || Michael Caton-Jones (director); Michael Thomas (screenplay); John Hurt, Joanne Whalley, Ian McKellen, Bridget Fonda, Leslie Phillips, Britt Ekland, Daniel Massey, Roland Gift, Jeroen Krabbé, Jean Alexander, Deborah Grant, Alex Norton, Ronald Fraser, Paul Brooke, Keith Allen, Ralph Brown, Iain Cuthbertson, Johnny Shannon, Leon Herbert || Drama || Live action"]}, {"page": "1992 in film", "response": ["| Alien 3 || 20th Century Fox || David Fincher (director); David Giler, Walter Hill, Larry Ferguson (screenplay); Sigourney Weaver, Charles S. Dutton, Charles Dance, Lance Henriksen, Pete Postlethwaite, Holt McCallany, Paul McGann, Danny Webb, Brian Glover, Ralph Brown, Vincenzo Nicoli, Christopher John Fields, Peter Guinness, Christopher Fairbank, Phil Davis, Leon Herbert, Niall Buggy, Clive Mantle, DeObia Oparei || Sci-fi, Horror || Live action"]}, {"page": "1981 in film", "response": ["| Scanners || AVCO Embassy Pictures || David Cronenberg (director/screenplay); Stephen Lack, Jennifer O'Neill, Patrick McGoohan, Lawrence Dane, Michael Ironside, Robert Silverman, Mavor Moore, Anthony Sherwood, Fred Doederlein, Victor Désy, Louis Del Grande, Alex Stevens, William Hope, Christopher Britton, Leon Herbert, Neil Affleck || Sci-Fi, Horror || Live action"]}, {"page": "Alien 3", "response": ["* Leon Herbert as Edward Boggs"]}, {"page": "Scanners", "response": ["William Hope, Christopher Britton, and Leon Herbert have uncredited appearances as Bicarbon Amalgamate employees. Neil Affleck has a minor role as a medical student."]}, {"page": "Scandal (1989 film)", "response": ["* Leon Herbert as Lucky Gordon"]}, {"page": "Superman: Doomsday & Beyond", "response": ["*Leon Herbert as John Henry Irons"]}, {"page": "Ryūzaburō Ōtomo", "response": ["*Alien 3 (1998 TV Asahi version) – Edward Boggs (Leon Herbert)"]}, {"page": "Salome's Last Dance", "response": ["* Leon Herbert as Namaan"]}, {"page": "Tropic of Ice", "response": ["*Leon Herbert... robber in London"]}, {"page": "Herbert (surname)", "response": ["*Leon Herbert, British actor"]}, {"page": "Dark Floors", "response": ["Dark Floors – The Lordi Motion Picture is an 2008 English-language Finnish horror film that features Lordi band members playing the monsters. Mr Lordi has also designed the film's logo. The film was released in February 2008 and stars William Hope, Leon Herbert, Philip Bretherton, Ronald Pickup, and Skye Bennett. A new Lordi song, Beast Loose in Paradise, is featured in the end credits of the film."]}, {"page": "Double X: The Name of the Game", "response": ["*Leon Herbert as Ollie"]}, {"page": "Gone with the Wind (musical)", "response": ["*Uncle Peter - Leon Herbert"]}, {"page": "9 Dead Gay Guys", "response": ["*Leon Herbert as Nev"]}, {"page": "Superman On Trial", "response": ["* Leon Herbert as The Guardian of the Universe"]}, {"page": "The Paradise Club", "response": ["* Leon Herbert as Polish Joe (Series 1–2)"]}, {"page": "List of horror films of 2008", "response": ["| Pete Riski || Skye Bennett, Philip Bretherton, William Hope, Ronald Pickup, Leon Herbert || Finland || "]}, {"page": "The Adventures of Superman (BBC Radio series)", "response": ["|Leon Herbert || The Guardian of The Universe"]}, {"page": "Lucky Gordon", "response": ["*In the 1989 film Scandal about the Profumo affair, Gordon was portrayed by Leon Herbert."]}, {"page": "The Girl with the Hungry Eyes (1995 film)", "response": ["The Girl with the Hungry Eyes is a 1995 American horror film starring Christina Fulton, Leon Herbert, Jon Jacobs and Isaac Turner. Loosely based on Fritz Leiber's 1949 story of the same name, about a pinup girl as a psychic vampire, it was written and directed by Jacobs."]}, {"page": "Emotional Backgammon", "response": ["Emotional Backgammon is a 2003 British independent comedy-drama about couples strategizing to repair relationships, with unexpected results.Russell, Jamie (22 August 2003).  Emotional Backgammon review. BBC. The film was written by Leon Herbert and Matthew Hope, directed by Herbert, and stars Herbert, Wil Johnson, Daniela Lavender, and Jacqueline de Peza.  It is Herbert's first feature-length film. During its development it was featured on UK Channel 4's Movie Virgins series; upon its release, it received mixed reviews.", "* Leon Herbert as Steve"]}, {"page": "List of LGBT-related films of 2002", "response": ["| 9 Dead Gay Guys || Lab Ky Mo || United Kingdom || Crime, comedy || Glen Mulhern, Brendan Mackey, Steven Berkoff, Michael Praed, Vas Blackwood, Fish, Leon Herbert, Simon Godley, Carol Decker, Raymond Griffiths, Abdala Keserwani and Karen Sharman ||"]}, {"page": "Fedz", "response": ["Mike goes on the run to solve the virus case and obtain the virus antibodies. Whilst Mike is being pursued by his old colleagues, he obtains diaries about drugs the virus has been planted in from sports-coach, Coach McKenzie (Martina Laird). After she is murdered, Mike gives the diaries to a journalist, Trevor McBride (Wil Johnson), who is then kidnapped for ransom money in exchange for the antibodies, tortured and murdered by Razor (Andrew Harrison). After Mike tells Pete that he is a policeman, Pete orders Kent (Leon Herbert) to kill Mike.", "* Leon Herbert as Kent"]}, {"page": "List of Outlander characters", "response": ["|Leon Herbert", "| Leon Herbert"]}, {"page": "South West 9", "response": ["* Leon Herbert as Isi"]}, {"page": "List of Doctors characters (2020)", "response": ["| Leon Herbert", "| A homeless woman who learns from Bear Sylvester (Dex Lee) that her friend, Lenny Rutter (Leon Herbert), has died and has left her a piece of art.", "| The ex-wife of Lenny (Leon Herbert) who sells his artwork following his death."]}]}}