{"wiki_id": "http://www.wikidata.org/entity/Q5489549", "itemLabel": "Frank Shipston", "itemDescription": "English cricketer (1906-2005)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Shipston", "wikipedia_page": {"main": "Frank William Shipston (29 July 1906 – 6 July 2005) was an English cricketer. Born in Bulwell, Nottinghamshire, Shipston's father (also Frank Shipston) had played several matches for the Nottinghamshire County Cricket Club in the Second XI Championship. Shipston made his first-class debut for Nottinghamshire against Glamorgan in the final round of the 1925 English cricket season, having previously only played at second XI level. Prior to debuting, he had worked as a miner in Yorkshire and at Langworth in Lincolnshire, as well as on Nottinghamshire's groundstaff. He was a regular player at county level until the end of the 1933 season, when he joined the Nottinghamshire Police at the urging of Captain Popkess, who wanted ex-professional cricketers to boost the police cricket team.Overall, Shipston played 49 first-class matches, all for Nottinghamshire, scoring 1,183 runs at an average of 18.48. His highest first-class score, 118 not out, was achieved against Hampshire during the 1932 season, a match which Nottinghamshire won by an innings and 53 runs. Shipston was a close friend of Harold Larwood during his cricket career, with the two rooming together when Nottinghamshire played away from home. From the 1950s, Shipston occasionally umpired at county and second XI level, umpiring 24 first-class matches during the 1956 County Championship, and continuing to umpire into the 1970s. He also was employed by Nottinghamshire as a coach from 1957 to 1966. On the death of Harry Forsyth in July 2004, Shipston became the oldest living first-class cricketer, a position he held until his death in Wollaton in July 2005, when he was succeeded by Syd Ward.\n\n", "link_mentions": [{"page": "Deaths in July 2005", "response": ["*Frank Shipston, 98, English cricketer."]}, {"page": "Douai School", "response": ["External fixtures, which were unknown at old Douai, were soon organized after the move to England. Cricket and hockey were played at the new school from 1905, and from 1918 to 1919 rugby union replaced soccer as the main winter sport (soccer returned as a minor sport in 1962). In 1920, the Trinidadian Louis Wharton became Douai's first Oxford University cricketer, having won a Blue for soccer the previous year. He went on to play cricket for Somerset. After the war the Surrey all-rounder Alan Peach was cricket coach, succeeded by Frank Shipston of Nottinghamshire. An indoor swimming pool was built in 1937."]}, {"page": "Michael Spurway", "response": ["Following the death of Frank Shipston on 6 July 2005, Spurway was thought to be the oldest surviving county cricketer, and, at the time of his death, the last person alive to have played county cricket in the 1920s."]}, {"page": "Syd Ward (cricketer)", "response": ["From the death of Frank Shipston on 6 July 2005 until his death, Ward was considered the oldest living first-class cricketer and the second oldest ever, behind Jim Hutchinson.Jim Hutchinson Following his death, Cyril Perkins became the oldest living first-class cricketer."]}, {"page": "Shipston (surname)", "response": ["*Frank Shipston (1906–2005), English cricketer"]}]}}