{"wiki_id": "http://www.wikidata.org/entity/Q5488300", "itemLabel": "Frank McGinnes", "itemDescription": "Footballer (1870-1892)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_McGinnes", "wikipedia_page": {"main": "Francis McGinnes (14 May 1870 – 25 June 1892), also referred to as Frank McGinnis, was a Scottish footballer. He was described as 'the best centre-forward that ever left Scotland'. A prolific goalscorer, he was Burslem Port Vale's best player, but died suddenly just before they started their first season in the Football League in 1892–93.", "link_mentions": [{"page": "List of Port Vale F.C. players", "response": ["More than 500 Port Vale players have appeared in at least 25 senior competitive matches. In the early days, the scarcity of nationally organised competitive football meant players could spend many years with the club while making few such outings. However to redress this the list includes appearances in minor cup competitions, such as the Staffordshire Senior Cup, prior to World War II. Exhibition matches were the primary source of games in the early days of the game and so appearances in friendly games during 19th century are also included. This means that Frank McGinnes is on the list, who recorded 109 goals in 140 matches despite being limited to just 33 goals in 39 Midland League games due to his death due to kidney failure on 25 June 1892, at the age of 22."]}, {"page": "List of Port Vale F.C. seasons", "response": ["|Frank McGinnes", "|Frank McGinnes", "|Frank McGinnes"]}, {"page": "History of Port Vale F.C.", "response": ["In 1890 the club became founder members of the Midland League, where they played two seasons of football. A third-place finish in 1891–92 was enough to win them election to the new Football League Second Division in 1892. The club suffered greatly from the death of star striker Frank McGinnes. On 10 December 1892, they played in a snowstorm, and lost 10–0 at home to Sheffield United. This remains a Football League record. Vale finished eleventh out of twelve, but won re-election to the league. The team fared poorly in the league for the following three seasons and failed to win re-election at the end of 1895–96. This resulted in another two seasons in the Midland League. They fared poorly, but as the Football League expanded for the 1898–99 season, Port Vale were re-elected – this came mostly thanks to their FA Cup victory over eventual First Division champions Sheffield United. The club's financial troubles were not solved by their league status, they suffered indifference in the league the cup competitions for several seasons. Adrian Capes was top scorer for four consecutive seasons and was a rare bright light. The club survived by selling their top players (including Copes), going on cup runs and cutting costs wherever possible. The club resigned from the league on 14 June 1907. An appeal for supporters to prop the club up with donations failed, the directors did not believe the club to viable \"in any shape or form\". Stoke and Oldham Athletic took on most of the now unemployed players."]}, {"page": "Francis McGinnis", "response": ["#REDIRECT Frank McGinnes"]}, {"page": "1892–93 Burslem Port Vale F.C. season", "response": ["The pre-season started terribly, star striker Frank McGinnes dying of kidney disease before a ball was kicked. His replacement was Wallace Bliss, and local headmaster Fred Farrington was appointed captain. The first match continued in desperately poor fashion; Billy Beats missed the train, and so Vale played with ten men against Small Heath, losing 5–1, with Bliss scoring the club's first Football League goal – his only goal in the league ever. Away matches were difficult for the \"Valeites\" as players had trouble gaining permission from their employers to miss work. Vale suffered a 10–0 defeat in a snowstorm at home to Sheffield United on 10 December, a Football League record for a home defeat."]}, {"page": "Frank McGinnis", "response": ["#REDIRECT Frank McGinnes"]}, {"page": "Francis McGinnes", "response": ["#REDIRECT Frank McGinnes"]}, {"page": "1888–89 Burslem Port Vale F.C. season", "response": ["Desperate to turn around their poor form, the club signed \"the best centre-forward that ever left Scotland\" in 19-year old Frank McGinnes, who had built up a formidable reputation at Halliwell. They travelled to Anfield on 20 April and recorded a 1–0 victory over Everton, but the season petered out with defeat to Leek in the semi-finals of the North Staffordshire Challenge Cup and a 7–1 thumping after fielding a weakened side at Bootle. The Combination league collapsed, but the team's poor form meant they were not invited to compete in either the new Football Alliance. The club management resolved to strengthen the team and had to be content with friendlies for the following campaign.", "|align=\"left\"|FW||align=\"left\"| Frank McGinnes"]}, {"page": "1890–91 Burslem Port Vale F.C. season", "response": ["Vale recorded home and away victories over Warwick County – winning 8–0 at home, Frank McGinnes scoring his second hat-trick of the season – but gained no points as County withdrew from the league and their games were struck from the record. Home defeats to Gainsborough and Burton Wanderers followed, but they ended the league campaign in good form, beating Sheffield United and Staveley whilst taking a point from their visit to Lincoln. They finished the table in eighth-place, though finished just five points off second-place Long Eaton Rangers. McGinnes finished as the club's top-scorer with 15 league goals. The club's directors decided to embark on a locally based strategy, signing promising local players to five-year contracts.", "|align=\"left\"|FW||align=\"left\"| Frank McGinnes", "|1||FW||||Frank McGinnes||15||0||26||41"]}, {"page": "1891–92 Burslem Port Vale F.C. season", "response": ["The 1891–92 season was Burslem Port Vale's second successive season in the Midland League. They managed to finish third in the table and were rewarded with a place in the Football League for the following season, justifying the club's decision to refuse to listen to offers for star forward Frank McGinnes. They also reached the semi-finals of the Staffordshire Senior Cup and won the North Staffordshire Challenge Cup, though exited the FA Cup and Birmingham Senior Cup at the first round.", "In preparation for the new Midland League campaign, Burslem Port Vale signed winger Jimmy Scarratt from Wellington St. George's and prepared a new kit of red jerseys with grey kickers – the uniforms were made by Mrs Danks, the secretary's wife. They failed to bring good fortune in the opening league game however, a 3–2 defeat at home to Burton Wanderers. After the game the club also signed a new outside-right, G McHarg. Though he had little impact on the first-team, they managed to record a 7–1 victory over Loughborough Town, with Frank McGinnes claiming a hat-trick. They followed this with a 4–0 win over Doncaster Rovers, despite McGinnis missing the first ever penalty shot awarded  at the Athletic Ground and McHarg being criticised for over-dribbling. The team settled into their usual pattern of winning at home but losing away, losing on the road five times whilst winning all but one of their remaining home fixtures. The first run to end was their away form, as they won 2–1 at Loughborough Town and then won their final two away matches. The turn around in away form, coupled with continuing home victories, took the club from ninth (of eleven teams) in January to third by the end of the season. Alarmingly though only 150 spectators turned out to witness the final day victory over Leicester Fosse on 28 April, causing the club to make a loss on the game after marketing costs were deducted. Potteries derby rivals Stoke meanwhile were keen to take McGinnis to the Football League First Division, but Vale resisted all attempts to sign him, rejecting a bid of £30.", "|align=\"left\"|FW||align=\"left\"| Frank McGinnes", "|1||FW||||Frank McGinnes||18||0||17||35"]}]}}