{"wiki_id": "http://www.wikidata.org/entity/Q5487518", "itemLabel": "Frank James", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_James_(MP)", "wikipedia_page": {"main": "Frank James (8 November 1821 – 23 March 1924) was a British businessman, freemason and Conservative politician.\nHe was the fifth son of John James of Walsall, Staffordshire. He was educated at Handsworth, near Birmingham and King's College London.By 1885 he was living at Aldridge, near Walsall and was proprietor of James's Foundry, Walsall and President of the Walsall Chamber of Commerce. He was also chairman of the South Staffordshire Waterworks Company and a director of the Staffordshire Joint Stock Banking Company.James was a justice of the peace and deputy lieutenant for Staffordshire, and served as vice-chairman of the Staffordshire Quarter Sessions. When Staffordshire County Council was formed to take over the local government functions of the justices in 1889, he became a member, and was chairman and vice-chairman before retiring from the council in 1901.He had a very brief parliamentary career as Member of Parliament for Walsall. After unsuccessfully contesting the seat for the Conservatives at the general election of 1885 and a by-election in 1891, he was elected at the general election in July 1892. A petition to overturn the result of the election was made, however, alleging gross bribery, treating and general corruption. James was unseated in November when his son, who was his election agent, admitted to paying for the printing of cards to be displayed in his supporters' hats. This was found to be in breach of section 16 of the Corrupt Practices Act 1883, which forbade payment for cockades, ribbons, or other marks of distinction.James was a prominent freemason. He joined St Matthew's Lodge, Walsall in 1844, and was Provincial Grand Secretary of Staffordshire Province from 1860 to 1865, and Deputy Provincial Master in 1873. At the time of his death he was believed to be the oldest and longest-serving mason in the world, and possibly the first British member of parliament to have reached the age of 100.\nJames was twice married: to Ann Wells Ingram of Birmingham in 1844, and to Mary Holland in 1859.Frank James died at his home at Penkridge, Staffordshire in March 1924, aged 102.", "link_mentions": [{"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| Frank James"]}, {"page": "James (surname)", "response": ["* Frank James (disambiguation), multiple people", "** Frank James (MP) (1821–1924), British politician", "** Frank James (1843–1915), American outlaw", "**W. Frank James (1873–1945), US Congressman"]}, {"page": "Walsall (UK Parliament constituency)", "response": ["| Frank James"]}, {"page": "United Kingdom general election records", "response": ["*Frank James, 1892: 70"]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["Frank James, who was elected MP for Walsall at the 1892 general election, but unseated on petition in November that year, died at 102 years and 135 days old; James's record was surpassed by Atkins on 27 October 2018.The Times, 24 March 1924; pg. 15."]}, {"page": "List of United Kingdom by-elections (1885–1900)", "response": ["|Frank James"]}, {"page": "List of alumni of King's College London", "response": ["*Frank James – Conservative MP"]}, {"page": "Frank James (disambiguation)", "response": ["Frank James was an American outlaw and older brother of Jesse James.", "Frank James may also refer to:", "*W. Frank James (1873–1945), soldier and politician from the U.S. state of Michigan", "*Frank James (MP) (1821–1924), British politician"]}, {"page": "Edward Thomas Holden", "response": ["In July 1891, the sitting Liberal member of parliament for Walsall, Sir Charles Forster, died suddenly. Holden, who was a close friend of the late MP and president of Walsall Liberal Association, was unanimously adopted to contest the resulting by-election. Holden campaigned on a platform of opposing the incumbent Conservative government and was in favour of Irish Home Rule, \"one man - one vote\" and the introduction of elected parish councils. He also had the support of the local temperance movement, as he was in favour of the closure of licensed premises on Sundays. His Conservative opponent was Frank James, who was supported by the Licensed Vintners National Defence League.", "Holden's membership of the Commons was to be brief: a general election was held in 1892. Holden's opponent of the previous year, Frank James, was able to gain the seat for the Conservatives. Although James was subsequently unseated on petition in August 1892 due to breaches of Corrupt Practices Act 1883, Holden did not choose to claim the seat. Indeed, he stated that he would \"not again offer himself for Walsall or any other place\". However, he continued to be involved in Walsall politics at a municipal level. He was knighted in 1907."]}, {"page": "List of UK Parliamentary election petitions", "response": ["| 1892 || Walsall || Henry Hately, Thomas Moss and James Mason || Frank James || Bribery, etc. || Void election || 2,000 hat cards ordered by the local Licensed Victuallers' Association were paid for by James's agent out of the election account. This was illegal expenditure. || 4 O'M & H 123; Day p. 106-115; HCP 1893 25 p. 61-68"]}]}}