{"wiki_id": "http://www.wikidata.org/entity/Q5481482", "itemLabel": "Francis Jayne", "itemDescription": "British Anglican clergyman (1845-1921)", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Jayne", "wikipedia_page": {"main": "Francis John Jayne (1 January 1845 – 23 August 1921) was a British bishop and academic.\nBorn in Pant-y-beiliau, Llanelli, Jayne was the eldest son of John Jayne, a colliery owner and his second wife, Elisabeth Haines. He was educated at Rugby School and Wadham College, Oxford. He took his B.A. in 1868 and M.A. in 1870. He was awarded first class honours in classical moderations, literate humaniores, jurisprudence and modern history, making him distinguished academically. He was elected Fellow of Jesus College, Oxford in 1868 and tutor of Keble College in 1871. He was ordained deacon and priest in 1870.From 1879 to 1886, Jayne was Principal of St David's College, a university institution in the small Welsh town of Lampeter. During his time there, he steered the institution through the difficult years following the 1880 Aberdare Report on intermediate and higher education in Wales. The report recommended that the Colleges at Aberystwyth and Lampeter be united to form one institution, but Jayne fought the plan and retained St. David's College's independence.  Jayne reformed the college in many ways; new statutes were issued and affiliation to Oxford and Cambridge was achieved.  A new hall of residence was constructed and the college chapel was rebuilt. The number of students doubled. The college school opened in 1884, with the aim of providing a sound education for future entrants to the college. Jayne is remembered as the 'second founder' of the college.A devoutly religious man, Jayne left Lampeter to become an Anglican vicar in Leeds. He became Bishop of Chester in 1889, a position he held for the next thirty years. At the time of his appointment, he was the youngest English bishop. Under his rule, his diocese was said to be 'perhaps the most peaceful and orderly in England.'Jayne was concerned about excessive drinking and the misuse of alcohol. He published an article called Successful Public-House Reform discussing the virtues of the Scandinavian Gothenburg system for managing pubs etc. He also founded the People's Refreshment House Association Limited which at its peak owned 130 inns and hotels. Although Jayne was in poor health for lengthy periods during the First World War, and Edward Mercer, a retired Bishop of Tasmania, carried out many of his duties, Jayne left no one in any doubt about his support for British participation in the War against Germany and her allies. He said ‘The sword which God gave to earthly rulers to wield was given, we ventured to think, to England as the peacemaker of the world, as the guardian of the seas against the perils which would otherwise assail not only ourselves ... but all the nations of Europe and the world’. He followed up two months later clarifying what he regarded as Britain‘s duty ‘We are fighting, not only for ourselves and the safety of our Empire, but for the very life of Christian civilisation, for the cause of righteousness, honour and liberty, for the independence of smaller states ... and ultimately for the peace of the world.’He instigated a Roll of Honour with names of his clergy and their families who had volunteered for the Forces. He promoted the work of the Church Army and the YMCA, their need for volunteers and fund-raising. His increased workload led his staff to compel him to ‘abstain from all duties’ and to rest but his health remained fragile until and after his retirement.\nHe resigned his bishopric in April 1919 owing to ill health caused by over work.  He died at his home at The Quarry, Oswestry, and was buried at Bowdon, Cheshire.He and his wife Emily (née Garland) had six sons and three daughters, one of whom was the Norwegian-to-English translator Edith M. G. Jayne.", "link_mentions": [{"page": "Oswestry", "response": ["* Francis Jayne (1845-1921), former Bishop of Chester, died in retirement at Oswestry."]}, {"page": "Norway Scholarship", "response": ["The idea for a scholarship fund enabling students from Royal Frederik University, (now University of Oslo) to study for one year at Wadham College in Oxford was conceived in 1919 by a young alumnus of the college, who during the war years 1914–18 had held the post of British vice-consul at Kristiansund in Møre og Romsdal, Norway.  Arthur Ivor Garland Jayne (1882-1958) was a son of  Francis Jayne (1845–1921) Lord Bishop of Chester. Arthur Jayne had married Fredrikke Marie Cathrine von Munthe af Morgenstierne, daughter of Professor Bredo Henrik von Munthe af Morgenstierne (1851–1930), Rector of the University of Oslo (1912–1918). As with famous Polar explorer Fridtjof Nansen, he gave NOK 5000.- towards the establishment of a Norwegian Oxford Scholarship Fund. Altogether Jayne succeeded in raising NOK. 60 000.- or approximately GBP 2780. Jayne spent his later life as a lecturer in English at the University of Oslo."]}, {"page": "Francis John Jayne", "response": ["#REDIRECT Francis Jayne"]}, {"page": "Jayne", "response": ["*Francis Jayne (1845–1921), British bishop and academic"]}, {"page": "Handforth", "response": ["**St Chad's Church of England, part of the Diocese of Chester, is an Anglican church based in Handforth. During the 19th century, a chapel of ease was built in Handforth, then part of the parish of Cheadle. The chapel was consecrated in 1837 as a chapel to St Mary's Church, Cheadle, becoming the parish church for Handforth and part of Cheadle in 1877. Due to the growth of the population of Handforth in the late 19th century, the chapel went through extensive redevelopment and expansion, and the new building - known as St Chad's Church - was consecrated by Francis Jayne, Bishop of Chester on St Chad's day, 2 March, in 1899.Church of England: Diocese of Chester (Retrieved 30 November 2013)RC Diocese of Shrewsbury (Retrieved 30 November 2013)"]}, {"page": "1921 in Wales", "response": ["*23 August  (in Oswestry) - Francis Jayne, bishop and academic, 76"]}, {"page": "1845 in Wales", "response": ["*1 January – Francis Jayne, Principal of St David's College, Lampeter, and Bishop of Chester (died 1921)"]}, {"page": "List of Old Rugbeians", "response": ["* Rev Francis Jayne, Bishop of Chester and academic"]}, {"page": "List of University of Oxford people in religion", "response": ["| Francis Jayne "]}, {"page": "St John the Evangelist's Church, Sandiway", "response": ["The church was designed by John Douglas and built between 1902 and 1903. Douglas had been born in the village of Sandiway.Howell, Peter (2004) 'Douglas, John (1830–1911)', Oxford Dictionary of National Biography, Oxford University Press, retrieved on 22 January 2008  He donated the land on which the church was built and paid for the chancel and the lych gate. The tower was added at a later date as a memorial to Douglas. The foundation stone was laid on 12 April 1902 by the Earl of Mansfield, and the church was licensed for divine service on 15 October 1903. On 26 October the dedication and opening ceremony were performed by Rt. Revd. Francis Jayne, Bishop of Chester. The church was at this time a chapel of ease to St Mary's Church, Weaverham. It was licensed for marriages on 22 May 1906. On 29 March 1935 Sandiway was created as a parish in its own right."]}, {"page": "Christ Church, Wharton", "response": ["In 1913 the chancel was extended, and the church was reconsecrated on 18 October 1913 by the Bishop of Chester, Francis Jayne."]}]}}