{"wiki_id": "http://www.wikidata.org/entity/Q5488494", "itemLabel": "Frank Monk", "itemDescription": "English footballer (1886-1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Monk", "wikipedia_page": {"main": "Frank Vivian Monk (1886 – 15 November 1962) was an English amateur footballer who had a brief career with several professional clubs around 1910.", "link_mentions": [{"page": "Football at the 1912 Summer Olympics – Men's team squads", "response": ["The following players were also named as reserves, but did not play in any matches: Arthur Brown, George Bancroft, Charles Bradley, John Elvey, W. Chapman, Joseph Flavell, Frederick Atkins, Alec Barclay, George How, Frank Monk, William Callaghan, Arthur Smith, Harry Raymond, John Grant, Joe Bailey"]}, {"page": "Sam Jepp", "response": ["His longest period in the side came in the 1909–10 season, when he took over from new signing Andrew Davidson after the first six matches, retaining the No. 5 shirt for the remainder of the season. Jepp started the following season as the regular centre-half, before losing his place to Frank Monk after five matches. Although Jepp made a further four appearances later in the season, including playing as centre-forward against Luton Town on New Year's Eve, he was unable to regain a regular place in the side and was released in the summer of 1911."]}, {"page": "Monk (surname)", "response": ["*Frank Monk (1886–1962), English footballer (Southampton, Glossop, Fulham)"]}, {"page": "Dick Healey (footballer)", "response": ["Healey played at centre forward for The North in an amateur trial match in February 1910; his side lost 3–2, and he was not selected for the upcoming fixtures. His first international selection came in the form of a last-minute call-up when Frank Monk and Vivian Woodward dropped out of the England Amateur XI's visit to mainland Europe in March 1911. Healey made his debut against the French national team at the Stade de Paris, opening the scoring as his team won 3–0, and scored again a couple of days later against Switzerland in a 4–1 win. His next involvement at international level was nearly a year later, against the Wales Amateur XI at the ground of his former club, Bishop Auckland, in February 1912. He was involved in the buildup to the second goal, scored by Sydney Sanders, and scored the third himself as England won 3–0. He was selected as a reserve for matches at home to the Netherlands and away to Belgium in March and April, but did not make his next, and what turned out to be final, appearance until November against Belgium, in which he scored the second of England's four goals. He had to withdraw from the selection to face Wales in February 1913, and was an unused reserve for the visits to Germany and Belgium in March and to Wales the following February."]}]}}