{"wiki_id": "http://www.wikidata.org/entity/Q5486946", "itemLabel": "Frank Greenwood", "itemDescription": "English county cricketer (1905-1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Greenwood", "wikipedia_page": {"main": "Frank Edwards Greenwood (28 September 1905 – 30 July 1963) was an English first-class cricketer, who played 57 games for Yorkshire County Cricket Club between 1929 and 1932.  The tradition of the time demanded that Yorkshire have an amateur captain and Greenwood was appointed skipper in 1931, when he was also awarded his cap, and 1932. He missed parts of the 1932 season through injury, Brian Sellers captaining in his stead, and Greenwood resigned at the end of the season.\nBorn in Birkby, Huddersfield, Yorkshire, England, Greenwood was a right-handed batsman, who scored 1,558 runs at 26.86, with his only century (104 not out), coming against Glamorgan. He took two wickets with his occasional right arm medium pace, at a cost of 34.50.\nGreenwood died at Huddersfield Royal Infirmary, Lindley, on 30 July 1963, aged 59.", "link_mentions": [{"page": "Brian Sellers", "response": ["Sellers was born in Keighley, Yorkshire, England, and was a middle-order right-handed batsman of modest attainments, and close fielder. His  cricketing significance relates almost entirely to his captaincy of the successful Yorkshire side, both before and after  World War II. He played regularly for Yorkshire in 1932, and often captained the side in his debut season in the absence of the regular captain, Frank Greenwood. When Greenwood resigned at the end of that season, Sellers was appointed captain for 1933, and then held the post until 1948, when he retired."]}, {"page": "Yorkshire captaincy affair of 1927", "response": ["Worsley captained for just two seasons. He struggled with the demands of fielding, while his batting was disappointing. However, he was widely respected by the team. He was slightly more effective in his second season as leader, after which he retired.Woodhouse, p. 359. The next skipper, Alan Barber, although regarded as successful, captained for just one season. He was a more accomplished batsman and a great disciplinarian.Hill, pp. 108–9. However, he chose a career in teaching, limiting his availability, and resigned. The captain after that, Frank Greenwood, also did not hold the post long, resigning due to business commitments. Lord Hawke, writing in 1932, noted there had been eight captains since he retired in 1910. While six of them won the County Championship in their first season in charge, he stated that \"it is not good for a side to be always changing its captain\". Only when Brian Sellers was appointed in 1933 did Yorkshire gain the leader they wanted. After skippering most games in 1932 during Greenwood's frequent absences, he remained in the role until 1947 and was considered the best county captain of his time."]}, {"page": "Herbert Sutcliffe's cricket career (1928–1932)", "response": ["Sutcliffe's first-class aggregate in 1930 was 2,312 runs at 64.22 with 6 centuries and a highest score of 173 against Sussex.  Yorkshire finished third in the County Championship behind Lancashire and Gloucestershire.Webber, p.67.  Alan Barber replaced William Worsley as Yorkshire's amateur captain but played for one season only.  Of greater significance was the retirement of the man who many saw as the true Yorkshire captain, Wilfred Rhodes.  But one legend was replaced by another as Hedley Verity immediately stepped into Rhodes' boots, making 10 championship appearances and taking 52 wickets.  Sutcliffe made only 13 appearances in the championship as a result of Test calls and his thumb injury.  The team in 1930 lacked balance with a lot of changes taking place but a typical line-up was Sutcliffe, Holmes, Leyland, Oldroyd, Mitchell, Robinson, Wood, Rhodes or Verity, Alan Barber, Macaulay and Bowes.  The likes of Wilf Barber, Frank Dennis and future captain Frank Greenwood made occasional appearances.", "It was a great season for Yorkshire also as they finally won the County Championship for the first time since 1925.Webber, p.68.  Although Wilfred Rhodes had retired, the Yorkshire team, captained by another short-term amateur appointee in Frank Greenwood, still featured Emmott Robinson and had Holmes, Sutcliffe, Leyland, Oldroyd and Mitchell at the top of the batting order, Arthur Wood keeping wicket and match-winning bowlers in Macaulay, Bowes and Verity.  Wilf Barber was the main reserve and an interesting debutant was Arthur Booth, 15 seasons before he was finally able to make his mark as another match-winning bowler.", "Largely on account of Sutcliffe's runs and the bowling of Bowes and Verity, Yorkshire were able to win 15 of their last 16 games and retain their County Championship title.Webber, p.69.  Although Frank Greenwood was still the club captain, he only played in 6 championship matches and it was newcomer Brian Sellers who led Yorkshire in most of their matches.  Sellers soon became one of Yorkshire's greatest captains.  Percy Holmes missed several matches and Sutcliffe sometimes opened with Wilf Barber who now became a first team regular, especially as Edgar Oldroyd had retired.  Seam bowler Arthur Rhodes was a regular player in 1932, replacing the retired Emmott Robinson.  Bowes and Verity took well over 100 wickets each with Macaulay now playing a supporting role."]}, {"page": "List of Yorkshire cricket captains", "response": ["* 1931 – 1932 Frank Greenwood – champions 1931, 1932"]}]}}