{"wiki_id": "http://www.wikidata.org/entity/Q5489955", "itemLabel": "Frank Thornton", "itemDescription": "cricketer (1898-1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Thornton_(cricketer)", "wikipedia_page": {"main": "Frank Kenneis Thornton (28 October 1898 – 8 September 1987) was an English cricketer.  Thornton was a right-handed batsman.  He was born at Leicester, Leicestershire.\nThornton made two first-class appearances for Northamptonshire in the 1937 County Championship against Essex and Lancashire.  In the match against Essex at the Town Ground, Peterborough, Thornton scored 13 runs in Northamptonshire's first-innings, before being dismissed by Stan Nichols, while in their second-innings he was dismissed by the same bowler for 9 runs.  In the match against Lancashire at the County Ground, Northampton, he scored a single run in Northamptonshire first-innings, before being dismissed by Dick Pollard, while in their second-innings he ended not out on 4.He died at Fareham, Hampshire on 8 September 1987.  His brother John was also a first-class cricketer.", "link_mentions": [{"page": "Frank Thornton", "response": ["Frank Thornton Ball (15 January 192116 March 2013), professionally known as Frank Thornton, was an English actor. He was known for playing Captain Peacock in Are You Being Served? and its sequel Grace & Favour (Are You Being Served? Again!) and as Herbert \"Truly\" Truelove in Last of the Summer Wine.", "Frank Thornton Ball was born in Dulwich, London, the son of Rosina Mary (née Thornton) and William Ernest Ball. His father was an organist at St Stephen's Church, Sydenham Hill,St. Stephen Parish Magazine, Dulwich, London where Frank learned to play the organ for a short while. Music proved too difficult for him, however, and he wanted to act from an early age. His father, who worked in a bank, wanted him to get a \"proper\" job, so he began working in insurance after leaving Alleyn's School. He soon enrolled at a small acting school, the London School of Dramatic Art, and took evening classes. After two years working at the insurance company, he was invited to become a day student at the acting school and persuaded his father to finance his studies."]}]}}