{"wiki_id": "http://www.wikidata.org/entity/Q5487518", "itemLabel": "Frank James", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_James_(MP)", "wikipedia_page": {"main": "Frank James (8 November 1821 – 23 March 1924) was a British businessman, freemason and Conservative politician.\nHe was the fifth son of John James of Walsall, Staffordshire. He was educated at Handsworth, near Birmingham and King's College London.By 1885 he was living at Aldridge, near Walsall and was proprietor of James's Foundry, Walsall and President of the Walsall Chamber of Commerce. He was also chairman of the South Staffordshire Waterworks Company and a director of the Staffordshire Joint Stock Banking Company.James was a justice of the peace and deputy lieutenant for Staffordshire, and served as vice-chairman of the Staffordshire Quarter Sessions. When Staffordshire County Council was formed to take over the local government functions of the justices in 1889, he became a member, and was chairman and vice-chairman before retiring from the council in 1901.He had a very brief parliamentary career as Member of Parliament for Walsall. After unsuccessfully contesting the seat for the Conservatives at the general election of 1885 and a by-election in 1891, he was elected at the general election in July 1892. A petition to overturn the result of the election was made, however, alleging gross bribery, treating and general corruption. James was unseated in November when his son, who was his election agent, admitted to paying for the printing of cards to be displayed in his supporters' hats. This was found to be in breach of section 16 of the Corrupt Practices Act 1883, which forbade payment for cockades, ribbons, or other marks of distinction.James was a prominent freemason. He joined St Matthew's Lodge, Walsall in 1844, and was Provincial Grand Secretary of Staffordshire Province from 1860 to 1865, and Deputy Provincial Master in 1873. At the time of his death he was believed to be the oldest and longest-serving mason in the world, and possibly the first British member of parliament to have reached the age of 100.\nJames was twice married: to Ann Wells Ingram of Birmingham in 1844, and to Mary Holland in 1859.Frank James died at his home at Penkridge, Staffordshire in March 1924, aged 102.", "link_mentions": {}}}