{"wiki_id": "http://www.wikidata.org/entity/Q5487268", "itemLabel": "Frank Hobson", "itemDescription": "British flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Hobson", "wikipedia_page": {"main": "Frank Harold Hobson, MC (8 October 1894 – 1951) was a British flying ace of the First World War, credited with 15 aerial victories.", "link_mentions": [{"page": "No. 70 Squadron RAF", "response": ["During World War I, the squadron claimed 287 victories, and had as members nineteen aces, including Frank Granger Quigley, John Todd, Frank Hobson, Oscar Heron, Frank Gorringe, Walter M. Carlaw, George Robert Howsam, Clive Franklyn Collett, Alfred Michael Koch, Kenneth Bowman Watson, Noel Webb, Edward Gribben, and Frederic Laurence."]}, {"page": "Frank Granger Quigley", "response": ["Quigley victory tally comprised 16 enemy fighter planes destroyed and ten others driven down out of control, four observation planes destroyed and two driven down out of control, as well as an observation balloon destroyed. Quigley was the antithesis of the lone wolf pilot, sharing victories not just with Fry and Kemsley, but with such other aces as Frank Gorringe, George R. Howsam, John Todd, Frank Hobson, Alfred Michael Koch, and Walter M. Carlaw."]}, {"page": "List of World War I aces credited with 15–19 victories", "response": ["| Frank Hobson"]}, {"page": "Frederic Laurence", "response": ["Laurence was commissioned as a second lieutenant in the 6th Battalion, Worcestershire Regiment, being confirmed in his rank on 6 March 1915. He was later seconded to the Royal Flying Corps, being appointed a flying officer on 23 May 1917. He then served as a flight commander in No. 70 Squadron, flying a Sopwith Camel single-seat fighter.Shores et.al. (1990), p.234. He gained his first victory, shared with the rest of his flight, on 28 July 1917 by driving down a German two-seater over Ypres. On 20 October he drove down an Albatros D.V over the Roulers—Menin road, and another west of Roulers the following day. A week later, on 27 October, he scored twice, driving down two more D.Vs over Roulers, one solo and the other shared with Major Nethersole, Lieutenant Goode, and Second Lieutenants Frank Hobson, C. W. Primeau, and Edward Booth. On 26 November he was awarded the Military Cross."]}, {"page": "List of World War I flying aces from the British Empire", "response": ["* Frank Hobson"]}]}}