{"wiki_id": "http://www.wikidata.org/entity/Q5489094", "itemLabel": "Frank Pullen", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Pullen", "wikipedia_page": {"main": "Francis Henry Pullen (8 September 1915 – 17 January 1992) was an English businessperson and racehorse owner.", "link_mentions": [{"page": "January 17", "response": ["*1992 – Frank Pullen, English soldier and businessman (b. 1915)"]}, {"page": "Catford", "response": ["* Frank Pullen, the property developer and racehorse owner was born in Catford and opened the first of his shops on Catford Broadway."]}, {"page": "Pullen", "response": ["* Frank Pullen (1915–1992), English businessperson and racehorse owner"]}, {"page": "Bob Champion", "response": ["Champion became a trainer based in Newmarket. The first horse he bought as such was \"Just Martin\" for owner Frank Pullen,Bob Champions Facebook page 21/11/2020 who also built his yard.The Sporting Life (British newspaper), 24 January 1992 He retired from training horses in 1999."]}, {"page": "1915 in the United Kingdom", "response": ["* 8 September – Frank Pullen, businessman and racehorse owner (died 1992)"]}, {"page": "Josh Gifford", "response": ["Gifford was born in Huntingdon.  At the age of 28, he turned to training racehorses, with Frank Pullen being his first owner, and later trained Aldaniti, the winner of the 1981 Grand National. He was played by Edward Woodward in the 1983 film Champions."]}, {"page": "Peter Bromley", "response": ["Born at Heswall on the Wirral (then in Cheshire) Bromley was educated at Cheltenham College and Sandhurst.  He served as a lieutenant in the 14th/20th King's Hussars, where he won the Bisley Cup for rifle shooting and came close to qualifying for Britain's modern pentathlon team for the 1952 Summer Olympics.  He subsequently became the assistant to the British racehorse trainer Frank Pullen, and rode occasionally as an amateur jockey until he fractured his skull when a horse he was riding collided with a lorry."]}, {"page": "Index of World War II articles (F)", "response": ["# Frank Pullen"]}, {"page": "List of people from Beckenham", "response": ["*Frank Pullen (1915–1992), businessman and builder"]}, {"page": "September 1915", "response": ["* Born: Frank Pullen, English businessman, owner of property developer Pullen Estates and the Pullen Shops chain in Great Britain, in London (d. 1992); Nela Arias-Misson, Cuban artist, member of the abstract expressionism movement, in Havana (d. 2015)"]}]}}