{"wiki_id": "http://www.wikidata.org/entity/Q5488186", "itemLabel": "Frank Marsden", "itemDescription": "British politician (1923-2006)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Marsden", "wikipedia_page": {"main": "Frank Marsden (15 October 1923 – 5 November 2006) was a British Labour Party politician.  He served as Member of Parliament (MP) for Liverpool Scotland from 1971 to 1974.\nMarsden was born in Everton in Liverpool, and was educated at Abbotsford Road Secondary School.  He volunteered to join the RAF in 1941, aged 18, and served with 115 Squadron, which flew Lancaster bombers from bases in East Anglia in the Second World War.  He married his wife, Muriel, in 1943, and was demobilised as a warrant officer in 1948.  He returned to Liverpool and worked as a salesman for Fitzpatricks (a wholesale greengrocer and flower merchant), as a crane driver in Liverpool Docks, and then as a telephonist for the General Post Office.\nHe joined the Labour party in 1948, and became member of Liverpool City Council for the St Domingo ward in 1964.  He lost his seat in 1967, but was re-elected for the Vauxhall ward in 1969.  He resigned from the council when he was elected as MP for Liverpool Scotland in a by-election held in April 1971, after the sitting Labour MP Walter Alldritt had resigned to become regional secretary of the National Union of General and Municipal Workers.  Marsden had previously served at Alldritt's agent.  In Parliament, Marsden was a strong supporter of comprehensive schools.\nMarsden's constituency was merged with the neighbouring Liverpool Exchange for the February 1974 general election, and Robert Parry won the selection for the new Liverpool Scotland Exchange seat.  Marsden returned to his job at the GPO.  He remained a loyal supporter of the Labour Party, and was later elected as a councillor on Knowsley Metropolitan Borough Council and Merseyside County Council. He disagreed with the Militant tendency in the 1980s.\nHis wife died in 2001, but Marsden was survived by their three sons.  He died in Liverpool.\n\n", "link_mentions": {}}}