{"wiki_id": "http://www.wikidata.org/entity/Q5485427", "itemLabel": "Frank Bowyer", "itemDescription": "English footballer (1922-1999)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Bowyer", "wikipedia_page": {"main": "Francis \"Frank\" Bowyer (10 April 1922 – 11 November 1999) was an English footballer who played for Stoke City.", "link_mentions": [{"page": "Stanley Matthews", "response": ["Stoke City arranged a testimonial match in honour of Matthews; it was much needed as he had spent most of his career constricted to the tight maximum wage that had been enforced upon the English game and only abolished a few years before his retirement. The game was played at the Victoria Ground on 28 April 1965, by which time Matthews had decided to retire as a player, and the pre-match entertainment consisted of another match of two veteran teams featuring many legends of the game. Harry Johnston led out a team consisting of Bert Trautmann, Tim Ward, George Hardwick, Jimmy Hill, Neil Franklin, Don Revie, Stan Mortensen, Nat Lofthouse, Jimmy Hagan, Tom Finney and Frank Bowyer (reserve). Walley Barnes led out an opposing team consisting of Jimmy O'Neill, Jimmy Scoular, Danny Blanchflower, Jimmy Dickinson, Hughie Kelly, Bill McGarry, Jackie Mudie, Jackie Milburn, Jock Dodds, Ken Barnes, and Arthur Rowley (reserve)."]}, {"page": "Chesterton, Staffordshire", "response": ["* Frank Bowyer (1922–1999) footballer"]}, {"page": "Bowyer (surname)", "response": ["* Frank Bowyer, English footballer"]}, {"page": "Freddie Steele (footballer)", "response": ["He returned to the Potteries in 1945–46, scoring 49 goals in 43 games during the course of the season. Competitive football resumed for the 1946–47 season, and Steele scored 31 goals in 43 games, bagging hat-tricks against Middlesbrough, Sheffield United, Grimsby Town, and Burnley, as Stoke posted another fourth-place finish. He was Stoke's top-scorer for a sixth successive season in 1947–48, though he hit just 12 goals in 23 appearances; his contribution as the campaign was limited as he spent four months on the sidelines with a broken leg. He hit 19 goals in 42 games in 1948–49, though Frank Bowyer had by then taken up the mantle as Stoke's main goal getter. Steele left the club in 1949, due to persistent knee problems. Nicknamed \"Nobby\" by fans, Steele scored 220 goals in 384 games in all competitions during his tenure at the club. He remains the second highest scoring in the club's history, after John Ritchie."]}, {"page": "Harry Oscroft", "response": ["In January 1950, at age 23, he joined Stoke City after Bob McGrory offered Mansfield manager Freddie Steele £8,000 plus Verdi Godwin. He scored three goals in 16 First Division games in 1949–50. He hit six goals in 39 appearances in 1950–51, before hitting 10 goals in 44 games in 1951–52. McGrory was then replaced as manager by Frank Taylor. Oscroft hit ten goals in 39 games in 1952–53 to become the club's top scorer, as the \"Potters\" were relegated into the Second Division after finishing one point behind 20th place Manchester City. He bagged 13 goals in 36 appearances in 1953–54, before hitting 21 goals in 38 games in 1954–55 to become the club's top-scorer for a second time. He hit his first hat-trick for Stoke on 2 October 1954, in a 4–1 win over Lincoln City at Sincil Bank. Oscroft hit 18 goals in 43 games in 1955–56, becoming the club's joint-top-scorer, along with Frank Bowyer and Johnny King. City suffered a six games losing streak in which they failed to find the net late into the 1956–57 campaign, which ultimately cost them promotion; Oscroft still managed 12 goals in 42 appearances throughout the season. He was limited to 22 games and seven goals in 1957–58. He found eight goals in 30 appearances in 1958–59, as Stoke again failed to win promotion. A prolific goalscorer, averaging nearly one goal in every three games during his ten years at the Victoria Ground, he made 349 appearances and scored 106 goals, becoming the club's sixth highest goalscorer of all time (as of 2012)."]}, {"page": "List of Stoke City F.C. seasons", "response": ["|align=left| Frank Bowyer", "|align=left| Frank Bowyer", "|align=left| Frank Bowyer", "|align=left| Frank Bowyer", "|align=left| Frank Bowyer, Johnny King", "|align=left| Frank Bowyer"]}, {"page": "John Cunliffe (footballer, born 1930)", "response": ["He transferred to rivals Stoke City, along with £2,000, in exchange for Peter Ford and Harry Oscroft in September 1959. He scored three goals in 25 Second Division games for the \"Potters\" in 1959–60, before he was allowed to leave the Victoria Ground by manager Frank Taylor. He signed with Macclesfield Town, scoring 34 goals in 98 Cheshire County League games for Frank Bowyer's \"Silkmen\". He later played for Stafford Rangers and Buxton."]}, {"page": "1947–48 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Frank Bowyer"]}, {"page": "1948–49 Stoke City F.C. season", "response": ["A mid table position of 11th was all that Stoke could have expected from an inconsistent season with 16 wins and 17 defeats. One key point during the season was manager Bob McGrory's decision to employ Frank Bowyer as an out-and-out centre forward and he scored 21 goals. Surprisingly, when the campaign ended Bowyer asked for a transfer which was accepted but he soon had a change of heart and would remain at the club until 1960.", "|align=\"left\"|FW||align=\"left\"| Frank Bowyer"]}, {"page": "1949–50 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Frank Bowyer"]}, {"page": "1950–51 Stoke City F.C. season", "response": ["Stoke drew local rivals Port Vale in the third round and the two sides served up a thrilling cup tie. The initial clash with Vale took place on a heavy Victoria Ground pitch was seen by over 48,000 fans. In an entertaining first half Alan Bennett put Vale into the lead after six minutes and although Stoke pushed hard for an equaliser they couldn't beat Ray King. Then the Vale fans were celebrating again as their side went 2–0 up, Cliff Pinchbeck scoring after 45 seconds into the second half. Stoke were rattled and soon after Albert Mullard pulled one back with a crisp shot from the edge of the area and he then scored again to set up a frantic finale. However, with both teams battling it out in the mud the match finished in a fair draw. With Vale Park waterlogged it was back to the Victoria Ground and was again a tense encounter. Vale were the better team creating the most chances but with just seconds remaining Frank Bowyer who had been kept quite by the \"Valiants\" defence suddenly found space and headed in a Harry Oscroft cross to end the tie.", "|align=\"left\"|FW||align=\"left\"| Frank Bowyer"]}, {"page": "1951–52 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Frank Bowyer"]}, {"page": "1952–53 Stoke City F.C. season", "response": ["Prior to the lead up to 1953 Stoke had agonisingly slipped into the relegation zone, but seven games without defeat at the turn of the year they seemed to have averted the danger. But then it all went wrong again and they slipped back down the table and in the end they had to win their final match of the season against an already relegated Derby County at the Victoria Ground. Most expected Stoke to step it up and beat a dejected Derby side but disaster struck as Jack Lee scored for the \"Rams\" early on. Stoke hit back through Frank Bowyer but Jackie Stamps but Derby 2–1 up. Stoke created plenty of chances and with just minutes left were awarded a penalty but the reliable Ken Thomson hit his kick straight at Ray Middleton and with it ended Stoke's 20 year stay in the First Division.", "|align=\"left\"|FW||align=\"left\"| Frank Bowyer"]}, {"page": "Derrick Ward (footballer)", "response": ["Born in Stoke-on-Trent Ward started his career at his local club Stoke City where he made his debut in the 1952–53 season.  He was a bit part player at Stoke due Frank Bowyer and Bobby Howitt occupying Ward's position.  He became more involved with the first team in the 1958–59 season where he made 17 appearances however he was allowed by manager Tony Waddington to join Stockport County in 1961.  Ward went on to spend three years at Edgeley Park making 81 league appearances scoring 21 goals."]}, {"page": "1953–54 Stoke City F.C. season", "response": ["After soundly beating Hartlepool United 6–2 in the third round with Frank Bowyer scoring four Stoke lost to Leicester City after a replay.", "|align=\"left\"|FW||align=\"left\"| Frank Bowyer"]}, {"page": "Neville Coleman (footballer)", "response": ["Coleman was born in Prescot and joined Stoke City in 1953 as an amateur from Gorleston, Norfolk where he was completing his National Service at the local RAF base. Stoke helped Coleman secure his released from the services in January 1954 although rules meant he could not turn professional for a year. Despite initially being signed as a centre-forward to partner Frank Bowyer, manager Frank Taylor saw him as a right winger witch saw Coleman drop into the reserves to learn his new position. However a career ending injury to John Malkin in October 1956 handed Coleman his chance in the first team. He quickly became a key member of the Stoke team although an often frustrating one becoming notoriously inconstant. Whilst he lacked pace he was very difficult to dispossess."]}, {"page": "1954–55 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Frank Bowyer"]}, {"page": "1955–56 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Frank Bowyer"]}, {"page": "1956–57 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Frank Bowyer"]}, {"page": "1957–58 Stoke City F.C. season", "response": ["Prior to the start of the 1957–58 season both George Bourne and John Malkin had to retire from playing due to injury. Despite this the management left the transfer market alone during the summer of 1957 with Frank Taylor saying: I am slowly getting together a useful squad and building a settled side. However the club was still short on forward players with only five available these of Frank Bowyer, Neville Coleman, Johnny King, George Kelly and Harry Oscroft. Yet to their credit these five kept the goals flowing with Kelly top scoring with 24 to his name.", "|align=\"left\"|FW||align=\"left\"| Frank Bowyer"]}, {"page": "1958–59 Stoke City F.C. season", "response": ["It had been a fairly uninspiring yet somewhat of a transitional season with Neville Coleman moving on to Crewe Alexandra for a modest fee after scoring 52 goals in 126 games for the club while three club legends Frank Bowyer, John McCue and Harry Oscroft where entering the veteran stage of their careers. Before the season was out Oscroft was involved in a three-man swap, as he and Peter Ford move to Vale Park in exchange for John Cunliffe a left-winger who had a good career at Vale but failed to make an impression with Stoke. John Sellars who missed the season due to an eye injury decided to retire and Stoke decided to end their season with a trip to Morocco.", "|align=\"left\"|FW||align=\"left\"| Frank Bowyer"]}, {"page": "1959–60 Stoke City F.C. season", "response": ["It was in defence where the problems lay as manager Frank Taylor used four different keepers one of which was Tommy Younger a fine keeper for Liverpool but in his ten matches for Stoke he lost nine of them conceding 22 goals and he quickly left. Ken Thomson was sold to Middlesbrough and legendary striker Frank Bowyer decided to retire.", "|align=\"left\"|FW||align=\"left\"| Frank Bowyer"]}]}}