{"wiki_id": "http://www.wikidata.org/entity/Q5486868", "itemLabel": "Frank Glass", "itemDescription": "Canadian ice hockey player", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Glass", "wikipedia_page": {"main": "Frank \"Pud\" Glass (February 10, 1884 – March 2, 1965) was a Scottish-Canadian professional ice hockey player who played in various professional and amateur leagues, including the National Hockey Association and Eastern Canada Amateur Hockey Association. He was a member of the Montreal Wanderers' Stanley Cup champion teams in the 1905–06, 1906–07, 1907–08 and 1909–10 seasons. He was the captain of Montreal Wanderers when they won their fourth Stanley Cup.", "link_mentions": [{"page": "List of Stanley Cup champions", "response": ["| Frank Glass ", "| rowspan=\"2\" | Frank Glass "]}, {"page": "Moose Johnson", "response": ["The ECAHA turned professional in 1906–07, and the Wanderers signed Johnson to a contract. Along with teammates Jack Marshall, Hod Stuart, Frank Glass and Riley Hern, Johnson became the first professional player ever allowed to compete for the Stanley Cup as the Wanderers defended a challenge by the New Glasgow Cubs of the Maritime Hockey League prior to the ECAHA season's start. The Wanderers lost a second challenge for the Cup, this time by the Kenora Thistles in January 1907 but finished the ECAHA season with a perfect 10–0 record to earn the right to challenge Kenora to a return matchup in March. Johnson improved to 15 goals in 10 games during the season, and was named to the second all-star team on left wing. He scored five more goals in the six games played over three Stanley Cup challenges, including two in the final game of the second series against Kenora to help the Wanderers regain control of the Cup."]}, {"page": "Hod Stuart", "response": ["As the IPHL convinced players to move to the United States and get paid to play, hockey teams in Canada were forced to match the salaries in order to keep their players. Stuart, who was unhappy playing in Pittsburgh because of the violence involved in games, heard from Dickie Boon that the Montreal Wanderers, defending Stanley Cup winners, of the Eastern Canada Amateur Hockey Association (ECAHA) were willing to make Stuart the highest paid player in hockey if he were to join the team. On December 13, 1906, Stuart had a letter published in the Montreal Star that detailed his problems with the IPHL. Stuart's chief concern was the officiating; he said they \"don't know how to run hockey over here, the rink people appoint the most dumb and incompetent referees that could be found.\" In December 1906 Pittsburgh refused to play a game against Michigan Soo, claiming they did not like the choice of referee. While a common problem in the IPHL, Pittsburgh's management believed Stuart was behind the action, and released him from the team. No longer bound to any team, Stuart joined the Wanderers; his first game with the team was watched by 6,069 fans, one of the largest audiences to see a hockey game in Canada to that point. He took part in the Wanderers' Stanley Cup challenge against the New Glasgow Cubs, a team from Nova Scotia, on December 27 and 29, 1906, and along with teammates Riley Hern, Frank Glass, Moose Johnson and Jack Marshall, became the first professional hockey players to compete for the Stanley Cup.", "| Frank Glass"]}, {"page": "1906 ECAHA season", "response": ["Ottawa was installed as 2–1 betting favourites, but the Wanderers upset the bookies.Whitehead, pg. 31 In the first game in Montreal, the Wanderers dominated Ottawa, as Ernie Russell got four goals, Frank Glass got three and Moose Johnson would get two for a 9–1 victory."]}, {"page": "1907–08 ECAHA season", "response": ["* Frank Glass, rover,"]}, {"page": "Frank \"Pud\" Glass", "response": ["#REDIRECT Frank Glass"]}, {"page": "1905–06 Ottawa Hockey Club season", "response": ["Ottawa was installed as 2–1 betting favourites, but the Wanderers upset the bookies.Whitehead, pg. 31 In the first game in Montreal, the Wanderers dominated Ottawa, as Ernie Russell got four goals, Frank Glass got three and Moose Johnson would get two for a 9–1 victory."]}]}}