{"wiki_id": "http://www.wikidata.org/entity/Q5481246", "itemLabel": "Francis Hastings, Lord Hastings", "itemDescription": "English noble", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Hastings,_Lord_Hastings", "wikipedia_page": {"main": "Francis Hastings, Lord Hastings (1560 – 17 December 1595) was the son of George Hastings, 4th Earl of Huntingdon and Dorothy Port.  He married Sarah Harington, daughter of Sir James Harington and Lucy Sydney. They had five children:\n\nCatherine, who married Philip Stanhope, 1st Earl of Chesterfield, died 28 August 1636\nHenry, who succeeded his grandfather as Earl of Huntingdon.\nSir George Hastings\nCaptain Edward Hastings, died 1617\nTheodosia Hastings, married Sir Francis Bodenham.His widow, Sara or Sarah Harington (1565-1628) married Sir George Kingsmill, then Edward 11th Baron Zouche, and finally, Sir Thomas Edmondes. Her portrait was painted by Isaac Oliver and by Cornelius Johnson. The portraits by Johnson show her aged 63 wearing a large miniature case referring to Frederick V of the Palatinate with the Greek letter \"phi\". An similar miniature case was described in an inventory of a Scottish soldier.", "link_mentions": [{"page": "Earl of Huntingdon", "response": ["When he died the titles passed to his grandson, the fifth Earl. He was the son of Francis Hastings, Lord Hastings (d. 1595). Lord Huntingdon was also Lord-Lieutenant of Leicestershire and Rutland. He was succeeded by his eldest son, the sixth Earl. He sat as Member of Parliament for Leicestershire. His son, the seventh Earl, served as Lord-Lieutenant of Leicestershire and Derbyshire. He was succeeded by his eldest son, the eighth Earl. He carried the Sceptre at the Coronation of Queen Anne but died at an early age. He was succeeded by his half-brother, the ninth Earl. He carried the Sword of State at the Coronation of King George II. His son, the tenth Earl, was a courtier and notably served as Master of the Horse. He had no legitimate male issue and on his death in 1789 the earldom became dormant. He was succeeded in the baronies of Hastings, Hungerford, de Moleyns and Botreaux by his sister Lady Elizabeth, wife of The 1st Earl of Moira."]}, {"page": "Philip Stanhope, 1st Earl of Chesterfield", "response": ["In 1604, Stanhope married Catherine Hastings (d. 1636), daughter of Francis Hastings, Lord Hastings. According to Sir Egerton Brydges pp. 23,Collin's Peerage of England by Sir Egerton Brydges, K.J.: in nine volumes: VOL. III 1812: Earl of Chesterfield: pp. 421- 433 Catherine and Philip had eleven sons and two daughters:"]}, {"page": "Ferdinando Stanhope", "response": ["Stanhope was born at Shelford Manor, Nottinghamshire; his date of birth is uncertain but must have been around 1618 in order to meet the minimum age of 21 when elected to Parliament in 1640. He was the ninth but fourth surviving son of Philip Stanhope, 1st Earl of Chesterfield and his wife Catherine, daughter of Francis Hastings, Lord Hastings."]}, {"page": "Henry Stanhope, Lord Stanhope", "response": ["He was the second and next surviving son of Philip Stanhope, 1st Earl of Chesterfield and his first wife Catherine Hastings, daughter of Francis Hastings, Lord Hastings, oldest son of George Hastings, 4th Earl of Huntingdon. Amongst his younger brothers were Ferdinando Stanhope and Arthur Stanhope, while his nephew was James Stanhope, 1st Earl Stanhope. He entered the English House of Commons in 1625, sitting for Nottinghamshire in the following two parliaments until 1626. In the third parliament of 1628, he represented East Retford until the next year. At the coronation of King Charles I of England in 1625, he was made a Knight of the Order of the Bath."]}, {"page": "Arthur Stanhope", "response": ["Stanhope was born at Shelford, Mansfield Woodhouse, Nottinghamshire, the son of Philip Stanhope, 1st Earl of Chesterfield and his wife Catherine Hastings, daughter of Francis Hastings, Lord Hastings and was baptised on 10 April 1627. He entered Gray's Inn in 1642. Three older brothers were killed on the Royalist side in the English Civil War but he tended to support the parliamentary party. He lived at Shelford Manor which was badly damaged in 1660 when the disintegrating Commonwealth army attacked Nottingham. History of Parliament Online - Stanhope, Arthur"]}, {"page": "Francis Hastings", "response": ["* Francis Hastings, Lord Hastings (1560–1595), son of the 4th Earl of Huntingdon"]}, {"page": "Francis Hastings, Baron Hastings", "response": ["#REDIRECT Francis Hastings, Lord Hastings"]}, {"page": "George Hastings (died 1641)", "response": ["Hastings was the second son of Francis Hastings, Lord Hastings and his wife Sarah Harington, daughter of Sir James Harington and Lucy Sydney. He was admitted at Sidney Sussex College, Cambridge on 2 July 1605 and at Gray's Inn on 22 March 1611. He was of Ashby-de-la-Zouch, Leicestershire and was knighted on 3 November 1619.Knights of England   "]}, {"page": "Francis Bodenham", "response": ["He married Penelope Wingfield (d. 1625), a daughter of Sir Edward Wingfield (d. 1603) of Kimbolton Castle and Mary Harington, and secondly Theodosia Hastings, daughter of Francis Hastings, Lord Hastings and Sarah Harington.Simon Healy, 'BODENHAM, Sir Francis (c.1582-1645), of Ryhall, Rutland', The History of Parliament: the House of Commons 1604-1629, ed. Andrew Thrush and John P. Ferris, 2010."]}, {"page": "Dorothy Hastings", "response": ["She, (or the wife of her brother Francis Hastings, Lord Hastings, Sarah Harington, also known as Lady Hastings), travelled to Scotland in 1603 in the hope of finding favour with Anne of Denmark. Her party met the queen ahead of an official group sent to welcome the queen at Berwick upon Tweed. Hastings's party consisted of members of the Harington family, including Anne, Lady Harington, her daughter Lucy Russell, Countess of Bedford, Theodosia Noel, Lady Cecil, with Elizabeth Cecil, Lady Hatton.Eva Griffith, A Jacobean Company and its Playhouse: The Queen's Servants at the Red Bull Theatre (Cambridge, 2013), pp. 119-120: Barbara Kiefer Lewalski, Writing Women in Jacobean England (Harvard, 1994), p. 22."]}]}}