{"wiki_id": "http://www.wikidata.org/entity/Q5487606", "itemLabel": "Frank Joy", "itemDescription": "English cricketer (1880-1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Joy", "wikipedia_page": {"main": "Frank Douglas Howarth Joy (26 September 1880 – 17 February 1966) played first-class cricket for Europeans cricket teams in India and then for Somerset. He was born at Hessle, Yorkshire and died at Winchester, Hampshire.\nEducated at Winchester College and at New College, Oxford, Joy played as a right-handed tail-end batsman and a left-arm fast-medium bowler in one of the trial matches for the Oxford University cricket team of 1901, but was not selected for a first-class game. From 1906, Joy was employed as a tutor in the household of the Rajah of Dhar in India and then on the staff of the Central India College. In September 1908, he played in three first-class cricket matches for the Europeans team, taking 28 wickets in the three matches, including 10 in a match twice. In his first game, against the Parsees in the Bombay Presidency Match in Pune, Joy took seven Parsee wickets for 86 runs in the first innings, and followed that with three for 92 in the second for match figures of 10 for 178: the Parsees still won the match. He was less successful in his second game, against the Parsees again, this time in the Bombay Triangular Tournament, with seven wickets in the match including five for 29 in the first innings, but the Europeans won the match. Finally, in the tournament final, Joy had both his best match and innings bowling performances: seven for 24 followed by four for 50, for a match return of 11 for 74, and the Europeans won the trophy.From 1909, Joy returned to the UK and played a few matches in each of the next four seasons for Somerset, though with limited success. His matches in 1910 and 1911 all came late in the season, indicating that he had become a schoolmaster, and only in the last match of 1910, against Yorkshire did he develop anything like his Indian form, finishing with an innings return of five for 44 in a rain-ruined match. There were a further four matches in 1911 without success and in 1912 his sole appearance was against the Australians: he scored 6 and 7 and failed to take a wicket. That was Joy's last first-class cricket match.\nHis obituary in Wisden Cricketers' Almanack in 1967 states that he was the father of Nancy Joy (Sylvia Nancy Wansborough, 1915–1997), who was prominent in women's cricket and wrote books about it.", "link_mentions": {}}}