{"wiki_id": "http://www.wikidata.org/entity/Q5487772", "itemLabel": "Frank Kuppner", "itemDescription": "British poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Kuppner", "wikipedia_page": {"main": "Frank Kuppner (born 1951 in Glasgow) is a Scottish poet and novelist.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Frank Kuppner (born 1951, S)"]}, {"page": "Anthology of Twentieth-Century British and Irish Poetry", "response": ["* Frank Kuppner"]}, {"page": "The Drouth", "response": ["*Issue 6: 'Fact' Frank Kuppner, novelist", "*Frank Kuppner"]}, {"page": "Rune Christiansen", "response": ["Rune Christiansen debuted as a poet in 1986. Since then, he has written twelve collections of poems, and nine novels. He has also translated Alain Bosquet, Eugenio Montale, Frank Kuppner and Edmond Jabès."]}, {"page": "List of Scottish poets", "response": ["*Frank Kuppner"]}, {"page": "Novel in Scotland", "response": ["From the 1980s Scottish literature enjoyed another major revival, with figures including Alasdair Gray, James Kelman, Irvine Welsh, Alan Warner, Janice Galloway, A. L. Kennedy, Iain Banks, Candia McWilliam, Frank Kuppner and Andrew O'Hagan. In genre fiction Iain Banks, writing as Iain M. Banks, produced ground-breaking science fiction and Scottish crime fiction has been a major area of growth with the success of novelists including Frederic Lindsay, Quintin Jardine, Val McDermid, Denise Mina, Christopher Brookmyre, and particularly Ian Rankin and his Inspector Rebus novels.", "Other notable authors to gain prominence in this period included Janice Galloway (b. 1956) with work such as The Trick is to Keep Breathing (1989) and Foreign Parts (1994); A. L. Kennedy (b. 1965) with Looking for the Possible Dance (1993) and So I Am Glad (1995); Iain Banks (1954–2013) with The Crow Road (1992) and Complicity (1993); Candia McWilliam (b, 1955) with Debatable land (1994); Frank Kuppner (b. 1951) with Something Very Like Murder (1994); and Andrew O'Hagan (b. 1968) with Our Fathers (1999). In genre fiction Iain Banks, writing as Iain M. Banks, produced ground-breaking science fiction. Scottish crime fiction, known as Tartan Noir,P. Clandfied, \"Putting the 'black' into 'tartan noir'\" in Julie H. Kim, ed., Race and Religion in the Postcolonial British Detective Story: Ten Essays (McFarland, 2005), , p. 221. has been a major area of growth with the success of novelists including Frederic Lindsay (1933–2013), Quintin Jardine (b. 1945), Val McDermid (b. 1955), Denise Mina (b. 1966), Christopher Brookmyre (b. 1968), and particularly the success of Edinburgh's Ian Rankin (b. 1960) and his Inspector Rebus novels. "]}, {"page": "Literature in modern Scotland", "response": [" in S. Lyall, ed., Community in Modern Scottish Literature (Leiden | Boston: Brill | Rodopi, 2016), pp. 1-24 (pp. 4-10). John Buchan played a major role in the creation of the modern thriller with The Thirty-Nine Steps and Greenmantle. The Scottish Renaissance increasingly focused on the novel. Major figures included Neil Gunn, George Blake, A. J. Cronin, Eric Linklater and Lewis Grassic Gibbon. There were also a large number of female authors associated with the movement, who included Catherine Carswell, Willa Muir, Nan Shepherd and Naomi Mitchison. Many major Scottish post-war novelists, such as Robin Jenkins, Jessie Kesson, Muriel Spark, Alexander Trocchi and James Kennaway spent most of their lives outside Scotland, but often dealt with Scottish themes. Successful mass-market works included the action novels of Alistair MacLean and the historical fiction of Dorothy Dunnett. A younger generation of novelists that emerged in the 1960s and 1970s included Allan Massie, Shena Mackay and Alan Spence. Working class identity continued to be explored by Archie Hind, Alan Sharp, George Friel and William McIlvanney. From the 1980s Scottish literature enjoyed another major revival, with figures including Alasdair Gray, James Kelman, Irvine Welsh, Alan Warner, Janice Galloway, A. L. Kennedy, Iain Banks, Candia McWilliam, Frank Kuppner and Andrew O'Hagan. In genre fiction Iain Banks, writing as Iain M. Banks, produced ground-breaking science fiction and Scottish crime fiction has been a major area of growth with the success of novelists including Frederic Lindsay, Quintin Jardine, Val McDermid, Denise Mina, Christopher Brookmyre, and particularly Ian Rankin and his Inspector Rebus novels. The most successful author of Scottish origins in recent years has been J. K. Rowling, author of the Harry Potter series.", "Other notable authors to gain prominence in this period included Janice Galloway (b. 1956) with work such as The Trick is to Keep Breathing (1989) and Foreign Parts (1994); A. L. Kennedy (b. 1965) with Looking for the Possible Dance (1993) and So I Am Glad (1995); Iain Banks (1954–2013) with The Crow Road (1992) and Complicity (1993); Candia McWilliam (b. 1955) with Debatable land (1994); Frank Kuppner (b. 1951) with Something Very Like Murder (1994); and Andrew O'Hagan (b. 1968) with Our Fathers (1999). In genre fiction Iain Banks, writing as Iain M. Banks, produced ground-breaking science fiction. Scottish crime fiction, known as Tartan Noir,P. Clandfied, \"Putting the 'black' into 'tartan noir'\" in Julie H. Kim, ed., Race and Religion in the Postcolonial British Detective Story: Ten Essays (McFarland, 2005), , p. 221. has been a major area of growth with the success of novelists including Frederic Lindsay (1933–2013), Quintin Jardine (b. 1945), Val McDermid (b. 1955), Denise Mina (b. 1966), Christopher Brookmyre (b. 1968), and particularly the success of Edinburgh's Ian Rankin (b. 1960) and his Inspector Rebus novels. The most successful author of Scottish origins in recent years has been J. K. Rowling (b. 1965), author of the Harry Potter children's fantasy novels."]}, {"page": "Travelling Scholarship", "response": ["* Frank Kuppner"]}]}}