{"wiki_id": "http://www.wikidata.org/entity/Q5482776", "itemLabel": "Francis Willey, 1st Baron Barnby", "itemDescription": "British merchant (1841-1929)", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Willey,_1st_Baron_Barnby", "wikipedia_page": {"main": "Francis Willey, 1st Baron Barnby (27 February 1841 – 16 February 1929) was an English wool merchant.\nWilley was born in Bradford and joined his father's wool business, which later became Francis Willey & Co Ltd and had agencies all over the Dominions and the United States. Willey was also a great horseman, huntsman and racehorse owner. He was created Baron Barnby in the 1922 New Year Honours.Willey was commissioned Sub-Lieutenant in the 2nd West Riding of Yorkshire Artillery Volunteers in December 1874. He was promoted Major in May 1888 and resigned in April 1891.His seat was Blyth Hall, Nottinghamshire. He was appointed High Sheriff of Nottinghamshire for 1908. He was succeeded in the barony by his only son, Vernon.\nHe bought Castle Menzies near Aberfeldy and 11,600 acres of estate in 1918 for £69,000 equivalent to £3,386,000 in 2019). On his death, his widow put the estate up for sale in April 1930.", "link_mentions": [{"page": "Blyth, Nottinghamshire", "response": ["Joshua's son and heir, Henry Frederick Walker (born 1807), was High Sheriff of Nottinghamshire for 1852–53. At the end of the 19th century the hall was bought by Francis Willey, 1st Baron Barnby, a Bradford wool merchant. He was High Sheriff for 1908–09 and was succeeded by his son Vernon Willey, 2nd Baron Barnby, who was the MP for South Bradford."]}, {"page": "Vernon Willey, 2nd Baron Barnby", "response": ["He was the son of Francis Willey, 1st Baron Barnby and was educated at Eton and Magdalen College, Oxford University, (B.A.,1906, M.A.,1908). He succeeded his father as 2nd Baron Barnby in 1929, inheriting the Blyth estate"]}, {"page": "Baron Barnby", "response": ["*Francis Willey, 1st Baron Barnby (1841–1929)"]}, {"page": "Francis Willey", "response": ["#Redirect Francis Willey, 1st Baron Barnby"]}, {"page": "1910 London to Manchester air race", "response": ["Claude Grahame-White was born in 1879 in Hampshire, England.  He was educated at Crondall House School in Farnham, and later at Bedford Grammar School between 1892 and 1896.Obituary, The Old Bedfordian, No.9, April 1960, p.34 Apprenticed to a local engineering firm, he later worked for his uncle Francis Willey, 1st Baron Barnby.  He started his own motor vehicle business in Bradford, before travelling to South Africa to hunt big game.  In 1909, inspired by Blériot's historic cross-channel flight, he went to France to learn how to fly, and by the following January he became one of the first Englishmen to obtain an aviator's certificate.  He also started a flying school at Pau, which he moved to England later that year."]}]}}