{"wiki_id": "http://www.wikidata.org/entity/Q5481900", "itemLabel": "Francis McHugh", "itemDescription": "English county cricketer (1925-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_McHugh", "wikipedia_page": {"main": "Francis Prest McHugh (15 November 1925 – 21 February 2018) was an English first-class cricketer, who played three games for Yorkshire County Cricket Club in 1949, and 92 matches for Gloucestershire from 1952 to 1956.A 6 ft 3 in (1.91 m) right arm fast medium bowler,  he took 276 wickets at an average of 24.84, with a best of 7 for 32 for Gloucestershire against his native county. He took five wickets in an innings fifteen times, and ten wickets in a match on four occasions.\nInitially McHugh was a distinctly fast bowler who came into the Yorkshire team with a major injury to Ron Aspinall who was heading the bowling averages early in 1949. He did modestly and with the presence of Coxon, Trueman and Appleyard, was discarded and did not play even in the Second Eleven in 1950. McHugh then went to Gloucestershire and upon qualifying he quickly found that his accuracy could only become of county standard when he moderated his pace. Consequently, McHugh became with George Lambert the best pace attack Gloucestershire – a county known for half a century for its near-exclusive reliance on spin bowling – had fielded to that point in the twentieth century. In 1954 he took ninety-two wickets for exactly twenty runs each, and in 1955 did almost as well with over seventy-five wickets, whilst in 1956 his average fell further to only nineteen runs a wicket.\nMcHugh's batting was consistently inept.  His average of 2.63 is the lowest by anyone to play more than fifty first-class games. 66 of his 111 innings were scoreless (he was dismissed for a duck 38 times), and he reached double figures on only four occasions. It was probably the liability of his batting that caused Gloucestershire to discard him in favour of David Smith for the 1957 season: McHugh had suffered from illness during 1956, and did not play after June, but had bowled so well in his last-ever game with eleven wickets for 112 runs that he was expected to continue in 1957.", "link_mentions": [{"page": "List of first-class cricket records", "response": ["The lowest career batting average by a player with more than fifty first-class matches is almost certainly 2.63 by Francis McHugh of Yorkshire (three matches) and Gloucestershire (92 matches) between 1949 and 1956.Cricket record lists do not keep records for lowest batting average, but Bailey, Phillip; Thorn, Phillip; and Wynne-Thomas, Peter; The Complete Who’s Who of Cricketers () shows nobody with nearly so low an average McHugh batted in 111 innings for only 179 runs, with only four double figure scores. No other regular first-class cricketer is known to have had a batting average of under 3.00."]}, {"page": "McHugh", "response": ["*Francis McHugh (born 1925), Yorkshire-born Gloucestershire cricketer with the lowest batting average of any regular first-class player"]}, {"page": "Peter Rochford", "response": ["A right-handed tail-end batsman and wicketkeeper, Rochford played for Yorkshire's second eleven in the Minor Counties Championship in 1951 before joining Gloucestershire for 1952. Unable to displace regular wicketkeeper Andy Wilson, who was a far better batsman, he played just two first-class games in 1952 and one in 1953, and made only eight appearances in 1954, when Wilson was 44. In 1955, however, Rochford took over as the regular wicketkeeper, playing in 30 matches and making 60 dismissals, and being awarded his county cap. His batting did not develop, however, and his highest score of the season was just 16 not out. There were a few signs of batting improvement in 1956 when, with 31 not out against Oxford University, Rochford made his highest score, and with Bryan Wells, Sam Cook and Francis McHugh in Gloucestershire's side, Rochford often batted far higher in the order than his batting talent warranted. He again made 60 dismissals in the season. After a few matches in 1957, he lost his place and with both Bobby Etheridge and Barrie Meyer available, he left the Gloucestershire staff at the end of the season. His obituary in Wisden Cricketers' Almanack in 1993 indicates that there was friction between Rochford and the Gloucestershire committee."]}, {"page": "List of Gloucestershire County Cricket Club players", "response": ["* Francis McHugh (1952–1956) : F. P. McHugh"]}, {"page": "Jim Griffiths (cricketer)", "response": ["He is however best remembered not for his bowling but for his inept batting, managing a career average of just over 3 runs per innings, which is the second-lowest by any regular first-class cricketer ahead of Francis McHugh of Yorkshire and Gloucestershire.See Bailey, Phillip; Thorn, Phillip; and Wynne-Thomas, Peter; The Complete Who’s Who of Cricketers () Griffiths was out 51 times in his career without scoring and early in his career played ten consecutive innings without scoring a run,Bailey, Thorn and Wynne-Thomas; The Complete Who’s Who of Cricketers, p. 414 breaking the long-time record of Tom Goddard, Seymour Clark and Brian Boshier.Webber, Roy; The Playfair Book of Cricket Records; p. 317. Published 1951 by Playfair Books.Bailey; Thorn; and Wynne-Thomas; The Complete Who’s Who of Cricketers, p. 120 Griffiths’ batting was considered so inferior that his local club nicknamed him \"the world’s worst batsman\" and \"the wally of the willow\"."]}, {"page": "F.P. McHugh", "response": ["#REDIRECT Francis McHugh"]}]}}