{"wiki_id": "http://www.wikidata.org/entity/Q5480656", "itemLabel": "Francis Cummins", "itemDescription": "English rugby league footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Cummins", "wikipedia_page": {"main": "Francis Cummins (born 12 October 1976) is the former Head Coach of the Widnes Vikings in the Super League and an English professional rugby league coach and former player. He was the head coach of Super League team the Bradford Bulls from September 2012 until July 2014. A Great Britain and England international representative wing, Cummins also played for Ireland at fullback, and played his entire professional career with the Leeds Rhinos, with whom he won the 1999 Challenge Cup Final.", "link_mentions": [{"page": "Dewsbury", "response": ["*Francis Cummins (born 1976) is an English professional rugby league coach and former player. He played for Leeds Rhinos and represented Great Britain, England and Ireland at international level."]}, {"page": "Bradford Bulls", "response": ["Francis Cummins was appointed as head coach of the Bulls in September 2012.", "In 2014, relegation was reintroduced to the Super League with two teams being relegated. Bradford were deducted 6 points for entering administration early on in the season and the Bulls were relegated from the top division of rugby league in Britain for the first time in 40 years. Francis Cummins was sacked around the time of relegation and replaced by James Lowes and won most of their remaining games.", "* 2013–14 Francis Cummins"]}, {"page": "1999 Rugby League Tri-Nations", "response": ["|LW ||5|| Francis Cummins", "|LW ||5|| Francis Cummins"]}, {"page": "History of the Bradford Bulls", "response": ["Francis Cummins was appointed as head coach of the Bulls in September 2012.", "In 2014, relegation was reintroduced to the Super League with two teams being relegated. Bradford were deducted 6 points for entering administration early on in the season and the Bulls were relegated from the top division of rugby league in Britain for the first time in 40 years. Francis Cummins was sacked around the time of relegation and replaced by James Lowes and won most of their remaining games."]}, {"page": "Lee St Hilaire", "response": ["Lee St Hilaire (born 15 February 1967) is an English former professional rugby league footballer who played in the 1980s and 1990s, and coached in the 2000s. He played at club level for the Huddersfield Giants, Castleford Tigers (Heritage № 743), Keighley and the Hunslet Hawks, as a . St Hilaire joined the Bradford Bulls from Wakefield Trinity Wildcats in July 2006, to become assistant coach to Steve McNamara, he had previously coached the reserve team at Huddersfield Giants. He is the brother of Marcus St Hilaire. In July 2010 it was announced that Steve McNamara was to leave Bradford by mutual agreement and Lee is to take charge of the Bradford Bulls for the remainder of the 2010 Super League campaign. He is now assistant coach under Francis CumminsSt Hilaire to stay with Bulls"]}, {"page": "1994 Kangaroo tour of Great Britain and France", "response": ["|LW ||5||Francis Cummins", "|LW ||5|| Francis Cummins"]}, {"page": "St John Fisher Catholic Voluntary Academy", "response": ["*Francis Cummins – rugby player for Leeds Rhinos"]}, {"page": "Matt Diskin", "response": ["Diskin is a product of amateur rugby league club Dewsbury Moor ARLFC and growing up he attended St. John Fisher High School in Dewsbury, as did Francis Cummins and Ryan Sheridan.", "Matt Diskin was put in temporary charge of the Bradford Bulls on 16 June 2014 as a player coach. It was the day following the sacking of head coach Francis Cummins, and assistant Lee St Hilaire. Diskin took charge of Bulls home match against Hull Kingston Rovers where they lost 44–18 the Tuesday after James Lowes was announced as the Bradford Bulls new head coach."]}]}}