{"wiki_id": "http://www.wikidata.org/entity/Q548595", "itemLabel": "James Walsh", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Walsh_(musician)", "wikipedia_page": {"main": "James Milne Walsh (born 10 June 1980) is an English singer, songwriter, guitarist, pianist and frontman of the band Starsailor.\nIn 2009, Walsh began recording his first solo album, working with American songwriter and singer Suzanne Vega, and making his first film collaboration with Powder.\nIncluding his work with Starsailor, he has sold over three million albums globally.", "link_mentions": [{"page": "Starsailor (band)", "response": ["Starsailor are an English post-Britpop band, formed in 2000. Since their formation the band has included guitarist and vocalist James Walsh, drummer Ben Byrne, bassist James Stelfox and keyboardist Barry Westhead. They are best known for their 2003 single \"Silence Is Easy\" which reached number 9 in the UK.", "Despite claiming to be a Wigan band, only one member of Starsailor is actually from the town. Bassist James Stelfox and drummer Ben Byrne had been playing together in Warrington, Cheshire for a number of years. The band members met whilst studying a Music course at Wigan and Leigh College. When their regular singer fell ill, they recruited young Chorley singer and songwriter James Walsh from a school choir. He was influenced by Jeff Buckley and his 1994 album Grace in his singing style.  Comparing it to Oasis' (What's the Story) Morning Glory? album, which Walsh says sums up a unique moment, Grace captures every moment.  ", "right|200px|thumb|James Walsh", "They were opening for the rock legends for the first time in Hamburg. Front man James Walsh told BBC 6 Music: \"We heard on Sunday evening, our agent gave us a frantic call, and asked what we were doing this week, fortunately we had a week off!\"", "Starsailor started to play in various gigs during the months recording their fourth album.  James Walsh also played at several events in 2007, like the SXSW festival in Texas in March 2007, and an acoustic show in London on 12 March. The show is notable for not having a set list; rarities such as the hardly played \"Restless Heart\" was played, due to a request from the front row. In addition to this he played the song \"Tell Me It's Not Over\", the track from the work-in-progress fourth album (early arrivals saw Walsh sound check half the song).", "Lead singer, James Walsh began to work on a solo project at the end of 2009.  On 13 November 2009 it was officially announced by The Lancashire Evening Post that Starsailor was on hold and that James Walsh was concentrating on his solo career.", "The band played the London Astoria on 4 and 8 February 2002. The first date was a concert in aid of Warchild, and also included Travis and Ryan Adams on the bill. The 8th saw the debut of \"Born Again\", which would eventually be released as a single. The concert is notable since the band were joined on stage by two backing singers and a cellist. James Walsh told NME.COM after the show that he thought the gig was \"amazing, something really special\" while bassist James Stelfox said it was \"one of the greatest ever.\" This flirtation with these additional voices and a cello only lasted a brief period of time.", "* James Walsh – guitar and lead vocals"]}, {"page": "Silence Is Easy", "response": ["* James Walsh – vocals, guitar"]}, {"page": "Love Is Here", "response": ["Starsailor were formed in 1996 in Wigan by fellow students James Walsh on vocals and guitar, James Stelfox on bass, and Ben Byrne on drums. They spent four-and-a-half year playing small venues in North West England. After several line-up changes, Barry Westhead was brought in on keyboards at the beginning of 2000. Waksh's brother Andrew worked at a management company and at Heavenly Records, and was impressed with his brother's vocal delivery and songwriting. He booked the band for two shows in London in April 2000, which saw a writing from the NME in attendance. The writer posted a highly positive review for one of the shows, which in turn started a bidding war between record labels. Andrew Walsh began co-managing the band with his boss from Heavenly, Martin Kelly.", "Mark Collen, the managing director of EMI imprint Chrysalis Records, had witnessed one of the shows, and expressed interest only halfway through the opening song of the set. As Heavenly had ties with EMI, Walsh and Kelly were positive in having the band under EMI's direction; in July 2001, the band eventually signed to the company. James Walsh said they picked that label as they \"haven't got anything that sounds like us at all\". The band also signed a publishing deal with EMI Music Publishing, who proceeded to finance the making of a few demos. In January and February 2001, the band toured the UK as part of the NME Carling Awards tour. Due to the high-quality of the demos, and the public's need for product, one of the demos, \"Fever\", was released as a single on 5 February 2001. It had been produced by Mark Aubrey and the band.", "* James Walsh – vocals, guitar"]}, {"page": "On the Outside (Starsailor album)", "response": ["The song \"Jeremiah\" was written about the death of Jeremiah Duggan, James Walsh having heard Duggan's mother talking about it on the radio."]}, {"page": "Novastar", "response": ["Joost Zweegers spent four years creating the next album, titled Inside Outside, which was released by Warner Music in Belgium and The Netherlands on 28 March 2014. It was influenced by many musicians including Richard Ashcroft (The Verve), Pink Floyd, George Harrison, Paul Weller, and Fleetwood Mac. Zweegers worked with songwriters Dean Dyson, Andy Burrows, and James Walsh."]}, {"page": "James Walsh", "response": ["James Walsh may refer to:", "*James Walsh (convict) (born 1833), transported convict, known for prison wall paintings in Western Australia", "*James Walsh (musician) (born 1980), British musician, frontman of the rock band Starsailor", "*James Walsh (Irish priest) (1837–1919), Irish Anglican priest", "*James Walsh (cricketer) (1913–1986), Australian cricketer", "*James Walsh (equestrian) (born 1948), Irish Olympic equestrian", "*James Walsh (hurler) (born 1983), hurler from Ballinakill in Laois", "*James Walsh (swimmer) (born 1986), Philippine swimmer"]}, {"page": "1980 in the United Kingdom", "response": ["** James Walsh, singer-songwriter, guitarist and pianist "]}, {"page": "In the Crossfire", "response": ["Category:Songs written by James Walsh (musician)"]}, {"page": "This Time (Starsailor song)", "response": ["Category:Songs written by James Walsh (musician)"]}, {"page": "Four to the Floor", "response": ["Category:Songs written by James Walsh (musician)"]}, {"page": "Silence Is Easy (song)", "response": ["Category:Songs written by James Walsh (musician)"]}, {"page": "Born Again (Starsailor song)", "response": ["Category:Songs written by James Walsh (musician)"]}, {"page": "Keep Us Together", "response": ["Category:Songs written by James Walsh (musician)"]}, {"page": "All the Plans", "response": ["Initially named All the Plans or Boy in Waiting, the album title was revealed on 16 October 2008. This release is Starsailor's first album with Virgin Records. Starsailor worked with Steve Osborne, who previously worked with the band on their debut album Love Is Here, and with engineer Dan Austin, who was also working with Doves on their fourth studio album Kingdom of Rust at the same time. Most of the information about the release of the album has been taken from the messages written by James Walsh on the band's MySpace page.", "The band recorded the album in Henley-on-Thames, and Richard Warren worked with the band in the studio. It was announced in February 2008 by James Walsh that the album was finished and that the band was mixing the album in a studio in Chiswick called \"The Sofa Lounge.\"Walsh, James. A busy summer schedule ahead Starsailor.net| Starsailor official Message board. Accessed 9 February 2008. They were simultaneously \"putting the finishing touches to a busy summer schedule.\"", "On 21 March 2008, James Walsh wrote: ", "On 13 February 2009, Nigel Goulds from Belfast Telegraph stated, \"The band have served up another collection of heart-tugging tracks which again benefit from James Walsh's – who's based in Belfast much of the time – unique set of vocal cords. There's really nothing new to add to the Starsailor repertoire but when they produce songs of uncluttered grandeur they really are in a league of their own.\"", "On 12 March 2009, The Glaswegian named All the Plans as \"album of the week,\" stating that, \"After their last misfiring album, All the Plans can be seen as something of a comeback. It's also a return to form, as, while the Chorley lads may have lost a little ground, they've not lost their way with emotional, melodic music. The title track, which boasts an appearance from Rolling Stone Ronnie Wood, could be Oasis at their most anthemic, while James Walsh's voice has rarely sounded better than it does on \"Hurts Too Much.\" The real stars of the show are the rootsy \"Stars and Stripes\" and the album's penultimate track \"Listen Up,\" which might be the best song the band ever wrote.\"Albums of the week: Starsailor – All The Plans & The Annie Lennox Collection theglaswegian.co.uk|. Published 12 March 2009 Accessed 15 March 2009.", "However, Mojo wrote a negative review, stating that, \"You try to remember a single melody or hook from the record and you're found wanting\", while James Skinner of Drowned in Sound went as far as to single out the lyrics to 'Change My Mind', stating that \"Starsailor are so wantonly unoriginal, so brazenly mediocre on every level, it's almost like they don’t even realise that they are and totally mean all this stuff.\" Entertainment.ie's review echoed these sentiments, remarking \"If you're looking for any more reasons to dislike Starsailor, you'll find them in abundance on album number four, which is a continuation of the dull pub-rock sound that they've rarely deviated from during their nine-year career.\" Gillian Watson of The Skinny was yet another voice in this chorus, asserting that \"The culprit here is frontman James Walsh, whose banal lyrics and achingly sincere vocals are a wearying and occasionally embarrassing listen.\"", "* Vocals: James Walsh", "* Guitars: James Walsh, Richard Warren, and Ronnie Wood"]}, {"page": "Busan Rock Festival", "response": ["*  James Walsh in Starsailor"]}, {"page": "James Stelfox", "response": ["Stelfox first met Ben Byrne ten years prior to Starsailor forming. They became friends since junior school and they went to Leigh Campus of Wigan and Leigh College, where they finally met Barry Westhead and James Walsh.", "Stelfox and Byrne started playing in the north west of England for a number of years.  After their singer fell ill, James Walsh decided to join them (before, he was on a school choir)."]}, {"page": "Tell Me It's Not Over", "response": ["\"Tell Me It's Not Over\" is the first single released from the 2009 album, All the Plans by the English alternative rock band, Starsailor.  Its release date was announced on 18 October 2008 on their official website 4th album release details; All the Plans - March 2009 , \"Starsailor Message Board\". Accessed December 17, 2008. and later via YouTube by the lead singer James Walsh and Ben Byrne in their official Channel.Walsh, James; Byrne Benjamin. Starsailor exclusive fan message \"Youtube.com\". It peaked # 73 in the UK Single Charts \"The Official UK Top 75 Singles Week of Mon 09 Mar \". Chart Stats. Retrieved on 9 March 2009. and #5 in the Belgium Charts making Tell Me It's Not Over their most successful single in Belgium.", "Prior to the release of All The Plans, \"Tell Me It's Not Over\" has been well received by music critics. Daily Music Guide describes the song as \"one departure from the old favourites, the superb 'Tell Me It's Not Over', a forthcoming release from the eagerly anticipated new album\" Starsailor - The Aftershow, Moho Live (26/09/2008) , \"Daily Music Guide Reviews\". Accessed December 17, 2008. and praised that \"despite not breaking any new ground for the band, will no doubt appease their stock of devoted fans eagerly awaiting the albums release\".Starsailor - Cargo, London (24/11/2008) , \"Daily Music Guide Reviews\". Accessed December 17, 2008.  Monique Oliver from Absolute Radio stated that 'Tell Me It's Not Over' \"goes down well\".Absolute Radio Starsailor article Rich McLaughlin from The Alternate Side compares Starsailor's single with Joseph Arthur's \"In the Sun\".In-Studio with James Walsh (Starsailor), \"The Alternate Side\". Accessed December 17, 2008. ", "The music video for \"Tell Me It's Not Over\" starts with James Walsh and his partner in a parking where she left him.  Both of them (the girl presumably in the couple's home) look in a thoughtful way and seems to be doubting about the decision they have taken. Scenes of the band playing the song and the lights in different buildings being switched off and on harmonically with the song (which could be related to the first lines of the single chorus \"now the lights out i discover...\") are interpolated in the video.  At the end of the video Walsh finally decided to enter to the car.", "On 19 January 2009, when lead singer James Walsh was interviewed by Geoff Lloyd, he admitted that he had recorded a version of the lead single, \"Tell Me It's Not Over\" featuring Brandon Flowers from The Killers.  The song was remixed by Flowers and Stuart Price and has since been leaked onto the internet. Brandon Flowers appears on new Starsailor single \"nme.com\". Accessed February 24, 2009.", "Category:Songs written by James Walsh (musician)"]}, {"page": "Sacha Skarbek", "response": ["Skarbek scored and supervised the music for the award-winning documentary film For No Good Reason, starring Johnny Depp. He also scored and collaborated with James Walsh on the soundtrack music for a film of Chuck Palahniuk's Lullaby.", "|James Walsh", "|James Walsh"]}, {"page": "The Vals", "response": ["The band also celebrated Belfast hosting the 2011 MTV Europe Music Awards by taking part in Belfast Music week where they were joined by Duke Special and James Walsh of Starsailor at the Limelight complex.The Vals Belfast Music Week / MTV Awards Belfast http://metaphoricalboat.blogspot.co.uk/2011/11/caught-live-belfast-calling.html"]}, {"page": "Calling Festival", "response": ["* James Walsh", "* James Walsh"]}, {"page": "All the Plans (song)", "response": ["\"Then I got a call about half-past-six one evening from his son Jesse saying, 'My dad really wants to do this now. Can you be at the studio [at] nine o'clock?' So from having sort of given up the ghost it all came together out of the blue. It was amazing; he stood there playing the guitar, saying the song reminded him of 'Maggie May' - quite high praise, indeed.\" James Walsh.Ronnie Wood plays guitar on new Starsailor album, \"NME\". Accessed April 18, 2009.", "Dave Simpson from The Guardian said that: \"writing about loves lost and lessons learned seems to have given singer/songwriter James Walsh real drive and focus, and Ronnie Wood guests to provide unlikely but perfectly suited Faces-style guitar.\".Starsailor: All The Plans, \"Guardian.co.uk\". Accessed April 18, 2009.", "On 8 June 2009 Altsounds.com gave All the Plans a good review mentioning \"the soft-focus Hammond Organ, delicate percussion and sparse and over-driven guitars (courtesy of Rolling Stones legend Ronnie Wood no less)\", else adding that the song \"it's heady Americana vibe is infectious and front man James Walsh has a truly stellar set of pipes (not exactly up there with either of the Buckley's but impressive all the same)\" Starsailor- All The Plans (single) , \"Altsounds\". Accessed June 14, 2009.", "Category:Songs written by James Walsh (musician)"]}, {"page": "Folk Dranouter", "response": ["*James Walsh"]}, {"page": "Arthur's Day", "response": ["* James Walsh"]}, {"page": "The Night Before (James album)", "response": ["On 30 November 2009, the band announced they would be releasing two mini-albums in 2010, with the first The Night Before planned for released in April 2010. On 16 March 2010, the track listing for the album was revealed. In April 2010, the band embarked on The Mirrorball Tour in the United Kingdom, with support from James Walsh and Unkle Bob. The Night Before was made available for streaming through The Independent website, before being released on 19 April 2010. The iTunes version included \"All My Letters\" as a bonus track. Deciding to release a mini album, Booth reasoned that attention spans were getting shorter, and that with the dominance of iTunes, people weren't listening to full albums any more. To promote the album's release, the band performed a series of radio sessions. The Night Before reached number 20 on the UK album chart. \"All My Letters\" was later included on the career-spanning box set The Gathering Sound (2012)."]}, {"page": "Splendour in Nottingham", "response": ["*LeftLion Courtyard Stage: James Walsh, Marcus Foster, Pete Lawrie, Nadine Shah, Nina Smith, Liam Bailey, Jay Thomas"]}, {"page": "Red Sky July", "response": ["Prior to the band entering the studio to record their debut album, the project was put on standby as McErlaine suffered a brain aneurysm. After his recovery, the band reconvened to record the self-titled album. Throughout 2012 the band raised their profile while 2013 marked a return to the live performance. They embarked on their own UK wide tour while supporting Deacon Blue, James Walsh (Starsailor) and Jools Holland."]}, {"page": "Isle of Wight Festival 2011", "response": ["*James Walsh"]}, {"page": "The Sea (Melanie C album)", "response": ["Chisholm stated that she worked with a lot of new writers and producers for this album, where she tended to work with the same writers for her previous records, notably Adam Argyle, who co-wrote some material for this record. The album was co-written /produced with the likes of Starsailor's James Walsh, Guy Chambers, and Spice/Spiceworld producer Richard Stannard, Andy Chatterley (both of whom have worked with artists such as Kylie Minogue, amongst others). Chisholm also worked with the Swedish Cutfather producing team. The album has acoustic moments, as well as some rock-driven songs and upbeat dance records."]}, {"page": "Letters (Matt Cardle album)", "response": ["Letters is the debut studio album by English singer-songwriter and guitarist Matt Cardle. It was released on 14 October 2011 through Syco Music, Sony Music and Columbia Records. Cardle worked with various songwriters on the album including Eg White and James Walsh. He co-wrote all the tracks except for his X Factor winner's single, \"When We Collide\" and the single \"Run for Your Life\", written by Gary Barlow.", "* \"Amazing\" was released as the album's third official single on 19 February 2012 and peaked at number 84 on the UK Singles chart. The single was released as an EP with an all-new song called \"All Is Said\", written by Cardle, James Walsh and Eliot James, a newly recorded studio version of \"The First Time Ever I Saw Your Face\", and a live version of \"Slowly\" recorded at KOKO in October 2011."]}, {"page": "Isle of Wight Festival 2012", "response": ["*James Walsh", "*James Walsh"]}, {"page": "The Fire (Matt Cardle album)", "response": ["The Fire is the second studio album released by English musician Matt Cardle. The album was released on 26 October 2012, via SO What? Recordings, a subsidiary of Silva Screen Records, alongside the lead single, \"It's Only Love\". The Fire was primarily written by Cardle, but also writing credits from by Eg White, Jack McManus, Jamie Hartman, James Walsh and others.  The album produced a second single, \"Anyone Else\", released on 31 December 2012. Cardle also made a video for the song \"Lately\", although not released as a single.", "Cardle is credited with producing the album, and co-writing nine of the record's ten tracks, alongside Starsailor frontman James Walsh, Eg White, whose previous credits include Adele and Will Young, and Paul Statham, who has written for Dido and Kylie Minogue. Cardle also played the majority of the instruments on the album. He has stated that having complete freedom on the album was important to him, and so he had to be a bit of a \"control freak\". As well as the standard 10 track edition, a deluxe edition was made available, with three extra original tracks and an acoustic version of \"It's Only Love\"."]}, {"page": "Lullaby (James Walsh album)", "response": ["Lullaby is the first solo album from James Walsh, the former lead singer of Starsailor. It was released on September 17, 2012 via iTunes in the UK. UK Release of Lullaby on iTunes] \"Lullaby album on iTunes\". Accessed September 17, 2012.", "The lead single \"Start Again\" featured an accompanying music video, which was directed by Ulf Johansson and features James playing the part of \"Oyster\" and actress Natalie Press as \"Mona\" - characters taken from the script and original Lullaby (novel) book.\"James Walsh releases album inspired by forthcoming film Lullaby\". Accessed August 19, 2012. The song was released as a digital download on July 30, 2012.", "Category:James Walsh (musician) albums"]}, {"page": "List of Stars in Their Eyes episodes", "response": ["| James Walsh of Starsailor"]}, {"page": "The Silver Bullet", "response": ["The venue hosts weekly events Sunday to Wednesday including a Blues Jam on Mondays and a weekly Jazz Jam hosted by Bukky Leo on Tuesdays.   Featured weekend events cover a diverse genre of music, including Reggae, Northern Soul, Hip hop, Grunge, House music and Electronica. During this period The Silver Bullet has hosted live performances from many acts including Laura Marling, John Newman, Electric Pyramid, Mad Professor, James Walsh, Funkdoobiest, Lords of the Underground,   and Jeru The Damaja.   There have also been DJ Sets from Rudimental, The Herbaliser, Don Letts, Paul Hartnoll of Orbital, DJ Derek and Fabio."]}, {"page": "Eirias Stadium", "response": ["| James Walsh, Sally Barker, Loveable Rogues, The Vamps."]}, {"page": "Michael Brun", "response": ["|Eddie Thoneick and Abel Ramos featuring James Walsh "]}, {"page": "Good Souls: The Greatest Hits", "response": ["* James Walsh – lead vocals, guitar"]}]}}