{"wiki_id": "http://www.wikidata.org/entity/Q54827679", "itemLabel": "Jack Gordon", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Gordon_(actor)", "wikipedia_page": {"main": "Jack Gordon (born 27 June 1985) is an English actor. He is best known for roles such as Sean in Elaine Constantine's Northern Soul (film), Ronnie Biggs in the BBC One tv-series The Great Train Robbery (2013 TV series) and Peter Foley in BBC The Crimson Field. On the stage, he gained acclaim for his role as \"man\" in Philip Ridley's Tender Napalm and Giovanni in Cheek by Jowl's 'Tis Pity She's a Whore.", "link_mentions": [{"page": "Ronnie Biggs", "response": ["On 18 December 2013, aged 84, Biggs died at the Carlton Court Care Home in Barnet, north London, where he was being cared for. His death coincidentally occurred hours before the first broadcast of a two-part BBC television series The Great Train Robbery, in which Biggs was portrayed by actor Jack Gordon. Biggs's body was cremated at Golders Green Crematorium on 3 January 2014. The coffin was covered with the Union Flag, the flag of Brazil and a Charlton Athletic scarf. An honour guard of British Hells Angels escorted his hearse to the crematorium. The Reverend Dave Tomlinson officiated at Biggs's funeral, for which he drew public criticism; Tomlinson responded to critics by using the Bible verse \"Judge not, that ye be not judged\"."]}, {"page": "Screen International", "response": ["* Jack Gordon"]}, {"page": "List of EastEnders characters (2008)", "response": ["Paul, played by Jack Gordon, is a barman who Ronnie Mitchell (Samantha Womack) employed to help run R&R for a Christmas Party. He made various appearances, between December 2008, and his last being on 9 March 2009."]}, {"page": "Jack Gordon", "response": ["Jack Gordon may refer to:", "*Jack Gordon (entertainment manager) (1939–2005), American former manager and husband of singer La Toya Jackson", "*Jack Gordon (ice hockey) (born 1928), Canadian ice hockey coach", "*Jack Gordon (footballer, born 1863) (1861–1941), Scottish footballer (Preston North End)", "*Jack Gordon (footballer, born 1899) (1899–1964), Scottish footballer (Port Vale, Luton Town)", "*Jack Gordon (Mississippi politician) (1944–2011), American politician in Mississippi", "*Jack Gordon (Peter Worthington) (1822–1864), American renegade, soldier, and outlaw (also known as \"Apache Jack\" Gordon)", "*Jack Gordon (actor), English actor"]}, {"page": "Wrong Turn 3: Left for Dead", "response": ["* Jack Gordon as Trey King"]}, {"page": "Panic Button (2011 film)", "response": ["Four young people win the  competition of a lifetime; Jo (Scarlett Alice Johnson), Max (Jack Gordon), Gwen (Elen Rhys) and Dave (Michael Jibson) head off on an all expenses paid trip to New York, courtesy of the social network All2gethr.com. As they board the private jet, they are asked to relinquish their mobile phones and take part in the in-flight entertainment – a new online gaming experience. An animated alligator on-screen asks them a series of personal questions that they are supposed to answer truthfully. The alligator then reveals the embarrassing lies they have told.", "*Jack Gordon as Max"]}, {"page": "The Great Train Robbery (2013 TV series)", "response": ["* Jack Gordon as Ronnie Biggs"]}, {"page": "List of British films of 2019", "response": ["|| Director: Anthony Woodley  Cast: Lena Headey, Ivanno Jeremiah, Mandip Gill, Jack Gordon, Peter Singh, Arsher Ali, Iain Glen "]}, {"page": "Truth or Dare (2012 film)", "response": ["Truth or Dare (released in the United States as Truth or Die) is a 2012 British psychological horror film directed by Robert Heath and written by Matthew McGuchan. The film stars David Oakes, Tom Kane, Jennie Jacques, Liam Boyle, Jack Gordon, Florence Hall and Alexander Vlahos. It made 2.5 million at the box office  against its budget of 1 million.", "The film opens at an end-of-term Halloween house party, where a quiet guy named Felix (Tom Kane) enters, alone. A group of friends is there too, including Chris (Jack Gordon), a spoilt brat, with his mild-mannered girlfriend, Gemma (Florence Hall), his friend Paul (Liam Boyle), with his girlfriend, the abrasive Eleanor (Jennie Jacques), and his drug-dealer friend, Luke (Alexander Vlahos).", "* Jack Gordon as Chris"]}, {"page": "The Flood (2019 film)", "response": ["The Flood is a 2019 British drama film, directed by Anthony Woodley, from a screenplay by Helen Kingston. It stars Lena Headey, Ivanno Jeremiah, Mandip Gill, Jack Gordon, Peter Singh, Arsher Ali and Iain Glen. It was released on 21 June 2019, by Curzon Artificial Eye.", "* Jack Gordon as Russell", "In March 2017, it was announced Lena Headey had joined the cast of the film, with Anthony Woodley directing from a screenplay by Helen Kingston. Headey will also serve as an executive producer on the film, while Megatopia Films will produce the film. In April 2017, Ivanno Jeremiah, Iain Glen and Jack Gordon had joined the cast of the film."]}]}}