{"wiki_id": "http://www.wikidata.org/entity/Q5488391", "itemLabel": "Frank Medlicott", "itemDescription": "British politician (1903-1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Medlicott", "wikipedia_page": {"main": "Brigadier Sir Frank Medlicott CBE (10 November 1903 – 9 January 1972) was a National Liberal Party and later Liberal Party politician in the United Kingdom.\nHe first stood for parliament as a Liberal, contesting Acton in 1929.\nHe was elected as a National Liberal Member of Parliament (MP) for East Norfolk at a by-election in 1939 after the National Liberal MP Viscount Elmley had succeeded to the peerage as the 8th Earl Beauchamp.\nAfter the Woolton-Teviot agreement in 1947, The National Liberals and Conservative Party merged local party associations and fielded joint candidates. Many candidates, including Medlicott, described themselves as \"Conservative and National Liberal\", or other permutations of the two names.\nWhen the East Norfolk constituency was abolished for the 1950 general election, Medlicott was elected as Conservative and National Liberal MP for Central Norfolk. In November 1956 Medlicott was a firm opponent of the Eden government's decision to invade the Suez canal zone, but his stance was not supported by the Central Norfolk Conservative and National Liberal Association which passed a resolution dissociating themselves from the views of their MP.\nOn 1 May 1957 Medlicott announced that he would not contest the next election, writing to the association to tell them that he rejected their view that the Member of Parliament should do what party leaders tell him. In November 1957, Medlicott resigned the Conservative whip. He was invited to be the Liberal Party candidate for the constituency but declined, and in November 1958 he applied to receive the Conservative whip again (which was granted). Medlicott duly retired from the House of Commons at the 1959 election. He re-joined the Liberal Party, however, he did not stand again for election. From 1969 he served as the Liberal Party's National Treasurer.", "link_mentions": [{"page": "List of MPs elected in the 1945 United Kingdom general election", "response": ["|Frank Medlicott"]}, {"page": "List of MPs elected in the 1950 United Kingdom general election", "response": ["|Frank Medlicott"]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|Brig. Frank Medlicott"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| Frank Medlicott"]}, {"page": "List of United Kingdom by-elections (1931–1950)", "response": ["|Frank Medlicott"]}, {"page": "List of National Liberal Party (UK, 1931) MPs", "response": ["|rowspan=2| Frank Medlicott"]}, {"page": "Central Norfolk (UK Parliament constituency)", "response": ["| Frank Medlicott"]}, {"page": "East Norfolk (UK Parliament constituency)", "response": ["| Frank Medlicott", "*Liberal National: Frank Medlicott"]}, {"page": "Richard Collard", "response": ["On leaving the RAF, Collard joined the Handley Page Aircraft Company, and became a Director in May 1958. He also became involved in politics, and in November 1957 he was chosen to follow Brigadier Sir Frank Medlicott as Conservative Party candidate for Central Norfolk for the next general election; Medlicott was in dispute with his Association over the Suez crisis, and had resigned the Conservative whip. At the 1959 general election, Collard found himself in an energetic contest with the Liberal candidate, Maxwell Goode; however, Collard won with an increased majority of nearly 7,000 and Goode came third."]}, {"page": "1939 East Norfolk by-election", "response": ["Only two candidates contested the by-election: Frank Medlicott for the National Liberals, and Norman Tillett for the Labour Party. Medlicott was a 36-year-old London solicitor who had not contested an election since standing for the Liberal party at Acton in 1929. Tillett was a Norwich solicitor, whose great-grandfather and uncle were both Liberal MPs for Norwich. Tillett had fought the seat at the last General Election."]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Frank Medlicott"]}, {"page": "Medlicott", "response": ["* Brig. Frank Medlicott (1903–1972), U.K. politician"]}, {"page": "List of elected British politicians who have changed party affiliation", "response": ["|Frank Medlicott"]}, {"page": "1955 New Year Honours", "response": ["*Brigadier Frank Medlicott, , Member of Parliament for East Norfolk, 1939–1950, and for Central Norfolk since 1950. For political and public services."]}, {"page": "Philip Jebb", "response": ["Jebb came forward as a last-minute Liberal candidate for the new Central division of Norfolk at the 1950 General Election. The seat included much of the old Norfolk East constituency which had been represented by the former Liberal, Frank Medlicott, who had not been opposed by an official Liberal candidate before.  Jebb was defeated into third place and did not stand for parliament again.British parliamentary election results 1950-1973, Craig, F.W.S."]}]}}