{"wiki_id": "http://www.wikidata.org/entity/Q5481678", "itemLabel": "Francis Lane Fox", "itemDescription": "British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Lane_Fox", "wikipedia_page": {"main": "Lieutenant-Colonel Francis Gordon Ward Lane Fox (formerly Jackson), (14 October 1899 – 31 July 1989) was a British Army officer and prominent Yorkshire landowner.", "link_mentions": [{"page": "George Lane-Fox, 1st Baron Bingley", "response": ["* Hon Marcia Agnes Mary Lane Fox, b 4 September 1904. In 1929 she married Francis Gordon Ward Jackson, who took the name Lane Fox by deed poll. As Lt-Col Francis Lane Fox he served in World War II and later became Honorary Colonel of the Yorkshire Hussars. On the death of Lord Bingley, Lt-Col 'Joe' and the Hon Marcia Lane Fox took over the running of the Bramham Park estate."]}, {"page": "Yorkshire Hussars", "response": ["* Lt-Col Francis Lane Fox, 1945–1946"]}, {"page": "Fox (surname)", "response": ["* Francis Lane Fox (1899–1989), British Army officer and Yorkshire landowner"]}, {"page": "Ivor Thomas (British Army officer)", "response": ["After years of training under Thomas's command, the 43rd Division landed in Normandy in mid-June 1944, but was not immediately involved in any major engagements. However, casualties had already been sustained, by the 43rd (Wessex) Reconnaissance Regiment, commanded by Lieutenant Colonel Francis Lane Fox−who \"Von Thoma\" later sacked−which suffered severe losses before it even landed in Normandy. On 24 June, the 43rd Division was reassigned from Ritchie's XII Corps to Lieutenant General Sir Richard O'Connor's VIII Corps and, days later, took part in Operation Epsom, in an attempt to capture Caen, which, although a D-Day objective for the 3rd Division, still remained in enemy hands.Mead, p. 334 The division only played a relatively minor role in the operation but played a major role in Operation Jupiter, the British attempt to capture Hill 112. The operation, which commenced on 10 July and ended the following day, was ultimately a British victory, but cost Thomas's division, along with the armoured support in the shape of Brigadier Michael Carver's 4th Armoured Brigade, almost 2,000 casualties. Carver later described Thomas as \"a small, fiery, very determined and grim gunner, without a spark of humour, he would bite the head off anyone who attempted to disagree with him or question his orders\"."]}, {"page": "Francis Fox (disambiguation)", "response": ["*Francis Lane Fox (1899–1989), British Army officer and Yorkshire landowner"]}, {"page": "MV Derrycunihy (1943)", "response": ["When all the survivors had been taken off, Captain Richardson of the Derrycunihy and the commanding officer of 43 Recce, Lieutenant-colonel Francis Lane Fox, argued over who should be last to leave the half-sunken ship.McKee, p. 151."]}]}}