{"wiki_id": "http://www.wikidata.org/entity/Q5481119", "itemLabel": "Francis Graham Brown", "itemDescription": "Bishop of Jerusalem; British Anglican bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Graham_Brown", "wikipedia_page": {"main": "George Francis Graham-Brown  (27 January 1891 – 23 November 1942) was an Anglican bishop in the second quarter of the 20th century.", "link_mentions": [{"page": "Wycliffe Hall, Oxford", "response": ["*Francis Graham Brown, 1925–1932 (subsequently sixth Anglican Bishop of Jerusalem 1932–1942)"]}, {"page": "Monkton Combe School", "response": ["* The Right Revd Francis Graham Brown, OBE, DD, 1891-1942, Principal of Wycliffe Hall, Oxford and Bishop of Jerusalem"]}, {"page": "Anglican Diocese of Jerusalem", "response": ["*1932–1942: Francis Graham Brown"]}, {"page": "Francis Brown", "response": ["*Francis Graham Brown (1891–1942), Anglican bishop"]}, {"page": "George Francis Graham Brown", "response": ["#REDIRECT Francis Graham Brown"]}, {"page": "Weston Stewart", "response": ["In 1943 he was appointed the seventh Anglican Bishop in JerusalemWebsite of The Episcopal Diocese of Jerusalem and Dean of the Collegiate Church of St George the Martyr in Jerusalem following the sudden death of Francis Graham Brown in a car accident in November 1942.Collegiate Church of St. George the Martyr (Jerusalem), 'Order of Service for the Enthronement of Weston Henry Stewart as Bishop of the Church of England in Jerusalem and His Installation as Dean of the Collegiate Church - November 8th, 1943' Beyt-ul-Makdes Press (1943) Because of World War II he found it difficult to travel to London for his consecration by William Temple, Archbishop of Canterbury, on St Matthew's Day 1943 (21 September), at Westminster Abbey. He laid the cornerstone of the Church of the Redeemer, Amman in 1949. In 1952, assisted by the former diplomat Stewart Perowne, he was involved in designing and organising model villages for Palestinian Arabs who had been made refugees as a result of the 1948 Arab–Israeli War. On 16 November 1956 Stewart consecrated and dedicated the newly built St Paul's Anglican Church in Kuwait.Website of St Paul's Anglican Church in Kuwait"]}, {"page": "Julian Thornton-Duesbery", "response": ["From 1928 to 1933, Thornton-Duesbery was a fellow and the librarian of Corpus Christi College, Oxford; this was in addition to his chaplaincy to the college and leadership role at Wycliffe Hall. In July 1933, he left his university focused life to enter the world of schooling. He was invited by Francis Graham Brown, the Anglican Bishop in Jerusalem, to become the Headmaster of St. George's School, an Anglican boys school in Jerusalem."]}]}}