{"wiki_id": "http://www.wikidata.org/entity/Q5480554", "itemLabel": "Francis Close", "itemDescription": "English priest", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Close", "wikipedia_page": {"main": "Francis Close (11 July 1797 – 18 December 1882) was the Anglican rector of Cheltenham (1826–1856) and Dean of Carlisle (1856–1881).", "link_mentions": [{"page": "1797", "response": ["* July 11 – Francis Close, Anglican rector of Cheltenham (1826–1856) and Dean of Carlisle (1856–1881) (d. 1882)"]}, {"page": "Frederick Denison Maurice", "response": ["Dean Francis Close wrote a monograph about the proceedings of the royal commission. The issue was whether earlier acts legalising and policing prostitution for the armed forces should be repealed. Close quoted a commission member's speech to the House of Commons that praised Maurice as a \"model Royal Commissioner\". Close ended his monograph with these words: \"Professor Maurice remained firmly and conscientiously opposed to the Acts to the very last.\""]}, {"page": "University of Gloucestershire", "response": ["The University of Gloucestershire is a public university based in Gloucestershire, England. It is located over three campuses, two in Cheltenham and one in Gloucester, namely Francis Close Hall, The Park, Oxstalls and The Centre for Art and Photography being near to Francis Close Hall. In March 2021 the University purchased the former Debenhams store in Gloucester City Centre, wth a new campus due to open there in 2023. ", "The university is the recent successor of a large number of merged, name-changed and reformed institutions of further and higher education. Its history spans nearly two centuries. It originates from the merger of two distinct strands of educational provision in Gloucestershire being that provided by Local Government and that founded by the Anglican Church. The university traces its earliest Civic history to the Cheltenham Mechanics' Institute in 1834, and to the Cheltenham Training College in its Church history, established in 1847, by the Reverend Francis Close. Cheltenham and Gloucester College of Higher Education was created in 1990 from the two distinct strands.  In October 2001, the college was awarded University status.", "===Francis Close Hall===", "thumb|right|Main Entrance to Francis Close Hall Campus", "thumb|right|Chapel at Francis Close Hall Campus", "Francis Close Hall site includes restored historic buildings close to Cheltenham's town centre. The campus can trace its history back to the Cheltenham Training College founded by the Revd. Francis Close in 1847.", "The Hardwick Centre for Fashion, Art and Photography opened in 2011 and is in close proximity to Francis Close Hall. The purpose built studios cater for students studying a mixture of creative subjects including its Fine Art (undergraduate and postgraduate), Photography and Fashion degrees. There is a Gallery for public exhibitions. It has recently been renamed as The Centre for Fashion, Art and Photography."]}, {"page": "Dean Close School", "response": ["The school, originally \"The Dean Close Memorial School\", was founded in 1886 (79th of the 103 Victorian public schools in order of foundation) and named after the Very Reverend Francis Close, Dean of Carlisle Cathedral. Alumni include the poet James Elroy Flecker, whose father was the School's first headmaster (the old Flecker Hall was named after him), and the artist Francis Bacon."]}, {"page": "1797 in Great Britain", "response": ["* 11 July – Francis Close, rector of Cheltenham (1826–1856) and Dean of Carlisle (1856–1881) (died 1882)"]}, {"page": "Trinity Cheltenham", "response": ["Trinity Church came into being in 1824 as an overflow from the Parish Church in the town centre. The first minister was the Rev Francis Close, Rector of Cheltenham and later Dean of Carlisle Cathedral, after whom the Dean Close School was named. The Church was opened with an address from the Rev Charles Simeon."]}, {"page": "1882 in the United Kingdom", "response": ["* 18 December – Francis Close, Anglican priest, rector of Cheltenham and Dean of Carlisle (born 1797)"]}, {"page": "Cheltenham Minster, St Mary's", "response": ["Its most famous incumbent (perpetual curate) was Francis Close, a keen Evangelical, who was a follower of Charles Simeon. Close was the perpetual curate of the church for thirty years and a founder of two teacher training colleges which later became the University of Gloucestershire. He moved on to become Dean of Carlisle in 1856."]}, {"page": "Dean of Carlisle", "response": ["*1856–1881 Francis Close"]}]}}