{"wiki_id": "http://www.wikidata.org/entity/Q5481135", "itemLabel": "Francis Green", "itemDescription": "English footballer (born 1980)", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Green_(footballer)", "wikipedia_page": {"main": "Francis James Green (born 23 April 1980) is an English former professional footballer and sports co-commentator who works for BBC Radio Cambridgeshire.\nAs a player he was a striker who played from 1998 to 2013 notably in the Football League for Peterborough United and Lincoln City. He also played professionally for Boston United, Macclesfield Town and Oxford United. He played in Non-League for Kettering Town, Brackley Town, Hucknall Town, Eastwood Town, Ilkeston, Spalding United, Corby Town and Basford United.", "link_mentions": [{"page": "Keith Alexander (footballer)", "response": ["Despite their poor start to the season, Lincoln's campaign improved. Veteran Stuart Bimson had moved on, to Cambridge United, and youngster Paul Mayo was sold to Watford for an initial £75,000, but the acquisitions of Jamie McCombe, Marcus Richardson, Gary Taylor-Fletcher, Francis Green and loanee Kevin Ellison meant that they finished in the play-off places. Lincoln were beaten by Huddersfield Town in the semi-finals."]}, {"page": "Steve Evans (footballer, born 1962)", "response": ["On 5 May 2007 Boston faced Wrexham in a win or bust situation, and things were looking good for the team when Francis Green opened the scoring for Evans' outfit, who lead 1–0 at half-time, but in the second half United conceded a penalty kick, which Wrexham defender Ryan Valentine converted, and so was the goal that sent Boston down. Two late goals from Chris Llewellyn and Michael Proctor rubber-stamped Wrexham's survival and saw Boston lose 3–1. On 8 May 2007, Evans pledged his commitment to the club despite their relegation and return to non-League football. However, on 27 May, Evans and his assistant manager Paul Raynor resigned from Boston with immediate effect. Evans' two occasions as manager combined at Boston made him the club's second longest serving manager behind Fred Tunstall, who had three occasions as manager of the club in the 1930s, 40s and 50s. He managed the team on 354 occasions, which resulted in 145 wins, 99 draws and 110 losses."]}, {"page": "2009–10 Oxford United F.C. season", "response": ["This was followed, at the start of November, by progress into the second round of the FA Cup after taking the League scalp of Yeovil Town 1–0. United then fell to only their second defeat of the season, losing 3–1 at Kidderminster. Oxford bounced back with 1–0 wins at home against Barrow, and away at Forest Green Rovers.. Strikers Francis Green and Onome Sodje were brought in on loan to cover for the slight shortages in strikers. Neither loanee featured in Oxford's 1–1 home draw against Barrow in the FA Cup,. which meant a replay at Holker Street, the third fixture between the two sides in as many weeks.", "|align=\"left\"|19||align=\"left\"|FW||align=\"left\"|Francis Green", "| 4 January 2010 || Francis Green || Kettering Town||align=\"center\"| Undisc ||align=\"center\"|", "| 20 May 2010 || Francis Green || Released||align=\"center\"| Free ||align=\"center\"|", "| 24 November 2009 || Francis Green|| Kettering Town||align=\"center\"|N/A||align=\"center\"|"]}, {"page": "2005 Football League Two play-off Final", "response": ["The match kicked off around 3p.m. on 28 May 2005 at the Millennium Stadium in Cardiff in front of 19,653 spectators.   The match was an even affair during the first half: early on, Francis Green's header for Lincoln was off-target, and the team then saw a goal from Yeo ruled out.  Southend had two goal-bound chances cleared as the Lincoln goalkeeper Alan Marriott saved shots from both Carl Pettefer and Mark Bentley.  Southend dominated the second half, with Eastwood creating the best chance in the 56th minute but falling over the ball with only Marriott to beat from around .  Green then blocked a shot from Southend's Che Wilson before Bentley was denied a penalty after Paul Morgan appeared to foul him. Regular time ended goalless, sending the match into extra time.  Jamie Jackson, writing in The Observer, described the first 90 minutes of the match as \"tepid, uninventive fare\".   The first goal was scored just before half-time in the first period of extra time.  Spencer Prior flicked on Nicolau's corner and Eastwood struck Matt Bloomer's clearance into the Lincoln goal to make it 1–0.  With ten minutes of extra time remaining, Eastwood ran at the Lincoln defence and passed the ball square to Duncan Jupp who scored his first league goal in a decade to give Southend a 2–0 lead. With no further additions to the scoreline, the match ended 2–0 and Southend secured promotion to League One.", "|FW ||30||Francis Green || || "]}, {"page": "Francis Green", "response": ["Francis Green may refer to:", "* Francis Green (footballer) (born 1980), English football striker"]}, {"page": "2000 Football League Third Division play-off Final", "response": ["|FW ||14||Francis Green || || "]}, {"page": "1999–2000 Peterborough United F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Francis Green"]}, {"page": "List of Macclesfield Town F.C. seasons", "response": ["| Francis Green"]}, {"page": "2000–01 Peterborough United F.C. season", "response": ["|align=\"left\"|14||align=\"left\"|FW||align=\"left\"| Francis Green"]}]}}