{"wiki_id": "http://www.wikidata.org/entity/Q5482019", "itemLabel": "Francis Needham, 4th Earl of Kilmorey", "itemDescription": "Anglo-Irish peer", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Needham,_4th_Earl_of_Kilmorey", "wikipedia_page": {"main": "Captain Francis Charles Adelbert Henry Needham, 4th Earl of Kilmorey   (26 November 1883 – 11 January 1961), styled Viscount Newry until 1915, was a Royal Navy officer and Anglo-Irish peer.In 1916 he was appointed as an Irish representative peer, to sit in the House of Lords for life representing Ireland. No more such peers were appointed after the independence of the Irish Free State in 1922, and when Kilmorey died in 1961 he was the last survivor.", "link_mentions": [{"page": "Peerage of Ireland", "response": ["When one of the Irish representative peers died, the Irish Peerage met to elect his replacement; but the office required to arrange this were abolished as part of the creation of the Irish Free State. The existing representative peers kept their seats in the House of Lords, but they have not been replaced. Since the death of Francis Needham, 4th Earl of Kilmorey in 1961, none remains. The right of the Irish Peerage to elect representatives was abolished by the Statute Law (Repeals) Act 1971."]}, {"page": "Peerage of the United Kingdom", "response": ["Peers in the Peerage of Scotland and Peerage of Ireland did not have an automatic seat in the House of Lords following the Acts of Union of 1707 and 1800, though the law permitted a limited number to be elected by their fellows to serve in the House of Lords as representative peers. Some peerages of the United Kingdom were created to get around this obstacle and allow certain Scottish and Irish peers to enjoy the automatic right to sit in the House of Lords.The Peerage Act 1963 gave Scottish Peers an automatic right to sit in the Lords.Malcomson 2000 p.312; Following the establishment of the Irish Free State in December 1922, Irish peers ceased to elect representatives, although those already elected continued to have the right to serve for life; the last of the temporal peers, Francis Needham, 4th Earl of Kilmorey, by chance a peer from an Ulster family, died in 1961."]}, {"page": "Representative peer", "response": ["Following the establishment of the Irish Free State in December 1922, Irish peers ceased to elect representatives, although those already elected continued to have the right to serve for life; the last of the temporal peers, Francis Needham, 4th Earl of Kilmorey, by chance a peer from an Ulster family, died in 1961. Disputes had arisen long before as to whether Irish representative peers could still be elected. The main Irish Free State Constitution Act 1922 was silent on the matter, to some seeming to mean that the right had not been abolished, but the ancillary Irish Free State (Consequential Provisions) Act 1922 had abolished the office of Lord Chancellor of Ireland, whose involvement was required in the election process. The Irish Free State abolished the office of Clerk of the Crown and Hanaper in 1926, the last holder becoming Master of the High Court.; Committee For Privileges 1966 p.xl s.6 After 1922 various Irish peers petitioned the House of Lords for a restoration of their right to elect representatives. In 1962, the Joint Committee on House of Lords Reform again rejected such requests. In the next year, when the Peerage Act 1963 (which, among other things, gave all peers in the Peerage of Scotland the right to sit in the House of Lords) was being considered, an amendment similarly to allow Irish peers all to be summoned was defeated, by ninety votes to eight. Instead, the new Act confirmed the right of all Irish peers to stand for election to the House of Commons and to vote at parliamentary elections, which were rights they had always had."]}, {"page": "Governor of Northern Ireland", "response": ["Francis Needham, 4th Earl of Kilmorey.The Belfast Gazette No. 1265 p.217 "]}, {"page": "List of Irish representative peers", "response": ["|Francis Needham, 4th Earl of Kilmorey||14 February 1916||John Massy, 6th Baron Massy||11 January 1961", "|Francis Needham, 4th Earl of Kilmorey"]}, {"page": "Peerage law", "response": ["Ireland had, from 1801, the right to send twenty-eight representative peers to the House of Lords. In 1922, with the foundation of the Irish Free State, such elections ceased, but any individuals already elected were allowed to stay in the House of Lords. The last surviving Irish representative peer, Francis Needham, 4th Earl of Kilmorey, died in 1961. In 1965, Randal McDonnell, 8th Earl of Antrim, along with some other Irish peers, petitioned the House of Lords to recognise their right to elect representatives, the matter being sent to the Committee for Privileges."]}, {"page": "Francis Charles Adelbert Henry Needham, 4th Earl of Kilmorey", "response": ["#REDIRECT Francis Needham, 4th Earl of Kilmorey"]}, {"page": "Francis Charles Adelbert Needham, 4th Earl of Kilmorey", "response": ["#REDIRECT Francis Needham, 4th Earl of Kilmorey"]}, {"page": "By-elections to the House of Lords", "response": ["Also, from the 1801 Act of Union to Irish independence, 28 representative peers were elected from and by the Peerage of Ireland to sit in the British House of Lords. Like current hereditary peers, these representative peers sat for life terms and deceased peers were replaced in by-elections. Unlike modern hereditary peer by-elections, all peers in the Peerage of Ireland, even those who did not sit in the House of Lords, were entitled to vote. Upon the creation of the Irish Free State, the officers required to officiate these by-elections were abolished and thus no more were held, but those peers already elected kept their seats for the remainder of their lives. The last to sit in the Lords was Francis Needham, 4th Earl of Kilmorey, who died in 1961."]}, {"page": "List of vice-admirals of Ulster", "response": ["* 1937–1961 Francis Needham, 4th Earl of Kilmorey "]}]}}