{"wiki_id": "http://www.wikidata.org/entity/Q5488899", "itemLabel": "Frank Parry", "itemDescription": "English footballer (1898-1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Parry", "wikipedia_page": {"main": "Frank Thomas Parry (14 June 1898 – 13 March 1973) was an English professional footballer who played as an outside forward. Born in Aigburth, Liverpool, he began his playing career with Everton and made 12 league appearances for the club, making his debut in the 1–2 defeat to Manchester City on 26 December 1922. During his time at Goodison Park, he was never able to replace Sam Chedgzoy as the club's first choice right-winger, and in June 1926 he joined Football League Second Division side Grimsby Town. However, despite being described as \"a skilful and polished winger\", Parry again struggled to break into the first team and played just one league match in the 1926–27 season.\nIn the summer of 1927, Parry moved to Third Division North outfit Accrington Stanley and immediately found himself more involved in senior football. In just over two years with the Peel Park club, he made 81 league appearances and scored 10 goals. His form for Accrington attracted the attention of other clubs, and three months into the 1929–30 season Parry was signed by Nelson as a replacement for Gerry Kelly, who had joined Huddersfield Town. He made his debut for the club on 9 November 1929 in the goalless draw at home to Lincoln City. He retained the right wing berth for the majority of the season, missing only four matches. Parry scored his first league goal for Nelson in the 2–2 draw with Carlisle United on 25 December 1929 at Seedhill, and also netted in the return fixture at Brunton Park the following month. He left Nelson in May 1930 and subsequently moved into non-League football, signing for Felling Stanley, his last senior club, in September of the same year.\nParry was the son of Maurice Parry, who played for Liverpool and represented the Wales national football team on 14 occasions. His uncle, Tom Parry, was also a professional footballer who played for Wales and Oswestry United. Frank Parry died in Southport, Lancashire, on 13 March 1973 at the age of 74.", "link_mentions": {}}}