{"wiki_id": "http://www.wikidata.org/entity/Q5487384", "itemLabel": "Frank Hyde", "itemDescription": "British artist (1849-1937)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Hyde_(painter)", "wikipedia_page": {"main": "Frank Hyde (1849–1937) was a British portrait and figure painter. He was a war artist and portrait painter, best known for his works of Capri. He also created comic characters for greeting cards for Raphael Tuck.", "link_mentions": [{"page": "Capri", "response": ["John Singer Sargent and Frank Hyde are among the prominent artists who stayed on the island around the late 1870s. Sargent is known for his series of portraits featuring local model Rosina Ferrara. The English artist and adventurer, John Wood Shortridge, acquired a fortino at Marina Piccola in the 1880s, (later transformed into a private villa by Dame Gracie Fields) and married a Capri girl, Carmela Esposito. He formed a close friendship with the English novelist George Gissing who provides a colourful and insightful account of his stays with Shortridge in his Published Letters of George Gissing. In the Gissing Journal, vol. XXXV, no. 3 (July, 1999), p. 2. it is recorded that the only mention of him in a recent book, albeit partially inaccurate, occurs in James Money's Capri: Island of Pleasure (London: Hamish Hamilton, 1986, p. 42). Claude Debussy refers to the island's hills in the title of his impressionistic prélude Les collines d'Anacapri (1910). Capri is the setting for \"The Lotus Eater\" (1945), a short story by Somerset Maugham. In the story, the protagonist from Hendon, part of the borough of Barnet in London, comes to Capri on a holiday and is so enchanted by the place he gives up his job and decides to spend the rest of his life in leisure there. British novelist Compton Mackenzie lived there from 1913 to 1920, with later visits, and set some of his work on the island (e.g. Vestal Fire, 1927)."]}, {"page": "Rosina Ferrara", "response": ["Rosina Ferrara (1861–1934) was an artist's model from the island of Capri, who became the favorite muse of American expatriate artist John Singer Sargent. Captivated by her exotic beauty, a variety of 19th-century artists, including Charles Sprague Pearce, Frank Hyde, and George Randolph Barse, made works of art of her. Ferrara was featured in the 2003 art exhibit \"Sargent's Women\" at New York City's Adelson Galleries, as well as in the book Sargent's Women published that year.", "Beginning in the 1870s, she modeled for European and American artists, including British artist Frank Hyde, who had a studio in the former Santa Teresa monastery.", "John Singer Sargent came to Anacapri in the summer of 1878, as had other of his friends who were artists. While there, he met and became a friend of Frank Hyde and worked in his studio. Taken by Ferrara's beauty, he made twelve paintings of her over one year, including A Capriote, Head of an Anacapri Girl, and Capri Girl on a Rooftop.", "*Rosina by Frank Hyde (1880) - Private collection"]}, {"page": "Frank Hyde", "response": ["Frank Hyde MBE OAM (7 February 1916 – 24 September 2007) was an Australian rugby league footballer, coach and radio caller. A New South Wales representative three-quarter, Hyde played his club football in Sydney for NSWRFL Premiership clubs Newtown, Balmain (with whom he won the 1939 Premiership) and North Sydney. Following his playing career, Hyde enjoyed even greater success as a commentator, earning him Membership of the Order of the British Empire and a place in the Sport Australia Hall of Fame and the Australian Commercial Radio Industry Hall of Fame.", "Hyde's contribution to Rugby League is celebrated each year with the Frank Hyde Shield, a three match tournament played between the Newtown Jets and North Sydney Bears.", "Frank Hyde married Gaby Schofield at Waverley in 1942. He retired as a player-coach in 1944. He returned to coach Norths for one last year in 1950.", "During the 1970s, Hyde recorded 3 albums: Frank Hyde Sings, The Frank Hyde Party Sing-a-long and Frank Hyde Sings For The Good Times. ", "! scope=\"row\" | Frank Hyde Sings", "! scope=\"row\" | The Frank Hyde Party Sing-a-long", "! scope=\"row\" | The Frank Hyde Sings for the Good Times", "The Frank Hyde Shield is contested on an annual basis between the Newtown and North Sydney clubs.", "Frank Hyde outlived his wife Gaby by seven months, and died on 24 September 2007 at the age of 91.  He was survived by his 6 children, 6 grandchildren and 6 great-grandchildren.Frank Hyde - Rugby LeagueLegendary league caller dies , LeagueHQ.com He was honoured at the 2007 NRL Grand final with a video-tribute during the half time break of the match between the Manly-Warringah Sea Eagles and Melbourne Storm and a minute's silence prior to the Premier League Grand Final.", "*Frank Hyde biography at Sport Australia Hall of Fame", "*ABC-PM tribute to Frank Hyde. (transcript and audio)", "*Frank Hyde at rl1908.com", "*Frank Hyde article at menofleague.com"]}]}}