{"wiki_id": "http://www.wikidata.org/entity/Q5494995", "itemLabel": "Fred Dinenage", "itemDescription": "Newsreader", "wikipedia_url": "https://en.wikipedia.org/wiki/Fred_Dinenage", "wikipedia_page": {"main": "Frederick Edgar Dinenage MBE (born 8 June 1942) is an English author and retired broadcaster and television presenter. His television career spanned nearly 60 years, including the long-running children's programme How and ITV's regional programming in the south of England. Dinenage retired from ITV Meridian on 16 December 2021, after 38 years as a news anchor.", "link_mentions": [{"page": "Southern Television", "response": ["Regular programmes produced by Southern Television included the regional news magazine Day by Day, presented by Cliff Michelmore, Christopher Peacock, Barry Westwood, Peter Clark, and long-serving weather forecaster Trevor Baker; Out of Town, a countryside programme introduced by Jack Hargreaves, who would later join Southern Television's board of directors; How, a children's science programme also featuring Hargreaves along with Fred Dinenage, Bunty James (later replaced by Marian Davies) and Jon Miller; Freewheelers, a children's spy series; Winston Churchill: The Wilderness Years and Worzel Gummidge, starring Jon Pertwee as the eponymous walking scarecrow. Southern Television also produced a programme aimed at the farming community, presented by Mark Jenner, Farm Progress was broadcast at around 10:30 on Sunday mornings. A late-night epilogue was introduced by Roger Royle. Alongside 'Trevor the Weather', weather forecasts were also presented by Cyril Ockenden.", "In August 2008, ITV Meridian commemorated the 50th anniversary of Southern Television's first transmission with special reports on Thames Valley Tonight and Meridian Tonight (South and South East editions) alongside a half-hour programme presented by Fred Dinenage."]}, {"page": "Hammersmith nude murders", "response": ["The Crime & Investigation channel's Fred Dinenage: Murder Casebook put forward the theory that the killer could have been Harold Jones, a convicted murderer from Wales. Jones killed two girls in 1921 in his home town of Abertillery. Because he was 15 at the time, he was not liable for the death penalty and instead received a life sentence. He was released from Wandsworth prison in 1941, at the age of 35, for exemplary behaviour. He is believed to have then returned to Abertillery, and visited the graves of his victims. By 1947, Jones was living in Fulham, London. All the Stripper murders had similar features to his early murders, with no sexual assault, but extreme violence, inflicted on the victims. Due to poor record-keeping, he was never considered as a possible suspect by the police. Jones died in Hammersmith in 1971.", "* Fred Dinenage: Murder Casebook documentary series – \"Murders That Shocked a Nation: The Welsh Child Killer\", first broadcast in the UK by CI in 2011."]}, {"page": "Television South", "response": ["TVS ceased broadcasting to the South and South East of England at just before midnight on 31 December 1992. While most other ITV stations were broadcasting the Thames Television farewell programme The End of the Year Show, Scottish and Grampian chose to opt out and instead aired their traditional Hogmanay special, while TVS chose to opt out and air its own final programme entitled Goodbye to All That, a 65-minute retrospective of its programming, presented by Fred Dinenage and Fern Britton and recorded in front of a studio audience at the Northam studios in Southampton on 13 December that year. The programme closed with an amended version of the TVS ident, along with the message 'Thanks for watching' before crossing to Big Ben for the New Year chimes at midnight and the handover to Meridian Broadcasting."]}, {"page": "Graham Young", "response": ["Young died in his cell at Parkhurst prison on the evening of 1 August 1990, one month before his 43rd birthday. The cause of death was listed as myocardial infarction at an inquest, after a postmortem. As Young had no history of heart disease, it has been speculated that he either committed suicide, or was murdered by prisoners or prison staff who did not feel safe around him.Fred Dinenage: Murder Casebook: Graham Young - The Teacup Poisoner - Pick - Sky  UK - 2011", "*  (Documentary of Young's life presented by Fred Dinenage)"]}, {"page": "To Tell the Truth", "response": ["| Fred Dinenage"]}, {"page": "Yvette Fielding", "response": ["From 1995 Fielding made a successful transition from children's to television for an older audience. After leaving What's Up Doc? Fielding presented  The Heaven and Earth Show, The General and City Hospital for the BBC. She was a regular host of Karaoke Challenge and contributed weekend continuity for Challenge TV. Fielding also appeared in the ITV game show Win, Lose or Draw in 1995 and 1996. Fielding briefly returned to children's television in 1997, appearing in two episodes of the CBBC drama series Byker Grove, playing the role of Samantha Fuller. From 1998 to 2000, Fielding appeared as a regular alongside Fred Dinenage and Toyah Willcox on a property-pricing based game-show called Under Offer made for Meridian Television. In 2003, Fielding appeared as a guest on the Channel 4 chat show Richard & Judy."]}, {"page": "List of people from Birmingham", "response": ["*Fred Dinenage – T.V. presenter, broadcaster, author"]}, {"page": "Fern Britton", "response": ["Britton then worked for TVS in Southampton, co-hosting the South edition of the news programme Coast to Coast with Fred Dinenage, as well as Coast to Coast People, The Television Show, Magic Moments and, as presenter with Stefan Buczacki, of That's Gardening. She stayed until TVS's franchise ended in December 1992."]}, {"page": "How 2", "response": ["A similar CITV show to appear a few years later was The Big Bang, presented by How 2's own Gareth Jones and Violet Berlin. The Big Bang had a more scientific slant, focusing on performing fun experiments involving simple physics and chemistry. Other similar British television series included Don't Ask Me. Fred Dinenage was the only presenter to appear in both incarnations of How, presenting the shows for a total of 31 years. On 6 January 2013, as part of CITV's Old Skool Weekend (a televised event celebrating the strand's 30th anniversary), the first episode of the 1995 series was shown. Prior to this, a How 2 segment was featured on the 30 Years of CITV documentary that aired on ITV on 29 December 2012 and featured interviews with Dinenage and Jones.", "Also in 2019, the CITV channel commissioned a further revival of the format. Due for air November 2020, with Fred Dinenage making his third return to the series, alongside a new team of Vick Hope, Sam Homewood and Frankie Vu."]}, {"page": "World of Sport (British TV programme)", "response": ["Eamonn Andrews was the first host and the programme itself was \"compiled for Independent Television\" by ABC Weekend Television. From the summer of 1968 it was produced by London Weekend Television - under the ITV Sport banner, with the other ITV stations supplying footage of events in their regions. Thames Television took over LWT's responsibilities for Bank Holiday editions. Dickie Davies also took over as host in 1968 and would remain the face of the show until it ended in 1985. Other presenters were Fred Dinenage, Steve Rider and Jim Rosenthal. STV and Grampian occasionally opted out and showed their own version of World of Sport (billed as Scotsport Special) presented by Arthur Montford."]}, {"page": "Fred dineage", "response": ["#redirect Fred Dinenage"]}, {"page": "Fred Dineage", "response": ["#REDIRECT Fred Dinenage"]}, {"page": "ITV News Meridian", "response": ["The presenting line-up for each news service reflected continuity and change. Meridian South went on air with Fred Dinenage (TVS & Southern) and Debbie Thrower (BBC), the South East anchors were Mike Debens (TVS) and Alison Holloway (Sky, ABC) and in the Thames Valley, Andy Craig (Central) partnered with Mai Davies (TVS). Carl Tyler did the weather for Thames Valley and South and Ron Lobeck was also retained for the South East forecasts.", "Sangeeta Bhabra and Fred Dinenage were announced as lead presenters of the scaled back service. Both sub-regional editions utilise exactly the same presenter(s) and studio/set, therefore one of the two opt-outs – depending on the day's news – is pre-recorded 'as live' shortly before broadcast.Seventeen regions into nine: How the updated ITV local news services will run Caitlin Fitzsimmons, The Guardian, 17 February 2009", "Notable former on air staff include: Andrea Byrne, Fred Dinenage, Kate Garraway, Charlotte Hawkins, Phil Hornby, Gemma Humphries, Natasha Kaplinsky, Debbie Thrower and Charlene White."]}, {"page": "Debbie Thrower", "response": ["Transferring to ITV, Thrower and colleague Fred Dinenage were presenters of Meridian Tonight (South) when it first aired in 1993. In addition, she was the first person seen after the changeover of TV contractor from TVS to Meridian, shortly after the stroke of midnight on New Year's Day 1993, covering the celebrations at Winchester Cathedral, which was celebrating its 900th anniversary. Her final show as presenter of Meridian Tonight was on 6 February 2009."]}, {"page": "Portsmouth Grammar School", "response": ["*Fred Dinenage (1942–), presenter of ITV's local news programme, Meridian Tonight"]}, {"page": "Saturday Stayback", "response": ["*Complaints / Opening Titles / Chris Tarrant Intro / Chatting Up the Barmaid / Bernard Manning Joke / Hair Colouring / The Paranoiac Society / Medieval World of Sport (Fred Dinenage) / Blue Nun / Alien Mum and Son / Cigarette Machine / Two Women Talking / Vasectomy Song / Political Interview / Frankenstein and Igor / Venison / The Joys of Not Having Sex / Bernard Manning Joke / Castrated / Man in Pyjamas / Chris and Kevin Link / Main Attraction by Suzi Quatro / Alcohol-Free Lager / Commercial Break (EDITED OUT) / Spelling Mistake / Can I Marry Tania? / Bernard Manning Joke / Directing Kevin / Romeo and Juliet / PMT Song / Tomorrow's Front Page / Bernard Manning Joke / My Friend Jackie's Got a Big Kawasaki / Rolf Harris Impression"]}, {"page": "List of The Goodies guest stars", "response": ["|Fred Dinenage (as himself) ||||| \"Football Crazy\""]}, {"page": "Trevor Baker", "response": ["Trevor Baker (27 August 1921 – 19 August 2016)Daughter's tribute to 'Trevor the Weather' was a British meteorologist. He joined the Met Office in 1941 and worked all over the UK (as well as a stint in Hong Kong between 1953 and 1956) before being seconded to the BBC in 1962. After a few months he moved to Southern Television's evening news magazine Day by Day. He worked with a number of different co-presenters including Cliff Michelmore, Barry Westwood and Fred Dinenage and his role gradually expanded (reading out congratulatory messages, writing a bookBaker, T: Science and the Weatherman (1974) Exeter, A Wheaton & Co ) until eventually he was given his own show The Trevor Baker All Weather Show.1980, produced by Bryan Izzard and directed by David Pick (BFI Archives) Baker remained in his position when the franchise changed to TVS (Television South) in 1982 and continued on until 1987. When people in Southampton said \"Trevor says it's going to be fine today\", nobody ever said \"Trevor who?\". He had achieved that ultimate accolade, accorded to very few, of being immediately identifiable by his first name.  In all he was on-air for 25 years —at the time Britain's longest-serving TV weather forecaster.  "]}, {"page": "Gordon Cummins", "response": ["* The Crime & Investigation Network have broadcast an episode focusing on the Blackout Murders as part of their Murder Casebook series. Presented by Fred Dinenage, this 45 minute episode was first broadcast in November 2012 and features interviews with criminologist David Wilson."]}, {"page": "Sangeeta Bhabra", "response": ["Meridian Tonight was re-organised in February 2009 and Bhabra took over as co-presenter with long-standing presenter Fred Dinenage."]}, {"page": "Our Story (book)", "response": ["Our Story is an autobiographical book by Ronnie and Reggie Kray with Fred Dinenage.  It was first released in 1988 by Sidgwick & Jackson, and in paperback on 8 September 1989 by Pan Books.", "The book's Foreword and its \"A Final Word\" are authored by Fred Dinenage."]}, {"page": "Matt Teale", "response": ["In December 2021, it was announced that Teale would be replacing Fred Dinenage as the main presenter on ITV News Meridian."]}, {"page": "Gail McKenna", "response": ["In 1998, she became a children's television presenter for CITV. She worked on Brilliant Creatures from 1998–2004, where her co-hosts included Terry Nutkins and Stephen Mulhern, and How 2 from 2000–06, which she co-presented with Fred Dinenage and Gareth Jones."]}, {"page": "List of ITV journalists and newsreaders", "response": ["* Fred Dinenage – television host and newsreader, based in the south of England; has appeared as presenter of many British television programmes, including World of Sport, and quiz shows, such as Tell The Truth, Gambit and Pass The Buck, and the children's series How. Most of these were produced by Southern Television and its successors TVS and Meridian Broadcasting; however, Dinenage has also worked for the BBC on occasions. He was a presenter on ITV Meridian between 1983 and 2021."]}, {"page": "Under Offer", "response": ["Under Offer is a property game show that aired in the Meridian region from 14 April 1998 to 17 June 2001 and ran for 4 series. It was hosted by Yvette Fielding and team captained by Fred Dinenage and Toyah Willcox."]}, {"page": "Coast to Coast (British TV series)", "response": ["The programme was originally presented by Khalid Aziz and utilised many former Southern Television staff including sports presenter Fred Dinenage and weatherman Trevor Baker. Dinenage was promoted to become main anchor when Aziz left Coast to Coast a year later to concentrate on business programming for TVS.", "The final editions of the programme were aired as an hour-long special on 31 December 1992. In the South, Fred Dinenage and Mai Davies presented a regular edition featuring the last part of a feature series looking back at the past eleven years of news coverage provided by TVS. Meanwhile, in the South East, Mike Debens and Liz Wickham presented a more retrospective programme featuring an invited studio audience.", "| 1983–1985 || rowspan=5|Fred Dinenage || Christopher Peacock"]}, {"page": "1942 in British television", "response": ["* 8 June – Fred Dinenage, television presenter"]}, {"page": "Cannock Chase murders", "response": ["* The Crime & Investigation Network have broadcast an episode focusing on the murders committed by Harold Jones as part of their Murder Casebook series. Presented by Fred Dinenage, this 45-minute episode was first broadcast in November 2012. Criminologist David Wilson is among those interviewed."]}, {"page": "III (Orbital EP)", "response": ["\"LC1\" includes a sample of television presenter Fred Dinenage reading a report of an alleged alien abduction."]}, {"page": "Caroline Dinenage", "response": ["Dinenage was born on 28 October 1971, the daughter of television presenter Fred Dinenage and Beverley Summers."]}, {"page": "2010 Birthday Honours", "response": ["*Fred Dinenage, Television Presenter. For services to Broadcasting."]}, {"page": "How (TV series)", "response": ["The show was originally presented by Hargreaves alone. He was joined by Fred Dinenage (1966–1981), Jon Miller (1966–1981), Bunty James (1966–1969 and 1970–1976), Dr Tom Gaskell (1969), Jill Graham (1969–1970) and Marian Davies (1977–1981). Occasional stand-ins for Hargreaves included Barry Bucknell.", "In 1990, the series was revived as How 2 by TVS. Presenter Fred Dinenage made a return with Gareth Jones, Carol Vorderman, Gail McKenna and Sian Lloyd. The show aired on Children's ITV, known as CiTV and it ran for 16 years — until 2006.", "Also in 2019, the CITV channel commissioned a further revival of the format. Due for air November 2020, with Fred Dinenage making his second return to the series franchise, alongside a new team of Vick Hope, Sam Homewood and Frankie Vu."]}]}}