{"wiki_id": "http://www.wikidata.org/entity/Q5495582", "itemLabel": "Fred Jarvis", "itemDescription": "British trade unionist (1924-2020)", "wikipedia_url": "https://en.wikipedia.org/wiki/Fred_Jarvis", "wikipedia_page": {"main": "Frederick Frank Jarvis CBE (8 September 1924 – 15 June 2020) was a British trade union leader. He was President of the National Union of Students (NUS) from 1952 to 1954 and General Secretary of the National Union of Teachers (NUT) from 1975 to 1989. Jarvis served as President of the Trades Union Congress in 1987, the first Oxford graduate to hold that position.", "link_mentions": [{"page": "National Union of Teachers", "response": ["* Fred Jarvis, 1975–1989", ":1970: Fred Jarvis", "Named after former General Secretary Fred Jarvis and his late wife, the Fred and Anne Jarvis Award was established in 2007 and was presented annually by the NUT to individuals other than NUT members who campaigned tirelessly for all children and young people.  For a list of winners of the Fred and Anne Jarvis Award see List of Fred and Anne Jarvis Award winners."]}, {"page": "President of the Trades Union Congress", "response": ["thumb|right|Fred Jarvis, President in 1987"]}, {"page": "Cittie of Yorke", "response": ["The Welsh poet Dylan Thomas penned an impromptu ode to the pub when it was called Henneky's Long Bar. Fred Jarvis, a former general secretary of the National Union of Teachers, found the previously unknown poem in 2014 while going through papers belonging to his late parents-in-law who knew Thomas. The top of the poem reads  \"This little song was written in Henneky's Long Bar High Holborn by Dylan Thomas in 1951.\" Orion Publishing Group planned to include the song in a new edition of collected Thomas poems in October 2014.Caroline Davies, Dylan Thomas's drinking ditty to be published for first time, The Guardian, 26 June 2014."]}, {"page": "Jarvis (name)", "response": ["* Fred Jarvis, retired British trade union leader"]}, {"page": "List of presidents of the National Union of Students (United Kingdom)", "response": ["| Fred Jarvis"]}]}}