{"wiki_id": "http://www.wikidata.org/entity/Q54911927", "itemLabel": "Martin Henig", "itemDescription": "British archaeologist and Anglican priest", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Henig", "wikipedia_page": {"main": "Martin Henig is a British archaeologist, ethicist, and deacon of the Anglican church. He was born on 22 March 1942 at Harrow, Middlesex. He was educated at Merchant Taylors' School, Northwood, St Catharine's College, Cambridge, the UCL Institute of Archaeology, and Worcester College, Oxford. He is a senior member of Wolfson College, Oxford.", "link_mentions": [{"page": "Armorica", "response": ["The linguistic origins of Breton are clear: it is a Brythonic language descended from the Celtic British language, like Welsh and Cornish one of the Insular Celtic languages, brought by these migrating Britons. Still, questions of the relations between the Celtic cultures of Britain— Cornish and Welsh—and Celtic Breton are far from settled. Martin Henig (2003) suggests that in Armorica as in sub-Roman Britain:", "There was a fair amount of creation of identity in the migration period. We know that the mixed, but largely British and Frankish population of Kent repackaged themselves as 'Jutes', and the largely British populations in the lands east of Dumnonia (Devon and Cornwall) seem to have ended up as 'West Saxons'. In western Armorica, the small élite which managed to impose an identity on the population happened to be British rather than 'Gallo-Roman' in origin, so they became Bretons. The process may have been essentially the same.\"Martin Henig, British Archaeology, 2003, review of The British Settlement of Brittany by Pierre-Roland Giot, Philippe Guigon & Bernard Merdrignac", "* Martin Henig, review in British Archaeology 72(September 2003)"]}, {"page": "Quoit brooch", "response": ["Most scholars now agree that the style developed mainly from provincial late Roman metalwork styles, apparently drawing elements from both the relatively low-status jewellery found in military graves in northern Gaul and England such as belt buckles and fittings, and also late-Roman luxury work such as the style in one bracelet in the very late Roman Hoxne Hoard.Webster, 52-53  In the Quoit Brooch Style the very varied motifs are largely geometrical but include human face-masks and processions or confronted pairs of schematic animals.Suzuki, S.(2000)Webster, 52  In most pieces the motifs are tightly packed together in a way lacking classical harmony, but comparable to later Anglo-Saxon work. The style has also been related to late-Roman ring styles in finds such as the Thetford Hoard.Review by Martin Henig of Ancient Jewelry and Archaeology by Adriana Calinescu; The Jewellery of Roman Britain: Celtic and Classical Traditions by Catherine Johns, American Journal of Archaeology, Vol. 101, No. 4 (Oct., 1997), p. 809 (re the Johns book), Published by: Archaeological Institute of America, Article DOI: 10.2307/506863, JSTOR"]}, {"page": "Henig", "response": ["*Martin Henig, British archaeologist"]}, {"page": "The Tribe of Witches", "response": ["The book was the result of research carried out by Yeates at Oxford University as part of a D.Phil. project from 2001–05. The supervisors of the study were Prof. Martin Henig and Prof. Barry Cunliffe, and the assessors Dr. Ray Howell and Prof. Chris Gosden. Though certain ideas, such as that concerning Cuda, had already been formulated before this period."]}, {"page": "Oxford Centre for Animal Ethics", "response": ["Fellows include Robert Garner, Steven M. Wise and Martin Henig. Honorary fellows include J. M. Coetzee, Joy Carter, Bob Barker and Philip Wollen."]}, {"page": "History of Christianity in Britain", "response": ["People in Roman Britain typically believed in a wide range of gods and goddesses, and worshipped several of them, likely selecting some local and tribal deities as well as some of the major divinities venerated across the Empire.  Both indigenous British deities and introduced Roman counterparts were venerated in the region, sometimes syncretising together, as in cases like Apollo-Cunomaglus and Sulis-Minerva. Romano-British temples were sometimes erected at locations that had earlier been cultic sites in pre-Roman Iron Age Britain. A new style of \"Romano-Celtic temple\" developed which was influenced by both Iron Age and imperial Roman architectural styles but also unique from both; buildings in this style remained in use until the 4th century. The cults of various eastern deities had also been introduced to Roman Britain, among them those of the deities Isis, Mithras, and Cybele; Christianity was just one of these eastern cults. The archaeologist Martin Henig suggested that to \"sense something of the spiritual environment of Christianity at this time\", it would be useful to imagine India, where Hinduism, \"a major polytheistic system\", remains dominant, and \"where churches containing images of Christ and the Virgin are in a tiny minority against the many temples of gods and goddesses\"."]}, {"page": "Christianity in Roman Britain", "response": ["The archaeologist Martin Henig suggested that to \"sense something of the spiritual environment of Christianity at this time\", it would be useful to imagine India, where Hinduism, \"a major polytheistic system\", remains dominant, and \"where churches containing images of Christ and the Virgin are in a tiny minority against the many temples of gods and goddesses\"."]}, {"page": "Dimitris Plantzos", "response": ["Dimitris Plantzos has published articles on a wide variety of topics, including the study of Greek gems and seal-impressions, Greek painting, nationalist uses of classical antiquity in contemporary Greece, archaeology in literature and cinema, and the use of archaeology as a biopolitical instrument in modern societies. His DPhil thesis (1993) appeared as an Oxford Monograph on Classical Archaeology in 1999, titled Hellenistic Engraved Gems. His more recent work includes Greek art and archaeology, 1200 - 30 BC (2016), a classical archaeology textbook published in Greece by Kapon Editions and the US by Lockwood Press, and The Art of Painting in Ancient Greece (2018), produced by the same publishers. Plantzos was also co-editor of Classicism to Neo-Classicism. Essays Dedicated to Gertrud Seidmann (with Martin Henig; Archaeopress: Oxford 1999); A Singular Antiquity. Archaeology and Hellenic Identity in Twentieth-Century Greece (with Dimitris Damaskos; Benaki Museum: Athens 2008); and A Companion to Greek Art (with Tyler J. Smith; Wiley-Blackwell: Malden and Oxford 20182).", "* Classicism to Neo-Classicism. Essays dedicated to Gertrud Seidmann (with Martin Henig, Archaeopress (1999). "]}, {"page": "Henig, Martin", "response": ["#redirectMartin Henig"]}]}}