{"wiki_id": "http://www.wikidata.org/entity/Q5494438", "itemLabel": "Fred Alsop", "itemDescription": "British triple and long jumper", "wikipedia_url": "https://en.wikipedia.org/wiki/Fred_Alsop", "wikipedia_page": {"main": "Frederick John \"Fred\" Alsop (born 20 October 1938 in Plaistow, Essex) is a British former long jumper.", "link_mentions": [{"page": "Plaistow, Newham", "response": ["Multi-times Olympic athlete Fred Alsop was born in Plaistow in 1938."]}, {"page": "Athletics at the 1964 Summer Olympics – Men's long jump", "response": ["This was the 15th appearance of the event, which is one of 12 athletics events to have been held at every Summer Olympics. The returning finalists from the 1960 Games were defending champion Ralph Boston of the United States, bronze medalist Igor Ter-Ovanesyan of the Soviet Union, eleventh-place finisher Dimos Manglaras of Greece, and thirteenth-place finisher Fred Alsop of Great Britain. The event was expected to be a battle between Boston and Ter-Ovanesyan; since the 1960 Games, Boston had broken his own world record twice, Ter-Ovanesyan had broken Boston's new world record, and then Boston had first tied and then broken Ter-Ovanesyan's new world record.", "|rowspan=2| 22 ||align=left| Fred Alsop ||align=left|  || 7.26 ||data-sort-value=1.00| X ||data-sort-value=1.00| X || 7.26 || "]}, {"page": "Athletics at the 1964 Summer Olympics – Men's triple jump", "response": ["This was the 15th appearance of the event, which is one of 12 athletics events to have been held at every Summer Olympics. Returning finalists from the 1960 Games were gold medalist Józef Szmidt of Poland, bronze medalist Vitold Kreyer of the Soviet Union, fourth-place finisher Ira Davis of the United States, seventh-place finisher Manfred Hinze of the United Team of Germany, ninth-place finisher Ian Tomlinson of Australia, and twelfth-place finisher Fred Alsop of Great Britain. Szmidt had won the European championship again in 1962 and would have been the favorite but for a recent knee surgery that made his ability to repeat questionable.", "| 1 ||align=left| Fred Alsop ||align=left|  ||data-sort-value=1.00| X || 15.21 || 16.41 || 16.41 || ", "| 4 ||align=left| Fred Alsop ||align=left|  || 16.46 ||data-sort-value=1.00| X || 16.14 ||data-sort-value=1.00| X ||data-sort-value=1.00| X || 16.14 || 16.46 || "]}, {"page": "Alsop", "response": ["*Fred Alsop (born 1938), British long jumper"]}, {"page": "Athletics at the 1960 Summer Olympics – Men's long jump", "response": ["| 12 ||align=left| Fred Alsop || align=left|  ||data-sort-value=1.00| X || 6.93 || 7.42 || 7.42 || ", "| 13 ||align=left|Fred Alsop || align=left|  || 7.25 || 7.18 || 7.16 ||colspan=3 data-sort-value=0.00| Did not advance || 7.25"]}, {"page": "Athletics at the 1960 Summer Olympics – Men's triple jump", "response": ["| 11 ||align=left| Fred Alsop || align=left|  ||data-sort-value=1.00| X || 15.65 ||data-sort-value=1.00| — || 15.65 || ", "| 12 ||align=left|Fred Alsop || align=left|  || 15.49 ||data-sort-value=1.00| X ||data-sort-value=1.00| X ||colspan=3 data-sort-value=0.00| Did not advance || 15.49 || "]}, {"page": "Frederick Alsop", "response": ["#REDIRECT Fred Alsop"]}, {"page": "Athletics at the 1968 Summer Olympics – Men's triple jump", "response": ["This was the 16th appearance of the event, which is one of 12 athletics events to have been held at every Summer Olympics. Returning finalists from the 1964 Games were gold medalist Józef Szmidt of Poland, bronze medalist Vitold Kreyer of the Soviet Union, fourth-place finisher Ira Davis of the United States, seventh-place finisher Manfred Hinze of the United Team of Germany, ninth-place finisher Ian Tomlinson of Australia, and twelfth-place finisher Fred Alsop of Great Britain. Szmidt had won the European championship again in 1962 and would have been the favorite but for a recent knee surgery that made his ability to repeat questionable."]}, {"page": "Athletics at the 1962 British Empire and Commonwealth Games – Men's triple jump", "response": ["The event was won by the defending champion Australian Ian Tomlinson with a jump of , breaking his own Games record by over a foot. Tomlinson won by , ahead of his compatriot John Baguley and Fred Alsop from England who won the bronze medal.", "| 29 November || Final || align=left|Fred Alsop ||  ||  || NR"]}, {"page": "1962 European Athletics Championships – Men's triple jump", "response": ["| 14 || align=left | Fred Alsop || align=left |  || 15.33 || "]}, {"page": "1966 European Athletics Championships – Men's triple jump", "response": ["| 12 || align=left | Fred Alsop || align=left |  || 15.93 || ", "| 15 || align=left | Fred Alsop || align=left |  || 15.83 || Q"]}, {"page": "England at the 1962 British Empire and Commonwealth Games", "response": ["|align=left|Fred Alsop", "|align=left|Fred Alsop"]}, {"page": "Fred (name)", "response": ["* Fred Alsop (born 1938), British long jumper"]}, {"page": "England at the 1966 British Empire and Commonwealth Games", "response": ["|Fred Alsop\t||triple jump & long jump||1 x bronze"]}, {"page": "List of British champions in triple jump", "response": ["|Fred Alsop", "|Fred Alsop", "|Fred Alsop", "|Fred Alsop", "| Fred Alsop", "|Fred Alsop", "|Fred Alsop"]}, {"page": "List of British champions in long jump", "response": ["|Fred Alsop", "|Fred Alsop", "|Fred Alsop"]}, {"page": "Athletics at the 1966 British Empire and Commonwealth Games – Men's long jump", "response": ["| 12 ||align=left| Fred Alsop ||align=left|  ||  ||"]}]}}