{"wiki_id": "http://www.wikidata.org/entity/Q5494996", "itemLabel": "Fred Dewhurst", "itemDescription": "English footballer (1863-1895)", "wikipedia_url": "https://en.wikipedia.org/wiki/Fred_Dewhurst", "wikipedia_page": {"main": "Frederick Dewhurst (16 December 1863 – 21 April 1895) was an English professional footballer, who played as an inside forward for Preston North End in the late 19th century.Dewhurst was the first North End player to play representative football for Lancashire when he took part in the game against London for the benefit of the Moorfield Colliery Relief Fund. He was a schoolmaster at the Catholic college in Preston and one of its first secretaries. As a player, he was renowned for testing his physical prowess against rival goalkeepers. Prior to the inauguration of the Football League, North End were anxious to prove their worth against the Corinthians. Preston won 3–1 at Kennington Oval and then 4–3 at Deepdale with Dewhurst netting a hat-trick.Dewhurst made his international debut in the 1885–86 British Home Championship match against Ireland and scored in a 6–1 win on 27 February 1886. He scored on 29 March 1886 in a 3–1 win against Wales. He played in all three 1886–87 British Home Championship matches against Ireland, Scotland and Wales. Dewhurst scored two goals against Scotland and one against Ireland. He played in all three 1887–88 British Home Championship matches against Ireland, Scotland and Wales, scoring a total of five goals with one against Ireland, two against Scotland and two against Wales. He scored in all but one of his nine international appearances for England.Dewhurst, playing as an inside forward, made his League debut on 8 September 1888 at Deepdale when the visitors were Burnley. The home team won 5–2 and Dewhurst scored the first and fifth of Preston's League goals. He appeared in 16 of Preston's 22 League Championship matches and scored twelve goals. He scored twice on three occasions: two against Burnley in the opening game, two in the 5–0 win over Derby County at Deepdale on 8 December 1888 and both goals in the 2–0 win against Aston Villa at Wellington Road on 9 February 1889. Dewhurst played in all five FA Cup ties and scored the opening goal in the final at Kennington Oval on 30 March 1889 when Preston defeated Wolverhampton Wanderers 3–0.Dewhurst played only a minor role in Preston's successful defence of their League Championship title playing only six times and not scoring. He made his last first-team appearance in the 1890–91 season when he played in two matches, scoring one goal. He died in 1895 at the age of 31.", "link_mentions": {}}}