{"wiki_id": "http://www.wikidata.org/entity/Q5496055", "itemLabel": "Fred Pelly", "itemDescription": "English footballer (1868-1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Fred_Pelly", "wikipedia_page": {"main": "Frederick Raymond Pelly  (11 August 1868 – 16 October 1940) was an English international footballer, who played as a left back.", "link_mentions": [{"page": "Forest School, Walthamstow", "response": ["Forest is the only school to have played in the F.A. Cup, which it did for four seasons 1875-1879. The Old Foresters F.C., founded in 1876, entered the F.A.Cup in 12 seasons (1877-1889), and reached the quarter-finals in 1882, losing 0-1 to Great Marlow at Slough in a replay after a 0-0 draw in the first meeting at The Oval. The 1887 campaign ended after a 0-3 defeat to Preston North End at Leyton, in front of 5,000 spectators.The Preston Herald, 2 February 1887 Preston North End won the first-ever Football League championship two years later. Other F.A.Cup games were played against future Football League clubs Middlesbrough, Grimsby Town and Watford Rovers (later to become Watford F.C.). Old Foresters Percy Fairclough and Fred Pelly played for England."]}, {"page": "1860s in association football", "response": ["* 11 August – Fred Pelly (d. 1940), England international in three matches (1893–1894)."]}, {"page": "1892–93 in English football", "response": ["England's opening international game of the season took place in Birmingham on 25 February against Ireland, with the selectors choosing a team consisting mainly of players with connections to the Corinthians, of which seven were making their England débuts. Chris Charsley of Small Heath, who later went on to be Chief Constable of Coventry, made his solitary England appearance in goal. Alban Harrison (Old Westminsters) and Fred Pelly (Old Foresters) made their débuts as the two full-backs and Norman Cooper (Cambridge University) made his solitary appearance at centre-half. Robert Topham, an amateur player with Wolverhampton Wanderers, who had previously declined an invitation to play for Wales following his selection in 1885, made the first of his two appearances at outside right, with Walter Gilliat of Old Carthusians making his solitary appearance at inside right. Gilliat, an excellent dribbler of the ball, would probably have made more England appearances but for his religious beliefs, and went on to become the vicar of Iver and the rector of Sevenoaks."]}, {"page": "Old Foresters F.C.", "response": ["Forest School is the second oldest continuous member of the F.A. (since December 1863), behind only the Civil Service, and it is the only school to have played in the FA Cup (Donington School entered the first F.A. Cup but never actually played a game).P.C.Adams: \"From Little Acorns\", 1976 The club's main on-field achievements are reaching the quarter final of the F.A. Cup in 1882, and the last sixteen a further three times. The Old Foresters have won the prestigious \"old boys cup\", The Arthur Dunn Cup three times, the Essex Cup three times and the London Senior Cup twice. Two Old Foresters F.C. players have played for England while at the club: Percy Fairclough and Fred Pelly", "During this era, two Old Foresters players were selected to represent England — Percy Fairclough in 1878 and Fred Pelly, three times in 1893 and 1894."]}, {"page": "Frederick Pelly", "response": ["#REDIRECT Fred Pelly"]}, {"page": "Pelly (surname)", "response": ["*Fred Pelly (1868–1940), English footballer"]}]}}