{"wiki_id": "http://www.wikidata.org/entity/Q5497085", "itemLabel": "Frederic Lord", "itemDescription": "British composer and conductor", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederic_Lord", "wikipedia_page": {"main": "Frederic Lord (15 November 1886 – 15 August 1945) was an English choral conductor, organist, composer, and music educator.\nLord was born in Bingley.  He studied piano with Ladislas Gorski in Montreux, Switzerland and the organ with Arthur Eaglefield Hull in England. A child prodigy, he started giving organ recitals at the age of 10 and began working as a church organist at the age of 11. He was organist at Barnoldswick, Lancashire, and at Settle, Yorkshire before moving to Brantford, Ontario in Canada in 1923. From 1923 until his death in 1945 he served as the organist and choirmaster at the First Baptist Church in Brantford and as the music director of the Ontario School for the Blind. In 1928 he founded the Canadian Choir of Brantford which he conducted until his death. The choir drew praise from critics both at home and abroad, making several tours to the United States and Europe. The choir notably gave performances at Albert Hall in London and at Carnegie Hall in New York City. The choir included in its repertoire several works written by Lord. In addition to his choral compositions, Lord also wrote several works for the organ and the piano, one symphony, the cantata The Battle of Morgarten, and a setting of Psalm 90 for baritone solo, choir, and orchestra.Lord was also a voice teacher. His most notable pupil was baritone George Lambert. He died at the age of 58 in Brantford. The National Library of Canada holds several of his papers.\nHe died in Brantford, aged 58.", "link_mentions": [{"page": "Frederick Lord", "response": ["*Frederic Lord (1886–1945), English choir director, teacher, organist, and composer"]}, {"page": "Arthur Eaglefield Hull", "response": ["Hull lived in Huddersfield in Yorkshire, and became an editor of several music publications including The Monthly Musical Record,\"An English Progressivist\". The Cambridge Companion to Vaughan Williams. Cambridge University Press; 14 November 2013. . p. 67, 76. International Library of Books on Music, Library of Music and musicians (a series of books on composers), The Music Lover's library (short books on classical music subjects) and others. He also taught the piano and organ privately with Frederic Lord and George Oldroyd among his notable pupils.Leach, Gerald. British Composer Profiles (2001), p. 152"]}, {"page": "George Lambert (baritone)", "response": ["Lambert was born in Long Preston.  Following World War I, he studied singing in his native country with Frederic Lord while concurrently playing soccer professionally. He was highly active as an oratorio singer in England during the early 1920s. In 1923 he relocated to Rome, where he studied opera with Alfredo Martino. He made his professional opera debut in Rome soon after as Giorgio Germont in Giuseppe Verdi's La Traviata. He returned to England, where he became a frequent soloist on BBC Radio during the late 1920s. During this time Sir Henry Wood was his vocal coach."]}, {"page": "1945 in British music", "response": ["*15 August – Frederic Lord, organist, conductor and composer, 58"]}, {"page": "James O. Ramsay", "response": ["His professional influences include Karl Jöreskog, Frederic Lord, Duncan Luce, and Peter J. Huber."]}]}}