{"wiki_id": "http://www.wikidata.org/entity/Q5495069", "itemLabel": "Fred Emery", "itemDescription": "Footballer (1900-1959)", "wikipedia_url": "https://en.wikipedia.org/wiki/Fred_Emery_(footballer)", "wikipedia_page": {"main": "Frederick David Emery (19 May 1900 – 1959) was an English footballer who played as a wing half in the Football League with Doncaster Rovers in the 1920s and 1930s.He was born in Lincoln and signed for Lincoln City but did not play a senior game for them, before having a brief spell with Bradford City, amounting to five senior games.In the 1924–25 season he made his debut for Doncaster Rovers and was to go on and play 439 senior games for them (scoring 32 goals) in a playing career that was to last until the 1935–36 season.  As of 2009 he holds the record for the most Football League appearances made for Doncaster. In 1936 he was appointed manager at Doncaster, a position he held until the war.On 25 October 1943, he was appointed manager of Bradford (Park Avenue) succeeding David Steele. He was fortunate to inherit a talented squad, and his management style went down well with the players. He guided Bradford to the quarter-finals of the FA Cup in 1945–6, and masterminded the club's greatest cup victory in January 1948, when champions-elect Arsenal were defeated 1–0 at Highbury. After the war he netted the club around £52,000 in transfer fees when Geoff Walker, Len Shackleton, Johnny Downie and Jimmy Stephen moved to bigger clubs. When Bradford dropped out of the Second Division in 1950, and failed to go straight back, he left Park Avenue in June 1951 and was succeeded by Vic Buckingham.\nIn July 1951, Emery was appointed as Carlisle United manager, replacing future Liverpool manager Bill Shankly who left Carlisle to join Grimsby Town. In a seven-year spell as Carlisle manager Emery never was able inspire the Brunton Park faithful like his predecessor did, but he was able to the keep the club in a stable mid-table position in the Third Division North despite being handicapped by limited resources. He left the club in April 1958. He died in Carlisle in 1959 following a short illness, just a year after United had dispensed with his services.\nHis brother Bob and nephew Tony were also footballers.", "link_mentions": [{"page": "Fred Emery", "response": ["Sociotechnical systems is one part of a comprehensive theoretical framework called Open Systems Theory (OST). Two of Emery's and Trist's key publications were: \"The Causal Texture of Organisational Environments\" (1965) — which became a citation classic — and \"Towards a Social Ecology\" (1972). These publications are the groundwork on which Fred Emery developed OST. ", "In 1979 when his CCE Fellowship expired, efforts were made by some of his colleagues to find a permanent post for him at the ANU, but to no avail. Thus, long before their numbers swelled and their own association was formed, Emery became one of Australia's outstanding Independent Scholars. By 1985 he had published at least another 15 journal articles (a flow which continued to his last year), and governments, enterprises, students, universities, and many others, from this country and elsewhere, continued to seek his expertise, and later continued as a consultant. In this later period, he and Merrelyn Emery refined the Search Conference participative planning process (designed by Fred Emery and Eric Trist in 1958). In the final two years of his life, he co-edited the third and final volume of the \"Tavistock anthology\" being published by the University of Pennsylvania Press – The Social Engagement of Social Science.", "He knew that being ahead of one's time can be difficult: \"I am inclined to agree with Max Born, the German physicist, who reckoned that the acceptance of a new quantum theory would occur only with the passing away of the old physics professors. The acceptance will await a new generation that starts off with a question mark.\"Fred Emery (1992) in: Business review weekly Vol 14, Nr. 34-37. p. 64. ", "One story which illustrates this (and perhaps explains some of the reluctance to  grant tenure at ANU) was in 1975 when Fred and Merrelyn Emery [then both at the Centre for Continuing Education, Australian National University] published a book which, among other things, discussed the neurological effects of television viewing.Fred Emery and Merrelyn Emery, A choice of futures: to enlighten or inform, Canberra: Centre for Continuing Education, Australian National University, 1975.   In response to a press article about the book in a university publication,Anon, \"CCE study: television socially, physically dangerous\", ANU reporter, 6, 22 August 1975, pp. 1, 4–5. six professors and heads of departments (zoology, physiology, pharmacology, psychology, neurobiology, behavioural biology) wrote a letterS. A. Barnett et al., letter, ANU reporter, 6, 26 September 1975, p. 11. which strongly criticised the book and abused the authors. The six professors outlined what they considered to be \"the current limits of scientifically acceptable investigation of the nervous system\" and after criticising the Emerys and their work concluded that the article about the Emerys' book \"reflects upon the standards of brain research done in this University by those who are in it for the sake of finding out how a nervous system really works rather than for the support or refutation of a particular social issue\". It would seem that the professors' case rested primarily on their collective prestige, since not only had they not read the Emerys' book, but their specific criticisms did not stand up to scrutiny.red Emery and Merrelyn Emery, letter, ANU reporter, 6, 26 September 1975, p. 11."]}, {"page": "Ivor Broadis", "response": ["Broadis returned to Carlisle in July 1955, when he was signed as player/coach for a fee of £3,500 by manager Fred Emery. Broadis stayed at Brunton Park until June 1959 after which he was off to play in Scotland. "]}]}}