{"wiki_id": "http://www.wikidata.org/entity/Q5495616", "itemLabel": "Fred Jordan", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Fred_Jordan_(singer)", "wikipedia_page": {"main": "Fred Jordan (5 January 1922 – 30 July 2002) was a farm worker from Ludlow, Shropshire, and is noted as one of the great musically untutored traditional English singers. He was first recorded in the 1940s by folk music researcher Alan Lomax and, over subsequent decades endeared himself to the English folk-song revival movement.  Jordan was awarded the English Folk Dance and Song Society's highest honour, the Gold Badge, \"for distinguished and unique contributions to the folk performing arts\" in 1995.", "link_mentions": [{"page": "Shropshire", "response": ["* Fred Jordan farm worker from Ludlow and one of the great traditional English singers"]}, {"page": "List of folk musicians", "response": ["*Fred Jordan"]}, {"page": "John Barleycorn", "response": ["Many field recordings of the song were made of traditional singers performing the song, mostly in England. In 1908, Percy Grainger used phonograph technology to record a Lincolnshire man named William Short singing the song; the recording can be heard on the British Library Sound Archive website. James Madison Carpenter recorded a fragment sung by a Harry Wiltshire of Wheald, Oxfordshire in the 1930s, which is available on the Vaughan Williams Memorial Library website as well as another version probably performed by a Charles Phelps of Avening, Gloucestershire. The Shropshire singer Fred Jordan was recorded singing a traditional version in the 1960s."]}, {"page": "English folk music", "response": ["The second revival gained momentum after the Second World War, following on from the American folk music revival as new forms of media and American commercial music appeared to pose another threat to traditional music.J. Connell and C. Gibson, Sound Tracks: Popular Music, Identity, and Place (Routledge, 2003), pp. 34–6. The key figures were Ewan MacColl and A. L. Lloyd. The second revival was generally left wing in politics and emphasised the work music of the 19th century and previously neglected forms like erotic folk songs. Topic Records, founded in 1939, provided a major source of folk recordings. The revival resulted in the foundation of a network of folk clubs in major towns, from the 1950s.B. Sweers, Electric Folk: The Changing Face of English Traditional Music (Oxford: Oxford University Press, 2005), pp. 32–6. Major traditional performers included The Watersons, the Ian Campbell Folk Group, and Shirley Collins.S. Broughton, M. Ellingham, R. Trillo, O. Duane, V. Dowell, World Music: The Rough Guide (London: Rough Guides, 1999), pp. 66–8 and 79–80. The fusing of various styles of American music with English folk also helped to create a distinctive form of guitar fingerstyle known as ‘folk baroque’, which was pioneered by Davy Graham, Martin Carthy, John Renbourn and Bert Jansch.B. Sweers, Electric Folk: The Changing Face of English Traditional Music (Oxford: Oxford University Press, 2005), pp. 184–9. Several individuals emerged who had learnt the old songs in the oral tradition from their communities and therefore preserved the authentic versions. These people, including Sam Larner, Harry Cox, Fred Jordan, Walter Pardon, Frank Hinchliffe and the Copper Family, released albums of their own and were revered by folk revivalists. Popular folk revival musicians based their works on songs sung by these traditional singers and those collected during the first folk revival."]}, {"page": "Lord Randall", "response": ["Most traditional English versions are called \"Henry, My Son\". Dorset traveller Caroline Hughes sang a version to Peter Kennedy in 1968 and another to Ewan MacColl and Peggy Seeger in the early 1960s which can be heard online on the Vaughan Williams Memorial Library website. Fred Jordan of Ludlow, Shropshire also sang \"Henry, My Son\" to Mike Yates in 1964 and Gwilym Davies in 1994. Louisa Hooper of Somerset, England (sister of the traditional singer Lucy White) was recorded singing a version entitled \"Lord Rendal\" by the BBC and Douglas Cleverdon in 1942."]}, {"page": "English folk music (1900–1949)", "response": ["* Fred Jordan (1922–2002)"]}, {"page": "English folk music (1960–1969)", "response": ["* 1966: Songs of a Shropshire Farm Worker (Fred Jordan)"]}, {"page": "English folk music (1970–1979)", "response": ["*1974: When the Frost is on the Pumpkin (Fred Jordan)"]}, {"page": "English folk music (2000–2009)", "response": ["* Fred Jordan (5 January 1922 – 30 July 2002)"]}, {"page": "Mary Hamilton", "response": ["Dozens of traditional versions of the ballad have been recorded. James Madison Carpenter recorded several versions in Scotland in the early 1930s, which can be heard online via the Vaughan Williams Memorial Library. Peter Kennedy recorded two Scottish versions in the mid-1950s, sung by Jeannie Robertson of Aberdeen and Ethel Findlater of Dounby, Orkney, and another version sung by Mary Taylor of Saxby-All-Saints, Lincolnshire, England. Fred Hamer recorded Fred Jordan of Ludlow, Shropshire singing 'The Four Marys' in 1966."]}, {"page": "Lady Isabel and the Elf Knight", "response": ["|Fred Jordan||Shropshire||Steve Gardham||1971||The Outlandish Knight||Steve Gardham Collection, British Library Sound Archive.British Library Sound Archive; Steve Gardham collection; Shelf mark 1CDR0009330 (copy of C1009/7) http://sounds.bl.uk/World-and-traditional-music/Steve-Gardham-Collection/025M-C1009X0007XX-2100V0#_ Retrieved 2017/03/17", "|Fred Jordan||Shropshire||Bob Patten||1992||The Outlandish Knight||Bob and Jacqueline Patten Collection, British Library Sound ArchiveBritish Library Sound Archive; Bob & Jacqueline Patten English Folk Music Collection; Shelf mark 1CDR0013924 (copy of C1033/250); http://sounds.bl.uk/World-and-traditional-music/Bob-and-Jacqueline-Patten-Collection/025M-C1033X0250XX-0800V0 Retrieved 2017/03/17", "| The Voice of the People: Good People, Take Warning || Fred Jordan || 2012 || Six Pretty Maids || 1952 recording previously issued on LP"]}, {"page": "English Folk Dance and Song Society", "response": ["1995  Ivor Allsop; Liza Austin; Brenda Godrich; Cyril Jones; Fred Jordan; Harry Pitts; Rex Laycock"]}, {"page": "Bonnie Annie", "response": ["The Banks of Green Willow variant was popular with traditional singers across the south of England, where 33 versions were collected in the early twentieth century (14 in Somerset, 8 in Devon). One version was collected in Gloucestershire and another from the Shropshire singer Fred Jordan. 11 versions under various titles were collected in Scotland, one in Ireland and two in the US, both in Maine. Cecil Sharp reported the song as \"very generally sung throughout Somerset\".Vaughan Williams, R., and Lloyd, A. L.; The Penguin Book of English Folk Songs, Harmondsworth: Penguin, 1959"]}, {"page": "The Trees They Grow So High", "response": ["Dozens of authentic field recordings have been made of the song, including a 1907 phonograph recording of David Penfold, the landlord of the Plough Inn at Rusper in Sussex, made by the English composer and folk music collector Ralph Vaughan Williams. English traditional singers Fred Jordan of Ludlow, Shropshire and Walter Pardon of Knapton, Norfolk were recorded singing their traditional versions of the song in the 1960s and 1970s. A recording of May Bradley (also of Ludlow), which can be heard online via the Vaughan Williams Memorial Library, was probably the recording that inspired many of the popular versions. Several versions have been recorded in Scotland, including one sung by Shelia Stewart in 1960. Like most popular British folk songs, the song has appeared many times in North America, across the United States and Canada.", "The Voice of the People includes two recordings by traditional singers: The Bonny Boy sung by Fred Jordan on Volume 3: O’er His Grave the Grass Grew Green – Tragic Ballads, and Young But Growing sung by Mary McGarvey on Good People, Take Warning : Ballads by British and Irish Traditional Singers."]}, {"page": "The Bonny Bunch of Roses", "response": ["* Fred Jordan of Shropshire, England"]}, {"page": "The Jolly Waggoner", "response": ["| \"A Shropshire Lad\" || Fred Jordan || 1952 || \"Jolly Waggoner\" || ."]}, {"page": "The Voice of the People", "response": ["|Fred Jordan", "|Fred Jordan ", "|Fred Jordan "]}, {"page": "Traditional singer", "response": ["* Fred Jordan (1922-2002)"]}, {"page": "The Road to Dundee", "response": ["* Fred Jordan on In Course of Time (1991)"]}, {"page": "The Sprig of Thyme", "response": ["Joseph Taylor of Saxby-All-Saints, Lincolnshire was recorded singing \"The Sprig of Thyme\" by Percy Grainger in 1906; the recording can be heard on the British Library Sound Archive website. Other traditional English singers who performed the song include Fred Jordan of Ludlow, Shropshire, England, and George \"Pop\" Maynard, whose recording is also available via the British Library Sound Archive."]}, {"page": "British folk revival", "response": ["Several individuals emerged in England who had learnt the old songs in the oral tradition from their communities and therefore preserved the authentic versions. These individuals, such as Sam Larner, Harry Cox, Fred Jordan, Walter Pardon, and Frank Hinchliffe, released albums of their own and were revered by folk revivalists."]}, {"page": "Fred Jordan", "response": ["Fred Jordan may refer to:", "* Fred Jordan (baseball coach) (born c. 1958), college baseball coach", "* Fred Jordan (singer) (1922–2002), English singer", "* Fred Jordan (publisher) (1925–2021), Grove Press, Evergreen Review", "* Fred Jordan (politician) (born 1974), member of the Oklahoma House of Representatives"]}, {"page": "The Farmer's Boy", "response": ["In 1908, the famous composer and folk song collector Percy Grainger made a phonograph recording of a Mr. Tandy of Winchcombe, Gloucestershire singing a fragment of the song, which can be heard on the British Library Sound Archive website. Mark Anderson of Middleton-in-Teasdale, County Durham, the original source of the famous Scarborough Fair melody, sang the song to Alan Lomax in 1951, the recording of which is available online via the Alan Lomax archive. Peter Kennedy (1953) and Alan Lomax (1954) recorded Jags Plough of Barrow-on-Humber, Lincolnshire singing the song. Folk song collector Ken Stubbs recorded several versions in the 1960s and 70s in Sussex, Surrey and Cornwall, including one by the Sussex singer Pop Maynard, all of which can be heard on the Vaughan Williams Memorial Library website. The traditional singers Walter Pardon of Knapton, Norfolk (1985) and Fred Jordan of Ludlow, Shropshire (1990/91) were recorded singing versions of the song."]}, {"page": "Three Score and Ten", "response": ["| rowspan=\"2\" | Fred Jordan "]}, {"page": "Deaths in July 2002", "response": ["*Fred Jordan, 80, British folk singer."]}]}}