{"wiki_id": "http://www.wikidata.org/entity/Q5494638", "itemLabel": "Fred Birt", "itemDescription": "Welsh rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Fred_Birt", "wikipedia_page": {"main": "Fred Birt (10 November 1886 – 5 July 1956) was a Welsh international, rugby union centre who played club rugby for Newport and county rugby with Monmouthshire. He won seven caps for Wales but is most notable for his outstanding performance against the 1912 touring South African team for Newport. He was also a member of the Wales bowls team.", "link_mentions": [{"page": "Birt", "response": ["* Fred Birt (1886–1956), Welsh rugby union player"]}, {"page": "1956 in Wales", "response": ["*5 July – Fred Birt, Welsh international rugby union player, 69"]}, {"page": "1886 in Wales", "response": ["*10 November – Fred Birt, Wales international rugby union player (died 1956)"]}, {"page": "1912–13 South Africa rugby union tour of Europe", "response": [";Newport: H Wreford, Billy Geen, Walter Martin capt., J Wetter, Fred Birt, Reg Plummer, Tommy Vile, Jack Beames, J Williams, Harry Wetter, C Anderson, A Bell, R Dibble, Harry Uzzell, AR Williams", ";Wales: Bobbie Williams (Cardiff), Billy Geen (Newport), Fred Birt (Newport), Billy Spiller (Cardiff), Reg Plummer (Newport), Horace Thomas (Swansea), Tommy Vile (Newport) (capt.), F Andrews (Pontypool), Rees Thomas (Pontypool), F Perrett (Neath), Glyn Stephens (Neath), Percy Jones (Newport), Harry Wetter (Newport), Bert Hollingdale (Swansea), Johnnie Morgan (Llanelli)"]}, {"page": "List of people from Newport", "response": ["* Fred Birt"]}, {"page": "Billy Geen", "response": ["Just before half time, a try by Newport's Jack Wetter was disallowed for a forward pass. The ball was then worked back to Fred Birt, standing within range in front of the posts, and he kicked a drop-goal, putting the home side 4–0 ahead at the break. In the second half, the Springboks repeatedly attacked but the Newport defence kept them from crossing the line, although a break from Dick Luyt, the South African centre, left Douglas Morkel to score under the posts. Luyt failed to convert and Newport remained a point ahead. Newport scored again through a cross-kick from Wetter, which Birt jumped on over the line for a try, which he then converted."]}]}}