{"wiki_id": "http://www.wikidata.org/entity/Q5497344", "itemLabel": "Frederick Barlee", "itemDescription": "British colonial administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Barlee", "wikipedia_page": {"main": "Sir Frederick Palgrave Barlee  (6 February 1827 – 8 August 1884) was Colonial Secretary of Western Australia from 1855 to 1875; Lieutenant-Governor of the British Honduras (now Belize) from 1877 to 1882; and Administrator of Trinidad in 1884.Frederick Barlee was born in Worlingworth, Suffolk, England on 6 February 1827.  He was educated privately and at local schools, and in 1845 he entered the public service as a clerk to the Ordnance Department in Chatham and Woolwich.  In 1851, Barlee married Jane Oseland.  Later that year he was posted to Sierra Leone, where he served initially as a barrack-master and storekeeper.  In 1853 he became clerk to the Executive and Legislative Councils, and private secretary to the Governor of Sierra Leone Arthur Edward Kennedy.\nIn 1855, Kennedy was appointed Governor of Western Australia, and he arranged for Barlee to be appointed Colonial Secretary.  Both men arrived in Western Australia in June 1855, and commenced work the following month.  As colonial secretary, Barlee became a nominated member of the Western Australian Legislative Council.  Kennedy immediately embarked on a range of reforms, with Barlee largely responsible for their implementation.  Kennedy's reforms were unpopular, and Barlee made numerous enemies during this time.  However, by 1856 Barlee and Kennedy had fallen out; after this, Barlee often opposed Kennedy on important issues, and his influence declined.\nFrom January 1856 to March 1857, Barlee was Acting Commissioner of Police.In 1862, Governor Kennedy was succeeded by Governor John Hampton, and Barlee returned to a position of influence.  In 1863, he became permanent chairman of the Board of Education.  The following year he gave Bishop Matthew Hale financial help in establishing the Bishop's Collegiate School (now Hale School), and was appointed first Governor of the school.  That year, he also invested in the unsuccessful attempt to establish a pastoral settlement at Roebuck Bay.  Eventually, Barlee again fell out of favour with the governor, this time through disagreements over the treatment of convicts, and the management of the convict system in general.\nDuring the period from November 1868 to September 1869 Colonel John Bruce was acting governor and there was a great deal of friction between Bruce and Barlee.John Bruce was replaced by Frederick Weld in 1869, and Barlee again became an influential figure.  Weld and Barlee shared an enthusiasm for representative government, and together they worked to promote it.  Largely due to their efforts, Western Australia obtained representative government in May 1870.  Under the new system of government, Barlee became the most powerful person in the colony other than Weld himself.\nIn 1873, Barlee began to work for early achievement of responsible government.  Both directly and through a newspaper that he had recently bought a stake in, Barlee agitated for responsible government, and in 1874 the Legislative Council passed a resolution calling for the constitutional change.  Although Weld did not think that Western Australia was yet ready for responsible government, he accepted the situation and passed on the request to the Colonial Office in London.  The Colonial Office were strongly against granting responsible government, and were critical of Weld for allowing the situation to arise.  Shortly afterwards, Weld was transferred to Tasmania.  Barlee, perhaps anticipating a transfer, took long service leave and left for England in July 1875.  In his absence, the demand for responsible government receded, and it would not be granted until 1890.\nBarlee remained nominal colonial secretary for another eighteen months, and intended to return to the position unless he was offered a better appointment elsewhere.  In 1877, he was made CMG. Also in 1877, he was appointed Lieutenant-Governor of British Honduras (now Belize), a position that he held until 1882. After briefly visiting Western Australia to attend to some investments, he returned to England to await his next posting.  He was made KCMG in 1883, but had to wait until April 1884 for his next posting, as Administrator of Trinidad.  Barlee arrived at Port of Spain, Trinidad and took up his appointment in June 1884, but died from asthma just seven weeks later on 8 August 1884. Barlee had married in 1851, Jane, daughter of Edward John Oseland, of Coleraine, Ireland, who survived him.Barlee was elected a member of the American Antiquarian Society in 1878.", "link_mentions": [{"page": "Frederick Weld", "response": ["Weld saw his appointment to the governorship as a mandate to institute similar constitutional changes to that achieved in New Zealand. With the enthusiastic support of his Colonial Secretary Frederick Barlee, he set about promoting representative government. At the first opportunity, Weld introduced a Bill which provided for the election of 12 Members of the Legislative Council, to sit with six official and nominee members. The Bill was eventually passed on 1 June 1870.  Barlee then began agitating for responsible government, and in 1874 the Legislative Council passed a resolution calling for it. Although Weld did not think that Western Australia was ready for responsible government, he accepted the situation and passed on the request to the Colonial Office in London. The Colonial Office were strongly against granting responsible government, and were critical of Weld for allowing the situation to arise. In 1874, Weld went on leave to New Zealand to look after his partnership affairs. He is said to have remarked, upon his departure, \"At last she moves\", in reference to the improvements he perceived in Western Australia. On this return, he was transferred to the post of Governor of Tasmania, and the issue of responsible government was dropped until 1890."]}, {"page": "Lake Barlee", "response": ["Lake Barlee was named by John Forrest, who encountered it on 18 May 1869. Forrest's party, which was searching for the lost explorer Ludwig Leichhardt, became bogged while trying to cross the salt lake. After extracting their horses, they skirted the lake for nearly a week. On 25 May, Forrest climbed Yeedie Hill and saw the extent of the lake. Forrest named the lake after Frederick Barlee, the Colonial Secretary of Western Australia."]}, {"page": "Frederick Palgrave Barlee", "response": ["#REDIRECT Frederick Barlee"]}, {"page": "Barlee", "response": ["* Frederick Barlee (1827–1884), Australian politician, Lieutenant-Governor of British Honduras (now Belize), and Administrator of Trinidad"]}, {"page": "Anthony O'Grady Lefroy", "response": ["When Colonial Secretary of Western Australia Frederick Barlee took long service leave in July 1875, Lefroy was appointed acting Colonial Secretary.  In December of that year he was appointed a member of the Western Australian Legislative Council.  The following year he became a Justice of the Peace.  When Barlee was posted to the British Honduras early in 1877, Roger Goldsworthy was appointed the new Colonial Secretary; Lefroy ceased to be acting Colonial Secretary and a member of the Legislative Council on 30 August 1877.  The following year, he was made CMG."]}, {"page": "Colonial Secretary of Western Australia", "response": ["| Frederick Barlee"]}, {"page": "Maitland Brown", "response": ["Brown was appointed a Justice of the Peace later that year, and in 1866 was made Resident Magistrate at Greenough.  During his time in the position, he became involved in a protracted dispute with the Governor, John Hampton, and the Colonial Secretary Frederick Barlee.  Brown declined to obey an instruction to reverse a minor legal decision he had made, essentially on the grounds that it was inappropriate for a magistrate to reverse a decision on the instruction of the Government: \"I have yet to learn that a magistrate has any right to pursue a course which in his view is in opposition to Law upon the mere instructions of the Governor\"1.  Hampton was angered by Brown's repeated refusal to obey him, and by the \"tone and tenor\" of his letters, which he thought insolent.  Brown eventually resigned over the issue, but in the meantime, Hampton's appointment had ended.  Acting governor John Bruce, who agreed with Brown's legal position, smoothed the matter over, and Brown withdrew his resignation."]}, {"page": "South Western Highway", "response": ["By the second half of the nineteenth century, the importance of the coast road was diminishing. For most of its length, the road went through well-timbered, sandy limestone country of little value to agriculture, and settlers in the vicinity of the road were scarce. In contrast, settlements had spread and prospered in the foothills of the Darling Scarp, and on 1 July 1853, Colonial Secretary Frederick Barlee announced a new proposal for a Perth–Pinjarra–Bunbury route along the foothills, with a  width, mostly following the alignment of previous tracks. Between 1864 and 1876, two parties of convicts were involved in the making of the road."]}, {"page": "Alfred Chopin", "response": ["In 1872, Chopin started a business as a photographer. \"As a token of official remorse\" (Erickson 1983) for his wrongful conviction and imprisonment, the governor commissioned him to take some photographs, and thereafter he advertised himself as \"by appointment to His Excellency\". Because of the historical significance of some of the officials that Chopin was commissioned to photograph, a number of his portraits have been preserved, including portraits of Sir Frederick Barlee, Sir Malcolm Fraser and Sir Luke Leake. During the 1870s the photography market became very competitive, and Chopin began to tour country districts in search of custom.  His business declined nonetheless, and in June 1877 he was declared bankrupt.  According to Erickson (1983), \"many an old colonial family album of photographs is the richer for his work\"."]}, {"page": "Members of the Western Australian Legislative Council, 1832–1870", "response": ["|rowspan=\"9\"|Frederick Barlee80px"]}, {"page": "List of Trinidad and Tobago–related topics", "response": ["* Frederick Barlee"]}, {"page": "Forrest Highway", "response": ["The road was rebuilt by convicts in the 1850s, but by that decade, the importance of the coast road was diminishing. For most of its length, the road went through well-timbered, sandy limestone country of little value to agriculture, and settlers in the vicinity of the road were scarce.  In contrast, settlements had spread and prospered in the foothills of the Darling Scarp, and on 1 July 1853, Colonial Secretary Frederick Barlee announced a new proposal for a Perth–Pinjarra–Bunbury route along the foothills, with a  width, mostly following the alignment of previous tracks. Between 1864 and 1876, two parties of convicts were involved in the making of the road."]}, {"page": "Index of Trinidad and Tobago–related articles", "response": ["*Frederick Barlee"]}, {"page": "Worlingworth", "response": ["*Frederick Barlee (1827–1884), senior civil servant; Colonial Secretary of Western Australia from 1855 to 1875; Lieutenant-Governor of the British Honduras (now Belize) from 1877 to 1882; and Administrator of Trinidad in 1884"]}, {"page": "Members of the Western Australian Legislative Council, 1870–1872", "response": ["|| Sir Frederick Barlee || Colonial Secretary || 1855–1875"]}, {"page": "Members of the Western Australian Legislative Council, 1872–1874", "response": ["|| Sir Frederick Barlee || Colonial Secretary || 1855–1875"]}, {"page": "Robert John Sholl", "response": ["Between 1865 and 1881, Sholl was the most senior government official and only judicial officer in North West Australia between the Murchison River and Timor Sea – a jurisdiction known at the time as the North District.McCarthy, 2001, p33. (From 1883, the North District was sub-divided into three magisterial districts: \"Gascoyne\", \"Northern\" [i.e. Pilbara] and \"Kimberley\".) His headquarters at Roebourne was extremely isolated – messages took weeks to travel between Sholl and his immediate superior, Frederick Barlee, Colonial Secretary of Western Australia.The Parliament of Western Australia was far less powerful at the time.  While members of the Legislative Council ostensibly represented the North District sat from 1874, the Parliament's powers were highly limited until 1890, when responsible government was granted. Consequently,  Sholl wielded considerable, de facto executive power;Sholl’s paid positions apart from Resident Magistrate were Sub-collector of Customs & Internal Revenue, as well as Registrar of Births, Deaths & Marriages. He was also expected to perform religious services for the Church of England, which was the official church in Western Australia at the time). (See also Sholl's preliminary instructions from the Colonial Secretary of Western Australia, Frederick Barlee, in the quotation box on this page.) an obituary in The West Australian described him as having been \"virtually a Lieutenant Governor\" of the North District.", "Like his brother before him, RJ Sholl used editorials in The Inquirer to mount campaigns against officialdom.The Inquirer, 3 April, 24 April & 1 May 1861; Honniball 1979, pp37–43.  In particular, during 1861 he attacked the Colonial government, over an unpopular customs regulation. Inquirer articles singled out Governor Arthur Kennedy and called on the Imperial government to transfer Kennedy to another position. By contrast, Sholl and The Inquirer were very supportive of both Kennedy’s assistant, Frederick Barlee (Colonial Secretary of Western Australia in 1855–75) and his successor as Governor, John Hampton. Sholl's personal and professional connections to Barlee was long-lived and included their joint involvement in private businesses.For example, Barlee and Sholl were shareholders and office bearers of the Roebuck Bay Pastoral and Agricultural Association Limited.", "In 1881, Sholl was appointed Police Magistrate and Magistrate of the Local Court at Perth, and Resident Magistrate for the Swan District and Magistrate of the Local Court at Guildford. His successor as Resident Magistrate was Edward Hayes Laurence, nephew of Frederick Barlee (who had been transferred British Honduras as  Lieutenant-Governor in 1877)."]}, {"page": "Quaranup", "response": ["The necessity of a quarantine station arose after a number of incidences involving sickness aboard ships arriving in Albany lead to demands for a quarantine station to be built close to the port. These included an illness on the Bombay in 1865, suspected smallpox on the Rangatira in 1872 and a sick passenger aboard the Baroda the following year. No plans were made until a group of dignitaries including the Colonial Secretary, Frederick Barlee, were quarantined in tents during inclement weather on barren Mistaken Island for a period of two weeks. The irate officials then took an interest in having a permanent quarantine station close to the port. Tenders were called for and the facility was established in 1875. Initially the centre consisted of only a caretaker's cottage and jetty costing £530."]}]}}