{"wiki_id": "http://www.wikidata.org/entity/Q54959052", "itemLabel": "Gary Miller", "itemDescription": "UK music producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Gary_Miller_(music_producer)", "wikipedia_page": {"main": "Gary Miller (born 29 February 1960 in Kingston upon Hull, Yorkshire) is an English music producer, songwriter, arranger and multi-instrumentist. In his early years, Miller worked for the London production house Stock Aitken Waterman as staff producer, mixer, and songwriter, and was later part of the Metrophonic team. While at Stock Aitken Waterman and Metrophonic, he worked on songs for  Donna Summer, Lionel Richie, Kylie Minogue, Bananarama, and Simply Red, and was one of the producers of the David Bowie song Everyone Says 'Hi', which was released in 2002 on the album Heathen.Miller started his music career during the 1980s as a guitarist, touring with Nik Kershaw's backing band The Krew. In 1988, Miller was Musical Director for Deon Estus, who was the opening act for several shows on George Michael's The Faith Tour.The Musical Director for George Michael was Chris Cameron.Miller moved to Malibu, California, in 2006, where he started working as an independent producer on songs for various artists, including three unreleased remixes of  Katy Perry songs. In Malibu, Miller started the Rock Against Trafficking foundation to raise money and awareness to fight human trafficking. The mostly unreleased Rock Against Trafficking (RAT) album project, which was produced by Miller in 2014, is called \"Set Them Free\", and features The Police and Sting covers performed by various well-known artists, such as members of the rock band Journey, Heart, Carlos Santana, Slash, Julian Lennon, Ellis Hall, and En Vogue. The RAT flagship song \"Stand Up\" is an original, co-written by Miller with new artist AV!VA, and performed by AV!VA.  \"Roxanne\", the first single from the \"Set Them Free\" album, which was performed by Glenn Hughes of Deep Purple, has been released on 11 January 2018.", "link_mentions": [{"page": "Gary Miller", "response": ["Gary Miller may refer to:", "*Gary Miller (politician) (born 1948), American politician", "*Gary Miller (conductor) (born 1946), American conductor and gay activist", "*Gary Miller (sportscaster) (born 1956), former ESPN news anchor", "*Gary Miller (footballer) (born 1987), Scottish footballer with Carlisle United", "*Gary Miller (computer scientist), American computer scientist", "*Gary Miller (singer) (1924–1968), British pop singer", "*Dr. Know (guitarist) (Gary Miller, born 1958), guitarist of the punk band Bad Brains", "*Gary Miller (Prison Break character), character in U.S. TV series Prison Break", "*Gary Miller (music producer) (born 1960), British music producer"]}, {"page": "Border Girl", "response": ["*Gary Miller – keyboards, mixing, programming"]}, {"page": "Such a Shame", "response": [":A. \"Such a Shame\" (Remixed by Gary Miller) — 5:40", "#\"Such a Shame\" (Remixed by Gary Miller) — 5:40"]}, {"page": "Jett Prescott", "response": ["Jett Prescott revealed in recent interviews with “New Music Inferno”“New Music Inferno” Radio Interview Podcast #233 and red-carpet celebrity interviewer Jeffrey HendersonJeffrey Henderson Show 89.7 KLAS FM that he has relocated to Los Angeles from the east coast to focus on the recording of his first full-length album with producers PJ Bianco and Gary Miller.Hidden Gems: Meet Jett Prescott of PennyFly Entertainment Jett is additionally included on the forthcoming \"Set Them Free\" album alongside Slash, Fergie, Santana, Rob Thomas, Journey, and other artists in support of the Rock Against Trafficking project.Rock Against Trafficking Locals can find Jett performing venues such as The Lighthouse Café and Hollywood’s “The Piano Bar”.", "Shortly after receiving signing offers from Epic and Sony upon his relocation to Los Angeles, Jett made the decision to remain independent by founding PennyFly Entertainment, a \"by-artists-for-artists\" record company.Interview with business mogul Bob Pritchard PennyFly is a full-service entertainment company providing management and marketing services for artists and producers such as Gary Miller, Steve Thompson, Ricky Rebel, and Kim Se-hwang with projects including Rock Against Trafficking and Poo Bear's upcoming reality TV venture known as StarCrowd.Interview with Global Positive News PennyFly has worked with a variety of artists including Kodie Shane, Meredith O'Connor, Mary Wilson, Rebecca Black, Ruggero Pasquarelli, Minzy, and more across several projects.Billboard: ‘You Are Not Alone’, la canción que unió a más de 10 celebridades de todo el mundoClicheMag: You Are Not Alone Press Release"]}, {"page": "Ellis Hall (musician)", "response": ["Hall is involved with Gary Miller (producer for David Bowie, Donna Summer, Lionel Richie and others) in Rock Against Trafficking and Artists UNited Against Human Trafficking, a partnership between United Nations Office on Drugs and Crime and artists committed to working against the crime of trafficking in persons. He recorded his own version of Sting’s \"Let Your Soul Be Your Pilot\" for Rock Against Trafficking's compilation album as well as did the backend track for the classic \"Set Them Free\" from which comes the name of the album. On the 3-disc compilation Music To Inspire – Artists UNited Against Human Trafficking he provided the song \"Be the Change.\""]}]}}