{"wiki_id": "http://www.wikidata.org/entity/Q5498869", "itemLabel": "Frederick Toone", "itemDescription": "English cricketer and administrator, and rugby union footballer (1868-1930)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Toone", "wikipedia_page": {"main": "Sir Frederick Charles Toone (25 June 1868 – 10 June 1930), known as Fred Toone, was a cricket administrator, who in 1929 became the second man ever to be knighted for cricket-related activities. Unusually for a man who achieved such eminence in the game, he never played cricket at first-class level.", "link_mentions": [{"page": "British Union of Fascists", "response": ["* Frederick Toone was the manager of the England cricket team and Yorkshire Cricket Club."]}, {"page": "Yorkshire County Cricket Club", "response": ["Between 1900 and 1902, Yorkshire lost only twice in the County Championship, both times to Somerset, and won the County Championship in all three seasons largely thanks to their two outstanding all-rounders Hirst and Rhodes. When Joseph Wolstinholm retired as club secretary after the 1902 season, he was succeeded by Frederick Toone who held the post until his death in June 1930 and formed a successful liaison with Hawke. Toone and Hawke worked together to improve the terms and conditions of professional players' contracts. To 1914, they were paid £5 for a home match and £6 for an away match with a £1 win bonus. Players who had received their county cap were obliged to join the Cricketers' Friendly Society and were paid a winter wage of £2 a week.", "| Frederick Toone"]}, {"page": "Martin Hawke, 7th Baron Hawke", "response": ["Joseph Wolstinholm retired as Club Secretary after the 1902 season and was succeeded by Frederick Toone who had previously been the secretary at Leicestershire. With Wolstinholm gone, Hawke had the county offices moved from Sheffield to the more central location of Leeds.Hodgson, pp. 57–58. Yorkshire, now completely under Hawke's influence, went on to claim two more titles under his captaincy in 1905 and 1908; in the latter season, they were unbeaten.Hodgson, p. 252. What Swanton called \"Yorkshire's abundance of reserves\" was emphasised in 1905 when they won the title again despite contributing five of their best players to England in the Test series against Australia.", "Hawke's administrative career began in 1898 when, following the death of Michael Ellison, he was elected to succeed him as Yorkshire President and remained in office for forty years, in the first twelve of which he was also the Yorkshire team captain. He formed a successful liaison with Frederick Toone, who was club secretary from 1902 until his death in June 1930. Hawke praised Toone for increasing the membership from 3,000 in 1903 to over 7,000 ten years later.Hawke, Fifty years of Yorkshire county. They worked together to further improve the terms and conditions of the professional players' contracts. To 1914, they were paid £5 for a home match and £6 for an away match with a £1 win bonus. Players who had received their county cap were obliged to join the Cricketers' Friendly Society and were paid the winter wage of £2 a week.Hodgson, pp. 87–88."]}, {"page": "Arthur Gilligan", "response": ["The MCC tour took place against a background of social disturbance in Australia. There were concerns within Australian society over the growing influence of communism and, according to the historian Andrew Moore, some commentators hoped that the tour would help to ease tension.Moore, p. 165. It was expected that Gilligan's influence and popularity would further assist this process. However, during the tour, the Commonwealth Investigative Branch were informed by the London authorities that Gilligan and the MCC tour manager Frederick Toone were members of the British Fascists. Although the organisation never achieved the same level of influence in Britain as the British Union of Fascists, which formed in 1932, the British Fascists were popular for a short time during the mid-1920s.Moore, pp. 166–69. The primary focus of the organisation was to oppose communism, but MI5 considered its threat serious enough to warrant placing leading members under surveillance. In addition, the British Foreign Office were aware that the British Fascists had established some links overseas.Moore, p. 167. Moore suggests that it is possible that Gilligan and Toone used the tour as an opportunity to establish links in Australia. The team visited many parts of Australia and attended many social events which presented an opportunity to discuss politics. Shortly after the tour's conclusion, the Commonwealth Investigative Branch uncovered evidence that the British Fascists had established chapters in several Australian cities, although they did not know how this had happened. Moore believes that \"it may be totally coincidental that the Australian chapter of the British Fascists was established so soon after the MCC tour\", but is more likely that Gilligan and Toone brought Fascist literature to Australia for distribution.Moore, p. 169. However, Moore writes that \"the British Fascists' Australian operations were small beer indeed\" and of little consequence."]}, {"page": "Wilfred Rhodes", "response": ["In the Tests, Rhodes scored 238 runs at an average of 23.80, with a highest score of 73 in the fourth Test. In the first Test, a score of 45 took him past 2,000 Test runs. As a bowler, Rhodes took four Test wickets in the series at an average of 61.25; his best figures were three for 61 in the third Test. Rhodes later said that Douglas was reluctant to use him, believing his bowling would be ineffective on Australian pitches.Rogerson, p. 131. Wisden commented: \"It must be said, however, that in a summer of continuous sunshine – remarkable even for Australia – the bowlers received no help.\" Nevertheless, much of Rhodes's tour, according to A. A. Thomson, \"may be fairly regarded as failure.\" Tour manager and Yorkshire secretary Frederick Toone, with whom Rhodes had already had a disagreement during the 1920 season, apparently said that \"Wilfred's finished\", a remark later reported to Rhodes.Rogerson, pp. 124–5, 134.", "By 1927, Yorkshire wished to appoint a more competent and permanent captain, instead of continuing the succession of ineffective amateurs, and planned to ask Herbert Sutcliffe, a professional, to take the post. Frederick Toone encouraged Rhodes to offer his resignation as senior professional, possibly with a view to installing a new regime, but Rhodes declined.Rogerson, p. 151. Meanwhile, the proposed appointment of Sutcliffe caused controversy; some members of the county believed Rhodes should be appointed. Rhodes pointed out he had not been offered the captaincy, nor had his views been sought. He felt unappreciated when he was not offered first refusal of the captaincy. A poll of Yorkshire members showed a marked preference for Rhodes over Sutcliffe as captain; the disagreements persuaded Sutcliffe to decline the offer, and another amateur was appointed.Hill, pp. 111–3."]}, {"page": "Bill Bowes", "response": ["Soon afterwards, he was contacted by Yorkshire's secretary Frederick Toone following a request to Yorkshire by John Kaye. Toone recommended the engagement with MCC rather than Warwickshire, suggesting that Bowes would find greater scope for development at Lord's and, with Yorkshire's interests at heart, pointed out that he would be available to play for Yorkshire when not required by MCC. Bowes was impressed and turned down the Warwickshire offer. He quit his job at the estate agency and joined MCC on 15 April 1928, having negotiated a raise in his wage to £6 a week.Bowes, p. 19."]}, {"page": "Percy Fender", "response": ["During the MCC tour of Australia, England lost every game of the five-match Test series. Fender played infrequently and with little success during the early part of the tour.Streeton, p. 104. Douglas rarely used him as a bowler,Streeton, pp. 100–01. and for the first Test, he was omitted from the team at the last minute and was twelfth man.Streeton, pp. 104–05. He was eventually selected for the third Test; Jack Hearne was unavailable owing to illness, and Fender had recently been successful in a tour game.Streeton, pp. 99–100, 105. The tour manager Frederick Toone had suggested that Fender should replace Douglas as captain, an idea which had the support of two of the team's leading professionals,McKinstry, p. 196. but Douglas  refused.Streeton, pp. 98–99. Fender made his Test debut on 14 January 1921 but achieved little with bat or ball, partly owing to his lack of match practice in the preceding weeks.Streeton, p. 100. He dropped a catch from Charles Kelleway, who went on to score 147 runs.Streeton, p. 106. Nevertheless, Fender retained his place in the team for the remainder of the series. In the fourth Test, he took five for 122, and achieved five for 90 in the fifth and final game. He led the English Test bowling averages with 12 wickets at an average of 34.16, and was the only England spin bowler to make the ball turn on the hard Australian pitches, though he was not particularly accurate.Streeton, pp. 99–100. With the bat, he scored 59 in the fourth Test and passed 40 in two other innings. In the last game of the tour, against South Australia, Fender took 12 wickets, including seven for 75 in the first innings. In general, he withstood the hot weather better than his teammates, but his weak leg made fielding painful on the hard ground. In all first-class games on the tour, he scored 325 runs at 27.08 and took 32 wickets at 32.71."]}, {"page": "Yorkshire captaincy affair of 1927", "response": ["At the beginning of the 1927 season, Yorkshire secretary Frederick Toone approached Wilfred Rhodes to suggest that he should resign from his position as senior professional.The senior professional of a county side was the professional cricketer who had played for the team the longest. This player often influenced the playing style and tactics of the side. Rhodes declined, prompted by his wife's suspicion of a plot against him. This may have been an attempt by Yorkshire to clear the way for a new captain.Rogerson, pp. 149–50. Lord Hawke was in favour of appointing Herbert Sutcliffe, a professional who had opened the batting for Yorkshire since 1919. In addition to Rhodes, other professionals on the side had debuted for Yorkshire earlier than Sutcliffe. However, Sutcliffe was unusual among professionals: he had received a commission in the British Army in the First World War, his appearance was always immaculate and when speaking he altered his accent to fit what he considered a better class of society. Such characteristics were more common among amateur cricketers, and Sutcliffe in many ways behaved like one. While not particularly popular with his teammates, he was respected.Birley, pp. 226–27.Hill, pp. 105–6.Gibson, pp. 155–56."]}, {"page": "History of Yorkshire County Cricket Club (1883–1918)", "response": ["Joseph Wolstinholm retired as club secretary after the 1902 season and was succeeded by Frederick Toone who had previously been the secretary at Leicestershire.  Toone held the post until his death in June 1930 and formed a successful liaison with Hawke, who praised him for increasing the membership from 3,000 in 1903 to over 7,000 ten years later. Toone and Hawke worked together to improve the terms and conditions of professional players' contracts.  To 1914, they were paid £5 for a home match and £6 for an away match with a £1 win bonus.  Players who had received their county cap were obliged to join the Cricketers' Friendly Society and were paid a winter wage of £2 a week."]}, {"page": "Later cricket career of Jack Hobbs", "response": ["Australia dominated the five-Test series, beating England 5–0. The England players, led by Johnny Douglas, faced a strong bowling attack, featuring pace bowlers Jack Gregory and Ted McDonald, and the spinner Arthur Mailey. In addition, the bowlers proved ineffective on hard pitches and struggled to dismiss a strong Australian batting line-up.McKinstry, p. 193. After defeat in the second Test, Frederick Toone the MCC manager, suggested Douglas should be replaced as captain by Percy Fender. Hobbs supported such a move, but other professionals in the team were less certain. Although Fender was included in the team for the remainder of the series, Douglas retained the captaincy.McKinstry, p. 196."]}, {"page": "British Fascists", "response": ["At a more rank-and-file level, the group attracted a membership of middle- and working-class young men who spent much of their time in violent confrontations with similar men involved in the Communist Party of Great Britain; William Joyce was typical of this sort of low-level member. This domination by disgruntled members of the peerage and high-ranking officers meant that certain concerns not normally associated with the demands of fascism, such as anger at the decline of the large landowning agricultural sector, high levels of estate taxation and death duties, and the dearth of high-ranking civilian occupations considered suitable for the status of officers, were a central feature of the political concerns advanced by the British Fascisti. Other officials included Sir Michael Bruce, Arnold Leese, England cricket manager Sir Frederick Toone, England cricket captain Arthur Gilligan, John Baker White MP and Patrick Hannon MP."]}]}}