{"wiki_id": "http://www.wikidata.org/entity/Q5497828", "itemLabel": "Frederick Gamble", "itemDescription": "English cricketer (1905-1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Gamble_(cricketer)", "wikipedia_page": {"main": "Frederick Charles Gamble (29 May 1905 – 15 May 1965) was an English footballer and cricketer. Gamble was a right-handed batsman who bowled right-arm medium pace. He was born in Charing Cross, London.\nGamble originally played Minor Counties Championship cricket for the Leicestershire Second XI. He later made his first-class debut for Surrey in the 1933 County Championship against Oxford University at The Oval. Gamble played first-class cricket for Surrey from 1933 to 1935, making 19 first-class appearances, the last of which came against Oxford University. A bowler, he took 40 first-class wickets at a bowling average of 38.87, with best figures of 4/82. After being an infrequent member of the Surrey team, Gamble was relegated to the Second XI, who he played for until 1937.  He later played for Devon in the 1939 Minor Counties Championship.Prior to playing for Surrey, he had played football for Southall, Brentford, West Ham, Aldershot and Reading.He died in Lambeth, London on 15 May 1965.", "link_mentions": [{"page": "Southall F.C.", "response": ["* Frederick Gamble – Represented Brentford, West Ham, Aldershot and Reading and played first class cricket for Surrey between 1933 and 1935.", "* Frederick Gamble (Brentford, West Ham United)"]}, {"page": "Frederick Gamble", "response": ["* Frederick Gamble (cricketer) (1905–1965), English cricketer"]}, {"page": "1928–29 Brentford F.C. season", "response": ["|Frederick Gamble", "| style=\"text-align:left;\" |Frederick Gamble", "| style=\"text-align:left;\" |Frederick Gamble", "| Frederick Gamble"]}, {"page": "1930–31 Brentford F.C. season", "response": ["Brentford's 1930–31 season is notable for the amount of hat-tricks scored, with Billy Lane claiming three, Jack Lane two and Frederick Gamble one, which convinced West Ham United to sign Gamble in exchange for Les Wilkins in February 1931, despite Gamble having made only 13 appearances in just under two years. During the season, Billy Lane and Jack Lane each scored a hat-trick in the same match twice during a one-month period – in the 6–1 FA Cup first round victory over Ilford on 29 November 1930 and in the 8–2 league victory over Crystal Palace on Christmas Day. Jack Lane's only goal of the game versus Norwich City in the FA Cup second round on 13 December 1930 marked the first time in the club's Football League history that three players had reached 10 goals for the season prior to Christmas Day. The other goalscorers then on double figures were Billy Lane and Cecil Blakemore.", "|Frederick Gamble", "| style=\"text-align:left;\" |Frederick Gamble", "| style=\"text-align:left;\" |Frederick Gamble", "| Frederick Gamble"]}]}}