{"wiki_id": "http://www.wikidata.org/entity/Q5495501", "itemLabel": "Fred Housego", "itemDescription": "British broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Fred_Housego", "wikipedia_page": {"main": "Fred Housego (born 25 October 1944, Dundee, Scotland) is a former London taxi driver who became a television and radio personality and presenter after winning the BBC television quiz Mastermind in 1980. He did not give up his taxi licence when he began his media career and was still driving a cab in 2007.", "link_mentions": [{"page": "October 25", "response": ["*  1944   – Fred Housego, Scottish-English taxi driver and game show host"]}, {"page": "Mastermind (British game show)", "response": ["| 1980 || Fred Housego || King Henry II || Westminster Abbey || Tower of London"]}, {"page": "Hackney carriage", "response": ["*Fred Housego is a former London taxi driver who became a television and radio personality and presenter after winning the BBC television quiz Mastermind in 1980. "]}, {"page": "Danny Baker", "response": ["Baker's first mainstream break was as roving reporter-presenter on the Michael Aspel LWT regional magazine The Six O'Clock Show alongside former Mastermind winner and former London black cab driver Fred Housego. Paul Ross (brother of Jonathan Ross whom Baker had as his best man) was his researcher. During his stint on The Six O'Clock Show, Baker was filmed having an altercation with a British Rail press officer. This clip is often resurrected for clip shows and can be seen on YouTube."]}, {"page": "Round Britain Quiz", "response": ["Regional contestants have included Irene Thomas, John Julius Norwich, Fred Housego, Brian J. Ford, Patrick Hannan and Philippa Gregory. Current contestants include Marcus Berkmann, David Edwards, Adèle Geras, Stuart Maconie, Val McDermid and Paul Sinha."]}, {"page": "Croxley Green", "response": ["* Fred Housego, the 1980 BBC Mastermind winner, and sometime London black cab driver."]}, {"page": "Harris Academy St John's Wood", "response": ["* Fred Housego, taxi driver who went on to win Mastermind in 1980"]}, {"page": "Ingram Wilcox", "response": ["In 1980, Wilcox reached the final of Mastermind, but came third  (out of four) with 27 points, beaten by Fred Housego who won with 33 points.Channel 5 documentary 'TVs Biggest Gameshows: 50 Years of Fun' screened 29/12/20.  Wilcox's specialist subject was \"The Crusades 1095–1192\" in both his heat and the final, while in the semi-final he chose \"Mammals\"."]}, {"page": "Marcus Berkmann", "response": ["He is also credited as one of the writing team of the BBC Three comedy show Monkey Dust, and compiles the \"Dumb Britain\" column in Private Eye magazine. In 2009, he set up the quiz company Brain Men with Stephen Arkell and Chris Pollikett. His book A Shed of One's Own: Midlife Without the Crisis was serialised by BBC Radio 4 in its Book of the Week slot during 2012. In the same year, he replaced Fred Housego as Marcel Berlins' partner on Round Britain Quiz on BBC Radio 4."]}, {"page": "The Six O'Clock Show", "response": ["The Friday evening programme was launched on Friday 8 January 1982 and presented in front of a live studio audience by Michael Aspel with co-hosts Danny Baker, Andy Price and Janet Street-Porter. Later co-hosts included Paula Yates, Shyama Perera, former Page 3 model Samantha Fox, Chris Tarrant, Emma Freud and Mastermind champion Fred Housego."]}, {"page": "LWT News", "response": ["Rather than produce a conventional regional news programme on Fridays, LWT opted to air an hour-long local magazine show entitled The Six O'Clock Show, which was launched in January 1982 and presented by Michael Aspel with a team of various co-hosts and reporters including Danny Baker, Janet Street-Porter and Fred Housego."]}, {"page": "Housego", "response": ["*Fred Housego (born 1944), British game show contestant"]}]}}