{"wiki_id": "http://www.wikidata.org/entity/Q54959709", "itemLabel": "Peter Milner", "itemDescription": "Canadian neuroscientist", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Milner", "wikipedia_page": {"main": "Peter Milner (13 June 1919 – 2 June 2018) was a Canadian neuroscientist. He was the husband of Brenda Milner.\nBorn in Yorkshire, England, Milner worked at the British Air Defence Research and Development Establishment before moving to Canada in 1944. He was an electrical engineer, but became interested in neuroscience while Brenda was studying the subject at McGill University; he became a graduate student under the same supervisor as she, and later taught at McGill himself. In collaboration with James Olds, he is credited with the discovery of the brain's pleasure centre in 1954.Milner received the Gold Medal for Distinguished Lifetime Contributions to Canadian Psychology from the Canadian Psychological Association in 2005.", "link_mentions": [{"page": "George Armitage Miller", "response": ["Peter Milner, in a review in the Canadian Journal of Psychology, noted the book was short on concrete details on implementing the TOTE strategy. He also critically viewed the book as not being able to tie its model to details from neurophysiology at a molecular level. Per him, the book covered only the brain at the gross level of lesion studies, showing that some of its regions could possibly implement some TOTE strategies, without giving a reader an indication as to how the region could implement the strategy."]}, {"page": "Brenda Milner", "response": ["In 1941 Brenda met her husband, Peter Milner. Both Brenda and her husband were working on radar research. He was an electrical engineer who had also been recruited for the war effort. In 1944, they married and left for Canada where Peter had been invited to work with physicists on atomic research. They traveled to Boston on the ship the Queen Elizabeth together with \"war brides\" who were traveling to the United States to live with their husbands' families during the war. Upon arrival in Canada, she began teaching psychology at the University of Montreal, where she stayed for 7 years."]}, {"page": "Timeline of psychology", "response": ["* 1954 – James Olds and Peter Milner of McGill University discovered the brain reward system, involving the brain's pleasure center."]}, {"page": "List of neuroscientists", "response": ["|data-sort-value=\"Milner, P\"|Peter Milner"]}, {"page": "Brain stimulation reward", "response": ["Brain stimulation reward (BSR) is a pleasurable phenomenon elicited via direct stimulation of specific brain regions, originally discovered by James Olds and Peter Milner.  BSR can serve as a robust operant reinforcer. Targeted stimulation activates the reward system circuitry and establishes response habits similar to those established by natural rewards, such as food and sex. Experiments on BSR soon demonstrated that stimulation of the lateral hypothalamus, along with other regions of the brain associated with natural reward, was both rewarding as well as motivation-inducing. Electrical brain stimulation and intracranial drug injections produce robust reward sensation due to a relatively direct activation of the reward circuitry.  This activation is considered to be more direct than rewards produced by natural stimuli, as those signals generally travel through the more indirect peripheral nerves. BSR has been found in all vertebrates tested, including humans, and it has provided a useful tool for understanding how natural rewards are processed by specific brain regions and circuits, as well the neurotransmission associated with the reward system.", "In 1953, James Olds and Peter Milner, of McGill University, observed that rats preferred to return to the region of the test apparatus where they received direct electrical stimulation to the septal area of the brain. From this demonstration, Olds and Milner inferred that the stimulation was rewarding, and through subsequent experiments, they confirmed that they could train rats to execute novel behaviors, such as lever pressing, in order to receive short pulse trains of brain stimulation. Olds and Milner discovered the reward mechanisms in the brain involved in positive reinforcement, and their experiments led to the conclusion that electrical stimulation could serve as an operant reinforcer. According to B.F. Skinner, operant reinforcement occurs when a behavior is followed by the presentation of a stimulus, and it is considered essential to the learning of response habits. Their discovery enabled motivation and reinforcement to be understood in terms of their underlying physiology, and it led to further experimentation to determine the neural basis of reward and reinforcement. Since the initial discovery, the phenomenon of BSR has been demonstrated in all species tested, and Robert Galbraith Heath similarly demonstrated that BSR can be applied to humans."]}, {"page": "James Olds", "response": ["James Olds (May 30, 1922 – August 21, 1976) was an American psychologist who co-discovered the pleasure center of the brain with Peter Milner while he was a postdoctoral fellow at McGill University in 1954. He is considered to be one of the founders of modern neuroscience; also published as PDFOlds, Jameshuman nervous system :: Reward and punishment - Britannica Online Encyclopedia and received numerous distinctions ranging from election to the United States National Academy of Sciences to the Newcomb Cleveland Prize of the American Association for the Advancement of Science.", "Following his Ph.D., Olds went on to do postdoctoral work at McGill University under Donald Olding Hebb, where he made his most important discovery with Peter Milner.BBC NEWS | Programmes | Happiness Formula | Searching the brain for happiness Subsequently, Olds moved to UCLA, where he took his first academic appointment at the Brain Research Institute. In 1957 Olds was appointed associate professor in the Department of Psychology at the University of Michigan.J. Olds, 1960. Approach-avoidance dissociations in rat brain. American Journal of Physiology 199:965–968 He left Michigan in 1969 to become the Bing Professor of Behavioral Biology at the California Institute of Technology where he continued his research and led a large lab until his death in a swimming accident in August 1976. His last work was aimed at understanding the mechanisms of learning and memory."]}, {"page": "Timeline of psychiatry", "response": ["James Olds and Peter Milner of McGill University discovered the brain reward system."]}, {"page": "Milner (surname)", "response": ["*Peter Milner (1919–2018), British-Canadian neuroscientist "]}, {"page": "Deaths in June 2018", "response": ["*Peter Milner, 98, British-Canadian neuroscientist.Life Stories: Neuroscience pioneer Peter Milner taught at McGill"]}, {"page": "Milner, Peter", "response": ["#redirectPeter Milner"]}]}}