{"wiki_id": "http://www.wikidata.org/entity/Q5495388", "itemLabel": "Fred Harrison", "itemDescription": "English footballer (1880-1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Fred_Harrison_(footballer,_born_1880)", "wikipedia_page": {"main": "Frederick Harrison (2 July 1880 – 21 November 1969) was an English professional footballer who played as a forward for various clubs in the 1900s and 1910s.", "link_mentions": [{"page": "Harry Wood (footballer, born 1868)", "response": ["In 1902–03, Saints won their sixth (and last) Southern League title with Wood only missing two games, scoring 12 goals. By now he was sharing the goal-scoring with John Fraser (15 goals), dab Fred Harrison (17 goals in only 13 games) and Joe Turner (14 goals)."]}, {"page": "Albert Brown (footballer, born 1879)", "response": ["Brown was reputed to be the fastest sprinter in English football and was known as the \"Tamworth Sprinter\". His career at Southampton got off to a slow start, scoring only once in his first three games before injury forced him to miss three games in October/November 1901. On his return from injury, he started to score more freely and by Christmas he had scored seven goals. In his next game he doubled his tally for the season as he scored a club record seven goals in a match against Northampton Town at The Dell on 28 December 1901. His first goal came almost straight from the kick-off and within five minutes he had completed his hat trick. By half time Saints were 7–0 up, with Brown contributing four. He added three more in the second half as Saints completed the rout, winning 11–0 (the other goals came from Sam Meston (2), Fred Harrison and Archie Turner)."]}, {"page": "John Lewis (footballer, born 1881)", "response": ["Although rather small, Lewis was a clever forward but sometimes found his size a handicap against burly opponents. In his one season at The Dell, he formed a useful partnership with Fred Harrison as well as linking up well with fellow forwards, Frank Jefferis and George Smith. He made 24 Southern League appearances for The Saints and his 10 goals made him top scorer for the club in the 1907–08 league season."]}, {"page": "Edgar Bluff", "response": ["He made his league debut on 24 September 1904 and soon formed an exciting partnership with Fred Harrison. According to Holley & Chalk, \"his army discipline and training served him in good stead\" and \"he displayed a natural goal-scoring ability\", his heading being \"a strong feature of his game\". In his first season at The Dell he was top scorer (with George Hedley) with ten league goals, plus a further three in the FA Cup."]}, {"page": "Fred Mouncher", "response": ["Mouncher was born in Southampton and played as an amateur with local sides Fitzhugh Rovers and Southampton Cambridge. He started his professional career in the summer of 1903 at The Dell where he teamed up with his former colleague at Fitzhugh Rovers, Fred Harrison. He made his debut for Southampton on 26 September 1903 at outside left, replacing Joe Turner for one match. In February, he started a longer run as replacement to the injured John Fraser, and played a total of ten games as the \"Saints\" took the Southern League title for the sixth (and last) time."]}, {"page": "List of Fulham F.C. seasons", "response": ["|Fred Harrison", "|Fred Harrison"]}, {"page": "List of Southampton F.C. seasons", "response": ["|Fred Harrison", "|Fred Harrison", "|Harry BrownFred Harrison", "|Fred Harrison"]}, {"page": "Danny Shea (footballer)", "response": ["In 1911–12, Shea managed another two hat-tricks – against Brentford in a 7–4 win on 21 October 1911, and Norwich City in a 4–0 win on 5 April 1912 – to make it 24 goals in 41 appearances that season. He formed a great partnership with Fred Harrison and together they scored 40 goals in the season. As Shea's stock continued to rise, other clubs could not fail to notice the qualities of the skilful ball player and prolific scorer, and he was described by one football writer as having an \"uncanny ability to pass to himself\". He transferred to Blackburn Rovers halfway through the 1912–13 season for a then-record fee of £2000. Despite this, he still managed to appear as the east London club's top scorer for that season, totalling 15 goals in 15 league and cup games."]}, {"page": "Harry Brown (footballer, born 1883)", "response": ["Described as \"a clever ball player\", Brown had a \"deceptive style which often disconcerted his opponents\" thus giving his team-mates goal-scoring opportunities. He was also a goal-scorer in his own right and in his first season at The Dell he scored ten league and four FA Cup goals from a total of 23 appearances, thus making him the club's top goal-scorer (with Fred Harrison) for the 1905–06 season. Included in his goal tally were a hat-trick in a 9–1 victory over his home-town club, Northampton Town, on 27 January 1906 and two against local rivals, Portsmouth, in a 5–1 victory in the FA Cup on 13 January."]}, {"page": "Tom Barlow (English footballer)", "response": ["His performances at The Dell soon impressed the England selectors and he was chosen to represent \"The South\" in a trial match against \"The North\" played at White Hart Lane, although he was not selected for the national side. By early 1903, Barlow was beginning to feel \"homesick\" and following the return of Fred Harrison from injury in January he lost his place in the side, making only two further appearances at left-half. At the end of the season, when Saints won the Southern League title for the fifth time in seven years, Barlow was granted a transfer back to Burnden Park."]}, {"page": "Wally Radford", "response": ["In January 1906, he moved to the south coast, to join Southampton of the Southern League. The \"Saints\" finished the season as runners-up, and were hopeful of regaining the championship title in 1907, which they had won six times in the previous ten years. Radford made his debut in the opening match of the 1906–07 season, playing at centre-forward; after the team picked up only one point from the first three matches, Radford moved to outside-right, with Fred Harrison moving into the centre. This had little effect on the team's performances, and Radford lost his place to Frank Jefferis. Radford was recalled at the end of the season, initially replacing George Harris at inside-left, before three games back at centre-forward. In the first of these, away to Northampton Town on 6 April, Radford scored his only goals for the Saints in a 4–2 victory. Saints finished the season 11th in the League, their lowest position since joining the Southern League in 1894."]}, {"page": "Isaac Tomlinson", "response": ["Tomlinson only missed a handful of league matches in his one season with Southampton, scoring eight goals from his 29 appearances including a goal in the 9–1 victory over Northampton Town on 27 January 1906, helping the team to the runners-up spot. Tomlinson also appeared in all five FA Cup matches, the first of which came against local rivals, Portsmouth, on 13 January when Tomlinson and Fred Harrison combined on the right-wing to great effect, giving the Portsmouth left-back, George Molyneux, a torrid time with Tomlinson setting up Harrison's second goal with a \"perfect centre\" and scoring the fifth \"with a clinking drive\". Saints would go on to reach Round Four, defeating Middlesbrough of the Football League First Division 6–1 in Round Three (with Tomlinson again scoring), before going out to Liverpool."]}, {"page": "Alex Glen", "response": ["Glen was a \"dexterous, elegant dribbler (who) swerved and weaved with devastating effect\". He made his debut for the \"Saints\" in the opening match of the season, playing at inside-left in a 1–0 defeat at Swindon Town. For the next match, Glen switched to inside-right, where he soon formed a strong partnership with Frank Jefferis on the right side of the Saints attack, with Fred Harrison in the centre. Although Harrison was to finish the season as top-scorer with 12 league goals, Glen contributed 10, including two in a 5–1 defeat of Millwall on 6 October 1906. The combination of Glen, Jefferis and Harrison worked well until a loss of form resulted in both Glen and Harrison being dropped by manager Ernest Arnfield for the last six weeks of the season."]}, {"page": "Horace Glover", "response": ["In September 1911, he was persuaded to move to London, to join Southern League rivals, West Ham United, where he was re-united with his former Southampton teammate Fred Harrison, who had moved to Upton Park in the spring. Glover made his debut for the \"Hammers\" in a 5–0 victory over Reading on 23 September, but only spent one season in West Ham's first-team making 29 Southern League and five FA Cup appearances. In the FA Cup, Glover was part of the West Ham team that defeated Middlesbrough of the First Division in the Second Round in February 1912."]}, {"page": "Jimmy Soye", "response": ["In the summer of 1905, he moved to southern England to join Southampton of the Southern League. The \"Saints\" were anxious to regain the Southern League title which they had taken six times in the eight years up to 1904, but had finished in a disappointing third place at the end of the 1904–05 season. He made his debut away to Norwich City on 9 September 1905 when he played at inside-right in a 1–1 draw. Although Soye was only 5 ft 8 in tall, he was \"muscular and clever enough to avoid the more robust challenges\". He soon became an established member of the side, helping the forwards Fred Harrison and Harry Brown to score, as well as contributing the occasional goal himself, including both goals in a 2–1 victory against Queens Park Rangers on 4 November. As the season progressed, his form trailed off and by the end of January, he had lost his place to Frank Jefferis. At the end of the season, Southampton finished as runners-up, five points behind champions Fulham."]}, {"page": "George Harris (footballer, born 1877)", "response": ["Harry Brown moved to Newcastle United in the summer of 1906, enabling Harris to establish himself as the first-choice at inside-left. In the 1906–07 season, Harris formed an effective striking partnership with Fred Harrison and Alex Glen, scoring five goals from 28 league appearances, as the Saints finished eleventh, their lowest placing since the inauguration of the Southern league in 1894. Two of his goals came in a 5–0 victory over Brentford on 18 March 1907."]}, {"page": "Fred Harrison", "response": ["Fred Harrison may refer to:", "* Fred Harrison (Australian footballer) (1893–1979), Australian rules footballer", "* Fred Harrison (author) (born 1944), British author and economic commentator", "* Fred Harrison (businessman),  Australian businessman, CEO of Ritchies Stores", "* Fred Harrison (footballer, born 1880) (1880–1969), English footballer ", "* Fred Harrison (rugby league), English rugby league footballer who played in the 1910s "]}, {"page": "George Webb (footballer, born 1888)", "response": ["During his time with West Ham, Webb remained an amateur and his appearances were restricted by his business commitments. His fellow West Ham forward Danny Shea said that Webb \"led too crowded a life\". Illness in December 1911 ruled him out for most of the remainder of that season, with Fred Harrison taking over from him."]}, {"page": "George Carter (footballer, born 1866)", "response": ["Following his retirement, Carter was presented with a gold watch. He continued to work for the club, and in 1901 he became the manager of the reserve team, continuing in this role until the start of World War I, helping to develop the careers of players such as Fred Harrison, Frank Jefferis and Arthur Dominy."]}, {"page": "1900–01 Southampton F.C. season", "response": ["The new recruits included three players from Everton, full-backs George Molyneux and Bertram Sharp and centre-forward Wilf Toman as well as former Everton and England forward Edgar Chadwick, who would renew his partnership with Alf Milward which had been described as \"the best in the league\" during their time together at Everton. From local football, the club recruited two players who were to play a major role in the future of the club: Bert Lee would have two long periods with the club as a player before becoming a trainer from 1914 to 1935. Fred Harrison would remain at The Dell for seven years and become the club's main goalscorer, with 88 goals from 166 appearances.", "| Fred Harrison"]}, {"page": "1901–02 Southampton F.C. season", "response": ["The season opened with a 1–1 draw against New Brompton followed by two victories, including a 5–0 win over Watford in which Alex McDonald scored four goals. The match at Portsmouth's Fratton Park on 12 October ended in a 2–2 draw, in which the Saints \"were fortunate in escaping defeat\" when Albert Brown scored a late penalty after Pompey's player-manager Bob Blyth had handled the ball. C. B. Fry was making his first appearance of the season and was hit in the head by goalkeeper Jack Robinson, who was trying to punch the ball away. Fry took some time to recover and mistimed a challenge, allowing Bobby Marshall through to equalise Fred Harrison's opening goal.", "The final match of 1901 was the first visit of newly promoted Northampton Town to The Dell. The match, which was played on a \"slippery\" pitch, attracted a \"very small\" crowd to see the return of Jack Farrell (who had been at the centre of the dispute over the players' poor performance in the 1900 FA Cup Final). The fans who stayed away missed a match in which several records were set, which still stand over 100 years later. Albert Brown kicked off with a pass to the wings and immediately ran into the Northampton goal where he received a return pass that he shot into the net past Northampton's goalkeeper, Fred Cook. Although the goal was not timed, this is believed to be the fastest goal scored by a Southampton player from the kick-off. Within five minutes, Brown had scored a hat trick before Archie Turner added a fourth goal with an \"excellently timed\" shot from the right. The Northampton defenders were floundering in the mud, with one turning a long shot from Samuel Meston into his own net before Brown ran through the defence to add a sixth goal. The seventh goal came from Fred Harrison following up after his original shot had been only partially cleared. Before half-time, efforts from Harrison and Edgar Chadwick were disallowed for offside, leaving a half-time score of 7–0."]}, {"page": "List of people from Hampshire", "response": ["*Fred Harrison, footballer, was born in Winchester"]}, {"page": "1920–21 Southampton F.C. season", "response": ["On 19 March 1921, Southampton picked up their biggest win of the season when they beat Merthyr Town 5–0 at home, with Bill Rawlings becoming only the club's third player to score four goals in a league match (after John Fraser and Fred Harrison, the latter of whom scored five in two games, both in the 1902–03 season). Two 1–1 draws in two days against the league leaders at the end of the month left Southampton with too much ground to make up in the final period of the season. In the first game, at The Dell, the visitors equalised in \"the very last seconds\" which \"caused such excitement that several barriers at the Milton Road end [of the ground] collapsed, injuring several spectators\". In their last nine games of the season the Saints picked up just ten points, from two wins and six draws, which left them trailing five points behind Crystal Palace, who secured the only Second Division promotion place in the division. They finished just one point ahead of third-placed Queens Park Rangers and two ahead of Swindon Town in fourth place."]}]}}