{"wiki_id": "http://www.wikidata.org/entity/Q5498712", "itemLabel": "Frederick Seddon", "itemDescription": "British murderer", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Seddon", "wikipedia_page": {"main": "Frederick Henry Seddon (sometimes spelled Sedden) (21 January 1872 – 18 April 1912) was a British murderer hanged in 1912 for the arsenic poisoning murder of his lodger Eliza Mary Barrow.", "link_mentions": [{"page": "Rufus Isaacs, 1st Marquess of Reading", "response": ["As law officer, Isaacs handled many high-profile cases. As solicitor general, he appeared for the Admiralty in the George Archer-Shee case. As attorney general, he led the prosecutions of Edward Mylius for criminal libel against King George V (and was appointed KCVO shortly after), of poisoner Frederick Seddon (the only murder trial Isaacs ever took part in), and of suffragette Emmeline Pankhurst. He also represented the Board of Trade at the inquiry into the sinking of the RMS Titanic."]}, {"page": "HM Prison Pentonville", "response": ["* 1912: Frederick Seddon the poisoner, was hanged in the prison in 1912."]}, {"page": "John Ellis (executioner)", "response": ["Among the executions he performed were those of Hawley Harvey Crippen (known as Dr. Crippen) in 1910, Frederick Seddon in 1912, Sir Roger Casement in 1916, Herbert Rowse Armstrong in 1922, and of Edith Thompson in 1923. The ordeal of executing Edith Thompson in 1923 had a profound effect on Ellis. Thompson had collapsed in terror at the prospect of her hanging and, unconscious, had to be supported on the gallows by four prison warders. Various accounts report, \"that guards had to tie her to a small wooden chair before drawing the noose around her neck\", and that \"she was hanged in a bosun's chair\"."]}, {"page": "Thomas Pierrepoint", "response": ["Thomas Pierrepoint began working as a hangman in 1906 under the influence of his brother, Henry. His career spanned 39 years, and ended in 1946, by which time he was in his mid-seventies. During this time, he is thought to have carried out 294 hangings, 203 of which were civilians executed in England and Wales; the remainder were executions carried out abroad or upon military personnel. Among those he executed was the poisoner Frederick Seddon in 1912."]}, {"page": "Edward Marshall Hall", "response": ["Marshall Hall defended Frederick Seddon unsuccessfully in a notorious poisoning case in 1912. Seddon was hanged in 1912 for murdering Elizabeth Mary Barrow by administering large quantities of arsenic. Marshall Hall's challenge to the medical evidence, though showing an impressive grasp of the subject, was unsuccessful. Seddon, rather against counsel's wishes, insisted on giving evidence, and made a very bad impression. His manner struck observers as cold and unfeeling, and his obvious greed weakened the defence that the money he gained from Miss Barrow's death was not enough to tempt him to murder. Marshall Hall in later years said that Seddon would have been acquitted if he had not insisted on giving evidence."]}, {"page": "Flypaper", "response": ["The poisons used in some older types of flypaper could potentially be toxic to humans and other animals. Historically, metallic arsenic (a well-known toxin to humans) was used in flypaper. Arsenic extracted by soaking flypaper in water has been used by several convicted murderers, among them Frederick Seddon, Florence Maybrick, and the Angel Makers of Nagyrév."]}, {"page": "Decline of the English Murder", "response": ["Orwell excluded Jack the Ripper's murder spree as being \"in a class by itself\" and considered the cases of Dr. Palmer of Rugeley, Neill Cream, Mrs. Maybrick, Dr. Crippen, Frederick Seddon, Joseph Smith, Armstrong, Bywaters and Thompson, and an unnamed case from 1919, wherein the accused was acquitted."]}, {"page": "Frederick Henry Seddon", "response": ["#REDIRECT Frederick Seddon"]}, {"page": "Eliza Mary Barrow", "response": ["#REDIRECT Frederick Seddon"]}, {"page": "Eliza Barrow", "response": ["#REDIRECT Frederick Seddon"]}, {"page": "Elizabeth Mary Barrow", "response": ["#REDIRECT Frederick Seddon"]}, {"page": "Elizabeth Barrow", "response": ["*Eliza Mary Barrow, murdered by Frederick Seddon in 1911"]}, {"page": "Frederick Sedden", "response": ["#REDIRECT Frederick Seddon"]}, {"page": "Thomas Bucknill", "response": ["Among the notable cases tried before Bucknill was that in 1912 of poisoner Frederick Seddon, who, on being found guilty of murder appealed directly to Bucknill as a brother Mason and in the name of 'The Great Architect Of The Universe' to overturn the jury's verdict. According to some sources he gave the First Degree sign, according to others the Sign of Grief and Distress, begging for mercy. Bucknill is reported as having said, with some emotion: "]}, {"page": "Fred Seddon", "response": ["#REDIRECT Frederick Seddon"]}, {"page": "Filson Young", "response": ["In 1914 he made the first of four contributions to the \"Notable Trials\" series with an account of the trial of the Frederick Seddon and his wife. That year James Joyce's Dubliners was published by Grant Richards; Young had commended the book earlier when working as a reader for Richards. Joyce suggested that Young should write an introduction to the work which he preferred not to do.Richard Ellmann, James Joyce (1959)."]}, {"page": "Travers Humphreys", "response": ["In 1910 Humphreys appeared as Junior Counsel in the prosecution of H. H. Crippen for the murder of his wife, Cora Henrietta Crippen; and in 1912 he appeared for the prosecution against Frederick Seddon, who was found guilty of poisoning Eliza Mary Barrow. He appeared for the prosecution at the Old Bailey in 1915 with Archibald Bodkin (later Director of Public Prosecutions) and Cecil Whiteley (later KC) against George Joseph Smith, the 'Brides in the Bath' murderer. "]}, {"page": "March 1912", "response": ["* Frederick Seddon was convicted of the 1911 poisoning murder of Eliza Barrow in a British court. He would be hanged on April 18."]}, {"page": "April 1912", "response": ["** Frederick Seddon, 41, hanged at Pentonville Prison, England for the poisoning and murder of Eliza Barrow in 1911 (b. 1872)"]}, {"page": "Summa Iniuria", "response": ["Circumstantial evidence lawsuits are illustrated by the cases of Frederick Seddon, Marie Besnard, Steven Truscott, Graham Frederick Young, and some white-collar crimes.  Suggestibility and emotional biases of the jury as causes of wrongful court decisions are showed by the cases of Jesse Hill Ford, Joan Little, and Alger Hiss."]}, {"page": "Seddon (surname)", "response": ["*Frederick Seddon (1870–1912), British murderer"]}]}}