{"wiki_id": "http://www.wikidata.org/entity/Q5496886", "itemLabel": "Freddy Marks", "itemDescription": "British actor and composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Freddy_Marks", "wikipedia_page": {"main": "Frederick Marks (10 September 1949 – 20 May 2021) was an English actor, singer and entertainer. He was best known for being part of the musical trio Rod, Jane and Freddy which appeared in children's programming in the 1980s and 1990s.", "link_mentions": [{"page": "Rainbow (TV series)", "response": ["In 1981, Roger Walker was replaced by Freddy Marks as the third member of the singing trio, and Rod, Jane and Freddy were to become the show's best-remembered group of singers, eventually given their own spin-off show and establishing an identity in their own right outside of Rainbow. Valerie Heberden was replaced around this time by Malcolm Lord as George's puppeteer.", "At this time, more of the episodes were written by the cast members themselves, with Roy Skelton, Stanley Bates, Geoffrey Hayes and Freddy Marks all contributing a significant number of episodes to the show. A special 1,000th episode was screened in October 1986 around the time the show celebrated its 14th birthday, featuring a whole load of child viewers of the show joining the cast for a party, with Matthew Corbett and Sooty appearing as guest characters, alongside Christopher Lillicrap.", "*Rod, Jane and Freddy – a group of musicians who regularly featured on the show. When they debuted in 1974 they were 'Rod, Jane and Matt', Matt being Matthew Corbett (of The Sooty Show fame). Matt was replaced from 1977 by Roger Walker, before Freddy Marks, in turn, took over in 1981. Although initially confined to the song segment of the show, gradually Rod, Jane & Freddy began to feature more heavily in the episode's storylines during the show's run, often playing significant roles in the plot. Some of the early 80s episodes stated they lived in the Rainbow House and they were shown to have a bedroom of their own, although later episodes implied they lived next door. Rod, Jane & Freddy were very well-respected and looked up to by Zippy, George and Bungle, who admired their singing and rarely ever got into any conflict with them."]}, {"page": "Rod, Jane and Freddy", "response": ["The original trio consisted of Rod Burton, Jane Tucker and Matthew Corbett, when they were known as \"Rod, Matt and Jane\". Matthew left the trio in 1976 to continue hosting The Sooty Show after his father retired. Matthew was replaced by actor Roger Walker, whereupon the trio became known as \"Rod, Jane and Roger\". When Walker left in 1980 to continue his career in acting he was replaced by Freddy Marks, leading to the best-remembered incarnation of the trio.", "Freddy Marks died on 27 May 2021."]}, {"page": "Roger Walker (actor)", "response": ["He moved to Derby at an early age and was a drama teacher at Tupton Hall School in Derbyshire in the early 1970s, his first television appearance was as a replacement for Matthew Corbett as a singer on the popular children's television show Rainbow in 1976. He appeared on the show for four years, before being replaced by Freddy Marks in 1980."]}, {"page": "Jane Tucker", "response": ["After graduating she worked in repertory theatre, touring, TV, and radio, during which she met and eventually married Rod Burton and, together with him and Freddy Marks, formed the long-lasting musical trio Rod, Jane and Freddy. Burton and Tucker divorced in 1979, following which she went on to marry Marks; Tucker remained married to Marks until his death in 2021."]}, {"page": "1949 in the United Kingdom", "response": ["* 10 September – Freddy Marks, actor and musician (died 2021)"]}, {"page": "Rod Burton", "response": ["Burton formed part of Rod, Matt and Jane; a trio with Matthew Corbett and Jane Tucker. Their contribution to the show was to sing a song everyday invoking the theme of the day. Burton played banjo and guitar, Corbett played guitar and bass and Tucker played keyboards. When Corbett left in 1976, he was replaced by Roger Walker (the group became Rod, Jane and Roger). Walker was later replaced by Freddy Marks (making the group's name Rod, Jane and Freddy)."]}, {"page": "1949 in British television", "response": ["* 10 September – Freddy Marks, actor, singer and musician (died 2021)"]}, {"page": "Frederick Marks", "response": ["* Freddy Marks (1949–2021), musician"]}, {"page": "Freddie Marks", "response": ["#REDIRECT Freddy Marks"]}, {"page": "2021 in British television", "response": ["|Freddy Marks"]}, {"page": "2021 in the United Kingdom", "response": ["**Freddy Marks, English television actor and musician (Rod, Jane and Freddy) (b. 1949)."]}, {"page": "2021 in British music", "response": ["* 20 May – Freddy Marks, television actor and musician (Rod, Jane and Freddy), 71"]}, {"page": "Deaths in May 2021", "response": ["*Freddy Marks, 71, English musician (Rod, Jane and Freddy) and actor.Musician and TV presenter Freddy Marks dies aged 71"]}, {"page": "List of alumni of the Royal Central School of Speech and Drama", "response": ["* Freddy Marks"]}]}}