{"wiki_id": "http://www.wikidata.org/entity/Q5498260", "itemLabel": "Frederick Lehmann", "itemDescription": "British businessman and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Lehmann", "wikipedia_page": {"main": "(Augustus) Frederick Lehmann  (1826 – 22 August 1891) was a British businessman and Liberal Party politician who sat in the House of Commons in 1880.\nLehmann was born in Hamburg, the son of Leo Lehmann of Hamburg. He was the brother of Henri Lehmann and Rudolf Lehmann.\nLehmann stood unsuccessfully for parliament at  Middlesex in 1874 and Waterford in 1877. He was elected as the Member of Parliament (MP) for Evesham at a by-election in July 1880, by a majority of only two votes. A petition was lodged and the result voided. Scrutiny of the votes led to his opponent Frederick Dixon-Hartland being declared the winner in January 1881, with a majority of one vote.\n\nLehmann married Nina Chambers, daughter of Dr Robert Chambers of Edinburgh. Their social circle included Charles Dickens, George Eliot, Robert Browning, Lord Leighton, and other prominent figures. Their sons were Rudolf Chambers Lehmann (a Liberal politician), Frederick Hope Lehmann and Ernest Benzon Lehmann.  They had one daughter, Nina Frederika Mary Teba Lehmann, who married Sir Guy Theophilus Campbell.\nHis son Frederick had an affair with the actress Minnie Duncan (whose sister was the better known actress Emily Mary Duncan). Their two sons Frederic Archibald Duncan (b.1884) and John (Jack) Lehmann Duncan (b.1886) may not have known the identity of their father (who signed the register for their baptisms as 'Frederic Duncan, Gentleman'. Minnie lived in a large house in London (11 Montpelier Square, Knightsbridge) with her two sons and two servants. The 1891 census recorded her as 'Minnie Lehmann,' single. Minnie married Lt Col Hugh Charles Fortescue in 1892.\nFrederick Lehmann died in 1891 at the age of 65, leaving an estate valued at £543,098.", "link_mentions": {}}}