{"wiki_id": "http://www.wikidata.org/entity/Q5496781", "itemLabel": "Freddie Pethard", "itemDescription": "Scottish footballer (born 1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Freddie_Pethard", "wikipedia_page": {"main": "Frederick James Pethard (born 7 October 1950) is a former Scottish professional footballer. He was born in Glasgow.\nPethard began his career at Celtic but failed to make an impact on the first team and was released by the club. He signed for Cardiff City initially as understudy to the full back pairing of David Carver and Gary Bell but he eventually managed to break into the side and held his place for several years, despite suffering a number of minor injuries. He left in 1979 and signed for Torquay United where he spent three years before leaving league football. After leaving football Fred joined Devon Probation Service and subsequently became the manager of the Torbay Youth Offending Team.", "link_mentions": [{"page": "Freddy (given name)", "response": ["* Freddie Pethard (born 1950), Scottish retired footballer"]}, {"page": "Gary Bell (footballer)", "response": ["Whilst playing for Lower Gornal, Bell was spotted by Cardiff City and signed professional terms with the club, along with George Andrews for a combined transfer fee of £2,100, a record amount that still stands for Gornal Athletic. He made his debut in September 1966 as a left half against Wolverhampton Wanderers. His debut was far from impressive as he gave away two penalties during a 7–1 defeat by the Midlands side. He struggled to make an impact on the side until he was converted to a left-back by manager Jimmy Scoular and he established a strong full back pairing with David Carver. He was a virtual ever present from then on and was part of the Cardiff side that defeated Real Madrid 1–0 at Ninian Park in the 1970–71 European Cup Winners' Cup. During the game, Bell was tasked with marking Spanish international winger Amancio Amaro and swapped shirts with Pirri after the match. He was eventually displaced from the side by Freddie Pethard. He was loaned out to Hereford United during his last season at Cardiff and was allowed to join Newport County following his return who were managed by his former teammate Brian Harris."]}, {"page": "1971–72 Cardiff City F.C. season", "response": ["|DF||Freddie Pethard||11||0||0||0||0||0||0||0||1||0||12||0||0||0||"]}]}}