{"wiki_id": "http://www.wikidata.org/entity/Q5504973", "itemLabel": "Fritz McIntyre", "itemDescription": "British musician (1952-2021)", "wikipedia_url": "https://en.wikipedia.org/wiki/Fritz_McIntyre", "wikipedia_page": {"main": "Fritz McIntyre (2 September 1958 – 24 August 2021) was a British musician, most famous for his tenure as keyboard player in the original line-up of Simply Red.", "link_mentions": [{"page": "Simply Red", "response": ["The initial Simply Red line-up consisted of Mick Hucknall (vocals), David Fryman (guitar), Tony Bowers (bass), Fritz McIntyre (keyboards and vocals), Tim Kellett (brass and live backing vocals) and Chris Joyce (drums). Bowers and Joyce had both previously been members of post-punk bands The Durutti Column and The Mothmen; Kellett had also been a member of The Durutti Column, though not at the same time as Bowers and Joyce.", "*Fritz McIntyre – keyboards, vocals (1985–1996, died 2021)"]}, {"page": "Something Got Me Started", "response": ["* Fritz McIntyre – electronic piano and backing vocals", "Category:Songs written by Fritz McIntyre"]}, {"page": "Stars (Simply Red album)", "response": ["# \"Something Got Me Started\" (Hucknall, Fritz McIntyre) – 4:01", "* Fritz McIntyre – keyboards, backing vocals on \"Freedom\", additional vocals on \"Something Got Me Started\" and \"Wonderland\""]}, {"page": "Life (Simply Red album)", "response": ["Life is the fifth studio album by British pop and soul band Simply Red, released in 1995. The lead single \"Fairground\" became their first number 1 hit in the UK. Due to this success, the album also made #1 on the UK album chart. It also included \"We're in This Together\", the official theme song for Euro '96. This was also the last album to feature band members Fritz McIntyre and Heitor T P.", "* Fritz McIntyre – keyboards, backing vocals"]}, {"page": "Picture Book (Simply Red album)", "response": ["*Fritz McIntyre – keyboards and backing vocals"]}, {"page": "Greatest Hits (Simply Red album)", "response": ["# \"Something Got Me Started\" (Hucknall, Fritz McIntyre) – 4:00 from Stars"]}, {"page": "Men and Women (album)", "response": ["*Fritz McIntyre – keyboards and backing vocals"]}, {"page": "A New Flame", "response": ["* Fritz McIntyre – keyboards and backing vocals"]}, {"page": "Holding Back the Years", "response": ["The music video focuses on Mick Hucknall, who, while singing the song, walks through the English countryside and Whitby Abbey carrying luggage and thinking about his childhood memories and the difficult relationship he had with his father. The other members of Simply Red (except for Fritz McIntyre, who plays a one-man band) play local cricketers who greet Hucknall as he passes by. In the last part of the song, Hucknall is seen riding a train, the scenes for which were filmed at and around Goathland railway station on the North Yorkshire Moors Railway."]}, {"page": "Temper Temper (Temper Temper album)", "response": ["*Fritz McIntyre – organ, background vocals"]}, {"page": "Stars (Simply Red song)", "response": ["* Fritz McIntyre — electronic piano and backing vocals"]}, {"page": "It's Only Love Doing Its Thing", "response": ["*Fritz McIntyre - keyboards and backing vocals "]}, {"page": "Thrill Me (Simply Red song)", "response": ["\"Thrill Me\" is a 1991 song by British soul and pop band Simply Red. Written by Mick Hucknall and Fritz McIntyre, it was released as the fourth single from their fourth album, Stars. It reached number 33 on the UK chart in May 1992. The single also reached number five in Zimbabwe, number 30 in Ireland and number 58 in the Netherlands. It was later included on the band's compilation albums, Greatest Hits in 1996, Simply Red 25: The Greatest Hits in 2008 and Song Book 1985–2010 in 2013.", "Category:Songs written by Fritz McIntyre"]}]}}