{"wiki_id": "http://www.wikidata.org/entity/Q550918", "itemLabel": "Anita Wardell", "itemDescription": "British jazz musician and music educator", "wikipedia_url": "https://en.wikipedia.org/wiki/Anita_Wardell", "wikipedia_page": {"main": "Anita Wardell (born 23 August 1961) is an English jazz singer, renowned for her scat singing.Wardell was born in Guildford, Surrey, in England and raised in Australia. She won the BBC Best of Jazz Award in 2006, and lives in London. She teaches an annual jazz course in the Loire, France. Wardell is an accomplished scat singer and is noted for her vocalised version of Lee Morgan's solo from \"Moanin'\".", "link_mentions": [{"page": "Charles Mingus", "response": ["One of the most elaborate tributes to Mingus came on September 29, 1969, at a festival honoring him. Duke Ellington performed The Clown, with Ellington reading Jean Shepherd's narration. It was long believed that no recording of this performance existed; however, one was discovered and premiered on July 11, 2013, by Dry River Jazz host Trevor Hodgkins for NPR member station KRWG-FM with re-airings on July 13, 2013, and July 26, 2014. Mingus's elegy for Duke, \"Duke Ellington's Sound Of Love\", was recorded by Kevin Mahogany on Double Rainbow (1993) and Anita Wardell on Why Do You Cry? (1995)."]}, {"page": "Miles Ahead (album)", "response": ["Jon Hendricks had been working on vocalizing Miles' parts on the album for over 50 years, and Pete Churchill, on hearing this, approached him to talk about developing it with ensemble the London Vocal Project. Together they finished scoring all the parts and writing the lyrics, for the band parts as well as for Miles, which the LVP then rehearsed extensively. On February 17, 2017, the LVP performed the entire album at St Peter's Church in New York, which was funded by Quincy Jones. The soloists were Anita Wardell, Michele Hendricks, Kevin Fitzgerald Burke, and Jessica Radcliffe."]}, {"page": "Michael Garrick", "response": ["His own record label, Jazz Academy Records, features many albums by his Michael Garrick Jazz Orchestra and has trio, solo, quartet and other small groupings, some including singers Norma Winstone, Anita Wardell and Jacqui Dankworth. In 2010, Garrick began a collaboration with vocalist Nette Robinson. At the time of his death he had also begun to develop work with a quartet including vibraphonist Jim Hart, which would have reworked some of the music of the Modern Jazz Quartet and would have provided an echo of his own first quartet, half a century earlier. That year, he also participated in the release of a 1964 recording, The Girl with Brown Hair, featuring his trio (with Colin Barnes on drums and Dave Green on bass) backing Dick Morrissey.\"Review\",  Jazz Journal. Retrieved 7 May 2013.", "|With Mark Armstrong, Gabriel Garrick, Paul Jayasinha, Martin Shaw and Steve Waterman (trumpet), Brian Archer, Matt Coleman, Dave Holt, Bill Mee, Mark Nightingale and Malcolm Earl Smith (trombone), Paul Booth, Ben Castle, Mike Hall, Bob McKay, Jim Tomlinson and Matt Wates (sax), Dominic Ashworth (guitar), Paul Moylan (bass), Alan Jackson (drums), Anita Wardell (vocals)", "|With Mark Armstrong, Quentin Collins, Gabriel Garrick, Dave Priseman, and Nick Smart (trumpet), James Adams, Dave Eaglestone, and Mark Da Silva (trombone), Jamie Anderson, Paul Booth, Mick Foster, Martin Hathaway, Bob McKay and Matt Wates (reeds), Dominic Ashworth and Pete Callard (guitar), Paul Moylan (bass), Alan Jackson (drums), Anita Wardell (vocals)"]}, {"page": "BBC Jazz Awards", "response": ["* Best of Jazz: Anita Wardell"]}, {"page": "Martin Drew", "response": ["Al Cohn - Al Haig - Alan Skidmore - Alec Dankworth - Andrew Cleyndert - Anita O’Day - Anita Wardell - Art Farmer - Arturo Sandoval - Barbara Dennerlein - Barney Kessel - Benn Clatworthy - Benny Carter - Benny Goodman - Bill Holman - Bill Perkins - Bill Watrous - Bobby Hutcherson - Bobby Shew - Bobby Wellins - Bob Wilber - Bosko Petrovic - Buddy Childers - Buddy DeFranco - Bud Shank - Carmen McRae - Charles McPherson - Charlie Mariano - Chet Baker - Chico Freeman - Chucho Valdes - Clark Terry - Conte Candoli - Count Basie - Dame Kiri Te Kanawa - Dave Green - David Gazarov - David Mowatt - Davide Petrocca - Dexter Gordon - Dick Morrissey - Dizzy Gillespie - Eddie Daniels - Eddie \"Lockjaw\" Davis - Ella Fitzgerald - Frank Rossalino - Frank Wess - Freddy Hubbard - Gareth Williams - Gene Harris - George Coleman - Georgie Fame - Gil Evans - Hank Jones - Harold Land - Harry \"Sweets\" Edison - Herb Ellis - James Moody - James Morrison - Jean Alain Roussel - Jim Hart - Jim Mullen - Jimmy Smith - Jimmy Witherspoon - J.J. Johnson - Joe Henderson - Joe Pass - Joe Temperley - John Altman - John Critchinson - Sir John Dankworth - John Lewis - John Pearce - John Taylor - Johnny Griffin - Julian Joseph - Junior Mance - Ken Peplowski - Kenny Davern - Kenny Werner - Kilian Forster - Laurence Cottle - Laurie Holloway - Lanny Morgan - Lee Konitz - Lew Soloff - Liane Carroll - Manny Albam - Marion Montgomery - Mark Murphy - Michael Brecker - Michel Legrand - Milt Jackson - Monty Alexander - Mornington Lockett - Mundell Lowe - Niels-Henning Ørsted Pedersen - Nigel Hitchcock - Niki Harris - Oscar Peterson - Paul McCartney - Paul Morgan - Peanuts Hucko - Peter King - Phillipe Catherine - Phil Woods - Plas Johnson - Ralph Sutton - Randy Brecker - Ray Brown - Red Holloway - Robert Farnon - Robin Aspland - Roland Hanna - Ron Carter - Ron Mathewson - Ronnie Scott - Roy Eldridge - Ruby Braff - Scott Hamilton - Simon Spillett - Stan Getz - Stanley Turrentine - Stephane Grappelli - Steve Melling - Terence Blanchard - Terry Gibbs - Tete Montoliu - Tommy Smith - Toots Thielemans - Ulf Wakenius - Vic Lewis - Warren Vaché Jr. - Woody Herman - Zoot Sims."]}, {"page": "Daniela Clynes", "response": ["Her jazz collaborations include lyric writing for compositions by UK musicians Django Bates, Iain Ballamy, Martin Hathaway, Anita Wardell, and American guitarist Ron Affif."]}, {"page": "1961 in jazz", "response": ["* 23 – Anita Wardell, English singer."]}, {"page": "Juliet Kelly", "response": ["Kelly grew up in London and discovered her talent for singing whilst studying economics at university. Mentored by Anita Wardell she then went on to attend the postgraduate jazz course at the Guildhall School of Music and Drama."]}, {"page": "Chris McNulty", "response": ["She has worked with Paul Bollenback, Gary Bartz, Igor Butman, Tim Garland, Billy Hart, John Hicks, Ingrid Jensen, Peter Leitch, Mulgrew Miller, Ugonna Okegwo, Tony Reedus, Gary Thomas, Anita Wardell, and Matt Wilson."]}, {"page": "Born to Be Blue (Mel Tormé song)", "response": ["| Anita Wardell ||  Kinda Blue  || 2008"]}, {"page": "Liam Noble (musician)", "response": ["After his studies, Noble played with saxophonist Stan Sulzmann in duo and quartet performances. He then played in several bands, including those led by Harry Beckett, John Stevens and Anita Wardell. In 1997, Noble joined Bobby Wellins' band. In 2002, he received a commission from Birmingham Jazz to write a song cycle."]}, {"page": "List of years in jazz", "response": ["* 1961 in jazz, deaths of Alphonse Picou, Booker Little, Cuba Austin, Freddy Johnson, George Formby, Miff Mole, Nick LaRocca, Noah Lewis, Scott LaFaro, Stick McGhee, and Wilber Sweatman; births of Alan Steward, Alison Moyet, Anders Bergcrantz, Anita Wardell, Art Porter Jr., Audun Kleive, Bo Sundström, Bobby Broom, Boney James, Candye Kane, Carl Allen, Clark Tracey, David Kikoski, Eivind Aarset, El DeBarge, Enya, Everette Harp, Eyþór Gunnarsson, Flavio Boltro, Franck Amsallem, Gary Thomas, Gene Calderazzo, Harald Dahlstrøm, Igor Butman, Ivan Božičević, Ivo Perelman, Jarmo Savolainen, Joe Ascione, Kai Eckhardt, Karl Seglem, Keiko Matsui, Ken Stubbs, Kenneth Sivertsen, Knut Reiersrud, Kofi Burbridge, Koji Kondo, Lê Quan Ninh, Leon Bosch, LeRoi Moore, Makoto Ozone, Marcelo Peralta, Mark Lockheart, Marvin Smith, Michael Publig, Miguel \"Angá\" Díaz, Mike Nielsen, Mohammed Nazam, Mornington Lockett, Paolo Fresu, Paul Hanmer, Paul Wagnberg, Rachelle Ferrell, Ralph Bowen, Russel Blake, Steve Wilson, Tak Matsumoto, Tina May, Wynton Marsalis, and Xavier Desandre Navarre."]}]}}