{"wiki_id": "http://www.wikidata.org/entity/Q55076649", "itemLabel": "Percy Glading", "itemDescription": "English co-founder of the CPGB and Soviet spy", "wikipedia_url": "https://en.wikipedia.org/wiki/Percy_Glading", "wikipedia_page": {"main": "Percy Eded Glading ( 29 November 1893 – 15 April 1970) was an English communist and a co-founder of the Communist Party of Great Britain (CPGB). He was also a trade union activist, an author, and a spy for the Soviet Union against Britain, an activity for which he was convicted and imprisoned.\nGlading, who was born in Wanstead and grew up in East London, left school early to find work. Starting with menial jobs such as delivering milk, he found skilled work at the Stratford marshalling yards. Later, he worked as an engineer at the Royal Arsenal, which was then the national production centre for military materiel. Glading spent World War I at the Arsenal, and after the war, he chose to involve himself in working-class politics. He joined the forerunner of the CPGB, which he later founded with his friend Harry Pollitt and others.\nGlading was a national organiser for the CPGB and acted as its ambassador abroad, particularly to India. He was active in other groups, such as the National Minority Movement, and when he married, his wife, Elizabeth, joined him in his political activity. He was prominent in the Amalgamated Engineering Union (AEU), but his political activity resulted in dismissal from the Royal Arsenal, a security-sensitive post, as the government regularly dismissed those suspected of subversive activities from its employment. MI5 opened a file on him in 1925 and considered him an extreme communist. The OGPU and its successor, the NKVD (the Soviet secret police) kept in touch with him through a series of handlers (including Arnold Deutsch, who later recruited Kim Philby).\nAround 1934, Soviet Intelligence recruited Glading as a spy. Although he no longer worked at the Arsenal, he had maintained contact with men of similar sympathies who still did so. The Arsenal was of interest to the Soviets, who knew that Britain was on the verge of creating the biggest naval gun yet. Glading had set up a safe house in Holland Park, West London, where he photographed various sensitive plans and blueprints. Unbeknown to him, the secret service had infiltrated the CPGB in 1931, with an agent known later as \"Miss X\"—Olga Gray. Glading trusted her and involved her in his espionage activities and lodged her in the Holland Park safe house.\nHe was eventually arrested in January 1938 in the act of exchanging sensitive material from the Royal Arsenal at Woolwich. Predominantly due to the testimony of \"Miss X\", Glading was found guilty and sentenced to six years of hard labour.\nOn his release from prison near the end of World War II, he is reported to have found work in a factory and maintained close links with Pollitt and the CPGB. Glading died in Richmond on 15 April 1970 at 77.\n\n", "link_mentions": [{"page": "Harry Pollitt", "response": ["On 10 October 1925, Pollitt married Marjorie Brewer in Caxton Hall, Westminster. Marjorie Edna Brewer (b. 1902) was a communist schoolteacher; the marriage eventually produced a son and a daughter. His best man and witness was fellow CPGB activist and organiser Percy Glading, who would later be convicted of spying for the Soviet Union and imprisoned. A week later, Pollitt was one of 12 members of the Communist Party convicted at the Old Bailey on charges of seditious libel and incitement to mutiny. Pollitt was given a 12-month sentence as a previous offender, which he served in Wandsworth prison. Historian C. L. Mowat described the trial as \"the chief instance of a purely political trial in the interwar years\". ", "Pollitt also tasked Gray, whose class background would make her less conspicuous aboard an ocean liner than CPGB's mostly working-class membership, with delivering money, instructions, and a questionnaire to a contact in India. The strain of this mission caused Gray to resign as Pollitt's secretary, though she remained in touch with Percy Glading, and in 1937 provided evidence that led to the conviction of Glading on spying charges. ", "CPGB membership, including Harry Pollitt, were the subject of continual monitoring efforts by the British security services throughout the 1930s, 40s, and 50s. These included the planting of a listening device in their King Street offices in 1942. MI5 also had an unidentified source close to Percy Glading who regularly reported to them of Pollitt's doings, including Pollitt's dissatisfaction  with Reg Birch, and both MI5 and Special Branch had sources at Pollitt's 60th birthday celebrations."]}]}}