{"wiki_id": "http://www.wikidata.org/entity/Q550313", "itemLabel": "Phil Taylor", "itemDescription": "English darts player", "wikipedia_url": "https://en.wikipedia.org/wiki/Phil_Taylor_(darts_player)", "wikipedia_page": {"main": "Philip Douglas Taylor (born 13 August 1960) is an English former professional darts player. Nicknamed The Power, he dominated darts for over two decades and won 214 professional tournaments, including a record 85 major titles and a record 16 World Championships. In 2015, the BBC rated Taylor among the ten greatest British sportsmen of the last 35 years. He is the richest and most successful darts player in history.\nTaylor won eight consecutive World Championships from 1995 to 2002, reached 14 consecutive finals from 1994 to 2007 and reached 21 world finals overall, all of which are records. He held the world number one ranking for thirteen years in total, including eight in a row from 2006–2013. He won 70 PDC Pro Tour events, which was a record until Michael van Gerwen passed it in February 2019. Taylor hit a record 11 televised nine-dart finishes (and 22 overall). He was also the first person to hit two nine-dart finishes in the same match.Taylor played in competitions organised by the British Darts Organisation (BDO) until 1993. Amidst growing disenchantment with the BDO, he was among 16 top players who broke away to form their own organisation, the World Darts Council, now known as the Professional Darts Corporation (PDC). He won the PDC Player of the Year award six times (2006, 2008, 2009, 2010, 2011 and 2012) and was twice nominated for the BBC Sports Personality of the Year, in 2006 and 2010; in the latter event he finished as runner-up, making him the only darts player ever to finish in the top two. He was inducted into the PDC Hall of Fame in 2011. Taylor retired from professional darts after the 2018 World Championship.", "link_mentions": [{"page": "England", "response": ["Darts is a widely popular sport in England; a professional competitive sport, darts is a traditional pub game. The sport is governed by the World Darts Federation, one of its member organisations is the British Darts Organisation (BDO), which annually stages the BDO World Darts Championship, the other being the Professional Darts Corporation (PDC), which runs its own world championship at Alexandra Palace in London. Phil Taylor is widely regarded as the best darts player of all time, having won 187 professional tournaments, and a record 16 World Championships. Trina Gulliver is the ten-time Women's World Professional Darts Champion of the British Darts Organisation. Another popular sport commonly associated with pub games is Snooker, and England has produced several world champions, including Steve Davis and Ronnie O'Sullivan."]}, {"page": "1960", "response": ["** Phil Taylor, English darts player"]}, {"page": "Stoke-on-Trent", "response": ["The city has a sporting Hall of Fame, opened in 2011 to honour sporting legends from the city. As of March 2011, it holds the names of Stanley Matthews and Phil Taylor, legends of football and darts respectively, were the first names to be inducted into the Hall of Fame. They were quickly followed by Port Vale legend Roy Sproson, and England's World Cup winning goalkeeper Gordon Banks (who spent five years with Stoke City).", "The World Professional Darts Championship was hosted in the Jollees venue in the south of the city from 1979 to 1985. Phil Taylor has won the World Championship a record 16 times, winning the championship in both the Professional Darts Corporation (PDC) and British Darts Organisation (BDO). Two-time PDC World Champion Adrian Lewis and two-time BDO World Champion Ted Hankey are also from the Stoke area. Other well-known players from or based in Stoke include Chris Mason, Andy Hamilton and Ian White."]}, {"page": "Port Vale F.C.", "response": ["The club's most famous supporter is singer Robbie Williams, who was raised in Stoke-on-Trent. Before administration in 2012, he was a major shareholder, having bought £240,000 worth of available shares in the club in February 2006.\"Robbie buys into Vale\", BBC Stoke & Staffordshire, 27 February 2006 For this investment, a restaurant at Vale Park is named after him. For the football game FIFA 2000, he provided an original theme song with \"It's Only Us\", on the condition that Port Vale should be included in the game, which they were, located in the Rest of World section. This song was also featured on the only FIFA Soundtrack CD release by EMI. In 2005 Williams founded Los Angeles Vale F.C., a Super Metro League team in the United States, named after Port Vale and based at his L.A. home. His best friend, TV presenter Jonathan Wilkes, is also a Vale fan. Another famous fan is darts legend Phil Taylor; Burslem born, \"The Power\" is a 16 time world champion of the sport. The singer Simon Webbe was signed up to the club's youth side as a teenager until a torn ligament at age seventeen put an end to any sporting ambitions. The children's illustrator and author Bob Wilson, is also a fan. His Stanley Bagshaw series of books is set in an area based on Stoke, and the protagonist supports a thinly disguised version of the Vale; even basing a book on their 1954 Cup run – albeit with a successful conclusion."]}, {"page": "1992 in sports", "response": ["Phil Taylor (darts player) won his second world title"]}, {"page": "1990 in sports", "response": ["* Phil Taylor (darts player) wins his first world title"]}, {"page": "Culture of the United Kingdom", "response": ["A great number of major sports originated in the United Kingdom, including association football, golf, tennis, boxing, rugby league, rugby union, cricket, field hockey, snooker, darts, billiards, squash, curling and badminton, all of which are popular in Britain. Another sport invented in the UK was baseball, and its early form rounders is popular among children in Britain.Rounders (English game) Britannica Online Encyclopedia Snooker and darts are popular indoor games: Stephen Hendry is the seven time world snooker champion, Phil Taylor is the 16 time world darts champion. Snooker player Alex Higgins (nicknamed The Hurricane) and darts player Eric Bristow (nicknamed The Crafty Cockney) are credited with popularising each sport."]}, {"page": "List of sports announcers", "response": ["* Phil Taylor – Sky Sports 2018"]}, {"page": "Darts", "response": ["| Phil Taylor (1)", "| Phil Taylor (2)", "| Phil Taylor (3)", "| Phil Taylor (4)", "| Phil Taylor (5)", "| Phil Taylor (6)", "| Phil Taylor (7)", "| Phil Taylor (8)", "| Phil Taylor (9)", "| Phil Taylor (10)", "| Phil Taylor (11)", "| Phil Taylor (12)", "| Phil Taylor (13)", "| Phil Taylor (14)", "| Phil Taylor (15)", "| Phil Taylor (16)", ":16 Phil Taylor The Power (2 BDO, 14 PDC)"]}, {"page": "Power", "response": ["* Phil Taylor (darts player) (born 1960), English darts champion nicknamed \"The Power\""]}, {"page": "World Professional Darts Championship", "response": ["|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor||16||2||14", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor"]}, {"page": "Andy Fordham", "response": ["On 21 November 2004, Fordham, as reigning BDO world champion, faced off against Phil Taylor, the reigning PDC world champion, in a best-of-13-sets match at Purfleet's Circus Tavern. The special pay-per-view event was billed as \"The Showdown\" and was promoted and broadcast by Sky Sports. During the match, Fordham became unwell and complained of shortness of breath. He took a break after the seventh set and was advised not to continue by medical staff at the venue. Taylor was leading the match 5–2 at the time and declared the winner by default.", "While getting an exercise regime underway to try to lose some weight, in January 2005 Fordham returned to the Lakeside World championship as defending champion, but was defeated 3–2 in the first round by Dutchman Vincent van der Voort. He failed to progress past the first round of any of the other BDO majors that year, although he did reach the final of the Masters of Darts event, where he lost 7–1 to Phil Taylor.", "|  Phil Taylor"]}, {"page": "Ted Hankey", "response": ["In the 2010 Grand Slam of Darts he defeated Phil Taylor 5–4 in the group stages, giving him 2 wins out of 2. He then went on to defeat Michael van Gerwen, also 5–4, to proceed to the knockout stage of the competition. As the competition progressed the crowd began to get under the skin of Hankey once more, again booing as he threw his darts and ignoring requests from the referee to quieten down during the throws. Hankey was knocked out of the competition by Steve Beaton in the first knockout stage. During the match he won a potentially crucial leg and after pumping his fist and shouting \"Get in there\" he proceeded to a prolonged ourburst at the crowd. In the post-match interview he was particularly scathing of the crowd and the organisers for not controlling their behaviour, describing the crowd as \"a bunch of muppets\". Despite getting an initial warm response from the crowd (and Hankey was seen smiling and taking the pantomime booing in good spirit) Hankey indicated after last year's defeat that he would not return for the 2011 event should he indeed qualify for it."]}, {"page": "Justin Hawkins", "response": ["In 2005, Hawkins set up a solo project, called British Whale. His debut single, \"This Town Ain't Big Enough for Both of Us\", a cover of the 1974 hit by Sparks, was released on 15 August, reached No. 6 on the UK Singles Chart and featured multiple World Darts Champion Phil Taylor in the video. In 2006 Hawkins released a second single, available only to download, an unofficial World Cup anthem called \"England\"."]}, {"page": "Matthew Stevens", "response": ["His father Morrell, who was also his manager, died unexpectedly in 2001, after which Stevens had a few uneventful seasons. He was a close friend of Paul Hunter and was a pallbearer at his funeral. He is also a celebrity Texas hold 'em poker player and in 2004 won the UK's richest poker tournament at just 27 years old, beating 16-time World Darts champion Phil Taylor to first place. Stevens had only been playing poker for 18 months before his victory."]}, {"page": "Bullseye (British game show)", "response": ["On 19 May 2007, another one-hour long celebrity special was aired on ITV, this time as part of Vernon Kay's Gameshow Marathon. This time the contestants were newsreader Andrea Catherwood, footballer Graeme Le Saux and another Coronation Street star, Michael Le Vell, paired with professional darts players Martin Adams, Phil Taylor and Raymond van Barneveld respectively. Once again, Tony Green reprised his co-host role.  Jim Bowen did not appear on the Bullseye episode; instead, he appeared on the marathon's remake of The Golden Shot, acting as \"Bowen the Bolt\" (instead of \"Bernie the Bolt\").  At one point, he did make the comment to Kay, \"Vernon, this is a bit like Bullseye used to be...throwing arrows for prizes!\""]}, {"page": "Leighton Rees", "response": ["It is because of this that he is credited alongside the likes of Lowe, Eric Bristow, Bob Anderson, Jocky Wilson, Cliff Lazarenko and now Phil Taylor as bringing darts to the masses via the television screens. He had a good record on Bullseye, scoring more than 301 with nine darts on at least six appearances in eight and thus having his charity money doubled."]}, {"page": "Sparks (band)", "response": ["After Balls, the band resurfaced in 2002 with the release of an album described as their \"genre-defining opus\" – Lil' Beethoven, featuring quasi-classical arrangements of strings and choirs. Lil' Beethoven led to renewed interest in the band. Record Collector magazine named the album as one of its \"Best New Albums of 2002\", describing it as \"...possibly the most exciting and interesting release ever from such a long-established act\" and later in 2003 saying \"...it really does feel like one of the best albums ever made.\" A UK and European tour had the band playing the entire album each night in the first half of the show, with fan favourites making up the second. The line-up now included former Faith No More guitarist Dean Menta in addition to Tammy Glover on drums. Long-time fan Morrissey invited Sparks to perform at the 2004 Meltdown Festival, of which he was curator. They performed their breakthrough Kimono My House album, followed by Lil Beethoven, both in their entirety. Also in this period, the duo appeared in the music video for the Darkness' Justin Hawkins's cover of \"This Town Ain't Big Enough for Both of Us\", in which Ron and Russell play the referee and MC at a darts match between Hawkins and darts champion Phil Taylor. This version of \"This Town\" reached No.6 in the UK charts. Sparks would later release Lil' Beethoven's closing track Suburban Homeboy as a single."]}, {"page": "Eric Bristow", "response": ["During the Swedish Open in November 1986, Bristow found himself unable to let go of his darts properly – a psychological condition known as dartitis, similar to the yips in golf. He was never the same player again, but did regain the number-one ranking briefly in late 1989 and early 1990 before losing his form again. He had a last hurrah at the highest level of professional darts when reaching the semi finals of the 1997 WDC World Darts Championship at the Circus Tavern, where he narrowly lost to Phil Taylor 4–5 in sets.", "==Mentoring Phil Taylor==", "In the 1980s, Bristow came across Phil Taylor, then a raw young darts talent in Stoke-on-Trent. He sponsored him with about £10,000 to fund his development in the game, on the understanding that the money would be repaid. Taylor went on to usurp his mentor as the greatest darts player ever, with Bristow often on the receiving end of his brilliance.", "Bristow's form deteriorated in the early 1990s and he was dropped from the Merseyside team in 1992. Bristow had joined Merseyside, his third county, in 1988, after previously playing for London from 1976–1980 and for Staffordshire from 1980–1988. With Merseyside, Bristow played with his international teammate Kevin Kenny, and after being dropped by Merseyside, he was dropped from the England national side later the same year. The split within darts saw Bristow become a founding member of the Professional Darts Corporation. At the World Matchplay event in Blackpool, Bristow made six appearances without winning a match. His swansong came in a classic semi-final at the 1997 PDC World Championship, which he lost to his protégé, Phil Taylor. Bristow's last appearance came at the World Championships in 2000, ending his 23-year run of playing in a world championship. He stopped playing professionally after the event.", "*1990: Runner Up (lost to Phil Taylor 1–6)", "*1997: Semi Finals (lost to Phil Taylor 4–5 & lost 3rd Place Match to Peter Evison 2–4)", "|  Phil Taylor "]}, {"page": "John Lowe", "response": ["Lowe is one of only six players to have won the World Championship three or more times, and was the first person to win it in three separate decades; along with Phil Taylor, he remains one of only two players to achieve this. Amidst growing dissatisfaction with the British Darts Organisation, Lowe was also one of 16 players who in 1993 broke away to form their own governing body, the World Darts Council (now known as the Professional Darts Corporation).", "*1992: Semi-finals (lost to Phil Taylor 4–5)", "*1995: Semi-finals (lost to Phil Taylor 4–5)", "*1996: Semi-finals (lost to Phil Taylor 1–5)", "*1999: 2nd round (lost to Phil Taylor 1–3)", "|  Phil Taylor"]}, {"page": "Nine-dart finish", "response": ["The feat was first achieved on television by John Lowe in 1984, and has since been via this medium a total 64 times. Paul Lim was the first to hit a nine-darter in World Championship, making history during the 1990 BDO World Darts Championship in a second-round victory over Jack McKenna. Phil Taylor has achieved the most on television with 15, his first coming in 2002 and his last in 2015. Taylor is the only player to achieve two nine-darters in the same match, doing so in the final of the 2010 Premier League Darts against James Wade. The following year, Brendan Dolan became the first to accomplish a nine-darter by starting and finishing with a double, as per the format of the World Grand Prix event of that year. ", "The first televised nine dart finish was achieved at the MFI World Matchplay on 13 October 1984 by John Lowe, who used the third method (with the T17 first, then T18, D18) above as his outshot after scoring two maximum 180s. For this he received a prize of £102,000, and he went on to win the whole event. This nine dart finish was not broadcast live, nor was Paul Lim's nine dart finish at the 1990 Embassy World Championship. The first ever live broadcast nine dart finish was performed by Shaun Greatbatch against Steve Coote in the Final of the Dutch Open on 3 February 2002, while Phil Taylor achieved the first live nine-darter broadcast on British television during the 2002 World Matchplay.", "The first player to manage the outshot in the World Championship was Paul Lim on 9 January 1990 against Jack McKenna. He favoured the first method of those listed above for his outshot. Lim won a £52,000 bonus for the feat, which was more than the eventual tournament winner Phil Taylor who received £24,000 for becoming World Champion. In the 2018 PDC World Darts Championship, Lim missed double 12 in his second round match against Gary Anderson, which would've made him the first player to do a nine-dart finish in both versions of the World Darts Championship.", "Even with two versions of the World Championship in operation, Lim's achievement was not repeated for nearly 19 years until 2 January 2009, when Raymond van Barneveld became only the second person to achieve the feat and the first since the split in darts.  The finish came against Jelle Klaasen at the quarter-final stage of the 2009 PDC World Darts Championship at the Alexandra Palace, and he claimed a £20,000 bonus prize (having rolled over from three previous tournaments since Phil Taylor's nine-darter at the 2008 UK Open). On 28 December 2009 he repeated the feat at the 2010 PDC World Darts Championship during his second round clash with Brendan Dolan netting him a £25,000 prize.", "Phil Taylor has achieved this feat more than any other darts player on television,Planet Darts Phil Taylor profile  having done so 11 times. The first came on 1 August 2002 during a quarter final tie against Chris Mason, at the 2002 PDC World Matchplay in Blackpool.Video of Phil Taylor's 9 dart finish v Chris Mason – World Matchplay 2002  Google Video It was the first live-televised nine-dart finish on British television, and Taylor received £100,000.", "The 2007 International Darts League became the first televised tournament to witness two nine-darters when Phil Taylor's 9-dart finish against Raymond van Barneveld was matched the following day (9 May) by another perfect game from Tony O'Shea against Adrian Lewis.", "| Phil Taylor ||  Chris Mason", "| Phil Taylor   ||  Matt Chapman", "| Phil Taylor   ||  Roland Scholten", "| Phil Taylor   ||  Raymond van Barneveld", "| Phil Taylor  ||  Wes Newton", "| Phil Taylor  ||  Jamie Harvey", "| Phil Taylor  ||  James Wade", "| Phil Taylor  ||  James Wade", "| Phil Taylor  ||  Kevin Painter", "| Phil Taylor  ||  Michael Smith", "| Phil Taylor  ||  Peter Wright", "!scope=\"row\" | Phil Taylor", "| Phil Taylor (3), Raymond van Barneveld (2), Adrian Lewis (2), Simon Whitlock, Michael Smith, Peter Wright, , ", "| Phil Taylor (4), Michael van Gerwen (2), Mervyn King, Gary Anderson, Jonny Clayton", "| Phil Taylor (2), Raymond van Barneveld, John Part, Michael van Gerwen, Wes Newton, Gary Anderson", "| Phil Taylor, Tony O'Shea", "| Phil Taylor"]}, {"page": "Jocky Wilson", "response": ["*In 2019, BBC Scotland broadcast an hour-long documentary about his life called Jocky Wilson Said. The programme featured contributions from Bobby George, Phil Taylor, John Lowe and Bob Anderson, as well as close friends of Jocky. The voiceover consisted of Jocky's own words and was performed by actor Clive Russell. The programme won Best Sports Documentary at the Celtic Media Awards 2020."]}, {"page": "Sport in the United Kingdom", "response": ["Darts is another British centred sport with an assured place in the attention of the British sporting public. The two rival Darts World Championships have been held in the United Kingdom since their inception. The BDO World Championship began in 1978 and the first PDC World Championship was in 1994. Phil Taylor of Stoke has won more World Championships than any other player."]}, {"page": "Burslem", "response": ["Professional darts player Phil Taylor is from Burslem.", "Burslem's most famous sons include the potter Josiah Wedgwood, the watercolour painter James Holland (1800–1870), Ian \"Lemmy\" Kilmister, the founder, bassist and lead singer of Motörhead, and Robbie Williams, who was a major shareholder in Port Vale and whose family are still resident in the area. Darts legend and 16-time world champion Phil Taylor was born, raised and also worked in the town."]}, {"page": "Stephen Gately", "response": ["After winning the 2009 PDC World Darts Grand Prix, Phil Taylor dedicated the trophy to the fallen singer after beating Raymond Van Barneveld 6-3 in the final."]}, {"page": "January 2005 in sports", "response": ["**Defending PDC world champion Phil Taylor powers through to the semi-finals of the Ladbrokes World Championships (BBC)"]}, {"page": "Raymond van Barneveld", "response": ["From January to June 2008, he was the world's number one ranked player. His victory over Phil Taylor in the 2007 PDC World Championship final, added to his four previous BDO World Championships brought him level with Eric Bristow as a five-time world champion; he is one of only three players in darts history to achieve this.", "Van Barneveld began participating in competitive events around the Netherlands since 1984 when he was 17 years old. During that year he won his first tournament, which was the Rotterdam Open. From there onwards, Van Barneveld was considered among his compatriots as a future potential. In the following years he joined the international darts circuit, achieving further success reaching the semi-finals of the 1987 Belgian Open and reaching the semi-finals in the 1988 Dutch Open. In September 1990 he participated in the WDF Europe Cup singles where he lost in the quarter-finals to Phil Taylor.", "He successfully defended the trophy the year later by the same winning margin as the previous year, this time against Ronnie Baxter. This made him only the second player in the tournament's history to have launched a successful defence of his title; the other being Eric Bristow. Martin Adams and Glen Durrant would later also achieve this feat. In November 1999, Van Barneveld, the then 2-time reigning Lakeside World Champion, took on Phil Taylor, the then 7-time World Champion and reigning PDC world champion, at the Wembley Conference Centre. It was a legs match with a 60-minute clock ticking down to zero, with a short break at around the halfway stage. Van Barneveld lost the match 21–10.", "After playing in the BDO for twenty years, winning four World Championships, Van Barneveld announced his move from the BDO to the PDC on 15 February 2006. He cited his reasons as wanting a greater challenge, and regularly playing against players like Phil Taylor.Van Barneveld's reasons for switching to PDC Having started from scratch in the rankings, within twelve months he had reached world number two and became World Champion.", "In September 2006, soon after losing to 17-year-old Michael van Gerwen in the first round of the 2006 World Darts Trophy, Van Barneveld acknowledged that he needed to work on his finishing throws, and he made alterations to his game. He changed his darts and began using the \"stacking\" technique used by Taylor. The darts used were a gram lighter than his old ones and cost the equivalent of £1 from a local store in the Netherlands. Although he played well in the 2006 World Grand Prix, he lost to Phil Taylor in the second round.", "In the 2009 Las Vegas Desert Classic, Barney returned to form, losing narrowly to Phil Taylor 13–11 in the final. After the game, Barney took the microphone from Sky Sports presenter Dave Clark and gave a speech about Phil Taylor.", "Van Barneveld returned to top form at the 2010 World Matchplay. In the first round against Denis Ovens on 17 July 2010, Van Barneveld hit another nine-darter. After then defeating Alan Tabern and Co Stompé, Van Barneveld defeated former World Matchplay champion, James Wade, by 17–8 in the semi final. In the final, Phil Taylor defeated Van Barneveld 18–12.", "The 2011 Premier League saw a slight return of form after he hit 4 100+ finishes and defeated Simon Whitlock 8–3 with a 100.15 average. He went on to win his next match against Adrian Lewis 8–6, before losing to Phil Taylor in their match, 8–3. In week 6, he defeated Mark Webster 8–4 with a high average of 100.98  and also hit a 161 checkout. He went on to defeat Gary Anderson 8–5 in week 7 with an average of 101.44. Van Barneveld finished the league phase in second place behind Taylor, but then lost in the semi final to Anderson, which was the fifth time in six years that Van Barneveld had reached the Premier League semi finals without getting into the final.", "Van Barneveld began the 2013 World Championship by throwing the sixth highest average in the history of the tournament in his first round 3–0 defeat of Michael Smith. In a match that lasted only 18 minutes he averaged 108.31 as he never looked in danger of exiting the tournament at the first hurdle for the second successive year. He beat Brendan Dolan 4–1, Gary Anderson 4–0 and Simon Whitlock 5–1 to reach the semi-finals where he faced Phil Taylor. Before the match Van Barneveld commented that he wasn't scared of Taylor and wanted to face him rather than Taylor's quarter-final opponent Andy Hamilton. Van Barneveld was 5–1 down in the match and almost staged a fightback as he won three successive sets to trail only 5–4. However, Taylor won the next set by three legs to one to take the match. The pair were involved in an angry confrontation after the match. Taylor reacted angrily when Van Barneveld pulled him back after their handshake, with both men being escorted away separately by security staff. Van Barneveld stated later that he was only trying to congratulate Taylor in a sportsmanlike way and give him a hug. Taylor apologised for his behaviour a day later.", "Van Barneveld took a 3–2 lead in sets over Mark Webster in the third round of the 2014 World Championship, but afterward exited the tournament losing 4–3. He had a poor run of form in the UK Open Qualifiers to be placed 66th on the Order of Merit meaning he entered the tournament in the first-round stage. Van Barneveld had four comfortable victories to reach the fifth round where he was beaten 9–2 by Adrian Lewis. He produced some of his most consistent darts in years during the Premier League as he remained unbeaten for 12 matches during the season to finish second in the table. In the semi-finals he secured his first win over Phil Taylor in the tournament after 21 attempts, having fought back from 4–1 down to triumph 8–5. It was the first time he had advanced beyond the semi-finals of the event, after losing at this stage in six previous years. Van Barneveld then won four successive legs from 5–5 in the final against Michael van Gerwen and went on to win the title 10–6. His finishing proved to be the difference between him and the rest of the nine players as throughout the 18 matches his checkout percentage was 50.22, seven percent higher than Simon Whitlock in second place. Afterwards, Van Barneveld revealed he had received therapy for depression in January due to the monotony of travelling and playing in events every week.", "Van Barneveld decided not to wear his glasses in the first round of the 2015 World Championship and took out finishes of 167 and 170 in beating Rowby-John Rodriguez 3–0. He was then involved in three successive matches in which there was never a set between Van Barneveld and his opponent as he edged past Jamie Caven 4–3, Adrian Lewis 4–3 (Lewis missed one match dart) and Stephen Bunting 5–4. In the Bunting match he returned from a break after the fourth set with his glasses on explaining afterwards that the board was looking blurry. Van Barneveld looked to have got himself back into his semi-final meeting with Phil Taylor when he recovered from 2–0 down to draw level, but his lengthy previous matches seemed to take effect as he could not win another set to be defeated 6–2. At the Masters he knocked out newly crowned world champion Gary Anderson 11–6 in the semi-finals, but was beaten by a reversal of this scoreline against Michael van Gerwen in the final.", "Van Barneveld edged past Adrian Lewis 4–3 in the third round of the 2017 World Championship and his 5–3 victory over Phil Taylor in the quarter-finals meant that Van Barneveld had reached the semi-finals for the last three years in the event. He took the first set without reply in his quest to reach his first final since 2009. However, Michael van Gerwen then produced the best performance ever seen in a World Championship game as he hit a tournament record average of 114.05 to win 6–2. Van Barneveld averaged 109.34 himself, the highest to ever lose a World Championship match. He also had a high losing average in the quarter-finals of the UK Open as Peter Wright came from 8–7 down to win 10–8 with Van Barneveld averaging 108.10. The Netherlands won their first World Cup since 2014 by seeing off the Welsh team of Gerwyn Price and Mark Webster 3–1 in the final.", "* 2007: Winner (beat Phil Taylor 7–6)", "* 2009: Runner-up (lost to Phil Taylor 1–7)", "* 2013: Semi-final (lost to Phil Taylor 4–6)", "* 2015: Semi-final (lost to Phil Taylor 2–6)", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "| Phil Taylor and  Ray Carver"]}, {"page": "Professional Darts Corporation", "response": ["Sky TV commentator Sid Waddell attempted to christen Phil Taylor \"The Crafty Potter\" – referring to him being both a protégé of Bristow and originating from the Potteries. However, the tag never caught on and it was not until a later tournament that he came out to the tune The Power by Snap! that his nickname was accidentally born.", "Phil Taylor has dominated this tournament, reaching the final for the first 14 years between 1994 and 2007 and winning fourteen titles, including eight successive titles between 1995 and 2002. The PDC World Champions have also shared eight BDO World Championships between them, with Van Barneveld winning four, Taylor two, and Part and Priestley one each. These are usually added to each player's haul when describing their achievements – hence Taylor is a 16-time champion, van Barneveld 5, Part 3 and Priestley 2.", "Held each year in June at the Reebok Stadium in Bolton (2003–2013), and from 2014 in March at Butlins, Minehead, the UK Open is played over three days with 168 players in a single elimination tournament. After each round a draw is held where there is no protection for seeded players. This has earned it the nickname The FA Cup of darts. Phil Taylor is the most successful player in the tournament's history, with five victories.", "Crowds exceeding 2,000 in number assemble at the Winter Gardens in Blackpool, the longest serving venue in the PDC. Matches are contested over legs rather than sets, presenting the prospect of some surprising results and upsets. Phil Taylor has been the dominant player in this event, winning 16 titles and being undefeated in his first 15 finals.", "The European Championship is a tournament that allows the top players in Europe to compete against the top players in the PDC Order of Merit. In 2016 it changed to the top 32 in the European tour Order of Merit. It started in 2008 and for the first six years had a £200,000 prize fund. It has increased since then. Phil Taylor won the first four editions of the tournament, before Simon Whitlock scooped his first, and so far only, major title in 2012.", "In 2005, Sky Sports launched the Premier League Darts television programme. For five months, ten of the biggest names from the PDC circuit compete in a league table, with matches held across the country at different venues. Phil Taylor topped the table after the weekly rounds for the first eight instances the Premier League has been staged, going on to win the play-offs six times. Taylor's reign ended when Michael van Gerwen joined the league in 2013 and topped the table after the weekly rounds in each of the seven times since, winning five times. Glen Durrant was the third player to top the table, doing so in his debut year in 2020.", "One of three new tournaments for 2010, players from 24 countries compete for a prize fund of £150,000. The qualifiers are drawn from the PDC Order of Merit. Sky Sports screen the tournament, which rivals the WDF World Cup. England and the Netherlands have won the title on four occasions, with the pairing of Phil Taylor and Adrian Lewis triumphant each time for England, and Raymond van Barneveld being involved in all four Dutch wins. In 2019, Scotland became just the third nation to lift the trophy with a victory over the Republic of Ireland in the final.", "|Phil Taylor & Adrian Lewis", "The predecessor of what would be renamed the US Open in 2007. Phil Taylor won the event.", "The US Open was a tournament introduced in 2007 to replace the World Series of Darts. The World Series ran for just one year in 2006. Phil Taylor won the US Open in 2007 and 2008. The tournament was reduced down to Player's Championship status for the 2009 and 2010 editions.", "Billed as the Match of the Century, Phil Taylor beat Raymond van Barneveld 21–10 at Wembley Conference Centre on 7 November 1999, to be unofficially crowned the first ever undisputed World Champion since the 1993 split in darts.", "In a further head-to-head on 21 November 2004 at the Circus Tavern, via the first ever darts pay-per-view on Sky Box Office, Phil Taylor again prevailed after his opponent Andy Fordham had to retire during the match due to dehydration.", "The immense heat took its toll on the 30-stone (420 lbs/191 kg) Fordham. Phil Taylor was leading the match 5–2 in sets before it was unexpectedly abandoned.", "The Professional Darts Corporation pool consisted of Colin Lloyd, Wayne Mardle, Roland Scholten and Phil Taylor; whilst for the British Darts Organisation it was Tony David, Andy Fordham, Co Stompé and Raymond van Barneveld.", "In a rematch of their unfinished 2004 head-to-head clash, Phil Taylor beat Andy Fordham convincingly in the final, 7–1, to be crowned the first Master of Darts. While beating Raymond van Barneveld (BDO World Champion at the time) 4–0 and 5–2 along the way, the undefeated Taylor only lost 5 sets during the entire tournament.", "|Phil Taylor", "Seven of these players have successfully defended a title at least once:  Phil Taylor, Michael van Gerwen, Gary Anderson, Adrian Lewis, Rod Harrington, Gerwyn Price and Raymond van Barneveld"]}, {"page": "2007 in sports", "response": ["* 2007 PDC World Darts Championship Final – Raymond van Barneveld beats Phil Taylor 7–6"]}, {"page": "John Part", "response": ["Part's first Championship was the second time a non-seeded player won the BDO World Darts Championship, and one of the few times where a player only lost one set in the entire tournament. His nine-year gap between his first and second World Championships is tied with Ted Hankey for the longest gap between World Championships, and his third triumph in 2008 saw him become the first player in history to win a world title in three different venues, and the first to win at the Alexandra Palace. His 2008 win saw him join Phil Taylor, Eric Bristow, Raymond van Barneveld and John Lowe as the only players with three or more World Championships, and become only the second player (after Taylor) to win multiple PDC titles.", "By 1993, Part was Canada's highest ranked player and was competing in prestigious events sanctioned by the British Darts Organisation. A significant win soon came in the 1993 WDF World Cup, where he and Carl Mercer won the Pairs Championship for Canada. Nevertheless, when he qualified for the 1994 BDO World Championship, he was still a relative unknown. This was the first BDO World Championship since the acrimonious split in darts, and, as a result, the field included many newcomers and debutants, including Part himself. In the first round Part defeated second seed Ronnie Baxter in straight sets, and thereafter swept through to the final beating Paul Lim, Steve McCollum and Ronnie Sharp dropping only one set en route. He faced the charismatic  veteran Bobby George in the final and won 6–0 in sets.  Little over six years after receiving his first dartboard, Part had won a World Championship; he was the first non-British player to do so, and he is one of the few players to win the tournament on their debut. Part's achievement of dropping only one set in winning a World Championship is only matched by Eric Bristow from the 1984 BDO World Darts Championship, and later by Phil Taylor in the 2001 PDC World Darts Championship.", "The 2001 PDC World Darts Championship was to be a turning point in Part's career, even though he ultimately suffered a crushing defeat in the final. Part comfortably advanced through the tournament until the semi-final, where he defeated Essex veteran Rod Harrington 6–5 in a classic contest to reach his first major PDC final. There he would meet Phil Taylor, who had won the last six world championships and was considered as darts' greatest ever player. This was Part's first meeting with Taylor in an official PDC match, but it was not a happy one. Taylor, who had been in stunning form throughout the tournament, averaged 107.46 and had a 72% checkout rate in the final, now considered one of darts' most dominant ever showings; Part only won three legs in the entire match as Taylor stormed to a 7–0 win. Taylor's performance, described as 'ludicrous' by The Guardian, while simply regarded by darts commentator Sid Waddell as a 'vicious example of near perfection' and an 'annihilation', could have seriously affected Part's confidence. But it would only provide the Canadian with further motivation to challenge the best. Over the next two years, Part won a string of minor titles, rose to number two in the world rankings and developed a rivalry with Taylor that would define this stage of his career.", "But the disappointment was nothing compared to what would occur in the new year, as 2004 began with one of Part's most disastrous defeats of all. The Canadian entered the 2004 PDC World Championship as the reigning champion, but was unable to win even a single match in the defence of his title. In the first round he came up against debutant Mark Dudbridge but was stunned in a 4–3 defeat. Phil Taylor would go on to retake the World Championship crown with a 7–6 win over Kevin Painter in the final. In 2004, Part had much success in North America, where he again won the Canadian Open and Canadian National Championships, as well as winning the Golden Harvest North American Cup. Despite Taylor regaining the PDC World Championship, Part once again defeated 'The Power' in the 2004 UK Open quarter-final, with an 8–6 win. Part would then go on to reach his only major final of 2004 at the same event, but would once again fail to consolidate as he was soundly beaten 11–6 in the final by Roland Scholten. At the 2004 World Matchplay, Part began with a 10–0 whitewash of Colin Monk in the first round, and then had an epic win over Bob Anderson in the second round, where Part survived four match darts against him and eventually won in a tiebreak by 17–15. In his quarter final match against Andy Jenkins, Part struggled for much of the match and trailed 7–11, but Part fought his way back to eventually win 16–14, setting up a highly anticipated semi final match against Taylor, with Part having won 3 of his previous 4 matches against Taylor on Sky Sports. Despite Part's recent wins over Taylor on TV, Part started the semi final against Taylor very poorly, averaging in the low 80s and seeing Taylor cruise to an incredible 10–0 lead on a mid 90s average, as the 150/1 shot of a 17–0 whitewash looked a possibility. However, Part improved his game from the eleventh leg onwards, but losing the first 10 legs had left Part with far too much to do. Part restored plenty of respectability after his poor start, but Taylor won the match 17–8. After beating Part, Taylor went on to beat Mark Dudbridge 18–8 in the final, to win his fifth consecutive World Matchplay title and his seventh World Matchplay title in all.", "The year 2006 was seminal to both the Professional Darts Corporation, and Part's career. Concerning the former, it heralded the arrival of four-times BDO World Champion Raymond van Barneveld to the PDC. With van Barneveld's arrival and his immediate impact in the 2006 Premier League, Part was no longer perceived as Taylor's main rival (indeed, Part has not beaten Taylor in a televised match since his 2005 World Matchplay victory). Part's shaken status was not helped by a defeat in the third round of the 2006 PDC World Championship to Wayne Mardle. Despite these setbacks, Part's career experienced a somewhat fitful renewal in the three years that followed. In July, he won his first major title since the 2003 World Championship with victory in the 2006 Las Vegas Desert Classic. The Desert Classic had long been a fruitful tournament for Part; in its eight-year history he reached six semi-finals, but it was only in 2006 that he won the trophy. In 2003, he had lost out in the final to Peter Manley having beaten Phil Taylor in the semi-final; this time it was van Barneveld's turn to suffer the same fate. The Dutchman had beaten Taylor in the semi-final, and in a tense final initially matched Part 3–3. However, the Canadian won nine of the next eleven legs to secure a 6–3 victory and his second major title in the PDC.", "Part's other major results in 2006 were indifferent however, including Phil Taylor defeating Part 13–2 in the second round of the 2006 World Matchplay. The match was heavily hyped up beforehand with Part and Taylor having played many classic matches before and Part having beaten Taylor four times on television. However, their match at the 2006 World Matchplay was in complete contrast to their classic matches from the past, being a flat anti-climax throughout as Taylor played below average and Part played very poor throughout. Part also had another disappointing World Championship in 2007. This time he was eliminated tamely in the second round by Chris Mason. The defeat meant that Part had not reached the quarter-finals of the PDC World Championship since his epic world title victory in 2003, while van Barneveld went on to defeat Phil Taylor 7–6 in a similarly momentous final. But for the rest of 2007, Part returned to some of his best form. He reached three semi-finals of televised majors: US Open; the World Grand Prix, and the Las Vegas Desert Classic (though he could not defend his title in the latter). These consistent performances meant he entered the 2008 PDC World Championship as the 11th seed, though he was not considered one of the favourites for the event. Nevertheless, Part advanced steadily through the tournament, setting the tournament's highest average in the second round against Mensur Suljović. He then came through a tight quarter-final against the 2007 PDC Player of the Year and third seed James Wade, winning in a deciding set 5–4. In the semi-final he faced Kevin Painter, reminiscent of his 2003 triumph; Part once again emerged victorious, 6–2 this time, and found himself in his fourth world championship final.", "In June 2010, Part came through a large field of players to win the PDC North American Darts Championship in Las Vegas. Part failed to get into the 2010 Grand Slam of Darts after Adrian Lewis surprisingly defeated Phil Taylor in the semi finals of the 2010 World Grand Prix. Part was whitewashed 0–3 by Danish qualifier Per Laursen in the 2011 World Championship and almost went out of the top 32.", "He won his first players championship since 2007 in February 2011 in Derby convincingly beating Mark Walsh 6–0 with 104.86 average. On the previous day he narrowly missed double 12 for a 9 dart finish. Part stated \"he had nothing to lose\" and that illness had stopped him reaching where he wanted to be at the World Championships. Part's form continued when he won another players championship in May 2011 in Austria by thrashing Denis Ovens 6–0 in the final, having earlier overcoming Phil Taylor 6–2. The win granted him qualification for all the major televised tournaments in 2011, something which he failed to do in 2010 except for the UK Open.", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor", "* 2001: Runner Up (lost to Phil Taylor 0–7)", "* 2002: Quarter-finals (lost to Phil Taylor 0–6)", "* 2003: Winner (beat Phil Taylor 7–6)"]}, {"page": "Roll with It (Oasis song)", "response": ["The song was used by Team England (Phil Taylor and Adrian Lewis) as their walk-on music at the 2012 PDC World Cup of Darts."]}, {"page": "Tony McCoy", "response": ["McCoy was named 2010 BBC Sports Personality of the Year and in doing so became the first jockey to win the award, polling ahead of darts player Phil Taylor and Olympic heptathlete Jessica Ennis, who finished second and third place respectively. McCoy's win in the 2010 Grand National at his 15th attempt on board the Jonjo O'Neill trained Don't Push It was seen to be the main contributing factor to his win."]}, {"page": "Mark Walsh (darts player)", "response": ["Walsh reached his first major televised final in 2005, when he was beaten by England's Phil Taylor in the UK Open.", "* 2008: Second round (lost to Phil Taylor 3–4)", "|  Phil Taylor"]}, {"page": "List of sports rivalries", "response": ["| Phil Taylor (1986–2018) ||  Raymond van Barneveld (1987–2019) || 2006– ||PDC World Darts Championship: Phil Taylor loses to Raymond van Barneveld, BBC Sport, 30 December 2016 Barney vs The Power, de enige echte dartsklassieker, NOS, 30 December 2016The El Clasico of darts between Raymond van Barneveld and Phil Taylor is back in Leeds, Sky Sports, 14 February 2017"]}, {"page": "Kevin Painter", "response": ["Kevin Painter (born 12 July 1967) is an English retired darts player, known as \"The Artist\". He is arguably most famous for finishing as the runner-up to Phil Taylor in the 2004 PDC World Championship final, now widely credited as one of the greatest televised matches in the history of the sport.The Guardian article – The Power pays off in sudden death by Gavin Worley, retrieved 3 August 2008 He was also the winner of the Players Championship Finals in 2011.", "In the second round of the 2016 World Championship, Painter missed four darts to lead Phil Taylor 2–1 and went on to be defeated 4–1.", "Painter qualified for the 2017 World Championship through the Pro Tour Order of Merit when Kyle Anderson was forced to withdraw from the event due to being unable to get a UK Visa. He won the last six legs of his first round encounter with Jamie Caven to defeat him 3–1. He missed a number of doubles in his second round match with Phil Taylor, including three to win the third set, and was defeated 4–0.", "*2004: Runner-up (lost to Phil Taylor 6–7)", "*2005: Quarter-finals (lost to Phil Taylor 1–5)", "*2006: Quarter-finals (lost to Phil Taylor 1–5)", "*2009: Third round (lost to Phil Taylor 1–4)", "*2016: Second round (lost to Phil Taylor 1–4)", "*2017: Second round (lost to Phil Taylor 0–4)"]}, {"page": "Wayne Mardle", "response": ["Wayne Elliot Mardle (born 10 May 1973) is an English former professional darts player who played in events of the Professional Darts Corporation (PDC) and British Darts Organisation (BDO). He was runner-up in three PDC majors, losing to Phil Taylor on each occasion.  He was also a five-time world semi-finalist. He currently works as a pundit and commentator. ", "Mardle joined the Professional Darts Corporation in time for the 2003 World Championship. His first appearance at the Circus Tavern saw him lose in the third round to Phil Taylor. His debut at Blackpool's Winter Gardens in the World Matchplay was much better, beating World Champion John Part, Alan Warriner and Colin Lloyd to reach the final, where he again lost to Taylor. From 2004 to 2006, Mardle reached three consecutive world championship semi-finals, losing to Taylor in 2004 and 2006, and Mark Dudbridge in 2005. He peaked at fifth in the World Rankings. He has always seemed to suffer from what Sid Waddell called the \"Mardle Drift\", which sees his Darts continually land in 5 and Treble 5 instead of the 20/Treble 20. ", "In 2007, Mardle was beaten in the opening round of the World Championship by unseeded Alan Caves,Mardle stunned by Caves victory and  subsequently failed to reach the latter stages of a single event that year. He found his form at the 2008 World Championship, and in a big upset he beat then-13 time champion Phil Taylor 5–4 in the quarter-finals, a match in which he had trailed 3–0. This was the first time in the history of the PDC championship that Taylor had been beaten before the final. After his win over Taylor, Mardle was made bookmakers' favourite to win the tournament, especially as his semi-final opponent was 21-year-old qualifier Kirk Shepherd, ranked 142nd. However, an over-confident Mardle lost the match 6–4. Mardle later described his attitude going into the match as \"nonchalant\" and stated that he did not give Shepherd the respect he deserved.The One That Got Away: Wayne Mardle reflects on his 2008 World Championship heartbreak against Kirk Shepherd", "*2003: 3rd round (lost to Phil Taylor 3–5)", "*2004: Semi-finals (lost to Phil Taylor 2–6)", "*2006: Semi-finals (lost to Phil Taylor 5–6)", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor"]}, {"page": "British Darts Organisation", "response": ["Following the split, the BDO and PDC ran their own tours, including their own versions of the world championship, with separate pools of players. Since there were two World Championships from 1994 onwards, there were calls for head-to-head matches between the two champions. There were two head-to-head matches between the reigning champions of the two organisations. The challenge matches, held in 1999 and 2004, were officially recognised as undisputed championship matches. In their respective matches, the incumbent BDO champions Raymond van Barneveld and Andy Fordham were defeated by the PDC champion Phil Taylor.", "In 2001, six prominent BDO players, including 1996 champion Steve Beaton and two-time runner-up Ronnie Baxter, announced that they would be competing in the PDC version of the world championship in 2002. Croft insisted the six players would not be missed and suggested that none would have progressed beyond the first round of the tournament. The executive producer of BBC Darts disagreed, stating \"You can't just replace recognisable people with unknowns and say it is the same and that nothing has changed.\" In 2006, in what was described as a “massive coup” for the PDC, four-time BDO champion Raymond van Barneveld moved to the PDC. Van Barneveld said he was switching for the challenge and to \"compete against the best players in the world, including the best, Phil Taylor.\" In January 2007, Dutch trio Jelle Klaasen, Michael van Gerwen and Vincent van der Voort moved to the PDC. They were followed a month later by Mervyn King. ", "When Raymond van Barneveld switched to the PDC in 2006, the tournament organisers agreed with the BDO to invite four players from the rival organisation. Van Barneveld (PDC) went on to win the title for the third time in 2006 and Gary Anderson (BDO) won the 2007 event. This remains the only major event to date that Phil Taylor hasn't won in either the BDO or PDC.", "The WDT followed the International Darts League by inviting four PDC players to the tournament in 2006, and again a PDC player (Phil Taylor) won the title."]}, {"page": "Las Vegas Desert Classic", "response": ["Phil Taylor won the title five times out of the eight years the event was staged. Peter Manley, John Part and Raymond van Barneveld were the only other winners of the event.", "|  Phil Taylor ", "|  Phil Taylor ", "|  Phil Taylor ", "|  Phil Taylor "]}, {"page": "Russ Bray", "response": ["According to Bray himself, his calling career began one night when the regular caller failed to show for a county match. Bray was then contracted to call for the PDC in 1996 and was given his debut at the World Matchplay in Blackpool. He was the caller when Phil Taylor hit the PDC's first-ever televised nine-darter in 2002 at the same event. He has called seven more nine-darters live on TV since then including the first televised nine-darter outside of Europe by Mervyn King in Johannesburg, South Africa. "]}, {"page": "Peter Manley", "response": ["Peter David Manley (born 7 March 1962) is an English former professional darts player who played in Professional Darts Corporation (PDC) events from July 1996 until 2017. He won one major title, the Las Vegas Desert Classic, in 2003, and twice held the number one ranking. He also reached the World Championship final in 1999, 2002 and 2006, losing to Phil Taylor on each occasion. Declining form led to him losing his place on the PDC tour in 2011. ", "Manley is perhaps most famous for his long-running feud with Phil Taylor resulting from his refusal to shake Taylor's hand after losing 7–0 to him in the 2002 PDC World Darts Championship final. He has finished runner-up to Taylor in two other World Championships - losing 6-2 in 1999 and 7-0 in 2006.", "* 1999: Runner-up (lost to Phil Taylor 2-6)", "* 2002: Runner-up (lost to Phil Taylor 0-7)", "* 2006: Runner-up (lost to Phil Taylor 0-7)", "|  Phil Taylor", "|  Phil Taylor", "|  Phil Taylor"]}, {"page": "Steve Beaton", "response": ["Beaton has never made the same impact in the PDC, having failed to reach the quarter-finals in any of his attempts at the world crown, his best finishes being three Round of 16 losses in 2002, 2004 and 2020. In 2002, when the tournament was still only five rounds, he got knocked out in round two by John Part 0–6. In 2004 when he got a bye to the third round and was knocked out in round four by Mark Dudbridge 1–4. His poor form has seen him slip down the world rankings at times, but he has nearly always maintained a position in the top 32, apart from some periods in 2007 and 2008 when his ranking occasionally went down to around number 40. Just when he looked in danger of falling away in the rankings at that time, a big improvement in his form in 2009 and 2010 saw Beaton's ranking back into the top 32, where he has been in the decade since. Beaton has reached the semi-finals in four major PDC tournaments – the 2001 World Matchplay when he lost to Richie Burnett, the 2004 UK Open when he lost to Roland Scholten, the 2004 World Grand Prix when he lost to Alan Warriner, and the 2010 Grand Slam of Darts when he lost to Scott Waites. Prior to losing to Waites at the 2010 Grand Slam of Darts, Beaton had rolled back the years in his quarter final match by coming from 11–14 behind to win five legs in a row and defeat the three-time defending champion Phil Taylor 16–14, in one of finest match wins of Beaton's career.", "Beaton saw a rise in form in the 2009 season, taking him even further up the  rankings to 19th in the world. Beaton won his first title in almost nine years when he took the Players Championship in Nuland in October. He also finished runner up in the European championship beating the likes of Adrian Lewis, Mark Walsh and James Wade en route to the final where he was defeated 11–3 by Phil Taylor. This result however gave Beaton a place in the 2009 Grand Slam of Darts, where he progressed from the round robin stage courtesy of wins over Co Stompé and Kevin McDine before being comprehensively outplayed by Simon Whitlock.", "At the 2010 Grand Slam of Darts, Beaton produced a major upset by beating three-time defending champion Phil Taylor 16–14 in the quarter-finals, having trailed 9–13 and 11–14. Earlier in the week, Beaton had needed to defeat Paul Nicholson 5–3 or better at the round robin stage to stay in the tournament (he won 5–1), and followed that up with a 10–6 win over Ted Hankey who had himself defeated Taylor in his group. Beaton was defeated by eventual champion Scott Waites 16–9 in the semi-final. Despite his good form in 2010 he was narrowly defeated in the first round of the 2011 PDC World Darts Championship by Mark Hylton eventually losing by 3 sets to 2. The following year, Beaton recovered from two sets and three match darts down against Magnus Caris to win 3–2, but was beaten by Simon Whitlock 1–4 in the second round.", "|  Phil Taylor"]}, {"page": "Celebrity Poker Club", "response": ["Other celebrities featured have included Dave Gorman, Rory McGrath, Dexter Fletcher, Dennis Taylor, Louise Wener, Nick Leeson, Howard Marks, Charles Ingram, Martin Amis, Al Alvarez, Phil Taylor, Hattie Hayridge, Johnny Vegas, Darren Campbell, Phil Daniels, Graham Linehan, Ally McCoist, Colin Murray and Michael Praed."]}, {"page": "Eamonn Holmes", "response": ["Holmes has presented coverage of snooker, horse racing, darts and tennis on television.Sport in My World: Eamonn Holmes  The Daily Telegraph, 28 April 2006Eamonn Holmes  Feelgood Factor, ITV, 2009. He was also the presenter of ITV's coverage of the Phil Taylor vs. Raymond van Barneveld showdown at the Wembley Conference Centre in 1999.Filmography HOLMES, Eamonn  BFI – Film & TV DatabaseSIMPLY THE BEST PHIL TAYLOR V RAYMOND VAN BARNEVELD   BFI – Film & TV Database"]}, {"page": "Poker Million", "response": ["The field for Poker Million III was expanded to feature 72 players, including 36 online qualifiers and number of celebrities.   Among the celebrities were snooker stars Stephen Hendry, Mark Williams and 2003 winner Jimmy White; rugby World Cup star Mike Tindall; and, sports celebrities Tony Cascarino and 16 time World Darts Champion Phil Taylor.  Irish poker professional Donnacha O'Dea won first place and $300,000."]}, {"page": "Fallings Park", "response": ["In the area there is a fire station, many shops, a petrol station, three churches, a number of schools and two pubs, The Golden Lion and the Bird In Hand. A third pub, the Great Horse was situated on Prestwood Road, and attracted celebrities such as former footballers Sir Geoff Hurst and Alan Ball, as well as darts start Phil Taylor and boxer Joe Egan for charity events under former landlady, Sylvia Johnson, before closing in March 2009."]}, {"page": "Roland Scholten", "response": ["Scholten reached the semi finals of the 2005 Premier League, and went into the match as a big underdog against Phil Taylor. However, Scholten upset the form book for most of the best-of-25 legs match, as he led 4–1, 5–2, 6–3, 7–4 and 11–7, only for Taylor to produce a remarkable comeback by winning 6 consecutive legs to win the match 13–11.", "In the 2006 Premier League, Scholten again reached the semi finals, and again went into the match as a big underdog, this time against Raymond van Barneveld. Scholten again upset the form book, and this time completed the job, as he defeated van Barneveld 11–3, to advance into the final. However, Scholten was unable to repeat the performance in the final, as Phil Taylor defeated him, 16–6.", "Scholten finished in last place in the 2007 Premier League, despite twice taking Phil Taylor to a 7–7 draw. At the 2007 World Matchplay, Scholten and Taylor met in the quarter finals, with Taylor winning by a crushing 16–1 scoreline.", "In the UK Open, he ran 15 times world champion Phil Taylor very close in the last 64, but ultimately lost 7–9. Scholten lost in the quarter-finals of the 2013 World Championship Qualifier to Terry Temple and was ranked world number 47 after the tournament had been completed.", "|  Phil Taylor"]}, {"page": "Mervyn King (darts player)", "response": ["2008 proved a successful year for King as he reached two semi-finals in PDC premier events as well as his maiden PDC premier final in the inaugural 2008 Championship League Darts where he lost 7–5 to Phil Taylor.2008 Championship of Darts Results Darts Database, 28 June 2011 ", "His first PDC title came at the Scottish Players Championship in Glasgow in April 2008 where he beat Taylor on his way to a 3–0 victory over Mark Dudbridge. He also won a Pro Tour title in the Netherlands, beating Raymond van Barneveld. He also had two semi-final appearances in the 2008 World Grand Prix and the 2008 Grand Slam of Darts losing to Raymond van Barneveld and Phil Taylor respectively. King ended the year and went into the 2009 PDC World Darts Championship as world number 13 in the PDC Order of Merit. His first year performances saw him win the Best Newcomer prize at the annual PDC awards dinner.", "King went into 2009 competing in the 2009 PDC World Darts Championship, and this turned out to be his best result in the PDC World Championship to date. He beat Barrie Bates in the quarter-finals before falling to Phil Taylor 2–6 with Taylor averaging 103.44. His performance in the World Championship meant that he moved up to 6 in the PDC Order of Merit and therefore qualified automatically for the 2009 Premier League Darts.2009 Premier League Darts Fixtures  PDC.tv, 28 June 2011", "King carried on his good form into the 2009 World Matchplay in July. He defeated Mark Dudbridge, Steve Beaton and Vincent van der Voort before meeting Phil Taylor in the semi-final. Taylor prevailed 17–6, averaging 106.54, and went on to win the tournament.2009 World Matchplay Results Darts Database, 28 June 2011 In the next PDC Premier event of the 2009 season, the 2009 European Championship, he reached the quarter-final before losing to James Wade 6–10. This was after beating Colin Osborne in the second round 9–6 recording a 104.00 average.2009 European Championship Results Darts Database, 28 June 2011 King's successful run in the 2008 Championship League Darts continued into the 2009 tournament as he reached the semi-final before losing to eventual champion Colin Osborne 1–6.2009 Championship of Darts Results Darts Database, 28 June 2011Wizard Is New CLD Champion!  PDC.tv, 28 June 2011", "King made a great start to his Premier League career as he opened up with an 8–1 victory over Sky wildcard Wayne Mardle. He then went on to record three more victories on the bounce beating James Wade 8–1, John Part 8–2 and Jelle Klaasen 8–4. He then faced defending champion Phil Taylor in Newcastle, recording a 7–7 draw despite leading 7–5 with both players averaging over 100. King's form then dropped, only winning two more games in Birmingham and Glasgow against Mardle and Wade respectively. King was also a controversial figure during the tournament, often letting the crowd get to him and affect his mood and darts.Mervyn King frustrated by darts boo boys BBC Sport, 28 June 2011 During a 2009 Premier League match with Taylor, he threw a dart over Taylor as he stooped down to pick up his flight. During the post-match interview, neither of them would look at each other. His final position of 4th in the league was influenced by the illness of Mardle, as he was withdrawn from the competition.PDC Statement: Wayne Mardle  PDC.tv, 28 June 2011 Therefore, all results that included Mardle were annulled, including King's two victories over Mardle. King's fourth place in the overall league meant that he faced Taylor in the play-off semi-finals at the Wembley Arena. King won 10–6 to end Taylor's winning streak in Premier League competitions. Despite this victory he was to finish runner-up as he lost the final 13–8 to Wade, who beat Raymond van Barneveld 10–8 in the other semi-final. Wade led King 8–2 before a mini comeback from King but Wade was able to see the game out to claim his maiden Premier League Darts title.Wade's Wembley Wonder!  PDC.tv, 28 June 2011", "King started the 2010 Premier League with wins over James Wade and Adrian Lewis. His first loss of the season came in Belfast as he lost 6–8 to Ronnie Baxter. His rivalry with Phil Taylor continued in Manchester, where King recorded a 7–7 draw.Premier League Darts Night Five  PDC.tv, 29 June 2011 King lost his last three round-robin matches to Taylor, Raymond van Barneveld and Simon Whitlock, but he still made it to the semi-finals for the second consecutive year, again finishing 4th in the table. He finished on the same number of points as Baxter, but qualified due to a better leg difference. Just like in the previous year, he played against Taylor in the semi-final. This time, Taylor resoundingly won 8–1, averaging 107.98 in the processTaylor Two Good At Wembley!  PDC.tv, 29 June 2011 Despite losing badly against Taylor, King beat Whitlock in the third-place play-off.", "King went into the 2011 PDC World Darts Championship ranked 6th in the PDC Order of Merit.World Championship Draw  PDC.tv, 30 November 2010 His 2011 World Championship were ended in the second round, where he was beaten 3–4 by Andy Smith. After the World Championship, King dropped out of the automatic qualifying places for the 2011 Premier League Darts, and was not awarded a wildcard. His successful streak in the Players Championship Finals continued as he again reached the semi-final for the second consecutive year. He lost in the semi-final to Phil Taylor 8–10. He lost in the third round of the 2011 UK Open tournament, losing 9–5 to Mark Walsh. He qualified for the 2011 World Matchplay Darts as the 9th seed.,Sky Bet Mobile World Matchplay Draw  PDC.tv, 29 June 2011 but lost 6–10 against Justin Pipe in the first round, reporting a complaint of tennis elbow.World Matchplay – Night Three  PDC.tv, 18 June 2011 At the 2011 European Championship, he beat Co Stompé 6–1 in the first round,PartyPoker.net Euro Champs – Thu  PDC.tv, 28 June 2011 before losing 3–10 to Taylor in the second round.PartyPoker.net Euro Champs – Sat  PDC.tv, 30 June 2011 He also qualified for the 2011 Championship League Darts winner's group by beating Simon Whitlock 6–3 in the final of group five.King Reigns in Group Five  PDC.tv, 22 October 2011 In the winner's group finished second in the table before losing to Paul Nicholson in the semi-final.Nine-Dart Taylor's CLD Glory  PDC.tv, 22 October 2011 At the Players Championship Finals in December, he beat Colin Lloyd 6–4 to meet Phil Taylor in the second round. King produced his second victory over Taylor in major competitions with an 8–5 win. However, he lost in the quarter-finals to eventual winner Kevin Painter.", "King played Geoff Kime in the first round of the 2012 World Championship and outplayed his opponent, winning 3–0 without dropping a leg. However, he was knocked out in the second round for the third successive year as he was beaten 1–4 by Michael van Gerwen. At the UK Open King beat his old BDO rival Ted Hankey and Gareth Cousins, before losing 7–9 to van Gerwen in the last 32. Due to dropping out of the top 16 in the PDC rankings, King was due to play seed Phil Taylor in the first round of the 2012 World Matchplay. Despite a strong performance where he hit eight maximums to Taylor's one, King crucially missed three darts to lead the match 9–8 and instead lost 8–10.", "In a tight match in the quarter-finals of the World Grand Prix, King was defeated in a final leg decider against Van Gerwen as he was unable to checkout 120. He went a stage further at the European Championship, but lost 11–8 to Terry Jenkins. King continued his fine form at the Masters by beating Simon Whitlock and Justin Pipe and then produced a superb performance to exact revenge over Van Gerwen 11–9 with a 121 finish on the bull. He built on his momentum in the final against James Wade to lead 5–0 after the first session with an average of 110 and was also 9–2 in front. Wade rallied to trail 9–6 before a 158 finish from King saw him stand one leg away from his first PDC major title. However, he would miss a total of eight championship darts as Wade completed his comeback with an 11–10 win. The misses didn't seem to affect him at the Grand Slam, as he punished every mistake from Gary Anderson in a second round 10–4 win and then beat Stephen Bunting 16–9 to face Phil Taylor in the semi-finals. King couldn't keep pace with Taylor as he fell 12–2 down and, though he briefly rallied, was eliminated 16–9. Taylor also knocked King out of the Players Championship Finals, 10–7 in the second round.", "After edging out Russia's Aleksandr Oreshkin 3–2 in the first round of the 2016 World Championship, King lost 4–2 to Jelle Klaasen in round two. He won through to the semi-finals of the Dutch Darts Masters, which included recovering from 5–0 down to Benito van de Pas in the quarters to win 6–5, and was beaten 6–2 by Michael van Gerwen. He lost 9–7 to Van de Pas in the third round of the UK Open. King inflicted James Wade's first ever first round defeat at the World Matchplay by beating him 10–5 and then saw off Brendan Dolan 11–8 to play in the quarter-finals of the event for the first time in seven years. In an extremely tight match he narrowly lost 16–14 to Phil Taylor, with the 16-time world champion stating that it was the best he had seen King play for two or three years. He lost in the opening round of both the World Grand Prix and Players Championship Finals and James Wilson edged out King 10–9 in the second round of the European Championship.", "King has reached two World Championship finals and four semi-finals since making his debut in the BDO version in 1997. He went as far as the semi-final in his debut year, losing to eventual champion Les Wallace. During his run he hit thirty 180s, setting a new record for the tournament at the time. Since switching to the PDC, his best performance came in the 2009 World Championship when he reached the semi-final, losing 2–6 to Phil Taylor.", "King's most successful PDC World Championship was in the 2009, when he beat Mark Walsh and Dennis Smith before beating Barrie Bates 5–2 in the quarter-finals. This run set up a semi-final clash with Phil Taylor. King lost to Taylor 2–6. However, since then he has been knocked out in the second round every year to Co Stompé, Andy Smith and Michael van Gerwen in 2010, 2011 and 2012 respectively.", "*PDC Televised Performance of the Year 2009 (v Phil Taylor, Premier League Darts Semi-Final).", "* 2009: Semi-finals (lost to Phil Taylor 2–6)"]}, {"page": "Star Spell", "response": ["|Adam BestArlene PhillipsPhil TaylorGary Waldhorn"]}]}}