{"wiki_id": "http://www.wikidata.org/entity/Q5512326", "itemLabel": "G. L. Harriss", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/G._L._Harriss", "wikipedia_page": {"main": "Gerald Leslie Harriss FBA (22 May 1925 - 2 November 2014) was an English historian of the Late Middle Ages. His work focused on the parliamentary, financial and administrative history of the period. Harriss was a Fellow of Magdalen College, Oxford.G.L. Harriss first came up to read Modern History at Magdalen College, Oxford as an undergraduate in 1943 where he was tutored by K.B. McFarlane. After two years in the Royal Navy from 1944 to 1946, he returned to complete his degree and went on to research for a D.Phil. under the supervision of C. A. J. Armstrong, being elected to a Senior Demyship of Magdalen, which he held from 1950 to 1952.Harriss' first academic post was as an assistant lecturer in The University of Manchester from 1955 to 1956, before he was appointed a lecturer and later Reader in Medieval History in the University of Durham from 1956 to 1967. In 1967, Harriss succeeded McFarlane, who had died suddenly the previous year, as Fellow and Tutor in Modern History of Magdalen College, also serving as College Librarian from 1968 to 1983. From 1990 to 1992, Harriss was Reader in Medieval History in the University of Oxford. Upon his retirement in 1992 he was elected an Emeritus Fellow of Magdalen College.In 1986, G.L. Harriss was elected a Fellow of the British Academy.'Rulers and Ruled in Late Medieval England. Essays presented to Gerald Harriss' (Hambledon, 1995), a Festschrift in his honour,  edited by two of his former research students, Rowena E. Archer and Simon Walker, was published in 1995.\nHarriss' important contributions to medieval history were based upon his research into the growing financial demands and prerogatives of late medieval English government, which resulted in a series of important articles such as \"Fictitious Loans\", Ec.HR, 2nd series, 8 (1955-6), pp. 187–99; \"Preference at the Medieval Exchequer\", BIHR, 30 (1957), pp. 17–40; and \"Aids, Loans and Benevolences\", Historical Journal, 6 (1963), pp. 1–19. In his magnum opus, King, Parliament and Public Finance in Medieval England to 1369 (Oxford, 1975), Harriss placed the parliamentary-controlled system of royal finance in the context of the emergence of the crown as a corporate body separate from the person of the king, and its role in the development of English political society and the constitution. Harriss later benefited from the work of Simon Walker, particularly in relation to the retinue of John of Gaunt and the development of private forms of political authority alongside that of the crown.As well as succeeding McFarlane at Magdalen, Harriss also edited a posthumous collection of McFarlane's essays, 'Lancastrian Kings and Lollard Knights' in 1972. In 1997, Harriss edited 'Letters to Friends 1940-1966', a collection of McFarlane's correspondence with several of his distinguished students, including R.R. Davies, Karl Leyser, Alan Bennett, and Harriss himself, published privately by Magdalen College.", "link_mentions": [{"page": "1985 in literature", "response": ["*G. L. Harriss (editor) – Henry V: The Practice of Kingship"]}, {"page": "Richard of Conisburgh, 3rd Earl of Cambridge", "response": ["Although Edmund of Langley made no provision for Richard in his will of 25 November 1400, his mother Isabella named King Richard II as her heir before her death on 23 December 1392 and requested him to grant her younger son an annuity of 500 marks. The king complied. On 3 February 1393, he provided his godson with an annuity of £100 from the revenues in Yorkshire that Isabella had formerly received, and on 16 March 1393, he provided him with a further annuity of 350 marks (£233 6s 8d) from the Exchequer. According to T. B. Pugh, further largess from the king might have been expected when Richard came of age, however Richard II was deposed in 1399. According to G. L. Harriss, Richard of York 'received no favours from the new King, Henry IV'. After Henry IV's accession, Richard's annuities, his sole source of income, were either paid irregularly, or not paid at all.; ."]}, {"page": "John de Mowbray, 2nd Duke of Norfolk", "response": ["On 12 January the following year, John married Neville's eldest daughter, Katherine. At this time he also received the return of his family's hereditary office of Earl Marshal, which had been granted to Westmorland in 1399 on the death of John's father. Historian Christine Carpenter has suggested that his restoration was part of Henry V's policy of reconciling the families that had rebelled against his father. Chris Given-Wilson has noted that in spite of this spirit of reconciliation, none of the heirs received outright their treacherous fathers' lands, and that this, therefore, made John Mowbray more likely to be \"dependent on the crown\" for additional sources of income. G. L. Harriss described Mowbray as \"younger than the king and anxious to recover forfeited lands and titles and restore... family honour\"."]}, {"page": "William de Ros, 6th Baron Ros", "response": ["With his wife, Margaret Fitzalan, William Ros had four sons: John, Thomas, Robert and Richard. They also had four daughters: Beatrice, Alice, Margaret and Elizabeth. Ros also had an illegitimate son, John, by a now-unknown woman. Charles Ross suggests that he \"provides full confirmation of what the scanty evidence as to the character of his earlier career suggests, that Ros was a man of just and equitable temperament\" by the nature and extent of his bequests. His heir, John, inherited his father's lordship and patrimony and his armour and a gold sword. His third son, Robert—whom Ross describes as \"evidently his favourite\"—also inherited a quantity of land. Ros made this provision for Robert from John's patrimony, a decision described by G. L. Harriss as \"overrid[ing] both family duty and convention\". His younger three sons (Thomas, Robert, and Richard) received a third of Ros's goods among them; Thomas, traditional for a younger son, was intended for an ecclesiastical career. Ros's wife, Margaret, received another third of his goods. His illegitimate son, John, received £40 towards his upkeep. Loyal retainers received benefices, and Ros's \"humbler dependents\"—for instance, the poor on his Lincolnshire estates—received often-massive sums among them. His executors—one of whom was his heir, John—received £20 each for their services. Ros was buried in Belvoir Priory, and an alabaster effigy was erected in St Mary the Virgin's Church, Bottesford, on the right side of the altar. Seven years later, after his death at Baugé, an effigy of his son John was placed on the left. William Ros left £400 to pay ten chaplains for eight years to educate his sons."]}, {"page": "K. B. McFarlane", "response": ["Although his scholarship and methods have had great influence on later historians, McFarlane did not publish widely in his own lifetime. The main sources for his scholarship are the book Lancastrian Kings and Lollard Knights, his Ford Lectures from 1953 published in 1980 as The Nobility of Later Medieval England, and the essays and shorter articles published by his student G. L. Harriss in 1981 under the title England in the Fifteenth Century. Much of his influence on historiography is the result of his DPhil students, who held posts in many British universities.", "Letters to Friends, 1940–1966, edited by G. L. Harriss, contains a selection from the large collection of correspondence deposited with Magdalen College and published privately through the college in 1997. The great bulk of McFarlane's correspondence remains unpublished."]}, {"page": "Gerald Leslie Harriss", "response": ["#REDIRECT G. L. Harriss"]}, {"page": "Gerald Harriss", "response": ["#REDIRECT G. L. Harriss"]}, {"page": "G L Harriss", "response": ["#REDIRECT G. L. Harriss "]}, {"page": "G.L. Harriss", "response": ["#REDIRECT G. L. Harriss "]}, {"page": "GL Harriss", "response": ["#REDIRECT G. L. Harriss "]}, {"page": "New Oxford History of England", "response": ["*Shaping the Nation: England, 1360–1461 — G. L. Harriss (2005), "]}, {"page": "Edmund Beaufort, 2nd Duke of Somerset", "response": ["In 1427 it is believed that Edmund Beaufort may have embarked on an affair with Catherine of Valois, the widow of King Henry V. Evidence is sketchy; however, the liaison prompted a parliamentary statute regulating the remarriage of queens of England. The historian G. L. Harriss surmised that it was possible that another of its consequences was Catherine's son Edmund Tudor and that Catherine, to avoid the penalties of breaking the statute of 1427–8, secretly married Owen Tudor. He wrote: \"By its very nature the evidence for Edmund Tudor's parentage is less than conclusive, but such facts as can be assembled permit the agreeable possibility that Edmund 'Tudor' and Margaret Beaufort were first cousins and that the royal house of 'Tudor' sprang in fact from Beauforts on both sides.\""]}]}}