{"wiki_id": "http://www.wikidata.org/entity/Q5515674", "itemLabel": "Gabriel Hemery", "itemDescription": "British forester and activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Gabriel_Hemery", "wikipedia_page": {"main": "Dr Gabriel Hemery (born 13 December 1968) is an English forest scientist (silvologist) and author.  He co-founded the Sylva Foundation with Sir Martin Wood, a tree and forestry charity established in 2009.", "link_mentions": [{"page": "The Man Who Planted Trees", "response": ["Environmentalist and silvologist Gabriel Hemery wrote a sequel in 2016 titled: The Man Who Harvested Trees and Gifted Life. The short story follows a girl's life-long relationship with a forest and its trees. Gabriel Hemery, The Man Who Harvested Trees and Gifted Life. Independent Publishing, 2016.  https://gabrielhemery.com/books/"]}, {"page": "Long Wittenham", "response": ["In the late 1930s (exact date unknown) the University of Oxford based its Institute for Research in Agricultural Engineering at College Farm (owned by St John's College, Oxford), which moved to York in 1942. The property was subsequently managed as a commercial farm although some buildings gradually fell into dereliction. In 1992 a large proportion of the farmland, which had been sold the year before, was donated to the Northmoor Trust (now Earth Trust) to establish a new research woodland called Paradise Wood, created and managed by Gabriel Hemery. In 2013, 20 hectares (12 acres) of the remainder of the farmland, including the redundant buildings, was gifted to another charity the Sylva Foundation. In 2016 the charity moved its main office to the site and established the Sylva Wood Centre, which provides a hub for small businesses and craftspeople who design, innovate or make in wood. In 2017 the Sylva Foundation created the Wittenhams Community Orchard  and Future Forest  on surrounding land."]}, {"page": "Sylva, or A Discourse of Forest-Trees and the Propagation of Timber", "response": ["* A new edition by Gabriel Hemery with illustrations by Sarah Simblet is published by Bloomsbury to coincide with the 350th anniversary in 2014 of the book's first publication. It is titled The New Sylva: a discourse of forest and orchard trees for the twenty-first century.Bloomsbury Publishing http://www.bloomsbury.com/uk/the-new-sylva-9781408835449 The authors have their own blog following the book's creation: sylva.org.uk"]}, {"page": "Sylva Foundation", "response": ["The Sylva Foundation is an environmental organisation focusing on trees and forestry established in 2006, and registered as a charity in England and Wales in 2009  and with the Office of the Scottish Charity Regulator in 2010.https://www.oscr.org.uk/charities/search-scottish-charity-register/charity-details?number=SC041892#results The organisation was co-founded by Sir Martin Wood and Dr Gabriel Hemery.https://sylva.org.uk/origins Its office is at the Sylva Wood Centre in Long Wittenham in Oxfordshire, England."]}, {"page": "Hemery", "response": ["* Gabriel Hemery (b. 13 December 1968), an English forest scientist and author"]}, {"page": "Paradise Wood", "response": ["Planning for the wood started in 1992 and tree planting began in 1993.Clark, J. and Hemery, G. (2009) Outcomes from 15 years of hardwoods research at the Northmoor Trust. Quarterly Journal of Forestry. 103, 212-219.  The Research Woodland was originally conceived and developed by Gabriel Hemery and was established as a centre for research into the improvement of the quality and productivity hardwood trees.http://www.northmoortrust.co.uk/home/land_science/research_overview/forest_research_at_the_northmoor_trust.pdf The ultimate aim is to create a woodland of 55 hectares in area. It contains a large number of trials supervised by the Future Trees Trust.http://www.futuretrees.org/index.php?option=com_docman&task=doc_download&gid=17&Itemid=64"]}, {"page": "Silvology", "response": ["*Gabriel Hemery"]}, {"page": "Sarah Simblet", "response": ["In collaboration with Gabriel Hemery she co-wrote \"The New Sylva - a discourse of forest and orchard trees in the 21st century\" published by Bloomsbury Publishing in 2014 to mark the 350th anniversary of John Evelyn's work \"Sylva, or A Discourse of Forest-Trees and the Propagation of Timber\". The 200 illustrations for this book necessitated lengthy trips to the native haunts of the trees and drawing them in situ or returning with specimens to her studio in Wootton, West Oxfordshire.Village Hall Talks"]}]}}