{"wiki_id": "http://www.wikidata.org/entity/Q55136982", "itemLabel": "Claude Hinscliff", "itemDescription": "British suffragist", "wikipedia_url": "https://en.wikipedia.org/wiki/Claude_Hinscliff", "wikipedia_page": {"main": "Reverend Claude Hinscliff (1875–1964) was a British suffragist.", "link_mentions": [{"page": "Emily Davison", "response": ["On 14 June 1913 Davison's body was transported from Epsom to London; her coffin was inscribed \"Fight on. God will give the victory.\" Five thousand women formed a procession, followed by hundreds of male supporters, that took the body between Victoria and Kings Cross stations; the procession stopped at St George's, Bloomsbury for a brief service led by its vicar, Charles Baumgarten, and Claude Hinscliff, who were members of the Church League for Women's Suffrage. The women marched in ranks wearing the suffragette colours of white and purple, which The Manchester Guardian described as having \"something of the deliberate brilliance of a military funeral\"; 50,000 people lined the route. The event, which was organised by Grace Roe, is described by June Purvis, Davison's biographer, as \"the last of the great suffragette spectacles\". Emmeline Pankhurst planned to be part of the procession, but she was arrested on the morning, ostensibly to be returned to prison under the \"Cat and Mouse\" Act (1913)."]}, {"page": "Hatfield College, Durham", "response": ["Politicians and campaigners who have attended the college include Robert Buckland, a former Secretary of State for Justice and Lord Chancellor; Edward Timpson, the MP for Eddisbury and former Minister of State for Children and Families; and Labour Party life peer Baron Carter of Coles. From earlier generations of students, theology graduate and noted suffragist Claude Hinscliff, conducted the funeral service for Emily Davison; and Clifford Nelson Fyle, a 1960 English graduate, wrote the lyrics to the Sierra Leone National Anthem. More recently, Jolyon Maugham – a 1995 law graduate – is founding director of the Good Law Project.Moyes, 1996, p. 315"]}, {"page": "St George's, Bloomsbury", "response": ["The Victorian novelist Anthony Trollope was baptised at the church in 1824. The wedding of F. B. Chatterton, manager of the Theatre Royal, Drury Lane, took place in 1853. Richard Meux Benson, founder of the first Anglican religious order for men, the Society of St John the Evangelist (also known as the \"Cowley Fathers\"), was baptised in the church. A funeral service for Emily Davison, the suffragette who died when she was hit by the King's horse during the 1913 Derby, took place that same year. The funeral was officiated by Claude Hinscliff and C. Baumgarten, both part of the Church League for Women's Suffrage. Emperor Haile Selassie of Ethiopia attended a controversial requiem for the dead of the Abyssinian War in 1937."]}, {"page": "List of suffragists and suffragettes", "response": ["* Reverend Claude Hinscliff (1875–1964) – founder of the [Anglican] Church League for Women's Suffrage"]}, {"page": "Hacheston", "response": ["*Claude Hinscliff (1875–1964); suffragist."]}, {"page": "Charles Escreet", "response": ["In 1913 he co-officiated at the funeral of Emily Davison, the suffragette who had died under the king's horse at the Epsom Derby. His co-officiants were Claude Hinscliff, founder of the Church League for Women's Suffrage, and Charles Baumgarten, vicar of St. George's, Bloomsbury, where the service was held."]}, {"page": "Church League for Women's Suffrage", "response": ["The League was founded by the Reverend Claude Hinscliff in 1909, who was its secretary for a long time. Other founding members included Margaret Nevinson and Olive Wharry, and Joan Cather, whose husband Lt. John Leonard Cather was chair of its finance committee.", "Notable members included Frances Balfour and Louise Creighton and the more militant Muriel Matters, Florence Canning, the outstanding Maude Royden, Lady Constance Lytton and Katherine Harley. Emily Wilding Davison, who died under the King's horse at Epsom, was a member, and her funeral was held at St George's, Bloomsbury, led by its vicar, Charles Baumgarten (also a member of the League), Claude Hinscliff, and Charles Escreet, Archdeacon of Lewisham."]}, {"page": "Muriel Darton", "response": ["Darton photographed the General Council of the Church League for Womens’ Suffrage at their meeting in Brighton on 2 July 1913, and did individual portraits of Edward Lee Hicks, Bishop of Lincoln, Reverend Claude Hinscliff, founder of the CLWS, and Reverend Findlay Mons Green. These were sold through the CLWS and directly from Darton’s business at 40 Stapleton Hall Road, Stroud Green, London. As a result of this, Darton began advertising in the CLWS newspaper, with testimonials from the Bishop and Reverend Hinscliff in the September 1913 publication."]}]}}