{"wiki_id": "http://www.wikidata.org/entity/Q5517090", "itemLabel": "Gail Harris", "itemDescription": "British model, actress, and entrepreneur", "wikipedia_url": "https://en.wikipedia.org/wiki/Gail_Harris", "wikipedia_page": {"main": "Gail Harris (born 16 December 1964 in Batley, West Riding of Yorkshire, England) is a British-born model, actress, adult-magazine publisher, and adult-industry entrepreneur.", "link_mentions": [{"page": "High Society (magazine)", "response": ["In November 1981 a spin-off magazine, High Society Live!, debuted. Another venture was a celebrity focused publication, Celebrity Skin magazine,  in 1986. The 10th Anniversary Issue of High Society, published May, 1986 featured Gail Thackray (Gail Harris) with a 10-page spread, Centerfold and Front cover. Over its 25-year run Margot Kidder, Ann-Margret and Barbra Streisand unsuccessfully attempted to sue the magazine after it published nude photos of them."]}, {"page": "Mayfair (magazine)", "response": ["*Gail Harris (Gail Thackary)"]}, {"page": "Barely Legal (magazine)", "response": ["In 1988, Gail Harris, founder and CEO of Falcon Foto created, developed and produced from conception the first niche magazine, Barely Legal, for Larry Flynt Publications; it became one of Flynt's best-selling titles, second only to Hustler Magazine. The first issue of Barely Legal, the \"Premiere Issue\", was released in September 1993.", "Gail Harris was featured as a centerfold model and on the front cover of the March 1986 issue of Hustler."]}, {"page": "Sorority House Massacre II", "response": ["Sorority House Massacre II (also known as Sorority House Massacre II: Nighty Nightmare) is a 1990 American slasher film directed by Jim Wynorski, featuring scream queens Melissa Ann Moore and Gail Harris (credited as Robyn Harris). Much like its predecessors, Sorority House Massacre II has received a cult following over the years.", "*Gail Harris as Linda", "The film was made in seven days. Wynorski says \"I was adding humor whenever possible and making sure there was plenty of nudity along the way. At first, the script ended when the cops arrived in the morning and found the Gail Harris character alive and holding the knife. I said to hell with that and continued on.bringing Orville back to life one more time to take care of business.\""]}, {"page": "Sorority House Massacre III: Hard to Die", "response": ["Sorority House Massacre III: Hard to Die (also known as Tower of Terror or simply Hard to Die) is a 1990 American slasher film written by Mark Thomas McGee and James B. Rogers, directed by Jim Wynorski, and starring Gail Harris and Melissa Moore. The film features a similar storyline and many of the same actresses from its predecessor, and Wynorski's previous film Sorority House Massacre II, of which Hard to Die is essentially a remake.", "*Gail Harris as Linda Dawn Grant (as Robyn Harris)"]}, {"page": "List of people with surname Harris", "response": ["*Gail Harris (born 1964), English actress", "*Gail Harris (baseball) (1931–2012), American baseball player"]}, {"page": "Brandi Love", "response": ["In 2006, she collaborated with Gail Harris of Falcon Foto to form Naked Rhino Media, a multimedia company creating porn sites that feature exclusive niche-specific content. Then, in 2011, she began performing for adult studios. In 2013, it was announced that Kelly Madison Media was developing a new website for Love and would take part in the production of new content."]}, {"page": "Takin' It All Off", "response": ["Takin' It All Off is a 1987 straight-to-video release from Ed Hansen and Robert T.Gervasoni's Hansen / Gervasoni productions company, and provided a quick sequel to Hansen and Gervasoni's popular 1985 feature Takin' It Off. The cast includes Kitten Natividad, cult actor George 'Buck' Flower, adult actress Jean Poremba and the British glamour model Gail Harris."]}, {"page": "Electric Blue (TV series)", "response": ["Electric Blue is a softcore pornography show that aired mainly on the Playboy Channel in the early 1980s. The show was produced in the UK.  Many prominent porn stars performed on Electric Blue, including Ginger Lynn, Traci Lords,  Marilyn Chambers, Christy Canyon, Sasha Gabor, Blake Palmer, Janey Robbins, and Rick Savage. Hustler Magazine centerfold model and \"scream queen\" actress Gail Harris made appearances in many episodes.", "* Electric Blue 38  (1986)     Careena Collins, Samantha Fox, Gail Harris", "* Electric Blue 41 (1986)     Blondi, Gail Harris", "* Electric Blue 43  (1986)     Blondi, Careena Collins, Gail Harris", "* Electric Blue 47  (1987)     Gail Harris, Ginger Lynn", "* Electric Blue 48  (1987)     Gina Carrera, Careena Collins, Gail Harris", "* Electric Blue 49  (1987)     Michelle Bauer, Careena Collins, Gail Harris ", "* Electric Blue 50  (1987)     Aja, Careena Collins, Gail Harris"]}, {"page": "List of horror films of 2004", "response": ["| Jay Andrews || J.P. Davis, Gail Harris, Ted Monte || United States || "]}, {"page": "Curse of the Komodo", "response": ["* Gail Harris as Dawn Porter"]}, {"page": "Sins of Desire", "response": ["*Gail Harris as Monica Waldman"]}, {"page": "Massacre (franchise)", "response": ["| colspan=\"2\" | Gail Harris"]}, {"page": "Virtual Desire", "response": ["* Gail Harris as Wendy"]}, {"page": "Gail Thackray", "response": ["#redirectGail Harris"]}]}}