{"wiki_id": "http://www.wikidata.org/entity/Q5512228", "itemLabel": "G. F. Green", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/G._F._Green", "wikipedia_page": {"main": "G. F. Green (George Frederick Green) (1911–1977), was a British writer of novels and short stories.", "link_mentions": [{"page": "Green (surname)", "response": ["*G. F. Green (1911–1977), British author"]}, {"page": "The International Jew", "response": ["In June 1949, a 174-page, one-volume abridgement of the text appeared, titled The International Jew, subtitled \"The World's Foremost Problem\", edited by the British journalist George F. Green. This George F. Green seems not to be the same person G. F. Green (George Frederick Green), a British fiction writer. who served as the editor of the Independent Nationalist, a British fascist publication. This Independent Nationalist is not the same as the Irish political title \"Independent Nationalist\". The book was sold in the United States by the Christian Nationalist Crusade."]}, {"page": "G.F. Green", "response": ["#redirect G. F. Green"]}, {"page": "G F Green", "response": ["#REDIRECT G. F. Green "]}, {"page": "GF Green", "response": ["#REDIRECT G. F. Green "]}, {"page": "Horizon (magazine)", "response": ["*G. F. Green"]}, {"page": "George F. Green", "response": ["* G. F. Green (George Frederick Green, 1911–1977), British fiction writer"]}, {"page": "Index of Sri Lanka–related articles (G)", "response": ["# G. F. Green"]}, {"page": "Peter Parker (author)", "response": ["Among the books to which Parker has contributed are Scribner's British Writers (on L. P. Hartley, 2002), the seventh edition of The Oxford Companion to English Literature (2009), Fifty Gay and Lesbian Books Everybody Must Read (2009) and Britten's Century, published in 2013 to mark the centenary of the composer Benjamin Britten. His edition of G. F. Green's 1952 novel In the Making was published as a Penguin Modern Classic in 2012, and in 2016 he wrote an introduction to the Slightly Foxed edition of Diana Petre's 1975 memoir The Secret Orchard of Roger Ackerley. A full-length animated feature film of J. R. Ackerley's book My Dog Tulip, for which he collaborated on the script and acted as advisor to the producers, was released in 2010."]}]}}