{"wiki_id": "http://www.wikidata.org/entity/Q5525656", "itemLabel": "Gary Newbon", "itemDescription": "British sports presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Gary_Newbon", "wikipedia_page": {"main": "Gary Newbon MBE (born 15 March 1945 in Cambridge, Cambridgeshire) is a television sports presenter and executive.", "link_mentions": [{"page": "ITV Central", "response": ["With the creation of a dedicated ITV Sport network unit, Central also played a significant part in networked sports output under the leadership of Gary Newbon. The station produced nearly all of ITV's football coverage for over a decade – including the FA Cup, UEFA Champions' League, the FIFA World Cup, the UEFA European Championship and Premier League highlights, as well as extensive live regional coverage of Football League matches involving Midlands clubs in The Central Match. The station also played its part in coverage of key European athletics meetings and world championship boxing with The Big Fight Live as a long-standing Saturday night fixture. In 2004, the department was moved to London and merged with the London News Network's operations to form ITV Sport Productions."]}, {"page": "List of sports announcers", "response": ["* Gary Newbon – ITV Sport 1969–2005, talkSport 1995–2005, Sky Sports 2005–present", "* Gary Newbon – Sky Sports 2005"]}, {"page": "Talksport", "response": ["The station was originally and officially launched as Talk Radio UK on 14 February 1995, with the original Talk Radio Breakfast Show. However, the first live broadcast had been Caesar the Geezer's phone-in which aired the previous night. Other presenters on Talk Radio included Jeremy Beadle, Tommy Boyd, Anna Raeburn, Lorraine Kelly, Gary Newbon, Terry Christian, and Dale Winton. Also in the line-up were Caesar the Geezer, Wild Al Kelly and Nick Miller, dubbed as shock jocks.", "On 12 November 1998, TalkCo Holdings – whose chairman and chief executive was Kelvin MacKenzie, former editor of The Sun – purchased Talk Radio. This led to a mass clearout of presenters including Nick Abbot, Anna Raeburn, Tommy Boyd and Peter Deeley, the new owner putting in place a more sports-oriented programming schedule—including The Sportszone with Alan Parry, Gary Newbon, Tony Lockwood, Tom Watt, and former Century Radio sports editor Dave Roberts presenting the weekend edition of The Sports Breakfast.", "The new line-up involved a number of presenters and commentators, including Alan Brazil, Mark Nicholas, Chris Cowdrey, Geoffrey Boycott, Mike Parry, Peter Shilton, Brian Moore, Brough Scott, Tom Watt, Gary Newbon, Ian Darke, Tony Banks, and Alvin Martin."]}, {"page": "Professional Darts Corporation", "response": ["John Gwynne has covered all PDC events from the inaugural 1992 competition until his retirement in 2013. Dave Lanning covered all events up until December 2010, when he retired. Contrary to popular belief, long-time BBC darts commentator Sid Waddell did not switch allegiances to Sky until after the 1994 BDO World Championship. He brought his own unique brand of commentary to the game, and was a cult figure amongst darts fans and sport fans alike. He continued to commentate until his death in 2012. The current commentators on Sky include Nigel Pearson, Rod Studd, Stuart Pyke and former players Rod Harrington, Wayne Mardle, and three time World Champion John Part. Former BBC commentator and now Sky F1 commentator David Croft presents when Dave Clark is unavailable and also occasionally provides commentary. Jeff Stelling was the original presenter of Sky Sports' darts coverage, but most of the events are now presented by Clark. In addition, the 2005 Premier League was fronted by Gary Newbon.  Five-time world champion Eric Bristow was sacked in December 2016 by Sky Sports."]}, {"page": "Telford Tigers", "response": ["Telford Tigers IH Club Ltd. was formed for season 1985–86 by Central TV commentator Gary Newbon with entertainer David Ismay as chairman and Canadian defenceman Chuck Taylor as player coach. Newbon and Taylor had previously been involved with the Barons, as had squad members Mark Budz, Gordie Patterson, Alan Gould, Paul O'Higgin and Dave Welch. Goalie John Wolfe and Andy Steel signed for the new club from Grimsby."]}, {"page": "Culford School", "response": ["*Gary Newbon (Sky Sports presenter)"]}, {"page": "You're On Sky Sports", "response": ["You're On Sky Sports was a topical football phone-in discussion television programme on Sky Sports 1 and Sky Sports News Radio. Originally hosted by Rob Hawthorne then Rob McCaffrey and Gary Newbon, the show was chaired by Jason Cundy. There will always be one or two panel members, whether former football professionals or others involved with the game in some form. Regulars include Steve Claridge, Kenny Sansom, Peter Beagrie, Tony Gale and Warren Barton. The program usually aired at 10pm either the night of a UEFA Champions League match or a Premier League match that is aired on Sky Sports."]}, {"page": "1999 UEFA Champions League Final", "response": ["In winning the trophy, Manchester United became the first English team to be crowned European champions since the Heysel Stadium disaster ban in 1985, which had resulted in English clubs being excluded from UEFA competitions for five years, and also the first team to achieve the treble of the Premier League, FA Cup, and European Cup in the same season. It was the first time the treble had been won since PSV Eindhoven in 1988; it would not be won again until Barcelona beat Manchester United 10 years later in the 2009 UEFA Champions League Final. After becoming the first manager of an English club to achieve this honour, Ferguson was made a Knight Bachelor on 12 June 1999 in recognition of his services to football, as well as a bonus from the club reported to be in the region of £350,000 (the players received bonuses of £150,000 each).Ferris (2004), p. 331. In a post-match interview with ITV's Gary Newbon, Ferguson provided a succinct summary of the game: \"Football, eh? Bloody hell\".Ferris (2004), p. 394. After the treble was secured, much debate arose among English football fans as to whether the 1999 Manchester United team was the greatest club side ever, alongside past European Cup-winning teams. It was such a significant achievement for an English football club that Prime Minister Tony Blair took the time to watch part of the match and congratulate Manchester United from the opening of the new National Assembly for Wales in Cardiff."]}, {"page": "Birmingham City W.F.C.", "response": ["In March 2003, local sports reporter Gary Newbon criticised women's football and bet the club £500 that they could not attract 500 supporters to their upcoming match against Doncaster Belles. Humiliated Newbon lost his bet. The academy had begun to produce players for the first team at this point, and Laura Bassett became the first Birmingham City Ladies player, from the academy or otherwise, to appear for England at full international level."]}, {"page": "You Got the Love", "response": ["The 2006 version features the \"New Voyager mix\" in a black and white video. Set in London, it portrays an angelic young man (played by broadcaster Gary Newbon's son Neil) watching over the poor, lonely and vulnerable in the streets, subways and gardens. (Referencing the Wim Wenders film Wings of Desire)"]}, {"page": "Birmingham Walk of Stars", "response": ["| 14 || Gary Newbon || 10 December 2009 || Television journalism || Sports Reporter || 200px || "]}, {"page": "Media Archive for Central England", "response": ["MACE released From Headlines to 'Tight-Lines' - The Story of ATV Today, a 2 disc DVD in four parts which chronicles the story of regional news magazine programme ATV Today from its beginning in 1964 to the last programme on 31 December 1981, and looks back at some of the big news stories in the region that made the headlines through the 1960s and 1970s through interviews and a wealth of archive films. Interviewees are former ATV reporters Bob Hall, Reg Harcourt, Sue Jay, Wendy Nelson, Gary Newbon, Nick Owen, Chris Tarrant and Bob Warman as well as former ATV Cameraman Gary Hughes and former ATV Production Assistant, Barbara Bradbury. Part 1: The 1960s, Part 2: The Early 1970's, Part 3: The Golden Era, Part 4: The Final Chapter. in 2013, From Headlines to 'Tight-Lines' won a FOCAL International Award for Best Use of Footage in a Home Entertainment Release."]}, {"page": "List of ITV journalists and newsreaders", "response": ["* Gary Newbon"]}, {"page": "Britain's Got the Pop Factor... and Possibly a New Celebrity Jesus Christ Soapstar Superstar Strictly on Ice", "response": ["*Gary Newbon as himself"]}, {"page": "Neil Newbon", "response": ["Newbon was born in Solihull, England, the son of ITV sportscaster Gary Newbon. His twin brother Lawrence also works in the film and television industry as a cameraman."]}, {"page": "ATV Today", "response": ["The sports team included Gary Newbon, Trevor East, Jimmy Greaves, Terry Thomas, Terry Biddlecombe, Nick Owen and ATV head of sport Billy Wright."]}]}}