{"wiki_id": "http://www.wikidata.org/entity/Q5528074", "itemLabel": "Gavin Blyth", "itemDescription": "TV Producer and journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Gavin_Blyth", "wikipedia_page": {"main": "Gavin John Blyth (27 October 1969 – 26 November 2010) was a British television producer and journalist. He was well known for being series producer of Emmerdale from January 2009 until his death. Beginning his career in 2002, he joined Emmerdale in 2003 as a writer. He later went on to be an assistant producer and also a story editor on Coronation Street.", "link_mentions": [{"page": "Emmerdale", "response": ["The early and mid-2000s saw the introduction of major long-term characters, including the King family and Cain (Jeff Hordley) and Charity Dingle (Emma Atkins). This era also saw high-profile castings such as Patsy Kensit as Sadie King in 2004, and Amanda Donohoe and Maxwell Caulfield as Natasha and Mark Wylde in 2008. Major storylines during this period included a bus crash, Sarah Sugden's death in a barn fire, a New Year's Eve storm, the Kings River explosion, and the Sugden house fire. In 2009, the longest-tenured character, Jack Sugden (Clive Hornby), was killed off. Jack's funeral featured the first on-screen appearance in 13 years of Annie Sugden (Sheila Mercier). Also in 2009, executive producer Keith Richardson was replaced by former series producer Steve November (later replaced by John Whiston). Gavin Blyth became the series producer, followed by Stuart Blackburn after his death."]}, {"page": "Southport", "response": ["* Gavin Blyth, journalist and ex-Emmerdale producer"]}, {"page": "The British Soap Awards", "response": ["| \"Special Achievement Award\"Presented by Danny Miller|| Gavin Blyth (Emmerdale); posthumously || N/A"]}, {"page": "Tarleton Academy", "response": ["*Gavin Blyth - Journalist/ Emmerdale producer"]}, {"page": "Charity Dingle", "response": ["On 18 March 2009, it was announced Atkins would be returning to Emmerdale as part of the ongoing overhaul of the show by series producer, Gavin Blyth. Of her decision to reprise her role, Atkins said: \"Charity is a wonderfully complex character and an absolute joy to play. I couldn't resist the opportunity to explore a new era of Charity, Cain and Debbie and will relish seeing what she's been up to since we saw her last.\" Charity and her five-year-old son returned on 1 October 2009. Two months later, Digital Spy's Kris Green reported Atkins had signed a six-month extension to her contract, keeping her with the show well into 2010."]}, {"page": "Danny Miller (actor)", "response": ["In 2011, Miller co-founded the charity Once Upon a Smile with Daniel Jillings in memory of former Emmerdale producer Gavin Blyth.Once Upon a Smile – Our Story. Onceuponasmile.org.uk (6 July 2015). Retrieved on 17 February 2016. In January 2021, Miller got engaged to partner Steph Jones. The couple announced in May 2021 that they were expecting their first child. After being told they would be unlikely to conceive naturally, Miller explained that they were about to begin the IVF process, when they found out they were pregnant. The child's birth was announced on 27 October 2021."]}, {"page": "Lizzie Lakely", "response": ["In January 2009, it was announced that Anita Turner had stepped down from the position of series producer and that Gavin Blyth had taken over the role. With Turner's departure Blyth began the show's rejuvenation and with that came his first signing, actress Kim Thomson as Faye Lamb. On 2 March 2009, it was announced that Emmerdale had signed comedian Kitty McGeever, the first blind actress to be cast in a British soap, as Lizzie Lakely, the cousin of Lisa Dingle (Jane Cox). Speaking of her casting, McGeever said, \"I'm thrilled to be joining Emmerdale as Lizzie and delighted that the show is challenging stereotypes in this way. Lizzie spells trouble from the word go and will be causing all kinds of strife in the village.\" Of the casting, the show's series producer Blyth said, \"Kitty is an extremely talented actress and I'm pleased that she will be joining the show, marking the arrival of such a fascinating character. Lizzie is forthright and fun and she'll soon prove that she isn’t afraid to manipulate circumstances to her advantage.\""]}, {"page": "2010 in British television", "response": ["|Gavin Blyth"]}, {"page": "Faye Lamb", "response": ["The character was first introduced to Emmerdale by then-series producer Gavin Blyth in March 2009, played by Kim Thomson. The character was introduced as a 'mysterious' acquaintance of Mark Wylde, and as his story progressed, it later transpired that Faye had been married to Mark (who at the time of the marriage was known as Daniel Lamb). In July 2009, Faye moved into the village with her son Ryan."]}, {"page": "Moira Barton", "response": ["Moira Dingle (also Barton) is a fictional character from the British soap opera Emmerdale, played by Natalie J. Robb. The actress successfully auditioned for the role after a call came through her agent. Robb's character and her family were created and introduced to Emmerdale as part of an overhaul of the show by the series producer Gavin Blyth. The Barton family took over the running of Butler's Farm and they were described as being \"sexy, modern and contemporary\". Robb first appeared as Moira during the episode broadcast on 17 July 2009.", "In May 2009, it was announced that Emmerdale's new series producer, Gavin Blyth, would be introducing a new farming family called the Bartons, as part of an ongoing overhaul of the show. The family, which consists of five members - a mother, father, two daughters and a son - took over the running of Butler's Farm. Of the family, Blyth said \"I don't want to make Emmerdale a show about teenagers and young people, it's about family values. The Bartons are sexy, modern and contemporary. They're almost happy - and in soapland that's quite strange!\" James Thornton was cast in the role of John Barton and Adam Thomas, Sophie Powles and Grace Cassidy were cast as Adam, Holly and Hannah respectively."]}, {"page": "Jai Sharma", "response": ["On 21 July 2009, entertainment website Digital Spy reported that Emmerdale would be introducing \"a new trio of entrepreneurial siblings\", Jai, Nikhil and Priya Sharma as part of the soap's ongoing reinvention. Former Coronation Street actor Chris Bisson was cast as Jai Sharma, along with Rik Makarem and Effie Woods who were cast in the roles of Nikhil and Priya Sharma respectively. Of his casting Bisson commented: \"Jai is a bit of a charmer and has an eye for the ladies but he's also a hard worker with a good business mind. I'm delighted to be joining Emmerdale at a time when the show is going from strength to strength. I can't wait to get started.\" The show's series producer Gavin Blyth said of the family: \"The Sharmas are a young, contemporary family independent of their parents and will bring the factory into the heart of the village community. They will add real vitality to life in Emmerdale.\" Bisson began filming his scenes on 21 July."]}, {"page": "Nikhil Sharma", "response": ["On 21 July 2009, Kris Green of Digital Spy reported Emmerdale's' new series producer, Gavin Blyth, would be introducing a new family called the Sharmas as part of an ongoing overhaul of the show. The family, which consisted of three siblings, arrived in the village to manage a new confectionery factory. Of the siblings, Blyth said \"The Sharmas are a young, contemporary family independent of their parents and will bring the factory into the heart of the village community. They will add real vitality to life in Emmerdale.\" Chris Bisson was cast as the eldest sibling, Jai, and Effie Woods was cast as the youngest sibling, Priya (later played by Fiona Wade)."]}, {"page": "2010 in the United Kingdom", "response": ["*26 November – Gavin Blyth, producer (b. 1969)"]}, {"page": "Jackson Walsh", "response": ["In March 2010, Digital Spy announced that former Hollyoaks actor Silcock had joined the cast of Emmerdale as Jackson Walsh, a potential love interest for Aaron Livesy (Danny Miller). Emmerdale series producer Gavin Blyth said Jackson is a \"very contemporary gay character\" and not a stereotype. Of his casting, Silcock said \"I've always been a fan of Emmerdale, so I'm thrilled to be joining the cast. Jackson will play a big part in Aaron's journey and I'm so pleased to be involved in this story.\" Jackson is Silcock's second role with Emmerdale having previously appeared as Josh Hope."]}, {"page": "Eve Jenson", "response": ["Eve Jenson (also Birch) is a fictional character from the British ITV soap opera, Emmerdale, played by Suzanne Shaw. She made her first on-screen appearance on 31 August 2001. The character was originally played by Raine Davison from 2001 to 2006. In early 2010, series producer Gavin Blyth recast the role and Shaw took over. Eve was introduced as the granddaughter of Edna Birch (Shirley Stelfox). In April 2011, it was announced that Shaw had quit her role of Eve and she departed on 2 August 2011.", "In January 2010, it was announced that Eve would be returning to the show after a nearly four-year absence with a new actress in the role. Series producer Gavin Blyth stated in an interview with Digital Spy that he auditioned 50 to 60 actresses for the role, one of them being former Hear'Say singer and West End theatre star Suzanne Shaw who made the trip to Yorkshire from Manchester where she was playing Judy Haynes in the musical White Christmas. The decision to cast Shaw was announced on 29 January. Shaw signed a year-long contract and debuted on 2 April 2010.", "Discussing the audition proses Shaw said \"I got asked before Christmas to audition for the part of Eve. I was asked to do a screen test, but it got snowed off because of all the bad weather over Christmas. I didn't hear anything for ages and I thought it wasn't going to happen, and then just a few weeks before I started filming they offered me the part. It was a lovely surprise. They auditioned quite a lot of actresses for the role. I was up against some strong contenders so it was quite nerve-wracking when I went in, but Gavin Blyth, the producer, was so lovely and made me feel really at ease.\" "]}, {"page": "Adam Barton (Emmerdale)", "response": ["In May 2009, it was announced that Emmerdale's new series producer, Gavin Blyth, would introduce The Bartons, a new farming family, as part of an ongoing overhaul of the show. The family, which comprises five members - mother, father, two daughters and a son - took over the running of Butler's Farm. Of the family, Blyth said \"I don't want to make Emmerdale a show about teenagers and young people, it's about family values. The Bartons are sexy, modern and contemporary. They're almost happy - and in soapland that's quite strange!\" Natalie J. Robb and James Thornton were cast in the roles of parents, John and Moira. Sophie Powles and Grace Cassidy were cast their daughters, Holly and Hannah respectively."]}, {"page": "Holly Barton", "response": ["Holly Barton is a fictional character from the British ITV soap opera, Emmerdale, played by Sophie Powles. She made her first on-screen appearance during the episode broadcast on 17 July 2009. Holly was introduced to the soap as part of the Bartons, a new farming family who took over the running of Butler's Farm. Holly was joined by her mother, father and two siblings. The family were described as being \"sexy, modern and contemporary\" by the show's series producer, Gavin Blyth. Holly departed on 20 June 2012, but Powles later reprised her role and Holly returned on 24 March 2016 for a six-month stint. The character was killed off on 29 September 2016.", "In May 2009, it was announced that Emmerdale's new series producer, Gavin Blyth, would introduce The Bartons, a new farming family, as part of an ongoing overhaul of the show. The family, which comprises five members - mother, father, two daughters and a son - took over the running of Butler's Farm. Of the family, Blyth said \"I don't want to make Emmerdale a show about teenagers and young people, it's about family values. The Bartons are sexy, modern and contemporary. They're almost happy - and in soapland that's quite strange!\" Natalie J. Robb and James Thornton were cast in the roles of parents, John and Moira. Adam Thomas and Grace Cassidy were cast as their children Adam and Hannah."]}, {"page": "Alicia Gallagher", "response": ["On 23 May 2010, it was announced that Anderson had joined the cast of Emmerdale as Alicia, the estranged sister of established character Leyla Harding (Roxy Shahidi). Of her casting, Anderson commented \"I'm absolutely thrilled to be joining the show. It'll be wonderful to be working back home in Yorkshire again. I'm a Yorkshire girl so a part in Emmerdale is a dream come true!\" Anderson revealed that she had known the series producer for a long time and had previously auditioned for a role in another soap opera in front of him, so when the part of Alicia came up he thought of her and asked her to audition. Series producer Gavin Blyth stated that Anderson was \"a wonderful addition to the cast\" and said Alicia would stir things up in Leyla's life from the minute she arrives. Anderson initially signed a six-month contract and began filming in June. She made her screen debut as Alicia in August."]}, {"page": "Deaths in November 2010", "response": ["*Gavin Blyth, 41, British television producer, cancer."]}, {"page": "Ella Hart", "response": ["In September 2010, it was announced that a new family would be introduced to Emmerdale, following the departure of the established Wylde family. It was revealed that the family would be that of established character Declan Macey (Jason Merrells), who first appeared in the soap in April 2010. Former Doctors actress Corrinne Wicks was cast in the role of Ella Hart, the ex-wife of Declan. Sapphire Elia was cast in the role of Mia Macey, Declan and Ella's daughter, whilst Frank Kelly was cast in the role of Dermot, Declan's father. Of her casting, Wicks commented: \"I'm so thrilled to be joining the fantastic cast of Emmerdale, Ella is going to be great fun. She's feisty and glamorous with a no-nonsense attitude. I can't wait to get started as the Maceys make their mark on the Dales.\" Of the family, Emmerdale series producer Gavin Blyth added: \"I'm so pleased to be welcoming three superb actors to our cast at this exciting time. The Maceys are glamorous and dynamic, and their move to the big house signals a new era at Home Farm which will see them firmly at the centre of some of our most compelling storylines.\""]}, {"page": "Amy Wyatt", "response": ["Series producer Gavin Blyth first mentioned Amy's arrival in June 2010. He said the characters of Val (Charlie Hardwick) and Eric Pollard (Chris Chittell) faced a \"fascinating future\" with the arrival of a \"fresh-faced stranger who takes a shine to the pair.\" Amy debuted on-screen on 8 October 2010 when she found herself stranded outside the village. She later moves in with Val and Eric and attempts to rebuild her life."]}, {"page": "John Barton (Emmerdale)", "response": ["John Barton is a fictional character from the British soap opera Emmerdale, played by James Thornton. The actor was asked to audition for the part and he called it the \"most frightening audition\" he had ever done. Thornton won the role of John, who was introduced to Emmerdale along with his family as part of an overhaul of the show by the series producer Gavin Blyth. The Barton family took over the running of Butler's Farm and they were described as being \"sexy, modern and contemporary\". Thornton made his debut screen appearance during the episode broadcast on 17 July 2009. The following year, he signed a one-year extension to his contract. In November 2011, Thornton revealed that he was to leave Emmerdale after three years and he departed on 16 February 2012.", "On 22 May 2009, it was announced a new farming family called the Bartons would be introduced to Emmerdale in July. Kris Green of Digital Spy reported the show's series producer, Gavin Blyth was introducing the new family as part of an ongoing reinvention of the soap. The family, which consisted of five members – a mother, father, two daughters and a son – took over the running of Butler's Farm. Of the family, Blyth said \"I don't want to make Emmerdale a show about teenagers and young people, it's about family values. The Bartons are sexy, modern and contemporary. They're almost happy – and in soapland that's quite strange!\" Natalie J. Robb was cast in the role of Moira Barton and Adam Thomas, Sophie Powles and Grace Cassidy were cast as teenagers Adam, Holly and Hannah respectively."]}, {"page": "Priya Sharma", "response": ["Priya Kotecha (née Sharma) is a fictional character from the British ITV soap opera, Emmerdale, played by Fiona Wade. The character was introduced along with her brothers Jai (Chris Bisson) and Nikhil (Rik Makarem) by series producer, Gavin Blyth, as part of an ongoing overhaul of the show. Blyth described the characters as young, contemporary and living independent of their parents. Priya was originally played by Effie Woods from her introduction on 14 September 2009 until 1 March 2010. Wade took over the role in 2011.", "On 21 July 2009, Kris Green from Digital Spy reported Emmerdale new series producer, Gavin Blyth, would be introducing a new family called the Sharmas part of an ongoing overhaul of the show. The family, which consisted of three siblings, arrived in the village to manage a new confectionery factory. Of the siblings, Blyth said \"The Sharmas are a young, contemporary family independent of their parents and will bring the factory into the heart of the village community. They will add real vitality to life in Emmerdale.\" Chris Bisson was cast as eldest sibling, Jai, and Rik Makarem was cast as Nikhil. Effie Woods received the role of their younger sister, Priya. Woods was working in a call centre when her agent called to tell her she had won the part. Woods commented \"I just ran down the corridor screaming – it was so amazing! It's a big show with such a history and such weight to it.\""]}, {"page": "Leyla Harding", "response": ["In May 2010, Digital Spy reported that Leyla's sister, Alicia Gallagher (Natalie Anderson), would be introduced. The website said Alicia arrives in the village and makes it clear that she has unfinished business with Leyla. Leyla and Alicia's relationship is \"far from perfect\". Leyla is forced to deal with Alicia's arrival in an attempt to keep her \"murky and scandal-ridden\" past buried. Anderson said that Alicia was set to make life quite complicated for Leyla. Emmerdale series producer Gavin Blyth added that Alicia will start stirring things up in Leyla's life the minute she sets foot in the village. Alicia arrives in the village to warn Leyla that she does not want her at their mother's funeral. However, Leyla ignores Alicia and they \"have a bit of a screaming match\" at the funeral, which leaves Alicia annoyed. Discussing what caused the \"bad blood\" between Alicia and Leyla in an interview with Digital Spy, Anderson said, \"All I can really say is that something has definitely gone on between them! [...] The biggest clue I can give is that Alicia is fiercely protective of her family unit and she doesn't want anything to come between that. So you can read into that what you want!\" Anderson said that Alicia does not want to cause trouble, but does not want Leyla around. Anderson added that Alicia would \"prefer it if [Leyla] just disappeared\". Alicia was introduced along with her husband, Justin (Andrew Langtree), and their son, Jacob (Joe Warren-Plant)."]}, {"page": "Kate Oates", "response": ["Oates began working on the ITV soap opera Emmerdale in early 2010 as a story editor, under then-producer, Gavin Blyth. Oates edited various storylines for the show, including Aaron Livesy (Danny Miller) assisting the suicide of his boyfriend, Jackson Walsh (Marc Silcock), which won the British Soap Award for Best Storyline in 2012. Oates held a key role in the soap's fortieth anniversary celebrations and said that she was \"proud\" to be involved. Oates left her position at Emmerdale in 2012, having worked on the show for two and a half years. Reflecting on Oates' work on the show as story editor, John Whiston, the creative director of ITV soaps, commented, \"Kate swept into Emmerdale a couple of years ago with a deadly combination of determination and brio. She soon proved her worth to the show, working on stories that ranged from the extremely tough to the light and funny.\""]}]}}