{"wiki_id": "http://www.wikidata.org/entity/Q552874", "itemLabel": "Trevor Bailey", "itemDescription": "England Test cricketer, cricket writer and broadcaster (1923-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Trevor_Bailey", "wikipedia_page": {"main": "Trevor Edward Bailey  (3 December 1923 – 10 February 2011) was an England Test cricketer, cricket writer and broadcaster.\nAn all-rounder, Bailey was known for his skilful but unspectacular batting. As the BBC reflected in his obituary: \"His stubborn refusal to be out normally brought more pleasure to the team than to the spectators.\" This defensive style of play brought him the first of his nicknames, \"Barnacle Bailey\", but he was a good enough cricketer to be retrospectively judged as the leading all-rounder in the world for most of his international career.\nIn later life, Bailey wrote a number of books and commentated on the game. He was particularly known for the 26 years he spent working for the BBC on the Test Match Special radio programme.", "link_mentions": [{"page": "The Ashes", "response": ["The tide finally turned in 1953 when England won the final Test at The Oval to take the series 1–0, having narrowly avoided defeat in the preceding Test at Headingley. This was the beginning of one of the greatest periods in English cricket history with players such as captain Len Hutton, batsmen Denis Compton, Peter May, Tom Graveney, Colin Cowdrey, bowlers Fred Trueman, Brian Statham, Alec Bedser, Jim Laker, Tony Lock, wicket-keeper Godfrey Evans and all-rounder Trevor Bailey."]}, {"page": "December 3", "response": ["*1923 – Trevor Bailey, English cricketer and sportscaster (d. 2011)"]}, {"page": "February 10", "response": ["*2011 – Trevor Bailey, English cricketer and journalist (b. 1923)"]}, {"page": "Richie Benaud", "response": ["The next season, England toured Australia, and with the Test players back, Benaud was initially forced out of the team. He was recalled for a match against the Englishmen. He was attacked by the touring batsmen, taking 1/75 from 16.5 overs in his first outing against an international outfit. His only wicket was that of the all-rounder Trevor Bailey. He scored 20 not out and was not called on to bowl in the second innings."]}, {"page": "Dulwich College", "response": ["Colours for sporting achievement were the first such colours to be established at the college (see School uniform and colours below). Originally colours consisted of blazers for the 1st and 2nd team of the major sports, rugby and cricket (as well as ties, caps and squares) and colours for minor sports, (not extending to a full blazer but blazer badges plus caps and ties). Caps were also available, such as for rugby, the pie shaped porkerJ R Piggott (2008), Dulwich College, a History 1616–2008, pages 303 (Dulwich College: London) and more exclusive items such as the rare rugby honours cap, and the white blazer, only awarded on the recommendation of the Field Sports Committee with the essential requirement being that a boy be a member of both the Cricket 1st XI and the Rugby 1st XV and display prominence in a minor sport.J R Piggott (2008), Dulwich College, a History 1616–2008, pages 227 (Dulwich College: London) Testament to the judgment of the committee are the careers of certain alumni who received this blazer such as Trevor Bailey the England cricket all-rounder, who was so awarded because he was also a distinguished squash player.", "Notable Old Alleynians include Sir Ernest Shackleton, Sir P G Wodehouse, Raymond Chandler, Sir Edward George, Bob Monkhouse, Michael Ondaatje, Chiwetel Ejiofor, politician and broadcaster Nigel Farage, the cricketer Trevor Bailey, C. S. Forester and the architect C. F. A. Voysey."]}, {"page": "Colin Cowdrey", "response": ["With a pair of centuries against the strongest state side in Australia Cowdrey was called up for his debut in the First Test at Brisbane, even though he made 4 and 0 against Queensland. Hutton put Australia in to bat and saw them pile up 601/8. The only good news was that Cowdrey took the first of his record 120 Test catches to dismiss both Australian openers Les Favell and Arthur Morris. When England finally got to bat on the third day they promptly collapsed to 25/4, but Cowdrey made 40 and added 72 for the 5th wicket with Trevor Bailey. This did not prevent the follow on, where Cowdrey made 10, and England lost by an innings. ", "The Third Test in Melbourne was the highlight of Cowdrey's tour, perhaps even his career. Hutton won the toss and elected to bat on New Year's Eve, but soon regretted it. Miller opened the bowling with a spell of 9–8–5–3 to send Hutton, Bill Edrich and Denis Compton back to the pavilion in quick time.Swanton, p. 95 When Ray Lindwall dismissed Peter May for a duck England were in deep trouble at 41/4. Ralph Barker wrote \"Surviving the early horrors through perfect technique, the 22-year-old Cowdrey made 50 out of 69 and 100 out of 158\".Barker, Ralph & Rosenwater, Irving. England v Australia: A compendium of Test cricket between the countries 1877–1968, B.T. Batsford, 1969; , p. 225. He completed his maiden Test century, adding 74 with Trevor Bailey (30) and 54 with his Kent teammate Godfrey Evans (20) before falling to Ian Johnson with a ball that \"hit the edge of one of the cracks in the wicket, which was now assuming the appearance of a tessellated pavement. It jagged back to pass behind Kipper's pads and hit his leg stump!”", "The generosity of the white South African hosts towards the MCC team was almost their undoing Cowdrey remembering \"If we were not actually killed by kindness we were certainly reduced to something well short of the fitness that a Test team must maintain ... Our standards dropped alarmingly. It was not fatal at the time for in 1956 South Africa did not have the cricketing resources to expose our indulgence\".Cowdrey, p. 114 It was enough to turn a 2–0 lead for the tourists into a 2–2 draw against Clive van Ryneveld's energetic team. The all-rounder Trevor Bailey opened the innings with Peterson and Cowdrey returned to batting at number 5, where he made 331 runs (33.10). He made 59 and took three catches in the First Test at the New Wanderers in Johannesburg and made his second Test century – 101 in 369 minutes – in the Second at Cape Town, which England won by an innings, and batted for 200 minutes making 55 in the second innings of the Fourth back at Johannesburg when Hugh Tayfield took 9/113 in South Africa's 17 run win. ", "Cowdrey replaced Trevor Bailey as Peter May's vice-captain for the tour of Australia. He was not confident that he could lead the veteran England team in May's absence, but this was Bailey's last tour and Cowdrey needed to be tested as a future England captain.Cowdrey, p. 100 The disastrous 1958–59 Ashes series began well enough with Cowdrey scoring of 65 not out, 78 and 100 not out against the state teams, but when deputising as captain Cowdrey was run out by Ian Huntington after he stepped forward after an lbw appeal. Later on the tour he struck 101 runs in 84 minutes with 10 boundaries to win a jovial match against the Prime Minister's XI by four wickets. England lost the first two Tests, but Cowdrey's 100 not out saved the Third Test at the Sydney Cricket Ground, adding 182 with May (92) and spending 80 minutes in the 90s. Cowdrey's 84 could not save the Fourth Test at the Adelaide Oval, and he was bowled by the 'Blond Giant' Gordon Rorke, whose seven-foot stride and his long drag took him three yards down the wicket before he released the ball,Frith, p. 437 and Cowdrey joked \"I was frightened that he might tread on my toes\".Frank Tyson, The Cricketer Who Laughed, Stanley Paul, 1982, p. 59 The Fifth Test saw Cowdrey in fine form with seven boundaries in his 44, but he was run out when he trotted in for a single, even though the umpire was unsighted by the wicket-keeper Wally Grout. Cowdrey took strike again unaware of his dismissal until he was asked to depart. England lost the Test as Australia recovered the Ashes 4–0. Cowdrey made only 20 runs (10.00) in the follow up tour of New Zealand, which England won 1–0. "]}, {"page": "Harold Larwood", "response": ["From time to time Larwood supplemented his wages by commenting on cricket for newspapers and broadcasters.Hamilton, pp. 276–77 At first he was treated with some suspicion by English touring teams; in 1950–51 when he visited the English dressing room he received a cold reception from the England captain, F.R. Brown. Four years later, according to Larwood, he was kept out of the dressing room by Trevor Bailey, the 1954–55 team's vice captain—though Bailey denied that this ever happened.Hamilton, p. 293 However, from the early 1960s onwards Larwood was often visited by members of England teams, and he became a regular and welcome guest in English dressing rooms.  He sometimes went to cricket events where he would occasionally meet Don Bradman; relations between the two, though outwardly cordial, remained essentially cold.Hamilton, pp. 302–03"]}, {"page": "Southend-on-Sea", "response": ["* Trevor Bailey, cricketer"]}, {"page": "Jim Laker", "response": ["England batted until mid-afternoon on the Friday and amassed a total of 459, which included centuries by Peter Richardson and David Sheppard. In reply, Australia were dismissed for 84 and, following on, reached 53 for one at the close. In Australia's first innings, England's two pace bowlers, Trevor Bailey and Brian Statham, bowled only ten overs between them before Laker and Lock were introduced. Laker began from the Warwick Road End but did not take a wicket until he switched to the Stretford End. Before tea, when Australia were 62 for two, he dismissed opener Colin McDonald, who was caught by Lock for 32, and Neil Harvey, who was bowled without scoring. Lock took the wicket of Jim Burke, caught by Colin Cowdrey at slip, with the first ball bowled after tea and England dominated from then on. In only 37 minutes from the restart, Australia collapsed to 84 all out. Laker terminated the innings by taking the last seven wickets for only eight runs in just 22 deliveries. His figures were nine for 37 while Lock's were one for 37.", "In 1962, Laker was \"persuaded\" out of retirement by his old England team-mate Trevor Bailey and, as an amateur, he played in thirty matches for Essex. He remained a formidable bowler through 1962 and 1963, and twice won matches with ten-wicket hauls. He was less effective in the 1964 season, after which he retired for good."]}, {"page": "List of sports announcers", "response": ["* Trevor Bailey – BBC Radio 1967–1999"]}, {"page": "Ted Dexter", "response": ["* Trevor Bailey, Richie Benaud, Colin Cowdrey and Jim Laker The Lord's Taverners Fifty Greatest, Heinemann-Quixote, 1983"]}, {"page": "Fred Trueman", "response": ["Trueman's first overseas tour, to the West Indies, took place the following winter (1953–54) after he was demobilised by the RAF. He played in eight first-class matches, including three of the five Tests, and took 27 wickets at 33.66 with a best effort of five for 45. It was a controversial tour and its ramifications had an adverse impact on Trueman's international career during the next few years. MCC at the outset were \"riddled with anxiety\" about sending a team abroad under a professional captain but could hardly deny Hutton his right having just won the Ashes. England had a very strong team in which the main bowlers were Trevor Bailey, Jim Laker, Tony Lock, Johnny Wardle, Brian Statham and Trueman. On the other hand, there were some strong characters in the team coupled with weak management.Birley, p. 286.", "Trueman was nevertheless respected for his unsurpassed knowledge of the mechanics of fast bowling, and many feel he should have been used as a bowling coach for England's under-achieving teams of the 1980s and 1990s, a point once emphasised by his fellow-summariser Trevor Bailey on Test Match Special.As It Was, p. 347. A good example of Trueman's coaching ability had occurred in 1975 when he was approached by the Australian fast bowler Dennis Lillee for help. Lillee was having trouble with both his run-up and bowling action, problems that Trueman had already observed and mentioned on the radio. Trueman gave Lillee the technical advice that provided the solution and Lillee was soon able to recover his form, though this was at the expense of England. Trueman received criticism from many people in the England camp for helping an Australian player, especially after Lillee publicly acknowledged his debt to Trueman. Bailey, on the other hand, completely rejected this criticism and said that the \"prima donnas\" of English cricket should also have the sense to consult experts like Trueman."]}, {"page": "Denis Compton", "response": ["Compton's absent-mindedness was legendary. Colin Cowdrey writes that Compton turned up for the Old Trafford Test of 1955 against South Africa without his kitbag. Undaunted, he sauntered into the museum and, borrowing an antique bat off the display, went on to score 158 and 71. Nevertheless, England lost by three wickets. This absent-mindedness was particularly obvious in his tendency to run out his partners at the crease: Trevor Bailey declared that 'a call for a run from Compton should be treated as no more than a basis for negotiation.' In typical form, at his brother Leslie's benefit match in 1955, he managed to run him out before he had faced a single ball."]}, {"page": "Len Hutton", "response": ["The fourth Test, in front of Hutton's home crowd, was his least successful of the series. He was bowled second ball by a yorker from Lindwall and England struggled to remain competitive throughout the match. In the fourth innings of the game, Australia needed 177 runs to win, with 115 minutes of play remaining. Hutton used Trevor Bailey to bowl negatively and slow Australia down; his tactics, including time-wasting and the use of leg theory, meant Australia could not score the runs in the available time and the match was drawn. It is possible that the idea came from Bailey himself, but the Australian press criticised Hutton for his negativity. In contrast, English critics believed the tactics were justified.Howat, p. 117. Amid great public interest for the deciding fifth Test, Hutton lost his fifth successive toss but replying to Australia's first innings of 275, England established a narrow first-innings lead. Surviving an early scare when a bouncer from Lindwall nearly knocked his cap onto his wickets, Hutton scored 82. In reply, Australia collapsed before the England spinners and England scored the necessary 132 runs to win their first series against Australia since 1932–33 and their first such home series win since 1926. Wisden praised Hutton's strategy and tactical sense, and he was widely acclaimed in the press, particularly for the good spirit which he and Hassett, the Australian captain, maintained.Howat, p. 121. Hutton scored 443 runs at an average of 55.37 in the Tests, but found it mentally tiring to lead England. Meanwhile, some Yorkshire observers felt he should do more to improve discipline at the county.Howat, pp. 120–21. In the whole summer, he scored 2,458 runs at an average of 63.02.", "Some of his selections as captain were widely debated. Following incidents in the Caribbean, Trueman did not play for England again under Hutton's captaincy, although he was still regarded as an England prospect. Jim Laker was also omitted from the team, possibly because Hutton doubted Laker's commitment.Chalke and Hodgson, pp. 111–12. Both Jim McConnon, Laker's replacement, and Vic Wilson were controversial choices for the 1954–55 Australian tour, whose selections Trevor Bailey attributed to Hutton;Chalke and Hodgson, p. 128. neither played a substantial role on the tour. A poor communicator, Hutton distanced himself from his team when a stronger lead was required.Woodcock, p. 54. Trueman and Bailey thought Hutton found it hard to talk to his players: amateur critics considered this an inevitable consequence of a professional leading other professionals.Marshall, pp. 160–61. On the other hand, Hutton played a key role in the development of fast bowlers Trueman, Tyson and Brian Statham. Tyson and Statham later acknowledged his advice and encouragement as factor in their subsequent success.Marshall, p. 160. Cowdrey also acknowledged Hutton's advice and assistance when the former began his career. Furthermore, on the 1954–55 tour of Australia, Hutton took a close interest in him and was a particular comfort when Cowdrey's father died during the tour."]}, {"page": "Amateur sports", "response": ["In England the division was reflected in, and for a long time reinforced by, the series of Gentlemen v Players matches between amateurs and professionals. Few cricketers changed their status, but there were some notable exceptions such as Wally Hammond who became (or was allowed to become) an amateur in 1938 so that he could captain England. Hammond was an example of \"shamateurism\", in that he was offered a \"job\" which paid more than he earned as a professional cricketer  to act as a company's representative and play cricket. Amateurs touring abroad could claim more in expenses than professionals were paid. M.J.K. Smith was a well-salaried secretary - and an amateur  captain -  of Warwickshire County Cricket Club. Trevor Bailey at Essex and Reg Simpson at Nottinghamshire were in a similar situation.Smith, A & Porter, D: Amateurs and Professionals in Post-War British Sport  "]}, {"page": "Wisden Cricketers of the Year", "response": ["|  Trevor Bailey"]}, {"page": "John Arlott", "response": ["Arlott's final Test commentary was on the Centenary Test between England and Australia at Lord's in 1980. At the end of his last session on the final day (2 September), he concluded with his customary phrasing \"nine runs off the over – 28 Boycott, 15 Gower, 69 for 2 – and after Trevor Bailey it will be Christopher Martin-Jenkins.\"  At the end of the following over, a public address announcement that Arlott had completed his final commentary session prompted the crowd to give Arlott an ovation. The entire Australian team in the field and the two England batsmen joined in, with Geoffrey Boycott removing his batting gloves to applaud. Later that day, after the match ended in a draw, he came onto the Lord's balcony to present the Man of the Match award. When he appeared, the crowd below again burst into a spontaneous ovation that lasted for several minutes before he was finally able to speak and make the presentation to Kim Hughes.", "\"In 1980, Trevor Bailey and the writer were largely responsible for a fresh cricket commentary noise, the popping of champagne corks. The senior men and BBC representatives......have all been temperate men, not teetotallers but as a rule disinclined to take wine – or any other alcoholic drink – during the course of the working day....Latterly though, Brian Johnston has been coaxed round by way of Pouilly Fume to the occasional hock and now, fizz. The others have required little persuasion.\" 1981"]}, {"page": "Test Match Special", "response": ["* Trevor Bailey (\"Boil\") (1974–1999)"]}, {"page": "List of cricket commentators", "response": ["|  Trevor Bailey (1923 - 2011)"]}, {"page": "Keith Miller", "response": ["Miller was invited to join a RAAF team in London. The team was officially formed in preparation for the 1943 season and Miller's selection led to the first of many brushes with death: in April, while away with the team, some of his comrades were killed in a German air strike.Perry, p. 62.Perry, p. 64.Mallett, p. 63.Haigh (1997), p. 2.Whitington, pp. 54–55. Miller played his first match at Lord's against Warner's XI, a team that featured past, current and future England players, including Bob Wyatt, Gubby Allen, Trevor Bailey and Alec Bedser.Perry, p. 65.Perry, p. 66. Miller top-scored in the first innings with 45 and added 21 not out, with two sixes, in the second innings. The RAAF played eight matches that season and Miller's top score was 141 against Public School Wanderers.Perry, p. 67. He went on to play for Dominions against Warner's XI in August, scoring 32 and two.Perry, p. 68. The match marked the first meeting between Miller and his good friend, England batsman Denis Compton and his bowling began to attract media attention.Perry, p. 69. In the final match of the season at Lord's between the RAAF and the Royal Air Force, Miller took 3/23 and scored 91.Perry, p. 70. The success of RAAF and Dominions that season, especially the attractive batting by Miller and Keith Carmody,Harte, p. 385. prompted Warner to begin planning for a \"Test\" series between the respective armed services of England and Australia.Pollard (1988), p. 359.Whitington, p. 66.", "Australia elected to field on a wet wicket in the Fourth Test at Headingley. Miller dismissed Edrich and Graveney and ended with 2/39 from 38 overs as England were bowled out for 167.Perry, pp. 336–337 Miller made only five in the first innings. In the second innings, Miller and Lindwall launched a short-pitched barrage and dismissed Watson and Simpson in consecutive balls. England were 5/177 a stumps on day four, leading by 78.Perry, p. 337.Whitington, p. 224. The pacemen were booed from the field.Whitington, p. 225. The next day, Miller dismissed Evans early, before Trevor Bailey began his resistance. Frustrated by Bailey's defensive style and time-wasting, Miller lost his cool and aimed a beamer straight at Bailey's head, further angering the crowd.Perry, p. 338. Miller ended with 4/63 from a long spell of 47 overs.Perry, p. 339. England held on for another draw after more time-wasting by Bailey. The teams headed for the Fifth Test at The Oval tied 0–0.Perry, p. 340. Miller's last Test performance was his least productive; he scored one and a duck and took a total of 2/89. England won the match and regained the Ashes.Perry, p. 341. Miller's returns were below his career standards, with 223 runs at 24.77 and 10 wickets at 30.30. He took two catches.Perry, p. 342."]}, {"page": "Westcliff-on-Sea", "response": ["*Trevor Bailey (1923–2011), test cricketer and cricket writer and broadcaster, was born there."]}, {"page": "Norman Yardley", "response": ["Judgements were mixed on Yardley's performance as Yorkshire's captain. His record would have been considered good at any other county, but not by the standards set by previous Yorkshire sides. Critics felt that Yorkshire should have won the Championship with the players available. Contemporaries believed him to be the best captain in the country tactically, taking reasonable chances without too many risks and judging players strengths and weakness. Trevor Bailey, who played against him for Essex and under him for England, wrote that he thought him \"an outstanding tactician and an expert on wicket behaviour. He was unquestionably one of the best captains I have ever played with or against. It has been said that he was too nice to lead Yorkshire, but I cannot think of anybody I have preferred playing under.\"Bailey, p. 141. Alan Gibson believed that unlike some county captains, Yardley was worth his place in the side on cricketing ability. However, he seemed unable to extract the best from his players. Jim Kilburn noted that he used orthodox tactics, even when a different approach was called for, while other critics believed that he was shocked by the attitude of some difficult players in the side. Neither Yardley nor Hutton, his senior professional, were disciplinarians in the dressing room and kept apart from others. Both were frequently absent, playing in representative matches. This may have inflamed the situation, leading to accusations that some players were out of control. Yardley disliked confrontation, and Ray Illingworth, who played under him, described him as too nice to stand up to his players. But Bob Appleyard, another of his former players, gives Yardley credit for recognising his potential and encouraging him to become a spinner, and believes that he and Hutton made a formidable pair of tacticians.Chalke and Hodgson, pp. 33, 127. Generally, he was popular with his players.", "Yardley worked as a wine merchant outside cricket. After his retirement from playing he worked as a cricket journalist and served as an expert summariser on Test Match Special from 1956 until 1969, as well as in 1973. According to David Frith, the only time he was moved to express severe disapproval was when Brian Close was dismissed after a poor shot in the Fourth Test in 1961 at Old Trafford; this was part of a final-day England collapse that handed Australia the match and a 2–1 series win after the hosts had been on course for victory and the series lead. Trevor Bailey, who was a colleague in the commentary box for the later part of Yardley's time with Test Match Special, wrote: \"I always considered Norman Yardley to be an ideal summariser: accurate, informative and very sensible, and able to explain not only what happened but also the reasons why. His knowledge about pitches, tactics and the technicalities of the game was exceptional... Articulate, expert, and possessing considerable charge [sic], I thought his interpretation of events on the field and his post-session summaries were sound, balanced and never less than fair.\"Bailey, pp. 223–224."]}, {"page": "Freddie Brown (cricketer)", "response": ["The 1950–51 England team under Brown's captaincy was regarded as one of the weakest sent to Australia and John Kay commented that without the key players Alec Bedser and Len Hutton, England's standard would have been little better than that of a club team.Kay, p. 220. England lost the Test series 4–1, their only victory being a consolation win in the final Test. Despite his team's poor performance, the forty-year-old Brown enjoyed personal success and won considerable popularity among Australian supporters with his determination to fight on regardless of the odds. Unexpectedly, he scored 210 runs at 26.25 and took 18 wickets at 21.61 in the series, coming third in the England batting averages after Hutton and Reg Simpson and third in the bowling averages after Bedser and Trevor Bailey.Wisden 1952, pp. 795–96.", "Brown caused problems for Fred Trueman when he managed the English cricket team in Australia in 1958–59. Trueman and others believed that people like Brown and his colleague Gubby Allen \"epitomised the pompous nature of English cricket in the days of amateurs and professionals, gentlemen and players\".Waters,148–149. It was not just professionals as Brown quarreled with the amateur Trevor Bailey, which led to long-standing mutual antipathy.Miller, p.80. In Trueman's autobiography, he refers to Brown as \"a snob, bad-mannered, ignorant and a bigot\".Trueman, p. 219. Trueman made a formal complaint about Brown to the team captain, Peter May. Although May was another public school-educated amateur, he supported Trueman and told Brown to \"act in a manner befitting someone with managerial responsibility\".Waters, p. 149. Tom Graveney commented on the lack of team spirit on the tour, saying that \"Freddie Brown, in particular, did a very bad job\" and was rude to several team members.Waters, p. 150. Graveney called Brown \"a very stuck-up individual – at least when he was sober\". Kay said Brown had a tendency to be bombastic in speech and could be forthright and ruthless, sometimes being churlish and rude to sensation-seeking reporters, but was always ready to talk amicably to genuine cricket journalists.Kay, pp.30–32."]}, {"page": "Neil Harvey", "response": ["Harvey then returned to Headingley, the venue of his famous innings five years earlier. In a low-scoring match, he top-scored for the entire match with 71 in the first innings as Australia took a 99-run lead. The tourists looked set for victory and retention of The Ashes at the start of the final day, but time-wasting and defiant defence from the English batsmen left Australia a target of 177 in the last two hours. This would have required a scoring rate much higher than in the first four days of the match.Haigh, p. 79. Harvey quickly scored 34 at a run a minute, and Australia had made 111 in 75 minutes and were on schedule for a win. At that point, English medium-pacer Trevor Bailey began bowling with the wicket-keeper more than two metres down the leg side to deny the Australians an opportunity to hit the ball, but the umpires did not penalise them as wides. The match ended in a draw, and Harvey described Bailey's tactics as \"absolutely disgusting\". English wicket-keeper Godfrey Evans said that the tourists \"were absolutely livid\" and he sympathised with them, saying that \"they were right\" in claiming that Bailey's bowling was \"the worst kind of negative cricket\" and that he had \"cheated [them] of victory\".Haigh, p. 80.", "Harvey's attacking style often led to criticism that his batting was risky, with England captain Len Hutton feeling that he played and missed too much, while dour all-rounder Trevor Bailey quipped \"I wonder how many runs Harvey would make if he decided to stop playing strokes with an element of risk about them\".Robinson, p. 260. Harvey was nevertheless happy to continue his flamboyant strokeplay. However, as Harvey progressed in seniority, he eschewed his hook shot and played more conservatively for his team's sake. He typically evaded bouncers by tilting his head, rather than ducking the ball."]}, {"page": "Essex County Cricket Club", "response": ["After World War II Essex fell off, taking their first wooden spoon in 1950. During this period it was left to Trevor Bailey to do all the pace bowling, and he was often unavailable due to Test calls, whilst spinner Peter Smith was frequently overbowled until he retired in 1951 – thus a strong batting line-up led by Bailey and Doug Insole could seldom win games. Not until 1957 did Essex come back into the top half of the table, but Bailey and Barry Knight never had support of sufficient class to permit them to reach the top of the table, even when Robin Hobbs became England's last successful leg-spinner late in the 1960s.", "* Trevor Bailey", "|Trevor Bailey || 21,460", "|Trevor Bailey|| 1,593"]}, {"page": "Brian Statham", "response": ["They left behind a severely cold winter in Manchester and flew to a severely hot summer in Adelaide where Statham played his first overseas match against South Australia, starting on Saturday, 27 January 1951. Statham had never even met the majority of his new team-mates but he had encountered and impressed Len Hutton, and it is generally supposed that he was invited on Hutton's firm recommendation.Derlien, pages 26 and 27. He played against Victoria at the Melbourne Cricket Ground (MCG) in February and then went with the MCC team to New Zealand. After playing against Auckland and Otago, Statham made his Test match debut for England against New Zealand at Lancaster Park in Christchurch, the four-day match starting on Saturday, 17 March. Statham bowled first change after Alec Bedser and Trevor Bailey had shared the new ball.Derlien, page 29. His first Test wicket was that of New Zealand opener Bert Sutcliffe, who had scored 116. It was a high-scoring match that ended in a draw.New Zealand v England scorecard, First Test 1951. CricketArchive.New Zealand v England match report, First Test 1951. ESPN cricinfo.", "In the Test series, he was chosen for the second match at Lord's but had little to do as it was a spinner's wicket and his Lancashire colleague Roy Tattersall took twelve for 101, England winning to level the series one-all. He kept his place in the third Test at Old Trafford but, while his opening partner Bedser took twelve, he was only needed for a total of 24 overs. In the last two Tests, the selectors decided to pair first Trevor Bailey and then Derek Shackleton with Bedser, but Statham was content as he was certainly in the Test picture and his potential was recognised.Derlien, pages 31 and 32."]}, {"page": "Herbert Sutcliffe", "response": ["Trevor Bailey, writing in the 1981 Wisden about cricketers' hairstyles, said that Sutcliffe's was \"black patent-leather glinting in the sun, complete with the straightest of partings\".Wright, p.205."]}, {"page": "Ray Lindwall", "response": ["The following season in 1949–50, the Australians headed to South Africa for a five Test tour. Lindwall's partnership with Miller was broken up when the latter was omitted from the touring squad.Pollard (1990). p. 26. Miller stated that he wished to be considered only as a batsman and his omission caused great controversy. In any case, Miller was drafted in as cover after Johnston was involved in a car accident at the start of the tour, although both went on to play in all five Tests. Lindwall started the tour on a poor note in the First Test at Wanderers in Johannesburg, scoring 21 and then going wicketless as Australia completed an innings victory. It was the first time that Lindwall had failed to take a wicket in both innings of a Test. His wicketless run persisted until the second innings of the Second Test in Cape Town, where he took 5/32 after the hosts had been forced to follow on, as Australia completed another easy victory. Lindwall then took match figures of 4/54 as Australia completed a hat-trick of victories at Durban. Lindwall took 3/82 in South Africa's only innings in the Fourth Test at Johannesburg, but was dropped for the Fifth Test, something that surprised cricket commentators. His tour had been intermittently interrupted by groin problems, fibrositis and a stomach disorder, and his 12 wickets at an average of 20.66 at three wickets per match was below his customary rate. Overall, when fit, he was effective, with 50 wickets at 14.58. Lindwall forced his way back into the XI for the First Test of the 1950–51 Ashes series against Freddie Brown's England team. Australia struggled to 228 in its first innings with Lindwall making the second top-score of 41 in supporting Neil Harvey (74) in a rearguard action. Lindwall was not required as Miller and Johnston's medium pace reduced England to 7/68 on a sticky wicket before Brown declared, forcing the Australian to bat on the unfavourable pitch. Australia then declared at 7/32. Lindwall yorked Reg Simpson first ball and Australia seized the initiative,Pollard (1990), p. 39. reducing England to 6/30 before bowling them out for 122 to take the match by 70 runs.Perry (2000), p. 183. Lindwall took five wickets in the Second Test in Melbourne, two of which came in the closing stages of the English run-chase. Chasing 178, England lost Brown and Evans in consecutive overs to the second new ball and ended 28 runs short of victory.Perry (2001), p. 227. Australia went on seal the series with an innings victory in the Third Test in Sydney – Lindwall bowled Brown and Bedser before breaking Trevor Bailey's thumb in the first innings to help Australia seize control. In the Fourth Test in Adelaide, Lindwall took 3/51 in England's first innings before scoring a patient 31 in Australia's second innings, helping to set up at target that was 274 runs too much for Brown's men. The Fifth and final Test of the summer was to be the first Test defeat for Lindwall in the first 24 Tests of his career. Despite taking 3/77 in the first innings to complement the four wickets of Miller – the most in an innings by the pair during the series – England took their first win over Australia since 1938.Pollard (1990), p. 45. Lindwall had taken 15 wickets at 22.93 for the series.", "After Australia had been bowled out for 249 in the first innings of the First Test at Trent Bridge, Lindwall's high paced swing yielded 5/57 and cut England down for 144. However, Australia were then bowled out for only 123, leaving England 228 for victory. They were 1/120 with Lindwall wicketless as rain curtailed the match. In the Second Test at Lord's, England had reached 1/177 at stumps on the second day in reply to Australia's 346. The following day, Lindwall yorked rising star Tom Graveney and took 5/66 to restrict England to a lead of 26 runs. In Australia's second innings, Lindwall scored the fastest half-century in Ashes history. He took just 48 minutes to reach the mark, with two sixes and five fours.Pollard (1990), p. 67. The match was drawn with Lindwall taking 2/26 in the second innings. Lindwall had helped to reduce England to 3/12 at stumps on the fourth day after removing Don Kenyon and Hutton with the new ball, but defiant batting on the final day saved the English. The Third Test was again drawn due to heavy rain, with Lindwall failing to pass double figures in either innings and taking 2/30 in the first innings. Hassett won the toss for the fourth consecutive Test at Headingley and sent England into bat. In front of his home crowd in Yorkshire, Hutton was yorked second ball from a pacy inswinging yorker. Lindwall produced a display of fast and accurate pace bowling, taking 5/54 from 35 overs as England managed only 169.Pollard (1990), p. 70. After Australia took a 97 run lead, Lindwall took 3/104 to help leave the tourists with a victory target of 177. This was not before dour English all rounder Trevor Bailey attempted to stone-wall an Australian victory by batting for over four hours for 38 runs. Along with Miller, the pair took 14 wickets between them, displaying their pivotal role in Australia's bowling attack,Perry (2001), p. 233. especially in the absence of the injured Johnston, who was unavailable for most of the tour.Pollard (1990), p. 75. Hutton ordered Bedser and Bailey to bowl leg theory from a long run, sending balls down the leg side to prevent the Australians from scoring. England held on for a draw with Australia 30 runs short when time ran out.Perry (2001), p. 234. The teams met at The Oval for the deciding Test and Australia could manage 275 after winning the toss with Lindwall striking a quickfire 62 noted for an array of off drives to top score and push the total to respectability.Pollard (1990), p. 73. Lindwall then took 4/70 but it was not enough to prevent England taking a 31 run lead. Australia collapsed for 162 in the second innings, with the Surrey spin twins of Jim Laker and Tony Lock taking nine wickets between them. This left England 132 to win, something they achieved with eight wickets intact. Lindwall was unable to remove any of the Englishmen.", "The fruit of Lindwall's fitness regime ripened in the early Shield matches of the 1958–59 season and he sent a message to the selectors when England arrived in Brisbane for a tour match before the First Test. Lindwall took 5/57 in the first innings,Pollard (1990), p. 128. dismissing Watson, Milton, Colin Cowdrey, Trevor Bailey and Jim Laker. He removed both openers for seven in the second innings before rain curtailed the match, leaving Lindwall with match figures of 7/73. Unfortunately from his point of view, none of the selection committee attended the match. Lindwall was overlooked as the selectors persisted with the winning combination that toured South Africa. His prospects of a recall appeared even more remote after Australia won both of the first two Tests, with Davidson and Meckiff skittling England for 87 in the second innings of the Second Test, taking nine wickets each for the match. Meckiff was injured during the Third Test, leaving him in doubt for the Fourth Test. In the meantime, Lindwall had a Shield match away against South Australia to make a final claim for a recall. The hosts batted first in stifling heat around 42 degrees on a batting pitch, and Lindwall delivered 41 eight-ball overs to take 7/92.Perry (2001), p. 242. Lindwall received a standing ovation for his performances in unfavourable conditions and was greeted by Bradman, the chairman of selectors. Lindwall avoided Bradman's inquiries as to whether he had any injury worries, fearing it would hinder his chances of selection.Perry (2001), p. 243."]}, {"page": "Ian Johnson (cricketer)", "response": ["Unusually for an Australian, Johnson bowled off-spin rather than the wrist spin normally associated with countrymen of his day.  Johnson had an atypical bowling action, with a \"rather staccato swing\" of his bowling arm.Martin-Jenkins (1980), p. 193. He bowled with a high degree of flight, causing opposing batsmen difficulties in judging where the ball would land. Making intelligent use of the wind, Johnson was able to make his deliveries float away from the batsman, changing from his standard off-break. According to E. W. Swanton, Johnson was \"probably the slowest bowler to achieve any measure of success in Test cricket\".  His action was compared to a corkscrew; writer Ray Robinson saying that \"to coax turn from firm Australian pitches he twisted the ball almost hard enough to screw a doorknob off\".  There were doubts about the legality of his bowling action; his English rival, Trevor Bailey claimed Johnson threw every delivery.  Johnson was never no-balled for throwing, having played cricket in front of umpires from Australia, England, New Zealand, South Africa, the West Indies, India and Pakistan. "]}, {"page": "Lindsay Hassett", "response": ["In the Fourth Test, the Australians worked themselves into a position to win the match and thus retain the Ashes. Hassett made 37 as his team compiled 266 and took a 99-run first innings lead. The tourists looked set for victory and retention of The Ashes at the start of the final day, but time-wasting and defiant defence from the English batsmen left Australia a target of 177 in the last two hours. This would have required a scoring rate much higher than in the first four days of the match.Haigh, p. 79. Hassett made only four, but Australia had made 111 in 75 minutes and were on schedule for a win. At that point, English medium-pacer Trevor Bailey began bowling with the wicket-keeper more than two metres down the leg side in order to deny the Australians an opportunity to hit the ball, but the umpires did not penalise them as wides. The match ended in a draw with Australia at 4/147 when time ran out. English wicket-keeper Godfrey Evans said that \"they were right\" in claiming that Bailey's bowling was \"the worst kind of negative cricket\" and that he had \"cheated [them] of victory\".Haigh, p. 80. The match was also marred by a series of umpiring decisions made by Frank Chester against the Australians, leading Hassett to request that he not be appointed for the Fifth Test, something the English cricket authorities granted.Haigh, p. 123."]}]}}