{"wiki_id": "http://www.wikidata.org/entity/Q5529228", "itemLabel": "Gazzo", "itemDescription": "English Magician", "wikipedia_url": "https://en.wikipedia.org/wiki/Gazzo_(magician)", "wikipedia_page": {"main": "Gary 'Gazzo' Osbourne (born 1960) is a British street magician. An expert in cons and scams, he moved in the 1980s to the US, where he befriended Walter Irving Scott (The Phantom). He is Scott's only pupil and the only person with whom Scott entrusted his biography and life's work at card cheating and sleights.", "link_mentions": [{"page": "List of magicians", "response": ["* Gazzo (Gary Osbourne)"]}, {"page": "Street magic", "response": ["More recently, other performers have garnered accolades from the magic community for their contributions to the art.  Jim Cellini (a.k.a. Richard Sullivan) has been a full-time street performer since the 1970s and has published a book (Cellini: The Royal Touch) and DVDs (The Art of Street Performing, volumes 1 - 3) on the subject.  Gazzo Macee (a.k.a. Gary Osborne) has been a full-time street performer since the 1980s and has published a booklet (\"The Art of Krowd Keeping\" written for Gazzo by Danny Hustle and Jim Wells) and DVD (Street Cups) on the subject.  Eric Evans has been a full-time professional since the 1990s and co-wrote -- along with Nowlin Craver -- a book on the subject (The Secret Art of Magic).", "*Gazzo"]}, {"page": "Gazzo", "response": ["Gazzo may refer to:", "* Gazzo, Veneto, a town in the Province of Padua, Veneto", "* Gazzo Veronese, a town in the Province of Verona, Veneto", "* Gazzo di Bigarello, a village in the Province of Mantua, Lombardy", "* Monte Gazzo, a hill near the town of Sestri Ponente, Liguria", "* Gazzo (magician) (b. 1960), British street magician", "*Gazzo (producer) (b. 1990), American DJ and producer", "* Jane Gazzo (b. 1977), Australian broadcaster", "* Michael V. Gazzo (1923-1995), American actor and Broadway playwright"]}, {"page": "Magic (illusion)", "response": ["Street magic is a form of street performing or busking that employs a hybrid of stage magic, platform, and close-up magic, usually performed 'in the round' or surrounded by the audience. Notable modern street magic performers include Jeff Sheridan and Gazzo. Since the first David Blaine TV special Street Magic aired in 1997, the term \"street magic\" has also come to describe a style of 'guerilla' performance in which magicians approach and perform for unsuspecting members of the public on the street. Unlike traditional street magic, this style is almost purely designed for TV and gains its impact from the wild reactions of the public. Magicians of this type include David Blaine and Cyril Takayama."]}, {"page": "Gazzo (magic)", "response": ["#REDIRECT Gazzo (magician)"]}]}}