{"wiki_id": "http://www.wikidata.org/entity/Q5525700", "itemLabel": "Gary Owen", "itemDescription": "British playwright", "wikipedia_url": "https://en.wikipedia.org/wiki/Gary_Owen_(playwright)", "wikipedia_page": {"main": "Gary Owen (born 1972) is a Welsh playwright, and winner of the 2003 Meyer-Whitworth Award for new writing for the theatre.", "link_mentions": [{"page": "Iphigenia", "response": ["* Iphigenia in Splott, play by Gary Owen"]}, {"page": "Russell T Davies", "response": ["Davies moved with Gardner and Jane Tranter to the United States in June 2009 and resided in Los Angeles, California. He continued to oversee production of Torchwood and The Sarah Jane Adventures; he wrote one story for the 2010 series of The Sarah Jane Adventures, Death of the Doctor, which included Matt Smith as the Doctor and Katy Manning as the Doctor's former companion Jo Grant, and was the executive producer and author of the premiere (\"The New World\") and finale (\"The Blood Line\") of Torchwood: Miracle Day, the fourth series of Torchwood. He additionally gave informal assistance to and later served as creative consultant of ex-Doctor Who script editor Helen Raynor's and playwright Gary Owen's BBC Cymru Wales drama, Baker Boys. Davies had planned to return to art by writing a graphic novel, and was approached by Lucasfilm to write for the proposed Star Wars live-action television series but refused the commission."]}, {"page": "List of British playwrights since 1950", "response": ["*Gary Owen"]}, {"page": "Splott", "response": ["Splott is the setting of “Iphigenia in Splott”, a modern day reworking of the classic Greek drama, by Welsh playwright Gary Owen.  It premiered at Cardiff’s Sherman Theatre in 2015, before transferring to the National Theatre in London and the 59E59 Theaters in New York in 2016."]}, {"page": "James Tait Black Memorial Prize", "response": ["| 2015 || Benjamin Markovits, You Don't Have to Live Like This||James Shapiro, 1606, Shakespeare and the Year of Lear||Gary Owen, Iphigenia in SplottDrama prize, University of Edinburgh"]}, {"page": "Helen Raynor", "response": ["Raynor, with her partner Gary Owen, co-created and wrote Baker Boys, a BBC Wales drama about a recession-hit small town in the south Wales Valleys. Baker Boys ran for two series in 2011/2012. Russell T. Davies acted as creative consultant, and the show starred Eve Myles, Matthew Gravelle, Mark Lewis Jones, Amy Morgan, Steven Meo, Boyd Clack and Cara Readle. In 2015 she was lead writer on ITV's period drama Mr Selfridge, starring Jeremy Piven, after joining the writers' room for series 3 in 2014. In 2020 she wrote an episode of Call the Midwife."]}, {"page": "Gary Owen", "response": ["Gary Owen is the name of:", "* Gary Owen (snooker player) (1929–1995), Welsh snooker player", "* Gary Owen (politician) (born 1944), Michigan politician", "* Gary Owen (footballer) (born 1958), English footballer", "* Gary Owen (playwright) (born 1972), Welsh playwright", "* Gary Owen (comedian) (born 1974), American comedian", "* \"Garryowen\" (air), Irish quickstep tune, also called \"Gary Owen\"", "* Gary Owens (1934–2015), American disc jockey and voice actor"]}, {"page": "Big Finish Short Trips", "response": ["The collections have mixed established Doctor Who writers from the television series, such as Ben Aaronovitch, Ian Briggs, Andrew Cartmel, Terrance Dicks, Glen McCoy, James Moran, Marc Platt, Helen Raynor and Eric Saward with writers who made their name in other Doctor Who spin-off ranges, such as Paul Cornell, Joseph Lidster, Kate Orman, Lance Parkin, Philip Purser-Hallard, Gareth Roberts, Gary Russell and Robert Shearman, and writers from other literary spheres, including Dan Abnett, Lou Anders, Scott Andrews, Jonathan Clements, Peter David, Richard Dinnick, Keith R.A. DeCandido, Brian Dooley, Diane Duane, Nev Fountain, Lizzie Hopley, Todd McCaffrey, Juliet E. McKenna, Paul Magrs, James Moran, Gary Owen, Stel Pavlou, Steven Savile, James Swallow and Matthew Sweet."]}, {"page": "The Green", "response": ["* The Green (play), a play by Gary Owen"]}, {"page": "Eve Myles", "response": ["2009 saw her star in the award-winning independent Welsh film A Bit of Tom Jones as well as the one-off Drama, Framed, for BBC Wales, alongside Trevor Eve. In July 2010, Myles announced she would appear in an original BBC Cymru Wales TV series, Baker Boys, co-written by Helen Raynor and Gary Owen and airing in early 2011. 2011 also saw Myles provide the voice of the Dalish elf Merrill in the Bioware video game Dragon Age II. In July 2011, to coincide with Torchwoods fourth series Myles presented part of a BBC Wales Documentary entitled Wales and Hollywood, which featured the actress travelling to the Hollywood Walk of Fame to find the Welsh talent honoured there.Wales in Hollywood programme listing"]}, {"page": "Pearson Playwrights' Scheme", "response": ["* 2002 Drowned World by Gary Owen (Paines Plough) & Honeymoon Suite by Richard Bean (Royal National Theatre)"]}, {"page": "Jason Hughes (actor)", "response": ["The 2015 play, Violence and Son, by Gary Owen is about a Welsh, 17 year-old mama's boy whose mother recently passed away from cancer. He is forced to move away to his biological father, Rick (Jason Hughes) who is a bit of a delinquent and goes by Viol. The plot thickens when he meets Jen, a girl he meets in college who shares a passion for doctor who with  him. The main problem is she already has a boyfriend, a rugby player called Jorden.Violence and Son, Royal Court Theatre, Aleks Sierz, 9th June 2015 Jen decides to stay over, and encouraged by Rick, Liam questions whether he should make a move. It is not aided by being intoxicated, and the characters soon get into a deep discussion about unusual topics to do with male and female anatomy. The play makes up for the name, depicted violence and especially the darkness of sexual violence. Heavily in contrast to his role in Our Country's Good where his character is frightened and pushed around, Hughes states you \"couldn’t get two more different characters.\" Hughes says this role allowed him to push himself and discover things he did not know he had in him. Viol was a dark character and it gave Hughes a sense that he was alive in the role. It affected Hughes as an actor since he could show that there was no trace of himself in the character; he got ride of everything of himself and embodied Vile.."]}, {"page": "Sgript Cymru", "response": ["*Crazy Gary's Mobile Disco - Gary Owen ", "*Ghost City - Gary Owen"]}, {"page": "Crazy Gary's Mobile Disco", "response": ["Crazy Gary's Mobile Disco is a play by Gary Owen that was first presented by Paines Plough and Sgript Cymru in 2001.  The play is set on a Saturday night in a small town in Wales and focuses on three lads in their mid-twenties stuck with their school reputations of the gimp, the geek and the bully. The play takes the format of three monologues and the tagline for the play is 'Their dream is to get the hell out..'"]}, {"page": "Sherman Theatre", "response": ["The Sherman won the UK Theatre Award for \"Best New Play 2015\", for Gary Owen's Iphigenia in Splott. Sophie Melville's performance in this production received The Stage Award for Acting Excellence at the Edinburgh Fringe Festival in 2015.  The production transferred to the UK National Theatre's Temporary Theatre in January 2015, making this the first Welsh play to transfer straight to the National Theatre. Iphigenia in Splott then went on to win the James Tait Black Memorial Prize for Drama in 2016.", "Gary Owen and Rachel O'Riordan’s next collaboration, Killology, won the award for Outstanding Achievement at an Affiliate Theatre at the Olivier Awards in 2018."]}, {"page": "Short Trips: Snapshots", "response": ["| Osskah || Gary Owen|| 8th ||"]}, {"page": "Mind the Gap Theatre", "response": ["* New York premiere of Gary Owen (playwright)'s In the Pipeline at Manhattan Theatre Source"]}, {"page": "Brynteg School", "response": ["* Gary Owen, playwright"]}, {"page": "UK Theatre Awards", "response": ["|Iphigenia in Splott by Gary Owen, a Sherman Cymru production"]}, {"page": "Oberon Books", "response": ["*Gary Owen", "*Mrs Reynolds and the Ruffian by Gary Owen for Best New Play."]}, {"page": "National Theatre Connections", "response": ["*Theatre of Debate: Big Hopes a verbatim play by Gary Owen inspired by an xl. group from The Princes Trust, Cardiff followed by Safe by Deborah Gearing inspired by Fairbridge Southampton"]}, {"page": "2011 in Wales", "response": ["* Baker Boys, starring Boyd Clack, Mark Lewis Jones and Eve Myles, co-written by Helen Raynor and Gary Owen"]}, {"page": "Digital Theatre (website)", "response": ["| 2016 || Iphigenia In Splott || Gary Owen || Rachel O'Riordan || || Sherman Theatre || style=\"text-align: center;\" | "]}, {"page": "Baker Boys (2011 TV series)", "response": ["Baker Boys is an English-language Welsh television drama series, produced by BBC Wales and broadcast on BBC One Wales. The series was written by Helen Raynor and Gary Owen. Torchwood creator Russell T Davies also had a role as creative consultant, which he fulfilled from Los Angeles. The first episode of the series was broadcast on 23 January 2011.", "The first series achieved strong viewing figures, being the second most-watched original broadcast on BBC Wales with an average of 294,000 viewers during the 2010/2011season. In 2012 the series received five nominations at the 21st annual Bafta Cymru award ceremony. Eve Myles and Mark Lewis Jones were nominated respectively for the Best Actress and Actor awards, whilst Helen Raynor and Gary Owen received a joint nomination for Best Writing and Mark Waters received a nomination for Photography and Lighting. The series received one award; with Adam Lewis winning an award for Best Original Music."]}, {"page": "Vicky Featherstone", "response": ["|The Drowned World||Gary Owen||Birmingham Rep, then Traverse in August 2002, followed by UK tour in 2003.|||| Winner of a Fringe First at the 2002 Edinburgh Fringe Festival.", "|Crazy Gary's Mobile Disco||Gary Owen||Chapter Arts Centre, then UK tour||||"]}, {"page": "Meyer-Whitworth Award", "response": ["*2003: Gary Owen for Shadow of a Boy"]}, {"page": "Thanos Samaras", "response": ["Some of his stage work includes Anton in Marius von Mayenburg's Eldorado, Treplyov in Chekhov's The Seagull, Carl in Sarah Kane's Cleansed (Horn award nomination for Best New Actor), Oswald in Ibsen's Ghosts, Darren in Gary Owen's The Drowned World a.o."]}, {"page": "Jamie Beddard", "response": ["Beddard has written plays for Graeae Theatre Company, Soho Theatre, Paines Plough and Writenet.  These are referenced in Gary Owen's 'The Drowned World' and include:"]}, {"page": "María Hervás", "response": ["She adapted Gary Owen's monologue Iphigenia in Splott into Iphigenia en Vallecas. The play earned her critical acclaim, a Max Award and a Actors and Actresses Union Award. Other stage credits include Jauría, and Confesiones a Alá."]}]}}