{"wiki_id": "http://www.wikidata.org/entity/Q5521789", "itemLabel": "Gappy Ranks", "itemDescription": "British dancehall musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Gappy_Ranks", "wikipedia_page": {"main": "Jacob Lee Williams (born c.1983), better known as Gappy Ranks, is an English dancehall musician of Jamaican and Dominican descent, from Harlesden, London.", "link_mentions": [{"page": "Harlesden", "response": ["*Gappy Ranks"]}, {"page": "List of reggae musicians", "response": ["*Gappy Ranks"]}, {"page": "Lethal Bizzle", "response": ["Following the success of \"Pow (Forward)\", Bizzle released the follow-up singles \"Uh Oh (I'm Back)\", \"Fire\" and \"What We Do\" with Kray Twinz, Twista and Gappy Ranks, the latter two which peaked at number 34 and number 23 respectively. Bizzle's debut album, Against All Oddz (2005), was released on 15 August 2005. The album peaked at number 89 on the UK Albums Chart", "! scope=\"row\"| \"What We Do\"(with Kray Twinz, Twista & Gappy Ranks)"]}, {"page": "Juno Award for Reggae Recording of the Year", "response": ["*\"Roll 'Dem\" – Dubmatix feat. Gappy Ranks"]}, {"page": "Twista discography", "response": ["! scope=\"row\" | \"What We Do\" (with Kray Twinz, Lethal Bizzle and Gappy Ranks)"]}, {"page": "List of performers on Later... with Jools Holland", "response": ["* Gappy Ranks"]}, {"page": "Max Perry", "response": ["In 2011, Perry became Head Engineer at Wash House Studios in Haleiwa, HI producing, mixing & recording for Reggae artists such as Morgan Heritage, SOJA, Junior Reid, Gappy Ranks, Fiji & Jboog, who's Perry produced single “Smokin Bomb Bud” reached #1 on the iTunes Reggae Charts. Perry is currently working with J Boog, Snoop Dogg, Berner, Wiz Khalifa, Twista, Big K.R.I.T & Vital Deshawn.", "*2014 Gappy Ranks – Carpenter Maxwell Smart Remix [Carpenter (The Remixes)]", "*2015 Gappy Ranks – Barefoot feat Torch [Smart Riddim]"]}, {"page": "Sadiki", "response": ["As well as being his singing and songwriting debut (under the name Sadiki), the album Morning's Come was also Sadiki's producing and engineering debut, as he produced or co-produced each and every track. Morning's Come also featured production from top reggae veteran producer Lloyd Campbell of Joe Fraser Records (Glen Washington, Freddie McGregor, Marcia Griffiths, Tarrus Riley), England's top reggae producer Chris Peckings (Bitty McLean, Gappy Ranks), Delly Ranx (Sean Paul, Mavado) and Arif Cooper (Guardian Angel riddim). In March 2007, Sadiki did a four-city tour of Japan.Rove Magazine. Rove.jp (22 February 1999). Retrieved 30 May 2011. After this successful tour, he was offered a licensing deal in Japan. \"Morning's Come\" was released in Japan in November 2007 (Skinny Bwoy/P-Vine Records).Tower Records Listing Within weeks of its Japan release the album hit the No. 1 spot for reggae releases at HMV record stores throughout Japan, and charted within the top 5 for sales in Tower Records stores. The US version of Morning's Come, featuring new and unreleased tracks, was released worldwide in the Fall of 2008."]}, {"page": "List of Later... with Jools Holland episodes", "response": ["| Arctic Monkeys / Alison Krauss & Union Station / Gappy Ranks / Warpaint / Brian Wilson / Randy Newman"]}, {"page": "Kemar McGregor", "response": ["In 2010, McGregor began releasing his music through his proprietary FM Records label. He released a series of successful riddim compilation albums during this time, including: \"Dance Drop Riddim\" (2010), \"Throwback Riddim\" (2011), \"Cool and Deadly Riddim\" (2011), \"Club Dance Riddim\" (2012), \"Rock & Come In Riddim\" (2012) and \"80s Rock Riddim\" (2013). McGregor began to embrace British Lovers Rock music in 2011, releasing romantic reggae albums, EPs and maxi-singles with Maxi Priest, JC Lodge, Carroll Thompson, Janet Kay, Adele Harley, Gappy Ranks and Roger Robin.", "* Gappy Ranks – Hello"]}, {"page": "Di Captain", "response": ["| 9 || \"Standing Strong\" featuring Gappy Ranks || Freddie McGregor || F. McGregor / J. Williams / C. Dodd"]}, {"page": "Freddie McGregor", "response": ["His album Di Captain, released in August 2012, featured Etana and Gappy Ranks.Jackson, Kevin (2012) \"Freddie's Di Captain sets sail in August\", Jamaica Observer, 20 June 2012, retrieved 24 June 2013"]}, {"page": "Spice (musician)", "response": ["In July 2009, Spice signed a recording contract with VP Records. In 2010, she released the single \"Jim Screechie\". In 2011, Spice was featured on Gappy Ranks's \"Whatever We Like\", released as a bonus track on his album Thanks & Praise. She later released a remix for her song \"Fun\" featuring rapper Missy Elliott and collaborated with Mýa on the single \"Take Him Out\" from Mýa's sixth album K.I.S.S. (Keep It Sexy & Simple). Spice also performed the song with Mýa at Reggae Sumfest that year. A music video for \"Take Him Out\" was released in 2012."]}, {"page": "Juno Awards of 2017", "response": ["*Dubmatix, \"Roll 'Dem\" feat. Gappy Ranks"]}, {"page": "Ape Drums", "response": ["P-Money & Gappy Ranks 'Baddest' (Ape Drums Remix)"]}, {"page": "Spice discography", "response": ["| Gappy Ranks"]}, {"page": "The Heatwave", "response": ["The crew took the Showtime concept to Birmingham in June 2012 with a line-up that included Gappy Ranks, Rodney P, Top Cat, Durrty Goodz, Serocee, Lady Leshurr, RoxXxan, Juki Ranx, RTKAL, Vital, and Rubi Dan."]}, {"page": "Flow Festival line-ups", "response": ["Sunday: Reggae Sundays: Bitty McLean, Gappy Ranks and Christopher Ellis + more"]}]}}