{"wiki_id": "http://www.wikidata.org/entity/Q5526012", "itemLabel": "Gary Strodder", "itemDescription": "English footballer (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gary_Strodder", "wikipedia_page": {"main": "Gary Strodder (born 1 April 1965) is an English former professional footballer who played as a centre half.", "link_mentions": [{"page": "John Lyall", "response": ["Lyall was unable to build on the side which finished third in the First Division. McAvennie was sold to Celtic in 1987 and Cottee to Everton in July 1988 for a British transfer record of £2.05 million. Their replacements combined with the additions of Tommy McQueen, Gary Strodder, David Kelly, Allen McKnight, Liam Brady, Julian Dicks and the return of McAvennie in March 1989 failed to save West Ham from relegation in May 1989. Lyall was sacked in June 1989. He was awarded an ex gratia payment of £100,000 but left the club in what Lyall described as 'upsetting' circumstances, meriting only 73 words in a terse acknowledgement of his service in the club programme, Lyall left West Ham after 34 years service."]}, {"page": "Alan Devonshire", "response": ["Injury struck Devonshire again in the first game of the 1987–88 season. Just 15 minutes in a game against Queens Park Rangers, he snapped his Achilles tendon. This forced him out of the game for over a year and by the time of his return the West Ham team were in decline. The 1988–89 season saw him play only 20 league games without scoring as West Ham were relegated back to the Second Division. For the 1989–90 season manager John Lyall was replaced by Lou Macari who undertook the rebuilding of the West Ham side. Devonshire was rarely used making only seven league appearances that season. Macari was replaced in the same season by Billy Bonds who granted Devonshire a free transfer in May 1990. His last appearance for West Ham came on 14 February 1990 when he was a substitute for Gary Strodder in a 6–0 away defeat to Oldham Athletic in a League Cup semi-final. His performance, and that of other experienced West Ham players, Liam Brady, Phil Parkes, Alvin Martin and Julian Dicks, was described as \"embarrassingly helpless\" in a game known as the \"St. Valentine's Day massacre\".  Devonshire had played 448 competitive games over 14 years, scoring 32 goals."]}, {"page": "1986–87 West Ham United F.C. season", "response": ["John Lyall had made no signings during the close season, and it stayed that way until Stewart Robson was added in January. He was joined two months later by other new signings Gary Strodder, Tommy McQueen and Ireland international Liam Brady.", "|Gary Strodder"]}, {"page": "1987–88 West Ham United F.C. season", "response": ["|Gary Strodder"]}, {"page": "1988–89 West Ham United F.C. season", "response": ["|Gary Strodder"]}, {"page": "1989–90 West Ham United F.C. season", "response": ["|Gary Strodder"]}]}}