{"wiki_id": "http://www.wikidata.org/entity/Q5525194", "itemLabel": "Gary Hailes", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Gary_Hailes", "wikipedia_page": {"main": "Gary Hailes (born 4 November 1965 in London) is an English actor.\nHales attended Holloway School. During the 1980s he starred in several successful television series, including Woodentop, Grange Hill and the BBC soap opera EastEnders, where he played Barry Clark from 1986-89. He originally auditioned for the role of Mark Fowler when the series began in 1985, but the role went to David Scarboro instead. Hailes' character was notable for being one half of the soap's first gay couple, introduced as the partner of the yuppie graphic designer, Colin Russell (played by Michael Cashman). \nIn 1987, Hailes' character Barry Clark caused a great deal of controversy after EastEnders screened the first male-to-male kiss on a UK, prime time soap. The kiss prompted a multitude of complaints from angry viewers and a hostile backlash from the right wing press. Despite the fact that Hailes is heterosexual, he suffered from severe homophobia because of the homosexual role he played in EastEnders. He was attacked several times by members of the public who could not separate fact from fiction, which included being assaulted in a supermarket by a disapproving woman and strangled by a man at a petrol station. Even after he left the show he lost a job as a children's television presenter because of the so-called \"gay tag\".Since leaving EastEnders in 1989, he has gone on to appear in films such as The Killing Zone (1999); Murder with Mirrors and Waiting for a Killer. On television he has appeared in ITV police drama The Bill (2001–02); Horizon; Nobody’s Hero and Sorry.\nTheatre appearances include Strip Poker; Doctor on the Boil; Gollocks and numerous pantomimes. He has also performed several plays for BBC radio and voice-overs.\nAs well as acting, Hailes also drove a London taxi.Hailes is involved with the worldwide Star Wars costuming group, 501st Legion. In his position of Commanding Officer of the UK Garrison, Hailes spends much of his time traveling the country helping to raise money for charities. Hailes appeared as a Stormtrooper, along with five other members of the 501st Legion, in Star Wars: The Force Awakens.", "link_mentions": [{"page": "EastEnders", "response": ["EastEnders has been praised for its portrayal of characters with disabilities, including Adam Best (David Proud) (spina bifida), Noah Chambers (Micah Thomas) (deaf), Jean Slater (Gillian Wright) and her daughter Stacey (Lacey Turner) (bipolar disorder), Janet Mitchell (Grace) (Down syndrome), Jim Branning (John Bardon) (stroke) and Dinah Wilson (Anjela Lauren Smith) (multiple sclerosis). The show also features a large number of gay, lesbian and bisexual characters (see list of soap operas with LGBT characters), including Colin Russell (Michael Cashman), Barry Clark (Gary Hailes), Simon Raymond (Andrew Lynford), Tony Hills (Mark Homer), Sonia Fowler (Natalie Cassidy), Naomi Julien (Petra Letang), Tina Carter (Luisa Bradshaw-White), Tosh Mackintosh (Rebecca Scroggs), Ben Mitchell (Harry Reid/Max Bowden), Paul Coker (Jonny Labey), Iqra Ahmed (Priya Davdra), Ash Kaur (Gurlaine Kaur Garcha), and Callum \"Halfway\" Highway (Tony Clay). Kyle Slater (Riley Carter Millington), a transgender character, was introduced in 2015."]}, {"page": "Mark Fowler", "response": ["Several young actors were seen and read for the part of Mark (including Gary Hailes, who would later play the gay barrow boy, Barry Clark). On paper, David Scarboro was the least likely to get the job as he was relatively inexperienced, having previously only appeared in a little-known made-for-television film and Grange Hill. His reading was not a huge success as he mumbled most of his lines. However, Holland and Smith were taken with his appearance, particularly his \"piercing eyes\", which reminded them of James Dean. They felt that he would be \"dynamite on-screen\", and his likeness to their vision of the character was uncanny, so they offered him the role."]}, {"page": "List of former EastEnders characters", "response": ["|Barry Clark || Gary Hailes || 1986–1989"]}, {"page": "Woodentop (The Bill)", "response": ["The day is an eventful one: the pair's first assignment together leads them to discovering the decomposing body of a woman in her bath. Later, whilst on patrol, Jim encounters a rude youngster (Gary Hailes) and, influenced by comments made by older officers at the station, decides to clip him round the ear. That action results in Carver receiving a reprimand from Sergeant Wilding. However, the boy's father approves of his son's treatment, so no further action is taken. June Ackland and Dave Litten have been in an on-again off-again relationship and, whenever they cross paths, both tend to go silent, making other members of their relief uncomfortable. Sergeant Wilding advises Ackland to drop Litten, saying that she can do better. PC Reg Hollis is mentioned in the episode. Although not appearing on screen, an attempt is made to contact him by radio. When he fails to answer the call, the officers in the station make the assumption that he has wandered out of radio range.Introduction", "* Reg Taylor - Gary Hailes"]}, {"page": "Rod Norman", "response": ["Rod remains in Walford, as does Mary's father, who employs Rod as his bookkeeper and organiser of his haulage company and later Rod takes over Barry Clark's (Gary Hailes) market stall. Rod is later forced to act against his principles, when he is threatened by Brad Williams (Jonathan Stratt), a dodgy member of The Firm, and is forced to stitch up local publican Den Watts (Leslie Grantham). The Firm want Den to take the rap for the torching of The Dagmar, so they coerce Rod into providing a false testimony to the police, which implicates Den. Den flees Walford and manages to escape arrest but when The Firm decide they wanted Den dead, Rod is later forced to coerce his whereabouts from Den's best friend Pete Beale (Peter Dean), which leads to his arrest and a spell in prison."]}, {"page": "Colin Russell (EastEnders)", "response": ["Colin, a graphic designer, moves to Albert Square in August 1986. Colin is gay but he initially keeps this secret from the other residents of Walford. Debbie Wilkins (Shirley Cheriton) befriends Colin and they have dinner together. He comforts her when she cries for her dead fiancé, but stops her when she attempts to kiss him. In November, Colin acquires a younger boyfriend named Barry Clark (Gary Hailes). They move in together and when Dot Cotton (June Brown) discovers they are sharing a bed, she is mortified and spreads rumours that Colin has AIDS. Some of the community shun Colin, refusing to speak to him as a result. Despite this altercation, Colin and Dot forge a close friendship when Colin supports Dot following her husband Charlie Cotton's (Christopher Hancock) bigamy.", "Colin was EastEnders first homosexual character. Introduced in August 1986, Colin was one of the more popular characters in the early years of the programme. At first the audience and the residents of Walford were kept in the dark about the fact that Colin was gay. This changed by the end of the year, at which time Colin acquired a young boyfriend named Barry Clark (Gary Hailes)."]}, {"page": "Barry Clark (EastEnders)", "response": ["Barry Clark is a fictional character from the BBC soap opera, EastEnders, played by Gary Hailes from 18 November 1986 to July 1988, returning for one episode on 23 February 1989.", "Colin was a middle-classed, well-meaning, slightly uptight yuppie, so the makers of EastEnders decided that his partner needed to be in stark contrast in order to prevent him from becoming too rarefied (up until this point middle-classed characters had been relatively unsuccessful and had failed to fully integrate into EastEnders predominantly working-class community). Barry was scripted to be much more down-to-earth in comparison: working-class instead of middle-class; openly gay instead of 'in the closet'; loud and brash instead of shy and retiring and in addition the age difference between the two was substantial — Colin being roughly fifteen years Barry's senior. The actor Gary Hailes was chosen to play the role. Hailes was known to EastEnders co-creators, Tony Holland and Julia Smith, as he had previously attended auditions in 1984 for the role of Mark Fowler, but had been unsuccessful - the role went to David Scarboro instead."]}, {"page": "List of EastEnders characters (1986)", "response": ["The following is a list of characters that first appeared in the BBC soap opera EastEnders in 1986, by order of first appearance. All characters were introduced by the show's co-creator Julia Smith. The first character to be introduced during the year is John Fisher (Dave Dale), a drag queen hired for The Queen Victoria pub. Jan Hammond (Jane How), the long-term mistress of Den Watts (Leslie Grantham), was introduced in January. March sees the first appearances of The Firm mobster Brad Williams (Jonathan Stratt), Dot Cotton's (June Brown) husband Charlie Cotton (Christopher Hancock) and new brewery area manager James Willmott-Brown (William Boyde). The newborn daughter of Michelle Fowler (Susan Tully), Vicki Fowler (Emma Herry), was introduced in May. Judith Jacob and Pam St. Clement made their debuts as health visitor Carmel Jackson and Pat Butcher, the former wife of Pete Beale (Peter Dean), in June. June also sees the beginning of a new storyline, The Banned, which introduces Harry Reynolds (Gareth Potter), Tessa Parker (Josephine Melville) and Eddie Hunter (Simon Henderson). Irene (Katherine Parr), the aunt of Lofty Holloway (Tom Watt), begins appearing from July. Michael Cashman and Donald Tandy joined the cast as middle-class yuppie Colin Russell and army war veteran Tom Clements respectively in August. New general practitioner Jaggat Singh (Amerjit Deu) and Barry Clark (Gary Hailes), a love interest for Colin, make their first appearances in November. Rezaul Kabir (Tanveer Ghani), the cousin of Naima Jeffery (Shreela Ghosh), is introduced in December. Additionally, multiple other characters appear throughout the year.", "Colin Russell, played by Michael Cashman, is a middle-class yuppie described as an amiable chap with a kind heart who often ends up being used by the less considerate locals. He is Walford's first on-screen gay resident and when his sexuality is eventually revealed it causes shockwaves around the Square. Colin is EastEnders first homosexual character. Introduced in August 1986, Colin was one of the more popular characters in the early years of the programme. At first the audience and the residents of Walford were kept in the dark about the fact that Colin was gay. This changed by the end of the year, at which time Colin acquired a young boyfriend named Barry Clark (Gary Hailes). Colin was one of the most controversial characters of his time – mainly because gay-orientated content was still relatively rare on prime-time television during the mid-1980s. Gay characters that existed were usually farcical, camp parodies, created purely for comic relief, such as Mr Humphries in the situation comedy, Are You Being Served?.\"Gay TV Characters\", RainbowNetwork.com. Retrieved 30 December 2006.", "Barry Clark, played by Gary Hailes, is a cockney barrow-boy, and an unlikely partner for the gay, middle-class yuppie, Colin Russell (Michael Cashman). He is much younger than his middle-aged boyfriend and as such Colin's role is almost paternal. Barry is open about his sexuality to everyone except his volatile father – and when he is finally told he takes the news so badly that Barry turns straight just to appease him – although he is never very successful at it. Barry is one half of Walford's first homosexual couple. His boyfriend, Colin, had already been introduced to the show several months prior to Barry's arrival and he had proven to be an extremely popular addition to the cast. Both the audience and the residents of Walford had been kept in the dark about the fact that Colin was gay. This changed upon Barry's first scene on-screen, whereby the audience learnt that he had spent the night with Colin after picking him up the night before (off-screen) at a gay club. Colin and Barry were two of the most controversial characters of their time – mainly because gay-orientated content was still relatively rare on prime time television during the mid-1980s. Gay characters that existed were usually farcical camp parodies, created purely for comic relief, such as Mr. Humphries in the situation comedy, Are You Being Served?."]}, {"page": "List of EastEnders characters (1987)", "response": ["Graham is very protective of his younger brother Barry Clark (Gary Hailes). Barry is afraid to admit to Graham that he is homosexual and in a relationship with Colin Russell (Michael Cashman). He tries to cover this up, but is relieved when Graham reveals he had known he is gay and accepted it. Graham marries a girl named Kate in 1987 after she becomes pregnant with his child. Graham is looking forward to the prospect of becoming a father and asks Barry to be Godfather. Kate miscarries weeks before the baby is due in November 1987. Graham and Barry are devastated.", "Darren goes on to con Ian Beale (Adam Woodyatt) and Barry Clark (Gary Hailes). Darren provides them with equipment for a mobile disco, but the equipment turns out to be hired and further hire purchase payments are still owed. Soon after, the hire purchase men turn up and take back all the disco gear. When Carmel finds out, she throws Darren out of her flat, after which, he disappears in July 1988, abandoning his two children in the process."]}, {"page": "List of EastEnders characters (1988)", "response": ["The following weeks are tough for Guido, as he tries to help his boyfriend come to terms with his illness. Colin assumes that Guido will now want nothing more to do with him, but Guido assures him that he is there for the long haul. However, over the following months, major differences in the pair's political view points begin to surface. Colin's liberal opinions clash with Guido's more conservative ones. Colin is furious when Guido reports Junior Roberts (Aaron Carrington) to the police for stealing some of his CDs. He feels that police involvement will only worsen any anti-social behaviour, whilst Guido feels that punishment is the only way to curtail the problem. Meanwhile, Guido is becoming annoyed with Colin's tendency to worry more for others than himself, namely Donna Ludlow (Matilda Ziegler), the unappreciative heroin addict who Colin is trying to reform. Their opposing opinions bring to the fore how little they share in common. In addition, Colin cannot shake the feeling that Guido is only staying with him out of pity and so in February 1989 he decides to leave Walford to stay with his brother in Bristol. Colin decides not to tell Guido he is going, but a surprise visit from his ex, Barry Clark (Gary Hailes), stalls his departure, and Guido arrives home to see Colin packed and ready to leave. Guido is furious that Colin was planning on leaving without saying goodbye, but Colin says that he needs some space and he asks Guido to look after his flat while he sorts his head out. He then leaves a perplexed Guido to ponder on where he went wrong, and despite claiming that he will return, he never does.", "|  Judy briefly dates Barry Clark (Gary Hailes). Their relationship does not last as Barry is gay and is trying to appease his father in order to avoid being disowned.", "|  A friend of Colin Russell's (Michael Cashman) from Ealing, who visited him for a catch-up in The Dagmar. They went back to Colin's flat, where Richard admired Colin's work and listened as Colin opened up about his past relationship with Barry Clark (Gary Hailes). He told him of his recent ill health and sight problems, which Richard said were signs of stress and age; it later turns out they are signs of multiple sclerosis. He visits again in August, having heard about the firebomb attack on The Dagmar. A week later, he convinces Colin to take an overnight break, staying with Richard, his partner Tom and their new Doberman Pincher puppy, Sophie."]}, {"page": "Malcolm Needs", "response": ["His first play Strip Poker, starring Barbara Drennan, Ione Skye and Gary Hailes was performed at the Fox Theatre in North London. The play moved to the Jermyn Street Theatre, Piccadilly. Directed by Needs the cast changed to include Sue Hodge, Carol Harrison, Peter Dean. His second play Pin Money, starred and directed by June Brown. Other plays include On Holiday and Manhattan Weekend."]}, {"page": "List of LGBT characters in soap operas", "response": ["*Colin Russell, portrayed by Michael Cashman, appeared in the serial between 1986 and 1989, before returning briefly in 2016. Colin is gay, although he does not originally reveal this until he introduces his boyfriend, Barry Clark (Gary Hailes). Colin's other relationships include Guido Smith (Nicholas Donovan) and Eddie.", "*Barry Clark, portrayed by Gary Hailes, appeared in the serial between 1986 and 1988, before returning briefly in 1989. Barry is openly gay although he is closeted to his volatile father. Barry dates Colin Russell (Michael Cashman) until his father discovers their relationship and so, to appease his father, Barry pretends to be heterosexual, although it does not work and he reunites with Barry."]}, {"page": "Screen Two", "response": ["Cast: Sean Chapman, John Blundell, Ozzie Stevens, Jem Ahmet, Jason Cunliffe, Steve Fletcher, Graham Fletcher Cook, Gary Hailes, Chris Lee, Dennis Savage, Sam Smart, Steve Sweeney and James Mathews"]}, {"page": "The Witches and the Grinnygog (TV series)", "response": ["* Flanagan's mate - Gary Hailes"]}, {"page": "List of gay characters in television", "response": ["|Barry Clark || Gary Hailes || EastEnders ||"]}, {"page": "Hailes, Gary", "response": ["#redirectGary Hailes"]}]}}