{"wiki_id": "http://www.wikidata.org/entity/Q5522964", "itemLabel": "Gareth Russell", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Gareth_Russell_(author)", "wikipedia_page": {"main": "Gareth Russell is a Northern Irish historian and author.", "link_mentions": [{"page": "Anne Boleyn", "response": ["Two independent contemporary sources support the 1507 date. Author Gareth Russell wrote a summary of the evidence and relates that Jane Dormer, Duchess of Feria, wrote her memoirs shortly before her death in 1612. The former lady-in-waiting and confidante to Queen Mary I wrote of Anne Boleyn: \"She was convicted and condemned and was not yet twenty-nine years of age.\" William Camden wrote a history of the reign of Elizabeth I and was granted access to the private papers of Lord Burghley and to the state archives. In that history, in the chapter dealing with Elizabeth's early life, he records in the margin that Anne was born in MDVII (1507)."]}, {"page": "St Peter's College, Oxford", "response": ["* Gareth Russell, author"]}, {"page": "Methodist College Belfast", "response": ["*The 2011 novel Popular, and its 2012 sequel, The Immaculate Deception, by Gareth Russell are set in a fictional co-educational Belfast grammar school situated at the top of the Malone Road, based upon the College."]}, {"page": "Malone Road", "response": ["It was satirised in two novels by Gareth Russell, later adapted into a trilogy of plays, and by comedian Paddy Rafferty in his television show and successful stand-up act."]}, {"page": "Down High School", "response": ["* Gareth Russell, historian and bestselling author of Young and Damned and Fair"]}, {"page": "Malone Park", "response": ["Gareth Russell's young adult novel Popular was set in the fictional Mount Olivet Grammar School, with the main character living in Malone Park.Penguin Teen Australia, Read the first chapter of Gareth Russell's wickedly funny and utterly glamorous novel, Popular!"]}, {"page": "Russell (surname)", "response": ["* Gareth Russell (author), British historian and author", "* Gareth Russell (musician), Scottish musician"]}, {"page": "Catherine Howard", "response": ["The details and dates of this relationship are debated between modern historians. The most popular theory, first put forward in 2004 by Retha M. Warnicke, was that the relationship between them was abusive, with Mannox grooming and preying on Catherine in 1536–38, and this is expanded upon in detail by Conor Byrne. Other biographers, like Gareth Russell, believe that Mannox's interactions with Catherine took place over a much shorter time, that Mannox was roughly the same age as her, but that \"their relationship was nonetheless inappropriate, on several levels.\" He believes Catherine was increasingly repulsed by Mannox's pressure to lose her virginity to him and was angered by his gossiping with servants about the details of what had gone on between them. Mannox and Catherine both confessed during her adultery inquisitions as the wife of King Henry that they had engaged in sexual contact, but not actual coitus. When questioned, Catherine was quoted as saying, \"At the flattering and fair persuasions of Mannox, being but a young girl, I suffered him at sundry times to handle and touch the secret parts of my body, which neither became me with honesty to permit nor him to require.\"", "Catherine has been the subject of contention for modern biographies, A Tudor Tragedy by Lacey Baldwin Smith (1967), Katherine Howard: A Tudor Conspiracy by Joanna Denny (2006), Katherine Howard: Henry VIII's Slandered Queen by Conor Byrne (2019), and Young and Damned and Fair by Gareth Russell (2017). Each is more or less sympathetic, though they disagree on various important points involving Catherine's motivations, date of birth and overall character.", "Loades's and Borman's characterizations are unusually harsh, however. The general trend has been more fair to Catherine, particularly in the works of Antonia Fraser, Karen Lindsey, Joanna Denny, Conor Byrne, Josephine Wilkinson, and Gareth Russell."]}, {"page": "Cultural depictions of Marie Antoinette", "response": ["In the Gareth Russell novel Popular, one of the lead characters throws a sweet 16 birthday party with a Marie Antoinette theme but is upstaged by one of her guests when she arrives in a costume worn by Kirsten Dunst in the 2006 movie."]}, {"page": "Gareth (given name)", "response": ["* Gareth Russell (author), British author", "* Gareth Russell (musician), bass guitarist for Idlewild"]}, {"page": "Gareth Russell", "response": ["Gareth Russell may refer to:", "* Gareth Russell (musician), bass guitarist for Idlewild", "* Gareth Russell (author), British author"]}, {"page": "List of gay male teen novels", "response": ["|Gareth Russell", "|Gareth Russell"]}, {"page": "Six (musical)", "response": ["The show is based on historical figures with varying degrees of accuracy. Generally, the show is quite sympathetic towards its characters: for instance, it portrays Katherine Howard as a survivor of rape, which is debated amongst historians. Researchers and writers such as Suzannah Lipscomb and Gareth Russell have identified themselves as fans of the show."]}]}}