{"wiki_id": "http://www.wikidata.org/entity/Q5525227", "itemLabel": "Gary Heale", "itemDescription": "English footballer (born 1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gary_Heale", "wikipedia_page": {"main": "Gary John Heale (born 15 July 1958) is a former professional football (soccer) player in both USA and England.\nHeale began his career in 1975 with Canvey Island. In 1978, he moved to Luton Town. After only one season, he was transferred to Reading, where he played until 1982. That year, he moved to Sparta Rotterdam in the Netherlands for the 1982–83 season. In 1983, he moved to the San Diego Sockers of the North American Soccer League. In the fall of 1983, he signed with the Tacoma Stars of the Major Indoor Soccer League. In 1987, he moved to the Los Angeles Lazers, then to St. Louis Storm. In 1988, he spent one season with the Seattle Storm in the Western Soccer League and the Seattle Sounders of the A-League. In 1994, he signed with the Seattle Sounders in the A-League.\nHe was the head coach of the Washington Premier FC Academy in Tacoma, Washington alongside Jimmy McAlister. They coached the team to the USSF National Finals taking fifth place. In 2018 he was named head coach of Premier Development League side Wake FC. He is also a coach in their youth program.", "link_mentions": [{"page": "July 15", "response": ["*1958 – Gary Heale, English footballer and coach"]}, {"page": "Seattle Storm (soccer)", "response": [":* Gary Heale: 1989"]}, {"page": "Jimmy McAlister", "response": ["McAlister retired from the Tacoma Stars in 1986.  He then became the team's Special Events Manager.  On February 23, 1988, McAlister was named head coach after the Stars fired Alan Hinton.\"MCALISTER TO COACH STARS- CHURSKY RETAINED AS ASSISTANT COACH\"   THE SEATTLE TIMES Tuesday, February 23, 1988  McAlister took the Stars to the playoffs where they fell in the first round to the San Diego Sockers.  New ownership took over the team during the 1988 off-season and brought Hinton back in as coach.  In 2000, McAlister became the head coach of the Decatur High School boys soccer team.  The next season, he coached them to an undefeated season and the Washington State 4A championship. McAlister was head coach of professional club Hibernian Saints in 2006. He also served on the coaching staff of Washington Premier Football Club in Tacoma, Washington where alongside Gary Heale, he took the club's United States Soccer Development Academy team to the USSF national finals, taking 5th place. In January 2010, he returned to the city where he made his mark as a professional player, becoming the Director of Coaching of the Seattle United youth soccer club,\"Jimmy McAlister Selected as Director of Coaching for Seattle Youth Soccer's Unified Advanced Development Club\" as part of a coaching leadership team that also includes Technical Director and ex-Seattle Sounder Jason Farrell.\"Jason Farrell Selected as Technical Director for Seattle Youth Soccer's Unified Advanced Development Club\""]}, {"page": "List of Seattle Sounders (USL) players", "response": ["*  Gary Heale *"]}, {"page": "List of foreign football players in the Netherlands", "response": ["*Gary Heale – Sparta Rotterdam – 1982–83"]}, {"page": "Heale", "response": ["*Gary Heale (born 1958), English footballer"]}, {"page": "2019 USL League Two season", "response": ["|Gary Heale"]}, {"page": "Heale, Gary", "response": ["#redirectGary Heale"]}]}}