{"wiki_id": "http://www.wikidata.org/entity/Q5526000", "itemLabel": "Gary Stevens", "itemDescription": "English footballer (born 1954)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gary_Stevens_(footballer,_born_1954)", "wikipedia_page": {"main": "Gary Martin Stevens (born 3 August 1954) is an English former professional footballer.\nStevens was playing non-league football for Evesham United while working at Wiggins (later Special Metals) Herefordshire, when he was spotted by Cardiff City, and signed for the club during the summer of 1978 for a £4,000 fee. He made his debut in September of that year, during a 7–1 defeat against Luton Town, and scored his first goal a week later on his home debut in a 2–0 victory over Blackburn Rovers. Gary went on to score a total of thirteen goals in all competitions in his first year. The following year he finished as the club's joint top scorer, along with Ray Bishop, scoring eleven goals, and went on to claim the award again during the 1981–82 season.Following the end of the season he joined Shrewsbury Town for £20,000. He spent four years at the club before ending his career with spells at Brentford and Hereford United. He was also player coach at Mid Wales League side Knighton Town.\nHe is now a college tutor, is manager of Wellington, and works part-time for the Herefordshire FA.", "link_mentions": [{"page": "Gary Stevens", "response": ["Gary Stevens may refer to:", "* Gary Stevens (American football) (born 1943), former American football coach", "* Gary Stevens (Australian rules footballer) (born 1972), former Sydney Swans player", "* Gary Stevens (footballer, born 1954) English footballer, played for Cardiff City and Shrewsbury Town", "* Gary Stevens (footballer, born 1962) English footballer, played for Brighton and Tottenham", "* Gary Stevens (footballer, born 1963) English footballer, played for Everton and Rangers", "* Gary Stevens (jockey) (born 1963), American jockey", "* Gary Stevens (politician) (born 1941), Alaska State Senator  ", "* Gary Stevens (radio), American disc jockey in the 1960s for WMCA and Swinging Radio England", "* Gary Stevens (rugby league) (born 1944), Australian rugby league footballer"]}, {"page": "1984–85 in English football", "response": ["29 September 1984: Another day of high scoring in today's fixtures – 153 goals at an average of more than three per match. Plymouth Argyle beat Preston North End 6–4 and Everton win by the odd goal in nine at Watford who slip to the bottom of the First Division. Leeds United beat Oldham Athletic 6–0 with Andy Ritchie scoring three. Other hat-trick heroes include Gary Stevens of Shrewsbury Town and Barnsley's David Geddis. Arsenal's veteran goalkeeper Pat Jennings saves a Kenny Hibbitt penalty in his side's 2–1 win at Coventry. Liverpool in turmoil – Grobbelaar has a nightmare as Sheffield Wednesday beat them 2–0 at Anfield. The champions have won only two of their eight league matches this season."]}, {"page": "Stevens (surname)", "response": ["*Gary Stevens (footballer, born 1954), English footballer", "*Gary Stevens (rugby league) (fl. 2013), Australian rugby league player", "*Gary Stevens (jockey) (born 1963), American jockey", "*Gary Stevens (disambiguation)"]}, {"page": "Gary Stevens (footballer born 1954)", "response": ["#REDIRECT Gary Stevens (footballer, born 1954)"]}, {"page": "1986–87 Brentford F.C. season", "response": ["It was all change at Griffin Park during the 1986 off-season.White, p. 331-333. Assistant manager John Docherty left the club to become manager of Millwall and took long-serving defender Danis Salman with him, for a \"ridiculous\" £20,000 fee which was settled by tribunal. Manager Frank McLintock released midfielders Terry Bullivant, Tony Lynch, George Torrance and forwards Rowan Alexander and Steve Butler.Croxford, Lane & Waterman, p. 173. Wimbledon winger Ian Holloway's loan was made permanent for a £28,000 fee and also arriving at Griffin Park were defender Phil Bater, midfielder Paul Maddy and forward Gary Stevens. The marquee signing of Chelsea winger Paul Canoville was set to be decided by tribunal, but fell through after Reading won the day with a £60,000 bid.", "|Gary Stevens", "| style=\"text-align:left;\" |Gary Stevens", "| style=\"text-align:left;\" |Gary Stevens", "| Gary Stevens", "| Gary Stevens"]}]}}