{"wiki_id": "http://www.wikidata.org/entity/Q5524845", "itemLabel": "Gary Clail", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Gary_Clail", "wikipedia_page": {"main": "Gary Clail (born 1959) is an English singer and record producer, and the founder of the Gary Clail Sound System. He was part of On-U Sound Records (and also the On-U Sound System) and led Gary Clail's Tackhead Sound System. They had a big hit in clubs with the 1991 song \"Human Nature\".", "link_mentions": [{"page": "Trip hop", "response": ["Another influence came from Gary Clail's Tackhead soundsystem. Clail often worked with former The Pop Group singer Mark Stewart. The latter experimented with his band Mark Stewart & the Maffia, which consisted of New York session musicians Skip McDonald, Doug Wimbish, and Keith LeBlanc, who had been a part of the house band for the Sugarhill Records record label. Produced by Adrian Sherwood, the music combined hip hop with experimental rock and dub and sounded like a premature version of what later became trip hop. In 1993, Kirsty MacColl released \"Angel\", one of the first examples of the genre crossing over to pop, a hybrid that dominated the charts toward the end of the 1990s."]}, {"page": "The Stone Roses", "response": ["The Stone Roses' outdoor concert at Spike Island in Widnes on 27 May 1990 was attended by some 27,000 people, the support acts included; DJs Dave Haslam, Paul Oakenfold, Frankie Bones, Dave Booth, a Zimbabwean drum orchestra, and the reggae artist Gary Clail. The event, considered a failure at the time due to sound problems and bad organisation, has become legendary over the years as a \"Woodstock for the baggy generation\". In mid-2010 footage of the concert was published on YouTube."]}, {"page": "1991 in music", "response": ["| Emotional Hooligan || Gary Clail || US"]}, {"page": "Tackhead", "response": ["Later to join forces with Tackhead, was Gary Clail, who as MC for the touring version of the On-U sound system, would shout and rant over Tackhead's live playing, and both were then mixed live by Sherwood to produce a wall of sound effect that was highly novel for the mid-1980s. They released one LP Tackhead Tape Time in 1987 as \"Gary Clail's Tackhead Sound System\" and some of the most distinctive and well-known Tackhead tracks (some were released as 12-inch singles) date from this period particularly: \"What's My Mission Now?\", \"Mind at the End of the Tether\" and \"Hard Left\". These tracks combined funk basslines, hammerblow percussion and Sherwood's trademark sample-laden dub production and represent the defining Tackhead sound.", "Despite not recording any new material as Tackhead since, group members continued to record as the backing band or along with various Sherwood-led On-U Sound productions artists such as Gary Clail's solo efforts, African Head Charge, Dub Syndicate, New Age Steppers and others. Subsets of the group have also appeared in various guises such as the Strange Parcels, Barmy Army and the blues-oriented Little Axe."]}, {"page": "Spike Island, Widnes", "response": ["Spike Island was the site of a famous outdoor concert by The Stone Roses in May 1990. The support acts included DJs Dave Haslam, Paul Oakenfold and Frankie Bones, a Zimbabwean drum orchestra and the reggae artist Gary Clail. The NME wrote \"Spike Island was to be the Roses' defining statement, a celebration of not only their own success, but of an entire youth culture\" and also \"It was a real moment in time; the beginning of a long hot summer that saw England nearly go all the way in the World Cup, the peak of a period when Manchester and the north-west felt like the centre of the universe.\" 30,000 people attended the concert; the organisation was described as \"amateurish\", and this increased the fame of the event. The police informed the organisers that the tide was so high that everyone might have to be taken off the island. As the Stone Roses took to the stage a cloud of red dust formed in front of the stage, triggering asthma attacks among some members of the crowd."]}, {"page": "On-U Sound Records", "response": ["On-U Sound Records is an English record label known for releasing its own unique flavour of dub music since the 1980s. The label was founded by Adrian Sherwood in 1979/1980 and is home to acts such as Tackhead, Dub Syndicate, African Head Charge, Akabu, The London Underground, Little Annie, Creation Rebel, Mark Stewart, Gary Clail (who would have a number of Top 40 hits, like \"Human Nature\", credited to Gary Clail On-U Sound System), New Age Steppers, Audio Active, Asian Dub Foundation, and the dub collective Singers & Players."]}, {"page": "Sixteen Tons", "response": ["* 2014: Gary Clail released a break-beat/dub version on his comeback album Nail It To The Mast."]}, {"page": "Reading and Leeds Festivals line-ups", "response": ["*Gary Clail's On-U Sound System with Bim Sherman & Adrian Sherwood"]}, {"page": "The Mock Turtles", "response": ["In March 1991, the British music magazine NME reported that the band were appearing at the 'Great Indie Festival – A Midsummer's Day Dream' at Milton Keynes Bowl in June that year.  Also on the bill were 808 State, Gary Clail, Shades of Rhythm, The Shamen, Paris Angels plus Flowered Up."]}, {"page": "Eurockéennes", "response": ["* Gary Clail"]}, {"page": "Little Annie", "response": ["She then went on to become the house chanteuse for Adrian Sherwood's On-U Sound Records, including the recording of three solo albums Soul Possession, Short & Sweet, and Jackamo.Annie Anxiety Bandez Jakomo\", The Wire, Issues 275-280, p. 149McFarlane, Dean \"Jackamo Review\", Allmusic. Retrieved December 16, 2018 During this time she also recorded with The Wolfgang Press, Current 93, Coil, Nurse With Wound, Lee 'Scratch' Perry, Bim Sherman, CL Stealers, Swans, Kid Congo Powers, Fini Tribe, and wrote for the late Bim Sherman, Paul Oakenfold, Gary Clail, and Living Color."]}, {"page": "Glastonbury Festival line-ups", "response": ["* Gary Clail"]}, {"page": "Gimme Shelter", "response": ["*Pop Will Eat Itself vs Gary Clail vs Ranking Roger vs the Mighty Diamonds vs the On U Sound System"]}, {"page": "On the Wire", "response": ["Guests on the show have included Lee Perry, Mark E Smith, Half Man Half Biscuit, Kelly Joe Phelps, Alvin Youngblood Hart, Jeb Loy Nichols and Blood and Fire. Highlight shows include: An Xmas party at the Ritz in Manchester including Sherwood with Gary Clail, 808 State, A Guy Called Gerald, Little Annie and Neneh Cherry; putting on The Fall free at Clitheroe Castle and the three hour dub special shows.  "]}, {"page": "List of NME covers", "response": ["*27/04/91 Gary Clail"]}, {"page": "Paris Angels", "response": ["On the back of their early success, the band signed to Virgin Records and released new single \"Fade\" and re-released \"Perfume\" to back up Paris Angels only album, Sundew, to favourable reviews from NME, Vox and Melody Maker. Paris Angels then recorded a session for BBC Radio 1 disc jockey John Peel. \"Stay\", appeared on the best of the Peel Session's box set, and they had other radio and television sessions. In March 1991, NME reported that Paris Angels were appearing at the 'Great Indie Festival – A Midsummer's Day Dream' at Milton Keynes Bowl in June that year.  Also on the bill were 808 State, Gary Clail, New Fast Automatic Daffodils, The Shamen, Shades of Rhythm plus Flowered Up."]}, {"page": "List of performances on Top of the Pops", "response": ["* Gary Clail – \"Human Nature\""]}, {"page": "List of Rage guest programmers", "response": ["* Nov 2: Gary Clail"]}, {"page": "Trinity Centre", "response": ["As a music venue, Trinity was a melting pot for the different styles popular at the time, from reggae through ska to punk. From this came a post-punk scene which blended many of these influences. Trinity saw regular performances from local acts such as Mark Stewart and The Pop Group, who through their collaborations with artists and producers from the reggae scene, as well as artists such as On-U Sound System and Gary Clail laid the foundations for the later trip hop genre, known as the \"Bristol Sound\"."]}, {"page": "Anti-Fascist Action", "response": ["Cable Street Beat continued in the early 1990s, with the involvement of bands including the reformed The Selecter,Fighting Talk no.1, p.13 Bad Manners and Gary Clail."]}, {"page": "Little Axe", "response": ["After leaving Sugarhill, McDonald, Wimbish, and drummer Keith LeBlanc began working with Adrian Sherwood, and eventually formed the trio into the industrial/dub group Tackhead, initially fronted by Gary Clail and later Bernard Fowler. McDonald would also collaborate with Sherwood on other projects, including albums by African Head Charge and Mark Stewart."]}, {"page": "New Fast Automatic Daffodils", "response": ["In March 1991, the British music magazine, NME, reported that the band were appearing at the 'Great Indie Festival - A Midsummer's Day Dream' at Milton Keynes Bowl in June that year. Also on the bill were 808 State, Gary Clail, Shades of Rhythm, The Shamen, Paris Angels plus Flowered Up. Further singles followed in 1991 and 1992, with second album Body Exit Mind issued in October 1992 (reaching No. 57 in the UK). 1994 saw the band shorten their name to New FADS, with 2 EPs released that year, before a final album, Love It All in 1995. The band split up in 1995."]}, {"page": "The Beatnigs", "response": ["The Beatnigs were an American, San Francisco-based band, which combined hardcore punk, industrial and hip hop influences, described as \"a kind of avant-garde industrial jazz poets collective\".The Rough Guide to Rock, Peter Buckle, ed. Rough Guides (2003)   The band was the initial collaboration of Michael Franti and Rono Tse, who would later form The Disposable Heroes of Hiphoprisy, and Kevin Carnes who would later form Broun Fellinis. The band's stage performance included the use of power tools such as a rotary saw on a metal bar to create industrial noise and pyrotechnics.Watrous, P. (1998) Rock From the Beatnigs, New York Times November 13, 1988  The Beatnigs released an LP  (virus065, Jan 1988) and 12\" EP of their most famous song,Friskics-Warren, W. (2005) I'll Take You There: Pop Music And the Urge for Transcendence Continuum International Publishing Group. Goodwin, A. (1991). Popular music and postmodern theory Cultural studies 5:174-198 \"Television: The Drug of the Nation (virus071, remixed by Adrian Sherwood, Gary Clail, and Mark Stewart) on Alternative Tentacles in 1988.Robbins, IA (1991) The Trouser Press Record Guide, 4th ed. Maxwell Macmillan International,   That same year the played their NYC debut at the New Music Seminar,Watrous, P. (1998) Rock by Any Other Name Is \"Alternative\" New York Times July 15, 1988 and recorded for the BBC's Peel Sessions.  The single was reissued by Alternative Tentacles in 2002, and the album was planned for a CD re-release while made available on iTunes and other digital retailers. One venue for the band was Barrington Hall."]}, {"page": "Paul Oakenfold discography", "response": ["! scope=\"row\" rowspan=\"2\"| Gary Clail & On-U Sound System"]}, {"page": "The Beatnigs (album)", "response": ["* \"Television\" (Remix) remixed by Adrian Sherwood, Gary Clail and Mark Stewart"]}, {"page": "List of bands from Bristol", "response": ["*Gary Clail: Rap singer and producer. Part of On-U Sound Records and led Gary Clail's Tackhead Sound System. His 1991 single 'Human Nature' released as Gary Clail On-U Sound System reached No. 10 in the UK chart."]}, {"page": "Franz Treichler", "response": ["* Gary Clail & On-U Sound System — \"These Things Are Worth Fighting For (Young Gods Club Mix)\" (1993)"]}, {"page": "Lanah P", "response": ["Pillay metamorphosed into a disco diva as the hormone-popping transsexual Lana Pellay, dressed in costumes by his close friend Leigh Bowery,Positive Nation Interview with Pillay  \"Leigh Bowery and I were enormously close. I still have all the big Liberace coats and shirts he made me\". enjoying a top 40 single in Australia and New Zealand with \"Pistol in My Pocket\". He also accompanied Gary Clail on his 1991 hit \"Human Nature\", singing the couplet \"Let the carnival begin... Every pleasure, every sin!\""]}, {"page": "The Hits Album (15)", "response": ["#Gary Clail On-U Sound System - \"Human Nature\""]}, {"page": "Shades of Rhythm", "response": ["In March 1991, the British music magazine, NME, reported that Shades of Rhythm were appearing at the 'Great Indie Festival - A Midsummer's Day Dream' at Milton Keynes Bowl in June that year.  Also on the bill were 808 State, Gary Clail, New Fast Automatic Daffodils, The Shamen, Paris Angels plus Flowered Up."]}, {"page": "List of UK top-ten singles in 1991", "response": ["|Gary Clail On-U Sound System", "|align=\"left\"|Gary Clail On-U Sound System"]}, {"page": "David Harrow", "response": ["The following year, Harrow started working with ONU as one of the many groups signed to the label, and began touring as ONU Soundsystem along with Barmy Army, African Headcharge, Strange Parcels, Dub Syndicate, Jesse Rae and vocalist Gary Clail. Harrow wrote recorded and co-produced tracks for artists such as Lee \"Scratch\" Perry, Bim Sherman and Mark Stewart, and performed worldwide with all of the above."]}, {"page": "Friendly as a Hand Grenade", "response": ["The band added Bernard Fowler on vocals, and changed its name from Gary Clail's Tackhead Sound System. The album cover art is by Gee Vaucher."]}]}}