{"wiki_id": "http://www.wikidata.org/entity/Q5528166", "itemLabel": "Gavin Hamilton", "itemDescription": "British army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Gavin_Hamilton_(British_Army_officer)", "wikipedia_page": {"main": "Gavin John Hamilton, MC (15 May 1953 – 10 June 1982) was a British Army infantry soldier. He was the Officer Commanding 19 (Mountain) Troop, D Squadron, 22 Special Air Service during the Falklands War when he was killed in action behind enemy lines on West Falkland.", "link_mentions": [{"page": "Battle of Mount Harriet", "response": ["On the night of 30 May, K Company of 42 CDO boarded three Sea King helicopters and moved forward of San Carlos to secure the commanding heights of Mount Kent at ,Mount Kent - Falkland Islands at Peakery.com one of the tallest of the peaks surrounding Stanley where Major Cedric Delves' D Squadron from the Special Air Service (SAS) had established a strong presence. When the Royal Marines reinforcements and 7 'Sphinx' Battery of the 29th Commando Regiment Royal Artillery aboard a Chinook helicopter, arrived at the landing zone, 3 kilometres (2 miles) behind the ridge of the mountain, they were met by gun-flashes, mortar detonations and tracer rounds as a second clash involving D Squadron was taking place.  Captain Gavin Hamilton's Mountain Troop that had spotted enemy movement in the form of Captain Tomás Fernández' 2nd Assault Section, 602 Commando Company trying to exit the area after having taking cover among the boulders and caves on Bluff Cove Peak the day before."]}, {"page": "Green Howards", "response": ["From 1949 to 1952, the regiment took part in the campaign against Chinese and Malayan Communist Insurgents in Malaya. Over the next 30 years it served in Afghanistan, Suez, Cyprus, Hong Kong, Libya, Belize, Berlin and Northern Ireland. While serving with the SAS, a former officer of the regiment, Gavin Hamilton, was killed in action during the Falklands War in 1982. It also saw action during the First Gulf War in 1991 and during the Bosnian War from 1996 to 1997."]}, {"page": "Operation Paraquet", "response": ["On the next day, the 15 men of Mountain troop, led by Captain Gavin Hamilton, were airlifted onto Fortuna glacier by two Wessex helicopters. They were immediately confronted with extreme conditions including 100 mph winds and freezing temperatures. Deep crevasses slowed the advance, and when the men attempted to set up camp and wait out the storm, their tents were swept away by the wind. Finally, after 15 hours on the glacier, Captain Hamilton requested evacuation, with the message \"Unable to move. Environmental casualties imminent.\" Three Wessex helicopters were dispatched from the Task Force: two Wessex Mk5s from Tidespring and one Mk3 from Antrim. After one failed attempt, they managed to locate and embark the stranded SAS men, but in whiteout conditions, one pilot became disorientated and his aircraft crashed. The passengers were loaded onto the two remaining helicopters, but soon afterwards one of these hit a ridge and crashed, though once again without any serious casualties. The last Wessex, Antrim′s Mk3, after having offloaded its troops on board the destroyer returned to the glacier and after two failed attempts managed to retrieve the downed SAS and aircrew, though their equipment had to be abandoned. The pilot, Lieutenant commander Ian Stanley, managed to nurse his overloaded aircraft back to Antrim and make an emergency landing on her flight deck, for which he was later awarded the Distinguished Service Order."]}, {"page": "Gavin Hamilton", "response": ["Gavin Hamilton may refer to:", "* Gavin Hamilton (archbishop of St Andrews) (died 1571), archbishop of St Andrews", "* Gavin Hamilton (bishop of Galloway) (1561–1612), bishop of Galloway", "* Gavin Hamilton (artist) (1723–1798), Scottish artist", "* Gavin Hamilton (lawyer) (1751–1805), Friend of Robert Burns", "* Gavin Hamilton, 2nd Baron Hamilton of Dalzell (1872–1952), British politician", "* Gavin Hamilton (British Army officer) (1953–1982), SAS officer killed in Falklands War", "* Gavin Hamilton (cricketer) (born 1974), Scottish cricketer"]}, {"page": "Armed Forces Memorial", "response": ["*Gavin Hamilton (1953–1982), highest ranking SAS soldier killed in the Falklands War"]}, {"page": "Royal Masonic School for Boys", "response": ["* Gavin Hamilton (British Army officer) – Military Cross (Posthumously Awarded)"]}, {"page": "Skirmish at Many Branch Point", "response": ["On 10 June 1982, in the closing days of the Falklands War, Many Branch Point, a ridge near Port Howard in West Falkland, was the site of a minor skirmish between the Argentine and British Armed Forces. The engagement ended with the death of the SAS patrol commander, Captain Gavin Hamilton. The action was the only ground engagement of the British and Argentine forces on West Falkland during the conflict."]}, {"page": "Gavin Hamilton (SAS)", "response": ["#REDIRECT Gavin Hamilton (British Army officer)"]}, {"page": "Battle of Mount Kent", "response": ["That following day, another SAS ambush took place when Lieutenant-Commander Dante Camiletti's Marine Special Forces patrol (minus Camilletti and corporal Juan Carrasco who had been captured at Verde Mountain and Teal Inlet respectively) were returning from reconnoitring San Carlos and were ambushed by Captain Gavin Hamilton's Mountain Troop on the lower slopes of Estancia Mountain.  Sergeants Jesús Pereyra and Ramón López were seriously wounded and captured along with corporals Pablo Alvarado and Pedro Verón who were unwounded. During the reconnaissance of San Carlos, a British gunner, (George Joblin) was shot and wounded by friendly fire.George Joblin was hit in the shoulder and wounded with small arms fire from one of our own weapons. Commando Gunner Regroup"]}, {"page": "Gavin John Hamilton", "response": ["#REDIRECT Gavin Hamilton (British Army officer)"]}]}}