{"wiki_id": "http://www.wikidata.org/entity/Q552608", "itemLabel": "Justin Hawkins", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Justin_Hawkins", "wikipedia_page": {"main": "Justin David Hawkins (born 17 March 1975) is an English musician, singer and songwriter, best known for being the lead singer and lead guitarist of the Darkness. Heavily influenced by rock bands of the 1970s and 1980s (particularly Queen, Aerosmith, Def Leppard and AC/DC), Hawkins is noted for his falsetto singing voice and flamboyant on-stage persona. He was also the lead singer and guitarist for the band Hot Leg, formed in 2008 and now on hiatus. His falsetto voice has been described as operatic and very similar to that of Queen's Roger Taylor.", "link_mentions": [{"page": "March 17", "response": ["*1975 – Justin Hawkins, English singer-songwriter "]}, {"page": "Meat Loaf", "response": ["In May 2009, Meat Loaf began work on the album Hang Cool Teddy Bear in the studio with Green Day's American Idiot album producer Rob Cavallo, working with such writers as Justin Hawkins, Rick Brantley, Ollie Wride, Tommy Henriksen, and Jon Bon Jovi. The album is based on the story of a fictional soldier, whose \"story\" furnishes the theme. The album is based on a short story by the Los Angeles-based screenwriter and director Kilian Kerwin, a long-time friend of the singer. Hugh Laurie and Jack Black both perform on the album, Laurie plays piano on the song \"If I Can't Have You\", while Black sings a duet with Meat Loaf on \"Like A Rose\". Patti Russo and Kara DioGuardi also duet on the album. Brian May of Queen features on guitar along with Steve Vai. It received positive reviews from critics and fans alike. The first single from the album, \"Los Angeloser\", was released for download on April 5 with the album charting at number 4 in the UK Albums Chart on April 25, 2010. The Hang Cool Tour followed in the United States, United Kingdom, and Canada. Patti Russo accompanied him on the tour, continuing through mid-2011."]}, {"page": "Brian May", "response": ["May has been referred to as a virtuoso guitarist by many publications and musicians.Phil Sutcliffe, Peter Hince, Reinhold Mack Queen: The Ultimate Illustrated History of the Crown Kings of Rock  p.164. Voyageur Press, 2009 He has featured in various music polls of great rock guitarists, and in 2011 was ranked number 26 on Rolling Stone magazine's list of the \"100 Greatest Guitarists of All Time\". In January 2007, the readers of Guitar World voted May's guitar solos on \"Bohemian Rhapsody\" and \"Brighton Rock\" into the \"top 50 Greatest Guitar Solos of all time\" (No.20 and No.41 respectively). Former Van Halen vocalist Sammy Hagar stated, \"I thought Queen were really innovative and made some great sounding records... I like the rockin' stuff. I think Brian May has one of the great guitar tones on the planet, and I really, really love his guitar work.\" Justin Hawkins, lead guitarist of the Darkness, cites May as his earliest influence, saying \"I really loved his tone and vibrato and everything. I thought his playing sounded like a singing voice. I wanted to be able to do that. Whenever I went to guitar lessons, I was always asking to learn Queen stuff.\""]}, {"page": "Surrey", "response": ["* Justin Hawkins, lead singer of rock band The Darkness, was born in Surrey."]}, {"page": "Band Aid (band)", "response": ["Band Aid 20 was the 2004 incarnation of the charity group Band Aid. The group, which included Daniel Bedingfield, Justin Hawkins of The Darkness, Chris Martin of Coldplay, Bono of U2, and Paul McCartney, re-recorded the 1984 song \"Do They Know It's Christmas?\", written by Band Aid organisers Bob Geldof and Midge Ure.", "*Justin Hawkins (The Darkness)", "*Justin Hawkins (The Darkness) – guitar"]}, {"page": "1975 in music", "response": ["**Justin Hawkins, English singer-songwriter, musician, guitarist (The Darkness)"]}, {"page": "List of singer-songwriters", "response": ["* Justin Hawkins"]}, {"page": "2DTV", "response": ["* Enn Reitel – Tony Blair, Jack Straw, John Prescott, Breckin Meyer, Lyle Lovett, Michael Jackson, Johnny Vegas, Daniel Moder, Anthony McPartlin, Jeremy Clarkson, Michael Howard, Will Young, Tom Cruise, George Clooney, Tim Henman, Justin Hawkins, Simon Cowell, Jack Osbourne, Bill Cosby, James Earl Jones, Eddie Murphy, Gordon Ramsay, Jacques Chirac, Phil Spencer, Jared Fogle, Bertie Ahern, David Dimbleby, Peter Andre, Frank Skinner, Des Lynam, Robbie Williams, Gareth Gates, Lawrence Llewelyn-Bowen, Uri Geller, David Blunkett, Charles Kennedy, Liam Neeson, Dick Cheney, Jay Leno, Arnold Schwarzenegger, Conan O'Brien, Prince Philip, Tom Hanks, Prince Edward, Princes William and Harry, Rowan Atkinson, Tim Allen, Osama Bin Laden, Pope John Paul II"]}, {"page": "The Darkness (band)", "response": ["The Darkness are a British rock band formed in Lowestoft, England, in 2000. The band consists of Justin Hawkins (lead vocals, lead guitar), his brother Dan Hawkins (rhythm guitar, backing vocals), Frankie Poullain (bass guitar, backing vocals) and Rufus Tiger Taylor (drums, backing vocals).", "After extensive touring in support of their debut album, Poullain left the band in 2005, and was replaced by former guitar technician Richie Edwards. The band's second studio album, One Way Ticket to Hell... and Back, was released in November 2005. The following year, Justin Hawkins departed from the band after successfully completing a course of rehabilitation from alcohol and cocaine abuse. As a result, the remaining members formed Stone Gods, and continued to perform and record without Hawkins, who subsequently fronted his own project, Hot Leg.", "Justin and Dan Hawkins played together as teenagers in a band which, according to Dan Hawkins, \"did a lot of Marillion covers, Bruce Springsteen, Genesis\" and were \"a bit prog-y\". Justin Hawkins had been initially inspired to play guitar by Brian May of Queen, as he loved his tone and vibrato.", "Originally known as Empire, the band generated some music industry buzz through their manager Sue Whitehouse, who was based at Savage & Best in Camden. Whitehouse had managed them since Justin Hawkins' time as a creator of music jingles.", "In October 2005, a month before the album was to be officially released, Justin Hawkins won an eBay auction for a copy of One Way Ticket to Hell ...and Back for £350 under the username 'turbogunhawk'. He claimed he did this so that he could track down whoever sold the digitally-marked advance copy of the album and try to prevent it from happening again.", "===Justin Hawkins' departure and breakup (2006)===", "In August 2006, lead singer Justin Hawkins was admitted to a rehabilitation clinic in concern of his health, which caused the band to cancel several concerts. Around this same time the band confirmed that they were to start working on their third album to be released early 2007. Tabloid rumours held that Justin Hawkins was leaving the band after completing his course of rehabilitation from alcohol and cocaine problems, and the band would continue without him, possibly with Richie Edwards as the front man. In response to the story being reported by the media, The Darkness confirmed on their official forum:  \"We're sorry that you had to find this out through the newspapers, but we were hoping until the last minute that this – Justin's exit – wasn't going to happen. We – Dan, Ed and Richie – are still in total shock and can't say at this stage what the future holds. We would like to thank all our fans, partners and family for their continuous support. You will hear from us, once we know what we want to do...\"", "In 2008, Justin Hawkins formed a new band, Hot Leg with Pete Rinaldi (of Anchorhead), Samuel SJ Stokes (formerly of The Thieves) and Darby Todd (from Protect the Beat). In 2009 Hot Leg released an album, Red Light Fever, which failed to make a dent on the charts (#81). Three singles were taken from it with two of them failing to chart.", "* Justin Hawkins – lead vocals, lead and rhythm guitar, keyboards "]}, {"page": "Phil Taylor (darts player)", "response": ["He also appeared in Justin Hawkins' solo project British Whale's music video for a cover of the Sparks song, \"This Town Ain't Big Enough for the Both of Us\"."]}, {"page": "Richard Hammond", "response": ["Hammond plays bass guitar, on which he accompanied the other Top Gear presenters when they performed alongside Justin Hawkins on Top Gear of the Pops for Comic Relief in 2007."]}, {"page": "Permission to Land", "response": ["In addition to its chart success, Permission to Land also provided the Darkness with two high-profile music awards; Best Rock Album at the 2003 Kerrang! Awards and Best British Album at the 2004 BRIT Awards (at which they also won the awards for Best British Group and Best British Rock Act). Permission to Land was voted 49th in the 50 Greatest Albums of the 21st Century in Kerrang!. Permission to Land was later referenced in the song \"Whichever Way You Wanna Give It\" by lead singer Justin Hawkins' other band Hot Leg.", "*Justin Hawkins – vocals, lead and rhythm guitar, synthesizer, piano"]}, {"page": "Ed Graham", "response": ["The Darkness was conceived at a millennium eve party by the Hawkins brothers, Justin and Dan. The line up was completed some months later by Graham and bass player Frankie Poullain. Graham played on three studio albums: Permission to Land, One Way Ticket to Hell... and Back and Hot Cakes. In 2006, the Darkness split due to Justin Hawkins leaving. Graham and Dan Hawkins went on to form the Stone Gods, recruiting Toby Macfarlaine and promoting Darkness guitar technician Richie Edwards to frontman."]}, {"page": "Dan Hawkins (musician)", "response": ["Daniel Francis Hawkins (born 12 December 1976 in Chertsey, England) is an English rock guitarist, best known as a guitarist and backing singer of the UK band, The Darkness. The band fronted by his older brother Justin Hawkins achieved notable mainstream success between 2002 and 2006. He also plays lead guitar for Stone Gods. He is influenced by hard rock and glam metal bands, including Led Zeppelin, Aerosmith, Def Leppard, Whitesnake, AC/DC, Queen, Mötley Crüe and Thin Lizzy.", "After moving to Lowestoft, Hawkins attended Kirkley High School and achieved good grades in his GCSEs before leaving his hometown behind for the bright lights and cosmopolitan lifestyle of Camden, London. From a young age, he aspired to be a musician, beginning on drums, moving on to bass and finally mastering the guitar. Back in his early days in his professional career, he worked as a session guitarist for various artists including Natalie Imbruglia. Previous bands include Vital Signs and Empire before The Darkness consisting of Justin Hawkins, Ed Graham, Frankie Poullain and later, Richie Edwards, became a mainstream success. With The Darkness he has won Brits, MTV and Kerrang awards and the prestigious Ivor Novello Award for songwriting in 2004. The Darkness split in 2006."]}, {"page": "Bargain Hunt", "response": ["On 26 September 2019, the second BBC Music Day special was shown with The Darkness (lead singer Justin Hawkins and bassist Frankie Poullain) competing against Feeder (lead singer Grant Nicholas and bassist Taka Hirose) at the Stamford Meadows antiques fair in Lincolnshire."]}, {"page": "Do They Know It's Christmas?", "response": ["* Justin Hawkins (The Darkness)", "* Justin Hawkins (The Darkness) – guitar"]}, {"page": "Chertsey", "response": ["*Justin Hawkins, lead singer of The Darkness rock group, singer and songwriter, was born in Chertsey in 1975."]}, {"page": "Sparks (band)", "response": ["After Balls, the band resurfaced in 2002 with the release of an album described as their \"genre-defining opus\" – Lil' Beethoven, featuring quasi-classical arrangements of strings and choirs. Lil' Beethoven led to renewed interest in the band. Record Collector magazine named the album as one of its \"Best New Albums of 2002\", describing it as \"...possibly the most exciting and interesting release ever from such a long-established act\" and later in 2003 saying \"...it really does feel like one of the best albums ever made.\" A UK and European tour had the band playing the entire album each night in the first half of the show, with fan favourites making up the second. The line-up now included former Faith No More guitarist Dean Menta in addition to Tammy Glover on drums. Long-time fan Morrissey invited Sparks to perform at the 2004 Meltdown Festival, of which he was curator. They performed their breakthrough Kimono My House album, followed by Lil Beethoven, both in their entirety. Also in this period, the duo appeared in the music video for the Darkness' Justin Hawkins's cover of \"This Town Ain't Big Enough for Both of Us\", in which Ron and Russell play the referee and MC at a darts match between Hawkins and darts champion Phil Taylor. This version of \"This Town\" reached No.6 in the UK charts. Sparks would later release Lil' Beethoven's closing track Suburban Homeboy as a single."]}, {"page": "Tomoyasu Hotei", "response": ["Hotei released his 18th solo studio album, Guitarhythm VI in May 2019, 10 years after Guitarhythm V. It features collaborations with Man With A Mission, Cornelius, keyboard player Mike Garson, and Hotei's former Boøwy bandmates Tsunematsu Matsui and Makoto Takahashi. The album was preceded by three singles in the month before its release, with lead single \"Give It To The Universe\" becoming Hotei's fastest streamed track up to that point. A nationwide summer Guitarhythm VI tour followed the album release, with Hotei using a UK rhythm section for the first time for a Japanese tour - Steve Barney (drums) and Mark Neary (bass). In September Hotei was special guest at two shows for the all star SAS band in Portsmouth and London UK, sharing the stage with Roger Taylor, Spike Edney and Justin Hawkins amongst others. Hotei reprised his GuitarRhythm Tour in Japan in December."]}, {"page": "Band Aid 20", "response": ["Band Aid 20 was the 2004 incarnation of the charity supergroup Band Aid. The group, which included Daniel Bedingfield, Dido, Justin Hawkins of The Darkness, Thom Yorke and Jonny Greenwood of Radiohead, Chris Martin of Coldplay, Bono of U2, and Paul McCartney, re-recorded the 1984 song \"Do They Know It's Christmas?\", written by Band Aid organisers Bob Geldof and Midge Ure.", "Bono and Paul McCartney were the only artists from the original Band Aid to lend their voices to Band Aid 20. There was a reported dispute over the line 'Well tonight thank God it's them, instead of you', which Bono sang on the original version. Justin Hawkins, of The Darkness, laid down a version of the line, as did Robbie Williams, but Bono insisted on re-recording his version, which was eventually used on the record.", "*Justin Hawkins and Dan Hawkins (The Darkness) – guitar", "*Justin Hawkins (The Darkness)"]}, {"page": "The Ongoing History of New Music", "response": ["*Ep 695 (2014-09-28) Kings of Quirk - featuring: Lou Reed of The Velvet Underground, Captain Beefheart, Russell Mael of Sparks, Dave Thomas of Pere Ubu, Klaus Nomi, Tom Waits, Robert Smith of The Cure, David Byrne of Talking Heads, Leonard Cohen and Justin Hawkins of The Darkness."]}, {"page": "2006 in music", "response": ["*October 10 – Justin Hawkins, lead singer of the band The Darkness announces he is leaving the band."]}, {"page": "The Sunday Night Project", "response": ["| Justin Hawkins"]}, {"page": "England (disambiguation)", "response": ["* \"England\", a song by Justin Hawkins"]}, {"page": "UK national selection for the Eurovision Song Contest", "response": ["During a press conference on 28 February 2007, the BBC confirmed that the artists taking part in Making Your Mind Up would include Big Brovaz, an RnB group who had 4 UK Top 10 singles in 2002–2003, Brian Harvey, a former member of the boy band East 17; Cyndi; Justin Hawkins of The Darkness, performing a duet with Beverlei Brown; Liz McClarnon, formerly of girl group Atomic Kitten; and Scooch, the eventual winners with \"Flying the Flag (for You)\". Scooch sang their entry in the Eurovision Song Contest 2007 on 12 May 2007 in Helsinki, Finland and finished in second-to-last place with 19 points, ahead of Ireland who placed last."]}, {"page": "List of guitarists", "response": ["*Justin Hawkins (The Darkness)"]}, {"page": "The Ark (Swedish band)", "response": ["Beginning in the first half of 2005, The Ark was to be launched in the United States and did much travelling to New York where they gained a small but dedicated audience. Justin Hawkins from the British band The Darkness intended to aid The Ark in their British career and brought them along as support act when The Darkness toured the UK and Ireland in February–March 2006, and also Scandinavia."]}, {"page": "Richie Edwards", "response": ["Richie Edwards (born 25 September 1974) is an English musician. He is the former bassist of the British hard rock band The Darkness and the guitarist/vocalist of their successor band Stone Gods. He was confirmed as a member on 13 June 2005 replacing Frankie Poullain on bass. When The Darkness disbanded following Justin Hawkins' departure, Edwards switched to lead vocals with Toby McFarlaine taking over on bass. With original Darkness members Ed Graham and Dan Hawkins completing the new line-up, they recorded under the new name of The Stone Gods."]}, {"page": "I Believe in a Thing Called Love", "response": ["Category:Songs written by Justin Hawkins"]}, {"page": "British Whale", "response": ["#REDIRECTJustin Hawkins"]}, {"page": "Growing on Me", "response": ["Despite rumours surrounding the song's meaning, lead singer Justin Hawkins has refuted suggestions that the lyrics pertain to pubic lice or sexually transmitted infections: \"People have said it's about pubic lice, but that's obviously wrong because pubic lice don't grow on you, do they?\"  Hawkins has also commented on the song's true meaning: \"A sweet lady woman that you will never fully fathom or understand, but you love her so much that after a while it doesn't matter.\"Justin Hawkins interview with VH1", "Category:Songs written by Justin Hawkins"]}, {"page": "Yeah! (Def Leppard album)", "response": ["*Justin Hawkins – backing vocals on \"Hell Raiser\""]}, {"page": "One Way Ticket to Hell... and Back", "response": ["*Justin Hawkins – Lead/backing vocals; lead/rhythm guitars; piano; Hammond organ; Mini-moog; synths; sitar"]}, {"page": "IHeartRadio MMVAs", "response": ["| 2004 || Avril Lavigne, Christina Milian, Justin Hawkins, Default, Joel Madden, Hawksley Workman, In Essence, Keshia Chante, Kyprios, Nickelback, Our Lady Peace, Pilate, Sam Roberts, Simple Plan, The Trews||"]}, {"page": "Magnus Fiennes", "response": ["As a producer/arranger programmer and re-mixer, Fiennes has worked with a diverse range of artists including Neneh Cherry, Marianne Faithfull, Bryan Ferry, the Spice Girls, Hal David, Seal, Yello, Propaganda$2, Erazure, Eagle-Eye Cherry, David McAlmont, Ian McCulloch, Roland Gift, Lenny Kravitz, Nigel Kennedy, Daniel Lanois, Trilok Gurtu, Damien Hirst (in the guise of Fat Les's Vindaloo), Dot Allison, Justin Hawkins, Jamelia and Geneva."]}, {"page": "The Wildhearts Must Be Destroyed", "response": ["* Justin Hawkins - backing vocals on \"Only Love\" and \"Get Your Groove On\""]}, {"page": "This Town Ain't Big Enough for Both of Us", "response": ["* British Whale (recording alias of The Darkness singer/songwriter Justin Hawkins) released a version as his debut single in August 2005, which peaked at number six on the UK Singles Chart."]}, {"page": "Justin (name)", "response": ["*Justin Hawkins, frontman for the English glam rock band The Darkness"]}, {"page": "Paul Crook", "response": ["2009 was a very busy year. After a tour of Europe with Marya Roxx, Crook jumped back in the studio with Meat Loaf. This time Rob Cavallo was called in to produce. They began recording on June 1 in Calabasas, California. Many stellar musicians were brought in to create the massive sound. Sharing guitar duties alongside Crook were Brian May, Steve Vai, Justin Hawkins, Randy Flowers and Tim Pierce."]}, {"page": "Priory Group", "response": ["*Justin Hawkins, singer"]}, {"page": "List of heavy metal guitarists", "response": ["*Justin Hawkins (The Darkness, Hot Leg)"]}, {"page": "England(song)", "response": ["#REDIRECT Justin Hawkins"]}, {"page": "Girlfriend (The Darkness song)", "response": ["Category:Songs written by Justin Hawkins"]}]}}