{"wiki_id": "http://www.wikidata.org/entity/Q5524153", "itemLabel": "Garry Hunter", "itemDescription": "English footballer (born 1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/Garry_Hunter", "wikipedia_page": {"main": "Garry Paul Hunter (born 1 January 1985) is a former English professional footballer. The majority of Hunter's career was spent with Morecambe, with whom he played over 300 times in all competitions. He also had a season at Barrow.\nHunter spent the first nine years of his career with Morecambe after joining from the club's academy, making his Conference debut on 23 August 2003 when he was a second-half substitute for Garry Thompson in Morecambe's 3–2 win at home to Dagenham & Redbridge. He was a member of the Morecambe side that won promotion to the Football League in 2007, playing as a substitute in the play-off final victory over Exeter City.Hunter remained with Morecambe as they entered the Football League and made his league debut on 11 August 2007 in the goalless draw at home to Barnet.", "link_mentions": [{"page": "2007 Conference National play-off Final", "response": ["|FW ||8 ||Garry Hunter || || "]}, {"page": "Lancaster and Morecambe College", "response": ["*Garry Hunter"]}, {"page": "2010–11 Stevenage F.C. season", "response": ["Following two successive away victories, Stevenage hosted Wycombe Wanderers at the beginning of October. The game ended 2–0 to Wycombe, both of the visitors goals coming in the first-half. Stevenage drew 1–1 with Rotherham United a week later at the Don Valley Stadium. Rotherham took the lead against the run of the play just before half-time, Nicky Law finding the net on the counterattack. After the interval, Stevenage pressed for an equaliser, and restored parity with just eight minutes left; John Mousinho scoring his first goal for the club after David Bridges had seen his initial shot saved. A week later, Stevenage entertained Burton Albion at Broadhall Way, with the score ending 2–1 to the hosts, Stevenage's first home win since August. Stevenage had the chance to take the lead early on after referee Trevor Kettle decided that Chris Holroyd had been pushed in the area by Burton defender Nathan Stanton. Holroyd subsequently missed the resulting penalty kick. Stevenage were awarded another penalty ten minutes before the interval, this time Lawrie Wilson was the player to be fouled. Regular penalty taker Scott Laird stepped up and scored the resulting spot-kick. Shortly after the interval, Burton equalised; long-serving Aaron Webster arriving late into the box to finish neatly and restore parity. Ten minutes later, the home side were in front once again, Holroyd making amends for his penalty miss by scoring on the half-volley following good work down the right wing by Wilson. Substitute Luke Foster was sent-off with twenty minutes left, but Stevenage held on to take the three points. Stevenage then travelled to the Globe Arena to face Morecambe, a game that ended 0–0. Scott Laird saw his penalty saved for the visitors five minutes into the second half after Garry Hunter had handballed in the area. The Hertfordshire side then welcomed league leaders Chesterfield to Broadhall Way for the club's last game of October. The game ended 0–0, Stevenage's second consecutive goalless draw."]}, {"page": "2010–11 Morecambe F.C. season", "response": ["|align=\"left\"| Garry Hunter"]}, {"page": "2011–12 Morecambe F.C. season", "response": ["|14 ||MF || ||8 ||Garry Hunter || 1 || 0 || 0 || 0 || 1", "|8 || ||MF ||Garry Hunter || 4 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 4 || 0"]}]}}