{"wiki_id": "http://www.wikidata.org/entity/Q552162", "itemLabel": "Tim McInnerny", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_McInnerny", "wikipedia_page": {"main": "Tim McInnerny ( MAK-i-NUR-nee; born 18 September 1956) is an English actor. He is known for his many roles on stage and television, including as Lord Percy Percy and Captain Darling in the 1980s British sitcom Blackadder.", "link_mentions": [{"page": "Blackadder", "response": ["In series one, Edmund Blackadder is not particularly bright, and is much the intellectual inferior of his servant, Baldrick (played by Tony Robinson). However, in subsequent series the positions are reversed: Blackadder is clever, shrewd, scheming and manipulative while Baldrick is extremely dim. Each incarnation of Blackadder and Baldrick is also saddled with tolerating the presence of a dimwitted aristocrat. In the first two series this is Lord Percy Percy, played by Tim McInnerny. Hugh Laurie plays the role in the third and fourth series, as Prince George, Prince Regent and Lieutenant George, respectively.", "As well as Rowan Atkinson and Tony Robinson in their usual roles, this series starred Hugh Laurie as the Prince Regent, and Helen Atkinson-Wood as Mrs. Miggins. The series features Dr. Samuel Johnson (Robbie Coltrane); William Pitt the Younger (Simon Osborne); the French Revolution (with Chris Barrie, Tim McInnerny as the Scarlet Pimpernel, and Nigel Planer); hammy theatrical actors (Kenneth Connor and Hugh Paddick); a squirrel-hating cross-dressing highwayman (Miranda Richardson); and a duel with the Duke of Wellington (Stephen Fry).", "This series is set in 1917, on the Western Front in the trenches of the First World War. Another \"big push\" is planned, and Captain Blackadder's one goal is to avoid being killed, but his schemes always land him back in the trenches. Blackadder is joined by his batman Private S. Baldrick (Tony Robinson) and idealistic Edwardian twit Lieutenant George (Hugh Laurie). General Melchett (Stephen Fry) rallies his troops from a French château  from the front, where he is aided and abetted by his assistant, Captain Kevin Darling (Tim McInnerny), pencil-pusher supreme and Blackadder's nemesis, whose name is played on for maximum comedic value.", "Blackadder: Back & Forth was originally shown in the Millennium Dome in 2000, followed by a screening on Sky One in the same year (and later on BBC1). It is set on the turn of the millennium, and features Lord Blackadder placing a bet with his friends – modern versions of Queenie (Miranda Richardson), Melchett (Stephen Fry), George (Hugh Laurie) and Darling (Tim McInnerny) – that he has built a working time machine. While this is intended as a clever con trick, the machine surprisingly works, sending Blackadder and Baldrick back to the Cretaceous period, where they manage to cause the extinction of the dinosaurs through the use of Baldrick's best-worst-and-only pair of underpants as a weapon against a hungry T. Rex. Finding that Baldrick has forgotten to write dates on the machine's dials, the rest of the film follows their attempts to find their way back to 1999, often creating huge historical anomalies in the process that must be corrected before the end. The film includes cameo appearances from Kate Moss and Colin Firth.", "| align=left|Tim McInnerny", "*Tim McInnerny played Lord Percy Percy, Blackadder's dimwitted sidekick in series one and two before a change of character to antagonistic rival Captain Kevin Darling in series four. He also appeared as The Scarlet Pimpernel (alias Lord Topper and Le Comte de Frou Frou) for one episode in the third series, and reprised his role as Darling in Blackadder: Back & Forth.", "In January 2005, Tony Robinson told ITV's This Morning that Rowan Atkinson was more keen than he has been in the past to do a fifth series, set in the 1960s (centred on a rock band called the \"Black Adder Five\", with Baldrick – a.k.a. 'Bald Rick' – as the drummer). In the documentary Blackadder Rides Again, Robinson stated that the series would present Blackadder as the bastard son of Queen Elizabeth II and running a Beatles-like rock band. Rowan Atkinson, Tony Robinson, Hugh Laurie, Stephen Fry, Tim McInnerny and Miranda Richardson would have reprised their roles, and reportedly, Brian Blessed, Elspet Gray and Robert East would have returned from the first series to play Blackadder's biological family. Robinson in a stage performance 1 June 2007, again mentioned this idea, but in the context of a movie.", "At the end of Blackadder Rides Again, Robinson asked Tim McInnerny if he would do another series and he responded \"no\", because he thought people would not want to see them as they are now and would rather remember them for how they were. In the same documentary, Rowan Atkinson voiced his similar view; 'Times past; that's what they were!' However, Miranda Richardson and Tony Robinson expressed enthusiasm towards the idea of a series set in the Wild West, whilst John Lloyd favoured an idea for a series with a Neanderthal Blackadder. Lastly, Stephen Fry suggested a series set in a prisoner of war camp during World War II, but later remarked that \"perhaps it's best to leave these things as a memory.\""]}, {"page": "Claudius", "response": ["** A radio adaptation of the Graves novels by Robin Brooks and directed by Jonquil Panting, was broadcast in six one-hour episodes on BBC Radio 4 beginning 4 December 2010. The cast featured Tom Goodman-Hill as Claudius, Derek Jacobi as Augustus, Harriet Walter as Livia, Tim McInnerny as Tiberius and Samuel Barnett as Caligula."]}, {"page": "Cheshire", "response": ["Actors from Cheshire include Russ Abbot, Warren Brown, Julia Chan, Ray Coulthard, Daniel Craig, Tim Curry, Wendy Hiller, Tom Hughes, Tim McInnerny, Ben Miller, Pete Postlethwaite, Adam Rickitt,The Independent (Adam Rickitt - True Blue Hunk)  John Steiner, and Ann Todd. The most famous author from the county is Lewis Carroll, who wrote Alice's Adventures in Wonderland and named the Cheshire Cat character after it. Other notable Cheshire writers include Hall Caine, Alan Garner, and Elizabeth Gaskell. Artists from Cheshire include ceramic artist Emma Bossons and sculptor/photographer Andy Goldsworthy.Stonard, John Paul (10 December 2000). \"Goldsworthy, Andy\". Grove Art Online. Retrieved on 15 May 2007."]}, {"page": "1956", "response": ["* September 18 – Tim McInnerny, English actor"]}, {"page": "British sitcom", "response": ["The alternative comedy genre continued with Blackadder (1983–89), mainly written by Ben Elton and Richard Curtis and starring Rowan Atkinson, Tony Robinson, Tim McInnerny, Miranda Richardson, and Stephen Fry and Hugh Laurie. Atkinson's  Edmund Blackadder came at No.3 in the Channel 4 list of 100 greatest TV characters. Other high-ratings mainstream, slice-of-life shows of the decade  included Bread (1986–1991) written by Carla Lane (The Liver Birds, (1969–1979), Butterflies (1978 to 1983). Bread is  about a close-knit, working-class family in Liverpool. Running for 74 episodes, at its peak it attracted 21 million viewers.,"]}, {"page": "Helen Atkinson-Wood", "response": ["She studied fine art at the Ruskin School, Oxford University, where she performed with Rowan Atkinson (no relation). She also performed at the Edinburgh Festival Fringe, where she met Ben Elton. Whilst at Oxford, she took part in an OUDS production of Richard II. Also in this production was Tim McInnerny, who played the lead. She later appeared together with McInnerny in an episode of Blackadder the Third."]}, {"page": "Robert Cecil, 1st Earl of Salisbury", "response": ["* He is portrayed by Tim McInnerny in the 2004 TV mini series Gunpowder, Treason & Plot."]}, {"page": "King Solomon's Mines", "response": ["A two-part BBC Radio 4 adaptation was broadcast in April 2017 starring Tim McInnerny as Allan Quatermain."]}, {"page": "The Scarlet Pimpernel", "response": ["*In the third series of Blackadder, Blackadder the Third, the episode \"Nob and Nobility\" revolves around Blackadder's disgust with the English nobility's fascination for the Pimpernel. Tim McInnerny reprises a version of his \"Sir Percy\" character from the previous two series, who is the alter-ego of the Pimpernel."]}, {"page": "Airey Neave", "response": ["Neave was portrayed by Geoffrey Pounsett in Nuremberg (2000), Dermot Crowley in Margaret (2009), Nicholas Farrell in The Iron Lady (2011) and Tim McInnerny in Utopia (2014)."]}, {"page": "Edmund Blackadder", "response": ["Each Blackadder is also surrounded by various other figures who reappear over the series. These include his manservant Baldrick (Tony Robinson) and the various imbecilic aristocrats with whose company he is lumbered, such as Lord Percy Percy (Tim McInnerny) and George (Hugh Laurie)."]}, {"page": "The Rocky Horror Show", "response": ["The Rocky Horror Show has toured the United Kingdom regularly since the 1990–91 West End revival at the Piccadilly Theatre in productions produced by Richard O'Brien's and Howard Panter's Rocky Horror Company. Notable celebrities have been cast including Daniel Abineri, Peter Blake, Tim McInnerny, Anthony Head, Robin Cousins, Jason Donovan and Jonathan Wilkes as Frank-N-Furter, Gina Bellman as Janet Weiss, Edward Tudor-Pole as Riff Raff and TV's Craig Ferguson and Adrian Edmonson as Brad Majors."]}, {"page": "2000 in film", "response": ["| 102 Dalmatians || Walt Disney Pictures || Kevin Lima (director); Kristen Buckley, Brian Regan, Bob Tzudiker, Noni White (screenplay); Glenn Close, Gérard Depardieu, Ioan Gruffudd, Alice Evans, Tim McInnerny, Eric Idle, Ben Crompton, Carol MacReady, Ian Richardson, Jim Carter, Ron Cook, David Horovitch, Timothy West, Mike Hayley, Kerry Shale, Hugh Futcher, Jack Angel, Bill Farmer, Patrick Pinney, Phil Proctor || Comedy, Family || Live action", "* 102 Dalmatians, directed by Kevin Lima, starring Glenn Close, Ioan Gruffudd, Alice Evans, Tim McInnerny, and Gérard Depardieu"]}, {"page": "1995 in film", "response": ["| Richard III || United Artists || Richard Loncraine (director/screenplay); Ian McKellen (screenplay); Ian McKellen, Annette Bening, Jim Broadbent, Robert Downey Jr., Kristin Scott Thomas, Maggie Smith, Adrian Dunbar, Dominic West, John Wood, Nigel Hawthorne, Edward Hardwicke, Tim McInnerny, Jim Carter, Tres Hanley, Roger Hammond, Donald Sumpter, Bill Paterson, Kate Steavenson-Payne, Christopher Bowen, Matthew Groom, Marco Williamson, Edward Jewesbury, Michael Elphick, Stacey Kent || Drama || Live action"]}, {"page": "1996 in film", "response": ["| 101 Dalmatians || Walt Disney Pictures / Great Oaks Entertainment || Stephen Herek (director); John Hughes (screenplay); Glenn Close, Jeff Daniels, Joely Richardson, Joan Plowright, Hugh Laurie, Mark Williams, John Shrapnel, Tim McInnerny, Hugh Fraser, Brian Capron || Comedy, Family || Live action"]}, {"page": "1999 in film", "response": ["| Notting Hill || Universal Pictures || Roger Michell (director); Richard Curtis (screenplay); Julia Roberts, Hugh Grant, Richard McCabe, Rhys Ifans, James Dreyfus, Dylan Moran, Hugh Bonneville, Emma Chambers, Tim McInnerny, Gina McKee, Henry Goodman, Julian Rhind-Tutt, Lorelei King, John Shrapnel, Clarke Peters, Arturo Venegas, Yolanda Vazquez, Mischa Barton, Emily Mortimer, Samuel West, Ann Beach, Alec Baldwin, Simon Callow, Joe Cornish, Matthew Modine || Romance, Comedy, Drama || Live action", "* Notting Hill, directed by Roger Michell, starring Julia Roberts, Hugh Grant, Tim McInnerny, Gina McKee, Hugh Bonneville and Rhys Ifans (U.K.)", "* Rogue Trader, starring Ewan McGregor, Anna Friel and Tim McInnerny (U.K.)"]}, {"page": "1989 in film", "response": ["| Erik the Viking || Orion Pictures || Terry Jones (director/screenplay); Tim Robbins, Mickey Rooney, Eartha Kitt, Terry Jones, Imogen Stubbs, John Cleese, Antony Sher, Charles McKeown, Tim McInnerny, John Gordon Sinclair, Richard Ridings, Freddie Jones, Samantha Bond, Jim Broadbent, Jim Carter, Neil Innes, Allan Surtees, Tsutomu Sekine, John Scott Martin, Simon Evans, Matthew Baker || Comedy, Fantasy || Live action"]}, {"page": "1985 in film", "response": ["| Wetherby || MGM/UA Classics || David Hare (director/screenplay); Vanessa Redgrave, Ian Holm, Judi Dench, Stuart Wilson, Tim McInnerny, Suzanna Hamilton, Tom Wilkinson, Marjorie Yates, Joely Richardson, Alan Rickman, Katy Behean, Robert Hines || Mystery, Drama || Live action"]}, {"page": "101 Dalmatians (1996 film)", "response": ["101 Dalmatians is a 1996 American adventure comedy film. The film is a live-action adaptation of Walt Disney’s 1961 animated film of almost the same name, itself an adaptation of Dodie Smith's 1956 novel The Hundred and One Dalmatians. Directed by Stephen Herek and co-produced by John Hughes and Ricardo Mestres, it stars Glenn Close,  Jeff Daniels, Joely Richardson, Joan Plowright, Hugh Laurie, Mark Williams, and Tim McInnerny. Unlike the 1961 film, none of the animals have speaking voices in this version.", "* Tim McInnerny as Alonzo"]}, {"page": "Notting Hill (film)", "response": ["Notting Hill is a 1999 romantic comedy film directed by Roger Michell. The screenplay was written by Richard Curtis, and the film was produced by Duncan Kenworthy. The film stars Julia Roberts and Hugh Grant with Rhys Ifans, Emma Chambers, Tim McInnerny, Gina McKee, and Hugh Bonneville in supporting roles. The story is of a romance between a London bookseller (Grant) and a famous American actress (Roberts) who happens to walk into his shop.", "* Tim McInnerny as Max"]}, {"page": "Richard III (1995 film)", "response": ["Ian McKellen portrays the titular Richard, as well as co-writing the screenplay with Loncraine. The cast also includes Annette Bening as Queen Elizabeth, Jim Broadbent as the Duke of Buckingham, Robert Downey Jr. as Rivers, Kristin Scott Thomas as Anne Neville, Nigel Hawthorne as the Duke of Clarence, Maggie Smith as the Duchess of York, John Wood as King Edward IV, Tim McInnerny as Sir William Catesby, and Dominic West as the Earl of Richmond (the latter's first feature film role).", "* Tim McInnerny as Sir William Catesby"]}, {"page": "Abdul Abulbul Amir", "response": ["In the 1980s Whitbread brewery adapted the song using their own lyrics for a series of commercials on British television, suggesting that the two protagonists were great fans of their Whitbread Best beer who squabbled over trivialities such as what type of glassware to drink it from, because they had forgotten that \"the best Best needs no etiquette\". The commercials starred Stephen Fry as Ivan, Tony Cosmo as Abdul, Tim McInnerny and Roy Castle, and were directed by Paul Weiland."]}, {"page": "Stroud", "response": ["*Tim McInnerny, actor (Blackadder), attended Marling School"]}, {"page": "She: A History of Adventure", "response": ["Tim McInnerny starred as Holly (renamed Ludwig Holly) with Mia Soteriou as Ayesha and Oliver Chris as Leo in a two-part adaptation on BBC Radio 4's Classic Serial, originally broadcast on 2 July and 9 July 2006."]}, {"page": "Duke of Northumberland", "response": ["*Lord Percy Percy, played by Tim McInnerny, is a major character in the first two series of the British sitcom Blackadder. In the first series, he is the Duke of Northumberland, while the Lord Percy in the second series is presumably his descendant and is heir to the dukedom. The first series was partly filmed at Alnwick Castle, the residence and seat of the real Dukes of Northumberland."]}, {"page": "Spooks (TV series)", "response": ["A feature-length film, Spooks: The Greater Good, known in the US as MI-5, was released in May 2015. Peter Firth reprises his role as Harry Pearce. Also returning from the TV series are Tim McInnerny as Oliver Mace, Lara Pulver as Erin Watts, Hugh Simon as Malcolm Wynn-Jones, and Geoffrey Streatfeild as Calum Reed.  Kit Harington and Jennifer Ehle star as new characters in leading roles.", "*Oliver Mace (Tim McInnerny; 2004–2006) Chairman of the Joint Intelligence Committee. Forced to resign after being exposed as the mastermind behind illegal torture of terror suspects.", "The programme was created by writer David Wolstencroft, and produced by Kudos for the BBC. A trademark style, coupled with the series' popularity, attracted a large number of high-profile guest stars. These included Martine McCutcheon, Hugh Laurie, Haluk Bilginer, Robert Hardy, Tim McInnerny, Bruce Payne, Reece Dinsdale, Ian McDiarmid, Ewen Bremner, Jimi Mistry, Andy Serkis, Benedict Cumberbatch, Kevin McNally, Rupert Graves, Andrew Tiernan, Anton Lesser, Anupam Kher, Alexander Siddig, and Anthony Head."]}, {"page": "Blackadder Goes Forth", "response": ["More than the Germans, who are generally unseen, Blackadder's nemeses come in the form of his superior, the eccentric General Melchett (Stephen Fry) who rallies his troops from a French château  from the front, and Melchett's bureaucratic assistant, Captain Kevin Darling (Tim McInnerny). Despite the two being of equal rank, Blackadder treats Darling with contempt—while the former is on the front line, the latter is \"folding the general's pyjamas\". Their animosity is mutual, largely as a result of Blackadder exploiting the comic potential of Darling's surname at every opportunity. Although Blackadder and Darling are both captains, Darling has seniority because he is a staff officer. This is signified by the red tabs on the collar of his uniform and the red band on his service cap.", "Rowan Atkinson and Tony Robinson reprised their roles as Edmund Blackadder and Baldrick respectively. Hugh Laurie also returned to play Lieutenant George. The fourth series enlarged the principal cast from the third series to include Stephen Fry as General Melchett and Tim McInnerny as Captain Kevin Darling, who had both appeared in guest roles in Blackadder the Third and had appeared regularly in Blackadder II. This cast appeared together in every episode of the fourth series, although the only episode to feature no guest appearances was \"Captain Cook\". Miranda Richardson, who had played Elizabeth I in the second series, appeared in a guest role in one episode (as she had in the third series). In their guest performances, actors such as Rik Mayall and Gabrielle Glaister reprised versions of characters they had played in earlier series. Other performers, such as Bill Wallis and Lee Cornes, who had played minor roles in prior series, appeared briefly again in the fourth series as well. Of the series, only Adrian Edmondson and Geoffrey Palmer portray fictitious takes on historical figures as Baron Manfred von Richthofen and Field Marshal Douglas Haig respectively."]}, {"page": "The Black Adder", "response": ["Using this premise, the series follows the fictitious reign of Richard IV (1485–98) through the experiences of Prince Edmund, who styles himself as \"The Black Adder\", and his two sidekicks: the imbecilic Lord Percy Percy, the Duke of Northumberland (Tim McInnerny); and Baldrick (Tony Robinson), a more intelligent servant of no status.", "| Percy, Duke of Northumberland || colspan=\"2\" style=\"text-align:center;\" |  Tim McInnerny "]}, {"page": "Blackadder II", "response": ["The series is set during the Elizabethan era (1558–1603). The principal character, Edmund, Lord Blackadder (Rowan Atkinson), is the great-great-grandson of the original Black Adder, and is now a member of the London aristocracy. Unlike his forefather, he is both dashing and intelligent, although he is still scheming and cynical in his outlook. The series follows his attempts to win the favour of the childish Queen Elizabeth I (Miranda Richardson). As before, he is aided, and often hindered, by two less-than-intelligent sidekicks, his servant Baldrick (Tony Robinson), and Lord Percy Percy (Tim McInnerny), heir to the Duchy of Northumberland, with whom Blackadder has a grudging friendship.", "* Tim McInnerny as Lord Percy Percy, Heir to the Duchy of Northumberland"]}, {"page": "Blackadder the Third", "response": ["Although this series reduced the size of the show's cast, the programme featured guest appearances in each episode. Tim McInnerny decided not to continue playing the character of Lord Percy for fear of being typecast, although he appeared in a guest role in episode three.Trivia at IMDb.com. Retrieved 3 June 2007 Stephen Fry and Miranda Richardson, who had played major parts in Blackadder II, also appeared in guest roles. Fry and McInnerny would return as regular performers for the fourth series of Blackadder."]}, {"page": "Blackadder: Back & Forth", "response": ["In a 1999 interview, Richard Curtis described it as \"an irreverent trek through British history – a time travel adventure story consisting entirely of people who are either rude or stupid.\" Rowan Atkinson and Tony Robinson reprised their roles as the series' core characters Blackadder and Baldrick, respectively. In an interview, Atkinson stated that making a Blackadder film had always been an ambition.Blackadder back to the future, BBC News, 13 September 1999 Joining Atkinson and Robinson are other main cast members from the last three series, Stephen Fry, Hugh Laurie, Tim McInnerny and Miranda Richardson.Cast & Crew at the Internet Movie Database, URL accessed 20 April 2008", "At Blackadder Hall in 1999, Lord Blackadder (Rowan Atkinson) is entertaining four guests on New Year's Eve. He informs them he has built a time machine using plans drawn by Leonardo da Vinci and wagers £10,000 each that he can bring back any item from history they request. Archbishop Melchett (Stephen Fry), Archdeacon Kevin Darling (Tim McInnerny), Major George (Hugh Laurie), and Lady Elizabeth (Miranda Richardson) agree to this and challenge him to bring back a Roman centurion's helmet, wellingtons worn by the Duke of Wellington on the day of the Battle of Waterloo, and an ancient pair of 200-year-old underpants. The whole voyage is actually a scam, as Blackadder has, in fact, had Baldrick (Tony Robinson) retrieve the items from his storage, and the time machine is a prop. Blackadder stages the time machine travelling through time for his guests, with himself and Baldrick hiding inside, but when he opens the door he finds it has actually worked.", "* Tim McInnerny as Archdeacon Darling, Duke of Darling and Duc de Darling"]}, {"page": "Doctor Who (film)", "response": ["Casting sessions took place in March 1994; actors who actually auditioned for the role include Liam Cunningham, Mark McGann, Robert Lindsay, Tim McInnerny, Nathaniel Parker, Peter Woodward, John Sessions, Anthony Head, and Tony Slattery. Paul McGann was first considered around the time of these auditions, but did not formally audition for the part until later.", "*Tim McInnerny guest-starred in the Series 4 episode \"Planet of the Ood\" as Klineman Halpen."]}, {"page": "Cheadle Hulme", "response": ["Actors and actresses from the area include Tim McInnerny, best known for his roles in Blackadder as Lord Percy and Captain Darling, and Kirsten Cassidy, best known for playing Tanya Young in Grange Hill. Other notable people from the area include: blues musician John Mayall;John Mayall’s teenage obsessions: ‘I lived in a tree house until I got married, The Guardian, 29 January 2021 mathematician Patrick du Val; violinist Jennifer Pike; poet Julian Turner; John Davenport Siddeley, a captain of the automobile industry; James Kirk (VC); Dame Felicity Peake, founder of the Women's Royal Air Force; and Stuart Pilkington, a housemate in Big Brother 2008."]}, {"page": "Toby Stephens", "response": ["Also in May 2008, Stock-pot Productions announced that Stephens will have the lead role in a feature-length film entitled Fly Me, co-starring Tim McInnerny.Stock-pot Productions Limited, Blog, 27 May 2008  Stock-pot was the producer of One Day, a short 2006 film shown at international film festivals, in which Stephens played a small part as the boss of McInnerny's character."]}, {"page": "Edge of Darkness", "response": ["Several other faces familiar to British viewers appeared during the course of the episodes, including John Woodvine (as Craven's superior DCS Ross), Tim McInnerny (as Emma's boyfriend Terry Shields), Hugh Fraser (as IIF chief executive Robert Bennett), Zoë Wanamaker (as intelligence agent Clementine) and Blake's 7 cast members David Jackson (as Colonel Lawson) and Brian Croucher (as Northmoor security chief Connors). Playing themselves were television reporters Sue Cook and Kenneth Kendall, weatherman Bill Giles and Labour MP Michael Meacher. Allan Cuthbertson as Chilwell of the Investigation Committee. Long-standing BBC visual effects designer Mat Irvine, who contributed visual effects to the series, received a brief cameo as a police diver in \"Breakthrough\"."]}, {"page": "Howard Barker", "response": ["There has been a small flurry of productions of Barker's plays on the London Fringe since 2007, including some non-Wrestling school productions which seem to fare better critically. Notable among these have been Victory and Scenes from An Execution received acclaimed productions at the Arcola and the Hackney Empire respectively. In 2012 the National Theatre staged a production of Scenes from an Execution, starring Fiona Shaw and Tim McInnerny."]}, {"page": "Robert Aickman", "response": ["In August 2019 BBC Radio 4 Extra broadcast five of Aickman's short stories as part of its Short Works series. \"Just a Song at Twilight\", \"Le Miroir\", \"Raising the Wind\", \"The Coffin House\" and \"The Fully-Conducted Tour\" were read by Tim McInnerny."]}, {"page": "Royal Exchange, Manchester", "response": ["Lorraine Ashbourne, Brenda Blethyn, Tom Courtenay, Amanda Donohoe, Gabrielle Drake, Lindsay Duncan, Ray Fearon, Michael Feast, Robert Glenister, Derek Griffiths, Dilys Hamlett, Julie Hesmondhalgh, Claire Higgins, Paterson Joseph, Cush Jumbo, Ben Keaton, Robert Lindsay, Ian McDiarmid, Tim McInnerny, Janet McTeer, Patrick O'Kane, Daragh O'Malley Trevor Peacock, Maxine Peake, Pete Postlethwaite, Linus Roache, David Schofield, Andy Serkis, Michael Sheen, Andrew Sheridan, David Threlfall and Don Warrington."]}, {"page": "The Line of Beauty", "response": ["In 2006, a three-part television adaptation was broadcast by the BBC and later released on DVD throughout the world. Dan Stevens plays Nick Guest with Oliver Coleman in the role of Toby Fedden. Alice Krige plays Toby's mother, while Tim McInnerny plays Toby's father."]}, {"page": "List of Blackadder characters", "response": ["Lord Percy Percy (Tim McInnerny) is the name given to a pair of related characters. The Lord Percy of Blackadder II is the descendant of that seen in The Black Adder. The character derives his name from the factual Percy family. Unlike the first two Blackadders and Baldricks, the two Lord Percys are almost identical; both are portrayed as dim-witted, gullible and foppish. In the first series, Percy is Duke of Northumberland, while in the second he is heir to the title. The title of Duke of Northumberland was not in fact held by a real person surnamed Percy until 1766, when Hugh Percy, born Hugh Smithson, was awarded the title, although the title of the Earl of Northumberland was granted to a Percy in 1377.", "Introduced in its fourth iteration, Blackadder Goes Forth, Captain Kevin Darling (Tim McInnerny) is main character Captain Edmund Blackadder (Rowan Atkinson)'s intellectual peer and bitter rival (just like Melchett was in season 2); while Blackadder reluctantly serves in World War I trenches, Darling is safely stationed some distance from the front line. Darling is the sycophantic adjutant to Stephen Fry's General Melchett. The character was originally conceived as \"Captain Cartwright\"; writers Ben Elton and Richard Curtis were simply unable to think of a more amusing name for him. Eventually however, Stephen Fry suggested \"Darling\" would be a more comedic alternative; the series makes use of a recurring joke where his name is used or referred to for comedic effect.Hunt, James (2018). 12 things you might not know about Blackadder Goes Forth. Mental Floss UK. Retrieved 19 Sept. 2019. http://mentalfloss.com/article/91058/facts-about-blackadder-goes-forth-rowan-atkinson ", "*Le Comte de Frou Frou (Tim McInnerny) – an apparently foppish, disgruntled, homesick French aristocrat in Blackadder the Third. The character was forced to flee his home country for England, in order to escape the French Revolution. He was later revealed to be a disguise adopted by Prince George's friend Lord Topper, alias one half of the Scarlet Pimpernel.", "*Lord Topper (Tim McInnerny) – An extremely irritating friend of Prince George, he is offered the chance to go and rescue a French aristocrat by Blackadder but he refuses. He then disguises himself as Le Comte de Frou Frou and is 'rescued' by Blackadder and Baldrick. After being captured by an evil revolutionary (Chris Barrie) and escaping, he reveals himself to be Topper and, coincidentally, one half of the Scarlet Pimpernel, the other half being his friend, Lord Smedley, who had already been killed by a suicide pill given to him by Blackadder. When he is about to tell George the truth about his 'rescue', he is also killed the same way as Smedley, Blackadder slipping a suicide pill into his wine. (\"Nob and Nobility\")"]}, {"page": "The Farm (British band)", "response": ["In 2018, Carl Hunter directed the feature film Sometimes Always Never, which was written by Frank Cottrell Boyce and starred Bill Nighy, Sam Riley, Alice Lowe, Jenny Agutter and Tim McInnerny. This film received a 4 star review in The Guardian and even though the soundtrack featured music by Edwyn Collins and Sean Read rather than The Farm, the film was produced by members of group."]}, {"page": "Royal Anglian Regiment", "response": ["In 1989, the Band and fifty members of the old 3rd Battalion were featured in the opening and closing sequences of BBC historical sitcom Blackadder Goes Forth with the band, men and actors Rowan Atkinson, Hugh Laurie, Stephen Fry, Tony Robinson and Tim McInnerny dressed in World War I period uniforms marching to \"The British Grenadiers\" and the Blackadder theme song. It was shot on location at the former Colchester Cavalry Barracks."]}, {"page": "102 Dalmatians", "response": ["102 Dalmatians is a 2000 American crime comedy film directed by Kevin Lima in his live-action directorial debut and produced by Edward S. Feldman and Walt Disney Pictures. The sequel to the 1996 film 101 Dalmatians, a live-action remake of the 1961 Disney animated film of the same name, it stars Glenn Close reprising her role as Cruella de Vil as she attempts to steal puppies for her \"grandest\" fur coat yet. Close and Tim McInnerny were the only two actors from the first film to return for the sequel. The film received generally negative reviews from critics but was a massive financial success, and the film was also nominated for the Academy Award for Best Costume Design.", "* Tim McInnerny as Alonzo"]}, {"page": "Marling School", "response": ["* Tim McInnerny - Actor"]}, {"page": "What the Butler Saw (play)", "response": ["* Tim McInnerny – Dr Prentice"]}, {"page": "The Miracle Maker (1999 film)", "response": ["* Tim McInnerny as Barabbas"]}]}}