{"wiki_id": "http://www.wikidata.org/entity/Q5525474", "itemLabel": "Gary Liddle", "itemDescription": "English association football player (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gary_Liddle", "wikipedia_page": {"main": "Gary Daniel Liddle (born 15 June 1986) is an English professional footballer who plays as a centre-back or midfielder for EFL League Two club Hartlepool United. He has played in the English Football League for Hartlepool United, Notts County, Bradford City, Chesterfield, Carlisle United and Walsall.", "link_mentions": [{"page": "Notts County F.C.", "response": ["|2013 ||  Gary Liddle"]}, {"page": "Hartlepool United F.C.", "response": ["|align=\"left\"|Gary Liddle"]}, {"page": "Chris Turner (footballer, born 1958)", "response": ["In February 2006, Turner returned to Hartlepool United in the newly-created position of Director of Sport, with Paul Stephenson working as caretaker-manager; Turner's role left him to administer \"the club's overseas participation in football tournaments, pre-season planning, conferences and Football League issues\". On 15 December 2008, Turner took over as caretaker-manager at Hartlepool following the departure of Danny Wilson, in addition to his Director of Sport role at the club. He then led Hartlepool to a 19th-place finish in League One at the end of the 2008–09 season, two places and one point above the relegation zone. Speaking in January 2010, Turner responded to criticism from supporters by saying that \"people have to realise to get into the top six is very difficult for the majority of clubs in this division\". Pools ended the 2009–10 campaign above the relegation zone on goal difference after being deducted three points for fielding an ineligible player as Gary Liddle played against Brighton & Hove Albion when he should have served a suspension. On 19 August 2010, Turner resigned from his position at Hartlepool. He had previously stated his frustration at what he said was a lack of funds to sign players. Over the summer he had released eight players, but was only able to make four new signings. His successor, Mick Wadsworth, took the club to a 16th-place finish at the end of the 2010–11 season."]}, {"page": "Gavin Strachan", "response": ["In the 2006/07 season, Strachan saw limited selection by new Pools boss Danny Wilson after the signings of Gary Liddle and Willie Boland. He consequently signed for Peterborough United initially on loan in January 2007, before making the move permanent just two days before the close of the January transfer window."]}, {"page": "List of Bradford City A.F.C. players", "response": ["|Gary Liddle||||2014–2016||61||3||"]}, {"page": "Middlesbrough F.C. Reserves and Academy", "response": ["| rowspan=\"3\" | 2002 ||  Gary Liddle || Centre Back"]}, {"page": "Ched Evans", "response": ["He scored on his debut for Chesterfield on 23 July, his first game in nearly four years, in a 3–0 pre-season friendly win over Ilkeston. He also scored, with a free-kick from , on his return to professional football, in a 1–1 away draw with Oxford United, on 6 August 2016. In his home debut for Chesterfield, on 13 August 2016 against Swindon Town, Evans produced a match-winning performance, scoring Chesterfield's third goal and having a hand in the other two from Gary Liddle and Jay O'Shea as they won 3–1."]}, {"page": "Liddle", "response": ["* Gary Liddle, footballer currently playing for Chesterfield"]}]}}