{"wiki_id": "http://www.wikidata.org/entity/Q552010", "itemLabel": "Granville Bantock", "itemDescription": "British composer and conductor (1868-1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/Granville_Bantock", "wikipedia_page": {"main": "Sir Granville Ransome Bantock (7 August 1868 – 16 October 1946) was a British composer of classical music.", "link_mentions": [{"page": "Edward Elgar", "response": ["Elgar was knighted at Buckingham Palace on 5 July 1904.\"Birthday Honours\", The Times, 24 June 1904, p. 12 The following month, he and his family moved to Plâs Gwyn,\"Elgar Court, once known as Plas Gwyn\" , Geograph. Retrieved 29 October 2010 a large house on the outskirts of Hereford, overlooking the River Wye, where they lived until 1911. Between 1902 and 1914, Elgar was, in Kennedy's words, at the zenith of popularity. He made four visits to the US, including one conducting tour, and earned considerable fees from the performance of his music. Between 1905 and 1908, he held the post of Peyton Professor of Music at the University of Birmingham. He had accepted the post reluctantly, feeling that a composer should not head a school of music.Moore (1984), p. 446 He was not at ease in the role,Reed, p. 92 and his lectures caused controversy, with his attacks on the criticsReed, p. 89 and on English music in general: \"Vulgarity in the course of time may be refined. Vulgarity often goes with inventiveness ... but the commonplace mind can never be anything but commonplace. An Englishman will take you into a large room, beautifully proportioned, and will point out to you that it is white – all over white – and somebody will say, 'What exquisite taste'. You know in your own mind, in your own soul, that it is not taste at all, that it is the want of taste, that is mere evasion. English music is white, and evades everything.\" He regretted the controversy and was glad to hand on the post to his friend Granville Bantock in 1908.Reed, p. 97 His new life as a celebrity was a mixed blessing to the highly strung Elgar, as it interrupted his privacy, and he often was in ill-health. He complained to Jaeger in 1903, \"My life is one continual giving up of little things which I love.\"Kennedy (1987a), p. 144 Both W. S. Gilbert and Thomas Hardy sought to collaborate with Elgar in this decade. Elgar refused, but would have collaborated with George Bernard Shaw had Shaw been willing.Anderson, pp. 115–16"]}, {"page": "Hebrides", "response": ["* The Hebrides, also known as Fingal's Cave, is a famous overture composed by Felix Mendelssohn while residing on these islands, while Granville Bantock composed the Hebridean Symphony."]}, {"page": "Kubla Khan", "response": ["Excerpts from the poem have been put to music by Samuel Coleridge-Taylor, Granville Bantock, Humphrey Searle, and Paul Turok; and Charles Tomlinson Griffes composed an orchestral tone poem in 1912 (revised 1916)."]}, {"page": "Rubaiyat of Omar Khayyam", "response": ["* The British composer Granville Bantock produced a choral setting of FitzGerald's translation 1906–1909."]}, {"page": "Jean Sibelius", "response": ["Sibelius exerted considerable influence on symphonic composers and musical life, at least in English-speaking and Nordic countries. The Finnish symphonist Leevi Madetoja was a pupil of Sibelius (for more on their relationship, see Relationship with Sibelius). In Britain, Ralph Vaughan Williams and Arnold Bax both dedicated their fifth symphonies to Sibelius. Furthermore, Tapiola is prominently echoed in both Bax's Sixth Symphony and Ernest John Moeran's Symphony in G minor. The influence of Sibelius's compositional procedures is also strongly felt in the First Symphony of William Walton. When these and several other major British symphonic essays were being written in and around the 1930s, Sibelius's music was very much in vogue, with conductors like Thomas Beecham and John Barbirolli championing its cause both in the concert hall and on record. Walton's composer friend Constant Lambert even asserted that Sibelius was \"the first great composer since Beethoven whose mind thinks naturally in terms of symphonic form\". Earlier, Granville Bantock had championed Sibelius (the esteem was mutual: Sibelius dedicated his Third Symphony to the English composer, and in 1946 he became the first President of the Bantock Society). More recently, Sibelius was also one of the composers championed by Robert Simpson. Malcolm Arnold acknowledged his influence, and Arthur Butterworth also saw Sibelius's music as a source of inspiration in his work."]}, {"page": "Pierrot", "response": ["In the England of the Aesthetic Movement, Pierrot figured prominently in the drawings of Aubrey Beardsley; various writers—Henry Austin Dobson, Arthur Symons, Olive Custance—seized upon him for their poetry (\"After Watteau\" [1893],  Poem first published in December 1893 number of Harper's Magazine. \"Pierrot in Half-Mourning\" [1896], \"Pierrot\" [1897], respectively); and Ernest Dowson wrote the verse-play Pierrot of the Minute (1897, illustrated by Beardsley). (The American poet William Theodore Peters, who commissioned Dowson's piece and would play Pierrot in its premiere,. published a poetic \"Epilogue\" for it in 1896, and the composer Sir Granville Bantock would later contribute an orchestral prologue [1908].) One of the gadflies of Aestheticism, W. S. Gilbert, introduced Harlequin and Pierrot as love-struck twin brothers into Eyes and No Eyes, or The Art of Seeing (1875), for which Thomas German Reed wrote the music. And he ensured that neither character, contrary to many an Aesthetic Pierrot, would be amorously disappointed."]}, {"page": "Pomp and Circumstance Marches", "response": ["March No. 2 was composed in 1901 and dedicated \"To my friend Granville Bantock\"."]}, {"page": "City of Birmingham Symphony Orchestra", "response": ["From 1916 onwards, a group of influential local figures began to pursue the idea of a single, permanent, municipally funded orchestra, in keeping with the Civic Gospel tradition established in Birmingham under Joseph Chamberlain, that envisaged cities as having responsibility as a body for their citizens' civic, social and cultural welfare. Leading members of this campaign included Neville Chamberlain, who was Lord Mayor of Birmingham from 1916 to 1918; Granville Bantock, composer and Professor of Music at the University of Birmingham; and Ernest Newman, a leading Birmingham-based music critic, who had written as early as 1913 that the system of financial guarantees from wealthy patrons that had supported Birmingham's orchestras through the 19th century had become discredited. The group's first plan was to support Beecham's New Birmingham Orchestra, but this enterprise was wound up after the government requisitioned the Town Hall for the issue of First World War ration books, depriving it of its primary concert venue. A few weeks after the end of the war Bantock revived the idea  and on 17 March 1919 he submitted a proposal to Birmingham City Council for an orchestra of 70 musicians to be engaged annually from October to May, at an estimated annual cost of £8,500 and with projected annual revenue of £6,000. The city council agreed to support the proposal with an annual grant of £1,250 for an experimental period of five years, the first time that public funds had been used to support an orchestra anywhere in Great Britain.", "Matthews' plan was to hold eight Saturday concerts and six Wednesday concerts each year at Birmingham Town Hall, with a series of 38 concerts of more popular programmes at cheaper venues on Sundays, continuing the tradition of Sunday popular classics established by his own orchestra over the previous five years. The orchestra first rehearsed at 9.30am on 4 September 1920, in the band room at the Birmingham City Police's Steelhouse Lane station. The CBO's first concert was given under Matthews' baton as part of the Sunday series at the Theatre Royal on 5 September 1920, with the first piece of music performed being Granville Bantock's Saul. After two months of preparing the orchestra with the popular concerts, the inaugural concert of the Symphony Concerts series was given at the Town Hall on 10 November 1920, with Edward Elgar conducting a concert of his own works, including his Cello Concerto with Felix Salmond as the soloist. The first season continued with a remarkable series of programmes, including Ralph Vaughan Williams conducting his own London Symphony, Hamilton Harty conducting Berlioz's Symphonie fantastique, Adrian Boult conducting Rachmaninov's Second Symphony, Landon Ronald conducting Brahms' Second Symphony and Jean Sibelius conducting his own Third Symphony. Two features that would become longstanding traditions for the orchestra were also established during this first year: performances of then-recent works by Holst, Vaughan Williams and Bax saw a strong representation of new music in the orchestra's programmes; and from February 1921 the orchestra's commitment to musical education was underlined with a series of concerts for city schoolchildren held in the Town Hall on Saturday afternoons."]}, {"page": "Havergal Brian", "response": ["Around the time he started at All Saints', he was influenced by hearing King Olaf, a composition for soloists, choir and orchestra by Edward Elgar. Now one of the composer's lesser-known works, King Olaf was commissioned for the North Staffordshire Music Festival of 1896, where it was well received. Brian sent a sample composition to Elgar who gave him encouragement. Brian became a fervent enthusiast of the new music being produced by Richard Strauss and the British composers of the day. Through attending music festivals he began a lifelong friendship with composer Granville Bantock (1868–1946).", "Brian's musical influence was limited by the fact that so little of his music was performed or recorded until after his death, by which time his stylistic idiom could be considered anachronistic. Nonetheless, he was held in high regard by composers such as Robert Simpson and some of his contemporaries, such as Granville Bantock. His music has generally been championed by a small number of enthusiasts rather than enjoying a more general popularity, and continues to divide opinion. To Mark Morris, writing in his Guide to Twentieth Century Composers, in the Gothic Symphony Brian achieved \"one of the world's artistic masterpieces, in vision, grandeur, and in the combination of complexity and luminosity worthy to stand alongside the great cathedrals of the age that inspired it... [it] is arguably, more than any other late-Romantic work, the climax of the Romantic age.\". Writing in The Spectator in 2016, Damian Thompson claimed that if Brian's thirtieth symphony were premiered today as the work of a 25-year-old composer, it \"might even be hailed as the triumphant reinvention of tonality\"."]}, {"page": "1946 in music", "response": ["*October 16 – Sir Granville Bantock, composer, 78"]}, {"page": "1928 in music", "response": ["*Granville Bantock – Pagan Symphony"]}, {"page": "1940 in music", "response": ["*Granville Bantock – Celtic Symphony"]}, {"page": "1920 in music", "response": ["*September 4 – City of Birmingham Orchestra (England) first rehearses (in a city police bandroom). Later this month, its first concert, conducted by Appleby Matthews, opens with Granville Bantock's overture Saul; in November it gives its \"First Symphony Concert\" when Edward Elgar conducts a programme of his own music in Birmingham Town Hall.", "*Granville Bantock – Arabian Nights"]}, {"page": "1912 in music", "response": ["*Granville Bantock – In the Far West, serenade for string orchestra"]}, {"page": "1894 in music", "response": ["* Granville Bantock – The Pearl of Iran"]}, {"page": "1893 in music", "response": ["*Granville Bantock – Caedmar"]}, {"page": "String orchestra", "response": ["*Granville Bantock: Celtic Symphony for string orchestra and six harps"]}, {"page": "Pictures at an Exhibition", "response": ["Many other orchestrations and arrangements of Pictures have been made. Most show debts to Ravel; the original piano composition is, of course, frequently performed and recorded. A version for chamber orchestra exists, made by Taiwanese composer Chao Ching-Wen. Elgar Howarth arranged it for the Philip Jones Brass Ensemble in 1977, subsequently recasting it for Grimethorpe Colliery Band. Kazuhito Yamashita wrote an adaptation for solo classical guitar. Excerpts have also been recorded, including a 78 rpm disc of \"The Old Castle\" and \"Catacombs\" orchestrated by Sir Granville Bantock, and a spectacular version of \"The Great Gate of Kiev\" was scored by Douglas Gamley for full symphony orchestra, male voice choir and organ. The Amadeus Orchestra (UK) commissioned ten composers to orchestrate one movement each to make a version first performed complete in 2012. Movements were provided by Alastair King, Roger May, Tolib Shakhidi, David Butterworth, Philip Mackenzie, Simon Whiteside, Daryl Griffiths, Natalia Villanueva, James McWilliam and Julian Kershaw."]}, {"page": "1868 in music", "response": ["* August 7 – Granville Bantock, composer (d. 1946)"]}, {"page": "Master of the Queen's Music", "response": ["After Parratt's death in 1924, there was a body of opinion that the position of Master was an anachronism, with neither a royal band to direct nor regular royal odes to compose. Elgar, who was well regarded by the royal family, pressed the case for retaining the post. According to the music writer Nicholas Kenyon, he also \"lobbied shamelessly\" for his own candidacy for it. Other names, including that of Ralph Vaughan Williams had been suggested, but George V and his advisers took the view that \"if the post is to go to the most eminent musician it would hardly be possible to go beyond Elgar.\" Elgar's appointment was announced in May 1924; The Times commented, \"it is entirely fitting that in the changed condition of the office he should be made Master of the King's Musick and the Musician Laureate of the British people.\"\"Master of the King's Musick\", The Times, 5 May 1924, p. 16 Elgar was not required to write any official music in his new capacity, but in 1931 he dedicated his Nursery Suite to the Duchess of York and her two daughters. He used his influence as Master to track down the original instruments of Edward VII's band, to ensure the royal music library was well ordered, and to secure recognition for other musicians, including a knighthood for Granville Bantock and the Companion of Honour for Delius. As musical aide to the king he gave advice about such topics as the foundation of a national opera company, the correct version of the national anthem to be broadcast by the BBC, and the musical events at which members of the royal family should be present."]}, {"page": "University of Birmingham", "response": ["From 1905 to 1908, Edward Elgar held the position of Peyton Professor of Music at the university. He was succeeded by his friend Granville Bantock.Keith Anderton, slevenotes, Bantock: Hebridean Symphony, Naxos 8.555473, 1989.", "Physicists include John Henry Poynting, Freeman Dyson, Sir Otto Frisch, Sir Rudolf Peierls, Sir Marcus Oliphant, Sir Leonard Huxley, Harry Boot, Sir John Randall, and Edwin Ernest Salpeter. Chemists include Sir William A. Tilden. Mathematicians include Jonathan Bennett, Henry Daniels, Daniela Kühn, Deryk Osthus, Daniel Pedoe and G. N. Watson. In music, faculty members include the composers Sir Edward Elgar and Sir Granville Bantock. Geologists include Charles Lapworth, Frederick Shotton, and Sir Alwyn Williams. In medicine, faculty members include Sir Melville Arnott and Sir Bertram Windle."]}, {"page": "Julian Lloyd Webber", "response": ["* Granville Bantock – Sapphic Poem (1999)"]}, {"page": "Salome", "response": ["Because at the time British law forbade the depiction of biblical characters on stage, Wilde wrote the play originally in French, and then produced an English translation (titled Salome). To this Granville Bantock composed incidental music, which was premiered at the Court Theatre, London, on 19 April 1918."]}, {"page": "George Grove", "response": ["Grove's Crystal Palace programme notes did not concentrate solely on his favourite Austro-German composers. He embraced a representative selection of composers, notably the Frenchmen Berlioz, Bizet, Delibes, Gounod, Massenet and Saint-Saëns, and the rising generations of British composers – Arthur Sullivan, Hubert Parry, Charles Villiers Stanford, Hamish MacCunn, Edward German and Granville Bantock."]}, {"page": "British brass band", "response": ["* Granville Bantock: Prometheus Unbound"]}, {"page": "Peter Dawson (bass-baritone)", "response": ["However, it was in British song that Dawson was especially famous, and his career helped to preserve the concert recital, and many of the older ballad type of songs, at a time when other forms of popular music were displacing the Victorian standards. He was particularly successful with the heartier, rollicking type of song, such as Off to Philadelphia, The Old Superb and Up from Somerset. He sang a good deal of the output of Stanford and Arthur Somervell, a few Sullivan vocal warhorses, and a select range of items by contemporary composers such as Percy French, Peter Warlock, Liza Lehmann, Granville Bantock, Eric Coates, Roger Quilter, Thomas Dunhill, Edward German, George Butterworth, Gustav Holst, Landon Ronald, Michael Head, Frank Bridge, Arnold Bax."]}, {"page": "Harborne", "response": ["* Granville Bantock (composer)"]}, {"page": "Barnt Green", "response": ["*Granville Bantock, composer, spent the last two years of his life in Barnt Green, and his grandson Gavin Bantock was born there."]}, {"page": "Sir Granville Bantock", "response": ["#redirect Granville Bantock"]}, {"page": "List of solo cello pieces", "response": ["*Granville Bantock"]}, {"page": "Symphony No. 1 (Brian)", "response": ["The genesis of the work stems from many sources, but several may be mentioned briefly: a conversation Brian had with Henry Wood about writing a suite that would revive the older instruments which had fallen out of use in the modern symphony orchestra, such as the oboe d'amore or basset horn. This idea was repudiated by Brian's close friend Granville Bantock, but returned when Brian turned to writing symphonies after the end of the First World War. The Gothic element refers to the vision of the Gothic age (from about 1150 to 1500) as representing a huge (almost unlimited) expansion in humanity's artistic and intellectual development, but particularly manifest in the architecture of the great European cathedrals. The scale of the choral finale, which took several years to write, appears to be an attempt to evoke the scale and detail of this architecture in sound; Brian had to paste blank pages of score together to be able to write the work on gigantic sheets with 54 staves to the page.Havergal Brian, 'How the \"Gothic\" Symphony came to be written', Modern Mystic, December 1938.  Brian also seems to have identified with the character of Faust, particularly in attempting to write such affirmative music in the post-war atmosphere when many composers had turned from pre-war giganticism, and the finale bears an apposite quote from Goethe's Faust Part Two Act V, which translates as \"The man who ever strives may earn redemption\". Brian dedicated the work to Richard Strauss, who in a letter of acknowledgement described it as \"grossartig\" (magnificent).Letter reproduced in programme booklet for the Royal Albert Hall performance on 30 November 1966."]}, {"page": "BBC Symphony Chorus", "response": ["By 1928, the BBC had decided there was a need to develop a large amateur chorus of its own. Notices advertising the formation of The National Chorus were placed, auditions were held, a broadcast was delivered in August 1928 discussing the new choir and its upcoming programme, and the choir gave its first performance later that year in Granville Bantock's oratorio The Pilgrim's Progress.BBC Genome, November 23, 1928, 2LO London and 5XX Daventry, 20.00: B.B.C. Symphony Concert, Part I: The Pilgrim's Progress: First appearance of the newly reconstituted National Chorus Stanford Robinson, already on the BBC's staff, was appointed Conductor. A condition  of singing in the new choir was that the new member must already be a member of an existing choir.BBC Genome, August 30, 1928, 2LO London, 19.00: The National Chorus: the new organization and its first season's workThe Radio Times synopsis of the 1928 broadcast on the National Chorus, the new organisation and its first season's work reads as follows:"]}, {"page": "Viola sonata", "response": ["*Granville Bantock"]}, {"page": "New Brighton, Merseyside", "response": ["thumb|right|Granville Bantock, conductor at the New Brighton Tower Ballroom", "Musically, New Brighton first came to national prominence when Granville Bantock, later to be knighted as one of Britain's most prolific composers, took over leadership of the New Brighton Tower concert band. Instead of continuing with the usual populist programme of dances and marches, Bantock set about transforming it into a professional orchestra. Unusually for the time, the orchestra performed modern classical music and would champion contemporary composers, even daringly devoting entire programmes to an individual composer's music. In return, many leading lights of contemporary British music, including Stanford, Parry, Corder, Mackenzie and Elgar, came to New Brighton to conduct and perform, and the New Brighton orchestra became nationally respected for the remaining period of Bantock's tenure."]}, {"page": "William Henry Harris", "response": ["Harris was organist at St Augustine's Church, Edgbaston from 1911 to 1919 and concurrently assistant organist at Lichfield Cathedral. During this time he also taught at the Royal Birmingham Conservatoire in collaboration with Granville Bantock. A move to Oxford in 1919 saw him take up organist positions successively at New College and in 1929 Christ Church, Oxford. While at Oxford, he conducted the Oxford Bach Choir (1925-1933) and was instrumental in founding and conducting the Opera Club, which put on the pioneering production of Monteverdi's Orfeo staged by Jack Westrup in 1925.Cooke, Mervyn. 'Harris, Sir William Henry', in Oxford Dictionary of National Biography In 1933 he was appointed organist at St George's Chapel, Windsor in succession to Charles Hylton Stewart.Henderson, John and Jarvis, Trevor. Sir William Henry Harris, Organist, Choir Trainer and Composer, RSCM Press, 2018 There, he was at his most productive: composing for the Three Choirs Festival, conducting at both the 1937 and 1953 coronations, and producing two orchestral pieces premiered at The Proms: the overture Once Upon a Time (1940) and the Heroic Prelude (1942).BBC Proms Archive"]}, {"page": "Landmark Trust", "response": ["|Built in 1863 as an intermediate stop on the Ffestiniog Railway for the railway's Superintendent.  Later used as a holiday home by Sir Granville Bantock. Renovated following a joint appeal with the railway.  Opened for lets April 2018.  Retains a private platform to the railway as its main access."]}, {"page": "List of Romantic composers", "response": ["| Granville Bantock || 1868 || 1946 || British || composer"]}, {"page": "List of compositions for cello and orchestra", "response": ["*Granville Bantock", "*Sir Granville Bantock"]}, {"page": "List of compositions for cello and piano", "response": ["*Granville Bantock"]}]}}