{"wiki_id": "http://www.wikidata.org/entity/Q5525760", "itemLabel": "Gary Plumley", "itemDescription": "professional footballer (born 1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gary_Plumley", "wikipedia_page": {"main": "Gary Plumley (born 24 March 1956) is an English former professional footballer who played in the Football League for Newport County, Hereford United and Cardiff City, and in the Hong Kong First Division League for Happy Valley.A goalkeeper, Plumley made 187 appearances for Newport County in four spells with the club between 1976 and 1987. He was part of the team that won the Welsh Cup and were promoted to the Third Division in the 1979–80 season, and in the subsequent season reached the quarter-final of the 1981 European Cup Winners Cup, holding eventual runners-up Carl Zeiss Jena to a draw in the away leg before losing 1–0 at home.Plumley also played for Hereford United, Cardiff City, Happy Valley and Ebbw Vale.Plumley's father Eddie was chief executive of Watford, a family connection which led to him making a one-off appearance in the 1987 FA Cup semi-final. Watford goalkeeper Tony Coton broke a finger two weeks before the game leaving manager Graham Taylor needing to find cover for Steve Sherwood after the transfer deadline. In desperation, Taylor suggested to Eddie Plumley that they sign his son, who had by then retired from football. Plumley signed, Sherwood dislocated a finger, so Plumley played; Tottenham Hotspur won the match 4–1. No fee had been agreed at the time but Graham Taylor wanted to pay Plumley. A few weeks later he received a cheque and went straight out and bought a fridge with it. They called it the Watford fridge.\nPlumley became an estate agent in Newport. He is married to Debbie Johnsey, who represented Great Britain at show jumping at the 1976 Montreal Olympics. Their daughter Gemma Plumley is also an accomplished show jumper.", "link_mentions": [{"page": "Newport County A.F.C.", "response": ["The Newport County squad for the first leg was: 1 Gary Plumley, 2 Richard Walden, 3 John Relish, 4 Grant Davies, 5 Keith Oakes (Captain), 6 Tommy Tynan, 7 Nigel Vaughan, 8 Steve Lowndes, 9 Dave Gwyther, 10 Karl Elsey, 11 Kevin Moore, 12 Neil Bailey, 13 Steve Warriner, 14 Dave Bruton, 15 Bobby Ward, 16 Mark Kendall."]}, {"page": "1987 FA Cup Final", "response": ["In the semi-final, played in April 1987 at the neutral venue of Villa Park in Birmingham, Tottenham faced Graham Taylor's Watford. Despite playing into the wind in the first half, Tottenham dominated the game from the start. They took the lead after 11 minutes when Steve Hodge followed up a long-range Allen shot, which Watford goalkeeper Gary Plumley had failed to hold. Two minutes later, Plumley was beaten again when John McClelland deflected another Allen shot into his own goal. Watford began to create more chances as Tottenham eased off, forcing Clemence to make two difficult saves in succession. But the Londoners reasserted control 10 minutes before half-time as Paul Allen retrieved a cleared corner, beat two defenders and fired a left-footed shot past Plumley. Claesen replaced the injured Allen on 75 minutes, helping to set up Tottenham's fourth goal with his first touch. Claesen's pass reached Ossie Ardiles, who in turn passed to Waddle, whose lay-off was finished by Hodge. Watford then scored a late consolation goal through Malcolm Allen, giving a final score of 4–1 to Tottenham."]}, {"page": "Ebbw Vale F.C.", "response": ["*  Gary Plumley"]}, {"page": "Isle of Wight International Jazz Festival", "response": ["Annie Whitehead, Jacqui Dankworth, Rob Koral, Esther Miller, Andrea Vicari, Taeko Kunishima, Rachael Moore, and Gary Plumley"]}, {"page": "1979–80 Newport County A.F.C. season", "response": ["|GK ||1 || Gary Plumley", "|GK ||1 || Gary Plumley"]}, {"page": "List of Newport County A.F.C. players", "response": ["| Gary Plumley||2 Apr 2015||1976–1982, 1984–1985, 1987||187||0||", "*  Gary Plumley"]}, {"page": "1980 Welsh Cup Final", "response": ["|GK ||1 || Gary Plumley", "|GK ||1 || Gary Plumley"]}, {"page": "Plumley (surname)", "response": ["* Gary Plumley (* 1956), British footballer"]}, {"page": "Plumley, Gary", "response": ["#redirectGary Plumley"]}]}}