{"wiki_id": "http://www.wikidata.org/entity/Q5522875", "itemLabel": "Gareth J. Dyke", "itemDescription": "Irish paleontologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Gareth_J._Dyke", "wikipedia_page": {"main": "Gareth John Dyke is a paleontologist whose work is concerned with the evolutionary history of birds and their dinosaurian relatives. His specific research interests include the phylogenetics of birds, the functional morphology of aves and non-avian dinosaurs, and the palaeoenvironments of fossil vertebrates.\n\n", "link_mentions": [{"page": "Paleornithology", "response": ["Paleornithology, also known as avian paleontology, is the scientific study of bird evolution and fossil birds. It is a hybrid of ornithology and paleontology. Paleornithology began with the discovery of Archaeopteryx. The reptilian relationship of birds and their ancestors, the theropod dinosaurs, are important aspects of paleornithological research. Other areas of interest to paleornithologists are the early sea-birds Ichthyornis, Hesperornis, and others. Notable paleornithologists are Storrs L. Olson, Alexander Wetmore, Alan Feduccia, Cécile Mourer-Chauviré, Philip Ashmole, Pierce Brodkorb, Trevor H. Worthy, Zhou Zhonghe, Yevgeny Kurochkin, Bradley C. Livezey, Gareth J. Dyke, Luis M. Chiappe, Gerald Mayr and David Steadman."]}, {"page": "Thalassodromeus", "response": ["In 2015 palaeontologists Gerald Grellet Tinner and Vlad A. Codrea named a new species, T. sebesensis, based on what they interpreted as part of a cranial crest in a concretion found near the Sebeș River in Romania. The authors said that this would extend the range in time and space for the genus Thalassodromeus considerably, creating a 42-million-year gap between the older South American species and the younger European species. Palaeontologist Gareth J. Dyke and a large team of colleagues immediately rejected the pterosaurian identification of the T. sebesensis fossil, instead arguing that it was a misidentified part of a plastron (lower shell) of the prehistoric turtle Kallokibotion bajazidi (named in 1923). The idea that the fragment belonged to a turtle had been considered and rejected by Grellet-Tinnera and Codrea in their original description. Grellet-Tinnera and Codrea denied the turtle identity suggested by Dyke and colleagues, noting that those researchers had not directly examined the fossil."]}, {"page": "2000 in paleontology", "response": ["Gareth J. Dyke", "Gareth J. Dyke"]}, {"page": "2001 in paleontology", "response": ["Gareth J. Dyke", "Gareth J. Dyke"]}, {"page": "2007 in paleontology", "response": ["Gareth J. Dyke", "Gareth J. Dyke", "Gareth J. Dyke"]}, {"page": "2008 in paleontology", "response": ["Gareth J. Dyke"]}, {"page": "Eostrix", "response": ["* E. tsaganica described in 2011 by Evgeny Kurochkin and Gareth J. Dyke, found in Mongolia."]}, {"page": "Gareth Dyke", "response": ["#redirectGareth J. Dyke"]}, {"page": "List of paleontologists", "response": ["* Gareth J. Dyke (Ireland)"]}, {"page": "2013 in archosaur paleontology", "response": ["Gareth J. Dyke"]}, {"page": "Evgeny Kurochkin", "response": ["He graduated from the Moscow State University in 1964. Most of his field work was done in Central Asia, Mongolia, Cuba, and Vietnam. In 1982, Kurochkin described Ambiortus, which he thought to be the oldest ornithurine (modern-type bird). Kurochkin named the new species after his peer Georgi Petrovich Dementyev (1898-1969). In 2011, Kurochkin and Gareth J. Dyke described Eostrix tsaganica found in Mongolia, the first find of this primitive owl in Asia.Kurochkin, E. N., & Dyke, G. J. (2011). The first fossil owls (Aves: Strigiformes) from the Paleogene of Asia and a review of the fossil record of Strigiformes. Paleontological Journal, 45(4), 445–458. doi:10.1134/s003103011104006x"]}, {"page": "2011 in archosaur paleontology", "response": ["Gareth J. Dyke", "Gareth J. Dyke"]}, {"page": "2010 in archosaur paleontology", "response": ["Gareth J. Dyke", "Gareth J. Dyke", "Gareth J. Dyke"]}, {"page": "2009 in archosaur paleontology", "response": ["Gareth J. Dyke", "Gareth J. Dyke", "Gareth J. Dyke", "Gareth J. Dyke"]}, {"page": "Historical Biology", "response": ["Historical Biology is a peer-reviewed scientific journal of paleobiology. It was established in 1988, and is published by Taylor & Francis. The journal is edited by Gareth J. Dyke (National Oceanography Centre)."]}]}}