{"wiki_id": "http://www.wikidata.org/entity/Q5524849", "itemLabel": "Gary Clark", "itemDescription": "Scottish musician, songwriter and record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Gary_Clark_(musician)", "wikipedia_page": {"main": "Gary Clark (born 10 March 1962, Dundee, Scotland) is a Scottish musician, songwriter and record producer. As a performer he is best known as the frontman of 1980s pop band Danny Wilson and mid-1990s rock band King L (as well as for being a member of Transister). Since the mid-1990s he has concentrated on songwriting and production.", "link_mentions": [{"page": "Transister", "response": ["Transister's formation was the culmination of various collaborations between songwriter Eric Pressly, former Danny Wilson frontman Gary Clark, and vocalist Keely Hawkes.  Hawkes first made use of Pressly's songwriting on her 1993 solo debut for EMI, while Pressly and Clark first worked together in the band King L, releasing album Great Day for Gravity in 1995.  The three were encouraged by the results of their early songwriting attempts, and decided to release a six-song EP on their own record label."]}, {"page": "1962 in music", "response": ["*March 10 – Gary Clark (musician), Scottish singer-songwriter, music producer (The Veronicas, Delta Goodrem, Reece Mastin, Gin Wigmore) "]}, {"page": "List of singer-songwriters", "response": ["*Gary Clark"]}, {"page": "Natalie Imbruglia", "response": ["In late-2008, in the second year of work on her eventual 2009 album Come to Life, Imbruglia parted with her label, Brightside/Sony BMG. She obtained the rights to songs recorded for the album and planned to record on her own label, Malabar Records. Songs were co-written with Ben Hillier, Dave McCracken, her then-husband Daniel Johns, Gary Clark, Jamie Hartman, Paul Harris, Shep Solomon and Chris Martin of Coldplay. Some tracks were produced by Hillier and mixed by Danton Supple."]}, {"page": "Gareth Gates", "response": ["In 2006, Gates appeared in a television documentary for ITV1 called Whatever Happened To Gareth Gates?, which dealt with his experiences in the music industry and his life outside it. The documentary was screened in December 2006, and confirmed a new record deal with UMTV (part of Universal) and a new album as well as showcasing snippets of the new material. An early preview of his new album was given at a secret gig on 29 November 2006. GPG News Gates had been working with writers such as Sacha Skarbek (who has worked with James Blunt), Ricky Ross (of Deacon Blue), Gary Clark and Pete Gordeno, and new the album was produced by Martin Terefe, Jon Hall and Nick Whitecross."]}, {"page": "PRS for Music", "response": ["In July 2015, PRS for Music launched a pro-creator campaign called Streamfair. The campaign focused on four areas, Copyright Legislation, Online Licensing, Promoting the value of music creators and education. The campaign was supported by acclaimed songwriters and composers including Jimmy Napes, Michael Price, Crispin Hunt, Gary Clark and Debbie Wiseman."]}, {"page": "List of band name etymologies", "response": ["* Danny Wilson — Chosen at the last minute after problems with their initial band name Spencer Tracy due to issues with the dead actor's estate, who threatened to sue their record label Virgin Records if they went ahead and released their debut album in the states under that name. Instead the brothers in the band Gary Clark and Kit Clark chose the titular character from the film Meet Danny Wilson as that was played by Frank Sinatra who was a favourite artist of their father."]}, {"page": "White Lilies Island", "response": ["* Gary Clark – keyboards, guitar, backing vocals"]}, {"page": "Counting Down the Days", "response": ["Counting Down the Days is the third studio album by Australian singer Natalie Imbruglia. It was released by Brightside Recordings on 4 April 2005 in the United Kingdom. Her debut with the label, Imbruglia reteamed with Gary Clark to work on her next project, but also consulted a wider range of producers to collaborate with her, including Eg White, Martin Harrington, Ben Hillier, Ash Howes, Daniel Johns, David Kosten, Stephen Lipson, Paul Mac, and Ian Stanley.", "* Gary Clark – production, engineering, guitar & strings (track 11), initial production (track 7)"]}, {"page": "Danny Wilson (band)", "response": ["The band served as a launchpad for the career of Gary Clark, who also played in the 1990s bands King L and Transister before becoming a successful songwriter for other artists including Natalie Imbruglia, Liz Phair, Nick Carter, k.d. lang and former Spice Girls Melanie C and Emma Bunton. Other former members of the band have played in Simple Minds, Deacon Blue and Swiss Family Orbison.", "Gary Clark and Ged Grimes grew up together in Dundee, Scotland and played together in school bands. Influenced by soul and pop artists such as Steely Dan, Stevie Wonder and Bacharach and David, they eventually moved to London, where they played in the bands Perfect Strangers and Dream Kitchen during the early 1980s. Neither band met with success: circa 1984, while still in London, Clark and Grimes noticed that talent scouts and journalists were beginning to follow the soul and pop scenes in Scottish cities. Returning to Dundee, they teamed up with Gary Clark's younger brother Kit Clark to form a new band called Spencer Tracy (after the film star of the same name).", "Initially spotted by music journalist Bob Flynn, during a very sparsely attended gig in Edinburgh and after a glowing review piece by Flynn in Melody Maker which attracted much attention from record labels, Spencer Tracy signed to Virgin Records in 1986. After objections from the estate of the actor Spencer Tracy, the band was obliged to change its name. Gary Clark recalls this as \"a real last-minute crazy, fearful moment... The album was done, the artwork was done... We were just told, 'If you try and use this, you will be sued.' And so the label just went 'Nope. Change it. Now.'\" For their new name, the band chose Danny Wilson, taken from a 1952 Frank Sinatra film called Meet Danny Wilson (itself a favourite film of the Clark brothers' father).", "The band's debut album Meet Danny Wilson, written entirely by Gary Clark, was released in 1987. An acclaimed mix of sophisti-pop with elements of soul, jazz and bossa nova, it included an appearance by Lester Bowie's Brass Fantasy among others.", "The band released its second album, Bebop Moptop the following year. Gary Clark was no longer the band's only songwriter, as Ged Grimes and Kit Clark co-wrote \"I Can't Wait\" and Kit also contributed \"N.Y.C Shanty\", both of which Kit sang on the record. The first single released from the album was \"Never Gonna Be the Same\", but this was overshadowed by its successor, the hit single \"The Second Summer of Love\", which reached number 23 in the British charts. As initially written it was barely more than a minute long, so when Virgin Records picked the song for single release the band extended it via a long harmonica solo.", "Three more singles were released from Bebop Moptop – \"If Everything You Said Was True\", the slow ballad \"If You Really Love Me (Let Me Go)\", and \"I Can't Wait\", but in spite of Virgin Records' promotional efforts, none of them were hits. Gary Clark has subsequently suggested that this was simply down to airplay problems: \"Virgin were really great at that time, and, y'know, we didn't really fit what was on the radio at any time. We kind of got lucky with \"Mary's Prayer\", in the sense that it just happened to fit, whereas the records were pretty eclectic. And Virgin, even though they loved the band and loved the stuff, they obviously had trouble at radio. It didn't fit with what was going on.\"", "By the time the band began to demo the third Danny Wilson album in 1991, all three members had written more songs than would fit onto the album, leading to arguments and frustration. Kit Clark attempted to solve the situation by persuading Virgin Records to let him record a solo album, but was rebuffed; following this, he decided to leave the band. Deciding that Danny Wilson would be too much reduced without Kit's contribution (\"he was kind of a really good force just in terms of ideas and the flavour of things\"), Gary Clark opted to break up the band, maintaining its creative integrity and the friendships between all members before both were spoiled.", "Following the relative commercial failure of Ten Short Songs About Love, Gary Clark abandoned solo work to form first the rock band King L (with American bass player Eric Pressly and former Bible guitarist Neill Maccoll) and then the pop band Transister (with Pressly and lead singer Keeley Hawkes). Clark then stepped down from performing to turn his attention to writing and producing for other artists. In 2001, he worked on Natalie Imbruglia's second album, White Lilies Island, and co-wrote most of the album's songs with her, including the single \"Wrong Impression\". He continued to collaborate with her until 2009.", "Gary Clark has also worked as a songwriter or producer for Liz Phair, Nick Carter, Ashley Parker Angel, k.d. lang, Ferras, The Wanted, Demi Lovato, Delta Goodrem and Spice Girls Melanie C and Emma Bunton. Following spells living in London, France and Los Angeles, he has recently returned to live in Dundee. In 2016, Clark composed the score for the Irish film Sing Street and either wrote or co-wrote all of the original songs featured in the film.", "On 30 October 1993, Gary Clark and former Bible frontman Boo Hewerdine (who were friends and songwriting collaborators) played a full-length concert at London's Queen Elizabeth Hall, sharing the stage throughout while alternating songs written by one or the other or by both together. Both Ged Grimes and Kit Clark played in the five-piece concert band, which played a number of a number of Danny Wilson songs. In effect, this was a version of Danny Wilson fronted by both Clark and Hewerdine, although the evening was billed very much as friends playing together rather than a formal reunion.", "The Danny Wilson trio would not reunite on stage for another twenty-one years. In mid-2014 (around the time Gary Clark returned to live in Dundee following many years of being based in London or Los Angeles), the band briefly and secretly reformed to play a short set at a friend's wedding in Dundee. Clark announced afterwards that there were no plans to extend the reunion and that it had taken place as a favour.", "* Gary Clark – vocals, guitars, keyboards, harmonica"]}, {"page": "Narcotic Thrust", "response": ["The band's third single in 2005, called \"When the Dawn Breaks\", featured Gary Clark (vocalist from the Scottish band Danny Wilson) on vocals. In 2006, Narcotic Thrust released their fourth single, \"Waiting for You\" again featuring the vocals of Yvonne John Lewis.", "* 2005 \"When the Dawn Breaks\" (with Gary Clark) - UK No. 28"]}, {"page": "Critics' Choice Movie Award for Best Song", "response": ["| Written by Gary Clark; Performed by Ferdia Walsh-Peelo"]}, {"page": "Fake Chemical State", "response": ["#\"Purple\" (Gary Clark, Skin) – 3:42"]}, {"page": "The Bible (band)", "response": ["In 1994, The Bible reformed (with the lineup of Hewerdine, Shepherd, Larcombe, Lendor and Neill MacColl) for recordings and a tour. The band released the Dreamlife EP in 1994. Tracks for a new album were recorded, including several songs co-written with former Danny Wilson frontman Gary Clark, a songwriting collaborator of Hewerdine's.", "Unfortunately, the band's new record deal failed and The Bible split up again before they could complete and release the album. MacColl went on to team up with Gary Clark in the band King L, who released one album (Great Day For Gravity) in 1995, featuring several more Clark/Hewerdine co-writes including \"Greedy\" and \"Last Cigarette\". Versions of both of the latter songs (plus the original title track from the Dreamlife EP and a version of the unreleased Bible song \"Junk\") surfaced on Hewerdine's 1996 solo album Baptist Hospital, which featured several appearances by MacColl (who also guested on the live dates)."]}, {"page": "Introduction (Alex Parks album)", "response": ["Introduction is Alex Parks' debut album, released on 24 November 2003. Recorded and released within only two weeks of Parks winning the BBC's Fame Academy, it included seven original compositions, mostly co-written with  songwriters Helen Boulding, Gary Clark and Boo Hewerdine, as well as six cover songs from John Lennon, Tears for Fears, R.E.M., Christina Aguilera, Eurythmics and Coldplay.", "#\"Cry\" - 3:49 (Parks, Gary Clark, Boo Hewerdine) "]}, {"page": "Beauty on the Fire", "response": ["Category:Songs written by Gary Clark (musician)"]}, {"page": "Wrong Impression", "response": ["\"Wrong Impression\" is a song by Australian singer-songwriter Natalie Imbruglia. The song was written by Imbruglia and Gary Clark and was released as the second single from Imbruglia's second studio album, White Lilies Island, on 11 January 2002. The single reached the top 10 on both the UK and New Zealand singles charts and found moderate success in Australia, the United States, and Europe.", "Category:Songs written by Gary Clark (musician)"]}, {"page": "Soundtrack to Your Life (album)", "response": ["#\"Perfect Now\" (Written By: A.Parker, K.Karlin, A.Cantrall, Gary Clark, E.Pressly, K.Hawkes)"]}, {"page": "Lift (Shannon Noll album)", "response": ["# \"Give It Away\" (Shannon Noll/Peter Gordeno/Gary Clark)  – 3:47"]}, {"page": "Purple (Skin song)", "response": ["Category:Songs written by Gary Clark (musician)"]}, {"page": "Mind How You Go (Skye Edwards album)", "response": ["# \"Love Show\" (Skye Edwards, Gary Clark) – 4:03", "# \"Powerful\" (Edwards, Gary Clark) – 4:43"]}, {"page": "Meet Danny Wilson", "response": ["All tracks composed by Gary Clark", "*Gary Clark", "The recording of \"A Girl I Used to Know\" on the CD version is very different to the vinyl version. According to Gary Clark,  the reason for the re-recording was that the band members weren't very happy with the original performance. This dissatisfaction, coupled with the record company looking for big singles from the album, meant the band felt compelled to try and capture the song again. The CD version was produced by Glen Skinner, while the vinyl version was produced by Dave Bascombe, who also produced the song \"Mary's Prayer\" from the same album."]}, {"page": "Bebop Moptop", "response": ["All tracks composed by Gary Clark; except where indicated", "# \"Desert Hearts\" (Gary Clark, Ali Thomson)", "*Gary Clark"]}, {"page": "What Are You Waiting For? (Krezip album)", "response": ["| 3. || \"Don't Crush Me\" || (Jacqueline Govaert, Gary Clark) || 3.46"]}, {"page": "Duncan of Jordanstone College of Art & Design", "response": ["* Gary Clark"]}, {"page": "Cry (Alex Parks song)", "response": ["Category:Songs written by Gary Clark (musician)"]}, {"page": "Ferras", "response": ["In April 2008, Ferras released his major record label debut with Aliens & Rainbows via Capitol Records. The album was produced by The Matrix and Gary Clark. The album features the lead single \"Hollywood's Not America,\" which was used as the \"exit song\" during the semi-final round of the seventh season of the American reality series American Idol before being replaced by a single from Ruben Studdard. The choice gave Ferras a moderate amount of exposure and publicity for the song, which peaked at No. 62 on the Billboard Hot 100. He also performed the song during his first national television performance on The Today Show.", "The year 2010 was also a big year for his songwriting. He co-wrote the song \"Aftermath\" for Adam Lambert's debut CD For Your Entertainment. In late September 2010, the song was a #1 single in Finland. In June 2010, Australian singer Michael Paynter released the song \"Love the Fall\" featuring The Veronicas which was co-written by Ferras and Gary Clark. It became the most added song to Australian radio in the first week of July and was the first top-20 single on the ARIA chart for Paynter, and was later certified Platinum.", "|The Matrix / Gary Clark", "|The Matrix / Gary Clark", "|The Matrix / Gary Clark"]}, {"page": "Michael Paynter", "response": ["The first single, \"Closer\", was described as \"a soaring, hook-filled track about striving for better\". Paynter wrote \"Closer\" in collaboration with Gary Clark, and said that he fell in love with the song instantly. He said that \"it works because the chords and rhythms are so simple. It's how people are, in their heads, never where they want to be whether it's a relationship or in a career. They're always wanting to be closer to the ideal.\" For the album, Paynter underwent a global four-month writing session, during which he also worked with Wally Gagel, Phil Buckle and Julian Hamilton of The Presets. The album's second single, \"A Victim Song\", was released on 15 November 2008 in Australia."]}, {"page": "Gary Clark (Songwriter/ Producer)", "response": ["#REDIRECT Gary Clark (musician)"]}, {"page": "Now or Never (Nick Carter album)", "response": ["*Gary Clark – bass, engineer, guitar, keyboards, mixing, Pro Tools, producer, programming, vocals (background)"]}, {"page": "Closer (Michael Paynter song)", "response": ["Category:Songs written by Gary Clark (musician)"]}, {"page": "Here We Go Again (Demi Lovato album)", "response": ["Here We Go Again is the second studio album by American singer Demi Lovato. It was released on July 21, 2009, through Hollywood Records. Unlike their previous album, Don't Forget (2008), Lovato did not collaborate with the Jonas Brothers, as they wanted to work with different people and give the album a personal approach. Lovato collaborated for the album with established songwriters and producers, such as E. Kidd Bogart, Gary Clark, Toby Gad, John Mayer, Jon McLaughlin, Lindy Robbins and John Fields, who produced their previous album Don't Forget.", "Unlike their first studio album, Don't Forget, Lovato did not collaborate with the Jonas Brothers on Here We Go Again as they wanted to see what their sound would be like without their input. \"They were the only people I'd ever written with. Once I wrote with different people, I wanted to go with that\", they told the New York Daily News. They said that their first album was \"very Jonas\" and that Here We Go Again is \"a little bit more like what's coming from my heart. It's more me.\" However, Lovato did work with Nick Jonas on the song \"Stop the World\". The majority of the album was produced by John Fields, who also handled production on Don't Forget. Other tracks were produced by SuperSpy, Gary Clark, Andy Dodd and Adam Watts. \"Catch Me\" is the only song on the album for which Lovato received sole writing credit. In an interview with The New York Times, they revealed that they wrote it in their room and that it means more to them than the rest of the album.", "\"Falling Over Me\" was co-written by Lovato and Jon McLaughlin and produced by Fields. The song features a \"hypnotic\" bassline and lyrics about Lovato praying that their crush will notice their affection: \"I'm hoping, I'm waiting, I'm praying you are the one\". According to Margaret Wappler of Los Angeles Times, Lovato's vocals in the song balance \"delicacy and force\". On the fifth track, \"Quiet\", Lovato longs for a \"communication breakthrough\" in an awkward relationship, complaining that \"It's too quiet in here\". \"Catch Me\" is an acoustic ballad with a stripped-down production, written by Lovato themselves. The song speaks of an unhealthy love connection, with Lovato going on even though they know \"how badly this will hurt me\". The seventh track, \"Every Time You Lie\", is a song with jazz influences and a \"jaunty '70s vibe\". Kerri Mason of Billboard commented that the song \"swings like Maroon 5's brand of radio soul\". The song tells about self-respect and not putting up with lies in a relationship. \"Got Dynamite\" was written by Gary Clark, E. Kidd Bogart and Victoria Horn and produced by Clark. The song features \"ricocheting\" synthesizers and a scattering pop punk riff. The lyrics use \"violent metaphors\" as invitations for a boy to \"blow up\" Lovato's defenses, with lines such as \"Log in and try to hack me\" and \"Kick senseless, my defenses\".", "*Gary Clark – producer, instruments, programming"]}, {"page": "Want (Natalie Imbruglia song)", "response": ["\"Want\" is the first single taken from the Australian singer-songwriter Natalie Imbruglia's fourth studio album, Come to Life (2009). The single was released on 28 September 2009, two weeks before the release of the album in Europe and Australia. The track was written by Natalie Imbruglia, Daniel Johns under the pseudonym of Kat Kourtney, Gary Clark and Chris Martin and is one of three songs on the album co-written by Martin.", "Category:Songs written by Gary Clark (musician)"]}, {"page": "Gary Clark", "response": ["Gary Clark or Gary Clarke may refer to:", "*Gary Clarke (rugby league) (fl. 1968), New Zealand former professional rugby league footballer", "*Gary Clark (American football) (born 1962), American former football player", "*Gary Clark (footballer) (born 1964), Scottish former football midfielder", "*Gary Clark (golfer) (born 1971), English professional golfer", "*Gary Clark (basketball) (born 1994), American basketball player", "*Gary Clarke (born 1933), American actor", "*Gary Clark (cartoonist) (born 1954), Australian cartoonist, creator of Swamp", "*Gary Clark (musician) (born 1962), Scottish musician, lead singer of Danny Wilson", "*Gary Clark Jr. (born 1984), American guitarist"]}, {"page": "Love the Fall", "response": ["Category:Songs written by Gary Clark (musician)"]}]}}