{"wiki_id": "http://www.wikidata.org/entity/Q55313530", "itemLabel": "John Sibbald", "itemDescription": "Scottish physician (1833-1905)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Sibbald", "wikipedia_page": {"main": "Sir John Sibbald FRSE FBSE (24 June 1833 – 20 April 1905) was a 19th-century Scottish physician and amateur botanist. In 1855/56, aged 22, he served as president of the Royal Medical Society.", "link_mentions": [{"page": "Royal Edinburgh Hospital", "response": ["*Sir John Sibbald FRSE was Deputy Commissioner from 1870 to 1879 and as Commissioner from 1879 to 1899."]}, {"page": "Cape Sibbald", "response": ["Cape Sibbald () is a cliffed cape at the southwest margin of Lady Newnes Bay on the coast of Victoria Land. It marks the southwest extremity of the Mountaineer Range at the terminus of Aviator Glacier. Sighted in February 1841 by Sir James Clark Ross and named by him for Lieutenant (later Cdr.) John Sibbald of the Erebus."]}, {"page": "David Skae", "response": ["Meanwhile from 1836 Skae filled the office of surgeon to the Lock Hospital, and wrote several original papers on syphilis. He made insanity his special study, approaching it from the point of view of a student of nervous and mental physiology. In 1846 he obtained the appointment of physician superintendent of the Royal Edinburgh Asylum at Morningside, and held the post till his death, twenty-seven years later. During his tenure of office the institution doubled in size, and he attracted a succession of gifted assistant physicians. From 1853 and up until a few years before his death, he lectured on insanity for medical students in the wards of the asylum. A number of his lectures (some of the very earliest of their kind ever given in Britain) have been collected and are today held within the archives of the Royal College of Physicians of Edinburgh. From 1870 he was assisted by Dr (later Sir) John Sibbald."]}, {"page": "1899 Birthday Honours", "response": ["*John Sibbald, physician, Lunacy Commissioner in Scotland"]}, {"page": "William Leslie Mackenzie", "response": ["In 1904 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Sir Thomas Clouston, Sir John Sibbald, Cargill Gilston Knott and Alexander Buchan. In 1912 he received an honorary doctorate (LLD) from Aberdeen University."]}, {"page": "John Francis Sutherland", "response": ["In 1896 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Sir Andrew Douglas Maclagan, Sir Arthur Mitchell, John Sibbald and Sir John Halliday Croom."]}, {"page": "Sibbald (surname)", "response": ["*Sir John Sibbald FRSE (1833-1905) Scottish physician"]}, {"page": "Queen Street, Edinburgh", "response": ["* 51 - John Sibbald"]}, {"page": "Sibbald, John", "response": ["#redirectJohn Sibbald"]}, {"page": "John Fraser (physician)", "response": ["In 1896 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Sir Andrew Douglas Maclagan, John Sibbald, Sir William Turner and Alexander Buchan."]}]}}