{"wiki_id": "http://www.wikidata.org/entity/Q5539189", "itemLabel": "George Farmer", "itemDescription": "Royal Navy officer", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Farmer_(Royal_Navy_officer)", "wikipedia_page": {"main": "George Farmer (1732 – 6 October 1779) was an English officer of the Royal Navy.", "link_mentions": [{"page": "Falklands Crisis of 1770", "response": ["In June 1770, the Spanish governor of Buenos Aires, Francisco de Paula Bucareli y Ursua, sent five frigates under General Juan Ignacio de Madariaga to Port Egmont. On 4 June, a Spanish frigate anchored in the harbour; she was presently followed by four others, containing some 1400 marines. The small British force was under the command of Commander George Farmer. Madariaga wrote to Farmer on 10 June that having with him fourteen hundred troops and a train of artillery, he was in a position to compel the English to quit, if they hesitated any longer. Farmer replied that he should defend himself to the best of his power; but when the Spaniards landed, after firing his guns, Farmer capitulated on terms, an inventory of the stores being taken, and the British were permitted to return to their country in the Favourite."]}, {"page": "French frigate Surveillante (1778)", "response": ["On 6 October 1779, off Ushant, Surveillante, under captain Couédic de Kergoaler, met with the 32-gun HMS Quebec, under Captain George Farmer. A furious, three-and-a-half-hour-long combat ensued. Both ships suffered heavy casualties and were completely dismasted. The battle ended when Quebec, firing through her own sails which covered her gunports, took fire and exploded. Surveillante, her hull leaking, had 30 killed and 85 wounded. Her boat rescued whatever British crew had survived, and British and French sailors then had to work together to keep her afloat. She returned to Brest the next day, and the British are said to have been treated as castaways rather than prisoners of war."]}, {"page": "HMS Seahorse (1748)", "response": ["In 1773 Digby Dent took command, before Seahorse was paid off to undergo another refit. She was recommissioned in August 1773 under George Farmer. Horatio Nelson was assigned to the ship as a midshipman through the influence of his uncle, Maurice Suckling. Also a midshipman aboard the Seahorse at this time was Thomas Troubridge, another future admiral."]}, {"page": "Farmer baronets", "response": ["The Farmer Baronetcy, of Mount Pleasant in the County of Sussex, was a title in the Baronetage of Great Britain. It was created on 19 January 1780 for George Farmer, in honour of his late father, Captain George Farmer, who was killed when commanding  in a naval battle with superior French forces off Ushant. The title became extinct on the death of the fifth Baronet in 1913.", "*Sir George Farmer, 3rd Baronet (1829–1883)"]}, {"page": "List of governors of the Falkland Islands", "response": ["| 1770 || 1770 || Capt. George Farmer, HMS Favourite"]}, {"page": "Capture of Port Egmont", "response": ["The Spaniards waded ashore and, after a token exchange of shots, Commander William Maltby and Commander George Farmer sued for terms. They and other settlers were detained for 20 days then permitted to sail for England aboard their sole remaining vessel, the 16-gun Favourite (the Swift had sunk at Port Desire three months before). The new occupiers renamed the town Cruzada and took over ownership. When news reached Britain it produced a public outcry."]}, {"page": "George Farmer", "response": ["George Farmer may refer to:", "*George Farmer (Royal Navy officer) (1732–1779), officer of the Royal Navy", "*George Farmer (footballer, born 1862) (1862–?), footballer who played for Stoke City", "*George Farmer (footballer, born 1863) (1863–1905), Wales international footballer who played for Everton", "*George Farmer (luger) (born 1938), American Olympic luger", "*George Farmer (wide receiver, born 1948), American football player for the Chicago Bears and Detroit Lions, college basketball player", "*George Farmer (wide receiver, born 1958), American football player for the Los Angeles Rams and Miami Dolphins ", "*George Farmer (running back) (born 1993), American football player for the Seattle Seahawks", "*George Farmer (aquascaper), British aquascaper"]}, {"page": "George Farmer (navy)", "response": ["#REDIRECT George Farmer (Royal Navy officer)"]}, {"page": "Sir Rupert George, 1st Baronet", "response": ["In the American Revolution, he fought on HMS Quebec with Captain George Farmer in the action of 6 October 1779. The following year he sailed on HMS Griffin and captured the French Privateer 'Le Général Villepatoux'. In February 1781, he commanded HMS Avenger.p. 157  In 1781, he was the captain of HMS Vulture, where he fought in the action of 21 July 1781. "]}, {"page": "Action of 6 October 1779", "response": ["France along with Spain joined on the side of the Americans and war was declared between France and Britain. Britain did not attempt a close blockade of French ports, rather a screen of frigates kept a vigil while the ships of the line stayed at anchor at places like Torbay and Spithead. One of those frigates, operating off Guernsey, was the thirty-two gun, twelve-pounder frigate HMS Quebec under Captain George Farmer. Quebec had run aground on a submerged rock and had to throw excess weight overboard to refloat her, sacrificing his 12-pound cannon. When repaired in Portsmouth there were no replacements at the time, so ship and crew went back out on station armed with only nine pounders."]}, {"page": "List of governors of dependent territories in the 18th century", "response": ["::*George Farmer, Governor (1770)"]}, {"page": "HMS Swift (1763)", "response": ["At the time of the wreak, the ship was under the command of Captain George Farmer. The ship was commissioned to defend the base of Port Egmond, and at the time was embarked on an exploratory voyage of South America."]}]}}