{"wiki_id": "http://www.wikidata.org/entity/Q5534507", "itemLabel": "Geoffrey Cather", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/Geoffrey_Cather", "wikipedia_page": {"main": "Geoffrey St. George Shillington Cather  (11 October 1890 – 2 July 1916) was a recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces. A soldier with the Royal Irish Fusiliers during the First World War, he was posthumously awarded the VC for his actions on 1 July 1916, during the Battle of the Somme.", "link_mentions": [{"page": "Streatham", "response": ["*Geoffrey Cather, Victoria Cross-winning soldier"]}, {"page": "36th (Ulster) Division", "response": ["* Lieutenant Geoffrey Cather 9th Battalion The Royal Irish Fusiliers. Died 25 years old, 2 July 1916, Battle of the Somme."]}, {"page": "First day on the Somme", "response": ["At Beaumont-Hamel, two British medical officers arranged a truce and in other places movement in no man's land was fired on. Victoria Crosses were awarded to Robert Quigg and Geoffrey Cather (posthumous) for rescuing wounded. Some casualties survived for up to a week in no man's land, living on rations from dead soldiers' packs before being rescued. At  the Fourth Army headquarters believed that there had been  by 3 July the staff thought that there had been  and by 6 July the count had risen to  The Third Army diversion at Gommecourt cost VII Corps 6,758 casualties against 1,212 German. The final total of   whom had been killed, was not calculated for some time; the French Sixth Army had  and the German 2nd Army suffered  In 2013, Ralph Whitehead wrote that  casualties were suffered in early July, of whom  certainly became casualties on 1 July. Before 1 July,  were suffered during the Anglo-French preliminary bombardment or in the days afterwards and  were recorded missing.", "* Geoffrey Cather, 9th Battalion Royal Irish Fusiliers at Hamel — posthumous."]}, {"page": "Geoffrey St George Shillingrton Cather", "response": ["#REDIRECT Geoffrey Cather"]}, {"page": "Cregagh", "response": ["Although predominantly Protestant from its inception, Cregagh had a significant Catholic minority for a number of years and at the start of the Troubles, Catholics even joined in local vigilante patrols under the auspices of the Cregagh Tenants Association. This co-operation ended in 1972 with the arrival of the Ulster Defence Association (UDA) and before long most of the Catholic residents had left the area for west Belfast.Community Case Studies Around this time housing allocation in the area came under UDA control and the local \"Tartan gangs\" were taken over as the junior UDA. Subsequently, however the UDA declined in the area, and east Belfast in general, and the Ulster Volunteer Force became more important, with UVF murals being painted on Cregagh's walls.Michael E. Geisler, National symbols, fractured identities: contesting the national narrative, UPNE, 2005, pp. 188–189 By 2018 however the only murals on Cregagh estate are one commemorating Victoria Cross winners Eric Norman Frankland Bell, Geoffrey Cather, William McFadzean and Robert Quigg and another showing local boy George Best."]}, {"page": "Geoffrey St. George Shillington Cather", "response": ["#REDIRECT Geoffrey Cather"]}, {"page": "Royal Irish Fusiliers", "response": ["*Lieutenant Geoffrey Cather 9th Bn Royal Irish Fusiliers. 1916. Hamel, Somme."]}, {"page": "Geoffrey St George Shillington Cather", "response": ["#REDIRECT Geoffrey Cather"]}, {"page": "Cather", "response": ["* Geoffrey Cather (1890–1916), Victoria Cross recipient"]}, {"page": "July 1916", "response": ["** Nine Victoria Crosses were awarded, two-thirds posthumously, for brave action during the first date of the battle, which included Eric Bell, Geoffrey Cather, John Leslie Green, Stewart Loudoun-Shand, William McFadzean, Robert Quigg, Walter Potter Ritchie, George Sanders, and James Youll Turnbull. "]}, {"page": "Royal Irish Fusiliers Museum", "response": ["The collection includes the Victoria Crosses awarded to Private Robert Morrow and to Lieutenant Geoffrey Cather of the Royal Irish Fusiliers on the Western Front during the First World War. Other highlights include a model demonstrating how Ensign Edward Keogh and Sergeant Patrick Masterson of the 87th (Royal Irish Fusiliers) Regiment of Foot captured a  French Imperial Eagle at the Battle of Barrosa in March 1811 during the Peninsular War. The Eagle itself has been lost but the staff on which it had been placed is still held by the museum."]}, {"page": "Streatham War Memorial", "response": ["The memorial stands on a square of grass surrounded by iron railings and a paved area.  Plaques set into the paving in front of the memorial commemorate the award of the Victoria Cross to three men from the district: Frederick Henry Johnson, Geoffrey Cather and Alfred Fleming-Sandes."]}]}}