{"wiki_id": "http://www.wikidata.org/entity/Q5537504", "itemLabel": "George Butterworth", "itemDescription": "British psychologist", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Butterworth_(psychologist)", "wikipedia_page": {"main": "George Butterworth (1946–2000) was a British professor of psychology, who studied infant development.", "link_mentions": [{"page": "Egocentrism", "response": ["According to George Butterworth and Margaret Harris, during childhood, one is usually unable to distinguish between what is subjective and objective. According to Piaget, \"an egocentric child assumes that other people see, hear, and feel exactly the same as the child does.\""]}, {"page": "Portsmouth College", "response": ["* Prof George Butterworth, Professor of Psychology from 1991–2000 at the University of Sussex, and Editor from 1988–94 of the British Journal of Developmental Psychology"]}, {"page": "George Butterworth (Psychologist)", "response": ["#REDIRECT George Butterworth (psychologist) "]}, {"page": "George Butterworth (disambiguation)", "response": ["George Butterworth (1885–1916) was a British composer.", "George Butterworth may also refer to:", "*George Butterworth (psychologist) (1946–2000), British psychologist", "*George Butterworth (cartoonist) (1905–1988), British cartoonist", "*George Butterworth (tennis) (1858–1941), British tennis player"]}, {"page": "The Foundations of Psychoanalysis", "response": ["The Foundations of Psychoanalysis received positive reviews from the psychiatrist Allan Hobson in The Sciences, the psychoanalyst Carlo Strenger in The International Journal of Psychoanalysis, Eagle in Philosophy of Science, the psychologist George Butterworth in Government and Opposition, the psychiatrist Nathaniel Laor in the American Journal of Psychiatry, Wallace in the Journal of Nervous and Mental Disease, and the philosopher Alessandro Pagnini in The Philosophical Quarterly. In Behavioral and Brain Sciences, The Foundations of Psychoanalysis received positive reviews from the bioethicist Arthur Caplan, Eagle, the philosopher Edward Erwin, the psychologist Hans Eysenck, the philosopher Owen Flanagan, Greenberg, Hobson, the psychologist Robert R. Holt, the psychologist Horst Kächele, the psychiatrist Gerald Klerman, the philosopher Valerii Leibin, the psychologist Lester Luborsky, the psychoanalyst Judd Marmor, the psychologist Joseph Masling, Pagnini, the psychoanalyst Morton F. Reiser, the philosopher Michael Ruse, the psychoanalyst Irwin Savodnik, the psychoanalyst Howard Shevrin, the psychiatrist Anthony Storr, the philosopher Frederick Suppe, the philosopher Barbara Von Eckardt, the sociologist Murray L. Wax, and the psychologist Robert L. Woolfolk."]}, {"page": "Butterworth (surname)", "response": ["*George Butterworth (1885–1916), English composer killed in the First World War", "*George Butterworth (cartoonist) (1905–1988), British political, strip and sports cartoonist, later a book illustrator", "*George Butterworth (psychologist) (1946–2000), British professor of psychology who studied infant development"]}, {"page": "Malinda Carpenter", "response": ["Her earlier experiments were described in detail so they could be replicated.  Her collaborative research on chimpanzees was published in a book.  As well as collaborations listed, her work was also with Michael Tomasello and jointly published their 2005 research, and earlier George Butterworth. Her international interests in 2017 extended to bilingualism in young children, and she was nominated by the students union in St. Andrew's for a 2019 Teaching Awards and shortlisted as a finalist for her academic mentorship."]}]}}