{"wiki_id": "http://www.wikidata.org/entity/Q5536757", "itemLabel": "George Barrington, 7th Viscount Barrington", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Barrington,_7th_Viscount_Barrington", "wikipedia_page": {"main": "George William Barrington, 7th Viscount Barrington, PC (14 February 1824 – 6 November 1886) was a British Conservative politician. He held office under Lord Salisbury as Captain of the Yeomen of the Guard between 1885 and 1886 and as Captain of the Honourable Corps of Gentlemen-at-Arms in 1886.", "link_mentions": [{"page": "William Craven, 4th Earl of Craven", "response": ["His father was the second son of nine children born to William Craven, 2nd Earl of Craven and Lady Emily Mary Grimston, herself the daughter of James Grimston, 1st Earl of Verulam.  His grandfather also served as Lord Lieutenant of Warwickshire from 1853 to 1856.  His paternal aunt, Lady Elizabeth Craven, married Arthur Egerton, 3rd Earl of Wilton, and another, Lady Blanche Craven, married George Coventry, 9th Earl of Coventry, and another, Lady Beatrix Jane Craven, married George Cadogan, 5th Earl Cadogan.  His mother was the second daughter of George Barrington, 7th Viscount Barrington, who was a Member of Parliament for Eye and served as Captain of the Honourable Corps of Gentlemen-at-Arms and Captain of the Yeomen of the Guard under Queen Victoria in the 1880s.  His maternal aunt, Constance Mary Barrington, was married to Lawrence Palk, 2nd Baron Haldon."]}, {"page": "George William Barrington, 7th Viscount Barrington", "response": ["#REDIRECT George Barrington, 7th Viscount Barrington"]}, {"page": "GW Barrington", "response": ["#REDIRECT George Barrington, 7th Viscount Barrington"]}, {"page": "George Barrington (disambiguation)", "response": ["*George Barrington, 7th Viscount Barrington (1824–1886), British Conservative politician"]}, {"page": "William Barrington (diplomat)", "response": ["Born at Beckett Hall in Berkshire, he was the third son of William Barrington, 6th Viscount Barrington and his wife Jane Elizabeth, fourth daughter of Thomas Liddell, 1st Baron Ravensworth. His older brothers were George Barrington, 7th Viscount Barrington and Percy Barrington, 8th Viscount Barrington. Having been previously in private schools in Cheam and in Woolwich, Barrington received his further education in Germany, in schools at Mannheim and at Bonn."]}, {"page": "George Craven, 3rd Earl of Craven", "response": ["On 17 January 1867, Lord Craven married Lady Evelyn Laura Barrington (1848–1924), the second daughter and co-heiress of George Barrington, 7th Viscount Barrington and the former Isabel Elizabeth Morritt (only child of John Morritt of Rokeby Park). Together, they were the parents of six children, including:"]}, {"page": "William Craven, 2nd Earl of Craven", "response": ["* George Grimston Craven, 3rd Earl of Craven (1841–1883), who married Hon. Evelyn Laura Barrington, a daughter George Barrington, 7th Viscount Barrington."]}, {"page": "Bradley Martin", "response": ["* Cornelia Martin (1877–1961), who married William Craven, 4th Earl of Craven (1868–1921), son of George Craven, 3rd Earl of Craven and grandson of George Barrington, 7th Viscount Barrington, in 1893."]}, {"page": "Cornelia, Countess of Craven", "response": ["While her family was renting Balmacaan, a Scottish highland estate, from Lady Seafield, Cornelia met William Craven, 4th Earl of Craven. Lord Craven, later a Captain of the Yeomen of the Guard and Lord Lieutenant of Warwickshire, had become the Earl of Craven in 1883, at the age of fourteen. William was the eldest son of the late George Craven, 3rd Earl of Craven,G.E. Cokayne; with Vicary Gibbs, H.A. Doubleday, Geoffrey H. White, Duncan Warrand and Lord Howard de Walden, editors, The Complete Peerage of England, Scotland, Ireland, Great Britain and the United Kingdom, Extant, Extinct or Dormant, new ed., 13 volumes in 14 (1910-1959; reprint in 6 volumes, Gloucester, U.K.: Alan Sutton Publishing, 2000), volume III, page 506. and his wife, the former Hon. Evelyn Laura Barrington (second daughter of George Barrington, 7th Viscount Barrington, who was a Member of Parliament for Eye). Cornelia, who was then only sixteen years old, and William, who was twenty-four, were married on 18 April 1893 at Grace Church, New York City.  The marriage gave Cornelia a $75,000 a year allowance, and bought the Earl property in Mayfair and paid for the renovation of Coombe Abbey, his family estate in Warwickshire which got a new roof, structural repairs, and its first electric lights. Together, Cornelia and William were the parents of one child, a son and heir born in 1897:"]}, {"page": "Percy Barrington, 8th Viscount Barrington", "response": ["Barrington was born in London on 22 April 1825.  He was the second son of William Barrington, 6th Viscount Barrington, and his wife the Hon. Jane Elizabeth Liddell, daughter of Thomas Liddell, 1st Baron Ravensworth. His elder brother was George Barrington, 7th Viscount Barrington, MP. His younger brothers were diplomat Sir William Barrington and civil servant Sir Eric Barrington, and among his sisters were Hon. Caroline Barrington (wife of James Agar, 3rd Earl of Normanton) and Hon. Augusta Barrington (wife of the Rt. Hon. and Most Rev. William Dalrymple Maclagan, Archbishop of York)."]}]}}