{"wiki_id": "http://www.wikidata.org/entity/Q5539518", "itemLabel": "George Fullard", "itemDescription": "British sculptor", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Fullard", "wikipedia_page": {"main": "George Fullard  (15 September 1923 – 25 December 1973) was an English sculptor.Born in Sheffield on 15 September 1923 Fullard served with the 17th/21st Lancers during World War II and was severely wounded at the Battle of Cassino. He studied at the Sheffield College of Arts and Crafts, and the Royal College of Art. By 1958 John Berger, the art critic of the New Statesman, regarded him as Britain's best young contemporary sculptor. He began to exhibit abroad and win prizes: for example, \"Running Woman\", which can be seen in the grounds of Upper Chapel in Sheffield city centre, won a \"John Moores\" in 1957.He died on 25 December 1973.", "link_mentions": [{"page": "Michael Bird (author)", "response": ["Michael Bird  (born 12 April 1958) is a British author and art historian. He was born in London and educated at Haberdashers' Aske's School and Merton College, Oxford. After teaching at Sherborne School he worked in publishing, including a stint on the editorial team of the Macmillan Dictionary of Art (now Oxford Art Online). Throughout the 1980s and 1990s, Bird published poetry, essays and reviews. His books on modern British art include monographs on the artists Sandra Blow (2005), Bryan Wynter (2010), Lynn Chadwick (2014) and George Fullard (2017),The St Ives Artists: A Biography of Place and Time (2008, 2nd edn. 2016) and Studio Voices: Art and Life in 20th-century Britain (2018). He has also written a history of art for children, Vincent's Starry Night and Other Stories (2016).", "* George Fullard: Sculpture and Survival (2017). Gallery Pangolin. "]}, {"page": "Roy Noakes", "response": ["Noakes changed his indentures to Gerald Giudici, a master carver who executed large-scale public sculptures by Sir Charles Wheeler, Gilbert Ledward and James Woodford; at the end of a long tradition of figurative sculpture, these free-standing monuments and architectural reliefs represented for the ‘modernist’ Patrick Heron, ‘spurious sentiment and meaningless skill’. Noakes might have agreed, but the path he took in the 1960s related neither to the ‘abstraction’ of Anthony Caro, Phillip King or William Tucker, nor to the vestigial figurative tradition represented by John Davis or the mechanistics of George Fullard and Eduardo Paolozzi."]}, {"page": "List of public art in the London Borough of Wandsworth", "response": ["Adams, Peter Agostini, Kenneth Armitage, Leonard Baskin, Harry Bertoia, Brown, Butler, Anthony Caro, Alexander Calder, Lynn Chadwick, John Chamberlain, Geoffrey Clarke, Robert Clatworthy, Hubert Dalwood, George Ehrlich, Herbert Ferber, Elisabeth Frink, George Fullard, Joseph Goto, Dimitri Hadzi, Raoul Hague?, Anthony Hatwell, Barbara Hepworth, John Hoskin, Bryan Kneale, Seymour Lipton, F. E. McWilliam, Bernard Meadows, Henry Moore, Reuben Nakian, Uli Nimptsch, Phillip Pavia, Richmond?, George Rickey, Jose de Rivera, James Rosati, Schmidt?, Jason Seley, David Smith, Richard Stankiewicz, Peter Voulkos, William Turnbull.", "List of sculptors: Adams, David Annesley, Kenneth Armitage, Michael Bolus, Brown, Antanas Braždys, Anthony Caro, Hubert Dalwood, Elisabeth Frink, George Fullard, David Hall, Barbara Hepworth, John Hoskin, Michael Kenny, King, Bryan Kneale, Kim Lim, F. E. McWilliam, Bernard Meadows, Henry Moore, Francis Morland, Eduardo Paolozzi, Pickett?, Scott?, Smith, William G. Tucker, Brian Wall"]}, {"page": "Phyllida Barlow", "response": ["Although born in Newcastle upon Tyne, England in 1944 (as her psychiatrist father Erasmus Darwin Barlow, a great-grandson of Charles Darwin, was stationed there at the time), Barlow was brought up in a London recovering from the second world war. She studied at Chelsea College of Art (1960–63) under the tutelage of George Fullard who was to influence Barlow's perception of what sculpture can be. \"Fullard, among others, was able to impart that the act of making was in itself an adventure. A sculpture that falls over or breaks is just as exciting as one that reveals itself perfectly formed. All the acts of making in the world are there to be plundered and contain within themselves the potential to be transferred to the studio and adapted.\""]}, {"page": "Geometry of Fear", "response": ["While the Geometry of Fear group initially consisted only of the eight sculptors who exhibited in Venice in 1952, and never had any of the characteristics of an art movement, other artists have been associated with it, or thought to have been influenced by it. These include, among others, the sculptors Ralph Brown, Anthony Caro (in his early work), Robert Clatworthy, Hubert Dalwood, Elisabeth Frink, George Fullard, John Hoskin and Leslie Thornton, and the painter John Berger. The post-War paintings of Francis Bacon and Graham Sutherland share some of the Atomic Age anxieties of the Geometry of Fear sculptors."]}, {"page": "List of alumni of the Royal College of Art", "response": ["* George Fullard"]}, {"page": "Fullard, George", "response": ["#redirectGeorge Fullard"]}, {"page": "Fullard", "response": ["*George Fullard (1923–1973), English sculptor"]}]}}