{"wiki_id": "http://www.wikidata.org/entity/Q5539375", "itemLabel": "George Fosbery", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Fosbery", "wikipedia_page": {"main": "Lieutenant Colonel George Vincent Fosbery VC (11 April 1832 – 8 May 1907) was an English recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces. He was also a designer and inventor of firearms.", "link_mentions": [{"page": "List of Old Etonians born in the 19th century", "response": ["* George Fosbery (1832–1907), Umbeyla Expedition Victoria Cross and firearms expert"]}, {"page": "George Vincent Fosbery", "response": ["#REDIRECT George Fosbery"]}, {"page": "4th Bengal European Regiment", "response": ["George Fosbery won his Victoria Cross with the regiment in 1863."]}, {"page": "List of Old Etonians in the armed services", "response": ["*** George Fosbery (1832–1907), VC and firearms expert"]}, {"page": "Ambela campaign", "response": ["On 22 October a reconnaissance was attacked by some Bunerwal tribesman. As a result, Chamberlain proceeded to fortify his position in the pass on two rocky outcrops, but Eagle's Nest and Crag Piquet could only hold small numbers of men.Arthur, Max; p.104 The Pashtuns had amassed a force of local tribesmen consisting of some 15,000 men. The two outcrops were the scene of fierce fighting. On 30 October Crag Piquet was the scene of fierce hand-to-hand fighting that saw two Victoria Crosses awarded; to George Fosbery and Henry Pitcher. Crag Piquet fell to the Pashtuns three times in the next four weeks, but was retaken by British forces on each occasion. On 20 November Chamberlain was seriously wounded. Reinforcements were gradually drafted in on the orders of the Commander-in-Chief Sir Hugh Rose and he replaced Chamberlain with Major General John Garvock on 6 December."]}, {"page": "Smallcombe Cemetery", "response": ["**George Fosbery, Lieutenant, 4th Bengal Regiment, Indian Army, for valiant leadership in recapturing the Crag picket, Umbeyla Expedition, North West Frontier, India, 30 October 1863"]}, {"page": "Ball and shot gun", "response": ["The ball and shot gun was invented by COL George Fosbery, VC, who in 1885 took out the English patent (patent number 7565) for a system of very shallow rifling in the chokes of smoothbore shotgun barrels. Fosbery immediately offered the patent to Holland and Holland, who bought it and from 1886 until 1899, when the patent expired, had exclusive rights to build this class of firearm, marketing it as the Paradox gun."]}, {"page": "Fosbery, George", "response": ["#redirectGeorge Fosbery"]}]}}