{"wiki_id": "http://www.wikidata.org/entity/Q5537756", "itemLabel": "George Catleugh", "itemDescription": "English professional footballer (1932-1996)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Catleugh", "wikipedia_page": {"main": "George Charles Catleugh (11 June 1932 – 5 April 1996) was an English footballer who played at right half.\nBorn in Horden, County Durham, Catleugh started his career as an amateur, playing for King's Lynn, Nuneaton Borough and Bury. He was Nuneaton's only amateur player when they defeated Watford in the FA Cup in 1953; the match finished 3–0 to Nuneaton. At the end of the 1953–54 season, Watford manager Len Goulden signed Catleugh as a professional footballer. He played around half of Watford's games in the first two seasons; 20 in 1954–55 and 24 in 1955–56, and started to play more frequently under new manager Neil McBain, missing only one league match in the following three campaigns.The 1959–60 season marked Watford's first promotion since joining the Football League in 1920, taking them from the Fourth Division to the Third Division. Although Watford's success was largely attributed to the partnership of Cliff Holton and Dennis Uphill, who between them scored 72 league goals, Catleugh was later to remark upon the strong team spirit that season, stating that he felt like part of \"one, big, happy family\".As a result of the promotion, Catleugh spent the remainder of his Watford career as a Third Division player. However, he broke his leg in 1962, and made only four appearances in the entire 1962–63 season. He recovered to make a further 35 appearances in his final two seasons at Watford. He joined Folkestone in 1965, but sustained a second broken leg, which forced him to retire from football in 1968.Catleigh died on 5 April 1996 in Watford, Hertfordshire, aged 63. Among those present at his funeral were former team-mates Holton, Uphill and Ken Nicholas, and Graham Taylor, who at the time was Watford's general manager.", "link_mentions": [{"page": "Luton Town F.C.–Watford F.C. rivalry", "response": ["|George Catleugh"]}, {"page": "Catleugh", "response": ["*George Catleugh (1932–1996), British footballer"]}, {"page": "Catleugh, George", "response": ["#redirectGeorge Catleugh"]}]}}