{"wiki_id": "http://www.wikidata.org/entity/Q5539719", "itemLabel": "George Gill", "itemDescription": "English cricketer (1876-1937)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Gill_(cricketer)", "wikipedia_page": {"main": "George Cooper Gill (18 April 1876 – 21 August 1937) was an English first-class cricketer who played in 171 matches for Somerset, Leicestershire and London County between 1897 and 1906.\nA right-hand bat and right-arm fast medium, Gill scored 4,160 runs (including one century) and took 465 wickets at 25.36 runs per wicket.", "link_mentions": [{"page": "Gill (name)", "response": ["*George Gill (disambiguation), multiple people including:", "**George Gill (cricketer) (1876–1937), English cricketer"]}, {"page": "Australian cricket team in England in 1902", "response": ["In this match at Taunton, Somerset batted first. Saunders took five wickets for 109 for the tourists on the first day, four caught and one lbw as the hosts made 274. In reply, Somerset got two wickets, but Duff had made 75 by stumps on the first day; when he gave a return catch to George Gill, he had made 183 in a three-hour innings, which turned out to be more than half of the Australians' total. Somerset were 159 for five overnight, with Lionel Palairet having made 90, but Somerset's Randall Johnson made 62 as they almost doubled that score on the third day. The Australians did not have enough time to chase 242 for victory."]}, {"page": "List of Somerset County Cricket Club players", "response": ["* George Gill (1897–1902) 93 matches CA"]}, {"page": "Percy Hardy", "response": ["Hardy was a left-handed batsman who sometimes opened the innings and a right-arm medium-pace bowler. He played for Surrey's colts team, but left to join Somerset. He made his debut in 1902 and in his second match took the slip catch that dismissed Victor Trumper for just five – Trumper was dismissed a second time for five by the same bowler, George Gill, later in the match."]}, {"page": "Ernest Gill", "response": ["His brother, George Gill also played cricket for Leicestershire, as well as for London County and Somerset."]}, {"page": "George Gill", "response": ["George Gill may refer to:", "*George Gill (pitcher) (1909–1999), American pitcher for Detroit", "*George Gill (cricketer) (1876–1937), English player for Somerset, Leicestershire and London", "*George Gill (English footballer) (1894–?), English footballer", "*George Gill (Negro leagues), Negro leagues baseball player", "*George Gill (Australian footballer) (1892–1967), Australian rules footballer", "*George Gill Green (1842–1925), American entrepreneur and soldier"]}, {"page": "George Neale", "response": ["The son of Sisson Watts Neale, a brewer, and Mary A. Neale, he was born at Reigate in January 1869. He was educated at Lancing College, playing cricket for the college in his final two years there. After leaving Lancing College, Neale chose to pursue a career in the army. He was commissioned as a second lieutenant into the King's Own Yorkshire Light Infantry in January 1899, with promotion to lieutenant in following in November 1892. By November 1896, he had transferred to the Queen's Royal Regiment (West Surrey). Neale took part in the Niger–Sudan Expedition of 1896–97, during which he was part of further expeditions to Egbon, Bida, and Ilorin. He commanded Number 6 Company, Royal Niger Company Constabulary, to which he had been seconded in November 1896. He served in British India in 1897, seeing action during the Tirah campaign, while the following year he was promoted to captain in December 1898. Returning briefly to England in 1902, Neale played in a first-class cricket match for the Marylebone Cricket Club against London County at Lord's. He was dismissed twice in the match without scoring by George Gill, with London County winning by 10 wickets. "]}, {"page": "Malcolm Carlisle", "response": ["The son of the Samuel Carlisle, he was born in July 1884 at the family home of Foxley Hall at Lymm, Cheshire. He was educated at Harrow School, where he was in both the cricket and football elevens. After completing his education, Carlisle decided on a career in the military and attended the Royal Military College, Sandhurst. He graduated into the Northumberland Fusiliers as a second lieutenant in January 1904. In June 1904, he made a single appearance in first-class cricket for the Marylebone Cricket Club (MCC) against Leicestershire at Lord's. Batting twice in the match, he made scores of 12 and 0, being run out in the MCC first innings and dismissed without scoring in their second innings by George Gill. With the ball, he bowled eight wicketless overs, with Leicestershire winning the match by an innings margin. While serving in British India he was promoted to lieutenant in February 1906. He died three months later in May at Lucknow, from orbital cellulitis, following fever.Death Notification. Manchester Evening News. 9 July 1906. p. 7 From a cricketing family, his brother Kenneth senior, uncle Frederick, and nephew Kenneth junior, all played first-class cricket."]}]}}