{"wiki_id": "http://www.wikidata.org/entity/Q5536828", "itemLabel": "George Beattie", "itemDescription": "Scottish poet", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Beattie_(poet)", "wikipedia_page": {"main": "George Beattie (18 September 1786 – 29 September 1823) was a Scottish poet.", "link_mentions": [{"page": "St Cyrus", "response": ["* George Beattie"]}, {"page": "1823 in poetry", "response": ["* September 29 – George Beattie (born 1786), Scottish"]}, {"page": "1786 in poetry", "response": ["** George Beattie (died 1823), Scottish poet"]}, {"page": "Theatre of Scotland", "response": ["Locally produced drama in this period included John O' Arnha, adapted from the poem by George Beattie by actor-manager Charles Bass and poet James Bowick for the Theatre Royal in Montrose in 1826. A local success, Bass also took the play to Dundee and Edinburgh.B. Bell, \"The national drama and the nineteenth century\" I. Brown, ed, The Edinburgh Companion to Scottish Drama (Edinburgh: Edinburgh University Press, 2011) , p. 55."]}, {"page": "George Beattie", "response": ["George Beattie may refer to:", "* George Beattie (footballer) (1925–2012), Scottish footballer", "* George Beattie (poet) (1786–1823), Scottish poet", "* George Beattie (shooter) (1877–?), Canadian sport shooter"]}, {"page": "List of Scottish poets", "response": ["*George Beattie"]}, {"page": "Scottish literature in the nineteenth century", "response": ["Also important was the work of Joanna Baillie (1762–1851), although her work was more significant anonymously in print than performance for much of her lifetime, she emerged as one of Scotland's leading playwrights. Baillie's first volume of Plays on the Passions was published in 1798 consisted of Count Basil, a tragedy on love, The Tryal, a comedy on love, and De Monfort, a tragedy on hatred. De Monfort was successfully performed in Drury Lane, London before knowledge of her identity emerged and the prejudice against women playwrights began to effect her career.B. Bell, \"The national drama and the nineteenth century\" I. Brown, ed, The Edinburgh Companion to Scottish Drama (Edinburgh: Edinburgh University Press, 2011), , pp. 48–9. Baillie's Highland themed Family Legend was first produced in Edinburgh in 1810 with the help of Scott, as part of a deliberate attempt to stimulate a national Scottish drama.M. O'Halloran, \"National Discourse or Discord? Transformations of The Family Legend by Baille, Scott and Hogg\", in S-R. Alker and H. F. Nelson, eds, James Hogg and the Literary Marketplace: Scottish Romanticism and the Working-Class Author (Aldershot: Ashgate Publishing, Ltd., 2009), , p. 43. Locally produced drama in this period included John O' Arnha, adapted from the poem by George Beattie by actor-manager Charles Bass and poet James Bowick for the Theatre Royal in Montrose in 1826. A local success, Bass also took the play to Dundee and Edinburgh.B. Bell, \"The national drama and the nineteenth century\" I. Brown, ed, The Edinburgh Companion to Scottish Drama (Edinburgh: Edinburgh University Press, 2011) , p. 55."]}, {"page": "1823 in Scotland", "response": ["* 29 September – George Beattie, poet (born 1786)"]}, {"page": "1786 in Scotland", "response": ["* 18 September – George Beattie, poet (died 1823)"]}]}}