{"wiki_id": "http://www.wikidata.org/entity/Q5536483", "itemLabel": "George Atkinson", "itemDescription": "British mountain climber", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Atkinson_(climber)", "wikipedia_page": {"main": "George Atkinson (born 29 May 1994) is an English climber.  At the age of sixteen he became the youngest ever person to complete the Seven Summits Challenge by climbing to the summit of the highest mountain on each of seven continents.  He completed the challenge at 08:15 local time on 26 May 2011 when he reached the summit of Mount Everest. Atkinson was 16 years and 362 days old when he completed the challenge which beat previous record holder Johnny Collinson who completed the challenge at 17 years and 296 days old.\nHis record stood for seven months, until it was bested by Jordan Romero, who completed the challenge on 24 December 2011 at the age of 15.", "link_mentions": [{"page": "Seven Summits", "response": ["On 17 May 2006, Rhys Jones became the youngest person to complete the Seven Summits (Bass list) at the age of exactly 20 years. Notable climbers who had previously been the youngest to complete the Seven Summits include Rob Hall in 1990 and David Keaton in 1995. In May 2007, Samantha Larson completed the seven at the age of 18 years and 220 days (she is still the youngest woman to have climbed the Seven Summits). Johnny Strange finished climbing the summits at the age of 17 years and 161 days in June 2009. On 26 May 2011, at 6:45 Nepali time, Geordie Stewart became the youngest Briton to complete the Seven Summits at the age of 22 years and 21 days. In 2009-10, Indian mountaineer Krushnaa Patil made a bid for the fastest woman to complete the challenge; she fell short of the challenge when, in May 2009, her seventh and final summit bid on Denali was halted by her guide's illness. George Atkinson then became the youngest person in the world to complete the round aged 16 years 362 days. On 24 December 2011, the record was once again beaten, by American Jordan Romero, who completed the challenge at the age of 15 years, 5 months and 12 days by climbing Vinson."]}, {"page": "Oxford University Mountaineering Club", "response": ["*George Atkinson (b. 1994), Linacre College"]}, {"page": "George Atkinson", "response": ["George Atkinson may refer to:", "*George Atkinson (Surveyor General), Surveyor General of Ceylon appointed in 1805", "*George Atkinson (cricketer) (1830–1906), English cricketer", "*George Atkinson (fl. 1900), runner-up in 1900 US Open Tennis mixed doubles", "*George Atkinson (1900s footballer) (fl. 1904/5), English professional footballer", "*George Atkinson (safety) (born 1947), American football safety and kick returner", "*George Atkinson III (1992–2019), American football running back and kick returner", "*George Atkinson (Olympic footballer), represented Great Britain at the 1920 Summer Olympics", "*George Atkinson (climber) (born 1994), British mountain climber", "*George Atkinson (convict) (1764–1834), English convict and member of the First Fleet to Australia", "*George Atkinson (video rental businessman) (1935–2005), American businessman and video rental pioneer", "*George Atkinson-Willes (1847–1921), British Admiral, known as George Atkinson prior to 1901"]}, {"page": "Ewell Castle School", "response": ["*George Atkinson, Youngest Briton to climb Mount Everest"]}, {"page": "Jordan Romero", "response": ["Upon successfully hiking the Vinson Massif in December 2011 at the age of 15 years, 5 months, 12 days, Romero became the youngest climber in the world to complete the Seven Summits (the highest mountains on each of the continents), a title previously held by George Atkinson. After this experience, Romero wrote a novel for children called \"No Summit Out Of Sight\". "]}]}}