{"wiki_id": "http://www.wikidata.org/entity/Q5534530", "itemLabel": "Geoffrey Colin Guy", "itemDescription": "British Colonial Governor", "wikipedia_url": "https://en.wikipedia.org/wiki/Geoffrey_Colin_Guy", "wikipedia_page": {"main": "Geoffrey Colin Guy CMG, CVO, OBE (4 November 1921 – 1 December 2006) was the last Commissioner and the first Administrator of the Turks and Caicos from 1958 to 1959 and 1959 to 1965 respectively. Mr. Guy was succeeded by John Anthony Golding in 1965. He was administrator during Hurricane Donna, which in 1960 devastated agriculture on the island.  He was managing director of the salt industry on the islands and used profits from the commodity to build airstrips and lay the foundation for today's main industry – tourism.\nGuy was an RAF photo-reconnaissance pilot during World War II in the Burmese campaign against the invading Japanese. His memoir, Geoffrey Guy's War, (Amberley Books. 2012), records his experiences in the RAF. \nPost-war he was a District Commissioner in Sierra Leone where he helped to control the riots which occurred as British rule came to an end.\nFollowing his service in Turks and Caicos, he was Administrator and then Governor of Dominica from 1965 until 1967. In 1973, he became the Administrator of Ascension, where he served until 1976. He subsequently served as the last colonial Governor of Saint Helena from 1976 to 1980. In 1980, he stood for election to Saint Helena's first sovereign parliament and served as its speaker until his retirement at the 1985 election.\nGuy stayed on in Saint Helena until 1992 when he and his wife Joan moved to a Yorkshire village, Kirk Hammerton, where he lived until his death. They are survived by their son Ben.", "link_mentions": [{"page": "List of colonial governors in 1978", "response": ["** Governor – Geoffrey Colin Guy, Governor of Saint Helena (1976–1981)"]}, {"page": "List of colonial governors in 1979", "response": ["** Governor – Geoffrey Colin Guy, Governor of Saint Helena (1976–1981)"]}, {"page": "List of colonial governors in 1981", "response": ["**# Geoffrey Colin Guy, Governor of Saint Helena (1976–1981)"]}, {"page": "List of colonial governors in 1980", "response": ["** Governor – Geoffrey Colin Guy, Governor of Saint Helena (1976–1981)"]}, {"page": "Chatham House Grammar School", "response": ["* Geoffrey Colin Guy CMG CVO OBE, Governor of Saint Helena (1976–81), and Commissioner of the Turks and Caicos Islands (1958–59, 1959–65)"]}, {"page": "Governor of Saint Helena", "response": ["# 1976 – Geoffrey Colin Guy"]}, {"page": "Deaths in December 2006", "response": ["*Geoffrey Colin Guy, 86, British airman and colonial governor."]}, {"page": "List of commissioners of the Turks and Caicos Islands", "response": ["* Geoffrey Colin Guy 1958-1959"]}, {"page": "Administrator of the Turks and Caicos", "response": ["* Geoffrey Colin Guy (1921–2006) 1959–1965"]}, {"page": "Administrator of Ascension", "response": ["|Geoffrey Colin Guy||September 1973 ||November 1976||"]}, {"page": "1957 New Year Honours", "response": ["*Geoffrey Colin Guy, District Commissioner, Sierra Leone."]}, {"page": "1964 Birthday Honours", "response": ["* Geoffrey Colin Guy, , Administrator, Turks and Caicos Islands."]}, {"page": "Chatham and Clarendon Grammar School", "response": ["* Geoffrey Colin Guy CMG CVO OBE, Governor of Saint Helena from 1976 to 1981, and Commissioner of the Turks and Caicos Islands from 1958 to 1959 and 1959–1965"]}, {"page": "List of colonial governors and administrators of Dominica", "response": ["* 1965–1967: Geoffrey Colin Guy", "* 1967: Geoffrey Colin Guy"]}, {"page": "List of governors of dependent territories in the 20th century", "response": ["::*Geoffrey Colin Guy, Commissioner (1958–1959)", "::*Geoffrey Colin Guy, administrator (1959–1965)", "::*Geoffrey Colin Guy, Governor (1976–1981)", ":::*Geoffrey Colin Guy, administrator (1973–1976)"]}, {"page": "Governor Guy", "response": ["*Geoffrey Colin Guy (1921–2006), Governor of Dominica from 1965 until 1967 and Governor of Saint Helena from 1976 to 1980"]}]}}