{"wiki_id": "http://www.wikidata.org/entity/Q5536444", "itemLabel": "George Arthur Fripp", "itemDescription": "British artist (1813-1896)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Arthur_Fripp", "wikipedia_page": {"main": "George Arthur Fripp  (13 June 1813 – 17 October 1896) was a British watercolourist. He was a grandson of the artist Nicholas Pocock and brother of the painter Alfred Downing Fripp. His nephew was the artist Henry Charles Innes Fripp.", "link_mentions": [{"page": "David Cox (artist)", "response": ["In May 1840 Cox wrote to one of his Birmingham friends: \"I am making preparations to sketch in oil, and also to paint, and it is my intention to spend most of my time in Birmingham for the purpose of practice\". Cox had been considering a return to painting in oils since 1836 and in 1839 had taken lessons in oil painting from William James Müller, to whom he had been introduced by mutual friend George Arthur Fripp. Hostility between the Society of Painters in Water Colours and the Royal Academy made it difficult for an artist to be recognised for work in both watercolour and oil in London, however, and it is likely that Cox would have preferred to explore this new medium in the more supportive environment of his home town. By the early 1840s his income from sales of his watercolours was sufficient to allow him to abandon his work as a drawing master, and in June 1841 he moved with his wife to Greenfield House in Harborne, then a village on Birmingham's south western outskirts. It was this move that would enable the higher levels of freedom and experimentation that were to characterise his later work."]}, {"page": "Nicholas Pocock", "response": ["Pocock married Ann Evans of Bristol in 1780; together they had eight children.  His son Isaac was an artist and dramatist, his second son William Innes Pocock was a Royal Navy Officer and marine artist. Two of his grandsons, Alfred Downing Fripp and George Arthur Fripp, were also artists."]}, {"page": "Alfred Downing Fripp (artist)", "response": ["Alfred Downing Fripp (22 April 1822 – 13 March 1895) was a British artist who specialised in watercolours of rural subjects. He was grandson of the artist Nicholas Pocock,  a brother of the painter George Arthur Fripp, and father of the surgeon Sir Alfred Downing Fripp."]}, {"page": "Fripp", "response": ["* George Arthur Fripp (1813 - 1896), British watercolourist"]}, {"page": "George Arthur Thripp", "response": ["#REDIRECT George Arthur Fripp"]}, {"page": "Charles Edwin Fripp", "response": ["Charles Edwin Fripp was born in London, one of the twelve children of George Arthur Fripp (1822–1895), a landscape artist, and Mary Percival. His brother Thomas W. Fripp also became a watercolourist in Canada and his brother Robert McKay Fripp worked as an architect in Vancouver."]}, {"page": "Bristol School", "response": ["The school initially formed around Edward Bird some years before his death in 1819. Having arrived in Bristol from Ireland in 1813, Francis Danby was a participant from around 1818–19 and remained connected to the group for around a decade, although he left Bristol for London in 1824. Other artists involved were Edward Villiers Rippingille, Samuel Jackson, James Johnson, Nathan Cooper Branwhite, William West, James Baker Pyne, George Arthur Fripp and Paul Falconer Poole.", "Around 1832–33 a new series of sketching meetings was started. This initially included William James Müller, Thomas Leeson Scrase Rowbotham, John Skinner Prout and Robert Tucker, according to Tucker's own account. The meetings later grew to include more artists, although relatively few surviving drawings have been identified, compared to the meetings of the 1820s, and by the 1830s the works of the Bristol School were less original. Other participants in the meetings probably included Samuel Jackson, Stephen C. Jones, James Baker Pyne, Henry Brittan Willis, W. Williams, Joseph Walter, George Arthur Fripp, Edmund Gustavus Müller, and William Evans. These sketching meetings may have lasted into the 1840s."]}, {"page": "G. A. Fripp", "response": ["#REDIRECT George Arthur Fripp"]}, {"page": "James Baker Pyne", "response": ["Pyne died on 29 July 1870 at his home, 203 Camden Road, London, leaving sons James Baker Pyne, a photographer, and Charles Pyne, an artist. Besides Müller, his pupils included George Arthur Fripp and James Astbury Hammersley. He is buried with his wife Anne (1805-1865) in Highgate Cemetery."]}, {"page": "Henry Charles Innes Fripp", "response": ["He was born in 1867 to a family of well known public officials and artists. His actual birth date is unknown, but church records show he was christened on 10 May 1867 at Clifton, St John the Evangelist, Gloucestershire, England.  His father was Samuel Charles Fripp and his mother was Clara Fripp. Samuel Charles Fripp was an architect and sculptor, and a committee member of the Royal West of England Academy. His uncle was the noted landscape painter George Arthur Fripp of the Royal Watercolour Society, while his great great grandfather was the highly regarded maritime painter Nicholas Pocock. His cousin was the surgeon Sir Alfred Downing Fripp. Downing Fripp wrote \"Human Anatomy For Art Students\" illustrated by Innes Fripp published in 1911 by J. B. Lippincott, Philadelphia."]}, {"page": "Thomas Fripp", "response": ["The son of George Arthur Fripp, an artist, and Mary Percival, he was born in London. His grandfather Nicholas Pocock founded the Royal Watercolour Society. Fripp studied at St John's Wood Art School and then continued his art studies in Italy in 1886. From 1887 to 1890, he learned from his father at the Royal Academy of Arts. He came to British Columbia in 1893, settling at Hatzic as a homesteader. After suffering an injury, Fripp moved to Vancouver to continue in a career as an artist. Between 1900 and 1902, he worked in a local photographic studio. He exhibited his art with the Vancouver Arts and Crafts Association in 1900. With Emily Carr and others, he established the British Columbia Society of Fine Arts, which received its charter in 1909, becoming the first chartered art society in the province. Fripp served seven years as the society's first president and served again as president from 1926 to 1931. He also exhibited with the Island Arts and Crafts Society in Victoria from 1912 to 1914 and from 1928 to 1930. In 1920, he became a member of the first executive of the British Columbia Art League. He was president of the Vancouver Sketch Club from 1920 to 1921."]}, {"page": "Robert McKay Fripp", "response": ["The son of George Arthur Fripp, an artist, and Mary Percival, he was born in Clifton, now a suburb of Bristol. He articled as an architect in Berkshire. Fripp was strongly influenced by the Arts and Crafts movement as reflected in the work of Richard Norman Shaw and William Morris. He continued his studies at the Royal College of Art and the British Museum and went on to work with Sir Horace Jones in London."]}]}}