{"wiki_id": "http://www.wikidata.org/entity/Q5534704", "itemLabel": "Geoffrey J. Morton", "itemDescription": "Palestinian police officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Geoffrey_J._Morton", "wikipedia_page": {"main": "Geoffrey J. Morton, BEM (1907–1996) was a member of the Palestine Police who in separate incidents shot dead two suspects and Avraham Stern, the leader of the militant Zionist group, Lehi, which staged an insurgency against British rule in Palestine during World War II with the aim of creating a Jewish state. The circumstances under which Morton killed Stern were disputed, and the controversy effectively ended his active police work in Palestine.", "link_mentions": [{"page": "Lehi (militant group)", "response": ["Stern's group was seen as a terrorist organisation by the British authorities, who instructed the Defence Security Office (the colonial branch of MI5) to track down its leaders. In 1942, Stern, after he was arrested, was shot dead in disputed circumstances by Inspector Geoffrey J. Morton of the CID.Boyer Bell, 1996, p. 71. The arrest of several other members led momentarily to the group's eclipse, until it was revived after the September 1942 escape of two of its leaders, Yitzhak Shamir and Eliyahu Giladi, aided by two other escapees Natan Yellin-Mor (Friedman) and Israel Eldad (Sheib). (Giladi was later killed by Lehi under circumstances that remain mysterious.) Shamir's codename was \"Michael\", a reference to one of Shamir's heroes, Michael Collins. Lehi was guided by spiritual and philosophical leaders such as Uri Zvi Greenberg and Israel Eldad. After the killing of Giladi, the organization was led by a triumvirate of Eldad, Shamir, and Yellin-Mor."]}, {"page": "Lehi Museum", "response": ["Museum visit begins on the top floor. in this floor was the apartment of Tova and Moshe Savorai. Stern lived there on his last three weeks. On 12 February 1942, British officers came to the Savorais' rented apartment. they were looking for Stern. Stern was hiding in the wardrobe and Tova opened the door to the officers. Only on the second search of the house, on this day, they found Stern. Officer Geoffrey J. MortonPatrick Bishop, The Reckoning: Death and Intrigue in The Promised Land, (William Collins, 2014), "]}, {"page": "Avraham Stern", "response": ["The \"most secret\" report made by the police to the British mandatory government said, \"Stern was ...  just finishing lacing his shoes when he suddenly leapt for the window opposite. He was halfway out of the window when he was shot by two of the three policemen in the room.\" Assistant Superintendent Geoffrey J. Morton, the most senior policeman present, later wrote in his memoirs that he had feared Stern was about to set off an explosive device as he had previously threatened to do if captured.Geoffrey Morton, Just The Job, Some Experiences of a Colonial Policeman, pp. 144-145"]}, {"page": "Shoshana Borochov", "response": ["After a few months of studies by Shoshana, Wilkin reached a good level in Hebrew. He used to sit at cafes with Jews and collect a lot of information. Wilkin was considered as an outstanding officer in the British police and got three decorations for excellence. In 1938, Wilkin moved to serve in the British Intelligence headquarters in Tel Aviv. As an officer who had mastered Hebrew, Wilkin was considered a dangerous enemy, especially by the underground organizations who recognized his abilities and were afraid of him. Wilkin was involved in investigations and torture of the Irgun and Lehi members, and in raiding the Irgun headquarters in 1939, and was the right hand of Assistant Superintendent Geoffrey J. Morton, who on February 12, 1942 shot and killed Lehi commander Avraham Stern (Yair) by a pistol."]}]}}