{"wiki_id": "http://www.wikidata.org/entity/Q55313479", "itemLabel": "John Bates", "itemDescription": "neurophysiologist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Bates_(neurophysiologist)", "wikipedia_page": {"main": "John Alexander Vincent Bates (1918-1993) was an English neurophysiologist based at the National Hospital for Nervous Diseases from 1946 until his retirement. He became the chief electroencephalographer at the hospital, studying human EEG in relation to voluntary movement. In 1949 he founded the Ratio Club, a dining club of British scientists interested in cybernetics.Papers relating to Bates and the Ratio Club are held at the Wellcome Library.", "link_mentions": [{"page": "Ratio Club", "response": ["The idea of the club arose from a symposium on animal behaviour held in July 1949 by the Society of Experimental Biology in Cambridge.  The club was founded by the neurologist John Bates, with other notable members such as W. Ross Ashby.", "The initial membership was W. Ross Ashby, Horace Barlow, John Bates, George Dawson, Thomas Gold, W. E. Hick, Victor Little, Donald MacKay, Turner McLardy, P. A. Merton, John Pringle, Harold Shipton, Donald Sholl, Eliot Slater, Albert Uttley, W. Grey Walter and John Hugh Westcott. Alan Turing joined after the first meeting with I. J. Good, Philip Woodward and William Rushton added soon after. Giles Brindley was also a member for a short period."]}, {"page": "John Bates", "response": ["John Bates may refer to:", "*John Bates (American football) (born 1997), American football player", "*John Bates (technology executive), British computer scientist and businessman", "*John Bates (designer) (born 1938), English fashion designer", "*John Bates (baseball) (1868–1919), American baseball player", "*John Bates (basketball) (1938–2015), American college basketball coach", "*John Bates (rector), eighteenth-century Senior Wrangler; see List of Wranglers of the University of Cambridge", "*Big John Bates, Canadian guitarist and singer", "*John Bates (neurophysiologist) (1918–1993), English neurophysiologist", "*John Bates, a character from the period drama soap opera Downton Abbey", "*John Bates Clark (1847–1938), American economist", "*John Bates Thurston (1836–1897), British colonial in Fiji"]}, {"page": "John Alexander Vincent Bates", "response": ["#REDIRECT John Bates (neurophysiologist)"]}, {"page": "John Bates (neurologist)", "response": ["#REDIRECT John Bates (neurophysiologist)"]}]}}