{"wiki_id": "http://www.wikidata.org/entity/Q5534070", "itemLabel": "Geoff Butler", "itemDescription": "English footballer (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Geoff_Butler", "wikipedia_page": {"main": "Geoffrey Butler (born 26 September 1946) is a former professional footballer who played as a defender in The Football League between the 1960s and 1980s.He started out with his hometown club Middlesbrough and made 55 league appearances for them before a transfer to Chelsea in September 1967. He only made a total of nine appearances for Chelsea. He later played for Sunderland and Norwich City, and whilst at Norwich he played for the Baltimore Comets of the North American Soccer League in the 1974 and 1975 NASL summer seasons, making a total of 40 appearances. He also played for AFC Bournemouth. While at Norwich, he was a member of the team that reached the final of the League Cup in 1973. In 1992, it was revealed that South Africa national team manager Jeff Butler had been sacked from his post for passing off Geoffrey Butler's playing career as his own.", "link_mentions": [{"page": "1995 Governor General's Awards", "response": ["*Geoff Butler, The Killick: A Newfoundland Story "]}, {"page": "Weymouth F.C.", "response": ["*  Geoff Butler (May 2002 – May 2003)"]}, {"page": "Governor General's Award for English-language children's illustration", "response": ["|| Geoff Butler"]}, {"page": "Baltimore Comets", "response": ["* 1974: Geoff Butler, Peter Silvester"]}, {"page": "Jason Matthews (footballer)", "response": ["Bristol Rovers signed him up on schoolboy terms but he was released just before he left school. Matthews then spent six years playing for a number of clubs in the Screwfix League including Welton Rovers, Paulton and Mangotsfield, before signing for Geoff Butler's Salisbury City.", "He followed this by moving over the Welsh border to Aberystwyth Town for a year before joining Clevedon Town. It was from Clevedon that Geoff Butler signed him for Weymouth in 2002, where he has stayed (and stayed almost unrivalled #1 keeper) for nearly five whole seasons."]}, {"page": "1973 Football League Cup Final", "response": ["|3 || Geoff Butler"]}]}}