{"wiki_id": "http://www.wikidata.org/entity/Q5538578", "itemLabel": "George Donnelly", "itemDescription": "British footballer (born 1988)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Donnelly_(footballer)", "wikipedia_page": {"main": "Georgie John Donnelly (born 28 May 1988) is an English professional footballer who plays as a striker.\nHe has previously played for Skelmersdale United, Plymouth Argyle, Luton Town, Stockport County, Fleetwood Town, Macclesfield Town and Tranmere Rovers.\nDonnelly has played internationally for England at non-league level.", "link_mentions": [{"page": "Kirkby", "response": ["*George Donnelly - Currently a free agent, most recently a Tranmere Rovers F.C. Player"]}, {"page": "Sam Wedgbury", "response": ["The 2011–12 season was Wedgbury's breakthrough year of regular first-team football, and he impressed as he made 47 appearances, of which 45 were starting, in what was a difficult season for the club as they suffered relegation to the Conference National. Wedgbury scored once during the campaign, a low volley from George Donnelly's cross in a 2–2 draw with fellow strugglers Hereford United at Moss Rose in March 2012. He was described as \"visibly distraught\" following Macclesfield's 2–0 defeat to Burton Albion, the game that confirmed the club's relegation, and he stated — \"It was a sad day. We feel we've let the fans, the club, the board, everyone down. It's the first time I've experienced anything like that in my career. I'm devastated. We're truly sorry, we've let our loyal fans down after 15 years in the Football League and we know we're to blame\". He remained at Macclesfield for the 2012–13 season despite a mass overhaul of players over the summer, and started in the club's first game back in the Conference, which ended in a 2–1 loss to Hereford United at Edgar Street. Wedgbury was once again a regular throughout the season, making 43 appearances in all competitions. He particularly impressed during Macclesfield's FA Cup run during the season, as they defeated Cardiff City in the Third Round, before bowing out in the next round following a narrow 1–0 defeat to eventual winners, Wigan Athletic. After Macclesfield's 2–1 victory over Cambridge United on 20 April 2013, the club's final game of the season, Wedgbury was voted as both Fans and Players' Player of the Year. During his three seasons at Macclesfield, Wedgbury made 116 appearances and scored twice."]}, {"page": "2009–10 Luton Town F.C. season", "response": [" Murray started in the team on the same day in Luton's first home game of the season – a 4–1 victory over Mansfield Town that saw centre-back George Pilkington score his first two goals for the club. Luton continued with victories over Gateshead and Forest Green Rovers, before labouring to a 0–0 home draw with Chester City. Long-term injuries to forwards Ryan Charles and Liam Hatch left Luton short on attacking options, resulting in striker George Donnelly signing on a one-month loan from Plymouth Argyle on 28 August. Luton ended August unbeaten with a draw at Kettering Town, placing them third in the table.", "|align=\"left\"|22||align=\"left\"|FW||align=\"left\"| George Donnelly", "| 28 August 2009 ||  George Donnelly || Plymouth Argyle || 29 September 2009 ||align=\"center\"|"]}, {"page": "Ross Draper", "response": ["In August 2011, at the start of the 2011–12 season, Draper attracted national news attention after scoring from close to the halfway line against Hereford United. Macclesfield went on to win the League Two match 4–0. Afterwards, Draper conceded that he would never score another goal like it in his career. On 9 October 2011, he scored and provided an assist for George Donnelly during a 2–1 win over Aldershot. Later that month, the club opened contract extension negotiations with Draper. On 25 November 2011, he received a straight red card – for the first time in his Macclesfield career – after a serious foul on Michael Hector in a 2–1 loss against Barnet. After the match, the club appealed his sending off. However, the FA rejected this appeal and confirmed a ban for three matches."]}, {"page": "2009–10 Stockport County F.C. season", "response": ["|36||||FW||George Donnelly||4||0||0||0|| 4", "| George Donnelly", "|20||||DF||George Donnelly||2||0", "| George Donnelly || Plymouth Argyle || 29 January 2010"]}, {"page": "2009–10 Plymouth Argyle F.C. season", "response": ["|George Donnelly", "|George Donnelly"]}, {"page": "2008–09 Plymouth Argyle F.C. season", "response": ["|13||1||0||0||0||0||style=\"background:#98FB98\"|13*||1||3||0||George Donnelly", "| style=\"text-align:center;\"|35||align=\"left\"|FW||align=\"left\"| George Donnelly", "| 1 July 2008 || FW ||  George Donnelly ||  Skelmersdale United || Undisclosed"]}, {"page": "2010–11 Stevenage F.C. season", "response": ["The 2010–11 League Two fixtures were released on 17 June 2010, with Stevenage opening their league campaign at home to Macclesfield Town on 7 August 2010. The game ended 2–2. Peter Vincenti opened the scoring for the hosts after just six minutes; heading in Charlie Griffin's looping cross. Macclesfield equalised just four minutes later after Matt Hamshaw's cross was headed in by Nat Brown. Tyrone Barnett then put the away side ahead early in the second–half. Stevenage levelled the game with just one minute remaining after Rob Sinclair cut in from the right and slid the ball to Charlie Griffin, who poked the ball past the on–rushing Veiga. The club's first away game in the Football League ended in a 1–0 defeat against Bradford City at Valley Parade. Bradford striker Gareth Evans scored the only goal of the game from the penalty spot in the first–half in a game that was \"rough luck on the visitors\" having dominated large parts of the game. Stevenage won their first game of the season a week later, beating Stockport County 3–1 at Broadhall Way. Charlie Griffin opened the scoring with a looping header after half an hour, before Michael Bostwick's 30-yard effort found the top corner two minutes before the interval. Griffin added the third with a close range effort in the second-half, with Stockport's George Donnelly scoring a consolation goal in injury–time. A week later, Stevenage travelled to Aldershot Town for their second away fixture of the season. The game ended all square, finishing 1–1. Chris Beardsley opened the scoring five minutes into the second-half, with Aldershot striker Damian Spencer equalising fifteen minutes later. With just five minutes remaining, Jon Ashton was adjudged to have fouled Spencer in the area, with referee Mark Halsey pointing to the spot. Marvin Morgan's resulting penalty was palmed away by Chris Day to ensure Stevenage earned their first point on the road."]}, {"page": "2010–11 Plymouth Argyle F.C. season", "response": ["Argyle took a three-goal lead against Eerste Divisie club SC Cambuur, but eventually had to settle for a 3–3 draw. A brace from Reza Ghoochannejhad and an equaliser from Robert van Boxel cancelled out Argyle's lead, which was given to them by Craig Noone and a brace from Joe Mason.\"Argyle reserve team acquits itself well in battling draw\". The Plymouth Herald. 23 July 2010. Retrieved 15 January 2011. Having featured in all of the club's pre-season matches, midfielder Anton Peterlin signed a permanent contract.\"American midfielder Anton Peterlin set to sign for Plymouth Argyle\" . The Plymouth Herald. 28 July 2010. Retrieved 15 January 2011. Argyle won their next friendly later that day against Hereford United of League Two. Steve MacLean was on target to secure a 1–0 win for the visitors.\"MacLean on target as Greens claim narrow win over Hereford\" . The Plymouth Herald. 29 July 2010. Retrieved 15 January 2011. Striker George Donnelly returned to Stockport County on a six-month loan.\"Donnelly back with Hatters\". Sky Sports. 29 July 2010. Retrieved 15 January 2011. A penalty from Luke Summerfield earned the club a draw against Championship side Queens Park Rangers. Former player Jamie Mackie scored the equaliser for the hosts.\"Plymouth Argyle denied victory by Jamie Mackie's late strike at Loftus Road\" . The Plymouth Herald. 31 July 2010. Retrieved 15 January 2011. Argyle completed their pre-season campaign with an 8–0 win against South West Peninsula League team Saltash United. Strikers Bradley Wright-Phillips and Rory Patterson both scored twice while trialist Owain Tudur-Jones, Craig Noone, Joe Mason and Curtis Nelson also found the back of the net.\"Tudur Jones on target as Argyle smash Saltash 8–0\" . The Plymouth Herald. 3 August 2010. Retrieved 15 January 2011.", "| George Donnelly", "|Undisclosed\"Fleetwood Town sign striker George Donnelly\". BBC Sport. 7 January 2011. Retrieved 7 January 2011.", "| George Donnelly"]}, {"page": "Jamie Proctor", "response": ["On 13 August 2010, Proctor joined League Two club Stockport County on a 28-day loan aged just 17. Having impressed manager Paul Simpson during training, he made his debut the next day, coming on as a 61st-minute substitute for Danny Rowe in a 0–0 draw with Wycombe Wanderers at Edgeley Park. His loan spell was extended for another month until October. On 28 September, Proctor set up a goal for George Donnelly in a 2–2 draw with Accrington Stanley. He made seven appearances for the \"Hatters\", before returning to Preston after Simpson claimed that Stockport's dire financial situation meant \"we've had to let him go for the sake of a couple of hundred quid\". Proctor was on the fringes of the \"Lilywhites\" first-team squad during the 2010–11 season and had to wait until the last game of the season to score his first senior goal in a 3–1 win against Watford at Deepdale, by which stage Preston's relegation into League One had already been confirmed after a disappointing season under the management of Phil Brown."]}, {"page": "George Donnelly", "response": ["George Donnelly may refer to:", "* George Donnelly (footballer) (born 1988), English footballer", "* George Donnelly (American football) (born 1942), former American football player "]}, {"page": "2011–12 Macclesfield Town F.C. season", "response": ["|1 ||FW || ||9 ||George Donnelly || 6 || 1 || 0 || 0 || 7", "|9 || ||FW ||George Donnelly || 5 || 0 || 1 || 0 || 0 || 0 || 0 || 0 || 6 || 0", "| George Donnelly", "| George Donnelly", "| George Donnelly"]}, {"page": "2009–2011 International Challenge Trophy", "response": [" England C: Preston Edwards; Lee Vaughan, Connor Franklin (Matty Blair 65), Rob Atkinson, Max Porter, Michael Wilde (Josh Coulson 73), Andy Mangan, Danny Rose (Jack Byrne 81), George Donnelly, Josh Simpson (Reece Styche 71), Sean Clancy"]}, {"page": "List of Macclesfield Town F.C. seasons", "response": ["|bgcolor=\"#FFCCCC\"| Ben TomlinsonGeorge Donnelly"]}]}}