{"wiki_id": "http://www.wikidata.org/entity/Q5539316", "itemLabel": "George Fleming", "itemDescription": "Scottish footballer, born 1869", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Fleming_(footballer,_born_1869)", "wikipedia_page": {"main": "George Fleming (born 20 May 1869 in Bannockburn, Scotland) was a Scottish footballer who played as a defender for Liverpool in The Football League. Fleming started his career at East Stirlingshire, before he moved to Wolverhampton Wanderers, where he made 187 appearances for the club from 1894 to 1901. Fleming was transferred to Liverpool in 1901, he made 26 appearances in his debut season, which decreased the following seasons. He made more appearances in the 1905–06 season, but the following season he only appeared sporadically and eventually became the assistant trainer at Liverpool.", "link_mentions": [{"page": "1902 FA Cup Final", "response": ["In the second round on Saturday, 8 February, Southampton were drawn at home against the reigning Football League champions Liverpool, who had dropped into a mid-table position in the First Division. According to the Southampton trainer Bill Dawson, the match was \"the finest exhibition of football put up by (Southampton)\". Southampton won 4–1 with goals from Archie Turner (2), Joe Turner and Bert Lee. Liverpool's goal was scored by George Fleming."]}, {"page": "George Fleming", "response": ["George Fleming may refer to:", "* Sir George Fleming, 2nd Baronet (1667–1747), British churchman", "* George Fleming (American football) (born 1938), American football player and politician in Washington State", "* George Fleming (engineer), Scottish civil engineer", "* George Fleming (explorer) (1800?–1880?), African American explorer and trader", "* George Fleming (footballer, born 1859) (1859–1912), Scottish footballer (Everton)", "* George Fleming (footballer, born 1869) (1869–1922), Scottish footballer (Wolves, Liverpool)", "* George Fleming (footballer, born 1948), Scottish footballer (Hearts, Dundee United)", "* George Fleming (veterinarian) (1833–1901), Scottish veterinary surgeon", "* Julia Constance Fletcher or George Fleming (1853–1938), American writer", "* George Fleming Davis (1911–1945), US Navy officer and Medal of Honor recipient"]}, {"page": "1901–02 Southampton F.C. season", "response": ["Waiting for Southampton in the second round was a home tie against Liverpool, who had won the Football League First Division title the previous year. To prepare for the match against the champions, trainer Bill Dawson took the players to the Clump Inn at Chilworth where the players had the use of a field behind the inn. The match was played at The Dell only five days after the second replay against Spurs. Writing in 1924, Dawson said that the players ran out onto the pitch \"like a lot of kittens, full of life\" and that the match was \"the finest exhibition of football put up by the Saints\". Goals from Archie Turner (2), Joe Turner and the fit again Bert Lee saw off the League champions, who could only manage one goal in response, from George Fleming."]}, {"page": "George Fleming (footballer born 1869)", "response": ["#REDIRECT George Fleming (footballer, born 1869)"]}]}}