{"wiki_id": "http://www.wikidata.org/entity/Q55314975", "itemLabel": "Jenny Manson", "itemDescription": "British activist and author (born 1948)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jenny_Manson", "wikipedia_page": {"main": "Jenny Rachel Manson (née Salaman; born November 1948) is a British Jewish activist, author, former civil servant, former Labour Party councillor for Colindale on Barnet London Borough Council, and Co-Chair of Jewish Voice for Labour.", "link_mentions": [{"page": "Redcliffe N. Salaman", "response": ["Salaman's paternal granddaughter is Chair of Jewish Voice for Labour Jenny Manson."]}, {"page": "Raphael Salaman", "response": ["In 1933, Salaman married Miriam Polianowsky. The couple had one son and three daughters, including Jewish Voice for Labour Chair, Jenny Manson. Their family were the only Jewish family in the town and according to his daughter Jenny Manson \"the only family that voted Labour.\" He and his wife were Labour Party supporters and actively involved with CND, and Salaman used to get news from Amnesty and CND delivered."]}, {"page": "Endorsements in the 2015 Labour Party leadership election (UK)", "response": ["*Jenny Manson, former councillor for Colindale in Barnet "]}, {"page": "Antisemitism in the UK Labour Party", "response": ["In March 2018, the Board of Deputies of British Jews and the Jewish Leadership Council issued an open letter stating that Corbyn was \"repeatedly found alongside people with blatantly anti-Semitic views\", concluding that Corbyn \"cannot seriously contemplate anti-Semitism, because he is so ideologically fixed within a far-left worldview that is instinctively hostile to mainstream Jewish communities\". Following the open letter's publication accusing Corbyn of siding with antisemites \"again and again\", hundreds of people outside Parliament Square gathered to protest 'Enough is Enough' against antisemitism in the Labour Party, demanding that Corbyn do more to tackle anti-Jewish feeling in Labour Party ranks. Jewish Voice for Labour organised a smaller counter-demonstration. A Jewish Voice for Labour spokesman said after the event: \"There is a massive difference between saying that more needs to be done within the party and a demonstration like this which is implicitly trying to force him [Corbyn] out ... This protest is unnecessary, inflammatory and politicised.\" The organisation said in a statement that it was \"appalled\" by the Board of Deputies' letter. \"They do not represent us or the great majority of Jews in the party who share Jeremy Corbyn's vision for social justice and fairness. Jeremy's consistent commitment to anti-racism is all the more needed now.\" Jewish Voice for Labour's Chair Jenny Manson defended Corbyn on Daily Politics, saying he had taken \"enormously strong action\" to deal with the issue in his party."]}, {"page": "Jewish Voice for Labour", "response": ["JVL was inaugurated in July 2017, and Jenny Manson, an activist in Jews for Justice for Palestinians and former Labour councillor, was elected chair.", "Although JVL has been described as \"anti-Zionist\", Manson has said the organisation is \"not anti-Zionist\" and stated that it was \"an alternative voice for Jewish members of Labour\" who do not support the Jewish Labour Movement's (JLM) \"profoundly Zionist orientation\". JVL's information officer Jonathan Rosenhead shares the latter opinion. The organisation's Secretary, Glyn Secker, wrote that JVL has \"established a very different, authentic, radical, and socialist Jewish narrative to that promulgated by the Jewish Labour Movement and Labour Friends of Israel\". Wimborne-Idrissi wrote that one of JVL's roles \"is to clarify the distinction between Jew, Israeli and Zionist so that people are less likely to fall into antisemitic generalisation when talking about Israel's role in Palestine\", to offer \"an alternative to the JLM's pro-Israel agenda\" and that the JLM does not have \"the right to speak as the Jewish Labour Movement on behalf of all Jews in the Labour party\". Co-Chairs Jenny Manson and Leah Levane \"contend that the JLM cannot represent all Jewish members of the Labour Party when it is committed 'to promote the centrality of Israel in Jewish life' as well as the wider Jerusalem Programme of the World Zionist Organization\".", "JVL has challenged \"unjustified allegations of antisemitism\" which are \"used to undermine Jeremy Corbyn's leadership\". In March 2018, JVL organised a smaller counter-demonstration, attended by around 30 people, according to The Independent, at a protest against antisemitism in the Labour Party, held in Parliament Square, London. In a statement, JVL said it was \"appalled\" by the Board of Deputies of British Jews' letter and that \"They do not represent us or the great majority of Jews in the party who share Jeremy Corbyn's vision for social justice and fairness. Jeremy's consistent commitment to anti-racism is all the more needed now.\" Chair of JVL, Jenny Manson defended Corbyn on BBC's Daily Politics, saying Corbyn had taken \"enormously strong action\" to deal with the issue of anti-semitism in the Labour Party. In April, Manson appeared on BBC Radio 4's Today programme, and, referring to a survey conducted by the Campaign Against Antisemitism, said: \"Evidence, including very recent evidence, commissioned by a Jewish body suggests the very worst antisemitism is still on the right, on the far right and always has been\"."]}, {"page": "Working Definition of Antisemitism", "response": ["In August 2019, Tower Hamlets London Borough Council refused to host the fifth annual charity bike ride event in aid of Palestinian children in Gaza called BigRide4Palestine due to concerns that criticism of Israel would violate the IHRA working definition of antisemitism. Antony Lerman concluded that the working definition was an obstacle to constructive criticism of Israel. Twenty three signatories of an open letter to The Guardian stated that the council's refusal to host the charity event has vindicated concerns raised about the working definition and that it \"demonstrates that freedom of expression on Palestine in this country is now being suppressed\". The signatories included Geoffrey Bindman, Lindsey German, Nadia Hijab, Kate Hudson, Dr Ghada Karmi, Mike Leigh, Jenny Manson, Kika Markham, Karma Nabulsi, Clare Short, Norman Warner and Mark Serwotka."]}, {"page": "List of Somerville College, Oxford, people", "response": ["*Jenny Manson (1948), British Jewish activist, author, former civil servant, Labour Party councillor and Chair of Jewish Voice for Labour", "*Jenny Manson (1948), British Jewish activist, author, former civil servant, Labour Party councillor and Chair of Jewish Voice for Labour"]}, {"page": "Nina Salaman", "response": ["Salaman's children were  (1902–1994), pathologist and cancer researcher; Arthur Gabriel Salaman (1904–1964), general practitioner; Raphael Arthur Salaman (1906–1993), engineer; Ruth Isabelle Collet (1909–2001), painter and printmaker; and  (1914–2005), mezzo-soprano. A sixth child, Edward Michael, the twin brother of Arthur, died in 1913 at the age of 9. Salaman's granddaughter, Jenny Manson, is Chair of Jewish Voice for Labour."]}]}}