{"wiki_id": "http://www.wikidata.org/entity/Q5534739", "itemLabel": "Geoffrey Lees", "itemDescription": "English cricketer (1920-2012)", "wikipedia_url": "https://en.wikipedia.org/wiki/Geoffrey_Lees_(cricketer)", "wikipedia_page": {"main": "Geoffrey William Lees (1 July 1920 – 17 August 2012) was an English cricketer and school teacher. Lees was a right-handed batsman who bowled leg break. He was born at Chorlton-cum-Hardy, Lancashire, and was educated at the King's School, Rochester.\nWhile studying at Downing College, Cambridge, Lees made his first-class debut for Cambridge University against Essex at Fenner's. Cambridge University won the toss and elected to field, with Essex then making 224 all out in their first-innings. Cambridge University responded in their first-innings by making 299 all out, during which Lees was dismissed for 12 runs by David Gray. Cambridge University then made 275/5 declared in their second-innings, setting Cambridge University 201 for victory. In their second-innings chase, Lees was dismissed for a duck by Peter Smith, with the university reaching 134/7, at which point the match was declared a draw. He made a second first-class appearance in that season for the university against Middlesex at Fenner's. Middlesex won the toss and elected to bat first, making 283 all out, to which Cambridge University responded in their first-innings by making 217 all out, during which Lees was dismissed by Jim Sims for 15 runs. Middlesex then made 283/7 declared in their second-innings, which set the university a target of 350 for victory. However, in their second-innings chase they were dismissed for 291, with Lees being dismissed for a duck by Sims. Middlesex won the match by 58 runs.He later made a single first-class appearance for Sussex against Leicestershire in the 1951 County Championship at the County Ground, Hove. Sussex won the toss and elected to bat first, making 328 all out, with Lees being stumped for a single run off the bowling of Gerry Lester. Leicestershire then made 147 all out in their first-innings, with them being forced to follow-on in their second-innings, which saw them dismissed for 117. Sussex won the match by an innings and 64 runs.Outside of cricket he was a schoolmaster, teaching at Brighton College from 1948 to 1963 (where he was head of English and a day house housemaster) and later as the headmaster of St. Bees School from 1964 to 1980. Following his teaching career, he retired to Brighton with his wife, Joan, where he was again actively involved with Brighton College, serving for some time as a Governor of the College. He died following a prolonged illness at Royal Sussex County Hospital Brighton, Sussex, on 17 August 2012.", "link_mentions": [{"page": "1920 in the United Kingdom", "response": ["* 1 July – Geoffrey Lees, cricketer (died 2012)"]}, {"page": "King's School, Rochester", "response": ["*Geoffrey Lees, cricketer and educator"]}, {"page": "2012 in the United Kingdom", "response": ["**Geoffrey Lees, 92, cricketer and educator."]}, {"page": "Deaths in August 2012", "response": ["*Geoffrey Lees, 92, English cricketer and educator, prolonged illness."]}, {"page": "Lees (surname)", "response": ["*Geoffrey Lees (cricketer) (1920–2012), English cricketer", "*Geoffrey Lees (footballer) (1933–2019), English footballer"]}, {"page": "Geoffrey Lees", "response": ["Geoffrey Lees is the name of:", "*Geoffrey Lees (cricketer) (1920–2012), English cricketer"]}, {"page": "Geoffrey Lees (educator)", "response": ["#REDIRECTGeoffrey Lees (cricketer)"]}, {"page": "Geoff Lees (cricketer)", "response": ["#REDIRECTGeoffrey Lees (cricketer)"]}, {"page": "Geoff Lees (educator)", "response": ["#REDIRECTGeoffrey Lees (cricketer)"]}]}}