{"wiki_id": "http://www.wikidata.org/entity/Q5539744", "itemLabel": "George Glas", "itemDescription": "British sailor", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Glas", "wikipedia_page": {"main": "George Glas (1725 – 30 November 1765) was a Scottish seaman and merchant adventurer in West Africa.\nThe son of John Glas, the divine, Glas was born at Dundee in 1725, and is said to have been brought up as a surgeon. \nHe obtained command of a ship which traded between Brazil, the northwest coasts of Africa and the Canary Islands. \nDuring his voyages he discovered on the Western Sahara seaboard a river navigable for some distance inland, and here he proposed to found a trading station. \nThe exact spot is not known with certainty, but it is plausibly identified with Gueder, possibly the haven where the Spaniards had in the 15th and 16th centuries a fort called Santa Cruz de Mar Pequeña. Glas made an arrangement with the Lords of Trade whereby he was granted £15,000 if he obtained free cession of the port he had discovered to the British crown; the proposal was to be laid before Parliament in the session of 1765. \nHaving chartered a vessel, Glas, with his wife and daughter, sailed for Africa in 1764, reached his destination and made a treaty with the Moors of the district. He named his settlement Port Hillsborough, after Wills Hill, earl of Hillsborough (afterwards marquis of Downshire), president of the Board of Trade and Plantations (1763–1765). In November 1764, Glas and some companions, leaving his ship behind, went in the longboat to Lanzarote, intending to buy a small barque suitable for the navigation of the river on which was his settlement. From Lanzarote he forwarded to London the treaty he had concluded for the acquisition of Port Hillsborough. A few days later he was seized by the Spaniards, taken to Tenerife and imprisoned at Santa Cruz de Tenerife. In a letter to the Lords of Trade from Teneriffe, dated 15 December 1764, Glas said he believed the reason for his detention was the jealousy of the Spaniards at the settlement at Port Hillsborough because in a time of war the English might ruin their fishery and effectually stop the whole commerce of the Canary Islands.The Spaniards further looked upon the settlement as a step towards the conquest of the islands. They therefore contrived how to make out a claim to the port and forged old manuscripts to prove their assertion (Calendar of Home Office Papers, 1760-1765). In March 1765 the ships company at Port Hillsborough was attacked by the natives and several members of it killed. The survivors, including Mrs and Miss Glas, escaped to Tenerife. In October following, through the representations of the British government, Glas was released from prison. With his wife and child he set sail for England on board the barque Earl of Sandwich. On 30 November British mariners George Gidley, Richard\nSt. Quinton, Peter McKinlie and a Dutchman Andres Lukerman, who had learned that the ship contained much treasure, mutinied, killing the captain and passengers. Glas was stabbed to death, and his wife and daughter thrown overboard. (The murderers were afterwards captured and hanged at Dublin.) There is some evidence to suggest that R.S. Stevenson based his novel ‘Treasure Island’ in part on the murders of the Glas family. He grew up in the shadow of the Glasite church in Edinburgh. After the death of Glas the British Government appears to have taken no steps to carry out his project.In 1764, Glas published in London The History of the Discovery and Conquest of the Canary Islands, which he had translated from the manuscript of an Andalusian monk named Juan Abreu de Galindo, then recently discovered at La Palma. To this Glas added a description of the islands, a continuation of the history and an account of the manners, customs, trade, etc., of the inhabitants, displaying considerable knowledge of the archipelago.", "link_mentions": [{"page": "List of Scots", "response": ["* George Glas (1725–1765), adventurer, merchant and seaman who traded between Brazil, the Canary Islands and north-western Africa"]}, {"page": "November 30", "response": ["*1765 – George Glas, Scottish merchant and explorer (b. 1725)"]}, {"page": "1765", "response": ["* November 30 – George Glas, Scottish merchant and adventurer (b. 1725)"]}, {"page": "Treasure Island", "response": ["Historian Luis Junco suggests that Treasure Island is a combination of the story of the murder of Captain George Glas on board the Earl of Sandwich in 1765 and the taking of the ship Walrus off the island of La Graciosa near Tenerife. The pirates of La Graciosa buried their treasure there, and were subsequently all killed in a bloody battle with the British navy; the treasure was never recovered."]}, {"page": "El Hierro", "response": ["Nevertheless, the origin of the name ero or erro or yerro is not definitely known. It is thought to be derived from one of several words in the Guanche language of the pre-Hispanic inhabitants, known as Bimbaches.  Juan de Abreu Galindo (in a manuscript translated and published by George Glas in 1764) gives the native name of the island as Esero (or Eseró), meaning 'strong'."]}, {"page": "1765 in Great Britain", "response": ["* 30 November – George Glas, merchant and adventurer (born 1725)"]}, {"page": "Marmaduke Rawdon (antiquary)", "response": ["During his long residence at La Laguna in Gran Canaria Rawdon ascended Mount Teide. The route he took to the summit of the volcano was the same as that followed by George Glas a century later, and by Alexander von Humboldt."]}, {"page": "Glas (surname)", "response": ["*George Glas (1725–1765), Scottish mariner", "*George Glas Sandeman Carey (1867–1948), British army officer"]}, {"page": "Attacks on Fuerteventura in 1740", "response": ["The military commander of the island, Lieutenant Colonel José Sánchez Umpiérrez, and captain Melchor Cabrera Bethencourt led the militia against the invading British privateers. The defence of the island was both brutal and effective; of the 50 privateers, 30 were killed while 20 more were taken prisoner. The islanders, according to George Glas, attacked the invading English with clubs and stones. To shield themselves from the musket fire of the privateers, the locals hid behind a wall of camels. The prisoners were shipped to Tenerife.", "\"The natives, enraged to find the island disturbed again in so short a time, determined to give these second invaders no quarter..\" - George Glas: The History of the Discovery and Conquest of the Canary Islands. ", "*  The history of the discovery and conquest of the Canary islands. By Juan de Abreu y Galindo, George Glas"]}, {"page": "1765 in Scotland", "response": ["* 30 November – George Glas, merchant adventurer (born 1725; murdered at sea)"]}, {"page": "Glas, George", "response": ["#redirectGeorge Glas"]}]}}