{"wiki_id": "http://www.wikidata.org/entity/Q553549", "itemLabel": "Jason Koumas", "itemDescription": "Welsh footballer (born 1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jason_Koumas", "wikipedia_page": {"main": "Jason Koumas (born 25 September 1979) is a Welsh former professional footballer who played for Tranmere Rovers, Cardiff City, West Bromwich Albion and Wigan Athletic, as well as the Welsh national team.\nHe was selected in both the 2005–06 and 2006–07 Football League Championship team of the season.\nOn 12 May 2016, Leon Barton wrote in a long blog post for The Guardian that Koumas's talent - often described as \"mercurial\" - was no less than Steven Gerrard's, but that he had lacked the spirit and determination to succeed at the highest level.", "link_mentions": [{"page": "September 25", "response": ["*  1979   – Jason Koumas, Welsh footballer"]}, {"page": "West Bromwich Albion F.C.", "response": ["|2003|| Jason Koumas"]}, {"page": "Wrexham", "response": ["*Jason Koumas – former Wales international footballer"]}, {"page": "Wigan Athletic F.C.", "response": ["Wigan's third Premier League campaign saw changes in the squad, with Titus Bramble, Mario Melchiot, Jason Koumas and Marcus Bent among the players brought in, and Melchiot was installed as the new club captain.  The 2007–08 season began well for Wigan, with Emile Heskey recalled to the England squad, as the first Wigan player to represent England whilst a full member of the club. However, he broke his foot immediately after his England call-up and was out injured for six weeks. The club's league position subsequently worsened, and on the back of a run of six consecutive defeats, Wigan fell into the relegation zone. Whelan took the decision to sack Hutchings on 5 November 2007, after 12 games in charge, reinstating Bruce, who saved the club from relegation."]}, {"page": "Swansea City A.F.C.", "response": ["The Liberty Stadium capacity was 20,532 though has been increased to 20,750. The highest attendance recorded at the stadium came against Arsenal on 31 October 2015 with 20,937 spectators, beating the previous record of 20,845. The stadium has also hosted three Welsh international football matches; the first being a 0–0 draw with Bulgaria in 2006, the second a 2–1 defeat to Georgia in 2008 and a 2–0 win over Switzerland on 7 October 2011. The first international goal to be scored at the Liberty Stadium was a 25-yard effort from Welsh international Jason Koumas."]}, {"page": "2002–03 in English football", "response": ["*29 August 2002 – Lee Hughes rejoins West Bromwich Albion for £2.5million after a year at Coventry City, and is joined for £2.25million by Tranmere Rovers midfielder Jason Koumas."]}, {"page": "2006–07 in English football", "response": ["| December || Sam AllardyceBolton Wanderers || Cristiano RonaldoManchester United || Steve BruceBirmingham CityBoss Bruce scoops monthly prize BBC Sport. Retrieved 24 March 2007 || Jason KoumasWest Bromwich Albion || Simon GraysonBlackpoolGrayson collects monthly accolade BBC Sport. Retrieved 24 March 2007 || Paul HeffernanDoncaster Rovers || Paul InceMacclesfield TownInce captures award for December BBC Sport. Retrieved 24 March 2007 || Dimitrios KonstantopoulosHartlepool United"]}, {"page": "Tony Mowbray", "response": ["High-profile players such as Jason Koumas, Diomansy Kamara and Curtis Davies were sold to Premier League clubs for large fees, in addition to the departures of Paul McShane, Nathan Ellington, Darren Carter and Steve Watson. Mowbray replaced them by signing a total of 14 permanent and loan players in the summer transfer window, making an overall profit in the process. His most expensive signings were Chris Brunt from Sheffield Wednesday for £3 million, Leon Barnett from Luton Town for £2.5 million, and James Morrison from Middlesbrough for £1.5 million."]}, {"page": "Charles N'Zogbia", "response": ["In May 2010, Birmingham City had a reported £8m bid for the player rejected.Wigan reject N'Zogbia bid Sky Sports, 17 May 2010 On 27 August, Wigan confirmed their acceptance of a further bid, \"believed to be in the region of £9 million\", and the player was given permission to speak to Birmingham City. The move fell through however after N'Zogbia and Birmingham failed to agree personal terms. N'Zogbia was given the number 10 shirt for the 2010–11 season after Jason Koumas moved on loan to Cardiff City. N'Zogbia played a vital role in keeping Wigan in the Premier League at the end of the 2010–11 season, scoring five goals in the last six games of the season, including an injury time winner against West Ham United to win the game 3–2. He finished the season as the club's top goal scorer, with 10 goals in all competitions. Speculation grew over the summer that N'Zogbia would leave Wigan during the transfer window. Many clubs declared an interest in the winger including: Aston Villa, Liverpool, Newcastle United and Sunderland. Despite Wigan manager Roberto Martínez stating that the club would not be selling their top players, chairman Dave Whelan later said that Wigan 'would have to sell N'Zogbia' because he was in the last year of his contract.The Daily Telegraph"]}, {"page": "Joe Ledley", "response": ["The January transfer window saw increased speculation about Ledley's future and Cardiff City turned down two bids from Premier League sides West Ham United, who saw an offer of £5m turned down,\"Cardiff City reject 5m West Ham bid for Joe Ledley\" South Wales Echo, 26 January 2009; Retrieved 26 January 2009 and Wigan Athletic, who had a bid of £4m and former Cardiff player and Wales international Jason Koumas rejected.\"Cardiff City turn down Koumas swap with Ledley\" South Wales Echo, 27 January 2009; Retrieved 5 February 2009 He remained captain of the side for the rest of the season and at the end of the year was included in the 2008–09 Championship Team of the Year, along with teammate Roger Johnson.\"Championship team of the year\"  Football League, 27 April 2009; Retrieved 27 April 2009"]}]}}