{"wiki_id": "http://www.wikidata.org/entity/Q5537844", "itemLabel": "George Chatterton-Hill", "itemDescription": "Irish philosopher", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Chatterton-Hill", "wikipedia_page": {"main": "George Chatterton-Hill (1883–1947) was the Irish writer of several books on evolution and sociology. He wrote at the start of the 20th century, when the rediscovery of Gregor Mendel's work, had created turmoil over Charles Darwin's theory of evolution by natural selection. He was also very influenced by the writings of Herbert Spencer regarding evolution and society, and of Benjamin Kidd regarding society and religion.\nHe emphasises the impossibility of liberalism, which recommends individual freedom insofar as it does not restrict the individual freedom of others. The objection, he says, is that it is inconsistent with competition. Liberalism, he says, is not possible in the context of evolutionary theory, given man's ceaseless urge for expansion which conflicts with the idea of equality for all. In reality, he claims, the superior group or class always oppresses the inferior masses, who eventually revolt. All revolutions result simply in the replacement of the ruling class by a new ruling class. He refers to the German concept of Rechtsstaat, and his ideas reflect the prominence of social Darwinism of the time. \nChatterton-Hill spent World War I in Germany out of Irish nationalist sentiment and corresponded with Roger Casement. He was said to have worked for German politician Matthias Erzberger as his private secretary according to Charles Curry's book and described there also as \"born in Ceylon of an Irish father and native mother but never to have put foot on Irish soil\".\"He was ... married to a German lady, and lived in Germany for some time prior to the outbreak of [the Second World War]. When war broke out he was actually in hospital, suffering very acutely. He was allowed out of hospital by the Germans in January or February, 1940, but was immediately put into a concentration camp, where he was labelled as an undesirable alien. He was kept there until January, 1941, when, on account of the very extreme state into which his health had got, ... it was thought that he would be better outside than in. He had no means of earning his livelihood, and engaged himself in translating the British news into German for the Germans in Berlin. This, presumably, went on, ... until the end of the war when [the British] arrived in Berlin.Chatterton-Hill died on 12 January 1947. His German wife was airlifted to the United Kingdom on 19 February 1947 sent to a hostel in Renfrewshire and given an ex gratia payment of £1,084 which enabled her to have an income of a 35s. a week annuity.", "link_mentions": [{"page": "George Hill", "response": ["* George Chatterton-Hill (1883–1947), Irish author of books on evolution and sociology"]}, {"page": "Richard Stokes (politician)", "response": ["Stokes won the Ipswich seat in a 1938 by-election, which he kept in the 1945, 1950, 1951 and 1955 elections. He was known for his independence in parliament, including, with Bishop George Bell and fellow Labour Member of Parliament (MP) Alfred Salter, opposing area strategic bombing during World War II. Stokes was also a prominent critic of the inadequacy of Allied tank design. Prior to the war, he co-wrote a paper (with Andrew MacLaren and George Lansbury) analysing the economic forces menacing peace in Europe. After the RAF's bombing of Dresden on the night of 13 February and the early hours of 14 February 1945, his questions in the House about the act were in part responsible for the reappraisal of the Government's bombing policy in the last month of the war in Europe. He raised other issues after the war relating to Yalta and the forced repatriation of Yugoslavs, and the treatment of Dr George Chatterton-Hill in Germany."]}, {"page": "Benjamin Kidd", "response": ["*George Chatterton-Hill"]}, {"page": "1947 in philosophy", "response": ["* January 12 - George Chatterton-Hill (born 1883)"]}, {"page": "2018 in public domain", "response": ["| George Chatterton-Hill"]}, {"page": "Chatterton-Hill, George", "response": ["#redirectGeorge Chatterton-Hill"]}]}}