{"wiki_id": "http://www.wikidata.org/entity/Q5534256", "itemLabel": "Geoff Parling", "itemDescription": "English rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Geoff_Parling", "wikipedia_page": {"main": "Geoff Parling (born 28 October 1983) is an English rugby union coach and former player. His usual playing position was lock.\nHe played for Newcastle Falcons, Leicester Tigers and Exeter Chiefs in Premiership Rugby, he won three English titles as a player, two with Leicester in 2010 and 2013 then again with Exeter in 2017.  He played in Japan for Munakata Sanix Blues and for Melbourne Rebels in Super Rugby.  \nHe won 29 caps for England, appearing at the 2015 Rugby World Cup and won three caps for the British & Irish Lions on the 2013 tour to Australia.\nSince retiring from playing Parling has been a forwards coach, including for the Australia national team.", "link_mentions": [{"page": "Leicester Tigers", "response": ["2013: Ben Youngs†, Tom Youngs, Manu Tuilagi, Geoff Parling"]}, {"page": "Stockton-on-Tees", "response": ["* Geoff Parling, England and British Lions rugby player"]}, {"page": "Newcastle Falcons", "response": ["In November 2008 Chairman Dave Thompson put an end to speculation of a takeover of the club after rejecting three bids. He held talks with a number of different consortia and reportedly turned down one offer of a full take over as the bidding consortium wanted to relocate the club to Darlington. Furthermore, he said the speculation had led to instability in the club which was unsettling players and fans alike. On the pitch the Falcons reached another European Challenge Cup quarter-final going down to Saracens away from home and finished 10th in the Premiership.  This season marked the end of an era as legendary fly-half Jonny Wilkinson left the club for RC Toulonnais.  England under-20s fly-half Rory Clegg also left for Harlequins as Jimmy Gopperth was signed as replacement fly-half.  The loss of Wilkinson was compounded by the departure of future British and Irish Lions star Geoff Parling who continued the outflow of talent, leaving for Leicester Tigers.  Another trio who would go on to achieve England honours in Phil Dowson, Dave Wilson and Tom May also left for Northampton Saints, Bath Rugby and RC Toulonnais respectively."]}, {"page": "Japan Rugby League One", "response": ["|  Geoff Parling (2017–2018) ||– 2012 British and Irish Lions"]}, {"page": "Durham School", "response": ["* Geoff Parling, Premiership and International Rugby Player (Leicester Tigers, England, British and Irish Lions)"]}, {"page": "Beard Liberation Front", "response": ["In 2013 Gareth Malone won the Beard of the Year. He beat John Hurt, Geoff Parling, and Jeremy Paxman, who made it to the shortlist, but fell outside the top 3, despite having one of the most discussed beards of 2013."]}, {"page": "Melbourne Rebels", "response": ["2018 saw great change for the Rebels, as 28 players departed the Rebels and 20 new players debuted, 12 of them new signings from the now defunct Force. David Wessels was appointed the new coach, moving from the Force, and major signings were made in Australian international scrum-half Will Genia, Australian international lock Adam Coleman and former England and British and Irish Lion Geoff Parling. On the field the Rebels made a significant improvement winning 4 of their first 5 matches, although they would only win 3 more narrowly missing out of their first appearance in the Super Rugby playoffs. Jack Maddocks finished the season as the Rebels top try scorer with 9 tries, including the first ever Rebels hat-trick in Week 3 against the Sunwolves, while Reece Hodge overtook Jason Woodward as the Rebels leading points scorer, with his 117 points in the season putting him on 298 points total for the Rebels. The season though ended on a sour note for the Rebels as disciplinary problems involving players Amanaki Mafi and Lopeti Timani before a nightclub incident involving Hunter Paisami led to an integrity review being ordered by the Rebels.", "2019 was much similar to 2018 for the Rebels as they just missed out of the playoffs again, finishing with 7 wins and 9 losses in 11th overall. Further Wallaby additions were made in the off season in former Reds fly-half Quade Cooper, while Luke Jones and Matt To'omua returned to Australia from Europe to join the Rebels. Foundation Rebel Laurie Weeks announced his retirement just before the season finishing with 85 caps for the club, while Geoff Parling retired and joined the coaching staff. Jack Maddocks would finish the season as top try scorer with 10 tries, while Tom English became the most capped player for the club, ending the season on 94 caps. The Rebels season though petering out for the second season in succession, having started with 5 wins from 7 games, caused concern leading to a comprehensive on-field review being held at the end of the season.", "* Assistant coach (Forwards): Geoff Parling"]}, {"page": "List of Old Dunelmians", "response": ["* Geoff Parling, Leicester Tigers RFC, England, British and Irish Lions (Tour of Australia 2013)."]}, {"page": "Ian Ramsey Church of England Academy", "response": ["* Geoff Parling — Leicester Tigers rugby union club and England player"]}]}}