{"wiki_id": "http://www.wikidata.org/entity/Q5538796", "itemLabel": "George E. Studdy", "itemDescription": "British illustrator and cartoonist", "wikipedia_url": "https://en.wikipedia.org/wiki/George_E._Studdy", "wikipedia_page": {"main": "George Ernest Studdy (Devonport, 23 June 1878 – 25 July 1948) was a British commercial artist. He is best remembered for his creation of Bonzo the dog, a fictional character in the early 1920s that first appeared in The Sketch Magazine.", "link_mentions": [{"page": "Powel Crosley Jr.", "response": ["In 1925 Crosley introduced another low-cost radio set. The small, one-tube, regenerative radio was called the \"Crosley Pup\" and sold for $9.75. While Victor had Nipper, its famous trademark showing a dog listening to \"his master's voice\" from a phonograph, Crosley adopted a mascot in the form of a dog with headphones listening to a Crosley Pup radioA cute, pudgy little dog named Bonzo, the creation of British artist George E. Studdy, became the inspiration for a variety of commercial merchandise, such as toys, ashtrays, pincushions, trinket boxes, car mascots, jigsaw puzzles, books, calendars, candies, and postcards. The headphone-wearing Bonzo was also associated with the Crosley Pup radios. See "]}, {"page": "The Illustrated London News", "response": ["Illustrators, artists, and photographers included Edward Duncan, Bruce Bairnsfather, H. M. Bateman, Edmund Blampied, Mabel Lucie Attwell, E. H. Shepherd, Kate Greenaway, John Proctor, W. Heath Robinson and his brother Charles Robinson, Rebecca Solomon, George E. Studdy, David Wright, Melton Prior, William Simpson, Frederic Villiers, H. C. Seppings-Wright, Myles Birket Foster, Frank Reynolds, Lawson Wood, C. E. Turner, R. Caton Woodville Jr, A. Forestier, Fortunino Matania, Christina Broom, Louis Wain, J. Segrelles, and Frank Vizetelly."]}, {"page": "Heatherley School of Fine Art", "response": ["* George E. Studdy"]}, {"page": "The Sketch", "response": ["The magazine is remembered for first publishing the illustrations of Bonzo the dog by George E. Studdy (from 1921). It featured series of short stories within its pages, one per issue, with authors such as Walter de la Mare and Algernon Blackwood. Under the editorship of Bruce Ingram, it was also the first magazine to publish short stories by Agatha Christie, starting with \"The Affair at the Victory Ball\" in issue 1571 on 7 March 1923. Altogether, Christie wrote 49 stories for The Sketch between 1923 and 1924 (just under a third of her total output of short stories) which were later collected into some or all of the contents of the volumes Poirot Investigates (1924), The Big Four (1927), Partners in Crime (1929), Poirot's Early Cases (1974), and While the Light Lasts and Other Stories (1997). Christie dedicated the 1953 novel A Pocket Full of Rye to Ingram."]}, {"page": "Brian White (cartoonist)", "response": ["Early in his career he forged links with Sid Griffiths, who had developed Jerry the Tyke and brought in White who had been one of the team of animators on the 1924 film of George E. Studdy's character Bonzo the dog.Gifford, Denis British Animated Films 1895-1985 A Filmography They latterly formed the company Griffiths and White in 1929, working from an office in the Charing Cross Road, London, initially producing animated advertisements for Superads where Carl Giles was first employed. Griffiths and White continued throughout the 1930s, eventually working at Anson Dyer's Anglia Films Stroud-based studio which was later taken over by Halas & Batchelor for the development of Animal Farm."]}, {"page": "George Ernest Studdy", "response": ["#REDIRECT George E. Studdy"]}, {"page": "George Studdy", "response": ["#REDIRECT George E. Studdy"]}, {"page": "William Frank Calderon", "response": ["When fourteen, Calderon was awarded the Trevelyan Goodall Scholarship and later a scholarship to the Slade School under Professor Alphonse Legros. He and Charles Edward Johnson, a landscape artist, started the School of Animal Painting at 54 Baker Street, London in April 1895; Calderon acted as principal until 1916. Some of their students were Cecil Aldin, Lionel Edwards, Alfred Munnings, Lady Helena Gleichen, Frederic Whiting and George E. Studdy. He exhibited at the Royal Academy from 1881–1921, and had his first Royal Academy painting bought by Queen Victoria. His 1936 book Animal Painting and Anatomy is still considered a useful reference source. He illustrated numerous books such as \"The Most Delectable History of Reynard The Fox\" edited by Joseph Jacobs and published by Macmillan in 1895. The cover, designed by A. A. Turbayne, was gold-blocked in art nouveau style and inspired designers to create work using \"asymmetrical designs, sinuous curves, and simplified shapes with minimal shading.\""]}, {"page": "G. E. Studdy", "response": ["#REDIRECT George E. Studdy"]}, {"page": "List of fictional dogs in comics", "response": ["| George E. Studdy"]}]}}