{"wiki_id": "http://www.wikidata.org/entity/Q5539909", "itemLabel": "George Grey, 6th Earl of Stamford", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Grey,_6th_Earl_of_Stamford", "wikipedia_page": {"main": "George Harry Booth-Grey, 6th Earl of Stamford and 2nd Earl of Warrington (31 October 1765 – 26 April 1845), styled Lord Grey from 1768 to 1819, was a British peer and parliamentarian.\nBooth-Grey was the eldest son of George Grey, 5th Earl of Stamford and his wife, Henrietta Cavendish Bentinck.\nHe was educated at Winchester College and Trinity College, Cambridge. From 1790 to 1796, he was the Whig Member of Parliament for Aldeburgh. He contested both Grampound and St Germans, losing the former but representing the latter from 1796 to 1802.\nIn 1819 he succeeded his father as Earl of Stamford and Warrington, inheriting the family estates at Enville, Staffordshire, Bradgate Park in Leicestershire, Dunham Massey in Cheshire and Stalybridge in Lancashire. He was appointed Lord Lieutenant of Cheshire in 1819, and in 1827, succeeded George Cholmondeley, 1st Marquess of Cholmondeley as Vice-Admiral and Chamberlain of the county.\nOn 23 December 1797, Grey married Henrietta Charlotte Charteris, sister of Francis Douglas, 8th Earl of Wemyss.\nThey lived at Enville Hall, the family seat, and had four surviving children:\n\nGeorge Harry (1802–1835), later Baron Grey of Groby by writ of acceleration, married Catherine Charteris Wemyss in 1824, and had:\nGeorge Harry Booth-Grey, his successor\nMargaret Henrietta Maria (1825–1852), married Henry John Milbank\nHenrietta Charlotte (1799–1866), married James Thomas Law (a priest; son of George Henry Law, Bishop of Chester and of Bath and Wells)\nJane (1803–1877), married John Walsh (later Baron Ormathwaite).On Stamford's death at Enville Hall in 1845, his senior titles devolved upon his grandson, George Grey who succeeded as the 7th and 3rd Earl, since his father who was summoned as the 8th Baron Grey of Groby in 1832 had predeceased him in 1835.", "link_mentions": {}}}