{"wiki_id": "http://www.wikidata.org/entity/Q5548291", "itemLabel": "Georgina Reilly", "itemDescription": "Canadian film and television actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Georgina_Reilly", "wikipedia_page": {"main": "Georgina Reilly (born February 12, 1986) is a Canadian film and television actress best known to date for her roles in the films Pontypool and This Movie Is Broken, the television series The L.A. Complex and Murdoch Mysteries, and the CBC Radio drama series Trust Inc.", "link_mentions": [{"page": "Havergal College", "response": ["*Georgina Reilly 1986 – actress"]}, {"page": "Tommy Reilly (harmonica player)", "response": ["Tommy Reilly died aged 81 in Frensham, Surrey. His granddaughter Georgina Reilly is a Canadian film and television actor. Larry Adler admitted in The Guardian obituary of Tommy that \"He never even had a close second\"."]}, {"page": "List of fictional medical examiners", "response": ["|Dr. Emily Grace || Georgina Reilly"]}, {"page": "Murdoch Mysteries", "response": ["Detective Murdoch is assisted by the three other main characters: Inspector Brackenreid (Thomas Craig), Doctor Julia Ogden (Hélène Joy), and the inexperienced but eager Constable George Crabtree (Jonny Harris), who aspires to be a mystery novel writer. Brackenreid, Murdoch's immediate superior, is a blunt and sceptical Yorkshireman with a fondness for whisky who prefers conventional methods of detection over Murdoch's eccentric methods, though he is typically pleased and proud when Murdoch is successful despite the odds. Crabtree is often unable to grasp the more advanced methods, but his enthusiasm and loyalty make him a good assistant. Like Crabtree, Dr. Ogden is a great supporter of Murdoch's methods. Her skill in pathology usually helps by revealing a great deal of useful evidence to aid Murdoch in solving cases. Throughout the series, Murdoch's growing infatuation with her, and his inability to express his feelings, provide a light subplot. In the fifth season, after Dr. Ogden is married to Dr. Darcy Garland (a colleague she met in Buffalo), a new doctor is introduced, Doctor Emily Grace (Georgina Reilly). She and George Crabtree show some romantic interest in each other."]}, {"page": "List of Canadian actors", "response": ["*Georgina Reilly"]}, {"page": "Georgina (name)", "response": ["*Georgina Reilly (born 1986), Canadian actress"]}, {"page": "List of Murdoch Mysteries episodes", "response": ["Georgina Reilly (Dr. Emily Grace) was promoted to series regular for the sixth season."]}, {"page": "This Movie Is Broken", "response": ["This Movie Is Broken is a 2010 Canadian film directed by Bruce McDonald. A cross between a romantic comedy and a concert film, the film stars Greg Calderone as Bruno, a young man hoping to convince his longtime crush Caroline (Georgina Reilly) to become his girlfriend by taking her to a Broken Social Scene concert at Harbourfront.\"Review: This Movie Is Broken\". CBC News, June 17, 2010.", "*Georgina Reilly as Caroline"]}, {"page": "List of Murdoch Mysteries characters", "response": ["| style=\"text-align:center;\"| Georgina Reilly", "thumb|left|100px|Georgina Reilly", "Portrayed by Georgina Reilly, Emily Grace is the new coroner who joins the morgue in season 5 as Dr. Ogden leaves to set up her private practice. Initially described as Dr. Ogden's protégée, Dr. Grace is a trained medical doctor but admits she prefers pathology because she has little patience to maintain a good bedside manner. She is interested in spiritualism, believing that it is compatible with scientific study. Though eager and impatient, she quickly learns the rules of the station house and proves to be a highly competent coroner to Murdoch in his investigations."]}, {"page": "The L.A. Complex", "response": ["* Georgina Reilly as Sabrina Reynolds (season 2; guest star season 1), a ruthless and intelligent comedian, who acts as a rival to Nick for the entire duration of the series. She is the only main character who is born and raised in Los Angeles."]}, {"page": "Trust Inc.", "response": ["Trust Inc. was a Canadian radio drama series on CBC Radio One and online at CBC.ca, about a Toronto based public relations firm, starring Julie Khaner as Catherine Leger, Georgina Reilly as Serena Jordan, Elias Toufexis as Ricardo Sandoval, Matt Austin Sadowski as Ben Lederman, Thomas Michael as Marshall Whitman, and Keon Mohajeri as Parvinder Singh-Donnelly. The program was designed for both conventional broadcast and as an interactive program. The online component featured character Tweets, blogs and vlogs, YouTube video, Twitter contests and fan fiction."]}, {"page": "List of Canadian films of 2010", "response": ["| This Movie Is Broken || Bruce McDonald || Greg Calderone, Georgina Reilly|| Romantic comedy/concert film || Featuring the Broken Social Scene "]}, {"page": "List of bisexual characters in television", "response": ["|Dr. Emily Grace || Georgina Reilly ||Murdoch Mysteries || Emily had relationships with male characters (most notably, George Crabtree and Leslie Garland). In Season 8 episode \"High Voltage\", she meets suffragette Lillian Moss. Emily falls in love with her and has a romantic relationship with Lillian."]}, {"page": "Except the Dying (novel)", "response": ["The novel was adapted into a 2004 television film of the same name starring Peter Outerbridge as Detective Murdoch. In 2008, Murdoch Mysteries was made into an ongoing television series starring Yannick Bisson, Helene Joy, Jonny Harris, Thomas Craig and Georgina Reilly."]}, {"page": "Mark O'Brien (actor)", "response": ["O'Brien married fellow CBC network star Georgina Reilly on January 6, 2013, after having met on the set of Republic of Doyle in 2011."]}, {"page": "City on a Hill (TV series)", "response": ["* Georgina Reilly as Corie Struthers"]}, {"page": "There's... Johnny!", "response": ["* Georgina Reilly as Sarah (\"Take Me to Church\")"]}, {"page": "Goalie (film)", "response": ["*Georgina Reilly as Pat (Morey/Sawchuk)"]}, {"page": "The Baker and the Beauty (American TV series)", "response": ["* Georgina Reilly as Piper, Noa's best friend and part of her entourage, who supports Noa's and Daniel's relationship.", "In February 2019, it was announced that Carlos Gomez, Lisa Vidal and Dan Bucatinsky had been cast in the pilot's lead roles. Alongside the pilot's order announcement, in March 2019 it was reported that Nathalie Kelley, Victor Rasuk, Michelle Veintimilla and David Del Rio had joined the cast. In September 2019, Georgina Reilly was cast in a recurring role."]}, {"page": "List of dramatic television series with LGBT characters: 1960s–2000s", "response": ["|Murdoch Mysteries || CBC || Dr. Emily Grace || Georgina Reilly || Emily is bisexual. She was in a relationship with George Crabtree and dated Leslie Garland. In Season 8 episode \"High Voltage\", she meets suffragette Lillian Moss; and thereafter falls in love with her. || 2008–"]}]}}