{"wiki_id": "http://www.wikidata.org/entity/Q5544842", "itemLabel": "George Stevenson", "itemDescription": "English cricketer (1876-1938)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Stevenson_(cricketer)", "wikipedia_page": {"main": "George Stevenson should not be confused with Bob Stephenson, real name George Stephenson, former Derbyshire and Hampshire cricketer.\n\nGeorge Stanley Stevenson (20 July 1876 — 25 July 1938) was an English cricketer who played first-class cricket for Derbyshire in 1904.\nStevenson was born in Derby, the son of James Henry Stevenson, an ironmonger, and his wife Elizabeth. He made his debut for Derbyshire in the 1904 season in a first-class match in May against London County captained by WG Grace. In the match, he made his top score of 9 and took a wicket. Stevenson's only County Championship match came against Essex a month later, in which he bowled economically without taking a wicket and made zero and 1 from the tailend.\nStevenson was a left-handed batsman who played 4 innings in 2 first-class matches with an average of 2.50 and a top score of 9. He was a left-arm fast-medium bowler and took 1 first-class wicket at an average of 92.00.Stevenson died in Fritchley, Derbyshire at the age of 62.", "link_mentions": [{"page": "George Stevenson", "response": ["George Stevenson may refer to:", "* George Stevenson (Australian politician) (1839–1893), South Australian MHA; journalist in SA and New South Wales", "* George Stevenson (British politician) (born 1938), Labour Party politician in the United Kingdom", "* George Stevenson (cricketer) (1876–1938), English cricketer", "* George Stevenson (editor) (1799–1856), South Australian pioneer newspaper editor, secretary to Governor Hindmarsh", "* George Stevenson (footballer) (1905–1990), Scottish football player and manager (Motherwell)", "* George Stevenson (Texas politician) in the Twenty-first Texas Legislature", "* George Stevenson (priest) (1763–1825), an Anglican priest in Ireland", "* George Stevenson (rugby union) (1933-2012), a Scotland international rugby union player"]}, {"page": "Derbyshire County Cricket Club in 1904", "response": ["George Stevenson was the only new player in the season and played his only two matches for the club in the year."]}, {"page": "George Stanley Stevenson", "response": ["#REDIRECT George Stevenson (cricketer) "]}]}}