{"wiki_id": "http://www.wikidata.org/entity/Q5548803", "itemLabel": "Geraint Davies", "itemDescription": "Welsh rugby union and rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Geraint_Davies_(rugby_league)", "wikipedia_page": {"main": "Geraint Rhys Davies, (born 7 March 1986) is a Welsh former professional rugby league and rugby union footballer who played in the 2000s and 2010s. He played representative level rugby league (RL) for Wales, and at club level in Super League for the Crusaders, on loan from the Crusaders at South Wales Scorpions and the Limoux Grizzlies as a second-row or loose forward, and played club level rugby union (RU) for Llanelli Scarlets (Academy). He is also known as “the Welsh Phil Mitchell”, and claimed this title when he lost in a 100m race to Steve McFadden during a charity event in Hendy park where Geraint used to conduct his sprint training.", "link_mentions": [{"page": "Geraint Davies", "response": ["Geraint Davies may refer to:", "* Geraint Davies (Labour politician) (born 1960), incumbent British Labour-Cooperative Member of Parliament for Swansea West; former British Labour Member of Parliament for Croydon Central", "* Geraint Davies (Plaid Cymru politician) (born 1948), Plaid Cymru former member of the Welsh Assembly", "* Geraint Davies (rugby league) (born 1986), Welsh rugby league footballer"]}, {"page": "Geraint Davies (rugby footballer)", "response": ["#REDIRECT Geraint Davies (rugby league)"]}, {"page": "2009 European Cup", "response": ["|Celtic Crusaders||Ashley Bateman, Chris Beasley, Neil Budworth, Geraint Davies, Gil Dudson, Ben Flower (Captain), Jordan James, Elliot Kear, Lewis Mills, Ross Wardle, Lloyd White and Lee Williams"]}, {"page": "2006 Celtic Crusaders season", "response": ["|Geraint Davies || 7/3/86 || 29 || 6 || 0 || 0 || 24", "|9/4/06|| Workington || A || Won || 18-50 || 6-28 || Quinn (2), Young (16), Duggan (23,39,78), M. Ryan (33), Epton (57), Barton (60), De Chenu (63) || Quinn 7/9 || N/A || 744 || Tony Duggan, Carl De Chunu, Geraint Davies, Grant Epton, Paul Morgan, Luke Young, Jace Van Dijk, Ryan Barton, Michael Ryan, Phil Cushion, Karl Hocking, Damien Quinn, Dean Fitzgerald || David Simm (Not Used), Dean Scully, Shawn Van Rensburg, Anthony Seibold ||-", "|30/4/06 || Barrow || A || Lost || 32-16 || 20-0 || Duggan (57), Morgan (70), Simm (79) || Quinn 2/3 || N/A || 979 || Tony Duggan, Lenny Woodard, Dean Scully, Geraint Davies, Paul Morgan, Luke Young, Damien Quinn, Ryan Barton, Michael Hook, Phil Cushion, Karl Hocking, Shawn Van Rensburg, David Simm || Kevin Ellis, Hywel Davies, Matt Jobson, Anthony Seibold ||-", "|7/5/06 || Hunslet || H || Won || 36-18 || 30-6 || Jobson (1), Young (6), M. Ryan (8,50), Hocking (24), Duggan (38) || Quinn 6/6 || N/A || 415 (at Talbot Athletic Ground || Michael Hook, Carl De Chunu, Dean Fitzgerald, Damien Quinn, Paul Morgan, Luke Young, Tony Duggan, Ryan Barton, Micheal Ryan, Phil Cushion, Shawn Van Rensburg, Matt Jobson, Geraint Davies || Karl Hocking, Steve Brown, Hywel Davies, Anthony Seibold ||-", "|14/5/06 || Keighley || A || Drawn || 30-30 || 12-22 || De Chenu (2,58), Duggan (8), Jobson (23), Seibold (30), M. Ryan (50) || Quinn 3/6 || N/A || 754 || Micheal Hook, Carl De Chenu, Dean Fitzgerald, Damien Quinn, Paul Morgan, Luke Young, Tony Duggan, Ryan Barton, Michael Ryan, Phil Cushion, Shawn Van Rensburg, Matt Jobson, Geraint Davies || David Simm, Dean Scully, Hywel Davies, Anthony Seibold ||- ", "|21/5/06 || Blackpool || H || Won || 52-16 || 28-12 || Jobson (2,25), De Chenu (18), Young (27), M. Ryan (35,45), Duggan (49,55), Hook (58) || Quinn 8/9 || N/A || 323 || Tony Duggan, Carl De Chenu, Dean Fitzgerald, Damien Quinn, Richard Johnston, Luke Young, Jace Van Dijk, Ryan Barton, Michael Ryan, Karl Hocking, David Simm, Matt Jobson, Geraint Davies || Carle Ellis, Dean Scully, Hywel Davies, Michael Hook ||-", "|28/5/06 || Dewsbury || A || Lost || 42-4 || 18-0 || H. Davies (62) || Quinn 0/1 || N/A || 967 || Tony Duggan, Carl De Chenu, Dean Fitzgerald, Damien Quinn, Paul Morgan, Luke Young, Jace Van Dijk, Ryan Barton, Michael Ryan, Hywel Davies, Shawn Van Rensburg, Matt Jobson, Geraint Davies || Dean Scully, David Simm, Karl Hocking, Michael Hook ||-", "|4/6/06 || Keighley || H || Won || 58-18 || 36-0 || Jobson (4,18,62), Van Dijk (20), Morgan (24,75), Barton (25,41), Duggan (34,52), Quinn (46) || Quinn 7/11 || N/A || 600 (at Old Parish, Maesteg) || Richard Johnston, Car De Chenu, Geraint Davies, Damien Quinn, Paul Morgan, Luke Young, Jace Van Dijk, Hywel Davies, Tony Duggan, Phil Cushion, Shawn Van Rensburg, Matt Jobson, Ryan Barton || Lee Jones, Carle Ellis, Karl Hocking, Michael Hook ||-", "|11/6/06 || Swinton || A || Won || 18-50 || 12-28 || Cushion (1), Jobson (12), Duggan (19,29), Quinn (40,54), H. Davies (45), De Chenu (66,80) || Quinn 7/9 || N/A || 482 || Richard Johnston, Carl De Chenu, Aled James, Damien Quinn, Paul Morgan, Luke Young, Jace Van Dijk, Hywel Davies, Tony Duggan, Phil Cushion, Dean Fitzgerald, Matt Jobson, Ryan Barton || Lee Jones, Geraint Davies, Shawn Van Rensburg, Michael Hook ||-", "|18/6/06 || Sheffield || H || Won || 28-12 || 6-6 || Duggan (36), Young (42), A. James (62), Dean (77), Morgan (79) || Quinn 4/5 || N/A || 931 || Tony Duggan, Carl De Chenu, Aled James, Damien Quinn, Richard Johnston, Luke Young, Jace Van Dijk, Hywel Davies, Michael Ryan, Phil Cushion, Ryan Barton, Matt Jobson, Dean Fitzgerald || Gareth Dean, Geraint Davies, Shawn Van Rensburg, Paul Morgan ||-", "|25/6/06 || London Skolars || A || Won || 4-48 || 0-26 || Dixon (13,60), Morgan (21,24), Quinn (32,64), Van Dijk (36), Young (57), M. Ryan (71) || Quinn 6/9 || N/A || 233 || Neil Dixon, Carl De Chenu, Aled James, Damien Quinn, Paul Morgan, Luke Young, Jace Van Dijk, Hywel Davies, Michael Ryan, Shawn Van Rensburg, Ryan Barton, Matt Jobson, Dave Fitzgerald || Gareth Dean, Geraint Davies, Phil Cushion, Scott O'Kelly ||-", "|2/7/06 || Swinton || H || Lost || 10-21 || 6-8 || Young (37), Dixon (75) || Quinn 1/2 || N/A || 1,059 || Richard Johnston, Carl De Chenu, Neil Dixon, Damien Quinn, Paul Morgan, Luke Young, Jace Van Dijk, Hywel Davies, Micheal Ryan, Phil Cushion, Ryan Barton, Aled James, Dean Fitzgerald || Gareth Dean, Geraint Davies, Lee Jones (Not Used), Dean Scully ||-", "|9/7/06 || Hunslet || A || Won || 12-34 || 6-4 || Quinn (18,46), Young (49), M. Ryan (55), Duggan (66), Van Dijk (78) || Quinn 7/8 || N/A || 388 || Tony Duggan, Carl De Chenu, Richard Johnston, Damien Quinn, Paul Morgan, Luke Young, Jace Van Dijk, Hywel Davies, Michael Ryan, Phil Cushion, Ryan Barton, Aled James, Gareth Dean || Lee Jones, Geraint Davies, Karl Hocking, Dean Scully ||-", "|9/7/06 || Barrow || H || Won || 42-12 || 20-6 || M. Ryan (13), Duggan (24,46,74), Morgan (38), A. James (41), Quinn (63) || Van Dijk 7/8 || N/A || 650 || Tony Duggan, Richard Johnston, Aled James, Damien Quinn, Paul Morgan, Luke Young, Jace Van Dijk, Hywel Davies, Michael Ryan, Phil Cushion, Gareth Dean, Matt Jobson, Matt Hill || Lee Jones, Geraint Davies, Karl Hocking, Carl De Chenu ||-", "|23/7/06 || Blackpool || A || Won || 0-52 || 0-28 || De Chenu (5,65,79), M. Ryan (13), Young (15), Hill (17), Quinn (37), Duggan (70), Van Dijk (75) || Van Dijk 7/8 || N/A || 291 || Tony Duggan, Carl De Chenu, Aled James, Damien Quinn, Paul Morgan, Luke Young, Jace Van Dijk, Gareth Dean, Micheal Ryan, Phil Cushion, Dean Fitzgerald, Matt Jobson, Matt Hill || Neale Wyatt, Geraint Davies, Chris Beasley, Grant Epton ||-", "|30/7/06 || Dewsbury || H || Lost || 18-38 || 6-10 || Van Dijk (13), H. Davies (48), M. Ryan (55) || Van Dijk 3/3 || N/A || 1,103 || Tony Duggan, Carl De Chenu, Aled James, Damien Quinn, Paul Morgan, Luke Young, Jace Van Dijk, Hywel Davies, Micheal Ryan, Phil Cushion, Gareth Dean, Matt Hill, Neale Wyatt || Chris Beasley, Geraint Davies, Gareth Price, Dean Fitzgerald ||-", "|6/8/06 || Gateshead || H || Lost || 22-26 || 12-20 || Van Dijk (4), Duggan (26), M. Ryan (59), Hill (62) || Van Dijk 3/4 || N/A || 595 || Tony Duggan, Carl De Chenu, Aled James, Damien Quinn, Paul Morgan, Luke Young, Jace Van Dijk, Hywel Davies, Micheal Ryan, Phil Cushion, Dean Fitzgerald, Chris Beasley, Matt Hill || Lee Jones, Ryan Barton, Gareth Price, Geraint Davies ||-", "|13/8/06 || Featherstone || A || Lost || 11-10 || 8-6 || Morgan (15), M. Ryan (56) || Van Dijk 1/3 || N/A || 831 || Tony Duggan, Grant Epton, Matt Hill, Damien Quinn, Paul Morgan, Luke Young, Jace Van Dijk, Hywel Davies, Micheal Ryan, Gareth Price, Ryan Barton, Chris Beasley, Neale Wyatt || Dean Fitzgerald, Geraint Davies, Gareth Dean, Anthony Seibold ||-", "|20/8/06 || Workington || H || Won || 38-10 || 20-12 || Young (2), Wyatt (20), Quinn (29), Seibold (39,47), Duggan (43,68) || Van Dijk 5/7 || N/A || 434 || Tony Duggan, Carl De Chenu, Matt Hill, Damien Quinn, Grant Epton, Luke Young, Jace Van Dijk, Hywel Davies, Micheal Ryan, Gareth Price, Ryan Barton, Chris Beasley, Neale Wyatt || Geraint Davies, Phil Cushion, Gareth Dean, Anthony Seibold ||-", "|3/9/06 || Gateshead || A || Won || 16-28 || 4-20 || Duggan (9,25), Epton (21), Beasley (34), G. Davies (47) || Van Dijk 4/6 || N/A || 284 || Tony Duggan, Grant Epton, Matt Hill, Damien Quinn, Carl De Chenu, Luke Young, Jace Van Dijk, Hywel Davies, Chris Beasley, Gareth Price, Ryan Barton, Neale Wyatt, Gareth Dean || Paul Morgan, Geraint Davies, Phil Cushion, Anthony Seibold ||-", "|22/9/06 || Sheffield || H || Lost || 26-16 || 6-6 || N/A || Hill (27,68), Quinn (79) || Van Dijk 2/5 || N/A || 760 || Tony Duggan, Grant Epton, Aled James, Damien Quinn, Matt Hill, Luke Young, Jace Van Dijk, Gareth Dean, Micheal Ryan, Gareth Price, Ryan Barton, Chris Beasley, Neale Wyatt || Paul Morgan, Geraint Davies, Hywel Davies, Anthony Seibold ||-", "|1/10/06 || Swinton || H || Lost || 26-27 (after golden point extra time) || 10-10 || 26-26 || Hill (13,62), Beasley (25), M. Ryan (41), Duggan (52) || Van Dijk 3/6 || N/A || 687 || Tony Duggan, Grant Epton, Aled James, Damien Quinn, Matt Hill, Luke Young, Jace Van Dijk, Gareth Dean, Micheal Ryan, Gareth Price, Ryan Barton, Chris Beasley, Neale Wyatt || Paul Morgan, Geraint Davies, Hywell Davies, Anthony Seibold ||-", "|12/2/06 || Group 1 || Hemel Hempstead || A || Won || 10-50 || 10-16 || Duggan (2), O'Kelly (9), Quinn (40), O'Connor (48), Simm (61), Morgan (72), Van Dijk (74), H. Davies (76), De Chenu (80) || Van Dijk 6/8, Quinn 1/1 || N/A || N/A || Tony Duggan, Carl De Chenu, Geraint Davies, Damien Quinn, Paul Morgan, Luke Young, Jace Van Dijk, Ryan Barton, Scott O'Kelly, Hywel Davies, Carle Ellis, Phil Cushion, Matt Jobson || Lloyd O'Connor, Dean Scully, David Simm, Andy Llewellyn ||-", "|19/2/06 || Group 1 || London Skolars || A || Won || 6-40 || 0-18 || G. Davies (1), Quinn (23), M. Ryan (32,79), Duggan (45), Woodard (53), Fitzgerald (65) || Quinn 6/7 || N/A || 347 || Tony Duggan, Carl De Chenu, Geraint Davies, Dean Fitzgerald, Paul Morgan, Luke Young, Jace Van Dijk, Ryan Barton, Michael Ryan, Hywel Davies, Phil Cushion, Damien Quinn, David Simm || Carle Ellis, Dean Scully, Lenny Woodard, Scott O'Kelly ||-", "|26/2/06 || Group 1 || St Albans || A || Won || 0-72 || 0-24 || Quinn (13,50), De Chenu (25), Fitzgerald (31,77), Woodard (39), Sainsbury (44,57), M. Ryan (51), Morgan (60,75), Epton (69) || Quinn 12/12 || N/A || N/A || Grant Epton, Carl De Chenu, Geraint Davies, Lenny Woodard, Paul Morgan, Damien Quinn, Luke Young, Hywel Davies, Michael Ryan, Karl Hocking, Dean Scully, David Simm, Dean Fitzgerald || Andy Llewellyn, Marcus Sainsbury, Carle Ellis, Lloyd O'Connor ||-", "|5/3/06 || Group 1 || London Skolars || H || Won || 78-14 || 44-10 || Young (7,14), Morgan (10,60,76), De Chenu (25), Duggan (27,65), Hocking (32,41), Van Dijk (37), M. Ryan (40), Fitzgerald (51), Quinn (70) || Van Dijk 7/9, Young 4/5 || N/A || 1,421 || Tony Duggan, Carl De Chenu, Geraint Davies, Damien Quinn, Paul Morgan, Luke Young, Jace Van Dijk, Ryan Barton, Michael Ryan, Phil Cushion, David Simm, Matt Jobson, Dean Fitzgerald || Carle Ellis, Dean Scully, Karl Hocking, Lenny Woodard ||-", "|19/3/06 || Group 1 || Hemel Hempstead || H || Won || 72-14 || 36-0 || Barton (8), Morgan (27), K. Ellis (31), Hocking (34,48,73), Epton (37), G. Davies (43,53,72), De Chenu (55), O'Connor (66), O'Kelly (70) || Johnston 10/13 || N/A || 476 || Carl De Chenu, Grant Epton, Geraint Davies, Lenny Woodard, Paul Morgan, Richard Johnston, Kevin Ellis, Ryan Barton, Scott O'Kelly, Phil Cushion, Gareth James, Dean Scully, David Simm || Andy Llewellyn, Marcus Sainsbury, Karl Hocking, Lloyd O'Connor ||- ", "|26/3/06 || Group 1 || St Albans || H || Won || 62-0 || 40-0 || De Chenu (1), Johnston (3,32), Dixon (22,36), Hocking (26), Epton (30,44), G. Davies (41), Fitzgerald (49), Williams (78) || Hook 6/7, Johnston 3/4 || N/A || 263 || Richard Johnston, Carl De Chenu, Neil Dixon, Lenny Woodard, Grant Epton, Micheal Hook, Kevin Ellis, Andy Llewellyn, Scott O'Kelly, Karl Hocking, Dean Scully, Geraint Davies, David Simm || Dean Fitzgerald, Marcus Sainsbury, Carle Ellis, Lee Williams ||-", "|12/3/06 || Rd 4 || RC Lokomotiv Moscow || H || Won || 64-4 || 30-4 || Duggan (2,32,40,48), Young (20), De Chenu (28,53), Woodard (60), Sainsbury (64), Williams (69), O'Connor (78) || Young 10/11 || N/A || 623 || Carl De Chenu, Lee Williams, Lenny Woodard, Geraint Davies, Paul Morgan, Luke Young, Tony Duggan, Ryan Barton, Lloyd O'Connor, Phil Cushion, David Simm, Damien Quinn, Dean Fitzgerald || Carle Ellis, Dean Scully, Marcus Sainsbury, Scott O'Kelly ||-", "|1/4/06 || Rd 5 || Rochdale || A || Lost || 32-8 || 20-0 || M. Ryan (43), Duggan (71) || Young 0/2 || N/A || 666 || Tony Duggan, Carl De Chenu, Lenny Woodard, Damien Quinn, Paul Morgan, Luke Young, Jace Van Dijk, Ryan Barton, Michael Ryan, Phil Cushion, Dean Scully, David Simm, Dean Fitzgerald || Carle Ellis, Geraint Davies, Lloyd O'Connor, Lee Williams ||-", "| 4 || Geraint Davies || 29"]}, {"page": "2009 Celtic Crusaders season", "response": ["| Geraint Davies", "|Geraint Davies"]}, {"page": "Geraint (given name)", "response": ["*Geraint Davies (Plaid Cymru politician) (born 1948), Welsh politician", "*Geraint Davies (Labour politician) (born 1960), British politician", "*Geraint Davies (rugby league) (born 1986), Welsh rugby player"]}, {"page": "2010 European Cup", "response": ["|  South Wales Scorpions || Aled James, Andrew Gay, Ashley Bateman, Christiaan Roets, Geraint Davies, Joe Burke, Lewis Reece, Steve Parry"]}, {"page": "2010 Crusaders Rugby League season", "response": ["|Geraint Davies || Coventry RUFC || December 2009"]}]}}