{"wiki_id": "http://www.wikidata.org/entity/Q5542573", "itemLabel": "George Montagu, 9th Earl of Sandwich", "itemDescription": "British politician (1874-1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Montagu,_9th_Earl_of_Sandwich", "wikipedia_page": {"main": "George Charles Montagu, 9th Earl of Sandwich (29 December 1874 – 15 June 1962), known as George Montagu until 1916, was a British Conservative politician.\nSandwich was the son of Rear-Admiral the Hon. Victor Alexander Montagu, second son of John Montagu, 7th Earl of Sandwich. His mother was Lady Agneta Harriet, daughter of Charles Yorke, 4th Earl of Hardwicke. He was Assistant Private Secretary to the Board of Trade from 1898 to 1900. The latter year he was returned to Parliament for Huntingdon, a seat he held until 1906. In 1916 Sandwich succeeded his uncle in the earldom and entered the House of Lords. He later served as Lord-Lieutenant of Huntingdonshire between 1922 and 1946.", "link_mentions": [{"page": "Lady Jeanne Campbell", "response": ["Campbell was the daughter of Ian Douglas Campbell, 11th Duke of Argyll (1903–1973) and his first wife, the Hon. Janet Gladys Aitken (1908–1988), whose own father was Max Aitken, 1st Baron Beaverbrook. After their divorce in 1934, her father remarried three times, including to Margaret, Duchess of Argyll. Her father inherited the dukedom from his first cousin once removed, Niall Diarmid Campbell, 10th Duke of Argyll upon his death in 1949. Her mother remarried to the Hon. Drogo Montagu (1908–1940), the second son of George Montagu, 9th Earl of Sandwich, who died during World War II."]}, {"page": "George Charles Montagu, 9th Earl of Sandwich", "response": ["#REDIRECT George Montagu, 9th Earl of Sandwich"]}, {"page": "1962 South Dorset by-election", "response": ["The 1962 South Dorset by-election occurred following the death of George Montagu, 9th Earl of Sandwich on 15 June 1962. His son Viscount Hinchingbrooke, the incumbent MP for the constituency of South Dorset, was subsequently elevated to the peerage, becoming the 10th Earl of Sandwich. Following the Peerage Act 1963, the 10th Earl disclaimed his peerages in 1964, becoming Victor Montagu, but never sat in the House of Commons again."]}, {"page": "George Montagu", "response": ["* George Montagu, 9th Earl of Sandwich (1874–1962), British peer and Conservative politician"]}]}}