{"wiki_id": "http://www.wikidata.org/entity/Q5546592", "itemLabel": "George Yates", "itemDescription": "British cricketer (1858-1933)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Yates_(Derbyshire_cricketer)", "wikipedia_page": {"main": "George Yates (21 August 1858 — 21 July 1933) was an English cricketer who played first-class cricket for Derbyshire in 1883.\nYates was born at Bolsover, Derbyshire and became a coal miner. Yates played one first-class match for Derbyshire in the 1883 season, against Marylebone Cricket Club in July, which finished in a draw. He was a right-handed batsman and scored no runs in his only first-class innings. He was a right-arm round-arm bowler and did not take a wicket in the three overs he bowled.Yates died at Bolsover at the age of 74.", "link_mentions": [{"page": "George Yates (Lancashire cricketer)", "response": ["George Yates (6 June 1856 – 21 August 1925) was an English cricketer who represented Lancashire from 1885 to 1894", "Yates was born in Haslingden, Lancashire. He played cricket for Werneth in 1880, and in 1881 was living with his wife Annie at the pavilion of Werneth Cricket Club, in Chamber Road, Oldham, Lancashire.British Census 1881 RG11 4075/54 P27 He made his debut for Lancashire in July 1885 against Surrey when he made 10 runs in his only innings and took a catch. Yates was a right-hand batsman and played 135 innings in 92 first-class matches with an average of 13.60 and a top score of 74. He was a round arm right-arm fast bowler and took 30 first-class wickets at an average of 31.13 and a best performance of 4 for 112.George Yates at Cricket Archive"]}, {"page": "George Yates (disambiguation)", "response": ["George Yates (1843–1876) was an officer in the U.S. 7th Cavalry Regiment.", "George Yates may also refer to:", "*George Yates (Western Australian politician) (1908–1998), Australian politician", "*George Yates (Derbyshire cricketer) (1858–1933), cricketer", "*George Yates (Lancashire cricketer) (1856–1925), cricketer", "*George Yates (socialist) (fl. 1898–1904), British engineer and writer"]}, {"page": "Derbyshire County Cricket Club in 1883", "response": ["There were no long term additions to the team but George Earl, Joseph Needham, George Yates and  Percy Exham made their only career appearances and Thomas Evans made his two career appearances for Derbyshire during the season. The season also saw the last appearances of John Richardson who had been a steady bowler since 1878 and George Osborne who had played sice 1879."]}, {"page": "List of Derbyshire County Cricket Club players", "response": ["* George Yates (1883) : G. Yates"]}, {"page": "George Yates (cricketer, born 1858)", "response": ["#REDIRECT George Yates (Derbyshire cricketer)"]}]}}