{"wiki_id": "http://www.wikidata.org/entity/Q5548271", "itemLabel": "Georgina Lowe", "itemDescription": "British television producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Georgina_Lowe", "wikipedia_page": {"main": "Georgina Lowe  is a British film and television producer, who has produced director Mike Leigh's films since 2009.\nAmong her TV Producer credits are the BBC miniseries Tipping the Velvet (2002), Fingersmith (2005), the ITV1 series Kingdom (2007–2009) and the new Agatha Christie series Partners in Crime starring David Walliams and Jessica Raine for BBC One.\nIn 1993, she started working with Mike Leigh and his producer Simon Channing Williams, as production manager on Naked, and since then she has been involved in the production of all Leigh's films. \nShe co-produced Topsy-Turvy (1999), All or Nothing (2002),  Vera Drake (2004) and Happy-Go-Lucky (2008). \nShe  produced Mike Leigh's Another Year (2010), A Running Jump (2012) and Mr. Turner (2014).\nIn 2011, Mike Leigh made her his partner in Thin Man Films, the production company he started with Channing Williams in 1988.She has two daughters, Matilda and Sophie, and is married to the actor Sam Graham. Her brother in law is Phillip Schofield.", "link_mentions": [{"page": "BAFTA Award for Outstanding British Film", "response": ["| Another Year || Mike Leigh || Mike Leigh, Georgina Lowe"]}, {"page": "Kingdom (British TV series)", "response": ["Filming of the series in Swaffham and surrounding areas has given a boost to the local economy, dubbed \"the Kingdom effect\" by producer Georgina Lowe. Businesses have capitalised on the popularity of the series by offering guided tours of featured locations, as well as tourist merchandise such as \"Kingdom rock\" and postcards. Lowe gave a lecture to Swaffham's Iceni Partnership in 2007, in which she explained that the production team used local businesses \"for everything from equipment and scaffold rental to buying props, costumes, food and drink\". By the end of the filming of the second series, Parallel Productions had invested approximately £2.5 million into the local economy."]}, {"page": "Lowe (surname)", "response": ["* Georgina Lowe, British television producer"]}, {"page": "Simon Channing Williams", "response": ["Following Channing Williams' death, Mike Leigh started to collaborate with producer Georgina Lowe, who in 2011 took over Channing Williams' half of Thin Man Films. "]}, {"page": "64th British Academy Film Awards", "response": ["* Another Year – Mike Leigh and Georgina Lowe"]}, {"page": "Another Year (film)", "response": ["Because the director's usual producer Simon Channing-Williams died in 2009, Another Year was produced by Georgina Lowe, who had worked regularly on Mike Leigh films since Naked (1993). Thin Man Films led the production together with television channel Film4 and Focus Features International. The project received £1.2 million from the UK Film Council. The production involved a budget of around US$8 million, which Leigh said was \"the lowest budget I've had for a long time\"."]}, {"page": "The Mayor of Casterbridge (2003 film)", "response": ["The Mayor of Casterbridge is a British TV movie, produced by Georgina Lowe for Sally Head Productions and directed by David Thacker,Review of \"The Mayor of Casterbridge\". TV Guide. based on the 1886 novel by Thomas Hardy. Appearing in the film are Ciarán Hinds as Henchard, Juliet Aubrey as Susan Henchard, Jodhi May as Elizabeth Jane, James Purefoy as Farfrae, and Polly Walker as Lucetta. The series was released as a two-disc DVD in 2004."]}, {"page": "Thin Man Films", "response": ["Following Channing Williams' death from cancer in 2009, producer Georgina Lowe, who had assisted in the production of all Mike Leigh films since 1993, became the company's main producer, and in 2011 Mike Leigh made her his new company partner."]}, {"page": "AARP Movies for Grownups Award for Best Movie for Grownups", "response": ["|Another Year || Mike Leigh || Georgina Lowe"]}]}}