{"wiki_id": "http://www.wikidata.org/entity/Q5543000", "itemLabel": "George Odey", "itemDescription": "British politician (1900-1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Odey", "wikipedia_page": {"main": "George William Odey CBE DL (21 April 1900 – 16 October 1985) was a Conservative Party politician in the United Kingdom who served as a Member of Parliament (MP) from 1947 to 1955.\nHe was educated at Faversham Grammar School and University College London.He was elected as MP for the Howdenshire constituency at a by-election in 1947. When that constituency was abolished in boundary changes for the 1950 general election, he was returned to the House of Commons at for the newly recreated Beverley constituency, and held the seat until its abolition for the 1955 general election.\nOn 18 November 1952 he was made Honorary Air Commodore of No. 3505 (East Riding) Fighter Control Unit, Royal Auxiliary Air Force. On 7 February 1977 he was made a Deputy Lieutenant for the County of Humberside.", "link_mentions": [{"page": "List of MPs elected in the 1950 United Kingdom general election", "response": ["|George Odey"]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|George Odey"]}, {"page": "List of United Kingdom by-elections (1931–1950)", "response": ["|George Odey"]}, {"page": "Beverley (UK Parliament constituency)", "response": ["| George Odey"]}, {"page": "Howdenshire (UK Parliament constituency)", "response": ["| George Odey"]}, {"page": "George William Odey", "response": ["#REDIRECT George Odey"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*George Odey; MP for Howdenshire (1947–1950) and Beverley (1950–1955)"]}, {"page": "Crispin Odey", "response": ["Odey was born in East Yorkshire, the only son of (George) Richard Odey. His father was from a family of Yorkshire industrialists, and his grandfather George Odey, \"a formidable bully\", had been the Conservative MP for Beverley. His mother was from the Clitherow family. In 1980, his sister Caroline married the Hon. Henry David Montgomery, the son of David Montgomery, 2nd Viscount Montgomery of Alamein and (heir apparent to the viscountcy). They have three children."]}, {"page": "1947 Howdenshire by-election", "response": ["A by-election for the constituency of Howdenshire in the United Kingdom House of Commons was held on 27 November 1947, caused by the retirement of the incumbent Conservative MP Clifford Glossop. The result was a hold for the Conservative Party, with their candidate George Odey."]}, {"page": "Odey", "response": ["*George Odey (1900–1985), British Conservative Party politician"]}, {"page": "Odey, George", "response": ["#redirectGeorge Odey"]}]}}