{"wiki_id": "http://www.wikidata.org/entity/Q5541489", "itemLabel": "George Labouchère", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Labouch%C3%A8re", "wikipedia_page": {"main": "Sir George Peter Labouchere  (London, 2 December 1905 – Dudmaston Hall, Shropshire, 14 June 1999) was a British diplomat and collector of modern art.", "link_mentions": [{"page": "List of ambassadors of the United Kingdom to Spain", "response": ["|Sir George Labouchère"]}, {"page": "List of Old Carthusians", "response": ["*George Labouchère (1905–1999), British diplomat and collector of modern art"]}, {"page": "List of ambassadors of the United Kingdom to Hungary", "response": ["* 1953–1955 Sir George Labouchère"]}, {"page": "Dudmaston Hall", "response": ["She met George Labouchère (1905–1999), a diplomat and scion of a Huguenot family, while working at the Admiralty during World War II in 1942 and was to marry him the following year. They agreed that she would accompany him to his diplomatic postings and that he would then retire to Dudmaston with her.  George's next posting was to Stockholm, and Rachel had to fly over the North Sea to marry him there, forced to turn back once when the cloud cleared and left the aeroplane exposed to German attack.Obituary of George Labouchere in the Independent Subsequent postings were in China, from 1946 to 1948, and then in Argentina, Austria, Hungary and Belgium. George was knighted in 1955 and appointed ambassador to Francoist Spain in 1960. It was there that the Lachoucheres acquired an important group of artworks, produced by artists of the left-wing opposition to the regime – a significant component of the collection they would install at Dudmaston."]}, {"page": "Sir George Labouchère", "response": ["#REDIRECT George Labouchère"]}, {"page": "George Labouchere", "response": ["#REDIRECT George Labouchère "]}, {"page": "Deaths in June 1999", "response": ["*Sir George Labouchère, 93, British diplomat and art collector."]}, {"page": "Labouchère, George", "response": ["#redirectGeorge Labouchère"]}, {"page": "Labouchère (surname)", "response": ["* George Labouchère (1905–1999), British diplomat"]}]}}