{"wiki_id": "http://www.wikidata.org/entity/Q5543285", "itemLabel": "George Pearce Baldwin", "itemDescription": "English ironworker", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Pearce_Baldwin", "wikipedia_page": {"main": "George Pearce Baldwin (17 May 1789 – 1 October 1840) came from Broseley in Shropshire and moved to Worcestershire at the start of the 19th Century, becoming an iron founder at Stourport-on-Severn. He was the son of Thomas Baldwin and Mary Gough.\nHe had 12 children, the youngest of whom, Alfred, father of the future prime minister Stanley Baldwin, was born in 1841, the year after George died.\nHe was married to Anne Hill on 16 April 1812; together they had two children:\n\nPearce Baldwin (born 20 July 1813; died 6 April 1861)\nWilliam Hill Baldwin (born 8 March 1817, died 11 May 1863).He then married Sarah Chalkley Stanley, daughter of Reverend Jacob Stanley, on 4 October 1822. His children by his second wife were:\n\nGeorge Baldwin (8 April 1824 – 17 October 1824), died in infancy\nGeorge Baldwin (16 March 1826 – 5 March 1881)\nStanley Baldwin (4 February 1828 – 21 September 1907)\nSarah Anne Baldwin (19 April 1830 – 15 December 1919)\nEdward Baldwin (26 May 1832 – 26 April 1848)\nMary Jane Baldwin (16 January 1834 – 18 January 1908)\nLucilla Baldwin (16 March 1836 – November 1916)\nEliza Baldwin (2 September 1837 – July 1914)\nAlfred Baldwin (4 June 1841 – 13 February 1908), father of Prime Minister Stanley BaldwinAfter George Pearce Baldwin's death, his sons Pearce and William took over the Wilden Ironworks in 1849 with their uncle, Enoch Baldwin. This ironworks incorporated Wilden Forge (which had been built in 1647 by Thomas Foley (1616-1677).  It had usually been operated by (or for) members of the Foley family until 1776, and after that by various tenants (see Wilden Ironworks for details).  The Wilden Works were taken over in 1870 by the youngest half-brother of Pearce and William, Alfred. It became the basis for the subsequent fortune of the Baldwin family.", "link_mentions": [{"page": "Broseley", "response": ["*George Pearce Baldwin (1789–1840), iron founder at Stourport-on-Severn and grandfather of Stanley Baldwin, was born here."]}, {"page": "Monica Baldwin", "response": ["Baldwin was born in Stourport, Worcestershire, England to Edward Arthur Baldwin and Lucilla Baldwin Livesey.1901 England Census Her great-grandfather was George Pearce Baldwin, grandfather of Stanley Baldwin.1871 England CensusEngland & Wales, Non-Conformist and Non-Parochial Registers, 1567-1970"]}, {"page": "Alfred Baldwin (politician)", "response": ["Baldwin was the 12th and posthumously-born child of George Pearce Baldwin and Sarah Chalkley Stanley.  He started work at the Wilden Iron and Tin Plate Company at Wilden (near Stourport, Worcestershire), which, in 1840, had been taken over by his uncle Enoch Baldwin, who ran the business with his nephews, Pearce and William, trading as E.P.& W. Baldwin of Wilden.  In 1879, Alfred and his brothers dissolved the partnership. Alfred then moved into Wilden House and took over the Wilden Works, changing the name of the business to Baldwins Ltd."]}, {"page": "Wilden Ironworks", "response": ["*George Pearce Baldwin"]}, {"page": "George Baldwin", "response": ["*George Pearce Baldwin (1789–1840), British foundryman"]}, {"page": "Enoch Baldwin", "response": ["Baldwin was the son of Enoch Baldwin, iron founder of Stourport-on-Severn, whose brother was  George Pearce Baldwin. He became a member of the family firm of Baldwin, Son & Co in 1839, becoming in time senior partner.Debretts House of Commons and the Judicial Bench 1881 William Retlaw Williams The Parliamentary History of the County of Worcester. "]}, {"page": "Elsie Hall", "response": ["Hall was born in Toowoomba, Queensland, Australia, the oldest daughter of William Stanley Hall (c.1845 – 19 June 1927), a journalist, and his wife Mary Ann, née Sadgrove, a piano teacher. The name \"Stanley\" was carried in recognition of his mother's family. She was a sister of Rev. Jacob Stanley, president of the British Wesleyan Methodist Conference, and Sarah Chalkey Stanley, who married George Pearce Baldwin."]}]}}