{"wiki_id": "http://www.wikidata.org/entity/Q5541633", "itemLabel": "George Leeman", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Leeman", "wikipedia_page": {"main": "George Leeman (August 1809 – 25 February 1882) was a lawyer, railwayman and a Liberal Member of Parliament (MP) for the City of York in the nineteenth century.", "link_mentions": [{"page": "North Eastern Railway (United Kingdom)", "response": ["*George Leeman (1874–80)", "Among the other famous directors of the NER were George Leeman (director 1854–82, Chairman 1874–80); Henry Pease (director 1861–1881); Sir Joseph Whitwell Pease, Bart. (director 1863–1902, Chairman 1895–1902); John Dent Dent (director 1879–94, Chairman 1880–94); Matthew White Ridley, 1st Viscount Ridley (director 1881–1904, Chairman 1902–04); Sir Edward Grey, Bart (see below); George Gibb (solicitor 1882–1891, general manager 1891–1906, director 1906–1910); and Henry Tennant (director 1891–1910)."]}, {"page": "City of York (UK Parliament constituency)", "response": ["|George Leeman|| Liberal", "|George Leeman ||Liberal"]}, {"page": "George Hudson", "response": ["On 20 August 1847 the YNMR line to Harrogate opened between Church Fenton and Spofforth and on 4 October the line from York to Market Weighton was completed. It is worth noting that Hudson had purchased the Londesborough Hall estate in September 1845 to partly to prevent the scheme of one of his bitter enemies George Leeman succeeding.", "Hudson had been borrowing money at a high interest rate to keep some of his companies afloat. A payment of £400,000 had to be made in 1849; many of these companies were left in a difficult position with falling revenues, an economic depression and little scope for future shareholder dividends. In York the City Council led by George Leeman were demanding money for the Lendal Bridge project and many of Hudson's allies were unseated at local elections that year.", "On 17 May Hudson resigned from the YNMR to avoid sacking and a committee was set up to look at the allegation that Hudson had used their money to build a private station at Londesborough Park on the Market Weighton line. As 1849 progressed more was unearthed and by the autumn Hudson was being asked to repay £750,000. He sold Londesborough Park and then paid £200,000 off to the YNBR (chairman George Leeman) rather than face being taken to court.", "These were heard in 1853 and Hudson lost all three and by winter of that year he had negotiated a settlement of £72,670 to clear all his debts. He had to sell his property at Newby Park and the purchaser Viscount Downe used Hudson's enemy George Leeman to complete his purchase. By 1856 the YNMR debt was £16,000 and this was taken over by the North Eastern Railway upon merger in 1864.", "Following his election as one of the two members of parliament for Sunderland in 1845, Hudson's influence led to his becoming Lord Mayor of York for a third time. One of his ambitions, to build a bridge to link the railway with Lendal in York was high on his agenda. However his attempts to raise money for this project did not go well, as he stated that the YNMR would fund the bridge with the council. However, when the proposal was presented to the Council there was no mention of the YNMR. Alarmed, one of Hudson's bitterest enemies, George Leeman, led the opposition, resulting in Hudson agreeing to pay some of the costs of the bridge design himself.", "On Sunday 9 July 1865 (just before the election) the Sheriff of York arrested Hudson in Whitby and he was taken back to York.the date is suggested to be Monday 10 July by biographer Dr Alf Peacock (1988,89) although most newspapers reported it as the Sunday. Although not proven, it is suggested by two of his biographers that Thompson and George Leeman were behind the arrest.} and Dr Alf Peacock (1988,89). Given that Thompson was the chairman of one of the railways pursuing Hudson for debt and was facing defeat in Whitby, it does seem a likely scenario.", "This estate, bought within a year, effectively ended George Leeman's plans to build a line from York to Market Weighton. The estate, bought as an investment for his sons and cost £500,000.Peacock and Joy record this as £470,000. lt was sold in 1850 to pay off some of Hudson's debts."]}, {"page": "Railway town", "response": ["The growth of railway towns was often in the mould of the 'paternalistic employer' providing housing, schools, hospitals, churches and civic buildings for their workers, similar to Cadbury's Bournville; there was a \"very rigid and unimaginative control\" of the workers by GWR in Swindon. Workforces were loyal and obedient; industrial action in railway towns was rare because the workforce depended on the company. Railwaymen dominated local politics in railway towns, particularly Francis Webb's 'Independent Railway Company Party' in Crewe and George Leeman in York. The chief mechanical engineer of GWR, Daniel Gooch, was MP for Swindon for twenty years."]}, {"page": "List of MPs elected in the 1874 United Kingdom general election", "response": ["| George Leeman"]}, {"page": "Joseph Terry", "response": ["In 1860, Terry was elected Councillor for York's Monk Ward, a rural area close to the modern day Strays of York, as a Conservative. He would later be appointed Chairman of the York Conservative Association (something that his grandson, Noel Goddard Terry, would also later achieve). Experience in local government was heightened by his election as sheriff, equivalent to a deputy mayoral position, in 1870 under Liberal MP George Leeman, who served as Member of Parliament for the City of York constituency for three years prior to his appointment as Lord Mayor. In 1874, Terry became an Alderman of the City, granting him a seat at York's Guildhall for debate in a then partisan chamber under the Conservatives. The party, in response to his growing popularity, allowed him to run for the Lord Mayoralty within the same year, to which he was elected by consensus, defeating the incumbent local brewer, John March. This position granted him the style the 'Right Honourable' (a title exclusive to the Lord Mayoralty, not the individual)."]}, {"page": "Leeman", "response": ["*George Leeman (1809–1882), MP for York, England and chairman of the North Eastern Railway"]}, {"page": "List of United Kingdom by-elections (1868–1885)", "response": ["|George Leeman"]}, {"page": "Joseph Johnson Leeman", "response": ["Leeman was the son of George Leeman, previous MP for York, and his wife Jane Johnson daughter of Joseph Johnson of London. He was a Deputy Lieutenant for the West Riding of Yorkshire and the City of York.Debretts House of Commons and the Judicial Bench 1881"]}, {"page": "List of lord mayors of York", "response": ["|1853–1854 ||George Leeman||Solicitor, railway entrepreneur, and MP for York, 1865,1871", "|1860–1861 ||George Leeman||Solicitor, railway entrepreneur, and MP for York, 1865,1871", "|1870–1871 ||George Leeman||Solicitor, railway entrepreneur, and MP for York, 1865,1871"]}, {"page": "List of Vanity Fair (British magazine) caricatures (1870–1874)", "response": ["|1872-07-13||Mr George Leeman MP||A Yorkshire Solicitor||Coïdé||S 117||25px"]}, {"page": "1871 York by-election", "response": ["The York by-election of 1868 was a by-election held in England on 14 February 1871 for the House of Commons constituency of York. It was held due to the resignation of the incumbent Liberal MP, Joshua Proctor Brown Westhead.  It was won by the unopposed Liberal candidate George Leeman."]}, {"page": "History of the North British Railway (until 1855)", "response": ["George Leeman, Chairman of the York Newcastle and Berwick Railway, referred to the special train, and disclosed that the full opening had been intentionally delayed to comply with Royal commitments, in a speech at a dinner in honour of Robert Stephenson in Newcastle on 30 July 1850:"]}, {"page": "Deputy Lieutenant of the North Riding of Yorkshire", "response": ["* George Leeman"]}, {"page": "Leeman, George", "response": ["#redirectGeorge Leeman"]}]}}