{"wiki_id": "http://www.wikidata.org/entity/Q5545028", "itemLabel": "George T. Boult", "itemDescription": "English cricketer", "wikipedia_url": "https://en.wikipedia.org/wiki/George_T._Boult", "wikipedia_page": {"main": "George T. Boult was a noted English cricketer of the late 18th century who was a member of the Hambledon Club.\nBoult was an amateur player who was involved in organising matches as well as being a good batsman.  He is primarily associated with Berkshire via the influential Maidenhead club.  Boult was probably Berkshire's best regular player during the short period that it enjoyed first-class status, although the team did benefit from appearances by such as Thomas Taylor, William Fennex, William Beldham, David Harris and other good players of the time.  Boult subsequently played for Middlesex.\nBoult was elected to membership of the Hambledon Club in 1786, when it was already past its heyday.  He resigned in 1791 but he did play a few games for Hampshire.\nHe made 20 known first-class appearances from 1785 to 1797.  He had several good scores including two fifties (53 & 55) in one match for Berkshire v Essex in 1785.  Later, when playing for Middlesex, he made two good scores against MCC: 89 in 1791 and 76 in 1795.  He made a century (108) in a minor match for Windsor Forest versus a Surrey XI in 1788.  Prevailing conditions were heavily in favour of the bowlers and 50 runs was a very high score indeed.\nThere were several cricketing Boults, including his own son George Boult junior.  Members of the Boult family were playing club cricket in Maidenhead as late as 1836.", "link_mentions": [{"page": "White Conduit Club", "response": ["| George T. Boult (Berks/Middx)\t"]}, {"page": "Berkshire county cricket teams", "response": ["Arthur Haygarth, Scores & Biographies, Volume 1 (1744-1826), Lillywhite, 1862H. T. Waghorn, The Dawn of Cricket, Electric Press, 1906 Noted Berkshire players included Thomas Waymark and George T. Boult."]}, {"page": "George T Boult", "response": ["#REDIRECT George T. Boult"]}, {"page": "List of English cricketers (1787–1825)", "response": ["|George T. Boult"]}, {"page": "Alphabetical cricket teams", "response": ["Haygarth is not entirely correct in his analysis of the two teams because Hambledon included four players from elsewhere and Kent two. Lumpy Stevens of Chertsey and Surrey was, as Haygarth says, a \"given man\" on the Hambledon/Hampshire side but, in addition, the team included Earl of Winchilsea (White Conduit Club), Edward Hussey (Kent) and William Fennex (Middlesex). The other seven players were all Hambledon men: John Small, Harry Walker, Tom Walker, Tom Taylor, Noah Mann, Richard Purchase and David Harris. On the Kent side, the given man was William Bedster who, like Stevens, was employed by the Earl of Tankerville and played for Chertsey and Surrey. Kent included George T. Boult of Berkshire and, later, Middlesex. The other nine were usually associated with Kent: Stephen Amherst, James Aylward (though he played for Hampshire until 1779), Francis Booker, John Boorman, William Bowra, William Brazier, William Bullen, Robert Clifford and Henry Crozoer."]}, {"page": "List of English cricketers (1772–1786)", "response": ["|George T. Boult"]}]}}