{"wiki_id": "http://www.wikidata.org/entity/Q5542572", "itemLabel": "George Montagu, 6th Earl of Sandwich", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Montagu,_6th_Earl_of_Sandwich", "wikipedia_page": {"main": "George John Montagu, 6th Earl of Sandwich (4 February 1773 – 21 May 1818) was the son of John Montagu, 5th Earl of Sandwich and Lady Mary Henrietta Powlett. He was styled Viscount Hinchingbrooke from 1790 until in 1814 when, his elder half-brother having died, he inherited the earldom from his father, together with the Hinchingbrooke estate in Huntingdonshire. He was educated at Eton College (1780-90) and  Trinity College, Cambridge (1790-92).He was MP for Huntingdonshire from 1794 to 1814.He married in 1804 Lady Louisa Mary Ann Julia Harriet Lowry-Corry, daughter of Armar Lowry-Corry, 1st Earl Belmore and Lady Harriet Hobart. Together they had two daughters and one son, John William, who would succeed his father in the earldom:\n\nLady Harriet Mary Montagu (14 May 1805 – 4 May 1857), married William Bingham Baring, 2nd Baron Ashburton\nLady Catherine Caroline Montagu (7 October 1808 – 30 April 1834), married Count Alexandre Colonna-Walewski, an illegitimate son of Napoleon I and Marie, Countess Walewska\nJohn Montagu, 7th Earl of Sandwich (8 November 1811 – 3 March 1884), married firstly Lady Mary Paget; married secondly Lady Blanche Egerton.He died in Rome in 1818.", "link_mentions": [{"page": "Alexander Baring, 1st Baron Ashburton", "response": ["* Bingham Baring, 2nd Baron Ashburton (1799–1864), who married Lady Harriet Mary Montagu, eldest daughter of George Montagu, 6th Earl of Sandwich."]}, {"page": "Bingham Baring, 2nd Baron Ashburton", "response": ["Lord Ashburton married as his first wife, Lady Harriet Mary Montagu, eldest daughter of George Montagu, 6th Earl of Sandwich, on 12 April 1823. Their only child, Alexander Montagu Baring (1828–1830), died as an infant. Lady Harriet is well known for inspiring the devotion of Thomas Carlyle, to the great dismay of his wife Jane Welsh Carlyle.Kenneth J. Fielding, David R. Sorensen (ed) Jane Carlyle: newly selected letters, Ashgate, 2004, pp. xiv–xvi. Lady Harriet died on 4 May 1857, aged 51."]}, {"page": "John Montagu, 7th Earl of Sandwich", "response": ["Montagu was the son of George Montagu, 6th Earl of Sandwich, and his wife Lady Louisa Mary Ann Julia Harriett, daughter of Armar Lowry-Corry, 1st Earl Belmore. He succeeded his father in the earldom in 1818 at the age of six. He was educated at Eton and Trinity College, Cambridge. While at Cambridge he played two first-class matches for the Cambridge University Cricket Club.Cricinfo: Earl of Sandwich"]}, {"page": "George John Montagu, 6th Earl of Sandwich", "response": ["#REDIRECT George Montagu, 6th Earl of Sandwich"]}, {"page": "George Montagu", "response": ["* George Montagu, 6th Earl of Sandwich (1773–1818), British peer"]}, {"page": "Louisa Montagu, Countess of Sandwich", "response": ["Louisa Mary Anne Julia Harriet Montagu, Countess of Sandwich (née Lady Louisa Lowry-Corry; 3 April 1781 – 19 April 1862) was an Irish noblewoman and society figure, who in 1804 became the wife of George Montagu, 6th Earl of Sandwich."]}, {"page": "Ann Louisa Baring", "response": ["* Bingham Baring, 2nd Baron Ashburton (1799–1864), who married Lady Harriet Montagu, eldest daughter of George Montagu, 6th Earl of Sandwich."]}, {"page": "Lady Harriet Mary Montagu", "response": ["She was born in 1805 to George Montagu, 6th Earl of Sandwich and Louisa Montagu, Countess of Sandwich."]}, {"page": "Louisa Baring, Lady Ashburton", "response": ["On 17 November 1858 Louisa married the widowed Bingham Baring, 2nd Baron Ashburton (1799–1864), a member of the Baring family of merchants and bankers. His first wife, Lady Harriet Mary Montagu (eldest daughter of George Montagu, 6th Earl of Sandwich), had died the previous year. Together, they were the parents of:"]}, {"page": "Buckenham Tofts", "response": ["Bingham Baring, 2nd Baron Ashburton (1799–1864) married Lady Harriet Montagu, eldest daughter of George Montagu, 6th Earl of Sandwich. Bingham served as MP for Thetford in 1826 and 1841. The 2nd Baron died in 1864 and was succeeded by his younger brother Francis."]}]}}