{"wiki_id": "http://www.wikidata.org/entity/Q5540312", "itemLabel": "George Hastings", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Hastings_(East_Worcestershire_MP)", "wikipedia_page": {"main": "George Woodyatt Hastings (25 September 1825 – 21 October 1917) was an English Liberal politician who sat in the House of Commons from 1880 to 1892.\nHastings was the only son of Sir Charles Hastings, M.D., D.C.L., founder of the British Medical Association, of Barnard's Green, Malvern, and his wife Hannah Woodyatt. He was a relation of Warren Hastings (1732–1818) Governor of Bengal from 1772. The family had owned the estate of Daylesford in Gloucestershire from the 12th century. Hastings was educated at Bromsgrove School and at Christ's College, Cambridge.\nIn 1850, he was called to the bar at Middle Temple. He was secretary of the Law Amendment Society and Hon. secretary of the National Reformatory Union. From 1857 to 1868, he was General Secretary of the National Association for Promotion of Social Science, and was Chairman of their Council from 1868 to 1883. He was chairman of Worcester School Board from 1871 to 1883. He was a J.P. and vice-chairman of Quarter Sessions for Worcestershire, and a J.P. and a Deputy Lieutenant of Herefordshire.Hastings stood for parliament unsuccessfully in Beverley at by-election in 1854,\nand in West Worcestershire at the 1874 general election.\nAt the 1880 general election he was elected as a Member of Parliament (MP) for East Worcestershire,\nand was re-elected in 1885 and as a Liberal Unionist in 1886. He held the seat until 1892,\nwhen he was expelled from the House of Commons and convicted of fraudulent conversion.  As a Trustee for property under the will of John Brown, he had appropriated over £20,000 from the estate, leaving Brown's four children with £7,000.Hastings married firstly Catherine Anna Mence, daughter of the Rev. Samuel Mence, rector of Ulcombe Kent in 1858. She died in 1871 and he married again in 1877 to Frances Anna Pillans, daughter of the Rev. William Huntingdon Pillans, Rector of Himley. He died in October 1917 aged 92.\n\n", "link_mentions": {}}}