{"wiki_id": "http://www.wikidata.org/entity/Q5541075", "itemLabel": "George Jarvis", "itemDescription": "English cricketer (1800-1880)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Jarvis_(cricketer)", "wikipedia_page": {"main": "George Jarvis (24 June 1800 – 27 March 1880) was an English cricketer who played first-class cricket from 1826 to 1841.  He was a brother of Charles Jarvis. \nJarvis was a right-handed batsman and an underarm fast bowler.  He played mainly for Nottingham Cricket Club and Nottinghamshire and made 37 known first-class appearances.  He represented the Players in the Gentlemen v Players series and played four times for North v. South from 1836 to 1838.\nJarvis scored 814 runs at an average of 12.71, with a highest score of 59.  He took 13 catches and bowled 72 recorded deliveries, taking nine wickets and conceding sixteen runs.", "link_mentions": [{"page": "North v South", "response": ["* 4 – Ned Wenman, Fuller Pilch, George Jarvis, George Millyard, James Cobbett, Sam Redgate, Thomas Barker, Tom Marsden"]}, {"page": "Roundarm trial matches", "response": [":All-England: Thomas Flavel, John Bowyer, James Saunders, William Barber, Tom Marsden, Fuller Pilch, George Dawson, Thomas Beagley, William Mathews, George Jarvis, Henry Jupp"]}, {"page": "List of Nottinghamshire County Cricket Club players", "response": ["* George Jarvis (1841) : G. Jarvis"]}, {"page": "List of English cricketers (1826–1840)", "response": ["|A solitary first-class match played for Nottingham. Brother of George Jarvis.", "|George Jarvis"]}, {"page": "List of English cricketers (1841–1850)", "response": ["|George Jarvis"]}, {"page": "List of Nottingham Cricket Club players", "response": ["|Jarvis' only first-class match was for Nottingham. Brother of George Jarvis.", "|George Jarvis", "|George Jarvis, CricketArchive. Retrieved 2020-06-16. "]}, {"page": "George Jarvis", "response": ["George Jarvis may refer to:", "* George Jarvis (cricketer) (1800–1880), English cricketer", "* George Jarvis (footballer) (1889–1969), Scottish footballer", "* George Jarvis (Philhellene) (1797–1828), American Philhellene who took part in the Greek Revolution"]}]}}