{"wiki_id": "http://www.wikidata.org/entity/Q5546495", "itemLabel": "George Woodcock", "itemDescription": "British trade union leader", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Woodcock_(trade_unionist)", "wikipedia_page": {"main": "George Woodcock,  (20 October 1904 – 30 October 1979) was a British trade unionist and general secretary of the Trades Union Congress from 1960 to 1969.\nBorn and brought up in Bamber Bridge, Lancashire, he started work at age 12 in the local cotton mill. He became, in 1924, an official of the Bamber Bridge and District Weavers' Union. He was also active in the Independent Labour Party and the Labour Party. In 1929 he won a TUC scholarship to Ruskin College, Oxford, in 1929. Having distinguished himself at undergraduate and postgraduate level, and following two years in the civil service, Woodcock joined the TUC in 1936 as head of the research and economic department. Here, Woodcock was much influenced by leading moderates in the trade union movement, such as Walter Citrine and Ernest Bevin, and also by the economic ideas of John Maynard Keynes.\nIn 1947 he became the TUC's Assistant General Secretary and in 1960, was appointed General Secretary, serving in that position until 1969. In 1970 Woodcock was a candidate for the Chancellorship of the University of Kent at Canterbury, but lost to Jo Grimond.", "link_mentions": [{"page": "Ruskin College", "response": ["* George Woodcock, general secretary, Trade Union CongressThe Times, Monday, 19 November 1979; p. 25; Issue 60478; col CGeoffrey Goodman, \"Woodcock, George (1904–1979)\", Oxford Dictionary of National Biography, Oxford University Press, 2004."]}, {"page": "George Woodcock", "response": ["George Woodcock (; May 8, 1912 – January 28, 1995) was a Canadian writer of political biography and history, an anarchist thinker, a philosopher, an essayist and literary critic. He was also a poet and published several volumes of travel writing. In 1959 he was the founding editor of the journal Canadian Literature which was the first academic journal specifically dedicated to Canadian writing. He is most commonly known outside Canada for his book Anarchism: A History of Libertarian Ideas and Movements (1962).", "Woodcock was born in Winnipeg, Manitoba, but moved with his parents to England at an early age, attending Sir William Borlase's Grammar School in Marlow and Morley College. Though his family was quite poor, Woodcock's grandfather offered to pay his tuition if he went to Cambridge University which he turned down due to the condition that he undertake seminary training for the Anglican clergy.Canadian Literature, \"About George Woodcock\"  Retrieved August 19, 2013. Instead, he took a job as a clerk at the Great Western Railway and it was there that he first became interested in anarchism. He was to remain an anarchist for the rest of his life, writing several books on the subject, including Anarchism, the anthology The Anarchist Reader (1977), and biographies of Pierre-Joseph Proudhon, William Godwin, Oscar Wilde and Peter Kropotkin. It was during these years that he met several prominent literary figures, including T. S. Eliot and Aldous Huxley, and forging a particularly close relationship with the art theorist Herbert Read.David Goodway, Herbert Read Reassessed (Liverpool: Liverpool University Press, 1998) p.5 Woodcock's first published work was The White Island, a collection of poetry, which was issued by Fortune Press in 1940.", "George Woodcock died at his home in Vancouver, British Columbia, Canada, on January 28, 1995.", "Woodcock later wrote The Crystal Spirit (1966), a critical study of Orwell and his work which won a Governor General's Award.Hiebert, Matt. \"In Canada and Abroad: The Diverse Publishing Career of George Woodcock\".  Retrieved August 19, 2013. The title is taken from the last line of the poem written by Orwell in memory of the Italian militiaman he met in Barcelona in December 1936 during the Spanish Civil War, a meeting Orwell describes in the opening lines to Homage to Catalonia (1938).\"The Crystal Spirit\"  George Orwell Novels. Retrieved August 19, 2013.", "He is the subject of a biography, The Gentle Anarchist: A Life of George Woodcock (1998) by George Fetherling, and a documentary George Woodcock: Anarchist of Cherry Street by Tom Shandel and Alan Twigg.", "* Antliff, Mark. \"Pacifism, Violence and Aesthetics: George Woodcock's Anarchist Sojourn, 1940-1950 1.\" Anarchist Studies 23.1 (2015): 15-44.", "* Antliff, Allan, and Matthew S. Adams. \"George Woodcock's transatlantic anarchism.\" Anarchist Studies 23.1 (2015): 6-14.", "* Evren, Süreyyya, and Ruth Kinna. \"George Woodcock: The Ghost Writer of Anarchism 1.\" Anarchist Studies 23.1 (2015): 45-61.", "* Adams, Matthew S. \"Memory, History, and Homesteading: George Woodcock, Herbert Read, and Intellectual Networks 1.\" Anarchist Studies 23.1 (2015): 86-104.", "*George Woodcock Official Site (2013 Archive.org Backup)", "*George Woodcock fonds at Queen's University Archives.", "*Canada India Village Aid George Woodcock co-founder and past director.", "*George Woodcock Biography at Anarchist Encyclopedia.", "* George Woodcock, Reflections on Decentralism (1969)"]}, {"page": "General Secretary of the Trades Union Congress", "response": ["*George Woodcock (6 September 1960 – 26 February 1969)", ":1947: George Woodcock"]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*George Woodcock (1904–1979)"]}, {"page": "1970 University of Kent at Canterbury Chancellor election", "response": ["*George Woodcock, recently retired General Secretary of the TUC."]}, {"page": "I'm Backing Britain", "response": ["Trades Union Congress general secretary George Woodcock, while welcoming the \"very good spirit\" of the campaign, said that the trade unions would not foster it and that some unions would strongly oppose it. The Amalgamated Engineering Union (AEU) shop stewards at Colt's factory in Havant carefully said that workers could work the extra half-hour without pay but that it would not prejudice any decision taken by the AEU national executive.\"Support for 'back Britain' move\", The Times, 2 January 1968, p. 2. Confederation of British Industry President John Davies thought the campaign could be a kind of window-dressing such as he had recently criticised but thought it should be encouraged because of the effect it might have on people's minds.Eric Silver, \"'Back Britain' drive said to be a gimmick\", The Guardian, 2 January 1968, p. 14."]}, {"page": "George Orwell bibliography", "response": ["|Correspondence between Orwell, Alex Comfort, D. S. Savage, and George Woodcock, published in Partisan Review, September/October 1942; also known as \"A Controversy\""]}, {"page": "Woodcock (surname)", "response": ["*George Woodcock (1912–1995), Canadian writer and historian", "*George Woodcock (cricketer) (1894–1968), batsman", "*George Woodcock (trade unionist) (1904–1979), English trade unionist"]}, {"page": "1953 Coronation Honours", "response": ["* George Woodcock, Assistant General Secretary, Trades Union Congress", "* George Woodcock, Chief Inspector, West Riding of Yorkshire Constabulary (Wakefield)"]}, {"page": "1967 Birthday Honours", "response": ["* George Woodcock, , General Secretary, Trades Union Congress."]}]}}