{"wiki_id": "http://www.wikidata.org/entity/Q5541745", "itemLabel": "George Lindsay-Crawford, 22nd Earl of Crawford", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Lindsay-Crawford,_22nd_Earl_of_Crawford", "wikipedia_page": {"main": "Major General George Lindsay-Crawford, 22nd Earl of Crawford (31 January 1758 – 30 January 1808), was a Scottish peer and soldier. He served in the British Army and was Lord Lieutenant of Fife.\nHe was born on 31 January 1758 at Bourtree Hill, Ayrshire, Scotland. He was the son of George Lindsay-Crawford, 21st Earl of Crawford and Jean Hamilton.", "link_mentions": [{"page": "Earl of Crawford", "response": ["*George Lindsay-Crawford, 22nd Earl of Crawford, 6th Earl of Lindsay (1758–1808) (dormant 1808; last male line descendant of 1st Earl of Lindsay, Earldom of Lindsay passed (according to Lords decision in 1878) to a kinsman of 1st Earl of Lindsay and that of Crawford reverted to senior surviving line, as determined 1848)"]}, {"page": "Earl of Balcarres", "response": ["In January 1808, the ancient Earldom of Crawford, held by members of another branch of the Lindsay family since 1398, became dormant after the death of the George Lindsay-Crawford, 22nd Earl of Crawford. In 1843, James Lindsay, 7th Earl of Balcarres, put forward his claim, based on the research of his eldest son Alexander.Barker, Nicolas (1978) Bibliotheca Lindesiana: the Lives and Collections of Alexander William, 25th Earl of Crawford and 8th Earl of Balcarres, and James Ludovic, 26th Earl of Crawford and 9th Earl of Balcarres. London: for Presentation to the Roxburghe Club, and published by Bernard Quaritch In 1848, the House of Lords allowed the claim. It was held that the seventh Earl's father, the sixth Earl, was the lawful (de jure) successor to the earldom of Crawford (though he did not claim it). Therefore, the sixth Earl of Balcarres was posthumously declared the twenty-third Earl of Crawford, and his son, the seventh Earl of Balcarres, became the twenty-fourth Earl of Crawford. Thereafter, the two earldoms have remained united."]}, {"page": "Lord Lieutenant of Fife", "response": ["*George Lindsay-Crawford, 22nd Earl of Crawford 17 March 1794 – 1807", "*George Lindsay-Crawford, 22nd Earl of Crawford 20 May 1807 – 30 June 1808"]}, {"page": "Ludovic Lindsay, 16th Earl of Crawford", "response": ["At the death of Ludovic Lindsay, the title Earl of Crawford was passed, despite senior heirs, to his cousin, John Lindsay, who had already been created Earl of Lindsay. The earldoms of Crawford and Lindsay continued to be united until George Lindsay-Crawford, 22nd Earl of Crawford, (6th Earl of Lindsay) died unmarried in January 1808."]}, {"page": "George Lindsay", "response": ["* George Lindsay-Crawford, 22nd Earl of Crawford (1758–1808), Scottish peer and soldier"]}, {"page": "George Lindsay-Crawford, 6th Earl of Lindsay", "response": ["#REDIRECT George Lindsay-Crawford, 22nd Earl of Crawford"]}, {"page": "List of peers 1780–1789", "response": ["|George Lindsay-Crawford, 22nd Earl of Crawford||1781||1808||"]}, {"page": "List of peers 1790–1799", "response": ["|Earl of Crawford (1398)||George Lindsay-Crawford, 22nd Earl of Crawford||1781||1808||"]}]}}