{"wiki_id": "http://www.wikidata.org/entity/Q5545122", "itemLabel": "George Terrell", "itemDescription": "British politician (1862-1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Terrell", "wikipedia_page": {"main": "George John Edmond de Beauvoir Terrell (June 1862 – 7 November 1952) was a Conservative Party politician in the United Kingdom.\nHe was elected as Member of Parliament (MP) for Chippenham at the January 1910 general election, defeating the Liberal incumbent John Poynder Dickson. At the December 1918 general election he was challenged by Liberal candidate Albert Bennett and Labour party candidate Reuben George, but beat both of them to retain his seat as MP. He held the Chippenham seat until his defeat at the 1922 general election by the Liberal candidate Alfred Bonwick.\nHe was the father of Sir Reginald Terrell; unusually, father and son sat in Parliament at the same time, with Reginald representing Henley from 1918 until 1924.", "link_mentions": [{"page": "Terrell", "response": ["*George Terrell (1862–1952), English politician"]}, {"page": "Chippenham (UK Parliament constituency)", "response": ["|George Terrell", "*George Terrell (Unionist) "]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["| George Terrell"]}, {"page": "List of MPs elected in the January 1910 United Kingdom general election", "response": ["| George Terrell"]}, {"page": "Alfred Bonwick", "response": ["He was Liberal candidate for the Unionist seat of the Chippenham division of Wiltshire at the 1922 General Election. He was a supporter of H. H. Asquith and an opponent of the Coalition Government of David Lloyd George. He was elected as Member of Parliament (MP) at the first attempt, defeating the Conservative MP George Terrell. This was the first time a Liberal had won Chippenham since the landslide election of 1906;"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*George Terrell; MP for Chippenham (1910–1922)"]}, {"page": "List of UK Parliamentary election petitions", "response": ["| December 1910 || Chippenham || Bryn Hozier Freeman || George Terrell || Recount || Withdrawn || The recount reduced Terrell's majority from 26 to 24, with 21 further ballot papers which had been rejected. As they could not overturn Terrell's majority, Freeman applied for and was given permission to withdraw the petition. Heard as a special case by request of the parties. || 6 O'M & H 99"]}, {"page": "Reginald Terrell", "response": ["He was born in Mortlake, Surrey, the son of George Terrell and his wife, Mary Terrell. Unusually, he and his father both sat in Parliament at the same time, with his father representing Chippenham from 1910 until 1922."]}, {"page": "Terrell, George", "response": ["#redirectGeorge Terrell"]}]}}