{"wiki_id": "http://www.wikidata.org/entity/Q5544820", "itemLabel": "George Stephen Ritchie", "itemDescription": "Royal Navy admiral (1914-2012)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Stephen_Ritchie", "wikipedia_page": {"main": "Rear-Admiral George Stephen Ritchie CB DSC (30 October 1914 – 8 May 2012) was a British admiral noted for his cartographic and hydrographic work.", "link_mentions": [{"page": "Ritchie", "response": ["*George Stephen Ritchie (1914-2012), naval officer and Hydrographer of the Navy (1966–1971)"]}, {"page": "United Kingdom Hydrographic Office", "response": ["Following the war, the First International Hydrographic Conference was held in London. It led to the establishment in 1921 of the International Hydrographic Organization. In the 1930s, the systematic and regular collection of oceanographic and naval meteorological data started. In the Second World War, while led by Vice-Admiral Sir John A. Edgell, chart printing moved to Creechbarrow House in Taunton in June 1941. This was the first purpose-built chart making factory, and was designed by the Chief Draughtsman, Mr Jowsey. In 1968, compilation staff were transferred from Cricklewood to Taunton, thus bringing together the main elements of the Hydrographic Office. A purpose-built office, named after Alexander Dalrymple, was opened. Metrication and computerisation of charts began in the later 1960s and early 1970s under the leadership of Rear-Admiral Sir Edmund G. Irving (1960–1966), Rear-Admiral George Stephen Ritchie (1966–1971), Rear-Admiral Geoffrey P. D. Hall (1971–1975) and Rear-Admiral Sir David W. Haslam (1975–1985)."]}, {"page": "George Ritchie", "response": ["* George Stephen Ritchie (1914–2012), British admiral and cartographer"]}, {"page": "George Steven Ritchie", "response": ["#REDIRECT George Stephen Ritchie"]}, {"page": "George stephen ritchie", "response": ["#REDIRECT George Stephen Ritchie "]}, {"page": "2012 in the United Kingdom", "response": ["** George Stephen Ritchie, Royal Navy admiral (born 1914)"]}, {"page": "Deaths in May 2012", "response": ["*George Stephen Ritchie, 97, British war hero and hydrographer."]}, {"page": "1967 Birthday Honours", "response": ["* Rear Admiral George Stephen Ritchie, ."]}, {"page": "Royal Institute of Navigation", "response": ["The Institute expanded its focus in the 1950s and 1960s to also address issues of safety and began collaborating with similar organizations in Europe. In 1972, at its 25th anniversary, its work was recognized by Her Majesty the Queen and it became entitled to the \"Royal\" prefix and was renamed the Royal Institute of Navigation. Some of the Presidents of the Institute during this time included Donald Sadler (the astronomer and mathematician) who was President from 1953 to 1955, Rear Admiral Edmund George Irving who was President from 1964 to 1967 and Rear Admiral George Stephen Ritchie who was President from 1970 to 1972."]}, {"page": "G.S. Ritchie", "response": ["#redirect George Stephen Ritchie"]}]}}