{"wiki_id": "http://www.wikidata.org/entity/Q5544891", "itemLabel": "George Strauss", "itemDescription": "British politician (1901-1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Strauss", "wikipedia_page": {"main": "George Russell Strauss, Baron Strauss PC (18 July 1901 – 5 June 1993) was a long-serving British Labour Party politician, who was a Member of Parliament (MP) for 46 years and was Father of the House of Commons from 1974 to 1979.", "link_mentions": [{"page": "George Orwell", "response": ["At the BBC, Orwell introduced Voice, a literary programme for his Indian broadcasts, and by now was leading an active social life with literary friends, particularly on the political left. Late in 1942, he started writing regularly for the left-wing weekly TribuneRodden (1989)Crick (1982) directed by Labour MPs Aneurin Bevan and George Strauss. In March 1943 Orwell's mother died and around the same time he told Moore he was starting work on a new book, which turned out to be Animal Farm."]}, {"page": "Aneurin Bevan", "response": ["He married fellow Socialist MP Jennie Lee in 1934, after they met in London. Described as \"more left-wing than Nye\", Lee became a considerable influence on Bevan's political career. They were early supporters of the socialists in the Spanish Civil War, and Bevan visited the country in 1938. In 1936 he joined the board of the new socialist newspaper Tribune. His agitations for a united socialist front of all parties of the left (including the Communist Party of Great Britain) led to his brief expulsion from the Labour Party from March to November 1939 (along with Stafford Cripps, C. P. Trevelyan and three others). Bevan and Cripps had previously been threatened with disciplinary action by the party for sharing a stage with a Communist speaker, and all party members were threatened with expulsion if they were associated with the Popular Front. Bevan and another expelled MP, George Strauss, appealed against the decision. Bevan was readmitted to the party on 20 December 1939, after agreeing \"to refrain from conducting or taking part in campaigns in opposition to the declared policy of the Party\"."]}, {"page": "Hugh Gaitskell", "response": ["Marshall Aid, which had totalled $3.1bn over previous three years, ended officially on 1 January 1951, although in practice it ended six weeks earlier. It was held that the balance of payments was now strong enough for it no longer to be necessary. Harold Wilson (President of the Board of Trade) and George Strauss (Minister of Supply) warned Gaitskell that the burden of rearmament was too much for the shortage of raw materials and manufacturing capacity, but Gaitskell ignored them as they were friends of Bevan. On 27 January 1951 Bevan was reshuffled to the Ministry of Labour with Health, now under Hilary Marquand, downgraded to a non-Cabinet appointment.Dell 1997, p.146 Gaitskell welcomed the changes as reducing an obstacle to economies in health spending.Campbell 2010, p205"]}, {"page": "Edward Shackleton, Baron Shackleton", "response": ["He stood unsuccessfully for Labour at Epsom in the 1945 general election and in the 1945 Bournemouth by-election. In 1946, Shackleton was elected as Labour Member of Parliament for Preston in a by-election.  In 1949 Attlee appointed him PPS to Minister of Supply, George Strauss."]}, {"page": "Tribune (magazine)", "response": ["Tribune was founded in early 1937 by two wealthy left-wing Labour Party Members of Parliament (MPs), Sir Stafford Cripps and George Strauss, to back the Unity Campaign, an attempt to secure an anti-fascist and anti-appeasement united front between the Labour Party and socialist parties to the left. The latter included Cripps's (Labour-affiliated) Socialist League, the Independent Labour Party (ILP) and the Communist Party of Great Britain (CPGB)."]}, {"page": "Stafford Cripps", "response": ["Cripps was an early advocate of a united front against the rising threat of fascismDavid Marquand, \"Sir Stafford Cripps\" in Michael Sissons & Philip French, Age of Austerity (Oxford: Oxford University Press, 1986), pp. 157–175. and he opposed an appeasement policy towards Nazi Germany. In 1936 he was the moving force behind a Unity Campaign, involving the Socialist League, the Independent Labour Party and the Communist Party of Great Britain, designed to forge electoral unity against the right. Opposed by the Labour leadership, the Unity Campaign failed in its intentions. Rather than face expulsion from Labour, Cripps dissolved the Socialist League in 1937. Tribune, set up as the campaign's newspaper by Cripps and George Strauss, survived. In early 1939, however, Cripps was expelled from the Labour Party for his advocacy of a Popular Front with the Communist Party, the Independent Labour Party, the Liberal Party and anti-appeasement Conservatives."]}, {"page": "List of MPs elected in the 1945 United Kingdom general election", "response": ["|George Strauss"]}, {"page": "List of MPs elected in the 1950 United Kingdom general election", "response": ["|George Strauss"]}, {"page": "List of MPs elected in the October 1974 United Kingdom general election", "response": ["|George Strauss"]}, {"page": "List of MPs elected in the February 1974 United Kingdom general election", "response": ["|George Strauss"]}, {"page": "List of Privy Counsellors (1936–1952)", "response": ["*George Strauss (1901–1993)"]}, {"page": "Minister of Supply", "response": ["| The Right HonourableGeorge StraussMP for Lambeth North before 1950MP for Vauxhall after 1950"]}, {"page": "Elizabeth Butler-Sloss, Baroness Butler-Sloss", "response": ["She stood as the Conservative candidate for Vauxhall in the 1958 London County Council election, and the equivalent constituency in the 1959 General Election, where she won 38% of the vote, but was defeated by the Labour MP George Strauss."]}, {"page": "George Rogers (British politician)", "response": ["Rogers was elected as MP for Kensington North in 1945. He was Secretary of the Parliamentary Painting Group 1950–1970 and Parliamentary Private Secretary to George Strauss, Minister of Supply from 1947 to 1949 and to Kenneth Younger, Minister of State for Foreign Affairs in 1950.  He was a delegate to the United Nations Assembly in 1950, and to the Council of Europe and Western European Union from 1961 to 1963."]}, {"page": "Vauxhall (UK Parliament constituency)", "response": ["George Strauss was appointed Minister of Supply from 1947 to 1951 during the Attlee Ministry. Kate Hoey was Minister for Sport (1999-2001) during the Blair Ministry.https://api.parliament.uk/historic-hansard/offices/under-secretary-of-state", "| George Strauss"]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| George Strauss"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| George Strauss"]}, {"page": "List of MPs elected in the 1964 United Kingdom general election", "response": ["| George Strauss"]}, {"page": "List of MPs elected in the 1966 United Kingdom general election", "response": ["| George Strauss"]}, {"page": "Attlee ministry", "response": ["|George Strauss||7 October 1947|| ", "|rowspan=3|Parliamentary Secretary to the Minister of Transport||George Strauss||4 August 1945|| "]}, {"page": "Bob Mellish", "response": ["In 1950 he was appointed Parliamentary Private Secretary to the Minister of Supply, George Strauss, and then in 1951 as PPS to the Minister for Pensions, George Isaacs. He was also Chairman of the London Regional Labour Party from 1956 to 1977."]}, {"page": "Tom Driberg", "response": ["On 16 February 1951 Driberg surprised his friends by announcing his engagement to Ena Mary Binfield (née Lyttelton).The obituary in the Church Times referred to his \"unexpected marriage\", having been \"considered a confirmed bachelor\". A former Suffolk county councillor, she worked as an administrator at the Marie Curie Hospital in London and was well known in senior Labour circles; she had met Driberg in 1949, at a weekend party given by the government minister George Strauss. According to her son, she was fully aware of Driberg's sexual preferences, but looked forward to some political excitement, and \"thought they could do a useful job as Mr. and Mrs.\" Driberg's motives are less clear, but he told his friend John Freeman that he needed someone to run Bradwell Lodge, to which he had returned in 1946 after its release by the RAF.Wheen (2001), pp. 245–47"]}, {"page": "List of MPs elected in the 1935 United Kingdom general election", "response": ["|George Strauss"]}]}}