{"wiki_id": "http://www.wikidata.org/entity/Q5542889", "itemLabel": "George Nicholson", "itemDescription": "English botanist and horticulturist (1847–1908)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Nicholson_(horticulturist)", "wikipedia_page": {"main": "George Nicholson (7 December 1847 Sharow - 20 September 1908), was an English botanist and horticulturist, amongst 60 awarded the Victoria Medal of Honour by the Royal Horticultural Society in 1897 for their contributions to horticulture. He is noted for having edited \"The Illustrated Dictionary of Gardening\", produced as an eight-part alphabetical series between 1884 and 1888 with a supplement, and published by L. Upcott Gill of London. It was also published in New York in 1889 by The American Agriculturist in 4 Volumes.", "link_mentions": [{"page": "Veitch Memorial Medal", "response": ["* 1894 : Victor Lemoine (France) (1823–1911),Judith M. Taylor  George Nicholson (1847–1908) "]}, {"page": "George Nicholson", "response": ["George Nicholson may refer to:", "*George Nicholson (diplomat) (floruit 1577-1603), English agent in Scotland", "*George Nicholson (printer) (1760–1825), English printer", "*George Nicholson (footballer) (1905–?), English professional footballer", "*George Nicholson (horticulturist) (1847–1908), English horticulturist", "*George Nicholson (rugby union) (1878–1968), New Zealand rugby union player see The Original All Blacks", "*George Nicholson (politician) (1868–1935), Canadian Member of Parliament", "*George Nicholson (sailor) (born 1937), British Olympic sailor"]}, {"page": "George Nicholson (botanist)", "response": ["#REDIRECT George Nicholson (horticulturist)"]}, {"page": "G.Nicholson", "response": ["#REDIRECT George Nicholson (horticulturist)"]}, {"page": "George Nicholson (horticulturalist)", "response": ["#REDIRECT George Nicholson (horticulturist)"]}, {"page": "Tulipa alberti", "response": ["It has 3-4 leaves, which are glaucous green,George Nicholson (Editor)  without blotches, and broad. They are lanceolate (lance shaped), or crispate (curled). The basal leaf is around  long, and around  wide. Other leaves can be  by  wide, and undulated, or wavy."]}, {"page": "Felicia fruticosa", "response": ["This species was first described from the Cape by Carl Linnaeus in 1764 as Aster fruticosus. In 1803, Carl Ludwig Willdenow invalidly changed the name to Aster fruticulosus. In 1828, Henri Cassini described another specimen as Diplostephium longipes. When Christian Friedrich Lessing reassigned Linaeus's species, he maintained Willdenow's change, calling the species Diplopappus fruticulosus. Nees von Esenbeck also kept the invalid name, when he moved it again, creating the combination Diplostephium fruticulosum in 1833. In the same publication he also described Diplostephium extenuatum, which was reassigned by Augustin Pyramus de Candolle, who made the name Diplopappus extenuatus in 1836. George Nicholson proposed to include the species in the genus Felicia and so made the combination that is currently in use: Felicia fruticosa. Margaret Levyns published a correction of Lessing's error in 1948, making the combination Diplopappus fruticosus. In 1973 Jürke Grau considered all these names synonymous."]}, {"page": "American Agriculturist", "response": ["In 1889, it published The Illustrated Dictionary of Gardening: A Practical and Scientific Encyclopedia of Horticulture for Gardeners and Botanists, (in 4 Volumes), which was edited by George Nicholson,  This became the basis of the RHS's Dictionary of Gardening."]}, {"page": "List of plant genera named for people (K–P)", "response": ["|data-sort-value=\"Nicholson\"|George Nicholson (1847–1908)"]}]}}