{"wiki_id": "http://www.wikidata.org/entity/Q5542495", "itemLabel": "George Mills", "itemDescription": "British Royal Air Force commander", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Mills_(RAF_officer)", "wikipedia_page": {"main": "Air Chief Marshal Sir George Holroyd Mills,  (26 March 1902 – 14 April 1971) was a senior Royal Air Force commander. After his retirement from the RAF, Mills served as Black Rod in the Houses of Parliament until 1970. He was also a trustee of the Imperial War Museum.", "link_mentions": [{"page": "Black Rod", "response": ["* 18 June 1963 – October 1970: Air Chief Marshal Sir George Mills"]}, {"page": "Mills (surname)", "response": ["*George Mills (footballer) (1908–1970), English footballer", "*George Mills (RAF officer) (1902–1971), British Air Chief Marshal", "*Roger George Mills (born 1948), English race walker"]}, {"page": "Supreme Headquarters Allied Powers Europe", "response": ["*** Allied Air Forces Central Europe (AAFCE) – Air Chief Marshal Sir George Mills, Royal Air Force"]}, {"page": "Balkan Air Force", "response": ["The Balkan Air Force (BAF) was an Allied air formation operating in the Balkans during World War II. Composed of units of the Royal Air Force and South African Air Force under the Mediterranean Allied Air Forces command, it was active from 7 June 1944 until 15 July 1945. Air Vice Marshal William Elliot and then George Mills, both RAF officers, were its Air Officer Commanding (AOC).", "The Balkan Air Force was disbanded on 15 July 1945. During its short existence, it was commanded by (British) Royal Air Force Air Vice Marshals William Elliot and George Mills.\"Overseas Commands - Middle East & Mediterranean\"  Air of Authority. Retrieved November 2008."]}, {"page": "Nassau Agreement", "response": ["The possibility of the manned bomber becoming obsolete by the late 1960s in the face of improved air defences  was foreseen. One solution was the development of long-range missiles. In 1953, the Assistant Chief of the Air Staff  (Operational Requirements), Air Vice-Marshal Geoffrey Tuttle, requested a specification for a ballistic missile with  range, and work commenced at the Royal Aircraft Establishment in Farnborough later that year. In April 1955, the Commander-in-Chief of RAF Bomber Command, Air Chief Marshal Sir George Mills expressed his dissatisfaction with the counterforce strategy, and argued for a countervalue one that targeted administration and population centres for their deterrent effect."]}, {"page": "Nuclear weapons of the United Kingdom", "response": ["Independent targeting was vital. The Chiefs of Staff believed that—contrary to Tizard's view—once the Soviet Union became able to attack the United States itself with nuclear weapons in the late 1950s, America might not risk its own cities to defend Europe, or not emphasise targets that endangered the United Kingdom more than the United States. Britain thus needed the ability to convince the USSR that attacking Europe would be too costly regardless of American participation. Part of the perceived effectiveness of an independent deterrent was the willingness to target enemy cities. Slessor saw atomic weapons as a way to avoid a third devastating world war given that the two previous ones had begun without them.  When Air Marshal Sir George Mills became head of RAF Bomber Command in 1955 he similarly insisted on targeting Soviet cities."]}, {"page": "George Holroyd Mills", "response": ["#REDIRECT George Mills (RAF officer)"]}, {"page": "George Mills", "response": ["George Mills may refer to:", "*George Mills (footballer) (1908–1970), English footballer", "*George Mills (RAF officer) (1902–1971), British Air Chief Marshal", "*George Mills (novel), a 1982 novel by American author Stanley Elkin", "*George Mills (cricketer, born 1793) (1793–1865), English cricketer", "*George Mills (cricketer, born 1867) (1867–1942), New Zealand cricketer", "*George Mills (cricketer, born 1916) (1916–1979), New Zealand cricketer", "*George Mills (cricketer, born 1923) (1923–1983), English cricketer", "*George Mills (politician) (1876–1948), Member of the Legislative Assembly of Alberta, 1920–1926", "*George Mills (writer) (1896–1972), children's author and schoolmaster", "*George Mills (artist) (1792–1824), British sculptor, engraver and medallist", "*George Mills (shipbuilder) (1808–1881), Scottish shipbuilder, journalist and novelist", "*George Mills (athlete) (born 1999), British champion athlete"]}, {"page": "George Mills (Black Rod)", "response": ["#REDIRECT George Mills (RAF officer)"]}, {"page": "Strategic Air Command in the United Kingdom", "response": ["The RAF started to acquire its own nuclear weapons, and these were supplemented with US nuclear weapons acquired under Project E. When Air Chief Marshal Sir George Mills took charge of RAF Bomber Command in 1955, he was given the mission of attacking the Soviet airfields; the Chief of the Air Staff, Air Chief Marshall Sir William Dickson justified the number of V-bombers on order on the basis that 150 needed to be neutralised. Mills argued that in view of the devastation that thermonuclear weapons could cause in the UK, that this was insufficient, and that policy needed to switch to one of deterrence. Instead of targeting airfields, the RAF should target the civilian population. Thus, the RAF and USAF were operating under different doctrines, but the value of coordinating strategic air forces in reducing expense and duplication was recognised."]}, {"page": "British Defence Staff – US", "response": ["*1959-1962 Air Chief Marshal Sir George Mills"]}, {"page": "Nigel Mills (RAF officer)", "response": ["Mills was the son of Air Chief Marshal Sir George Mills. He was educated at Berkhamsted School and Middlesex Hospital Medical School. He was Director General Medical Services (Royal Air Force) from 1987 to 1990 and Surgeon General from 1990 to 1991."]}, {"page": "Allied Air Forces Central Europe", "response": ["| Air Chief Marshal Sir George Mills"]}, {"page": "List of permanent representatives of the United Kingdom to NATO", "response": ["| 85px || Air Chief Marshal || Sir George Mills || 1959 || 1962"]}]}}