{"wiki_id": "http://www.wikidata.org/entity/Q5543175", "itemLabel": "George Palmer", "itemDescription": "English businessman, proprietor of the Huntley & Palmers biscuit manufacturers", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Palmer_(businessman)", "wikipedia_page": {"main": "George Palmer (18 January 1818 – 19 August 1897) was a British entrepreneur, being mostly known as proprietor of the Huntley & Palmers biscuit manufacturers of Reading in England.", "link_mentions": [{"page": "List of companies named after people", "response": ["* Huntley and Palmers – Joseph Huntley and George Palmer"]}, {"page": "Bucklebury", "response": ["*George Palmer (1818–1897), proprietor of the Huntley & Palmers biscuit manufacturers", "*George William Palmer (1851–1913), Liberal Member of Parliament, son of George Palmer"]}, {"page": "Reading (UK Parliament constituency)", "response": ["| George Palmer"]}, {"page": "Long Sutton, Somerset", "response": ["* George Palmer, founder of Huntley and Palmers biscuits, was born in the village."]}, {"page": "Huntley & Palmers", "response": ["Huntley & Palmers is a British company of biscuit makers originally based in Reading, Berkshire. Formed by Joseph Huntley in 1822, the company became one of the world's first global brands (chiefly led by George Palmer who joined in 1841) and ran what was once the world’s largest biscuit factory. The biscuits were sold in elaborately decorated biscuit tins. In 1900 the company's products were sold in 172 countries, and their global reach saw their advertising posters feature scenes from around the world. Over the years, the company was also known as \"J. Huntley & Son\" and \"Huntley & Palmer\".", "=== George Palmer ===", "In 1838 Joseph Huntley was forced by ill-health to retire, handing control of the business to his older son Thomas. In 1841, Thomas took as a business partner George Palmer, a distant cousin and a Quaker. George Palmer soon became the chief force behind its success, establishing sales agents across the country. The company soon outgrew its original shop and moved to a factory on King’s Road in 1846, near the Great Western Railway. The factory had an internal railway system with its own steam locomotives and one of these has been preserved near Bradford.", "Thomas Huntley died in 1857, but George Palmer continued to direct the firm successfully aided by his brothers, William Isaac Palmer and Samuel Palmer, and subsequently by his sons, as heads of the company. They became biscuit makers to the British Royal Family and in 1865 expanded into the European continent, and received royal warrants from Napoleon III and Leopold II of Belgium. At their height, they employed over 5,000 people and in 1900 were the world's largest biscuit firm. The origins of the firm's success lay in a number of areas. They provided a wide variety of popular products, producing 400 different varieties by 1903, and mass production enabled them to price their products keenly. One source of flour was Hambleden Mill, a few miles down the Thames. Every week a barge, Maid of the Mill brought flour upriver from the mill."]}, {"page": "George Palmer", "response": ["George Palmer may refer to:", "*George Palmer (MP for South Essex) (1772–1853), English businessman, politician, and philanthropist", "*George Palmer (British Army officer) (1857–1932), British Conservative Party politician", "* George Palmer (rugby league) rugby league footballer of the 1950s, for Batley and England", "* George Palmer (Australian cricketer) (1903–1986), Australian cricketer", "* George Palmer (Warwickshire cricketer) (1897–1962), English cricketer, played for Warwickshire in 1928", "* George Palmer (Leicestershire cricketer) (1917–2012), English cricketer, played for Leicestershire and South Australia", "* George Palmer (Australian footballer) (1879–1956), Australian rules footballer", "*George Palmer (bushranger) (c. 1846–1869), Australian bushranger", "*George Palmer (businessman) (1818–1897), Quaker entrepreneur and biscuit manufacturer of Reading, England", "*George Palmer (colour theorist) (c. 1746–1826), English dye chemist, color theorist, inventor, and soldier", "*George Palmer (EastEnders), fictional character in the BBC soap opera EastEnders", "*George Palmer (composer) (born 1947), Australian classical composer and judge of the NSW Supreme Court", "* George Palmer (Lieutenant Colonel), South Australian Colonisation Commissioner (and son of George Palmer (MP for South Essex), above)"]}, {"page": "George William Palmer (British politician)", "response": ["He was born in Reading, the son of George Palmer and his wife, Elizabeth Sarah, the daughter of Robert Meteyard. Like his father, George William Palmer served as mayor of Reading and represented the town in parliament. He served as Liberal Member of Parliament for the Reading borough constituency from 1892 until his defeat at the 1895 general election. He regained the seat at a by-election in 1898, and held it until he resigned from Parliament in 1904, due to advancing deafness."]}, {"page": "Palmer Park, Reading", "response": ["Palmer Park is a public park in Reading, England. The land for the park was given to the town by the proprietors of the Huntley & Palmers biscuit firm and it contains a statue of George Palmer."]}, {"page": "Joseph Huntley", "response": ["At this time, London Street was the main stage coach route from London to Bristol, Bath and the West Country. One of the main calling points of the stage coaches was the Crown Inn, opposite Joseph Huntley's shop and he started selling his biscuits to the travellers on the coaches.  Because the biscuits were vulnerable to breakage on the coach journey, he started putting them in a metal tin. Out of this innovation grew two businesses: Joseph (the elder's) biscuit shop that was to become the famous biscuit manufacturer Huntley & Palmers, and Huntley, Bourne and Stevens, a firm of biscuit tin manufacturers founded by his younger son, also called Joseph. In 1838, Joseph Huntley was forced by ill-health to retire, handing control of the shop to his older son Thomas Huntley, who was joined in partnership by George Palmer."]}, {"page": "Edward Bagnall Poulton", "response": ["In 1881 he married Emily Palmer (d.1939), daughter of George Palmer, M.P. for Reading and head of Huntley and Palmer's biscuit company; they had five children. Three of them were dead by 1919. Their eldest son Dr. Edward Palmer Poulton of Guy's Hospital died in 1939, meaning that Sir Edward was outlived only by his daughter Margaret Lucy (1887–1965), wife of Dr Maxwell Garnett. Poulton's son, Ronald Poulton-Palmer played international rugby for England and was killed in May 1915 in World War I. His first daughter Hilda married Dr Ernest Ainsley-Walker and died in 1917.  His youngest daughter, Janet Palmer, married Charles Symonds in 1915 and died in 1919."]}, {"page": "William Isaac Palmer", "response": ["William Isaac Palmer (1824 – 1893) was a member of the Palmer family, proprietors of the Huntley & Palmers biscuit manufacturers of Reading in England. He was the brother of George Palmer, the first of the Palmer family to be involved in the firm, and became a partner in the firm on Thomas Huntley's death in 1857."]}, {"page": "George Palmer (1818-1897)", "response": ["#REDIRECT George Palmer (businessman)"]}, {"page": "Augustus Desiré Waller", "response": ["He studied medicine at Aberdeen University, where he qualified in 1878 and obtained his M.D. in 1881. In 1883, he became a lecturer in physiology at the London School of Medicine for Women. Whilst there he met his wife, Alice Palmer, who was one of his students and daughter of George Palmer, MP for Reading and founder of the biscuit manufacturers Huntley and Palmer."]}, {"page": "1897 in the United Kingdom", "response": ["* 19 August – George Palmer, biscuit manufacturer (born 1818)"]}, {"page": "Sir Walter Palmer, 1st Baronet", "response": ["Palmer was born in Reading, Berkshire the son of George Palmer who founded the firm of Huntley & Palmer, biscuit manufacturers.Burke's Peerage He was educated at University College, London, and also at the Sorbonne, Paris. He became a director of the firm and was also the first chairman of University College, Reading. In 1900 he was appointed a deputy lieutenant of Berkshire."]}, {"page": "1818 in the United Kingdom", "response": ["* 18 January – George Palmer, biscuit manufacturer (died 1897)"]}, {"page": "Gerald Palmer (author)", "response": ["Born to Eustace Exall Palmer of Drayton House at Sherfield on Loddon in Hampshire, a director of Huntley & Palmers biscuits, and his wife, Madeline Mary Howell, at Reading in Berkshire.Births Sep 1904 volume 2c page 348 Gerald Palmer was the grandson of Alfred Palmer (1852–1936) who had graduated with a Doctor of Science (D.Sc.). He too was President of the Council of the University of Reading. Alfred was also director of Huntley & Palmer's biscuits, a county magistrate then High Sheriff in 1905 and lived at Wokefield Park; his father in turn was George Palmer MP."]}, {"page": "George Blackall Simonds", "response": ["File:Statue of George Palmer.jpg|Statue of George Palmer"]}, {"page": "List of MPs elected in the 1880 United Kingdom general election", "response": ["| George Palmer"]}, {"page": "Marlston", "response": ["Marlston House was built between 1895 and 1899 in the Elizabethan style, replacing an Elizabethan era house on the same site. It was built for George Palmer, who was one of the founders of the Huntley & Palmers biscuit factory, mayor of the nearby town of Reading, and Member of Parliament for Reading. After George Palmer died in 1897, the house was occupied by his son, George William Palmer, who was also mayor of, and Member of Parliament for, Reading. It is now the home of Brockhurst and Marlston House School, a large preparatory school."]}, {"page": "List of United Kingdom by-elections (1868–1885)", "response": ["|George Palmer"]}, {"page": "Brockhurst and Marlston House School", "response": ["The current Marlston House was built between 1895 and 1899 by Edward Burgess in the Elizabethan style to replace that remodelled house. It was built for George Palmer, who was one of the founders of the Huntley & Palmers biscuit factory, mayor of the nearby town of Reading, and Member of Parliament for Reading. After George Palmer died in 1897, the house was occupied by his son, George William Palmer, who was also mayor of, and Member of Parliament for, Reading."]}, {"page": "Statue of George Palmer", "response": ["The statue of George Palmer stands in Palmer Park, in Reading, Berkshire.  The statue, by George Blackall Simonds, was unveiled in 1891, though it was originally in Broad Street and only later moved to Palmer Park.  The statue has been classed Grade II Listed monument since 14 December 1978.", "The statue was given by the towns-folk of Reading, \"in recognition of his services and gifts to the town\",DNB \"George Palmer\" and unveiled 4 November 1891, the same day of the opening of the 49 acre Palmer Park.  Four thousand subscribed to the cost of the statue.  The opening of the park and the  unveiling of the statue have been described as \"the biggest celebration Reading had ever seen.", "George Palmer (1818–1897) was a Quaker baker, known for his partnership with Thomas Huntley, which formed the biscuit firm Huntley and Palmers.  Palmer invented machinery which stamped biscuits in bulk.  A noted philanthropist, he gave the site of Palmer Park to Reading in 1891, as well as King's Meadow.  His family also donated the site of Reading University.  The borough also granted him Freedom of the City, the first person ever honoured thus, in recognition of his many contributions to civic life."]}, {"page": "Timeline of Reading, Berkshire", "response": ["* 1841 – Cousins Thomas Huntley and George Palmer form the biscuitmaking partnership of Huntley & Palmers."]}, {"page": "Gladys Milton Palmer", "response": ["Palmer was born on 8 January 1884 into a prominent Quaker family. She was the only child of Sir Walter Palmer, 1st Baronet and Jean Craig. Her paternal grandfather was George Palmer, a proprietor of Huntley & Palmers. Her maternal grandfather was the engineer and politician William Young Craig. She was a niece of George William Palmer and a great-niece of William Isaac Palmer."]}]}}