{"wiki_id": "http://www.wikidata.org/entity/Q5543584", "itemLabel": "George Purefoy-Jervoise", "itemDescription": "English politician", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Purefoy-Jervoise", "wikipedia_page": {"main": "George Purefoy-Jervoise (10 April 1770 – 1 December 1847) was an English politician.\nHe was the eldest son of Rev. George Hudleston Jervoise Purefoy Jervoise of Britford, Wiltshire and educated at Westminster School in 1781–1786 and Corpus Christi College, Oxford in 1787–91. He inherited the Herriard estate from his uncle Tristram Jervoise of Britford.\nHe was a Member of Parliament (MP) for Salisbury on 17 February 1813 – 1818 and Hampshire 1820–1826. He was appointed High Sheriff of Hampshire for 1830–1831.\nHe married twice: firstly Elizabeth, the daughter and heiress of Thomas Hall of Preston Candover, Hampshire and secondly Anna Maria Selina, the daughter of Wadham Locke of Rowdeford, Wiltshire.", "link_mentions": [{"page": "James Purefoy", "response": ["Purefoy was born in Taunton, Somerset, the eldest son of Anthony Chetwynd and Shirley (née Taylor) Purefoy. The Purefoy family were landed gentry, of Shalstone, Buckinghamshire; the family name passed in the female line through Anthony Chetwynd Purefoy's mother, Mary Lilias Geraldine, daughter of Admiral Richard Purefoy (who had changed his surname from Fitzgerald as his mother was the heir and niece of the politician George Purefoy-Jervoise, head of the family); she married Rev. Brian Mews, vicar of Tewkesbury, who changed his name to Purefoy.Burke's Landed Gentry, 17th ed., ed. L. G. Pine, 1952, Purefoy of Shalstone pedigree"]}, {"page": "Salisbury (UK Parliament constituency)", "response": ["| George Purefoy-Jervoise"]}, {"page": "Hampshire (UK Parliament constituency)", "response": ["| George Purefoy-Jervoise"]}, {"page": "Purefoy", "response": ["*George Purefoy-Jervoise (1770–1847), English politician"]}, {"page": "Sir Thomas Miller, 6th Baronet", "response": ["On 24 February 1820, when an election for the Hampshire county constituency was approaching, Miller wrote to George Purefoy-Jervoise, a successful candidate, to say that he would be away on polling day but would use his influence among his tenants to secure votes for Jervoise.44M69 at nationalarchives.gov.uk, accessed 12 August 2008"]}, {"page": "Jervoise", "response": ["*George Purefoy-Jervoise"]}, {"page": "Purefoy-Jervoise", "response": ["#REDIRECT George Purefoy-Jervoise"]}, {"page": "George Purefoy Jervoise", "response": ["#REDIRECT George Purefoy-Jervoise"]}, {"page": "List of United Kingdom by-elections (1806–1818)", "response": ["|17 February 1813||Salisbury||c||William Hussey||George Purefoy-Jervoise||Death"]}, {"page": "Wadham Locke", "response": ["The Lockes had six daughters. The youngest in the family was Frances Isabella, known as the diarist Fanny Duberly, who married in 1850 Henry Duberly (1822–1891). The eldest daughter, Anna Maria Selina, married George Purefoy-Jervoise. After his death, she married in 1848 Francis Marx. The other daughters were:"]}, {"page": "List of MPs elected in the 1820 United Kingdom general election", "response": ["|George Purefoy-Jervoise||"]}, {"page": "List of MPs elected in the 1812 United Kingdom general election", "response": ["|  William Hussey – died Replaced by  George Purefoy-Jervoise  1813"]}, {"page": "Purefoy-Jervoise, George", "response": ["#redirectGeorge Purefoy-Jervoise"]}]}}