{"wiki_id": "http://www.wikidata.org/entity/Q5547589", "itemLabel": "Georgia May Foote", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Georgia_May_Foote", "wikipedia_page": {"main": "Georgia May Foote (born 11 February 1991) is an English actress and model. She is best known for playing  Alison Simmons in the BBC school drama series Grange Hill from 2005 to 2008 and Katy Armstrong in the ITV soap opera Coronation Street from 2010 to 2015. In 2015 she was runner-up on the BBC celebrity talent show Strictly Come Dancing. She came 98th in FHM's Sexiest Women of 2015.", "link_mentions": [{"page": "Through the Keyhole", "response": ["| 7 || Michael BuerkAshley RobertsDave Berry || Anthea TurnerKen HomGeorgia May Foote|| 10 October 2015 || Under 2.13"]}, {"page": "Strictly Come Dancing", "response": ["| style=\"background:silver;\"|Georgia May Foote", "|Georgia May Foote & Giovanni Pernice, Kellie Bright & Kevin Clifton", "| Georgia May Foote", "| Jill Halfpenny Mark Ramprakash Matt Di Angelo Chris Hollins Ricky Whittle Chelsee Healey Louis Smith Simon Webbe Georgia May Foote Louise Redknapp Joe McFadden Bill BaileyAJ Odudu Rhys Stephenson Tilly Ramsay", "| Chris Hollins & Ola JordanKimberley Walsh & Pasha KovalevDenise van Outen & James JordanCaroline Flack & Pasha Kovalev Georgia May Foote & Giovanni Pernice Danny Mac & Oti Mabuse Joe McFadden & Katya Jones Faye Tozer & Giovanni PerniceAshley Roberts & Pasha Kovalev HRVY & Janette ManraraRhys Stephenson & Nancy Xu"]}, {"page": "Wavertree", "response": ["*Georgia May Foote, actress"]}, {"page": "Foote", "response": ["*Georgia May Foote (born 1991), English actress and model"]}, {"page": "Weatherfield", "response": ["Ed Bailey Construction is the builder's yard situated on Victoria Street. It was formerly owned by Len Fairclough (Peter Adamson), Bill Webster (Peter Armitage), and then by Jason Grimshaw (Ryan Thomas). It is part of a chain owned by Owen Armstrong (Ian Puleston-Davies), who buys it from Bill. He keeps on Jason Grimshaw (Ryan Thomas) and hires Chris Gray (Will Thorp). Chris resigns when he discovers he has a brain tumour. In 2011, Owen hires Gary Windass (Mikey North) as a labourer and a builder, and drops Jason in late 2012. Tina McIntyre (Michelle Keegan) becomes bookkeeper in early 2013. However, Owen's daughter, Katy Armstrong (Georgia May Foote), takes over the role when Tina returns to her job at The Rovers Return. In 2014, Owen sells the yard to Jason's father, Tony Stewart (Terence Maynard) to ease his debt; Tony then gives the yard to Jason as an early birthday present. When Jason moves to Thailand in 2016, he gives control of the company to Pat Phelan (Connor McIntyre), whilst retaining ownership. In 2019, Gary went into debt and was later caught out and had to shut the business down, Eileen Grimshaw (Sue Cleaver) later found out about this and informed Jason of this, she then put the yard on the market. The site is currently owned by Ed Bailey (Trevor Michael Georges).", "When the shop is sold to Dev in 2008, Mel leaves to pursue her police career. Ryan Connor (Sol Heras) and Katy Armstrong (Georgia May Foote) work here in the build–up to their affair, which leads to both the breakdown of Katy's relationship with Chesney Brown (Sam Aston) and Ryan's departure. Chesney later begins working here when the market where he works is closed down. He is later given the role of manager. Gemma Winter (Dolly-Rose Campbell) is employed to work here in 2016. Cathy Matthews (Melanie Hill) started working here in 2017."]}, {"page": "Fiz Brown", "response": ["Fiz's trial begins and she provides her evidence before the jury leave to consider their verdicts. Fiz is found not guilty of the murders of Joy and Charlotte Hoyle (Becky Hindley), but the jury find her guilty of Colin's murder. Fiz later learns that John has returned, but is in a critical condition in hospital after his car accident. Fiz goes to the hospital and tells John that she forgives him for everything he has done. John gives the police his statement and he then dies from his injuries. Fiz then breaks down in tears and whispers to him that he will always be \"her John\". Unfortunately, John was too late. Fiz is sentenced to life imprisonment, with a minimum term of 15 years. Fiz and Chesney are devastated. Fiz asks Chesney to organise John's funeral. He initially refuses, but after his girlfriend, Katy Armstrong (Georgia May Foote), convinces him to, he agrees. Chesney later receives a phone call from Fiz saying that she has been granted bail before her review. Fiz later begins a feud with Kirsty Soames (Natalie Gumede) after she nearly slices Fiz's fingers off at work using a sewing machine. When Kirsty later attacks Fiz in her own home, Fiz realises that Kirsty is beating up her fiancé Tyrone. Fiz helps Tyrone through his dilemma with Kirsty but ends up developing feelings for him and they begin an affair. When Kirsty beats up Tyrone again, Fiz advises Tyrone to marry Kirsty so he can gain custody of his daughter Ruby. Kirsty accepts Tyrone's proposal but discovers Fiz and Tyrone's affair the day before the wedding. She humiliates the pair at the church, as many of the residents watch as Kirsty reveals Fiz is Tyrone's mystery lover. During an argument at the top of the stairs, Kirsty attempts to hit Tyrone again but ends up falling down the stairs. Fiz, Tommy Duckworth (Chris Fountain), Eileen Grimshaw (Sue Cleaver), Sean Tully (Antony Cotton) and Paul Kershaw (Tony Hirst) race round to the house to see what has happened, and Kirsty tells the police that Tyrone has been abusing her for months. Tyrone is arrested, which devastates Fiz. Tyrone's court hearing arrives, and Kirsty's mother Alison (Dawn Hope) tries to persuade Kirsty to tell the truth, but she refuses. After Kirsty assaults Julie, Kirsty confesses to the jury that she has been beating Tyrone. Tyrone is freed and Kirsty is sent to prison."]}, {"page": "The British Soap Awards", "response": ["| \"Sexiest Female\"Presented by Union J|| Michelle Keegan (Tina McIntyre in Coronation Street) || Georgia May Foote (Katy Armstrong in Coronation Street)Jacqueline Jossa (Lauren Branning in EastEnders)Natalie Anderson (Alicia Gallagher in Emmerdale)Jorgie Porter (Theresa McQueen in Hollyoaks)", "| \"Sexiest Female\"Presented by Ashley Banjo and Perri Kiely|| Michelle Keegan (Tina McIntyre in Coronation Street) || Georgia May Foote (Katy Armstrong in Coronation Street)Jacqueline Jossa (Lauren Branning in EastEnders)Jorgie Porter (Theresa McQueen in Hollyoaks)Jennifer Metcalfe (Mercedes Browning in Hollyoaks)"]}, {"page": "Sweat the Small Stuff", "response": ["|Georgia May FooteIan Smith"]}, {"page": "1991 in the United Kingdom", "response": ["* 11 February – Georgia May Foote, Actress"]}, {"page": "Ryan Connor", "response": ["Ryan's storylines include discovering that Michelle Connor (Kym Marsh) is not his biological mother, his relationships with Sian Powers (Sacha Parkinson), Katy Armstrong (Georgia May Foote) and Bethany Platt (Lucy Fallon), becoming a drug abuser, feuds with his brother Ali Neeson (Dario Coates/James Burrows), along with fellow residents Vinnie Powers (Ian Dunn), Owen Armstrong (Ian Puleston-Davies), and Sarah Platt (Tina O'Brien); encouraging his own friend Sophie Webster (Brooke Vincent) to take drugs; being in debt to drug lord Ronan Truman (Alan McKenna) that results in the character being run over by the latter; and getting beat up by local builder Gary Windass (Mikey North) after unwittingly getting involved in his loan-sharking empire. He has since started a relationship with Alya Nazir (Sair Khan) and supported her grandmother Yasmeen Nazir (Shelley King) when she goes through a coercive control ordeal at the hands of her husband, Geoff Metcalfe (Ian Bartholomew).", "Ryan grows closer to Katy Armstrong (Georgia May Foote), who gets a job working in the kebab shop. She develops feelings for Ryan and sabotages his date with Steph Britton (Tisha Merry). When Ryan confronts her, she kisses him and they begin an affair. Katy's boyfriend, Chesney Brown (Sam Aston), dislikes their friendship and feuds with Ryan. Chesney discovers the affair and ends his relationship with Katy, so she and Ryan begin a public relationship. Ryan struggles with a serious relationship and caring for Katy's young son, Joseph Brown (Lucca-Owen Warwick). When Katy spots Ryan with a random woman, Jamie-Lee (Kate Holderness), she ends their relationship. Steve then advises Ryan to find a long-term job, which makes Ryan realise there is nothing left for him in Weatherfield. He contacts a friend, who offers him a job as a DJ in Ibiza; Ryan accepts the job and leaves Weatherfield."]}, {"page": "John Stape", "response": ["Chesney learns the truth about John's link to the Hoyle family and Dorothy realises John is not Colin. John takes all three of them hostage at the Hoyle's house. John tells Chesney's girlfriend Katy Armstrong (Georgia May Foote) that he has run away. John learns the factory floor is being dug up and he gets a job working for the local builder, Owen Armstrong (Ian Puleston-Davies). One night, John returns to the factory and digs up Colin's body. However, Fiz follows him and is horrified when John confesses that the body is Colin. Fiz reluctantly agrees to help dispose of the body in the canal. Fiz follows John to the Hoyle's house and finds Chesney, Dorothy and Alan tied up in the basement. The police are called and John flees. When Fiz refuses to run away with him, John takes Hope. John discovers Fiz was run over while she was chasing after him. He visits her in hospital and returns Hope to her. The police arrive and John jumps off the hospital roof and disappears."]}, {"page": "Elton High School", "response": ["*Georgia May Foote, actor who played Katy Armstrong in Coronation Street"]}, {"page": "List of former Coronation Street characters", "response": ["|Katy Armstrong || Georgia May Foote || 2010–2015"]}, {"page": "Tina McIntyre", "response": ["Tina agrees to be a surrogate for Gary and his disabled girlfriend Izzy Armstrong (Cherylee Houston), in return for payment from Izzy's father Owen (Ian Puleston-Davies). Tommy is unhappy about this but Tina insists, explaining that they need the money to pay his debts. Tina goes through with the embryo transfer, despite concerns from Rita and Tommy's opposition. Unable to cope with Tina being pregnant with Izzy and Gary's baby, Tommy ends their relationship. In January 2013, Tina helps Tyrone and Fiz run away with Tyrone's daughter, Ruby, after Kirsty falsely accuses Tyrone of domestically abusing her. Tina feels suffocated by the Windass family as her pregnancy progresses and is shocked when Gary tries to kiss her. Outraged, she threatens to tell Izzy. Izzy's younger sister, Katy Armstrong (Georgia May Foote), finds out and tells Izzy, who confronts Gary after finding him with Tina. Tina tells Izzy what happened but goes into labour soon afterwards. Tina is rushed to hospital and gives birth to a baby boy with Tommy and Izzy present. Tommy and Tina reconcile during this time. Disgusted with Izzy's refusal to allow Gary to see the baby, Tina lets Gary into the special care baby unit but when Izzy finds him there, they argue. Worried about the baby's welfare if she gives him to Gary and Izzy, Tina reprimands them for their behaviour and throws them out. They reconcile and decide to name the baby Jake but Tina still has doubts. When the baby is strong enough to come out of the incubator, Izzy and Gary are shocked to find Tina holding him and Gary suggests Izzy should be left to bond with him. Tina tells them that she has decided to keep the baby. Izzy and Gary are outraged and she promises to repay the surrogacy money; leading to another row and Tina stops them visiting the baby. A solicitor advises them that Tina cannot be forced to sign adoption papers so Owen and Anna evict her from the flat so Tina moves in with Rita. Anna, Gary and Izzy are further angered when Tina changes the baby's name to Joe. After Gary tells Anna that there is nothing they can do to stop Tina, Anna storms into the pub and slaps her. Tina asks Tommy, Rita and Dennis if she is doing the right thing. Tommy tells Tina that he will support her regardless but she must think about how Jake will feel when he is older. Izzy and Gary reluctantly decide not to fight Tina and let her raise Jake as her child. However, after she sees Izzy say goodbye to the baby, Tina changes her mind and decides to give him to Gary and Izzy and they change his name back to Jake. Tina is devastated but Gary and Izzy let her be part of Jake's life."]}, {"page": "List of Grange Hill characters", "response": ["| Georgia May Foote "]}, {"page": "Georgia (name)", "response": ["* Georgia May Foote (born 1991), British actress"]}, {"page": "List of British former child actors", "response": ["*Georgia May Foote (born 1991)"]}, {"page": "Celebrity Juice", "response": ["*Georgia May Foote"]}, {"page": "Anna Windass", "response": ["After Eddie's departure, Anna gets close to Owen Armstrong (Ian Puleston-Davies), whose daughter Izzy (Cherylee Houston) is dating Gary. Anna is dismayed when she discovers that her landlord Jerry Morton (Michael Starke) is planning to sell No. 6. Unable to afford to buy the house, she is worried as Faye has finally found stability in her new home. Owen, much to Anna's surprise, buys the house and becomes her new landlord. This brings them closer together, making Faye jealous as she fears that Owen will take Anna away from her. Their relationship goes well, and Anna supports Owen after he discovers his 16 year old daughter Katy (Georgia May Foote) is pregnant and later helps deliver her son Joseph on Christmas Eve 2011. Owen and Anna's relationship is later tested, after Anna goes away to visit her brother; Owen looks after Faye and after discovering that Faye had poisoned the fish he had bought for Anna's garden, slapped her. Faye locked herself in her room, and upon Anna's return – the couple split, with Anna unable to forgive Owen for hitting Faye. Anna's son, Gary, and Owen's daughter, Izzy, later discover that Izzy is pregnant. The pair are overjoyed but Izzy later miscarries. Due to her disability, they approach Izzy's younger sister Katy about being a surrogate mother, and she and Owen reconcile. Izzy is told that Katy is not a suitable candidate for surrogacy as she is too young. Chesney, Katy's partner, also objects and Tina McIntyre (Michelle Keegan) offers to be surrogate instead, and the family discover that the implantation has worked and Tina is pregnant in December 2012."]}, {"page": "Gary Windass", "response": ["Gary becomes obsessed with Izzy's welfare. He takes a job at Underworld so he can be around her more. Izzy goes into town with Sean and Julie Carp (Katy Cavanagh) to get away from Gary for a while, only to get robbed by a cash point. Gary then takes Izzy's wheelchair away so she cannot leave the house and says he will later return it. He then keeps her imprisoned in the house until Izzy's father Owen (Ian Puleston-Davies) rescues Izzy. He then breaks up with Izzy. When Owen takes an interest in Anna, her adopted daughter Faye Butler (Ellie Leach) steals Owen's phone so that she and Anna can go to the cinema as planned instead of Anna meeting Owen at The Rovers. Faye later sends Anna a message that Owen does not want to meet her. After Anna finds out about the situation she tells Owen she is not interested. Later, Owen and Anna sleep together. Anna does not know if she has made the right decision so she tells Gary, who then sets Owen and Anna up at The Bistro. By then, Faye and Gary have gradually bonded. In July 2012, Izzy and Gary decide to have a baby. Izzy miscarries and they try to adopt, but can't due to Gary's criminal record. Izzy's sister Katy (Georgia May Foote) offers to be a surrogate mother to their baby. At first, they all agree, but Katy's ex-boyfriend Chesney Brown (Sam Aston) refuses to let them do it. Chesney agrees but Izzy sees it isn't fair, so she calls it off – she also breaks up with Gary because of his desire to be a dad and her not being able to give him that. They reunite and eventually select Tina as their surrogate after Owen offers to pay her. Tina is successfully impregnated with Gary and Izzy's child in November 2012, and her pregnancy goes smoothly for the first trimester, although Tina grows aggravated at Gary's interference. However, in April 2013, Gary's feelings for Tina become more romantic after Izzy leaves an antenatal class due to Gary's touching of Tina. Gary later acts on his feelings for Tina and makes a pass at her, but she rejects him. Izzy overhears Gary and Tina discussing what happened and as the pair argue Tina goes into labour. Tina gives birth to a baby boy prematurely, and Izzy stops Gary from seeing him as he tried to cheat on her. As Gary and Izzy continue to argue, Tina becomes convinced they won't make good parents so she decides to name the baby Joe and keep him for herself. Izzy and Gary visit lawyers but find out it will take years to get Joe back. Gary is devastated when Izzy gives up fighting and tells Tina she can keep Joe. Afterwards, Izzy begins to soften towards Gary and he moves back in with her."]}, {"page": "List of Coronation Street characters (2003)", "response": ["Chesney Eric Brown (also Battersby-Brown) is a fictional character in the ITV soap opera, Coronation Street, played by Sam Aston. He made his first on screen appearance during the episode airing on 10 November 2003. The character is named after singer, Chesney Hawkes. Chesney is brother to Fiz Brown (Jennie McAlpine) and son to Cilla Battersby-Brown (Wendi Peters). Chesney' storylines have included his friendship with pet dog Schmeichel and coming to terms with his death, as well as his relationship with Katy Armstrong (Georgia May Foote) who later went on to give birth to his son Joseph. Chesney recently embarked on a relationship with Sinead Tinker (Katie McGlynn)."]}, {"page": "List of Coronation Street characters (2010)", "response": ["Brian returns to the Street in October 2010, when he knocks on John's door to tell him that Colin's mother had contacted the school for his details in order to reunite with him. John is forced to lie to Brian, first claiming that he had fallen out with his mother. Owen Armstrong (Ian Puleston-Davies) then knocks on the Stapes' door and speaks to John about his brother-in-law Chesney Brown's (Sam Aston) relationship with his daughter Katy (Georgia May Foote). He calls John by his name in front of Brian and, after Owen leaves, John tells Brian that he has had to change his name because he had witnessed a murder and was in hiding from a gangland boss. Brian agrees to keep John's secret. Brian then meets Fiz's colleague Julie Carp (Katy Cavanagh) and they have a drink in the Rovers. Brian keeps winking at John whenever he is speaking to him and John tells him to stop, in case it draws attention to him. It isn't long before an attraction develops between Brian and Julie and they start dating. John, terrified that his deception will be uncovered, tries to sabotage their relationship. When Brian and Julie have a romantic meal at a restaurant, John calls Brian's ex-wife and she later shows up and Brian is forced to tell Julie he is married. Julie leaves, devastated. Brian spends the night at the Stapes' and hides when Julie calls at the house. John then convinces Brian to go back to his ex-wife and give his marriage a second chance and he leaves.", "Katy Armstrong, played by Georgia May Foote. She made her first screen appearance during the episode broadcast on 30 July 2010. Foote had previously appeared in the soap in January that same year as Jess Burrows. Katy is Owen Armstrong's (Ian Puleston-Davies) youngest daughter and Izzy Armstrong's (Cherylee Houston) sister. Her storylines have mostly revolved around her relationship with Chesney Brown (Sam Aston), becoming a mother to their son, Joseph and beginning an affair with Ryan Connor (Sol Heras). Foote's departure from the show was announced in April 2014, with her having filmed her final scenes on 16 February 2015 and departed on 20 March 2015. In 2017 th character was killed off-screen.", "Redfern returns in October 2011 when he gives evidence at Fiz's trial. He tells the court that Fiz lied during the initial stages of the police enquiry, claiming she knew nothing of John's identity theft and that she never met Joy. Redfern also states that Fiz had claimed that the first time she went to the Hoyles' house was when she followed John there and rescued Chesney and the Hoyles, leading to an angry reaction from Dorothy in the public gallery. Redfern also tells the court that John and Fiz had not told any of their friends and neighbours about the identity theft, implying that they had been acting together. Redfern visits Chesney in the cafe and receives a hostile response from him. Redfern tells Chesney that John has been hospitalized after being injured in a car crash and had kidnapped Rosie Webster (Helen Flanagan). Redfern tells Chesney that John's condition is critical and he remarks that it is ironic that John is the most hated man in Weatherfield but everyone wants him to recover in order to clear Fiz's name. Redfern later goes to the hospital to take a statement from John. Redfern sets up a camera to film the interview and John describes the details of Colin's death and proves Fiz's innocence. The following week, Redfern returns to the street. Rosie spots him and asks for updates on the case but he refuses to tell her, explaining that the investigation is still ongoing. Redfern then visits Chesney and his girlfriend Katy Armstrong (Georgia May Foote) and Chesney demands an apology for Fiz's arrest. Redfern asks to check their outside toilet where John had claimed he had hidden the hammer he used to kill Charlotte. Redfern searches the outside toilet and finds the hammer and Chesney tells him that it should prove Fiz's innocence. Redfern arranges for the hammer to be taken for forensic tests. Redfern is last seen attending Fiz's sentencing.", "| Georgia May Foote"]}, {"page": "List of Strictly Come Dancing contestants", "response": ["| Georgia May Foote"]}, {"page": "Conviction (2004 TV series)", "response": ["* Georgia May Foote as Angela Fairley"]}, {"page": "List of people from Bury", "response": ["* Georgia May Foote, actress and model"]}, {"page": "Izzy Armstrong", "response": ["Izzy is secretly delighted when she sees Gary again in September. They arrange to meet for a drink but he stands her up when Kylie Platt (Paula Lane) seduces him. Izzy is not pleased to see them together the next day, calling Gary names for sleeping around but when Izzy is insulted in The Rovers, Gary steps in. This leads to a fight outside the pub and Gary is questioned by the police. Izzy feels bad about this and urges Kirk, who saw the fight, not to tell the police anything so Gary will not be prosecuted. When Kirk, who secretly fancies Izzy, tells the police that he started the fight, Izzy softens towards Gary and tells him that she is glad that he is free. In November, Izzy is shocked to hear that Gary has been injured and one of his best friends, Luke \"Quinny\" Quinn (Steven Bell), has been killed. Gary comes home a few days later and Izzy becomes concerned about Gary's aggressive behaviour and withdrawn manner as it is clear he is suffering from post-traumatic stress disorder. In January 2011, she asks Owen to give Gary a job at the builder's yard and he agrees but sacks him after Gary attacks him and Jason when he is accidentally locked in the van. Owen tells Izzy he won't report him if she ends her relationship with him but Izzy defiantly refuses. In July 2011, Izzy is robbed by a gang of teenagers. After learning this, Gary becomes very overprotective and takes her wheelchair away so she can't leave. When Izzy's sister, Katy (Georgia May Foote) and her boyfriend Chesney Brown (Sam Aston) visit, Gary tells them that she is asleep but Katy refuses to take no for an answer and tells Owen that Gary is acting strangely so he kicks the front door down when Gary refuses to answer, to find Gary and Izzy in the corner, crying. Gary lets Izzy go and recognizing that he needs help, gets counselling for his Post-Traumatic Stress. Izzy, scared by Gary's mental state, asks him to move out so he returns to live with Anna and on Christmas Day 2011, Izzy and Gary reunite, much to the delight of Gary's sister, Faye, who has been attempting to reunite the two."]}, {"page": "Owen Armstrong", "response": ["During his time on the show, Owen became the new landlord of Weatherfield whilst attempting to recoup father-daughter relationships with both Izzy (Cherylee Houston) and her younger sister Katy (Georgia May Foote). He then developed a feud with Izzy's boyfriend Gary Windass (Mike North); formed a relationship with Gary's mother Anna (Debbie Rush); and went into business partnership with his nefarious client Pat Phelan (Connor McIntyre), who ended up conning Owen out of his £80,000 investment as revenge for Owen stealing Phelan's bike to force him in repaying him £4,000 – the result of which left both the Armstrong and Windass families virtually on the brink of financial bankruptcy. In November 2014, it was announced that Puleston-Davies had quit the serial and the character eventually left the series on 15 April 2015.", "Owen Armstrong first arrived in Weatherfield to visit his daughter Izzy (Cherylee Houston), but she is reluctant to have any involvement with him. He apologizes to Izzy for his past mistakes and agrees to give her independence, though he disapproves of her relationship with Gary Windass (Mike North). Local builder Bill Webster (Peter Armitage) is angry when Owen secures a building contract, but Bill is soon persuaded to retire and sell the Builder's Yard to Owen, so he moves into the flat above with younger daughter Katy (Georgia May Foote). Owen dates his administrator Eileen Grimshaw (Sue Cleaver) but is also attracted to Liz McDonald (Beverley Callard), the Landlady of The Rovers Return Inn. He kisses Liz, and Sean Tully (Antony Cotton) tells Eileen the truth.", "In January 2010, it was announced that actor Ian Puleston-Davies had joined the cast of Coronation Street as Owen, the psychotic father of Izzy (Cherylee Houston). Coronation Street producer, Kim Crowther called Puleston-Davies a \"wonderful actor\" and added that she had \"really high hopes\" for him. He signed an initial six-month contract. Coronation Street producers approached Puleston-Davies about appearing in the show after they saw him star in the play, Everybody Loves A Winner in 2009. Puleston-Davies met with producers, who created the role of Owen especially for him. He began filming his scenes in February. Owen was originally given the surname of Butterfield, but this was later changed to Armstrong. Georgia May Foote was later cast as Owen's other daughter, Katy."]}, {"page": "This Is England '86", "response": ["* Georgia May Foote as Gemma"]}, {"page": "Chesney Brown", "response": ["Chesney is the younger brother of Fiz Brown (Jennie McAlpine) and son of Cilla Battersby-Brown (Wendi Peters). He is also a father of 5 (3 sons and 2 daughters, 1 is a singleton and the other 4 are quadruplets) and engaged to Gemma Winter (Dolly-Rose Campbell). Chesney's storylines have included: his friendship with pet dog Schmeichel and coming to terms with the loss of his beloved pet, as well as his relationship with Katy Armstrong (Georgia May Foote) who later went on to give birth to his son Joseph aged just seventeen. Chesney later began a relationship with Sinead Tinker (Katie McGlynn) in 2013 and was stabbed with a glass bottle during an incident at Nick's Bistro in 2017. Within days of the incident, he made a full recovery.", "In 2010, Chesney meets Katy Armstrong (Georgia May Foote) and is instantly attracted to her. Katy's father, Owen Armstrong (Ian Puleston-Davies) does not approve of their relationship and threatens Chesney. In December 2010, Fiz goes into labour, three months early as a result of the shock of the tram crash, with Chesney's support; Fiz gives birth to a baby girl, and names her Hope. In early-2011, Hope is diagnosed with a heart condition, but is successfully treated for the problem. Chesney comforts Fiz when John goes into hospital after a breakdown. In March 2011, when Hope comes home, Fiz tells Chesney he will have to get rid of Schmeichel, so he and Katy move out, and Katy suggests they have a baby of their own. While cooking dinner for Chesney, Katy tells an estatic Chesney that she is pregnant with his baby, and they decide to keep her pregnancy a secret. Chesney begins to grow suspicious of John Stape, so goes to see Charlotte Hoyle's (Becky Hindley) parents, who tell him that John (who they believe is Colin) was engaged to Charlotte and made the decision to switch her life support machine off. He confronts John, who denies any involvement in Charlotte's death and Joy Fishwick's (Doreen Mantle) suspicious death. John, realising that Chesney is starting to work out the truth, takes him to The Hoyles' house where he is holding them hostage in the cellar; before Chesney can run away, John ties him up too. John tells Katy that Chesney has run away, but Chesney manages to untie himself and the Hoyles a few days later, breaking the bar to which they were tied. Unknown to them, John has dug up the body of Colin Fishwick (David Crellin), which he buried a few months earlier. Chesney escapes after his sister, Fiz, works out the truth about John and follows him to the Hoyles' house; she tells a horrified Chesney that Katy is about to have an abortion, and Chesney arrives just in time to prevent this. The police arrest John, who attacks Maria Connor (Samia Ghadie) while she is looking after Hope. In November 2011, Schmeichel is diagnosed with liver cancer, and the vets say he has no choice but to put Schmeichel to sleep. On 23 December 2011, Chesney finds out from his Fiz that Katy has gone into labour at the nativity play, so Anna Windass has to deliver the baby. Chesney was stranded in the middle of nowhere with Gary Windass (Mikey North) after they had cut down some Christmas trees to be delivered. After stealing some unlocked bicycles, Chesney manages to make it in time to see the birth of his son, who they name Joseph Peter; Joseph because he was born at the nativity play, and Peter in honour of Schmeichel.", "In July 2010, it was announced that Chesney will hook up with newcomer Katy Armstrong (Georgia May Foote) in a storyline which will involve the 17-year-old losing his virginity. A spokesperson for Coronation Street said \"We have all seen Chesney grow up so it’s going to be a huge milestone for him and the viewers. We all remember that sweet little kid who first arrived in the Street with his mum Cilla. But that was seven years ago and he’s about to become a man. The storyline will be handled responsibly and the two characters will discuss what contraceptives to use.\"", "In February 2011, it was announced that Katy Armstrong will decide that she wants a baby with Chesney in a forthcoming storyline. Katy (Georgia May Foote) will make the suggestion of starting a family to Chesney in the weeks ahead - leaving him shocked as he believes they are too young for parenthood. However, after Katy continues to push the idea, Chesney (Sam Aston) is expected to change his mind and begin looking for a flat that he can rent with his girlfriend. Discussing Fiz's reaction, a Coronation Street source said \"After just having a child herself she knows how hard it is. She doesn't want him ruining his life by becoming a dad when he's still a kid.\" "]}, {"page": "Coronation Street Live (2010 episode)", "response": ["* Georgia May Foote as Katy Armstrong"]}, {"page": "List of Coronation Street characters (2011)", "response": ["June saw a new family take over the running of the Rovers Return for the first time as former EastEnders actress Michelle Collins and Taggart actor John Michie took on the roles of Stella Price and Karl Munro respectively. The couple were also joined by Stella's daughter Eva (Catherine Tyldesley). A potential new love interest for Steve McDonald (Simon Gregson), Beth Tinker (Lisa George), and her son Craig (Colson Smith) arrived in August and Frank's parents, Anne (Gwen Taylor) and Sam Foster (Paul Clayton), made their first appearances in September, along with Kirsty Soames (Natalie Gumede), a new love interest for Tyrone Dobbs (Alan Halsall). Paul Kershaw's (Tony Hirst) Alzheimer's-suffering wife, Lesley Kershaw (Judy Holt), followed in October and Jeremy Sheffield began appearing as Danny Stratton, a new love interest for Becky McDonald (Katherine Kelly), in December. That same month saw the birth of Chesney Brown (Sam Aston) and Katy Armstrong's (Georgia May Foote) newborn son Joseph Brown, the only child to be born that year.", "Joseph Brown, played by Lucca-Owen Warwick from December 2011 to March 2015, and William Flanagan since October 2017, made his first on screen appearance on 23 December 2011. Joseph is the son of Chesney Brown (Sam Aston) and Katy Armstrong (Georgia May Foote). Flanagan is the twin brother of Isabella Flanagan, who plays Joseph's cousin Hope Stape. Flanagan's other sister, Amelia Flanagan, plays April Windsor in Emmerdale."]}, {"page": "Trollied", "response": ["* Holly (portrayed by Georgia May Foote) — Holly is a Valco employee from another store and immediately takes an interest in Daniel. She is extremely jealous and Katie begins to see a different side to her sweet nature. (Series 6)"]}, {"page": "Kirsty Soames", "response": ["Kirsty goes past her due date, but when Tina pushes her into a table during a fight in The Rovers, they realise she is in labour. Marcus Dent (Charlie Condou) and Gloria Price (Sue Johnston) deliver baby Ruby. After bringing Ruby home, Kirsty struggles and when Ruby won't stop crying, she trashes the house. Tyrone tells her that he does not trust her with Ruby so he is pleased when Kirsty's mother, Alison (Dawn Hope), visits, telling them that she has left Edwin (David Lonsdale). Kirsty reluctantly allows Alison to stay and appreciates her help but Edwin arrives and snatches Ruby briefly to make Alison go home. Kirsty blames Tyrone for her father's reappearance and throws a candlestick at him so Tyrone ends the relationship is over and tells her to leave but insists that Ruby will stay with him. However, Kirsty tells him that he has no legal right to keep Ruby as his name is not on her birth certificate, forcing him to change his mind. Instead, they agree that he will stay at home to look after Ruby, while Kirsty goes back to work. However, Fiz knows about Kirsty's abuse and she notices the change in Fiz's attitude to her. Wanting Tyrone and Ruby to get out and meet people, she asks Katy Armstrong (Georgia May Foote) to take him to a mother and baby group, making Kirsty jealous again so she asks him not to go. When Fiz questions her about this, Kirsty is angered and in revenge, switches Fiz's sewing machine back on while she is trying to repair it, so she needs to go to hospital. Kirsty then takes charge of the first aid and takes Fiz to hospital so no one believes her when she insists Kirsty caused her injury."]}, {"page": "Faye Windass", "response": ["Faye is introduced to Eddie (Steve Huison) and Anna Windass (Debbie Rush) by her social worker, Hilary Pugsley (Caroline Pegg). After several visits, Faye begins to like the Windasses but the adoption is threatened by the revelation that their son, Gary (Mikey North), has been discharged from the army and will be living with them. Despite this, Faye stays the night at the Windasses' for the first time in February. When Faye visits in March, she is annoyed to discover that Eddie and Anna have been searching her bag and she storms out in a mood. Gary, however, speaks to Faye and convinces her that they can be trusted. When Faye stays overnight, Eddie accidentally washes Faye's blanket, she is furious and tells him that it is the only thing that she has to remember her mother by before insisting on returning to her foster home. Faye later moves in with the Windass family permanently. When Faye and Anna visit neighbour, Fiz Stape (Jenny McAlpine) and her baby Hope, Faye steals a bag containing £500 that Fiz is keeping secret from husband, John (Graeme Hawley). Faye gives Anna the bag as a gift but Anna finds the money and insists Faye tell her where she got it from. Faye admits that she stole it and a box of chocolates from The Kabin and earrings from her foster home that she also gave Anna, making Anna and Eddie worry about Faye's behaviour. Soon after, Anna and Eddie learn from Hilary that Faye's mother has died from a heroin overdose and she urges them to tell Faye. Anna wants to tell her after a picnic that she and Faye had planned but Eddie accidentally tells her. When Eddie leaves for Germany, Faye thinks it is her fault that he left but Anna reassures her that she is not to blame. When Katy Armstrong (Georgia May Foote) falls pregnant, Faye tells her father, Owen (Ian Puleston-Davies), making Katy think Anna told him so Anna asks Faye if she was responsible but she denies it. In November 2011, Faye's adoption becomes official but her happiness is short-lived when she discovers that Owen is dating Anna. Faye is scared that Owen will not want her around but Gary, Owen and Anna promise her that nothing will change. Faye wins the role of Mary in the Bessie Street Primary Nativity, but she suffers an onset of nerves before the play and refuses to participate so Katy takes over and gives birth to her son, Joseph Brown, during the production."]}, {"page": "Katy Armstrong", "response": ["Katy Armstrong is a fictional character from the British ITV soap opera, Coronation Street, played by Georgia May Foote. She made her first appearance during the episode broadcast on 30 July 2010. Foote had previously appeared in the soap in January that same year as Jess Burrows. Katy is Owen Armstrong's (Ian Puleston-Davies) youngest daughter and Izzy Armstrong's (Cherylee Houston) sister. Her storylines have mostly revolved around her relationship with Chesney Brown (Sam Aston),  her pregnancy and being a mother to Joseph and embarking on an affair with Ryan Connor (Sol Heras). Foote's departure from the show was announced in April 2014, with her having filmed her final scenes on 16 February 2015 and departed on 20 March 2015. Katy was killed off-screen in a car accident in Portugal on 18 October 2017.", "On 9 June 2010, Daniel Kilkelly from Digital Spy announced that former Grange Hill actress Georgia May Foote had joined the cast of Coronation Street as Katy Armstrong. Foote was working in her local fish and chip shop when she learned that she had won the role, following an audition. She began filming her first scenes around the time of her casting announcement. Foote had previously made a guest appearance in Coronation  Street as Jess Burrows in January 2010. Foote's \"feisty and outspoken\" character was introduced as the sister of Izzy Armstrong (Cherylee Houston) and a love interest for Chesney Brown (Sam Aston)."]}, {"page": "List of Celebrity Juice episodes", "response": ["| Georgia May Foote, Richard Hammond", "| Georgia May Foote, Joey Essex"]}, {"page": "List of Fake Reaction episodes", "response": ["|  Georgia May Foote and Jeff Brazier"]}]}}