{"wiki_id": "http://www.wikidata.org/entity/Q5549161", "itemLabel": "Gerald Garcia", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Gerald_Garcia", "wikipedia_page": {"main": "Gerald Garcia (born  1949 in Hong Kong) is a British classical guitarist and composer.\nAfter studying chemistry at Oxford University, he became a professional musician, making his debut at the Wigmore Hall in London. His more than fifteen CDs have sold more than 30,000 copies worldwide. In addition, he has performed with other musicians including John Williams, Paco Peña and John Renbourn.\nGarcia is also known as a composer, particularly for his Etudes Esquisses for guitar, recorded for Naxos Records by John Holmquist.  He is musical director of the National Youth Guitar Ensemble.Gerald Garcia lives in Oxford, where, according to his website, he enjoys \"cooking, computer music, Taoist Yoga and conducting the odd chamber orchestra.\"", "link_mentions": [{"page": "Simon Mayor", "response": ["He leads Britain's first modern mandolin quartet, the Mandolinquents. The quartet emerged from a 1997 line up, The Mandolin All-stars with multi-instrumentalists Maartin Allcock and Chris Leslie of Fairport Convention, and longtime musical partner, Hilary James. The Mandolinquents now includes the classical guitarist Gerald Garcia, multi-instrumentalist Richard Collins, and James on mandobass and vocals."]}, {"page": "Gerald García", "response": ["#REDIRECT Gerald Garcia"]}, {"page": "Mandolinquents", "response": ["The Mandolinquents (also known as Simon Mayor's Mandolinquents) is a British musical quartet. It was formed by its core members Simon Mayor (mandolin, violin, guitar) and Hilary James (mandobass, vocals). In the present line up, which has been together since 1997, they are joined by Gerald Garcia (classical guitar) and Richard Collins (mandolin, 5 string banjo).", "The Mandolinquents was formed in the aftermath of The Mandolin All Stars (1995–1997) in which Simon Mayor and Hilary James were joined by Maartin Allcock (mandocello) and Chris Leslie (mandolin, violin), both of whom are variously associated with the British folk-rock bands Fairport Convention, Jethro Tull and The Albion Band. In 1997 Maartin Allcock and Chris Leslie left to be replaced by Gerald Garcia and Richard Collins. The same year, the new line up recorded its first album Mandolinquents, with both Allcock and Leslie guesting. The new line up adopted the name The Mandolinquents and has remained together to the present day. They play regularly at arts centres and festivals within the UK and Europe, including a residency Mandolinquents & Friends since 2007 at New Greenham Arts, Newbury, England. They have been regular guests on the BBC Radio 2 programmes Friday Night Is Music Night  and In Tune.", "Gerald Garcia is a classical guitarist who became a professional musician after studying chemistry at Oxford University. He has recorded nine albums of guitar music on the Naxos label. He has composed extensively for the guitar and for film scores. He is currently musical director of the National Youth Guitar Ensemble (NYGE).", "*Gerald Garcia's website"]}]}}