{"wiki_id": "http://www.wikidata.org/entity/Q5541833", "itemLabel": "George Louch", "itemDescription": "cricketer (1746-1811)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Louch", "wikipedia_page": {"main": "George Louch (1746–1811) was an English cricketer and match organiser during the 18th century. He was especially noted for his fielding and was an early stalwart of Marylebone Cricket Club.\nHe was a native of Chatham and educated at Westminster school. He played regularly for Chatham Cricket Club until 1773 and is not known to have played again until 1783. In all he made 134 recorded appearances in major matches.  Only the Earl of Winchilsea (128) and William Bullen (119) were anywhere near his total when he retired.\nIn August 1789, it was reported in the press that Louch had been killed on the field by \"a ball from the point of the bat, struck with such force that it lodged in his body\". He survived the injury and was back in action the following season. \nWhen Louch died, the Kentish Gazette of 7 May 1811 carried this notice: \"Died April 29 at Ramsgate after a short illness, George Louch Esq, deeply regretted by all who knew him\".", "link_mentions": [{"page": "White Conduit Club", "response": ["| colspan=\"5\" | In this game, White Conduit combined with Moulsey Hurst Club in order to take on Hornchurch. The exact result is uncertain but it was by over 100 runs: WCC scored 89 and at least 162; Hornchurch 100 and not above 50. The only player mentioned in WDC is Winchilsea who scored between 20 and 30 but whether in one innings or in the whole match we do not know. The stake was 500 guineas. The teams are in FL18 but no scorecard information. The WCC/MHC team was Earl of Winchilsea, Sir Peter Burrell, Mr G East, Mr George Talbot, Mr C Drummond, Mr G Boult, Mr – Slater, Mr George Louch, William Bedster, Edward \"Lumpy\" Stevens and – Davy (Surrey); Lumpy and Davy were professional bowlers.", "| George Louch (MCC) "]}, {"page": "George Finch, 9th Earl of Winchilsea", "response": ["A. A. Thomson wrote that Winchilsea \"would go anywhere for a game of cricket\".Thomson: Odd Men In, p. 15. He was certainly prolific and is one of the most recorded players of the 18th century, though he was far from being among the best and was already 33 when he was first recorded in a senior match. He is known to have played in more than 130 top-class matches from 1785 to 1804, and records of many other matches have certainly been lost. His level of activity is matched by few of his contemporaries; only Billy Beldham and Tom Walker made a substantially greater number of appearances. Lord Frederick Beauclerk and George Louch were the only amateurs of the time as prolific as Winchilsea, but they were much better players because Winchilsea on the field was something of a liability. His known career batting average was a lowly single figure, despite using a bat that weighed 4 lb 2 oz."]}, {"page": "List of people from Kent", "response": ["*George Louch (1746–1811) – cricketer"]}, {"page": "List of English cricketers (1787–1825)", "response": ["|George Louch"]}, {"page": "List of historically significant English cricket teams", "response": ["The first reference to a team from Chatham, Kent, is a match against West of Kent in 1705, one of the earliest known important matches. There is a specific reference to a \"Chatham Club\" re a single wicket match in 1754.Waghorn, Cricket Scores, p. 53. In the last quarter of the 18th century, Chatham was mainly associated with George Louch and is believed to have used a ground owned by him for its home matches, though there are references in 1785 and 1787 to Chatham Lines as a venue.Waghorn, Dawn of Cricket, pp. 70–71 & 106–114. There are some 19th century references but the Chatham club ultimately folded and there is no real modern equivalent, not even in Kent league cricket. The town of Chatham is famous historically for the Royal Dockyard but it is not known if there was any connection between the dockyard and the cricket club.", "| George Louch's XI"]}, {"page": "Chatham Cricket Club", "response": ["Chatham lost by 20 runs to Meopham in June 1772 at George Louch's \"cricketing field\" in ChathamWaghorn, Cricket Scores, pp. 78–79. and in September 1772 the club played two matches against Dartford, the second one on Louch's field. Chatham won the first at Dartford by 19 runs and then Dartford won at Chatham, also by 19 runs.Waghorn, Cricket Scores, p. 87. There are records of three matches against Bourne in 1773. The first at Bourne Paddock on Friday, 30 July 1773, was abandoned because of bad weather, Bourne won the second at Chatham on 30 and 31 August by 7 wickets and the third at Bourne on 6 and 7 September by 1 wicket.Waghorn, Cricket Scores, pp. 111–114."]}, {"page": "List of English cricketers (1772–1786)", "response": ["|George Louch"]}, {"page": "Louch, George", "response": ["#redirectGeorge Louch"]}, {"page": "Louch", "response": ["* George Louch (1746–1811), English cricket player"]}]}}