{"wiki_id": "http://www.wikidata.org/entity/Q5540274", "itemLabel": "George Harrison", "itemDescription": "Yorkshire cricketer (1862-1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Harrison_(Yorkshire_cricketer)", "wikipedia_page": {"main": "George Puckrin Harrison, also known as \"Shoey\" because he was a shoemaker by trade (11 February 1862 – 14 September 1940) was an English first-class cricketer who played fifty-nine first-class matches for Yorkshire County Cricket Club between 1883 and 1892. He also appeared in first-class cricket for the Players (1883), T Emmett's XI (1883), Lord Sheffield's XI (1884), An England XI (1884) and L Hall's Yorkshire XI (1891).\nBorn in Scarborough, Yorkshire, England, Harrison began his career on 3 May 1883 at Lord's for Colts of the North against Colts of the South where as an unknown 21-year-old he obtained nine of eleven wickets – all clean bowled – for fourteen runs.Harrison consequently came straight into a strong Yorkshire eleven when he dismissed Monkey Hornby in the first innings, and bowled out Lord Harris for 2 in the second. Harrison soon became regarded as the fastest bowler seen for some time in first-class cricket, and in only his third first-class match against Kent he took eleven for 76 and bowled unchanged through both innings with Ted Peate. With the aid of a number of very fiery pitches in Yorkshire and at Old Trafford, Harrison took eighty-eight wickets for Yorkshire at a total cost of only 1,049 runs. In the process Harrison surpassed 1882's record-breaking wicket taker Peate as Yorkshire's most destructive bowler and became the first bowler to take 100 wickets during the season of his initial first-class appearance.Much was naturally expected of Harrison, but early in the 1884 season he suffered a bad arm injury when throwing from the deep field and suffered an amazing decline, taking only eighteen wickets in ten first-class matches. In 1885 Harrison returned to the side at the end of June and achieved one good performance of five wickets for 38 against Gloucestershire on a good wicket, but by 1886 it was clear that the strain of bowling at his former pace was damaging his arm. Harrison played only twice for Yorkshire that year, bowling eight wicketless four-ball overs, and moved to league cricket, Bowling Old Lane C.C., and Idle C.C. (where he took 215 wickets at 9.15 each over three seasons). Harrison did briefly reappear against Warwickshire (not then first-class) and Cheshire in 1887, but broke down when showing promise of his early form (which would have been tremendously valuable in such a dry season as 1887).\nIt was not until late 1890 that Harrison, now adjusted to bowling at a much reduced pace, returned to first-class county cricket, doing so dramatically with ten for 100 against County Champions Surrey allowing Yorkshire to win after following-on, and then ten for 109 against Marylebone Cricket Club (MCC). Harrison bowled regularly for Yorkshire in 1891 but his record was moderate, and lost his place to a young George Herbert Hirst (already a much better batsman even going in late) the following season.\nBetween 1892 and 1898, Harrison returned to Bowling Old Lane C.C., for whom from 1883 to 1898 he took 878 wickets at nine each, and then took up umpiring. He umpired in Minor Counties matches from 1904 to 1907 and was a regular first-class umpire from 1908 until his retirement at the end of the 1924 season.", "link_mentions": [{"page": "1883 English cricket season", "response": ["|George Harrison || Yorkshire || 3143 || 1326 || 100 || 13.26 || 7/43 || 6 || 1", "* George Harrison became the first bowler to take 100 wickets in the season in which he made his debut in first-class cricket.Webber; The Playfair Book of Cricket Records; pp. 176–177"]}, {"page": "George Harrison (disambiguation)", "response": ["George Harrison (1943–2001) was an English musician and the lead guitarist of The Beatles.", "George Harrison may also refer to:", "* George Harrison Marks (1926–1997), English photographer and director", "* George Harrison (album), a 1979 album by George Harrison", "* George Harrison (executive) (fl. c. 2000), American business manager", "* George Harrison (Hertford MP) (1680–1759), British MP for Hertford, 1727–1734 and 1741–1759", "* George Harrison (Bossiney MP), Member of Parliament (MP) for Bossiney", "* George Harrison (civil servant) (1767–1841), British jurist & government administrator", "* George Harrison (Lord Provost) (1811–1885), Lord Provost of Edinburgh, philanthropist and briefly Member of Parliament for Edinburgh South", "* George Harrison (Irish republican) (1915–2004), arms trafficker for the Provisional Irish Republican Army", "* George Harrison (cricketer, born 1860) (1860–1900), English cricketer", "* George Harrison (Yorkshire cricketer) (1862–1940), English cricketer", "* George Harrison (Glamorgan cricketer) (1895–?), English cricketer", "* George Harrison (footballer, born 1892) (1892–1939), professional footballer for Everton, and England international", "* George Harrison (footballer, born 1900) (1900–1969), English footballer for Durham City, Darlington, Carlisle United", "* George Harrison (swimmer) (1939–2011), American swimmer", "* George Harrison (prospector), Australian discoverer of gold in the Transvaal, which led to the Witwatersrand Gold Rush of 1886"]}, {"page": "George Harrison (cricketer, born 1862)", "response": ["#REDIRECT George Harrison (Yorkshire cricketer)"]}, {"page": "George Puckrin Harrison", "response": ["#REDIRECT George Harrison (Yorkshire cricketer)"]}, {"page": "Shoey Harrison", "response": ["#REDIRECT George Harrison (Yorkshire cricketer)"]}, {"page": "List of Mankading incidents in cricket", "response": ["#Charles Wright by George Harrison, Cambridge University v Yorkshire, Cambridge, 1883"]}]}}