{"wiki_id": "http://www.wikidata.org/entity/Q5541352", "itemLabel": "George Kinnell", "itemDescription": "Scottish footballer (born 1937-2021)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Kinnell", "wikipedia_page": {"main": "George Kinnell (22 December 1937 – 16 October 2021) was a Scottish footballer who played in the Football League for Middlesbrough, Oldham Athletic, Sunderland and Stoke City.", "link_mentions": [{"page": "Jimmy McIlroy", "response": ["In January 1966 he moved into management after being recruited by new Oldham Athletic chairman Ken Bates. With Oldham struggling at the foot of the Third Division, Oldham paid Stoke £5,000 so that they could register McIlroy as a player again. He signed several former Stoke City team-mates, including Bill Asprey, Alan Philpott, George Kinnell and Keith Bebbington. However McIlroy did not cope well with the pressure of management and resigned after losing 4–0 against Luton Town on the opening day of the 1968–69 season. He returned to Stoke City for a short while as assistant to Waddington before moving to Bolton Wanderers as coach and assistant to Nat Lofthouse. McIlroy had an 18-day spell in charge after Lofthouse's departure but resigned after just two matches on principle after being told by the board to sell players."]}, {"page": "Crossgates Primrose F.C.", "response": ["The club's best-known former players are Scotland legend Jim Baxter, who Crossgates sold to Raith Rovers for £200, and his second cousin George Kinnell."]}, {"page": "Jimmy Jones (comedian)", "response": ["Jones' catchphrase 'Kin' ell' was a play on words, derived from footballer George Kinnell."]}, {"page": "1964 Football League Cup Final", "response": ["For the Second leg at Filbert Street Stoke manager Tony Waddington had to change his goalkeeper with Leslie out with an ankle injury Bobby Irvine taking his place. He was unable to prevent Mike Stringfellow from scoring after six minutes following a defensive error. Stoke hit back and a perfect pass from Jimmy McIlroy cut through the Foxes’ defence and Dennis Viollet levelled the scores. This put Stoke into the ascendency but then a nasty leg injury to Calvin Palmer saw him stretchered off and thus put Stoke down to 10 men. Leicester capitalised on the situation and before Palmer was able to get back on the pitch Gibson headed in a Howard Riley corner. With not long left Stoke pushed forward and left a too big a gap in defence and Dave Gibson made it 3–1. Stoke to their credit fought on and pulled one back through George Kinnell but it was too late as Leicester won the tie 3–2 giving them a 4–3 aggregate win and with it the League Cup.", "|||5|| George Kinnell", "|||5|| George Kinnell"]}, {"page": "1963–64 Stoke City F.C. season", "response": ["Stoke made a dream start to the 1963–64 season beating Tottenham Hotspur 2–1 at home on the opening match of the season, Jimmy McIlroy scoring both goals, and then accounting for Aston Villa 3–1 two days later. There followed though, a run of 10 matches without a win and Stoke found themselves at the wrong end of the table. Waddington was not happy with his defence and went out and bought Calvin Palmer from Nottingham Forest for £30,000 and George Kinnell from Aberdeen for £27,000 and another 'keeper Lawrie Leslie from West Ham United. On the other hand, he released Don Ratcliffe, and Ron Wilson. John Ritchie was introduced into the first team by October and he made an instant impression as he started scoring the first few of his 171 for the club. With Ritchie in full flow, things improved and in nine matches from early October to mid November, Stoke remained unbeaten. However around Christmas time the team again went through a bad spell losing eight times including some heavy defeats.", "|align=\"left\"|DF||align=\"left\"| George Kinnell"]}, {"page": "1964–65 Stoke City F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| George Kinnell"]}, {"page": "1965–66 Stoke City F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| George Kinnell"]}, {"page": "1967 Vancouver Royal Canadians season", "response": ["| 5||George Kinnell  ||M||183||76||12||2||0"]}, {"page": "Kinnell", "response": ["* George Kinnell (1937–2021), Scottish footballer"]}, {"page": "List of Scottish football families", "response": ["* Jim Baxter, George Kinnell (second cousin), Andy Kinnell (second cousin), Ian Dair (brother-in-law), Jason Dair (nephew), Lee Dair (nephew)Denholms of Hill of Beath – The start of a Football Dynasty, RootsChat, 3 May 2013"]}, {"page": "Kinnell, George", "response": ["#redirectGeorge Kinnell"]}, {"page": "2021 in the United Kingdom", "response": ["**George Kinnell, Scottish footballer (Aberdeen, Stoke City, Sunderland) (b. 1937)."]}, {"page": "Deaths in October 2021", "response": ["*George Kinnell, 83, Scottish footballer (Aberdeen, Stoke City, Sunderland).In Memoriam|George Kinnell"]}, {"page": "2021–22 in English football", "response": ["* 16 October 2021: George Kinnell, 83, Stoke City, Oldham Athletic, Sunderland and Middlesbrough midfielder."]}, {"page": "2021–22 in Scottish football", "response": ["* 17 October: George Kinnell, 83, Aberdeen midfielder. In Memoriam|George Kinnell"]}]}}