{"wiki_id": "http://www.wikidata.org/entity/Q5545172", "itemLabel": "George Thompson", "itemDescription": "founder of a shipping line and Liberal politician", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Thompson_(shipowner)", "wikipedia_page": {"main": "George Thompson (1804–1895) was a Scottish Liberal politician who was The Lord Provost of Aberdeen and MP for city. He was also the founder of the Aberdeen Line shipping company.", "link_mentions": [{"page": "Thermopylae (clipper)", "response": ["Thermopylae was built for the Aberdeen Line, which was founded in 1825 by George Thompson. She measured 212' × 36' × 20.9', with tonnage 991 GRT, 948 NRT and 927 tons under deck. The hull planking was American rock elm from the garboard to the light water line, and then teak from there to the rail. Being of composite construction, the planking was fastened over an iron frame. "]}, {"page": "List of provosts of Aberdeen", "response": ["*  (1847–1850)  George Thompson Jnr"]}, {"page": "Aberdeen (UK Parliament constituency)", "response": ["| George Thompson"]}, {"page": "George Thompson", "response": ["George Thompson may refer to:", "*George Thompson (abolitionist) (1804–1878), British anti-slavery lecturer and MP for Tower Hamlets", "*George Thompson (shipowner) (1804–1895), founder of the Aberdeen Line and Liberal MP for Aberdeen", "*George Thompson (Wisconsin politician) (1918–1982), Attorney General of Wisconsin", "*George Thompson (Scottish National Party politician) (1928–2016), Scottish National Party politician, MP for Galloway", "*George Thompson (Australian politician) (born 1945), former Australian politician", "*George Thompson (basketball) (born 1947), American basketball player", "*George Thompson (cricketer) (1877–1943), English Test cricketer", "*George Thompson (footballer, born 1884) (1884–?), winger for Sheffield United and Derby County in the 1900s, and manager for Luton Town", "*George Thompson (footballer, born 1895) (1895–?), played for Burnley, Rotherham and Ashington in the 1920s", "*George Thompson (footballer, born 1900) (1900–1968), goalkeeper for York City and Southampton in the 1920s", "*George Thompson (footballer, born 1926) (1926–2004), goalkeeper for Scunthorpe United, Preston North End, Manchester City and Carlisle United in 1950s and 1960s", "*George Thompson (Australian footballer) (1906–1986), Australian rules footballer", "*George Thompson (aviator) (1888–1912), one of Colorado's earliest aviators", "*George Thompson (engineer) (1839–1876), British engineer who served in Paraguay during the Paraguayan War", "*George Thompson (traveller), author of a two-volume travelogue Travels and Adventures in South Africa", "*George Thompson (VC) (1920–1945), Scottish recipient of the Victoria Cross", "* George Thompson (American football) (1899–1939), American football player"]}, {"page": "List of MPs elected in the 1852 United Kingdom general election", "response": ["|Aberdeen||George Thompson||Liberal"]}, {"page": "Aberdeen Line", "response": ["The Aberdeen Line was a shipping company founded in 1825 by George Thompson of Aberdeen to take sailing vessels to the St. Lawrence, carrying some passengers and returning with cargoes of timber. The business flourished and grew to 12 sailing vessels by 1837, travelling to South America, the Pacific, West Indies and the Mediterranean. In 1842 the line included a regular schedule from London to Australia."]}, {"page": "William Henderson (philanthropist)", "response": ["He was born in Aberdour, Aberdeenshire, the son of a farmer, and his first job was a junior position in the Fraserburgh branch of the North of Scotland Bank. However, he soon moved to Aberdeen to work for the Aberdeen White Star Line, founded in 1825 by George Thompson, a ship-owning company whose fleet of Aberdeen clippers included the Thermopylae. He travelled widely on the firm's business, and in 1886 he became senior partner of the firm, on the retirement of George Thompson. This was a time of great change as sailing ships were replaced by steamships.", "In 1852 he married a daughter of George Thompson, and they had 5 sons and 5 daughters. From 1857 they resided at Devanha House."]}, {"page": "1895 in Scotland", "response": ["* George Thompson, shipowner and politician (born 1804)"]}, {"page": "1868 in Scotland", "response": ["* 19 August – the clipper Thermopylae is launched at Walter Hood & Company's Aberdeen shipyard for George Thompson's Aberdeen Line."]}, {"page": "1825 in Scotland", "response": ["* 1 November – George Thompson establishes the Aberdeen Line of shipping to the Empire."]}, {"page": "1804 in Scotland", "response": ["* George Thompson, shipowner and politician (died 1895)"]}, {"page": "Muriel Thompson", "response": ["Thompson was born on 10 June 1875 in Aberdeen, Scotland to Agnes Marion Williamson (1846–1926), the second wife of Cornelius Thompson, a shipowner and marine architect. She was the fifth of eight children. Her grandfather George Thompson had been Lord Provost of Aberdeen and an MP (1852) for the city."]}, {"page": "Doris Mackinnon", "response": ["Doris Livingston Mackinnon was born on 30 September 1883 in Aberdeen. Her father, Lachlan Mackinnon, worked as an advocate and Consular Agent for France and Belgium. In his spare time, he was an amateur scientist, interested in botany, ornithology and astronomy. Her mother, Theodora Thompson Mackinnon, granddaughter of George Thompson, founded and managed a \"women's home\" for unemployed women. Mackinnon had three siblings. One sister became a silhouette artist whilst the other, Lillias Mackinnon, became a concert pianist. A brother became an author."]}, {"page": "Robert Napier and Sons", "response": ["After Robert Napier's death new partners led by marine engineer Dr KirkAlexander Carnegie Kirk born Barry, Forfarshire 1830, died Glasgow 5 October 1892 the previous manager, built for George Thompson's Aberdeen White Star Line the single screw iron  with a three crank triple expansion engine and delivered in 1881. It was designed for the Australia trade passing through the Suez canal. Aberdeen had an iron hull. Sold to Turkey in 1906 it was eventually scrapped in 1919.Fred M Walker. Ships and Shipbuilders: Pioneers of Design and Construction, Seaforth, 2010 in association with The Royal Institution of Naval Architects. "]}]}}