{"wiki_id": "http://www.wikidata.org/entity/Q5544722", "itemLabel": "George Speaight", "itemDescription": "British art historian, actor and puppeteer (1914-2005)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Speaight", "wikipedia_page": {"main": "George Victor Speaight (; 6 September 1914  – 22 December 2005) was a theatre historian, author and performer  and the leading authority on 19th-century toy theatre.", "link_mentions": [{"page": "Punch and Judy", "response": ["Peter Fraser writes, \"the drama developed as a succession of incidents which the audience could join or leave at any time, and much of the show was impromptu.\"Fraser, Peter (1970) Punch and Judy. London: B.T Batsford. New York: Van Nostrand Reinhold Company. . Library of Congress Catalog Card Number: 71-110085. p. 8. This was elaborated by George Speaight, who explained that the plotline \"is like a story compiled in a parlour game of Consequences ... the show should, indeed, not be regarded as a story at all but a succession of encounters.\"Speaight, George. (1955) Punch and Judy: A History, Revised Edition 1970. London: Studio Vista Ltd. . p. 78. Robert Leach makes it clear that \"the story is a conceptual entity, not a set text: the means of telling it, therefore, are always variable.\"Leach, Robert. (1985) The Punch & Judy Show: History, Tradition and Meaning. London: Batsford Academic and Educational; Athens, Georgia: University of Georgia Press.  Rosalind Crone asserts that the story needed to be episodic so that passersby on the street could easily join or leave the audience during a performance.Crone, Rosalind (2006). \"Mr and Mrs Punch in Nineteenth-Century England.\" The Historical Journal, 49(4) pp. 1055–1082."]}, {"page": "Circus", "response": ["In Ancient Rome, the circus was a building for the exhibition of horse and chariot races, equestrian shows, staged battles, gladiatorial combat, and displays of (and fights with) trained animals. The circuses of Rome were similar to the ancient Greek hippodromes, although circuses served varying purposes and differed in design and construction, and for events that involved re-enactments of naval battles, the circus was flooded with water. The Roman circus buildings were, however, not circular but rectangular with semi circular ends. The lower seats were reserved for persons of rank; there were also various state boxes for the giver of the games and his friends. The circus was the only public spectacle at which men and women were not separated.  Some circus historians such as George Speaight have stated \"these performances may have taken place in the great arenas that were called 'circuses' by the Romans, but it is a mistake to equate these places, or the entertainments presented there, with the modern circus\"  Others have argued that the lineage of the circus does go back to the Roman circuses and a chronology of circus-related entertainment can be traced to Roman times, continued by the Hippodrome of Constantinople that operated until the 13th century, through medieval and renaissance jesters, minstrels and troubadours to the late 18th century and the time of Astley."]}, {"page": "Bartholomew Fair (play)", "response": ["As with many long-ignored plays, Bartholomew Fair returned to the stage in a production by the Phoenix Society—this one, in 1921 at the New Oxford Theatre. Its first professional revival came in 1949, when George Devine directed it at the Edinburgh International Festival; the next year, the same production appeared at the Old Vic. The puppets in this production were performed by George Speaight. The Bristol Old Vic produced the play in 1966. Terry Hands directed the play for the Royal Shakespeare Company in 1969; this production included Ben Kingsley as Winwife and Helen Mirren as Win Littlewit. The production, which cut the long text and freely mixed period and modern properties, received generally negative reviews.  The play was also performed (some time in the 1960s) at the University of California, Berkeley, with Stacey Keach playing Overdo."]}, {"page": "Category talk:English historians", "response": ["List of all pages in category English historians retrieved by PockBot.PockBot is currently Undergoing Trials. If you have any comments on its performance please leave them at Wikipedia:Bots/Requests_for_approval/PockBotArticleClass / StatusPeter Ackroydnot yet classifiedHarold Actonnot yet classifiedJohn Dalberg-Acton, 1st Baron Actonnot yet classifiedAethelweardnot yet classifiedGrace Aguilarnot yet classifiedLucy Aikinnot yet classifiedAilred of Rievaulxnot yet classifiedGeoffrey Aldermannot yet classifiedSir Archibald Alisonnot yet classifiedAndrew Allamnot yet classifiedGeorge Allan (antiquary)not yet classifiedWilliam Edward David Allennot yet classifiedAlured of Beverleynot yet classifiedJames Pettit Andrewsnot yet classifiedWilliam Archer (critic)not yet classifiedGeoffrey Ashenot yet classifiedHarold Brakspearnot yet classifiedRichard Baker (chronicler)not yet classifiedJohn Baker (legal historian)not yet classifiedAdolphus Ballardnot yet classifiedJoshua Barnesnot yet classifiedCorrelli BarnettStartHugh Bichenonot yet classifiedRobert Blake, Baron Blakenot yet classifiedWilliam Henry Blissnot yet classifiedRichard Bonneynot yet classifiedGerald Brenannot yet classifiedFrancis Brinkleynot yet classifiedOscar Browningnot yet classifiedKevin Brownlownot yet classifiedHenry Thomas Bucklenot yet classifiedJames Burneynot yet classifiedWilliam Camdennot yet classifiedJohn Capgravenot yet classifiedEdward Cardwellnot yet classifiedGeorge Carewnot yet classifiedThomas Cartenot yet classifiedPaul Cartledgenot yet classifiedChristopher Catherwoodnot yet classifiedWilliam Cavenot yet classifiedHector Munro Chadwicknot yet classifiedOwen Chadwicknot yet classifiedAllan Chapmannot yet classifiedWinston Churchill14px GAEdward Hyde, 1st Earl of Clarendonnot yet classifiedAlan Clarknot yet classifiedKenneth Clarknot yet classifiedBob Clarke (historian)not yet classifiedRobert Conquestnot yet classifiedCharles Henry Coopernot yet classifiedWilliam Coxenot yet classifiedMandell Creightonnot yet classifiedAndrew Dalbynot yet classifiedSamuel Danielnot yet classifiedBasil Davidsonnot yet classifiedGodfrey Daviesnot yet classifiedChristopher Dawsonnot yet classifiedGoldsworthy Lowes Dickinsonnot yet classifiedDavid Diringernot yet classifiedJohn Andrew Doylenot yet classifiedWilliam Dugdalenot yet classifiedAlfred Duggannot yet classifiedThomas Henry Dyernot yet classifiedBryan Edwardsnot yet classifiedLeonard Elliott Elliot-Binnsnot yet classifiedThomas Elmhamnot yet classifiedGeorge Finlaynot yet classifiedMoses I. Finleynot yet classifiedPercy Hethrington Fitzgeraldnot yet classifiedRobin Lane Foxnot yet classifiedJames Anthony Froudenot yet classifiedFrancis Aidan Cardinal Gasquetnot yet classifiedGeoffrey the Bakernot yet classifiedEdward GibbonStartMartin Gilbertnot yet classifiedRobert Gildeanot yet classifiedMary Anne Everett Greennot yet classifiedVivian H. H. Greennot yet classifiedHenry Melvill Gwatkinnot yet classifiedE. E. Y. Halesnot yet classifiedEdward Hallnot yet classifiedHenry Hallamnot yet classifiedJohn Hardyngnot yet classifiedEdward Hastednot yet classifiedPeter Hennessynot yet classifiedHenry of Huntingdonnot yet classifiedChristopher Hibbertnot yet classifiedAndrew Hignellnot yet classifiedChristopher Hill (historian)not yet classifiedHarry Hinsleynot yet classifiedPatricia Hollis, Baroness Hollis of Heighamnot yet classifiedJ. C. Holtnot yet classifiedW. G. Hoskinsnot yet classifiedWilliam Howittnot yet classifiedBettany Hughesnot yet classifiedWilliam Hutton (Birmingham historian)not yet classifiedDavid Irvingnot yet classifiedCatherine Jacksonnot yet classifiedJohn Heneage Jessenot yet classifiedJohn S. Conwaynot yet classifiedJohn of Hexhamnot yet classifiedJohn Jortinnot yet classifiedJohn Keaynot yet classifiedIan Kershawnot yet classifiedAlexander William Kinglakenot yet classifiedHenry Knightonnot yet classifiedRichard Knollesnot yet classifiedPeter Laslettnot yet classifiedBernard Lewisnot yet classifiedJohn Lingardnot yet classifiedCatherine Macaulaynot yet classifiedThomas Babington Macaulay, 1st Baron Macaulaynot yet classifiedDiarmaid MacCullochnot yet classifiedJohn Maddicottnot yet classifiedHenry James Sumner Mainenot yet classifiedFrederic William Maitlandnot yet classifiedNoel Malcolmnot yet classifiedGeorge Bruce Mallesonnot yet classifiedTheodore Augustine Mannnot yet classifiedThomas Maynot yet classifiedCharles Merivalenot yet classifiedWilliam Nassau Molesworthnot yet classifiedPhilip Morantnot yet classifiedJames Augustus Cotter Morisonnot yet classifiedLewis Bernstein Namiernot yet classifiedJohn Julius Norwichnot yet classifiedDimitri Obolenskynot yet classifiedRichard Ollardnot yet classifiedRobin Osbornenot yet classifiedHenry Nutcombe Oxenhamnot yet classifiedFrancis Palgravenot yet classifiedMatthew Parisnot yet classifiedC. Northcote Parkinsonnot yet classifiedMichael Pearsonnot yet classifiedLiza Picardnot yet classifiedCharles Plummernot yet classifiedAlbert Pollardnot yet classifiedFrederick York Powellnot yet classifiedF. M. Powickenot yet classifiedJohn Prebblenot yet classifiedH. F. M. Prescottnot yet classifiedAnthony Preston (naval historian)not yet classifiedJames Rennellnot yet classifiedRicardian (Richard III)not yet classifiedRichard of Hexhamnot yet classifiedAndrew Robertsnot yet classifiedMichael Roberts (historian)not yet classifiedJohn C. G. Röhlnot yet classifiedFrederick Rolfenot yet classifiedJohn Holland Rosenot yet classifiedEmma Georgina Rothschildnot yet classifiedMichael Ernest Sadlernot yet classifiedJohn Saltmarshnot yet classifiedDominic Sandbrooknot yet classifiedNigel Saulnot yet classifiedSimon Schamanot yet classifiedJohn Robert Seeleynot yet classifiedMartin Sharp (journalist)not yet classifiedJane Shawnot yet classifiedWalter Sichelnot yet classifiedRaleigh Ashlin Skeltonnot yet classifiedDavid Smith (historian)not yet classifiedRichard Southernnot yet classifiedGeorge Speaightnot yet classifiedJohn Spelmannot yet classifiedDavid Starkeynot yet classifiedLawrence Stonenot yet classifiedAgnes Stricklandnot yet classifiedJohn Strypenot yet classifiedWilliam Stubbsnot yet classifiedRichard Talbertnot yet classifiedWilliam Woodthorpe Tarnnot yet classifiedAlasdair and Hettie Taylernot yet classifiedA. J. P. Taylornot yet classifiedArnold Fitz Thedmarnot yet classifiedConnop Thirlwallnot yet classifiedThomas Wykesnot yet classifiedE. P. Thompsonnot yet classifiedEmma Elizabeth Thoytsnot yet classifiedH. W. Timperleynot yet classifiedHugh Tootellnot yet classifiedJoshua Toulminnot yet classifiedMichael Trappes-Lomaxnot yet classifiedG. M. Trevelyannot yet classifiedSir George Trevelyan, 2nd Baronetnot yet classifiedHugh Trevor-Roper, Baron Dacre of Glantonnot yet classifiedAndrew White Tuernot yet classifiedSharon Turnernot yet classifiedKenneth Turpinnot yet classifiedRobert Vaughannot yet classifiedOrderic Vitalisnot yet classifiedAndrew Wallace-Hadrillnot yet classifiedSpencer Walpolenot yet classifiedAdolphus William Wardnot yet classifiedVeronica Wedgwoodnot yet classifiedJohn Wheeler-Bennettnot yet classifiedThomas Abingtonnot yet classifiedArthur Agardenot yet classifiedJohn Yonge Akermannot yet classifiedAnthony Allennot yet classifiedJohn Anstisnot yet classifiedJohn Anstis, youngernot yet classifiedElias Ashmolenot yet classifiedJohn Aubreynot yet classifiedJoseph Ayloffenot yet classifiedThomas Baker (antiquarian)not yet classifiedChristopher Barkernot yet classifiedDaines Barringtonnot yet classifiedJohn Thomas Blightnot yet classifiedMatthew Bloxamnot yet classifiedWilliam Copeland Borlasenot yet classifiedJohn Brandnot yet classifiedEdward Wedlake Brayleynot yet classifiedWilliam Bright, D.D.not yet classifiedJohn Britton (antiquary)not yet classifiedGeorge Bucknot yet classifiedWilliam Bullock (collector)not yet classifiedRichard Burnnot yet classifiedRichard Carewnot yet classifiedRichard Chandlernot yet classifiedSimonds d'Ewesnot yet classifiedJohn Evans (archaeologist)not yet classifiedLewis Evans (collector)not yet classifiedFrederick William Fairholtnot yet classifiedThomas Dudley Fosbrokenot yet classifiedAugustus Wollaston Franksnot yet classifiedJohn Frerenot yet classifiedRichard Gough (antiquarian)not yet classifiedEdwin Guestnot yet classifiedJohn Guillimnot yet classifiedRobert Stephen Hawkernot yet classifiedThomas Hearnenot yet classifiedJoseph Hunternot yet classifiedKenneth Hamilton Jenkinnot yet classifiedJohn Battelynot yet classifiedWilliam Lambardenot yet classifiedAshton Levernot yet classifiedCharles Herbert Mayonot yet classifiedWilliam Nicolsonnot yet classifiedWilliam Oldysnot yet classifiedFrancis Pecknot yet classifiedMargaret Bentinck, Duchess of Portlandnot yet classifiedJames Prinsepnot yet classifiedGerald Henry Rendallnot yet classifiedJoseph Ritsonnot yet classifiedJohn Seldennot yet classifiedCharles Hamilton SmithStubHenry Spelmannot yet classifiedJohn Stownot yet classifiedWilliam Stukeleynot yet classifiedMerlin Hanbury-Tracy, 7th Baron Sudeleynot yet classifiedJohn Timbsnot yet classifiedRoger Twysdennot yet classifiedGeorge Vertuenot yet classifiedJohn Weevernot yet classifiedAnthony Woodnot yet classifiedThomas Wrightnot yet classifiedJohn Aylmer (English constitutionalist)not yet classifiedWalter Bagehotnot yet classifiedA. V. Diceynot yet classifiedGeoffrey Rudolph Eltonnot yet classifiedStephen Gardinernot yet classifiedJohn Hooker (English constitutionalist)not yet classifiedJames I of Englandnot yet classifiedErskine May, 1st Baron Farnboroughnot yet classifiedWilliam Stoughton (English constitutionalist)not yet classifiedEdward Aglionbynot yet classifiedEdward Bellasisnot yet classifiedWalter Blountnot yet classifiedJohn Brooke-Littlenot yet classifiedWilliam Brugesnot yet classifiedSamuel Egerton Brydgesnot yet classifiedBernard Burkenot yet classifiedAlfred Butlernot yet classifiedClive Cheesmannot yet classifiedPeter Wilson Coldhamnot yet classifiedRodney Dennysnot yet classifiedGilbert Dethicknot yet classifiedWilliam Dethicknot yet classifiedAlan Dickinsnot yet classifiedPatric Laurence Dickinsonnot yet classifiedArthur Charles Fox-Daviesnot yet classifiedJames Frerenot yet classifiedRichard Graham-Viviannot yet classifiedEverard Greennot yet classifiedPeter Gwynn-Jonesnot yet classifiedIsaac Heardnot yet classifiedCecil Humphery-Smithnot yet classifiedWilliam Hunt (officer of arms)not yet classifiedThomas Joseph-Watkinnot yet classifiedGregory Kingnot yet classifiedHenry Lane (officer of arms)not yet classifiedEdmund Lodgenot yet classifiedRoger Machado (officer of arms)not yet classifiedMichael Maclagannot yet classifiedHenry Robert Charles Martinnot yet classifiedRobin de la Lanne-Mirrleesnot yet classifiedNicholas Harris Nicolasnot yet classifiedPeter O'Donoghuenot yet classifiedHenry Paston-Bedingfeldnot yet classifiedJohn Philipotnot yet classifiedLeslie Pinenot yet classifiedJames Planchénot yet classifiedArchibald Russellnot yet classifiedAlfred Scott-Gattynot yet classifiedWilfrid Scott-Gilesnot yet classifiedRichard St Georgenot yet classifiedFrancis Thynnenot yet classifiedAubrey Toppinnot yet classifiedCharles Townley (officer of arms)not yet classifiedWilliam Barclay Turnbullnot yet classifiedArthur Vicarsnot yet classifiedAnthony Wagnernot yet classifiedJohn Walker (officer of arms)not yet classifiedJohn Warburton (officer of arms)not yet classifiedDavid White (officer of arms)not yet classifiedCharles Wriothesleynot yet classifiedThomas Wriothesleynot yet classifiedJohn Writhenot yet classifiedLionel Barnettnot yet classifiedRichard Francis Burtonnot yet classifiedJoseph Dacre Carlylenot yet classifiedBasil Hall Chamberlainnot yet classifiedDuncan Forbesnot yet classifiedNathaniel Brassey Halhednot yet classifiedThomas Hydenot yet classifiedWilliam Jones (philologist)not yet classifiedEdward William Lanenot yet classifiedSamuel Leenot yet classifiedWilliam Marsden (orientalist)not yet classifiedReynold A. Nicholsonnot yet classifiedE. A. Wallis Budgenot yet classifiedCharles Wilkinsnot yet classifiedEdit by PockBot (on behalf of PocklingtonDan)"]}, {"page": "Robert Speaight", "response": ["Robert William Speaight  (; 1904 – 1976Speaight, Robert William; Oxford DNB) was a British actor and writer, and the brother of George Speaight, the puppeteer."]}, {"page": "Richard Southern (theatre designer)", "response": ["Together with George Speaight and Sybil Rosenfeld, Southern was a founder of the Society for Theatre Research which was supported by a journal, Theatre Notebook, which he co-edited for nine years.Obituary, The Independent, August 10, 1989"]}, {"page": "Margaret Hebblethwaite", "response": ["The daughter of wood engraver Mary Olive (née Mudd) and historian George Speaight, Hebblethwaite is the sister of Antony Speaight, QC. She read theology and philosophy at Lady Margaret Hall, Oxford University, and at the Gregorian University in Rome. In 1974, she met and married Peter Hebblethwaite, a Jesuit who left the priesthood after a decade in the ministry. After laicization, he worked as an editor, journalist and Vaticanologist. The couple married and had three children."]}, {"page": "Gerald Morice", "response": ["During World War II Morice was the BBC Correspondent in Vienna. He was also one of leading authorities on the productions of the Vienna State Opera, and in particular the operettas. At the end of the War Morice and George Speaight were contacted by a family who had found a collection of marionettes in a barn. Speaight and Morice examined these and found them to be rare Victorian puppets thought to have been lost or destroyed years before. The two restored the puppets and performed with them as the Old Time Marionettes and the Tiller Clowes Puppets.George Speaight Obituary - The Independent - 30 December 2005"]}, {"page": "Robert Sayer", "response": ["Sayers published at least fifteen such titles between 1766 and 1772. Theater historian George Speaight noted that Sayers published at least sixteen titles."]}, {"page": "Malvina Cheek", "response": ["In 1950, she was asked to design the sets for The Atom Secrets, a play for the toy theatre by George Speaight. To commemorate this Pollock’s Museum Trust published a greetings card showing The Cabin of the Lucy for Scene III in 2003, with the encouragement of Alan Powers. Cheek contributed illustrations to articles in various magazines, notably Far and Wide. In 1952 she wrote and illustrated an article on ships' figureheads for Collins Magazine."]}, {"page": "Benjamin Pollock's Toy Shop", "response": ["Following the death of Pollock's son William during World War I, his daughter Louise assisted in the business. The theatre historian and writer George Speaight was first associated with Pollock's when he gave a toy theatre performance of The Corsican Brothers at The George Inn in Southwark for Pollock's 80th birthday in 1936. Speaight was already gaining a reputation for his juvenile drama performances using characters and settings obtained from Pollock's. ", "In 1946 Keen appointed George Speaight as the manager of the shop. Speaight was to be associated with the shop and the museum that later grew from it for the rest of his life.'George and Mary Speaight - Passionate performer and historian who kept the art of English toy theatre alive' - The Guardian 12 January 2016George Speaight Obituary - The Independent - 30 December 2005 Keen modernised the stock to appeal to a contemporary audience with a toy theatre version of the 1948 Laurence Olivier film of Hamlet devised by SpeaightGeorge Speaight Obituary - The Daily Telegraph 14 January 2006 among other innovations. A supporter of the shop at this time was the actor Ralph Richardson, who wrote introductions to the plays. However, the business was a financial failure and in 1950 it moved to smaller premises at 16 Little Russell Street. In 1951 Benjamin Pollock Limited went into receivership."]}, {"page": "List of people educated at Haileybury and Imperial Service College", "response": ["* George Speaight"]}, {"page": "Speaight, George", "response": ["#redirectGeorge Speaight"]}]}}