{"wiki_id": "http://www.wikidata.org/entity/Q5542562", "itemLabel": "George Monger", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Monger", "wikipedia_page": {"main": "George Monger  (3 March 1840 – 9 August 1887) was an English recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.", "link_mentions": [{"page": "List of English Victoria Cross recipients", "response": ["|George Monger || British Army || 1857 || Indian Mutiny || Lucknow"]}, {"page": "St Leonards-on-Sea", "response": ["Many people have close connections with St Leonards. Queen Adelaide (1792–1849), consort of William IV, lived in St Leonards as a widow. Elizabeth Eiloart (1827–1898), novelist, retired to St Leonards, and King Solomon's Mines author Henry Rider Haggard came to live at North Lodge, Maze Hill, the house built across the road at the entrance to old St Leonards; this remained his home until 1923. Robert Tressell, author of  The Ragged Trousered Philanthropists, lived at 241 London Road from 1907. Summerfields School produced the alumnus Rainier III, Prince of Monaco. George Bristow was the taxidermist at the centre of the Hastings Rarities ornithological fraud; his business address was 15 Silchester Road.  Fred Judge FRPS founded the local picture postcard manufacturer Judges Postcards.  Sheila Kaye-Smith was a prolific author whose novels are set in the Sussex countryside around Hastings and Rye; she was born in St Leonards, the daughter of a local doctor and lived in Dane Road until her marriage in 1924.  George Monger was awarded a VC during the Siege of Lucknow in 1857, and after leaving the army, he lived in Tower Road, St Leonards where he died in 1887. Historian Prof Roy Porter (1946–2002) retired to St Leonards. Dr Thomas Duncan Greenlees FRSE retired here in 1922 and died here in 1929."]}, {"page": "Thomas Bernard Hackett", "response": ["He was 21 years old, and a lieutenant in the 23rd Regiment of Foot (later The Royal Welch Fusiliers), British Army during the Indian Mutiny when the following deed took place for which he was awarded the VC. On 18 November 1857 at Secundra Bagh, Lucknow, India, Lieutenant Hackett, with George Monger, rescued a corporal of his Regiment, who was lying wounded and exposed to heavy fire. He also showed conspicuous bravery when, under heavy fire, he ascended the roof and cut the thatch of a bungalow to prevent its being set on fire. His citation reads:"]}]}}