{"wiki_id": "http://www.wikidata.org/entity/Q5543208", "itemLabel": "George Parr", "itemDescription": "cricketer (1826-1891)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Parr_(cricketer)", "wikipedia_page": {"main": "George Parr (22 May 1826 – 23 June 1891) was an English cricketer whose first-class career lasted from 1844 to 1870. Known popularly as the \"Lion of the North\", Parr was a right-handed batsman and bowled occasional right-handed underarm deliveries. Throughout his career he played mainly for Nottinghamshire, and was club captain from 1856 to 1870. He also made occasional appearances for other counties and for Marylebone Cricket Club. He was a stalwart of the All-England Eleven and was captain of the first England touring team, which went to North America in 1859. He also captained England's second tour to Australia and New Zealand in 1864, returning home unbeaten. During this trip he travelled with the team from Liverpool to Melbourne on the SS Great Britain.Parr played in 207 first-class matches and had 358 innings, in 30 of which he was not out. Parr is widely considered as the best cricket player in the world in his time. He scored 6,626 runs (average 20.20) at a time when conditions greatly favoured bowlers. His highest score was 130 for Nottinghamshire, against Surrey at The Oval on 14 July 1859; his only century. He made 31 fifties and took 126 catches. He took 29 wickets in his career with a best analysis of 6/42. The Parr Stand which was replaced at Trent Bridge was named in his honour.", "link_mentions": [{"page": "Melbourne Cricket Ground", "response": ["Following the success of this tour, a number of other English teams also visited in subsequent years. George Parr's side came out in 1863–64 and there were two tours by sides led by W.G. Grace. The fourth tour was led by James Lillywhite."]}, {"page": "W. G. Grace", "response": ["Grace recorded in his Reminiscences that he saw his first great cricket match in 1854 when he was barely six years old, the occasion being a game between William Clarke's All-England Eleven (the AEE) and twenty-two of West Gloucestershire. He says he himself played for the West Gloucestershire club as early as 1857, when he was nine years old, and had 11 innings in 1859. The earliest match in CricketArchive which involved Grace was in 1859, only a few days after his eleventh birthday, when he played for Clifton Cricket Club against the South Wales Cricket Club at Durdham Down, his team winning by 114 runs. Several members of the Grace family, including his elder brother E. M., were involved in the match. Grace batted at number 11 and scored 0 and 0 not out. The first time he made a substantial score was in July 1860 when he scored 51 for West Gloucestershire against Clifton; he wrote that none of his great innings gave him more pleasure.Grace, Reminiscences, pp.8–9. It was through E. M. that the family name first became famous. His mother, Martha, wrote the following in a letter to William Clarke's successor George Parr in 1860 or 1861:Rae, p.42.", "Grace was just short of his thirteenth birthday when, on 5 July 1861, he made his debut for Lansdown and played two matches that month. E. M. had made his debut in 1857, aged sixteen. In August 1862, aged 14, Grace played for West Gloucestershire against a Devonshire team.Altham, p.125. A year later, following his bout of pneumonia which had left him bed-ridden for several weeks, he scored 52 not out and took 5 wickets against a Somerset XI. Soon afterwards, he was one of four family members who played for Bristol and Didcot XVIII against the All-England Eleven. He bowled well and scored 32 off the bowling of John Jackson, George Tarrant and Cris Tinley. E. M. took ten wickets in the match, which Bristol and Didcot won by an innings, and as a result E. M. was invited to tour Australia a few months later with George Parr's England team.Midwinter, pp.21–22."]}, {"page": "Hoboken, New Jersey", "response": ["By the 1850s, several Manhattan-based members of the National Association of Base Ball Players were using the grounds as their home field while St. George's continued to organize international matches between Canada, England and the United States at the same venue. In 1859, George Parr's All England Eleven of professional cricketers played the United States XXII at Hoboken, easily defeating the local competition. Sam Wright and his sons Harry and George Wright played on the defeated United States team, a loss which inadvertently encouraged local players to take up baseball. Henry Chadwick believed that baseball and not cricket should become the national pastime after the game drawing the conclusion that amateur American players did not have the leisure time required to develop cricket skills to the high technical level required of professional players. Harry Wright and George Wright then became two of the first professional baseball players in the United States when Aaron Champion raised funds to found the Cincinnati Red Stockings in 1869."]}, {"page": "1849 in sports", "response": ["* Most runs – George Parr 529 @ 31.11 (HS 86*)"]}, {"page": "1848 in sports", "response": ["* Most runs – George Parr 339 @ 18.83 (HS 52)"]}, {"page": "Nottinghamshire County Cricket Club", "response": ["The formal creation of Nottinghamshire County Cricket Club was enacted in March or April 1841 (the exact date has been lost). William Clarke established Trent Bridge as a cricket venue adjacent to the public house he ran. It was Clarke's successor as Nottinghamshire captain, George Parr, who first captained a united England touring team in 1859.  The club elected its first president, Sir Henry Bromley, in 1869. Early professional greats such as Alfred Shaw and Arthur Shrewsbury ensured that Notts were a force in the period before 1900. Thanks largely to the outstanding bowling combination of Tom Wass and Albert Hallam, the county won the County Championship in 1907 when George Gunn, John Gunn and Wilfred Payton were also prominent."]}, {"page": "England cricket team", "response": ["The first overseas tour occurred in September 1859 with England touring North America. This team had six players from the All-England Eleven, six from the United All-England Eleven and was captained by George Parr."]}, {"page": "Tom Wills", "response": ["Wills finally returned to Queensland in May and was sworn in as a Justice of the Peace upon arrival in Brisbane. Over the next few months at Cullin-la-ringo, he reported at least three murders of local settlers by Aboriginal men, among them one of his shepherds. He accosted government officials for failing to send a Native Police Force detachment to his station for protection, and scorned \"Brisbane saints\" for sympathising with the plight of Aboriginal people in the Nogoa region. With the cricket season approaching, Wills agreed to captain Queensland against New South Wales, and then left the colony to lead a Victoria XXII at the MCG against George Parr's All-England Eleven. In awe of his 1,800 mile dash across the continent to play cricket, the English thought it a madman's journey. Wills arrived on the final day of the match to a rapturous reception, and went in as a substitute fielder.\"Grand International Cricket Match\". The Star (Ballarat). 6 January 1864. p. 2. Retrieved 25 January 2016. He then joined the visitors on their Victorian tour."]}, {"page": "History of Test cricket from 1877 to 1883", "response": ["The year 1859 saw the first main representative tour by an England team.  It was captained by George Parr and comprised six players from the All-England Eleven, together with another six from the United All-England XI.  The team toured United States and Canada, where cricket was very popular.  The match in New York, for example, is said to have been watched by 10,000 people, but this may well be an exaggeration.  Even more saw the team when it played in Philadelphia, the spiritual home of North American cricket.  All matches were played against the odds, and the tour was a financial success, the English players making £90 each.", "The year 1861 brought the first English side to Australia.  North America was avoided this time because of the Civil War.  It was a weak side, dominated by Surrey players because George Parr and his Notts men would not accept £150 per head plus expenses.  The Englishmen won half their twelve matches, losing two and drawing four, all against the odds.  This was followed in 1863/64 by another tour to both Australia and New Zealand, led by George Parr and including the amateur E. M. Grace, older brother of W. G."]}, {"page": "Julius Caesar (cricketer)", "response": ["The last first-class game Caesar played in 1850 was against the All-England Eleven, and he scored 18 as Fourteen of Surrey secured a draw. His first such game in 1851 was also against the All-England Eleven. It was another draw, but Caesar impressed, top-scoring with 38. In July, Surrey played Nottinghamshire for the first time. Nottinghamshire were led by Clarke, and included the great George Parr, and Surrey won comfortably by 75 runs. However, Caesar himself was out without scoring in both innings, and he became extremely dejected. This fear that failure in one match would lead to his summary dismissal stayed with him throughout his cricketing life. However, he recovered, and at the beginning of August scored his maiden half-century for Surrey, against Yorkshire at the Oval.", "He was also a member of George Parr's team that visited North America – the first British cricket tour overseas, organised by Fred Lillywhite – and joined Parr's team that toured Australia and New Zealand in 1863/64. This involved travelling on the SS Great Britain."]}, {"page": "History of Test cricket from 1884 to 1889", "response": ["For the second Test, Surrey County Cricket Club, the ground authority, chose the legendary WG Grace as their captain. As a cricketer Grace was reckoned above those earlier greats, Alfred Mynn and George Parr, and it is probably more to do with the way captains were chosen in the 19th century (with away team's captains being chosen by their promoters, home team's captains chosen by the home ground authority, and deference shown to those with titles, such as Lord Harris) that Grace had not captained England sooner than his forty-first year. The England team included five Surrey players. "]}, {"page": "Canada national cricket team", "response": ["George Parr led an English team to Canada in 1859, which was the first ever international cricket tour. A product of the tour was a book by Fred Lillywhite entitled The English Cricketers' Trip to Canada and the United States, published the following year. On the tour, which also ventured into the US, the team won all five official matches against a 22 of Lower Canada (by 8 wickets at Montreal, Quebec on 26 October – 27 September), a 22 of the United States (by an innings and 64 runs at Hoboken, New Jersey on 3–5 October), a different 22 of the United States (by 7 wickets at Philadelphia on 10–12 October), a 22 of Lower Canada (by 10 wickets at Hamilton, Ontario on 17–19 October) and a further 22 of the United States (by an innings and 68 runs at Rochester, New York on 21–25 October). There were also some exhibition matches and two excursions to view the Niagara Falls."]}, {"page": "Cambridgeshire County Cricket Club", "response": ["According to Simon Wilde, in the early 1860s Carpenter and Hayward were rated as two of the three finest batsmen in England along with Richard Daft. Daft himself ranked Carpenter and Hayward as being equal, but George Parr reckoned Carpenter to be the better. Wilde's own estimation was that Carpenter was the best batsman in England from 1860 to 1866.Simon Wilde, Number One: The World's Best Batsmen and Bowlers, Victor Gollancz, 1998, , p49."]}, {"page": "John Wisden", "response": ["In July 1845, aged 18, only 5 ft 4 in and weighing just , he made his first-class debut for Sussex against MCC, taking 6 wickets in the first innings and three in the second.Scorecard, Sussex v Kent. 3,4,5 July 1845 He joined the All-England Eleven in 1846, moving allegiance to the United All-England Eleven in 1852.  He was engaged to marry George Parr's sister Annie in 1849, but she died before the wedding, and he never married.", "He played almost all of his cricket in England, mostly for Sussex, but once for Kent and thrice for Middlesex.  He travelled with a touring team led by George Parr to Canada and the US in 1859, where eight matches in Montreal, Hoboken, Philadelphia, Hamilton and Rochester were won easily."]}, {"page": "E. M. Grace", "response": ["After the 1863 season, Grace toured America with George Parr's side, but he did not perform well, being hampered by a bad hand. He then travelled to Australia on the SS Great Britain with the All-England Eleven. Grace kept a diary of the voyage which is part of the collection held by the SS Great Britain Trust. The team played several matches in Australia before travelling to New Zealand where they played five games. They returned to Australia to complete the remainder of the 19 tour matches. Only one of these matches is regarded as a first-class match.https://globalstories.ssgreatbritain.org/_/traveller/11432"]}, {"page": "William Caffyn", "response": ["At the end of the 1859 English cricket season, Caffyn was one of the 12 players who took part in cricket's first-ever overseas tour when an England cricket team led by George Parr visited North America."]}, {"page": "John Payne (umpire)", "response": ["Payne officiated in one match between Australia and England in Sydney on 20 February 1885 to 24 February 1885, won by Australia by only six runs thanks to an 80 run tenth wicket partnership, and a 10 wicket bag by Fred Spofforth.  Payne's colleague was Ted Elliott. Payne had played for the XXII of New South Wales against the visiting English team under George Parr in 1863/64."]}, {"page": "Radcliffe-on-Trent", "response": ["The 19th-century Nottinghamshire and England cricket captain George Parr was born and died in the village. He also played for the Radcliffe on Trent Cricket Club. Evidence of the Parr family's long association with Radcliffe appears in several street and building names."]}, {"page": "Thomas Hayward (cricketer)", "response": ["Thomas Hayward (21 March 1835 – 21 July 1876) was an English first-class cricketer who was generally reckoned to be one of the outstanding batsmen of the 1850s and 1860s. In the early 1860s, he and Robert Carpenter, his county colleague, were rated as the two finest batsmen in England. Richard Daft was among those ranking them as equal first, though George Parr reckoned Carpenter the better of the two.", "Hayward played as a right-handed batsman for Cambridge Town Club (Cambridgeshire) 1854–72 and also for numerous representative teams. At the end of the 1859 English cricket season, Hayward was one of the 12 players who took part in cricket's first-ever overseas tour when an England cricket team led by George Parr visited North America. He also was member of the second All England XI to tour Australia, and travelled out on the SS Great Britain"]}, {"page": "George Anderson (cricketer)", "response": ["Anderson appeared at Lord's in 1851, when he played for the North against the South, and for the Players against the Gentlemen in 1855.  From 1857 until 1864 he was a member of the All England XIs captained by William Clarke, and George Parr. He visited Australia with Parr's team travelling onboard the SS Great Britain in the winter of 1863, but met with little success. His most successful season was in 1864, when in first-class matches he averaged 42 runs an innings, and scored 99 not out for Yorkshire against Notts. He captained the Yorkshire team for a few seasons and in May 1869 a match was played for his benefit at Dewsbury between the All England XI and the United All England XI."]}, {"page": "Fred Lillywhite", "response": ["The touring party of 1859 left Liverpool on the SS Nova Scotian on 7 September and returned on 11 November. Its members, in addition to Wisden and John Lillywhite, were the captain George Parr (1826–91), Julius Caesar (1830–78), William Caffyn (1828–1919), Robert Carpenter (1830–1901), Alfred Diver (1824–1876), James Grundy (1824–1873), Tom Hayward (1835–76), John Jackson (1833–1910), Tom Lockyer (1826–1869) and H. H. Stephenson (1833–1896), who later led the first private tour by an England XI to Australia in 1861."]}, {"page": "History of English cricket (1816–1863)", "response": ["Social conditions, including the railways, were a key factor in the creation of the travelling All-England Eleven (AEE). The team was founded in Nottingham by William Clarke. The first AEE match was at Sheffield in September and they played others in Manchester and Leeds. The original AEE team was: William Clarke, Jemmy Dean, William Dorrinton, Fuller Pilch, Alfred Mynn, Joe Guy, Will Martingell, Tom Sewell, G Butler, VC Smith and William Hillyer. Other players who represented the AEE in its early days included George Parr, William Lillywhite, Nicholas Felix, William Denison, Thomas Box and OC Pell.", "28 first-class matches were recorded in 1848. The leading run-scorer was George Parr with 339 and the leading wicket-taker was William Hillyer with 85.", "29 first-class matches were recorded in 1849. The leading run-scorer was George Parr with 529 and the leading wicket-taker was William Hillyer with 141.", "AEE players in 1857 included: George Parr (captain), Alfred Diver, H. H. Stephenson, Julius Caesar, Cris Tinley, George Anderson, Ned Willsher and John Jackson.", "On 7 September, the departure of cricket's first-ever touring team. A photograph was taken on board ship before they sailed from Liverpool. The team of English professionals went to North America and played five matches, winning them all. There were no first-class fixtures. The 12-man squad was: George Parr (captain), James Grundy, John Jackson (all of Nottinghamshire); Robert Carpenter, Alfred Diver, Thomas Hayward (all of Cambridgeshire); Julius Caesar, William Caffyn, Tom Lockyer, H. H. Stephenson (all of Surrey); John Lillywhite, John Wisden (both of Sussex)."]}, {"page": "Non-international England cricket teams", "response": ["The name \"All-England\" took on a specific meaning in 1846 when William Clarke's All-England Eleven, commonly known as the AEE, was founded as a touring team of leading players, its purpose being to take advantage of the new railway network and play matches at city venues, mainly in the North of England. Clarke's team was indeed a top-class side worthy of its title as, in 1846, it consisted of himself, Joe Guy (cricketer), George Parr (all of Nottinghamshire), William Lillywhite, Jemmy Dean (both Sussex), William Denison, Will Martingell (both Surrey), Fuller Pilch, Alfred Mynn, Nicholas Wanostrocht (aka \"Felix\") and William Hillyer (all Kent). Their matches in Sheffield, Manchester and Leeds were a huge success and very profitable, especially for Clarke himself who was careful to pay his players more than Marylebone Cricket Club (MCC) did (from £4 to £6 per week) and so keep them interested. He kept the surplus for himself.", "The AEE lasted until 1880. In all matches George Parr with 10,404 runs (av 16.78) was the leading batsman for the side and William Clarke himself took the most wickets (2,385)."]}, {"page": "George Parr", "response": ["George Parr may refer to:", "*George Parr (cricketer) (1826–1891), English cricketer", "*George Parr, a generic name for many characters in improvised dialogue by John Bird and John Fortune on TV show Bremner, Bird and Fortune"]}, {"page": "Burnley Cricket Club", "response": ["Notable matches in the period before a league was organised include: A three-day visit from the All-England Eleven (then headed by George Parr) in 1868; matches against an Australian eleven, featuring Fred Spofforth and Billy Murdoch, in 1878 and 1880, of which Burnley won the first; and an 1890-match between two visiting ladies' teams which attracted thousands of spectators.Bennett (1951), pp. 223-224."]}, {"page": "1865 English cricket season", "response": ["|George Parr ||NottinghamshireAll England Eleven|| 8 || 11|| 0 || 353 || 78 || 32.09 || 0 || 3"]}, {"page": "1867 English cricket season", "response": ["* A schism between the northern professionals (Yorkshire, Nottinghamshire and Cambridgeshire) and their southern counterparts,Baily's Magazine of Sports & Pastimes, Volume 12 (1867); pp. 203–204 led by veteran batsman George Parr, who demanded improved remuneration and guaranteed benefits for their services, dominated the season.Rae, Simon W. G. Grace: A Life; pp. 73–79.  This schism, which had roots dating back to 1864, meant that in 1867 and 1868:"]}, {"page": "Alfred Diver", "response": ["Popularly known as \"Ducky\", Diver is best known as a reliable batsman for various All-England Eleven teams.  Following the 1859 English cricket season, he was one of the 12-strong party of English players who toured North America. Led by George Parr, this was the first ever overseas cricket tour."]}, {"page": "Robert Carpenter (cricketer)", "response": ["At the end of the 1859 English cricket season, Carpenter was one of the twelve players who took part in cricket's first-ever overseas tour when an England cricket team led by George Parr visited North America. He also toured Australia with Parr in 1863. In the early 1860s, Carpenter and his Cambridgeshire contemporary Thomas Hayward were rated the finest batsmen in England. Richard Daft was among those ranking them as equal first, but George Parr reckoned Carpenter the better of the two.Simon Wilde (1998)  Number One: The World's Best Batsmen and Bowlers. Victor Gollancz, pub. , p. 49. W. G. Grace said of Carpenter that \"he may be safely placed as one of the finest of our great batsmen\".W. G. Grace (1891) Cricket."]}, {"page": "History of Australian cricket to 1876", "response": ["The Melbourne Cricket Club organised a tour by an English team under the captaincy of George Parr, which also visited New Zealand.  No first-class matches were played.  The English team was unbeaten and its overall record was 16 played, 10 wins and six draws."]}, {"page": "James Grundy (cricketer)", "response": ["At the end of the 1859 English cricket season, Grundy was one of the 12 players who took part in cricket's first-ever overseas tour when an England cricket team led by George Parr visited North America."]}, {"page": "John Lillywhite", "response": ["At the end of the 1859 English cricket season, Lillywhite was one of the 12 players who took part in cricket's first-ever overseas tour when an English team led by George Parr visited North America."]}, {"page": "Tom Lockyer (cricketer)", "response": ["At the end of the 1859 English cricket season, Lockyer was one of the 12 players who took part in cricket's first-ever overseas tour when an English cricket team led by George Parr visited North America. He was also a member of Parr's team that toured Australia and New Zealand in 1863–64.During this trip the team sailed on the SS Great Britain."]}, {"page": "H. H. Stephenson", "response": ["At the end of the 1859 English cricket season, Stephenson was one of the 12 players who took part in cricket's first-ever overseas tour when an England cricket team led by George Parr visited North America."]}, {"page": "English cricket team in North America in 1859", "response": ["The English cricket team in North America in 1859 was the first ever overseas cricket tour by an English team. The touring team is sometimes referred to as George Parr's XI.", "The English team comprised six members of the All-England Eleven and six of the United All-England Eleven.Reeves 2014, p.60. With George Parr as captain, the twelve players were effectively the cream of professional talent in the 1859 English cricket season that had just ended:"]}, {"page": "History of cricket in New Zealand to 1890", "response": ["===George Parr's XI 1863–64===", "An English team led by George Parr made the first overseas tour of New Zealand in February 1864, playing five matches in the South Island.  The local teams fielded 22, so none of the matches are rated first-class. The team toured Australia before and after the New Zealand leg of the tour."]}, {"page": "History of United States cricket", "response": ["Sides from England toured the US and Canada after the English cricket seasons of 1859, 1868 and 1872, in tours organized as commercial ventures. The 1859 team comprised six players from the All-England Eleven and six from the United All-England Eleven and was captained by George Parr. They played five matches, winning them all. There were no first-class fixtures. The match at New York attracted a crowd that was claimed to be 10,000, all that the ground would hold."]}, {"page": "History of the England cricket team to 1939", "response": ["The early overseas tours were organised as purely commercial ventures, as indeed were the first Test-playing tours. The first such tour was to North America by a team of English professionals, departing England in September 1859. The team comprised six players from the All-England Eleven and six from the United All-England Eleven, and was captained by George Parr. They played five matches, winning them all. There were no first-class fixtures.", "In 1863–4, the Melbourne Cricket Club organised a tour by an English team under the captaincy of George Parr, which also visited New Zealand. The team played 16 matches, but none were first-class."]}, {"page": "Cricket in Australia", "response": ["The first tour by an English team to Australia was in 1861–62, organised by the catering firm of Spiers and Pond as a private enterprise. A further tour followed in 1863–64, led by George Parr and was even more successful than the last."]}, {"page": "George Freeman (cricketer)", "response": ["Clarendon Club, but was not taken up by the newly formed Yorkshire county club until 1865 under recommendation of George Parr. Freeman emerged after a few matches in 1865 and 1866 to jump straight to the top of the tree in 1867. He had tremendous “cut” from leg as well as pace,Pardon, Sydney H. (editor); John Wisden’s Cricketers’ Almanac; Thirty-third Edition (1896); p. xliii which was said by those who played against him to reflect a classic round-arm delivery and powerful twist extending as far up as his elbow. On the rough, even stony pitches that prevailed before the advent of the heavy roller George Freeman was a terror to even the best batsmen, with frequent shooters often being impossible for any batsman to stop. Between 1867 and 1871 Freeman took 269 wickets in a mere thirty-seven first-class matches for a phenomenal average of 8.94 runs per wicket. In these five seasons he conceded only 26.8 runs for every 100 balls he bowled and took one wicket every 33 balls he bowled.Until 1889, the over was four balls rather than six"]}, {"page": "John Thewlis senior", "response": ["Thewlis came late into the game and was the second man to emerge from Lascelles Hall, Huddersfield, and play for his home county.  The first, Luke Greenwood, became county captain. George Parr, successor to William Clarke in the management of the All-England Eleven, approached him for advice: \"Greenwood, we are going to Southampton to play 22 there. Do you know a good batter?\"Quoted in Pullin 1900, p. 80.  Greenwood replied that, in Thewlis, he did, and so, on nothing more than that brief paean, Parr included him as opening batsman. He was bowled first ball and, as he left the wicket, turned and vowed to the bowler that it would not happen again; nor did it, as Thewlis worked his way to 41 not out in the second innings."]}]}}