{"wiki_id": "http://www.wikidata.org/entity/Q5545860", "itemLabel": "George Walton", "itemDescription": "English cricketer (1863-1921)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Walton_(cricketer)", "wikipedia_page": {"main": "George Walton (3 December 1863 – 30 June 1921) was an English cricketer. Walton was a right-handed batsman who bowled right-arm fast-medium. He was born at Belgrave, Leicestershire.\nWalton made his first-class debut for Leicestershire against the Marylebone Cricket Club in 1894 at Lord's. He made seven further first-class appearances for Leicestershire in 1894, with his final first-class appearance coming against Nottinghamshire in the 1895 County Championship. In nine matches, he scored a total of 88 runs at an average of 6.76, with a high score of 24, while with the ball he took 17 wickets at a bowling average of 24.94, with best figures of 4/64.He died at the place of his birth on 30 June 1921.", "link_mentions": [{"page": "Belgrave, Leicester", "response": ["*George Walton - cricketer - born and died in Belgrave."]}, {"page": "George Walton (disambiguation)", "response": ["George Walton (1749–1804) was an American politician who signed the United States Declaration of Independence.", "George Walton may also refer to:", "* George Walton (1615–1686), proprietor of Walton's Tavern, scene of early American witchcraft, in New Castle, New Hampshire", "* George Walton (Manitoba politician) (1854–1925), politician in Manitoba, Canada", "* George Walton (Royal Navy officer) (1664/5–1739), British Royal Navy admiral", "* George Walton (MP), Member of Parliament (MP) for Huntingdonshire", "* George Walton (cricketer) (1863–1921), English cricketer", "* George Walton (footballer) (born 1911), English footballer"]}, {"page": "Lewis D'Aeth", "response": ["The son of Narborough Hughes D'Aeth, he was born at Knowlton Court in Kent in March 1858. D'Aeth was commissioned as an ensign in the Kent Militia Artillery in June 1876. He was transferred to the Royal Scots Fusiliers in February 1879 with the rank of second lieutenant, with promotion to captain following in July 1887. He retired from regular service the following year and was appointed to the Royal Fusiliers militia. D'Aeth later made a single appearance in first-class cricket for the Marylebone Cricket Club (MCC) against Leicestershire at Lord's in 1894. He was dismissed twice in the match without scoring by George Walton. D'Aeth was also a prominent figure in Kent cricket.The Late Lieut. Colonel Narbrough D'Aeth. Whitstable Times and Herne Bay Herald. 30 October 1920. p. 5"]}]}}