{"wiki_id": "http://www.wikidata.org/entity/Q5543732", "itemLabel": "George Ratcliffe", "itemDescription": "British cricketer (1882-1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Ratcliffe_(cricketer,_born_1882)", "wikipedia_page": {"main": "Another cricketer who played for Derbyshire during the 1887 season was named George Ratcliffe.\nGeorge Ratcliffe (9 November 1882 — 31 December 1949) was an English cricketer who played for Derbyshire in 1919.\nRatcliffe was born at Derby. He played his only first-class match for Derbyshire during the 1919 season against the Australian Imperial Forces. He took a wicket within the 11 balls he bowled. He was a right-handed batsman and made 8 runs in the two innings as a tailend batsman.\nRatcliffe died at Ollerton, Nottinghamshire aged 67.", "link_mentions": [{"page": "George Ratcliffe (cricketer, born 1856)", "response": ["Another cricketer who played for Derbyshire during the 1919 season was named George Ratcliffe.", "George Ratcliffe (born George Ratcliff 1 April 1856 — 7 March 1928) was an English cricketer who played for Derbyshire from 1887 to 1889.", "Ratcliffe made his debut for Derbyshire in the 1887 season in a match in June against Surrey. In this he scored 64, but his average fell from this point in his remaining four first-class matches. At the end of the season Derbyshire left the championship but Ratcliffe continued to play for the club in the 1888 and 1889 season. Ratcliffe was a left-handed middle-upper order batsman and played in 10 innings in 5 first-class matches. He bowled two overs but did not take a wicket.George Ratcliffe at Cricket Archive"]}, {"page": "George Ratcliffe", "response": ["George Ratcliffe may refer to:", "* George Ratcliffe (footballer) (1876–1944), English footballer", "* George Ratcliffe (cricketer, born 1856) (1856–1928), English cricketer", "* George Ratcliffe (cricketer, born 1882) (1882–1949), English cricketer", "* George Ratcliffe Woodward (1848–1934), English composer"]}, {"page": "Derbyshire County Cricket Club in 1919", "response": ["The season marked the beginning of Guy Jackson's long association with the club. Other new players included the Hill-Woods - Basil and Wilfred, Arthur Severn, Louis Flint, Geoffrey Bell and William Malthouse. In addition George Ratcliffe made his single appearance for Derbyshire against the Australians, and  John Dunlop Southern made the first of his occasional appearances, also against the Australians."]}]}}