{"wiki_id": "http://www.wikidata.org/entity/Q5548926", "itemLabel": "Gerald Bardswell", "itemDescription": "English cricketer (1873-1906)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gerald_Bardswell", "wikipedia_page": {"main": "Gerald Roscoe Bardswell (7 December 1873 – 29 December 1906) was an English cricketer who played 59 first-class matches between 1894 and 1902. He was born at Woolton, Liverpool and died at New Orleans, Louisiana.\nBardswell was a right-handed batsman sometimes used as an opener and a right-arm medium-pace bowler. He was educated at Uppingham School where he was played mainly as a medium-pace bowler, and at Oriel College, Oxford. It was as a bowler that made his first-class debut for Oxford University on 21 May 1894. In his third game he took six Lancashire wickets for 36 runs in the county side's only innings of the match. His nine wickets in the next Oxford game, against Marylebone Cricket Club (MCC), included several Test match players. He was picked for the University match against Cambridge and took six for 76 in Cambridge's second innings to help Oxford to an eight-wicket victory. After nine matches for Oxford, he had taken 40 wickets at an average of just over 16 runs per wicket. He then played in a few matches for Lancashire when the university season was over, taking five catches in one match and four in another: Wisden Cricketers' Almanack wrote later that \"among the short-slips of his day no one surpassed him\".At the end of the 1894 English season, and before the University term began, Bardswell joined a team raised by Lord Hawke which toured North America and played two first-class matches. In the 1895 season he was in the Oxford University first team from the outset, and in the first game he opened the innings with Pelham Warner, scoring 69, more than double his previous highest first-class score of 32. His season was curtailed, however, by a hand injury after just four matches – during which he had taken 11 wickets and 12 catches – and he did not play again that summer.\nBardswell returned to the Oxford team for the 1896 but after his hand injury he scarcely bowled at all: he took just two wickets in 1896 and another two in 1897, and did not bowl at all after that. Instead, he won a second Blue for his much-improved batting, mostly from the lower middle order, though he occasionally acted as an opening batsman; in the match against Surrey at The Oval he hit 97 and this was to be the highest score of his first-class career. Having been instrumental in the victory in his previous University Match in 1894 with his bowling, he was 33 not out when Oxford secured a dramatic victory by four wickets in the 1896 game against Cambridge, Oxford knocking off 330 to win after incurring a 117 deficit on first innings. Later in the season he again played for Lancashire; in his 16 first-class matches in 1896, he averaged 27.80 with the bat and took 32 catches.For the 1897 season, Bardswell was elected as captain of the Oxford University team. In the early part of the year, however, though notionally at Oxford, he took part in a three-month tour of the West Indies, again under the captaincy of Lord Hawke. He played in six first-class matches on the tour and scored well, taking in addition 18 catches. His captaincy at Oxford was not successful: the team was notably weaker than in his previous years and the University match was won decisively by Cambridge, though Bardswell top-scored in both Oxford innings.In 1898, Bardswell played only in a couple of first-class matches for MCC against the Universities, but at the start of the 1899 season he reappeared for Lancashire, playing as captain in the first six games of the season, but standing aside when Archie MacLaren resumed his cricket career in June. That was the end of Bardswell's first-class cricket career apart from one appearance for Lancashire in an end-of-season match in 1902, in which he was not at all successful.\nAt the time of his death in December 1906, Bardswell was a committee member of MCC; he had had an operation earlier in the year, but his death in New Orleans was described as happening \"very suddenly\".\n\n", "link_mentions": {}}}