{"wiki_id": "http://www.wikidata.org/entity/Q5546793", "itemLabel": "James Allan", "itemDescription": "Scottish singer-songwriter (born 1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Allan_(musician)", "wikipedia_page": {"main": "James Allan (born 21 September 1979) is the lead singer and guitarist of the Scottish rock band Glasvegas, and a former footballer.", "link_mentions": [{"page": "September 21", "response": ["*1979 – James Allan, Scottish singer-songwriter and guitarist "]}, {"page": "List of Scottish musicians", "response": ["*James Allan, lead singer with Glasvegas"]}, {"page": "List of Never Mind the Buzzcocks episodes", "response": ["|James Allan (Glasvegas), James Corden and Germaine Greer"]}, {"page": "List of NME covers", "response": ["*03/01/09 Photo Yearbook Special, with cover featuring James Allan of Glasvegas, Scarlett Johansson, Caleb Followill of Kings of Leon, Liam Gallagher of Oasis, Katie White of The Ting Tings, Brandon Flowers of The Killers and Alex Turner of The Last Shadow Puppets (and Arctic Monkeys)."]}, {"page": "James Allan", "response": ["James Allan may refer to:", "*James Allan (Australian footballer) (born 1985), Australian rules footballer", "*James Allan (cricketer) (born 1972), New Zealand cricketer", "*James Allan (footballer, born 1857) (1857–1911), Scottish schoolmaster and footballer, founder of Sunderland A.F.C.", "*James Allan (footballer, born 1866) (1866–1945), Scottish international footballer (also known as John Allan)", "*James Allan (rugby union) (1860–1934), New Zealand rugby union player", "*James Allan (diplomat) (1932–2018), British diplomat", "*James Allan (musician) (born 1979), lead singer and guitarist and former footballer", "*James Allan (Canadian politician) (1894–1992), Ontario politician", "*James Allan (bishop) (1928–2013), retired Canadian Anglican bishop", "*James Allan (computer scientist), University of Massachusetts Amherst professor", "*James Allan (law professor) (born 1960), Canadian-Australian law professor", "*James Allan (Queensland politician) (1856–1938), Queensland draper and state politician", "*James Allan Jr. (1845–1932), Wisconsin politician"]}, {"page": "Glasvegas", "response": ["Glasvegas are a Scottish indie rock band from Glasgow. The band consists of James Allan (vocals), Rab Allan (lead guitar) and Paul Donoghue (bass guitar), with Swedish drummer Jonna Löfgren joining the group in 2010 until her departure in 2020.", "The band was formed by cousins James Allan and Rab Allan in the summer of 2003 with Paul Donoghue and Ryan Ross on drums completing the line-up soon after.  Local gigs in and around Glasgow were frequent and in May 2004 the band released a self-financed limited edition double A-side single, \"I'm Gonna Get Stabbed\"/\"Ina Lvs Rab\" on CD. The single gained an early and positive review for Glasvegas from Rick Fulton of the Daily Record on 24 December 2004.  The single (along with some early demos) gained (their first) radio airplay and favourable feedback from Jim Gellatly on his radio show 'Beatbreakers' in January 2005, which was broadcast on the now defunct Beat106FM.  Although many make the obvious observation that the band name is a mix of Glasgow (where they are from) and Las Vegas (the world capital of entertainment), the band have made it clear many times that this was never the reason why the band called themselves Glasvegas.  According to James Allan he liked the name Glasvegas as it rolled sweetly off the tongue.  It is a possibility that it is the combination of the Gaelic 'Glas' (grey) with the Spanish 'vegas' (meadow). Another common mistake is that the band name is split into two words \"Glas Vegas\" (especially in the USA) which is incorrect.", "The band opened 2007 with a headline show at King Tuts Wah Wah Hut.  In early February 2007 (with assistance from Alan McGee), the band made a video for one of their demos, \"Daddy's Gone\", which was shot in London and in Glasgow's East End.  This early video helped pave the way for the song's popularity. In late February 2007, James Allan made the decision to post up all the band's demos on MySpace for free download. These free downloads helped foster recognition about Glasvegas and soon their gigs were selling out.  On 8 March 2007, the band took time out to play a low key acoustic gig in Barlinnie Prison in Glasgow.", "After releasing their second limited edition 7\" single, \"It's My Own Cheating Heart That Makes Me Cry\" on 14 February 2008 via Sane Man Recordings, the band opted to sign to Columbia Records part of Sony. On 28 February 2008, Glasvegas won the Philip Hall Radar Award at the NME Awards. On 10 March 2008, Glasvegas travelled to the United States where they recorded their eponymous debut album, Glasvegas, at Brooklyn Recording Studios, Brooklyn, New York. The album was co-produced by James Allan and Rich Costey. Glasvegas also filmed the video for their first single \"Geraldine\" in Brooklyn on 30 April 2008. On return to the UK at the beginning of May 2008, the band embarked on a touring schedule that would continue for over 16 months.  On 23 June 2008, Glasvegas released their first Columbia single \"Geraldine\" which debuted at No. 16 on the UK singles chart. The summer of 2008 also saw the band make their debut at Glastonbury Festival playing the John Peel Stage on 27 June 2008.  On 12 July 2008, Glasvegas played at T in the Park in the Futures Tent.  Further debut festival appearances in the summer of 2008 took place at Oxegen in Ireland and on consecutive days on 18 and 19 July 2008 at the Benicassim Music Festival in Barcelona and Madrid in Spain.  On 20 July 2008, the band played Latitude Festival.  On 13 August 2008, Glasvegas were invited as opening support to Muse at Marlay Park on the outskirts of Dublin, and the following day saw the band play their first support with Kings of Leon at the Brixton Academy.  On 25 August, Glasvegas released their second Columbia single \"Daddy's Gone\" which debuted at No. 12 on the UK Singles Chart. On 30 August 2008, the band played the last ever Hydro Connect Festival near Inveraray in Scotland.", " however lead singer James Allan disappeared just days before the Awards Ceremony on 8 September 2009.  He went missing for a total of five days before eventually turning up safe and well in New York.", "In June 2013 the band announced that for the second time in their careers they had signed a worldwide major record deal with one of the world's biggest music companies; BMG. The first release via BMG was the single \"If\".  The track was released on 8 July 2013. A music video to accompany the release of \"If\" was first released onto YouTube on the same day. The video features William Shatner and is Glasvegas' take on The Old Grey Whistle Test. \"We played on the Late Show with Craig Ferguson in LA a couple of years ago and William Shatner introduced us as he is a fan of the band,\" Allan said. \"We thought it would be a cool thing to add in for the new video since it also has a 'late show' theme. It's a simple live performance by the band with an abstract part in the middle where it looks like the video has been taped over with random visuals. The video has a filter that we wanted to put on it just to make it look even more like you were watching a recording on VCR. Old school!\" The band released their third album Later...When the TV Turns to Static in September 2013. It received generally favourable reviews from critics stalling at No.41 in the UK Charts.  Later...When The TV Turns To Static was released in three formats. Standard CD, Heavyweight White Vinyl and Deluxe Almanac. The Deluxe Almanac is presented with the iconic chevron foil embossed on a hardback almanac bound in linen with 40 stitched-in pages and ribboned page keeper. The Deluxe Almanac was conceived by James Allan in its entirety. The band released a third single; the title track \"Later...When the TV Turns to Static\" to promote the fact that 30 min of footage contained within the Deluxe Almanac DVD was broadcast by Sky Arts.", "*James Allan – vocals, rhythm guitar (2003–present)"]}, {"page": "Go Square Go!", "response": ["\"Go Square Go!\" is a song by Scottish Indie rock band Glasvegas. The song was written by the band's singer and guitarist James Allan. It was released as the band's debut 7\" single through WaKS on 30 October 2006, as well as a download.", "The band re-recorded the song and included it on their self-titled debut album in 2008. The song was recorded at Central Sound Studios in Glasgow, Scotland. The song was produced by James Allan and recorded and engineered by Kevin Burleigh.", "Songs and lyrics by James Allan. Music by Glasvegas.", "* James Allan –  vocals guitar,", "* James Allan – Producer", "Category:Songs written by James Allan (musician)"]}, {"page": "Geraldine (song)", "response": ["All songs written by James Allan, except where noted.", "Category:Songs written by James Allan (musician)"]}, {"page": "Glasvegas (album)", "response": ["Glasvegas is the debut studio album by the Scottish indie rock band Glasvegas, first released in the UK on 8 September 2008 by Columbia Records. The album was produced by lead singer James Allan and Rich Costey (Muse, Franz Ferdinand). The album sold  copies in its first week of release and reached number 2 on the UK Albums Chart. The album was nominated for Best International Album at the 2008 Swedish Rockbjörnen awards, Best Album at the 2009 NME Awards and the 2009 Mercury Prize. NB: Select \"Jag vill rösta på:\" in \"11: Årets utländska album\". On 25 September 2009 the album was certified Platinum by the BPI, and it has sold over 300,000 copies in the UK.", "The album was released to generally favourable reviews, garnering an average score of 74 out of 100 at aggregator website Metacritic. Observer Music Monthly says that \"these hard-nosed softies are unique and this, make no mistake, is their Definitely Maybe, the quintessential noise-pop set of the modern age.\" Dot Music gave the album a glowing review, calling it \"a gut punch of a debut, and one that makes you believe Glasvegas are one of those rare, rare bands who might just have that perfect record in them.\"Gill, Jaime (12 September 2008), \"Yahoo! Music Album Review\". Yahoo! Music. (accessed 2008-01-07)   Likewise, the NME exclaimed, \"So believe it: this is the real thing, no-one's crying wolf, not even Alan McGee.\" Rolling Stone found that on the album \"Glasvegas create wall-of-distortion melodrama that draws on The Jesus and Mary Chain, Sixties girl groups and The Velvet Underground's rain-dance pulse. It makes for a compelling blend of grays--lit by singer James Allan's high, bright hurrahs.\" Spin proclaimed: \"Glasgow quartet Glasvegas are a product of this world--frontman James Allan is even a former professional footballer--and their remarkable debut gives voice to its fears, frustrations, and heartaches without succumbing to its clichés.\" Music critic Robert Christgau gave the album an A grade in his February 2009 MSN Consumer Guide column, describing the band as \"too good to be true.\"", "All tracks written by James Allan, except where noted. (\"Flowers & Football Tops\" contains elements from the song \"You Are My Sunshine\" by Mitchell/Davis, and \"Stabbed\" uses the music of Ludwig van Beethoven's \"Moonlight\" Sonata as a backdrop to spoken word)", "The album's cover artwork was illustrated by Village Green based on ideas and concepts conceived by James Allan.  The design is inspired by Vincent van Gogh's 1889 painting The Starry Night. James Allan favoured the comparison between the painting and the band's sound, for their \"tranquility, but fury as well.\"Artwork section taken from Q Magazine, January 2009 issue, pg. 87", "* The Daily Record: James Allan's track-by-track rundown of the band's debut album"]}, {"page": "James Allan (singer)", "response": ["#REDIRECT James Allan (musician)"]}, {"page": "Please Come Back Home", "response": ["Category:Songs written by James Allan (musician)"]}, {"page": "Flowers & Football Tops", "response": ["\"Flowers & Football Tops\" is a song by Scottish Indie rock band Glasvegas, taken from their self-titled debut album. The song first appeared in a different recording as the B-side to the band's second single release \"Daddy's Gone\" in November 2007 on Sane Man Records, and was rerecorded and released as a single in the UK on 23 February 2009.Columbia Records UK | News | Glasvegas - Next single is... The song was written and composed by the band's singer and guitarist James Allan, who explained that the song is about the murder of Kriss Donald to The Daily Record: \"Sometimes when you read things or see things on TV, you can't help but put yourself in the position of people's misfortune. That was on my mind when I heard about the murder of Kriss Donald. It's about a kid who never made it home.\"Glasvegas album: track by track - The Daily Record The title is a reference to the practice common in Britain of laying shirts of the deceased's preferred football team alongside wreaths of flowers. The flowers and footballs tops may be laid at the graveside, or - as is often the case with a violent death - at the place where they died.", "All songs written by James Allan.", "* James Allan – electric guitar, vocals, producer", "Category:Songs written by James Allan (musician)"]}, {"page": "Glasvegas discography", "response": ["The discography of Glasvegas, a Scottish Indie rock band, consists of four studio albums and twelve singles. James Allan (vocals and guitar), Rab Allan (guitar), Paul Donoghue (bass) and Jonna Lofgren (drums) formed the band in Glasgow, Scotland in 2003. The band's debut single was the limited edition double A-side single, \"I'm Gonna Get Stabbed\"/\"Ina Lvs Rab\", which was released in May 2004. Three further independent singles were released through WaKS and Sane Man, all of which failed to chart. Despite this, \"Daddy's Gone\", released on Sane Man Recordings, was voted the No.2 single of the year by the NME.", "|align=\"left\" valign=\"top\"|James Allan/Robert Hackett", "|align=\"left\" valign=\"top\"|James Allan/Alex Hardy"]}, {"page": "The Big Pink", "response": ["The Big Pink signed with British record label 4AD in February 2009.4AD – Three New Signings Announced  On 25 February 2009, The Big Pink won the prestigious Philip Hall Radar Award for best new act at the NME Shockwave Awards. The duo were presented the award by James Allan and Caroline McKay of Glasvegas, who had won the award in 2008. In April, 4AD issued the duo's first single for the label, \"Velvet,\" which Pitchfork Media described as \"undeniably immense, but it's a tribute to the Big Pink's skill and maturity that it still manages to sound intimate\", and awarded the track a 7 out of 10 rating. The single was again produced by the band and mixed by Alan Moulder. A 7-minute remix of \"Velvet\" by Gang Gang Dance followed as an online-streaming single. The Big Pink provided a cover of \"Lovesong\" for The Cure tribute album Pictures of You: A Tribute to Godlike Geniuses The Cure, which was made available with the 25 February 2009 issue of NME.4AD Journal: The Big Pink Cover The Cure  Following the releases, the duo opened for TV on the Radio in Europe before embarking on their first headlining UK tour.4AD – The Big Pink – Debut 4AD Single, UK Tour, NME Award  A second single on 4AD, the non-album track \"Stop the World\", was released as a limited edition 7\" single on 29 June 2009.4AD – The Big Pink – Stop the World  It was co-produced with Paul Epworth."]}, {"page": "Euphoric Heartbreak", "response": ["Euphoric Heartbreak (stylized as EUPHORIC /// HEARTBREAK \\\\\\) is the second studio album by Scottish rock group Glasvegas, which was released on 4 April 2011 by Columbia Records.  It reached No.10 in the UK and No.1 in Sweden. The album was written, demoed and tracked by James Allan in a luxury beach house in Santa Monica, California before full production and final recording took place in London and Glasgow. The album was produced by Flood and mixed by Claudius Mittendorfer. The song \"The World is Yours\" features on EA Sports' FIFA 12. As of July 2014, the album had sold 30,400 units in the UK, which is ten percent of the sales of their platinum-selling debut album.", "A free download of \"The World Is Yours\" was made available on Glasvegas' official website on 16 January 2011.  It was also revealed that the opening track \"Pain Pain, Never Again\" is a spoken word piece, and likewise the final track \"Change\" features James Allan's mother performing a small spoken word piece. According to James Allan, the forward and backward slashes contained in the album title represent \"the ascent, the crest of a wave, and then the crash.\" I Feel Wrong (Homosexuality Pt:1) and Stronger Than Dirt (Homosexuality Pt:2) were also key tracks on the album.", "*James Allan – vocals, drums", "Note: While drummer Jonna Löfgren is listed as a member of the band, Glasvegas recorded the album as a trio prior to her joining with drums credited to Echo, which was a pseudonym for James Allan."]}, {"page": "2002 Scottish Challenge Cup Final", "response": ["In the quarter-finals, Brechin faced another home game against a First Division club, this time against Falkirk.Brechin City v Falkirk – Scottish League Challenge Cup 20/8/2002, espnfc.com. ESPN FC. Retrieved 10 June 2013. The score was 0–0 for most of the game before Falkirk took the lead with only three minutes left to play with a goal from Craig McPherson. However, Brechin scored one minute before the end through Kevin Fotheringham to force extra time. The score remained equal after extra time so the winner was decided by a penalty shoot-out; Brechin winning 5–3.Brechin 1–1 Falkirk (5–3 on pen), news.bbc.co.uk. BBC Sport. 20 August 2002. Retrieved 10 June 2013. With four clubs left in the tournament, Brechin were drawn against Third Division club Queen's Park at Hampden Park.Queen's Park v Brechin City – Scottish League Challenge Cup 27/8/2002, espnfc.com. ESPN FC. Retrieved 10 June 2013. Queen's Park scored first through James Allan after 26 minutes but Brechin equalised before half time with a goal from Marc Millar. The rest of the game's five goals came during a nine-minute period in the second half; Brechin took a two-goal lead courtesy of Chris Jackson and Kevin Fotheringham to make the score 3–1 before goals from John Gemmell and Jonny Whelan for Queen's Park and Roddy Grant for Brechin made the scoreline 4–3 in favour of Brechin.Queen's Park 3–4 Brechin, news.bbc.co.uk. BBC Sport. 27 August 2002. Retrieved 10 June 2013. Both teams had chances to score again before the end but the score stayed the same ensuring Brechin qualified for the first national cup final in the club's history.Bell's final tolls for City , brechinadvertiser.co.uk. Brechin Advertiser. 28 August 2002. Retrieved 10 June 2013."]}, {"page": "Acrobat (U2 song)", "response": ["Glasvegas reworked the song for the 2011 tribute album AHK-toong BAY-bi Covered. \"Doing this, I was fantasising I was Bono, shades and all,\" remarked singer James Allan. \"I was singing the line, 'Don't let the bastards drag you down,' feeling determined rather than angry. Before we started, Rab [Allan, guitarist] said, 'What are you thinking about this U2 cover?' I said, 'Ach, it'll be easy: just make it sound bigger than U2'.\""]}, {"page": "Godspeed (Glasvegas album)", "response": ["Godspeed is the fourth studio album by Scottish rock band Glasvegas. The album was released across all digital platforms on 2 April 2021 through Go Wow Records, with the CD version of the album released on 20 August 2021 and the vinyl LP version to follow in January 2022. Godspeed is the band's first new studio album in eight years, following 2013's Later...When the TV Turns to Static and the departure of drummer Jonna Löfgren. The album was written, recorded, engineered and produced by lead singer James Allan.", "The album cover is from a photo taken in the Lower East Side of New York City by James Allan's friend, Angela McCluskey. The boy in the photo is blind and is being healed by the man in the wheelchair with his father behind him.  The musical theme of the album \"takes place\" across the course of one evening."]}, {"page": "Later...When the TV Turns to Static", "response": ["Later...When the TV Turns to Static is the third studio album by Scottish rock band Glasvegas. It was released on 2 September 2013 through BMG. The album was produced by lead singer James Allan. It received generally favourable reviews from critics but stalled at number 41 on the UK Albums Charts. It is the first of the group's studio albums not to reach the Top 10.", "In an interview with Louder Than War prior to the album's release, bass player Paul Donoghue told journalist Katie Clare how \"[lead singer] James [Allan] really has a full idea how this album should be, he even co-directed the first video, it was his vision from start to finish, he worked really hard and it gave everything a real continuity. Even the artwork was planned and the deluxe edition will come with a 40 page booklet that was all part of the idea.\" The album was also produced by lead singer James Allan; guitarist Rab Allan insisted to The Daily Record that, \"[the band] knew exactly what we wanted so there was no point in having anyone else but James working on it.\" James added, “It's really hard to get to that point where you have a record out that you can sit and listen to that you totally adore.\"", "Talking about the songs on the album, James Allan said in an interview with The Quietus, \"...the songs were about my experiences... and if they weren't about my experiences, they were about my thoughts on things.\" Allan explained in another interview with The Daily Record that the song \"If\" is \"quite a sympathetic song. It seems a shame the hardest, toughest things seem to define people. It's not the times you hold the medal or wins that do it. The song is a spiritual view on things – without something evil, the kind-hearted man would walk on by, invisible.\" He went on to explain the inspiration behind the song: \"My idea for the song came about during a phone call a while back with my good friend Alan McGee. He was talking to me about something quite difficult that was going on at the time and I said to him, 'Alan, if we didn't go through the bad stuff, we wouldn't recognize the good stuff; it would be invisible to you.\" Talking about the album's closing track \"Finished Sympathy\", Allan told The Guardian that \"it's about the speed with which we're expected to shed naivety, how people's expectations can be overwhelming. It's like when an infant trips and falls – people rush to pick them up and crowd around them going, 'Are you OK? Are you all right?' But as soon as you're out of that infant stage, when you trip and fall, everybody laughs at you. As you get older, it seems like sympathy is nowhere to be found.\" Explaining the meaning behind the title track, Allan said, \"I guess it's a song that I was writing, kind of about the place between what has just happened, a chapter that has just passed, and moving into the next chapter, the new dawn, that in-between place, where the unknown lies ahead, the mystery lies ahead, and that can be quite scary.\"", "* James Allan - lead vocals", "* Production – James Allan"]}, {"page": "If (Glasvegas song)", "response": ["\"If\" is a 2013 single by Scottish Indie rock band Glasvegas. It was released on 8 July 2013. It is the second single from their third studio album Later...When The TV Turns To Static. It was written and produced by lead singer James Allan.", "*\"If\" was premiered live in 2011 and has been played since in following tours. Allan explains \"Quite a sympathetic song. It seems a shame the hardest, toughest things seem to define people. It’s not the times you hold the medal or wins that do it. The song is a spiritual view on things – without something evil, the kind-hearted man would walk on by, invisible.\" James Allan states, \"My idea for the song came about during a phone call a while back with my good friend Alan McGee. He was talking to me about something quite difficult that was going on at the time and I said to him, 'Alan, if we didn't go through the bad stuff, we wouldn't recognize the good stuff; it would be invisible to you.\"", "*\"Press <PLAY>\" is a brand new song written especially for the EP by James Allan. \"A lot of thought went into the 'If EP' from the decision about the cover track right down to the wee <> symbols in the ‘Press  title, which I wanted to make look like a button on a VCR. I sometimes mess around with letters and symbols and stuff.\"", "All songs written by James Allan, except where noted.", "Category:Songs written by James Allan (musician)"]}, {"page": "I'd Rather Be Dead (Than Be with You)", "response": ["\"I'd Rather Be Dead (Than Be with You)\" is a 2013 single by Scottish Indie rock band Glasvegas. It was released on 25 March 2013. It is the first single from their third studio album 'Later...When The TV Turns To Static'. It was written and produced by lead singer James Allan.", "The single was released as a limited edition 7\" white vinyl on 22 April 2013 for World Record Store Day.  The 7\" vinyl contained exclusive artwork created by James Allan. The release was also backed up with two exclusive in-store performances, one in Edinburgh's Avalanche and the other in Glasgow's Love Music. Guitarist Rab Allan said: \"We always like to do something special for our fans whenever we can, and to release a limited edition coloured vinyl for RSD seemed like a great way to celebrate the first release from our new album. James spent weeks creating the 7in record sleeve, and we're all really proud of it.\"", "The single received mixed reviews. Rick Fulton of the Daily Record described the new single as \"gorgeous, simple, devastating.  An incredible return to form from one of Scotland's truly great storytellers.\" However, NME writer Nick Levine wrote: \"here's a break-up song that makes 'We Are Never Ever Getting Back Together' sound soft. It's basically just piano and hate, and the way James Allan sings 'I'd rather be dead than be with you' could curdle custard.\"", "All songs written by James Allan, except where noted.", "Category:Songs written by James Allan (musician)"]}, {"page": "It's My Own Cheating Heart That Makes Me Cry", "response": ["\"It's My Own Cheating Heart That Makes Me Cry\" is a song by Scottish Indie rock band Glasvegas. The song was written and composed by the band's singer and guitarist James Allan.", "James Allan wrote and composed the song prior to the album recording sessions at Central Sound Studios in Glasgow, Scotland, where the band recorded their previous two singles, \"Go Square Go!\" and \"Daddy's Gone\". Kevin Burleigh, who co-produced \"Go Square Go!\" with James Allan and engineered \"Daddy's Gone\", also engineered \"It's My Own Cheating Heart That Makes Me Cry\". James Allan handled production duties whilst recording the song, as well as on the B-side to the single—a cover version of The Ronettes' \"Be My Baby\".", "All songs written by James Allan, except where noted.", "* James Allan – vocals, guitar,", "* James Allan - Producer", "Category:Songs written by James Allan (musician)"]}, {"page": "Daddy's Gone", "response": ["\"Daddy's Gone\" is a song by Scottish indie rock band Glasvegas. The song was written and composed by the band's singer and guitarist James Allan.", "James Allan wrote and composed the song prior to the recording sessions at Central Sound Studios in Glasgow, Scotland, where the band recorded their previous single, \"Go Square Go!.\"  James Allan handled all production duties as well as its B-side, \"Flowers & Football Tops.\"", "All songs written by James Allan, except where noted.", "* James Allan – guitar, vocals,", "* James Allan – Producer", "Category:Songs written by James Allan (musician)"]}]}}