{"wiki_id": "http://www.wikidata.org/entity/Q5543803", "itemLabel": "George Rennie", "itemDescription": "Scottish agriculturist", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Rennie_(agriculturalist)", "wikipedia_page": {"main": "George Rennie (1749–1828) was a Scottish agriculturist.", "link_mentions": [{"page": "John Rennie the Elder", "response": ["to see Rennie's bridge.’ After Rennie's death, London Bridge was built from his design by his sons John Rennie (junior) and George Rennie. It replaced the medieval bridge which was proving a serious impediment to the flow of the river. Rennie's bridge was eventually moved to Arizona. Southwark Bridge (1815–1819) was built as three cast-iron spans over the river. He also designed the Old Vauxhall Bridge."]}, {"page": "Andrew Meikle", "response": ["He died at Houston Mill and is buried in East Linton's Prestonkirk Parish Church kirkyard, close to Rennie's father, George Rennie, who farmed the nearby Phantassie estate by the River Tyne."]}, {"page": "George Rennie", "response": ["George Rennie may refer to:", "*George Rennie (agriculturalist) (1749–1828), British agriculturalist", "*George Rennie (engineer) (1791–1866), British civil engineer", "*George Rennie (sculptor and politician) (1802–1860), British sculptor and Member of Parliament", "*George Rennie (lacrosse) (1883–1966), Canadian lacrosse player", "*George Rennie (Canadian politician) (1866–1930), Conservative member of the Canadian House of Commons", "*George Rennie (ship), a wreck off the coast of Magnetic Island"]}, {"page": "George Rennie (sculptor)", "response": ["thumb|right|220px|George Rennie's statue Cupid Rekindling the Torch of Hymen", "George Rennie (1801 or 1802 – 22 March 1860) was a Scottish sculptor and politician. He entered politics to support the arts in Britain and helped achieve free access to public art and museums. He was a Member of Parliament (MP) for Ipswich, 1842–1847. That year he was appointed as governor of the Falkland Islands, off the coast of Argentina.", "George Rennie was born to George Rennie, agriculturist, and his wife in Phantassie, East Lothian, Scotland. He was a nephew of John Rennie, the civil engineer. Interested in art from an early age, Rennie studied sculpture at Rome as a young man.", "*George Rennie entry from the online Dictionary of Falklands Biography"]}, {"page": "East Linton", "response": ["*George Rennie (1802-1860) sculptor and politician was born here, at Phantassie.", "*George Rennie  (1749-1828) agriculturalist, was born here at Phantassie."]}, {"page": "Rennie", "response": ["* George Rennie (agriculturalist) (1749–1828), British agriculturalist", "* George Rennie (engineer) (1791–1866), British civil engineer", "* George Rennie (sculptor and politician) (c. 1801–1860), British sculptor and Member of Parliament"]}, {"page": "Prestonkirk Parish Church", "response": ["*George Rennie, agriculturalist and brother of John Rennie, civil engineer", "Image:Prestonkirk churchyard.jpg|Andrew Meikle, George Rennie and John Rennie are buried here"]}, {"page": "Phantassie", "response": ["The  Phantassie Farm and Workshop, presently owned by Hamilton Farmers, is the birthplace and childhood home of the civil engineer John Rennie the Elder (1761–1821), and his brother George Rennie (1749–1828). John Rennie is commemorated at Phantassie by balusters taken from Waterloo Bridge in London, which he designed. The estate was formerly the property of the Countess of Aberdeen, until purchased by the Rennie family in the 18th century. The 18th century main house is a category A listed building, while the farmstead is category B listed."]}, {"page": "Robert Brown (agriculturalist)", "response": ["He was born in East Linton, East Lothian and entered into business in his native village, but soon turned to agriculture, which he carried on first at West Fortune and afterwards at Markle, where he practised several important experiments. He was a close friend of George Rennie of Phantassie."]}, {"page": "General View of Agriculture county surveys", "response": ["|Robert Brown, George Rennie, John Shirreff\t"]}, {"page": "John Shirreff", "response": ["The survey General View of the Agriculture of the West Riding of Yorkshire (1794) was written by Shirreff with Robert Brown and George Rennie, from the same area as Shirreff. It escaped criticism from William Marshall who compiled a Review of the series. Shirreff went on to compile surveys of Orkney and Shetland (1804)."]}]}}