{"wiki_id": "http://www.wikidata.org/entity/Q5541716", "itemLabel": "George Ley", "itemDescription": "English footballer (born 1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Ley", "wikipedia_page": {"main": "Oliver Albert George Ley (born 7 April 1946) is an English former footballer who played professionally in both England and the United States.\nLey played for Exeter City, Portsmouth, Brighton & Hove Albion and Gillingham between 1963 and 1976.\nFollowing his English career, Ley moved to the Dallas Tornado of the North American Soccer League. He was twice named to the NASL All Star second team as a defender. He then moved to the Major Indoor Soccer League and played for the Wichita Wings. In April 1983, the Oklahoma City Slickers of the second division American Soccer League hired Ley as a player-assistant coach.Following his playing career, Ley turned to coaching. He served as the Luton Town head youth coach under manager Jimmy Ryan. He returned to the United States as the head coach of the USISL Austin Sockadillos. Later, he served as Director of Coaching for the River City Rangers from 1996–2003 in Austin, TX. He also served as Director of Coaching for the Crossfire Soccer Club in Round Rock, TX in 2009 and 2010.", "link_mentions": [{"page": "Portsmouth F.C.", "response": ["|align=\"left\"|George Ley||||LB/LW||1967–72||—||204||11"]}, {"page": "Dallas Tornado", "response": ["*1976 Jeff Bourne, Bob Hope, George Ley", "*1977 George Ley, Steve Pecher"]}, {"page": "Wichita Wings", "response": ["Becker hired Roy Turner as head coach and brought in Ward Lawrence to help oversee operations. Tom Marshall became the Wings’ general manager. On November 23, 1979, with only a week to go before the opening game, Marshall ceased to be a part of the Wings organization. The Wings and Marshall disagreed on the details of the separation, but it was to be permanent. Ward Lawrence took over as general manager and Becker brought in Ray Denton to help run day-to-day operations. Mike Ivanow was to be the first signing, but the paperwork sent to his home misspelled his name. The delay resulted in Norman Piper becoming the first Wichita Wing. Piper was joined by the former Dallas Tornado and Liverpool player Kevin Kewley, who became the team's captain. Former Manchester United forward Jimmy Ryan and Argentinian phenom Omar Gomez anchored the team's offense. Roy Turner brought on George Ley as a player-coach. Later in the season, the team added former Manchester United winger Willie Anderson and forward Andy Chapman. Chapman had signed with Arsenal at age 16 and would become a fan favorite in Wichita, becoming the fifth leading scorer in Wings history. Ivanow would be joined in goal by Keith Van Eron. Though Ivanow had US Olympic experience, Van Eron would end up playing more time in goal.", "|George Ley from 1979–82 and Norman Piper from 1982–86"]}, {"page": "Austin Lone Stars", "response": ["* George Ley"]}]}}