{"wiki_id": "http://www.wikidata.org/entity/Q5542880", "itemLabel": "George Nicholls", "itemDescription": "British politician (1864-1943)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Nicholls_(British_politician)", "wikipedia_page": {"main": "George Nicholls (25 June 1864 – 30 November 1943) was a British evangelical pastor, and Liberal-Labour politician who served as the Member of Parliament (MP) for North Northamptonshire from 1906 to 1910.Nicholls started life as a farm labourer and smallholder. He went on to be Pastor at the Evangelist Congregational Church in Chatteris, Cambridgeshire, from 1894 to 1902, and afterwards of Congregational Churches at Silverdale and Chesterton, in Staffordshire.He was elected as MP for North Northamptonshire at the 1906 general election, but was defeated at the January 1910 general election.After his defeat he stood for Parliament again in Faversham at the December 1910 general election, and in Newmarket at a by-election in May 1913, but was unsuccessful on both occasions.\nHe was elected to Peterborough town council in 1912, and became the town's mayor from 1916 to 1918.He was the chief organiser for the Allotment and Small Holdings section of the Agricultural Organisation Society, and a member of the Agricultural Wages Board, of a Royal Commission on Agriculture, of the Central Agricultural Council, of the Soke of Peterborough Small Holdings Committee, and of Peterborough United Charities. He was awarded the OBE and served as a Justice of the Peace.After World War I, he stood unsuccessfully for Parliament on six further occasions. As a Labour Party candidate in Camborne at the 1918 general election, he narrowly lost to the sitting Liberal MP Sir Francis Dyke Acland. He then stood as a Liberal Party candidate in Peterborough at the 1922 general election, in Warwick and Leamington at the 1923 and 1924 general elections, in Bury St Edmunds at a by-election in January 1925, and  in Harborough at the 1929 general election,", "link_mentions": [{"page": "National Liberal Club", "response": ["*George Nicholls, Liberal MP 1906–10."]}, {"page": "United Kingdom general election records", "response": ["*George Nicholls, Dec 1910, 1918, 1922, 1923, 1924 and 1929 (and by-elections in 1913 and 1925)a"]}, {"page": "George Nichols", "response": ["*George Nicholls Jr. (1897–1939), American director and editor", "*George Nicholls (British politician) (1864–1943), British Member of Parliament for North Northamptonshire, 1906–1910", "*George Nicholls (rugby league) (born 1944), English rugby league footballer", "*George Nicholls (footballer) (b. 1890), English footballer, played for Chelsea, Southend Utd, Ton Pentre, Rochdale, Leyton and Walthamstow Grange", "*George Nicholls (commissioner) (1781–1865), British Poor Law Commissioner "]}, {"page": "George Nicholls (MP)", "response": ["#REDIRECT George Nicholls (British politician)"]}, {"page": "Thirsk and Malton (UK Parliament constituency 1885–1983)", "response": ["*Liberal: George Nicholls"]}]}}