{"wiki_id": "http://www.wikidata.org/entity/Q5559571", "itemLabel": "Gideon Coe", "itemDescription": "British DJ", "wikipedia_url": "https://en.wikipedia.org/wiki/Gideon_Coe", "wikipedia_page": {"main": "Gideon Jon Quantrill Coe (born 22 September 1967 in Canterbury, Kent) is a radio DJ, presenter, sportscaster, voiceover artist and journalist.", "link_mentions": [{"page": "Canterbury", "response": ["*Gideon Coe, BBC Radio 6 Music presenter"]}, {"page": "Ivor the Engine", "response": ["* Gideon Coe uses Ivor's Cruising Theme as the musical bed over his last song leading up to midnight on BBC 6 Music to say nighty night."]}, {"page": "BBC Radio 6 Music", "response": ["The station opened at 7 am, Monday 11 March 2002, with a show presented by Phill Jupitus. At the start-up, presenters included Liz Kershaw, Andrew Collins, Tom Robinson, Gideon Coe, Janice Long, Chris Hawkins, Gary Burton, Craig Charles, Stuart Maconie, Brinsley Forde, Suggs, Clare McDonnell, Bruce Dickinson, Tracey MacLeod, Sean Hughes, and Bob Harris. The first record played was Ash's Burn Baby Burn", "* Gideon Coe"]}, {"page": "Radio Academy Awards", "response": ["|Super Sunday, presented by Gideon Coe and Pete Stevens"]}, {"page": "Fi Glover", "response": ["In 1993, Glover began her BBC career as a filing clerk on various local radio stations including BBC Somerset Sound, Humberside and Northampton. She joined GLR in London, as a junior reporter and went on to present the Breakfast Show with Gideon Coe three years later, winning a silver Sony Award in 1995. In 1996, she moved to BBC Radio 5 Live, where she spent seven years as a key broadcaster in news and political coverage, presenting shows such as Sunday Service, with Charlie Whelan and Andrew Pierce, Late Night Live, the Afternoon Show and the mid-morning phone in programme."]}, {"page": "The Blue Aeroplanes", "response": ["In February 2016 the band played at the 6music festival at Colston Hall's Lantern venue, being introduced by Gideon Coe and in April 2016 they were personally chosen by curator Stewart Lee to play the ATP festival at Pontins Prestatyn."]}, {"page": "Bearsuit", "response": ["Bearsuit were championed by BBC radio DJs including John Peel, Steve Lamacq, Huw Stephens, Zane Lowe, Rob Da Bank, Phill Jupitus, Marc Riley, Tom Ravenscroft, Tom Robinson, Colin Murray, Gideon Coe and John Kennedy on XFM. Accolades include scooping 'Vinyl of the Week' in the NME, 'Pick of the Week' in The Guardian, and 'Album of the Fortnight' in Artrocker."]}, {"page": "Huw Stephens", "response": ["In 2005, Stephens gained a national slot when he became one of the replacements for the late John Peel as part of Radio 1's One Music strand, which was intended to keep the spirit of Peel's show going with DJs Rob da Bank and Ras Kwame. He went on to present the weekend afternoon show and a two-hour new music programme on Thursday evenings, as well as being regular daytime cover. Stephens presented the 22:00–01:00 show, Monday to Wednesday. He currently presents on Sunday evenings, concentrating on new music championed by BBC Introducing. He also presents regularly on BBC Radio 6 Music, deputising for Steve Lamacq, Lauren Laverne, Mary Anne Hobbs, Marc Riley and Gideon Coe."]}, {"page": "Why Don't You?", "response": ["* Gideon Coe"]}, {"page": "Dream Ticket", "response": ["The presenters have been Janice Long (11 March 2002 – 1 July 2004), Jane Gazzo (5 July 2004 – 29 September 2005 - see Jane Gazzo's Dream Ticket), Nemone (3 October 2005 – 10 August 2006). Clare McDonnell (interim period in September 2006), Joe Mace (September 2006 - January 2007), Shaun Keaveny (January 2007 - April 2007), George Lamb (2 April 2007 – 18 October 2007), Gideon Coe (22 October 2007)."]}, {"page": "Oddfellows Casino", "response": ["In the mid-1990s, Bramwell recorded his first album with the band Luminous, produced and released by Shimmy Disc's producer Kramer, before going solo in 2000 and forming Oddfellows Casino. Early releases on Leicester’s Pickled Egg Records included Yellow-Bellied Wonderland and Winter Creatures, drawing comparisons with Robert Wyatt, The Beta Band, Red House Painters and late-period Talk Talk. For the band's third album, 2012's The Raven's Empire, Bramwell teamed up with producer and composer Andrew Phillips to create a record that was altogether bigger, darker and more orchestrated than what had come before. Reviews acknowledged a change in direction citing 'bubbling synths and ornate productions.' (Happening Magazine) and 'occult incantation' (Drowned in Sound). The single, \"Winter in a Strange Town\", was picked up by BBC 6Music’s Gideon Coe, Lauren Laverne and Cerys Matthews. "]}, {"page": "Emit Bloch", "response": ["The subsequent digital EP, \"Dorothy,\" included some studio versions of songs on Dictaphones Vol. 1 and received UK-wide acclaim when it was selected by The London Times as \"Hot Download of the Week\" and its eponymous single was championed by Dermot O'Leary, Gideon Coe and several other mainstream BBC DJs."]}, {"page": "The Hitchers (Irish band)", "response": ["Though the single did not chart on its release in summer 1997 (it was released by a small new independent label, Murgatroid, and distributed by Vital, as a double a-side 33rpm 7\" vinyl b/w \"You Can Only Love Someone So Much But You Can Hate Them All The Way To Hell\" and as track 2 of a 4-song CD EP) it received considerable airplay from prolific UK-based DJs including John Peel, Steve Lamacq, Gideon Coe, Sean Hughes and Bob Geldof and is still occasionally heard on UK radio to the present day. It has been cited as one of the great \"football songs\" in the press and in online discussion/commentary.", "The Hitchers recorded a Peel Session at BBC Maida Vale 4 in July 1997. This was broadcast in November 1997 and repeated in February 1998. This session has been re-broadcast on multiple occasions since by DJs such as Gideon Coe and Chris Hawkins"]}, {"page": "Emma B", "response": ["From 2004 to 2005, Emma also presented on BBC Radio 6 Music, filling in for various presenters such as Liz Kershaw, Gideon Coe, Vic McGlynn and Jane Gazzo."]}, {"page": "Guillemots (band)", "response": ["Guillemots have made numerous live performances since 2004. Their first full-scale UK tour began in April 2006. After a brief period putting the finishing touches to their debut album, and performing a set for Gideon Coe's BBC 6 Music show in June, they began a second leg of dates in October, which ran until early November."]}, {"page": "Coe (surname)", "response": ["*Gideon Coe (born 1967), British radio presenter"]}, {"page": "Monkey Swallows the Universe", "response": ["On 11 April 2006 the band appeared on Gideon Coe's BBC 6 Music morning radio show, and played two songs live in session. In May 2006, the band supported Richard Hawley on three dates of his UK tour. Later that year, the band supported The Long Blondes on five dates of their UK tour. In July 2006 MSTU released \"Science\" (b/w \"Happiness & Florence\") as a CD single, and on 7\" vinyl (b/w \"Happiness\") also on Thee SPC."]}, {"page": "Recuerdos de la Alhambra", "response": ["Performed and arranged by Jonathon Coudrille, it was used as the title music for the British television series Out of Town and a version performed by Pepe Romero was used as incidental music in The Sopranos episode \"Luxury Lounge.\" Gideon Coe on BBC Radio 6Music uses this tune as a musical background at approximately the half-way point of his evening weekday show.Gideon Coe, BBC Radio 6Music A sung version appears in the Studio Ghibli film When Marnie Was There."]}, {"page": "Helen McCookerybook", "response": ["Her songs have received airplay on BBC Radio 6 Music's Gideon Coe show, and recently he's played her last single Saturday Night With The London Set, So Long Elon (both from Green) and The Mad Bicycle Song (from The Sea). She's also had airplay on BBC Radio London's Gary Crowley show, with him playing A Good Life with a Bad Apple (from Green), which went on to make track of the week in August 2019. Mojo magazine gave her 10 track mini-album release, Pea Soup, four stars in their May 2020 issue saying \"... the discipline of brevity makes this a shining gem\". She also makes regular appearances and performs live on radio stations varying from independent stations such as Soho Radio and Resonance FM in London, the community Radio Woking station in Surrey, to BBC Scotland Highlands & Islands radio (where she was a featured artist).Helen McCookerybook, Crowley on Air, Official Blog, 31 August 2019.Helen McCookerybook, Gideon Coe Plays \"Saturday Night With The London Set\", Official Blog, 31 August 2019.Lucy O'Brien, Filter Albums, Mojo music magazine, Pg. 93, May 2020.", "In addition to her solo work, McCookerybook has been a long-term collaborator with Lester Square on various projects, as well as with Gina Birch, Martin Stephenson, Nick Page (Count Dubulah), Stuart Moxham (Young Marble Giants), The Charlie Tipper Conspiracy (a Christmas single, Femme Fatale, in aid of Refugee Action), and Vic Godard (a duet on Autumn Rendez-Vous on Mums' Revenge). In 2020, a collaboration with Robert Rotifer resulted in a new project called McCookerybook and Rotifer. Their debut 6 track EP, called Equal Parts, was released in December 2020. The EP premiered (pre-release) on Gideon Coe's BBC Radio 6 show when he played the track No Man's Land from it (and he went on to play it and other tracks during 2021). Her most recent collaboration was with analogue synth musician and producer Willie Gibson, for an EP called The Cutty Wren, which received a favourable review in The Wire magazine's May 2021 issue.McCookerybook and Rotifer: Equal Parts, Kudos Records.Gideon Coe, Beth Jeans Houghton & The Hooves Of Destiny in concert episode, BBC Radio 6 Music, 19 October 2020.Helen McCookerybook, First McCookerybook and Rotifer Airplay, Official Blog, 19 October 2020.Dan Barrow, Electonics, The Wire magazine, Pg. 63, May 2021."]}, {"page": "The Loft (British band)", "response": ["The band continues to perform occasionally. In 2015, to celebrate 30 years since their \"Up The Hill and Down the Slope\" single topped the indie chart, the band played shows in New York in May (headlining the NY Popfest in Brooklyn) and in London in June, before recording their third BBC radio session - this time for fan and supporter, Gideon Coe, on BBC 6 Music."]}, {"page": "The Cravats", "response": ["On 11 March 2016, The Cravats released \"Jingo Bells\"/\"Batterhouse\", a limited edition 7\" released on Overground Records. This was the first product of their new invigorated current incarnation of The Shend (vocals), Svor Naan (saxophone), Rampton Garstang (drums), Viscount Biscuits (guitar) and Joe 91 (bass guitar). The Cravats' third album, Dustbin of Sound, followed on Overground Records in October 2017. The band continue to receive enthusiastic reviews and regular radio plays including by Gideon Coe, Marc Riley and Henry Rollins.  In May 2020 The Cravats' fourth album, Hoorahland, was released also on Overground Records. On this album the song 'Now The Magic Has Gone' features a guest performance from Jello Biafra."]}, {"page": "Piney Gir", "response": ["Outta Site was playlisted at BBC 6 music and on Amazing Radio.  It was supported by DJs including Lauren Laverne, Mark Radcliffe, Gideon Coe, and Simon Raymonde. Oh Lies was used on ABC 's Private Practice. Outta Site, Stay Sweet and Oh Lies were used on Misfits (E4), Made in Chelsea (E4), Being Human (BBC), Waterloo Road (BBC) and Switch (ITV).", "Piney has been a darling of the BBC over the years, having done multiple sessions for BBC 1, 2 and 6, for Mark Radcliffe, Mark Riley, Stuart Maconi, Cerys Matthews, Tom Robinson, Gideon Coe, Bob Harris, Rob Da Bank, Bethan Elfyn, Janice Long, Huw Stephens, and more... she has been playlisted on BBC 6 Music and was featured live and in session on John Kennedy's Radio X X-posure show as well as the Radio X SXSW special in 2007, she's also been playlisted at Amazing Radio. In the USA she has had support from KCRW, WXNA, KKFI and has made multiple appearances on NPR including Weekend Edition and Mountain Stage, sharing the bill with Calexico, Will Oldham and Bahamas. Piney currently hosts The Other Woman Show on Soho Radio, and was previously a radio presenter for Resonance FM and also hosted \"The Doggone History of Country Music\" for Radio Nowhere."]}, {"page": "Vinny Miller", "response": ["He has provided guest vocals on tracks by Mark Van Hoen and Sing Sing, toured the US briefly with John Darnielle and Peter Hughes from American act The Mountain Goats, and recorded radio sessions with Mary Anne Hobbs for the BBC Radio 1 show Breezeblock, Gideon Coe for BBC 6Music, John Kennedy for XFM, and for British Council's The Selector. He has also collaborated with Steve Cobby, one-half of electronica acts Fila Brazillia and The Cutler."]}, {"page": "Hatcham Social", "response": ["Tim Burgess of The Charlatans, produced the band's next single, the double A-side of \"Til the Dawn\" and \"Penelope (Under My Hat)\". Both sides of the single were recorded with Burgess, for whom this was his production debut. Again, artwork was provided by Faris Badwan. Artrocker described the single as a \"polka-dot-skirt-swirling number with credibility\"Artrocker Magazine, 1–17 August 2007, page 26 - single review whilst Dazed & Confused saw it as \"carefree and irresistibly catchy.\"Dazed & Confused, Volume 2, Issue 52, August 2007, page 172 - single review The success of the single prompted BBC 6Music DJ Gideon Coe to invite the band in for their first live radio session on Tuesday 14 August 2007,Radio Times, 11–17 August 2007, page 122 - 6 Music Radio listing whilst the Queens of Noize chose \"Penelope (Under My Hat)\" as their \"trophy track\" on their BBC 6 Music show on 4 August 2007. Artrocker magazine also asked the band to perform a live radio session for them, and used one of the live tracks \"Snap My Hands\" on their cover mounted free CD in December 2007.Artrocker Magazine, Issue 73, December 2007 - Artrocker Unsigned Volume 3 CD"]}, {"page": "The Echoes (English group)", "response": ["Gideon Coe played the track, \"Marchin' Thru\", by the Echoes on 19 November 2019 on BBC Radio 6 Music."]}, {"page": "Sons of Noel and Adrian", "response": ["The lead single 'The Wreck is Not a Boat' received airplay on BBC Radio 1 and BBC 6 Music from Rob Da Bank, Gideon Coe and more."]}, {"page": "Coventry Business School", "response": ["Notable alumni of the School include: Gary Kibble, retail trading director, Shop Direct Group; and Gideon Coe, the radio DJ."]}, {"page": "The Sleeping Years", "response": ["Upon their release the EPs garnered critical acclaim, featuring on BBC Radio 1’s Introducing, the Guardian’s writer’s play list and on the cover mount of Rolling Stone and The Word. Songs were also heavily played on Gideon Coe’s 6music show, Stuart Bailie’s BBC Radio show, and on French radio, having been championed by Bernard Lenoir."]}, {"page": "Monograph (band)", "response": ["Monograph released one album and three singles on Matt Haynes' (ex-Sarah Records) Shinkansen Recordings label between 1998 and 2000. Their vocalist and guitarist, Rob Crutchley, was also the main songwriter and their records were produced by Broken Dog’s guitarist Clive Painter, with that band's Martine Roberts also guesting on several songs. A self-titled mini-album was issued under the alias Pacific Radio in 2000, while a subsequent album entitled 'Everything Is In The Past' remains unreleased. Early supporters of the band included Steve Lamacq, Gideon Coe and Sean Hughes. The  BBC Radio 1 DJ John Peel played songs from each of their releases and the band recorded a Peel session in 1999 (the first act on the Shinkansen roster to do so).Rob also took part in two live John Peel Christmas Specials with Broken Dog at Maida Vale and Peel Acres."]}, {"page": "Meursault (band)", "response": ["During 2009 and 2010, the band were included in regular rotation on local and national BBC radio stations, and playlisted by a number of BBC presenters including Gideon Coe, Marc Riley, Vic Galloway and Nemone."]}, {"page": "Emily Maguire (singer)", "response": ["* Bob Harris, BBC Radio 2, 11 November 2007. Maguire along with bass player Christian Dunham performed 3 songs live: \"Stranger Place\", \"Anything You Do\" and \"All That You Wanted\". Presenter Gideon Coe standing in for Bob Harris ended the session by playing the title track from the album Keep Walking."]}, {"page": "Pocketbooks", "response": ["Their debut single Cross The Line, released on Atomic Beat Records in 2007, was described by poet and novelist Simon Armitage as “pure snowshaker pop, and more dressing table than kitchen sink”. This was followed by an EP, Waking Up, released on Make Do And Mend Records in 2008. Their debut album, Flight Paths, was released on 13 July 2009 on How Does It Feel To Be Loved?. This was preceded by a single, \"Footsteps\", on 15 June 2009. Songs from the album picked up radio play from Huw Stephens (BBC Radio 1), Gideon Coe (BBC 6 Music) and John Kennedy (Xfm). In 2009, music critic Everett True said of the album “I know what I like, and I like this.”"]}, {"page": "Zombie Zombie (band)", "response": ["The band have been played by Gideon Coe, Tom Ravenscroft, Joe Cornish and Iggy Pop on BBC 6 Music."]}, {"page": "Caroline Trettine", "response": ["In 2015, Trettine formed the band Koral Society, in which she combines talents with the double bass player and composer, Alison Rayner, and the Guinean griot composer, kora player and multi-instrumentalist, Mosi Conde. Their album Waters Wide was played on BBC Radio 6 Music and met with critical acclaim: \"wistfully sweet...excellent\" (Gideon Coe, BBC Radio 6 Music) and \"wonderful and really lovely\" (Peter Culshaw, The Arts Desk)."]}, {"page": "Benjamin Shaw (musician)", "response": ["Benjamin Shaw released his debut EP \"I Got the Pox, the Pox is What I Got\" in October 2009 on Audio Antihero which saw airplay from BBC 6 Music on the Tom Ravenscroft, Gideon Coe, Steve Lamacq, Jon Holmes and Tom Robinson shows and positive reviews from publications such as The Skinny, The 405, The Music Fix, This Is Fake DIY, Clash Music and The Line of Best Fit who remarked \"If you think you've heard the like of Benjamin Shaw before, think again. TLOBF recommended.\".", "The debut LP There's Always Hope, There's Always Cabernet was released on 21 November to positive reviews. Drowned in Sound called it \"superb,\" Clash Music remarked that Shaw was \"an outcast, a loner, a maverick and a freak. All of these are compliments,\" The Line of Best Fit claimed \"you wouldn't want everyone (or anyone else) to sound to like Benjamin Shaw but I'm delighted someone does,\" Is This Music? awarded it 4/5 and called it \"one of the better records of the year\" and MusicOMH gave it 4/5 and hailed it as a \"truly special album.\" Album tracks \"The Birds Chirp & The Sun Shines\" and \"Interview\" were given multiple plays on the Tom Ravenscroft and Gideon Coe BBC 6 Music shows, as were the album's first single \"Somewhere Over the M6\" and its B-side \"Pig\"."]}, {"page": "Sweet Lights", "response": ["In March, 2012, Sweet Lights released his debut single, \"Endless Town\" on Highline Records. The single was soon receiving airplay on BBC Radio 6 Music from notable disc jockeys like Bob Harris (radio), Lauren Laverne, and Gideon Coe.  The \"Endless Town\" video debuted on the NME website  shortly after."]}, {"page": "The Savage Nomads", "response": ["After two years on the London gigging circuit, the band were signed to Alaska Sounds in 2010 and soon after released their debut EP What The Angel Said in October of that year. The EP was produced by Pat Collier formerly of The Vibrators and received airplay from Gideon Coe and Don Letts on BBC Radio 6 Music, and Gary Crowley on BBC London."]}, {"page": "Elspeth (band)", "response": ["Elspeth have garnered support from radio stations across the UK and Ireland including Tom Robinson and Gideon Coe on BBC 6Music, Phantom FM, Cool FM and BBC Radio 1 Introducing, which featured a live session with the band in early 2012. The track \"The Taster\" is featured on their debut album Coax, which was released by No Dancing Records on 13 May 2012."]}, {"page": "Bearfoot Beware", "response": ["One of the songs from the record, \"Tending To The Slim Pickings On The Floor\", was also issued as a 7\" split vinyl single with fellow Leeds band Moody Gowns to celebrate Record Store Day. The vinyl edition sold out in stores within a few days, and  also received national and local airplay from BBC DJs Tom Robinson (BBC Radio 6) Gideon Coe (BBC Radio 6) and Alan Raw (BBC West Yorkshire)."]}, {"page": "Knots (Sons of Noel and Adrian album)", "response": ["The first single, \"Come Run Fun Stella Baby Mother of the World\", received airplay on BBC 6Music from the likes of Gideon Coe and Lauren Laverne who made the track her \"headphones moment\"."]}, {"page": "Jon Hillcock", "response": ["Since 2010 Hillcock has been used as cover on a number of programmes for the BBC. For Janice Long on BBC Radio 2, and Tom Ravenscroft, Marc Riley, Tom Robinson, Gideon Coe, Now Playing at 6 Music, Steve Lamacq, Jon Holmes, Chris Hawkins and Nemone on BBC Radio 6 Music. Jon has most recently been found standing in for Shaun W Keaveny on his regular 'sick days'."]}]}}