{"wiki_id": "http://www.wikidata.org/entity/Q55583732", "itemLabel": "Rupert Carington, 7th Baron Carrington", "itemDescription": "English peer", "wikipedia_url": "https://en.wikipedia.org/wiki/Rupert_Carington,_7th_Baron_Carrington", "wikipedia_page": {"main": "Rupert Francis John Carington, 7th Baron Carrington,  (born 2 December 1948), is a British businessman and crossbench member of the House of Lords who succeeded his father as the 7th Baron Carrington on 9 July 2018.", "link_mentions": [{"page": "Rupert (name)", "response": ["* Rupert Carington, 7th Baron Carrington (born 1948), English businessman, son of Peter Carington, 6th Baron Carrington, former UK Foreign Secretary"]}, {"page": "List of barons in the peerages of Britain and Ireland", "response": ["#*Rupert Carington, 7th Baron Carrington", "#*Rupert Carington, 7th Baron Carrington"]}, {"page": "Peter Carington, 6th Baron Carrington", "response": ["Lord Carrington married Iona McClean (19 March 1920 – 7 June 2009), daughter of Lt Col. Sir Francis Kennedy McClean  and Aileen Wale, on 25 April 1942. They had three children: Alexandra de Bunsen  (born 1943), Virginia Carington  (born 1946; formerly married to Lord Ashcombe), and Rupert Carington, 7th Baron Carrington  (born 1948). Lord Carrington's wife, Lady Carrington, died on 7 June 2009, aged 89."]}, {"page": "List of political families in the United Kingdom", "response": ["********** Rupert Carington, 7th Baron Carrington (1948–), elected peer. Son of Peter."]}, {"page": "Baron Carrington", "response": ["The 1796 and 1797 baronies passed to the Marquess of Lincolnshire's younger brother, the fourth Baron. He had earlier represented Buckinghamshire in Parliament as a Liberal. His grandson the sixth Baron, who succeeded his father in 1938, was a noted Conservative politician who served as Foreign Secretary from 1979 to 1982 and as Secretary General of NATO between 1984 and 1988. In 1999 he was given a life peerage as Baron Carington of Upton (spelled with a single r), of Upton in the County of Nottinghamshire, and thus continued as a member of the House of Lords after the passing of the House of Lords Act 1999 had removed the automatic right of hereditary peers to be members. At the time of his death in 2018 he was the longest-serving member of the House of Lords, having taken his seat in 1945, and also the oldest member.  As of 2018, the baronies are held by his son Rupert Carington, 7th Baron Carrington."]}, {"page": "Template talk:S-ttl", "response": ["I mean, if you look at Rupert Ponsonby, 7th Baron de Mauley (if it weren't for the different year), and Rupert Carington, 7th Baron Carrington, both appear to have succeeded their fathers to the seat in the House of Lords, which they didn't."]}, {"page": "List of hereditary peers elected under the House of Lords Act 1999", "response": ["|Rupert Carington, 7th Baron Carrington"]}, {"page": "John Robinson McClean", "response": ["He was married to Anna (1813–1877). They had five daughters and one son, Frank McClean. Through Frank, their descendants include Francis McClean, Rupert Carington, 7th Baron Carrington, and the twelfth and subsequent Eliott baronets."]}, {"page": "Rupert Carington", "response": ["* Rupert Carington, 7th Baron Carrington (born 1948), son of the 6th Baron Carrington, grandson of the 5th Baron"]}, {"page": "Smith family (bankers)", "response": ["********* Rupert Carington, 7th Baron Carrington (born 1948)"]}, {"page": "Rupert Carington (businessman)", "response": ["#REDIRECT Rupert Carington, 7th Baron Carrington"]}]}}