{"wiki_id": "http://www.wikidata.org/entity/Q5552893", "itemLabel": "Gerry McGovern", "itemDescription": "English automobile designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Gerry_McGovern", "wikipedia_page": {"main": "Gerard Gabriel McGovern  is an English car designer and the design director for Land Rover marque, part of Jaguar Land Rover leading the brand's Design Studio at Gaydon, Warwickshire, creating concepts and new models.  A strong advocate of design's relevance to brand equity, he is a member of the Jaguar Land Rover board of Management.", "link_mentions": [{"page": "Coventry University", "response": ["*Gerry McGovern, design director of Land Rover"]}, {"page": "MG F / MG TF", "response": ["Steve Harper of MGA Developments produced the initial design concept in January 1991 (inspired by the Jaguar XJR-15 and the Ferrari 250LM), before Rover's in-house design team refined the concept under the leadership of Gerry McGovern. An interesting feature of the F was its Hydragas  suspension, a system employing interconnected fluid and gas displacers which provided a surprisingly compliant ride but which could be tuned to provide excellent handling characteristics."]}, {"page": "Range Rover Evoque", "response": ["Land Rover design chief, Gerry McGovern said \"It’s the first luxury SUV convertible. There have been other convertible SUVs, but not a luxury execution. We’ll take buyers from other luxury cars. Most Evoque customers came from premium brands, but had never owned an SUV before\"."]}, {"page": "Range Rover", "response": ["The fifth generation Range Rover was revealed on 26 October 2021 by the Jaguar Land Rover Chief Creative Officer and the car's designer, Gerry McGovern, at the Royal Opera House in London. As well as two PHEV, three diesel and two petrol JLR 3.0 L Ingenium I6 engine options, the car will be the first from JLR to use an engine developed under the combustion and electrified powertrain partnership agreed between JLR and BMW in 2019, as a 4.4L BMW/JLR V8 engine is also an option. It was launched with a range of mild hybrid diesel and petrol engines, with plug-in hybrids due in early 2022 and an all-electric model in 2024."]}, {"page": "MG EX-E", "response": ["The MG EX-E is a concept car that was produced by MG and presented at the Frankfurt Motor Show in 1985. The EX-E was a mid-engined sports car inspired by the Ferrari 308 and designed by Roy Axe and Gerry McGovern. The car's drivetrain and chassis were derived from the mid-engined MG Metro 6R4 rally car. The EX-E concept car did not lead to a production version, although Gerry McGovern did go on to style the later, smaller MG F sports car."]}, {"page": "Land Rover DC100", "response": ["The design was led by Gerry McGovern, director of design for Land Rover.Car Magazine 13 September 2011"]}, {"page": "Land Rover Discovery Sport", "response": ["The future design direction of the Discovery sub-brand was initially previewed in the form of the Land Rover Discovery Vision concept, shown at the 2014 New York International Auto Show, and it was during the show that Gerry McGovern announced the Land Rover Discovery Sport would be the first new model in the enlarged Discovery family. The sub-brand was to be used in the same way as Range Rover, but on leisure and family orientated models, with Range Rover models focusing on the luxury market segment. The new Discovery sub-brand was to feature two models initially, the compact Discovery Sport and the larger Discovery (sold as the LR4 in North America).", "The Discovery Sport was styled by Gerry McGovern, who was responsible for the design of the original Freelander model. The Discovery Sport shares several design cues with the larger Discovery Vision concept, though the concept vehicle is closer in size to the Discovery 4 model. McGovern left Land Rover for Ford in 1999, before returning as Director of Advanced Design in 2004. He was promoted to Design Director when Geoff Upex retired in 2006, and has been responsible for design of all three current Range Rover models. His predecessor, Upex, was responsible for the Freelander 2 design."]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Gerry McGovern"]}, {"page": "Range Rover (L460)", "response": ["The fifth generation Range Rover was revealed on 26 October 2021 by the Jaguar Land Rover Chief Creative Officer and the car's designer, Gerry McGovern, at the Royal Opera House in London. It is built on JLR's new MLA-Flex platform, will be available as a PHEV and with a seven-seat option. As well as two PHEV, three diesel and two petrol JLR 3.0 L Ingenium I6 engine options, the car will be the first from JLR to use an engine developed under the combustion and electrified powertrain partnership agreed between JLR and BMW in 2019, as a 4.4L BMW/JLR V8 engine is also an option. It launched with a range of mild hybrid (MHEV) diesel and petrol engines, with PHEVs due in early 2022 and an all-electric model in 2024. Buyers can also specify the four-seater arrangement that includes a centre console dividing the two rear seats along with an electrically operated tray table and a mini-fridge."]}]}}