{"wiki_id": "http://www.wikidata.org/entity/Q5553048", "itemLabel": "Gerry Summers", "itemDescription": "English footballer-manager (born 1933)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gerry_Summers", "wikipedia_page": {"main": "Gerald Thomas Francis Summers (born 4 October 1933) was an English professional football player with West Bromwich Albion, Sheffield United, Hull City and Walsall; he then went into football coaching with Oxford United, Gillingham, Derby County and Leicester City.\nSummers joined Sheffield United in May 1957, Joe Mercer having signed him from West Bromwich Albion. He played 260 League games as attacking wing-half before moving to Hull City in 1964, and then to Walsall. He was manager at Oxford United (1969–1975) and Gillingham (1975–1981) and coached at Derby County and Leicester City.", "link_mentions": [{"page": "Oxford United F.C.", "response": ["The first manager appointed was Harry Thompson in July 1949, soon after the club turned professional. In a nine-year spell he led the team to the Southern League title in 1953, as well as the Southern League Cup in 1953 and 1954. He was replaced by Arthur Turner in 1958, who would become the longest-serving manager in the club's history, serving more than a decade in charge. Turner led United to back-to-back Southern League titles, of which the second, in 1962, resulted in their election to the Football League. Promotion followed from the Fourth Division in 1965, and the club was crowned Third Division champions three years later. Turner left the club nine months after this success. Over the next thirteen years, five managers took charge. Ron Saunders was in charge for only a dozen games, moving to Norwich City at the end of the 1968–69 season. Gerry Summers was manager for six years, before being replaced by Mick Brown. During Brown's four-year run, United were relegated back to the Third Division after spending eight years in the Second."]}, {"page": "Steve Bruce", "response": ["Having been turned down by several professional clubs, including Newcastle United, Sunderland, Derby County and Southport, Bruce was about to start work as an apprentice plumber at the Swan Hunter dockyard when he was offered a trial by Third Division club Gillingham, whose manager Gerry Summers had seen him playing for Wallsend in an international youth tournament.Bruce (1994), pp. 39–40. He travelled down to Kent with another player from the Wallsend club, Peter Beardsley, but although Gillingham signed Bruce as an apprentice, they turned Beardsley away. At the time Bruce was playing as a midfielder, but he was switched to the centre of defence by the head of Gillingham's youth scheme, Bill Collins, whom Bruce cites as the single biggest influence on his career."]}, {"page": "Alan Hodgkinson", "response": ["Hodgkinson made his league début in Division One in a 2–1 away victory against Newcastle United on 28 August 1954 but, despite showing his undoubted potential, the presence of number one goalkeeper Ted Burgin until 1957 and National Service limited his opportunities for the first team. The arrival of Joe Mercer as manager established Hodgkinson's place as first-choice goalkeeper in the side behind the defensive line of Cec Coldwell, Graham Shaw, Brian Richardson, Joe Shaw and Gerry Summers. In 1966–67, he won the Sheffield United Supporters player of the year award. His brilliance and reliability made sure of his place until the signing of John Hope in 1971. His final appearance was, like his first, in a friendly, on 23 January 1971 against Chesterfield.", "Hodgkinson spent six years as assistant manager of Gillingham between 1975 and 1981, working as assistant to Gerry Summers, with whom he played at Sheffield United."]}, {"page": "Brian Richardson (footballer)", "response": ["Richardson signed for Sheffield United in 1954, aged 20, and stayed for 12 years, playing in 291 League matches. He was a ball-winning half-back, often paired with the more creative Gerry Summers."]}]}}