{"wiki_id": "http://www.wikidata.org/entity/Q555978", "itemLabel": "Charles Booth", "itemDescription": "social researcher and philanthropist (1840-1916)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Booth_(social_reformer)", "wikipedia_page": {"main": "Charles James Booth (30 March 1840 – 23 November 1916) was a British shipowner, social researcher, Comtean positivist, and reformer, best known for his innovative philanthropic studies on working-class life in London towards the end of the 19th century.\nDuring the 1860s Booth became interested in the philosophy of Auguste Comte, the founder of modern sociology, and converted to his Religion of Humanity, affiliated with members of the London Positivist Society, and wrote positivist prayers. He was captivated by Comte's idea that in the future, scientific industrialists would be in control of the social leadership instead of the church ministers. Booth's work, along with that of Benjamin Seebohm Rowntree, influenced government policy regarding poverty in the early 20th century and helped initiate Old Age pensions and free school meals for the poorest children. In addition, his investigation would also demonstrate how poverty was influenced by religion, education, and administration.Booth is often compared to Seebohm Rowntree due to their concepts on poverty. Even though Rowntree's work draws upon Booth's investigation, many writers on poverty generally turn their attention towards Rowntree's because his concept clearly addressed the problem of defining a \"subsistence\" level of poverty. Both Booth and Rowntree were positivists; however, many differences between Booth and Rowntree's methodology existed. While Booth classified people by their source of income, Rowntree made distinctions through class and specifically categorized groups by their economic relationships.Booth is best known for his multi-volume book, Life and Labour of the People in London (1902), which focuses on the statistics he collected regarding poverty in London. Life and Labour \"discusses a range of social conditions in which it reported that it appeared people are likely to be poor or on the margins of poverty. Booth is also recognized for influencing the transition from the Victorian Age to the 20th century. Due to his investigations on poverty, some honor Charles Booth as one of the founding fathers of social administration, and find his work critical when studying social policy.", "link_mentions": [{"page": "Fulham", "response": ["With rapid demographic changes there was poverty, as noted by Charles Dickens (1812-1870) and Charles Booth (1840-1916). Fulham had its Poorhouses, and attracted several benefactors, including: the Samuel Lewis (financier) Housing Trust, the Peabody Trust and the Sir Oswald Stoll Foundation to provide low-cost housing.Charles Booth Poverty Map of London , London School of Economics Archives; accessed 29 July 2017."]}, {"page": "1889 in literature", "response": ["*Charles Booth – Life and Labour of the People in London (begins publication)"]}, {"page": "Clara Collet", "response": ["After completion of her master's degree she worked for Charles Booth helping in his great investigative work on the conditions prevailing in late nineteenth century London. To this end she took up residency in the East End during the autumn of 1888. She was working on a chapter on women's work in Booth's survey Life and Labour of the People of London.", "With the support of Charles Booth she initially joined the civil service as Assistant Commissioner for the Royal Commission on Labour. In 1893 she secured a permanent post as Senior Investigator for Women's Industries at the Labour Department of the Board of Trade. Collet retired from the civil service in 1920 and became an active member of the Royal Economic Society and the Royal Statistical Society.", "For Charles Booth's survey Life and Labour of the People of London Collet"]}, {"page": "Limehouse Cut", "response": ["Across Burdett Road was St Anne's Rookery, \"a vile quarter lying between Limehouse Church and Limehouse-cut\".  Marked black on Charles Booth's poverty maps — the colour coding denoted \"Lowest class.  Vicious, semi-criminal\" — it was one of the few slums alongside the Cut; usually, the land was too valuable for housing.", "thumb|left|The Fenian Barracks (black): the most dangerous rookery in London. The fat refinery (arrow) attracted the even more terrifying canalside rat hordes.From Charles Booth's poverty maps: ", "Even more dangerous to police was the district near Stinkhouse Bridge bounded by Limehouse Cut to the south and centred on Furze Street.;   Charles Booth's police informants called it the Fenian Barracks, which \"sent more police to hospital than any other block in London and in which only Irish were tolerated to settle\".", "The East End was surveyed again in 1929 by researchers from the London School of Economics who found that, though the level of destitution in East London was now only about one-third as high as in Charles Booth’s time, the Fenian Barracks area was still an ugly pocket of chronic poverty."]}, {"page": "Costermonger", "response": ["* Charles Booth wrote, Life and Labour of the People in London a multi-volume book published in 1891.Booth, C., Life and Labour of the People in London, Macmillan, 1902, <Online: https://archive.org/details/lifeandlabourpe02bootgoog Volume 17 contains commentary on costermongers and their lifestyle."]}, {"page": "Toynbee Hall", "response": ["Shortly after their marriage in 1873, Samuel Barnett and his wife, Henrietta, moved to the Whitechapel district of the East End of London.https://socialwelfare.library.vcu.edu/settlement-houses/toynbee-hall/ Barnett worked as a vicar at St Jude's church, where he saw poverty at first hand. Late-Victorian Whitechapel was known for its overcrowded living spaces and high criminal activity. In the area of Whitechapel alone, the mortality rate for children under the age of five was around 60% mostly due to the tight living conditions. Charles Booth, another social reformer, mapped London according to eight different social classes, finding that around 70% of people living in the East End were in the lowest three classes."]}, {"page": "Charles Booth", "response": ["Charles Booth may refer to:", "* Charles Booth (diplomat) (1925–1997), British ambassador to Burma, 1978–1982", "* Charles Booth (footballer) (1869–1898), English footballer", "* Charles Booth (bishop) (died 1535), Tudor bishop of Hereford", "* Charles Booth (social reformer) (1840–1916), British philanthropist", "* Frederick Charles Booth (1890–1960), Victoria Cross winner"]}, {"page": "Edward Macnaghten, Baron Macnaghten", "response": ["*Rt. Hon. Sir Malcolm Martin (12 January 1869 – 24 January 1955), married Antonia Mary Booth, daughter if Charles Booth. They had four children."]}, {"page": "Esmé Howard, 1st Baron Howard of Penrith", "response": ["In 1885, he passed the Diplomatic Service examination, and was assistant private secretary to the Earl of Carnarvon as Lord Lieutenant of Ireland before being attached to the British Embassy in Rome. In 1888, he arrived in Berlin as the embassy's third secretary, and after retiring from the Diplomatic Service four years later, he was made assistant private secretary to the Earl of Kimberley, the Foreign Secretary at the time. Howard was a talented linguist who would spoke 10 languages and chose to retire from the diplomatic service in 1890 out of boredom. For the next 13 years, Howard lived a life of irregular employment, spending his time prospecting for gold in South Africa, working as a researcher for the social reformer Charles Booth, making two lengthy trips to Morocco, working as the private secretary to Lord Kimberley in 1894–1895, frequently visiting his sister at her estate in Italy and running unsuccessfully as a Liberal candidate in the 1892 election."]}, {"page": "Liverpool Road", "response": ["The house building developments were originally planned for the “comfortably off”, wanting to move from congested central London to the more rural suburb of Islington. However, from the 1850s the new railways tempted suburban dwellers to more distant and still countrified areas. Barnsbury was gradually abandoned by the prosperous, and its houses turned into tenements and flats with absentee landlords. The 1860s saw an influx of clerks, schoolmasters, printers, jewellers, milliners, dressmakers, servants and bricklayers. Censuses show house occupancy changing from single households with a servant, to multiple household occupancy, although Charles Booth’s poverty map of c.1890 still shows most Liverpool Road households as “Fairly comfortable. Good ordinary earnings”. In the first half of the 20th century the street, as with much of Islington and its population, became impoverished."]}, {"page": "Senate House, London", "response": ["The library is also home to the University of London archives, which include the central archive of the university itself and many other collections, including the papers of social reformer Charles Booth, philosopher Herbert Spencer, actress and mystic Florence Farr, author and artist Thomas Sturge Moore, writer Opal Whiteley, and publishing company Gerald Duckworth and Company Ltd."]}]}}