{"wiki_id": "http://www.wikidata.org/entity/Q5554439", "itemLabel": "Gethin Jones", "itemDescription": "Welsh footballer, born 1981", "wikipedia_url": "https://en.wikipedia.org/wiki/Gethin_Jones_(footballer,_born_1981)", "wikipedia_page": {"main": "Gethin Jones (born 8 August 1981) is a Welsh footballer who plays for Cirencester Town on loan from Merthyr Town as a defender.", "link_mentions": [{"page": "Bath City F.C.", "response": ["| Gethin Jones", "| Jim Rollo,  Gethin Jones", "| Gethin Jones"]}, {"page": "Gethin Jones", "response": ["For six weeks from 28 September, Jones presented a programme for Virgin 1 entitled Gethin Jones' Danger Hunters, which featured adrenaline junkies and their search for the ultimate thrill. Jones presented a Police Camera Action! programme about the dangers of drink driving, which was aired on 17 December 2008 on ITV1.", "Jones and Louise Minchin presented the documentary series Crime and Punishment, which aired on BBC One on 12 March 2012. On 21 May 2012, Jones joined ITV's Daybreak full-time as a reporter. He later left the show.Gethin Jones joins Daybreak ITV Press Centre, 16 May 2012", "| Gethin Jones' Danger Hunters"]}, {"page": "Daniel Parslow", "response": ["He was called up by the Wales semi-pro team for the Four Nations Tournament in May 2007. Parslow's debut came as a 59th-minute substitute for Gethin Jones in their opening match, a 1–0 win over the hosts Scotland on 22 May 2007. He started the 1–1 draw with the Republic of Ireland on 25 May 2007, and was a 79th-minute substitute for Jones in the championship decider against England, which finished in a 3–0 defeat on 27 May. Parslow captained the semi-pro team for the first time in their 2–1 away defeat to England in the 2007–2009 International Challenge Trophy on 20 February 2008. He retained the armband for the 2008 Four Nations Tournament, starting all of Wales three matches as they finished in second place in the four-team group. His career with the semi-pro team finished with eight caps."]}, {"page": "List of Newport County A.F.C. players", "response": ["*  Gethin Jones"]}, {"page": "Gethin Jones (footballer, born 1995)", "response": ["On 4 August 2020, Jones signed for Bolton Wanderers on a one year contract with the option of another year's extension. His debut came on 5 September in Bolton's first match of the season, a 1–2 home defeat against Bradford in the first round of the EFL Cup.BWFC.co.uk: \"Report: Bolton Wanderers 1-2 Bradford City\" On 5 December 2020 he scored the first goal of his professional career when he scored Bolton's first goal in a 3–6 defeat against Port Vale.BBC Sport: \"Bolton Wanderers 3–6 Port Vale On 8 May 2021, it was revealed Bolton had activated the extension in his contract.The Bolton News: \"Ex-Everton man sticking with Bolton as Ian Evatt reveals contract clause\" On 25 May, Jones revealed he had signed a new two-year contractThe Bolton News: \"Bolton Wanderers' Gethin Jones reveals contract surprise from manager Ian Evatt\" and on 5 November, he signed a one-year contract extension extending it to 2024.BWFC: \"New Deals For Key Quartet\"", "In 2021, Jones's mother was diagnosed with Motor Neurone Disease. On 23 September, Bolton Wanderers (Jones' team at the time) announced the first team would play a friendly against a team consisting of legendary Bolton players on 13 November to help raise money for his Mother's recovery. A quarter of the money raised would also go to former Bolton player Stephen Darby's charity Darby Rimmer MND Foundation, as he had also suffered from Motor Neurone Disease which had forced him to retire.\"Bolton Wanderers to play All-Star game for ex-Everton star Gethin Jones family\"\"Wanderers 7 All Stars 4\"", "*EFL League Two third-place (promotion): 2020–21Soccerbase: League Two 2020/21 TableSoccerbase: Games played by Gethin Jones in 2020/2021"]}, {"page": "Gethin Jones (footballer)", "response": ["#REDIRECT Gethin Jones (footballer, born 1981)"]}]}}