{"wiki_id": "http://www.wikidata.org/entity/Q5553354", "itemLabel": "Gertrude M. Godden", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Gertrude_M._Godden", "wikipedia_page": {"main": "Gertrude M. Godden (1867–1947) was an author of works on anthropology and folklore.\nGertrude Mary Godden was born in Surbiton, Surrey. Born in a catholic family she took a special interest in the rise of Soviet Russia. One of her correspondents was a Father Ledit.  Godden is listed as a fellow of the Anthropological Institute. Amongst her works are papers in the journal Folk-Lore, a manuscript on the Naga and other peoples of Northeast India, and a memoir of Henry Fielding. She also wrote on Mussolini.A namesake, Gertrude M. Godden O.B.E., was president (1956–58) of the Royal College of Nursing in London.", "link_mentions": [{"page": "Godden", "response": ["*Gertrude M. Godden, author of works on anthropology and folklore"]}, {"page": "Piotr Szarek", "response": ["Cardinal August Józef Hlond, the wartime primate of Poland, notified Pope Pius XII of the Nazi war crime (in a personal meeting held at the Vatican on 20 September 1939),\"Polish Primate in Rome: Cardinal Hlond is Scheduled to Report to Pope Today\", The New York Times, 20 September 1939, p. 21. highlighting in particular the tortures meted out to Szarek:[His] eye-glasses had first been knocked into his face by the Germans and his nose broken by blows from the butts of their guns; his jaw was broken, his eyes knocked out, his collar-bone broken, and at last he was killed.August Hlond, The Persecution of the Catholic Church in German-occupied Poland: Reports presented by H. E. Cardinal Hlond, Primate of Poland, to Pope Pius XII, Vatican Broadcasts, and Other Reliable Evidence, New York, Longmans, Green & Co., 1941, p. 107. Independently, the Government of the Republic of Poland in Exile presented the details of the crime to the international community in the so-called The Black Book of Poland where it is noted that Szarek in particular had \"suffered cruelly\" (\"His nasal bone was fractured, his spectacles broken and his eyes put out, as it seems; his jawbone broken and hanging, and one arm broken\").Poland, Ministry of Information, The Black Book of Poland, New York, G.P. Putnam’s Sons, 1942, pp. 25 & 342. The year after his murder, the details of Szarek's death appeared in a book written by the British author Gertrude M. Godden and prefaced by Cardinal Arthur Hinsley, the Archbishop of Westminster, who opined thatthe death of Father Szarek, news of which came during the third week in January [sc. 1940], should be made known in all civilised countries as (...) [an example] of Nazi rule.G. M. Godden, Poland: Yesterday, To-day, To-morrow, by G. M. Godden... With a Foreword by His Eminence Cardinal Hinsley, Archbishop of Westminster..., London, Burns & Oates, 1940, p. ix."]}, {"page": "List of women anthropologists", "response": ["| Gertrude M. Godden"]}]}}