{"wiki_id": "http://www.wikidata.org/entity/Q555621", "itemLabel": "John Arden", "itemDescription": "English playwright (1930-2012)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Arden", "wikipedia_page": {"main": "John Arden (26 October 1930 – 28 March 2012) was an English  playwright who at his death was lauded as \"one of the most significant British playwrights of the late 1950s and early 60s\".", "link_mentions": [{"page": "Bertrand Russell", "response": ["According to historian Peter Knight, after JFK's assassination, Russell, \"prompted by the emerging work of the lawyer Mark Lane in the US ... rallied support from other noteworthy and left-leaning compatriots to form a Who Killed Kennedy Committee in June 1964, members of which included Michael Foot MP, Caroline Benn, the publisher Victor Gollancz, the writers John Arden and J. B. Priestley, and the Oxford history professor Hugh Trevor-Roper.\" Russell published a highly critical article weeks before the Warren Commission Report was published, setting forth 16 Questions on the Assassination and equating the Oswald case with the Dreyfus affair of late 19th-century France, in which the state wrongly convicted an innocent man. Russell also criticised the American press for failing to heed any voices critical of the official version.Peter Knight, The Kennedy Assassination, Edinburgh University Press Ltd., 2007, p. 77."]}, {"page": "Lindsay Anderson", "response": ["* Serjeant Musgrave's Dance (John Arden, 1959)"]}, {"page": "March 28", "response": ["*2012 – John Arden, English author and playwright (b. 1930)"]}, {"page": "Laurence Olivier", "response": ["In 1961 Olivier accepted the directorship of a new theatrical venture, the Chichester Festival. For the opening season in 1962 he directed two neglected 17th-century English plays, John Fletcher's 1638 comedy The Chances and John Ford's 1633 tragedy The Broken Heart, followed by Uncle Vanya. The company he recruited was forty strong and included Thorndike, Casson, Redgrave, Athene Seyler, John Neville and Plowright. The first two plays were politely received; the Chekhov production attracted rapturous notices. The Times commented, \"It is doubtful if the Moscow Arts Theatre itself could improve on this production.\" The second Chichester season the following year consisted of a revival of Uncle Vanya and two new productions—Shaw's Saint Joan and John Arden's The Workhouse Donkey. In 1963 Olivier received another BAFTA nomination for his leading role as a schoolteacher accused of sexually molesting a student in the film Term of Trial."]}, {"page": "List of winners and shortlisted authors of the Booker Prize", "response": ["|John Arden || Silence Among the Weapons || Methuen"]}, {"page": "Tragicomedy", "response": ["Criticism that developed after the Renaissance stressed the thematic and formal aspects of tragicomedy, rather than plot. Gotthold Ephraim Lessing defined it as a mixture of emotions in which \"seriousness stimulates laughter, and pain pleasure.\"  Tragicomedy's affinity with satire and \"dark\" comedy have suggested a tragicomic impulse in modern theatre with Luigi Pirandello who influenced many playwrights including Samuel Beckett and Tom Stoppard.  Also it can be seen in absurdist drama. Friedrich Dürrenmatt, the Swiss dramatist, suggested that tragicomedy was the inevitable genre for the twentieth century; he describes his play The Visit (1956) as a tragicomedy.  Tragicomedy is a common genre in post-World War II British theatre, with authors as varied as Samuel Beckett, Tom Stoppard, John Arden, Alan Ayckbourn and Harold Pinter writing in this genre. Vladimir Nabokov's postmodern fiction Pale Fire is a tragicomedy preoccupied with Elizabethan drama"]}, {"page": "John Bale", "response": ["He is the central figure in the 1988 novel Books of Bale by the novelist and playwright John Arden."]}, {"page": "Angry young men", "response": ["*John Arden"]}, {"page": "James Connolly", "response": ["a 12-hour play on the life and politics of James Connolly written by John Arden and Margaretta D'Arcy. It was sometimes presented as a daily series and complete script reading, as in London in 1976 at the Almost Free Theatre Soho."]}, {"page": "Stephen Rea", "response": ["| John Arden"]}, {"page": "1959 in literature", "response": ["*John Arden – Serjeant Musgrave's Dance"]}, {"page": "David Lyndsay", "response": ["Lindsay of the Mount is a major character in John Arden's play Armstrong's Last Goodnight set in 16th Century Scotland."]}, {"page": "Jude Law", "response": ["| John Arden"]}, {"page": "Sebastian Shaw (actor)", "response": ["In 1965, British theatre director William Gaskill was named artistic director of the Royal Court Theatre, where he hoped to re-establish a repertoire. He approached Shaw, who had made his acting début at the Royal Court Theatre as a youth, and Shaw agreed to return. There he delivered several performances over the next year, including General Conrad von Hotzendorf in John Osborne's A Patriot for Me; various roles in Ann Jellicoe's Shelley; Sir Francis Harker in N.F. Simpson's The Cresta Run and Pte Atterclife in John Arden's Serjeant Musgrave's Dance."]}, {"page": "List of British playwrights since 1950", "response": ["*John Arden"]}, {"page": "List of British playwrights", "response": ["*John Arden"]}, {"page": "David Soul", "response": ["Soul began performing on stage as an actor in the mid-1960s, when he became a founding member of the Firehouse Theater in Minneapolis. He traveled with the company to New York City in 1965, appearing in Bertolt Brecht’s Baal and John Arden’s Sergeant Musgrave's Dance.Adams, Jan Thatcher. Football Wife; Coming of age with the NFL as Mrs. Karl Kassulke. Franklin Green Publishing. (2011)  P. 161 Soul first gained national attention as the \"Covered Man\" appearing on The Merv Griffin Show in 1966 and 1967, on which he sang while wearing a mask. He explained: \"My name is David Soul, and I want to be known for my music.\" The same year, he made his television debut in Flipper. In 1967, he signed a contract with Columbia Pictures and following a number of guest appearances, including the episode \"The Apple\" from the second season of Star Trek, he landed the role of Joshua Bolt on the television program Here Come the Brides with co-stars Robert Brown, Bobby Sherman and Bridget Hanley. The series was telecast on the ABC network from September 25, 1968, to September 18, 1970.Brooks, Tim & Marsh, Earle, The Complete Directory to Prime Time Network TV Shows, Ballantine Books, 1979 In 1972 he co-starred as Arthur Hill's law partner on Owen Marshall: Counselor at Law. Following numerous guest-starring roles on TV, including Streets of San Francisco, he was cast by Clint Eastwood in the film Magnum Force."]}, {"page": "Theatre 625", "response": ["| (play Götz von Berlichingen); John Arden (adaptation)"]}, {"page": "1971 in Ireland", "response": ["* Playwrights John Arden and Margaretta D'Arcy settled in County Galway."]}, {"page": "Edinburgh College of Art", "response": ["* John Arden, playwright"]}, {"page": "Committee of 100 (United Kingdom)", "response": ["*John Arden"]}, {"page": "Evening Standard Theatre Awards", "response": ["* 1959 – John Arden for Serjeant Musgrave's Dance and Arnold Wesker for Roots"]}, {"page": "Fiction set in ancient Greece", "response": ["* John Arden, Cogs Tyrannic (1991) "]}]}}