{"wiki_id": "http://www.wikidata.org/entity/Q5553015", "itemLabel": "Gerry Robinson", "itemDescription": "Irish-born British businessman and television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Gerry_Robinson", "wikipedia_page": {"main": "Sir Gerrard Jude Robinson (23 October 1948 – 14 October 2021) was an Irish-born British business executive and television presenter. He was non-executive chairman of Allied Domecq and chairman/chief executive of Granada.", "link_mentions": [{"page": "October 23", "response": ["*  1948   – Gerry Robinson, Irish-born British businessman, arts patron and television personality"]}, {"page": "1948", "response": ["* October 23 – Sir Gerry Robinson, Irish-born British businessman"]}, {"page": "Ali G", "response": ["Other examples of his bold interviewing style include getting Lindsay Urwin, the Bishop of Horsham, to admit that God created the universe and then asking him, \"And since then, [God]'s just chilled?\" Ali G asked the Bishop about God's appearance, to which the Bishop replied, \"Well, he's sort of Jesus-shaped.\" During an interview with James Ferman, former director of the British Board of Film Classification, Ali G asks whether his made-up vulgarities would restrict a film to an over-18 audience, and suggests that film censorship be performed by younger persons who understand contemporary slang. In an interview with the chairman of the Arts Council of England, Gerry Robinson, Ali G's first question was, \"Why is the arts so – excuse me French, but – crap?\""]}, {"page": "ITV Granada", "response": ["David Plowright, who had worked at Granada since 1957, resigned in 1992, citing the arrival of Gerry Robinson, who had tightened departmental budgets with an uncompromising business approach. Plowright had been the company's driving force, producing programmes such as World in Action and Coronation Street, and promoting the Granada Studios Tour. His departure angered well-known media-industry figures; John Cleese sent Robinson a fax using 'vitriolic language' that called him an 'upstart caterer' (a reference to his past employment). John Birt, Harold Pinter and Alan Bennett all supported Plowright for his quality programming."]}, {"page": "Granada plc", "response": ["Aside from media, Granada's other main strength was in the catering business. It opened its first motorway service area in 1964, and established a chain of service areas across the British motorway network. Granada was the first British service station operator to move away from fancy dining and instead offer a basic but quicker service. Soon, all the other operators took on this idea. Granada's hospitality arm was at its strongest in the 1990s under Gerry Robinson's chairmanship of the group. At one time the company owned and operated 75% of the motorway service areas. It expanded into other areas of catering, including most notably the acquisition in 1996 of Forte Group.Granada buys maximum stake This included rival operator Welcome Break (later sold due to regulations), roadside chains Little Chef and Happy Eater, and Forte's hotels (including Travelodge and Le Méridien)."]}, {"page": "London Weekend Television", "response": ["From 1993, LWT's low bid made it attractive to others wishing to take it over. Originally, Greg Dyke had planned to use LWT as a springboard to start acquiring companies to build a united ITV. On 6 December 1993, the north-west England franchise-holder Granada Television launched a hostile takeover for the company, worth £600 million. The takeover bid came about owing to the relaxation of the rules governing the ITV network. LWT tried to outstep the takeover bid with talks being held with Yorkshire Television and Scottish Television.Martin Waller, \"Granada set to launch bid for LWT\", The Times, 6 December 1993, p.36 A week later a conflict of words had broken out between LWT and Granada, with Granada claiming the YTV-LWT deal was \"Something cobbled together by desperate men\". Gerry Robinson, the Chairman of Granada plc, was also surprised if LWT went ahead with a bid for YTV, especially since it had made £10 million losses that week and was already paying much of its revenue to the government. Reports also suggested if LWT bid for Yorkshire Television it would also form an alliance with Anglia who would takeover Tyne Tees Television.Carl Mostished \"Granada hits out at LWT triple alliance\", The Times, 13 December 1993, p.36 By New Year's Eve, Granada had increased its bid to £658 million.Martin Waller, \"Granada extends LWT bid\", The Times, 30 December 1993, p.23", "By 7 January 1994, the merger talks between Yorkshire-Tyne Tees Television had collapsed because it had proved impossible to reach an agreement on a suitable structure for the new company. A few days earlier Anglia had withdrawn from the proposed alliance, making an LWT takeover of YTV impossible.Susan Gilchrist, \"Collapse of merger talks puts LWT under pressure\", The Times, 7 January 1994, p.23 By 7 February 1994, Granada had increase its takeover bid again to £774 million, but the LWT board once again rejected the offer. Granada's Chief Executive, Gerry Robinson, said: \"We are obviously disappointed that having evidently accepted the commercial argument in favour of scale, the board of LWT has not been able to recommend what is a generous offer.\" Sir Christopher Bland rejected this statement, claiming \"the Granada offer is inadequate and still fails to reflect the true value of LWT\".Martin Waller, \"LWT rejects Granada's final bid after talks fail\", The Times, 9 February 1994, p.27 On Friday 25 February 1994, LWT had succumbed to Granada's £770 million bid for the company. This resulted in Greg Dyke and Sir Christopher Bland leaving LWT.Martin Waller, \"LWT succumbs to £770 million Granada takeover bid\", The Times 26 February 1994, p.21"]}, {"page": "Arts Council England", "response": ["In 2001 Chairman Gerry Robinson announced a further restructuring in which the Arts Council of England would be merged with the ten regional arts boards to form a single organisation: Arts Council England."]}, {"page": "Dunfanaghy", "response": ["* Sir Gerry Robinson, businessman"]}, {"page": "1948 in Ireland", "response": ["*23 October – Gerry Robinson, businessman and television presenter."]}, {"page": "Raphoe", "response": ["Sir Gerry Robinson is an Irish businessman and television personality currently living in Raphoe. He is the former non-executive chairman of Allied Domecq and the ex-chairman/chief executive of Granada. He owns an estate on the outskirts of Raphoe named Oakfield Park (often known locally as Stoney's Estate), which contains a Georgian country house and a botanical garden with a  gauge railway, the Difflin Lake Railway.  The gardens and railway are open to the public.", "* Sir Gerry Robinson, former non-executive chairman of Allied Domecq and the ex-Chairman/Chief Executive of Granada."]}, {"page": "The Panel (Irish TV series)", "response": ["| 7 January 2008 || Delamere || Murphy, Farrell, Whelan, Byrne || John Cooper Clarke, Gerry Robinson || Details"]}, {"page": "David Plowright", "response": ["Plowright rose to become Controller of Programmes from 1969 to 1979, and he succeeded Denis Forman first as managing director, and then Chairman of Granada Television in 1987. The outlook of Granada TV, under the leadership of Foreman and Plowright was described as \"non-conformist, alternative, non-London\". He easily steered Granada through 1991 ITV franchise auctions by threatening to sell Coronation Street, Granada's signature show and one of the channel's biggest assets, to satellite television if their bid was rejected. Plowright was forced out in 1992 by Gerry Robinson, the new chief executive, which led to John Cleese describing Robinson as an \"upstart caterer\". Plowright's exit was regarded as a turning point in the process whereby ITV gave profits a bigger priority than programme quality."]}, {"page": "List of Donegal people", "response": ["*Sir Gerry Robinson, businessman and former head of Granada Television"]}, {"page": "Great Lives", "response": ["|Gerry Robinson, businessman"]}, {"page": "Rocco Forte", "response": ["Forte took over from his father as CEO of the Forte Group in 1992. In the mid-1990s, the Forte Group was faced with a hostile takeover bid from Gerry Robinson's Granada. Ultimately, Granada succeeded with a £3.87 billion tender offer in August 1995 that left the family with around £350 million in cash."]}, {"page": "Can Gerry Robinson Fix the NHS?", "response": ["Can Gerry Robinson Fix the NHS? is a three-part Open University BBC series shown on BBC2 from the 8th to 10 January 2007. This is the second BBC series where Gerry Robinson works to turn around failing companies, but whereas his earlier series I'll Show Them Who's Boss had a commercial focus, this one deals with the public sector."]}, {"page": "William Kay (journalist)", "response": ["* 1999:  Lord of the Dance, the story of Sir Gerry Robinson.  Orion. ."]}, {"page": "Castle Head, Grange-over-Sands", "response": ["The house went on to serve as St Mary’s Missionary College, a seminary owned by the Holy Ghost Fathers, from the early 20th century until it closed in the early 1970s. Students who trained there included, briefly, Sir Gerry Robinson, the industrialist."]}, {"page": "Robinson (name)", "response": ["*Sir Gerry Robinson (born 1948), Irish-born British businessman"]}, {"page": "1997 in British television", "response": ["* 19 June – Media agencies reject Granada Group chairman Gerry Robinson's call for the formation of a single ITV company, expressing concerns it would be extremely damaging to advertisers."]}, {"page": "1993 in British television", "response": ["*13 December – The Times reports that a conflict of words has broken out between London Weekend Television and Granada over LWT's talks with Yorkshire Television. Granada claims the YTV-LWT deal is \"something cobbled together by desperate men\". Gerry Robinson, the Chairman of Granada plc, is dismissive of the deal, especially since Yorkshire has made £10 million loss and is already paying much of its revenue to the government. Reports also suggest if LWT bid for Yorkshire Television it would also form an alliance with Anglia who would takeover Tyne Tees Television.Carl Mostished \"Granada hits out at LWT triple alliance\", The Times, 13 December 1993, p.36 "]}, {"page": "List of Question Time episodes", "response": ["|Donald Dewar, Michael Heseltine, Gerry Robinson, Shirley Williams"]}, {"page": "Global Irish Economic Forum", "response": ["* Gerry Robinson, former chairman of Allied Domecq and former chairperson and CEO of Granada"]}, {"page": "Troubleshooter (TV series)", "response": ["The series was revived a decade later in 2004 under the stewardship of Gerry Robinson, under the title I'll Show Them Who's Boss!'", "Trying to revive the series in light of the rise of reality television, in 2004 the BBC engaged former Allied-Domecq CEO Gerry Robinson. In deference to Harvey-Jones, Robinson insisted that the show be given a different name, which was agreed on as  I'll Show Them Who's Boss. Now co-produced by the Open University. The concept was that he'd go into struggling businesses and try to turn them round through advice and mentoring."]}, {"page": "List of Desert Island Discs episodes (1991–2000)", "response": ["|||Gerry Robinson||The History of the World by John Roberts||Painting kit (easel, oils, brushes)|| more"]}, {"page": "Deele College", "response": ["One of the highlights for Deele College in recent years came in November 2002, when Her Excellency Mary McAleese, President of Ireland, visited the school. Other such visitors to the school have included Nobel Prize–winning politician John Hume and former head of Coca-Cola and television personality Sir Gerry Robinson . Students who have attended the school have gone on to many in third level institutions all across the Republic of Ireland and the United Kingdom in recent years. "]}, {"page": "Gerrard Jude Robinson", "response": ["#REDIRECTGerry Robinson"]}, {"page": "Sir Gerrard Jude Robinson", "response": ["#REDIRECTGerry Robinson"]}, {"page": "October 1948", "response": ["*Born: Gerry Robinson, business executive and television presenter, in Dunfanaghy, Ireland"]}, {"page": "Jane Leighton", "response": ["Leighton returned to Granada to 1990 as head of public affairs. She helped the company retain its franchise after a rival bid was made from a consortium led by Mersey Television but resigned in 1992 after the chairman David Plowright was ousted by Gerry Robinson. Leighton embarked on a portfolio career which saw her become the industrial relations consultant for the Liverpool Housing Action Trust (1992–1996), chaired Salford's NHS mental health trust between 1993 and 1995, she was a member of the Broadcasting Complaints Commission of which she chaired from 1996 to 1997 having been a member for three years prior and served as deputy chair of its successor, the Broadcasting Standards Commission between 1997 and 2001. Leighton also served as chair of the Tate Britain's organisational development which saw her install a new organisational system which prevented staff from being alienated."]}, {"page": "2021 in British television", "response": ["|Sir Gerry Robinson", "|Television presenter (Can Gerry Robinson Fix the NHS?)"]}, {"page": "2021 in the United Kingdom", "response": ["*14 October – Sir Gerry Robinson, Irish-born television presenter (Can Gerry Robinson Fix the NHS?) and executive, chair of Arts Council England (1998–2004)."]}, {"page": "Deaths in October 2021", "response": ["*Sir Gerry Robinson, 72, Irish-born British television presenter (Can Gerry Robinson Fix the NHS?) and executive, chair of Arts Council England (1998–2004).Businessman and TV presenter Sir Gerry Robinson dies aged 72"]}, {"page": "2021 in Ireland", "response": ["* 14 October – Gerry Robinson, 72, businessman and television executive.Businessman and TV presenter Sir Gerry Robinson dies aged 72 Irish Times, 2021-10-14"]}, {"page": "Oakfield Demesne", "response": ["Oakfield Demesne is a house, grounds and townland in County Donegal, Ireland, originally built in 1739 for the Dean of Raphoe. Since 1996 it has been owned by Sir Gerry Robinson and his wife, Lady Heather Robinson. The demesne includes the 100-acre Oakfield Park gardens, open to the public  which includes the  narrow-gauge railway Difflin Lake Railway."]}]}}