{"wiki_id": "http://www.wikidata.org/entity/Q55584635", "itemLabel": "Ian McAteer", "itemDescription": "Scottish gangster", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_McAteer", "wikipedia_page": {"main": "Ian Douglas McAteer (born November 1961) is a Scottish former gangster who was a prominent figure in the Glasgow and Liverpool criminal underworlds during the later 20th century. McAteer accumulated various convictions, and in 2001 was sentenced to life for the 1999 murder of a gangland associate: he had been acquitted of a previous murder charge in 1998. McAteer was a suspect in other crimes, including the 1999 murder of television presenter Jill Dando.", "link_mentions": [{"page": "List of Scots", "response": ["* Ian McAteer (born 1961), Glasgow gangster"]}, {"page": "Maryhill", "response": ["* Ian McAteer, Dalmuir-born former gangster"]}, {"page": "Clydebank", "response": ["*Ian McAteer, Dalmuir-born former gangster"]}, {"page": "List of gangsters by city", "response": ["* Ian McAteer"]}, {"page": "Easterhouse", "response": ["*Ian McAteer, former gangster"]}, {"page": "Dalmuir", "response": ["*Ian McAteer (born 1961), former gangster"]}, {"page": "Ian", "response": ["*Ian McAteer (born 1961), former gangster from Glasgow"]}, {"page": "HM Prison Long Lartin", "response": ["* Ian McAteer"]}, {"page": "Paul Ferris (Scottish writer)", "response": ["Paul Ferris was born on 10 November 1963 in the Blackhill district of Glasgow to a Protestant father and a Catholic mother, and was raised as a Catholic. Ferris was the youngest of six children, with one older brother Billy and four sisters Carol, Cath, Janet and Maureen. Ferris was bullied for several years by members of a local criminal family, the Welshes, which is thought to have resulted in him developing the skin disorder psoriasis. He has known Glasgow gangland figure Ian McAteer since childhood."]}, {"page": "List of people from Leicester and Leicestershire", "response": ["*Ian McAteer, Scottish-born former gangster"]}, {"page": "McAteer", "response": ["*Ian McAteer (born 1961), former gangster from Glasgow"]}, {"page": "Gangs in Liverpool", "response": ["A report in the Observer newspaper written by journalist Peter Beaumont entitled Gangsters put Liverpool top of gun league (28 May 1995), noted that turf wars had erupted within Liverpool. The high levels of violence in the city came to a head in 1996 when, following the shooting of gangster David Ungi, six shootings occurred in seven days, prompting Merseyside Police to become one of the first police forces in the country to openly carry weapons in the fight against gun crime. Official Home Office statistics revealed a total of 3,387 offences involving firearms had occurred in the Merseyside region during a four-year period between 1997 and 2001. www.criminal-information-agency.com It was revealed that Liverpool was the main centre for organised crime in the North of England.icLiverpool – Liverpool revealed as centre for organised crime in North In 1999, a prominent \"turf war killing\" occurred when Warren Selkirk was shot five times and a bag of dog excrement placed in his hand, while his children waited in a nearby car: Glaswegian Ian McAteer was convicted of the murder in 2001."]}, {"page": "List of unsolved murders in the United Kingdom (1990s)", "response": ["| 28 February 1998 || John Bennett || Glasgow || John Bennett, aged 26, was beaten and stabbed multiple times on Glasgow's Royston Road in an apparently \"motiveless\" killing. The attack occurred in broad daylight, in front of shoppers. Three men, including Glasgow gangster Ian McAteer, stood trial but were acquitted of the murder."]}]}}