{"wiki_id": "http://www.wikidata.org/entity/Q5552643", "itemLabel": "Gerry Badger", "itemDescription": "English writer, curator and photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Gerry_Badger", "wikipedia_page": {"main": "Gerald David \"Gerry\" Badger (born 1946) is an English writer and curator of photography, and a photographer.In 2018 he received the J Dudley Johnston Award from the Royal Photographic Society.", "link_mentions": [{"page": "Jacob Riis", "response": ["Riis had already been thinking of writing a book and began writing it during nights. (Days were for reporting for the New York Sun, evenings for public speaking.) How the Other Half Lives, subtitled \"Studies Among the Tenements of New York\", was published in 1890. The book reused the eighteen line drawings that had appeared in the Scribner's article and also seventeen reproductions using the halftone method,Alland, p. 30. and thus \"[representing] the first extensive use of halftone photographic reproductions in a book\".Martin Parr and Gerry Badger, The Photobook: A History vol. 1 (London: Phaidon, 2004; ), 53. (The magazine Sun and Shade had done the same for a year or so beginning 1888.)"]}, {"page": "List of photographers", "response": ["* Gerry Badger (born 1948)"]}, {"page": "Kentish Town", "response": ["* Gerry Badger, photographer"]}, {"page": "Martin Parr", "response": ["Although John Bulmer had pioneered colour documentary photography of Britain, from 1965, Gerry Badger has said of The Last Resort:", "Parr is a collector and critic of photobooks.Imagine (TV series), Season 2, Episode 4, The World According to Parr, 3 December 2003 His collaboration with the critic Gerry Badger, The Photobook: A History (in three volumes) covers more than 1,000 examples of photobooks from the 19th century through to the present day. The first two volumes took eight years to complete. Tate Modern's retrospective exhibition of Daido Moriyama in London included many Moriyama books loaned from Parr displayed in vitrines."]}, {"page": "Diane Arbus", "response": ["Doon Arbus and Marvin Israel edited and designed a 1972 book, Diane Arbus: an Aperture Monograph, published by Aperture and accompanying the Museum of Modern Art's exhibition. It contained eighty of Arbus' photographs, as well as texts from classes that she gave in 1971, some of her writings, and interviews,Parr, Martin, and Gerry Badger. The Photobook: a History. Volume I. London & New York: Phaidon, 2004. ."]}, {"page": "Daidō Moriyama", "response": ["Farewell, Photography (Sashin yo Sayonara) is included in Andrew Roth's The Book of 101 Books: Seminal Photographic Books of the Twentieth Century, Martin Parr and Gerry Badger's The Photobook: A History, Volume I and the Hasselblad Center's The Open Book."]}, {"page": "International Center of Photography", "response": ["* Writing: Gerry Badger"]}, {"page": "Tulsa (book)", "response": ["Criticism of Tulsa has not been limited to a visceral rejection of images of drugtaking, casual sex, and gunplay; Martin Parr and Gerry Badger say that the \"incessant focus [of Tulsa and Clark's 1983 book Teenage Lust]  on the sleazy aspect of the lives portrayed, to the exclusion of almost anything else — whether photographed from the 'inside' or not — raises concerns about exploitation and drawing the viewer into a prurient, voyeuristic relationship with the work.\"", "*Parr, Martin, and Gerry Badger. The Photobook: A History. Vol. 1. London: Phaidon, 2004. ."]}, {"page": "Izis Bidermanas", "response": ["Meanwhile, his books continued to be popular with the public.  Among the numerous books by Izis, Gerry Badger and Martin Parr have especial praise for Le Cirque d'Izis (The Circus of Izis), \"published in 1965, but bearing the stamp of an earlier era\".Martin Parr and Gerry Badger, The Photobook: A History, vol. 1 (London: Phaidon, 2004; ), p. 222.  Shot mostly in Paris but also in Lyon, Marseille and Toulon, the photographs are \"affectionate and nostalgic, but also deeply melancholic\" with \"a desolate undercurrent\", forming a work that is \"profound, moving and extraordinary\"."]}, {"page": "Lynemouth", "response": ["Lynemouth and the surrounding industrial area featured in the 1985 docudrama Seacoal about the seacoalers who made a living from collecting waste coal from the beach. A series of photographs in the Henri Cartier-Bresson Award–winning\"Chris Killip: Skinningrove: A film by Michael Almereyda\", New York Review of Books, 22 July 2014. Accessed 27 November 2014. book In Flagrante (1988) by Chris Killip shows the work and life of the seacoalers;Gerry Badger, Chris Killip (London: Phaidon, 2001; ), pp. 72–89. more were published in 2011 in the book Seacoal.Chris Killip, Seacoal (Göttingen: Steidl, 2011; )."]}, {"page": "Photo-book", "response": ["* Parr, Martin, and Gerry Badger. The Photobook: A History. London: Phaidon. Vol 2. "]}, {"page": "Malick Sidibé", "response": ["*Everything was Moving: Photography from the 60s and 70s. London: Barbican Art Gallery, 2012. . Edited by Kate Bush and Gerry Badger. With texts by Bush (\"Everything was moving\"), Badger (\"Spirit of the times, spirit of place: a view of photography in the 1960s and 1970s\"), Gavin Jantjes (\"Ernest Cole\"), Sean O'Hagan (\"The unreal everyday: William Eggleston's America\" and \"Against detachment: Bruce Davidson's photographs of America during the Civil Rights Era\"), Tanya Barson (\"Graciela Iturbide: a matter of complicity\"), T.J. Demos (\"On Sigmar Polke's Der Bärenkampf\"), Helen Petrovsky (\"Boris Mikhailov: towards a new universality\"), Boris Mikhailov (\"Yesterday's sandwich\"), Ian Jeffrey (\"Shomei Tomatsu\"), Julian Stallabrass (\"Rather a hawk?: the photography of Larry Burrows\"), Robert Pledge (\"Li Zhensheng: the cinematographer behind the photographer\"), Manthia Diawara (\"The sixties in Bamako: Malick Sidibé and James Brown\"), Shanay Jhaveri (\"Raghubir Singh and the geographical culture of India\"), and Raghubir Singh (\"River of colour: an Indian view\"). Photographs by Sidibé, David Goldblatt, Ernest Cole, William Eggleston, Bruce Davidson, Graciela Iturbide, Sigmar Polke, Boris Mikhailov, Shomei Tomatsu, Larry Burrows, Li Zhensheng, and Raghubir Singh. Published on the occasion of the exhibition Everything was Moving: Photography from the 60s and 70s, curated by Kate Bush, September 2012-January 2013 at  Barbican Art Gallery, Barbican Centre, London."]}, {"page": "Ihei Kimura", "response": ["*Parr, Martin, and Gerry Badger. The Photobook: A History. Vol. 1. London: Phaidon, 2004. ."]}, {"page": "Sarah Kent", "response": ["*Author: Gerry Badger, John Benton-Harris. Through the Looking Glass. Barbican, London, 1989,  Sarah Kent: Taking Issue: Artists as Photographers"]}, {"page": "John Gossage", "response": ["**New york: Aperture, 2010. . With a preface by Toby Jurovics and an essay by Gerry Badger.", "*One Day: 10 Photographers. Heidelberg: Kehrer, 2011. . A boxed set of ten books of photographs taken on 21 June 2010. Edited by Harvey Benge, each book by one of Gossage, Alec Soth, Jessica Backhaus, Gerry Badger, Benge, Todd Hido, Rob Hornstra, Rinko Kawauchi, Eva Maria Ocherbauer and Martin Parr."]}, {"page": "Richard Misrach", "response": ["Misrach's use of the term \"canto\" was inspired in part by the cantos of Ezra Pound; in a 1989 article in Creative Camera, Gerry Badger elaborates:"]}, {"page": "Alec Soth", "response": ["* One Day: 10 Photographers. Heidelberg: Kehrer, 2011. . A boxed set of ten books of photographs taken on 21 June 2010. Edited by Harvey Benge. The other books are by Jessica Backhaus, Gerry Badger, Benge, John Gossage, Todd Hido, Rob Hornstra, Rinko Kawauchi, Eva Maria Ocherbauer and Martin Parr."]}, {"page": "Yutaka Takanashi", "response": ["*Yutaka Takanashi: Toshi-e. Books on Books 6. Errata Editions, 2010. .  Reduced reproduction of the content of Toshi-e and Tōkyōjin. With text by Gōzō Yoshimasu and Gerry Badger."]}, {"page": "Christian Patterson", "response": ["In 2011, a Redheaded Peckerwood book was published by Mack and named one of the best photobooks of the year by many critics. The book was nominated for the 2012 Kraszna-Krausz Book Awards and won the 2012 Recontres d'Arles Author Book Award. It is introduced in The Photobook: A History, Vol. 3, edited by Gerry Badger and Martin Parr.", "* AP CP BL – Ahorn Paper 1, Christian Patterson, Bottom of the Lake. Berlin: Ahorn Books, 2016. . Contains two interviews with Patterson and contributions by Gerry Badger, Thomas Weski, and Lucy Sante. 144 pages."]}, {"page": "Roni Horn", "response": ["In 2004-2006, the books were selected as some of the most important photobooks in history.Roth, Andrew, editor. The Open Book: a History of the Photographic Book from 1878 to the Present. Göteborg, Sweden: Hasselblad Center, 2004.Parr, Martin, and Gerry Badger. The Photobook: a History. Volume II.  London & New York: Phaidon, 2006.  A 2009 journal article stated that the nine To Place books \"together constitute one of the most important groups of artists' books since Ed Ruscha's 1960s books and Bernd and Hilla Becher's publications on industrial architecture.\"Godfrey, Mark. \"Roni Horn's Icelandic Encyclopedia.\" Art History, volume 32, issue 5, December 2009, pages 932-953. Other publications include Dictionary of Water, This is Me, This is You, Cabinet of, If on a Winter's Night, Her, Her, Her, & Her, Wonderwater (Alice Offshore), and Index Cixous, 2003 – 05."]}, {"page": "Seiji Kurata", "response": ["*Parr, Martin, and Gerry Badger. The Photobook 1. London: Phaidon, 2004. ."]}, {"page": "Jim Goldberg", "response": ["A major mixed-media exhibition by Goldberg concerning at risk and homeless youth in California entitled Raised by Wolves began traveling in 1995 and was accompanied by a book of the same title.Richard, Paul. Finding beauty in desperation - at the Corcoran, Jim Goldberg's stirring photos of runaway children. Washington Post, 18 September 1995. A review of the exhibition at the Corcoran Gallery of Art noted that Goldberg made reference to other artists and photographers; used photographs, videos, objects, and texts to convey meaning; and \"let his viewers feel, in some corner of their psyches, the lure of abject lowliness, the siren call of pain.\" Although the accompanying book received one mixed review shortly after publication,Woodward, Richard B. Runaways. The New York Times, 15 October 1995. Accessed 30 January 2010. it was described as \"a heartbreaking novel with pictures\", and in The Photobook: A History, Martin Parr and Gerry Badger praised it as \"complex and thoughtful.\"Parr, Martin, and Gerry Badger. The photobook: a history. Volume II.  London & New York: Phaidon, 2006. Page 303. ."]}, {"page": "Donovan Wylie", "response": ["*Outposts: Kandahar Province. Göttingen: Steidl, 2011. . With an afterword by Gerry Badger."]}, {"page": "Mike Brodie", "response": ["A Period of Juvenile Prosperity was included in lists of best photobooks of 2013 by critic Sean O'Hagan in The Guardian, Clinton Cargill in The New York Times, Dazed, Mother Jones and American Photo magazine. Kenneth Baker, writing in the San Francisco Chronicle, listed the A Period of Juvenile Prosperity exhibition at Stephen Wirtz Gallery in his top 10 list for 2013. Vince Aletti in Artforum named Brodie's show in New York as the show of the year, and has said of Brodie's work: \"Even if you’re not intrigued by Brodie’s ragtag bohemian cohort—a band of outsiders with an unerring sense of post-punk style—the intimate size and warm, slightly faded color of his prints are seductive. His portraits . . . have a tender incisiveness that is rare at any age.\" Martin Parr and Gerry Badger call the photographs of  A Period of Juvenile Prosperity \"unashamedly romantic and warm toned\"."]}, {"page": "Chris Killip", "response": ["In 1977, Killip became a co-founder, exhibition curator, and advisor at the Side Gallery, Newcastle, and worked as its first director for 18 months. He produced a body of work from his photographs in the northeast of England, published in 1988 as In Flagrante with a text by Berger and Sylvia Grant. These black and white images, \"portraits of Tyneside's working class communities amongst the signifiers of the region's declining industrial landscape\", mostly made on 4×5 film, are now recognised as among the most important visual records of living in 1980s Britain. Gerry Badger describes the photographs as \"taken from a point of view that opposed everything [Thatcher] stood for\", and the book as \"about community\", \"a dark, pessimistic journey\".Martin Parr and Gerry Badger, The Photobook: A History, vol. 2 (London: Phaidon, 2006; ), 299.", "*Chris Killip 55. London: Phaidon, 2001. . Text by Gerry Badger.", "**Books on Books 4. New York: Errata Editions, 2009. . Reduced-size facsimile of the book of 1988, with an essay by Gerry Badger."]}, {"page": "Kikuji Kawada", "response": ["Kawada's book Chizu (The Map) has been praised by critics. Brett Rogers, director of The Photographers' Gallery, London, has said it is a \"deeply moving and highly original investigation into a seminal moment in Japanese history.\" In The Photobook: A History, Vol. 1, Martin Parr and Gerry Badger describe Chizu as being amongst four books that \"constitute photography's most significant memorials to the defining event in twentieth-century Japanese history\" and that it is \"the ultimate photobook-as-object, combining a typical Japanese attention to the art of refined packaging with hard-hitting photography, text and typography – a true photo-text piece. No photobook has been more successful in combining graphic design with complex photographic narrative.\" O'Hagan wrote in The Guardian that it is \"perhaps the most intricately designed and powerfully evocative Japanese photobook ever [ . . . ] By turns impressionistic and surreal, the book demands a degree of patient, silent contemplation that echoes the act of remembering.\""]}, {"page": "Masahisa Fukase", "response": ["In 2010, a panel of five experts (Gerry Badger, Ute Eskilden, Chris Killip, Jeffrey Ladd, and Yōko Sawada) convened by the British Journal of Photography selected Karasu as the best photobook of 1986–2009.Bainbridge, Simon. \"Ravens Tops All Photobooks in BJP Poll.\" British Journal of Photography, 5 May 2010. Wayback Machine copy accessed 9 May 2017."]}, {"page": "Eugene Richards", "response": ["His first book was Few Comforts or Surprises (1973), a depiction of rural poverty in Arkansas. His second book, the self-published Dorchester Days (1978), set in Dorchester, Massachusetts is \"an angry, bitter book\", both political and personal.Gerry Badger, in Martin Parr and Gerry Badger, The Photobook: A History, vol. 2 (London: Phaidon, 2006; ), 30. Gerry Badger writes that \"[Richards's] involvement with the people he is photographing is total, and he is one of the best of photojournalists in getting that across, often helped by his own prose\"."]}, {"page": "Kohei Yoshiyuki", "response": ["__notoc__ was a Japanese photographer who attracted much attention in 1979 with his exhibition \"Kōen\" (, Park) at the Komai Gallery, Tokyo. The black-and-white photographs were presented in a book published in 1980 that is \"nominally a soft-core voyeur's manual\",Parr and Badger, 297. with photographs of people in sexual activities in Shinjuku and Yoyogi parks (both in Tokyo), mostly with unknown spectators around them. The photographs were taken with a 35 millimetre camera and infrared flashbulbs. Gerry Badger and others have commented on how the photographs raise questions about the boundaries between spectator, voyeur and participant. ", "*Parr, Martin, and Gerry Badger. The Photobook: A History. Vol. 2. London: Phaidon, 2006. ."]}, {"page": "David Alan Harvey", "response": ["Harvey's first book, Tell It Like It Is, self-published in 1967, documented the lives of a black family living in Norfolk, Virginia. His two major books, Cuba and Divided Soul, are based on the Spanish cultural migration into the Americas, and Living Proof deals with hip-hop culture. Martin Parr and Gerry Badger say of Harvey's book (Based on a True Story) that it \"takes its place as one of the best of the more extravagantly designed photobooks at a time when extravagant design is making a comeback\"."]}, {"page": "Joan Fontcuberta", "response": ["Fontcuberta describes himself as \"self-taught in photography\" and considers himself \"a conceptual artist using photography.\" He states that the propaganda and dictatorship of Spain under Franco in his first 20 years led him to be skeptical about authority, which is reflected in his art. His background in communications and advertising led him to contemplate the relationship between photography and truth, and Fontcuberta believes that humor is an important component of his work. His art has been described as \"postmodern.\"Parr, Martin, and Gerry Badger. The Photobook, a History. Volume II.  London & New York: Phaidon, 2006.  ."]}, {"page": "Atomic bombings of Hiroshima and Nagasaki in popular culture", "response": ["In The Photobook: A History, Vol. 1, Martin Parr and Gerry Badger wrote \"These three books, along with Kikuji Kawada's 'symbolic reportage' in Chizu (The Map, 1965), constitute photography's most significant memorials to the defining event in twentieth-century Japanese history.\""]}, {"page": "Markéta Luskačová", "response": ["* Markéta Luskačová. Prague: Torst, 2001. .  Book with introductory texts by Marie Klimešová, Gerry Badger, and Josef Topol."]}, {"page": "John Blakemore", "response": ["* 1977 John Blakemore. British Image 3. London: Arts Council of Great Britain, 1977. Edited by Barry Lane, introduction by Gerry Badger. ."]}, {"page": "Julian Stallabrass", "response": ["*Everything was Moving: Photography from the 60s and 70s. London: Barbican Art Gallery, 2012. . Edited by Kate Bush and Gerry Badger. Stallabrass contributes an essay (\"Rather a hawk?: the photography of Larry Burrows\")."]}, {"page": "Trent Parke", "response": ["Martin Parr and Gerry Badger say that Parke's first book Dream/Life is \"as dynamic a set of street pictures as has been seen outside the United States or Japan\"."]}, {"page": "Jacob Aue Sobol", "response": ["*Veins. Stockport, Cheshire: Dewi Lewis, 2013. . With Anders Petersen. With a text by Gerry Badger."]}, {"page": "Keld Helmer-Petersen", "response": ["In the early 2000s, Helmer-Petersen was rediscovered when 122 Colour Photographs was presented in volume one of Martin Parr and Gerry Badger’s three-volume survey of the most notable photobooks: The Photobook: A History. In the wake of this rediscovery, there followed several exhibitions and a renewed international interest in his work. In 2007, Helmer-Petersen published an extensive retrospective monograph, which presents a broad sample of work from his lengthy career. ", "* Parr, Martin and Gerry Badger: The Photobook: A History, vol. I, Phaidon, London, 2004."]}, {"page": "Krass Clement", "response": ["* Parr, Martin, and Gerry Badger: “Krass Clement: Drum” in The Photobook – A History, volume II, London 2006"]}, {"page": "Creative Camera", "response": ["These changes in social politics took effect in the magazine by 1986, when Colin Osman resigned to make way for full revenue support by the Arts Council of Great Britain and the transfer of editorial decisions to a board of directors so that, while inclusive of traditionalists represented by Gerry Badger, Colin Osman and Peter Turner, perspectives introduced by members Ian Jeffrey, Jo Spence, Rebecca Solnit, Geoffrey Batchen and others in the 1990s brought Creative Camera's critical and intellectual content in line with more general art world publications."]}, {"page": "Peter Turner (writer and photographer)", "response": ["*Photo Texts. London: Travelling Light, 1988. . With Gerry Badger. Essays."]}]}}