{"wiki_id": "http://www.wikidata.org/entity/Q55671669", "itemLabel": "Elizabeth Emmet Lenox-Conyngham", "itemDescription": "Irish poet and translator", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Emmet_Lenox-Conyngham", "wikipedia_page": {"main": "Elizabeth Emmet Lenox-Conyngham also known as Mrs. George Lenox Conyngham (1800 – c. 1889) was an Irish poet and translator.", "link_mentions": [{"page": "List of Irish women writers", "response": ["*Elizabeth Emmet Lenox-Conyngham (1800–1889), poet"]}, {"page": "The Dream, and Other Poems", "response": ["The Dream, and Other Poems (1833) is a book of poems by Mrs George Lenox-Conyngham, also known as Elizabeth Emmet Lenox-Conyngham. It is her first known publication. Born Elizabeth Emmet, she was the only child of Robert Holmes (barrister) and Mary Anne Emmet."]}, {"page": "Mary Anne Holmes", "response": ["In 1793, a family friend William Drennan described her as genteel but distant. He predicted her match with the barrister Robert Holmes, who she secretly married on 21 September 1799 in the Dublin Unitarian Church. The couple had at least 4 children, with Drennan attending all the births. One of their children was Elizabeth Emmet Lenox-Conyngham. Robert Holmes attended to the Emmet family legal affairs for a time, with the couple living with her parents at Casino, near Milltown, Dublin. Holmes helped to raise the children of her brother Thomas Addis, after he was sent to Fort George, Highland, Scotland for his involvement with the United Irishmen. During this time, their mother's letters to Thomas Addis note Holmes' devotion to her husband but also her delicate health and tendency towards low spirits. Holmes was the only surviving child of their 17 children who was still in Ireland, she was a comfort to her parents in their old age. Her father died in 1802, and her mother almost died in 1803 at the same time as the arrest and execution of her brother Robert. Some claim that Holmes attempted to recover her brother's body but failed."]}, {"page": "List of women writers (A–L)", "response": ["*Elizabeth Emmet Lenox-Conyngham (1800 – c. 1889, Ireland), poet"]}]}}