{"wiki_id": "http://www.wikidata.org/entity/Q55616466", "itemLabel": "Lady Kitty Spencer", "itemDescription": "eldest child of Charles Spencer, 9th Earl Spencer", "wikipedia_url": "https://en.wikipedia.org/wiki/Lady_Kitty_Spencer", "wikipedia_page": {"main": "Lady Kitty Eleanor Spencer (born 28 December 1990) is a British model and aristocrat. She is the eldest child of Charles Spencer, 9th Earl Spencer, and a niece of Diana, Princess of Wales. Spencer is the spokesmodel for jewellery brand Bulgari and fashion company Dolce & Gabbana.", "link_mentions": [{"page": "Spencer family", "response": ["* Lady Kitty Spencer (born 1990), daughter of Charles Spencer, 9th Earl Spencer"]}, {"page": "Louis Spencer, Viscount Althorp", "response": ["English primogeniture law dictates that Lord Althorp, not his eldest sister, Lady Kitty Spencer, will inherit their father's title.   Property is divisable separately, but most peers choose to keep property and title combined."]}, {"page": "Centrepoint (charity)", "response": ["Its ambassadors include the Radio 1 DJ Sara Cox, the fashion model Lady Kitty Spencer, the actress Lisa Maxwell, and the journalist and presenter Kirsty Young."]}, {"page": "Regent's University London", "response": ["*Lady Kitty Spencer (English fashion model)"]}, {"page": "Storm Management", "response": ["* Lady Kitty Spencer"]}, {"page": "Reddam House", "response": ["*Lady Kitty Spencer, aristocrat and model"]}, {"page": "European Business School London", "response": ["* Lady Kitty Spencer (born 1990), English model"]}, {"page": "List of nicknames of European royalty and nobility: B", "response": ["** Lady Kitty Spencer"]}, {"page": "Kitty (given name)", "response": ["*Lady Kitty Spencer (born 1990), English model"]}, {"page": "Channel Seven Perth Telethon", "response": ["|Leo Sayer, Lady Kitty Spencer"]}, {"page": "List of alumni of the University of Cape Town", "response": ["*Lady Kitty Spencer (born 1990), English model", "*Lady Kitty Spencer, daughter of the 9th Earl of Spencer and niece of Diana, Princess of Wales"]}, {"page": "List of people with surname Spencer", "response": ["* Lady Kitty Spencer (born 1990), English model"]}, {"page": "List of wedding guests of Prince William and Catherine Middleton", "response": ["**Lady Kitty Spencer, the groom's first cousin"]}, {"page": "Equality (Titles) Bill", "response": ["After peer Lord Trefgarne remarked that the changes in succession would \"set the hare running\" on other inherited titles, a campaign group named \"The Hares\" was established. Prominent female aristocratic members of The Hares included Lady Sarah Carnegie, Lady Kitty Spencer, Lady Liza Campbell, and Lady Mary Charteris. Lady Sarah Carnegie served as the face of the movement, as after her the death of her father, the 14th Earl of Northesk, his title was legally claimed by a male 8th cousin instead of herself, her father's eldest surviving child."]}, {"page": "List of Vogue Japan cover models", "response": ["| August || Delilah BelleKenya Kinski-JonesCorinne FoxxMarina Ruy BarbosaCaroline DaurHarley Viera-NewtonDanni LiChloe BaileyHalle BaileyHelena BordonAimee SongKendall VisserMaria OlympiaOliver CheshirePixie LottSailor Brinkley-CookLady Kitty SpencerLana El SahelyMarcus ButlerStefanie GiesingerMarie-Ange CastaPhoebe-élena MerryweatherEugenia WeinsteinRose GilroySasha SpilbergRoos AbelsBianca BaltiMaria BogdanovichIara JereissatiStella AminovaCharlotte OlympiaAndrea DellalLele PonsMarjorie Elaine HarveyNatasha LauYumi DondoMaddi WaterhouseMichelle SalasFil Xiaobai Kang Seung HyunLady Amelia WindsorPraya LundbergLisa RinnaLori HarveyViva GoreAdriana MoraRenee StewartMackinley HillSylvie MakowerCoco KönigGrazi MassaferaAmanda HarveyIzzy GettyKarsen LiottaAlexandra PereiraMadison BeerOlivia BanksElla Hope MerryweatherShea MarieKristina BazanRachel YeohMichelle Yeoh Negin MirsalehiTaro PedersenSofia RichieKOM IAlice Dellal || Luca & Alessandro Morelli"]}, {"page": "Sid Neigum", "response": ["Neigum has dressed Kylie Jenner, Este Haim, Lorde, SZA, Sophie Grégoire Trudeau, Coco Rocha, Lady Kitty Spencer, Jennifer Aniston, Jada Pinkett Smith, Rooney Mara, Rose-Marie Perreault, Tasha Tilberg, Liisa Winkler, Karine Vanasse, Stacey McKenzie, Ruth Negga, Elaine Welteroth, Jessi Cruickshank, Angel Olsen, Jessie Andrews, Georgia Fowler, and Katy Perry.https://www.net-a-porter.com/en-us/shop/product/sid-neigum/twist-front-stretch-cotton-poplin-top/937014"]}, {"page": "Yull Shoes", "response": ["Yull is one of the only independent shoe brands manufacturing high heels in Britain, and it has a focus on the international as opposed to local market.\"Yull brings stiletto manufacturing back to the UK\". Telegraph. 26 July 2013. Retrieved 23 August 2016. The brand reflect bold colours, British styling, mixed in with classic wearable shapes. Fans of the shoes include Theresa May, Elle King, Chloe-Jasmine Whichello, Lady Kitty Spencer, Dawn O'Porter and Paloma Faith."]}, {"page": "List of wedding guests of Prince Harry and Meghan Markle", "response": ["** Lady Kitty Spencer, the groom's first cousin"]}, {"page": "Kitty Spencer", "response": ["#redirect Lady Kitty Spencer"]}, {"page": "Michael Lewis (businessman)", "response": ["In January 2020, his engagement to English fashion model, Lady Kitty Spencer, was announced. They married on 24 July 2021 at the Villa Aldobrandini in Rome."]}]}}