{"wiki_id": "http://www.wikidata.org/entity/Q5566289", "itemLabel": "Rutland Barrington", "itemDescription": "British opera singer and actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Rutland_Barrington", "wikipedia_page": {"main": "Rutland Barrington (15 January 1853 – 31 May 1922) was an English singer, actor, comedian and Edwardian musical comedy star.  Best remembered for originating the lyric baritone roles in the Gilbert and Sullivan operas from 1877 to 1896, his performing career spanned more than four decades.  He also wrote at least a dozen works for the stage.After two years with a comic touring company, Barrington joined Richard D'Oyly Carte's opera company and, over the next two decades, created a number of memorable comic opera roles, including Captain Corcoran in H.M.S. Pinafore (1878), the Sergeant of Police in The Pirates of Penzance (1880), and Pooh Bah in The Mikado (1885), among many others.  Failing in an 1888 attempt to become a theatrical manager, Barrington refocused his energies on acting and occasional playwriting.\nBeginning in 1896 and continuing for ten years, Barrington played in a series of very successful musical comedies under the management of George Edwardes at Daly's Theatre, specialising in comic portrayals of pompous rulers or other persons of authority.  One of the most popular features of his performances was his insertion of topical songs, or verses of songs, into these musical comedies.  After leaving Daly's he continued to appear in musical comedy roles and performed in music hall.  He also essayed a few Shakespeare and other dramatic roles and appeared in a few silent films.  His career ended in 1918, after which he suffered a stroke and lived the last few years of his life in poverty.", "link_mentions": [{"page": "Gilbert and Sullivan", "response": ["The repertory system ensured that the comic patter character who performed the role of the sorcerer, John Wellington Wells, would become the ruler of the Queen's navy as Sir Joseph Porter in H.M.S. Pinafore, then join the army as Major-General Stanley in The Pirates of Penzance, and so on. Similarly, Mrs. Partlet in The Sorcerer transformed into Little Buttercup in Pinafore, then into Ruth, the piratical maid-of-all-work in Pirates. Relatively unknown performers whom Gilbert and Sullivan engaged early in the collaboration would stay with the company for many years, becoming stars of the Victorian stage. These included George Grossmith, the principal comic; Rutland Barrington, the lyric baritone; Richard Temple, the bass-baritone; and Jessie Bond, the mezzo-soprano soubrette."]}, {"page": "The Pirates of Penzance", "response": ["|Sergeant||Fred Billington||Fred Clifton||Rutland Barrington||Rutland Barrington||Walter Passmore", "|Sergeant||Rutland Barrington||Fred Billington||Leo Sheffield||Sydney Granville||Richard Walker"]}, {"page": "The Mikado", "response": ["|Pooh-Bah||Rutland Barrington||Fred Billington||Rutland Barrington||Rutland Barrington||Rutland Barrington"]}, {"page": "Iolanthe", "response": ["|Mountararat||Rutland Barrington||Arthur Wilkinson||Powis Pinder||Frank Wilson||Rutland Barrington"]}, {"page": "Ruddigore", "response": ["|Sir Despard||Rutland Barrington||Fred Billington||Leo Sheffield||Sydney Granville||Sydney Granville"]}, {"page": "H.M.S. Pinafore", "response": ["|Captain Corcoran||Rutland Barrington||Sgr. Brocolini||Rutland Barrington||Henry Lytton||Rutland Barrington"]}, {"page": "The Water-Babies, A Fairy Tale for a Land Baby", "response": ["It was also adapted into a musical theatre version produced at the Garrick Theatre in London, in 1902. The adaptation was described as a \"fairy play\", by Rutland Barrington, with music by Frederick Rosse, Albert Fox, and Alfred Cellier.\"Garrick Theatre\", The Times, 19 December 1902,  p. 4. The book was also produced as a play by Jason Carr and Gary Yershon, mounted at the Chichester Festival Theatre in 2003, directed by Jeremy Sams, starring Louise Gold, Joe McGann, Katherine O'Shea, and Neil McDermott."]}, {"page": "The Yeomen of the Guard", "response": ["Wilfred's solo about his unrequited love for Phoebe, \"When jealous torments rack my soul\", was cut in rehearsal after Savoy Theatre favourite, Rutland Barrington, decided to take a leave from the company to try his hand as a producer and theatre manager.  It was intended to be sung after Phoebe's opening solo in Act I, \"When maiden loves\", and the ensuing passage of dialogue between Phoebe and Wilfred. In recent decades this song has been occasionally included in productions of the opera, and it was included in the 1993 recording by the D'Oyly Carte Opera Company.Shepherd, Marc. Recordings of The Yeomen of the Guard, The Gilbert & Sullivan Discography, 28 June 2009, accessed 30 July 2016", "|Wilfred||W. H. Denny||Fred Solomon||Henry Lytton||John Clulow||Rutland Barrington"]}, {"page": "Rutland (disambiguation)", "response": ["*Rutland Barrington (1853-1922), British entertainer"]}, {"page": "1922 in music", "response": ["*May 31 – Rutland Barrington, baritone of the D'Oyly Carte Opera Company (b. 1873)"]}, {"page": "Weedon Grossmith", "response": ["Grossmith's last stage appearance was in 1918, in his old role of Lord Arthur Pomeroy in A Pantomime Rehearsal, with an all-star cast including Charles Hawtrey, Fay Compton, Irene Castle and Rutland Barrington, at a charity matinée attended by King George V, Queen Mary and Queen Alexandra.\"Masks And Faces – Matinee for Actors' Pensions – Old Plays Still Fresh\", The Times, 18 December 1918, p. 6"]}, {"page": "Utopia, Limited", "response": ["The Daily News and The Globe both noted that Act I ran longer than any previous Savoy Opera and needed pruning.Allen, p. 378 The Manchester Guardian praised the work, but commented that there was \"much (sometimes too much) Gilbertian dialogue\".\"'Utopia (Limited)' – The New Gilbert and Sullivan Opera at the Savoy Theatre\", The Manchester Guardian,  9 October 1893, p. 4 However, Gilbert and Sullivan's choices for what to cut are suspect.  The soprano's aria, \"Youth is a boon avowed\" got some of the most enthusiastic reviews from the press but was cut after the opening night.  The Globe called it \"one of Sir Arthur Sullivan's best works\".Allen, p. 379  Also, the pre-production cuts left subplots that were introduced in Act I unresolved.  For example, Sullivan refused to set one of Gilbert's scenes for Nancy McIntosh, which left the Scaphio–Phantis–Zara subplot unresolved.Wolfson, pp. 32 and 195–201Bradley, p. 1062  Rutland Barrington, in his memoirs, felt that the \"second act... was not as full of fun as usual\" in the Gilbert and Sullivan operas.Allen, p. 382", "|King Paramount the First||Rutland Barrington||Kenneth Sandford"]}, {"page": "The Sorcerer", "response": ["Now backed by a company dedicated to their work, Gilbert, Sullivan and Carte were able to select their own cast, instead of using the players under contract to the theatre where the work was produced, as had been the case with their earlier works.  They chose talented actors, most of whom were not well-known stars; and so did not command high fees, and whom they felt they could mould to their own style.  Then, they tailored their work to the particular abilities of these performers.Jacobs, p. 111; Ainger, pp. 133–34  Carte approached Mrs Howard Paul to play the role of Lady Sangazure in the new opera. Mr and Mrs Howard Paul had operated a small touring company booked by Carte's agency for many years, but the couple had recently separated.Mrs Paul left her husband (Howard Paul, 1830–1905) around 1877, as he was having an affair with the actress-dancer Letty Lind, with whom he sired two illegitimate children.  However, she continued performing under this name, often humorously impersonating the famous tenor Sims Reeves.  See Barringon, p. 21 She conditioned her acceptance of the part on the casting of her 24-year-old protege, Rutland Barrington. When Barrington auditioned before W. S. Gilbert, the young actor questioned his own suitability for comic opera, but Gilbert, who required that his actors play their sometimes-absurd lines in all earnestness, explained the casting choice: \"He's a staid, solid swine, and that's what I want.\"Ayre, p. 48  Barrington was given the role of Dr Daly, the vicar, which was his first starring role on the London stage.Stone, David. \"Rutland Barrington\" at the Who Was Who in the D'Oyly Carte website (G&S Archive), accessed 9 March 2008", "|Dr Daly||Rutland Barrington||Rutland Barrington||Henry Lytton"]}, {"page": "Princess Ida", "response": ["Sullivan's score is majestic, and a sequence of songs in Act II, sometimes known as the \"string of pearls\",Walbrook's analysis of the music and libretto is particularly well loved.  Sullivan used chromatic and scalar passages and key modulations throughout the score, and commenters have called the Act II quartet \"The World Is But a Broken Toy\" one of Sullivan's \"most beautiful, plaintive melodies.\"  It has also been called \"Gounodesque\".Review in The Manchester Guardian, 28 September 1954, p. 5  Although Gilbert's libretto contains many funny lines, the iambic pentameter and three-act structure tend to make Ida more difficult to stage effectively than some of the other Savoy Operas.  In addition, modern audiences sometimes find the libretto's dated portrayal of sex roles, and the awkward resolution of the opera, unsatisfying.  It is also curious, after the string of successes that the partnership had experienced with George Grossmith and Rutland Barrington in starring roles, to choose a theme that relegated them to comparatively minor roles.", "|King Hildebrand||Rutland Barrington||Sgr Brocolini||Sgr Brocolini||Fred Billington||Leo Sheffield"]}, {"page": "The Cingalee", "response": ["The Cingalee is set in Ceylon and concerns colonial tea planters (one of the most popular songs in the score is called simply \"Tea, tea, tea\") in an era before this island paradise became the more troubled Sri Lanka. It was given a showy production and was a success in London. The fashion there for shows set in exotic Asian locales had been started by The Mikado and was continued by The Geisha, San Toy, The Nautch Girl, A Chinese Honeymoon and others. There is little in the music to give The Cingalee an Eastern flavour. However, Monckton's catchy sextet, \"The Island of Gay Ceylon\", his \"Pearl of Sweet Ceylon\" and Ruben's \"White and Brown Girl\", \"Sloe Eyes\", \"Monkeys\" and \"You and I\" are highlights of the musical score. The London cast included Hayden Coffin, Rutland Barrington, Huntley Wright and Isabel Jay.  A young Lily Elsie also appeared in the show, as did Topsy Sinden.\"Daly's Theatre\", The Times, 11 November 1904, p. 4", "*Boobhamba (A Noble of Kandy) – Rutland Barrington"]}, {"page": "Dan Leno", "response": ["Babes in the Wood was a triumph: the theatre reported record attendance, and the run was extended until 27 April 1889.Brandreth, p. 28 Leno considerably reduced his music-hall engagements as a consequence.Anthony, p. 90 Nevertheless, between April and October 1889, Leno appeared simultaneously at the Empire Theatre and the Oxford Music Hall, performing his one-man show. By this time, Leno was much in demand and had bookings for the next three years. On 9 May 1889 he starred for George P. Hawtrey in a matinee of Penelope, a musical version of a famous farce The Area Belle, to benefit the Holborn Lodge for Shop Girls. In this benefit, he played the role of Pitcher opposite the seasoned Gilbert and Sullivan performer Rutland Barrington. The Times considered that his performance treated the piece \"too much in the manner of pantomime\".The Times, 10 May 1889, p. 30 During Leno's long association with the Drury Lane pantomimes, he appeared chiefly as the dame.Disher, p. 56 After Harris died in 1896, Arthur Collins became the manager of the theatre and oversaw (and often helped to write) the pantomimes."]}, {"page": "St James's Theatre", "response": ["===Rutland Barrington; Lillie Langtry: 1888–1890===", "In 1888 the comic singer and actor Rutland Barrington became lessee of the theatre. He recruited a talented company, giving Olga Nethersole, Julia Neilson, Allan Aynesworth and Lewis Waller their London debuts, but met financial disaster when his first two – and in the event his only – productions, The Dean's Daughter by Sydney Grundy and Brantinghame Hall by Gilbert, were both complete failures.Barrington, pp. 77 and 79 Barrington lost £4,500, went bankrupt, and surrendered the lease in January 1889.\"Rutland Barrington's Bankruptcy\", The Era, 16 May 1891, p. 11 The theatre stayed dark for the rest of the year.MacQueen-Pope, p. 97"]}, {"page": "Isabel Jay", "response": ["After the birth of her first daughter, Celia Mitchell Anderson (1903–1997), Jay returned to the stage, taking over the role of Marjory Joy in a hit production of A Country Girl. She then starred in one West End theatre production after another – eleven in all – over a period of seven-and-a-half years. The first was the hit musical The Cingalee (1904, with Rutland Barrington and Hayden Coffin), in which she created the role of Lady Patricia Vane. In 1905 she was invited to sing before King Edward VII and Queen Alexandra at Chatsworth House, where the Queen presented her with a brooch. She was also a replacement for a pregnant Ruth Vincent in the title role of Véronique.", "Later that year she was hired by Frank Curzon, a successful theatre manager, who became her mentor. Her first role with Curzon was Sybil Cunningham in The White Chrysanthemum at the Criterion in 1905 (starring with Rutland Barrington and Henry Lytton) and then on tour. In early 1906, Jay separated from her husband. Her next role was Winnie Willoughby in The Girl Behind the Counter (1906, with Hayden Coffin). For the next four years, she starred regularly in Curzon's West End productions, often at The Prince of Wales Theatre and often in a show written by Paul Rubens. These were intended to be spectacular shows, with exotic sets, elaborate costumes and beautiful chorus girls. Her roles during these years included Olivia in Liza Lehmann's The Vicar of Wakefield (1906, based on the novel of the same name), Sally in Miss Hook of Holland (1906, running for a very successful 462 performances), Paulette in My Mimosa Maid (1908), Princess Marie in King of Cadonia (1908), Christina in Dear Little Denmark (1909), and Princess Stephanie in The Balkan Princess (1910)."]}, {"page": "The Gondoliers", "response": ["|Don Alhambra||W. H. Denny||John A. MuirFred Billington after the transfer to Palmer's Theatre.||Walter Passmore||John Clulow||Rutland Barrington", "|Giuseppe||Rutland Barrington||Duncan BarringtonBrother of Rutland Barrington. Gänzl (p. 384) has Rutland Barrington, which cannot be correct, as Rutland was playing Giuseppe in London.  Richard Temple took over at Palmer's Theatre||Henry Lytton||Richard Green||Henry Lytton"]}, {"page": "The Grand Duke", "response": ["Mr. and Mrs. Carte hired a new soprano, the Hungarian Ilka Pálmay, who had recently arrived in England and quickly made a favourable impression on London audiences and critics with her charming personality.Ainger, p. 358  Gilbert devised a new plot line revolving around Pálmay, making her character, Julia, an English actress among a company of German actors, with the topsy-turvy conceit that her \"strong English accent\" was forgiven by her audiences because of her great dramatic artistry.  Rutland Barrington's role, Ludwig, became the leading comedian of the theatrical company and the central role in the opera.Wolfson, pp. 88–91  Gilbert had paired the title character with contralto Rosina Brandram, causing Sullivan to suggest some different pairings of the characters, but Gilbert and the Cartes disagreed; Mrs. Carte went so far as to caution Sullivan that his ideas would upset the casting.Shepherd, pp. xviii–xx  Unhappily for Gilbert, three of his usual principal players, George Grossmith, Richard Temple and Jessie Bond, who he had originally thought would play the title character, the prince and the princess, all left the company before rehearsals began for The Grand Duke, and so he reduced the size of these roles, further changing his original conception.Shepherd, p. xx", "|Ludwig, his Leading Comedian||baritone||Rutland Barrington||Kenneth Sandford"]}, {"page": "Topsy-Turvy", "response": ["* Vincent Franklin as Rutland Barrington, who plays Pooh-Bah"]}, {"page": "Vaudeville Theatre", "response": ["John Maria and Rocco Gatti took over management of the Vaudeville in 1905.  In 1906, the theatre hosted the very successful The Belle of Mayfair, a musical composed by Leslie Stuart with a book by Basil Hood, Charles Brookfield and Cosmo Hamilton, produced by Hicks' partner, Charles Frohman. It ran for 431 performances and starred Edna May, Louie and her brother Courtice Pounds, and Camille Clifford. In 1910, an English adaptation of The Girl in the Train (Die geschiedene Frau – literally, \"The Divorcee\"), a 1908 Viennese operetta by Leo Fall, opened at the Vaudeville. It was produced by George Edwardes, with lyrics by Adrian Ross and starred Robert Evett, Phyllis Dare and Rutland Barrington. In 1911, William Greet produced Baby Mine at the theatre. Betty Bolton made her debut in 1916, at the age of 10, in a revue called Some, at the theatre. During and after World War I, audiences sought light entertainment, and musical revues held the Vaudeville stage, including Cheep (1917), the long-running Just Fancy (1920) and Rats (1923), another popular revue. Albert Ketèlbey was one of the theatre's music directors."]}, {"page": "Patience (opera)", "response": ["|Grosvenor||Rutland Barrington||James Barton Key||Henry Lytton||John Clulow"]}, {"page": "Lewis Waller", "response": ["After acting in amateur performances, Waller decided to make a career on the stage and was engaged by J. L. Toole in 1883. His first role was the Hon. Claude Lorrimer in H. J. Byron's Uncle Dick's Darling, in which he was billed as \"Waller Lewis\".Cordova, p. 1, and \"Theatres\", The Observer, 25 March 1883, p. 4 By May of the same year, he had adopted the stage name Lewis Waller.\"Notices\", The Times, 30 May 1883, p. 10 In that month he appeared at the Theatre Royal, Drury Lane, in a charity matinee for the Actors' Benevolent Fund with Toole's company and such contemporary stars as Rutland Barrington, Lionel Brough, Arthur Cecil, Nellie Farren, George Grossmith, Henry Irving and Ellen Terry.Theatre Royal playbill, 29 May 1883 He remained in Toole's company for a year, playing light comedy and juvenile parts.  He joined a touring company, playing the central role, the blind Gilbert Vaughan, in Called Back by Hugh Conway, dramatised by J. Comyns Carr.Cordova, p. 2 He returned to London in March 1885 to play at the Lyceum Theatre in Helena Modjeska's company, as the Abbé in Adrienne Lecouvreur, and then toured with her, playing such roles as Mortimer in Mary Stuart and Orlando in As You Like It; The Manchester Guardian said of the latter that he \"kept Orlando properly ingenuous, and made him a taking and gallant young wooer.\"\"Theatre Royal\", The Manchester Guardian, 4 June 1885, p. 5", "Waller then joined William Hunter Kendal and John Hare at the St. James's Theatre, where he played the Duc de Bligny in The Ironmaster, Sir George Barclay in Lady Clancarty, and Lord Arden in The Wife's Secret. When Rutland Barrington took over the management of the St. James's in 1888, Waller played  George Sabine in The Dean's Daughter and Ralph Crampton in Brantinghame Hall. Rudolph de Cordova, in a 1909 biographical sketch notes, \"During this period, few theatres played regular afternoon performances, so that the actors were, for the most part, engaged only in the evening. Many matinees were, however, given to introduce new plays and new players; and in this way Mr. Waller acted a large number of new parts, all of an ephemeral character.\"Cordova, pp. 2–3 In particular he played several  Ibsen roles in these matinees in the early 1890s, bringing him to the attention of people of influence in the theatre such as William Archer, Jacob Grein and Bernard Shaw. Waller played Oswald in Ghosts, Lovborg in Hedda Gabler, Rosmer in Rosmersholm and Solness in The Master Builder.  The ODNB comments that Archer was \"delighted that an established West End actor had contributed to the Ibsen revival but was aware that Waller could overcome neither the plays' inadequate rehearsal period nor his background of florid West End performances.\""]}, {"page": "Allan Aynesworth", "response": ["After returning to England, Aynesworth resolved to pursue a theatrical career, and made his stage debut in April 1887 as an uncredited extra in The Red Lamp by Outram Tristram, produced by and starring Herbert Beerbohm Tree.\"The London Theatres\", The Era, 23 April 1887, p. 14 He then went as a student to Sarah Thorne's theatre at Margate, before returning to London in November 1887, when he played a small role in a blank-verse tragedy, The Witch, at the St James's Theatre. The Standard observed, \"Mr. A. E. Aynesworth spoke the few lines allotted to him with distinction\".\"St. James's Theatre\", The Standard, 7 November 1887, p. 2 In March 1888 Aynesworth played in a short-lived piece, To the Death, written by and starring Rutland Barrington.\"Olympic Theatre\", The Morning Post, 24 March 1888, p. 5 before rejoining the company at the St James's the following month, under the management of John Hare and William Kendal; he played General de Pontac in a revival of The Ironmaster by Arthur Pinero. Later that year the Hare and Kendal management ended, and Barrington took over as lessee of the St James's; he cast Aynesworth as Lord Ashwell in The Dean's Daughter. Reviewers thought it a difficult role – \"trying\", \"ungrateful and generally ridiculous\" – and singled Aynesworth out for his success in making it work on stage.\"Last Night's Theatricals\" , Reynolds's Newspaper, 14 October 1888, p. 8; and \"The Theatres\", The Daily News, 1 October 1888, p. 3"]}, {"page": "Olga Nethersole", "response": ["Olga Isabella Nethersole was born in London, of Spanish descent on her mother's side. Her step-father was Henry Nethersole, a solicitor. She made her stage début at Theatre Royal, Brighton in 1887. In 1888, Nethersole began playing important parts in London, at first under Rutland Barrington and John Hare at the Garrick Theatre."]}, {"page": "Garrick Theatre", "response": ["In 1900, the theatre hosted J. M. Barrie's The Wedding Guest. Rutland Barrington presented several stage works at the Garrick, including his popular \"fairy play\" called Water Babies in 1902, based on Charles Kingsley's book, with music by Alfred Cellier, among others. The only piece actually premiered by W. S. Gilbert here was Harlequin and the Fairy's Dilemma (retitled The Fairy's Dilemma after a few days), a \"Domestic Pantomime\" (1904). In 1921, Basil Rathbone played Dr. Lawson in The Edge o' Beyond at the Garrick, and the following year Sir Seymour Hicks appeared in his own play, The Man in Dress Clothes. In 1925, Henry Daniell played there as Jack Race in Cobra and appeared there again as Paul Cortot in Marriage by Purchase in March 1932.", "* 1902 – Water Babies, an adaptation by Rutland Barrington of Charles Kingsley's novel, with music by Alfred Cellier and others."]}, {"page": "San Toy", "response": ["San Toy, or The Emperor's Own is a \"Chinese\" musical comedy in two acts, first performed at Daly's Theatre, London, on 21 October 1899, and ran for 768 performances (edging out The Geisha as the second longest run for any musical up to that time).  The book was written by Edward Morton, and the musical score was written by Sidney Jones with lyrics by Harry Greenbank and Adrian Ross.  Additional songs were written by Lionel Monckton.  The cast included Marie Tempest, Scott Russell, Huntley Wright and Rutland Barrington.", "*Yen How (A Mandarin) – Rutland Barrington"]}, {"page": "The Geisha", "response": ["The Geisha was first performed on 25 April 1896 at Daly's Theatre in London, produced by George Edwardes. The original production ran for 760 performances. This run, the second longest of any musical up to that time, would be beaten three years later by Edwardes' San Toy, which was written by Jones, Greenbank and Monckton. The cast included Marie Tempest in the role of O Mimosa San and Letty Lind as the dancing soubrette Molly Seamore. C. Hayden Coffin played Lieutenant Reginald Fairfax, Huntley Wright played Wun-Hi, and later Rutland Barrington and Scott Russell joined the cast.  Direction was by J. A. E. Malone, choreography by Willie Warde and costumes by Percy Anderson. The music director was Ernest Ford. Edwardes took advantage of the continuing fascination of the public with the orient that had brought such success to Gilbert and Sullivan in The Mikado.Hicks, William L. \"Social Discourse in the Savoy Theatre's Productions of The Nautch Girl (1891) and Utopia Limited (1893): Exoticism and Victorian Self-Reflection (2003)  However, The Geisha was a more topical entertainment than The Mikado, and despite its great initial popularity, The Geisha and the many other topical oriental Edwardian musicals, such as San Toy, A Chinese Honeymoon and even Chu Chin Chow did not endure through the decades as well as The Mikado.", "*Marquis Imari Chief of Police and Governor of the Province (baritone) – Harry Monkhouse (later replaced by Rutland Barrington)Gänzl (1988), p. 72"]}, {"page": "A Greek Slave", "response": ["A Greek Slave is a musical comedy in two acts, first performed on 8 June 1898 at Daly's Theatre in London, produced by George Edwardes and ran for 349 performances. The score was composed by Sidney Jones with additional songs by Lionel Monckton and lyrics by Harry Greenbank and Adrian Ross. The libretto was written by Owen Hall. It starred Marie Tempest, Letty Lind, Hayden Coffin, Scott Russell, Huntley Wright and Rutland Barrington among other popular London stars. The show had a brief Broadway run in 1899.", "*Marcus Pomponius (Prefect of Rome) – Rutland Barrington"]}, {"page": "Alfred Cellier", "response": ["Cellier returned to Australia in 1888 to conduct Dorothy and a revival of his earlier work, Charity Begins at Home, and made a final brief visit there for health reasons in early 1891, together with Stephenson.Lamb, Andrew. \"Alfred Cellier in Australia\", Sir Arthur Sullivan Society Magazine, No. 97, Summer 2018, p. 22 His last comic operas, Doris (1889, with Stephenson) and The Mountebanks (with Gilbert, produced in January 1892, a few days after the composer's death), were both modestly successful. Also after Cellier's death, Rutland Barrington used some of his music in his 1902 adaptation of Water Babies. Often in ill health throughout his life,Stedman, p. 279 Cellier was unable to finish The Mountebanks, and Ivan Caryll completed the score.Gänzl, Kurt, \"Caryll, Ivan (1861–1921)\", Oxford Dictionary of National Biography, Oxford University Press, 2004, accessed 12 January 2011  A reviewer of the 2018 recording of The Mountebanks commented: \"There is a free-flowing style to Cellier’s compositions, with fine lyrical detail and sumptuous orchestration with which he provides a wide variety of musical effects.\"Walker, Raymond J. \"Alfred Cellier (1844-1891): The Mountebanks, comic opera (1892); and Suite Symphonique (1878)\", Music Web International, 2018"]}, {"page": "D'Oyly Carte Opera Company", "response": ["The first comic opera produced by the Comedy Opera Company was Gilbert and Sullivan's The Sorcerer, about a tradesmanlike London sorcerer. It opened in November 1877 together with Dora's Dream, a curtain-raiser with music by Sullivan's assistant Alfred Cellier and words by Arthur Cecil, a friend of both Gilbert and Sullivan.Ainger, p. 140 Instead of writing a piece for production by a theatre proprietor, as was usual in Victorian theatres, Gilbert, Sullivan and Carte produced the show with their own financial support. They were therefore able to select their own cast of performers, rather than being obliged to use the actors already engaged at the theatre. They chose talented actors, most of whom were not well-known stars and did not command high fees, and to whom they could teach a more naturalistic style of performance than was commonly used at the time. Carte's talent agency provided many of the artists to perform in the new work. They then tailored their work to the particular abilities of these performers.Jacobs, p. 111; Ainger, pp. 133–134 Some of the cast members, including principal comedian George Grossmith, Richard Temple and Rutland Barrington, stayed with the company for almost 15 years. Two other longstanding members of the company were Rosina Brandram, who started in D'Oyly Carte touring companies with The Sorcerer, and Jessie Bond who joined the group for Pinafore at the Opera Comique in 1878.Ainger, p. 152 As Grossmith wrote in 1888, \"We are all a very happy family.\"Grossmith, Chapter VI", "Gilbert and Sullivan aficionados frequently use the names of the principal comedians of the D'Oyly Carte Opera Company to refer to time periods of the company's history.Wilson and Lloyd, passim Thus, after the sudden death of Sullivan's brother Fred, who had created the role of the Learned Judge in Trial by Jury in 1875, the unknown George Grossmith was recruited in 1877. Before Grossmith left the company in 1889, he created the principal comic roles in nine of the operas, and so the principal comedian parts in the operas are often referred to as the \"Grossmith\" roles. Other performers who created a long series of roles in the original productions of the operas included the baritone Rutland Barrington, mezzo-soprano Jessie Bond, soprano Leonora Braham, contralto Rosina Brandram, tenor Durward Lely and bass-baritone Richard Temple. In the original New York City productions and British touring productions, the soprano Geraldine Ulmar, baritone Signor Brocolini, comic George Thorne and bass-baritone Fred Billington became particularly well known.Wilson and Lloyd, pp. 19–46"]}, {"page": "Henry Lytton", "response": ["In 1890 Lytton played the Duke of Plaza-Toro in the latest Savoy opera, The Gondoliers, on tour and on Broadway, where Carte sent him with other D'Oyly Carte principals, to bolster the weak cast of the original New York production.Rollins and Witts, pp. 73–74; and \"With a New Company\", The New York Times, 8 February 1890, p. 8 After returning to Britain he added another of Grossmith's old roles to his repertory, playing the Lord Chancellor in Iolanthe.Rollins and Witts, p. 78 In the first provincial production of Utopia, Limited (1893) he played King Paramount – not a patter role but the main baritone part – created at the Savoy by Rutland Barrington.Rollins and Witts, pp. 14 and 86 He played the title role in The Sorcerer and Bunthorne in Patience for the first time in 1895,Rollins and Witts, p. 93 and later in 1895 King Gama in Princess Ida, finally appearing in the role he had understudied in his first season with D'Oyly Carte eleven years earlier.Rollins and Witts, p. 94 In 1896 he toured as Ludwig in the final Gilbert and Sullivan opera, The Grand Duke.Rollins and Witts, p. 98"]}, {"page": "Emily Faithfull", "response": ["Of her nephews, one was the actor Rutland Barrington and another the Indologist John Faithfull Fleet, ICS. Among her friends she counted Richard Peacock, one of the founders of Beyer, Peacock & Company, to whom she dedicated the Edinburgh edition of her book Three Visits To America with the words to my \"Friend Richard Peacock Esq of Gorton Hall\" in 1882. She was also the witness to the marriage of Peacock's daughter Jane Peacock to William Taylor Birchenough, the son of John Birchenough another manufacturer cited in Three Visits To America for his treatment of women employees in his silk mill in Macclesfield, at Brookfield Unitarian Church, which Richard Peacock built in Gorton."]}, {"page": "B. C. Stephenson", "response": ["In the non-musical theatre, Stephenson continued to prosper. By the 1890s he was sufficiently well known that his name as author of a play lent cachet.  In 1892 one British newspaper protested that a new play, advertised as the work of Stephenson and Augustus Harris, was in fact the work of less-known writers.\"Things Theatrical\", The Sporting Times, 5 March 1892, p. 3 In the same year, Stephenson produced one of his more enduring works, Faithful James, a one act comedy. It supplanted Gilbert's Rosencrantz and Guildenstern in a triple bill running at the Court Theatre. The cast included Weedon Grossmith, Brandon Thomas, Ellaline Terriss and Sybil Grey.\"Things Theatrical\", The Sporting Times, 23 July 1892, p. 2 Among later revivals of the play was one in 1907 with Rutland Barrington in the title role of the bumbling butler.\"Coronet Theatre\", The Times, 23 July 1907, p. 5 In 1894, Stephenson co-wrote a melodrama with Haddon Chambers, The Fatal Card, which was well received.\"Adelphi Theatre: The Fatal Card\", The Sporting Times, 8 September 1894, p. 6 Asked how he and his collaborator worked together, he said, \"We divide the labour. I write all the vowels and Mr Chambers all the consonants.\"The Sporting Times, 15 September 1894, p. 3"]}, {"page": "Haddon Hall (opera)", "response": ["The 1892 opening night cast included such Savoy Theatre favourites as Courtice Pounds as John Manners, Charles Kenningham as Oswald, Rutland Barrington as Rupert Vernon, W. H. Denny as The McCrankie, and Rosina Brandram as Lady Vernon. Florence Easton originated the small role of Deborah and later played the role of Dorothy Vernon. John D'Auban choreographed the production.Theatre programme, Savoy Theatre, September 1892", "Rupert Vernon (baritone) – Rutland Barrington"]}, {"page": "His Excellency (opera)", "response": ["The opera premiered instead under the management of George Edwardes in 1894 at the Lyric Theatre, running for 162 performances. It starred many of the Savoy Theatre regulars, such as George Grossmith, Rutland Barrington and Jessie Bond, as well as Ellaline Terriss, who was to become a major West End star. It was also produced in New York in 1895, and in German translation at the Carltheater, Vienna, in both 1895 and 1897. The opera also enjoyed a British provincial tour.", "The original production at the Lyric Theatre in London opened on 27 October 1894, and closed on 6 April 1895 after 162 performances.  For the cast of His Excellency, Gilbert was able to engage former Savoy opera stalwarts George Grossmith, Rutland Barrington, Alice Barnett, Charles Kenningham and Jessie Bond, as well as John Le Hay and the young musical comedy star, Ellaline Terriss. Many of the choristers from the Savoy Theatre, who had been disappointed with the recent short run of Mirette there, joined Gilbert's production, and Helen Carte accused Gilbert of poaching the D'Oyly Carte chorus.Howarth, Paul. \"His Excellency: Background Notes\". The Gilbert and Sullivan Archive, 28 December 2008, accessed 28 November 2010 Choreography was by John D'Auban, and costumes were by Percy Anderson.", "|The Prince Regent, disguised as Nils Egilsson, a strolling player || lyric baritone || Rutland Barrington"]}, {"page": "Fallen Fairies", "response": ["The replacement of the leading lady was not enough to save Fallen Fairies from an early closing, although Evans earned praise in the role. Indeed, faults in Gilbert's libretto were likely as much to blame as any failings of McIntosh.Dunhill, p. 1076 The Observer wrote, \"It is a strange compound of trifling and tragedy, of gossamer and gnashings of teeth ... the effect is a little like that of an act of Othello pieced into The Merry Wives of Windsor.\"Stedman, p. 333 Rutland Barrington, in his 1911 memoir, wrote: \"I am inclined to attribute much of the failure of the opera to catch on to the fact that, owing to the entire absence of men's voices to balance the mass of soprani and alti, one's ears suffered from an unavoidable weariness, and a longing for the robust report of the male choristers; the humour of the play also seemed to me to have evaporated, to a great extent, with its conversion\" to a comic opera. available online here."]}, {"page": "Jessie Bond", "response": ["Iolanthe was followed by Princess Ida (1884), in which Bond played the role of Melissa.  Bond played the role of Constance in the first revival of The Sorcerer (1884–85).  The role had originally been written for a soprano, and some of the music was transposed down to suit Bond's lower range and tessitura.An examination of the 1877 and 1884  scores shows the lowered keys.  David Mackie, the associate musical director of the D'Oyly Carte Opera Company from 1976 to 1982, wrote and presented 14 interval talks on BBC Radio 2, for the network's 1989 series of the complete Gilbert & Sullivan operas.  In his talk on The Sorcerer, broadcast on 1 October 1989, he stated that the keys were lowered to accommodate Bond. Another feature of this revival was the pairing of Bond's character with that of Rutland Barrington's.  The combination was so successful that in later Savoy operas, Bond and Barrington were generally paired.", "Bond next appeared in the first revivals of H.M.S. Pinafore (1887–88), Pirates (1888), and The Mikado (1888) recreating her earlier roles. She had developed an enthusiastic following among the audiences at the Savoy Theatre. During this period, Bond also appeared in To the Death by fellow savoyard Rutland Barrington (1888) and Locked In (1889). For the revival of Pirates, Bond asked Gilbert if he would increase the size of the small role of Edith for her. Gilbert wrote her a letter that concludes:", "After The Gondoliers closed, Gilbert and Sullivan were estranged for a time,In her Reminiscences, Chapter 10, Bond notes that she believed that Gilbert was \"perfectly right\" in the famous \"carpet quarrel\". and Carte hired Bond to play Chinna-Loofa in Dance, Desprez and Solomon's The Nautch Girl (1891).  Although her salary continued to rise, she was less happy at the Savoy after Gilbert's departure.  She took a three-month leave from the D'Oyly Carte organisation in August 1891, together with Rutland Barrington, performing a series of \"musical duologues\" and sketches, written mostly by Barrington and composed by Edward Solomon, on a provincial tour, where they received good notices and profits.Bond, Chapter 11, accessed 10 March 2008 Bond also did some of the writing.Ernill, p. 310 She had passed up the opportunity to create a role in Gilbert's next opera, The Mountebanks at the Lyric Theatre (1892), as she was still under contract to Carte.  She and Barrington returned to the Savoy in November, but Bond left the D'Oyly Carte organisation at the end of the run of The Nautch Girl in January 1892, as there was no role for her in the next Savoy opera, The Vicar of Bray.   Bond was unwilling to accept the part offered to her in the next Savoy piece, Haddon Hall (1892)."]}, {"page": "Rosina Brandram", "response": ["Later in 1880, on her return to England, she played Kate during the London run of Pirates at the Opera Comique. During the original production of Patience (1881–82), she was given the leading roles in two one-act companion pieces: Margery Daw in Uncle SamuelWalters, Michael and George Low. \"Uncle Samuel\", Curtain Raisers at the Gilbert and Sullivan Archive, accessed 1 January 2010 and Mrs. Bowcher in Mock Turtles.Walters, Michael and George Low. \"Mock Turtles\", Curtain Raisers at the Gilbert and Sullivan Archive, accessed 1 January 2010 She also occasionally substituted for Alice Barnett as Lady Jane in Patience.Rollins and Witts, p. 8 While the next opera, Iolanthe (1882–84), played at the company's new home, the Savoy Theatre, she continued to take roles in the curtain raisers, repeating as Mrs. Bowcher and then as Mrs. Frumpington in A Private Wire.The Era, 7 April 1883, p. 7 In September 1883, she replaced an unwell Jessie Bond as Iolanthe. Rutland Barrington wrote of her in his 1908 memoir, \"I have never heard a contralto singer who gave me so much pleasure as Rosina; she sang without any effort, and her voice had a fullness and mellifluous quality which were unrivalled.\"Barrington, Chapter 3", "In her final years, suffering from pulmonary disease, Brandram was too ill to attend the dinner in December 1906 at the O.P. Club celebrating the first London repertory season of the Gilbert and Sullivan operas, at which she had been scheduled to speak, along with George Grossmith and Rutland Barrington.The Times, 31 December 1906, p. 9 In his remarks on that occasion, W. S. Gilbert gave this tribute to Brandram: \"Rosina of the glorious voice that rolled out as full-bodied Burgundy rolls down – Rosina whose dismal doom it was to represent undesirable old ladies of 65, but who, with all the resources of the perruquier and the make-up box, could never succeed in looking more than an attractive eight-and-twenty – it was her only failure.\""]}, {"page": "Fred Billington", "response": ["Billington seldom played in the West End but was a favourite with provincial audiences, chiefly in the roles created by Rutland Barrington. He created two roles in Savoy operas: the first was the Sergeant of Police in the one-off performance of The Pirates of Penzance given in December 1879 in Paignton (the day prior to the New York premiere) to establish Gilbert's and Sullivan's British copyright, and the second was King Mopolio in His Majesty at the Savoy Theatre in 1897.", "In 1885, Billington added to his list of roles the Learned Judge in Trial by Jury and Pooh-Bah in The Mikado.Rollins and Witts, p. 57  In August of that year, he travelled to New York for the American production of The Mikado, in a cast that included George Thorne (Ko-Ko), Geraldine Ulmar (Yum-Yum) and Courtice Pounds (Nanki-Poo). Returning from America in May 1886, he performed the roles of Corcoran and Pooh-Bah in the provinces and then Germany and Austria.Rollins and Witts, p. 59; and \"Theatrical Gossip\", The Era, 17 April 1886, p. 8. The tour was to have included Budapest, but that engagement was cancelled because of a local outbreak of cholera: see \"Theatrical Gossip\", The Era, 9 October 1886, p. 8  He then returned to England in 1887 to rehearse the new Gilbert and Sullivan opera, Ruddygore, gave two matinee performances as Sir Despard Murgatroyd at the Savoy Theatre, and then sailed for New York again, to play Sir Despard in the American cast.Rollins and Witts, p. 61; and \"Theatrical Gossip\", The Era, 12 February 1887, p. 8  This was followed by British and European tours of Ruddigore, The Mikado and Patience, in which he played Colonel Calverley.  He also filled in for Rutland Barrington as Sir Despard briefly at the Savoy.Stone. Rollins and Witts do not record this Savoy appearance."]}, {"page": "A Sensation Novel", "response": ["A Sensation Novel satirises the sensation novels popular as pulp detective fiction in the Victorian era. The play concerns stock melodrama characters who take on a life of their own and comment negatively on the absurd plot their author forces them into. Music is a continual and essential element of the dramatic action throughout the piece. As scholar Jane W. Stedman observes in her book Gilbert Before Sullivan, this play anticipates Luigi Pirandello's Six Characters in Search of an Author. Fans of Gilbert and Sullivan will notice that Sir Ruthven Glenaloon prefigures Sir Ruthven Murgatroyd, Baronet of Ruddigore; Alice Grey, the virtuous heroine, is a foundling like Rose Maybud in Ruddigore; and that other elements of the piece anticipate the Savoy Operas, including babies switched at birth and a self-decapitation. Gilbert's casting of the large, ungainly Richard Corney Grain as the \"spirit of romance\" was a joke that foreshadowed his casting of the rather large Rutland Barrington as the image of perfect manly beauty in Patience.Walters, p. 16", "*Walters, Michael \"A Brief Overview of the Life of Rutland Barrington\" in The Gilbert & Sullivan News, vol. II, no. 13, pp. 16–21 (Autumn/Winter 1998; The Gilbert and Sullivan Society)."]}, {"page": "Madge Titheradge", "response": ["and in 1902, shortly after her fifteenth birthday, she appeared at the Garrick Theatre, London, as the Second Water Baby in Rutland Barrington's adaptation of The Water Babies. Barrington recalled in his memoirs \"Madge Titheradge was our première danseuse and made a great success with her dance outside the little school-house, or rather cottage; she danced with such evident enjoyment of her work.\"Barrington, Chapter XI"]}, {"page": "The Nautch Girl", "response": ["The cast included several players familiar to the Savoy's audiences: Courtice Pounds (Indru), Frank Thornton (Pyjama), W. H. Denny (Bumbo), Frank Wyatt (Baboo Currie) and Rutland Barrington (Punka, replaced by W. S. Penley, when Barrington left the company for several months to tour in a series of \"musical duologues\" with Jessie Bond).  The part of Chinna Loofa was the last role that Jessie Bond created at the Savoy.  She wrote in her memoirs that it was one of her favourites.  The title role was played by Lenore Snyder, the last of a number of actresses who had played Gianetta in The Gondoliers.Rollins and Witts give her name as Leonore. The Era in the cast list printed in its 4  July 1891 issue gives it as Lenore, as does the original Savoy theatre programme.", "|Punka, the Rajah of Chutneypore ||  baritone || Rutland Barrington "]}, {"page": "W. H. Denny", "response": ["Denny joined the D'Oyly Carte Opera Company at the Savoy to replace Rutland Barrington in 1888 and remained there until 1893.  He created the roles of Wilfred Shadbolt in The Yeomen of the Guard (1888), the Grand Inquisitor, Don Alhambra del Bolero, in The Gondoliers (1889) and Bumbo in The Nautch Girl (1891).  He next played Bedford Rowe in the revival of The Vicar of Bray (1892), and he created the character of The McCrankie in Haddon Hall (1892), leaving the company when the run was completed.  In 1893, he appeared in a musical comedy called Poor Jonathan before returning to D'Oyly Carte to create the part of Scaphio in Utopia, Limited (1893).  He again left the company at the end of the run of that show."]}]}}