{"wiki_id": "http://www.wikidata.org/entity/Q5569501", "itemLabel": "Glenys Stacey", "itemDescription": "British businessperson and civil servant", "wikipedia_url": "https://en.wikipedia.org/wiki/Glenys_Stacey", "wikipedia_page": {"main": "Dame Glenys Jean Stacey DBE (née McBride; born 1954) is a solicitor and civil servant serving as chair of the Office for Environmental Protection from February 2021. She was Chief Executive and Chief Regulator of Ofqual, acting in the post from August to December 2020, and previously from 2012 to 2016. Stacey also served as Her Majesty's Chief Inspector of Probation and led HM Inspectorate of Probation for England and Wales from 2016 and 2019.She has worked in the public sector at senior management level since 2000. Previously she has worked as chief executive of Ofqual, of Standards for England, at Animal Health (now part of the Animal and Plant Health Agency), at the Greater Manchester Magistrates' Courts Committee (now part of HM Courts and Tribunals Service), and at the Criminal Cases Review Commission.She was appointed Dame Commander of the Order of the British Empire (DBE) in the 2016 New Year Honours for services to education.Stacey returned as Ofqual's chief regulator in an interim capacity on 26 August 2020 following the resignation of Sally Collier in connection with the 2020 UK GCSE and A-Level grading controversy.", "link_mentions": [{"page": "National Probation Service", "response": ["Not enough is done to supervise former prisoners after release from jail and discourage reoffending.  Glenys Stacey, Chief Inspector of Probation said, \"Although there are exceptions, the community rehabilitation companies... are not generally producing good quality work, not at all.\"Ex-prisoners lack support, says probation head BBC", "The Justice Select Committee said the 'Transforming Rehabilitation' programme had brought the probation system into a \"mess\", staff morale was at an \"all-time low\" and newly released prisoners got \"wholly inadequate\" support.  The committee said that splitting the service between a national body and 21 rehabilitation companies lead to a two-tier system, reducing voluntary sector involvement. MPs said the companies' efforts to reduce re-offending is \"disappointing\" and some staff are not trained to deal with cases they are assigned.Probation system 'a mess' despite reforms, say MPs BBC Perpetrators of domestic abuse are inadequately supervised by private companies, putting tens of thousands of victims and their families at risk.   The staff of privatised offender supervision companies do not have the skill, experience or time to supervise perpetrators.  HM Inspectorate of Probation found in 71% of cases, there was insufficient victim protection.  Glenys Stacey stated private Community Rehabilitation Companies were \"nowhere near effective enough.\"  Katie Ghose of Women's Aid said, \"This report shows that community rehabilitation companies are failing victims, with a significant lack of understanding about domestic abuse, especially coercive control.  Probation officers are routinely underestimating the ongoing danger posed to the victim and not reassessing the level of risk involved when circumstances change. The findings of this report show that CRCs are currently not fit for purpose when it comes to domestic abuse cases and we call on the government to urgently change this to protect survivors\".  Too few perpetrators of domestic abuse are referred to courses to help them manage relationships better and those who do too frequently do not complete the course.Private probation firms 'put victims of abuse at risk' The GuardianDomestic abuse victims 'failed' by private probation service BBC"]}, {"page": "Stacy", "response": ["* Glenys Stacey (born 1954), British solicitor and civil servant"]}, {"page": "Standards Board for England", "response": ["The last Chief Executive of the board was Glenys Stacey. Its chair was Dr Robert Chilton."]}, {"page": "List of Dames Commander of the Order of the British Empire", "response": ["*2016: Anita Allen, Sue Black, Louise Casey, Denise Coia, Polly Courtice, Caroline Dean, Anna Dominiczak, Lesley Fallowfield, Judith Hackitt, Alice Hudson, Nerys Jefford, Susan Jowett, Rotha Johnston, Frances Lannon, Christine Lenehan, Georgina Mace, Natalie Massenet, Carolyn McCall, Henrietta Moore, Finola O'Farrell, Julia Peyton-Jones, Siân Phillips, Heather Rabbatts, Benita Refson, Caroline Spelman, Glenys Stacey, Arabella Warburton, Margaret Whitehead, Penelope Wilton, Barbara Windsor, Rosie Winterton, Til Wykes"]}, {"page": "Ofqual", "response": ["* Dame Glenys Stacey, 1 April 2012–29 February 2016", "* Dame Glenys Stacey, 26 August 2020–31 December 2020 (Interim Chief Regulator)", "* Dame Glenys Stacey, 1 March 2011–31 March 2012 (continued as CEO and Chief Regulator)"]}, {"page": "Her Majesty's chief inspector", "response": ["| HM Chief Inspector of Probation || 1936 || Dame Glenys Stacey || March 2016 "]}, {"page": "Dame Glenys Stacey", "response": ["#REDIRECT Glenys Stacey"]}, {"page": "Sally Collier", "response": ["She has served as the CEO of the Crown Commercial Service, an executive agency of the Cabinet Office. She was also previously the Managing Director of the Government Procurement Service and Director of Procurement Policy and Capability. On 25 April 2016 she was appointed as the chief regulator of Ofqual, replacing Glenys Stacey who stepped down from the position in February 2016 after a five-year term. Prior to her appointment as the exam regulator, she had nearly twenty years of experience in the civil service.", "In 2020, Collier was criticised over the implementation of the Ofqual exam results algorithm which was termed by teachers and students as unfair for the purpose of grading the students following the cancellation of the GCE Advanced Level (A Level) exams due to the COVID-19 pandemic. The algorithm used initially led to a downgrading of 40% of the A-Level results and was later removed. On 25 August 2020 she tendered her resignation from the position of chief regulator of Ofqual. She was later replaced by her predecessor as the chief regulator of Ofqual, Glenys Stacey, on an interim basis."]}, {"page": "Office for Environmental Protection", "response": ["As of July 2021 it exists as an interim body.  The first chair is Glenys Stacey, who has called delays in the passage of the bill \"extremely disappointing\". Its first chief executive is Natalie Prosser and its headquarters are in Worcester. Concerns have been raised about potential lack of powers, independence, funding and about freedom of information. The OEP is intended to replace the environmental protection functions of the EU, but a report by the Bingham Centre for the Rule of Law expressed concerns that the bill as of June 2021 would provide no equivalent legal remedy for breaches."]}]}}