{"wiki_id": "http://www.wikidata.org/entity/Q55614234", "itemLabel": "Ian Darling", "itemDescription": "British judge", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Darling_(judge)", "wikipedia_page": {"main": "Ian Galen Darling (born 27 October 1962) is a British Circuit judge.He was educated at Winchester College and King's College London (LLB, 1984). He was called to the bar at Middle Temple in 1985 and served as a Recorder from 2003 to 2009.He has two children, Alfie and Athena born in 2004 and 2006. \nHe has sat as a judge at Inner London, Blackfriars, Snaresbrook and Wood Green Crown Court. \nComing from a family of law, he is very experienced and takes after his late mother (Ann Darling OBE) who was a top magistrate. Law is clearly in the family as his brother (Paul Darling OBE QC) is well known in Commercial law.", "link_mentions": [{"page": "Ian Darling", "response": ["In 2018 Shark Island Institute introduced The Labs - supporting five Australian documentary films in development.  Recently he created voxdocs, a short film initiative by Shark Island Institute and Documentary Australia Foundation, in association with Sydney Morning Herald and The Age.  Ian Darling directed the voxdocs film The Comedian, a short film in which stand up comedian Greg Fleet discovers the reality of performing for laughs without an audience.", "Darling was recipient of the 2007 Creative Partnerships Australia (formerly Australia Business Arts Foundation) Business Leadership Award, and recipient of Australia's Leading Philanthropist Award from Philanthropy Australia in 2017. In 2018 Ian Darling was made an Officer of the Order of Australia (AO) for \"distinguished service to documentary film production, to the performing arts, education and community engagement, and to social welfare organisations through philanthropic endeavours\". Also in 2018, Darling was the recipient of the Byron Kennedy Award for brave, innovative and wide-ranging pursuit of excellence, presented by the Australian Academy of Cinema and Television Arts (AACTA). He was recently named Australian National University’s 2020 Alumnus of the Year."]}, {"page": "Paul Darling", "response": ["Darling grew up in Cleadon in County Durham and went to Tonstall School in Sunderland before attending Winchester School and then St Edmund Hall College, Oxford. His mother was a magistrate and his brother Ian Darling is a British circuit judge. Darling's grandfather was Newcastle United player Jack Allen. "]}]}}