{"wiki_id": "http://www.wikidata.org/entity/Q5567529", "itemLabel": "Leo Baxendale", "itemDescription": "cartoonist", "wikipedia_url": "https://en.wikipedia.org/wiki/Leo_Baxendale", "wikipedia_page": {"main": "Joseph Leo Baxendale (27 October 1930 – 23 April 2017) was an English cartoonist and publisher. Baxendale wrote and drew several titles. Among his best-known creations are the Beano strips Little Plum, Minnie the Minx, The Bash Street Kids, and The Three Bears.", "link_mentions": [{"page": "October 27", "response": ["*1930 – Leo Baxendale, English cartoonist (d. 2017)"]}, {"page": "The Bash Street Kids", "response": ["The Bash Street Kids is a comic strip in the British comic book The Beano. It also appeared briefly in The Wizard as series of prose stories in 1955.  The strip, created by Leo Baxendale as When the Bell Rings, first appeared in issue 604 (dated February 1954). It became The Bash Street Kids in 1956 and has become a regular feature, appearing in every issue. Since 1961, David Sutherland has drawn about 2,100 strips.", "Like many long-running UK comic strips, The Bash Street Kids is frozen in the era when it began. It portrays Class 2B of the Bash Street School in Beanotown, where the teacher and headmaster wear mortarboards and gowns and the students sit at wood desks with inkwells. They are taught by a stereotypical \"Teacher\", whose wife is \"Mrs Teacher\". The characters were inspired by the view from the D. C. Thomson & Co. office windows, overlooking the High School of Dundee playground. According to Leo Baxendale, \"In fact, the catalyst for my creation of Bash Street was a Giles cartoon of January 1953: kids pouring out of school, heads flying off and sundry mayhems. Straight away, I pencilled a drawing of 'The Kids of Bash Street School' and posted it from my home in Preston to R. D. Low, the managing editor of D.C. Thomson's children's publications in Dundee. I received an offhand response, a dampener. It was only after I'd created Little Plum (April 1953) and Minnie the Minx (September 1953) that the Beano editor George Moonie travelled to Preston on 20 October 1953 and asked me to go ahead with Bash Street (he gave it the provisional title of 'When The Bell Goes'; when it appeared in The Beano in February 1954, it was titled 'When The Bell Rings').\" Over time, the Bash Street School's large number of students slowly shrank to its trademark ten. When they first appeared, the strips consisted of the kids outside school; the settings were increasingly inside the school, and the strip was retitled The Bash Street Kids on 11 November 1956 with \"the kids\" preparing for a pantomime.edition of 11 November 1956", "Leo Baxendale drew the strip until 1962, when David Sutherland replaced him. Sutherland originally used a similar drawing style to Baxendale's, simplifying it later in the decade. He has drawn most of the strips since then, except from 1998 to 2000 (when Nigel Parkinson took over the strip in a style similar to that of David Parkins in Dennis the Menace.) The strips have had a closely connected visual style since the early 1970s, when Sutherland began drawing them both. Although he was apparently easing into semi-retirement, Parkinson moved to Dennis the Menace in 2000 and Sutherland returned."]}, {"page": "Preston, Lancashire", "response": ["* Leo Baxendale, who drew the comic characters Dennis the Menace, the Bash Street Kids and Minnie the Minx for The Beano."]}, {"page": "The Beezer", "response": ["*Leo Baxendale"]}, {"page": "List of fictional bears", "response": ["| Leo Baxendale"]}, {"page": "Minnie the Minx", "response": ["Minnie the Minx is a British comic strip and comic strip character published in the comic magazine The Beano. Created and originally drawn by Leo Baxendale, she first appeared in issue 596, dated 19 December 1953, making her the third longest running Beano character behind Dennis the Menace and Roger the Dodger.  Minnie is generally considered to be permanently 13 years of age.", "===Leo Baxendale strips (1953–1962)===", "Minnie the Minx, created and drawn by Leo Baxendale, first appeared in The Beano in December 1953. Her first strip introduced her as \"wild as wild can be\" and showed her exasperated mother attempting to get her to be more creative rather than fight. Taking a book, Minnie then proceeds to beat her classmates during a revenge scheme using the scrapbook as a weapon. The closing panel shows her thanking her mother for the scrapbook stating she has \"won nine scraps with it.\" Most of Minnie's earlier strips consisted of six-panel boxes; however, as her popularity grew, it quickly became more plausible to give Minnie her own full page with added colour. This introduced her trademark flaming red hair and red and black jersey.Minnie the Minx . The Beano. Like many other Beano stars at the time, many of her later strips showed Minnie to get her comeuppance towards the end be it a cane, slipper or simply a case of karma. Minnie also appeared alongside Dennis the Menace in his own strip in the edition of 23 January 1954 of The Beano. In the strip, she swapped toys with Dennis for the day as she received his trusty catapult and he proceeded to 'menace' with her doll's pram. In the end, she got out of trouble scot free whilst Dennis had to suffer for all her minxing. It was possibly this that began their future eternal rivalry.", "By 2007, Minnie was struggling in the readers' poll, and in early 2008 several significant changes were made in response to this. Iain McLaughlin took over as writer, and in Beano issue 3422, dated 15 March 2008, former Desperate Dan artist Ken Harrison took over as the strip's artist. Harrison re-introduced many aspects of Leo Baxendale's original depiction of the character and reverted her jumper to its original colours. However, the style of writing changed, with McLaughlin placing greater emphasis on the relationship between Minnie and her Dad. Some minor changes were made to her appearances, with her standard brown or grey school shoes replaced with the more modern trainers. A new tagline was introduced, citing Minnie as the World's Wildest Tom Boy, similar to Dennis the Menace's original tagline of being the World's Wildest Boy. Minnie's Teacher also became a regular character during this time, and Minnie now attends what appears to be an all-girls school. The changes reinvigorated the strip as Minnie soon returned to a top four position in the poll."]}, {"page": "Little Plum", "response": ["Little Plum (full name revealed to be Little Plum Stealing VarmintBeano Annual 1994) is a British humoristic western comics series about a little Native American, originally created by Leo Baxendale and published in the magazine The Beano.", "Leo Baxendale created Little Plum in 1953 as a puny cartoon character in a dangerous cartoon world.Leo Baxendale recollections It first appeared in issue 586, dated 10 October 1953. The comic strip employed a caricature of English language spoken by American Indians, notably replacing the word \"the\" with \"um\". Baxendale dreamed him up claiming he was a mixture of Hiawatha and Dennis the Menace and gave him into the editing team. Unsure of the name, Baxendale gave it in to the then Beano editor under the working title 'Booster' before the strip was officially titled 'Little Plum, Your Redskin Chum' .History of the Beano: The Story So Far... They consisted of Plum, a ten-year-old member of the Smellyfoot tribe and the misadventures he got up to trying to prove himself a valuable member. After Baxendale left The Beano in 1962, Robert Nixon drew a few strips before Ron Spencer took over that same year. The strip originally finished in 1986, but it continued to appear in the Beano annuals up to 1994, and reappeared for a short time in 1998 under the name 'The Legend of Little Plum', drawn by Tom Paterson."]}, {"page": "Lord Snooty", "response": ["Lord Snooty would go through two notable hiatuses where reprints would fill the issues. Upon return, Snooty's friends were replaced with new characters, some from discontinued Beano strips. Watkins stopped working on the series after issue 690 and would not return until 904, being replaced by Leo Baxendale, but Watkins' production would still be sporadic with the large story reprints-gap in the early 1960s. In 1968, Robert Nixon became the new creator, followed by Jimmy Glen from 1973 and Ken H. Harrison in 1988. Harrison's last story would appear in 1991 in issue 2565, making Lord Snooty the last series from the first issue to feature in The Beano."]}, {"page": "The Three Bears (comic strip)", "response": ["It made its first appearance in issue 881, drawn by Leo Baxendale at first and then by Bob McGrath for most of its run."]}, {"page": "Stroud", "response": ["*Leo Baxendale, creator of Minnie the Minx, lived nearby"]}, {"page": "Broughty Ferry", "response": ["Sportspeople that have associations with Broughty Ferry include international footballers Frank Munro and Peter Lorimer and the former Scottish international rugby union captain Sir George Cunningham. Other notable individuals with connections to Broughty Ferry include the minister and scientist Thomas Dick,  the Victoria Cross recipient Hugh Malcolm, the administrator of Dr. Elsie Inglis's Scottish Women's Hospitals in Serbia, World War I, suffragist leader of women's civic groups in Dundee, Mary H. J. Henderson, and the cartoonists Dudley D. Watkins and Leo Baxendale. The latter also worked for DC Thomson. From 1955 until around 1964 he lived at 15 Davidson Street.Registers of Scotland, General Register of Saisines, County of Angus. Book 2690, Folio 53, dated 14 March 1957"]}]}}