{"wiki_id": "http://www.wikidata.org/entity/Q55604477", "itemLabel": "Audrey Williamson", "itemDescription": "theatre critic", "wikipedia_url": "https://en.wikipedia.org/wiki/Audrey_Williamson_(critic)", "wikipedia_page": {"main": "Audrey May Williamson (29 May 1913, Thornton Heath – March 1986) was a British historical writer and \"one of the most prolific theatre journalists of her time\".", "link_mentions": [{"page": "Michael Hordern", "response": ["By the 1950s Hordern had come to the notice of many influential directors. In his autobiography, the actor recognised the decade as being an important era of his career. It started with a major role in Anton Chekhov's Ivanov in 1950. The production took place at the Arts Theatre in Cambridge and excited audiences because of its 25-year absence from the English stage. The writer T. C. Worsley was impressed by Hordern's performance and wrote: \"Perhaps an actor with star quality might have imposed on us more successfully than Mr Michael Hordern, and won our sympathy for Ivanov by his own personality. But such a performance would have raised the level of expectation all round. As it is, Mr Hordern is rich in intelligence, sensitivity and grasp, and with very few exceptions, the company give his impressive playing the right kind of support.\"T. C. Worsley; quoted in Hordern, pp. 88–89. The title character in Macbeth, directed by Alec Clunes, was Hordern's next engagement. Critics wrote of their dislike of Clunes's version, but the theatre reviewer Audrey Williamson singled out Hordern's performance as being \"deeply moving\".Audrey Williamson; quoted in Hordern, p. 89."]}, {"page": "Julia Farron", "response": ["The following year in 1937, she danced her first created role, Pepe the Dog, in the ballet A Wedding Bouquet choreographed by Sir Frederick Ashton.  Farron would stay with the company throughout its development into The Royal Ballet, eventually achieving the rank of principal dancer. In early 1947 Julia danced, alongside Harold Turner, the Neapolitan Tarantella in La Boutique Fantasque  . A respected critic of the time, Audrey Williamson, noted \"the bright attack and style that distinguish all her work\".Ballet Renaissance, Audrey Williamson, London Golden Gallery Press, 1948. After retiring from the professional stage, she was appointed as a teacher at the Royal Ballet School in 1964.  She was appointed assistant director of the Royal Academy of Dance in 1982, becoming Director in 1983. and eventually retired in 1989, with an honorary life fellowship of the organisation (FRAD).  In 1994, the Royal Academy of Dance awarded her the Queen Elizabeth II Coronation Award for outstanding services to ballet.  Most recently, she has sponsored the redevelopment of the White Lodge Museum and Ballet Resource Centre.Royal Ballet School website Arts Autographs website"]}, {"page": "The Burning Glass", "response": ["The Burning Glass opened at the Apollo Theatre in London's West End on 18 February 1954 and was a success. The production was directed by Michael Macowan with a cast including Michael Goodliffe, Dorothy Green, Faith Brook, Michael Gough, Robert Speaight, Basil Dignam, and Laurence Naismith. Ludovic Kennedy wrote of the play \"Charles Morgan has written the play, not only of the year, but of the decade in which we live\". Audrey Williamson wrote that \"The plot... involves... a battle of will and conscience, as gripping as any scene of action, between the Prime Minister and the scientist\" and \"It is a play, with good acting, to fire the stage. And this, at the Apollo Theatre, it did\", although  \"Michael Gough [as Terriford's associate] gave a performance that all but dominated the play. Yet he is not the protagonist, and he should not so dominate. That is the play's weakness, not the actor's. But it is a weakness.\""]}, {"page": "Audrey May Williamson", "response": ["#REDIRECT Audrey Williamson (critic)"]}, {"page": "Audrey Williamson (theatre critic)", "response": ["#REDIRECT Audrey Williamson (critic)"]}]}}