{"wiki_id": "http://www.wikidata.org/entity/Q5569336", "itemLabel": "John L. Bell", "itemDescription": "British hymnwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/John_L._Bell", "wikipedia_page": {"main": "John Lamberton Bell (born 1949) is a Scottish hymn-writer and Church of Scotland minister. He is a member of the Iona Community, a broadcaster, and former student activist. He works throughout the world, lecturing in theological colleges in the UK, Canada and the United States, but is primarily concerned with the renewal of congregational worship at the grass roots level.", "link_mentions": [{"page": "Iona Community", "response": ["The community's publishing group, Wild Goose Publications, produces books on social justice, political and peace issues, holistic spirituality, healing, and innovative approaches to worship, including music (books, tapes, CDs), short drama scripts and material for personal reflection and group discussion. Many of these are the work of John L. Bell and the Wild Goose Resource Group."]}, {"page": "John Bell", "response": ["*John L. Bell (born 1949), Scottish religious leader, musician, and composer"]}, {"page": "Be Thou My Vision", "response": ["Three more 20th century hymns have been set to the same tune. The first was \"Lord of All Hopefulness\" written by Jan Struther around 1931. The second was \"Lord of Creation, to Thee be All Praise\" written by J. C. Winslow and first published in 1961. The third was a popular wedding hymn, \"God, In the Planning and Purpose of Life\", written by John L. Bell and Graham Maule and first appearing in publication in 1989."]}, {"page": "Rector of the University of Glasgow", "response": ["|1977–1980 || John L. Bell  ||  || Elected while a student at the University"]}, {"page": "John Lamberton Bell", "response": ["#REDIRECT John L. Bell"]}, {"page": "Thought for the Day", "response": ["Other contributors include Anne Atkins, John L. Bell (Iona Community), Rhidian Brook, Tom Butler (former Bishop of Southwark), Canon Giles Fraser (Inclusive Church founder), Richard Lord Harries of Pentregarth, James Jones (former Bishop of Liverpool), Mona Siddiqui (Muslim professor), Michael Banner (ethicist), Indarjit Lord Singh of Wimbledon (Sikh parliamentarian), Jasvir Singh and Canon Angela Tilby.", "* Reverend John L. Bell of the Iona Community"]}, {"page": "Hymnbooks of the Church of Scotland", "response": ["*items of the Wild Goose Resource Group of the Iona Community worship (21 of which were composed by John L. Bell, who chaired the supplement committee).", "In 1994 the General Assembly of the Church of Scotland appointed a committee to revise the hymnary; the convener was again John L. Bell. After consultation and protracted difficulties in obtaining copyright for some hymns, CH4 appeared in May 2005. It is published by the Canterbury Press (Norwich) and contains 825 items. In the spirit of Songs of God's People it continues the quest for diversity. For the first time a hymn book which was not specifically produced for the Gaelic community contains a hymn in Gaelic, the christmas carol \"Leanabh an àigh\", for which the original text now appears in parallel to the translation \"Child in a manger\". Many hymns have been modified to incorporate 'inclusive language'. For example, \"He gave me eyes so I could see\", has been rewritten as \"God gave me eyes so I could see\" (Hymn 164). The feminist theology of the Motherhood of God is represented in \"Mothering God\" (Hymn 117). However, the temptation to reword such as \"thy\" to \"your\" has been resisted for old favourites, so, for example,  \"Great is thy faithfulness\" remains untouched."]}, {"page": "Community of Christ International Peace Award", "response": ["|John L. Bell"]}, {"page": "Kilmarnock Academy", "response": ["* John L. Bell, contemporary hymnwriter and speaker"]}, {"page": "Bell (surname)", "response": ["**John L. Bell, Scottish religious figure"]}, {"page": "Psalm 137", "response": ["The psalm has been set to music by many composers. Many settings omit the last verse. The hymnwriter John L. Bell comments alongside his own setting of this Psalm: \"The final verse is omitted in this metricization, because its seemingly outrageous curse is better dealt with in preaching or group conversation. It should not be forgotten, especially by those who have never known exile, dispossession or the rape of people and land.\""]}, {"page": "Hymns Ancient and Modern", "response": ["In March 2013 Canterbury Press published Ancient and Modern, so reverting to the original title without the word \"Hymns\", but also subtitled Hymns and Songs for Refreshing Worship, a brand new edition designed for contemporary patterns of worship. It contains 847 items, including some items from Common Praise and Sing Praise, ranging from psalm settings to John L. Bell, Bernadette Farrell, Stuart Townend and others. In 2014 the British organist John Keys completed recordings of organ accompaniments of all the hymns in the book."]}, {"page": "Together in Song", "response": ["The collection of hymns is intentionally international with material drawn from 48 countries. The addition of new songs has broadened the range of musical styles represented, spanning from plainsong to worship songs composed at Hillsong. The most represented hymnwriter is Charles Wesley with 41 hymns, while contemporary hymnwriters like Brian Wren has 24 hymns included, John L. Bell has 27 and Shirley E. Murray has 5. In some circumstances, where the editorial committee could not find a song that adequately fulfilled a need they wrote their own such as Shirley Ludgater's hymn about marriage as an act of creation: \"When the light of first creation\"."]}, {"page": "Category talk:Ancient Christian denominations", "response": ["John L. Bellnot yet classified"]}, {"page": "John L. Bell (minister)", "response": ["#REDIRECT John L. Bell"]}, {"page": "Living the Questions", "response": ["* John L. Bell", "* Singing the Unsung with John L. Bell"]}, {"page": "Singing the Faith", "response": ["Out of the 748 hymns and songs in the collection, 89 were written by Charles Wesley (1707–88), one of the founders of Methodism. The most represented hymnwriter of the 20th and 21st centuries is John L. Bell (b. 1949), who has 43 hymns included."]}, {"page": "Ruth Hunt, Baroness Hunt of Bethnal Green", "response": ["Hunt edited The Book of Queer Prophets, a collection of essays on sexuality and religion to be published in May 2020. The book includes essays by Jeanette Winterson, Phyll Opoku-Gyimah, John L. Bell, and others."]}, {"page": "The Summons (hymn)", "response": ["\"The Summons\", also called \"Will You Come and Follow Me\", is a Scottish Christian hymn. It was written by John L. Bell in 1987."]}, {"page": "Open Table Network", "response": ["Starting November 2020, new patrons of the Open Table Network introduced themselves on webinars. The new patrons are: Rachel Mann, John Bradbury, Bishop Cherry Vann, Pádraig Ó Tuama, Bishop Paul Bayes, John L. Bell, and Barbara Glasson."]}]}}