{"wiki_id": "http://www.wikidata.org/entity/Q5564436", "itemLabel": "Jim Baker", "itemDescription": "English footballer (1891-1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jim_Baker_(footballer)", "wikipedia_page": {"main": "James William Baker (15 November 1891 – 13 December 1966) was a professional footballer most notable for being the first captain of Leeds United  He was the brother of Alf Baker who played for Arsenal. Another brother Aaron Baker also played football professionally and briefly played for Leeds.\nJim was born in Ilkeston and started his career at Hartlepool United, and played at Portsmouth before moving to Huddersfield Town, where he played under future Leeds manager Arthur Fairclough. When Fairclough moved to the newly formed Leeds United F.C. to become its first manager, Jim followed him and was handed the captain's armband to command from the center of defence. Jim played for six seasons at Elland Road being captain for the whole period, and even helped Fairclough guide the team to their first silverware and Second Division championship in 1923–24, being a rock at the heart of the Leeds defence along with Ernie Hart. Jim left Leeds after two seasons of just surviving in the First Division at the end of the 1925–26 season, moving to Nelson.\nHe served on the Board of Directors for Leeds United between 1959 and 1961.", "link_mentions": [{"page": "James Baker (disambiguation)", "response": ["* Jim Baker (politician) (fl. 2000s–2010s), Canadian legislator from Labrador West in Newfoundland/Labrador House of Assembly", "* Jim Baker (footballer) (1891–1966), English professional centre back during the 1910s and 1920s for Leeds United A.F.C.", "* Jim Baker (bowls) (born 1958), Northern Irish and combined Irish lawn and indoor bowls player", "* Jim Baker (frontiersman) (1818–1898), American trapper, scout and guide", "* A. J. Baker or Jim Baker (1922–2017), Australian philosopher"]}, {"page": "Alf Baker", "response": ["His brother Jim Baker was also a footballer who played for Leeds United."]}, {"page": "History of Leeds United F.C.", "response": ["Leeds' first fixture after their election to the league was against Port Vale, the club who had taken up Leeds City's fixtures following their expulsion. Leeds lost the game 2–0, but seven days later recorded their first victory in the corresponding fixture at Elland Road, which ended Leeds United 3 Port Vale 1.  However, Leeds made little impact in 1920–21, their first season, eventually finishing 14th. Following seasons saw them consolidate their position in the league, finishing 8th in 1921–22 and 7th in 1922–23, before winning the Second Division Championship in 1923–24 with 54 points. The championship winning team was a strong one, with Jim Baker, Bert Duffield and Ernie Hart featuring prominently."]}, {"page": "List of Leeds United F.C. players", "response": ["thumb|right|135px|Jim Baker was the first ever captain of Leeds United and led the club to the 1923–24 second division championship.", "|1920||1926||Jim Baker||||"]}, {"page": "1919–20 Huddersfield Town A.F.C. season", "response": ["|Jim Baker||||DF||19||3||0||0||19||3"]}, {"page": "1914–15 Huddersfield Town A.F.C. season", "response": ["|Jim Baker||||DF||37||0||1||0||38||0"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Jim Baker||||1914–1920||56||3||1||0||0||0||0||0||0||0||57||3"]}, {"page": "Ambrose Harris", "response": ["Harris lost his first-team place to new signing Jim Baker at the start of the next campaign, but was reinstated to the side following the 1–4 loss away at Stoke City on 11 September 1926. He played at inside forward for the first time in the away match against Lincoln City on 9 October, and scored his first professional goal in a 4–1 Nelson win.Dykes, p. 80 Harris remained with Nelson until the end of the 1927–28 season, when he left the club after playing a total of 58 first-team matches during his four years at Seedhill. He signed for non-league outfit Barnoldswick Town in the summer of 1928. Harris played three seasons with the team before joining Brierfield Central at the start of the 1931–32 campaign, where he ended his career some time later."]}, {"page": "1926–27 Nelson F.C. season", "response": ["|align=\"left\"|Jim Baker"]}, {"page": "Deaths in December 1966", "response": ["* Jim Baker, English footballer (b. 1891)"]}]}}