{"wiki_id": "http://www.wikidata.org/entity/Q556343", "itemLabel": "David Greene", "itemDescription": "Director, actor (1921-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Greene_(director)", "wikipedia_page": {"main": "Lucius David Syms-Greene (born Lucius David Syms Brian Lederman; 22 February 1921 – 7 April 2003), known as David Greene, was a British television and film director, and actor.", "link_mentions": [{"page": "April 7", "response": ["*  2003   – David Greene, English-American actor, director, producer, and screenwriter (b. 1921)"]}, {"page": "What Ever Happened to Baby Jane? (novel)", "response": ["What Ever Happened to... is a 1991 American TV movie directed by David Greene and adapted for the small screen by Brian Taggert, based on the novel What Ever Happened to Baby Jane? by Henry Farrell and the 1962 theatrical film of the same name. It stars real-life sisters Lynn Redgrave as Baby Jane Hudson and Vanessa Redgrave as Blanche Hudson in the roles previously played by Bette Davis and Joan Crawford in the 1962 adaptation."]}, {"page": "The Count of Monte Cristo", "response": ["* 1975: The Count of Monte Cristo, TV film starring Richard Chamberlain, directed by David Greene"]}, {"page": "1997 in film", "response": ["| Bella Mafia || CBS / The Königsberg Company || David Greene (director); Lynda La Plante (screenplay); Dennis Farina, Vanessa Redgrave, Nastassja Kinski, Jennifer Tilly, Illeana Douglas, James Marsden, Gina Philips, Richard Portnow, Franco Nero, Peter Bogdanovich, Carmen Argenziano, David O'Donnell, Michael Hayden, Richard Joseph Paul, W. Earl Brown, Tony Maggio, Tomas Arana, Christopher Shaw, Michael Raynor, Dimitra Arliss, Paul Eckstein, Tony Lo Bianco || Drama || Live action"]}, {"page": "1984 in film", "response": ["| Fatal Vision || NBC Productions || David Greene (director); John Gay (screenplay); Gary Cole, Karl Malden, Eva Marie Saint, Barry Newman, Wendy Schaal, Andy Griffith, Judith Barsi, Gary Grubbs, Joel Polis, Mitchell Ryan, Scott Paulin, Barry Corbin, Albert Salmi, Paddi Edwards, Carmen Argenziano, Nadine van der Velde, Laurence Haddon, Kenneth Tigar, Roy London, Robert Clotworthy, Steve James, Richard Lineback, James Morrison, Paul Ryan, Miguel Sandoval, Brian Thompson || Crime, Drama, History || Live action"]}, {"page": "1977 in film", "response": ["| Roots || ABC / Warner Bros. Television / Wolper Productions || Marvin J. Chomsky, John Erman, David Greene, Gilbert Moses (directors); Alex Haley, James Lee (screenplay); John Amos, Ben Vereen, LeVar Burton, Louis Gossett Jr., Leslie Uggams, Georg Stanford Brown, Olivia Cole,  Vic Morrow, Ji-Tu Cumbuka, Edward Asner, Lynda Day George, Robert Reed, Madge Sinclair, Chuck Connors, Sandy Duncan, Carolyn Jones, Lloyd Bridges, Brad Davis, Lane Bickley, Hilly Hicks, Lynne Moody, Austin Stoker, Ralph Waite, Cicely Tyson, Thalmus Rasulala, Moses Gunn, Hari Rhodes, Ren Woods, Ernest Lee Thomas, Lorne Greene, Scatman Crothers, George Hamilton, Lillian Randolph, Roxie Roker, Richard Roundtree, Thayer David, Tanya Boyd, John Quade, Maya Angelou, O.J. Simpson, Beverly Todd, Paul Shenar, Gary Collins, Richard Farnsworth, Raymond St. Jacques, Lawrence Hilton-Jacobs, John Schuck, Macdonald Carey, Ian McShane, Doug McClure, Burl Ives, Richard McKenzie, Sally Kemp, William C. Watson, Charles Cyphers, Macon McCalman, Brion James, Tracey Gold, Todd Bridges, Ross Chapman, Grand L. Bush || Drama || Live Action  "]}, {"page": "James Hewitt", "response": ["Some years later, after he had left the army, Anna Pasternak published the book Princess in Love in 1994. Hewitt was a major source, and it alleged that he had a five-year affair with Diana, Princess of Wales from 1986 to 1991.Diss and Tell, People (magazine), 17 October 1994 Diana confirmed the affair in her 1995 Panorama interview. The following year, the film Princess in Love by David Greene was released, based on the book, with Julie Cox and Christopher Villiers playing the lead roles."]}, {"page": "1921 in the United Kingdom", "response": ["* 22 February – David Greene, actor and film director (died 2003)"]}, {"page": "Roots (1977 miniseries)", "response": ["The miniseries was directed by Marvin J. Chomsky, John Erman, David Greene, and Gilbert Moses. It was produced by Stan Margulies. David L. Wolper was executive producer. The score was composed by Gerald Fried, and Quincy Jones for only the first episode. ABC television executives \"got cold feet\" after seeing the brutality depicted in the series and attempted to cut the network's predicted losses by airing the series over eight consecutive nights in January in one fell swoop. The Museum of Broadcast Communications recounts the apprehensions that Roots would flop, and how this made ABC prepare the format:", "| David Greene "]}, {"page": "John-Michael Tebelak", "response": ["Tebelak directed the Broadway play Elizabeth I in 1972, the off-Broadway play The Glorious One in 1975, and Ka-Boom! in 1980. He also directed Lope de Vega's Fuenteovejuna in Madrid in 1975. He co-wrote the 1973 film version of Godspell with David Greene."]}, {"page": "The Wooden Horse", "response": ["* David Greene as Bennett"]}, {"page": "World War III (miniseries)", "response": ["Director Boris Sagal was killed in a helicopter accident in Oregon during the early stages of production. He was replaced by David Greene."]}, {"page": "What Ever Happened to...", "response": ["What Ever Happened to... (also known as What Ever Happened to Baby Jane...?) is a 1991 American made-for-television thriller film directed by David Greene and adapted for the small screen by Brian Taggert. It is based on the 1960 novel What Ever Happened to Baby Jane? by Henry Farrell and the 1962 theatrical film of the same name. It stars real-life sisters Lynn Redgrave as Baby Jane Hudson and Vanessa Redgrave as Blanche Hudson, in the roles previously played by Bette Davis and Joan Crawford in the 1962 adaptation.", "Category:Films directed by David Greene"]}, {"page": "Small Sacrifices", "response": ["Upon its broadcast, the film was met with wide acclaim. It scored three Emmy Award nominations, including Outstanding Comedy/Drama Special and Outstanding Lead Actress in a Miniseries or Special (Farrah Fawcett).Television Academy: The People Who Bring You the Emmys. (n.d.). Small Sacrifies. https://www.emmys.com/shows/small-sacrifices. Accessed 2021 April 23. It was also awarded a Peabody Award, which cited the high quality of Fawcett's performance: \"This terrifying true story, based on Ann Rule’s best-selling book, marked a high point in television drama for 1989. At the heart of the chilling tale of a mother’s mental illness and unthinking cruelty is the performance of Farrah Fawcett. With this portrayal, Farrah Fawcett has forever put to rest the image of her talents associated with Charlie’s Angels. Ably assisted by Ryan O’Neal, with exceptional writing by Joyce Eliason and direction by David Greene, Ms. Fawcett brings a sense of realism rarely seen in television miniseries. For a drama of unusual power, a Peabody Award to Small Sacrifices.\"Peabody: Stories That Matter. (n.d.). Small Sacrifices. http://www.peabodyawards.com/award-profile/small-sacrifices. Accessed 2021 April 23.", "Category:Films directed by David Greene"]}]}}