{"wiki_id": "http://www.wikidata.org/entity/Q55615227", "itemLabel": "John Patrick Campbell", "itemDescription": "Irish artist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Patrick_Campbell", "wikipedia_page": {"main": "John Patrick Campbell (1883–1962) was a Belfast born artist known for his illustrations in publications by members of the Gaelic League  published under the name Seaghan MacCathmhaoil. He was also involved in theatre and related productions. He emigrated to the United States in the early 1910s, and directed the 1913 \"Irish Historic Pageant\" in New York. His work as a published illustrator or artist seems to have ended by the 1920s.", "link_mentions": [{"page": "John Campbell", "response": ["* John Patrick Campbell, (1883–1962), Belfast artist and illustrator"]}, {"page": "Táin Bó Cúailnge", "response": ["*, with illustrations by John Patrick Campbell"]}, {"page": "Joseph Campbell (poet)", "response": ["*John Patrick Campbell, his brother"]}, {"page": "Seaghan MacCathmhaoil", "response": ["#redirect John Patrick Campbell"]}, {"page": "Mary Ann Hutton", "response": ["Hutton's largest contribution of Irish scholarship was her 1907 edition of the Táin Bó Cúailnge legend, The Táin: an Irish epic told in English verse, with scholarly appendices of lexical names and terms. This is a re-working of the legend using numerous sources rather than a literal translation, and took 10 years to complete. The work was well received, going on to be re-published in 1924 with Celtic revival style illustrations by John Patrick Campbell as Seaghan MacCathmhaoil."]}, {"page": "Francis Joseph Bigger", "response": ["Bigger financed Songs of Uladh by another of his visitors, Herbert Hughes. The book was published in 1904, the result of a holiday to Donegal taken by Bigger, who brought along Hughes and the two brothers John Patrick Campbell and Joseph Campbell. Hughes noted down the melodies of various folk songs during the holiday, which were then published in the Songs with words by Joseph and illustrative woodcuts by John."]}]}}