{"wiki_id": "http://www.wikidata.org/entity/Q55751275", "itemLabel": "Jean Purdy", "itemDescription": "UK IVF pioneer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jean_Purdy", "wikipedia_page": {"main": "Jean Marian Purdy (25 April 1945 – 16 March 1985) was a British nurse and embryologist and a pioneer of fertility treatment. Purdy was responsible with Robert Edwards and Patrick Steptoe for developing in vitro fertilisation. Louise Joy Brown, the first test-tube baby, was born on 25 July 1978, and Purdy was the first to see the embryonic cells dividing. Edwards was awarded the 2010 Nobel Prize in Physiology or Medicine for his work on the development of in vitro fertilisation; however, because the Nobel Prize is not awarded posthumously, neither Purdy nor Steptoe were eligible for consideration. Purdy was a co-founder of the Bourn Hall Clinic but her role there and in the development of IVF was ignored for 30 years.", "link_mentions": [{"page": "In vitro fertilisation", "response": ["In July 1978, Louise Brown was the first child successfully born after her mother received IVF treatment. Brown was born as a result of natural-cycle IVF, where no stimulation was made. The procedure took place at Dr Kershaw's Cottage Hospital (now Dr Kershaw's Hospice) in Royton, Oldham, England. Robert G. Edwards was awarded the Nobel Prize in Physiology or Medicine in 2010. The physiologist co-developed the treatment together with Patrick Steptoe and embryologist Jean Purdy but the latter two were not eligible for consideration as they had died and the Nobel Prize is not awarded posthumously.", "The first successful birth of a child after IVF treatment, Louise Brown, occurred in 1978. Louise Brown was born as a result of natural cycle IVF where no stimulation was made. The procedure took place at Dr Kershaw's Cottage Hospital (now Dr Kershaw's Hospice) in Royton, Oldham, England. Robert G. Edwards was awarded the Nobel Prize in Physiology or Medicine in 2010, the physiologist who co-developed the treatment together with Patrick Steptoe and embryologist Jean Purdy; Steptoe and Purdy were not eligible for consideration as the Nobel Prize is not awarded posthumously."]}, {"page": "Grantchester", "response": ["* Jean Purdy (1945-1985), embryologist and co-founder of the Bourn Hall Clinic with Patrick Steptoe and Robert Edwards"]}, {"page": "Louise Brown", "response": ["On 10 November 1977, Lesley Brown underwent a procedure, later to become known as in vitro fertilisation (IVF), developed by Patrick Steptoe, Robert Edwards and Jean Purdy. Purdy was the first to see her embryonic cells dividing. Edwards, as the only surviving partner, was awarded the 2010 Nobel Prize in Medicine for this work. Although the media referred to Brown as a \"test tube baby\", her conception actually took place in a Petri dish. Her younger sister, Natalie Brown, was also conceived through IVF four years later, and became the world's 40th child after conception by IVF. In May 1999, Natalie was the first human born after conception by IVF to give birth herself—without IVF."]}, {"page": "Patrick Steptoe", "response": ["Patrick Christopher Steptoe CBE FRS (9 June 1913 – 21 March 1988) was an English obstetrician and gynaecologist and a pioneer of fertility treatment. Steptoe was responsible with biologist and physiologist Robert Edwards and the nurse Jean Purdy for developing in vitro fertilisation. Louise Joy Brown, the first test-tube baby, was born on 25 July 1978. Edwards was awarded the 2010 Nobel Prize in Physiology or Medicine for his work on the development of in vitro fertilisation; Steptoe was not eligible for consideration because the Nobel Prize is not awarded posthumously.", "Steptoe became the Director of the Centre for Human Reproduction, Oldham, in 1969. Using laparoscopy, he collected the ova from volunteering infertile women who saw his place as their last hope to achieve a pregnancy. Edwards and  Jean Purdy provided the laboratory expertise. During this time they had to endure criticism and hostility to their work. Finally, in 1978, the birth of Louise Brown changed everything. Although he encountered further criticism, other clinics were able to follow the lead and patients responded. To accommodate the increased patient number and train specialists, he, Purdy, and Edwards founded the Bourn Hall Clinic, Cambridgeshire in 1980 of which Steptoe was a Medical Director until his death."]}, {"page": "Robert Edwards (physiologist)", "response": ["Sir Robert Geoffrey Edwards  (27 September 1925 – 10 April 2013) was a British physiologist and pioneer in reproductive medicine, and in-vitro fertilisation (IVF) in particular. Along with the surgeon Patrick Steptoe, and the nurse Jean Purdy, Edwards successfully pioneered conception through IVF, which led to the birth of Louise Brown on  1978. They founded the first IVF programme for infertile patients and trained other scientists in their techniques. Edwards was the founding editor-in-chief of Human Reproduction in 1986. In 2010, he was awarded the Nobel Prize in Physiology or Medicine \"for the development of in vitro fertilization\".", "The birth of Louise Brown, the world's first 'test-tube baby', at  on  1978 at the Oldham General Hospital made medical history: in vitro fertilisation meant a new way to help infertile couples who formerly had no possibility of having a baby.  Nurse Jean Purdy was the first to see Brown's embryo dividing."]}, {"page": "Long Road Sixth Form College", "response": ["*Jean Purdy, nurse and embryologist"]}, {"page": "Bourn Hall Clinic", "response": ["Bourn Hall Clinic was founded in 1980 by IVF pioneers Mr Patrick Steptoe, embryologist Jean Purdy and Professor Robert Edwards, who were responsible for the conception of Louise Brown, the world's first IVF or test-tube baby in 1977. Since its foundation the clinic has assisted in the conception of over 10,000 babies.", "A plaque was unveiled at the Clinic in July 2013 by Louise Brown and Alastair MacDonald - the world's first IVF baby boy - commemorating Steptoe and Edwards. The plaque missed out Jean Purdy who had been the person who chose Bourn Hall, was a co-founder of the clinic and an equal partner in developing IVF. In 2018, to mark the 40th anniversary of IVF, the clinic unveiled an additional memorial to Jean Purdy, the \"world's first IVF nurse and embryologist. Co-founder of Bourn Hall Clinic\"."]}, {"page": "History of in vitro fertilisation", "response": ["Robert Edwards was awarded the 2010 Nobel Prize in Physiology or Medicine \"for the development of in vitro fertilization\".  Steptoe and Jean Purdy were not eligible for consideration as the Nobel Prize is not awarded posthumously. Carl Wood was dubbed \"the father of IVF (in vitro fertilisation)\" for having pioneered the use of frozen embryos.Wood, Edwin Carlyle (1929 – ). Encyclopedia of Australian Science 2010"]}]}}