{"wiki_id": "http://www.wikidata.org/entity/Q5576973", "itemLabel": "Godwin Michelmore", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Godwin_Michelmore", "wikipedia_page": {"main": "Major-General Sir William Godwin Michelmore,  (14 March 1894 – 25 October 1982) was a senior British Army officer who served in both world wars and was later aide-de-camp to King George VI and Lord Mayor of Exeter.", "link_mentions": [{"page": "Devon and Cornwall County Division", "response": ["The Devon and Cornwall County Division was formed on 24 February 1941, consisting of the  203rd Independent Infantry Brigade (Home) under the command of Major-General Charles Allfrey. Three days later, Allfrey was assigned to the 43rd (Wessex) Infantry Division, and Major-General Frederick Morgan took his place. The following day, the division's headquarters was organised from staff previously assigned to South-West Area of Southern Command, and the 209th Independent Infantry Brigade (Home) and the 211th Independent Infantry Brigade (Home) joined the division. On 22 April, General Sir Alan Brooke, the Commander-in-Chief, Home Forces spent the day touring the division and watched several company-size exercises. At the end of October, Major-General Godwin Michelmore assumed command. The Imperial War Museum comments that the division insignia included \"the arms of the Duchy of Cornwall\" as well Arthur's sword Excalibur to acknowledge an association with the West Country.", "|Major-General Godwin Michelmore"]}, {"page": "Frederick E. Morgan", "response": ["The 1st Armoured Division was subsequently reformed, and became a mobile reserve in south eastern England. It was tasked with counter-attacking an invading German army, and Morgan's 1st Support Group was given two Canadian infantry battalions for this purpose. On 4 November 1940 Morgan was appointed Brigadier General Staff (BGS) at II Corps, based in Norfolk. Morgan was not there long, however, as on 28 February 1941 he was promoted to the acting rank of major-general and succeeded Major-General Charles Allfrey in command of the Devon and Cornwall County Division, a static formation created for coastal defence, lacking artillery, engineers and divisional troops. The division was serving in South West England in Devon and Cornwall under Lieutenant-General Harold Franklyn's VIII Corps. He was with the division for eight months before handing over to Major-General Godwin Michelmore on 30 October and succeeding Major-General William Morgan in command of the 55th (West Lancashire) Infantry Division, a first-line TA formation serving in Gloucestershire in Southern Command. The division, which moved to North Yorkshire under Northern Command in mid-December, was placed on the Lower Establishment the following month, losing much of its artillery, engineers and divisional troops and receiving a low priority for modern equipment. On 28 February, a year after being made an acting major-general, Morgan's rank of major-general was made temporary."]}, {"page": "45th Infantry Division (United Kingdom)", "response": ["During 1944, the British Army suffered a severe shortage of manpower. In an effort to downsize the army, while efficiently maintaining as many formations as possible at full strength, the War Office began disbanding divisions. As part of this restructure, the decision was made to retain division numbers familiar to the British public due to their potential recruiting value. As a result, the 77th (Holding) Division was disbanded. Its GOC Major-General Godwin Michelmore and his staff reformed the division as the 45th (Holding) Division on 1 September. As part of this re-establishment, the 45th Division's brigades were reformed. The 134th Brigade was reformed from the redesignation of the 203rd Infantry Brigade, and the 135th Brigade was recreated from the 209th Infantry Brigade. Lieutenant-Colonel H.F. Joslen wrote that the division's role was now \"for sorting, retraining and holding personnel temporarily – due to disbandments, medical and other causes.\" For example, the 14th Battalion, Durham Light Infantry maintained a rehabilitation centre. Ex-prisoners of war, repatriates, troops who were suffering from morale issues or of low physique were sent to the battalion where they underwent medical, physical, and military tests. These tests were designed to establish what medical category the soldiers should be assigned, and what job or military capability would best suit them.", "!scope=\"row\" |Major-General Godwin Michelmore"]}, {"page": "77th Infantry Division (United Kingdom)", "response": ["During the war, the divisions of the British Army were classified as either higher or lower establishment formations. The former were intended for deployment overseas and combat, whereas the latter were strictly for home defence in a static role. On 1 December 1941, the Devon and Cornwall County Division was abolished and reformed as the 77th Infantry Division, a lower establishment division. The division, like its predecessor, comprised the 203rd, the 209th, and the 211th Infantry Brigades. That day, the division was assigned artillery, engineers, and signallers. An anti-tank regiment and reconnaissance troops joined the following month. In 1944, the war-establishment's on-paper strength of an infantry division was 17,298 men. Major-General Godwin Michelmore, who had commanded the Devon and Cornwall County Division since 30 October, retained command of the division. The 77th was assigned to the VIII Corps, and remained based in the Devon area. According to the Imperial War Museum, the divisional insignia references \"Arthur's sword Excalibur, acknowledging the [division's] connections with the West Country\" and its predecessor division. After the division became a training formation, the insignia was only worn by the permanent division members."]}, {"page": "List of Old Rugbeians", "response": ["*Major-General Sir William Godwin Michelmore KBE, CB, DSO, MC, TD, commanded Devon and Cornwall County Division, 77th Infantry Division and 45th Holding Division during World War II; later Lord Mayor of Exeter"]}, {"page": "1953 Coronation Honours", "response": ["* Major-General William Godwin Michelmore  Chairman, Territorial and Auxiliary Forces Association of the County of Devon"]}, {"page": "1945 New Year Honours", "response": ["* Colonel (temporary Major-General) William Godwin Michelmore,  – (25379), Royal Corps of Signals, Territorial Army, Aide-de-Camp to The King."]}, {"page": "William Godwin Michelmore", "response": ["#REDIRECT Godwin Michelmore"]}, {"page": "Michelmore", "response": ["*Godwin Michelmore (1894–1982), British army officer"]}, {"page": "43 (Wessex) Signal Regiment", "response": ["In 1920 the RE Signal Service became the independent Royal Corps of Signals (RCS). The 43rd (Wessex) Divisional Signals reformed at The Priory, The Friars, Exeter, in the Territorial Army (TA), which replaced the TF in 1921. The unit was commanded by Major (later Lt-Col) Godwin Michelmore, and recruited from Exeter, Plymouth, Southampton and Salisbury. It also administered a number of other TA signal units in its divisional area:Lord & Watson, p. 244.", "As the war progressed, the main role of the lower-establishment formations became supplying reinforcements to the fighting formations. Notably, 45th (West Country) Divisional Signals also supplied signal sections to Beach Groups that played a vital role in the assault landings at Salerno (Operation Avalanche) and in Normandy. By August 1944 the drain of supplying reinforcements to 21st Army Group fighting in Normandy had so reduced 45th Division that it was broken up: 45th (WC) Divisional Signals was disbanded on 30 August 1944.Lord & Watson, p. 249. The existing 77th (Holding) Division was redesignated 45th (Holding) Division and its signal unit was similarly renumbered. Coincidentally, 77th/45th (Holding) Division was commanded by a TA officer, Maj-Gen Godwin Michelmore, who had been 43rd (Wessex) Divisional Signals' first CO in 1920."]}]}}