{"wiki_id": "http://www.wikidata.org/entity/Q55767439", "itemLabel": "Natasha Gordon", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Natasha_Gordon", "wikipedia_page": {"main": "Natasha Delia Letitia Gordon  (born 1976) is a British playwright of Jamaican heritage. In 2018, having previously been an actor, she became the first black British female playwright to have a play staged in the West End.", "link_mentions": [{"page": "Royal National Theatre", "response": ["* Nine Night by Natasha Gordon, directed by Roy Alexander Weise, starring Cecilia Noble (2018)"]}, {"page": "Evening Standard Theatre Awards", "response": ["* 2018 – Natasha Gordon for Nine Night"]}, {"page": "Critics' Circle Theatre Award", "response": ["|Natasha Gordon"]}, {"page": "Richard Vincent (playwright)", "response": ["It was directed by Ted Craig and designed by Isla Shaw, with the following cast: Rae Baker [Chloe Smith], Frank Ellis [Sgt. Bill Cowgate], Colin Wells [Michael], Natasha Gordon [Dr. Amanda Holland], Simon Greiff [PC Gibbons/Simon Cairns], Penelope Woodman [Steph Cowgate]."]}, {"page": "List of EastEnders characters (2007)", "response": ["Tomas Covalenco (Ukrainian: Томас Коваленко) is a baby that is abandoned on 9 April 2007 by his mother, Anya (Olga Fedori) in a church in Kent, and found by Dot Branning (June Brown). Dot leaves her address on a notice board in the church, and Anya arrives in Walford to collect Tomas on 10 April. She is later arrested by immigration officials Warren Rice (Ewan Bailey) and Paul Jenkins (Simon Quarterman) for being an illegal immigrant, but she doesn't tell them she has a baby, leaving him with Dot and her husband Jim (John Bardon). Jim later tells his family that Tomas is the product of an affair between Dot's son Nick Cotton (John Altman) and a prison nurse with no maternal instincts. He is then known as George Merton, until Dot is persuaded by Reverend Stevens (Michael Keating) and her oldest friend, Harold Legg (Leonard Fenton) to tell Social Services that she has him. He is collected on 8 June by social worker Natasha Powell (Natasha Gordon)."]}, {"page": "Mark Donne", "response": ["In November 2021, Donne co-produced and directed the conceptual “Eightfold” in collaboration with black and Asian company Ballet Black. The experiential eight film suite of work features a script from playwright Natasha Gordon and narration from actor Thandiwe Newton, as well as new choreography from eight international choreographers. The films were acquired and broadcast by Channel 4 and are presently streaming on ALL4."]}, {"page": "Laurence Olivier Award for Best New Comedy", "response": ["|Natasha Gordon"]}, {"page": "Class (2016 TV series)", "response": ["* Natasha Gordon as Vivian Adeola, Tanya's overprotective mother"]}, {"page": "Nine Night", "response": ["Nine Night is a 2018 play by Natasha Gordon. It focuses on the traditional Jamaican Nine nights, as a family struggles with their loss.", "Nine Night had its world premiere production at Dorfman Theatre beginning on 21 April 2018, playing a limited run to 21 May. The production transferred to the West End, beginning previews at Trafalgar Studios on 1 December 2018 prior to opening night on 6 December. Playwright Natasha Gordon stepped into the role of Lorraine. The production played a limited run to 23 February.", "The play received generally positive reviews. Paul Taylor for The Independent states \"Natasha Gordon's debut play buzzes with comic energy...The piece generates a fantastic atmosphere of inclusion. Natasha Gordon is an actress, but I have no doubt that from now on, we will be hearing a lot more from her as a dramatist.\" In a five star review for the Evening Standard, Henry Hitchings states \"Right now there’s probably no funnier performance in town than Cecilia Noble as Aunt Maggie, the clucking matriarch in Natasha Gordon’s richly enjoyable family drama.\"", "|Natasha Gordon", "|Natasha Gordon"]}, {"page": "2019 Laurence Olivier Awards", "response": ["**Nine Night by Natasha Gordon – National Theatre Dorfman and Trafalgar Studios 1"]}, {"page": "64th Evening Standard Theatre Awards", "response": ["* Natasha Gordon, Nine Night, National Theatre"]}]}}