{"wiki_id": "http://www.wikidata.org/entity/Q5576380", "itemLabel": "Godfrey Benson, 1st Baron Charnwood", "itemDescription": "British politician (1864-1945)", "wikipedia_url": "https://en.wikipedia.org/wiki/Godfrey_Benson,_1st_Baron_Charnwood", "wikipedia_page": {"main": "Godfrey Rathbone Benson, 1st Baron Charnwood (6 November 1864 – 3 February 1945), was an English author, academic, Liberal politician and philanthropist.\nBenson was born in Alresford, Hampshire, the fourth son of William Benson, a barrister, and Elizabeth Soulsby Smith. The actor-manager Sir Frank Benson and the designer William Arthur Smith Benson were his brothers. He was educated at Winchester and Balliol College, Oxford, graduating in 1887 with a First in literae humaniores, and would later become a Philosophy lecturer at Balliol. He was called to the bar by the Inner Temple in 1898.\nBenson was involved in Liberal politics and represented Woodstock in the House of Commons from 1892 to 1895, when he was defeated. He then unsuccessfully stood in St. Pancras West in 1900 and Worcestershire West in 1906. He served as Mayor of Lichfield between 1909 and 1911. In the latter year Benson was raised to the peerage as Baron Charnwood, of Castle Donington in the County of Leicester.\nLord Charnwood was the author of many works, including two biographies, the much-acclaimed Abraham Lincoln (1916) and Theodore Roosevelt (1923), and a detective novel, Tracks in the Snow (1906), which was reviewed in The Bookman He also wrote a useful look into early modern Biblical criticism trends, and presented his own viewpoints in According To Saint John, which he dedicated to George Ridding. He was also involved in charitable work with the deaf and disabled, becoming the first President of the National Institute for the Deaf from 1924 until 1935.\nOn 25 December 1934, Lord Charnwood gave a speech about the Holodomor (the famine in Ukraine) at the debates in Brtitish parliament.  His speech was based on the information he received from Theodor Innitzer, Cardinal Archbishop of Vienna, and British journalists William Henry Chamberlin and Malcolm Muggeridge. He stressed the artificial nature of the Holodomor.He married Dorothea Mary Roby Thorpe, daughter of Roby Thorpe, in 1897. They had four children, including Hon. Eleanor Theodora Roby Benson, John Roby Benson (2nd Baron Charnwood) and Antonia Mary, Viscountess Radcliffe. Lady Charnwood died in 1942.\nCharnwood died in London in February 1945, aged 80, and was succeeded in the barony by his second but only surviving son, John.", "link_mentions": [{"page": "1923 in literature", "response": ["*Godfrey Benson, 1st Baron Charnwood – Theodore Roosevelt"]}, {"page": "Cyril Radcliffe, 1st Viscount Radcliffe", "response": ["Lord Radcliffe married Antonia Mary Roby, daughter of Godfrey Benson, 1st Baron Charnwood and former wife of John Tennant, in 1939. He died in April 1977, aged 78. He had no issue and the viscountcy of Radcliffe became extinct on his death."]}, {"page": "Charnwood", "response": ["** Godfrey Benson, 1st Baron Charnwood (1864–1945), British politician and biographer of Abraham Lincoln and Theodore Roosevelt; known as Lord Charnwood"]}, {"page": "Dorothea Mary Roby Benson, Baroness Charnwood", "response": ["#REDIRECT Godfrey Benson, 1st Baron Charnwood"]}, {"page": "Henry Joy Fynes-Clinton", "response": ["Fynes-Clinton was General Secretary of the Anglican and Eastern Orthodox Churches UnionFounded by Fynes-Clinton in concert with Canon J.A. Douglas and the Rev R.F. Borough - see A history of the ecumenical movement, Volume 1; Rouse R., Neill S. and Fey, H.E.: SPCK, 1970.  The Church Intelligencer (Volume 23, Issue 11, November 1906) expressed its concern in an article entitled A New Disorder in the Church – The Anglican and Eastern Orthodox Churches Union: \"Simultaneously with the appearance of the Report of the Royal Commission on Ecclesiastical Discipline, there came into existence a new Ritualistic society, the composition of which is as full of significance as the present crisis in our National Church\". from its foundation in July 1906 until 1914 and thereafter of its successor, the Anglican and Eastern Churches Association.The Union published annual reports between 1906 and 1914 and a magazine, Eirene, which Fynes-Clinton edited for some years from 1908 to 1914.  By 1914 it had approximately 2,000 members in Britain and a branch in the United States.  See The Times, 24 October 1908, p. 19, column F for a report of the Union's early activities. It merged in 1914 with the Eastern Church Association, which had been founded at the residence of William Denton at 48 Finsbury Circus on 13 April 1863. Fynes-Clinton remained active in the Anglican and Eastern Churches Association until 1933, when he was ousted from its leadership following his call for reunion with Rome. Godfrey Benson, 1st Baron Charnwood settled the issue in a private conversation with Fynes-Clinton. \"He agreed to resign the Hon. Secretaryship, but to continue on the Committee if desired.  In a long and, to me, extremely difficult conversation, no man, from whom I profoundly and amiably differed, could have inspired more personal respect in me than he did.\" (Sobornost incorporating Eastern churches review, Fellowship of St. Alban and St. Sergius, Volume 1 No. 1, 1979).  For further information on the Union and Association see Lambeth Palace Library, Annual Review  and Timeline of Orthodoxy in the British Isles From 1920 to 1924 he served as Secretary to the Archbishop of Canterbury's Eastern Churches Committee.The Anglican and Eastern Churches: A Historical Record 1914-1921, SPCK, London, 1921. See Anglican and Eastern Churches 1914-21 In the preface to his book The Relations of the Anglican Churches with the Eastern-Orthodox,Faith Press, 1921 Canon John DouglasFounder of the Society of the Faith and the Nikaean Club. See obituary in The Times, 5 July 1956, p. 14, column B and The Times, 13 July 1956, p. 14, column B commented that he had \"had the great advantage of the help of my friend the Rev. H. J. Fynes-Clinton, to whom the development of the rapprochement between the Anglican and Eastern-Orthodox Churches is due more than to any living man\". Fynes-Clinton was joint secretary, with R.W. Seton-Watson, of the committee established in 1916 to disseminate knowledge of Serbia throughout Great Britain and draw a tighter bond between the two countries.  This organized a service at St Paul's Cathedral on 7 July 1916 to commemorate the British and Serbian soldiers, doctors and nurses who had died in the defence of Serbia.See The making of a new Europe: R.W. Seton-Watson and the last years of Austria-Hungary, Seton-Watson H. and C., pp. 174-5: Univ of Washington Press, 1981,  and The Times, 12 June 1916, p. 3, col. C.  A further service was held at St Mary-le-Bow in 1918 (see The Times, 29 June 1918, p. 3, col. C). Fynes-Clinton supported the Serbian Orthodox Church, for example by raising funds for the education of theological students at Oxford,The Times, 6 September 1920, p. 6, col. C and was awarded the Serbian Order of St Sava (2nd class 1918, 1st class 1921).The Anglican and Eastern Churches: A Historical Record 1914-1921, SPCK, London, 1921. See Anglican and Eastern Churches 1914-21 He was also one of the Secretaries of the St Sophia Redemption Committee, founded in 1918, which promoted the restoration of the Hagia Sophia in Constantinople to Christian worship.Holy Wisdom and British foreign policy, 1918-1922: the St. Sophia redemption agitation by Erik Goldstein in 'Byzantine and Modern Greek Studies', Volume 15, 1991, pp. 36-65.  See also Give Back Saint Sophia: A Report of the Speeches Delivered at the Opening Meeting of the Crusade for the Redemption of Saint Sophia, held at the Cannon Street Hotel, on January 23rd, 1919 by Athelstan Riley, London: Faith Press, 1919"]}, {"page": "Lord Charnwood", "response": ["#REDIRECT Godfrey Benson, 1st Baron Charnwood"]}]}}