{"wiki_id": "http://www.wikidata.org/entity/Q5576468", "itemLabel": "Godfrey James", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Godfrey_James", "wikipedia_page": {"main": "Godfrey James (16 April 1931 – 29 October 2019) was an English actor.His film appearances include: Séance on a Wet Afternoon (1964), Witchfinder General (1968), The Oblong Box (1969), Cry of the Banshee (1970), The Blood on Satan's Claw (1970), Villain (1971), Hide and Seek (1972), The Land That Time Forgot (1974), At the Earth's Core (1976), Camille (1984), Out of Order (1987) and Piccolo Grande Amore (1993).In the 1970's British police drama The Sweeney, episode Big Spender, James appeared as hard man Charley Smith, part of an organized crime family who involve themselves with two dishonest employees of a car park company in an elaborate fraud. \nHis television credits include: The Avengers, Dixon of Dock Green, Department S, Z-Cars, UFO (the 1970 episode \"The Square Triangle\"), The Onedin Line, Space: 1999, The Lotus Eaters, The Carnforth Practice, The Sweeney, Doctor Who (the serial Underworld), Return of the Saint, The Aphrodite Inheritance, The Standard, Minder, The Professionals, Bergerac, The Dark Side of the Sun, The Bill, Dempsey and Makepeace, Emmerdale Farm, Coronation Street, A Very Peculiar Practice and Crime Traveller. He died in Eastbourne in October 2019 at the age of 88.\n\n", "link_mentions": [{"page": "1985 in film", "response": ["| Mussolini: The Untold Story || NBC Productions || William A. Graham (director); Stirling Silliphant (screenplay); George C. Scott, David Suchet, Lee Grant, Mary Elizabeth Mastrantonio, Raúl Juliá, Tracy-Louise Ward, Virginia Madsen, Robert Downey Jr., Gabriel Byrne, Kenneth Colley, Gunnar Moller, Gina Bellman, Godfrey James, Michael Aldridge, George Coulouris, Vernon Dobtcheff, Constantine Gregory, Paul Herzberg, Wolf Kahler, Anne-Louise Lambert, Annabel Leventon, Philip Madoc, Tony Vogel, Milton Johns, Richard Kane, Michael MacKenzie, Stephen Marshall, Paul Kehagias, Spencer Chandler || Drama || Live action"]}, {"page": "Comedy Playhouse", "response": ["Room at the Bottom (14 June 1966) starring Kenneth Connor, Deryck Guyler, Francis Matthews, Brian Wilde, Erik Chitty and Godfrey James. This was the pilot episode of the BBC series of the same name."]}, {"page": "The Wednesday Play", "response": ["| Keith BarronJack WoolgarKatherine ParrJanet HenfreyJohnnie WadeGodfrey JamesLlewellyn ReesBrian BadcoePeter MaddenAlan LakeIan FairbairnMichael DavisSheila Dunn", "| Dudley SuttonLiam RedmondJohn NettletonGeraldine ShermanHarry FowlerRalph WatsonGodfrey JamesJack Bligh", "| Colin BlakelyRobert HardyBernard HeptonBrian BlessedEdward HardwickeGodfrey QuigleyGawn GraingerGodfrey JamesEric MasonHugh FutcherEdmund BaileyDavid CannonRoy Stewart", "| Celia JohnsonPeter VaughanSydney TaflerPatsy ByrneBernard KayJon RollasonGodfrey JamesValentino Musetti"]}, {"page": "Return of the Saint", "response": ["| 1–11 || 19 November 1978 || \"The Imprudent Professor\" || Catherine Schell, Susan Penhaligon, Anthony Steel, Godfrey James, Richard LeParmentier, Peter Childs, Bill Simpson, John Moreno"]}, {"page": "Witchfinder General (film)", "response": ["*Other cast members include Nicky Henson as Trooper Robert Swallow, Wilfrid Brambell as Master Loach, Tony Selby as Salter, Bernard Kay as Fisherman, Godfrey James as Webb, Michael Beint as Captain Gordon, John Treneman as Harcourt, Bill Maxwell as Gifford, Morris Jar as Paul, Maggie Kimberly as Elizabeth, Peter Haigh as Lavenham Magistrate, Hira Talfrey as Hanged Woman, Ann Tirard as Old Woman, Peter Thomas as Farrier, Edward Palmer as Shepherd, David Webb as Jailer, Lee Peters as Sergeant, David Lyell as Footsoldier, Alf Joint as Sentry, Martin Terry as Hoxne Innkeeper, Jack Lynn as Brandeston Innkeeper, Beaufoy Milton as Priest, Dennis Thorne and Michael Segal as Villagers, Toby Lennon as Old Man, Margaret Nolan (billed as Maggie Nolan), Sally Douglas and Donna Reading as Inn Girls, and Derek Ware."]}, {"page": "List of Dempsey and Makepeace episodes", "response": ["| Catriona MacColl, Derek Ware, Stephen Greif, Christopher Ellison, Godfrey James, Elaine Ives-Cameron, George Leech, Rocky Taylor, Chris Webb"]}, {"page": "Play of the Month", "response": ["|Leonard Rossiter,Keith Barron,David Langton,John Phillips,Nicholas Pennell,Bernard Hepton,Burt Kwouk,Michael Culver,Stephanie Bidmead,Anthony Jacobs,Basil Moss,Peter Copley,Godfrey James", "|John Alderton,Graham Crowden,Lally Bowers,Roland Culver,Ian Ogilvy,Anthony Ainley,Lila Kaye,John Dearth,John Cater,Godfrey James,Henry Woolf"]}, {"page": "The Lotus Eaters (TV series)", "response": ["* Godfrey James as Nicholson", "| colspan=2                  | Godfrey James", "| colspan=2                  | Godfrey James", "| colspan=2                  | Godfrey James", "| colspan=2                  | Godfrey James", "| colspan=2                  | Godfrey James", "| colspan=2                  | Godfrey James"]}, {"page": "The Land That Time Forgot (1974 film)", "response": ["* Godfrey James as Borg"]}, {"page": "At the Earth's Core (film)", "response": ["* Godfrey James as  Ghak the Hairy One"]}, {"page": "List of Bergerac episodes", "response": ["| Celia Gregory, Rosy Clayton, Donald Morley, Barrie Cookson, Godfrey James, Peter Childs"]}, {"page": "The Aphrodite Inheritance", "response": ["*Godfrey James as Inspector Dimas"]}, {"page": "The Dark Side of the Sun (TV serial)", "response": ["*Godfrey James as Harry Brennan"]}, {"page": "The Cleopatras", "response": ["| Cato || Godfrey James  "]}, {"page": "List of The Avengers (TV series) episodes", "response": ["| Willoughby Goddard, Stratford Johns, Doris Hare, Philip Locke, Godfrey James, Neil Wilson, Eric Elliott"]}, {"page": "List of The Professionals episodes", "response": ["| Sarah Neville, John Wheatley, Godfrey James, Briony McRoberts, Chrissie Cotterill, Simon Dutton, Michael Praed, Seymour Green, Brian Miller, Milton Johns"]}, {"page": "Highlander: The Series (season 6)", "response": ["* Godfrey James ... Frederick of Godfrey"]}, {"page": "Son of Man (play)", "response": ["* Godfrey James as 1st Soldier"]}, {"page": "Matt Skilbeck", "response": ["Matt Skilbeck is a fictional character from the British television soap opera Emmerdale, played by Frederick Pyne. He is one of the series' original characters and made his debut in the first episode broadcast on 16 October 1972. Pyne was interviewed for the role in 1971 and cast the following year. He came into the show with farming knowledge and an expectation that he would only be in it for five years. Matt is a sheep farmer and married to Peggy Skilbeck (Jo Kendall) at the beginning of the serial. Matt is characterised as mild-mannered, honest, and stubborn, although Pyne thought his character was too nice. Following Peggy's death and those of his children, Matt marries barmaid Dolly Acaster (Katharine Barker; Jean Rogers). A change in Matt's personality occurs when quarry owner Harry Mowlem (Godfrey James) makes advances towards Dolly and Matt attacks him, leading to his arrest for Mowlem's murder. Pyne decided to leave Emmerdale in 1989 to pursue work in the theatre. He was unhappy that the writers chose to split Matt and Dolly up, as they had been one of the few remaining happy families in soap at the time.", "A different side to the normally laid back character emerges when Harry Mowlem (Godfrey James) begins making advances towards Dolly. Matt later attacks the quarry owner and Pyne justified his character's actions, explaining: \"Mowlem was such a monster that even the most placid person would lose their temper.\" Matt is arrested for manslaughter when Mowlem is found dead, but he is released when criminal Derek Warner (Dennis Blanch) later admits to Mowlem's murder.Parkin 2002, p.68."]}, {"page": "State of Revolution", "response": ["*Godfrey James ... Mdvani/Russian General"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Godfrey James"]}, {"page": "List of Bergerac cast members", "response": ["*Godfrey James"]}, {"page": "List of Highlander cast members", "response": ["|valign=\"top\"|Godfrey James|| valign=\"top\"|Frederick of Godfrey|| valign=\"top\"|\"Justice\"|| valign=\"top\"|1997"]}, {"page": "List of former Emmerdale characters", "response": ["|Harry Mowlem || Godfrey James || 1983–1986"]}, {"page": "Hide and Seek (1972 film)", "response": ["* Godfrey James as Police Constable Dickie "]}, {"page": "Oliver Twist (1985 TV serial)", "response": ["* Godfrey James - Mr. Bumble"]}, {"page": "List of Minder episodes", "response": ["|colspan=\"3\"|Guest stars: Peter Bland as Charlie, Diane Keen as Christina Kostos, Daniel Hill as Johnny, Godfrey James as Omar, Michael Angelis as Nick.", "|colspan=\"3\"|Guest stars: Trevor Byfield as Billy Meadows, David Sibley as Vinnie Meadows, David Marrick as Henri, Godfrey James as Arnie. (Susannah Corbett appears in several scenes as Billy's daughter Sadie, but never speaks)."]}, {"page": "Out of Order (1987 film)", "response": ["* Godfrey James ...  Desk Sergeant"]}, {"page": "Mussolini: The Untold Story", "response": ["* Godfrey James as Marshal Pietro Badoglio"]}, {"page": "Hawkmoor (TV series)", "response": ["The 5-part series starred John Ogwen as Twm and Jane Asher as Lady Johane Williams, and also featured Godfrey James as Twm's right-hand man Shanco, Jack May as the English-born Sheriff John Stedman, Tom Owen as the sheriff's son John, Philip Madoc as Vicar Davyd, Meredith Edwards as Sir Tom Williams and Rachel Thomas as Agnes. The series depicted Twm as a Welsh Robin Hood/freedom fighter protecting the Welsh people from the repression of Sheriff Stedman and the cruel (Catholic) Vicar Davyd during the reign of Queen Mary I of England."]}]}}