{"wiki_id": "http://www.wikidata.org/entity/Q5576775", "itemLabel": "Matt Bishop", "itemDescription": "British Formula One public relations director", "wikipedia_url": "https://en.wikipedia.org/wiki/Matt_Bishop", "wikipedia_page": {"main": "Matt Bishop (born 25 December 1962) is an English journalist, author, novelist and public relations executive. After leaving the Cardinal Vaughan Memorial School, Holland Park, in 1981, he failed to qualify as a London bus driver and then worked as a bookmaker, a betting-shop manager, and a minicab driver until the 1990s, when he began to freelance as a writer for Sporting Life and applied to university to study psychology. Dropping out after a year, he began his full-time writing career at Car magazine in 1993, becoming features editor, then in September 1995 moved to Focus magazine as deputy editor then acting editor, before joining F1 Racing (now renamed GP Racing) magazine as editor in December 1996, remaining until September 2007. F1 Racing has been credited with transforming the coverage of Formula 1 in print, and became the world's best-selling Formula 1 magazine, selling 1.25 million copies worldwide during Bishop's tenure.In the wake of the 2007 Formula 1 espionage controversy, which resulted in the McLaren Formula 1 team being fined an unprecedented $100 million, Bishop was recruited by McLaren chairman Ron Dennis to become the company's communications director. He left McLaren in July 2017. He then took a sabbatical to write his first novel, The Boy Made the Difference (published in 2020), before returning to motorsport public relations work in 2018 as a member of the senior leadership team of W Series, the world’s first single-seater motor racing championship for female drivers only. After the 2020 W Series season was cancelled owing to the COVID-19 pandemic, it was announced that eight races in the championship's 2021 season would take place in support of Formula 1 Grands Prix.On 10 December 2020 it was announced that Bishop had been recruited by the Aston Martin Formula 1 team to be its chief communications officer, starting in 2021.", "link_mentions": [{"page": "Stephen Kovacevich", "response": ["From 1961 to 1967 Kovacevich was married to novelist and psychotherapist Bernardine Bishop née Wall, who died in 2013. They had two sons, Matt Bishop and Foff Bishop.Guardian obituary https://www.theguardian.com/books/2013/jul/05/bernardine-bishop"]}, {"page": "Ron Dennis", "response": ["While acknowledging that the term has been used to criticise Dennis, the former editor-in-chief of F1 Racing, Matt Bishop, argues that \"Ronspeak\" is not a vice; rather, it is informative and accurate. Dennis, in describing Fernando Alonso's contribution to the McLaren team's development, said his experience and ability \"[prevented] an F1 team from going down [time wasting] technical cul-de-sacs – and as a result, car-developmental progress becomes more linear.\" Bishop described this as a prime example of Ronspeak, hailing it as \"logical, informative and insightful. [But also] careful ... in that what it doesn't do is compare Alonso's exceptional all-round ability with that of his predecessors.\""]}, {"page": "GP Racing", "response": ["Much of the title's growth took place under long-standing editor Matt Bishop, who took over the helm of the title in December 1996. Bishop left both F1 Racing and Autosport (for which he wrote an online column) in late 2007 to join McLaren and was replaced as editor of the monthly magazine by the then executive editor Tim Scott, and later by Hans Seeberg. On 9 May 2012 it was announced that Anthony Rowlinson would become the magazine's new editor."]}, {"page": "Bernardine Bishop", "response": ["Bishop also appeared on the BBC literary quiz show Take It Or Leave It alongside Anthony Burgess and John Betjeman, but personal circumstances would militate against her expanding her literary canon. Following the end of her marriage she took a job as an English teacher, first in Westbourne Park and then in Holloway, to support herself and her two young sons, Matthew (Matt Bishop, now a director of the Aston Martin Formula 1 team) and Francis (Francis 'Foff' Bishop, a West Sussex fireman). There was no time for writing with two toddlers to attend to: “They don’t even let you read the paper.”"]}, {"page": "Barbara Wall (writer)", "response": ["She was the mother of Bernardine Bishop and the grandmother of Matt Bishop.Bernardine Bishop obituary in The Guardian"]}]}}