{"wiki_id": "http://www.wikidata.org/entity/Q5585550", "itemLabel": "Gordon McLeod", "itemDescription": "British actor (1890-1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gordon_McLeod_(actor)", "wikipedia_page": {"main": "Charles Gordon McLeod (27 December 1890 – 16 October 1963) was an English actor. He was born in Market Giffard, Ivybridge, Devon.His film appearances include Chance of a Lifetime and The Silent Passenger, but he is best known for his recurring appearance as the character Claud Eustace Teal in films such as The Saint Meets the Tiger.", "link_mentions": [{"page": "John Brown (servant)", "response": ["Gordon McLeod portrayed John Brown in Victoria the Great (1937), Sixty Glorious Years (1938) and The Prime Minister (1941)."]}, {"page": "Henry VI, Part 2", "response": ["In 1923, extracts from all three Henry VI plays were broadcast on BBC Radio, performed by the Cardiff Station Repertory Company as the third episode of a series of programs showcasing Shakespeare's plays, entitled Shakespeare Night.Unless otherwise noted, all information in this section comes from the British Universities Film and Video Council In 1947, BBC Third Programme aired a one-hundred-and-fifty-minute adaptation of the trilogy as part of their Shakespeare's Historical Plays series, a six-part adaptation of the eight sequential history plays, with linked casting. Adapted by Maurice Roy Ridley, King Henry VI starred John Bryon as Henry, Gladys Young as Margaret, Richard Williams as York and Baliol Holloway as Gloucester. In 1952, Third Programme aired an adaptation of the tetralogy by Peter Watts and John Dover Wilson under the general name The Wars of the Roses. The tetralogy was adapted into a trilogy but in an unusual way. 1 Henry VI was simply removed, so the trilogy contained only 2 Henry VI, 3 Henry VI and Richard III. The reason for this was explained by Dover Wilson, who argued that 1 Henry VI is \"patchwork in which Shakespeare collaborated with inferior dramatists.\"\"Shakespeare's Chronicles of the War of the Roses\", Radio Times, (24 October 1952) 7 The adaptation starred Valentine Dyall as Henry, Sonia Dresdel as Margaret, Stephen Jack as York and Gordon McLeod as Gloucester. In 1971, BBC Radio 3 presented a two-part adaptation of the trilogy by Raymond Raikes. Part 1 contained an abridged 1 Henry VI and an abridged version of the first three acts of 2 Henry VI. Part 2 presented Acts 4 and 5 and an abridged 3 Henry VI. Nigel Lambert played Henry, Barbara Jefford played Margaret and Ian McKellen played both York and Richard III. In 1977, BBC Radio 4 presented a 26-part serialisation of the eight sequential history plays under the general title Vivat Rex (Long live the King). Adapted by Martin Jenkins as part of the celebration of the Silver Jubilee of Elizabeth II, 2 Henry VI comprised episodes 17 (\"Witchcraft\") and 18 (\"Jack Cade\"). James Laurenson played Henry, Peggy Ashcroft played Margaret, Peter Jeffrey played York and Richard Burton narrated."]}, {"page": "The First of the Few", "response": ["|Gordon McLeod || Major Buchan"]}, {"page": "The Saint in London", "response": ["* Gordon McLeod as Inspector Claud Teal"]}, {"page": "The House Across the Lake", "response": ["*Gordon McLeod as Doctor Emery "]}, {"page": "Sam the Sudden", "response": ["The story was adapted as a radio drama by Jack Inglis and aired on 24 July 1938. It was titled Semi-Detached. The cast included Jack Hobbs as Sam Shotter, Peter Madden as Mr Pynsent, Norman Shelley as Lord Tilbury, Carleton Hobbs as Mr Wrenn, Lyn Neilson as Kay Wrenn, Joan Young as Claire, Gordon McLeod as Hash Todhunter, Kenneth Kove as Willoughby Braddock, Malcolm Waring as Chimp Twist, Inez Gibbs as Dolly Molloy, and Michael Carr as Soapy Molloy. Produced by Peter Creswell, the radio drama aired simultaneously on BBC Regional Programme London, Regional Programme London, 24 July 1938. BBC Regional Programme Scotland, Regional Programme Scotland, 24 July 1938. and BBC Regional Programme Northern Ireland. Regional Programme Northern Ireland, 24 July 1938."]}, {"page": "The Saint Meets the Tiger", "response": ["* Gordon McLeod as Insp. Claud Teal / Prof. Karn"]}, {"page": "If I Were You (Wodehouse novel)", "response": ["In 1938, the novel was adapted for radio by Jack Inglis. The radio drama featured Billy Milton as Anthony, fifth Earl of Droitwich, Elliot Playfair as the Hon. Freddie Chalk-Marshall, Margaret Halstan as Lady Lydia, Gordon McLeod as Sir Herbert, Gladys Young as Mrs Price, Bryan Powley as Slingsby, Edwin Ellis as Syd Price, Carleton Hobbs as Meech, and Eileen Erskine as Polly Brown."]}, {"page": "The Winslow Boy (1948 film)", "response": ["* Gordon McLeod as Second Elderly Member"]}, {"page": "The Saint's Vacation", "response": ["* Gordon McLeod as Inspector Teal"]}, {"page": "Claud Eustace Teal", "response": ["When The Saint was first adapted for cinema by RKO Radio Pictures, five of the eight films in the RKO series were set in the United States. As a result, the character of Teal was usually replaced by Inspector Farnack, a New York detective of similar disposition who had been introduced in the novel The Saint in New York. Teal made his first RKO appearance in 1939's The Saint in London played by Gordon McLeod, and McLeod reprised the role in The Saint's Vacation (1941) and The Saint Meets the Tiger (1943). The Saint Meets the Tiger was based upon the aforementioned Meet – The Tiger!, only this time Teal replaces the character of Detective Carn."]}, {"page": "Easy Money (1948 film)", "response": ["* Gordon McLeod as Cameron "]}, {"page": "We Are Not Alone (novel)", "response": ["A one-hour radio adaptation by James Hilton and Barbara Burnham was broadcast on the BBC National Programme on 6 April 1938, with a cast that included  Emlyn Williams as the doctor, Edgar Norfolk, Gordon McLeod and Nan Marriott-Watson."]}, {"page": "Q Planes", "response": ["* Gordon McLeod as The Baron"]}, {"page": "Victoria the Great", "response": ["* Gordon McLeod as John Brown"]}, {"page": "List of British films of 1941", "response": ["|This Man Is Dangerous||Lawrence Huntington||James Mason, Gordon McLeod, Margaret Vyner||Thriller|| Alternative title: The Patient Vanishes "]}, {"page": "Crook's Tour", "response": ["* Gordon McLeod as Rossenger"]}, {"page": "The Silent Passenger", "response": ["*Gordon McLeod as Commissioner "]}, {"page": "Floodtide", "response": ["* Gordon McLeod as Pursey  "]}, {"page": "Once a Sinner", "response": ["* Gordon McLeod as Mr. Ross  "]}, {"page": "Chance of a Lifetime (1950 film)", "response": ["*Gordon McLeod as Garrett"]}, {"page": "Gordon McLeod", "response": ["Gordon McLeod may refer to:", "*Gordon McLeod (actor) (1890–1961), British actor", "*Gordon McLeod (basketball) (born 1956), Australian basketball player and coach", "*Gordon McLeod (footballer) (born 1967), Scottish footballer"]}, {"page": "There Goes the Bride (1932 film)", "response": ["* Gordon McLeod as Monsieur Duchaine"]}, {"page": "Sixty Glorious Years", "response": ["*Gordon McLeod as John Brown"]}, {"page": "Thistledown (film)", "response": ["* Gordon McLeod as Gallagher"]}, {"page": "He Snoops to Conquer", "response": ["* Gordon McLeod as Angus McGluee"]}, {"page": "I Didn't Do It (film)", "response": ["* Gordon McLeod – Superintendent Belstock"]}, {"page": "Meet Sexton Blake!", "response": ["* Gordon McLeod as Inspector Venner"]}, {"page": "Two for Danger", "response": ["* Gordon McLeod as German"]}, {"page": "The Frog", "response": ["* Gordon McLeod as Chief Commissioner"]}, {"page": "I See Ice", "response": ["* Gordon McLeod as Lord FeiMead"]}, {"page": "The Crimson Circle (1936 film)", "response": ["* Gordon McLeod as Brabazon"]}, {"page": "This Man Is Dangerous", "response": ["This Man Is Dangerous (U.S. title: The Patient Vanishes) is a 1941 British thriller film, directed by Lawrence Huntington and starring James Mason and Gordon McLeod.  The film is based on the 1934 novel They Called Him Death by David Hume.", "* Gordon McLeod as Inspector Cardby"]}, {"page": "Dangerous Medicine", "response": ["* Gordon McLeod as Mr. Buller"]}, {"page": "The Squeaker (1937 film)", "response": ["* Gordon McLeod - Mr. Field"]}, {"page": "Under New Management", "response": ["* Gordon McLeod - Mr. Allen"]}, {"page": "The Only Way (1927 film)", "response": ["* Gordon McLeod – Ernest Defarge"]}, {"page": "Facing the Music (1941 film)", "response": ["* Gordon McLeod - Mr. Kelly"]}, {"page": "Hoots Mon! (1940 film)", "response": ["* Gordon McLeod - McDonald"]}, {"page": "Treachery on the High Seas", "response": ["* Gordon McLeod- Fleming"]}, {"page": "Banana Ridge (film)", "response": ["* Gordon McLeod as Mr. Tope  "]}, {"page": "The Rat (1937 film)", "response": ["* Gordon McLeod as Caillard"]}, {"page": "Talk of the Devil", "response": ["* Gordon McLeod as Inspector "]}, {"page": "To Catch a Thief (1936 film)", "response": ["* Gordon McLeod - Detective"]}]}}