{"wiki_id": "http://www.wikidata.org/entity/Q5586018", "itemLabel": "Gordon Wright", "itemDescription": "Canadian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Gordon_Wright_(politician)", "wikipedia_page": {"main": "Gordon Samuel Dales Wright (June 28, 1927 – October 18, 1990) was a lawyer who served as a Crown Prosecutor for the Attorney General's office, and a politician who served in the Legislative Assembly of Alberta from 1986 until his death in 1990. Born in Kingston, Jamaica, Wright was raised in England and came to Edmonton in 1953.", "link_mentions": [{"page": "List of Alberta CCF/NDP members", "response": ["*Gordon Wright - Edmonton Strathcona - 1986-1989-1990by  (died in office, NDP-er Barrie Chivers won the subsequent by-election)", "An additional New Democrat was elected in a 1990 by-election, occasioned by the death of sitting MLA Gordon Wright."]}, {"page": "Edmonton-Strathcona (provincial electoral district)", "response": ["|rowspan=2|Gordon Wright", "Koziak ran for his second term in 1975 and faced a hotly contested race against future NDP MLA Gordon Wright. Koziak was reelected after increasing his share of the vote to 54%, and was appointed to the provincial cabinet by Peter Lougheed in 1975. Koziak and Wright would face each other four more times.  Although this was during the height of the Lougheed government's popularity, Wright managed to narrow the margin each time. By 1982 Wright received only 500 fewer votes than Koziak, while Koziak won with about 48 percent of the votes cast."]}, {"page": "22nd Alberta Legislature", "response": ["|Gordon Wright"]}, {"page": "21st Alberta Legislature", "response": ["|Gordon Wright"]}, {"page": "Julian Koziak", "response": ["In the 1975 general election he faced New Democrat Gordon Wright for the first time.  He easily won the six-way race.  After the election, Koziak was appointed Minister of Education by Peter Lougheed.", "Koziak ran for the leadership of the Progressive Conservative party in 1985 and was defeated by Don Getty on the second ballot.  In the 1986 general election he faced Gordon Wright once again; this time he was defeated."]}, {"page": "Gordon Wright", "response": ["Gordon Wright may refer to:", "*Gordon Wright (footballer) (1884–1947), English Olympic footballer", "*Gordon Wright (historian) (1912–2000), American historian", "*Gordon Wright (politician) (1927–1990), Canadian lawyer and politician", "*Gordon Wright (rugby league), Australian rugby league footballer"]}, {"page": "Bert Hohol", "response": ["Hohol ran for a seat to the Alberta Legislature in the 1971 Alberta general election. He faced a tough race against future Member of Parliament Werner Schmidt and future MLA Gordon Wright. Hohol won the new district by a comfortable majority to pick up the seat for the Progressive Conservative party who formed government in that election."]}, {"page": "Ethel Sylvia Wilson", "response": ["In the 1967 Alberta general election, Wilson defeated three candidates, including future NDP MLA Gordon Wright, She received 38 percent of the votes cast in Edmonton-North.A Report on Alberta Elections 1905-1982"]}, {"page": "List of Alberta by-elections", "response": ["|Gordon Wright"]}]}}