{"wiki_id": "http://www.wikidata.org/entity/Q5581681", "itemLabel": "Muirhead Bone", "itemDescription": "British artist (1876-1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Muirhead_Bone", "wikipedia_page": {"main": "Sir Muirhead Bone (23 March 1876 – 21 October 1953) was a Scottish etcher and watercolourist who became known for his depiction of industrial and architectural subjects and his work as a war artist in both the First and Second World Wars. Bone was an active member of both the British War Memorials Committee in the First World War and the War Artists' Advisory Committee in the Second World War. He promoted the work of many young artists and served as a Trustee of the Tate Gallery, the National Gallery, and the Imperial War Museum.", "link_mentions": [{"page": "Charles Holden", "response": ["While working and studying in Manchester, Holden formed friendships with artist Muirhead Bone and his future brother-in-law Francis Dodd. About this time Holden was introduced to the writings of Walt Whitman and became friends with James William Wallace and a number of the members of Bolton's Whitman society known as the \"Eagle Street College\". Whitman's writings and those of Henry David Thoreau, Ralph Waldo Emerson and Edward Carpenter were major influences on Holden's life. He incorporated many of their philosophies and principles into his style of living and method of working."]}, {"page": "Stanley Spencer", "response": ["Spencer lived in Cookham until April 1920 when he moved to Bourne End to stay with the trade union lawyer Henry Slesser and his wife. While there, he worked on a series of paintings for their private oratory. In all, during the year he spent at the Slessor's home, Spencer painted some twenty pictures including Christ Carrying the Cross, which is now in the Tate. In 1921 Spencer stayed with Muirhead Bone at Steep in Hampshire where he worked on mural designs for a village hall war memorial scheme which was never completed. In 1923 Spencer spent the summer in Poole, Dorset, with Henry Lamb. While there he worked on sketch designs for another possible war memorial scheme. These designs convinced two early patrons of Spencer's work, Louis and Mary Behrend, to commission a group of paintings as a memorial to Mary's brother, Lieutenant Henry Willoughby Sandham, who had died in the war. The Behrends planned to build a chapel in the village of Burghclere in Berkshire to house the paintings."]}, {"page": "Christopher R. W. Nevinson", "response": ["In April 1917, with the support of Muirhead Bone and his own father, Nevinson was appointed an official war artist by the Department of Information. Wearing the uniform of a war correspondent, he visited the Western Front from 5 July to 4 August 1917, a period which included the start of the Battle of Passchendaele on 31 July. Nevinson was billeted with other visitors in the Château d'Harcourt, south of Caen. Although life at the Chateau allowed Nevinson to demonstrate his cocktail making skills to the other visitors, he soon transferred to the 4th Infantry Division near Arras. From there he moved widely along the Front, visiting forward observation posts and artillery batteries. He flew with the Royal Flying Corps and came under anti-aircraft fire. He spent a night in an observation balloon above the Somme. Making his way to a forward post one day he was pinned down by enemy fire for an hour. An unauthorised visit to the Ypres Salient earned Nevinson a reprimand and added to his reputation for recklessness.", "While on the trip, he did sketch a line of walking wounded, and some prisoners making their way to the rear from an early morning offensive. This became the basis of the painting The Harvest of Battle which was the largest single work Nevinson painted. It was completed in February 1919 and Nevinson arranged a 'private view' of the painting in his studio on 2 April for numerous critics and journalists. Whilst this produced some favourable reviews, notably in the Daily Express, it also led to articles claiming that the painting was so grim that it was being withheld from the public. When the painting was shown at the huge The Nation's War Paintings and Drawings exhibition organised by the Imperial War Museum in December 1919 at Burlington House Nevinson was furious to find it had not been hung in the main room but rather in a side gallery. He began a campaign of vilification against all those he held responsible for this insult. Unreasonable as Nevinsons' outrage was it did have consequences; it destroyed his friendship with Muirhead Bone, who had been on the organising committee for the exhibition, made the Imperial War Museum wary of dealing with him, and blinded Nevinson himself to the high esteem in which his war paintings were held."]}, {"page": "1876 in art", "response": ["* March 23 – Muirhead Bone, Scottish-born etcher (died 1953)"]}, {"page": "War artist", "response": ["* Muirhead Bone, 1888–1953."]}, {"page": "1916 in art", "response": ["* May – Muirhead Bone recruited as a war artist by the British War Propaganda Bureau. At the end of the year, his album of drawings The Western Front begins publication."]}, {"page": "1953 in art", "response": ["* October 21 – Sir Muirhead Bone, British etcher (b. 1876)"]}, {"page": "New English Art Club", "response": ["Historic NEAC members and exhibitors include: Thomas Kennington (founder member and first secretary), Prof Fred Brown (founder member), Frank Bramley (foundation member), Walter Sickert, William Orpen, Augustus John, Gwen John, Ambrose McEvoy, Philip Wilson Steer, Henry Tonks, James Whitelaw Hamilton, Alfred William Rich, James Dickson Innes, Margaret Preston, Charles Wellington Furse, Katie Edith Gliddon, William Rothenstein, Lindsay Bernard Hall, Thomas Cooper Gotch, Mary Sargant Florence, Henry Strachey, Clare Atwood, Evelyn Dunbar, Eve Garnett, Frank McEwen, James Jebusa Shannon, Cecil Mary Leslie, Mary Elizabeth Atkins, William Brown Macdougall, Neville Bulwer-Lytton, 3rd Earl of Lytton, Muirhead Bone, Robert Polhill Bevan, Dugald Sutherland MacColl, Neville Lewis, Charles Holmes, Carron O Lodge, Geoffrey Tibble, Alexander Mann, Hercules Brabazon Brabazon, Thomas Esmond Lowinsky, Frank Hughes, Albert Julius Olsson, Helen Margaret Spanton,Suffolk Painters: Suffolk Painters, accessdate: March 9, 2016 Margaret Green and Leslie Donovan Gibson."]}, {"page": "Etching revival", "response": ["In Britain a later generation included three artists working very largely in etching who were knighted.  These were the \"high priests\" of the English movement: Muirhead Bone, David Young Cameron (these two both born and trained in Glasgow), and Frank Short. Like others, they \"treated a narrow range of subjects with a dour earnestness\", according to Antony Griffiths.Griffiths, 69 Myra Kathleen Hughes and William Strang were other leading figures. Many artists turned to illustrating books, usually with lithographs.  In America, Stephen Parrish, Otto Bacher, Henry Farrer, and Robert Swain Gifford might be considered the important figures at the turn of the century, though they were mostly less exclusively dedicated to printmaking than the English artists.  The New York Etching Club was the main professional etching organization.", "By the early 20th century, and especially in the decade after the end of the First World War, a very strong body of well-off collectors led to a huge boom in prices for contemporary prints by the most highly regarded artists, sometimes called the \"super-etchers\",Carey, 216 which very often exceeded those for good impressions of prints by Rembrandt and Dürer, let alone other Old Masters.  The boom was somewhat cynically exploited by many artists, who produced prints in a rather excessive number of states, often described as \"proof states\", so encouraging collectors to buy multiple copies. Muirhead Bone is believed to hold the record, with 28 states for one print.Carey, 234, describing a Bone with a mere 19 states  Surface tone also individualized impressions.   ", "After rising to its highest in the 1920s, the market for collecting recent etchings collapsed in the Great Depression after the 1929 Wall Street crash, which after a period of \"wild financial speculation\" in prices, \"made everything unsaleable\".Griffiths, 69 (quoted); Mayor, 747  The prints curator at the British Museum, Campbell Dodgson, collected contemporary prints which he later gave to the museum.  He began collecting and writing about Muirhead Bone's prints when Bone first exhibited in London in 1902, paying one or two guineas at Bone's dealer. By 1918 he was paying far higher prices, up to £51 and £63.  He continued to buy Bones up to the 1940s, by which time the prices were back to 1902 levels.  However a record price of £250 was paid for Ayr Prison (1905) \"Bone's masterpiece\" (according to Dodgson) \"as late as 1933\", bought by Oskar Reinhart in Switzerland.Carey, 216-217  "]}, {"page": "Sir Muirhead Bone", "response": ["#REDIRECT Muirhead Bone"]}, {"page": "Ernest Stephen Lumsden", "response": ["In 1925 the publishers Seeley Service issued what is still regarded as the seminal treatise on the subject of etching, called The Art of Etching.  In the book Lumsden describes the various techniques of intaglio printing using etching, drypoint, mezzotint and aquatint; he describes the history and development of etching through Rembrandt, Goya and the etching revival; and he reproduced personal, illustrated notes from several eminent etchers of the period on their techniques including: Marius Bauer, Frank Benson, Muirhead Bone, George Clausen, David Young Cameron, Frank Short, Augustus John, Frank Brangwyn, James McBey, Edmund Blampied, Percy Smith, Christopher Nevinson, Laura Knight, and John Everett.  The book was published as a trade edition, which is still in print, and as a limited edition of 150 copies containing four original etchings by Lumsden."]}, {"page": "The Dream (novel)", "response": ["Nowadays of course nobody reads the books of the generals and admirals and politicians of that time, and all the official war histories sleep the eternal sleep in the vaults of the great libraries, but probably you have all read one of two such human books as Enid Bagnold's '\"Diary without Dates\" or Cogswell's \"Ermytage and the Curate\" or Barbusse's \"Le Feu\" or Arthur Green's \"Story of a Prisoner of War\" or that curious anthology, \"The War Stories of Private Thomas Atkins\"; and probably you have seen photographs and films and also pictures painted by such men as Nevinson and Orpen and Muirhead Bone and Will Rothenstein. All of them, I can certify now, are very true books and pictures. They tell of desolation passing like the shadow of an eclipse across the human scene.\""]}, {"page": "World War I", "response": ["This has become the most common perception of World War I, perpetuated by the art, cinema, poems, and stories published subsequently. Films such as All Quiet on the Western Front, Paths of Glory and King and Country have perpetuated the idea, while war-time films including Camrades, Poppies of Flanders, and Shoulder Arms indicate that the most contemporary views of the war were overall far more positive. Likewise, the art of Paul Nash, John Nash, Christopher Nevinson, and Henry Tonks in Britain painted a negative view of the conflict in keeping with the growing perception, while popular war-time artists such as Muirhead Bone painted more serene and pleasant interpretations subsequently rejected as inaccurate. Several historians like John Terraine, Niall Ferguson and Gary Sheffield have challenged these interpretations as partial and polemical views:"]}, {"page": "Egyptian Hall", "response": ["In 1905 the building was demolished to make room for blocks of flats and offices at 170–173 Piccadilly. Muirhead Bone captured its demise in his work The Dissolution of Egyptian Hall. The Maskelynes relocated to the St. George's Hall in Langham Place, which became known as Maskelyne's Theatre."]}, {"page": "1953 in the United Kingdom", "response": ["* 21 October – Sir Muirhead Bone, etcher (born 1876)"]}, {"page": "Francis Dodd (artist)", "response": ["Dodd was born in Holyhead, Anglesey, Wales, the son of a Wesleyan minister. He trained at the Glasgow School of Art alongside Muirhead Bone, who married Dodd's sister Gertrude Helena Dodd. At Glasgow, Dodd won the Haldane Scholarship in 1893 and then travelled around France, Italy and later Spain. Dodd returned to England in 1895 and settled in Manchester, becoming friends with Charles Holden, before moving to Blackheath in London in 1904."]}, {"page": "Harcourt Hill", "response": ["Well-known residents of Harcourt Hill have included Professor Sir Walter Raleigh, Sir Muirhead Bone and Martin Gilbert."]}, {"page": "Wellington House", "response": ["After January 1916 the Bureau's activities were subsumed under the office of the Secretary of State for Foreign Affairs. In May 1916 Masterman recruited artist Muirhead Bone. He was sent to France and by October had produced 150 drawings. After Bone returned to England he was replaced by his brother-in-law, Francis Dodd, who had been working for the Manchester Guardian. In 1917 arrangements were made to send other artists to France including Eric Kennington, William Orpen, Paul Nash, Christopher R. W. Nevinson and William Rothenstein. John Lavery was recruited to paint pictures of the home front. Nash later complained about the strict control maintained by the Bureau over the official subject matter, saying \"I am no longer an artist. I am an artist who will bring back word from the men who are fighting to those who want the war to go on forever. Feeble, inarticulate will be my message, but it will have a bitter truth and may it burn their lousy souls.\""]}, {"page": "Labour Leader", "response": ["Brailsford also managed to obtain several noted contributors to the New Leader, including H. G. Wells, George Bernard Shaw, Bertrand Russell, Hugh Dalton, Norman Angell and C. E. M. Joad.Clare Leighton and Patricia Jaffé, The Wood Engravings of Clare Leighton. Cambridge, England : Silent Books, 1992.  (p. 9)F. M. Leventhal, \"H. N. Brailsford and the New Leader\". Journal of Contemporary History. Vol. 9, No. 1 (Jan., 1974), (pp. 91-113) E. M. Forster and H. W. Nevinson contributed book reviews to the New Leader, while Julian Huxley wrote science articles. The magazine also added a literature section, with poems by Frances Cornford and Charlotte Mew, and stories by T. F. Powys.J. Lawrence Mitchell, T. F. Powys: Aspects of A Life Brynmill Press Ltd, 2005.  (p. 129). Illustrators for the New Leader included Jack B. Yeats, Muirhead Bone, Käthe Kollwitz and Clare Leighton."]}, {"page": "Mukul Dey", "response": ["Dey received his initial training at Rabindranath Tagore's Santiniketan. He then travelled to America from Japan in 1916 to learn the technique of etching under James Blanding Sloan and Bertha Jaques in Chicago, to whom Dey was introduced by American artist Roi Partridge and his wife Imogen Cunningham. Mukul Dey remained a life-member of Chicago Society of Etchers. On his return to India in 1917, Dey concentrated on creating etchings as a fine art. He also supported himself through making portrait drawings of the rich and famous, and turned these into etchings. In 1920 Dey once again travelled abroad for the purpose of study, this time learning etching and engraving under Frank Short and Muirhead Bone. He studied at both the Slade School of Fine Art and the Royal College of Art in London. At Slade School of Art Mukul Dey was a student of Professor Henry Tonks."]}, {"page": "Louis Conrad Rosenberg", "response": ["While at The American Academy Rosenberg produced a series of etchings between the Fall of 1921 and the Spring of 1922 - The Rome Series, which initiated his career as a fine artist. One of the prints, St. Peter's Colonnade, would win a Silver Medal from The California Printmakers Society in 1922. But Rosenberg was not yet ready to give up the practice of architecture for the uncertain rewards of an artist's life, and returned to the United States where he took a job with the firm of York and Sawyer in New York. Once more chance intervened in his life: the British artist Muirhead Bone, an acquaintance of Phillip Sawyer, visited New York, and was immediately struck by Rosenberg's technical and artistic work. By Bone's encouragement, and through his influence, Rosenberg was able to attend The School of Engraving at The Royal College of Art in London, where he studied under the master printmaker Malcolm Osborne, A.R.A. Rosenberg moved to London in 1924, and over the next near produced two dozen prints, two of which won the Chicago Society of Etchers Logan Prize, one the Society of Brooklyn Etchers Prize, and seven of which were included in his volume of The American Etcher series (Volume X)."]}, {"page": "1876 in the United Kingdom", "response": ["* 23 March – Muirhead Bone, Scottish etcher (died 1953)"]}, {"page": "Eric Kennington", "response": ["Kennington visited the Somme in December 1916 as a semi-official artist visitor before, back in London, producing six lithographs under the title Making Soldiers for the Ministry of Information's Britain's Efforts and Ideals portfolio of images which were exhibited in Britain and abroad and were also sold as prints to raise money for the war effort. In May 1917 he accepted an official war artist commission from the Department of Information. Kennington was commissioned to spend a month on the Western Front but he applied for numerous extensions and eventually spent seven and a half months in France. Kennington was originally based at the Third Army Headquarters and would spend time at the front lines near Villers-Faucon. Later during this tour, his friend William Rothenstein was also appointed as a war artist and they worked together at Montigny Farm and at Devise on the Somme, where they often came under shell-fire. Kennington spent most of his time painting portraits, which he was happy to do, but became increasingly concerned about his lack of access to the front line and that the official censor was removing the names of his portrait subjects. Although Kennington was among the first of the official war artists Britain sent to France, he was not afforded anything like the status and facilities that the others, in particular William Orpen and Muirhead Bone enjoyed. Whereas Kennington was working for neither salary nor expenses and had no official car or staff, Orpen was given the rank of major, had his own military aide, a car and driver, plus, at his own expense, a batman and assistant to accompany him. Kennington could be aggressive and irritable and at times complained bitterly about his situation, claiming he must have been the cheapest artist employed by the Government and that \"Bone had a commission and Orpen had a damned good time\"."]}, {"page": "Muirhead", "response": ["* Muirhead Bone (1876–1953), Scottish artist"]}, {"page": "World War I in popular culture", "response": ["Charles Masterman, head of the British War Propaganda Bureau, acting on the advice of William Rothenstein, appointed Muirhead Bone as Britain's first official war artist in May 1916.Vale Royal Borough Council. (2005).   \"Whitegate Conservation Area Update,\" p. 11. In April 1917 James McBey was appointed official artist for Egypt and Palestine, and William Orpen was sent to France. Orpen's work was criticised for superficiality in the pursuit of perfectionism: \"in the tremendous fun of painting he altogether forgot the ghastliness of war\"."]}, {"page": "Fyffe Christie", "response": ["Christie was perhaps influenced by various styles and painters in the various genres he worked with, Robert Radford has drawn some comparisons with his oil painting and the work of Giorgione, Cézanne and Matisse for example, and his Still Life painting with the Scottish Colourists F.C.B. Cadell and Samuel Peploe.Buckman, D., Jordanova, L. and Radford, R., Nature and Humanity, the work of Fyffe Christie:1918-1979, (Sansom & Company, Bristol, 2004), pp 2-3 His murals with their stylised figures have often been compared with those of the English artist Stanley Spencer, in an article in The Glasgow Herald in 1958 on Christie's exhibition one London Art Critic noted \"In these panel works the influence of Stanley Spencer can be traced, but with a symbolism of Christie's own\" Spencer was born and grew up in the village of Cookham, just north of London and not far from Christie's birthplace of Bushey. Spencer, like Christie, experienced war, the First World War, serving like Christie in a medical capacity with the Royal Army Medical Corp. Robert Radford described Christie's service as stretcher bearer as \" work which demands an encounter with the limits of human experience from the preciousness and frailty of the body to the courage and vitality of the spirit subjected to the extremities of danger and pain. It is significant how closely this matched the experience of Stanley Spencer in the previous Great War, an artist whose example must have informed at some level Christie's subsequent work as a muralist.\".Buckman, D., Jordanova, L. and Radford, R., Nature and Humanity, the work of Fyffe Christie: 1918-1979, (Sansom & Company, Bristol, 2004), p.1 But Spencer was of an earlier generation and any further links are tentative, for instance the Scottish artist and draughtsman Muirhead Bone was a close friend of Spencer while Bone's brother William was Christie's drawing teacher at the Glasgow School of Art. The stylised mules painted at the top of Christie's Pilgrim's Progress mural also bear a notable resemblance to those painted by Spencer in his mural at the Sandham Memorial Chapel and his painting Travoys with Wounded Soldiers Arriving at a Dressing Station at Smol, Macedonia of 1919, held by the Imperial War Museum and it might possibly be argued that this minor feature in the Ilford mural is a passing homage to Spencer."]}, {"page": "William Edwin Rudge", "response": ["* 1925 Adams, Elbridge. Joseph Conrad: The Man. A Burial In Kent By John Sheridan Zelie. Together With Some Bibliographical Notes. New York – published by William Edwin Rudge.  As per Oak Knoll Books: First edition, limited to 485 copies. Designed by Bruce Rogers. (Warde no.190). With an engraved portrait of Joseph Conrad by Muirhead Bone as frontispiece."]}, {"page": "1937 Coronation Honours", "response": ["*Muirhead Bone, Esq., LL.D. For services to art."]}, {"page": "British official war artists", "response": ["Throughout the early years of the First World War, the British Government did not support an official war artist scheme. This began to change after artists who had served on the Western Front, such as Paul Nash and Christopher R. W. Nevinson exhibited paintings based on their experiences in France. The public acclaim that Eric Kennington received when his painting The Kensingtons at Laventie was first exhibited in London in April 1916 prompted Charles Masterman, head of the British War Propaganda Bureau, acting on the advice of William Rothenstein, to appoint Muirhead Bone as Britain's first official war artist in May 1916. After Bone returned to England he was replaced by his brother-in-law, Francis Dodd, who had been working for the Manchester Guardian. In 1917 arrangements were made to send other artists to France including Kennington, Nash, Nevinson, William Orpen and William Rothenstein. John Lavery and others were recruited to paint pictures of the home front.", "*Muirhead Bone, 1876–1953.", "Working with the British Government and the Armed Forces, traditionally the Official War Artists' schemes have been overseen by artists (including Muirhead Bone) and art historians (including Kenneth Clark and curators from the Imperial War Museums). Yet so too have the British Armed Forces discretely appointed their own war artists to represent operations on the Home Front and in conflicts abroad, whose commissions have been vitally important for keeping an up-to-date artist's impression and record of contemporary warfare."]}, {"page": "List of painters by name beginning with \"B\"", "response": ["*Muirhead Bone (1876–1953), Scottish etcher and water-colorist"]}, {"page": "Bone (surname)", "response": ["* Muirhead Bone (1876–1953), Scottish artist "]}, {"page": "List of Scottish artists", "response": ["*Muirhead Bone (1876–1953), etcher"]}, {"page": "Glasgow Art Club", "response": ["The club's Winter exhibition of 1909 included works by: Sir James Guthrie, E A Hornel, Muirhead Bone (Britain's first official War Artist, knighted 1937First World War pictures, biography Sir Muirhead Bone Retrieved 2011-08-17) Sir David Murray RAGlasgow Herald article 4 December 1909 The Glasgow Art Club – Interesting Exhibition Retrieved 2011-08-17", "* Sir Muirhead Bone"]}, {"page": "James Bone", "response": ["Born in Glasgow, Bone's parents were journalist David Drummond Bone (1851–1911) and his wife, Elizabeth Millar Crawford (1847–1886). His brothers included Sir Muirhead Bone, the artist, and Captain Sir David Bone, author and mariner.", "Also in 1901, to coincide with the Glasgow International Exhibition (1901), Bone's first book, Glasgow in 1901, was published under the pseudonym, James Hamilton Muir, a name formed from his own name and those of his co-author and friend, Archibald Hamilton Charteris, the nephew of Scottish theologian, Archibald Charteris., and his brother, the book's illustrator, Muirhead Bone. ", "The 3 other books by Bone are : The London Perambulator (1925), illustrated by Muirhead Bone, The Perambulator in Edinburgh (1926), illustrated by E.S.Lumsden, and London Echoing (1948), illustrated by Muirhead Bone."]}, {"page": "1878 in Scotland", "response": ["* 23 March – Muirhead Bone, graphic artist (died 1953 in England)"]}]}}