{"wiki_id": "http://www.wikidata.org/entity/Q5585924", "itemLabel": "Gordon Tucker", "itemDescription": "English footballer (born 1968)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gordon_Tucker_(footballer)", "wikipedia_page": {"main": "Gordon Tucker (born 5 January 1968) is an English former professional footballer, who played for Derby County, Huddersfield Town, Scunthorpe United, Hyde United and Goole Town.", "link_mentions": [{"page": "Gordon Tucker", "response": ["250px|right|Rabbi Gordon Tucker participates in an early morning minyan, 2003", "Gordon Tucker is a prominent rabbi, with a reputation as both a political and a theological liberal in Conservative Judaism. He is the former senior rabbi of Temple Israel Center in White Plains, New York. Since September 2020, he has served as the Vice Chancellor for Religious Life and Engagement at the Jewish Theological Seminary of America.", "In the 1950s and '60s, the two most famous scholars at Jewish Theological Seminary were Heschel and Mordechai Kaplan (1881–1983). Gordon Tucker began his studies at Jewish Theological Seminary at a time when both Kaplan and Heschel were living. Both Kaplan and Heschel confronted more traditional elements within Conservative Judaism, but each of them sought to redefine Judaism in different ways. While Kaplan favored a positivist, rationalist, and scientific approach to Judaism, Heschel's approach was philosophical, mystical, and spiritual. In effect, Heschel and Kaplan offered competing approaches to the liberalization of Jewish theology.", "Gordon Tucker's liberalism could be said to reflect Heschel's own political activism. According to Neil Gillman, a historian of Conservative Judaism, \"Heschel insisted that his turn to political activism was prompted by his experience of living in Europe in the decades before World War II. He had been a personal witness to political oppression and was painfully aware that many otherwise good people stood on the sidelines and did not intervene. He was not going to repeat that pattern in America.\" Heschel's mystical spirituality lead him to become a champion within American Jewry of liberal causes and political activism.", "The Committee rejected Gordon Tucker's takkanah. Details of this issue are discussed in Conservative Halakha. Tucker's proposed takkanah became, in effect, a dissenting opinion.", "In her forward to Heavenly Torah, Heschel's daughter Susannah Heschel describes the scope and magnitude of this translation.  \"Gordon Tucker (and Rabbi Leonard Levin) have done a superb job of assembling, editing, abridging, and translating a huge, not-quite-finished manuscript. Others literally died trying to translate this sprawling masterpiece. There may be some dissent from the inevitable omissions, some few typos, some doubts about Tucker's interpretations. But on the whole, the introductions to each chapter, the explanatory notes on almost every page (including identifying Heschel's often obscure sources) are wonderful aids in working through this massive work.\"", "* Heschel, Abraham Joshua. Heavenly Torah: As Refracted through the Generations. Edited and Translated with Commentary by Gordon Tucker with Leonard Levin. (New York, London: Continuum, 2004)"]}, {"page": "1988–89 Huddersfield Town A.F.C. season", "response": ["|Gordon Tucker||||DF||11 (1)||0||0 (1)||0||1 (1)||0||1 (1)||0||13 (4)||0"]}, {"page": "1987–88 Huddersfield Town A.F.C. season", "response": ["|Gordon Tucker||||DF||19 (4)||0||0 (1)||0||2||0||0 (1)||0||21 (6)||0"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Gordon Tucker||||1987–1989||30 (5)||0||0 (2)||0||3 (1)||0||1 (1)||0||0||0||34 (9)||0"]}]}}