{"wiki_id": "http://www.wikidata.org/entity/Q5586002", "itemLabel": "Gordon Wilson", "itemDescription": "Scottish politician (1938-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gordon_Wilson_(Scottish_politician)", "wikipedia_page": {"main": "Robert Gordon Wilson (16 April 1938 – 25 June 2017) was a Scottish politician and solicitor. He was the leader of the Scottish National Party (SNP) from 1979 to 1990, and was SNP Member of Parliament (MP) for Dundee East from 1974 to 1987. He was Rector of the University of Dundee from 1983 to 1986.", "link_mentions": [{"page": "April 16", "response": ["*  1938   – Gordon Wilson, Scottish lawyer and politician (d. 2017)"]}, {"page": "Scottish National Party", "response": ["These events ensured the success of a leadership motion at the party's annual conference of 1982, in Ayr, despite the 79 Group being bolstered by the merger of Jim Sillars' Scottish Labour Party (SLP) although this influx of ex-SLP members further shifted the characteristics of the party leftwards. Despite this, traditionalist figure Gordon Wilson remained party leader through the electoral disappointments of 1983 and 1987, where he lost his own Dundee East seat won 13 years prior.", "|Gordon Wilson (1938–2017)", "|Gordon Wilson (1938–2017)", "* Gordon Wilson, 1964–1971", "| rowspan=\"2\" align=left| Gordon Wilson"]}, {"page": "1987 United Kingdom general election", "response": ["|Gordon Wilson"]}, {"page": "79 Group", "response": ["The SNP leadership under Gordon Wilson finally decided that the group's activity must be stopped. At the 1982 SNP conference in Ayr, Wilson threatened to resign unless the conference passed a motion to proscribe all organised political groupings within the party (the motion covered Winifred Ewing's Campaign for Nationalism in Scotland as well). He won what was described as a Pyrrhic victory by 308 to 188. However the 79 Group's members mostly retained their offices within the party.Jonathan Wills, \"Poll setback as SNP rifts widen\", The Times, 8 June 1982, p. 2."]}, {"page": "Siol nan Gaidheal", "response": ["They have been branded as like \"proto fascists\" by former SNP leader Gordon Wilson."]}, {"page": "Gordon Wilson", "response": ["Gordon Wilson may refer to:", "*Gordon Wilson (British Columbia politician) (born 1949), Canadian politician, former leader of British Columbia Liberal Party", "*Gordon Wilson (Nova Scotia politician) (born 1955), Canadian politician, member of the Nova Scotia House of Assembly", "*Gordon Wilson (peace campaigner) (1927–1995), Irish peace campaigner and senator", "*Gordon Wilson (Scottish politician) (1938–2017), leader of the Scottish National Party", "*Gordon Wilson (American football) (1915–1997), American football player", "*Gordon Wilson (footballer) (born 1944), Scottish footballer", "*Gordon Wilson (architect) (1900–1959), New Zealand architect", "*Sir Gordon Wilson (British Army officer) (1887–1971), British Army officer"]}, {"page": "Scottish Constitutional Convention", "response": ["Initially, the Scottish National Party (SNP) participated, but the then party leader Gordon Wilson, along with Jim Sillars, decided to withdraw the SNP from participation owing to the convention's unwillingness to discuss Scottish independence as a constitutional option."]}, {"page": "Jimmy Reid", "response": ["About a year after he left the CP Reid joined the Labour Party. He was Labour candidate in Dundee East in 1979, but lost to Gordon Wilson, then the leader of the Scottish National Party (SNP). Writing in the aftermath of the election, Anthony Finlay stated in The Glasgow Herald that it was \"only because the Labour Party was foolish enough to pick Jimmy Reid\", that Wilson held the seat when all but one of the 10 other SNP MPs was defeated. The decision by Dundee East Constituency Labour Party to select him as its candidate was controversial, as he had been a party member for less than the two years normally expected. "]}, {"page": "Margaret Ewing", "response": ["Ewing then worked as a freelance journalist. Now known as Margaret Ewing, she was selected by the SNP as their candidate for Moray at the 1987 election. She was re-elected to Westminster and again in 1992 and 1997, holding this seat until standing down at the 2001 general election to concentrate on Holyrood. She stood for the leadership of the SNP in 1990 but lost out to Alex Salmond despite the backing of many prominent SNP members (such as Jim Sillars). Ewing had become leader of the SNP's parliamentary group after the 1987 election. The leadership vacancy was caused by the fact that the SNP Chairman Gordon Wilson had lost his seat at Dundee Dundee East and previous group leader Donald Stewart had retired from parliament. While, the three SNP MPs elected in 1987 had not been members of the previous parliament, both Ewing and Andrew Welsh had served in parliament in the past. A post-election meeting held at Perth between Ewing, Welsh, Salmond (newly elected as MP for Banff and Buchan) and Wilson led to Ewing's appointment with Welsh becoming the group's chief whip."]}, {"page": "Billy Wolfe (politician)", "response": ["Wolfe was born in Bathgate, West Lothian, the son of Thomas Wolfe, owner of George Wolfe & Sons Ltd. and the Bathgate Forge Co. Ltd, which manufactured shovels. Gordon Wilson, Wolfe, William Cuthbertson (1924–2010), Oxford Dictionary of National Biography, Oxford University Press He was educated at Bathgate Academy and George Watson's College, Edinburgh, and saw active service during World War II, serving with the Scottish Horse (Royal Artillery) from 1942 to 1947 in France, the Low Countries, Germany, Indonesia and Malaya. Following demobilization, he qualified as a chartered accountant in 1952, and was company secretary of the family firms from 1952 to 1964.", "It was during Wolfe's period as leader that the party had considerable electoral success in elections to the Westminster parliament, winning 30% of the vote in Scotland and 11 of the 71 Scottish seats in the October 1974 General Election, though Wolfe failed to win a seat of his own in West Lothian in the two general elections of that year, despite gaining an increased share of the vote. His exclusion from the powerful new group of SNP MPs caused some difficulties for his leadership of the party. However, following a difficult period which saw the passing of the Scotland Act 1978, a number of internal divisions in the SNP and the failure of the party to win in a series of by-elections, in 1978 Wolfe announced his intention to stand down as leader after almost ten tumultuous years in office. The resultant loss of influence led to his being sidelined as the SNP moved into the 1979 general election campaign, and a disastrous performance in which the SNP only managed to retain 2 of their 11 MPs. Wolfe was succeeded by Gordon Wilson at the SNP Annual National Conference in September 1979."]}, {"page": "Labour Party of Scotland", "response": ["William Wolfe, then leader of the SNP, dismissed the Labour Party of Scotland's founding as opportunism on the part of local politicians. These included George MacLean, the party's most popular member, whose by-election rival Gordon Wilson succeeded Wolfe in 1979.", "Unlike its Glaswegian counterpart, which exclusively contested elections to the Glasgow Corporation, Dundee's now larger party fought for a seat in the United Kingdom Parliament. The appointment of George Thomson as a European Commissioner in January 1973 saw him vacate his constituency of Dundee East, triggering a by-election two months later. The Labour Party of Scotland selected George MacLean to be its candidate, pitting him against Labour's George Machin, the SNP's Gordon Wilson and Conservative candidate William Fitzgerald, then Lord Provost of Dundee.  Nathaniel Gordon of the Liberal Party, equally optimistic, attracted Jeremy Thorpe to the city during his campaign.   In a closely fought contest, George Machin took the seat with a majority of 1,141, despite Labour's vote share declining by 15.6%. This was largely down to the strong performance of the SNP, who increased its own by 21.2%. The latter's campaign capitalised on keeping North Sea oil in Scotland to benefit people living in urban areas. A similar platform was used in the Glasgow Govan by-election later that year, successfully electing Margo MacDonald to the House of Commons.", "Political scientist David Boothroyd believes that the intervention of the Labour Party of Scotland in the Dundee by-election prevented similar accomplishment by splitting the nationalist vote. Indeed, the 1,409 votes for MacLean outnumbered Machin's majority over his SNP rival Gordon Wilson; Boothroyd further opines \"it is questionable whether voters were clear about [the party's] origin.\" Nevertheless, the SNP's popularity in both 1973 by-elections served as a prelude to the \"It's Scotland's oil\" political campaign, which has since become synonymous with the party's economic case for Scottish independence.Brocklehurst, Steven ", "On 2 May 1973 elections to Dundee City Council commenced, with the Labour Party of Scotland fielding a total of nine candidates in eight of the city's 12 wards. MacLean stood in the Downfield area and returned the party's best result, capturing 242 ballots and 6.1% of the vote; D. McGarry, one of two party candidates in Camperdown, produced the weakest, collecting 1.6% with 123 votes. None of the party's candidates were elected, leading to its quiet dissolution 22 days later. Such a decision was made in conjunction with the previously unaffiliated Glasgow party so that \"the national movement could show a united front\"; commentators Andrew Murray Scott and Iain MacLeay simply surmise \"[n]either group was successful\". Dissolved by a motion with seven for and just one against, most of their members duly returned to the SNP, some becoming involved with the party's pirate station Radio Free Scotland. Without the encumbrance of the minor Dundee group, Gordon Wilson was returned as Member of Parliament for Dundee East in February's general election of the following year, concurrently serving as Depute Leader of his party. Wilson later served as Leader of the SNP from 1979 to 1990, succeeding William Wolfe."]}, {"page": "Campaign for Nationalism in Scotland", "response": ["SNP leader Gordon Wilson was determined to end factionalism inside the SNP, and at the party conference of 1982 internal groupings were banned.  This was largely a reaction to the growth of the 79 Group who faded in significance after this decision was taken.  After the 79 Group fell apart the Campaign for Nationalism in Scotland did likewise (however, many of the members of the 79 group were readmitted, and indeed came to lead the party)."]}, {"page": "John McAllion", "response": ["McAllion was originally a member of the Scottish Labour Party (SLP) that was formed in 1976 by Jim Sillars, when the SLP collapsed he chose to join the Labour Party (unlike Sillars who joined the Scottish National Party). A teacher by profession, McAllion became a Labour member of Tayside regional council of which he became the convenor in 1986. In the 1987 general election McAllion was elected Labour MP for the Dundee East constituency, defeating SNP leader Gordon Wilson, who had been the sitting MP since 1974."]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Gordon Wilson"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|Gordon Wilson"]}, {"page": "List of MPs elected in the October 1974 United Kingdom general election", "response": ["|Gordon Wilson"]}, {"page": "Willie McRae", "response": ["McRae became a solicitor and an SNP activist. In both of the 1974 General Elections and in the 1979 General Election he stood for Parliament as the SNP candidate for Ross and Cromarty. In October 1974 he only lost to the Conservative Hamish Gray by 633 votes, but in 1979 Gray's majority increased to 4,735. In the latter year he also contested the SNP leadership, coming third in a three-way contest with 52 votes to Stephen Maxwell's 117 votes and winner Gordon Wilson's 530 votes."]}, {"page": "Douglas Henderson (SNP politician)", "response": ["He returned to his business career, but with less success than the 1960s. At the SNP Conference in 1979, he was elected the party's Senior vice-chairman (now described as deputy leader) (to leader Gordon Wilson), defeating Margo MacDonald for the post.  He remained in this position until 1981, when he stood down on health grounds."]}]}}