{"wiki_id": "http://www.wikidata.org/entity/Q5585598", "itemLabel": "Gordon Murray", "itemDescription": "British producer and puppeteer", "wikipedia_url": "https://en.wikipedia.org/wiki/Gordon_Murray_(puppeteer)", "wikipedia_page": {"main": "Gordon Murray (3 May 1921 – 30 June 2016) was a British television producer and puppeteer. He created and wrote some of the most repeated children's television programmes ever seen in Britain. Camberwick Green, Trumpton,  and Chigley, collectively known as the Trumptonshire Trilogy, were all made by the company he founded.", "link_mentions": [{"page": "South East England", "response": ["Trumpton (1967) was  based on Plumpton, East Sussex, with other titles in the series based on nearby villages; Trumpton was actually shot by Gordon Murray's company in Crouch End, London. Gerry Anderson's AP Films filmed Thunderbirds on the Slough Trading Estate near to the site's cooling towers, being first broadcast in 1965. The Native American woman Pocahontas is buried at St George's Church, Gravesend in Kent and was the inspiration for the popular Disney animated film of the same name."]}, {"page": "Camberwick Green", "response": ["The series was written and produced by Gordon Murray and animated by Bob Bura, John Hardwick and Pasquale Ferrari. Music was by Freddie Phillips while narration and song vocals were provided by Brian Cant. There are thirteen fifteen-minute colour episodes produced by Gordon Murray Pictures. The inspiration for the name is believed to have stemmed from the East Sussex village of Wivelsfield Green, supported by the nearby villages of Plumpton (Trumpton) and Chailey (Chigley).", "However, when boxes of some original film were discovered in Gordon Murray's attic – with more footage then discovered by the BBC – the trilogy was restored and remastered for a Blu-ray release in 2011. However, as of 2019, Trumpton and Chigley have yet to have received a Blu-ray release.", "* Puppets: Gordon Murray", "* Produced by Gordon Murray Puppets Ltd 1966."]}, {"page": "Trumpton", "response": ["The fire brigade is perhaps Trumpton's most-recognised feature. Captain Flack's roll-call was recited in all but one episode:  Puppeteer Gordon Murray has explained that \"Pugh and Pugh are twins you must understand – not Hugh, Pugh\". In the episode \"Cuthbert's Morning Off\", Cuthbert's name is omitted (due to his absence). They are continually being called out to attend some emergency or other (in many cases to resolve fairly trivial matters), but to Captain Flack's annoyance never an actual fire. The main reason for this was the difficulty of animating fire, water, and smoke, although a naked flame was successfully animated in episode 8, for the abortive lighting of a bonfire. Nonetheless, after \"Right men, action stations!\", the fire brigade often absent-mindedly deployed the fire hose and received a rebuke from Captain Flack (\"No, no! Not the hose!\").", "Writer Gordon Murray has said that the communities of the series are \"representative of real locations which are one-and-a-half miles from each other in an equidistant triangle\", but declined to name them for fear of the area being \"inundated with tourists\".", "In 2011, BBC Studios and Post Production digitally restored all 39 episodes of the Trumptonshire trilogy (Camberwick Green, Trumpton and Chigley) after William Mollett, son-in-law of the creator Gordon Murray, found some original footage in an attic. He then approached the BBC to see if it could track down the missing 40‐year‐old original footage, which was eventually traced to the BBC broadcast archive (now in Perivale, west London) but it soon became very clear that its age meant that restoration would be a difficult and delicate task. Murray and Mollett enlisted the expertise of BBC Studios and Post Production, which cleaned, scanned and digitally restored the film footage frame by frame.", "* Devised & Produced by Gordon Murray Puppets Ltd 1967."]}, {"page": "Chigley", "response": ["Chigley (1969) is the third and final stop-motion children's television series in Gordon Murray's Trumptonshire trilogy. Production details are identical to Camberwick Green.", "* Script & Puppets: Gordon Murray", "* A Gordon Murray Production MCMLXIX."]}, {"page": "Marionette", "response": ["From the 1940s onwards, the BBC in the United Kingdom, produced a wide series of marionette programmes for children and then created The BBC Television Puppet Theatre  based in Lime Grove Studios from 1955–1964, Usually under the title Watch With Mother The various programmes included Whirligig, The Woodentops, Bill and Ben, Muffin The Mule, Rubovia a series created by Gordon Murray and Andy Pandy. Later in the 1960s, Gerry Anderson with his wife, Sylvia Anderson and colleagues made a number of hit series, Fireball XL5, Stingray and Thunderbirds, which pioneered a technique combining marionettes and electronics. This allowed for radio control moving of the mouth of a marionettes. The technique was patented and called \"supermarionation\". The programs have been shown all around the world and are now widely distributed on DVD. Anderson also made two films, Thunderbirds Are Go and Thunderbird 6. During the 1970s in the UK TV series using marionettes include The Adventures of Rupert Bear, Mumfie and Cloppa Castle. Some marionettes appear in Pipkins namely Octavia Ostrich."]}, {"page": "Captain Pugwash", "response": ["Captain Horatio Pugwash made his debut in a comic-strip format in the first issue of The Eagle in 1950, then appeared regularly as a strip in Radio Times. In 1957 the BBC commissioned a series of short cartoon films produced by Gordon Murray. Between 1957 and 1966, Ryan produced a total of 58 five-minute-long episodes for the BBC, made in black-and-white. Between 1974 and 1975, a further 30 were made in a new series made in colour. Ryan used a real-time technique of animation in which cardboard cutouts of the characters were laid on painted backgrounds and moved with levers. The characters' voices were provided by Peter Hawkins. The last series of Pugwash shorts by Ryan was produced in 1975.", "Produced and directed by Gordon Murray (Series 1–8)."]}, {"page": "1921 in the United Kingdom", "response": ["** Gordon Murray, television producer and puppeteer (died 2016)"]}, {"page": "Sister show", "response": ["* The Trumptonshire series had Camberwick Green, Trumpton and Chigley villages in the same area. Gordon Murray stated that the area of \"Trumptonshire\" is \"representative of real locations which are one-and-a-half miles from each other in an equidistant triangle\".http://www.t-web.co.uk/trumpvil.htm Several characters appear in guest roles in other villages."]}, {"page": "List of fictional European countries", "response": ["* Borsovia: A kingdom in Eastern Europe that featured in Gordon Murray's BBC Television children's puppet series A Rubovian Legend, 1955–63.", "* Rubovia: a kingdom in Eastern Europe that featured in Gordon Murray's BBC Television children's puppet series A Rubovian Legend, 1955–63."]}, {"page": "Brian Cant", "response": ["His involvement in Play School directly led to his work on three linked Gordon Murray puppet series: Camberwick Green (1966), Trumpton (1967), and Chigley (1969). Later, Cant hosted or co-hosted the programmes Play Away (1971–84), and Bric-a-Brac (1980–82) for slightly older children. From 1990 to 1999, he starred as Brian the farmer in children's television puppet programme Dappledown Farm, as well as providing the voice for one of the characters, Harry the Heron. He was also the narrator of the UK versions of Jay Jay the Jet Plane and the popular Canadian children's show Bruno."]}, {"page": "Murray (surname)", "response": ["*Donald Walter Gordon Murray (1894–1976), Canadian surgeon", "*Gordon Murray (born 1946), designer of Formula One race cars", "*Gordon Murray (puppeteer) (1921–2016), British television producer and puppeteer", "*K. Gordon Murray (1922–1979), American film producer"]}, {"page": "The Woodentops (TV series)", "response": ["Puppeteers: Audrey Atterbury, Molly Gibson and Gordon Murray"]}, {"page": "Multi-Coloured Swap Shop", "response": ["As a consequence of this action, many of the clips used in the retrospective It Started With Swap Shop and as extras on some DVD releases of other BBC shows had to be taken from domestic video recordings that had survived in private hands. Amongst the editions wiped were those featuring appearances by Blondie, XTC, Trumpton creator Gordon Murray, and numerous cast and crew members of Doctor Who."]}, {"page": "Chailey", "response": ["Chailey is reputed to be the inspiration for the 1969 children's television series Chigley by Gordon Murray, (along with nearby Plumpton as Trumpton and Wivelsfield Green as Camberwick Green)."]}, {"page": "Plumpton, East Sussex", "response": ["Plumpton Green is rumoured to have been the inspiration for the popular 1960s British children's television series Trumpton by Gordon Murray, with nearby Chailey being Chigley and Wivelsfield Green being Camberwick Green."]}, {"page": "Wivelsfield", "response": ["*Wivelsfield Green is reputed to be the inspiration for the 1960s children's television series Camberwick Green by Gordon Murray, (along with nearby Plumpton as Trumpton and Chailey as Chigley)."]}, {"page": "The Gublins (TV series)", "response": ["The Gublins (also known as The Gublin Legends) is a stop-motion children's television show broadcast between 1977 and 1979. It was the final animated series made by British animator Gordon Murray, the creator of Camberwick Green, Trumpton and Chigley and was shown as part of the Saturday morning children's TV show Multi-Coloured Swap Shop on BBC One. Each episode was 5 minutes long with Murray introducing each one directly to camera."]}, {"page": "Trumptonshire", "response": ["Trumptonshire is a fictional county created by Gordon Murray, in which the Trumptonshire Trilogy of Camberwick Green (1966), Trumpton (1967), and Chigley (1969) are located. Trumptonshire is populated by characters portrayed by 8-inch (20 cm) tall stop-motion puppets. Trumpton is a market town with an impressive town hall and clock tower; Camberwick Green and Chigley are two nearby villages."]}, {"page": "Gordon Murray (disambiguation)", "response": ["Gordon Murray is a South African car designer.", "Gordon Murray may also refer to:", "* Gordon Murray (politician) (1927–2015), Scottish nationalist politician", "*Gordon Murray (puppeteer) (1921–2016), British television producer and puppeteer", "*Donald Walter Gordon Murray (1894–1976), aka Gordon Murray, Canadian surgeon", "*Gordon Murray, Scottish architect, see Gordon Murray & Alan Dunlop Architects"]}, {"page": "History of British animation", "response": ["The popularisation of television broadcasting in the UK during the 1950s brought with it both new avenues for animation production and a shift in the demographic orientation of animation to the realms of children's programming. The year 1950 saw the premier of the long-running children's TV series Watch with Mother (1950–74) which would not include animation per se, but would feature several puppet-based segments (such as \"Andy Pandy\" and \"Flower Pot Men\") that would later become staples of British children's popular imagery and animation. Such is the case as well with the children's book character Noddy, who has appeared in various iterations and with different means of animation ranging from stop-motion to CGI to this day. The BBC's investment in resources and personnel oriented to children's media during this time would also provide avenues for the service's eventual inclusion of animation—particularly stop-motion animation, which could be derived from some of the same resources and skill-sets as live action puppetry. Puppeteer Gordon Murray for example, would  branch off from his work on the \"Watch with Mother\" segment \"The Woodentops\" and other live action puppet shows to create several stop motion animated children's series in the 1960s, including \"Camberwick Green\" (1966), \"Trumpton\" (1967) and \"Chigley\" (1969). Modelmaker Peter Firmin and writer Oliver Postgate similarly created several stop-motion animated works for children during this period, including \"Pingwings\" (1961–1964), \"Pogles' Wood\" (1966–1967) and \"Clangers\" (1969–1972).Sibley, Brian (1998). \"The Medium\". In Lord, Peter; Sibley, Brian. Cracking Animation (1st ed.). Thames and Hudson. p. 38 It is during this period that ties between the UK's children's animation and several other British media and literary tendencies consolidated, with shows of this period providing a blueprint for future children's TV focussing on rural communities and day-to-day interpersonal relationships. Within this tendency, strong ties can be seen within children's TV and much older pastoral children's literature, social realist cinema and documentary, and the theatrical comedy of manners. This transition from puppetry to stop-motion also demonstrates the influence of Eastern European animation (such as that of Czech animator Jiří Trnka and his followers), with its own proclivity for wood and felt animation puppets and often static facial features. Trnka's work helped to inspire British production companies, including Pete Bryden and Ed Cookson's BBC-commissioned stop-frame animated children's series Summerton Mill (2005)."]}, {"page": "A Rubovian Legend", "response": ["A Rubovian Legend  (1955) is a British children's television series created by Gordon Murray."]}, {"page": "Freddie Phillips", "response": ["Mainly a classical guitarist, Phillips worked and performed in the fields of opera and ballet, including with The Royal Ballet, and with the BBC Symphony Orchestra. His television career began with providing musical scores for a pair of short films by Lotte Reiniger, and composing short pieces for use in television continuity. Around this time he began his involvement with the animator Gordon Murray, firstly with A Rubovian Legend, and later the Trumptonshire trilogy of children's TV programmes. Phillips wrote individual songs for the characters in the latter programmes for Brian Cant to perform, as well as the title music."]}, {"page": "The Trumpton Riots EP", "response": ["In May 2016, The Guardian newspaper reported that Gordon Murray's family were contemplating suing the band Radiohead for infringing the copyright of the idea of Trumptonshire in the video for their single \"Burn the Witch\". The same report noted that Half Man Half Biscuit's 1980s song \"The Trumpton Riots\" had \"portrayed Trumptonshire as a place of striking firemen, militant socialism, and military coups\"."]}, {"page": "List of Old Emanuels", "response": ["* Gordon Murray – puppeteer (Camberwick Green, Chigley, Trumpton)"]}, {"page": "Alison Prince", "response": ["Prince later moved into writing for children's television, gaining notice with her scripts for the stop motion animated puppet series Trumpton (1967) for young children produced by Gordon Murray. Prince also wrote the lyrics for the songs performed by Brian Cant. \"I didn’t have a television, but I had three kids to feed, so I said yes,\" she recalled in 2006. "]}, {"page": "2016 in the United Kingdom", "response": ["**Gordon Murray, 95, television producer and puppeteer (Trumpton, Camberwick Green, Chigley)."]}, {"page": "2016 in animation", "response": ["* June 30: Gordon Murray, British puppeteer, animator, animated film and TV producer (A Rubovian Legend, Camberwick Green, Trumpton, Chigley, worked on Captain Pugwash), dies at age 95."]}, {"page": "2016 in British television", "response": ["|Gordon Murray"]}]}}