{"wiki_id": "http://www.wikidata.org/entity/Q5586735", "itemLabel": "Samuel Brittan", "itemDescription": "English journalist and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Samuel_Brittan", "wikipedia_page": {"main": "Sir Samuel Brittan (29 December 1933 – 12 October 2020) was an English journalist and author. He was the first economics correspondent for the Financial Times, and later a long-time columnist. He was a member of the Academic Advisory Council of the Global Warming Policy Foundation.", "link_mentions": [{"page": "December 29", "response": ["*1933 – Samuel Brittan, English journalist and author"]}, {"page": "Friedrich Hayek", "response": ["Samuel Brittan, concluded in 2010 that \"Hayek's book [The Constitution of Liberty] is still probably the most comprehensive statement of the underlying ideas of the moderate free market philosophy espoused by neoliberals\".Samuel Brittan, \"The many faces of liberalism,\" ft.com, 22 January 2010 Brittan adds that although Raymond Plant (2009) comes out in the end against Hayek's doctrines, Plant gives The Constitution of Liberty a \"more thorough and fair-minded analysis than it has received even from its professed adherents\". As a neo-liberal, he helped found the Mont Pelerin Society, a prominent neo-liberal think tank where many other minds, such as Mises and Friedman gathered."]}, {"page": "Hugh Gaitskell", "response": ["Rab Butler and Samuel Brittan, both writing in the early 1970s, commented that Gaitskell was the most technically qualified chancellor of the 20th century up until that date. However, Dell comments that he often went into excessive detail, including personally overseeing economic forecasts, and held excessively long meetings. This may have been from a love of micro-management or because, as an advocate of controls and planning, he was suspicious of treasury officials, whom he thought excessively inclined to free market mechanisms.Dell 1997, p.139"]}, {"page": "Norman Lamont", "response": ["The day after his dismissal from the Treasury, Sir Samuel Brittan wrote in the Financial Times that history was likely to record him as one of the better Chancellors, citing his structural reforms of taxation, his determination to give priority to securing and maintaining low inflation and the delayed tax increases in his final budget. \"He leaves behind an economy with a faster growth rate than that of any other of the main G7 countries and an underlying rate of inflation lower than in most.\"Financial Times, 29 May 1993. According to Ruth Lea, writing 12 years later on the factors behind the subsequent performance of the British economy, Lamont had introduced path-breaking macro-economic reforms including inflation targeting and the first steps towards an independent Bank of England and had begun a programme of fiscal consolidation, which transformed the public finances.  \"These macro economic reforms, along with the Thatcher economic reforms of the 1980s, effectively transformed the British economy.\""]}, {"page": "Malcolm Rifkind", "response": ["Rifkind was born in Edinburgh to a Jewish family that emigrated to Britain in the 1890s from Lithuania; among his cousins were Leon and Samuel Brittan. He was educated at George Watson's College and the University of Edinburgh where he studied law before taking a postgraduate degree in political science (his thesis was on land apportionment in Southern Rhodesia). While at university he took part in an overland expedition to the Middle East and India. He also appeared on University Challenge."]}, {"page": "Leon Brittan", "response": ["He was educated at the Haberdashers' Aske's Boys' School and Trinity College, Cambridge, where he was President of the Cambridge Union Society and Chairman of the Cambridge University Conservative Association. Brittan then studied at Yale University on a Henry Fellowship. Sir Samuel Brittan, the economics journalist, was his brother. The former Conservative MP Malcolm Rifkind, and the music producer Mark Ronson, were cousins."]}, {"page": "Institute of Economic Affairs", "response": ["* Samuel Brittan"]}, {"page": "Social liberalism", "response": ["Following economic problems in the 1970s, liberal thought underwent some transformation. Keynesian economic management was seen as interfering with the free market, while increased welfare spending that had been funded by higher taxes prompted fears of lower investment, lower consumer spending and the creation of a \"dependency culture\". Trade unions often caused high wages and industrial disruption while full employment was regarded as unsustainable. Writers such as Milton Friedman and Samuel Brittan, who were influenced by Friedrich Hayek, advocated a reversal of social liberalism. Their policies—which are often called neoliberalism—had a significant influence on Western politics, most notably on the governments of United Kingdom Prime Minister Margaret Thatcher and the United States President Ronald Reagan, who pursued policies of deregulation of the economy and reduction in spending on social services."]}, {"page": "Nobel Prize controversies", "response": ["The most notorious controversies have been over prizes for Literature,Controversial Turkish Writer Wins Nobel Prize – Radio Free Europe / Radio Liberty 2011. Rferl.org (12 October 2006). Retrieved 20 March 2011.First Arab Nobel Prize Winner in Literature Dies at 94 – International News|News of the World|Middle East News|Europe News. FOXNews.com (30 August 2006). Retrieved 20 March 2011.Amartya Sen (28 August 2001) Tagore and His India. nobelprize.org Peace, and Economics.Samuel Brittan (19 December 2003) \"The not so noble Nobel Prize \", Financial Times.Burton Feldman (2000) The Nobel Prize: A History of Genius, Controversy and Prestige, Arcade Publishing,  Beyond disputes over which contributor's work was more worthy, critics most often discerned political bias and Eurocentrism in the result. The interpretation of Nobel's original words concerning the Literature prize has also undergone repeated revisions."]}, {"page": "Power: A New Social Analysis", "response": ["However, his writings in political philosophy have been relatively neglected by those working in the social sciences. From the point of view of many commentators, Power: A New Social Analysis has proven itself to be no exception to that trend. Russell would later comment that his work \"fell rather flat\" (Russell 1969). Samuel Brittan and Kirk Willis, who wrote the preface and introduction to the 2004 edition (respectively), both observed the relative lack of success of the work (Russell 1938:viii, xxiv–xxv).", "* Introduction to a 2004 edition by Samuel Brittan"]}, {"page": "In Defense of Global Capitalism", "response": ["Samuel Brittan of Financial Times wrote:"]}, {"page": "Peacock Committee", "response": ["The Peacock Committee, was a review into financing of the BBC.  It was initiated by the Conservative government of Margaret Thatcher on 27 March 1985 and reporting on 29 May 1986.  The committee was led by Professor Alan Peacock. The other six members were Samuel Brittan, Judith Chalmers, Jeremy Hardie, Professor Alastair Hetherington, Lord Quinton, and Sir Peter Reynolds.  "]}, {"page": "List of British Jewish scientists", "response": ["* Samuel Brittan, economist"]}, {"page": "Category talk:British journalists", "response": ["Samuel Brittannot yet classified"]}, {"page": "1933 in the United Kingdom", "response": ["* 29 December – Samuel Brittan, economic journalist (died 2020)"]}, {"page": "Christopher Coyne (professor)", "response": ["His first book, After War: The Political Economy of Exporting Democracy, was published by Stanford University Press in November 2007 (; paperback ). After War employs the tools of economics to analyze the ability of the U.S. to export democracy abroad.  The central argument is that continued efforts to export democracy through military occupation and reconstruction are more likely to fail than to succeed because of an array of constraints facing occupiers and policymakers.  In the book, Coyne contends that failure is due to the inability of foreign governments to centrally plan the complex array of institutions which underpin liberal democracy.  Coyne provides a new vision of U.S. foreign policy including principled nonintervention and a commitment to free trade in goods, ideas and cultural products. He presented his book at the Cato Institute in November 2007.CATO Institute: After War Book Forum  In his review of After War in the Financial Times, Samuel Brittan concluded by noting that,"]}, {"page": "2008–2009 Keynesian resurgence", "response": ["Theoretical arguments regarding the relative merits of free market versus mixed economy policies do not always yield a clear conclusion. In his 2009 book Keynes: The Return of the Master, economic historian Lord Skidelsky has a chapter comparing the performance of the world economy between the \"golden age\" period of 1951–1973, when Keynesian policies were dominant, with the Washington Consensus period of 1981–2008, when free market policies were adopted by leading governments. Samuel Brittan of the Financial Times called this part of the book the key chapter for the practically inclined reader."]}, {"page": "Nobel Memorial Prize in Economic Sciences", "response": ["According to Samuel Brittan of the Financial Times, both former Swedish minister of finance (Kjell-Olof Feldt) and Swedish former minister of commerce (Gunnar Myrdal) wanted the prize abolished, saying, \"Myrdal rather less graciously wanted the prize abolished because it had been given to such reactionaries as Hayek (and afterwards Milton Friedman).\" Relatedly, it has been noted that several members of the awarding committee have been affiliated with the Mont Pelerin Society."]}, {"page": "2000s European sovereign debt crisis timeline", "response": ["This was the first Eurozone crisis since its creation in 1999. As Samuel Brittan pointed out, Jason Manolopoulos \"shows conclusively that the Eurozone is far from an optimum currency area\". Niall Ferguson also wrote in 2010 that \"the sovereign debt crisis that is unfolding... is a fiscal crisis of the western world\". Axel Merk argued in a May 2011 Financial Times article that the dollar was in graver danger than the euro. This reference links to a Google search where the first result is the correct link. Following the link directly would result in the news site requiring a subscription to access the article. Going through Google allows you to access the article without paying for a subscription."]}, {"page": "Beyond the Crash", "response": ["Samuel Brittan in The Financial Times opines that Brown's message on the continual need for aggregate demand to be maintained very much needs to be heard, especially by European politicians who may be overly influenced by deficit cutting fiscal fundamentalism."]}, {"page": "Brittan", "response": ["*Samuel Brittan (1933-2020), British newspaper columnist and author"]}, {"page": "1993 Birthday Honours", "response": ["*Samuel Brittan, Principal Economic Commentator and Assistant Editor, Financial Times. For Services to Economic Journalism."]}, {"page": "Free Market Fairness", "response": ["In the peer-reviewed academic journal \"Political Theory,\" Elizabeth Anderson describes \"Free Market Fairness\" as launching \"a major research program - Market Democracy.\" Anderson writes, \"market democracy offers a refreshing change from stale debates within libertarian and high liberal ideal theory. Tomasi is right to stress that the economy is an important domain of liberty wrongly denigrated by high liberals, as distributive justice has been wrongly denigrated by libertarians.\"Political Theory 41 (1):163-166 (2013). In a review in the European journal \"Res Publica,\" Alan Thomas calls Free Market Fairness \"a landmark publication in political philosophy.\" Thomas writes \"It deserves many readers for its clarity, intelligence, openness to the ideas of others and yet insistence that the classically liberal tradition deserves to be represented alongside the standard options in recent political philosophy.\" Res Publica (2013) 12:381-385  In The Financial Times, Samuel Brittan criticized this, adding, \"Unfortunately the book does not live up to its splendid introduction.\"Samuel Brittan, Free Market Fairness, The Financial Times, May 6, 2012 He concluded, \"Tomasi describes free-market fairness as a research programme rather than a fixed dogma. There is clearly a lot more to research.\""]}, {"page": "Kilburn Grammar School", "response": ["* Sir Samuel Brittan, economic journalist"]}, {"page": "2020 in the United Kingdom", "response": ["*12 October – Sir Samuel Brittan, 86, English journalist and author. "]}, {"page": "Mais Lecture", "response": ["| Ninth || May 1989 || Samuel Brittan || A Restatement of Economic Liberalism"]}, {"page": "Deaths in October 2020", "response": ["*Sir Samuel Brittan, 86, British journalist and author.Samuel Brittan, economics editor, 1933-2020"]}]}}