{"wiki_id": "http://www.wikidata.org/entity/Q5584785", "itemLabel": "Gordon A. Smith", "itemDescription": "Canadian artist (1919-2020)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gordon_A._Smith", "wikipedia_page": {"main": "Gordon Appelbe Smith  (June 18, 1919 – January 18, 2020) was an English-born Canadian artist, known for expanding the dialogue between abstraction and representation, working with mediums such as painting, printmaking, and sculpting. Smith taught with contemporaries Bruno Bobak, B.C. Binning and Jack Shadbolt at the Vancouver School of Art (now Emily Carr University of Art and Design) for ten years, then for twenty-six years at the University of British Columbia before retiring in 1982 to paint full-time.", "link_mentions": [{"page": "1919", "response": ["* June 18 – Gordon A. Smith, English-Canadian artist (d. 2020)"]}, {"page": "List of Canadian painters", "response": ["* Gordon A. Smith (1919–2020) painter, printmaker, sculptor and teacher"]}, {"page": "List of Canadian artists", "response": ["* Gordon A. Smith (1919–2020), painter, printmaker, sculptor"]}, {"page": "1919 in art", "response": ["* June 18 – Gordon A. Smith, Canadian artist and teacher (d. 2020)"]}, {"page": "Gordon Smith", "response": ["*Gordon A. Smith (1919–2020), Canadian painter and sculptor who was born in England"]}, {"page": "Claude Brochu", "response": ["*In 1996, he received the Order of Canada along with Angèle Dubeau, Gordon A. Smith and Trevor Payne."]}, {"page": "B. C. Binning", "response": ["Bert and Jessie Binning fostered close ties with the most recognized figures in art in Vancouver. They were friends with Lawren S. Harris and his wife, artist Bess Harris. Those in his academic circle of intimates from art school were Gordon A. Smith and his wife Marion Smith, Orville Fisher, Fred Amess, John Koerner, Jack Shadbolt and his wife Doris Shadbolt, Lionel Thomas, and also Bruno Bobak and his wife Molly Lamb Bobak. It was an exciting time in the world art scene too. The oppressive constraints of Victorian attitudes toward art and architecture had been thrown off. In Europe and the United States, Modernist architecture and \"futuristic\" urban and regional design were taking hold and Binning wanted to introduce them to British Columbia.thumb|alt=|Plaque in front of the B.C. Binning house in West Vancouver|left In Binning's personal artistic practice he revealed his lifestyle. Known as an excellent draughtsman, he recorded his experiences in intricate line drawings: a detailed remembrance of an unusual hotel room, studies of peaceful-looking female figures, or an architectural drawing of a street in Vancouver. The drawings exude humour and love: a friend cutting a dog's hair or a picnic view from a high perch. Innovative and intelligent, his hospitality to students, colleagues and world figures alike made him a well-loved professor."]}, {"page": "Bratsa Bonifacho", "response": ["The city of Vancouver (Canada), Bonifacho's adopted home, honoured him by hanging six images  chosen from his Habitat Pixel series on city banners that were displayed along major thoroughfares and bridges in 2008. He joined the company of such internationally renowned local artists as Jack Shadbolt, Toni Onley, Gordon A. Smith, and Bill Reid.Rolfsen, \"Colourful banners to light up city\""]}, {"page": "List of Keys to the City in Canada", "response": ["* October 5, 2009: Gordon A. Smith, artist "]}, {"page": "Joy Zemel Long", "response": ["Zemel grew up in Vancouver and attended the Vancouver School of Art (later renamed the Emily Carr University of Art and Design), where she studied with Charles H. Scott, Fred Ames, Orville Fisher, Gordon A. Smith, Lionel Thomas, Jack Shadbolt and Bruno Bobak."]}, {"page": "Arnold Shives", "response": ["In 1962, Shives entered the University of British Columbia where he audited painter Gordon A. Smith's art classes. This was followed by two years at the San Francisco Art Institute (1964–66) where he studied painting with Julius Hatofsky and Richard Diebenkorn. In 1966 he won a Carnegie Corporation of New York Fellowship and entered the Graduate Program in Painting and Sculpture at Stanford University and studied under Frank Lobdell and Nathan Oliveira and came in contact with Elmer Bischoff and Italian sculptor Arnaldo Pomadoro. As Edward Lucie-Smith, author of Art Today, wrote in his essay \"Shives the Transcendentalist\": \"Shives was caught up in the radical climate of that time, but for him it triggered a spiritual quest -  one that led him first to an exploration of the Eastern religions and philosophies then in vogue, and finally back to Christianity -  specifically, in 1972, to Roman Catholicism.\"Edward Lucie-Smith, \"Shives the Transcendentalist\" in Alpine Anatomy; The Mountain Art of Arnold Shives, Tricouni Press, 2012, p.  35 Not only this tendency but equally a spiritual search led Shives to learn of Saint Josemaria Escriva whose doctrines of freedom and understanding provided a point of reference for his visionary way of seeing nature, spirit and art. Art historian, curator and writer Edward Lucie-Smith sees this as a key to Shives' art stating, \"His images are about freedom – the freedom not just to hike the mountains, but to be – by which I mean the freedom to exist in the natural world, in harmony with its age-old laws; the freedom to think; and the freedom to create in accordance with what both thought and emotion tell him.\"Edward Lucie-Smith, \"Shives the Transcendentalist\" in Alpine Anatomy; The Mountain Art of Arnold Shives, Tricouni Press, 2012, p.  36"]}, {"page": "2020 in Canada", "response": ["**Gordon A. Smith, artist (b.  1919)"]}, {"page": "Deaths in January 2020", "response": ["*Gordon A. Smith, 100, Canadian artist.Gordon Smith, beloved and influential Canadian artist, dies at 100"]}]}}