{"wiki_id": "http://www.wikidata.org/entity/Q5584023", "itemLabel": "William Lisle Bowles", "itemDescription": "English priest, poet and critic", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Lisle_Bowles", "wikipedia_page": {"main": "William Lisle Bowles (24 September 1762 – 7 April 1850) was an English priest, poet and critic.", "link_mentions": [{"page": "April 7", "response": ["*1850 – William Lisle Bowles, English poet and critic (b. 1762)"]}, {"page": "Sonnet", "response": ["The fashion for the sonnet went out with the Restoration, and hardly any were written between 1670 and the second half of the 18th century. Amongst the first to revive the form was Thomas Warton, who took Milton for his model. Around him at Oxford were grouped those associated with him in this revival, including John Codrington Bampfylde, William Lisle Bowles, Thomas Russell and Henry Headley, some of whom published small collections of sonnets alone.Bethan Roberts, Charlotte Smith and the Sonnet, OUP 2019, p.19 Among those who later acknowledged the impact of Bowles' sonnets on them were Samuel Taylor Coleridge, Robert Southey and Charles Lamb.Poetry Foundation, William Lisle Bowles And among the several other sonnet writers who were to constellate themselves about Warton's group was Charlotte Smith, to whose Elegaic Sonnets (1784 onwards) William Wordsworth acknowledged a considerable debt."]}, {"page": "Samuel Taylor Coleridge", "response": ["John Coleridge had three children by his first wife. Samuel was the youngest of ten by the Reverend Mr. Coleridge's second wife, Anne Bowden (1726–1809),James Gillman (2008) The Life of Samuel Taylor Coleridge. Bastion Books probably the daughter of John Bowden, Mayor of South Molton, Devon, in 1726.Unsworth, John, The Early Background of S.T. Coleridge, published in The Coleridge Bulletin, No 1, Summer 1988, pp 16–25  Coleridge suggests that he \"took no pleasure in boyish sports\" but instead read \"incessantly\" and played by himself.Coleridge, Samuel Taylor, Joseph Noel Paton, Katharine Lee Bates.Coleridge's Ancient Mariner Ed Katharine Lee Bates. Shewell, & Sanborn (1889) p.2 After John Coleridge died in 1781, 8-year-old Samuel was sent to Christ's Hospital, a charity school which was founded in the 16th century in Greyfriars, London, where he remained throughout his childhood, studying and writing poetry. At that school Coleridge became friends with Charles Lamb, a schoolmate, and studied the works of Virgil and William Lisle Bowles.Morley, Henry. Table Talk of Samuel Taylor Coleridge and The Rime of the Ancient Mariner, Christabel, &c. New York: Routledge (1884) pp.i-iv", "In 1796 he also privately printed Sonnets from Various Authors, including sonnets by Lamb, Lloyd, Southey and himself as well as older poets such as William Lisle Bowles."]}, {"page": "1850", "response": ["* April 7 – William Lisle Bowles, English poet, critic (b. 1762)"]}, {"page": "Lacock Abbey", "response": ["Lacock Abbey, dedicated to St Mary and St Bernard, was founded in 1229 by Ela, Countess of Salisbury, widow of William Longespee, an illegitimate son of King Henry II.The Book of Lacock mentioned by heralds, passed into the Cottonian Library, where it was apparently lost in the fire of 1731 (William Lisle Bowles and John Gough Nichols, Annals and Antiquities of Lacock Abbey: in the county of Wilts... London, 1835:v). Ela laid the abbey's first stone in Snail's Meadow, near the village of Lacock on 16 April 1232.Bowles and Nichols 1835:171; on the same day she founded the Carthusian priory of Henton, in Somerset, fifteen miles distant. The first of the Augustinian nuns were veiled in 1232,Date given by Bowles and Nichols 1835:81, correcting as miscopied a date MCCXXII in the lost Book of Lacock. and Ela joined the community in 1228."]}, {"page": "Battle of Thermopylae", "response": ["|William Lisle Bowles"]}, {"page": "William Stukeley", "response": ["Haycock observed that Stukeley's \"influence upon antiquarian studies for the century or so after his death\" was \"profound\". For instance, in his 1796 book Indian Antiquities, Thomas Maurice drew upon Stukeley's publications as part of his argument that the druids were a group of Indian brahmins who had travelled west. According to Haycock, he \"most famous propagator of Stukelian ideas in the early nineteenth century\" was the artist and poet William Blake, who had read both Abury and Stonehenge and been influenced by them. In the nineteenth century, many of Stukeley's interpretations were being adopted and expanded by several antiquarian clergymen, including William Lisle Bowles, D. James and John Bathurst Deane. The Wiltshire archaeologist Richard Colt Hoare gave Stukeley's work some additional respectability when praising his use of fieldwork; Hoare concurred with Stukeley that sites like Stonehenge and Avebury were likely \"Celtic\" but did not endorse the idea that they were built by druids, believing that such information was unknowable."]}, {"page": "1850 in literature", "response": ["*April 7 – William Lisle Bowles, English poet and critic (born 1762)"]}, {"page": "Bryan Procter", "response": ["His principal poetical works were: Dramatic Scenes and other Poems (1819), A Sicilian Story (1820), Marcian Colonna (1820), Mirandola, a tragedy performed at Covent Garden with Macready, Charles Kemble and Miss Foote in the leading parts (1821), The Flood of Thessaly (1823) and English Songs (1832). He was also the author of Effigies poetica (1824), Life of Edmund Kean (1835), Essays and Tales in Prose (1851), Charles Lamb; a Memoir (1866), and of memoirs of Ben Jonson and William Shakespeare for editions of their works. A posthumous autobiographical fragment with notes of his literary friends, of whom he had a wide range from William Lisle Bowles to Robert Browning, was published in 1877, with some additions by Coventry Patmore."]}, {"page": "1804 in literature", "response": ["*William Lisle Bowles – The Spirit of Discovery"]}, {"page": "1789 in literature", "response": ["*William Lisle Bowles – Sonnets"]}, {"page": "1762 in literature", "response": ["*September 24 – William Lisle Bowles, English poet and critic (died 1850)"]}, {"page": "George Crabbe", "response": ["His two sons followed him, as soon as their existing engagements allowed them to leave Leicestershire. The younger, John, who married in 1816, became his father's curate, and the elder, who married a year later, became curate at Pucklechurch, also nearby. Crabbe's reputation as a poet continued to grow in these years. His growing reputation soon made him a welcome guest in many houses to which his position as vicar of Trowbridge might not have admitted him. Nearby was the poet William Lisle Bowles, who introduced Crabbe to the noble family at Bowood House, home of the Marquess of Lansdowne, who was always ready to welcome those distinguished in literature and the arts. It was at Bowood House that Crabbe first met the poet Samuel Rogers, who became a close friend and had an influence on Crabbe's poetry. In 1817, on the recommendation of Rogers, Crabbe stayed in London from the middle of June to the end of July in order to enjoy the literary society of the capital. While there he met Thomas Campbell, and through him and Rogers was introduced to his future publisher John Murray."]}, {"page": "William Roscoe", "response": ["He wrote the Sonnet on Parting with his Books on the 1816 sale of his library. In 1822 he issued an appendix of illustrations to his Lorenzo and also a Memoir of Richard Robert Jones of Aberdaron, a remarkable self-taught linguist. The year 1824 was memorable for the death of his wife and the publication of his edition of the works of Alexander Pope, which involved him in a controversy with William Lisle Bowles. His versatility was shown by the appearance of a folio monograph on the Monandrian Plants, which was published in 1828. The last part came out after his recovery from a stroke."]}, {"page": "Harvard Classics", "response": ["*William Lisle Bowles"]}, {"page": "William Bowles", "response": ["*William Lisle Bowles (1762–1850), English poet and critic"]}, {"page": "Oxford poetry anthologies", "response": ["Thomas Wyatt - Henry Howard, Earl of Surrey - Giles Fletcher - Edmund Spenser - Walter Ralegh - Fulke Greville - Philip Sidney - Arthur Gorges - George Chapman - Henry Constable - Samuel Daniel - Michael Drayton - Joshua Sylvester - William Shakespeare - John Davies of Hereford - Thomas Campion - William Alabaster - Barnabe Barnes - John Davies - John Donne - Richard Barnfield - Lord Herbert of Cherbury - William Drummond - Mary Wroth - William Browne - George Herbert - Thomas Carew - William Habington - Edmund Waller - John Milton - Charles Cotton - Philip Ayres - Aphra Behn - Thomas Edwards - Thomas Gray - Thomas Warton - William Cowper - Anna Seward - Charlotte Turner Smith - John Bampfylde - Mary Robinson - William Lisle Bowles - Helen Maria Williams - Thomas Russell - William Wordsworth - Samuel Taylor Coleridge - Mary Tighe - Robert Southey - Charles Lamb - Walter Savage Landor - Ebenezer Elliott - James Henry Leigh Hunt - George Gordon, Lord Byron - John Keble - Percy Bysshe Shelley - John Clare - George Darley - John Keats - Hartley Coleridge - Thomas Hood - William Barnes - Thomas Lovell Beddoes - Elizabeth Barrett Browning - Henry Wadsworth Longfellow - John Greenleaf Whittier - Charles Tennyson Turner - Edgar Allan Poe - Alfred Tennyson, Lord Tennyson - William Bell Scott - Robert Browning - William Edmondstoune Aytoun - Arthur Hugh Clough - Frederick Goddard Tuckerman - Matthew Arnold - William Cory - William Allingham - Sydney Dobell - George Meredith - Dante Gabriel Rossetti - Christina Rossetti - Samuel Butler - John Leicester Warren - Algernon Charles Swinburne - Augusta Webster - Wilfrid Scawen Blunt - Thomas Hardy - Robert Buchanan - Edward Dowden - Robert Bridges - Ada Cambridge - Gerard Manley Hopkins - Louisa Sarah Bevington - Michael Field - Alice Meynell - Digby Mackworth Dolben - William Ernest Henley - Philip Bourke Marston - Robert Louis Stevenson - Oscar Wilde - Agnes Mary Frances Robinson - Francis Thompson - Mary Coleridge - Laurence Hope - Rudyard Kipling - Arthur Symons - William Butler Yeats - Edwin Arlington Robinson - Robert Frost - Edward Thomas - Siegfried Sassoon - Rupert Brooke - Elizabeth Daryush - Robinson Jeffers - Edwin Muir - John Crowe Ransom - Kenneth Leslie - Archibald MacLeish - Edna St. Vincent Millay - Wilfred Owen - Sylvia Townsend Warner - Aldous Huxley - Robert Graves - Charles Hamilton Sorley - Edgell Rickword - Roy Campbell - Kenneth Slessor - Merrill Moore - Patrick Kavanagh - Norman Cameron - William Empson - W. H. Auden - Alec Derwent Hope - Paul Engle - Malcolm Lowry - Roy Fuller - George Barker - Weldon Kees - Dylan Thomas - Gavin Ewart - Charles Causley - Robert Lowell - John Heath-Stubbs - William Meredith - Edwin Morgan - Richard Wilbur - Donald Davie - Philip Larkin - Louis Simpson - James Merrill - Richard Murphy - Peter Porter - Anthony Thwaite - Derek Walcott - Alan Brownjohn - Alistair Elliott - Geoffrey Hill - George MacBeth - Fleur Adcock - Seamus Heaney - Michael Longley - Derek Mahon - Douglas Dunn - Eavan Boland - Susan Wicks - Christopher Reid - Paul Muldoon - Jane Draycott - Carol Ann Duffy - Alan Jenkins - Jamie McKendrick - Simon Armitage - Alice Oswald", "Joseph Addison – Richard Aldington – Kenneth Allott – Aneirin – Guillaume Apollinaire – Louis Aragon – Matthew Arnold – Herbert Asquith – Margaret Atwood – W. H. Auden – William Edmonstoune Aytoun – Joel Barlow – O. Bernard – Sir John Betjeman – Laurence Binyon – John Peale Bishop – Edmund Blunden – William Lisle Bowles – Rupert Brooke – Robert Browning – George Gordon Noel, Lord Byron – Norman Cameron – Thomas Campbell – May Wedderburn Cannan – Charles Causley – Geoffrey Chaucer – G. K. Chesterton – Joseph P. Clancy – Samuel Taylor Coleridge – John Cornford – Stephen Crane – T. W. H. Crosland – Kevin Crossley-Holland – E. E. Cummings – R. N. Currey – Samuel Daniel – Elizabeth Daryush – Sir William Davenant – Donald Davie – C. Day-Lewis – Daniel Defoe – Paul Dehn – James Dickey – Emily Dickinson – John Donne – Hilda Doolittle – Keith Douglas – Michael Drayton – John Dryden – Douglas Dunn – Richard Eberhart – T. S. Eliot – Ralph Waldo Emerson – Gavin Ewart – James Fenton – Robert Fitzgerald – Ephim Fogel – Carolyn Forché – Robert Frost – Roy Fuller – George Gascoigne – David Gascoyne – Allen Ginsberg – Robert Graves – Julian Grenfell – Thom Gunn – Ivor Gurney – Thomas Hardy – Seamus Heaney – Anthony Hecht – Geoffrey Hill – Homer – Horace – A. E. Housman – Henry Howard, Earl of Surrey – Julia Ward Howe – Ted Hughes – Victor Hugo – Randall Jarrell – Samuel Johnson – David Jones – Sidney Keyes – Galway Kinnell – Rudyard Kipling – Lincoln Kirstein – Stanley Kunitz – Philip Larkin – Laurie Lee – J. B. Leishman – Denise Levertov – Alun Lewis – Sir Richard Lovelace – James Russell Lowell – Robert Lowell – Thomas Babington, Lord Macaulay – George MacBeth – John McCrae – Hugh MacDiarmid – Archibald MacLeish – Louis MacNeice – Allen Mandelbaum – Andrew Marvell – Herman Melville – Robert Mezey – James Michie – Adam Mickiewicz – John Milton – Adrian Mitchell – Marianne Moore – Howard Nemerov – Sir Henry Newbolt – George Orwell – Wilfred Owen – George Peele – Benjamin Perét – Peter Porter – Ezra Pound – F. T. Prince – John Pudney – Herbert Read – Henry Reed – Edgell Rickword – Rihaku – Rainer Maria Rilke – Arthur Rimbaud – T. W. Rolleston – Isaac Rosenberg – Alan Ross – Charles Sackville – Carl Sandburg – Siegfried Sassoon – Dorothy L. Sayers – Vernon Scannell – John Scott – Karl Shapiro – Percy Bysshe Shelley – Simonides – Louis Simpson – Edith Sitwell – W. D. Snodgrass – Charles Sorley – Robert Southey – Bernard Spencer – Stephen Spender – Edmund Spenser – William Stafford – Jon Stallworthy – Wallace Stevens – Allen Tate – James Tate – Alfred, Lord Tennyson – William Makepeace Thackeray – Dylan Thomas – Edward Thomas – James Thomson – Charles Tomlinson – William Tyndale – Fyodor Tyutchev – Virgil – Andrei Voznesensky – Arthur Waley – Edgar Wallace – Sylvia Townsend Warner – Walt Whitman – Richard Wilbur – Charles Wolfe – William Wordsworth – W. B. Yeats"]}, {"page": "Louisa Stuart Costello", "response": ["Among Costello's published works is her self-illustrated Memoirs of Eminent Englishwomen (1844), and several popular works of poetry and travel. Her collection Songs of a Stranger was dedicated to William Lisle Bowles. She returned to France only after her mother sent for her in 1815 or 1818, and then lived chiefly in Paris as a miniature-painter."]}, {"page": "Richard Grey (priest)", "response": ["He married Joyce, youngest daughter of John Thicknesse, rector of Farthingo, Northamptonshire, and brother of Philip Thicknesse. She died on 12 January 1794, aged 89. He left three daughters, of whom the eldest, Joyce, married at the age of forty-five Dr. Philip Lloyd, dean of Norwich, and was known for painted windows in Norwich Cathedral. The youngest, Bridget, married the Rev. William Thomas Bowles, and was mother of William Lisle Bowles."]}, {"page": "Oxford period poetry anthologies", "response": ["Jean Adams – Joseph Addison – John Aikin – Mark Akenside – Mary Alcock – Robert Andrews – Christopher Anstey – John Armstrong – Joanna Baillie – Henry Baker – John Codrington Bampfylde – John Bancks – Anna Laetitia Barbauld – Mary Barber – James Beattie – George Berkeley – Isaac Bickerstaffe – Samuel Bishop – James Bisset – Robert Blair – William Blake – Susanna Blamire – Samuel Bowden – William Lisle Bowles – James Bramston – Andrew Brice – Henry Brooke – John Brown – Isaac Hawkins Browne – Moses Browne – Michael Bruce – John Frederick Bryant – Sir Samuel Egerton Brydges – Robert Burns – John Byrom – George Canning – Henry Carey – John Carr – James Cawthorn – Thomas Chatterton – Edward Chicken – Lady Mary Chudleigh – Charles Churchill – Colley Cibber – Thomas Cole – John Collier – Mary Collier – Emanuel Collins – William Collins – George Colman the younger – William Congreve – Joseph Cottle – William Cowper – George Crabbe – William Crowe – Samuel Croxall – John Cunningham – Sir George Dallas – John Dalton – James Dance – Erasmus Darwin – Sneyd Davies – Daniel Defoe – William Diaper – Charles Dibdin – Sarah Dixon – John Dobson – Philip Doddridge – Robert Dodsley – E. Dower – Lord Dreghorn – Stephen Duck – William Dunkin – Thomas D'Urfey – John Dyer – Thomas Edwards – Sarah Fyge Egerton – John Ellis – George Farewell – Joseph Fawcett – Francis Fawkes – Robert Fergusson – Frederick Forrest – John Freeth – George Galloway – John Gambold – Edmund Gardner – David Garrick – John Gay – John Gerrard – Thomas Gilbert – Richard Glover – Oliver Goldsmith – James Graeme – James Grainger – Richard Graves – Thomas Gray – Matthew Green – Frances Greville – Laurence Hynes Halloran – William Harrison – Francis Hawling – John Hawthorn – Samuel Henley – Aaron Hill – Thomas Holcroft – Leonard Howard – Hildebrand Jacob – Richard Jago – Nicholas James – Catherine Jemmat – Charles Jenner – Soames Jenyns – Samuel Johnson – George Keate – James Kennedy – L. Ker – William King – John Langhorne – Mary Leapor – John Learmont – Lady Anne Lindsay – Edward Littleton – Evan Lloyd – Robert Lloyd – Andrew Macdonald – John Maclaurin, Lord Dreghorn – James Macpherson – David Mallet – Bernard Mandeville – William Mason – Joseph Mather – Thomas Mathison – Thomas Maurice – Robert Merry – William Julius Mickle – Mary Monck – Lady Mary Wortley Montagu – Charles Mordaunt, 3rd Earl of Peterborough – Hannah More – Charles Morris – Thomas Morris – Thomas Moss – Thomas Mozeen – Charles Newton – John Newton – Robert Nugent, Earl Nugent – John O'Keefe – Richardson Pack – Thomas Parnell – John Parrish – William Parsons – Alexander Pennecuik – Thomas Penrose – Thomas Percy – Ambrose Philips – John Philips – Christopher Pitt – Annabella Plumtre – John Plumtre – Richard Polwhele – John Pomfret – Alexander Pope – Kenrick Prescot – Matthew Prior – Henry James Pye – Richard Savage – John Scott of Amwell – Anna Seward – William Shenstone – William Shepherd – Richard Brinsley Sheridan – Christopher Smart – Charlotte Turner Smith – George Smith – John Smith – Tobias Smollett – William Somervile – William Sotheby – Robert Southey – Lawrence Spooner – Philip Dormer Stanhope, Earl of Chesterfield – George Alexander Stevens – Jonathan Swift – Robert Tatersal – Henry Taylor – John Taylor – William Taylor – John Thelwall – Edward Thompson – James Thomson – Thomas Tickell – Elizabeth Tolley – Augustus Montagu Toplady – Horace Walpole, Earl of Orford – Edward Ward – Joseph Warton – Thomas Warton – Isaac Watts – James Eyre Weeks – Leonard Welsted – Charles Wesley – John Wesley – Samuel Wesley – Phillis Wheatley – Gilbert White – Paul Whitehead – William Whitehead – J. Wilde – Sir Charles Hanbury Williams – John Williams – Anne Finch, Countess of Winchilsea – John Winstanley – John Wolcot – James Woodhouse – Charles Woodward – William Woty – Hetty Wright – John Wright – Ann Yearsley – Edward Young", "Miles Peter Andrews – Joanna Baillie – Samuel Bamford – Anna Laetitia Barbauld – Thomas Beck – William Blake – William Lisle Bowles – Robert Burns – George Gordon, Lord Byron – Thomas Campbell – George Canning – John Clare – Samuel Taylor Coleridge – Hannah Cowley – William Cowper – George Crabbe – George Croly – William Crowe – Charlotte Dacre – George Darley – Erasmus Darwin – Ebenezer Elliott – Catherine Maria Fanshawe – John Hookham Frere – William Gifford – Felicia Dorothea Hemans – James Hogg – William Hone – Thomas Hood – Leigh Hunt – Sir William Jones – John Keats – Charles Lamb – Mary Lamb – Laetitia Elizabeth Landon – Walter Savage Landor – Joseph Lees – Matthew Gregory Lewis – Charles Lloyd (poet) – Henry Luttrell – John Herman Merivale – Robert Merry – Mary Russell Mitford – James Montgomery – Thomas Moore – John Moultrie – Caroline Oliphant – Amelia Opie – Sydney Owenson – William Parsons – Thomas Love Peacock – Richard Polwhele – Winthrop Mackworth Praed – William Probert – Bryan Waller Procter – Edward Quillinan – Ann Radcliffe – Mary Robinson – Samuel Rogers – William Roscoe – Thomas Russell – Walter Scott – Anna Seward – Percy Bysshe Shelley – Charlotte Turner Smith – Horace Smith – James Smith – Robert Southey – Thomas Tod Stoddart – Ann Taylor – Jane Taylor – William Taylor – William Tennant – Alfred Tennyson – John Thelwall – Mary Tighe – Helen Maria Williams – John Wolcot – Charles Wolfe – William Wordsworth – Ann Yearsley"]}, {"page": "Childe Harold's Pilgrimage", "response": ["Byron's death in the Greek War of Independence initiated a new round of imitations. William Lisle Bowles responded to his interment with a generous elegy in the six stanzas of \"Childe Harold's Last Pilgrimage\" (1826). These were written in the same form as Byron's poem and, forgiving the bitter insults that had passed between them in the course of a public controversy, now paid a magnanimous tribute to the manner of his dying.Spenserians"]}, {"page": "William Erle", "response": ["Born at Fifehead Magdalen, Dorset, William was the son of the Rev. Christopher Erle of Gillingham, Dorset and  Margaret née Bowles, a relative of the poet William Lisle Bowles. His younger brother Peter Erle went on to be a Charity Commissioner. Erle was educated at Winchester College and at New College, Oxford where he graduated BCL in 1818 and held a fellowship until 1834. Having been called to the Bar at the Middle Temple on 26 November 1819 he went on the western circuit. Here he slowly acquired a reputation for thoroughness, rather than brilliance, and a fair share of remunerative practice. He was admitted ad eundem a member of the Inner Temple on 11 June 1822, and became a bencher of that society on 18 November 1834, and in 1844, Treasurer. He also purchased a warrant as counsel at the Palace Court which had jurisdiction in all private law actions within 12 miles (19 km) of Whitehall."]}, {"page": "Bremhill", "response": ["*William Lisle Bowles (1762–1850), was Vicar of Bremhill from 1804 to 1845"]}, {"page": "Maud Heath's Causeway", "response": ["A roadside marker stone near the eastern terminus at Wick Hill near Bremhill, at  about  southeast of the Avon crossing, carries an iron plate inscribed \"From this Wick-Hill/begins the praise/Of Maud Heath's gift/To these highways\". Further up the hill stands Maud Heath's Monument, a statue of the eponymous lady, erected on a high column in 1838 and looking out over the river and its floodplain. The statue, in a bonnet and authentic plebeian clothes from the reign of Edward IV, was erected by Lord Lansdowne, and features a poem by the critic William Lisle Bowles, who was vicar of Bremhill at the time, which reads: "]}, {"page": "1832 in poetry", "response": ["* William Lisle Bowles, St. John in Patmos"]}, {"page": "Thomas Bowles (priest)", "response": ["Thomas Bowles (died 1773) was a Church of England priest. He is notable for a controversy in which he was appointed to two parishes in Wales where hardly any parishioners spoke English, despite the fact that Bowles spoke no Welsh. Bowles was a grandfather of the priest and poet William Lisle Bowles (1762–1850).", "William Thomas Bowles went on to be Vicar of King's Sutton, Northamptonshire 1760–73 and also Rector of Uphill and Brean in Somerset. A daughter of Bowles became married to another Church of England clergyman, Arthur Lewis, who was Rector of Thenford, Northamptonshire 1774–87. William Thomas Bowles' children included William Lisle Bowles, who was ordained priest in 1792 and was also a poet and critic."]}, {"page": "1850 in poetry", "response": ["* April 7 – William Lisle Bowles (born 1762), English"]}, {"page": "1813 in poetry", "response": ["* William Lisle Bowles, The Missionary, published anonymouslyCox, Michael, editor, The Concise Oxford Chronology of English Literature, Oxford University Press, 2004, "]}, {"page": "Literary Taste: How to Form It", "response": ["* William Lisle Bowles*"]}, {"page": "Donhead St Andrew", "response": ["The poet William Lisle Bowles was a curate at the church until 1792. A wall tablet is a memorial to Captain John Cooke, a naval officer killed at the Battle of Trafalgar in 1805. Notable rectors include Charles Clarke in the 20th century."]}, {"page": "1823 in poetry", "response": ["* William Lisle Bowles, Ellen Gray; or, The Dead Maiden's Curse"]}, {"page": "1828 in poetry", "response": ["* William Lisle Bowles, Days Departed; or, Banwell Hill, a lay of the Severn Sea"]}, {"page": "1804 in poetry", "response": ["* William Lisle Bowles, The Spirit of Discovery; or, The Conquest of the Ocean"]}, {"page": "1803 in poetry", "response": ["* William Lisle Bowles, The Picture"]}, {"page": "1801 in poetry", "response": ["* William Lisle Bowles, The Sorrows of Switzerland"]}, {"page": "1798 in poetry", "response": ["* William Lisle Bowles, St. Michael's Mount"]}, {"page": "1762 in Great Britain", "response": ["* 24 September – William Lisle Bowles, poet and critic (died 1850)"]}, {"page": "1799 in poetry", "response": ["* August 1 – British Rear-Admiral Horatio Nelson's defeat of the French fleet in the Battle of the Nile is the subject of separate poems this year by English poets William Lisle Bowles and William Sotheby.", "* William Lisle Bowles, Song of the Battle of the Nile, about Nelson's defeat of the French fleet in the Battle of the Nile on August 1, 1798"]}, {"page": "1796 in poetry", "response": ["* William Lisle Bowles, Hope"]}, {"page": "1794 in poetry", "response": ["*** To Bowles (William Lisle Bowles); December 26"]}]}}