{"wiki_id": "http://www.wikidata.org/entity/Q558434", "itemLabel": "Charles Quatermaine", "itemDescription": "British actor (1877-1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Quatermaine", "wikipedia_page": {"main": "Charles Quatermaine (30 December 1877 in Richmond, Surrey – August 1958 in Sussex) was a British stage and film actor. He also appeared on Broadway. He was the second husband of actress Mary Forbes, and brother of Leon Quartermaine.\n\n", "link_mentions": [{"page": "If I Were You (Wodehouse novel)", "response": ["The play that the novel was adapted from was published in book form but not produced. Wodehouse and Bolton later adapted a new play from the novel under the title Who's Who?, which premiered at the Duke of York's Theatre, London, on 20 September 1934. The play was produced by Lawrence Grossmith,  who portrayed Freddie Chalk-Marshall in the play. The cast also included Peter Haddon as Tony, Lilian Bond as Polly Brown, Ivor Barnard as Syd Price, Laura Wright as Mrs Price, Violet Vanbrugh as Lady Lydia Bassinger, Morton Selten as Sir Herbert Bassinger, Sebastian Smith as Slingsby, Enid Stamp Taylor as Violet Might, and Charles Quatermaine as J. B. Might. Who's Who? ran for 19 performances.McIlvaine (1990), p. 305, J42."]}, {"page": "List of British films before 1920", "response": ["| Westward Ho! || Percy Nash || Renee Kelly, Charles Quatermaine || Historical ||"]}, {"page": "The Thirteenth Chair (1929 film)", "response": ["* Charles Quatermaine as Dr. Philip Mason (credited as Charles Quartermaine)"]}, {"page": "A Man of Mayfair", "response": ["*Charles Quatermaine as Dalton"]}, {"page": "The Eleventh Commandment (1924 film)", "response": ["* Charles Quatermaine as James Mountford "]}, {"page": "The Lady Clare", "response": ["The Lady Clare is a 1919 British silent drama film directed by Wilfred Noy and starring Mary Odette, Jack Hobbs and Charles Quatermaine. It is based on a narrative poem by Lord Tennyson.", "* Charles Quatermaine - Marquis of Hartlepool"]}, {"page": "Charles Quatermain", "response": ["#REDIRECT Charles Quatermaine"]}, {"page": "The Face at the Window (1920 film)", "response": ["* Charles Quatermaine - Lucien deGradoff "]}, {"page": "The Bishop Murder Case (film)", "response": ["* Charles Quatermaine as John Pardee"]}, {"page": "List of British films of 1920", "response": ["| The Auction Mart || Duncan McRae || Gertrude McCoy, Charles Quatermaine  || Drama ||"]}, {"page": "The Auction Mart", "response": ["The Auction Mart is a 1920 British silent drama film directed by Duncan McRae and starring Gertrude McCoy, Charles Quatermaine and Gerald Moore.Low p.332", "* Charles Quatermaine as Jacqueline's Father "]}, {"page": "Charles Quartermaine", "response": ["#REDIRECTCharles Quatermaine"]}, {"page": "Quatermaine, Charles", "response": ["#redirectCharles Quatermaine"]}, {"page": "Westward Ho! (1919 film)", "response": ["Westward Ho! is a 1919 British silent historical adventure film directed by Percy Nash and starring Renee Kelly, Charles Quatermaine and Irene Rooke.Goble p.260 It is an adaptation of the 1855 novel Westward Ho! by Charles Kingsley, set during the Spanish Armada (1588).", "* Charles Quatermaine as Don Guzman "]}, {"page": "Take a Chance (play)", "response": ["It was performed at the Whitehall Theatre, running for 93 performances between 28 July and 17 October 1931. It followed closely on the heels of another of Hackett's plays at the theatre Good Losers. The original cast of Take a Chance included Ian Hunter, Ronald Shiner, Charles Quatermaine, Anthony Holles, Francis Lister, Hugh Wakefield, Barbara Hoffe and Marion Lorne.Wearing p.135"]}, {"page": "The Gay Adventure (play)", "response": ["It ran for 291 performances at the Whitehall Theatre in the West End between 23 December 1931 and 3 September 1932. The original cast included Seymour Hicks, Charles Quatermaine, Eric Maturin, Nora Swinburne and Marion Lorne.Wearing p.172"]}, {"page": "The Assassin (play)", "response": ["The play premiered at the Pavilion Theatre, Bournemouth before transferring to the Savoy Theatre in London's West End, running for 74 performances between March 22 and June 2, 1945. The original London cast included Henry Oscar, Barry Morse, Leslie Perrins, Charles Quatermaine and Rosalyn Boulter. It was first performed on Broadway at the National Theatre in October of the same year, but lasted for only 13 performances.Wearing p.189-190"]}]}}