{"wiki_id": "http://www.wikidata.org/entity/Q5585655", "itemLabel": "Gordon Parsons", "itemDescription": "English cricketer (born 1959)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gordon_Parsons_(cricketer)", "wikipedia_page": {"main": "Gordon James Parsons (born 17 October 1959 in Slough, Buckinghamshire) is an English-born first-class cricketer who played in England and South Africa.\nHe was burly medium fast bowler and was a handy batsman who played most of his cricket for Leicestershire County Cricket Club, although he also appeared for Boland cricket team, Buckinghamshire, Griqualand West cricket team, Orange Free State cricket team, Orange Free State Country Districts and Warwickshire County Cricket Club during his first-class career which spanned from 1978 to 1997.\nHe was nicknamed Bullhead on the county circuit, he made up with aggression what he lacked in natural pace and took 809 first-class wickets with his right arm seamers, picking up another 356 in one day games.  He took five wickets in an innings 19 times, with a best of 9 for 72.  He was also a useful lower order batsman, scoring 6763 first-class runs with 29 fifties and a top score of 76.The brother-in-law of Hansie Cronje, he went on to coach the Highveld Lions in South Africa.", "link_mentions": [{"page": "John Barrett (cricketer)", "response": ["Barrett made his debut for Norfolk in the 1970 Minor Counties Championship against Lincolnshire.  Barrett played Minor counties cricket for Norfolk from 1970 to 1982, which included 40 Minor Counties Championship matches.  He made his only List A appearance in 1985 against Leicestershire in the NatWest Trophy.  In this match, he was dismissed for a single run by Gordon Parsons."]}, {"page": "List of Warwickshire County Cricket Club players", "response": ["* Gordon Parsons (1986–1988) : G. J. Parsons (47)"]}, {"page": "Gordon Parsons", "response": ["Gordon Parsons may refer to:", "* Gordon Parsons (cricketer) (born 1959), English cricketer", "* Gordon Parsons (singer-songwriter) (1926–1990), Australian country music singer-songwriter"]}, {"page": "2017 Shpageeza Cricket League", "response": ["| Gordon Parsons"]}, {"page": "List of Boland representative cricketers", "response": ["* Gordon Parsons, 1983/84–1984/85"]}]}}