{"wiki_id": "http://www.wikidata.org/entity/Q5585489", "itemLabel": "Gordon MacDonald", "itemDescription": "British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Gordon_MacDonald_(editor)", "wikipedia_page": {"main": "Gordon MacDonald (born 1967) works with photography as an artist, writer, curator, press photographer and educator.\nHe is the founding editor of Photoworks magazine and was head of publishing at Photoworks in Brighton. He co-founded Brighton Photo Fringe in 2003; and was for a time its chair of the board of trustees. He was co-founder and co-director, alongside Stuart Smith, of the visual arts publisher GOST. MacDonald is also half of the collective MacDonaldStrand, with his wife Clare Strand.\n\n", "link_mentions": [{"page": "Gordon MacDonald", "response": ["Gordon MacDonald may refer to:", "*Gordon MacDonald (Alberta politician) (1866–1941), member of the Legislative Assembly of Alberta", "*Gordon MacDonald (American politician) (born 1961), Chief Justice of the New Hampshire Supreme Court", "*Gordon MacDonald (Scottish politician) (born 1960), Member of the Scottish Parliament", "*Gordon MacDonald (American football) (1902–1950), American football and basketball player and coach", "*Gordon MacDonald (editor) (born 1967), British educator and magazine editor", "*Gordon MacDonald, actor and partner of Holly Hunter"]}, {"page": "Ewen Spencer", "response": ["* We Also Dance, Museum of Contemporary Art in Kraków, Krakow Photmonth, Krakow, Poland, June 2017, with Phil Collins, Elaine Constantine, Denis Darzacq, Stéphane Degoutin & Gwenola Wagon, Sirkka-Liisa Konttinen, Zarina Muhammad, Morten Nilsson, Spencer, Vojtěch Veškrna, and Gillian Wearing. Curated by Gordon MacDonald."]}, {"page": "Joachim Schmid", "response": ["*Joachim Schmid. Photoworks 1982–2007. Brighton, UK: Photoworks, and Göttingen, Germany: Steidl, 2007. . Edited by Gordon MacDonald and John S. Weber."]}, {"page": "Gordon MacDonald (Editor, Publisher,Curator and Writer)", "response": ["#REDIRECT Gordon MacDonald (editor)"]}, {"page": "Anastasia Taylor-Lind", "response": ["*Maidan: Portraits from the Black Square. London: GOST, 2014. . 160 pages. Edition of 750 copies. With an interview with Taylor-Lind by Gordon MacDonald."]}, {"page": "Photoworks Annual", "response": ["The magazine was established in 2003 as Photoworks and was published biannually until 2013 when it became an annual publication and obtained its current name. The magazine is published by Photoworks, a Brighton based organization for contemporary photography. The magazine was edited by Gordon MacDonald until he stood down in 2011."]}, {"page": "Photoworks", "response": ["*The House in the Middle. Edited by Gordon MacDonald. Brighton: Photoworks, 2004. . Photographs by Danny Treacy, Paul Reas, John Kippin, Richard Billingham, Jo Broughton, Dirk Wackerfuss, Anne Hardy, John Paul Bichard, The Design Council Archive, the BBC Picture Library, the Collection of Chris Mullen, Protect and Survive and the Los Alamos National Library. Text by Althea Greenan. \"Published to coincide with a Photoworks exhibition at the Towner Art Gallery, Eastbourne, in 2004.\" Edition of 1000 copies.", "*The Myth of the Airborne Warrior. By Stuart Griffiths. Brighton: Photoworks, 2011. . Edited by Gordon MacDonald. Edition of 500 copies."]}, {"page": "Lisa Barnard", "response": ["Barnard's \"complicated and intriguing multimedia project\" Virtual Iraq \"examines the use of interactive media by the US army to recruit, train and treat military personnel before and after they embark on a tour of duty to the Middle East. It [...] explores the relationship between the US army, virtual reality and the gaming industry\" in their Flatworld project. Barnard filmed it at the Institute for Creative Technologies, \"a research centre also funded by the military to create training applications using virtual reality in advanced technologies.\" Gordon MacDonald, reviewing Virtual Iraq in Photoworks Biannual,Gordon MacDonald's text, Bang bang You're Dead, for Photoworks Biannual 11, is reproduced within Barnard's web site here said \"Barnard’s project does not aim to direct you towards the ridiculous aspects of Flatworld or to point out the serious moral questions its existence raises. It achieves more than this by simply removing Flatworld from its context and holding all of its contradictions still to be viewed.\""]}, {"page": "Clare Strand", "response": ["She is one half of creative partnership MacDonaldStrand with her husband Gordon MacDonald.", "She is one half of creative partnership MacDonaldStrand with her husband Gordon MacDonald. Around 2000–2002, they made commercial work for Sleazenation, contributing photographs for stories. In 2012 they self-published Bad Things Happen To Good People and Most Popular Of All Time.", "===Publications with Gordon MacDonald==="]}, {"page": "Tish Murtha", "response": ["* Tish Murtha: Works 1976 – 1991, The Photographers' Gallery, London, 2018. Co-curated by Gordon MacDonald and Val Williams."]}, {"page": "Monica Haller", "response": ["*The War From Here, group show with Lisa Barnard, Nina Berman, Haller, Sophie Ristelhueber, and Martha Rosler at Krakow Photmonth, Krakow, Poland, 2017. Curated by Gordon MacDonald."]}, {"page": "Stuart Griffiths (photographer)", "response": ["*The Myth of the Airborne Warrior. Brighton and Hove: Photoworks, 2011. Photographs and text by Griffiths, and ephemera. Edited and with a short essay by Gordon MacDonald. . Edition of 500 copies."]}]}}