{"wiki_id": "http://www.wikidata.org/entity/Q5585510", "itemLabel": "Gordon Marshall", "itemDescription": "Anglo-Scottish footballer (born 1939)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gordon_Marshall_(footballer,_born_1939)", "wikipedia_page": {"main": "Gordon Marshall (born 2 July 1939 in Farnham, Surrey) is a former Anglo-Scottish professional football goalkeeper who played in the top flights of both Scotland and England in a 22-year senior career.", "link_mentions": [{"page": "Heart of Midlothian F.C.", "response": ["17 year old Gordon Marshall debuted in 1956 as did George Thomson in February 1957. Marshall, a future England under 23 internationalist, became a Hearts goalkeeping regular until 1963. Hearts led the Scottish League for most of the 1956–57 season. The title hinged on Rangers visit to Tynecastle on 13 April. A capacity crowd watched a tense game in which Rangers keeper, George Niven, was man of the match. Hearts could not beat him and the only goal came from Billy Simpson of Rangers who scored on the break in 35 minutes. Rangers had games in hand which they won to overtake Hearts and lift the trophy."]}, {"page": "Dave Mackay", "response": ["Mackay died on 2 March 2015 at the age of 80. Heart of Midlothian stated \"It is with deep regret that we have to advise of the death of Dave Mackay who was possibly the most complete midfield player that Scotland has ever produced\". Tottenham wrote in an obituary \"Dave Mackay will certainly always be remembered here as one of our greatest ever players and a man who never failed to inspire those around him. In short, a Spurs legend\". His coffin was brought into his funeral by John Robertson and Gordon Marshall (ex-Hearts), Pat Jennings and Cliff Jones (ex-Tottenham) and Roy McFarland and John McGovern (ex-Derby). A eulogy was given by Alex Ferguson.\"FOOTBALL REMEMBERS DAVE MACKAY\" 24 March 2015"]}, {"page": "List of Newcastle United F.C. players", "response": ["|align=\"left\"|Gordon Marshall||||GK||1963–1968||187||0||"]}, {"page": "Jimmy Wardhaugh", "response": ["His selection could be viewed as controversial as, despite his Scottish parentage and sense of identity, he was born in England, at a time when the home football associations had strict eligibility restrictions for their national sides. Other \"Scots\" such as Joe Baker and Gordon Marshall were obliged to seek selection for the English national team due to their place of birth. However, for footballing purposes the Scottish Football Association and the Football Association considered their shared boundary to be the River Tweed, allowing Wardhaugh to represent Scotland. His case was helped by the fact that Berwick Rangers, based to the south of his Marshall Meadows birthplace, had competed in Scottish football since 1905."]}, {"page": "Gordon Marshall (footballer, born 1964)", "response": ["Gordon Marshall (born 19 April 1964) is a Scottish former professional footballer, who played as a goalkeeper for several clubs, most notably Falkirk, Celtic, Kilmarnock and Motherwell. Marshall played in one international match for Scotland in 1992. Marshall is the current goalkeeping coach at Aberdeen, having replaced Jim Leighton.", "Marshall began his career as a youth player with Tynecastle Boys Club before signing for Rangers in January 1980.Interview: Gordon Marshall on signing for Rangers and Celtic and his early years at East Fife, The Scotsman, 17 August 2019 He then suffered a broken leg playing for the Ibrox club's reserve side aged 15  and after failing to play for the first-team was sent out on loan to East Stirlingshire. Marshall then signed for Scottish Junior club Broxburn Athletic before returning to the senior ranks in December 1982 with East Fife, before signing for Falkirk and then Celtic in 1991 for £270,000, having turned down a chance to rejoin Rangers when it was made clear he would remain behind Andy Goram in the selection order.", "Marshall left Motherwell in November 2005 to become Hibernian's goalkeeping coach, a position he held until July 2009.Gordon Marshall , Hibernian F.C. official website. He then worked for Alloa Athletic and St Johnstone as a goalkeeping coach before returning to Motherwell in August 2011 as their full-time goalkeeping coach. Marshall then left Fir Park in the close season of 2015 to take up the position of goalkeeping coach at Aberdeen, replacing Jim Leighton."]}, {"page": "Gordon Marshall", "response": ["Gordon Marshall may refer to:", "* Gordon Marshall (sociologist) (born 1952), sociologist and former Vice-Chancellor of the University of Reading", "* Gordon Marshall (cricketer) (born 1935), English cricketer", "* Gordon Marshall (footballer, born 1939), English goalkeeper who played for Hearts, Newcastle United and Hibs", "* Gordon Marshall (footballer, born 1964), Scottish goalkeeper who played for Falkirk, Celtic and Kilmarnock (son of above)", "* Gordon Marshall (a.k.a. Gordy Marshall), a drummer that tours with the rock band the Moody Blues"]}, {"page": "1958 Scottish League Cup Final", "response": ["|GK ||||Gordon Marshall"]}, {"page": "Bobby Kirk (footballer)", "response": ["Seventeen-year-old Gordon Marshall debuted in 1956 as did George Thomson in February 1957. Marshall, a future England under 23 internationalist, became a Hearts goalkeeping regular until 1963. Hearts led the Scottish League for most of the 1956–57 season. The title hinged on Rangers visit to Tynecastle on 13 April. A capacity crowd watched a tense game in which Rangers keeper, George Niven, was man of the match. Hearts could not beat him and the only goal came from Billy Simpson of Rangers who scored on the break in 35 minutes. Rangers had games in hand which they won to overtake Hearts and lift the trophy.1954 – 1964 Hearts History www.hearts.co.uk"]}, {"page": "Gordon Marshall (footballer born 1939)", "response": ["#REDIRECT Gordon Marshall (footballer, born 1939)"]}, {"page": "List of English association football families", "response": ["* Gordon Marshall Sr.,   Gordon Marshall Jr. (son),  Scott Marshall (son)"]}, {"page": "List of Scottish football families", "response": ["*  Gordon Marshall Sr., Gordon Marshall Jr. (son), Scott Marshall (son)"]}, {"page": "List of outfield association footballers who played in goal", "response": ["|With 12 minutes gone and no score, Hearts goalkeeper Gordon Marshall was seriously injured and carried off; forward Wallace took over. Playing against 10 men and a stand-in keeper, St Mirren won 7–3 with Don Kerrigan's four goals and Bobby Carroll's hat trick.Tue 02 Apr 1963, St Mirren 7 Hearts 3, London Hearts Supporters Club"]}]}}