{"wiki_id": "http://www.wikidata.org/entity/Q5593363", "itemLabel": "Graham Williamson", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Graham_Williamson", "wikipedia_page": {"main": "Graham Keith Williamson is a long-time political activist in the United Kingdom, having been active at the top levels of various far right groups including the National Front, the Third Way and Solidarity.\nWilliamson is an elected councillor representing the Independent Residents' Group in South Hornchurch Ward of the London Borough of Havering, although he continues to be a member of the National Council of the National Liberal Party (see below). He is a member of the National Executive of the trade union Solidarity.He is a leading member of the National Liberal Party which contested the 2014 European Parliament election with eight candidates in the London constituency election being held in May 2014.", "link_mentions": [{"page": "National Front (UK)", "response": ["Reflecting the Nouvelle Droite's influence, the Strasserite Official NF promoted support for \"a broad front of racialists of all colours\" who were seeking an end to multi-racial society and capitalism, praising black nationalists like Louis Farrakhan and Marcus Garvey. Their publication, Nationalism Today, featured positive articles on the Libyan and Iranian governments, presenting them as part of a global anti-capitalist and anti-Marxist third force. This may have had tactical as well as ideological motivations, with Libya and Iran viewed as potential sources of funding. This new ideology alienated many NF members. The Official NF experienced internal problems and in 1989 Griffin, Derek Holland and Colin Todd split from it to establish the International Third Position. In March 1990 the Official NF was disbanded by its leaders, Patrick Harrington, Graham Williamson and David Kerr, who replaced it with a new organisation, the Third Way. This left the Flag Group as the only party using the National Front banner."]}, {"page": "Third Way (UK organisation)", "response": ["In 1999, new electoral organisation the National Liberal Party was formed by Patrick Harrington and Graham Williamson and registered as National Liberal Party – The Third Way with the Electoral Commission. It fought parliamentary elections in Hornchurch (in 2001 and 2005), Belfast West (2001, as Ulster Third Way), Upminster (2005) and Eastleigh (2010) but obtained below 1% of the vote in each case."]}, {"page": "Patrick Harrington (activist)", "response": ["The Union Executive elected in 2012 consists of Harrington (General Secretary), Michelle Harrington, Glen Nicklasson, Graham Williamson, Clive Jefferson and David Kerr (President).Solidarity, gov.uk; accessed 23 January 2016.- See article on Solidarity for more details.", "There was another schism in 1989 when Harrington and Graham Williamson parted company with Griffin and Holland. The ONF had opened dialogue with groups like the Nation of Islam and the Pan-Afrikan International Movement. According to Harrington's account of the split, when he opened discussion with Jewish nationalist and anti-Zionist rabbi Mayer Schiller (see section on Harrington's ideological development below) and advocated a two-state solution to the Israeli–Palestinian conflict, he was attacked as a \"Zionist\". Harrington and Williamson attended pro-Palestinian demonstrations such as the 1988 Quds Day march in London, as part of an ONF strategy to show support for Muslim anti-Zionists.Cheles, Ferguson & Vaughan, Neo-Fascism in Europe p.260", "*Taking Liberties – A Third Way Special on Attacks on Civil Liberties in the UK (with Nick Griffin, Graham Williamson, Tim Bragg and David Kerr) ()"]}]}}