{"wiki_id": "http://www.wikidata.org/entity/Q5593281", "itemLabel": "Graham Stevenson", "itemDescription": "English Test and County cricketer (1955-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Graham_Stevenson", "wikipedia_page": {"main": "Graham Barry Stevenson (16 December 1955 – 21 January 2014) was an English cricketer, who played in two Tests and four One Day Internationals from 1980 to 1981.His county cricket career was spent mainly with Yorkshire and, latterly, Northamptonshire.", "link_mentions": [{"page": "Ian Botham", "response": ["In the winter of 1976–77, after he had made his first two international appearances, Botham played District Cricket in Melbourne, Australia for the University of Melbourne Cricket Club. He was joined by Yorkshire's Graham Stevenson. They were signed for the second half of the season on a sponsorship arranged through the Test and County Cricket Board (TCCB) by Whitbread's Brewery. Five of the competition's 15 rounds were abandoned because of adverse weather.Doust (1981), p. 50. It was apparently on this trip that Botham originally fell out with the former Australian captain Ian Chappell. The cause seems to have been a cricket-related argument in a bar, which may have resulted in Chappell being pushed off his stool (the story is widely sourced but accounts differ). This became a long-running feud and, as late as the 2010–11 Ashes series, there was an altercation between Botham and Chappell in a car park at the Adelaide Oval."]}, {"page": "Geoffrey Boycott", "response": ["Boycott, after much thought, continued as a player at Yorkshire, scoring 1,941 runs at 61.70 in 1979, hitting six hundreds to pass Len Hutton's record of 129 first-class centuries.McKinstry, p. 236. In 1980 he scored his ninth Roses century, equalling Herbert Sutcliffe's record.Boycott, p. 349. He also finished the season with an average of over 50.00 for a record eleventh consecutive year, surpassing the achievement of Jack Hobbs.Boycott, p. 331. He would experience growing friction with Hutton's son, Yorkshire's Richard, as well as with later Yorkshire captain John Hampshire. In the early 1980s Boycott continued his run of form, although a slow 347-ball knock of 140* incensed captain, Ray Illingworth, and created friction between Boycott and the rest of the Yorkshire Committee. In 1982 Boycott and Graham Stevenson added a record 149 runs for Yorkshire's tenth wicket against Warwickshire, Stevenson scoring 115 of these runs."]}, {"page": "Yorkshire County Cricket Club", "response": ["* Graham Stevenson"]}, {"page": "Ackworth, West Yorkshire", "response": ["The Yorkshire and England fast bowler, Graham Stevenson, was born in Ackworth. John Gully, the pugilist, horseracer and Member of Parliament, is buried at High Ackworth in his private burial ground."]}, {"page": "Annie Powell", "response": ["*Graham Stevenson, Compendium of Communist Biography"]}, {"page": "Alan Ramage", "response": ["Ramage first played for Yorkshire, in the John Player League in 1975. He played seven one day games before making his first-class debut for his native county against Cambridge University in June 1979. He made sporadic appearances until his twenty third and final first-class match, against Nottinghamshire in July 1983.  He bowled hostile spells, but never cemented a permanent place in a strong Yorkshire seam bowling attack, which also included Chris Old, Graham Stevenson and Arnie Sidebottom."]}, {"page": "Barnsley Cricket Club", "response": ["Many famous cricketers began their careers at Barnsley, notably Geoffrey Boycott and Harold Dennis Dickie Bird while chat show host Michael Parkinson also batted for the team.  They are now all vice presidents of the club while other players to have played for Barnsley in recent years include Arnie Sidebottom, Steve Oldham, Graham Stevenson, Martyn Moxon, Darren Gough, Mark Beardshall, Peter Heseltine, Alex Morris, Azeem Rafiq,  Gary Ballance, and Oliver Hannon-Dalby."]}, {"page": "Cricket in Colombia", "response": ["The B.S.C. (with Tony White) was the only side to bowl them out (for 184) during their South American tour. Norman Bracht took 5–74 in 20 overs and White 3–70 in 22. Krish Vaidya, was the only player to remain not out with a century. Their side was managed by Peter Parfitt (with Henry Blofeld), captained by Chris Cowdrey and included Bill Athey, Graham Stevenson, Tim Lloyd, Spandan Pandya and other good young county cricketers. "]}, {"page": "Church Road Cricket Ground", "response": ["* Best bowling in an innings: 5/27 by Graham Stevenson for Yorkshire v Berkshire, 1983"]}, {"page": "Peter Birtwisle", "response": ["Birtwisle made his debut for Durham against the Warwickshire Second XI in the 1965 Minor Counties Championship.  He played Minor counties cricket for Durham from 1965 to 1984, making 91 Minor Counties Championship appearances and 2 MCCA Knockout Trophy appearances.  He made his List A debut against Worcestershire in the 1968 Gillette Cup.  He made 10 further List A appearances for Durham, the last of which came against Lancashire in the 1983 NatWest Trophy.  In his 10 List A matches for Durham, he scored 223 runs at an average of 24.77, with a high score of 59.  This score, his only fifty in List A cricket, came against Northamptonshire in the 1977 Gillette Cup.  He also played a single List A match for Minor Counties East in the 1977 Benson & Hedges Cup against Yorkshire.  In this match, he scored 8 runs before being dismissed by Graham Stevenson."]}, {"page": "Deaths in January 2014", "response": ["*Graham Stevenson, 58, English cricketer, complications from stroke.Ex-England all-rounder Graham Stevenson dies at 58"]}, {"page": "2014 in the United Kingdom", "response": ["**Graham Stevenson, 58, cricket player."]}, {"page": "List of Marylebone Cricket Club players (1978–)", "response": ["* Graham Stevenson (1978) : G. B. Stevenson (Yorkshire)"]}]}}