{"wiki_id": "http://www.wikidata.org/entity/Q5592249", "itemLabel": "Graeme Duffin", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Graeme_Duffin", "wikipedia_page": {"main": "Graeme Ian Duffin (born 28 February 1956) is a British musician. He has played guitar for the Scottish pop band Wet Wet Wet since 1983.However he has never officially been a band member, nor has he appeared in band photographs or interviews. The band were suspected of keeping him hidden for image purposes but it may have been Duffin's own choice due to his life-long stammer. He is a Christian. with links to Queens Park Baptist Church Glasgow\nIn an interview with British Stammering Association trustee Eddie Phillips (Speaking Out, Autumn 2004, page 3) Duffin describes his experience of stammering severely during a radio interview in which he was attempting to discuss his work with Wet Wet Wet:\n\n\"I blocked on every syllable of every word, and they couldn't use the interview. I came out of the studio exhausted, disheartened, embarrassed. Two years ago I had an interview there that went really well. That partly reflects my level of confidence in my ability to deal with and enjoy that situation now.\"In addition to his role as a guitarist with the Wets and Director of the Foundry Music Lab, Duffin is actively involved in the work of the British Stammering Association Scotland, and is also an instructor/facilitator for the McGuire Programme.\nIn February 2006, Duffin opened Foundry Music Lab a recording, rehearsal and teaching facility with two of his friends, Ted Blakeway and Sandy Jones, in Motherwell.\nIn October 2006, Duffin joined Wets frontman Marti Pellow for a two-month tour in support of the latter's Moonlight Over Memphis solo album.\nGraeme's daughter Esther Duffin married Tim O'Connor and the pair formed Ashton Lane, a country duo with guitar work from Graeme. Albums include Right Here (2006), Nashville Heart (2015), and Count the Stars (2015).", "link_mentions": [{"page": "Wet Wet Wet", "response": ["Wet Wet Wet are a Scottish soft rock band formed in 1982. They scored a number of hits in the UK charts and around the world in the 1980s and 1990s. The band is composed of Graeme Clark (bass, vocals), Tommy Cunningham (drums, vocals), Neil Mitchell (keyboards, piano, vocals) and, since 2018, lead vocalist and former Liberty X singer Kevin Simm, who replaced founding member Marti Pellow after he left during the previous year. A fifth, unofficial member, Graeme Duffin (lead guitar, vocals), has been with them since 1983. The band were named Best British Newcomer at the 1988 Brit Awards.\"1988 Brit Awards - Winners\". Brits.co.uk. Retrieved 26 January 2014", "Clark and Cunningham met on the school bus and became close friends. Mutual friend Neil Mitchell, prompted by his pals' positive attitude, promised to supply keyboards when he could scrape together enough money from his paper round. To complete the quartet, Clark approached Mark McLachlan, who at the time was training to be a painter and decorator. He said, \"At break we all went behind the kitchen for a fly smoke, and there in the corner was this quiet kid who said very little, but when he sang, everyone listened.\"End of Part One: Their Greatest Hits liner notes It was sometime in 1983 that Graeme Duffin joined Wet Wet Wet, after the departure of co-founder Lindsey McCauley. Duffin had previously been in a Glasgow-based band called New Celeste and recorded two albums with them High Sands and the Liquid Lake (1977) in Holland (with sleeve notes by Billy Connolly) on the Universe label and On the Line (1979) in Berlin on the Hansa Records label. The band combined folk, rock and jazz players.", "In 1992, the band released a fourth studio album, entitled High on the Happy Side, which spawned the Number 1 hit single \"Goodnight Girl\" – the only self-penned chart-topping single they have had to date. The song proved something of a saviour, as the previous two single releases from the album had failed in the singles charts, although the album reached the top of the UK Albums Chart. In total, five singles were released from it. The following day saw the release of a special-edition album, Cloak & Dagger, released under the alias \"Maggie Pie & The Impostors\". \"Maggie Pie\" was Marti Pellow, and the \"impostors\" were (on album cover, clockwise from top left) Neil Mitchell, Graeme Duffin, Tommy Cunningham, and Graeme Clark."]}, {"page": "Marti Pellow", "response": ["At the end of June 2004, the reformed band went to a secret location to record tracks for a new album and to prepare for a UK tour. At the tour's conclusion, Pellow recorded Moonlight Over Memphis, with the record producer Willie Mitchell (Al Green, Otis Clay, Ann Peebles, etc.), demonstrating a deep affinity with southern soul. The album was released in October 2006 on DMG TV, a label which has had some success previously with albums by such artists as Jane McDonald and Daniel O'Donnell. Pellow went on tour during October and November to support the album, with a helping hand from regular Wets contributor Graeme Duffin."]}, {"page": "List of Scottish musicians", "response": ["*Graeme Duffin, lead guitarist for Wet Wet Wet"]}, {"page": "Popped In Souled Out", "response": ["Vocals by Wet Wet Wet and Graeme Duffin.", "*Graeme Duffin – Guitar"]}, {"page": "High on the Happy Side", "response": ["Cloak & Dagger is a free album of cover versions released with the deluxe edition High on the Happy Side. Included with the deluxe versions of the CD, Cassette & Vinyl pressings of the album, Cloak & Dagger was recorded and released under the pseudonym Maggie Pie & The Impostors, a fake veteran act from Scotland. Notably, the album cover pictures unofficial band member Graeme Duffin on an album cover for the first time, having only previously appeared in group shots featured in the booklet of the band's second studio album, Holding Back the River.", "* Graeme Duffin – electric and acoustic guitar, backing vocals"]}, {"page": "If I Never See You Again", "response": ["* Graeme Duffin – all guitars, production"]}, {"page": "So Long Ago", "response": ["* Graeme Duffin – guitar"]}]}}