{"wiki_id": "http://www.wikidata.org/entity/Q5592407", "itemLabel": "Graeme Taylor", "itemDescription": "British guitarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Graeme_Taylor", "wikipedia_page": {"main": "Graeme Taylor (born 2 February 1954 in Stockwell, South-West London) is a British guitarist.\nTaylor played lead guitar with 1970s medieval/rock band Gryphon, and leading folk rock bands including the Albion Band and Home Service. With Gryphon he had 4 best-selling LPs, and toured the US, supporting Yes at Madison Square Gardens, and the Mahavishnu Orchestra at the Houston Astrodome.\nTaylor played a major role in the creation and performance of the music for The Mysteries at the National Theatre in 1977 a production - to a text adapted by the poet Tony Harrison - that was revived in 1999, with Taylor in the role of musical director, arranger and composer of additional music.\nHaving spent many years playing guitars in the pit orchestras of many West End musicals, Taylor became a member of the touring bands for both John Tams and Rolf Harris, and runs his own studio in South London.", "link_mentions": [{"page": "Fledg'ling Records", "response": ["Their first release was Alright Jack by Home Service in 1991 (FLY 001). Indeed, no other records can be traced on the label until another album by Home Service \"Wild Life\" in 1995. Many of the early releases feature contributions by Graeme Taylor. The graphic artist David Suff is the only publicly acknowledged name to be associated with the label."]}, {"page": "John Kirkpatrick (musician)", "response": ["In 1997, he decided to front his own \"rock-folk\" band, and put together a line-up consisting of Graeme Taylor (guitar, electric guitar, banjo, mandolin – ex Gryphon, The Albion Band and Home Service), Mike Gregory (drums, percussion – ex Albion Band, Home Service), Dave Berry (electric bass, double bass, tuba) and Paul Burgess (fiddle, recorders – from the Old Swan Band).  They made two albums: a live album \"Force of Habit\" containing many of Kirkpatrick's arrangements of Morris tunes, plus other material from his back catalogue, plus a studio album \"Welcome To Hell\" featuring new material."]}, {"page": "Rise Up Like the Sun", "response": ["Rise Up Like the Sun is a British folk rock album released in 1978 by The Albion Band. The album is in part a collaboration between John Tams on vocals and melodeon and Ashley Hutchings on electric bass. This is not the first album on which the two worked together but it remains the most fulfilling for listeners. To build the sound Hutchings brought in two of his former compatriots from Fairport Convention, Dave Mattacks on drums and tambourine and Simon Nicol on vocals and electric and acoustic guitars. In addition another ex-member of Fairport, Richard Thompson, contributed songs and backing vocals. Having assembled the principal contributors and an ambiance that encouraged their friends to drop in, Hutchings gave Tams the freedom to act as the project's musical director. They were joined by Philip Pickett on shawms, bagpipes, curtals and trumpet, Pete Bullock on synthesiser, piano, clarinet, sax, and organ, Michael Gregory on percussion, Ric Sanders on violin and violectra and Graeme Taylor on electric and acoustic guitars. Kate McGarrigle, Julie Covington, Linda Thompson, Pat Donaldson, Martin Carthy, Andy Fairweather-Low and Dave Bristow make guest appearances.", "This was the last album to be produced by this line-up of the Albion Band. John Tams, Michael Gregory and Graeme Taylor remained in the line-up for one more album, Lark Rise to Candleford, and then went on to form Home Service. Philip Pickett became one of Britain's most respected scholars of medieval music. Ric Sanders went on to join Fairport Convention and both Nicol and Mattacks returned to the Fairport fold.", "* Graeme Taylor – guitar"]}, {"page": "List of guitarists", "response": ["*Graeme Taylor (Gryphon)"]}, {"page": "The Albion Band", "response": ["From 1974 to 1975, Hutchings abandoned the Albion name and focused on forming the Etchingham Steam Band with his wife Shirley Collins. However, in 1976 he pulled together a new Albion Band, this time with the aim of playing traditional dance music. It had a huge and unstable membership that included Simon Nicol, Graeme Taylor from Gryphon, the early musicians Phil Pickett and John Sothcott, fiddle player Ric Sanders, plus John Tams, one of folk music’s most distinctive and highly regarded vocalists. The immediate result was a lively traditional based album The Prospect Before Us under the name The Albion Dance Band. In 1978 they shortened the name to The Albion Band (which has remained the basis of the group’s identity since) and released, under Tams' direction, what is usually considered the finest album in the long history of the band Rise Up Like the Sun (1978).M. Brocken, The British Folk Revival, 1944-2002 (Ashgate, 2003), p. 104.", "* Graeme Taylor - guitar (1976–1981)"]}, {"page": "Gryphon (band)", "response": ["Gryphon formed in early 1972 as a four-piece band by English musicians Graeme Taylor, Richard Harvey, Dave Oberlé, and Brian Gulland. Harvey and Gulland were graduates of the Royal College of Music in London who started an acoustic band, using their classically trained backgrounds to perform a mixture of English folk music, contemporary rock, medieval and Renaissance music. The duo were joined by guitarist Graeme Taylor and drummer Dave Oberlé shortly after, thus becoming the first line-up of Gryphon. They soon signed a recording deal with the folk label Transatlantic Records and secured Nick Wright as their manager. The band's first live gig took place at the Stone Parish Church in Aylesbury, Buckinghamshire, promoted by the town's Friars venue. Their publicist Martin Lewis described their sound: \"Imagine Henry VIII in a rock'n'roll band – think Gryphon.\"", "In September 2007, Gryphon announced on their website that they had finally decided to produce a new album after a silence of thirty-one years. A one-off performance occurred on 6 June 2009 at the Queen Elizabeth Hall, London, thirty-two years after their last performance. The four original members - Richard Harvey, Brian Gulland, Graeme Taylor and Dave Oberlé - opened the evening with a selection of songs and instrumentals from the first album Gryphon. They were then joined by Jon Davie (the final bass player, who appeared on Treason) and a new member, the multi-instrumentalist and film/production music composer Graham Preskett for the rest of the evening.", "* Graeme Taylor — guitars, vocals  (1973-1975, 2009, 2015–present)", " bar:Graeme text:\"Graeme Taylor\""]}, {"page": "Graham Taylor (disambiguation)", "response": ["* Graeme Taylor (born 1954), British guitarist", "* Graeme Taylor (footballer) (born 1942), Australian rules footballer for Footscray"]}, {"page": "Home Service", "response": ["Home Service was formed out of members of the Albion Band, who had participated in recording Rise Up Like the Sun (1978). Their establishment was partly out of the confusion caused by line-up changes when the Albion Band were playing as, in effect, a house band in Bill Bryden's National Theatre productions in the late 1970s and early 1980s, including Lark Rise to Candleford. Members of the group took part in an adaptation of Michael Herr's Dispatches without band leader Ashley Hutchings.  In late 1980, eight members began to rehearse together in Southwark, London and had soon splintered off from the parent band.Sleeve notes for Alright Jack reissue (Fledg'ling, 1997). The original line-up was: John Tams (vocals, melodeon), Bill Caddick (vocals, guitar, dobro), Graeme Taylor (vocals, guitar), Michael Gregory (drums), Roger Williams (trombone, tuba), Howard Evans (trumpet), Colin Rae (trumpet) and Malcolm Bennett (bass).  The large group was somewhat unwieldy and complicated by other projects, including the fact that both Evans and Williams were also members of Brass Monkey. Rae soon left and the remaining members initially chose the name 'The First Eleven' and then switched to Home Service, which had both associations of Britishness/Englishness and of a bygone world in the defunct BBC Home Service radio station.", "*Graeme Taylor - electric guitar"]}, {"page": "Beginnings (Steve Howe album)", "response": ["* Graeme Taylor – guitar (3)"]}, {"page": "Red Queen to Gryphon Three", "response": ["*Graeme Taylor – guitars"]}, {"page": "Treason (album)", "response": ["Following the departure of guitarist Graeme Taylor and bassist Malcolm Bennett after the release of Raindance, Gryphon recruited Bob Foster and Jonathan Davie to replace them respectively. Alex Baird was also hired as the band's new drummer so previous drummer David Oberlé could focus on lead vocals. The album was also made in collaboration with lyricist Tim Sebastion."]}, {"page": "Gryphon (album)", "response": ["*Graeme Taylor - guitars, keyboards, recorder, vocals (4)"]}, {"page": "Raindance (Gryphon album)", "response": ["Raindance is the fourth progressive rock album by Gryphon, originally released in 1975 by Transatlantic, catalogue number TRA 302.Transatlantic catalogue 300-386 It is the penultimate Gryphon album, and the last to include contributions from guitarist Graeme Taylor.", "*Graeme Taylor - guitars, backing vocals"]}, {"page": "The Prospect Before Us", "response": ["* Graeme Taylor – electric guitar, piano"]}, {"page": "Tank Battles", "response": ["*Graeme Taylor – guitar, banjo"]}, {"page": "Midnight Mushrumps", "response": ["*Graeme Taylor – guitars (acoustic, semi-acoustic, classical, electric & 12-string), vocals and raincoat."]}, {"page": "The Guv'nor vol 4", "response": ["*Graeme Taylor on 4,5,6 and 7"]}, {"page": "The Guv'nor vol 3", "response": ["* Graeme Taylor on 5,6,7,8,9 and 10"]}]}}