{"wiki_id": "http://www.wikidata.org/entity/Q5591101", "itemLabel": "Grace Eleanor Hadow", "itemDescription": "British author, social worker and college head", "wikipedia_url": "https://en.wikipedia.org/wiki/Grace_Eleanor_Hadow", "wikipedia_page": {"main": "Grace Eleanor Hadow OBE (9 December 1875 in Cirencester, England – 19 January 1940, Marylebone, London) was an author, principal of what would become St Anne's College, Oxford and vice-chairman of the National Federation of Women's Institutes (NFWI).", "link_mentions": [{"page": "South Cerney", "response": ["*Grace Eleanor Hadow, author and scholar"]}, {"page": "Wolvercote Cemetery", "response": ["* Grace Eleanor Hadow (1875–1940), promoter of women's higher education"]}, {"page": "Gerald Edgcumbe Hadow", "response": ["He was the son of Canon Herbert Edgcumbe Hadow and Edith Rose Abell. He grew up at Quedgeley Vicarage, Gloucestershire.  He attended Haileybury College, leaving in about 1930.  From there he went to Oriel College, Oxford University.  His uncle was musician Sir William Henry Hadow and his aunt author Grace Eleanor Hadow. He was a keen singer and was a Tenor Solo at Haileybury College."]}, {"page": "Hadow", "response": ["*Grace Eleanor Hadow (1875–1940) author, principal of St Anne's College, Oxford University and former vice-chairman of the Women's Institute"]}, {"page": "Grace (given name)", "response": ["* Grace Eleanor Hadow (1875–1940), English author and academic"]}, {"page": "Fyfield Road", "response": ["R. G. Collingwood (1889–1943), philosopher, historian, and Fellow of Pembroke College, Oxford, lived at 5 Fyfield Road with his wife Ethel. Grace Eleanor Hadow (1875–1940), author and Principal of St Anne's College, Oxford (1929–40), lived at 7 Fyfield Road in 1936. The historian Henry William Carless Davis CBE FBA (1874–1928) lived at 11 Fyfield Road with his wife and three children, one of whom, later another historian Ralph Henry Carless Davis (1918–1991), was born at the house on 7 October 1918. Rev. Arthur Acland, a tutor at Christ Church, Oxford, leased 13 Fyfield Road in 1878. Joan Gili (1907–1998), a Catalan antiquarian book-seller, publisher and translator, lived at 14 Fyfield Road with his family from 1945 to 1969."]}, {"page": "Grace E. Hadow", "response": ["#REDIRECT Grace Eleanor Hadow"]}, {"page": "G.E. Hadow", "response": ["#REDIRECT Grace Eleanor Hadow"]}, {"page": "List of St Anne's College, Oxford people", "response": ["*1929–1940 Grace Eleanor Hadow"]}, {"page": "List of Somerville College, Oxford, people", "response": ["*Grace Eleanor Hadow OBE (1875–1940), author, principal of what would become St Anne's College, Oxford, and vice-chairman of the Women's Institute", "*Grace Eleanor Hadow OBE (1875–1940), author, principal of St Anne's College, Oxford, and vice-chairman of the Women's Institute"]}, {"page": "Grace Hadow", "response": ["#REDIRECT Grace Eleanor Hadow"]}]}}