{"wiki_id": "http://www.wikidata.org/entity/Q5592194", "itemLabel": "Graeme Archer", "itemDescription": "cricketer (born 1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Graeme_Archer", "wikipedia_page": {"main": "Graeme Francis Archer is a former English first-class cricketer. A middle order batsman, he played 100 first-class matches for Nottinghamshire from 1992 to 1999.  He was awarded his Nottinghamshire cap in 1995.  He later played Minor Counties Championship cricket for Staffordshire and Cheshire and club cricket in the Derbyshire Premier Cricket League.\nHe made a bright start to his career, averaging 47.5 in seven matches in his debut season in 1992, but found runs harder to come by in 1993.  He established himself as a regular in 1994 and excelled in 1995, passing 1,000 runs for the first time in scoring 1,171 at 40.37.  He built on this with 918 at 43.71 the following year, but despite having his best one day season in 1997, scoring 489 runs at 44.45 with two centuries, his performances fell away and after three years of averaging under thirty in the County Championship he was released.  He scored ten first-class hundreds in all, with a best of 168 against Glamorgan, one of three centuries he recorded against the Welsh team.", "link_mentions": [{"page": "Archer (surname)", "response": ["* Graeme Archer (born 1940), English cricketer", "* Graeme Archer (bowls) (born 1967), Scottish lawn bowler"]}, {"page": "Warwickshire County Cricket Club in 1994", "response": ["Warwickshire won the toss and fielded first on an overcast day and slow pitch. Stand-in captain Tim Munton took an early wicket but Nottinghamshire dominated the first day with Paul Pollard scoring a century in 295 minutes. He shared hundred partnerships with both Graeme Archer (41) and Paul Johnson (63) as the visitors closed a curtailed opening day on 268/4. Chris Lewis dominated the scoring on day two, taking his overnight score of 20 to 220 not out by the time of the declaration. He scored 21 fours and 6 sixes in his innings, and added 157 in 27 overs with Kevin Evans. Warwickshire lost three wickets in the remaining 20 over session. Warwickshire were made to follow on despite lower order resistance from Graeme Welch. He scored a career best 84 not out sharing in an eighth wicket stand of 68 with Neil Smith and added 86 with tail-enders Gladstone Small and Munton. Following on, Brian Lara was dismissed for a duck which brought his season average below 100 for the first time. The hosts closed day three on 134/3 with Roger Twose unbeaten on 74. Twose and overnight partner, Trevor Penney, were both dismissed inside the first 10 overs of the final day to reduce hopes of drawing the match. Three other wickets fell before lunch and Nottinghamshire's victory was achieved 45 minutes after the interval when Munton fell to Lewis, his sixth of the match."]}, {"page": "Lenny Cooper (cricketer)", "response": ["Cooper made his debut for Hertfordshire in the 2000 Minor Counties Championship against Cambridgeshire.  Cooper played Minor counties cricket for Hertfordshire from 2000 to 2008, including 22 Minor Counties Championship matches and 10 MCCA Knockout Trophy matches.  In 2001, he made his List A debut against Worcestershire in the 3rd round of the 2001 Cheltenham & Gloucester Trophy.  He played a further List A match in 2001, against Staffordshire in the 1st round of the following season's competition, which was played in 2001.  In his two List A matches, he scored 6 runs at a batting average of 3.00, with a high score of 6.  With the ball he took just a single wicket, which cost 107 runs.  His only List A wicket was that of Staffordshire's Graeme Archer, with Cooper claiming figures of 1/63 from 10 overs."]}, {"page": "Caythorpe Cricket Club", "response": ["*   Graeme Archer  (Notts)"]}]}}