{"wiki_id": "http://www.wikidata.org/entity/Q55964", "itemLabel": "Anna Löwenstein", "itemDescription": "British author, editor and Esperantist", "wikipedia_url": "https://en.wikipedia.org/wiki/Anna_L%C3%B6wenstein", "wikipedia_page": {"main": "Anna Lowenstein or Löwenstein (born 1951) is a British Esperantist.  She worked for the World Esperanto Association 1977–1981. Under the name Anna Brennan she founded and was editor of the feminist magazine Sekso kaj Egaleco 1979–1988, and she edited the 'easy language' section of Kontakto 1983–1986. She has written some non-fiction, and two novels. Her historical novel The Stone City  (La Ŝtona Urbo), was first published in English and Esperanto in 1999, and has since been translated into French (2010) and Hungarian (2014). Her second novel Morto de artisto  (2008) was published in Esperanto. She is well known as a journalist, teacher and activist in the Esperanto movement, and has been a member of the Academy of Esperanto since 2001.\nShe is married to Renato Corsetti, a former president of the World Esperanto Association. The couple lived together in Italy from 1981, but since 2015 they have been living in the UK.", "link_mentions": [{"page": "Esperanto", "response": ["* Anna Löwenstein"]}, {"page": "Akademio de Esperanto", "response": ["* Anna Löwenstein"]}, {"page": "Renato Corsetti", "response": ["He is married to Anna Löwenstein. The couple lived together in Italy from 1981, but since 2015 they have been living in the UK."]}, {"page": "List of Esperanto-language writers", "response": ["*Anna Löwenstein"]}, {"page": "Anna Lowenstein", "response": ["#REDIRECT Anna Löwenstein"]}, {"page": "Esperantist of the Year", "response": ["* 2019: Anna Löwenstein (b. 1951), a writer living in the United Kingdom, well-known for her literary and educational contributions for decades. This honor is a special recognition of her work creating and contributing to the new website uea.facila.org."]}]}}