{"wiki_id": "http://www.wikidata.org/entity/Q5593422", "itemLabel": "Grahame McGifford", "itemDescription": "British footballer (born 1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Grahame_McGifford", "wikipedia_page": {"main": "Grahame Leslie McGifford (born 1 May 1955) is an English former footballer, who played at right-back for Huddersfield Town, Hull City, Port Vale and Northwich Victoria.", "link_mentions": [{"page": "Roy Sproson", "response": ["There was unrest at Port Vale at the start of 1977–78, as Sammy Morgan and David Harris were so upset by the low wages they were offered that they refused to play for the club. Sproson brought in three players on free transfers: Jeff Hemmerman, Grahame McGifford, and Bill Bentley. However at a meeting on 28 June, Sproson was severely criticized for his supposed poor judgement of players and for seeming to place greater priority on his newsagent business than the club. The Sentinel reported that \"there is disenchantment in the air\", and there were rumours that former Stoke manager Tony Waddington would be brought in to replace Sproson. Sproson was sacked in October 1977 after a poor run of results. His replacement Bobby Smith failed to rescue Vale from relegation despite making numerous signings. England manager Don Revie had predicted such a fate when he said at a dinner that \"English football suffers from the same complaint all the time. You've got two local lads here as your management team [referring to Sproson and his assistant Reg Berks]. I'll tell you now, you won't give them enough money to get out of this division, but eventually you'll give them both the sack and then you'll give the next manager the lot.\""]}, {"page": "1975–76 Huddersfield Town A.F.C. season", "response": ["|Grahame McGifford||||DF||3||0||0||0||0||0||3||0"]}, {"page": "1974–75 Huddersfield Town A.F.C. season", "response": ["|Grahame McGifford||||DF||22||0||1||0||1||0||24||0"]}, {"page": "1973–74 Huddersfield Town A.F.C. season", "response": ["|Grahame McGifford||||DF||16||0||0||0||1||0||17||0"]}, {"page": "1972–73 Huddersfield Town A.F.C. season", "response": ["|Grahame McGifford||||DF||0 (1)||0||0||0||0||0||0 (1)||0"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Grahame McGifford||||1970–1976||41 (1)||0||1||0||2||0||0||0||0||0||44 (1)||0"]}, {"page": "Grahame Leslie McGifford", "response": ["#REDIRECT Grahame McGifford"]}, {"page": "1977–78 Port Vale F.C. season", "response": ["The pre-season saw manager Roy Sproson attempt to re-sign Sammy Morgan for £12,000, however Morgan refused personal terms. Former Player of the Year David Harris also refused terms and demanded a transfer, so Terry Alcock re-joined on a month's trial to take his place. Three players arrived on free transfers: Jeff Hemmerman and Grahame McGifford from Hull City, and Bill Bentley from Blackpool. On a 28 June meeting, Sproson was severely criticized for his poor judgement of players and his seeming to place greater priority on his newsagent business than the club. Sproson did not attend the meeting, but was informed the board would review his position after fifteen games. The Football Association also hit the club with a £500 fine for their continuing problem with player indiscipline, despite Sproson's argument that no Vale players had been sent off in the last two years.", "On the financial side, a loss of £1,575 was made. The massive transfer outlay was paid for by huge donations of £51,428 from the Sportsmen's Association and the Development Fund. The lottery also brought in £600 a week. Gate receipts had brought in £78,965, a downturn in attendance being outweighed by an increase in ticket prices. Seven players were handed free transfers, five of which were: Mick Cullerton and Grahame McGifford (Northwich Victoria); Derek Brownbill (Cleveland Cobras); Alan Lamb (Dundee); and Kevin Kennerley (Stafford Rangers). Manager Bobby Smith also departed, having taken the vacant position at Swindon Town – Vale received £10,500 in compensation. Dennis Butler rejected the opportunity to leave with him, and instead was appointed as Smith's replacement at Vale. Graham Hawkins became Butler's assistant.", "|align=\"left\"|DF||align=\"left\"| Grahame McGifford", "| June 1977 || DF ||  || Grahame McGifford || Hull City || Free transfer || ", "| May 1978 || DF ||  || Grahame McGifford || Northwich Victoria || Free transfer || "]}, {"page": "McGifford", "response": ["*Grahame McGifford (born 1955), English footballer"]}]}}