{"wiki_id": "http://www.wikidata.org/entity/Q5592640", "itemLabel": "Graham Baker", "itemDescription": "Footballer (born 1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Graham_Baker_(footballer)", "wikipedia_page": {"main": "Graham Baker (born 3 December 1958) is an English former footballer who played as a midfielder for Southampton, Manchester City and Fulham.", "link_mentions": [{"page": "Woking F.C.", "response": ["Cockerill took over as manager later that year, and oversaw a relative period of stability for the club, before he was sacked shortly before the end of the 2006–07 season. An unimpressive campaign under the management of Frank Gray followed in 2007–08, before a disastrous 2008–09 season which saw three men (Kim Grant, Phil Gilchrist and Graham Baker) take charge of the club, eventually resulted in the club's relegation to the Conference South. That summer, a supporters' trust took over the running of the club. Woking finished 5th in their first Conference South season, but lost to Bath City in the play-off final. The following season saw Woking struggling to challenge for promotion, and Graham Baker was sacked halfway through the campaign for suggesting that the fans were expecting too much of the team.", "|  Graham Baker &  Neil Smith", "|  Graham Baker"]}, {"page": "List of Manchester City F.C. players", "response": ["|align=\"left\"|Graham Baker||  || Midfielder || 1982–1987||138||21|| ||"]}, {"page": "Neil Smith (footballer)", "response": ["Smith was appointed joint caretaker manager of Woking in March 2007 with Graham Baker following the departure of Glenn Cockerill, helping the club to stay in the Conference National."]}, {"page": "Baker (surname)", "response": ["** Charles Graham Baker (1883–1950), American screenwriter and director", "* Graham Baker (footballer) (born 1958), English former footballer", "* Graham Baker (director), British film director"]}, {"page": "Steve Cherry", "response": ["Cherry started his first competitive game for Derby as John Middleton was ruled unfit due to a shoulder injury for a First Division fixture against Southampton at the Baseball Ground on 16 February 1980. The match finished 2–2, with David Watson and Graham Baker scoring for the visitors. He kept his first-team place for the following game at home to Tottenham Hotspur, which Derby won 2–1, however he was then sidelined after injuring his ankle slipping on the pavement outside his home whilst trying to prevent his kitten from running away. He returned to the starting eleven in a 3–1 win against Manchester City on 24 April and was named as man of the match. Derby were relegated at the end of the 1979–80 season and the club signed two new goalkeepers: 34-year old Roger Jones and 24-year old Yakka Banovic."]}, {"page": "Gordon Hobson", "response": ["Although he showed \"a nice sense of balance and an eye for goal\", Hobson suffered from an ankle injury after a month of the 1987–88 season. Graham Baker took his place in the side, and by the time that he was fit again, Hobson found it hard to break back into the team, especially with the emergence of younger players such as Rod Wallace, Matthew Le Tissier and Alan Shearer."]}, {"page": "1986 Full Members' Cup Final", "response": ["|MF ||13 || Graham Baker || "]}, {"page": "Graham Baker", "response": ["Graham Baker may refer to:", "* Graham Baker (footballer) (born 1958), English former footballer", "* Graham Baker (director), British film director", "* C. Graham Baker (1883–1950), American screenwriter and director"]}, {"page": "List of people from Hampshire", "response": ["*Graham Baker, footballer, was born in Southampton"]}, {"page": "1987–88 Manchester City F.C. season", "response": ["| Graham Baker"]}]}}