{"wiki_id": "http://www.wikidata.org/entity/Q5592747", "itemLabel": "Graham Crabb", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Graham_Crabb", "wikipedia_page": {"main": "Graham Crabb (born Graham Charles Crabb, 10 October 1964, Streetly, Warwickshire, England), also known as Crabbi, is an English musician, best known for performing in the industrial/dance rock band Pop Will Eat Itself (PWEI), and being the only current members of the band since their inception.", "link_mentions": [{"page": "Nothing Records", "response": ["In the wake of the RCA shake-up, Pop Will Eat Itself moved to Infectious Records in the UK. A call between PWEI and Nine Inch Nails management would lead to Nothing Records picking up licensing rights for the band in the United States. Former frontman Clint Mansell (who shared songwriting and vocal duties with Graham Crabb) recalled:", "PWEI toured to promote the album and enjoyed a raised profile in the States, but at the end of touring, the band found themselves struggling to continue as a creative force.  Work did begin on an untitled follow-up to Dos Dedos Mis Amigos, with the band entering the studio in 1996. Their sixth studio album, which had been intended for Stateside release via Nothing, would not see release before the band broke up, however. Member Graham Crabb quit the band to focus on his ambient  project Golden Claw Musics. Members Richard March and Robert \"Fuzz\" Townshend went on to form the big beat band Bentley Rhythm Ace. Townshend also released two solo albums, while Clint Mansell would end up signing onto Nothing Records as a solo artist.  Mansell stated:", "Vileevils performed their final live date in December 2008, before recording an unreleased album, which was cancelled prior to release in 2010. Instead, Pop Will Eat Itself finally reformed in 2011, with Graham Crabb serving as the band's only original member, while having the blessing of all the former members. Songs from both the abandoned Vile Evils album, as well as the abandoned Sonic Noise Byte album, were reworked and re-recorded for alongside new material for Pop Will Eat Itself's return album New Noise Designed by a Sadist, released in 2011 on Cooking Vinyl in the UK and Metropolis Records in the US.", "The revived PWEI also began a series of reissues of their back-catalog, via the Cherry Red label.  On October 7, 2013, the band re-issued Dos Dedos Mis Amigos on Cherry Red, featuring five rare bonus tracks, as well as a second disc; the unreleased 1996 album, now titled A Lick Of The Old Cassette Box.  A Lick Of The Old Cassette Box was also released as a limited edition, stand-alone vinyl pressing that same year. Pop Will Eat Itself continues as a full-time project to this day, under the direction of Graham Crabb."]}, {"page": "Pop Will Eat Itself", "response": ["An early permutation of the band formed in 1981 under the name From Eden. Members included Clint Mansell, Adam Mole, Chris Fradgley, Malcolm Treece and Miles Hunt (Treece and Hunt went on to form The Wonder Stuff). From Eden recruited Graham Crabb to replace Hunt on drums before splitting up.", "In July 2011, a new line-up was announced, featuring Graham Crabb (as the only original member), fellow vocalist Mary Byker (Gaye Bykers on Acid, Apollo 440, Pigface), guitarist Tim Muddiman (Gary Numan), drummer Jason Bowld (Pitchshifter, Killing Joke) and bassist Davey Bennett (This Burning Age). ", "* Graham Crabb - vocals, drums, keyboards, programming", " bar:Graham   text:\"Graham Crabb\""]}, {"page": "3kStatic", "response": ["The Kevin Max album 'Cotes d' Armor (True Rebels)' was released August 24, 2010. Produced by 3kStatic in association with Kevin Max, the album also features guest performances and contributions from Graham Crabb, Adrian Belew, Tedd T., Lynn Nichols and others."]}, {"page": "Bishop Vesey's Grammar School", "response": ["* Graham Crabb, musician, Pop Will Eat Itself"]}, {"page": "This Is the Day...This Is the Hour...This Is This!", "response": ["The Birmingham-based Pop Will Eat Itself started in 1986 as a Buzzcocks-influenced indie rock band. Though initially associated with the C86 scene, their rougher, rockier sound led to them being championed by the music press as one of several grebo bands that were emerging from Midlands, with the word \"grebo\" itself having been revived by the band. Band member Graham Crabb said: \"We revived this '70s [slang] word for dork or nerd, and the press had to build this movement around it to describe everyone with long hair and a nasty guitar sound.\" The band thought their musical style was \"pretty much going down a cul de sac\" until they found numerous other \"more interesting\" influences. Crabb reflected: \"We just started listening to a lot of new stuff, stuff we hadn't heard before. We saw Run-DMC and the Beastie Boys come over and play, and they blew us away.\"", "This Is the Day...This Is the Hour...This Is This! features the band's unique \"mesh and mix\" of pop culture from the United States and particularly the United Kingdom, and combines metal guitar riffs, disco backing and conspicuous drum stomps. Throughout the album, there are what AllMusic's Ned Raggett described as \"intriguing surprises\", including multiple moody goth and post-punk elements. Influences of rap, heavy metal and the band's early influence of punk rock are spliced with numerous \"found\" auto artefacts \"collected from all over the junk-culture landscape\", including Motown snippets, advertising slogans and the \"play-by-play call of a John Elway touchdown pass. The music press found the band's sound hard to categorise. Band member Graham Crabb explained: \"Nobody's really come up with a description of what we do, and we're quite happy about that. It gives us absolute freedom.\"", "Trouser Press were very favourable to the album, calling it an \"aurally exciting sonic collage\" and concluding that, \"bright, vital and bitingly funny, this record teems with invention.\" Jason Ankeny of AllMusic called it the band's masterpiece. It was cited as the first of three consecutive groundbreaking albums by the band in The Rough Guide to Rock. On the BBC's \"Keeping It Peel\" feature, they described the album as the band's \"most effective outing\", while Jason Heller of The A.V. Club called the album an \"electronic, sample-heavy classic.\" At the end of 1989, NME ranked the album at number 22 in its list of the 50 best albums of the year. Graham Crabb later reflected that the album was \"probably our best piece of work.\"", "* Graham Crabb - Vocals"]}, {"page": "The Looks or the Lifestyle?", "response": ["* Graham Crabb – Vocals"]}, {"page": "Vileevils", "response": ["The band toured extensively in the UK,PWEInation Tour Dates 2006. Retrieved on 2007-06-18PWEINation Tour Dates 2007. Retrieved on 2007-06-18 before reorganising as a more minimalist two-piece, after Fuzz left the band in 2007.  On 23 February 2010, Vile Evils announced that they had disbanded, and that Graham Crabb would move on to reconstitute Pop Will Eat Itself. "]}, {"page": "Golden Claw Musics", "response": ["#REDIRECT Graham Crabb"]}, {"page": "Box Frenzy", "response": ["* Graham Crabb – vocals"]}, {"page": "Cure for Sanity", "response": ["#\"88 Seconds... & Still Counting\" (Graham Crabb, Clint Mansell, Richard March, Adam Mole) – 3:53"]}, {"page": "Mark Thwaite", "response": ["On 10 March 2015 Primitive Race announced the release of their first E.P. \"Long In The Tooth\" through Metropolis Records on 19 June 2015. The EP features vocals by Raymond Watts (of PIG) and guitars by Thwaite. This was followed by the full-length album 'Primitive Race' also on Metropolis records released on 7 August, featuring Thwaite on many of the tracks, including collaborations with Tommy Victor of US metal band Prong, Dave Ogilvie (Skinny Puppy), and Graham Crabb (Pop Will Eat Itself)"]}, {"page": "There Is No Love Between Us Anymore", "response": ["\"There Is No Love Between Us Anymore\" showed a marked increase in sales for the band, with the single reaching 66 on the UK singles chart. A music video was recorded featuring shots of a couple's relationship, with only very brief views of the band, consisting of extreme close-ups from several angles. It appears on the video album Unspoilt By Progress, along with a snippet of the band performing the song live while Graham Crabb was still playing drums for the group.", "Category:Songs written by Graham Crabb"]}, {"page": "Def. Con. One", "response": ["Category:Songs written by Graham Crabb"]}, {"page": "Can U Dig It?", "response": ["An accompanying music video was made for the single. It features Clint Mansell and Graham Crabb singing the song against various changing backgrounds (many of which reference the song lyrics,) while in other parts the rest of the band members perform the song with stacks of TVs behind them.", "Graham Crabb - Vocals"]}, {"page": "Wise Up! Sucker", "response": ["A music video was filmed for the song, and it appears on the video album Unspoilt By Progress. It features band members Clint Mansell and Graham Crabb singing in front of various backgrounds such as moving landscapes, comics and the band performing live, while other band members Richard March and Adam Mole play guitar in front of an array of screens, all showing themselves playing. The video is intercut with multiple computer-generated effects and animations."]}, {"page": "New Noise Designed by a Sadist", "response": ["All tracks composed by Crabbi (Graham Crabb); except where indicated", "*Graham Crabb - vocals, guitar, programming"]}, {"page": "Mary Byker", "response": ["Byker was a founding member of grebo band Gaye Bykers on Acid, which he formed with bassist Robber Byker in 1985 before being joined by guitarist Tony Byker and drummer Kevin Hyde in 1986. The band recorded several albums before dissolving in 1990. Following this, he worked with Martin Atkins in the Industrial Music supergroup Pigface as well as Hyperhead before joining Apollo 440 in 1996. In 2002 he toured with former bandmate Noko as part of Maximum Roach. In 2010 he joined the recently reformed Pop Will Eat Itself as co-vocalist alongside Graham Crabb. When not touring and recording with Pop Will Eat Itself, Byker works as a DJ while occasionally scoring music for films and television.", "Byker is currently the co-vocalist of the band Pop Will Eat Itself along with Graham Crabb. He has featured on the LPs New Noise Designed by a Sadist and Anti-Nasty League."]}, {"page": "A Lick of the Old Cassette Box", "response": ["* Graham Crabb – Vocals"]}, {"page": "Primitive Race", "response": ["Primitive Race is an international industrial supergroup created by Chris Kniker and featuring Raymond Watts (PIG, KMFDM), Dave Ogilvie (Skinny Puppy), Mark Gemini Thwaite (Peter Murphy, Spear of Destiny, Tricky, Mob Research, The Mission, Gary Numan), Erie Loch (LUXT, Blownload, Exageist), Chuck Mosley (Faith No More), Graham Crabb (Pop Will Eat Itself) and Kourtney Klein (Combichrist, Nitzer Ebb).", "Primitive Race published an interview featuring Graham Crabb on YouTube on September 26, 2013, detailing how the band collaborates, produces and constructs their music.", "*Graham Crabb – Vocals, Guitar, Bass, Programming – Announced June 14, 2013"]}, {"page": "Sweet Sweet Pie", "response": ["Category:Songs written by Graham Crabb"]}, {"page": "Primitive Race (album)", "response": ["Primitive Race is the first full-length album by Industrial supergroup Primitive Race. Created by Chris Kniker, the project has regular appearances by Graham Crabb, Erie Loch, and Mark Gemini Thwaite. A few more additional contributors include Tommy Victor, Dave “Rave” Ogilvie, Kourtney Klein, Mark “3KSK” Brooks, Josh Bradford, Andi Sex Gang.", "* Graham Crabb - Vocals, Synth, Programmed By"]}, {"page": "Anti-Nasty League", "response": ["* Graham Crabb - Vocals, Keyboards, Programming"]}, {"page": "Now for a Feast!", "response": ["Now for a Feast! is a compilation album by English rock band Pop Will Eat Itself, released in November 1988 by Chapter 22 Records. It compiles their work before 1988, and has been re-released several times by different labels, each with a different selection of bonus tracks. The Cherry Red version, released as a 25th anniversary edition, contained almost every song released by the band while Graham Crabb was drumming, as well as several unreleased demos and versions, one live song, and three very rare demos recorded by Wild And Wandering, the previous incarnation of the band before their name was changed to Pop Will Eat Itself in 1986. The album is largely devoid of the grebo and electronic influences of later albums.", "* Graham Crabb – drums, backing and lead vocals"]}, {"page": "The Poppies Say GRRrrr!", "response": ["The EP contained five short songs which were all later released on a version of Poppiecock, the following release by the band. They also appeared in the 1988 compilation \"Now For A Feast!\". These songs had the sound distinctive of early Pop Will Eat Itself, with simple chord structures and rhythms, driven by vintage-style distorted electric guitar. This style persisted until 1987, when the drummer, Graham Crabb, switched to a lead vocal role and the band became abruptly more electronic."]}, {"page": "Poppiecock", "response": ["Poppiecock is the second EP by British grebo band Pop Will Eat Itself, released in the same year as the previous, The Poppies Say GRRrrr!. The musical style remains similar to that of the first EP, with short distorted-guitar-driven tracks with simple melodies and rhythms. This style continued until Graham Crabb's movement from a drumming position to lead vocals in mid-1987."]}, {"page": "Crabbi", "response": ["#REDIRECT Graham Crabb"]}, {"page": "All Blue Revue", "response": ["#REDIRECT Graham Crabb", "Category:Graham Crabb albums"]}]}}