{"wiki_id": "http://www.wikidata.org/entity/Q5592304", "itemLabel": "Graeme Jones", "itemDescription": "English association football player and manager (born 1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Graeme_Jones", "wikipedia_page": {"main": "Graeme Anthony Jones (born 13 March 1970) is an English professional football manager and former player who is currently working as the joint assistant at Newcastle United along with Jason Tindall.\nHis playing career, which spanned the years 1991 to 2006, included spells at North Shields, Bridlington Town, Doncaster Rovers, Wigan Athletic, St Johnstone, Southend United, Boston United, Bury, Clyde and Hamilton Academical.\nHe went into coaching in 2007, when he became the assistant manager of Swansea City. Jones is notable as being the assistant to Roberto Martínez between 2007 and 2018, with spells at Swansea, Wigan Athletic, Everton and the Belgian national team. After leaving Belgium in 2018, he worked as assistant manager to Darren Moore at West Bromwich Albion, a role he held until March 2019. Jones was appointed to his first managerial position at newly promoted Championship club Luton Town in May 2019. He left the position in April 2020, going on to serve in assistant coaching roles at Bournemouth and Newcastle United.\n\n", "link_mentions": [{"page": "Thierry Henry", "response": ["In August 2016, Henry became second assistant coach of the Belgium national team, working alongside head coach Roberto Martínez and fellow assistant Graeme Jones. In an interview with NBC Sports, Belgium striker Romelu Lukaku praised Henry for his work with him, stating, \"Henry is the best thing that has happened to me because since I came to England aged 18 I have had the best mentors. Thierry for me is the best. Every day whether it is positive and negative I take it in my stride because I know what is expected from the top level.” At the 2018 FIFA World Cup, Belgium reached the semi-final, but lost to Henry's home nation France 1–0. Henry picked up a Bronze medal after Belgium defeated England 2–0 in the third-place play-off to secure their best ever World Cup finish."]}, {"page": "Wigan Athletic F.C.", "response": ["In February 1995, local millionaire and owner of JJB Sports, Dave Whelan purchased the club. Through Whelan's business connections in Spain he attracted three Spaniards to the club – Roberto Martínez, Isidro Díaz, and Jesus Seba – who became known as the Three Amigos.The Three Amigos  Ultimate Wigan Athletic Website (on Tiscali) The trio became the on-pitch symbols of Whelan's ambitious plan to take Wigan Athletic into the Premier League. The Three Amigos were joined at the club by John Deehan, who replaced Barrow as manager during the 1995–96 season following a 6–2 home defeat to Mansfield Town. Deehan took the Latics within two points of a play-off place in his first season; the club had in fact been in the final automatic promotion spot with four games remaining, but lost them all and so failed to even make the playoffs. The following year Wigan Athletic became Division Three champions on the last day of the season, Graeme Jones scoring a club record 31 league goals in the process. In most seasons they would have been runners-up, but a temporary rule change which saw goals scored take precedence over goal difference allowed them to finish above runners-up Fulham, who had the same number of points and a better goal difference.", "|1996–97|| Graeme Jones", "*Most League goals scored, season: 31, Graeme Jones (1996–97)"]}, {"page": "Eddie Howe", "response": ["Howe was appointed to replace Steve Bruce as the manager of Premier League club Newcastle United on 8 November 2021, signing a contract until the summer of 2024. Howe watched from the stands as the club drew 1–1 with Brighton & Hove Albion, in which Graeme Jones was acting as caretaker manager, who was retained as first team assistant coach as part of Howe's new coaching staff, which also included Jason Tindall, Stephen Purches and Simon Weatherstone, whom he worked with at AFC Bournemouth, as well as retained Newcastle goalkeeping coach Simon Smith. His appointment at Newcastle also reunited him with former players at AFC Bournemouth, such as Callum Wilson, Matt Ritchie and Ryan Fraser. On 19 November 2021, Newcastle announced that Howe had tested positive for COVID-19 and would miss the first game in charge. He watched his first game as manager from a hotel room as Newcastle drew 3–3 with Brentford on 20 November."]}, {"page": "Mick Harford", "response": ["Following Graeme Jones's departure from the club by mutual consent in April 2020, Harford was once again appointed as temporary interim boss at Luton Town but due to football's suspension and Nathan Jones's reappointment the following month, Harford didn't manage any games."]}]}}