{"wiki_id": "http://www.wikidata.org/entity/Q5593426", "itemLabel": "Grahame Smith", "itemDescription": "British trade unionist", "wikipedia_url": "https://en.wikipedia.org/wiki/Grahame_Smith", "wikipedia_page": {"main": "Grahame Thomas Smith  (born 8 January 1959) is a Scottish former trade unionist, who served as General Secretary of the Scottish Trades Union Congress (STUC).", "link_mentions": [{"page": "Dolores Ibárruri", "response": ["Over time, the B listed statue fell into extremely poor condition and this generated criticism from the public, elected officials and trades unionists. A restoration project was carried out between April and August 2010 and the monument was re-dedicated on 23 August 2010 by Leader of the council, Bailie Gordon Matheson, and General Secretary of the Scottish Trades Union Congress, Grahame Smith, in the presence of Thomas Watters, 97, a surviving International Brigade veteran. Watters was a veteran of the Scottish Ambulance Unit, which worked at the front line on the battlefields of Spain to aid wounded fighters and volunteers from across the world."]}, {"page": "Cleo (magazine)", "response": ["*1993 – Grahame Smith, 36"]}, {"page": "Bishopbriggs Academy", "response": ["*Grahame Smith, trade unionist"]}, {"page": "Arthur Dooley", "response": ["Over time, the B listed statue fell into extremely poor condition and this generated criticism from the public, elected officials and trades unionists. A restoration project was carried out between April and August 2010 and the monument was re-dedicated on 23 August 2010 by Leader of the Council, Bailie Gordon Matheson, and General Secretary of the Scottish Trades Union Congress, Grahame Smith, in the presence of Thomas Watters, 97, a surviving International Brigade veteran. Watters was a veteran of the Scottish Ambulance Unit, which worked at the front line on the battlefields of Spain to aid wounded fighters and volunteers from across the world."]}, {"page": "General Secretary of the Scottish Trades Union Congress", "response": [":2006: Grahame Smith", ":1998: Grahame Smith and Ronnie McDonald"]}, {"page": "Scottish football referee strike", "response": ["Grahame Smith, General Secretary of the Scottish Trades Union Congress supported the strike, describing any referee who officiated as a replacement, as a \"scab\". The SFA chief executive Stewart Regan denied the replacements were scabs, stating \"[the Scottish referees] are not a union. They are an association. They operate for the good of Scottish football, they are not employed by the SFA. They get a match fee. No-one is breaking union rules.\" Regan stated all replacement officials were all experienced referees at the highest level and had been approved by the SFA's Referee Committee, explaining that they were all either \"Fifa listed or Grade One officials in their own countries.\""]}]}}