{"wiki_id": "http://www.wikidata.org/entity/Q5592957", "itemLabel": "Graham Johnson", "itemDescription": "British writer and investigative journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Graham_Johnson_(author)", "wikipedia_page": {"main": "Graham Johnson (born 4 May 1968) is an author and investigative journalist who has written several books and contributed to a variety of publications. His works focus largely on organised crime. Johnson has also made multiple documentary films and appeared on television as a crime pundit.", "link_mentions": [{"page": "Reach plc", "response": ["On 6 November 2014, Graham Johnson, who worked at the Sunday Mirror between 1997 and 2005 and had served as the paper's investigations editor, became the first Mirror Group Newspapers journalist to admit to phone hacking when he pleaded guilty at Westminster Magistrates' Court. The trial began after he had contacted the police voluntarily in 2013. A spokesman for Trinity Mirror said the company would not be making a comment on Johnson's conviction."]}, {"page": "Sunday Mirror", "response": ["A former Sunday Mirror investigations editor, Graham Johnson, pleaded guilty to intercepting voicemail messages in 2001. Johnson is the first Mirror Group Newspapers journalist to admit to phone hacking. He voluntarily contacted police in 2013."]}, {"page": "Graham Johnson", "response": ["Graham Johnson may refer to:", "*Graham Johnson (musician) (born 1950), British pianist and Lieder accompanist", "*Graham Johnson (cricketer, born 1946), cricketer with Kent", "*Graham Johnson (cricketer, born 1958), former English cricketer", "*Graham Johnson (canoeist) (born 1943), Australian sprint canoeist", "*Graham Johnson (author) (born 1968), British author and investigative journalist", "*Graham Johnson (scientist) (born 1973), American medical illustrator"]}, {"page": "Graham johnson (author)", "response": ["#REDIRECT Graham Johnson (author) "]}, {"page": "Ian McAteer", "response": ["Investigative journalist Graham Johnson records McAteer's career as beginning in 1979, when he started to forge links with Glasgow's main drug barons. He attained preferred status as a distributor in Scotland, and developed an even more profitable relationship with the Liverpool Mafia. Aside from drug dealing, McAteer reportedly became involved in arms trafficking, debt collection and protection, and laundered money through his successful used car business.The Cartel (Johnson), Chapter 40: Warren Selkirk According to Johnson and Liverpool Echo crime reporter Tom Duffy, McAteer also worked as a hitman."]}, {"page": "Stuart Griffiths (photographer)", "response": ["In the late 2000s, Griffiths worked on stories about gangs in Liverpool, first with Graham Johnson and later with other journalists."]}]}}