{"wiki_id": "http://www.wikidata.org/entity/Q560286", "itemLabel": "Mark Gatiss", "itemDescription": "British actor, screenwriter and novelist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Gatiss", "wikipedia_page": {"main": "Mark Gatiss ( (listen); born 17 October 1966) is an English actor, comedian, screenwriter, director, producer and novelist. His work includes writing for and acting in the television series Doctor Who, Sherlock, and Dracula. Together with Reece Shearsmith, Steve Pemberton and Jeremy Dyson, he is a member of the comedy team The League of Gentlemen. He played Tycho Nestoris in the HBO series Game of Thrones.", "link_mentions": [{"page": "List of comedians", "response": ["* Mark Gatiss (born 1966)"]}, {"page": "October 17", "response": ["*  1966   – Mark Gatiss, English actor, screenwriter and novelist"]}, {"page": "Sherlock Holmes", "response": ["Benedict Cumberbatch plays a modern version of the detective and Martin Freeman as a modern version of John Watson in the BBC One TV series Sherlock, which premiered in 2010. In the series, created by Mark Gatiss and Steven Moffat, the stories' original Victorian setting is replaced by present-day London, with Watson a veteran of the modern War in Afghanistan. Similarly, Elementary premiered on CBS in 2012, and ran for seven seasons, until 2019. Set in contemporary New York, the series featured Jonny Lee Miller as Sherlock Holmes and Lucy Liu as a female Dr. Joan Watson. With 24 episodes per season, by the end of season two Miller became the actor who had portrayed Sherlock Holmes the most in television and/or film."]}, {"page": "1966", "response": ["* October 17 – Mark Gatiss, English actor, comedian, screenwriter, director, producer and novelist"]}, {"page": "M. R. James", "response": ["A new adaptation of \"The Tractate Middoth\", the directorial debut of Mark Gatiss, was broadcast on BBC Two on 25 December 2013. Gatiss also presented a new documentary, entitled M. R. James: Ghost Writer, which was screened directly afterwards; it featured scenes from the BBC television adaptations, along with Robert Lloyd Parry of the Nunkie Theatre Company performing as M. R. James himself and reading excerpts from his stories.", "On Christmas Eve 2019, the BBC broadcast an adaptation of \"Martin's Close\", written and directed by Mark Gatiss, and starring Peter Capaldi. It became BBC Four's \"most watched programme of 2019\", with 1.5 million viewers."]}, {"page": "The Wicker Man", "response": ["In his 2010 BBC documentary series A History of Horror, writer and actor Mark Gatiss referred to the film as a prime example of a short-lived subgenre he called \"folk horror\", grouping it with 1968's Witchfinder General and 1971's The Blood on Satan's Claw. In 2003, the Crichton Campus of the University of Glasgow in Dumfries, Dumfries and Galloway hosted a three-day conference on The Wicker Man.Dr. Benjamin Franks, Lecturer Conferences: The Wicker Man: Readings Rituals and Reactions, July 2003. http://gla.ac.uk; University of Glasgow. Retrieved 2010-05-30. The conference led to two collections of articles about the film. In 2004, The Wicker Man ranked No, 45 on Bravo's 100 Scariest Movie Moments."]}, {"page": "The Wind in the Willows", "response": ["* The Wind in the Willows, another live-action TV film in 2006 with Lee Ingleby as Mole, Mark Gatiss as Ratty, Matt Lucas as Toad, Bob Hoskins as Badger, and also featuring Imelda Staunton, Anna Maxwell Martin, Mary Walsh and Michael Murphy."]}, {"page": "John Carpenter", "response": ["During 2010, writer and actor Mark Gatiss interviewed Carpenter about his career and films for his BBC documentary series A History of Horror. Carpenter appears in all three episodes of the series. He was also interviewed by Robert Rodriguez for his The Director's Chair series on El Rey Network."]}, {"page": "All About My Mother", "response": ["A stage adaptation of the film by playwright Samuel Adamson received its world première at the Old Vic in London's West End on 4 September 2007. This production marked the first English language adaptation of any of Almodóvar's works and had his support and approval. Music by the film's composer, Alberto Iglesias, was incorporated into the stage production, with additional music by Max and Ben Ringham. It starred Colin Morgan, Diana Rigg, Lesley Manville, Mark Gatiss, Joanne Froggatt, and Charlotte Randle. It opened to generally good reviews, with some critics stating it improved upon the film."]}, {"page": "Adam Adamant Lives!", "response": ["*This Man is the One: 52-minute documentary featuring Gerald Harper, Juliet Harmer, Verity Lambert and Brian Clemens. Presented by Mark Gatiss."]}, {"page": "List of British comedians", "response": ["**Mark Gatiss (born 1966)"]}, {"page": "Robert Cecil, 1st Earl of Salisbury", "response": ["* In the BBC TV drama series Gunpowder (2017), he is played by Mark Gatiss."]}, {"page": "Roger Corman", "response": ["In 2010, writer and actor Mark Gatiss interviewed Corman for his BBC documentary series A History of Horror, of which the second half of the second episode focuses on Corman."]}, {"page": "Supervillain", "response": ["In the documentary A Study in Sherlock, writers Stephen Moffat and Mark Gatiss stated that they regarded Professor James Moriarty as a supervillain because he, too, possesses genius-level intelligence and powers of observation and deduction, setting him above ordinary people to the point where only he can pose a credible threat to Sherlock Holmes."]}, {"page": "The Master (Doctor Who)", "response": ["Beevers, Roberts, Jacobi, Simm, and Gomez reprised the role for the Big Finish audio dramas. At the same time, Alex Macqueen, Gina McKee, Mark Gatiss, James Dreyfus, and Milo Parker portrayed incarnations unique to Big Finish.", "Last of the Gaderene by Mark Gatiss and Deadly Reunion by Terrance Dicks and Barry Letts are both close homages to the Delgado/Pertwee stories. In Last of the Gaderene, the Master, disguised as Police Inspector Lemaitre, assists an alien race called the Gaderene to invade Earth, starting with a small village. In Deadly Reunion, he attempts to control powerful forces through a cult, but finds himself at the mercy of a godlike alien. The Delgado Master also appears in Verdigris by Paul Magrs, a more parodic take on the Pertwee era. The eponymous genie spends much of the novel impersonating the Master, who is in fact controlling him: the real Master appears in the novel's epilogue, buying a Chinese takeaway.", "The Master has made regular appearances in various audio plays produced by Big Finish. Geoffrey Beevers, Derek Jacobi, Michelle Gomez, Eric Roberts and John Simm have all reprised the role from the television series. While Mark Gatiss, Alex Macqueen, Gina McKee and Milo Parker portray versions of the Master original to Big Finish. Jon Culshaw has performed as the Roger Delgado and Anthony Ainley incarnations of the Master.", "An alternate-universe Master appears in the Big Finish audio play Sympathy for the Devil, voiced by Mark Gatiss, as part of the Doctor Who Unbound series. In this version of events, an alternate Third Doctor — now voiced by David Warner — does not arrive for his exile on Earth until 1997. Without the Doctor's help, UNIT was unable to cope with a series of extraterrestrial disasters, and the political landscape of the planet changed drastically. Stranded on Earth, the Master worked as an advisor to the United Nations. This version of the Master later appears in Big Finish's The New Adventures of Bernice Summerfield range, opposite Warner's Doctor, when Bernice Summerfield is temporarily pulled into the Unbound universe. He later escapes to Benny's universe and is recruited by the Daleks to stop a plan by the War Master that threatens to destroy the universe.", "In December 2017, Derek Jacobi reprised his role as the Master for The War Master, an ongoing series of audios set during the Time War, having originally appeared in the 2007 episode \"Utopia\". The first series ends with the Master using a chameleon arch to turn himself into an infant human, setting up the events of \"Utopia\". Subsequent series occur earlier in the War Master's life and depict him getting involved with various battles in the Time War, sometimes at the behest of the Time Lords and sometimes for his own ends. Mark Gatiss made a guest appearance as the alternate-universe Master in series four. Paul McGann briefly plays the Master in series five. Jacobi has also appeared as the War Master in several other Big Finish ranges, including UNIT: Cyber-Reality and the first volume of Gallifrey: Time War."]}, {"page": "The League of Gentlemen", "response": ["The League of Gentlemen is a surreal British comedy horror sitcom that premiered on BBC Two in 1999. The programme is set in Royston Vasey, a fictional town in northern England, originally based on Alston, Cumbria, and follows the lives of bizarre characters, most of whom are played by three of the show's four writers – Mark Gatiss, Steve Pemberton, and Reece Shearsmith – who, along with Jeremy Dyson, formed the League of Gentlemen comedy troupe in 1995. The series originally aired for three series from 1999 until 2002 followed by a film in 2005.", "Three of the four members of the League of Gentlemen (Steve Pemberton, Mark Gatiss and Reece Shearsmith) met at Bretton Hall Theatre School. They met their final member – Jeremy Dyson – later in their comedy career. He does not act as such in the franchise but does have a few small/ cameo roles throughout the series. The stage show began in late 1994, and it was not long before the team took as their name the title of a 1960 Jack Hawkins film, The League of Gentlemen. In 1997, they were awarded the Perrier award for comedy at the Edinburgh Festival Fringe and their radio series On the Town with The League of Gentlemen, debuted on BBC Radio 4. On the Town was set in the fictional town of Spent. They won a Sony Award for this six-episode run. In 1999 the show moved to television and quickly acquired a cult following; three series were produced, the first airing in 1999, the second in 2000 and the third in 2002. A Christmas special was broadcast in December 2000, after the airing of the second series. For television, Spent was renamed Royston Vasey – the given name of comedian Roy Chubby Brown, who appears in the series, notably as the Mayor of Royston Vasey in series 2. Along with The Fast Show, the series is credited with the revival of the sketch show format in BBC comedy. Its influence can be seen on later series, particularly Little Britain (the first series of which was directed by Steve Bendelack and script-edited by Gatiss).", "Speaking to BBC Radio 6 in October 2016, Mark Gatiss spoke about the desire of the creators to revive the programme in some form with Brexit forming a suitable background to revive it.", "The majority of the inhabitants of the village – male and female – are played by Reece Shearsmith, Steve Pemberton, and Mark Gatiss, and the script was written by these three, along with Jeremy Dyson. Dyson, not an actor like the others, appears only in cameo roles. As there are usually only three actors on screen at any one time, the different characters mostly play out their own stories in several serialised sketches, rarely crossing into each other's storylines. Only rarely do actors \"meet themselves\". Exceptions include Papa Lazarou facing the Reverend Bernice in the Christmas Special (both Reece Shearsmith), Les McQueen buying a magazine from Pop's son (both Mark Gatiss), and Alvin Steele buying food from Iris at a supermarket checkout in Series 2 (again, both Mark Gatiss). The idea is taken further in The League of Gentlemen's Apocalypse, when the characters meet the actors (especially when Herr Lipp meets his creator, Steve Pemberton). In the live shows, when Pam Doove was auditioning for a part in the Christmas Nativity Play, directed by Ollie Plimsolls, Pam had to audition in front of Ollie's Legz Akimbo colleague Dave (Pemberton), who said that Ollie couldn't make it \"for obvious reasons\" (Shearsmith plays both Pam and Ollie in the television series).", "Royston Vasey draws on the upbringing of all the League of Gentlemen's members – Mark Gatiss, Steve Pemberton, Reece Shearsmith and Jeremy Dyson – all of whom were raised in the north of England. Royston Vasey is the real name of British stand-up comedian Roy Chubby Brown. Brown played the part of the town's mayor in a cameo appearance. Brown is a controversial stand-up whose profanity-laden material has resulted in his never appearing on the BBC other than this brief appearance.", "In the film The League of Gentlemen's Apocalypse, the town is on the verge of destruction when the League of Gentlemen – Jeremy Dyson, Mark Gatiss, Steve Pemberton, and Reece Shearsmith – agree to stop writing for Royston Vasey. This causes meteorites to rain from the sky until the entire town is razed to the ground. The destruction of Royston Vasey can only be prevented when all four of the writers are killed, but it transpires that the entire ordeal was conceived by Dyson while unconscious in a hospital."]}, {"page": "2002 in film", "response": ["| Birthday Girl || Miramax Films || Jez Butterworth (director/screenplay); Tom Butterworth (screenplay); Nicole Kidman, Ben Chaplin, Vincent Cassel, Mathieu Kassovitz, Kate Evans, Stephen Mangan, Xander Armstrong, Sally Phillips, Ben Miller, Jonathan Aris, Steve Pemberton, Reece Shearsmith, Mark Gatiss || Comedy, Thriller || Live Action"]}, {"page": "Neil Innes", "response": ["Innes died of a heart attack on 29 December 2019 near Toulouse, where he had lived for several years. Fellow entertainers, including John Cleese and Stephen Fry, paid tribute to him. The League of Gentlemen star Mark Gatiss also paid tribute to Innes. Comedian Diane Morgan called him \"one of the nicest people I’ve ever met and a towering talent,\" and director Edgar Wright said he was \"forever a fan\" of Innes."]}, {"page": "Agatha Christie's Poirot", "response": ["Clive Exton adapted seven novels and fourteen short stories for the series, including \"The ABC Murders\" and \"The Murder of Roger Ackroyd\", which received mixed reviews from critics. Anthony Horowitz was another prolific writer for the series, adapting three novels and nine short stories, while Nick Dear adapted six novels. Comedian and novelist Mark Gatiss wrote three episodes and also guest-starred in the series, as have Peter Flannery and Kevin Elyot. Ian Hallard, who co-wrote the screenplay for \"The Big Four\" with Mark Gatiss, appears in the episode and also \"Hallowe'en Party\", which was scripted by Gatiss alone."]}, {"page": "David Warner (actor)", "response": ["Warner contributed \"Sonnet 25\" to the 2002 compilation album, When Love Speaks (EMI Classics), which consists of Shakespearean sonnets and play excerpts as interpreted by famous actors and musicians. He has performed in many audio plays, starring in the Doctor Who Unbound play Sympathy for the Devil (2003) as an alternative version of the Doctor, and in a series of plays based on ITV's Sapphire & Steel as Steel, both for Big Finish Productions. He reprised his incarnation of the Doctor in a sequel, Masters of War (2008). In 2007, he guest starred as Isaac Newton in the Doctor Who audio drama Circular Time and as Cuthbert in four of the seven stories in the second Fourth Doctor series. He also guest starred in the BBC Radio 4 science fiction comedy Nebulous (2005) as Professor Nebulous' arch-enemy Dr. Joseph Klench. In all these productions, Warner has worked with writer and comedian Mark Gatiss of the League of Gentlemen, and plays a guest role in the League's 2005 feature film The League of Gentlemen's Apocalypse. He has also performed in radio plays for the distinguished American companies L.A. Theatre Works and the Hollywood Theater of the Ear. In 2005, Warner read a new adaptation of Oliver Twist for BBC Radio 2 (adapted by Neville Teller and directed by Neil Gardner). In 2008, he guest-starred as Mycroft Holmes in the Bernice Summerfield audio play The Adventure of the Diogenes Damsel. In 2009, he was the voice of Lord Azlok of the Viperox, an insectoid alien race in the animated Doctor Who serial \"Dreamland\". In 2016, he returned as his alternate Doctor in a series of audios where his Doctor briefly travels to the 'prime' universe and enlists the Seventh Doctor's companion Benny Summerfield (Lisa Bowerman) to try and help him save his universe. Warner's Doctor continued his travels with Benny in a second series of audios released in 2017.", "In 2010, writer and actor Mark Gatiss interviewed Warner about his role in The Omen (1976) for his BBC documentary series A History of Horror. In November 2013, David Warner posed for Rory Lewis Photographers 'Northerners' Exhibition, David's image was acquired by the National Portrait Gallery in London, and was the first professional portrait sitting of David since 1966."]}, {"page": "University Challenge", "response": ["* Starter For Ten is the title of a novel, first published in 2003, by British author David Nicholls. The plot is about a first-year student, Brian Jackson, who attempts to join his university team competing in University Challenge. Nicholls also adapted the novel into the film Starter for 10 in 2006, starring James McAvoy as Jackson, with Mark Gatiss portraying Gascoigne."]}, {"page": "Hammer Film Productions", "response": ["Hammer's horror films were often praised by critics for their visual style, although rarely taken seriously. \"Altogether this is a horrific film and sometimes a crude film, but by no means an unimpressive piece of melodramatic storytelling\" wrote one critic of Dracula in The Times in 1958. Critics who specialise in cult films, like Kim Newman, have praised Hammer Horror more fully, enjoying their atmosphere, craftsmanship and occasional camp appeal. In A History of Horror, Mark Gatiss remarked that Hammer's earlier films were taken seriously at the time, in comparison to the trademark camp appeal of their later works."]}, {"page": "1994 in literature", "response": ["*Mark Gatiss – St Anthony's Fire"]}, {"page": "1992 in literature", "response": ["*Mark Gatiss – Nightshade"]}, {"page": "Bill & Ben Video", "response": ["The Zero Imperative (1994) marked a new departure for BBV. Although stuffed to the gills with ex-Doctor Who guest stars, only one of them was actually playing the same character: the story was built around Caroline John's Liz Shaw, the Doctor's companion in the seventh season of Doctor Who, now depicted as an investigator for PROBE (the \"Preternatural Research Bureau\"). The PROBE series ran for an additional three stories; all four were written by Mark Gatiss, who found more widespread fame as a member of the League of Gentlemen, later going on to write episodes for the revived series. The potentially-confusing mixture of Caroline John reprising her Doctor Who role with other recognisable Who stars playing different characters worked against the series, as did the way that Liz Shaw often seemed to be herself a different character from the Doctor Who original. (The latter problem may have been exacerbated by the fact that, although BBV had obtained permission to use Liz Shaw, they had no rights relating to Doctor Who itself - which meant that no explicit reference could be made to any other aspect of Doctor Who, including the events of the stories in which Liz had appeared.)", "**The Zero Imperative by Mark Gatiss", "**The Devil of Winterborne by Mark Gatiss", "**Unnatural Selection by Mark Gatiss", "**Ghosts of Winterborne by Mark Gatiss", "**Republica by Mark Gatiss", "**Island of Lost Souls by Mark Gatiss"]}, {"page": "Diana Rigg", "response": ["In 2013, she appeared in an episode of Doctor Who in a Victorian-era based story called \"The Crimson Horror\" alongside her daughter Rachael Stirling, Matt Smith and Jenna-Louise Coleman. The episode had been specially written for her and her daughter by Mark Gatiss and aired as part of series 7.Doctor Who, \"Dame Diana Rigg and Rachael Stirling to Star in New Series! \". Retrieved 3 July 2012. It was not the first time mother and daughter had appeared in the same production – that was in the 2000 NBC film In the Beginning – but the first time she had worked with her daughter and the first time in her career her roots were accessed to find a Doncaster, Yorkshire, accent."]}, {"page": "Fanny Cradock", "response": ["Cradock's life has also been the subject of the plays Doughnuts Like Fanny's by Julia Darling and Fear of Fanny by Brian Fillis. After a successful run by the Leeds Library Theatre Company, touring the United Kingdom in October and November 2003, Fear of Fanny was turned into a television drama starring Mark Gatiss and Julia Davis and featuring Hayley Atwell. The production broadcast in October 2006 on BBC Four as one of a series of culinary-themed dramas."]}, {"page": "Peter Mandelson", "response": ["* Mandelson was portrayed by Mark Gatiss in the 2015 Channel 4 drama Coalition."]}, {"page": "Aubrey Beardsley", "response": ["In March 2020, BBC Four broadcast the hour-long documentary, Scandal & Beauty: Mark Gatiss on Aubrey Beardsley, presented by Mark Gatiss. The programme coincided with the Beardsley exhibition at Tate Britain.Scandal & Beauty: Mark Gatiss on Aubrey Beardsely - BBC Four website"]}, {"page": "Ray Harryhausen", "response": ["In February 2016, John Walsh and Collections Manager Connor Heaney began a podcast about all things Harryhausen, from the films to the various composers involved on the productions. Occasionally the podcast features interviews with fans, as well as insights into Harryhausen's models from Foundation model conservator Alan Friswell. The podcast has featured Mark Gatiss, John Cairney, Caroline Munro, and Vanessa Harryhausen."]}, {"page": "Stephen Gardiner", "response": ["Gardiner is a prominent character in Hilary Mantel's Wolf Hall, Bring Up the Bodies and The Mirror and the Light, where he appears as an implacable opponent of Thomas Cromwell.  In the Wolf Hall television series, Gardiner is portrayed by Mark Gatiss."]}, {"page": "Michael Fenton Stevens", "response": ["In 2020, with help from his son John Fenton Stevens, a series of podcasts have been released called My Time Capsule with guests such as Stephen Fry, Rebecca Front, Rick Wakeman, Mark Gatiss, Rufus Hound, David Mitchell, Anthony Head, Chris Addison, Rev Richard Coles, Griff Rhys Jones, Richard Herring and David Baddiel."]}, {"page": "Bernard Quatermass", "response": ["The 1994 Doctor Who novel Nightshade is about an actor who starred in a thinly disguised version of Quatermass, discovering that the events of the serials are becoming reality. The fictional Professor Nightshade was also mentioned in subsequent novels. Author Mark Gatiss described the Nightshade serial in his notes accompanying the e-book release as \"a TV series that isn't quite Quatermass and isn't quite Doctor Who\", adding \"I was utterly obsessed by Quatermass at that time\"."]}, {"page": "Steven Moffat", "response": ["During their journeys from London to Cardiff for Doctor Who, Moffat and writer Mark Gatiss conceived a contemporary update of author Sir Arthur Conan Doyle's Sherlock Holmes stories called Sherlock. Vertue advised them to work on the project rather than spend years discussing it. A 60-minute pilot, written by Moffat, was filmed in January 2009. The pilot was not aired but a three-episode series of 90-minute television films produced by Hartswood was commissioned.", "On 13 February 2020, Chichester Festival Theatre announced that the play The Unfriend, written by Moffat, will have its world premiere as part of the 2020 Festival Theatre season in the Minerva Theatre. However due to the COVID-19 pandemic the play has been postponed until 2022. It will be directed by Mark Gatiss and feature Amanda Abbington, Frances Barber and Reece Shearsmith.", "*\"The Sign of Three\" (co-written with Stephen Thompson and Mark Gatiss, 2014)", "*\"The Abominable Bride\" (co-written with Mark Gatiss, 2016)", "*\"The Final Problem\" (co-written with Mark Gatiss, 2017)", "*Miniseries (co-written with Mark Gatiss, 2020)"]}, {"page": "Tobe Hooper", "response": ["In 2010, writer and actor Mark Gatiss interviewed Hooper for the third episode of his BBC documentary series A History of Horror."]}, {"page": "Hallowe'en Party", "response": ["The novel was adapted as part of the twelfth series of Agatha Christie's Poirot with David Suchet, with Zoë Wanamaker reprising her role as Ariadne Oliver. Guest stars include Deborah Findlay as Rowena Drake, Julian Rhind-Tutt as Michael Garfield, Amelia Bullmore as Judith Butler, and Fenella Woolgar as Elizabeth Whittaker. Charles Palmer (who also directed The Clocks for the series) directs this instalment, with the screenplay written by Mark Gatiss (who wrote the screenplay for Cat Among the Pigeons; he also appeared as a guest star in the adaptation of Appointment with Death)."]}, {"page": "Ariadne Oliver", "response": ["An advert for Ariadne Oliver's With Vinegar and Brown Paper (as with Agatha Christie using nursery rhyme references) appears in the Frontispiece of Mark Gatiss's book The Devil in Amber along with other adverts for made-up books.Interview: Mark Gatiss | Books | The Observer"]}, {"page": "Mycroft Holmes", "response": ["* In the 2010 BBC television series Sherlock, Mycroft is portrayed by series co-creator Mark Gatiss. In this contemporary version, Sherlock and Mycroft exhibit smouldering animosity towards each other (which Dr. Watson characterises as \"sibling rivalry\" and Mycroft himself refers to as a \"childish feud\"). Mycroft is part of the Cabinet Office and is so powerful that he can use mass surveillance to track Sherlock. In keeping with the books, Mycroft describes himself as \"occupying a small position in the British government\", but more accurately, \"he is the British government\". While Sherlock reveals that Mycroft essentially bullied him as a child and has made him feel stupid throughout his life, going so far as to suggest that they would both be willing to arrange the death of the other, Mycroft gradually reveals a well-hidden deep familial love for his brother, something Sherlock, in time, begins to reciprocate. In the 2015 Christmas Special \"The Abominable Bride\", he is portrayed by Gatiss in heavy makeup as morbidly obese, more in keeping with the original stories."]}, {"page": "Sapphire & Steel", "response": ["The character of Gold (played by Mark Gatiss) appears in the first adventure The Passenger and returns in Perfect Day and Zero. He is portrayed as impatient and inexperienced when dealing with both humans and the various manifestations of Time, even more detached and clinical in many ways than Steel, almost as if he is still in training. The character of Ruby (played by Lisa Bowerman) appears in the second series story Water Like a Stone, reappearing in Cruel Immortality and Second Sight. Her character has an understanding and affinity to Time within the rhythms of music, and also comes across as rather dry and sardonic, especially when interacting with Steel. David Collings reprises his role as Silver in the third and fifth stories of the first series of audio plays and then again in the third story of the third series. During the production of each series, Nigel Fairs has had to step in at late notice to write a replacement script (writing Dead Man Walking from John Ainsworth's outline in series one, replacing Gary Russell's Big Fun with Cruel Immortality in series two and replacing Joseph Lidster's Reborn with Second Sight in series three).", "The audio dramas featured some notable guest stars - including Hugo Myatt, Muriel Pavlow, Daphne Oxenford, Lucy Gaskell, Colin Baker, Sarah Douglas, Sam Kelly, David Horovitch, Mark Gatiss and Louise Jameson."]}, {"page": "Sydney Newman", "response": ["For the fiftieth anniversary of Doctor Who in 2013, BBC television commissioned a dramatisation of the events surrounding the creation of the series, entitled An Adventure in Space and Time and written by Mark Gatiss. Newman was portrayed by Scottish actor Brian Cox."]}, {"page": "List of Doctor Who supporting characters", "response": ["*\"Danny Boy\" and Captain Archibald Hamish Lethbridge-Stewart (Mark Gatiss)Danny Boy appears in the Eleventh Doctor episodes \"Victory of the Daleks\" and \"A Good Man Goes to War\", and Captain Lethbridge-Stewart appears in the Twelfth Doctor finale Twice Upon A Time"]}]}}