{"wiki_id": "http://www.wikidata.org/entity/Q5609565", "itemLabel": "Tony Clarke", "itemDescription": "British politician (born 1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Clarke_(British_politician)", "wikipedia_page": {"main": "Anthony Richard Clarke (born 6 September 1963, Northampton, England), known as Tony Clarke is a British former Member of Parliament, who is currently a teacher at Northampton College. A politician of the left, Clarke was until  was until recently the Green Party National Spokesperson on International and Foreign Affairs; previously a British Labour Party politician, he was Member of Parliament for Northampton South from 1997–2005. Clarke was also a director of Northampton Town F.C. for 11 years from 1999-2010, and served as General Manager at the club between 2005 and 2008. He served three terms (12 years) on Northampton Borough Council (2 Labour, 1 Independent) and one term (4 years) on Northamptonshire County Council (Independent). He also served as a Special Constable with Northamptonshire Police between 2003 and 2007.\nOn 11 March 2013, Clarke announced that he had joined the Green Party, and would campaign as an Independent Green and stand as a Green Party candidate in the 2013 local elections. He is quoted as saying: \"I left the Labour Party, and then discovered that really it had left me, I have battled on as an Independent to try to make a difference for local people and have had some successes, but now it is time to truly give the power back to the people. I have chosen to campaign and as an Independent Green and proudly display the Green Party Logo on the ballot paper\". Clarke is still a local community activist in Northampton and is currently employed teaching public Services at Northampton College.", "link_mentions": [{"page": "Anthony Richard Clarke", "response": ["#REDIRECT Tony Clarke (British politician)"]}, {"page": "List of United Kingdom MPs: C", "response": ["* Tony Clarke (1997–2005)"]}, {"page": "Barry Horne", "response": ["The Labour government publicly refused to give in to what it called blackmail, and said it would not negotiate with Horne or his supporters, but privately, it held talks with them. Horne's MP, Tony Clarke, visited Horne in prison on 12 November to negotiate another meeting between Horne's supporters and the Home Office, which took place on 19 November 44 days into the strike. After the meeting, Horne released a statement saying there was nothing new on offer, and that his hunger strike would continue. He then reduced his demands to asking for a Royal Commission on animal testing, which the Labour Party had indicated that it would hold if elected."]}, {"page": "Brian Binley", "response": ["Binley was the Parliamentary Agent for the Wyre Forest Conservative Association during the 1997 general election campaign. He was elected to Northamptonshire County Council in 1997, where he was a Cabinet Member. He was selected to contest the Labour-held Parliamentary marginal seat of Northampton South, and defeated the sitting Labour MP Tony Clarke at the 2005 general election by over 4,000 votes. Binley made his maiden speech on 25 May 2005."]}, {"page": "Anthony Clarke", "response": ["Anthony or Tony Clarke may refer to:", "*Tony Clarke (British politician) (born 1963), English Labour Party politician, MP for Northampton South from 1997 to 2005", "*Tony Clarke (activist) (born 1944), Canadian political activist", "*Tony Clarke (singer) (1940–1971), American soul singer", "*Tony Clarke (record producer) (1941–2010), English music producer", "*Tony Clarke (sport shooter) (born 1959), New Zealand sports shooter", "*Anthony Clarke, Baron Clarke of Hampstead or Tony Clarke (born 1932), British trade unionist and Labour peer"]}, {"page": "Tony Clarke (English politician)", "response": ["#REDIRECT Tony Clarke (British politician)"]}, {"page": "Tony Clarke (UK politician)", "response": ["#REDIRECT Tony Clarke (British politician)"]}, {"page": "Adam Simmonds", "response": ["In December 2013, Simmonds challenged critics to meet him for a debate, but just prior to the planned event, backed out by issuing an online video, stating that 'he had more important things to do'. Whilst this met with much criticism from local political party representatives such as Tony Clarke from the Green Party, Simmonds stated that he wanted to talk to all the people of Northamptonshire, not just a handful of people who have chosen to remain anonymous and appear to be involved with a group of people who use gross obscenities as part of their campaign against him."]}, {"page": "Candidates in the 2015 United Kingdom general election", "response": ["Unusually, three former MPs competed against each other in a single seat, Northampton North.Three former MPs among candidates competing in Northampton North, BBC News (11 April 2015). There, Conservative Michael Ellis, who was elected to the seat in 2010; Labour candidate Sally Keeble, who was a Labour MP for the seat from 1997 to 2010; and Green candidate Tony Clarke, who was a Labour MP for neighbouring Northampton South from 1997 to 2005 before leaving the party, are all competing against each other. It is not unusual for two former MPs to compete in an election (often a rematch), but it is rare for three former MPs to contest a single seat."]}, {"page": "List of MPs who lost their seat in the 1997 United Kingdom general election", "response": ["|Tony Clarke"]}]}}