{"wiki_id": "http://www.wikidata.org/entity/Q5606288", "itemLabel": "Greg Stainer", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Greg_Stainer", "wikipedia_page": {"main": "Greg Stainer is a British house and electronic dance music DJ and producer. He is the co-creator and member of the electronic music duo Hollaphonic.", "link_mentions": [{"page": "List of house music artists", "response": ["*Greg Stainer"]}, {"page": "Karl Wolf", "response": ["Karl Wolf has collaborated with a number of artists, mainly from Canada. Choclair was featured in one of his earliest hits titled \"Desensitize\" and Canadian rapper Culture is featured in his biggest hit \"Africa\", whereas Rime and Kaz Money are featured in \"Yalla Habibi\". Sway was featured in \"Hurting\" and Kardinal Offishall was featured in \"Ghetto Love\". His single \"Fuck Shit Up / Mash It Up\" produced by Greg Stainer & Dany Neville featured Three 6 Mafia, Timbaland and B K Brasco in \"Magic Hotel\" and Fatman Scoop in \"Let's Get Rowdy\"."]}, {"page": "List of UK garage artists", "response": ["* Greg Stainer"]}, {"page": "Stealth Records", "response": ["*Greg Stainer"]}, {"page": "Finally Free", "response": ["Prior to the release of the album, two singles appearing on the album had already been released as singles in 2011, \"Ghetto Love\" featuring Kardinal Offishall and \"Mash It Up\" (produced by Greg Stainer and Dany Neville) featuring Three 6 Mafia, also released as \"Fuck Shit Up\"iTunes: Karl Wolf single Fuck Shit Up (feat. Three 6 Mafia) In addition to the title track \"Finally Free\", the track \"DJ Gonna Save Us\" written by Devion Young, Sean Alexander, and Karl Wolf featuring Mr. OxXx was the third single from the album."]}, {"page": "Stained Music", "response": ["#REDIRECT Greg Stainer"]}, {"page": "Mash It Up", "response": ["\"Mash It Up\", or alternative title \"Fuck Shit Up\" (sometimes stylized \"F*@k S#*t Up\") is a song by Canadian artist Karl Wolf from his 2012 album Finally Free. It was produced by Greg Stainer and UnderGround Procedures (UGP), and released in 2011 as the second single from the album Finally Free and a follow-up of the initial single \"Ghetto Love\". The single was released in two titles, \"Fuck Shit Up\"iTunes: Karl Wolf single \"Fuck Shit Up\" featuring Three 6 Mafia and the \"clean\" radio-friendly version \"Mash It Up\".iTunes: Karl Wolf single \"Fuck Shit Up\" featuring Three 6 Mafia"]}, {"page": "Stainer", "response": ["*Greg Stainer (born 1976), British musician"]}, {"page": "Hollaphonic", "response": ["Hollaphonic are an English electronic music production duo, consisting of Greg Stainer and Olly Wood. They were the first dance music duo to be signed to a major record label in the Middle East."]}, {"page": "London Underground FM", "response": ["The following UK garage DJs and producers started out at London Underground: MJ Cole, Dreem Teem (Timmi Magic and DJ Spoony), Ramsey & Fen, Jason Kaye, Daryl B, Hermit, Emma Feline, David Howard, Greg Stainer, Matt \"Qualifide\" Campbell, Lisa, Nortee B Nice, Jason H, Danny Foster, and Richie Fingers."]}, {"page": "Jolyon Petch", "response": ["|\"We Can Be Free\" (with Greg Stainer)"]}]}}