{"wiki_id": "http://www.wikidata.org/entity/Q5605988", "itemLabel": "Greg McDonald", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Greg_McDonald", "wikipedia_page": {"main": "Greg McDonald is a British singer-songwriter who announced the forthcoming release of his debut solo album in 2008. He was the frontman of The Dawn Parade, a Bury St Edmunds based British indie band. He is the main man in contemporary folk band Glymjack.\nMcDonald's songs have won awards from Rolling Stone and The International Songwriting Competition, and he has been championed by DJs Tom Robinson, Mark Radcliffe, Steve Lamacq and John Peel, for whom he recorded two Peel Sessions.\n\n", "link_mentions": [{"page": "Miss Black America (band)", "response": ["Seymour Glass released a solo album, Import/Export, under the moniker 'Open Mouth' in 2007. He has contributed guitars to the second album by former The Dawn Parade frontman Greg McDonald; bass guitar for country band The Blazing Zoos, alongside journalist Andrew Mueller and members of Jesus Jones; and guitar and piano for singer-songwriter Lewis Mokler .  He currently plays guitar with three-piece indie-rock band Horse Party and in artist/musician Kate Jackson's touring band The Wrong Moves."]}, {"page": "The Dawn Parade", "response": ["The Dawn Parade were a British rock band from Bury St Edmunds formed in 2000. Greg McDonald was the main songwriter, and also provided vocals and guitar.", "In 1998 friends from Thurston Community College, Greg McDonald, Nick Morley, Tom Weller and Ben Jennings formed a band, The Hip Down. The band played a small festival as their debut performance and later recorded a ten track demo at Meadowside Studios in Wisbech. Shortly into 1999 Weller departed to University, leaving the band without a permanent bassist.  In late 1999, singer-songwriter Seymour Glass briefly joined on bass before leaving to front another local band, Miss Black America.", "* Greg McDonald on Myspace"]}]}}