{"wiki_id": "http://www.wikidata.org/entity/Q5601498", "itemLabel": "Greatrex Newman", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Greatrex_Newman", "wikipedia_page": {"main": "Greatrex Newman (3 July 1892 – 27 January 1984) was an English author, song-writer and screenwriter.\nHe was born in Manchester, England and died in Eastbourne.", "link_mentions": [{"page": "Newman", "response": ["*Greatrex Newman (1892–1984), British  author, songwriter and screenwriter"]}, {"page": "Mr. Cinders", "response": ["Mr Cinders is a 1928 musical with music by Vivian Ellis and Richard Myers and a libretto by Clifford Grey and Greatrex Newman. The story is an inversion of the Cinderella fairy tale with the gender roles reversed. The Prince Charming character has become a modern (1928) young and forceful woman, and Mr Cinders is a menial.  ", "The show was revived in 1982 in London in a revised version, under the supervision of Ellis and Newman. It opened on 31 December at the King's Head Theatre and was transferred to the Fortune Theatre on 27 April 1983. Denis Lawson starred as Jim Lancaster, with Julia Josephs (later succeeded by Christina Matthews) as Jill, Diana Martin as Minerva, Graham Hoadly as Lumley, and Philip Bird (succeeded by Steven Pacey) as Guy.Gänzl and Lamb, p. 128 The hit song from the score, \"Spread a Little Happiness\", was given to Jim, rather than to Jill who sang it in the original version. Gänzl and Lamb, pp. 131–132\"Adelphi Theatre\", The Times, 12 February 1929, pg. 12Gordon and Jubin, p. 179 The song \"She's My Lovely\" from Ellis's show Hide and Seek was interpolated, and \"Please, Mr Cinders\", was written by Greatrex Newman and Vivian Ellis (in collaboration over the telephone) especially for the revival's transfer to the West End.Gänzl and Lamb, p. 132"]}, {"page": "The Co-Optimists", "response": ["Melville Gideon, Clifford Grey, Irving Berlin, Philip Braham, Vivian Ellis, William Helmore, Ivy St Helier, Laddie Cliff, Austin Melford, Greatrex Newman, Arthur Schwartz, Clifford Seyler."]}, {"page": "Shaw Festival production history", "response": ["*Mr. Cinders – music by Vivian Ellis and Richard Myers, libretto and lyrics by Clifford Grey and Greatrex Newman"]}, {"page": "Don McLean (album)", "response": ["#\"On the Amazon\" (Vivian Ellis, Clifford Grey, Greatrex Newman) - 3:17 "]}, {"page": "Greatrex", "response": ["*Greatrex Newman (1892–1984), English author, songwriter and screenwriter"]}, {"page": "Songs and monologues of Stanley Holloway", "response": ["|By Greatrex Newman", "|By Greatrex Newman and Wolseley Charles", "|By Greatrex Newman and Wolseley Charles.  With Arthur Lief (conductor and pianist) and the Concert Party Four. Recorded in New York, November 1957.", "|By Greatrex Newman and Wolseley Charles.  With Arthur Lief (conductor and pianist) and the Concert Party Four. Recorded in New York, November 1957.", "|By Greatrex Newman. Previously recorded by Holloway in 1938"]}, {"page": "Mr. Whittington", "response": ["Mr. Whittington is a British musical with a book by Clifford Grey, Greatrex Newman and Douglas Furber and music by Johnny Green, Jack Waller and Joseph Tunbridge with additional lyrics provided by Edward Heyman. It was based on the traditional story of Dick Whittington, designed as a vehicle for the entertainer Jack Buchanan.Wearing p.338 "]}]}}