{"wiki_id": "http://www.wikidata.org/entity/Q5609543", "itemLabel": "Grinstead", "itemDescription": "English cricketer", "wikipedia_url": "https://en.wikipedia.org/wiki/Grinstead_(Kent_cricketer)", "wikipedia_page": {"main": "This is a list of English cricketers who played first-class cricket between the 1787 and 1825 seasons. The sport of cricket in this period had already acquired most of its modern features such as eleven-a-side, the three-stump wicket and the lbw law, although pitch preparation was rudimentary and play was largely dictated by the weather. The main difference was in bowling which was still mostly underarm, the key development of the period being the movement towards roundarm bowling which began in the late eighteenth century and was gathering pace by 1825.\nThe principal club throughout the period was Marylebone Cricket Club (MCC) which was founded in 1787. MCC organised the early Gentlemen v Players matches and most of the games played by occasional XIs such as those led by Colonel Lennox, Lord Frederick Beauclerk, George Osbaldeston and others. Inter-county cricket was rare during the Napoleonic Wars and there were no formally constituted county clubs at the time, but the main centres at county level were Berkshire, Essex, Hampshire, Kent, Middlesex, Surrey and Sussex. Towards the end of the period, Cambridge University became prominent, especially through its series of matches against the Cambridge Town Club. In the north of England, cricket was developing through town clubs which became the focal points of the game in their respective counties, especially Nottingham Cricket Club and Sheffield Cricket Club.\nThe players included are those known to have played in matches which were given retrospective first-class status between 1787 and 1825 inclusive.", "link_mentions": [{"page": "Grinstead", "response": ["Grinstead is an English surname, and a place name. It may refer to:", "*Baron Grinstead, a title in the peerage of Ireland (see Earl of Enniskillen)", "*Burt Grinstead (born 1988), U.S. actor", "*Charles Walder Grinstead (1860–1930), English tennis player", "*Elizabeth Key Grinstead (1630–c. after 1665), African-American slave", "*Eric Grinstead (1921–2008), New Zealander sinologist and linguist", "*Grinstead (Kent cricketer) (c. 1788), British cricketer", "*James F. Grinstead (1845–1921), U.S. politician", "*Jesse Edward Grinstead (1866–1948), U.S. publisher, editor, poet, and politician", "*Minnie J. Grinstead (1869–1925), U.S. teacher, politician, and temperance activist", "*Orish Grinstead (1980–2008), U.S. musical artist (see 702)", "*Ronald Grinstead (born 1942), retired British international wrestler", "*Tara Grinstead (born 1974), U.S. high school history teacher (see Tara Grinstead murder case)", "Jared Grinstead (born 1976), U.S. middle school science teacher and Purdue University Graduate (2000)", "*East Grinstead, English town and civil parish in the northeastern corner of Mid Sussex, West Sussex", "*West Grinstead, English village and civil parish in the Horsham District of West Sussex", "Grinstead company is a large gold mining company in Victoria  Australia"]}]}}