{"wiki_id": "http://www.wikidata.org/entity/Q5607511", "itemLabel": "Grenville Cole", "itemDescription": "British geologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Grenville_Cole", "wikipedia_page": {"main": "Grenville Arthur James Cole FRS, FGS, MRIA (21 October 1859 – 20 April 1924) was an English geologist. He was from 1890 the Professor of Geology and Mineralogy in the Royal College of Science for Ireland, and from 1905 he became the fifth Director of the Geological Survey of Ireland.Cole was born in London, and was the son of John Jenkins Cole (1815–1897) an architect, and Anna Maria Josephine Smith (c.1832-1903).\nHe was elected a Fellow of the Royal Society in 1917. He served as President of the Geographical Association 1919-1920, and in 1921 became the President of the Irish Geographical Association.\nCole supported women in their geological studies, including by teaching at Bedford College, London between 1886 and 1890. Mabel Crawford MacDowall was one of Cole's students at the Royal College of Science for Ireland. She married William Bourke Wright, a geologist. She then deployed her talents in the Geological Survey by studying fossils from the Leinster coalfield, and publishing a paper in 1920, under the Directorship of Cole (Herries Davis, 1995). Blanche Vernon was also one of Cole's students. Eventually Cole and Vernon were married, and she produced fine drawings of his thin section petrography, to illustrate his published papers (Wyse Jackson, 1989).", "link_mentions": [{"page": "Grenville", "response": ["*Grenville Cole (1859–1924), British geologist"]}, {"page": "Cole (surname)", "response": ["*Grenville Cole (1859–1924), English geologist"]}, {"page": "Grenville Arthur James Cole", "response": ["#REDIRECT Grenville Cole"]}, {"page": "Clare Island Survey", "response": ["The committee members were Robert Lloyd Praeger, Robert Francis Scharff, Richard Manliffe Barrington, Grenville Cole, Nathaniel Colgan and Henry William Lett.", "Nonpublishing participants John Adams (naturalist) (Marine algae); Edward Alexander Newell Arber (Geology); James Bayley Butler (Protozoa); Frederik Børgesen (Marine algae); George W. Chaster (Mollusca); Grenville Cole (Geology), George Fogerty (Archaeology); Thomas Greer (Lepidoptera); David Thomas Gwynne-Vaughan (botany); Arthur William Hill (Botany); John De Witt Hinch (Glacial geology); Stanley Wells Kemp (marine dredging); Matilda Cullen Knowles (lichens, flowering plants, peat deposits); David McArdle (Mosses and hepatics); James Napier Milne (insects); Charles Joseph Patten (birds); Eugène Penard (rhizopods); Walter Mead Rankin (Crustacea and Decapoda); Colin M. Selbie (marine dredging and Crustacea); Otto Stapf (botany); Isaac Swain (geology)"]}, {"page": "James Edwin Duerden", "response": ["From this position in Dublin, Duerden took up a role of curator in the Museum in the Institute of Jamaica, Kingston in 1895. Whilst in Jamaica, Duerden studied the local caves, marine resources, anthropological findings, and madreporarian corals, publishing a monograph on the latter in 1901. At this point, Duerden was best known for his work on corals. Duerden remained in contact with colleagues in Dublin, sending geological material to Grenville Cole."]}, {"page": "List of people associated with Royal Holloway, University of London", "response": ["* Grenville Cole, Fellow of the Royal Society"]}, {"page": "Grenville A. J. Cole", "response": ["#REDIRECT Grenville Cole"]}, {"page": "Helen Laird", "response": ["During the time that Laird was as an actress she was also a science teacher in the girl's school, Alexandra College, Dublin. She wrote articles on botany for various publications. Laird was friends with Robert Lloyd Praeger Augustine Henry, and Grenville Cole. As a member of both the Gaelic League and Inginidhe na hÉireann, and friends with Maud Gonne and Hanna Sheehy Skeffington, Laird was active in politics and was a member of the Irish Women's Franchise League. She and Gonne formed the Ladies’ School Dinners Committee, which ensured 450 children from Dublin's poorest schools were fed in 1911. In 1912 Laird was sent to London by the IWFL to enfranchise 100,000 women through Philip Snowden's clause in the home rule bill."]}]}}