{"wiki_id": "http://www.wikidata.org/entity/Q5606646", "itemLabel": "Gregor Grant", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Gregor_Grant", "wikipedia_page": {"main": "Gregor J. Grant was born in 1911. He attended the Glasgow School of Art and soon was contributing articles, drawings, and caricatures to newspapers and magazines including The Light Car. He was injured in Normandy during World War II.\nIn August 1950 he founded Autosport magazine which he edited until his death in 1969. Autosport was significant in being a weekly devoted almost entirely to motorsport, at a time when other publications were monthly or only partly reported competition. The timing was perfect as the British motor racing scene was growing rapidly, notably the new Formula 3, based on the British 500 cc Formula.\nHe participated in many rallies and hillclimbs, including the Lyons-Charbonnieres Rally in 1952 (driving with Stirling Moss in a Jaguar XK120), and the 1955 Tulip Rally in a Triumph TR2. He entered the 1956 Mille Miglia one-thousand-mile road race in an MG Magnette. For 1957 he drove a factory-prepared Lotus Eleven. \"One man's Mille Miglia\" is an account of his experiences in the 1957 race.\nThe Autosport Magazine Gregor Grant Award for lifetime achievement in motor sport is awarded annually at the Autosport Awards.", "link_mentions": [{"page": "Alain Prost", "response": ["*Winner of the Autosport Gregor Grant Award for Lifetime Achievement: 1994 "]}, {"page": "Autosport", "response": ["|align=left| Gregor Grant"]}, {"page": "Fernando Alonso", "response": ["Alonso received the 2003 Autosport Gregor Grant Award for winning the 2003 Hungarian Grand Prix. He also won the Princess Cristina National Sports Award for sporting newcomer in that year. Alonso was named the recipient of the Lorenzo Bandini Trophy in April 2005. From October 2005 to May 2006 he received the Prince of Asturias Award for Sports, the Premios Nacionales del Deporte Sportsman of the Year Award and the Gold Medal of the Royal Order of Sports Merit for winning the 2005 Formula One World Championship."]}, {"page": "Alex Zanardi", "response": ["Autosport Gregor Grant Award 1998 & 2003."]}, {"page": "Murray Walker", "response": ["He was appointed an OBE in the 1996 Birthday Honours for services to broadcasting and motor sports. In November 1997, Walker was awarded an honorary Doctor of Letters degree from Bournemouth University. He was later honoured, in July 2005, with an honorary doctorate from the Middlesex University, London. He was the subject of This Is Your Life in 1997 when he was surprised by Michael Aspel during a promotional video launch at the Sports Cafe in London's Lower Regent Street. Walker was named the winner of the Gregor Grant Award from the motor racing magazine Autosport in 1993. In 2000, he won the Royal Television Society Lifetime Achievement Award, and was named the recipient of the BAFTA Special Award for Contribution to Television in 2002."]}, {"page": "Dan Wheldon", "response": ["Two days after his death, Dallara named their new one-specification chassis in Wheldon's honour. The DW12, with the new bumper/nerf bar section being featured, was designed to prevent many similar single-seater crashes such as the one that killed him. A charity race in Wheldon's honour was held in Milton Keynes on 6 December with drivers such as Franchitti, Jenson Button and Anthony Davidson competing. Proceeds from the event were donated to a charity selected by Wheldon's family. That month, Wheldon was posthumously awarded the Gregor Grant Award for his lifetime career achievements that his father Clive and Franchitti collected. Former racing driver Mark Dismore's New Castle Motorsports Park, which organises the Robo-Pong 200 endurance karting event that Wheldon won in 2005, named the trophy the Dan Wheldon Cup in 2012. The Wheldon family added a Wheldon Memorial Pro-Am to the event in 2013. On 7 March 2012, Wheldon's widow Susie and mayor Bill Foster unveiled a street sign in St. Petersburg, Florida. Named \"Dan Wheldon Way\", the sign was placed at the corner of Bayshore Drive and Albert Whitted Park (turn ten). A permanent memorial is also located across from the Salvador Dalí Museum."]}, {"page": "Alfonso de Portago", "response": ["The Marquess of Portago was seen by many as a true playboy of his time;El Mundo: El hijo de Soledad Cabeza de Vaca, marquesa de Moratalla, denuncia su \"secuestro\" - 26 August 2017 \"a tall, handsome and wealthy Spanish aristocrat who captured everybody's imagination\".Movistar+ - Informe Robinson: Marqués de Portago (Ed McDonough on Portago) Gregor Grant famously said of him: \"a man like Portago appears only once in a generation, and it would probably be more accurate to say only once in a lifetime. The fellow does everything fabulously well. Never mind the driving, the steeplechasing, the bobsledding, the athletic side of things, never mind being fluent in 4 languages. (...) He could be the best bridge player in the world if he cared to try, he could certainly be a great soldier, and I suspect he could be a fine writer\"."]}, {"page": "Peter Walker (racing driver)", "response": ["A month later his victory at Circuit de la Sarthe, he finished seventh in the RAC British Grand Prix in a supercharged 1.5-litre V16 BRM Type 15, with his teammate Reg Parnell in fifth. Both drivers legs were so badly burnt by heat from the engines and exhaust systems that even walking was painful. Gregor Grant reported: \"Parnell and Walker saved the day for British motor racing. Their heroism in sticking to their task whilst suffering from agonising burns will enable the BRM designers to go ahead and modify the cars to make them completely raceworthy.\" Sadly, Walker did not race the BRM again."]}, {"page": "Gregor", "response": ["* Gregor Grant (born 1911), British writer"]}, {"page": "Grant (surname)", "response": ["*Gregor Grant (1911–1969), Scottish artist"]}, {"page": "Gregor grant", "response": ["#REDIRECT Gregor Grant "]}, {"page": "1956 Mille Miglia", "response": ["|  Gregor Grant"]}, {"page": "1953 RAC Tourist Trophy", "response": ["| Gregor Grant"]}, {"page": "1957 Mille Miglia", "response": ["|  Gregor Grant"]}, {"page": "Greg Grant", "response": ["*Gregor Grant (1911–1969), Scottish artist"]}]}}