{"wiki_id": "http://www.wikidata.org/entity/Q5610965", "itemLabel": "Howard Collins", "itemDescription": "Welsh martial artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Howard_Collins", "wikipedia_page": {"main": "Howard Collins (born 1949) is a Welsh master of Kyokushin karate based in Sweden. He holds the rank of 8th dan (2015) and the title of Shihan. Collins learned directly from Masutatsu Oyama, founder of Kyokushin karate, and was a prominent competitor in world karate tournaments through the 1970s. He has been teaching his martial art since the 1960s, and has written several books on karate.", "link_mentions": [{"page": "Kyokushin", "response": ["Oyama also sent instructors to other countries such as the Netherlands (Kenji Kurosaki), Australia (Mamoru Kaneko and Shigeo Kato), the United States (Miyuki Miura, Tadashi Nakamura, Shigeru Oyama and Yasuhiko Oyama), Great Britain (Steve Arneil), Canada (Tatsuji Nakamura) and Brazil (Seiji Isobe) to spread Kyokushin in the same way. Many students, including Steve Arneil, Jon Bluming, and Howard Collins, traveled to Japan to train with Oyama directly. Kyokushin also sought to develop a close connection with VIPs and celebrities, focusing on a mass media strategy to increase fans and gain students.", "* Howard Collins"]}, {"page": "Mountain Ash, Rhondda Cynon Taf", "response": ["*Howard Collins (born 1949), prominent karate instructor"]}, {"page": "List of karateka", "response": ["*Howard Collins (born 1949), Kyokushin"]}, {"page": "Miyuki Miura", "response": ["After graduating from the university,Anonymous (1974): \"All-Japan Champion to teach in Chicago.\" Black Belt, 12(4):12–13. Miura became an uchi deshi (live-in student) at the honbu dojo for two years.Skrabacz, R. (c. 2003): Karate master still kicking after 30 years of teaching Retrieved on March 22, 2010. When Miura was an uchi deshi (live-in student), he studied karate from Terutomo Yamazaki, for whom Miura has expressed much respect. Miura entered the Third All-Japan Full Contact Karate Championships (AJFCKC) tournament and placed 4th in 1971. He won 1st at the Fourth AJFCKC in 1972, defeating Howard Collins, Toshikazu Satō, and Jōkō Ninomiya along the way.Ninomiya, J., & Zorensky, E. (1991): My journey in Karate: The Sabaki Way (p. 37). Berkeley, CA: Frog Books. ()"]}, {"page": "Mas Oyama", "response": ["* Howard Collins, in 1971 began training at the Kyokushin honbu dojo (headquarters training hall) under Oyama.Shihan Howard Collins: Kyokushin Karate "]}, {"page": "100-man kumite", "response": ["# Howard Collins (United Kingdom, December 1, 1972)"]}, {"page": "Shihan Collins", "response": ["#REDIRECT Howard Collins"]}, {"page": "Terutomo Yamazaki", "response": ["Yamazaki was not only a strong fighter but also became a respected teacher. Some fighters who have benefited by studying under Yamazaki are Katsuaki Satō, Miyuki Miura, Seiji Isobe (teacher of Glaube Feitosa, Francisco Filho and Andrews Nakahara), Howard Collins, Toshikazu Satō (champion of the Eighth All-Japan Full Contact Karate Open Championships),Gekkann Power Karate, page48, Power Karate Shuppannsha, March, 1989. Takashi Azuma (champion of the Ninth All-Japan Open Championships),Gekkann Fullcontact karate separate volume - Masutatsu Ōyama & The Strong men of Kyokushin Kaikan, page52, fukushodo, 1995. Makoto Nakamura (Two times champions of the Second and Third World Full Contact Karate Open Championships)What is Kyokushin?, page149, Wani Magazine Inc., 1996. and Shokei Matsui.Futoshi Kitanoguchi:Ichigekinoken-Shokei Matsui, page75-80, page214, Koudansha, 2005. They are unanimous in their respect for Yamazaki."]}, {"page": "W.A.K.O. European Championships 1978", "response": ["|Howard Collins Ernest Lee Patton   "]}, {"page": "Willie Williams (karateka)", "response": ["In 1975,  Willie Williams participated in Mas Oyama's 1st World Full-Contact Karate Open Championships tournament as part of the U.S. team coached by Tadashi Nakamura and Shigeru Oyama. He lost to Howard Collins of the United Kingdom in the third round by decision. Four years later, in 1979, he took part in the 2nd World Open Championships. That year, around 160 fighters from all over the world entered this open weight class tournament. Williams was able to battle his way through to the semifinals, where he was defeated by Keiji Sanpei. He made his third appearance at the 3rd World Open Championships in 1984, making it to the final 32."]}]}}