{"wiki_id": "http://www.wikidata.org/entity/Q56191559", "itemLabel": "Alan Almand", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Almand", "wikipedia_page": {"main": "Alan Almand (born 19 March 1943), also known as Willy Almand, is a retired British rower. He competed at the 1972 Summer Olympics.", "link_mentions": [{"page": "Great Britain at the 1972 Summer Olympics", "response": ["*Alan Almand, Christopher Pierce, Rooney Massara, Hugh Matheson, Patrick Sweeney"]}, {"page": "Patrick Sweeney (rowing)", "response": ["Sweeney won the coxed fours with Christopher Pierce, Hugh Matheson, Dick Findlay and Alan Almand, rowing for a Tideway Scullers and Leander composite, at the inaugural 1972 National Rowing Championships. The winning crew were then selected to represent Great Britain at the 1972 Olympics, Rooney Massara replaced Findlay in the men's coxed four event where the crew finished in tenth place after being knocked out in the semi finals."]}, {"page": "Hugh Matheson (rower)", "response": ["Matheson won the coxed fours with Christopher Pierce, Alan Almand, Dick Findlay and Patrick Sweeney, rowing for a Tideway Scullers and Leander composite, at the inaugural 1972 National Rowing Championships. The winning crew were then selected to represent Great Britain at the 1972 Olympics, Rooney Massara replaced Findlay in the men's coxed four event where the crew finished in tenth place after being knocked out in the semi finals.Sports Reference Olympic Sports – Hugh Matheson  In 1974 he was a member of the British eight which won the silver medal at the Lucerne World Championships and was selected by Great Britain as part of the coxed four at the 1975 World Rowing Championships in Nottingham, the four just missed out on a medal finishing in fourth place in the A final."]}, {"page": "Christopher Pierce (rower)", "response": ["Pierce won the coxed fours with Alan Almand, Hugh Matheson, Dick Findlay and Patrick Sweeney, rowing for a Tideway Scullers and Leander composite, at the inaugural 1972 National Rowing Championships. The winning crew were then selected to represent Great Britain at the 1972 Olympics, Rooney Massara replaced Findlay in the men's coxed four event where the crew finished in tenth place after being knocked out in the semi finals."]}, {"page": "1972 British Rowing Championships", "response": ["|Men 4+    || Tideway Scullers School / LeanderChristopher Pierce, Alan Almand, Hugh Matheson, Dick Findlay, Patrick Sweeney (cox)|| Wallingford ||Nottingham & Union"]}]}}