{"wiki_id": "http://www.wikidata.org/entity/Q561474", "itemLabel": "Henry Tingle Wilde", "itemDescription": "Chief Officer of RMS Titanic (1872-1912)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Tingle_Wilde", "wikipedia_page": {"main": "Henry Tingle Wilde, RNR (21 September 1872 – 15 April 1912) was a British naval officer who was the chief officer of the RMS Titanic. He died in the sinking.", "link_mentions": [{"page": "April 15", "response": ["**Henry Tingle Wilde, English chief officer (b. 1872)"]}, {"page": "September 21", "response": ["*1872 – Henry Tingle Wilde, English chief officer on the RMS Titanic (d. 1912)"]}, {"page": "1912", "response": ["**Henry Tingle Wilde, Chief Officer of the Titanic (b. 1872)"]}, {"page": "Wilde", "response": ["* Henry Tingle Wilde (1872–1912), English chief officer on the RMS Titanic"]}, {"page": "Frederick Fleet", "response": ["Fleet boarded the Titanic in Southampton on 10 April 1912. The ship made two stops, first in Cherbourg, France, and then in Queenstown, Ireland. The lookouts, six in total, made two-hour shifts due to extreme cold in the crow's nest. The trip was uneventful until the night of 14 April 1912. At 22:00 (10 p.m.) that night, Fleet and his fellow lookout Reginald Lee replaced George Symons and Archie Jewell at the nest. They were passed the order given earlier by second officer Charles Lightoller to watch out for small ice. The night was calm and moonless, which made it difficult to spot the icebergs due to the lack of waves breaking against the base of the iceberg and reflection. Despite Fleet and his fellow lookouts having repeatedly requested to be provided with binoculars,historicsouthampton.wordpress.com/encyclopedia-titanica.org they were not available for the lookouts. This is sometimes attributed to the last-minute change in the hierarchy of the ship when officer David Blair was removed from the maiden voyage crew (due to the knock-on effect of Henry Tingle Wilde being appointed chief officer) without mentioning where the binoculars had been located. It has been also mentioned that Blair accidentally took the keys of the cabinet containing the binoculars with him. Despite both inquiries into the disaster, nothing clarified why the lookouts were not provided with binoculars, although there are many possible explanations such as one that the White Star Line steamers' lookouts did not particularly use them. Some experts have said that even using binoculars, neither Fleet nor Lee could have spotted the iceberg any sooner given the conditions of the night.10 causes of the Titanic tragedy, NBC news."]}]}}