{"wiki_id": "http://www.wikidata.org/entity/Q5611375", "itemLabel": "Philip Connard", "itemDescription": "British artist and art educator (1875-1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Connard", "wikipedia_page": {"main": "Philip Connard,  (24 March 1875 - 8 December 1958) was a British painter known particularly for his paintings of decorative landscapes. Connard rose from humble origins to become an eminent artist in oils and watercolours whose commissions brought him royal recognition.", "link_mentions": [{"page": "Austin Osman Spare", "response": ["The couple's fourth surviving child, Austin Osman Spare was born shortly after four o'clock on the morning of 30 December 1886. Spare first attended the school attached to St. Sepulchre's Church, at the top of Snow Hill (1891), and each day he would pass by Smithfield meat market, which being an animal lover, he detested.Baker 2011. pp. 6–7. In 1894, when Spare was seven, the family moved from Smithfield to Kennington, South London, setting up home at 15 Kennington Park Gardens. Here, Spare attended St. Agnes School, attached to a prominent High Anglican church, and as a child he was brought up within the Anglican denomination of Christianity.Baker 2011. pp. 9, 13. In later life he claimed to have met an elderly woman, Mrs Patterson (known as \"Witch Patterson\") at this time. Patterson claimed to be a descended from a line of Salem witches that Cotton Mather had failed to extirpate.Richard Cavendish (ed) Encyclopedia of the Unexplained: Magic, occultism and Parapsychology, p. 224 She seduced him and first taught him how to practise magic, although later biographer Phil Baker has noted that there is \"very little evidence\" that she was ever a real figure, instead perhaps being a later fictional invention of his.Baker 2011. pp. 11–12. Spare, who did not get on well with his real mother as a child, referred to Patterson as his 'second mother' or 'witch-mother'. Taking an interest in drawing, from about the age of 12, he began taking evening classes at Lambeth School of Art under the tutorship of Philip Connard.Baker 2011. p. 16."]}, {"page": "Southport", "response": ["* Philip Connard, artist, member of the Royal Academy of Arts"]}, {"page": "Edmund Blampied", "response": ["In January 1903, aged 16 years old and barely able to speak English, Blampied left Jersey to study at the Lambeth School of Art, where he was taught by Philip Connard R.A. and Thomas McKeggie. After taking a test and submitting some drawings, in May 1904 Blampied won a £20 London County Council (LCC) Scholarship for two years to continue his studies at any LCC art school. Later that year he was selected by the head of the Art School to work part-time on the staff of a national newspaper, The Daily Chronicle, which enabled him to earn some extra money. His first published illustrations appeared in The Daily Chronicle on 13 January 1905."]}, {"page": "Lambeth School of Art", "response": ["* Philip Connard "]}, {"page": "City and Guilds of London Art School", "response": ["* Philip Connard"]}, {"page": "British official war artists", "response": ["*Philip Connard, 1875–1958."]}, {"page": "Connard", "response": ["*Philip Connard (1875–1958), British artist"]}, {"page": "List of Royal Academicians", "response": ["| Philip Connard   ||align=\"center\" |  1925  || Keeper 1945–1949"]}, {"page": "War Artists' Advisory Committee", "response": ["* Philip Connard "]}, {"page": "List of officers of the Royal Academy of Arts", "response": ["|Philip Connard, RA ||11 Dec 1945 – 31 Dec 1949"]}, {"page": "Phillip Connard", "response": ["#redirect Philip Connard "]}, {"page": "Darsie Japp", "response": ["Japp was born in Liverpool and attended St John's College of the University of Oxford. After he graduated, he worked in the offices of his father's shipping company in the City of London between 1904 and 1907. While working in the City, Japp studied at the night school of the Lambeth School of Art under Philip Connard. Japp studied at the Slade School of Art between 1908 and 1909, where he became friends with his fellow student Stanley Spencer and would often visit him in his home at Cookham in Berkshire. Japp specialised in landscape and figure paintings, and exhibited with the New English Art Club of which he became a member in 1919."]}, {"page": "1950 Birthday Honours", "response": ["*Philip Connard, R.A."]}, {"page": "Anne Finlay", "response": ["Her personal life included affairs with the painters James McBey and Ernest Proctor and a relationship with Philip Connard.  She lived with Connard in Richmond, England.  After her death in 1963 she bequeathed works by Connard and herself to the Borough."]}, {"page": "Derek Chittock", "response": ["Chittock studied at the Slade School of Art between 1942 and 1947 under Randolph Schwabe and continued his art education under Philip Connard at the Royal Academy schools. Although still a student at the time, Chittock was commissioned by the War Artists' Advisory Committee to paint two portraits of Admiralty subjects near the end of World War Two. Chittock was a member of the Communist Party of Great Britain and in the early 1950s was recruited by the Artists' International Association to serve on the selection committee for their Artists for Peace exhibitions. Chittock also worked as the art critic for the Daily Worker newspaper. He resigned that post, and his membership of the Communist Party, in 1956 following the Soviet invasion of Hungary. Chittock, who sometimes signed his work as James Dudley, completed several covers for the magazine John Bull."]}, {"page": "Maude Burge", "response": ["In New Zealand Burge was a pupil of James Nairn and trained under C.F. Goldie at his studio in Auckland. Burge painted one of Goldie's favourite early models Ina Te Papatahi, of the Ngāpuhi iwi tribe. While painting in Europe, Burge was as a pupil of English watercolourist Fred Mayer and was associated with British artists Frank Brangwyn and Philip Connard. Burge travelled extensively and painted watercolours of still lifes, market scenes and beach scenes in St. Tropez, Morocco and Dalmatia. Burge became a friend and painting companion of fellow New Zealand artist Frances Hodgkins. Hodgkins painted still lifes at Burge's garden in St. Tropez, 1931 and they painted together in Majorca and Ibiza. Hodgkins described Burge in her published letters as a \"nervy changeable charming woman\"."]}, {"page": "Pan Is Dead (Still Life)", "response": ["Pan Is Dead (Still Life) is a 1911  still life painting by Australian artist George Washington Lambert. The painting depicts \"a sculpted head of Pan beside white gloves and a glass vase filled with white roses\". Lambert created the bust of Pan as part of a costume for a character he played in a tableau vivant, The awakening of Pan, created in 1909 by the wife of the artist Philip Connard."]}]}}