{"wiki_id": "http://www.wikidata.org/entity/Q56222618", "itemLabel": "Iain Livingstone", "itemDescription": "Scottish police officer and footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Iain_Livingstone", "wikipedia_page": {"main": "Iain Thomas Livingstone,  (born 6 October 1966) is a Scottish police officer who is currently Chief Constable of Police Scotland. He was previously Deputy Chief Constable Designate of the force. He was named as the next Chief Constable on 15 August 2018 and took up office formally on 27 August 2018.", "link_mentions": [{"page": "Police Scotland", "response": ["* Chief constable: Iain Livingstone", "|Iain Livingstone", "|Iain Livingstone"]}, {"page": "Phil Gormley", "response": ["On 2 December 2015, it was announced that Gormley would be the next Chief Constable of Police Scotland. He was only the second CC of the force after the Scottish police forces merged in 2013. He beat two of the Deputy Chief Constables for Police Scotland to the job; Neil Richardson, the Designated Deputy for Chief Constable, and Iain Livingstone, the Deputy Chief Constable (crime and operational support). He took up the appointment on 5 January 2016, with a salary of £212,280.", "On 26 July 2017, Gormley announced that he was the subject of, and cooperating with, a misconduct investigation by the Police Investigations and Review Commissioner (PIRC), following a referral by the Scottish Police Authority (SPA). On 7 February 2018, he resigned from his Police Scotland post with immediate effect, being replaced on a temporary basis by his deputy Iain Livingstone, who had already been leading the organisation in Gormley's absence for some months."]}, {"page": "2018 in the United Kingdom", "response": ["*15 August – Iain Livingstone is confirmed as the new chief constable of Police Scotland, having been in interim charge of the national force since last autumn."]}, {"page": "2018 in Scotland", "response": ["*15 August – Iain Livingstone is confirmed as the new Chief Constable of Police Scotland, having been in interim charge of the national force since last autumn."]}, {"page": "Police Roll of Honour Trust", "response": ["There are four patrons, they are Dame Cressida Dick, Iain Livingstone, Martin Hewitt, and Matt Jukes."]}, {"page": "List of University of Aberdeen people", "response": ["The University of Aberdeen has produced leading figures in the UK, Scottish, and foreign governments, including the Lord Chancellor George Gordon, former Counsellor of State William Barclay, the former Secretary of State for Scotland, Alistair Carmichael, former Secretary of State for Scotland, George Mackenzie, former Chancellor of the Exchequer, Alistair Darling, the former Paymaster General, Tessa Jowell, the former Deputy Leader of the Scottish National Party, Angus Robertson, the former Leader of the Scottish Labour Party, Kezia Dugdale, the former Deputy Leader of the Scottish Conservative Party, Murdo Fraser, the former Leader of the Scottish Liberal Democrats, Nicol Stephen, the former leader of the Scottish Green Party, Robin Harper, John Rose, former Finance Minister and Solicitor General of Canada, Sylvester Douglas, former Chief Secretary for Ireland, and Cosmo Gordon, politician and co-founder of the Royal Society of Edinburgh. Aberdeen has produced numerous politicians, Lords, MPs, MSPs, and cabinet members. The former Chief Constable of Police Scotland and current Deputy Commissioner of the Metropolitan Police, Steve House, and the current Chief Constable of Police Scotland, Iain Livingstone. Additionally, businessmen such as Stephen Carter, founding CEO of Ofcom and Minister for Communications, Technology and Broadcasting under Gordon Brown, David Reid, former chairman of Tesco, Sir Thomas Sutherland, the founder of Hongkong and Shanghai Banking Corporation (HSBC), and Will Whitehorn, former president of Virgin Galactic, and Donald Cruickshank, former chairman of the London Stock Exchange."]}]}}