{"wiki_id": "http://www.wikidata.org/entity/Q5622472", "itemLabel": "Guy Molesworth Kindersley", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Guy_Kindersley", "wikipedia_page": {"main": "Guy Molesworth Kindersley (28 February 1876 – 30 November 1956) was a Conservative Party politician in the United Kingdom who represented Hitchin, Hertfordshire.\nKindersley was the son of Edward Nassau Molesworth Kindersley and his wife Ada Good Murray and brother of Lord Kindersley. He was educated at Windlesham House School and Marlborough College. He became a stockbroker and was a Major in the army. In the 1923 general election he was elected as MP for Hitchin and retained the seat in 1924. He inadvertently played a major part in this Conservative victory. He was explosively anti-Communist and was used in the matter of the Zinoviev letter. A former MI5 agent and a director of a City company, took the forged letter to Kindersley, his \"trusted friend in the City\", just before the 1924 election. Kindersley, unaware of the plot, took the letter to the Daily Mail, and its publication is said to have had devastating results for the Labour Party at the 1924 election.\nKindersley retained the safe seat in the 1929 general election. Harold Macmillan, later Prime Minister, had lost his seat at that election and was looking at Hitchin as a safer seat, knowing that Kindersley was planning to retire. However Macmillan wrote a letter of support for Oswald Mosley and an attack on the Baldwin government because it would not implement a programme of public works to tackle unemployment. Kindersley told him not to do it again, and when Macmillan refused to back down, Kindersley announced he would fight the seat again, thus scuppering Macmillan's chances. In the event he did resign his seat at 1931 general election (and Macmillan was returned at his old seat at Stockton).\nKindersley married Kathleen Agnes Rhoda Elton 21 Jan. 1905. She was the daughter of  the Arts and Crafts potter Sir Edmund Elton. Their son David Kindersley became an engraver and script designer.", "link_mentions": [{"page": "Harold Macmillan", "response": ["Macmillan lost his seat in 1929 in the face of high regional unemployment. He almost became Conservative candidate for the safe seat of Hitchin in 1931Horne 1988, p. 243 but the sitting MP, Guy Molesworth Kindersley cancelled his retirement plans, in part because of his own association with the anti-Baldwin rebels and his suspicion of Macmillan's sympathy for Oswald Mosley's promises of radical measures to reduce unemployment. Instead, the fortunate resignation of the new candidate at Stockton allowed Macmillan to be re-selected there, and he returned to the House of Commons for his old seat in 1931."]}]}}