{"wiki_id": "http://www.wikidata.org/entity/Q5622468", "itemLabel": "Guy Middleton", "itemDescription": "actor (1907-1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/Guy_Middleton", "wikipedia_page": {"main": "Guy Middleton Powell (14 December 1907 – 30 July 1973), better known as Guy Middleton, was an English film character actor.", "link_mentions": [{"page": "1973 in film", "response": ["| style=\"text-align:center;\"| 30 || Guy Middleton || style=\"text-align:center;\"| 65 || style=\"text-align:center;\"| England || style=\"text-align:center;\"| Actor || "]}, {"page": "Oh! What a Lovely War", "response": ["*Guy Middleton as Sir William Robertson"]}, {"page": "St Trinian's School", "response": ["In the films the school became embroiled in various shady enterprises, thanks mainly to Flash, and, as a result, was always threatened with closure by the Ministry. (In the last of the original four, this became the \"Ministry of Schools\", possibly because of fears of a libel action from a real Minister of Education.) The first four films form a chronological quartet, and were produced by Frank Launder and Sidney Gilliat. They had earlier produced The Happiest Days of Your Life (1950), a stylistically similar school comedy, starring Alastair Sim, Joyce Grenfell, George Cole, Richard Wattis, Guy Middleton, and Bernadette O'Farrell, all of whom later appeared in the St Trinian's series, often playing similar characters."]}, {"page": "Kenneth More", "response": ["Director Henry Cornelius approached More during the run of The Deep Blue Sea and offered him £3,500 to play one of the four leads in a comedy, Genevieve (1953) (a part turned down by Guy Middleton). More said Cornelius never saw him in the play but cast him on the basis of his work in The Galloping Major.More 1978, p. 157.Thompson, Harold. \"From the 'Windmill' to the 'Sea'.\" The New York Times, 29 May 1955, p. 53. More recalls \"the shooting of the picture was hell. Everything went wrong, even the weather.\" The resulting film was a huge success at the British box office."]}, {"page": "The Wednesday Play", "response": ["| David BuckJohn PhillipsIsobel BlackJames BreePatricia GarwoodRobert HarrisGuy MiddletonAnn TirardStephen JackPhilip LathamRichard CarpenterFrank GatliffYvonne AntrobusBarry Humphries"]}, {"page": "Albert R.N.", "response": ["* Guy Middleton as Captain Barton", "Lewis Gilbert said the film earned its money back in the United Kingdom. Variety , Wednesday, October 21, 1953, page 181, described it as \"Well-done British-made prison meller, lacks names for U.S. market\", and went on the say it had \"A solid all-round cast admirably fits into the plot. Anthony Steel handsomely suggests the voung artist responsible for the creation of “Albert” and Jack Warner i.s reliably cast as the senior British officer who maintains discipline with understanding in the camp. Robert Beatty, William Sylvester and Guy Middleton are among the principal POWs. Frederick Valk is a sympathetic camp commandant, but Anton Diffring suggests the typical ruthless Nazi type.\""]}, {"page": "The Belles of St. Trinian's", "response": ["Arabella tells her father the disastrous news of Arab Boy's strength and suggests they \"nobble\" the horse, but Clarence rejects that idea. Arabella suggests he give it some thought and, should he change his mind, come to St Trinian's the next day, ostensibly for the field hockey match. Crawley and some of the sixth form girls are setting up the net for the match, when the girls run off. Crawley chases them and finds them, with two men and Miss Drownder, having a \"French lunch\", as she later reports to Fritton. Fritton explains that she need not worry: the men are former ministry inspectors Eric Rowbottom-Smith (Guy Middleton), now the school's gardener, and Wilfred Woodley (Arthur Howard), the new fencing master."]}, {"page": "Genevieve (film)", "response": ["The original choices for the male leads were Guy Middleton and Dirk Bogarde; they turned the film down, and their roles were given to Kenneth More and John Gregson respectively. Dinah Sheridan says that the studio wanted Claire Bloom to play her part."]}, {"page": "Champagne Charlie (1944 film)", "response": ["* Guy Middleton as Tipsy Swell"]}, {"page": "The Captive Heart", "response": ["*Guy Middleton as Capt. Jim Greyson"]}, {"page": "The Happiest Days of Your Life (film)", "response": ["* Guy Middleton as Victor Hyde-Brown", "The Belles of St Trinian's (1954) is a similar comedy about a girls' school at which chaos reigned, which was also produced by Launder and Gilliat and featured several members of the cast of The Happiest Days of Your Life, including Alastair Sim, Joyce Grenfell, George Cole, Richard Wattis and Guy Middleton, with Ronald Searle providing the cartoons for the titles."]}, {"page": "Malaga (1954 film)", "response": ["* Guy Middleton as Soames Howard "]}, {"page": "French Without Tears", "response": ["*Brian Curtis - Guy Middleton"]}, {"page": "Keep Fit", "response": ["Keep Fit is a 1937 British comedy film directed by Anthony Kimmins and starring George Formby, Kay Walsh and Guy Middleton. Formby was at his British top box-office peak when this comedy was made.", "* Guy Middleton as Hector Kent"]}, {"page": "Gentlemen Marry Brunettes", "response": ["* Guy Middleton as Earl of Wickenwave"]}, {"page": "The Rake's Progress (film)", "response": ["* Guy Middleton as Fogroy"]}, {"page": "Laughter in Paradise", "response": ["Laughter in Paradise is a British comedy film released in 1951. The film stars Alastair Sim, Fay Compton, George Cole and Guy Middleton. The film was remade as Some Will, Some Won't (1970).", "*Guy Middleton as Simon Russell"]}, {"page": "Young Wives' Tale", "response": ["Young Wives' Tale, also known as Fun for Four, is a 1951 British comedy film directed by Henry Cass and starring Joan Greenwood, Nigel Patrick, Derek Farr, and Guy Middleton. It features one of Audrey Hepburn's earliest film roles, albeit a minor one, as Eve Lester.", "* Guy Middleton as Victor Manifold"]}, {"page": "The Arthur Askey Show", "response": ["The Arthur Askey Show was set in 1910, and Arthur Pilbeam's wife, Emily, was considerably younger than he was. The next door neighbours are Mr. and Mrs. Rossiter. Amongst the guest stars to make appearances were Sam Kydd, who had appeared in Arthur's Treasured Volumes the year before, and Guy Middleton."]}, {"page": "The Demi-Paradise", "response": ["* Guy Middleton as Dick Christian"]}, {"page": "The Magic Christian (film)", "response": ["* Guy Middleton as Duke of Mantisbriar (uncredited)"]}, {"page": "Veronica Hurst", "response": ["Hurst was awarded the Leverhulme Scholarship to RADA and made her film debut as Joan Webb in Laughter in Paradise (1951) with director Mario Zampi describing her as \"one of the greatest potential screen stars I have ever seen\". The film featured Alastair Sim, Fay Compton and Guy Middleton. She was then contracted to the Associated British Picture Corporation for seven years. In 1952 she appeared in the critically acclaimed Battle of Britain film Angels One Five, directed by George More O'Ferrall and starring alongside Jack Hawkins and John Gregson."]}, {"page": "Let's Be Happy", "response": ["* Guy Middleton as Mr. Fielding"]}, {"page": "1951 in British music", "response": ["*Stanley Black – Laughter in Paradise, starring Alastair Sim, Fay Compton, George Cole and Guy Middleton. "]}, {"page": "The Halfway House", "response": ["* Guy Middleton as Fortescue"]}, {"page": "List of British films of 1949", "response": ["|Once Upon a Dream||Ralph Thomas||Googie Withers, Guy Middleton || Comedy||"]}, {"page": "List of British films of 1951", "response": ["|The Third Visitor||Maurice Elvey||Sonia Dresdel, Guy Middleton||Crime||"]}, {"page": "List of British films of 1954", "response": ["| The Harassed Hero || Maurice Elvey || Guy Middleton, Elwyn Brook-Jones || Comedy ||"]}, {"page": "List of British films of 1935", "response": ["|Jimmy Boy||John Baxter||Jimmy O'Dea, Guy Middleton||Comedy||", "| Trust the Navy || Lupino Lane || Nancy Burne, Guy Middleton || Comedy ||"]}, {"page": "Dangerous Moonlight", "response": ["* Guy Middleton as \"Shorty\" "]}, {"page": "29 Acacia Avenue", "response": ["*Guy Middleton as Gerald"]}, {"page": "French Without Tears (film)", "response": ["* Guy Middleton as Brian Curtis"]}, {"page": "Break in the Circle", "response": ["Break in the Circle is a 1955 British drama film directed by Val Guest and starring Forrest Tucker, Eva Bartok, Marius Goring and Guy Middleton. ", "* Guy Middleton as Major Hobart "]}, {"page": "A Yank in Ermine", "response": ["*Guy Middleton as Bertram"]}, {"page": "Front Page Story", "response": ["* Guy Middleton as Gentle"]}, {"page": "The White Unicorn", "response": ["* Guy Middleton as Fobey  "]}, {"page": "List of British actors", "response": ["* Guy Middleton (1907–1973)"]}, {"page": "For Freedom (1940 film)", "response": ["For Freedom is a 1940 British drama film directed by Maurice Elvey and Castleton Knight. It was made largely for propaganda purposes during the Second World War.  It features Will Fyffe, Guy Middleton, and Terry-Thomas.BFI", "* Guy Middleton as Pierre"]}, {"page": "Once Upon a Dream (1949 film)", "response": ["Once Upon a Dream is a 1949 British comedy romance film directed by Ralph Thomas in his debut and starring Googie Withers, Griffith Jones, and Guy Middleton. It was a J. Arthur Rank presentation and a Sydney Box production, and was released through General Film Distributors Ltd. The film was made at the Lime Grove Studios with sets designed by the art director Cedric Dawe.", "* Guy Middleton as Major Gilbert"]}, {"page": "Doctor at Large (film)", "response": ["* Guy Middleton as Major Porter"]}, {"page": "Night Boat to Dublin", "response": ["Night Boat to Dublin is a 1946 British thriller film directed and co-written by Lawrence Huntington.  It stars Robert Newton, Raymond Lovell, Guy Middleton, Muriel Pavlow and Herbert Lom.", "* Guy Middleton as Captain Toby Hunter  "]}, {"page": "Marry Me! (1949 film)", "response": ["* Guy Middleton as Sir Gordon Blake", "The film was a box office flop, recording a loss of £67,600. Bosley Crowther in The New York Times found the first third of the film \"a delight to watch,\" but, despite convincing dialogue and an \"excellent cast\", \"the film as a whole is a disappointingly contrived package job\". Crowther thought that the best story, with Guy Middleton, \"rates inclusion in one of the Somerset Maugham showcases\", but he concluded that the writers \"have blunted their ingenious stories with some melodramatic and whimsical resolutions. Terrence Fisher's direction is strictly assembly-line.\" "]}, {"page": "Two Hearts in Harmony", "response": ["* Guy Middleton - Mario"]}, {"page": "No Place for Jennifer", "response": ["No Place for Jennifer is a 1950 British film directed by Henry Cass and starring Leo Genn, Rosamund John, Guy Middleton and Janette Scott.", "* Guy Middleton as Brian Stewart"]}]}}