{"wiki_id": "http://www.wikidata.org/entity/Q5622331", "itemLabel": "Guy Hibbert", "itemDescription": "British screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Guy_Hibbert", "wikipedia_page": {"main": "Guy Hibbert is a British screenwriter and playwright.\nHe has won four BAFTA TV awards, including Best Writer for the 2009 film Five Minutes of Heaven. This film was premiered at the 25th Sundance Film Festival, where Hibbert won the World Cinema Screenwriting Award.Five Minutes of Heaven also won the Christopher Ewart-Biggs Memorial Prize, given for work promoting peace and reconciliation in Ireland. \nHis script for Eye In The Sky won Best Screenplay at Evening Standard British Film Awards 2017. \nHibbert started his writing career as a playwright. His play On The Edge was the winner of the John Whiting Award in 1985.  \nOther awards include the Mental Health Media Award in 1998 and in 2004 and the Joan Coleman Award in 2013 for his contribution to the understanding of mental health. \nHibbert lives in London with his wife, poet and translator Meifu Wang. He has one daughter, Celeste.", "link_mentions": [{"page": "1998 in film", "response": ["| Shot Through the Heart || HBO Pictures || David Attwood (director); Guy Hibbert, John Falk (screenplay); Linus Roache, Vincent Perez, Lia Williams, Adam Kotz, Soo Garay, Lothaire Bluteau, Viktória Bajza, Daniel Betts, Balázs Farkas, Zoltán Gera, Karianne Henderson, Róbert Irisz, Daniel Newman, Laura Petela, Gábor Piroch, Zoltán Rajkai, Zsuzsa Száger, Tibor Szervét, Barna Tóth, Caroline Trowbridge, Philip Whitchurch, Emil Wolk, Radovan Karadzic || Drama || Live action"]}, {"page": "Christopher Ewart-Biggs Memorial Prize", "response": ["*2009–10: Guy Hibbert and Oliver Hirschbiegel, Five Minutes of Heaven"]}, {"page": "Evening Standard British Film Awards", "response": ["*Best Screenplay : Guy Hibbert – Eye in the Sky"]}, {"page": "List of Sundance Film Festival award winners", "response": ["*World Cinema Screenwriting Award – Guy Hibbert for Five Minutes of Heaven"]}, {"page": "John Whiting Award", "response": ["|Guy Hibbert||On the Edge"]}, {"page": "Peter Kosminsky", "response": ["In 1995, Kosminsky was fired from YTV by incoming managing director Bruce Gyngell and set up his own company, Stonehenge Films Ltd, to act as a vehicle for his television dramas. His first independent drama as producer and director was No Child of Mine, written by Guy Hibbert and starring Brooke Kinsella for Meridian Broadcasting/ITV. The programme, transmitted in the UK on 25 February 1997, was a factually-based depiction of sexual abuse at home and in care and provoked considerable controversy. Its string of awards included the BAFTA Award for Best Single Drama – 1997 and the FIPA D'Or in Biarritz."]}, {"page": "Hibbert", "response": ["* Guy Hibbert, American screenwriter"]}, {"page": "On the Edge", "response": ["* On the Edge, a play by Guy Hibbert"]}, {"page": "Who Gets the Dog? (2007 film)", "response": ["Who Gets the Dog? is a one-off British television comedy-drama starring Kevin Whately, Alison Steadman, Stephen Mangan, and Emma Pierson. It was written by Guy Hibbert and directed by Nicholas Renton  and premieres on ITV on Sunday 2 December 2007 at 9pm."]}, {"page": "2009 Sundance Film Festival", "response": ["*World Cinema Screenwriting Award - Guy Hibbert for Five Minutes of Heaven"]}, {"page": "Five Minutes of Heaven", "response": ["Five Minutes of Heaven is a 2009 Irish film directed by Oliver Hirschbiegel from a script by Guy Hibbert. The film was premiered on 19 January 2009 at the 25th Sundance Film Festival where it won the World Cinema Dramatic Directing Award for Oliver Hirschbiegel, and the World Cinema Screenwriting Award for Guy Hibbert. As a television film it was broadcast on BBC Two on 5 April 2009, and also had an international feature film release.", "| Guy Hibbert", "| Guy Hibbert", "| Guy Hibbert", "| Guy Hibbert, Oliver Hirschbiegel, Eoin O'Callaghan, Stephen Wright", "* Staff (January 2009). \"An interview with Guy Hibbert\". UK Writer (Writers' Guild of Great Britain)."]}]}}