{"wiki_id": "http://www.wikidata.org/entity/Q56253655", "itemLabel": "Dave Turner", "itemDescription": "footballer, born 1943", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Turner_(footballer,_born_1943)", "wikipedia_page": {"main": "David John Turner (born 7 September 1943) is an English former professional footballer who made more than 300 appearances in the Football League playing as a wing half or midfielder for Newcastle United, Brighton & Hove Albion and Blackburn Rovers.", "link_mentions": [{"page": "Toronto Blizzard (1971–1984)", "response": ["The Blizzard were members of the NASL until 1984, the last year of league operations. The team were runners-up for the league championship in 1983, losing the Soccer Bowl to the Tulsa Roughnecks 2–0 in front of nearly sixty thousand people at Vancouver's BC Place Stadium. They were runners-up again in 1984 when they lost to the Chicago Sting two games to none in a best of three championship series. The club was coached in these final two years by Bobby Houghton, assisted by Dave Turner and featured Roberto Bettega, David Byrne, Cliff Calvert, Pasquale De Luca, Charlie Falzon, Sven Habermann, Paul Hammond, Paul James, Conny Karlsson, Victor Kodelja, Trevor McCallum, Colin Miller, Jan Möller, Jimmy Nicholl, Ace Ntsoelengoe, Randy Ragan, Neill Roberts, John Paskin, Derek Spalding, and Bruce Wilson in its lineup.", "* Dave Turner (1982–84)"]}, {"page": "David Turner", "response": ["David or Dave Turner may refer to:", "* Dave Turner (footballer, born 1943) (born 1943), English midfielder for Brighton & Hove Albion, coach in Canada", "* Dave Turner (footballer, born 1948) (born 1948), English full back for Southport", "* Dave Turner (Degrassi), fictional character in the Canadian teen drama Degrassi: The Next Generation"]}, {"page": "Carlos Rivas (footballer, born 1953)", "response": ["Rivas was a midfielder for Colo-Colo in 136 official games over five seasons, and he scored 40 goals during that time. \"Idolos: Mediocampistas: Carlos Rivas,\" Colo-Colo Sitio Oficial,  While he was on the team, the team won two national championships (1979 and 1981) and two Polla Gol championships (1981 and 1982). In 1983, he played in the Canadian Professional Soccer League with Edmonton Eagles. The remainder of the 1983 season he played in the National Soccer League with Dinamo Latino, and played once more with the club during the 1985 season. Rivas served as an assistant under Dave Turner in 1986, but still performed as a player for the Toronto Blizzard in the National Soccer League. ", "Rivas served as an assistant coach for the Toronto Blizzard in the National Soccer League in 1986 under head coach Dave Turner. In 1987, he served as a  player-coach in the National Soccer League with Chile Lindo. In 2015, he joined the technical staff of the York Region Shooters in the Canadian Soccer League. He founded the CR Soccer Academy in Southern Ontario. "]}, {"page": "1986 National Soccer League (Canada) season", "response": ["|Dave Turner"]}, {"page": "1985 National Soccer League (Canada) season", "response": ["|Dave Turner", "| Dave Turner"]}, {"page": "Nacional Latino", "response": ["The change in ownership caused a reshuffling in management and in talent as Toronto recruited former Blizzard head coach Dave Turner. Turner managed to sign several of the Blizzard's veterans with NASL experience, and made an immediate impact in the NSL as Dinamo secured their first piece of silverware by winning the NSL Cup.  The following season the team name was officially changed to the Toronto Blizzard and the club became an immediate powerhouse as Toronto managed to retain many of their NASL veterans. The 1986 season produced a treble for the organization as the club clinched the regular season title, and the NSL Cup. Toronto also faced Toronto Italia for the NSL Championship, but were defeated in the finals. On the national level the Blizzard defeated Vancouver Columbus Italia for the NSL Canadian Championship, and Luso Stars Mount Royal of the Quebec National Soccer League (LNSQ) for the NSL Canada Cup.  ", "* Dave Turner (1985–1986) "]}]}}