{"wiki_id": "http://www.wikidata.org/entity/Q5622680", "itemLabel": "Guy Williams", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Guy_Williams_(British_Army_officer)", "wikipedia_page": {"main": "General Sir Guy Charles Williams  (10 September 1881 – 2 February 1959) was a British Army officer who served as General Officer Commanding-in-Chief (GOC-in-C) Eastern Command during World War II.", "link_mentions": [{"page": "5th Infantry Division (United Kingdom)", "response": ["* 1937–1938 Major-General Guy Williams"]}, {"page": "WD Austerity 2-8-0", "response": ["|77337||400||Sir Guy Williams||North British (Queens Park)||25205||1943||Name previously on 78672"]}, {"page": "Chief Royal Engineer", "response": ["*1946–1951: Sir Guy Williams"]}, {"page": "Eastern Command (United Kingdom)", "response": ["*1938 – 1941 Lieutenant General Sir Guy Williams"]}, {"page": "Sir Guy", "response": ["*Sir Guy Williams (British Army officer) who served in World War II"]}, {"page": "Guy Williams", "response": ["Guy Williams may refer to:", "*Sir Guy Williams (British Army officer) (1881–1959), British Army general during World War II", "*Guy Williams (politician) (1907–1992), Canadian Senator and First Nations leader", "*Guy Williams (actor) (1924–1989), American actor and former fashion model", "*Guy Williams (basketball) (born 1960), American basketball player, nicknamed \"The Fly\"", "*Guy Williams (equestrian) (born 1971), British international showjumper", "*Guy Williams (rugby league) (born 1984), Australian rugby league player", "*Guy Williams (comedian) (born 1987), New Zealand comedian and television personality", "*Guy Williams (visual effects), Academy Award-nominated visual effects supervisor", "*R. Guy Williams, model railway locomotive modeller, known for his contributions to the Pendon Museum"]}, {"page": "Structure of the British Army in 1939", "response": ["*Headquarters, Eastern Command, Cavalry Barracks, Hounslow commanded by Lieutenant General Sir Guy Williams"]}, {"page": "Harold Franklyn", "response": ["After the war Franklyn, promoted to major upon transferring to the East Lancashire Regiment on 19 August 1925, served at the Staff College, Camberley, as Deputy Assistant Adjutant General (DAAG) from 31 August 1925 until 31 August 1928. Transferring on 10 May 1930 and receiving promotion to lieutenant colonel in the West Yorkshire Regiment, he became Commanding officer (CO) of the regiment's 1st Battalion in 1930, and transferred to the Sudan Defence Force (SDF) in 1933, initially as a General staff Officer and then from 1935 until 1938 as Commandant. Promoted to colonel on 28 November 1933, on his forty-eighth birthday, he was, on 29 January 1938, promoted to major general (with seniority backdated to 1 January 1938), In December 1938 he returned to Britain where he was appointed General Officer Commanding (GOC) of the 5th Infantry Division, succeeding Major General Guy Williams. The division was the British Army's reserve formation, stationed in and around Catterick in North Yorkshire under the control of Northern Command, but was severely understrength, having recently returned from Palestine.Mead, p. 143 On 21 August 1939 Franklyn was made Colonel of the Green Howards. In late 1939 he was appointed a Grand Officer of the Order of the Nile in recognition of his service in Sudan."]}]}}