{"wiki_id": "http://www.wikidata.org/entity/Q5621840", "itemLabel": "Guto Puw", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Guto_Puw", "wikipedia_page": {"main": "Guto Pryderi Puw (born 1971) is a Welsh composer, university lecturer and conductor.  He is considered to be one of the most prominent Welsh composers of his generation and a key figure in current Welsh music. Puw's music has been broadcast on BBC Radio 3 and been featured on television programmes for the BBC and S4C. He has twice been awarded the Composer's Medal at the National Eisteddfod.\nPuw's works include pieces for unusual combinations of instruments, such as a tuba quartet or a trio consisting of harp, cello and double-bass, as well as more traditional forces such as solo baritone and piano, choir or orchestra. He was associated with the BBC National Orchestra of Wales as its Resident Composer, the first holder of this title, from 2006 to 2010. Puw's own Welsh identity is a recurrent theme in his music: some of his pieces set Welsh-language poetry to music and one of his pieces, Reservoirs, is written about the flooding of Welsh valleys to provide water for England.", "link_mentions": [{"page": "List of 21st-century classical composers", "response": ["|Guto Puw || 1971 || || Welsh || ||"]}, {"page": "BBC National Orchestra of Wales", "response": ["* Guto Puw (2006-2010)"]}, {"page": "Loch Ness Monster in popular culture", "response": ["*Composer Guto Puw wrote a piece for SATB choir in 1998 called \"The Loch Ness Monster's Song\"."]}, {"page": "Stereo Type", "response": ["Stereo Type is a piece by the contemporary Welsh composer Guto Puw.  It was commissioned for the 2005 Bangor New Music Festival, of which Puw is the chairman and artistic director.", "Category:Compositions by Guto Puw"]}, {"page": "Guto Pryderi Puw", "response": ["#REDIRECT Guto Puw"]}, {"page": "... onyt agoraf y drws ...", "response": ["\"......\" (\"...unless I open the door...\") is an orchestral piece lasting approximately 15 minutes by the Welsh composer Guto Puw.  It was first performed on 9 August 2007, at the Proms by the BBC National Orchestra of Wales, conducted by David Atherton. Puw was resident composer with the orchestra at the time.", "Category:Compositions by Guto Puw"]}, {"page": "2007 in British music", "response": ["*BBC Radio 3 Listeners' Award – Guto Puw: Oboe Concerto"]}, {"page": "Guto", "response": ["*Guto Puw (born 1971), Welsh composer, university lecturer and conductor"]}, {"page": "Bangor University", "response": ["* Guto Puw, Welsh composer"]}]}}