{"wiki_id": "http://www.wikidata.org/entity/Q56253521", "itemLabel": "Norman Gall", "itemDescription": "association football player (born 1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Gall_(footballer)", "wikipedia_page": {"main": "Norman Albert Gall  (born 30 September 1942) is an English former professional footballer who made more than 400 appearances in the Football League playing as a defender for Brighton & Hove Albion.", "link_mentions": [{"page": "Norman Gall", "response": ["Norman Gall (born September 17, 1933) is an American reporter and commentator on Latin American affairs.  He has contributed to such periodicals as Forbes, The Economist, and The Wall Street Journal, and since 1987 has been the executive director of the Fernand Braudel Institute of World Economics, based in São Paulo, Brazil.", "Gall was awarded a Guggenheim Fellowship in 1968 to study Iberian and Latin American History.Biography He was a Visiting Fellow at the Woodrow Wilson School of Public and International Affairs at Princeton University from 1967 to 1968 and from 1972 to 1973.  In 2010, he was awarded the Maria Moors Cabot prize, the world's oldest international award for journalism, by the Columbia University School of Journalism. The School of Journalism, in announcing the prize, noted that \"Norman Gall has been reporting on the Americas for half a century. He covered the devastation of the Amazon in the 1970s, the vulnerabilities of Mexico's Institutional Revolutionary Party regime in the 1980s and, more recently, the institutional weaknesses revealed in Brazil by a major corruption scandal that shook President Luiz Inácio Lula da Silva's government in 2005. In the last decade, Gall has bridged the worlds of journalism and scholarship as the founder and creator of the São Paulo-based Fernand Braudel Instituto de Economia Mundial, where he writes and publishes in-depth reports in English, Portuguese and Spanish.\"  The award citation praised Gall's \"half a century of reporting, analysis and commentary on the Americas... unparalleled in its breadth, reach and quality.\""]}]}}