{"wiki_id": "http://www.wikidata.org/entity/Q56247739", "itemLabel": "Mark Hayter", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Hayter", "wikipedia_page": {"main": "Mark Hayter (born 24 October 1949) is a retired British rower who competed at the 1976 Summer Olympics.", "link_mentions": [{"page": "Great Britain at the 1976 Summer Olympics", "response": ["*Thomas Bishop, Mark Hayter, Andrew Justice, Allan Whitwell"]}, {"page": "1975 World Rowing Championships", "response": ["| Tom Bishop, Graeme Mulcahy, Mark Hayter, Dick Findlay"]}, {"page": "Rowing at the 1976 Summer Olympics – Men's quadruple sculls", "response": ["| Andrew JusticeMark HayterAllan WhitwellThomas Bishop"]}, {"page": "Thomas Bishop (rower)", "response": ["He was selected by Great Britain as part of the quad sculls at the 1975 World Rowing Championships, the quad finished in sixth place in the A final. At the 1976 Olympic Games he rowed as part of the men's quadruple sculls with Andrew Justice, Mark Hayter and Allan Whitwell, the crew finished in ninth place."]}, {"page": "Richard Ayling", "response": ["He competed in the men's coxless four event at the 1976 Summer Olympics. He won the coxed pairs title rowing for the Kingston and Leander composite, with Mark Hayter, at the 1973 National Rowing Championships. Ayling was selected by Great Britain as part of the coxed four at the 1975 World Rowing Championships in Nottingham, the four just missed out on a medal finishing in fourth place in the A final."]}, {"page": "Hayter, Mark", "response": ["#redirectMark Hayter"]}, {"page": "1972 British Rowing Championships", "response": ["|Men 1x    || Poplar Blackwall and DistrictKenny Dwan || Cambridge UniversityChris Baillieu ||Newcastle UniversityMark Hayter"]}, {"page": "1973 British Rowing Championships", "response": ["|Men 2+    || Kingston / Leander Richard Ayling & Mark Hayter   || Leander  Summers & John Pemberton     || City Orient"]}, {"page": "Graeme Mulcahy (rower)", "response": ["Mulcahy was selected by Great Britain as part of the quadruple sculls with Tom Bishop, Mark Hayter and Richard Finlay at the 1975 World Rowing Championships, the crew reached the final. In 1976 he was the British single sculls champion when rowing for the Quintin Boat Club at the 1976 British Rowing Championships and the Wingfield Sculls champion. In 1977 he was part of the quad scull that finished 7th overall after winning the B final at the 1977 World Rowing Championships in Amsterdam."]}]}}