{"wiki_id": "http://www.wikidata.org/entity/Q5628588", "itemLabel": "H. T. Dickinson", "itemDescription": "English historian", "wikipedia_url": "https://en.wikipedia.org/wiki/H._T._Dickinson", "wikipedia_page": {"main": "Harry Thomas Dickinson FRSE (born 9 March 1939) is an English historian specialising in British eighteenth century politics. He obtained his BA and MA from the University of Durham and his PhD from the University of Newcastle upon Tyne. He was Reader in History and later Richard Lodge Professor of British History at the University of Edinburgh. He was editor of the journal History from 1993 to 2000. Isaac Kramnick wrote that of the biographies of Lord Bolingbroke, Dickinson's was the \"most reliable\". In the opinion of David Armitage, Dickinson's life of Lord Bolingbroke \"replaced all earlier accounts\".", "link_mentions": [{"page": "Robert Walpole", "response": ["H. T. Dickinson sums up his historical role by saying that \"Walpole was one of the greatest politicians in British history. He played a significant role in sustaining the Whig party, safeguarding the Hanoverian succession, and defending the principles of the Glorious Revolution (1688). He established a stable political supremacy for the Whig party and taught succeeding ministers how best to establish an effective working relationship between Crown and Parliament\".H. T. Dickinson, \"Walpole, Sir Robert\", in David Loads, editor, Reader's Guide to British History (2003) p. 1338 Scholars rank him highly among all British prime ministers."]}, {"page": "Whiggism", "response": ["* H. T. Dickinson, Walpole and the Whig Supremacy (University of London Press, 1973)"]}, {"page": "Whig Junto", "response": ["Whigs however took full control of the government in 1715, and despite a brief internal split remained totally dominant, reaching new heights with the creation of the first recognised Prime Minister, Robert Walpole.  This was however until King George III, coming to the throne in 1760, ensured creation of more peerages for Tories — they sought to dispel a naturally resultant economic favouritism based on politics, caused by this long renewed period of ascendancy and promised greater royal concessions.H. T. Dickinson; Walpole and the Whig Supremacy.  (1973) online edition"]}, {"page": "Letters from a Farmer in Pennsylvania", "response": ["As the letters were published anonymously, Dickinson's identity as the author was not generally known until May 1768. Governor Bernard of Massachusetts speculated privately that the letters might originate from New York. Lord Hillsborough, Secretary of State for the Colonies, might have suspected Benjamin Franklin of authoring the letters, as Franklin related to his son in a letter: \"My Lord H. mentioned the Farmer's letters to me, said he had read them, that they were well written, and he believed he could guess who was the author, looking in my face at the same time as if he thought it was me. He censured the doctrines as extremely wild, &c.\" Franklin in turn speculated that a \"Mr. Delancey\", possibly a reference to Daniel Dulany, might be the author. Due to the initial anonymity of the author, the character of \"the farmer\" attained a lasting reputation independent of Dickinson. \"The farmer\" was the subject of numerous official tributes throughout the colonies, such as a paean written by the town of Boston on the suggestion of Samuel Adams, and was sometimes compared to Whig heroes such as William Pitt and John Wilkes. The letters sparked limited critical reactions in the colonies, such as a series of satirical articles organized by the speaker of the Pennsylvania assembly, Joseph Galloway, which like the original Letters appeared in the Pennsylvania Chronicle. The response to the letters was substantially critical in England with only a few favorable views, such as from Granville SharpBritain and the American Revolution, by H. T. Dickinson, p. 168 and James Burgh.Neither Kingdom Nor Nation, By Neil Longley York, p. 88An English Audience for American Revolutionary Pamphlets Tory papers in England rebutted Dickinson's constitutional argument by arguing that the colonists were virtually represented in Parliament, and by emphasizing the indivisibility of Parliament's sovereignty in the Empire; these rebuttals were not widely circulated in the colonies. Praise for the letters in English Whig newspapers were more widely reprinted in the colonies, producing a skewed impression in the colonies of the English reaction."]}, {"page": "John Reeves (activist)", "response": ["*H. T. Dickinson, 'Popular Loyalism in Britain in the 1790s', in Eckhart Hellmuth (ed.), The Transformation of Political Culture: England and Germany in the Late Eighteenth Century (Oxford, 1990).", "*H. T. Dickinson, 'Popular Conservatism and Militant Loyalism, 1789–1815', in Dickinson (ed.), Britain and the French Revolution, 1789–1815 (London, 1988)."]}, {"page": "Gateshead Grammar School", "response": ["* Prof H. T. Dickinson, Richard Lodge Professor of British History at the University of Edinburgh, and President from 2002-5 of the Historical Association "]}, {"page": "October Club (Tory Party)", "response": ["After the Lord High Treasurer Robert Harley refused to set up an inquiry into the former administration's financial policies, on 5 February 1711 some Tories passed resolutions calling for inquires into suspected financial abuses. Initially 70 to 80 strong, the October Club attracted not just young and inexperienced backbenchers but older Tories such as Ralph Freeman, Sir John Pakington, Sir Justinian Isham, Peter Shakerley and Sir Thomas Hanmer. The group grew to have \"perhaps 200 members\". The group were, according to H. T. Dickinson, \"a major threat to the Harley administration\".H. T. Dickinson, Bolingbroke (London: Constable, 1970), p.  80. Linda Colley claims that the bulk of the membership were of Royalist ancestry.Linda Colley, In Defiance of Oligarchy: The Tory Party, 1714-60 (Cambridge: Cambridge University Press, 1985), p. 87."]}, {"page": "The Conduct of the Allies", "response": ["Bolingbroke helped Swift with the book's composition.H. T. Dickinson, Bolingbroke (London: Constable, 1970), p. 9, p. 89.", "*H. T. Dickinson, Bolingbroke (London: Constable, 1970)."]}, {"page": "Harry T. Dickinson", "response": ["#REDIRECT H. T. Dickinson"]}]}}