{"wiki_id": "http://www.wikidata.org/entity/Q5629960", "itemLabel": "HK119", "itemDescription": "Finnish singer", "wikipedia_url": "https://en.wikipedia.org/wiki/HK119", "wikipedia_page": {"main": "HK119 is the alter ego of Finnish multimedia artist, singer and recording artist Heidi Kilpeläinen, who lives and works in London, England.", "link_mentions": [{"page": "List of Finns", "response": ["*Heidi Kilpeläinen – multimedia artist, singer and recording artist, known by the stage name HK119"]}, {"page": "List of female electronic musicians", "response": ["* Heidi Kilpeläinen (HK119)"]}, {"page": "I Monster", "response": ["In 2007, I Monster started collaborating with Finnish pop artist, HK119, for her second album.  The resulting project, Fast, Cheap and Out of Control was released in September 2008 on One Little Indian Records, and saw I Monster co-write and co-produce over three quarters of the album. This collaboration came from Dean Honers previous role as a remixer for HK119's debut single, \"Pick Me Up\", from her debut eponymous album in 2006.", "* HK119 - Fast, Cheap and Out of Control (2008)"]}, {"page": "Björk", "response": ["In 2004, Arab discovered the work of Finnish multimedia artist Heidi Kilpeläinen, who had taken her combination of lo-fi, homemade electro pop with her own self-produced music videos and combined them under the alter ego character HK119. Leila soon referred HK119's work to Björk, who started mentioning HK119 in various press and interviews. In 2004, Arab announced HK119 as her favourite act of 2004. HK119 was soon signed to Björk's parent label One Little Indian Records, which released her debut album in 2006. HK119 and Björk appeared in a joint interview in Dazed & Confused magazine in 2006, in which Björk stated about HK119's work: \"It's unique. Even if I gave you $3 million, you couldn't improve on it... [Its] simplicity is [its] strength.\"HK119 & Björk Interview, Dazed & Confused  HK119 later released her albums Fast, Cheap and Out of Control in 2008 and Imaginature in 2013, both on One Little Indian Records."]}, {"page": "HK119 (album)", "response": ["HK119 is the debut, eponymous solo album from Finnish multimedia artist and singer-songwriter Heidi Kilpeläinen, performing under her alter ego HK119.  The album was released through One Little Indian Records on 20 February 2006 in the United Kingdom.HK119 @ allmusic.com ", "The album was a collection of Kilpeläinen's home-made 8-track (multitrack) digital recordings, she composed especially for her MA degree course in Fine Art from 2003–2004, which she combined with individual home-made music videos for nearly every track on the album.  (Each video's 'character' was portrayed with a unique costume, which collectively formed the \"character\" of HK119)HK119: Wears The Trousers Interview ", "It was these videos that initially caught the attention of Icelandic singer Björk, who then featured HK119 in a Q Magazine article, citing her as her favourite artist of new 2004, and ultimately leading HK119 being signed to One Little Indian Records.", "#\"Buy Me (HK119 Remix)\"", "Category:HK119 albums"]}, {"page": "Fast, Cheap and Out of Control (album)", "response": ["Fast, Cheap and Out of Control is the 2008 follow-up album to HK119's 2006 eponymous debut.  The album was released through One Little Indian Records on 28 September 2008 in the United Kingdom.HK119 – Fast, Cheap and Out of Control @ allmusic.com ", "The album was a significant upgrade from the harsher, lo-fi sounding debut.  Having started to collaborate with other producers, musicians and writers (including cult folk singer Mara Carlyle who provides backing vocals to the track 'Divine'), 'Fast, Cheap and Out of Control' is considered a much glossier, finer and intricately executed collection of electro pop songs, that still continue HK119's analysis on issues such as humanity, cloning, celebrity culture, global warming and civil rights, all delivered in a thoroughly researched, but highly tongue-in-cheek and digestible manner.", "The imagery of the album's artwork and HK119 herself had also changed considerably for this album.  In bringing the album \"Back down to earth\" and \"from a more personal place\", HK119 used the imagery of sportswear and use of such related equipment as a dumbbell to highlight the competitive nature of humanity (while also seen smoking on the cover sleeve, to represent the conflict of \"what does it mean to be human?\"; a line featured in the album's lead single, \"C'est La Vie\".)HK119: Wears The Trousers Interview ", "As with her previous album, HK119 produced a short series of home-made music videos to coincide with the album.  As the tracks on 'Fast, Cheap and Out of Control' were longer and more finely produced than before, there were only five coinciding videos with the album (unlike 11 videos that were made for the debut album.)  These videos featured HK119's humorous experiments with chroma key (also known as green screen) video production.", "HK119 and One Little Indian Records made the album's tracks available in individual parts on HK119s official website as part of a remix challenge, for people to make alternative versions of the tracks to potentially be later releases as their own remix album.HK119 Website remix competition http://www.hk119.co.uk", "Category:HK119 albums"]}, {"page": "Fast and Cheap Mixes", "response": ["Fast And Cheap Mixes is the 2010 remix album project by HK119.  The album is a collection of remixes of tracks from her 2008 album Fast, Cheap And Out Of Control, after all the tracks were made available in their individual parts via HK119's official website as part of a competition for anyone to submit their own remixes of the tracks to be considered for a later release.HK119 Official website, remix challenge. http://www.hk119.co.uk", "London-based Electronica netlabel Bit-Phalanx commissioned its entire roster of artists to remix one of the tracks each and compiled their own remix album of the Fast, Cheap And Out Of Control tracks.  The original intention was for Bit-Phalanx to release the album through their own netlabel, but the album quickly caught the attention of One Little Indian Records, who offered to give the album an official digital release in 2010.Altsounds: HK119 New digital download album. http://hangout.altsounds.com/news/113204-hk119-new-download-album-fast-and-cheap-mixes-out-on-14th-december-2009-a.html ", "On 4 December 2009, online music magazine Wears The Trousers gave away a free 6-minute megamix mp3 featuring selections from each remix on the album, as part of the magazine's weekly 'Free Music Friday.Wears The Trousers, HK119 Free Music Friday. http://wearsthetrousers.com/2009/12/04/free-music-friday-hk119/", "* HK119 vs. Bit-Phalanx - \"C'est La Vie\" (Bit-Phalanx Music - BITPEP001DL) (Independently released free download EP, December 2009.)", "* HK119 vs. Bit-Phalanx - \"Space Pt.1\" (Bit-Phalanx Music - BITPEP004DL) (Independently released free download EP, April 2010.)", "Category:HK119 albums"]}, {"page": "Rusko (musician)", "response": ["* 2008 HK119 – \"C'est La Vie\" (Rusko Masher) (One Little Indian)"]}, {"page": "List of albums with tracks hidden in the pregap", "response": ["| || HK119 || 2006 || \"11th ID\" (a cappella track added to the album as part of a remix competition)"]}, {"page": "List of alumni of Central Saint Martins", "response": ["* HK119"]}]}}