{"wiki_id": "http://www.wikidata.org/entity/Q56222437", "itemLabel": "Vick Hope", "itemDescription": "television and radio presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Vick_Hope", "wikipedia_page": {"main": "Victoria Nwayawu Nwosu-Hope (born 25 September 1989) is a British TV and radio presenter, journalist and published author. She hosted the Capital Breakfast show on Capital FM radio station. She also presents Crufts on Channel 4, Carnage on Sky One, Trending Live on 4Music, Life Hacks and Going Home with Vick and Jordan on BBC Radio 1, FYI Daily on ITV2 and became the backstage presenter for ITV's The X Factor in 2019, after becoming the digital reporter for The Voice UK in 2018. In 2020, she became the red carpet host of 2020 BAFTA Film Awards. In October 2020, it was announced that Hope would host a new ITV Hub sister show entitled I'm a Celebrity...The Daily Drop.As well as presenting, Hope has worked as a print and broadcast journalist for ITN and publications including The Argentina Independent and Marie Claire. In 2017 Hope won the Broadcasting Powerhouse Award at the Marie Claire Future Shapers Awards. She is a human rights activist and Amnesty International ambassador, having worked with the organisation since she was 16.", "link_mentions": [{"page": "BBC Radio 1", "response": ["In July 2020, Alice Levine and Cel Spellman announced their resignation from BBC Radio 1. In September, Vick Hope was announced to join Katie Thisleton replacing Spellman.", "After 14 years on BBC Radio 1, Nick Grimshaw announced he will be leaving the station, with Vick Hope and Jordan North taking over the time-slot. Grimshaw broadcast his final show on 12 August 2021. Vick and Jordan's new show first aired on 6 September 2021. Vick continued to co-host Life Hacks alongside Katie Thistleton, while Dean McCullough joined BBC Radio 1 to host Friday-Sunday 1030–1300."]}, {"page": "University Challenge", "response": ["|Team Manford (Darren Harriott, Vick Hope, Jason Manford, Emily Atack)"]}, {"page": "Strictly Come Dancing", "response": ["| Vick Hope", "| Vick Hope"]}, {"page": "Fred Dinenage", "response": ["On 16 October 2020, it was announced Dinenage would appear in a new series of How, alongside Vick Hope, Sam Homewood and Frankie Vu. A year later in December 2021, Dinenage announced his retirement from ITV Meridian, ending a career that has lasted nearly six decades. "]}, {"page": "Dame Allan's School", "response": ["*Vick Hope (born 1989), TV and radio presenter"]}, {"page": "How 2", "response": ["Also in 2019, the CITV channel commissioned a further revival of the format. Due for air November 2020, with Fred Dinenage making his third return to the series, alongside a new team of Vick Hope, Sam Homewood and Frankie Vu."]}, {"page": "The British Soap Awards", "response": ["| \"Best Newcomer\"Presented by Roman Kemp and Vick Hope|| Rob Mallard (Daniel Osbourne in Coronation Street) || Ritu Arya (Dr. Megan Sharma in Doctors)Zack Morris (Keegan Baker in EastEnders)Sally Dexter (Faith Dingle in Emmerdale)Duncan James (Ryan Knight in Hollyoaks)"]}, {"page": "Shipwrecked (TV series)", "response": ["On 22 May 2018 Channel 4 confirmed that the series would return on E4, in 2019, with fierce competition between two battling islands, the tigers and the sharks with filming taking place in the summer on two Motu in the lagoon at Aitutaki. The new series used the Battle of the Islands format and began airing on 28 January 2019, narrated by Vick Hope. The series ended on 15 February and on 15 July 2019, it was announced that the revived show had been axed due to low ratings.", "On 22 May 2018 Channel 4 confirmed that the series would return on E4, with filming taking place in summer 2018, on two Motu in the lagoon at Aitutaki. Airing from 28 January 2019, this series used the Battle of the Islands format. The prize money for this series was £50,000. The series, the ninth overall, was the first to be narrated by Vick Hope, and in a change to previous seasons, episodes aired each weekday for three weeks on E4."]}, {"page": "Saturday Kitchen", "response": ["* Vick Hope"]}, {"page": "Capital Breakfast", "response": ["On 18 April 2017, it was announced that Roman Kemp would host the show alongside Vick Hope, a new presenter. They started on 2 May 2017. A year later Sonny Jay joined the show full-time. On 24 February 2020, it was announced that Hope had left Capital Breakfast to focus on new TV opportunities.", "*Vick Hope (2017–2020)"]}, {"page": "British Nigerian", "response": ["*Vick Hope, television and radio presenter"]}, {"page": "I'm a Celebrity...Get Me Out of Here! (British TV series)", "response": ["On 20 October 2020, ITV announced that an online spin-off show called I'm a Celebrity...The Daily Drop would be aired alongside the 2020 series hosted by Vick Hope on ITV Hub. In October 2021, it was confirmed that The Daily Drop would not return in 2021."]}, {"page": "The Hot Desk", "response": ["* Vick Hope (2016)", "| Vick Hope"]}, {"page": "The X Factor (British TV series)", "response": ["Xtra Bites is the second companion and spin-off show to The X Factor which replaced The Xtra Factor, although Xtra Bites is an online spin-off show which started airing in 2017. The show looks at all the action from the show including behind the scenes footage of the judges and interviews with contestants from the show. It is uploaded onto ITV Hub, the show's YouTube channel, and the X Factor page on the Just Eat website. There were 13 episodes uploaded altogether for the first series, all presented by Becca Dudley. On 23 August 2018, it was announced that Xtra Bites would return for another series after a successful first series, with new presenters Dudley and Tinea Taylor. Vick Hope took over as host for the celebrity series in 2019."]}, {"page": "4Music", "response": ["*Box Fresh - A campaign launched at the beginning of 2017 as a replacement for the Box Upfront series of shows (excluding The Official Box Upfront Chart). Vick Hope presents all Box Fresh branded programming on TV.", "*Trending Live! - Live from Monday to Thursday from 4pm 'til 5:30pm (5pm until 1 May 2018) with Jimmy Hill, AJ Odudu and Vick Hope, Trending Live was the viewer's daily dose of new music and entertainment news centred on interaction with the audience on Twitter via the hashtag #TrendingLive and @TrendingLive & @4music accounts, and through Facebook comments. As of 18 April 2017 until 1 May 2018, Trending Live let viewers choose the music videos played in the You Select! segment from 5pm until the end of the show."]}, {"page": "Celebrity Mastermind", "response": ["| Vick Hope || Giraffes || "]}, {"page": "O'Brien (TV series)", "response": ["| 3 || Janet Street-Porter, Christine Hamilton, Dawn Harper, Norman Lamb, Vick Hope, Nikki Grahame & Lateysha Grace || "]}, {"page": "Jingle Bell Ball", "response": ["On 30 October 2017, during Capital Breakfast, Roman Kemp confirmed that the Jingle Bell Ball would run on Saturday and Sunday, 9–10 December 2017 at The O2 Arena. On 6 November Roman Kemp and Vick Hope confirmed the line-up for night one and on 7 November the line-up for night two was revealed.", "Capital Breakfast presenters Roman Kemp, Vick Hope, and Sonny Jay hosted the event on both nights. The line up was announced by the hosts on the Breakfast Show during the week of 5 November. For the first time since 2011, highlights of the event were not shown on Capital TV as it shut down on 10 October 2018, so highlights were only available on Capital FM and its website and Sky One. Loud Luxury was added to the night 1 line up.", "This will be Welby's first time hosting a Jingle Bell Ball after former co-host Vick Hope left the Capital Breakfast show in 2020. "]}, {"page": "Summertime Ball", "response": ["The Capital Summertime Ball with Vodafone returned to Wembley Stadium on Saturday 10 June 2017 with the event being announced on Friday 28 April 2017 by Roman Kemp and Vick Hope via Capital Breakfast. They announced 7 acts per-day from Monday 7 May until Wednesday 9 May and the headlining act was announced on Thursday 10 May with tickets going on sale the same day and selling out in 30 minutes. Maroon 5 pulled out of the event and were replaced by Liam Payne and Sigala on Thursday 8 June. Bruno Mars and Little Mix headlined the event with Shawn Mendes and Niall Horan as supporting headliners.", "Capital FM produced three programs dedicated to this event: on 10 June 2017, it broadcast live backstage from 6am to 3pm with Rob Howard, Will Cozens and Jimmy Hill, then live coverage from Wembley from 3pm to 11pm by three presenters in order: Ant Payne, Vick Hope and The Bassman, and finally JJ ran an \"Afterparty\" edition until 2am at night; on the next day, JJ reviewed every best moment from the event on his slot 7-10pm. After this, the network moved back to normal programming. Highlights of the event were aired on Capital TV from 7:00pm to 10:30pm on the day of the ball.", "The Capital Summertime Ball returned to Wembley Stadium on Saturday 9 June 2018 and was announced by Roman Kemp and Vick Hope on Capital Breakfast on Friday 28 April. 5 acts were announced everyday from Monday 30 April 2018 until 3 May 2018. Tickets went on sale on Thursday 3 May 2018 and sold out in 5 days. Shawn Mendes and Camila Cabello headlined the event, with Rita Ora and Charlie Puth as supporting headliners. Marvin Humes did a DJ set from 2:40pm before the main show began at 3pm. ", "The 2019 Summertime Ball was held on Saturday, 8 June 2019 at Wembley Stadium for the 10th consecutive year. The lineup was announced on Capital Breakfast with Roman Kemp, Vick Hope and Sonny Jay from Monday, 29 April 2019. The lineup was announced by being revealed on billboards across the United Kingdom. The person who spotted the 'Ballboards' had to text 83958 with their Location and the artist they saw and as a result of confirming an artist Kemp would give the caller a pair of tickets to this year's event.", "The headliner was announced to be Calvin Harris on 2 May 2019. Marvin Humes did an Introductory DJ Set at 2:00pm, with the show starting at 2:30pm BST and finishing at approximately 10pm BST. Roman Kemp, Vick Hope and Sonny Jay hosted the Ball. Tickets sold out on 8 May 2019 (six days after they originally went on sale).", "There was also a livestream on the Capital FM Website, the Global Player or Capital app or on Capital's channel on Apple News which started at 2:30pm BST hosted by Vick Hope, Jimmy Hill and Marvin Humes (as Backstage Reporter). The livestream was also available to watch on Capital's TikTok page hosted by HRVY. Highlights & vlogs of the 2019 Summertime Ball were uploaded to Capital's and other people's YouTube channels from Sunday 9 June 2019. There were also Ball updates on Capital's Instagram, Twitter and Facebook pages. ", "Roman KempVick HopeSonny Jay"]}, {"page": "Jon Morter", "response": ["The song about Boris Johnson was revealed on BBC Radio 1 by Vick Hope and Katie Thistleton on 20 December 2020."]}, {"page": "List of Strictly Come Dancing contestants", "response": ["| Vick Hope"]}, {"page": "1989 in British radio", "response": ["*25 September – Vick Hope, broadcast presenter"]}, {"page": "Cel Spellman", "response": ["In August 2020, it was announced that Spellman would be leaving his Sunday slots on Radio 1 at the end of that month to focus on his acting and broadcasting commitments. Vick Hope replaced Spellman, co-hosting Life Hacks and The Official Chart: First Look on Radio 1 from the beginning of September 2020. "]}, {"page": "How (TV series)", "response": ["Also in 2019, the CITV channel commissioned a further revival of the format. Due for air November 2020, with Fred Dinenage making his second return to the series franchise, alongside a new team of Vick Hope, Sam Homewood and Frankie Vu. ITV ordered a second series of How for release in 2022 and with CBeebies presenter George Webster joining the team."]}, {"page": "Kunt and the Gang", "response": ["The song about Boris Johnson was revealed on BBC Radio 1 by Vick Hope and Katie Thistleton on 20 December 2020. During the show, the presenters did not mention the song's title or play it on air because of the offensive language in it, stating: \"Now at 19 we've got a track about Boris Johnson that has so many bad words in it we can't play it on daytime Radio 1.\" The record was a new entry at number 19, with LadBaby at number 1, climbing to number 8 the next day. On 23 December 2020, it was reported that a number of bookmakers had put odds on the record being the Christmas number one at 8/1, after it had become the second most downloaded song on iTunes and Amazon. The song ultimately reached number 5 on the Christmas chart, after accumulating 45,119 sales,https://chart-watch.uk/xmas-no-1 and unlike many of the other Christmas campaign singles (such as rivals LadBaby) made the Official Audio Streaming Chart as well."]}, {"page": "The Official Chart", "response": ["The Official Chart: First Look is the show which provides the update on how the chart looks over the weekend. The show is on air during the historic Sunday slot but for one hour only, which is 6:00 - 7:00 pm, and hosted by Vick Hope and Katie Thistleton.", "In September 2020, Vick Hope joined as the co-host of the show with Katie Thistleton. She replaced Cel Spellman as he focused on other acting and broadcasting work, even though the station says he will remain as a part of the Radio 1 family.", "| Katie ThistletonVick Hope"]}, {"page": "List of Celebrity Juice episodes", "response": ["| Joel Dommett, Vick Hope"]}, {"page": "The Playlist", "response": ["|Vick Hope, Nathan Evans & YolanDa Brown"]}, {"page": "AJ Odudu", "response": ["In June 2013, Odudu began presenting Big Brother's Bit on the Side with Rylan Clark-Neal and Emma Willis, and then Celebrity Big Brother's Bit on the Psych from August 2013. Her departure from the show was confirmed in November 2013, being replaced by Celebrity Big Brother 12 contestant and former Loose Women panellist, Carol McGiffin. In August 2013, Odudu launched her own blog on Hello magazine's UK website. In 2017 Odudu hosted 4Music programme, Trending Live!, with Jimmy Hill and Vick Hope."]}, {"page": "Katie Thistleton", "response": ["Katie Lorna Thistleton (born 13 May 1989) is an English television and radio presenter, National Council for the Training of Journalists (NCTJ) qualified journalist and author, best known for her work across the  CBBC channel. She presents a show on BBC Radio 1 with her co-presenter Vick Hope.", "Thistleton currently hosts Life Hacks and The Official Chart: First Look on Radio 1 alongside Vick Hope."]}, {"page": "Good Morning Britain (2014 TV programme)", "response": ["| rowspan=\"12\" |Entertainment Presenter|| Vick Hope"]}, {"page": "Siân Welby", "response": ["Since January 2017, Welby has hosted her own national radio show on Heart every Monday to Thursday from 7pm to 10 pm. In July 2018, she took over the Sunday morning breakfast show from Stephen Mulhern and Emma Willis. In 2017, she teamed up with Ed Sheeran to record a kazoo cover of his hit 'Shape of You' live on air. She has a personalised written thank you note from Sheeran framed in her house. On 20 March 2020, it was announced that Welby would join the Capital FM Breakfast Show with Roman Kemp which is fronted by Kemp and co-hosted by Sonny Jay as a replacement for Vick Hope who left on 21 February 2020."]}, {"page": "Sonny Jay", "response": ["As a musician he was known for being a member of the group Loveable Rogues who reached the finals of the sixth series of Britain's Got Talent in 2012. As a radio presenter he presented Phoenix FM from 2015 to 2017 before moving to Capital FM. He began presenting Capital Breakfast alongside Roman Kemp and Vick Hope (later Sian Welby). In 2021, he won the thirteenth series of Dancing on Ice partnered with Angela Egan."]}, {"page": "The Voice Kids (British TV series)", "response": ["| Vick Hope"]}, {"page": "Roman Kemp", "response": ["In November 2014, Kemp joined Capital FM to present Sunday 6–9am. He was promoted to Saturday 5–8pm and Sunday 9pm–12am a year later, where he had the chance to interview artists on his show. In February 2016, Kemp became the new face of The Capital Evening Show, weeknights 7–10pm in addition to his Sunday show. In 2017, Kemp began hosting Capital Breakfast from 6am–10am with Vick Hope across London and Saturday 6am–9am across the Network. As a result, he left the evening show. In 2018, Sonny Jay joined Capital Breakfast full-time as a co-presenter. In 2016, Kemp was The X Factor UK's digital presenter and social media correspondent. He also co-hosted Nick Kicks on Nicktoons. Since January 2017, he has co-presented 2Awesome on ITV2 with Vick Hope. He also presented The Hot Desk on ITV2. From 2 May 2017, Kemp took over Capital FM London's breakfast show with Hope. He narrated Bromans on ITV2 in 2017, in which his father played Emperor. He appeared in an episode of Len Goodman's Partners in Rhyme. He took part in a celebrity edition of First Dates for Stand Up to Cancer in November 2017.", "|With Vick Hope"]}, {"page": "I'm a Celebrity: Extra Camp", "response": ["In 2020, Extra Camp was replaced by I'm a Celebrity...The Daily Drop presented by Vick Hope which also airs on ITV2 after being uploaded online every weekday morning on ITV Hub but was axed in 2021.", "On 9 January 2020, it was announced that series had been axed due to high production costs and would not return later that year. The series was replaced by online spin-off show I'm a Celebrity...The Daily Drop, hosted by Vick Hope on ITV Hub and repeated on ITV2. In October 2021, it was announced that the online spin-off show I'm a Celebrity...The Daily Drop had been axed, with no plans for a replacement.", "| Vick Hope"]}, {"page": "Saturday Mash-Up!", "response": ["Celebrities who have been gunged/slimed include Steve Backshall, DanTDM, Vick Hope, Kimberly Wyatt, Naomi Wilkinson, Lindsey Russell (twice), New Hope Club, Road Trip, Oti Mabuse, Lewys Ball, Olivia Grace and Lovevie, Colson Smith, Mark Rhodes, Briony Williams and Cat Henstridge."]}, {"page": "The Voice UK (series 7)", "response": ["It was announced on 12 March 2018, Vick Hope would be replacing Jamie Miller as the backstage presenter."]}, {"page": "Richard Osman's House of Games", "response": ["*Week 16 (10–14 February 2020): Vick Hope, Gethin Jones, Nicki Chapman and Tim Vine"]}, {"page": "Maya Jama", "response": ["In 2018, Jama hosted When Life Gives You Melons, a podcast available to streaming platforms in partnership with Freya Lingerie. The podcast featured Jama interviewing all-female guests about work, life and relationships. Guests included Cherry Healey, Vick Hope, Anna Richardson, Vanessa White, Katie Piper, Gemma Cairney and Laura Whitmore."]}, {"page": "Timeline of BBC Radio 1", "response": ["**30 June – During his drivetime show, Nick Grimshaw announces he will leave the station after 14 years in mid-August. From Monday 6 September, Vick Hope and Jordan North will host a new drivetime show together (Monday – Thursday, 3.30 pm – 6 pm) on the network. Dean McCullough will also permanently join Radio 1 to replace Jordan North's weekend show, Friday – Sunday, 10.30 am – 1 pm. The first show will air Friday 10 September and will be broadcast from Salford, the first daytime Radio 1 programme to move out of London as part of the BBC's Across The UK plans. Victoria Jane will also join the station, to launch a new show – Radio 1 Future Soul, broadcast from Salford.", "**6 September – Vick Hope and Jordan North begin co-presenting the Radio 1 drivetime show as they replace Nick Grimshaw, Clara Amfo replaces Annie Mac on Monday-Thursday evenings, Sian Eleri also replaces Annie Mac on Radio 1's Power Down Playlist - as it becomes a standalone programme for the first time as Sian herself joins the station, and Rickie, Melvin, and Charlie replace Clara Amfo on weekday mid-mornings."]}, {"page": "Timeline of Capital Radio", "response": ["**May – Roman Kemp replaces Dave Berry as the new presenter of Capital Breakfast in London, alongside Vick Hope and Sonny Jay. Kemp also presents a networked Capital Breakfast show on Saturday mornings.", "***Capital London's breakfast show goes national, replacing most of the network's local breakfast shows, except for Capital Cymru, which also retains local programming at weekends. All Capital stations continue to air weekday Drivetime shows, local news bulletins and traffic updates.Roman Kemp Vick Hope and Sonny Jay to go national on Capital", "** 21 February – Vick Hope leaves Capital Breakfast, and the station ten months after the London-based show went national.Vick Hope announces Capital Breakfast departure, RadioToday, 24 February 2020", "** 23 March – Sian Welby joins the station to replace Vick Hope on Capital Breakfast.Sian Welby joins Roman and Sonny on Capital Breakfast"]}, {"page": "The Voice UK (series 8)", "response": ["On 1 November 2018, it was announced that Vick Hope (last series' backstage reporter and The V Room host) would be replaced by AJ Odudu."]}]}}