{"wiki_id": "http://www.wikidata.org/entity/Q5622058", "itemLabel": "Guy Arnold", "itemDescription": "British author", "wikipedia_url": "https://en.wikipedia.org/wiki/Guy_Arnold", "wikipedia_page": {"main": "Guy Arnold (6 May 1932 – 4 January 2020) was a British explorer, travel writer, political writer and specialist in north-south relations, who wrote mainly in the areas of African history, politics, and international affairs. He was based in Marylebone, London.\nGuy Arnold was one of five children by George Arnold and Rita Shaw; he also had two half siblings (one deceased). He was an older brother to Bruce Arnold, a novelist, non-fiction writer and journalist based in Dublin. Although born on Merseyside, he was brought up at the family home in Croydon and went to Kingham Hill School, a boarding school in Oxfordshire, thence to Chipping Norton Grammar School, before going on to St Peter's College, Oxford where he read History graduating in 1955.\nArnold was active in the Conservative Party at Oxford and in 1954 along with undergraduates Michael Heseltine, Julian Critchley and Martin Morton canvassed workers at the gates of the Vickers Shipyard in Barrow-in-Furness as part of the 1955 General Election campaign. On leaving Oxford, in 1955, with three other Oxford graduates Colin Campbell, Tom Chavasse and Gordon Pickles, he undertook an exploration of the Usun Apau Plateau and the Plieran River in Sarawak, Borneo. He subsequently wrote a number of articles including \"Economic Needs of Sarawak\" for New Commonwealth Magazine, 'Music in Sarawak' for the Times Educational Supplement and \"Prehistory of Usun Apau\" for the Sarawak Museum Journal; these led to the writing of his first travel book 'Longhouse and Jungle'.In 1958, he moved to Canada for five years and taught first at Pickering College and then at Ryerson University; during this period he was instrumental in setting up the Canadian University Service Overseas (CUSO). In 1988, his contribution to the establishment of CUSO was recognised with an award for his 25 years of service to the organisation.\nIn 1964, he travelled to Northern Rhodesia as an adviser to the leader of the United National Independence Party (UNIP), Kenneth Kaunda. He was regularly seen at regional UNIP offices in the yellow Packard car provided for him by Kaunda. During this period he met and stayed with Stewart Gore-Browne, later the subject of The Africa House by Christina Lamb; at the time Arnold was suffering from malaria which Gore-Brown treated with red wine. After independence in October 1964 and Kaunda's ascendancy as President, Arnold left the newly independent Zambia and drove from Lusaka to London in a newly acquired Land-rover, a journey of over 11,500 km; he was accompanied by Alan Leather who was finishing his stint with Voluntary Service Overseas (VSO). In London Arnold rented a flat in Seymour Place which was to become his home for the next 53 years, the Landrover parked outside until parking restrictions were introduced. His flat was directly above that of the photographer Deste who became a life long friend and colleague until her death in 1986.\nOver the course of his career, he also worked with the Overseas Development Institute, created a National Youth Service in Zambia in the period before its independence in 1964, and was Director of the Africa Bureau (a non-governmental lobby group) from 1968 to 1972, as well as working as a consultant in the field. He was the author of more than 50 books including travelogues and educational books for children.\nHe lectured and taught courses on international affairs for over thirty years, at the Workers’ Educational Association and the University of Surrey.While most government officials on both sides of the Atlantic have supported the Special Relationship between Britain and the United States, Arnold was a critic. In 2014, he described it as a \"sickness in the body politic of Britain that needs to be flushed out.\" Instead he called for closer relationship with Europe and Russia so as to rid \"itself of the US incubus.\"Guy Arnold died on 4 January 2020.", "link_mentions": [{"page": "Michael Heseltine", "response": ["Heseltine campaigned briefly as a volunteer in the October 1951 general election before going up to Pembroke College, Oxford. While there, in frustration at his inability to be elected to the committee of the Oxford University Conservative Association, he founded the breakaway Blue Ribbon Club. Along with undergraduates Guy Arnold, Julian Critchley and Martin Morton he canvassed workers at the gates of the Vickers Shipyard in Barrow-in-Furness.Oxford men speak at Shipyard, Barrow-in-Furness Mail, c1953. Archive of Guy Arnold, 2018. Julian Critchley recounted a story from his student days of how he plotted his future on the back of an envelope, a future that would culminate as Prime Minister in the 1990s. A more detailed apocryphal version has him writing down: 'millionaire 25, cabinet member 35, party leader 45, prime minister 55'.Andrew Marr, A History of Modern Britain (2009), p. 418. He became a millionaire and was a member of the shadow cabinet from the age of 41, but did not manage to become Party Leader or Prime Minister."]}, {"page": "St Peter's College, Oxford", "response": ["* Guy Arnold, explorer, traveller, political commentator, Africa expert and writer "]}, {"page": "Jomo Kenyatta", "response": ["Kenyatta biographer Guy Arnold described the Kenyan leader as \"a pragmatist and a moderate\", noting that his only \"radicalism\" came in the form of his \"nationalist attack\" on imperialism. Arnold also noted that Kenyatta \"absorbed a great deal of the British approach to politics: pragmatism, only dealing with problems when they become crises, [and] tolerance as long as the other side is only talking\". Donald Savage noted that Kenyatta believed in \"the importance of authority and tradition\", and that he displayed \"a remarkably consistent view of development through self-help and hard work\". Kenyatta was also an elitist and encouraged the emergence of an elite class in Kenya. He wrestled with a contradiction between his conservative desire for a renewal of traditional custom and his reformist urges to embrace Western modernity. He also faced a contradiction between his internal debates on Kikuyu ethics and belief in tribal identity with his need to create a non-tribalised Kenyan nationalism."]}, {"page": "G. A. Henty", "response": ["In the Preface to his novel A Roving Commission (1900) Henty claims \"the condition of the negroes in Hayti has fallen to the level of that of the savage African tribes\" and argues \"unless some strong white power should occupy the island and enforce law and order\" this situation will not change.Chris Bongie, Friends and enemies: the scribal politics of post/colonial literature Liverpool University Press, 2008,  (p. 140 ). In the novel Facing Death: A Tale of the Coal Mines Henty comes down against strikes and has the working class hero of the novel, Jack Simpson, quell a strike among coal miners.Guy Arnold, Held Fast for England: G.A Henty, Imperialist Boys' Writer. Hamish Hamilton, 1980,  (p. 21)"]}, {"page": "Albert Zafy", "response": ["In 1992, Zafy stood as a presidential candidate against President Didier Ratsiraka. The election soon became a run-off between the two candidates. In 1993, Zafy won the run-off election in a landslide, receiving 67% of the vote.Richard R. Marcus, \"Political change in Madagascar: populist democracy or neopatrimonialism by another name?\" , Institute for Security Studies, Occasional Paper 89, August 2004. During his presidency, Zafy received poor polling numbers due to an economic decline with accusations of corruption in his office. He was impeached in 1996 and then defeated by Ratsiraka in the 1996 presidential election.Guy Arnold, Madagascar: Year in Review 1996, Britannica.com. After leaving office, Zafy remained active in politics as an opposition leader under successive administrations.", "The president also gained the ability to dismiss the prime minister without requiring new elections. Ravony resigned in October 1995, and Zafy appointed Emmanuel Rakotovahiny, who was the head of the UNDD and had been Minister of State for Rural Development and Land Reform, in his place.\"Oct 1995 – Resignation of Prime Minister\", Keesing's Record of World Events, Volume 41, October 1995 Madagascar, Page 40764.Guy Arnold, Madagascar: Year in Review 1995, Britannica.com."]}, {"page": "Julian Critchley", "response": ["Born in Islington, the son of distinguished neurologist Macdonald Critchley, CBE (1900–1997) and his first wife, midwife Edna Audleth (née Morris), Critchley was brought up in Swiss Cottage, North London, and in Shropshire, where he attended Brockhurst School, a preparatory school in Church Stretton, and later Shrewsbury School.  He returned to London to take his Higher Certificate and was rejected from National Service after contracting polio.  After a year living and studying at the Sorbonne in Paris he went up in 1951 to Pembroke College, Oxford, where he read Politics, Philosophy and Economics. In 1953 he was part of a team of Oxford undergraduates lobbying Vickers shipyard workers against nationalisation; the others were Michael Heseltine, Guy Arnold and Martin Morton.Oxford men speak at Shipyard, Barrow-in-Furness Mail, c.1953. Archive of Guy Arnold"]}, {"page": "Special Relationship", "response": ["While most government officials on both sides have supported the Special Relationship, there have been sharp critics. The British journalist Guy Arnold (1932–2020) denounced it in 2014 as a \"sickness in the body politic of Britain that needs to be flushed out\". Instead, he called for closer relationships with Europe and Russia so as to rid \"itself of the US incubus\".Guy Arnold, America and Britain: Was There Ever a Special Relationship? (London: Hurst, 2014) pp 6, 153"]}, {"page": "Kingham Hill School", "response": ["*Guy Arnold traveller, writer"]}, {"page": "Francis Leddy", "response": ["Leddy was also instrumental in establishing Canada's version(s) of the Peace Corps.  In June 1961 at a Conference at McGill University Leddy along with Louis Perinbam, Keith Spicer, Guy Arnold established the organization Canadian University Service Overseas (CUSO) which sent young volunteers overseas to work on community development projects.  Due to his work with CUSO, Leddy was chosen by Prime Minister Lester B Pearson in 1965 to establish the Company of Young Canadians, which was also dubbed as Canada's version of the Peace Corps, even though its volunteers remained at home in Canada to work among disenfranchised communities (urban inner cities, First Nations reserves)."]}, {"page": "The Bible in Spain", "response": ["In the Footsteps of George Borrow by Guy Arnold () is a travel book in which the author retraces the steps of Borrow's journey as related in The Bible in Spain."]}, {"page": "Turkish Crimea Medal", "response": ["*Guy Arnold (Editor), John Worronoff (Editor), Historical Dictionary of the Crimean War. Published by Scarecrow Press. 2002. . "]}, {"page": "Delwa Kassiré Koumakoye", "response": ["Nouradine Delwa Kassiré Koumakoye (born December 31, 1949\"Le Premier Ministre du Tchad: un homme averti de la politique tchadienne\", Chadian government website, March 16, 2007 .) is a Chadian politician and the head of the National Rally for Development and Progress (VIVA-RNDP) political party.\"Chad has a new prime minister\", AFP, February 27, 2007. After serving as a minister in the government during the 1980s and early 1990s; he was Prime Minister of Chad from November 6, 1993Guy Arnold, \"Chad, Year in Review: 1993\", Britannica.com. to April 8, 1995Bernard Lanne, \"Chad: Regime Change, Increased Insecurity, and Blockage of Further Reforms\", Political Reform in Francophone Africa (1997), ed. Clark and Gardinier, page 281. and again from February 26, 2007 to April 16, 2008.\"Tchad: le président Deby nomme un proche conseiller comme Premier ministre\" , AFP, April 16, 2008 . In 2008, he became President of the Economic, Social and Cultural Council.\"BUREAU DU CONSEIL ECONOMIQUE SOCIAL ET CULTUREL\" , website of the Chadian presidency (accessed May 3, 2008)."]}, {"page": "Fidèle Moungar", "response": ["In 1992, two years after the rise to the presidency of Idriss Déby, he became Minister of Education in the government led by Jean Alingué Bawoyeu.Amnesty International Report 1994 - Chad, UNHCR web site. At the Sovereign National Conference (CNS), a reconciliation conference representing most Chadian factions that was first convened on January 15, 1993, Moungar was elected as transitional Prime Minister on April 6, 1993, receiving 444 votes against the 334 received by Adoum Helbongo.Bernard Lanne, \"Chad: Regime Change, Increased Insecurity, and Blockage of Further Reforms\", Political Reform in Francophone Africa (1997), ed. Clark and Gardinier, page 278. He succeeded Alingué as the 5th Prime Minister of Chad on April 7.Guy Arnold, Chad, Year in Review: 1993, Britannica.com."]}, {"page": "Pascal Rakotomavo", "response": ["Pascal Joseph Rakotomavo (1 April 1934Biographical page at Antananarivo Province website  . – 14 December 2010)death notice  (French) retrieved 18 December 2010 was a Malagasy politician. He was the Prime Minister of Madagascar from 21 February 1997Guy Arnold, Madagascar: Year in Review 1997, Britannica.com. to 23 July 1998.Christopher Saunders, Madagascar: Year in Review 1998, Britannica.com."]}, {"page": "Chadian constitution of 1996", "response": ["The national conference, which remained in charge until April 6, when it selected in its place a Conseil Supérieur de Transition (CST), a 57-strong body transitional parliament, and a transitional government, both of which were designed to remain in charge for a year, i.e. until April 6, 1994, by which term elections were to take place and a definitive constitution be approved. In the meanwhile the conference adopted the National Charter as an interim constitution. As little had been achieved during the first year of transition, the term was later extended by the CST to April 9, 1995.\"Background Note: Chad\". 1995. United States Department of State This period was further extended by the CST on March 31, 1995, with the date for the approval by referendum of the constitution scheduled for March 31, 1996.Guy Arnold, Britannica Book of the Year"]}, {"page": "Hagop Hagopian (militant)", "response": ["Hagopian was wanted in France for masterminding the Orly Airport attack in July 1983.The Times, April 29, 1988. Elusive rebel is killed in Athens. This attack resulted in a split in ASALA, with the splinter group ASALA Revolutionary Movement led by Monte Melkonian condemning \"the murderous deviation\" of Hagopian.The Guardian, April 30, 1988. Turks deny killing Armenian activist: Faction fighting blamed for assassination of Hagopian. Hagopian's more militant faction concentrated in the Middle East and Greece.Revolutionary and dissident movements: an international guide, by Guy Arnold, 1991, p. 350 In the aftermath of the split, Hagopian executed two of Melkonian's allies within ASALA in retaliation for the assassination of two of Hagopian's closest aides.Gavin Cameron. Nuclear terrorism: a threat assessment for the 21st century. Palgrave Macmillan, 1999. , , p. 50"]}, {"page": "July 1959", "response": ["*At a meeting in Saniquellie, Liberia, Presidents William Tubman of Liberia and Sekou Toure of Ghana, and Prime Minister Kwame Nkrumah of Ghana, came to an agreement that led to the founding, in 1963, of the Organisation of African Unity (OAU).Guy Arnold, A Guide To African Political & Economic Development (Taylor & Francis, 2001), p5"]}, {"page": "Guy (given name)", "response": ["* Guy Arnold (1932–2020), British author"]}, {"page": "June 1961", "response": ["*The northern part of the British Cameroons Trust Territory was incorporated into the Federation of Nigeria in accordance with a plebiscite.Guy Arnold, Guide to African Political and Economic Development (Taylor & Francis, 2001) p168"]}, {"page": "Bruce Arnold (author)", "response": ["Arnold was educated at Kingham Hill School and at Trinity College, Dublin, where he studied modern languages. His wife Mavis Arnold (née Ysabel Mavis Cleave) was also a journalist.Doran 2005, p.3 Arnold's older brother Guy Arnold is also an author, largely on African politics."]}, {"page": "Eileen Olive Deste", "response": ["In 1943 she returned to England. She set up a studio in London, specializing in portraiture and photographing art work. She also documented a variety of architectural subjects; industrial chimneys, prison doors and pottery kilns. She became a life long friend of writer and traveler Guy Arnold who lived in the flat above her in Marylebone."]}, {"page": "2020 in the United Kingdom", "response": ["**Guy Arnold, 87, explorer and writer."]}, {"page": "Deaths in January 2020", "response": ["*Guy Arnold, 87, English writer and explorer, complications from dementia.Guy Arnold obituary "]}]}}