{"wiki_id": "http://www.wikidata.org/entity/Q5624605", "itemLabel": "Samuel Rolles Driver", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Samuel_Rolles_Driver", "wikipedia_page": {"main": "Samuel Rolles Driver  (2 October 1846 – 26 February 1914) was an English divine and Hebrew scholar. He devoted his life to the study, both textual and critical, of the Old Testament. He was the father of Sir Godfrey Rolles Driver, also a distinguished biblical scholar.\n\n", "link_mentions": [{"page": "Wilhelm Gesenius", "response": ["Gesenius takes much of the credit for having freed Semitic philology from the trammels of theological and religious prepossession, and for inaugurating the strictly scientific (and comparative) method which has since been so fruitful. As an exegete he exercised a powerful influence on theological investigation. He may also be considered as a founder of Phoenician studies.\"Wilhelm Gesenius\", in Je m'appelle Byblos, Jean-Pierre Thiollet, H & D, 2005, p. 253. Gesenius was keenly aware of previous efforts at dictionaries of Biblical Hebrew (he  provided an extensive survey of Hebrew lexicography in the 1823 edition of his Hebrew lexicon for schoolsAn English translation of this essay, \"On the Sources of Hebrew Philology and Lexicography\", appears in The Biblical Repository, ed. by Edward Robinson, vol. 3, nr. 9 (Jan. 1833) pages 1-44.), and, compared to previous lexicons which had simply translated Hebrew expressions as whatever other versions (primarily the Septuagint and the Vulgate) had in the same verses, his own contribution to that field was the inclusion of insights obtained from the study of other languages, ancient and non-semitic.Edward Robinson, Bibliotheca Sacra or Tracts and Essays (1843, NYC) ch. 6, 'Biographical Notices of Gesenius and Nordheimer', page 369. From his extensive body of work, the products most familiar to modern English-speaking readers are his Hebrew Grammar, best represented by an English translation of the 28th German edition, published by Oxford University Press in 1910,Gesenius' Hebrew Grammar as edited and enlarged by E. Kautzsch, second English edition, translated and revised in accordance with the 28th German edition (1909) by A. E. Cowley (1910, Oxford at the Clarendon Press, 598 pages). and his dictionary of Biblical Hebrew and Aramaic, known through a number of English translations, including the Gesenius' Hebrew and Chaldee Lexicon to the Old Testament Scriptures, a 1853 edition revised by Samuel Prideaux TregellesGesenius' Hebrew and Chaldee Lexicon to the Old Testament Scriptures, translated with additions and corrections from the author's thesaurus and other works by Samuel Prideaux Tregelles (1853, London, Samuel Bagster and sons, 884 pages). and the Brown–Driver–Briggs, a 1907 edition revised by Francis Brown, Samuel Rolles Driver and Charles A. Briggs.A Hebrew and English Lexicon of the Old Testament, based on the lexicon of William Gesenius, as translated by Edward Robinson, edited by Francis Brown with the co-operation of S. R. Driver and Charles A. Briggs (1907, NY & Boston, Houghton Mifflin, 1127 pages), and reprinted by several other publishers. As indicated by the title pages, the German editions of these works were carried forward by several revised editions, after Gesenius's death, by other scholars, most conspicuously Emil Rödiger, into the 20th century."]}, {"page": "John Mark", "response": ["First, there is Mark the cousin of Barnabas, mentioned by Paul as a \"fellow worker\" in the closings of three Pauline epistles.; Colossians 4:10; 2 Timothy 4:11. In antiquity he was regarded as a distinct Mark, Bishop of Apollonia. If, on the other hand, these two Marks are to be identified, the fact that these epistles were written after the departure of John Mark with Barnabas in Acts must suppose some later reconciliation. But a majority of scholars, noting the close association of both Marks with Paul and Barnabas, indeed regard them as likely the same person. Biblical scholars Samuel Rolles Driver and Charles Augustus Briggs identified Mark, the cousin of Barnabas, with John Mark,Driver, Samuel Rolles. \"Mark and Silvanus\", The International Critical Commentary on the Holy Scriptures of the Old and New Testaments, C. Scribner's Sons, 1905, p. 80 as do John R. Donahue and Daniel J. Harrington.Donahue, John R. and Harrington, Daniel J., The Gospel of Mark, Liturgical Press, 2002, p.39"]}]}}