{"wiki_id": "http://www.wikidata.org/entity/Q56223962", "itemLabel": "Alan Inns", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Inns", "wikipedia_page": {"main": "Alan F Inns (born 28 August 1945) is a British rowing cox. He competed at the 1972 Summer Olympics, 1980 Summer Olympics and the 1984 Summer Olympics. He won the coxed pairs title with Michael Hart and David Maxwell and the eights title, at the 1972 National Rowing Championships.", "link_mentions": [{"page": "Great Britain at the 1972 Summer Olympics", "response": ["*Michael Hart, David Maxwell, Alan Inns"]}, {"page": "Great Britain at the 1980 Summer Olympics", "response": ["* Lenny Robertson, Gordon Rankine, Colin Seymour, John Roberts, Alan Inns"]}, {"page": "Great Britain at the 1984 Summer Olympics", "response": ["* Adrian Genziani, Bill Lang, Alan Inns"]}, {"page": "Michael Hart (rower)", "response": ["Nationally he won the 1974 British Rowing Championships and  1975 British Rowing Championships double sculls for Leander with Chris Baillieu.  He had won the coxed pairs at the inaugural National Championships in 1972 with David Maxwell and Alan Inns, and their record time still stands as of 2020."]}, {"page": "David Maxwell (rower)", "response": ["He rowed in the winning Cambridge Boat Race crews in both 1971 and 1972. Also during 1972 he won the coxed pairs title with Michael Hart and Alan Inns, at the 1972 National Rowing Championships. "]}, {"page": "1979 World Rowing Championships", "response": ["| Lenny Robertson, Eric Sims, Mark Bathurst, Neil Christie, James MacLeodGordon Rankine, Colin Seymour, John Roberts, Alan Inns (cox)"]}, {"page": "Rowing at the 1972 Summer Olympics – Men's coxed pair", "response": ["| 2 ||align=left| David MaxwellMike Hart ||align=left| Alan Inns ||align=left|  || 7:49.56 || ", "| 1 ||align=left| David MaxwellMike Hart ||align=left| Alan Inns ||align=left|  || 8:01.14 || ", "| 4 ||align=left| David MaxwellMike Hart ||align=left| Alan Inns ||align=left|  || 8:21.61 || ", "| 8 ||align=left| David MaxwellMichael Hart ||align=left| Alan Inns ||align=left|  || 7:59.57"]}, {"page": "The Boat Race 1986", "response": ["The Oxford crew weighed an average of over  per rower more than Cambridge. Cambridge's crew featured only two rowers over the age of 24 while Oxford had just three men under 25. Oxford saw three Blues return while Cambridge welcomed back four. The Cambridge crew featured three international rowers: two Canadians (Gibson and Wilson), and the American Pew.  The Light Blue cox, Carole Burton, was the first woman to steer the Cambridge boat. Oxford's MacDonald was the oldest in the race at the age of 30, he was accompanied in the boat by international rowers Clark and Livingstone from the United States and Jones from Australia. Dan Topolski was the Oxford coach while Cambridge relied on Alan Inns and Canadian Olympic coach Neil Campbell. Cambridge were clear favourites to win, but prior to the race, Topolski claimed his crew had \"pulled themselves back into contention by sheer hard work.\""]}, {"page": "The Boat Race 1987", "response": ["Oxford's crew weighed an average of nearly  a rower more than their opponents.  The race featured the tallest and heaviest (Oxford's stroke Gavin Stewart), youngest (Cambridge's Matthew Brittin) and oldest (Oxford's president Donald Macdonald) crew members in the event's history.  The Cambridge boat saw four returning Blues while Oxford welcomed back just one, in Macdonald.  Oxford's coach was Topolski, his counterpart was Alan Inns."]}, {"page": "Rowing at the 1980 Summer Olympics – Men's coxed four", "response": ["| 2 ||align=left|  ||align=left| Alan Inns ||align=left|  || 6:52.57 || ", "| 3 ||align=left|  ||align=left| Alan Inns ||align=left|  || 6:33.25 || ", "| 7 ||align=left|  ||align=left| Alan Inns ||align=left|  || 6:27.11"]}, {"page": "Rowing at the 1984 Summer Olympics – Men's coxed pair", "response": ["| 3 ||align=left data-sort-value=\"Genziani, Adrian\"|  ||align=left data-sort-value=\"Inns, Alan\"| Alan Inns ||align=left|  || 7:20.51 || ", "| 4 ||align=left data-sort-value=\"Genziani, Adrian\"|  ||align=left data-sort-value=\"Inns, Alan\"| Alan Inns ||align=left|  || 7:38.20 || ", "| 8 ||align=left data-sort-value=\"Genziani, Adrian\"|  ||align=left data-sort-value=\"Inns, Alan\"| Alan Inns ||align=left|  || 7:27.56", "| Adrian GenzianiBill LangAlan Inns"]}, {"page": "Gordon Rankine", "response": ["Rankine was part of the British eight at the 1975 World Rowing Championships in Nottingham, the crew finished 9th overall after a third-place finish in the B final. In 1977 he was part of the eight that reached the final and finished 5th, at the 1977 World Rowing Championships in Amsterdam. He was selected by Great Britain for the men's coxed four event with Lenny Robertson, Colin Seymour, John Roberts and Alan Inns, the crew finished in seventh place."]}, {"page": "1972 British Rowing Championships", "response": ["|Men 2+    || Cambridge University / Tideway Scullers SchoolMike Hart, David Maxwell, Alan Inns (cox) || Wallingford Tony Norris, Doug Richardson||Furnivall SC", "|Men 8+   ||  Tideway Scullers School / LeanderGeorge Proffitt, Eddie Wells, Martin Spencer, Rooney Massara, David Gramolt, Nick Hornsby, Christopher Rodrigues, Graeme Hall, Alan Inns (cox) || London University|| Leander"]}]}}