{"wiki_id": "http://www.wikidata.org/entity/Q5622607", "itemLabel": "Guy Sparrow", "itemDescription": "English cricketer (1877-1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Guy_Sparrow_(cricketer)", "wikipedia_page": {"main": "Guy Ratcliff Sparrow (2 July 1877 – 4 January 1958) was an English cricketer who played for Derbyshire during the 1905 season.\nSparrow was born in Aston, Warwickshire, the son of Walter Sparrow and his wife Emma Gertrude Ratcliff. His father was assistant surgeon to the 9th Warwickshire Rifle Volunteer Corps. Sparrow took part in the Second Boer War as a Private in the 8th Coy, 4th Bn. Imperial Yeomanry.Sparrow made two County Championship appearances for Derbyshire during the 1905 season. In his debut match in June against Northamptonshire he scored 67 in the first innings, and was off the mark with a few runs in his three remaining innings. Sparrow was a right-handed batsman and played 4 innings in 2 first-class matches with an average of 18.75 and a top score of 64.Sparrow died in Burton-on-Trent at the age of 80.", "link_mentions": [{"page": "Derbyshire County Cricket Club in 1905", "response": ["The most significant addition to the Derbyshire squad in the season was George Buckston who though playing only one match in the 1905 season went on to become captain.  Also making their debuts were Frederic Hunter  who played regularly for three years and Herbert Cooper William Taylor and Robert Carlin  who played intermittently over five years. Arthur Hogg, John McDonald and George Walkden played in 1905 and also in 1906. Other players who  made their debut but played only in 1905 were George Maltby three matches, Joseph Cupitt George Marples and Guy Sparrow two matches and William Peach and William Bagguley one match each."]}, {"page": "Guy Sparrow", "response": ["Guy Sparrow may refer to:", "*Guy Sparrow (basketball) (born 1932), former NBA basketball player", "*Guy Sparrow (cricketer) (1877–1958), English cricket player"]}]}}