{"wiki_id": "http://www.wikidata.org/entity/Q563072", "itemLabel": "Anna Reynolds", "itemDescription": "English classical mezzo-soprano", "wikipedia_url": "https://en.wikipedia.org/wiki/Anna_Reynolds_(singer)", "wikipedia_page": {"main": "Anna Reynolds (5 June 1930 – 24 February 2014) was an English classical mezzo-soprano and contralto singer in opera and concert.", "link_mentions": [{"page": "Das Lied von der Erde", "response": ["* Josef Krips, with Anna Reynolds and Jess Thomas, Vienna Symphony (Orfeo C278921B; live recording)"]}, {"page": "The Old Maid and the Thief", "response": ["|Anna Reynolds, John Reardon, Judith Blegen, Margaret Baker"]}, {"page": "Luisa Miller", "response": ["| 1975 || Montserrat Caballe,Luciano Pavarotti,Sherrill Milnes,Anna Reynolds,Bonaldo Giaiotti,Richard van Allan || Peter Maag,London Opera ChorusNational Philharmonic || Audio CD: Arts ArchiveCat: 430882 "]}, {"page": "Alexander Nevsky (Prokofiev)", "response": ["|Anna Reynolds (mezzo-soprano)"]}, {"page": "The Whale (Tavener)", "response": ["It was premiered at the inaugural concert of the London Sinfonietta under David Atherton at the Queen Elizabeth Hall on 24 January 1968. It was heard again at a Proms concert on 1 August 1969, with the same orchestra and conductor, with vocal soloists Anna Reynolds and Raimund Herincx. Also featured were Alvar Lidell as narrator, and the composer playing pipe and hammond organs. In July 1970, The Whale was recorded in Islington, London with the same musicians. It was released as an album by The Beatles' Apple Records label later that year."]}, {"page": "Meine Seufzer, meine Tränen, BWV 13", "response": ["* Bach Cantatas Vol. 1 – Advent and Christmas, Karl Richter, Münchener Bach-Chor, Münchener Bach-Orchester, Edith Mathis, Anna Reynolds, Peter Schreier, Dietrich Fischer-Dieskau, Archiv Produktion 1971"]}, {"page": "Pelléas et Mélisande discography", "response": ["|Henri Gui,Jeannette Pilou,Gabriel Bacquier,Nicola Zaccari,Adriana Martino,Anna Reynolds"]}, {"page": "Bonaldo Giaiotti", "response": ["* 1975 - Verdi - Luisa Miller - Montserrat Caballé, Luciano Pavarotti, Sherrill Milnes, Anna Reynolds, Bonaldo Giaiotti, Richard Van Allan - London Opera Chorus, National Philarmonic Orchestra, Peter Maag - Decca"]}, {"page": "Stabat Mater (Dvořák)", "response": ["* Rafael Kubelik conducting the Bavarian Radio Symphony Orchestra, with Edith Mathis, Anna Reynolds, Wieslaw Ochman, John Shirley-Quirk."]}, {"page": "Ein ungefärbt Gemüte, BWV 24", "response": ["* Bach Cantatas Vol. 3 – Ascension Day, Whitsun, Trinity, Karl Richter, Münchener Bach-Chor, Münchener Bach-Orchester, Anna Reynolds, Peter Schreier, Dietrich Fischer-Dieskau, Archiv Produktion 1975"]}, {"page": "Jesus schläft, was soll ich hoffen? BWV 81", "response": ["* Bach Cantatas Vol. 1 – Advent and Christmas, Karl Richter, Münchener Bach-Chor, Münchener Bach-Orchester, Anna Reynolds, Peter Schreier, Theo Adam, Archiv Produktion 1972"]}, {"page": "Sie werden euch in den Bann tun, BWV 44", "response": ["* Bach Cantatas Vol. 3 – Ascension Day, Whitsun, Trinity, Karl Richter, Münchener Bach-Chor, Münchener Bach-Orchester, Ernst Haefliger, Edith Mathis, Anna Reynolds, Dietrich Fischer-Dieskau, Archiv Produktion 1975"]}, {"page": "Die Meistersinger von Nürnberg discography", "response": ["| 1974 || Karl Ridderbusch, Jean Cox, Klaus Hirte, Frieder Stricker, Hannelore Bode, Anna Reynolds, Hans Sotin || Chor and Orchester der Bayreuther Festspiele under Silvio Varviso || Phillips"]}, {"page": "Das Rheingold discography", "response": ["|Franz Mazura, Donald McIntyre, Anna Reynolds, Hermin Esser, Hannelore Bode, Karl Ridderbusch, Kurt Moll, Gerd Nienstedt, Heribert Steinbach, Marga Höffgen, Heinz Zednik"]}, {"page": "Dido and Aeneas discography", "response": ["|Janet BakerBaker's second recordingNorma BurrowesPeter PearsAnna Reynolds"]}, {"page": "Bogna Bartosz", "response": ["Bogna Bartosz studied voice at the Academy of Music in Gdansk and graduated with distinction. She then studied at the Berlin University of the Arts with Ingrid Figur and in master-classes with Aribert Reimann, Adele Stolte and Anna Reynolds.Bogna Bartosz on Bach Cantatas website"]}, {"page": "List of operas performed at the Wexford Festival", "response": ["|1963 || La Gioconda ||  Ponchielli || Italian || 1876 ||  Gunnar Staern ||  Peter Ebert ||  Reginald Woolley ||  Enriqueta Tarres, Anna Reynolds, Giuseppe Gismondo", "|1963 || The Siege of Rochelle ||  Balfe || English || 1835 || (piano duo accompaniment) || Douglas Craig || Reginald Wooley ||  Patricia McCarry, Franco Ventriglia, Anna ReynoldsPorter, Andrew. The Wexford Festival. Opera, December 1963, Vol.14 No.12 p828-831.", "|1966 || Fra Diavolo ||  Auber || French || 1830 ||  Myer Fredman ||  Dennis Maunder ||  Reginald Woolley || Alberta Valentini, Anna Reynolds, Ugo Benelli, Nigel Douglas"]}, {"page": "Mahler Symphony No. 8 discography", "response": ["|Erna Spoorenberg, Gwyneth Jones, Gwenyth Annear, Anna Reynolds, Norma Procter, John Mitchinson, Vladimir Ruzdjak, Donald McIntyre"]}, {"page": "Siri Thornhill", "response": ["Thornhill studied singing first in her hometown Stavanger with Marit Storækre and continued with a scholarship from the Norwegian government at the Royal Conservatory in The Hague with Marius van Altena, Rita Dams and Diane Forlano. She took master-classes with Cristina Deutekom, Elly Ameling, Ton Koopman, Beata Heuer-Christen, Anna Reynolds and Jean Cox."]}, {"page": "Wer nur den lieben Gott läßt walten, BWV 93", "response": ["* Bach Cantatas Vol. 3 – Ascension Day, Whitsun, Trinity, Karl Richter, Münchener Bach-Chor, Münchener Bach-Orchester, Edith Mathis, Anna Reynolds, Peter Schreier, Dietrich Fischer-Dieskau, Archiv Produktion 1975"]}, {"page": "L'Orfeo discography", "response": ["|Nigel RogersEmilia Petrescu (Euridice and La musica)Anna Reynolds (Messenger and Proserpina)"]}, {"page": "Laura Alonso (soprano)", "response": ["Born in Vilagarcía de Arousa (Galicia, Spain), Alonso earned university diplomas in both singing and the violin in her native country before pursuing further studies in Germany. A scholarship from the Alexander von Humboldt Foundation enabled her to study voice under Aldo Baldin, Anna Reynolds and Jean Cox and lied with Hartmut Höll at the Hochschule für Musik Karlsruhe."]}, {"page": "Verdi Requiem discography", "response": ["|1963 || Philharmonia Orchestra,Philharmonia Chorus,Carlo Maria Giulini || Amy Shuard,Anna Reynolds,Richard Lewis,David Ward || BBC Legends, CD: BBCL 40292 || Live recording made on 7 August at the Royal Albert Hall;Messa da Requiem 7 August 1963 Live London (Royal Albert Hall) at verdisdisco.de rated highest in the 2008 Gramophone Guide"]}, {"page": "Sehet, welch eine Liebe hat uns der Vater erzeiget, BWV 64", "response": ["* Bach Cantatas Vol. 1 – Advent and Christmas, Karl Richter, Münchener Bach-Chor, Münchener Bach-Orchester, Edith Mathis, Anna Reynolds, Dietrich Fischer-Dieskau, Archiv Produktion 1972"]}, {"page": "Amy Shuard", "response": ["* Verdi: Requiem, under Carlo Maria Giulini, with Richard Lewis, Anna Reynolds and David Ward."]}, {"page": "Himmelskönig, sei willkommen, BWV 182", "response": ["* Bach Cantatas Vol. 2 – Easter, Karl Richter, Münchener Bach-Chor, Münchener Bach-Orchester, Alto: Anna Reynolds, Peter Schreier, Theo Adam, Archiv Produktion 1975"]}, {"page": "Er rufet seinen Schafen mit Namen, BWV 175", "response": ["* Bach Cantatas Vol. 3 – Ascension Day, Whitsun, Trinity, Karl Richter, Münchener Bach-Chor, Münchener Bach-Orchester, Anna Reynolds, Peter Schreier, Dietrich Fischer-Dieskau, Cantate 1975"]}, {"page": "Gelobet sei der Herr, mein Gott, BWV 129", "response": ["* Bach Cantatas Vol. 3 – Ascension Day, Whitsun, Trinity, Karl Richter, Münchener Bach-Chor, Münchener Bach-Orchester, Edith Mathis, Anna Reynolds, Peter Schreier, Dietrich Fischer-Dieskau, Archiv Produktion 1975"]}, {"page": "Ach Herr, mich armen Sünder, BWV 135", "response": ["* Bach Cantatas Vol. 3 – Ascension Day, Whitsun, Trinity, Karl Richter, Münchener Bach-Chor, Münchener Bach-Orchester, Anna Reynolds, Peter Schreier, Dietrich Fischer-Dieskau, Archiv Produktion 1975"]}, {"page": "Christen, ätzet diesen Tag, BWV 63", "response": ["* Bach Cantatas Vol. 1 – Advent and Christmas, Karl Richter, Münchener Bach-Chor, Münchener Bach-Orchester. Edith Mathis, Anna Reynolds, Peter Schreier, Dietrich Fischer-Dieskau, Archiv Produktion 1972"]}]}}