{"wiki_id": "http://www.wikidata.org/entity/Q5638991", "itemLabel": "Michael Zev Gordon", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Zev_Gordon", "wikipedia_page": {"main": "Michael Zev Gordon (born 1963, London) is a British composer, of Jewish ancestry.A past oboe player, Gordon studied composition at King's College, Cambridge with Robin Holloway, and subsequently with Oliver Knussen and John Woolrich, and in Italy with Franco Donatoni.  He was a composition pupil of Louis Andriessen from 1989 to 1990. His work has often involved a deep engagement with the subject of memory, with the use of quotation of, or allusion to, other music, sometimes explicit, sometimes more buried. He has himself also spoken of his work in terms of 'turbulence seeking serenity'. Stylistically, this could be seen in the relationship between tonal and more dissonant materials in his music.\nKey works include the oboe concerto The Fabric of Dreams (2006), premiered by Nicholas Daniel and the Britten Sinfonia, The Impermanence of Things for piano, ensemble and electronics (2009), a London Sinfonietta commission, Allele for 40 voices (2010), a project involving the science of genetics, Bohortha  for large orchestra (2012), a BBC Symphony Orchestra commission, Seize the Day (2016), a Birmingham Contemporary Music Group Sound Investment commission, and his Violin Concerto (2017), a BBC Symphony Orchestra commission.\nGordon was the recipient of the Prix Italia 2004 for his composition for radio A Pebble in the Pond, and two British Composer Awards, for Allele and for This Night for choir and solo cello (2009), a commission for the choir of King's College, Cambridge. He has taught at the universities of Durham, Southampton and at the Royal College of Music. Since 2012 he has been Professor of Composition at the University of Birmingham. His music is published on Composer's Edition.", "link_mentions": [{"page": "List of 21st-century classical composers", "response": ["|Michael Zev Gordon || 1963 || || British || ||"]}, {"page": "Nicholas Daniel", "response": ["* The Fabric of Dreams by Michael Zev Gordon (2006) "]}, {"page": "Birmingham Contemporary Music Group", "response": ["2016: Michael Zev Gordon: Seize the Day"]}, {"page": "Michael Gordon", "response": ["* Michael Zev Gordon (born 1963), British composer"]}, {"page": "List of compositions for guitar", "response": ["*2000 Michael Zev Gordon (born 1963) Bells, Lachrimae and Stillness"]}, {"page": "Oboe concerto", "response": ["*Michael Zev Gordon"]}, {"page": "Andrew Zolinsky", "response": ["In the field of contemporary music Zolinsky has worked with Composers' Ensemble, Capricorn, Eos.  Since 1997 has been a member of the British group Icebreaker and with Icebreaker's cellist Audrey Riley and guitarist James Woodrow he has been a member of the multi-media project A Change of Light since 2001. He has worked with composers including Simon Holt, Louis Andriessen, Poul Ruders, Michael Finnissy, Martin Butler and  John Godfrey.  In 2005 he gave the first performance of a new set of pieces specially written for Zolinsky by Michael Zev Gordon.  He has had an especially close relationship with David Lang, who wrote the piano concerto Fur for Zolinsky in 2005.  He has also given the première of Lang's Memory Pieces in 2000 and Psalms without Words in 2003. In 2005 he gave the London premiere, with the BBC Symphony Orchestra and of Unsuk Chin’s Piano Concerto."]}, {"page": "2008 in British music", "response": ["*Choral - Michael Zev Gordon"]}, {"page": "2011 in British music", "response": ["*Choral: Allele – Michael Zev Gordon"]}, {"page": "Cathryn Lewis", "response": ["In 2010, Lewis was part of the \"Music from the Genome\" team which analysed the DNA from 40 members of the New London Chamber Choir. These gene patterns were used to create a choral work, \"Allele\". The music subsequently won Michael Zev Gordon the 2011 British Academy of Songwriters, Composers and Authors Composer of the Year award."]}, {"page": "Matthew Schellhorn", "response": ["He has given world premieres of works by Nicola LeFanu, Ian Wilson and Gráinne Mulvey.Steel-grey splinters (2012), Navona Records His 2009 commission Homage to Haydn from composers Tim Watts, Michael Zev Gordon, Cecilia McDowall, Cheryl Frances-Hoad, Colin Riley, and Jeremy Thurlow was later published in Muso Magazine. His 2014 disc, Ian Wilson: Stations, received positive press, with a four-star review from The Irish Times."]}, {"page": "2016 in British music", "response": ["* Michael Zev Gordon – In the Middle of Things"]}, {"page": "2016 in classical music", "response": ["* Michael Zev Gordon – In the Middle of ThingsSt John's Smith Square, 24 January 2016 programme"]}, {"page": "2017 in British music", "response": ["* Michael Zev Gordon – Violin ConcertoBBC Symphony Orchestra, 3 February 2017 programme"]}, {"page": "2017 in classical music", "response": ["* Michael Zev Gordon – Violin ConcertoBBC Symphony Orchestra, 3 February 2017 programme"]}, {"page": "Daniel Fardon", "response": ["Fardon studied Music at the Royal Birmingham Conservatoire, where his teachers included Howard Skempton and Errollyn Wallen. He went on to study for an MPhil in Composition at the University of Cambridge, where he was tutored by Professor Richard Causton. In 2018, he graduated with a PhD in Composition on the topic of tonality from the University of Birmingham, under the supervision of Professor Michael Zev Gordon. He was the Rosie Johnson Apprentice Composer at the Wigmore Hall during 2018-19. In 2018 he won the Royal Philharmonic Society Composition Prize, and in 2020 he received an Ivor Novello Award for his music. He is currently a visiting teacher at the Purcell School for Young Musicians."]}]}}