{"wiki_id": "http://www.wikidata.org/entity/Q5648714", "itemLabel": "Hanna Mangan-Lawrence", "itemDescription": "Australian actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Hanna_Mangan-Lawrence", "wikipedia_page": {"main": "Hanna Mangan-Lawrence (born 5 March 1991) is an English-Australian actress, best known in Australia for her role as Holly in the drama series Bed of Roses, for which she received an AFI Award nomination in 2008 and a Logie Award nomination in 2009, and internationally as Seppia in the Starz historical drama Spartacus: Vengeance.", "link_mentions": [{"page": "1991 in American television", "response": ["|Hanna Mangan-Lawrence"]}, {"page": "1991 in film", "response": ["* March 5 - Hanna Mangan-Lawrence, English-Australian actress"]}, {"page": "1991 in Australia", "response": ["*5 March – Hanna Mangan-Lawrence, actress"]}, {"page": "Newtown High School of the Performing Arts", "response": ["* Hanna Mangan-Lawrence (2008)actress"]}, {"page": "Catherine McClements", "response": ["| Sexy Thing (film) || 2006 || Mum || Short film – 15 minutes. Also stars Hanna Mangan-Lawrence."]}, {"page": "Bed of Roses (TV series)", "response": ["Bed of Roses is about Louisa Atherton (Kerry Armstrong) handling her life after she discovers her husband has died in the arms of another woman, leaving her broke. She returns to her home town of Rainbow's End to live with her feisty mother, Minna (Julia Blake). Rainbow's End is in a 'growth corridor' with neighbouring town of Indigo. Besides problems with Minna, Louisa encounters trouble with her teenage daughter Holly (Hanna Mangan-Lawrence) and local residents. Louisa has few financial assets except \"Mary Kelly's Shack\" she inherited from her father. Louisa decides to demolish the shack and build a new house to sell. Holly has taken the death of her father very hard and insists on carrying around his ashes. Louisa's irresponsible driving results in numerous traffic offences, which she can ill afford.", "* Hanna Mangan-Lawrence as Holly Atherton, Louisa's daughter, Indigo High year 11 student, works at Lim's.", "| align=\"center\"|Hanna Mangan-Lawrence (for 1x1)", "| align=\"center\"|Hanna Mangan-Lawrence"]}, {"page": "List of Australian films of 2009", "response": ["|Lucky Country || Kriv Stenders || Aden YoungToby WallaceHanna Mangan-LawrenceEamon Farren || Drama || Transmission Films || "]}, {"page": "The Square (2008 film)", "response": ["While the whole town is at the Christmas celebration, Carla sneaks back to the house and takes the money from the duffel bag. However, on return she overhears Smithy phoning his mother and asking her to go to his house (the one Billy is planning to burn down) and feed his dog. Carla alerts Ray who quickly tries to ring Billy, but is only able to reach his sister Lily (Hanna Mangan-Lawrence). With his phone dying, Ray tells Lily to abort the plan but Lily is unable to alert Billy before he leaves. Billy breaks in and sets the fire, unaware of Smithy's mum sleeping on the lounge. Consequently, she dies in the ensuing blaze.", "*Hanna Mangan-Lawrence as Lily"]}, {"page": "Logie Awards of 2009", "response": ["**Hanna Mangan-Lawrence in Bed of Roses (ABC1)"]}, {"page": "List of horror films of 2008", "response": ["| Jon Hewitt || Hanna Mangan-Lawrence, Joshua Payne, Belinda McClory || Australia || "]}, {"page": "2008 Australian Film Institute Awards", "response": ["**Hanna Mangan-Lawrence – Bed of Roses (ABC)"]}, {"page": "List of Spartacus characters", "response": ["| style=\"text-align:center;\"| Hanna Mangan-Lawrence", "* Seppia (Hanna Mangan-Lawrence) - the younger sister of Seppius. She attempts to secure Varinius as a husband until Ilithyia humiliates her inability to torture a captured rebel. After her brother's murder, she moves in with Glaber and Ilithyia. When Ilithyia is captured by Gannicus, she seduces Glaber and becomes his lover. Lucretia tells Seppia the truth about her brother's murder and Seppia tries to kill Glaber. Glaber is saved by Ilithyia, who kills Seppia."]}, {"page": "List of thriller films of the 2010s", "response": ["|X||Jon Hewitt||Viva Bianca, Hanna Mangan-Lawrence, Peter Docker||United States||"]}, {"page": "Thom Green", "response": ["In 2012, Green starred in the Robert Carter drama, Thirst, alongside Hanna Mangan-Lawrence, Myles Pollard and Victoria Haralabidou. Green also performed in his first American production, Halo 4: Forward Unto Dawn, a webseries based on the bestselling series of games."]}, {"page": "AACTA Award for Best Guest or Supporting Actress in a Television Drama", "response": ["| Hanna Mangan-Lawrence"]}, {"page": "Logie Award for Most Outstanding Newcomer", "response": ["| Hanna Mangan-Lawrence"]}, {"page": "Spartacus: Vengeance", "response": ["* Hanna Mangan-Lawrence as Seppia – Seppius' flirtatious younger sister and Gaius' lover."]}, {"page": "Equity Ensemble Awards", "response": ["| Kerry Armstrong, Julia Blake, Richard Davies, Susie Dee, Kaarin Fairfax, Janet Foye, Andrew S. Gilbert, Caroline Gillmer, Jay Laga'aia, HaiHa Le, Amanda Ma, Frank Magree, Lawrence Mah, Hanna Mangan-Lawrence, Cameron McKenzie, Dina Panozza, Tim Phillipps, Philip Quast, Charles Tingwell and Gareth Yuen", "| Kerry Armstrong, Julia Blake, Kaarin Fairfax, Andrew S. Gilbert, Caroline Gillmer, Jay Laga'aia, HaiHa Le, Frank Magree, Hanna Mangan-Lawrence, Matt Levett and Cameron McKenzie"]}, {"page": "Spartacus (TV series)", "response": ["* Hanna Mangan-Lawrence (season 2) as Seppia – younger sister to Seppius."]}, {"page": "List of Australian films of 2012", "response": ["|  Thirst || Robert Carter || Victoria Haralabidou, Myles Pollard, Hanna Mangan-Lawrence || Drama || Imagine Films || "]}, {"page": "Thirst (2012 film)", "response": ["Thirst is an Australian desert drama written and directed by Robert Carter, and starring Victoria Haralabidou, Myles Pollard, Hanna Mangan-Lawrence and Tom Green. Thirst is about four individuals who become stranded in the desert with limited water, and are forced to make choices that challenge their ideas of themselves and what they truly need.", "* Hanna Mangan-Lawrence as Kit"]}, {"page": "Inside the Square", "response": ["*Hanna Mangan-Lawrence as Herself"]}, {"page": "Old School (TV series)", "response": ["* Hanna Mangan-Lawrence as Shannon Cahill"]}, {"page": "The Reckoning (2014 film)", "response": ["The Reckoning is an Australian crime thriller feature film written and directed by John V. Soto and starring Luke Hemsworth, Viva Bianca, Jonathan LaPaglia, Hanna Mangan-Lawrence, and Alex Williams. The film premiered at the British Independent Film Festival in London on 10 May 2014, where it won Best Director and Best Music.", "When Detective Robbie Green (Jonathan LaPaglia) is called in to investigate the murder of his colleague Jason Pearson (Luke Hemsworth), he discovers at the crime scene a SD card from a video camera. The card contains footage shot by two runaway teenagers, Rachel (Hanna Mangan-Lawrence) and AJ (Alex Williams), who are making a documentary about the drug related death of Rachel's sister.", "* Hanna Mangan-Lawrence as Rachel Saunders"]}, {"page": "List of American films of 2015", "response": ["|Jean-Baptiste Léonetti (director); Stephen Susco (screenplay); Michael Douglas, Jeremy Irvine, Hanna Mangan-Lawrence, Ronny Cox"]}, {"page": "X: Night of Vengeance", "response": ["X: Night of Vengeance is a 2011 Australian erotic thriller directed by Jon Hewitt and starring Viva Bianca and Hanna Mangan-Lawrence as a pair of sex workers who witness a murder and must evade the killer (Stephen Phillips) while he chases them through Sydney, Australia."]}, {"page": "Beyond the Reach", "response": ["Beyond the Reach is a 2014 American thriller film directed by Jean-Baptiste Léonetti and written by Stephen Susco. It is based on the 1972 novel Deathwatch by Robb White and stars Michael Douglas, Jeremy Irvine, Hanna Mangan-Lawrence, and Ronny Cox.", "* Hanna Mangan-Lawrence as Laina"]}, {"page": "Containment (TV series)", "response": ["* Hanna Mangan-Lawrence as Teresa Keaton, shop assistant at her mother's grocery store who is heavily pregnant to her boyfriend, Zander."]}, {"page": "Red Dog: True Blue", "response": ["* Hanna Mangan-Lawrence as Betty Marble"]}, {"page": "Sweetheart (2019 film)", "response": ["Sweetheart is a 2019 American survival horror film directed by J. D. Dillard, written by Dillard, Alex Theurer and Alex Hyner, and starring Kiersey Clemons, Emory Cohen, Hanna Mangan-Lawrence and Andrew Crawford. It was produced by Jason Blum, Dillard, Theurer, Hyner and Bill Karesh.", "* Hanna Mangan-Lawrence as Mia Reed", "On February 2, 2017 Blumhouse Productions announced that Kiersey Clemons was starring in the film with J. D. Dillard co-writing, producing and directing.  On May 9, 2017 it was announced that Hanna Mangan-Lawrence, Emory Cohen, and Benedict Samuel would co-star."]}]}}