{"wiki_id": "http://www.wikidata.org/entity/Q5648611", "itemLabel": "Hanlon-Lees", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Hanlon-Lees", "wikipedia_page": {"main": "A group of pre-Vaudevillian acrobats founded in the early 1840s, the Hanlon-Lees were world-renowned practitioners of \"entortillation\" (an invented word based upon the French term  entortillage, which translates to \"twisting\" or \"coiling\") – that is, tumbling, juggling, and an early form of \"knockabout\" comedy (later popularized by such groups as the Marx Brothers and the Three Stooges). The troupe consisted of the six Hanlon brothers and their mentor, established acrobat Professor John Lees.\nOriginally billed as \"The Hanlons,\" the group debuted in 1846 at London's Theatre Royal, Adelphi. At this time, the company consisted of George, William, and Alfred Hanlon, who were essentially wards of John Lees until his death in 1855. After his demise, the Hanlons returned to England and enlisted their younger brothers – Thomas, Edward, and Frederick – and rechristened themselves \"The Hanlon-Lees\" in honor of their fallen friend and instructor.\nThe newly expanded troupe made its American debut in 1858 at Niblo's Garden in New York City, and spent the next four decades touring the United States and Europe. As their skills improved, their performances became more elaborate. When Jules Léotard introduced the trapeze in 1859, for instance, the Hanlon-Lees quickly adapted to the new device; their next production, Le Voyage en Suisse (A Trip to Switzerland) contained an aerial juggling sequence that stunned Émile Zola, who expressed utter astonishment at the vast number of airborne objects.  There is a spectacular poster by Jules Chéret, the great pioneer of the classic era of French poster design, advertising their appearance at the Folies Bergères in 1878. In addition, the company is referred to in J.K. Huysmans chapter: \"The Folies-Bergere in 1879\" in his book Parisian Sketches, first published in France in 1880: \"these side-splitting, yet funereal, clowns, the Hanlon-Lees.\".\nThe Hanlon-Lees also patented several inventions, including the aerial safety net and a wooden brace used in the construction of scenery (which is to this day referred to as a \"hanlon\").\nDespite the death of Thomas in 1868, the group continued to perform regularly until the early 1900s, at which point George Hanlon's sons Will and Fred assumed control of the company's repertoire. They would carry the company successfully into the 20th Century, going so far as to appear on film for Thomas Edison in a production entitled Fantasma. The Hanlons would endure for another four decades, adapting their acts for vaudeville and finally appearing in the 1945 season of the Ringling Brothers and Barnum & Bailey Circus.\nIn 1979, six American performers sought out the final living descendant of the original Hanlon brothers and asked for her blessing upon their new company, dubbed the Hanlon-Lees Action Theater. This modern incarnation of the original troupe is best known for pioneering and refining a theatrical form of medieval jousting, an event which the company continues to perform at Renaissance festivals in the United States. The modern day Hanlon-Lees also perform Western-themed shows such as fantasy rodeos and cowboy exhibitions.", "link_mentions": [{"page": "Pierrot", "response": ["He is sometimes said to be a French variant of the sixteenth-century Italian Pedrolino,Sand,  Duchartre, and Oreglia see a close family resemblance between—if not an interchangeability of—both characters. Mic claims that an historical connection between Pedrolino and \"the celebrated Pierrots of [Adolphe] Willette\" is \"absolutely evident\" (p. 211). Nicoll writes that Pedrolino is the \"Italian equivalent\" of Pierrot (World, p. 88).  As late as 1994, Rudlin (pp. 137-38) renames Pierrot \"Pedrolino\" in a translation of a scene from Nolant de Fatouville's Harlequin, Emperor of the Moon (1684): see Gherardi, I, 179. but the two types have little but their names (\"Little Pete\") and social stations in common.There is no documentation from the seventeenth century that links the two figures. In fact, what documentation does exist links Pierrot, not with Pedrolino, but with Pulcinella. \"Dominique\" Biancolelli, Harlequin of the first Comédie-Italienne in which Pierrot appeared by name, noted that \"The nature of the rôle is that of a Neapolitan Pulcinella a little altered. In point of fact, the Neapolitan scenarii, in place of Arlecchino and Scapino, admit two Pulcinellas, the one an intriguing rogue and the other a stupid fool. The latter is Pierot's  rôle: MS 13736, Bibliothèque de l'Opéra, Paris, I, 113; cited and tr. Nicoll, Masks, p. 294. Both are comic servants, but Pedrolino, as a so-called first zanni, often acts with cunning and daring,thumb|Pedrolino scuffles with the Doctor, 1621.In one of the few extant contemporary illustrations involving Pedrolino—i.e., the frontispiece of Giulio Cesare Croce's Pedrolino's Great Victory against the Doctor Gratiano Scatolone, for Love of the Beautiful Franceschina (1621)—the zanni is shown thrashing the Doctor rather savagely (and, as the title indicates, victoriously). Such aggressive ferocity is almost never to be seen, early or late, in the behavioral repertoire of Pierrot.  Pierrot can be murderous (see \"Shakespeare at the Funambules\" and aftermath below), but he is very rarely pugnacious (as he is in the pantomimes of the Hanlon-Lees). an engine of the plot in the scenarios where he appears.He appears in forty-nine of the fifty scenarios in Flaminio Scala's Il teatro delle favole rappresentative (1611) and in three of the scenarios in the unpublished \"Corsini\" collection. Salerno has translated the Scala scenarios; Pandolfi (V, 252–276) has summarized the plots of the \"Corsini\" pieces. Pierrot, on the other hand, as a \"second\" zanni, is a static character in his earliest incarnations, \"standing on the periphery of the action\",\"Indeed, Pierrot appears in comparative isolation from his fellow masks, with few exceptions, in all the plays of Le Théâtre Italien, standing on the periphery of the action, commenting, advising, chiding, but rarely taking part in the movement around him\": Storey, Pierrot: a critical history, pp. 27-28. dispensing advice that seems to him sage, and courting—unsuccessfully—his master's young daughter, Columbine, with bashfulness and indecision.See the discussion in Storey, Pierrot: a critical history, pp. 22–28.", "thumb|upright|Anon.: Poster for Hanlon-Lees' Superba, 1890–1911.  Theatre Collection of the New York Public Library at Lincoln Center.", "But French mimes and actors were not the only figures responsible for Pierrot's ubiquity: the English Hanlon brothers (sometimes called the Hanlon-Lees), gymnasts and acrobats who had been schooled in the 1860s in pantomimes from Baptiste's repertoire, traveled (and dazzled) the world well into the twentieth century with their pantomimic sketches and extravaganzas featuring riotously nightmarish Pierrots. The Naturalists—Émile Zola especially, who wrote glowingly of them—were captivated by their art.See Cosdon, p.49. Edmond de Goncourt modeled his acrobat-mimes in his The Zemganno Brothers (1879) upon them; J.-K. Huysmans (whose Against Nature [1884] would become Dorian Gray's bible) and his friend Léon Hennique wrote their pantomime Pierrot the Skeptic (1881) after seeing them perform at the Folies Bergère. (And, in turn, Jules Laforgue wrote his pantomime Pierrot the Cut-Up [Pierrot fumiste, 1882] after reading the scenario by Huysmans and Hennique.)On the influence of the Hanlons on Goncourt and Huysmans and Hennique, see Storey, Pierrots on the stage, pp. 182–188, 217–222; on the influence of Huysmans/Hennique on Laforgue's pantomime, see Storey, Pierrot: a critical history, p. 145, 154. It was in part through the enthusiasm that they excited, coupled with the Impressionists' taste for popular entertainment, like the circus and the music-hall, as well as the new bohemianism that then reigned in artistic quarters like Montmartre (and which was celebrated by such denizens as Adolphe Willette, whose cartoons and canvases are crowded with Pierrots)—it was through all this that Pierrot achieved almost unprecedented currency and visibility towards the end of the century.", "In 1895, the playwright and future Nobel laureate Jacinto Benavente wrote rapturously in his journal of a performance of the Hanlon-Lees,. and three years later he published his only pantomime: The Whiteness of Pierrot.  A true fin-de-siècle mask, Pierrot paints his face black to commit robbery and murder; then, after restoring his pallor, he hides himself, terrified of his own undoing, in a snowbank—forever.  Thus does he forfeit his union with Columbine (the intended beneficiary of his crimes) for a frosty marriage with the moon.", "Pierrot and his fellow masks were late in coming to the United States, which, unlike England, Russia, and the countries of continental Europe, had had no early exposure to commedia dell'arte.It is in part for this reason—that Pierrot was a late and somewhat alien import to America—that the early poems of T.S. Eliot that were closely modeled on the Pierrot poems of Jules Laforgue do not allude to Pierrot by name.  See Storey, Pierrot: a critical history, pp. 156-67. The Hanlon-Lees made their first U.S. appearance in 1858, and their subsequent tours, well into the twentieth century, of scores of cities throughout the country accustomed their audiences to their fantastic, acrobatic Pierrots.For an exhaustive account of the Hanlons' appearances in America (and elsewhere), see Mark Cosdon, \"A Chronological Outline of the Hanlon Brothers, 1833-1931\". But the Pierrot that would leave the deepest imprint upon the American imagination was that of the French and English Decadents, a creature who quickly found his home in the so-called little magazines of the 1890s (as well as in the poster-art that they spawned). One of the earliest and most influential of these in America, The Chap-Book (1894–98), which featured a story about Pierrot by the aesthete Percival Pollard in its second number,\"For a Jest's Sake\" (1894). was soon host to Beardsley-inspired Pierrots drawn by E.B. Bird and Frank Hazenplug.See reproductions (in poster form) in Margolin, pp. 110, 111. (The Canadian poet Bliss Carman should also be mentioned for his contribution to Pierrot's dissemination in mass-market publications like Harper's.)Carman's \"The Last Room. From the Departure of Pierrot\" appeared originally in the August 1899 number of Harper's; it is reprinted (as \"The Last Room\") in  Like most things associated with the Decadence, such exotica discombobulated the mainstream American public, which regarded the little magazines in general as \"freak periodicals\" and declared, through one of its mouthpieces, Munsey's Magazine, that \"each new representative of the species is, if possible, more preposterous than the last.\"Summer issue, 1896; cited in Margolin, p. 37.  And yet the Pierrot of that species was gaining a foothold elsewhere.  The composers Amy Beach and Arthur Foote devoted a section to Pierrot (as well as to Pierrette, his Decadent counterpart) in two ludic pieces for piano—Beach's Children's Carnival (1894) and Foote's Five Bagatelles (1893).", "The Pierrot bequeathed to the twentieth century had acquired a rich and wide range of personae. He was the naïve butt of practical jokes and amorous scheming (Gautier); the prankish but innocent waif (Banville, Verlaine, Willette); the narcissistic dreamer clutching at the moon, which could symbolize many things, from spiritual perfection to death (Giraud, Laforgue, Willette, Dowson); the frail, neurasthenic, often doom-ridden soul (Richepin, Beardsley); the clumsy, though ardent, lover, who wins Columbine's heart,This is the case in many works by minor writers of the fin-de-siècle—e.g., Léo Rouanet, The Belly and Heart of Pierrot (1888), summarized in Storey, Pierrots on the stage, pp. 299–300. or murders her in frustration (Margueritte); the cynical and misogynistic dandy, sometimes dressed in black (Huysmans/Hennique, Laforgue); the Christ-like victim of the martyrdom that is Art (Giraud, Willette, Ensor); the androgynous and unholy creature of corruption (Richepin, Wedekind); the madcap master of chaos (the Hanlon-Lees); the purveyor of hearty and wholesome fun (the English pier Pierrots)—and various combinations of these. Like the earlier masks of commedia dell'arte, Pierrot now knew no national boundaries. Thanks to the international gregariousness of Modernism, he would soon be found everywhere.See Green and Swan."]}, {"page": "Hanlon-Lees, The", "response": ["#REDIRECT Hanlon-Lees"]}, {"page": "W. S. Penley", "response": ["In 1879, at the Royalty, Penley played Grinder in a revival of B. C. Stephenson and Arthur Sullivan's The Zoo in a bill in which he also played the wicked Jellicoe in Crutch and Toothpick by George R Sims.\"The London Theatres\", The Era, 20 April 1879, p. 12 He then rejoined D'Oyly Carte, playing Sir Joseph Porter in H.M.S. Pinafore on tour in 1879.\"Provincial Theatricals,\" The Era, 12 October 1879, p. 7; and The Sheffield & Rotherham Independent, 14 October 1879, p. 2 The theatrical newspaper The Era said of him, \"Mr. W. S. Penley seems to be designed both by nature and art for the onerous part of the 'First Lord', the mock dignity of whose 'official' utterances Mr. Penley brings out splendidly.\"\"Provincial Theatricals\", The Era, 19 October 1879, p. 7 In March 1880 he appeared at the Gaiety Theatre, London as Matthew Popperton in the extravaganza La voyage en Suisse, with the Hanlon-Lees comic acrobatic troupe.\"The London Theatres\", The Era, 4 April 1880, pp. 3–4 When the troupe went to the US, Penley accompanied them."]}, {"page": "Hanlon-Lees Action Theater", "response": ["Hanlon-Lees Action Theater is an American entertainment company credited with the development of theatrical jousting. The company was formed in 1979 by partners Kent Shelton, Robin Wood, Richard \"Dikki\" Ellis, R. Vincent Park, Taso N. Stavrakis, and Stephen \"Omms\" Ommerle.", "Inspired by the 19th century Hanlon-Lees - a troupe of pre-Vaudevillian acrobatic performers - the young partners conducted thorough research into the background of their Victorian counterparts and recreated many of their stunts and patented theatrical apparatus (for example, a device capable of simulating an onstage decapitation) for modern usage. Vince Park managed to locate the final surviving descendant of the original Hanlons and received her blessing to continue using the moniker \"Hanlon-Lees;\" Omms is generally credited with the invention of the addendum \"Action Theater.\"", "Early off-Broadway theatrical performances by the new Hanlon-Lees included an original Three Musketeers show entitled The Queen's Diamonds (featuring another friend from North Carolina, Terrence Mann who would shortly afterwards be prominently cast in Cats) and a comedic free-for-all, Etched In Stone. The group alternated these infrequent stage productions with appearances at the New York Renaissance Faire, where their primary attraction was a tournament of knightly skills culminating in a mounted jousting match.", "These early shows centered upon the training of a squire who would, over the course of a three-act program, be challenged to a joust and win his knighthood from the King. While other medieval festivals featured historically authentic jousting re-enactments (usually featuring combatants chosen at random and separated by a tilt rail), the Hanlon-Lees were the first performers to incorporate a choreographed joust and ground battle into a scripted dramatic performance.", "* Website promoting Renaissance Men, a documentary film on the Hanlon-Lees"]}, {"page": "The Bewitched Inn", "response": ["The Bewitched Inn was likely inspired by the Hanlon-Lees, a British troupe of acrobats popular in Europe in the 1880s. The Hanlon-Lees, describing themselves as \"Entortilationists\", specialized in spectacular high-energy comedy acts in which they cavorted and bounced manically across the stage, often leaping through hidden trapdoors in the set. In one routine, a guest in a candlelit inn was first tormented by his shoes coming to life, and then chased around the stage by demons. Other Méliès films bearing the mark of the Hanlon-Lees' inspiration include The Inn Where No Man Rests and The Diabolic Tenant. Another inspiration for The Bewitched Inn probably came from a popular and influential 1839 féerie, Les Pilules du Diable, which included a scene in a haunted room."]}, {"page": "Cercle Funambulesque", "response": ["thumb|Anon.: poster for Hanlon-Lees' Superba (1890-1911).  Theatre Collection of the New York Public Library at Lincoln Center.", "It would be the self-assumed task of one of those brothers, Paul Margueritte, to revive the pantomime.  In 1882, Paul sent his just-published Pierrot assassin de sa femme (Pierrot, Murderer of His Wife), a pantomime he had devised the previous year for the audiences of his amateur theatricals in Valvins, to several writers, hoping to renew interest in the genre.Paul Margueritte, p. 77.  It apparently found a receptive spirit in Jean Richepin, whose Pierrot assassin, also a pantomime, appeared at the Trocadéro in 1883.Storey (1985), p. 283.  (It would hardly go unnoticed: Sarah Bernhardt was its titular Pierrot.)  And other forces were at work to promote the pantomime with the general public.  In 1879, the Hanlon-Lees, a troupe of English acrobatic mimes, had performed to great acclaim at the Folies-Bergère, inspiring J.-K. Huysmans, the Naturalistic novelist and future creator of the arch-aesthete Des Esseintes, to collaborate on a pantomime with his friend Léon Hennique.O.R. Morgan, \"Huysmans, Hennique et 'Pierrot sceptique'\", Bulletin de la Société J.-K. Huysmans, No. 46 (1963), 103; cited in Storey (1985), pp. 217-218.  Their Pierrot sceptique (Pierrot the Skeptic, 1881) presented its readers with a dandified Pierrot even more savage than Margueritte's or Richepin's assassin: for he not only murders his tailor and executes a mannikin he has lured to his chambers, but also sets fire to the rooms themselves to obliterate all evidence of his crimes.A fairly detailed synopsis in English can be found in Storey (1985), pp. 219-221.  Such waggish ferocity delighted the young Jules Laforgue, who, upon reading the pantomime, produced his own Pierrot fumiste (Pierrot the Cut-up, 1882), in which Pierrot is guilty of similar (if not homicidal) enormities.See Storey (1978), pp. 145, 154."]}, {"page": "Richard Risley Carlisle", "response": ["As a circus performer, Carlisle is known for establishing the Risley act; he is noted as being the first to perform this act in the Guinness Book of World Records. The act involves the performer lying on his or her back on a chair and juggling children with the feet, an act also used by the Hanlon-Lees and others.Cosdon, Mark. The Hanlon Brothers: From Daredevil Acrobatics to Spectacle Pantomime, 1833-1931. Southern Illinois University Press, 2009: 10.  It has alternatively been referred to as the \"Risley business\"Picton, Col. Tom. Old Gotham Theatricals. San Bernardino, CA: The Borgo Press, 1995: 155.  or the \"Risley stunt\".Law, Jonathan. The Methuen Drama Dictionary of the Theatre. London: Market House Books, 2011: 4.  Carlisle developed this act as early as 1840–1841. The act has since come to refer to juggling anything with the feet while lying on one's back."]}, {"page": "Hanlon Brothers", "response": ["#REDIRECT Hanlon-Lees"]}]}}