{"wiki_id": "http://www.wikidata.org/entity/Q5648736", "itemLabel": "Hanna Sheehy-Skeffington", "itemDescription": "Irish feminist & nationalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Hanna_Sheehy-Skeffington", "wikipedia_page": {"main": "Johanna Mary \"Hanna\" Sheehy Skeffington (née Sheehy; 24 May 1877 – 20 April 1946) was a suffragette and Irish nationalist. Along with her husband Francis Sheehy Skeffington, Margaret Cousins and James Cousins, she founded the Irish Women's Franchise League in 1908 with the aim of obtaining women's voting rights. She was later a founding member of the Irish Women Workers' Union. Her son, Owen Sheehy-Skeffington became a politician and Irish Senator.\nHer sister Mary married the writer and politician Thomas Kettle. Another sister, Kathleen, married Frank Cruise O'Brien, and was the mother of Conor Cruise O'Brien. The fourth of the sisters, Margaret, married a solicitor, John Culhane, and later the poet Michael Casey. Their two brothers worked as lawyers.", "link_mentions": [{"page": "Constance Markievicz", "response": ["Markievicz died at the age of 59 on 15 July 1927, of complications related to appendicitis. She had given away the last of her wealth, and died in a public ward \"among the poor where she wanted to be\". One of the doctors attending her was her revolutionary colleague, Kathleen Lynn. Also at her bedside were Casimir and Stanislas Markievicz, Éamon de Valera and Hanna Sheehy-Skeffington. Refused a state funeral by the Free State government, she was buried at Glasnevin Cemetery, Dublin, where de Valera gave the funeral oration."]}, {"page": "HM Prison Holloway", "response": ["Before the first world war, Holloway was used to imprison those suffragettes who broke the law. These included Emmeline Pankhurst, Emily Davison, Constance Markievicz (also imprisoned for her part in the Irish Rebellion), Charlotte Despard, Mary Richardson, Dora Montefiore, Hanna Sheehy-Skeffington, and Ethel Smyth.", "For decades, British campaigners had argued for votes for women. It was only when a number of suffragists, despairing of change through peaceful means, decided to turn to militant protest that the \"suffragette\" was born. These women broke the law in pursuit of their aims, and many were imprisoned at Holloway for their criminal activity. They were not treated as political prisoners, the authorities arguing they were imprisoned for their vandalism, not their opinions. In protest, some went on hunger strike and were force fed so Holloway has a large symbolic role in the history of women's rights in the UK for those in sympathy with the movement. Suffragettes imprisoned there include Emmeline Pankhurst, Emily Davison, Violet Mary Doudney, Katie Edith Gliddon, Isabella Potbury, Evaline Hilda Burkitt, Georgina Fanny Cheffins, Constance Bryer, Florence Tunks, Janie Terrero, Doreen Allen, Bertha Ryland, Katharine Gatty, Charlotte Despard, Janet Boyd, Genie Sheppard, Mary Ann Aldham, Mary Richardson, Muriel and Arabella Scott, Alice Maud Shipley, Katherine Douglas Smith, Dora Montefiore, Christabel Pankhurst, Hanna Sheehy-Skeffington, Leonora Tyson, Ethel Smyth and the American Alice Paul. Detainees later received the Holloway brooch. In 1912 the anthem of the suffragettes - \"The March of the Women\", composed by Ethel Smyth with lyrics by Cicely Hamilton - was performed there."]}, {"page": "Kanturk", "response": ["* Hanna Sheehy-Skeffington (1877–1946), suffragette and author"]}, {"page": "Rathmines", "response": ["*Hanna Sheehy-Skeffington, suffragette and Irish nationalist, lived in 11 Grosvenor Place Rathmines"]}, {"page": "1946 in Ireland", "response": ["*20 April – Hanna Sheehy-Skeffington, feminist, suffragette and writer (born 1877)."]}, {"page": "1908 in Ireland", "response": ["* 11 November – The Irish Women's Franchise League was formed, with Hanna Sheehy-Skeffington as secretary."]}, {"page": "Hanna Sheehy", "response": ["#REDIRECT Hanna Sheehy-Skeffington"]}, {"page": "An Phoblacht", "response": ["A year later the paper merged with a Dublin publication called The Peasant. However, the title An Phoblacht was again used from 1925 with Patrick Little (P.J Little) as editor and continued until 1937 with a tumultuous history of internal splits and constant suppression by the government.  From 1925 into 1926, Seán Lemass wrote a number of articles advocating engagement in politics prior to the establishment of Fianna Fáil. Peadar O'Donnell took over as editor in April 1926 following a split in the Irish republican movement (Little became one of the founding members of Fianna Fáil). Frank Ryan also edited the paper for some time; other prominent contributors during this time included Maurice Twomey, Seán MacBride, Frank Gallagher (who became the first editor of The Irish Press), Hanna Sheehy-Skeffington and Fr Michael O'Flanagan. The title appeared again in 1966 as the paper of a small IRA splinter group based in Cork.Public Record Office of Northern Ireland Minister of Home Affairs file HA 32/2/13 - \"Sinn Fein and Republican Clubs 1958-68\""]}, {"page": "Frenchpark", "response": ["A distant cousin of the de Freynes was Charlotte Despard (née French) (1844–1939), a scion of the French family of High Lake, a British-born, later Irish-based suffragist, novelist and Sinn Féin activist.French family cousinage on-line Despard spent a lot of time at French Park where her father was born. In 1908 she joined with Hanna Sheehy-Skeffington and Margaret Cousins to form the Irish Women’s Franchise League. She urged members to boycott the 1911 Census and withhold taxes and provided financial support to workers during the Dublin labour disputes."]}, {"page": "Francis Sheehy-Skeffington", "response": ["On 26 June 1903Leah Levenson, With Wooden Sword: a portrait of Francis Sheehy-Skeffington, Northeastern U. Press, 1983, p. 40 he married Hanna Sheehy, a teacher at the Rathmines College of Commerce (a forerunner of Dublin Institute of Technology). They jointly adopted the surname \"Sheehy Skeffington\". Hanna's family were a prosperous farming and milling family in County Cork, and her father had been a Nationalist MP, and had been imprisoned no less than six times for revolutionary activities.Thomas O'Riordan, \"Hanna Sheehy-Skeffington\" , Multitext Project in Irish History, University College Cork, accessed 30 March 2016."]}, {"page": "List of suffragists and suffragettes", "response": ["*Hanna Sheehy-Skeffington – founder-member of the Irish Women's Franchise League"]}, {"page": "Royal University of Ireland", "response": ["*Hanna Sheehy-Skeffington – BA (1899), MA (1902)"]}, {"page": "Owen Sheehy-Skeffington", "response": ["Owen Lancelot Sheehy-Skeffington (19 May 1909 – 7 June 1970) was an Irish university lecturer and senator. The son of pacifists, feminists and socialists Francis and Hanna Sheehy-Skeffington, he was politically likeminded and as a member of the Irish Senate was praised as a defender of civil liberty, Democracy, separation of Church and State, freedom of speech, women's rights, minority rights and many other libertarian values.", "Sheehy-Skeffington was brought up in Dublin, Ireland. His father, Francis Sheehy-Skeffington, was a Pacifist, Feminist and Socialist whose execution by firing squad, on the orders of Captain J.C. Bowen-Colthurst, during the week of the Easter Rising in 1916, became a cause célèbre. His mother was the suffragette Hanna Sheehy-Skeffington who founded the Irish Women's Franchise League. His maternal grandfather was David Sheehy, a longstanding member of Parliament for the Irish Parliamentary Party."]}, {"page": "Kathleen Clarke", "response": ["In 1930 she was elected to the re-constituted Dublin Corporation for Fianna Fáil along with Robert Briscoe, Seán T. O'Kelly, Thomas Kelly and Oscar Traynor. She served as the first Fianna Fáil Lord Mayor of Dublin, and the first female Lord Mayor,Eight Women of the Easter Rising The New York Times, March 16, 2016  from 1939 to 1941.Clarke, p.293 She opposed the Constitution of Ireland as she felt that several of its sections would place women in a lower position that they had been afforded in the Proclamation of the Irish Republic. Following correspondence with Hanna Sheehy-Skeffington, she made her feelings public in the press.Clarke, pp.301-2. She was criticised by many in the Fianna Fáil as a result and, while she resigned from the Thomas Clarke Cumann she remained a member of the Fianna Fáil Ard Chomhairle (national executive committee).Clarke, pp.302-4 She had previously opposed the Conditions of Employment Bill in the Seanad in 1935. While she did not support the IRA bombing campaign in England during World War II she appealed for IRA men sentenced to death by the Irish courts to be granted clemency.Clarke, pp.307-10 Ultimately this would lead to her breaking with the party completely after her term as Lord Mayor had finished in 1941.Clarke, pp.310-1. She also opposed the perceived centralisation of local government and the increased power of County and City Managers which had been introduced by Seán MacEntee. She declined to stand as a Fianna Fáil candidate at the 1943 general election. She helped found the Irish Red Cross while Lord Mayor of Dublin."]}, {"page": "Charlotte Despard", "response": ["In 1908 Despard joined Hanna Sheehy-Skeffington, Margaret Cousins and other feminists to form the Irish Women's Franchise League. She urged members to boycott the 1911 Census and withhold taxes and provided financial support to workers during the 1913 Dublin Lock Out. "]}, {"page": "Loughmore", "response": ["*Hanna Sheehy-Skeffington, feminist, suffragette, activist"]}, {"page": "Patricia Lynch", "response": ["Patricia Lynch worked as a freelance journalist in her late teens and early twenties. Her article \"Scenes from the rebellion\", written for a suffragette paper, The Workers' Dreadnought gave an eye-witness account of the events of the 1916 Easter Rising in Dublin. She was politically-active, and spoke at suffrage rallies. She was friends with Maud Gonne, Constance Markievicz, Hanna Sheehy-Skeffington, and with the Fabian writer, Edith Nesbit. "]}, {"page": "Hannah (name)", "response": ["* Hanna Sheehy-Skeffington (1877–1946), Irish feminist, wife of Francis Sheehy-Skeffington"]}, {"page": "Burials in Glasnevin Cemetery", "response": ["* Hanna Sheehy-Skeffington – founder of Irish Women's Franchise League"]}, {"page": "Skeffington (disambiguation)", "response": ["* Hanna Sheehy-Skeffington,  (1877-1946) suffragette and Irish nationalist"]}, {"page": "1877 in Ireland", "response": ["*26 May – Hanna Sheehy-Skeffington, feminist, suffragette and writer (died 1946)."]}, {"page": "Harry Kernoff", "response": ["Born in London, Kernoff moved to Dublin and became a leading figure in Irish modernism. Influenced by Seán Keating, Kernoff painted the Irish landscape, genre scenes, and portraits.  In 1930, Kernoff visited the Soviet Union as part of an Irish delegation from the friends of Soviet Russia led by Hanna Sheehy-Skeffington.  While visiting, he was influenced by the Association  of Artists of Revolutionary Russia.  Kernoff is famously associated with Davy Byrne's pub. His paintings and woodcuts of Davy Byrne's pub are documents of his friendship with the original owner."]}, {"page": "List of atheists in politics and law", "response": ["* Hanna Sheehy-Skeffington (1877–1946): Suffragist and nationalist.\"She had been a militant nationalist among the pacifist internationalist feminists, a republican among the free staters, a feminist among the nationalists, and an atheist in holy Ireland.\" Sybil Oldfield, 'Skeffington, Johanna Mary Sheehy- (1877–1946)', Oxford Dictionary of National Biography, Oxford University Press, 2004 (accessed May 2, 2008)."]}, {"page": "Suffragette", "response": ["* Hanna Sheehy-Skeffington"]}, {"page": "James Gralton", "response": ["Following this, on 9 February 1933, he was served with a deportation order to return the United States of America, on the basis that he was an alien. Gralton went on the run while demanding a fair trial. Some Republicans such as Peadar O'Donnell and George Gilmore came to his aid, but others did not. The local IRA unit opposed his deportation  but took little active measures to stop it. There has even been speculation it was members of the local IRA themselves who burnt down Gralton's hall, seeing him as too radical even for the IRA. The IRA in 1933 did not wish to be identified as communist, particular as the Cumann na nGaedhael party were trying to use red scare tactics against both Fianna Fáil and the IRA. The IRA army council forbade the socialists Frank Ryan and Mick Price from campaigning in Leitrim on Gralton's behalf. Peadar O'Donnell travelled to Drumsna in Leitrim for a public meeting in support of Gralton but was violently attacked by locals led by the parish priest. Another group of socialists led by Hanna Sheehy-Skeffington came down from Dublin to support Gralton, however BJ Maguire a Fianna Fáil TD for Leitrim came out against Gralton for \"propagating English ideas\". Local members of Fianna Fáil and trade unions were divided over Gralton.    "]}, {"page": "Irish Race Conventions", "response": ["In America, the Hindu German Conspiracy Trial had just ended, revealing the link between Clan na Gael and the defendants. Public relations and selecting the convention chairman were therefore unusually important. This also caused an immediate division between John Devoy, who proposed the moderate Father Hurton, being mindful of the \"hostile press\", and Hanna Sheehy-Skeffington and Jim Larkin who proposed the more combative John Forrest Kelly.New York Times article on pdf; link from here The convention ended with an address by Judge Goff to President Wilson, which was considered to be mild and conciliatory: \"to take such measures as are best calculated to bring about the independence of Ireland\"."]}, {"page": "League for Small and Subject Nationalities", "response": ["At a controversial meeting held in October 1917, the League was accused of pro-German bias when the issue of Alsace-Lorraine was due to be discussed. The Irish delegation was represented by Hanna Sheehy-Skeffington of Sinn Féin, who was also accused of sympathies for Germany."]}, {"page": "Máire Ní Chinnéide", "response": ["Máire Ní Chinnéide  (English Mary or Molly O'KennedyProceedings of the Harvard Celtic Colloquium, 29: 2009 p202 Kassandra Conley, Erin Boon, Margaret Harrison – 2011 \"... were Ireland's well-known, first-wave feminists Mary Hayden and Hanna Sheehy-Skeffington, and leading cultural nationalists Una Ni Fhaircheallaigh [ Agnes O'Farrelly] and the aforementioned Maire Ni Chinneide [Molly O'Kennedy].\") (17 January 1879 – 25 May 1967) was an Irish language activist, playwright, first President of the Camogie Association and first woman president of Oireachtas na Gaeilge.", "Máire was born in Rathmines in 1879 and attended Muckross Park College and Royal University (later the NUI) where she was a classmate of Agnes O'Farrelly, Helena Concannon, and Hanna Sheehy-Skeffington."]}, {"page": "Sheehy", "response": ["* Francis Sheehy-Skeffington, born Francis Skeffington (1878–1916), Irish writer and political activist, husband of Hanna Sheehy-Skeffington", "* Hanna Sheehy-Skeffington, born Hanna Sheehy (1877–1946), Irish nationalist and women's activist, wife of Francis Sheehy-Skeffington", "* Owen Sheehy-Skeffington (1909–1970), Irish university lecturer and Senator, son of Francis and Hanna Sheehy-Skeffington"]}, {"page": "Hannah Sheehy-Skeffington", "response": ["#REDIRECT Hanna Sheehy-Skeffington"]}]}}