{"wiki_id": "http://www.wikidata.org/entity/Q5644879", "itemLabel": "Hamilton Clarke", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Hamilton_Clarke", "wikipedia_page": {"main": "James Hamilton Siree Clarke (25 January 1840 – 9 July 1912), better known as Hamilton Clarke, was an English conductor, composer and organist.  Although Clarke was a prolific composer, he is best remembered as an associate of Arthur Sullivan, for whom he arranged music and compiled overtures for some of the Savoy Operas, including Gilbert and Sullivan's The Mikado.\nClarke began as an organist, pianist and theatre conductor, becoming a musical director for Gilbert and Sullivan, among others.  While conducting at London theatres, he also composed a tremendous volume of church music, organ solos, songs, operettas and orchestral works.  Beginning in the late 1870s, he composed incidental music as musical director for many of Henry Irving's spectacular productions at the Lyceum Theatre.  He also composed music for many of the German Reed Entertainments and conducted at many other London theatres in the 1870s and 1880s.  Clark published a Manual of Orchestration and music criticism, as well as some fiction.  In 1889, he took charge of the Victorian National Orchestra in Australia, returning to England in 1892 and soon becoming conductor of the Carl Rosa Opera Company for several years.", "link_mentions": [{"page": "Gilbert and Sullivan", "response": ["Those Sullivan wrote himself include the overtures to Thespis, Iolanthe, Princess Ida, The Yeomen of the Guard, The Gondoliers and The Grand Duke. Sullivan's authorship of the overture to Utopia, Limited cannot be verified with certainty, as his autograph score is now lost, but it is likely attributable to him, as it consists of only a few bars of introduction, followed by a straight copy of music heard elsewhere in the opera (the Drawing Room scene). Thespis is now lost, but there is no doubt that Sullivan wrote its overture.Rees, Terence. Thespis – A Gilbert & Sullivan Enigma. London (1964): Dillon's University Bookshop, p. 79. Very early performances of The Sorcerer used a section of Sullivan's incidental music to Shakespeare's Henry the VIII, as he did not have time to write a new overture, but this was replaced in 1884 by one executed by Hamilton Clarke.Ainger, p. 140 Of those remaining, the overtures to H.M.S. Pinafore and The Pirates of Penzance are by Alfred Cellier,Ainger, pp. 157 and 177 the overture to Patience is by Eugene d'Albert, The overtures to The Mikado and Ruddigore are by Hamilton Clarke (although the Ruddigore overture was later replaced by one written by Geoffrey Toye).Stone, David (2001), \"Hamilton Clarke\", Who Was Who in the D'Oyly Carte Opera Company, The Gilbert and Sullivan Archive, accessed 14 July 2008"]}, {"page": "Die Fledermaus", "response": ["It was performed in New York under Rudolf Bial at the Stadt Theatre on 21 November 1874. The German première took place at Munich's Gärtnerplatztheater in 1875. Die Fledermaus was sung in English at London's Alhambra Theatre on 18 December 1876, with its score modified by Hamilton Clarke.The Observer, 4 May 1930, p. 14: interview with ROH archivist Richard Northcott in connection with revival of  conducted by Bruno Walter"]}, {"page": "The Mikado", "response": ["* Overture (Includes \"Mi-ya Sa-ma\", \"The Sun Whose Rays Are All Ablaze\", \"There is Beauty in the Bellow of the Blast\", \"Braid the Raven Hair\" and \"With Aspect Stern and Gloomy Stride\") This was arranged, under Sullivan's direction, by Hamilton Clarke.Hughes, pp. 131–32"]}, {"page": "Ruddigore", "response": ["*Original Overture (arranged by Hamilton Clarke,Hulme, David Russell. \"Ruddigore: an Investigation of Musical Sources\", Ruddygore (ed. David Eden), Sir Arthur Sullivan Society, 1987; and Ruddigore scholarly edition (ed.) David Russell Hulme (2000), pp. viii–xi includes \"I once was as meek\", \"Oh, why am I moody and sad?\", \"Welcome, gentry\", \"The battle's roar is over\" and \"When a man has been a naughty Baronet\")", "* Geoffrey Toye, the D'Oyly Carte musical director for the first London revival in 1921, supplied a new overture to replace the original overture arranged by Hamilton Clarke."]}, {"page": "H.M.S. Pinafore", "response": ["In late August 1878, Sullivan used some of the Pinafore music, arranged by his assistant Hamilton Clarke, during several successful promenade concerts at Covent Garden that generated interest and stimulated ticket sales.Ainger, p. 162 By September, Pinafore was playing to full houses at the Opera Comique. The piano score sold 10,000 copies,Jones, p. 6 and Carte soon sent two additional companies out to tour in the provinces.Stedman, p. 163"]}, {"page": "Savoy opera", "response": ["|rowspan=2|Hamilton Clarke"]}, {"page": "The Sorcerer", "response": ["The Sorcerer opened on 17 November 1877 at the Opera Comique, preceded by Dora's Dream, a curtain-raiser composed by Sullivan's assistant Alfred Cellier, with words by Arthur Cecil, a friend of both Gilbert's and Sullivan's.Ainger, p. 140  Busy with last-minute cuts and changes the day before the show opened, Sullivan had no time to write an overture and used the \"Graceful Dance\" music from his incidental music to Henry VIII, together with a few measures of music from \"Oh Marvellous Illusion\", as an overture.  For the 1884 revival, an overture was composed by Sullivan's assistant, Hamilton Clarke.  Gilbert's meticulous rehearsal of the cast was noticed and commented on favourably by the critics, and the opening-night audience was enthusiastic.Ainger, p. 141  The Sorcerer ran for 178 performances, making a profit.Ainger, pp. 147–48  A touring company also began playing the opera in March 1878.Ainger, p. 152. In the touring company, Rosina Brandram played Lady Sangazure, and J. H. Ryley was Wells. D'Oyly Carte continued touring the piece in the early 1880s.Moss, Simon. \"Gilbert & Sullivan\".  Theatre programmes of The Sorcerer with details on exhibition at the C20th.com archive, accessed 26 August 2010  Unauthorised productions played on Broadway and elsewhere in the U.S. beginning by 1879.The Sorcerer at the IBDB Database, accessed 26 August 2010Kanthor, Harold. \"Gilbert and Sullivan: From London to America\". An exhibition of historical items, University of Rochester, accessed 26 August 2010 The original London sets were by W. Beverly, and costumes were by C. Wilhelm.Rollins and Witts, Appendix, p. VII", "The opera was extensively revised for the 1884 revival. An overture was arranged by Sullivan's assistant, Hamilton Clarke, to replace Sullivan's \"graceful dance\" from his incidental music to Henry VIII. The length of time between the acts was altered from a half-hour to twelve hours, and the Act II opening was rewritten.Bradley (1996), pp. 66 and 84 Act II originally started off with a patter chorus, \"Happy are we in our loving frivolity\", a pageant of mismatched couples. The revision changed the setting to nighttime, with a mysterioso trio for Alexis, Aline and John Wellington Wells to sing among the sleeping villagers.Bradley (1996), p. 84 The villagers then awaken with a rustic chorus in West Country accent and pair up in the mismatched couples.Bradley (1996), p. 86"]}, {"page": "Edmond Audran", "response": ["Audran's music met with as much favour in England as in France, and all but a few of his works were given in English adaptations in London theatres. The most successful of Audran's many comic operas were: Le grand mogol (Marseille, 1877; Paris, 1884; London, as The Grand Mogul, 1884 with a libretto by Farnie, starring Florence St. John, Fred Leslie and Arthur Roberts;The Times, 19 November 1884, p. 6 New York as The Snake Charmer, 1881);\"Edmond Audran\". The Guide to Light Opera & Operetta, accessed 10 July 2010  La mascotte (Paris, 1880; New York, 1881;\"The Drama in America\", The Era, 25 June 1881, p. 4 London, as The Mascotte, 1881 with a libretto by Farnie, and cast including Lionel Brough and  Henry Bracy);\"Last Night's Theatricals\", Reynolds's Newspaper, 16 October 1881, p. 8 Gillette de Narbonne (Paris, 1882; London, as Gillette, 1883, libretto by H. Savile Clarke, with additional music by Walter Slaughter and Hamilton Clarke);\"Royalty Theatre\", The Daily News, 21 November 1883, p. 6 La cigale et la fourmi (the grasshopper and the ant) (Paris, 1886; London, as La Cigale, 1890; English version by F. C. Burnand, starring Geraldine Ulmar, Eric Lewis and Brough);\"Lyric Theatre\", The Times, 10 October 1890, p. 7 Miss Helyett (Paris, 1890; London, as Miss Decima, 1891, libretto by Burnand);\"The London Theatres\", The Era, 26 July 1891, p. 7 and La poupée (Paris, 1896; London, 1897, libretto by Arthur Sturgess, starring Courtice Pounds and Willie Edouin).The London Theatres, The Era, 27 February 1897, p. 9"]}, {"page": "Carl Rosa Opera Company", "response": ["Carl Rosa died suddenly in Paris, on 30 April 1889, and was buried in Highgate Cemetery, London.The Manchester Guardian, 3 May 1889, p. Two years before his death, Rosa had turned his opera enterprise into a limited company, and it was in good financial and artistic shape at the time of his death.  Hamilton Clarke was appointed conductor of the company in 1893.The Manchester Guardian, 24 June 1893, p. 3Stone, David. \"Hamilton Clarke\",  Who Was Who in the D'Oyly Carte Opera Company, 15 October 2001 In 1897, the company gave the first British performance of Puccini's La bohème in Manchester under the supervision of the composer.\"Theatre Royal\", The Manchester Guardian, 23 April 1897, p. 6. The work in its English translation was entitled \"The Bohemians\". The company then gave a season at Covent Garden, at reduced prices, aimed at attracting \"the masses\" to opera.\"On the Foreign Stage:Carl Rosa Opera Company Has a Successful Run at Covent Garden\", The New York Times, 31 October 1897, p. 11, accessed 14 October 2009"]}, {"page": "German Reed Entertainments", "response": ["After the retirement of Thomas, in 1871 his son Alfred German Reed (1846-1895), also an actor, carried on the business in partnership with his mother and then with Grain.  In 1874 they moved the entertainments to the St. George's Hall, Regent Street, and the German Reeds also took the entertainments on provincial tours.  In 1874, Leonora Braham (who created several of the soprano heroine roles in the Savoy Operas in the 1880s) joined the German Reeds.  Fanny Holland's husband Arthur Law also joined the company and wrote, as well as acted in, many of the entertainments.  Some of Law's pieces for the Gallery included Enchantment, A Night Surprise, A Happy Bungalow (1877), Cherry Tree Farm (1881)The Times, 2 June 1881, p. 8 and Nobody’s Fault (1882), both with music by Hamilton Clarke,Review of Nobody’s Fault  All at Sea (1881)St George's Hall, Langham Place, Regent Street, London\", at the ArthurLloyd theatres website and The Head of the Poll (1882), composed by Eaton Faning, which received good reviews.\"The German Reed Entertainment\", The Standard, 2 March 1882, p. 3; \"Mr and Mrs German Reed's Entertainment\", The Era, 4 March 1882, p. 13; and \"Mr and Mrs German Reed's Entertainment\", The Morning Post, 6 March 1882, p. 2"]}, {"page": "Thomas German Reed", "response": ["Reed became the lessee of St. George's Hall in 1867, and there he initially produced and conducted The Contrabandista by Arthur Sullivan and F. C. Burnand, The Beggar's Opera and other English operas in small-scale productions, as well as non-musical plays. Around the same time, at the Gallery of Illustration, he presented works with libretti by, among others, W. S. Gilbert, William Brough, Gilbert à Beckett, Robert Reece and Arthur Law. His composers included Frederic Clay, George Macfarren, Alfred Cellier and Hamilton Clarke as well as Sullivan and Reed himself. He wrote the scores for more than a dozen of the entertainments, and is described by the museum curator Fredric Woodbridge Wilson as \"an imaginative and effective writer of music for the stage\". Little of Reed's music survives. A few individual songs were published, but the scores of the entertainments were not. The autograph of the music for Our Island Home is preserved in The Morgan Library & Museum, New York, but no other scores are known to be extant."]}, {"page": "Little Jack Sheppard", "response": ["Little Jack Sheppard is a burlesque melodrama written by Henry Pottinger Stephens and William Yardley, with music by Meyer Lutz, with songs contributed by Florian Pascal,Florian Pascal was a pseudonym for Joseph Williams, Jr. (1847-1923), a music publisher and composer.  See Florian Pascal profile at the Gilbert and Sullivan Archive , \"A Thirty-ninth Garland of British Light Music Composers\" at MusicWeb International and Songs by Florian Pascal  Corney Grain, Arthur Cecil, Michael Watson, Henry J. Leslie, Alfred Cellier and Hamilton Clarke.  The comedy lampooned the serious plays based on the life of Jack Sheppard, especially the popular 1839 play by John Buckstone, which was in turn based on the novel of that year by William Harrison Ainsworth.", "*A Fairy Tale (Duet) – Hamilton Clarke"]}, {"page": "Arthur Law (playwright)", "response": ["Some of Law's plays for the German Reeds include A Night Surprise in 1877 (under the pseudonym, \"West Cromer\"), A Happy Bungalow (1877), with music by Charles King Hall; Cherry Tree Farm (1881)The Times, 2 June 1881, p. 8 and Nobody’s Fault (1882), both with music by Hamilton Clarke.Review of Nobody’s Fault   In 1881, he wrote Uncle Samuel, a curtain raiser for the D'Oyly Carte Opera Company played at the Opera Comique, with music by George Grossmith.  It played, together with Patience, in 1881, and Law appeared in the role of John Bird.  Law later appeared on stage at the Savoy Theatre as Mr. Wranglebury in the companion piece Mock Turtles in 1882, and as Major Murgatroyd in Patience in 1882, filling in for Frank Thornton.Stone, David. Arthur Law, Who Was Who in the D’Oyly Carte Opera Company, 27 August 2001, accessed 15 February 2013"]}, {"page": "Trial by Jury", "response": ["|nowrap rowspan=2|Royalty Theatre||25 March 1875||11 June 1875||rowspan=2 align=center|131||rowspan=2|This company also played matinées at the Gaiety Theatre on 10 April, 17 April, and 24 April 1875. The theatre closed from 13 June through 10 October while the company took Trial by Jury and other operas on a provincial tour. Trial then continued as an afterpiece to French operettas at the Royalty, with Charles Morton as manager and Hamilton Clarke as musical director.Rollins and Witts, p. 1"]}, {"page": "The Outpost (opera)", "response": ["The Outpost is an opera or operetta by the composer Hamilton Clarke with a libretto by A. O'D. Bartholeyns.  The story is an adaptation of the Singspiel Der vierjährige Posten by Theodor Körner with music by Franz Schubert.Walters, Michael and George Low. \"The Outpost\". Curtain Raisers, The Gilbert and Sullivan Archive, 25 April 2008, accessed 8 May 2010Schubert set Körner's libretto to music in 1815, but the piece was not performed until 1869, when it was staged at the Hofoper, Dresden.  See: Klassika  (German reference site)", "The piece was one of Clarke's last compositionsStone, David. \"Hamilton Clarke\",  Who Was Who in the D'Oyly Carte Opera Company, 15 October 2001, accessed 12 May 2010 following several operettas that he had composed for the German Reeds.Scowcroft Philip L. \"A Twentieth Garland of British Light Music Composers\". MusicWeb International, accessed 8 May 2010  It premiered at the Savoy Theatre from 2 July 1900 to 3 November 1900 as a companion piece to the Gilbert and Sullivan opera The Pirates of Penzance, for the second London revival of Pirates, and also played from 10 November 1900 to 7 December 1900 as a companion piece to Patience, a total of 131 performances.  After this, the work was performed on tour from late 1901 through 1902 as a companion piece to Pirates, Patience and Iolanthe.", "Category:Operas by Hamilton Clarke"]}, {"page": "Albert O'Donnell Bartholeyns", "response": ["As a translator, he adapted Tasso's Aminta as a pastoral play for English performance (music by Henry Gadsby),\"Secular Choral Music\", The Times, 29 December 1903, p. 9 and Goldoni's La Locandiera as Our Hostess, presented at the Theatre Royal Kilburn in 1897.The Era, 1 May 1897, p. 8 His original stage work included a one-act musical piece, A la Française, written with the composer Meyer Lutz in 1893,\"Slashes and Puffs\", Fun, 19 July 1893, p. 22 and a biographical play Swift and Vanessa about Dean Swift in 1904.\"Dramatic Notes\", Academy and Literature, 16 January 1904, p. 77 For the D'Oyly Carte Opera Company, he adapted Theodor Körner's libretto Der vierjährige Posten as The Outpost, with music by Hamilton Clarke, premiered at the Savoy Theatre in July 1900.Walters, Michael and George Low. \"The Outpost\" . Curtain Raisers, The Gilbert and Sullivan Archive, 25 April 2008, accessed 8 May 2010"]}, {"page": "Auguste van Biene", "response": ["Van Biene soon earned enough money to buy a cello from the Italian cellist Alfredo Piatti, which he used until 1905. He learnt to conduct and to direct theatre productions. In 1878 he succeeded Hamilton Clarke as musical director for Richard D'Oyly Carte's Comedy Opera Company in touring productions of The Sorcerer and H.M.S. Pinafore.Rollins and Witts, pp. 29–30  Carte's former co-directors of the company mounted a rival version of H.M.S. Pinafore in London for which van Biene was the conductor, and which lasted 91 performances.Rollins and Witts, p. 6 He eventually formed his own opera company, and by the 1880s he had become a theatrical manager as well as an actor and playwright, writing and performing under the name \"Henri Tempo\". Among his successes as manager were provincial tours of English adaptations of light operas, such as Farnie and Chassaigne's Falka, and Victorian burlesques, such as Lutz, Sims and Pettitt's Faust up to Date and Carmen up to Data.\"Mr. Auguste Van Biene\", The Times, 24 January 1913, p. 9 As a cellist he was highly enough regarded to be invited to be an examiner at the Royal Academy of Music in 1884.\"Royal Academy of Music\", The Times, 22 December 1884, p. 13"]}, {"page": "Monte Cristo Jr.", "response": ["Monte Cristo Jr.  was a Victorian burlesque with a libretto written by Richard Henry, a pseudonym for the writers Richard Butler and Henry Chance Newton. The score was composed by Meyer Lutz, Ivan Caryll, Hamilton Clarke, Tito Mattei, G. W. Hunt and Henry J. Leslie. The ballet and incidental dances were arranged by John D'Auban, and the theatre's musical director, Meyer Lutz, conducted.Theatre Programme for Monte Cristo Jr. (1887) at the Gaiety Theatre, London The play's doggerel verse was loosely based on The Count of Monte Cristo by Alexandre Dumas.Bordman, Gerald and Richard Norton. American Musical Theatre: A Chronicle, Oxford University Press (4th edition, 2011), p. 110"]}, {"page": "Le coeur et la main", "response": ["Two rival productions of the opera were seen in New York in February 1883, under the titles Hand and Heart and Micaëla. There were two further revivals in New York in 1883 and 1884. The work was not seen in London until ten years after its Paris premiere. It was presented in a heavily revised form as Incognita in October 1892. F. C. Burnand revised the book, Harry Greenbank wrote new lyrics, and there were musical contributions from Isaac Albéniz in Act II, and Hamilton Clarke, Alfred Moul and the conductor of the production, Herbert Bunning, in Act III.Clark, p. 85"]}, {"page": "Gillette de Narbonne", "response": ["The piece was given in London in an adaptation by Henry Savile Clarke at the Royalty Theatre on 19 November 1883.\"New Pieces\", The Era Almanack (1884), p. 59 The plot was bowdlerised to accommodate Victorian British sensibilities: the disguised Gillette merely trysts with her husband, and obtains the ring with no hint of the bedroom. Kate Santley was praised in the title role, but the rest of the cast was judged thoroughly inadequate. Audran's music was mildly praised, but critics thought it fell short of his score for La mascotte. Additional music by Walter Slaughter and Hamilton Clarke was added.\"The Royalty\", The Era, 24 November 1883, p. 6; \"Royalty Theatre\", The Daily News, 21 November 1883, p. 6; and \"A New Comic Opera\", The Pall Mall Gazette, 21 November 1883, p. 4 The production closed within a month.\"Theatres\", The Times, 10 December 1883, p. 8 The piece did better in Berlin, where Gillette von Narbonne ran well in 1884–1885.\"Germany\", The Morning Post, 2 January 1885, p. 5"]}, {"page": "Charles Childerstone", "response": ["He created the minor role of the Physician-in-Chief in Sullivan's last completed opera, The Rose of Persia (1899–1900) at the Savoy Theatre, where he also Henry in Hamilton Clarke's The Outpost, which played there July to November 1900 as a companion piece to a revival of The Pirates of Penzance; it also played from November to December 1900 as a companion piece to Patience. When The Outpost closed Childerstone returned to the chorus for The Emerald Isle (1901) until he took over from Powis Pinder as Private Perry later in that production. In 1901 he married Mary Muir née McGee (1871–1944). Their son was Clifford Louis Muir Childerstone (1903–1978).Westminster, London, England, Church of England Marriages and Banns, 1754–1935 for Charles Childerstone, St Clement Danes, 1896–1909: Ancestry.com  "]}, {"page": "Henry Savile Clarke", "response": ["Clarke took up writing in London and within a year or two was listed in advertising for Cassell's Magazine, where he was described as one of its \"well-known\" contributors. He gradually became known as a journalist on various subjects, while writing light literature and the books and lyrics for musicals. This career was to last for about 25 years. In 1878 he wrote the words for Songs of Israel to the music of Abraham Saqui (c. 1824–1893), the first choirmaster of the Princes Road Synagogue in Liverpool. Other works by Clarke include lyrics for the operetta An Adamless Eden! (1882) and for Lila Clay and her all-female troupe.An Adamless Eden: comic opera di camera / the words by H. Savile Clarke ; the music by Walter A. Slaughter, University of Rochester Libraries. He also wrote the English adaptation of Gillette de Narbonne, which opened at London's Royalty Theatre on 19 November 1883, with additional music by Walter Slaughter and Hamilton Clarke.\"The Royalty\", The Era, 24 November 1883, p. 6; \"Royalty Theatre\", The Daily News, 21 November 1883, p. 6; \"A New Comic Opera\", The Pall Mall Gazette, 21 November 1883, p. 4. The production was not a success and closed within a month.\"Theatres\", The Times, 10 December 1883, p. 8."]}, {"page": "British Orchestral Society", "response": ["The music was drawn from composers of all nations, but several new works by native writers were given for the first time, including George Alexander Macfarren's overture to St John the Baptist (1873); John Francis Barnett's overture to Shakespeare's The Winter's Tale (1873), written for the Society; Hamilton Clarke's Saltarello (1874); Alfred Holmes's overture to Inez de Castro (1874); Henry Gadsby's overture The Witches' Frolic (1874); and Thomas Wingham's Symphony in B flat (1875)."]}]}}