{"wiki_id": "http://www.wikidata.org/entity/Q5646507", "itemLabel": "Hamza Riazuddin", "itemDescription": "English cricketer (born 1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hamza_Riazuddin", "wikipedia_page": {"main": "Hamza Riazuddin (Urdu: حمزہ ریاض الدین; born 19 December 1989) is a former English cricketer. He is a right-handed lower-order batsman and a right-arm medium-fast bowler who last played for Hampshire. He is a British Pakistani. He was born in Hendon and lived in Woodley, Berkshire for most of his childhood but now lives in Southampton, Hampshire, near to the club's training ground.\nThroughout his childhood, he played for Hurst Cricket Club and he also captained several age-group Berkshire County Cricket Club cricket teams.\nRiazuddin is a product of the Hampshire cricket academy. Having played his first game for the Hampshire Second XI against a Victoria team at the age of 15, he played semi-regularly in the 2006 and 2007 Second XI Championship, and in the ECB Under-17 Regional Festival.\nHaving made a single Second XI appearance in 2008, Riazuddin's first-class debut came in May, in a match against Somerset. He took one wicket, that of Ian Blackwell in the first innings, and was the most economical bowler in a second innings in which Somerset amassed a large score. His only contribution with the bat was four runs in the first innings.\nHis one-day debut came in the Friends Provident Trophy in a victory against Glamorgan about two weeks later.\nHe was selected for the England Under-19 squad to tour South Africa in January 2009.\nHe was a member of Hampshires 2009 Friends Provident Trophy winning squad. This came just a few weeks after being named Captain of the England Under-19 squad.", "link_mentions": [{"page": "December 19", "response": ["*  1989   – Hamza Riazuddin, English cricketer"]}, {"page": "Simon Jones (cricketer)", "response": ["In January 2011, Jones played for Hampshire in the 2011 Caribbean Twenty20, a tournament which Hampshire were invited to take part in.  He played all of Hampshire's fixtures in the tournament, including the final against Trinidad and Tobago, which Hampshire lost.  Jones was the competition's joint leading wicket-taker, along with teammate Hamza Riazuddin, with 12."]}, {"page": "Woodley, Berkshire", "response": ["* Hamza Riazuddin, Hampshire cricketer"]}, {"page": "List of England cricket captains", "response": ["| 40 || Hamza Riazuddin || 2009 || Bangladesh || England || 2 || 1 || 0 || 1"]}, {"page": "British Asian", "response": ["* Hamza Riazuddin"]}, {"page": "List of British Pakistanis", "response": ["* Hamza Riazuddin – English cricketer; right-handed lower-order batsman and a right-arm medium-fast bowler who currently plays for Hampshire"]}, {"page": "Riazuddin", "response": ["*Hamza Riazuddin (born 1989), English cricketer"]}, {"page": "2010–11 Caribbean Twenty20", "response": ["| Hamza Riazuddin ||  Hampshire || 12 || 6 || 10.08 || 11.5 || 5.26 || 4/15", "| Hamza Riazuddin ||  Hampshire || 4.0 || 4/15 ||  Windward Islands || Kensington Oval, Bridgetown, Barbados"]}, {"page": "List of British Muslims", "response": ["* Hamza Riazuddin – English cricketer, right-handed lower-order batsman and a right-arm medium-fast bowler who plays for Hampshire"]}, {"page": "2012 Champions League Twenty20 squads", "response": ["|style=\"text-align:center\"| 38 || Hamza Riazuddin ||style=\"text-align:center\"|  ||  || Right || Right-arm fast-medium"]}, {"page": "List of Old Bradfieldians", "response": ["*Hamza Riazuddin (born 1989), English cricketer"]}]}}