{"wiki_id": "http://www.wikidata.org/entity/Q5643094", "itemLabel": "Ted Briggs", "itemDescription": "British naval officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ted_Briggs", "wikipedia_page": {"main": "Albert Edward Pryke \"Ted\" Briggs  (1 March 1923 – 4 October 2008) was a British seaman and the last of the three survivors of the destruction of the battlecruiser HMS Hood. He remained in the Royal Navy after the Second World War and was later commissioned.", "link_mentions": [{"page": "HMS Hood", "response": ["Just before 06:00, while Hood was turning 20° to port to unmask her rear turrets, she was hit again on the boat deck by one or more shells from Bismarcks fifth salvo, fired from a range of approximately .Jurens, et al., p. 4 A shell from this salvo appears to have hit the spotting top, as the boat deck was showered with body parts and debris.Taylor, p. 221 A huge jet of flame burst out of Hood from the vicinity of the mainmast,According to the testimony of Captain Leach, \"... between one and two seconds after I formed that impression [of a hit on Hood] an explosion took place in the Hood \" (Jurens, p. 131) followed by a devastating magazine explosion that destroyed the aft part of the ship. This explosion broke the back of Hood, and the last sight of the ship, which sank in only three minutes, was her bow, nearly vertical in the water. A note on a survivor's sketch in the British RN Historical Branch Archives gives  as the position of the sinking. Hood sank stern first with 1418 men aboard. Only three survived: Ordinary Signalman Ted Briggs (1923–2008), Able Seaman Robert Tilburn  (1921–1995), and Midshipman William John Dundas (1923–1965). The three were rescued about two hours after the sinking by the destroyer , which spotted substantial debris but no bodies.Taylor, p. 224", "* The fire on the boat deck penetrated to a magazine. Evidence given to the second board indicated that the doors for the 4-inch ammunition supply trunks were closed throughout the action. It remains possible that a door or trunk could have been opened up by an enemy shell, admitting flames to the magazine. Alternative routes for admission of flame could have been the ventilation or venting arrangements of the magazines or, as Ted Briggs suggested, through the floor of a 15-inch gunhouse.Jurens 1987, pp. 152–153", "In 2001, British broadcaster Channel 4 commissioned shipwreck hunter David Mearns and his company, Blue Water Recoveries, to locate the wreck of Hood, and if possible, produce underwater footage of both the battlecruiser and her attacker, Bismarck. This was to be used for a major event documentary to be aired on the 60th anniversary of the ships' battle.Mearns, p. 75 This was the first time anyone had attempted to locate Hoods resting place.Mearns, p. 76 Mearns had spent the previous six years privately researching the fate of Hood with the goal of finding the battlecruiser, and had acquired the support of the Royal Navy, the HMS Hood Association and other veterans groups, and the last living survivor, Ted Briggs.", "* Obituary of Ted Briggs – last survivor."]}, {"page": "Battle of the Denmark Strait", "response": ["This was followed by an explosion that destroyed a large portion of the ship from amidships clear to the rear of \"Y\" turret, blowing both after turrets into the sea. The ship broke in two and the stern fell away and sank. Ted Briggs, one of the survivors, claimed Hood heeled to 30 degrees at which point 'we knew she just wasn't coming back'. The bow rose clear of the water, pointed upward, pivoted about and sank shortly after the stern. \"A\" turret fired a salvo while in this upright position, possibly from the doomed gun crew, just before the bow section sank.", "Splinters rained down on Prince of Wales  away. Hood sank in about three minutes with 1,415 members of the crew. Only Ted Briggs, Bob Tilburn and Bill Dundas survived to be rescued two hours later by the destroyer ."]}, {"page": "Lancelot Holland", "response": ["At about 05:35, the German forces were sighted by the Hood and, shortly afterwards, the Germans sighted the British ships.  In the ensuing Battle of the Denmark Strait the Hood suffered a catastrophic magazine explosion at 06:01 that broke the ship in half; the admiral and all but three of the crew of 1,418 were lost. One of the survivors, Ted Briggs, later stated he last saw Holland sitting in his admiral's chair, in utter dejection, making no attempt to escape from the sinking wreck.Hood and Bismarck by David Mearns and Rob White"]}, {"page": "1923 in the United Kingdom", "response": ["* 1 March – Ted Briggs, World War II sailor (died 2008)"]}, {"page": "2008 in the United Kingdom", "response": ["** Ted Briggs, World War II sailor, last survivor of the sinking of HMS Hood (born 1923)"]}, {"page": "Index of World War II articles (T)", "response": ["# Ted Briggs"]}, {"page": "Deaths in October 2008", "response": ["*Ted Briggs, 85, British sailor, last survivor of the sinking of ."]}, {"page": "Edward Briggs", "response": ["* Ted Briggs (Albert Edward Pryke Briggs, 1923–2008), British seaman and last survivor of the destruction of the battlecruiser HMS Hood"]}, {"page": "List of last survivors of historical events", "response": ["|Ted Briggs"]}, {"page": "Portal talk:Battleships", "response": ["::::::(7x edit conflict) Since we are including battlecruisers in this scope, we should look for some guys from those articles as well. I know that Ted Briggs is an obvious candidate, but their must surely be others out there. TomStar81 (Talk) 04:14, 18 February 2010 (UTC)"]}, {"page": "Briggs (surname)", "response": ["*Ted Briggs (1923–2008), British seaman, survivor of HMS Hood"]}, {"page": "The captain goes down with the ship", "response": ["* May 24, 1941: During the Battle of the Denmark Strait,  suffered a direct hit and magazine explosion, which sank the ship in three minutes. Only three people survived the disaster. One of the survivors, Ted Briggs, said in interviews after the sinking that Vice Admiral Holland was last seen sitting in his chair, in utter dejection, making no attempt to escape from the sinking ship. "]}, {"page": "List of last surviving veterans of military operations", "response": ["|Ted Briggs"]}]}}