{"wiki_id": "http://www.wikidata.org/entity/Q5649235", "itemLabel": "William Rickatson Dykes", "itemDescription": "English botanist (1877–1925)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Rickatson_Dykes", "wikipedia_page": {"main": "William Rickatson Dykes (4 November 1877 – 1 December 1925) was an English amateur botanist who became an expert in the field of iris breeding and wrote several influential books on the subject. He was also interested in tulips, amaryllis, and other plants.", "link_mentions": [{"page": "Iris ser. Longipetalae", "response": ["William Rickatson Dykes in his book 'Handbook of Garden Irises' (of 1924) includes 4 species in his Iris longipetala subsection; including Iris longipetala (Herbert), Iris missouriensis Nuttall, Iris arizonica (Dykes, 1917) and Iris montana (Nuttall). Iris arizonica and Iris montana have since been classified as synonyms of Iris missouriensis."]}, {"page": "Dykes (surname)", "response": ["*William Rickatson Dykes (1877–1925), an amateur botanist who became an expert in the field of iris breeding"]}, {"page": "Victoria Medal of Honour", "response": ["** William Rickatson Dykes (1827–1925)"]}, {"page": "Iris lacustris", "response": ["It is a close relative to Iris cristata, the only other crested iris native to North America. However, unlike it, Iris lacustris is found only in small areas of the Great Lakes region that have been glacier-free for only 11,000 years. It was once thought to be a form of Iris cristata, (by William Rickatson Dykes in 1913 and other authors), later chromosomal studies confirmed the two were separate species."]}, {"page": "William Dykes", "response": ["*William Rickatson Dykes (1877–1925), English botanist (mainly Irises)"]}, {"page": "Iris confusa", "response": ["In 1911, William Rickatson Dykes obtained seeds from Pere Ducloux, a French missionary (1864-1945), who had found specimens of the iris in Yunnan. Dykes later compared the plants (he grew) in 1915, with specimens in the Kew Gardens Herbarium, and thought they were similar to Iris wattii, and so were a form of Iris wattii."]}, {"page": "Veitch Memorial Medal", "response": ["* 1924 : William Rickatson Dykes (1877-1925);Ray Desmond  Mr J. Hoog  Lilian Snelling 1879–1972)(silver medal)"]}, {"page": "List of botanists by author abbreviation (D)", "response": ["* Dykes – William Rickatson Dykes (1877–1925)"]}, {"page": "List of Wadham College, Oxford people", "response": ["* William Rickatson Dykes, botanist", "* William Rickatson Dykes, schoolteacher and plant breeder"]}, {"page": "Iris variegata", "response": ["Between 1800 and 1850, several Iris breeders (including Lémon, Jacques and Salter), started breeding border irises for the garden. These irises were all the progeny of two species, Iris pallida and Iris variegata. It was William Rickatson Dykes who worked out that these were the parents of most hybrids, especially those bi-coloured hybrids. These new irises were known as 'Tall Bearded Irises'.} In the wild, hybrids of Iris pallida and Iris variegata are very similar to Iris germanica."]}, {"page": "Iris setosa", "response": ["It was first published by Link (based on an earlier description by Pallas) in 'Jahrbücher der Gewächskunde' (translated as 'Yearbook of Greenhouse'). (Berlin and Leipzig) in 1820. It was originally described from specimens found in east Siberia. It was then published in William Rickatson Dykes (Iris 1913 p. 92) as 'Iris Brachycuspis', which later regarded as a synonym. In 1824, it was also published as 'Iris brachycuspsi' by Fisch. ex Sims in the Botanical Magazine, which is also now regarded as a synonym."]}]}}