{"wiki_id": "http://www.wikidata.org/entity/Q5668406", "itemLabel": "Harry Dexter", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Dexter", "wikipedia_page": {"main": "Harry Dexter (1910–1973) was an English music critic and a composer of light music best known for his \"Siciliano\" of 1953.\nHe was born in Sheffield and obtained a Bachelor of Music degree at Durham University. During World War II, whilst serving overseas as an army captain he composed a prize-winning symphony, but after the war he found himself without work and moved to London where he scraped a living \"song plugging\" and arranging for various publishers.During the 1950s, his lighter style of composition found favour with tastes in radio and television, particularly the BBC Light Programme. It has been said that one of his pieces was used as the signature-tune for the original Maigret series for BBC Television in 1960, although the credit for the theme tune and background music goes to composer Ron Grainer. He joined London music publisher Francis, Day and Hunter and later rose to become head of their light orchestral department, where in addition to composing gave advice to other composers in this field.It was during this period he composed numerous short orchestral pieces include \"Frankfurt Polka\", \"Bavarian Polka\", \"Budgerigar Polka\", \"Pas de Trois\", \"Pizzicato Playtime\", \"Waltz for a Bride\", \"September Woods\" and his most famous work \"Siciliano\" in 1953. He also wrote vocal pieces for schools, ballads for choral ensembles and a number of religious anthems, as well as large quantity of simplified arrangements of famous classical works for use in teaching.In addition to this work, Dexter was music critic for several musical periodicals and in 1956 founded the Light Music Society, where he served as Chairman for several years, with Eric Coates as its first President. His final composition was \"Pizzicato for a Poodle\" in 1972.He married Doris Herbert with whom he had a son Philip, and a stepson Francis.", "link_mentions": [{"page": "Anthony Collins (composer)", "response": ["* Valse Lente, orch. Harry Dexter, extracted from Odette (1950)"]}, {"page": "1973 in British music", "response": ["*date unknown - Harry Dexter, music critic and composer of light music, 63"]}, {"page": "Dexter (name)", "response": ["*Harry Dexter (1910–1973), English composer and arranger"]}, {"page": "Chas. H. Hansen Music Corp.", "response": ["* Harry Dexter"]}]}}