{"wiki_id": "http://www.wikidata.org/entity/Q566658", "itemLabel": "John Boardman", "itemDescription": "British classical archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Boardman_(art_historian)", "wikipedia_page": {"main": "Sir John Boardman,  (; born 20 August 1927) is a classical archaeologist and art historian. He has been described as \"Britain's most distinguished historian of ancient Greek art.\"", "link_mentions": [{"page": "Agesilaus II", "response": ["*D. M. Lewis, John Boardman, Simon Hornblower, M. Ostwald (editors), The Cambridge Ancient History, vol. VI, The Fourth Century B.C., Cambridge University Press, 1994."]}, {"page": "Magna Graecia", "response": ["The term Magna Graecia first appears in Polybius' Histories.Polybius, ii. 39.A. J. Graham, \"The colonial expansion of Greece\", in John Boardman et al., Cambridge Ancient History, vol. III, part 3, p. 94. The Roman poet Ovid notably referred to the south of Italy as such in his poem Fasti.", "*John Boardman, N. G. L. Hammond (editors), The Cambridge Ancient History, vol. III, part 3, The Expansion of the Greek World, Eighth to Sixth Centuries B.C., Cambridge University Press, 1982."]}, {"page": "Chinese dragon", "response": ["According to an art historian John Boardman, depictions of Chinese Dragon and Indian Makara might have been influenced by Kētos in Greek Mythology possibly after contact with silk-road images of the Kētos as Chinese dragon appeared more reptilian and shifted head-shape afterwards."]}, {"page": "Cetus (mythology)", "response": ["Art historian John Boardman conjectured that images of the kētos in Central Asia influenced depictions of the Chinese Dragon and Indian makara. They suggest that after contact with Silk Road images of the kētos, the Chinese dragon appeared more reptilian and shifted head-shape; the Pig dragon with the head of a boarNational Gallery of Art, \"Jade coiled dragon, Hongshan Culture (c. 4700–2920 B.C.)\" , Washington, D.C., Retrieved on 09-10-2021. compared to the reptilian head of modern dragons that of a camel."]}, {"page": "List of archaeologists", "response": ["*John Boardman (born 1927) British; Classical archaeology, especially Greek architecture"]}, {"page": "Cleomenes I", "response": ["* John Boardman et al., The Cambridge Ancient History, volume IV, Persia Greece, and the Eastern Mediterranean, from c. 525 to 479 B.C., Cambridge University Press, 1988. "]}, {"page": "Amphictyonic league", "response": ["Historians have puzzled over the broader meanings of \"alliance\" in such early times. \"But comparatively large-scale associations lead more readily to contacts, to friendships and enmities at a distance than do little city-like units,\" George Forrest notes,Forrest, \"Greece: The history of the archaic Period\", in John Boardman, Jasper Griffin and Oswyn Murray, Greece and the Hellenistic World (Oxford University Press, 1986) 1988:14f. remarking apropos that Phrygia and Assyria were at war with each other about 720–710, raising tensions among interested Greeks."]}, {"page": "Polycrates", "response": ["In the mid-sixth century, there seems to have been a period of civil strife in Samos. This strife is mentioned by Herodotus in the context of Polycrates' rise to power.Herodotus Histories 3.39 John Boardman and Graham Shipley proposed that there was archaeological evidence for serious disruption in this period. Around 550 BC, funerary stele were shattered and aristocratic burials in the West Cemetery at Samos cease, while the first great temple of Hera, known as the Rhoikos temple, was destroyed - only a decade after it had been built.Shipley (1987) 79 However, more recent archaeological research has challenged this picture, showing that the destruction of the Rhoikos temple was a structural failure resulting from subsidence under the foundations and that the West Cemetery fell out of use gradually over the course of the second half of the sixth century.Carty (2005) 92-93 & 102-105 Aideen Carty argues that shifts in the deposition of Laconian pottery on Samos suggest the development of pro- and anti-Spartan factions on the island, the one associated with the Heraion and the other with the Samian Artemision.Carty (2005) 94-102"]}, {"page": "Chigwell School", "response": ["* Prof Sir John Boardman (born 1927), classical archaeologist"]}, {"page": "Alfred Jewel", "response": ["In a paper published in 2014, Sir John Boardman endorsed the earlier suggestion by David Talbot Rice that the figure on the jewel was intended to represent Alexander the Great.  A medieval legend in the Alexander Romance had Alexander, wishing to see the whole world, first descending into the depths of the ocean in a sort of diving bell, then wanting to see the view from above.  To do this he harnessed two large birds, or griffins in other versions, with a seat for him between them.  To entice them to keep flying higher he placed meat on two skewers which he held above their heads.  This was quite commonly depicted in several medieval cultures, from Europe to Persia, where it may reflect earlier legends or iconographies. Sometimes the beasts are not shown, just the king holding two sticks with flower-like blobs at their ends.  The scene is shown in the famous 12th-century floor mosaic in Otranto Cathedral, with a titulus of \"ALEXANDER REX\". The scene refers to knowledge coming through sight, and so would be appropriate for an aestel.  Boardman detects the same meaning in the figure representing sight on the Anglo-Saxon Fuller Brooch.Boardman, John, \"Alfred and Alexander\", pp. 137-139, in: Gosden, Christopher, Crawford, Sally, Ulmschneider, Katharina, Celtic Art in Europe: Making Connections, 2014, Oxbow Books, , 9781782976585, google books"]}, {"page": "Black-figure pottery", "response": ["Mythological scenes are frequently depicted, especially Heracles and figures relating to the Trojan War. But the imagery on Corinthian vases does not have as wide a thematic range as do later works by Attic painters. Gods are seldom depicted, Dionysus never. But the Theban Cycle was more popular in Corinth than later in Athens. Primarily fights, horsemen and banquets were the most common scenes of daily life, the latter appearing for the first time during the early Corinthian period. Sport scenes are rare. Scenes with fat-bellied dancers are unique and their meaning is disputed up to the present time. These are drinkers whose bellies and buttocks are padded with pillows and they may represent an early form of Greek comedy.On Corinthian vase paintings see Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 100–104; Matthias Steinhart: Korinthische Vasenmalerei. In: Der Neue Pauly (DNP). Band 6, Metzler, Stuttgart 1999, , Sp. 738–742.; John Boardman: Early Greek Vase Painting, Thames and Hudson, London 1998, S. 178–185. .", "With over 20,000 extant pieces, Attic black-figure vases comprise the largest and at the same time most significant vase collection, second only to Attic red-figure vases.John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 7. Attic potters benefitted from the excellent, iron-rich clay found in Attica. High quality Attic black-figure vases have a uniform, glossy, pitch-black coating and the color-intensive terra cotta clay foundation has been meticulously smoothened. Women's skin is always indicated with a white opaque color, which is also frequently used for details such as individual horses, clothing or ornaments. The most outstanding Attic artists elevated vase painting to a graphic art, but a large number of average quality and mass-market products were also produced. The outstanding significance of Attic pottery comes from their almost endless repertoire of scenes covering a wide range of themes. These provide rich testimonials especially in regard to mythology, but also to daily life. On the other hand, there are virtually no images referring to contemporary events. Such references are only occasionally evident in the form of annotations, for example when kalos inscriptions are painted on a vase. Vases were produced for the domestic market on the one hand, and were important for celebrations or in connection with ritual acts. On the other hand, they were also an important export product sold throughout the Mediterranean area. For this reason most of the surviving vases come from Etruscan necropolises.Heide Mommsen: Schwarzfigurige Vasenmalerei. In: Der Neue Pauly (DNP). Band 12, Metzler, Stuttgart 1996–2003, , Sp. 274–281.", "In addition to following Corinthian models, Athens vases also showed local innovations. Thus at the beginning of the 6th century BC a \"Deianaira type\" of lekythos arose, with an elongated, oval form.Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 105; John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 18f. The most important painter of this early time was the Gorgon Painter (600–580 BC). He was a very productive artist who seldom made use of mythological themes or human figures, and when he did, always accompanied them with animals or animal friezes. Some of his other vases had only animal representations, as was the case with many Corinthian vases. Besides the Gorgon Painter the painters of the Komast Group (585–570 BC) should be mentioned. This group decorated types of vases which were new to Athens, namely lekanes, kotyles and kothons. The most important innovation was however the introduction of the komast cup, which along with the \"prekomast cups\" of the Oxford Palmette Class stands at the beginning of the development of Attic cups. Important painters in this group were the elder KX Painter and the somewhat less talented KY Painter, who introduced the column krater to Athens.John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 20. These vessels were designed for use at banquets and were thus decorated with relevant komos scenes, such as komast performers komos scenes.", "Other significant painters of the first generation were the Panther Painter, the Anagyrus Painter, the Painter of the Dresden Lekanis and the Polos Painter. The last significant representative of the first generation of painters was Sophilos (580–570 BC), who is the first Attic vase painter known by name. In all, he signed four surviving vases, three as painter and one as potter, revealing that at this date potters were also painters of vases in the black-figure style. A fundamental separation of both crafts seems to have occurred only in the course of the development of the red-figure style, although prior specialization cannot be ruled out. Sophilos makes liberal use of annotations. He apparently specialized in large vases, since especially dinos and amphoras are known to be his work. Much more frequently than his predecessors, Sophilos shows mythological scenes like the funeral games for Patroclus. The decline of the animal frieze begins with him, and plant and other ornaments are also of lower quality since they are regarded as less important and thus receive scant attention from the painter. But in other respects Sophilos shows that he was an ambitious artist. On two dinos the marriage of Peleus and Thetis is depicted. These vases were produced at about the same time as the François vase, which depicts this subject to perfection. However, Sophilos does without any trimmings in the form of animal friezes on one of his two dinos,Found on the Akropolis in Athens, now in the Akropolis Museum, inventory number 587. and he does not combine different myths in scenes distributed over various vase surfaces. It is the first large Greek vase showing a single myth in several interrelated segments. A special feature of the dinos is the painter's application of the opaque white paint designating women directly on the clay foundation, and not as usual on the black gloss. The figure's interior details and contours are painted in a dull red. This particular technique is rare, only found in vases painted in Sophilos' workshop and on wooden panels painted in the Corinthian style in the 6th century BC. Sophilos also painted one of the rare chalices (a variety of goblet) and created the first surviving series of votive tablets. He himself or one of his successors also decorated the first marriage vase (known as a lebes gamikos) to be found.John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 21.", "Starting around the second third of the 6th century BC, Attic artists became interested in mythological scenes and other representations of figures. Animal friezes became less important. Only a few painters took care with them, and they were generally moved from the center of attention to less important areas of vases. This new style is especially represented by the François vase, signed by both the potter Ergotimos and the painter Kleitias (570–560 BC). This krater is considered to be the most famous Greek painted vase.Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 111. It is the first known volute krater made of clay. Mythological events are depicted in several friezes, with animal friezes being shown in secondary locations. Several iconographic and technical details appear on this vase for the first time. Many are unique, such as the representation of a lowered mast of a sailing ship; others became part of the standard repertoire, such as people sitting with one leg behind the other, instead of with the traditional parallel positioning of the legs.on the François vase see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 37f. und Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 111f. Four other, smaller vases were signed by Ergotimos and Kleitias, and additional vases and fragments are attributed to them. They provide evidence for other innovations by Kleitias, like the first depiction of the birth of Athena or of the Dance on Crete.", "The last outstanding painter of the Pre-Classical Archaic Period was Lydos (560-540 BC), who signed two of his surviving pieces with ho Lydos (the Lydian). He or his immediate ancestors probably came from Asia Minor but he was undoubtedly trained in Athens. Over 130 surviving vases are now attributed to him. One of his pictures on a hydria is the first known Attic representation of the fight between Heracles and Geryon. Lydos was the first to show Heracles with the hide of a lion, which afterward became common in Attic art. He also depicted the battle between the gods and the giants on a dinos found on Athens’ acropolis, and Heracles with Cycnus. Lydos decorated other types of vessels besides hydriai and dinos, such as plates, cups (overlap Siena cups), column kraters and psykters, as well as votive tablets. It continues to be difficult to identify Lydos’ products as such since they frequently differ only slightly from those of his immediate milieu. The style is quite homogenous, but the pieces vary considerably in quality. The drawings are not always carefully produced. Lydos was probably a foreman in a very productive workshop in Athens’pottery district. He was presumably the last Attic vase painter to put animal friezes on large vases. Still in the Corinthian tradition, his figure drawings are a link in the chain of vase painters extending from Kleitias via Lydos and the Amasis Painters to Exekias. Along with them he participated in the evolution of this art in Attica and had a lasting influence.On Lydos see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 57–58, Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 113.", "The period between 560 and the inception of red-figure pottery painting around 530/520 BC is considered to be the absolute pinnacle of black-figure vase painting. In this period the best and most well-known artists exploited all the possibilities offered by this style.John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 57.", "The first important painter of this time was the Amasis Painter (560–525 BC), named after the famous potter Amasis, with whom he primarily worked. Many researchers regard them as the same person. He began his painting career at about the same time as Lydos but was active over a period almost twice as long. Whereas Lydos showed more the abilities of a skilled craftsman, the Amasis Painter was an accomplished artist. His images are clever, charming and sophisticatedJohn Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 60. and his personal artistic development comes close to a reflection of the overall evolution of black-figure Attic vase painting at that time. His early work shows his affinity to the painters of Siana cups. Advances can be most easily recognized in how he draws the folds of clothing. His early female figures wear clothes without folds. Later he paints flat, angular folds, and in the end he is able to convey the impression of supple, flowing garments.John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 61. Drawings of garments were one of his chief characteristics; he liked to depicted patterned and fringed clothing. The groups of figures which the Amasis Painter shows were carefully drawn and symmetrically composed. Initially they were quite static, later figures convey an impression of motion. Although the Amasis Painter often depicted mythological events—he is known for his pig-faced satyrs, for example—he is better known for his scenes of daily life. He was the first painter to portray them to a significant extent. His work decisively influenced the work of red-figure painters later. He possibly anticipated some of their innovations or was influenced by them toward the end of his painting career: on many of his vases women are only shown in outline, without a black filling, and they are no longer identifiable as women by the application of opaque white as skin color.On the Amasis Painter see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 60–62; Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 120.", "Group E (550–525 v. Chr.) was a large, self-contained collection of artisans, and is considered to be the most important anonymous group producing black-figure Attic pottery. It rigorously broke with the stylistic tradition of Lydos both as to image and vessel. Egg-shaped neck amphoras were completely given up, column kraters almost entirely abandoned. Instead, this group introduced Type A belly amphoras, which then became an index form. Neck amphoras were usually produced only in customized versions. The group had no interest in small formats. Many scenes, especially those originating in myths, were reproduced again and again. Thus several amphoras of this group show Heracles with Geryon or the Nemean Lion, and increasingly Theseus and the Minotaur, as well as the birth of Athena. The particular significance of the group is, however, in the influence it exerted on Exekias. Most Attic artists of the period copied the styles of Group E and Exekias. The work of Lydos and the Amasis Painter was, by contrast, not imitated as frequently. Beazley describes the importance of the group for Exekias as follows: \"Group E is the fertile ground from which the art of Exekias sprouts, the tradition which he takes up and surpasses on his way from an excellent craftsman to a true artist\".Quote translated from John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 62. On Group E see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 62 und Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 120.", "Exekias (545-520 BC) is generally considered to be the absolute master of the black-figure style, which reaches its apex with him.For an assessment see, for example, John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 62. His significance is not only due to his masterful vase painting, but also to his high quality and innovative pottery. He signed 12 of his surviving vessels as potter, two as both painter and potter. Exekias probably had a large role in the development of Little-master cups and the Type A belly amphora mentioned above, and he possibly invented the calyx krater, at least the oldest existing piece is from his workshop. In contrast to many other comparable craftsmen, as a painter he attached great importance to the careful elaboration of ornaments. The details of his images—horses’ manes, weapons, clothing—are also outstandingly well executed. His scenes are usually monumental and the figures emanate a dignity previously unknown in painting. In many cases he broke with Attic conventions. For his most famous vessel, the Dionysus cup, he was the first to use a coral-red interior coating instead of the customary red color. This innovation, as well as his placing of two pairs of eyes on the exterior, connects Exekias with the classic eye cups. Probably even more innovative was his use of the entire inside of the cup for his picture of Dionysus, reclining on a ship from which grapevines sprout. At this time it was in fact customary to decorate the inside surface merely with a gorgon face. The cupNow in the Munich State Collection of Antiquities, inventory number 2044. is probably one of the experiments undertaken in the pottery district to break new ground before the red-figure style was introduced. He was the first to paint a ship sailing along the rim of a dinos. He only seldom adhered to traditional patterns of depicting customary mythological subjects. His depiction of the suicide of Ajax is also significant. Exekias does not show the act itself, which was in the tradition, but rather Ajax’ preparations.Now in the Boulogne Museum, inventory number 558. About as famous as the Dionysus cup is an amphora with his visualization of Ajax and Achilles engaged in a board game.Now in the Vatican Museums, inventory number 344 Not only is the portrayal detailed, Exekias even conveys the outcome of the game. Almost in the style of a speech balloon he has both players announce the numbers they cast with their dice—Ajax a three and Achilles a four. This is the oldest known depiction of this scene, of which there is no mention in classical literature. No fewer than 180 other surviving vases, dating from the Exekias version up to about 480 BC, show this scene.On Exekias see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 63f. and Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 121–123.", "John Boardman emphasizes the exceptional status of Exekias which singles him out from traditional vase painters: \"The people depicted by earlier artist are elegant dolls at best. Amasis (the Amasis Painter) was able to visualize people as people. But Exekias could envision them as gods and thereby give us a foretaste of classical art\".Back-translated from John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 64.", "Acknowledging that vase painters in ancient Greece were regarded as craftsmen rather than artists, Exekias is nevertheless considered by today's art historians to be an accomplished artist whose work can be compared with \"major\" paintings (murals and panel paintings) of that period.John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 64. His contemporaries apparently recognized this as well. The Berlin Collection of Classical Antiquities in the Altes Museum contains the remnants of a series of his votive tablets. The complete series probably had 16 individual panels. Placing such an order with a potter and vase painter is likely to be unique in antiquity and is evidence of the high reputation of this artist. The tablets show grieving for a dead Athenian woman as well as her lying in state and being transported to a gravesite. Exekias conveys both the grief and the dignity of the figures. One special feature, for example, is that the leader of the funeral procession turns his face to look at the viewer directly, so to speak. The depiction of the horses is also unique; they have individual temperaments and are not reduced to their function as noble animals, as is otherwise customary on vases.On votive tablets see Heide Mommsen: „Bleib stehn und erhebe die Klage...\". Zu den wiedervereinigten Fragmenten der Grabtafeln des Exekias, in EOS 12 (August 2000), S. IV-VII. and also: Exekias I. Die Grabtafeln, von Zabern, Mainz 1997 (Forschungen zur antiken Keramik. Reihe 2, Kerameus, Bd. 11) .", "There was further specialization among producers of vessels and cups during the mature Classical Period. The large-volume komast and Siana cups evolved via Gordion cupsOn the Gordion cup see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 65; Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 118. into graceful variants called Little-master cups because of their delicate painting. The potters and painters of this form are accordingly called Little Masters. They chiefly painted band cups and lip cups. The lip cupsOn lip cups see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 65–67; Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 118. got their name from their relatively pronounced and delineated lip. The outside of the cup retained much of the clay background and typically bore only a few small images, sometimes only inscriptions, or in some cases the entire cup was only minimally decorated. Also in the area of the handles there are seldom more than palmettes or inscriptions near the attachment points. These inscriptions can be the potter's signature, a drinker's toast, or simply a meaningless sequence of letters. But lip cup interiors are often also decorated with images.", "Band cupsOn band cups see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 66f.; Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 118. have a softer transition between the body and the rim. The decoration is in the form of a band circling the cup exterior and can frequently be a very elaborate frieze. In the case of this form the rim is coated with a glossy black slip. The interior retains the color of the clay, except for a black dot painted in the center. Variations include Droop cups and Kassel cups. Droop cupsOn Droop cups see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 68f.; Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 119. have black, concave lips and a high foot. As with classic band cups the rim is left black, but the area below it is decorated with ornaments like leaves, buds, palmettes, dots, nimbuses or animals on the cup exterior. Kassel cupsOn Kassel cups see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 69; Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 119. are a small form, squatter than other Little Masters cups, and the entire exterior is decorated. As in the case of Droop cups, primarily ornaments are painted. Famous Little Masters are the potters Phrynos, Sokles, Tleson and Ergoteles, the latter two being sons of the potter Nearchos. Hermogenes invented a Little Master variety of skyphosOn the Hermogenes Skyphos see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 69. now known as a Hermogenes skyphos. The Phrynos Painter, Taleides Painter, Xenokles Painter and the Group of Rhodes 12264 should also be mentioned here.", "But in the meantime, a few innovative craftsmen could still give new impulses to the production of black-figure vases. The most imaginative potter of the time, also a talented businessman, was Nikosthenes. Over 120 vases bear his signature, indicating that they were made by him or in his workshop. He seems to have particularly specialized in producing vases for export to Etruria. In his workshop the usual neck amphoras, Little Masters, Droop and eye cups were produced, but also a type of amphora reminiscent of Etruscan bucchero pottery, named the Nikosthenic amphora after its creator. These pieces were found particularly in Caere, the other vase types usually in Cerveteri and Vulci. The many inventions in his workshop were not limited to forms. In Nikosthenes’ workshop what is known as the Six's technique was developed, in which figures were painted in reddish brown or white atop a black glossy slip. It is not clear whether Nikosthenes also painted vases, in which case he is usually presumed to be identical with Painter N.John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 73. The BMN Painter and the red-figure Nikosthenes Painter are also named after Nikosthenes. In his workshop he employed many famous vase painters, including the elderly Lydos, Oltos and Epiktetos. The workshop tradition was continued by Nikosthenes’ successor, Pamphaios.On Nikosthenes’ workshop see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 71–73, Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 123f.", "Two black-figure vase painters are considered to be mannerists (540-520 BC). The painter Elbows Out decorated primarily Little Masters cups. The extended elbows of his figures are conspicuous, a characteristic responsible for his pragmatic name. He only seldom depicted mythological scenes; erotic scenes are much more common. He also decorated a rare vase form known as a lydion. The most important of the two painters was The Affecter, whose name comes from the exaggeratedly artificial impression made by his figures. These small-headed figures do not seem to be acting as much as posing. His early work shows scenes of daily life; later he turned to decorative scenes in which figures and attributes are recognizable, but hardly actions. If his figures are clothed they look as if they were padded; if they are naked they are very angular. The Affecter was both potter and painter; over 130 of his vases have survived.On Elbows Out and The Affecter see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 73f., Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 124.", "The Antimenes Painter (530–500 BC) liked to decorate hydria with animal friezes in the predella, and otherwise especially neck amphoras. Two hydria attributed to him are decorated on the neck region using a white ground technique. He was the first to paint amphoras with a masklike face of Dionysus. The most famous of his over 200 surviving vases shows an olive harvest on the back side. His drawings are seldom really precise, but neither are they excessively careless.On the Antimenes Painter see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 119f.; Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 124. Stylistically, the painter Psiax is closely related to the Antimenes Painter, although the former also used the red-figure technique. As the teacher of the painters Euphronius and Phintias, Psiax had a great influence on the early development of the red-figure style. He frequently shows horse and chariot scenes and archers.On Psiax siehe John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 115; Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 124.", "The last important group of painters was the Leagros Group (520-500 BC), named after the kalos inscription they frequently used, Leagros. Amphoras and hydria, the latter often with palmettes in the predella, are the most frequently painted vessels. The image field is usually filled absolutely to capacity, but the quality of the images is still kept very high. Many of the over 200 vases in this group were decorated with scenes of the Trojan War and the life of HeraclesOn the Leagros Group see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 120f.; Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 124. Painters like the witty Acheloos Painter, the conventional Chiusi Painter, and the Daybreak Painter with his faithful detailing belong to the Leagros Group.On the painters of the Leagros Group see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 121f.", "Other well-known vase painters of the time are the Painter of the Vatican Mourner, The Princeton Painter, the Painter of Munich 1410 and the Swing Painter (540-520 BC), to whom many vases are attributed. He is not considered to be a very good artist, but his figures are unintentionally humorous because of the figures with their large heads, strange noses and frequently clenched fists.On the Swing Painter see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 71. The work of the Rycroft Painter bears a resemblance to red-figure vase painting and the new forms of expression. He liked to depict Dionysian scenes, horses and chariots, and the adventures of Heracles. He often uses outline drawings. The approximately 50 usually large-size vessels attributed to him are elegantly painted.On the Rycroft Painter see Heide Mommsen: Rycroft-Maler. In: Der Neue Pauly (DNP). Band 10, Metzler, Stuttgart 2001, , Sp. 1174–1174., John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 124. The Class of C.M. 218 primarily decorated variations of the Nikosthenic amphoras. The Hypobibazon Class worked with a new type of belly amphora with rounded handles and feet, whose decoration is characterized by a key meander above the image fields. A smaller variant of neck amphora was decorated by the Three Line Group. The Perizoma Group adopted around 520 BC the newly introduced form of the stamnos. Toward the end of the century, high quality productions were still being produced by the Euphiletos Painter, the Madrid Painter and the imaginative Priam Painter.", "Particularly cup painters like Oltos, Epiktetos, Pheidippos and Skythes painted vases in both red- and black-figure styles (Bilingual Pottery), primarily eye cups. The interior was usually in the black-figure style, the exterior in the red-figure style. There are several cases of amphoras whose front and back sides are decorated in the two different styles. The most famous are works by the Andokides Painter, whose black-figure scenes are attributed to the Lysippides Painter. Scholars are divided on the issue of whether these painters are the same person. Only a few painters, for example the Nikoxenos Painter and the Athena Painter, produced large quantities of vases using both techniques. Although bilingual pottery was quite popular for a short time, the style went out of fashion already toward the end of the century.On the bilingual style see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 124f.", "These vases were primarily produced in the leading workshops of the Kerameikos district. It seems to have been an honor or particularly lucrative to be awarded a commission for producing the vases. This also explains the existence of many prize amphoras by excellent vase painters. In addition to superior black-figure painters like the Euphiletos Painter, Exekias, Hypereides and the Leagros Group, many red-figure master craftsmen are known as creators of prize amphoras. These include the Eucharides Painter, the Kleophrades Painter, the Berlin Painter, the Achilleus Painter and Sophilos, who was the only one to have signed one of the surviving vases. The first known vase was produced by the Burgon Group and is known as the Burgon vase. Since the name of the ruling official (Archon) occasionally appears on the vase after the 4th century BC, some of the vases can be precisely dated. Since the Panathenaia were religious festivals, the style and the type of decoration changed neither during the red-figure period nor after figured vases were no longer really traded in Athens. The prize amphoras were produced into the 2nd century BC, and about 1,000 of them have survived. Since for some dates the number of amphorae awarded to a winner is known, it is possible to deduce that about one percent of the total production of Athenian vases has survived. Other projections lead to the conclusion that in all about seven million vases with painted figures were produced in Athens.For the statistics see Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 114. In addition to the prize amphoras, imitative forms known as Pseudo-Panathenaic prize amphoras were also manufactured.On the Panathenaic prize amphoras see John Boardman: Schwarzfigurige Vasen aus Athen, von Zabern, Mainz 1979, S. 180–183; Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 113–117.", "In the meantime at least eight vase painters can be distinguished. Five painters, the Arkesilas Painter (565–555), the Boreads Painter (575–565), the Hunt Painter, the Naucratis Painter (575–550) and the Rider Painter (550–530) are considered to be the more important representatives of the style, while other painters are regarded as craftsmen of lesser ability. The images are usually angular and stiff, and contain animal friezes, scenes of daily life, especially symposia, and many mythological subjects. Of the latter, Poseidon and Zeus are depicted especially frequently, but also Heracles and his twelve labors as well as the Theban and Trojan legend cycles. Especially on the early vases, a gorgon grimace is placed in a cup tondo. A depiction of the nymph Cyrene and a tondo with a rider with a scrolling tendril growing from his head (name vase of the Rider Painter) are exceptional.Now in the British Museum London, inventory number B1. Also important is a cup with an image of Arcesilaus II. The Arcesilas cup supplied the pragmatic name for the Arcesilas Painter.Found in Vulci, now with the inventory number 189 in the Paris Cabinet des Médailles de la Bibliothèque Nationale de France. It is one of the rare depictions on Greek pottery of current events or people. The subjects suggest Attic influence. A reddish purple was the main opaque color. At present over 360 Laconian vases are known, with almost a third of them, 116 pieces, being attributed to the Naucratis Painter. The decline around 550 BC of Corinthian black-figure vase painting, which had an important influence on Laconian painting, led to a massive reduction in the Laconian production of black-figure vases, which came to an end around 500 BC. The pottery was very widely distributed, from Marseille to Ionian Greece. On Samos, Laconian pottery is more common than Corinthian pottery because of the close political alliance with Sparta.On Lakonian pottery see Matthias Steinhart: Lakonische Vasenmalerei. In: Der Neue Pauly (DNP). Band 6, Metzler, Stuttgart 1999, , Sp. 1074–1075.; Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 125–128; Conrad M. Stibbe: Das andere Sparta, von Zabern, Mainz 1996, S. 163–203; John Boardman: Early Greek Vase Painting, Thames and Hudson, London 1998, pp. 185–188", "Black-figure vases were produced in Boeotia from the 6th to the 4th century BC. As late as the early 6th century BC many Boeotian painters were using the orientalizing outline technique. Afterward they oriented themselves closely on Attic production. Distinctions and attributions to one of the two regions are sometimes difficult and the vases can also be confused with Corinthian pottery. Low-quality Attic and Corinthian vases are often declared to be Boeotian works. Frequently, good Boeotian vases are considered to be Attic and poor Attic vases are falsely considered to be Boeotian. There was probably an exchange of craftsmen with Attica. In at least one case it is certain that an Attic potter emigrated to Boeotia (the Horse-Bird Painter, and possibly also the Tokra Painter, and among the potters certainly Teisias the Athenian). The most important subjects are animal friezes, symposia and komos scenes. Mythological scenes are rare, and when present usually show Heracles or Theseus. From the late 6th century through the 5th century a silhouette-like style predominated. Especially kantharos, lekanis, cups, plates and pitchers were painted. As was the case in Athens, there are kalos inscriptions. Boeotian potters especially liked to produce molded vases, as well as kantharos with sculptured additions and tripod pyxides. The shapes of lekanis, cups and neck amphoras were also taken over from Athens. The painting style is often humorous, and there is a preference for komos scenes and satyrs.On Boeotian pottery see Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 128f.; Matthias Steinhart: Schwarzfigurige Vasenmalerei II. Ausserattisch. In: Der Neue Pauly (DNP). Band 11, Metzler, Stuttgart 2001, , Sp. 276–281., John Boardman: Early Greek Vase Painting, Thames and Hudson, London 1998 pp. 213–215.", "Between 425 and 350 BC Kabeiric vases were the main black-figure style in Boeotia. In most cases this was a hybrid form between a kantharos and a skyphos with a deep bowl and vertical ring handles, but there were also lebes, cups and pyxides. They are named after the primary place where they were found, the Sanctuary of the Kabeiroi near Thebes.  The scenes, usually painted on only one side of the vase, depict the local cult. The vases caricature mythological events in a humorous, exaggerated form. Sometimes komos scenes are shown, which presumably related directly to the cult.On Boeotian pottery see Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 129; Matthias Steinhart: Schwarzfigurige Vasenmalerei II. Ausserattisch. In: Der Neue Pauly (DNP). Band 11, Metzler, Stuttgart 2001, , Sp. 277–277., John Boardman: Early Greek Vase Painting, Thames and Hudson, London 1998, p. 258.", "Black-figure vase painting in Euboea was also influenced by Corinth and especially by Attica. It is not always easy to distinguish these works from Attic vases. Scholars assume that most of the pottery was produced in Eretria. Primarily amphoras, lekythos, hydria and plates were painted. Large-format amphoras were usually decorated with mythological scenes, such as the adventures of Herakles or the Judgment of Paris. The large amphoras, derived from 7th century shapes, have tapering lips and usually scenes relating to weddings. They are apparently funerary vases produced for children who died before they could marry. Restrained employment of incising and regular use of opaque white for the floral ornaments were typical features of black-figure pottery from Eretria. In addition to scenes reflecting Attic models, there were also wilder scenes like the rape of a deer by a satyr or Heracles with centaurs and demons. The vases of the Dolphin Class were previously regarded as being Attic, but are now considered to be Euboic. However, their clay does not match any known Eretrian sources. Perhaps the pieces were produced in Chalcis.John Boardman: Early Greek Vase Painting, Thames and Hudson, London 1998, p. 215f.; Matthias Steinhart: Schwarzfigurige Vasenmalerei II. Ausserattisch. In: Der Neue Pauly (DNP). Band 11, Metzler, Stuttgart 2001, , Sp. 276–281.", "Toward the end of the Wild Goat style, northern Ionian artists imitated—rather poorly—Corinthian models. But already in the 7th century high quality vases were being produced in Ionia. Since approximately 600 BC the black-figure style was used either entirely or in part to decorate vases. In addition to regional styles which developed in Klazomenai, Ephesus, Milet, Chios and Samos there were especially in northern Ionia styles which cannot be precisely localized. Oil flasks which adhered to the Lydian model (lydions) were common, but most of them were decorated only with stripes. There are also original scenes, for example a Scythian with a Bactrian camel, or a satyr and a ram. For some styles attribution is controversial. Thus the Northampton Group shows strong Ionian influence but production was probably in Italy, perhaps by immigrants from Ionia.On Ionian pottery see Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 81f.; Matthias Steinhart: Schwarzfigurige Vasenmalerei II. Ausserattisch. In: Der Neue Pauly (DNP). Band 11, Metzler, Stuttgart 2001, , Sp. 276–281.; John Boardman: Early Greek Vase Painting, Thames and Hudson, London 1998, pp. 141–151.", "In Klazomenai primarily amphoras and hydria were painted in the middle of the 6th century BC (c. 550 to 350 BC), as well as deep bowls with flat, angular-looking figures. The vessels are not very elegant in workmanship. Dancing women and animals were frequently depicted. Leading workshops were those of the Tübingen Painter, the Petrie Painter, and the Urla Group. Most of the vases were found in Naukratis and in Tell Defenneh, which was abandoned in 525 BC. Their origin was initially uncertain, but Robert Zahn identified the source by comparison with images on Klazomenian sarcophagi. The pottery was often decorated with sculptured women's masks. Mythological scenes were rare; fishscale ornaments, rows of white dots, and stiff-looking dancing women were popular. The depiction of a herold standing in front of a king and a queen is unique. In general, men were characterized by large, spade-shaped beards. Starting already in 600 BC and continuing to about 520 BC rosette cups, successor to the eastern Greece bird cups, were produced, probably in Klazomenai.On Klazomenian pottery painting see Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 81f.; Matthias Steinhart: Schwarzfigurige Vasenmalerei II. Ausserattisch. In: Der Neue Pauly (DNP). Band 11, Metzler, Stuttgart 2001, , Sp. 276–281.; John Boardman: Early Greek Vase Painting, Thames and Hudson, London 1998, p. 148f.", "Samian pottery first appeared around 560/550 BC with forms adopted from Attica. These are Little Masters cups and kantharos with facial forms. The painting is precise and decorative. Samos along with Milet and Rhodes was one of the main centers for the production of vases in the Wild Goat style.On Samian pottery painting see Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 81f.; Matthias Steinhart: Schwarzfigurige Vasenmalerei II. Ausserattisch. In: Der Neue Pauly (DNP). Band 11, Metzler, Stuttgart 2001, , Sp. 276–281.; John Boardman: Early Greek Vase Painting, Thames and Hudson, London 1998, p. 146f.", "Rhodian vase painting is primarily known from Rhodian plates. These were produced using a polychrome technique with many of the details being incised as in black-figure painting. From about 560 to 530 BC situlas were common, inspired by Egyptian models. These show both Greek subjects, such as Typhon, as well as ancient Egyptian themes like Egyptian hieroglyphics and Egyptian sport disciplines.On Rhodian vase painting see Thomas Mannack: Griechische Vasenmalerei, Theiss, Stuttgart 2002, S. 81f.; Matthias Steinhart: Schwarzfigurige Vasenmalerei II. Ausserattisch. In: Der Neue Pauly (DNP). Band 11, Metzler, Stuttgart 2001, , Sp. 276–281.; John Boardman: Early Greek Vase Painting, Thames and Hudson, London 1998, p. 150.", "The Busiris Painter and the Eagle Painter are named as painters. The latter is considered the leading representative of this style. They were particularly interested in mythological topics which usually revealed an eastern influence. On the name vase by the Busiris painter, Heracles is trampling on the mythical Egyptian pharao Busiris. Heracles is frequently depicted on other vases as well, and scenes of daily life also exist. There are also uncommon scenes, such as Cetus accompanied by a white seal.On Caeretan hydriai see Rolf Hurschmann: Caeretaner Hydrien. In: Der Neue Pauly (DNP). Band 2, Metzler, Stuttgart 1997, , Sp. 907–908.; John Boardman: Early Greek Vase Painting, Thames and Hudson, London 1998, pp. 219–223; Thomas Mannack: Griechische Vasenmalerei. Theiss, Stuttgart 2002, S. 132f.", "The Pontic vases are also closely related stylistically to Ionian pottery painting. Also in this case it is assumed that they were produced in Etruscan workshops by craftsmen who emigrated from Ionia. The vases got their misleading name from the depiction on a vase of archers thought to be Scythians, who lived at the Black Sea (Pontus). Most of the vases were found in graves in Vulci, a significant number also in Cerveteri. The index form was a neck amphora with a particularly slender shape, closely resembling Tyrrhenian amphoras. Other shapes were oenochoes with spiral handles, dinos, kyathos, plates, beakers with high bases, and, less often, kantharos and other forms. The adornment of Pontic vases is always similar. In general there is an ornamental decoration on the neck, then figures on the shoulder, followed by another band of ornaments, an animal frieze, and finally a ring of rays. Foot, neck and handles are black. The importance of ornaments is noticeable, although they are often rather carelessly formed; some vases are decorated only with ornaments. The clay of these vases is yellowish-red; the slip covering the vases is black or brownish-red, of high quality, and with a metallic sheen. Red and white opaque colors are generously used for figures and ornaments. Animals are usually decorated with a white stripe on their bellies. Scholars have identified six workshops to date. The earliest and best is considered to be that of the Paris Painter. He shows mythological figures, included a beardless Heracles, as was customary in eastern Greece. Occasionally there are scenes which are not a part of Greek mythology, such as Heracles fighting Juno Sospita (\"the Savior\") by the Paris Painter, or a wolf demon by the Tityos Painter. There are also scenes of daily life, komos scenes, and riders. The vases are dated to a time between 550 and 500 BC, and about 200 are known.On Pontic vase painting see Matthias Steinhart: Pontische Vasenmalerei. In: Der Neue Pauly (DNP). Band 10, Metzler, Stuttgart 2001, , Sp. 138–139.; Thomas Mannack: Griechische Vasenmalerei. Theiss, Stuttgart 2002, S. 133; John Boardman: Early Greek Vase Painting, Thames and Hudson, London 1998, pp. 219–223.", "Locally produced Etruscan vases probably date from the 7th century BC. At first, they resemble black-figure models from Corinth and eastern Greece. It is assumed that in the early phase primarily Greek immigrants were the producers. The first important style was Pontic pottery painting. Afterward, in the period between 530 and 500 BC, the Micali Painter and his workshop followed. At this time Etruscan artists tended to follow Attic models and produced primarily amphoras, hydriai and jugs. They usually had komos and symposia scenes and animal friezes. Mythological scenes are less common, but they are very carefully produced. The black-figure style ended around 480 BC. Toward the end a mannerist style developed, and sometimes a rather careless silhouette technique.On Etruscan vase painting see Matthias Steinhart: Schwarzfigurige Vasenmalerei II. Ausserattisch. In: Der Neue Pauly (DNP). Band 11, Metzler, Stuttgart 2001, , Sp. 276–281.; John Boardman: Early Greek Vase Painting, Thames and Hudson, London 1998, pp. 219–223.", "Pseudo-Chalcidian vase painting is the successor to Chalcidian painting. It is close to Chalcidian but also has strong links to Attic and Corinthian vase painting. Thus the artists used the Ionian rather than the Chalcidian alphabet for inscriptions. The structure of the clay is also different. There are about 70 known vases of this type, which were first classified by Andreas Rumpf. It is possible that the artisans were successors to the Chalcidian vase painters and potters who emigrated to Etruria.On Chalcidian vase painting see Matthias Steinhart: Chalkidische Vasenmalerei. In: Der Neue Pauly (DNP). Band 2, Metzler, Stuttgart 1997, , Sp. 1088–1089.; Thomas Mannack: Griechische Vasenmalerei. Theiss, Stuttgart 2002, S. 129–131; John Boardman: Early Greek Vase Painting, Thames and Hudson, London 1998, pp. 217–219.", "Pseudo-Chalcidian vase painting is classified into two groups. The elder of the two is the Polyphemus Group, which produced most of the surviving vessels, primarily neck amphoras and oinochoes. Groups of animals are usually shown, less seldom mythological scenes. The vessels were found in Etruria, on Sicily, in Marsellle and Vix. The younger and less productive Memnon Group, to which 12 vases are currently attributed, had a much smaller geographical distribution, being limited to Etruria and Sicily. Except for one oinochoe they produced only neck amphoras, which were usually decorated with animals and riders.On Pseudo-Chalkidischen pottery see Thomas Mannack: Griechische Vasenmalerei. Theiss, Stuttgart 2002, S. 131; Matthias Steinhart: Pseudochalkidische Vasenmalerei. In: Der Neue Pauly (DNP). Band 10, Metzler, Stuttgart 2001, , Sp. 516–517.; John Boardman: Early Greek Vase Painting, Thames and Hudson, London 1998, pp. 217–219.", "The vases of the Northampton Group were all small neck amphoras with the exception of a single belly amphora. They are stylistically very similar to northern Ionian vase painting, but were probably produced in Italy rather than in Ionia, perhaps in Etruria around 540 BC. The vases of this group are of very high quality. They show rich ornamental decorations and scenes that have captured the interest of scholars, such as a prince with horses and someone riding on a crane. They are similar to the work of the Group of Campana Dinoi and to the so-called Northampton Amphora whose clay is similar to that of Caeretan hydriai. The Northampton Group was named after this amphora. The round Campana hydriai recall Boeotian and Euboean models.On the Northampton Group, the Group of Campana Dinoi and Campana hydriai see Matthias Steinhart: Schwarzfigurige Vasenmalerei II. Ausserattisch. In: Der Neue Pauly (DNP). Band 11, Metzler, Stuttgart 2001, , Sp. 276–281.; John Boardman: Early Greek Vase Painting, Thames and Hudson, London 1998, p. 220; Thomas Mannack: Griechische Vasenmalerei. Eine Einführung. Theiss, Stuttgart 2002, S. 132.", "Alabastrons with cylindrical bodies from Andros are rare, as are lekanis from Thasos. These are reminiscent of Boeotian products except that they have two animal friezes instead of the single frieze common for Boeotia. Thasian plates rather followed Attic models and with their figured scenes are more ambitious than on the lekanis. Imitations of vases from Chios in the black-figure style are known. Local black-figure pottery from Halai is also rare. After the Athenians occupied Elaious on the Dardanelles, local black-figure pottery production began there as well. The modest products included simple lekanis with outline images. A small number of vases in black-figure style were produced in Celtic France. They too were almost certainly inspired by Greek vases.On Etruscan pottery siehe Matthias Steinhart: Schwarzfigurige Vasenmalerei II. Ausserattisch. In: Der Neue Pauly (DNP). Band 11, Metzler, Stuttgart 2001, , Sp. 276–281.; John Boardman: Early Greek Vase Painting., Thames and Hudson, London 1998, p. 219–223.", "Scientific research on Attic vase painting owes a great deal to John D. Beazley. He began studying these vases in about 1910, making use of the method developed by the art historian Giovanni Morelli for studying paintings, which had been refined by Bernard Berenson. He assumed that each painter created original works which could always be unmistakably attributed. He made use of particular details such as faces, fingers, arms, legs, knees, and folds of clothing. Beazley studied 65,000 vases and fragments, of which 20,000 were black-figure. In the course of his studies, which lasted almost six decades, he could attribute 17,000 of them by name or by using a system of pragmatic names, and classified them into groups of painters or workshops, relationships and stylistic affinity. He identified over 1,500 potters and painters. No other archaeologist had such a decisive influence on the research of an archaeological field as did Beazley, whose analyses remain valid to a large extent up to the present time. After Beazley, scholars like John Boardman, Erika Simon and Dietrich von Bothmer investigated black-figure Attic vases.John Boardman: Schwarzfigurige Vasen aus Athen, S. 7f.; Thomas Mannack: Griechische Vasenmalerei, S. 18f."]}, {"page": "Exekias", "response": ["Exekias (, Exēkías) was an ancient Greek vase painter and potter who was active in Athens between roughly 545 BC and 530 BC.John Boardman, \"Exekias,\" American Journal of Archaeology 82 (1978): 13. Exekias worked mainly in the black-figure technique, which involved the painting of scenes using a clay slip that fired to black, with details created through incision. Exekias is regarded by art historians as an artistic visionary whose masterful use of incision and psychologically sensitive compositions mark him as one of the greatest of all Attic vase painters.John Boardman, Athenian Black Figure Vases: A Handbook (London: Thames and Hudson, 1974), 52. The Andokides painter and the Lysippides Painter are thought to have been students of Exekias.Evelyn Elizabeth Bell, “An Exekian Puzzle in Portland: Further Light on the Relationship between Exekias and Group E,” in Ancient Greek and Art Iconography, ed. Warren G. Moon (Madison: University of Wisconsin Press), 85. Regarding Exekias' relationship to the Lysippides painter see J.D. Beazley,Greek Vases: Lectures by J.D. Beazley, ed. Donna Kurtz (Oxford: Clarendon Press, 1989), 9.", "The works of Exekias are distinguished by their innovative compositions, precise draughtsmanship, and subtle psychological characterization, all of which transcend the inherent challenges of the black-figure technique. John Boardman, the eminent historian of Greek art, described Exekias' style as follows: \"The hallmark of his style is a near statuesque dignity which brings vase painting for the first time close to claiming a place as a major art.\"Boardman, Athenian Black Figure Vases: A Handbook, 57. He was an innovative painter and potter, who experimented with new shapes and devised unusual painting techniques, such as the use a coral-red slip, to enhance colour.", "Fourteen signed works by Exekias have survived, while many more have been attributed to him based on the stylistic connoisseurship method developed by John Beazley.J.D. Beazley, Attic Black-Figure Vase-Painters (New York: Hacker Art Books, 1978), 143-49. See also J.D. Beazley, Paralipomena: Additions to Attic Black Figure Vase Painters and to Attic Red Figure Vase Painters (Oxford: Clarendon Press, 1971), 59-62; Thomas H. Carpenter, Beazley Addenda: Additional References to ABV, ARV, and Paralipomena (Oxford: Oxford University Press, 1989), 39-42. A total of 32 vases are attributed to Exekias as painter in the most recent study, E.A. Mackay, Tradition and Originality: A Study of Exekias (Oxford: BAR, 2010). His signed pieces provide insight not only into the work of Exekias himself but also into the way ancient pottery workshops operated. Twelve of the fourteen vessels bearing his name refer to him not as their painter but as their potter, by adding the word epoíēsen (ἐποίησεν) to his name.J.D. Beazley, “Exekias,” The Development of Attic Black-Figure (Berkeley: University of California Press, 1951; 1986), 58.  This may be translated as \"Exekias made [me]\", in contrast to égrapsen (ἓγραψεν), which translates as \"painted [me]\"  (literally: \"drew [me]\").John Boardman, The History of Greek Vases (London: Thames and Hudson, 2001) 128-30. On two amphorae, Berlin 1720 and Vatican 344, both terms are used in the iambic trimeter inscription, Exēkías égrapse kapoíēsé me (\"Exekias made and painted me\"), indicating that in these cases Exekias was responsible for both the potting of the vase and its painted decoration.Beazley, The Development of Attic Black Figure, 59-60. Fragments of a third amphora (Taranto 179196) also show the use of both terms, when the inscriptions are restored.Mackay, Tradition and Originality: A Study of Exekias, 135-136. This leads to speculation regarding the meaning of the epoíēsen signatures and why, in some instances, Exekias signed only as potter on vases that he clearly painted as well. It has been suggested that he chose to sign as painter only the works he was particularly proud of. According to a different approach, Exekias' epoíēsen signatures could be understood as functioning as a general workshop stamp, which would mean that Exekias may have simply been the master-potter who supervised the production of the vessel.R.M. Cook, “‘Epoiesen on Greek Vases,” Journal of Hellenic Studies 91 (1971): 137-38. Seven of the vessels signed \"Exēkias epoíēsen,\" however, carry too little decoration to afford comparison. Only two of the remaining vases signed with epoíēsen can be attributed to the same hand as those signed \"... égrapse kapoíēsé me\"—that is, to the painter Exekias. Beazley attributed one of the vases with the potter-only signature to the so-called Group E, to which Exekias is closely related.Beazley, Athenian Black-Figure Vase-Painters, 136, no. 49; 143.", "Exekias does not seem to have specialized in a specific vessel type. Among the vases made or decorated by him are neck amphorae, Type A and B amphorae, calyx kraters, column kraters, Type A cups, dinoi, hydriai, and at least one Panathenaic amphora. Probably his most unusual work is represented by two series of funerary plaques found in Athens (Berlin Antikensammlung 1811, 1814). The plaques, showing the funerary ritual for a deceased man, were probably attached to the walls of a funerary monument.John Boardman,\"Painted Funerary Plaques and Some Remarks on Prothesis,\" The Annual of the British School at Athens 50 (1955): 51-66.", "Another visual adaptation of the mythological past can be seen on the Vatican amphora 344, which is regarded by some art historians as Exekias' masterpiece.Beazley, The Development of Attic Black Figure,\"' 60. The Vatican amphora depicts Achilles and Ajax playing a board game, with both men identified by their names added in the genitive. Ajax and Achilles sit across from each other, looking down at a block situated between them. The board game they are playing, which might be compared to a backgammon or checkers variant, was played with a die. According to the words written next to the two players, Achilles proclaims he has thrown a four, while Ajax has a three. Although the two of them are pictured playing, they are clearly depicted as being on duty, accompanied by their body armor and holding their spears, suggesting that they might head back into battle at any moment. There are small details that Exekias adds to this piece that separate it from other depictions of this narrative. Achilles is shown with his helmet still resting on his head which represents he has more power than Ajax. Also, Ajax is shown with his heel slightly lifted, suggesting that he is nervous in the presence of Achilles. Apart from the selection of this very intimate, seemingly relaxed scene as a symbol for the Trojan War, this vase-painting also showcases the talent of Exekias as an artist: the figures of both Achilles and Ajax are decorated with fine incised details, showing elaborate textile patterns and almost every hair in place. There is no extant literary source that is known to have circulated in the sixth century BC in Athens regarding a narrative involving Ajax and Achilles playing a board game.Boardman, \"Exekias,\" 21 Exekias may have drawn his inspiration for this innovative composition from local oral bardic traditions regarding the Trojan War, which may have developed during his lifetime in the cultural context of sixth century Athens.John Boardman, “The Sixth-Century Potters and Painters of Athens and their Public,” in Looking at Greek Vases, ed. Tom Rasmussen and Nigel Spivey, (Cambridge: Cambridge University Press, 1991), 82. Despite the ambiguity surrounding the origin of this mythological narrative, Exekias' new depiction of Ajax and Achilles playing a board game was popular and was copied over 150 times in the ensuing fifty years.Boardman, “Exekias,” 18."]}, {"page": "Pillars of Ashoka", "response": ["Various foreign influences have been described in the design of these capitals.The pillars \"owe something to the pervasive influence of Achaemenid architecture and sculpture, with no little Greek architectural ornament and sculptural style as well. Notice the florals on the bull capital from Rampurva, and the style of the horse of the Sarnath capital, now the emblem of the Republic of India.\" \"The Diffusion of Classical Art in Antiquity\" by John Boardman, Princeton University Press, 1993, p.110  The animal on top of a lotiform capital reminds of Achaemenid column shapes. The abacus also often seems to display some influence of Greek art: in the case of the Rampurva bull or the Sankassa elephant, it is composed of honeysuckles alternated with stylized palmettes and small rosettes.  A similar kind of design can be seen in the frieze of the lost capital of the Allahabad pillar. These designs likely originated in Greek and Near-Eastern arts. They would probably have come from the neighboring Seleucid Empire, and specifically from a Hellenistic city such as Ai-Khanoum, located at the doorstep of India. Most of these designs and motifs can also be seen in the Pataliputra capital."]}, {"page": "Red-figure pottery", "response": ["In black-figure vase painting, the pre-drawn outlines were a part of the figure. In red-figure vases, the outline would, after firing, form part of the black background. This led to vases with very thin figures early on. A further problem was that the black background did not permit the depiction of space in any depth, so that spatial perspective was almost never attempted. Nonetheless, the advantages outnumbered the disadvantages. The depiction of muscles and other anatomical details clearly illustrates the development of the style.John Boardman: Athenian Red Figure Vases: The Archaic Period,1975, p. 15-16", "The scientific study of Attic vase paintings was advanced especially by John D. Beazley. Beazley began to study the vases from about 1910 onwards, inspired by the methodology that the art historian Giovanni Morelli had developed for the study of paintings. He assumed that each painter produced individual works that can always be unmistakably ascribed. To do so, particular details, such as faces, fingers, arms, legs, knees, garment folds and so on, were compared. Beazley examined 65,000 vases and fragments (of which 20,000 were black-figure). In the course of six decades of study, he was able to ascribe 17,000 of them to individual artists. Where their names remained unknown, he developed a system of conventional names. Beazley also united and combined individual painters into groups, workshops, schools and styles. No other archaeologist has ever had as formative an influence on a whole subdiscipline as had Beazley on the study of Greek vase painting. A large proportion of his analysis is still considered valid today. Beazley first published his conclusions on red-figure vase painting in 1925 and 1942. His initial studies only considered material from before the 4th century BC. For a new edition of his work published in 1963, he also incorporated that later period, making use of the work of other scholars, such as Karl Schefold, who had especially studied the Kerch Style vases. Famous scholars who continued the study of Attic red-figure after Beazley include John Boardman, Erika Simon and Dietrich von Bothmer.John Boardman: Schwarzfigurige Vasen aus Athen, p. 7f."]}, {"page": "Indian art", "response": ["Some Hellenistic influence, such as the geometrical folds of the drapery or the walking stance of the statues, has been suggested. According to John Boardman, the hem of the dress in the monumental early Yaksha statues is derived from Greek art. Describing the drapery of one of these statues, John Boardman writes: \"It has no local antecedents and looks most like a Greek Late Archaic mannerism\", and suggests it is possibly derived from the Hellenistic art of nearby Bactria where this design is known."]}, {"page": "Kleophrades Painter", "response": ["However, in 1981 John Boardman demonstrated that the signature on the vase was a modern forgery, and the Kleophrades Painter returned to anonymity.The Getty Museum - Biography of the Kleophrades Painter The Kleophrades Painter is thought to be the son of the potter Amasis, and the pupil of Euthymides, as his earliest work greatly resembles that of his master. He himself had pupils, which include the Berlin Painter and also the Boot Painter. Overall, the Kleophrades Painter is recognized as one of the greatest pot painters in the late Archaic period in Athens."]}]}}