{"wiki_id": "http://www.wikidata.org/entity/Q5668479", "itemLabel": "Harry Driver", "itemDescription": "British television writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Driver", "wikipedia_page": {"main": "Harry Driver (13 May 1931 – 25 November 1973) was a British television scriptwriter and executive producer. He is best remembered for his partnership with Vince Powell on comedy television programmes including Never Mind The Quality Feel The Width, Nearest and Dearest, Bless This House and Love Thy Neighbour.", "link_mentions": [{"page": "British sitcom", "response": ["Bootsie and Snudge, (1960–1963, 1974) a spin-off sequel of The Army Game  also starring Bill Fraser, and Alfie Bass, was written by a large team for the series over its 154 episodes. Those who wrote for the 1960–63 episodes included Marty Feldman, Barry Took, John Antrobus, Ray Rigby, David Cumming, Derek Collyer,  James Kelly, Peter Lambda, Tom Espie, Jack Rosenthal, Harry Driver, and Doug Eden. The 1974 series was written by David Climie, Ronnie Cass and Lew Schwarz. The series established the reputation of actor Clive Dunn leading to his role as Corporal Jones in Dad's Army in 1971.", "Bless This House (1971–1976) starring comedy actor Sid James of Carry On fame,  Diana Coupland and Sally Geeson, was created by Vince Powell and Harry Driver, but mainly written by others including Dave Freeman and Carla Lane. It marked a departure from James' characteristic bawdy slapstick and famous 'dirty laugh' and ran for 65 episodes over 10 series. The series ended abruptly in 1976, when just four days after broadcast of the final episode, James died soon after collapsing on stage. Ironically, James had told his co-star Coupland, \"It's such fun and so successful, we'll still be working on Bless This House till one of us kicks the bucket.\""]}, {"page": "Love Thy Neighbour (1972 TV series)", "response": ["The series was created and largely written by Vince Powell and Harry Driver; it was based around a white working class couple (Eddie and Joan Booth) living in Twickenham, in the outer London suburbs, and a black couple (Bill and Barbie Reynolds) as their next-door neighbours. One of the leads, Rudolph Walker, who played Bill Reynolds, wrote in an article for The Guardian in 2001 that the show is about \"a black guy and a white guy being damned stupid\".", "* All written by Vince Powell and Harry Driver", "* All written by Vince Powell and Harry Driver", "* All written by Vince Powell and Harry Driver", "* All written by Vince Powell and Harry Driver", "The DVDs list eight series, which is now known to be accurate when Network checked through the original scripts whilst compiling the compete series DVD set. Series 4 is the pregnancy story arc, and contains the final episodes written together by creators Vince Powell and Harry Driver. Series 5 continued to be broadcast straight after series 4, following the illness and subsequent death of co-creator Harry Driver, and as such was solely written by Powell."]}, {"page": "Bootsie and Snudge", "response": ["A large team of writers wrote for the series over its 104 episodes. Those that wrote for the 1960–63 episodes were Marty Feldman, Barry Took, John Antrobus, Ray Rigby, David Cumming, Derek Collyer, Peter Miller, James Kelly, Peter Lambda, Stanley Myers, Tom Espie, Jack Rosenthal, Harry Driver, Patrick Ryan, John Smith and Doug Eden. The 1974 series was written by David Climie, Ronnie Cass and Lew Schwarz."]}, {"page": "Bless This House (British TV series)", "response": ["Bless This House is a British sitcom that aired on ITV from 2 February 1971 to 22 April 1976. Starring Sid James and Diana Coupland, it was created by Vince Powell and Harry Driver, but mainly written by other hands including Dave Freeman and Carla Lane. It was made for the ITV network by Thames Television. In 2004, Bless This House was ranked by a BBC poll as the 67th Best British Sitcom."]}, {"page": "Nearest and Dearest", "response": ["Meanwhile, Jewel went on to appear in the sitcom Spring and Autumn (1973–1976), about a friendship between a lonely boy and an elderly man, created by Nearest and Dearest creators Vince Powell and Harry Driver. Jewel continued to work in television for many years, and in 1991 he appeared in an episode of the BBC hospital drama series Casualty in which he was able to use one of his famous catchphrases, referring to a nurse as \"a knock-kneed, knackered old nose bag\" – a term he had regularly bestowed upon Nellie.", "Harry Driver, who created and wrote many episodes of the series with Vince Powell, died on 25 November 1973, just nine months after the series ended, aged only 42—marking the abrupt end of a successful 13-year writing partnership with Powell. Edward Malin, who played Walter, was the first of the cast to die, on 1 March 1977, four years after the show ended. Hylda Baker spent her final years penniless and battling dementia, and died in a retirement home on 1 May 1986 of bronchial pneumonia, aged 81. Joe Gladwin, who played Stan, went on to other television roles, including Wally Batty in the long-running sitcom Last of the Summer Wine, a role he played until his death on 11 March 1987. Jewel continued to work in a variety of roles in both theatre and television until his death on 3 December 1995, the day before his 86th birthday. Co-creator Vince Powell died on 13 July 2009, aged 80."]}, {"page": "Two in Clover", "response": ["Two in Clover is a British sitcom that ran for two series from 1969 to 1970.  It starred Sid James and Victor Spinetti and was written by Vince Powell and Harry Driver, and produced and directed by Alan Tarrant. The first series was made in black and white and the second series was made in colour."]}, {"page": "Not On Your Nellie", "response": ["However, Baker's character in Not On Your Nellie was not Nellie Pledge, but Nellie Pickersgill - an identical character in all but name. Not On Your Nellie was created by Roy Bottomley and Tom Brennand and was based on a stage play that they had written for Baker in the frame of the Nellie Pledge character. Bottomley and Brennand were two of the regular writers for Nearest and Dearest, but were not the series creators (\"Nearest\" was created by Vince Powell and Harry Driver and was produced by Granada Television). As such, neither Bottomley or Brennand (or London Weekend Television) had any rights to the character of Nellie Pledge, so this is likely to be what facilitated the name change to Pickersgill."]}, {"page": "Vince Powell", "response": ["Vincent Joseph Powell (6 August 1928 – 13 July 2009) was a British television scriptwriter. He  collaborated with a writing partner, Harry Driver, until 1973.", "Powell was born as Vincent Joseph Smith to Roman Catholic parents in Miles Platting, Manchester. When he was five, his mother died; two years later, his father remarried. Powell began a career as a tailor following the lead of his father, while performing as a comedian in the evenings. He met Harry Driver on the local club circuit. Their performing partnership under the name Hammond and Powell lasted until 1955 when Driver's health and physical mobility became severely impaired by the onset of polio.", "With his writing partner, Harry Driver, the partnership was hired to write material for comedian Harry Worth in Manchester for the BBC in 1960.  The show, Here's Harry (co-written with Frank Roscoe) ran for five years. The partnership, was better known for writing for ITV franchise holders from the early-1960s beginning with Coronation Street from 1961; Powell ceased writing for the programme in 1964, but Driver's involvement continued until he died in 1973. Powell and Driver created and wrote 11 sitcoms for ITV in an eight-year period, including the shows Bless This House (with Sid James) and Love Thy Neighbour, though other writers contributed scripts to both series. The latter programme, according to The Times, was \"one of television’s most notorious, if at the time highly popular, comedies\". While it was \"intended to debunk racial stereotypes\" it \"came to be widely condemned for doing exactly the opposite.\"", "*Television film (co-written with Harry Driver and Frank Roscoe, 1962)", "*Television film (co-written with Harry Driver and Frank Roscoe, 1962)", "*\"Spanner in the Works\" (co-written with Harry Driver, 1967)", "*\"Les Girls\" (co-written with Harry Driver, 1964)", "*16 episodes (co-written with Harry Driver, 1965-1966)", "*\"Beauty Is an Ugly Word\" (co-written with Harry Driver, 1966)", "*\"The Village of Evil\" (co-written with Harry Driver, 1966)", "*\"Conspiracy of Death\" (co-written with Harry Driver, 1967)", "*\"The Survivors\" (co-written with Harry Driver, 1967)", "*\"The Deadly Bullet\" (co-written with Harry Driver, 1967)", "*26 episodes (co-written with Harry Driver, 1966-1968)", "*Television film (co-written with Harry Driver, 1967)", "*\"Never Mind the Quality, Feel the Width\" (co-written with Harry Driver, 1967)", "*29 episodes (co-written with Harry Driver, 1967-1971)", "*5 episodes (co-written with Harry Driver, 1968–1969)", "*13 episodes (co-written with Harry Driver, 1968–1973)", "*13 episodes (co-written with Harry Driver, 1969–1970)", "*27 episodes (co-written with Harry Driver, 1970–1971)", "*13 episodes (co-written with Harry Driver, 1971–1974)", "*6 episodes (co-written with Harry Driver, 1971–1972)", "*Feature film (co-written with Harry Driver, 1972)", "*Television film (co-written with Harry Driver, 1972)", "*Feature film (co-written with Harry Driver, 1973)", "*Feature film (co-written with Harry Driver, 1973)"]}, {"page": "George and the Dragon (TV series)", "response": ["The regular cast was Sid James, Peggy Mount, John Le Mesurier and Keith Marsh. The show was written by Harry Driver and Vince Powell; Shaun O'Riordan was the director, and Alan Tarrant was the main producer."]}]}}