{"wiki_id": "http://www.wikidata.org/entity/Q5660193", "itemLabel": "Harold Browne", "itemDescription": "Bishop of Winchester", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Browne", "wikipedia_page": {"main": "Edward Harold Browne (usually called Harold Browne; 6 March 1811 – 18 December 1891) was a bishop of the Church of England.", "link_mentions": [{"page": "Smith's Bible Dictionary", "response": ["Noted contributors to the dictionary include Harold Browne, bishop of Ely; Charles J. Ellicott, bishop of Gloucester and Bristol; and the Cambridge scholars J. B. Lightfoot, William W. Selwyn, and Brooke Foss Westcott, who would later become bishop of Durham."]}, {"page": "Thomas Gore Browne", "response": ["Browne was born on 3 July 1807 in Aylesbury, in the county of Buckinghamshire, England, a son of Robert Browne and Sarah Dorothea . Of Irish extraction, the family had a military or church tradition; his father was a colonel in the Buckinghamshire Militia while his younger brother, Harold Browne, later became Bishop of Winchester.", "Brown died in London on 17 April 1887. He was survived by his wife, Harriet Louisa Browne . The couple had several children; the eldest son, Harold Browne, also served in the British Army and fought in the Boer War of 1899–1900, and took part in the defence of Ladysmith. His daughter, Ethel, married Hugh Locke King who built the Brooklands motor racing circuit in England, while his youngest son, Wilfrid was the first Bishop of Kimberley and Kuruman in South Africa."]}, {"page": "Harold Brown", "response": ["*Harold Browne (1811–1891), 19th century bishop"]}, {"page": "Randall Davidson", "response": ["In 1882 Tait told Davidson that he hoped to be succeeded either by the Bishop of Winchester, Harold Browne, or the Bishop of Truro, Edward White Benson. Tait did not think it correct to make his preference known to Queen Victoria or the Prime Minister, W. E. Gladstone, but after Tait's death in December 1882 Davidson ensured that the Archbishop's views became known to the Queen.Hughes, p. 16 Within days she sent for Davidson and was impressed: she wrote in her diary that she was \"much struck ... Mr. Davidson is a man who may be of great use to me\".Quoted in Hughes, p. 15 In the Oxford Dictionary of National Biography Stuart Mews comments that at the age of 34 Davidson quickly became the trusted confidant of the 63-year-old queen. When Benson was chosen to succeed Tait, Victoria asked Davidson's views on who should be the next Bishop of Truro; she also consulted him about a successor to the Dean of Windsor, Gerald Wellesley, who died in 1882 after 28 years in the post.Hughes, pp. 15–16"]}, {"page": "Mathew Hale (bishop)", "response": ["Mathew Blagden Hale was born on 18 June 1811 at Alderley, Gloucestershire, the third son of Robert H. Blagden Hale (5 May 1780 – 20 December 1855)South Australian Register 7 May 1856, p.2; Gourlay, M. R. 2015, The Good Bishop: The Story if Mathew Hale. Mathew Hale Public Library Brisbane & Boolarong Press, Brisbane, QLD. Appendix 2, pp. 129-130. and Lady Theodosia Hale (née Bourke). His maternal grandfather was The Earl of Mayo, Lord Archbishop of Tuam. After completing his education at Wotton-under-Edge, he attended Trinity College, Cambridge, and obtained his B.A. in 1835 and M.A. in 1838.\"Hale, Matthew Blagden (HL830MB)\". In Venn, J. A. 1947 A Cambridge Alumni Database. University of Cambridge. During his time at Cambridge he met Harold Browne and they became lifelong friends. Both came under the influence of Charles Simeon who celebrated fifty years of evangelical ministry at (Holy) Trinity Church in 1832. The antislavery movement driven by William Wilberforce also influenced Hale and he wanted to minister to the newly emancipated slaves, particularly in the West Indies, but was not encouraged to do so neither by his family nor by the missionary society working in that region.Gourlay 2015, pp. 5-11.", "In 1856, Hale resigned to accept an invitation to serve as Bishop of Perth. In July 1856 he arrived in Western Australia on the Guyon, which had diverted to Port Lincoln to pick him up,Adelaide Observer, 31 May 1856, p.4. along with his two eldest daughters and sister-in-law Georgiana Molloy,Adelaide Times, 17 June 1856, p. 2. and in November the rest of his family arrived there from South Australia. In March 1857, Hale returned to England with his family, where on 25 July 1857 he was consecrated as the first Bishop of Perth at the Lambeth Palace Chapel. The sermon was preached by Hale's longtime friend from their university days, Harold Browne. According to its usual custom Cambridge University awarded the new bishop an honorary Doctor of Divinity degree. While Hale accepted this academic honour, he was reluctant to adopt the style and title of \"My Lord\", maintaining that as a colonial bishop he would be better without it. However, the legal authorities ruled that he must accept it and he did so.Gourlay 2015, p. 39."]}]}}