{"wiki_id": "http://www.wikidata.org/entity/Q5662584", "itemLabel": "Harold Uren", "itemDescription": "English footballer (1885-1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Uren", "wikipedia_page": {"main": "Harold Uren (23 August 1885 – 7 April 1955) was an English footballer who played as a midfielder for Liverpool in The Football League. Uren started his career in the reserves at Liverpool and progressed through the ranks to the first team as an amateur. He appeared sporadically during his first three seasons at the club making six appearances during that time, also making appearances at Wrexham at the end of the 1906–07 season. He was also part of Great Britain's squad for the football tournament at the 1908 Summer Olympics, but he did not play in any matches.He became a regular in the side in the 1911–12 season when he appeared 24 times and scored twice. He was sold during the season to Everton for £300 and two players. He would play there until 1913 before making a return to Wrexham. Two of Uren's sons, Dick and Harold, were rugby union players who both played for the England national rugby union team in the 1940s and 1950s.", "link_mentions": [{"page": "Tom Gracie", "response": ["In 1911, Gracie was selected as a reserve for Scotland's game against England at Goodison Park. Although he wasn't required to play, and would never gain an international cap, the journey proved profitable for him as he was signed by Everton at the game's conclusion. A season later he switched to the red half of Merseyside, signing for Liverpool in an exchange deal which saw Harold Uren move to Everton in exchange for Gracie and Bill Lacey. Unlike Lacey, however, Gracie was unable to establish himself in the Liverpool first team, making only sporadic appearances in his two and a half seasons at Anfield. When the opportunity arose to return to Scotland in 1914, he was glad to take it, admitting to feeling \"unappreciated\" in the south."]}, {"page": "Uren", "response": ["*Harold Uren (1885–?), English football player"]}, {"page": "Football at the 1908 Summer Olympics – Men's team squads", "response": ["The following players were also part of Great Britain's squad, but did not play in any matches: Bill Bayley, Arthur Bell, John Charnley, P. Hayden, Willie Jordan, Lionel Louch, Eversley Mansfield, C. H. Pearce, Arthur Prest, John Prosser, Ernest Proud, James Raine, Harold Uren, Ernest Williams, Edward Wright"]}, {"page": "1936 British Lions tour to Argentina", "response": ["|align=right|Héctor Alfonso ||align=right|FB||align=center|15||FB|| Harold Uren"]}, {"page": "Dick Uren", "response": ["Uren was born at West Kirby on the Wirral Peninsula.. His father, Harold Uren, was an association footballer who played as an amateur for Liverpool F.C. and as a professional for Everton F.C.. Dick Uren was the youngest of seven children; one of his brothers, Harold Uren, was also capped by England at rugby union. "]}]}}