{"wiki_id": "http://www.wikidata.org/entity/Q5661073", "itemLabel": "Harold Hobbis", "itemDescription": "English footballer (1913-1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Hobbis", "wikipedia_page": {"main": "Harold Henry F. Hobbis (born 9 March 1913 in Dartford, Kent, England), was an English international footballer who played as a midfielder in the Football League. Playing most of his career for Charlton Athletic he also appeared as a guest player for West Ham United in World War II.", "link_mentions": [{"page": "England national football team records and statistics", "response": ["|Harold Hobbis"]}, {"page": "Tonbridge Angels F.C.", "response": ["Tonbridge Football Club was formed in October 1947 following the suggestion of local businessman and founder chairman Herbert Portch, and was one of four clubs to be elected to the Southern Football League for the 1948–49 season. The club took out a lease on the Angel Ground, formerly the home of Kent County Cricket Club and named after the nearby hotel, 'The Angel'. Hence Tonbridge FC became known as 'The Angels'. A crowd of around 5,000 turned up for the club's opening league fixture against fellow newcomers Hastings United but the match was lost 2–1, with Albert Robson scoring the club's first ever goal. Progress was slow in the early days, with the club rock bottom at Christmas and with Harold Hobbis taking over as manager from Dunoon and Marshall Raybould, but the club would improve their form in the second half of the season to finish third from last."]}, {"page": "1990–91 in English football", "response": ["May 1991 – Harold Hobbis, 78, made 248 league appearances for Charlton Athletic as a winger between 1931 and 1948, and scored one goal in two pre-war appearances for the England team."]}, {"page": "List of Charlton Athletic F.C. players", "response": ["|Harold Hobbis||||FW||1931–48||268||78"]}, {"page": "List of Charlton Athletic F.C. seasons", "response": ["|Harold Hobbis"]}, {"page": "1944–45 Brentford F.C. season", "response": ["|Harold Hobbis", "| style=\"text-align:left;\" |Harold Hobbis", "| Harold Hobbis"]}]}}