{"wiki_id": "http://www.wikidata.org/entity/Q5662558", "itemLabel": "Harold Tillman", "itemDescription": "English businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Tillman", "wikipedia_page": {"main": "Harold Tillman CBE (born 15 October 1945) is an English retail entrepreneur and investor. He was formerly head of Jaeger and Aquascutum, who was awarded CBE in 2010. Until September 2014, Tillman was chair of the British Fashion Council. In 2016, he became chair of the Ethical Fashion Group  and in 2016 he was appointed Chair of Fashion Matters, London College of Fashion's fundraising committee. In 2019, he was Chief Barker of Variety the children's charity. Most recently, in 2020, Tillman was appointed Enterprise and Business Advisor for the London College of Fashion.", "link_mentions": [{"page": "Tillman", "response": ["* Harold Tillman (born 1945), English retail entrepreneur and investor"]}, {"page": "Allders", "response": ["The original store was established in 1862 in Croydon by Joshua Allder. In the second half of the 20th century, this parent store was developed into a chain of department stores across England and Wales. By the turn of the millennium, the flagship store in Croydon was the third-largest department store in the United Kingdom. The chain was broken up and sold after it went into administration in 2005, although the Croydon store continued trading until 2012, having been purchased by Harold Tillman, the then-owner of the Jaeger clothing company. On 17 January 2013, the company closed the store along with the website, and the brand ceased to exist. In 2018 the brand relaunched with a department store in the former Co-op Department Store in the Paisley Centre in Paisley."]}, {"page": "Jaeger (clothing)", "response": ["Formerly owned by the retail entrepreneur Harold Tillman, it was acquired by the private equity firm Better Capital in 2011. On 10 April 2017, it was announced that the company had entered administration. Edinburgh Woollen Mill bought the Jaeger brand, but not the company itself. Lawsuits from the company's creditors are expected.", "Coats sold Jaeger for a nominal fee to entrepreneur and former Queens Park Rangers F.C. chair Richard Thompson in 2003, by this stage it was a chain with almost 250 shops. It was swiftly re-sold by Thompson to retail entrepreneur and then British Fashion Council chair Harold Tillman. At this stage, the company was described as: \"on its knees\"."]}, {"page": "Presidents Club", "response": ["In 2008, guests at the dinner organised by Harvey Goldsmith  included Jimmy Savile, Justin King, Harold Tillman and Robert Tchenguiz."]}, {"page": "Aquascutum", "response": ["In 2008, Renown announced that it would sell Aquascutum, after the parent company experienced three straight years of losses. In May 2009, Renown rejected a corporate buyout bid led by Kim Winser. After the bid was rejected, Winser left Aquascutum. Renown continued acquisition talks with Chinese clothing retailer YGM Trading, which held licenses to sell Aquascutum clothes in Asia - the brand's biggest market.  In September 2009, the management team behind the revival of retailer Jaeger, Harold Tillman and Belinda Earl, bought the company. However, on 17 April 2012, the Financial Times published an article citing sources \"familiar with the company's plans\" stating that the company would shortly go into administration with the potential loss of up to 250 jobs."]}, {"page": "Hilary Alexander", "response": ["In June 2011, the British Fashion Council and The Daily Telegraph hosted a party to celebrate Alexander's career in fashion. An amusing video titled Hilary Alexander Tribute was specially commissioned for the event, complete with quotes from colleagues and friends including Sir Philip Green, Claudia Schiffer, Suzy Menkes, Stephen Jones (milliner) and Harold Tillman who affectionately described her as a \"larger-than-life character\" and \"workaholic\"."]}, {"page": "Belinda Earl", "response": ["Harold Tillman, a retail entrepreneur, had bought Jaeger in 2002 and had inherited a brand in decline. Earl was initially approached in 2004 and was eventually persuaded to become CEO. Jaeger became a profitable business, growing sales both in retail and online, developed the lines of Jaeger London, Boutique by Jaeger and Jaeger Black as well as expanding internationally during her tenure. She left the business in 2011."]}, {"page": "Harold Peter Tillman", "response": ["#REDIRECT Harold Tillman"]}, {"page": "Aloysius Society", "response": ["On 18 June 2010, The Oxford Red Dress Couture Ball was a three-part event organised by the Aloysius Society in aid of H.E.L.P. charity. Participating designers included Chanel, Herve Leger, Marchesa, John Galliano, Armani and Alexander McQueen. Red, the international colour of hope for those affected by HIV/AIDS, was the unifying link carried throughout the evening's festivities, which were centred on the Oxford Town Hall and the famed Divinity School, Oxford. Prizes were donated to auction by stars such as Pete Townshend, and the event garnered the support of celebrities such as Sir Roger Moore, and industry leaders such as Anna Wintour and Harold Tillman. Cynthia Leive, editor-in-chief of Glamour US, termed the event \"a truly powerful night for fashion, for academia, and for charity\"."]}, {"page": "Kawai Wong", "response": ["Wong was born in Hong Kong and was educated at New Territories Heung Yee Kuk Yuen Long District Secondary School. She was briefly exchanged to Singapore's Zhonghua Secondary School in 2000. After spending a year as the chairperson of her Hong Kong school's Student Association, Wong won a scholarship to study in the UK before reading Biochemistry at Imperial College London. She became the fashion editor of the college's weekly newspaper Felix, where she creative directed a fashion photoshoot in association with Oxfam and Toni&Guy. She also interviewed Bruce Pask (of The New York Times T Magazine), Harold Tillman and Hilary Alexander for the student newspaper. Wong was the editor of the college's annual arts magazine, Phoenix."]}, {"page": "Joseph Ettedgui", "response": ["Joseph Ettedgui (1936-2010), usually known simply as Joseph, was an influential London-based retailer and founder of the Joseph retail empire. After his death, the chair of the British Fashion Council Harold Tillman described him as: \"a great designer, retailer and entrepreneur\". Le Figaro fashion editor Godfrey Deeny has described him as: \"one of the half dozen greatest fashion retailers in the past half-century\"."]}, {"page": "Department stores by country", "response": ["* Allders of Croydon, founded in 1862 by Joshua Allder, was the flagship of a large chain of department stores in the UK. The chain went into administration in 2005. The Croydon store was taken over by Harold Tillman of Jaeger trading as Allders but went into administration in June 2012."]}]}}