{"wiki_id": "http://www.wikidata.org/entity/Q56697176", "itemLabel": "Kathleen Quigly", "itemDescription": "Irish stained glass artist, illustrator, and painter", "wikipedia_url": "https://en.wikipedia.org/wiki/Kathleen_Quigly", "wikipedia_page": {"main": "Kathleen Quigly (6 March 1888 – 15 August 1981) was an Irish stained glass artist, illustrator and painter. She was also a metal worker and jewellery designer.", "link_mentions": [{"page": "Honan Chapel", "response": ["Clarke and his assistant Kathleen Quigly completed the window's modello under considerable time pressure over five weeks in 1914, during the offer period for the commission. A monochrome study was made in pencil, pen, inks, and watercolour on board, before the cartoon, now at the Corning Museum of Glass, was completed and eventually transferred to glass. During this process, each panel was cut up, waxed and painted. This was an expensive process for the largely unknown artist, and was funded by both his father and his friend Austin Malloy."]}, {"page": "An Túr Gloine", "response": ["An Túr Gloine was conceived of in late 1901 and established January 1903 at 24 Pembroke Street, Dublin, Ireland, on the site of two former tennis courts. It was active throughout the first half of the 20th century. Affiliated artists included Michael Healy, Evie Hone, Beatrice Elvery, Wilhelmina Geddes, Harry Clarke, Catherine O'Brien, Kathleen Quigly, and founder Sarah Purser. The original impetus for the project, spurred by the Irish cultural activist Edward Martyn, was the building of the Roman Catholic cathedral in Loughrea, County Galway, which was to become St. Brendan's.Martin Wallace, 100 Irish Lives (Rowman & Littlefield, 1983), p. 122 online. Purser and Martyn hoped to provide an alternative to the commercial stained glass imported from England and Germany for Irish churches and other architectural projects.Entry on stained glass, The Blackwell Companion to Modern Irish Culture, edited by W.J. McCormack (Wiley-Blackwell, 2001), p. 542 online. Purser's knowledge of French and English medieval glass, together with her social connections and organizational skills, were crucial to the success of the cooperative."]}, {"page": "Saint Gobnait (Clarke)", "response": ["Clarke and his assistant Kathleen Quigly completed the window's modello under considerable time pressure over five weeks in 1914, during the offer period for the Honan commission and when Clark was still an largely unknown artist. A monochrome study was made in pencil, pen, inks, and watercolour on board, before the cartoon, now at the Corning Museum of Glass, was transferred to glass, when each panel was cut up, waxed and painted. The final window is the largest in the Honan. This was an expensive process, and was funded both by this father, and his friend Augtin Malloy."]}, {"page": "Quigly", "response": ["*Kathleen Quigly (1888–1981), Irish glass artist and painter"]}]}}