{"wiki_id": "http://www.wikidata.org/entity/Q5669695", "itemLabel": "Harry Higgins", "itemDescription": "English cricketer (1894-1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Higgins", "wikipedia_page": {"main": "Harry Leslie Higgins (24 February 1894 – 19 September 1979) was an English first-class cricketer who played 98 matches in the 1920s. All but one of these were for Worcestershire; the exception was a Gentlemen v Players game in 1922 in which bad weather meant that Higgins (playing for the Gentlemen) did not get to bat. He stood in as Worcestershire captain for one game in 1923, and acted as wicket-keeper for a single match — in which he scored 99 — in 1921.\nHiggins made his debut for Worcestershire against Somerset at Taunton in June 1920; he made 0 and 33 in a heavy innings defeat. He played a further 10 games for Worcestershire that season, but Higgins' only half-century during the year was the 64 not out he hit against Sussex at Worcester in July: a game in which only 80 overs were possible. The other nine games in which Higgins played were all lost by one of the weakest of all Worcestershire sides; these defeats included the innings-and-340-run demolition by Warwickshire that as of 2007 remains Worcestershire's heaviest first-class defeat.\nHe was a regular in the county side in 1921 and 1922, and in both years he made over 1,000 first-class runs. In 1921 he hit a career-best 1,182 runs at 28.82, including two centuries. The higher of these, 133 against Essex at Leyton, came in a somewhat unusual match. Essex, batting first, had been dismissed for 90 (Preece taking a career-best 7-35) but had nevertheless run out easy winners thanks to the all-round talents of Johnny Douglas, who made 123*  and took 14 wickets.\n Higgins made his career best score of 137* in May 1922 at New Road against Lancashire, but again Worcestershire lost, this time by an innings.\nIn 1923 and 1924, Higgins appeared in 15 matches each season, but suffered a severe loss of form, scoring only 728 runs in 55 innings, and with just a single fifty each year. After that he never played regularly again, although he turned out on a handful of occasions from 1925 until his final retirement in 1927. His last game was against Warwickshire at Worcester: in a drawn match, Higgins scored 11 in his only innings.\nHiggins was born in Bournville (then in Warwickshire, now Birmingham); he died at the age of 85 in Malvern, Worcestershire.\nHis older brother John played more than 100 times for Worcestershire, and umpired one Test match.", "link_mentions": [{"page": "The Ritz Hotel, London", "response": ["William Brownlow, 3rd Baron Lurgan, who succeeded Harry Higgins as chairman of the Ritz upon his death in 1928, was especially keen on attracting American guests to the hotel. He was a close friend of the Earl of Carnavon and his American wife Catherine Wendell, and at times the couple were freely given the entire second floor of the hotel to accommodate guests. Upon the death of Lord Lurgan in 1937, Carnavon was told that he had to begin paying for his staying at the hotel, but was given a \"slight reduction for old time's sake\". Carnarvon later remarked: \"The Ritz has been my London home for over fifty years. I'm very fond of the place. Nobody knows it better\". In 1931, the Aga Khan was involved with organising the Round Table Conference at the hotel, which was attended by Mahatma Gandhi and many others. On one occasion the Aga Khan took over the Palm Court to hold a meeting with his followers."]}, {"page": "Henry Higgins", "response": ["* Harry Higgins (1894–1979), English cricketer"]}, {"page": "Arthur Burlton", "response": ["He scored 20 and 17 on debut against Sussex, but his best scores came in his second match, against Glamorgan at Cardiff Arms Park. He scored 32 and 35 not out, putting on 91 in the first innings with Harry Higgins to bring Worcestershire from 43/4 up to a position where they were able to record a 44-run victory. In the six remaining innings of his first-class career, however, he made only ten runs, being dismissed for 0, 5, 1, 0, 4 and 0."]}, {"page": "Higgins (surname)", "response": ["* Harry Higgins (1894–1979), English cricketer"]}, {"page": "List of Gentlemen cricketers (1841–1962)", "response": ["* Harry Higgins (1922)"]}, {"page": "William Brownlow, 3rd Baron Lurgan", "response": ["He was the subject of caricatures by Max Beerbohm. Brownlow succeeded Harry Higgins as chairman of the Ritz upon his death in 1928, and was especially keen on attracting American guests to the hotel. He was a close friend of the Earl of Carnavon and his American wife, Catherine Wendell, and at times he gave the couple the entire second floor of the hotel to accommodate guests."]}]}}