{"wiki_id": "http://www.wikidata.org/entity/Q5660333", "itemLabel": "Harold Collison", "itemDescription": "trade unionist (1909-1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Collison", "wikipedia_page": {"main": "Harold Francis Collison, Baron Collison, CBE, (10 May 1909 – 29 December 1995) was a British trade unionist.\nBorn in the East End of London, Collison grew up in Gloucester and attended the Crypt School, before working on a farm from the age of seventeen.  He joined the National Union of Agricultural Workers and was also active in the Labour Party.  From 1946, he worked at the union headquarters in London, and in 1953 he was elected General Secretary.  In 1960, he became President of the International Federation of Plantation, Agricultural and Allied Workers, serving until 1976, and he was also a member of the executive of the International Labour Organization.In the 1961 New Year Honours he was appointed a Commander of the Order of the British Empire (CBE). He was created a life peer on 14 December 1964 as Baron Collison, of Cheshunt, in the County of Hertford.In 1965, Collison served as President of the Trades Union Congress. In 1969, he resigned as General Secretary of the union to become Chairman of the Supplementary Benefits Commission.", "link_mentions": [{"page": "Pilkington Committee on Broadcasting", "response": ["*Harold Collison "]}, {"page": "National Union of Agricultural and Allied Workers", "response": [":1953: Harold Collison"]}, {"page": "List of life peerages (1958–1979)", "response": ["|Harold Collison"]}, {"page": "Harold Collison, Baron Collison", "response": ["#REDIRECT Harold Collison"]}, {"page": "Collison (surname)", "response": ["*Harold Collison (1909–1995), British trade unionist"]}, {"page": "General Council of the Trades Union Congress", "response": ["thumb|right|Harold Collison, member from 1953 to 1970"]}, {"page": "International Federation of Plantation and Agricultural Workers", "response": [":1960: Harold Collison"]}, {"page": "Deaths in December 1995", "response": ["*Harold Collison, 86, British trade unionist.", "*Harold Collison, 86, British trade unionist."]}, {"page": "Baron Collison", "response": ["#REDIRECT Harold Collison"]}]}}