{"wiki_id": "http://www.wikidata.org/entity/Q5660152", "itemLabel": "Harold Brakspear", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Brakspear", "wikipedia_page": {"main": "Sir Harold Brakspear KCVO (10 March 1870 – 20 November 1934) was an English restoration architect and archaeologist.He restored a number of ancient and notable buildings, including Bath Abbey, Windsor Castle, Brownston House in Devizes and St Cyriac's Church in Lacock. He lived in Corsham, Wiltshire,  close to his projects at Lacock Abbey, Hazelbury Manor and Great Chalfield Manor.Brakspear was appointed Knight Commander of the Royal Victorian Order in the 1931 New Year Honours.", "link_mentions": [{"page": "Pershore Abbey", "response": ["In about 1840 the abbey was given a new baptismal font and the original Norman font was cast out into the churchyard. It was later used as a cattle trough, and later used in a garden at nearby Kempsey. In 1912 a war memorial was erected on the site of the Victorian font and the old font was returned, on a pedestal designed by Harold Brakspear. The font is decorated with an interlacing arcade, in the panels of which are the figures of Christ and his Apostles.Wilson, Dr. M. and Crawford, Rev. K., Pershore Abbey, Official Abbey Guide, 2008, , p16"]}, {"page": "Ludlow Castle", "response": ["W. H. St John Hope and Harold Brakspear began a sequence of archaeological investigations at Ludlow Castle in 1903, publishing their conclusions in 1909 in an account which continues to be held in regard by modern academics.; ; ;  George Herbert, the Earl of Powis, cleared away much of the ivy and vegetation from the castle stonework. In 1915 the castle was declared an ancient monument by the state, but it continued to be owned and maintained by the earl and trustees of the Powis estate.; "]}, {"page": "Corsham", "response": ["Pickwick Manor was noted by architectural historian Nikolaus Pevsner as an \"unusually impressive example of a late 17th century manor house\", having remnants of a 14th-century wing. More recently it has been the residence of architect Harold Brakspear and his descendants.Brakspear, Sir; Harold (b. Corsham, Wilts. 10 March 1870 – d. 20 November 1934). Who's Who 2006 and Who Was Who 1897–2005 (2005). Retrieved 10 October 2006. Available from xreferplus.", "* Harold Brakspear (1870–1934), restoration architect and archaeologist, lived at Pickwick Manor and Parkside in High Street"]}, {"page": "Haddon Hall", "response": ["That John Manners' son was John, the 9th Earl, and was made 1st Duke of Rutland in 1703. He moved to Belvoir Castle, and his heirs used Haddon Hall very little, so it lay almost in its unaltered 16th-century condition, as it had been when it passed in 1567 by marriage to the Manners family. In the 1920s, another John Manners, the 9th Duke of Rutland, realised its importance and began a lifetime of meticulous restoration, with his restoration architect Harold Brakspear. The current medieval and Tudor hall includes small sections of the 11th-century structure, but it mostly comprises additional chambers and ranges added by the successive generations of the Vernon family. Major construction was carried out at various stages between the 13th and the 16th centuries. The banqueting hall (with minstrels' gallery), kitchens and parlour date from 1370, and the St. Nicholas Chapel was completed in 1427. For generations, whitewash concealed and protected their pre-Reformation frescoes."]}, {"page": "Great Chalfield Manor", "response": ["The house and garden were purchased by George Fuller MP (of Neston Park) in the early 1900s, and restored and furnished between 1905 and 1911 by his fourth son, Major Robert Fuller, under the guidance of Sir Harold Brakspear.  The restoration included a sympathetic garden design by Alfred Parsons."]}, {"page": "Little Sodbury", "response": ["The 15th century,  Little Sodbury Manor was the home of Sir John Walsh who employed William Tyndale as chaplain and tutor to his grandchildren in 1522–3; by tradition he began his translation of the Bible in his bedroom here. The manor retains the porch and Great Hall, with a timber roof resting on corbels carved as shield-bearing angels,  of the fifteenth-century courtyard house. The house fell into disrepair in the nineteenth century, but was restored by architect Sir Harold Brakspear for Lord Grosvenor and later Baron de Tuyll."]}, {"page": "Haughmond Abbey", "response": ["The site was excavated in 1907Hope and Brakspear, p. 281 under the supervision of William Henry St John Hope and Harold Brakspear, who published their findings in The Archaeological Journal. More excavations took place between 1975-1979, directed by Jeffrey West for the Department of the Environment, in the north part of the cloister, the south transept and the south part of the choir of the abbey church, with the dual purpose of recovering the plan of the cloister walk and re-examining the early church identified by the 1907 excavation. Further work was undertaken by English Heritage in 2002 and is the most comprehensive analysis and survey of the earthworks to be undertaken to date."]}, {"page": "Category talk:English historians", "response": ["List of all pages in category English historians retrieved by PockBot.PockBot is currently Undergoing Trials. If you have any comments on its performance please leave them at Wikipedia:Bots/Requests_for_approval/PockBotArticleClass / StatusPeter Ackroydnot yet classifiedHarold Actonnot yet classifiedJohn Dalberg-Acton, 1st Baron Actonnot yet classifiedAethelweardnot yet classifiedGrace Aguilarnot yet classifiedLucy Aikinnot yet classifiedAilred of Rievaulxnot yet classifiedGeoffrey Aldermannot yet classifiedSir Archibald Alisonnot yet classifiedAndrew Allamnot yet classifiedGeorge Allan (antiquary)not yet classifiedWilliam Edward David Allennot yet classifiedAlured of Beverleynot yet classifiedJames Pettit Andrewsnot yet classifiedWilliam Archer (critic)not yet classifiedGeoffrey Ashenot yet classifiedHarold Brakspearnot yet classifiedRichard Baker (chronicler)not yet classifiedJohn Baker (legal historian)not yet classifiedAdolphus Ballardnot yet classifiedJoshua Barnesnot yet classifiedCorrelli BarnettStartHugh Bichenonot yet classifiedRobert Blake, Baron Blakenot yet classifiedWilliam Henry Blissnot yet classifiedRichard Bonneynot yet classifiedGerald Brenannot yet classifiedFrancis Brinkleynot yet classifiedOscar Browningnot yet classifiedKevin Brownlownot yet classifiedHenry Thomas Bucklenot yet classifiedJames Burneynot yet classifiedWilliam Camdennot yet classifiedJohn Capgravenot yet classifiedEdward Cardwellnot yet classifiedGeorge Carewnot yet classifiedThomas Cartenot yet classifiedPaul Cartledgenot yet classifiedChristopher Catherwoodnot yet classifiedWilliam Cavenot yet classifiedHector Munro Chadwicknot yet classifiedOwen Chadwicknot yet classifiedAllan Chapmannot yet classifiedWinston Churchill14px GAEdward Hyde, 1st Earl of Clarendonnot yet classifiedAlan Clarknot yet classifiedKenneth Clarknot yet classifiedBob Clarke (historian)not yet classifiedRobert Conquestnot yet classifiedCharles Henry Coopernot yet classifiedWilliam Coxenot yet classifiedMandell Creightonnot yet classifiedAndrew Dalbynot yet classifiedSamuel Danielnot yet classifiedBasil Davidsonnot yet classifiedGodfrey Daviesnot yet classifiedChristopher Dawsonnot yet classifiedGoldsworthy Lowes Dickinsonnot yet classifiedDavid Diringernot yet classifiedJohn Andrew Doylenot yet classifiedWilliam Dugdalenot yet classifiedAlfred Duggannot yet classifiedThomas Henry Dyernot yet classifiedBryan Edwardsnot yet classifiedLeonard Elliott Elliot-Binnsnot yet classifiedThomas Elmhamnot yet classifiedGeorge Finlaynot yet classifiedMoses I. Finleynot yet classifiedPercy Hethrington Fitzgeraldnot yet classifiedRobin Lane Foxnot yet classifiedJames Anthony Froudenot yet classifiedFrancis Aidan Cardinal Gasquetnot yet classifiedGeoffrey the Bakernot yet classifiedEdward GibbonStartMartin Gilbertnot yet classifiedRobert Gildeanot yet classifiedMary Anne Everett Greennot yet classifiedVivian H. H. Greennot yet classifiedHenry Melvill Gwatkinnot yet classifiedE. E. Y. Halesnot yet classifiedEdward Hallnot yet classifiedHenry Hallamnot yet classifiedJohn Hardyngnot yet classifiedEdward Hastednot yet classifiedPeter Hennessynot yet classifiedHenry of Huntingdonnot yet classifiedChristopher Hibbertnot yet classifiedAndrew Hignellnot yet classifiedChristopher Hill (historian)not yet classifiedHarry Hinsleynot yet classifiedPatricia Hollis, Baroness Hollis of Heighamnot yet classifiedJ. C. Holtnot yet classifiedW. G. Hoskinsnot yet classifiedWilliam Howittnot yet classifiedBettany Hughesnot yet classifiedWilliam Hutton (Birmingham historian)not yet classifiedDavid Irvingnot yet classifiedCatherine Jacksonnot yet classifiedJohn Heneage Jessenot yet classifiedJohn S. Conwaynot yet classifiedJohn of Hexhamnot yet classifiedJohn Jortinnot yet classifiedJohn Keaynot yet classifiedIan Kershawnot yet classifiedAlexander William Kinglakenot yet classifiedHenry Knightonnot yet classifiedRichard Knollesnot yet classifiedPeter Laslettnot yet classifiedBernard Lewisnot yet classifiedJohn Lingardnot yet classifiedCatherine Macaulaynot yet classifiedThomas Babington Macaulay, 1st Baron Macaulaynot yet classifiedDiarmaid MacCullochnot yet classifiedJohn Maddicottnot yet classifiedHenry James Sumner Mainenot yet classifiedFrederic William Maitlandnot yet classifiedNoel Malcolmnot yet classifiedGeorge Bruce Mallesonnot yet classifiedTheodore Augustine Mannnot yet classifiedThomas Maynot yet classifiedCharles Merivalenot yet classifiedWilliam Nassau Molesworthnot yet classifiedPhilip Morantnot yet classifiedJames Augustus Cotter Morisonnot yet classifiedLewis Bernstein Namiernot yet classifiedJohn Julius Norwichnot yet classifiedDimitri Obolenskynot yet classifiedRichard Ollardnot yet classifiedRobin Osbornenot yet classifiedHenry Nutcombe Oxenhamnot yet classifiedFrancis Palgravenot yet classifiedMatthew Parisnot yet classifiedC. Northcote Parkinsonnot yet classifiedMichael Pearsonnot yet classifiedLiza Picardnot yet classifiedCharles Plummernot yet classifiedAlbert Pollardnot yet classifiedFrederick York Powellnot yet classifiedF. M. Powickenot yet classifiedJohn Prebblenot yet classifiedH. F. M. Prescottnot yet classifiedAnthony Preston (naval historian)not yet classifiedJames Rennellnot yet classifiedRicardian (Richard III)not yet classifiedRichard of Hexhamnot yet classifiedAndrew Robertsnot yet classifiedMichael Roberts (historian)not yet classifiedJohn C. G. Röhlnot yet classifiedFrederick Rolfenot yet classifiedJohn Holland Rosenot yet classifiedEmma Georgina Rothschildnot yet classifiedMichael Ernest Sadlernot yet classifiedJohn Saltmarshnot yet classifiedDominic Sandbrooknot yet classifiedNigel Saulnot yet classifiedSimon Schamanot yet classifiedJohn Robert Seeleynot yet classifiedMartin Sharp (journalist)not yet classifiedJane Shawnot yet classifiedWalter Sichelnot yet classifiedRaleigh Ashlin Skeltonnot yet classifiedDavid Smith (historian)not yet classifiedRichard Southernnot yet classifiedGeorge Speaightnot yet classifiedJohn Spelmannot yet classifiedDavid Starkeynot yet classifiedLawrence Stonenot yet classifiedAgnes Stricklandnot yet classifiedJohn Strypenot yet classifiedWilliam Stubbsnot yet classifiedRichard Talbertnot yet classifiedWilliam Woodthorpe Tarnnot yet classifiedAlasdair and Hettie Taylernot yet classifiedA. J. P. Taylornot yet classifiedArnold Fitz Thedmarnot yet classifiedConnop Thirlwallnot yet classifiedThomas Wykesnot yet classifiedE. P. Thompsonnot yet classifiedEmma Elizabeth Thoytsnot yet classifiedH. W. Timperleynot yet classifiedHugh Tootellnot yet classifiedJoshua Toulminnot yet classifiedMichael Trappes-Lomaxnot yet classifiedG. M. Trevelyannot yet classifiedSir George Trevelyan, 2nd Baronetnot yet classifiedHugh Trevor-Roper, Baron Dacre of Glantonnot yet classifiedAndrew White Tuernot yet classifiedSharon Turnernot yet classifiedKenneth Turpinnot yet classifiedRobert Vaughannot yet classifiedOrderic Vitalisnot yet classifiedAndrew Wallace-Hadrillnot yet classifiedSpencer Walpolenot yet classifiedAdolphus William Wardnot yet classifiedVeronica Wedgwoodnot yet classifiedJohn Wheeler-Bennettnot yet classifiedThomas Abingtonnot yet classifiedArthur Agardenot yet classifiedJohn Yonge Akermannot yet classifiedAnthony Allennot yet classifiedJohn Anstisnot yet classifiedJohn Anstis, youngernot yet classifiedElias Ashmolenot yet classifiedJohn Aubreynot yet classifiedJoseph Ayloffenot yet classifiedThomas Baker (antiquarian)not yet classifiedChristopher Barkernot yet classifiedDaines Barringtonnot yet classifiedJohn Thomas Blightnot yet classifiedMatthew Bloxamnot yet classifiedWilliam Copeland Borlasenot yet classifiedJohn Brandnot yet classifiedEdward Wedlake Brayleynot yet classifiedWilliam Bright, D.D.not yet classifiedJohn Britton (antiquary)not yet classifiedGeorge Bucknot yet classifiedWilliam Bullock (collector)not yet classifiedRichard Burnnot yet classifiedRichard Carewnot yet classifiedRichard Chandlernot yet classifiedSimonds d'Ewesnot yet classifiedJohn Evans (archaeologist)not yet classifiedLewis Evans (collector)not yet classifiedFrederick William Fairholtnot yet classifiedThomas Dudley Fosbrokenot yet classifiedAugustus Wollaston Franksnot yet classifiedJohn Frerenot yet classifiedRichard Gough (antiquarian)not yet classifiedEdwin Guestnot yet classifiedJohn Guillimnot yet classifiedRobert Stephen Hawkernot yet classifiedThomas Hearnenot yet classifiedJoseph Hunternot yet classifiedKenneth Hamilton Jenkinnot yet classifiedJohn Battelynot yet classifiedWilliam Lambardenot yet classifiedAshton Levernot yet classifiedCharles Herbert Mayonot yet classifiedWilliam Nicolsonnot yet classifiedWilliam Oldysnot yet classifiedFrancis Pecknot yet classifiedMargaret Bentinck, Duchess of Portlandnot yet classifiedJames Prinsepnot yet classifiedGerald Henry Rendallnot yet classifiedJoseph Ritsonnot yet classifiedJohn Seldennot yet classifiedCharles Hamilton SmithStubHenry Spelmannot yet classifiedJohn Stownot yet classifiedWilliam Stukeleynot yet classifiedMerlin Hanbury-Tracy, 7th Baron Sudeleynot yet classifiedJohn Timbsnot yet classifiedRoger Twysdennot yet classifiedGeorge Vertuenot yet classifiedJohn Weevernot yet classifiedAnthony Woodnot yet classifiedThomas Wrightnot yet classifiedJohn Aylmer (English constitutionalist)not yet classifiedWalter Bagehotnot yet classifiedA. V. Diceynot yet classifiedGeoffrey Rudolph Eltonnot yet classifiedStephen Gardinernot yet classifiedJohn Hooker (English constitutionalist)not yet classifiedJames I of Englandnot yet classifiedErskine May, 1st Baron Farnboroughnot yet classifiedWilliam Stoughton (English constitutionalist)not yet classifiedEdward Aglionbynot yet classifiedEdward Bellasisnot yet classifiedWalter Blountnot yet classifiedJohn Brooke-Littlenot yet classifiedWilliam Brugesnot yet classifiedSamuel Egerton Brydgesnot yet classifiedBernard Burkenot yet classifiedAlfred Butlernot yet classifiedClive Cheesmannot yet classifiedPeter Wilson Coldhamnot yet classifiedRodney Dennysnot yet classifiedGilbert Dethicknot yet classifiedWilliam Dethicknot yet classifiedAlan Dickinsnot yet classifiedPatric Laurence Dickinsonnot yet classifiedArthur Charles Fox-Daviesnot yet classifiedJames Frerenot yet classifiedRichard Graham-Viviannot yet classifiedEverard Greennot yet classifiedPeter Gwynn-Jonesnot yet classifiedIsaac Heardnot yet classifiedCecil Humphery-Smithnot yet classifiedWilliam Hunt (officer of arms)not yet classifiedThomas Joseph-Watkinnot yet classifiedGregory Kingnot yet classifiedHenry Lane (officer of arms)not yet classifiedEdmund Lodgenot yet classifiedRoger Machado (officer of arms)not yet classifiedMichael Maclagannot yet classifiedHenry Robert Charles Martinnot yet classifiedRobin de la Lanne-Mirrleesnot yet classifiedNicholas Harris Nicolasnot yet classifiedPeter O'Donoghuenot yet classifiedHenry Paston-Bedingfeldnot yet classifiedJohn Philipotnot yet classifiedLeslie Pinenot yet classifiedJames Planchénot yet classifiedArchibald Russellnot yet classifiedAlfred Scott-Gattynot yet classifiedWilfrid Scott-Gilesnot yet classifiedRichard St Georgenot yet classifiedFrancis Thynnenot yet classifiedAubrey Toppinnot yet classifiedCharles Townley (officer of arms)not yet classifiedWilliam Barclay Turnbullnot yet classifiedArthur Vicarsnot yet classifiedAnthony Wagnernot yet classifiedJohn Walker (officer of arms)not yet classifiedJohn Warburton (officer of arms)not yet classifiedDavid White (officer of arms)not yet classifiedCharles Wriothesleynot yet classifiedThomas Wriothesleynot yet classifiedJohn Writhenot yet classifiedLionel Barnettnot yet classifiedRichard Francis Burtonnot yet classifiedJoseph Dacre Carlylenot yet classifiedBasil Hall Chamberlainnot yet classifiedDuncan Forbesnot yet classifiedNathaniel Brassey Halhednot yet classifiedThomas Hydenot yet classifiedWilliam Jones (philologist)not yet classifiedEdward William Lanenot yet classifiedSamuel Leenot yet classifiedWilliam Marsden (orientalist)not yet classifiedReynold A. Nicholsonnot yet classifiedE. A. Wallis Budgenot yet classifiedCharles Wilkinsnot yet classifiedEdit by PockBot (on behalf of PocklingtonDan)"]}, {"page": "Box, Wiltshire", "response": ["The Romans built the Fosse Way about  to the west. Near the present-day Box church is the site of a Roman country house which was excavated during the 19th century, then in 1902–1903 by Harold Brakspear, and again in 1967–1968. Nothing is visible today, as the remains lie under later buildings, gardens and the churchyard. There was a major rebuilding in the late 3rd or early 4th century which changed it into the largest villa in the Bath area. The villa had one of the richest collections of mosaic floors of any building in Roman Britain, with remains found to date in 20 rooms, there being 42 rooms positively identified in the main villa and 15 more under investigation. Room 26 appears to be a major presence chamber in the manner of that at Trier. A villa such as this would have been the centre of a large estate and the focus of interest for at least six possible subsidiary villas or farmsteads at Ditteridge, Hazelbury and Shockerwick (near Bathford) and those further afield at Colerne, Atworth, and Bradford on Avon."]}, {"page": "Abbey House Gardens", "response": ["The house and its grounds were handed down through the Stumpe family, which by the time of the English Civil War had married into the Ivey family. The house remained in private hands and in the 1920s was bought by Captain Elliot Scott McKirdy, who (with architect Harold Brakspear) enlarged the house to its current size of  by adding a nursery wing and servants' quarters, keeping the same exterior style. The building was recorded as Grade I listed in 1949. The house was bought in 1968 by the Deaconess Community of St Andrew, who ran it as a base for parish ministry and as a home for its elderly sisters and guests until 1990."]}, {"page": "Lewes Priory", "response": ["Modern understanding of the layout and development of the Priory derives largely from archaeological excavations carried out since the 1840s, most extensively by George Somers Clarke. The accepted plan of the Priory was drawn by archaeologist and antiquary Sir William Henry St. John Hope and architect Sir Harold Brakspear in 1906 based upon archaeology, documented accounts and hypothesis. Aspects of this have been better explored by later research and excavation. The structural bay division shown of the nave is probably wrong, being elongated in a way inconsistent with Romanesque planning modules and different from that of the choir, the Lady Chapel is missing and certain lay buildings are also not shown. This is, nonetheless, the best guide available and a potent diagram."]}, {"page": "Bewley Common", "response": ["Bewley Court is a Grade I listed manor house from the 14th century or early 15th. The house was restored and extended c. 1920 to designs by Harold Brakspear, and was the home of interior designer Oliver Ford until his death in 1992."]}, {"page": "Seagry", "response": ["Seagry House at Upper Seagry was a five-bay mansion built in the 18th century by Nathaniel Stratton and extended to designs of Harold Brakspear in 1915. The house was rebuilt after a 1949 fire but the 18th-century gatepiers at the east and south entrances survive."]}, {"page": "George Fuller (British politician)", "response": ["Fuller married Emily Georgina Jane Hick Beach, second daughter of Sir Michael Hicks Beach, 8th Baronet, and sister of Lord St Aldwyn, in 1864.  Fuller purchased Great Chalfield Manor, neighbouring his Neston Park estate, in 1878, at first for its farmland. The late mediaeval property was later occupied and restored by his fourth son Robert, under the direction of noted architect Harold Brakspear."]}, {"page": "Hazelbury Manor", "response": ["The manor was purchased by the Speke family in the early 17th century and passed to the Northey family in the early 18th century. In the early 20th century, George Jardine Kidston (1873–1954) bought it and restored it with the help of the architect Harold Brakspear, at the same time enlarging the house considerably in an architecturally sensitive fashion. Kidston wrote a book on its history, published in 1936."]}, {"page": "Stanley Abbey", "response": ["At various times since, remains such as burial places and a blacksmith's forge, as well as coins and tiles, have been found. Harold Brakspear's 1905 excavation discovered the layout of the monastery, including the church, infirmary and a dovecote."]}, {"page": "Little Sodbury Manor", "response": ["The Duke of Beaufort inherited the house in 1910 and sold it to Lord Hugh Grosvenor and in 1919 Baron de Tuyll. They employed the architect Sir Harold Brakspear for restoration."]}, {"page": "St George's Chapel, Windsor Castle", "response": ["By the early twentieth century, the bowing walls, cracked vaulting, decayed stone and stripped lead required urgent attention. In 1920 a much needed ten-year restoration project began at George's Chapel, overseen by the consulting architect Sir Harold Brakspear."]}, {"page": "Malmesbury", "response": ["Abbey House was rebuilt c. 1540 by William Stumpe or his son James, on the site of a 13th-century building within the abbey grounds; Harold Brakspear carried out 20th-century enlargement. Today Abbey House Gardens are operated as a tourist attraction."]}, {"page": "Nuneaton Priory", "response": ["The Church has been partially restored. The nave was rebuilt in 1876 on the old foundations by the Gothic Revival architect C.C. Rolfe. The chancel was rebuilt in 1906, and then the north transept in 1931 by Harold Brakspear."]}, {"page": "Brownston House", "response": ["The Misses Bidwells' Ladies Boarding School, sometimes called a Seminary, occupied Brownston House from 1859 to 1901. From 1901 until about 1929 or later the house was occupied by the two unmarried daughters of Henry S. Hilman, a barrister of Kent, Worcestershire, and Kensington, who had died in 1893. Architectural plans for 'alterations and additions' to Brownston House by the architect Harold Brakspear drawn up in December 1901 are preserved in the Wiltshire and Swindon Archives. Miss Bertha M. Hilman was still living in the house in December 1928, after the death of her sister, but she died in 1929. The house then became a nurses' hostel for the Devizes and District Hospital. When no longer required for this purpose, it fell into disrepair and was bought by Kennet District Council, which undertook a programme of restoration and repair. After that, it was used as a doctor's surgery and as offices for Wiltshire County Council's Social Services department, until being sold by Kennet in 2000 to a company called Renelec, plumbing & heating engineers, to be used once again as offices."]}, {"page": "St Cyriac's Church, Lacock", "response": ["In the late 1800s, the new owners of Lackham House, the Baynard family, had the then named Lackham chapel, now the Lackham or Baynard, chapel completely rebuilt. A new roof was put on the transept, which was filled with north-facing pews for the Baynard family and their estate workers. In 1861, again funded by the Banyard family, A.W. Blomfield undertook restoration work on the church, including: raising of the transept roofs; a new front; breaking up of the high box pews; taking down the galleries and organ at the west end; breaking in half of ledger stones from the floor. In 1902, Sir Harold Brakspear remodelled the church in a way sympathetic to his friend and local resident, the photographic pioneer William Henry Fox Talbot."]}, {"page": "1931 New Year Honours", "response": ["*Harold Brakspear"]}, {"page": "William St John Hope", "response": ["He was involved in the Society of Antiquaries's report on the restorations and alterations at Bath by Charles Davis in the 1880s. His 1899 English Altars was the first publication of the Anglican traditionalist Alcuin Club. He assisted Sir Harold Brakspear in investigating Ludlow Castle in 1903 and in drawing the plans of Lewes Priory in 1906. He commissioned the Leeds Camera Club led by Godfrey Bingley to take photographs of Kirkstall Abbey for his book 'Architectural Description of Kirkstall Abbey' published in 1907. Between 1909 and 1915, he participated in the first major excavation of the hillfort at Old Sarum, along with William Hawley and Duncan Montgomerie."]}, {"page": "List of Knights Commander of the Royal Victorian Order appointed by George V", "response": ["|Harold Brakspear"]}, {"page": "Frederick Minter", "response": ["Minter was most passionate about his work on the restoration of St George's Chapel in Windsor Castle and with Hector Bolitho, authored a book about the project in 1925, The King's Beasts. The restoration included the replacement of The King's Beasts, the 41 effigies originally erected on the pinnacles of St. George's by Henry VII. Sir Christopher Wren (1632–1723) had ordered the effigies removed in 1682 after condemning the Reigate Stone, the calcareous sandstone of which they were constructed. Wren, who recognized the effigies added structural integrity to the roof, had suggested replacing them with carved stone pineapples (in vogue at the time), but it was never done. More than two centuries later, Sir Harold Brakspear finally had recommended replacing the effigies as part of his restoration of the chapel. Minter's involvement began with his father, who generously offered to cover the costs of the effigies, which were carved in the firm's own building yard. He also contributed £4,000 () to the St George's Chapel Restoration Fund. "]}, {"page": "Christ Church, Frome", "response": ["The lady chapel was built on to the church in 1929 by Harold Brakspear and projects from the wall of the building. The tower is supported by clasping buttresses."]}, {"page": "Church of St Thomas à Becket, Box", "response": ["In the 15th century, the tower was heightened with a bell installed and restoration took place in 1713. In 1831, due to the church being too small to meet demand the Victorians expanded the church. In 1896 Harold Brakspear carried out a renovation of the church. The high pews were removed and lowered along with the floor. The plaster on the wall was removed to reveal hidden memorials and 14th century encaustic tiles in the chancel which were also restored. The restoration cost £3,500  (£ in ). The Hazelbury Chapel was restored in 1926. In 1960, English Heritage granted the Church of St Thomas à Becket grade I listed status."]}]}}