{"wiki_id": "http://www.wikidata.org/entity/Q5667604", "itemLabel": "Harry Bunn", "itemDescription": "Footballer (born 1992)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Bunn", "wikipedia_page": {"main": "Harry Charles Bunn (born 21 November 1992) is an English professional footballer, who plays for Scunthorpe United.\nBorn in Oldham, Bunn began his career with Manchester City and transferred to Huddersfield Town in 2014. He was with Huddersfield for three seasons and then transferred to Bury ahead of the 2017–18 season. He has also spent time on loan at Rochdale, Preston North End, Oldham Athletic, Crewe Alexandra, York City and Sheffield United.", "link_mentions": [{"page": "Frankie Bunn", "response": ["Bunn's son, Harry Bunn, is a professional footballer, who plays for York City.https://mobile.twitter.com/YorkCityFC/status/1294355634838818821 "]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Harry Bunn||||2014–2017||64 (27)||15||4 (1)||2||2||0||0||0||0||0||70 (27)||17"]}, {"page": "2010–11 Premier Reserve League", "response": ["|align=\"left\"| Harry Bunn"]}, {"page": "2011–12 Preston North End F.C. season", "response": ["|FW||||39||Harry Bunn||1||0||0||0||1"]}, {"page": "2011–12 Oldham Athletic A.F.C. season", "response": ["|align=\"right\"|39||||FW||align=\"left\"|Harry Bunn", "| Harry Bunn"]}, {"page": "2012–13 Manchester City F.C. season", "response": ["|  Harry Bunn"]}, {"page": "Elvis Manu", "response": ["On 1 February 2016, Manu joined Championship club Huddersfield Town on loan until 2 May 2016. He made his Huddersfield debut as a substitute in a 2–1 defeat against Preston North End on 6 February 2016, coming on in the 78th minute for Harry Bunn."]}, {"page": "2012–13 Crewe Alexandra F.C. season", "response": ["*21 August 2012: Striker Harry Bunn joins the club from Manchester City on a six-month loan deal. Crewe beat Scunthorpe United 2–1 for their first win of the league campaign.", "|25||FW|| Harry Bunn|| Manchester City||Loan||21 August 2012||"]}, {"page": "2013–14 Manchester City F.C. season", "response": ["| style=\"text-align:center;\"| Harry Bunn", "| style=\"text-align:center;\"| Harry Bunn", "| style=\"text-align:center;\"| Harry Bunn"]}, {"page": "2013–14 Sheffield United F.C. season", "response": ["On the final day of the transfer window, United brought in young Belgian midfielder Florent Cuvelier from Stoke City on a three-year deal for an undisclosed fee and centre-forward Harry Bunn on a one-month loan deal from Manchester City. The following day the club announced that Saudi Prince Abdullah bin Mosaad Al Saud, of the royal House of Saud and former President of Al-Hilal FC, had bought a 50% stake in United's parent company 'Blades Leisure Ltd' for the fee of £1 with the promise of providing \"substantial new capital\" with the aim of returning the Blades to the Premier League as \"quickly as possible\". The same evening, United reached the second round of the Football League Trophy, despite failing to score for the third game in succession, winning a penalty shoot out over Scunthorpe United after the game had finished 0–0. Back in league action United were again the losing side as they were beaten 3–1 by near neighbours Rotherham United. Later that week, youngster Elliott Whitehouse was allowed to join York City on a month's loan to gain first team experience, before United's poor form continued as they slipped to a 1–0 defeat away at Carlisle United. With the side still struggling to score goals, United reached an agreement to bring in free agent Marlon King until the end of the season, quickly followed by winger Ryan Hall, who joined the Blades on a one-month loan from Leeds United. King and Hall both made their United debuts in the following game, a home fixture against Preston North End, but the Blades poor form continued as they fell to a 1–0 loss, their fifth consecutive defeat in the league and Preston's first victory at Bramall Lane since 1978. United ended the month with another defeat, this time a 2–0 away loss to Wolves.", "October began with the arrival of defender Simon Lappin who signed on a 28-day loan from Cardiff City on 4 October, while Chris Porter was allowed to leave in a similar deal for a spell with Chesterfield, and young striker Harry Bunn extended his own loan spell with the Blades for a further month. Lappin made his debut that same night as United scored their first goal in nearly seven hours of football, when Marlon King netted to earn a 1–1 home draw with Crawley Town. Another loss followed, this time to League Two Hartlepool United in the Football League Trophy, a match during which David Weir was barracked by the home support. This was to prove Weir's last game in charge as he was sacked three days later. With the club's Under-21s coach Chris Morgan in temporary charge once more, United dropped to the bottom of the League One table as they were defeated 3–2 by Coventry City. With United still to appoint a permanent successor to David Weir, Mick Wadsworth was appointed as first team coach on a temporary basis to support Chris Morgan, and the pair guided United to only their second win of the season as they beat Port Vale 2–1 at Bramall Lane. Ryan Hall returned to Leeds United, only to be immediately suspended by his parent club for a breach of discipline, while Morgan and Wadsworth remained in charge as United held Peterborough United to a mid-week 0–0 draw at their London Road Stadium. This was to prove Morgan's last game in charge of the Blades as former Derby County manager Nigel Clough was appointed as David Weir's permanent successor on 23 October 2013. Clough's tenure got off to a winning start as his new charges comfortably beat Crewe Alexandra 3–1 at Bramall Lane, before Clough made his first signing for the Blades a few days later, with Leeds United defender Aidan White joining on loan until New Year's Day.", "Clough's second game in charge proved less satisfactory, with Febian Brandy being sent off only twelve minutes after coming on as a substitute and United slumping to a 2–0 defeat at Shrewsbury Town on 2 November. With his loan spell due to expire, United agreed a further deal to keep Simon Lappin at the club until January. The first round of the FA Cup saw the Blades progressed after a 3–2 victory over Colchester United, before Joe Ironside was allowed to join Halifax Town on loan until 5 January. Back in league action United suffered another home defeat, this time at the hands of Gillingham who ran out 2–1 winners. Callum McFadzean was allowed to join Chesterfield on loan until 3 January, before United registered their first away win since March, defeating fellow strugglers Bristol City 1–0 thanks to an own goal. United's followed this up with a 1–1 draw in a midweek home fixture against Walsall. With the loan window about to close Darryl Westlake was loaned to Mansfield Town, Marcus Williams joined Scunthorpe United, and Harry Bunn returned to Manchester City. United rounded off November with a 1–1 draw at Leyton Orient thanks to Conor Coady's first goal in senior football.", "|Harry Bunn"]}, {"page": "2013–14 Huddersfield Town A.F.C. season", "response": ["On 24 June, after a noticeable lack of activity, Town made their first signing of the summer with Jon Stead returning to the club he left in January 2004 on a free transfer, after leaving Bristol City. Also joining Town on the same day was former loan signing Adam Hammill signed on an undisclosed fee from Wolverhampton Wanderers. The following day, Northern Ireland international Martin Paterson signed on a two-year deal following his release by Burnley. On 3 July, Norwich City striker James Vaughan, who had a successful loan spell the previous season, signed on a 3-year deal for an undisclosed fee. On 29 July, Town signed central midfielder Jonathan Hogg on a three-year deal from fellow Championship side Watford for an undisclosed fee. The following day, Spanish striker Cristian López signed from Atlético Baleares on a free transfer on a one-year deal, following a successful trial period. On 10 September, just as the loan window opened, Town signed Welsh international full-back Jazz Richards on a 93-day emergency loan from Premier League side Swansea City. As the loan window closed on 28 November, Town signed striker Harry Bunn on loan from Manchester City until 5 January 2014, mainly to be put into the team's development squad. He then cancelled his contract with City to sign a permanent deal with the Terriers on 20 January, until the end of the season. On 10 January, Town broke their transfer record in completing the signing of the Bermudan international striker Nahki Wells from Bradford City for a fee believed to be in the region of £1.5 million. On 15 January, Town made their 2nd big signing of the window, by bringing in the winger/striker Joe Lolley from Conference Premier side Kidderminster Harriers for a fee in the region of £250,000. On 21 January, Norwegian youth international midfielder Sondre Tronstad signed on a free transfer from IK Start.", "| Harry Bunn", "| Harry Bunn"]}, {"page": "2014–15 Huddersfield Town A.F.C. season", "response": ["|Harry Bunn", "|Harry Bunn"]}, {"page": "2015–16 Huddersfield Town A.F.C. season", "response": ["|Harry Bunn", "|Harry Bunn"]}]}}