{"wiki_id": "http://www.wikidata.org/entity/Q5667642", "itemLabel": "Harry Burrows", "itemDescription": "English footballer (born 1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Burrows", "wikipedia_page": {"main": "Henry \"Harry\" Burrows (born 17 March 1941) is an English former professional footballer who played in the Football League for Aston Villa, Plymouth Argyle and Stoke City.", "link_mentions": [{"page": "Abbots Bromley", "response": ["Abbots Bromley also has a fast developing men's senior football team, Abbots Bromley FCAbbots Bromley FC  retrieved 14 April 2013 They are nicknamed 'The Stags'. They were reformed after over 10 years in 2010. They play in the Stafford & District league in division 2 and play their home games at the Abbots Bromley School grounds named 'The Lowers'. The Stags main sponsors are Gallery 3, The Room Network & Edwin Ferneyhough Vehicle Sales. The president of the club is former Aston Villa & Stoke City footballer, Harry Burrows.", "President - Harry Burrows", "* Harry Burrows (born 1941) an English former professional footballer who played 420 pro games, mainly for Aston Villa and Stoke City. He lived in Abbots Bromley after retirement where he is still the president of Abbots Bromley FC"]}, {"page": "Haydock", "response": ["*Harry Burrows footballer"]}, {"page": "Jimmy Greenhoff", "response": ["In August 1969, he left Birmingham for Tony Waddington's Stoke City in a deal worth £100,000, which was a club record for Stoke. He made the switch despite late interest from Everton. He hit nine goals in 37 games in 1969–70, a tally beaten by strike partners Harry Burrows and John Ritchie. He slotted in seamlessly in the team, connecting Ritchie with the midfield by feeding off Ritchie's knock-downs and bringing the wide players into the game. In 1970–71 he hit ten goals in 43 games, appearing in Stoke's FA Cup semi-final defeat to eventual winners Arsenal. He missed an easy chance that would have put Stoke 3–0 ahead, and in an interview in 2011 he said the miss \"still gets to me\"."]}, {"page": "List of Aston Villa F.C. seasons", "response": ["|Harry Burrows", "|Harry Burrows"]}, {"page": "1963 Football League Cup Final", "response": ["|11||  Harry Burrows", "|11||  Harry Burrows"]}, {"page": "Burrows (surname)", "response": ["* Harry Burrows (b. 1941), former English footballer"]}, {"page": "1961 Football League Cup Final", "response": ["|11|| Harry Burrows"]}, {"page": "1969–70 Football League", "response": ["|22||align=left|  Harry Burrows ||align=left| Stoke City ||15||0||0||—||15"]}, {"page": "1960–61 Football League Cup", "response": ["The tournament was won by Aston Villa, who beat Rotherham United 3–2 on aggregate after extra time. Rotherham won the first leg 2–0 at Millmoor, their home ground thanks to goals from Alan Kirkman and Barry Webster. In the second leg at Villa Park, Harry Burrows and Peter McParland levelled the tie on aggregate and Alan O'Neill scored in extra-time to win the cup for Aston Villa."]}, {"page": "List of Stoke City F.C. seasons", "response": ["|align=left| Harry Burrows, Peter Dobing", "|align=left| John Ritchie, Harry Burrows"]}, {"page": "1964–65 Stoke City F.C. season", "response": ["More veterans arrived at Stoke during the season with the arrivals of Maurice Setters, Roy Vernon and Harry Burrows helping Stoke to finish in 11th position, winning and losing 16 matches.", "|align=\"left\"|FW||align=\"left\"| Harry Burrows"]}, {"page": "1965–66 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Burrows"]}, {"page": "1966–67 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Burrows"]}, {"page": "1967–68 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Burrows"]}, {"page": "1968–69 Stoke City F.C. season", "response": ["At the end of the season in May 1969 Stoke City embarked on an end of season tour which saw them play against Congo Kinshasa (drew 1–1) and then on to Spain where they played against Catalonia giants Barcelona. The match was played in front of 65,000 at the Camp Nou and Stoke shocked the prestigious hosts with a 3–2 victory. David Herd scored twice and Harry Burrows hit a third to put Stoke into a 3–0 lead at half-time. Barcelona fought back scoring twice through Carles Rexach and Pedro Zabalza but a  Stoke held on for a splendid victory.", "|align=\"left\"|FW||align=\"left\"| Harry Burrows"]}, {"page": "1969–70 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Burrows"]}, {"page": "1970–71 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Burrows"]}, {"page": "1971–72 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Burrows"]}, {"page": "1972–73 Stoke City F.C. season", "response": ["After winning the League Cup last season there was a number of notable departures during the early part of the season. They sold Mike Bernard to Everton for a record £140,000, with the money being spent on Jimmy Robertson from Ipswich Town and World Cup winner Geoff Hurst from West Ham United. Stoke now had an abundance of attacking talent but both Harry Burrows and Peter Dobing decided to retire during the season.", "|align=\"left\"|FW||align=\"left\"| Harry Burrows"]}, {"page": "List of Stoke City F.C. records and statistics", "response": ["|13||align=\"left\"| Harry Burrows||1965–1973||68||5||3||0||76"]}]}}