{"wiki_id": "http://www.wikidata.org/entity/Q5660291", "itemLabel": "Harold Cartwright", "itemDescription": "cricketer (born 1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Cartwright", "wikipedia_page": {"main": "Harold (\"Harry\") Cartwright (born 12 May 1951) is a former English cricketer who played cricket for Derbyshire between 1971 and 1979.Cartwright was born at Halfway, Derbyshire. He began his career in the Derbyshire Second XI in 1971 and played matches in the John Player League during the 1971 season. His debut first-class game during the 1973 season, a defeat against Warwickshire. Later in the season he played against the travelling New Zealanders, as Derbyshire finished 1973 with a mere two victories.\nCartwright continued for a year in the first team, and, despite only playing a single first-team match throughout the 1975 season, was back into the first team in 1976 after an impressive run for the Second XI. He continued in the first team until 1979, scoring a half century in his final County Championship game in 1979. The Derbyshire native recorded one first-class century, a 141* against Warwickshire in 1977.\nWith the Derbyshire first team, Cartwright was an upper-middle-order batsman. He was a right-handed batsman and a wicket-keeper\nCartwright played in the Final of the Tilcon Trophy in 1977, and, for Bassetlaw and District Cricket League, in the 1987 LCC President's Trophy final. He played one match with Marylebone Cricket Club in 1995.", "link_mentions": [{"page": "Mount St Mary's College", "response": ["* Harold Cartwright, cricketer who taught cricket and mathematics"]}, {"page": "Cartwright (surname)", "response": ["* Harold Cartwright (born 1951), English cricketer", "* Harold Cartwright, a protagonist from Grand Theft Auto: London 1969 and Grand Theft Auto: London 1961"]}, {"page": "Derbyshire County Cricket Club in 1971", "response": ["Anthony Borrington and Ashley Harvey-Walker, who made their first-class debuts in the season, went on to play for several more seasons for Derbyshire. Harvey-Walker achieved a unique distinction by scoring a century in his debut match.  Another newcomer, David Wilde, played  in this and the following season. Leslie Bradbury made his single first-class cricket appearance in one match for Derbyshire. Harold Cartwright, only played one-day cricket for Derbyshire in this his initial season, but stayed with the club for several seasons  "]}, {"page": "Harry Cartwright", "response": ["#REDIRECTHarold Cartwright"]}]}}