{"wiki_id": "http://www.wikidata.org/entity/Q5660473", "itemLabel": "Harold Day", "itemDescription": "English cricketer (1898-1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Day_(sportsman)", "wikipedia_page": {"main": "Harold Lindsay Vernon Day (12 August 1898, Darjeeling, Bengal, India - 15 June 1972, Hadley Wood, Hertfordshire, England) was an English rugby union footballer who played wing for Leicester Tigers and England.", "link_mentions": [{"page": "Bedford Modern School", "response": ["* England Rugby Caps: Horace Finlinson, WB Thomson, Edgar Mobbs (Captain), Arthur Gilbert Bull, Dick Stafford, Harold Day, Dickie Jeeps CBE (Captain) and Lionel Edward Weston"]}, {"page": "H.L.V. Day", "response": ["#REDIRECT Harold Day (sportsman)"]}, {"page": "H. L. V. Day", "response": ["#REDIRECT Harold Day (sportsman)"]}, {"page": "1922 Five Nations Championship", "response": ["England: BS Cumberlege (Blackheath), CN Lowe (Blackheath), EDG Hammett (Blackheath), E Myers (Bradford), Harold Day (Leicester), VG Davies (Harlequins), CA Kershaw (US Portsmouth), R Edwards (Newport), ER Gardener (Devonport Services), JS Tucker (Bristol), Wavell Wakefield (Harlequins), AF Blakiston (Blackheath), AT Voyce (Gloucester), GS Conway (Cambridge U), LG Brown (Blackheath) (capt.)"]}, {"page": "Jerry Shea", "response": ["Born in Newport in 1892, Shea initially played rugby union with Pill Harriers, a notoriously tough team from Newport Docks. It was with Pill that Shea gained his first cap for Wales, against the post-war touring New Zealand Army. in 1919, like many Pill players, he switched to Newport RFC, the Harriers first-class rivals. The next year he was selected to play for Wales against England at St. Helens in the Five Nations Championship. Unsurprisingly for teams meeting for the first time since the end of the First World War, both teams contained many new caps. It was in this match that Shea would make history by scoring a try, conversion, drop goal, and penalty goal, the first player to do so at an international level.Griffiths (1988), pg 74. In a rain swept match, Shea opened the scoring in the first half with a penalty goal against the wind. England responded with a try and conversion, both from Harold Day, to take the first half 5–3. Within five minutes of the restart, Shea had drop kicked Wales back into the lead. With twenty minutes remaining, and the Welsh forwards in command, Shea broke through the English defence to score a try under the posts which he easily converted. Wick Powell then scored a second try for Wales, before Shea finished the match with another drop goal, for a convincing Welsh win.Griffiths (1988), pg 75."]}, {"page": "List of cricket and rugby union players", "response": ["| Harold Day"]}, {"page": "List of England national rugby union players", "response": ["|546||Harold Day||wing ||1920-01-17||v Wales at Swansea"]}, {"page": "Day (surname)", "response": ["* Harold Day, English rugby player", "* Harold Day, Welsh World War I flying ace"]}, {"page": "Doug Prentice", "response": ["Prentice began his rugby career with local side Westleigh, at the time Leicester was strictly an invitation only club and his debut for side came on 26 November 1923 away to Neath, Tigers lost 37–6 but Prentice scored one of Leicester's two tries.  Prentice quickly established himself in the Leicester's first choice side playing 24 of the season's 30 remaining games.  Forwards' positions were not specialized in this period and he is recorded simply as playing \"forward\" until the 1927–28 season.  From then onward Prentice is recorded as having mainly played prop for Leicester, despite his international caps coming at either Number 8 or Lock. Prentice was a regular try scorer for Leicester scoring 7 tries in his first season and 8 in 31 games the next.  By 1926 Prentice had become Leicester's secondary goal-kicker, taking the duties when club captain Harold Day was not selected."]}, {"page": "Harold Day", "response": ["Harold Day may refer to:", "*Harold Day (Australian footballer) (1890–1961), Australian rules footballer", "*Harold Day (Royal Navy officer) (1897–1918), Welsh-born World War I flying ace", "*Harold Day (sportsman) (1898–1972), English rugby union footballer and cricketer"]}, {"page": "List of Gentlemen cricketers (1841–1962)", "response": ["* Harold Day (1924)"]}, {"page": "List of Leicester Tigers players selected for international rugby", "response": ["|16||Harold Day||Wing||||1920-01-17||"]}, {"page": "List of Leicester Tigers records and statistics", "response": ["| 7 ||  || CE || style=\"text-align:left;\"| Harold Day || 1918–1929 || 212 || 108 || 281 || 81 || 4 || 2 || 1,151"]}, {"page": "Wilfrid Lowry", "response": ["Unusually, Lowry received his first cap for England against Wales on 17 January 1920, without actually playing. Lowry was photographed with the team, and presented with his cap,Curious Caps, The Rugby History Society but was replaced by Harold Day (then representing the Army) just before kick-off. The selectors felt that the conditions would suit Day better and he scored and converted England's only try of the game. Day said:"]}, {"page": "1924–25 Rugby Union County Championship", "response": ["| ||Harold Day  ||    Leicester"]}]}}