{"wiki_id": "http://www.wikidata.org/entity/Q5669913", "itemLabel": "Harry Hyams", "itemDescription": "English businessman (1928-2015)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Hyams", "wikipedia_page": {"main": "Harry John Hyams (2 January 1928 – 19 December 2015) was a British millionaire who initially made his money as a speculative property  developer. He was best known as the developer of the Centre Point office building in London.", "link_mentions": [{"page": "Centre Point", "response": ["Centre Point was built as speculative office space by property tycoon Harry Hyams, who had leased the site at £18,500 a year for 150 years. Hyams intended that the whole building be occupied by a single tenant, and negotiated fiercely for its approval."]}, {"page": "Oxford Street", "response": ["Centre Point, just beyond the eastern end of Oxford Street next to Tottenham Court Road station, was designed by property developer Harry Hyams and opened in 1966. It failed to find a suitable tenant and remained empty for many years before being occupied by squatters who used it as a centre of protest against the lack of suitable accommodation in central London. In 2015, building work began to convert it into residential flats, with development expected to finish in 2017."]}, {"page": "St Giles Circus", "response": ["The area today is dominated by Centre Point Tower, located on the south-east corner on New Oxford Street and Charing Cross Road. Built between 1963 and 1966 by developer Harry Hyams, the brutalist tower was London's first \"skyscraper\", and is now a Grade II listed building."]}, {"page": "Royal Albert Dock, Liverpool", "response": ["Despite this recognition, the increasing debts of the MDHB meant that by the 1960s the company was eager to get rid of the Albert Dock. Having considered demolishing the buildings and redeveloping the land, the MDHB soon entered negotiations to sell the land to Oldham Estates, a property developer owned by Harry Hyams. Many plans for the site were developed including one that envisioned the development of a mini city that would provide 10m sq feet of letting space, hotels, restaurants, bars and underground parking in the drained dock basin. With the council reluctant to allow such a grandiose development to occur and with the huge public opposition to it (inspired at least in part by the work of Quentin Hughes), Oldham Estates were forced into scaling-down the plan and so in 1970 returned with a new vision known as \"Aquarius City\", which had as its centrepiece a 44-storey skyscraper. Once again the plan failed to develop and no sooner had it been announced, than the MDHB's financial problems reached crisis point, Oldham Estates withdrew their deposit and the whole scheme fell through."]}, {"page": "Ramsbury", "response": ["The village's notable residents have included Sir Francis Burdett (1770–1844), a radical Whig politician, and his daughter Angela Burdett-Coutts. In 1837 Angela became the richest woman in England when she inherited her grandfather's fortune. Over several years she gave most of this money away to good causes: nearly three million pounds by the time she died in 1906. Both lived in Ramsbury Manor. Other owners of the manor include William Rootes (from 1958), industrialist and motor manufacturer; and Harry Hyams (from 1964 until his death in 2015), property developer."]}, {"page": "Lunar House", "response": ["The building was completed in 1970. In common with a neighbouring building Apollo House and others developed by Harry Hyams, the  building's name was inspired by the landing of Apollo 11 on the Moon in 1969. During the 1970s and 1980s the building housed some offices of the Property Services Agency."]}, {"page": "Hyams", "response": ["* Harry Hyams, English millionaire and real estate developer"]}, {"page": "1966 in the United Kingdom", "response": ["*Centre Point, a 32-floor office building at St Giles Circus in London, designed by Richard Seifert for property speculator Harry Hyams, is completed. It remains empty for around a decade."]}, {"page": "1928 in the United Kingdom", "response": ["* 2 January – Harry Hyams, property speculator (died 2015)"]}, {"page": "The Johnson Gang", "response": ["On 1 February 2006, the gang perpetrated their biggest theft when they burgled Ramsbury Manor, the home of Harry Hyams, near Marlborough in Wiltshire. The theft is believed to be the largest domestic burglary in the United Kingdom. Prosecutor Paul Reid said that:"]}, {"page": "List of performers on Frank Zappa records", "response": ["| Harry Hyams"]}, {"page": "Apollo House (Croydon)", "response": ["Apollo House is a 22-storey high-rise office building at 36 Wellesley Road in the London Borough of Croydon, London, England. In common with a neighbouring building Lunar House and others developed by Harry Hyams, the building's name was inspired by the Apollo 11 moon landing in 1969."]}, {"page": "Ramsbury Manor", "response": ["After the death of Sir Francis Burdett, 8th Baronet, in 1951, the house and much of its land were bought by the 7th Earl of Wilton, who sold the house and its surrounding land to industrialist William Rootes in 1958; he was created Baron Rootes, of Ramsbury in the County of Wiltshire, in 1959. After his death in December 1964, the estate was bought by the property developer Harry Hyams and was his home until his death in 2015. The purchase price was £650,000 and the Guinness Book of Records for 1966 described it as \"the most expensive house in Britain\".Guinness Book of Records (1966)"]}, {"page": "2015 in the United Kingdom", "response": ["**Harry Hyams, 87, property developer (Centre Point)."]}, {"page": "Princess Svanevit", "response": ["===Fourth owner - Harry Hyams===", "In 1958 British property developer Harry Hyams became the fourth owner, renaming her Barranquilla and sailing her on the Solent with Hamble as home port.", "For many years the whereabouts of Princess Svanevit were unknown. In 2007 Swedish yacht enthusiast Bobby Cyrus read on an Internet forum that the yacht was berthed in England in a rather decrepit state of repair. After ten years of discussions with Harry Hyams and later his estate Cyrus managed to buy the yacht and transport it to Sweden, where it is undergoing restoration in the hands of Andreas Milde at Stockholms Båtsnickeri in Fisksätra."]}, {"page": "Deaths in December 2015", "response": ["*Harry Hyams, 87, British property developer (Centre Point)."]}, {"page": "One Kemble Street", "response": ["One Kemble Street and Civil Aviation Authority House (CAA House), originally known jointly as Space House, is an architecturally notable building off Kingsway in the London Borough of Camden. It is a grade II listed building with Historic England. Like nearby Centre Point, it was built for the developer Harry Hyams as part of the 1960s commercial property boom and kept empty for several years after completion.", "The building was designed by George Marsh, a partner in Richard Seifert's architectural firm, for Oldham Estates, the vehicle for the developer Harry Hyams, and built between 1964 and 1968 by Robert McAlpine and Sons. Marsh had also designed the nearby Centre Point, also for Hyams. The consulting engineers were C.J. Pell & Partners.1 Kemble Street. skyscrapernews.com 11 February 2015. Retrieved 12 January 2017."]}, {"page": "MY Shemara", "response": ["Once returned to Docker's ownership, the Shemara became known for lavish parties with guests including King Farouk of Egypt. However in 1965, Docker put her on the market for £600,000, and she was eventually sold to the property developer Harry Hyams for £290,000. Hyams used the Shemara on a number of Mediterranean cruises, but she was largely left laid up in Lowestoft, and was not regularly used between the 1980s and 2010."]}, {"page": "Timeline of London (1900s)", "response": ["** Centre Point, a 32-floor office building at St Giles Circus designed by Richard Seifert for property speculator Harry Hyams, is completed. It remains empty for around a decade; in 2015–18 it is converted into luxury apartments."]}, {"page": "Avenue Road, London", "response": ["In 2017, a house owned by the late property developer Harry Hyams and designed in 1954 by the architect Richard Seifert was listed for sale at £16 million, with the expectation that the new owner would replace it with a larger house."]}, {"page": "List of heists in the United Kingdom", "response": ["It later transpired that Brian Reader was the mastermind of both the Baker Street and the 2015 Hatton Garden heists. He was 76 at the time of the latter. Reader had also been involved in processing the gold bullion stolen in the Brink's-Mat robbery of 1983, for which he served eight years in prison. Terry Perkins was another member of the gang and had previously been convicted for his part in the 1983 Security Express robbery, being sentenced to 22 years. He absconded from HM Prison Spring Hill and was on the run for 17 years before being caught again following the Hatton Garden burglary. Perkins died in HM Prison Belmarsh in 2018, aged 69. Perkins and Danny Jones (also convicted for the Hatton Garden robbery) were both linked to a previous heist at the Chatila jewellers in Old Bond Street, in 2010. The network of criminals termed the Pink Panthers has been linked to several robberies of the Graff jewellery shops in London. The Johnson Gang robbed many stately homes, including Ramsbury Manor, then the home of Harry Hyams, where they plundered goods worth approximately £30 million and Waddesdon Manor, from where they took snuffboxes worth £5 million."]}]}}