{"wiki_id": "http://www.wikidata.org/entity/Q5670697", "itemLabel": "Harry Lockett", "itemDescription": "English footballer and manager (1855-1930)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Lockett", "wikipedia_page": {"main": "Harold Lockett (1855–1930) was an English association football manager and administrator.\n\n", "link_mentions": [{"page": "Stoke City F.C.", "response": ["|  Harry Lockett"]}, {"page": "Derby County Baseball Club", "response": ["In June the first annual meeting of the National League of Baseball of Great Britain was held at the Queens Hotel, Birmingham, with the constitution being drawn up. Thomas Slaney (President) and Harry Lockett (Administrator) of the Stoke Baseball Club), Francis Ley (President of Derby Baseball Club), William McGregor (President of the Aston Villa Baseball Club) and James Allard on behalf of the absent William Sudell (President of the Preston North End Baseball Club) were all in attendance, Morton Betts was in the chair. A National League schedule was confirmed for the four clubs, Francis Ley agreed to supply the pennants and badges for the winning club."]}, {"page": "William Sudell", "response": ["For the first four years of the League's existence, Sudell acted as honorary treasurer. In 1892, with his health declining, Sudell relinquished his position, and was succeeded by Stoke's Harry Lockett. He left Preston North End the following year. In 1894 the League gave him £50 for a testimonial.Inglis, League Football and the Men Who Made It, p29"]}, {"page": "Lockett", "response": ["* Harry Lockett, early English football manager and administrator"]}, {"page": "Thomas Slaney", "response": ["Slaney faded out the side in the early 1880s with the younger Edward Johnson playing more regularly. He retired as captain in 1882 and he changed the club's colours of black and light blue hoops to red and white stripes and helped the club agree a merger with the Victoria Athletic Club enabling them to play at the Victoria Ground. After Stoke abandoned amateurism status in favour of professionalism Slaney left his position at Stoke. His influence at the Victoria Ground remained as friend and colleague Harry Lockett became Stoke's manager as did his former assistant schoolmaster, Horace Austerberry."]}, {"page": "Walter Cox (footballer, born 1849)", "response": ["Cox was another ex-Stoke player who stepped into the manager's seat vacated by Thomas Slaney in 1883. Cox's reign however was a comparatively short one, and he was replaced by Harry Lockett after less than a year in charge. He played in and managed the club's first competitive match in the FA Cup which Stoke lost 2–1 against Manchester."]}, {"page": "Joseph Bradshaw (footballer)", "response": ["Bradshaw was born in Stoke-upon-Trent and took over from Harry Lockett as Stoke manager in June 1890. Stoke had just finished bottom of the Football League for the second time and failed to be re-elected, instead joining the Football Alliance. Whilst Stoke had struggled to compete in the League they found the Alliance easy ending the 1890–91 season as champions with just two defeats and re-claimed their place in the Football League. But halfway through the 1891–92 campaign with the team struggling, he left his position to be replaced by Arthur Reeves."]}]}}