{"wiki_id": "http://www.wikidata.org/entity/Q5671082", "itemLabel": "Harry Middleton", "itemDescription": "English footballer (born 1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Middleton_(footballer,_born_1995)", "wikipedia_page": {"main": "Harry Oliver Middleton (born 12 April 1995) is an English footballer who plays as a midfielder for Northern Premier League Division One East club Cleethorpes Town.\nHe began his career at Doncaster Rovers, making his first-team debut in November 2012. He established himself in the first-team in the 2015–16 relegation campaign, before helping Rovers to secure promotion out of League Two in 2016–17. He signed with Port Vale in August 2017, and was loaned out to Halifax Town three months later. He signed with Alfreton Town in August 2018 and moved on to Gainsborough Trinity three months later. He joined Cleethorpes Town in December 2019.", "link_mentions": [{"page": "Michael Brown (footballer, born 1977)", "response": ["Despite being relegated, Brown was confirmed as the club's permanent manager in May 2017. He released 13 players at the end of the 2016–17 season. His first summer signing was former two-time Player of the Year Tom Pope on a free transfer after he managed to secure his release from Bury. He went on to sign ten more players during the window: goalkeepers Rob Lainton and Sam Hornby, defenders Joe Davis, Antony Kay, Gavin Gunning, Lawrie Wilson and Graham Kelly, midfielders Michael Tonge, Cristian Montaño, David Worrall and Harry Middleton, and striker Tyrone Barnett; he also signed youngsters Rekeil Pyke, Marcus Harness, Tyler Denton, Ben Whitfield, Jack Stobbs and Tom Anderson on loan. However Vale suffered their worst start to a season in 50 years at the beginning of the 2017–18 season, going a club record six games without scoring a goal as they sat bottom of the table in September following six consecutive league defeats. He was sacked on 16 September following a 1–1 home draw with second-from-bottom Forest Green Rovers. Speaking after his sacking, Brown said that it had been difficult for him to recruit quality players on \"a very tight budget... I think it was arguably £1m under from when they had got promoted from that league the time previously\". Supporter website OneValeFan described this as \"a somewhat unlikely claim\" as the club had only exited administration in November 2012."]}, {"page": "1995 in the United Kingdom", "response": ["* 12 April – Harry Middleton, footballer"]}, {"page": "2012–13 Doncaster Rovers F.C. season", "response": ["|Harry Middleton"]}, {"page": "Harry Middleton", "response": ["Harry Middleton may refer to:", "* Harry Middleton (nature writer) (1951–1993), southern American nature writer", "* Harry Middleton (footballer, born 1937), English footballer", "* Harry Middleton (footballer, born 1995), English footballer"]}, {"page": "2014–15 Doncaster Rovers F.C. season", "response": ["|29||Harry Middleton||CM/AM||||Doncaster||||1||0||–||–||Academy||13 July 2013||Trainee||"]}, {"page": "2015–16 Doncaster Rovers F.C. season", "response": ["|Harry Middleton", "|Harry Middleton"]}, {"page": "2016–17 Doncaster Rovers F.C. season", "response": ["|14||Harry Middleton||CM/AM||||Doncaster||||48||0||–||–||Academy", "|14||MF||Harry Middleton||1||0||0||0||0||0||0||0||0||0||0||0||1||0||0"]}, {"page": "2017–18 Port Vale F.C. season", "response": ["Brown played eight débutantes at Crawley Town on 5 August, and it was two of these, Kay and Tonge, who scored the opening goals of a 3–1 victory, finished off with a first league goal for Dan Turner. Two days later Brown signed 21-year old left-back Tyler Denton on a season-long loan from Leeds United. Adebayo Akinfenwa put Wycombe Wanderers ahead within two minutes of the opening home game of the season at Vale Park on 12 August, and by the 25-minute mark he had scored the opposition's final goal of a 3–2 defeat for the \"Valiants\". In the week following the defeat to Wycombe, both Anton Forrester and Danny Pugh were ruled out of action for three to four months, and Brown signed 20-year old Sheffield Wednesday winger Jack Stobbs on a season-long loan. The match at Chesterfield was declared \"Ernie Moss Day\" in tribute to the legend of both clubs, but another poor performance saw Vale slip to a 2–0 defeat to a side that had previously failed to pick up a point. Fans booed the team and turned on the manager, chanting 'You don't know what you're doing'. In the week building up to the local derby with Crewe Alexandra, Brown signed highly rated midfielder David Worrall. Worrall made his debut against Crewe, but it was midfield partner Michael Tonge who made the headlines for the wrong reasons, as he was sent off four minutes after Crewe's Chris Dagnall scored the only goal of the game on the half-hour mark; Brown said that Tonge was unlucky to be sent off and he was proud of his team's performance. On the final day before the summer transfer window closed, Brown signed Burnley centre-back Tom Anderson on a season-long loan and Doncaster Rovers central midfielder Harry Middleton on a free transfer.", "Vale ended their league campaign with a 5–0 defeat at Cambridge United, leaving them in 20th-place – the joint-lowest finish in the club's history (the other being the 1979–80 season). At the end of the season Aspin released ten players – Chris Regis, Ryan Boot, Luke Dennis, Anton Forrester, Graham Kelly, Kjell Knops, Harry Middleton, Billy Reeves, Joe Slinn and Charlie Walford – and transfer-listed Tyrone Barnett, Joe Davis, Callum Howe and Rob Lainton, as he attempted to build his own squad for the 2018–19 season.", "|align=\"left\"|MF||35||align=\"left\"| Harry Middleton", "|35||||MF||Harry Middleton||2||0||0||0||0||0||0||0||2||0", "| 31 August 2017 || CM ||  || Harry Middleton || Doncaster Rovers || Free transfer || ", "| 8 May 2018 || CM ||  || Harry Middleton || Alfreton Town || Released || ", "| 11 November 2017 || CM ||  || Harry Middleton || F.C. Halifax Town || 11 December 2017 || "]}, {"page": "2017–18 Doncaster Rovers F.C. season", "response": ["|24||Harry Middleton ||CM/AM||||Doncaster||||63||0||–||–||Academy", "| 31 August 2017 || MF ||  || Harry Middleton || Port Vale || Free || "]}]}}