{"wiki_id": "http://www.wikidata.org/entity/Q5672276", "itemLabel": "Harry Sellars", "itemDescription": "Footballer (1902-1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Sellars", "wikipedia_page": {"main": "Harold Sellars (9 April 1902 – 30 December 1978) was an English footballer and football manager, who played in the English Football League for Stoke City. He made 395 appearances for Stoke in all competitions, and helped the club to win the Third Division North title in 1926–27 and the Second Division title in 1932–33. He went on to briefly manage League of Ireland side Dundalk in 1947. His son John also played for Stoke in the 1950s. Together, father and son played 808 league and cup games for the club.", "link_mentions": [{"page": "Dundalk F.C.", "response": ["*1947: Harry Sellars"]}, {"page": "Frank Soo", "response": ["Soo featured mainly for the Reserves during the 1934–35 campaign, as the forward line of Harry Davies, Joe Johnson, Bobby Liddle, Stanley Matthews and Tommy Sale proved to be highly effective, scoring 60 of the club's 71 league goals on the way to a tenth-place finish. He failed to make a first team appearance between September and 9 March, only returning to the side following a run of three consecutive defeats. He broke his leg during 1935–36 pre-season training, but made a speedy recovery to feature in a 2–0 defeat to Liverpool at Anfield on 18 September. He found himself a first team regular under new manager Bob McGrory, who utilised him as a left-sided half-back in the place of ageing veteran Harry Sellars. Playing alongside Arthur Turner and Arthur Tutin, Soo would be a part of one of the club's great half-back lines. He played a total of 40 matches that season, helping Stoke to a fourth-place finish, the highest in the club's history.", "Soo was quick and intelligent, and was noted for his ability to deliver perfectly placed passes. Stan Mortensen wrote in his autobiography, Football Is My Game, that Soo was one of the four best wing-halves he ever played with (alongside George Farrow, Billy Wright and Harry Sellars), and \"seemed incapable of a clumsy movement\". Arsenal's Alex James described him as \"modern for his time\"."]}, {"page": "Sellars", "response": ["* Harry Sellars (1902–1978), English footballer who played for Stoke City"]}, {"page": "Bob McGrory", "response": ["McGrory's managerial style was abrasive, contrasting starkly with that of his predecessor. Aware of the financial problems that had dogged the club in the past, McGrory implemented a policy of blooding young talent. He replaced himself with Charlie Scrimshaw while Frank Soo displaced Harry Sellars is midfield and the emerging Freddie Steele edged out Tommy Sale. It was brave management and it paid off as the young players developed into one of the most exciting teams in the country in the 1930s and in McGrory's first season in charge they finished a highest ever position of fourth with 47 points."]}, {"page": "1923–24 Stoke F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Sellars"]}, {"page": "Harold Sellars", "response": ["#REDIRECT Harry Sellars"]}, {"page": "1924–25 Stoke F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Sellars"]}, {"page": "1925–26 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Harry Sellars"]}, {"page": "1926–27 Stoke City F.C. season", "response": ["There had been reservations regarding the midfield, but manager Tom Mather gambled and switched Harry Sellars to right-half, brought in Cecil Eastwood from Preston North End to occupy left-half and slotted Tom Williamson between them. Thanks to the consistent form of this trio Stoke were on top of the league throughout the season, achieving ten doubles over their opponents. During the season a number of teams made their one and only trip to the Victoria Ground these were Ashington who were beaten 7–0, Durham City 4–0, Nelson 4–1, Wigan Borough 2–0 and New Brighton who managed a 1–1. In the return fixture against New Brighton Stoke produced what was easily their worst display of the season and crashed to a 5–0 defeat.", "|align=\"left\"|MF||align=\"left\"| Harry Sellars"]}, {"page": "Tom Williamson (Scottish footballer)", "response": ["In 1926 Stoke City moved in and persuaded Williamson to sign for them in an attempt to gain an instant return to the Second Division. Williamson proved to be a shrewd signing by Tom Mather as he displayed his quality in his first season with Stoke winning the Football League Third Division North in 1926–27. He was almost ever-present in 1927–28 missing just two matches as Stoke had a good return to the second tier, finishing fifth. For the next two seasons Williamson forged a fine half back partnership with both Len Armitage and Harry Sellars and this trio were a vital part of Stoke's midfield towards the end of the 1920s."]}, {"page": "1927–28 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Harry Sellars"]}, {"page": "1928–29 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Harry Sellars"]}, {"page": "1929–30 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Harry Sellars"]}, {"page": "1930–31 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Harry Sellars"]}, {"page": "1931–32 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Harry Sellars"]}, {"page": "1932–33 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Harry Sellars"]}, {"page": "1933–34 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Harry Sellars"]}, {"page": "1934–35 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Harry Sellars"]}, {"page": "1935–36 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Harry Sellars"]}, {"page": "1937–38 Port Vale F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Harry Sellars"]}, {"page": "List of Stoke City F.C. records and statistics", "response": ["|15||align=\"left\"| Harry Sellars||1923–1935||370||25||0||0||395"]}]}}