{"wiki_id": "http://www.wikidata.org/entity/Q5672264", "itemLabel": "Harry Scott Thornicroft", "itemDescription": "British judge", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Scott_Thornicroft", "wikipedia_page": {"main": "Henry Scott Thornicroft, nicknamed \"Dongolosi\"(16 January 1868 – 19 March 1944) was a British Native Commissioner in Petauke, in North-Western Rhodesia and later Northern Rhodesia (now Zambia) for 17 years and later a Justice of the Peace in Fort Jameson (now Chipata).Thornicroft was born in St Pancras, London, the son of coal merchant Thomas Thornicroft and his wife, Matilda. In Rhodesia, Harry Thornicroft married a local woman and had 11 children, including Gaston Thornicroft, later a leader of the coloured community.   Thornicroft's Giraffe, a subspecies of giraffe endemic to the Luangwa Valley, is named after him, from a specimen which he had shot and sent to the Natural History Museum, London, where it was displayed.He died in Northern Rhodesia.", "link_mentions": [{"page": "Giraffe", "response": ["| Thornicroft's giraffe (G. c. thornicrofti) is restricted to the Luangwa Valley in eastern Zambia. The patches are notched and somewhat star-shaped, and may or may not extend across the legs. The median lump of males is underdeveloped. No more than 550 remain in the wild, with none kept in zoos. It was named after Harry Scott Thornicroft). "]}, {"page": "Thornycroft (disambiguation)", "response": ["* Harry Scott Thornicroft (fl.1900s–1930s), colonial administrator in Northern Rhodesia"]}, {"page": "Gaston Thornicroft", "response": ["Gaston Thomas Thornicroft was a leader of the Coloured (mixed-race)  community in Southern Rhodesia from the 1930s to the 1960s. His father was Harry Scott Thornicroft, a British colonial administrator, who married a native African woman.  Gaston was president of two groups advocating rights for Coloureds: the Coloured Community Service League from 1933,Muzondidya 2005, p.62 and the Rhodesia National Association from 1952 until it was eclipsed in the early 1960s by more radical black unity groups.Muzondidya 2005, pp.92, 156, 220, 224  He led talks to unite competing Coloured representative associations.Muzondidya 2005, pp.86, 87, 92 Initially, he emphasised the Coloured community's separateness from and superiority to black Africans,Muzondidya 2005, pp.62–3 but later he was sympathetic to the non-white unity movement, without ever formally joining it.Muzondidya 2005, pp.95  He was a businessman, running 18 stores by 1945.Muzondidya 2005, pp.111,226 In the 1953 general election in the Federation of Rhodesia and Nyasaland, one seat was reserved for a European representing African interests; Thornicroft applied to stand but was refused as not being European.Muzondidya 2005, p.288 He represented \"Coloured & Eurafrican Communities\" at the 1961 Southern Rhodesia constitutional talks. He ran unsuccessfully in the 1962 and 1970 general elections in (Southern) Rhodesia."]}, {"page": "Dongolosi Thornicroft", "response": ["#REDIRECT Harry Scott Thornicroft "]}, {"page": "Henry Scott Thornicroft", "response": ["#REDIRECT Harry Scott Thornicroft"]}, {"page": "H. Thornicroft", "response": ["#REDIRECT Harry Scott Thornicroft"]}, {"page": "Rhodesian giraffe", "response": ["The Rhodesian giraffe (Giraffa camelopardalis thornicrofti), more commonly known as Thornicroft’s giraffe, is a subspecies of giraffe. It is sometimes deemed synonymous with the Luangwa giraffe. It is geographically isolated, occurring only in Zambia’s South Luangwa Valley.Fennessy, Julian, et al. \"Mitochondrial DNA analyses show that Zambia's South Luangwa Valley giraffe (Giraffa camelopardalis thornicrofti) are genetically isolated.\" African Journal of Ecology 51.4 (2013): 635–640. An estimated 550 live in the wild, with no captive populations. The lifespan of the Rhodesian giraffe is 22 years for males and 28 years for females.Berry, P. S. M., and F. B. Bercovitch. \"Darkening coat colour reveals life history and life expectancy of male Thornicroft's giraffes.\" Journal of Zoology 287.3 (2012): 157–160. The ecotype was originally named after Harry Scott Thornicroft, a commissioner in what was then North-Western Rhodesia and later Northern Rhodesia."]}]}}