{"wiki_id": "http://www.wikidata.org/entity/Q5677102", "itemLabel": "Harvey Christian Combe", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Harvey_Christian_Combe", "wikipedia_page": {"main": "Harvey Christian Combe (1752 – 4 July 1818) was an English Whig politician. He was the eldest surviving son of Harvey Combe, attorney, of Andover, Hampshire.\nHe was elected an Alderman of London in 1790 and Lord Mayor of London in 1799. He was appointed Sheriff of London for 1791–92. At the 1796 general election he was elected as a Member of Parliament for the City of London.Combe was present in the House of Commons when the then Prime Minister, Spencer Perceval, was assassinated in the lobby on 11 May 1812. He chaired a makeshift court convened the same day composed of MPs who were, like himself, also magistrates in order to begin committal proceedings against the murderer, John Bellingham, take witness statements and order messengers to search Bellingham's lodgings. Bellingham was ultimately hanged.\nHe held the seat for 21 years, until he resigned from the House of Commons in 1817 by taking the Chiltern Hundreds.He died the following year, aged about 66. He had married his cousin Alice Christian, the daughter of Boyce Tree, corn factor, of London, with whom he had four sons and six daughters. By 1806 he was very rich, having made a fortune in the brewing industry. He was a partner in the Combe Delafield and Co. brewery. In 1806 he bought Cobham Park in Surrey where he lived until his death. He built Cobham Park into a substantial country house and estate which upon his death was left to his son Harvey Combe, junior. The estate still belongs to the Combe family.", "link_mentions": [{"page": "Cobham, Surrey", "response": ["Across the river from the church into Downside village, the estate of Cobham Park was the home of John Ligonier, 1st Earl Ligonier, who was made Commander-in-Chief of the army in 1757. In 1806 Cobham Park was bought by Harvey Christian Combe a brewer and Lord Mayor of London.  The present house was completed in 1873 by his nephew, Charles Combe, to a design by Edward Middleton Barry: it has now been divided into apartments.  At the other end of the village, beside the A3, Painshill Park is a fine 18th-century landscape garden, restored from dereliction since 1980.  Painshill House dates from the 18th century and has also been divided into apartments.", "*Harvey Christian Combe, (1752–1818), brewer, Lord Mayor of London, owner of Cobham Park"]}, {"page": "List of lord mayors of London", "response": ["| 1799 || Harvey Christian Combe, MP || Brewer ||"]}, {"page": "City of London (UK Parliament constituency)", "response": ["|Harvey Christian Combe", "|rowspan=\"4\"| Harvey Christian Combe"]}, {"page": "Edwin James (barrister)", "response": ["His parents were John James, a solicitor and secondary of the City of London, and his wife Caroline née Combe, niece of Harvey Christian Combe.The Times, 7 March 1882, p.10 col.D"]}, {"page": "Cobham Park", "response": ["A medieval predecessor was home to a local lord of the manor. In the 1720s a new mansion was built in the large grounds. John Ligonier, 1st Earl Ligonier made it his home and within a few decades it was bought by Harvey Christian Combe, of Combe Delafield and Co. brewery, a member of the Combe family and once elected Lord Mayor of London. Much of the estate, but excluding the main house, is owned by the same family. There are fields on the quite high left bank of the River Mole; much of it is protected Metropolitan Green Belt and the subject of other environmental protections.", "In 1806, Cobham Park was purchased by Harvey Christian Combe, a brewer, for £30,000 (). Harvey died in 1818 and left the house to his son Harvey, who died in 1857; the house then passed to a nephew, Charles Combe. The house was destroyed by fire in the early 1870s."]}, {"page": "Combe Delafield and Co.", "response": ["The Woodyard Brewery, of Castle Street, Long Acre, situated midway between the City and the West End of London, is supposed to have taken its name from a timber yard or cooperage on its original site. The first name definitely associated with the brewery is John Shackly, described at his death in 1739 as 'an eminent and wealthy brewer'.Daily Advertiser, 1 March 1739. Shackly was then in partnership with William Gyfford, who maintained and extended the brewery business until his death in 1762.  His son Anthony then succeeded him in partnership with William Jarman, a distiller, and others.  At this time the brewery was known as Gyfford and Co. In 1787 a new partner took the business over.  This was Harvey Christian Combe, whose mother was a Jarman.  Combe, who had been apprenticed to a London corn and malt factor, married his daughter and taken on his business, was remarkable for his energy and great business ability. Combe, a Whig politician, had been Lord Mayor of London in 1799-1800 and was a Member of Parliament for the City of London from 1796 to 1817."]}, {"page": "Sir Matthew Wood, 1st Baronet", "response": ["He was a member of the Worshipful Company of Fishmongers, of which he became Prime Warden, a member of the Court of Aldermen of the City of London, and served as Sheriff of the City of London for 1809 and as Lord Mayor of London from 1815 to 1817. He was elected unopposed as a Member of Parliament for the City of London at a by-election in June 1817, following the resignation of Harvey Christian Combe MP. He held the seat until his death in 1843."]}, {"page": "Assassination of Spencer Perceval", "response": ["The Speaker ordered that Bellingham be transferred to the Serjeant-at-Arms's quarters, where MPs who were also magistrates would conduct a committal hearing under the chairmanship of Harvey Christian Combe. The makeshift court heard evidence from eyewitnesses to the crime and sent messengers to search Bellingham's lodgings. The prisoner kept his composure throughout; although warned against self-incrimination, he insisted on explaining himself: \"I have been ill-treated ... I have sought redress in vain. I am a most unfortunate man and feel here\"—placing hand on heart—\"sufficient justification for what I have done.\" He had, he said, exhausted all proper avenues and had made it clear to the authorities that he proposed to take independent action. He had been told to do his worst: \"I have obeyed them. I have done my worst, and I rejoice in the deed.\" At around eight o'clock, Bellingham was formally charged with Perceval's murder, and was committed to Newgate Prison to await trial."]}, {"page": "List of United Kingdom by-elections (1806–1818)", "response": ["|10 June 1817||London||u*||Harvey Christian Combe||Matthew Wood||Resignation"]}, {"page": "Combe (surname)", "response": ["*Harvey Christian Combe (1752–1818), English brewer and Lord Mayor of London"]}, {"page": "George Conyngham, 3rd Marquess Conyngham", "response": ["*Lady Constance Augusta (1859-14 June 1941), who married Richard Henry Combe, great grandson of the Lord Mayor of London Harvey Christian Combe. They had one son, and four daughters, one of which married Major Hon. Francis Edward Needham, son of Francis Needham, 3rd Earl of Kilmorey. "]}, {"page": "List of MPs elected in the 1796 British general election", "response": ["|Harvey Christian Combe"]}, {"page": "List of MPs in the first United Kingdom Parliament", "response": ["| Harvey Christian Combe"]}, {"page": "List of MPs elected in the 1806 United Kingdom general election", "response": ["| Harvey Christian Combe"]}, {"page": "List of MPs elected in the 1802 United Kingdom general election", "response": ["| Harvey Christian Combe"]}, {"page": "List of MPs elected in the 1807 United Kingdom general election", "response": ["| Harvey Christian Combe"]}, {"page": "List of MPs elected in the 1812 United Kingdom general election", "response": ["| Harvey Christian Combe – resigned Replaced by  Matthew Wood  1817"]}, {"page": "Benjamin Burnell", "response": ["Benjamin Burnell (1769–1828) was a British portrait painter. His works include portraits of Sir Jacob Astley (sometime between 1780 and 1817), Harvey Christian Combe (1800) and Henry Villiers Parker, Viscount Boringdon (1813). The National Portrait Gallery also contains his chalk drawings of William Holwell Carr (1798) and Sir Samuel Egerton Brydges, 1st Baronet (1817), whilst others are in private collections."]}, {"page": "Bird, Savage & Bird", "response": ["In 1803 Bird, Savage and Bird were declared bankrupt.https://www.google.co.uk/books/edition/The_Law_Journal/t30vAQAAMAAJ?hl=en&gbpv=1&dq=%22bird,+savage%22&pg=PA493&printsec=frontcover The law journal. 1803. London: R. Phillips Henry Bird had tried to buy time by taking short-term loans from friends and family in 1802.  These included William Manning, his partners J. P. Anderdon and Charles Bosanquet, John Savage (Benjamin's father), Harvey Christian Combe and John Collins, who each signed promissory notes for £6000, plus Maurice Swabey for £3000 (Swabey was husband of Henry Bird’s sister Catherine).  When Bird’s mother died in February 1804 it was also revealed that her estate was due repayment of a £6900 “bond debt” from the partnership of Bird, Savage & Bird. "]}]}}