{"wiki_id": "http://www.wikidata.org/entity/Q5671999", "itemLabel": "Harry Robinson", "itemDescription": "rugby player", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Robinson_(rugby_union)", "wikipedia_page": {"main": "Harry Rhys Robinson (born 16 April 1993) is a former rugby union player who played on the wing for Cardiff Blues and the Scarlets and won 3 caps at international level for Wales.\nRobinson started playing rugby at Pentyrch RFC, made his professional debut aged 17 for the Cardiff Blues in January 2011. He spent much of the next season playing for Wales in the Sevens World Series, but caught the eye in the shorter form of the game was called up to the senior XVs squad in January 2012 before Six Nations despite having made just 4 senior appearances for the Cardiff Blues. He then went on to make his debut that June against the Barbarians where he scored a try.\nHe became a regular starter for the Cardiff Blues over the 2012–13 season and won two further caps on the tour of Japan in June 2013. However the following season he only scored one try and dropped out of the international frame, and subsequently moved to the Scarlets.In March 2015 he suffered a severe neck injury playing against Edinburgh that required surgery, despite making a brief comeback later in the year, the injury ultimately forced him to retire aged 23 on medical advice in April 2016.\n\n", "link_mentions": [{"page": "Harry Robinson", "response": ["Harry Robinson may refer to:", "*Harry Robinson (rugby union) (born 1993), Welsh rugby union player", "*Harry Robertson (musician) (1932–1996), British musician, bandleader, music director and composer, aka Harry Robinson", "*Harry Robinson (RAF officer) (1898–1926), World War I flying ace", "*Harry Robinson (darts player) (born 1969), English darts player", "*Harry Robinson (footballer) (born 2000), Northern Irish footballer"]}, {"page": "Harry Robinson (rugby player)", "response": ["#REDIRECT Harry Robinson (rugby union)"]}]}}