{"wiki_id": "http://www.wikidata.org/entity/Q5672656", "itemLabel": "Harry Street", "itemDescription": "English rugby league footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Street_(rugby_league)", "wikipedia_page": {"main": "Harry Street (5 September 1927 – 29 September 2002) was an English professional rugby league footballer who played in the 1940s and 1950s, and coached in the 1950s, 1960s and 1970s. He played at representative level for Great Britain, England and Yorkshire, and at club level for Castleford (World War II guest), St. Helens, Dewsbury, Wigan, Leeds and Featherstone Rovers (Heritage № 391), as a centre or loose forward, i.e. number 3 or 4, or 13, during the era of contested scrums, and coached at club level for Castleford and Bradford Northern,", "link_mentions": [{"page": "Bradford Bulls", "response": ["* 1971–72 Harry Street"]}, {"page": "Castleford Tigers", "response": ["* Harry Street 1958–64"]}, {"page": "Dewsbury Rams", "response": ["* Harry Street won caps for England while at Dewsbury 1950 Wales (2 matches), France, while at Wigan 1951 France, 1952 Wales, 1953 France, and won caps for Great Britain while at Dewsbury 1950 Australia (3 matches), New Zealand"]}, {"page": "Keighley Cougars", "response": ["* Harry Street 1965-1967"]}, {"page": "Henry Street", "response": ["Henry or Harry Street may refer to:", "*Harry Street (rugby league) (1927–2002), English professional rugby league footballer", "*Harry Street (spree killer) (1944–2014), British spree killer", "*Harry Street (jurist) (1919–1984), British jurist and legal scholar"]}, {"page": "Colin Dixon", "response": ["Dixon played in the Great Britain 1972 World Cup winning side and toured Australasia in 1974, playing in all three Tests against Australia (1 win, 2 losses) and all three in New Zealand (2 wins, 1 loss). Perhaps the highlight of his successful club career was winning the League Championship with Salford in 1973–74 and again in 1975–76. As an international he won 15 caps for Wales, and 14 for Great Britain. He played his last game for Salford in 1980, but played one last season in the Premiership winning Hull Kingston Rovers team during the 1980–81 season. He played 418 times for Salford with 738 appearances in all first class games. Only five players have played test matches for Great Britain as both a back, and a forward, they are; Colin Dixon, Frank Gallagher, Laurie Gilfedder, Billy Jarman and Harry Street."]}, {"page": "Frank Gallagher (rugby league)", "response": ["Only five players have played test matches for Great Britain as both a back, and a forward, they are; Colin Dixon, Frank Gallagher, Laurie Gilfedder, Billy Jarman and Harry Street."]}, {"page": "List of Great Britain national rugby league team players", "response": ["* Harry Street circa-1950", "* Harry Street circa-1950"]}]}}