{"wiki_id": "http://www.wikidata.org/entity/Q5671395", "itemLabel": "Harry Oscroft", "itemDescription": "Footballer (1926-2008)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Oscroft", "wikipedia_page": {"main": "Harry Oscroft (10 March 1926 – 31 December 2008) was an English footballer. A left winger, he scored over 150 goals in nearly 500 league games in a 14-year career in the English Football League.He played for Mansfield Town for three years, before signing for Stoke City in January 1950. He made 349 appearances and scored 106 goals for the \"Potters\", before he was traded to Port Vale in September 1959. He left the \"Valiants\" in May 1961, and later turned out for non-league clubs Brantham Athletic and Sutton United.", "link_mentions": [{"page": "Norman Low", "response": ["In preparation for the 1959–60 Third Division campaign, Low signed Morgan Hunt from Norwich City for a four-figure fee, and outside-left Cliff Portwood from Preston North End for £750. He also tried to sign Stanley Matthews from Blackpool, but a deal could not be reached for the 44-year-old. Low then traded John Cunliffe and £2,000 to Stoke City in exchange for winger Harry Oscroft and centre-half Peter Ford. In March, an out-of-form Graham Barnett was sold to Tranmere Rovers for £5,000, leaving Vale without 'a top-class inside-forward'. In the FA Cup, Vale reached the Fifth Round, and 49,768 crammed into Vale Park to witness a 2–1 defeat to Aston Villa. They ended the league campaign in 14th place, ten points above the relegation zone.", "Low prepared for the 1960–61 season by recruiting former Wales international inside-right Noel Kinsey from Birmingham City as a player-coach, and 21-year-old outside-left Dennis Fidler from the Manchester City Reserves. His £10,000 offer for Aston Villa's Gerry Hitchens was rejected, whilst interest in re-signing Ronnie Allen also went nowhere. Low instead got 'bustling' Ted Calland on a free transfer from Exeter City, and sold Fred Donaldson to Exeter for £2,000. In November he signed Bert Llewellyn from Crewe Alexandra for £7,000. His team put in some memorable performances, including a 5–0 win over Grimsby Town at Blundell Park, in what Roy Sproson later described as his 'greatest memory' and 'one of their finest hours'; the performance was so impressive they received 'a standing ovation' from the home crowd, as the \"Valiants\" finished the game 'rolling the ball about like a game of chess'. Vale were in the promotion hunt until late in the season, as Low released Albert Leake and sold Stan Steele to West Bromwich Albion for £10,000. Vale recorded a seventh-place finish, and Low ended the campaign by releasing Harry Oscroft (Brantham Athletic), Ted Calland (Lincoln City), John Poole (Macclesfield Town), and Peter Hall (Bournemouth & Boscombe Athletic)."]}, {"page": "2008–09 in English football", "response": ["*31 December 2008 – Harry Oscroft, 82, former winger who played for Mansfield Town, Port Vale, and most notably Stoke City, where he scored 106 goals in 349 games during a ten-year spell at the club.Harry Oscroft has died Oatcake Fanzine. Retrieved on 18 May 2009."]}, {"page": "Potteries derby", "response": ["| Harry Oscroft"]}, {"page": "List of Stoke City F.C. seasons", "response": ["|align=left| Harry Oscroft", "|align=left| Harry Oscroft"]}, {"page": "John Cunliffe (footballer, born 1930)", "response": ["He transferred to rivals Stoke City, along with £2,000, in exchange for Peter Ford and Harry Oscroft in September 1959. He scored three goals in 25 Second Division games for the \"Potters\" in 1959–60, before he was allowed to leave the Victoria Ground by manager Frank Taylor. He signed with Macclesfield Town, scoring 34 goals in 98 Cheshire County League games for Frank Bowyer's \"Silkmen\". He later played for Stafford Rangers and Buxton."]}, {"page": "Peter Ford (footballer)", "response": ["Ford began his career as an amateur with West Bromwich Albion, before joining Stoke City 1956. He was never able for force his way into the plans of manager Frank Taylor, and made just 14 Second Division appearances in three years at the Victoria Ground. He transferred to Port Vale, along with Harry Oscroft, in exchange for Dickie Cunliffe and £2,000 in September 1959. The club were competing in the Third Division after winning the Fourth Division title."]}, {"page": "1949–50 Stoke City F.C. season", "response": ["By January, there had been a modest improvement in performances out on the pitch and McGrory made his best signing for some time, persuading Freddie Steele who was now player-manager at Mansfield to part with young up and coming forward Harry Oscroft, Stoke handing over £8,000 plus Verdi Godwin who scored just twice in 23 matches. Soon after Oscroft's arrival, Stoke's defence started to leak goals and FA Cup finalists Arsenal put six past them at Highbury without a Stoke reply. Stoke managed just three points from their remaining eight matches this season and narrowly avoided relegation.", "|align=\"left\"|FW||align=\"left\"| Harry Oscroft"]}, {"page": "Verdi Godwin", "response": ["Godwin was born in Blackburn and began his career with local club Blackburn Rovers. He scored six league goals in two seasons at Ewood Park and joined Manchester City in June 1948. He scored three goals in eight matches for City before joining Stoke City, whose manager Bob McGrory saw Godwin as the answer to Stoke's goalscoring problem in 1949–50. However, despite scoring on his debut, Godwin scored just once more in the next 20 league matches and by January he was transferred to Third Division Mansfield Town in part-exchange for Harry Oscroft. Following is spell with the Stags, Godwin became a journeyman and spent short spells with Middlesbrough, Grimsby Town, Brentford, Southport, Barrow, Tranmere Rovers and finally Macclesfield."]}, {"page": "1950–51 Stoke City F.C. season", "response": ["Stoke drew local rivals Port Vale in the third round and the two sides served up a thrilling cup tie. The initial clash with Vale took place on a heavy Victoria Ground pitch was seen by over 48,000 fans. In an entertaining first half Alan Bennett put Vale into the lead after six minutes and although Stoke pushed hard for an equaliser they couldn't beat Ray King. Then the Vale fans were celebrating again as their side went 2–0 up, Cliff Pinchbeck scoring after 45 seconds into the second half. Stoke were rattled and soon after Albert Mullard pulled one back with a crisp shot from the edge of the area and he then scored again to set up a frantic finale. However, with both teams battling it out in the mud the match finished in a fair draw. With Vale Park waterlogged it was back to the Victoria Ground and was again a tense encounter. Vale were the better team creating the most chances but with just seconds remaining Frank Bowyer who had been kept quite by the \"Valiants\" defence suddenly found space and headed in a Harry Oscroft cross to end the tie.", "|align=\"left\"|FW||align=\"left\"| Harry Oscroft"]}, {"page": "1951–52 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Oscroft"]}, {"page": "1952–53 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Oscroft"]}, {"page": "1953–54 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Oscroft"]}, {"page": "1954–55 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Oscroft"]}, {"page": "1955–56 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Oscroft"]}, {"page": "1956–57 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Oscroft"]}, {"page": "1957–58 Stoke City F.C. season", "response": ["Prior to the start of the 1957–58 season both George Bourne and John Malkin had to retire from playing due to injury. Despite this the management left the transfer market alone during the summer of 1957 with Frank Taylor saying: I am slowly getting together a useful squad and building a settled side. However the club was still short on forward players with only five available these of Frank Bowyer, Neville Coleman, Johnny King, George Kelly and Harry Oscroft. Yet to their credit these five kept the goals flowing with Kelly top scoring with 24 to his name.", "|align=\"left\"|FW||align=\"left\"| Harry Oscroft"]}, {"page": "1958–59 Stoke City F.C. season", "response": ["It had been a fairly uninspiring yet somewhat of a transitional season with Neville Coleman moving on to Crewe Alexandra for a modest fee after scoring 52 goals in 126 games for the club while three club legends Frank Bowyer, John McCue and Harry Oscroft where entering the veteran stage of their careers. Before the season was out Oscroft was involved in a three-man swap, as he and Peter Ford move to Vale Park in exchange for John Cunliffe a left-winger who had a good career at Vale but failed to make an impression with Stoke. John Sellars who missed the season due to an eye injury decided to retire and Stoke decided to end their season with a trip to Morocco.", "|align=\"left\"|FW||align=\"left\"| Harry Oscroft"]}, {"page": "1959–60 Port Vale F.C. season", "response": ["The season began with a 3–2 win over Reading at Elm Park, Norman Low having selected a first eleven without any of the new signings. However, after a 1–0 win over Bournemouth & Boscombe Athletic Vale began to struggle, picking up just a point in their next six games. Low tried to sign Stanley Matthews, still going strong aged 44 for Blackpool, but a deal could not be reached. On 5 September, Tranmere Rovers beat Vale 6–0 at Prenton Park after Roy Sproson left the field in the first half with a gashed leg. Low then traded John Cunliffe and £2,000 to Stoke City in exchange for winger Harry Oscroft and centre-half Peter Ford. An improvement took place, and despite trouble in front of goal, the team won seven successive games at Burslem. In October, Jack Wilkinson was sold to Exeter City for £2,500, having lost his place in the starting eleven. On 28 December, Vale recorded a 7–0 win over Halifax Town, causing The Sentinel's \"T.G.F.\" to remark that \"rarely have the opposition been so completely outplayed\".", "|align=\"left\"|MF||align=\"left\"| Harry Oscroft", "|6||MF||||Harry Oscroft||7||0||0||7", "| September 1959 || MF ||  || Harry Oscroft || Stoke City || Exchange || "]}, {"page": "1960–61 Port Vale F.C. season", "response": ["On the financial side, a disappointing home attendance average of 9,702 was a concern, though a profit of £4,253 was recorded. This was down to a £9,501 donation from the Sportsmen's Association and a slashing of the wage bill by around £4,000 to £29,915. The management decided to cut the playing staff but to increase the wage budget. Eleven players were let go, crucially: Harry Oscroft (Brantham Athletic), Ted Calland (Lincoln City), John Poole (Macclesfield Town), and Peter Hall (Bournemouth & Boscombe Athletic).", "|align=\"left\"|MF||align=\"left\"| Harry Oscroft", "|7||MF||||Harry Oscroft||5||0||0||0||5", "| May 1961 || MF ||  || Harry Oscroft || Brantham Athletic || Free transfer || "]}, {"page": "List of Stoke City F.C. records and statistics", "response": ["|20||align=\"left\"| Harry Oscroft||1950–1959||326||23||0||0||349", "|6||align=\"left\"| Harry Oscroft||1950–1959||103||4||0||0||107"]}, {"page": "1946–47 Mansfield Town F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Oscroft"]}, {"page": "1947–48 Mansfield Town F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Oscroft"]}, {"page": "1948–49 Mansfield Town F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Oscroft"]}, {"page": "1949–50 Mansfield Town F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Harry Oscroft"]}, {"page": "Oscroft", "response": ["* Harry Oscroft (1926-2008), English footballer"]}]}}