{"wiki_id": "http://www.wikidata.org/entity/Q5671978", "itemLabel": "Harry Roberts", "itemDescription": "footballer (1906-1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Roberts_(footballer,_born_1904)", "wikipedia_page": {"main": "Harry Roberts (27 June 1904 – 18 May 1968) was an English professional footballer who made 409 appearances in the Football League playing for Leeds United, Plymouth Argyle and Bristol Rovers. He played as a right back.Roberts was born in Crofton, in what is now West Yorkshire. He played as an amateur for Castleford Town before joining Leeds United, for whom he made his debut in the Football League during the 1925–26 season. He made 84 League appearances for Leeds before moving on to Plymouth Argyle, where he was a regular first-team selection for seven seasons and played more than 250 games for the club in all competitions. He left for Bristol Rovers in 1937, and returned to Yorkshire in 1939 to play for Frickley Colliery. He died in 1968 in the Royal Naval Hospital, Stonehouse, aged 63.\n\n", "link_mentions": [{"page": "Harry Roberts", "response": ["Harry Roberts may refer to:", "*Harry Roberts (cricketer) (1924–1995), English cricketer", "*Harry Roberts (criminal) (born 1936), English convicted of the Shepherd's Bush murders", "*Harry Roberts (footballer, born 1904) (1904–1968), English football defender", "*Harry Roberts (footballer, born 1907) (1907–1984), England international football forward", "*Brian Roberts (English footballer) aka Harry Roberts (born 1955), Coventry and Birmingham defender", "*Harry Roberts (inventor), Swedish inventor", "*Harry Roberts (rugby union, born 1939), Australian international rugby union player", "*Harry Roberts (rugby union, born 1960), South African international rugby union player"]}, {"page": "Crofton, West Yorkshire", "response": ["*Harry Roberts (1904–1968), born in Crofton, was a professional footballer with Leeds United, Plymouth Argyle and Bristol Rovers."]}, {"page": "Harry Roberts (footballer born 1906)", "response": ["#REDIRECT Harry Roberts (footballer, born 1904)"]}, {"page": "Harry Roberts (footballer, born 1906)", "response": ["#REDIRECT Harry Roberts (footballer, born 1904)"]}, {"page": "George Reed (footballer)", "response": ["George Reed (7 February 1904 – 29 November 1958) was an English football player and coach who played as a left half. Born in Altofts, Yorkshire, he began his professional career with nearby Leeds United in October 1924. He made his Football League debut on 6 April 1926, in a 2–0 home defeat to Sunderland. In the next three-and-a-half seasons, he missed just eight games, and in April 1930, he and teammate Harry Roberts shared a benefit match against Manchester United. He and Roberts both left for Plymouth Argyle at the end of the 1930–31 season, with Reed having appeared exactly 150 times for Leeds in all competitions, scoring three goals."]}]}}