{"wiki_id": "http://www.wikidata.org/entity/Q5672516", "itemLabel": "Harry Solomon", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Solomon_(businessman)", "wikipedia_page": {"main": "Sir Harry Solomon (born 20 May 1937) is the founder of Hillsdown Holdings, one of the United Kingdom's largest food businesses.", "link_mentions": [{"page": "St Albans School, Hertfordshire", "response": ["* Harry Solomon (b. 1937), businessman"]}, {"page": "Harry Solomon", "response": ["Harry Solomon also became the focus of 3rd Rock from the Sun's physical comedy. \"If someone is going to fall, walk funny or get hit, then it's going to be Harry,\" writes journalist T.D. Mobley-Martinez.T.D. Mobley-Martinez. \"At 3rd Rock with a native son\". The Albuquerque Tribune. 1997-03-28 In a 1997 interview, Stewart remarked, \"What I try to do is to make these things seem like Warner Brothers cartoons -- make the impossible seem possible. But sometimes you pay for it the next day. I do bits sometimes, and I wake up with bruises and huge rug burns all over my legs.\""]}, {"page": "Premier Foods", "response": ["The company was founded by Harry Solomon and David Thompson in London in 1975 as Hillsdown Holdings.  The name came from Thompson's house, Hillsdown. His son Richard Thompson worked for his father after his education at Haileybury. In 1981 it acquired Lockwood Foods Ltd which was in administrative receivership. In May 1987 David Thompson stepped down from Hillsdown Holdings, selling 50% of his shares and became a non executive director. In April 1989 he sold all of his shares.Merciful release in Hillsdown bid hint Guardian, 14 May 1999"]}, {"page": "UK Israel Business", "response": ["* Lifetime Achievement Award: Sir Harry Solomon"]}, {"page": "Sir Harry Solomon", "response": ["#REDIRECT Harry Solomon (businessman)"]}, {"page": "1991 Birthday Honours", "response": ["* Harry Solomon, Chairman, Hillsdown Holdings plc."]}, {"page": "List of companies of the United Kingdom K-Z", "response": ["*Premier Foods – is a food manufacturing public company that owns brands such as Mr Kipling, Ambrosia, Bird's Custard, Angel Delight, Oxo, Bisto, Batchelors and also produces Cadbury cakes under license. It was founded in 1975 as Hillsdown Holdings by Harry Solomon and David Thompson. First located in London, it is now headquartered in St. Albans, Hertfordshire. In 2020 its revenue was £847 million, with a net income of £46.5 million."]}]}}