{"wiki_id": "http://www.wikidata.org/entity/Q5686450", "itemLabel": "Haydn Green", "itemDescription": "English footballer and manager (1887-1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Haydn_Green", "wikipedia_page": {"main": "Adrian \"Haydn\" Green (18 March 1887 – 8 February 1957) was an English football player and manager. After playing for Nottingham Forest, Manchester United, Aston Villa, Newport County and Reading, he went on to manage Ebbw Vale, Bangor, Hull City, Swansea Town and Watford.At Hull City, whom he managed from May 1931 until March 1934, Green maintained a winning percentage of 49.59%.\n\n", "link_mentions": [{"page": "Swansea City A.F.C.", "response": ["There have been forty-four permanent managers (of whom six have been player-managers), and four caretaker managers of Swansea City since the appointment of the club's first professional manager, Walter Whittaker in 1912. In the club's first season, Whittaker led Swansea to their first Welsh Cup win. The club's longest-serving manager, in terms of tenure, was Haydn Green, who held the position for eight years, four months and 14 days, spanning the entirety of World War II. Trevor Morris, who oversaw the most games at Swansea, was also the first manager to lead a Welsh club in Europe, qualifying for the 1961–62 Cup Winners' Cup."]}, {"page": "Hull City A.F.C.", "response": ["|align=\"left\"|Haydn Green||||May 1931 – March 1934 ||123||61||24||38||49.59"]}, {"page": "Ivor Allchurch", "response": ["Allchurch was playing local youth football at under-18 Cwm Level Park when he was spotted by Joe Sykes, a scout who worked for Swansea Town under the management of Haydn Green. Following a match, Sykes approached Allchurch, who was only 14 at the time, and asked for his name and address, visiting the family home soon after where he reached an agreement with Allchurch's father that he would join the club when he turned 15 as an amateur and train two days a week. During his time as an amateur at the club, Allchurch was approached on two occasions by scouts from Football League sides to sign for different clubs but turned the moves down as he did not want to break the verbal agreement that he and his father had made to sign for the Swans."]}, {"page": "Bangor F.C.", "response": ["|  Haydn Green"]}]}}