{"wiki_id": "http://www.wikidata.org/entity/Q5682670", "itemLabel": "William Gaunt", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Gaunt", "wikipedia_page": {"main": "William Charles Anthony Gaunt (born 3 April 1937 in Pudsey, West Riding of Yorkshire) is an English actor. He became widely known for television roles such as Richard Barrett in The Champions (1968–1969), Arthur Crabtree in No Place Like Home (1983–87) and Andrew Prentice in Next of Kin (1995–97). He has had many other roles on television and also an extensive stage career as an actor and director, including performances with the Royal Shakespeare Company.", "link_mentions": [{"page": "The Time Machine", "response": ["Robert Glenister starred as the Time Traveller, with William Gaunt as H. G. Wells in a new 100-minute radio dramatisation by Philip Osment, directed by Jeremy Mortimer as part of a BBC Radio Science Fiction season. This was the first adaptation of the novella for British radio. It was first broadcast on 22 February 2009 on BBC Radio 3 and later published as a 2-CD BBC audio book."]}, {"page": "Trevor Nunn", "response": ["In 2007, he directed the RSC productions of King Lear and The Seagull, which played at Stratford before embarking on a world tour (including the Brooklyn Academy of Music) and then playing at the New London Theatre from November 2007. The two plays both starred Ian McKellen, Romola Garai, Frances Barber, Sylvester McCoy, and William Gaunt.Riding, Alan.\"Every Inch a King (and Buff, Too)\" The New York Times, 2 September 2007 Nunn's television production of King Lear was screened on Boxing Day, 2008 with McKellen in the title role.\"'King Lear' Production History\" mckellen.com, accessed 16 November 2011"]}, {"page": "The Seagull", "response": ["In 2007/2008, a production by the Royal Shakespeare Company toured internationally before coming into residence at the West End's New London Theatre until 12 January 2008. It starred William Gaunt and Ian McKellen as Sorin (who alternated with William Gaunt in the role, as McKellen also played the title role in King Lear), Richard Goulding as Treplyov, Frances Barber as Arkadina, Jonathan Hyde as Dorn, Monica Dolan as Masha, and Romola Garai as Nina. Garai in particular received rave reviews, The Independent calling her a \"woman on the edge of stardom\", and the London Evening Standard calling her \"superlative\", and stating that the play was \"distinguished by the illuminating, psychological insights of Miss Garai's performance.\"\"The fall of a high-flying bird\" by Nicholas de Jongh, London Evening Standard (28 November 2007)"]}, {"page": "Stuart Damon", "response": ["Moving to Great Britain, Damon starred in the hit West End musical Charlie Girl with Anna Neagle in 1965, and was selected to appear as American secret agent Craig Stirling, alongside British actors Alexandra Bastedo and William Gaunt, in the ITC series The Champions. He also appeared with Roger Moore in an episode of The Saint which has been credited as the inspiration for the later series The Persuaders!, with Damon's role being played by Tony Curtis. In 1968, he appeared in the BBC TV adaptation of The £1,000,000 Bank Note and played Henry Adams in the starring role. Damon also played magician Harry Houdini in a lavishly staged London musical, Man of Magic.The Great Escape: Hollywood's Struggle to Bring Houdini Back to Life by John Cox, MAGIC Magazine, October 2006", "In 1999, Damon won the Best Supporting Actor Emmy, for his portrayal of Alan, a physician addicted to the painkiller hydrocodone. In 2005, Damon was reunited with Alexandra Bastedo and William Gaunt for the first time in almost 40 years, to provide audio commentary on a DVD release of The Champions. In December 2006, it was reported that Damon had been fired from General Hospital by Jill Farren Phelps, on the orders of Anne Sweeney and Brian Frons, and his last air date was  scheduled for February 26, 2007, when his character died. The reason behind his release was not made public.\"Heartbreaker: Stuart Damon's 30-Year GH Run Ends\", December 21, 2006, soapcentral.com The taping of the final scene occurred on February 5, coincidentally Damon's 70th birthday.ABC Soaps, March 27, 2007, p. 88 Fellow actors on General Hospital spoke to the press about how upset they were over Damon's firing, with Damon's on-show wife Leslie Charleson saying, \"This is the 30th anniversary for the two of us, in August. The timing leaves me very discouraged about the way soaps are going, the total disregard for history and the blatant disregard for the veterans.\"Soap Opera Weekly, February 13, 2007, pp. 1-2"]}, {"page": "The Midwich Cuckoos", "response": ["| Richard Gayford || William Gaunt || Bill Nighy"]}, {"page": "The Wednesday Play", "response": ["| Neville SmithSheila FearnWilliam HolmesJohnny CliveMalcolm TaylorAlan LakeRoyston TicknerWilliam GauntJames HallKen JonesDavid Jackson"]}, {"page": "The Champions", "response": ["* William Gaunt as Richard Barrett", "This release credited Stuart Damon as the star, with Alexandra Bastedo and William Gaunt receiving co-star credits. This was partly because Damon was a well-established star in the U.S. by this time, and partly because \"The Interrogation\" is essentially a two-hander between Damon and Colin Blakely, with the rest of the regular cast appearing only briefly.", "Note: 'Bookend' sequences were shot for the first episode \"The Beginning\" showing Richard Barrett (William Gaunt) recording the story on to a tape recorder in Tremayne's office; this was done so that the episode could be shown out of order on repeat runs without causing any continuity problems. Both sequences were included as extras on the Network DVD box set."]}, {"page": "Gillian Lynne Theatre", "response": ["* King Lear and The Seagull (14 November 2007 – 12 January 2008) by, respectively, William Shakespeare and Anton Chekhov, starring Ian McKellen, Frances Barber, Romola Garai and William Gaunt (transferred from the Royal Shakespeare Company) ."]}, {"page": "Bill Gaunt", "response": ["#REDIRECT William Gaunt"]}, {"page": "Juliet Bravo", "response": ["A number of famous names, either of the time or of the future, appeared in the show. They included David Ryall, Kevin Whately, Eric Richard, Jeff Rawle, Jean Boht, Patricia Hayes, Peter Jeffrey, Peter Martin, Brenda Fricker, David Daker, Andrew Burt, Frances White, Malcolm Terris, Joe Gladwin, Sara Sugarman, Tenniel Evans, Nadim Sawalha, Jack Smethurst, John Savident, William Gaunt, Colin Baker, Kenneth Waller, Rita May, Stephen Yardley, John Woodvine, Stephen McGann, Leslie Schofield, Alan Parnaby, Shirley Stelfox, Maggie Ollerenshaw, John Quarmby, Neil Morrissey, Del Henney, Iain Cuthbertson, Leslie Sands, Hilda Braid, Melanie Hill, John Challis, Paul Chapman, Simon Williams, Christopher Ettridge, George Irving, Bill Wallis, Carolyn Pickles, Jonathan Newth, Kenneth Cope, Sally Whittaker, Karl Howman, Diana Coupland, Martin Jarvis, Rosalind Ayres, Yvette Fielding, Bert Parnaby, Robert Glenister, Mona Hammond, Steve Hodson, Danny O'Dea and Bernard Kay."]}, {"page": "Revelation of the Daleks", "response": ["The serial is set on the planet Necros. The galaxy is suffering from famine, but Davros (Terry Molloy) is masquerading as the Great Healer and has commandeered a funeral home, the high-tech facility Tranquil Repose, as a base from which he can convert humans into either food for the starving or into Daleks for his new secret army. However, his manufacturing ally Kara (Eleanor Bron) wants his business and has hired the assassins Orcini (William Gaunt) and Bostock (John Ogwen) to kill him.", "Paul Cornell, Martin Day and Keith Topping gave the serial a positive review in The Discontinuity Guide (1995), saying that it \"looks wonderful and the plot is just about consistent and straightforward.\" They praised guest stars William Gaunt and Alexei Sayle, as well as how the Sixth Doctor \"finally gets to be Doctorish, with proper doses of compassion.\" In The Television Companion (1998), David J. Howe and Stephen James Walker also were positive, praising the guest stars, and reprinted positive fan reviews from the time. They did note that some viewers may not have liked the Doctor and Peri being sidelined, which could have resulted in the pace seeming slow. In 2012, Patrick Mulkern of Radio Times awarded the serial four stars out of five. He praised Graeme Harper's direction and called it \"Saward's most accomplished script\", though he believed it had a few structural problems. He also noted the amount of horror present, calling it a \"gruesome thrill-ride\". In Doctor Who: The Complete Guide, Mark Campbell awarded it eight out of ten, describing it as \"an incredibly violent black comedy\". He added, \"Harper's direction is visceral, the actors are having a whale of a time and it's all held together by Roger Limb's spine-chilling music. The only thing missing is a plot.\""]}, {"page": "John Bennett (actor)", "response": ["His theatre roles included Yasha in The Cherry Orchard and Henry Percy (Hotspur) in Henry IV, Part 1 both for John Gielgud, Exton in Richard II and Volscian Senator in Coriolanus (Almeida Theatre), Marley's Ghost in A Christmas Carol (Royal Shakespeare Company) and Uncle in Inner Voices (Royal National Theatre), as well as working extensively at the Royal Exchange Theatre, Manchester. He starred in many West End musicals including On Your Toes (Palace), Marilyn! (Adelphi), The Sound of Music (Apollo Victoria), The King and I (London Palladium), The Baker's Wife (Phoenix) and was nominated for an Olivier Award for Best Supporting Performance in a Musical for his performance as Louis Epstein in Jolson The Musical (Victoria Palace and Royal Alexandra Theatre, Toronto). His last stage role was as Conrad in Gates of Gold by Frank McGuinness with William Gaunt at the Finborough Theatre, London, in December 2004."]}, {"page": "Jonathan Hyde", "response": ["In 2007, Hyde played Dr. Dorn in Chekhov's The Seagull and the Earl of Kent in King Lear for the Royal Shakespeare Company in a repertory company that included Ian McKellen, Frances Barber, Romola Garai, William Gaunt and Sylvester McCoy. Both plays toured together internationally, before taking up residence in the New London Theatre. The final performance was on 12 January 2008. He reprised his role of Kent in the 2008 television film of King Lear."]}, {"page": "Giggleswick School", "response": ["*William Gaunt (b. 1937), actor"]}, {"page": "Finborough Theatre", "response": ["Productions since 2000 have included the UK premières of Brad Fraser’s Wolfboy; Lanford Wilson’s Sympathetic Magic; Tennessee Williams’ Something Cloudy, Something Clear; and Frank McGuinness’ Gates of GoldGates of Gold, British Theater Guide. Retrieved 15 November 2011 with William Gaunt and the late John Bennett in his last stage role which transferred to the West End; the London première of Sonja Linden’s I Have Before Me a Remarkable Document Given to Me by a Young Lady from Rwanda;I Have Before Me... Finborough, London, The Guardian. Retrieved 15 November 2011 the specially commissioned adaptation of W.H. Davies’ Young Emma by Laura Wade and directed by Tamara Harvey; the first London revival for more than 40 years of Rolf Hochhuth’s Soldiers;Soldiers, Finborough Theater, London, The Guardian. Retrieved 15 November 2011 Keith Dewhurst's Lark Rise to Candleford, performed in promenade and in repertoire; the Great War drama Red Night,Red Night, Finborough Theater, London, The Guardian. Retrieved 15 November 2011 and five first plays by new writers: Jason Hall's Eyes Catch Fire; Chris Dunkley’s Mirita; Dameon Garnett's Break Away"]}, {"page": "Parker Pyne Investigates", "response": ["William Gaunt played Major Wilbraham "]}, {"page": "Romola Garai", "response": ["Also in 2007, she starred in the Oscar-nominated film Atonement as the 18-year-old Briony Tallis. Co-starring :Keira Knightley, :James McAvoy, :Vanessa Redgrave and :Brenda Blethyn, the film went on to receive seven Academy Award nominations, including Best Picture. Garai earned a Best Actress nomination from the Evening Standard British Film Awards for her performance. She also appeared in two Royal Shakespeare Company productions: as Cordelia in King Lear and as Nina in The Seagull, starring alongside Ian McKellen, Frances Barber, Sylvester McCoy, Jonathan Hyde and William Gaunt. The run, which toured the world, went into residence in the New London Theatre where it ended mid-January 2008. She received rave reviews, especially as Nina in The Seagull: The Independent called her a \"woman on the edge of stardom\", while This is London called her \"superlative\", and said that the play was \"distinguished by the illuminating, psychological insights of Miss Garai's performance\". She reprised her role as Cordelia in a televised version of King Lear."]}, {"page": "Siobhan Redmond", "response": ["In November 2014 Redmond joined Alun Armstrong and William Gaunt in a production of Eugène Ionesco's Exit the King at the Ustinov Studio in Bath."]}, {"page": "List of former EastEnders characters", "response": ["| St. John Redmond || William Gaunt || 2015"]}, {"page": "Daniel Hill (actor)", "response": ["He played the avaricious Harvey Bains, manager of the retirement home in Waiting for God, alongside Stephanie Cole and Graham Crowden. He had earlier appeared with Martin Clunes and William Gaunt in the sitcom No Place Like Home."]}, {"page": "Clarence Derwent Awards", "response": ["* 2011 William Gaunt as Worcester and Shallow in Henry IV, Part 1 and Henry IV, Part 2"]}, {"page": "List of The Avengers (TV series) episodes", "response": ["| William Gaunt, Richard Leech, John Sharp, Noel Coleman, June Murphy"]}, {"page": "Armageddon (convention)", "response": ["*TV and Movie Guests: Sylvester McCoy (the Seventh Doctor), David Weston, William Gaunt"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*William Gaunt (Acting)"]}, {"page": "Live and Let Die (film)", "response": ["Broccoli and Saltzman tried to convince Sean Connery to return as James Bond, but he declined. At the same time United Artists approached actors Adam West and Burt Reynolds. Reynolds told the studios that Bond should be played by a British actor and turned the offer down. Among the actors to test for the part of Bond were Julian Glover (who would portray Aristotle Kristatos in For Your Eyes Only), John Gavin, Jeremy Brett, Simon Oates, John Ronane, and William Gaunt. The main frontrunner for the role was Michael Billington. Broccoli  met with Anthony Hopkins about playing the role, but Hopkins did not think that he was right for the part. United Artists was still pushing to cast an American to play Bond, but producer Albert R. Broccoli insisted that the part should be played by a British actor and put forward Roger Moore. Moore, who had been considered by the producers before both Dr. No and On Her Majesty's Secret Service, was ultimately chosen for the role. After Moore was chosen, Billington remained on the top of the list in the event that Moore declined to come back for the next film. Billington ultimately played a brief role in the pre-credit sequence of The Spy Who Loved Me (1977). "]}, {"page": "About Face (TV series)", "response": ["| style=\"font-size: 100%;\" |Maureen Lipman plays Dr MacBride, an over-worked and ambitious NHS registrar. Also starred William Gaunt, Martin Clunes and James Grout."]}, {"page": "No Place Like Home (TV series)", "response": ["No Place Like Home is a BBC situation comedy series, created, and written by Jon Watkins. It was directed, produced by Robin Nash, starring William Gaunt and Patricia Garwood as Arthur and Beryl Crabtree. Arthur has a brand new life planned with Beryl now that the last of their four children have left home...or so he thinks! Radio Times, Issue 3135, Vol. 241, Thursday 8th December, 1983.", "|William Gaunt\t"]}, {"page": "Edward Taylor (scriptwriter)", "response": ["In 1992, Taylor wrote the stage thriller Murder by Misadventure that appeared at the Vaudeville Theatre and then the Whitehall Theatre in London's West End. The play starred Gerald Harper as Harold and William Gaunt as Riggs as a pair of television crime writers, one of whom wishes to end the partnership."]}, {"page": "Exit the King", "response": ["In November 2014 the Ustinov Studio in Bath put on a production featuring Alun Armstrong, Siobhan Redmond and William Gaunt."]}, {"page": "Next of Kin (TV series)", "response": ["Andrew Prentice (William Gaunt) Andrew shares Maggie's idea that moving to France will be a chance to cut Graham from their lives, but when Graham dies, Andrew is more relaxed about having the children come to live with them, as it gives him a chance to be the good father he never was to Graham. He too was looking forward to early retirement in France, but he realises rather quickly that he has no choice but to look after his grandchildren. He does however show reluctance to make certain sacrifices such as selling his vintage car (Volvo P1800 ES Sports-back), his wine cellar laden with some of France's finest and his weekly game of golf.", "*William Gaunt – Andrew Prentice", "*William Gaunt                                         \"Me For You and You For Me\""]}, {"page": "The Exterminators (audio drama)", "response": ["*Selestru – William Gaunt"]}, {"page": "The Healers (audio drama)", "response": ["*Selestru – William Gaunt"]}, {"page": "The Survivors (audio drama)", "response": ["*Selestru – William Gaunt"]}, {"page": "The Demons (audio drama)", "response": ["*Selestru – William Gaunt"]}, {"page": "The Warriors (audio drama)", "response": ["*Selestru – William Gaunt"]}, {"page": "The Future (audio drama)", "response": ["*Selestru – William Gaunt"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* William Gaunt"]}, {"page": "The Miracle Worker (play)", "response": ["The play was produced in the West End in March 1961 with Anna Massey as Sullivan and Janina Faye as Keller. It transferred to Wyndham's Theatre in May 1961. A revival was produced at Wyndham's Theatre on August 31, 1994 and closed on October 8. The production was directed by Richard Olivier and Bill Kenwright. The cast featured Catherine Holman as Keller, Jenny Seagrove as Sullivan, William Gaunt as Captain Keller, Judi Bowker as Kate Keller, and Michael Thornton as Anagnos."]}, {"page": "King Lear (2008 film)", "response": ["* William Gaunt – Earl of Gloucester"]}, {"page": "Ghost Squad (TV series)", "response": ["* 23.  The Grand Duchess: The name of a Goya painting on loan to a London museum. Miller joins a gang intent on stealing it to find the gang's mastermind. When they steal it, they find someone else has beaten them to it and all they have is a fake. Also features John Barron, Garfield Morgan, Colin Douglas, William Gaunt, Michael Robbins, John Ringham, Clifford Cox and Roger Avon."]}, {"page": "Humble Boy", "response": ["Humble Boy premiered at the Royal National Theatre in 2001, directed by John Caird, with the leads played by Simon Russell Beale and Felicity Kendall, and also featuring Cathryn Bradshaw, Denis Quilley, Marcia Warren and William Gaunt.  This production won the 2001 Critics' Circle Theatre Award for Best New Play and two 2001 Olivier Awards (for Best Actress in a Supporting Role, for Marcia Warren; and Best Set Designer for Tim Hatley)."]}, {"page": "List of actors considered for the James Bond character", "response": ["|William Gaunt"]}]}}