{"wiki_id": "http://www.wikidata.org/entity/Q5693997", "itemLabel": "Heather McTaggart", "itemDescription": "Australian politician (born 1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/Heather_McTaggart", "wikipedia_page": {"main": "Heather McTaggart (born 23 August 1962 in Bangor, Northern Ireland) is an Australian politician.  A member of the Labor Party, she represented the electoral district of Evelyn in the Victorian Legislative Assembly from 2002 to 2006.Heather McTaggart attended Whitehorse Technical College in Box Hill from 1973 to 1978 (the school was amalgamated into Box Hill TAFE in 1981). Following high school she worked as a secretary in the stockbroking industry until 1981, when she began working at Esanda Finance Corporation Ltd in numerous roles until 1995.  From 1997 to 1998 she worked as an integration aid at Fernhill Pre-School.McTaggart moved to Mount Evelyn, at the northern base of the Dandenong Ranges, around 1989 with her husband Greg. Greg died soon afterwards at the age of 33, and shortly after his funeral, Heather discovered that she was pregnant. Following the birth of her first child, Matthew, Heather left full-time employment to take on parenting duties. She joined the Lilydale branch of the Labor Party and developed an interest in special education. To her second husband Ken, she had twin girls, Keely and Tamsin.She was elected to the Victorian Legislative Assembly in the 2002 Victorian election as the member for Evelyn, winning the seat from the Liberal MP Christine Fyffe, however Fyffe regained the seat at the next election in 2006.\nAfter losing her seat, McTaggart went to work for Labor MP Kirstie Marshall. For six months after the election, McTaggart continued to receive internal Liberal Party documents and correspondence from Fyffe's office via her fax machine, after an IT glitch saw her name remain on the electorate office's internal distribution list. The Liberal Party complained to the Victorian Ombudsman, who investigated the matter and cleared McTaggart of forwarding the documents onto others, although Ombudsman George Brouwer acknowledged that she could have passed on the contents of the documents to others without forwarding them directly. McTaggart said she had made an error of judgement by not reporting the misdirected faxes, but denied that she had used the documents for political gain.", "link_mentions": [{"page": "Members of the Victorian Legislative Assembly, 2002–2006", "response": ["|| Heather McTaggart || Labor || Evelyn || 2002–2006"]}, {"page": "2002 Victorian state election", "response": ["| Heather McTaggart"]}, {"page": "Results and maps of the 2006 Victorian state election", "response": ["| align=\"left\" bgcolor=\"e9e9e9\" |Heather McTaggart"]}, {"page": "Candidates of the 2006 Victorian state election", "response": ["|Evelyn || Labor || Heather McTaggart || |Christine Fyffe || Justine Indigo-Rose || Roger Williamson || || Peter Byrne (PP)"]}, {"page": "Electoral district of Evelyn", "response": ["At the 2006 election Christine Fyffe regained the seat for the Liberals, defeating Heather McTaggart. Fyffe was re-elected to the district during at the 2010 and 2014 Victorian state elections.", "| Heather McTaggart"]}, {"page": "2006 Victorian state election", "response": ["| Heather McTaggart"]}, {"page": "Christine Fyffe", "response": ["In 2002, Fyffe was defeated by Labor candidate Heather McTaggart in the massive Labor landslide of that year.  At the following election in 2006, Fyffe again contested Evelyn and defeated McTaggart."]}, {"page": "Candidates of the 2002 Victorian state election", "response": ["| Evelyn || Liberal || |Heather McTaggart || Christine Fyffe (Lib) || Rob Hay || Gabriela Byrne (Ind)"]}, {"page": "Women in the Victorian Legislative Assembly", "response": ["|Heather McTaggart", "  from:2002 till:2006 color:AL text:\"Heather McTaggart (2002–2006)\""]}, {"page": "Electoral results for the district of Evelyn", "response": ["| Heather McTaggart"]}]}}