{"wiki_id": "http://www.wikidata.org/entity/Q5702008", "itemLabel": "Helen Chadwick", "itemDescription": "English artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Helen_Chadwick", "wikipedia_page": {"main": "Helen Chadwick (18 May 1953 – 15 March 1996) was a British sculptor, photographer and installation artist. In 1987, she became one of the first women artists to be nominated for the Turner Prize. Chadwick was known for \"challenging stereotypical perceptions of the body in elegant yet unconventional forms. Her work draws from a range of sources, from myths to science, grappling with a plethora of unconventional, visceral materials that included chocolate, lambs tongues and rotting vegetable matter. Her skilled use of traditional fabrication methods and sophisticated technologies transform these unusual materials into complex installations. Maureen Paley noted that \"Helen was always talking about craftsmanship—a constant fount of information\". Binary oppositions was a strong theme in Chadwick's work; seductive/repulsive, male/female, organic/man-made. Her combinations \"emphasise yet simultaneously dissolve the contrasts between them\". Her gender representations forge a sense of ambiguity and a disquieting sexuality blurring the boundaries of ourselves as singular and stable beings.\"", "link_mentions": [{"page": "Peter Gabriel", "response": ["Gabriel employed an innovative approach in the marketing of the Us album. Not wishing to feature only images of himself, he asked artist filmmakers Nichola Bruce and Michael Coulson to co-ordinate a marketing campaign using contemporary artists. Artists such as Helen Chadwick, Rebecca Horn, Nils-Udo, Andy Goldsworthy, David Mach and Yayoi Kusama collaborated to create original artworks for each of the 11 songs on the multi-million-selling CD. Coulson and Bruce documented the process on Hi-8 video. Bruce left Real World and Coulson continued with the campaign, using the documentary background material as the basis for a promotional EPK, the long-form video All About Us and the interactive CD-ROM Xplora1."]}, {"page": "University of Brighton", "response": ["The longer history of the school of art in Brighton includes the artists Conrad Heighton Leigh, and poster designer John Bellany. The artist Helen Chadwick took the sculpture course at Brighton Polytechnic (1973–76) and later returned to the institution to teach.\"Helen Chadwick\", Alumni and Associates, Faculty of Arts, University of Brighton The artist Cherryl Fountain also attended the polytechnic. The sculptor/woodcarver Robert Koenig, author of the woodcarving project Odyssey also studied on the sculpture course at the same time as Helen Chadwick. The sculptor Antony Gormley formerly taught at Brighton.\"Anthony Gormley\" (sic), Alumni and Associates, Faculty of Arts, University of Brighton"]}, {"page": "Body fluids in art", "response": ["| Helen Chadwick  || Piss Flowers || 1991–92"]}, {"page": "Camberwell", "response": ["The core of the later-to-be YBAs, graduated from the Goldsmiths BA Fine Art degree course in the classes of 1987–90. Liam Gillick, Fiona Rae, Steve Park and Sarah Lucas, were graduates in the class of 1987. Ian Davenport, Michael Landy, Gary Hume, Anya Gallaccio, Henry Bond and Angela Bulloch, were graduates in the class of 1988; Damien Hirst, Angus Fairhurst, Mat Collishaw, Simon Patterson, and Abigail Lane, were graduates from the class of 1989; whilst Gillian Wearing, and Sam Taylor-Wood, were graduates from the class of 1990. During the years 1987–90, the teaching staff on the Goldsmiths BA Fine Art included Jon Thompson, Richard Wentworth, Michael Craig-Martin, Ian Jeffrey, Helen Chadwick, Mark Wallinger, Judith Cowan and Glen Baxter. Collishaw has a studio in a pub in Camberwell. as does the sculptor Anish Kapoor.Architects Journal June 2012 http://www.architectsjournal.co.uk/news/daily-news/caseyfierro-unwraps-anish-kapoor-studio/8625145.article"]}, {"page": "Victoria and Albert Museum", "response": ["The collection includes the work of many photographers from Fox Talbot, Julia Margaret Cameron, Viscountess Clementina Hawarden, Gustave Le Gray, Benjamin Brecknell Turner, Frederick Hollyer, Samuel Bourne, Roger Fenton, Man Ray, Henri Cartier-Bresson, Ilse Bing, Bill Brandt, Cecil Beaton (there are more than 8000 of his negatives), Don McCullin, David Bailey, Jim Lee and Helen Chadwick to the present day."]}, {"page": "Turner Prize", "response": ["Sculpture artist Richard Deacon was awarded the prize. Other nominees included graphic-style painter/printer Patrick Caulfield, Helen Chadwick, Richard Long, Declan McGonagle and Thérèse Oulton. The prize was presented by George Melly."]}, {"page": "Young British Artists", "response": ["The core of the YBA group graduated from the Goldsmiths BA Fine Art degree course in the classes of 1987–90. Liam Gillick, Fiona Rae, Steve Park and Sarah Lucas, were graduates in the class of 1987. Ian Davenport, Michael Landy, Gary Hume, Anya Gallaccio, Lala Meredith-Vula, Henry Bond, Angela Bulloch, were graduates in the class of 1988; Damien Hirst, Angus Fairhurst, Mat Collishaw, Simon Patterson, and Abigail Lane, were graduates from the class of 1989; whilst Gillian Wearing, and Sam Taylor-Wood, were graduates from the class of 1990. During the years 1987–1990, the teaching staff on the Goldsmiths BA Fine Art included Jon Thompson, Richard Wentworth, Michael Craig-Martin, Ian Jeffrey, Helen Chadwick, Mark Wallinger, Judith Cowan and Glen Baxter."]}, {"page": "Babyteeth (Therapy? album)", "response": ["* \"Meat Abstract\" is named after a piece of art by British avant-garde artist Helen Chadwick."]}, {"page": "Caucasian Psychosis", "response": ["* \"Meat Abstract\" is named after a piece of art by British avant-garde artist Helen Chadwick."]}, {"page": "Xerox art", "response": ["Copy artists' dependence upon the same machines does not mean that they share a common style or aesthetic. Artists as various as Ian Burn (a conceptual/process artist who made another Xerox Book in 1968), Laurie Rae Chamberlain (a punk-inspired colour Xeroxer exhibiting in the mid 1970s) and Helen Chadwick (a feminist artist using her own body as subject matter in the 1980s) have employed photocopiers for very different purposes."]}, {"page": "Institute of Contemporary Arts", "response": ["*1986: Helen Chadwick’s artwork Carcass, consisting of composting vegetation in a perspex tower, is removed after the gasses from the compost caused the tower to give way. The smell led to complaints from neighbours and a visit by health inspectors. The main part of the exhibition, 'The Oval Court' (a major installation of sculptural forms, photocopies of animals, vegetation and the artist's body) was bought by the Victoria and Albert Museum for its permanent collection.", "*1993: The exhibition Bad Girls, curated by Kate Bush and Emma Dexter, celebrates a new spirit of playfulness, tactility and perverse humour in the work of six British and US women artists: Helen Chadwick, Dorothy Cross, Rachel Evans, Nicole Eisenman, Nan Goldin and Sue Williams."]}, {"page": "Chelsea College of Arts", "response": ["* Helen Chadwick (1987 Turner Prize nominee)"]}, {"page": "Momart", "response": ["The fire spread through the adjoining units at the estate, eventually reaching and destroying a warehouse then operated by Momart. The blaze destroyed more than 100 works by some of Britain's leading contemporary artists including Tracey Emin, Damien Hirst, Sarah Lucas, Gary Hume, Jake and Dinos Chapman, Helen Chadwick and others. Many of those works were owned by Charles Saatchi, the country's biggest collector of modern art.", "*1992 — Helen Chadwick"]}, {"page": "1996 in art", "response": ["*15 March – Helen Chadwick, British artist (b. 1953)."]}, {"page": "Abjection", "response": ["In the late 1990s, the abject became a theme of radical Chinese performance artists Zhu Yu and Yang Zhichao. The abject also began to influence mainstream artists including Louise Bourgeois, Helen Chadwick, Gilbert and George, Robert Gober, Kiki Smith and Jake and Dinos Chapman who were all included in the 1993 Whitney show.\"Abject Art\" Retrieved on 2010-11-09. Other artists working with abjection include New York photographers, Joel Peter Witkin, whose book Love and Redemption and Andres Serrano whose piece entitled Piss Christ caused a scandal in 1989."]}]}}