{"wiki_id": "http://www.wikidata.org/entity/Q5702014", "itemLabel": "Helen Chadwick", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Helen_Chadwick_(musician)", "wikipedia_page": {"main": "Helen Chadwick is a British composer and singer who has written over 300 songs, mainly for unaccompanied voices. She has ten albums and creates song theatre performances, both solo and with her group. As a singer she has worked with Meredith Monk, Orlando Gough and for the Royal National Theatre.\nHelen's recordings to 2005 are included in the Women's Revolutions Per Minute (WRPM) Collection and Archive at Goldsmiths University of London Special Collections.In 2008 she created, composed and sung in two productions commissioned by the Royal Opera House: Dalston Songs, based on interviews with her neighbours on the theme of home, in collaboration with choreographer Steven Hoggett, and The Singing Circle, featuring the massed voices of several choirs, and choreography by Liam Steel. In 2014 she created War Correspondents, based on interviews with frontline journalists; on this show she again collaborated with Steven Hoggett.Helen composed music for a sound installation at Wollaton Hall, Nottingham, which won the East Midlands Heritage Award (Judges Special Prize) in 2017.In 2002, in collaboration with the Thames Festival, Helen co-founded the mass singing charity project Sing For Water. As of 2019 it has raised 1 million pounds for WaterAid.Helen is a long-time member of the Magdalena Project, an international network of women in contemporary theatre and performance, and performs regularly at Magdalena festivals around the world.\n\n", "link_mentions": [{"page": "Dalston", "response": ["* Dalston Songs is a staged song cycle with seven singers created and composed by Helen Chadwick and choreographed by Steven Hoggett. It was based on interviews with people in East London about home and was performed in 2008 at the Royal Opera House."]}, {"page": "Helen Chadwick", "response": ["Helen Chadwick (18 May 1953 – 15 March 1996) was a British sculptor, photographer and installation artist. In 1987, she became one of the first women artists to be nominated for the Turner Prize.Tate Turner Prize nominees. Helen Chadwick. 1987 Chadwick was known for \"challenging stereotypical perceptions of the body in elegant yet unconventional forms. Her work draws from a range of sources, from myths to science, grappling with a plethora of unconventional, visceral materials that included chocolate, lambs tongues and rotting vegetable matter. Her skilled use of traditional fabrication methods and sophisticated technologies transform these unusual materials into complex installations. Maureen Paley noted that \"Helen was always talking about craftsmanship—a constant fount of information\". Binary oppositions was a strong theme in Chadwick's work; seductive/repulsive, male/female, organic/man-made. Her combinations \"emphasise yet simultaneously dissolve the contrasts between them\". Her gender representations forge a sense of ambiguity and a disquieting sexuality blurring the boundaries of ourselves as singular and stable beings.\"", "Helen Chadwick was born on 18 May 1953 in Croydon, England. Her mother was a Greek refugee and her father from east London. Her parents met during the Second World War in Athens, Greece, and moved to live in Croydon in 1946. After Chadwick left Croydon High School, she embarked on a Fine Art Foundation course at Croydon College, then went on to study at Brighton Polytechnic (1973–76). She recalled, \"Traditional media were never dynamic enough… right from early on in art school, I wanted to use the body to create a set of inter-relationships with the audience\". Her degree show Domestic Sanitation (1976) consisted of her and three other women, 'wearing' latex costumes painted directly on to the skin, engaging in a satirical feminist round of cleaning and grooming. In 1976, Chadwick moved to Hackney and enrolled in a Masters course at Chelsea College of Art (1976–77). In 1977, she and two dozen other artists moved into Beck Road, Hackney, a double strip of Victorian terraces that was earmarked for demolition. After squatting for two years they persuaded the Inner London Education Authority to rent out, rather than demolish, the houses. Beck Road became a hive of home studios whose residents included Maureen Paley, Ray Walker and Genesis P-Orridge.", "In the summer of 1994, Chadwick's exhibition Effluvia opened at the Serpentine, London. This exhibition marked the high point of Chadwick's exposure, receiving widespread critical attention and national press coverage. The exhibition was seen by 54,000 visitors, breaking the record for the gallery. In 1995, Chadwick received her first solo exhibition in the United States at the Museum of Modern Art, New York, entitled Helen Chadwick: Bad Blooms. In 1995, Chadwick took up an artist residency in the assisted conception unit at King's College Hospital, London, photographing IVF embryos rejected for implantation.[11] She used the photos in Unnatural Selection, a series on which she was working when she died. Chadwick's work is included in the collections at the Victoria and Albert Museum, The Tate and the Museum of Modern Art.", "Chadwick's impact on the British art scene as an artist and teacher helped pave the way for the Young British Artist (YBA) generation. Her expanded use of materials can be seen carried through the work of many these artists. Without Chadwick's Cacao, for example, it is impossible to imagine Anya Gallacio's chocolate and flower installations. Since Chadwick's Barbican organised retrospective, the full measure of her contribution to the trajectory of contemporary British art is starting to be realised. The Richard Saltoun Gallery in London represents the estate of Helen Chadwick, and has continued to show the artist's work. Works From The Estate (2013) marked what would have been the artists 60th birthday, showing some of Chadwick's most famous works. The following year Bad Blooms (2014) exhibited Chadwick's Wreaths of Pleasure (1992–93)."]}, {"page": "ROH2", "response": ["Faeries (Will Tuckett), Pleasure’s Progress (Will Tuckett/Paul Englishby), Goldberg (Kim Brandstrup/Tamara Rojo), Ghosts (Cathy Marston), The Soldier’s Tale (Will Tuckett), Into the Woods (Will Tuckett), Dalston Songs (Helen Chadwick), The Thief of Baghdad (Will Tuckett/Paul Englishby), Into the Little Hill (John Fulljames/George Benjamin), The Red Balloon (Aletta Collins/Street Furniture), and Parthenogenesis (Katie Mitchell/James MacMillan)."]}, {"page": "Helen Varley Jamieson", "response": ["* her light stretches: an installation of text, song, light and mirrors, in collaboration with Helen Chadwick (2016-ongoing)."]}, {"page": "The Voice Project (music)", "response": ["Siân Croose is a singer, conductor and performance maker with over 30 years experience creating and directing music projects in the UK. After an apprenticeship in bands and alternative theatre, she trained on the Community Music programme founded by John Stevens. She has run choirs, vocal ensembles, and workshops for singers since 1990, and performed with composer Helen Chadwick and a cappella ensemble Human Music in a wide range of  UK festivals and performance projects. Composition projects include Harmonium, a wordless systems-based a cappella project for women's voices and The Dawn Chorus with American composer Brendan Taaffe. She runs Norwich – based choir Big Sky, regularly commissioning new music from award-winning songwriter Chris Wood and others, and performing with storyteller Hugh Lupton and multi-instrumentalist Adrian Lever.", "Norwich Catholic Cathedral December. Music performed by Lewis Wright (Vibraphone) and Adrian Lever (Piano). Solo singers: Sianed Jones & Helen Chadwick (Soprano),  Katherine Zeserson & Siân Croose (Alto), Dave Camlin & Jonathan Baker (Bass). The Voice Project Choir was conducted by Siân Croose.", "Music performed by Adrian Lever (Piano). The Voice Project Quintet were Sianed Jones & Helen Chadwick (Soprano), Katherine Zeserson & Siân Croose (Alto) and Dave Camlin & Jonathan Baker (Bass). The Voice Project Choir was conducted by Siân Croose.", "Composed by Orlando Gough, Helen Chadwick, Jonathan Baker and Jeremy Avis. The Voice Project Quartet were Sianed Jones (Soprano), Rebecca Askew (Alto), Jeremy Avis (Tenor) and Jonathan Baker (Bass). The Voice Project Choir was conducted by Siân Croose.", "Music composed by Orlando Gough, Helen Chadwick, Karen Wimhurst and Jonathan Baker. Music performed by Bold as Brass Quartet and Derek Scurll (Percussion). Solo singers were Sianed Jones (Soprano), Rebecca Askew (Alto), Jeremy Avis (Tenor) and Jonathan Baker (Bass). The Voice Project Choir was conducted by Siân Croose.", "Music composed by Orlando Gough, Helen Chadwick, Karen Wimhurst, Jonathan Baker and Dave Camlin, Music performed by Adrian Lever (Piano). Sound Design was by Bill Vine, Lighting Design by Tim Tracey, and Lighting by Pip Cotterell. Human Music were Sharon Durant (Soprano), Helen Chadwick (Soprano), Katherine Zeserson] (Alto), Siân Croose (Alto), Jeremy Avis (Tenor), Dave Camlin (Bass), Jonathan Baker (Bass). The Voice Project Choir was conducted by Siân Croose.", "Music composed by Orlando Gough, Jonathan Baker, Helen Chadwick & Jon Hopkins. The Voice Project Quintet were Sianed Jones & Lisa Cassidy (soprano), Siân Croose (Alto), Jeremy Avis (Tenor), Jonathan Baker (Bass). The Voice Project Choir was conducted by Siân Croose.", "Music composed by Jonathan Baker, Orlando Gough, Helen Chadwick and Siân Croose. Music performed by Esther Hopkinson (Violin), Hefin Miles (Violin), John Mudd (Cello), Adrian Lever (Piano), Jeron Gundersen (Percussion). The Voice Project quintet were Lisa Cassidy (Soprano), Rebecca Askew & Siân Croose (Alto), Jeremy Avis (Tenor), Jonathan Baker (Bass). The Voice Project Choir was conducted by Siân Croose.", "Music composed by Jonathan Baker, Orlando Gough, Rebecca Askew, Siân Croose, Helen Chadwick, Karen Wimhurst. Music performed by Adrian Lever (piano, organ and hammered dulcimer). The Voice Project quintet were Sianed Jones & Lisa Cassidy (Soprano), Siân Croose (Alto), Jeremy Avis (Tenor), Jonathan Baker (Bass). Lighting design was done by Tim Tracey. The Voice Project Choir was conducted by Siân Croose.", "Music composed by Orlando Gough, Jonathan Baker, Jason Dixon, Erin McDonnell, Siân Croose, Meredith Monk, Helen Chadwick & Jeremy Avis. Music performed by Chris Dowding (Trumpet and Flugelhorn) and Derek Scurll (Percussion). The Voice Project Quintet were Lisa Cassidy (Soprano), Sharon Dunant (Soprano), Siân Croose (Alto), Jeremy Avis (Tenor) and Jon Baker (Bass). The Voice Project Choir was conducted by Siân Croose.", "Music composed by Helen Chadwick, Jonathan Baker, Gwilym Simcock, Andy Sheppard, Karen Wimhurst, Orlando Gough and Barbara Thompson. Music performed by Andy Sheppard (Soprano and Alto Saxophone), Adrian Lever (Piano, Organ), Donna-Marie Landowski (Percussion), Iain Lowery (Guitar). The Voice Project Quintet were Lisa Cassidy (Soprano), Sharon Durant (Soprano), Siân Croose (Alto),Jeremy Avis (Tenor), Jonathan Baker (Bass). Lighting design was done by Tim Tracey. The Voice Project Choir was conducted by Siân Croose.", "Music composed by Helen Chadwick, Jonathan Baker, Karen Wimhurst, Orlando Gough and Barbara Thompson. Music performed by Adrian Lever (Piano, Organ). The Voice Project Quartet were Lisa Cassidy (Soprano), Siân Croose (Alto), Jeremy Avis (Tenor), Jonathan Baker (Bass). Lighting design was done by Tim Tracey. The Voice Project Choir was conducted by Siân Croose.", "Music composed by Helen Chadwick, Jonathan Baker, Karen Wimhurst and Jonathan Baker. The Voice Project Quartet were Lisa Cassidy (Soprano), Sianed Jones (Soprano), Siân Croose (Alto), Jeremy Avis (Tenor), Jonathan Baker (Bass). The Voice Project Choir was conducted by Siân Croose.", "Music composed by Helen Chadwick, Orlando Gough and Jonathan Baker. Music performed by Adrian Lever (Piano, Hammered Dulcimer) and Steve Morgan (Vibraphone - only in Hove). The Voice Project Quintet were Lisa Cassidy (Soprano), Sianed Jones (Soprano), Siân Croose (Alto), Jeremy Avis (Tenor) and Jonathan Baker (Bass). Lighting design was done by Nathan Clarke. The Voice Project Choir was conducted by Siân Croose."]}]}}