{"wiki_id": "http://www.wikidata.org/entity/Q5708495", "itemLabel": "John Manuel Cook", "itemDescription": "British classical archaeologist and ancient historian (1910–1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Manuel_Cook", "wikipedia_page": {"main": "John Manuel Cook,  (1910–1994) was a British classical archaeologist. He was educated at Marlborough College, and went to King's College, Cambridge (1929–32).His older brother was Robert Manuel Cook, also a noted scholar of antiquity.", "link_mentions": [{"page": "Saka", "response": ["In the modern era, the archaeologist Hugo Winckler (1863–1913) was the first to associate the Sakas with the Scythians. John Manuel Cook, in The Cambridge History of Iran, states: \"The Persians gave the single name Sakā both to the nomads whom they encountered between the Hungry Steppe and the Caspian, and equally to those north of the Danube and Black Sea against whom Darius later campaigned; and the Greeks and Assyrians called all those who were known to them by the name  and . Sakā and Skuthai evidently constituted a generic name for the nomads on the northern frontiers.\"  Persian sources often treat them as a single tribe called the Saka (Sakai or Sakas), but Greek and Latin texts suggest that the Scythians were composed of many sub-groups.Journal of the Royal Asiatic Society of Great Britain & Ireland By Royal Asiatic Society of Great Britain and Ireland-page-323"]}, {"page": "John Cook", "response": ["* John Manuel Cook (1910–1994), British archaeologist"]}, {"page": "Cebrene", "response": ["A rare series of bronze coins display the obverse and reverse types of Cebren (ram's head/head of Apollo), but bear the legend  (Antiocheōn, '(coin of the) Antiocheis'). On the basis of these coins it has been argued, most notably by the French epigrapher Louis Robert, that Cebren was refounded by Antiochus I Soter as Antiocheia in the Troad following Antiochus' victory over Lysimachus at the Battle of Corupedium in 281 BCE, after which most of western Asia Minor came under his control. Moreover, Robert noted that some of these coins bore the letters B and K and included a club beside the ram's head: since the club is the typical symbol of the coinage of Birytis, an unlocated city in the Troad, Robert argued that these letters referred to B(irytis) and K(ebren) and were evidence of a synoecism or sympoliteia between the two communities which had produced the new foundation of Antiocheia in the Troad.Robert (1951) 16-31. Robert cites two further documents which he thinks proves the continued existence of Cebren in the early 2nd century BCE: the Theorodokoi lists of Delphi (Plassart (1921) 8, lines 20-1) and an inscription from Assos (Merkelbach (1976) no. 4). Cook (1973) 342-3 shows that Cebren is an incorrect restoration in the Theorodokoi list, which in any case date to the 230s or 220s, while the most recent editor dates the inscription from Assos to ca. 330-310 BCE. Robert's arguments have been repeatedly criticized by the archaeologist John Manuel Cook, who could discern no archaeological or numismatic evidence for occupation in the Hellenistic period at the site of Çal Dağ.Cook (1973) 338-44, (1988). Cook based these claims on only two days of surface survey at Çal Dağ, and as such definitive answers regarding the settlement history of the site in the 3rd century BCE will have to await a full excavation.Cook (1973) 6, 339."]}, {"page": "Robert Manuel Cook", "response": ["In 1938, Cook married Kathleen Porter (d.1979). The Cooks enjoyed travelling together and, in 1968, they published a joint work, Southern Greece: An Archaeological Guide. His younger brother was John Manuel Cook, also a noted scholar of antiquity."]}, {"page": "Achilleion (Troad)", "response": ["Achilleion (;  or Achilleium) was an ancient Greek city in the south-west of the Troad region of Anatolia.The spelling  (Achillēion) is found in Herodotus 5.94.2, reflecting his Ionic dialect. It has been located on a promontory known as Beşika Burnu ('cradle promontory') about 8 km south of Sigeion.John Manuel Cook (1973) 180-1, 185-6, Mitchell (2004). Beşika Burnu is 2 km south of the modern village of Yeniköy in the Ezine district of Çanakkale Province, Turkey.Cook (1973) 185-6. The site considered in classical antiquity to be the tomb of Achilles is a short distance inland at a tumulus known as Beşiktepe.Cook (1973) 186, Korfmann (1988), Kosatz (1988). Achilleion in the Troad is not to be confused with Achilleion near Smyrna and Achilleion in the territory of Tanagra.O. Hirschfeld, RE I (1893) s.v. 'Achilleion (2-3)' col. 220."]}, {"page": "Neandreia", "response": ["Neandreia (), Neandrium or Neandrion (Νεάνδριον), also known as Neandrus or Neandros (Νέανδρος), was a Greek city in the south-west of the Troad region of Anatolia. Its site has been located on Çığrı Dağ, about 9 km east of the remains of the ancient city of Alexandria Troas in the Ezine district of Çanakkale province, Turkey (based on the work of John Manuel Cook).Cook (1973) 204. The site was first identified as Neandreia by Frank Calvert in 1865 and Joseph Thacher Clarke in 1886 and was first excavated by the German architect Robert Koldewey when he excavated in 1889.Koldewey (1891). For a brief history of the site's discovery see Schulz (2000) 6-8."]}, {"page": "J.M. Cook", "response": ["#REDIRECT John Manuel Cook"]}, {"page": "J. M. Cook", "response": ["#REDIRECT John Manuel Cook"]}, {"page": "Old Smyrna", "response": ["Archaeological excavations started 1930/31 under Franz Miltner. From 1948 to 1951 British-Turkish exacavations were guided under the direction of John Manuel Cook and Ekrem Akurgal. Since 1967 there are further Turkish excavations."]}]}}