{"wiki_id": "http://www.wikidata.org/entity/Q5702060", "itemLabel": "Helen Cooper", "itemDescription": "professor of Medieval and Renaissance English", "wikipedia_url": "https://en.wikipedia.org/wiki/Helen_Cooper_(literary_scholar)", "wikipedia_page": {"main": "Elizabeth Helen Cooper,  (born 6 February 1947), known as Helen Cooper, is a British literary scholar. From 2004 to 2014, she was Professor of Medieval and Renaissance English at the University of Cambridge, and a fellow of Magdalene College, Cambridge.", "link_mentions": [{"page": "Thomas Malory", "response": ["By far the likeliest candidate for the authorship is Thomas Malory of Newbold Revel in Warwickshire.Whitteridge, Gweneth. \"The Identity of Sir Thomas Malory, Knight-Prisoner.\" The Review of English Studies; 24.95 (1973): 257–265. JSTOR. Web. 30 November 2009.Riddy, Felicity: Sir Thomas Malory. Leiden: E. J. Brill. H. Oskar Sommer first proposed this identification in his edition of Le Morte d'Arthur published in 1890, and George Lyman Kittredge, a professor at Harvard, provided the evidence in 1896. Kittredge showed Malory as a soldier and a Member of Parliament, who fought at Calais with Richard Beauchamp, Earl of Warwick. However, a biography by Edward Hicks published in 1928 revealed that Malory had been imprisoned as a thief, bandit, kidnapper, and rapist, which hardly seemed in keeping with the high chivalric standards of his book. Helen Cooper referred to his life as one that \"reads more like an account of exemplary thuggery than chivalry\"."]}, {"page": "Thomas the Rhymer", "response": ["From the opposite point of view, Child thought that the ballad \"must be of considerable age\", even though the earliest available to him was datable only to ca. 1700–1750. E. B. Lyle, who has published extensively on Thomas the Rhymer, surveys post-1950s scholarship on Thomas. presents the hypothesis that the ballad had once existed in a very early form upon which the romance was based as its source. One supporter of this view is Helen Cooper who remarks that the ballad \"has one of the strongest claims to medieval origins\";, p.467 n17: \"[Lyle's paper] suggests that an early form of the ballad may underlie the romance.\" another is Richard Firth Green who has provided strong evidence for his contention that \"continuous oral transmission is the only credible explanation,\" by showing that one detail in the medieval romance, omitted from the seventeenth-century print, is preserved in the Greenwood version.Green, Richard Firth (2021). \"‘Thomas Rymer’ and Oral Tradition,\" Notes and Queries, 68, 4."]}, {"page": "Magdalene College, Cambridge", "response": ["* Helen Cooper, Professor of Medieval and Renaissance English, a Chair formerly held by three previous Magdalene fellows: C. S. Lewis, J. A. W. Bennett, and John Stevens"]}, {"page": "Murray Edwards College, Cambridge", "response": ["* Helen Cooper, literary scholar"]}, {"page": "Nottingham Girls' High School", "response": ["*Helen Cooper (born 1947), literary scholar"]}, {"page": "Helen Cooper", "response": ["Helen Cooper may refer to:", "*Helen Cooper (literary scholar), professor of Medieval and Renaissance English ", "*Helen Cooper (illustrator) (born 1963), illustrator and author of children's books", "*Helen Cooper (politician) (born 1946), former mayor of Kingston, Ontario"]}, {"page": "Percy Edward Kent", "response": ["He married Margaret (Betty) Hood in 1940, and they had two daughters, one of whom is Helen Cooper. His first wife died in 1974. In 1976 he married Lorna Scott. He lived in West Bridgford."]}, {"page": "Helen Cooper (professor)", "response": ["#REDIRECT Helen Cooper (literary scholar)"]}, {"page": "List of fellows of the British Academy elected in the 2000s", "response": ["* Professor Helen Cooper (University of Cambridge) English Literature "]}, {"page": "E.H. Cooper", "response": ["#REDIRECT Helen Cooper (literary scholar)"]}, {"page": "EH Cooper", "response": ["#REDIRECT Helen Cooper (literary scholar)"]}, {"page": "E H Cooper", "response": ["#REDIRECT Helen Cooper (literary scholar)"]}, {"page": "E. H. Cooper", "response": ["#REDIRECT Helen Cooper (literary scholar)"]}, {"page": "Elizabeth Helen Cooper", "response": ["#REDIRECT Helen Cooper (literary scholar)"]}]}}