{"wiki_id": "http://www.wikidata.org/entity/Q5702545", "itemLabel": "Helen John", "itemDescription": "British peace activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Helen_John", "wikipedia_page": {"main": "Helen John (30 September 1937 – 5 November 2017) was one of the first full-time members of the Greenham Common peace camp.", "link_mentions": [{"page": "Greenham Common Women's Peace Camp", "response": ["* Helen John"]}, {"page": "King and Country debate", "response": ["Several debates decades after the original would occur at the Oxford Union. After the Falkland crisis a year prior, exactly what the citizens of Britain would go to war for came into question. On 9 February 1983, coincidentally the 50th anniversary of the original debate, another debate was held with the motion, That this House would not fight for Queen and Country,\" brought to the floor. Beloff, returned to fight the motion: \"Those of us who voted for the original motion have perhaps a duty to make atonement and warn against the kind of foolish arrogance to make statements that were factually and morally untrue.\" He then went on to explain himself, stating that many of the proponents of the original motion would go on to fight and die during World War II, and simply presenting the motion implied that the people of Great Britain was unable to fight in another war. Helen John spoke in favor of the motion, citing the American bases already on British soil, and American actions in Latin America being no different from the Soviets' involvement in Poland and Afghanistan. The outcome of the vote was a landslide for the opposition, with 416 noes to the 187 ayes."]}, {"page": "Anti-nuclear movement in the United Kingdom", "response": ["*Helen John"]}, {"page": "HM Prison Askham Grange", "response": ["* Helen John, a peace campaigner, was held at Askham Grange for criminal damage whilst standing against Tony Blair in the UK 2001 general election in his Sedgefield constituency"]}, {"page": "List of peace activists", "response": ["* Helen John (1937–2017) – British activist, one of the first full-time members of the Greenham Common peace camp"]}, {"page": "2017 in the United Kingdom", "response": ["**Helen John, 80, anti-war activist."]}, {"page": "Deaths in November 2017", "response": ["*Helen John, 80, British anti-war activist.Peace campaigner Helen John who fought for Sedgefield constituency against Tony Blair behind bars dies"]}, {"page": "Women's liberation movement in Europe", "response": ["The Greenham Common Peace Camp started in 1981. A group of women protesting nuclear missiles marched from Cardiff to the RAF Greenham. Women left their jobs and families in order to occupy the space and fight for peace in a direct action which recognized that men were responsible for most of the world's violence. Unaligned with political groups, the women gained wide support from the media and public for their stance to non-violence. Helen John was one of the founders of the occupation."]}, {"page": "List of women pacifists and peace activists", "response": ["* Helen John – British activist, one of the first full-time members of the Greenham Common peace camp"]}]}}