{"wiki_id": "http://www.wikidata.org/entity/Q5719970", "itemLabel": "Henry Croft", "itemDescription": "Founder of London's Pearly Kings and Queens", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Croft_(pearly)", "wikipedia_page": {"main": "Henry Croft (24 May 1861 — 1 January 1930) was a road sweeper in London and founder of the working class tradition of Pearly Kings and Queens.", "link_mentions": [{"page": "St Martin-in-the-Fields", "response": ["The crypt houses a café which hosts jazz concerts whose profits support the programmes of the church. The crypt is also home to the London Brass Rubbing Centre, established in 1975 as an art gallery, book, and gift shop.  A life-sized marble statue of Henry Croft, London's first pearly king, was moved to the crypt in 2002 from its original site at St Pancras Cemetery."]}, {"page": "Pearly Kings and Queens", "response": ["==Henry Croft==", "thumb|Henry Croft, the first Pearly King", "The practice of wearing clothes decorated with mother-of-pearl buttons is first associated with Henry Croft (1861-1930), an orphan street sweeper who collected money for charity. At the time, London costermongers (street traders) were in the habit of wearing trousers decorated at the seams with pearl buttons that had been found by market traders. In the late 1870s, Croft adapted this to create a sequin suit to draw attention to himself and aid his fund-raising activities. In 1911 an organised pearly society was formed in Finchley, north London. ", "*Henry Croft, Pearly King and other Pearly photos on flickr"]}, {"page": "Costermonger", "response": ["In the 1880s, a man by the name of Henry Croft who had long admired the costermonger's way of life as well as their showiness and panache, smothered his worn out suit and accessories with pearly buttons arranged in geometric patterns. Costermongers soon recognised that the public loved these shimmering outfits and began wearing more and more heavily decorated outfits and soon became known as the Pearly Kings and Queens."]}, {"page": "St Pancras and Islington Cemetery", "response": ["*Henry Croft, first \"Pearly King\". The grave marker is now in the crypt of St Martin-in-the-Fields."]}, {"page": "Henry Croft (disambiguation)", "response": ["Henry Croft (1856–1917) was a Canadian mining magnate.", "Henry Croft may also refer to:", "*Henry Croft (pearly) (1861–1930), founder of the working class tradition of Pearly Kings and Queens", "*Henry Crofts (1590–1667), English politician"]}, {"page": "Timeline of London (1800s)", "response": ["** Henry Croft is dressing as a pearly king by this date."]}, {"page": "Chalton Street Market", "response": ["Henry Croft, the founder of the tradition of Pearly Kings and QueensDavenport, Bob. Henry Croft: The Original Pearly King, Studied Monuments, 2015. Retrieved on 1 May 2020. was born in St Pancras Workhouse, Somers Town in 1861. Though he was a road sweeper rather than a costermonger, his colourful style of raising money for charity has influenced cockney market traders down to this day illustrated by a parade of Pearly Kings and Queens at the opening ceremony for the 2012 Summer Olympics."]}]}}