{"wiki_id": "http://www.wikidata.org/entity/Q5719716", "itemLabel": "Henry Combe Compton", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Combe_Compton", "wikipedia_page": {"main": "Henry Combe Compton (1789 – 27 November 1866) was a British Conservative Party politician.\nHe was elected at the 1835 general election as a Member of Parliament (MP) for South Hampshire, and held the seat until he stood down from the House of Commons at the 1857 general election.\n\n", "link_mentions": [{"page": "List of MPs elected in the 1852 United Kingdom general election", "response": ["|rowspan=\"2\"|Hampshire South(two members)||Henry Combe Compton||Conservative"]}, {"page": "John Willis Fleming", "response": [", Vol 1, p. 671 He was educated at Eton College. He was the great grandson of the antiquary Browne Willis, and of Benedict Calvert, 4th Baron Baltimore and Charlotte Lee, Lady Baltimore. In 1813 he changed his name by Private Act of Parliament from John Fleming Barton Willis to John Fleming, and he was also known thereafter as John Willis Fleming. In 1813 he married Christopheria Buchanan, by whom he had four sons and four daughters. He was High Sheriff of Hampshire in 1817. He was elected Member of Parliament for Hampshire in 1820, and again in 1826 and 1830; and jointly with Henry Combe Compton for South Hampshire in 1835, 1837, and 1841."]}, {"page": "South Hampshire (UK Parliament constituency)", "response": ["|rowspan=\"3\"| Henry Combe Compton"]}, {"page": "Henry Compton", "response": ["* Henry Combe Compton (1789–1866), British Conservative Party politician, Member of Parliament for South Hampshire, 1835–1857"]}, {"page": "Francis Compton (Conservative politician)", "response": ["Compton was the son of Henry Combe Compton M.P. of Minstead Manor House, Lyndhurst, Hampshire and his wife Charlotte Mills.  He was educated at Merton College, Oxford and became a Fellow of All Souls. He was called to the bar at Lincoln's Inn and Middle Temple in 1850. He was a J.P. for Hampshire.Debretts Guide to the House of Commons 1886"]}]}}