{"wiki_id": "http://www.wikidata.org/entity/Q5719788", "itemLabel": "Henry Cooper", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Cooper_(VC)", "wikipedia_page": {"main": "Henry Cooper VC (1825 – 15 July 1893) was an English recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.\nHe was about 30 years old, and a Boatswain in the Royal Navy during the Crimean War when the following deed took place for which he was awarded the VC.", "link_mentions": [{"page": "List of English Victoria Cross recipients", "response": ["|Henry Cooper || Royal Navy || 1855 || Crimean War || Taganrog"]}, {"page": "Henry Cooper (disambiguation)", "response": ["Henry Cooper (1934–2011) was a British heavyweight boxer.", "Henry Cooper may also refer to:", "* Henry Cooper (U.S. senator) (1827–1884), from Tennessee", "* Henry Cooper (footballer) (born 1989), Costa Rican footballer", "* Henry Cooper (Northern Districts cricketer) (born 1993), New Zealand cricketer", "* Henry Cooper (VC) (1825–1893), English recipient of the Victoria Cross", "* Henry Cooper (bishop) (1845–1916), Australian Anglican bishop", "* Henry Cooper (educator) (1909–1990), New Zealand educator and sportsman", "* Sir Henry Cooper School, a secondary school in Kingston upon Hull, England"]}, {"page": "Cecil Buckley", "response": ["On 29 May 1855 in the Sea of Azov, Crimea, Lieutenant Buckley of HMS Miranda, with a lieutenant (Hugh Talbot Burgoyne) from HMS Swallow and a gunner (John Robarts) from HMS Ardent, volunteered to land at a beach where the Russian army were in strength. They were out of covering gunshot range of the ships offshore and met considerable enemy opposition, but managed to set fire to corn stores and ammunition dumps and destroy enemy equipment. On 3 June Lieutenant Buckley carried out another raid with a boatswain (Henry Cooper) from Miranda. They landed at the town of Taganrog and were successful in destroying enemy equipment and stores, whilst being under enemy fire."]}, {"page": "Henry Cooper VC", "response": ["#REDIRECT Henry Cooper (VC)"]}, {"page": "Siege of Taganrog", "response": ["The ultimatum was answered by Tolstoy's official for important missions, Baron Yevgeny Pfeilizer-Frank (nephew to former governor Otto Pfeilizer-Frank) and poet Nikolay Sherbina, who later described the event in Moskovskiye Vedomosti on 21 June 1855. The allies demanded the surrender of all government property, the withdrawal of troops and the evacuation of civilians. After an hour of consideration Baron Pfeilizer-Frank returned to the envoys with Tolstoy's reply, rejecting the demands.\"Destruction of Russian Stores at Taganrog\" in The Illustrated London News, 14 July 1855 The Recruit then hauled down her flag of truce and opened fire on the town. The Danube and Mouette, towing the Lady Nancy moved up in the company of the armed launches and joined in the bombardment. A four-oared gig then landed Lt Cecil Buckley and Boatswain Henry Cooper, who proceeded to set fire to the military depots buildings before returning, in the same manner they had at Genitchi on 29 May. The raft Lady Nancy and some of the launches gave close support to the raiding party. Both earned the Victoria Cross for their actions and due to seniority and spelling Buckley was awarded the first VC ever gazetted. All the stores of grain, timber, tar, all the boats in the harbour (including the Russian gunboat Akkerman and various other warships under construction) and any boats under construction, together with the Customs House and the main government buildings were set ablaze."]}, {"page": "HMS Miranda (1851)", "response": ["On 3 June 1855 at Siege of Taganrog on Sea of Azov, Boatswain Henry Cooper and Lieutenant Cecil William Buckley of Miranda landed destroying equipment and setting fire to government buildings. This despite the town being under bombardment and garrisoned by 3,000 Russian troops. For this action the pair were awarded the Victoria Cross. Captain Edmund Moubray Lyons of Miranda reported on 29 May 1855 that in the first four days of the squadron entering the Sea of Azov, the enemy had lost four steamers of war, 246 merchant vessels, together with corn and flour magazines to the value of at least £150,000.London Gazette Issue 21728 page 2299 dated 13 June 1855"]}, {"page": "Church of St James, Antony", "response": ["The churchyard includes the grave of Henry Cooper who died in 1893. He was a recipient of the Victoria Cross for his actions during the Crimean War."]}]}}