{"wiki_id": "http://www.wikidata.org/entity/Q5719782", "itemLabel": "Henry Cookson", "itemDescription": "British polar explorer", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Cookson", "wikipedia_page": {"main": "Henry John R Cookson, FRGS (born 16 September 1975) is a British polar explorer and adventurer. On 19 January 2007 he, alongside fellow Britons Rory Sweet and Rupert Longsdon, and their Canadian polar guide Paul Landry, became the first team to reach the southern pole of Inaccessibility (POI) by foot, the last visitors being a research team using tracked vehicles & planes in 1965.", "link_mentions": [{"page": "Pole of inaccessibility", "response": ["On 4 December, 2006, Team N2i, consisting of Henry Cookson, Rupert Longsdon, Rory Sweet and Paul Landry, embarked on an expedition to be the first to reach the historic pole of inaccessibility location without direct mechanical assistance, using a combination of traditional man hauling and kite skiing. The team reached the old abandoned station on 19 January, 2007, rediscovering the forgotten statue of Lenin left there by the Soviets some 48 years previously. The team found that only the bust on top of the building remained visible; the rest was buried under the snow. The explorers were picked up from the spot by a plane from Vostok base, flown to Progress Base and taken back to Cape Town on the Akademik Fyodorov, a Russian polar research vessel."]}, {"page": "List of polar explorers", "response": ["* Henry Cookson"]}, {"page": "List of Old Harrovians", "response": ["*Henry Cookson (1975–), British polar explorer and adventurer among the first to reach the southern pole of Inaccessibility by foot"]}, {"page": "Pole of Inaccessibility research station", "response": ["* Henry Cookson, British Adventurer"]}, {"page": "Paul Landry", "response": ["* November 2006 - January 2007 : Team N2i (Rory Sweet, Henry Cookson, Rupert Longsdon) - Kite Ski Expedition to the Pole of Inaccessibility"]}, {"page": "Hawtreys", "response": ["*Henry Cookson Guinness Book of Records as member of first team to reach the Antarctic Pole of inaccessibility in 2007"]}, {"page": "Polar Challenge", "response": ["The current race record holders are Team Hardware.com, consisting of Henry Cookson, Rupert Longsdon & Rory Sweet who won the challenge in 2005, they then went on to enter the Guinness Book of Records by being the first people to reach the Southern Pole of Inaccessibility by foot & kite ski in 2007. They were guided here by veteran guide Paul Landry whom they met during training in Resolute Bay prior to the race starting."]}, {"page": "Ben Saunders (explorer)", "response": ["* Henry Cookson, British adventurer"]}, {"page": "Team N2i", "response": ["#REDIRECT Henry Cookson"]}, {"page": "Rupert Longsdon", "response": ["#REDIRECT Henry Cookson"]}, {"page": "Scott Dunn Polar Challenge", "response": ["#REDIRECT Henry Cookson#Scott Dunn Polar Challenge"]}, {"page": "Henry Cookson (disambiguation)", "response": ["Henry Cookson (born 1975) is a British polar explorer and adventurer.", "Henry Cookson may also refer to:", "* Harry Cookson (James Henry Cookson, 1869–1922), British footballer"]}]}}