{"wiki_id": "http://www.wikidata.org/entity/Q5728025", "itemLabel": "Henry Saunders", "itemDescription": "Cricketer  for the Turks and Caicos Islands. (born 1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Saunders_(cricketer,_born_1966)", "wikipedia_page": {"main": "Henry Armstrong Eugene Saunders (born 17 June 1966) is a cricketer who plays for the Turks and Caicos Islands.  Saunders is a right-handed batsman who bowls right-arm medium-fast.  He was born at Grand Turk.\nSaunders first played for the Turks and Caicos Islands in the 2005/06 ICC World Cricket League Americas Region Division Three against Brazil.  He later played a single Twenty20 match for the Turks and Caicos Islands against Montserrat in the 2008 Stanford 20/20 at the Stanford Cricket Ground.  He was dismissed for a duck match by McPherson Meade, with the Turks and Caicos Islands making just 67 runs in their twenty overs.  Montserrat went on to win the match by 9 wickets, with Saunders taking the only wicket to fall, that of Dolston Tuit for the cost of 26 runs from two overs.His brother, Carlton, has also played for the Turks and Caicos Islands.", "link_mentions": [{"page": "Saunders", "response": ["* Henry Saunders (disambiguation):", "** Henry Saunders (cricketer, born 1883) (1883–1942), cricketer for Somerset", "** Henry Saunders (cricketer, born 1966), cricketer with Turks and Caicos Islands", "** Henry Saunders (politician) (1855–1919), Australian politician"]}, {"page": "Turks and Caicos Islands national cricket team", "response": ["Cricket is the national sport of the Turks and Caicos Islands. They became an affiliate member of the International Cricket Council (ICC) in 2002 and an associate member in 2017. Their international debut following their membership came in the Americas Affiliates Championship in 2004 when they played the Bahamas. They finished the tournament in fourth place, with their only win coming against Suriname. They played in Division Three of the ICC Americas Championship in 2006, finishing as runners up to Suriname, just missing out on promotion to Division Two. They were invited to take part in the 2008 Standford 20/20, playing one match in a preliminary round against Montserrat. The match, which held official Twenty20 status, resulted in a Montserrat victory by 9 wickets, resulting in their elimination from the tournament. Donovan Matthews top-scored for the team with 25, while no other batsman reached double figures. Henry Saunders took the only wicket to fall in Montserrat's innings. Shortly after, they took part in the 2008 ICC Americas Championship Division Three, which they won to gain promotion to Division Two. In 2010, they took part in the ICC Americas Championship Division Two, finishing fourth but retaining their status in Division Two. This was the team's last appearance to date in international cricket."]}, {"page": "McPherson Meade", "response": ["Meade continued to play club cricket in England for Chingford, who had by 2007 been promoted to the Essex Premier League. In January 2008, Montserrat were invited to part in the 2008 Stanford 20/20, where Meade made two further Twenty20 appearances, in a preliminary round match against the Turks and Caicos Islands and in a first round match against Nevis. Against the Turks and Caicos Islands, he took the wickets of Henry Saunders and Chabbie Charlery, finishing with figures of 2/10 from four overs. He wasn't required to bat in Montserrat's nine wicket victory. Against Nevis, he took the wickets of Runako Morton and Joel Simmonds to finish with figures of 2/22 from four overs. In Montserrat's unsuccessful chase, he was dismissed for 9 runs by Tonito Willett. Later in 2008, he played for Chingford in the Essex Premier League, making seven appearances during the season. He continues to play minor matches for Montserrat and is the current captain of the team."]}, {"page": "Dolston Tuit", "response": ["In 2006, Montserrat were invited to take part in the 2006 Stanford 20/20, whose matches held official Twenty20 status. Tuit made his Twenty20 debut for Montserrat in their first-round match against Guyana, with their first-class opponents winning the match by 8 wickets. Tuit scored a single run with the bat, before he was dismissed by Mahendra Nagamootoo. In January 2008, Montserrat were again invited to part in the 2008 Stanford 20/20, where Tuit made two further Twenty20 appearances, in a preliminary round match against the Turks and Caicos Islands and in a first round match against Nevis. Against the Turks and Caicos Islands, he top-scored opening the batting in Montserrat's nine wicket victory, scoring 30 runs before he was dismissed by Henry Saunders. Against Nevis, he again opened the batting, scoring 16 runs in Montserrat's unsuccessful chase of 185 by Trevier Smithen."]}, {"page": "Henry Saunders", "response": ["Henry Saunders may refer to:", "*Henry Saunders (politician) (1855–1919), Australian politician", "*Henry Saunders (cricketer, born 1966), cricketer who plays for the Turks and Caicos Islands", "*Henry Saunders (cricketer, born 1883) (1883–1942), cricketer for Somerset", "*Henry Saunders House, a historic home located near Windsor, Isle of Wight County, Virginia"]}]}}