{"wiki_id": "http://www.wikidata.org/entity/Q5729143", "itemLabel": "Henry Thomas Howard", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Thomas_Howard", "wikipedia_page": {"main": "Henry Thomas Howard (16 January 1808 – 29 January 1851) was a British soldier and politician.\nThe second son of Thomas Howard, 16th Earl of Suffolk, he was educated at Charterhouse School. On 21 July 1825, he purchased a commission as an ensign in the 58th Regiment of Foot. He later became a lieutenant, and purchased an unattached captaincy on 9 November 1830. He was returned as Member of Parliament for Cricklade in 1841. On 24 June 1845, he married Georgiana Maria, daughter of Sir John Guise, 3rd Baronet, at Rendcomb Park, Gloucestershire. He died in 1851 at Beauchamp, Gloucestershire.", "link_mentions": [{"page": "Earl of Suffolk", "response": ["Several other members of this branch of the Howard family have also gained distinction. The Hon. Edward Howard, younger son of the first Earl of Suffolk, was created Baron Howard of Escrick in 1628. The Hon. Henry Thomas Howard, second son of the 16th Earl, sat as Member of Parliament for Cricklade. The Hon. James Howard, fourth son of the 16th Earl, sat as Member of Parliament for Malmesbury. His grandson was the explorer and politician Charles Howard-Bury. The Hon. Greville Howard, younger son of the 19th Earl, sat as Member of Parliament for St Ives.  The life peer, Greville Howard, Baron Howard of Rising, is the great-grandson of the Hon. Greville Howard, second son of the 17th Earl."]}, {"page": "Henry Howard", "response": ["*Henry Thomas Howard (1808–1851), British soldier and politician"]}, {"page": "List of Old Carthusians", "response": ["*Henry Thomas Howard (1808–1851), MP for Cricklade (1841–1847)"]}, {"page": "Thomas Howard, 16th Earl of Suffolk", "response": ["*Captain Hon. Henry Thomas Howard (16 November 1808 – 29 January 1851)"]}, {"page": "Charles Howard, 17th Earl of Suffolk", "response": ["Suffolk was the son of Thomas Howard, 16th Earl of Suffolk, and the Hon. Elizabeth Jane, daughter of James Dutton, 1st Baron Sherborne. He was the brother of Henry Thomas Howard and James Howard.thepeerage.com Charles John Howard, 17th Earl of Suffolk", "Lord Suffolk married his kinswoman Isabella Catherine, daughter of Lord Henry Thomas Howard-Molyneux-Howard (brother of Bernard Howard, 12th Duke of Norfolk), in 1829. They had seven children:"]}]}}