{"wiki_id": "http://www.wikidata.org/entity/Q5727419", "itemLabel": "Henry Raynor", "itemDescription": "British musicologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Raynor", "wikipedia_page": {"main": "Henry Broughton Raynor (29 January 1917 – 23 July 1989) was a musicologist and a British author.\n\n", "link_mentions": [{"page": "Passport to Pimlico", "response": ["The acting was also praised by many of the critics; Lejeune thought that \"the acting of the countless small character parts that the plot brings together is splendid\", while the reviewer for The Monthly Film Bulletin considered that \"each character, and indeed every individual member of the lengthy cast, provides a gem of comedy acting at its highest and best\". The Manchester Guardian reviewer was critical about aspects of the direction which, it was said, was undertaken \"with barely sufficient skill to sustain the fun\". The critic Henry Raynor, writing for Sight and Sound, thought that the film \"sacrificed a comic enquiry into motives and personality to a farcical romp ... It was carried through, not by wit or polish, but by a sometimes hysterical jollity\"."]}, {"page": "Pentangle (band)", "response": ["Writing in The Times, Henry Raynor struggled to characterise their music: \"It is not a pop group, not a folk group and not a jazz group, but what it attempts is music which is a synthesis of all these and other styles as well as interesting experiments in each of them individually.\"Raynor, Henry (7 January 1969). \"Music from fiveangles\", The Times. Even Pentangle's earliest work is characterised by that synthesis of styles. Songs such as \"Bruton Town\" and \"Let No Man Steal Your Thyme\" from 1968's The Pentangle include elements of folk, jazz, blues, and early music. Pete Townshend described their sound as \"fresh and innovative.\"Quoted in Haper p.219 By the release of their fourth album, Cruel Sister, in 1970, Pentangle had moved closer to traditional folk music and begun using electric guitars. By this time, folk music had itself moved towards rock and the use of electrified instruments, so Cruel Sister invited comparison with such works as Fairport Convention's Liege and Lief and Steeleye Span's Hark! The Village Wait. Pentangle is thus often described as one of the progenitors of British folk rock."]}, {"page": "Whisky Galore! (1949 film)", "response": ["Critics warmly praised Whisky Galore! on its release. C. A. Lejeune, writing in The Observer, considered it \"a film with the French genius in the British manner\"; the reviewer for The Manchester Guardian thought the film was \"put together with ... tact and subtlety\", and Henry Raynor, in Sight & Sound magazine, called it \"one of the best post-war British films\". Several critics identified the script as excellent and The Manchester Guardians reviewer thought that the main credit for the film should be given to Mackenzie and MacPhail for the story. Lejeune thought that the story was treated \"with the sort of fancy that is half childlike and half agelessly wise: it accepts facts for what they are and only tilts their representation, ever so slightly, towards the fantastic and the humorous\"."]}, {"page": "Dénes Kovács", "response": ["In 1951 Kovács joined the Budapest Opera as their first violin and leader, a position he held until 1960. He took third prize in the violin competition of the 3rd World Festival of Youth and Students in East Berlin in 1951, and in 1955, he won the Carl Flesch International Violin Competition in London, with performances of the Brahms Violin Concerto and Bach's Partita in D minor. From 1963 he was a soloist with the National Philharmonic. He performed within Hungary, across Europe, in China and the United States. Shortly after winning the Carl Flesch competition he participated in a Bartók memorial concert in London, in which he was described by Henry Raynor as playing with \"aplomb\". His regular duo partner was the pianist Mihály Bächer. His violin was a Guarneri del Gesù dating from 1742."]}]}}