{"wiki_id": "http://www.wikidata.org/entity/Q5723767", "itemLabel": "Henry Jackson", "itemDescription": "English classical scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Jackson_(classicist)", "wikipedia_page": {"main": "Henry Jackson  (12 March 1839 – 25 September 1921) was an English classicist. He served as the vice-master of Trinity College, Cambridge from 1914 to 1919, praelector in ancient philosophy from 1875 to 1906 and Regius Professor of Greek (Cambridge) at the University of Cambridge from 1906 to 1921. He was elected a Fellow of the British Academy in 1903. He was awarded the Order of Merit on 26 June 1908. From 1882 to 1892 he sat on the Council of the Senate of the University of Cambridge, and was an active member of a number of the university boards. He lived within the walls of Trinity College for over 50 years. Born in Sheffield, he lived mainly in Cambridge, but died in Bournemouth.", "link_mentions": [{"page": "Henry Jackson", "response": ["Henry Jackson may refer to:", "* Henry Jackson (Continental Army general) (1747–1809), American colonial leader", "* Henry Jackson (Royal Navy officer) (1855–1929), British First Sea Lord", "* Henry Jackson (British Army officer) (1879–1972), British Army General", "* Henry Jackson (Minnesota pioneer) (1811–1857), American pioneer and legislator", "* Henry Jackson (New Zealand politician) (1830–1906), New Zealand politician", "* Sir Henry Jackson, 2nd Baronet (1831–1881), British MP for Coventry", "* Henry Jackson (colonial administrator) (1849–1908), British colonial administrator", "* Sir Henry Jackson, 1st Baronet (1875–1937), British Conservative MP for Wandsworth Central", "** Henry Jackson Society, British conservative think tank", "* Henry Jackson (football manager) (c. 1850–1930), English football secretary-manager and director", "* Henry Jackson (baseball) (1861–1932), Major League Baseball player", "* Henry Jackson (Australian footballer) (1877–1964), Australian rules footballer", "* Henry Jackson (athlete), Jamaican Olympic long jumper", "* Henry Jackson (priest) (1586–1662), English priest and literary editor", "* Henry Jackson (classicist) (1839–1921), English classicist", "* Henry Jackson (businessman) (born 1964)", "* Henry Jackson (1956–2014), rapper Big Bank Hank"]}, {"page": "Richard Claverhouse Jebb", "response": ["He was educated at St Columba's College, Dublin 1853–55 then Charterhouse School 1855–1858. He then studied Classics at Trinity College, Cambridge. He was a Member of the Cambridge Apostles, the intellectual secret society, from 1859. He won the Porson and Craven scholarships, was senior classic in 1862, and became fellow and tutor of his college in 1863. From 1869 to 1875, he was public orator of Cambridge University; Professor of Greek at Glasgow from 1875 to 1889, and Regius Professor of Greek at Cambridge from 1889 until his death. His successor was Henry Jackson. He was elected a Fellow of the British Academy in 1902."]}, {"page": "Charles Kay Ogden", "response": ["In 1912 Ogden founded the weekly Cambridge Magazine, which he edited until it ceased publication in 1922. The initial period was troubled. Ogden was studying for Part II of the Classical Tripos when offered the chance to start the magazine by Charles Granville, who ran a small but significant London publishing house, Stephen Swift & Co. Thinking that the editorship would mean giving up first class honours, Ogden consulted Henry Jackson, who advised him not to miss the opportunity. Shortly after, Stephen Swift & Co. went bankrupt.Philip Sargant Florence, C. K. Ogden: A Collective Memoir, p. 16. Ogden continued to edit the magazine during World War I, when its nature changed, because rheumatic fever as a teenager had left him unfit for military service.C. K. Ogden: A Collective Memoir, p. 35."]}, {"page": "List of members of the Order of Merit", "response": ["| 26. ||  || 75px || Henry Jackson || 26 June 1908 || 12 March 1839 – 25 September 1921 || Classicist"]}, {"page": "Ascension Parish Burial Ground", "response": ["* Henry Jackson, Regius Professor of Greek (Cambridge), Classicist, Member of the Cambridge Apostles."]}, {"page": "Cambridge University Liberal Association", "response": ["*Henry Jackson, CULC founder member and President 1897-9, classicist"]}, {"page": "William Woodthorpe Tarn", "response": ["William Woodthorpe Tarn was born in London on the 26 of February 1869, eldest of two sons and one daughter of William Tarn (b. 1841/2), a silk merchant, and Frances Arthy (b. 1843/4). He studied at Eton College, where he was school captain and a king's scholar, graduating in 1888. He studied at Trinity College, Cambridge with Henry Jackson, sparking a lifelong interest in Greek philosophy. He then studied law at the Inner Temple, becoming a chancery barrister in 1894. In 1896 he married Flora Macdonald (d. 1937). He had one daughter, Otta, for whom he wrote a fairy story, The Treasure of the Isle of Mist (1919)."]}, {"page": "List of alumni of Trinity College, Cambridge", "response": ["* Henry Jackson (1839–1921), classicist and reformer, Vice Master, 1914"]}, {"page": "Sheffield Collegiate School", "response": ["* Henry Jackson (1839–1921) – Regius Professor of Greek at the University of Cambridge "]}, {"page": "List of Old Edwardians (Sheffield)", "response": ["* Henry Jackson OM (1839–1921), classicist, Regius Professor of Greek at Cambridge"]}, {"page": "Henry jackson (classicist)", "response": ["#REDIRECT Henry Jackson (classicist) "]}, {"page": "Walter Headlam", "response": ["Headlam gained his MA in 1891, and was awarded the degree of DLitt in 1903. In 1906 he applied for the post of Regius Chair of Greek, one of the oldest Professorships at the University of Cambridge, the chair having been founded by Henry VIII in 1540. Shy by nature, to his discomfort his application required that he should deliver a public lecture, which he gave on the second chorus of Aeschylus' Agamemnon.  Although Headlam did not gain the post he admired the successful candidate, the Classicist Henry Jackson. Headlam's lecture was greatly admired and his name became known in Classical circles.HEADLAM, Walter George\" (1907). Who's Who, 59: p. 811"]}, {"page": "1908 Birthday Honours", "response": ["*Henry Jackson, Esq., D.Litt., Regius Professor of Greek, Cambridge."]}]}}