{"wiki_id": "http://www.wikidata.org/entity/Q5726704", "itemLabel": "Henry Parker, 10th Baron Morley", "itemDescription": "English writer and translator", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Parker,_10th_Baron_Morley", "wikipedia_page": {"main": "Henry Parker, 10th Baron Morley (1476/1480/1481 – 3 December 1553/1556), (notes to Parliamentary records show this as 25 November 1556) was an English peer and translator, Lord of Morley, Hingham, Hockering, &c., in Norfolk. He was the son of Alice Parker, 9th Baroness Morley, née Lovel (c. 1467–1518) and her husband Sir William Parker, who was Privy councillor and standard bearer to King Richard III.He married Alice St John, daughter of Sir John St John (1426–1488) and  his wife Alice Bradshaigh, and  a descendant of Sir Oliver St John and  his wife Margaret Beauchamp of Bletsoe, by whom he had one son, Sir Henry Parker, who was knighted at the coronation of Anne Boleyn and died in his father's lifetime. The son of Sir Henry Parker, Henry, succeeded his grandfather as Baron Morley.  Henry Parker, 10th Baron Morley, had three daughters: Margaret, who married John Shelton, Jane, who married George Boleyn, Viscount Rochford, the brother of Henry VIII's second wife, Anne Boleyn, and Alice, who married Sir Thomas Barrington.In 1523, he was sent as an ambassador to Germany to present the Order of the Garter to the Archduke Ferdinand (later Ferdinand I, Holy Roman Emperor). He was a man of literary attainments and translated some of the writings of Plutarch, Seneca, Cicero and others into English.", "link_mentions": [{"page": "Jane Boleyn, Viscountess Rochford", "response": ["Born Jane Parker, she was the daughter of Henry Parker, 10th Baron Morley, and Alice St. John, great-granddaughter of Margaret Beauchamp of Bletso. Through Margaret, Jane was a distant relative of King Henry VIII — specifically his half-second-cousin-once-removed; this, in turn, made her a third cousin of all of the King's children, including her niece-by-marriage, Elizabeth I. She was born in Norfolk around the year 1505; her family were wealthy, well-connected, politically active and respected members of the English upper class. Her father was an intellectual, with a great interest in culture and education. She was sent to Court in her early teens, certainly before her fifteenth birthday, where she joined the household of King Henry VIII's first wife, Catherine of Aragon. She is recorded as having accompanied the royal party on the state visit to France in 1520, \"The Field of the Cloth of Gold\"."]}, {"page": "Baron Morley", "response": ["*Henry Parker, 10th Baron Morley (c. 1486 – 1556)"]}, {"page": "Henry Parker", "response": ["* Henry Parker, 10th Baron Morley (c. 1480–c. 1553/6), English peer and translator"]}, {"page": "Anne Shelton (courtier)", "response": ["* John Shelton (1500-November 1558), 22nd Lord of Shelton, married Margaret Parker, daughter of Henry Parker, 10th Baron Morley and elder sister to Jane Boleyn, Viscountess Rochford.R. Virgoe, 'Shelton, Sir John (by 1503-58), of Shelton, Norf.', in S.T. Bindoff (ed.), The History of Parliament: the House of Commons 1509-1558 (from Boydell and Brewer 1982), History of Parliament online."]}, {"page": "Sir John Shelton", "response": ["Shelton had three sons and seven daughters: Margaret, John, Mary, Ralph, Thomas, Anne, Gabriella, Elizabeth, Amy, and Emma.G.E.Cokayne, The Complete Peerage His son and heir, Sir John Shelton (b. in or before 1503, d. 1558), married Margaret, the daughter of Henry Parker, 10th Baron Morley. His daughter Anne married Edmund Knyvet. Another daughter, Margaret, married Thomas Wodehouse. His daughter, Mary, married firstly, Sir Anthony Heaveningham, and secondly, Philip Appleyard. One of his daughters, thought to be either Margaret or Mary, were said to have been a mistress of King Henry VIII.."]}, {"page": "John Shelton (courtier)", "response": ["He married Margaret Parker, daughter of Henry Parker, 10th Baron Morley. Their children were:"]}, {"page": "Richard Pole (courtier)", "response": ["A descendant of an ancient Welsh family, Sir Richard was a landed gentleman of Buckinghamshire, the son of Geoffrey Pole, EsquireComplete Peerage vol XIV, p. 567, note (a), line 1, his will on The national Archives where he is Esquire, his IPM where too he is described as Esquire of Worrell, Cheshire, and of Wythurn in Medmenham, Buckinghamshire (1431 – 1474 / 4 January 1479, interred in Bisham Abbey).Alison Weir, Britain's Royal Family: A Complete Genealogy (London, U.K.: The Bodley Head, 1999), p. 103. His mother was Edith St John, daughter of Sir Oliver St John of Bletso, Bedfordshire (d. 1437) and the half-sister of Lady Margaret Beaufort, mother of Henry VII. They shared the same mother, Margaret Beauchamp of Bletso, who had married three times; this made Richard a first cousin of the half blood to Henry VII.Complete Peerage, Vol XIV, p. 567, note (a), line 5 Sir Richard was thus first cousin of Alice St John, wife of Henry Parker, 10th Baron Morley and mother of Jane Parker, wife of George Boleyn, Viscount Rochford."]}, {"page": "Edward Lee (bishop)", "response": ["In 1523 the king sent Lee with Henry Parker, 10th Baron Morley, and Sir William Hussey on an embassy to the Archduke Ferdinand of Austria to carry him the Garter, with the diplomatic aims of encouraging his opposition to the Lutherans and Francis I of France. Lee was the orator of the embassy. He was the king's almoner, and in the same year received the archdeaconry of Colchester. In 1525 he was sent with Sir Francis Poyntz to Spain on an embassy to the emperor. During 1529 he was engaged in an embassy to the Emperor Charles V in Spain, and in January 1530 was sent with the Earl of Wiltshire and John Stokesley to Pope Clement VII and the emperor at Bologna, to endeavour to persuade them out of their opposition to the king's divorce from Queen Catherine of Aragon."]}, {"page": "Henry Parker, 11th Baron Morley", "response": ["Henry Parker, 11th Baron Morley (January 1533 – 22 October 1577) was an English peer, Lord of Morley, Hingham, Hockering, &c., in Norfolk, the son of Sir Henry Parker and Grace Newport. His father was the son of Henry Parker, 10th Baron Morley and Alice St. John.Burke's Dormant & Extinct Peerages, p 417 His father was knighted at the coronation of Anne Boleyn and died within his father's lifetime,  therefore the title passed directly to him upon the death of his grandfather in 1556."]}, {"page": "Henry Glemham (politician)", "response": ["Glemham was the eldest son of Thomas Glemham of Glemham Hall, Suffolk and his wife Amy Parker, daughter of Henry Parker, 10th Baron Morley. He was a minor when he inherited the estate of Glemham on the death of his father in 1571.  He entered Inner Temple in 1585. He was knighted in 1591. In 1593, he was elected Member of Parliament for Lewes. He was re-elected MP for Lewes in 1597. History of Parliament Online - Henry Glemham"]}, {"page": "Henry Parker (MP for Hertfordshire)", "response": ["He was the son of Henry Parker, 10th Baron Morley. He shared a common ancestress in Margaret Beauchamp of Bletsoe with Henry VIII.  Parker was the brother of Jane Boleyn née Parker, and thus the brother-in-law of George Boleyn, during the reign of Queen Anne Boleyn. He was knighted KB on 31 May 1533."]}, {"page": "List of peers 1510–1519", "response": ["|Henry Parker, 10th Baron Morley||1518||1556||"]}, {"page": "List of peers 1520–1529", "response": ["|Baron Morley (1299)||Henry Parker, 10th Baron Morley||1518||1556||"]}, {"page": "List of peers 1530–1539", "response": ["|Baron Morley (1299)||Henry Parker, 10th Baron Morley||1518||1556||"]}, {"page": "List of peers 1540–1549", "response": ["|Baron Morley (1299)||Henry Parker, 10th Baron Morley||1518||1556||"]}, {"page": "List of peers 1550–1559", "response": ["|rowspan=\"2\"|Baron Morley (1299)||Henry Parker, 10th Baron Morley||1518||1556||Died"]}]}}