{"wiki_id": "http://www.wikidata.org/entity/Q5728226", "itemLabel": "Henry Seymour", "itemDescription": "British Royal Navy officer (1818-1869)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Seymour_(Royal_Navy_officer)", "wikipedia_page": {"main": "Vice-Admiral (George) Henry Seymour,  (20 March 1818 – 25 July 1869) was a Royal Navy officer who went on to be Third Naval Lord.", "link_mentions": [{"page": "Controller of the Navy (Royal Navy)", "response": ["* Rear Admiral Henry Seymour 1866–1868"]}, {"page": "Derick Heathcoat-Amory, 1st Viscount Amory", "response": ["Born in London, the son of Sir Ian Heathcoat-Amory, 2nd Baronet (see Heathcoat-Amory baronets) and Alexandra Georgina (OBE; who d. 1942), eldest daughter of Vice-Admiral Henry Seymour CB (brother of  Francis, 5th Marquess of Hertford GCB)."]}, {"page": "List of Lords Commissioners of the Admiralty", "response": ["**George Henry Seymour, Third Naval Lord", "**George Henry Seymour, Third Naval Lord", "**George Henry Seymour, Third Naval Lord"]}, {"page": "Francis Seymour, 5th Marquess of Hertford", "response": ["Seymour was the eldest son of Admiral Sir George Seymour by his wife Georgiana Mary Berkeley, daughter of Sir George Berkeley; he was the elder brother of Henry Seymour and Lady Laura Seymour. He was the grandson of Lord Hugh Seymour and a great-grandson of Francis Seymour-Conway, 1st Marquess of Hertford, and it is through this line he succeeded to the Hertford marquessate when his distant cousin, Richard Seymour-Conway, 4th Marquess of Hertford, died unmarried and without issue in 1870. He inherited the entailed property from the 4th Marquess, including Ragley Hall, whilst the unentailed property went to his cousin's illegitimate son Richard Wallace, including what became the Wallace Collection."]}, {"page": "Antrim (UK Parliament constituency)", "response": ["|Henry Seymour"]}, {"page": "Henry Seymour", "response": ["Henry Seymour may refer to:", "*Henry Seymour (New Zealand politician) (1796–1883), member of the New Zealand Legislative Council", "*Henry Seymour (16th-century MP) (1503–1578), Member of Parliament (MP) for Hampshire in 1547, brother of Queen Jane Seymour and uncle of Edward VI of England", "*Henry Seymour (Langley) (1612–1687), friend of Charles II and MP for East Looe", "*Henry Seymour (died 1728), English MP", "*Henry Seymour (Redland) (1729–1807), MP for Totnes, Huntingdon, Evesham, lover of Madame du Barry", "*Henry Seymour (Knoyle) (1776–1849), MP for Taunton", "*Henry Seymour, 9th Marquess of Hertford (born 1958), British peer", "*Henry Seymour, Lord Beauchamp (1626–1654), English nobleman", "*Lord Henry Seymour (naval commander), English admiral who fought the Spanish Armada", "*Lord Henry Seymour (politician) (1746–1830), MP for Coventry, Midhurst, Downton", "*Sir Henry Seymour, 1st Baronet (1674–1714), MP for East Looe", "*Henry Seymour (Royal Navy officer) (1818–1869), naval commander and politician", "*Henry Seymour (secularist) (1861–1938), secularist, anarchist and gramophone innovator", "*Henry Seymour (Commissioner) (1780–1837), New York politician", "*Henry Seymour (pastoralist) (1799–1869), Irish lawyer migrated to South Australia 1840"]}, {"page": "George Seymour (Royal Navy officer)", "response": ["In March 1811 Seymour married Georgiana Mary Berkeley (a daughter of Sir George Berkeley) and they had three sons (Francis Seymour, 5th Marquess of Hertford, Vice-Admiral Henry Seymour and General Lord William Seymour) and four daughters (including Laura Williamina Seymour)."]}, {"page": "HMS Cumberland (1842)", "response": ["Cumberland  recommissioned as a flagship under Captain George Henry Seymour as the flagship of his father, Vice-Admiral Sir George Francis Seymour. She served on the North America and West Indies Station.Maritime Museum, Greenwich, London  In March 1854 she sailed to the Baltic Sea as the Crimean War with Russia was imminent. Cumberland was involved in the Battle of Bomarsund, an Anglo-French attack on Bomarsund in the Grand Duchy of Finland in August 1854.http://www.royalnavy.mod.uk/operations-and-support/surface-fleet/type-22-frigates/hms-cumberland/history/ On 15 March 1858, Cumberland ran aground on an uncharted rock in the River Plate off the Isla de Flores, Uruguay. Her captain and master were both acquitted at the subsequent court martial held on board  at HMNB Devonport on 11 August."]}, {"page": "George Seymour", "response": ["*Henry Seymour (Royal Navy officer) (George Henry Seymour, 1818–1869), MP for Antrim"]}, {"page": "List of MPs elected in the 1868 United Kingdom general election", "response": ["| Henry Seymour"]}, {"page": "HMS Carysfort (1836)", "response": ["Captain George Henry Seymour took command of Carysfort on 12 December 1845. He remained her captain until 1848."]}, {"page": "Royal Navy Burying Ground (Halifax, Nova Scotia)", "response": ["There is also a monument to six crew who died on the flagship  from 1851 to 1852. The commander was Captain George Henry Seymour, and his father was the Vice Admiral Sir George Francis Seymour. "]}, {"page": "George Henry Seymour", "response": ["#REDIRECT Henry Seymour (Royal Navy officer)"]}]}}