{"wiki_id": "http://www.wikidata.org/entity/Q5722570", "itemLabel": "Henry Harben", "itemDescription": "English army officer and cricketer (1900-1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Eric_Southey_Harben", "wikipedia_page": {"main": "Major Henry Eric Southey Harben (1 August 1900 – 1 October 1971) was an English cricketer.  Harben was a right-handed batsman, though his bowling style is unknown.", "link_mentions": [{"page": "Harben", "response": ["* Henry Harben (insurer) (1823–1911), British insurance company manager", "* Henry Devenish Harben (1874–1967), English barrister and politician; father of cricketer Henry Harben"]}, {"page": "Henry Devenish Harben", "response": ["thumb|Henry Harben", "He was the son of Henry Andrade Harben and the grandson of Sir Henry Harben who founded Prudential Assurance, Harben was educated at Eton College and Magdalen College, Oxford, before qualifying as a barrister. He married Agnes Helen Bostock. He stood unsuccessfully for the Conservative Party in Eye at the 1900 general election, but by 1902 had switched his affiliation to the Liberal Party.Elizabeth Crawford, The Women's Suffrage Movement: A Reference Guide 1866–1928, pp.269–271  He stood for the Liberal Party in Worcester at the 1906 general election.  Although he lost the election, he petitioned the election court on the grounds that supporters of the winner, George Henry Williamson, had engaged in widespread bribery.  He won the case, but the seat was left vacant until a by-election in 1908, and the local Liberal Party adopted a new candidate.\"British by-election\", The Argus, 10 February 1908, p.7  Harben next stood in Portsmouth at the December 1910 general election, but came bottom of the poll.Duncan Tanner, Political Change and the Labour Party 1900–1918, p.191", "Harben's son, also Henry Harben, became a first-class cricketer."]}, {"page": "Henry Harben", "response": ["Henry Harben may refer to:", "* Sir Henry Harben (insurer) (1823–1911), British pioneer of industrial life assurance"]}]}}