{"wiki_id": "http://www.wikidata.org/entity/Q5720034", "itemLabel": "Henry Cunison Rankin", "itemDescription": "Scottish accountant (1932-2010)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Rankin_(politician)", "wikipedia_page": {"main": "Henry Cunison Deans Rankin (1932–2010) was a Scottish chartered accountant who served as treasurer to the Scottish National Party and as National Chairman of the Saltire Society.\nRankin was born at Hamilton, Scotland, on 14 October 1932 and was educated at the former Hamilton Academy and the University of Glasgow, graduating MA and LLB in 1958.Joining the tax department of the Glasgow firm of Arthur Young McLelland Moores and Company in 1967, Rankin subsequently moved in 1970 to the Edinburgh firm of chartered accountants, Graham Smart and Annan, becoming tax manager. In 1973 Rankin was appointed a lecturer on taxation at the Institute of Chartered Accountants of Scotland and in 1982 appointed the Institute's director of student education. Rankin also wrote a classic textbook Corporation Tax for Students used by accountancy students across the U.K.Rankin stood unsuccessfully on the Scottish National Party (SNP) ticket as a parliamentary candidate for the Lanark constituency in 1966 and 1970, taking 10% and then 12% of the vote, then for the North Angus and Mearns constituency in February 1974, where he managed 23%, but was still not elected. He served as SNP national treasurer from 1965–66, and as a member of its National Executive Committee from 1966–68.He remained a member of the SNP, and was included in a list of potential candidates for the 1999 Scottish Parliament election, although he did not ultimately stand.In June 2007, Rankin was appointed National Chairman of the Saltire Society. For eleven years from its inception, Rankin also served as treasurer and secretary of the Cantilena Music Festival, held twice a year on the Isle of Islay, Scotland.Rankin died at Dunfermline on 4 January 2010.", "link_mentions": []}}