{"wiki_id": "http://www.wikidata.org/entity/Q5728118", "itemLabel": "Henry Sclater", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Sclater", "wikipedia_page": {"main": "General Sir Henry Crichton Sclater,  (5 November 1855 – 26 September 1923) was a British Army General during World War I.", "link_mentions": [{"page": "Edith Sclater", "response": ["She married General Sir Henry Crichton Sclater, son of James Henry Sclater, on 12 June 1884. The union was childless."]}, {"page": "1919 Southampton mutiny", "response": ["The former Royal Flying Corps and Royal Air Force General Sir Hugh Trenchard arrived in Southampton in mid-January after Sir William Robertson, the Commander-in-Chief of Home Forces asked him to take charge. Trenchard had witnessed mutinies among French troops during World War I, and was quite prepared to be ruthless in his dealings.Lamb, Dave 1919: The Southampton mutiny 2005  After speaking to the ineffective camp commandant and sizing up the situation, Trenchard marched out onto the docks and personally issued a loud summons for the men to assemble. He then informed the soldiers that he would hear their grievances but only after they had returned to their duties. This resulted in much heckling and Trenchard almost knocked over by the restless surging crowd. Leaving the scene in some disorder, he decided force would be needed, and arranged for 250 soldiers, including military policemen, to be sent to the docks.  Whilst they were en route, Sir Henry Sclater, the General Officer Commanding Southern Command, telephoned Trenchard in the middle of the night, and after hearing Trenchard's plan, insisted that Trenchard must under no circumstances order the security detachment to open fire on the mutineers. Trenchard replied that he was not seeking the G.O.C.'s approval, merely informing him of his intentions."]}, {"page": "List of Knights Grand Cross of the Order of the British Empire", "response": ["**Lieutenant-General Sir Henry Sclater (1 January)"]}, {"page": "James Macklin", "response": ["On 16 September 1918 Macklin \"was presented to His Majesty [King George V] by Lieut.-General Sir Henry Sclater. The King said to him, 'I understand, Mr. Mayor, that you have been Mayor of the city for five years. I am very grateful to you for the unselfish way in which you have devoted yourself to the services of the city and to myself.' The Mayor, acknowledging this gracious remark, said, with becoming modesty: 'I have to thank my colleagues for any success I have had Your Majesty,' and the King rejoined: 'Will you also express my thanks to your colleagues.' His Majesty, continuing, said he understood that his troops on [Salisbury] Plain had been well treated in the way of entertainments and hospitality at Salisbury. The Mayor assured His Majesty that the citizens had been pleased to do everything they could for the troops, and the King graciously added: 'I wish you to thank the citizens for all they have done for the soldiers.' His Majesty then expressed good wishes for the Mayor's health and said he wished the Mayor to convey his message to the citizens.\"Western Gazette (Friday, 20 September 1918), p. 6."]}, {"page": "Southern Command (United Kingdom)", "response": ["*1916 - 1919 Lieutenant General Sir Henry Sclater"]}, {"page": "Henry Crichton Sclater", "response": ["#REDIRECT Henry Sclater"]}, {"page": "1913 Birthday Honours", "response": ["*Lieutenant-General Henry Sclater, CB"]}, {"page": "Lewes War Memorial", "response": ["The memorial was unveiled in 1922 by General Sir Henry Sclater, a local landowner who was also General Officer Commanding-in-Chief Southern Command in 1916 to 1919.  It was dedicated by the Bishop of Lewes, Henry Southwell."]}, {"page": "Adjutant-General to the Forces", "response": ["*1914 to 1916 Lieutenant-General Sir Henry Sclater"]}]}}