{"wiki_id": "http://www.wikidata.org/entity/Q5721856", "itemLabel": "Henry Geehl", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Geehl", "wikipedia_page": {"main": "Henry Ernest Geehl [pronounced 'Gale'] (28 September 1881 – 14 January 1961) was an English pianist, conductor, composer and arranger.\nBorn in London in 1881, Geehl studied piano with Benno Schönberger and R. O. Morgan in London, and with Anton Schlieber in Vienna. He toured as a pianist and theatre conductor, and in 1919 joined the Trinity College of Music as a teacher, where he remained on staff as a teacher until a year before his death. His students included William Lovelock and Nicholas Temperley.  He also became music editor for the Edwin Ashdown and Enoch publishing firm. In later life he lived at Coleshill, near Beaconsfield, Bucks, where he gave private lessons in piano, violin, and composition.\nHenry Geehl had an affinity with music written for brass bands.  He arranged Gustav Holst's A Moorside Suite for brass band, made many other arrangements and transcriptions, and was the first composer to write serious symphonic music directly for brass band.  His Scena Sinfonica, in the style of an operatic selection, has been used as a test piece for brass bands. He made claims to have scored Edward Elgar's The Severn Suite for brass band from the composer's rough sketches, but Geehl's account of his involvement with Elgar has now been exposed as a self-serving fantasy.His other works include a symphony, concertos for piano and violin, Suite espagnole, Comedy Overture, In Fairyland, On the Cornish Coast, Rhapsody for band, Prince Charlie – 1745, piano pieces and songs.\nHis song \"For You Alone\" (\"Für dich allein\"; words by P. J. O'Reilly) achieved great popularity, being recorded by Enrico Caruso, Lauritz Melchior, Jussi Björling and Mario Lanza, among others.  Eleanor Steber's rendition of \"For You Alone\" can be seen on this YouTube video.  (It has been claimed that \"For You Alone\" was the only song ever sung in English by Caruso but that is contradicted by other evidence, such as his recording of George M. Cohan's \"Over There\").\nHenry Geehl also wrote some film scores, including the original music for The Magic Bow (1946) and for Jassy (1947).An arrangement by Geehl of Johann Strauss II's The Blue Danube was recorded by Richard Tauber and Florence Foster Jenkins. He also arranged Edward Elgar's Idylle, Op. 4, Adieu and Serenade for orchestra; Charles Williams's The Dream of Olwen for three voices; George H. Clutsam's Ma Curly Headed Babby; My Heart and I and other songs from Richard Tauber's Old Chelsea; May Brahe's To a Miniature and I Passed by your Window; Richard Addinsell's Warsaw Concerto, selections from Delibes' Sylvia, and César Franck's Symphonic Variations.He conducted Oscar Natzka's recording of \"O Isis and Osiris\" from Mozart's The Magic Flute, and Handel's \"The song of Hybrias the Cretan\" and \"Honour and Arms\" (from Samson). Between 1939 and 1946 he conducted the orchestra for more than 90 recordings by Richard Tauber, made at the Abbey Road Studios in London. [Ref: Hansfried Sieben, Richard Tauber Discography, Wiesbaden, 1986]\nHenry Geehl was reputed to be a \"prickly individual\". Nicholas Temperley, who was taught by him from age 8 to 13, found him a genial teacher who told many interesting stories about musicians he had known, but was inclined to brag about his achievements and relations with famous musicians of the day.  He died in 1961, in Beaconsfield, Buckinghamshire.", "link_mentions": [{"page": "Enrico Caruso", "response": ["Caruso also had a repertory of more than 500 songs. They ranged from classical compositions to traditional Italian melodies and popular tunes of the day, including a few English-language titles such as George M. Cohan's \"Over There\", Henry Geehl's \"For You Alone\" and Arthur Sullivan's \"The Lost Chord\"."]}, {"page": "1961 in music", "response": ["*January 14 – Henry Geehl, pianist, 79"]}, {"page": "Ann Stephens", "response": ["* \"Dicky Bird Hop\" (written by Ron Gourley, conducted by Henry Geehl)", "* \"The Teddy Bears' Picnic\" (music by John Walter Bratton, lyrics by Jimmy Kennedy, conducted by Henry Geehl"]}, {"page": "William Lovelock", "response": ["Though William Lovelock was born in London, his family were originally of Berkshire extraction and two of his great-uncles had emigrated to Australia in the 19th century, long before he did.Lovelock, Yann: Lovelocks in Counterpoint, Lovelock Lines 5, p.14 He was educated at Emanuel School, Wandsworth, and started piano lessons at the age of six and organ lessons at twelve. At the age of sixteen, he won an organ scholarship to the Trinity College of Music, where he studied with C. W. Pearce and Henry Geehl. After service as an artilleryman in World War I, he returned to Trinity College and graduated with a Bachelor of Music degree in 1922. He then joined the teaching staff and later obtained a doctorate in composition in 1932. As an organist, he served at St. Clements in Eastcheap from 1919 to 1923, then as Kapellmeister to Countess Cowdray from 1923 to 1926. He was also organist at the Church of the Good Shepherd in Carshalton from 1928 to 1930."]}, {"page": "Trinity Laban Conservatoire of Music and Dance", "response": ["* Henry Geehlconductor, composer, pianist "]}, {"page": "Idylle", "response": ["Idylle was arranged for orchestra by Henry Geehl."]}, {"page": "The Severn Suite", "response": ["The work was commissioned by Herbert Whiteley of the National Brass Band Championship committee and head of the brass band publishers R. Smith & Company. Although it is likely that Elgar originally expected only to supply a \"short score\"A score containing all the music but written on two staves only : used as a reference source by an orchestrator. to be orchestrated by a brass band expert, in fact Elgar ultimately performed all the orchestration himself. Henry Geehl, a brass band composer and employee of R.Smith, later claimed to have orchestrated the piece, giving a highly circumstantial account of his involvement to several newspapers. However, in 1995 the original manuscript, entirely in Elgar's hand,Kay (2013) p.15 : the MS contains a few minor suggestions by Geehl for improvements in texture and scoring resurfaced at auction — its emergence demonstrates that Geehl's longstanding claim to have orchestrated the work was in fact fraudulent.See Kay (2013) pp. 15-18 for a detailed refutation of Geehl's claims. The manuscript was subsequently acquired by the Elgar Birthplace Museum, where it now resides.", "* Military band, arr. Henry Geehl (1931), pub. Keith Prowse"]}, {"page": "Pete Moore (composer)", "response": ["Pete Moore (20 August 1924 – 1 December 2013) was a British composer and arranger for a string of famous artistes from the 1950s onwards. Born in Essex, England, Moore studied composition and arranging privately for approximately ten years with three teachers. These were Alfred Nieman (who was on the staff at the Guildhall School of Music, London), Henry Geehl and a certain \"Dr. Cook\" who was probably another staff member at one of the London music colleges.As recounted to his own student Nigel Waddington"]}]}}