{"wiki_id": "http://www.wikidata.org/entity/Q5723083", "itemLabel": "Henry Hobhouse", "itemDescription": "British politician (1854–1937)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Hobhouse_(East_Somerset_MP)", "wikipedia_page": {"main": "Henry Hobhouse  (1 March 1854 – 25 June 1937) was an English landowner and Liberal, and from 1886 Liberal Unionist politician who sat in the House of Commons from 1885 to 1906.\nHobhouse was the son of Henry Hobhouse, of Hadspen House, Somerset, and his wife the Hon. Charlotte Etruria Talbot, daughter of James Talbot, 3rd Baron Talbot of Malahide. He was educated at Eton and Balliol College, Oxford, and was called to the Bar at Lincoln's Inn. He practised as a parliamentary draughtsman and was a J.P. for Somerset.In the 1885 general election, Hobhouse was elected MP for East Somerset. He held the seat until 1906. Hobhouse was particularly concerned with education. He was appointed to the Board of Education in 1900 and was behind the establishment of the 1902 Education Act.Hobhouse was involved in the founding of Sexey's School and Sunny Hill (now Bruton School for Girls) at Bruton. He was also pro-chancellor of Bristol University and an honorary LLD of the University,. He worked hard on behalf of the university and left a collection of books to the library.Hobhouse was a county figure and knowledgeable about local matters. A member of Somerset County Council, he was responsible for forming the County Councils Association. He was also behind the establishment of the Cider Institute in 1902 and was its chairman.Hobhouse lived at Hadspen House, Castle Cary, Somerset, and died at the age of 83.\nHe married Margaret Heyworth Potter (daughter of Richard Potter).  Their children included: Stephen Henry Hobhouse, an important British peace activist and prison reformer; Arthur Lawrence Hobhouse built the system of National parks in England and Wales; and Rachel (1883–1981) married Sir George Felix Neville Clay, 5th Baronet, and had a son Sir Henry Felix Clay, 6th Baronet.", "link_mentions": [{"page": "Beatrice Webb", "response": ["Meanwhile, the connections by marriage of their numerous nieces and nephews made Beatrice and Sidney part of the emerging new Labour establishment. Beatrice's nephew Sir Stafford Cripps, son of her sister Theresa, became a well-known Labour politician in the 1930s and 1940s. He served as British ambassador to Moscow during the Second World War and later as Chancellor of the Exchequer under Clement Attlee. (His daughter Peggy went on to marry Nana Joe Appiah, an African statesman and tribal chieftain who served as something of a founding father of the Republic of Ghana.) Margaret, yet another Potter sister, married the Liberal politician Henry Hobhouse, making Beatrice Webb an aunt of peace activist Stephen Henry Hobhouse and of Liberal politician Arthur Hobhouse.Hochschild, Adam, To end all wars : a story of loyalty and rebellion, 1914-1918, Boston: Houghton Mifflin Harcourt, 2011, p. 277, . Another sister, Blanche, married surgeon William Harrison Cripps, brother to Theresa's husband Charles Cripps, 1st Baron Parmoor. The Cripps family was a wealthy political family, originally from Cirencester."]}, {"page": "List of Privy Counsellors (1901–1910)", "response": ["*Henry Hobhouse (1854–1937)"]}, {"page": "Gilbert Murray", "response": ["During World War I he became a pamphleteer, putting a reasoned war case. He also defended C. K. Ogden against criticism,Wilson p.236; this was in March 1917 and took a public interest in conscientious objection.In the case of the Quaker Stephen Hobhouse, Murray wrote an introduction to a pamphlet I appeal unto Caesar: the case of the conscientious objector by his mother Margaret. His father, Henry Hobhouse, was a Liberal MP from 1885 to 1906, and although a 'country squire' (Concise Dictionary of National Biography) was a Privy Councillor; and brother to L. T. Hobhouse, an old friend of Murray's. Murray was incensed at the treatment meted out to Stephen Hobhouse, who had been rejected as not a genuine objector of conscience (The Soul as It is and How to Deal with It, 1918 paper ), and further wrote an introduction to Hobhouse's post-war book on prisons.He intervened directly in the case of Raymond Postgate (Wilson p.237). In a scare about the possible application of martial law to objectors, he contacted Lord Derby, the Secretary of War, and H. H. Asquith the Prime Minister face-to-face (Wilson p. 239). Murray never took a pacifist line himself, broke an old friendship with Bertrand Russell early in the war,Murray was active in helping Russell when the latter was imprisoned; see West p.145 on pacifism, Wilson p.241 on aid to Russell. Murray, close to H. H. Asquith, had no time for David Lloyd George who displaced him as Prime Minister. and supported British intervention in the Suez Crisis."]}, {"page": "Arthur Hobhouse", "response": ["Hobhouse was the son of the prominent Liberal politician and MP Henry Hobhouse and the brother of peace activist, prison reformer, and religious writer Stephen Henry Hobhouse. Arthur Hobhouse was educated at Eton College, St Andrews University and Trinity College, Cambridge, where he graduated in Natural Sciences. At Cambridge, he was a Cambridge Apostle and a member of the Cambridge University Liberal Club, becoming Secretary in 1906 and was also the lover of John Maynard Keynes and Duncan Grant.", "*Henry Hobhouse (1924–2016)"]}, {"page": "Hobhouse", "response": ["*Henry Hobhouse (East Somerset MP) (1854–1937), English landowner and Liberal politician"]}, {"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| Henry Hobhouse"]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["| Henry Hobhouse"]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| Henry Hobhouse"]}, {"page": "Somerset County Council", "response": ["*Henry Hobhouse (from the 1890s), later Chairman of Council, also Member of Parliament for East SomersetChristine Bellamy, Administering central-local relations, 1871-1919, p. 77"]}, {"page": "List of MPs elected in the 1886 United Kingdom general election", "response": ["| Henry Hobhouse"]}, {"page": "List of MPs elected in the 1900 United Kingdom general election", "response": ["| Henry Hobhouse"]}, {"page": "East Somerset (UK Parliament constituency)", "response": ["| rowspan=\"2\"| Henry Hobhouse"]}, {"page": "Sir Henry Clay, 6th Baronet", "response": ["Clay was the son of Sir George Felix Neville Clay, 5th Baronet (1871–1941), by his marriage to Rachel Hobhouse (1883–1981), the eldest daughter of the Right Hon. Henry Hobhouse.Charles Mosley, ed., Burke's Peerage, Baronetage & Knightage, 107th edition (Burke's Peerage Genealogical Books Ltd, 2003), vol. 1, p. 812 He had four siblings: older sisters Margaret and Janet, younger sister Theresa, and younger brother Anthony. Clay was educated at Gresham's School, Holt, and Trinity College, Cambridge, graduating MA in 1935.Sir Henry Felix Clay, 6th Baronet, at thepeerage.com'CLAY, Sir Henry Felix', in Who Was Who (London: A & C Black); online edition by Oxford University Press, December 2012, accessed 18 January 2014  "]}, {"page": "Pitcombe", "response": ["* Stephen Henry Hobhouse (1881–1961), pacifist, conscientious objector during World War I, prison reformer, writer and theologianhttp://thepeerage.com/p22999.htm#i229982", "* Henry Hobhouse (1854–1937) Justice of the Peace and Liberal Member of Parliament in the House of Commons from 1885 until 1906"]}, {"page": "Henry Hobhouse", "response": ["Henry Hobhouse may refer to:", "* Henry Hobhouse (archivist) (1776–1854), English archivist", "* Henry Hobhouse (East Somerset MP) (1854–1937), English landowner and Liberal Member of Parliament, 1885–1906", "* Henry Hobhouse (author) (1924–2016), author of the book Seeds of Change: Five Plants That Transformed Mankind"]}, {"page": "Henry Hobhouse (b.1854)", "response": ["#REDIRECT Henry Hobhouse (East Somerset MP)"]}, {"page": "List of elected British politicians who have changed party affiliation", "response": ["|Henry Hobhouse"]}, {"page": "Richard Potter (businessman)", "response": ["*Margaret Heyworth (1854–1921), who married Henry Hobhouse"]}, {"page": "Stephen Hobhouse", "response": ["Stephen Henry Hobhouse (5 August 1881 – 2 April 1961) was a prominent English peace activist, prison reformer, and religious writer.", "Stephen Henry Hobhouse was born in Pitcombe, Somerset, England. He was the eldest son of Henry Hobhouse (1854–1937), a wealthy landowner and Liberal MP from 1885 to 1906, and Margaret Heyworth Potter.The Peerage: A genealogical survey of the peerage of Britain as well as the royal families of Europe:Stephen Hobhouse Both sides of his family included a number of reformers and progressive politicians:", "* Wills, David W, Stephen Henry Hobhouse: a twentieth-century Quaker saint, London, Friends Home Service Committee, 1972"]}, {"page": "Catherine Courtney, Baroness Courtney of Penwith", "response": ["Catherine Potter was born at Gayton Hall, Herefordshire. She was the second daughter of the businessman Richard Potter and his wife Lawrencina (née Heyworth), daughter of a Liverpool merchant. Her seven younger sisters included the social reformer Beatrice Webb, Baroness Passfield, while Charles Cripps, 1st Baron Parmoor, and Henry Hobhouse were among her brothers-in-law. Mostly educated at home by tutors, she briefly attended a London boarding school for girls in the 1860s. She was not regarded as particularly clever or beautiful, and strongly disliked seasons and socialising with the upper class. After her coming out party in 1865, she strived for independence and resisted her parents' attempts to marry her off."]}, {"page": "List of Liberal Unionist Party MPs", "response": ["|Henry Hobhouse"]}, {"page": "1902 Birthday Honours", "response": ["*Henry Hobhouse, Esq., MP"]}, {"page": "Henry Hobhouse (author)", "response": ["Henry Hobhouse (24 December 1924 – 5 March 2016), was an English sailor, broadcaster, journalist, farmer, author, and politician, best known for his book Seeds of Change: Five Plants That Transformed Mankind.", "Henry Hobhouse was known as \"Tom\" to distinguish him from his grandfather, a well-known Liberal politician also named Henry Hobhouse.  He was born at Lamyat, Somerset in 1924 and was the second child of Arthur Hobhouse, Liberal MP for Wells and the architect of Britain’s National Park system.  His uncle was the religious writer and peace activist Stephen Henry Hobhouse.", "He was educated at Eton, but ran away at 17 in 1942 to join the Merchant Navy, where he was involved in the Atlantic convoy, and soon transferred to the Royal Navy, where he saw the D-Day landing whilst working on the Operation Pluto underwater pipeline.Henry Hobhouse, author - obituary The Daily Telegraph. 25 March 2016", "His 1985 book, Seeds of Change: Five Plants That Transformed Mankind, shows how the history of the world since Columbus \"discovered\" America has been changed by five plants: sugar, tea, cotton, the potato, and the cinchona (source of quinine). His obituary in The Guardian noted that \"Seeds of Change altered the way we understand modern history\".Henry Hobhouse obituary The Guardian. 10 April 2016"]}, {"page": "Libro de' Disegni", "response": ["|align=\"left\"| School of Gozzoli Benozzo ||align=\"center\"| Two saints  ||align=\"right\"|1882,0812.218|| align=\"center\"|Henry Hobhouse 1882 ||align=\"right\"|  Entry"]}, {"page": "Rosa Waugh Hobhouse", "response": ["In March 1915, at a dinner party for Christian activists, Rosa met Stephen Hobhouse, her future husband: someone similarly committed to working among the dispossessed in London’s East End. Stephen Hobhouse was the eldest son of Henry Hobhouse, a wealthy Somerset landowner and Liberal MP. A decade before Stephen met Rosa, inspired by Tolstoy, he had renounced his heirship to the Somerset estate, in order to devote himself to working with the poor and oppressed in London’s East End. At the time of their meeting Stephen was living (with an Austrian ‘enemy alien’) in a tenement flat in Hoxton, east London.  He too was a Quaker and pacifist and, at the time of their meeting, was heavily involved in Quaker led work to support the wives and other dependents of foreign nationals. Three days after the outbreak of WW1 Stephen Hobhouse had set up, and become Chair, of the Friend's’ Emergency Committee which supported the families of British residents of German, Austro-Hungarian and Turkish nationality. Rosa also at this time, more informally, had been assisting wives and dependants of Germans and other European nationalities in the East End of London where local communities were particularly hostile to ‘enemy aliens’."]}]}}