{"wiki_id": "http://www.wikidata.org/entity/Q5723281", "itemLabel": "Henry Houseley", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Houseley", "wikipedia_page": {"main": "Henry Houseley FRCO (20 September 1851– 13 March 1925) was an English organist, composer and teacher, who moved to Denver, Colorado.", "link_mentions": [{"page": "American Guild of Organists", "response": ["Among the 145 founding members of the guild were Benjamin Dwight Allen, John W. Bischoff, Dudley Buck, George Whitefield Chadwick, Kate Sara Chittenden, Charles Whitney Coombs, Gaston Dethier, Clarence Dickinson, Clarence Eddy, Arthur Foote, William Gilchrist, Henry HouseleyGuild of Organists, hymnary.org, retrieved 18 December 2014 Henry Holden Huss, Bruno Klein, Ernst R. Kroeger, Benjamin Johnson Lang, Peter C. Lutkin, and Herve D. Wilkins. Clifford Demarest also played an important role in its first two decades."]}, {"page": "St Matthew's Church, Talbot Street", "response": ["*Henry Houseley ???? - 1870"]}, {"page": "St. Thomas' Church, Nottingham", "response": ["*Henry Houseley 1882–1888"]}, {"page": "Edmund Hart Turpin", "response": ["Finding as time went on that the continual travelling back and forth to Nottingham (frequently at night) was too great a strain upon his health, he resigned with great regret his post at the Roman Catholic cathedral in Nottingham, and finally, in 1865, he settled for good in London. His brother, James Turpin, succeeded him as organist in Nottingham. Early in 1869, he undertook in addition to all this heavy church work, the duties of organist and choirmaster at St. George's, Bloomsbury. Once settled in London Turpin rapidly made friends, two of the earliest being Edward John Hopkins of the Temple Church, and John Pyke Hullah. Another friend for nearly forty years was Charles William Pearce (1856–1928), organist and later Hon. Treasurer of the Royal College of Organists; the latter wrote E.H. Turpin's biography in 1911.Charles William Pearce, A Biographical Sketch of Edmund Hart Turpin, 1911, Preface In London, E.H. Turpin studied under John Pyke Hullah as well as Ernst Pauer.Hullah and Pauer , cyberhymnal.org, retrieved 26 October 2014 It is known that E.H. Turpin also acted as teacher. For example, Edwin Lemare, Henry Houseley and John Cullen received musical education from him.John Cullen, books.google.nl, retrieved 16 December 2014 Edwin Lemare even lived with the Turpin family for several years while E.H. Turpin groomed him for a recital career.Lemare living with Turpin's, orgel.com, retrieved 9 November 2014"]}, {"page": "St Luke's Church, Derby", "response": ["*Henry Houseley 1870 –1882"]}]}}