{"wiki_id": "http://www.wikidata.org/entity/Q5729829", "itemLabel": "Henry Warburton", "itemDescription": "British politician  (1785-1858)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Warburton", "wikipedia_page": {"main": "Henry Warburton (12 November 1784 – 16 September 1858) was an English merchant and politician, and also an enthusiastic amateur scientist.\nElected as Member of Parliament for Bridport, Dorset, in the 1826 general election, he held the seat for 15 years until his resignation from the House of Commons in 1841. He was returned to the Commons at a by-election in November 1843, for Kendal, but did not seek re-election in 1847.On Parliament he was active in the reform of bankruptcy, the repeal of stamp duty on newspapers, introduction of the penny post and in the campaigns of the Anti-Corn Law League.", "link_mentions": [{"page": "William Hyde Wollaston", "response": ["Wollaston was too ill to deliver his final Bakerian lecture in 1828 and dictated it to Henry Warburton who read it on 20 November."]}, {"page": "The BMJ", "response": ["The first issue of the Provincial Medical and Surgical Journal (PMSJ) was 16 pages long and contained three simple woodcut illustrations. The longest items were the editors' introductory editorial and a report of the Provincial Medical and Surgical Association's Eastern Branch. Other pages included a condensed version of Henry Warburton's medical reform bill, book reviews, clinical papers, and case notes. There were  columns of advertisements. Inclusive of stamp duty it cost 7d, a price which remained until 1844. In their main article, Green and Streeten noted that they had \"received as many advertisements (in proportion to the quantity of letter press) for our first number, as the most popular Medical Journal, (The Lancet) after seventeen years of existence.\""]}, {"page": "Maria Graham", "response": ["In the mid-1830s her description of the earthquake in Chile of 1822 started a heated debate in the Geological Society, where she was caught in the middle of a fight between two rivalling schools of thought regarding earthquakes and their role in mountain building. Besides describing the earthquake in her Journal of a Residence in Chile, she had also written about it in more detail in a letter to Henry Warburton, who was one of the Geological Society’s founding fathers. As this was one of the first detailed eyewitness accounts by \"a learned person\" of an earthquake, he found it interesting enough to publish in Transactions of the Geological Society of London in 1823."]}, {"page": "George Bellas Greenough", "response": ["In 1819, he published A Critical Examination of the First Principles of Geology, a work which was useful mainly in refuting erroneous theories. In the following year, the Geological Society issued his famous Geological Map of England and Wales, in six sheets (published 1 May 1820, although the date 1 November 1819 appears on the map). A second edition was issued in 1840 (the date on this map is 1 November 1839) and a third edition was published in 1865. thumb|left|alt=Greenough's Geological map of England & Wales published by the Geological Society 1819|Geological Map of England & Wales by G.B Greenough, published by the Geological Society, 1820 This map was the culmination of a major cooperative project of the early Geological Society, who had established a Committee of Maps in April 1809, led by Greenough. Members of the society out in the provinces of England and Wales submitted details of local rocks and strata which were collated by Greenough, entered in his notebooks and plotted on a topographical map. Greenough was an inductivist in the Baconian tradition, so he eschewed 'theory' and systematically collected information and details with the aim of discovering the distribution of rocks. Greenough received assistance in the collection of his geological facts chiefly from William Buckland, Reverend W. D. Conybeare, Henry Warburton, and Thomas Webster, and amongst others from Henry Thomas De la Beche, John Farey, the Rev. J. Hailstone, David Mushet, Thomas Biddle and Arthur Aikin."]}, {"page": "List of people associated with University College London", "response": ["* Henry Warburton (1784–1858), English merchant and politician, and also an enthusiastic amateur scientist", "Olinthus Gregory, Joseph Hume, James Mill, John Smith, Henry Warburton, John Wishaw, Thomas Wilson, and William Wilkins, architect."]}, {"page": "John Elliotson", "response": ["He was a private pupil of the rector of St Saviours, Southwark, and went on to study medicine at the University of Edinburgh,The University of Edinburgh was also the alma mater of James Braid and James Esdaile. from 1805 to 1810 — where he was influenced by Thomas Brown, M.D. (1778–1820) — and then at Jesus College, Cambridge, from 1810 to 1821), from both of which institutions he took the degree of M.D., and subsequently in London at St Thomas' and Guy's hospitals. In 1831 he was elected professor of the principles and practice of physic in London University (now University College London), and in 1834 he became physician to University College Hospital.For a detailed and comprehensive description of his rather unusual medical education, see the transcript of the evidence that Elliotson gave to the House of Commons' Select Committee on Medical Education chaired by Henry Warburton on 24 March 1834: at Warburton (1834), pp. 104–117."]}, {"page": "Henry George Ward", "response": ["Ward supported the colonisation aims and methods of Edward Gibbon Wakefield; and was a committee member of the South Australian Association set up in 1834 by Wakefield, with Buller and Grote, and also William Clay, Rowland Hill, William Molesworth, Southwood Smith, Henry Warburton and William Wolryche-Whitmore.Bernard Semmel, The Rise of Free Trade Imperialism: Classical Political Economy the Empire of Free Trade and Imperialism 1750–1850 (2004), p. 118; Google Books. Ward chaired the 1836 select committee on Disposal of Lands in the British Colonies.Philip Temple, A Sort of Conscience: the Wakefields (2002), p. 175; Google Books. The other members of the committee were Francis Baring, Henry Lytton Bulwer, William Ewart Gladstone, George Grey, William Hutt, John Arthur Roebuck, and George Poulett Scrope. Eleven witnesses were called, but the colonists were not well represented among them, and Wakefield was given a platform for his views. The committee's report was in effect an endorsement of the \"Wakefield system\" and its recent implementation.Richard Charles Mills, The Colonization of Australia (1915), pp. 216–7; archive.org."]}]}}