{"wiki_id": "http://www.wikidata.org/entity/Q5726954", "itemLabel": "Henry Peyto-Verney, 16th Baron Willoughby de Broke", "itemDescription": "English Baron", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Peyto-Verney,_16th_Baron_Willoughby_de_Broke", "wikipedia_page": {"main": "Henry Peyto-Verney, 16th Baron Willoughby de Broke and de jure 24th Baron Latimer (5 April 1773 – 16 December 1852) was a peer in the peerage of England.Henry Peyto-Verney was born on 5 April 1773, the younger son of  John Peyto-Verney (1738–1816),14th Baron Willoughby de Broke and Lady Louisa North, daughter of Francis North, 1st Earl of Guilford. He lived a somewhat reclusive life at the Verney family seat at Compton Verney House in Warwickshire, inheriting the title 16th Baron Willoughby de Broke and 24th Baron Latimer on the death of his elder brother  John Peyto-Verney (1762–1820).\nHe married Margaret Williams, daughter of Sir John Williams, 1st Baronet Williams of Bodelwyddan in St Asaph Cathedral on 10 March 1829. Lady Margaret commissioned the building of the remarkable Marble Church, Bodelwyddan in North Wales to his memory soon after his death at Compton Verney on 16 December 1852. Margaret herself died in 1880. He was succeeded as 17th Baron by his nephew  Robert John Barnard (1809–1862) who changed his name to Verney.", "link_mentions": [{"page": "Baron Willoughby de Broke", "response": ["*Henry Peyto-Verney, 16th Baron Willoughby de Broke (1773–1852)"]}, {"page": "Baron Latimer", "response": [":24 Henry Peyto-Verney, 16th Baron Willoughby de Broke (1773–1852), brother."]}, {"page": "Marble Church, Bodelwyddan", "response": ["The church was erected by Lady Margaret Willoughby de Broke (daughter of Sir John Williams of nearby Bodelwyddan Castle) in memory of her husband, Henry Peyto-Verney, 16th Baron Willoughby de Broke. She laid the foundation stone on 24 July 1856 and the new church designed by John Gibson was consecrated by the Bishop of St Asaph on 23 August 1860 after construction at a cost of £60,000. The new parish of Bodelwyddan was created on 3 August 1860, from the communities of Bodelwyddan, Faenol and Pengwern, which until that date had been part of the parish of St Asaph. When it was first built, it was nicknamed the 'Pearl of the Vale'."]}, {"page": "Robert Verney, 17th Baron Willoughby de Broke", "response": ["In 1852 he inherited the titles 17th Baron Willoughby de Broke and 25th Baron Latimer on the death of his uncle Henry Peyto-Verney, 16th Baron Willoughby de Broke (d.1852) and in 1853 was obliged to change his surname name to his maternal name of Verney as a condition of inheriting the Verney estates."]}, {"page": "Henrietta Maria Moriarty", "response": ["Other subscribers were the Margravine of Ansbach, Henry Peyto-Verney, 16th Baron Willoughby de Broke, and the Bishop of St Davids. Within two years she paid off all outstanding debts to the sum of four hundred and eighty pounds."]}]}}