{"wiki_id": "http://www.wikidata.org/entity/Q5726252", "itemLabel": "Henry Nelson O'Neil", "itemDescription": "English painter (1817-1880)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Nelson_O%27Neil", "wikipedia_page": {"main": "Henry Nelson O'Neil  (1817 in Russia – 1880) was a historical genre painter and minor Victorian writer. He worked primarily with historical and literary subjects, but his best-known paintings dealt with the Indian Mutiny. Eastward, Ho!, dated August 1857 but exhibited the following year, depicts the British troops embarking for India. A second painting, Home Again (1859), shows the troops returning to England. He also had popular successes with romantic scenes portraying the deaths of Mozart and Raphael, depicted as though mentally transported to heaven by their own religious art. In The Last Moments of Mozart the dying composer listens to singers performing part of his Requiem. The Last Moments of Raphael shows the painter contemplating the unseen figure of Christ in his Transfiguration.\nO'Neil was a member of The Clique, a group of artists in the 1840s who, like the later Pre-Raphaelite Brotherhood, met regularly to discuss and criticize one another's works. The other members of The Clique were Augustus Egg, Alfred Elmore, Richard Dadd, William Powell Frith, John Phillip, Edward Matthew Ward.\nMost of the Clique opposed the Pre-Raphaelites, but O'Neil was the most virulent in his condemnation of the movement, attacking them in both paintings and writings. These included his futuristic fantasy Two Thousand Years Hence (1867), which portrayed Britain in the year 3867 as a frozen wasteland excavated by an archaeologist from New Zealand. The archaeologist uncovers evidence of the decline of British culture in the nineteenth century, allowing O'Neil to vent his own distinctly reactionary political views, predicting dire consequences of the Reform Act 1867.\nIn July, 1865, O'Neil accompanied the Great Eastern on her voyage to lay the cable of the Atlantic telegraph, hoping to find on board a subject suitable for a picture: the unfortunate breaking of the cable, however, prevented the accomplishment of the artist’s intention. During the voyage he edited and illustrated five issues of the shipboard newsletter The Atlantic Telegraph, and on his return to England he published an account of the expedition in Blackwood’s Edinburgh Magazine. In 1866 he again accompanied the cable expedition, producing five more publications which were printed on board, and later wrote a humorous account of the voyage for the magazine London Society.", "link_mentions": [{"page": "Antiques Roadshow", "response": ["thumb|Eastward Ho! (1857) by Henry Nelson O'Neil was appraised on Canadian Antiques Roadshow", "The most expensive item featured was Henry Nelson O'Neil's \"Eastward Ho!\" oil on canvas. Recommended insurance: CDN$500,000, later sold at Sotheby's in London for GB£164,800 (about CDN$300,000 at the 2008 exchange rate)."]}, {"page": "1858 in art", "response": ["* Henry Nelson O'Neil – Home Again "]}, {"page": "The Clique", "response": ["The Clique was a group of English artists formed by Richard Dadd in the late 1830s. Other members were Augustus Egg, Alfred Elmore, William Powell Frith, Henry Nelson O'Neil, John Phillip and Edward Matthew Ward."]}, {"page": "Henry O'Neil", "response": ["* Henry Nelson O'Neil (1817–1880), historical genre painter and minor Victorian writer"]}, {"page": "1857 in art", "response": ["* Henry Nelson O'Neil – Eastward Ho!"]}, {"page": "Duchess of Richmond's ball", "response": ["The ball also inspired artists, including John Everett Millais, who painted The Black Brunswicker in 1860, Henry Nelson O'Neil who painted Before Waterloo in 1868 and Robert Hillingford who painted The Duchess of Richmond's Ball."]}, {"page": "William Turner Davey", "response": ["It was Davey's reproductions of historical paintings which brought him to prominence: such as Eastward Ho! August 1857 by Henry Nelson O'Neil (showing British soldiers taking leave of their loved ones as they embark at Gravesend for India, in the wake of the Indian Mutiny), its companion Home Again, and the acclaimed large engraving in mixed mezzotint of Lady Butler's painting Return from Inkerman. He also exhibited 13 pieces at the Royal Academy between 1859 and 1884.  "]}]}}