{"wiki_id": "http://www.wikidata.org/entity/Q5729338", "itemLabel": "Henry Tufnell", "itemDescription": "British politician (1805-1854)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Tufnell", "wikipedia_page": {"main": "Henry Tufnell (1805 – 15 June 1854) was a British Whig politician.\nHe was born the eldest son of William Tufnell of Chichester (MP for Colchester, 1806) and was educated at Eton College and Christ Church, Oxford, where he graduated B.A. in 1829. Whilst at Oxford, he, along with George Cornewall Lewis, translated Karl Otfried Müller's book The History and Antiquities of the Doric Race into English.\nHe was appointed secretary to Sir Robert Wilmot-Horton when the latter was Governor of Ceylon and from 1835 to 1839 was Private Secretary to Lord Minto when that Earl was First Lord of the Admiralty.He entered the House of Commons in 1837 as a member for Ipswich, having previously been defeated in the Colchester election in 1835, but lost that seat a year later. He was returned for Devonport in a by-election in 1840 and held that seat until 1854. He held minor posts in the governments of Lord Melbourne and Lord John Russell, and was made a Privy Counsellor when he resigned for health reasons in 1850.\nHe died at the age of 49. He had married 3 times; firstly in 1830 Anne Augusta, the daughter of the Rt Hon. Sir Robert Wilmot-Horton, secondly in 1844 the Hon. Frances Byng, daughter of the Earl of Strafford and thirdly in 1848 Lady Anne Primrose, daughter of the 4th Earl of Rosebery. He had a son and 2 daughters.", "link_mentions": [{"page": "Tufnell Park", "response": ["The manor then passed to Henry Tufnell (d. 1854), MP for Ipswich and Devonport, Liberal chief whip whose three marriages included two daughters of earls.", "Serious building began in 1845 with a scheme sponsored by Henry Tufnell and designed by John Shaw Jr., who had laid out the Eton Estate in Chalk Farm. This initial work was largely limited to the area around Carleton Road. In 1865 the scheme was taken up by George Truefitt who developed most of the local villas and St. George's Church (1865), built for Anglican secessionists.  The housing stock was of a solid nature, and Tufnell Park kept its good name until the end of the century.  Charles Booth in his survey of London Life and Labour reported that the older streets (Anson Road and Carleton Road) housed a mixture of retired merchants and music hall artistes who were rich enough to holiday abroad over winter.  He believed that second wave of building around Celia, Hugo, Corinne, Huddleston and Archibald Roads threatened to create a metropolis \"from which the rich would soon be going\". The private girls' school established at the corner of Carleton and Brecknock Roads ceased in 1878 after many of its pupils drowned in the  disaster."]}, {"page": "George Cornewall Lewis", "response": ["He translated Philipp August Böckh's Public Economy of Athens and Muller's History of Greek Literature, and he assisted Henry Tufnell in the translation of Müller's Dorians.  While his friend Abraham Hayward ran the Law Magazine, he wrote in it frequently on subjects including secondary punishments and the penitentiary system."]}, {"page": "List of Privy Counsellors (1837–1901)", "response": ["*Henry Tufnell (1805–1854)"]}, {"page": "Parliamentary Secretary to the Treasury", "response": ["*Henry Tufnell 1846–1850"]}, {"page": "Second Melbourne ministry", "response": ["| Henry Tufnell"]}, {"page": "Plymouth Devonport (UK Parliament constituency)", "response": ["|rowspan=\"3\" |Henry Tufnell ||rowspan=\"3\" | Whig"]}, {"page": "Xenelasia", "response": ["*\"The anxiety of the Dorians, and the Spartans in particular, to keep up the pure Doric character and the customs of their ancestors, is strongly shown by the prohibition to travel, and the exclusion of foreigners, an institution common both to Spartans and Cretans,…\"The History and Antiquities of the Doric Race, Karl Otfried Müller, trans. from the German by Henry Tufnell and George Cornewall Lewis, John Murray, London, 2nd ed. rev. 1839. Vol II, pg 4"]}, {"page": "Ipswich (UK Parliament constituency)", "response": ["| Henry Tufnell\t"]}, {"page": "First Russell ministry", "response": ["|rowspan=2|Parliamentary Secretary to the Treasury||Henry Tufnell||7 July 1846|| "]}, {"page": "List of MPs elected in the 1852 United Kingdom general election", "response": ["|rowspan=\"2\"|Devonport(two members)||Henry Tufnell||Liberal"]}, {"page": "Tufnell", "response": ["* Henry Tufnell (1805–1854), British politician"]}, {"page": "Chief Whip of the Liberal Democrats", "response": ["|Henry Tufnell"]}, {"page": "List of Lords Commissioners of the Treasury", "response": ["**Henry Tufnell", "**Henry Tufnell", "**Henry Tufnell"]}, {"page": "Naval Secretary", "response": ["* 1835  – 1839 Captain Henry Tufnell "]}, {"page": "List of United Kingdom by-elections (1847–1857)", "response": ["|Henry Tufnell"]}, {"page": "List of United Kingdom by-elections (1832–1847)", "response": ["|Henry Tufnell"]}, {"page": "The Colombo Journal", "response": ["The Colombo Journal was a short-lived English-language bi-weekly newspaper in Ceylon. The newspaper started on 1 January 1832 with George Lee as editor. George Lee was the Superintendent of the Government Press and later Postmaster General. The newspaper had the support of the government and Governor Robert Wilmot-Horton. Apart from Horton and Lee other senior government officials who wrote for the newspaper included the governor's private secretary Henry Tufnell and George Turnour. Criticism of the British government led to the newspaper being closed by the Colonial Office on 31 December 1833."]}]}}