{"wiki_id": "http://www.wikidata.org/entity/Q5723030", "itemLabel": "Henry Hill Hickman", "itemDescription": "British doctor (1800-1830)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Hill_Hickman", "wikipedia_page": {"main": "Henry Hill Hickman (27 January 1800 – 2 April 1830) was an English physician and promoter of anaesthesia.", "link_mentions": [{"page": "Ludlow", "response": ["Born near the town was John Marston (1836–1918), the founder of the Sunbeam racing car and motorcycle company. Also born in proximity to Ludlow was Henry Hill Hickman (1800–1830), a very early pioneer of anaesthetics, at Lady Halton, near Bromfield. Pictorialist photographer Henry Peach Robinson (1830–1901) was born in the town."]}, {"page": "Tenbury Wells", "response": ["*Henry Hill Hickman, pioneer of anaesthesia, practiced as surgeon at Teme Street in the town where he died in 1830."]}, {"page": "Shifnal", "response": ["* Henry Hill Hickman (1800-1830) surgeon and pioneer of anaesthetics, lived and practiced in Shifnal in 1824."]}, {"page": "Bromfield, Shropshire", "response": ["*Henry Hill Hickman, early promoter of anaesthetics"]}, {"page": "History of general anesthesia", "response": ["Henry Hill Hickman (1800–1830) experimented with the use of carbon dioxide as an anesthetic in the 1820s. He would make the animal insensible, effectively via almost suffocating it with carbon dioxide, then determine the effects of the gas by amputating one of its limbs. In 1824, Hickman submitted the results of his research to the Royal Society in a short treatise titled Letter on suspended animation: with the view of ascertaining its probable utility in surgical operations on human subjects. The response was an 1826 article in The Lancet titled \"Surgical Humbug\" that ruthlessly criticised his work. Hickman died four years later at age 30. Though he was unappreciated at the time of his death, his work has since been positively reappraised and he is now recognised as one of the fathers of anesthesia."]}, {"page": "Henry Hickman (disambiguation)", "response": ["*Henry Hill Hickman (1800–1830), physician"]}, {"page": "Inhalation sedation", "response": ["In 1824, Henry Hill Hickman used carbon dioxide to achieve a state of \"suspended animation\" in animals; successfully diminishing pain during the surgical procedure."]}]}}