{"wiki_id": "http://www.wikidata.org/entity/Q5726762", "itemLabel": "Henry Paulet, 16th Marquess of Winchester", "itemDescription": "British peer and businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Paulet,_16th_Marquess_of_Winchester", "wikipedia_page": {"main": "Henry William Montagu(e) Paulet, 16th Marquess of Winchester (30 October 1862 – 28 June 1962) was an English peer, landowner, soldier, sportsman, politician and business man. He was known as Lord Henry Paulet from 1887 until 1899.\nAfter a youth spent largely in travelling and hunting, he became Lord Lieutenant of Hampshire and Chairman of Hampshire County Council, then served in the Hampshire Regiment and the Rifle Brigade during the First World War. In the 1920s he was associated in business with Clarence Hatry, which led to his bankruptcy in 1930. When he died in Monte Carlo at the age of 99 he was the oldest-ever member of the House of Lords.", "link_mentions": [{"page": "Hampshire County Council", "response": ["*Henry Paulet, 16th Marquess of Winchester, Chairman 1904–1909"]}, {"page": "Amport House", "response": ["The last of the Paulet family to reside at Amport was Henry Paulet, 16th Marquess of Winchester. Facing high levels of taxation at the end of the First World War, he sold the estate in lots between November 1918 and July 1919.\"High Court of Justice King's Bench Division, Marquess of Winchester Sued: Chandler and Co. v. Winchester\", The Times, Issue 45501, Thursday, May 1, 1930, pg. 5, col. F Not long afterwards, the house and grounds were bought by Colonel Sofer Whitburn DSO, who in 1923 engaged Sir Edwin Lutyens and Gertrude Jekyll to redesign the gardens. "]}, {"page": "Lord Lieutenant of Hampshire", "response": ["*Henry Paulet, 16th Marquess of Winchester 21 December 1904 – 24 January 1918"]}, {"page": "Clarence Hatry", "response": ["In early 1929 investors flocked to the Hatry group: General Securities Ltd. (of which Henry Paulet, 16th Marquess of Winchester, was chairman); Austin Friars Trust, Ltd., Dundee Trust, Oak Investment Corp., Associated Automatic Machines Corp., Retail Trade Corp., Photomaton Parent Corp. and Far Eastern Photomaton Corp."]}, {"page": "Bapsybanoo Pavry", "response": ["In 1952, she married Henry Paulet, 16th Marquess of Winchester and became the Marchioness of Winchester, thought to be the only Indian Marchioness in history. Her husband, the childless widower Marquess, was ninety years old at the time. The Marquess left Pavry within weeks of the marriage for his former fiancée Eve Fleming, the mother of Ian Fleming, the James Bond author, and a former lover of Augustus John.  (After a brief engagement, Eve Fleming had refused to marry the Marquess because on remarriage she would have lost the substantial allowance granted in her husband's will).  In 1957, the Marchioness sued Mrs Fleming, alleging that she had enticed the Marquess away, but despite initial success, the decision was overturned in Mrs Fleming's favour on appeal.  The Marquess lived out the remainder of his life in Monte Carlo with Eve Fleming, dying four months prior to his centenary in 1962. "]}, {"page": "Henry William Montague Paulet, 16th Marquess of Winchester", "response": ["#REDIRECTHenry Paulet, 16th Marquess of Winchester"]}, {"page": "Richard Paulet, 17th Marquess of Winchester", "response": ["Richard Charles Paulet, 17th Marquess of Winchester (born on 8 July 1905; died 5 March 1968) was the son of Charles Standish Paulet and Lillian Jane Charlotte Fosbery. He inherited the title of 17th Marquess of Winchester from Henry Paulet, 16th Marquess of Winchester, through Charles Paulet, 13th Marquess of Winchester. He died unmarried,The Peerage: Richard Charles Paulet, 17th Marquess of Winchester and the title was passed to his 26 year old cousin Nigel Paulet, 18th Marquess of Winchester."]}, {"page": "Charlotte Josephine, Marchioness of Winchester", "response": ["#REDIRECT Henry Paulet, 16th Marquess of Winchester#Personal life"]}]}}