{"wiki_id": "http://www.wikidata.org/entity/Q5723258", "itemLabel": "Henry Horton", "itemDescription": "English cricketer (1923-1998)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Horton_(sportsman)", "wikipedia_page": {"main": "Henry Horton (18 April 1923 – 2 November 1998) was an English sportsman who played cricket for Hampshire in the 1950s and 1960s, having previously played a handful of times for Worcestershire in the 1940s. He also played football for Blackburn, Southampton, Bradford Park Avenue and Hereford.", "link_mentions": [{"page": "Henry Horton", "response": ["Henry Horton may refer to:", "* Henry Horton (newspaper proprietor) (1870–1943), owner of The New Zealand Herald", "* Henry Horton (sportsman) (1923–1998), English cricketer and footballer", "* Henry Horton State Park, Chapel Hill, Tennessee, United States", "* Henry Horton Miller (1861–1916), Canadian politician"]}, {"page": "Stan Clements", "response": ["He made his league debut on 24 May 1947 in the 2–0 home victory over Fulham. He  was a strong, powerful centre-half and replaced Eric Webber for 13 games in the following season when Webber was rested. Once Webber regained his place in the team, Clements made no further first-team appearances until February 1951. For the following few seasons he alternated at centre-back with Len Wilkins and Henry Horton and had a spell as team captain in 1952–53."]}, {"page": "Playfair Cricket Annual", "response": ["* 1961: Trevor Bailey, Ted Dexter, Norman Horner, Henry Horton, Tony Lewis, Alan Moss, Michael Norman, Eric Russell, Brian Statham, Fred Trueman, Peter Wight"]}, {"page": "Henry Horton (cricketer)", "response": ["#REDIRECT Henry Horton (sportsman)"]}, {"page": "Category talk:Unassessed rugby league articles", "response": ["Henry Horton (sportsman)Stub"]}, {"page": "Arthur Holt (sportsman)", "response": ["In 1953, he helped John Arlott persuade Henry Horton to take up county cricket as his football career at Southampton was winding down."]}, {"page": "Roy Williams (footballer)", "response": ["Williams was only 5 ft 4in tall and was probably the smallest forward ever to play for Southampton, but he had a stocky build and was able to \"mix it\" with the toughest defenders and soon became a first-team regular. In the 1953–54 season, he became a fixture at inside-right until January, when he was dropped with Walker moving across from the left and Henry Horton taking over at inside-left. Williams returned for the last four matches of the season, in which the Saints finished in sixth place, after having been first or second until late-January."]}, {"page": "List of English cricket and football players", "response": ["| Henry Horton"]}, {"page": "List of tied first-class cricket matches", "response": ["Henry Horton 40"]}, {"page": "United Services Recreation Ground", "response": ["First-class cricket returned to the ground after the war, when Hampshire played Essex. The record attendance for a county match was made in 1948, when 10,000 watched Hampshire played Sussex. Hampshire continued to play four matches per season there going into the 1950s.  It was during this time that under the leadership of Desmond Eagar and Colin Ingleby-Mackenzie that the Hampshire team was beginning to become a powerful force in the county game.  Coupled with the batting of Roy Marshall (who in five matches there in 1957 scored 549, an unbeaten record for the ground), Jimmy Gray and Henry Horton, and backed up with the bowling of Derek Shackleton, Victor Cannings and Malcolm Heath, Hampshire had a fairly successful period, finishing runners-up in 1958, before winning the County Championship for the first time in 1961, with Hampshire winning four of their five matches there in that season.  They might have been successful in 1958, had it not been for two draws later in the season at the ground. A new format, List A cricket, was introduced in 1963, two years after its introduction, the ground held its first List A match when Hampshire played Kent in the 1965 Gillette Cup. Six first-class matches had been held there in 1962, before the schedule at the ground was reduced back to five, with the expansion of List A cricket with the Player's County League and John Player League, on average two or three List A matches were held there over the coming seasons. Hampshire were pressing for the Player's County League title in 1969, with a crowd of 8,000 watching their defeat to Essex. Hampshire finished that season's competition one point behind winners Lancashire.  A first-class match in 1971 between Hampshire and the touring Pakistanis saw protests by Bangladeshis protesting Pakistani actions in the Bangladesh Liberation War. Hampshire won the County Championship for a second time in 1973, though the 1970s saw a gradual reduction in the number of first-class matches held there, by the end of that decade three first-class matches and two List A matches were granted to the ground each season. This decade also saw logistical problems for the ground, when at the Railway End trees were destroyed, whose removal interrupted the batsman line of sight.  As such, no matches were held there in 1975, though the purchase of screens allowed county cricket to return in 1976.  1976 was also not without its problems, when a County Championship match against Yorkshire was interrupted by vandals who had attacked the pitch during the night.  Despite this setback, the match continued on an adjoining strip of pitch."]}, {"page": "Raymond Flood (cricketer)", "response": ["Flood made his first-class debut for Hampshire against Essex at the United Services Recreation Ground during the 1956 County Championship, one of two first-class matches he played that season. He did not feature for Hampshire in 1957, while in 1958 he played just once against Derbyshire. Flood found his first–team appearances limited with the established presence of Roy Marshall, Jimmy Gray and Henry Horton limited his appearances, in what was a strong Hampshire side for the time."]}, {"page": "List of Hampshire County Cricket Club first-class cricket records", "response": ["|Henry Horton|||| 21,536"]}, {"page": "Derek Digby", "response": ["In September 1953, he refused to accept the new contract offered by Exeter, and was signed by George Roughton who had managed Exeter until March 1952, and was now in charge at fellow Third Division side, Southampton. He was immediately drafted into the first team, replacing John Hoskins at outside-left. Described as \"quick on his toes\", he made an encouraging debut against Colchester United on 23 September, setting up the winning goal for Henry Horton. Despite this promise, he was unable to secure a regular place in the side, with Hoskins returning after six matches. From mid-November onwards, Digby made five further appearances, including three at outside-right in place of John Flood."]}]}}