{"wiki_id": "http://www.wikidata.org/entity/Q5728662", "itemLabel": "Henry Steedman", "itemDescription": "botanist (1866-1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Steedman", "wikipedia_page": {"main": "Henry Steedman (1866–1953) was a Scottish-born Australian botanist.\nBorn in Scotland in 1866, he emigrated to Western Australia at the age of 21. He was head gardener at the South Perth Zoological Gardens (now Perth Zoo) for many years, but was retrenched in the late 1920s with the onset of the Great Depression. Thereafter he spent his time collecting seeds and specimens of native plants. He made a number of collecting expeditions, including one east to Kalgoorlie with Ivan Carnaby; another south as far as Ravensthorpe, also with Carnaby; and one along the west coast from Bunbury to Geraldton. He collected the type specimens for a number of Eucalyptus taxa, including E. crucis (Silver Mallee), E. erythandra (Rosebud Gum), E. rhodantha (Rose Mallee) and E. steedmanii (Steedman's Gum). He was joint publisher with Joyce Blakely of the second and third of these species, and also E. burdettiana (Burdett Gum), E. carnabyi and E. chrysantha. E. steedmanii was named in his honour, as was Acacia steedmanii and Melaleuca fulgens subsp. steedmanii.", "link_mentions": [{"page": "Eucalyptus gomphocephala", "response": ["In 1939, William Blakely and Henry Steedman described two varieties of this species in Contributions from the New South Wales National Herbarium but the named are listed as synonyms by the Australian Plant Census."]}, {"page": "Steedman", "response": ["*Henry Steedman (1866–1953), Scottish-born Australian botanist"]}, {"page": "H.Steedman", "response": ["#REDIRECT Henry Steedman"]}, {"page": "Ivan Carnaby", "response": ["Ivan Clarence Carnaby (24 July 1908 – 1974) was an Australian farmer, naturalist and ornithologist.  He was born in Subiaco, Western Australia.  He published many papers on Southwest Australian birdlife in Emu, The Western Australian Naturalist and Western Australian Bird Notes.  He also made several botanical collecting journeys with Henry Steedman.  He is commemorated in one of the common names of Carnaby's cockatoo, also known as the short-billed black cockatoo, which he described in 1948.  Carnaby first suggested the existence of more than one kind of white-tailed black-cockatoo in the 1930s, something later confirmed by research."]}, {"page": "Eucalyptus rhodantha", "response": ["Eucalyptus rhodantha was first formally described in 1938 by William Blakely and Henry Steedman in Proceedings of the Linnean Society of New South Wales from material collected by Steedman near Gunyidi in 1934. The specific epithet (rhodantha) is from ancient Greek, meaning \"rose coloured\" and \"-flowered\"."]}, {"page": "List of botanists by author abbreviation (H)", "response": ["* H.Steedman – Henry Steedman (1866–1953)"]}, {"page": "Melaleuca fulgens subsp. steedmanii", "response": ["Melaleuca fulgens subsp. steedmanii was first formally described in 1928 by Charles Austin Gardner in Journal of the Royal Society of Western Australia as Melaleuca steedmanii. In 1990, in a review of the species by Kirsten Cowley, Frances Quinn, Bryan Barlow and Lyndley Craven in Australian Systematic Botany, Melaleuca steedmanii was recognised as Melaleuca fulgens subsp. steedmanii. The specific epithet (steedmanii) honours Henry Steedman, a Scottish-born Australian botanist."]}, {"page": "Eucalyptus burdettiana", "response": ["Eucalyptus burdettiana was first formally described by William Blakely and Henry Steedman in 1939 and the description was published in Contributions from the New South Wales National Herbarium from specimens collected by Steedman on stony outcrops of Mount Barren near Hopetoun in 1938. The specific epithet (burdettiana) honours William Burdett (1871-1940) who was a friend of Henry Steedman."]}, {"page": "Eucalyptus steedmanii", "response": ["Eucalyptus steedmanii was first formally described by the botanist Charles Gardner in 1933 in the Journal of the Royal Society of Western Australia from a specimen collected by Henry Steedman south of Southern Cross in 1928. The specific epithet (steedmanii) honours Steedman."]}, {"page": "Eucalyptus coronata", "response": ["Eucalyptus coronata was first formally described in 1933 by Charles Gardner and the description was published in the Journal of the Royal Society of Western Australia. Gardner had collected specimens near the Barren Range in 1914 and Henry Steedman had collected in 1931 from the same area. In 1936 Eucalyptus mitrata was also described by Gardner in the same journal but it is considered to be a synonym of E. coronata. The specific epithet (coronata) is from the Latin coronatus meaning \"crowned\" and refers to the ribbed operculum."]}, {"page": "Eucalyptus crucis", "response": ["Eucalyptus crucis was first formally described in 1923 by Joseph Maiden from a specimen collected near Southern Cross by Henry Steedman in 1922. Maiden published the description in his book A Critical Revision of the Genus Eucalyptus. The specific epithet (crucis) is a Latin word meaning \"cross\", referring to the type location."]}, {"page": "Eucalyptus × chrysantha", "response": ["This eucalypt was first formally described in 1938 by William Blakely and Henry Steedman who gave it the name Eucalyptus chrysantha and published the description in Journal and Proceedings of the Linnean Society of New South Wales. It is a presumed hybrid between E. preissiana and E. sepulcralis. The specific epithet (chrysantha) is derived from the Ancient Greek words chrysos meaning \"gold\" and anthos meaning \"flower\"."]}, {"page": "Eucalyptus × erythrandra", "response": ["This eucalypt was originally given the name Eucalyptus erythrandra by William Blakely and Henry Steedman who published the description in Proceedings of the Linnean Society of New South Wales. It is now accepted by the Australian Plant Census as a hybrid, either between E. incrassata and E. tetraptera or between E. angulosa and E. tetraptera."]}]}}