{"wiki_id": "http://www.wikidata.org/entity/Q5729402", "itemLabel": "Henry Unwin Addington", "itemDescription": "Diplomat, civil servant", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Unwin_Addington", "wikipedia_page": {"main": "Henry Unwin Addington (24 March 1790 – 6 March 1870) was a British diplomat and civil servant.", "link_mentions": [{"page": "Viscount Sidmouth", "response": ["Anthony Addington, father of the first Viscount, was a distinguished physician. Henry Unwin Addington, nephew of the first Viscount, was a diplomat and civil servant."]}, {"page": "Oregon boundary dispute", "response": ["Huskisson was appointed along with Henry Unwin Addington to negotiate with Gallatin. Unlike his superior, Canning, Huskisson held a negative view of the HBC monopoly and found the region held in dispute with the Americans \"of little consequence to the British.\" At the time the HBC's staff were the only continuous white occupants in the region, though their economic activities weren't utilized by Huskinisson in exchanges with Gallatin. The division suggested by Pelly and Canning's 1824 offer of a Columbia River boundary was rejected. The argument used to counter these offers was the same as in 1824, that a boundary along the Columbia would deny the U.S. an easily accessible deep water port on the Pacific Ocean. The British negotiators to allay this attack offered a detached Olympic Peninsula as American territory, giving access to both the Straits of Juan de Fuca and Puget Sound. This was seen as unsatisfactory by the Americans however. The diplomatic talks were continued but failed to divide the region in a satisfactory manner for both nations. The Treaty of 1818 was renewed on 7 August 1827, with a clause added by Gallatin that a one-year notice had to be given when either party intended to abrogate the agreement. After the death of Canning and the failure to find a satisfactory division of the region with the Americans, \"Oregon had been almost forgotten by the [British] politicians ...\""]}, {"page": "List of ambassadors of the United Kingdom to Spain", "response": ["|Henry Unwin Addington"]}, {"page": "List of Privy Counsellors (1837–1901)", "response": ["*Henry Unwin Addington (1790–1870)"]}, {"page": "Permanent Under-Secretary of State for Foreign Affairs", "response": ["*1842: Henry Unwin Addington"]}, {"page": "Richard Ford (English writer)", "response": ["Ford and his wife made many topographical drawings of Seville and its vicinity and during their wider travels in Spain. These constitute an important record of the Spain of the period as many of the buildings he drew were later to disappear.   Ford also kept detailed notebooks of what he observed.   His journeys took him through Andalucia, Extremadura, Northwest Spain and several times to Madrid.   Late in 1831, together with Harriet Ford, he travelled along the Mediterranean coast to Barcelona and via Eastern Spain to Madrid.   Apart from that a large part of the north and southeast of the country remained unvisited. During his stay he bought many Spanish books, particularly of literature, artistic treatises, topography, local histories and of local saints.   He continued to procure such items after his return home, notably at the Heber (1834–1836), W. B. Chorley (1846) and Riego (1847) sales, which helped to augment his knowledge of those areas he did not visit.   He also relied on friends such as Henry Unwin Addington, the British minister in Madrid 1829–1833 and Pascual de Gayangos, an arabist, to provide him with more recent publications."]}, {"page": "Addington Parish, New Brunswick", "response": ["The parish was named in honour of Henry Unwin Addington, a diplomat who was appointed in 1826 as a plenipotentiary in the boundary negotiations with the United States. He was the nephew of Henry Addington, Prime Minister of the United Kingdom 1801–1804."]}, {"page": "Huskisson Parish, New Brunswick", "response": ["Addington Parish was named at the same time for the other British plenipotentiary, Henry Unwin Addington."]}, {"page": "Addington (surname)", "response": ["* Henry Unwin Addington (1790–1870), British diplomat and civil servant"]}, {"page": "Henry Addington (disambiguation)", "response": ["* Henry Unwin Addington (1790–1870), his nephew; British diplomat and civil servant"]}]}}