{"wiki_id": "http://www.wikidata.org/entity/Q5727281", "itemLabel": "Henry Pulleine", "itemDescription": "British soldier", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Pulleine", "wikipedia_page": {"main": "Lieutenant-Colonel Henry Burmester Pulleine (12 December 1838 – 22 January 1879) was an administrator and commander in the British Army in the Cape Frontier and Anglo-Zulu Wars. He is most notable as a commander of British forces at the disastrous Battle of Isandlwana in January 1879. Substantively a major, he held the rank of brevet lieutenant colonel.", "link_mentions": [{"page": "January 22", "response": ["*  1879   – Henry Pulleine, English colonel (b. 1838)"]}, {"page": "Battle of Isandlwana", "response": ["Chelmsford left behind approximately 600 British red coat line infantry – five companies, around 90 fighting men in each, of the 1st Battalion and one stronger company of around 150 men from the 2nd Battalion of the 24th Regiment of Foot to guard the camp, under the command of Brevet Lieutenant Colonel Henry Pulleine. Pulleine's orders were to defend the camp and wait for further instructions to support the general as and when called upon. Pulleine also had around 700 men composed of the Natal Native Contingent, local mounted irregulars, and other units. He also had two artillery pieces, with around 70 men of the Royal Artillery. In total, over 1,300 men and two artillery guns of the No. 3 Column were left to defend the camp excluding civilian auxiliaries.Knight (1992, 2002), p. 36", "Commanding Officer: Brevet Lieutenant-Colonel Henry Pulleine, 1st/24th Foot"]}, {"page": "Anthony Durnford", "response": ["Around 10:30am on the morning of 22 January, Durnford arrived from Rorke's Drift with five troops of the Natal Native horse and a rocket battery. A Royal Engineer, Durnford was superior in rank to Brevet Lt-Col Henry Pulleine, who had been left in control of the camp. This put the issue of command to the fore because Durnford was senior and by tradition would have assumed command. Pulleine's rank was brevet lieutenant colonel, yet he was still being paid as a major. Durnford did not over-rule Pulleine's dispositions, however, and after lunch he quickly decided to take the initiative and move forward to engage a Zulu force which Pulleine and Durnford judged to be moving against Chelmsford's rear. Durnford asked for a company of the 24th, but Pulleine was reluctant to agree since his orders had been specifically to defend the camp."]}, {"page": "Zulu Dawn", "response": ["* Denholm Elliott as Colonel Henry Pulleine"]}, {"page": "South Wales Borderers", "response": ["In 1879 both battalions took part in the Anglo-Zulu War, begun after a British invasion of Zululand, ruled by Cetshwayo. The 24th Regiment of Foot took part in the crossing of the Buffalo River on 11 January, entering Zululand. The first engagement (and the most disastrous for the British) came at Isandlwana. The British had pitched camp at Isandlwana and not established any fortifications due to the sheer size of the force, the hard ground and a shortage of entrenching tools. The 24th Foot provided most of the British force and when the overall commander, Lord Chelmsford, split his forces on 22 January to search for the Zulus, the 1st Battalion (5 companies) and a company of the 2nd Battalion were left behind to guard the camp, under the command of Lieutenant-Colonel Henry Pulleine (CO of the 1/24th Foot)."]}, {"page": "Flashman and the Tiger", "response": ["*Henry Pulleine - Brevet lieutenant colonel at the Battle of Isandlwana."]}, {"page": "Brevet Lieutenant Colonel Henry Pulleine.", "response": ["#REDIRECT Henry Pulleine"]}, {"page": "Brevet Lieutenant Colonel Henry Pulleine", "response": ["#REDIRECT Henry Pulleine"]}, {"page": "Pullen", "response": ["* Henry Pulleine (bef. 1850–1879), British Army administrator during the Anglo-Zulu War"]}, {"page": "List of English people", "response": ["* Henry Pulleine (1838–1879), lieutenant-colonel"]}, {"page": "Henry Burmester Pulleine", "response": ["#REDIRECT Henry Pulleine"]}, {"page": "Pulleine", "response": ["* Henry Pulleine (1838–1879), English army officer"]}]}}