{"wiki_id": "http://www.wikidata.org/entity/Q5727232", "itemLabel": "Henry Priestman", "itemDescription": "English pop musician, songwriter and record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Priestman", "wikipedia_page": {"main": "Henry Christian Priestman (born 21 June 1955 in Kingston upon Hull, East Riding of Yorkshire, England) is an English rock singer, keyboardist, record producer and songwriter.", "link_mentions": [{"page": "July 21", "response": ["*  1955   – Henry Priestman, English singer-songwriter, keyboard player, and producer"]}, {"page": "Stiff Records", "response": ["In 2007, ZTT and its parent company SPZ Group reactivated the label. Stiff quickly broke one of the UK's hottest new indie acts, The Enemy. It then released a string of well-received albums of new work from legacy Stiff artists, including as Wreckless Eric, Henry Priestman, Any Trouble, and Chris Difford. Brand new acts signed to the label included The Tranzmitors and Eskimo Disco. Swedish designer Tobbe Stuhre was appointed official Stiff Records designer."]}, {"page": "Beverley", "response": ["Longcroft School is a co-educational school, with around 1,500 pupils consisting of both boys and girls. Longcroft School was founded in 1949 and officially opened in 1951 and is home to the Longcroft Gospel Choir, founded by Jonathan Chapman. The choir is well known in the local area and regularly performs at parties, ceremonies, weddings and music concerts. The choir comprises pupils from Year 9 and above and several members of Longcroft School staff, and has a large repertoire of music. Over the choir's period of existence, the choir has performed at venues such as Disneyland Paris and the Apple Store on Oxford Street, London, have released two of their own albums and have featured on a track by singer-songwriter Henry Priestman. But more recently in May 2015, it was announced that the Longcroft Gospel Choir will be one of twenty choirs in the UK to perform at and open the 2015 Rugby World Cup in London performing for the home team (England), a brilliant achievement for the school and the young people in the choir."]}, {"page": "1955 in music", "response": ["**Henry Priestman, English singer-songwriter, keyboardist and producer (The Christians, It's Immaterial and Yachts)"]}, {"page": "The Christians (band)", "response": ["The name of the band refers to the surname of the three brothers that were originally in the line-up, and is also coincidentally guitarist Henry Priestman's middle name.", "Garry Christian (born 27 February 1955, Liverpool) (lead vocals), Roger Christian (born 13 February 1950; died 8 March 1998 from brain tumour) (vocals, instrumentalist), Russell Christian (born 8 July 1956) (keyboards, saxophone, vocals), and Henry Priestman (born Henry Christian Priestman, 21 June 1955, in Kingston upon Hull, brought up in Liverpool) (keyboards, guitars, vocals) formed the band in 1985. Paul Barlow (drums), Mike Bulger (guitar/vocals) and Tony Jones on bass were also early members. Because of a reluctance to tour, Roger left in 1987.", "2012 was the 25th anniversary for the band, who celebrated with a re-release of The Christians and Colour. A new album called Speed of Life was released in September, with the title track the first single. In August they embarked on a tour of the UK and, on 16 December, they played at Liverpool's Royal Court Theatre. They were briefly joined on stage by former band member, Henry Priestman."]}, {"page": "The Christians (album)", "response": ["All tracks written and composed by Henry Priestman except where noted.", "* Henry Priestman – keyboards, guitar, vocals"]}, {"page": "Echo & the Bunnymen (album)", "response": ["* Henry Priestman – keyboards"]}, {"page": "Leighton Park School", "response": ["*Henry Priestman, singer/songwriter (The Christians)"]}, {"page": "In Your Own Time", "response": ["*Henry Priestman – Composer, Producer"]}, {"page": "List of bands and artists from Merseyside", "response": ["*Henry Priestman: Songwriter for The Christians and member of Yachts and It's Immaterial. Now has a solo career"]}, {"page": "The Wild Swans (band)", "response": ["The \"Mark III\" version of The Wild Swans released the group's first single in over 20 years in May 2009, a limited edition 10\" vinyl single on the Occultation label entitled \"English Electric Lightning\", with Henry Priestman guesting on keyboards. The single featured at number four on the Mojo magazine 'Playlist' in April 2009, and received favourable reviews in a number of publications. The Wild Swans follow-up single \"Liquid Mercury\" was released on Occultation on 30 November 2009, and was placed at number 5 in the Mojo Vinyl Countdown.", "On 23 and 24 July 2009, The Wild Swans performed live for the first time since their 1990 demise. The sell out gigs were performed to an audience of 200 each night at Liverpool's Static gallery. Henry Priestman guested on keyboards, and guitarist Will Sergeant (Echo and the Bunnymen) joined the band for the encores and was DJ each night. The Wild Swans played a third gig at Static Gallery, Liverpool on 11 December 2009, having officially expanded to a sextet with the addition of newest band member Richard Turvey on keyboards."]}, {"page": "Mark Herman", "response": ["There, he moved away from animation and towards writing and directing.  He also wrote lyrics for the successful 1980s band The Christians on their first album, The Christians, alongside fellow East Riding of Yorkshire songwriter Henry Priestman."]}, {"page": "Cloudcuckooland (album)", "response": ["* Henry Priestman – piano on \"Bound in a Nutshell\", organ on \"Control the Flame\""]}, {"page": "Bette Bright", "response": ["In the late 1970s, Bright was a singer for the art rock band Deaf School. After Deaf School disbanded, Bright went solo with her backing band, 'The Illuminations'. Band members were Henry Priestman (formerly with band Yachts), Rusty Egan (Visage) and Glen Matlock (Sex Pistols). Their single debut, a cover of \"My Boyfriend's Back\" in 1978, was followed by another cover, \"Captain of Your Ship\", which became a minor airplay hit."]}, {"page": "1955 in the United Kingdom", "response": ["* 21 July – Henry Priestman, English pop singer-songwriter, keyboardist and producer"]}, {"page": "It's Immaterial", "response": ["It's Immaterial were formed by three former members of Yachts - Mancunian John Campbell (vocals), Martin Dempsey (guitar), and Henry Priestman (keyboards) - in addition to Paul Barlow (drums). By 1984, the band had been reduced to a duo - Campbell and Jarvis Whitehead, on guitar and keyboards, who joined in 1982.Strong, Martin C.:The Great Alternative & Indie Discography, 1999, Canongate, ", "In the same year as Song, former It's Immaterial keyboard player Henry Priestman, had a UK number one album The Christians with the band of the same name."]}, {"page": "Yachts (band)", "response": ["The band originally consisted of Bob Bellis (drums, vocals); John (J.J.) Campbell (vocals); Martin Dempsey (bass guitar, vocals) (later replaced by first Ray \"Chopper\" Cooper, then Mick Shiner and finally Glyn Havard); Henry Priestman (born Henry Christian Priestman, 21 June 1955, Hull, and brought up in Liverpool) (vocals, keyboards); and Martin Watson (guitar, vocals).", "* 2004 interview with Henry Priestman"]}, {"page": "Merseybeast", "response": ["*Henry Priestman - Hammond B3 organ, backing vocals"]}, {"page": "Woodleigh School, North Yorkshire", "response": ["* Henry Priestman – Singer songwriter notable for his work with The Christians."]}, {"page": "Mysterio (album)", "response": ["* Henry Priestman – producer (\"Dug for Love\" and \"Lover, Lover, Lover\")"]}, {"page": "Candleland", "response": ["* Henry Priestman – string arrangement on \"I Know You Well\""]}, {"page": "Crystal Days: 1979–1999", "response": ["* Henry Priestman – keyboards"]}, {"page": "Lips Like Sugar", "response": ["*Henry Priestman - piano"]}, {"page": "Priestman", "response": ["* Henry Priestman (MP) (1647–1712), English politician", "* Henry Priestman (born 1955), musician"]}, {"page": "Brutality, Religion and a Dance Beat", "response": ["*Henry Priestman"]}, {"page": "List of people from Kingston upon Hull", "response": ["*Henry Priestman, record producer and singer/songwriter for the 1980s hit band The Christians."]}, {"page": "The Onset (album)", "response": ["Henry Priestman - organ (track 6)"]}, {"page": "Lo Fi Acoustic Excursions by Mike Badger & Friends", "response": ["* Henry Priestman - organ, keyboards (tracks 9, 11 and 14)"]}, {"page": "Lo Fi Electric Excursions by Mike Badger & Friends", "response": ["Henry Priestman - Hammond organ (tracks 1 and 14) "]}, {"page": "Mike Badger's Country Side", "response": ["Henry Priestman - accordion (track 9)"]}, {"page": "Longcroft School", "response": ["Founded and directed by Jonathan Chapman, the Longcroft Gospel Choir is well known in the local area, and regularly performs at parties, ceremonies, weddings and music concerts. The choir comprises students from Year 9 and above and has a large repertoire of music. Over the choir's period of existence, the choir has performed at venues such as Disneyland Paris and the Apple Store on Oxford Street, London, have released two of their own albums and have featured on a track by singer songwriter Henry Priestman. In May 2015, it was announced that the Longcroft Gospel Choir will be one of twenty choirs in the UK to perform at and open the 2015 Rugby World Cup in London performing for the home team (England)."]}, {"page": "Rob Lear", "response": ["His music has seen him tour the UK and Europe, including a residency at Liverpool’s Cavern Club, performances at Wembley Arena and playing support to Amy Wadge, Henry Priestman, Bernard Butler and Ian McCulloch. As a dedicated song-smith he has also been sought after to co-write songs from country to R&B, has co-written for UK X-Factor quarter-finalist Katie Waissel, Spanish electronic dance music artist Edge of Universe and electronic dance music trio, Lua Sonique. "]}, {"page": "Colour (The Christians album)", "response": ["All songs written and composed by Henry Priestman except where noted.", "* Henry Priestman – Keyboards, Guitar, Vocals"]}, {"page": "Stiff Records discography", "response": ["|Henry Priestman", "|Henry Priestman", "|Henry Priestman"]}, {"page": "I Can Never Go Home Anymore", "response": ["*David Wrench featured Henry Priestman released a version of the song on his 1998 EP David Wrench Sings the Songs of The Shangri-La's."]}, {"page": "The Best of The Christians", "response": ["#\"Forgotten Town\" (Henry Priestman)"]}]}}