{"wiki_id": "http://www.wikidata.org/entity/Q5734823", "itemLabel": "Herbert Knutton", "itemDescription": "English cricketer (1867-1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Knutton", "wikipedia_page": {"main": "Herbert John Knutton (14 June 1867 – 12 December 1946) was an English cricketer. Knutton was a right-handed batsman who bowled right-arm fast. He was born at Coventry, Warwickshire.\nKnutton made a single first-class appearance for Warwickshire against Nottinghamshire at Edgbaston in 1894. Nottinghamshire won the toss and elected to bat, making 238 in their first-innings, during which Knutton bowled twenty wicketless overs. Responding in their first-innings, Warwickshire made 248 all out, with Knutton being dismissed by Richard Hardstaff for 4 runs. In their second-innings, Nottinghamshire made 146 all out, during which he bowled six overs. Warwickshire reached 97/4 in their second-innings, at which point the match was declared a draw. It was in this same year that he first played in the Lancashire League for Enfield, making a single appearance for the club. The following season he also made another appearance for Enfield in the league, before making a third and final appearance for the club in 1903.The year previous to that Knutton had been playing in the Bradford League when he was selected to play a hastily arranged first-class fixture for an England XI (which contained one former Test player in Willie Quaife) against the touring Australians at Park Avenue, Bradford. The fixture had only come about after the Coronation of King Edward VII had been postponed after the King had developed appendicitis, allowing a fixture to be played on the day in which the King would have been crowned. Winning the toss and electing to bat first, the Australians made 402 all out in their first-innings. Knutton, who was the only fast bowler in the side, finished with figures of 9/100, including taking the first eight Australian wickets to fall: Trumper, Noble, Hill, Darling, Hopkins, Duff, Armstrong, and Carter, before taking the final wicket to fall, that of Saunders. Despite this, the Australians were still able to amass a large total, mostly down to Duff's 182. Responding in their first-innings, the England XI made 240 all out, with Knutton being dismissed by Noble for 8 runs. Forced to follow-on, the England XI were dismissed for 203, with Knutton contributing being dismissed for 5 runs by the same bowler. Requiring 41 for victory, the Australians reached their target with three wickets down, one of which (Darling's) fell to Knutton. He finished with match figures of 10/117. He never appeared in first-class cricket again, but did continue to play in the Bradford League, where he took thousands of wickets. However, his high-arm brisk bowling action was sometimes regarded as suspect.He worked outside of cricket as an athletic outfitter. He died at Heaton, Yorkshire, on 12 December 1946.", "link_mentions": [{"page": "List of Warwickshire County Cricket Club players", "response": ["* Herbert Knutton (1894) : H. J. Knutton (1)"]}, {"page": "Reginald Crawford (cricketer)", "response": ["The 1902 season was his best in first-class cricket. He made 852 runs at an average of 25.05 and took 40 wickets at 23.70. In late June and aged just 20, as the only amateur in the team, he was captain of what The Times referred to as \"a scratch side playing under the title of 'An England Eleven'\" in a \"hastily-arranged\" game with the Australian touring team at Bradford, put together because of the late postponement of the coronation of King Edward VII. The match, fairly easily won by the Australians, was notable for the bowling performance of Herbert Knutton, who had played one first-class match for Warwickshire in 1894 without taking a wicket and this time took nine Australian first-innings wickets for 100 runs, adding a tenth when the touring side needed just 42 to win; Knutton never played first-class cricket again. Crawford distinguished himself in the second England XI innings with a score of 90, his highest first-class score to date, \"a fine piece of hitting (which) saved the scratch side from the ignominy of an innings defeat\", The Times reported."]}]}}