{"wiki_id": "http://www.wikidata.org/entity/Q5735550", "itemLabel": "Herbert Sellars", "itemDescription": "British flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Sellars", "wikipedia_page": {"main": "Lieutenant Herbert Whiteley Sellars  (11 June 1896 – 15 May 1918) was a British World War I flying ace credited with eight aerial victories. On 21 March 1918, Sellars shot down and killed the German ace Ludwig Hanstein.", "link_mentions": [{"page": "No. 11 Squadron RAF", "response": ["No. 11 Squadron numbered 19 flying aces in its ranks during the war. Among them were Victoria Cross winner Lionel Rees, as well as Andrew Edward McKeever, future Air Commodore John Stanley Chick, Eugene Coler, Albert Ball VC, Frederick Libby, Ronald Maudit, John Quested, Herbert Sellars, Donald Beard, Stephen Price and Hugh Hay Thomas Frederick Stephenson."]}, {"page": "Sellars", "response": ["* Herbert Sellars (1896–1918), British First World War flying ace"]}, {"page": "Josef Mai", "response": ["By May 1918 Jasta 5 was sharing an airstrip with Jagdgeschwader 1, and as the \"Flying Circus\" re-equipped with new Fokker D.VIIs, Mai started flying a cast-off Fokker Dr.I triplane. He flew this triplane (Serial No. 139/17) for his next victory, over a pair of aces in a No. 11 Squadron Bristol F.2B. Pilot Lt Herbert Sellars was killed although Observer Lt. Charles Robson survived and taken prisoner. He claimed three victories with the Triplane."]}, {"page": "List of World War I aces credited with 8 victories", "response": ["|  style=\"background:#e3d9ff;\"|Herbert Sellars"]}, {"page": "Charles Robson (RAF officer)", "response": ["Robson was posted to No. 11 Squadron, and teamed with pilot Lieutenant Herbert Sellars, flying a Bristol F.2b two-seater fighter. He  gained his first aerial victory on 12 March 1918, shooting down in flames a LVG C.VI, and over the following six days drove down out of control three Albatros D.Vs. On 21 March he accounted for two more Albatros aircraft, the second being that of Leutnant Ludwig Hanstein, the Staffelführer of Jagdstaffel 35, who was killed. On 2 April 1918, the day after the Royal Flying Corps and the Royal Naval Air Service were merged to form the Royal Air Force, Robson drove down a Fokker Dr.I. His eighth and final victory came on 15 May, sharing in the driving down another Dr.I. However, shortly afterwards his aircraft was shot down by Vizefeldwebel Josef Mai of Jagdstaffel 5. Sellars was killed in the crash. Robson survived, but was taken prisoner."]}, {"page": "Ludwig Hanstein", "response": ["Hanstein scored his thirteenth victory on 12 November 1917 and scored twice more in January 1918. On 20 January 1918, he received the Knight's Cross with Swords of the House Order of Hohenzollern. He also temporarily relinquished command to Bruno Justinius on 20 January and went on leave. On 14 February 1918, while on leave, Hanstein received an award of the Military Merit Order, this time with Crown and Swords. He succeeded again to the command of the jasta on 4 March 1918, after Justinius was killed in action and his successor transferred. About ten minutes after scoring his final victory on 21 March 1918, Hanstein was killed in action by Herbert Sellars and his aerial observer Charles C. Robson. Sellars' combat report stated, \"I did a sharp turn to the left, my observer firing at 75 yards range into the nearest enemy aircraft, which burst into flames and was seen to crash north of Morchies."]}, {"page": "List of World War I flying aces from the British Empire", "response": ["* Herbert Sellars"]}, {"page": "List of aerial victories of Josef Mai", "response": ["| align=\"center\"| Ace Charles Robson POW; ace Herbert Sellars KIA"]}]}}