{"wiki_id": "http://www.wikidata.org/entity/Q5736436", "itemLabel": "Hercules Brabazon Brabazon", "itemDescription": "English painter (1821-1906)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hercules_Brabazon_Brabazon", "wikipedia_page": {"main": "Hercules Brabazon Brabazon (born Hercules Brabazon Sharpe; 27 November 1821 – 14 May 1906) was an English artist, accomplished in Turner-manner watercolours.", "link_mentions": [{"page": "Hercules (disambiguation)", "response": ["*Hercules Brabazon Brabazon (1821–1906), English artist"]}, {"page": "New English Art Club", "response": ["Historic NEAC members and exhibitors include: Thomas Kennington (founder member and first secretary), Prof Fred Brown (founder member), Frank Bramley (foundation member), Walter Sickert, William Orpen, Augustus John, Gwen John, Ambrose McEvoy, Philip Wilson Steer, Henry Tonks, James Whitelaw Hamilton, Alfred William Rich, James Dickson Innes, Margaret Preston, Charles Wellington Furse, Katie Edith Gliddon, William Rothenstein, Lindsay Bernard Hall, Thomas Cooper Gotch, Mary Sargant Florence, Henry Strachey, Clare Atwood, Evelyn Dunbar, Eve Garnett, Frank McEwen, James Jebusa Shannon, Cecil Mary Leslie, Mary Elizabeth Atkins, William Brown Macdougall, Neville Bulwer-Lytton, 3rd Earl of Lytton, Muirhead Bone, Robert Polhill Bevan, Dugald Sutherland MacColl, Neville Lewis, Charles Holmes, Carron O Lodge, Geoffrey Tibble, Alexander Mann, Hercules Brabazon Brabazon, Thomas Esmond Lowinsky, Frank Hughes, Albert Julius Olsson, Helen Margaret Spanton,Suffolk Painters: Suffolk Painters, accessdate: March 9, 2016 Margaret Green and Leslie Donovan Gibson."]}, {"page": "List of Old Harrovians", "response": ["*Hercules Brabazon Brabazon (1821–1906), 19th century artist"]}, {"page": "Hercules Brabazon", "response": ["#REDIRECT Hercules Brabazon Brabazon"]}, {"page": "Margaret Davies", "response": ["An amateur painter, Margaret shared Gwen's passion for collecting works by the Impressionists and other contemporary artists. She started the collection in 1906 with her purchase of a painting by Hercules Brabazon Brabazon. By 1913, the two sisters had accumulated enough paintings to host an exhibition at Cardiff City Hall."]}, {"page": "Brabazon", "response": ["* Hercules Brabazon Brabazon (1821–1906), English artist"]}, {"page": "Sir Norman Moore, 1st Baronet", "response": ["Through his mother Moore met Barbara Leigh Smith Bodichon, who in turn introduced him to artists and literary figures including Hercules Brabazon Brabazon, William De Morgan, the Rossettis Dante Gabriel, Christina, William Michael and Maria Francesca, Helen and William Allingham, George Eliot, and Mme Belloc and her children, Hilaire and Marie. Moore became involved with Bodichon's niece, Amy Leigh Smith, and proposed to her in 1876. Her parents objected at first, but eventually they were married on 30 March 1880 by Whitwell Elwin."]}, {"page": "List of people who adopted matrilineal surnames", "response": ["* Hercules Brabazon Brabazon, English artist, was born Hercules Brabazon Sharpe and adopted his mother's maiden name as his surname to inherit a family estate."]}]}}