{"wiki_id": "http://www.wikidata.org/entity/Q5734208", "itemLabel": "Herbert Gibson", "itemDescription": "British politician (1896-1954)", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Gibson", "wikipedia_page": {"main": "Herbert Mellor Gibson (22 February 1896 – 27 March 1954) was a member of the British co-operative movement and a Labour politician.\nGibson was the youngest of five children, who was brought up in poverty after his mother was widowed. He first gained employment as an office boy at Manchester Town Hall, and worked for many years in local government. He studied economics and political history at the Co-operative College, Holyoake House.\nAt the 1929 general election he was nominated as the Labour and Co-operative candidate for the Mossley constituency and successfully unseated the sitting MP, Austin Hopkinson. His membership of parliament was short-lived, and Hopkinson regained the seat at the next election in 1931.\nGibson continued his involvement with co-operatives, becoming a director of the Co-operative Wholesale Society in 1936, at the same time leaving the employment of the local council. He subsequently held the post of chairman of the English and Scottish Joint Co-operative Society, was a director of the Manchester Ship Canal Company. He was appointed a member of the Joint Industrial Council of the Soap, Candle and Edible Fats Industries and a director of the Colonial Development Corporation. He died in March 1954 aged 58.", "link_mentions": [{"page": "Denton, Greater Manchester", "response": ["| Herbert Gibson"]}, {"page": "Austin Hopkinson", "response": ["By the late 1920s, Hopkinson was expressing the hope that Stanley Baldwin would be elected as a free trader in order to save the country from David Lloyd George who had left the country open to socialism \"and its twin brother, protection\". He was again supported by the Conservatives in the 1929 general election, but in one of the shock results of the election, lost his seat by 5,029 votes to Herbert Gibson, the Labour candidate. Hopkinson kept up his contribution of articles expressing unorthodox thoughts to journals while out of Parliament, blaming the Wall Street Crash of 1929 on an American attempt to restrict imports."]}, {"page": "Mossley (UK Parliament constituency)", "response": ["| Herbert Gibson"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|Herbert Gibson"]}, {"page": "List of Labour Co-operative MPs", "response": ["| 1929 || Herbert Gibson|| Mossley", "* Herbert Gibson, Mossley, 1929–1931"]}, {"page": "Herbert Mellor Gibson", "response": ["#REDIRECT Herbert Gibson"]}, {"page": "Herbert Gibson (disambiguation)", "response": ["Herbert Gibson (1896–1954) was a British politician.", "Herbert Gibson may also refer to:", "*Sir Herbert Gibson, 1st Baronet, of Great Warley (1851–1932), English lawyer, president of the Law Society – see Gibson baronets", "*Sir Herbert Gibson, 1st Baronet, of Linconia and Faccombe (1863–1934), British-Argentinian merchant and agriculturist", "*George Herbert Gibson (1846–1921), Anglo-Australian writer of humorous ballads and verse"]}, {"page": "Gibson, Herbert", "response": ["#redirectHerbert Gibson"]}]}}