{"wiki_id": "http://www.wikidata.org/entity/Q5730579", "itemLabel": "Henry Wyndham Phillips", "itemDescription": "British portrait painter (1820-1868)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Wyndham_Phillips", "wikipedia_page": {"main": "Henry Wyndham Phillips (1820 – 8 December 1868) was a British artist and portrait painter. Although he produced and exhibited a small number of paintings of scriptural subjects early on in his career, he spent most of his life working as a portrait artist. He was born in London, the younger son of the portraitist Thomas Phillips, from whom he received most of his art tuition. When his father died in 1845, he bequeathed Henry all of his painting materials and the use of his painting rooms at 8, George Street, Hanover Square in central London, where Henry is believed to have lived for the rest of his life.He was a very popular and sought-after portrait artist. His commissions included the portraits of actor Charles Kean (as Louis XI) for the Garrick Club, Dr William Prout for the Royal College of Physicians, and Robert Stephenson for the Institution of Civil Engineers. Some of his works, including his portrait of the famous archaeologist, Austen Layard, were popular engravings. His works were exhibited at the Royal Academy and the British Institute from 1838 until his death in 1868.Phillips was a close friend of George Frederic Watts, with whom he was a founding member of London's Cosmopolitan Club (est. 1852), where he was also honorary secretary. He served as secretary of the Artists' General Benevolent Institution for thirteen years. He was also a captain in the Artists Rifles Volunteer Force, which he established in 1860 at his art studio along with fellow founding commander Frederic Leighton.He married the poet Susan K. Phillips (née Holdsworth) in 1856. He died suddenly on 8 December 1868, in Sydenham, Kent, and was buried at West Norwood Cemetery.", "link_mentions": [{"page": "Thomas Phillips", "response": ["Phillips died at 8 George Street, Hanover Square, London, on 20 April 1845, and was interred in the burial-ground of St. John's Wood chapel. He married Elizabeth Fraser of Fairfield, near Inverness. They had two daughters and two sons, the elder of whom, Joseph Scott Phillips, became a major in the Bengal artillery, and died at Wimbledon, Surrey, on 18 December 1884, aged 72. His younger son, Henry Wyndham Phillips (1820–1868) was a portrait painter, secretary of the \"Artists General Benevolent Institution\", and captain in the Artists' volunteer corps."]}, {"page": "Henry Phillips", "response": ["*Henry Wyndham Phillips (1820–1868), British portrait painter"]}, {"page": "Artists Rifles", "response": ["The regiment was established in 1859, part of the widespread volunteer movement which developed in the face of potential French invasion after Felice Orsini's attack on Napoleon III was linked to Britain.  The group was organised in London by Edward Sterling, an art student, and comprised various professional painters, musicians, actors, architects and others involved in creative endeavours; a profile it strove to maintain for some years. It was established on 28 February 1860 as the 38th Middlesex (Artists') Rifle Volunteer Corps, with headquarters at Burlington House. Its first commanders were the painters Henry Wyndham Phillips and Frederic Leighton. The unit's badge, designed by J. W. Wyon, shows the heads of the Roman gods Mars and Minerva in profile. Until 1914 the regimental full dress uniform was light grey with white facings, silver buttons and braid. This distinctive uniform dated from the regiment's foundation as a volunteer unit. After the First World War, standard khaki was the normal dress."]}, {"page": "Cosmopolitan Club (London)", "response": ["The Cosmopolitan Club in London, England, was a club which existed from 1852 to 1902. It met in rooms at 30 Charles Street, off Berkeley Square, which had previously been the studio of George Frederic Watts and then of Henry Wyndham Phillips."]}, {"page": "Susan K. Phillips", "response": ["Susan Katherine Phillips (1831–1897) was an English poet. She was born in 1831 in Aldborough, where her father, the Rev. George Kelly Holdsworth, was the vicar of the parish. In 1856 she was married to the painter Henry Wyndham Phillips. They lived for many years in Ripon, and often spent the summer months at Whitby. The fishermen of the Yorkshire coast she encountered at Whitby are the subject of many of her poems."]}, {"page": "Catalog of paintings in the Louvre Museum", "response": ["*Henry Wyndham Phillips (1820–1868), 1 artwork : RF 1156 (ID)"]}, {"page": "Henry W. Phillips", "response": ["#REDIRECT Henry Wyndham Phillips"]}, {"page": "Henry Phillips (artist)", "response": ["#REDIRECT Henry Wyndham Phillips"]}]}}