{"wiki_id": "http://www.wikidata.org/entity/Q5734336", "itemLabel": "Herbert Hamilton", "itemDescription": "British WWI flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Hamilton", "wikipedia_page": {"main": "Captain Herbert James Hamilton  (30 April 1895 – 13 June 1918) was a World War I flying ace credited with seven aerial victories.", "link_mentions": [{"page": "List of World War I aces credited with 7 victories", "response": ["| style=\"background:#e3d9ff;\"|Herbert Hamilton†"]}, {"page": "Harry Rigby (aviator)", "response": ["Rigby was commissioned in the Royal Flying Corps on 22 May 1916. He joined 40 Squadron on 1 August, but left a month later due to illness. Subsequently, he joined 1 Squadron on 2 February 1918, being promoted to captain shortly thereafter. Piloting a Royal Aircraft Factory S.E.5A, he scored his first victory on 13 March 1918, sharing it with fellow aces Percy Jack Clayson, Herbert Hamilton, William Patrick, Guy Borthwick Moore, and four other pilots. In the next two months, Rigby would singlehandedly rack up five more triumphs, the last being 11 May 1918. His final tally was one Albatros D.V set afire, two enemy planes destroyed, and three enemy fighters  sent down out of control. On 17 May, illness once again removed Rigby from duty."]}, {"page": "Guy Borthwick Moore", "response": ["Moore joined No. 1 Squadron RFC on 16 August 1917 as a Nieuport fighter pilot. He scored his first victory on 2 October, sharing it with fellow ace Herbert Hamilton. A week later, he tallied his fifth win to become an ace. Moore would score twice more with a Nieuport, on 17 December 1917 and 4 January 1918; then he would upgrade to a Royal Aircraft Factory SE.5a. He was also promoted to flight commander. He would use his new mount to cooperate in the destruction of a German Pfalz D.III on 13 March, sharing the win with Hamilton, Harry Rigby, Percy Jack Clayson, and four other pilots. On 28 March, Moore notched a double victory, sharing one of the wins with Francis Magoun. A summary of Moore's record shows six enemy airplanes destroyed (two of which were shared wins), and four driven down out of control (one of which was shared).The Aerodrome website  Retrieved 25 February 2010.Above the Trenches: a Complete Record of the Fighter Aces and Units of the British Empire Air Forces 1915–1920, p. 285."]}, {"page": "Reginald Maxwell (RAF officer)", "response": ["He scored his first aerial victory on 27 April 1916, forcing a German Aviatik two-seater reconnaissance aircraft to land at Herlies. He then transferred to No. 20 Squadron, and still using a FE.2b, scored three more times; for two of those wins, he had future aces riding as his observers, in Herbert Hamilton and David Stewart. He was also appointed a flight commander, effective 11 May 1916, with a concomitant temporary promotion to captain. On 18 December 1916 Maxwell was appointed a squadron commander with the temporary rank of major, and on 1 January 1917 he was awarded the Military Cross in the New Years Honours."]}, {"page": "List of World War I flying aces from the British Empire", "response": ["* Herbert Hamilton"]}]}}