{"wiki_id": "http://www.wikidata.org/entity/Q5733526", "itemLabel": "Herbert Bainbridge", "itemDescription": "English cricketer (1862-1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Bainbridge", "wikipedia_page": {"main": "Herbert William Bainbridge (29 October 1862 – 3 March 1940) was an English first-class cricketer and footballer. Bainbridge played cricket principally for Eton, Marylebone Cricket Club (MCC), Surrey, Cambridge University and Warwickshire. He was born at Guwahati, Assam, India and died at Leamington Spa, Warwickshire, England.", "link_mentions": [{"page": "England cricket team", "response": ["England won the 1890 Ashes series 2–0, with the third match of the series being the first Test match to be abandoned. England lost 2–1 in the 1891–92 series, although England regained the urn the following year. England again won the 1894–95 series, winning 3–2 under the leadership of Andrew Stoddart. In 1895–96, England played South Africa, winning all Tests in the series. The 1899 Ashes series was the first tour where the MCC and the counties appointed a selection committee. There were three active players: Grace, Lord Hawke and Warwickshire captain Herbert Bainbridge. Prior to this, England teams for home Tests had been chosen by the club on whose ground the match was to be played. England lost the 1899 Ashes series 1–0, with Grace making his final Test appearance in the first match of the series."]}, {"page": "1883 FA Cup Final", "response": ["|FW ||   || Herbert Bainbridge"]}, {"page": "East of England cricket team", "response": ["* Herbert Bainbridge (1892)"]}, {"page": "List of Warwickshire County Cricket Club players", "response": ["* Herbert Bainbridge (1894–1902) : H. W. Bainbridge (118)"]}, {"page": "List of Gentlemen cricketers (1841–1962)", "response": ["* Herbert Bainbridge (1885–1895)"]}, {"page": "List of Marylebone Cricket Club players (1864–1894)", "response": ["* Herbert Bainbridge (1883–1887) : H. W. Bainbridge (Surrey)"]}]}}