{"wiki_id": "http://www.wikidata.org/entity/Q573174", "itemLabel": "Anthony Durnford", "itemDescription": "British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Durnford", "wikipedia_page": {"main": "Lieutenant-Colonel Anthony William Durnford (24 June 1830 – 22 January 1879) was an Irish career British Army officer of the Royal Engineers who served in the Anglo-Zulu War. Breveted colonel, Durnford is mainly known for his defeat by the Zulus at the Battle of Isandlwana, which was a disaster for the British Army.", "link_mentions": [{"page": "January 22", "response": ["*1879 – Anthony Durnford, Irish colonel (b. 1830)"]}, {"page": "Battle of Rorke's Drift", "response": ["Captain Thomas Rainforth's G Company of the 1st/24th Foot was ordered to move up from its station at Helpmekaar,  to the southeast, after its own relief arrived, to further reinforce the position. Later that evening a portion of the No. 2 Column under Brevet Colonel Anthony Durnford, late of the Royal Engineers, arrived at the drift and camped on the Zulu bank, where it remained through the next day."]}, {"page": "Battle of Isandlwana", "response": ["Lord Chelmsford, the Commander-in-Chief of British forces during the war, initially planned a five-pronged invasion of Zululand consisting of over 16,500 troops in five columns and designed to encircle the Zulu army and force it to fight as he was concerned that the Zulus would avoid battle, slip around the British and over the Tugela, and strike at Natal. Lord Chelmsford settled on three invading columns, with the main centre column now consisting of some 7,800 men – comprising the previously called No. 3 Column, commanded by the Colonel of the 24th Richard Thomas Glyn,https://www.anglozuluwar.com/images/Journal_4/2)_Col_Glyn_-_BB.pdf and Colonel Anthony Durnford's No. 2 Column,Colenso, pp. 263–64 gives 7,800: 1752 Imperial and Colonial troops and 6,054 Native Contingent and 377 Conductors and Drivers for the No. 2 Column under Durnford and the No. 3 Column under Glyn which made up Chelmsford's Main Column. The strength of the entire invasion force is given as a total of 16,506 for the five columns: 6,669 Imperial and colonial troops: 9,035 troops in the native contingent; 802 Drivers, etc. under his direct command. He moved his troops from Pietermaritzburg to a forward camp at Helpmekaar, past Greytown. On 9 January 1879 they moved to Rorke's Drift, and early on 11 January commenced crossing the Buffalo River into Zululand.", "The backbone of the British force under Lord Chelmsford consisted of twelve regular infantry companies: six each of the 1st and 2nd Battalions, 24th Regiment of Foot (2nd Warwickshire Regiment), which were hardened and reliable troops.The 24th Foot was an historically hard-fighting if hard-luck regiment. In 1741 it suffered heavy casualties at Cartagena; during the Seven Years' War it surrendered to the French at the Siege of Minorca in 1756 and was present at the defeat in the Battle of Saint Cast; it was surrendered at Saratoga by Burgoyne in 1777; it was captured at sea by the French in 1810; it suffered over 50 percent casualties at the Battle of Chillianwalla in 1846. Its depot was moved to Brecon in Wales in 1873 and so, by 1879, about 30% of the recruits were Welsh. In addition, there were approximately 2,500 local African auxiliaries of the Natal Native Contingent, many of whom were exiled or refugee Zulu. They were led by European officers, but were considered generally of poor quality by the British as they were prohibited from using their traditional fighting technique and inadequately trained in the European method as well as being indifferently armed. Also, there were some irregular colonial cavalry units, and a detachment of artillery consisting of six field guns and several Congreve rockets. cite is only for the Congreve rocket battery Adding on wagon drivers, camp followers and servants, there were around 4,700 men in the No. 3 Column, and around 3,100 men in the No. 2 Column that comprised the main centre column. Colonel Anthony Durnford took charge of No. 2 Column with orders to stay on the defensive near the Middle Drift of the Thukela River.Colenso, pp. 263, 1747: Imperial and Colonial Troops, 2,566 Native Contingent, 293 Drivers Because of the urgency required to accomplish their scheme, Bartle Frere and Chelmsford began the invasion during the rainy season. This had the consequence of slowing the British advance to a crawl.Colenso, pp. 264–66, 273, Chelmsford, 16 January: \"No.3 Column cannot move forward eight miles ... for at least four days ...\"", "Around 10:30 am, Colonel Anthony Durnford, whose left arm was paralyzed from the Xhosa War, arrived from Rorke's Drift with 500 men of the Natal Native Contingent and a rocket battery of the No. 2 Column to reinforce the camp at Isandlwana. This brought the issue of command to the fore because Durnford was senior and by tradition should have assumed command.Pulleine's rank was brevet lieutenant colonel; in other words he was still being paid as a major. However, he did not over-rule Pulleine's dispositions and after lunch he quickly decided to take the initiative and move forward to engage a Zulu force which Pulleine and Durnford judged to be moving against Chelmsford's rear. Durnford asked for a company of the 24th, but Pulleine was reluctant to agree since his orders had been specifically to defend the camp.", "Commanding Officer: Brevet Colonel Anthony Durnford, RE"]}, {"page": "Zulu Dawn", "response": ["* Burt Lancaster as Colonel Anthony Durnford"]}, {"page": "Siege of Eshowe", "response": ["Pearson continued his march unhindered and the following day reached the mission fort near Eshowe at ,  above sea level. Eshowe consisted of a deserted church, school and the house of a Norwegian missionary. Low hills surrounded it about a quarter of a mile away to the north, east and west but to the south the Indian Ocean could be seen. Pearson sent a group of empty wagons with escorts to collect fresh supplies from the Lower Drift, while the rest of his force began to dig in. The next day, 24 January, bore a disturbing message for Pearson that Colonel Anthony Durnford's No. 2 Column had been wiped out in the Middle Drift, leaving the Lower Drift behind Eshowe in grave danger. If the Zulus took the lower drift, Eshowe would be cut off and there would be nothing between the Zulu Army and Natal."]}, {"page": "Henry Pulleine", "response": ["Following a reconnaissance by Major John Dartnell and units of the column's irregular cavalry on the 21st, which suggested the Zulus were present in force to the South of the camp, Chelmsford ordered an advance with approximately half the column on the morning of the 22nd. In accordance with his original vision of the campaign, his intention was to bring the enemy to battle, ending the war quickly by destroying the Zulu force in a set-piece engagement. Chelmsford's last act regarding the defence of Isandlwana was to order up troops under Lieutenant-Colonel Anthony Durnford from Rorke's Drift. With the 1st Battalion of the 24th being left in camp, Pulleine took over command of Isandlwana on the morning of 22 January."]}, {"page": "Flashman and the Tiger", "response": ["*Anthony Durnford - Lieutenant colonel at the Battle of Isandlwana."]}, {"page": "Caroline Mary Luard", "response": ["Charles Edward Luard, born in Edinburgh in 1837, was twelve years older than his wife. At the time of his birth his father, Tommy Luard, was a Captain in the Royal Artillery. Like many in his family, Luard was a professional fisherman and had retired with the rank of Major-General in the Royal Engineers. He had done so despite an incident during his career that might have ruined his chances of promotion. This related to the defeat of British forces by the Zulu at the Battle of Isandhlwana in 1889, a reversal that was largely blamed on Colonel Anthony Durnford. However, it was rumoured that Durnford's orders had been stolen from his body after the battle, in order to absolve Lieutenant-General Frederic Thesiger, 2nd Baron Chelmsford and other senior officers of incompetence."]}, {"page": "Anthony William Durnford", "response": ["#REDIRECT Anthony Durnford"]}, {"page": "Durnford", "response": ["* Anthony Durnford, British Army officer"]}, {"page": "Langalibalele", "response": ["thumb|180px|left|Anthony Durnford in 1870."]}, {"page": "Finished (novel)", "response": ["It is set against the background of the Anglo-Zulu War of 1879, covering events leading up to the war, and ending with the death of Cetewayo. Quatermain is depicted as being one of the few survivors of the Battle of Isandhlwana. Like others in the series, several real-life characters appear, such as Cetewayo and Anthony Durnford."]}, {"page": "Frances Colenso", "response": ["Lt Colonel Anthony Durnford was stationed at Pietermaritzburg in 1873 where he was befriended by her father. Durnford had a close relationship with Colenso. Though Durnford and his wife lived separate lives, the fact that he was married meant that he and Frances could only be close friends.J. P. C. Laband, ‘Durnford, Anthony William (1830–1879)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, May 2008 accessed 2 Jan 2017 After Durnford's death at the Battle of Isandlwana, Frances wrote a book with his brother exculpating him from responsibility for that British defeat by the Zulus."]}, {"page": "Durnford, Anthony", "response": ["#redirectAnthony Durnford"]}, {"page": "Natal Border Guard", "response": ["The British invasion force crossed into Zululand on 11 January 1879 in three columns.  At the outset of the war the Border Guard in the Sand Spruit Valley near to Umsinga were under the command of British Colonel Anthony Durnford who was tasked with defending the border at this location.  Durnford was soon, however, ordered to move up to the border crossing at Rorke's Drift in support of Chelmsford's no. 3 column.  On 22 January he was ordered to bring his men (not including the Border Guard) to the British camp at Isandlwana, within Zululand.  Durnford and his men were wiped out in the British defeat at the Battle of Isandlwana later that day."]}, {"page": "Natal Native Pioneer Corps", "response": ["Chelmsford, guided by the commander of No. 2 Column Anthony Durnford - a seasoned South African campaigner, raised a force of pioneers from the black subjects of Natal. This was a development of the Natal government's isiBhalo levy system by which for years men had been pressed into duty to carry out road repairs. Durnford took the best men from the Natal Native Contingent (NNC), which had been raised as an auxiliary fighting force, to form the Natal Pioneers."]}, {"page": "Natal Mounted Police", "response": ["The Natal Mounted Police saw little action until the Zulu War of 1879 when it was attached to the British Army as part of the Colonial mounted force and entered into the Zulu Kingdom with the Central Column under the command of Lord Chelmsford. One detachment of 97 men of the NMP led by Major Dartnell was sent to find the location of the Zulu army of Cetshwayo kaMpande while the second detachment of 34 men fought in the Battle of Isandlwana on 22 January 1879. Of this second detachment 25 were killed in the battle with 21 killed fighting alongside 19 Natal Carbineers in a 'last stand' defending Lieutenant-Colonel Anthony Durnford. Three men of the NMP escaped from Isandlwana and made their way to Rorke's Drift where they fought in the Battle of Rorke's Drift, where one of them, Sidney Hunter, was killed in action.Kenneth Darwin (ed), Familia 1991: Ulster Genealogical Review, Number 7- Google Books p. 44UK, Military Campaign Medal and Award Rolls, 1793-1949: Africa, South Africa 1877-1879, Colonial Corps - Ancestry.com  The first detachment of the NMP under Dartnell returned to Isandlwana on the evening of the battle where they spent the night among the ruins of the camp and the bodies of their colleagues before accompanying Lord Chelmsford's relief column on its advance to Rorke's Drift early the next morning. When Sir Garnet Wolseley arrived in Durban in July 1879 to supersede Lord Chelmsford as commander of the forces in the Zulu War and as Governor of Natal and the Transvaal and the High Commissioner of Southern Africa the Natal Mounted Police provided his escort during his visit to Zululand in the final days of the War."]}, {"page": "John Dartnell", "response": ["The second detachment of 34 men of the Natal Mounted Police Dartnell had left behind fought in the Battle of Isandlwana on 22 January 1879. Of this second detachment 25 were killed in the battle with 21 killed fighting alongside 19 Natal Carbineers in a 'last stand' defending Lieutenant-Colonel Anthony Durnford. Three men of the NMP escaped from Isandlwana and made their way to Rorke's Drift where they fought in the Battle of Rorke's Drift, where one of them, Sidney Hunter, was killed in action.Kenneth Darwin (ed), Familia 1991: Ulster Genealogical Review, Number 7- Google Books p. 44UK, Military Campaign Medal and Award Rolls, 1793-1949: Africa, South Africa 1877-1879, Colonial Corps - Ancestry.com  The first detachment of the NMP under Dartnell returned to Isandlwana on the evening of the battle where they spent the night among the ruins of the camp and the bodies of their colleagues before accompanying Lord Chelmsford's relief column on its advance to Rorke's Drift early the next morning."]}, {"page": "Burt Lancaster filmography", "response": ["|Colonel Anthony Durnford"]}]}}