{"wiki_id": "http://www.wikidata.org/entity/Q5733474", "itemLabel": "Herbert Armitage James", "itemDescription": "Headmaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Armitage_James", "wikipedia_page": {"main": "Herbert Armitage James, CH (3 August 1844 – 15 November 1931) was a Welsh cleric and headmaster of three leading public schools, who ended his \"remarkable scholastic career\", as it was later described by Austen Chamberlain, by becoming President of St John's College, Oxford. After an Oxford education and early teaching career at Marlborough College, he was headmaster of Rossall School from 1875 to 1886. It was said that he raised the school \"to a pitch of all-round excellence which it had not known before\". After suffering from health problems at Rossall, he served as Dean of St Asaph from 1886 to 1889.  He returned to teaching in 1889, becoming headmaster of Cheltenham College and remaining in this post until 1895, despite being offered the position of headmaster of Clifton College.  He then became headmaster of Rugby School and served there to great acclaim.  His Rugby School nickname of \"The Bodger\" is still in use at the school. He left Rugby School in 1909 to become President of St John's College, Oxford, a position he held until his death 22 years later.\nHe was a highly respected teacher and preacher, being described as one of the best preachers of his day.  He was widely praised for his work at Rossall, Cheltenham, Rugby and St John's. He was made a member of the Order of the Companions of Honour by King George V in 1926. At a dinner in his honour held to mark this award, attended by over 200 friends and former students, he was described by Austen Chamberlain (the Secretary of State for Foreign Affairs) as \"one of the greatest and most forceful characters who had ever devoted himself to education\". The Lord Chancellor, Viscount Cave, also spoke at the dinner to praise James's directness in his opinions and decisions, his weighty judgment, his high character and his kindly nature.", "link_mentions": {}}}