{"wiki_id": "http://www.wikidata.org/entity/Q5733734", "itemLabel": "Herbert Butcher", "itemDescription": "British politician (1901-1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Butcher", "wikipedia_page": {"main": "Sir Herbert Walter Butcher, 1st Baronet (12 June 1901 – 11 May 1966) was an English Conservative and National Liberal\npolitician.  He sat in the House of Commons from 1937 to 1966.\nButcher was the son of Frank Butcher.  He was educated at Hastings Grammar School, and served in the Royal Navy during World War I, from 1916 to 1919.  He was as a Hackney Borough Councillor from 1928 to 1961, serving as Mayor of Hackney from 1935 to 1937.He was elected as the Member of Parliament (MP) for Holland with Boston at a by-election in June 1937, after the death of the National Liberal MP Sir James Blindell. He held the seat at the next six general elections until his retirement at the 1966 general election, when Richard Body was elected as his successor.\nFrom 1950 to 1951, Butcher was Parliamentary Private Secretary (PPS) to the Civil Lord of the Admiralty, Walter \"Stoker\" Edwards.  after serving as a Lord of the Treasury from 1951 to 1953. In 1958, he advised his friend and parliamentary colleague John Poulson to set up a servicing company to win business for his architect's practice.\nHaving been knighted on 10 February 1953, Butcher was created a Baronet of Holland in the County of Lincoln on 22 July 1960.After 29 years as an MP, Butcher died less than two months after his retirement, aged 64.", "link_mentions": [{"page": "List of MPs elected in the 1945 United Kingdom general election", "response": ["|Herbert Butcher"]}, {"page": "List of MPs elected in the 1950 United Kingdom general election", "response": ["|Herbert Butcher"]}, {"page": "Ark Alexandra Academy", "response": ["* Sir Herbert Butcher, National Liberal MP for Holland with Boston from 1937–1966"]}, {"page": "John Poulson", "response": ["In 1958, the National Liberal MP Sir Herbert Butcher advised his friend Poulson to set up a servicing company to win business for his architect's practice. Poulson established Ropergate Services Ltd., named after the street in Pontefract where he was based. This company also had the advantage of reducing Poulson's tax liability considerably. In the late 1950s, there was a building boom as many local authorities embarked on major building schemes."]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|Herbert Butcher"]}, {"page": "Speaker Denison's rule", "response": ["|Temporary Chairman Herbert Butcher"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| Herbert Butcher"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| Herbert Butcher"]}, {"page": "List of MPs elected in the 1964 United Kingdom general election", "response": ["| Sir Herbert Butcher"]}, {"page": "Third Churchill ministry", "response": ["|Herbert Butcher||7 November 1951 – 3 July 1953||Knighted"]}, {"page": "List of United Kingdom by-elections (1931–1950)", "response": ["|Herbert Butcher"]}, {"page": "List of National Liberal Party (UK, 1931) MPs", "response": ["| Herbert Butcher || Holland with Boston || 1937 || 1966"]}, {"page": "Holland with Boston (UK Parliament constituency)", "response": ["|rowspan=\"2\"| Sir Herbert Butcher", "*Liberal National: Herbert Butcher"]}, {"page": "Donald Wade, Baron Wade", "response": ["In July 1962, Wade sponsored a drinks reception at the House of Commons on behalf of a whisky company, having been asked to by former Liberal MP and public relations consultant Frank Owen. Sir Herbert Butcher, chairman of the Kitchen Committee, expressed his concern that the facilities of the House were being used on behalf of public relations companies."]}, {"page": "James Blindell", "response": ["At the consequent 1937 Holland with Boston by-election, Herbert Butcher held the seat for the National Liberals."]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Sir Herbert Butcher, 1st Baronet; MP for Holland with Boston (1950–1966) "]}, {"page": "Chief Whip of the Liberal Democrats", "response": ["|Herbert Butcher (knighted in 1953; created a Baronet in 1960)"]}, {"page": "List of Lords Commissioners of the Treasury", "response": ["**Herbert Butcher", "**Herbert Butcher"]}, {"page": "Robert Pattinson (politician)", "response": ["Pattinson stood unsuccessfully for Lincoln at the general election in 1929. In 1937 he was suggested as a possible National government candidate at the Holland with Boston by-election. As a well-known local man he was thought to be an acceptable candidate to both local Liberal and Conservative Associations. In fact he was reported to be the preferred candidate of the local Conservatives.The Times,31 May 1937 The by-election was caused by the death of the sitting MP, Sir James Blindell. He had captured the seat for the Liberals in a by-election in 1929 and had later joined the Liberal Nationals. In the end Herbert Butcher of Peterborough, Chairman of the East Midlands Liberal National Area Council was chosen as the National Government candidate.The Times, 22 May 1937 Pattinson himself later formally joined the Liberal Nationals.The Times, 23 June 1938, 10 December 1938"]}, {"page": "Butcher (surname)", "response": ["*Herbert Butcher, British politician and Member of Parliament"]}, {"page": "Herbert Walter Butcher", "response": ["#REDIRECT Herbert Butcher "]}, {"page": "Sir Herbert Butcher, 1st Baronet", "response": ["#REDIRECT Herbert Butcher "]}, {"page": "Sir Herbert Walter Butcher, 1st Baronet", "response": ["#REDIRECT Herbert Butcher "]}, {"page": "Sir Herbert Walter Butcher", "response": ["#REDIRECT Herbert Butcher "]}, {"page": "Sir Herbert Butcher", "response": ["#REDIRECT Herbert Butcher"]}, {"page": "National Liberal Party (UK, 1931)", "response": ["After 1962, the party lacked a senior government presence,See Night of the Long Knives (1962) and with the retirement or death of former leaders, only six with the National Liberal label were elected in the general election of 1964. A further four who had sat with this label preferred to be elected under a 'straight' Conservative label. The post of chairman of the parliamentary party was filled by the former junior minister David Renton, the MP for Huntingdon since 1945, with veteran National Liberal Herbert Butcher (who sat for the seat of Holland with Boston) remaining their chief whip. Butcher retired before the 1966 general election, in which the National Liberals were reduced to just three MPs (including the future Conservative Party cabinet minister John Nott). Two others (Joan Vickers and John Osborn) were elected as Conservatives. With so few MPs, they agreed to give up to the Liberal party a room at the Westminster Parliament that they had used for their meetings."]}, {"page": "Deaths in May 1966", "response": ["* Sir Herbert Butcher, 1st Baronet, English politician, MP (b. 1901)"]}]}}