{"wiki_id": "http://www.wikidata.org/entity/Q5735145", "itemLabel": "Herbert Naylor-Leyland", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Naylor-Leyland", "wikipedia_page": {"main": "Sir Herbert Scarisbrick Naylor-Leyland, 1st Baronet (24 January 1864 – 7 May 1899), was a British politician.", "link_mentions": [{"page": "Southport (UK Parliament constituency)", "response": ["| style=\"background-color: \" | || 1898 by-election || Sir Herbert Naylor-Leyland || Liberal"]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| Herbert Naylor-Leyland "]}, {"page": "Naylor-Leyland baronets", "response": ["The Naylor-Leyland Baronetcy, of Hyde Park House, Albert Gate, in the County of London, is a title in the Baronetage of the United Kingdom. It was created on 31 August 1895 for Herbert Naylor-Leyland, Conservative Member of Parliament for Colchester from 1892 to 1895 and Liberal Member of Parliament for Southport from 1898 to 1899. The second Baronet served as Sheriff of Denbighshire in 1921.", "*Sir Albert Edward Herbert Naylor-Leyland, 2nd Baronet (6 December 1890 – 23 September 1952), a godson of King Edward VII\"NAYLOR-LEYLAND'S MAJORITY.; Baronet and His Mother Entertain Large Party at Nantclwyd.\"  (abstract) The New York Times, 17 December 1911. Retrieved 8 May 2008"]}, {"page": "Sir Herbert Naylor-Leyland, 1st Baronet", "response": ["#REDIRECT Herbert Naylor-Leyland"]}, {"page": "Sir Albert Naylor-Leyland, 2nd Baronet", "response": ["Sir Albert Edward Herbert Naylor-Leyland, 2nd Baronet (6 December 1890–23 September 1952) was an English aristocrat, diplomat and public official.", "Albert Edward Herbert Naylor-Leyland was born on 6 December 1890.The Peerage: Sir Albert Edward Herbert Naylor-Leyland, 2nd Bt. His father was Sir Herbert Scarisbrick Naylor-Leyland, 1st Baronet (1864–1899), who served as Member of Parliament for Colchester from 1892 to 1895 and for Southport from 1898 to 1899.Lady Mary, 'Sir Albert Naylor-Leyland , Whose Mother Was Cleveland Girl, Had Two Royal Godfathers', Milwaukee Journal Sentinel, 7 January 1912  His mother was Jeanie Willson Chamberlain, daughter of Mr and Mrs William Selah Chamberlain of Cleveland, Ohio. He had a brother, George Vyvyan Naylor-Leyland (1892–1914), who was killed in action during the First World War. He grew up at his paternal family residence of Nantclwyd Hall, a Grade II listed mansion in Llanelidan, Denbighshire, Wales. King Edward VII (1841–1910) was his godfather."]}, {"page": "Nantclwyd Hall", "response": ["The house became the country seat of the Naylor-Leyland baronets, being the private residence of Herbert Naylor-Leyland (1864–99), followed by his son Albert Naylor-Leyland, 2nd Baronet (1890–1952)."]}]}}