{"wiki_id": "http://www.wikidata.org/entity/Q5741665", "itemLabel": "Hermione Cockburn", "itemDescription": "British television and radio presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Hermione_Cockburn", "wikipedia_page": {"main": "Hermione Anne Phoebe Cockburn  (born 1973, Sussex, England) is a British television and radio presenter specialising in scientific and educational programmes. She is currently Scientific Director at Our Dynamic Earth.", "link_mentions": [{"page": "Cuckfield", "response": ["* Hermione Cockburn (born 1973) – Geologist and broadcaster, was brought up in the village"]}, {"page": "Rough Science", "response": ["This series, shown in 2005, takes place in the San Juan Mountains in Colorado. For this series, geomorphologist Hermione Cockburn replaced Kathy Sykes."]}, {"page": "Roedean School", "response": ["*Hermione Cockburn, broadcaster"]}, {"page": "Coast (TV series)", "response": ["*Hermione Cockburn (series 2–) — general"]}, {"page": "Beeston Regis", "response": ["During the World War II Beeston Bump was the location for one of the network of Signals Intelligence collection sites: Y-stations. These stations collected material to be passed to the War Office's Government Code & Cypher School at Bletchley Park. There were several of these stations around the east coast and by triangulating the signals, the exact location of enemy shipping could be pinpointed. In an episode of the BBC1 series Coast,BBC – Coast the technique was explained and demonstrated. In the same programme, Joy Hale was interviewed by the presenter, Hermione Cockburn. Hale had been a Wren and an operator at the Y-station."]}, {"page": "Richard Wiseman", "response": ["* \"Richard Wiseman's Beginners Guide to... the Earth\"  with earth scientist and broadcaster Hermione Cockburn (BBC)."]}, {"page": "Cockburn (surname)", "response": ["*Hermione Cockburn, British presenter"]}, {"page": "BBC Natural History Unit filmography", "response": ["| Fossil Detectives || 2008 || An eight-part series in which Open University associate lecturer Dr. Hermione Cockburn leads a team of fossil experts and geologists around different regions of Britain to search for fossil treasures and mysteries. || Dr. Hermione Cockburn (presenter) || No || No"]}, {"page": "Fossil Detectives", "response": ["Fossil Detectives is a 2008 BBC Television documentary series in which presenter Hermione Cockburn travels across Great Britain exploring fossil sites and discovering the latest scientific developments in geology and palaeontology. The show is a spin-off of Coast.", "*Dr. Hermione Cockburn – Open University Associate Lecturer"]}, {"page": "Hermione (given name)", "response": ["*Hermione Cockburn (born 1973), British TV and radio presenter"]}, {"page": "Beeston Hill Y Station", "response": ["In an episode of the BBC1 series “Coast”,BBC - Coast the triangulation technique was explained and demonstrated. In the same programme, Joy Hale was interviewed by the presenter, Hermione Cockburn. Hale had been a WREN during the war and had been an operator at the Y-station."]}, {"page": "Christmas University Challenge", "response": ["| Hermione Cockburn"]}, {"page": "List of people from Sussex", "response": ["* Hermione Cockburn (born 1973), television and radio presenter"]}]}}