{"wiki_id": "http://www.wikidata.org/entity/Q5744285", "itemLabel": "Herschel Gluck", "itemDescription": "rabbi", "wikipedia_url": "https://en.wikipedia.org/wiki/Herschel_Gluck", "wikipedia_page": {"main": "Rabbi Herschel Gluck OBE is a British Rabbi, president of Shomrim in Stamford Hill, chairman of the Arab-Jewish Forum and chairman and founder of the Muslim-Jewish Forum. Established in 2000, the Muslim-Jewish Forum was the first of its type in the world. It deals with a broad range of issues which are of concern to both communities and also serves a role in preventing and defusing tensions.Gluck's role as a mediator is not confined to the domestic arena. He has also been heavily involved for some time with the Next Century Foundation, through which he has played a significant role as a mediator in conflicts as diverse as the Sudan and Former Yugoslavia.Gluck was appointed Officer of the Order of the British Empire (OBE) in the 2013 New Year Honours for services to interfaith understanding.After Joe Lobenstein died on 28 June 2015, aged 88, Gluck was appointed as the new President of the Stamford Hill Shomrim, a Jewish volunteer Neighbourhood Patrol Group.", "link_mentions": [{"page": "Glück", "response": ["* Herschel Gluck, British rabbi"]}, {"page": "Shomrim (neighborhood watch group)", "response": ["Stamford Hill Shomrim is currently headed by three Trustees, a Discipline Committee and an Executive Committee elected by its members. Rabbi Kurt Stern MBE and Isaac Kornbluh who are both members of the Hackney Police Independent Advisory Group, act as liaisons between Shomrim and the police. In 2012, Joe Lobenstein MBE, formerly elected Mayor of Hackney on 4 consecutive elections, was appointed as President of Stamford Hill Shomrim. After Joe Lobenstein died on 28 June 2015, aged 88, Rabbi Herschel Gluck OBE was appointed as the new President of Stamford Hill Shomrim. Shomrim is registered with the Charity Commission and with Neighbourhood Watch as 'Community Safety Patrol'."]}, {"page": "2013 New Year Honours", "response": ["* Rabbi Herschel Gluck – Founder, Muslim-Jewish Forum. For services to Interfaith Understanding."]}, {"page": "Herschel (name)", "response": ["* Herschel Gluck, British rabbi"]}, {"page": "Antisemitism in the UK Labour Party", "response": ["After an Israeli rabbi was attacked whilst visiting London in November 2019, Corbyn phoned Rabbi Herschel Gluck, chairperson of Jewish neighbourhood watch organisation Shomrim, to express his concern for and empathy with the community. He tweeted that \"We must stop this scourge of antisemitism\". Gluck commented that the community appreciated Corbyn's concern and that Corbyn was the only party leader who called."]}, {"page": "Uyghur genocide", "response": ["In December 2020, the Chief Rabbi of the United Hebrew Congregations of the Commonwealth Ephraim Mirvis published an op-ed in The Guardian on the occasion of Hanukkah in which he condemned the persecution of the Uyghurs and called for international action to address the \"unfathomable mass atrocity\" taking place in China. The Chief Rabbi generally refrains from making comments on non-Jewish political issues. Mirvis is part of a wider Jewish protest movement which has sprung up in opposition to the human rights abuses in Xinjiang, protesters are largely motivated by memories of the Holocaust and a desire to prevent a repeat of that horror. In addition to liberal British Jews who have long been involved in international human rights issue the plight of the Uyghur also draws significant interest and support from Britain's Orthodox community. According to Orthodox Rabbi Herschel Gluck \"This is something that is felt very deeply by the community. They feel that if 'Never again' is a term that needs to be used, this is certainly one of the situations where it applies.\""]}]}}