{"wiki_id": "http://www.wikidata.org/entity/Q5748328", "itemLabel": "Hew Dalrymple Fanshawe", "itemDescription": "British general 1860-1957", "wikipedia_url": "https://en.wikipedia.org/wiki/Hew_Dalrymple_Fanshawe", "wikipedia_page": {"main": "Lieutenant-General Sir Hew Dalrymple Fanshawe,  (30 October 1860 – 24 March 1957) was a British Army general of the First World War, who commanded V Corps on the Western Front and the 18th Indian Division in the Mesopotamian campaign. He was one of three brothers (Edward, Hew, and Robert) who all rose to command divisions or corps during the war.\nFanshawe joined the 19th Hussars in 1882, and after seeing active duty in North Africa became the aide-de-camp to Sir Evelyn Wood VC, a prominent senior officer; he later married Wood's eldest daughter. He served with his regiment during the Boer War, and then commanded a cavalry regiment, followed by brigades in the Home Forces and in India.\nFollowing the outbreak of the First World War, Fanshawe commanded a cavalry division and then the Cavalry Corps in France, before assuming command of V Corps in late 1915. He was removed from command in mid-1916, however, as a result of political manoeuvring following the attempt to find a scapegoat for the failed Actions of St Eloi Craters in March 1916. He later commanded the 18th Indian Division in Mesopotamia and was with it at the end of the war in the Middle East. He retired from the Army in 1920, and served as the ceremonial colonel of the Queen's Bays.", "link_mentions": [{"page": "Evelyn Wood (British Army officer)", "response": ["While Wood was at Aldershot his aides-de-camp included Captain Edward Roderic 'Roddy' Owen (Lancashire Fusiliers), a famous amateur jockey, which his biographer has identified as due to Wood's keen interest as rider and foxhunter, and Major Hew Dalrymple Fanshawe, 19th Hussars.Manning p 204. Fanshawe (who commanded V Corps during World War I), later became Wood's son-in-law, marrying his elder daughter Anna Pauline Mary on 25 July 1894.Burke's Landed Gentry: 'Fanshawe, formerly of Donnington Hall'."]}, {"page": "Hew", "response": ["* Hew Dalrymple Fanshawe (1860-1957), British Army First World War general"]}, {"page": "2nd Dragoon Guards (Queen's Bays)", "response": ["*1921–1930: Lt-Gen. Sir Hew Dalrymple Fanshawe, KCB, KCMG"]}, {"page": "V Corps (United Kingdom)", "response": ["In October 1915, Allenby was promoted to command Third Army and Lt-Gen Hew Dalrymple Fanshawe was transferred from Cavalry Corps (23 October) to replace him at the head of V Corps.Army Lists."]}, {"page": "Evelyn Fanshawe", "response": ["A grandson on his mother's side of Sir Evelyn Wood, he was born to Lt. Gen. Sir Hew Dalrymple Fanshawe and Anna Paulina Mary Wood in British India in 1895.India, Select Births and Baptisms, 1786-1947 He married Marie Harari in 1920, daughter of Sir Victor Harari."]}, {"page": "Hew Fanshawe", "response": ["#REDIRECT Hew Dalrymple Fanshawe"]}, {"page": "H. D. Fanshawe", "response": ["#REDIRECT Hew Dalrymple Fanshawe"]}, {"page": "Fanshawe (surname)", "response": ["*Hew Dalrymple Fanshawe (1860–1957), British general"]}, {"page": "1908 Birthday Honours", "response": ["*Colonel (Brigadier-General) Hew Dalrymple Fanshawe, Brigadier-General 2nd Cavalry Brigade, Eastern Command."]}, {"page": "Capture of Wurst Farm", "response": ["XVIII Corps (Lieutenant-General Ivor Maxse) of the Fifth Army was to advance onto the Gravenstafel Spur, an area held by the German 36th Division since 8 September. The 58th (2/1st London) Division (Major-General Hew Dalrymple Fanshawe) was to conduct the attack, between the 55th (West Lancashire) Division on the right flank and the 51st (Highland) Division on the left. The 58th (2/1st London) Division objective was  ahead, among German strongpoints on Wurst Farm Ridge, at the west end of Gravenstafel Spur."]}, {"page": "1925 Birthday Honours", "response": ["*Major-General Sir Hew Dalrymple Fanshawe  Colonel, The Queen's Bays (2nd Dragoon Guards) "]}]}}