{"wiki_id": "http://www.wikidata.org/entity/Q5752713", "itemLabel": "Paul Winterton", "itemDescription": "English writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Winterton", "wikipedia_page": {"main": "Paul Winterton (12 February 1908 – 8 January 2001) was an English journalist and crime novelist. During his career he used the pseudonyms Andrew Garve, Roger Bax and Paul Somers.\nWinterton was born in Leicester, the son of Ernest Winterton, a left-wing journalist and the Labour Member of Parliament for Loughborough from 1929 to 1931. He was educated at Hulme Grammar School in Manchester and Purley County School in Surrey. He took a degree in Economics at  the London School of Economics. He was a reporter for The Economist for four years, and later for the News Chronicle (1933 - 1946). From 1942 to 1945 he was the Moscow correspondent of the News Chronicle, where he was also the correspondent of the BBC Overseas Service.Winterton was the Labour candidate for Canterbury in the 1931 United Kingdom general election, and for Mitcham in the 1935 United Kingdom general election.After the war Winterton became an author of crime and mystery fiction full-time. He was a founder-member of the Crime Writers' Association during 1953 and, with Elizabeth Ferrars, its first joint secretary.\nInspector James was his protagonist for the Roger Bax books. Hugh Curtis was his protagonist for the Paul Somers books.\nWinterton was married and had two sons and two daughters.", "link_mentions": [{"page": "Isles of Scilly", "response": ["The Riddle of Samson, a novel by Andrew Garve (a pen name of Paul Winterton) is set mainly around the Isles of Scilly."]}, {"page": "A Touch of Larceny", "response": ["A Touch of Larceny is a 1959 British-American black-and-white comedy film, produced by Ivan Foxwell, directed by Guy Hamilton, that stars James Mason, George Sanders, and Vera Miles. The film co-stars Harry Andrews, Rachel Gurney, and John Le Mesurier and is based on the 1956 novel The Megstone Plot by Paul Winterton, written under the pseudonym Andrew Garve."]}, {"page": "Roger Bax", "response": ["#REDIRECT Paul Winterton"]}, {"page": "Andrew Garve", "response": ["#redirect Paul Winterton"]}, {"page": "Paul Somers", "response": ["#redirect Paul Winterton"]}, {"page": "Winterton (surname)", "response": ["*Paul Winterton (1908-2001), UK journalist and novelist writing using noms-de-plume"]}, {"page": "The Long Short Cut", "response": ["The Long Short Cut is a 192-page novel by  English author Paul Winterton using the pseudonym Andrew Garve. It was published by Harper and Row in April 1968. "]}, {"page": "Ernest Winterton", "response": ["He was father of the journalist and crime fiction author, Paul Winterton."]}, {"page": "You Sano", "response": ["Maruyama named Paul Winterton his favorite writer. He befriended other writers and maintained those friendships. Aside from close friend Satoshi Kuroiwa, his other friends included Kyo Takigawa, Norio Kono, Shinichi Hoshi, Tsutomu Mizukami and Shoji Yuki, young artists who formed a friendship ring they called a \"murder club.\" The group later included Sasazawa Hidariho, Oyabu Haruhiko, Michio Tsuzuki, Jiro Ikushima, and Masako Togawa."]}, {"page": "Winterton, Paul", "response": ["#redirectPaul Winterton"]}]}}