{"wiki_id": "http://www.wikidata.org/entity/Q575669", "itemLabel": "Teresa Pearce", "itemDescription": "British politician (born 1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Teresa_Pearce", "wikipedia_page": {"main": "Teresa Pearce (born 1 February 1955) is a British Labour Party politician who was the Member of Parliament (MP) for Erith and Thamesmead from 2010 to 2019, who was appointed as a Shadow Minister for Housing and Planning in September 2015. In the reshuffle of October 2016, Pearce was appointed as acting Shadow Secretary of State for Communities and Local Government, standing down after the 2017 general election to concentrate on her constituency.", "link_mentions": [{"page": "Jeremy Corbyn", "response": ["As Leader of the Opposition, Corbyn was one of the sponsors for the Constitutional Convention Bill, which was an attempt at codifying the UK's constitution, which has not been compiled into a single document. He appointed a Shadow Minister for the Constitutional Convention into his Shadow Cabinet and Teresa Pearce stepped down after the May 2017 local elections and this position has since remained vacant."]}, {"page": "Teresa", "response": ["*Teresa Pearce, former UK Member of Parliament"]}, {"page": "Erith and Thamesmead (UK Parliament constituency)", "response": ["John Austin was the MP for this constituency from its creation for the 1997 general election until he stepped down at the 2010 election. The seat was then held for Labour by a local activist Teresa Pearce, who defeated the Conservative candidate Colin Bloom, a councillor for Bickley ward in Bromley.", "In April 2009, an investigation took place into the tampering of ballot boxes and abuse of the postal vote system used for the selection of the prospective Labour candidate for Erith and Thamesmead. A rerun of the candidate selection ballot resulted in victory for Teresa Pearce.", "| Teresa Pearce"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Teresa Pearce, Erith and Thamesmead, 2010–2019"]}, {"page": "Treasury Select Committee", "response": ["| Teresa Pearce MP (Labour)"]}, {"page": "Work and Pensions Select Committee", "response": ["| Teresa Pearce MP (Labour)"]}, {"page": "Pearce (surname)", "response": ["*Teresa Pearce (born 1955), British politician"]}, {"page": "Expansion of Heathrow Airport", "response": ["* of London Labour MPs: Rosena Allin-Khan, Diane Abbott, Dawn Butler, Lyn Brown, Karen Buck, Ruth Cadbury, Jeremy Corbyn, Marsha De Cordova, Jon Cruddas, John Cryer, Janet Daby, Emma Dent Coad, Clive Efford, Barry Gardiner, Helen Hayes, Kate Hoey, Rupa Huq, Sarah Jones, Shadow chancellor John McDonnell, Kate Osamor, Teresa Pearce, Matthew Pennycook, Steve Reed, Ellie Reeves, Andy Slaughter, Keir Starmer, Emily Thornberry, Catherine West"]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| Erith and Thamesmead||style=\"background-color: \"| ||Labour ||style=\"background-color: \"| ||Teresa Pearce (L)||Seat held.  Incumbent John Austin stood down"]}, {"page": "2010 Labour Party leadership election (UK)", "response": ["*Ed Balls (33): David Anderson, Ian Austin, Tom Blenkinsop, Kevin Brennan, Lyn Brown, Vernon Coaker, Yvette Cooper, David Crausby, Jim Cunningham, Jim Dobbin, Mike Dugher, Andrew Gwynne, John Healey, Stephen Hepburn, Sharon Hodgson, Diana Johnson, Helen Jones, Eric Joyce, Barbara Keeley, Chris Leslie, Khalid Mahmood, Steve McCabe, Kerry McCarthy, Teresa Pearce, John Robertson, Geoffrey Robinson, Marsha Singh, Andrew Smith, John Spellar, Tom Watson, David Wright, Iain Wright", "| Teresa Pearce || Ed Balls || Ed Miliband || David Miliband || None || None"]}, {"page": "Shadow Secretary of State for Levelling Up, Housing and Communities", "response": ["| Teresa Pearce"]}, {"page": "List of United Kingdom MPs by seniority (2010–2015)", "response": ["|607||Teresa Pearce||style=\"background-color: \"|Lab||Erith and Thamesmead"]}, {"page": "St Thomas More Catholic School, Eltham", "response": ["*Teresa Pearce, Labour Party politician"]}, {"page": "Labour Friends of Palestine and the Middle East", "response": ["|Teresa Pearce"]}, {"page": "MPs first elected in 2010 to the 55th UK Parliament", "response": ["| Erith and Thamesmead||style=\"background-color: \"| ||Labour ||style=\"background-color: \"| ||Teresa Pearce (L)||Senior Manager for PricewaterhouseCoopers||1955"]}, {"page": "2015 Labour Party leadership election (UK)", "response": ["*Andy Burnham (68): Debbie Abrahams, Heidi Alexander, David Anderson, Hilary Benn, Luciana Berger, Clive Betts, Paul Blomfield, Kevin Brennan, Julie Cooper, David Crausby, Alex Cunningham, Wayne David, Peter Dowd, Michael Dugher, Bill Esterson, Paul Farrelly, Rob Flello, Yvonne Fovargue, Pat Glass, Mary Glindon, Lilian Greenwood, Margaret Greenwood, Nia Griffith, Andrew Gwynne, Harry Harpham, Carolyn Harris, Stephen Hepburn, Kate Hoey, Kate Hollern, Dan Jarvis, Gerald Jones, Graham Jones, Barbara Keeley, Ian Lavery, Emma Lewell-Buck, Ian Lucas, Holly Lynch, Justin Madders, Rachael Maskell, Chris Matheson, Kerry McCarthy, Andy McDonald, Conor McGinn, Liz McInnes, Alan Meale, Ian Mearns, Lisa Nandy, Albert Owen, Teresa Pearce, Lucy Powell, Yasmin Qureshi, Angela Rayner, Jamie Reed, Christina Rees, Rachel Reeves, Steve Rotheram, Jeff Smith, Owen Smith, Keir Starmer, Jo Stevens, Nick Thomas-Symonds, Anna Turley, Karl Turner, Derek Twigg, Valerie Vaz, Alan Whitehead, Iain Wright"]}, {"page": "2015 Labour Party deputy leadership election", "response": ["*Angela Eagle (38): Margaret Beckett, Roberta Blackman-Woods, Paul Blomfield, Nick Brown, Dawn Butler, Ann Clwyd, Julie Cooper, Maria Eagle, Bill Esterson, Mike Gapes, Pat Glass, Lilian Greenwood, Margaret Greenwood, Nia Griffith, Andrew Gwynne, John Healey, Mark Hendrick, Sharon Hodgson, Kelvin Hopkins, Seema Malhotra, Rachael Maskell, John McDonnell, Alison McGovern, Liz McInnes, Michael Meacher, Teresa Pearce, Stephen Pound, Angela Rayner, Christina Rees, Marie Rimmer, Steve Rotheram, Tulip Siddiq, Cat Smith, Jon Trickett, Derek Twigg, Keith Vaz, Daniel Zeichner", "Before dropping out of the race on 17 June, Rushanara Ali had the following 24 nominations: Roberta Blackman-Woods, Paul Blomfield, Lyn Brown, Dawn Butler, Julie Cooper, Jeremy Corbyn, Clive Efford, Fabian Hamilton, Helen Hayes, Tristram Hunt, Rupa Huq, Sadiq Khan, Seema Malhotra, John Mann, John McDonnell, Chi Onwurah, Teresa Pearce, Matthew Pennycook, Yasmin Qureshi, Dennis Skinner, Andy Slaughter, Keir Starmer, Chuka Umunna", "Before dropping out of the race on 11 June, John Healey had the following 20 nominations: Sarah Champion, Clive Efford, Holly Lynch, Kevin Barron, Andy Slaughter, Clive Betts, Ruth Cadbury, Simon Danczuk, Louise Ellman, Fabian Hamilton, Harry Harpham, Madeleine Moon, Paula Sherriff, Derek Twigg, Paul Blomfield, Ivan Lewis, Gordon Marsden, Chris Leslie, Teresa PearceNew Statesman  9 June 2015"]}, {"page": "List of United Kingdom MPs by seniority (2015–2017)", "response": ["|428||Teresa Pearce||style=\"background-color: \"|Lab||Erith and Thamesmead||01/02/1955"]}, {"page": "Shadow Cabinet of Jeremy Corbyn", "response": ["| Teresa Pearce", "*Shadow Communities Secretary – Teresa Pearce", "*Grahame Morris went on leave and was replaced as Shadow Secretary of State for Communities and Local Government and Shadow Minister for the Constitutional Convention by Teresa Pearce."]}]}}