{"wiki_id": "http://www.wikidata.org/entity/Q5762948", "itemLabel": "Keith Kenniff", "itemDescription": "musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Kenniff", "wikipedia_page": {"main": "Keith Kenniff is a composer, multi-instrumentalist, and electronic music producer. He composes ambient/electronic music under the moniker Helios and post-classical piano music under Goldmund. He is also one half of the indie band Mint Julep, and ambient project \"A Pale Fire\" (previously \"Hollie & Keith Kenniff\"). Keith is also a composer for film, television, dance and performance art. In 2010 he created the record label Unseen. He composed the song \"Years\" for Facebook's \"A Look Back\" feature as well as composed the soundtrack for the Emmy Award winning documentary, Blood Road.", "link_mentions": [{"page": "Moiety", "response": ["* Moiety, an album by Keith Kenniff (as Helios)"]}, {"page": "Helios (disambiguation)", "response": ["* Keith Kenniff, an American ambient musician"]}, {"page": "Ashokan Farewell", "response": ["*2011 – Keith Kenniff, under his moniker Goldmund, covered the song on his album All Will Prosper."]}, {"page": "Max Richter", "response": ["| The Gift || 2010 || Andrew Griffin || With Hildur Guðnadóttir and Keith Kenniff (Goldmund)"]}, {"page": "In Heaven", "response": ["*American composer and producer Keith Kenniff covered the song on his 2007 album Ayres, under his Helios moniker."]}, {"page": "Kenniff", "response": ["*Keith Kenniff, American musician"]}, {"page": "Caesura (album)", "response": ["#REDIRECT Keith Kenniff", "Category:Keith Kenniff albums"]}, {"page": "Ayres (album)", "response": ["Ayres is Keith Kenniff's third album under his Helios moniker. This is the only Helios album that contains vocals.  There is also a remastered, instrumental version of \"Ayres\".", "Category:Keith Kenniff albums"]}, {"page": "Eingya", "response": ["Eingya is the second album by Keith Kenniff as Helios. It was released in 2006 on Type Records. It is in an ambient style.", "Category:Keith Kenniff albums"]}, {"page": "Unomia", "response": ["#REDIRECT Keith Kenniff"]}, {"page": "Keith Kenniff (Helios)", "response": ["#REDIRECT Keith Kenniff"]}, {"page": "Goldmund (musician)", "response": ["#REDIRECT Keith Kenniff"]}, {"page": "Papercutz", "response": ["The group toured in 2009 and 2010 promoting their debut album throughout Europe and U.S. with showcases on festivals such as SXSW and Exit Festival and signed to UK Audiobulb Records a new remix album Do outro lado do espelho (Lylac ambient reworks) spawned out of Lylac's textures with Drowned in Sound calling the album 'notably coherent and engaging' unlike other remix records featuring relevant ambient music artists like Taylor Deupree, Keith Kenniff, ex-member of UK 'shoegaze' icons Slowdive and Lowgold drummer Simon Scott among many others that Bruno personally invited to work on his music."]}, {"page": "Famous Places", "response": ["Famous Places is the third album of American ambient musician Keith Kenniff under the Goldmund moniker. Famous Places features piano compositions named after locations that have played an important part in Kenniff's life to date. A close-miced recording technique accentuates the simplicity and intimacy of Kenniff's melodious musings, and while the piano solo is clearly the medium the Goldmund project is predominantly concerned with, Kenniff frequently adds contextual details to his recordings, setting his keywork among billowy, abstract drones, a few quietly mixed-in additional instruments and occasional percussion (such as 'Dane Street').", "Category:Keith Kenniff albums"]}, {"page": "The Midsummer Station", "response": ["* Keith Kenniff – bowed double bass, synthesizer, drums on track 9"]}, {"page": "List of The Memory Palace episodes", "response": ["\"There’s Branches\" by Keith Kenniff,", "\"Evening at Eight\" by Keith Kenniff,"]}, {"page": "Underrated Silence", "response": ["*\"Balcony Sunset\" also appeared on the charity album for the Japan earthquake of 2011 For Nihon which was released on Helios' Keith Kenniff's label Unseen. The album featured acts such as Robin Guthrie and Harold Budd, Jon Hopkins, Ryuichi Sakamoto and Max Richter."]}, {"page": "Helios (artist)", "response": ["#REDIRECT Keith Kenniff"]}, {"page": "Christopher Tignor", "response": ["Christopher Tignor (born March 15, 1976) is an American composer, musician, and software engineer based in New York City. A founding member of post-rock acts Slow Six and Wires Under Tension, Tignor is primarily known for his solo work as an electro-acoustic violinist \"making computers coexist in harmony with acoustic instruments in a live setting\". Tignor has composed and recorded string arrangements for This Will Destroy You, John Congleton, Keith Kenniff, Lymbyc Systym, and more."]}, {"page": "Goldmund", "response": ["#redirect Keith Kenniff"]}]}}