{"wiki_id": "http://www.wikidata.org/entity/Q5764396", "itemLabel": "William Goodenough", "itemDescription": "British Royal Navy officer (1867-1945)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Goodenough", "wikipedia_page": {"main": "Admiral Sir William Edmund Goodenough  (2 June 1867 – 30 January 1945) was a senior Royal Navy officer of World War I. He was the son of James Graham Goodenough.", "link_mentions": [{"page": "Battle of Jutland", "response": ["At 16:30, Scheer's leading battleships sighted the distant battlecruiser action; soon after,  of Beatty's 2nd Light Cruiser Squadron led by Commodore William Goodenough sighted the main body of Scheer's High Seas Fleet, dodging numerous heavy-calibre salvos to report in detail the German strength: 16 dreadnoughts with six older battleships. This was the first news that Beatty and Jellicoe had that Scheer and his battle fleet were even at sea. Simultaneously, an all-out destroyer action raged in the space between the opposing battlecruiser forces, as British and German destroyers fought with each other and attempted to torpedo the larger enemy ships. Each side fired many torpedoes, but both battlecruiser forces turned away from the attacks and all escaped harm except Seydlitz, which was hit forward at 16:57 by a torpedo fired by the British destroyer . Though taking on water, Seydlitz maintained speed. The destroyer , under the command of Captain Barry Bingham, led the British attacks. The British disabled the German torpedo boat , which the Germans soon abandoned and sank, and Petard then torpedoed and sank , her second score of the day.  and  rescued the crews of their sunken sister ships. But Nestor and another British destroyer –  – were immobilised by shell hits, and were later sunk by Scheer's passing dreadnoughts. Bingham was rescued, and awarded the Victoria Cross for his leadership in the destroyer action."]}, {"page": "1945", "response": ["** Sir William Goodenough, British admiral (b. 1867)"]}, {"page": "1867", "response": ["* June 2 – William Goodenough, British admiral (d. 1945)"]}, {"page": "Battle of Heligoland Bight (1914)", "response": ["The British devised a plan to ambush German destroyers on their daily patrols. A British flotilla of 31 destroyers and two cruisers under Commodore Reginald Tyrwhitt, with submarines commanded by Commodore Roger Keyes, was dispatched. They were supported at longer range by an additional six light cruisers commanded by William Goodenough and five battlecruisers commanded by Vice Admiral David Beatty.", "Keyes impressed Winston Churchill, the First Lord of the Admiralty with the daring of his plan, which was adopted with some changes. An attack at 08:00 on the German daytime patrol was preferred. Keyes and Tyrwhitt requested support for their operation, in particular bringing the Grand Fleet south and the support of the squadron of six light cruisers commanded by Commodore William Goodenough. This was refused by the Chief of Staff, Vice Admiral Doveton Sturdee, who instead agreed to place only lighter forces consisting of Cruiser Force K (Rear Admiral Gordon Moore) with the battlecruisers  and   to the north-west and Cruiser Force C comprising the Cressy-class armoured cruisers, , , ,  and ,  west."]}, {"page": "Battle of Dogger Bank (1915)", "response": ["To cover the East Coast and act as distant support, the 3rd Cruiser Squadron and the seven pre-dreadnoughts of the 3rd Battle Squadron (Admiral Edward Eden Bradford) sailed from Rosyth for an area in the North Sea, from which they could cut off the German force if it moved north. The Grand Fleet left Scapa at 21:00 on 23 January, to sweep the southern North Sea but could not be expected to arrive on the scene until the afternoon of 24 January. Soon after the German force sailed, the 1st Light Cruiser Squadron (Commodore William Goodenough) and the battlecruisers departed Rosyth, heading south; at 07:05 on 24 January, a clear day with good visibility, they encountered German screening vessels at the Dogger Bank."]}, {"page": "HMS Liverpool (1909)", "response": ["She was assigned to the 1st Battle Squadron of the Home Fleet on commission and transferred to the 2nd Light Cruiser Squadron in 1913. At the beginning of the First World War, Liverpool was serving with the 5th Light Cruiser Squadron. She participated in the first engagement of the war, the Battle of Heligoland Bight, on 28 August 1914 grouped with five other Town cruisers under command of Commodore William Goodenough.Osborne, Eric W. (2006), The Battle of Heligoland Bight, p52 After the German cruiser  was heavily damaged and disabled, Goodenough ordered his ships to cease firing on her at 12:55 pm and a rescue operation was subsequently undertaken. Liverpool, accompanied by the destroyers  and , manoeuvred close to the cruiser in an effort to recover the surviving crew. Small craft from Liverpool were deployed to retrieve crewmembers who had abandoned ship while Lurcher positioned alongside Mainz to transfer the remaining personnel on board.Osborne, Eric W. (2006), The Battle of Heligoland Bight, pp91-2 Liverpool detached from the main force at 7:45 pm to transport 86 embarked prisoners to Rosyth, including a son of Admiral Alfred von Tirpitz.Osborne, Eric W. (2006), The Battle of Heligoland Bight, p103"]}, {"page": "HMS Orion (1910)", "response": ["The Grand Fleet sortied on 18 August to ambush the High Seas Fleet while it advanced into the southern North Sea, but a series of miscommunications and mistakes prevented Jellicoe from intercepting the German fleet before it returned to port. Two light cruisers were sunk by German U-boats during the operation, prompting Jellicoe to decide to not risk the major units of the fleet south of 55° 30' North due to the prevalence of German submarines and mines. The Admiralty concurred and stipulated that the Grand Fleet would not sortie unless the German fleet was attempting an invasion of Britain or there was a strong possibility it could be forced into an engagement under suitable conditions.Halpern, pp. 330–32 Rear-Admiral William Goodenough assumed command of the division on 5 December and Captain Eric Fullerton relieved Backhouse on the 14th."]}, {"page": "SMS Seydlitz", "response": ["Again, interception and decryption of German wireless signals played an important role. Although they were unaware of the exact plans, the cryptographers of Room 40 were able to deduce that Hipper would be conducting an operation in the Dogger Bank area. To counter it, Beatty's 1st Battlecruiser Squadron, Rear Admiral Archibald Moore's 2nd Battlecruiser Squadron and Commodore William Goodenough's 2nd Light Cruiser Squadron were to rendezvous with Commodore Reginald Tyrwhitt's Harwich Force at 8:00 on 24 January, approximately  north of the Dogger Bank. At 08:14, Kolberg spotted the light cruiser  and several destroyers from the Harwich Force. Aurora challenged Kolberg with a search light, at which point Kolberg attacked Aurora and scored two hits. Aurora returned fire and scored two hits on Kolberg in retaliation. Hipper immediately turned his battlecruisers towards the gunfire, when, almost simultaneously, Stralsund spotted a large amount of smoke to the northwest of her position. This was identified as a number of large British warships steaming towards Hipper's ships."]}, {"page": "St Mary's Hospital, London", "response": ["Following the 1944 publication of a report by Sir William Goodenough advocating a minimum size for teaching hospitals, and following the formation of the National Health Service in the 1948, several local hospitals became affiliated to St Mary's Hospital. These included Paddington General Hospital, the Samaritan Hospital for Women and the Western Eye Hospital."]}, {"page": "SMS Derfflinger", "response": ["Again, interception and decryption of German wireless signals played an important role. Although they were unaware of the exact plans, the cryptographers of Room 40 deduced that Hipper would be conducting an operation in the Dogger Bank area. To counter it, Beatty's 1st Battlecruiser Squadron, Rear Admiral Archibald Moore's 2nd Battlecruiser Squadron and Commodore William Goodenough's 2nd Light Cruiser Squadron were to rendezvous with Commodore Reginald Tyrwhitt's Harwich Force at 08:00 on 24 January, approximately  north of the Dogger Bank."]}, {"page": "SMS Blücher", "response": ["Again, interception and decryption of German wireless signals played an important role. Although they were unaware of the exact plans, the cryptographers of Room 40 were able to deduce that Hipper would be conducting an operation in the Dogger Bank area. To counter it, Beatty's 1st Battlecruiser Squadron, Rear Admiral Gordon Moore's 2nd Battlecruiser Squadron and Commodore William Goodenough's 2nd Light Cruiser Squadron were to rendezvous with Commodore Reginald Tyrwhitt's Harwich Force at 08:00 on 24 January, approximately  north of the Dogger Bank."]}, {"page": "SMS Moltke", "response": ["Again, interception and decryption of German wireless signals played an important role. Although they were unaware of the exact plans, the cryptographers of Room 40 were able to deduce that Hipper would be conducting an operation in the Dogger Bank area. To counter it, Beatty's 1st Battlecruiser Squadron, Rear Admiral Archibald Moore's 2nd Battlecruiser Squadron and Commodore William Goodenough's 2nd Light Cruiser Squadron were to rendezvous with Commodore Reginald Tyrwhitt's Harwich Force at 08:00 on 24 January, approximately  north of the Dogger Bank."]}]}}