{"wiki_id": "http://www.wikidata.org/entity/Q576537", "itemLabel": "Matthew Offord", "itemDescription": "British politician (born 1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Matthew_Offord", "wikipedia_page": {"main": "Matthew James Offord  (born 3 September 1969) is a British Conservative Party politician who has been the Member of Parliament (MP) for Hendon since 2010. He was previously a member of the Association of European Parliamentarians with Africa Governing Council.", "link_mentions": [{"page": "September 3", "response": ["*  1969   – Matthew Offord, English journalist and politician"]}, {"page": "Christian right", "response": ["In Northern Ireland, Ian Paisley led a Protestant fundamentalist party, the Democratic Unionist Party, which had a considerable influence on the province's culture.Andrew Vincent, Modern Political Ideologies. John Wiley & Sons, 2009.  (p. 325).Richard P. Davis, Mirror Hate: the Convergent Ideology of Northern Ireland paramilitaries, 1966–1992. Dartmouth, 1994.  . (p.80) For a time after the 2017 United Kingdom general election, the DUP provided confidence and supply to the governing Conservative Party, although this agreement provoked concern from socially liberal elements of the party about possible DUP influence on social policy. Although there is no evidence this occurred. Karen Armstrong has mentioned British evangelical leader Colin Urquhart as advocating positions similar to the Christian Right.Karen Armstrong, A History of God: the 4000-year quest of Judaism, Christianity, and Islam. Ballantine Books, 1994 p. 390. Some members of the Conservative Party and the Brexit Party including Ann Widdecombe, Jacob Rees-Mogg, Nadine Dorries, Matthew Offord and Peter Bone also support some of the values of the Christian right."]}, {"page": "Hendon", "response": ["Hendon constituency is represented by Conservative Matthew Offord MP since 2010."]}, {"page": "Mill Hill", "response": ["Mill Hill was in the parliamentary constituency of Hendon which was created in 1918. This lasted until 1945 when the constituency was split in two, Mill Hill in Hendon North. In 1997, the Hendon constituency was recreated. From then, until he lost his seat to the Conservative candidate, Matthew Offord, at the 2010 general election, Hendon was represented in the House of Commons by Andrew Dismore of the Labour Party."]}, {"page": "London Borough of Barnet", "response": ["Chipping Barnet is represented by Theresa Villiers. Finchley and Golders Green is represented by Mike Freer. Hendon, in 2010 the most marginal Conservative-held seat in London with a majority of 106 votes, is represented by Matthew Offord."]}, {"page": "King's College London", "response": ["Notable King's alumni to have held senior positions in British politics include two Speakers of the House of Commons (Lord Maybray-King and Lord Ullswater) and the former Cabinet ministers Lord Watkinson, Lord Passfield and Lord Wilmot. As of the current Parliament there are 20 King's graduates in the House of Commons, namely Alex Burghart, Nic Dakin,‘DAKIN, Nicholas’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Mark Francois,‘FRANCOIS, Rt Hon. Mark (Gino)’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 John Glen, Dan Jarvis, Phillip Lee,‘LEE, Phillip James’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Brandon Lewis,‘LEWIS, Brandon’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Sarah Newton,‘NEWTON, Sarah’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Matthew Offord, Sarah Olney, Dan Poulter,‘POULTER, Dr Daniel Leonard James’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Lucy Powell,‘POWELL, Lucy Maria’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Bob Seely, Tulip Siddiq,‘SIDDIQ, Tulip, (Mrs C. W. St J. Percy)’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Keith Simpson, Sir Gary Streeter,‘STREETER, Gary Nicholas’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Gareth Thomas,‘THOMAS, Gareth Richard’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Michael Tomlinson, David Warburton,‘WARBURTON, David John’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 and Sarah Wollaston.‘WOLLASTON, Sarah’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 As of the current Parliament there are 17 King's graduates in the House of Lords including Lord Carlile, Lord Clinton-Davis, Lord Dunlop,‘DUNLOP’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Lord Kakkar,‘KAKKAR’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Lord MacGregor, Baroness Morgan, Baroness O'Loan,‘O’LOAN’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Lord Owen, Lord Plant,‘PLANT OF HIGHFIELD’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Lord Rowlands,‘ROWLANDS’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Baroness Watkins, and the Lords Spiritual Tim Dakin,‘WINCHESTER, Bishop of’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Nick Holtam,‘SALISBURY, Bishop of’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 and Tim Thornton.TRURO, Bishop of’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016"]}, {"page": "Alexei Sayle", "response": ["In May 2021, Conservative MP Matthew Offord wrote to the BBC's Director General urging, unsuccessfully, that the planned broadcast of Desert Island Discs on 23 May featuring Sayle be halted on the basis that every broadcaster \"should be wary of giving a platform to anyone who is seen to be 'excusing' antisemitism\". There was an outcry on social media in response, rejecting the claim that Sayle was doing this, with support for Sayle (who is Jewish) from across the board and the resulting hashtag #IStandWithAlexeiSayle trending on UK Twitter."]}, {"page": "Andrew Dismore", "response": ["In the 2010 general election Dismore lost his seat by 106 (0.2%) votes to Conservative candidate and former Hendon ward councillor Matthew Offord. In his losing speech Dismore complained that Offord had used his record of expenses against him."]}, {"page": "Hendon (UK Parliament constituency)", "response": ["Hendon  is a constituency in London. It was created in 1997 and has been represented  since 2010 by Matthew Offord of the Conservative Party.  An earlier version of the seat existed between 1918 and 1945.", "The constituency has been a Conservative-Labour bellwether since 1997. Andrew Dismore won the seat in 1997 as part of a nationwide landslide victory for the Labour Party. Matthew Offord won the seat for the Conservatives in 2010 by only 106 votes. The 2015 result gave the seat the 37th most marginal majority of the Conservative Party's 331 seats by percentage of majority.List of Conservative MPs elected in 2015 by % majority  UK Political.info.  Retrieved 2017-01-29", "| Matthew Offord"]}, {"page": "List of Parliamentary constituencies in London", "response": ["| Dr Matthew Offord†"]}, {"page": "Barnet and Camden (London Assembly constituency)", "response": ["*Hendon - Matthew Offord (Conservative)"]}, {"page": "Amery Hill School", "response": ["*Matthew Offord MP"]}, {"page": "Environmental Audit Select Committee", "response": ["| Dr Matthew Offord MP", "|Dr Matthew Offord MP", "| Matthew Offord MP (Conservative)"]}, {"page": "Association of European Parliamentarians with Africa", "response": ["Thijs Berman, Jan Willem Bertens, Sabine de Bethune, Katharine Bulbulia, Baron Chidgey, Ingrida Circene, Minodora Cliveti, John Corrie, Alain Destexhe, Luc Dhoore, Therese Frösch, Barty L. Fuchs, Theodossis Georgiou, Chantal Gill’ard, Pär Granstedt, Carina Hägg, Jan Hamáček, Johan van Hecke, Maja Ingold, Brunhilde Irber, Tadeusz Iwiński, Inge Jäger, Kimmo Kiljunen, Krista Kiuru, Karsten Lauritzen, Kerstin Lundgren, Josep Maldonado, Lydia Maximus, Silver Meikar, Magda de Meyer, Denis Naughten, Charlie O'Connor, Matthew Offord, Maria Antonia Moreno Areias De Almeida Santos, and Judith Schwentner."]}, {"page": "Offord", "response": ["* Matthew Offord (born 1969), British politician (Conservative), MP for Hendon"]}, {"page": "List of people with given name Matthew", "response": ["*Matthew Offord, FRGS (born 1969), British Conservative Party politician and the Member of Parliamentn"]}, {"page": "List of alumni of King's College London", "response": ["*Matthew Offord – Conservative MP"]}, {"page": "George Galloway", "response": ["In January 2013, Galloway criticised David Cameron's government for arming Syrian rebels linked to Salafi jihadism. Following the Ghouta chemical attack on 21 August 2013, Galloway speculated on his Press TV show that the responsibility for the atrocity lay with al-Qaeda and the rebels in Syria who had been provided with the weapons by Israel. During his speech in the House of Commons debate about the crisis in Syria on 29 August 2013, Galloway was asked about this broadcast by the Conservative MP Matthew Offord. In response, he stated that he had \"said no such thing\", and was accused of lying. In the debate Galloway had stated \"It is not that the regime is not bad enough to do it; everybody knows that it is bad enough to do it. The question is: is it mad enough to do it?\"."]}, {"page": "Expansion of Heathrow Airport", "response": ["* of London Conservative MPs: Bob Blackman, Zac Goldsmith, Justine Greening, Greg Hands, Matthew Offord, and Theresa Villiers. The 2018 vote drew five absences/abstentions from others in the nineteen."]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| Hendon||style=\"background-color: \"| ||Labour||style=\"background-color: \"|  ||Matthew Offord (C)||Gain.  Defeated incumbent Andrew Dismore"]}, {"page": "2010 Barnet London Borough Council election", "response": ["The Conservative councillors Mike Freer and Matthew Offord stood down at the election, as they were standing in the constituencies of Finchley and Golders Green and Hendon respectively in the general election, which took place at the same as the council election."]}, {"page": "Matthew James Offord", "response": ["#REDIRECT Matthew Offord "]}]}}