{"wiki_id": "http://www.wikidata.org/entity/Q5768724", "itemLabel": "David Grant", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Grant_(singer)", "wikipedia_page": {"main": "David Grant  (born 8 August 1956) is a British singer, comedian and vocal coach.", "link_mentions": [{"page": "August 8", "response": ["*  1956   – David Grant, English singer "]}, {"page": "Greenbelt Festival", "response": ["| rowspan=\"2\" | Bryn Haworth, David Grant, Deniece Williams, The Fat Band, Mike Peters , Blood & Fire, the Choir, Gordon Gano, Elaine Storkey"]}, {"page": "1956 in music", "response": ["**David Grant, English singer and vocal coach"]}, {"page": "Chrysalis Records", "response": ["* David Grant"]}, {"page": "Fame Academy", "response": ["Fame Academy claimed to emphasise the creative talent of the contestants, (called \"students\" on the show) who were encouraged to write their own songs and music as well as developing their singing technique and performing skills. Inside the academy for a period of ten weeks, the students were given a complete musical education. This included individual vocal coaching with tutors including Carrie Grant and David Grant, songwriting lessons, personal development, fitness/dancing classes, and workshops with professionals. The students stayed at Witanhurst, an historic Georgian-style mansion in Highgate that was specially redressed for the series. They were provided with dormitory-style living accommodation, communal meals and recreation areas.", "| rowspan=\"2\" | Richard ParkCarrie GrantDavid GrantRobin Gibb"]}, {"page": "BBC Radio London", "response": ["* Carrie Grant and David Grant (Saturday Breakfast)"]}, {"page": "Songs of Praise", "response": ["Presenters of the show have included Geoffrey Wheeler, Michael Barratt, Cliff Michelmore, Sir Harry Secombe, Alan Titchmarsh, Roger Royle, Debbie Thrower, Bruce Parker, Ian Gall, Martin Bashir, Huw Edwards, Eamonn Holmes, Josie d'Arby, Jonathan Edwards, Steve Chalke, David Grant, Bill Turnbull, Sally Magnusson, Diane-Louise Jordan, Connie Fisher and Dan Walker "]}, {"page": "Craig Revel Horwood", "response": ["Horwood became a judge on Comic Relief Does Fame Academy in 2005, along with Lesley Garrett and Richard Park. He and Garrett replaced vocal coaches David Grant and Carrie Grant on the panel; however, the pair still appeared as voice coaches on the series. He returned as a judge for the third series of the Comic Relief edition in 2007."]}, {"page": "Tonight (David Bowie album)", "response": ["Following the release of Let's Dance, Bowie said he wanted his next record to \"go further\"; he wanted to explore R&B, funk and reggae music. Bowie did not invite Nile Rodgers, the co-producer of Let's Dance, to work on the new record. Though initially surprised, Rodgers later attributed the decision to Bowie wanting to prove he could make hits without a \"celebrated hit-maker\". Bowie chose Derek Bramble, a former bass guitarist for the band Heatwave and more recently a producer for David Grant of the band Linx instead. \"I had no idea, he just came searching for me,\" Bramble later said. As he had done with Rodgers for Let's Dance, Bowie invited Bramble to Mountain Studios in Montreux, Switzerland, to record demos of his new material. Emphasising reggae, a group of local Swiss musicians cut demos. According to biographer Chris O'Leary, musicians present at the Tonight sessions said the demos were \"tremendous\", describing them as \"funky, raw, [and] full of promise\"."]}, {"page": "Jaki Graham", "response": ["Jacqueline Graham (born 15 September 1956) is a British singer-songwriter. Following her hit version of \"Could It Be I'm Falling in Love\" with David Grant in 1985, Graham scored a further five UK Top 20 hits over a two-year period. In 1994, her cover version of Chaka Khan's hit \"Ain't Nobody\" reached number one on the U.S. Billboard Dance Chart.", "The duet with David Grant, a cover version of the Detroit Spinners track \"Could It Be I'm Falling in Love\", was released in early 1985 reaching No. 5 in March of that year. Graham's fourth solo single \"Round and Around\" saw her return to the UK top 10 a few months later. A second duet with David Grant was released to end the year entitled \"Mated\". This peaked at No. 20.", "! scope=\"row\"| \"Could It Be I'm Falling in Love\"(duet with David Grant)", "! scope=\"row\"| \"Mated\"(duet with David Grant)"]}, {"page": "UK national selection for the Eurovision Song Contest", "response": ["| Caroline Sullivan, Roisin O'Connor, Steve Tandy, Sara Sesardic, Alastair Webber, Marco Sensi, David Grant, Kele Le Roc"]}, {"page": "Andrew Roachford", "response": ["*+ \"Ain't No Stopping Us Now\" by MOBO Allstars was a charity single released collectively by MOBO Award nominees in 1998, reaching No.47 in the UK Singles Chart. The artists featured on the recording were Another Level, Beverley Knight, Mica Paris, Damage, Nine Yards, Don-E, Hinda Hicks, Celetia, Dina Carroll, Dru Hill, Shola Ama, Truce, Misty Oldland, Ultimate Kaos, Kle'shay, Lynden David Hall, Kele Le Roc, East 17, Conner Reeves, Des'ree, Cleopatra, Glamma Kid, Honeyz, Kelle Bryan, Roachford, Byron Stingily, Alyson Brown, D'Influence, Michelle Gayle, Ignorants, Soundproof, Tony Dortie, David Grant and Carrie Grant."]}, {"page": "N-Trance", "response": ["The group recorded their first full-length album, Electronic Pleasure, in November 1995, which featured seven vocalists including David Grant, and musicians such as Vinny Burns and Snake Davis."]}, {"page": "Jonathan Ansell", "response": ["The third series of The Alan Titchmarsh Show featured the start of a competition to find a soprano to sing with Ansell in the A Night at the Opera tour. 8 ladies were selected to sing in front of a judging panel of David Grant, Ruthie Henshall and Jonathan Shalit.  The 4 successful ladies Rosie Bell, Rosie Havel, Olivia Safe and Esther Dee faced a public vote on 15 September 2008 and Olivia Safe and Rosie Bell won through. They sang  Libiamo ne' lieti calici with Ansell, from Verdi's La Traviata on 29 September 2008. Olivia Safe won the public vote to appear in the tour of A Night at the Opera."]}, {"page": "Star Spell", "response": ["|David GrantClive SwiftChristopher TimothyNina Wadia"]}, {"page": "Spinners (album)", "response": ["Thom Bell created a sound for the group that was \"lush\" yet gritty. Bell's insistently soulful orchestral arrangements played perfectly to their harmonic strengths. \"Could It Be I'm Falling In Love\" (later a hit for David Grant and Jaki Graham) is the keynote; sung by Smith, it is beautiful, optimistic and upbeat. Often cited as the birth of the Philadelphia Sound, Spinners yielded five American top 100 hits, and two UK chart successes.\"BBC Music Review by Daryl Easlea. The album was featured on Trevor Nelson's Radio 2 show, 23 June 2010 when he called it \" a brilliant, brilliant album\""]}, {"page": "Black British people", "response": ["Marsha Ambrosius, Joan Armatrading, Pato Banton, Dame Shirley Bassey, Mel B, Alexandra Burke, Celeste, Diane Charlemagne, Taio Cruz, Craig David, Des'ree, Fleur East, Estelle, Gabrielle, Roland Gift, Jaki Graham, David Grant, Eddy Grant, Pauline Henry, Dev Hynes, Jamelia, KSI, Leona Lewis, Shaznay Lewis, Mahalia, Ella Mai, MNEK, Maxine Nightingale, Billy Ocean, Leigh-Anne Pinnock, Maxi Priest, Corinne Bailey Rae, Andrew Roachford, Sade, Emeli Sande, Seal, Skepta, Heather Small, Jorja Smith, 21 Savage, Benji Webbe, Simon Webbe, Caron Wheeler, and Young MC are among the popular singers not mentioned in the music section above."]}, {"page": "The Sound of Musicals", "response": ["* David Grant", "| 03 || Music of the Night || The Phantom of the Opera || David Grant", "Jon Lee, Carrie & David Grant), Memory (Cats, Mica Paris), One Day More (Les Misérables, John Barrowman, Jon Lee, Ruthie Henshall, Carrie Grant, & Company)", "Week 2 Opening Medley: Comedy Tonight (Cast), Broadway Baby (Carrie Grant), You Can't Take That Away From Me (John Barrowman), On The Street Where You Live (Jon Lee), I Won't Send Roses (David Grant), All That Jazz (Ruthie Henshall)", "| 09 || Swell Party ||High Society || David Grant, Aled Jones", "Week 2 Closing Cole Porter Medley: Anything Goes (Ruthie Henshall), My Heart Belongs to Daddy (Carrie Grant), Too Darn Hot (Mica Paris), Who Wants to be a Millionaire (David Grant, Carrie Grant)", "Week 3 Introduction—Wilkommen (John Barrowman), Hello Dolly (Ruthie Henshall), If They Could See Me Now (Carrie Grant), Matchmaker, Matchmaker (Mica Paris), Edelweiss (Jon Lee), Somewhere (David Grant & Company)", "| 02 || Can You Feel the Love Tonight || The Lion King || David Grant", "Children's Medley (closing) -- Chitty Chitty Bang Bang (Chitty Chitty Bang Bang, Jon Lee, David Grant, Ruthie Henshall, Les Dennis, Joseph McManners), Supercalifragilistic (Mary Poppins, Ruthie Henshall & same), Part of Your World (The Little Mermaid, Carrie Grant), Bad Guys (Bugsy Malone, Jon Lee & David Grant), The Bare Necessities (The Jungle Book, Les Dennis & Joseph McManners), Tomorrow (Annie, Ruthie Henshall & company)", "| 04 || I’ve Never Been in Love Before || Guys And Dolls || David Grant", "| 08 || Beauty and the Beast || Beauty And The Beast || Carrie Grant, David Grant", "Week 4 (Finale) Medley—There's No Business Like Show Business (Annie Get Your Gun, Company), Come On Get Happy (Ruthie Henshall), Good Morning (Singing in the Rain, Jon Lee, Carrie & David Grant), Try To Remember (The Fantasticks, John Barrowman & Company), There's No Business Like Show Business (Annie Get Your Gun, Company)", "* Week 1 Closing Medley—Jesus Christ Superstar, The Time Warp, (The Rocky Horror Show, John Barrowman), Tell Me It's Not True (Blood Brothers, Jill Halfpenny), Seasons of Love (Rent, Jon Lee, Carrie & David Grant), Memory (Cats, Mica Paris), One Day More (Les Misérables, John Barrowman, John Lee, Ruthie Hensall, Carrie Grant, & Company)", "* Week 2 Introduction—Comedy Tonight (John Barrowman, Carrie and David Grant, Ruthie Henshall, Jon Lee), Broadway Baby (Follies, Carrie Grant), You Can't Take That Away from Me (Crazy for You, John Barrowman), The Street Where You Live (My Fair Lady, John Lee)", "* Week 3 Introduction—Wilkommen (Cabaret, John Barrowman), Hello Dolly (Hello Dolly, Ruthie Henshall), If They Could See Me Now (Sweet Charity, Carrie Grant), Matchmaker, Matchmaker (Fiddler on the Roof, Mica Paris), Edelweiss (The Sound of Music, Jon Lee), Somewhere a Place For Us (West Side Story, David Grant & Company)", "* Week 4 (Finale) Medley—There's No Business Like Show Business (Annie Get Your Gun, Company), Get Happy (Ruthie Henshall), Good Morning (Singing in the Rain, Jon Lee, Carrie & David Grant), Try To Remember (The Fantasticks, John Barrowman & Company), There's No Business Like Show Business (Annie Get Your Gun, Company)", "* Children's Medley (closing) -- Chitty Chitty Bang Bang (Chitty Chitty Bang Bang, Jon Lee, David Grant, Ruthie Henshall, Les Dennis, Joseph McManners), Supercalifragilistic (Mary Poppins, Ruthie Henshall & same), Part of Your World (The Little Mermaid, Carrie Grant), Bad Guys (Bugsy Malone, Jon Lee & David Grant), The Bare Necessities (The Jungle Book, Les Dennis & Joseph McManners), Tomorrow (Annie, Ruthie Henshall & company)"]}, {"page": "Carrie Grant", "response": ["Grant is known for her work on the television talent contests Fame Academy, Comic Relief Does Fame Academy, and Pop Idol, and the children's television series Carrie and David's Popshop, together with her husband and colleague David Grant. She first came to fame as a singer in her own right with the pop group Sweet Dreams in 1983, when they represented the United Kingdom at the Eurovision Song Contest that year with the song \"I'm Never Giving Up\". They finished in the top six. In 2009, Grant was featured in the tenth episode of the second series of Total Wipeout."]}, {"page": "Fame Academy (series 2)", "response": ["This second series of Fame Academy was broadcast in the UK over thirteen weeks from July to October 2003. It was won by Alex Parks. The judging panel of the show consisted of Richard Park, Carrie Grant, David Grant and Robin Gibb during the live shows. Jonathan Ross was a judge on the final giving his opinions on the acts.", "The second series of Fame Academy incorporated some format changes from series 1. Cat Deeley and Patrick Kielty continued as lead presenters. Songwriting teacher, Pam Sheyne, did not return, and the role of dance teacher, Kevin Adams, was reduced. Headteacher, Richard Park, adopted a nasty, Simon Cowell-style persona. Carrie Grant's husband, David Grant, joined the series as an extra voice coach.  Bee Gee Robin Gibb joined the show as a judge for the live shows. The judging panel held the casting vote in the event of a draw."]}, {"page": "MasterChef (British TV series)", "response": ["* 2006: Matt Dawson, Arabella Weir, Charlie Dimmock, David Grant, Fred MacAulay, Graeme Le Saux, Hardeep Singh Kohli, Helen Lederer, Ian McCaskill, Jilly Goolden, Kristian Digby, Lady Isabella Hervey, Linda Barker, Marie Helvin, Paul Young, Richard Arnold, Roger Black, Rowland Rivron, Sarah Cawood, Sheila Ferguson, Simon Grant, Sue Perkins, Tony Hadley and Toyah Willcox."]}, {"page": "List of Never Mind the Buzzcocks episodes", "response": ["|David Grant and Dave Johns", "|Aled Jones and David Grant"]}, {"page": "David Grant", "response": ["David Grant may refer to:", "*David Grant (American football) (born 1965), American football player", "*David Grant (Australian rules footballer) (born 1966), All Australian footballer from St Kilda", "*David Grant (footballer, born 1947), English footballer", "*David Grant (footballer, born 1960), English footballer", "*David Grant (rugby league) (1956–1994), Australian rugby league footballer", "*David Grant (cricketer) (born 1997), Australian cricketer", "*David Grant (academic) (born 1947), Vice Chancellor of Cardiff University in Wales", "*David Grant (poet) (1823–1886), Scottish poet", "*David Grant (producer) (1939–1991), British photographer and producer of sexploitation films during the 1970s and 1980s", "*David Grant (singer) (born 1956), British pop singer and celebrity vocal coach"]}, {"page": "Ocean Drive (album)", "response": ["*David Grant  – background vocals"]}, {"page": "Comic Relief Does Fame Academy", "response": ["Each day, in the two weeks leading up to Comic Relief, the remaining students would perform a song of their choice, with guidance from vocal coaches Carrie Grant and David Grant, to a live national audience. The judges then gave their comments on each performance. After all of the students have sung their songs the voting lines opened for around two hours.", "During their time at the Academy the students are given vocal lessons by Carrie Grant and husband David Grant, whilst Kevin Adams leads the dance classes. Richard Park is the \"headmaster\".", "| rowspan=\"2\" | Richard ParkCarrie GrantDavid Grant", "Most of the original Fame Academy teachers were back, including Richard Park, Carrie Grant, and Kevin Adams. David Grant was a newcomer, as a second voice coach.", "There were changes for this series. Strictly Come Dancing judge Craig Revel Horwood and opera star Lesley Garrett were brought in as judges. Singing coaches Carrie and David Grant were no longer on the judging panel, but were present during the live shows and were invited to give their views when necessary.", "* David Grant - Vocal Coach"]}, {"page": "Linx (band)", "response": ["Linx were a British soul/Brit funk band consisting of David Grant (lead vocals), Bob Carter (keyboards), Andy Duncan (drums), Canute Edwards (guitar), Peter Martin (bass) (aka Sketch) and Junior Giscombe (backing vocals). Carter and Duncan were session musicians who were known for their contribution to Hazel O'Connor's Breaking Glass album and movie.", "| David Grant & Linx - The Best of David Grant & Linx"]}, {"page": "The Alan Titchmarsh Show", "response": ["The show returned for a third series at the start of September 2008.  It launched a competition to find a soprano to sing alongside Jonathan Ansell in the A Night at the Opera tour. From the thousands of hopefuls who applied, eight ladies were selected to sing in front of a judging panel of David Grant, Ruthie Henshall and Jonathan Shalit.  The four successful ladies – Rosie Bell, Rosie Havel, Olivia Safe and Esther Dee – faced a public vote on 15 September 2008 and Olivia Safe and Rosie Bell won through.  They both sang with Jonathan Ansell Libiamo ne' lieti calici, the most famous duet from Verdi's La Traviata on 29 September 2008 and Olivia Safe won the public vote to appear in the tour of A Night at the Opera during October and November 2008."]}, {"page": "The One and Only (British TV series)", "response": ["The Judges were David Grant and Carrie Grant. The show was won on 16 February 2008 by Katy Setterfield as Dusty Springfield."]}, {"page": "Could It Be I'm Falling in Love", "response": ["The song has been covered many times over the years, including a duet by David Grant and Jaki Graham (which peaked at number five on the UK Singles Chart in 1985) and versions by Regina Belle, El Barrio, Messenjah, Worlds Apart, Peter White, Larry Carlton, Jeff Kashiwa, Donny Osmond, Earl Klugh, Boyz II Men, Todd Alsup, Houston Person and Paul Stanley."]}, {"page": "Carrie and David's Popshop", "response": ["Carrie and David's Popshop is a children's musical television series aired on CBeebies, originally broadcast in 2008. It is presented by celebrity vocal coaches Carrie Grant and David Grant, with their pet dog Riff, puppeteered by Dave Chapman, and produced by BBC Scotland. Repeats originally finished on 28 October 2011, but an episode was aired to celebrate the channel's tenth birthday on 11 February 2012. Repeats returned on 7 September 2013. and repeats ended again in 2015."]}, {"page": "List of celebrities appearing on Daily Cooks Challenge", "response": ["| 16 || David Grant || 13 July 2009"]}, {"page": "Celebrity Mastermind", "response": ["| David Grant || Stevie Wonder"]}, {"page": "Hider in the House", "response": ["==David Grant==", "In the sixth episode of the second series, David Grant was busted early when an unfortunate incident led to him being discovered on the first day. In view of the unusual circumstances, and because JK felt partially responsible, the three presenters discussed what to do. They offered the children the opportunity to continue playing, but on the condition that if they lost the challenges they would lose all the prizes they had already won. Unsuspecting friends and family were substituted for the unsuspecting parent.", "| align=center|6 || David Grant "]}, {"page": "Tamarind Books", "response": ["Two of the imprint's best-known titles are The Life of Stephen Lawrence (2001) and Dave and The Tooth Fairy (1993), featuring a black tooth fairy. Tamarind also specialises in biographies of black role models, in the Black Stars series, which includes biographies of Malorie Blackman, Benjamin Zephaniah, Rudolph Walker, Baroness Scotland, Chinwe Chukwuogo-Roy, David Grant and Samantha Tross."]}]}}