{"wiki_id": "http://www.wikidata.org/entity/Q577010", "itemLabel": "Martin Chivers", "itemDescription": "English footballer (born 1945)", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Chivers", "wikipedia_page": {"main": "Martin Harcourt Chivers (born 27 April 1945) is an English retired professional footballer from the 1960s and 1970s.", "link_mentions": [{"page": "April 27", "response": ["*1945 – Martin Chivers, English footballer and manager"]}, {"page": "Tottenham Hotspur F.C.", "response": ["On 15 May 1963, Tottenham became the first British team to win a European trophy by winning the 1962–63 European Cup Winners' Cup when they beat Atlético Madrid 5–1 in the final. Spurs also became the first British team to win two different European trophies when they won the 1971–72 UEFA Cup with a rebuilt team that included Martin Chivers, Pat Jennings, and Steve Perryman. They had also won the FA Cup in 1967, and two League Cups (in 1971 and 1973). In total, Nicholson won eight major trophies in his 16 years at the club as manager.", "*  Martin Chivers"]}, {"page": "Southampton F.C.", "response": ["In 1966, Ted Bates' team were promoted to the First Division as runners-up, with Martin Chivers scoring 30 of Saints' 85 league goals."]}, {"page": "Jimmy Greaves", "response": ["Greaves scored 31 goals in 47 appearances in the 1966–67 campaign, helping Spurs to launch a title challenge that ended with a third-place finish, four points behind Manchester United. They also won the FA Cup after knocking out Millwall, Portsmouth, Bristol City, Birmingham City and Nottingham Forest to reach the 1967 FA Cup Final with Chelsea. Though he did not score in the final itself, a 2–1 victory, with six goals in eight games Greaves was the competition's leading scorer. The 1967–68 season was a disappointing one for Spurs following their 3–3 draw with Manchester United at Old Trafford in the 1967 FA Charity Shield. They finished seventh in the league, exited the FA Cup in the Fifth Round and were knocked out of the Cup Winners' Cup in the Second Round. Greaves had a poor season by his own standards, though with 29 goals in 48 appearances he was still the club's top scorer. Nicholson bought Greaves a new strike partner in Martin Chivers from Southampton for a club record £125,000 fee, with Gilzean dropping further back into midfield to accommodate, but Greaves and Chivers were not as effective together as Nicholson had hoped.", "In 1968–69, Greaves scored 27 goals in 42 league games to finish as the First Division's leading scorer for the sixth and final time. He scored four of his goals in one match against Sunderland, and also scored hat-tricks against Burnley and Leicester City. His nine goals in cup competitions, including a hat-trick against Exeter City, left him with an overall goal tally of 36 in 52 games. His goals for the season took him past Bobby Smith as Spurs' top goalscorer as well as surpassing Steve Bloomer as the First Division's top goalscorer with 336 goals. Spurs performed inconsistently in the 1969–70 season, and Greaves was dropped from the first team after playing in an FA Cup defeat to Crystal Palace at Selhurst Park on 28 January 1970. He was never recalled to the starting line-up, but still ended the season as the club's joint top scorer (with Martin Chivers), having scored 11 goals in 33 matches, taking his total to 266 goals, a club record, including 15 hat-tricks, another club record. Greaves was given a testimonial match by Spurs on 17 October 1972 in a 2–1 win over Feyenoord at White Hart Lane attended by over 45,000 people."]}, {"page": "Dorchester, Dorset", "response": ["Dorchester Town F.C., the town's football team currently play in the Southern League Premier Division. Harry Redknapp and former England players Graham Roberts and Martin Chivers represented 'The Magpies' in the late 1970s and early 1980s. The club is based on Weymouth Avenue in the south of the town after moving from its old ground also on Weymouth Avenue. The club moved to the purpose-built 5,000 capacity Avenue Stadium on Duchy of Cornwall land in the early 1990s."]}, {"page": "Glenn Hoddle", "response": ["Hoddle was born on 27 October 1957 in Hayes, Middlesex to Derek Hoddle and Teresa Roberts, Soon after, the family moved to Harlow, Essex. Teresa Roberts established herself within the local darts community as the mixed double's partner of the local legend Rod Kingham who was also from Harlow  He attended Burnt Mill School in Harlow. He has been supporting Tottenham Hotspur since he was eight, and his favourite player was Martin Chivers. He first came to the attention of Spurs when Chivers and Ray Evans went to present prizes at a local school cup final and noticed the potential of the 11-year-old schoolboy, and on Chivers' recommendation he was invited to train with the club at Tottenham's practice ground in Cheshunt. At the age of 15, Hoddle played for Harlow-based Sunday league club Longmans alongside his father. Hoddle's uncle, Dave, was part of the Stansted team that won the 1984 FA Vase."]}, {"page": "Football records and statistics in England", "response": ["|  Martin Chivers"]}, {"page": "Colin Bell", "response": ["Bell played twice for the England Under 23 team in 1968. He played in a 2–1 victory against Scotland Under 23 team in which Martin Chivers and Rodney Marsh scored for the England Under 23 team. He also played in a 4–0 victory against the Hungary Under 23 team. Bell scored one of the four goals. The other scorers were Chivers, Marsh and Joe Royle. In the same year, Bell won his first cap for the senior England team against Sweden, where he helped inspire goals from Martin Peters, Bobby Charlton and Roger Hunt in a 3–1 victory. Bell was part of the England squad for UEFA Euro 1968, which was ultimately won by Italy. England finished third in the tournament after defeating the Soviet Union in the third-place match."]}, {"page": "British Home Championship", "response": ["|  Martin Chivers", "|  Martin Chivers (2)", "|align=\"left\"| Martin Chivers"]}, {"page": "Steve Mills (footballer)", "response": ["Despite being hospitalised by the side effects of his medical treatment, he organised the biggest charity match ever seen in the South of England with an all-time Saints XI playing the then current team at The Dell in May 1988, involving players such as Mick Channon, Alan Ball, Kevin Keegan and Martin Chivers playing in front of a capacity crowd of over 20,000. Mills received an emotional standing ovation when he appeared on the pitch."]}, {"page": "Jermain Defoe", "response": ["On 19 September, Defoe scored twice in a 3–0 victory against Tromsø in the Europa League group stages, taking his tally in Europe to within two goals of the record holder, Martin Chivers. On 24 September 2013, Defoe scored another two in a 4–0 win against Aston Villa in the League Cup, which took his tally for Tottenham to 139 goals, moving him past George Hunt as the club's fifth-highest scorer of all-time. His goal on 3 October against Anzhi Makhachkala in a 2–0 win took him to one short of the club's all-time record of 22 held by Chivers. Two further goals, against Sheriff Tiraspol in two consecutive fixtures in the Europa League, saw Defoe with 23 European goals, one more than Chivers' previous record as Tottenham's highest European goalscorer. Defoe said Chivers had been at the match and had encouraged him to beat his record."]}]}}