{"wiki_id": "http://www.wikidata.org/entity/Q577454", "itemLabel": "Robert E. M. Hedges", "itemDescription": "British archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_E._M._Hedges", "wikipedia_page": {"main": "Robert Ernest Mortimer Hedges is a British archaeologist and academic.\nBorn in 1944, Hedges attended High Wycombe Royal Grammar School (1955–61) and studied for his Doctor of Philosophy degree at Cambridge University. He was appointed a Fellow of St Cross College, Oxford University, and worked at Oxford University since at least 1994, when he was reappointed a lecturer in Archaeology \"from 1 November 1994 until the retiring age\".Hedges' research involves archaeological studies of ancient human and animal diets and the environments uncovered at archaeological sites. He was awarded one of the Royal Society's Royal Medals for 2008, for his contribution to the rapid development of accelerator mass spectrometry and radiocarbon dating techniques.In 2009, a festschrift was held in Hedges' honour to mark his retirement as Deputy Director of the Research Laboratory for Archaeology & the History of Art. As of 2012, he is Professor of Archaeological Science at the School of Archaeology and Emeritus Fellow of St Cross.", "link_mentions": [{"page": "Hedges (surname)", "response": ["* Robert E. M. Hedges, British archaeologist"]}, {"page": "Robert Hedges", "response": ["*Robert E. M. Hedges, British archaeologist"]}, {"page": "Robert Hedges (scientist)", "response": ["#REDIRECT Robert E. M. Hedges"]}, {"page": "Erika Hagelberg", "response": ["Hagelberg works in the analysis of ancient DNA from archaeological bones. She joined the University of Oxford in 1987, where she worked at the John Radcliffe Hospital alongside Bryan Sykes and Robert E. M. Hedges. At Oxford Hagelberg collaborated with Alec Jeffreys on the applications of bone DNA in forensic science. Jeffreys once described her as being able to “get DNA out of a stone, just about,\". Jeffreys and Hagelberg worked on single tandem repeat typing. Her early work included the analysis of bones from the Mary Rose. Hagelberg identified pig DNA in a leg bone from the food stores in the Mary Rose."]}]}}