{"wiki_id": "http://www.wikidata.org/entity/Q5779293", "itemLabel": "Sarah Angelina Acland", "itemDescription": "English photographer (1849–1930)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Angelina_Acland", "wikipedia_page": {"main": "Sarah Angelina (\"Angie\") Acland (26 June 1849 – 2 December 1930) was an English amateur photographer, known for her portraiture and as a pioneer of colour photography. She was credited by her contemporaries with inaugurating colour photography \"as a process for the travelling amateur\", by virtue of the photographs she took during two visits to Gibraltar in 1903 and 1904.", "link_mentions": [{"page": "Sergey Prokudin-Gorsky", "response": ["In England in 1899 Ives's former assistant, Edward Sanger-Shepherd, commercialized the application of the three-colour process in the \"Sanger Shepherd process of natural colour photography\". With his process in 1903 and 1904 Sarah Angelina Acland produced the first substantial body of work in colour photography by an amateur photographer. By 1905 seventeen different photographers had shown three-colour slides by the Sanger-Shepherd process at exhibitions of the Royal Photographic Society in England."]}, {"page": "Acland", "response": ["* Sarah Angelina Acland (1849–1930), daughter of Sir Henry Acland and Sarah Acland, and pioneer of colour photography"]}, {"page": "List of women photographers", "response": ["File:Miss Acland with her Portuguese Guitar and Dog (Self-Portrait), by Sarah Angelina Acland, Early 20th Century.jpg|Sarah Angelina Acland"]}, {"page": "Park Town, Oxford", "response": ["Miss Sarah Angelina Acland (1849–1930), daughter of Sir Henry Wentworth Acland, lived for the latter part of her life and died at her home in (then No. 7) Park Town. Her interest in colour photography at the turn of the 20th century produced a number of significant early examples, which are held at the Museum of the History of Science in central Oxford."]}, {"page": "Broad Street, Oxford", "response": ["The academic and physician Henry Acland (1815–1900) lived in the street at number 40 on the site of the Weston Library, part of Oxford University's Bodleian Library. His daughter Sarah Angelina Acland (1849–1930), a pioneer of colour photography, was born here."]}, {"page": "Acland baronets", "response": ["Several other members of this branch of the family gained distinction. Sarah Angelina Acland (1849-1930), the only daughter of the first baronet, was a philanthropist and a pioneer of colour photography, becoming a Fellow of the Royal Photographic Society. Sir Reginald Brodie Dyke Acland (1856–1924), fifth son of the first Baronet, was a prominent barrister. Kenneth Francis Dyke Acland (1890–1975), son of Francis Edward Dyke Acland, sixth son of the first Baronet, was a captain in the Royal Navy. Peter Bevil Edward Acland (1902–1993), second son of Alfred Dyke Acland, seventh son of the first Baronet, was a temporary brigadier in the Army and served as Deputy Lieutenant and Vice-Lord-Lieutenant of Devon. He was the father of 1) Sir John Hugh Bevil Acland (1928–2006), a major-general in the Scots Guards, and 2) Sir Antony Arthur Acland, British Ambassador to the United States from 1986 to 1991."]}, {"page": "Oxfordshire Blue Plaques Board", "response": ["|data-sort-value=\"Acland\"|Sarah Angelina Acland"]}, {"page": "Henry Acland", "response": ["* Sarah Angelina Acland (1849–1930)"]}, {"page": "Sarah Acland", "response": ["* Sarah Angelina Acland (1849–1930), photographer", "Sarah Acland's only daughter and namesake, Sarah Angelina Acland was an early pioneer of colour photography. Some of her photographs are in the collection of the Museum of the History of Science in Broad Street, opposite the location of the family home."]}, {"page": "List of fellows of the Royal Society of Arts", "response": ["* Sarah Angelina Acland"]}]}}