{"wiki_id": "http://www.wikidata.org/entity/Q577052", "itemLabel": "Fred West", "itemDescription": "English serial killer", "wikipedia_url": "https://en.wikipedia.org/wiki/Fred_West", "wikipedia_page": {"main": "Frederick Walter Stephen West (29 September 1941 – 1 January 1995) was an English serial killer who committed at least twelve murders between 1967 and 1987 in Gloucestershire, the majority with his second wife, Rosemary West.\nAll the victims were young women. At least eight of these murders involved the Wests' sexual gratification and included rape, bondage, torture and mutilation; the victims' dismembered bodies were typically buried in the cellar or garden of the Wests' Cromwell Street home in Gloucester, which became known as the \"House of Horrors\". Fred is known to have committed at least two murders on his own, while Rose is known to have murdered Fred's stepdaughter, Charmaine. The couple were arrested and charged in 1994.\nFred fatally asphyxiated himself while detained on remand at HM Prison Birmingham on 1 January 1995, at which time he and Rose were jointly charged with nine murders, and he with three further murders. In November 1995, Rose was convicted of ten murders and sentenced to ten life terms with a whole life order.", "link_mentions": [{"page": "Viz (comics)", "response": ["Serial killers Fred West and Harold Shipman have also featured in a strip as rival neighbours trying to kill the old woman next door and foiling each other's plans (Harold and Fred – they make ladies dead!).", "Viz has had many different spoof adverts for various items, such as ornaments, dolls, sheds, china plates and novelty chess sets. These poke fun at the genuine adverts for such items in magazines found in the colour supplements of Sunday newspapers. Those found in Viz are absurd, such as a breakfast plate depicting Princess Diana's face in the middle of a fried egg, \"No. 22 Shit Street\" (which was a diorama of a dilapidated council house complete with rabid dog, youthful vandals and a \"gently rusting\" washing machine in the front yard), and \"Little Ted West\", a teddy bear dressed to look like serial killer Fred West. Viz has manufactured some of these items and sold them, including a china plate depicting \"The Life of Christ...In Cats\", featuring pictures of a cat in various stages of Jesus's life, and the \"Elvis Presley Dambusters Clock Plate of Tutankhamun\", a clock featuring Elvis in the style of Tutankhamun's death mask in addition to Avro Lancaster bomber planes. Many of these adverts had a form with a tick box at the end, with outrageous binding statements in small print that invariably led the purchaser to usury, such as \"I enclose £49.50 in an infinite series of escalating payments\".", "* BBC report about Viz, concerning its cartoon based on Fred West and Harold Shipman"]}, {"page": "1941", "response": ["* September 29 – Fred West, British serial killer (d. 1995)"]}, {"page": "1995", "response": ["**Fred West, English serial killer (b. 1941)"]}, {"page": "Gloucester", "response": ["Gloucester's most important citizens include Robert Raikes (founder of the Sunday School movement) who is still commemorated by the name of Robert Raikes' House in Southgate Street. Its most infamous citizen was Fred West."]}, {"page": "Harold Shipman", "response": ["Harold and Fred (They Make Ladies Dead) was a cartoon strip in a 2001 issue of Viz comic, also featuring serial killer Fred West. Some relatives of Shipman's victims voiced anger at the cartoon."]}, {"page": "Martin Amis", "response": ["In 2000 Amis published a memoir called Experience. Largely concerned with the strange relationship between the author and his father, the novelist Kingsley Amis, the autobiography nevertheless deals with many facets of Amis's life. Of particular note is Amis's reunion with his daughter, Delilah Seale, resulting from an affair in the 1970s, whom he did not see until she was 19. Amis also discusses, at some length, the murder of his cousin Lucy Partington by Fred West when she was 21. The book was awarded the James Tait Black Memorial Prize for biography."]}, {"page": "List of suicides", "response": ["* Fred West (1995), English serial killer, hanging"]}, {"page": "Kempley", "response": ["In March 1994 fields near the village were found to contain the remains of two of the victims of serial killer Fred West. The small parish (280 residents) has two notable churches, one dedicated to St Mary and another to St Edward the Confessor."]}, {"page": "Jimmy Savile", "response": ["In October 2020, the BBC announced that it would be commissioning a mini-series with the working title The Reckoning, which would recount Savile's rise to fame and the sexual abuse scandal that emerged after his death. The Reckoning will be written by Neil McKay and its executive producer will be Jeff Pope. McKay and Pope had previously worked together on dramatisations on the murders of Fred West, the disappearance of Shannon Matthews and the murders of Stephen Port. In September 2021, Steve Coogan was cast as Savile; Coogan said he did not take the decision lightly, and that it was a \"horrific story which – however harrowing – needs to be told\"."]}, {"page": "Lust murder", "response": ["* Fred West & Rosemary West"]}, {"page": "List of prison deaths", "response": ["| Fred West || 1995 "]}, {"page": "Emily Watson", "response": ["In 2010, she starred in Oranges and Sunshine, a film recounting the true story of children sent into abusive care homes in Australia, directed by Jim Loach, and also the following year (2011) in War Horse, an adaptation of Michael Morpurgo's prizewinning novel, directed by Steven Spielberg. In 2011, she played Janet Leach in the ITV two-part film Appropriate Adult, about serial killer Fred West, for which she won a BAFTA."]}, {"page": "Barry Island", "response": ["The ashes of Fred West, British serial killer, were scattered on Barry Island after his body had been cremated on 29 March 1995. British champion rollerblader and Barry native Rich Taylor died after a skating accident in a Barry street on 2 August 2004."]}, {"page": "Rose West", "response": ["Rosemary Pauline West (née Letts; born 29 November 1953) is an English serial killer who collaborated with her husband, Fred West, in the torture and murder of at least nine young women between 1973 and 1987;BBC Article with detail of the 12 accusations. Retrieval Date: 25 October 2017. she also murdered her eight-year-old stepdaughter Charmaine in 1971. The majority of these murders took place at the West residence in Gloucester. Rose is an inmate at HM Prison New Hall, Flockton, West Yorkshire, after being convicted in 1995 of ten murders; Fred died by suicide in prison that same year while awaiting trial, following the couple's arrest in 1994.", "==Meeting Fred West==", "Rose first encountered Fred West in early 1969, shortly after her 15th birthday; he was 27. The pair first met at Cheltenham bus station. Initially, Rose was repulsed by Fred's unkempt appearance and deduced he was a tramp, but she quickly became flattered by the attention he continued to lavish on her over the following days as he invariably sat alongside her at the same bus stop. Rose twice refused to go on a date with Fred, but allowed him to accompany her home.", "By 1977, Rose's father Bill had come to tolerate his daughter's marriage, and to develop a grudging respect for Fred. Together, he and Fred opened a café they named The Green Lantern, which was soon insolvent.\"Euan Ferguson on the Legacy of Fred West\", The Guardian, 15 February 2004 By 1983, she had given birth to eight children, at least three of whom had been conceived by clients. Fred willingly accepted these children as his own and falsely informed them the reason their skin was darker than that of their siblings was because his great-grandmother was a black woman."]}, {"page": "The Smoking Room", "response": ["She is constantly looking for a boyfriend and is prepared to go to extreme lengths to retain one (including dressing as the male police officer who directed the Fred West case). She seems to have the busiest sex life of anyone in the room but hasn't managed to find love. Her choice of men is misguided. One married man she dated sent private photographs he took of her to a pornographic magazine, it is implied Barry saw these pictures. She had a liaison with Clint at Lucy Wu's party, which we learn about in Episode Three, and in Episode Five she buys him some chocolates for Valentine's Day but this appears to be a passing fancy. She flirts outrageously with Janet's nephew, Dominic, in Episode Ten."]}, {"page": "Much Marcle", "response": ["Much Marcle is the birthplace of the sexual serial killer Fred West, and where he buried three of his victims: his nanny Anne McFall and their unborn child, in 1967; and his first wife, Rena, in 1971."]}, {"page": "My Life Among the Serial Killers", "response": ["*Fred West"]}, {"page": "List of serial killers by number of victims", "response": ["| Fred West and Rosemary West ||  || 1967 to 1987 || 12 || 30 || Mainly targeted young women but were also found guilty of murdering two of their own daughters. Also found guilty of raping another daughter. Buried the victims around their house and local area of Gloucester. Shortly before he committed suicide in 1995, Fred West said there were more victims.\"Fred and Rose West – Endgame\" , Marilyn Bardsley. Retrieved 31 August 2007. At one point he confessed to killing up to 30."]}, {"page": "HM Prison Birmingham", "response": ["*Fred West, serial killer who arrived on remand in May 1994. He committed suicide in his cell on 1 January 1995, before he could be brought to trial."]}, {"page": "Dominic West", "response": ["Dominic Gerard Francis Eagleton West (born 15 October 1969) is an English actor, director and musician. He is best known for playing Jimmy McNulty in The Wire (2002–2008) and Noah  Solloway in The Affair (2014–2019), the latter of which earned him a Golden Globe nomination. He won the British Academy Television Award for Best Actor at the 2012 British Academy Television Awards for portraying serial killer Fred West in Appropriate Adult (2011), and he played Jean Valjean in the 2018 BBC miniseries Les Misérables. His film credits include Chicago (2002), 300 (2007), Punisher: War Zone (2008), John Carter (2012), The Square (2017), and Colette (2018). West is currently playing the role of Dr Chris Cox in the Sky One series Brassic (2019–present).", "In December 2009, West starred as Hank in a radio adaptation of Eugene O'Neill's play The Hairy Ape for BBC Radio 3, was a guest presenter on the BBC show Have I Got News for You, and ended the year alongside Joan Rivers and Sarah Jessica Parker with an appearance on Graham Norton's New Year's Eve Show. In 2011, West appeared as a news presenter on the BBC period drama series The Hour. He also played serial killer Fred West in the ITV two-part series Appropriate Adult, giving a performance that the serial killer's daughter described as capturing the \"evil essence of [Fred West] – his character, his mannerisms, even his gait.\"", "| 2011 || Appropriate Adult || Fred West || 2 episodesBritish Academy Television Award for Best ActorNominated—Crime Thriller Award for Best ActorNominated—Royal Television Society Award for Best Actor"]}, {"page": "Unmarked grave", "response": ["Unmarked graves have long been used to bury executed criminals as an added degree of disgrace. Similarly, many 18th and 19th century prisons and mental asylums historically used numbered (but otherwise featureless) markers in their inmate cemeteries, which allowed for record-keeping and visitations while also minimizing the shame associated with having one's family name on permanent display in such a disreputable context. Plot E at Oise-Aisne American Cemetery (consisting entirely of soldiers executed for rape and/or murder) is a rare example of this policy persisting into the 20th century. More recently, the practice has been to cremate and secretly scatter the ashes of notorious criminals in some anonymous place. This was the fate of Nazi war criminals such as Adolf Eichmann, Hermann Göring, Heinrich Himmler, Fritz Sauckel, and Julius Streicher. The remains of British serial killers Myra Hindley, Dr Harold Shipman, and Fred West were treated in the same way. The headstone of disgraced television presenter and alleged sex offender Jimmy Savile was removed and destroyed three weeks after being erected, when posthumous allegations of sexual abuse over decades came to light. Cremation and secret scattering of the ashes has the additional effect of removing all possibility of there being a grave to visit in the future."]}, {"page": "25 Cromwell Street", "response": ["#REDIRECT Fred West"]}, {"page": "1995 in the United Kingdom", "response": ["** Fred West, the 53-year-old Gloucester builder charged with killing twelve women and children (including two of his own daughters), is found to have hanged himself in his cell at Winson Green Prison, Birmingham. He was due to go on trial this year, along with his 41-year-old wife Rosemary, who is charged with ten murders.", "* 1 January – Fred West, serial killer (born 1941) (suicide by hanging while in custody)"]}, {"page": "1994 in the United Kingdom", "response": ["* 24 February – Police in Gloucester begin excavations at 25 Cromwell Street, the home of 52-year-old builder Fred West, investigating the disappearance of his daughter Heather, who was last seen alive in the summer of 1987 when she was 16 years old.", "* 28 February – Fred West is charged with the murder of his daughter Heather and of the murder of Shirley Robinson, an 18-year-old woman who was last seen alive in 1978.", "* 10 April – Human remains are found at Kempley, Gloucestershire, by police working on the Gloucester mass murder case. The body is believed to be that of Catherine \"Rena\" Costello, Fred West's first wife, who was last seen alive in 1971.", "* 28 April – Rosemary West, 40-year-old wife of suspected serial killer Fred West, is charged with three of the murders her husband stands accused of. Rosemary West was first arrested seven days ago, two months after her husband was first taken into custody.", "* 4 May – Police find human remains buried at a former home of Fred and Rose West in Gloucester. The body is believed to be that of Fred West's daughter Charmaine, who was last seen alive at the age of 8 in the summer of 1971.", "** Police working on the Gloucester mass murder case find and begin the 2-day recovery of human remains from a field at Much Marcle, near Gloucester (a site located by Fred West), which are identified on 30 June to be those of Anne McFall, who was last seen alive in 1967 at the age of 18 and pregnant with West's child.", "* 30 June – Magistrates in Gloucester charge Fred West with a total of 11 murders believed to have been committed between 1967 and 1987, while Rose West is charged with nine murders which are believed to have been committed between 1970 and 1987. On 3 July he is charged with a 12th murder, that of Anna McFall."]}, {"page": "List of songs about or referencing serial killers", "response": ["===Fred West/Rose West==="]}, {"page": "List of Viz comic strips", "response": ["* Harold and Fred - they make ladies dead! – A one-off strip in which serial killers Harold Shipman and Fred West compete to be the first to murder a new female neighbour; only to discover that she is actually Ed Gein wearing the skin of one of his victims. This strip created controversy in the media, including complaints from the families of some of Shipman's victims."]}, {"page": "Frederick West", "response": ["*Fred West (footballer, born 1905) (1905–1953), Australian footballer for Hawthorn", "*Fred West (footballer, born 1929) (1929–2011), Australian footballer for Collingwood", "*Fred West (basketball) (born c.1969), American power forward", "*Fred West (1941–1995), English serial killer"]}, {"page": "1941 in the United Kingdom", "response": ["* 29 September – Fred West, English serial killer (suicide 1995)"]}]}}