{"wiki_id": "http://www.wikidata.org/entity/Q5799009", "itemLabel": "Danny Worsnop", "itemDescription": "English singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Danny_Worsnop", "wikipedia_page": {"main": "Danny Robert Worsnop (born 4 September 1990) is an English singer most prominently known as the lead vocalist of rock bands Asking Alexandria and We Are Harlot. He has worked with several artists including I See Stars, With One Last Breath, Breathe Carolina, Memphis May Fire, The Word Alive, All That Remains, and Testarossa, providing guest vocals on several songs.Worsnop also maintains a solo music career. He released his debut solo full-length country-inspired studio album, The Long Road Home, in 2017. He has since released his second studio album Shades of Blue in 2019 through Sumerian Records, followed by the two standalone singles \"Another You\" and \"Happy\".\n\n", "link_mentions": [{"page": "September 4", "response": ["*  1990   – Danny Worsnop, English singer-songwriter"]}, {"page": "1990", "response": ["** Danny Worsnop, British musician"]}, {"page": "List of band name etymologies", "response": ["* Asking Alexandria — According to band member Danny Worsnop, the name was taken from Alexander the Great."]}, {"page": "Earache Records", "response": ["* Danny Worsnop"]}, {"page": "1990 in British music", "response": ["*4 September - Danny Worsnop, singer-songwriter (Asking Alexandria and We Are Harlot)"]}, {"page": "Danny", "response": ["* Danny Worsnop (born 1990), English singer, Asking Alexandria"]}, {"page": "Heaven's Basement", "response": ["*Danny Worsnop – lead vocals (2015)"]}, {"page": "Gilberdyke", "response": ["Current Asking Alexandria and We Are Harlot vocalist Danny Worsnop grew up here."]}, {"page": "The Long Road Home (disambiguation)", "response": ["* The Long Road Home, an album by Danny Worsnop, 2017"]}, {"page": "Breathe Carolina", "response": ["The band later embarked on the \"We are Savages Tour\", touring with Jonny Craig, Mod Sun and Ghost Town. The band has released three singles from their album Savages, the title track as the first buzz single with a lyric video, \"Sellouts\" featuring Danny Worsnop from Asking Alexandria as the official lead, with a music video and \"Bang It Out\"."]}, {"page": "Asking Alexandria", "response": ["Asking Alexandria  are a British rock band from York, North Yorkshire, consisting of guitarists Ben Bruce and Cameron Liddell, drummer James Cassells, lead vocalist Danny Worsnop, and bassist Sam Bettley.", "Ben Bruce, the band's current lead guitarist and backing vocalist, originally formed the band in Dubai, United Arab Emirates in 2006. The band's original line-up consisted of completely different members compared to that of the band's line-up from 2008 and released their debut EP, Tomorrow. Hope. Goodbye. In 2006, then followed up with their debut album titled The Irony of Your Perfection in 2007. After realizing he would not be able to achieve international success in Dubai, he moved back to England, Nottingham in 2008 and reassembled the band with new members from the local area, including lead singer Danny Worsnop, whom he had moved into his flat apartment in York.", "In 2012 the band was listed by Revolver under the most anticipated albums of 2012, with Danny Worsnop giving the statement that the general sound of the album will be a \"...musical baby of Mötley Crüe and Slipknot.\" In March the band participated in Dallas' 'South By So What?!' festival and later toured with support acts Trivium, Dir En Grey, I See Stars, Motionless In White and the Amity Affliction throughout North America from early March to early April, naming the tour 'Still Reckless'.", "Towards the end of their Outbreak tour, Danny Worsnop sustained a torn vocal cord, causing him to sit out the New York performance and allow the singers of Atilla and I See Stars, along with a multi-talented roadie to perform vocal duties. Despite the injury the singer later performed at the memorial concert for Suicide Silence's Mitch Lucker in order to raise money for his now fatherless daughter.", "On 22 January 2015, lead singer Danny Worsnop announced his departure from the band to focus on rock music with his new band We Are Harlot. He also stated that despite his departure, the band would continue touring. Lead guitarist Ben Bruce announced that there would be a new lead singer. Fans reacted to news in distress as they believe he was essential to the band's sound, while others were not surprised by his career move, some going as far to say he performs better with his new band We Are Harlot than he does with Asking Alexandria. When Bruce was queried regarding his status with Worsnop he stated that he felt abandoned long before his departure since Worsnop's lost the care for screaming and heavier music since their release of their second album, and continued to say that he would not know if he could call him and Worsnop friends.", "In mid-October 2016, it was speculated that the band had settled their differences with original lead vocalist Danny Worsnop and that some sort of collaborative effort would be made after several pictures were posted of Worsnop and Bruce in the studio together. However, it was revealed two days later that Worsnop had actually returned to the band as an official member after the departure of Denis Stoff. Ben Bruce explained that after a long period of time of not communicating with the band, Stoff stated, \"Asking Alexandria does not exist unless I get what’s owed to me\". Worsnop also opened up about his return to the band, stating that \"this is something that [he] can embrace again\". When the band performed again for the first time with Worsnop since Stoff's departure, their set list excluded all songs from their most recent album The Black and instead consisted of songs that they had not performed in years. This occurred just as the band headlined Sumerian's \"Ten Years in the Black Tour\" supported by Veil of Maya, Born of Osiris, I See Stars, Upon a Burning Body, After the Burial, and Bad Omens. As time went on more information regarding Stoff had been released, such as that Stoff had lip-synced the band's older songs during live performances, an accusation made by Worsnop's lawyers who notified him after sending Stoff a cease and desist. When asked about Stoff's time as his replacement, Worsnop replied stating that \"Replace is a strong word. He was just keeping my seat warm. Honestly, I don’t know the kid so I have no opinion of him as a person…\" Stoff stated that his departure was due to personal stress caused by the unrest in his home country of Ukraine.", "Ben Bruce has expressed the feeling that the band's lyrical style before Reckless & Relentless was immature. According to Bruce, the band wanted to move on from yelling out lyrics like \"fuck\" and \"you stupid fucking whore\" to a more mature style with more meaning. He stated that From Death to Destiny is lyrically their most mature album, no longer focusing on subjects such as drugs and women, and much more meaningful than their older lyrics. Danny Worsnop has claimed that the band's lyrics are never written before entering the studio and are always improvised during the recording of an album.", "Asking Alexandria - Rock am Ring 2018-4441.jpg|Singer Danny Worsnop", "* Danny Worsnop – lead vocals ; additional guitar ; keyboards, programming "]}, {"page": "Stand Up and Scream", "response": ["* Danny Worsnop – lead vocals, keyboards, programming "]}, {"page": "Sumerian Records", "response": ["* Danny Worsnop (on Better Noise Music)"]}, {"page": "Reckless & Relentless", "response": ["During an interview with Fallen Blue, Danny Worsnop said of the album cover, \"We wanted something shocking, so we had the famous porn actress, Belladonna, just sitting in The Dirty Room.\" Danny further discussed, \"Someone, Somewhere\", a song off the new album as the first one \"that I wrote the lyrics using my emotions as a backdrop.\"", "* Danny Worsnop – lead vocals, keyboards, programming"]}, {"page": "Life Gone Wild", "response": ["* Danny Worsnop – lead vocals, keyboards, programming"]}, {"page": "List of cover versions of Michael Jackson songs", "response": ["|Danny Worsnop||\"Man in the Mirror\"||2013||Thriller: A Metal Tribute to Michael Jackson"]}, {"page": "Trust in Few", "response": ["The band announced that Tyler Smith of The Word Alive and Danny Worsnop of Asking Alexandria would be featured on one track each. Smith was featured on the track \"Not Another Song About You\", though Worsnop was pulled off Trust in Few by his label Sumerian due to the fact the bands' records came out too close together.THE INTERLUDE: You Live You Learn "]}, {"page": "Ronnie Radke", "response": ["As a solo musician, Radke released a rap mixtape, Watch Me, in 2014, which included collaborations with Deuce, , Tyler Carter, Sy Ari Da Kid, Jacoby Shaddix, Danny Worsnop, Andy Biersack, and Craig Mabbitt.", "| \"Brother\" (featuring Danny Worsnop)"]}, {"page": "List of tenors in non-classical music", "response": ["| Danny Worsnop || 1990– || English ||  ||style=text-align:center|"]}, {"page": "Danny Worsnop (Singer)", "response": ["#REDIRECT Danny Worsnop"]}, {"page": "Danny Worsnop (singer)", "response": ["#REDIRECT Danny Worsnop"]}, {"page": "Stepped Up and Scratched", "response": ["* Danny Worsnop – lead vocals, keyboards, programming"]}, {"page": "Breathe Carolina discography", "response": ["* Sellouts (featuring Danny Worsnop) [Fearless Records]"]}, {"page": "Digital Renegade", "response": ["Digital Renegade (stylized as [digital_renegade]) is the third studio album by American electronicore band I See Stars. It was released on March 13, 2012 through Sumerian Records. It features guest vocals by Danny Worsnop from the English metalcore band Asking Alexandria and Cassadee Pope from the American rock band Hey Monday.Jon Ableson, Alter the Press Cassadee Pope To Appear On New I See Stars Album", "* Danny Worsnop (Asking Alexandria) - guest vocals on \"Endless Sky\""]}, {"page": "Under the Influence: A Tribute to the Legends of Hard Rock", "response": ["* Danny Worsnop – lead vocals, keyboards, programming"]}, {"page": "Danny worsnop", "response": ["#REDIRECT Danny Worsnop"]}, {"page": "From Death to Destiny", "response": ["This is the band's last album until their self-titled fifth album to feature the full original line-up, as vocalist Danny Worsnop left the band from January 2015 to October 2016.", "* Danny Worsnop – lead vocals (except track 15), additional guitar"]}]}}