{"wiki_id": "http://www.wikidata.org/entity/Q580278", "itemLabel": "Ian McCulloch", "itemDescription": "English snooker player", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_McCulloch_(snooker_player)", "wikipedia_page": {"main": "Ian McCulloch (born 28 July 1971) is a former English professional snooker player from Walton-Le-Dale, Preston, Lancashire. He is known for his ability to grind opponents down through protracted safety exchanges and disjointed breakbuilding. He compiled 105 century breaks in his career.", "link_mentions": [{"page": "Jimmy White", "response": ["In the 2003–04 season White produced his most consistent season in over a decade. After reaching the semi-finals of the 2003 UK Championship in November 2003, White defeated Neil Robertson, Stephen Hendry and Peter Ebdon to reach the semi-finals of the 2004 Masters – where he lost a tight match against Ronnie O'Sullivan. White followed this up with further victories over Hendry and Robertson en route to the final of the European Open in Malta, but was beaten 3–9 by world number 48 Stephen Maguire. His last ranking victory to date came in April 2004, when White defeated Shaun Murphy, John Parrott, Ian McCulloch, Peter Ebdon and Paul Hunter to win the Players Championship in Glasgow – his first ranking title in over 11 years. Victory in the 2004 World Championship could have given White the number-one ranking, but he was beaten 10–8 by qualifier Barry Pinches after leading 4–2."]}, {"page": "Steve Davis", "response": ["Davis began the 2011–12 season ranked world number 44, his lowest rank since turning professional. Davis reached the final of the 2011 World Seniors Championship before losing 1–2 to Darren Morgan. He participated in the 2011–12 Players Tour Championship; his best result was in the Warsaw Classic, where he reached the semi-finals before losing 3–4 to Ricky Walden, finishing at number 26 on the Order of Merit. He qualified for the 2011 UK Championship by defeating Ian McCulloch and Andrew Higginson, but lost 1–6 in the first round to O'Sullivan. He reached the last 16 of the Welsh Open before losing 0–4 to Murphy. Davis did not qualify for the World Snooker Championship 7–10 to Ben Woollaston."]}, {"page": "Mark Williams (snooker player)", "response": ["On 20 April, in 2005 he became the first Welshman, and the fifth player in history, to score a maximum break at the Crucible Theatre in the World Championship. This came in the final frame of a 10–1 first round victory over Robert Milkins, but he lost in the second round to Ian McCulloch 12–13.", "His first win of the 2007–08 season came in the Grand Prix with a 4–3 win over Ian McCulloch, but he still failed to qualify for the last 16 of the event and was outside the top 32 on the provisional ranking list."]}, {"page": "Paul Hunter", "response": ["At the following year's Masters, he retained his title. He defeated Stephen Lee 6–3 in the first round, Peter Ebdon 6–5 in the quarter-finals and Alan McManus 6–5 in the semi-finals to reach the final, where he met Mark Williams. Hunter lost the first five frames of the final, but won the match and tournament 10–9. Hunter was only the third player to retain the Masters, following Cliff Thorburn and Stephen Hendry. Hunter won his second ranking event the same year, defeating Ken Doherty 9–2 in the final to take the 2002 Welsh Open title. This was his second win at the Welsh Open. Quinten Hann later defeated Hunter 9–10 in the first round of the 2002 World Championship. Later in 2002, Hunter won his third ranking event, the British Open, defeating Ian McCulloch 9–4 in the final. As defending Masters champion, Hunter progressed to the semi-finals of the 2003 event but lost 3–6 to Mark Williams."]}, {"page": "Graeme Dott", "response": ["Dott shone in the 2006 UK Championship as well, reaching the semi-finals, where he lost 7–9 to Stephen Hendry (a player who Dott never managed to beat in a ranking tournament) after an earlier 7–5 lead. He briefly became the provisional world number one in the rankings system after overcoming Jamie Cope 9–5 to win the 2007 China Open, his second ranking tournament win. Prior to this, he disliked going to China, not helped by a disastrous match in 2002. However, going into the 2007 World Championship as defending champion, he suffered a shock 7–10 defeat in the first round to Ian McCulloch in the opening match of the tournament, which dented his prospects of remaining world number 1. Newly crowned world champion John Higgins overtook him. The loss against McCulloch also maintained the \"Crucible curse\", as Dott became the seventeenth consecutive first-time champion to lose his title the very next year."]}, {"page": "Snooker world rankings 2004/2005", "response": ["| Ian McCulloch"]}, {"page": "Snooker world rankings 2003/2004", "response": ["| Ian McCulloch"]}, {"page": "Snooker world rankings 2002/2003", "response": ["| Ian McCulloch"]}, {"page": "Snooker world rankings 2001/2002", "response": ["| Ian McCulloch"]}, {"page": "Snooker world rankings 2000/2001", "response": ["| Ian McCulloch"]}, {"page": "List of snooker players", "response": ["*Ian McCulloch"]}, {"page": "World Open (snooker)", "response": ["|  Ian McCulloch"]}, {"page": "Snooker world rankings 1998/1999", "response": ["| Ian McCulloch"]}, {"page": "Snooker world rankings 1997/1998", "response": ["| Ian McCulloch"]}, {"page": "Snooker world rankings 1994/1995", "response": ["| 257 || Ian McCulloch ||  || 1778"]}, {"page": "Masters (snooker)", "response": ["*In 2006, World Champion Shaun Murphy was ranked 21 so that Ian McCulloch, ranked 16, was not automatically invited. McCulloch was, however, the wild-card choice.", "There were a total of 43 wild-card matches. In 19 of these matches the seeded player played the winner of the Qualifying Event. In the remaining 24 matches the seed played a selected wild-card. The players selected as wild-card were Jimmy White (5), Ding Junhui (3), Steve Davis (2), Marco Fu (2), James Wattana (2), Ken Doherty, Peter Ebdon, Andy Hicks, Alex Higgins, John Higgins, Paul Hunter, Stephen Maguire, Ian McCulloch, Ricky Walden and Gary Wilkinson."]}, {"page": "Stephen Maguire", "response": ["Maguire won the ranking Northern Ireland Trophy in November 2007, defeating Fergal O'Brien 9–5 in the final. His second Triple Crown final came at the 2007 UK Championship. He defeated Joe Swail, Ian McCulloch, Mark Williams and Shaun Murphy to reach the final, where he was defeated by Ronnie O'Sullivan 10–2. At the 2008 China Open, Maguire compiled his first maximum break against Ryan Day in the semi-finals. He won the match 6–5 and then beat Murphy in the final 10–9 on a  to win the title. He reached the quarter-final stage of the 2008 World Championship, but lost in another final-frame decider (12–13) to Joe Perry. He ended the 2007–08 season ranked world number two. He retained this position going into the 2009–10 season, after reaching the semi-finals of both the Shanghai Masters and the UK Championship."]}, {"page": "Snooker world rankings 1999/2000", "response": ["| Ian McCulloch"]}, {"page": "List of snooker player nicknames", "response": ["| rowspan=\"2\" |  Ian McCulloch || The Preston Potter ||"]}, {"page": "McCulloch", "response": ["*Ian McCulloch (singer) (born 1959), English singer", "*Ian McCulloch (actor) (born 1939), Scottish actor", "*Ian McCulloch (snooker player) (born 1971), English snooker player"]}, {"page": "Snooker world rankings 2005/2006", "response": ["| Ian McCulloch"]}, {"page": "List of people from Preston", "response": ["*Ian McCulloch (born 1971) — snooker player who reached career highest ranking of #16"]}, {"page": "Ian McCulloch", "response": ["Ian McCulloch may refer to:", "* Ian McCulloch (actor) (born 1939), British actor", "* Ian McCulloch (singer) (born 1959), English singer, notably of Echo and the Bunnymen", "* Ian McCulloch (snooker player) (born 1971), English snooker player", "* Ian McCulloch (footballer) (born 1948), Australian rules football player for Fitzroy and East Perth"]}, {"page": "Walton-le-Dale", "response": ["*Ian McCulloch, 2005 World Snooker Championships Semi-finalist, was born here."]}, {"page": "Bjorn Haneveer", "response": ["|  Ian McCulloch"]}, {"page": "Neil Robertson", "response": ["Robertson started the 2007–08 season poorly, making early exits in three of the first four ranking events, as well as at the 2008 Masters and the 2008 Malta Cup. He did reach the quarter-finals of the 2007 Northern Ireland Trophy though, after wins over Jamie Cope and Ian McCulloch. He finished the season ranked 10th, but outside the top sixteen on the one-year list."]}, {"page": "Lynette Horsburgh", "response": ["Horsburgh has a recorded high snooker break of 135, only 12 short of a maximum break. She has trained with snooker coaches Sedge McClelland and Stephen Rowlings in snooker, and with eightball-pool world champion Mick Hill as well as Pete Mercer. Like many players, she has various nicknames; hers include \"the Ice Maiden\" for her cool demeanor, as well as \"Spinny\", \"Spinderella\", and \"Wee One\" for her short stature of only  even. This is unusual in the sport, in which reach is an advantage and lack of it requires development of skill with the  ( stick). Horsburgh says she plays in high stiletto heels to compensate, though it causes foot discomfort. She shoots with the same custom-shortened Joe Davis 146 cue stick she has used since her days at the Commonwealth Sporting Club, and favoured three Blackpool snooker halls during their heyday: Potters, Great Harwood, and Rileys. Aside from Steve Davis, she cites Ronnie O'Sullivan as a favourite player. As of 2007, she was sponsored by ProMasters. In 2008, she began working as a personal pool and snooker coach, and an exhibition player (with Karl Boyes, Mick Hill, and Ian McCulloch)."]}, {"page": "Ian McCullogh", "response": ["#REDIRECT Ian McCulloch (snooker player)"]}, {"page": "Anthony Hamilton (snooker player)", "response": ["Hamilton began the 2006–07 season at the Northern Ireland Trophy, losing 3–5 against Ding Junhui. At the Grand Prix Hamilton lost all five of his group stage matches, and didn't advance to the knockout stage. Hamilton then lost 7–9 against Rod Lawler in the first round of the UK Championship, 3–6 in the wild-card round of the Masters, 4–5 against Tom Ford in the first round of the Malta Cup. Hamilton's best result of the season came at the Welsh Open, where he reached the quarter-finals by defeating both Joe Perry and Dave Harold, before losing his match to Steve Davis in a final- decider. Hamilton then lost in the first round of the China Open 4–5 against Mark Selby. Hamilton reached his fourth World Championship quarter-final, pulling off a surprise 10–3 victory over Marco Fu in round 1, and a 13–8 second round win over Ian McCulloch. However, he couldn't advance to the semi-final stage, losing 7–13 to Stephen Maguire. As a result, he did not retain his top sixteen place, falling to number 26 in the rankings for 2007/2008."]}, {"page": "Ian", "response": ["*Ian McCulloch (actor) (born 1939), actor", "*Ian McCulloch (singer), singer in the band Echo & the Bunnymen", "*Ian McCulloch (snooker player) (born 1971), snooker player"]}, {"page": "2005 World Snooker Championship", "response": ["World number six Matthew Stevens held a three frame lead over Andy Hicks after the first session. He increased his lead to 8–3 with a break of 105. Stevens won two additional frames to win the match 10–5. Alan McManus was ahead of Drew Henry 5–4 after the first session, but a 128 by Henry levelled the scores at 5–5. The pair were even for the remainder of the match, going to a  at 9–9. McManus won frame 19 with a break of 63 to win the match 10–9. The previous year's runner up Graeme Dott played world number 17 Ian McCulloch. McCulloch lead 6–3 after the first session before a 111 break put him four frames ahead. McCulloch lead at 8–5, but Dott then won four frames to take the lead. McCulloch managed won the next two frames to win the match. He celebrated his victory wildly, even dancing a jig. Also in the first round, six-time winner Steve Davis defeated Gerard Greene, David Gray defeated by Anthony Hamilton, Jimmy White defeated Fergal O'Brien, and Ken Doherty defeated Barry Pinches.", "Steve Davis trailed debutant Michael Holt 2–6 and 8–10, but won five frames in a row to win 13–10. Seven-time winner Stephen Hendry took only two of the three available sessions to defeat world number 25 Anthony Hamilton 13–3. Hendry led 6–2 after the first session, then won seven of the eight frames in the second. Matthew Stevens held a 12–4 lead after two sessions against Jimmy White. Stevens won frame 17 in a 30-minute session to win 13–4. Alan McManus and Ken Doherty were tied 8-8 after two sessions. Doherty won the next two frames in session three, before McManus leveled the score at 10–10. Doherty lead again after winning frame 21, but McManus won the next two frames to lead 12–11. In frame 24, Doherty missed a , allowing McManus to win the match with a break of 81. Two-time champion Mark Williams led Ian McCulloch 5–3 after the first session. McCulloch won six frames in the next session, including two century breaks, to lead 9–7. At the start of the final session, Williams won four straight frames, then McCulloch equalled the scores at 11–11. McCulloch won frame 23, then Williams made a break of 84 to tie the match at 12–12. McCulloch won the .", "Ian McCulloch and Matthew Stevens played the second semi-final. Stevens trailed 2–6 after the first session, but he leveled the match at 8–8 after the second session. The match was still tied at the end of the third session. In the final session, Stevens won frame 25 with a break of 50, but McCulloch won the next to tie the match at 13–13. Stevens won the next three frames, making a maximum break attempt in frame 27. McCulloch won the next frame, but Stevens won frame 31 to complete a 17–14 victory.", "|   Ian McCulloch 10–9  Ricky Walden", "* 127, 124, 122, 111, 108, 108, 100  Ian McCulloch"]}, {"page": "2004 World Snooker Championship", "response": ["*Six seeded players, Stephen Lee; Hann; Steve Davis; Peter Ebdon; Ken Doherty and Jimmy White, lost in the first round. Lee was defeated 7–10 by Lee Walker and Davis lost to Anthony Hamilton by the same score; 1997 champion Doherty was beaten by two-time semi-finalist Joe Swail 6–10 and Ebdon lost 8–10 against Ian McCulloch.", "|   Ian McCulloch 10–7  Nigel Bond", "* 117, 113, 108, 106  Ian McCulloch"]}, {"page": "2003 World Snooker Championship", "response": ["* 100  Ian McCulloch"]}, {"page": "2002 World Snooker Championship", "response": ["|   Ian McCulloch 10–3  Andrew Norman", "|   James Wattana 10–7  Ian McCulloch"]}, {"page": "2001 World Snooker Championship", "response": ["|   Ian McCulloch 10–8  Neil Robertson", "|   Ian McCulloch 10–4  Joe Johnson", "|   Tony Drago 10–9  Ian McCulloch"]}, {"page": "2000 World Snooker Championship", "response": ["|   Stuart Bingham 10–8  Ian McCulloch"]}, {"page": "1999 World Snooker Championship", "response": ["|   Ian McCulloch 10–9  Barry Pinches", "|   Ian McCulloch 10–6  Peter Lines", "|   Ian McCulloch 10–9  Gary Wilkinson"]}, {"page": "1998 World Snooker Championship", "response": ["|   Ian McCulloch 10–7  Dominic Dale", "|   Bradley Jones 10–9  Ian McCulloch"]}, {"page": "Drew Henry", "response": ["Henry dropped out of the world's top 32 at the end of the 04/05 season after a deciding frame Crucible defeat to old sparring partner Alan McManus in the first round of the World Snooker Championship. The following season was to solid but unspectacular from Henry and in it he made his last appearance on TV at the 2006 China Open where lost 2–5 to Mark Williams, hitting a top break of 115. Henry suffered a very disappointing 06/07 season which left him with a lot of work to do to retain his place in the game's top 64 players the following season. Henry could not remain within the 64 players dropping out after a defeat to Ian McCulloch in the  2008 Welsh Open."]}, {"page": "Ricky Walden", "response": ["In the 2008 Shanghai Masters he defeated Lee Spick and Ian McCulloch to qualify. At the venue he defeated wildcard Zhang Anda, Stephen Hendry, Neil Robertson (5–4, from 1–4 down), Steve Davis in the quarter-finals (5–2, from 0–2 down), and Mark Selby in the semi-final (6–4, from 1–4 down).Walden Springs Shanghai Surprise  He won his first ranking title by beating Ronnie O'Sullivan 10–8 in the final. The rest of the season was solid rather than spectacular, but a qualifying victory over Anthony Hamilton earned him a first appearance at the Crucible Theatre, where he lost 6–10 to Mark Selby."]}]}}