{"wiki_id": "http://www.wikidata.org/entity/Q5800603", "itemLabel": "Ian Hendon", "itemDescription": "English footballer, manager (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Hendon", "wikipedia_page": {"main": "Ian Michael Hendon (born 5 December 1971 in Ilford, Greater London) is an English former professional footballer.", "link_mentions": [{"page": "Northampton Town F.C.", "response": ["* 2000  Ian Hendon (Division Three)"]}, {"page": "Barnet F.C.", "response": ["The 2008–09 season started poorly, and by late September only the three teams that had been docked points prior to the start of the season had lower league positions. After a run of thirteen games without a win in any competition Paul Fairclough announced his resignation to take up a role as director and leaving the first team duties to his assistant Ian Hendon. Fairclough would take over one last game which resulted in a 2–0 win against another relegation threatened side AFC Bournemouth. Results improved, and before the end of the season Hendon was made permanent boss on a 2-year contract. The Bees stayed in Football League Two for the following 2009–10 season, which started with four wins from their first six games. A poor run of form would follow, including a 13-game winless streak, and after five consecutive defeats left the Bees close to the relegation zone, Ian Hendon was sacked in April with two games of the season remaining. Paul Fairclough returned as caretaker manager for the last two games and guided the Bees to safety with a 1–0 win at home to Rochdale on the last day of the season.", "*2008  Ian Hendon", "*2004  Ian Hendon & Danny Maddix (Joint Caretakers)"]}, {"page": "Dover Athletic F.C.", "response": ["Dover Athletic have had 19 permanent managers (excluding caretaker managers) in the club's 25-year history, with Chris Kinnear's first stint being the longest. The shortest stay was Ian Hendon who was announced as manager on 28 May 2010 and resigned only 18 days later to join Andy Hessenthaler at Gillingham.", "|align=left|Ian Hendon||"]}, {"page": "Hendon (disambiguation)", "response": ["* Ian Hendon, English footballer"]}, {"page": "Paul Fairclough", "response": ["In his first full season as Barnet manager Fairclough determined to make up for the previous season's disappointment. The team took the Conference by storm. Following an excellent start to the campaign, the Bees propelled themselves to the top of the division, a position they occupied for the majority of the season. Fairclough's side produced some excellent performances both at Underhill and on the road, including the 3–1 victory over promotion rivals Carlisle United in mid-October, watched by a then-record Conference crowd of 9,215. With a solid defence marshalled by captain Ian Hendon, and 29 goals from striker Giuliano Grazioli, Barnet won the Conference title, securing automatic promotion to the Football League and finishing 12 points clear of their closest challengers with a vastly superior goal difference.", "In April 2010 Fairclough was made caretaker manager at Barnet after the sacking of Ian Hendon, guiding the Bees to safety with a 1–0 win over Rochdale on the last day of the season. He was made Temporary Manager till the end of the season in early 2011 following the sacking of Mark Stimson however stepped down with 8 games to go and was replaced by Martin Allen. He began his fourth managerial spell at Barnet in January 2014 following the departure of Edgar Davids.Fairclough named interim manager After a 1–3 loss at home to Aldershot Town he resigned and was replaced by Ulrich Landvreugd and Dick Schreuder."]}]}}