{"wiki_id": "http://www.wikidata.org/entity/Q580364", "itemLabel": "Marcela Contreras", "itemDescription": "Chilean-British immunologist, science writer, and educator", "wikipedia_url": "https://en.wikipedia.org/wiki/Marcela_Contreras", "wikipedia_page": {"main": "Dame Carmen Marcela Contreras Arriagada, DBE (born 4 January 1942) is a Chilean-born British leading blood expert, immunologist and university educator.\nBorn in Curicó in central Chile and raised in Coelemu, she originally obtained her M.D. degree from the Universidad de Chile, Santiago, in 1968. As a recipient of a British Council scholarship, she went to the UK in 1972 to study immunology and has remained there ever since.\nShe retired in February 2007 as national director for diagnostics, development and research for the National Blood Service (NBS) after working for the organisation for over 20 years. \nHer directorate consisted of nine functions, which included red cell immunohaematology; stem cells and immunotherapy; and histocompatibility and immunogenetics. She is Professor of transfusion medicine at the Royal Free Hospital Medical School, London. In January 2008 she was appointed President of the National Commission of Blood and Tissues of the Chilean Ministry of Health.", "link_mentions": [{"page": "1942", "response": ["** Dame Marcela Contreras, Chilean-British immunologist and educator"]}, {"page": "List of Chileans", "response": ["* Marcela Contreras – immunologist"]}, {"page": "List of Dames Commander of the Order of the British Empire", "response": ["*2007: Jocelyn Bell Burnell, Yasmin Bevan, Marcela Contreras, Mary Douglas, Ann Dowling, Evelyn Glennie, Joan Higgins, Janet Husband, Mary Keegan, Barbara Kelly, Emma Kirkby, Ann Leslie, Mary Marsh, Mary Perkins, Josephine Williams"]}, {"page": "2007 Birthday Honours", "response": ["* Professor Marcela Contreras. Director of Diagnostics, Research and Development, National Blood Service. For services to Healthcare."]}, {"page": "Chileans in the United Kingdom", "response": ["* Marcela Contreras DBE, Scientist"]}, {"page": "Marcela", "response": ["*Marcela Contreras, Chilean-British blood expert and educator"]}, {"page": "List of British scientists", "response": ["* Marcela Contreras (born 1942), blood expert and immunologist"]}]}}