{"wiki_id": "http://www.wikidata.org/entity/Q580464", "itemLabel": "Penny Mordaunt", "itemDescription": "British politician (born 1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/Penny_Mordaunt", "wikipedia_page": {"main": "Penelope Mary Mordaunt  (; born 4 March 1973) is a British Conservative Party politician serving as the Member of Parliament (MP) for Portsmouth North since 2010 and as Minister of State for Trade Policy since September 2021. Mordaunt previously served in Theresa May's Cabinet as International Development Secretary from 2017 to 2019 and Defence Secretary in 2019.\nMordaunt served in the Cameron Government as Parliamentary Under-Secretary of State at the Department for Communities and Local Government (2014–2015) prior to being appointed Minister of State for the Armed Forces at the Ministry of Defence in May 2015, the first woman to hold the post. Starting in July 2016 she served in the May Government as Minister of State for Disabled People, Work and Health at the Department for Work and Pensions. In November 2017, following the resignation of Priti Patel, Mordaunt was appointed Secretary of State for International Development. She also served as Minister for Women and Equalities from 2018 to 2019.\nIn May 2019, Mordaunt was appointed Secretary of State for Defence, replacing Gavin Williamson. She served as Defence Secretary for 85 days, and was the first woman to hold this post. She is currently the only female MP who is a Royal Naval Reservist.In February 2020, Mordaunt re-entered government, joining the Cabinet Office as the Paymaster General, succeeding Oliver Dowden. On 16 September 2021, Mordaunt became Minister of State for Trade Policy during Boris Johnson's second cabinet reshuffle.\n\n", "link_mentions": [{"page": "March 4", "response": ["*  1973   – Penny Mordaunt, English lieutenant and politician, Minister of State for the Armed Forces"]}, {"page": "Portsmouth", "response": ["The city is divided into two parliamentary constituencies, Portsmouth South and Portsmouth North, represented in the House of Commons by Stephen Morgan of the Labour Party and Penny Mordaunt of the Conservative Party respectively. The two Parliamentary constituencies each contain 7 electoral wards, giving an overall total of 14 electoral wards. Portsmouth's inner city centre is located in the Portsmouth South constituency."]}, {"page": "Conservative Democratic Alliance", "response": ["In the event no candidates stood for the CDA at the 2005 General Election, and Letwin held his seat. However, CDA Chairman Michael Keith Smith stood as the UKIP candidate for Portsmouth North. Unsuccessful Tory candidate Penny Mordaunt and political commentator Richard North blamed Smith's intervention for the Tories' failure to win back the seat.UKIP candidate wins £10,000 for internet libel "]}, {"page": "Paymaster General", "response": ["|Penny Mordaunt"]}, {"page": "Secretary of State for International Development", "response": ["| Penny Mordaunt"]}, {"page": "Secretary of State for Defence", "response": ["The post of Secretary of State for Defence was created on 1 April 1964 replacing the positions of Minister of Defence, First Lord of the Admiralty, Secretary of State for War and Secretary of State for Air, while the individual offices of the British Armed Forces were abolished and their functions transferred to the Ministry of Defence. In 1997, Michael Portillo was filling this post at the time of the Portillo moment. In 2019, Penny Mordaunt became the UK's first female defence secretary.", "|The Right HonourablePenny MordauntMP for Portsmouth North(born 1973)"]}]}}