{"wiki_id": "http://www.wikidata.org/entity/Q5818760", "itemLabel": "E. F. Warburg", "itemDescription": "British botanist (1908-1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/E._F._Warburg", "wikipedia_page": {"main": "Edmund Frederic \"Heff\" Warburg (22 March 1908 – 9 June 1966) was an English botanist, known as the co-author of two important British floras. The standard author abbreviation E.F.Warb. is used to indicate this person as the author when citing a botanical name.", "link_mentions": [{"page": "List of botanists", "response": ["*E. F. Warburg"]}, {"page": "Warburg (disambiguation)", "response": ["*E. F. Warburg (1908–1966), English botanist"]}, {"page": "Galanthophile", "response": ["Notable modern galanthophiles include the late Primrose Warburg (1920–1996), after whom G. 'Primrose Warburg' is named: appropriately, it has yellow markings and a yellow ovary. (Primrose ovaries are generally green.) She was married to the noted botanist E. F. Warburg. Several other fine snowdrops originated at her garden at South Hayes in Oxfordshire, including the unusual cultivar named G. 'South Hayes' which has strong green markings on the outer tepals of the flower."]}, {"page": "Arthur Roy Clapham", "response": ["Initially trained in plant physiology, Clapham's contributions included work on sampling design, forecasting crop yields, ecology, plant systematics and palaeoecology. Clapham contributed to Tansley's The British islands and their vegetation, published in 1939, and a series of volumes on the vegetation of Germany for the Naval Intelligence Division during World War II. Beginning in 1940, Clapham took a lead role in the production of the ongoing Biological Flora of the British Isles. In 1953, in conjunction with T.G. Tutin and E. F. Warburg he published the Flora of the British Isles (followed by two later editions in 1962 and 1987) and in 1959, the Excursion Flora of the British Isles. In 1969 he edited and helped publish the Flora of Derbyshire.", "* (with T.G. Tutin and E. F. Warburg), Flora of the British Isles. Cambridge : Cambridge University Press (first edition 1952, second edition 1962 and third edition 1987 with Warburg replaced by D.M. Moore)."]}, {"page": "List of Old Marlburians", "response": ["* E. F. Warburg, botanist"]}, {"page": "Karpatiosorbus admonitor", "response": ["Its unusual name derives from the location of the first tree to be found (not the type specimen) – by a lay-by near Watersmeet in North Devon, with a \"no parking\" sign nailed to the tree. Although first recognised as a distinct variety in the 1930s (by the botanist E. F. Warburg) because of its strongly lobed leaves, it was only accorded species status in 2009, after various biochemical analyses. It is believed at least 110 individuals of the species exist and they are keeping at a stable population. The leaves of the no parking whitebeam have more accentuated lobes than the Devon whitebeam, of which it was thought before to be a variety."]}, {"page": "Tom Tutin", "response": ["In 1944 Tutin was appointed lecturer in charge of the department of botany at University College, Leicester, and in 1947 he became the first professor of botany there. The College became the University of Leicester in 1957. Apart from his teaching and administrative duties, Tutin's interest now turned to taxonomy. Sir Arthur Tansley had drawn his attention to the need for a new British flora, and Tutin began a collaboration with Arthur Roy Clapham and E. F. Warburg, to write the 1591-page Flora of the British Isles, published in 1952, which quickly came to be regarded as the standard work on the subject. A briefer Excursion Flora from the same authors was equally successful. Emboldened by this success, Tutin's ambitions turned to wider geographical areas. At the eighth International Botanical Congress, in Paris in 1954, the need for a flora of Europe was identified, and a group of British botanists formed an editorial committee, with Tutin as chairman, which spent the next twenty and more years in collating and publishing the massive Flora Europaea."]}, {"page": "E.F. Warburg", "response": ["#REDIRECT E. F. Warburg"]}, {"page": "Edmund Frederic Warburg", "response": ["#REDIRECT E. F. Warburg"]}, {"page": "E. F. Warb.", "response": ["#REDIRECT E. F. Warburg"]}, {"page": "E.F.Warb.", "response": ["#REDIRECT E. F. Warburg"]}]}}