{"wiki_id": "http://www.wikidata.org/entity/Q581763", "itemLabel": "Graham Sutherland", "itemDescription": "English artist (1903-1980)", "wikipedia_url": "https://en.wikipedia.org/wiki/Graham_Sutherland", "wikipedia_page": {"main": "Graham Vivian Sutherland  (24 August 1903 – 17 February 1980) was an English artist who is notable for his work in glass, fabrics, prints and portraits. His work was much inspired by landscape and religion, and he designed the tapestry for the re-built Coventry Cathedral.\nPrintmaking, mostly of romantic landscapes, dominated Sutherland's work during the 1920s. He developed his art by working in watercolours before switching to using oil paints in the 1940s. It is these oil paintings, often of surreal, organic landscapes of the Pembrokeshire coast, that secured his reputation as a leading British modern artist. Sutherland taught at a number of art colleges, notably at Chelsea School of Art and at Goldsmiths College, where he had been a student. He served as an official war artist in the Second World War drawing industrial scenes on the British home front.\nSuch was Sutherland's standing in post-war Britain that he was commissioned to design the massive central tapestry in the new Coventry Cathedral, Christ in Glory in the Tetramorph. A number of portrait commissions in the 1950s proved highly controversial. Winston Churchill hated Sutherland's depiction of him. After initially refusing to be presented with it at all, he accepted it disparagingly as “a remarkable example of modern art\". Churchill's wife, Lady Spencer-Churchill, had the painting destroyed within a year of receiving it.In 1955, Sutherland and his wife purchased a property near Nice. Living abroad led to something of a decline in his status in Britain. However, a visit to Pembrokeshire in 1967, his first trip there in nearly twenty years, led to a creative renewal that went some way toward restoring his reputation as a leading British artist.", "link_mentions": {}}}