{"wiki_id": "http://www.wikidata.org/entity/Q58282", "itemLabel": "William Hague", "itemDescription": "British politician (born 1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Hague", "wikipedia_page": {"main": "William Jefferson Hague, Baron Hague of Richmond,  (born 26 March 1961) is a British Conservative politician and life peer who served as Leader of the Conservative Party and Leader of the Opposition from 1997 to 2001. He was the Member of Parliament (MP) for Richmond (Yorks) in North Yorkshire from 1989 to 2015. He served in the Cameron government as First Secretary of State from 2010 to 2015, Secretary of State for Foreign and Commonwealth Affairs from 2010 to 2014, and Leader of the House of Commons from 2014 to 2015.\nHague was educated at Wath Comprehensive School, the University of Oxford and INSEAD, subsequently being returned to the House of Commons at a by-election in 1989. Hague quickly rose through the ranks of the government of John Major and was appointed to Cabinet in 1995 as Secretary of State for Wales. Following the Conservatives' defeat at the 1997 general election by the Labour Party, he was elected Leader of the Conservative Party at the age of 36.\nHague resigned as Conservative leader after the 2001 general election following his party's second defeat, at which the Conservatives made a net gain of just one seat. He returned to the backbenches, pursuing a career as an author, writing biographies of William Pitt the Younger and William Wilberforce. He also held several directorships, and worked as a consultant and public speaker.\nAfter David Cameron was elected Leader of the Conservative Party in 2005, Hague was reappointed to the Shadow Cabinet as Shadow Foreign Secretary. He also assumed the role of Senior Member of the Shadow Cabinet, serving as Cameron's deputy. After the formation of the coalition government in 2010, Hague was appointed First Secretary of State and Foreign Secretary. Cameron described him as his \"de facto political deputy\". On 14 July 2014, Hague stood down as Foreign Secretary and became Leader of the House of Commons. He did not stand for re-election at the 2015 general election. He was awarded a life peerage in the 2015 Dissolution Honours List on 9 October 2015.", "link_mentions": [{"page": "Ann Widdecombe", "response": ["Born in Bath, Somerset, Widdecombe read Latin at the University of Birmingham and later studied philosophy, politics and economics at Lady Margaret Hall, Oxford. She is a convert from Anglicanism to Roman Catholicism and was a member of the Conservative Christian Fellowship. She served as Minister of State for Employment from 1994 to 1995 and Minister of State for Prisons from 1995 to 1997. She later served in the Shadow Cabinet of William Hague as Shadow Secretary of State for Health from 1998 to 1999 and Shadow Home Secretary from 1999 to 2001. She was appointed to the Privy Council in 1997.", "After the Conservative landslide defeat at the 1997 general election, she served as Shadow Health Secretary between 1998–1999 and later as Shadow Home Secretary from 1999 to 2001 under the leadership of William Hague."]}, {"page": "2001 United Kingdom general election", "response": ["The opposition Conservative Party, under William Hague's leadership, was still deeply divided on the issue of Europe and the party's policy platform had drifted considerably to the right. A series of publicity stunts that backfired also harmed Hague, and he resigned as party leader three months following the election, becoming the first leader of the Conservative and Unionist Party in the House of Commons since Austen Chamberlain nearly eighty years prior not to serve as prime minister.", "For William Hague, however, the Conservative Party had still not fully recovered from the loss in 1997. The party was still divided over Europe, and talk of a referendum on joining the Eurozone was rife. As Labour remained at the political centre, the Tories moved to the right. A policy gaffe by Oliver Letwin over public spending cuts left the party with an own goal that Labour soon exploited.", "For the Conservatives, this huge loss they had sustained in 1997 was repeated. Despite gaining nine seats, the Tories lost seven to the Liberal Democrats, and one even to Labour. William Hague was quick to announce his resignation, doing so at 07:44 outside the Conservative Party headquarters. Some believed that Hague had been unlucky; although most considered him to be a talented orator and an intelligent statesman, he had come up against the charismatic Tony Blair in the peak of his political career, and it was no surprise that little progress was made in reducing Labour's majority after a relatively smooth parliament."]}, {"page": "Coldcut", "response": ["Coldcut continued to forge interesting collaborations, including 2001's Re:volution as an EP in which Coldcut created their own political party (The Guilty Party). Featuring scratches and samples of Tony Blair and William Hague speeches, the 3-track EP included Nautilus' \"Space Journey\", which won an Intermusic contest in 2000. The video was widely played on MTV. With \"Space Journey\", Coldcut were arguably the first group to give fans access to the multitrack parts, or \"stems\" of their songs, building on the idea of interactivity and sharing from Let Us Play."]}, {"page": "Double jeopardy", "response": ["Both Jack Straw (then Home Secretary) and William Hague (then Leader of the Opposition) favoured this measure. These recommendations were implemented—not uncontroversially at the time—within the Criminal Justice Act 2003, and this provision came into force in April 2005.Double jeopardy law ushered out, BBC News. 3 April 2005 It opened certain serious crimes (including murder, manslaughter, kidnapping, rape, armed robbery, and serious drug crimes) to a retrial, regardless of when committed, with two conditions: the retrial must be approved by the Director of Public Prosecutions, and the Court of Appeal must agree to quash the original acquittal due to \"new and compelling evidence\".Retrial of Serious Offences. The CPS. Retrieved on 2 January 2012. Then Director of Public Prosecutions, Ken Macdonald QC, said that he expected no more than a handful of cases to be brought in a year."]}, {"page": "David Beckham", "response": ["Beckham visited Afghanistan in May 2010 for a morale-boosting visit to British troops fighting the Taliban insurgency. The appearance of Beckham as well as British Foreign Secretary William Hague and Defence Secretary Liam Fox was believed to have prompted a Taliban attack on Kandahar airfield."]}, {"page": "European Democrats", "response": ["On 1 May 1992, the ED (now largely composed of UK Conservative Party members) dissolved, and its remaining members were accorded \"associated party\" status in the European People's Party Group; that is, being part of the parliamentary group without retaining actual membership in the EPP Europarty organisation. This was considered essential for the Conservatives, as the EPP was generally seen as quite favourable to European integration, a stance at odds with their core ideology. The Conservatives' relationship to the EPP would become a sore point in the following years, particularly for the eurosceptic general membership in Britain. Then-leader of the British Conservative Party William Hague hoped to put the issue to rest by negotiating a new arrangement in 1999 by which the EPP's parliamentary group would rebrand itself as the European People's Party–European Democrats (EPP-ED), with the \"European Democrat\" nomenclature returning after a seven-year hiatus.  This was intended to nominally underscore the Conservatives' status apart from the rest of EPP, and it was hoped that with the coming enlargement of the European Union numerous newly involved right-wing parties, averse to the EPP proper for its perceived European federalism, would be willing to instead enter the ED subgroup, growing the overall alignment."]}, {"page": "Euroscepticism", "response": ["Historically, the Conservative Party has expressed divided sentiments on the issue of EU membership, with the official stance changing with party leadership and individual MPs within the party variously favouring total withdrawal and remaining in the EU, while others adopted a position of soft Euroscepticism being supportive of membership but opposed to joining the eurozone and pursuing further integration. Until the 1980s, the Conservative Party was somewhat more pro-EU than the Labour Party: for example, in the 1971 House of Commons vote on whether the UK should join the European Economic Community, only 39 of the then 330 Conservative MPs were opposed to membership. In 2009 the Conservative Party actively campaigned against the Lisbon Treaty, which it believes would give away too much sovereignty to Brussels. Shadow Foreign Secretary William Hague stated that, should the treaty be in force by the time of an incoming Conservative government, he would \"not let matters rest there\". Following the election of Boris Johnson as leader in 2019, the Conservative Party became a strong supporter of the withdrawal of the United Kingdom from the European Union and its platform was changed to unanimously support EU withdrawal. In the 2019 general election the Conservative Party adopted a clear pro-Brexit platform in its manifesto."]}, {"page": "Foreign relations of Hong Kong", "response": ["For example, the then Chief Executive Donald Tsang visited London and Edinburgh in 2011 as part of his European tour to renew ties with the UK and promote Hong Kong as a gateway to Asia. He met Prime Minister David Cameron and Foreign Secretary William Hague, and the Chancellor of the Exchequer George Osborne. In mid-2011, Donald Tsang visited Australia in June to strengthen ties between Hong Kong and Australia, promote trade opportunities, and encourage more Australian companies, particularly resources companies, to list in Hong Kong. During his visit, Mr Tsang held meetings with the Prime Minister, Julia Gillard, and the Minister for Foreign Affairs, Kevin Rudd, as well as the leader of the Opposition, Tony Abbott, and the Shadow Minister for Foreign Affairs, Julie Bishop."]}, {"page": "Hen Wlad Fy Nhadau", "response": ["The existence of a separate national anthem for Wales has not always been apparent to those from outside the country. In 1993 the newly appointed Secretary of State for Wales John Redwood was embarrassingly videotaped opening and closing his mouth during a communal singing of the national anthem, clearly ignorant of the words but unable to mime convincingly; the pictures were frequently cited as evidence of his unsuitability for the post. According to John Major's autobiography, the first thing Redwood's successor William Hague said, on being appointed, was that he had better find someone to teach him the words. He found Ffion Jenkins, and later married her."]}, {"page": "John Major", "response": ["By 1995, splits over EU policy and the loss of numerous MPs to a series of sexual and financial scandals (widely known as \"sleaze\") led Major to resign as party leader in June, challenging his critics to either back him or challenge him; he was duly challenged by John Redwood but was easily re-elected. This did not lead to an improvement in his political standing, and by December 1996, the Government had lost its majority in the House of Commons. At the 1997 election, after the Conservatives had been in power for 18 years, Major lost to Tony Blair's Labour Party in one of the largest electoral defeats since the 1832 Great Reform Act. Major resigned as Leader of the Conservative Party following the defeat and was succeeded by William Hague.", "Major served as Leader of the Opposition for seven weeks while the leadership election to replace him was underway. He formed a temporary Shadow Cabinet, but with seven of his Cabinet ministers having lost their seats at the election, and with few senior MPs left to replace them, several MPs had to hold multiple briefs. Major himself served as shadow foreign secretary (having served as foreign secretary for three months in 1989) and Shadow Secretary of State for Defence, and the office of Shadow Secretary of State for Scotland was left vacant until after the 2001 general election as the party no longer had any Scottish MPs. Major's resignation as Conservative Leader formally took effect on 19 June 1997 after the election of William Hague."]}, {"page": "Jeffrey Archer", "response": ["In 1999, Archer had been selected by the Conservative Party as candidate for the London mayoral election of 2000, with the support of two former Prime Ministers, Baroness Thatcher and John Major.\"Lord Archer - A taste for fiction\" , The Economist, 19 July 2001. Eight Conservative ex-Cabinet Ministers who had been in office during the Thatcher and Major governments wrote to The Daily Telegraph in support of Archer's candidature. However, on 21 November 1999 the News of the World published allegations made by Ted Francis, a former friend of Archer, that Archer had committed perjury in his 1987 libel case. Archer withdrew his candidature the following day. After the allegations, Archer was disowned by his party. Conservative leader William Hague explained: \"This is the end of politics for Jeffrey Archer. I will not tolerate such behaviour in my party.\" On 4 February 2000, Archer was expelled from the party for five years."]}, {"page": "Margaret Thatcher", "response": ["Many Thatcherite policies had an influence on the Labour Party, which returned to power in 1997 under Tony Blair. Blair rebranded the party \"New Labour\" in 1994 with the aim of increasing its appeal beyond its traditional supporters, and to attract those who had supported Thatcher, such as the \"Essex man\". Thatcher is said to have regarded the \"New Labour\" rebranding as her greatest achievement. In contrast to Blair, the Conservative Party leader at the time William Hague attempted to distance himself and the party from Thatcher's economic policies in an attempt to gain public approval."]}, {"page": "March 26", "response": ["*1961 – William Hague, English historian and politician, First Secretary of State"]}, {"page": "Foreign relations of South Korea", "response": ["* 2013 October Secretary of State for Foreign and Commonwealth Affairs William Hague (to attend Seoul Conference on Cyberspace 2013)."]}, {"page": "Foreign relations of Somalia", "response": ["Following the establishment of the Federal Government of Somalia in mid-2012, British Prime Minister David Cameron welcomed the new administration and re-affirmed Britain's continued support for the Somali authorities. On 25 April 2013, the UK also became the first Western country to re-open its embassy in Somalia, with British First Secretary of State William Hague attending the opening ceremony. Harriet Mathews was appointed British Ambassador to Somalia in 2015, and as of January 2017 has since been replaced by David Concar."]}, {"page": "Conservative Party (UK)", "response": ["==== William Hague ====", "John Major resigned as party leader after the Conservatives were heavily defeated in a landslide and was succeeded by William Hague. Though Hague was a strong orator, a Gallup poll for The Daily Telegraph found that two-thirds of voters regarded him as \"a bit of a wally\", for headlines such as his claim that he drank 14 pints of beer in a single day in his youth. He was also criticised for attending the Notting Hill Carnival and for wearing a baseball cap in public in what were seen as poor attempts to appeal to younger voters. Shortly before the 2001 general election, Hague was much maligned for a speech in which he predicted that a re-elected Labour government would turn the UK into a \"foreign land\". The BBC also reported that the Conservative peer John Lord Taylor criticised Hague for not removing the whip from John Townend, a Conservative MP, after the latter made a speech in which he said the British were becoming \"a mongrel race\", although Hague did reject Townend's views.", "Since 1997, debate has occurred within the party between 'modernisers' such as Alan Duncan, who believe that the Conservatives should modify their public stances on social issues, and 'traditionalists' such as Liam Fox and Owen Paterson, who believe that the party should remain faithful to its traditional conservative platform. William Hague and Michael Howard campaigned on traditionalist grounds in the 2001 and 2005 general elections respectively, and 2001 also saw the election of traditionalist Iain Duncan Smith as party leader. In the current parliament, modernising forces are represented by MPs such as Neil O'Brien, who has argued that the party needs to renew its policies and image, and is said to be inspired by Macron's centrist politics. Ruth Davidson is also seen as a reforming figure, as is the Minister for Women and Equalities and Minister for Levelling up Communities, Kemi Badenoch. Many of the original 'traditionalists' remain influential, though Duncan Smith’s influence in terms of Commons contributions has waned. Many 'traditionalist' backbenchers such as Christopher Chope, Peter Bone and Jacob Rees-Mogg command significant media attention for their use of fillibustering and frequent interjections, and so remain influential forces in the Commons, though they cannot be taken to represent all 'traditionalist' Conservatives.", "In 2009 the Conservative Party actively campaigned against the Lisbon Treaty, which it believes would give away too much sovereignty to Brussels. Shadow Foreign Secretary William Hague stated that, should the treaty be in force by the time of an incoming Conservative government, he would \"not let matters rest there\". However, on 14 June 2009 the shadow Business Secretary, Kenneth Clarke, said in an interview to the BBC that the Conservative Party would not reopen negotiations on the Lisbon Treaty if the Irish backed it in a new referendum.", "The \"free-market wing\" of economic liberals achieved dominance after the election of Margaret Thatcher as party leader in 1975. Their goal was to reduce the role of the government in the economy and to this end, they supported cuts in direct taxation, the privatisation of nationalised industries and a reduction in the size and scope of the welfare state. Supporters of the \"free-market wing\" have been labelled as \"Thatcherites\". The group has disparate views of social policy: Thatcher herself was socially conservative and a practising Anglican but the free-market wing in the Conservative Party harbour a range of social opinions from the civil libertarian views of Michael Portillo, Daniel Hannan, and David Davis to the traditional conservatism of former party leaders William Hague and Iain Duncan Smith. The Thatcherite wing is also associated with the concept of a \"classless society\".", "|data-sort-value=\"hag\"|William Hague", "| William Hague", "| William Hague"]}, {"page": "2001", "response": ["**British politician William Hague resigns as Leader of the Opposition and Leader of the Conservative Party"]}, {"page": "1961", "response": ["* March 26 – William Hague, former UK Foreign Secretary and former Leader of the UK Conservative Party"]}, {"page": "Abolitionism", "response": ["After the formation of the Committee for the Abolition of the Slave Trade in 1787, William Wilberforce led the cause of abolition through the parliamentary campaign. Thomas Clarkson became the group's most prominent researcher, gathering vast amounts of data on the trade. One aspect of abolitionism during this period was the effective use of images such as the famous Josiah Wedgwood \"Am I Not A Man and a Brother?\" anti-slavery medallion of 1787.  Clarkson described the medallion as \"promoting the cause of justice, humanity and freedom\".Elizabeth Mcgrath and Jean Michel Massing (eds), The Slave in European Art: From Renaissance Trophy to Abolitionist Emblem, London, 2012. The 1792 Slave Trade Bill passed the House of Commons mangled and mutilated by the modifications and amendments of Pitt, it lay for years, in the House of Lords. Biographer William Hague considers the unfinished abolition of the slave trade to be Pitt's greatest failure. The Slave Trade Act was passed by the British Parliament on 25 March 1807, making the slave trade illegal throughout the British Empire.Clarkson, T., History of the Rise, Progress and Accomplishment of the Abolition of the African Slave Trade by the British Parliament, London, 1808. Britain used its influence to coerce other countries to agree to treaties to end their slave trade and allow the Royal Navy to seize their slave ships. Britain enforced the abolition of the trade because the act made trading slaves within British territories illegal. However, the act repealed the Amelioration Act 1798 which attempted to improve conditions for slaves. The end of the slave trade did not end slavery as a whole. Slavery was still a common practice."]}, {"page": "Hotline", "response": ["A London–Moscow hotline was not formally established until a treaty of friendship between the two countries in 1992. An upgrade was announced when Foreign Secretary William Hague visited Moscow in 2011."]}, {"page": "Christopher Lee", "response": ["Lee identified as an Anglo-Catholic Christian. Politically, Lee supported the Conservative Party. He described Michael Howard as \"the ideal person to lead the party\" in 2003, and also supported William Hague and David Cameron."]}, {"page": "Foreign, Commonwealth and Development Office", "response": ["In 2011, the then Foreign Secretary, William Hague, announced the government's intention to a number of new diplomatic posts in order to enhance the UK's overseas network. As such, eight new embassies and six new consulates were opened around the world.", "Following a prior announcement by the then Foreign Secretary William Hague, the FCO opened the Diplomatic Academy in February 2015. The new centre, opened by the Duke of Cambridge, was established in order to create a cross-government centre of excellence for all civil servants working on international issues. The Diplomatic Academy serves to broaden the FCO's network and engaged in more collaborative work with academic and diplomatic partners."]}, {"page": "Foreign Secretary", "response": ["| William Hague"]}, {"page": "Michael Heseltine", "response": ["The day after the government was defeated at the 1997 general election, Heseltine suffered an attack of angina and had a tube inserted into an artery; he declined to stand for the Conservative Party leadership again.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 529. However, he was less unpopular with eurosceptics than Clarke, and on the third ballot of the subsequent leadership election Clarke, facing imminent defeat by William Hague, offered to stand aside in Heseltine's favour, but he declined on medical advice.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 532–4.Clarke 2016, p. 399. He became active in promoting the benefits for Britain of joining the Single European Currency, appearing on the same stage as Tony Blair, Gordon Brown and Robin Cook as part of an all-party campaign to promote Euro membership. He was also made a Companion of Honour in the 1997 resignation Honours List. In November 1999 Heseltine was invited by Hague to be the Conservative candidate for the new position of Mayor of London (in place of Jeffrey Archer who had had to stand down because of scandal), but he declined.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 531."]}, {"page": "Norman Tebbit", "response": ["In a letter to The Daily Telegraph in November 1998, Tebbit said homosexuals should be barred from being Home Secretary. A Conservative Party spokesman said Tebbit was \"out of touch\" and the official spokesman for William Hague, then Conservative Party leader, said Hague disagreed with Tebbit. However, Tebbit wrote in his Telegraph blog in 2013: \"Do I still hold that a homosexual should not be Home Secretary? It gets a straight answer. No, our openness about homosexuality has changed the circumstances and my view has now changed too\"."]}, {"page": "Foreign relations of Iran", "response": ["As part of the UK's response to this incident the Secretary of State for Foreign and Commonwealth Affairs, William Hague, announced on 30 November 2011 that the United Kingdom had shut the embassy in Tehran and recalled all diplomatic staff. The Iranian chargé d'affaires in London was simultaneously instructed to immediately close the Iranian embassy in London and given a 48-hour ultimatum for all staff to leave the UK.", "On Tuesday 17 June 2014 the Secretary of State for Foreign and Commonwealth Affairs, William Hague, announced that the UK embassy would re-open \"as soon as practical arrangements are made\".  On the same day David Cameron, the UK Prime Minister said he is committed to \"rebuilding\" diplomatic relations with Iran but will proceed with a \"clear eye and hard head\". The embassy reopened on 23 August 2015."]}, {"page": "If... (comic)", "response": ["* William Hague, portrayed as a squat figure (sometimes a schoolboy) with a very bulbous head like a light bulb or the Mekon."]}]}}