{"wiki_id": "http://www.wikidata.org/entity/Q582442", "itemLabel": "Sandy Clark", "itemDescription": "Scottish footballer (born 1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sandy_Clark", "wikipedia_page": {"main": "Alexander \"Sandy\" Clark (born 28 October 1956 in Airdrie) is a Scottish professional football player and coach.", "link_mentions": [{"page": "Airdrie, North Lanarkshire", "response": ["*Sandy Clark"]}, {"page": "Partick Thistle F.C.", "response": ["|Sandy Clark"]}, {"page": "Old Firm", "response": ["*Sandy Clark and Nicky Clark (Rangers)"]}, {"page": "Heart of Midlothian F.C.", "response": ["Hearts finished league runners-up again in 1988 and 1992. The club reached the quarter-finals of the 1988–89 UEFA Cup losing out to Bayern Munich 2–1 on aggregate. After MacDonald's summer 1990 departure the club struggled to settle on a manager. Within a two-year period, Joe Jordan, Sandy Clark and Tommy McLean were all sacked. From April 1989 to April 1994, Hearts went on a run of 22 games in a row without defeat against arch-rivals Hibernian in the Edinburgh Derby.", "* Sandy Clark (1993–1994)"]}, {"page": "Hamilton Academical F.C.", "response": ["*  Sandy Clark, 1996–1998"]}, {"page": "St Johnstone F.C.", "response": ["Although Sturrock soon left for Dundee United, the club found a second 'golden period' in 1998–99 under new manager Sandy Clark, when the club finished third in the SPL behind Rangers and Celtic. Saints also reached the final of the League Cup and the semi-finals of the Scottish Cup in that season, losing to Rangers in both competitions. They lost to Rangers in five of the six meetings between the two clubs that season (including a 7–0 home defeat), but Saints won 3–1 in the other game.St Johnstone 3–1 Rangers, Soccerbase. Their finishing position in the league meant Saints had qualified for the 1999–00 UEFA Cup campaign. They started with a 3–1 aggregate win in the qualifying round over Finnish side VPS Vaasa, but were beaten 6–3 on aggregate by French giants AS Monaco in the first round proper. The return leg meant that international stars such as Fabien Barthez, John Arne Riise and David Trezeguet played at McDiarmid Park. St Johnstone remained unbeaten at home in European competitions until their tie against FC Minsk in 2013.", "* Sandy Clark (7 Sep 1998–25 Sep 2001)"]}, {"page": "Kilmarnock F.C.", "response": ["Allan Johnston signed a two-year contract and was appointed manager on 24 June 2013, with Sandy Clark as the assistant manager. Sandy Clark left his role in the summer of 2014 with the club looking to go in a new direction, and ex-Killie player and former Hearts manager Gary Locke was appointed as his assistant."]}, {"page": "Berwick Rangers F.C.", "response": ["* Sandy Clark (Oct 2004 – May 2005)"]}, {"page": "Queen of the South F.C.", "response": ["The club won the Division B Championship in 1950–51, the Second Division Championship in 2001–02 and 2012–13, and the Scottish Challenge Cup in 2002–03 and 2012–13. Queens led Scotland's top division until New Year in the 1953–54 season: their highest finish in Scotland's top division was fourth in 1933–34. The club reached their first major cup final in 2008 when they reached the final of the Scottish Cup, where they were runners-up to Rangers. The club's current manager is Allan Johnston, in his second spell in charge alongside assistant manager Sandy Clark.", "*Assistant Manager: Sandy Clark"]}, {"page": "Jimmy Calderwood", "response": ["In December 2007, Calderwood led Aberdeen to the last 32 of European competition for the first time since 1986 with a surprising 4–0 demolition of FC Copenhagen at Pittodrie. With this great achievement, the Dons were rewarded by drawing FC Bayern Munich. Calderwood's team drew 2–2 with Bayern at Pittodrie on 14 February 2008, but the Germans pulled off a convincing 5–1 win the following week. Calderwood signed a -year contract to end a month of speculation about his future, along with assistant manager Jimmy Nicholl and coach Sandy Clark."]}, {"page": "Airdrieonians F.C. (1878)", "response": ["| Sandy Clark", "| Sandy Clark", "| Sandy Clark", "| Sandy Clark"]}]}}