{"wiki_id": "http://www.wikidata.org/entity/Q5839167", "itemLabel": "Trevor Aston", "itemDescription": "British historian/academic at the University of Oxford", "wikipedia_url": "https://en.wikipedia.org/wiki/Trevor_Aston", "wikipedia_page": {"main": "Trevor Henry Aston (14 June 1925 – 17 October 1985) was a British historian and academic at the University of Oxford. He was a tutor in history and fellow of Corpus Christi College, Oxford from 1952 to 1985. In addition, he served as Keeper of the Archives of the University of Oxford from 1969 to 1985.", "link_mentions": [{"page": "Kenneth Dover", "response": ["In 1994 he published a controversial autobiography entitled \"Marginal Comment\". This prompted media attentionReview of \"Marginal Comment\" by John Gross \"The New Criterion\" March 1995 because of its frank description of his private life, and Dover's admission of wanting to murder one of the fellows of Corpus Christi College, the historian Trevor Aston.Obituary by Stephen Halliwell, \"The Guardian\" 8 March 2010 Concerned about the effect that Aston's personal problems were having on the reputation of the college, Dover wrote that \"It was clear to me that Trevor and the College must somehow be separated, and my problem was one which I feel compelled to define with brutal candour: how to kill him without getting into trouble.\" Aston later committed suicide.Obituary, Daily Telegraph 8 March 2010"]}, {"page": "Rodney Hilton", "response": ["*\"Introduction\", in The Brenner Debate: Agrarian Class Structure and Economic Development in Pre-Industrial Europe, ed. by Trevor Aston and C.H.E. Philpin (1985)"]}, {"page": "Edward Bridges, 1st Baron Bridges", "response": ["* Hon. Margaret Evelyn Bridges (1932–2014) a medieval historian. married, firstly, Trevor Aston, secondly Paul Buxton."]}, {"page": "Brenner debate", "response": ["Historians Trevor Aston and C. H. E. Philpin (1985) characterised the debate as 'one of the most important historical debates of recent years'.Trevor Aston and C. H. E. Philpin, 'Preface', in The Brenner Debate: Agrarian Class Structure and Economic Development in Pre-Industrial Europe, ed. by Trevor Aston and C.H.E. Philpin, Past and Present Publications (Cambridge: Cambridge University Press, 1985), p. vii.", "These studies were republished with some additional material in The Brenner Debate: Agrarian Class Structure and Economic Development in Pre-Industrial Europe, ed. by Trevor Aston and C.H.E. Philpin, Past and Present Publications (Cambridge: Cambridge University Press, 1985), , which was to be reprinted many times."]}, {"page": "Margaret Aston", "response": ["In 1954, she married Trevor Aston. He was a historian and a fellow of Corpus Christi College, Oxford. They had a difficult marriage, due in part because Trevor was suffering from bipolar disorder, and separated after four years. They finally divorced in 1969."]}]}}