{"wiki_id": "http://www.wikidata.org/entity/Q583783", "itemLabel": "Louise Mensch", "itemDescription": "British politician (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Louise_Mensch", "wikipedia_page": {"main": "Louise Daphne Mensch (née Bagshawe; born 28 June 1971) is a British blogger, novelist, and former Conservative Member of Parliament. In the 1990s she became known as a writer of chick lit novels under her maiden name Louise Bagshawe. She was elected Conservative MP for Corby at the 2010 UK general election.Mensch resigned as an MP in August 2012 to move to New York City to live with her second husband, American music manager Peter Mensch. She began working for News Corp in 2014, and co-launched its Heat Street website in February 2016. Since leaving Heat Street in December 2016, she has published primarily on her blog Patribotics, which she launched in January 2017, and her Twitter account. She left News Corp entirely in March 2017.\nMensch and Heat Street have since courted controversy by promoting unverified claims, hoaxes, and conspiracy theories about the Trump administration and its ties to the Russian Federation.Among other allegations she has posted online, Mensch claimed that she had obtained evidence that Russian president Vladimir Putin had American conservative commentator Andrew Breitbart, the founder of Breitbart News who died of a heart attack in 2012, murdered so his job would go to his deputy, Steve Bannon. She has stated that the 2017 Istanbul nightclub shooting, which was perpetrated by Abdulkadir Masharipov on behalf of the terrorist organization Islamic State of Iraq and the Levant, was a Russian false flag operation with Russia posing as ISIL.She has stated that \"Bannon and his team\" were behind the 2017 Jewish Community Center bomb threats that were committed by two people, American Juan M. Thompson and Israeli-American Michael David Kadar, with no ties to Bannon. She has claimed Russian intelligence planted inflammatory emails implicating former U.S. Senator and 2016 Democratic Party presidential candidate Hillary Clinton on disgraced former U.S. House member Anthony Weiner's computer. Mensch has also, without evidence, accused numerous people, including Facebook founder Mark Zuckerberg and venture capitalist Peter Thiel, of being Russian \"shills\", \"moles\" and \"agents of influence\".Buzzfeed called Mensch an \"anti–Russian influence crusader\" and one of a number of \"anti-Trump public figures [who] share unreliable information\". Zack Beauchamp, a reporter for Vox who has written at length about Mensch, has said she was the equivalent of an Alex Jones of the right: \"I would say the closest analog would be Infowars\", he said.", "link_mentions": [{"page": "United States Foreign Intelligence Surveillance Court", "response": ["In November 2016, Louise Mensch reported on the news website Heat Street that, after an initial June 2016 FBI request was denied, the FISA court had granted a more narrowly-focused October request from the FBI \"to examine the activities of 'U.S. persons' in Donald Trump's campaign with ties to Russia\".  On 12 January 2017, BBC journalist Paul Wood reported that, in response to an April 2016 tip from a foreign intelligence agency to the CIA about \"money from the Kremlin going into the US presidential campaign\", a joint taskforce had been established including representatives of the FBI, the Department of the Treasury, the Department of Justice, the CIA, the Office of the Director of National Intelligence and the National Security Agency. In June 2016, lawyers from the Department of Justice applied to the FISA court for \"permission to intercept the electronic records from two Russian banks\". According to Wood, this application was rejected, as was a more narrowly focused request in July, and the order was finally granted by a different FISA judge on 15 October, three weeks before the presidential election. On January 19, The New York Times reported that one of its sources had claimed \"intelligence reports based on some of the wiretapped communications had been provided to the White House\"."]}, {"page": "Jimmy Page", "response": ["In November 2011, British Conservative MP Louise Mensch launched a campaign to have Page knighted for his contributions to the music industry. In December 2012, Page, along with Plant and Jones, received the annual Kennedy Center Honors from President Barack Obama in a White House ceremony. The honour is the U.S.'s highest award for those who have influenced American culture through the arts. In February 2013, Plant hinted that he was open to a Led Zeppelin reunion in 2014, stating that he is not the reason for the band's dormancy, saying \"Jimmy Page and John Paul Jones are quite contained in their own worlds and leave it to [him]\", adding that he is \"not the bad guy\" and that he has \"got nothing to do in 2014.\""]}, {"page": "List of events named massacres", "response": ["|Bataclan massacre (2016)Louise Mensch, \"France 'Suppressed Reports of Gruesome Torture' at Bataclan Massacre,\" July 15, 2016."]}, {"page": "Christ Church, Oxford", "response": ["In other fields, Cameron and Tyler Winklevoss, twins associated with the founding of Facebook, King Edward VII (1841–1910), King of the United Kingdom and Emperor of India, King William II of the Netherlands, entrepreneur and founder of Pennsylvania William Penn, broadcaster David Dimbleby, MP Louise Mensch, BBC composer Howard Goodall, actor Riz Ahmed, the writer Lewis Carroll, poet W. H. Auden, and the former officer of arms Hubert Chesshyre are other notable students to have previously studied at Christ Church."]}, {"page": "Corby", "response": ["The Corby constituency contains parts of traditionally Conservative East Northamptonshire that balance the traditionally Labour town of Corby leading to a marginal constituency that has gone to the party forming the UK Government at every general election since the creation of the constituency in 1983. At the 2005 general election, Labour won Corby with a majority of just over 1,000 votes. At the 2010 general election, the sitting Labour MP Phil Hope lost the seat to writer Louise Bagshawe, the Conservative Party candidate, who became Louise Mensch after her marriage the following year."]}, {"page": "Oundle", "response": ["*Louise Mensch – briefly the local Member of Parliament (MP), lived in Oundle  "]}, {"page": "Austin Mitchell", "response": ["On 29 October 2012, Mitchell directed a tweet at former Conservative MP Louise Mensch, saying \"A good wife doesn’t disagree with her master in public and a good little girl doesn’t lie about why she quit politics.\" He also referred to Mensch as \"Menschkin.\" The comments were widely condemned as being sexist, with Mensch demanding an apology from both Mitchell and Ed Miliband. Mitchell responded that he was being \"ironic\"."]}, {"page": "List of Have I Got News for You episodes", "response": ["|Louise Mensch MP"]}, {"page": "Piers Morgan", "response": ["He came under criticism for his \"boasting\" about phone hacking from Conservative MP Louise Mensch, who has since apologised for these accusations."]}, {"page": "Dawson's Field hijackings", "response": ["On 7 September 1970, the hijackers held a press conference for 60 members of the media who had made their way to what was being called \"Revolution Airport.\" About 125 hostages were transferred to Amman, while the American, Israeli, Swiss, and West German citizens were held on the planes.Raab, David.  The New York Times Magazine, 22 August 2004. . Reprinted at http://www.terrorinblackseptember.com Jewish passengers were also held. Passenger Rivke Berkowitz of New York, interviewed in 2006, recalled \"the hijackers went around asking people their religion, and I said I was Jewish.\"  Another Jewish hostage, 16-year-old Barbara Mensch (sister of Peter Mensch and sister-in-law of former UK MP Louise Mensch), was told she was \"a political prisoner.\""]}, {"page": "Corby (UK Parliament constituency)", "response": ["The seat was created due to population increases in the county for the 1983 general election.  Since creation it has been a marginal seat alternating between Labour and the Conservative representatives with marginal majorities relative to national averages on all but two occasions, the 1997 Labour landslide and the 2012 by-election.  The first Member of Parliament elected for the constituency in 1983 was William Powell, who represented the Conservatives for three sessions of Parliament until 1997.  Labour then held the seat until 2010. On 6 August 2012, MP for the seat since 2010 Louise Mensch (formerly Louise Bagshawe) announced she was resigning, triggering a by-election held on 15 November 2012. Labour's Andy Sawford won, becoming the first Labour MP for the seat since Phil Hope was defeated in 2010, and only the second in the seat's history. This was  Labour's first by-election win from a Conservative since the 1997 Wirral South by-election.  At the 2015 general election Tom Pursglove standing for the Conservatives won with a small majority.  He won again with a similar margin in 2017 and in 2019 Tom Pursglove took the seat for the third time, but with a majority of over 10,000, turning Corby into a non-marginal seat by Conservative Party standards."]}, {"page": "Deborah Blum", "response": ["In 2015, after Nobel Prize winning biochemist Tim Hunt made a controversial speech about women in science, Blum was one of three journalists present who initially broke the story. Although acknowledging that parts of it praised women scientists, she wrote that she found Hunt's speech troubling even after she asked him for clarification. Reporting on accusations that Hunt had been taken out of context, conflicting recollections of the phrase \"now seriously\" became a focal point for many commentators. Blum stated that she did not remember whether or not he spoke these words. Former UK member of Parliament Louise Mensch has documented what she considers to be factual and ethical shortcomings in Blum's account of Hunt's remarks. These claims have been disputed by British journalist and author Dan Waddell, who argues that they are politically motivated."]}, {"page": "Tilly Bagshawe", "response": ["Born on 12 June 1973 in Lambeth Hospital, London, Bagshawe is one of three daughters born to Nicholas Wilfrid Bagshawe and his wife, Daphne Margaret (née Triggs). Her father is from the Bagshawe family of Roman Catholic gentry. They originally hailed from Wormhill Hall, near Buxton, Derbyshire, and Oakes-in-Norton, near Sheffield.Burke's Landed Gentry, eighteenth edition, vol. 1, Peter Townend, 1965, Bagshawe of Wormhill and Oakes-in-Norton pedigree Her great-grandfather was the marine artist Joseph Ridgard Bagshawe, who was himself grandson of one of the 19th century's most renowned marine artists, Clarkson Stanfield, and a nephew of Edward Gilpin Bagshawe, Catholic Bishop of Nottingham. Her paternal grandmother, Mary Frideswide, was the daughter of Charles Robertson, a stockbroker and benefactor of St Philip's Priory, Begbroke and one of the co-founders of Westminster Cathedral. Her older sister is Louise Mensch, a chick lit author and former Conservative Member of Parliament. She has another sister Alice and a brother, James."]}, {"page": "Woldingham School", "response": ["* Louise Mensch (1989), Conservative MP for Corby (2010–2012), novelist (as Louise Bagshawe)"]}, {"page": "Beechwood School, Royal Tunbridge Wells", "response": ["* Louise Mensch, author and former MP"]}, {"page": "Digital, Culture, Media and Sport Committee", "response": ["| Louise Mensch MP (Conservative)"]}, {"page": "Records of members of parliament of the United Kingdom", "response": [":Louise Mensch, 2012 (resigned to spend more time with her family)"]}, {"page": "Oxford Union", "response": ["*Louise Mensch (UK Member of Parliament): Secretary (1991?)"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Louise Mensch; MP for Corby (2010–2012)"]}, {"page": "List of blogs", "response": ["| Louise Mensch"]}, {"page": "List of Question Time episodes", "response": ["|Ed Davey, Alan Johnson, Louise Mensch, Dominic Lawson, John Lydon", "|Sarah Wollaston, Richard Burgon, Nigel Farage, Will Self, Louise Mensch"]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["Notable newcomers elected in this general election included Liz Kendall, Guto Bebb, Gloria De Piero, Sajid Javid, Michael Dugher, Amber Rudd, Lisa Nandy, Damian Hinds, Anna Soubry, Heidi Alexander, Jacob Rees-Mogg, Alison McGovern, Chris Williamson, Owen Smith, Nicky Morgan, Tristram Hunt, Dan Poulter, Esther McVey, Priti Patel, Luciana Berger, Karen Bradley, Chuka Umunna, Louise Mensch, Dominic Raab, Tracey Crouch, Valerie Vaz and Caroline Lucas.", "| Corby||style=\"background-color: \"| ||Labour||style=\"background-color: \"| ||Louise Bagshawe (C)||Gain.  Defeated Incumbent Phil Hope. Louise Mensch since marriage in June 2011. By-election in 2012, see below.", "|Louise Mensch"]}, {"page": "Louise Daphne Bagshawe", "response": ["#REDIRECT Louise Mensch "]}, {"page": "The Insider: The Private Diaries of a Scandalous Decade", "response": ["An entry detailing the method alleged to have used by journalists at News of the World to hack into the phones of unsuspecting victims was quoted by the MP Louise Mensch during the questioning of Rupert and James Murdoch by the Culture, Media and Sport Select Committee in 2011. Ms Mensch then stated that Piers Morgan had not only engaged in phone hacking but had boasted that it had won him an award. Bloomberg Businessweek suggested that Mensch had \"confuse[d] her source\". Adding that the passage referred to Morgan's fear of having been hacked. Piers Morgan asked for Mensch to retract her comments calling them an \"absolute, blatant lie\". He further stated that \"in my time at the News of the World and the Mirror, I have never hacked a phone, told anyone to hack a phone, or published any stories based on the hacking of a phone\". After initially refusing, Mensch subsequently apologised saying that she had misread a newspaper article published in the Daily Telegraph which covered similar accusations against Morgan made by the political blogger Paul Staines."]}, {"page": "Louise Bagshaw", "response": ["#REDIRECT Louise Mensch"]}, {"page": "Twitter Joke Trial", "response": ["It has been claimed by sources talking to The Guardian that staff at the Crown Prosecution Service had been in favour of dropping the case, to the point of informing Chambers, via his solicitor, that they would not oppose the final appeal, but had then been overruled by the head of the service, the Director of Public Prosecutions, Keir Starmer. Chambers' MP, Louise Mensch, called for a House of Commons committee to investigate Starmer's behaviour. However, a spokesperson for the CPS said that Starmer had not taken part in decisions about the case."]}, {"page": "People's Pledge", "response": ["There were 13 constituency seats under consideration to have the first referendum including that of MPs Chris HuhneChris Huhne: vultures gathering over speeding claims?, BBC News, 30 January 2012. Louise Mensch, Geoffrey CoxWest residents would be given first say on Europe referendum, This is Cornwall, 31 January February 2012. and Julie HillingTown could have big say on Europe vote, The Bolton News, 1 February 2012."]}, {"page": "SlutWalk", "response": ["Former British Conservative MP Louise Mensch has objected to SlutWalk \"on the grounds that it 'lionises promiscuity', which she says is harmful.\" She also added \"promiscuity is not equality.\" Indeed, the inclusion of \"Sex Party branding\" has been criticised in Brisbane, where it was said by a rape survivor \"they are promoting sex positivity, which I personally have no problem with, but a lot of survivors of rape are at different stages.\" Guy Rundle has contrasted SlutWalk with Reclaim the Night protests, saying they \"resisted the deep cultural pull to make women into objects rather than subjects, to be constituted by the male gaze... there was no way to watch Reclaim The Night and feel like, or be, a voyeur.\" At worst, it has been said that \"SlutWalkers have internalised their abuse\" and SlutWalk is \"the pornification of protest.\""]}]}}