{"wiki_id": "http://www.wikidata.org/entity/Q5863844", "itemLabel": "James Louis Garvin", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Louis_Garvin", "wikipedia_page": {"main": "James Louis Garvin (12 April 1868 – 23 January 1947) was a British journalist, editor, and author. In 1908, Garvin agreed to take over the editorship of the Sunday newspaper The Observer, revolutionising Sunday journalism and restoring the paper, which was facing financial troubles at the time, to profitability in the process.", "link_mentions": [{"page": "Encyclopædia Britannica", "response": [" in the fifteenth edition of Britannica, Dale Hoiberg, a sinologist, was listed as Britannica's Senior Vice President and editor-in-chief. Among his predecessors as editors-in-chief were Hugh Chisholm (1902–1924), James Louis Garvin (1926–1932), Franklin Henry Hooper (1932–1938), Walter Yust (1938–1960), Harry Ashmore (1960–1963), Warren E. Preece (1964–1968, 1969–1975), Sir William Haley (1968–1969), Philip W. Goetz (1979–1991), and Robert McHenry (1992–1997).  Anita Wolff was listed as the Deputy Editor and Theodore Pappas as Executive Editor. Prior Executive Editors include John V. Dodge (1950–1964) and Philip W. Goetz.", "| James Louis Garvin in London, Franklin Henry Hooper in New York City", "| James Louis Garvin in London, Franklin Henry Hooper in New York City"]}, {"page": "Edmund Clerihew Bentley", "response": ["Bentley was born in London and educated at St Paul's School and Merton College, Oxford.Cohen, Nancy. \"Bentley, Edmund Clerihew (E. C.)\" In Gale, Steven H., ed. (1996). Encyclopedia of British Humorists: Geoffrey Chaucer to John Cleese, pp. 138–42. Taylor & Francis. His father, John Edmund Bentley, was professionally a civil servant but was also a rugby union international having played in the first ever international match for England against Scotland in 1871. Bentley worked as a journalist on several newspapers, including The Daily Telegraph. He also worked for the imperialist weekly called The Outlook during the editorship of James Louis Garvin.  His first published collection of poetry, titled Biography for Beginners (1905), popularized the clerihew form; it was followed by two other collections, More Biography (1929) and Baseless Biography (1939). His detective novel Trent's Last Case (1913)Trent's Last Case,  was much praised, numbering Dorothy L. Sayers among its admirers, and with its labyrinthine and mystifying plotting can be seen as the first truly modern mystery. It was adapted as a film in 1920, 1929, and 1952. The success of the work inspired him, after 23 years, to write a sequel, Trent's Own Case (1936). There was also a book of Trent short stories, Trent Intervenes (1938)."]}, {"page": "Nancy Astor, Viscountess Astor", "response": ["She attempted to discourage the hiring of Jews or Catholics to senior positions at The Observer,\"First Woman in Parliament\", The Tablet a newspaper owned by her husband;Alfred M. Gollin, The Observer and J. L. Garvin, 1908–1914 (London: Oxford University Press, 1960), pp. 300–303. in 1927 she reportedly told James Louis Garvin that if he hired a Catholic, \"bishops would be there within a week.\""]}, {"page": "The Observer", "response": ["Upon Frederick's death in 1903, the paper was purchased by the newspaper magnate Lord Northcliffe. After maintaining the existing editorial leadership for a couple of years, in 1908 Northcliffe named James Louis Garvin as editor. Garvin quickly turned the paper into an organ of political influence, boosting circulation from 5,000 to 40,000 within a year of his arrival as a result. Yet the revival in the paper's fortunes masked growing political disagreements between Garvin and Northcliffe. These disagreements ultimately led Northcliffe to sell the paper to William Waldorf Astor in 1911, who transferred ownership to his son Waldorf Astor, 2nd Viscount Astor four years later.", "* James Louis Garvin (1908–1942)"]}, {"page": "Waldorf Astor, 2nd Viscount Astor", "response": ["In 1911, Astor was approached by James Louis Garvin, the editor of The Observer, about purchasing the newspaper from its owner, the press baron Lord Northcliffe. Northcliffe and Garvin had a disagreement over the issue of Imperial Preference, and Northcliffe had given Garvin the option of finding a buyer for the paper. Astor convinced his father to purchase the paper, which William did on the condition that Garvin also agree to edit the Pall Mall Gazette, which was also a property of the Astor family.Alfred M. Gollin, The Observer and J. L. Garvin, 1908–1914 (London: Oxford University Press, 1960), pgs. 300–303. Though his father provided the funds, it was Waldorf who was in charge of the paper, and he developed a harmonious working relationship with Garvin. William formally turned over ownership of both papers to his son in 1915, who promptly sold the Pall Mall Gazette but retained ownership of The Observer."]}, {"page": "The Pall Mall Gazette", "response": ["Thompson sold the paper to William Waldorf Astor in 1896. Sir Douglas Straight was editor until 1909, followed by F. J. Higginbottom, under whom the paper declined. Circulation doubled between 1911–15 under the editor James Louis Garvin, but the paper declined once more under its last editor D. L. Sutherland. It was absorbed into The Evening Standard in 1923.Brake,Laurel; Demoor, Marysa Dictionary of Nineteenth-century Journalism in Great Britain and Ireland, Academia Press, 2009, p478", "|James Louis Garvin"]}, {"page": "Garvin", "response": ["*James Louis Garvin (1868–1947), British journalist"]}, {"page": "Coefficients (dining club)", "response": ["* James Louis Garvin, journalist and editor"]}, {"page": "J. L. Garvin", "response": ["#REDIRECT James Louis Garvin"]}, {"page": "St Dunstan-in-the-West", "response": ["Adjacent to Queen Elizabeth is a memorial to Lord Northcliffe, the newspaper proprietor, co-founder of the Daily Mail and the Daily Mirror. Unveiled in 1930, the obelisk was designed by Edwin Lutyens and the bronze bust is by Kathleen Scott. Next to Lord Northcliffe is a memorial tablet to James Louis Garvin, another pioneering British journalist."]}, {"page": "J.L. Garvin", "response": ["#redirect James Louis Garvin"]}, {"page": "History of journalism", "response": ["Other powerful editors included  C. P. Scott of the Manchester Guardian, James Louis Garvin of The Observer and Henry William Massingham of the highly influential weekly magazine of opinion, The Nation.A.J.P. Taylor, English History 1914-1945 (1965), pp. 26–27."]}, {"page": "South Hampstead High School", "response": ["* Una Ledingham (née Garvin), physician in the field of diabetes mellitus and pregnancy, and daughter of James Louis Garvin"]}, {"page": "Franklin Henry Hooper", "response": ["Horace Hooper and Walter Jackson bought the Encyclopædia Britannica in 1901, holding it until 1920. Franklin Hooper was already an editor there, having joined the staff in 1899. During his tenure, five editions of the encyclopedia were published — the 10th in 1902-03; the highly regarded 11th in 1910-11; the 12th in 1922; the 13th in 1926; and the 14th in 1929. He was listed together with James Louis Garvin as one of the two editors of the 14th edition. Franklin became editor-in-chief in 1932."]}, {"page": "Sara Jeannette Duncan", "response": ["After her marriage, Duncan split her time mostly between England and India, often spending much of it alone in rented flats in Kensington, London. The travelling was necessitated by her continued writing commitments in several countries. There had been plans for her and Everard to return permanently to England in 1894, but these came to nothing: her husband reinvented himself as a journalist and edited the Calcutta-based Indian Daily News in 1894–97, later becoming managing director of the Eastern News Agency. Although Marian Fowler, a biographer, argued that the couple's marriage was unhappy (based on E.M. Forster's off-hand and misinterpreted observation that \"Mrs. Cotes [is] difficult, and I fancy unhappy\"), hers is not the accepted view. Duncan certainly supported her husband in various work-related endeavours. She also cultivated a friendship with James Louis Garvin while he was editor of The Outlook and The Observer, at least in part hoping he might find a position for Everard in Britain. Warkentin suggests that theirs may have been \"one of those marriages in which a difficult woman and a gentle, agreeable man made common cause.\""]}, {"page": "James Garvin", "response": ["*James Louis Garvin (1868–1947), British writer"]}, {"page": "List of members of the Order of the Companions of Honour", "response": ["|1 January 1941||75px||James Louis Garvin||1868–1947||Journalist and author"]}, {"page": "King and Country debate", "response": ["By contrast, Joad, A. A. Milne and Francis Wrigley Hirst all publicly defended the resolution. Hirst later argued in his book, Consequences of the War to Great Britain (1934), that the resolution did not rule out wars of self-defence, only imperialist conflicts. John Alfred Spender and James Louis Garvin took issue with the resolution, which, in their view, neglected the issue of war prevention."]}, {"page": "Lizzy Lind af Hageby", "response": ["Lind af Hageby became known as a distinguished orator, particularly after a second libel trial in 1913, when she sued Dr. Caleb Saleeby, a physician, the Pall Mall Gazette, its owner William Waldorf Astor, its editor James Louis Garvin, and its printer D. C. Forrester. The suit was in response to two articles by Saleeby in May 1912, prompted by a graphic vivisection display ADAVS had run in its Piccadilly shop, which Helen Rappaport writes attracted crowds of horrified onlookers. Saleeby accused Lind af Hageby in the Gazette of \"a systematic campaign of falsehood.\" Lind Af Hageby represented herself; this was at a time when women could not be admitted as lawyers in the UK, because they were not regarded as \"persons\" within the terms of the 1843 Solicitors Act."]}, {"page": "JL Garvin", "response": ["#REDIRECT James Louis Garvin"]}, {"page": "Jamie Scallion", "response": ["Scallion's great grandfather is the author James Louis Garvin. His grandfather is the French politician Count François de Menthon."]}]}}