{"wiki_id": "http://www.wikidata.org/entity/Q58618791", "itemLabel": "Elise McCann", "itemDescription": "Australian actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Elise_McCann", "wikipedia_page": {"main": "Elise McCann (born 28 July 1985) is an Australian actress and musical theatre performer most well known for originating the role of Miss Honey in the Australian production of Matilda the Musical and as Lucille Ball in Everybody Loves Lucy.McCann appeared as Lynne Woolnough, Peter Allen's Sister, in the Australian television mini series Peter Allen: Not the Boy Next Door in 2015 and released her debut album Dahlesque with ABC Music on 23 June 2017.\nShe is currently based in both Melbourne and New York and performs internationally.  Her performance career includes theatre, musical theatre, concerts and television.", "link_mentions": [{"page": "Falsettos", "response": ["In 2014 Darlinghurst Theatre Company presented a revival directed by Stephen Colyer. The cast featured Tamlyn Henderson as Marvin, Katrina Retallick as Trina, Stephen Anderson as Mendel, Ben Hall as Whizzer, Elise McCann as Cordelia and Margi de Ferranti as Charlotte. The production played as part of the Sydney Mardi Gras festival throughout February and March 2014. In her review of the production, Cassie Tongue of Aussie Theatre viewed the production as a \"promising sign of things to come\" for the Sydney theater scene, and praised the casting by remarking, \"Henderson’s Marvin and Retallick’s Trina are clear standouts, and de Ferranti and McCann are so essential to the emotional weight of the second act that they are just as impressive as if they had been there from the first\"."]}, {"page": "Matilda the Musical", "response": ["In July 2013, Minchin said that an Australian production was planned for 2015. The production, produced by Louise Withers, had preview performances from 28 July before opening at the Sydney Lyric theatre on 20 August 2015. The ticketing release date (October 2014) was announced at Pier 2/3 in Walsh Bay, with Minchin, International Executive Producer André Ptaszynski, NSW Deputy Premier Andrew Stoner and Sydney press in attendance. The cast included Marika Aubrey and Daniel Frederiksen as Mr. and Mrs. Wormwood, Elise McCann as Miss Honey and James Millar as Miss Trunchbull. Sasha Rose (12), Georgia Taplin (11), Molly Barwick (10) and Bella Thomas (13) shared the title role with Thomas playing Matilda on the opening night. The Sydney season ended on Sunday 29 February with Georgia Taplin playing the title role, before transferring to Melbourne.", "| Elise McCann", "| Elise McCann", "|Elise McCann"]}, {"page": "Helpmann Award for Best Female Actor in a Supporting Role in a Musical", "response": ["| Elise McCann"]}, {"page": "David Harris (Australian actor)", "response": ["*2010 David Harris in concert - Civic Theatre Newcastle with special guest Elise McCann"]}, {"page": "The Production Company", "response": ["Its productions typically featured well-known Australian musical theatre performers such as Caroline O'Connor (Gypsy, Funny Girl), Michael Falzon (Chess), Marina Prior (Guys and Dolls, Kiss Me, Kate), Todd McKenney (The Boy from Oz, La Cage aux Folles), Lucy Durack (Kiss Me, Kate, Thoroughly Modern Millie), Christie Whelan Browne (The Producers, Sugar), Elise McCann (Brigadoon, Oklahoma) and Amanda Harrison (Anything Goes, Oklahoma!)."]}, {"page": "Lucy Maunder", "response": ["Lucy Maunder is an Australian cabaret and theatre performer. She originated the role of Lara in the Australian premiere of Doctor Zhivago opposite Anthony Warlow, and has toured with her own cabaret Songs in the Key of Black, releasing an album with the same name. Maunder toured with the national touring company of Grease playing the role of Rizzo. She then starred in the role of Miss Honey in the Australian tour of Matilda the Musical, replacing Elise McCann. She is currently starring in the GFO production of Pippin, as Catherine.https://www.otakustudy.com/theatre/2020/10/pippins-sydney-cast-announced-ahead-of-november-commencement/"]}, {"page": "Green Room Award for Female Actor in a Featured Role (Music Theatre)", "response": ["|Elise McCann"]}, {"page": "Peter Allen: Not the Boy Next Door", "response": ["* Elise McCann as Lynne Woolnough (Allen's sister)"]}, {"page": "16th Helpmann Awards", "response": ["*Elise McCann – Matilda the Musical"]}, {"page": "Anna O'Byrne", "response": ["She joined Ramin Karimloo's Australasian tour in May and June 2018, as well as appearing as Laurey Williams in The Production Company's Oklahoma! alongside Simon Gleeson, Elise McCann and Bobby Fox in Melbourne.  Back in London, she appeared in a workshop version of Unmasked, a not-so-reverent musical retrospective celebrating Andrew Lloyd-Webber's 70th birthday."]}, {"page": "Hayes Theatre", "response": ["Notable performers who have performed at the Hayes include Nancye Hayes, Caroline O'Connor, David Campbell, Verity Hunt-Ballard, Simon Burke, Mitchel Butel, Emma Matthews, Genevieve Lemon, Rowan Witt, Virginia Gay, Tim Draxl, Hellen Dallimore, Bobby Fox, Seann Miley Moore, Trevor Ashley, Marika Aubrey, Blake Bowden, Paul Capsis, Chloe Dallimore, Esther Hannaford, Lucy Maunder, Timomatic, Hayden Tee, Amanda Harrison, Elise McCann, and Bert LaBonté."]}, {"page": "Christopher Horsey", "response": ["Horsey choreographed a new cabaret-style show, Everybody Loves Lucy, starring Elise McCannAussie Theatre Review Retrieved Sept 05, 2018. and choreographed Ruthless! at The Seymour Centre starring Katrina Retallick, Geraldine Turner, Margi De Feranti and Merideth O'Reilly on which he was also Resident Director.Arts Review Retrieved Sept 05, 2018"]}, {"page": "Alex Rathgeber", "response": ["Rathgeber has headlined numerous concerts alongside the likes of Rhonda Burchmore, Matt Hetherington, Rob Mills, Lucy Durack, Tim Draxl, Chelsea Plumley, Marina Prior, James Millar, Elise McCann, Anna O'Byrne, Amy Lehpamer, Judi Connelli, Trevor Ashley, Gorgi Coghlan, Wendy Stapleton, Suzanne Johnston, Mathew Frank, Simon Burke and many more."]}]}}