{"wiki_id": "http://www.wikidata.org/entity/Q587555", "itemLabel": "Jack Balmer", "itemDescription": "English footballer (1916-1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Balmer", "wikipedia_page": {"main": "John Balmer (6 February 1916 — 25 December 1984) was an English footballer who played as a striker for English club Liverpool.", "link_mentions": [{"page": "Liverpool F.C.", "response": ["| Jack Balmer || 1947–1950"]}, {"page": "Albert Stubbins", "response": ["Following his move to Liverpool, Stubbins scored 28 goals (24 league goals) in the 1946–7 season (making him joint top scorer with Jack Balmer) helping Liverpool to win the League Championship, their first in 24 years. Stubbins also scored 24 goals the following season. Although a contractual dispute in the 1948–9 season limited his appearances for the Merseyside club, he then helped Liverpool reach the 1950 FA Cup Final, the first time Liverpool had appeared at Wembley. However, they lost to Arsenal by two goals to nil."]}, {"page": "Cyril Sidlow", "response": ["Sidlow's career was curtailed because of the Second World War which began when he was approaching his 24th birthday, having taken away the best years of his career he was almost 31 when he signed for the Reds. Sidlow with Charlie Ashcroft and Ray Minshull were the goalkeepers vying for the number one jersey at Anfield for the 1946/47 season; the first competitive  season following the war. Even with the competition, Sidlow was given the position, which he held for 34 of the 42 games in a season that saw Liverpool win their first championship for 24 years. Much of which is owed to Sidlow as the final game of the season was a must win for the Reds. Sidlow's former employers Wolves needed just a point to win the title and Liverpool had to face them at Molineux. the Reds were a point back on their hosts and, needed a victory to win the league title. After a comprehensive 5–0 win at Anfield, Wolves were favourites to win the game and take the title, but goals from Jack Balmer and Albert Stubbins, plus Sidlow and the backline keeping Wolves down to one meant the Championship trophy would be heading to Merseyside."]}, {"page": "Fernando Torres", "response": ["Torres was named the Premier League Player of the Month for February 2008, during which he scored four goals in four appearances, including a hat-trick against Middlesbrough on 23 February 2008. This hat-trick and another in a 4–0 victory over West Ham United on 5 March 2008 meant he became the first Liverpool player since Jack Balmer in November 1946 to score a hat-trick in successive home matches. Later in March, after he scored a 47th-minute header against Reading at Anfield, he became the first Liverpool player since Robbie Fowler in the 1995–96 season to score 20 league goals in a season. In April, he scored another Champions League goal, this time against Arsenal in the quarter-final second leg, as Liverpool advanced to the semi-final. This goal took him onto 29 goals for the 2007–08 season in all competitions, eclipsing Michael Owen's personal record for goals in a season. On 11 April 2008, it was announced Torres had made a six-man shortlist for the PFA Players' Player of the Year award, which was eventually won by Cristiano Ronaldo of Manchester United. The Spanish international was also nominated for the PFA Young Player of the Year Award, which was won by Cesc Fàbregas of Arsenal and was named in the PFA Team of the Year. In May, he finished second to Ronaldo for the FWA Footballer of the Year award."]}, {"page": "Bob Paisley", "response": ["Paisley eventually made his official debut on 5 January 1946 in Liverpool's first post-war competitive match, which was an FA Cup 3rd round, 1st leg away match at Sealand Road, the home ground of Chester. Liverpool won the game 2–0. Paisley's first goal didn't come until 1 May 1948 in a League game at Anfield, against Wolverhampton Wanderers. Paisley's 22nd-minute strike along with a Jack Balmer goal in the 80th were enough to help the Reds win 2–1."]}, {"page": "List of people from Merseyside", "response": ["*Jack Balmer: Footballer Liverpool F.C.."]}, {"page": "Balmer (surname)", "response": ["* Jack Balmer (1916–1984), English football player"]}, {"page": "Billy Liddell", "response": ["In his inaugural season of competitive football, Liddell confirmed his status as a regular and contributed to Liverpool's first championship since 1923. Positioned on the left wing, he appeared in 34 matches, scored seven goals, and supplied strikers Albert Stubbins and Jack Balmer with numerous assists.Albert Stubbins, The Daily Telegraph, 6 January 2003, telegraph.co.uk. Retrieved 13 May 2008. Severe conditions in the winter disrupted the league's schedule and Liverpool did not secure the title until 14 June 1947. The club won its final game away against Wolves 2–1, with Liddell setting up one of the goals,Keith, John (2005), p. 61-2 but the championship was decided by Sheffield United defeating contenders Stoke in the season's last fixture. The game coincided with the Senior Cup Final between Liverpool and Everton at Anfield, where tannoys announced the result during the match.Keith, John (2005), p. 64 As a strict teetotaler, Liddell refrained from accepting glasses of champagne to celebrate the success."]}, {"page": "Merseyside derby", "response": ["|Jack Balmer", "* Jack Balmer – 1935 – no fee"]}, {"page": "George Kay", "response": ["Top scorers in the Championship season were Jack Balmer and Albert Stubbins with 24 league goals each. They continued to be prolific scorers during Kay's period in charge but the club was unable to come close to another championship, finishing each of the next three seasons in the lower part of the top half of the table. In 1950, they reached the FA Cup Final for the first time in 36 years, but the match at Wembley ended in a 2–0 victory for Arsenal."]}, {"page": "Alf Hanson", "response": ["Alf's brother Stan was the goalkeeper for Bolton when the two sides met at Anfield on 23 April 1938, the two brothers were made their teams respective captain's with Alf coming out on top in a 2–1 victory for Liverpool with goals in the fourth and seventh minutes from Jack Balmer and Phil Taylor respectively."]}, {"page": "Berry Nieuwenhuys", "response": ["Nieuwenhuys returned to the club after the war. His place in the squad became uncertain in the 1946–47 season, which was the first season of competitive football since the league system's suspension. His final season yielded his only honour, the league championship under manager George Kay. He scored five times in 15 appearances. His teammates during this era included  Jack Balmer, Bill Jones, Albert Stubbins, Billy Liddell and Bob Paisley. It would be the last of the club's league titles until the 1963-64 season. He retired in 1947, having briefly been installed as assistant professional at West Derby Golf Club. He returned to South Africa, assuming a similar responsibility at the Transvaal Country Club for World Golf Hall of Famer Bobby Locke.Keith, John (2005), p. 101 Nieuwenhuys continued his association with football through coaching, specifically for Southern Suburbs under manager Bernie Gibson,Raath, Peter (2002), Soccer through the years, 1862-2002, p. 143 and the Callies"]}, {"page": "Jim Harley", "response": ["After the six-year break Harley returned to Merseyside and played in 17 games of the first post-war championship winning team, a side that contained the likes of Jack Balmer, Bill Jones, Berry Nieuwenhuys, Albert Stubbins, Billy Liddell and Bob Paisley."]}, {"page": "Cyril Done", "response": ["Born in Liverpool, Done played for Bootle Boys' Brigade before being spotted as a 17-year-old by \"Reds\" manager George Kay who took him to Anfield in January 1938. He made his debut 18 months later on 2 September 1939 in a 1–0 home win over Chelsea; and it was Done who got the winner, thus opening his account in the same match. This game proved to be the last 'official' game for six years due to the outbreak of World War II; during the war he scored 147 goals in 137 games. Done rejoined Liverpool after the war; after missing the first nine games of the 1946–47 season he made an impact on the side by scoring the \"Reds\" goal in their 1–1 home draw with Charlton. He then followed this up by scoring his first hat-trick for the club on 19 October 1946 at Leeds Road, his goals, which came in the 29th, 43rd and 76th minute, along with a Jack Balmer last minute strike helped humble their hosts, Huddersfield, by a 4–1 scoreline. He repeated this feat, this time at Anfield on 12 February 1947 in a 5–0 victory over Grimsby, his goals came in the 24th, 40th and 85th minutes, Willie Fagan scored the other two in the 30th and 32nd minutes. Done's contribution in his 17 league appearances, scoring 10 goals, went a long way in helping Liverpool go on to win the first post-war championship. Liverpool dropped to 14th in 1947–48, and Done played just the six games. The club finished in mid-table again in 1948–49, with Done scoring 13 goals in 28 games. Done struggled to hold down a place in the Liverpool starting line-up and completely missed out on the 1950 FA Cup run; he scored five goals in 16 league games. He scored three goals in 25 games in 1950–51, and got four goals in 12 games in 1951–52."]}, {"page": "Billy Balmer", "response": ["Billy Balmer (29 July 1875 – February 1961) was an English footballer who played for Everton, as well as the English national side. His brother Bob played alongside him for Everton and his nephew was Jack Balmer."]}, {"page": "1946–47 Liverpool F.C. season", "response": ["* Jack Balmer"]}, {"page": "1947–48 Liverpool F.C. season", "response": ["* Jack Balmer"]}, {"page": "Liverpool Collegiate School", "response": ["*Jack Balmer, captain of Liverpool FC"]}, {"page": "History of Liverpool F.C. (1892–1959)", "response": ["The first game played at Anfield after the war was against Middlesbrough, on 4 September 1946, which Liverpool lost 1–0 before a crowd of 34,140. Despite this defeat, Liverpool finished the 1946–47 season as League champions captained again by a Scot, Willie Fagan.\"Captains for Liverpool FC since 1892\" Vital to this success were their attacking players; after a 5–0 defeat to Manchester United the club bought Albert Stubbins from Newcastle United, to augment the attack alongside Jack Balmer and Billy Liddell. Stubbins and Balmer joined top scored with 24 league goals and Balmer scoring hat-tricks in three successive matches."]}, {"page": "1951–52 Liverpool F.C. season", "response": ["* Jack Balmer"]}, {"page": "1950–51 Liverpool F.C. season", "response": ["* Jack Balmer"]}, {"page": "1949–50 Liverpool F.C. season", "response": ["* Jack Balmer"]}, {"page": "1948–49 Liverpool F.C. season", "response": ["* Jack Balmer"]}]}}