{"wiki_id": "http://www.wikidata.org/entity/Q588371", "itemLabel": "Michael J. D. Powell", "itemDescription": "mathematician (1936-2015)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_J._D._Powell", "wikipedia_page": {"main": "Michael James David Powell  (29 July 1936 – 19 April 2015) was a British mathematician, who worked in the Department of Applied Mathematics and Theoretical Physics (DAMTP) at the University of Cambridge.\n\n", "link_mentions": [{"page": "Michael Powell (disambiguation)", "response": ["* Michael J. D. Powell (1936–2015), British applied mathematician "]}, {"page": "Radial basis function", "response": ["Sums of radial basis functions are typically used to approximate given functions. This approximation process can also be interpreted as a simple kind of neural network; this was the context in which they were originally applied to machine learning, in work by David Broomhead and David Lowe in 1988,Radial Basis Function networks  which stemmed from Michael J. D. Powell's seminal research from 1977.: \"We would like to thank Professor M.J.D. Powell at the Department of Applied Mathematics and Theoretical Physics at Cambridge University for providing the initial stimulus for this work.\""]}, {"page": "Powell (surname)", "response": ["*Michael J. D. Powell (1936–2015), British mathematician"]}, {"page": "Davidon–Fletcher–Powell formula", "response": ["The Davidon–Fletcher–Powell formula (or DFP; named after William C. Davidon, Roger Fletcher, and Michael J. D. Powell) finds the solution to the secant equation that is closest to the current estimate and satisfies the curvature condition. It was the first quasi-Newton method to generalize the secant method to a multidimensional problem. This update maintains the symmetry and positive definiteness of the Hessian matrix."]}, {"page": "Michael Powell (mathematician)", "response": ["#REDIRECT Michael J. D. Powell"]}, {"page": "Naylor Prize and Lectureship", "response": ["* 1983 Michael J. D. Powell"]}, {"page": "Michael J.D. Powell", "response": ["#Redirect Michael J. D. Powell"]}]}}