{"wiki_id": "http://www.wikidata.org/entity/Q5890965", "itemLabel": "Steve Jones", "itemDescription": "British footballer (born 1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Jones_(footballer,_born_1976)", "wikipedia_page": {"main": "Stephen Graham Jones (born 25 October 1976) is a Northern Irish footballer who plays for Sandbach United football club. He has been capped 29 times by Northern Ireland and played for 20 clubs in England, Ireland, Scotland and Wales.", "link_mentions": [{"page": "October 25", "response": ["*  1976   – Steve Jones, Irish footballer"]}, {"page": "Crewe Alexandra F.C.", "response": ["Players who passed through the ranks since establishment of the Academy include England internationals Geoff Thomas and David Platt, Wales international Robbie Savage, and Northern Ireland's Neil Lennon and Steve Jones. These were all youngsters signed from other clubs, but the Academy also nurtured Crewe's own trainees – most notably England internationals Rob Jones, Danny Murphy, Seth Johnson and Dean Ashton, plus Wales midfielder David Vaughan.Morris, p.279.", "| Steve Jones"]}, {"page": "Crewe", "response": ["From the early 1980s, Crewe Alexandra built a reputation for developing young players through its youth ranks: England internationals Geoff Thomas, Danny Murphy, David Platt, Rob Jones and Dean Ashton, plus  Northern Ireland's Neil Lennon and Steve Jones, and Wales's Robbie Savage and David Vaughan all passed through the club. Among their earlier most notable home-grown players was Frank Blunstone, born in the town in 1934, who was transferred from \"The Alex\" to Chelsea in 1953, and went on to win five England caps. Internationals Bruce Grobbelaar and Stan Bowles were also on the books at one time in their careers. "]}, {"page": "Steve Jones", "response": ["*Steve Jones (English presenter) (born 1945), English musician, disk jockey, television presenter, and voice-over artist", "*Steve Jones (musician) (born 1955), English rock and roll guitarist and singer, member of the Sex Pistols", "*Steve Jones (Welsh presenter) (born 1977), Welsh television presenter", "*Steve Jones (fl. 1980s), American musician (The Unforgiven) and television producer", "*Steve Jones (biologist) (born 1944), Welsh geneticist ", "*Steve Jones (footballer, born 1955), English footballer", "*Steve Jones (footballer, born 1957), English footballer", "*Steve Jones (footballer, born 1960), English footballer", "*Steve Jones (footballer, born 1962), Welsh footballer", "*Steve Jones (footballer, born 1964), Welsh footballer", "*Steve Jones (footballer, born March 1970), English footballer", "*Steve Jones (footballer, born December 1970), English footballer", "*Steve Jones (footballer, born 1976), Northern Irish international footballer", "*Steve Jones (rugby union, born 1951) (1951–2007), Welsh rugby union player", "*Steve Jones (rugby union, born 1977), Welsh rugby union player", "*Steve Jones (rugby union, born 1983), English rugby union player", "*Steve Jones (rugby league), rugby league footballer who played in the 2000s", "*Steve Jones (baseball) (born 1941), American baseball pitcher", "*Steve Jones (cricketer) (born 1949), Australian cricketer", "*Steve Jones (American football) (born 1951), American football player", "*Steve Jones (runner) (born 1955), Welsh athlete", "*Steve Jones (cyclist) (born 1957), British cyclist", "*Steve Jones (golfer) (born 1958), American golfer", "*Steve Jones, alias used in Wales in the 1980s of professional wrestler William Regal", "*Steve Jones (aviator) (born 1960), British pilot"]}, {"page": "Fitz Hall", "response": ["The 2002–03 season saw Hall saw him shine as he was part of a defence as a first team regular. Hall helped the club keep four clean sheets in four matches between 13 August 2002 and 26 August 2002 despite being sent–off in a 0–0 draw against Brentford on 17 August 2002.  His performance led manager Dowie to praise his performance on being \"comfortable on the ball and quick in the tackle.\" After serving a one match suspension, he returned to the starting line–up against Notts County on 7 September 2002, winning 3–1. Hall, once again, helped Oldham Athletic keep three clean sheets in the next four matches between 17 September 2002 and 5 October 2002, in which he missed a match against Swindon Town. Hall then scored his first goal for the club against Stockport County on 2 November 2002. Two weeks later on 16 November 2002, he scored his second goal for Oldham Athletic, in 2–2 draw against Burton Albion in the first round of the FA Cup. His performance saw him being awarded November's Player of the Month in the second division. A month later on 21 December 2002, Hall scored his second goal, in a 1–0 win against Chesterfield. His next goal for Oldham Athletic came on 14 January 2003 against Brentford, in a 2–1 win, Five days later on 19 January 2003, he signed a new deal, which would have kept him at the club until 2005, Six days later on 26 January 2003, however, Hall received a straight red card in the 28th minute for a foul on Steve Jones, in a 3–1 loss. After serving a two–match suspension, Hall returned to the starting line–up against Notts County and helped the club draw 1–1 on 22 February 2003. This was followed by scoring his fifth goal for Oldham Athletic, in a 1–0 win against Mansfield Town. Despite being further sidelined with a toe injury that saw him miss two matches, he continued to remain as a first team regular for the rest of the 2002–03 season, as the club reached the play–offs and proved to be only the second best to league champions Wigan Athletic. Hall played in both legs against Queens Park Rangers, as Oldham Athletic lost 2–1 on aggregate. At the end of the 2003–04 season, he went on to make fifty appearances and scoring five times in all competitions. For his performance, Hall was named in the PFA Team of the Year."]}, {"page": "Northern Ireland national football B team", "response": ["|| 20 May 2003      || Scotland Future || 1-2 || Firhill Stadium, Glasgow || Steve Jones", "*Steve Jones "]}, {"page": "Michael Higdon", "response": ["Higdon progressed from the Crewe Alexandra youth team into their first team in 2003. He was originally used as a midfielder, but due to his height and physical presence, he was converted into a striker by manager Dario Gradi. Higdon's most famous moment for Crewe came against Coventry City in the last game of the 2004–05 season, where Crewe had to win to have a chance of staying up. They went 1-0 down but Higdon scored the equaliser to set up Steve Jones to score the winner which kept Crewe Alexandra in the Championship."]}, {"page": "Dean Smith (footballer, born 1971)", "response": ["He let fourteen players go in summer 2011, including: Darren Byfield, Jonny Brain, Clayton McDonald, Paul Marshall, Matt Richards, Steve Jones, Aaron Lescott, David Bevan, Julian Gray, and Tom Williams. He then signed goalkeeper Dávid Gróf; defenders Mat Sadler and Lee Beevers; midfielders Kevan Hurst, Claude Gnakpa, Adam Chambers, and Anton Peterlin; and striker Ryan Jarvis. Also during the campaign he boosted his squad with loan signings Dave Martin, Mark Wilson, Andy Halliday, and Florent Cuvelier. His side lost just one of their first five league games, but then picked up just three points from their next seven games. They beat Preston North End on 15 October, but then picked up just four points from their next eight games. From 26 November, they were beaten just once in nine matches, but became the division's draw specialists as seven of these nine games finished level. They finished the campaign in 19th place, seven points clear of the relegation zone."]}, {"page": "2003–04 Football League", "response": ["|=||align=left|  Steve Jones ||align=left| Crewe Alexandra ||15"]}, {"page": "Steve Jones (footballer born 1976)", "response": ["#REDIRECT Steve Jones (footballer, born 1976)"]}, {"page": "2008–09 Huddersfield Town A.F.C. season", "response": ["On 27 May, Stan Ternent made his first signing as Huddersfield Town manager. He signed Scottish striker Keigan Parker on a free transfer from Championship side Blackpool. On 5 June, Irish international Jim Goodwin joined Town on a 3-year deal from recently relegated Scunthorpe United. On 13 June, Huddersfield were drawn at home to rivals Bradford City in the first round of the League Cup. 3 days later, the new Football League fixtures were announced, Town's first game would be a home tie against recently promoted Stockport County. On 2 July, Town signed the ex-Scunthorpe United defender Andy Butler on a 3-year deal. Two days later, Chris Lucketti was brought back to Huddersfield from Sheffield United on a two-year contract, 7 years after leaving the Galpharm Stadium. On 23 July, Ternent made his fifth signing by bringing in Welshman Michael Flynn from Blackpool. Six days later, Gary Roberts joined from Ipswich Town for £250,000. On 8 August, just one day before the new season began, ex-Everton & West Ham United defender David Unsworth signed from Burnley, becoming Stan Ternent's 7th signing since becoming manager at the Galpharm. Also that day, Town were given a bye into the second round of the Football League Trophy. On 15 August, young striker Tom Denton was signed for £60,000 from Wakefield. Stan Ternent signed attacking midfielder Ian Craney for an undisclosed fee from Football League Two side Accrington Stanley on 18 August. The following day, striker Liam Dickinson was signed on loan from Championship side Derby County. That loan was extended by another month on 22 September. He eventually stayed until 17 November, when the 93-day limit expired. Stan Ternent also revealed on 5 September, that Town had failed to capture 3 strikers during the summer. They failed on bid of £850,000 for Town hero Jon Stead, who joined Ipswich Town in September, a £400,000 bid for Colchester United's Clive Platt and a £600,000 bid for Ipswich Town's Alan Lee, who subsequently moved to Championship side Crystal Palace. On 17 October, Town signed Steve Jones on loan from Burnley as cover for Andy Booth, who is out until the New Year with a back injury. He returned to Turf Moor on 26 November. On 20 January, Lee Clark made his first signing as manager by signing German left-back Dominik Werling on a free transfer. On 23 January, manager Clark made a double signing with the capture of winger Anthony Pilkington from Stockport County and striker Lionel Ainsworth from Watford. As the transfer deadline closed, Clark made three more signings, Lee Novak from Gateshead, who was then immediately sent back to Gateshead for the rest of the season. Jonathan Téhoué was signed on a free transfer from Turkish side Konyaspor. On 13 February, 11 days after the deal was originally agreed, Polish striker Lukas Jutkiewicz joined Town on loan from Premier League side Everton until the end of the season. Young Liverpool defender Martin Kelly was brought in on loan on 26 March, as the loan window shut.", "|17 October|| Steve Jones||Burnley||Loan", "|26 November|| Steve Jones||Burnley||Loan Return", "|25||Steve Jones||||FW||2 (2)||0||0||0||0||0||0||0||2 (2)||0"]}, {"page": "2008–09 Burnley F.C. season", "response": ["|N/A||MF|| Steve Jones || Huddersfield Town || Loan || 17 October 2008", "|N/A||MF|| Steve Jones || Bradford City || Loan || 27 November 2008", "!scope=\"row\"|Steve Jones"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Steve Jones||||2008||2 (2)||0||0||0||0||0||0||0||0||0||2 (2)||0"]}, {"page": "2006–07 Burnley F.C. season", "response": ["!scope=\"row\"|Steve Jones", "|9||FW|| Steve Jones || Crewe Alexandra || Free || 3 May 2006"]}, {"page": "2007–08 Burnley F.C. season", "response": ["!scope=\"row\"|Steve Jones", "|14||FW|| Steve Jones ||  Crewe Alexandra || Loan || 27 March 2008"]}, {"page": "Steve Jones (Northern Ireland footballer)", "response": ["#REDIRECT Steve Jones (footballer, born 1976)"]}, {"page": "Steve Jones (Northern Irish footballer)", "response": ["#REDIRECT Steve Jones (footballer, born 1976)"]}, {"page": "Sandbach United F.C.", "response": ["*  Steve Jones"]}, {"page": "Star Sixes", "response": ["| Steve Jones"]}, {"page": "2009–10 Walsall F.C. season", "response": ["|Steve Jones"]}, {"page": "List of Rochdale A.F.C. players (1–24 appearances)", "response": ["|Steve Jones"]}]}}