{"wiki_id": "http://www.wikidata.org/entity/Q5890235", "itemLabel": "Homer Sykes", "itemDescription": "British photojournalist and photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Homer_Sykes", "wikipedia_page": {"main": "Homer Warwick Sykes (born 1949) is a Canadian-born British documentary photographer whose career has included personal projects and landscape photography.\n\n", "link_mentions": [{"page": "List of photographers", "response": ["* Homer Sykes (born 1949)"]}, {"page": "John Benjamin Stone", "response": ["He was also a prolific amateur documentary photographer who travelled widely in pursuit of his hobby. He made 26,000 photographs and wrote books as he travelled to Spain, Norway, Japan and Brazil. Amongst his published works were A Tour with Cook through Spain (1873), Children of Norway (1882), and a fairy tale called The Traveller's Joy. He also made an invaluable record of the folk customs and traditions of the British Isles, which influenced later photographers of note, including Homer Sykes, Daniel Meadows, Anna Fox and Tony Ray-Jones. Stone wrote of his purpose as being \"to portray for the benefit of future generations the manners and customs, the festivals and pageants, the historic places and places of our times.\"Quoted in Douglas B. Graham (production editor), Documentary Photography, Time-Life Books, 1974, p. 23"]}, {"page": "Sykes", "response": ["* Homer Sykes, Canadian-born British photographer"]}, {"page": "Chris Steele-Perkins", "response": ["In 1975, Steele-Perkins joined the Exit Photography Group with the photographers Nicholas Battye and Paul Trevor, and there continued his examination of urban problems: Exit's earlier booklet Down WappingThe booklet states that \"Exit is a collective of four photographers: Nicholas Battye, Diane 'Hank' Olson, Alex Slotzkin and Paul Trevor\" had led to a commission by the Calouste Gulbenkian Foundation to increase the scale of their work, and in six years they produced 30,000 photographs as well as many hours of taped interviews.\"Tales of Survival\", British Journal of Photography, 10 January 2007. Retrieved 23 March 2009. This led to the 1982 book, Survival Programmes. Steele-Perkins' work included depiction from 1975 to 1977 of street festivals, and prints from London Street Festivals were bought by the British Council and exhibited with Homer Sykes' Once a Year and Patrick Ward's Wish You Were Here; Steele-Perkins' depiction of Notting Hill has been described as being in the vein of Tony Ray-Jones.David Alan Mellor, No Such Thing as Society: Photography in Britain 1967–1987: From the British Council and the Arts Council Collection (London: Hayward Publishing, 2007; ), p. 52. Mellor talks of the \"international touring exhibition England at Play; this may have been an alternative English title for Il Regno Unito si diverte and it is the subtitle of Ward's book, Wish You Were Here.", "*\"Il Regno Unito si diverte\". British Council, Milan, 1981. (With Homer Sykes and Patrick Ward.), British Council. Retrieved 11 January 2010. This does not specify the place(s) of exhibition, but the OPAC of the libraries of the Province of Prato lists a publication titled Il Regno Unito si diverte that specifies Milan. Retrieved 2009-03-28."]}, {"page": "Patrick Ward (photographer)", "response": ["In his own time, Ward worked on a portrayal of the English at play that resulted in the book Wish You Were Here, published in 1976 by Gordon Fraser in a uniform edition with Homer Sykes' Once a Year. This was also an observation of the class divisions of England.", "*\"Il Regno Unito si diverte\". British Council, Milan, 1981. (With Chris Steele-Perkins and Homer Sykes.), British Council. Accessed 11 January 2010. This does not specify the place(s) of exhibition, but the OPAC of the libraries of the Province of Prato lists a publication titled Il Regno Unito si diverte that specifies Milan. Accessed 2010-05-08."]}, {"page": "Daniel Meadows", "response": ["*\"A Record of England.\" MAC (Birmingham), 2011. With Homer Sykes.Mac Birmingham Summer Brochure 1011, issuu.com. Accessed 30 April 2012.", "*British Image 1: Photographs by Homer Sykes, Claire Schwob, John Myers, Daniel Meadows, Bryn Campbell, Roslyn Banish, Ian Dobbie, and Paul Carter. London: Arts Council of Great Britain, 1975. Meadows' \"The Free Photographic Omnibus\" appears on pp. 38–49."]}, {"page": "Peter Dench", "response": ["*Great Britons of Photography Vol.1: The Dench Dozen. Eastbourne, UK: Hungry Eye, 2016. . With photographs by and transcripts of interviews between Dench and Jocelyn Bain Hogg, Marcus Bleasdale, Harry Borden, John Bulmer, Chris Floyd, Brian Griffin, Laura Pannack, Martin Parr, Tom Stoddart, Homer Sykes, and Anastasia Taylor-Lind. 160 pages. Edition of 500 copies."]}, {"page": "Laura Pannack", "response": ["*Great Britons of Photography Vol.1: The Dench Dozen. Eastbourne, UK: Hungry Eye, 2016. . Edited by Peter Dench. With photographs by and transcripts of interviews between Dench and Pannack, Jocelyn Bain Hogg, Marcus Bleasdale, Harry Borden, John Bulmer, Chris Floyd, Brian Griffin, Martin Parr, Tom Stoddart, Homer Sykes, and Anastasia Taylor-Lind. 160 pages. Edition of 500 copies."]}, {"page": "Chris Floyd (photographer)", "response": ["*Great Britons of Photography Vol.1: The Dench Dozen. Eastbourne, UK: Hungry Eye, 2016. . Edited by Peter Dench. With photographs by and transcripts of interviews between Dench and Floyd, Jocelyn Bain Hogg, Marcus Bleasdale, Harry Borden, John Bulmer, Brian Griffin, Laura Pannack, Martin Parr, Tom Stoddart, Homer Sykes, and Anastasia Taylor-Lind. 160 pages. Edition of 500 copies."]}, {"page": "Homer (name)", "response": ["* Homer Sykes (born 1949), Canadian-born British photographer"]}, {"page": "Anastasia Taylor-Lind", "response": ["*Great Britons of Photography Vol.1: The Dench Dozen. Eastbourne, UK: Hungry Eye, 2016. . Edited by Peter Dench. With photographs by and transcripts of interviews between Dench and Taylor-Lind, Jocelyn Bain Hogg, Marcus Bleasdale, Harry Borden, John Bulmer, Chris Floyd, Brian Griffin, Laura Pannack, Martin Parr, Tom Stoddart, and Homer Sykes. 160 pages. Edition of 500 copies."]}, {"page": "Ken Grant", "response": ["*Country Matters, James Hyman Gallery, London, September–November 2013. Photographs by Grant, Anna Fox, Bert Hardy, Colin Jones, Roger Mayne, Tony Ray-Jones, Chris Killip, Sirkka-Liisa Konttinen, Martin Parr, Mark Power, and Homer Sykes."]}, {"page": "List of street photographers", "response": ["* Homer Sykes (1949–)\"Homer Sykes: 40 years documenting Britain \", The Photographers Gallery, 2013. \"Photographer Homer Sykes  gives a talk about his experiences producing documentary work, street photography, and book and magazine projects during his remarkable 40-year career.\" Accessed 23 February 2017."]}, {"page": "Café Royal Books", "response": ["The first six publications were collaborative group books. Since then most have included the work of an individual photographer or artist. Café Royal Books specialises in collaborating with a photographer. It has published work by John Benton-Harris, John Bulmer, David Carol,\"About David Carol\", LensCulture. Accessed 11 July 2014.\"Where's the Monkey?\", LensCulture. Accessed 11 July 2014. John Claridge, Douglas Corrance, John Deakin, Peter Dench, Henrik Drescher, Alejandro Guijarro, Ken Grant, David Hurn, Chris Killip, Stephen McLaren, Daniel Meadows, Tish Murtha, Jim Mortram, Martin Parr, Simon Roberts, Victor Sloan, Brian David Stevens,\"If Only I'd Known: Photographer Brian David Stevens \", IdeasTap. Accessed 11 July 2014. Homer Sykes, Ed Templeton, Arthur Tress,\"Bookshop News: Discoveries at Photobook Bristol \", Photographers' Gallery. Accessed 17 August 2014. Patrick Ward, Janine Wiedel, and Document Scotland photographers among others. Café Royal has worked with some photographers to produce numerous different books of their work. Some of the books are of Atkinson's own work."]}, {"page": "Chris Harrison (photographer)", "response": ["* How we are: Photographing Britain from the 1840s to the Present. curated by Susan Bright & Val Williams. Works by, (Selection) William Henry Fox Talbot, Julia Margaret Cameron, Roger Fenton, Robert Howlett, Alvin Langdon Coburn, Cecil Beaton, Bill Brandt, Bert Hardy, Madame Yevonde, David Bailey, David Hurn, Roger Mayne, Tony Ray Jones, Jane Bown, John Davies, Anna Fox, Paul Graham, Chris Killip, Daniel Meadows, Martin Parr, Paul Reas, Paul Seawright, Homer Sykes, Tom Wood, Jason Evans, Chris Harrison, Tom Hunter, Simon Norfolk, Sarah Pickering, Nigel Shafran, Jem Southam, Clare Strand. Tate Britain, London, England. 2007.   ", "* You Are The Company in Which You Keep. curated by Amanda Ritson & Carol McKay. Works by (Selection), Craig Ames, Melanie Friend, Gilbert & George, Julian Germain, Paul Graham, Chris Harrison, Daniel Meadows, Martin Parr, Simon Roberts, Jo Spence, John Stezaker, Homer Sykes. Sunderland Museum and Winter Gardens, Sunderland, England. 2013."]}, {"page": "Peter Mitchell (photographer)", "response": ["*How We Are: Photographing Britain, Tate Britain, London, 2007. With Mitchell, Keith Arnatt, Nicholas Battye, Jane Bown, Vanley Burke, Stephen Dalton, John Davies, Anna Fox, Paul Graham, Nancy Hellebrand, Chris Killip, Daniel Meadows, Horace Ové, Martin Parr, Martin Pover, Paul Reas, Derek Ridgers, Paul Seawright, Chris Steele-Perkins, Homer Sykes, Paul Trevor, and Tom Wood.", "*Facing Britain, Museum Goch, Germany 2020  with Meredith Andrews, James Barnor, John Bulmer, Rob Bremner, Thom Corbishley, Robert Darch, Anna Fox, Henry Grant, Ken Grant, Judy Greenway, Mohamed Hassan, Paul Hill, David Hurn, Tony-Ray Jones, Neil Kenlock, Kalepsch Lathigra, Markéta Luskačová, Kirsty Mackay, Fran May, Niall McDiarmid, Daniel Meadows, Sandra Mickiewicz, Peter Mitchell, David Moore, Tish Murtha, John Myers, Mark Neville, Jon Nicholson, Kevin O'Farrell, Martin Parr, Mark Pinder, Yan Wang Preston, Kavi Pujara, Paul Reas, Simon Roberts, Michelle Sank, Syd Shelton, Hazel Simcox, Dave Sinclair, Chris Steele-Perkins, Homer Sykes, Alys Tomlinson, Jon Tonks, Dan Wood and Tom Wood"]}, {"page": "Colin Jones (photographer)", "response": ["* Country Matters, James Hyman Gallery, London, 2013. Photographs by Jones, Bert Hardy, Roger Mayne, Tony Ray-Jones, Homer Sykes, Chris Killip, Sirkka-Liisa Konttinen, Martin Parr, Mark Power, Anna Fox, and Ken Grant."]}, {"page": "John Myers (photographer)", "response": ["*British Image 1. London: Arts Council of Great Britain, 1975. . Photographs by Homer Sykes, Claire Schwob, Myers, Daniel Meadows, Bryn Campbell, Roslyn Banish, Ian Dobbie, and Paul Carter; with a very brief introduction by Robin Campbell and Barry Lane. Pages 28 to 37 present \"Middle England\" by Myers, introduced by an essay on the work by Paul David Lewis."]}, {"page": "Look Photo Biennial", "response": ["The artistic director was Stephen Snoddy. It included work by Edward Burtynsky, Homer Sykes, John Davies, Donovan Wylie, Robert Polidori and Mitch Epstein."]}, {"page": "Robert Darch", "response": ["*Facing Britain, Museum Goch, Germany, October 2020. Work by Darch and John Bulmer, Rob Bremner, Thom Corbishley, Anna Fox, Ken Grant, Judy Greenway, Mohamed Hassan, Paul Hill, David Hurn, Barry Lewis, Markéta Luskačová, Kirsty Mackay, Niall McDiarmid, Daniel Meadows, Peter Mitchell, Tish Murtha, John Myers, Jon Nicholson, Kevin O'Farrell, Niall McDiarmid, Martin Parr, Mark Pinder, Paul Reas, Simon Roberts, Syd Shelton, Dave Sinclair, Homer Sykes and Jon Tonks."]}]}}