{"wiki_id": "http://www.wikidata.org/entity/Q5890899", "itemLabel": "Raymond Jones", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Raymond_Jones_(composer)", "wikipedia_page": {"main": "Raymond Jones is a television composer who is best known for his work on Doctor Who.\nJones's work on Doctor Who was during William Hartnell's era as the First Doctor in The Romans (1965) and The Savages (1966), but he also composed for three episodes of BBC television's Wodehouse Playhouse in 1975.", "link_mentions": [{"page": "List of film score composers", "response": ["* Raymond Jones"]}, {"page": "The Romans (Doctor Who)", "response": ["The Romans was envisioned as the first Doctor Who serial with a humorous tone, originally intended to parody the 1951 film Quo Vadis. The story presents real historical characters in a fictitious manner. The serial was produced in a six-episode block with the preceding story, The Rescue, to introduce new companion Vicki. It features the design work of Raymond Cusick, and the incidental music was composed by Raymond Jones in his first work for the series. The Romans premiered with 13 million viewers, continuing the high viewership of the previous serial, which it maintained across the four weeks. Reviews were generally positive, with praise for the performances and characterisation, though its comedic tone received mixed responses. The serial was later novelised and released on VHS and DVD.", "Raymond Cusick worked as the serial's designer; it was his only historical serial, and became his least favourite work. He had a budget of  per episode. Several of the set elements were already owned by the BBC, though a few were constructed by Bill Roberts of Shawcraft Models. Barry contracted Peter Diamond in early November 1964 to coordinate the stunt work; Diamond was also cast in the role of Delos as it required fighting expertise. The serial's incidental music was composed by Raymond Jones, who was new to the series but had worked with Barry on Ann Veronica (1964). The score, pre-recorded at Broadcasting House on 25 November 1964, used harp, French horn, flute, and clarinet."]}, {"page": "Raymond Jones", "response": ["*Raymond Jones (architect) (born 1925), architect and Australian rules footballer for  Collingwood, Melbourne, and South Fremantle", "*Raymond Jones (boxer) (1903–?), Australian boxer", "*Raymond Jones (cricketer) (born 1958), New Zealand cricketer", "*J. Raymond Jones (1899–1991), American politician from New York", "*Raymond Jones (composer), best known for his work on Doctor Who"]}, {"page": "Raymond Jones (television composer)", "response": ["#REDIRECT Raymond Jones (composer)"]}]}}