{"wiki_id": "http://www.wikidata.org/entity/Q5902099", "itemLabel": "Horace Roye", "itemDescription": "British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Horace_Roye", "wikipedia_page": {"main": "Horace Roye (born Horace Roye-Narbeth, 4 March 1906 – 11 June 2002) was a British photographer. Roye's photograph Tomorrow's Crucifixion, depicting a nude model wearing a gas mask while pinned to a crucifix caused controversy when published in the North London Recorder in August 1938, but is now a noted photograph of its time. \nIn 1954 with a fellow photographer called Vala, Roye came up with the Roye-Vala 3-D Process. Not to miss an opportunity his company The Camera Studies Club published the Stereo Glamour Series of 3-D books of nude studies and pin-ups. As a photographer of nudes, he successfully contested the obscenity laws of his day.  An account of which he published in 1960 in the booklet Unique Verdict – the Story of an Unsuccessful Prosecution.Roye retired to Portugal. During the 1974 revolution, he was besieged in his house, holding out with a shotgun. Forced to sell up he returned to England. In 1980, he made his final move to Rabat, the capital of Morocco. He became Morocco's oldest British expatriate, and he was also the longest-serving member of the British Institute of Professional Photographers. He took up parasailing at the age of 75 and water-skied on the river Bouregeg until he was 78 years old.Roye was married three times. His first marriage was to actress Joan Dare. He later married  Renee Bernadeau who had been a French dancer. His final marriage was to Marilyn, a Canadian model who died in 1993.In 2002 at the age of 96, Roye was stabbed to death by an intruder at his home in the kasbah of Rabat, Morocco.", "link_mentions": [{"page": "List of photographers", "response": ["* Horace Roye (1906–2002)"]}, {"page": "Pamela Green", "response": ["Phyllis Pamela Green (28 March 1929 – 7 May 2010) was an English glamour model and actress, best known at the end of the 1950s and early 1960s. She modeled for Zoltán Glass and his brother Stephen, Horace Roye, Jean Straker, Bill Brandt, Joan Craven, Bertram Park, George Pickow and John Everard."]}, {"page": "Diana Dors", "response": ["In 1954, Hamilton had the idea of exploiting the newly printed technology of 3D. He engaged photographer Horace Roye to take a number of nude and semi-nude photographs of Dors which Hamilton subsequently had published in two forms; the semi-nude pictures were issued as a set called \"Diana Dors 3D: the ultimate British Sex Symbol\", which was sold together with a pair of 3D glasses; the full-nude test shot photographs became part of Roye's booklet London Models (1954). Police pressed charges, alleging the books were obscene but a court ruled that they were not."]}, {"page": "Erotic photography", "response": ["Nude photographers of the mid-20th century include Walter Bird, John Everard, Horace Roye, Harrison Marks and Zoltán Glass. Roye's photograph Tomorrow's Crucifixion, depicting a model wearing a gas mask while on a crucifix caused much controversy when published in the English Press in 1938. The image is now considered one of the major pre-war photographs of the 20th century."]}, {"page": "Roye", "response": ["* Horace Roye (1906–2002), photographer"]}, {"page": "John Everard (photographer)", "response": ["Everard had a studio in Orange Street, London and was self-taught. The book Second Sitting included photographs of a young Pamela Green. As early as 1939, Walter Bird, John Everard and Horace Roye had decided that they were giving each other too much competition. To resolve that difficulty they decided to cooperate, and they set up a company called Photo Centre Ltd. They made their headquarters in a suite of rooms above Walter Bird's studio in Savile Row, and Eves without Leaves was their first joint publication."]}, {"page": "Arthur Ferrier", "response": ["In 1941 Arthur Ferrier teamed-up with the well-known glamour photographer Horace Roye to produce the book Arthur Ferrier's Lovelies Brought to Life by Roye. It was published by Chapman and Hall."]}, {"page": "Horace (given name)", "response": ["*Horace Roye (1906–2002), British photographer"]}, {"page": "Walter Bird (photographer)", "response": ["Walter Bird (1903–1969) was a British photographer. Bird became known for his images of nudes and jointly set up a studio, Photo Centre Ltd., with John Everard and Horace Roye in 1939. From 1958 he was chief photographer for J. Russell & Sons, eventually purchasing the business in 1961. From 1958 to 1967 he was the official photographer for the National Photographic Record, initiated by the National Portrait Gallery to record important and influential citizens. He was a fellow of the Royal Photographic Society.", "Early in his career Bird worked mostly on advertising commissions and portraits that were published in periodicals such as Theatre World and Tatler. He shared his studios at Kinocrat House, 85, Cromwell Road, London with the photographer Joan Craven. He became famous for his images of nudes and was a rival of the photographers John Everard and Horace Roye. As the intense competition was harming their business, they eventually decided to cooperate instead, which led to them in 1939 setting up a joint company called Photo Centre Ltd."]}]}}