{"wiki_id": "http://www.wikidata.org/entity/Q5901860", "itemLabel": "Horace Hodges", "itemDescription": "British film actor and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Horace_Hodges", "wikipedia_page": {"main": "Horace Hodges (19 December 1863 – 6 July 1951) was a British stage and film actor and writer.Hodges was the author (with Thomas Wigney Percyval) of the play Grumpy which saw a Broadway production in 1913, a silent film version in 1923, and a sound version in 1930, with a Spanish film version Cascarrabias in the same year.", "link_mentions": [{"page": "Blandings Castle", "response": ["* Horace Hodges played Lord Emsworth in the 1933 silent film Summer Lightning, based on the novel Summer Lightning."]}, {"page": "Lord Emsworth", "response": ["* Horace Hodges played Lord Emsworth in the 1933 silent film Summer Lightning."]}, {"page": "List of fictional butlers", "response": ["| Chadwick || Butler to Sir Humphrey Pengallan || Horace Hodges || 1939 ||"]}, {"page": "Jamaica Inn (film)", "response": ["* Horace Hodges as Butler (Chadwick)"]}, {"page": "Robertson Hare", "response": ["In 1911 Hare made his professional stage debut, playing the Duke of Gallminster in a provincial production of The Bear Leaders. The following year he made his London début as one of the crowd in Gilbert Murray's version of Oedipus Rex at the Royal Opera House, Covent Garden. In 1913 he had his first role in a West End production, as Kaufman in a detective play, The Scarlet Band, at the Comedy Theatre. He then toured the provinces for a number of years. His first leading part was the title role of Grumpy, by Horace Hodges and T. Wigney Percyval, which was one of his favourite roles.\"Mr Robertson Hare\", The Times, 16 November 1979, p. vi Even at this early stage of his career Hare was playing old men: \"Grumpy\" is an irascible retired lawyer.\"Gaiety Theatre – Grumpy, The Manchester Guardian, 26 October 1920, p. 14 In December 1915 he married (Alice) Irene Mewton (1890/91–1969); they had one daughter."]}, {"page": "Wallack's Theatre", "response": ["In May 1902, Mrs. Moss renewed the ground lease. Over the following years, the theater's hits included The Sultan of Sulu (1902–03), a musical satire by George Ade with music by Alfred George Whathall; The County Chairman (1903–04) by George Ade, starring Maclyn Arbuckle; The Squaw Man (1905–06) by Edwin Milton Royle, starring William Faversham and George Fawcett; The Rich Mr. Hoggenheimer (1906–07), a musical farce with book and lyrics by Harry B. Smith and music by Ludwig Engländer, and starring Sam Bernard; A Knight for a Day (1907–08), a musical comedy with book and lyrics by Robert B. Smith and music by Raymond Hubbell; Alias Jimmy Valentine (1910) by Paul Armstrong, starring H. B. Warner and Laurette Taylor; Pomander Walk (1910–11) by Louis N. Parker, starring George Giddens and Lennox Pawle; Disraeli (1911–12) by Louis N. Parker, starring George Arliss; and Grumpy (1913–14), a thriller by Horace Hodges and T. Wigney Percyval, starring Cyril Maude and Margery Maude."]}, {"page": "List of British films of 1935", "response": ["|Old Faithful||Maclean Rogers||Horace Hodges, Glennis Lorimer||Drama||", "|Old Roses||Bernard Mainwaring||Horace Hodges, Nancy Burne||Crime||"]}, {"page": "List of British films of 1933", "response": ["|After Dark || Albert Parker || Horace Hodges, Hugh Williams || |Crime||"]}, {"page": "List of British films of 1932", "response": ["|After Dark||Albert Parker||Horace Hodges, Hugh Williams||Comedy||"]}, {"page": "List of British films of 1931", "response": ["|Other People's Sins||Sinclair Hill||Horace Hodges, Stewart Rome||Crime||"]}, {"page": "List of British films of 1936", "response": ["|Birds of a Feather||John Baxter||George Robey, Horace Hodges||Comedy||"]}, {"page": "A Night in Montmartre", "response": ["A Night in Montmartre (sometimes written as Night in Montmartre) is a 1931 British mystery film directed by Leslie S. Hiscott and starring Horace Hodges, Franklin Dyall, Hugh Williams, Reginald Purdell and Austin Trevor. It was based on a play by Miles Malleson.", "* Horace Hodges as Lucien Borell "]}, {"page": "Grumpy (1930 film)", "response": ["Grumpy is a 1930 American pre-Code drama film directed by George Cukor (in his directorial debut) and Cyril Gardner, and released by Paramount Pictures. The screenplay by Doris Anderson is based on a play by Horace Hodges and Thomas Wigney Percyval. A Spanish-language version entitled Cascarrabias, written by Catalan writer Josep Carner Ribalta (1898–1988) and directed by Gardner, was released by Paramount the same year. The film is a remake of a 1923 silent film of the same title."]}, {"page": "The Show Goes On (film)", "response": ["* Horace Hodges as Sam Bishop "]}, {"page": "Escape (1930 film)", "response": ["* Horace Hodges as Gentleman  "]}, {"page": "Badger's Green (play)", "response": ["*Dr. Wetherby - Horace Hodges"]}, {"page": "Summer Lightning (film)", "response": ["Summer Lightning is a 1933 British comedy film directed by Maclean Rogers and starring Ralph Lynn, Winifred Shotter, Chili Bouchier and Horace Hodges. It is based on the 1929 novel Summer Lightning by P.G. Wodehouse.", "* Horace Hodges – Lord Emsworth"]}, {"page": "London Melody", "response": ["In 1937, The Sydney Morning Herald called it an \"attractive and well-acted picture...Produced and directed by Herbert Wilcox in a way that contrasts favourably with Hollywood's efforts in a similar direction...Anna Neagle, a gifted actress, with definite charm and personality, makes a delightful Jacqueline. As the diplomat...Tulllo Carminati lends distinction and poise to his role. Perhaps the best character in the film is the priest, Horace Hodges, a lovable and very human person. Robert Douglas makes a good impression in the rather inconsistent part of Nigel Taplow, Andreani's secretary\"; whereas more recently, Sky Movies described it as \"a very thin musical vehicle for Anna Neagle, bizarrely cast as a cockney street singer. This dated offering...will prove tough going for all but hardened Neagle fans today.\""]}, {"page": "Three Maxims", "response": ["* Horace Hodges – Mike"]}, {"page": "Birds of a Feather (1936 film)", "response": ["Birds of a Feather is a 1936 British comedy film directed by John Baxter and starring George Robey, Horace Hodges and Eve Lister.BFI.org The screenplay concerns a sausage-making tycoon who rents a castle from an impoverished aristocrat. It was adapted from the play A Rift in the Loot by George Foster. It was made at Shepperton Studios as a quota quickie.Chibnall p.282", "* Horace Hodges as Lord Cheverton"]}, {"page": "Old Faithful (film)", "response": ["Old Faithful is a 1935 British drama film directed by Maclean Rogers and starring Horace Hodges, Glennis Lorimer and Bruce Lester. The screenplay concerns an elderly taxi driver who refuses to give up his old horse, even though his business is being taken by younger drivers using modern cars. His anguish is increased when his daughter plans to marry one of the younger taxi drivers.", "* Horace Hodges - Bill Brunning "]}, {"page": "Rolling in Money", "response": ["* Horace Hodges - Earl of Addleton"]}, {"page": "Old Roses", "response": ["Old Roses is a 1935 British crime film directed by Bernard Mainwaring and starring Horace Hodges, Nancy Burne and Bruce Lester.BFI.org The screenplay concerns an elderly man who assists the police in solving a murder, but accidentally reveals his own criminal past in the process.", "* Horace Hodges as Johnnie Lee "]}, {"page": "Grumpy (1923 film)", "response": ["Grumpy is a 1923 American silent comedy drama film distributed by Paramount Pictures. It is based on a 1913 Broadway play Grumpy by Horace Hodges and Thomas Wigney Percyval and starred English actor Cyril Maude. The director of this film is William C. deMille, brother of Cecil, and the star is Theodore Roberts. This film was remade by Paramount as an early sound film for Cyril Maude reprising his Broadway role. This silent version was thought to be long lost but a copy has been discovered in the Gosfilmofond Archive in Moscow, Russia.Progressive Silent Film List: Grumpy at silentera.comThe American Film Institute Catalog Feature Films: 1921-30 by The American Film Institute, c. 1971Grumpy as presented on Broadway at Wallack's Theatre, November 19, 1913 to April 1914, 181 performances; IBDb.com"]}, {"page": "Bronx Opera House", "response": ["| 04/23/1917 || Little Lady in Blue || Horace Hodges & T. Wigney Percyval || David Belasco"]}, {"page": "Follow Your Star", "response": ["* Horace Hodges as Mr. Wilmot  "]}, {"page": "Orson Welles theatre credits", "response": ["| Horace Hodges and T. Wrigley Percival"]}, {"page": "Other People's Sins", "response": ["Other People's Sins is a 1931 British crime film directed by Sinclair Hill and starring Horace Hodges, Stewart Rome and Anne Grey. It was made at Cricklewood Studios.Wood p.72 The screenplay concerns a father who takes the blame for a crime committed by his daughter.", "* Horace Hodges as Carfax  "]}, {"page": "Horace (given name)", "response": ["*Horace Hodges (1863–1951), British stage- and film actor and writer"]}, {"page": "After Dark (1932 film)", "response": ["After Dark is a 1932 British crime film directed by Albert Parker and starring Horace Hodges, Hugh Williams and Grethe Hansen. It was made at Walton Studios as a quota quickie.Chibnall p.266.", "*Horace Hodges as Thaddeus Cattermole Brompton  "]}, {"page": "Mr. Pim Passes By", "response": ["In London, the play was revived at the Globe Theatre for a limited season in 1922; C. Aubrey Smith replaced Webster as George; Vanbrugh and Boucicault reprised their roles from the premiere.\"The Globe\", The Stage, 13 April 1922, p. 16 In New York the Theatre Guild revived the play in 1927, with the three main principals from the first Broadway production repeating their roles. The revival ran from April to August, for 72 performances.\"Mr Pim Passes By\", Internet Broadway Database. Retrieved 22 April 2021 A 1928 London revival at the St Martin's Theatre starred Tempest and Brown, with Horace Hodges as Mr Pim.\"St Martin's Theatre\", The Times, 29 February 1928, p. 14"]}, {"page": "After Dark (Farjeon play)", "response": ["After premiering at the Pier Theatre in Eastbourne it transferred to the West End for a run of 56 performance, initially at the Garrick Theatre before moving to the Comedy Theatre. The original cast included Horace Hodges, Donald Calthrop and Malcolm Keen.Wearing p.463"]}]}}