{"wiki_id": "http://www.wikidata.org/entity/Q5921673", "itemLabel": "Howell Arthur Gwynne", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/H._A._Gwynne", "wikipedia_page": {"main": "Howell Arthur Keir Gwynne, CH (1865–1950) was a Welsh author, newspaper editor of the London Morning Post from 1911 to 1937.", "link_mentions": [{"page": "Daisy Greville, Countess of Warwick", "response": ["From 1912 Daisy began acting as leader and hostess of the 'Warwick Circle' at Easton Lodge, often based around select garden parties and largely dedicated to a reinvention of supposed folk traditions, pageants, dances and dialect plays, under the banner of the Dunmow and District Progressive Club, with newly written 'vernacular' plays performed at Lady Warwick's Barn Theatre at Little Easton. The purpose of the enterprise was the enlightenment of local lower classes, although these were not part of the 'Warwick Circle' or its social gatherings. Daisy commented on the coming endeavour in a 1911 letter to R. D. Blumenfeld with: \"We shall be a little group of the Salt of the Earth in the Dunmow District soon!\" Conrad Noel, the 'Red Vicar' of Thaxted, whom Daisy had appointed to his incumbency, was a critical supporter stating that this \"...smacked of [the] Bloomsbury\" set. Members of Cecil Sharp's English Folk Dance Society performed at the inaugural event at The Barn Theatre and Sharp noted that Daisy's vote of thanks contained a vision of \"merry dancers on village greens and the people of Easton dancing to meet the people of Dunmow\". Those who contributed and gravitated to be entertained in the 'Warwick Circle' were fellow socialist political proponents and literary figures, including H. G. Wells, Lancelot and Hugh Cranmer-Byng (playwrights and scions of the Torrington baronetcy), Samuel Levy Bensusan (dialect playwright and writer), Ramsay MacDonald, J. W. Robertson Scott, Howell Arthur Gwynne, Sir Walter Gilbey, Henry De Vere Stacpoole, J. M. Barrie, George Bernard Shaw, Cecil Sharp, Arnold Bennett and Harold Monro (poet).Gray, Victor, \"The Dunmow Progressives\", in Essex Heritage, ed. Kenneth Neale, Leopard's Head Press (1992), pp.285-302, "]}, {"page": "List of editions of Protocols of the Elders of Zion", "response": [":Related name: ed. & intro. Howell Arthur Gwynne"]}, {"page": "Maurice Debate", "response": ["On 8 May 1918 Howell Arthur Gwynne, editor of The Morning Post, wrote to Asquith admitting that he was a long-standing political enemy of his, but that it was in the national interest that he be restored as Prime Minister in Lloyd George's place.Grigg 2002, p494"]}]}}