{"wiki_id": "http://www.wikidata.org/entity/Q5927373", "itemLabel": "Hubert J. Foss", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Hubert_J._Foss", "wikipedia_page": {"main": "Hubert James Foss (2 May 1899 – 27 May 1953) was an English pianist, composer, and first Musical Editor (1923–1941) for Oxford University Press (OUP) at Amen House in London.  His work at the Press was a major factor in promoting music and musicians in England between the world wars, most notably Ralph Vaughan Williams, through publishing and encouraging performance of their works.  In doing this work, he made the Music Department of OUP a major publisher of music in the early- and mid-twentieth century.", "link_mentions": [{"page": "Oxford University Press", "response": ["In the London office, however, Milford had musical taste, and had connections particularly with the world of church and cathedral musicians. In 1921, Milford hired Hubert J. Foss, originally as an assistant to Educational Manager V. H. Collins. In that work, Foss showed energy and imagination. However, as Sutcliffe says, Foss, a modest composer and gifted pianist, \"was not particularly interested in education; he was passionately interested in music.\" When shortly thereafter Foss brought to Milford a scheme for publishing a group of essays by well-known musicians on composers whose works were frequently played on the radio, Milford may have thought of it as less music-related than education-related. There is no clear record of the thought process whereby the Press would enter into the publishing of music for performance. Foss's presence, and his knowledge, ability, enthusiasm, and imagination may well have been the catalyst bringing hitherto unconnected activities together in Milford's mind, as another new venture similar to the establishment of the overseas branches.Hinnells p. 6"]}, {"page": "Edward Foss", "response": ["He married in 1814 Catherine, eldest daughter of Peter Finch Martineau, by whom he had one son, who died in infancy, and in 1844 Maria Elizabeth, eldest daughter of William Hutchins, by whom he had six sons (of whom the eldest, Edward, a barrister, assisted in the preparation of the ‘Biographia Juridica’) and three daughters. One of his grandsons was the composer, critic, and publisher of music Hubert J. Foss."]}, {"page": "Donald Tovey", "response": ["Similarly in his book on Beethoven, dictated in 1936 but published posthumously in 1944:D.F. Tovey, Beethoven, with an editorial preface by Hubert J. Foss (Oxford University Press, London 1944), p. 29."]}, {"page": "Roy Henderson (baritone)", "response": ["He recorded the first complete Purcell Dido and Aeneas with Nancy Evans and the Boyd Neel ensemble conducted by Clarence Raybould before 1936.Also with Mary Hamlin, Mary Jarred and Dr Sydney Northcote, with Bernhard Ord (continuo), Charles Kennedy Scott's A Capella singers, and directed by Hubert J. Foss, Decca, for the Purcell Club by subscription, X 101-107 (14 sides)). cf. Darrell 1936, 371. In 1938, Henderson was one of the original 16 soloists in Vaughan Williams's Serenade to Music (his is the solo line to the words 'Nor is not moved with concord of sweet sounds'). In March 1940, he was involved in the Glyndebourne Company revival of The Beggar's Opera, directed by John Gielgud, at the Haymarket Theatre in London."]}, {"page": "César Franck", "response": ["*Vallas, Léon (1951). César Franck. Trans. Hubert J. Foss. New York: Oxford University Press.  Trans. of La véritable histoire de César Franck (1949) "]}, {"page": "Peter Warlock", "response": ["Heseltine's major literary work of this period was a biography of Delius, the first full-length study of the composer, which remained the standard work for many years.Beecham, p. 9 On its 1952 reissue, the book was described by music publisher Hubert J. Foss as \"a work of art, a charming and penetrating study of a musical poet's mind\".Smith 1994, p. 201 Heseltine also worked with Gray on a study of the 16th-century Italian composer Carlo Gesualdo, although disputes between the two men delayed the book's publication until 1926."]}, {"page": "John Gardner (composer)", "response": ["Gardner was educated at Eagle House School, Sandhurst, Wellington College and Exeter College, Oxford.'GARDNER, John Linton', in Who's Who 2012 (London: A. & C. Black, 2012) online article (subscription site), by Oxford University Press (OUP) , January 2012, accessed 20 April 2012 An important figure in his early life was Hubert J. Foss of Oxford University Press, who published the Intermezzo for Organ in 1936 and introduced him to the composer Arthur Benjamin, to whom Gardner dedicated his Rhapsody for Oboe and String Quartet (1935). This work had its first performance at the Wigmore Hall in February 1936. The String Quartet No. 1 (1938) was broadcast from Paris by the Blech Quartet in 1939, and the anthem The Holy Son of God most High (1938) was also published by OUP. At Oxford Gardner was friendly with Theodor Adorno with whom he played piano duets."]}, {"page": "Foss (surname)", "response": ["*Hubert J. Foss (1899–1953), English music publisher, pianist and composer"]}, {"page": "Thomas Pitfield", "response": ["His music was published by more than 50 publishers. Hubert J. Foss of the Oxford University Press published many of his compositions, illustrations, frontispieces and cover-designs, which he made for various publications, including the one for Benjamin Britten's Simple Symphony."]}, {"page": "Double Crown Club", "response": ["The first president, Roberts writes, was Holbrook Jackson. In 1924, Roberts was a member of the club's original committee along with Frank Sidgwick, Hubert J. Foss, Oliver Simon and Gerard Meynell. The current Dinner Secretary, responsible for all event arrangements, is Honorary Member James Freemantle."]}, {"page": "Hubert J Foss", "response": ["#REDIRECT Hubert J. Foss"]}, {"page": "Hubert Foss", "response": ["#REDIRECT Hubert J. Foss"]}, {"page": "Hubert James Foss", "response": ["#REDIRECT Hubert J. Foss"]}, {"page": "Charles Kennedy Scott", "response": ["*Purcell: Dido and Aeneas (first complete): Nancy Evans (Dido), Mary Hamlin (Belinda), Roy Henderson (Aeneas), Mary Jarred (Sorceress), Olive Dyer (Spirit), Dr Sydney Northcote (Sailor), Gladys Currie (Second woman), Gwen Catley and Gladys Currie (Witches), Charles Kennedy Scott's A Cappella Singers, Boyd Neel String Orchestra, Boris Ord (continuo), Clarence Raybould (conductor), Hubert J. Foss (Musical director). (Decca Records, X 101–107, 7 12\" 78rpm records, by subscription only for the Purcell Society).R. D. Darrell, The Gramophone Shop Encyclopedia of Recorded Music (Gramophone Shop, New York 1936).For a full-length review of this recording see The Gramophone, December 1935, p. 19 ff.", "The Bach Cantata Club was formed in 1926, with the aim of making known the church and secular cantatas of J. S. Bach and his instrumental works, performed with resources similar to those which Bach himself must have planned for when he was composing. In this project Scott was joined by Hubert J. Foss and E. Stanley Roper (organist of the Chapel Royal), and they received assistance from the Bach musicologist Dr Charles Sanford Terry (who contributed programme notes, and gave a lecture on Bach's Chorales and Chorale Preludes in 1927) and from Dr W. G. Whittaker, director of the Newcastle Bach Choir (on which the London Club was partly modelled). The Vice-President was Dr Albert Schweitzer, who from time to time acted as organist at the Society's concerts. The choir of the Club consisted of twenty-five singers, mostly professional, while the instrumental work was an ensemble of London players called the Bach Chamber Orchestra. The choral concerts mostly took place at St. Margaret's, Westminster, and the orchestral performances at the Royal College of Music.Elkin 1944, 66–67. A command performance of the unaccompanied motets was given before the king and queen at Buckingham Palace in 1927, and the Motet 'Jesu Joy and Treasure' was recorded for HMV in the same year.Circulars with Concert Programme 1929 (cited below)."]}, {"page": "John Alfred Valentine Butler", "response": ["and medical sciences. From 1949 to 1977 the Butler’s lived in Rickmansworth in a house then known as Nightingale Corner, which had previously belonged to Hubert J. Foss, first Musical Editor (1923–1941) for Oxford University Press. Like the Fosses, the Butlers often entertained guests there."]}, {"page": "List of Old Bradfieldians", "response": ["*Hubert J. Foss (1899–1953), composer and music publisher"]}]}}