{"wiki_id": "http://www.wikidata.org/entity/Q5927140", "itemLabel": "Jason Merrells", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jason_Merrells", "wikipedia_page": {"main": "Jason Scott Merrells (born 2 November 1968 in Epping, Essex) is an English actor, who is best known for his roles as receptionist Matt Hawley in BBC One medical drama series Casualty, stylist Gavin Ferraday in BBC One hairdressing drama series Cutting It, headteacher Jack Rimmer in BBC One school-based drama series Waterloo Road and Home Farm owner Declan Macey in ITV soap opera Emmerdale. More recently, he plays the role of Sir Charles Fraith in Agatha Raisin. Jason will be returning to Waterloo Road in 2022 as Jack Rimmer.", "link_mentions": [{"page": "Queer as Folk (British TV series)", "response": ["* Jason Merrells as Phil Delaney; a close friend of Vince and Stuart"]}, {"page": "The Jealous God", "response": ["The novel was adapted as a feature film and released to British cinemas in 2005. The writer-director was Steven Woodcock. Jason Merrells played Vincent, Denise Welch played Maureen, and Mairead Carty played Laura. Other actors featured were Marcia Warren (Mrs Dungarvan), Andrew Dunn (Matthew) and Roy Walker (the Monsignor). Allan Gill School boy #4 (uncredited)"]}, {"page": "Queer as Folk (American TV series)", "response": ["* Scott Lowell as Ted Schmidt (UK version: Jason Merrells as Phil Delaney)"]}, {"page": "John Bindon", "response": ["Bindon appeared as a character played by the actor Jason Merrells in the stage play A Princess Undone which opened at the Cambridge Arts Theatre in October 2016."]}, {"page": "Russell T Davies", "response": ["After he wrote the pilot, he approached actors for the main characters. Christopher Eccleston was Davies' first choice for the role of Stuart Jones; Eccleston declined because of his age and suggested his friend Aidan Gillen instead. The roles of Vince Tyler and Nathan Maloney were given to Craig Kelly and Charlie Hunnam, and the secondary character Alexander Perry, originally written for the television producer Phil Collinson during his brief acting career, was portrayed by Antony Cotton, who later played the gay character Sean Tully in Coronation Street. The series was allocated a £3 million budget, and was produced by Red Productions, owned by his friend and former colleague Nicola Shindler, and filmed by director Charles McDougall and Sarah Hardin on location in Manchester. The eight 40-minute episodes emulated experiences from his social life and includes an episode where the minor character Phil Delaney (Jason Merrells) dies of a cocaine overdose, unnoticed by his social circle."]}, {"page": "Theatre Royal Haymarket", "response": ["Productions in 2016 included a revival of Alan Ayckbourn's How the Other Half Loves, starring Nicholas Le Prevost, Jenny Seagrove, Tamzin Outhwaite and Jason Merrells,Cole, Emily. \"Casting announced for How The Other Half Loves\", Whats on Stage, 29 February 2016 and Pixie Lott made her debut at the Haymarket as Holly Golightly in Breakfast at Tiffany's.Cole, Emily \"Full casting announced for Breakfast at Tiffany's\", Whats on Stage, 28 January 2016 In December the Royal Shakespeare Company took up residence at the Haymarket with a double bill of Love's Labour's Lost and Much Ado About Nothing.Cole, Emily. \"Cast announced for RSC's Love's Labour's Lost and Much Ado About Nothing\", Whats on Stage, 24 June 2016 In 2017, Damian Lewis and Sophie Okonedo starred in Edward Albee's The Goat, or Who is Sylvia? from March to June.Hewis, Ben. \"Sophie Okonedo joins Damian Lewis in The Goat, or Who is Sylvia?\", Whats on Stage, 21 October 2016 The RSC then returned to the theatre with Queen Anne.Longman, Will. \"Further casting announced for Queen Anne West End transfer\", Whats on Stage, 8 May 2017 Natalie Dormer and David Oakes later starred in Venus in Fur.Hewis, Ben. \"Natalie Dormer and David Oakes to star in Venus in Fur\", Whats on Stage, 12 May 2017"]}, {"page": "Buckhurst Hill County High School", "response": ["* Jason Merrells, actor"]}, {"page": "Clocking Off", "response": ["It was effectively an anthology programme, following the lives of a group of workers at a Manchester textile factory, with each episode focusing on the home life of a different character. Well-known actors who appeared in the series included Christopher Eccleston, Sophie Okonedo, Philip Glenister, John Simm, Lesley Sharp, Siobhan Finneran, Emma Cunniffe, Diane Parish, David Morrissey, Ricky Tomlinson, Julian Rhind-Tutt, William Ash, Ben Crompton, Jack Deam, Jack P. Shepherd, Tina O'Brien, Jason Merrells, Pam Ferris, Wil Johnson, Ashley Jensen, Susan Cookson, Mark Benton, Sarah Lancashire, Crissy Rock, Marshall Lancaster, Marc Warren, Claire Sweeney and Maxine Peake.", "* Jason Merrells as Martin Leach (Series 1–2)"]}, {"page": "Gillian Kearney", "response": ["In 2002, Kearney landed the role of June Forsyte in the ITV1 adaptation of John Galsworthy's classic novel The Forsyte Saga. She later reprised the role for the second series. Following the success of The Forsyte Saga, Kearney's next role brought her back onto the ITV screen in its newest medical drama, Sweet Medicine. Kearney was cast as Dr Deborah \"Deb\" Sweet, and starred alongside Jason Merrells, who played her husband, and Patricia Hodge as her formidable mother-in-law. The show was intended to take up the mantle of the popular rural drama Peak Practice, which had recently ended, but low viewing figures saw Sweet Medicine axed after just one series."]}, {"page": "Andy Sugden", "response": ["When John dies in a car accident after skidding on ice in Andy's Land Rover, Andy is guilt ridden after he finds out and thinks his car was the cause of the accident. John's widow, Moira Barton (Natalie J. Robb), assures him it was icy and that he is not to blame. Andy breaks down and tells Moira he feels like he has lost a brother after he and Moira talk about his and the Bartons' first meeting on the farm. Debbie tries to console Andy and, much to her surprise, he confesses his love for her but she breaks his heart by telling him that she loves Cameron. After Cameron warns Andy off, Andy reveals in a rage the baby was conceived naturally, not artificially. Following tests, Andy and Debbie discover the child is a match and they are delighted. Andy finds himself close to Katie again when he gives her advice after she leaves her ex-husband, Declan Macey (Jason Merrells). This leads to Declan and Andy fighting in The Woolpack. When Katie returns to fight for her marriage only a week later, Andy welcomes her back but warns Declan to start treating her the way she deserves."]}, {"page": "Andrea Lowe", "response": ["She starred in Alan Ayckbourn's play How the Other Half Loves alongside Jenny Seagrove and Jason Merrells at the Duke of York's Theatre, the West End theatre, on St Martin's Lane, London in 2016."]}, {"page": "Lisa Dingle", "response": ["Stress continued to pile on to Lisa throughout the months as Charity's life spiralled out of control when her husband Declan Macey (Jason Merrells) attempted to kill her, and Sam's girlfriend Rachel Breckle (Gemma Oaten) was forced to go into hiding to cover for her, and it all came crashing down in October 2014 when Lisa, after welcoming Belle home against her boss Jai's wishes, was sacked from Sharma & Sharma, and suffered what she believed to be a heart attack as she cried herself home. Lisa's health scare lead to her being diagnosed with angina, and what she suffered was an angina attack. She would have to rest a lot more now, so Zak took up most of the household chores for Lisa's sake."]}, {"page": "Cutting It", "response": ["Jason Merrells as Gavin Ferraday: Described by most of his friends and colleagues as 'the most sorted man on the planet'. Gavin is confident, straightforward, good-looking and kind-hearted. Gavin's business-mindedness and expertise is what has brought the Henshall-Ferraday salon to award winning status (much to his wife Allie's resentment) through the countless celebrities he has brought in and the trophies and honours he has won. Although he is ambitious and determined like his wife, he feels he has conquered almost everything in the world of hairdressing, and wants to settle down and raise a family."]}, {"page": "Katie Sugden", "response": ["Katie Sugden (also Addyman and Macey) is a fictional character from the British ITV soap opera Emmerdale, played by Sammy Winward. She made her first screen appearance on 18 July 2001 and Winward's casting was announced a week prior. The character was introduced as a love interest for Andy Sugden (Kelvin Fletcher) and their relationship was a focus point for most of the character's tenure. Winward took maternity leave in 2005, returning the following year. Katie's later stories include relationships with Adam Barton (Adam Thomas) and Declan Macey (Jason Merrells), the latter whom she marries. Writers placed Katie in danger in 2012 when she is involved in a mineshaft accident. Winward announced her decision to leave the series in November 2014 and Katie was killed-off, making her final appearance on 9 February 2015.", "After briefly dating Nikhil Sharma (Rik Makarem), Katie becomes interested in Declan Macey (Jason Merrells) and his ex-wife, Ella Hart (Corrinne Wicks), tries to warn her off but Katie and Declan begin dating regardless. When Declan's daughter, Mia (Sapphire Elia), dies in a car crash, he reveals that he was not her biological father and Katie supports him through his grief. Declan proposes twice to Katie but she turns him down on both occasions. However, she does move in with him at Home Farm and they are happy together until Declan's half-sister, Megan (Gaynor Faye), visits and takes an immediate dislike to Katie. Megan helps Declan organise a music festival and Katie works hard to convince Megan that she is with Declan because she loves him, and is not after his money as Megan believes. Megan tells Katie about Declan's money troubles being the reason he had contacted her and asked for financial backing with the festival, causing them to argue. Katie leaves briefly but Megan apologises and asks her to return. Katie supports Megan when she reveals that she gave her son, Robbie Lawson (Jamie Shelton) up for adoption when she was younger. Declan finds Robbie and he moves into Home Farm as well. Robbie flirts with Katie and tries to persuade her to leave Declan for him but when she rejects him, Robbie starts making her feel uncomfortable. In retaliation, as Declan refuses to ask him to leave, she manipulates a situation in which Robbie tries to kiss her and uses the CCTV to film him attacking her, wanting to expose his true colours. Declan believes her but Megan suspects the truth and blackmails Declan into allowing Robbie to stay, making Katie move out. However, Declan apologises and he proposes again. This time Katie accepts, much to Robbie and Megan's disapproval, and Declan plans to keep all the festival profits for himself and Katie agrees to help him. Megan interrupts Katie and Declan's wedding when Robbie tells her what has they had done. However, she leaves and the couple marry but at the reception, Megan pushes Katie's face into the wedding cake.", "In one storyline Katie was paired with Adam Barton portrayed by Adam Thomas following the end of Katie's relationship with Declan Macey portrayed by Jason Merrells, speaking about Katie and Adam's pairing, Winward told Digital Spy: \"I enjoyed it because I thought it was a good contrast from the Declan relationship, which was so intense and heavy. So much went wrong with Declan, so when Katie started dating Adam he was young, good-looking and very fun-loving. The contrast for her was the enticing thing.\"", "On 6 November 2012, it was announced that an upcoming storyline would see Katie fall into a mineshaft after having an argument with husband Declan. Jason Merrells who plays Katie's husband Declan Macey commented on the storyline saying: \"Declan is absolutely in bits - he's a complete mess. He realises that he was being silly by arguing so much with Katie, and now he could have lost her completely. He goes into a meltdown about it.\" Winward - also revealed: \"At first, Katie thinks there's a possibility of getting out because Declan throws a rope down and also tries to pull her up with his coat. But Declan's attempts to rescue her don't work and then she actually falls deep down into the mine. After that, Katie realises that she doesn't have much hope of getting out unless she takes action herself.\""]}, {"page": "Angela Griffin", "response": ["From 2006 to 2010, she appeared as art teacher and head of pastoral care Kim Campbell opposite former Cutting It co-star Jason Merrells and former Coronation Street co-star Denise Welch in the BBC One school-based drama series Waterloo Road. She took a break during the third series in late 2007/early 2008, but returned to the role for the fourth series in 2009.  However, she left once again at the end of the fifth series to concentrate on her new daytime show on Sky1."]}, {"page": "University of Chichester", "response": ["In 1977 Bishop Otter College and the Bognor Regis college were merged to form the West Sussex Institute of Higher Education (WSIHE), with degrees being awarded by CNAA and later the University of Southampton.  Alumni from this period include the actor Jason Merrells and the author Paula Byrne. Between 1995 and 1999, it was known as Chichester Institute of Higher Education. It gained degree-awarding powers in 1999, becoming  known as University College Chichester, and became recognised as a full university in October 2005."]}, {"page": "Alan Turner (Emmerdale)", "response": ["In March 2012, Alan, having once run Home Farm and been a councillor, has doubts about the village festival planned by Home Farm owner Declan Macey (Jason Merrells) for the summer and raised his concerns to him. At the end of the month, he shares his war experiences with Sean Spencer (Luke Roskell) when he was doing a school project. He welcomes fellow housemate Betty home when she returns from her cruise in July. In July 2013, it was explained that Alan had gone travelling around France with his biker friends. In October, Alan returns (off-screen) but when Betty goes to see him, she finds he has died in his sleep. His funeral is held on 30 October and Steph returns under police guard to attend. Alan is mentioned in May 2015 when Betty says to Pearl that without Seth or Alan, life in the village would never be the same. In June 2017, Zak visits Alan's grave and tidies it up."]}, {"page": "Waterloo Road (TV series)", "response": ["The show utilises an ensemble cast, led by the school's staff members. Six Headteachers were featured over the series' run, beginning with Jason Merrells as Jack Rimmer. After leaving early in the third series, Merrells was followed by Eva Pope as Rachel Mason until series 5, Amanda Burton as Karen Fisher in series 6 and the first part of series 7, Alec Newman as Michael Byrne in series 7 and 8, Laurie Brett as Christine Mulgrew in series 9 and Neil Pearson as Vaughan Fitzgerald in series 10. Brett also stars in series 8 and 10, outside of Christine's tenure as Headteacher. The longest-running cast members were Philip Martin Brown (Grantly Budgen), Jason Done (Tom Clarkson) and Chelsee Healey (Janeece Bryant), who appeared from series 1 until their exits in series 9 for Brown and 8 for Done and Healey, respectively. Healey was not in Series 5, however.", "The original teaching characters consisted of Headteacher Jack Rimmer (Jason Merrells); Deputy Headteacher Andrew Treneman (Jamie Glover); Art teacher and Head of Pastoral Care Kim Campbell (Angela Griffin); Head of English Grantly Budgen (Philip Martin Brown); English teachers Lorna Dickey (Camilla Power) and Tom Clarkson (Jason Done); Head of French Steph Haydock (Denise Welch); and Head of Drama Izzie Redpath (Jill Halfpenny). The student characters included Donte Charles (Adam Thomas), Chlo Grainger (Katie Griffiths), Janeece Bryant (Chelsee Healey), Yasmin Deardon (Rhea Bailey), Mika Grainger (Lauren Drummond) and Lewis Seddon (Craig Fitzpatrick)."]}, {"page": "Charity Dingle", "response": ["Charity later married Declan Macey (Jason Merrells) and had a secret abortion, which led Declan to try to kill her. Atkins took maternity leave in February 2015, as Charity was sentenced to prison after confessing to her crimes. Atkins returned briefly from June to July and again in December that year, before making a permanent return in March 2016.", "Charity and Cain start stealing cars to make money after Charity steals a businessman's keys after flirting with him at a local hotel. However, the second time they try this, they learn that their target, Declan Macey (Jason Merrells), knows people in the village and spots Charity. Declan tells her that he will not go to the police if she returns the car and has a drink with him."]}, {"page": "Bernice Blackstock", "response": ["In March 2014, she begins to plan opening a salon in the area. Despite the fact that most people seem relatively uninterested, Bernice holds a brainstorming session with Val, Alicia Gallagher (Natalie Anderson), David Metcalfe (Matthew Wolfenden) amongst others. However, it is ruined when Val reveals to Alicia that her son Jacob (Joe-Warren Plant) has been stealing items from her and David's shop to sell at school. Kerry Wyatt (Laura Norton) begs Bernice to let her work in the salon, as she is a beautician and hairdresser without qualifications. She gives Pearl Ladderbanks (Meg Johnson) and Betty Eagleton (Paula Tilbrook) a makeover to try to prove herself. Declan Macey (Jason Merrells) lets Bernice rent Pear Tree Cottage, even though her brother-in-law Jimmy works there already. Andy Sugden (Kelvin Fletcher) agrees to help her set up the salon and she gives him a free massage to thank him, but he is embarrassed and leaves when his ex-girlfriend Kerry arrives. He then agrees to help her again and she makes a pass at him and the pair end up kissing and having sex. They begin a relationship in secret, although it is soon rumbled when they are caught in the salon by Nicola, Rodney and Kerry. When Andy is involved in a severe farming accident, Bernice tries her best to help him, but later reveals in a conversation with Chas that she finds herself irritating Andy. She is later horrified when she spots Andy and his ex-wife Katie (Sammy Winward) kissing in the street. After drinking a bottle of wine, Bernice storms over to Katie and slaps her publicly, before descending into a catfight. As Chas and Finn Barton (Joe Gill) try and stop the fight, Katie slaps Bernice to try and stop her from attacking her. Bernice then grabs Finn's sausages and hits Katie with them and when Andy arrives, she does the same to him. Bernice then humiliates Katie in front of Leyla Harding (Roxy Shahidi) before leaving the village for Australia."]}, {"page": "David Metcalfe", "response": ["In June 2010 David was blackmailed by Nathan Wylde (Lyndon Ogbourne) in order to get a barn conversion for Declan Macey (Jason Merrells). Nathan set David up by getting a female friend of his to make a pass at David as it was being recorded on video. Nathan used the tape to blackmail David and also promised to ruin Eric's business, if David didn't give him what he wanted, he offered to pay the deposit on a house for David and Leyla, if David got him planning permission for the barn. David agreed and subsequently got a home for him and Leyla. Leyla later found the tape when her and David were doing up the house and believed he was having an affair, he managed to convince her that it was a setup and they reconciled."]}, {"page": "Neil Stuke", "response": ["| Short film by Jason Merrells"]}, {"page": "Sweet Medicine", "response": ["Sweet Medicine starred Patricia Hodge as Georgina Sweet, Jason Merrells as Dr. Nicholas Sweet and Gillian Kearney as Dr. Deb Sweet."]}, {"page": "Jamie Glover", "response": ["Glover made his professional debut in the soap opera Jupiter Moon. Other television credits include Birds of a Feather, Casualty, Joseph, New Tricks, Midsomer Murders and Trial & Retribution XV: Rules Of The Game. He played peng deputy head Andrew Treneman in the first two series of the BBC One school-based drama Waterloo Road, alongside Jason Merrells and Angela Griffin, and briefly reprised the role in the fourth series."]}, {"page": "Thelma Holt", "response": ["* Measure for Measure by William Shakespeare directed by Jamie Glover with Alistair McGowan and Jason Merrells. UK tour in association with Theatre Royal Plymouth."]}, {"page": "List of Waterloo Road characters", "response": ["*Jack Rimmer (Jason Merrells, series 1−3) is the Headmaster of Waterloo Road from the start of the series, who assumes the position in an acting capacity after his predecessor's public breakdown. His efforts to turn the school around face various challenges, and his confrontational style causes consternation. He has romantic liaisons with Steph Haydock and LEA inspector Heather Davenport, and a more serious relationship with Davina Shackleton. In series 3, after witnessing Izzie Redpath's death he finds it increasingly difficult to cope with the pressures of running the school, and resigns with immediate effect after being reprimanded for financial mismanagement. He briefly returns later in series 3 in an attempt to win Davina back, but she chooses to remain with Tom."]}, {"page": "Shinya Fukumatsu", "response": ["*Safe House (David Blackwell (Jason Merrells))"]}, {"page": "La petite mort (disambiguation)", "response": ["* La petite mort, short film by Jason Merrells"]}, {"page": "Lark Rise to Candleford (TV series)", "response": ["| James Dowland || Jason Merrells || colspan=\"1\"  || colspan=\"1\"  || colspan=\"2\" "]}, {"page": "List of former Emmerdale characters", "response": ["| Declan Macey || Jason Merrells || 2010–2014"]}, {"page": "Characters of Casualty", "response": ["Ash joined the hospital as a staff nurse and was promoted to senior staff nurse in series 7. When Lisa \"Duffy\" Duffin (Cathy Shipton) left the hospital, Ash became a charge nurse later on. He was suspended from the hospital when a racist thug that threatened him with a knife accuses him of assault, but was acquitted when Matt Hawley (Jason Merrells) admits he overheard the man threatening Ash. Ash continued his role of charge nurse until his departure. Ash returned to the ED in 2013 as a locum consultant, who was eventually given a permanent place within the hospital.", "Jude Korcanik, portrayed by Lisa Coleman, first appears in the ninth series episode \"First Impressions\", originally broadcast on 24 September 1994. Jude is a \"straightforward, down-to-earth and compassionate\" staff nurse. Her appearance consists of a dreadlocks hairstyle and multiple piercings. Coleman had her nose pierced for the role. Jude is an atheist and makes a point of not celebrating Christmas. Prior to joining Casualty, Coleman was squatting and living in housing cooperatives. She researched the NHS for the role and was shocked to learn about its struggles. The character was given a love interest in Matt Hawley (Jason Merrells) and following a one-night stand, Jude learns that she is pregnant. Coleman expected to receive a negative response from the story, but thought that she did not because the story promoted safe sex."]}, {"page": "The Project (film)", "response": ["* Jason Merrells as Dougie"]}, {"page": "Do Not Disturb (1999 film)", "response": ["* Jason Merrells as Chris Mulder"]}, {"page": "Celebrity Mastermind", "response": ["| Jason Merrells || Life and work of Leonardo da Vinci || 3rd"]}, {"page": "List of Emmerdale characters (2004)", "response": ["In 2013, Noah was upset when Charity left Jai, following the revelation of his fling with Rachel Breckle (Gemma Oaten) and also with the fact they had to live with Debbie, Sarah and Debbie's son Jack Sugden (Seth). Charity later changes both hers and Noah's surnames back to Tate. In 2014, he is annoyed when Charity starts dating Declan Macey (Jason Merrells) and starts to completely ignore him when he reveals they are engaged. However, after Charity books an abortion appointment, Declan tells Noah that Charity is pregnant."]}, {"page": "Nathan Wylde", "response": ["In May 2010, Nathan returns, shocking his mother. She tells him to leave, and he stays the night at the B&B. Natasha later agrees to let him stay at Home Farm on one condition, that he pay back the money he blackmailed from her. Nathan pays back the money and Natasha lets him work for her again. Nathan takes an instant dislike to his mother's new business partner, Declan Macey (Jason Merrells) who had bought Nathan's share of the estate whilst he had been away. Nathan demanded his share back but Declan refuses to give it to him. Nathan is further enraged when Declan and Natasha begin a relationship and he threatens to report her to the police for his father's murder but Natasha threatens to take him down with her for helping her cover up the crime."]}, {"page": "Maisie Wylde", "response": ["At her father's funeral, Ryan is released to attend the ceremony and by the graveside, he makes a plea for Maisie to visit him, having heard about the phone from his solicitor. Later, Natasha's boyfriend Declan Macey (Jason Merrells) gives her advice and she leaves the wake and goes to see Ryan. At the prison, she reluctantly reveals her thoughts that Nathan is responsible for the theft of her phone and framing Ryan. She leaves hastily, but promises not to give up on him. The following day, Sam Dingle (James Hooton) admits that he found Mark's wallet in the woods and gave it to Cain, his half-brother. Cain visits Maisie and reveals his blackmailing of Natasha and Nathan, but he tells her that he cannot go to the police without incriminating himself for blackmail and deception. Breaking down in Declan's house, Maisie reveals that she believes Nathan killed her father and that Natasha was covering for him. The pair vow to help clear Ryan's name and free him from prison."]}, {"page": "Emma Lowndes", "response": ["Lowndes lives in London with her partner, Jason Merrells and their daughter."]}, {"page": "Moira Barton", "response": ["Holly develops an addiction to drugs, which puts a strain on the whole family. She runs away and later steals from the house. Moira and John try keeping Holly locked up in her room to make her go cold turkey. However, Moira cannot bear to see her suffer and she buys some heroin for her daughter. She is then caught and cautioned by the police. Moira finds out that her son, Adam, is having an affair with Ella Hart (Corrinne Wicks) and she demands that he ends it. Moira warns Ella to back off, but Ella's husband, Declan Macey (Jason Merrells), then finds out about the affair. Moira makes Adam tell John about the affair. John becomes angry because it could affect a deal he has with Declan about the farm. John and Moira's relationship becomes strained once more, especially when Cain reveals that Moira is paying him in instalments for a Land Rover. Angered by this, Moira goes to the garage to confront Cain. Despite the two arguing, they end up having sex which leads to them beginning an affair. Moira confides in Diane about the affair, but does not initially say who she is seeing. Cain tells John about the affair and when he throws Moira out, she goes to stay with her mother."]}, {"page": "Jai Sharma", "response": ["During his time on the show, Jai formed the \"Sharma & Sharma factory\" alongside Nikhil and their father Rishi (Bhasker Patel); closely interacted with his estranged mother Georgia Sharma (Trudie Goodwin); developed a close friendship with local businessman Declan Macey (Jason Merrells) that lasts until it transpires that Jai is the father of Declan's supposed daughter, Mia (Sapphire Elia), following her death in a road collision; embarked on a relationship-turned-marriage with wayward \"tart with a heart\" Charity Tate (Emma Atkins); became enemies with Charity's cousin and ex-lover Cain Dingle (Jeff Hordley) over his attempts to destroy their relationship and bonding with Jai's sister Priya (Fiona Wade); engaged in a one-night stand with Pyria's friend Rachel Breckle (Gemma Oaten) that results in her conceiving their beloved son, Archie, and his marriage with Charity ending; kidnapping Charity after she took revenge for his one-night stand by framing Rachel for setting fire to Declan's house, \"Home Farm\", in order for her to abscond the country with Archie so that Jai would never see his son again; reclaim his son Archie until Rachel returns to reveal that she had him all along and that the child Jai had was never Archie; married Declan's sister Megan (Gaynor Faye) over their mutual animosity towards Charity; sparked an affair with Megan's business partner Leyla Harding (Roxy Shahidi) that results in Megan betraying Jai in his custody battle with Rachel over Archie; repeatedly clashed with Cain's brother and Rachel's boyfriend Sam (James Hooton); exhibited a cocaine addiction until he eventually reconciles with Megan after she gives birth to their daughter Eliza; befriended Cain's stepdaughter Holly Barton (Sophie Powles) about his cocaine addiction and later feeling guilty when she later dies of an overdose; and romanced with Holly's apparent best-friend, Nell Fairfax (Scarlett Archer), who soon turns out to be an con-artistic drug addict.", "Carl King (Tom Lister) accuses Jai and Nikhil of causing a massive chemical spill and Jai decides to teach Carl a lesson but Nikhil stops him. Jai and Faye date briefly. Jai gives Charity Tate (Emma Atkins) a job at the factory and makes it clear that he likes her. She likes him too but refuses to take things any further while she is dating Cain Dingle (Jeff Hordley). After Charity learns that Cain has cheated on her, she ends the relationship and starts dating Jai. Cain tries numerous ways to break Jai and Charity up but Jai only ends things with Charity when he learns that she has been undermining Nikhil at the factory. Charity tries to get Jai to change his mind, but he refuses but throws Ella Hart (Corrinne Wicks) out when she makes advances towards him. Charity eventually persuades Jai to rekindle their relationship and the pair get engaged. At the engagement party, Declan Macey (Jason Merrells) attacks Jai after Ella reveals that Jai is Mia Macey's (Sapphire Elia) birth father, not him."]}, {"page": "The Jealous God (film)", "response": ["The movie stars Jason Merrells and Denise Welch (both popular British TV actors) and is reasonably faithful to the novel's main narrative line, although it sanitises certain elements such as its protagonist's nascent racism.  It tells the story of Vincent, a young Catholic school teacher still living with his possessive widowed mother. She wants him to become a priest, and the movie explores how he is torn between this and sex and a commitment to his family and his faith. The movie looks similar to Between Two Women and has the same attention to detail in the sets and costumes and uses similar convincing period locations, steam trains, etc. Some of the same actors appear in both movies."]}, {"page": "Epping, Essex", "response": ["* Jason Merrells, actor"]}, {"page": "List of Emmerdale characters (2010)", "response": ["Hazel rows with Jerry over who would take care of Jackson when he leaves hospital and Jerry tells her that he wants Jackson to stay with him.  However, Hazel's landlord Declan Macey (Jason Merrells) offers her his old house Dale Head for both her and Jackson. Hazel gets builders to convert the ground floor into living quarters suitable for Jackson. Hazel becomes Jackson's full-time carer, but after Jackson persuades her she hires a full-time carer, Joe Chappell (Scott Taylor). Hazel confronts Aaron and tells him to listen to what Jackson has to say. Hazel is unhappy when Jackson ends his relationship with Aaron and lets him go and enjoy life. Hazel clashes with Aaron's mother Chas Dingle (Lucy Pargeter) about his behaviour telling her to tell Aaron to not hurt Jackson anymore.", "Mia Macey, played by Sapphire Elia, made her first on screen appearance on 29 November 2010. Mia is the daughter of Ella Hart (Corrinne Wicks) and established character Jai Sharma (Chris Bisson). Mia does not know Jai is her father and believes Declan Macey (Jason Merrells) is her father instead.", "Dermot Macey arrives in Emmerdale to spend Christmas with his family and to make amends with his son Declan Macey (Jason Merrells), but when Declan sees him in the bus shelter, he insists it would be better if he leaves and gives him money to make him leave, but when Declan returns to Home Farm, Dermot was sitting with Declan's wife Ella and daughter Mia Macey."]}, {"page": "Jackson Walsh", "response": ["Jackson meets Aaron in a gay bar in Hotten. After Aaron leaves, Jackson finds his mobile phone and he comes to Emmerdale to return it. He speaks to Paddy Kirk (Dominic Brunt) and gives Aaron his number. Aaron sees Jackson again and they agree to meet for a drink, but Aaron stands him up. Jackson tries to encourage Aaron to come out and they go on a date and share their first kiss. Whilst in The Woolpack, Aaron believes Jackson is going to out him and he punches him. Aaron is arrested and Jackson presses charges. Adam Barton (Adam Thomas) tells Jackson that Aaron attempted suicide and Jackson goes to his court case. Aaron then admits that he is gay. Jackson makes it clear that he is not interested in Aaron anymore and he gets a building job with Declan Macey (Jason Merrells). Jackson witnesses Aaron being threatened by Wayne Dobson (Gary Hanks) and he sticks up for Aaron. After talking things through, Aaron and Jackson begin a relationship."]}]}}