{"wiki_id": "http://www.wikidata.org/entity/Q5928688", "itemLabel": "Hudson Gurney", "itemDescription": "British antiquarian", "wikipedia_url": "https://en.wikipedia.org/wiki/Hudson_Gurney", "wikipedia_page": {"main": "Hudson Gurney (19 January 1775 – 9 November 1864) was an English antiquary and verse-writer, also known as a politician. He was a member of the Gurney family.", "link_mentions": [{"page": "1775", "response": ["** Hudson Gurney, English antiquary and verse-writer (d. 1864)"]}, {"page": "Thomas Young (scientist)", "response": ["Young died in his 56th year in London on 10 May 1829, having suffered recurrent attacks of \"asthma\". His autopsy revealed atherosclerosis of the aorta. His body was buried in the graveyard of St. Giles Church at Farnborough, in the county of Kent. Westminster Abbey houses a white marble tablet in memory of Young,'The Abbey Scientists' Hall, A.R. p58: London; Roger & Robert Nicholson; 1966 bearing an epitaph by Hudson Gurney:", "Hudson Gurney informed that before his marriage, Young had to join the Church of England, and was baptized later. After his work on physics received some criticism from Henry Brougham, Young stated: \"I have resolved to confine my studies and my pen to medical subjects only. For the talents which God has not given me, I am not responsible, but those which I possess, I have hitherto cultivated and employed as diligently as my opportunities have allowed me to do ; and I shall continue to apply them with assiduity, and in tranquillity, to that profession which has constantly been the ultimate object of all my labours.Wood, Alexander. 2011. Thomas Young: Natural Philosopher 1773–1829. Cambridge University Press. p. 173"]}, {"page": "Elizabeth Fry", "response": ["She returned the following day with food and clothes for some prisoners. She was unable to personally further her work for nearly four years because of difficulties within the Fry family, including financial difficulties in the Fry bank. During the 1812 financial panic in the City of London, William Fry had lent a large amount of the bank's money to his wife's family, undermining its solvency. Elizabeth's brother John Gurney, brother-in-law Samuel Hoare III and cousin Hudson Gurney made a large investment in the W.S. Fry & Sons bank to stabilize things.Hudson Gurney: ODNB article Peter Osborne, 'Gurney, Hudson (1775–1864)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 "]}, {"page": "Samuel Woodward", "response": ["He was for the most part self-educated. Apprenticed in 1804 to a manufacturer of camlets and bombazines, a taste for serious study was stimulated by his master, Alderman John Herring and by Joseph John Gurney. Becoming interested in geology and archaeology, he began to form the collection which after his death was purchased for the Norwich museum. In 1820 he obtained a clerkship in Gurney's (afterwards Barclay's) bank at Norwich, and Hudson Gurney and Dawson Turner (of Yarmouth), both fellows of the Royal Society, encouraged his scientific work."]}, {"page": "Newtown (UK Parliament constituency)", "response": ["|rowspan=\"5\"| Hudson Gurney"]}, {"page": "34 Montagu Square, Marylebone", "response": ["Richard-Hanbury Gurney, a banker and M.P. for Norwich, lived at No. 34 in 1830. He was the father of Hudson Gurney, who became an M.P. for Newtown, Isle of Wight in 1816. In the book, A local index to the list of proprietors of East India stock, John White was cited as living there in 1848, and according to the Royal Pharmaceutical Society's journals, one Thomas Hopkins, a pharmacist, was living in the house in 1849. Aged 86, Lady Emily Charlotte Browne died at the address on 14 March 1916. She was the 5th daughter of Peter Howe, the Marquess of Sligo, and of royal blood.  The English model and actress, Chrissie Shrimpton (Mick Jagger's girlfriend from 1963 to 1966), lived close to No. 34 in the 1960s."]}, {"page": "Gurney (surname)", "response": ["**Hudson Gurney (1775–1864), English antiquary, verse-writer, and politician"]}, {"page": "Shaftesbury (UK Parliament constituency)", "response": ["| Hudson Gurney"]}, {"page": "Anna Gurney", "response": ["Anna Gurney was born on 31 December 1795, the youngest child of Richard Gurney and his second wife Rachel. The Gurney family and most of their connections were Quakers (members of the Society of Friends), and many were involved with banking.  Richard had married his first wife Agatha, only surviving child of the banker David Barclay of Youngsbury, who brought his daughters up in \"what may be termed the best aristocratic Quaker life of the middle of the eighteenth century\". Anna's eldest half-sibling was Hudson Gurney, twenty years her senior; as adults, they shared scholarly interests. Agatha bore another child, a daughter named after her, and died a few days later. It was felt by the Barclay grandparents that Richard was too much a typical country squire and too little a serious religious man, so they asked a sixteen-year-old niece to live with the widower and \"instil some sterner Quaker spirit\" into the children. Rachel was the second daughter of Osgood Hanbury of Holfield Grange, near Coggeshall, Essex. Within a year, Richard and Rachel married.", "In her later life she studied Danish, Swedish, and Russian literature. She also owned at least one Old Norse-Icelandic manuscript, an eighteenth-century copy of Víglundar saga, now in the University of Wisconsin-Madison Libraries Special Collections. After a short illness she died at the residence of her brother, Hudson Gurney, at Keswick, near Norwich, on 6 June 1857, and was buried alongside Sarah-Maria BuxtonThe Friend, by Alan Bray, University of Chicago Press, Dec 31, 2006 in Overstrand Church.", "Anna's half-brother Hudson Gurney was an MP for much of 1812–1832, active in abolitionism, and, once out of Parliament, was appointed High Sheriff of Norfolk. He was elected fellow of the Society of Antiquaries on 12 March 1818, and was vice-president from 1822 to 1846. He contributed to the society many hundreds of pounds for the publication of Anglo-Saxon works. He was also a Fellow of the Royal Society (elected 15 January 1818), a member of the British Archæological Association from 1843, vice-president of the Norfolk and Norwich Archæological Society and a supporter of the Norwich Museum and Literary Institute."]}, {"page": "Joseph Fry (tea merchant)", "response": ["During the 1812 financial panic in the City of London, William Fry precipitated a crisis, by lending a large amount of the bank's money to his wife's family, undermining its solvency. It was Joseph's wife, with her Gurney financial grasp and her connections, who pulled things through; her brother John Gurney (1781–1814), brother-in-law Samuel Hoare III (1783–1847) and cousin Hudson Gurney (1775- 1864)Hudson Gurney: ODNB article Peter Osborne, ‘Gurney, Hudson (1775–1864)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 13 Aug 2008 came to inspect the firm's accounts and left her in no doubt that they would do \"what is needful for us\"Milligan quotes, citing Rose, p.67 which, meant a large investment in the W.S. Fry & Sons bank."]}, {"page": "List of fellows of the Royal Society G, H, I", "response": ["| Hudson Gurney||15/01/1818 || 19 January 1775 - 9 November 1864"]}, {"page": "Bernard Bolingbroke Woodward", "response": ["The eldest son of Samuel Woodward the geologist, he was born at Norwich on 2 May 1816; Samuel Pickworth Woodward was his younger brother. He was sent in March 1822 to the Grey Friars Priory, a private school kept by William Brooke, to whom on 29 September 1828 he was apprenticed for four years. On the expiration of this apprenticeship he worked for a time under his father's supervision, copying armorial bearings and other heraldic devices for Hudson Gurney. He also studied botany, and kept notes, some of which were used by Hewett Cottrell Watson."]}, {"page": "John Hodgkin (tutor)", "response": ["He was born at Shipston-on-Stour, and was educated partly at a Quaker school at Worcester, and partly by his uncle, Thomas Hodgkin, a successful private tutor in London, who invited his nephew to follow his profession. Thomas Hodgkin accepted an offer from David Barclay of Youngsbury to become headmaster of Ackworth School in Yorkshire; and at age 15 John Hodgkin went there as assistant for a year. In 1787 he joined Thomas Young in superintending the education of Hudson Gurney, Barclay's grandson; the two were resident tutors, at Youngsbury and elsewhere.Kass, Amalie M. and Kass, Edward H. (1988) Perfecting the World: The life and times of Dr. Thomas Hodgkin, 1798–1866. Harcourt. . pp. xxii–xxiii. In combination they forming a successful study group and friendship. The two tutors seem to have given each other mutual instruction for four years, and tutors and pupil remained warm friends through life."]}, {"page": "David Barclay of Youngsbury", "response": ["*To Martha Hudson; their daughter Agatha married Richard Gurney and was mother of Hudson Gurney, and Agatha who married Sampson Hanbury.", "Barclay supported the education of his grandson Hudson Gurney, which took place with his companion the polymath Thomas Young (two years older) at Youngsbury, from 1787 to 1792. Young also stayed at Barclay's London house, where he had access to the lectures of Bryan Higgins."]}, {"page": "Gurney family (Norwich)", "response": ["Richard married a daughter of David Barclay, another Quaker merchant and banker. Their six children included Anna Gurney, an Old English scholar, and Hudson Gurney (1775–1864), who later inherited wealth from his father and acted as the head of the Norwich Gurney family. He became MP for Newtown, Isle of Wight in 1816, a Fellow of the Royal Society in 1818 and High Sheriff of Norfolk in 1835. He resided in Keswick Hall near Norwich and in St James's Square, London, but remained childless, so that his fortune was inherited mainly by John Henry Gurney Sr. (1819–1890).", "Gurney's Bank in Norwich was at that time in the hands of Samuel Gurney's brother Daniel Gurney (1791–1880) and Joseph John Gurney's son John Henry Gurney Sr. (1819–1890). The latter had inherited Hudson Gurney's fortune in 1864. He later made a home at Northrepps, near Cromer, where he pursued ornithology. His son, John Henry Gurney Jr., also an ornithologist, and his great-great-grandson, Henry Richard Gurney of Heggatt Hall, continued that family tradition. Besides managing his banking business, Daniel Gurney served as High Sheriff of Norfolk in 1853 and took an interest in archaeology and genealogy. In 1848 he printed in two volumes for private circulation an elaborate The Record of the House of Gournay, adding a supplement in 1858. Daniel Gurney was married to a daughter of William Hay, 17th Earl of Erroll and lived near North Runcton, Norfolk. Their son Charles Henry Gurney (1833–1899) graduated from Trinity College, Cambridge and married a daughter of Henry Thoby Prinsep. Later he became a partner in Saunderson's Bank, London. The Gurneys remained active in banking until 1896, when eleven private banks controlled by Quaker families joined together under the name Barclays to meet competition from the joint-stock banks. The largest components of the newly formed conglomerate were Barclay Bevan Ransom Tritton Bouverie & Co, of Lombard Street in the City of London, Backhouse's Bank and Gurney's Bank.", "*****Hudson Gurney (1775–1864) m. 1809 Margaret Barclay-Allardice (d. 1855)"]}, {"page": "John Wright (bookseller died 1844)", "response": ["When Wright's connection with the 'Parliamentary Debates' ceased in 1830, he undertook a Biographical Memoir of William Huskisson,John Wright, A Biographical Memoir of the Right Honourable William Huskisson (1831), Publisher J. S. Cox. a work of considerable merit. He was next employed by the publishers John Murray (1778–1843) and Richard Bentley (1794–1871) in literary work. In 1831 Murray published an edition of Boswell's Life of Johnson, founded on that of John Wilson Croker. The ninth and tenth volumes, consisting of a supplementary collection of contemporary anecdotes concerning Johnson under the title Johnsoniana, were edited by Wright. They appeared in a separate edition in 1836 (London, 8vo). Between 1832 and 1835 he was engaged on the Life and Work of Lord Byron, published by Murray, and in 1835 on the collective edition of Crabbe's Works. Between 1838 and 1840 he assisted William Stanhope Taylor and Captain John Henry Pringle in editing the Correspondence of William Pitt, Earl of Chatham (London, 4 vols. 8vo). He was editor of the first collective edition of Horace Walpole's Letters, which appeared in 1840 (London, 6 vols. 8vo). A revised edition was published in 1844 and a third in 1846. An American edition appeared in Philadelphia in 1842. At the time of his death Wright was engaged in his most important work, the publication of Sir Henry Cavendish's Debates of the House of Commons during the Thirteenth Parliament of Great Britain, commonly called the Unreported Parliament [see Cavendish, Sir Henry]. The original notes, written in shorthand, are contained in forty-eight volumes in the Egerton manuscripts at the British Museum. Wright deciphered and transcribed the manuscript as far as 27 March 1771, and supplemented the text with \"illustrations of the parliamentary history of the reign of George III\", drawn from unpublished letters, private journals, and memoirs. In 1839 he published a preliminary volume, containing the \"Debate of the House of Commons on the Bill for the Government of Quebec\" (London, 8vo), a subject at that time of considerable interest. The work was approved by Lord Brougham, who, together with Hudson Gurney, assisted Wright financially. Seven parts appeared between 1841 and 1843, which, when bound, formed two volumes (London, 8vo).He died in London on 25 February 1844 at his residence, 26 Osnaburgh Street, Regent's Park, and was buried at the Marylebone parish church."]}, {"page": "List of United Kingdom by-elections (1806–1818)", "response": ["|3 June 1816||Newtown||u*||Barrington Pope Blachford||Hudson Gurney||Death"]}, {"page": "List of MPs elected in the 1830 United Kingdom general election", "response": ["|rowspan = \"2\"|Newtown (IoW)(two members)||Hudson Gurney|| Whig"]}, {"page": "List of MPs elected in the 1831 United Kingdom general election", "response": ["|rowspan = \"2\"|Newtown (IoW)(two members)||Hudson Gurney|| Whig"]}, {"page": "List of MPs elected in the 1826 United Kingdom general election", "response": ["|rowspan = \"2\"|Newtown (IoW)(two members)||Hudson Gurney|| Whig"]}, {"page": "List of MPs elected in the 1820 United Kingdom general election", "response": ["|rowspan=\"2\"|Newtown(two members)||Hudson Gurney||Whig"]}, {"page": "List of MPs elected in the 1812 United Kingdom general election", "response": ["| Barrington Pope Blachford – died Replaced by Hudson Gurney 1816", "| Hudson Gurney – unseated on petition Replaced by  Edward Kerrison 1813"]}, {"page": "List of MPs elected in the 1818 United Kingdom general election", "response": ["| Hudson Gurney"]}]}}