{"wiki_id": "http://www.wikidata.org/entity/Q5920208", "itemLabel": "Howard Lew Lewis", "itemDescription": "British comedian and actor (1941-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/Howard_Lew_Lewis", "wikipedia_page": {"main": "Howard Lew Lewis (21 August 1941 – 20 January 2018) was an English comedian and actor, best known for his roles in comedy series including Maid Marian and Her Merry Men, Brush Strokes and Chelmsford 123.", "link_mentions": [{"page": "Obelix", "response": ["Gérard Depardieu portrays Obelix in all four live-action French films based on various comics. For the animated films, he has been voiced by Jacques Morel (the first three films), Pierre Tornade (all films during the 80s and 90s), Jacques Frantz (Asterix and the Vikings), and Guillaume Briat (Mansions of the Gods onwards). In the English dubs of the animated films, he has been voiced by Hal Brav, Michael Kilgarriff, Billy Kearns, Bernard Bresslaw, Rosey Grier, Howard Lew Lewis, Brad Garrett, C. Ernst Harth, and, most recently, Nick Frost."]}, {"page": "Maid Marian and Her Merry Men", "response": ["The programme was much appreciated by children and adults alike, and has been likened to Blackadder, not only for its historical setting and the presence of Tony Robinson (as well as early, uncredited, script editing work being undertaken by Richard Curtis), but also for its comic style. It is more surreal than Blackadder, however, and drops even more (deliberate) anachronisms. Many of the show's cast such as Howard Lew Lewis, Forbes Collins, Ramsay Gilderdale and Patsy Byrne had previously appeared in various episodes of Blackadder alongside Robinson. Like many British children's programmes, there is a lot of social commentary sneakily inserted, as well as witty asides about the Royal family, buses running on time, etc. Many of the plots spoofed or referenced film and television shows including other incarnations of Robin Hood in those media.", "Many of the plots featured, included or revolved around spoofing particular things, including films such as Jurassic Park and It Came From Outer Space, and television programmes, including The Crystal Maze and the long-running televised fundraisers Children in Need and Comic Relief. There were also frequent references to other Robin Hood incarnations, most notably ITV's Robin of Sherwood (and in particular that series' theme song by Clannad, \"Robin (The Hooded Man)\" is lampooned in the episode \"The Whitish Knight\") and the contemporary film adaptation Robin Hood: Prince of Thieves. The latter actually features Howard Lew Lewis (Rabies) among its cast - hence his doubly witty line in the episode \"They Came from Outer Space,\" which episode also passingly satirises the film for casting the lead with an American accent (Kevin Costner).", "* Rabies (Howard Lew Lewis): another Merry Man, very strong, and very stupid, although with his heart in the right place."]}, {"page": "1985 in film", "response": ["| Brazil || 20th Century Fox (International) / Universal Pictures (United States) || Terry Gilliam (director/screenplay); Tom Stoppard, Charles McKeown (screenplay); Jonathan Pryce, Robert De Niro, Katherine Helmond, Ian Holm, Bob Hoskins, Michael Palin, Ian Richardson, Peter Vaughan, Kim Greist, Jim Broadbent, Brian Miller, Sheila Reid, Simon Nash, Barbara Hicks, Kathryn Pogson, Bryan Pringle, Derrick O'Connor, Elizabeth Spender, Derek Deadman, Nigel Planer, Charles McKeown, Ray Cooper, Gorden Kaye, John Pierce Jones, Ann Way, Myrtle Devenish, Simon Jones, Bill Wallis, Don Henderson, Howard Lew Lewis, Oscar Quitak, Harold Innocent, John Grillo, Patrick Connor, Roger Ashton-Griffiths, Jack Purvis, Andre Gregory, Terry Gilliam, Sue Hodge || Sci-Fi || Live action"]}, {"page": "Chelmsford 123", "response": ["* Howard Lew Lewis as Blag"]}, {"page": "Phil Cool", "response": ["In 1989 he appeared in the mini-film Night of the Comic Dead alongside Frank Carson, Karl Howman and Howard Lew Lewis as part of A Night of Comic Relief 2. His third video, Cool 'N' Hot, was filmed live at the Royal Leamington Spa Centre in 1989. In 1991 he moved to ITV and made a series called Cool Head (Central Television)."]}, {"page": "List of Blackadder characters", "response": ["*Thomas Applebottom (Howard Lew Lewis) – Tally Applebottom's husband. He wasn't terribly happy that Prince Edmund was attempting to marry his wife. He also appears in the prologue of \"Witchsmeller Pursuivant\" in which he dies of the Black Death. (\"The Queen of Spain's Beard\", \"Witchsmeller Pursuivant\")"]}, {"page": "Asterix and the Great Crossing", "response": ["*The 1994 animated film Asterix Conquers America, starring Craig Charles as the voice of Asterix and Howard Lew Lewis as the voice of Obelix, is based on this book. The most noticeable differences between the book and the film is that in the film, Getafix accompanies Asterix to America – albeit because he had been abducted by Romans seeking to get rid of him by throwing him off the edge of the world – and that the Vikings do not appear in the film."]}, {"page": "Brush Strokes", "response": ["The show is remembered by many for the slow-off-the-mark pub landlord, Elmo Putney (Howard Lew Lewis) who ran the pub where Jacko and friends took their lunch breaks. Elmo's catch phrase instead of swearing was 'Chisel'."]}, {"page": "Lewis (surname)", "response": ["*Howard Lew Lewis (1941–2018), English actor and comedian"]}, {"page": "1941 in the United Kingdom", "response": ["* 21 August – Howard Lew Lewis, English comedian, actor (died 2018)"]}, {"page": "The Queen of Spain's Beard", "response": ["* Howard Lew Lewis as Mr. Applebottom"]}, {"page": "Witchsmeller Pursuivant", "response": ["* Howard Lew Lewis as Piers, A Yeoman"]}, {"page": "Asterix Conquers America", "response": ["|Howard Lew Lewis"]}, {"page": "Erika Hoffman", "response": ["Erika Hoffman (born c. 1965) is an English actress who speaks German, French and English. She appeared as Lesley Bainbridge in the BBC comedy Brush Strokes from series 3 onwards, when she took over the role from Kim Thomson. When the Brush Strokes series ended, she joined fellow cast member Howard Lew Lewis in the Channel 4 comedy series Chelmsford 123 (series 1) where she played Gargamadua (the name translated, we were told, as \"Snot Bucket\"). She also appeared in the Minder episode, Second Time Around."]}, {"page": "David Lloyd (actor)", "response": ["Lloyd (and Billingham)'s work on Maid Marian with Tony Robinson gave them a grounding in comedy scriptwriting, and spurred them to write more.  Between 1993 and 1996, the two collaborated on the writing of another children's comedy programme: Harry's Mad, based on the novel by British children's author Dick King-Smith. The programme featured an intelligent talking parrot (\"Madison\"), inherited by his owner, Harry, upon the death of his uncle. The parrot's abilities were only known by a select few, but would be heard at inopportune moments, causing considerable trouble for Harry.Memorable TV: Harry's Mad. Accessed 9 February 2008Harry's Mad at Answers.com. Accessed 9 February 2008 The show ran for four series, and also featured Lloyd, Billingham and Maid Marian co-star Howard Lew Lewis in various small roles."]}, {"page": "2018 in British television", "response": ["|Howard Lew Lewis"]}, {"page": "Deaths in January 2018", "response": ["*Howard Lew Lewis, 76, English comedian and actor (Brush Strokes, Maid Marian and Her Merry Men, Chelmsford 123).Maid Marian actor Howard Lew Lewis dies at 76"]}, {"page": "Howard Lewis", "response": ["* Howard Lew Lewis (1941–2018), English comedian and actor"]}]}}