{"wiki_id": "http://www.wikidata.org/entity/Q5920696", "itemLabel": "Howard Radford", "itemDescription": "Welsh footballer (born 1930)", "wikipedia_url": "https://en.wikipedia.org/wiki/Howard_Radford", "wikipedia_page": {"main": "William Howard Radford (8 September 1930 – 21 January 2022) was a Welsh professional footballer who played as a goalkeeper in The Football League for Bristol Rovers for eleven years between 1951 and 1962.\nRadford, who was born in Abercynon, began his playing career in the nearby village of Penrhiwceiber. He was invited for a trial by Bristol Rovers in May 1951, and three months later he joined them on professional terms. He went on to make 244 League appearances for them before retiring from football in 1962, including being part of their Third Division title-winning team in the 1952–53 season.Following his retirement he managed a number of public houses, firstly the Checkers in Old Market, then the Ring o' Bells in Coalpit Heath and the Bishop Lacey Inn in Chudleigh. Later on he worked as a steward in Chudleigh Conservative Club and as a security guard with British Aerospace.Radford suffered a major stroke in October 2021 and was discharged from hospital in December of the same year. On 22 January 2022, Bristol Rovers reported that Radford had died the previous day, at the age of 91. At the time of his death Radford was the second oldest surviving player to have played for the club.", "link_mentions": [{"page": "Abercynon", "response": ["* Howard Radford, a former goalkeeper for Bristol Rovers was born in Abercynon."]}, {"page": "Henfield, Gloucestershire", "response": ["* Howard Radford - the former Bristol Rovers goalkeeper played occasional matches for Henfield as an outfield player and scored a hat-trick in an evening Berkeley Hospital Cup match."]}, {"page": "Radford (surname)", "response": ["*Howard Radford (born 1930), Welsh footballer"]}, {"page": "Sid Bishop (footballer, born 1934)", "response": ["During Orient's only season in the top flight, Bishop played 39 matches, and scored the winning goal in a 2–1 win over Liverpool on 2 May 1963, his last goal for the club. His other three goals had come during the 1960–61 season, including a 40-yard drive past Howard Radford in a 3–2 win at home to Bristol Rovers on 4 February 1961. He was released in May 1965 by Orient's new manager Dave Sexton, having made 323 senior appearances, making him one of only twelve Orient players to have played more than 300 matches for the club."]}, {"page": "2021–22 in English football", "response": ["* 21 January 2022: Howard Radford, 91, Bristol Rovers goalkeeper. "]}, {"page": "William Howard Radford", "response": ["#REDIRECT Howard Radford"]}, {"page": "William Radford (disambiguation)", "response": ["*William Howard Radford (born 1930), Welsh former footballer "]}, {"page": "Deaths in 2022", "response": ["*Howard Radford, 91, Welsh footballer (Bristol Rovers).In Memory of Howard Radford, 1930–2022"]}, {"page": "2022 in Wales", "response": ["*21 January – Howard Radford, footballer, 91"]}]}}