{"wiki_id": "http://www.wikidata.org/entity/Q5931962", "itemLabel": "Hugh Montefiore", "itemDescription": "British bishop (1920-2005)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Montefiore", "wikipedia_page": {"main": "Hugh William Montefiore (born Hugh William Sebag-Montefiore; 12 May 1920 – 13 May 2005) was an English Anglican bishop and academic, who served as Bishop of Kingston from 1970 to 1978 and Bishop of Birmingham from 1978 to 1987.", "link_mentions": [{"page": "Henry Cockburn, Lord Cockburn", "response": ["The authors Alec Waugh and Evelyn Waugh, the journalist Claud Cockburn, Claudia Cockburn (wife of actor Michael Flanders) and author Sarah Caudwell were all descended from Cockburn, as are journalists Laura Flanders, Stephanie Flanders, Alexander Cockburn (husband of author Emma Tennant), Andrew Cockburn (husband of journalist Leslie Cockburn) and Patrick Cockburn (son-in-law of Bishop Hugh Montefiore) and actress Olivia Wilde (former wife of Tao Ruspoli).Monuments and Statues of Edinburgh, Michael T.R.B. Turnbull (Chambers) p. 54"]}, {"page": "Biblical inerrancy", "response": ["In the introduction to his book Credible Christianity, Anglican Bishop Hugh Montefiore, comments:"]}, {"page": "Patrick Cockburn", "response": ["In 1981, Cockburn married Janet Elisabeth (\"Jan\") Montefiore (14 November 1948), Professor of English Literature at the University of Kent, Canterbury, Kent, daughter of the late Bishop Hugh Montefiore, and has two children, Henry Cockburn (4 January 1982) and Alexander Cockburn (17 April 1987).Charles Mosley, editor, Burke's Peerage, Baronetage & Knightage, 107th edition, 3 volumes (Wilmington, Delaware, U.S.A.: Burke's Peerage (Genealogical Books) Ltd, 2003), volume 1, page 120."]}, {"page": "Robert Runcie", "response": ["Runcie was selected as Archbishop of Canterbury in 1979, as Donald Coggan approached his retirement from the see. There is evidence that Runcie was the second choice of the Crown Appointments Commission, the first choice, Hugh Montefiore, having proven politically unacceptable to the then newly elected Conservative government. He was installed as archbishop on 25 March 1980."]}, {"page": "Church of St Mary the Great, Cambridge", "response": ["* Hugh Montefiore (1963-1970); afterwards Bishop of Kingston, then of Birmingham"]}, {"page": "List of British Jews", "response": ["* Hugh Montefiore,His own book On Being a Jewish Christian (1998) bishop"]}, {"page": "Deaths in May 2005", "response": ["*Hugh Montefiore, 85, English Bishop of Birmingham and environmental activist with Friends of the Earth."]}, {"page": "Bishop of Birmingham", "response": ["| 60px Hugh Montefiore"]}, {"page": "Montefiore", "response": ["* Hugh Montefiore (1920–2005), bishop of Birmingham 1977–1987 and environmentalist (born Hugh Sebag-Montefiore)"]}, {"page": "Westcott House, Cambridge", "response": ["*Hugh Montefiore, vice-principal; later Bishop of Birmingham"]}, {"page": "Mervyn Stockwood", "response": ["Stockwood was adept at making unusual and radical, but usually highly successful, appointments. John Robinson was appointed as his suffragan at Woolwich in 1959. Later Stockwood chose David Sheppard as Bishop of Woolwich in 1969 (after John Robinson's return to Cambridge), Hugh Montefiore as Bishop of Kingston in 1970, Michael Marshall to Woolwich in 1975 and Keith Sutton to Kingston in 1978."]}, {"page": "Henry Kitchener, 3rd Earl Kitchener", "response": ["Institute for Food, Brain and Behaviour (formerly Natural Justice) a UK charity conducting scientific research into the effects of nutrition on brain function and behaviour.  Kitchener was associated with the charity for over 20 years serving under two chairmen, the late Bishop Hugh Montefiore and the succeeding chairman, Mrs Frances Jackson.  He took a keen, detailed, interest in IFBB's scientific work, interrogating scientists robustly at Board Meetings on the progress of their research and was a keen and perceptive reader of academic journal articles and papers."]}, {"page": "Anglican Marian theology", "response": ["Anglican theologian Hugh Montefiore, former Bishop of Birmingham, while denying the immaculate conception and the bodily assumption of Mary into heaven, says \"Christians rightly honour and venerate her as one of the great saints of God. God had signally honoured her by choosing her to be the mother of Jesus.\"Montefiore, Hugh (1993). Credible Christianity: The Gospel in Contemporary Society. p. 94. "]}, {"page": "Denis Alexander", "response": ["Alexander has written on the subject of science and religion since at least 1972, when his book 'Beyond Science', written at the age of 25/26, was reviewed by Hugh Montefiore, then Bishop of Kingston upon Thames in the New Scientist."]}, {"page": "Baptismal regeneration", "response": ["In the 20th century, Anglo-Catholic theologian E.L. Mascall expressed the view that \"[T]he entry upon the supernatural realm which is bestowed by incorporation into Christ and which is fittingly described as a new birth is also a deliverance from the realm of fallen human nature - the sphere in which man lies under the curse of original sin - and an insertion into the realm of the perfect manhood of Christ. Mascall explains that \"The grace of incorporation into Christ, the normal channel of which is baptism, is a supernatural fact in the ontological order which does not of itself immediately produce physical and moral effects; but it does produce such effects mediately and progressively when, and to the degree in which, the soul co-operates with this grace and surrenders itself to its influence.\" The work of the Holy Spirit in Baptism has been emphasized by several theologians. Richard A. Norris has said that \"Forgiveness of sins and incorporation into Christ ... are only made possible for people by the action of the Holy Spirit. It is the Spirit who ... is God working within people to connect them with Christ and thus to set them in their proper relation with the Father. Baptism, consequently, has always been understood as a sacrament which signifies the gift of the Holy Spirit. Geoffrey W. Bromiley, an evangelical Anglican theologian, has written, \"Baptism as identification with Christ is the sacrament of the regenerative work of the Holy Spirit, not of my consciousness and confession of faith. It is the sign of faith only as this is itself the work of the primary and sovereign divine operation.\" And Anglican theologian and bishop Hugh Montefiore says that \"Baptism is efficacious if it is asked for in faith, in the sense that it enacts sacramentally what has been begun spiritually, and the very fact that it is an outward and visible sign both strengthens the faith of the baptized and is a public witness to that faith.\""]}, {"page": "List of Old Rugbeians", "response": ["* Hugh Montefiore, Bishop of Kingston 1970–1978 and Bishop of Birmingham 1977–1987"]}, {"page": "Bishop of Kingston", "response": ["|align=\"center\"| 1970 ||align=\"center\"| 1978 || Hugh Montefiore || Translated to Birmingham "]}, {"page": "List of University of Oxford people in religion", "response": ["| Hugh Montefiore "]}, {"page": "Noel Hudson", "response": ["At the end of the war, Hudson went to Westcott House, Cambridge, then to Leeds Clergy School, and in 1921 began his ordained ministry in the parish of Christ Church, Leeds. In 1922 he became vicar of the same parish. After four years in Leeds he was appointed to St John the Baptist's Newcastle upon Tyne. There he distinguished himself in setting a pattern of one paramount, uniting Parish Eucharist for the whole family every Sunday morning instead of five separate services and in social work including converting decaying flats into decent accommodation with modest rents for poor families.Bishop Henry de Candole 1895-1971 by Peter Jagger, Faith Press, 1975, contains many references to Hudson, particularly of his time in Newcastle In 1931, at the age of 39, he became Bishop of Labuan and Sarawak for seven years. The diocese covered an area as large as the UK, but travelling was tortuous, by launch, canoe and on foot along jungle paths in tropical heat. Hudson's main task was to unite the work of the Mission Stations in the diocese at which he had some successNoel Baring Hudson. A Memoir by Malcolm Nicholson, Northern Press, 1970. Accessed at West Sussex Record Office In 1938 he was recalled to become secretary of the Society for the Propagation of the Gospel in Foreign Parts. Archbishop Lang told Hudson that he regarded this post as Chief of Staff to the Anglian Communion. In 1940, Hudson was sent to the US to receive a donation from the American Episcopal Church which eventually amounted to $300,000 to support overseas dioceses. He had, for a short time during the Great War, Kermit Roosevelt MC as a liaison officer, and the Roosevelt connection facilitated introductions and a lecture tour.op cit Fox. There are notes by one of Hudson's nephew's on the copy in the West Sussex Record Office In 1939 he had become an honorary canon and an assistant bishop in the Diocese of St Albans and was also Select Preacher in Cambridge. On 2 October 1941 he was nominated and on 19 October confirmed as Bishop of Newcastle where he remained for nearly 16 years. He was a greatly-admired Bishop and continued a Newcastle tradition as 'one of the happiest places for a priest to work'.'The Church of England 1900-1965' by Roger Lloyd, SCM Press, 1966. In Hudson's time there as Bishop, young men were attracted to starting careers in the diocese. John Ramsbotham was later Bishop of Wakefield, Hugh Montefiore became Bishop of Birmingham and Robert Runcie was appointed Archbishop of Canterbury in 1979. Hudson 'saw his episcopate primarily in terms of the care and leadership of the clergy. It was the job of the parish priest to care for his own people'op cit Nicholson On 18 January 1957 he became Bishop of Ely until 1963."]}, {"page": "Hugh William Montefiore", "response": ["#REDIRECT Hugh Montefiore"]}, {"page": "Hugh Sebag-Montefiore", "response": ["Montefiore's father, Stephen Eric Sebag-Montefiore, was descended from a line of wealthy Sephardic Jews who were diplomats and bankers all over Europe. At the start of the 19th century, his great-great uncle, Sir Moses Montefiore, became a banking partner of N M Rothschild & Sons. His mother, Phyllis April Jaffé, comes from a Lithuanian Jewish family of poor scholars. Her parents fled the Russian Empire at the turn of the 20th century; they bought tickets for New York City, but were cheated, being instead dropped off at Cork, Ireland. During the Limerick Pogrom of 1904 they left Ireland and moved to Newcastle, England. The father of his namesake, Bishop of Birmingham Hugh Montefiore, was the great-great-nephew of Sir Moses."]}, {"page": "Sea of Faith (TV series)", "response": ["After the showings of the six episodes, the BBC broadcast a discussion of the series and of its reception. As well as featuring Cupitt, the discussion included Alfred Jules Ayer and the then Bishop of Birmingham, Hugh Montefiore. The programme also featured on a BBC television series, Did You See...?, hosted by Ludovic Kennedy, and featuring in that episode Karen Armstrong and Bob Monkhouse."]}]}}