{"wiki_id": "http://www.wikidata.org/entity/Q5930136", "itemLabel": "Hugh Brody", "itemDescription": "British anthropologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Brody", "wikipedia_page": {"main": "Hugh Brody (born 1943) is a British anthropologist, writer, director and lecturer. He was educated at Trinity College, Oxford. He taught social anthropology at Queen's University Belfast. He is an Honorary Associate of the Scott Polar Research Institute at the University of Cambridge, and an Associate of the School for Comparative Literature at the University of Toronto. He is Professor Emeritus at University of the Fraser Valley in Abbotsford, British Columbia where he held a Canada Research Chair from 2005 to 2017.", "link_mentions": [{"page": "Nuu-chah-nulth", "response": ["Perhaps the most famous Nuu-chah-nulth artifact in modern years is the Yuquot Whalers' Shrine, a ritual house-like structure used in the spiritual preparations for whale hunts. Composed of a series of memorial posts depicting spirit figures and the bones of whaling ancestors, it is stored at the American Museum of Natural History in New York City, having been taken there by European Americans. It was the subject of the film The Washing of Tears, directed by Hugh Brody. It recounts the rediscovery of the bones and other artifacts at the museum and the efforts by the Mowachaht First Nation, the shrine's original owners, who have been seeking to regain these sacred artifacts."]}, {"page": "Pond Inlet", "response": ["Inuit youth from Pond Inlet were taken from their families and sent to the Churchill Vocational School in northern Manitoba, which operated from September 9, 1964 to June 30, 1973. The students were housed in hostels that were segregated based on the students' religious affiliation—Roman Catholic or Anglican. According to the final report of the Truth and Reconciliation Commission of Canada (2008 to 2015), organized by the parties of the Indian Residential Schools Settlement Agreement, the Churchill Vocational Centre in northern Manitoba, housed Inuit youth from Mittimatalik and about 16 other remote hamlets—all at that time still part of the Northwest Territories—Nunavut was created in 1999. Some of Churchill Vocational Centre students travelled \"staggering\" distances with some Inuit communities separated by as much as 2,200 kilometres. Over the years, the Churchill Vocational Centre had \"provided academic and vocational training to about 1,000 to 1,200 Inuit youth\". The September 2007 landmark compensation deal, the federal government-approved agreement amounted to nearly $2 billion in compensation to former students who had attended 130 schools. By 2008, different levels of government, including Tunnuniq MLA James Arvaluk and Nunavut Tunngavik Incorporated, worked with some former Churchill residential school students,  as the school records had not been properly maintained, and many former students were not able to receive adequate and fair compensation. While at Churchill, the young Inuit met other young people from different regions and they discussed common problems and considered political change. www.publichistory.ca The new organizations they founded upon returning to the Arctic, included the Inuit Tapirisat of Canada (ITK) in the eastern Arctic in 1971. It was the ITK that initiated the 1973 Inuit Land Use and Occupancy Project (ILUOP). The ILUOP \"presented a detailed, comprehensive, and verifiable basis for the claim that Inuit used and occupied an area in excess of 2.8 million square kilometres at the time the ILUOP was completed in the Northwest Territories and northeast Yukon\". Hugh Brody (1943-), who was an anthropologist, associated with the University of Cambridge's Scott Polar Research Institute and a Canada Research Chair at the University of the Fraser Valley in British Columbia. did extensive field work in Pond Inlet in the 1970s, as a research officer with the Northern Science Research Group.The peoples' champion, The Guardian, profile, 27 January 2001. In 1976–78 he co-ordinated the land use mapping in the North Baffin region for the Inuit Land Use and Occupancy Project and assembled accounts of Inuit perceptions of land occupancy across the Arctic which were included in the Project's final publications.See the three volume, Report of the Inuit Land Use and Occupancy Project, ed Milton Freeman, Ottawa: DIAND, 1976", "The Inuit Tapirisat of Canada (ITK) initiated the 1973 Inuit Land Use and Occupancy Project (ILUOP). The ILUOP \"presented a detailed, comprehensive, and verifiable basis for the claim that Inuit used and occupied an area in excess of 2.8 million square kilometres at the time the ILUOP was completed in the Northwest Territories and northeast Yukon\". Hugh Brody (1943-), who was an anthropologist, associated with the University of CambridgeScott Polar Research Institute and a Canada Research Chair at the University of the Fraser Valley in British Columbia. did extensive field work in Pond Inlet in the 1970s, as a research officer with the Northern Science Research Group.The peoples' champion, The Guardian, profile, 27 January 2001. In 1976–78 he co-ordinating the land use mapping in the North Baffin region for the Inuit Land Use and Occupancy Project and assembled accounts of Inuit perceptions of land occupancy across the Arctic which were included in the Project's final publications.", "In 1970, the federal government began the six-year long planning process for the Strathcona Sound mining project on the northern tip of Baffin Island. This resulted in the opening of the Panarctic's Nanisivik coal mine which operated from 1976 until 2002. Researchers investigated the 1970-1976 planning process behind the Strathcona Sound mining project on the northern tip of Baffin Island. Panarctic's Nanisivik mine operated from 1976 until 2002. The 2013 article said that the federal government and the Inuit themselves had different ideas of \"what was good for them\". To the federal government, Inuit were perceived as \"labour in need of employment\" and Inuit resisted this definition. A September 1974 editorial in the Pond Inlet community newsletter, questioned \"Why has so little been told to the people of Pond Inlet concerning a mine that might affect their lives for the next thirteen years? Why have we not been informed of both sides of the picture?\" The people of the other north Baffin Island communities affected by the Strathcona Sound mining project had been almost entirely excluded from discussions about the project. When Department of Indian and Northern Affairs representatives arrived on a January/February tour to \"collect labour availability data\" they had shared very little about the project with local communities. In 1974, Pond Inlet hamlet had \"refused to deal with the DIAND representatives because of the inadequacy of the information provided.\" In his 1973 Arctic Institute of North America article, Eric Gourdeau, discussed the social impact that Panarctic's wages had on Pond Inlet and Arctic Bay—Panarctic wages had \"more than doubled the cash income gained by the regular wage workers in each community.\" Gibson noted that Gourdeau's report has been severely criticized by Hugh Brody, who was strongly against \"recent trends\" that push \"native people increasingly towards the lowest and least certain rung on the national class ladder\" by separating him \"from his own means of production\", leaving him \"unable to have a sure relationship to the intruders' means of production.\" Brody was concerned that Inuit people would become migrant workers or casual labourers. He said that the \"problem will not be cleared away by promises of high pay at the golden frontier: short term booms that are so characteristic of frontier development only worsen the problems that will follow.\" Gourdeau was \"generally favourable to the rotation option for native employment in Arctic resource extraction\"."]}, {"page": "Hilary Weston Writers' Trust Prize for Nonfiction", "response": ["* Hugh Brody, The Other Side of Eden: Hunters, Farmers and the Shaping of the World"]}, {"page": "University of the Fraser Valley", "response": ["* Hugh Brody - Canada Research Chair in Aboriginal Studies"]}, {"page": "Juliet Stevenson", "response": ["Stevenson has lived with her partner, British anthropologist Hugh Brody, since 1993. The couple live in Highgate, North London. They have two children, both born in Camden, London: Rosalind Hannah Brody (born 1994) and Gabriel Jonathan Brody (born late 2000/early 2001)."]}, {"page": "Nunavut Tunngavik Incorporated", "response": ["By the late 1960s, young Inuit men and women were graduating from high schools and vocational training in Churchill, Manitoba, Whitehorse, Yukon, and Ottawa where they had opportunities to meet with other young people from different regions to discuss common problems and consider political change. www.publichistory.ca As a result these young graduates founded two organizations in 1970. The Committee for Original Peoples’ Entitlement (COPE) was established in the western Arctic in response to exploratory oil seismic work on Banks Island in October, 1970 that threatened the subsistence of local trappers. In the eastern Arctic, the Inuit Tapirisat of Canada (ITK) was founded in 1971. In 1973, the ITK initiated the Inuit Land Use and Occupancy Project which used land use mapping or counter-mapping methodologies, resulting in a three volume publication, based on research by a team of experts working closely with Inuit across Canada. According to Milton Freeman who oversaw the project, it \"documented the total Inuit land use area of the Northwest Territories, then stretching from the Mackenzie River to east Baffin Island,\" to provide \"information in support of the fact that Inuit have used and occupied this vast northern land since time immemorial and that they still use and occupy it to this day.\" Hugh Brody worked on the project from 1976–78 as coordinator in the North Baffin region. He also assembled an Arctic-wide account of Inuit perceptions of land occupancy, building a collage of Inuit voices from all the communities of the Northwest Territories."]}, {"page": "Dora (case study)", "response": ["* Nineteen Nineteen, director Hugh Brody, 1985.  Dramatic fiction about a reunion of two patients of Freud, largely based on the Dora and Wolf-Man cases."]}, {"page": "Hubert Evans Non-Fiction Prize", "response": ["*Hugh Brody – The Other Side of Eden"]}, {"page": "Michael Ignatieff", "response": ["* 1919, 1985 (with Hugh Brody)"]}, {"page": "List of British films of 1985", "response": ["|1919||Hugh Brody ||Paul Scofield || ||Entered into the 35th Berlin International Film Festival"]}, {"page": "35th Berlin International Film Festival", "response": ["|Hugh Brody"]}, {"page": "1919 (film)", "response": ["1919 is a 1985 British drama film directed by Hugh Brody and written by Michael Ignatieff together with Brody. It stars Paul Scofield. It was entered into the 35th Berlin International Film Festival.  The film's title is often stylized numerically as 1919 while the film itself bears the title Nineteen Nineteen.  ", "Category:Films directed by Hugh Brody"]}, {"page": "Eaton's BC Book Award", "response": ["* Hugh Brody, Maps and Dreams (Douglas & McIntyre, 1981)"]}, {"page": "Yuquot Whalers' Shrine", "response": ["The repatriation of the Shrine and its contents are mired by extenuating and complicating circumstances.  Canada does not presently have legislation in governing repatriation; however, museums act as caretakers on a case-by-case basis.   In the United States, the Native American Graves Protection and Repatriation Act (NAGPRA) requires Native American cultural items to be returned to 'lineal descendents'.  The current discourse of the Shrine is to build a community centre that would house the Shrine, or build a replica of the Shrine. Jonaitas explains, however, that there needs to be a more 'nuanced' view and understanding of how historical events occurring, both before and after the acquisition, has presented challenges as to how to repatriate in light of loss of ceremonial rituals and traditions surrounding the handling of such sacred items. The repatriation of the Whalers' Shrine was the subject of a 1994 documentary entitled 'Washing of Tears' by filmmaker and anthropologist, Hugh Brody."]}, {"page": "List of Colin Firth performances", "response": ["| Hugh Brody"]}, {"page": "BFI Production Board", "response": ["According to the BFI's Screenonline, 1982 saw a major breakthrough when Greenaway's The Draughtsman's Contract became a modest but genuine commercial success. More significantly, it was also the first co-production between the BFI and the newly established Channel 4, which gave the BFI a regular television platform and correspondingly greater exposure for its work. Behind the scenes, C4 also became a significant contributor to Production Board funds in general as well as specific individual works. Other films that benefited from the collaboration included The Gold Diggers (Sally Potter, 1983), Nineteen Nineteen (Hugh Brody, 1985) and Ascendancy (Edward Bennett, 1983), the last of which won the Golden Bear at the Berlin Film Festival. Subsequent international successes for British art house included a Silver Bear at Berlin for Derek Jarman's Caravaggio and the International Film Critics' Prize for Terence Davies' Distant Voices, Still Lives at the Cannes Film Festival. Alan Burton and Steven Chibnall refer to this period as the Board's \"golden age\"."]}, {"page": "James Cullingham", "response": ["In 1989, Cullingham created Tamarack Productions, producing its first project, As Long As The Rivers Flow, in 1991. The television series focuses on Aboriginal rights in Canada, in both modern and historical times, and was broken up into five one-hour episodes - Flooding in Job’s Garden, The Learning Path, Starting Fire with Gunpowder, Tikinagan and Time Immemorial. The series brought together notable directors in this subject area in Canada including Hugh Brody, Gil Cardinal, Boyce Richardson and Loretta Todd. Peter Raymont of White Pine Pictures was series Executive Producer."]}, {"page": "Disappearing World (TV series)", "response": ["| Hugh Brody"]}, {"page": "List of Private Passions episodes (2000–2004)", "response": ["|rowspan=\"9\"|Hugh Brody"]}]}}