{"wiki_id": "http://www.wikidata.org/entity/Q5932983", "itemLabel": "Hugh Wakefield", "itemDescription": "British actor (1888-1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Wakefield", "wikipedia_page": {"main": "Hugh Wakefield (10 November 1888 – 5 December 1971) was an English film actor, who played supporting roles. He was often seen wearing a monocle.Wakefield was born in Wanstead, Essex. He also had a distinguished stage career, which began at the age of 11. City of Song (1931) was his first film. After completing 1954's The Million Pound Note, Wakefield retired from film acting. He died 5 December 1971 in London aged 83.", "link_mentions": [{"page": "The Man Who Knew Too Much (1934 film)", "response": ["* Hugh Wakefield as Clive"]}, {"page": "The Million Pound Note", "response": ["*Hugh Wakefield as Duke of Cromarty"]}, {"page": "Blithe Spirit (1945 film)", "response": ["* Hugh Wakefield as Doctor George Bradman"]}, {"page": "List of American films of 1932", "response": ["|Aren't We All? || Harry Lachman || Gertrude Lawrence, Hugh Wakefield || Comedy || Paramount"]}, {"page": "Philip King (playwright)", "response": ["King made several appearances on the London stage, playing with such well-known stars as Sid Field, Frances Day and Hugh Wakefield and despite his success as a writer he was still drawn to his first love of acting.Programme biography for the December 1978 revival of See How They Run at Greenwich Theatre."]}, {"page": "List of British films of 1952", "response": ["|Love's a Luxury||Francis Searle||Hugh Wakefield, Derek Bond||Comedy||"]}, {"page": "List of British films of 1933", "response": ["|The Crime at Blossoms||Maclean Rogers||Hugh Wakefield, Joyce Bland||Crime||", "|The Fortunate Fool||Norman Walker||Hugh Wakefield, Joan Wyndham||Comedy||"]}, {"page": "List of British films of 1931", "response": ["|The Sport of Kings||Victor Saville||Leslie Henson, Hugh Wakefield, Gordon Harker||Comedy||"]}, {"page": "List of British films of 1938", "response": ["|Make It Three||David MacDonald||Hugh Wakefield, Edmund Willard||Comedy||", "|Runaway Ladies || Jean de Limur || Betty Stockfeld, Hugh Wakefield || Comedy || "]}, {"page": "List of British films of 1937", "response": ["|Death Croons the Blues||David MacDonald||Hugh Wakefield, Antoinette Cellier||Crime||"]}, {"page": "List of British films of 1936", "response": ["|The Crimson Circle||Reginald Denham||Hugh Wakefield, Niall MacGinnis||Crime||", "|The Improper Duchess||Harry Hughes ||Yvonne Arnaud, Hugh Wakefield ||Comedy||", "|The Limping Man||Walter Summers||Francis L. Sullivan, Hugh Wakefield||Mystery||"]}, {"page": "On Approval (play)", "response": ["| Hugh Wakefield"]}, {"page": "The Man They Couldn't Arrest", "response": ["The Man They Couldn't Arrest is a 1931 British crime film directed by T. Hayes Hunter and starring Hugh Wakefield, Gordon Harker, Garry Marsh and Dennis Wyndham. It was made at Islington Studios.Wood p.72", "* Hugh Wakefield as John Dain"]}, {"page": "The Improper Duchess", "response": ["The Improper Duchess is a 1936 British comedy film directed by Harry Hughes and starring Yvonne Arnaud, Hugh Wakefield and Wilfrid Caithness.  The film is based on the 1931 play of the same name by J. B. Fagan in which Arnaud had starred."]}, {"page": "Winifred Shotter", "response": ["Most of the farces were adapted for the cinema. Shotter appeared in films of Rookery Nook (1930), Plunder (1931) and A Night Like This (1932), directed by Walls and featuring the principals of the Alwych company.\"Winifred Shotter\", British Film Institute. Retrieved 28 February 2013 She was the only member of the stage cast to feature in the 1934 film of Marry the Girl, directed by Maclean Rogers, with Hugh Wakefield, Sonnie Hale and John Deverell in roles played on stage by Walls, Ralph Lynn and Robertson Hare.\"Marry the Girl\", British Film Institute. Retrieved 28 February 2013"]}, {"page": "King of the Ritz", "response": ["King of the Ritz is a 1933 British musical film directed by Carmine Gallone and Herbert Smith and starring Stanley Lupino, Betty Stockfeld and Hugh Wakefield.BFI.org A separate French-language version King of the Hotel was made, with Stockfield appearing in both films.", "* Hugh Wakefield ...  King of Blitz "]}, {"page": "City of Song", "response": ["City of Song, also known as Farewell to Love, is a 1931 British/German romance film directed by Carmine Gallone and starring Jan Kiepura, Betty Stockfeld and Hugh Wakefield.BFI.org It was shot at Wembley Studios.Wood p.69 The film's sets were designed by the art directors Oscar Friedrich Werndorff and J. Elder Wills. A German-language version was released in 1930 under the title The Singing City.", "* Hugh Wakefield as Hon. Roddy Fielding "]}, {"page": "Life Goes On (1932 film)", "response": ["* Hugh Wakefield as Ridgeway Emsworth"]}, {"page": "The Street Singer (1937 film)", "response": ["* Hugh Wakefield ...  Hugh Newman "]}, {"page": "The Crime at Blossoms", "response": ["The Crime at Blossoms is a 1933 British crime film directed by Maclean Rogers and starring Hugh Wakefield and Joyce Bland.The Crime at Blossoms notes, ftvdb.bfi.org.uk; accessed 24 July 2015. It was remade by Rogers in 1949 as Dark Secret.", "* Hugh Wakefield ...  Chris Merryman"]}, {"page": "The Crimson Circle (1936 film)", "response": ["The Crimson Circle is a 1936 British crime film directed by Reginald Denham and starring Hugh Wakefield, Alfred Drayton, and Niall MacGinnis. It is based on the 1922 novel The Crimson Circle by Edgar Wallace. It was made by the independent producer Richard Wainwright at Shepperton and Welwyn Studios.Wood p.89", "* Hugh Wakefield as Derek Yale"]}, {"page": "The Sport of Kings (1931 film)", "response": ["The Sport of Kings is a 1931 British comedy film directed by Victor Saville and starring Leslie Henson, Hugh Wakefield and Gordon Harker. It was based on the 1924 play of the same title by Ian Hay.", "* Hugh Wakefield as Algernon Sprigg"]}, {"page": "Aren't We All? (film)", "response": ["Aren't We All? is a 1932 British comedy film directed by Harry Lachman and starring Gertrude Lawrence, Hugh Wakefield and Owen Nares.BFI.org It is based on the play Aren't We All? by Frederick Lonsdale. It was made at Elstree Studios.", "* Hugh Wakefield as Lord Grenham"]}, {"page": "Lady in Danger", "response": ["In the mythical European country of Ardenberg, General Dittling (Leon M. Lion) stages a military coup. His supporters believe that he will set up a republic but it is actually his desire to restore the monarchy.  Therefore, he persuades British businessman Richard Dexter (Tom Walls) to escort the Queen (Yvonne Arnaud) to the safety of England. Once there his relations with the Queen are farcically misconstrued, when his fiancée Lydia (Anne Gray) arrives unannounced. After many adventures, the King (Hugh Wakefield), who has fled to Paris, is reunited with his wife.", "* Hugh Wakefield - King"]}, {"page": "18 Minutes", "response": ["* Hugh Wakefield - Lord Pilcott "]}, {"page": "Make It Three", "response": ["Make It Three is a 1938 British comedy film directed by David MacDonald and starring Hugh Wakefield, Edmund Willard and Diana Beaumont.BFI.org The screenplay concerns a bank clerk who is left a very large inheritance on condition that he first serve three months in prison. It was the last film produced by Julius Hagen who had owned Twickenham Studios. The film was a quota quickie, made for release by MGM.Wood p.95", "* Hugh Wakefield as Percy Higgin"]}, {"page": "This England (film)", "response": ["*Hugh Wakefield - Vicar"]}, {"page": "The Fortunate Fool", "response": ["The Fortunate Fool is a 1933 British comedy film directed by Norman Walker and starring Hugh Wakefield, Joan Wyndham and Jack Raine.BFI.org", "* Hugh Wakefield as Jim Falconer"]}, {"page": "One Night with You (1948 film)", "response": ["* Hugh Wakefield as Santell"]}, {"page": "The Limping Man (1936 film)", "response": ["The Limping Man is a 1936 British crime film directed by Walter Summers and starring Francis L. Sullivan, Hugh Wakefield and Patricia Hilliard. It was an adaptation of the play of the same title by William Matthew Scott. The film was shot at Welwyn Studios.Wood p.91", "* Hugh Wakefield as Colonel Paget"]}, {"page": "Marry the Girl (1935 film)", "response": ["* Hugh Wakefield as Hugh Delafield "]}, {"page": "Wakefield (surname)", "response": ["*Hugh Wakefield (1888–1971), English actor"]}, {"page": "Dreams Come True (film)", "response": ["Dreams Come True is a 1936 British musical film directed by Reginald Denham and starring Frances Day, Nelson Keys and Hugh Wakefield. The film is based on the 1924 operetta Clo-Clo by Franz Lehár and Bela Jenbach in an English adaptation by Bruce Sievier.Low p.312 It was made at Ealing Studios.Wood p.89 It was one of many operetta films made during the decade.", "* Hugh Wakefield as Albert von Waldenau "]}, {"page": "Forget Me Not (1936 film)", "response": ["* Hugh Wakefield as Mr. Jackson  "]}, {"page": "The Interrupted Honeymoon", "response": ["* Hugh Wakefield as Uncle John "]}, {"page": "It's You I Want", "response": ["It's You I Want is a 1936 British comedy film directed by Ralph Ince and starring Seymour Hicks, Marie Lohr and Hugh Wakefield. It was made at Beaconsfield Studios.Wood p.90 The film's sets were designed by Norman Arnold.", "* Hugh Wakefield as Otto Gilbert "]}, {"page": "Death Croons the Blues", "response": ["Death Croons the Blues is a 1937 British crime film directed by David MacDonald and starring Hugh Wakefield, Antoinette Cellier and George Hayes.Wood p.94 The film was made at Twickenham Studios by the producer Julius Hagen whose ownership of the company was about to be ended due to financial problems.", "* Hugh Wakefield as Jim Martin  "]}, {"page": "My Heart is Calling", "response": ["* Hugh Wakefield as Armand Arvelle"]}, {"page": "The Luck of a Sailor", "response": ["* Hugh Wakefield as King Karl  "]}, {"page": "Love's a Luxury", "response": ["Love's a Luxury is a 1952 British comedy film directed by Francis Searle and starring Hugh Wakefield, Derek Bond and Michael Medwin.Chibnall & McFarlane p.68 It was made by the Manchester-based Mancunian Films.", "* Hugh Wakefield as Charles Pentwick"]}, {"page": "The Live Wire (1937 film)", "response": ["* Hugh Wakefield as Grantham "]}, {"page": "The French Mistress", "response": ["It premiered at the Wimbledon Theatre in June 1955. Four years later it enjoyed a West End run of 185 performances, first at the Adelphi Theatre before transferring to the Prince's Theatre. The cast included Hugh Wakefield and Richard Bird.Wearing p.649", "Casts: Sonnie Hale, Kathleen St John, John Law, Nigel Beard, Robin Lloyd, Juliet Winsor, Bruce Heighley, Kenneth Outwin, Olive Milbourne, Sydney King, Nicholas Stevenson, Gary Watson, Susan Maryott, Anthony Green, Richard Ives, Colin Wall, Christopher Sandford, Kenneth Laird, Richard Bird, Rosamond Burne, Peter Gray, Scot Finch, Michael Meacham, Marie-Claire Verlene, Pearson Dodd, Richard Fox, Peter Greenspan, David Lord, Hugh Wakefield"]}, {"page": "Off the Record (play)", "response": ["It premiered at the King's Theatre, Edinburgh prior to its London run. In the West End it ran for 702 performances from 3 June 1947 to 12 February 1949, initially at the Apollo Theatre before transferring to the Piccadilly Theatre. The cast included Hugh Wakefield, Hubert Gregg, Roger Maxwell, and Tom Gill.Wearing p.309"]}, {"page": "Take a Chance (play)", "response": ["It was performed at the Whitehall Theatre, running for 93 performances between 28 July and 17 October 1931. It followed closely on the heels of another of Hackett's plays at the theatre Good Losers. The original cast of Take a Chance included Ian Hunter, Ronald Shiner, Charles Quatermaine, Anthony Holles, Francis Lister, Hugh Wakefield, Barbara Hoffe and Marion Lorne.Wearing p.135"]}]}}