{"wiki_id": "http://www.wikidata.org/entity/Q5932795", "itemLabel": "Hugh Swann", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Swann", "wikipedia_page": {"main": "Hugh Sinclair Swann (11 March 1925 – 13 June 2007), otherwise known as Tim Swann, became the cabinet maker to Elizabeth II of the United Kingdom. His work was inspired by his admiration for Barnsley, Gimson and Russell. He fitted many of the most important of Britain's coin collections including the Fitz-william, Cambridge, the Barber Institute, Birmingham, and the Hunterian Museum, Glasgow. More importantly yet, he supplied the Royal Mint with nearly 80 cabinets to house its complete collection.His work for Elizabeth II began in 1975 when a complete reorganisation of the Royal coin collection at Windsor Castle was begun. The cabinets were created from specially purchased Honduras mahogany and Indian rosewood. On one occasion a log was delivered to his workshop addressed \"Her Majesty the Queen of England, 3 Hexham Road, Heddon-on-the-Wall\". \nHe made the crosier and pectoral cross for Bishop Leonard", "link_mentions": [{"page": "Graham Leonard", "response": ["Leonard was the brother-in-law to the academic Michael Swann (Lord Swann of Coln St Denys) and Hugh Swann, cabinet maker to Elizabeth II of the United Kingdom, having married their sister, Priscilla Swann, in 1943. He and his wife had two sons."]}, {"page": "Michael Swann", "response": ["*Brother, Hugh Swann, cabinet maker to the Queen"]}, {"page": "Vivian Dykes", "response": ["Dykes married Ada Winifred (née Smyth) in 1922. Dykes was uncle to Michael Swann, former chairman of the BBC and Hugh Swann, cabinet maker to Queen Elizabeth II of the United Kingdom"]}, {"page": "Sydney Castle Roberts", "response": ["He married, firstly, Irene Wallis (died 1932), daughter of Arnold Joseph Wallis, Fellow of Corpus Christi College, Cambridge. They had two daughters and a son. After her death, in 1938, he married a second time to Marjorie Dykes, widow of Dr Meredith Blake Robson Swann. Roberts was stepfather to Hugh Swann,Tim Swann, The Times, 21 July 2007. cabinet maker to Queen Elizabeth II, and of Michael Swann, former chairman of the BBC."]}]}}