{"wiki_id": "http://www.wikidata.org/entity/Q5931723", "itemLabel": "Hugh McCalmont", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_McCalmont", "wikipedia_page": {"main": "Major-General Sir Hugh McCalmont  (9 February 1845 – 2 May 1924) was an Anglo-Irish soldier, politician, and horseman. He was elected as an Ulster Unionist Member of Parliament for North Antrim in 1895, resigning in 1899 by becoming Steward of the Manor of Northstead.", "link_mentions": [{"page": "8th Infantry Division (United Kingdom)", "response": ["* 1902–1903 Major-General Sir Hugh McCalmont"]}, {"page": "North Antrim (UK Parliament constituency)", "response": ["| Colonel Hugh McCalmont"]}, {"page": "McCalmont", "response": ["*Hugh McCalmont (1845–1924), British politician"]}, {"page": "Whiteabbey", "response": ["Abbeylands, a Victorian house in Whiteabbey belonging to Sir Hugh McCalmont, was used as a training ground by the Ulster Volunteers during the Home Rule Crisis. In 1914, the building was torched by Suffragettes in response to Edward Carson's opposition to votes for women, causing £20,000 of damage."]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["| Hugh McCalmont", "*25 February: Antrim North - William Moore, Unionist, replacing Hugh McCalmont"]}, {"page": "Wolseley ring", "response": ["*Hugh McCalmont"]}, {"page": "List of United Kingdom by-elections (1885–1900)", "response": ["|Hugh McCalmont"]}, {"page": "Harry McCalmont", "response": ["In 1888, his millionaire great uncle, Hugh McCalmont died. ", "He left no issue, and the bulk of his fortune passed to his second cousin, Dermot McCalmont, son of his father's first cousin, Colonel Sir Hugh McCalmont, KCB."]}, {"page": "List of Vanity Fair (British magazine) caricatures (1905–1909)", "response": ["|1906-05-1010 May 1906||McAlmont-HughMaj-Gen Sir Hugh McCalmont MP||Sir Hugh||Spy||M 1014||25px"]}, {"page": "1900 Birthday Honours", "response": ["* Major-General Hugh McCalmont, , Commanding Cork District."]}, {"page": "Dermot McCalmont", "response": ["#REDIRECT Hugh McCalmont#Family"]}, {"page": "Lynwood Palmer", "response": ["Palmer painted winners of all the English and Irish classics and many Group winners beside. These included champion horses such as: the Earl Of Derby's Swynford, winner of the Eclipse Stakes and the St Leger, Tranquil, a success in the fillies classic, the 1,000 Guineas in 1923 and Hyperion, painted in 1933 after the colt won both the Derby and St Leger, Aboyeur, winner of the Suffragette Derby in 1913, Royal Lancer, owned by Earl Lonsdale and winner of the St Leger in 1922, Lord Woolavington's Derby winner Coronach, the undefeated The Tetrarch owned by Sir Hugh McCalmont and voted by the British National Horseracing Museum as the best English-trained two-year-old of the 20th century, Gainsborough, who in 1918 won the English Triple Crown and the Ascot Gold Cup for Lady Douglas, the first woman to own a classics winner and the filly Golden Corn, winner of the July Cup in 1923 and owned by Marshall Field III grandson of Palmer's early patron. The style is always the same with non-specific, featureless backgrounds so that the eye always focuses on the horse."]}, {"page": "Pamela (paintings)", "response": ["The whole series of twelve paintings was still in Highmore's studio in 1750 and when he moved to Canterbury in 1762 he sold all twelve together as a set. They then re-appeared on 26 November 1920, when they were sold from the collection of Hugh McCalmont's son Major Dermot McCalmont (1887-1968Horseracing History Online - Dermot McCalmont) of Cheveley Park, Cambridgeshire to a man named Peacock, who was acting on behalf of the art dealer and restorer Ayerst Horace Buttery. The National Gallery used money from the Florence Fund to buy the whole set from Buttery and then divided the twelve works equally between itself, the Fitzwilliam Museum and the National Gallery of Victoria (NGV) in Melbourne. Each of the other two institutions contributed £500, the Fitzwilliam from the Marlay Fund and the NGV from the Felton Bequest.Press cutting on an act of co-operation between the National Gallery, the Fitzwilliam Museum, Cambridge, and the National Gallery of Victoria (NGV), Melbourne, to obtain 12 pictures by Highmore (NG24/1921/2/1) "]}, {"page": "1899 North Antrim by-election", "response": ["The North Antrim by-election of February 1899 was held on 25 February 1899.  The by-election was held following the resignation of the previous member Hugh McCalmont who was a member of the Irish Unionist Party. It was won unopposed by the Irish Unionist Party candidate William Moore."]}, {"page": "Edward Langtry", "response": ["In 1794 George married Fanny Callwell (1772–1825) whose family had arrived in Ireland from Scotland at the beginning of the 17th century as part of the colonisation of Ulster.  Her mother was Catherine Magee, sister of printer, publisher and Belfast book seller, James Magee (c. 1707–1797).  Fanny was connected via the marriage of her siblings to several other families in Co. Antrim.  One of her nephews was William Thompson the naturalist.  Other slightly more distant relatives included politicians Hugh McCalmont and Harry McCalmont."]}]}}