{"wiki_id": "http://www.wikidata.org/entity/Q5931681", "itemLabel": "Hugh Massy", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Massy_(British_Army_officer)", "wikipedia_page": {"main": "Lieutenant General Hugh Royds Stokes Massy  (5 January 1884 – 21 May 1965) was a British Army officer who served during the First and Second World Wars.", "link_mentions": [{"page": "42nd (East Lancashire) Infantry Division", "response": ["The next few months for the division were spent in England, being re-equipped and reformed, along with anti-invasion duties in the event of a German invasion. Due to the heavy casualties sustained in France, the division absorbed thousands of conscripts as replacements. The division was stationed initially near Middlesbrough, Yorkshire under Northern Command, and in mid-June Major General Holmes, who had been General Officer Commanding (GOC) for over two years, was given command of X Corps and succeeded as GOC 42nd Division by Major General Henry Willcox. On 4 July, the division came under the command of X Corps and then, on 9 September, moving to East Anglia, IV Corps, commanded by Lieutenant General Francis Nosworthy, under Eastern Command. The corps was intended by General Sir Alan Brooke, the Commander-in-Chief, Home Forces, to be used in a counterattack role if the Germans invaded. On 5 November 1940, the division moved to Gloucestershire upon transferring again, this time to Lieutenant General Hugh Massy's XI Corps, and continued its routine of alternating between beach defence and training for potential future operations overseas. In late April 1941, Major General Eric Miles, who had commanded the 126th Brigade with distinction in France and Belgium the year before, assumed command from Major General Willcox, upon the latter's promotion to command I Corps, and, after further training, which included numerous large-scale exercises, on 23 October, the 42nd Division transferred again to Northern Command and, five days later, Major General Miles Dempsey assumed command from Major General Miles, who was posted to the 56th (London) Infantry Division as its GOC."]}, {"page": "Operation Sea Lion order of battle", "response": ["* XI Corps — Lieutenant General Hugh Massy"]}, {"page": "Eric Miles", "response": ["Miles continued to command the brigade after its return to England, training it in preparation for the expected German invasion of England and at the same time absorbing conscripts to bring the brigade up to strength after its heavy casualties. He became Brigadier General Staff (BGS) of Home Forces in mid-September before returning to the 42nd Division in late April 1941, this time as its GOC, succeeding Major General Henry Willcox, who in turn had succeeded Major General Holmes the previous June, Miles in turn receiving a promotion to acting major general in May. He was promoted to permanent major general in June. The division comprised, in addition to Miles's old 126th Brigade, the 125th and 127th Infantry Brigades, and divisional troops, and was serving in Eastern Command in East Anglia as part of Lieutenant General Hugh Massy's XI Corps. The division's main role was that of a static beach defence, and training to repel an invasion."]}, {"page": "Massy", "response": ["* Hugh Massy (British Army officer), Lieutenant General Hugh Royds Stokes Massy, British Army General"]}, {"page": "Gordon MacMillan", "response": ["In May the following year, with the division, now under Major-General William Morgan and serving in East Anglia under Lieutenant-General Hugh Massy's XI Corps, being still concerned mainly with home defence, MacMillan was promoted, on 1 May 1941, to the acting rank of brigadier (and acting colonel on the same date) and took up command of the 55th Division's 199th Brigade.MacMillan 2013, p. 60 He trained the brigade very hard over the next few months in numerous large-scale exercises until, in late December 1941, he was chosen to be Brigadier General Staff (BGS) in the HQ of IX Corps District. Initially the corps, commanded by Lieutenant-General Francis Nosworthy, was involved in coastal defences, supporting Eastern Command, but was soon to become engaged in preparing itself for the Allied invasion of French North Africa, codenamed Operation Torch.MacMillan 2013, p. 62"]}, {"page": "XI Corps (United Kingdom)", "response": ["* Jul 1940-Nov 1941 Lieutenant-General Hugh Massy"]}, {"page": "List of Old Bradfieldians", "response": ["* Lieutenant General Hugh Massy (1884-1965) British Army general during World War II."]}, {"page": "Actions in Nordland", "response": ["As the force at Namsos was evacuated, Lieutenant General Hugh Massy, the commander of the British forces in Central Norway, recommended that a detachment of French ski troops defend Grong, to block the road and the uncompleted railway line running north from Namsos to Mosjøen. The commanders of the forces at Namsos objected, claiming that these routes were impassable even though Norwegian units had been moving easily between Grong and Mosjøen."]}, {"page": "Deputy Chief of the General Staff (United Kingdom)", "response": ["* Major-General Hugh Massy 1939–1940"]}, {"page": "Hugh Massy", "response": ["Hugh Massy may refer to:", "* Hugh Massy (British Army officer) (1884–1965)", "* Hugh Massy, 1st Baron Massy (1700–1788), Anglo-Irish peer and politician", "* Hugh Massy, 2nd Baron Massy (1733–1790), Anglo-Irish politician and peer", "* Sir Hugh Massy, 1st Baronet (died 1807), Anglo-Irish politician and baronet", "* Sir Hugh Massy, 2nd Baronet (1767–1842), Anglo-Irish politician and baronet"]}]}}