{"wiki_id": "http://www.wikidata.org/entity/Q5930409", "itemLabel": "Hugh Constantine", "itemDescription": "Royal Air Force air marshals", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Constantine", "wikipedia_page": {"main": "Air Chief Marshal Sir Hugh Alex Constantine,  (23 May 1908 – 16 April 1992) was a Royal Air Force officer who became Air Officer Commanding-in-Chief of Flying Training Command.", "link_mentions": [{"page": "No. 5 Group RAF", "response": ["* 16 January 1945 Air Vice-Marshal Hugh Constantine"]}, {"page": "Walter Anderson (RAF officer, died 1959)", "response": ["On 10 December 1928, Pilot Officer, later Air Chief Marshall Sir, Hugh Constantine, while flying a Siskin fighter aircraftBelfast Telegraph, Friday 28 February 1964. Page 10. off Leysdown on the Isle of Sheppey in Kent, crashed into the sea, about 200 yards from the shore. In cold and rough conditions, Corporal Thomas McTeague and Flying Officer Anderson swam from the shore to Constantine who was in a state of collapse. Through their combined efforts McTeague and Anderson were able to bring Constantine back to the land."]}, {"page": "Commandant Royal College of Defence Studies", "response": ["*Air Chief Marshal Sir Hugh Constantine KBE CB DSO (1961)"]}, {"page": "List of people educated at Christ's Hospital", "response": ["*Hugh Constantine – Royal Air Force Air Chief Marshal"]}, {"page": "RAF Flying Training Command", "response": ["*1 Mar 1959 Air Marshal Sir Hugh Constantine "]}, {"page": "List of people from Hampshire", "response": ["*Hugh Constantine, air force commander, was born in Southsea"]}, {"page": "Thomas McTeague", "response": ["On 10 December 1928, Pilot Officer, later Air Chief Marshall Sir, Hugh Constantine, while flying a Siskin fighter aircraft off Leysdown on the Isle of Sheppey in Kent, crashed into the sea, about 200 yards from the shore. In cold and rough conditions, Corporal McTeague and Flying Officer Walter Anderson swam from the shore to Constantine who was in a state of collapse. Through their combined efforts McTeague and Anderson were able to bring Constantine back to the land."]}]}}