{"wiki_id": "http://www.wikidata.org/entity/Q5931283", "itemLabel": "Hugh Jeudwine", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Jeudwine", "wikipedia_page": {"main": "Lieutenant-General Sir Hugh Sandham Jeudwine, KCB, KBE (9 June 1862 – 2 December 1942) was a British Army officer who became Director General of the Territorial Army.", "link_mentions": [{"page": "5th Infantry Division (United Kingdom)", "response": ["* 1919–1922 Major-General Sir Hugh Jeudwine"]}, {"page": "Battle of Guillemont", "response": ["The 55th (West Lancashire) Division (Major-General Hugh Jeudwine) attacked at  on 8 August into an easterly wind, which with mist, dust and smoke from a German counter-barrage, made visual signalling impossible, delaying reports to the 55th (West Lancashire) Division  headquarters until after  Next to the French, a reinforced battalion of the 165th Brigade advanced over the spur south of Guillemont and was then stopped by German defensive fire and driven under cover in shell-holes. Bombers had moved south-east along Cochrane Alley, into Maurepas ravine, established a trench-block and found themselves unsupported on both flanks, as the French advance had also been stopped by the Germans south-east of Maltz Horn Farm. The right-hand battalion of the 164th Brigade was held up by uncut wire at the south-western edge of Guillemont, where the infantry tried to dig in beyond grenade range, before retiring to their jumping-off trenches. The left-hand battalion broke through on either side of the quarry at the west side of Guillemont and entered the village; reinforcements sent to hold the captured front line behind them were bombed out by a German counter-attack from the south. German machine-guns began to sweep no-man's-land and isolated the British troops in the village."]}, {"page": "Liverpool Cathedral", "response": ["Bishop Chavasse and Sir Giles Gilbert Scott are buried in the precinct of the cathedral, the former in Founder's Plot, and the latter at the west end of the site. Clergy buried within the cathedral include the bishops Albert David and David Sheppard. Among the benefactors whose remains are buried in the cathedral are The 1st Baron Vestey and his brother, Sir Edmund Vestey, and Frederick Radcliffe. The ashes of the donor of the cathedral bells, Thomas Bartlett, are interred in a casket in the ringing room. At the rear of the memorial to the 55th (West Lancashire) Division rest the ashes of Lieutenant-General Sir Hugh Jeudwine, who commanded the division from its formation in 1916 until the end of the First World War."]}, {"page": "55th (West Lancashire) Division", "response": ["In November 1915, the Army Council authorised the reformation of the division in France, and provided a new designation: the 55th (West Lancashire) Division. Beginning on 3 January 1916, the division's former units assembled near Hallencourt. This included the arrival of the North Lancashire Brigade, which had been renumbered as the 164th Brigade in 1915. The Liverpool and South Lancashire Brigades were reformed, but numbered as the 165th and the 166th Brigades respectively. On 27 January 1916, the reformation was completed, and Major-General Hugh Jeudwine was assigned as commander. These experienced troops were no longer completely made up of the men who had left in 1915, due to casualties and new drafts. By the end of March, the division was still 3,000 men under establishment. The division comprised three brigades: the 164th Brigade, consisting of the 1/4th Battalion, King's Own (Royal Lancaster Regiment) (1/4KORL), the 1/4th Battalion, Loyal North Lancashire Regiment (1/4LR), the 2/5th Battalion, Lancashire Fusiliers (2/5LF) and the 1/8th (Irish) Battalion, King's (Liverpool Regiment) (Liverpool Irish); the 165th Brigade consisted of the 1/5th Battalion, King's (Liverpool Regiment) (1/5KR), the 1/6KR, the 1/7KR, and the 1/9KR; and the 166th Brigade consisted of the 1/10th (Scottish) Battalion, King's (Liverpool Regiment) (Liverpool Scottish), the 1/5th Battalion, the South Lancashire Regiment (1/5SL), the 1/5th Battalion, King's Own (Royal Lancaster Regiment) (1/5KORL) and the 1/5th Battalion, Loyal North Lancashire Regiment (1/5LR). During 1916, Jeudwine adopted the Red Rose of Lancaster as the divisional emblem, to foster county pride in the division. The insignia inspired the creation of a poem that ended with \"We win or die who wear the rose of Lancaster\". This line was then adopted as the divisional motto.", "|Major-General Sir Hugh Jeudwine"]}, {"page": "Order of battle for the Battle of the Somme", "response": ["| style=\"background:#99CC99\"|55th (West Lancashire) Division   ||colspan=\"2\" |Major-General Hugh Jeudwine"]}, {"page": "List of works by Walter Gilbert", "response": ["|The sandstone memorial to the 55th (West Lancashire) Division, is located above the arch which supports the west gallery in the south arm of the eastern transept. A winged Angel holding a cross holds a crown over a kneeling soldier and a carved scroll is flanked by two carved roses. The whole sculptured group is positioned under a canopy which rests on a slightly projecting corbel table, the corbels representing the tracks of tanks. The memorial is flanked by a Union Flag and the flag of the Division.  Weingartner and Gilbert designed the memorial and the sculptural work was done by W. Meadows. The ashes of Lieutenant-General Sir Hugh Jeudwine who commanded the division from its formation in 1916 until the end of the war rest at the back of the memorial.  The inscription reads \"THEY WIN OR DIE / WHO WEAR THE ROSE OF LANCASTER / FIFTY FIFTH DIVISION\"55th West Lancashire Division UKNIWM. Retrieved 29 August 2012."]}, {"page": "Hugh Sandham Jeudwine", "response": ["#REDIRECT Hugh Jeudwine"]}, {"page": "5th Battalion, South Lancashire Regiment", "response": ["In November the 55th Division was switched to the Cambrai sector, where it made a feint attack on the southern flank of the main assault (the Battle of Cambrai). 1/5th Battalion was not involved in this operation, but on 26 November it had to take over an extended front (over 2500 yards) held with a series of platoon posts. Two days later there was an increase in German artillery fire and it was obvious that an attack was imminent. The divisional commander, Major-General Hugh Jeudwine, visited the battalion at midnight on 29 November and urged the men to 'Stand or fall at your posts'. When the attack came through the morning fog, with a bombardment of extreme intensity followed by ground attacks by the Richthofen 'Circus', the battalion was overwhelmed. While massed German infantry attacked its position, a 'box barrage' isolated the battalion and its headquarters, which were then surrounded and all survivors were captured. Its strength that morning had been 21 officers and 540 other ranks, and all that remained were a handful of officers and men left behind at the transport lines. These took part in the fighting the following day and were then withdrawn.Mullaly, pp. 268–3, 272.Cooper, p. 174."]}, {"page": "4th Lancashire Artillery Volunteers", "response": ["* 1920–42: Lt-Gen Sir Hugh Jeudwine, KCB, KBE, TD, former GOC 55th (West Lancashire) Division"]}, {"page": "War Memorial (Thornton-Cleveleys)", "response": ["The war memorial, designed by Albert Toft and sculpted by W. L. Cookson, consists of a bronze statue depicting a soldier standing with a rifle.  The statue is on a square granite shaft, on a tapered plinth, on a base of two steps.  On the shaft is an inscription and the names of those lost in the First World War.  In front and at the sides of the memorial are three granite tablets in the form of open books with the names of those lost in the Second World War.  Colonel Hugh Jeudwine was present at the memorial's unveiling on 11 November 1923."]}]}}