{"wiki_id": "http://www.wikidata.org/entity/Q5930868", "itemLabel": "Hugh Futcher", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Futcher", "wikipedia_page": {"main": "Hugh Futcher (born 29 October 1937 in Portsmouth, Hampshire) is an English actor in theatre, television and film. He was a member of the stock company of the Carry On films, with notable parts in Carry On Spying, Carry On at Your Convenience, and Carry On Behind. Other films include Roman Polanski's Repulsion (as Colin's pubmate Reggie) and the Herman's Hermits musical Mrs. Brown, You've Got a Lovely Daughter.\nIn television, Futcher had a recurring role in the adventure series Orlando as \"Hedgehog.\" He has also appeared on The Saint, Z-Cars, The Sweeney, Minder, and Casualty. In 1972 he appeared in the Doctor Who serial \"The Sea Devils\", and 'Six Days of Justice', in the Episode 'A Private Nuisance', with Earl Cameron (actor), Hugh Futcher, and Mollie Sugden. Fifteen years later he was considered for the role of the Seventh Doctor, but accepted other work that precluded taking the part.He appeared with Brian Murphy and Maureen Lipman in the 1985 television drama On Your Way, Riley.\nIn 2011 he appeared in episode 5 of series 5 of MI High as George.", "link_mentions": [{"page": "Jim Dale", "response": ["Jim Dale  (born James Smith; 15 August 1935) is an English actor, composer, director, narrator, singer and songwriter. In the United Kingdom he is known as a pop singer of the 1950s who became a leading actor at the National Theatre. In the British film world he became one of the regulars in the Carry On films. He is the most prolific surviving cast member from the series, and one of only a few regulars overall – the others being Leslie Phillips, Bernard Cribbins, Valerie Leon, Kenneth Cope, Julian Holloway, Hugh Futcher, Anita Harris, Amanda Barrie and Patricia Franklin. "]}, {"page": "2000 in film", "response": ["| 102 Dalmatians || Walt Disney Pictures || Kevin Lima (director); Kristen Buckley, Brian Regan, Bob Tzudiker, Noni White (screenplay); Glenn Close, Gérard Depardieu, Ioan Gruffudd, Alice Evans, Tim McInnerny, Eric Idle, Ben Crompton, Carol MacReady, Ian Richardson, Jim Carter, Ron Cook, David Horovitch, Timothy West, Mike Hayley, Kerry Shale, Hugh Futcher, Jack Angel, Bill Farmer, Patrick Pinney, Phil Proctor || Comedy, Family || Live action"]}, {"page": "Carry On Again Doctor", "response": ["*Hugh Futcher as Cab driver (uncredited)"]}, {"page": "Carry On Behind", "response": ["*Hugh Futcher as Painter"]}, {"page": "Carry On at Your Convenience", "response": ["*Hugh Futcher as Ernie"]}, {"page": "The Apprenticeship of Duddy Kravitz (film)", "response": ["The film was actually Kotcheff's second adaptation of Richler's 1959 novel. In 1961, he had directed a television play for ITV's Armchair Theatre based on Kravitz, with Hugh Futcher in the title role."]}, {"page": "The Wednesday Play", "response": ["| Colin BlakelyRobert HardyBernard HeptonBrian BlessedEdward HardwickeGodfrey QuigleyGawn GraingerGodfrey JamesEric MasonHugh FutcherEdmund BaileyDavid CannonRoy Stewart"]}, {"page": "Carry On Abroad", "response": ["*Hugh Futcher as Jailer"]}, {"page": "Carry On Girls", "response": ["*Hugh Futcher as \"There's Fiddler\" citizen (uncredited)"]}, {"page": "Carry On Spying", "response": ["* Hugh Futcher as Bed of nails native"]}, {"page": "Don't Lose Your Head", "response": ["*Hugh Futcher as Guard (uncredited)"]}, {"page": "Son of Man (play)", "response": ["* Hugh Futcher as 1st Heckler"]}, {"page": "List of Carry On films cast members", "response": ["* Hugh Futcher (born 1937) (7) played mostly small roles in Spying, At Your Convenience and Behind.  He also had uncredited roles in Don't Lose Your Head, Again Doctor, and Girls."]}, {"page": "The Sandwich Man (1966 film)", "response": ["* Hugh Futcher as Gogi"]}, {"page": "Mrs. Brown, You've Got a Lovely Daughter (film)", "response": ["* Hugh Futcher as Swothard"]}, {"page": "The Pleasure Girls", "response": ["* Hugh Futcher as Pablo"]}, {"page": "Before Winter Comes", "response": ["* Hugh Futcher as Joe"]}, {"page": "List of Minder episodes", "response": ["|colspan=\"3\"|Guest stars: T. P. McKenna as J.J. Mooney, Shaun Curry as Sprott, Royce Mills as Andrew, Vivian Mann as Tony, Rosalind Lloyd as Fenella, Timothy Bateson as Railwayman, Hugh Futcher as Mo, Alan Chuntz as Punter in Betting Shop."]}, {"page": "Farewell Performance", "response": ["* Hugh Futcher – Max"]}, {"page": "Rattle of a Simple Man", "response": ["* Hugh Futcher as Ozzie"]}, {"page": "On Your Way, Riley", "response": ["* Hugh Futcher - Ossie"]}]}}