{"wiki_id": "http://www.wikidata.org/entity/Q5932763", "itemLabel": "Hugh Stowell Brown", "itemDescription": "Manx Christian minister", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Stowell_Brown", "wikipedia_page": {"main": "Hugh Stowell Brown (10 August 1823 – 24 February 1886) was a Manx Christian minister and renowned preacher.\nHugh Stowell Brown was a preacher, pastor and social reformer in Liverpool in the nineteenth century. His public lectures and work among the poor brought him great renown. On his death a statue was raised to him, one of only three Liverpool clergymen to receive that honour. His brother was the Manx poet Thomas Edward Brown.", "link_mentions": [{"page": "August 10", "response": ["*1823 – Hugh Stowell Brown, English minister and reformer (d. 1886)"]}, {"page": "1886", "response": ["* February 24 – Hugh Stowell Brown, Manx preacher (b. 1823)"]}, {"page": "1823", "response": ["** Hugh Stowell Brown, Manx preacher (d. 1886)"]}, {"page": "Hall Caine", "response": ["The Caine family belonged to the Baptist Church in Myrtle Street, Liverpool, presided over by the charismatic Hugh Stowell Brown, a Manxman and brother of poet Thomas Edward Brown. Brown's public lectures and work among the poor made him a household name in Liverpool. Caine participated in the literary and debating society Brown had established. While Caine was very young he became well known and highly regarded by the people of south Liverpool. There he was in great demand as a speaker, having the ability to engage an audience from his first word. Through studying the works of the Lake School of Poets, and the best writers of the eighteenth century, Caine combined this knowledge with his own ideas of perfection, and went on to develop his level of eloquence to oratory."]}, {"page": "Thomas Edward Brown", "response": ["Brown was born on 5 May 1830 at Douglas, Isle of Man, the sixth of ten children born to Rev. Robert Brown and his wife, Dorothy. His older brother became the Baptist preacher, pastor and reformer Hugh Stowell Brown (10 August 182324 February 1886). The family moved to Kirk Braddan when Thomas was two years old.Simpson, Selwyn George. Thomas Edward Brown, the Manx Poet: An Appreciation, London, U.K.:Walter Scott Publishing,1906, p.6"]}, {"page": "For He's a Jolly Good Fellow", "response": ["The British and the American versions of the lyrics differ. \"And so say all of us\" is typically British,An 1859 version quoted in The Times, however, has some 'red-faced' English officers at an Indian entertainment dancing before their host: ‘...declaring that he was \"a right good fellow; he's a jolly good fellow, which nobody dare deny hip, hip, hip, hoorah!\" &c.' The Times(London, England), 24 March 1859, p. 9 while \"which nobody can deny\" is regarded as the American version, but \"which nobody can deny\" has been used by non-American writers, including Charles Dickens in Household Words, Hugh Stowell Brown in Lectures to the Men of Liverpool and James Joyce in Finnegans Wake. (In the short story 'The Dead' from Dubliners, Joyce has a version that goes, \"For they are jolly gay fellows...\" with a refrain between verses of \"Unless he tells a lie\".) The 1935 American film Ruggles of Red Gap, set in rural Washington State, ends with repeated choruses of the song, with the two variations sung alternately. That may have been chosen by the writer or director because, although the singing crowd is almost completely American, they are singing it about a British person."]}, {"page": "Hope Street, Liverpool", "response": ["*Statue of Hugh Stowell Brown"]}, {"page": "West Derby Cemetery", "response": ["* Hugh Stowell Brown"]}, {"page": "List of Baptists", "response": ["*Hugh Stowell Brown (1823–1886, IoM), preacher and activist"]}, {"page": "Peace Society", "response": ["*Hugh Stowell Brown - leader of the Liverpool branch"]}, {"page": "Hugh Brown", "response": ["* Hugh Stowell Brown (1823–1886), Christian minister and preacher"]}, {"page": "John Roberts, 1st Baron Clwyd", "response": ["Lord Clwyd married Hannah, daughter of William Sproston Caine and granddaughter of Hugh Stowell Brown, in 1893. She died in 1951. Clwyd died in December 1955, aged 92, and was succeeded in his titles by his son Trevor Roberts."]}, {"page": "Wayne Clarke (broadcaster)", "response": ["He is the author of 'A Ready Man', the biography of Hugh Stowell Brown, published by Instant Apostle in September 2019."]}, {"page": "William Sproston Caine", "response": ["Caine was brought up as a Baptist under the ministry of Hugh Stowell Brown, whose daughter Alice married Caine in 1868; they had two sons (including the author William Caine) and three daughters. Caine would tell the story of how he sat down to drink sherry whilst reading a temperance book by Julia Wightman. He was so convinced that he never drank again."]}, {"page": "William Hendry Stowell", "response": ["Born at Douglas, Isle of Man, on 19 June 1800, he was son of William Stowell and his wife, Ann Hendry. Hugh Stowell was his cousin, and be was more distantly related to Hugh Stowell Brown. He was one of the first students at the Blackburn Academy, opened in 1816, under Dr. Joseph Fletcher. His first ministerial charge, at St. Andrew's Chapel, North Shields, extended from February 1821 to 1834, when he was appointed head of Rotherham Independent College, and pastor of Masborough congregational church. The latter post he resigned in 1849, and the former in October 1850, on his appointment as president of Cheshunt College."]}, {"page": "John Hulley", "response": ["Hulley's funeral was conducted by Hugh Stowell Brown, a well-known Baptist minister. At the funeral in Smithdown Road Cemetery on 11 January 1875, Brown spoke of the value of physical conditioning: 'exercises benefit the pupils in bodily health, but they led to the cultivation of manly habits, of temperance, and of self-denial, and so acted upon the moral character as well as the physical frame.' In his Commonplace Book Brown noted: ", "\"Today I buried John Hulley, the Gymnasiarch. He was at one time apparently a very popular man in Liverpool, but there were not more than a dozen people at his funeral. It is a heartless world!\"Hugh Stowell Brown, ed W S Caine, Extracts from His Commonplace Book, in Hugh Stowell Brown, A Memorial Volume, p 160."]}, {"page": "Francis John Williamson", "response": ["* statue of Hugh Stowell Brown, (1889) now restored and in Hope Street, Liverpool"]}, {"page": "Grant Gardens", "response": ["* Hugh Stowell Brown"]}, {"page": "Julia Wightman", "response": ["In 1872 she was invited to speak at the conference of the National Temperance League. She told the story of Molly, a drunkard, who was received with kindness at her vicarage and in time signed the pledge. The following year she published, More than Conqueror, a life of John Woodford who had been the secretary of the Shrewsbury YMCA. The future MP for Scarborough William Sproston Caine was brought up as a Baptist under the ministry of Hugh Stowell Brown. Caine would tell the story of how he sat down to drink sherry whilst reading a Temperance book by Wightman. He was so persuaded by what he read that he never drank again and became an advocate for Temperance."]}, {"page": "William Caine (author)", "response": ["He was born in Liverpool, the son of William Sproston Caine and Alice, daughter of the Rev. Hugh Stowell Brown. He was educated at Manor House School in Clapham, Westminster School, St Andrews University and Balliol College, Oxford. After leaving Oxford he was called to the bar, but after seven years abandoned that profession for writing. He married Gordon, daughter of Farmer R. Walker of Boston, Massachusetts, and lived at 16 The Pryors, East Heath Road, London NW3. He was a member of the Reform Club and his recreations included trout-fishing and sketching.Who Was Who, vol. II, p. 162."]}]}}