{"wiki_id": "http://www.wikidata.org/entity/Q593223", "itemLabel": "Gilbertus Anglicus", "itemDescription": "physician", "wikipedia_url": "https://en.wikipedia.org/wiki/Gilbertus_Anglicus", "wikipedia_page": {"main": "Gilbertus Anglicus (or Gilbert of England, also known as Gilbertinus; c. 1180 – c. 1250) was a medieval English physician. He is known chiefly for his encyclopedic work, the Compendium of Medicine (Compendium Medicinæ), most probably written between 1230 and 1250. This medical treatise was an attempt at a comprehensive overview of the best practice in pharmacology, medicine, and surgery at the time. His medical works, alongside those of John of Gaddesden, \"formed part of the core curriculum that underpinned the practice of medicine for the next 400 years\".", "link_mentions": [{"page": "Bartholomeus Anglicus", "response": ["*Gilbertus Anglicus An English physician in France; wrote COMPENDIUM MEDICINAE."]}, {"page": "Trotula", "response": ["Medieval readers of the Trotula texts would have had no reason to doubt the attribution they found in the manuscripts, and so \"Trotula\" (assuming they understood the word as a personal name instead of a title) was accepted as an authority on women's medicine. The physician Petrus Hispanus (mid-13th century), for example, cited \"domina Trotula\" (Lady Trotula) multiple times in his section on women's gynecological and obstetrical conditions. The Amiens chancellor, poet, and physician, Richard de Fournival (d. 1260), commissioned a copy headed \"Incipit liber Trotule sanatricis Salernitane de curis mulierum\" (\"Here begins the book of Trotula, the Salernitan female healer, on treatments for women\").Monica H. Green, “A Handlist of the Latin and Vernacular Manuscripts of the So-Called Trotula Texts.  Part I: The Latin Manuscripts,” Scriptorium 50 (1996), 137-175, at pp. 157-58; and Monica H. Green, Making Women’s Medicine Masculine: The Rise of Male Authority in Pre-Modern Gynaecology (Oxford: Oxford University Press, 2008), p. 331. Two copies of the Latin Trotula ensemble include imaginative portrayals of the author; the pen-and-ink wash image found in an early 14th-century manuscript now held by the Wellcome Library is the most well-known image of \"Trotula\" (see image above).The other image is an historiated initial that opens the copy of the intermediate ensemble in Florence, Biblioteca Laurenziana, Plut. 73, cod. 37, 13th-century (Italy), ff. 2r-41r:  http://www.bml.firenze.sbn.it/Diaita/schede/scheda15.htm.  Both manuscripts are described in Monica H. Green, “A Handlist of the Latin and Vernacular Manuscripts of the So-Called Trotula Texts.  Part I: The Latin Manuscripts,” Scriptorium 50 (1996), 137-175, at pp. 146-47 and 153. A few 13th-century references to \"Trotula,\" however, cite her only as an authority on cosmetics.Monica H. Green, Making Women’s Medicine Masculine: The Rise of Male Authority in Pre-Modern Gynaecology (Oxford: Oxford University Press, 2008), pp. 84-85. The belief that \"Trotula\" was the ultimate authority on the topic of women's medicine even caused works authored by others to be attributed to her, such as a 15th-century Middle English compendium on gynecology and obstetrics based on the works of the male authors Gilbertus Anglicus and Muscio, which in one of its four extant copies was called the Liber Trotularis.Monica H. Green and Linne R. Mooney, “The Sickness of Women”, in Sex, Aging, and Death in a Medieval Medical Compendium: Trinity College Cambridge MS R.14.52, Its Texts, Language, and Scribe, ed. M. Teresa Tavormina, Medieval & Renaissance Texts and Studies, 292, 2 vols. (Tempe, AZ: Arizona Center for Medieval and Renaissance Studies, 2006), vol. 2, pp. 455-568. Similarly, a 14th-century Catalan author entitled his work primarily focused on women's cosmetics Lo libre . . . al qual a mes nom Trotula (\"The Book ... which is called 'Trotula'\").Monica H. Green, “A Handlist of the Latin and Vernacular Manuscripts of the So-Called Trotula Texts.  Part II: The Vernacular Texts and Latin Re-Writings,” Scriptorium 51 (1997), 80-104, at p. 103; and Montserrat Cabré i Pairet, ‘From a Master to a Laywoman: A Feminine Manual of Self-Help’, Dynamis: Acta Hispanica ad Medicinae Scientiarumque Historiam Illustrandam 20 (2000), 371–93, http://www.ugr.es/~dynamis/completo20/PDF/Dyna-12.PDF, accessed 02/14/2014."]}, {"page": "England in the Middle Ages", "response": ["The period produced some influential English scholars. Roger Bacon, a philosopher and Franciscan friar, produced works on natural philosophy, astronomy and alchemy; his work set out the theoretical basis for future experimentation in the natural sciences.Hackett, pp. 9, 16, 19, 20-21. William of Ockham helped to fuse Latin, Greek and Islamic writing into a general theory of logic; \"Ockham's Razor\" was one of his oft-cited conclusions.Normore, p. 31; Spade, p. 101. English scholars since the time of Bede had believed the world was probably round, but Johannes de Sacrobosco estimated the circumference of the earth in the 13th century.Gillingham and Danziger, pp. 234–235. Despite the limitations of medieval medicine, Gilbertus Anglicus published the Compendium Medicinae, one of the longest medical works ever written in Latin.Getz, p.liii; Danziger and Gillingham, p. 9. Prominent historical and science texts began to be translated into English for the first time in the second half of the 14th century, including the Polychronicon and The Travels of Sir John Mandeville.Myers, p. 99. The universities of Oxford and Cambridge were established during the 11th and 12th centuries, drawing on the model of the University of Paris.Cobban, p. 101; Danziger and Gillingham, p. 9."]}, {"page": "Gilbert (given name)", "response": ["* Gilbertus Anglicus or Gilbert of England (c. 1180 – c. 1250), English physician"]}, {"page": "England in the Late Middle Ages", "response": ["The period produced some influential English scholars. Roger Bacon (c. 1214–94), a philosopher and Franciscan friar, produced works on natural philosophy, astronomy and alchemy; his work set out the theoretical basis for future experimentation in the natural sciences. William of Ockham (c. 1287–1347) helped to fuse Latin, Greek and Islamic writing into a general theory of logic; \"Ockham's Razor\" was one of his oft-cited conclusions.;  Despite the limitations of medieval medicine, Gilbertus Anglicus published the Compendium Medicinae, one of the longest medical works ever written in Latin.;  Prominent historical and science texts began to be translated into English for the first time in the second half of the fourteenth century, including the Polychronicon and The Travels of Sir John Mandeville. The universities of Oxford and Cambridge were established during the eleventh and twelfth centuries, drawing on the model of the University of Paris.; "]}, {"page": "Anglicus", "response": ["*Gilbertus Anglicus (1180-1250), English physician"]}, {"page": "John of Gaddesden", "response": ["John of Gaddesden (1280–1361) was a medieval English physician. He wrote a treatise on medicine titled Rosa Medicinae (The Rose of Medicine), also called Rosa Anglica (\"The English Rose\"), between 1304 and 1317, considered to be the first English textbook of medicine. John of Gaddesden was also a Roman Catholic theologian, a fellow at Merton College, Oxford, a physician for members of the British royal family, and one of the most celebrated medical authorities of his time. His medical works, alongside those of Gilbertus Anglicus, \"formed part of the core curriculum that underpinned the practice of medicine for the next 400 years\".", "Gaddesden's book is often spoken of as Rosa Anglica. It is crammed with quotations from Galen, Pedanius Dioscorides, Rufus of Ephesus, Haliabbas, Serapion, Al Rhazis, Avicenna, Averroes, John of Damascus, Isaac, Masawaiyh, Gilbertus Anglicus, and from the Regimen sanitatis Salernitanum; but also contains a good many original remarks which illustrate the character of the author more than his medical knowledge. The book begins with an account of fevers based on Galen's arrangement, then goes through diseases and injuries beginning with the head, and ends with an antidotarium (a treatise on remedies). It contains some remarks on cooking, and innumerable prescriptions, many of which are superstitious, while others prove to be common-sense remedies when carefully considered. He cared for his gains, and boasts of getting a large price from the Barber Surgeons' guild for a prescription of which the chief ingredient is tree frogs (Rosa, ed. Pavia, p. 120). His disposition, his peculiarities, and his reading are so precisely those of the \"Doctour of Phisik\" in Geoffrey Chaucer's prologue that it seems possible that Gaddesden is the contemporary from whom Chaucer drew this character."]}, {"page": "Gilbert the Englishman", "response": ["#REDIRECT Gilbertus Anglicus"]}, {"page": "Gilbert Anglicus", "response": ["#REDIRECTGilbertus Anglicus"]}, {"page": "Joseph Frank Payne", "response": ["In 1903 and 1904 Payne delivered the first FitzPatrick lectures on the history of medicine at the College of Physicians. The first course was on English Medicine in the Anglo-Saxon Times (Oxford, 1904), the second on English Medicine in the Anglo-Norman Period, covering Gilbertus Anglicus and the contents of his Compendium Medicinæ had never before been thoroughly set forth. The lectures of 1904 which Payne was preparing for the press at the time of his death address the writings of Ricardus Anglicanus and the anatomical teaching of the Middle Ages. Payne demonstrated that the Anatomy of the Body of Man, printed in Tudor times and of which the editions extend into the middle of the seventeenth century, was not written by Thomas Vicary, whose name appears on the title-page, but was a translation of a mediæval manuscript."]}, {"page": "Gilbertinus", "response": ["#REDIRECT Gilbertus Anglicus"]}]}}