{"wiki_id": "http://www.wikidata.org/entity/Q5932062", "itemLabel": "Robin Laing", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Robin_Laing", "wikipedia_page": {"main": "Robin Laing (born 1976) is a Scottish actor, best known for his portrayal of Edward Heffron in the HBO series Band of Brothers (2001) and as DI Donald in River City (2012–17).\nBorn in Dundee, Laing began acting at a young age, joining an Arbroath theatre company, performing there in productions such as Trainspotting, portraying the character of Renton. He studied Drama at Fife College.Laing's participation in Band of Brothers led to a friendship with Heffron, whom he played, until Heffron's passing in 2013. Laing played Martin Ness in 2004’s “Shadowplay“, S4:E11&12 of Waking the Dead. He joined the cast of River City in 2012, and would appear regularly on it until 2017, and also appeared on Waterloo Road in a recurring role. Other appearances include in the films Filth (2013) and Outlaw King (2018).Laing resides in London.", "link_mentions": [{"page": "Band of Brothers (miniseries)", "response": ["* Robin Laing as Private First Class Edward \"Babe\" Heffron"]}, {"page": "Murder Rooms: Mysteries of the Real Sherlock Holmes", "response": ["The series follows Sir Arthur Conan Doyle's time as a general practitioner in Southsea, solving mysteries with the help of his mentor, Dr Joseph Bell, who is based in Edinburgh. The series stars Ian Richardson as Dr Joseph Bell, alongside Robin Laing and later Charles Edwards as Sir Arthur Conan Doyle.", "* Robin Laing as Sir Arthur Conan Doyle (in \"The Dark Beginnings of Sherlock Holmes\" only)"]}, {"page": "List of River City characters", "response": ["|DI Craig Donald || Robin Laing"]}, {"page": "List of Waterloo Road characters", "response": ["*Ronnie Fairchild (Robin Laing, series 10), local police officer and Scott's father."]}, {"page": "New Zealand International Film Festival", "response": ["* Robin Laing "]}, {"page": "List of Scottish actors", "response": ["*Robin Laing (born 1976)"]}, {"page": "Edward Heffron", "response": ["Edward James \"Babe\" Heffron (16 May 1923 – 1 December 2013) was a private with E Company, 2nd Battalion, 506th Parachute Infantry Regiment, in the 101st Airborne Division of the United States Army during World War II. Heffron was portrayed in the HBO miniseries Band of Brothers by Robin Laing. Heffron wrote Brothers in Battle, Best of Friends: Two WWII Paratroopers from the Original Band of Brothers Tell Their Story with fellow veteran William \"Wild Bill\" Guarnere and journalist Robyn Post in 2007.", "In the Band of Brothers miniseries Heffron was played by Scottish actor Robin Laing. Heffron appears as himself at the end of episode ten, speaking about the Company, and also makes a brief cameo appearance in the fourth episode, as an unidentified man sitting at a table in Eindhoven and waving a small flag, while Sgt. Floyd Talbert is seen kissing a Dutch woman."]}, {"page": "Arthur Conan Doyle", "response": ["*Robin Laing and Charles Edwards in Murder Rooms: Mysteries of the Real Sherlock Holmes (2000–2001)"]}, {"page": "Lu Kemp", "response": ["| Ruth Gemmell, Mark Bazeley, Simon Ginty, Laura Rees and Robin Laing"]}, {"page": "Kirsty Williams (drama)", "response": ["| Molly Innes, Robin Laing, Louise Ludgate, Steven McNicoll, Stewart Porter and Sally Reid", "| Robin Laing and Natasha Watson", "| Elspeth Brodie, Robin Laing and John Kazek", "| Melody Grove, Candida Benson, Liam Brennan, Robin Laing, Laurie Brown, Meg Fraser, Irene MacDougall, Ralph Riach and Crawford Logan", "| Samuel West, Melody Grove, Ruth Gemmell, Liam Brennan, Natasha Watson, Claire Knight and Robin Laing", "| Liam Brennan, Wendy Seager, Kyle McPhail, David Ireland, Lesley Hart, Simon Tait and Robin Laing", "| Natasha Watson, Frances Grey, Robin Laing, Meg Fraser and Finlay Welsh", "| Jocelyn Brassington, Christine Bottomley, Roderick Gilkison, Robin Laing, Kevin Mains, Anita Vettesse, Dani Heron and Adura Onashile", "| Shauna Macdonald, Meg Fraser, Maryam Hamidi and Robin Laing"]}, {"page": "Eilidh McCreadie", "response": ["| Read by Robin Laing"]}, {"page": "Gaynor Macfarlane", "response": ["| Meg Fraser, Alexandra Mathie, Matthew Pidgeon, Robin Laing, Richard Greenwood, Paul Young, Wendy Seagar, Jimmy Chisholm, Laurie Brown, Grant O'Rourke and John Buick", "| Robin Laing and Meg Fraser", "| Melody Grove, Finn den Hertog, Robin Laing, Liam Brennan, James Anthony Pearson and Rosalind Sydney", "| Shauna Macdonald, Alexandra Mathie, Robert Jack, Robin Laing, Cesare Taurasi, Georgie Glen, Alasdair Hankinson and Karen Bartke", "| Alasdair Hankinson, Simon Donaldson, Robin Laing, Shauna Macdonald, Karen Bartke, Nick Underwood, Kenny Blyth and the Edinburgh Quartet", "| Alasdair Hankinson, Simon Donaldson, Robin Laing, Shauna Macdonald, Karen Bartke, Kenny Blyth and the Edinburgh Quartet", "| Alasdair Hankinson, Simon Donaldson, Robin Laing, Shauna Macdonald, Karen Bartke, Nick Underwood, Kenny Blyth, Finlay Welsh and the Edinburgh Quartet", "| Alasdair Hankinson, Simon Donaldson, Robin Laing, Shauna Macdonald, Karen Bartke, Laurie Brown, Kyle Gardiner and the Edinburgh Quartet"]}, {"page": "Jules Horne", "response": ["| Nicola Jo Cully, Joanna Holden, Robin Laing, Victoria Liddelle, Sandy Nelson and Mark McDonnell"]}, {"page": "Oliver Emanuel", "response": ["| Robin Laing and Natasha Watson", "| Samuel West, Melody Grove, Ruth Gemmell, Liam Brennan, Natasha Watson, Claire Knight and Robin Laing", "| Read by Robin Laing", "| Natasha Watson, Frances Grey, Robin Laing, Meg Fraser and Finlay Welsh", "| Robin Laing and Meg Fraser", "| Jocelyn Brassington, Christine Bottomley, Roderick Gilkison, Robin Laing, Kevin Mains, Anita Vettesse, Dani Heron and Adura Onashile", "| Shauna Macdonald, Meg Fraser, Maryam Hamidi and Robin Laing"]}, {"page": "Guy McCrone", "response": ["In October 2012, Antimacassar City was dramatised in ten parts by Clara Glynn for BBC Radio 4's Woman's Hour, starring Natasha Watson, Ian Brennan, Juliet Cadzow and Robin Laing."]}, {"page": "Shetland (TV series)", "response": ["* Robin Laing as Gavin Laird"]}, {"page": "Waterloo Road (series 10)", "response": ["* Robin Laing as Ronnie Fairchild; Scott's father (5 episodes)"]}, {"page": "Beatrice Colin", "response": ["| Melody Grove, Finn den Hertog, Robin Laing, Liam Brennan, James Anthony Pearson and Rosalind Sydney", "| Shauna Macdonald, Alexandra Mathie, Robert Jack, Robin Laing, Cesare Taurasi, Georgie Glen, Alasdair Hankinson and Karen Bartke"]}]}}