{"wiki_id": "http://www.wikidata.org/entity/Q5930033", "itemLabel": "Hugh Birley", "itemDescription": "British politician (1817-83)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Birley", "wikipedia_page": {"main": "Hugh Birley (21 October 1817 – 7 September 1883) was a British businessman and Conservative politician.\nBirley was born in Blackburn, Lancashire. Following education at Winchester School, he went to India, where he was the head of Birley, Corrie and Company, East India merchants. On his return to England he became a partner in Birley and Company, cotton spinners and also in Charles Macintosh and Company, manufacturers of India rubber goods. \nHe married Mabella Baxendale in 1842, and they had two sons and two daughters. They made their home at \"Moorland\", Didsbury, near Manchester. He was appointed a justice of the peace and Deputy Lieutenant for the County Palatine of Lancaster. He was an active supporter of the Church of England, and assisted in the building of a number of Anglican churches and schools in the Manchester area.\nBirley was granted armorial bearings by the College of Arms, the blazon of which was as follows:\nSable on a fesse engrailed between three boars' heads couped argent, a mascle between three cross crosslets of the field, and for the Crest upon a wreath of the colours a demi-boar rampant sable collared argent the chain reflexed over the back or supporting a branch of wild teazle proper, charged on the shoulder with a millrind argent.At the 1868 general election the representation of the Parliamentary Borough of Manchester was increased to three members of parliament. Birley was elected as the first Conservative MP for the town, alongside the two sitting Liberal Party members, Thomas Bazley and Jacob Bright. He retained his seat at the ensuing elections of 1874 and 1880.\nFor the final years of his life, Birley was in poor health, and travelled to South Africa and Cannes in the south of France in an attempt to recuperate. However, after May 1883 he was too ill to attend parliament. He died at his Didsbury home in September 1883 aged 66.\n\n", "link_mentions": {}}}