{"wiki_id": "http://www.wikidata.org/entity/Q5933103", "itemLabel": "Hugh Wooldridge", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Wooldridge", "wikipedia_page": {"main": "Hugh Wooldridge is an English theatre director, theatre and television producer and writer, and stage lighting designer. Wooldridge was born in Amersham, Bucks, the son of British composer John Wooldridge and actress Margaretta Scott. He is the brother of actress Susan Wooldridge. Wooldridge currently specialises in large productions, often at the Royal Albert Hall, London.  He also teaches, gives master-classes and runs workshops.", "link_mentions": [{"page": "Hawridge", "response": ["* Margaretta Scott English actor of stage, film and television (1912–2005) lived in the village with her husband Composer John Wooldridge, daughter actor Susan Wooldridge and son theatre producer Hugh Wooldridge during the 1950s"]}, {"page": "Wooldridge", "response": ["*Hugh Wooldridge, director, producer"]}, {"page": "Margaretta Scott", "response": ["Scott was married to the English composer John Wooldridge, who was killed in a car accident in 1958. Their daughter, Susan Wooldridge, is also an actress and their son, Hugh Wooldridge is a theatre director and producer."]}, {"page": "Susan Wooldridge", "response": ["Wooldridge was born in London, England, and educated at convent schools, the Central School of Speech and Drama, and L'Ecole Jacques Lecoq, Paris. She is the daughter of actress Margaretta Scott and composer John Wooldridge. Her brother is Hugh Wooldridge."]}, {"page": "List of Old Stonyhursts", "response": ["*Hugh Wooldridge, theatre and television director and producer"]}, {"page": "John Wooldridge", "response": ["Wooldridge's first marriage was in 1942 to Mary Latham, with whom he had a son, Morris Latham, who also became a pilot. The union ended in divorce. He subsequently married the actress Margaretta Scott in 1948, with whom he had a daughter, Susan Wooldridge, who also became an actress; and a son, Hugh Wooldridge."]}, {"page": "Chichester Festival production history", "response": ["*Double Take directed by Hugh Wooldridge"]}, {"page": "Chris Channing", "response": ["* Italian Tour with a British cast (Clive Carter, Anita Dobson, David Cardy, Martin Duncan). Dir Hugh Wooldridge"]}, {"page": "David Firman", "response": ["In London Firman conducted the annual concert series Night of a 1000 Voices at the Royal Albert Hall (director Hugh Wooldridge), and Chess in Concert with Idina Menzel, Josh Groban, Marti Pellow, Kerry Ellis, and Clarke Peters. Firman also conducts the Best of Broadway series at the Royal Albert Hall with the Royal Philharmonic Orchestra, and conducts the orchestra frequently in other venues."]}]}}