{"wiki_id": "http://www.wikidata.org/entity/Q5949661", "itemLabel": "John Fane, 10th Earl of Westmorland", "itemDescription": "Lord Privy Seal", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Fane,_10th_Earl_of_Westmorland", "wikipedia_page": {"main": "John Fane, 10th Earl of Westmorland,  (1 June 1759 – 15 December 1841), styled Lord Burghersh between 1771 and 1774, was a British Tory politician of the late 18th and early 19th centuries, who served in most of the cabinets of the period, primarily as Lord Privy Seal.\n\n", "link_mentions": [{"page": "Postmaster General of the United Kingdom", "response": ["|John Fane, 10th Earl of Westmorland"]}, {"page": "Earl of Westmorland", "response": ["John Fane, 11th Earl of Westmorland, only son of John Fane, 10th Earl of Westmorland, entered the army in 1803, and in 1805 took part in the Hanoverian campaign as aide-de-camp to General Sir George Don. He was assistant adjutant-general in Sicily and Egypt (1806–1807), served in the Peninsular War from 1808 to 1813, was British military commissioner to the allied armies under the Prince of Schwarzenberg, and marched with the allies to Paris in 1814. He was subsequently promoted major general (1825), lieutenant-general (1838) and general (1854), although the latter half of his life was given to the diplomatic service. He was British resident at Florence from 1814 to 1830, and British ambassador at Berlin from 1841 to 1851, when he was transferred to Vienna. In Berlin he had mediated in the Schleswig-Holstein question, and in Vienna he was one of the British plenipotentiaries at the congress of 1855. He retired in 1855, and died at Apethorpe Hall, Northamptonshire, on 16 October 1859. Himself a musician of considerable reputation and the composer of several operas, he took a keen interest in the cause of music in England, and in 1822 made proposals which led to the foundation in the next year of the Royal Academy of Music. His wife Priscilla Anne, daughter of William Wellesley-Pole, 3rd Earl of Mornington, was a distinguished artist.", "*John Fane, 10th Earl of Westmorland (1759–1841)"]}, {"page": "Earl of Jersey", "response": ["His son, the fourth Earl, was a politician and served as Vice-Chamberlain of the Household, as Master of the Buckhounds and as Captain of the Honourable Band of Gentlemen Pensioners. He was succeeded by his son, the fifth Earl. He was a Tory politician and served as Lord Chamberlain of the Household and as Master of the Horse. Lord Jersey married Sarah Sophia (died 1867), daughter of John Fane, 10th Earl of Westmorland, and his wife Sarah Anne (died 1793), daughter of Robert Child. Through this marriage the private bank Child & Co. came into the Villiers family."]}, {"page": "John Ponsonby, 4th Earl of Bessborough", "response": ["John Ponsonby married Lady Maria Fane, daughter of John Fane, 10th Earl of Westmorland, and Sarah Anne Child, on 16 November 1805 at Berkeley Square, London. They had eight sons and six daughters. Their daughter Lady Emily Charlotte Mary remained unmarried but she wrote a number of novels which were published without attribution. Through his daughter Lady Augusta Gore, Bessborough was the grandfather of sportsman Spencer Gore, who won the first Wimbledon singles title in 1877, and the Rt. Rev. Charles Gore, the Bishop of Oxford."]}, {"page": "List of knights and ladies of the Garter", "response": ["| John Fane, 10th Earl of Westmorland"]}, {"page": "Osterley Park", "response": ["Robert Child's only daughter, Sarah Anne Child, married John Fane, 10th Earl of Westmorland in 1782. When Child died two months later, his will placed his vast holdings, including Osterley, in trust for any second-to-be born grandchild. This proved to be Lady Sarah Sophia Fane, who was born in 1785."]}, {"page": "The Earl of Westmorland", "response": ["#REDIRECT John Fane, 10th Earl of Westmorland"]}, {"page": "Henry Paget, 1st Earl of Uxbridge (second creation)", "response": ["* Hon. Sir Arthur Paget (1771–1840), who married Lady Augusta Parker, the daughter of John Fane, 10th Earl of Westmorland and former wife of John Parker, 1st Earl of Morley, in 1809."]}, {"page": "Spike Island, County Cork", "response": ["In 1789, Colonel Charles Vallancey of the Corps of Irish Engineers, who had been made responsible for the fortification of the harbour during the American war, persuaded the then Lord Lieutenant John Fane, 10th Earl of Westmorland to allow the construction of a permanent fortification on Spike Island. This work was undertaken by the Irish Board of Ordnance. In October 1790, the Earl visited the island and named the incomplete structure Fort Westmorland. In 1793, France declared war on Britain and a conflict began which, with one interlude, would occupy the next two decades. "]}, {"page": "George Child Villiers, 5th Earl of Jersey", "response": ["Lord Jersey married Lady Sarah Sophia Fane, daughter of John Fane, 10th Earl of Westmorland, on 23 May 1804. She was the eldest grandchild and heiress of Robert Child, principal shareholder of the banking firm Child & Co. Lord Jersey added the surname Child to the Villiers surname by royal licence in 1819. Lady Jersey was one of the great hostesses of English society, a leader of the ton during the Regency era and the reign of George IV, and a patroness of Almack's. Lord Jersey was an ardent fox hunter and a breeder and trainer of horses, owning two Epsom Derby winners, in Mameluke (1827) and Bay Middleton (1836) as well as other notable thoroughbreds such as Glencoe. His wife's numerous love affairs did not trouble him: asked why he had never fought a duel to protect her honour, he replied that he could hardly fight every man in London.Ridley, Jasper   Lord Palmerston  Constable London 1970 p.42"]}, {"page": "George Villiers, 4th Earl of Jersey", "response": ["*George Child Villiers, 5th Earl of Jersey (1773–1859), married Sarah Sophia Fane daughter of John Fane, 10th Earl of Westmorland, and Sarah Anne Child, only child of Robert Child, the principal shareholder in the banking firm Child & Co."]}, {"page": "John Fane, 11th Earl of Westmorland", "response": ["Styled Lord Burghersh from birth, he was born at Sackville Street, Piccadilly, London, the son of John Fane, 10th Earl of Westmorland, by his wife Sarah Child, daughter and heiress of the wealthy banker Sir Robert Child, builder of Osterley Park. His sister was the well known social hostess Sarah Villiers, Countess of Jersey, and his uncle was William Lowther, 1st Earl of Lonsdale, a Tory magnate from northern England. He was educated at Cheam School and then at Harrow from 1797 to 1799. Burghersh was admitted to Trinity College, Cambridge on 28 January 1802 and received an M.A. in 1808."]}, {"page": "Lord Lieutenant of Northamptonshire", "response": ["*John Fane, 10th Earl of Westmorland, 5 July 1828 – 15 December 1841."]}, {"page": "Brympton d'Evercy", "response": ["In the mid-19th century, Brympton d'Evercy was the home of Lady Georgiana Fane, the daughter of John Fane, 10th Earl of Westmorland, a single lady of modest means who had no need of a large and lavish household. The house was not given the Victorian wings added so carelessly to many historic houses. Lady Georgiana confined herself to improving the gardens and grounds. She added a balustrade to the walls enclosing the forecourt in front of the west facade; the walls, topped by balustrading, link the Priest House, the churchyard on the south side, and the clock-tower and stables on the north. The effect was to create what in a grander house than Brympton d'Evercy would be known as a cour d'honneur. Entered through great gate piers crowned by urns (see the illustration at the top of page), such an effect is softened and de-formalised by lawns and some very English-style flower beds. The broad gravel terrace across the south front was also created at this time, along with the large pond which reflects it. Other than necessary restoration work and modern plumbing and electricity, little has been added to the house since the 19th century. It is now recognised by English Heritage as a grade I listed building."]}, {"page": "Frances Villiers, Countess of Jersey", "response": ["*George Child Villiers, 5th Earl of Jersey (1773–1859), married Sarah Sophia Fane daughter of John Fane, 10th Earl of Westmorland and Sarah Anne Child, only child of Robert Child, the principal shareholder in the banking firm Child & Co."]}, {"page": "List of Old Carthusians", "response": ["*John Fane, 10th Earl of Westmorland (1759–1841), Lord-Lieutenant of Ireland, 1789–1794, and Lord Privy Seal, 1798–1827"]}, {"page": "Sarah Villiers, Countess of Jersey", "response": ["She was the eldest daughter of John Fane, 10th Earl of Westmorland, and Sarah Anne Child. Her younger sister Maria married John Ponsonby, Viscount Duncannon, later the 4th Earl of Bessborough, a brother of Lady Caroline Lamb."]}, {"page": "Sarah Fane, Countess of Westmorland", "response": ["She was the only child of Robert Child, the owner of Osterley Park and principal shareholder in the banking firm Child & Co, and Sarah Child. She married John Fane, 10th Earl of Westmorland, on 20 May 1782 at Gretna Green after they eloped together. Her parents were dissatisfied with the match: Sarah Anne being an only child, her father wanted her to marry a commoner who would take the Child name; but Sarah Anne told her mother, \"A bird in the hand is worth two in the bush.\"\"Osterley Park\" in: Lydia Greeves, Houses of the National Trust, National Trust Books, 2008, , p. 238 Her father would leave no capital to her or any eldest child,John Fane, 10th Earl of Westmorland (1759-1841), Politician\", National Portrait Gallery  leaving his house and fortune to the (any) second child of Sarah Anne, instead of the likely Westmorland primogeniture heir-to-be."]}, {"page": "Frederick Ponsonby, 3rd Earl of Bessborough", "response": ["* John Ponsonby, 4th Earl of Bessborough (1781–1847); married Lady Maria Fane (daughter of John Fane, 10th Earl of Westmorland) on 16 November 1805. They had 14 children. "]}, {"page": "Child & Co.", "response": ["By 1782, Child's grandson Robert Child was the senior partner in the firm. However, when he died in 1782 without any sons to inherit the business, he did not want to leave it to his only daughter, Sarah Anne Child, because he was furious over her elopement with John Fane, 10th Earl of Westmorland earlier in the year.  To prevent the Earls of Westmorland from ever acquiring his wealth, he left it in trust to his daughter's second surviving son or eldest daughter.  This turned out to be Lady Sarah Sophia Fane, who was born in 1785. Between the death of Robert Child in 1782 and until 1793, the bank was managed by his widow, Sarah Child. Her and Robert's granddaughter Sarah Sophia Fane married George Child-Villiers, 5th Earl of Jersey in 1804, and upon her majority in 1806 she became senior partner.  She exercised her rights personally until her death in 1867.  At that point the Earl of Jersey & Frederick William Price of Harringay House were appointed as the two leading partners. Ownership continued in the Jersey family until the 1920s."]}, {"page": "John Ponsonby, 5th Earl of Bessborough", "response": ["Born in London, Ponsonby was the eldest son of John Ponsonby, 4th Earl of Bessborough, and his wife Lady Maria Fane, third daughter of John Fane, 10th Earl of Westmorland. He was a cricketer in his youth and played five first-class matches for Marylebone Cricket Club (MCC) in the 1830s.Cricket Archive"]}, {"page": "Boodle's", "response": ["*John Fane, 10th Earl of Westmorland, KG, PC (1759–1841)"]}]}}