{"wiki_id": "http://www.wikidata.org/entity/Q594155", "itemLabel": "Reuben Noble-Lazarus", "itemDescription": "British footballer (born 1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Reuben_Noble-Lazarus", "wikipedia_page": {"main": "Reuben Courtney Noble-Lazarus (born 16 August 1993) is an English-born Grenadian professional footballer who currently plays for FC Halifax Town. On 30 September 2008, he became the youngest player to debut in the English Football League, at 15 years and 45 days old, breaking the record previously established by Albert Geldard in 1929.In the 2013–14 season, Noble-Lazarus spent time on loan at Scunthorpe United from Barnsley. In 2014, Noble-Lazarus moved to Rochdale on loan until January 2015, but made a permanent transfer to them at the end of his loan spell for an undisclosed fee.", "link_mentions": [{"page": "Reuben", "response": ["* Reuben Noble-Lazarus (born 1993), English professional footballer"]}, {"page": "Barnsley F.C.", "response": ["The team were relegated to the Second Division in 2002; administration threatened the existence of the club as Barnsley suffered greatly due to the ITV Digital crisis. A late purchase by Barnsley's then mayor, Peter Doyle, saved the club from folding. In 2006, the side won in the play-off final at the Millennium Stadium in Cardiff, where they beat Swansea City 4–3 on penalties to earn promotion to the Championship. The manager at this time was Andy Ritchie, who was in his first season in charge after replacing Paul Hart. The team struggled in their first season back in the Championship. In November 2006, with Barnsley in the relegation zone, Ritchie was sacked in favour of Simon Davey, who managed to steer the team away from relegation in the second half of the season, and the eventually finished 20th. The following season, Barnsley reached the semi-final of the FA Cup, beating Premier League side Liverpool 2–1 at Anfield and defending champions Chelsea 1–0; the team lost 1–0 against fellow Championship side Cardiff City at Wembley in the semi-final. In October 2008, the club fielded the youngest player in the Football League's history when Reuben Noble-Lazarus came on against Ipswich Town aged 15 years and 45 days.", "* Youngest ever Football League player: Reuben Noble-Lazarus, 15 years and 45 days"]}, {"page": "Football records and statistics in England", "response": ["*Youngest player: Reuben Noble-Lazarus, 15 years and 45 days (for Barnsley v. Ipswich Town, 30 September 2008)"]}, {"page": "Cameron Jerome", "response": ["Jerome was born in Huddersfield, West Yorkshire, and is of Grenadian descent. As a youth, Jerome played for Stile Common, alongside Anthony Griffith, Fraizer Campbell, and Reuben Noble-Lazarus; who all went on to enjoy careers as professional players. Griffith and Jerome also played for Yorkshire Counties. Jerome later joined home town club Westend Juniors before moving on to Huddersfield Town as a junior, then moved on via Grimsby Town, Sheffield Wednesday and Middlesbrough to gain a contract at Cardiff City, after being recommended by reserve team manager Paul Wilkinson. Jerome played under Wilkinson in Grimsby's youth system, but after Wilkinson left Blundell Park to take up his position with Cardiff in October 2003, Jerome was released by replacement Neil Woods for being a disruptive influence."]}, {"page": "History of Barnsley F.C.", "response": ["A notable feat was achieved in 2008–09, when manager Simon Davey fielded the youngest ever player in the history of the Football League. Reuben Noble-Lazarus was just 15 years and 45 days old, when he came on as a substitute against Ipswich Town at Portman Road."]}, {"page": "Anthony Griffith (footballer)", "response": ["As a youth, Griffith played for Stile Common, alongside Cameron Jerome, Fraizer Campbell, and Reuben Noble-Lazarus; who all went on to enjoy careers as professional players. Griffith and Jerome also played for Yorkshire Counties."]}, {"page": "Ken Roberts (footballer, born 1936)", "response": ["Roberts made his Football League debut for Wrexham in 1951, when aged just 15 years and 158 days old, equalling the 1929 record of Bradford Park Avenue's Albert Geldard for the youngest League player. This record stood until beaten by Reuben Noble-Lazarus of Barnsley in 2008."]}, {"page": "Albert Geldard", "response": ["Albert Geldard (11 April 1914 – 19 October 1989) was an English professional footballer who played as an outside right for Bradford Park Avenue, Everton, Bolton Wanderers and Darwen. At Everton he won the FA Cup Final in 1933. He made four appearances for England during 1933–1937. At Bradford Park Avenue; he became known as the youngest player to appear in the Football League, a distinction shared jointly with Ken Roberts until Reuben Noble-Lazarus took the record in 2008."]}, {"page": "2008–09 Barnsley F.C. season", "response": ["The team received a boost the following month when Colace's work permit was finally granted, along with the return to fitness of both Heinz Muller and Anderson, who had been out injured for seven months. The club also made history in their away game at Ipswich Town on 30 September when they fielded striker Reuben Noble-Lazarus, who became the Football League's youngest ever player at 15 years and 45 days; beating a record which had stood since 1929.", "Goals from Jon Stead, Owen Garvan and Iván Campo heaped the pressure upon Barnsley manager Simon Davey. The main talking point of the match, however, was Reuben Noble-Lazarus who came off the bench to become the Football League's youngest ever player at 15 years and 45 days."]}, {"page": "Noble-Lazarus", "response": ["#redirect Reuben Noble-Lazarus"]}, {"page": "2011–12 Barnsley F.C. season", "response": ["|Reuben Noble-Lazarus"]}, {"page": "2012–13 Barnsley F.C. season", "response": ["|24||Reuben Noble-Lazarus||CF/WG||||Huddersfield||||34||1||Academy||29 September 2008||Trainee||2015", "|FW||||24||Reuben Noble-Lazarus||1||0||0||1", "|24||||FW||Reuben Noble-Lazarus||1||0||0||0||0||0||1||0"]}, {"page": "2012–13 Sheffield Wednesday F.C. season", "response": ["The last few days before the end of March, and the Easter weekend relegation clashes against Barnsley and Bristol City, saw the end of the emergency loan window. Having just lost two-key players of Michail Antonio and Connor Wickham, along with the possibility of Giles Coke being out for a longer amount of time, manager ave Jones made three loan signings over the last two-days of the emergency loan window. Firstly, Hull City experienced midfielder Seyi Olofinjana was signed until the end-of-the-season, and then one of Bolton Wanderers' star men, Stuart Holden, signed for one-month having just come back from injury and looking for some game time. Then just a few-minutes later it was confirmed forward Steve Howard had been signed for the rest of the season on loan from bottom of League One side Hartlepool United. The signing of Howard was by far the strangest as the 36-year-old has been unable to even break into the Hartlepool side, who were bottom of the league below Sheffield Wednesday. The Easter weekend came and the Owls faced local rivals and also a mighty relegation battle against Barnsley, who were in very good form. It was seen as the biggest game of the season so far, with the crowd amounting to the highest attendance of the season so far at Hillsborough. The game started with both teams fired-up and looking for the win. Leroy Lita had an early goal correctly disallowed for offside, while the same then happened to Marlon Harewood at the other end, however he did not hit the target. Lita then had a goal mouth scramble eventually cleared away by Barnsley. Both teams had cancelled each other out in the first half and although they were both giving it their all in this clash, they both somehow needed to find more in order to try to get a winner. Into the second half and substitute Reuben Noble-Lazarus had a long-distance shot very well saved by Chris Kirkland. Another substitute by Barnsley, Jason Scotland, then had a chance as his shot was also well saved by Kirkland. Then soon after at the other end of the pitch, good link up play between Jermaine Johnson and Lewis Buxton saw a cross into the box met by Gary Madine who tapped home a vital Sheffield Wednesday goal to give them the lead. Madine then had several shots within a few-seconds saved and blocked when there was another goal-mouth scramble in the box. Then with just over ten-minutes to go, plus stoppage time, a free-kick taken by Miguel Llera was launched into the box and Réda Johnson headed home to give Wednesday a fantastic two-goal lead. With six-minutes to go the Owls were then wrongly given a penalty for handball. Gary Madine stepped up but very poorly ended-up putting the ball wide. Three-minutes later and Lewis Buxton failed to stay ten-yards away when Barnsley were given a free-kick just outside the area. Buxton was shown a second yellow-card and was sent-off. There was six-minutes added time and in the second Jacob Mellis volleyed a ball into the far-corner to give Barnsley a chance of gaining something from the game. However, it was not to be and the game ended with a great chance for Barnsley just going wide, however the chance had been given as offside anyway."]}, {"page": "Hakeeb Adelakun", "response": ["He made 28 appearances and scored 2 goals in the 2013–14 season as Scunthorpe won promotion back to League One. On 30 November, he scored his first goal for Scunthorpe in a 3–1 home win over Torquay United, coming on for Reuben Noble-Lazarus in the 55th minute and scoring the last goal five minutes later. He was named EFL League One Player of the Month in December 2017."]}, {"page": "Jordan Allan", "response": ["In April 2013, Allan made his debut for Scottish club Airdrie United as a substitute against Livingston in a 2–0 defeat. Still a pupil at Calderside Academy and aged just 14 years and 189 days, Allan became the youngest player to represent a first team in the Scottish Football League, and Britain, breaking the record previously established by Reuben Noble-Lazarus in January 2008."]}, {"page": "2013–14 Barnsley F.C. season", "response": ["|24||Reuben Noble-Lazarus||CF/WG||||Huddersfield||||47||3||Academy||29 September 2008||Trainee||2015", "|24||FW||Reuben Noble-Lazarus||1||0||0||1"]}, {"page": "2014–15 Rochdale A.F.C. season", "response": ["| 11 ||  || Reuben Noble-Lazarus                      || MF || 0 || 1 || 0 || 0 || 1"]}, {"page": "2014–15 Barnsley F.C. season", "response": ["|19||Reuben Noble-Lazarus||WG/CF||||Huddersfield||||49||3||Academy||29 September 2008||Trainee||2015"]}]}}