{"wiki_id": "http://www.wikidata.org/entity/Q5941546", "itemLabel": "Humphrey Ocean", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Humphrey_Ocean", "wikipedia_page": {"main": "Humphrey Ocean  (born 22 June 1951) is a contemporary British painter.\n\n", "link_mentions": [{"page": "June 22", "response": ["*  1951   – Humphrey Ocean, English painter and academic"]}, {"page": "Ian Dury", "response": ["Dury formed Kilburn and the High Roads (a reference to the road in North West London) in 1971, and they played their first gig at Croydon School of Art on 5 December 1971. Dury was vocalist and lyricist, co-writing with pianist Russell Hardy and later enrolling into the group a number of the students he was teaching at Canterbury College of Art (now the University for the Creative Arts), including guitarist Keith Lucas (who later became the guitarist for 999 under the name Nick Cash) and bassist Humphrey Ocean."]}, {"page": "Somerville College, Oxford", "response": ["Somerville's is the one Oxford dining hall where all portraits show women. They were painted by Michael Noakes, Herbert James Gunn, George Percy Jacomb-Hood, William Coldstream, John Whittall, Francis Helps, Claude Rogers, Humphrey Ocean, Thomas Leveritt and Richard Twose."]}, {"page": "Stiff Records", "response": ["* Humphrey Ocean and the Hardy Annuals"]}, {"page": "10cc", "response": ["The Original Soundtrack, which was already complete, was released just weeks later. It was both a critical and commercial success and featured distinctive cover art created by the Hipgnosis team and drawn by musician and artist Humphrey Ocean. It is also notable for its opening track, Godley & Creme's \"Une Nuit A Paris (One Night in Paris)\", an eight-minute, multi-part \"mini-operetta\" that is thought to have been an influence on \"Bohemian Rhapsody\" by Queen."]}, {"page": "Kent Institute of Art & Design", "response": ["* Humphrey Ocean, artist"]}, {"page": "Kilburn and the High Roads", "response": ["Dury formed Kilburn and the High Roads in 1970. The band consisted of Ian Dury as lead vocalist and lyricist, pianist Russell Hardy, guitarist Edward \"Ted\" Speight (later replaced by Keith Lucas), bassist Charlie Hart (later replaced by Humphrey Ocean and later by Charley Sinclair),  saxophonist George Khan (later replaced by Davey Payne) and drummer Chris Lucas (replaced by Terry Day and later by David Newton-Rohoman, who used crutches). The band performed their first gig in 1971 and were regulars on the pub rock scene by 1973. The Kilburns also supported the Who on their Quadrophenia tour of late 1973.", "Davey Payne followed Dury into the Blockheads. Keith Lucas (as Nick Cash) went on to form punk band 999. Humphrey Ocean recorded a one-off single for Stiff Records in 1978, written by Dury. ", "* Humphrey Ocean – bass "]}, {"page": "List of British artists", "response": ["* Humphrey Ocean (born 1951)"]}, {"page": "1984 in art", "response": ["* Humphrey Ocean – Philip Larkin"]}, {"page": "Absolutely (Madness album)", "response": ["The inner sleeve features a London Underground-style roundel for a railway station called \"Cairo East\" on one side (this roundel later reappeared in the video for \"(Waiting For) The Ghost Train\") and a history of the group on the other. The \"Cairo East\" roundel is illustrated by painter, and former bass player with Kilburn and the High Roads, Humphrey Ocean.", "* Humphrey Ocean – inner sleeve illustration"]}, {"page": "1982 in art", "response": ["* John Player Portrait Award: Humphrey Ocean"]}, {"page": "BP Portrait Award", "response": ["*1982 – Humphrey Ocean"]}, {"page": "1951 in art", "response": ["* June 22 – Humphrey Ocean, born Butler-Bowdon, English painter"]}, {"page": "The Original Soundtrack", "response": ["The artwork was designed by Hipgnosis and illustrated by artist Humphrey Ocean."]}, {"page": "Ray Lowry", "response": ["A retrospective of Ray Lowry's work was held at the Idea Generation Gallery, London, from 18 June to 4 July 2010, in aid of The Ray Lowry Foundation. As part of the exhibition Tracey Emin, Nick Hornby, Billy Childish, Harry Hill, Paul Simonon, Humphrey Ocean and 23 others contributed works and many produced reinterpretations of Ray Lowry's sleeve for London Calling (see above) in aid of the Foundation.Ray Lowry: London Calling, Idea Generation Gallery"]}, {"page": "Ten More Turnips from the Tip", "response": ["Dury's brother-in-law Jake Tilson designed the album's sleeve and booklet. Fans contributed a number of the items and tickets pictured within it amongst various paintings, including one by Ian Dury himself (of Chaz Jankel), Ian by Peter Blake and Lady & Beast Adorned by Terry Day. Jock Scot, Sophy Dury and Humphrey Ocean (a former member of Kilburn and the High Roads, Dury's pub rock band in the mid 1970s) were responsible for other pieces while the front featured a photograph of Dury as a child, in a pram being pushed by his father William Dury, with their dog Bella.", "*Humphrey Ocean - drawing (\"Ian\"), painting (\"Ian\")"]}, {"page": "Memory Almost Full", "response": ["*Humphrey Ocean – cover art front: black love chair (aquatint) and cover art back: black love chair (gouache)"]}, {"page": "Harry Pye", "response": ["Pye was born in London. He completed a foundation course at Camberwell School of Art in 1991. He then studied printmaking at Winchester School of Art from 1992 to 1995. In his second year he stopped painting and printmaking and began making films. His first films were interviews with artist and tutor Bruce McLean, and he has since interviewed many other artists including Humphrey Ocean, Jake and Dinos Chapman, Wolfgang Tillmans, and Keith Tyson for various publications including The Face, Turps Banana, and Untitled. He has also edited and published numerous art based fanzines of his own, such as \"Harry Pye's FRANK Magazine\", which ran from 1995 to 2000."]}, {"page": "Be Stiff", "response": ["\"Be Stiff\" was also produced in London in limited quantities on clear and yellow vinyl, released at the same time as five colored vinyl versions of \"Whoops-a-Daisy\" by Stiff Records artist Humphrey Ocean and the Hardy Annuals."]}, {"page": "David Fisher (artist)", "response": ["David Fisher (1946 – 21 March 2013) was an award-winning English artist and designer based in Midsomer Norton, Somerset.  He was a prolific designer and painter of pub signs before securing a unique commission to create vast murals to improve UK service stations. He has won many awards including the Holburne Museum of Art's portrait award.  His work has been praised by Victoria Glendinning, Humphrey Ocean RA and John Leighton, Director of the National Galleries of Scotland.", "In 2008 he won the Holburne Museum of Art's biennial portrait competition for Dead Man Posing, a portrait of Philip Ledbury from Frome, an artist who had been diagnosed with leukaemia.  The prize was a commission of £5,000 for a portrait to be added to the Holburne's collection of portraiture.  The panel of judges included the author Victoria Glendinning, John Leighton, Director of the National Galleries of Scotland and the artist Humphrey Ocean RA. They presented the award to him at a ceremony on 17 October."]}, {"page": "List of Royal Academicians", "response": ["| Humphrey Ocean ||align=\"center\" |  2004  || Professor of Perspective 2012–2020"]}, {"page": "Emer O'Brien", "response": ["In 2008 O'Brien's work was selected by Humphrey Ocean for the Royal Academy Summer Exhibition."]}, {"page": "Stiff Records discography", "response": ["|Humphrey Oceanthe Hardy Annuals"]}, {"page": "Alan Kane (artist)", "response": ["In 2009 Kane was commissioned by Artangel to produce Life Class, a series of life-drawing classes which aired on Channel 4 and were hosted by John Berger, Judy Purbeck, Maggi Hambling, Gary Hume and Humphrey Ocean. "]}]}}