{"wiki_id": "http://www.wikidata.org/entity/Q5941633", "itemLabel": "Humphrey T. Davies", "itemDescription": "British translator of Arabic fiction", "wikipedia_url": "https://en.wikipedia.org/wiki/Humphrey_T._Davies", "wikipedia_page": {"main": "Humphrey T. Davies (6 April 1947 – 12 November 2021) was a British translator of Arabic fiction, historical and classical texts. Born in Great Britain, he studied Arabic in college and graduate school. He has worked for decades in the Arab world and been based in Cairo since the late 20th century. He has translated at least 18 Arabic works into English, including contemporary literature. He is a two-time winner of the Banipal Prize.", "link_mentions": [{"page": "Muhammad Aladdin", "response": ["* In October 2009, his story New Lover, Young Lover was published in the American A Public Space  in its Cairo portfolio, it was translated by Humphrey T. Davies (The Yacoubian Building, Gate of the Sun (Novel)), and was first published in Arabic in November 2009 by the Egyptian Supreme Council for Culture in a special anthology titled \"The Best Egyptian Short Stories."]}, {"page": "Humphrey Davies", "response": ["#REDIRECT Humphrey T. Davies"]}, {"page": "List of Arabic-English translators", "response": ["*Humphrey T. Davies"]}, {"page": "Mohamed Mustagab", "response": ["As a writer, he published his first short story in the pages of al-Hilal magazine in 1968. He published several volumes of fiction, including novels and short stories. His most noted work is The Secret History of Numan Abd al-Hafiz (1984). This short novel won the Egyptian State Incentive Award and was selected as one of the top 100 Arabic novels by the Arab Writers Union. It has been translated into English by Humphrey T. Davies, and was included in Tales of Dayrut (AUC Press, 2008), the only book-length work by Mustagab available in English translation. It was also turned into a play and staged in Cairo in 2001."]}, {"page": "Khaled al-Berry", "response": ["Khaled al-Berry (born 1972) is an Egyptian writer. He studied medicine at Cairo University, but moved to London soon after graduation. He has lived there ever since. He is best known for his autobiography The World is More Beautiful than Heaven, which was translated into English by Humphrey T. Davies. He has also written several novels, including An Oriental Dance which was nominated for the Arabic Booker Prize."]}, {"page": "Leg Over Leg", "response": ["Leg Over Leg is a book by Ahmad Faris Shidyaq, considered one of the founders of modern Arabic literature. Detailing the life of 'the Fariyaq', the alter ego of the author, offering commentary on intellectual and social issues, it is described as \"always edifying and often hilarious\", \"the finest, wildest, funniest and most surprising novel in Arabic\", and \"[an] unclassifiable book\". It was originally published in 1855 in Arabic in Paris. In 2014, there was an English translation by Humphrey T. Davies published by NYU Press."]}, {"page": "Deaths in November 2021", "response": ["*Humphrey T. Davies, 74, British translator.Remembering Humphrey Davies"]}]}}