{"wiki_id": "http://www.wikidata.org/entity/Q5945129", "itemLabel": "Max Walters", "itemDescription": "English botanist and conscientious objector (1920-2005)", "wikipedia_url": "https://en.wikipedia.org/wiki/Max_Walters", "wikipedia_page": {"main": "Stuart Max Walters (born Oughtibridge, Sheffield, Yorkshire 23 May 1920 – died Grantchester, Cambridgeshire 11 December 2005) was a British botanist and academic.  As a conscientious objector in the Second World War, he worked as a hospital orderly in Sheffield and Bristol. He was Curator of the Herbarium, Botany School, University of Cambridge 1949–73, Lecturer in Botany 1962–73, and for the ten years up until his retirement, 1973–83, Director of the University Botanic Garden in Cambridge, of which he wrote a history. He was a Research Fellow at St John's College, Cambridge 1948-51 and Fellow of King's College, Cambridge 1964–84.\nHe was the author of numerous books on plants and flowers, most notably the 1964 Atlas of the British Flora (with Franklyn Perring) and as a co-editor of Flora Europaea. He wrote two well-known books for the New Naturalist library, Wild Flowers (1954, co-written with John Gilmour) and Mountain Flowers (1956, with John Raven). He was much involved in the research and management of Wicken Fen.  After his retirement, he wrote a biography of Darwin's teacher and friend, John Stevens Henslow, Darwin's mentor (2001).\nWalters was a committed Christian who was much involved both in the local life of the Church of England (he was a churchwarden at Grantchester for many years) and in the application of Christian principles to national and social life: he was a Christian socialist and also a Christian pacifist, and as such was a leading member of the Fellowship of Reconciliation and also active in the Campaign for Nuclear Disarmament.", "link_mentions": [{"page": "New Naturalist", "response": ["|John Gilmour and Max Walters", "|John Raven and Max Walters", "|Max Walters"]}, {"page": "Cambridge University Botanic Garden", "response": ["In 1921 the University appointed H. Gilbert-Carter as the first scientific Director of the Garden, in conjunction with the curatorship of the herbarium and who published the first guide to the garden. Amongst other directors of the garden were John Gilmour (1951–1973), and Max Walters (1973–1983) who published a history of the garden in 1981. The current director is Beverley Glover (2013–) (see list)."]}, {"page": "Flora Europaea", "response": [":Max Walters (1920–2005) – Director, Cambridge University Botanic Garden"]}, {"page": "Category talk:Academics of the University of Cambridge", "response": ["Max Waltersnot yet classified"]}, {"page": "Walters (surname)", "response": ["* Max Walters (1920–2005), British botanist and academic"]}, {"page": "Atlas of the British Flora", "response": ["The Atlas of the British Flora is a book by Franklyn Perring and S. Max Walters, published by the Botanical Society of the British Isles."]}, {"page": "John Raven", "response": ["*Mountain Flowers (with Max Walters), Collins 1956   "]}, {"page": "List of the largest genera of flowering plants", "response": ["Part of the disparity in genus sizes is attributable to historical factors. According to a hypothesis published by Max Walters in 1961, the size of plant genera is related to the age, not of the taxon itself, but of the concept of the taxon in the minds of taxonomists. Plants which grew in Europe, where most of the early taxonomy was based, were therefore divided into relatively small genera, while those from the tropics were grouped into much larger and more heterogeneous genera. Likewise, plants which shared common medicinal properties, such as the many species of Euphorbia, were united into a single genus, while plants of diverse uses, such as the grasses, were split into many genera. Where there were many classical names for groups of plants, such as in Apiaceae / Umbelliferae or Brassicaceae / Cruciferae, small genera were defined, whereas groups not subdivided by classical authors remained as larger genera, such as Carex. A number of biological factors also influence the number of species. For instance, the occurrence of apomixis allows the recognition of large numbers of agamospecies, and such taxa have helped to bolster genera such as Ranunculus and Potentilla."]}, {"page": "Stuart Max Walters", "response": ["#REDIRECT Max Walters"]}, {"page": "John Gilmour (botanist)", "response": ["On returning to Cambridge, Gilmour succeeded Humphrey Gilbert-Carter as director in 1951, he was an important force in the development of the Eastern Garden, once the Cory Fund monies became available, and the Cory Laboratory and glasshouses were constructed in 1957. His scientific contributions were largely in the field of systematics and horticulture, playing an important role in the Systematics Association. When he retired in 1973 he was succeeded by Max Walters."]}, {"page": "Noel Farnie Robertson", "response": ["In Cambridge Robertson and his wife rented a flat in a house near the Cambridge University Botanic Garden in Brookside. Max Walters and his wife Lorna rented an adjacent flat. Robertson and Walters shared a love of horticulture and natural history and Robertson developed his thinking about the importance of botanic gardens in informing the public about, and in the teaching of, botany."]}, {"page": "Franklyn Perring", "response": ["At the outbreak of the Second World War, Perring was sent to boarding school at Earls Colne Grammar School in Essex. There, his biology master, CJ Sims, encouraged his interests. Following national service in the army, which he spent in Ireland, Malaya and India, Perring enrolled for a degree in natural sciences at Queens' College, Cambridge. He remained there to study for a PhD on the ecology and biogeography of plants of chalk grassland. At Cambridge that he developed a lifelong friendship with his supervisor, the biologist Max Walters, who was then curator of the university herbarium.", "In October 1954, Perring was given the job of assisting Max Walters who, himself, had been appointed by the BSBI to coordinate an ambitious five-year scheme to map the incidence of all vascular plant species across the British Isles; a project covering some 3,500 map squares, each measuring 10 km by 10 km. Perring designed different recording cards for each region of the country, and led field-recording trips to ensure the under-recorded parts of Britain were covered, sometimes travelling by train and bicycle to reach the remotest parts, and personally assisted Professor D. A. Webb with his efforts to cover the republic of Ireland. Perring also managed the inputting of data onto punched cards, and coordinated the then quite innovative application of a tabulator to print maps mechanically from punched cards. Perring subsequently became the director of the BSBI recording scheme in 1959."]}, {"page": "S. M. Walters", "response": ["#REDIRECT Max Walters"]}, {"page": "Director, Cambridge University Botanic Garden", "response": ["* Max Walters (1973)"]}, {"page": "Donald Pigott", "response": ["Professor  Christopher Donald Pigott (born 1928) is a British botanist and was the fourth Director, Cambridge University Botanic Garden  (1984–1995), succeeding Max Walters.", "Donald Pigott was educated at Cambridge (1946–) where he was taught by two previous Directors, Humphrey Gilbert-Carter (1921–1950) and Max Walters (1973–1983). Forming a friendship with the latter he was persuaded to spend the summer of 1949 in Uppsala and Helsinki universities where he was impressed by the mapping of the Scandinavian flora and returned to work with Walters on similar projects for the British Isles and used this method in his PhD thesis on Thyme. Under Professor Harry Godwin he also worked on the design of the Botanic Garden's ecological mound."]}, {"page": "S M Walters", "response": ["#REDIRECT Max Walters"]}]}}