{"wiki_id": "http://www.wikidata.org/entity/Q5951924", "itemLabel": "John Parish Robertson", "itemDescription": "Scottish merchant and author", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Parish_Robertson", "wikipedia_page": {"main": "John Parish Robertson (1792–1843) was a Scottish merchant and author,", "link_mentions": [{"page": "John Robertson", "response": ["*John Parish Robertson (1792–1843), Scottish merchant and author"]}, {"page": "Battle of San Lorenzo", "response": ["José Gervasio Artigas, leader of the popular resistance at the Banda Oriental, sent an agent to San Lorenzo to congratulate San Martín for his victory. San Martín also met with John Parish Robertson, who informed Britain about the battle."]}, {"page": "Llavallol", "response": ["In 1825 on the initiative of Bernardino Rivadavia and John Parish Robertson a Scottish colony was established in the zone. The first contingent of Scots left the port of Leith in May 1825. There were 43 marriages with 78 children and 14 women and 42 single men. Among them were doctors, surveyors, builders, architects and artisans, as well as farmers and ranchers. They arrived in Buenos Aires in August 1825."]}, {"page": "Robertson (surname)", "response": ["*John Parish Robertson (1792–1843), Scottish merchant and author"]}, {"page": "Tevego", "response": ["The Scottish writer and merchant John Parish Robertson, who lived in Paraguay and worked closely with de Francia, mentions in his book Francia's Reign of Terror, Being the Continuation of Letters On Paraguay, that Tevego"]}, {"page": "Gilbert Ramsay", "response": ["Ramsay was born in Ayrshire, Scotland, son of  David Ramsay and Jane Blain. He was educated at the University of Glasgow. In 1825 he arrived at the port of Buenos Aires from Scotland. In Buenos Aires, Ramsay was hired by brothers John Parish Robertson and  William Parish Robertson, to teach in the Scottish Colony established in the town of Monte Grande (Buenos Aires Province). He was married on 17 March 1827 in St. Andrew's Church to Janet Tweedie (1805-1855), a Scottish lady, daughter of John Tweedie and Janet Tweedi."]}, {"page": "J. G. Robertson", "response": ["'Jack' Robertson was born in Valparaíso in Chile in 1859,1939 England and Wales Register for John G Robertson, Kent, Ancestry.com  the son of Fanny Adrienne nee Harrington (1826–1919) and William Parish Robertson (1823–1864), a merchant. A great-nephew of the merchant and author John Parish Robertson, he studied at the Royal Academy of Music.Stone, David. J. G. Robertson, Who Was Who in the D'Oyly Carte Opera Company, 25 December 2013, accessed 5 September 2020"]}]}}