{"wiki_id": "http://www.wikidata.org/entity/Q5951293", "itemLabel": "Huw Thomas", "itemDescription": "British politician (1927-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/Huw_Thomas", "wikipedia_page": {"main": "Hywel Gruffydd Edward \"Huw\" Thomas (14 September 1927 – 12 March 2009) was a Welsh broadcaster, barrister and Liberal Party politician.", "link_mentions": [{"page": "Gray's Inn", "response": ["Having existed for over 600 years, Gray's Inn has a long list of notable members and honorary members. Names of many members can be found in the List of members of Gray's Inn. Even as the smallest of the Inns of Court it has had members who have been particularly noted lawyers and judges, such as Francis Bacon, The 1st Earl of Birkenhead, Baron Slynn, Lord Bingham of Cornhill, Lord Hoffmann and Baroness Hale of Richmond, the first female Justice of the Supreme Court. Outside the Bar and judiciary of England and Wales, members have included the clergy (including five Archbishops of Canterbury),Douthwaite (1886) p. 195 industrialists like John Wynne, astronomers such as John Lee, media figures, like Huw Thomas, and members of the Bar, judiciary and Government of other nations, such as Sir Ti-liang Yang (former Chief Justice of the Supreme Court of Hong Kong), B. R. Ambedkar (principal architect of the Constitution of India), Leslie Goonewardene (founder of Sri Lanka's first political party, the Lanka Sama Samaja Party) and also former presidents of Cyprus Spyros Kyprianou, Tassos Papadopoulos, and Glafcos Clerides."]}, {"page": "Llanelli", "response": ["*Huw Thomas (1927–2009), ITN newscaster"]}, {"page": "First Men in the Moon (1964 film)", "response": ["* Huw Thomas* as announcer"]}, {"page": "Hugh Thomas", "response": ["* Huw Thomas (1927–2009), Welsh broadcaster, barrister and Liberal politician"]}, {"page": "ITV News", "response": ["The unique, probing reporting style of Robin Day caused shock among politicians, finding themselves questioned continually for information – this had never been the case with the BBC. ITN also boasted the first British female newsreader, Barbara Mandell, in 1956. Into the 1960s, reporters such as George Ffitch, Alastair Burnet, Gordon Honeycombe, Huw Thomas and Sandy Gall emerged as aspiring newscasters, under the leadership of editor Geoffrey Cox."]}, {"page": "Ellesmere College", "response": ["* Huw Thomas – broadcaster, ITN newscaster, barrister and Liberal Party politician"]}, {"page": "ITV Weekend News", "response": ["*Huw Thomas (1960–1964)"]}, {"page": "Thomas (surname)", "response": ["*Huw Thomas (1927–2009), Welsh broadcaster, barrister and Liberal politician"]}, {"page": "List of ITV journalists and newsreaders", "response": ["* Huw Thomas – Joined ITN in 1956"]}, {"page": "2009 in Wales", "response": ["*12 March - Huw Thomas, broadcaster, lawyer and politician, 81"]}, {"page": "Deaths in March 2009", "response": ["*Huw Thomas, 81, Welsh broadcaster."]}, {"page": "List of members of Gray's Inn", "response": ["The Honourable Society of Gray's Inn, commonly known simply as Gray's Inn, is one of the four Inns of Court in London. To be called to the Bar and practise as a barrister in England and Wales, an individual must belong to one of these Inns. Having existed for over 600 years, members of Gray's Inn include many noted lawyers and judges, such as Francis Bacon, Baron Slynn, Lord Bingham of Cornhill, Lord Hoffmann and others. Outside the Bar and judiciary of England and Wales, members have included the clergy (including five Archbishops of Canterbury), industrialists like John Wynne, astronomers such as John Lee, media figures, like Huw Thomas, and members of the Bar and judiciary of other nations, such as Yang Ti-liang (former Chief Justice of the Supreme Court of Hong Kong) and Aitzaz Ahsan (former president of the Supreme Court Bar Association of Pakistan). As well as full members, the Inn also offers honorary membership to particularly distinguished members of society. During the Second World War, for example, both Franklin D. Roosevelt and Winston Churchill became honorary Benchers, and therefore members. Other than honorary members, this list only contains those individuals who were called to the Bar, not those who simply joined but left before qualifying."]}, {"page": "The Ghost Goes Gear", "response": ["* Huw Thomas as News presenter"]}]}}