{"wiki_id": "http://www.wikidata.org/entity/Q5958997", "itemLabel": "Sonu Shamdasani", "itemDescription": "British author, editor, and professor", "wikipedia_url": "https://en.wikipedia.org/wiki/Sonu_Shamdasani", "wikipedia_page": {"main": "Sonu Shamdasani (born 1962) is a London-based author, editor, and professor at University College London. His research and writings focus on Carl Gustav Jung (1875-1961), and cover the history of psychiatry and psychology from the mid-nineteenth century to current times.\nShamdasani edited the first publication of Jung's major work: Liber Novus, The Red Book. Although its title had been well known for years, it was not until 2009 that its contents were revealed to the public and practicing psychotherapists.", "link_mentions": [{"page": "Kundalini", "response": ["In the introduction to Jung's book The Psychology of Kundalini Yoga, Sonu Shamdasani puts forth \"The emergence of depth psychology was historically paralleled by the translation and widespread dissemination of the texts of yoga... for the depth psychologies sought to liberate themselves from the stultifying limitations of Western thought to develop maps of inner experience grounded in the transformative potential of therapeutic practices. A similar alignment of \"theory\" and \"practice\" seemed to be embodied in the yogic texts that moreover had developed independently of the bindings of Western thought. Further, the initiatory structure adopted by institutions of psychotherapy brought its social organization into proximity with that of yoga. Hence, an opportunity for a new form of comparative psychology opened up.\""]}, {"page": "Carl Jung", "response": ["Jung left no posthumous instructions about the final disposition of what he called the Liber Novus or the Red Book. Sonu Shamdasani, an historian of psychology from London, tried for three years to persuade Jung's resistant heirs to have it published. Ulrich Hoerni, Jung's grandson who manages the Jung archives, decided to publish it when the necessary additional funds needed were raised through the Philemon Foundation.  Up to mid-September 2008, fewer than two dozen people had ever seen it.", "* Sonu Shamdasani – leading researcher into Jung and editor of his work", "* Sonu Shamdasani, Cult Fictions, ", "* Sonu Shamdasani, Jung and the Making of Modern Psychology: The Dream of a Science, ", "* Sonu Shamdasani, Jung Stripped Bare, "]}, {"page": "Maurice Nicoll", "response": ["In 1917 Nicoll published his first non-fiction monograph, Dream Psychology, the \"First didactic presentation of Jung's psychology,\" according to the Jungian scholar Sonu Shamdasani."]}, {"page": "Analytical psychology", "response": ["Jung was an adept principally of the American philosopher William James, founder of pragmatism, whom he met during his trip to the United States in 1909. He also encountered other figures associated with James, such as John Dewey and the anthropologist, Franz Boas. Pragmatism was Jung's favoured route to base his psychology on a sound scientific basis according to historian Sonu Shamdasani.. His theories consist of observations of phenomena, and according to Jung it is phenomenology. In his view psychologism was suspect. Throughout his writings, Jung sees in empirical observation not only a precondition of an objective method but also respect for an ethical code which should guide the psychologist, as he stated in a letter to Joseph Goldbrunner: ", "Jungian Sandplay started as a therapeutic method in the 1950s. Although its origin has been credited to a Swiss Jungian analyst, Dora Kalff it was in fact, her mentor and trainer, Dr. Margaret Lowenfeld, a British paediatrician, who had developed the Lowenfeld World Technique inspired by the writer H. G. Wells in her work with children,H. G. Wells' Floor Games has been regarded as a precursor not only of learning through play but also of nonverbal child psychotherapy. See Barbara A. Turner's 2004 edition, published by Temenos Press of Coverdale, CA. using a sand tray and figurines in the 1930s.Sandplay History – Techniques developed from Lowenfeld's World Technique  Retrieved, 28 June 2009 Jung had witnessed a demonstration of the technique while on a visit to the UK in 1937. Kalff saw in it potential as a further application of analytical psychology. Encouraged by Jung, Kalff developed the new application over a number of years and called it Sandplay.Archived at Ghostarchive and the Wayback Machine:  From 1962 she began to train Jungian Analysts in the method including in the United States, Europe and Japan. Both Kalff and Jung believed an image can offer greater therapeutic engagement and insight than words alone. Through the sensory experience of working with sand and objects, and their symbolic resonance new areas of awareness can be brought into consciousness, as in dreams, which through their frames and storyline can bring material into consciousness as part of an integrating and healing process. The historian of psychology, Sonu Shamdasani has commented:", "Since its inception, analytical psychology has been the object of criticism, emanating from the psychoanalytic sphere. Freud himself characterised Jung as a \"mystic and a snob\". In his introduction to the 2011 edition of Jung's \"Lectures on the Theory of Psychoanalysis\", given in New York City in 1912, Sonu Shamdasani contends that Freud orchestrated a round of critical reviews of Jung's writings from Karl Abraham, Jung's former colleague at the Burghölzli hospital, and from the early Welsh Freudian, Ernest Jones. Such criticisms multiplied during the 20th century, focusing primarily on the \"mysticism\" in Jung's writings. Other psychoanalysts, including Jungian analysts, objected to the cult of personality around the Swiss psychiatrist. It reached a crescendo with Jung's perceived collusion with Nazism in the build-up and during World War II and is still a recurrent theme. Thomas Kirsch writes: \"Successive generations of Jungian analysts and analysands have wrestled with the question of Jung's complex relations to Germany.\" Other considered evaluations come from Andrew Samuels and from Robert Withers.Samuels, A., (1985). Jung and the Post-Jungians. London: Routledge and Kegan Paul. "]}, {"page": "The Interpretation of Dreams", "response": ["The philosopher Mikkel Borch-Jacobsen and the psychologist Sonu Shamdasani noted in The Freud Files (2012) that the Swiss psychiatrist Eugen Bleuler wrote to Freud in October 1905 that he was convinced of the correctness of The Interpretation of Dreams as soon as he read it. They argued, however, that Freud's analysis of the dream of Irma's injection was partly based on Belgian psychologist Joseph Delboeuf's analysis of a dream in Sleep and Dreams. In their view, The Interpretation of Dreams should be placed in the context of the \"introspective hypnotism\" practiced by figures such as Auguste Forel, Eugen Bleuler, and Oskar Vogt. They charged Freud with selectively citing some authors on dreams (including Marie-Jean-Léon, Marquis d'Hervey de Saint Denys and Louis Ferdinand Alfred Maury), ignoring others (including Jean-Martin Charcot, Pierre Janet, and Richard von Krafft-Ebing), and systematically avoiding \"citing the passages in the works of his predecessors which came closest to his own theories.\""]}, {"page": "Sabina Spielrein", "response": ["Spielrein sometimes is regarded as having been the inspiration for Jung's conception of the anima, in part due to a reference Jung made 50 years later in Memories, Dreams, Reflections—the biographical memoir compiled and edited by Aniela Jaffé—to an imaginatively encountered interior feminine voice that awakened his awareness of the interior anima. He recounted, it was \"the voice of a patient ... who had a strong transference to me\". This interpretation of Spielrein as the voice of Jung's anima is found in, Kerr, John, A Most Dangerous Method, 502-7. However, in the unpublished transcript of Jung's comments recorded by Aniela Jaffé in 1957, Jung made it clear this woman was Maria Moltzer and not Spielrein.Carl G. Jung Protocols, Library of Congress; this is also documented in, Sonu Shamdasani, Cult Fictions: C.G. Jung and the Founding of Analytical Psychology (London: Routledge, 1998), 16, 57ff. Nonetheless, Lance Owens has documented that the relationship with Spielrein was indeed crucial to Jung's evolving understanding of what he much later termed the anima.Owens, Lance S., Jung in Love: The Mysterium in Liber Novus, 27ff."]}, {"page": "Anti-Oedipus", "response": ["Some of Guattari's diary entries, correspondence with Deleuze, and notes on the development of the book were published posthumously as The Anti-Oedipus Papers (2004).Guattari (2004). The philosopher Mikkel Borch-Jacobsen and the psychologist Sonu Shamdasani wrote that rather than having their confidence shaken by the \"provocations and magnificent rhetorical violence\" of Anti-Oedipus, the psychoanalytic profession felt that the debates raised by the book legitimated their discipline. Joshua Ramey wrote that while the passage into Deleuze and Guattari's \"body without organs\" is \"fraught with danger and even pain ... the point of Anti-Oedipus is not to make glamorous that violence or that suffering. Rather, the point is to show that there is a viable level of Dinoysian [sic] experience.\" The philosopher Alan D. Schrift wrote in The Cambridge Dictionary of Philosophy (2015) that Anti-Oedipus was \"read as a major articulation of the philosophy of desire and a profound critique of psychoanalysis.\""]}, {"page": "Studies on Hysteria", "response": ["At the time of its release, Studies on Hysteria tended to polarise opinion, both within and outside by the medical community.Ernest Jones, The life and Work of Sigmund Freud (1964) p. 223-4 While many were critical, Havelock Ellis offered an appreciative account, while a leading Viennese paper would characterise the work as “the kind of psychology used by poets”.Ernest Jones, The life and Work of Sigmund Freud (1964) p. 224 Studies on Hysteria received a positive review from psychiatrist Eugen Bleuler, although Bleuler nevertheless suggested that the results Freud and Breuer reported could have been the result of suggestion. The philosopher Mikkel Borch-Jacobsen and the psychologist Sonu Shamdasani comment that Studies on Hysteria gave Freud, \"a certain local and international notoriety\". Borch-Jacobsen and Shamdasani write that, contrary to what Freud and Breuer claimed, Freud \"always knew that the treatment of Bertha Pappenheim...had not been an unmitigated success\"."]}, {"page": "Totem and Taboo", "response": ["Dominique Bourdin wrote that in Totem and Taboo Freud \"develops an idea that clearly embarrasses the current psychoanalysts, but that is essential to the logic of Freudian thought: that of Phylogenetics\". The philosopher Mikkel Borch-Jacobsen and the psychologist Sonu Shamdasani argued that in Totem and Taboo Freud applied to history \"the same method of interpretation that he used in the privacy of his office to 'reconstruct' his patients' forgotten and repressed memories\"."]}, {"page": "Moses and Monotheism", "response": ["The philosopher Mikkel Borch-Jacobsen and the psychologist Sonu Shamdasani argued that in Moses and Monotheism Freud applied to history \"the same method of interpretation that he used in the privacy of his office to 'reconstruct' his patients' forgotten and repressed memories.\" The Anglican theologian Rowan Williams stated that Freud's accounts of the origins of Judaism are \"painfully absurd\", and that Freud's explanations are not scientific but rather \"imaginative frameworks\"."]}, {"page": "Richard Noll", "response": ["The most significant academic criticism of Noll's scholarship and conclusions came from the historian of psychology Sonu Shamdasani. In his 1998 book Cult Fictions, Shamdasani disputed the attribution and interpretation of a central item of documentary evidence adduced by Noll, and also challenged the claim that Jung established a 'cult'.Sonu Shamdasani, Cult Fictions: C. G. Jung and the Founding of Analytical Psychology (London: Routledge, 1998) p. 107 However, documents deposited by Noll in 2014 in the Cummings Center for the History of Psychology in Akron, Ohio, reveal that prior to the publication of Noll's book in September 1994 Shamdasani and John Kerr held nearly identical views to Noll's concerning the cult hypothesis, the importance of Jung's deification experiences, and the interpretation of the contested document as authored by Jung. Shamdasani's letter to Noll of 29 July 1992 and Princeton University Press editor Eric Rohmann's fax to Shamdasani dated 11 March 1994 in the Cummings archives document this. Both Shamdasani and Kerr pressured Noll and the editors of Princeton University Press to remove the document prior to the publication of the book. \"We cannot ask Richard to remove this document simply because you have also read it and interpreted it as being what Richard presents it as, i.e., the inaugural address at the Zurich Psychological Club,\" wrote Rohmann to Shamdasani. Having lost this battle, Shamdasani later argued that the document was actually authored by Jung's associate Maria Molzer. However, Noll himself had previously raised this as a possible alternative interpretation."]}, {"page": "Active imagination", "response": ["In partial answer to this critique, James Hillman and Sonu Shamdasani discuss at length the dangers of viewing active imagination solely as an expression of personal content.  They propose the technique is easily misunderstood and misdirected when applied to the strictly biographical, and should never be used to bridge the personal with the dead.  Instead, they suggest, active imagination in Jung's usage was an exposition of the unvoiced influences of the collective unconscious, shedding the terminology of psychology to work directly through mythic images:"]}, {"page": "The Discovery of the Unconscious", "response": ["Psychiatrist Anthony Stevens made use of Ellenberger's concept of \"creative illness\", a rare condition whose onset usually occurs after a long period of intense intellectual work, in his account of Jung. Historian Paul Robinson wrote that The Discovery of the Unconscious paved the way for much of the criticism of Freud that followed in the 1980s. Historian of science Roger Smith called the book \"a magisterial - and readable - historical study\". Psychologist Louis Breger considered the book \"extremely valuable\". He credited Ellenberger with placing Freud's work in context, as well as with providing illuminating discussions of Adler, Jung, and Janet. Philosopher Mikkel Borch-Jacobsen and psychologist Sonu Shamdasani called the book a \"monumental work\"."]}, {"page": "Sarah Kofman", "response": ["*\"'It's Only the First Step That Costs',\" in Sonu Shamdasani & Michael Münchow (eds.), Speculations After Freud: Psychoanalysis, Philosophy, Culture (London & New York: Routledge, 1994). From: \"Il n'y a que le premier pas qui coûte\": Freud et la spéculation  (1991)."]}]}}