{"wiki_id": "http://www.wikidata.org/entity/Q5958960", "itemLabel": "Kelvin Fletcher", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Kelvin_Fletcher", "wikipedia_page": {"main": "Kelvin Warren Fletcher (born 17 January 1984) is an English actor, model, racing driver and presenter.  He played Andy Sugden in the ITV soap opera Emmerdale, a role he played from 1996 until 2016. In 2019, Fletcher won the seventeenth series of Strictly Come Dancing with his professional partner Oti Mabuse.\n\n", "link_mentions": [{"page": "Patrick Stewart", "response": ["Stewart is an avid car enthusiast, and is regularly seen at Silverstone during British Grand Prix weekends. He conducted the podium interview with the top three finishers in the 2017 Canadian Grand Prix. On a 2003 appearance on Top Gear, he set a lap time of 1 minutes and 50 seconds on the \"Star in a Reasonably Priced Car\" feature. He holds a Motorsport UK competition licence and competed in the 2012 Silverstone Classic Celebrity Challenge race, finishing ninth, 3 m 02.808 s behind winner Kelvin Fletcher. During 2012, Stewart met his racing hero Stirling Moss for the BBC Two documentary Racing Legends.BBC Two's Racing Legends page. Retrieved 27 February 2013."]}, {"page": "Emmerdale", "response": ["The Sugdens and their relatives, the Merricks and the Skilbecks, were at the centre of the show during the series' first two decades in the 1970s and 1980s (the Emmerdale Farm era). The Sugdens, owners of Emmerdale Farm, were its first family. Many of its members, and those of the Merrick and Skilbeck families, have left or been killed off since the mid-1990s. Sugdens remaining in the village include Jack's daughter, Victoria Sugden (Isabel Hodgins), her son Harry, and Jack's adoptive son Andy's (Kelvin Fletcher) daughter Sarah (Katie Hill).", "| Butler’s Farm ||  || Acquired by Andy Sugden (Kelvin Fletcher) and Katie Addyman (Sammy Winward) in 2003, before the Barton family take the farm over in 2009. || Brookland Farm"]}, {"page": "Jay Kay", "response": ["Kay competed in the Celebrity Challenge race at the 2012 Silverstone Classic, finishing third behind AC/DC vocalist Brian Johnson and actor Kelvin Fletcher."]}, {"page": "Strictly Come Dancing", "response": ["| style=\"background:gold;\"| Kelvin Fletcher", "|Kelvin Fletcher & Oti Mabuse", "On 13 February 2019, professional dancer Pasha Kovalev announced that he was leaving the show after competing on it for eight years. On 10 April 2019, it was announced that judge Darcey Bussell had left the show after seven years. On 22 July 2019, Motsi Mabuse was announced as the replacement for Bussell. On 30 July 2019, it was announced that Nancy Xu would be joining the cast of professional dancers. On 5 September 2019, it was announced that Jamie Laing had withdrawn from the show due to a foot injury. He was later replaced by Kelvin Fletcher. In late October, Will Bayley left the competition due to a sustained leg injury.", "| Kelvin Fletcher", "|Kelvin Fletcher", "| Rachel Stevens Ali Bastian Harry Judd Jason Donovan Denise Van Outen Abbey Clancy Kellie Bright Ore Oduba Debbie McGeeKelvin Fletcher Maisie SmithJohn Whaite", "The biggest margin of points awarded between two individual judges' scores is 5, awarded to Jason Wood and Kylie Jones for their Rumba (2,5,7,5), Christopher Parker and Hanna Karttunen for their Tango (2,6,7,6), Fiona Phillips and Brendan Cole for their Rumba (1,2,6,4), Gary Rhodes and Karen Hardy for their Cha-Cha-Cha (1,5,6,5), Scott Maslen and Natalie Lowe for their Rumba (4,9,7,8), Mark Benton and Iveta Lukosiute for their Cha-Cha-Cha (3,8,8,7), Scott Mills and Joanne Clifton for their Samba (2,5,7,5,6 - with the higher vote given by Donny Osmond), Ann Widdecombe and Anton Du Beke for their American Smooth in the 2018 Christmas Special (2,6,7,7) and Dan Walker and Nadiya Bychkova for their American Smooth (4,8,8,9). The biggest margin between two total scores in one week is 27, occurring in the third week of the seventeenth series when Kelvin Fletcher and Oti Mabuse scored 38 and Anneka Rice and Kevin Clifton scored 11.", "Alexandra Burke and her partner Gorka Márquez and Ashley Roberts and her partner Pasha Kovalev share the record of most 10s awarded to a couple, with 32. This is followed by Faye Tozer and Giovanni Pernice with 31, then Rose Ayling-Ellis and Giovanni Pernice with 30, then Karim Zeroual and Amy Dowden with 29, then Ricky Whittle and Natalie Lowe and John Whaite and Johannes Radebe each with 28. However, if the four tens given by Darcey Bussell during her tenure as a fifth judge are removed, Whittle is behind Oti Mabuse and her respective celebrity partners Danny Mac and Kelvin Fletcher, both with 26 tens, and Rachel Stevens with Vincent Simone and Harry Judd with Aliona Vilani with 25 each. They are followed by Natalie Gumede and Artem Chigvintsev and Ore Oduba and Joanne Clifton with 24 each, Caroline Flack and Pasha Kovalev with 23, Abbey Clancy and Aljaž Škorjanec and Debbie McGee and Giovanni Pernice with 22, Kara Tointon and Artem Chigvintsev with 21 and Lisa Snowdon and Brendan Cole, Kimberley Walsh and Pasha Kovalev and Denise van Outen and James Jordan with 20.League table for Celebrities scoring 10s  Ultimate Strictly Of the above pairings, Snowdon and Cole, Flack and Kovalev, Tozer and Pernice and Roberts and Kovalev are the only pairings to receive straight tens for all of their dances in their respective series finals. Flack and Kovalev, Tozer and Pernice and Roberts and Kovalev are the only pairs to receive three sets of perfect 40s in the final. Of these couples, Roberts and Kovalev and Flack and Kovalev also hold the records for the judges longest consecutive streak of 40s, with four, both stretching from the second performance of the semi-final to the end of the final. Meanwhile, Pernice holds the record for the most 10s received by a professional, with 98, whilst Ayling-Ellis holds the record for the most 10s received by a series champion, with 30.", "| Lisa Snowdon & Brendan Cole Ricky Whittle & Natalie LowePamela Stephenson & James JordanHarry Judd & Aliona VilaniKelvin Fletcher & Oti Mabuse  Karim Zeroual & Amy Dowden AJ Odudu & Kai Widdrington", "| Rachel Stevens & Vincent SimoneKara Tointon & Artem ChigvintsevChelsee Healey & Pasha KovalevJay McGuiness & Aliona VilaniKelvin Fletcher & Oti Mabuse AJ Odudu & Kai Widdrington John Whaite & Johannes Radebe", "| Jason Donovan & Kristina Rihanoff Denise van Outen & James Jordan Louis Smith & Flavia Cacace Natalie Gumede & Artem Chigvintsev Caroline Flack & Pasha KovalevKellie Bright & Kevin Clifton Ore Oduba & Joanne CliftonDanny Mac & Oti MabuseAshley Roberts & Pasha Kovalev Faye Tozer & Giovanni PerniceKelvin Fletcher & Oti MabuseBill Bailey & Oti Mabuse Maisie Smith & Gorka MárquezRose Ayling-Ellis & Giovanni Pernice John Whaite & Johannes Radebe"]}, {"page": "Jack Sugden", "response": ["Jack faces more grief when he learns of Joe's death in a car crash in Spain in June 1995 and is inconsolable and is unable to attend the funeral due to a bad back. Jack and Sarah's marriage is tested when Jack has a fling with Sarah’s friend and Jack's former stepniece, Rachel Tate (Glenda McKay) but they reconcile. The Sugdens adopt Andy Hopwood (Kelvin Fletcher) a school friend of Robert (now Christopher Smith). By the end of the 1990s, Jack and Sarah's marriage is in trouble again when Jack suggests Robert and Andy work on the farm rather than attend school and money problems worsen. They take in a lodger, Richie Carter (Glenn Lamont) and Sarah, feeling neglected, begins an affair with Richie and leaves Jack. Sarah gets custody of Victoria (now Hannah Midgley) and Jack gets custody of Robert and Andy. Andy sets the barn on fire to help Jack claim on the insurance but the plan goes wrong when Sarah is killed and Jack is arrested as the chief suspect. Andy comes clean to Richie about the fire and begs him to change his statement and he agrees, resulting in Jack's freedom."]}, {"page": "Dancing with the Stars", "response": ["Series 17, 2019: Kelvin Fletcher & Oti Mabuse"]}, {"page": "North Chadderton School", "response": ["* Kelvin Fletcher, actor in Emmerdale"]}, {"page": "Catchphrase (British game show)", "response": ["The 2020 STV Children's Appeal Special was only broadcast in Central and Northern Scotland on STV, as part of the stations' annual charity appeal. It featured Kelvin Fletcher, Steph McGovern and Tom Allen."]}, {"page": "Viv Hope", "response": ["In 1997, Viv unsuccessfully tries to stop Kelly running away with Tom Bainbridge, a teacher whom she has an affair with. Viv blames Terry when Donna collapses after drinking alcopops and moves back into the post office.She also starts a campaign against Andy Hopwood (Kelvin Fletcher) at school and tries to seduce Paddy Kirk (Dominic Brunt), but he rejected Viv's advances."]}, {"page": "Andy Sugden", "response": ["Andrew “Andy” Sugden (also Hopwood) is a fictional character from the British ITV soap opera, Emmerdale, played by Kelvin Fletcher. He made his first on-screen appearance on 4 July 1996. Andy is the son of Billy Hopwood (David Crellin)  and Trisha Hopwood and the adoptive son of Jack Sugden (Clive Hornby) and Sarah Sugden (Alyson Spiro)."]}, {"page": "Robert Sugden", "response": ["During his first stint, Robert has embarked on a longstanding feud with his brother Andy (Kelvin Fletcher) after discovering he started the fire that killed their mother Sarah (Alyson Spiro). Their rivalry led to the events of Robert having an affair with Andy's wife Katie (Sammy Winward), whom he later cheated on by sleeping with her rival Sadie King (Patsy Kensit), and culminated with him causing the tragic death of Max (Charlie Kemp) after the pair tried to kill each other by running the other down in their own vehicle. Robert subsequently left the village to avoid going to prison for Max's death, but came back briefly for Jack's funeral in February 2009.", "In 1996, Robert befriends Andy Hopwood (Kelvin Fletcher), a boy the same age in the care of the local authority whilst his father Billy (David Crellin) is in prison for robbery and manslaughter. Robert takes Andy to a local quarry where Andy traps his foot under a rock. Robert runs to get help and Biff Fowler (Stuart Wade) rescues Andy. When Andy's grandmother (Beatrice Kelly) dies, Jack and Sarah (now Alyson Spiro) foster him so he moves in with the Sugdens. Andy and Robert take Donna Windsor (Verity Rushworth) joyriding in Leeds, causing a feud between the Sugdens and Windsors. After a while, Robert begins to resent Andy's presence and is unhappy at having to share his home and belongings. Despite this, Robert defends Andy when he is bullied by Donna and punches her. Donna's friend Chelsea Campbell (Elizabeth Ingram), who had been encouraging her to bully Andy, convinces her to get revenge on Robert and gets Donna to help her beat Robert up in the school playground. Chelsea is expelled from school and Donna is temporarily suspended and warned it will be permanent if she does it again. She makes amends with both Robert and Andy after this.", "Karl Davies's reign as Robert increased the character's popularity as well as establishing the character as a sex symbol. Much of Davies's time on Emmerdale centred upon his long-standing feud with adoptive brother Andy Sugden (Kelvin Fletcher), which was used by Emmerdale producers to compete with rival soap opera EastEnders. His popular relationships with Donna Windsor, Andy's wife Katie Sugden and Debbie Dingle, established him as a bad boy, but the storyline which saw him leave his love interest Elaine Marsden for dead in a car accident, led to him being described as \"an out-and-out villain\" by critics. In mid–2005 it was announced that either Robert or Andy Sugden. Max King (Charlie Kemp) would be killed in a car accident that would take place in October of that year. The decision to kill off one character came after actor Charlie Kemp quit the show and producers decided to have Karl Davies written out of the soap. The episode which took place on 2 October 2005 saw Max killed while in Andy's land rover, after he grabbed the wheel when Andy and Robert began driving towards each other at high speed after Andy thwarted Robert's plan to escape the village with Andy's daughter Sarah and Sarah's mother Debbie Dingle. The following episode saw Robert leave the serial to avoid trouble with the police."]}, {"page": "Zak Dingle", "response": ["In 2001, Zak discovers he has testicular cancer, confiding in long-time friend Seth Armstrong (Stan Richards), although Seth originally gets the wrong idea. Zak decides to not get treatment but Seth, his son Sam (James Hooton) and nephew Marlon (Mark Charnock) kidnap him and force him to come to his senses, he goes to hospital.  As soon as he recovers, domestic harmony is shattered when his elderly mother, Peg (Jeanne Hepple), comes to stay. Zak blames Peg for the death of his father, Jed (Richard Mayes), believing she murdered him but when she reveals that Jed deserted them, they declare a truce. Zak later finds a dying Jed, who tells him of a fortune in Chile. Zak leaves to find the fortune, much to the shock of his family and in his absence, Lisa becomes close to Eddie Hope but realizes she still loves Zak and they reconcile on his return. Zak attacks Andy Sugden (Kelvin Fletcher) when he learns he is having an affair with his granddaughter Debbie (Charley Webb). When Debbie gives birth to a daughter, Sarah, Zak and Lisa help Debbie but she gives Sarah to Emily Kirk (Kate McGregor) as she is not ready to be a mother. Zak's youngest son, Sam (James Hooton), returns with his fiance, Alice Wilson (Ursula Holden-Gill) and they are expecting a child. Sam and Alice marry but Alice develops cancer and dies shortly after their son, Samson (Bradley Milnes) is born. Zak and the family rally round to help Sam."]}, {"page": "Sam Dingle", "response": ["Sam worked at Butler's Farm, helping with Jo Stiles' (Roxanne Pallett) goats but Andy Sugden (Kelvin Fletcher) sold them and, annoyed at Sam and Jo's friendship, fired him. Sam also got a job at Eric Pollard's (Chris Chittell) factory shortly before Eric planned to sell it to the Kings. Eric let his employees believe he was simply going out of business. When he told Sam he wished the factory would go up in smoke, Sam took him literally so he and Eli set fire to the factory. While Andy was away, Sam spent more and more time helping Jo out at the farm. For the first time since Alice, he was falling in love. Lisa Dingle (Jane Cox) tried to warn him off, but Sam ignored her, hoping he might have a chance. A few days later, Jo invited Sam for dinner, which he misconstrued as a date. She told him how much she liked him but was shocked when he went to kiss her. Gently, she told him that she didn't feel that way about him and tried to comfort him with a hug but Andy saw them. Sam left but Andy confronted them and beat them both up, putting Jo in hospital again with broken ribs. Lisa, his father Zak Dingle (Steve Halliwell), and uncle Shadrach Dingle (Andy Devine) saw his bruises and after treating his cuts, warned him to stay away from Jo and Andy. Zak also told Andy that while Sam was wrong to have approached Jo like that, Andy was wrong to have beaten him up. Andy was left in no doubt if he touched Sam again, he'd be fighting Zak. With Andy living in The Woolpack, the state of Jo and Andy's deteriorating marriage became common knowledge. He and Sam hadn't made up their differences but Sam warned Debbie Dingle (Charley Webb) about what was happening at Butler's Farm. Debbie then kept a very close eye and proceeded to help Jo and Sarah."]}, {"page": "Emily Kirk", "response": ["Emily returned to the village the following year and give Sarah to her father, Andy Sugden (Kelvin Fletcher). His sister Victoria Sugden (Hannah Midgley; Isabel Hodgins) notices Emily living in her old house. She is branded a child-snatcher and is largely ignored by the village for months. Emily tries to commit suicide by walking into the river with stones in her pocket, but she is saved by her former brother-in-law Sam Dingle (James Hooton), who soon develops romantic feelings for her. However, Emily does not feel the same way. She attempts to make a romantic advance towards Ashley Thomas (John Middleton). His wife Laurel Thomas (Charlotte Bellamy) then tries setting her up with Bishop George Postlethwaite (Peter Cartwright), who helps her to decide that she wants to train as a vicar. Emily says goodbye to her friends, especially Viv, and leaves the village for Manchester. She makes a brief return for Paul Lambert and Jonny Foster's commitment ceremony. She offers her condolences to the Thomases, whose baby son Daniel has died, and she leaves after attending his funeral."]}, {"page": "Katie Sugden", "response": ["Katie Sugden (also Addyman and Macey) is a fictional character from the British ITV soap opera Emmerdale, played by Sammy Winward. She made her first screen appearance on 18 July 2001 and Winward's casting was announced a week prior. The character was introduced as a love interest for Andy Sugden (Kelvin Fletcher) and their relationship was a focus point for most of the character's tenure. Winward took maternity leave in 2005, returning the following year. Katie's later stories include relationships with Adam Barton (Adam Thomas) and Declan Macey (Jason Merrells), the latter whom she marries. Writers placed Katie in danger in 2012 when she is involved in a mineshaft accident. Winward announced her decision to leave the series in November 2014 and Katie was killed-off, making her final appearance on 9 February 2015.", "On 10 July 2001, Rick Fulton of the Daily Record reported that Winward had joined the cast as Katie alongside Raine Davison, who played Eve Birch. Fulton said the girls would \"set pulses racing among Emmerdale's teenage bratpack.\" Katie was introduced to the soap as the first love interest for Andy Sugden (Kelvin Fletcher). Winward was fifteen when she joined the cast and she said \"It is fantastic to start in Emmerdale with Raine. It is a great coincidence because we trained together at drama school. I can't wait to start.\" A show spokesperson said there would be some \"real eye-opening storylines\" for the two girls and the rest of the teenage characters, dubbed the \"village bratpack.\" The spokesperson added \"We launched them together because we want to show our viewers that we already have very strong teenage storylines to complement our strong teenage following.\"", "Katie is known for her on and off relationship with Andy Sugden portrayed by Kelvin Fletcher. In July 2014, Winward backed an Andy and Katie upcoming reunion stating: \"I think Katie and Andy always end up going back to each other, so it wasn't a surprise at all. It's quite nice actually, because I think they've both grown up a lot since the last time they were together. They're almost like new people.\""]}, {"page": "Karl Davies", "response": ["As one of the young male characters in the show he was invited to take part in a soap calendar for Now Magazine in 2004 alongside fellow actors Ben Freeman and Kelvin Fletcher. The character's final romantic storyline involved an affair with the married Sadie King, played by Patsy Kensit. This storyline received media attention when Kensit reportedly objected to a relationship with a younger actor. Kensit however clarified the reasons for this in an interview with Leeds Today News stating \"When I first heard about the storyline, I said 'but he looks like one of James's friends, so boyish and young'. But Karl is so adorable and we had a lot of fun filming those scenes\". The brotherly feud which dominated much of Davies' time on the show was used by producers as the vehicle for a high-profile attempt to compete with rival soap EastEnders in the television ratings war and to secure Emmerdale's place as the second most popular soap opera in the UK. The chosen storyline involved Andy's attempts to kill Robert which led to his father, Jack Sugden(Clive Hornby) being shot. The story was to prove a success securing viewing figures of 7.6 million compared with 6.4 million for EastEnders. This was the first time Emmerdale has secured such a ratings victory."]}, {"page": "Cain Dingle", "response": ["Cain and Debbie move into Butler's Farm with local farmer Andy Sugden (Kelvin Fletcher). At somepoint Debbie dates Andy and they have sex on a brief occasion, which soon results in a daughter Sarah. Unlike Debbie, who lets Emily adopt Sarah, Cain bonds with her. Cain attempts to hurt Debbie by having a brief relationship with her friend/girlfriend Jasmine Thomas (Jenna-Louise Coleman) and ensuring that Debbie sees them together. Debbie and Sadie help Jasmine terminate her pregnancy, knowing that Cain wanted to be a father."]}, {"page": "The British Soap Awards", "response": ["| \"Best Actor\" || Ross Kemp (Grant Mitchell in EastEnders) || Dean Sullivan (Jimmy Corkhill in Brookside)David Neilson (Roy Cropper in Coronation Street)Kelvin Fletcher (Andy Sugden in Emmerdale)", "| \"Best Dramatic Performance\" || Kelvin Fletcher (Andy Sugden in Emmerdale) || Georgia Taylor (Toyah Battersby in Coronation Street)Barbara Windsor (Peggy Mitchell in EastEnders)Kerrie Taylor (Lucy Benson in Hollyoaks)"]}, {"page": "Debbie Dingle", "response": ["She was introduced as the foster child of Paddy Kirk (Dominic Brunt) and Emily Kirk (Kate McGregor) before being revealed as the daughter of Charity Dingle (Emma Atkins) and Cain Dingle (Jeff Hordley). She has featured in many storylines on Emmerdale including  her relationships with Andy Sugden (Kelvin Fletcher), which lead to her pregnancy at 15, Jasmine Thomas (Jenna Louise Coleman) and Scott Windsor (Ben Freeman), her daughter Sarah being diagnosed with a blood disorder, her disastrous relationship with Cameron Murray (Carl King's, Gennie Walker's and Alex Moss's real killer) (Dominic Power), which sparked the 2013 week of episodes known as \"The Woolpack Siege,\"; a relationship with Pete (Anthony Quinlan), who she later marries and her affair with Ross (Michael Parr), a relationship with Tom Waterhouse later revealed as Joe Tate (Ned Porteous) and being conned by him but later forgiving him and getting back together, accidentally having Ross as the victim of an acid attack, learning Sarah suffers from heart failure and needs a transplant, and dealing with the false revelation that Cain killed Joe (although it was later revealed that he is alive).", "Debbie, Charity and Cain move into Pear Tree Cottage and live together until Charity is found guilty of Chris's murder, so she and Cain move in with the Dingles. When the house becomes over-crowded, she and Cain move in with Andy Sugden (Kelvin Fletcher) and Daz Eden (Luke Tittensor). Debbie's behaviour becomes erratic as she shows an interest in glamour and boys, resulting in her capturing Daz's affections. Debbie, however, prefers Andy and local curate, Ethan Blake (Liam O'Brien), who is engaged to Niamh O'Connor (Tracey Moore). Debbie loses her virginity to Andy and he tells her that he has a crush on her. They begin dating, until Charity and Cain find out. Charity accepts the relationship but Cain disapproves and blackmails Andy into ending it, unaware that Debbie is pregnant. Andy's wife Katie Sugden (Sammy Winward) had discover her affair with Andy and was pregnant with his child, causing angry at her and nearly divorce with him. Distraught, she hides it and plans to abandon the baby after giving birth but Daz sees her bump. Daz is with her as she gives birth and names her daughter, Sarah. Debbie and Andy reunite briefly but it is short-lived and his brother, Robert Sugden (Karl Davies), becomes romantically involved with Debbie. She, however, is unaware that he has an ulterior motive until he ends the relationship when Debbie tells him that she feels baby Sarah should stay with the Dingles while they go travelling. He then tells her that he wanted Sarah, not her. Feeling unable to cope with motherhood and knowing that Emily is leaving, she asks her to take Sarah. The Dingles are horrified so she moves in with Ashley Thomas (John Middleton), where she makes friends with Jasmine Thomas (Jenna-Louise Coleman). Debbie confesses her love for Jasmine and they date for a while until Cain deliberately tempts Jasmine into sleeping with him. Wanting to hurt her, he makes sure Debbie sees them together. Debbie and Jasmine break up for a while but reconcile when Debbie learns that Jasmine is pregnant and wants an abortion. Sadie King (Patsy Kensit), pitying Jasmine, pays for her to go private and Debbie, knowing that Cain wants another child, tells him this, leading him to kidnap Sadie and Tom King (Ken Farrington) for financial gain to start a new life. Debbie tries to convince Cain to stay but he leaves and gives her some money."]}, {"page": "Rodney Blackstock", "response": ["Val discovers that she has HIV and she tells everybody in The Woolpack, including Rodney. By this time, Eric and Val have broken up due to Eric's concerns about HIV, but they reconcile and Eric decides to take part in a sponsored skydive. Eric torments Rodney over not doing it, so Rodney signs up. However, on the day of the dive, Eric feels that he cannot go through with it. Rodney tells Eric that his relationship with Val is worth fighting for and Eric, startled at Rodney's support, tells him that it is the nicest thing he has ever said to him. Rodney opposes Bernice's casual relationship with farmhand Andy Sugden (Kelvin Fletcher) due to their age difference."]}, {"page": "Jo Stiles", "response": ["(Susan Penhaligon) due to rent arrears. Dawn then arranges for Jo to move into Butler's farm with Andy (Kelvin Fletcher) and Katie Sugden (Sammy Winward) who have recently reconciled. The arrangement is mutually beneficial to begin with as the Sugdens are struggling, but Andy and Jo begin an affair and Katie leaves when she finds out. Jo continues working at the vets but Paddy's partner Hari Prasad (John Nayagam) fires her when she uncovers his suspicious activity with customer invoices, while doing the accounts. Following Andy and Katie's separation, Andy proposes to Jo and she accepts. However, plans for their dream wedding are disrupted when Andy confesses to the fire that he killed his adoptive mother Sarah (Alyson Spiro) seven years earlier from 2000 and is sentenced to three years in prison. Jo and Andy are later married by a prison chaplin."]}]}}