{"wiki_id": "http://www.wikidata.org/entity/Q5951307", "itemLabel": "Huw Watkins", "itemDescription": "British composer and pianist", "wikipedia_url": "https://en.wikipedia.org/wiki/Huw_Watkins", "wikipedia_page": {"main": "Huw Thomas Watkins  (born 13 July 1976) is a British composer and pianist. Born in South Wales, he studied piano and composition at Chetham's School of Music in Manchester, where he received piano lessons from Peter Lawson. He then went on to read Music at King's College, Cambridge, where he studied composition with Robin Holloway and Alexander Goehr, and completed an MMus in composition at the Royal College of Music, where he studied with Julian Anderson. Huw Watkins was awarded the Constant and Kit Lambert Junior Fellowship at the Royal College of Music, where he used to teach composition. He is currently Honorary Research Fellow at the Royal Academy of Music.", "link_mentions": [{"page": "Nine Lessons and Carols", "response": ["|Words: WelshMusic: Huw Watkins."]}, {"page": "List of 21st-century classical composers", "response": ["|Huw Watkins || 1976 ||  || British ||  ||"]}, {"page": "BBC National Orchestra of Wales", "response": ["Past principal guest conductors have included Mariss Jansons, James Loughran and Jac van Steen. François-Xavier Roth was the past associate guest conductor of the BBC NOW.  In December 2015, the BBC NOW announced the appointment of Xian Zhang as its next principal guest conductor, effective with the 2016–2017 season, with an initial contract of 3 years.  She is the first female conductor named to a titled post with any BBC orchestra.  Past Composers-in-Association have included B Tommy Andersson. Huw Watkins became the BBC NOW's Composer-in-Association, beginning in  2015. In September 2020, Gavin Higgins was announced as the BBC NOW's new composer-in-association.  Adrian Partington is the current artistic director of the BBC National Chorus of Wales.", "* 2018 – Huw Watkins: Spring", "* Huw Watkins (2015–2020)"]}, {"page": "Wigmore Hall", "response": ["Wigmore fosters further links with the contemporary music scene through the introduction of its Composer-in-Residence scheme. Luke Bedford became the first Composer-in-Residence in 2009 and was succeeded by Julian Anderson in 2013. Alongside performances of their work, Wigmore has featured series of concerts dedicated to the music of Sir George Benjamin, Huw Watkins, Thomas Larcher, Elliott Carter, Brett Dean, Kevin Volans, James MacMillan and Jörg Widmann. The 2019–20 Season Composer-in-Residence was Vijay Iyer."]}, {"page": "Lovely Joan", "response": ["The melody was used for a set of variations commissioned for the 2017 Presteigne Festival from a number of composers, who each wrote one variation. The composers were Thomas Hyde, David Matthews, Adrian Williams, Michael Berkeley, Christopher Gunning, Huw Watkins, Sally Beamish and Matthew Taylor."]}, {"page": "List of compositions for cello and piano", "response": ["*Huw Watkins"]}, {"page": "Birmingham Contemporary Music Group", "response": ["2005: Huw Watkins: Rondo"]}, {"page": "List of classical pianists", "response": ["* Huw Watkins"]}, {"page": "Philip Cashian", "response": ["Recent commissions include Firewheel for Dark Inventions, Strix for the Britten Sinfonia Academy, the world's turning for the Esprit Orchestra (Toronto),  Nocturnes and Dances for the Wye Valley Chamber Music Festival, The Language of Birds for Tabea Debus and Scenes from the Life of Viscount Medardo for Richard Watkins and the Red Note Ensemble. In 2017 his String Quartet No.2 was premiered in the St Magnus International Festival by the Gildas Quartet and Psappha gave the premiere of Leonora Pictures in Manchester followed by three further performances in New York, Oberlin and Aspen. His second piano concerto, The Book of Ingenious Devices, premiered by Huw Watkins and the BBC Symphony Orchestra conducted by Oliver Knussen in the 2018 Aldeburgh Festival was described in The Times as '\"mesmerising music\". In the 2019 Beijing Modern Music Festival the Guiyang Symphony Orchestra gave the premiere of his most recent orchestral work, Fanfaronades."]}, {"page": "Robin Holloway", "response": ["In 1974, Holloway became an Assistant Lecturer in Music at the University of Cambridge, and in 1980 attained a full Lecturer position. In 1999, he became a reader in Musical Composition at Cambridge. He retired in 2011 as professor of Musical Composition. He is also a Fellow of Gonville and Caius College, Cambridge. Among his many pupils are Thomas Adès, Huw Watkins, Peter Seabourne, David Collins, George Benjamin, Judith Weir, and Jonathan Dove."]}, {"page": "List of classical pianists (recorded)", "response": ["* Huw Watkins"]}, {"page": "Music in the Round", "response": ["Music in the Round believes music is for all so its programmes embrace a breadth of music, including world, folk and jazz alongside classical. It has worked with a variety of other art forms, artists and organisations including poet Ian McMillan, actors Samuel and Timothy West, composers Huw Watkins and Stephen Montague, choreographer Anna Olejnicki and local organisations such as Museums Sheffield, Flying Donkey, Opus Independents and Ignite Imaginations. "]}, {"page": "Ensemble 360", "response": ["They also enjoy collaboration and have worked with a variety of other organisations and artists including poet Ian McMillan, actors Samuel and Timothy West, composer Huw Watkins and Museums Sheffield. From 2012-15, Music in the Round's Associate Composer was Charlie Piper."]}, {"page": "Music Theatre Wales", "response": ["* Crime Fiction Huw Watkins and David Harsent (commission 2009)"]}, {"page": "List of symphony composers", "response": ["*Huw Watkins (born 1976), Welsh composer of 2 symphonies"]}, {"page": "Clarinet-viola-piano trio", "response": ["* Huw Watkins: Speak Seven Seas (2011)"]}, {"page": "Paul Watkins (musician)", "response": ["Paul Watkins (born 1970) is a Welsh classical cellist and conductor.  His brother is the composer Huw Watkins.  Watkins studied cello with William Pleeth, Melissa Phelps and Johannes Goritzki.  In 1988, he won the BBC Young Musician of the Year in the string section. From 1990 to 1997, he was principal cellist of the BBC Symphony Orchestra."]}, {"page": "Nigel Foster (pianist)", "response": ["His musical interests are varied, encompassing all periods from early music to contemporary compositions, and working with opera and lieder singers.  He has premiered works by John Metcalf, Alun Hoddinott, Richard Causton, Julian Philips, Edward Rushton, Arlene Sierra and Huw Watkins."]}, {"page": "Huw", "response": ["*Huw Watkins (born 1976), British composer and pianist"]}, {"page": "Graham Waterhouse", "response": ["As a composer and a performer, he is mostly dedicated to chamber music, and has co-founded several chamber ensembles, including the Vuillaume-Cello-Ensemble playing instruments built by Jean-Baptiste Vuillaume. He established in 1998 a regular chamber music concert series at Gasteig Munich, programming contemporary works alongside classical repertory. Players for his chamber music concerts have included members of the Munich Philharmonic, such as bassoonist Lyndon Watts. Waterhouse has collaborated with the composers Jens Josef (flute) and Rudi Spring (piano). They appeared together in a trio concert at the Gasteig, performing Martinů's trio, the premiere of the flute version of Gestural Variations, and a Christmas carol by each composer,  set by Waterhouse. The song  (The Mountain) on a poem of Hans Krieger for mezzo-soprano, alto flute, cello and piano, was premiered at the Gasteig in 2010 by Martina Koppelstetter, Jens Josef, the composer and Christopher White. In a concert The Proud Bassoon in Wigmore Hall, celebrating his father on 16 April 2011, he performed as a cellist, and two works he had written in memory of his father, Epitaphium and Bright Angel, received their premiere in the UK. In a concert concluding the Gasteig's Liszt Festival to honour the 200th birthday of Franz Liszt, his chamber music scored for piano solo up to piano and string quartet appeared in the context of pieces in similar settings by Liszt. In 2011, he composed a Christmas cantata on a text by Krieger. In 2013 his piano trio Bells of Beyond was premiered at the Gasteig with Yury Revich and Valentina Babor. Incantations, a Concerto da camera for piano and ensemble, was premiered and recorded in Birmingham on 26 March 2015 at the CBSO Centre with Huw Watkins, piano, and the Birmingham Contemporary Music Group, conducted by Richard Baker."]}, {"page": "List of works commissioned by the Royal Philharmonic Society", "response": ["* Huw Watkins: Partita"]}, {"page": "2010 in Wales", "response": ["*Huw Watkins – Violin Concerto"]}, {"page": "Gregynog Music Festival", "response": ["Gregynog Festival has also hosted world premiere performances by composers including Gustav Holst, William Mathias, Hilary Tann, Huw Watkins and Eric Whitacre."]}, {"page": "List of compositions for viola: T to Z", "response": ["* Huw Watkins (b. 1976)"]}, {"page": "Alexandra Wood (violinist)", "response": ["Wood is a frequent leader of the Birmingham Contemporary Music Group. She is a frequent duo partner with Huw Watkins whom she met at university. She is a member of Contemporary Consort; a small ensemble that specialises in British music dating from 1900 to the present."]}, {"page": "List of concert works for saxophone", "response": ["* Fanfares for soprano saxophone and piano (2006)—Huw Watkins"]}, {"page": "Ghost Patrol (opera)", "response": ["Ghost Patrol was premiered on 30 August 2012 at the Traverse Theatre as part of the Edinburgh Festival. It was presented as a double-bill with In the Locked Room by Huw Watkins. The premiere production by Music Theatre Wales was directed by Matthew Richardson and designed by Samal Blak.  It then transferred to the Theatre Royal, Glasgow, before touring in England and Wales in the autumn on 2012, including three performances at the Linbury Studio Theatre at the Royal Opera House in London.Kimberly, Nick (28 September 2012). \"In The Locked Room/Ghost Patrol, Linbury Studio Theatre - review\". The Evening Standard. Retrieved 14 March 2013."]}, {"page": "2011 in British music", "response": ["*Vocal: Five Larkin Songs – Huw Watkins"]}, {"page": "2010 in British music", "response": ["*17 August – Huw Watkins' Violin Concerto is premièred at The Proms by Alina Ibragimova, for whom it was written.Schott MusicBBC 2010 Proms Composer Portraits"]}, {"page": "Amy Dickson", "response": ["Dickson has commissioned new works from such composers as Brett Dean, Ross Edwards (composer), Peter Sculthorpe, Graham Fitkin, Steve Martland and Huw Watkins.  She has also arranged concertante works by Philip Glass and John Tavener, originally composed for other solo instruments, for saxophone.  Now resident in London, she is an ambassador of the Australian Children’s Music Foundation and of The Prince's Foundation for Children and the Arts."]}, {"page": "2015 in classical music", "response": ["* May 12 – The BBC National Orchestra of Wales announces the appointment of Huw Watkins as its next Composer-in-Association, for the period 2015–2018.Schott Music, \"Huw Watkins announced as BBC National Orchestra of Wales' Composer-in-Association\", 12 May May 12, 2015."]}, {"page": "Oliver Davis (composer)", "response": ["|Kerenza Peacock, Huw Watkins accompanied by the London Symphony Orchestra conducted by Paul Bateman", "|Kerenza Peacock, Huw Watkins accompanied by the Royal Philharmonic Orchestra and conducted by Paul Bateman.", "|Kerenza Peacock, Huw Watkins, Katherine Jenkinson, Tim Ridout, Jonathan Hill, Grace Davidson. Accompanied by the Royal Philharmonic Orchestra and conducted by Paul Bateman. ", "|Kerenza Peacock, Jonathan Hill, Grace Davidson, Oliver Wass, Sam Brophy, Benedict Moriarty, Sergio Puccini, Henry Hanssen, Beth & Flo, Katherine Jenkinson, Nicholas Holland, Huw Watkins, Budapest Scoring Symphonic Orchestra conducted by Péter Illényi"]}, {"page": "2016 in classical music", "response": ["* Huw Watkins – Cello Concerto"]}, {"page": "2017 in Wales", "response": ["*Huw Watkins – Symphony, premièred by the Hallé Orchestra at the Bridgewater Hall, Manchester, on 20 April."]}, {"page": "2017 in British music", "response": ["** The Chamber Music Society of Lincoln Center announces its award of the 2017 Elise L. Stoeger Prize, for contributions to chamber music composition, to Huw Watkins.", "* Huw Watkins – SymphonyHallé, 22 April 2017 programme"]}, {"page": "2017 in classical music", "response": ["** The Chamber Music Society of Lincoln Center announces its award of the 2017 Elise L. Stoeger Prize, for contributions to chamber music composition, to Huw Watkins.", "* Huw Watkins – SymphonyHallé, 22 April 2017 programme"]}, {"page": "Stoeger Prize", "response": ["* 2016 Huw Watkins"]}, {"page": "Incantations (Waterhouse)", "response": ["Graham Waterhouse wrote the composition as part of studies at the Birmingham University. The work was premiered at the CBSO Centre, Birmingham, on 26 March 2015, played by pianist Huw Watkins and the Birmingham Contemporary Music Group, conducted by Richard Baker. The first performance in Germany was played at the Allerheiligen-Hofkirche in Munich on 4 October 2015 by pianist Michael Schöch and the ensemble Blauer Reiter with the composer playing the cello part, conducted by Armando Merino. The concert was dedicated to Pierre Boulez for his 90th birthday, and featured works by him and by Isabel Mundry, Peter Maxwell Davies and Arnold Schönberg's Pierrot Lunaire. "]}, {"page": "Xia Leon Sloane", "response": ["* Huw Watkins"]}, {"page": "2018 in Wales", "response": ["* Huw Watkins – Spring"]}, {"page": "2018 in classical music", "response": ["* Huw Watkins – SpringBBC National Orchestra of Wales, 19 January 2018 programme"]}]}}