{"wiki_id": "http://www.wikidata.org/entity/Q5968069", "itemLabel": "I. R. Christie", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/I._R._Christie", "wikipedia_page": {"main": "Ian Ralph Christie,  (11 May 1919 – 25 November 1998) was a British historian specialising in late 18th-century Britain. He spent most of his academic career at University College London (UCL), from 1948 to 1984.", "link_mentions": [{"page": "List of historians", "response": ["*I. R. Christie (1919–1998), Britain"]}, {"page": "1768 British general election", "response": ["The size and strength of Parliamentary factions during the lifetime of the 12th Parliament of Great Britain were rather fluid. The 1761 general election had returned a sizable Whig majority with the opposition formed by a cohort of over 100 Tories and a number of malcontent Independent Whigs notably including Francis Dashwood and Lord Strange. While the exact point of the demise of the Tory party is debated among historians of 18th-century politics, it is clear that by the end of the Parliamentary term no Tory party existed.James Sack, From Jacobite to Conservative: Reaction and orthodox in Britain, c. 1760-1832, pp. 46-8, Cambridge University Press, (1993) While several dozen Tories did remain in the Commons even as late as the early 19th-century, their number gradually dwindled and no coherent unified Tory 'party' can be argued to have existed after the 1761 general election.I. R. Christie, Party in Politics in the Age of Lord North's Administration, Parliamentary History, Vol. 6, No. 1, (1987), pp. 47-68. By the time of the Chatham Administration it was clear that politics was formed along factional rather than party lines. An indication of the strength and state of parties in the period before the election is indicated in parliamentary lists created by Rockingham in November 1766, Townshend in January 1767, and Newcastle in March 1767. These lists differ greatly in various aspects especially among the classification of Independent Country Gentlemen ex-Tories, though the lists do demonstrate that the Ministry held around 220 seats, the Opposition factions around 150, while around 180 Members were Independents of varying degrees.IV. The House of Commons, History of Parliament Online"]}, {"page": "Christopher Wyvill", "response": ["Herbert Butterfield argued that the Yorkshire Association was a quasi-revolutionary organisation and that \"our “French Revolution” is in fact that of 1780—the revolution that we escaped\".Herbert Butterfield, George III, Lord North, and the People, 1779-80 (London: G. Bell & Sons, 1949), p. vi. This interpretation was adopted by Robert Roswell PalmerR. R. Palmer, The Age of the Democratic Revolution: A Political History of Europe and America, 1760–1800: Volume I (Princeton University Press, 1959), pp. 294–97. but criticised by other historians such as Richard Pares and I. R. Christie.Richard Pares, 'Review: George III, Lord North, and the People, 1779-80 by Herbert Butterfield', The English Historical Review, Vol. 65, No. 257 (Oct., 1950), pp. 526-29I. R. Christie, Stress and Stability in Late Eighteenth-Century Britain: Reflections on the British Avoidance of Revolution (Oxford: Clarendon Press, 1984), pp. 47–48."]}, {"page": "Ian R. Christie", "response": ["#redirect I. R. Christie"]}, {"page": "Ian Ralph Christie", "response": ["#redirect I. R. Christie"]}, {"page": "Ian Christie", "response": ["* I. R. Christie (1919–1998), British historian"]}, {"page": "Historiography of the United Kingdom", "response": ["* I. R. Christie (1919–1998), 18th century "]}, {"page": "List of fellows of the British Academy elected in the 1970s", "response": ["* Professor I. R. Christie"]}, {"page": "Arthur Aspinall (historian)", "response": ["His first book, Lord Brougham and the Whig Party (1927), grew out of his doctoral thesis. It was praised as \"thorough and masterly in treatment\" by Lucy M. Brown and I. R. Christie.L. M. Brown and I. R. Christie (eds.), Bibliography of British History, 1789–1851 (Oxford: Clarendon Press, 1977), p. 37."]}]}}