{"wiki_id": "http://www.wikidata.org/entity/Q597658", "itemLabel": "William Ogilby", "itemDescription": "Irish zoologist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Ogilby", "wikipedia_page": {"main": "William Ogilby      (1805–1873) was a British zoologist who was at the forefront of classification and naming of animal species in the 1830s and served as Secretary of the Zoological Society of London from 1839 to 1847. He removed to Ireland during the Great Famine and later built the grand but architecturally dismal Altinaghree Castle. Mount Ogilby in Queensland was named for him in 1846.", "link_mentions": [{"page": "Bongo (antelope)", "response": ["The scientific name of the bongo is Tragelaphus eurycerus, and it belongs to the genus Tragelaphus and family Bovidae. It was first described by Irish naturalist William Ogilby in 1837. The generic name Tragelaphus is composed of two Greek words: trag-, meaning a goat; and elaphos, meaning deer. The specific name eurycerus originated from the fusion of eurus (broad, widespread) and keras (an animal's horn). The common name \"bongo\" originated probably from the Kele language of Gabon. The first known use of the name \"bongo\" in English dates to 1861."]}, {"page": "List of biologists", "response": ["*William Ogilby (1808–1873), British zoologistAbbreviation in zoology: Ogilby concerned with classification and naming of animal species"]}, {"page": "Secretarybird", "response": ["In 1835 the Irish naturalist William Ogilby spoke at a meeting of the Zoological Society of London and proposed three species of secretarybird, distinguishing those from Senegambia as having broader crest feathers than those from South Africa, and reporting a distinct species from the Philippines based on the writings of Pierre Sonnerat in his Voyage à la Nouvelle-Guinée. There is no other evidence this taxon existed. Despite its large range, the secretarybird is considered monotypic: no subspecies are recognised."]}, {"page": "Serval", "response": ["*Felis servalina proposed by William Ogilby in 1839 was based on one serval skin from Sierra Leone with freckle-sized spots."]}, {"page": "Zoological Society of London", "response": ["*William Ogilby (1840–1847)"]}, {"page": "List of castles in Ireland", "response": ["|A derelict castle outside of Donemama, County Tyrone alleged to have been built by William Ogilby in 1860. William's son James fell in love with a factory seamstress, Mary Jane Jamieson, whom he ended up eloping with and marrying in 1884. The castle was abandoned by the end of the century and fell into disrepair."]}, {"page": "Ogilby", "response": ["*William Ogilby (1805–1873), Irish barrister and naturalist", "*James Douglas Ogilby (1853–1925), Australian zoologist, son of William Ogilby"]}, {"page": "Waterbuck", "response": ["The waterbuck (Kobus ellipsiprymnus) is a large antelope found widely in sub-Saharan Africa. It is placed in the genus Kobus of the family Bovidae. It was first described by Irish naturalist William Ogilby in 1833. Its 13 subspecies are grouped under two varieties: the common or ellipsiprymnus waterbuck and the defassa waterbuck.  The head-and-body length is typically between  and the  typical height is between . A sexually dimorphic antelope, males are taller and heavier than females. Males reach roughly  at the shoulder, while females reach . Males typically weigh  and females . Their coat colour varies from brown to grey. The long, spiral horns, present only on males, curve backward, then forward, and are  long.", "The scientific name of the waterbuck is Kobus ellipsiprymnus. The waterbuck is one of the six species of the genus Kobus in the family Bovidae. It was first described by Irish naturalist William Ogilby in 1833. The generic name Kobus is a New Latin word, originating from an African name, koba. The specific name ellipsiprymnus refers to the white, elliptical ring on the rump, from the Greek  (ellipse) and  (, hind part). The animal acquired the vernacular name \"waterbuck\" due to its heavy dependence on water as compared to other antelopes, and its ability to enter into water for defence."]}, {"page": "Chaeropus", "response": ["The genus was proposed by William Ogilby in a presentation to the Linnean Society of London of a new species tentatively assigned to a genus of bandicoots, the long-nosed Perameles, and was forwarded to John Gould, then at Sydney, for a more detailed examination. Ogilby submitted a drawing by the collector Major Mitchell, who also supplied extensive remarks on the animal's form and habits, and identified the unusual pig-like toes of the forelimbs as the basis for a new genus.", "Category:Taxa named by William Ogilby"]}, {"page": "List of authors of names published under the ICZN", "response": ["* Ogilby – William Ogilby (1808–1873) general zoology"]}, {"page": "Yellow mongoose", "response": ["The generic name Cynictis was proposed by William Ogilby in 1833 for a specimen collected in Kaffraria."]}, {"page": "William Thompson (naturalist)", "response": ["Thompson corresponded extensively on all aspects of natural history with naturalists in both Britain and Ireland, including with zoologist Thomas Bell who was at the heart of the English scientific establishment and two of the \"Grandees\" of the Zoological Society, Nicholas Aylward Vigors, William Ogilby. "]}, {"page": "Pseudocheirus", "response": ["The genus was erected by William Ogilby in 1837, the same author later using then correcting the spelling Pseudochirus that is now regarded as a nomenclatural synonym used in error by authors such as Oldfield Thomas. ", "Category:Taxa named by William Ogilby"]}, {"page": "Cuvier's gazelle", "response": ["Category:Taxa named by William Ogilby"]}, {"page": "Korrigum", "response": ["A 1822-1824 British expedition across the Sahara to the ancient kingdom of Bornu, returned with single set of horns of an antelope known in the language of that land as a korrigum. These horns were classified as a new species by William Ogilby in an article in the journal Proceedings of the Zoological Society of London dated 1836, but published in 1837."]}, {"page": "Gambian mongoose", "response": ["Herpestes gambianus was the scientific name proposed by William Ogilby in 1835 for a mongoose specimen from Gambia."]}, {"page": "Damaraland mole-rat", "response": ["Category:Taxa named by William Ogilby"]}, {"page": "Gambian sun squirrel", "response": ["The Gambian sun squirrel was first described by the Irish naturalist William Ogilby in 1835 as Sciurus gambianus. It was designated the type species of the genus Sciurus after the International Commission on Zoological Nomenclature decided to suppress the use of the Sciurus annulatus for this purpose in 1957. The species was later reallocated to the genus Heliosciurus. It is probably a species complex of several described species."]}]}}