{"wiki_id": "http://www.wikidata.org/entity/Q597908", "itemLabel": "James E. Pringle", "itemDescription": "British physicist", "wikipedia_url": "https://en.wikipedia.org/wiki/James_E._Pringle", "wikipedia_page": {"main": "James Edward Pringle (born 20 January 1949) is a British astrophysicist. He is a professor of theoretical astronomy at the Institute of Astronomy, Cambridge part of the University of Cambridge.\nHis research is focused mainly on astrophysical fluid dynamics and accretion discs, including, for example, the formation of stars and planets, accretion of matter onto black holes, and formation of jets by accretion flows. In a 1984 paper, he and John Papaloizou showed that accretion disks in anisotropic stellar systems with constant specific angular momentum are unstable to non-axisymmetric global modes. This phenomenon is now known as the Papaloizou–Pringle instability.  \nHe was awarded the Eddington Medal in 2009.", "link_mentions": [{"page": "Martin Rees", "response": ["His doctoral students have included Roger Blandford, Craig Hogan, Nick Kaiser Priyamvada Natarajan, and James E. Pringle"]}, {"page": "Donald Lynden-Bell", "response": ["Lynden-Bell authored an influential 1974 paper with James E. Pringle about the evolution of disks around \"nebular variables,\" which were later to become known as T Tauri stars – an early phase in a star's life cycle. The paper predicts the signature of radiation from such disks, which is emitted primarily at infrared wavelengths where it dominates over the emission from the star. Excess infrared emission from young stars has become one of the primary methods used to identify these objects in astronomical surveys."]}, {"page": "Pringle", "response": ["** James E. Pringle (born 1949), British astrophysicist"]}, {"page": "Institute of Astronomy, Cambridge", "response": ["* James E. Pringle"]}, {"page": "Papaloizou–Pringle instability", "response": ["The Papaloizou-Pringle Instability (PPI) is a scientific discovery made in 1984 by theoretical physicist John Papaloizou and James E. Pringle which proposes that tori, or accretion disks, in anisotropic stellar systems with constant specific angular momentum are unstable to non-axisymmetric global modes."]}, {"page": "James Edward Pringle", "response": ["#REDIRECT James E. Pringle"]}, {"page": "Index of physics articles (J)", "response": ["*James E. Pringle"]}, {"page": "James Pringle", "response": ["* James E. Pringle (born 1949), British astrophysicist, professor of theoretical astronomy at the University of Cambridge"]}]}}