{"wiki_id": "http://www.wikidata.org/entity/Q5976116", "itemLabel": "Chloe Marshall", "itemDescription": "British model", "wikipedia_url": "https://en.wikipedia.org/wiki/Chloe_Marshall", "wikipedia_page": {"main": "Chloe Elizabeth Marshall (born 27 March 1991) is an English plus-size model. She is from Cranleigh, Surrey. Having won the Miss Surrey title in March 2008, she became the first size 16 (U.S. size 12 to 14) model to reach the finals for the Miss England tiara.Marshall has stated that she \"wanted to go through to the Miss England finals to break the stereotype that you have to be tall and skinny to be considered beautiful.\"\nThe national finals for the Miss England title were held on 18 July 2008. Marshall came in second place.\nMarshall appeared on the cover of Plus Model magazine in March 2010. She signed a three-year contract with Ford Models in early 2010. Marshall has modeled for notable  plus-size clothing clients including Macy's and Torrid. She also walked in Lane Bryant's 2011 runway show in Las Vegas.", "link_mentions": [{"page": "Chloe", "response": ["* Chloe Marshall (born 1991), British plus-size model"]}, {"page": "1991 in the United Kingdom", "response": ["* 27 March – Chloe Marshall, Model"]}, {"page": "Miss England", "response": ["The 2008 contest featured a plus-size model, Chloe Marshall and an active-duty member of the British Army, Katrina Hodge, both firsts for the pageant."]}, {"page": "Authentic TV", "response": ["Authentic TV was the brainchild of Collectibles Guru, Gary Ashburn a leading Collectibles expert who had successfully appeared for many years on QVC and Ideal World TV Home Shopping Channels in the UK. It was conceived by Gary and long-term partner; Paul Lavers as a channel where people could purchase exclusive collectibles, memorabilia and limited editions. Examples of the products on offer included Sports Memorabilia, Rock 'n' Roll Music, Film and TV Memorabilia. The launch team presenters included shopping TV veteran Chloe Marshall and Nikki Vincent."]}, {"page": "Chloe Marhall", "response": ["#REDIRECT Chloe Marshall"]}]}}