{"wiki_id": "http://www.wikidata.org/entity/Q597701", "itemLabel": "George Hamilton Kenrick", "itemDescription": "British entomologist (1850-1939)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Hamilton_Kenrick", "wikipedia_page": {"main": "Sir George Hamilton Kenrick FRES (1850 – 28 May 1939) was an English entomologist who specialised in Lepidoptera especially those of New Guinea. He was a prominent liberal educationist and was a councillor in Birmingham.", "link_mentions": [{"page": "List of freemen of the City of Birmingham", "response": ["|Sir George Hamilton Kenrick"]}, {"page": "Kenrick", "response": ["* George Hamilton Kenrick, (1850–1939), an English entomologist"]}, {"page": "Brevicella", "response": ["Category:Taxa named by George Hamilton Kenrick"]}, {"page": "Tipuliforma", "response": ["Category:Taxa named by George Hamilton Kenrick"]}, {"page": "Eutelephia", "response": ["Eutelephia is a monotypic moth genus of the family Erebidae erected by George Hampson in 1926. Its only species, Eutelephia aureopicta, was first described by George Hamilton Kenrick in 1917. It is found on Madagascar."]}, {"page": "Leucotelia", "response": ["Leucotelia is a monotypic moth genus of the family Erebidae erected by George Hampson in 1926. Its only species, Leucotelia ochreoplagata, was first described by George Hamilton Kenrick in 1917. It is found on Madagascar."]}, {"page": "Fanala", "response": ["Fanala is a monotypic moth genus in the subfamily Lymantriinae erected by Paul Griveaud in 1976. Its only species, Fanala abbreviata, was first described by George Hamilton Kenrick in 1914. It is found on Madagascar."]}, {"page": "Phoberopsis", "response": ["Phoberopsis is a monotypic moth genus in the family Lasiocampidae first described by Yves de Lajonquière in 1972.\"Phoberopsis Lajonquière, 1972\". Global Biodiversity Information Facility. Retrieved September 18, 2018. Its only species, Phoberopsis ferox, described by George Hamilton Kenrick in 1914, is native to Madagascar.[ afromoths.net]"]}, {"page": "List of mayors of Birmingham", "response": ["|align=center| 10 || Sir George Hamilton Kenrick || || 1908-09 ||align=center| 1 || "]}, {"page": "Monodonta (moth)", "response": ["Category:Taxa named by George Hamilton Kenrick"]}, {"page": "Acracona pratti", "response": ["Acracona pratti is a species of snout moth in the genus Acracona. It was described by George Hamilton Kenrick in 1917 and is known from Madagascar."]}, {"page": "Embryoglossa submarginata", "response": ["Embryoglossa submarginata is a species of snout moth in the genus Embryoglossa. It was described by George Hamilton Kenrick in 1917 and is known from Madagascar."]}, {"page": "Lacalma porphyrealis", "response": ["Lacalma porphyrealis is a species of snout moth in the genus Lacalma. It was described by George Hamilton Kenrick in 1907 and is known from New Guinea and Australia.\"Lacalma Janse, 1931\" at Markku Savela's Lepidoptera and Some Other Life Forms. Retrieved June 3, 2017."]}, {"page": "Lophocera", "response": ["Lophocera is a genus of snout moths described by George Hamilton Kenrick in 1917.", "Category:Taxa named by George Hamilton Kenrick"]}, {"page": "Lophocera flavipuncta", "response": ["Lophocera flavipuncta is a species of snout moth in the genus Lophocera. It was described by George Hamilton Kenrick in 1917 and is known from Madagascar.", "Category:Taxa named by George Hamilton Kenrick"]}, {"page": "Nephopterix fuscalis", "response": ["Nephopterix fuscalis is a species of snout moth in the genus Nephopterix. It was described by George Hamilton Kenrick in 1907. It is found in New Guinea."]}, {"page": "Orthaga castanealis", "response": ["Orthaga castanealis is a species of snout moth in the genus Orthaga. It was described by George Hamilton Kenrick in 1907, and is known from Papua New Guinea (including Dinawa, the type location)."]}, {"page": "Borocera attenuata", "response": ["Borocera attenuata is a species of Lasiocampidae moth native to Madagascar. It was first described by George Hamilton Kenrick in 1914."]}, {"page": "Anania elutalis", "response": ["Anania elutalis is a species of moth of the family Crambidae. It was first described by George Hamilton Kenrick in 1917 and is found on Madagascar."]}, {"page": "Glyphodes paramicalis", "response": ["Glyphodes paramicalis is a moth of the family Crambidae described by George Hamilton Kenrick in 1917. It is found in Madagascar."]}, {"page": "Syllepte aureotinctalis", "response": ["Syllepte aureotinctalis is a moth in the family Crambidae described by George Hamilton Kenrick in 1917. It is known from Madagascar."]}, {"page": "Xanthodesma rectangulata", "response": ["Xanthodesma rectangulata is a moth in the family Noctuidae. It was first described by George Hamilton Kenrick in 1917 and is known from Madagascar."]}, {"page": "Calligraphidia tessellata", "response": ["Calligraphidia tessellata is a moth in the family Noctuidae. It was first described by George Hamilton Kenrick in 1917 and is known from Madagascar."]}, {"page": "Acontia gloriosa", "response": ["Acontia  gloriosa is a moth of the family Noctuidae. It was first described by George Hamilton Kenrick in 1917 and is found in Madagascar."]}, {"page": "Corgatha subindicata", "response": ["Corgatha subindicata is a species of moth of the family Erebidae. It was described by George Hamilton Kenrick in 1917 and is found in Madagascar."]}, {"page": "Pseudocossus", "response": ["Category:Taxa named by George Hamilton Kenrick"]}, {"page": "Gyrtona malgassica", "response": ["Gyrtona malgassica is a moth of the family Noctuidae first described by George Hamilton Kenrick in 1917. It is found on Madagascar."]}, {"page": "Rhimphalea linealis", "response": ["Rhimphalea linealis is a small moth in the family Crambidae that is found in Papua New Guinea. The species was first described by George Hamilton Kenrick in 1907."]}, {"page": "Placosaris triticalis", "response": ["Placosaris triticalis is a species of moth of the family Crambidae described by George Hamilton Kenrick in 1907. It is found in Papua New Guinea.Kenrick, George H. (1907). \"A list of Moths of the Family Pyralidae collected by A. E. Pratt in British New Guinea in 1902-3, with Descriptions of new Species\". Proceedings of the Zoological Society of London."]}, {"page": "Psara bractealis", "response": ["Psara bractealis is a moth of the family Crambidae described by George Hamilton Kenrick in 1907. It is found in Papua New Guinea."]}, {"page": "Calamochrous albipunctalis", "response": ["Calamochrous albipunctalis is a moth in the family Crambidae that is found in Papua New Guinea. It was described by George Hamilton Kenrick in 1907."]}, {"page": "Epipagis tristalis", "response": ["Epipagis tristalis is a small moth in the family Crambidae that is found in Papua New Guinea. It was described by George Hamilton Kenrick in 1907 based on insects collected by Antwerp Edgar Pratt. Pratt wrote Two Years among New Guinea Cannibals based on his time there."]}]}}