{"wiki_id": "http://www.wikidata.org/entity/Q5978904", "itemLabel": "John Fane, 11th Earl of Westmorland", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Fane,_11th_Earl_of_Westmorland", "wikipedia_page": {"main": "John Fane, 11th Earl of Westmorland  (3 February 1784 – 16 October 1859), styled Lord Burghersh until 1841, was a British soldier, politician, diplomat, composer and musician.", "link_mentions": [{"page": "Royal Academy of Music", "response": ["The academy was founded by John Fane, 11th Earl of Westmorland, in 1822 with the help and ideas of the French harpist and composer Nicolas Bochsa. The academy was granted a royal charter by King George IV in 1830. The founding of the academy was greatly supported by Arthur Wellesley, 1st Duke of Wellington. He was a keen violinist himself and was determined to make the academy a success."]}, {"page": "1859 in music", "response": ["*October 16 – John Fane, 11th Earl of Westmorland, soldier, politician, diplomat and musician (born 1784)"]}, {"page": "Earl of Westmorland", "response": ["John Fane, 11th Earl of Westmorland, only son of John Fane, 10th Earl of Westmorland, entered the army in 1803, and in 1805 took part in the Hanoverian campaign as aide-de-camp to General Sir George Don. He was assistant adjutant-general in Sicily and Egypt (1806–1807), served in the Peninsular War from 1808 to 1813, was British military commissioner to the allied armies under the Prince of Schwarzenberg, and marched with the allies to Paris in 1814. He was subsequently promoted major general (1825), lieutenant-general (1838) and general (1854), although the latter half of his life was given to the diplomatic service. He was British resident at Florence from 1814 to 1830, and British ambassador at Berlin from 1841 to 1851, when he was transferred to Vienna. In Berlin he had mediated in the Schleswig-Holstein question, and in Vienna he was one of the British plenipotentiaries at the congress of 1855. He retired in 1855, and died at Apethorpe Hall, Northamptonshire, on 16 October 1859. Himself a musician of considerable reputation and the composer of several operas, he took a keen interest in the cause of music in England, and in 1822 made proposals which led to the foundation in the next year of the Royal Academy of Music. His wife Priscilla Anne, daughter of William Wellesley-Pole, 3rd Earl of Mornington, was a distinguished artist.", "*John Fane, 11th Earl of Westmorland (1784–1859)"]}, {"page": "John Fane, 10th Earl of Westmorland", "response": ["*John Fane, 11th Earl of Westmorland (3 February 1784 – 16 October 1859),The Register of Births and Baptisms in the Parish of St James within the Liberty of Westminster. 1761-1786. 9 March 1784. who succeeded his father."]}, {"page": "The Souls", "response": ["*Ethel 'Ettie' Grenfell, née Fane, Lady Desborough (1867–1952) was the daughter of the Hon. Julian Fane, a diplomat and poet, the fifth and youngest son of John Fane, 11th Earl of Westmorland, and Lady Adine Eliza Anne Cowper, daughter of George Cowper, 6th Earl Cowper. Lady Adine died in 1868, a few months after the birth of a son (who did not live to adulthood). Fane died in 1870, leaving Ettie an orphan. She was 20 years old when she married William Grenfell. They welcomed gatherings of The Souls and many others to Taplow Court. Lady Desborough was a well-known celebrity and hostess whose guest lists included Henry Irving, Vita Sackville-West, Edward VII when Prince of Wales, H. G. Wells, Patrick Shaw Stewart, Edith Wharton, Oscar Wilde and Winston Churchill. From 1911 on, Ettie served periodically as Lady of the Bedchamber to Mary of Teck, Queen Consort to George V. She was said to be the confidante of six Prime Ministers: Rosebery, Balfour, Asquith, Baldwin, Chamberlain and Churchill. The Grenfells' lives were marked by the loss of all three sons, two in the Great War and one in an automobile accident in 1926. In 1915, their son Julian was fatally wounded when a splinter from an exploding shell landed in his brain. Ettie received the news from their daughter, who was serving as a nurse in France. Ettie and William travelled to Boulogne, France to be with their son. It took Julian 13 days to die, with his mother, father and sister at his side. "]}, {"page": "Greater Poland uprising (1848)", "response": ["On 24 March the Prussian King issued a declaration that promised the short-dated reorganization of the province and the creation of a commission of both nationalities, whose aim would be the consideration of interests of both nations. The Poles understood those measures as restoration of autonomy. Local Polish committees were formed, Prussian state treasuries requisitioned, and symbols of Prussian state dismantled. In many places the local landrats were removed from power. As John Fane, 11th Earl of Westmorland, a British diplomat in Berlin, reported on 6 April 1848, \"great excesses had been committed by armed bands of Poles, headed by some of the Nobles and Refugees, who have pillaged and set fire to country seats and farm houses and rendered themselves guilty of other depredations which the Government will endeavour to repress by moveable columns of Troops\".British Envoys to Germany, 1816-1866 Volume III, Cambridge Press 2006"]}, {"page": "Sir Archibald Weigall, 1st Bt", "response": ["Weigall was the fifth son of a Victorian artist, Henry Weigall (best known for his portrait of Benjamin Disraeli in 1878–1879), and his wife, Lady Rose Sophia Mary Fane, daughter of John Fane, 11th Earl of Westmorland, and wife Priscilla Anne Wellesley-Pole. Through his mother, he was connected to several powerful aristocratic dynasties. One of his older brothers was the cricketer Gerry Weigall (born Gerald John Villiers Weigall). Two other brothers, Louis and Evelyn, were also first-class cricketers."]}, {"page": "William Grenfell, 1st Baron Desborough", "response": ["Lord Desborough married Ethel Fane (27 June 1867 – 28 May 1952), daughter of the Hon. Julian Fane and granddaughter of John Fane, 11th Earl of Westmorland, in 1887. They had three sons and two daughters. His eldest son was the poet Julian Grenfell, who was killed in action in 1915. His second son, Gerald William Grenfell, was also killed about two months after his elder brother. His third son, Ivo George Grenfell, died in 1926 as the result of a car accident. His daughters were Alexandra Imogen Clair Grenfell (Imogen) (1905-1969) and Monica Margaret Grenfell (1893-1973).UK and Ireland, Find a Grave Index, 1300s-Current As all his sons predeceased him, the barony became extinct. The family lived at Taplow Court, where he and his wife hosted gatherings of the elite and aristocratic group, the 'Souls', adjacent on the riverside to Cliveden, which is a slightly grander country estate, but which saw its social heyday immediately after, from 1920 to 1965. Lady Desborough was a well-known celebrity in her day. Margot Asquith, whose husband would later be politically aligned against Desborough, said of her, She tells enough white lies to ice a wedding cake."]}, {"page": "List of Old Harrovians", "response": ["*General John Fane, 11th Earl of Westmorland (1784–1859), Founder of the Royal College of Music"]}, {"page": "List of ambassadors of the United Kingdom to Austria", "response": ["*1851–1855: John Fane, 11th Earl of Westmorland"]}, {"page": "Sarah Fane, Countess of Westmorland", "response": ["*John Fane, 11th Earl of Westmorland (1784–1859)"]}, {"page": "11th Earl of Westmorland", "response": ["#REDIRECT John Fane, 11th Earl of Westmorland"]}, {"page": "56th (West Essex) Regiment of Foot", "response": ["*1842–1859: Gen. John Fane, 11th Earl of Westmorland, GCB, GCH"]}, {"page": "Julia Goodman", "response": ["*Portrait of John Fane, 11th Earl of Westmorland"]}, {"page": "List of diplomats of the United Kingdom to Prussia", "response": ["*1841–1851: John Fane, 11th Earl of Westmorland"]}, {"page": "Francis Fane, 12th Earl of Westmorland", "response": ["Fane was the fourth but eldest surviving son of John Fane, 11th Earl of Westmorland, by Lady Priscilla Anne Pole-Wellesley, daughter of William Wellesley-Pole, 3rd Earl of Mornington. He was educated at Westminster and the Royal Military College, Sandhurst.The Times Obituary 4 August 1891"]}, {"page": "John Fane", "response": ["*John Fane, 11th Earl of Westmorland (1784–1859) "]}, {"page": "Julian Fane (diplomat)", "response": ["Fane was the fifth and youngest son of John Fane, 11th Earl of Westmorland, by Lady Priscilla Anne, daughter of William Wellesley-Pole, 3rd Earl of Mornington.thepeerage.com Hon. Julian Henry Charles Fane He was educated at Harrow and Trinity College, Cambridge, where he was a member of the 'Apostles', chancellor's medallist in 1850 and graduated M.A. in 1851. Between 1856 and 1858 he was secretary of legation at St. Petersburg and first secretary and acting chargé d'affaires at Paris from  1865 to 1867."]}, {"page": "Fane (surname)", "response": ["* John Fane, 11th Earl of Westmorland (1784–1859)"]}]}}