{"wiki_id": "http://www.wikidata.org/entity/Q5982824", "itemLabel": "Ian Salisbury", "itemDescription": "English Test and County cricketer, coach (born 1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Salisbury", "wikipedia_page": {"main": "Ian David Kenneth Salisbury (born 21 January 1970) is an English former cricketer, one of the few leg-spinners to play Test cricket for England in recent years. Salisbury played in fifteen Tests and four One Day Internationals between 1992 and 2000. He played first-class cricket for Sussex, Surrey and Warwickshire in a career stretching from 1989 to 2008.The cricket writer, Colin Bateman, commented, \"the selection of Ian Salisbury against Pakistan in 1992 made cricket romantics rejoice.  When he played at Lord's he became the first specialist leg-spinner selected for England since Robin Hobbs in 1971\". The reality was that in his subsequent Test career, Salisbury's tally of twenty wickets cost almost 77 runs apiece.", "link_mentions": [{"page": "Salisbury (disambiguation)", "response": ["* Ian Salisbury (born 1970), English cricketer"]}, {"page": "Wisden Cricketers of the Year", "response": ["|  Ian Salisbury"]}, {"page": "Surrey County Cricket Club", "response": ["*  Ian Salisbury", "* Ian Salisbury (2012-2013)"]}, {"page": "Trinity School of John Whitgift", "response": ["*Ian Salisbury, Cricketer"]}, {"page": "Warwickshire County Cricket Club in 2005", "response": ["In an incredible finish to the knock-out quarter-final between Surrey Lions and Warwickshire Bears, the match was tied, so the players had to resort to a bowl-off – cricket's version of a penalty shootout, in which five players have two attempts at bowling at unguarded stumps, and if the stumps fall down, that was one point for their team. Surrey opened the batting in this match at The Oval, having been put in to bat by the Bears' captain Nick Knight. It was a shaky effort, often interrupted by wickets, and part-timer Jonathan Trott snared two wickets for 19 – admittedly tail-enders Ian Salisbury and Tim Murtagh. Mark Ramprakash, however, hit an unbeaten run-a-ball 34 to guide Surrey to 149 for 8, well below a par score. Warwickshire's innings then began under heavy cloud cover that assisted the Surrey swing bowlers. After Neil Carter went first ball, Warwickshire struggled in the rain, and the bad weather eventually stopped play just before five overs was played – so that, if the players couldn't return, the match would be declared a no-result. However, the rain gave way reasonably quickly, and quick hitting from Trevor Penney in particular – who made 20 off 12 balls before being caught off a ball from Rikki Clarke closed down the deficit."]}, {"page": "Sussex County Cricket Club in 2005", "response": ["A close, rain-damaged match at The County Ground, Hove eventually ended in Surrey Lions snaring a last-ball victory over Sussex Sharks. Batting first, the hosts made 139 for 6 in 17 overs, spinner Nayan Doshi taking three wickets despite being the most expensive of the bowlers, while Matt Prior top-scored with 51. A 28-ball fifty from Ali Brown then lifted Surrey to 74 for 1, but two run outs saw them lose their next four wickets for eight runs. Azhar Mahmood and Ian Salisbury, however, shared a 36-run partnership and saw them pass the revised target of 114 by two runs on the very last ball of the game.", "An interesting match at Guildford was shortened to 22 overs a side due to rain. However, the scores were similar to what could have been in a 45-over game, as Sussex Sharks amassed 219 for 9 – Murray Goodwin top-scoring with 44, while Luke Wright plundered three sixes in a 14-ball 35. The Surrey bowlers all got wickets – except for Ian Salisbury – but also conceded more than seven runs an over. A Surrey Lions side including three debutants – Stewart Walters, Rory Hamilton-Brown and Jake Dernbach – crumbled despite the efforts of Mark Ramprakash who made 63, as they were all out for 171."]}, {"page": "MCC University matches in 2005", "response": ["On the second day, the match changed. Bradford/Leeds UCCE, thanks to Adam Patel (54), James Duffy (64) and a defiant last wicket partnership of 86 between Tom Glover (42*) and Simon Crampton (42), took their score to 333, a deficit of 100. Even worse news for Surrey was a tear to Ian Salisbury's intercostal muscle which put him out of the rest of the game, and a re-aggravated hamstring injury to Martin Bicknell that stopped him bowling further in the match. Surrey then faltered with the bat, finishing the game on 132 for 6.", "On the last day, Surrey were dismissed for 217 (although Ian Salisbury was absent hurt), with Glover taking 4 for 47. This left the students with a target of 318 runs off 70 overs. Very much to their credit, they went for it. Thomas Merilaht (56), Duffy (49 in 41 balls), Ryan Bradshaw (89* in 95 balls) and Mohammad Ali (27* off 22 balls) treated the sparse crowd to the sight of a UCCE team consistently finding the boundaries against a spread out field. Bradshaw hit 5 sixes and 8 fours in a match-winning innings. Whilst it was against a second-string Surrey attack (Clarke, Salisbury and Bicknell did not bowl) Bradford/Leeds UCCE were delighted to win with 2.1 overs remaining. (BBC scorecard)"]}, {"page": "Kent County Cricket Club in 2005", "response": ["Surrey Lions recorded only their fourth win in the National League system this year with a five-wicket win over Kent Spitfires at the St Lawrence Ground. Kent, having chosen to bat first, were dismissed by medium-pacer Neil Saker, who took four for 43, and Tim Murtagh, who joined in with three for 28. Jade Dernbach, Ian Salisbury and Nayan Doshi also took a wicket each as Kent finished on 211, with Irish wicket-keeper Neil O'Brien top scoring with 43 – his innings tugged Kent back from 124 for 6. Andrew Hall took three quick wickets as Kent fielded, reducing Surrey to 25 for 3, but Ali Brown's quickfire 65 and Jonathan Batty's 82 turned the match around, and Rikki Clarke hit 35 to take Surrey to the target with nearly four overs to spare."]}, {"page": "Surrey County Cricket Club in 2005", "response": ["*  Ian Salisbury", "After these games, they then took on the students of Bradford/Leeds UCCE and to their surprise, and the students' credit, Surrey lost by 4 wickets. More concerning though were the injuries picked up by Martin Bicknell, Ian Salisbury and Rikki Clarke, which meant none of these three bowled in the final innings. It got no better for Surrey the following Sunday, when they lost heavily to Durham.", "On the second day, the match changed. Bradford/Leeds UCCE, thanks to Adam Patel (54), James Duffy (64) and a defiant last wicket partnership of 86 between Tom Glover (42*) and Simon Crampton (42), took their score to 333, a deficit of 100. Even worse news for Surrey was a tear to Ian Salisbury's intercostal muscle which put him out of the rest of the game, and a re-aggravated hamstring injury to Martin Bicknell that stopped him bowling further in the match. Surrey then faltered with the bat, finishing the game on 132 for 6.", "On the last day, Surrey were dismissed for 217 (although Ian Salisbury was absent hurt), with Glover taking 4 for 47. This left the students with a target of 318 runs off 70 overs. Very much to their credit, they went for it. Thomas Merilaht (56), Duffy (49 in 41 balls), Ryan Bradshaw (89* in 95 balls) and Mohammad Ali (27* off 22 balls) treated the sparse crowd to the sight of a UCCE team consistently finding the boundaries against a spread out field. Bradshaw hit 5 sixes and 8 fours in a match-winning innings. Whilst it was against a second-string Surrey attack (Clarke, Salisbury and Bicknell did not bowl) Bradford/Leeds UCCE were delighted to win with 2.1 overs remaining. (BBC scorecard)", "A close, rain-damaged match at County Cricket Ground, Hove eventually ended in Surrey Lions snaring a last-ball victory over Sussex Sharks. Batting first, the hosts made 139 for 6 in 17 overs, spinner Nayan Doshi taking three wickets despite being the most expensive of the bowlers, while Matt Prior top-scored with 51. A 28-ball fifty from Ali Brown then lifted Surrey to 74 for 1, but two run outs saw them lose their next four wickets for eight runs. Azhar Mahmood and Ian Salisbury, however, shared a 36-run partnership and saw them pass the revised target of 114 by two runs on the very last ball of the game.", "In an incredible finish to the knock-out quarter-final between Surrey Lions and Warwickshire Bears, the match was tied, so the players had to resort to a bowl-off – cricket's version of a penalty shootout, in which five players have two attempts at bowling at unguarded stumps, and if the stumps fall down, that was one point for their team. Surrey opened the batting in this match at The Oval, having been put in to bat by the Bears' captain Nick Knight. It was a shaky effort, often interrupted by wickets, and part-timer Jonathan Trott snared two wickets for 19 – admittedly tail-enders Ian Salisbury and Tim Murtagh. Mark Ramprakash, however, hit an unbeaten run-a-ball 34 to guide Surrey to 149 for 8, well below a par score. Warwickshire's innings then began under heavy cloud cover that assisted the Surrey swing bowlers. After Neil Carter went first ball, Warwickshire struggled in the rain, and the bad weather eventually stopped play just before five overs was played – so that, if the players couldn't return, the match would be declared a no-result. However, the rain gave way reasonably quickly, and quick hitting from Trevor Penney in particular – who made 20 off 12 balls before being caught off a ball from Rikki Clarke closed down the deficit.", "A match at Guildford was shortened to 22 overs a side due to rain. However, the scores were similar to what could have been in a 45-over game, as Sussex Sharks amassed 219 for 9 – Murray Goodwin top-scoring with 44, while Luke Wright plundered three sixes in a 14-ball 35. The Surrey bowlers all got wickets – except for Ian Salisbury – but also conceded more than seven runs an over. A Surrey Lions side including three debutants – Stewart Walters, Rory Hamilton-Brown and Jake Dernbach – crumbled despite the efforts of Mark Ramprakash who made 63, as they were all out for 171.", "Surrey Lions recorded only their fourth win in the National League system this year with a five-wicket win over Kent Spitfires at St Lawrence Ground. Kent, having chosen to bat first, were dismissed by medium-pacer Neil Saker, who took four for 43, and Tim Murtagh, who joined in with three for 28. Jade Dernbach, Ian Salisbury and Nayan Doshi also took a wicket each as Kent finished on 211, with Irish wicket-keeper Niall O'Brien top scoring with 43 – his innings tugged Kent back from 124 for 6. Andrew Hall took three quick wickets as Kent fielded, reducing Surrey to 25 for 3, but Ali Brown's quickfire 65 and Jonathan Batty's 82 turned the match around, and Rikki Clarke hit 35 to take Surrey to the target with nearly four overs to spare.", "Surrey passed 600 on the third day, before Shah picked up his second wicket of the match, removing Ramprakash for 252 – ending an all-time record fifth-wicket partnership of 318.  Azhar Mahmood, who had shared the stand with Ramprakash, went on to make 204 not out before Surrey declared on 686 for 7 – before leg-spinners Saqlain Mushtaq and Ian Salisbury shared six wickets between them to bowl Middlesex out for 243 and to record an innings victory – to no avail, as Midldesex finished one point ahead in the final table."]}, {"page": "Middlesex County Cricket Club in 2005", "response": ["Surrey passed 600 on the third day, before Shah picked up his second wicket of the match, removing Ramprakash for 252 – ending an all-time record fifth-wicket partnership of 318.  Azhar Mahmood, who had shared the stand with Ramprakash, went on to make 204 not out before Surrey declared on 686 for 7 – before leg-spinners Saqlain Mushtaq and Ian Salisbury shared six wickets between them to bowl Middlesex out for 243 and to record an innings victory – to no avail, as Midldesex finished one point ahead in the final table."]}, {"page": "National League Division Two in 2005", "response": ["An interesting match at Guildford was shortened to 22 overs a side due to rain. However, the scores were similar to what could have been in a 45-over game, as Sussex Sharks amassed 219 for 9 – Murray Goodwin top-scoring with 44, while Luke Wright plundered three sixes in a 14-ball 35. The Surrey bowlers all got wickets – except for Ian Salisbury – but also conceded more than seven runs an over. A Surrey Lions side including three debutants – Stewart Walters, Rory Hamilton-Brown and Jake Dernbach – crumbled despite the efforts of Mark Ramprakash who made 63, as they were all out for 171.", "Surrey Lions recorded only their fourth win in the National League system this year with a five-wicket win over Kent Spitfires at St Lawrence Ground. Kent, having chosen to bat first, were dismissed by medium-pacer Neil Saker, who took four for 43, and Tim Murtagh, who joined in with three for 28. Jade Dernbach, Ian Salisbury and Nayan Doshi also took a wicket each as Kent finished on 211, with Irish wicket-keeper Niall O'Brien top scoring with 43 – his innings tugged Kent back from 124 for 6. Andrew Hall took three quick wickets as Kent fielded, reducing Surrey to 25 for 3, but Ali Brown's quickfire 65 and Jonathan Batty's 82 turned the match around, and Rikki Clarke hit 35 to take Surrey to the target with nearly four overs to spare."]}, {"page": "Sussex County Cricket Club", "response": ["* Head coaches: Ian Salisbury (FC/LA) James Kirtley (T20)", "* Spin Bowling Coach:  Ian Salisbury", "* Ian Salisbury"]}, {"page": "Chris Adams (cricketer)", "response": ["After taking over at Surrey in 2008 and appointing a young captain in Rory Hamilton-Brown Surrey gained promotion and won the domestic 40 over competition in 2011. He was coach when the Surrey team suffered the death of one of their young first team players Tom Maynard on 18 June 2012, on a tube line after fleeing from police who stopped his car with him four times over the alcohol limit with cocaine and MDMA in his system. Even though Maynard's housemate and captain Hamilton-Brown, who had been out with Maynard that fateful evening, left to join Sussex, questions remained about the disciplinary attitudes at the club. On 17 June 2013, it was announced by Surrey County Cricket Club that Adams had been sacked, along with his first team coach Ian Salisbury."]}, {"page": "Twenty20 in England in 2005", "response": ["A close, rain-damaged match at The County Ground, Hove eventually ended in Surrey Lions snaring a last-ball victory over Sussex Sharks. Batting first, the hosts made 139 for 6 in 17 overs, spinner Nayan Doshi taking three wickets despite being the most expensive of the bowlers, while Matt Prior top-scored with 51. A 28-ball fifty from Ali Brown then lifted Surrey to 74 for 1, but two run outs saw them lose their next four wickets for eight runs. Azhar Mahmood and Ian Salisbury, however, shared a 36-run partnership and saw them pass the revised target of 114 by two runs on the very last ball of the game.", "In an incredible finish to the knock-out quarter-final between Surrey Lions and Warwickshire Bears, the match was tied, so the players had to resort to a bowl-off – cricket's version of a penalty shootout, in which five players have two attempts at bowling at unguarded stumps, and if the stumps fall down, that was one point for their team. Surrey opened the batting in this match at The Oval, having been put in to bat by the Bears' captain Nick Knight. It was a shaky effort, often interrupted by wickets, and part-timer Jonathan Trott snared two wickets for 19 – admittedly tail-enders Ian Salisbury and Tim Murtagh. Mark Ramprakash, however, hit an unbeaten run-a-ball 34 to guide Surrey to 149 for 8, well below a par score. Warwickshire's innings then began under heavy cloud cover that assisted the Surrey swing bowlers. After Neil Carter went first ball, Warwickshire struggled in the rain, and the bad weather eventually stopped play just before five overs was played – so that, if the players couldn't return, the match would be declared a no-result. However, the rain gave way reasonably quickly, and quick hitting from Trevor Penney in particular – who made 20 off 12 balls before being caught off a ball from Rikki Clarke closed down the deficit."]}, {"page": "Tim Munton", "response": ["Munton was included in the England Test squad from the start of the 1992 summer, with Phil Tufnell, David Lawrence and Dermot Reeve all recovering from injuries.Wisden 1993, p. 283 However, he was omitted from the side from the first Test, as England chose an extra batsman in the shape of Mark Ramprakash, and from the second Test as Devon Malcolm returned after a year out of the side.Wisden 1993, p. 287 He came into the side for the third Test, after Ian Botham was dropped and Phil Defreitas was declared unfit with a groin strain.Wisden 1993, p. 291 However, he struggled with the ball throughout the match, with figures of 1/112 in the first innings and 0/26 in the second, as Pakistan scored nearly 750 runs for the loss of 14 wickets. He was more successful with the bat, scoring 25 not out and putting on a partnership of 64 for the 9th wicket with Ian Salisbury. He kept his place in the XI for the fourth Test at Headingley and took 2/22 in the first innings and 1/40 in the second, with Inzamam-ul-Haq and Ramiz Raja among his victims, as England won by five wickets.Wisden 1993, p. 297 He was, however, dropped for the final Test of the summer at the Oval, as Malcolm and Tufnell returned to the side, and did not make the squad for either of the 1992/3 overseas tours.Wisden 1993, p. 555"]}, {"page": "Netherlands national cricket team", "response": ["| Ian Salisbury "]}, {"page": "Robin Hobbs", "response": ["Cricket writer, Colin Bateman, remarked, \"Hobbs was the last specialist leg-spinner to play for England before Ian Salisbury revived the art in 1992. A good spinner of the ball although he lacked the googly, an inventive batsman and great character, he was an immensely popular cricketer\".", "Leg spinners have proved a rarity in post-war English cricket, thanks in part to the rise of one day cricket, and Hobbs was the last specialist to play for England before the emergence of Ian Salisbury."]}, {"page": "1992 English cricket season", "response": ["*Wisden - Nigel Briers, Martyn Moxon, Ian Salisbury, Alec Stewart, Wasim Akram"]}, {"page": "English cricket team in Sri Lanka in 1992–93", "response": ["* Ian Salisbury ", "|Ian Salisbury"]}, {"page": "Pakistani cricket team in England in 1992", "response": ["|| Ian Salisbury || RHB, LB", "Second time around, only Stewart (69*) could muster any resistance, with Extras contributing the next highest score (28) in a total of 175. Wasim Akram's 4–66 was earned mostly at the expense of England's tail. Pakistan made their target of 138 look like hard work, falling to 18–3 and 95–8 with Lewis (3–43) and Ian Salisbury (3–49) their main tormentors. Once again, Wasim and Waqar combined to win the match – only this time with the bat. A dogged 45 not out from Wasim and strong support from Waqar (20*) saw Pakistan home.", "Ian Salisbury's maiden Test innings ended Hit wicket. He also acted as Nightwatchman in the second innings."]}, {"page": "South African cricket team in England in 1994", "response": ["* Ian Salisbury", "South Africa went into the historic match with four front-line seamers and no spinner, selecting the same side that had drawn their last test, with Australia.  England made two changes from the drawn test with New Zealand, John Crawley coming into the side to make his debut at the expense of Robin Smith and Ian Salisbury replacing Peter Such as the side's spinner."]}, {"page": "English cricket team in the West Indies in 1993–94", "response": ["The England team were captained by Mike Atherton in his first tour as captain, and they were looking to put their recent poor results behind them, and follow up on the Sixth Test victory over Australia. The only surprising element of the touring party was the omission of Peter Such, the leading wicket taker against Australia, in favour of the promising Ian Salisbury, though it seemed that Phil Tufnell was considered the senior spinner in the squad. In contrast to previous captain Graham Gooch, Atherton adopted a more relaxed approach to touring, allowing players time off rather than continual practicing, though perhaps Chris Lewis's decision to get his head shaved on a day off was a mistake – he spent a full day recovering from the subsequent sun-stroke.Martin Johnson's column in The Independent between the first two warm-up games, accessed from Cricinfo.com on 16 March 2007", "*Ian Salisbury", "Shivnarine Chanderpaul made his Test debut for the West Indies on his home ground, replacing Phil Simmons, while Richardson moved up to open the innings with Desmond Haynes. For the tourists, Ian Salisbury came in for Caddick, and the impressive Malcolm was replaced by Fraser, with Maynard losing out to Mark Ramprakash for the sixth batting place."]}, {"page": "English cricket team in India in 1992–93", "response": ["* Ian Salisbury", "England's batting was insipid.  The top order failed miserably, slumping to 40/4 and 89/6, but the tail worked hard and Ian Salisbury came close to saving the follow-on after a three-hour stay at the crease for 28.  Second time around, they offered up more defiance, Alec Stewart and Mike Gatting showing some form, but insufficient to set India a challenging total.  Again, Salisbury (26) batted well, and was supported for more than an hour and a half by Paul Taylor, but ultimately to no avail."]}, {"page": "Stuart Meaker", "response": ["Stuart Christopher Meaker (born 21 January 1989) is a former cricketer who played for Surrey and Sussex. His family came to England from South Africa in 2001, and he was educated at Cranleigh School. For cricketing purposes he is regarded as English. He is categorised by CricketArchive and Cricinfo as a right-arm fast medium bowler and a right-handed batsman. However, according to a 2011 article in The Observer in 2009 he was timed by the speed guns at the ECB's indoor school in Loughborough at , the highest figure for any bowler measured there. Surrey's coach Ian Salisbury said of him: \"He's always been able to bowl quick and he is a 90mph bowler, but he can also swing the ball, conventionally or reverse later on.\"Stuart Meaker on the fast-track to international success with England Retrieved 29 July 2013"]}, {"page": "Goodwood Cricket", "response": ["*\tIan Salisbury"]}, {"page": "2008 Twenty20 Cup", "response": ["| Ian Salisbury || Warwickshire Bears || 10 || 32 || 175 || 15 || 3/14 || 5.47 || 12.80 || 0 || 0 || 11.67"]}, {"page": "List of tied first-class cricket matches", "response": ["Ian Salisbury 4/101"]}]}}