{"wiki_id": "http://www.wikidata.org/entity/Q5982553", "itemLabel": "Ian Partridge", "itemDescription": "English lyric tenor", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Partridge", "wikipedia_page": {"main": "Ian Partridge  (born 12 June 1938) is a retired English lyric tenor, whose repertoire ranged from Monteverdi, Bach and Handel, the Elizabethan lute songs, German, French and English songs, through to Schoenberg, Weill and Britten, and on to contemporary works.  He formed a renowned vocal-piano duo with his sister Jennifer Partridge, with whom he worked for over 50 years. While concentrating mainly on songs, oratorio and lieder, he also recorded opera, and has an extensive discography.  He is now a teacher and adjudicator, and conducts master classes in many countries.", "link_mentions": [{"page": "Prunella Scales", "response": ["In 2000, Scales appeared in the film The Ghost of Greville Lodge as Sarah. The same year she appeared as Eleanor Bunsall in Midsomer Murders \"Beyond the Grave\". In 2001 she appeared in two episodes of Silent Witnesss \"Faith\" as Mrs Parker. In 2003, she appeared as Hilda, \"she who must be obeyed\", wife of Horace Rumpole, in four BBC Radio 4 plays, with Timothy West playing her fictional husband. Scales and West toured Australia at the same time in different productions. Scales appeared in a one-woman show called An Evening with Queen Victoria, which also featured the tenor Ian Partridge singing songs written by Prince Albert. Scales has performed An Evening with Queen Victoria more than 400 times, in theatres around the world, over the course of 30 years."]}, {"page": "The Triumphs of Oriana", "response": ["*The Triumphs of Oriana: Madrigals Pro Cantione Antiqua, Ian Partridge Archiv"]}, {"page": "Saint Nicolas (Britten)", "response": ["The Thames Television production, with Ian Partridge singing the title role, won the 1977 Prix Italia.Debrett's "]}, {"page": "Serenade to Music", "response": ["|Ian Partridge"]}, {"page": "The Pilgrim's Progress (opera)", "response": ["* 1971 HMV SLS 959 (later EMI Classics CMS 7 64212 2 CD release): John Noble (Pilgrim); Raimund Herincx (John Bunyan, Lord Hate-Good), John Carol Case (Evangelist), Wynford Evans, Christopher Keyte, Geoffrey Shaw, Bernard Dickerson, Sheila Armstrong, Marie Hayward, Gloria Jennings, Ian Partridge, John Shirley-Quirk, Terence Sharpe, Robert Lloyd, Norma Burrowes, Alfreda Hodgson, Joseph Ward, Richard Angas, John Elwes, Delia Wallis, Wendy Eathorne, Gerald English, Doreen Price, Jean Temperley, Kenneth Woollam; London Philharmonic Choir; London Philharmonic Orchestra; Sir Adrian Boult, conductorOttaway, Hugh, \"Record Reviews: The Pilgrim's Progress (May 1972).  The Musical Times, 113 (1551): pp. 469–470."]}, {"page": "Dichterliebe", "response": ["* Ian Partridge with Jennifer Partridge, 1974 (CfP CD CFP 4651)"]}, {"page": "Phantasm (music group)", "response": ["* Byrd Song by William Byrd with Ian Partridge and Geraldine McGreevy - 1999"]}, {"page": "The Record of Singing", "response": ["*Carlo Bergonzi, Jon Vickers, René Kollo, Ian Partridge, Donald Smith, Franco Bonisolli, José Carreras, Alain Vanzo, Neil Shicoff"]}, {"page": "Esther (Handel)", "response": ["*Patrizia Kwella (Esther), Anthony Rolfe Johnson (Ahasuerus), Ian Partridge (Mordecai), David Thomas (Haman), Emma Kirkby (Israelite Woman), Drew Minter (Priest). Conductor Christopher Hogwood, The Academy of Ancient Music Orchestra and Chorus. L'Oiseau-Lyre 4144232, released 1985."]}, {"page": "Sancta Civitas", "response": ["*Sir David Willcocks, conductor-John Shirley-Quirk, baritone; Ian Partridge, tenor; with Bach Choir and London Symphony Orchestra."]}, {"page": "The Bonnie Banks o' Loch Lomond", "response": ["Ralph Vaughan Williams made an arrangement for baritone solo and unaccompanied male choir in 1921. It has been recorded several times, notably by the tenor Ian Partridge and the London Madrigal Singers for EMI in 1970."]}, {"page": "Norman Walker (bass)", "response": ["Walker suffered a stroke in 1955 and retired from singing on the stage but continued to broadcast. He taught at the Guildhall School of Music from 1951 until his death, his students including Ian Partridge, Elizabeth Bainbridge, Janet Coster, John Dobson, Anne Pashley, John Heddle Nash, Paschal Allen and Lawrence Richard."]}, {"page": "Rudi Martinus van Dijk", "response": ["In the United Kingdom, the Raphael Ensemble commissioned and gave the World premiere of his String Sextet in 1998 at the Brighton Festival, and in that same year British violinist Anthony Marwood commissioned and gave the World premiere of his Sonata for Violin and Piano at London's Wigmore Hall. In 2003, Van Dijk's 70th Birthday Concert     was given in London's Purcell Room at the South Bank Centre  which included performances of his music by pianist Kyoko Hashimoto, the Dante Quartet, and the British tenor Ian Partridge who gave the World premiere of Van Dijk's Songs of the Tao te Ching. Since then Anthony Marwood has performed his music a number of times on BBC Radio 3.  In 2000,  classical Indian Bharatanatyam dancer Mayuri Boonham  commissioned Van Dijk The Triple Hymn based on a mantra from the Vedic literature to be performed on a UK tour and at the Spring Loaded Festival at the Place Theatre in London. Maarten Brandt writes: \"The Triple Hymn is a vibrant dance duet. The music is written for cello, soprano, midrangam, tubular bell and gong, depicting a three-part manifestation of the Goddesses Gayatri, Savitri, and Sarasvati. The work plays on a cross-cultural edge and explores valuable territory. The score is rhythmically challenging, dynamically diverse and evocative.\""]}, {"page": "Meridian Records", "response": ["Meridian has traditionally specialised in recording relatively unknown works and/or artists at the beginning of their careers. Accordingly, it has played an important part in creating the early reputations of musicians as diverse as The Sixteen, solo and chamber pianist Christine Croshaw, clarinetist Anna Hashimoto, tenor Ian Partridge, pianist John Bingham, the Lindsay Quartet, Onyx Brass, and organist David Sanger, among others. Distinguished musicians from all over the globe have recorded on the label including a series of releases by pianist Fou Ts'ong (\"the greatest living Chinese performer\" according to Timeout magazine), as well as South African virtuoso double-bassist Leon Bosch - a favourite on Classic FM, BBC Radio 3 and Radio 4."]}, {"page": "Pro Cantione Antiqua", "response": ["* tenors: Paul Elliott, James Griffett, James Lewington, Ian Partridge, Ian Thompson and Andrew Carwood.", "* The Triumphs of Oriana Pro Cantione Antiqua directed by Ian Partridge DC Archiv 2533 237 35 Madrigals Derrick Henry - The listener's guide to medieval & Renaissance music 1983  Page 132"]}, {"page": "Oxford Lieder Festival", "response": ["| James Gilchrist, Daniel Norman, Mark Padmore, Ian Partridge, Robin Tischler"]}, {"page": "New College School", "response": ["*Ian Partridge tenor"]}, {"page": "Ambrosian Singers", "response": ["The Ambrosian singers have been the training ground for a large number of professional artists.  Famous members have included Heather Harper, Dorothy Dorow, Janet Baker, Sarah Walker, Margaret Price, Robert Tear, Ian Partridge and John Shirley-Quirk."]}, {"page": "Crispian Steele-Perkins", "response": ["*The Regents Bugle, with Ian Partridge, Leslie Pearson and David Woodcock, Independent"]}, {"page": "Alexander's Feast (Handel)", "response": ["* Alexander's Feast: Nancy Argenta, soprano; Ian Partridge, tenor; Michael George, bass; The Sixteen, conducted by Harry Christophers; Recorded 1990 (Authentic Instruments) – 2 CD Collins Classics 70 162 [1991], Musical Society Heritage 525259X [1998], Coro COR16028 [2004]"]}, {"page": "Mahagonny-Songspiel", "response": ["* London Sinfonietta, conducted by David Atherton, with Mary Thomas, Meriel Dickinson, Philip Langridge, Ian Partridge, Benjamin Luxon, and Michael Rippon on Deutsche Grammophon (DGG 423 255-2) "]}, {"page": "Sporting song", "response": ["Gambling songs often present the situation from the point of view of a repentant, aging gambler, looking back on his wasted life. The most famous such song is \"The House of the Rising Sun\". Lonnie Donegan recorded \"Gamblin' Man\" as the B-side to \"Putting on the Style\" and took \"Jack O' Diamonds\" to number 1 in the UK in 1957. Other games such as tennis, boating and croquet were middle-class pursuits and are not mentioned in folk-songs. However, a collection of Victorian and Edwardian parlour songs, Play the Game was recorded by Ian Partridge, Peter Savidge and Jennifer Partridge with The Song and Supper Club in 2001. Whaling could be considered a type of hunting, but whaling songs are usually classed as sea shanties."]}, {"page": "Die Jakobsleiter", "response": ["Notable recordings include one on Columbia records, Robert Craft conducting and one with Siegmund Nimsgern as Gabriel, and with Ian Partridge, Anthony Rolfe Johnson and Mady Mesplé in other singing parts, conducted by Pierre Boulez, for CBS released in 1982."]}, {"page": "Nigel Foster (pianist)", "response": ["Foster studied piano at the Royal Academy of Music, at the Guildhall School of Music and Drama and privately with Roger Vignoles. At both the Academy and the Guildhall, he won numerous prizes and awards for piano accompaniment. He was rehearsal pianist for Sir Georg Solti towards the end of Solti's career.  Although he has worked with other instrumentalists (notably violinist Madeleine Mitchell) it is for his work with singers that Foster is best known; he works closely with Sarah Walker in the Guildhall's vocal department and has performed and recorded with singers including Walker, Neil Jenkins, Yvonne Kenny, Philip Langridge, Jane Manning, Ian Partridge, Stephen Varcoe."]}, {"page": "La Dafne", "response": ["* 1977 - Monteverdi-Chor Hamburg, Camerata Accademica Hamburg, conducted by Jürgen Jürgens, with Norma Lerer, Barbara Schlick, Ine Kollecker, Nigel Rogers, Ian Partridge, David Thomas, Berthold Possemeyer; (Deutsche Grammophon Archiv)"]}, {"page": "List of Old Cliftonians", "response": ["* Ian Partridge, tenor"]}, {"page": "List of people associated with the Royal Academy of Music", "response": ["* Ian Partridge (1996)"]}, {"page": "Artaxerxes (opera)", "response": ["*Artaxerxes (English Orpheus Vol 33) – Christopher Robson (Artaxerxes), Catherine Bott (Mandane), Patricia Spence (Arbaces), Ian Partridge (Artabanes), Richard Edgar-Wilson (Rimenes), Philippa Hyde (Semira); The Parley of Instruments; Roy Goodman (conductor). Label: Hyperion Records (released 1996 as CDA67051/2, re-released 2009 as CDD22073)"]}, {"page": "Adrian Boult discography", "response": ["**The Pilgrim's Progress: John Noble, Raimund Herincx, John Carol Case, Wynford Evans, Christopher Keyte, Geoffrey Shaw, Bernard Dickerson, Sheila Armstrong, Marie Hayward, Gloria Jennings, Ian Partridge, John Shirley-Quirk, Terence Sharpe, Robert Lloyd, Norma Burrowes, Alfreda Hodgson, Joseph Ward, Richard Angas, John Elwes, Delia Wallis, Wendy Eathorne, Gerald English, London Philharmonic Choir and LPO, HMV, 1972", "***Norma Burrowes, Sheila Armstrong, Susan Longfield, Marie Hayward, Alfreda Hodgson, Gloria Jennings, Shirley Minty, Meriel Dickinson, Ian Partridge, Bernard Dickerson, Wynford Evans, Kenneth Bowen, Richard Angas, John Carol Case, John Noble & Christopher Keyte, LPO, HMV, 1969 (p 1970)"]}, {"page": "Ian Venables", "response": ["His compositions encompass many genres, and, in particular, he has added significantly to the canon of English art song. Described as \"one of the finest song composers of his generation,\" he has written over sixty works in this genre, which include eight song-cycles: Venetian Songs – Love’s Voice, Op.22 (1995); Invite to Eternity for tenor and string quartet, Op.31 (1997); Songs of Eternity and Sorrow for tenor, string quartet, and piano, Op.36 (2004); On the Wings of Love for tenor, clarinet, and piano, Op.38 (2006); The Pine Boughs Past Music for baritone and piano, Op.39 (2010); Remember This, Op.40, (2011); The Song of the Severn for baritone, string quartet, and piano, Op.43 (2013)and Through These Pale Cold Days, Op.46 (2016). Other songs for solo voice and piano include Two Songs, Op.28 (1997) and Six Songs, Op.33 (1999–2003), A Dramatic Scena – At the Court of the Poisoned Rose for counter-tenor and piano, Op. 20 (1994). His songs have been performed by national and internationally acclaimed artists that include: Roderick Williams, James Gilchrist, Patricia Rozario, Andrew Kennedy, Ian Partridge, Allan Clayton, Caroline MacPhie, Mary Bevan, Brian Thorsett, Susan Bickley, Benjamin Hulett, Sally Porter Munro, Benjamin Appl, Geraldine McGreevy, Alessandro Fisher, Nicky Spence, Daniel Norman, Howard Wong, Nathan Vale, Michael Lampard, Peter Savidge, Kevin McLean-Mair, Mary Plazas, Peter Wilman, Nicholas Mulroy, Nick Pritchard, Elizabeth Atherton, Kristian Sorensen and Ciara Hendrick. "]}, {"page": "List of Royal College of Music people", "response": ["*Ian Partridge (born 1938), tenor"]}, {"page": "Handel Society of New York", "response": ["|Sophia Steffan (Ariodante) Graziella Sciutti (Ginerva) Bernadette Greevy (Polinesso) Carole Bogard (Dalinda) Ian Partridge (Lurcanio)Marius Rintzler (King of Scotland)"]}, {"page": "Shuna Scott Sendall", "response": ["Scholar and one of Malcolm Martineau's Crear Scholars, and also attended the Lake Placid Institute International Vocal Seminar, working with Phyllis Bryn-Julson, Susan Webb, Ian Partridge, Patricia Macmahon and Jennifer Lane."]}, {"page": "Aylmer Buesst", "response": ["He held teaching posts at the Royal Academy of Music, the Royal College of Music and the Guildhall School of Music. His students included the composers Buxton OrrMusic Web International: Obituaries for Buxton Orr and Imogen Holst,Imogen Holst.com  (his name is misspelt as \"Elme Buesst\") the conductors George Weldon,Naxos Robert Jenner,Nailsea Concert Orchestra and Thomas Loten,Dacorum Symphony Orchestra  and the tenor Ian Partridge.Classical Archives"]}, {"page": "Es ist dir gesagt, Mensch, was gut ist, BWV 45", "response": ["* J. S. Bach: Cantatas No. 105 & No. 45, Ernest Ansermet, Chœur Pro Arte de Lausanne, L'Orchestre de la Suisse Romande, Helen Watts, Ian Partridge, Tom Krause, Decca 1966"]}, {"page": "Monteverdi-Chor Hamburg", "response": ["* Marco da Gagliano: La Dafne, Norma Lerer, Barbara Schlick, Ine Kollecker, Nigel Rogers, Ian Partridge, David Thomas, Berthold Possemeyer, Camerata Accademica Hamburg, Jürgen Jürgens [1977], Deutsche Grammophon 437074-2.", "* Claudio Monteverdi: L'Orfeo, Ian Partridge, Nigel Rogers, John Elwes, Camerata Accademia Hamburg, Jürgen Jürgens [1974], Deutsche Grammophon 002894428723."]}, {"page": "Berthold Possemeyer", "response": ["In 1977, Possemeyer performed in a recording of Marco da Gagliano's La Dafne, with Barbara Schlick, Ian Partridge and others, of the Monteverdi-Chor and Camerata Accademica, conducted by Jürgen Jürgens. In 1990, he sang the bass part in a recording of Handel's Utrecht Te Deum and Jubilate with the Münchner Mottenchor and the Münchner Philharmoniker, conducted by Hans Rudolf Zöbeley. He participated in a recording of the Carus-Verlag of the complete sacred choral music by Felix Mendelssohn, performing the Christmas cantata  (From Heaven above) for soprano and baritone soloists, SSATB choir and orchestra (1831). A review noted: \"In his short devout aria  the German baritone Berthold Possemeyer sensitively conveys appropriately restrained expression. Especially affecting are his closing lines . Possemeyer is elegantly toned in his brief arioso \"."]}, {"page": "Chandos Jubilate", "response": ["Ian Partridge (Tenor), Lynne Dawson (Soprano), Michael George (Bass), The Sixteen, The Sixteen Orchestra, Harry Christophers (Conductor). CD: Chandos records. Cat # 554. Released 1994."]}]}}