{"wiki_id": "http://www.wikidata.org/entity/Q5980422", "itemLabel": "Iain Dunn", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Iain_Dunn", "wikipedia_page": {"main": "Iain George William Dunn (born 1 April 1970) is an English former professional footballer who played as a winger in the Football League for York City, Chesterfield, Huddersfield Town and Scunthorpe United.", "link_mentions": [{"page": "Ian", "response": ["*Iain Dunn (born 1970), English former professional footballer"]}, {"page": "Dunn (surname)", "response": ["*Iain Dunn (born 1970), English footballer"]}, {"page": "Iain dunn", "response": ["#REDIRECT Iain Dunn "]}, {"page": "List of people from York", "response": ["*Iain Dunn (born 1970)"]}, {"page": "1996–97 Huddersfield Town A.F.C. season", "response": ["|Iain Dunn||||FW||1 (4)||0||0||0||0||0||1 (4)||0"]}, {"page": "1995–96 Huddersfield Town A.F.C. season", "response": ["|Iain Dunn||||FW||3 (11)||0||1 (1)||0||1 (2)||0||5 (14)||0"]}, {"page": "1994–95 Huddersfield Town A.F.C. season", "response": ["A brilliant start to the season saw Town beat Blackpool 4–1 at Bloomfield Road, a 1–0 defeat to Wycombe Wanderers in their home league game followed, but they then went on a run of 13 league games without defeat, which was brought to an abrupt halt by a 3–0 defeat at York City. During Town's 2nd round match in the Auto Windscreens Shield, Iain Dunn became the first person in England to score a golden goal in first-class professional football.", "|Iain Dunn||||FW||13 (26)||5||0 (2)||1||1 (2)||0||3||1||0 (3)||0||17 (33)||7"]}, {"page": "1993–94 Huddersfield Town A.F.C. season", "response": ["|Iain Dunn||||FW||20 (14)||6||1||0||4||3||3 (3)||4||28 (17)||13"]}, {"page": "1992–93 Huddersfield Town A.F.C. season", "response": ["|Iain Dunn||||FW||25 (3)||3||4||2||0||0||4 (1)||4||33 (4)||9"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Iain Dunn||||1992–1997||62 (58)||14||6 (3)||3||6 (4)||3||10 (4)||9||0 (3)||0||84 (72)||29"]}, {"page": "1994 Football League Trophy Final", "response": ["| ||14||Iain Dunn || "]}, {"page": "1995 Football League Second Division play-off Final", "response": ["The referee for the match, played in front of a Second Division play-off final record attendance of 59,175, was Clive Wilkes.  In injury time in the first half, an overhead kick from Ronnie Jepson was eventually headed in by Andy Booth for his 30th goal of the season to give Huddersfield the lead.   Just over a minute later, Marcus Stewart scored the equaliser for Bristol Rovers with a volley after Justin Channing headed on Worrell Sterling's throw-in.  It was Stewart's 24th goal of the season.  In the 80th minute, Iain Dunn came on as a substitute and his first touch of the match a minute later was to deliver a cross which Booth headed back across the goalmouth for Chris Billy to score to make it 2–1.  In the final minute of the match, Stewart's shot from around  hit the frame of the Huddersfield goal with the goalkeeper Steve Francis beaten.  The match ended 2–1 and Huddersfield were promoted to the First Division.", "In the 80th minute, Iain Dunn was then brought on for Gary Crosby while Bristol Rovers made their first change at the same time with Marcus Browning replacing Taylor.   Dunn's first touch of the match a minute later was to deliver a cross which Booth headed back across the goalmouth for Billy to score.  Lee Archer then came on for Channing for Bristol Rovers in the 84th minute.  Two minutes later, a  strike from Browning was tipped over by Francis.  In the final minute of the match, Stewart's shot from around  hit the frame of the Huddersfield goal with Francis beaten.  The match ended 2–1 and Huddersfield were promoted to the First Division.", "|FW ||12||Iain Dunn || "]}, {"page": "Iain George William Dunn", "response": ["#REDIRECT Iain Dunn"]}]}}