{"wiki_id": "http://www.wikidata.org/entity/Q5981734", "itemLabel": "Ian Hanmore", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Hanmore", "wikipedia_page": {"main": "Ian Hanmore is a Scottish actor known for his role as the warlock Pyat Pree in the second season of the HBO series Game of Thrones.", "link_mentions": [{"page": "List of Game of Thrones characters", "response": ["| Ian Hanmore || Pyat Pree ||  ||  || colspan=6 ", "* Pyat Pree (season 2) portrayed by Ian Hanmore. thumb|upright=0.5|Ian Hanmore Pyat Pree is a warlock from the city of Qarth. He tries to lure Daenerys to the House of the Undying, the warlocks' lair, by stealing her dragons but Daenerys defeats him, rescues her dragons and escapes."]}, {"page": "Game of Thrones (season 2)", "response": ["* Ian Hanmore as Pyat Pree", "Daenerys Targaryen's (Emilia Clarke) stay at Qarth, opened the way for several recurring characters. Nonso Anozie played Daenerys's host at Qarth, Xaro Xhoan Daxos. The character differed a lot from his novel counterpart. Xaro's homosexuality, femininity and caucasian origin were overshadowed by dark skinned Anozie's masculinity and heterosexuality. Acting as one of her suitors is the treacherous warlock Pyat Pree portrayed by Ian Hanmore. Her third and final suitor was the masked priestess Quaithe (Laura Pradelska). Specially created for the television series was the so-called \"Spice King\", a rich merchant from Qarth, played by Nicholas Blane. Also an original creation of the show is the character of Talisa (Oona Chaplin), a healer from Volantis and a romantic interest for Robb. She fills the role of another female interest of Robb's, called Jeyne Westerling, who has no similarities with Talisa whatsoever. In addition to Talisa, Michael McElhatton joins the cast in the role of Roose Bolton, an important character in Robb Stark's storyline. Lastly, Simon Armstrong plays the legendary Night's Watch ranger Qhorin Halfhand."]}, {"page": "Garden of Bones", "response": ["* Pyat Pree played by Ian Hanmore, who has no lines in this episode but is present in the reception at the gates."]}, {"page": "Mary Queen of Scots (2013 film)", "response": ["* Ian Hanmore as Ruthven"]}, {"page": "List of Outlander characters", "response": ["|Ian Hanmore", "* Ian Hanmore as Father Anselm"]}, {"page": "Outlaws (2004 TV series)", "response": ["* Ian Hanmore as Judge Roberts; a magistrate court judge."]}, {"page": "Falling for Figaro", "response": ["*Ian Hanmore as Patrick"]}]}}