{"wiki_id": "http://www.wikidata.org/entity/Q5982022", "itemLabel": "Ian Lawson", "itemDescription": "Footballer (born 1939)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Lawson_(footballer,_born_1939)", "wikipedia_page": {"main": "Frederick Ian Allison Lawson (born 24 March 1939) is an English former professional footballer who played for Burnley, Leeds United, Crystal Palace and Port Vale in the 1950s and 1960s. He scored 34 goals in 99 league games in a 12-year career in the English Football League. He won the First Division title with Burnley in 1959–60, and won the Second Division title with Leeds United in 1963–64.", "link_mentions": [{"page": "Burnley F.C.", "response": ["Jimmy McIlroy is the most capped player while at the club, as he made 51 appearances for Northern Ireland between 1951 and 1962.Simpson (2007), pp. 532–538 The first Burnley player to play in a full international match was John Yates, who took to the field for England against Ireland in March 1889. He scored a hat-trick but was never called up again.Simpson (2007), p. 13 In January 1957, 17-year-old Ian Lawson netted a record four goals on his debut against Chesterfield in the FA Cup third round. The youngest player to play for the club is Tommy Lawton, who was aged 16 years and 174 days on his debut against Doncaster Rovers in the Second Division on 28 March 1936.Simpson (2007), p. 210 His debut made him the then youngest centre-forward ever to play in the Football League. The oldest player is Len Smelt, who played his last match aged 41 years and 132 days against Arsenal in the First Division on 18 April 1925."]}, {"page": "Don Revie", "response": ["After new investment at board level Revie was able to spend £25,000 on Everton's Scotland international Bobby Collins, who he installed as captain. Other arrivals included former Manchester City teammate Billy McAdams, forward Ian Lawson and left-back Cliff Mason. He spent £53,000 to bring John Charles back from Juventus, and though he proved not to be as effective as during his first spell at Leeds, Revie was able to sell him on to Roma for a £17,000 profit within just a few months. Leeds pushed for promotion in 1962–63, but the harsh winter caused many postponements and a backlog of games at the end of the season proved too much for Leeds, who fell away to finish in fifth place."]}, {"page": "List of Leeds United F.C. seasons", "response": ["|Albert JohannesonIan Lawson"]}, {"page": "Frederick Ian Allison Lawson", "response": ["#REDIRECT Ian Lawson (footballer, born 1939)"]}, {"page": "Frederick Lawson", "response": ["#REDIRECT Ian Lawson (footballer, born 1939)"]}, {"page": "Ian Lawson", "response": ["Ian Lawson may refer to:", "*Ian Lawson (footballer, born 1977), English footballer; played for Huddersfield Town, Blackpool, Bury and Stockport County", "*Ian Lawson (footballer, born 1939), English footballer; played for Burnley, Leeds United, Crystal Palace and Port Vale in the 1950s and 1960s", "*Ian Lawson (rower) (born 1977), British Olympic rower"]}, {"page": "List of Burnley F.C. records and statistics", "response": ["*Most goals on debut: Ian Lawson – 4, versus Chesterfield (FA Cup third round, 5 January 1957)Simpson (2007), p. 282"]}, {"page": "1966–67 Port Vale F.C. season", "response": ["The pre-season saw general manager Stanley Matthews injured in a car accident with a National Coal Board lorry on 29 July, Jackie Mudie was also in the car but remained relatively unharmed. As Matthews recovered in came four new forwards, the most significant of which was Crystal Palace's Ian Lawson. Lawson cost £1,000 with an additional £1,000 signing on fee. Other new faces included winger Mick Mahon (Loughborough United); inside-forward Jimmy Goodfellow (Bishop Auckland); and Billy McCartney (Rangers). There was a kit change to an all-white strip, upon the suggestion of Stanley Matthews.", "On the financial side, there was a loss of £7,925 despite a transfer credit of £20,425 and a donation of £19,381 from the Sportsmen's Association and the Development Pool. Gate receipts were just £30,298, whilst the club's overdraft stood at £82,373. Nine players were released at the end of the season, most notably: Mel Charles (Oswestry Town); Ian Lawson and Brian Taylor (Barnsley); and untested reserve Ray Kennedy – who would take a break from football before returning to the game to play for Liverpool and England. Roddy Georgeson was also released at his own request to work in a bank, though he soon turned out for Dundee before beginning a long career in Scottish football.", "|align=\"left\"|FW||align=\"left\"| Ian Lawson", "|–||FW||||Ian Lawson||0||1||0||1", "| August 1966 || FW ||  || Ian Lawson || Crystal Palace || £1,000 || ", "| May 1967 || FW ||  || Ian Lawson || Barnsley || Free transfer || "]}, {"page": "Keith Smith (English footballer)", "response": ["Born in Derbyshire, Smith played professionally for West Bromwich Albion and Peterborough United, before signing for his former West Bromwich Albion manager Dick Graham, now managing Crystal Palace. On 28 August 1965, Smith became the club's first ever substitute when he replaced Ian Lawson. He also scored Palace's fastest ever goal, a six-second strike against Derby County, away from home on 12 December 1964. From Peter Burridge's kick-off Cliff Holton passed to Brian Whitehouse, and Whitehouse launched a long ball for Smith to score one of the fastest goals in association football.Football's fastest goal claimed - Sport - The Independent Smith was transferred to Darlington in 1966, before seeing out his professional career with Leyton Orient and Notts County."]}, {"page": "Ian Lawson (footballer born 1939)", "response": ["#REDIRECT Ian Lawson (footballer, born 1939)"]}, {"page": "1959–60 Burnley F.C. season", "response": ["Bolton Wanderers were the next opponents and were comfortably beaten 4–0, before Burnley defeated Arsenal 4–2 at Highbury on 12 December. Arsenal led 2–0 after the first half; during half-time Potts instructed McIlroy to adopt a deeper midfield role, while Miller was also pushed forward. The team turned the match around: Adamson scored a penalty kick halfway through the second half and Connelly completed his hat-trick inside 16 minutes. McIlroy received many plaudits for his performance, even though he had picked up a groin strain injury early during the game. With McIlroy absent, Burnley hosted last-place Leeds United in front of a season-lowest crowd of 17,398. Leeds won 1–0 and Burnley slipped down from third to fourth place in the table, three points behind leaders Tottenham.Quelch (2015), pp. 130–132 A 2–1 win against Manchester United at Old Trafford on Boxing Day followed, with forward Ian Lawson coming back into the side after three years and scoring the winner. In the return fixture against United two days later, Burnley lost 4–1 in front of 47,696 spectators—the biggest home league crowd of the season. McIlroy returned in the starting line-up, but was unfit and contributed little in attack.Quelch (2015), pp. 134–135"]}, {"page": "History of Burnley F.C.", "response": ["In the 1955–56 season, Burnley reached the fourth round of the FA Cup, where they were knocked out by Chelsea after four replays. On his senior debut in 1957, 17-year-old Ian Lawson scored a club record four goals against Chesterfield in the FA Cup third round. In the next round, Burnley tied their largest  victory when they beat New Brighton by a scoreline of 9–0. The side reached the sixth round but were eliminated by Aston Villa after a replay.Simpson (2007), pp. 281–284 In 1958, former Burnley player Harry Potts was appointed manager. His side mainly revolved around captain Jimmy Adamson and Jimmy McIlroy, the team's playmaker, while his squad consisted mostly of players who were recruited from the club's youth academy. Only two players, McIlroy and Alex Elder, cost a transfer fee, with both players bought from Northern Irish club Glentoran for £8,000 (the equivalent of £ as of ) in 1950 and £5,000 (the equivalent of £ as of ) in January 1959, respectively.Simpson (2007), p. 292 Potts often employed the then unfashionable 4–4–2 formation and implemented a playing style which later became known as Total Football. Jimmy Greaves labelled Burnley's style of play as \"smooth, skilled football that was a warming advertisement for all that was best about British football\". The side endured a tense 1959–60 season, in which Tottenham Hotspur and Wolverhampton Wanderers were the other contenders for the league title. Burnley won their second First Division championship on the last day with a 2–1 victory at Manchester City with goals from Brian Pilkington and Trevor Meredith. Although Burnley had been in contention all season, they had not led the table until the last match was played. The Daily Mirror noted: \"Burnley, the team of quiet men—five of them are part-timers and the whole outfit cost less than £15,000—snatched the First Division Championship from the teeth of the famous Wolves\".Quelch (2015), p. 189 With 80,000 inhabitants, the town of Burnley became one of the smallest to have an English first-tier champion. After the season ended, the squad travelled to the United States to represent England in the International Soccer League, the first modern international American soccer tournament. Burnley defeated Bayern Munich (West Germany), Glenavon (Northern Ireland) and Nice (France) but finished runners-up in the group stage behind Scottish side Kilmarnock."]}]}}