{"wiki_id": "http://www.wikidata.org/entity/Q5982029", "itemLabel": "Ian Learmonth", "itemDescription": "British chief constable", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Learmonth", "wikipedia_page": {"main": "Ian Learmonth  QPM is a retired senior British police officer, his final position was the Chief Constable of Kent Police.\nIan Learmonth was born in Edinburgh in 1958 and is married with children and a grandchild.\nLearmonth policed since starting with Essex Police in 1974 as a Police Cadet; he joined its regular force as a Constable in 1976. His career in Essex progressed through specialist work as a police dog handler, working with general purpose dogs and the more specialist explosive dogs. He then set on the promotion process being posted as a Sergeant and later as Police Inspector for Harlow division in 1989.\nHis career moved from operational policing to working at the Essex Police HQ in Chelmsford, working on IT projects before being promoted in 1995 as Chief Inspector for Operations back at Harlow. He then worked as temporary Superintendent for the Operations Division (Dog Section, Force Support Unit, Marine Unit, Air Support Unit and Horses). In 1999 he was fully promoted to Superintendent at Stansted Airport, seeing through critical operations involving a Boeing 747 crash and a hijack.Once again he returned to Harlow as Chief Superintendent 2000 and then later as Temporary Assistant Chief Constable (Crime).\nIn May 2005 his 28-year career in Essex ended and he returned to his birth country of Scotland as he was promoted to Assistant Chief Constable at Strathclyde Police. His portfolio at Strathclyde was Operational Support and as such was responsible for Support Services, Roads Policing, emergency planning and other major projects affecting the operational policing of the force.\nIn August 2007 Learmonth returned to England and became Deputy Chief Constable at Norfolk Police. He was responsible for human resources, legal services, professional standards and the force's business performance unit.\nOn 5 July 2010 Mr Learmonth succeeded Britain's first black Chief Constable, Michael Fuller as Chief Constable of Kent Police.In January 2014, Learmonth retired from Policing and was in turn succeeded by the current chief constable of Kent, Alan Pughsley.", "link_mentions": [{"page": "Kent Police", "response": ["* Ian Learmonth   5 July 2010 to 4 January 2014"]}, {"page": "Learmonth", "response": ["* Ian Learmonth, British police officer"]}]}}