{"wiki_id": "http://www.wikidata.org/entity/Q5982317", "itemLabel": "Ian McKay", "itemDescription": "British writer and art critic", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_McKay_(writer)", "wikipedia_page": {"main": "Ian McKay (born 1962) is a British writer, art critic, publisher and translator. A former editor of Contemporary Art magazine, and the founder-editor of The Journal of Geography and Urban Research, throughout the 1990s he was best known for his writings on the arts of Eastern Europe, being cited as the first British art critic to emphasize the negative impact of the western art market in that region. Throughout the 1990s and early-2000s, he was a contributor to a wide range of art journals, as well as writing on subjects relating to photography, cinema, and music. Since 2007 his publishing activities have mainly centred on UK Rural Affairs, and the environment however. Though periodically he continues to publish works of art criticism, his most recent publications concern social justice in rural Britain, as well as environmental conservation in the wider European sphere. He has also worked as an academic in several UK universities.", "link_mentions": [{"page": "Christine Keeler", "response": ["Funded by the Arts Council England and Arts Council of Wales, a touring exhibition called Dear Christine opened in Newcastle upon Tyne in June 2019 and toured to Swansea in October 2019, finishing at Arthouse1 in London in February 2020. The culmination of a four-year project by artist/curator Fionn Wilson to reclaim and re-frame Keeler, it features work from twenty women artists \"in order to put a female perspective on a narrative that has mostly been led by men\". The exhibition has been described by journalist and writer Julie Burchill as \"a thing of beauty without cruelty\". Critic and writer Ian McKay wrote: \"In several important ways, Dear Christine, the exhibition, seeks with some noble intent to [...] rescue Christine's image and experience and reprocess it, rescuing it from the newspaper front-page-Keeler that is etched into the collective consciousness\". The exhibition also featured in the Morning Star, The Daily Telegraph and the International Times."]}, {"page": "Redhill, Surrey", "response": ["*Ian McKay (formerly Laidlaw), art critic and writer, lived here between 1976 and 1980."]}, {"page": "Chelsea College of Arts", "response": ["* Ian McKay (writer)"]}, {"page": "New Forest", "response": ["Extracts from the above texts have been brought together by the New Forest author and cultural historian Ian McKay in his anthologies:"]}, {"page": "Vaughan Oliver", "response": ["In 1994, many of those who had collaborated with Oliver over the previous decade contributed to an illustrated catalogue for the retrospective exhibition of his work held at the Pacific Design Center in Los Angeles, This Rimy River.Vulua O'Reighan (ed.), This Rimy River: Vaughan Oliver and Graphic Works 1988–94, Pacific Design Centre, 1994. Recollections of the v23 design experience were provided by individuals such as design writer Rick Poynor,Rick Poynor, Exhibition/Exposition, CRDC, Nantes, 1990/1991; The Graphic Edge, Booth-Clibborn Editions, London, 1993; Design Without Boundaries: Visual Communication in Transition, Booth-Clibborn Editions, London, 1998; Vaughan Oliver: Visceral Pleasures, Booth-Clibborn Editions, London, 2000. and art critic Ian McKay who frames Oliver's work in a fine art context.Ian McKay, Oliver's D-Day, XYZ Design & Technology, May 1990; Un Dandy de la Pochette, Artline International, Summer, 1990."]}, {"page": "List of people from Epsom", "response": ["*Ian McKay (formerly Ian Laidlaw), art critic and writer, born here in 1962"]}, {"page": "Ian McKay (disambiguation)", "response": ["Ian McKay (1953–1982) was a British soldier who won a posthumous Victoria Cross in the Falklands War.", "Ian McKay may also refer to:", "*Ian McKay (footballer) (1923–2010), Australian rules footballer with North Adelaide", "*Ian McKay (writer) (born 1962), English art critic, writer, and academic", "*Ian McKay (historian) (born 1953), Canadian historian", "*Ian McKay (judge) (1929–2014), New Zealand judge"]}, {"page": "Ian McKay (critic)", "response": ["#REDIRECT Ian McKay (writer)"]}, {"page": "Peroxide (punk zine)", "response": ["Peroxide was a punk zine published and edited during the late 1970s by Andrew Thomas, Quentin Cook (a.k.a. Norman Cook) and Ian McKay). Inspired by punk zines such as Chainsaw, Peroxide lasted only two issues, with McKay being ousted by Cook after the first issue. Importantly however, the publication is noteworthy as it served to provide Cook with his first significant point of connection with the professional music business (his contact with Adam Ant being a notable example), and for both McKay and Thomas, their first experiences of publishing. Whilst Cook remained in the music business, McKay became a writer on the visual arts and culture, while Thomas moved into the business sector; he is currently the publisher of Communicate magazine and owner of Cravenhill Publishing."]}, {"page": "Music for Miners", "response": ["Music for Miners (MFM) was a collective of UK writers, artists and filmmakers (including several independent television producers associated with RPM Productions and Channel 4) who attempted to engage young people with politics during the UK Miner's Strike of 1984–1985. Members of the collective included the television producer Don Coutts and the writer and artist Ian McKay. Music for Miners organised several events to raise funds and support striking miners, the most notable of which was the MFM event held at the Royal Festival Hall in London on 14 May 1984.McKay, I. Locating the Wild Zone, London, Free Association Press. 2001. pp.74-75 The English rock group New Order headlined the event'New Order, Royal Festival Hall, 14 May 1984' YouTube video (uploaded 20 May 2020) [Online]. Available at https://www.youtube.com/watch?v=-bZO8DBZEPI [Accessed 29 August 2021]  with John Cooper Clarke supporting.\"Salford Bard at Brindley\", Mid Cheshire Chronicle, 11 March 2009. p.17. [Online] https://issuu.com/trinitymirrorcheshire/docs/midcheshire11/17 [Accessed 29 August 2021] New Order's setlist for the event began with a debut live performance of 'Face Up' and included 'Everything's Gone Green'; 'Temptation'; 'Confusion'; 'Your Silent Face'; 'Leave Me Alone'; and 'Hurt'.'New Order, Royal Festival Hall, 14 May 1984' YouTube video (uploaded 20 May 2020) [Online]. Available at https://www.youtube.com/watch?v=-bZO8DBZEPI [Accessed 29 August 2021]  Music for Miners was disbanded soon after the end of the strike in March 1985."]}, {"page": "List of non-fiction environmental writers", "response": ["| Ian McKay || M || 1962– || English ||  || "]}]}}