{"wiki_id": "http://www.wikidata.org/entity/Q5983021", "itemLabel": "Ian Sturrock", "itemDescription": "British botanist", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Sturrock", "wikipedia_page": {"main": "Ian Sturrock is a rescuer and restorer of orchards and apple trees, saving apple varieties from extinction.  He discovered the last remaining Bardsey apple, and rescued the Diamond apple, as well as many other Welsh apples.\nHe was a finalist for a 2016 St David Award.\n\n", "link_mentions": [{"page": "Bardsey Island", "response": ["A gnarled and twisted apple tree, discovered by Ian Sturrock growing by the side of Plas Bach, is believed to be the only survivor of an orchard that was tended by the monks who lived there a thousand years ago. In 1998, experts on the varieties of British apples at the National Fruit Collection in Brogdale stated that they believed this tree was the only example of a previously unrecorded cultivar, the Bardsey Apple (). The cultivar has since been propagated by grafting and is available commercially. Since its discovery it has led to a resurgence in the discovery and propagation of other Welsh apple varieties."]}, {"page": "Sturrock", "response": ["*Ian Sturrock, British botanist specialising in orchards and apple trees"]}, {"page": "Welsh apples", "response": ["In 1999 a single apple tree was identified by Ian Sturrock on Bardsey Island (located at the end of the Llŷn Peninsula in North Wales). Its uniqueness and the rugged location was seized upon by the media and it was described as \"The rarest tree in the world\".The Guardian Weekend, 6 October 2007, p.88 This media coverage seems to have sparked a resurgence in Welsh apple varieties. The gnarled and twisted tree, growing by the side of Plas Bach, is believed to be the only survivor of an orchard that was tended by the monks who lived there a thousand years ago. In 1998, experts on the varieties of British apples at the National Fruit Collection in Brogdale stated that they believed this tree was the only example of a previously unrecorded cultivar, the Bardsey Apple (). The cultivar has since been propagated by grafting and is available commercially."]}]}}