{"wiki_id": "http://www.wikidata.org/entity/Q5980986", "itemLabel": "Ian Breckin", "itemDescription": "Footballer (born 1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Breckin", "wikipedia_page": {"main": "Ian Breckin (born 24 July 1975) is an English former professional footballer. He is now head coach at Wickersley Wanderers.", "link_mentions": [{"page": "Nottingham Forest F.C.", "response": ["|2006|| Ian Breckin"]}, {"page": "Matt Jackson (footballer)", "response": ["After De Vos left Wigan for Ipswich Town, Jackson again formed another sound partnership with Ian Breckin and helped Wigan to their second promotion in three years when they finished runners-up in the Football League Championship in 2004–05."]}, {"page": "Rob Page", "response": ["In July 2009, Page was offered a player-coach role at Port Vale under Micky Adams, but he decided to stay at Chesterfield. Richardson was relieved of his duties in summer 2009, and his replacement, John Sheridan brought Ian Breckin to the club, who formed a strong early defensive partnership with Page. He played a total of 42 games in the 2009–10 campaign. After an Achilles tendon injury limited Page to just two appearances in the 2010–11 season, he was released by the club in March 2011."]}, {"page": "Nicky Southall", "response": ["Nottingham Forest offered the 33-year-old a two-year contract shortly after. In the 2005–06 season, he came second in the club Player of the Season vote, behind Ian Breckin, with 18% of the votes. He finished the season with eight goals as Forest narrowly missed out on a play-off place."]}, {"page": "Danny Cullip", "response": ["Cullip joined Nottingham Forest for an undisclosed fee in August 2005, signing a three-year contract. Partially owing to the lack of a pre-season with the club Cullip picked up several injuries at the beginning of his City Ground career, most notably to his hamstrings; however when selected he was a valued member of the central defence at the club. The injuries restricted him to just nine starts in the 2005–6 season as Forest struggled. In 2006-7 Cullip began as an integral part of Colin Calderwood's three man defence (alongside Ian Breckin and Wes Morgan) and started Forest's first eight games (during which the side only conceded two goals – one of which to Cullip's former side Brighton) – however against Yeovil Cullip picked up yet another injury and was substituted after 23 minutes."]}, {"page": "2007–08 Nottingham Forest F.C. season", "response": ["|align=\"left\"|6||align=\"left\"|DF||align=\"left\"| Ian Breckin (c)"]}]}}