{"wiki_id": "http://www.wikidata.org/entity/Q5980934", "itemLabel": "Ian Blatchford", "itemDescription": "museum director", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Blatchford", "wikipedia_page": {"main": "Sir Ian Craig Blatchford, FSA (born 17 August 1965) is the director of the Science Museum Group, which oversees the Science Museum in London, England and other related museums. He was previously deputy director of the Victoria and Albert Museum, opposite the Science Museum on Exhibition Road in South Kensington, southwest London.\nBlatchford studied law at Mansfield College, Oxford. He also holds an MA degree in Renaissance studies at Birkbeck, University of London.\nIan Blatchford started his career working at the Bank of England and the merchant bankers Barclays de Zoete Wedd in the City of London. He then joined the Arts Council as the deputy finance director.  He moved to the marketing and design agency Cricket Communications, working in the position of financial controller. In 1996. he joined the Royal Academy of Arts as the director of finance.\nIn April 2002, Blatchford joined the Victoria and Albert Museum as director of finance and resources. He then became deputy director in December 2004. He left to be director of the National Museum of Science and Industry in October 2010.Blatchford is a fellow of the Chartered Institute of Management Accountants and the Society of Antiquaries (FSA). He was chairman of the governors of De Montfort University. He was appointed a Knight Bachelor in the 2019 New Year Honours for services to Cultural Education.", "link_mentions": [{"page": "Science Museum, London", "response": ["The museum's director, Ian Blatchford, defended the museum's sponsorship policy, saying: \"Even if the Science Museum were lavishly publicly funded I would still want to have sponsorship from the oil companies.\"", "* Ian Blatchford (2010–)"]}, {"page": "National Railway Museum", "response": ["In June 2013, the York Press reported that NRM was facing a funding crisis due to a potential 10% annual cut to the Science Museum Group's funding, an estimated real-terms 25% cut following lay-offs and disbandment of projects.  The museum was considering scaling down its functions, re-introducing admissions charges or facing complete closure. However, following a campaign by local residents the Chancellor George Osborne announced a 5% cut in the museum's budget. This prompted Science Museum Group director Ian Blatchford to announce two weeks later that the museum had been doubly saved — he added that had the 10% cut taken place the Group would have chosen to close the National Media Museum in Bradford."]}, {"page": "Science Museum Group", "response": ["* Ian Blatchford (2010–)"]}, {"page": "Clockmakers' Museum", "response": ["Under Cedric Jagger as Assistant Curator from 1974, and then as Keeper from 1980, the Museum underwent significant reorganization and improvement at Guildhall. Jagger was succeeded as Keeper by Sir George White in 1988, who served for thirty years through to 2018, in which time the museum and archive collection was again expanded. The major acquisitions in the late twentieth and early twenty-first century were the Hurle-Bath and Hurle-Bradley watch collections, and the purchase of a significant cache of original John Harrison manuscript documents. With a major bequest by noted collector and Past-Master of the Company Reginald Gowan Beloe TD, the funds were available for a major rebuild of the museum, which reopened with a new and enlarged display organized by White at Guildhall Library in 2001. When its lease finally expired at Guildhall, White was instrumental in securing the offer by Ian Blatchford of a newly designed gallery at the Science Museum, which it now occupies under a thirty-year lease. The collection was moved over the course of 2014–15, and the new gallery was opened by the Princess Royal on 22 October 2015. The new gallery is more than twice the size of the earlier gallery at Guildhall. Visitor numbers in the decade prior to 2014 were of the order of 13,000 per annum, but since the move to the Science Museum numbers have expanded significantly, in view of the more than 3 million visitors to the London Science Museum site each year.Science Museum Group Annual Report 2018–19"]}, {"page": "Blatchford", "response": ["* Ian Blatchford (born 1965), a British museum director"]}, {"page": "John Thomas (sculptor)", "response": ["*\"John Thomas and his ‘wonderful facility of invention’: Revisiting a neglected sculptor\", V&A Online Journal, Issue No. 3 Spring 2011, ISSN 2043-667X, by Ian Blatchford"]}, {"page": "Andrew Scott (museum director)", "response": ["In September 2009, Andrew Scott took over as acting director of the NMSIAndrew Scott to be Acting Director of NMSI , Science Museum, London, 22 September 2009. after the dismissal of Molly Jackson over a breach of NMSI conduct.Museums Journal, October 2009, page 4Louise Jury, Science Museum director sacked after \"judgment error\" in accounts, London Evening Standard, 24 September 2009 On 15 October 2010Email from Andrew Scott 28 October 2010. Andrew Scott retired and the new postholder was Ian Blatchford. He was recruited from being  the Deputy Director of the Victoria and Albert Museum. Since October 2015 Scott has been the Chair of Trustees of York Civic Trust. He is also a Trustee of York Museums Trust."]}]}}