{"wiki_id": "http://www.wikidata.org/entity/Q5983165", "itemLabel": "Ian Wace", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Wace", "wikipedia_page": {"main": "Ian Gerald Patrick Wace (born January 1963) is a British financier who co-founded Marshall Wace Asset Management, a London-based hedge fund with Paul Marshall in 1997. He and Marshall, along with another hedge fund manager Arpad Busson, co-founded a children's non-profit, Absolute Return for Kids (ARK) in 2001.", "link_mentions": [{"page": "Sophie, Countess of Wessex", "response": ["In April 2020, the Countess helped Rhubarb, a catering company, in preparing and delivering food to NHS staff amidst the coronavirus pandemic. It was later reported that she was participating in an initiative organised by Ian Wace to help with preparing food for front-line NHS staff across London. To mark the International Nurses Day in May 2020, the Countess helped the Nourish our Nurses charity group with packing and delivering food for nurses and healthcare staff. The Countess has also volunteered at local food banks, including the Hope Hub, in Surrey and delivered parcels to the homeless during the pandemic. In September 2020, Sophie, alongside her husband and children, participated in the Great British Beach Clean at Southsea Beach in support of the Marine Conservation Society. In October 2020, the Earl and Countess visited community engagement programmes in London to commemorate Black History Month. In November 2020, Sophie presented a Commonwealth Points of Light Award on behalf of the Queen during a digital Women Mediators across the Commonwealth Network forum."]}, {"page": "Morgan, Grenfell & Co.", "response": ["* Ian Wace, founder of Marshall Wace Asset Management"]}, {"page": "S. G. Warburg & Co.", "response": ["* Ian Wace, CEO of Marshall Wace"]}, {"page": "Marshall Wace", "response": ["Marshall Wace LLP is a hedge fund based in London, founded by Paul Marshall and Ian Wace in 1997. Marshall serves as chairman and chief investment officer, and Wace as a chief executive officer & chief risk officer. The company is recognized as one of the world's biggest hedge fund managers.", "Before starting the fund, Paul Marshall was Head of European Equities at Mercury Asset Management, whilst Ian Wace was Head of Equities Trading at Deutsche Bank. In 1997, Marshall and Wace launched Marshall Wace; they were managing $50 million — $25 million from George Soros and $25 million sourced via family and friends. "]}, {"page": "Tanera Mòr", "response": ["Tanera Mòr (Scottish Gaelic: Tannara Mòr) is an uninhabited (previously inhabited) island in Loch Broom in the Inner Hebrides of Scotland. It is the largest of the Summer Isles and was the last inhabited island in that group. Tanera Mòr has issued its own postage stamps and was the location of Frank Fraser Darling's book Island Years. In 2014, it was reported that it was sold for 1.6 million to millionaire Ian Wace", "In June 2017, Ian Wace purchased the island for £1.7 million, far less than the £2.5 million asking price when it was put on the market in 2013. It was reported that he would oversee a four-year development of Tanera Mòr, which could become an \"idyllic retreat capable of hosting up to 60 paying guests\"."]}, {"page": "Paul Marshall (investor)", "response": ["He is the co-founder and chairman of Marshall Wace LLP, one of Europe's largest hedge fund groups.Paul Marshall of Marshall Wace. Movers and Shakers, The Times. 28 December 2009. Retrieved on 8 September 2014. Marshall Wace was founded in 1997 by Marshall and Ian Wace.Computer system gives fund a route to the top. Business.timesonline.co.uk. 15 October 2005. Retrieved on 28 April 2012. At the time, Marshall Wace was one of the first hedge funds in London. The company started with $50 million, half of which was from George Soros."]}, {"page": "Ark (charity)", "response": ["Ark was founded in 2002 by a group of hedge fund financiers including Paul Marshall and Ian Wace of Marshall Wace – and Arpad Busson of EIM Group, founding chairman of the charity's board of trustees.", "As of November 2018 the Ark Schools trustees are Ian Wace (Chairman), Lord Fink, Sir Paul Marshall, Anthony Williams and Anthony Clake."]}, {"page": "Ark Evelyn Grace Academy", "response": ["Ark Evelyn Grace Academy is an academy established under the Learning and Skills Act 2000. Academies are funded by the Department for Education and maintained by the government but they are independent and self-governing charitable trusts. Their construction also tend to be sponsored by businesses or benefactors; Ark Evelyn Grace Academy is supported by ARK (Absolute Return for Kids), an educational nonprofit founded by three hedge fund financiers, Arpad \"Arki\" Busson, Paul Marshall, and Ian Wace. Another hedge-fund manager, David Gorton, contributed £2 million of his own money towards the £38 million cost of building the school; he said he chose Zaha Hadid as its architect because he wanted a \"stunning visual statement\"."]}, {"page": "Charles Wace", "response": ["His brother is British born financier, Ian Wace, co-founder of a London-based hedge fund."]}, {"page": "Saffron Aldridge", "response": ["Aldridge persuaded Canon Inc. to donate 200 free cameras, that were handed out to children between the ages of 3 and 12. They could photograph anything they wanted but they were under instructions not to get help from grown-ups. The top 200 shots went on display and were featured in a coffee-table book. Altogether, including the charity dinner and auction (supported by many celebrities such as Hugh Grant, Gwyneth Paltrow, Bryan Adams and Sting), the project raised £150,000. The following years the campaign was repeated worldwide. With her husband Ian Wace, Aldridge also works for ARK.", "She suffered self-doubt for many years of her career as a model, also marked by the loss of her best friend in the Marchioness disaster and by the death of her mother from ovarian cancer in 1992. While she was modelling, in 1993 Aldridge became pregnant with her first child, Milo, by her partner Simon Astaire. A year later she married media executive Toby Constantine and gave birth to her second son, Finn Constantine in 1997 but the marriage eventually led to divorce. In 2012, she married the financier Ian Wace."]}, {"page": "List of British investors", "response": ["* Ian Wace"]}, {"page": "Wace (surname)", "response": ["* Ian Wace, British financier."]}]}}