{"wiki_id": "http://www.wikidata.org/entity/Q5982136", "itemLabel": "Ian MacNeil", "itemDescription": "British scenic designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_MacNeil_(scenic_designer)", "wikipedia_page": {"main": "Ian MacNeil (born 1960) is a British scenic designer. He won the 1994 Drama Desk Award for Outstanding Set Design for An Inspector Calls and the 2009 Tony Award for Best Scenic Design of a Musical for Billy Elliot The Musical.\n\n", "link_mentions": [{"page": "Angels in America", "response": ["| Ian MacNeil and Edward Pierce "]}, {"page": "Stephen Daldry", "response": ["Daldry was in a relationship with set designer Ian MacNeil for 13 years. They met at an outdoor production of Alice in Wonderland in Lancaster in 1988, and after settling in Camberwell, began collaborating on theatrical productions."]}, {"page": "Robert MacNeil", "response": ["MacNeil became a naturalized American citizen in 1997. He is the father of award-winning theatre scenic designer Ian MacNeil.New York Times interview, May 5, 1994"]}, {"page": "Evening Standard Theatre Awards", "response": ["* 2004 – Ian MacNeil, Jean Kalman and Paul Arditti for Festen", "* 2002 – Ian MacNeil for Plasticine and A Number"]}, {"page": "Critics' Circle Theatre Award", "response": ["| rowspan=\"2\" |Ian MacNeil"]}, {"page": "Young Vic", "response": ["* Vernon God Little  – by DBC Pierre. Adaptation Tanya Ronder. Direction Rufus Norris. Design Ian MacNeil. Costumes Nicky Gillibrand."]}, {"page": "Machinal", "response": ["Machinal was revived by the Royal National Theatre in London in a production directed by Stephen Daldry.From the programme to the production. It opened on 15 October 1993 with Fiona Shaw as the Young Woman, Ciarán Hinds as the Man, and John Woodvine as the Husband.Treadwell (1993, v).\" 'Machinal' Listing and Script, Royal National Theatre\" ciaranhinds.eu (pdf), accessed December 23, 2013 The scenic design, which included a large metal grid that moved into different positions for the play's different scenes, was by Ian MacNeil, costumes were by Clare Mitchell, lighting design was by Rick Fisher, with music by Stephen Warbeck.", "The Royal National Theatre production won three 1994 Laurence Olivier Awards, for Best Revival of a Play or Comedy, for Fiona Shaw as Best Actress and Stephen Daldry as Best Director of a Play. Ian MacNeil was nominated as Best Set Designer.\"Olivier Winners, 1994\"  olivierawards.com, accessed December 23, 2013"]}, {"page": "Desire Under the Elms", "response": ["Lyric Hammersmith (2012) – Directed by Sean Holmes and designed by Ian MacNeil, starring Morgan Watkins as Eben Cabot, Denise Gough as Anna Putnam and Finbar Lynch as Ephraim Cabot."]}, {"page": "Billy Elliot the Musical", "response": ["The musical premiered in the West End at the Victoria Palace Theatre, opening in previews on 31 March 2005 and officially on 11 May 2005. It closed on 9 April 2016, when the theatre closed for refurbishment, after 4,600 performances. The show reportedly cost £5.5 million to produce (the original film version cost $5 million). The producers were Working Title Films, Old Vic Productions Plc and David Furnish. It was directed by Stephen Daldry and choreographed by Peter Darling, as was the original film. Liam Mower, James Lomas and George Maguire were the original actors who alternated in the title role, and the supporting cast included Haydn Gwynne as Mrs. Wilkinson, Tim Healy as Billy's father, and Stephanie Putson as Billy's mother.Thomas S. Hischak, The Mikado to Matilda: British Musicals on the New York Stage, p. 24 The sets were designed by Ian MacNeil, the costumes by Nicky Gillibrand, lighting was by Rick Fisher, and sound by Paul Arditti.", "While the second tour received much praise from audiences and critics, BroadwayWorld.com gave the show a rare mixed review, calling Stephen Daldry's direction \"muddy and over-complicated\", Elton John's music \"dull\", and Ian MacNeil's set \"hideous, over-designed, and unnecessarily complex\".", "| Ian MacNeil", "| Ian MacNeil", "| Ian MacNeil", "| Ian MacNeil", "| Ian MacNeil", "| Ian MacNeil"]}, {"page": "Ian MacNeil", "response": ["Ian MacNeil may refer to:", "* Ian MacNeil (politician), Conservative Party candidate in the 2004 Canadian federal election", "* Ian MacNeil (scenic designer) (born 1960), stage set designer", "* Ian MacNeil (ice hockey) (born 1977), Canadian ice hockey player"]}, {"page": "MacNeil", "response": ["*Ian MacNeil (ice hockey) (born 1977), Canadian ice hockey player", "*Ian MacNeil (scenic designer) (born 1960), British scenic designer, the son of Robert MacNeil"]}, {"page": "Festen (play)", "response": ["Festen premiered at the Almeida Theatre in London and ran until 1 May 2004 before transferring to the Lyric Theatre. It was directed by Rufus Norris, designed by Ian MacNeil and co-produced in the West End by Marla Rubin and Bill Kenwright.  The production then went on a four-month tour throughout the UK. Festen has gone on to be produced around the world in countries including Australia, Greece, Ireland, Mexico & South Africa."]}, {"page": "Hattie Morahan", "response": ["From 29 June to 26 July 2012, she played the lead role of Nora, opposite Dominic Rowan's Torvald, in a new version of A Doll's House by Simon Stephens at London's Young Vic Theatre, in a production directed by Carrie Cracknell and designed by Ian MacNeil. Her performance saw her named Best Actress at the 2012 Evening Standard Awards and the 2012 Critics' Circle Theatre Awards."]}, {"page": "48th Tony Awards", "response": ["** Ian MacNeil – An Inspector Calls"]}, {"page": "Laurence Olivier Award for Best Set Design", "response": ["| Ian MacNeil", "| Ian MacNeil", "| Ian MacNeil", "| Ian MacNeil"]}, {"page": "Laurence Olivier Award for Best Set Designer", "response": ["| Ian MacNeil", "| Ian MacNeil"]}, {"page": "Christopher Oram", "response": ["Early assisting work for designers Anthony Ward and Ian MacNeil, included Assassins at the Donmar Warehouse, Oliver! at the London Palladium and An Inspector Calls and Machinal at the National Theatre."]}, {"page": "8th Helpmann Awards", "response": ["**Ian MacNeil – Billy Elliot the Musical"]}, {"page": "63rd Tony Awards", "response": ["* Ian MacNeil – Billy Elliot the Musical"]}, {"page": "Jerker", "response": ["The UK Premiere of Jerker was performed in London at the Gate Theatre (London) in 1990 under the direction of Stephen Daldry (assisted by Kevin Knight) with Set Design by Ian MacNeil (scenic designer) with Stevan Rimkus (as JR) and Anton Horowitz as Bert. Jerker has subsequently been considered \"one of the most important pieces of gay theater ever created\"."]}, {"page": "Drama Desk Award for Outstanding Set Design", "response": ["| Ian MacNeil", "| Ian MacNeil"]}]}}