{"wiki_id": "http://www.wikidata.org/entity/Q5981847", "itemLabel": "Ian Hughes", "itemDescription": "British footballer (born 1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Hughes_(footballer,_born_1974)", "wikipedia_page": {"main": "Ian Hughes (born 2 August 1974) is a Welsh former professional footballer. He played as a defender and was a Welsh under-21 international.", "link_mentions": [{"page": "John Hills (footballer)", "response": ["Hills made almost two hundred appearances over five years, scoring twenty goals and he also held the captain's armband in the absence of Ian Hughes."]}, {"page": "2003–04 Huddersfield Town A.F.C. season", "response": ["|6||Ian Hughes||||DF||12 (1)||1||0||0||1||0||1||0||0||0||14 (1)||1"]}, {"page": "Elton High School", "response": ["*Ian Hughes, former Bury and Blackpool football player"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Ian Hughes||||2003–2004||12 (1)||1||0||0||1||0||1||0||0||0||14 (1)||1"]}, {"page": "1995 Football League Third Division play-off Final", "response": ["|DF ||13||Ian Hughes "]}, {"page": "2002 Football League Trophy Final", "response": ["|DF ||5 ||Ian Hughes || "]}, {"page": "2001 Football League Third Division play-off Final", "response": ["The match was refereed by David Pugh in front of a crowd of 23,600.  After 27 seconds, an error from Blackpool's goalkeeper Phil Barnes following a backpass from Brian Reid allowed Chris Tate to score, putting Leyton Orient into an early lead.  In the 35th minute, the scores were level as Ian Hughes headed in Paul Simpson's corner to make it 1–1.  Two minutes later, Houghton restored Leyton Orient's lead with a strike from around  which beat Barnes.  A minute before half-time, Blackpool equalised once again as Reid converted Gary Parkinson's cross, and the half ended 2–2.  With 13 minutes of the match remaining, Blackpool took the lead for the first time, after Simpson scored following Brett Ormerod's through ball. In the 88th minute Omerod converted a cross from John Hills from around  to make it 4–2 to Blackpool who secured promotion to the Second Division.", "The match kicked off around 3p.m. on 26 May 2001 at the Millennium Stadium in Cardiff in front of 23,600 spectators.  After 27 seconds, an error from Blackpool's goalkeeper Phil Barnes following a backpass from Reid allowed Chris Tate to score, putting Leyton Orient into an early lead.  In the sixth minute, Tate's header from an Andy Harris cross went over the Blackpool crossbar.  Three minutes later Bayes saved Danny Coid's attempt to score from close range, before diving to keep out a  strike from Coid in the 13th minute. Parkinson's free kick from  went high over the Leyton Orient bar in the 19th minute before Barnes tipped over a diving header from David McGhee.  Another McGhee header was saved by Barnes in the 27th minute.   Seven minutes later the scores were level as Ian Hughes headed in Paul Simpson's corner to make it 1–1.  Two minutes later, Houghton restored Leyton Orient's lead with a strike from around  which beat Barnes.  A minute before half-time, Blackpool equalised once again as Reid converted Parkinson's cross, and the half ended 2–2.", "|DF ||5 ||Ian Hughes"]}, {"page": "2001–02 Football League Trophy", "response": ["|DF ||5||Ian Hughes || "]}, {"page": "Ian Hughes", "response": ["Ian Hughes may refer to:", "* Ian Hughes (Australian footballer) (1939–1976), Australian rules footballer", "* Ian Hughes (diplomat) (born 1951), British diplomat", "* Ian Hughes (footballer, born 1946), Welsh footballer", "* Ian Hughes (footballer, born 1974), Welsh footballer", "* Ian Hughes (footballer, born 1961), English footballer for Sunderland", "* Ian Hughes (epredator) (born 1967), British technology evangelist and television personality", "* Ian Hughes (rugby league) (born 1972), rugby league footballer of the 1990s and 2000s"]}]}}