{"wiki_id": "http://www.wikidata.org/entity/Q5980915", "itemLabel": "Ian Bishop", "itemDescription": "Cricket player (born 1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Bishop_(English_cricketer)", "wikipedia_page": {"main": "Ian Emlyn Bishop (born 26 August 1977) is an English cricketer who played first-class cricket for Somerset and Surrey and List A cricket for Devon, Surrey, and the Surrey Cricket Board between 1996 and 2004. He was born in Taunton, Somerset.\nA tail-end batsman and a right-arm fast bowler, Bishop played for Somerset's second eleven from 1995 but made only one first-team appearance, the match against the 1996 Pakistan touring team and he failed to take a wicket in that. Bishop left Somerset after a year in the second team in 1997; in 1998 he played Minor Counties cricket for Devon and made his List A debut in the NatWest Trophy match against Yorkshire, without success. In the second half of the 1998 season, he began playing second-team matches for Surrey and in 1999, after appearing in the Surrey Cricket Board side in the first round of the NatWest Trophy one-day competition, he appeared in several Surrey first-team games in the Sunday League, taking four wickets for 34 runs, his best List A figures, in the game against Durham. He was less successful in a handful of first-class matches for the Surrey first team, with best bowling figures of two wickets for 45 runs in the game against Derbyshire. There were a few further List A and first-class matches for Bishop in 2000 but he did not improve on these figures and after a few second-eleven matches in 2001 he left the Surrey staff. He resumed playing Minor Counties cricket with Devon and that brought further List A appearances between 2002 and 2004.", "link_mentions": [{"page": "Ian Bishop", "response": ["Ian Bishop may refer to:", "*Ian Bishop (cricketer) (born 1967), West Indian Test cricketer", "*Ian Bishop (English cricketer) (born 1977), English first-class cricketer", "*Ian Bishop (footballer) (born 1965), former football midfielder", "*Ian Bishop (priest) (born 1962), Archdeacon of Macclesfield"]}, {"page": "Ian Bishop (Somerset and Surrey cricketer)", "response": ["#REDIRECT Ian Bishop (English cricketer)"]}, {"page": "Ian Bishop (cricketer, born 1977)", "response": ["#REDIRECT Ian Bishop (English cricketer)"]}, {"page": "List of Surrey Cricket Board List A players", "response": ["*Ian Bishop (1999): IE Bishop"]}]}}