{"wiki_id": "http://www.wikidata.org/entity/Q5980749", "itemLabel": "Ian Alexander", "itemDescription": "Scottish footballer (born 1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Alexander_(footballer)", "wikipedia_page": {"main": "Ian Alexander (born 26 January 1963) is a Scottish former professional footballer, who played the majority of his career at Bristol Rovers.\nAlexander played for Rotherham United, Motherwell and Morton, and spent a year playing in Cyprus with Pezoporikos Larnaca, before joining Rovers in 1986. He was appointed manager of Yate Town in 1997. He then managed Wotton Rovers in 2000.", "link_mentions": [{"page": "Wotton-under-Edge", "response": ["*Ian Alexander – footballer"]}, {"page": "Pezoporikos Larnaca FC", "response": ["* Ian Alexander (1985–86)http://www.neilbrown.newcastlefans.com/player/ianalexander.html"]}, {"page": "List of foreign football players in Cypriot First Division", "response": ["*Ian Alexander – Pezoporikos Larnaca (1985–1986)"]}, {"page": "1989 Football League Third Division play-off Final", "response": ["Jeffers missed a good chance to open the scoring in the 30th minute following a Beckford flick-on from a corner kick. It was Bristol Rovers that were the first to score; keeper Nigel Martyn hit the ball upfield and Penrice volleyed the ball into the net over a stranded Mark Grew following a White flick-on. Futcher headed the ball into the net just before half-time only to find his goal disallowed for offside. Port Vale dominated the second half and it was Earle who equalised seventeen minutes from time to level the tie, scoring a headed goal from a Futcher cross. Port Vale nearly won the match in the dying moments, only for Beckford's header to be cleared off the goal-line. Bristol Rovers manager Francis bemoaned Futcher being yellow-carded for an altercation with Ian Alexander when he believed a red was more appropriate, saying \"It was an out and out nut!\" In his match report, Nicholas Harling of The Times wrote that \"Vale finished the first leg looking by far the more accomplished side\".", "|DF ||2||Ian Alexander", "|DF ||2||Ian Alexander"]}, {"page": "Phil Purnell", "response": ["After retiring from playing, he worked in insurance, and also continued in football on a part-time basis as assistant manager of Yate Town, where his former Rovers teammate Ian Alexander was manager, and also at Winterbourne United."]}, {"page": "1990 Associate Members' Cup Final", "response": ["| || ||Ian Alexander || "]}, {"page": "Ian Alexander", "response": ["Ian Alexander may refer to:", "* Ian Alexander (actor) (born 2001), American actor starring in The OA", "* Ian Alexander (footballer) (born 1963), Scottish footballer", "* Ian Alexander (politician) (born 1947), Australian politician", "* Ian Alexander (aviation), Scottish entrepreneur associated with the Rigid Airship Design consortium"]}]}}