{"wiki_id": "http://www.wikidata.org/entity/Q5980525", "itemLabel": "Iain Macnab", "itemDescription": "British painter (1890-1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Iain_Macnab", "wikipedia_page": {"main": "Iain Macnab of Barachastlain (21 October 1890 – 24 December 1967) was a Scottish wood-engraver and painter.\nAs a prominent teacher he was influential in the development of the British school of wood-engraving. His pictures are noted for clarity of form and composition.His concepts of the sense of motion which could be created by the shape of repetitive parallel lines were of profound influence, in particular in relation to the art of linocut – an art form which both he and Claude Flight pioneered at the Grosvenor School of Modern Art where with the teachers included Cyril Power and Sybil Andrews.His work was shown in the British pavilion at the Venice Biennale of 1930.", "link_mentions": [{"page": "Wood engraving", "response": ["*Iain Macnab"]}, {"page": "Society of Wood Engravers", "response": ["* Iain Macnab"]}, {"page": "List of British artists", "response": ["* Iain Macnab (1890–1967) – Scottish painter"]}, {"page": "Sybil Andrews", "response": ["In 1925 she was employed by Iain Macnab as the first secretary of The Grosvenor School of Modern Art, where she also attended Claude Flight's linocutting classes. Around 1926 she began producing linocuts and one of her earliest prints Limehouse is in the British Museum Collection. Between 1928 and 1938 she exhibited linocuts extensively through shows organised by Flight."]}, {"page": "Grosvenor School of Modern Art", "response": ["The Grosvenor School of Modern Art was a private British art school and, in its shortened form (\"Grosvenor School\"), the name of a brief British-Australian art movement. It was founded in 1925 by the Scottish wood engraver Iain Macnab in his house at 33 Warwick Square in Pimlico, London. From 1925 to 1930 Claude Flight ran it with him, and also taught linocutting there; among his students were Sybil Andrews, Cyril Power, Lill Tschudi and William Greengrass."]}, {"page": "Heatherley School of Fine Art", "response": ["* Iain Macnab"]}, {"page": "Samson Press", "response": ["The Samson Press was unusual for being run by two women, on a commercial footing, at a time when women found it very hard to find practical employment in the printing industry. It was also notable for its patronage of young and unknown artists, who were commissioned to provide wood-engravings, linocuts and drawings for the Press's publications. Iain Macnab was an early friend of the Press, and produced numerous images for Grierson and Shelmerdine, and some of the other artists employed by the Press, such as Tom Chadwick and Gwenda Morgan, were pupils at Macnab's Grosvenor School of Art.", "Joan Mary Shelmerdine (1899–1994) was born in LancashireBirth records for England, and 1911 census and studied French at Somerville College, Oxford where she met Flora Grierson. In 1929 she published a translation with introduction to The Secret History of Henrietta, Princess of England, first wife of Philippe, Duc d'Orléans, together with Memoirs of the Court of France for the Years 1688-1689. In 1951 Samson published her Introduction to Woodstock, with drawings by Iain Macnab. When Shelmerdine died in 1994, the death announcement in The Times described her as \"Founder of the Samson Press and lifelong friend of the late Flora Grierson\".The Times, 5 Oct 1994"]}, {"page": "William Kermode", "response": ["Kermode studied at Iain Macnab's Grosvenor School of Modern Art, probably between 1925 and 1928, and is believed to have shown linocuts at the first British exhibition of the medium at the Redfern Gallery, London, in 1929.National Art Library Reading Room (Victoria & Albert Museum) He designed posters for the London Underground in 1924 including \"Leave this and Move to Edgware\" printed by the Westminster Press. In 1928 Kermode was introduced to Henry Williamson by the well-known literary critic Sir John (Jack) Squire. Kermode had made linocuts from his war experiences and wanted someone to write short caption-like paragraphs. The result was the highly acclaimed Patriot’s Progress, today considered as an important contribution to the literature of World War I. Kermode also provided a cover design for a cheap edition of Tarka the Otter, published in 1929.Henry Williamson Society He is also known to have illustrated The Specialist by Charles SaleNorfolk Library & Information Service and Moscow Has a Plan by M. Ilin (Jonathan Cape, 1931).British Library Catalogue"]}, {"page": "Frederic Whiting", "response": ["Frederic Whiting  (1874 – 1 August 1962), was an English painter who had studied at the Académie Julian and taught at Heatherley School of Fine Art with Iain Macnab and Bernard Adams. His work was part of the painting event in the art competition at the 1948 Summer Olympics. He also worked for The Graphic as a war correspondent, covering the Chinese and Russo-Japanese War.Mr. Frederic Whiting Artist And Teacher Of Art (Obituaries) The Times Saturday, Aug 04, 1962; pg. 8; Issue 55461; col E‘WHITING, Frederic’, Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2007; online edn, Oxford University Press, Dec 2007 accessed 12 Jan 2014"]}, {"page": "Peter Purves Smith", "response": ["Following his father's suicide, Peter travelled extensively throughout Europe. In England, 1934, Purves Smith's sister Jocelyn noticed his hobby of drawing, and suggested he attend an art school. He studied under Iain Macnab at Grosvenor School of Modern Art in 1935, and back in Australia under George Bell at the Bourke Street Studio School. There he met again old Geelong friend Russell Drysdale, and fellow Bell student Maisie Newbold, whom he married in 1946 at Toorak with Drysdale as best man. Drysdale, too, had been a jackaroo, and both artists worked closely together and influenced each other's art. Apart from his teachers and Drysdale, Amedeo Modigliani, Paul Nash, Henri Rousseau, Maurice Utrillo, Christopher Wood and surrealism impacted what would become Purves Smith's highly personal style."]}, {"page": "List of people from Iloilo", "response": ["* The Scottish artists, Iain Macnab and Chica Macnab were both born in Iloilo"]}, {"page": "Ethel Spowers", "response": ["Her style and artistic focus changed in 1928–29 when she studied linocut printmaking with Claude Flight at the Grosvenor School of Modern Art in London. She was one of several Australian women artists at the Grosvenor School, including Dorrit Black and Eveline Winifred Syme.Stephen Coppel, \"Claude Flight and his Australian Pupils,\" Print Quarterly2(4)(December 1985):  263-283.  Further classes followed in 1931, during which Spowers absorbed modernist ideas of rhythmic design and composition from the principal of Grosvenor School Iain Macnab."]}, {"page": "Gwenda Morgan", "response": ["Following school in PetworthPeter Jerrome, Introduction to The Diary of a Land Girl, 1939-1945, Whittington Press, 2002. and at Brighton and Hove High School, Morgan, studied at Goldsmiths' College of Art in LondonA History of British Wood Engraving. Albert Garrett. 1978. Page 389. from 1926. From 1930 she attended the Grosvenor School of Modern Art in Pimlico where she was taught and strongly influenced by the principal, Iain Macnab.Christopher Sandford, 'Gwenda Morgan: an Engraver of the Countryside.' Studio International, 1950. Volume 140. Page 16. The Grosvenor School was a progressive art school and the championing of wood engraving and linocuts fitted with its democratic approach to the arts.Jeanne Cannizzo, A Study in Contrast: Sybil Andrews and Gwenda Morgan. Art Gallery of Greater Victoria, Canada. 2015."]}, {"page": "Iain MacNab", "response": ["#REDIRECT Iain Macnab"]}, {"page": "Doris Brabham Hatt", "response": ["Hatt first exhibited her paintings with the International Society of Sculptors, Painters and Gravers at the Grosvenor Gallery, London, in 1918. Her work was initially influenced by the way the French modernist movement was being interpreted in Britain by artists such as Paul Nash, John Nash, Iain Macnab and Ethelbert White, but as she began to travel, for example, to Paris, and was able to see pictures by Paul Cézanne, Pablo Picasso and Georges Braque at first hand, the influence of Modernism deepened. After her visits to Vienna in the early 1920s she produced a small number of woodcuts and wood engravings from 1925, but there were none after 1930."]}, {"page": "Chica Macnab", "response": ["Macnab was born in the Philippines in the provance of Iloilo where her Scottish parents were based while her father worked for the Hong Kong and Shanghai Bank. When the family returned to Scotland, Macnab was educated at Kilmacolm before studying at the Glasgow School of Art from 1922 to 1925. She became a founding member of the Glasgow-based Society of Artist Printers and as soon as she graduated, the Glasgow School employed Macnab to establish and run a class on lithography and colour block printing. Macnab only taught the class for a year, during 1926 and 1927, but her students included Alison Mackenzie. She remained in Glasgow and joined the Glasgow Society of Lady Artists. In 1927 Macnab married James Munro, a chemist, and after she started to raise a family appears to have put her artistic career on hold. After 1967 she returned to painting and exhibited several oil paintings as Ada Munro. Her brother was also an artist, the painter and printmaker Iain Macnab."]}, {"page": "Rachel Reckitt", "response": ["After a spell at the Taunton School of Art, Reckitt studied wood engraving at the Grosvenor School of Modern Art in London from 1933 to 1937, where she was taught by Iain Macnab. During this period she began exhibiting stone and wood carvings with the London Group and also prints with the Society of Wood Engravers. In 1937 she began making sculptured inn signs using metal sheeting and other materials for pubs in Somerset. During World War II Reckitt undertook relief work in the Whitechapel area of London and also assisted with the evacuation of children from the city to Golsoncott. After the war she studied sculpture at the Hammersmith School of Building Crafts for five years and also studied lithography at the Central School of Art and Design."]}, {"page": "Adolfine Mary Ryland", "response": ["Ryland was born in Windsor, where her father was a solicitor and where she would settle later in life. She studied at the Heatherley School of Fine Art from 1920 to 1925 and then at the Grosvenor School of Modern Art where she was taught linocut and woodcut techniques by Iain Macnab and Claude Flight. In 1927 she began exhibiting with the Women's International Art Club, WIAC, which became her main exhibition venue throughout her career. In 1936 Ryland became a member of WIAC and remained so for many years until the late 1950s. In 1931, she exhibited at the Ward and Albany Galleries and later at both the Wertheim and Bloomsbury Galleries."]}, {"page": "Alison McKenzie", "response": ["McKenzie was born in Bombay to Scottish parents and was educated in England at the Prior's Field School from 1921 to 1925. She studied at the Glasgow School of Art for four years, during which time she won the Fra Newbery medal, before moving to London in 1929 to learn wood engraving at the Grosvenor School of Modern Art under Iain Macnab. McKenzie undertook several commercial commissions, including producing poster designs for the London and North Eastern Railway. In 1937 McKenzie illustrated an edition of John Milton's On the Morning of Christ's Nativity for the Gregynog Press. McKenzie's sister, Winifred, was also an artist and during World War II they moved to St Andrews in Scotland. At St Andrews, along with Annabel Kidston, they organised drawing and engraving classes for the Allied troops, many from Poland, stationed there."]}]}}