{"wiki_id": "http://www.wikidata.org/entity/Q5983156", "itemLabel": "Ian Vine", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Vine", "wikipedia_page": {"main": "Ian Vine (born 3 January 1974 in Portsmouth, England) is a British composer.  Vine spent his formative years in Libya and Hong Kong. He studied composition at the Royal Northern College of Music with Anthony Gilbert (b. 1934, UK) and privately with Simon Holt (b. 1958, UK).\nOne can detect traces of Near and Far Eastern modalities as well as gestural and formal elements in his music.  SIRI (1997), a frequently performed tour-de-force for solo percussion with electronics, uses a rhythmic and structural language found in the highly ritualised percussion music of Japan and Korea.\nAlthough much of his work tends toward longer time frames, some of his pieces are very short.  Conversely, the pieces sound as if they are longer.  writing on water (1999-), commissioned by Matthew Herbert and released on the Accidental label, is an expanding collection of short (sometimes only 20 seconds long) works using recorded acoustic instruments;  and shadow grounds (1999), commissioned by the Huddersfield Contemporary Music Festival for the ensemble recherche as part of their In Nomine Broken Consort Book, a three-minute non-miniature of suspended sound.\nHis three black moons (1999), commissioned by the London Sinfonietta, was described by The Guardian, '...the most striking piece takes its title from an Alexander Calder mobile - its magical floating sonorities had a Feldmanesque beauty.'  Ian Vine is described as 'one of the most striking new voices to have come to light' (The Guardian), his music is performed across Europe and has been broadcast worldwide.\nIan Vine is the artistic director of new music ensemble Radius.", "link_mentions": [{"page": "List of 21st-century classical composers", "response": ["|Ian Vine || 1974 ||  || British ||  ||"]}, {"page": "London Sinfonietta", "response": ["The Sinfonietta's acclaimed discography includes seminal recordings of many 20th-century classics, including the premiere recording of Hans Werner Henze's song cycle Voices under the baton of the composer. The ensemble was featured on EMI's 1988 3-CD authentic recording of Kern and Hammerstein's Show Boat. It made a 1991 recording of Górecki's Third Symphony for Nonesuch which sold over 700,000 copies in its first two years of release. The ensemble's discography has recently been expanded by releases on the London Sinfonietta Label, focussing on live performances of otherwise unavailable repertoire. These CDs include 50th birthday tributes to Oliver Knussen, and Toru Takemitsu’s Arc and Green. Between 2006 and 2009, the London Sinfonietta Label—in conjunction with the Jerwood Foundation and NMC Recordings—released the Jerwood Series of six CDs featuring London Sinfonietta players' performances of new compositions by young composers, which include Richard Causton, Dai Fujikura, Ian Vine and Larry Goves. Jerwood Series page on London Sinfonietta website. In 2006 a collaboration with Warp Records, featuring recordings of the music of Warp Records artists such as Aphex Twin, as well as modern classical music composers such as John Cage, was released as Warp Works & Twentieth Century Masters."]}, {"page": "Anthony Gilbert (composer)", "response": ["Until 1970 he was working in London at Schotts the music publishers where he was Editor of contemporary music. In 1970 he became Granada Arts Fellow at Lancaster University and then went on to become first Tutor, then Head of the School of Composition at the Royal Northern College of Music, where he stayed until retirement in 1999. Amongst his students there were Sally Beamish, Tim Benjamin, Martin Butler, Simon Holt, Paul Newland, Janet Owen Thomas, James Saunders and Ian Vine."]}, {"page": "Vine (surname)", "response": ["* Ian Vine, British composer"]}, {"page": "Radius (music ensemble)", "response": ["Radius is a London music ensemble founded in 2007 by the British composer Tim Benjamin. The ensemble specialises in the performance of new music from around the world (though primarily in the Western classical music tradition) written by living composers and 20th-century masters. The ensemble's artistic director is the British composer Ian Vine, a contemporary of Tim Benjamin at the Royal Northern College of Music from 1994 to 1997. Modelled on the 1960s ensemble The Fires of London, (which in turn was derived from the instrumentation of Schoenberg's Pierrot Lunaire), the core instrumental line-up of Radius is flute, clarinet, violin, cello, piano, and percussion. To this instrumentation have been added trumpet, trombone, French horn, actors, and vocalists, as required for the performance of specific works.", "*Ian Vine: underpaintings (2005), Wigmore Hall, London, 20 April 2007", "*Ian Vine: X (2007), Wigmore Hall, London, 8 January 2008", "*Ian Vine: fifty objects (2007), Wigmore Hall, London, 8 January 2008 †", "*Ian Vine: Gesso (2008), Southbank Centre, London, 25 May 2008"]}]}}