{"wiki_id": "http://www.wikidata.org/entity/Q5982820", "itemLabel": "Ian Samwell", "itemDescription": "English musician, songwriter and record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Samwell", "wikipedia_page": {"main": "Ian Ralph Samwell (19 January 1937 – 13 March 2003) was an English musician, singer-songwriter and record producer. He is best known as the writer of Cliff Richard's debut single \"Move It\", and his association with the rock band America, with whom he had his biggest commercial success with their hit single, \"A Horse with No Name\". He also worked with rock bands, such as the Small Faces, The Grateful Dead, Frank Zappa, Joni Mitchell, John Mayall and Hummingbird.\nSamwell wrote for many other British artists, including Joe Brown, Elkie Brooks, Kenny Lynch and Dusty Springfield. Several of his songs were recorded in Spanish by the Mexican group, Los Teen Tops and were released in Latin America and the Spanish-speaking territories of the world. He also worked as a record producer with Sounds Incorporated, Georgie Fame, John Mayall and the mod band The Small Faces, co-writing their 1965 hit single \"Whatcha Gonna Do About It\".", "link_mentions": [{"page": "Cliff Richard", "response": ["Harry Webb became lead singer of a rock and roll group, the Drifters (distinct from the US group of the same name). The 1950s entrepreneur Harry Greatorex wanted the up-and-coming rock 'n' roll singer to change his name. The name Cliff was adopted as it sounded like \"cliff face\", which suggested \"Rock\". It was \"Move It\" writer Ian Samwell who suggested the surname \"Richard\" as a tribute to Webb's musical hero Little Richard.", "Before their first large-scale appearance, at the Regal Ballroom in Ripley, Derbyshire in 1958, they adopted the name \"Cliff Richard and the Drifters\". The four members were Harry Webb (by then going under the stage name \"Cliff Richard\"), Ian Samwell on guitar, Terry Smart on drums and Norman Mitham on guitar. None of the other three played with the later and better known Shadows, although Samwell wrote songs for Richard's later career.  Agent George Ganjou saw the group perform in London, and recommended them to Norrie Paramor for an audition.Richard Anthony Baker, Old Time Variety: an illustrated history, Pen & Sword, 2011, , p.208"]}, {"page": "America (band)", "response": ["Eventually, the trio dubbed itself America, inspired by the Americana jukebox in their local mess hall and chose it because they did not want anyone to think they were British musicians trying to sound American. They played their first gigs in the London area, including some highlights at the Roundhouse in London's Chalk Farm district. They were eventually taken on by producer Ian Samwell, best known for writing Cliff Richard's 1958 breakthrough hit \"Move It\", and his partner Jeff Dexter, and through their efforts, they were eventually contracted to Kinney Records (UK) in March 1971 by Ian Ralfini and assigned to the UK Warner Bros. label."]}, {"page": "John Mayall", "response": ["In 1956, with college fellow Peter Ward, Mayall had founded the Powerhouse Four which consisted of both men and other local musicians with whom they played at local dances. In 1962 Mayall became a member of the Blues Syndicate. The band was formed by trumpeter John Rowlands and alto saxophonist Jack Massarik, who had seen the Alexis Korner band at a Manchester club and wanted to try a similar blend of jazz and blues. It also included rhythm guitarist Ray Cummings and drummer Hughie Flint, whom Mayall already knew. In 1962 John and his band were frequent and popular artists at all night R&B sessions at the 'Twisted Wheel' cellar club in central Manchester. Alexis Korner persuaded Mayall to opt for a full-time musical career and move to London, where Korner introduced him to many other musicians and helped them to find gigs. In late 1963, with his band, which was now called the Bluesbreakers, Mayall started playing at the Marquee Club. The line-up was Mayall, Ward, John McVie on bass and guitarist Bernie Watson, formerly of Cyril Davies and the R&B All-Stars. The next spring Mayall obtained his first recording date with producer Ian Samwell. The band, with Martin Hart at the drums, recorded two tracks : \"Crawling Up a Hill\" as well as \"Mr. James\". Shortly after, Hughie Flint replaced Hart and Roger Dean took the guitar from Bernie Watson. This line-up backed John Lee Hooker on his British tour in 1964."]}, {"page": "Small Faces", "response": ["The band signed a management contract with management impresario Don Arden, and they were in turn signed to Decca Records for recording. They released a string of high-energy mod/soul singles on the label. Their debut single was in 1965 with \"Whatcha Gonna Do About It\", a Top 20 UK singles chart hit. Marriott and Lane are credited with creating the instrumental to the song, \"borrowing\" the guitar riff from the Solomon Burke record \"Everybody Needs Somebody to Love\". The lyrics were co-written by Drifters band member Ian Samwell (who wrote one of the first British rock'n'roll records, \"Move It\") and Brian Potter."]}, {"page": "Small Faces (1967 album)", "response": ["The album is considered to be the artistic breakthrough for the group in terms of songwriting and composition, and marks their transition from a mod-influenced blue-eyed soul/R&B band to a psychedelic studio group, which they were then seen as from this point until their breakup in early 1969. 'Small Faces' was recorded over a lengthy (by the standard of the time) period of nine months, during the band's tenure on both Decca and Immediate Records, at two separate studios. It is their first LP to contain solely original compositions. Thirteen of the album's fourteen tracks were either written or co-written by Steve Marriott and Ronnie Lane, in contrast to the group's 1966 debut, in which only seven of the twelve tracks are credited to the band, with the remaining tracks being written by artists such as Kenny Lynch and Ian Samwell, or being R&B covers that were parts of the group's early repertoire."]}, {"page": "Hank Marvin", "response": ["Marvin wrote \"Driftin'\", \"Geronimo\", \"Spider Juice\" (his daughter's name for orange juice), \"I Want You to Want Me\" for the Shadows, and \"The Day I Met Marie\". He co-wrote Richard's 1961 hit; \"Gee Whizz It's You\" with Ian Samwell. With Welch, Brian Bennett, and John Rostill, he wrote hits for Cliff Richard, including; \"On the Beach\", \"I Could Easily Fall in Love with You\", \"Time Drags By\", and \"In the Country\"."]}, {"page": "Isaac Guillory", "response": ["Isaac Guillory was produced by Ian Samwell, Jeff Dexter, Jim Fairs, and was released in 1974 by Atlantic Records SD 7307, 1974."]}, {"page": "2003 in British music", "response": ["*13 March – Ian Samwell, musician and singer-songwriter, 66"]}, {"page": "List of bass guitarists", "response": ["* Ian Samwell (The Drifters)"]}, {"page": "The Shadows", "response": ["The Shadows formed as a backing band for Cliff Richard under the name The Drifters, the original members were founder Ken Pavey (born 1932), Terry Smart on drums (1942), Norman Mitham on guitar (1941), Ian Samwell on guitar and Harry Webb (before he became Cliff Richard) on guitar and vocals. They had no bass player. ", "* Ian Samwell – lead guitar, rhythm guitar, bass (1958; died 2003)", "  bar:Ian    text:Ian Samwell"]}, {"page": "America (America album)", "response": ["*Ian Samwell – producer", "Category:Albums produced by Ian Samwell"]}, {"page": "Repeat When Necessary", "response": ["# \"Dynamite\" (Ian Samwell) – 2:33"]}, {"page": "Cliff Richard discography", "response": ["Richard's debut single \"Move It\" written by his original guitarist Ian Samwell and released in August 1958, was the first truly home-grown British rock and roll hit. It reached number 2 on the UK Singles Chart and spent 17 weeks on the chart. His fifth single, \"Living Doll\" reached number 1 in August 1959, spent 6 weeks at the summit while becoming the UK's highest selling single of 1959. From then, through to December 1963, Richard achieved 19 consecutive top 4 singles, including 7 number ones and a further 6 peaking at number 2. Richard accumulated a total of 28 weeks at number 1 on the UK Singles Chart in this period. His biggest hit of this period was \"The Young Ones\", which debuted at number one on the UK charts, spent a total of 6 weeks at number one and went on to achieve the rare feat in the UK alone, of sales of over a million – it was only the sixth million seller in the UK and remains his highest selling single in the UK. From 1964, despite the emerging dominance of the Beatles and beat music, Richard continued achieving top 10 hits throughout the 1960s although the frequency of top 5 hits dropped off. In 1968, the track \"Congratulations\" was chosen to be his first Eurovision Song Contest entry – although it came second in the contest, it became his biggest hit of the last half of the sixties, reaching number one in the UK and a number of European countries."]}, {"page": "A Horse with No Name", "response": ["\"A Horse with No Name\" was recorded in E minor with acoustic guitars, bass guitar, drum kit, and bongo drums. The only other chord is a D, fretted on the low E and G strings, second fret. A 12-string guitar plays an added F♯ (second fret, high E string) on the back beat of the Em. A noted feature of the song is the driving bass line with a hammer-hook in each chorus. A \"waterfall\"-type solo completes the arrangement. Produced by Ian Samwell on the day of final recording at Morgan Studios, when at first the group thought it was too corny and took some convincing to actually play it. Gerry Beckley has explained in Acoustic Guitar magazine (March 2007) that the correct tuning for the guitar is D E D G B D, low to high. The chord pattern that repeats throughout the entire song is: 202002 (Em), then 020202 and 000202. The tuning is unique to this song; they did not use it on any other America song.", "Category:Song recordings produced by Ian Samwell"]}, {"page": "2003 in the United Kingdom", "response": ["* 13 March – Ian Samwell, musician and singer-songwriter (born 1937)"]}, {"page": "Linda Lewis", "response": ["In 1964, she sang \"Dancing in the Streets\" with John Lee Hooker at a club in Southend-on-Sea. Hooker introduced her to Ian Samwell, who arranged for Don Arden to manage her. She signed with Polydor and recorded the single \"You Turned My Bitter into Sweet\", which is now a collectable Northern Soul record. Polydor worried that her name, Linda Fredericks, would be confused with Linda Kendrick, who was also signed to Polydor. Fredericks used the name Linda Lewis in honour of singer Barbara Lewis. The surname would also be used professionally by her sisters, Dee Lewis and Shirley Lewis, and her mother."]}, {"page": "Ian \"Sammy\" Samwell", "response": ["#REDIRECTIan Samwell"]}, {"page": "1937 in the United Kingdom", "response": ["* 19 January – Ian Samwell, rock guitarist, singer-songwriter and record producer (died 2003)"]}, {"page": "Move It", "response": ["\"Move It\" is a song written by Ian Samwell and recorded by Cliff Richard and the Drifters (the UK band that would later become \"The Shadows\"). Originally intended as the B-side to \"Schoolboy Crush\", it was released as Richard's debut single on 29 August 1958 and became his first hit record, reaching number 2 on the UK Singles Chart.  It is credited with being one of the first authentic rock and roll songs produced outside the United States.Sold on Song Top 100 at bbc.co.uk. Retrieved on 18 November 2007.\"The Ian \"Sammy\" Samwell Story\"  at iansamwell.com. Retrieved on 18 November 2007.", "*Ian Samwell – rhythm guitar", "Category:Songs written by Ian Samwell"]}, {"page": "Small Faces (1966 album)", "response": ["Category:Albums produced by Ian Samwell"]}, {"page": "Separated Vegetables", "response": ["#\"What Ya Gonna Do About It\" (Ian Samwell, Brian Potter)"]}, {"page": "Samwell", "response": ["* Ian Samwell (1937–2003), English musician, songwriter and producer"]}, {"page": "Whatcha Gonna Do About It", "response": ["The songwriting duo of the group Steve Marriott and Ronnie Lane already had the melody for the song, the inspiration coming from Solomon Burke's hit record \"Everybody Needs Somebody to Love.\" However they had no lyrics, so their manager, Don Arden, brought in Ian Samwell and Brian Potter to provide the words for the song. The song entered the UK Singles Chart at number 27 and rose to number 14, just missing the all important Top Ten. Kenney Jones recalled to Uncut magazine: \"We hadn't fully established our own songwriting abilities – our stage show was mainly covers of things like Otis Redding's 'Shake' – and this really suited the power of Steve's voice. The style was very indicative of the time and we loved it.\"", "Category:Songs written by Ian Samwell"]}, {"page": "I've Got Mine", "response": ["Category:Song recordings produced by Ian Samwell"]}, {"page": "From the Beginning (Small Faces album)", "response": ["Category:Albums produced by Ian Samwell"]}]}}