{"wiki_id": "http://www.wikidata.org/entity/Q5981175", "itemLabel": "Ian Cheshire", "itemDescription": "businessperson", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Cheshire_(businessman)", "wikipedia_page": {"main": "Sir Ian Michael Cheshire (born 6 August 1959) is a British businessman, and chairman of Barclays UK, the ring-fenced UK subsidiary of Barclays. He is stepping down on January 1, 2021 and will be succeed by Crawford Gillies. He is lead non-executive director for the Cabinet Office board, campaign chairman of Heads Together, chair of the Prince of Wales's Charitable Fund, chair of the independent charity, the Food, Farming and Countryside Commission, and a trustee of The Institute for Government. He was previously chief executive (CEO) of Kingfisher plc, a British multinational retailing company, and was chairman of the British department store chain Debenhams from 2016 to 2019", "link_mentions": [{"page": "Kingfisher plc", "response": ["The company was led by Gerry Murphy from December 2002 to November 2007. In January 2008, Kingfisher appointed Ian Cheshire as group chief executive. Cheshire was formerly B&Q's chief executive; his B&Q role was taken over in April 2009, by Euan Sutherland, who also headed up the United Kingdom division of Kingfisher.", "In September 2014, it was announced that the head of Castorama Véronique Laury would replace Ian Cheshire as Kingfisher group CEO in February 2015. Laury had worked at Kingfisher for eleven years, including roles at B&Q. In June 2017, Andy Cosslett succeeded Daniel Bernard as chairman."]}, {"page": "Michael Gove", "response": ["Gove faced criticism over the appointment of Ben Goldsmith to the role of non-executive director at the Department for Environment, Food and Rural Affairs as Goldsmith had previously donated cash to Gove's Surrey Heath constituency. Concerns were also raised about the selection process for the job, which was overseen by Sir Ian Cheshire, the chairman of Goldsmith's investment firm, Menhaden Capital Management."]}, {"page": "Euan Sutherland", "response": ["Touted as a replacement for Kingfisher CEO Ian Cheshire, he joined the Co-operative Group in April 2013, taking over from Peter Marks as chief executive."]}, {"page": "Ben Goldsmith", "response": ["In 2018, Goldsmith was appointed non-executive director at the Department for Environment, Food and Rural Affairs. This proved controversial as he had previously donated cash to Michael Gove's Surrey Heath constituency and the selection process for the job was overseen by Sir Ian Cheshire, who is chairman of Goldsmith's investment firm, Menhaden Capital Management."]}, {"page": "List of Old King's Scholars", "response": ["*Ian Cheshire (born 1959), chairman of Barclays UK and former CEO of Kingfisher plc"]}, {"page": "Ian Cheshire", "response": ["Ian Cheshire may refer to:", "* Ian Cheshire (engineer) (born 1936), Scottish petroleum engineer", "* Ian Cheshire (businessman) (born 1959), British businessman"]}, {"page": "Véronique Laury", "response": ["In September 2014, it was announced that Laury would replace Ian Cheshire as CEO of Kingfisher plc, a FTSE 100 British multinational retail company from February 2015. Laury has worked at Castorama, a subsidiary of Kingfisher, for eleven years, including roles at B&Q."]}, {"page": "Honours Committee", "response": ["*Chair of the Economy Committee: Sir Ian Cheshire", "*Sir Ian Cheshire - chairman, Barclay's UK (Independent chair)"]}, {"page": "Nigel Northridge", "response": ["Northridge was the chairman of the British multinational department store chain, Debenhams from April 2010 to April 2016, when he was succeeded by Sir Ian Cheshire."]}, {"page": "Cheshire (surname)", "response": ["* Ian Cheshire (engineer) (born 1936), Scottish petroleum engineer", "* Ian Cheshire (businessman) (born 1959), British businessman"]}]}}