{"wiki_id": "http://www.wikidata.org/entity/Q5980940", "itemLabel": "Ian Boddy", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Boddy", "wikipedia_page": {"main": "Ian Boddy is a British electronic musician and composer. In the early 1980s Boddy began experimenting at an Arts Council funded studio in Newcastle. This period resulted in 3 cassette releases on the Mirage label, which showcased Boddy's work with analogue synthesis and tape manipulation. \"Images\" (1980), \"Elements of Chance\" (1981) and \"Jade\". In 1983 Boddy's first LP, The Climb, was released, followed by two more LPs, Spirits (1984) and Phoenix (1986). In 1989 Boddy released his first CD, Odyssey, on the Surreal To Real label, followed by Drive (1991). Following these releases, Boddy founded the Something Else Records label, releasing another 4 albums, \"The Uncertainty Principle\" (1993), \"The Deep\" (1994), \"Continuum\" (1996), \"Rare Elements\" (1997) and reissuing his first 3 LPs and one of his early cassettes, \"Jade\"(1992). On Something Else Records he also released 3 collaborations, \"Symbiont\" (1995) with Andy Pickford, \"Phase 3\" (1997) with Ron Boots and \"Octane\" (1998) with Mark Shreeve under the name of ARC. A cassette-only release of live recordings between 1980 and 1989 was also available for a short period. In 1999 he founded the DiN Records label.More recent recordings have included:\n\n\"Box of Secrets\" DiN1 (1999)\n\"Distant Rituals\" DiN2 (1999) with Markus Reuter\n\"Autonomic\" DiN4 (1999) with Nigel Mullaney as Dub Atomica\n\"Caged\" DiN5 (2000) with Chris Carter\n\"Radio Sputnik\" DiN7 (2000) with Mark Shreeve as ARC\n\"Shrouded\" Space For Music Records (2000) Live recording for Philadelphia\n\"Triptych\" DiN9 (2001) with Markus Reuter and Nigel Mullaney\n\"Outpost\" DiN11 (2002) with Robert Rich\n\"Aurora\" DiN12 (2002)\n\"Blaze\" DiN15 (2003) with Mark Shreeve as ARC\n\"Chiasmata\" DiN16 (2004)\n\"Pure\" DiN17 (2004) with Markus Reuter\n\"Moire\" DiN18 (2005) with Bernhard Wostheinrich\n\"Arcturus\" DiN19 (2005) with Mark Shreeve as ARC\n\"Jodrell Bank Concert\" Space For Music Records (2002) with Markus Reuter. Live recording from 1999.\n\"Lithosphere\" DiN21 (2005) with Robert Rich\n\"Elemental\" DiN25 (2006)\n\"Fracture\" Din26 (2007) with Mark Shreeve as ARC\n\"React\" DiN29 (2008) with Robert Rich\n\"Slide\" DiN31 (2008)\n\"Dervish\" DiN33 (2009) with Markus Reuter\n\"Shifting Sands\" AD072 (2009) with David Wright\nFrontiers DIN39 (2012) with Erik Wøllo", "link_mentions": [{"page": "Robert Rich (musician)", "response": ["His collaborators over the years have included Steve Roach, Brian “Lustmord” Williams, Lisa Moskow, Alio Die, and Ian Boddy.", "*2002: Outpost (with Ian Boddy)", "*2005: Lithosphere (with Ian Boddy)", "*2008: React (with Ian Boddy)"]}, {"page": "Chris Carter (British musician)", "response": ["In 1994 Carter also moved into journalism, and regularly has technical articles and reviews published in the magazine Sound on Sound. He is additionally a keen photographer and graphic designer, and in collaboration with Cosey Fanni Tutti has designed and produced numerous album covers, posters and art works. Carter returned to solo performance work in 1995 after a gap of 15 years. His performances included subtle references to his earlier works, but with obvious influences from his more recent collaborations. In 1998 Carter released a compilation CD entitled Disobedient, consisting of tracks from his 1995 Disobey tour (produced by Paul Smith). In 2000 he released a solo studio album, Small Moon. In 1998 the album Caged, a collaboration with electronic musician Ian Boddy, was released on the DiN label.", "* Caged (2000, DiN) with Ian Boddy"]}, {"page": "Outpost (Robert Rich and Ian Boddy album)", "response": ["Outpost (2002) is a collaborative album by electronic musicians Robert Rich and Ian Boddy. Recording of this album began during a week in October, 2001 while Boddy was visiting Rich’s studio in California. It was completed in November when Rich visited Boddy’s studio in Northern England. It was mixed, assembled and mastered by Robert Rich in January, 2002. The track titles follow a science fiction theme of space exploration. This album was released as a limited edition of 2000 copies.", "*Ian Boddy – analog and digital synthesizers, prepared piano, Metasynth, Pluggo"]}, {"page": "Lithosphere (album)", "response": ["Lithosphere (2005) is a collaborative album by electronic musicians Robert Rich and Ian Boddy. Like their previous collaboration Outpost, this album was released as a limited edition of 2000 copies.", "*Ian Boddy – NI Reaktor, Logic Pro Ultrabeat, EXS24, EVB3, VSL Glass, Stones, strings and woodwind samples, rocks"]}, {"page": "Akai S900", "response": ["Notable users include The 45 King (who named his hit \"The 900 Number\" after the sampler), Juan Atkins, Beatmasters, Black Box, Ian Boddy, Enya, Fatboy Slim (who nearly exclusively uses a pair of S950s), Front 242, KLF, Public Enemy, Renegade Soundwave, and Tangerine Dream."]}, {"page": "Redshift (group)", "response": ["The band consists of Mark Shreeve, Julian Shreeve and James Goddard. Rob Jenkins was a band member from its inception in 1996 but left the band in 2002 after the Hampshire Jam 2 concert. James Goddard has been unable to perform as part of Redshift due to other commitments overseas since 2006, and Ian Boddy, long time peer of Mark Shreeve, has temporarily supported Mark and Julian Shreeve in performing 2006, 2008 and 2010 Redshift concerts in James’s absence., Interview with Mark Shreeve, 2010.", "Mark Shreeve and Ian Boddy are also known for their joint project ARC."]}, {"page": "Roland System-100M", "response": ["In the 1980s, shortly after its introduction, Richard Burgess of Landscape called the 100M \"one of the best synthesisers on the market, with so many control functions available independently, whereas most synths only have one or two LFOs to do all the modulating.\"  Ian Boddy considered the System 100M \"an almost ideal introduction to the world of modular synthesis,\" and praised its oscillator sync sound, especially when sampled to fake analog modular polyphony.", "* Ian Boddy"]}, {"page": "DiN Records", "response": ["#REDIRECT Ian Boddy"]}, {"page": "De Wolfe Music", "response": ["De Wolfe composers past and present include: Jack Trombey, Simon Park, Tim Souster, Barbara Moore, Andy Quin, Alex Heffes, Stanley Myers, Stephane Grappelli, John Altman, Stanley Black, David Bradnum, Frank Mcdonald and Chris Rae, Paul Lawler, Frederic Talgorn, York Bowen, Johnny Hawksworth, Steve Sidwell, Ivor Slaney, Reg Tilsley, Ronald Binge, David Kelly, Hampton Hawes, Basil Kirchin, Alan Parker, Ena Baga, Roger Webb, Ivor Novello, Colin Kiddy, Howie, David Hubbard, Nigel Mullaney, Danny Davies, Jonathan Jowett, Simon Stewart, Troy Banarzi, Ross Hardy, John Leach, Paul Leonard-Morgan, Terry Keating, Ian Boddy, Paul Lewis, Karl Jenkins, Terry Gadsden, Edmund Jolliffe, Hermann Langschwert and Nick Ingman."]}, {"page": "Centrozoon", "response": ["Reuter and/or Wöstheinrich have also collaborated (together and separately) with Ian Boddy, Robert Rich, and Nigel Mullaney, and both contributed to Tim Bowness’ 2004 solo album My Hotel Year."]}, {"page": "Markus Reuter", "response": ["As well as further collaborations with artists including Tim Bowness, Lee Fletcher, Ian Boddy and Robert Rich, Reuter has produced records by numerous musicians and released several solo recordings as both performer and composer. He is also part of an artist-owned production consortium which encompasses Iapetus Media, Unsung Productions and Unsung Records.", "Reuter has recorded seven albums as an electrophonic duo with British synthesizer player/soundscaper Ian Boddy (plus one with both Boddy and turntablist Nigel Mullaney), three with American experimental guitarist Tim Motzer, two with American ambient electronic composer Robert Rich and two with Zero Ohms (wind/wind-synth instrumentalist Richard Roberts). He has also worked and recorded with German “doombient” musician Stephen Parsick (of ['ramp]).", "====Markus Reuter & Ian Boddy====", "*Distant Rituals (1999 - credited to \"Ian Boddy & Markus Reuter\")", "*Pure (2003 - credited to \"Markus Reuter & Ian Boddy\")", "*Dervish (2009 - credited to \"Markus Reuter & Ian Boddy\")", "*Unwound (2010 - credited to \"Ian Boddy & Markus Reuter\")", "*Colour Division (2013 - credited to \"Ian Boddy & Markus Reuter\")", "*Memento (2017 - credited to \"Markus Reuter & Ian Boddy\")", "*Stay (2017 - credited to \"Ian Boddy & Markus Reuter\")", "====Ian Boddy, Markus Reuter, Nigel Mullaney===="]}, {"page": "Erik Wøllo", "response": ["Erik says in a private interview: “I quit all the bands I played in, I wanted to work on my own using the modern electronic studio as an instrument. Like a painter with his oil canvasses. I wanted to make a music that had expansive synthesizer textures and sequencer patterns, layered together with expressive melodic electric guitars. Working with depth, time and space. In those years in the early eighties the studio technology was new and revolutionary, and I wanted to explore all the new possibilities. To be able to control the infinite variations of electronic sound, using an endless palette for creative expression. Musically this technology opened up a new possible world for me, and I have continued to further develop and refine these musical ideas on later recordings. Also for the last decades, I have been able to bring this my musical concept to the stage, performing live. I have been doing several tours, as well as releasing a double CD set live album \"Silent Currents\" (Projekt, CD-2011). As well as two download live albums \"Silent Currents 3\" (2013), and \"Star’s End 2015\" (Silent Currents 4). I have also done several live concerts with Ian Boddy and Steve Roach. In August 2019, I performed a main act concert with special written music for an outdoor festival in Norway, featuring Trey Gunn, Kouame Sereba and Jerry Marotta.\"", "Erik Wøllo has also collaborated and released album works together with some of the most respected artists in the ambient music world: with Steve Roach (\"Stream of Thought\", CD-2009 & \"The Road Eternal\", CD-2011), Michael Stearns (\"Convergence\", CD-2020), Ian Boddy (\"Frontiers\", CD-2012, \"EC12\", Digital-2014, and \"Meridian, CD-2018), Byron Metcalf (\"Earth Luminous\", CD-2016), Bernhard Wöstheinrich (\"Arcadia Borealis\", CD-2009 and \"Weltenuhr, CD-2014), and several others.", "* 2018 - Ian Boddy/Erik Wøllo - \"Meridian\" (DiN54, CD)", "* 2014 - Ian Boddy/Erik Wøllo - \"EC-12\" (Live in Germany 2012, DiN, Digital)", "* 2012 - Ian Boddy/Erik Wøllo - \"Frontiers\" (DiN, CD)", "* Ian Boddy"]}, {"page": "React (Robert Rich and Ian Boddy album)", "response": ["React (2008) is the third collaborative album by electronic musicians Robert Rich and Ian Boddy. Like their previous collaborations Outpost and Lithosphere, this album was released as a limited edition of 2000 copies.", "*Ian Boddy – Apple MacBook Pro/Ableton Live? sampler & synthesisers"]}, {"page": "Boddy", "response": ["*Ian Boddy (contemporary), British electronic musician and composer"]}, {"page": "A Time of Changes (album)", "response": ["#\"Ragnarok\" (Ross, Sirotto, Ian Boddy) - 1:45 (instrumental)", "*Ian Boddy – keyboards on track 1"]}]}}