{"wiki_id": "http://www.wikidata.org/entity/Q5982369", "itemLabel": "Ian McParland", "itemDescription": "Scottish footballer and manager (born 1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_McParland", "wikipedia_page": {"main": "Ian John McParland (born 4 October 1961) is a Scottish former professional football player and manager.  He played professionally as a striker with a number of teams and he is most known for his eight-year spell with Notts County, a club he later managed. He now features as a pundit on weekly football talk show 'Team Talk' on Notts TV.", "link_mentions": [{"page": "Nottingham Forest F.C.", "response": ["In Forest's first season in the English third tier in 54 years, a 3–0 defeat at Oldham Athletic in February 2006 led to the departure of Megson by \"mutual consent\" leaving the club mid-table only four points above the relegation zone. Frank Barlow and Ian McParland took temporary charge for the remainder of the 2005–06 season, engineering a six-match winning run and remaining unbeaten in ten games, the most notable result a 7–1 win over Swindon Town. Forest took 28 points from a possible 39 under the two, narrowly missing out on a play-off place, as they finished in 7th place.", "|align=left| Frank Barlow Ian McParland"]}, {"page": "Ipswich Town F.C.", "response": ["After failing to reach the playoffs despite substantial investment, Magilton was sacked in April 2009, and new Chief Executive Simon Clegg replaced him with former Manchester United player, Roy Keane. Keane's spell as manager came to an end after an unsuccessful 18 months, when he was sacked in January 2011, to be replaced briefly by Ian McParland in a caretaker role before Paul Jewell took the reins on a permanent basis. A poor start to the 2012/13 season with Ipswich bottom of the Championship after winning only one of their first twelve games, led to Jewell leaving his position on 24 October 2012 by mutual consent."]}, {"page": "Notts County F.C.", "response": ["|align=\"left\"| Ian McParland", "|align=left|Ian McParland"]}, {"page": "Tamworth F.C.", "response": ["On 13 October 2010, manager Gary Mills quit Tamworth to join fellow Conference Premier side York City, names of possible replacements started to circulate and many believed that Ian McParland had expressed interest in the job.  However first team coach Des Lyttle became caretaker manager and was later hired as player-manager. He resigned as manager on 13 April 2011, and was replaced by Tamworth legend Dale Belford, who was to manage the club for the remaining four games of the season. Belford led Tamworth to last day safety with a 2–1 home win over Forest Green Rovers, with Jake Sheridan scoring the all important winning goal.  Belford stepped aside at the end of the season, and the search for a new manager to lead the club for the 2011–12 Conference Premier season began, speculation was rife, and the names of former York City manager Martin Foyle, Eastwood Town manager Paul Cox and former Walsall assistant manager Martin O'Connor were all linked to the club, but on 25 May 2011, Tamworth announced Kettering Town manager Marcus Law as the club's new manager."]}, {"page": "Paul Hart", "response": ["Hart was appointed manager of Swindon Town on 3 March 2011, with his new club in the League One relegation zone. He appointed former Notts County manager Ian McParland as his assistant. On 28 April 2011, Hart was sacked after failing to lead Swindon out of the relegation zone, with the club managing only one win in 11 games under his tenure, a 1–0 away win over Brentford on 9 April 2011."]}, {"page": "Lee Hughes", "response": ["Hughes signed for League Two team Notts County on a two-year contract on 22 July 2009, on the same day that Sven-Göran Eriksson arrived at the club as director of football. He scored a hat-trick on his debut in a 5–0 victory over Bradford City on the opening day of the season. He then got his second hat-trick against Northampton Town in a 5–2 home win on 12 September. He claimed his third hat-trick of the campaign on 28 December during a 4–1 win over Burton Albion at the Pirelli Stadium. However the club endured a turbulent time, with manager Ian McParland sacked and replaced by Hans Backe, who himself resigned after Qadbak Investments proved unable to fund Backe's wages. New owner Ray Trew appointed Steve Cotterill as manager, and County entered April ten points behind league leaders Rochdale, though Hughes remained confident that they could reduce the deficit and win the league. On 17 April, Hughes scored two goals in a 4–1 victory over Morecambe as County won promotion to League One. He was named as League Two's Player of the Month in April. On 1 May, Hughes added another two goals in County's final home game of the season, making him the first Notts player to score 30 league goals since Tommy Lawton in the 1949–50 season. He finished as the division's top-scorer in 2009–10 with 30 league goals in 39 games, and was named on the PFA Team of the Year alongside teammates Kasper Schmeichel and Ben Davies. County won the league by a ten-point margin. In July 2010, Hughes signed a one-year extension to his contract that would see him at Meadow Lane until the summer of 2012."]}, {"page": "Paul Jewell", "response": ["Jewell was announced as Ipswich Town manager on 10 January 2011, and took up the post on a permanent basis three days later, replacing caretaker Ian McParland, after the 1–0 League Cup semi final win. His first match was a 2–1 defeat away to Millwall. Seven losses in a row dropped Ipswich from 6th to 21st place. Ipswich next travelled to Barnsley where, in front of the Sky cameras, they won 5–3, coming from 2–0 down at half time."]}]}}