{"wiki_id": "http://www.wikidata.org/entity/Q5980611", "itemLabel": "Iain Russell", "itemDescription": "Scottish footballer (born 1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Iain_Russell", "wikipedia_page": {"main": "Iain Thomas Russell (born 14 November 1982) is a Scottish professional footballer who plays as a forward for Cowdenbeath, on loan from Pollok.\nRussell came through the youth teams at Annan Athletic and Rangers before making a few appearances for Motherwell. Since leaving the Well, Russell has also played for Brechin City, Greenock Morton, Alloa Athletic and Stirling Albion (both loan spells), Livingston, Queen of the South and Airdrieonians.", "link_mentions": [{"page": "Brechin City F.C.", "response": ["The club, led by the management of Michael O'Neill and with the goal threat of Iain Russell, finished fourth in the following season's Second Division and under new arrangements this entitled it to a place in promotion play-offs, although a 6–1 aggregate mauling at the hands of Airdrie United put paid to any hopes of another immediate return to the second tier. 2007–08 proved somewhat disappointing as City missed out on the play-offs by finishing sixth, and on 31 January 2008, was thrown out of the Scottish Cup after fielding two ineligible players in its 2–1 fourth round replay win over Hamilton Academical. Hamilton Academical took their place in the fifth round. 2008–09 proved a season of upheaval as O'Neill left on 15 December 2008 to take charge of Republic of Ireland side Shamrock Rovers, although the experienced Jim Duffy followed him into the hotseat on 9 January 2009 and led the club to third place and a play-off place. Once again however the play-offs did not prove rewarding as Ayr United recorded a 5–2 aggregate win over the club to leave Brechin City in the Second Division for 2009–10. Under Duffy Brechin made the play-offs again the following season but Duffy resigned after Brechin were beaten 3–0 on aggregate by Cowdenbeath."]}, {"page": "Ian Russell", "response": ["*Iain Russell (born 1982), Scottish footballer"]}, {"page": "2006–07 Scottish Second Division", "response": ["| Iain Russell || style=\"text-align:center;\"|21 ||Brechin City"]}, {"page": "Kevin McCann (footballer, born 1987)", "response": ["On 10 March 2012, he played in a trial match for Livingston against his former club Greenock Morton. Also setting up a goal for Iain Russell with a cross. After a further two games as a trialist, he signed for them on a short-term contract until the end of the season. McCann extended his stay with the West Lothian club by signing a new one-year contract in May 2012. McCann scored in a record victory, 8–0 against Stranraer in Scottish League Cup First round on 4 August 2012."]}, {"page": "2007–08 Scottish First Division", "response": ["| Iain Russell"]}, {"page": "2004–05 Scottish Second Division", "response": ["| Iain Russell || Dumbarton || style=\"text-align:center;\"|11"]}, {"page": "Chris Templeman", "response": ["After a poor start at Cappielow, punctuated by a return to Brechin City on loan, Templeman became a regular starter and important player at Cappielow, his most famous goals probably being his double against SPL side Kilmarnock in the Scottish Cup Third Round, where Morton won 3–1. However, by the start of the 2007–08 season, with Morton having won promotion to the First Division, Templeman's playing time began to decrease, largely in favour of Peter Weatherson and Iain Russell. He came on frequently as a substitute in the second half, notching up three goals in cup competitions."]}, {"page": "Ian McMillan (footballer)", "response": ["He is the grandfather of modern-day player, Iain Russell."]}, {"page": "Scottish Football League monthly awards", "response": ["|  Iain Russell", "|  Iain Russell", "|  Iain Russell"]}, {"page": "Michael Paton", "response": ["In his second season with the Dumfries club, Paton scored in the first round of the Scottish Challenge Cup, in a 4–3 defeat versus Livingston. However, he then suffered a hamstring injury that kept him sidelined for four months. Paton's return to the first-team was on 12 December 2014, appearing as a substitute for Iain Russell in the last few minutes of the 2–0 home win versus Rangers. Having returned to the first-team squad, mostly appearing as a substitute, he then had a goal assist for Aidan Smith in a 1–1 draw at Ibrox versus the Govan club  and then on 21 March 2015 scored his first goal of that season in a 4–1 win versus Cowdenbeath. Paton's second season saw him playing on 23 occasions and scoring one goal in all competitions. With his contract expiring at the end of that season, his future with the Dumfries club looked uncertain and he decided to move on to another club."]}, {"page": "List of winners of the Scottish League One and predecessors", "response": ["| align=left|Iain Russell (Brechin City)", "| align=left|Mark Roberts (Ayr United)Iain Russell (Livingston)"]}, {"page": "2010–11 Scottish Second Division", "response": ["*  Iain Russell (Livingston)"]}, {"page": "2008–09 Greenock Morton F.C. season", "response": ["|Brian Wake   Iain Russell Jim McAlister Jon Newby  Steven Masterton Erik Paartalu ", "|Iain Russell ", "|Iain Russell    Brian Wake Erik Paartalu Jon Newby Kevin Finlayson Ryan McGuffie ", "|Iain Russell ", "|Iain Russell    Brian Wake   Kevin Finlayson ", "|Peter Weatherson   Iain Russell ", "|Ryan McGuffie  Kevin Finlayson Iain Russell Peter Weatherson Brian Wake  James Grady    ", "|Iain Russell ", "|Erik Paartalu Iain Russell Brian Wake  ", "|Iain Russell ", "|Ryan McGuffie   Brian Wake    Iain Russell    Erik Paartalu ", "|Iain Russell    Steven Masterton   Ryan Harding ", "|FW ||style=\"text-align:left\"|  Iain Russell || 17 || 15 || 7"]}, {"page": "2009–10 Greenock Morton F.C. season", "response": ["Iain Russell was loaned out to Alloa Athletic.", "Iain Russell and Ryan McWilliams were sent out on loan to Stirling Albion and Largs Thistle respectively.", "| Iain Russell || Alloa Athletic || Loan (September 2009)", "| Iain Russell || Stirling Albion || Loan (March 2010)", "|Iain Russell ", "|FW ||style=\"text-align:left\"|  Iain Russell || 5 || 1 || 0 || 0 || 0 "]}, {"page": "2010–11 Greenock Morton F.C. season", "response": ["Iain Russell rejected the contract extension in order to sign a two-year contract with Livingston.", "| Iain Russell"]}]}}