{"wiki_id": "http://www.wikidata.org/entity/Q5983204", "itemLabel": "Ian Walters", "itemDescription": "British sculptor", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Walters", "wikipedia_page": {"main": "Ian Homer Walters (9 April 1930 – 6 August 2006) was an English sculptor.", "link_mentions": [{"page": "Harold Wilson", "response": ["A portrait of Harold Wilson, painted by the Scottish portrait artist Cowan Dobson, hangs today at University College, Oxford. Two statues of Harold Wilson stand in prominent places. The first, unveiled by the then Prime Minister Tony Blair in July 1999, stands outside Huddersfield railway station in St George's Square, Huddersfield. Costing £70,000, the statue, designed by sculptor Ian Walters, is based on photographs taken in 1964 and depicts Wilson in walking pose at the start of his first term as prime minister. His widow, Mary requested that the eight-foot-tall monument not show Wilson holding his famous pipe as she feared it would make the representation a caricature."]}, {"page": "William Bloye", "response": ["Bloye studied, and later, taught at the Birmingham School of Art (his training was interrupted by World War I, when he served in the Royal Army Medical Corps from 1915 to 1917; he was eventually succeeded at Birmingham by John Bridgeman), where his pupils included Gordon Herickx, Roy Kitchin, Raymond Mason, John Poole and Ian Walters. He also studied stone-carving and letter cutting under Eric Gill around 1921."]}, {"page": "Royal Festival Hall", "response": ["The complex includes several reception rooms, bars and restaurants, and the Clore Ballroom, accommodating up to 440 for a seated dinner.Southbank Centre's factsheet on the Clore Ballroom  A large head and shoulders bust of Nelson Mandela (by Ian Walters, created in 1985) stands on the walkway between the hall and Hungerford Bridge approach viaduct. Originally made in glass-fibre it was repeatedly vandalised until re-cast in bronze."]}, {"page": "Deaths in August 2006", "response": ["*Ian Walters, 76, British sculptor."]}, {"page": "2006 in the United Kingdom", "response": ["** Ian Walters, sculptor (born 1930)"]}, {"page": "Red Lion Square", "response": ["The centre-piece of the garden today is a statue by Ian Walters of Fenner Brockway, which was installed in 1986. There is also a memorial bust of Bertrand Russell. Conway Hall—which is the home of the South Place Ethical Society and the National Secular Society—opens on to the Square. On 15 June 1974 a meeting by the National Front in Conway Hall resulted in a protest by anti-fascist groups. The following disorder and police action left one student—Kevin Gately from the University of Warwick—dead."]}, {"page": "1930 in the United Kingdom", "response": ["* 9 April – Ian Walters, sculptor (died 2006)"]}, {"page": "Walters (surname)", "response": ["* Ian Walters (1930–2006), English sculptor"]}, {"page": "Christ Church, Southwark", "response": ["The church also features sculpture by Ian Walters: New Regime (1989)."]}, {"page": "Birmingham Metropolitan College", "response": ["* Ian Walters ‡"]}, {"page": "List of Birmingham City University people", "response": ["*Ian Walters"]}, {"page": "Art of Birmingham", "response": ["20th century Birmingham sculpture was dominated by the figure of William Bloye, who combined the arts and crafts tradition of Benjamin Creswick with the avant-garde edge of Eric Gill, with whom he worked at Ditchling in Sussex. Bloye was the Head of Sculpture at Birmingham School of Art from 1919 to 1956 and became the city's unofficial civic sculptor – producing everything from pub signs to the bas-reliefs on the city's Hall of Memory war memorial. Several generations of sculptors who trained under Bloye at the School of Art later worked as assistants at his studio in Small Heath before establishing themselves independently, including notable figures such as John Poole, Gordon Herickx, Ian Walters and Raymond Mason."]}, {"page": "Fourth plinth, Trafalgar Square", "response": ["* Nelson Mandela Statue: On 24 March 2003, an appeal was launched by Wendy Woods, the widow of the anti-apartheid journalist Donald Woods, hoping to raise £400,000 to pay for a  statue of Nelson Mandela by Ian Walters. The relevance of the location was that South Africa House, the South African high commission, scene of many anti-apartheid demonstrations, is on the east side of Trafalgar Square. The statue was later placed in Parliament Square instead."]}, {"page": "Statue of Nelson Mandela, Parliament Square", "response": ["The statue is  high, and made in bronze. The plinth the statue stands on is shorter than the other statues located in Parliament Square. It was created by English sculptor Ian Walters, at a cost of £400,000. Walters had previously created the bust of Mandela located on the South Bank in London. Fellow sculptor Glyn Williams criticised the statue at a public inquiry during the planning process, saying that it is \"an adequate portrait but nothing more\"."]}, {"page": "East Sheen Cemetery", "response": ["*Ian Walters (1930–2006), sculptor, whose work included the statue in Huddersfield, West Yorkshire of Prime Minister Harold Wilson and a large head of Nelson Mandela, now outside the Royal Festival Hall, London "]}, {"page": "Yardleys School", "response": ["* Ian Walters, sculptor"]}, {"page": "Cécile Nobrega", "response": ["The Bronze Woman Project was a charitable organization that successfully raised funds for a public monument to womanhood in Britain. Bronze Woman is a ten-foot statue of a mother and child, designed by sculptor Ian Walters, and after his death completed by Aleix Barbat. It was unveiled on a busy traffic junction in Stockwell, south London on 8 October 2008. The Baroness Scotland of Asthal delivered a keynote speech; alongside Nobrega around the statue were artist Anissa Jane, entrepreneur Sonita Alleyne, Rosalind Howells, Baroness Howells of St Davids, community activist Jessica Huntley, MOBO Awards founder Kanya King, diversity expert Brenda King, equal rights campaigner Doreen Lawrence and community campaigner Sybil Phoenix. It is the first public statue of a black woman to be on permanent display in England."]}]}}