{"wiki_id": "http://www.wikidata.org/entity/Q5991237", "itemLabel": "Ifor Davies", "itemDescription": "Welsh politician (1910-1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ifor_Davies", "wikipedia_page": {"main": "Ifor Davies (9 June 1910 – 6 June 1982), born Ivor Davies, was a Welsh Labour politician.\nDavies was born in Gowerton, Swansea, the youngest of the six children of Jeffrey and Elizabeth Jane Thomas. His father was employed in the local tinplate mill. He was educated at Gowerton School, Swansea Technical College and Ruskin College, Oxford, worked as an industrial personnel officer.", "link_mentions": [{"page": "Michael Heseltine", "response": ["Heseltine contested the safe Labour seat of Gower at the October 1959 general election.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 47–58. He had been the only applicant for the Conservative (technically, Conservative and National Liberal)The National Liberals had been a breakaway group under Sir John Simon, who sat in coalition with the Conservatives between 1931 and 1945. By the 1950s they had merged with the Conservatives for practical purposes, but the name was still used locally in some seats. candidacy. He would at times attend Labour meetings and attempt to heckle the speakers, including Aneurin Bevan and the Labour candidate Ifor Davies, whom he kept trying to challenge to a debate. He obtained plenty of publicity in the local paper and obtained a swing to the Conservatives slightly better than the national average.Crick 1997, pp. 88–9."]}, {"page": "Huw Irranca-Davies", "response": ["Irranca-Davies was born Ifor Huw Davies in 1963 to Teresa and Gethin Davies. He campaigned as a boy in general elections for his step great-uncle, Ifor Davies, MP for Gower and deputy to Cledwyn Hughes at the Welsh Office during Harold Wilson's government. He attended Gowerton Comprehensive School (where his mother was a secretary), and later earned a BA (Hons) at Crewe and Alsager College, and an MSc from Swansea Metropolitan University."]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|Ifor Davies"]}, {"page": "List of MPs elected in the October 1974 United Kingdom general election", "response": ["|Ifor Davies"]}, {"page": "List of MPs elected in the February 1974 United Kingdom general election", "response": ["|Ifor Davies"]}, {"page": "List of United Kingdom by-elections (1979–2010)", "response": ["|Ifor Davies"]}, {"page": "Gower (UK Parliament constituency)", "response": ["|Ifor Davies"]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| Ifor Davies"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| Ifor Davies"]}, {"page": "List of MPs elected in the 1964 United Kingdom general election", "response": ["| Ifor Davies"]}, {"page": "List of MPs elected in the 1966 United Kingdom general election", "response": ["| Ifor Davies"]}, {"page": "1979 Welsh devolution referendum", "response": ["Kinnock, the future leader of the Labour Party, called himself a \"unionist\". His stated view was that \"between the mid-sixteenth century and the mid-eighteenth century Wales had practically no history at all, and even before that it was the history of rural brigands who have been ennobled by being called princes\". He was one of six south Wales Labour MPs who opposed their own Government's plans, along with Leo Abse (Pontypool), Donald Anderson (Swansea East), Ioan Evans (Aberdare), Fred Evans (Caerphilly), and Ifor Davies (Gower)."]}, {"page": "Labour government, 1964–1970", "response": ["|Ifor Davies||21 October 1964 – 6 April 1966|| ", "|Ifor Davies||6 April 1966|| "]}, {"page": "1982 in Wales", "response": ["*16 September – At the Gower by-election brought about by the death of Ifor Davies, Gareth Wardell holds the seat for Labour.", "*6 June – Ifor Davies, politician, 71"]}, {"page": "1959 in Wales", "response": ["**Newly elected MPs include John Morris (Aberavon); Donald Box (Cardiff North); Ifor Davies (Gower) and Geraint Morgan (Denbigh)."]}, {"page": "David Grenfell", "response": ["Grenfell held office in many local bodies, and was made an Honorary Freeman of Swansea for his contribution to public service. A bust of him now stands in the Swansea Guildhall. He was succeeded as Member of Parliament for Gower by his former agent, County Councillor Ifor Davies of Gowerton, who continued to hold the Gower seat until his death in 1982. His brother, William John Grenfell, was for a number of years a member of Llwchwr Urban District Council, representing the Pontybrenin ward."]}]}}