{"wiki_id": "http://www.wikidata.org/entity/Q5991701", "itemLabel": "Ray Monk", "itemDescription": "British philosopher", "wikipedia_url": "https://en.wikipedia.org/wiki/Ray_Monk", "wikipedia_page": {"main": "Ray Monk  (born 15 February 1957) is a British biographer who is renowned for his philosophical biographies. He is emeritus professor of philosophy at the University of Southampton, where he taught in various capacities from 1992 to 2018.", "link_mentions": [{"page": "Bertrand Russell", "response": ["*Ray Monk. Bertrand Russell: Mathematics: Dreams and Nightmares, London: Phoenix, 1997, ", "*Ray Monk. Bertrand Russell: The Spirit of Solitude, 1872–1920 Vol. I, New York: Routledge, 1997, ", "*Ray Monk. Bertrand Russell: The Ghost of Madness, 1921–1970 Vol. II, New York: Routledge, 2001, "]}, {"page": "G. E. Moore", "response": ["George Edward Moore  (4 November 1873 – 24 October 1958) was an English philosopher, who with Bertrand Russell, Ludwig Wittgenstein and earlier Gottlob Frege was among the founders of analytic philosophy. He and Russell led the turn from idealism in British philosophy and became known for advocating common-sense concepts and contributing to ethics, epistemology and metaphysics. He was said to have an \"exceptional personality and moral character\". Ray Monk later dubbed him \"the most revered philosopher of his era\". As Professor of Philosophy at the University of Cambridge, he influenced but abstained from the Bloomsbury Group. He edited the journal Mind. A fellow of the British Academy from 1918, he was among the intellectually secret Cambridge Apostles in 1894–1901 and chaired the Cambridge University Moral Sciences Club in 1912–1944. As a humanist, he presided over the British Ethical Union (now Humanists UK) in 1935–1936."]}, {"page": "Ludwig Wittgenstein", "response": ["Ray Monk writes that Karl's aim was to turn his sons into captains of industry; they were not sent to school lest they acquire bad habits, but were educated at home to prepare them for work in Karl's industrial empire. Three of the five brothers would later commit suicide. Psychiatrist Michael Fitzgerald argues that Karl was a harsh perfectionist who lacked empathy, and that Wittgenstein's mother was anxious and insecure, unable to stand up to her husband. Johannes Brahms said of the family, whom he visited regularly: They seemed to act towards one another as if they were at court.The family appeared to have a strong streak of depression running through it. Anthony Gottlieb tells a story about Paul practicing on one of the pianos in the Wittgensteins' main family mansion, when he suddenly shouted at Ludwig in the next room:I cannot play when you are in the house, as I feel your scepticism seeping towards me from under the door!", "* Wittgenstein, BBC Radio 4 discussion with Ray Monk, Barry Smith & Marie McGinn (In Our Time, 4 December 2003)"]}, {"page": "Tractatus Logico-Philosophicus", "response": ["Although Wittgenstein largely disregarded Aristotle (Ray Monk's biography suggests that he never read Aristotle at all) it seems that they shared some anti-Platonist views on the universal/particular issue regarding primary substances.  He attacks universals explicitly in his Blue Book.", "*Ray Monk, Ludwig Wittgenstein, the Duty of Genius, Jonathan Cape, 1990."]}, {"page": "J. Robert Oppenheimer", "response": ["In a seminar at the Woodrow Wilson Institute on May 20, 2009, based on an extensive analysis of the Vassiliev notebooks taken from the KGB archives, John Earl Haynes, Harvey Klehr and Alexander Vassiliev confirmed that Oppenheimer never was involved in espionage for the Soviet Union. Soviet intelligence tried repeatedly to recruit him, but was never successful; Oppenheimer did not spy on the United States. In addition, he had several persons removed from the Manhattan Project who had sympathies to the Soviet Union. Haynes, Klehr and Vassiliev also state Oppenheimer \"was, in fact, a concealed member of the CPUSA in the late 1930s\".John Earl Haynes, Harvey Klehr and Alexander Vassiliev, Spies: The Rise and Fall of the KGB in America (New Haven: Yale University Press, 2009), p. 58. According to biographer Ray Monk: \"He was, in a very practical and real sense, a supporter of the Communist Party.  Moreover, in terms of the time, effort and money spent on Party activities, he was a very committed supporter\".."]}, {"page": "University of Southampton", "response": ["Academics working at the university include Sir Tim Berners-Lee, inventor of the World Wide Web; Wendy Hall, inventor of Microcosm, a predecessor of the World Wide Web, founding director of the Web Science Trust between the University of Southampton and MIT; José Antonio Bowen, President of Goucher College and a Fellow of the Royal Society of Arts; Erich Zepler, who made leading contributions to radio receiver development; David Payne, inventor of EDFA for use in fibre optics cables; Sir Barry Cunliffe, a pioneer of modern British archaeology; Ray Monk, the biographer of Ludwig Wittgenstein; Albie Sachs, former Judge of the Constitutional Court of South Africa; and Tim Holt, former President of the Royal Statistical Society and Office for National Statistics. Wole Ademola Adewole, an aspiring researcher and innovative thinker. "]}, {"page": "Qian Xuesen", "response": ["While at Caltech, Tsien had secretly attended meetings with J. Robert Oppenheimer's brother Frank Oppenheimer, Jack Parsons, and Frank Malina that were organized by the Russian-born Jewish chemist Sidney Weinbaum and called Professional Unit 122 of the Pasadena Communist Party.Ray Monk, Robert Oppenheimer: A Life Inside the Center Random House  (2012)  Weinbaum's trial commenced on 30 August and both Frank Oppenheimer and Parsons testified against him.George Pendle, Strange Angel: The Otherworldly Life of Rocket Scientist John Whiteside Parsons Mariner Books (2006)  p. 291. Weinbaum was convicted of perjury and sentenced to four years.Chang (1995), p. 159. Tsien was taken into custody on 6 September 1950 for questioning and for two weeks detained at Terminal Island, a low-security United States federal prison near the ports of Los Angeles and Long Beach."]}, {"page": "John Llewellyn Rhys Prize", "response": ["|1990 || Ray Monk || Ludwig Wittgenstein: The Duty of Genius || "]}, {"page": "Duff Cooper Prize", "response": ["*1991 – Ray Monk, Ludwig Wittgenstein: The Duty of Genius"]}, {"page": "Index of philosophy articles (R–Z)", "response": ["* Ray Monk"]}, {"page": "R. G. Collingwood", "response": ["*\"How the untimely death of RG Collingwood changed the course of philosophy forever\" 2019 article by Ray Monk for Prospect "]}, {"page": "Maurice O'Connor Drury", "response": ["Drury's book, \"The Danger of Words\" has been described by Ray Monk as 'the most truly Wittgensteinian book published by any of Wittgenstein's students'. Drury brought Wittgenstein's \"critique of language\" to bear on the practice of medicine, and particularly psychology that promised the same control over the mind that physics achieved with matter. This promise, pointed out Drury, was one where the delivery date was always being pushed into the future."]}, {"page": "Royal Society of Literature", "response": ["| Ray Monk"]}, {"page": "G. E. M. Anscombe", "response": ["After her fellowship at Cambridge ended, she was awarded a research fellowship at Somerville College, Oxford, but during the academic year of 1946/47, she continued to travel to Cambridge once a week to attend tutorials with Wittgenstein that were devoted mainly to the philosophy of religion. She became one of Wittgenstein's favourite students and one of his closest friends. Wittgenstein affectionately referred to her by the pet name \"old man\" – she being (according to Ray Monk) \"an exception to his general dislike of academic women\". His confidence in Anscombe's understanding of his perspective is shown by his choice of her as translator of his Philosophical Investigations (for which purpose he arranged for her to spend some time in Vienna to improve her German)."]}, {"page": "Richard Ellmann", "response": ["It is considered to be the definitive work on the subject. Ray Monk, a philosopher and biographer, described Ellmann's Oscar Wilde as a \"rich, fascinating biography that succeeds in understanding another person\"."]}, {"page": "The Jew of Linz", "response": ["Ray Monk, one of Wittgenstein's biographers, concentrates on the inconsistencies in Cornish's theory that Wittgenstein was the head of the Cambridge spy ring, asking why Cornish has apparently not bothered to verify any of his theories by checking the KGB archives.  Ultimately, Monk says \"As I read The Jew of Linz, I found myself wondering how on earth Cornish had confected so strange a piece of work. I found it by turns puzzling, funny, challenging and outrageously nutty... Cornish calls his book 'pioneer detective work', but I think it is really pioneer detective fiction.\"Monk, Ray. \"The Jew of Linz: Wittgenstein, Hitler and Their Secret Battle for the Mind\", Quadrant, Sept 1998."]}, {"page": "List of philosophers born in the 20th century", "response": ["* Ray Monk (born 1957)"]}, {"page": "Paul Boghossian", "response": ["* 'The Word and the World': Debate with philosopher Ray Monk and novelist Joanna Kavenna."]}, {"page": "Alexander Waugh", "response": ["Waugh's biography of the Wittgenstein family (The House of Wittgenstein: A Family at War) was published in 2008. Terry Eagleton in a review for The Guardian found it an \"eminently readable, meticulously researched account of the Wittgenstein madhouse\". Although he thought Waugh wrote less about Ludwig Wittgenstein than he would desire, he \"certainly casts some light\" on the philosopher's \"extraordinary contradictions.\" Philosopher Ray Monk in his review for Standpoint magazine commented that Waugh, in his account of a substantial portion of the Wittgenstein family fortune ending up with the Nazis, uses \"much hitherto unknown documentation\" and \"Waugh's version is more authoritative and fuller than previous accounts.\" Monk writes that concert pianist Paul Wittgenstein gains the largest share of the text and much of the book is written from his viewpoint."]}]}}