{"wiki_id": "http://www.wikidata.org/entity/Q599476", "itemLabel": "Len Harvey", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Len_Harvey", "wikipedia_page": {"main": "Leonard Austen \"Len\" Harvey (11 July 1907 – 28 November 1976) was a Cornish boxer. A great defensive boxer, he boxed at every weight division available at the time, from flyweight to heavyweight.  He became the light-heavyweight and heavyweight champion of the British Empire, and was recognised as world light-heavyweight champion in Britain from 1939 to 1942.\n\n", "link_mentions": [{"page": "Knockout", "response": ["* Len Harvey 57"]}, {"page": "John Henry Lewis", "response": ["Lewis defeated British ring master, Londonite Len Harvey before an impressive audience of 11,800 in a decisive fifteen-round title decision at London's Wembley Stadium, on November 9, 1936. His attack caused Harvey to cling and clutch throughout the bout. From a slow start in the first two rounds, Lewis increased the fury of his attack using both fists in the remaining rounds, and trying hard for a knockout in the last three. Harvey was able to protect himself from a knockout in the final rounds.\"John Henry Lewis Retains Light Heavyweight Crown\", The Star Press Muncie, Indiana, p. 10, November 10, 1936 Lewis received few injuries, but slight damage to one of his eyes, which had been partially caused during his training for the bout. The injury later proved to be serious and catastrophic to his boxing career. Harvey complained of an injured right hand after the bout.\"Arizona Negro Too Clever For British Rival\", The Philadelphia Inquirer, Philadelphia, Pennsylvania, p. 23, November 10, 1936\"Lewis Defeats British Hope\", Reno Gazette-Journal, Reno, Nevada, p. 11, November 10, 1936", "His next fight would have been a rematch with Len Harvey in London, but it was cancelled after Lewis failed the pre-fight medical tests. The blindness in his left eye and impaired vision in his right was of primary concern and he subsequently announced his retirement at only twenty-six.Blind in left eye in \"Lewis Refuses to Quit Ring\", Oakland, California, p. 29, June 23, 1939 Lewis had a record of 103 wins, 9 losses and 6 draws, with 60 wins by knockout.", "|style=\"text-align:left;\"| Len Harvey"]}, {"page": "Freddie Mills", "response": ["In January 1940 he joined the Royal Air Force and went on to become first a corporal physical training instructor and, by the following year, a sergeant, while continuing to box professionally. He fought Jock McAvoy, the British and Commonwealth middleweight champion, the fight made at 12st 9lbs, McAvoy having the previous year unsuccessfully fought Len Harvey for the British and Commonwealth light-heavyweight titles. The fight against McAvoy took place in Liverpool in August 1940 and Mills won a clear decision over ten rounds. Mills subsequent fought mainly at light heavyweight.", "Mills was due to fight McAvoy in January 1942 in a final eliminator for the British and Empire (later 'Commonwealth') light-heavyweight title, but withdrew from the fight, stating that wanted to concentrate on fighting at heavyweight and challenge for Len Harvey's title. He beat Tom Reddington at heavyweight later that month, but evidently had a change of heart, and in February 1942 fought McAvoy in a final eliminator for the light-heavyweight titles. The fight, in the Royal Albert Hall, ended after one round when McAvoy was forced to retire with an injured back. The way was open for Mills to challenge Len Harvey for the British and Empire light-heavyweight titles (Harvey at the time also holding the British heavyweight title).", "Len Harvey's retirement in early 1943 left the British and Empire heavyweight titles vacant. Mills and London were nominated to fight for the titles by the BBBofC in April that year, but after the fight was postponed three times, twice due to injuries sustained by London, they eventually met in September 1944. The fight took place at the Kings Hall, Belle Vue, Manchester, with Mills conceding just over three stone (19 kilos) in weight. Both men were at the time serving in the Royal Air Force. Mills showed speed and aggression, but London's superior strength and power were evident in the closing stages and the heavier man was awarded the decision after fifteen rounds.", "|align=left| Len Harvey"]}, {"page": "Boxing in the 1940s", "response": ["*June 20 – Freddie Mills conquers the British version of the world Light-Heavyweight title with a second-round knockout over Len Harvey, in London."]}, {"page": "Boxing in the 1930s", "response": ["*November 9 – John Henry Lewis retains the world Light-Heavyweight title with a fifteen-round decision over Len Harvey, in London."]}, {"page": "White City Stadium", "response": ["Between 1932 and 1958 the stadium hosted major British boxing events, with attendances peaking as high as 90,000 for the second meeting between Len Harvey and Jack Petersen in 1934. The first major fight at the stadium was Len Harvey's unsuccessful challenge for the NBA Middleweight Championship versus Marcel Thil of France. Future heavyweight champion Primo Carnera suffered his only defeat on British soil here when he lost to Canadian Larry Gains in May 1932. Other important fighters to appear at White City include Jock McAvoy, Don Cockell, Nino Valdez, Henry Cooper and Terry Downes."]}, {"page": "Marcel Thil", "response": ["Thil successfully defended the title on July 4, 1932, with a 15-round unanimous decision against Len Harvey, but then went more than a year without a title defense. Thil was stripped by the NBA for failing to make a title defense by August 15, 1933, but he remained the IBU champion.", "|align=left| Len Harvey", "|align=left| Len Harvey"]}, {"page": "Vince Dundee", "response": ["|align=left| Len Harvey", "|align=left| Len Harvey", "|align=left| Len Harvey", "|align=left| Len Harvey"]}, {"page": "Sport in Cornwall", "response": ["Helston-born boxer Bob Fitzsimmons (26 May 1863 – 22 October 1917), who moved to New Zealand as a child, was the first ever boxer to become Heavyweight, Light-Heavyweight and Middleweight World Champion. Len Harvey was another notable boxer from Cornwall."]}, {"page": "Harringay Arena", "response": ["Boxing became firmly established at the Arena prior to the war. On 7 April 1938 Harringay was the venue for the first boxing match to be televised live when the full 15 rounds between Len Harvey v Jock McAvoy were broadcast. Following the war Harringay was a very successful boxing venue. During its 22-year life, it was home to five world title fights, a record for any British venue by the time the Arena ceased operating as a venue in 1958."]}, {"page": "Lonsdale Belt", "response": ["! scope=\"row\" |  Len Harvey"]}, {"page": "November 1976", "response": ["**Len Harvey, 69, Welsh professional boxer who had fought in all five of the weight classes (flyweight, welterweight, middleweight, light‐heavyweight and heavyweight) during his career, and who had won a championship in three weight classes during his 25-year career.\"Len Harvey, Boxer, Dead at 69; Fought in Every Weight Class\", The New York Times, November 29, 1976, p. 30  Within the British Commonwealth he was middleweight champion (1929 to 1933), light heavyweight champ (1939 to 1942) and heavyweight champ twice (1934 and 1939 to 1942)."]}, {"page": "List of world light-heavyweight boxing champions", "response": ["| Len Harvey"]}, {"page": "Stoke Climsland", "response": ["* Len Harvey, a boxer, who held one 'version' of the World's Light-Heavyweight Championship from 1939 until 1942; born here"]}, {"page": "Jack Petersen (boxer)", "response": ["In his next fight, Petersen made his third title defence, against Len Harvey. The bout was in November 1933, at the Royal Albert Hall, and Harvey won on points over 15 rounds. This was Petersen's first defeat in his 25th fight.", "The re-match with Len Harvey was for the British and the British Empire (now Commonwealth) titles. They fought in June 1934 at the White City Stadium, London and this time Petersen was victorious by a twelfth-round technical knockout.", "These two defeats were a shock. Throughout his short career he had been managed by his father, but the relationship broke down following his latest defeats and Petersen decided to manage himself in future. Petersen continued to defend his titles successfully. He met Len Harvey for a third title fight in January 1936, at Wembley, and won on points over fifteen rounds.", "Petersen's fourth title defence was against Ben Foord, whom he had knocked out in thirteen rounds in 1934, when preparing for his re-match with Len Harvey. Foord was a South African, who was qualified by residence to fight for both titles. The bout was in August 1936 at Leicester, and Petersen lost by a technical knockout in the third round."]}, {"page": "List of British heavyweight boxing champions", "response": ["|align=left | Len Harvey", "|align=left | Len Harvey"]}, {"page": "List of British light-heavyweight boxing champions", "response": ["|align=left | Len Harvey ", "|align=left | Len Harvey"]}, {"page": "Jack London (boxer)", "response": ["London's recent successes against good quality opponents appeared to have put him in line for a title challenge against British heavyweight champion, Tommy Farr, but Farr seemed reluctant to fight him, perhaps because he was not a draw for crowds. In May 1937 London fought the American, Buddy Baer, brother of Max Baer, losing on points over ten rounds. Baer was later to fight Joe Louis twice for the world heavyweight title, losing both fights. When Farr relinquished his heavyweight title, London was ignored and Len Harvey beat Eddie Phillips to take the vacant British heavyweight title in December 1938.", "War interrupted London's boxing career, and he joined the Royal Air Force, being stationed near Blackpool. London so liked the place that he would later relocate his family there. London continued to fight during the war years but managed only twelve bouts. Len Harvey was still heavyweight champion but decided to challenge for the vacant British and Commonwealth light-heavyweight titles, beating Jock McAvoy on points. He then defended his light-heavyweight titles against Freddie Mills in June 1942 being knocked out in the second round. Harvey promptly retired leaving his heavyweight tiles vacant. London now had his chance."]}, {"page": "List of British films of 1936", "response": ["| Excuse My Glove || Redd Davis || Len Harvey, Archie Pitt || Sports ||"]}, {"page": "List of British middleweight boxing champions", "response": ["|align=left | Len Harvey "]}, {"page": "List of Cornish sportsmen and sportswomen", "response": ["* Len Harvey, boxer"]}, {"page": "Frank Moody", "response": ["Moody was now fighting with less frequency, and on 6 August 1928 he travelled to Glasgow to face Tommy Milligan for the British middleweight title, which Moody had vacated earlier. Milligan was knocked out in the first round, but Moody would lose his newly recaptured title just three weeks later when he was defeated by Alexander Ireland. That was Moody's final fight of 1928, and in 1929 he fought just four times, which included a win over Italy's Leone Jacovacci, a loss to the great Len Harvey and then losing his British Light Heavyweight title to Harry Crossley.", "|align=left| Len Harvey"]}, {"page": "List of Desert Island Discs episodes (1951–1960)", "response": ["|||Len Harvey||No book||Box of books|| more"]}, {"page": "The Bermondsey Kid", "response": ["* Len Harvey - himself"]}, {"page": "List of Commonwealth Boxing Council champions", "response": ["|align=left |  Len Harvey", "|align=left |  Len Harvey", "|align=left |  Len Harvey (2)", "|align=left |  Len Harvey (1)"]}, {"page": "Ben Jeby", "response": ["Jeby would become one of several Jewish title-holders of the time.  On March 20, 1931, weighing 157.5 pounds, he defeated Len Harvey on points over 12 rounds in a unanimous decision at Madison Square Garden in New York City.  Jeby fought a rushing, mauling, body punching battle, at close range, for which Harvey had no answer.  His attempts to clinch were inadequate to stop the onrush of Jeby.\"Jeby Beats Harvey in 12-Round Bout\", The Ithaca Journal, Ithaca, New York, pg. 14, 21 March 1931\"Jeby Beats Len Harvey at New York\", The Meriden Daily Journal, March 21, 1931\"Len Harvey Ready to Return Home\", The Milwaukee Journal, March 21, 1931", "|style=\"text-align:left;\"| Len Harvey"]}, {"page": "Excuse My Glove", "response": ["Excuse My Glove is a 1936 British, black-and-white comedy sports film directed by Redd Davis starring Len Harvey, and Bobbie Comber.BFI.org It was produced by Alexander Film Productions."]}, {"page": "Eddie Phillips (boxer)", "response": ["*March 1933, Len Harvey, Royal Albert Hall, London.", "*June 1933, Len Harvey, Olympia, Kensington.", "*October 1935, Len Harvey, Millbay Rinkeries, Devon.", "*December 1938, Len Harvey, Harringay Arena, Harringay."]}, {"page": "List of Elstree Studios productions", "response": ["| Excuse My Glove || Sports comedy || Redd Davis || Len Harvey, Bobbie Comber"]}, {"page": "Larry Gains", "response": ["After a successful amateur career, Gains made the decision to go professional, travelling to Britain on a cattle ship and making his professional début in London as \"The Toronto Terror\" in June 1923.Page, Joseph S. (2010) Primo Carnera: The Life and Career of the Heavyweight Boxing Champion, McFarland & Co Inc, , p. 82\"Larry Gains Won\", The Gazette (Montreal), 13 April 1926, p. 17 Many of his early fights were in France (where he befriended Morley Callahan and Ernest Hemingway who at the time were working as newspaper reporters) and Germany, where he beat Max Schmeling in 1925. On Feb.28, 1927 he became Canadian Heavyweight Champion when he stopped Horace \"Soldier\" Jones in 5 rounds at Toronto. He later defended it against two of the biggest names in Canadian boxing at the time, Jack Renault and Charlie Belanger.Andrews, David L. (2001) Michael Jordan, Inc.: Corporate Sport, Media Culture and Late Modern America, State University of New York Press, , p. 211 He settled in Leicester, England in 1930, where many of his fights over the next few years were held. Noted primarily as a slick boxer he KO'd Phil Scott in front of 30,000 spectators at Leicester Tigers' Welford Road ground in 1931, taking the British Empire title, although the colour bar was still in place.Fruman, Andrew \"A Backward Glance-1931, The Year in Boxing: Larry Gains Wins Empire Title, Brown & Sanstol in Action\", thecruelestsport.com. Retrieved 12 March 2012 The colour bar was lifted in 1932, and he cemented his hold on the title with a victory over white South African Donald McCorkindale at the Royal Albert Hall, the fight ending in an unpopular points decision for Gains, with Gains' trainer Jack Goodwin collapsing and dying during the fight.Cummings, A.C. (1932) \"Gains Failed to Hold Early Lead\", Calgary Daily Herald, 30 January 1932, p. 7. Retrieved 12 March 2012 Gains was the second black fighter to fight at the Royal Albert Hall, as Len Johnson was the first black fighter due to his contest with Adolf Pott being first. He went on to beat Primo Carnera in front of 70,000 people at White City, London in May that year (a British record attendance for a boxing match), despite Carnera having an advantage of 60 pounds in weight and a four inches in height.\"Larry Gains Beats Carnera on Points as 70,000 Look On\", The Gazette (Montreal), 31 May 1932, p. 11 He lost the British Empire title in 1934 to Len Harvey, and failed to regain it later that year, defeated by Jack Petersen in front of a crowd of 64,000 at White City.\"Empire Heavyweight Championship: Petersen Beats Gains\", The Sydney Morning Herald, 12 September 1934, p. 22. Retrieved 12 March 2012", "|align=left| Len Harvey", "|align=left| Len Harvey"]}, {"page": "Dave Shade", "response": ["Dave Shade (March 3, 1902 – June 23, 1983) was an American boxer active from 1918 to the 1935, amassing a total of nearly 250 bouts fought during the course of his career.Dave Shade's Professional Boxing Record. BoxRec.com. Retrieved on 2014-05-18. His famous low crouching bob-and-weave style earned him a reputation as one of the cleverest boxers of his time period.International Boxing Hall of Fame - Dave Shade IBHOF.com Retrieved on 2014-04-05 Although Shade never captured a world title, he fared very well against the best boxers of his era including the likes of Mickey Walker, Jack Britton, Maxie Rosenbloom, Len Harvey and Jimmy Slattery.Cyber Boxing Encyclopedia - Dave Shade CyberBoxingZone.com Retrieved on 2014-04-30 Shade was inducted into the International Boxing Hall of Fame in 2011.", "|align=left| Len Harvey", "|align=left| Len Harvey"]}, {"page": "Len Johnson (boxer)", "response": ["*  As an amateur, Johnson learnt the fundamentals of boxing in the boxing booths of Bill Moore and Bert Hughes. After turning professional later in 1920, he defeated current and former champions, including former world welterweight champion Ted \"Kid\" Lewis in 1925. Due to then Home Secretary Winston Churchill's decision in 1911 to support a colour bar, he was banned from competing at both the Royal Albert Hall and National Sporting Club. Additionally, the British Boxing Board of Control would not sanction a championship bout with Johnson for the Lonsdale Belt, due to their Rule 24, which stated that title contestants \"[...] must have two white parents\", though despite this he defeated Harry Collins in Australia for the middleweight championship of the British Empire in 1926. Johnson became famous in Britain for his impressive victories, defeating European and British middleweight champion Roland Todd in 1927. In the same year, he also defeated future middleweight champion Len Harvey, and rounded up the decade thrashing European middleweight champion Leone Jaccovacci in 1928 and European light-heavyweight champion Michele Bonaglia in 1929.", "After the Etienne disqualification, Johnson set his sights on Len Harvey, and in front of a crowd of 4,000 at The Ring, Johnson went the full twenty-rounds and defeated Harvey via a points decision. At the weigh in, Johnson weighed in at 160 pounds (72.6 kg), while Harvey came in lighter at 156.5 pounds (71 kg). Both boxers had their respective fathers as seconds. Johnson's victory was beyond dispute, for he was much superior than Harvey, who hardly won a solitary round, and was nearly always out-scored. Harvey had a shade the better of the early rounds, more so the first and sixth, though Johnson appeared to be hitting the harder of the two, which was rather surprising as Johnson had failed to show that he had possessed a really good punch in the majority of his previous contests. From the seventh, Johnson began to wear Harvey down with good two-handed punches both to the body and the face. Harvey was never idle, and continually got home home straight and accurate lefts, but his right was not so much evident as usual. The punishment Harvey took sapped his strength and his face bore evidence of the hard punching Johnson. Johnson was practically unmarked at the close of the contest when referee Sam Russell announced the victor. He was the clear winner on points, and exposed Harvey's offensive and defensive weaknesses. After the fight, many felt Johnson had substantiated his claim to a meeting with Tommy Milligan.", "On 2 January 1931, The Leicester Evening Mail exclusively announced that Larry Gains had a scheduled meeting with Sam Russell of the National Sporting Club, with a view of removing the colour bar in British boxing, to which Gains stated, \"[...] It will mean that Johnson will be able to fight Harry Crossley for the Londsale cruiserweight belt [...] You can guess what the lifting of the ban would mean to me.\" As of 5 February, the National Sporting Club had scrapped the rule prohibiting coloured boxers on their programmes, and it was hoped that some amends would be made to Johnson. On 25 February, The Western Morning News announced that Johnson had signed up for three matches in Manchester, with the Belle Vue Syndicate proposing to match him with Harry Crossley and Len Harvey, light-heavyweight and middleweight champions, respectively. On 27 March, Northampton Chronicle & Echo reported that Johnson would appear at King's Hall, Manchester on 6 April, in a match at light-heavyweight against Jack Etienne, who was regarded as one of the best light-heavyweights in Europe. Leading up to the fight, Johnson was the major betting-line favourite, though on 6 April, Etienne narrowly outpointed him over fifteen-rounds at King's Hall, Manchester. Johnson was particularly keen to win the rubber-match with Etienne in view of the possibilities of a rematch with Len Harvey. Johnson started off well, and in the earlier rounds had a slight lead, but Etienne was always the stronger of the two. The Belgian fighter launched a fierce two-handed attack from the start and found frequent loopholes in Johnson's defence. During the post-fight interviews, Bill Johnson, father and manager of Len, remarked that his son had won the fight, in which he expanded: \"[...] the referee thought otherwise. That is all there is to that. The boys meet again on Monday next, and if Etienne's party think that the Belgian can confirm what the referee thought: I have £100 ready to place on the table to say he can't [...]\" The rematch was set for two-weeks later on 21 April, for £50 a-side.", "On 27 April, Johnson returned to the Royal Albert Hall to face former French light-heavyweight champion Arthur Vermaut, who was knocked out in half-a-minute into round-one with a perfectly timed left to the body from Johnson. Johnson disregarded the Frenchman's left, and when they went into clinches Johnson hit heavily with both hands. After half a minute of fighting, Johnson, in a breakaway, got in a left and a right and then another left to the side of the body. Vermaut went down in agony, to be counted out. After knocking out Vermaut, on 27 April, it was announced that Johnson would rematch Len Harvey in a fifteen-round contest at the Royal Albert Hall on 11 May. Additionally, it was also revealed to be taking place under strict championship conditions at the middleweight poundage, and that the contest would be a championship affair, albeit won't be sanctioned by the British Boxing Board of Control, which does not allow coloured boxers to box for British titles. Harvey had campaigned against the colour bar which had prevented black boxers competing for titles, in which he insisted on fighting Johnson and then Larry Gains.", "On 24 September, it was announced that Johnson would make a return to middleweight and be matched with Marcel Thil, the middleweight champion of France, on 3 October, at the opening of the winter season at the Palais des Sports, Paris, though due to Thil spraining his ankle, the fight was postponed to 31 October. In the interim of training for the Thil fight, future British heavyweight champion Jack London had accepted Johnson's offer to fight him. In preparation for Thil, Johnson was sparring Jim Stanley and Valenzo Pinca. At the weigh-in, Johnson scaled in at 163 and a half-pounds, whereas Thil came in lighter at 161 and a half-pounds. On 31 October, in front of a crowd of 25,000 at the Palais des Sports, Johnson was defeated by Thil via a referee-technical decision. After seven fierce rounds, Johnson was forced to give up. The gong sounded for the eighth-round, but Johnson rose from his corner and said that he was unable to continue. Of the seven rounds fought, Thil won five, and the other two were even rounds. After his defeat to Thil, Johnson was confirmed as an opponent for Seaman Albert Harvey, the middleweight champion of the Eastern Counties, however, as Johnson was unable to fight, Len Harvey deputised in his stead.", "* Len Harvey, three divisional British champion and world light-heavyweight contender, maintained the view: \"Len was one of the finest boxers I have ever met. Only his colour prevented him from winning the highest honours in the game. He had a perfect style, and it was a joy to watch him using that colossally long left of his, unless, of course, you happened to be facing the business end of it.\"", "* Eric Stone, sports writer for The Leicester Evening Mail, wrote: \"The night that Harry Corbett lost his title, Len Harvey won a title. Yet, it was not long before that Harvey had been beaten by a man who had stopped the great Kid Lewis. That man was Len Johnson: one of the greatest middleweights we have ever seen.\"", "* The Prince at the Ring A 1928 newspaper account of Johnson's loss to Len Harvey."]}, {"page": "Walter Neusel", "response": ["After the Schmeling fight, Neusel held another future Hall of Famer in Len Harvey to a 12 round draw. Following up with back-to-back victories over Welsh contender Jack Petersen.WALTER NEUSEL UND DER MEGAKAMPF GEGEN SCHMELING Boxen.de Retrieved on April 30, 2014 In 1935, Neusel returned to America to face former Heavyweight World Title holder Primo Carnera; losing the bout via fourth round knockout. He then returned to Europe and beat South African challenger Ben Foord twice, with both wins sandwiched around a loss to Tommy Farr.Walter Neusel – German Boxer Munzinger.de Retrieved on April 30, 2014", "|align=left| Len Harvey"]}, {"page": "Harry Mason (boxer)", "response": ["In an important defence of his lightweight title on 29 April 1926, Mason drew with ring great Len Harvey at Royal Albert Hall in Kensington.  In a close match, Harvey had the advantage in height and reach, and did well with lefts to the face and body, but Mason scored with straight lefts to the body throughout the bout. Mason was down in the first and eighteenth rounds.\"Harry Mason and Len Harvey Drew After 20 Round Bout\", The Gazette, Montreal, Canada, pg. 18, 30 April 1926"]}, {"page": "Jack Hood", "response": ["An undefeated run back in the UK, including a knock-out win over European middleweight champion Bruno Frattini and a points win over Belgian cruiserweight champion Louis Wustenrad, led to a fight in October 1929 with Len Harvey, with British and Empire middleweight titles and a £4,100 purse at stake; Harvey won, and retained his titles in a rematch in December after the fight was drawn.", "Hood's welterweight title was removed by the BBBofC in October 1931 after failing to defend the title. Over the next three years Hood fought with mixed success, including defeats to Harry Mason and Len Harvey, and two draws with Dave Shade and a draw with Vince Dundee, but in 1933 he got another shot at the British welterweight title against Stoker George Reynolds after initially turning down the fight as he deemed the £500 purse inadequate; Hood won with a ninth-round knockout to regain the title. This led to a European title fight against Adrien Anneet in May 1933, which Hood won when Anneet was disqualified in the third round for throwing low blows. The fight was subject to an inquiry by the International Boxing Union, which confirmed the result in December."]}, {"page": "July 1939", "response": ["*Len Harvey defeated Jock McAvoy at White City Stadium in London to win the British light heavyweight boxing title. "]}, {"page": "Anthony Joshua vs. Wladimir Klitschko", "response": ["In January 2017, Eddie Hearn announced that more than 80,000 tickets had been sold, a new box office record, overtaking Carl Froch vs. George Groves II. He put a request in for 5,000 more tickets to be made available. London Mayor Sadiq Khan cleared the way for a crowd of 90,000, equalling the British record of Len Harvey and Jock McAvoy set in 1939 and making it the biggest crowd for a heavyweight fight in 90 years."]}]}}