{"wiki_id": "http://www.wikidata.org/entity/Q5996937", "itemLabel": "Jennette Arnold", "itemDescription": "British politician (born 1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jennette_Arnold", "wikipedia_page": {"main": "Jennette Arnold, OBE is a Labour Co-op politician who served as chair of the London Assembly for five terms. From 2004 to 2021, Arnold represented the North East constituency, comprising the London Boroughs of Hackney, Islington and Waltham Forest.\nBorn in Montserrat, Arnold trained as a nurse. She then worked as an Industrial Relations Officer and as Regional Director of Services and Special Adviser (Equalities) to the General Secretary of the Royal College of Nursing. She then worked as an associate for organisational development consultancy, Beacon Associates.Arnold was elected to Islington Council in 1994, eventually serving a term as deputy mayor. On the creation of the Greater London Authority in 2000, she was included on Labour's Londonwide list for the London Assembly, but missed out on a spot. Following the resignation of David Lammy prompted by his election as a Member of Parliament, Arnold as next in line on Labour's list became a Londonwide member of the Assembly in July 2000. She was subsequently selected as Labour's candidate for the North East constituency and elected in the 2004 Assembly election.\nArnold served as Chair of the London Assembly for five terms. She was the London Assembly Labour Group's lead spokesperson on education and Chair of the London Assembly's Education Panel. Arnold previously chaired the Cultural Strategy Group for London, playing a role in bringing the 2012 Olympic and Paralympic Games to London. She has also sat on the Assembly's Economic and Social Development Committee and served as a member of the Metropolitan Police Authority.\nDuring her time in the Assembly, Arnold campaigned on issues including the provision of education for young people with special educational needs and disabilities (SEND) and the improvement of services on the Gospel Oak to Barking line. She also campaigned extensively on the eradication of Female Genital Mutilation (FGM), often citing witnessing a victim of FGM during her time as a student nurse as what prompted her to take action.In 2007 Arnold was listed by New Nation newspaper as one of Britain's 50 most influential black women.\nA member of the UK delegation on the European Committee of the Regions, Arnold is currently: a council member of the Royal Court Theatre; a governor of the Museum of London; a governor of Sadler's Wells Theatre Foundation, a patron of the Victoria Climbie Foundation, and a former Chair of the Stephen Lawrence Charitable Trust.During the 2015 Labour Party leadership election Arnold endorsed Jeremy Corbyn.In January 2019 Arnold announced in a statement to the Assembly that she would not be standing in the 2020 London Assembly election. In May 2020, she stepped down as chair and was replaced by Navin Shah. However, with the deferral of the election by one year due to the COVID-19 pandemic, she continued as an AM until the 2021 London Assembly election.", "link_mentions": [{"page": "Montserrat", "response": ["* Jennette Arnold, the first Montserratian elected as a Member of the London Assembly."]}, {"page": "London Borough of Islington", "response": ["Islington forms part of the North East constituency for the London Assembly, represented by Jennette Arnold, also of the Labour Party."]}, {"page": "Chingford", "response": ["Chingford and Waltham Forest fall within the North East constituency of the London Assembly, represented since 2004 by Jennette Arnold of the Labour party."]}, {"page": "London Borough of Hackney", "response": ["The borough comprises two parliamentary constituencies: Hackney North and Stoke Newington (represented by Diane Abbott MP) and Hackney South and Shoreditch (represented by Meg Hillier MP); both are Privy Counsellors and Labour Party Members of Parliament. The borough is in the North East London Assembly constituency returning Jennette Arnold AM, as the directly elected Assembly Member."]}, {"page": "London Assembly", "response": ["| Jennette Arnold", "| Jennette Arnold", "| Jennette Arnold", "| Jennette Arnold", "| Jennette Arnold"]}, {"page": "List of London Assembly constituencies", "response": ["|rowspan=\"4\"|Jennette Arnold(Labour)", "|rowspan=\"3\"| Jennette Arnold(Labour)"]}, {"page": "Brian Coleman", "response": ["A meeting of the London Assembly's Business Management and Administration Committee on 22 October 2009 had to be suspended for ten minutes after Coleman interrupted another speaker by shouting \"oh shut up you odious toad\" and \"you are the nastiest most odious little man who is unfortunate enough to serve in public life.\"Barnet Mayor Brian Coleman in 'you are an odious toad' row Times Series, 27 October 2009 The Committee chairman Jennette Arnold described the comments as \"totally outrageous\" and \"appalling\".Mayor Coleman's 'odious toad' comments 'totally outrageous' Times Series, 28 October 2009 Coleman's remarks were directed to assembly member John Biggs who stated that they were not acceptable in a public meeting.\"Odious toad\" says Barnet Mayor Brian Coleman is desperate to be quoted Times Series, 4 November 2009 A complaint was lodged with the Assembly Standards Committee who adjudged Colman's conduct had not breached the Code.Decision Notice  Assessment Sub Committee of the Greater London Authority Standards Committee, 2 February 2010"]}, {"page": "2000 London Assembly election", "response": ["|  || Labour Party || Trevor PhillipsSamantha HeathDavid Lammy || Jennette Arnold, Joseph Paul Docherty, Diana Johnson, Abdul Asad, Pamela Wharfe, Katherine Harriet Thorne, Navin Fakirchand Shah"]}, {"page": "Metropolitan Police Authority", "response": ["* Jennette Arnold (London Assembly, Labour)"]}, {"page": "David Pitt, Baron Pitt of Hampstead", "response": ["He returned to the Caribbean to begin his medical career, his first job being as district medical officer in Saint Vincent, followed two years later by a position in Trinidad as house physician at San Fernando Hospital. Continuing his passion for social justice alongside his medical career, and he established his own general practice in San Fernando in 1941 and that year was elected to the San Fernando Borough Council. In 1943, he became a founding member and leader of the West Indian National Party (WINP) – a socialist party whose main aim was to deliver political autonomy across the Caribbean. Under Pitt, the party demanded self-government for Trinidad and Tobago, constitutional reform and the nationalisation of commodities industries such as oil and sugar.Jennette Arnold, \"Echoes of our past: A series of reflections by prominent black people\", 2014.", "In 2009, the annual \"Lord David Pitt Memorial Lecture\" at City Hall in London was initiated by Jennette Arnold in collaboration with the British Caribbean Association.Arnold, \"Echoes of our past\",  p. 6."]}, {"page": "North East (London Assembly constituency)", "response": ["North East is a constituency of the London Assembly. It was previously represented by Jennette Arnold of the Labour Party, who was directly elected at the 2004 election after holding a London-wide seat since 2000. Arnold stood down in 2021. Following the 2021 London Assembly election, Arnold was succeeded by Sem Moema.", "| Jennette Arnold"]}, {"page": "Arnold (surname)", "response": ["*Jennette Arnold, Montserrat-born British politician and member of the Greater London Assembly"]}, {"page": "Politics of Hackney", "response": ["The Borough consists of two parliamentary constituencies: Hackney North and Stoke Newington (represented by Diane Abbott) and Hackney South and Shoreditch (represented by Meg Hillier; both Labour Party Members of Parliament). The Borough is a constituent part of the North East London Assembly seat with the London Borough of Islington and London Borough of Waltham Forest currently held by Jennette Arnold AM. The Borough was a constituent part of the London constituency of the European Parliament until Brexit in 2020."]}, {"page": "2008 London Assembly election", "response": ["|  || Labour Party || Nicky Gavron, Murad Qureshi || John Biggs, Len Duvall, Jennette Arnold, Val Shawcross, Joanne McCartney, Navin Shah, Ranjit Dheer, Balvinder Saund, Leonie Cooper, Ansuya Sodha, Shafi Khan, Alex Heslop"]}, {"page": "Navin Shah", "response": ["With the deferral of 2020 London Assembly election he was elected chair of London Assembly on the 15 May 2020 succeeding Jennette Arnold."]}, {"page": "Arsenal F.C. supporters", "response": ["*Jennette Arnold"]}, {"page": "2009 Birthday Honours", "response": ["* Jennette Arnold. For services to Local Government and to the community in London."]}, {"page": "Cultural Strategy Group", "response": ["The meetings of the inaugural Cultural Strategy Group for London were jointly chaired by Aladin between 2000-4, by Yasmin Anwar between 2000-2 and by Jennette Arnold between 2002-4. Aladin was Co/Vice Chair of the strategy group   itself between 2000-4, Yasmin Anwar was Chair between 2000-2 and Jennette Arnold was Chair 2002-4.", "* Cultural Strategy Group for London Meetings chaired by  Jennette Arnold 2002-4"]}, {"page": "List of ethnic minority politicians in the United Kingdom", "response": ["|Jennette Arnold"]}, {"page": "2012 London Assembly election", "response": ["| style=\"background:#ffaaaa\" |Jennette Arnold (I)(101,902, 1st)"]}, {"page": "Murder of Daniel Morgan", "response": ["Morgan's unsolved murder has been described by Jennette Arnold, a former Labour Co-op politician who served as chair of the London Assembly, as a reminder of the culture of corruption and unaccountability within the Metropolitan Police. The profile of the case has been raised by investigative journalist Peter Jukes, who released a podcast and book about the murder in conjunction with Alastair Morgan, Daniel's brother.", "Morgan's brother Alastair, who had been critical of police inaction and incompetence, expressed confidence in Cook. In 2006, Jennette Arnold, a member of the Metropolitan Police Authority and Alastair Morgan's London Assembly constituency representative, described the unsolved murder as \"a reminder of the old police culture of corruption and unaccountability\" in London. Bugs were installed at Glenn Vian's home. Police arrested Rees and Fillery once again, along with Glenn and Garry Vian, and a builder named James Cook, all on suspicion of murder, as well as a serving police officer suspected of leaking information. Fillery was arrested on suspicion of attempting to pervert the course of justice. Alastair Morgan described it as a \"massive step forward\"."]}, {"page": "Hall Farm Curve", "response": ["Campaigns have been run since the 1990s to have both the curve and Lea Bridge station reinstated. Lea Bridge station re-opened in 2016. Legal powers to re-lay the spur were obtained by British Rail in 1992, but not exercised. The proposal has the support of Waltham Forest London Borough Council; Jennette Arnold, Labour Party politician and member of the London Assembly representing the London Boroughs of Hackney, Islington and Waltham Forest; Stella Creasy, Member of Parliament for Walthamstow; the Walthamstow Liberal Democrats, the Chingford and Woodford Green Liberal Democrats, the Chingford and Woodford Green Labour Party; and Railfuture, an independent organisation campaigning for better rail services in the UK. Transport for London ran a study on the feasibility of reopening the curve for 2016 that produced a result with a benefit-cost ratio ranging between 8:1 and 14:1 depending on the length of trains involved. In 2007, the Greater Anglia Route Utilisation Strategy published by Network Rail suggested that construction of the curve could be possible by 2019 or later."]}, {"page": "London Labour", "response": ["| Jennette Arnold || North East"]}, {"page": "2016 London Assembly election", "response": ["| style=\"background:#faa;\"|Jennette Arnold (I)(134,307, 1st)"]}, {"page": "Endorsements in the 2015 Labour Party leadership election (UK)", "response": ["*Jennette Arnold, Chair of London Assembly and AM for North East"]}, {"page": "2021 London Assembly election", "response": ["*Jennette Arnold, Chair of the London Assembly and Labour member for North East London."]}, {"page": "Endorsements in the 2016 Labour Party leadership election (UK)", "response": ["*Jennette Arnold, AM for North East"]}]}}