{"wiki_id": "http://www.wikidata.org/entity/Q602031", "itemLabel": "Jimmie Nicol", "itemDescription": "English drummer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmie_Nicol", "wikipedia_page": {"main": "James George Nicol (born 3 August 1939) is an English drummer and business entrepreneur. He is best known for temporarily replacing Ringo Starr in the Beatles for a series of concerts during the height of 'Beatlemania' in 1964, elevating him from relative obscurity to worldwide fame and then back again in the space of a fortnight. Nicol had hoped that his association with the Beatles would greatly enhance his career but instead found that the spotlight moved away from him once Starr returned to the group, and in 1965 his subsequent lack of commercial success culminated in bankruptcy. In 1967, after having worked with a number of different bands which included a successful relationship with the Spotnicks, he left the music business to pursue a variety of entrepreneurial ventures. Over the decades, Nicol increasingly shied away from media attention, preferring not to discuss his connection to the Beatles nor seeking financial gain from it. He has a son, Howard, who is a BAFTA award-winning sound engineer.", "link_mentions": [{"page": "August 3", "response": ["*1939 – Jimmie Nicol, English drummer "]}, {"page": "Ringo Starr", "response": ["During an interview with Playboy in 1964, Lennon explained that Starr had filled in with the Beatles when Best was ill; Starr replied: \"[Best] took little pills to make him ill\". Soon after, Best filed a libel suit against him that lasted four years before the court reached an undisclosed settlement in Best's favour. In June, the Beatles were scheduled to tour Denmark, the Netherlands, Asia, Australia and New Zealand. Before the start of the tour, Starr was stricken with a high-grade fever, pharyngitis and tonsillitis, and briefly stayed in a local hospital, followed by several days of recuperation at home. He was temporarily replaced for five concerts by 24-year-old session drummer Jimmie Nicol. Starr was discharged from the hospital and rejoined the band in Melbourne on 15 June. He later said that he feared he would be permanently replaced during his illness. In August, the Beatles were introduced to American songwriter Bob Dylan, who offered the group cannabis cigarettes. Starr was the first to try one but the others were hesitant.: Meeting Dylan in August;  Starr was the first Beatle to smoke cannabis."]}, {"page": "The Beatles", "response": ["* Jimmie Nicol – drums (1964)"]}, {"page": "Fifth Beatle", "response": ["===Jimmie Nicol===", "Jimmie Nicol played drums for the first eight shows of The Beatles' 1964 world tour. Starr became ill and the opening part of the tour was almost canceled. Instead of canceling, the Beatles' manager Brian Epstein hired Nicol to stand in until Starr recovered.  Nicol played with the band in early June, in Denmark, the Netherlands, Hong Kong and Australia.  Nicol made the most of his time, signing autographs and giving interviews. Starr rejoined the band on 14 June, in Melbourne."]}, {"page": "Getting Better", "response": ["According to Beatles biographer Hunter Davies and MacDonald, the initial idea for the song's title came from a phrase often spoken by Jimmie Nicol, the group's stand-in drummer for the Australian leg of their 1964 world tour. The title and music suggest optimism, but some of the song's lyrics have a more negative tone. In this sense, it reflects the contrasting personas of the two songwriters. In response to McCartney's line, \"It's getting better all the time\", Lennon replies, \"Can't get no worse!\" In a December 1983 interview, McCartney praised this contribution as an example of things he \"couldn't ever have done [him]self\". In a 1969 interview, Lennon cited \"Getting Better\" as an example of \"pure Beatles\" music, whereby, with the four band members developing a song, \"we've all written it and we've all turned it into sort of pure Beatle.\" Available at Rock's Backpages (subscription required)."]}, {"page": "Beatallica", "response": ["| Joey Jordison, Jimmie Nicol"]}, {"page": "Nicol", "response": ["* Jimmie Nicol, British drummer"]}, {"page": "You Know What to Do", "response": ["During a photographic assignment on the morning of 3 June 1964, Ringo Starr was taken ill with tonsillitis and pharyngitis, 24 hours before the Beatles were due to leave for a six-country tour. The recording session booked for that day was originally intended to produce a fourteenth song for the band's A Hard Day's Night album, but this activity was cancelled so that a replacement drummer, Jimmie Nicol, could be brought in and rehearse with the group. After running through six songs in a one-hour rehearsal in EMI's Studio Two, everyone felt satisfied with Nicol's drumming, so he left to pack his suitcase."]}, {"page": "The 2i's Coffee Bar", "response": ["The 2i's was the inspiration for the establishment of the Casbah Coffee Club in Liverpool by Mona Best in the cellar of her family home, which played an important role in the early development of the Beatles. In 1960, Bruno Koschmider, manager of the Kaiserkeller club in Hamburg, visited the 2i's to recruit British rock'n'roll musicians to play at his venue: these included Derry and the Seniors, whose manager Allan Williams was also the Beatles' first manager, and who also arranged for the latter band to play in Hamburg for Koschmider. During their time in Hamburg the band worked with Tony Sheridan, who had performed at the 2i's, and later recruited another 2i's veteran, Jimmie Nicol, to fill in for Ringo Starr on an Australian tour."]}, {"page": "List of members of bands featuring members of the Beatles", "response": ["* Jimmie Nicol – drums", "  bar:Jimmy  text:\"Jimmie Nicol\""]}, {"page": "The Spotnicks", "response": ["In 1963, \"Amapola\" became one of their most successful singles in their home country, staying at #1 in Sweden for eight weeks. They appeared in the film Just for Fun, continued to tour widely, and recorded their second album, The Spotnicks in Paris. That year, drummer Ove Johansson left and was replaced by an Englishman, Derek Skinner (born 5 March 1944, London). Two years later, Skinner was replaced briefly by Jimmie Nicol, who had drummed with The Beatles on the Danish, Dutch and Australian leg of their 1964 tour, while Ringo Starr recovered from having his tonsils removed."]}, {"page": "Festival Hall (Melbourne)", "response": ["The Beatles played at the venue during their 1964 World Tour. Ringo Starr rejoined the group after being hospitalized with tonsillitis and temporarily replaced by Jimmie Nicol."]}, {"page": "List of the Beatles' live performances", "response": ["| 4 June 1964* || Copenhagen || Denmark || K.B. Hallen || Jimmie Nicol on drums; Ringo Starr absent due to tonsillitis.  ", "| 5 June 1964* || Hillegom || rowspan=\"3\"|Netherlands || Treslong. TV appearance for VARA.|| Jimmie Nicol on drums; Ringo Starr absent due to tonsillitis.  ", "| 6 June 1964* || Amsterdam || Roundtrip through the canals|| Jimmie Nicol on drums; Ringo Starr absent due to tonsillitis.  ", "| 6 June 1964* || Blokker || Veilinghallen|| Jimmie Nicol on drums; Ringo Starr absent due to tonsillitis.  ", "| 10 June 1964* || Hong Kong || Hong Kong || Princess Theatre|| Jimmie Nicol on drums; Ringo Starr absent due to tonsillitis.  ", "| 12 June 1964* || rowspan=\"2\"|Adelaide || rowspan=\"8\"|Australia || rowspan=\"2\"|Centennial Hall|| Jimmie Nicol on drums; Ringo Starr absent due to tonsillitis.  ", "| 13 June 1964*|| Jimmie Nicol on drums; Ringo Starr absent due to tonsillitis.  "]}, {"page": "The Beatles Anthology (TV series)", "response": ["#*Footage of a discussion of Ringo Starr's temporary replacement by Jimmie Nicol due to Ringo's tonsillitis during the World Tour of 1964."]}, {"page": "Bob Downes", "response": ["His first album was released by Philips Records in 1969. He was voted best jazz flautist and formed various ensembles. He started his own record label, Openinan. He played with the John Barry 7, pop singer Chris Andrews, Manfred Mann's Earth Band, and the Jimmie Nicol Band."]}, {"page": "Jimmie", "response": ["* Jimmie Nicol (born 1939), temporary replacement drummer with The Beatles"]}, {"page": "Johnny Harris (musician)", "response": ["Johnny Harris was born in Edinburgh, Scotland to Welsh parents and was a graduate of the Guildhall School of Music in London. He was originally a trumpet player with the Norman Burns band and big bands led by Vic Lewis, Ken Mackintosh, Cyril Stapleton and then a member of the short-lived beat group The Shubdubs with drummer Jimmie Nicol and organist Roger Coulam. In 1964, he recorded a Beatles cover version album and EP called Beatlemania with Jimmie Nicol which resulted in Nicol replacing the ill Ringo Starr on a worldwide Beatles tour."]}, {"page": "James Nicol (disambiguation)", "response": ["* Jimmie Nicol (born 1939), British drummer and temporary member of the Beatles"]}, {"page": "Georgie Fame and the Blue Flames", "response": ["Reece became ill in 1964 and was replaced by Tommy Frost. Jimmie Nicol spent a brief period as drummer, then left to replace Ringo Starr for 13 days on a Beatles tour. Phil Seamen and Micky Waller sat in for Nicol until Bill Eyden became the band's full-time drummer in September 1964."]}, {"page": "Colin Hicks & The Cabin Boys", "response": ["* Jimmie Nicol – drums – (born James George Nicol, 3 August 1939, Barnes, South West London)"]}, {"page": "The Beatles' 1964 world tour", "response": ["* Note: As Ringo Starr was hospitalized in the UK, Jimmie Nicol was temporarily hired to stand in for Ringo as a drummer for the shows from 4–13 June until Ringo rejoined the group in Melbourne."]}, {"page": "Jim Berkenstadt", "response": ["In 2013, Berkenstadt published the Amazon Best Seller, The Beatle Who Vanished, \"a true account of Jimmie Nicol, an anonymous drummer whose journey from humble beginnings to an improbable climb rescued The Beatles' first world tour from disaster by temporarily stepping in for Ringo Starr.\"Jim Berkenstadt: Music Historian, Archivist, Consultant, Author, and The Rock and Roll Detective, Americana Gazette.Official Website for The Beatle who Vanished a book by Jim Berkenstadt.\"13 Days as a Beatle: The Sad History of Jimmie Nicol\", Ultimate Classic Rock. The Beatle Who Vanished is a part of the permanent Library and Archive Collection at the Rock and Roll Hall of Fame."]}, {"page": "Roger Coulam", "response": ["*The Shubdubs / Jimmy Nicol & The Shubdubs (Jimmie Nicol; Johnny Harris)Jimmy Nicol & The Shubdubs, discogs.com"]}, {"page": "June 1964", "response": ["*The Beatles began their first, and only, world concert tour starting with a performance at the Tivoli Gardens in Copenhagen, and a second concert two days later at a concert hall in the village of Blokker, Netherlands, followed by visits to Hong Kong, Australia and New Zealand.  Because drummer Ringo Starr was hospitalized for acute tonsillitis, Jimmie Nicol took his place for the first eight shows on the tour.Kenneth Womack, The Beatles Encyclopedia: Everything Fab Four (ABC-CLIO, 2016) pp510-511"]}, {"page": "J.W. Hodkinson", "response": ["Hodkinson was born in Leigh, Lancashire, now in Greater Manchester, England. After performing as Johnny Goode, with Larry Parnes' \"The Big New Rock 'n' Trad Spectacular\", and billed as a \"Teenage Idol\" with Billy Raymond, Georgie Fame, Billy Fury and Jimmie Nicol, in 1961, he recorded, as Tony Allen, the first of a series of 45s for Philips, all with arrangements by Ivor Raymonde. In 1966, he sang the theme track for the United Artists spy thriller movie Triple Cross, starring Christopher Plummer and Yul Brynner. In 1964, he joined The Shubdubs with Jimmie Nicol, Bob Garner, Johnny Harris, Quincy Davis, and Roger Coulam."]}, {"page": "List of people who performed on Beatles recordings", "response": ["Jimmie Nicol stood in for Starr for eight performances during the band's 1964 tour. He did not feature on record, but his performances were captured by audience bootlegs and broadcasts by AVRO in the Netherlands and 5DN in Australia."]}, {"page": "Ben Essing", "response": ["His biggest coup was, undoubtedly, engaging The Beatles for two shows on 6 June 1964. As part of their 1964 world tour, which supported the release of A Hard Day's Night, they spent three days in the Netherlands, a stay that included a (playback) concert for television and a boat tour of the Amsterdam canals. For this leg of the world tour Ringo Starr, who had collapsed during a photo shoot, had been replaced by Jimmie Nicol. Essing paid 40,000 guilders for the band to play two shows, of 24 minutes and 8 songs each. The event continues to live on in the local imagination: a Beatles in Blokker monument was raised in 1999, and in 2014 the fiftieth anniversary was celebrated with an exhibition."]}, {"page": "August 1939", "response": ["*Born: Jimmie Nicol, drummer and temporary member of The Beatles, in London, England"]}, {"page": "One Two Three Four: The Beatles in Time", "response": ["Anthony Quinn of The Guardian called the book \"not a biography so much as a group portrait in vignettes, a rearrangement of stories and legends whose trick is to make them gleam anew\", and noted that it \"does an intriguing sideline in characters who were tangential to the Beatles' story\", such as Richard and Margaret Asher (whose daughter Jane was a girlfriend of Beatle Paul McCartney), drummer Jimmie Nicol, and former police constable Eric Clague."]}]}}