{"wiki_id": "http://www.wikidata.org/entity/Q6021526", "itemLabel": "Luke O'Neill", "itemDescription": "English association football player (born 1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Luke_O%27Neill_(footballer)", "wikipedia_page": {"main": "Luke Marcus O'Neill (born 20 August 1991) is an English professional footballer who plays as a right back for EFL League Two club Stevenage. He graduated from the Leicester City youth academy. He has represented England at under-17 level.\n\n", "link_mentions": [{"page": "1991 in association football", "response": ["**Luke O'Neill, English youth international"]}, {"page": "Craig King", "response": ["Born in Chesterfield, Derbyshire, King started his career at Leicester City where he came through their youth academy alongside Joe Mattock, Max Gradel, Andy King (unrelated), and Luke O'Neill, he signed a two-year pro-contract on 2 September 2008."]}, {"page": "2009–10 Leicester City F.C. season", "response": ["|Luke O'Neill", "|Luke O'Neill"]}, {"page": "2010–11 Leicester City F.C. season", "response": ["| Luke O'Neill", "|  Kettering TownLeicester City youngster Luke O'Neill joins Kettering bbc.co.uk, 29 January 2011"]}, {"page": "2008–09 Leicester City F.C. season", "response": ["|Luke O'Neill"]}, {"page": "2011–12 Leicester City F.C. season", "response": ["| Luke O'Neill"]}, {"page": "2011–12 Stockport County F.C. season", "response": ["Stockport started the season with a 1–1 draw away to Forest Green Rovers, in a game which was shown live on Premier Sports, Stockport fell behind to a goal from Reece Styche before Nick Chadwick headed an equiliser for Stockport on seventy-eight minutes. After the game it was announced that Ryan Fraughan was named as part of the Non-League Paper's team of the day. On 16 August Stockport secured their first win of the season beating Kettering Town 1–0 at home, with the goal coming Euan Holden. The scores stayed that way even after Sol Davis was sent off for Kettering. Stockport were denied a second successive home win, as they drew 1–1 at home to Ebbsfleet United four days later, the goal coming from Nick Chadwick with a far post header before Ebbsfleet equalised eight minutes later. After the game it was announced that Euan Holden was named as part of the Non-League Paper's team of the day. On 23 August, Stockport drew their second successive game against Kidderminster Harriers, Stockport's goal coming from Tom Elliot in the first-half, before Kidderminster equalised late on in the second-half. On 26 August, Stockport drew their third consecutive match, drawing 1–1 to Lincoln City, Alan Power opened the scoring for Lincoln before Tom Elliott equilised for Stockport just before half-time. On 29 August Stockport's five match unbeaten run came to an end as they lost their first game of the season 1–0 to Mansfield Town, the goal of the game coming from Luke O'Neill in the second half."]}, {"page": "2012–13 Burnley F.C. season", "response": ["!scope=\"row\"|Luke O'Neill", "|16||DF|| Luke O'Neill || Mansfield Town || Undisclosed ||15 June 2012"]}, {"page": "2013–14 Burnley F.C. season", "response": ["!scope=\"row\"|Luke O'Neill"]}, {"page": "2013–14 York City F.C. season", "response": ["Defender Luke O'Neill was signed from Burnley on a 28-day emergency loan. He made his debut in York's 3–0 win away to Torquay, which was the team's first successive win of the season. York were knocked out of the Football League Trophy in the second round after being beaten 3–0 at home by League One team Rotherham United, before their winning streak in the league was ended with a 3–0 defeat away to Newport County. York drew 2–2 away to Chesterfield, having taken a two-goal lead through O'Neill and Jarvis, before the home team fought back through Armand Gnanduillet and Jay O'Shea. The team then hosted Fleetwood Town, and the visitors won 2–0 with goals scored in each half by Gareth Evans and Jamille Matt. Scunthorpe United were beaten 4–1 at home to end York's three-match run without a win, with all the team's goals coming in the first half from Carson, Fletcher and Brobbel (2).", "|Luke O'Neill", "!scope=row|Luke O'Neill * "]}, {"page": "2014–15 Scunthorpe United F.C. season", "response": ["|24||DF|| Luke O'Neill                                         ||4||0||0||0||0||0||0||0||4||0"]}, {"page": "2014–15 Burnley F.C. season", "response": ["!scope=\"row\"|Luke O'Neill"]}, {"page": "2014–15 Leyton Orient F.C. season", "response": ["|align=\"left\"|26||align=\"left\"|DF||align=\"left\"| Luke O'Neill", "|26 February 2015||DF|| Luke O'Neill||Burnley||28 March 2015||"]}]}}