{"wiki_id": "http://www.wikidata.org/entity/Q6035789", "itemLabel": "Steve Parker", "itemDescription": "British children's science writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Parker_(writer)", "wikipedia_page": {"main": "Steve Parker is a British science writer of children's and adult's books. He has written more than 300 titles and contributed to or edited another 150.", "link_mentions": [{"page": "Ted Dewan", "response": ["Dewan began his career with science-writer Steve Parker on a number of children's non-fiction books. Dewan's pen and ink and watercolor artwork complimented \"Parker's examination of the morphology of the world's largest mammals\" (and also Inside dinosaurs and other prehistoric creatures). For Inside the Whale and Other Animals he won the 1992 Mother Goose Award", "1992, Mother Goose Award, best new illustrator, for Inside the Whale and Other Animals, written by Steve Parker", "1992, shortlisted for the TES information book award for his illustration of Inside the Whale & Other Animals, written by Steve Parker.Faber and Faber's new books catalogue, July - December 2007, page 18. Retrieved 6 February 2008.", "* Inside the Whale and Other Animals (Dorling Kindersley/Doubleday, 1992), written by Dewan and Steve Parker"]}, {"page": "Phạm Xuân Nguyên", "response": ["*2000: Nerves and Senses (Steve Parker)"]}, {"page": "Warrington", "response": ["*Steve Parker (born 1952 in Warrington), writer of children's and adult's science books"]}, {"page": "John Farndon", "response": ["* The Complete Guide to Minerals, Rocks and Fossils of the World, (1 Jun 2009), Co-author with Steve Parker, Lorenz Educational Press, ", "* Discover the Extreme World (2012), Camilla de la Bedoyere, Clive Gifford, John Farndon, Steve Parker, Stewart Ross and Philip Steele, Miles Kelly Publishing, . Sh* Atlas of Oceans, on endangered life in the oceans. Published by Yale University Press in the USA, A & C Black in the UK, Australian Geographic in Australia. Listed by The Globe and Mail (Canada) as a 2011 top ten science book.ortlisted for the Blue Peter Book Award for the 'Best Book with Facts'."]}, {"page": "Steve Parker", "response": ["Steve Parker may refer to:", "* Steve Parker (artist), multi-disciplinary artist", "* Steve Parker (defensive end, born 1956), American football player with the New Orleans Saints", "* Steve Parker (defensive end, born 1959), American football player with the Baltimore/Indianapolis Colts", "* Steve Parker (Neighbours), fictional character from the Australian soap opera Neighbours", "* Steve Parker (writer) (born 1952), British science writer"]}]}}