{"wiki_id": "http://www.wikidata.org/entity/Q604661", "itemLabel": "William Hale White", "itemDescription": "British writer (1831-1913)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hale_White", "wikipedia_page": {"main": "William Hale White (22 December 1831 – 14 March 1913), known by his pseudonym Mark Rutherford, was a British writer and civil servant.  His obituary in The Times stated that the \"employment of a pseudonym, and sometimes of two (for some of 'Mark Rutherford's' work was 'edited by his friend,  Reuben Shapcott'), was sufficient to prove a retiring disposition, and Mr. Hale White was little before the world in person.\"", "link_mentions": [{"page": "William White", "response": ["*William Hale White (1831–1913), English writer and civil servant"]}, {"page": "List of names in A Biographical Dictionary of Modern Rationalists", "response": ["* \"Mark Rutherford\" (William Hale White)", "*William Hale White"]}, {"page": "Ditchling Unitarian Chapel", "response": ["Ditchling Unitarian Chapel (formerly Ditchling General Baptist Chapel, and also known as The Old Meeting House) is a Unitarian chapel in Ditchling, a village in the English county of East Sussex.  A congregation of General Baptists began to meet in the 17th century in the village, which was a local centre for Protestant Nonconformist worship, and by the time the present simple Vernacular-style chapel was constructed in 1740 a large proportion of the population held Baptist beliefs.  Along with other General Baptist chapels in Sussex, the congregation moved towards Unitarian views in the mid-18th century; this caused a schism which resulted in a new chapel being formed at nearby Wivelsfield.  The character of the Ditchling chapel was wholly Unitarian by 1800, and it has continued under various names since then.  People associated with the chapel include William Hale White (the author \"Mark Rutherford\"), Henry Acton, Adrian Boult—who was married there—and G. K. Chesterton.  The chapel is set back from Ditchling's main street and has an adjoining house (built in 1672) and graveyard, all of which contribute to the character of the conservation area which covers the centre of Ditchling village.  English Heritage has listed the chapel at Grade II for its architectural and historical importance.", "The religious character of the chapel has been Unitarian since the 18th century.  At times during its history, it has been referred to as a Unitarian and Free Christian or simply Free Christian chapel.  This means that members do not adopt a particular statement of faith or set of beliefs: the Bible and personal interpretation of it are considered the sole authority for their views.  Services are held on Sunday mornings at 11.00am. The chapel was registered for marriages on 29 December 1837, and people married here include the conductor Sir Adrian Boult in 1933.  The author William Hale White, who used the pseudonym Mark Rutherford, fellow writers John Middleton Murry and G. K. Chesterton, and Reginald Sorensen, Baron Sorensen  had links to the chapel or visited it at various times."]}, {"page": "List of Old Bedford Modernians", "response": ["* William Hale White (1831–1913), author known by his pseudonym Mark Rutherford"]}]}}