{"wiki_id": "http://www.wikidata.org/entity/Q6045129", "itemLabel": "Nort", "itemDescription": "Nort Nort (born 1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nortei_Nortey", "wikipedia_page": {"main": "Nii Nortei Nortey (born 29 October 1994) is an English-Ghanaian professional footballer who plays as a midfielder for Northern Colorado Hailstorm in the USL League One.\nNortey started his career at Chelsea's academy but was released in 2013 and had a spell at Maidenhead United before joining Welling United in August 2015, where he started his senior career. He joined Wrexham ahead of the following season, but made just 6 league appearances before joining Solihull Moors on loan in December 2016, before joining them permanently in January 2017.\nHe signed for Dover Athletic in summer 2017, before being released at the end of the 2018–19 season after 6 goals in 67 league matches. He joined Chorley in September 2019 but left the club after their relegation to the National League North. He signed for Scottish Championship side Queen of the South in October 2020.", "link_mentions": [{"page": "Shane McFaul", "response": ["Shane Charles Alan McFaul (born 23 May 1986 in Dublin) is an Irish professional footballer who currently plays for Northern Colorado Hailstorm FC in USL League One. McFaul has played for over 11 clubs in 5 countries throughout Europe, Asia and North America, including UCD (over two spells), Sporting Fingal & St Patrick's Athletic (over two spells) in Ireland, Notts County & Brighton & Hove Albion in England, FC Haka, KTP, Mikkelin Palloilijat & Sudet in Finland, Virginia Beach Mariners in the United States of America and also DSK Shivajians in India.", "Category:Northern Colorado Hailstorm FC players"]}, {"page": "Michael Bakare", "response": ["On 22 June 2016, he joined Wrexham, along with his Welling teammate Nortei Nortey, on a 1-year deal. He made his debut for the club on the opening day of the 2016–17 season, in a 0–0 draw with Dover Athletic.", "On 16 February 2021, Bakare joined National League North side Hereford on a short-term deal."]}, {"page": "Giancarlo Gallifuoco", "response": ["In July 2017 Gallifuoco moved to rival National League side Dover Athletic on a one-season deal. He made his debut in a 1–0 away victory to Hartlepool United on 5 August 2017. He scored his first goal in a 2–0 away victory over Aldershot Town meeting a near-post cross from Nortei Nortey following a short-corner, diverting his header into the far-bottom corner."]}, {"page": "Paul Lewis (footballer)", "response": ["Paul James Lewis (born 17 December 1994) is an English footballer who plays as a central midfielder for League Two club Northampton Town.", "On 22 September 2017, Lewis joined Dover Athletic on loan going straight into the available squad for the following day's away fixture to Guiseley. He did come on for Dover against Guiseley replacing goalscorer Nortei Nortey in a game that finished 1–1. He made his first start for the club the following week against Solihull Moors; setting up a late winner for Ryan Bird. The 1–0 victory sent Dover to the top of the league ", "|Northampton Town", "Category:Northampton Town F.C. players"]}, {"page": "Irvin Parra", "response": ["Irvin Raúl Parra (born August 18, 1993) is an American professional soccer player who currently plays as a forward for Northern Colorado Hailstorm in USL League One..Profile at WorldFootball, worldfootball.net", "===Northern Colorado Hailstorm===", "On January 13, 2022, Parra joined USL League One expansion side Northern Colorado Hailstorm FC."]}, {"page": "Ethan Vanacore-Decker", "response": ["Ethan Vanacore-Decker (born October 6, 1994) is an American professional soccer player who currently plays for Northern Colorado Hailstorm FC in USL League One.", "Vanacore-Decker initially committed to beginning his college soccer career at University of North Carolina at Chapel Hill, before changing to the University of Connecticut, where he played for two years. Vanacore-Decker transferred to the University of Louisville in 2015. He again moved college's in 2016, opting to attend Rutgers University. He was ineligible for their 2016 season due to NCAA transfer rules.", "While at college, Vanacore-Decker played with USL PDL side New York Red Bulls U-23 in 2015, and South Florida Surf in 2016 and 2017. Following college, Vanacore-Decker remained playing in the PDL with North County United.", "Vanacore-Decker joined USL League One expansion club Northern Colorado Hailstorm on January 28, 2022.", "Category:Northern Colorado Hailstorm FC players"]}, {"page": "Thomas Olsen (soccer)", "response": ["Thomas Olsen (born February 14, 1995) is an American soccer player who currently plays for Northern Colorado Hailstorm in USL League One.", "Olsen signed with USL League One expansion club Northern Colorado Hailstorm on January 20, 2022.", "Category:Northern Colorado Hailstorm FC players"]}, {"page": "Brecc Evans", "response": ["Brecc Evans (born September 6, 1999) is an American soccer player who plays as a defender for USL League One side Northern Colorado Hailstorm.", "In February 2019, Evans signed a two-year deal with North Texas SC ahead of their inaugural season after just one year at Cal Poly. Preceding the inaugural USL League One season, Evans was named captain of the young North Texas SC squad. He made his league debut for the club on March 30, 2019, playing all ninety minutes of a 3-2 home victory over the Chattanooga Red Wolves. In total, Evans made 22 appearances for North Texas SC, leading the team to a regular season championship and the first seed in the USL League One playoffs.", "On November 30, 2020, Evans was released by North Texas.", "On January 6, 2022, Evans became the fourth-ever player announced by USL League One expansion team Northern Colorado Hailstorm FC.", "Category:North Texas SC players", "Category:Northern Colorado Hailstorm FC players"]}, {"page": "Leo Folla", "response": ["Leo Folla (born March 2, 1995) is an American soccer player who currently plays for Northern Colorado Hailstorm in USL League One.", "Following the 2014 season, Folla transferred to St. Francis College Brooklyn in 2015 and played 3 years with the Terriers winning two Northeast Conference regular seasons and conference championships in 2016 and 2017 respectively.", "Folla made the move to USL League One club Northern Colorado Hailstorm ahead of their inaugural season.", "Category:Northern Colorado Hailstorm FC players"]}, {"page": "2020–21 Queen of the South F.C. season", "response": ["|=|| ||Nortei Nortey", "| Nortei Nortey"]}, {"page": "2020–21 Inverness Caledonian Thistle F.C. season", "response": ["=== North of Scotland Cup ===", "The North of Scotland Cup was cancelled."]}, {"page": "List of Scottish football transfers summer 2020", "response": ["|Preston North End"]}, {"page": "Lachlan McLean (footballer)", "response": ["Lachlan McLean (born 28 March 1996) is an Australian soccer player who plays as a forward for Northern Colorado Hailstorm in USL League One.", "===Northern Colorado Hailstorm===", "On 17 December 2021, it was announced that McLean would join USL League One side Northern Colorado Hailstorm ahead of their inaugural season.https://www.uslleagueone.com/news_article/show/1199375", "Category:Northern Colorado Hailstorm FC players"]}, {"page": "Mark Hernández", "response": ["Mark \"Marky\" Hernández (born 7 August 1996) is an American soccer player who plays as a midfielder for Northern Colorado Hailstorm FC in USL League One.", "On 11 January 2022, Hernández signed with League One expansion club Northern Colorado Hailstorm FC.", "Category:Northern Colorado Hailstorm FC players"]}, {"page": "Northern Colorado Hailstorm FC", "response": ["Northern Colorado Hailstorm FC is a planned USL League One expansion team that is expected to begin play in 2022. They will play at the Future Legends Complex in Windsor, Colorado. The team is owned by the Katofsky family and the Future Legends ownership group.", "Northern Colorado FC will play their home games at Future Legends Complex, a 118-acre multi-sport complex expected to open in 2022.  The complex is expected to have 10 baseball fields and 12 soccer pitches.  Northern Colorado will share the complex with minor-league baseball team Northern Colorado Owlz."]}, {"page": "2021–22 Queen of the South F.C. season", "response": ["| Nortei Nortey"]}]}}