{"wiki_id": "http://www.wikidata.org/entity/Q6054159", "itemLabel": "John Porter", "itemDescription": "English musician and record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Porter_(musician)", "wikipedia_page": {"main": "John Porter (born 11 September 1947, in Leeds, England) is an English musician and record producer.", "link_mentions": [{"page": "Roxy Music", "response": ["The next album, For Your Pleasure, was released in March 1973. It marked the beginning of the band's long, successful collaboration with producer Chris Thomas, who worked on all of the group's classic albums and singles in the 1970s. The album was promoted with the non-album single \"Pyjamarama\"; no album track was released as a single. At the time Ferry was dating French model Amanda Lear; she was photographed with a black jaguar for the front cover of the album, while Ferry appears on the back cover as a dapper chauffeur standing in front of a limousine. John Porter (credited as a guest) played bass on the record, while Sal Maida played bass for subsequent live shows.Stump, Paul – Unknown Pleasures: A Cultural biography of Roxy Music, Thunder's Mouth Press, New York, 1998, p. 72", "*John Porter – bass (1972-1973)", "  bar:Porter text:\"John Porter\""]}, {"page": "The Smiths", "response": ["Travis travelled to Manchester to meet the band at their Crazy Face rehearsal space and sign a record contract with Rough Trade. Morrissey and Marr signed it on behalf of the band, and there was no discussion of how earnings would be divided. Travis brought in Troy Tate of the Teardrop Explodes, and under his supervision the band recorded their first album, at the Elephant Studios in Wapping, East London. Rough Trade were unhappy with the album and Tate's production, insisting the band rerecord it with a new producer, John Porter. The singles \"This Charming Man\" and \"What Difference Does It Make?\" reached numbers 25 and 12 on the UK Singles Chart. Aided by praise from the music press and a series of studio sessions for Peel and David Jensen at BBC Radio 1, the Smiths began to build a dedicated fanbase."]}, {"page": "Bryan Ferry", "response": ["As a child he had a job as a paperboy. He studied fine art at Newcastle University from 1964 until 1968, under Richard Hamilton for one year, and some of his paintings were displayed at the Tate Gallery in 1970. His contemporaries included Tim Head and Nick de Ville. During this period, Ferry was a member of the bands The Banshees,https://www.thenorthernecho.co.uk/opinion/leader/1782321.life-bryan/ City Blues, and The Gas Board, the latter of which featured Graham Simpson and John Porter. He then moved to London in 1968 and taught art and pottery at Holland Park School while pursuing a career in music."]}, {"page": "Dexys Midnight Runners", "response": ["Although Dexys began preparing material for a new album in late 1983, once the touring stopped, the band was reduced to a nucleus of Rowland, Adams, O'Hara and Gatfield.  Recording and mixing the new album took almost two years and spread across Switzerland, the U.K., and the U.S; at various times, Tom Dowd, Jimmy Miller, and John Porter were attached as producers.  Some seasoned performers, ex-Dexys members, and session musicians made up the rest of the band, including Vincent Crane (ex-Atomic Rooster) on piano, Julian Littman on mandolin, Tim Dancy (who had been Al Green's drummer) on drums, Tommy Evans on steel guitar, and former Dexys members \"Big\" Jim Paterson on trombone, Robert Noble on organ and synthesizer, and John \"Rhino\" Edwards on bass. Near the end of these sessions, Rowland and O'Hara's personal relationship broke up, although they continued to work together."]}, {"page": "John Taylor (bass guitarist)", "response": ["Taylor played guitar when Duran Duran was founded, but switched to bass guitar after discovering the funky rhythms of Chic, and learned to enjoy playing in the rhythm section with Duran's newly recruited drummer Roger Taylor. He has frequently cited Chic's Bernard Edwards and The Clash's Paul Simonon as his strongest influences, in addition to Paul McCartney, James Jamerson, and Roxy Music players Graham Simpson and John Porter. Duran Duran released their first album in 1981, and went on to worldwide success in the early 1980s."]}, {"page": "The Queen Is Dead", "response": ["\"Frankly, Mr. Shankly\" was an attempt to recreate the \"vibe\" of Sandie Shaw's \"Puppet on a String\", although \"it didn't quite work out that way\", according to Marr. Linda McCartney was asked to play piano on the track, but declined, and a first take featuring a trumpeter was scrapped. The version originally intended for inclusion on The Queen Is Dead was ruined by a technical glitch on the tape, and so the song was re-recorded with John Porter at Wessex Studios in London.", "* John Porter – engineering "]}, {"page": "Grammy Award for Record of the Year", "response": ["| John Porter, producer; Steve Chadie & John Porter, engineers/mixers"]}, {"page": "Talking with the Taxman About Poetry", "response": ["Talking with the Taxman About Poetry is the third album by Billy Bragg, released in September 1986. With production by John Porter and Kenny Jones, Talking with the Taxman About Poetry featured more musicians than Bragg's previous works, which were generally little more than Bragg himself and a guitar.", "*John Porter – guitar, mandolin, bass guitar, slide guitar", "*John Porter – producer", "Category:Albums produced by John Porter (musician)"]}, {"page": "The La's", "response": ["The La's then spent two years fruitlessly recording and re-recording their intended debut album, with a constantly changing band line-up, where only the core of Mavers and Power remained the same. Discarded producers included The Smiths' producer John Porter, as well as John Leckie and Mike Hedges. Both Leckie and Hedges in interviews have been very complimentary about the band's songs and their respective sessions. The previously volatile band line-up settled in 1989 with Lee's brother, Neil Mavers on drums, and Peter \"Cammy\" Cammell as lead guitarist. The group then entered London's Eden Studios in December 1989 to again record their debut album with Simple Minds and U2 producer Steve Lillywhite. Despite this line-up being arguably the most stable, and press interviews from the time painting them as extremely confident, the sessions still did not satisfy Mavers. In one instance Mavers was reported to have rejected a vintage mixing desk, claiming it did not have the right sound because \"it hasn't got original Sixties dust on it\",Steve Jelbert, \"Pop: The One and Only\" The Independent (London: 26 January 2001, p. 16) although this claim has since been revealed as apocryphal. The Eden sessions with Lillywhite would become the band's final attempt at recording the album. The frustration of not achieving the right sound and mood in their songs, as well as increasing friction with Go! Discs, who had spent a considerable sum of money on recording sessions for the album, led to them simply giving up on the sessions. Lillywhite pieced together the recordings he had made with the group into what became the eventually released album. The band, particularly Lee Mavers, were not pleased with this decision. Among the band's complaints were that Lillywhite used vocal guide tracks on the LP and that he did not \"understand\" their sound. In an October 1990 NME interview with Stuart Maconie, Mavers said that he \"hated\" the album because of the sound, which was \"All f---ed up like a snake with a broken back\"."]}, {"page": "Hatful of Hollow", "response": ["* John Porter – electronic percussionFletcher, T, 2012. A Light That Never Goes Out: The Enduring Saga of the Smiths. 1st ed. U.K.: Random House. p. 355. on \"How Soon Is Now?\"", "* John Porter – producer"]}, {"page": "Jim Verraros", "response": ["In November 2006, it was reported that Verraros was living in East Dundee, Illinois with his long-time boyfriend. It was also reported at this time that Verraros' second album would be released in 2007. In a December 2006 interview with gay-interest website Atlantaboy.com, Verraros said that Rollercoaster had been \"pretty much all over the place\" and that his next album would be \"more focused\", while in April 2007, the Daily Herald wrote that a follow-up to Rollercoaster was scheduled to be released that May.  Verraros had also told Atlantaboy.com that he was \"heading more toward the film thing\" and that if he ever released a music video, he would hope to co-direct it. Around this time, he mentioned that he had been cast in three films; one was described as a dark LA-based romance, in which he would play a cocaine addict who falls in love with a struggling actor, another, referred to by the title Copacabana: Of Love and Shadows, was described as a Rio de Janeiro-based musical, in which Verraros would play both male and female roles; and the third, referred to by the title Pizza on Sunset, was described as a gay LA-based romantic comedy. By July 2007, Verraros still had not released his second album. It was announced over the summer that he was \"writing and recording [the album] in Malibu, California\" with producers Gary Miller and John Porter. On a July podcast for the Windy City Times, Verraros said that he was aiming for a January 2008 release."]}, {"page": "The Cat Empire", "response": ["The Cat Empire released their fourth album, So Many Nights in Australia on 22 September 2007, it was produced by John Porter and reached number two. The lead single, \"No Longer There\", was issued two weeks earlier and peaked at number 12. \"So Many Nights\" was listed at number 50 on the Triple J Hottest 100 for 2007, while \"No Longer There\" finished at number 62."]}, {"page": "The Smiths (album)", "response": ["The Smiths is the self-titled debut studio album by English rock band the Smiths, released on 20 February 1984 by Rough Trade Records. After the original production by Troy Tate was felt to be inadequate, John Porter re-recorded the album in London, Manchester and Stockport during breaks in the band's UK tour during September 1983.", "While recording a BBC session for Dave Jensen in August 1983, The Smiths met producer John Porter, who was working in one of the studios. Travis, harbouring reservations about the group's session with Troy Tate, gave Porter a cassette of the sessions beforehand in the hopes that he could remix them. Porter told Travis that the sessions were \"out of tune and out of time\". Feeling the Tate sessions were unsalvageable, Porter offered to re-record the album himself. Despite praising the work with Tate, only a week prior, to the press by stating \"we've done everything exactly right and it'll show\", Smiths singer Morrissey accepted (as did Travis), while Marr hesitantly agreed. Marr would later claim in his autobiography that when the band heard the finished work done under Tate, Morrissey didn't like the album and the others weren't entirely happy with the results either. \"I could hear myself that the mixes sounded underproduced and were not the finished article that we needed as our introduction to the world,\" Marr wrote. \"Why it was deemed necessary to scrap the album entirely rather than just mix it again I didn't know, but I wasn't going to make too much of it...it was a document of how the band really were at that point though...\".", "Slant Magazine listed the album at 51 on its list of \"Best Albums of the 1980s\" saying \"There's no reason why a mordant, sexually frustrated disciple of Oscar Wilde who loved punk but crooned like a malfunctioning Sinatra should've teamed up with a fabulously inventive guitarist whose influences were so diffuse that it could be hard to hear them at all and formed one of the greatest songwriting duos of the '80s.\"The 100 Best Albums of the 1980s  PopMatters included the album on their list of \"12 Essential Alternative Rock Albums from the 1980s\" saying: \"Morrissey's career are fully accounted for on The Smiths, where they are rendered all the more piercing by Johnny Marr's delicate guitar-picking and John Porter's stark production\".", "* John Porter – production , remixing ", "Category:Albums produced by John Porter (musician)"]}, {"page": "Miracle Legion", "response": ["With the departure of drummer Wiederschall and bassist West in 1988, Mulcahy and Neal continued Miracle Legion as a duo, touring as the opening act for The Sugarcubes. Their 1989 release of Me and Mr. Ray, recorded at Prince's Paisley Park Studios, reflected the band's new direction with its stripped-down instrumentation. The album yielded a single, \"You're the One Lee\", the video for which received modest rotation on MTV's 120 Minutes alternative music show. That year, the band found a new rhythm section, drummer Scott Boutier and bassist Dave McCaffrey, and signed with the now-defunct label Morgan Creek Records, which funded their 1992 album Drenched produced by John Porter (of Roxy Music and The Smiths fame).  The band had a limited national tour that year in support of the new album, mostly playing clubs and other small venues. The song \"So Good\" off of Drenched was featured in the 1993 film The Crush."]}, {"page": "R. L. Burnside", "response": ["In short time, however, Burnside was in declining health. He had an ear infection and underwent a heart surgery in 1999. As his tours decreased to a minimum, Wish I Was In Heaven Sitting Down (2000) was released, which relegated guitar work to other players (Rick Holmstrom, Smokey Hormel, John Porter) but used Burnside's vocals. After a heart attack in 2001, his doctor advised him to stop drinking; Burnside did, but he reported that change left him unable to play. Fat Possum rebounded with A Bothered Mind (2004), an album that used previously recorded guitar tracks, and included collaborations with Kid Rock and Lyrics Born."]}, {"page": "Must I Paint You a Picture? The Essential Billy Bragg", "response": ["Category:Albums produced by John Porter (musician)"]}, {"page": "John Porter", "response": ["John Porter may refer to:", "*John Porter (portreeve), 1390–94, Member of Parliament (MP) for Taunton", "*John Porter (Illinois politician) (born 1935), Illinois politician, U.S. Representative", "*John Porter (MP for Bramber) (died 1599), MP for Bramber", "*John Porter (MP for Maldon) (died 1660), English lawyer and politician who sat in the House of Commons in 1640", "*John Porter (New York politician) (1790–1874), New York politician", "*John Porter (Pennsylvania politician) (fl. 1810s), Pennsylvania politician, U.S. Representative", "*John Porter (horseman) (1838–1922), trainer in British Thoroughbred flat racing ", "*John Porter (ice hockey) (1904–1997), ice hockey player", "*John Porter (footballer, born 1961), Scottish footballer", "*John Porter (footballer, born 1886) (1886–?), English footballer", "*John Porter (British-Polish musician) (born 1950), partner of Anita Lipnicka", "*John Porter (musician) (born 1947), British guitarist, bassist, and producer", "*John Porter (settler) (c. 1605–after 1674), founding settler of Portsmouth, Rhode Island", "*John Porter (bishop) (died 1819), Anglican bishop in Ireland", "*John Porter (Archdeacon of Llandaff), Archdeacon of Llandaff in the 1790s", "*John Porter (sociologist) (1921–1979), Canadian sociologist", "*John Porter Stakes, British flat horse race, named for the trainer ", "*John Porter-Porter (1855–1939), Northern Irish politician"]}, {"page": "School of Fish (album)", "response": ["*Produced by John Porter "]}, {"page": "The World Won't Listen", "response": ["* John Porter – sound effects on \"Ask\",Goddard, S, 2013. Songs That Saved Your Life - The Art of The Smiths 1982-87. 2nd ed. U.K.: Titan Books. P. 222. drum machine and bass on \"Golden Lights\"Goddard, S, 2009. Mozipedia: The Encyclopaedia of Morrissey and the Smiths. 1st ed. India: Ebury Press. P. 149.", "* John Porter – producer (tracks 1–2, 9, 16, 18)", "Category:Albums produced by John Porter (musician)"]}, {"page": "Louder Than Bombs", "response": ["* John Porter – slide guitar on \"Sheila Take a Bow\", sound effects on \"Ask\",Goddard, S, 2013. Songs That Saved Your Life - The Art of The Smiths 1982–87. 2nd ed. U.K.: Titan Books. P. 222. drum machine and bass guitar on \"Golden Lights\"Goddard, S, 2009. Mozipedia: The Encyclopaedia of Morrissey and the Smiths. 1st ed. India: Ebury Press. P. 149.", "* John Porter – producer (A1, A4, B1–2, B4–6, C1-2, C4, C6, D3)"]}, {"page": "Best... I", "response": ["* John Porter – slide guitar on \"Sheila Take a Bow\"", "* John Porter – producer (A1-A3, B1, B6-B7)", "Category:Albums produced by John Porter (musician)"]}, {"page": "...Best II", "response": ["* John Porter – producer (A2, A5-A6, B2-B3)"]}, {"page": "Singles (The Smiths album)", "response": ["* John Porter – slide guitar on \"Sheila Take a Bow\""]}, {"page": "The Very Best of The Smiths", "response": ["* John Porter – slide guitar on \"Sheila Take a Bow\"", "* John Porter – producer (1, 3–4, 6–9, 14, 19), remixer (12)", "Category:Albums produced by John Porter (musician)"]}, {"page": "Crash Vegas", "response": ["Crash Vegas signed a new deal with London/Polygram in 1992. Darren Watson replaced Lanois for the band's second album, Stone, which also included contributions from John Porter and Butch Vig. Recorded in Los Angeles, the album was more energetic than Red Earth, though it also had a \"bleakness\" resulting from the dissolution of McAdorey's romantic relationship with Keelor."]}, {"page": "Down to Earth (Ozzy Osbourne album)", "response": ["*John Porter – Pro Tools engineering"]}, {"page": "Tommy Castro", "response": ["In 2009, Castro joined the roster of Chicago's Alligator Records with his release Hard Believer, produced by John Porter. The album was described by Billboard as \"irresistibly funky…it has a street-level grit and a soulful sincerity that's impossible to ignore.\"Mills, Fred. Billboard, Review of Hard Believer, August 11, 2009  Blues Revue said Hard Believer is  \"a fine set of roadhouse-rockin' blues.\".Nager, Larry. Blues Revue, October 2009 Blurt says, \"Hard Believer might just be the best yet from this veteran Bay Area blues artist.\""]}, {"page": "47th Annual Grammy Awards", "response": ["** John Porter, producer; Steve Chadie & John Porter, engineers/mixers"]}, {"page": "Señor Blues (Taj Mahal album)", "response": ["Category:Albums produced by John Porter (musician)"]}, {"page": "For Your Pleasure", "response": ["* John Porter – bass guitar"]}, {"page": "Reaching to the Converted", "response": ["*John Porter - mandolin", "Category:Albums produced by John Porter (musician)"]}, {"page": "Los Lonely Boys (album)", "response": ["* John Porter - acoustic guitar (\"More Than Love\", \"Velvet Sky\", \"La Contestación\")"]}, {"page": "The La's (album)", "response": ["All of the songs on The La's were written by Lee Mavers between 1986 and 1987 and after signing to Go! Discs in 1987 and for the next three years, the La's worked with several producers to record their debut album, including John Porter, Gavin MacKillop, John Leckie, Bob Andrews, Jeremy Allom and Mike Hedges. The final sessions for the album were recorded December 1989 – February 1990 at Eden Studios in London with producers Steve Lillywhite and Mark Wallis. \"There She Goes\" is a remixed version of the original single recording produced by Bob Andrews in 1988. The La's first single song, Way Out, was re-recorded for the album.", "In July 1987, Matrix studio, London, John Porter produced \"Doledrum\", \"Son of a Gun\", \"Failure\" and \"Jams\". \"Doledrum\" appears on the deluxe edition.", "* John Porter – producer (disc two: track 14)"]}, {"page": "Stop Me", "response": ["* John Porter – slide guitar on \"Sheila Take a Bow\""]}, {"page": "Panic (The Smiths song)", "response": ["The then five-piece band worked with producer John Porter; this was his first work with the group in two years. He was concerned that the song was too short, so he copied the band's first take from 5 May and spliced a repetition of the first verse at the end to increase its length. The group was unimpressed and opted to leave the song as they originally structured it."]}, {"page": "The Sound of White", "response": ["The Sound of White is the debut studio album by Australian pop singer-songwriter Missy Higgins, released 6 September 2004 by Eleven. It won the 2005 ARIA Music Award for Best Female Artist. Higgins had secured recording contracts with Eleven and Warner Bros. while still in high school, after winning a competition for unsigned artists run by radio station Triple J. Her winning song, \"All For Believing\", is included on this album. After a backpacking trip in 2002, Higgins toured and wrote songs during 2003. She wrote most tracks alone and collaborated on three songs, with Kevin Griffin, Jay Clifford and Clif Magness respectively. The Sound of White was recorded in 2004 with producer John Porter.", "In November, Higgins released a self-titled extended play (EP) which contained four songs including \"All for Believing\" and \"Greed for Your Love\", the song she had written in Europe. In 2004 she travelled to the US to work with British musician and record producer John Porter and engineer and mixer Jay Newland. Porter assembled a group of session musicians for the album, including drummer Michael Barker, bassist John Patitucci and cellist Martin Tillman.", "*John Porter – acoustic guitar, mandolin, electric guitar, keyboards, 12 string acoustic guitar", "*John Porter – producer, engineer, audio production"]}, {"page": "Scar (song)", "response": ["* John Porter – production"]}, {"page": "Don't Stand Me Down", "response": ["* John Porter — mixing on \"Kevin Rowland's 13th Time\""]}, {"page": "Perverted by Language", "response": ["* John Porter – production on Peel Sessions"]}, {"page": "In Search of Eddie Riff", "response": ["*John Porter -  guitar, acoustic guitar, bass guitar on \"The Hour Before Dawn\" and \"A Four Legged Friend\""]}, {"page": "Love Is Hell (Ryan Adams album)", "response": ["In separate reviews of Love Is Hell pt. 1 and Pt. 2, Stephen Thomas Erlewine of AllMusic gave both EPs 3.5 stars out of 5, while his review of the full album shows a rating of 4 stars out of 5. Referring to Adams as \"a synthesist more than a stylist\", he compared various songs from the album to multiple rock singer-songwriters and bands such as Jeff Buckley, Bob Dylan, Leonard Cohen, and The Smiths, noting that Love Is Hell coproducer John Porter had worked with the latter. However, while he deemed them both as \"tribute albums\", Erlewine called Love Is Hell \"more carefully considered in its production and writing\" than Rock n Roll. In a joint review of Rock n Roll and both Love Is Hell EPs, Matt Dentler of The Austin Chronicle rated Pt. 1 3.5 stars and Pt. 2 3 stars out of 5. He wrote  that Love Is Hell is \"far more dense and dark\" and \"spotty\" than Rock n Roll, but called the songs \"a fun challenge to crack open\" and highlighted \"Political Scientist\" for its \"delicate melodies\" as well as Adams's cover of \"Wonderwall\", which Dentler called \"surprisingly smart\"."]}, {"page": "Let's Stick Together", "response": ["Various Roxy Music members were involved in the recordings, including Paul Thompson on drums, Eddie Jobson on violin and synthesizer, John Gustafson and John Porter on bass, and Phil Manzanera and David O'List on guitar. Although Ferry's fiancée Jerry Hall made an appearance in tiger skin costume, complete with tail, on the title track's video clip, the song's yelps were performed by an unnamed member of the backing chorus.", "* John Porter – bass (5)"]}, {"page": "This Charming Man", "response": ["Both studio versions begin with an introductory guitar riff, joined by the rhythm section. Morrissey's vocals are first heard eight seconds into the track. His vocal melodies are diatonic, and consciously avoid blues inflections. The chorus is played twice; the first time it is followed by a brief pause, the second by the closing of the song. The rhythm section of Andy Rourke and Mike Joyce provide a beat more danceable than usual for a Smiths track. The drums were originally programmed on a Linn LM-1, under the direction of producer John Porter. Porter used the programme to trigger the sampled sounds of the live drum kit, featuring a Motownesque bassline. Marr's guitar part consists of single notes and thirds as opposed to strummed barre chords, and his guitar serves to creates a counter-melody throughout the song. Marr overdubbed numerous guitar parts onto the song, and in a December 1993 interview, told Guitar Player magazine:"]}, {"page": "These Foolish Things (album)", "response": ["* John Porter – guitars, bass", "* John Porter – producer", "Category:Albums produced by John Porter (musician)"]}, {"page": "The Ocean Blue", "response": ["The Ocean Blue's members were still in high school when they signed a three-album deal in 1988 with Sire Records, at the behest of Sire founder Seymour Stein. Their self-titled debut album was recorded in London with producers John Porter and Mark Opitz."]}]}}