{"wiki_id": "http://www.wikidata.org/entity/Q6069223", "itemLabel": "Irene Rooke", "itemDescription": "British actress (1878-1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Irene_Rooke", "wikipedia_page": {"main": "Irene Rooke (born Irene Bessie Ingaretha Rooke; 30 May 1874 – 14 June 1958) was an English theatre and film actress from Bridport, Dorset, England.\n\n", "link_mentions": [{"page": "Chesham", "response": ["*Irene Rooke, theatre and film actress, married to Milton Rosmer and lived the latter period of her life until her death in 1958 in the town."]}, {"page": "Quality Street (play)", "response": ["*Miss Fanny Willoughby – Irene Rooke"]}, {"page": "High Treason (1929 British film)", "response": ["High Treason is a 1929 film based on a play by Noel Pemberton Billing. It was directed by Maurice Elvey, and stars James Carew, Humberstone Wright, Benita Hume, Henry Vibart, Hayford Hobbs, Irene Rooke, and Jameson Thomas. Raymond Massey makes his first screen appearance in a small role. The sound film was presented in a London trade show on 9 August 1929,Ernest Marshall, \"LONDON FILM NOTES; The Pros and Cons of Two British Talking Films Recently Presented Britain vs. America. 'High Treason' Fantastic and Far-Fetched. Worthy Acoustic Qualities\", The New York Times, 25 August 1929. then went into UK general release in silent and sound versions on 9 September 1929. The sound version was released in the US by Tiffany Productions in a heavily-cut version (running just over 60 minutes) on 13 March 1930. The silent version and a trailer for the sound version are preserved and held by the British Film Institute; the only known surviving original copy of the sound version is a lavender fine grain of the American release version held in the collection of Alaska Moving Image Preservation Association (AMIPA), which has been recently restored by the Library of Congress.", "*Irene Rooke as Senator"]}, {"page": "Rooke", "response": ["* Irene Rooke (1878-1958), English actress"]}, {"page": "The Fruitful Vine", "response": ["The Fruitful Vine is a 1921 British silent drama film directed by Maurice Elvey and starring Basil Rathbone, Valia and Irene Rooke. From the silent era, probably the most notable thing about the film was an early appearance of British actor Rathbone, who was later to become famous for his portrayal of Sherlock Holmes. It is an adaptation of the 1911 novel The Fruitful Vine by Robert Hichens.Goble p.222", "* Irene Rooke as Lady Sarah Ides"]}, {"page": "The Rosary (1931 film)", "response": ["The Rosary is a 1931 British drama film directed by Guy Newall and starring Margot Grahame, Elizabeth Allan, Walter Piers, Robert Holmes and Irene Rooke.  A woman takes the blame for a murder accidentally committed by her half-sister.BFI.org"]}, {"page": "Hindle Wakes (1927 film)", "response": ["* Irene Rooke as Mrs. Jeffcote"]}, {"page": "Lady Windermere's Fan (1916 film)", "response": ["* Irene Rooke - Mrs Erlynne"]}, {"page": "The Pointing Finger (1922 film)", "response": ["* Irene Rooke - Lady Anne Silchester "]}, {"page": "Pillars of Society (1920 film)", "response": ["* Irene Rooke - Martha Karsten"]}, {"page": "A Romance of Wastdale", "response": ["* Irene Rooke - Mrs Jackson"]}, {"page": "The Loves of Mary, Queen of Scots", "response": ["* Irene Rooke as Catherine de' Medici"]}, {"page": "A Bachelor Husband", "response": ["* Irene Rooke as Aunt Madge "]}, {"page": "The Street of Adventure (film)", "response": ["The Street of Adventure is a 1921 British silent drama film directed by Kenelm Foss and starring Lionelle Howard, Margot Drake and Irene Rooke.Low p.459 It was based on the 1919 novel of the same title by Philip Gibbs. The title is a reference to Fleet Street in London.", "* Irene Rooke as Margaret Hubbard  "]}, {"page": "Half a Truth", "response": ["* Irene Rooke as Octavia Madison  "]}, {"page": "Running Water (film)", "response": ["* Irene Rooke as Mrs. Thesiger  "]}, {"page": "The Silver Box", "response": ["thumb|upright|Irene Rooke in 1913: she played Mrs. Jones in the original production.", "* Mrs. Jones – Irene Rooke"]}, {"page": "Collision (1932 film)", "response": ["* Irene Rooke  as Mrs. Maynard  "]}, {"page": "Westward Ho! (1919 film)", "response": ["Westward Ho! is a 1919 British silent historical adventure film directed by Percy Nash and starring Renee Kelly, Charles Quatermaine and Irene Rooke.Goble p.260 It is an adaptation of the 1855 novel Westward Ho! by Charles Kingsley, set during the Spanish Armada (1588).", "* Irene Rooke as Mistress Leigh "]}, {"page": "The Eldest Son", "response": ["Although first written in 1909, it was until three years later that a version was produced. It ran for 47 performances at the Kingsway Theatre in London's West End between 23 November 1912 and 10 January 1913. The cast included Robert Rendel, Claude King, Moffat Johnston, Irene Rooke and Cathleen Nesbitt.Wearing p.292"]}, {"page": "The Truth About Blayds", "response": ["| Irene Rooke"]}]}}