{"wiki_id": "http://www.wikidata.org/entity/Q6076007", "itemLabel": "Isaac Baker Brown", "itemDescription": "English gynaecologist and obstetric surgeon", "wikipedia_url": "https://en.wikipedia.org/wiki/Isaac_Baker_Brown", "wikipedia_page": {"main": "Isaac Baker Brown (1811 – 3 February 1873) was a prominent 19th-century English gynaecologist and obstetrical surgeon. He had a reputation as a specialist in the diseases of women and advocated certain surgical procedures, including  clitoridectomies, as cures for epilepsy and hysteria. His career  ended when he was accused of performing these procedures without consent of the patients. He was subsequently expelled from the Obstetrical Society of London.", "link_mentions": [{"page": "Clitoridectomy", "response": ["In the seventeenth century, anatomists remained divided on whether a clitoris was a normal female organ, with some arguing that only intersex people had one and that, if large enough to be visible, it should always be removed at birth.Alison M. Moore, Victorian Medicine Was Not Responsible for Repressing the Clitoris: Rethinking Homology in the Long History of Women’s Genital Anatomy. Signs: The Journal of Women in Culture and Society 44 (1) August 2018, 53-81. DOI: 10.1086/698277. In the 19th century, a clitoridectomy was thought by some to curb female masturbation. Isaac Baker Brown (1812–1873), an English gynaecologist who was president of the Medical Society of London  believed that the \"unnatural irritation\" of the clitoris caused epilepsy, hysteria, and mania, and he worked \"to remove [it] whenever he had the opportunity of doing so\", according to his obituary in the Medical Times and Gazette. Peter Lewis Allen writes that Brown's views caused outrage, and he died penniless after being expelled from the Obstetrical Society.Allen, Peter Lewis. The Wages of Sin: Sex and Disease, Past and Present. University of Chicago Press, 2000, p. 106.", "* For the obituary, see J.F.C. \"Isaac Baker Brown, F.R.C.S.\", Medical Times and Gazette, 8 February 1873."]}, {"page": "Emil Theodor Kocher", "response": ["In spring 1865, Kocher followed his teacher Biermer to Zürich, where Theodor Billroth was director of the hospital and influenced Kocher significantly. Kocher then proceeded to start a journey through Europe to meet several of the most famous surgeons of the time. It is not clear how Kocher financed his trip but according to Bonjour (1981) he received money from an unknown female Suisse romande philanthropist who also supported his friend Marc Dufour and was probably a member of the Moravian Church. In October 1865, he traveled to Berlin, passing through Leipzig and visiting an old friend from high school, Hans Blum. In Berlin, he studied under Bernhard von Langenbeck and applied for an assistant position with Langenbeck and Rudolf Virchow. Since there was no position available, in April 1867 Kocher moved on to London where he first met Jonathan Hutchinson and then worked for Henry Thompson and John Erichsen. Furthermore, he was interested in the work of Isaac Baker Brown and Thomas Spencer Wells, who also invited Kocher to go to the opera with his family. In July 1867, he traveled on to Paris to meet Auguste Nélaton, Auguste Verneuil and Louis Pasteur. During his travels, he did not only learn novel techniques but also got to know leading surgeons in person and learned to speak English fluently which allowed him later on to follow the scientific progress in the English speaking world with ease."]}, {"page": "February 3", "response": ["*1873 – Isaac Baker Brown, English gynecologist and surgeon (b. 1811)"]}, {"page": "Female genital mutilation", "response": ["Isaac Baker Brown, an English gynaecologist, president of the Medical Society of London and co-founder in 1845 of St. Mary's Hospital, believed that masturbation, or \"unnatural irritation\" of the clitoris, caused hysteria, spinal irritation, fits, idiocy, mania, and death. He, therefore \"set to work to remove the clitoris whenever he had the opportunity of doing so\", according to his obituary., cited in  Brown performed several clitoridectomies between 1859 and 1866. In the United States, J. Marion Sims followed Brown's work and in 1862 slit the neck of a woman's uterus and amputated her clitoris, \"for the relief of the nervous or hysterical condition as recommended by Baker Brown\". When Brown published his views in On the Curability of Certain Forms of Insanity, Epilepsy, Catalepsy, and Hysteria in Females (1866), doctors in London accused him of quackery and expelled him from the Obstetrical Society.; ."]}, {"page": "1873", "response": ["* February 3 – Isaac Baker Brown, English gynaecologist, surgeon (b. 1811)"]}, {"page": "History of circumcision", "response": ["These increasingly common medical beliefs were even applied to females. The controversial obstetrical surgeon Isaac Baker Brown founded the London Surgical Home for Women in 1858, where he worked on advancing surgical procedures. In 1866, Baker Brown described the use of clitoridectomy, the removal of the clitoris, as a cure for several conditions, including epilepsy, catalepsy and mania, which he attributed to masturbation. In On the Curability of Certain Forms of Insanity, Epilepsy, Catalepsy, and Hysteria in Females, he gave a 70 per cent success rate using this treatment."]}, {"page": "Halstead", "response": ["*Isaac Baker Brown (1811–1873), notable gynaecologist and obstetrician, went to school here."]}, {"page": "St Mary's Hospital, London", "response": ["The original block of St Mary's Hospital in Norfolk Place was designed by Thomas Hopper in the classical style. It first opened its doors to patients in 1851, the last of the great voluntary hospitals to be founded. Among St Mary's founders was the surgeon Isaac Baker Brown, a controversial figure who performed numerous clitoridectomies at the London Surgical Home, his hospital for women, and who \"immediately set to work to remove the clitoris whenever he had the opportunity of doing so.\" It was at St Mary's Hospital that C.R. Alder Wright first synthesized diamorphine in 1874."]}, {"page": "Ernest Hart (medical journalist)", "response": ["His real life-work, however, was as a medical journalist, beginning with the Lancet in 1857. He was appointed editor of the British Medical Journal on 11 August 1866. During this time the British Medical Journal's harsh criticism of Isaac Baker Brown lead to the complete destruction of Brown's career. As editor Hart can be held accountable in part for this (as can the editor before him, William Orlando Markham). His campaigning editorials could be vicious. They were usually sententious and often self-congratulatory."]}, {"page": "Colne Engaine", "response": ["* Isaac Baker Brown, 19th-century gynaecologist and surgeon, was born in the village. The white-brick facade of Knight's Farm, still extant today, is his work.Deeds in possession of Mr. G. Courtauld, bdle. 4; B. Woollings, Browns of Knights (priv. print. c. 1990), passim: copy in E.R.O."]}, {"page": "Issac Baker Brown", "response": ["#REDIRECT Isaac Baker Brown"]}]}}