{"wiki_id": "http://www.wikidata.org/entity/Q6071833", "itemLabel": "Peter Ridsdale", "itemDescription": "English businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Ridsdale", "wikipedia_page": {"main": "Peter Ridsdale (born 11 March 1952) is an English businessman and advisor to the owner at Preston North End. He was until December 2011 the Chairman of Football Operations at Plymouth Argyle. Ridsdale was previously the chairman of Leeds United, Barnsley and Cardiff City.\n\n", "link_mentions": [{"page": "Rio Ferdinand", "response": ["The following season, in August 2001, he became the club captain after replacing Lucas Radebe and turned in an impressive second campaign, despite Leeds' failure to break into the top three and secure qualification for the competition they had figured in so prominently during the previous season. During the 2002 FIFA World Cup, rumours began circulating that the club were in dire financial trouble and that new manager Terry Venables would be forced to part with his star defender for a substantial amount of cash. Later that summer after Ferdinand's impressive World Cup for England, Leeds accepted a bid of £29.3 million with possible performance related add-ons up to £33.3 million due to their perilous financial position. Years later, Rio admitted he sat in the office of Leeds chairman Peter Ridsdale for almost six hours to force the transfer through.Archived at Ghostarchive and the Wayback Machine: "]}, {"page": "Peter Reid", "response": ["Reid was forced to sign an almost entirely new team over the summer of 2011, with 10 players making their debut on the opening day in a 1–1 draw with Shrewsbury Town. However the club were unable to build on the Shrewsbury result and lost their following 8 league games, all whilst the club was still stuck in financial turmoil. On 18 September, Peter Reid was sacked by acting chairman Peter Ridsdale with the club bottom of the Football League with just one point. Despite having a win rate of just 26% during his time at the club, Reid remains popular amongst Plymouth Argyle supporters because of his generosity and commitment during troubled times."]}, {"page": "Robbie Fowler", "response": ["Fowler was offered a new pay-as-you-play contract with Cardiff for the 2008–09 season in May 2008 and was expected to sign the contract. However, he pulled out of the deal, preferring to accept an offer of a trial at Blackburn Rovers from former Liverpool colleague Paul Ince. The move left Cardiff manager Dave Jones and chairman Peter Ridsdale furious after the club had assisted Fowler's rehabilitation throughout the summer. After training with Blackburn and appearing in a handful of friendlies he was offered a six-month deal by the club to last until January, but Fowler turned down the deal due to it being a shorter offer than the previous one he had rejected at Cardiff. After turning down the offer, Fowler made a shock enquiry about returning to Cardiff on the deal he had originally turned down, prompting anger from supporters and a swift \"no thanks\" from the club.\"Cardiff City reject Fowler request for return\" South Wales Echo. Retrieved 4 December 2013."]}, {"page": "George Graham (footballer, born 1944)", "response": ["The move came at Leeds' hotel on the island of Madeira following Leeds UEFA Cup first round penalty shootout victory over Portuguese League side Maritimo 29 September 1998. Spurs' Alan Sugar telephoned Leeds chairman Peter Ridsdale, who admitted that after a brief telephone conversation a deal was done, with compensation agreed which would allow Graham to fulfil his wish of returning to London. Graham made no secret of his desire to head back to the capital following Leeds' 3-3 draw with Tottenham in North London on 26 September 1998. He cited family and personal reasons."]}, {"page": "Jimmy Floyd Hasselbaink", "response": ["Hasselbaink was on the verge of joining Championship side Leicester City in August 2007, but the club later withdrew their offer.\"Hasselbaink baffled by Foxes snub\". BBC Sport. 14 August 2007. Retrieved 5 September 2007. Instead Cardiff City chairman Peter Ridsdale, who worked with Hasselbaink at Leeds United, brought him to Cardiff on a one-year deal, putting him in a veteran strike partnership with Robbie Fowler. Manager Dave Jones said that Hasselbaink initially took time to settle and become match fit but despite being a demanding player his professionalism was ultimately a positive influence. On 19 September, Hasselbaink scored his first goal for Cardiff with a 20-yard low drive in the 2–1 league defeat to Watford at Ninian Park. He was nominated for the Player of the Round in the Fifth Round of the FA Cup after scoring an impressive goal against Wolverhampton Wanderers.\"Hasselbaink gets an FA nomination\". South Wales Echo (Cardiff). 22 February 2008. Retrieved 14 January 2016. He remained as a regular starter for the \"Bluebirds\" throughout the 2007–08 season, and made appearances in five of the six matches Cardiff played to reach the FA Cup final. In the final Cardiff lost 1–0 to Portsmouth; Hasselbaink played 70 minutes before being substituted for Steve Thompson. As the season finished he entered talks to extend his stay at Cardiff; however, he left the club in July 2008 following a dispute over pay."]}, {"page": "Elland Road", "response": ["On 16 August 2001, chairman Peter Ridsdale sent a letter to season ticket holders and shareholders regarding the future of the club outlining two options, to improve Elland Road or to relocate. A ballot form was included but the letter was biased in favour of relocation. Less than 13% voted to stay at Elland Road and 87.6% of the 18,500 who voted were in favour of the move. On 7 September 2001, Ridsdale announced his intention to move the club to a 50,000-seat stadium at Skelton in time for the 2004–05 season.  The plans never came to fruition as Ridsdale resigned in March 2003, leaving financial disarray and the PLC was soon to follow in March 2004.", "In August 2001, when Leeds were still a leading Premier League side, chairman Peter Ridsdale unveiled plans for the club to relocate to a 50,000-seat stadium in Skelton. The following month, the club's 33,250 season ticket holders were asked to vote on the proposed relocation. 87.6% of them voted in favour of relocation, but the plans were abandoned within two years following the onset of the club's financial crisis and decline in fortunes on the field."]}, {"page": "Terry Venables", "response": ["Leeds were further weakened in January 2003, when Jonathan Woodgate was sold to Newcastle United without Venables being informed, in an attempt to pay off mounting debts. Venables threatened to leave if Woodgate was sold, but was persuaded to stay by Peter Ridsdale. With the club spiralling towards relegation, and amid later substantiated rumours of further player sales by the board Venables was sacked in March 2003."]}, {"page": "Jonathan Woodgate", "response": ["His number of appearances were heavily reduced due to picking up several injuries on different occasions. But as a result of Leeds' financial problems Woodgate was sold to Newcastle to raise some much needed funds. He was described as the club's 'jewel in the crown' and his sale caused anger for many Leeds United fans as Peter Ridsdale revealed the perilous financial situation at the club. The sale also led to the dismissal of Terry Venables who disagreed with Woodgate's departure."]}, {"page": "Ninian Park", "response": ["The stadium was handed over to Redrow Homes by Cardiff chairman Peter Ridsdale on 10 September 2009. The 99-year-old Ninian Park was demolished later in 2009 to make way for a housing development. Redrow built 142 houses on the site, intending to retain the name Ninian Park."]}, {"page": "David O'Leary", "response": ["Leeds reached the semifinals of the Champions League in 2000-01, where they lost to eventual runners-up Valencia. Their Premier League form also dipped slightly and O'Leary's men had to settle for a UEFA Cup place, finishing fourth in the last season before the Champions League qualification spots for the English Premiership expanded from the top three to the top four. Although there was little indication of this at the time, this was a serious failure for the club because Peter Ridsdale had borrowed £60 million against future gate receipts, budgeting for prolonged Champions League involvement.", "O'Leary has since stated that he would like the chance to return as manager of Leeds United,O'Leary Wants His Job Back! – The Scratching Shed 30 June 2009 after Peter Ridsdale left the club."]}, {"page": "Football hooliganism", "response": ["Before Galatasaray's semi-final UEFA Cup match with Leeds United in 2000, two Leeds fans, Christopher Loftus and Kevin Speight, were stabbed to death in Istanbul following street fights between Turkish and British hooligans. UEFA allowed the game to proceed and Galatasaray won, 2–0. Leeds complained because home fans jeered while a message of condolence was read for the victims. Galatasaray's players refused to wear black arm bands. The Leeds chairman at the time, Peter Ridsdale, accused Galatasaray of \"showing a lack of respect\". He also revealed that his team's players had received death threats before the match."]}, {"page": "Sam Hammam", "response": ["After failing to get the new stadium plans agreed by Cardiff Council due to concerns over financial security in 2006, Hammam agreed to a takeover by a consortium led by new chairman Peter Ridsdale and including local businessman Paul Guy. In March 2008, Cardiff City began a court case against financial backers Langston over the repayment of a loan believed to be worth around £31 million. During the hearing the barrister representing the club named Sam Hammam as the man they believe to be behind the company.\"Hammam named in Cardiff loan case\" BBC Retrieved on 14 March 2008, No settlement was reached in the case."]}, {"page": "Dominic Matteo", "response": ["His book, In My Defence, was published in 2011. In an interview, given at the time of the book's release, he said that he had liked working with David O'Leary and Peter Ridsdale at Leeds; \" I loved working with David. He had been a great central defender at Arsenal. But, as things started to get on top of us, he spent more time in his office. He was nowhere near a failure and, if you finished fifth now, you would not expect the sack.\"'i' from The Independent, p 48-49, 7 November 2011"]}, {"page": "Eirik Bakke", "response": ["Speculation continued over Bakke's future when he was left out of the Leeds United squad for the match against Sheffield Wednesday on 27 August 2006, with some in the press and supporters speculating that this was due to an imminent transfer. The club released a statement on 29 August 2006 effectively confirming that Bakke would be leaving Leeds United,Leeds United (2006). \"Eirik Bakke:Club Statement\"  LeedsUnited.com (accessed  29 August 2006) but Bakke said that he would like to stay,BBC (28 August 2006). \"Bakke faced with Elland Road exit\" bbc.co.uk (accessed  29 August 2006) and continued training with Leeds despite not playing, not wanting to return to playing in Norway at that time.Sky Sports (30 August 2006). \"Eirik's Bakke at Leeds\" SkySports.com (accessed  31 August 2006) The problem arose due to his £23,000-a-week wages and £4,000 appearance fees,Leeds United (September 2006). \"Wolves Bid For Lewis (Info Later in Same Page)\"  LeedsUnited.com (accessed  13 September 2006) which were originally agreed during Peter Ridsdale's chairmanship, but which the club could no longer afford. Leeds United tried to resolve the issue by offering Bakke lower wages to stay at the club, but his agent stated he wanted the contractually agreed wage. Eventually, Bakke left the club, as part of a wider attempt by Leeds United to reduce expenditure on player wages."]}, {"page": "Joe Ledley", "response": ["Following a poor run of results by Cardiff City during November 2009, Ledley was the focus of criticism over his performances, most notably from Cardiff City chairman Peter Ridsdale who commented that, due to his ongoing contract talks, Ledley was \"playing like he is somewhere else already\". However, Ledley received backing from both Cardiff City manager Dave Jones and club captain Mark Hudson, before later stating that he needed surgery on a hip injury that had plagued him for the previous three months and subsequently hindered his performances. On 9 December, Cardiff confirmed that Ledley needed a hip operation before the end of the season. He scored his first goal of the season on 28 December with the opener against Peterborough United, and 17 minutes later he scored again with a header. On 29 January 2010, Ledley underwent surgery on his hip problem which was expected to rule him out for the rest of the season, but made an early return as a substitute during a 2–1 win over Swansea City. On 17 April, Ledley scored against Queens Park Rangers at Loftus Road to ensure Cardiff a 1–0 win and also a Championship Play-Off place for that season. He scored in the 36th minute of the Play-off Final against Blackpool on 22 May during a 3–2 defeat."]}, {"page": "2006 in Wales", "response": ["*October – Peter Ridsdale replaces Sam Hammam as chairman of Cardiff City F.C."]}, {"page": "Carl Fletcher (Welsh footballer)", "response": ["Fletcher was appointed caretaker manager of Plymouth Argyle on 19 September 2011, a day after Peter Reid was sacked by acting chairman Peter Ridsdale."]}, {"page": "Graham Alexander", "response": ["On 20 June 2012, Alexander was appointed Head of Youth Development. Chairman Peter Ridsdale said \"He's got over 1,000 games under his belt, he's a hero here and what better person to head our youth development.\""]}, {"page": "Mike Dean (referee)", "response": ["On 5 April 2009 in a South Wales derby between Cardiff City and Swansea City, Dean suffered a cut to the forehead resulting from what appeared to be a coin thrown by a Cardiff supporter. He later awarded Cardiff a penalty kick, which was converted to earn a draw for the home side. Cardiff's chairman Peter Ridsdale condemned the attack and said that the supporter would be given a lifelong ban if found guilty. A 24-year-old man was later convicted over the incident and given a three-year ban and £200 fine. No action was taken by the Football Association of Wales against Cardiff City."]}, {"page": "Liam Dickinson", "response": ["Dickinson agreed a contract with Plymouth Argyle on 5 July 2011, subject to the takeover of the club being completed. However, he was released from his contract on just eight days later, citing personal reasons. \"Regrettably, we have agreed to a request from Liam to be released. We fully understand the reasons why,\" said acting chairman Peter Ridsdale, who further stated that \"Liam has been a thorough professional in the short time he has been with us, and we hope that things will work out for him.\""]}, {"page": "Cardiff City F.C.", "response": ["The club experienced increasing financial difficulties over the next few years and plans for a new stadium failed to gain approval from Cardiff Council because of concerns over financial security in 2006. Hammam then agreed to a takeover by a consortium led by new chairman Peter Ridsdale and the lead developer of the new stadium, Paul Guy. During the 2007–08 season, Cardiff reached the semi-final of the FA Cup for the first time in 81 years after beating Middlesbrough 2–0 on 9March 2008. After coming through their semi-final against Barnsley with a 1–0 win at Wembley Stadium on 6April with a goal from Joe Ledley, they eventually lost 1–0 to Portsmouth in the final."]}, {"page": "History of Leeds United F.C.", "response": ["Although the general public were unaware, chairman Peter Ridsdale had taken out large loans against the prospect of gate receipts from Champions League games. As Leeds had failed to qualify for the competition, there was simply not enough money coming in to repay the debt. The first indication that the club was in financial trouble was the sale of Rio Ferdinand to Manchester United for £30 million, a world record for a defender. O'Leary and Ridsdale publicly fell out over the sale.", "In the meantime, Peter Ridsdale resigned from the Leeds board and was replaced by Professor John McKenzie, who had to try to turn around a club with debts in excess of £100 million. Leeds reported a British record loss of £49.5 million in October 2003, which on-top of their already existing £78 million debt set the club's total debt at £127.5 million.", "Leeds entered voluntary Administration on 4 May 2007, thus incurring a 10-point deduction which confirmed the club's relegation to League One. Administration had been predicted for some time, due to crippling debts created during Peter Ridsdale's chairmanship. For his part, Ridsdale denied any of the current situation was his fault, only days after having admitted it was a mistake to allow David O'Leary to spend so lavishly on players. Ken Bates, however, blamed Leeds financial situation firmly on Ridsdale and his board. KPMG were appointed as administrators and within minutes of entering administration sold the club to Leeds United Football Club Limited, owned by Ken Bates, Shaun Harvey and Mark Taylor. On 1 June 2007 75.20% of the creditors voted in favour of Ken Bates' bid. With just minutes remaining of the 28-day period during which creditors could challenge the buyback by Ken Bates, HM Revenue & Customs lodged a formal challenge, and the club was put up for sale again. After due deliberation, on 11 July 2007 KPMG revealed that once again they had chosen Ken Bates' bid."]}, {"page": "Leeds United F.C.", "response": ["Under chairman Peter Ridsdale, Leeds had taken out large loans against the prospect of the share of the TV rights and sponsorship revenues from UEFA Champions League qualification and subsequent progress in the competition. However, Leeds narrowly failed to qualify for the Champions League in two successive seasons, and as a consequence did not receive enough income to repay the loans. The first indication that the club was in financial trouble was the sale of Rio Ferdinand to Manchester United for approximately £30 million. Ridsdale and O'Leary publicly fell out over the sale, and O'Leary was sacked and replaced by former England manager Terry Venables. Leeds performed woefully under Venables, and other players were sold to repay the loans, including Jonathan Woodgate, whom Ridsdale had promised Venables would not be sold. Tensions mounted between Ridsdale and Venables and, with the team underachieving, Venables was sacked and replaced by Peter Reid. Ridsdale resigned from the Leeds board and was replaced by existing non-executive director Professor John McKenzie. At this time Leeds were in danger of relegation, but managed to avoid the drop in the penultimate game of the season, beating Arsenal 3–2 at Highbury with a late strike by Mark Viduka.", "Leeds also hold extreme bitterness towards the Turkish club Galatasaray following the deaths of the two supporters the night before a UEFA Cup semi-final in Istanbul in April 2000. During the game, supporters of Galatasaray mocked the deaths, while their team refused to wear black armbands. The then Leeds Chairman Peter Ridsdale accused the club of 'lacking common decency’."]}, {"page": "Gordon Shepherd (football chairman)", "response": ["Gordon Shepherd (born 21 December 1935) is the former chairman of Barnsley F.C. He was chairman since 2004 after Peter Ridsdale resigned. He retired at the end of the 2007–08 season."]}, {"page": "Leeds Modern School", "response": ["* Peter Ridsdale, former chairman of Leeds United."]}, {"page": "Cardiff City Stadium", "response": ["After a summer sale of players, the entry of former Leeds United chairman Peter Ridsdale and numerous rumours, the development was given a period of 90 days from 31 December 2005 by Cardiff Council to finalise the underlying business plan. On 31 January 2006 the developers secured Asda as the lead retailer of the new development, which enabled the final funding of the stadium to start. This allowed the council timetable to extend by four months to September 2006.", "When work finally commenced Peter Ridsdale stated that he expected the stadium to be ready by Christmas 2008 but it was finally completed in May 2009. Although some believe this slight delay was caused by Cardiff City's ongoing legal action with Langston, it was actually caused by unexpectedly poor weather during the summer of 2007.", "In August 2007, chairman Peter Ridsdale revealed that the club had reduced a £24 million debt to Swiss-based financiers Langston agreed under the chairmanship of Sam Hammam to £15 million, by agreeing to sell the stadium's naming rights to Langston for £9 million. The stadium name was unveiled in March 2009 as Cardiff City Stadium and on 1 May, the official logo of the Cardiff City Stadium and the management company Cardiff City Stadium Ltd was unveiled."]}, {"page": "Stéphane Zubar", "response": ["He joined English League One club Plymouth Argyle on a trial during the summer of 2010. His trial at Plymouth was successful and he signed for club after international clearance was granted on 16 November. He made his debut four days later as the \"Pilgrims\" lost 2–1 to Brentford at Home Park. On 28 December, Zubar scored his first goal in England as Plymouth drew 1–1 with Notts County. Seven days later he scored his second goal for Plymouth in a 3–2 win over Bristol Rovers. On 11 January 2012, Zubar received a red card after a second bookable offence in a 3–2 defeat to Huddersfield Town. At the end of 2010–11 Argyle were relegated to League Two and Zubar was the only player to be offered a new (two-year) contract by a club, which he signed in July. However he had his contract with the club terminated at the end of August, citing \"personal reasons\"; club chairman Peter Ridsdale said that \"Stephane will remain a friend of the club and leaves with our best wishes\"."]}, {"page": "History of Preston North End F.C.", "response": ["Hemmings hired Maurice Lindsay, prominent in rugby league as a past chairman of Wigan R.L.F.C., to take over as club chairman in place of Derek Shaw, who stepped aside to become club vice-president. Through the 2010–11 season, which ended in relegation, a cost-cutting policy was implemented to put the business back onto a sound economic footing and eight of the team's higher-paid players were transferred out. In December 2011, Lindsay had to retire due to ill health and was replaced days later by Peter Ridsdale. Ridsdale stepped aside in October 2012 following an insolvency action but has continued to act as an advisor to Hemmings. Preston now have a chief executive instead of a chairman and this has been John Kay from 1 November 2014."]}, {"page": "Aaron Ramsey", "response": ["Following Ramsey's impressive performance in the 2–1 FA Cup quarter-final win over Middlesbrough it was revealed that Manchester United manager Sir Alex Ferguson had talked to Cardiff boss Dave Jones to inquire about Ramsey, who were later joined by Arsenal and Everton in following his progress.\"Fergie in for £5m rated Aaron Ramsey\"  South Wales Echo. Retrieved 15 March 2008 Ramsey in fact grew up a Manchester United fan, but in the end he decided not to join them. Cardiff chairman Peter Ridsdale told the BBC that Arsenal's bid of £5 million up front had been accepted. Arsenal's bid did not include a loan clause that would allow Ramsey to stay at Cardiff for another season. Cardiff City assistant manager and former Arsenal player and coach Terry Burton, who was credited for having brought through Ramsey, also helped recommend him to Arsenal manager Arsène Wenger, having retained a longstanding connection to the club. During the transfer negotiations, Burton also advised that Ramsey join Arsenal, citing the similarity between the player and the club's overall style of play."]}, {"page": "Leeds United Football Club Limited", "response": ["Leeds United entered voluntary administration on 4 May 2007, thus incurring a 10-point deduction which confirmed the club's relegation to League One. Administration had been predicted for some time, due to crippling debts created during Peter Ridsdale's chairmanship. For his part, Ridsdale denied any of the current situation was his fault, only days after having admitted it was a mistake to allow the then-manager David O'Leary to spend so lavishly on players. Ken Bates, however, blamed Leeds' financial situation firmly on Ridsdale and his board."]}, {"page": "History of Barnsley F.C.", "response": ["On 4 September 2003, former Leeds United chairman Peter Ridsdale announced that he had purchased the club alongside local businessman Patrick Cryne.Ridsdale in Tykes takeover BBC Sport, 4 September 2003 Ridsdale ultimately stepped down on 24 December 2004 after a conflict of interests within the board, with the club's finances becoming increasingly uncomfortable. Ownership was transferred to board member Gordon Shepherd, with Cryne remaining in a prominent position at the club.Boardroom reshuffle at Barnsley BBC Sport, 24 December 2004"]}, {"page": "Miguel Comminges", "response": ["In May 2008, Comminges announced that he would be leaving Swindon at the end of the season to sign for Cardiff. Again, despite Comminges' claims, Cardiff chairman Peter Ridsdale stated the club had \"not had any conversation with Swindon Town or the player\". A month later, on 6 June 2008, Comminges joined Cardiff City on a two-year contract, with the move to be completed on 1 July. Comminges made his debut for the club on 12 August during a 2–1 victory over AFC Bournemouth in the League Cup, before making his league debut four days later in a 1–1 draw with Doncaster Rovers. He enjoyed an extended run in the first-team at left back through September, covering for the injured Tony Capaldi and Mark Kennedy. Comminges received the first red card of his career in the club's 1–0 away loss to Queens Park Rangers in November 2008, picking up a second yellow for dissent. He featured regularly for the club during the season, playing in a number of positions and making 33 appearances in all competitions as Cardiff narrowly missed out on the play-off positions on goals scored."]}, {"page": "2007–08 Cardiff City F.C. season", "response": ["During the 2007–08 season Cardiff City played in the Football League Championship. It was the team's fifth year in the Championship since being promoted from League One. The season was the first full year in charge for chairman Peter Ridsdale after taking over from Sam Hammam the previous year.", "*7 September 2007 – Chairman Peter Ridsdale reveals that the club's new ground had fallen behind schedule and will not be ready until May 2009.", "*2 November 2007 – Construction of Cardiff's new stadium gets under way with a ceremonial 'cutting of the turf' ceremony between Peter Ridsdale and Cardiff council leader Rodney Berman."]}, {"page": "England national football team manager", "response": ["The process of appointing a new England manager is undertaken by an FA committee, comprising board members and other high-ranking FA officials. For example, the members of the selection panel which appointed Sven-Göran Eriksson in 2001 were: chief executive Adam Crozier, chairman Geoff Thompson, vice-chairman Dave Richards, club chairmen and FA board members David Dein and Peter Ridsdale, and technical director Howard Wilkinson.p24"]}, {"page": "2008–09 Cardiff City F.C. season", "response": ["* 9 September 2008 – Peter Ridsdale and the board of directors attend a \"Topping Off\" ceremony at the club's new stadium.", "The following game saw Cardiff win 3–1 against Barnsley, the first time in the season they had scored more than two goals in a single game. They went on to win 3 of their 6 matches in March before meeting local rivals Swansea City for the third time during the season on 5 April. The match ended in a 2–2 draw but was overshadowed by referee Mike Dean being struck by a coin thrown from the crowd. The incident was condemned by chairman Peter Ridsdale and manager Dave Jones after the match. Three consecutive wins for the side meant that with 4 games remaining they needed two points to secure a play-off place but they only managed one point during the final four games, in a 2–2 draw with Charlton Athletic, which would lead to them finishing in seventh place, missing out on a play-off spot to Preston North End on goals scored."]}, {"page": "Paul Coutts", "response": ["Ahead of the 2012–13 season, Coutts along with 7 other players was told by the manager via SMS not to report to pre-season training as he was not in Westley's plans. Coutts had turned down a move to Peterborough United and was attracting interest from Championship clubs Derby County and Birmingham City. Chairman Peter Ridsdale stated that Derby's interest was \"an enquiry at this stage rather than an offer.\" On 12 July 2012, Coutts began talks with Derby County with a deal being reported as close to being completed on 13 July 2012."]}, {"page": "Leckwith development", "response": ["The stadium was handed over to Redrow Homes by Cardiff City chairman Peter Ridsdale on 10 September 2009. Redrow was to build 142 new homes on the site. The development was still to be known as Ninian Park. A planted square was proposed at the centre of the new housing development, in the area of Ninian Park football ground's centre spot. The first show home of the £24m development was to open by late spring 2010, with a mixture of terraced, detached and semi-detached houses."]}]}}