{"wiki_id": "http://www.wikidata.org/entity/Q608103", "itemLabel": "Antony Lambton", "itemDescription": "British politician (1922-2006)", "wikipedia_url": "https://en.wikipedia.org/wiki/Antony_Lambton", "wikipedia_page": {"main": "Antony Claud Frederick Lambton, (10 July 1922 – 30 December 2006), briefly 6th Earl of Durham, styled before 1970 as Viscount Lambton, and widely known as Lord Lambton, was a Conservative Member of Parliament and a cousin of Sir Alec Douglas-Home, the former Prime Minister and Foreign Secretary. Lambton resigned from Parliament and ministerial office in 1973.\n\n", "link_mentions": [{"page": "Peerage Act 1963", "response": ["| Antony Lambton6th Earl1922–2006"]}, {"page": "Alan Beith", "response": ["In 1966, Beith began his career as a politics lecturer in the University of Newcastle upon Tyne.  In 1969 he was elected as a Councillor on Hexham District Council and, in 1970, he was also elected to Corbridge Town Council. He contested Berwick-upon-Tweed as the Liberal candidate at the 1970 general election but was heavily defeated by the sitting Conservative MP Antony Lambton.", "Beith became a member of the North Tynedale District Council in 1973. Later that year, Antony Lambton resigned as an MP following a Fleet Street exposé. At the ensuing by-election on 8 November 1973, Beith was narrowly elected by 57 votes, becoming Berwick's first Liberal MP since 1945."]}, {"page": "Anthony Lambton, Viscount Lambton", "response": ["#REDIRECT Antony Lambton"]}, {"page": "Anthony Claud Frederick Lambton, 6th Earl of Durham", "response": ["#REDIRECT Antony Lambton"]}, {"page": "Lambton", "response": ["*Antony Lambton (1922–2006), formerly 6th Earl of Durham and later claimed Viscount Lambton, disclaimed his earldom under the terms of the Peerage Act 1963"]}, {"page": "David Ogilvy (businessman)", "response": ["He was a first cousin once removed of the writer Rebecca West and of Douglas Holden Blew Jones, who was the brother-in-law of Freda Dudley Ward and the father-in-law of Antony Lambton, 6th Earl of Durham. Ogilvy attended St Cyprian's School, Eastbourne, on reduced fees because of his father's straitened circumstances and won a scholarship at age thirteen to Fettes College, in Edinburgh. In 1929, he again won a scholarship, this time in history, to Christ Church, Oxford. Without the scholarships, Ogilvy would not have been able to attend Fettes or Oxford University because his father's business was badly hit by the depression of the mid-1920s. His studies were not successful, however, and he left Oxford for Paris in 1931 where he became an apprentice chef in the Hotel Majestic. After a year, he returned to Scotland and started selling AGA cooking stoves, door-to-door. His success at this marked him out to his employer, who asked him to write an instruction manual, The Theory and Practice of Selling the AGA Cooker, for the other salesmen. Thirty years later, Fortune magazine editors called it the finest sales instruction manual ever written."]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|Antony Lambton"]}, {"page": "Berwick-upon-Tweed (UK Parliament constituency)", "response": ["Rural in nature, sparse of population and with agriculture as a major source of employment, Berwick-upon-Tweed has never elected a Labour candidate, one of two constituencies in the north east of England not to have done so. The closest Labour have ever came to winning the seat was at the 1966 general election, where they finished just 4,373 votes behind incumbent Conservative MP Antony Lambton. It was represented by Liberal Democrat Sir Alan Beith from 1973 (formerly Liberal) until his retirement in 2015, when it was gained by the Conservative candidate Anne-Marie Trevelyan. The area has been notable for its Liberal politicians – both Sir William Beveridge (influential in the formation of the National Health Service) and Edward Grey (Foreign Secretary at the beginning of World War I, best remembered for the \"lamps are going out all over Europe....\" remark) have served this constituency.", "Beith was first elected at a by-election, required as a result of the resignation of the then incumbent MP Antony Lambton (Conservative), who had been caught up in a scandal involving call girls, marijuana and a tabloid newspaper.", "| Antony Lambton"]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| Antony Lambton"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| Antony Lambton"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| Antony Lambton"]}, {"page": "List of MPs elected in the 1964 United Kingdom general election", "response": ["| Antony Lambton"]}, {"page": "List of MPs elected in the 1966 United Kingdom general election", "response": ["| Antony Lambton"]}, {"page": "List of United Kingdom MPs: L", "response": ["*Antony Lambton"]}, {"page": "List of Old Harrovians", "response": ["*Antony Lambton (1922–2006), disclaimed 6th Earl of Durham, MP for Berwick-upon-Tweed (1951–1973)"]}, {"page": "Lord Rupert Nevill", "response": ["* Guy Rupert Gerard Nevill (29 March 1945 – 5 February 1993), godson of Elizabeth II; he married Lady Beatrix Mary Lambton, daughter of Antony Lambton, 6th Earl of Durham."]}, {"page": "Deaths in December 2006", "response": ["*Antony Lambton, 84, British Conservative government minister."]}, {"page": "Heath ministry", "response": ["|rowspan=3|Under-Secretary of State for the Air Force||Antony Lambton||24 June 1970|| "]}, {"page": "List of United Kingdom by-elections (1950–1979)", "response": ["|Antony Lambton"]}, {"page": "Under-Secretary of State for Air", "response": ["|Antony Lambton || 24 June 1970 || 5 June 1973 "]}, {"page": "2006 in the United Kingdom", "response": ["* 30 December – Antony Lambton, politician (born 1922)"]}, {"page": "United Kingdom by-election records", "response": ["*1973 Berwick-upon-Tweed by-election: Antony Lambton resigned after his visits to prostitutes and use of cannabis were exposed by the News of the World."]}, {"page": "Anthony Lambton", "response": ["#REDIRECT Antony Lambton"]}, {"page": "Antony Lambton, Lord Lambton", "response": ["#REDIRECT Antony Lambton"]}, {"page": "Anne Lambton", "response": ["Lambton is a younger daughter of Antony Lambton (formerly 6th Earl of Durham) and his wife Bindy née Blew-Jones. Her older sister is Lucinda Lambton, the British writer, photographer and broadcaster. One of her first roles was as Linda in Sid and Nancy (1986) and then as a witch in the 1990 film, The Witches. Lambton's recent appearances include Brothers of the Head and Mrs. Henderson Presents (both 2005) and The Edge of Love (2008) as well as the reporter Gloria in Netflix’s second season of The Crown."]}, {"page": "Antony Claud Frederick Lambton", "response": ["#REDIRECT Antony Lambton"]}]}}