{"wiki_id": "http://www.wikidata.org/entity/Q6099509", "itemLabel": "Ivor Seemley", "itemDescription": "English footballer (1929-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ivor_Seemley", "wikipedia_page": {"main": "Ivor John Seemley (30 June 1929 – 1 November 2014) was an English professional footballer who played as a left back in the Football League for Sheffield Wednesday, Stockport County, and Chesterfield and in non-League football for Ilkeston Town and Sutton Town.", "link_mentions": [{"page": "2014 in association football", "response": ["* 1 November: Ivor Seemley, English footballer (born 1929)"]}, {"page": "1929 in the United Kingdom", "response": ["** Ivor Seemley, English professional footballer (died 2014)"]}, {"page": "Billy Sowden", "response": ["Born in Gorton, Manchester, Sowden started his career with junior side Greenwood Victoria before joining Manchester City as an eighteen-year-old in April 1949, despite being a Manchester United supporter. He made his professional debut for City in August 1952 in the Manchester derby. In his next appearance for the club he scored twice against Tottenham Hotspur. He scored the first Manchester City goal under floodlights at Maine Road when he scored a hat-trick against Heart of Midlothian in a friendly in October 1953. He rose to local fame for being one of the first City players to own a car, and he would often offer lifts to supporters attending Maine Road. In November 1954, he transferred to Football League Third Division North side Chesterfield for a fee of £1,500. In his first season for the club he finished as second-highest scorer behind George Smith, scoring 14 goals in 24 matches. In the 1955–56 season he played in all but one game and scored 32 goals, which remains a post-war record haul in a season by a Chesterfield player. His place in the side was less secure during the 1956–57 season, however, he still managed to score 13 goals in 28 matches. He lost his place in February 1957 when the club signed Gwyn Lewis, and his final goal for the club came against his boyhood side Manchester United in a reserve match. In the summer of 1957 he transferred to Stockport County in exchange for Ivor Seemley. He had an impressive record in his only season for the club scoring 8 goals in 16 matches in all competitions. In the summer of 1958 he dropped into non-league football with Cheshire County League side Macclesfield. He made his debut for the Silkmen in August 1958 at home to Buxton. He was top scorer in his first season with the club scoring 19 times. He scored three hat-tricks during his time at the Moss Rose, playing his last match for the club in November 1960. In total he made 89 appearances for Macclesfield in all competitions scoring 51 goals, before transferring to divisional rivals Altrincham in 1961. He made his debut for the club in April 1961, in a 7–0 defeat to Bangor City. He played in all of the last eight matches of the 1960–61 season for the struggling side, as Altrincham lost every match, before retiring from the game."]}, {"page": "2014 in the United Kingdom", "response": ["**Ivor Seemley, 85, footballer (Sheffield Wednesday, Stockport County, Chesterfield)."]}, {"page": "2014–15 in English football", "response": ["* 3 November 2014: Ivor Seemley, 85, former Sheffield Wednesday, Stockport County and Chesterfield left back."]}, {"page": "Deaths in November 2014", "response": ["*Ivor Seemley, 85, English footballer (Sheffield Wednesday, Stockport County, Chesterfield)."]}, {"page": "Seemley", "response": ["#REDIRECT Ivor Seemley"]}]}}