{"wiki_id": "http://www.wikidata.org/entity/Q6099018", "itemLabel": "Ivison Macadam", "itemDescription": "British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ivison_Macadam", "wikipedia_page": {"main": "Sir Ivison Stevenson Macadam  (18 July 1894 – 22 December 1974) was the first Director-General of the Royal Institute of International Affairs (Chatham House), and the founding President of the National Union of Students.\nHe was also the Editor and Chairman of the Advisory Board of the Annual Register of World Events; a longtime member of the editorial board of the Round Table and sat on the governing bodies of King’s College, London and other organisations.", "link_mentions": [{"page": "GKT School of Medical Education", "response": ["GKT has a fierce sporting rivalry with King's College London. This rivalry led to the founding of the Macadam Cup in 2004, which pits GKT and KCL sports teams against each other. The championship is named in honour of Sir Ivison Macadam, an alumnus of King's. So far in Macadam Cup's history, the GKT Team has the most wins."]}, {"page": "King's College London", "response": ["The Strand Campus is the founding campus of King's and is located on the Strand in the City of Westminster, sharing its frontage along the River Thames.  The original campus comprises the Grade I listed King's Building of 1831 designed by Sir Robert Smirke, and the King's College London Chapel redesigned in 1864 by Sir Gilbert Scott, with the subsequent purchase of much of adjacent Surrey Street (including the Norfolk and Chesham Buildings) since the Second World War and the 1972 Strand Building. The Macadam Building of 1975 houses the Strand Campus Students' Union and is named after King's alumnus Sir Ivison Macadam, first President of the National Union of Students.", "The former President of KCLSU, Sir Ivison Macadam, after whom the former students' union building on the Strand Campus (Macadam Building) is named, went on to be elected as the first president of the National Union of Students."]}, {"page": "National Union of Students (United Kingdom)", "response": ["Founding members included the unions of University of Birmingham, Birkbeck, University of London, London School of Economics, Imperial College (who first left in 1923 and have subsequently rejoined and left three times, the last time being in June 2008), King's College London (who supplied the first President, Sir Ivison Macadam) and the University of Bristol."]}, {"page": "The Annual Register", "response": ["In 1947 The Annual Register acquired an advisory board for the first time consisting of the then editor, Ivison Macadam, the assistant editor, Hugh Latimer, and five representatives nominated by: the English Association, the Arts Council of Great Britain, the British Association for the Advancement of Science, the Royal Institute of International Affairs, and the Royal Historical Society. Explaining this innovation, Macadam stated in the preface to the 1947 volume that it was “a recognition of the need for specialisation in these complicated times”.The Annual Register, vol. 189, (London, 1948), p. ix."]}, {"page": "John Macadam", "response": ["John Macadam was born at Northbank, Glasgow, Scotland, on 29 May 1827,John Macadam: www.earthwords.co.uk/macadam.htm the son of William Macadam (1783-1853) and Helen, née Stevenson (1803-1857).Sir Ivison Macadam Archives, Runton Old Hall, East Runton, Norfolk, UK His father was a Glasgow businessman, who owned a spinning and textile printing works in Kilmarnock, and was a burgess and a bailie (magistrate) of Glasgow.Edwin Macadam : http://www.shelwin.com/e/ancestry/macadam/macadam_history.htm#John%20Macadam,%20MD His fellow industrialists and he in the craft had developed, using chemistry, the processes for the large-scale industrial printing of fabrics for which these plants in the area became known.", "He was a member of what became a small dynasty of Scottish scientists and lecturers in analytical chemistry, which included, other than himself, his eldest half brother William Macadam, his immediate younger brother Stevenson Macadam (a younger brother Charles Thomas Macadam,Charles Thomas Macadam (1832-1906) later held the royal warrant as \"Purveyor of Chemical Manures\" to Queen Victoria. although not involved as a scientist, was also indirectly involved in chemistry becoming a senior partner in a chemical fertiliser company)The brothers' original interest in chemistry likely was derived from the advances and new inventions involved in the chemical printing processes of their father's commercial operations. and nephews William Ivison Macadam and Stevenson J. C. G. Macadam,Edwin Macadam : http://www.shelwin.com/e/ancestry/macadam/macadam_history.htm#John%20Macadam,%20MD as well as the former nephew's daughter, his great niece Elison A. Macadam.His great-nephew Ivison Macadam was subsequently somewhat involved in Australia when he assisted in getting financial support for the Australian Institute of International Affairs and organised some international conferences there."]}, {"page": "Chatham House", "response": ["1929 marked the next stage in the Institute's development, with the appointment of a full-time chief executive or director. Ivison Macadam was appointed to the position (Secretary and then Director-General),Chatham House: Its History and Inhabitants, C. E. Carrington, Revised and updated by Mary Bone, The Royal Institute of International Affairs, 2004. in which he oversaw the Institute's rapid expansion with its growing research, organisational and financial needs,Obituary of Ivison Macadam published in  The Times , London, 31 December 1974 by Kenneth Younger a role he occupied until 1955."]}, {"page": "King's College London Students' Union", "response": ["The first president was F. Hanson and for a number of years, it remained an all-male organisation until the arrival of female students in 1915. The most famous President of KCLSU was Sir Ivison Macadam who governed in 1922 and became the first President of the newly merged National Union of Students. An early honour board in the main building dates from 1908 with the name of the first President of the KCLSU."]}, {"page": "Sir Ivison Macadam", "response": ["#REDIRECT Ivison Macadam"]}, {"page": "Round Table movement", "response": ["*Sir Ivison Macadam", "Irish American academic Carroll Quigley believed that the Round Table Group was the front for a secret society for a global conspiracy of control set up by Cecil Rhodes named the Society of the Elect Quigley, Carroll : Tragedy & Hope: A History of the World in Our Time. G. S. G. & Associates, Incorporated (June 1975). ,  to implement Rhodes's 'plan' to unite all English-speaking nations,Conspiracy Encyclopedia Collins & Brown (2005) p179 and further believed that the elite of the British empire had an undue influence on the American elite. Sir Ivison Macadam thought Quigley was \"crazy\".May, Alexander The Round Table, 1910–66 DPhil. University of Oxford (1995) pp16-17 As one writer noted, the \"tragedy of Quigley was his conviction that he was outside of an inner circle that itself did not exist\"David P. Billington Jr Tragedy and Hope: Carroll Quigley and the 'Rhodes Conspiracy The American Oxonian 82/4 1994 p232"]}, {"page": "List of people associated with the University of London", "response": ["* Sir Ivison Macadam – first President of NUS and Director-General of Chatham House  (KCL)"]}, {"page": "Eastfield, Edinburgh", "response": ["* Ivison Macadam", "* William Ivison Macadam"]}, {"page": "List of alumni of King's College London", "response": ["*Sir Ivison Macadam – first President of NUS and Director-General of Chatham House"]}, {"page": "Macadam Cup", "response": ["The Macadam Cup is a varsity match played between the sports teams of King's College London proper (KCL) and Guy's, King's and St. Thomas' School of Medicine (GKT). The championship is named in honour of Sir Ivison Macadam, an alumnus of King's. Macadam also gave his name to a building at the King's Strand Campus, the location of the students' union (King's College London Students' Union)."]}, {"page": "Keep Calm and Carry On", "response": ["A career civil servant named A. P. Waterfield came up with \"Your Courage\" as \"a rallying war-cry that will bring out the best in everyone of us and put us in an offensive mood at once\".Lewis 2017, pp. 45–6. Others involved in the planning of the early posters included: John Hilton, Professor of Industrial Relations at Cambridge University, responsible overall as Director of Home Publicity; William Surrey Dane, managing director at Odhams Press; Gervas Huxley, former head of publicity for the Empire Marketing Board; William Codling, controller of HMSO; Harold Nicolson, MP; W. G. V. Vaughan, who became Director of the General Production Division (GPD); H. V. Rhodes, who later wrote an occasional paper on setting up a new government department; Ivison Macadam; \"Mr Cruthley\"; and \"Mr Francis\". Ernest Wallcousins was the artist tasked with creating the poster designs.Lewis 2017, pp. 42, 44, 47."]}]}}