{"wiki_id": "http://www.wikidata.org/entity/Q609458", "itemLabel": "Ben Daniels", "itemDescription": "British actor of stage and screen", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Daniels", "wikipedia_page": {"main": "Ben Daniels (born 10 June 1964) is an English actor. Initially a stage actor, Daniels was nominated for an Olivier Award for Best Supporting Actor for Never the Sinner (1991), the Evening Standard Award for Best Actor for 900 Oneonta (1994), Best Actor in the M.E.N. Theatre Awards for Martin Yesterday (1998), and won the 2001 Olivier Award for Best Supporting Actor for his performance in the Arthur Miller play All My Sons.\nIn 2008, Daniels made his Broadway début in a revival of Les Liaisons Dangereuses, for which he was nominated for the Tony Award for Best Actor in a Play. Daniels has also appeared on popular television series including Cutting It (2002–04), The Virgin Queen (2005), Law & Order: UK (2009–11), The Paradise (2013), House of Cards (2013–14), and The Exorcist (2016–17).\nOn 1 April 2018 he appeared in the NBC live televised concert rendition of Andrew Lloyd Webber and Tim Rice's rock opera Jesus Christ Superstar as Pontius Pilate. Daniels played Antony Armstrong-Jones, 1st Earl of Snowdon in the third season of Netflix series The Crown. Currently, Daniels stars in the role of Walter Sampson in the Netflix superhero series, Jupiter's Legacy.", "link_mentions": [{"page": "Saki", "response": ["Who Killed Mrs De Ropp?, a BBC TV production in 2007, starring Ben Daniels and Gemma Jones, showcased three of Saki's short stories, \"The Storyteller\", \"The Lumber Room\" and \"Sredni Vashtar\"."]}, {"page": "1964", "response": ["** Ben Daniels, English actor"]}, {"page": "Ian Fleming", "response": ["* Ian Fleming: Bondmaker, 2005. A television drama-documentary, first broadcast on BBC on 28 August 2005. Ben Daniels portrayed Fleming."]}, {"page": "Jesus Christ Superstar", "response": ["On Easter Sunday, 1 April 2018, NBC aired a live concert version of the show featuring John Legend as Jesus, Sara Bareilles as Mary Magdalene, Brandon Victor Dixon as Judas, Alice Cooper as King Herod, Norm Lewis as Caiaphas, Ben Daniels as Pilate, Jin Ha as Annas, Erik Grönwall as Simon Zealotes and Jason Tam as Peter."]}, {"page": "2001 in film", "response": ["| Conspiracy || HBO Films || Frank Pierson (director); Loring Mandel (screenplay); Kenneth Branagh, Stanley Tucci, Colin Firth, Ian McNeice, Kevin McNally, David Threlfall, Ewan Stewart, Brian Pettifer, Nicholas Woodeson, Jonathan Coy, Brendan Coyle, Ben Daniels, Barnaby Kay, Owen Teale, Peter Sullivan, Tom Hiddleston, Ross O'Hennessy, Claire Bullus, Simon Markey, David Glover, David Willoughby, David Spinx, Dirk Martens, Andreas Guenther, Florian Panzner, Hinnerk Schonemann, Sebastian Jacob, Paul Bannon, Nick Brown, Rod Culbertson, Karl Moffatt, Terence Mustoo || Biography, Drama, History, War || Live action"]}, {"page": "1998 in film", "response": ["| Passion in the Desert || Fine Line Features || Lavinia Currier (director/screenplay); Ben Daniels, Michel Piccoli, Paul Meston, Nadia Odeh || Adventure, Drama || Live action", "| Madeline || TriStar Pictures || Daisy von Scherler Mayer (director); Mark Levin, Jennifer Flackett (screenplay); Frances McDormand, Nigel Hawthorne, Hatty Jones, Stéphane Audran, Chantal Neuwirth, Ben Daniels, Kristian De La Osa, Clare Thomas, Bianca Strohmann, Rachel Dennis, Eloise Eonnet, Morgane Farcat, Pilar Garrard, Emilie Jessula, Alice Lavaud, Christina Mangani, Jessica Mason, Alix Ponchon, Arturo Venegas, Katia Caballero, Katia Tchenko, Emil Abossolo-Mbo, Julien Maurel, George Harris || Comedy, Family || Live action"]}, {"page": "Nuneaton", "response": ["* Ben Daniels, (born 1964) actor (born in Nuneaton)"]}, {"page": "Capital City (TV series)", "response": ["Recurring support and guest cast included Mark Burns as Peter Longman, grandson of the bank's founder, the eponymous Shane Longman, and 30 percent shareholder; Louise Lombard who appeared as Louise, a 17-year-old runaway who is befriended by Chas and is later assaulted by Jimmy; Faith Brook as Katherine Talbot, Hudson's mother; Charlotte Cornwell as Petra Allunson; Julia Ormond as Allison; Ben Daniels as Colin de Selincourt; and Pia Henderson, as Yolande, with whom Sirkka has a brief relationship."]}, {"page": "James Maxwell (actor)", "response": ["* Pride and Prejudice. World premiere adapted and directed by James Maxwell with Avril Elgar, Melanie Thaw, Rufus Sewell, Ben Daniels and Helen McCrory (1991)"]}, {"page": "Antony Armstrong-Jones, 1st Earl of Snowdon", "response": ["Armstrong Jones is portrayed in the Netflix series The Crown in season 2 by Matthew Goode and in season 3 by Ben Daniels."]}, {"page": "Alan Ruck", "response": ["In autumn 2016, Ruck began a 10-episode run on The Exorcist as Henry Rance, the husband (who has suffered mild brain damage in a vaguely explained accident) of Angela Rance (Geena Davis), better known as the adult Regan MacNeil, the tortured girl (played by Linda Blair) who is possessed by a demon in the 1973 hit film The Exorcist. This Fox TV adaptation is \"inspired by\" the 1971 William Peter Blatty best-selling novel. In this update, the demon that tortured Regan/Angela as a girl did not die as it did at the end of the feature film, and it now inhabits one of Angela and Henry's daughters. Once again, they must turn to exorcism-practicing priests (Alfonso Herrera and Ben Daniels) for help. Regan/Angela's mother, Chris MacNeil (played by recurring guest star Sharon Gless and Ellen Burstyn in the feature film), is welcomed by the rest of the family but utterly scorned by her own daughter."]}, {"page": "A Touch of Frost", "response": ["A number of young actors had their major debut as supporting cast in the show, including: Matt Bardock, Ben Daniels, Neil Stuke, Mark Letheren, Colin Buchanan, Jason Maza, Damian Lewis and Marc Warren."]}, {"page": "Josef Bühler", "response": ["In the 2001 HBO film  Conspiracy, which portrayed the Wannsee Conference, Bühler was played by the British actor Ben Daniels."]}]}}