{"wiki_id": "http://www.wikidata.org/entity/Q6099801", "itemLabel": "Ivy Benson", "itemDescription": "English bandleader", "wikipedia_url": "https://en.wikipedia.org/wiki/Ivy_Benson", "wikipedia_page": {"main": "Ivy Benson (11 November 1913 – 6 May 1993) was an English musician and bandleader, who led an all-female swing band. Benson and her band gained prominence in the 1940s, headlining variety theatres and topping the bill at the London Palladium, and became the BBC's resident house band.", "link_mentions": [{"page": "1913 in music", "response": ["*November 11 – Ivy Benson, bandleader (d. 1993)"]}, {"page": "Joe Meek", "response": ["He left the electricity board to work as an audio engineer for a leading independent radio production company which made programmes for Radio Luxembourg, and made his breakthrough with his work on Ivy Benson's Music for Lonely Lovers. His technical ingenuity was first shown on the Humphrey Lyttelton jazz single \"Bad Penny Blues\" (Parlophone Records, 1956) when, contrary to Lyttelton's wishes, Meek 'modified' the sound of the piano and compressed the sound to a greater than normal extent. The record became a hit. He then put enormous effort into Denis Preston's Landsdowne Studio but tensions between Preston and Meek soon saw Meek leaving. During his time he recorded US actor George Chakiris for SAGA Records and it was this that led him to Major Wilfred Alonzo Banks and an independent career. He also engineered many jazz and calypso records including vocalist and percussionist Frank Holder and band leader Kenny Graham."]}, {"page": "List of all-female bands", "response": ["* \"Ivy Benson's All Girls Band\" (United Kingdom)", "** Ivy Benson et al."]}, {"page": "All-female band", "response": ["In the Jazz Age and during the 1930s, \"all-girl\" bands such as the Blue Belles, the Parisian Redheads (later the Bricktops), Lil-Hardin's All-Girl Band, the Ingenues, the Harlem Playgirls led by the likes of Neliska Ann Briscoe and Eddie Crump, the International Sweethearts of Rhythm, Phil Spitalny's Musical Sweethearts, \"Helen Lewis and Her All-Girl Jazz Syncopators\" as well as \"Helen Lewis and her Rhythm Queenshttps://news.google.com/newspapers?nid=1144&dat=19310630&id=BXAbAAAAIBAJ&sjid=TksEAAAAIBAJ&pg=6676,5490073&hl=enhttp://stacyharris.com/dnakin.html  were popular. Dozens of early sound films were made of the vaudeville style all-girl groups, especially short subject promotional films for Paramount and Vitaphone. (In 1925, Lee de Forest filmed Lewis and her band in his short-lived Phonofilm process, in a film now in the Maurice Zouary collection at the Library of Congress.) Blanche Calloway, sister of Cab Calloway, led a male band, Blanche Calloway and Her Joy Boys, from 1932 to 1939, and Ina Ray Hutton led an all-girl band, the Melodears, from 1934 to 1939. Eunice Westmoreland, under the name Rita Rio, led an all-girl band appearing on NBC Radio and in short subjects for Vitaphone and RKO before changing her career to acting and her professional name to Dona Drake, appearing in numerous 1940s movies. Ivy Benson's \"All Girls Band\" was the BBC's resident dance band in 1943 and toured until the 1980s. All-girl bands active in vaudeville, variety shows, and early sound films during the 1920s to the 1950s are documented by Kristin McGee in Some Liked it Hot: Jazz Women in Film and Television. Sally Placksin, Linda Dahl, D. Antoinette Handy, and Frank Driggs along with professor Sherrie Tucker, in her book Swing Shift: \"All-Girl\" Bands of the 1940s, have also documented this era. A Polish group Filipinki was established in 1959."]}, {"page": "Beeston, Leeds", "response": ["The musician and bandleader Ivy Benson grew up in Beeston, where her former house on Cemetery Road is marked with a blue plaque."]}, {"page": "List of jazz saxophonists", "response": ["* Ivy Benson (1913–1993) (alto)"]}, {"page": "Weston-on-Trent", "response": ["There were two ferries at Weston, one at Weston Cliff and the other at King's Mill which ceased trade in 1942. This ferry crossed the river at the end of King's Mill Lane closest to Castle Donington. After World War II Weston-on-Trent became home to the Ukrainian Youth Association (CYM) in the UK,Ukrainian Youth Association Web Site which took over one of the camps which had been set up during the War. One of these camps had hosted concerts by Vera Lynn, Glenn Miller and Ivy Benson.Change in a Derbyshire Village: Weston-on-Trent 1900–1950 Yvonne Smalley and Margery Trantor Weston LHS "]}, {"page": "Benson (surname)", "response": ["*Ivy Benson (1913–1993), British bandleader"]}, {"page": "1993 in the United Kingdom", "response": ["** Ivy Benson, bandleader (born 1913)"]}, {"page": "List of people from Leeds", "response": ["* Ivy Benson - bandleader "]}, {"page": "Holbeck", "response": ["* Ivy Benson (1913–1993), bandleader."]}, {"page": "Annie Whitehead", "response": ["Whitehead learned the trombone in high school and participated in rock and jazz bands. When she was 16, she left school to become a member of a female big band led by Ivy Benson. She played with the band for two years before moving to Jersey. Unhappy with the life of a musician, she quit music for almost six years. She returned in 1979 and started a ska band. She took an interest in jazz again after moving to London two years later and performing in pubs. In the 1980s, she toured with Brotherhood of Breath, a big band led by South African pianist Chris McGregor."]}, {"page": "1913 in the United Kingdom", "response": ["* 11 November – Ivy Benson, bandleader (died 1993)"]}, {"page": "List of British big band leaders", "response": ["*Ivy Benson"]}, {"page": "Sheila Tracy", "response": ["Sheila Lugg was born in Mullion, Cornwall in 1934. She attended Truro Girls School and studied piano, violin and trombone at the Royal Academy of Music, then was a member of the Ivy Benson All Girls Band between 1956 and 1958. Subsequently, she formed a vocal/trombone duo, The Tracy Sisters, who appeared in variety, on radio and television, as well as in cabaret all over the world. When the act broke up, she joined BBC Television as an announcer and worked mostly in television until 1974 when she became the first female newsreader on BBC Radio 4 on 16 July. She also qualified as a Special Policewoman in London.", "* Ivy Benson Big Band website"]}, {"page": "Josephine Bradley", "response": ["Bradley became one of the few women to lead a British band between 1920–1950; others included Ivy Benson and Mrs. Jack Hilton. Bradley set up her group in 1935,p35 mainly as a recording band for Decca: Josephine Bradley and her Ballroom Orchestra. She had already, in 1930, directed the New Mayfair Dance Orchestra for HMV. Between March 1937 and October 1945 she recorded over 200 sides for Decca. Bradley's recordings sold well, and represent \"the very best of ballroom music over half a century after they were made\".Tony Watts, liner notes to Josephine Bradley & her Orchestra. Flapper PAST CD 7092."]}, {"page": "Duncan Campbell (trumpeter)", "response": ["Duncan Campbell (born May 1926) is a British trumpet player who plays with Ted Heath and his Orchestra, Ronnie Scott, Syd Lawrence and the BBC Big Band. He is married to June Pressley, Elvis Presley's cousin and regular of the Ivy Benson Band."]}, {"page": "Gracie Cole", "response": ["Grace Elizabeth Agnes Annie Cole (8 September 1924 – 28 December 2006) was a British trumpeter and bandleader. She was lead soloist in Ivy Benson's all-girls band during the 1940s, going on to form her own all-female band in the 1950s.", "Later in 1942 Cole switched to being a dance band trumpeter, initially joining Gloria Gaye's All Girls Band, who toured playing theatres and forces entertainment shows organised by the Entertainments National Service Association (ENSA). She then joined Rudy Starlita's All-American band, entertaining American G.I.s. In November 1945 she joined Ivy Benson's band as lead trumpet and soloist, and toured with them for the next five years, headlining at variety theatres in Britain and touring Europe and the Middle East with ENSA. The band also featured on television and radio, including their own radio series Ladies Night, and on Christmas Day 1945 Cole was the featured soloist on a live broadcast from Hamburg immediately after the King's speech."]}, {"page": "The Dummy Talks", "response": ["* Ivy Benson and her all Ladies Band - Themselves"]}, {"page": "Lydia D'Ustebyn Ladies Swing Band", "response": ["Lydia D'Ustebyn's Ladies Swing Orchestra was a British feminist swing band of all female musicians. Lydia D'Ustebyn was not a real person, but a fictional character based on Ivy Benson - a famous London woman band leader. The band would frequently apologize that Lydia was absent from performances, because she had \"missed the train.\""]}, {"page": "Sweet & Swing", "response": ["Of particular renown was the work of Joe Loss who spent several seasons playing at the Villa Marina, Douglas, Isle of Man during the 1950s. Another artist performing in Douglas during the immediate post-war years, and who was also acquainted with Jim Caine, was Ivy Benson. Later Bud Freeman became known to Jim Caine, with Freeman staying at the family home where he was introduced to the young Howard. Said to have been a keen player of the game Scrabble, Bud Freeman also left a token to the family consisting of one of his coats. The coat has been kept for posterity and is referred to as the \"Bud Coat\"."]}, {"page": "Women in rock", "response": ["In the Jazz Age and during the 1930s, all-female bands such as The Blue Belles, the Parisian Redheads (later the Bricktops), Lil-Hardin's All-Girl Band, The Ingenues, The Harlem Playgirls, Phil Spitalny's Musical Sweethearts and \"Helen Lewis and Her All-Girl Jazz Syncopators\" were popular. Ina Ray Hutton led an all-girl band, the Melodears, from 1934 to 1939.  Eunice Westmoreland, under the name Rita Rio, led an all-female band appearing on NBC Radio and for Vitaphone and RKO. Ivy Benson's \"All Girls Band\" was the BBC's resident dance band in 1943 and toured until the 1980s.  A Polish group Filipinki was established in 1959."]}, {"page": "Villa Marina, Isle of Man", "response": ["For several summer seasons in the 1950s the Villa Marina was home to Joe Loss and his orchestra. Other stars performing at that time included Ivy Benson and various international cabaret artistes. During the summer months the Villa gardens would also be the venue for numerous beauty pageants."]}, {"page": "Rita Lawrence", "response": ["She moved to London in 1934 and during the war she would play at bottle parties in Soho bars. She would have like to have been a concert pianist but she obtained work as a singer or a pianist where she was an unusual black performer. She danced with Adelaide Hall and Fats Waller. Her name was changed at the suggestion of Fela Sowande who included her in his Jubilee Singers. She then sang with Rudolph Dunbar's dance band and met Ivy Benson. She met the Cuban Don Marino Barreto (1907–1995) and he encouraged her career. He persuaded her that she should train again at the Guildhall School of Music and in return he would teach her Latin-American rhythm. She played piano in his band and they became a couple."]}, {"page": "Betty Smith (musician)", "response": ["Smith later joined the Ivy Benson Orchestra in 1948 and flew into Berlin to perform for troops when the city's blockade started. She married the trumpeter Jack Peberdy in August 1950 (after being introduced to him by her father at the saxophonist's 19th birthday party). Smith joined Freddy Randall's band the same year, and she and her husband worked full-time for the trumpeter from 1953 to February 1957. In 1956, the band travelled to the United States, in exchange for the visit of Louis Armstrong to the United Kingdom. Racial tensions were high in the era and in one theatre in North Carolina where she was performing the band was evacuated because of a bomb. Smith toured with the same programme as Bill Haley & His Comets, and found some success when her recording of Bewitched, Bothered and Bewildered reached the American hit parade, garnering admiration with some of the country's famous musicians. Smith was voted one of Britain's best tenor-saxophone players in a 1957 Melody Maker poll."]}, {"page": "Jim Caine (jazz pianist)", "response": ["Often referred to as \"The Maestro\" due to his encyclopedic knowledge of the artists and bands of the Swing and Big Band eras, Caine's presentational style was relaxed and light-hearted, and on occasion he would recall various meetings with band leaders and solo artists, including Joe Loss, Ivy Benson, Bud Freeman and Humphrey Lyttleton."]}, {"page": "June Smith (jazz singer)", "response": ["June Robinson was born in Edinburgh, Scotland on June 9, 1930. Her mother was a singer and pianist and her father was a saxophonist. At 16, she officially began her performing career as a singer and trumpeter with the girls' band of Blanche Coleman. Three years later she became a member of \"Britain’s most famous all female swing band, Ivy Benson and Her All Girl Orchestra,\" performing in British music halls and during several overseas tours, including North Africa, to entertain the armed forces. Bands like Benson's were formed during World War II when most male musicians were called up for combat duty. "]}]}}