{"wiki_id": "http://www.wikidata.org/entity/Q6106285", "itemLabel": "J. L. Manning", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/J._L._Manning", "wikipedia_page": {"main": "James Lionel Manning OBE (10 January 1914 – 18 January 1974) was a British sports columnist for the Daily Mail. Born in Bristol, then in the County of Gloucestershire, in 1914, Manning was the eldest son of sports writer Lionel Victor Manning, and the elder half-brother of Brian Stuart Manning (1927–2004) a leading British Marxist historian.", "link_mentions": [{"page": "Norris McWhirter", "response": ["In 1954, the McWhirter brothers sued Daily Mail sports writer J. L. Manning for his critical piece about non-journalist (i.e. not members of the National Union of Journalists) sports writers. The McWhirters were awarded £300 in damages."]}, {"page": "Tom Simpson", "response": ["On the next racing day, the other riders were reluctant to continue racing and asked the organisers for a postponement. France's Stablinski suggested that the race continue, with a British rider, whose team would wear black armbands, allowed to win the stage. Hoban won the stage, although many thought the stage winner should have been Denson, Simpson's close friend. Media reports suggested that his death was caused by heat exhaustion, until, on 31 July 1967 British journalist J. L. Manning of the Daily Mail broke the news about a formal connection between drugs and Simpson's death. French authorities confirmed that Simpson had traces of amphetamine in his body, impairing his judgement and allowing him to push himself beyond his limits. His death contributed to the introduction of mandatory testing for performance-enhancing drugs in cycling, leading to tests in 1968 at the Giro d'Italia, Tour de France and Summer Olympics. Simpson was buried in Harworth Cemetery, after a service at the 12th-century village church attended by an estimated 5,000 mourners, including Peugeot teammate Eddy Merckx, the only continental rider in attendance. The epitaph on Simpson's gravestone in Harworth cemetery reads, \"His body ached, his legs grew tired, but still he would not give in\", taken from a card left by his brother, Harry, following his death."]}, {"page": "Katy Manning", "response": ["Manning was born in Guildford, Surrey, the younger daughter of politician turned sports columnist J. L. Manning OBE and Amy Manning (née Jenkins); her elder sister Jane Dressler (née Manning) moved to New York City, U.S. and became a fashion model for Eileen Ford. Manning spent her early years in Dulwich Village. Due to Manning being severely myopic, teachers failed to understand her condition and she was teased by the other children for having poor eyesight and wearing large glasses. After finishing primary school, Manning attended Miss Dixon and Miss Wolfe's School for Girls where she became best friends with classmate Liza Minnelli, daughter of Judy Garland, and spent a lot of time at Garland and Sidney Luft's home in Chelsea. Manning socialised with stars such as James Mason and Dirk Bogarde, and had tea with Noël Coward at The Savoy. As a teenager, Manning became a model for Biba. Aged sixteen, Manning was involved in a horrific car crash after the driver, her boyfriend Brian Gascoigne (brother of Bamber Gascoigne), fell asleep at the wheel.  The car, which had no seatbelts, careered over a roundabout and crashed into a garage. Manning was thrown through the windscreen and through a plate glass window ending up on the bonnet of the car. Her back and both her legs were broken and her face was disfigured; the other occupants of the car were unharmed. It took nine policemen to retrieve Manning from the wreckage and she later said of her injuries that her \"eye and mouth on one side of her face sort of met\". Manning was taken to hospital in the police car as they thought she would not survive the time for an ambulance to arrive.  She had to spend nearly two years recovering in hospital and had to have her head shaved and several skin grafts on her face, as well as reconstructive surgery at Queen Victoria Hospital in East Grinstead. Manning suffered an embolism and had to have both her legs pinned which put an end to her dreams of becoming a dancer. "]}, {"page": "Brian Manning (historian)", "response": ["Manning's father was sports writer Lionel Manning and his half-brother was Daily Mail sports columnist and one-time Conservative candidate J. L. Manning. Manning was the uncle of Doctor Who actor Katy Manning. "]}, {"page": "JL Manning", "response": ["#REDIRECT J. L. Manning"]}, {"page": "Death of Tom Simpson", "response": ["Initial media reports suggested that Simpson's death was caused by heat exhaustion, until, on 31 July 1967, British journalist J. L. Manning of the Daily Mail broke the news about a formal connection between drugs and Simpson's death: \"Tommy Simpson rode to his death in the Tour de France so doped that he did not know he had reached the limit of his endurance. He died in the saddle, slowly asphyxiated by intense effort in a heatwave after taking methylamphetamine drugs and alcoholic stimulants.\""]}]}}