{"wiki_id": "http://www.wikidata.org/entity/Q610596", "itemLabel": "Guy Stewart Callendar", "itemDescription": "British engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Guy_Stewart_Callendar", "wikipedia_page": {"main": "Guy Stewart Callendar (; February 1898 – October 1964) was an English steam engineer and inventor.  His main contribution to human knowledge was developing the theory that linked rising carbon dioxide concentrations in the atmosphere to global temperature. He was the first to demonstrate that the Earth’s land temperature had increased over the previous 50 years in 1938. This theory, earlier proposed by Svante Arrhenius, has been called the Callendar effect.  Callendar thought this warming would be beneficial, delaying a \"return of the deadly glaciers.\"", "link_mentions": [{"page": "Timeline of meteorology", "response": ["* 1938 – Guy Stewart Callendar first to propose global warming from carbon dioxide emissions."]}, {"page": "1898 in science", "response": ["* February – Guy Stewart Callendar (died 1964), English-Canadian thermodynamic engineer and climatologist."]}, {"page": "Scientific phenomena named after people", "response": ["* Callendar effect – Guy Stewart Callendar"]}, {"page": "1964 in science", "response": ["* October – Guy Stewart Callendar (born 1898), English thermodynamic engineer and climatologist."]}, {"page": "Keeling Curve", "response": ["Prior to the 1950s, measurements of atmospheric  concentrations had been taken on an ad hoc basis at a variety of locations. In 1938, engineer and amateur meteorologist Guy Stewart Callendar compared datasets of atmospheric  from Kew in 1898–1901, which averaged 274 parts per million by volume (ppmv), and from the eastern United States in 1936–1938, which averaged 310 ppmv, and concluded that  concentrations were rising due to anthropogenic emissions. However, Callendar's findings were not widely accepted by the scientific community due to the patchy nature of the measurements."]}, {"page": "Callendar effect", "response": ["#REDIRECT Guy Stewart Callendar"]}, {"page": "Callendar Effect", "response": ["#REDIRECT Guy Stewart Callendar "]}, {"page": "Callendar", "response": ["* Guy Stewart Callendar (1898 – 1964), English steam engineer and inventor and son of Hugh Longbourne Callendar", "* Hugh Longbourne Callendar (1863 – 1930), British physicist and father of Guy Stewart Callendar"]}, {"page": "List of English inventions and discoveries", "response": ["* 1938–1964: The Callendar effect, a theory linking rising carbon dioxide concentrations in the atmosphere to global temperature (Global warming), proposed by Guy Stewart Callendar (1898–1964)."]}, {"page": "Climate change", "response": ["Svante Arrhenius noted that water vapour in air continuously varied, but the  concentration in air was influenced by long-term geological processes. At the end of an ice age, warming from increased  levels would increase the amount of water vapour, amplifying warming in a feedback loop. In 1896, he published the first climate model of its kind, showing that halving of  levels could have produced the drop in temperature initiating the ice age. Arrhenius calculated the temperature increase expected from doubling  to be around 5—6 °C. Other scientists were initially sceptical and believed the greenhouse effect to be saturated so that adding more  would make no difference. They thought climate would be self-regulating.;  From 1938 onwards Guy Stewart Callendar published evidence that climate was warming and  levels increasing,; . but his calculations met the same objections."]}, {"page": "Hockey stick graph", "response": ["Paleoclimatology influenced the 19th century physicists John Tyndall and Svante Arrhenius who found the greenhouse gas effect of carbon dioxide () in the atmosphere to explain how past ice ages had ended. From 1919 to 1923, Alfred Wegener did pioneering work on reconstructing the climate of past eras in collaboration with Milutin Milanković,introduction to the English edition, The Climates of the Geological Past, (2015), retrieved 28 August 2015 publishing Die Klimate der geologischen Vorzeit (\"The Climates of the Geological Past\") together with Wladimir Köppen, in 1924.Köppen, W. &  Wegener, A. (1924): Die Klimate der geologischen Vorzeit,  Borntraeger Science Publishers. In English as The Climates of the Geological Past (2015).  In the 1930s Guy Stewart Callendar compiled temperature records to look for changes. Wilmot H. Bradley showed that annual varves in lake beds showed climate cycles, and A. E. Douglass found that tree rings could track past climatic changes but these were thought to only show random variations in the local region. It was only in the 1960s that accurate use of tree rings as climate proxies for reconstructions was pioneered by Harold C. Fritts."]}, {"page": "Hugh Longbourne Callendar", "response": ["He died at home in Ealing, after an operation in 1930.Fleming, James Rodger (2007) The Callendar Effect: The Life and Work of Guy Stewart Callendar (1898–1964), the Scientist Who Established the Carbon Dioxide Theory of Climate Change. American Meteorological Society. ", "He married Victoria Mary Stewart, whom he met at Cambridge, in 1894 in England. They had a daughter, Cecil (1895), and three sons, Guy Stewart Callendar (1898), Leslie Hugh (1896) and Maxwell Victor (1905). Guy Stewart proposed the effect of carbon dioxide emissions on the climate, known as 'The Callendar Effect'."]}, {"page": "Climate change denial", "response": ["Research on the effect of  on the climate began in 1824, when Joseph Fourier inferred the existence of the atmospheric \"greenhouse effect\". In 1860, John Tyndall quantified the effects of greenhouse gases on absorption of infrared radiation. Svante Arrhenius in 1896 showed that coal burning could cause global warming, and in 1938 Guy Stewart Callendar found it already happening to some extent.: \"The doubts and confusion of the American people are particularly peculiar when put into historical perspective\" Research advanced rapidly after 1940; from 1957, Roger Revelle alerted the public to risks that fossil fuel burning was \"a grandiose scientific experiment\" on climate.: \"From the late 1940s into the 1960s, many of the papers cited in these essays carried a thought-provoking footnote: \"This work was supported by the 'Office of Naval Research.' \" NASA and NOAA took on research, the 1979 Charney Report concluded that substantial warming was already on the way, and \"A wait-and-see policy may mean waiting until it is too late.\": quote p. viii in the Foreword by Climate Research Board chair Verner E. Suomi"]}, {"page": "List of British innovations and discoveries", "response": ["*Callendar effect the theory that linked rising carbon dioxide concentrations in the atmosphere to global temperature (Global warming) – Guy Stewart Callendar"]}, {"page": "List of climate scientists", "response": ["* Guy Stewart Callendar, English,(February 1898-October 1964), steam engineer and inventor who proposed what eventually became known as the Callendar effect, the theory that linked rising carbon dioxide concentrations in the atmosphere to global temperature"]}, {"page": "History of climate change science", "response": ["In 1938 Guy Stewart Callendar attempted to revive Arrhenius's greenhouse-effect theory. Callendar presented evidence that both temperature and the  level in the atmosphere had been rising over the past half-century, and he argued that newer spectroscopic measurements showed that the gas was effective in absorbing infrared in the atmosphere. Nevertheless, most scientific opinion continued to dispute or ignore the theory."]}, {"page": "G.S. Callendar", "response": ["#redirectGuy Stewart Callendar"]}, {"page": "G. S. Callendar", "response": ["#redirectGuy Stewart Callendar"]}, {"page": "G.S. Calendar", "response": ["#redirectGuy Stewart Callendar"]}, {"page": "G. S. Calendar", "response": ["#redirectGuy Stewart Callendar"]}, {"page": "Guy Stewart Calendar", "response": ["#redirectGuy Stewart Callendar"]}, {"page": "Guy Stuart Calendar", "response": ["#redirectGuy Stewart Callendar"]}, {"page": "Guy Stuart Callendar", "response": ["#redirectGuy Stewart Callendar"]}, {"page": "20th century in science", "response": ["In 1938 Guy Stewart Callendar attempted to revive Arrhenius's greenhouse-effect theory. Callendar presented evidence that both temperature and the  level in the atmosphere had been rising over the past half-century, and he argued that newer spectroscopic measurements showed that the gas was effective in absorbing infrared in the atmosphere. Nevertheless, most scientific opinion continued to dispute or ignore the theory."]}, {"page": "Guy Callendar", "response": ["#redirect Guy Stewart Callendar"]}]}}