{"wiki_id": "http://www.wikidata.org/entity/Q6109350", "itemLabel": "Rob Norbury", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Rob_Norbury", "wikipedia_page": {"main": "Rob Norbury is a British actor most popular for portraying Donnie Briscoe in CBBC drama Grange Hill, Riley Costello in the Channel 4 soap opera Hollyoaks and Leon in Emmerdale.\nNorbury grew up in Oldham. Norbury is involved in the restaurant business, opening a restaurant called Muse in Uppermill and taking over a pub called The Farrars Arms in Grasscroft.", "link_mentions": [{"page": "Rhys Ashworth", "response": ["Rhys and Jacqui struggle with money so get a lodger Ally Gorman (Dan O'Connor) to help with the bills. When Mercedes, Jacqui's sister, becomes depressed after her fiancé Riley Costello (Rob Norbury) with their son Bobby Costello (Jakob Chialton) leaves her Rhys goes to help her out however Mercedes kisses him and when he tells Jacqui he unknowingly causes a rift between the sisters. Rhys begins a passionate affair with Cindy Cunningham (Stephanie Waring). Myra witnesses them kiss and tells Rhys to end the affair or she will tell Jacqui. Cindy ends the relationship with Rhys, when Tony loses his eyesight following an off-screen crash in the fated mini-bus. Cindy realises she wants to instead be with her fiancé Tony Hutchinson (Nick Pickard). Cindy and Rhys kiss, which she tells him is a way of saying goodbye as she loves Tony. Tony witnesses this, as he had recovered his eyesight, although Cindy is unaware of this."]}, {"page": "Mercedes McQueen", "response": ["Mercedes is described as a \"savvy, ballsy girl that can't say no and is unapologetic about it\". She is played as having moments of happiness which she ruins for herself and as managing to justify \"whatever she does that's bad\". Throughout her time on the series, Mercedes' storylines have centered on her relationships. These include her marriages to Russ Owen (Stuart Manning), Malachy Fisher (Glen Wallace) and Dr. Paul Browning (Joseph Thompson), with her second marriage involving her in an HIV storyline, an engagement to Riley Costello (Rob Norbury) and a committed relationship with Joe Roscoe (Ayden Callaghan). She has also been central to several affairs which included Calvin Valentine (Ricky Whittle), her sister's husband, and Riley's father Carl (Paul Opacic). Following the revelation of her affair with Carl on her wedding day to Riley, Mercedes was at the centre of a kidnapping storyline when she was held against her will by Riley's serial killer grandfather, Silas Blissett (Jeff Rawle), before going into labour, giving birth to a boy as a result of the stress. Following her ordeal Mercedes briefly turned to prostitution. When Mitzeee (Rachel Shenton) grows close to Riley, Mercedes begins to stalk her. During the culmination of the plot, in \"pure desperation\" Mercedes stabs herself and Mitzeee is blamed. Mercedes' friend, Lynsey Nolan (Karen Hassan), discovers Mercedes' stalking of Mitzeee and stabbing of herself. Lynsey is later murdered in a \"whodunit\" storyline with Mercedes becoming a suspect in her murder. It is later revealed Mercedes' partner Doctor Browning killed Lynsey to protect Mercedes and in October 2013, Mercedes, Cindy Cunningham (Stephanie Waring) and Lindsey Butterfield (Sophie Austin) attacked, murdered and covered up the murder of Doctor Browning. In the run-up to her 2014 departure, Mercedes was involved in feuds with Freddie Roscoe (Charlie Clapham) and Grace Black (Tamara Wall) and mourning for her sister Carmel (Gemma Merna) following a train crash, which Mercedes was also involved in. Since her return in February 2015, her storylines have included reuniting with her family, her relationship with Joe and delivering a stillborn son named Gabriel, exposing Lindsey as the Gloved Hand Killer, Silas returning and targeting her again, and her feud with Joanne Cardsley (Rachel Leskovac) over Joe, who later dies during the show's \"Halloween Spooktacular\" episodes. In late 2019, the character finds herself at the centre of another \"whodunit\" storyline, \"Who Shot Mercedes?\", where she is shot having angered numerous residents.", "Mercedes' next relationship was with Riley Costello (Rob Norbury); their first romantic encounter occurred in the episodes following Malachy's death. Metcalfe believed that this behavior was typical of Mercedes. Malachy had died and rather than \"moping\" about she chooses to get on with her life. Riley filled the role of giving Mercedes some attention \"when she needs it most\". The serial introduced complications with Riley and Mercedes' relationship with the introduction of Riley's father Carl Costello (Paul Opacic). Carl's disapproval of Mercedes created tension between them and she \"hits a nerve\" by jibing Carl. Metcalfe explained that Mercedes asked Carl what he would do if she stayed with Riley. In an effort to \"wind him up\", Mercedes suggested that she and Carl sleep together; Metcalfe stated that it was \"obvious he's tempted\", and Mercedes and Carl start an affair. Opacic told a reporter from Inside Soap that Mercedes and Carl felt guilty about their tryst, but suggested that viewers keep watching to see if the two could \"stay away from each other\". He added that while Riley believed Mercedes was \"the girl of his dreams\", Carl believed that Mercedes was not \"good enough\" for his son."]}, {"page": "List of Grange Hill characters", "response": ["| Rob Norbury"]}, {"page": "List of Hollyoaks characters (2010)", "response": ["Jem Costello, played by Helen Russell-Clark, made her first on-screen appearance on 5 March 2010. The character was created as the love interest of Gilly Roach (Anthony Quinlan). She is the daughter of Carl Costello (Paul Opacic), stepdaughter of Heidi Costello (Kim Tiddy) and the half sister of Riley (Rob Norbury), Seth and Jasmine. Jem has been described as quite feisty and a \"freespirit\".", "Carl Costello, played by former Emmerdale actor Paul Opacic, made his first on-screen appearance on 19 July 2010. Opacic's casting was announced on 12 April 2010. He is the husband of Heidi (Kim Tiddy) and the father of Jem (Helen Russell-Clark), Riley (Rob Norbury), Seth (Miles Higson) and Jasmine (Victoria Atkin). Carl has been described as a \"self-assured smooth operator who's charming, but will play things underhand\".", "Riley Costello, played by former Grange Hill actor Rob Norbury, made his first on-screen appearance on 20 July 2010. Norbury's casting was announced on 12 April 2010. He is the son of Carl (Paul Opacic) and Heidi Costello (Kim Tiddy) and the brother of Jem (Helen Russell-Clark), Seth (Miles Higson) and Jasmine (Victoria Atkin). Riley has been described as a \"Jack-the-lad\" and a \"lothario\".", "Heidi Costello, played by former The Bill actress Kim Tiddy, made her first on-screen appearance on 20 July 2010. Tiddy's casting was announced on 12 April 2010. She is the wife of Carl Costello (Paul Opacic) and the mother of Riley (Rob Norbury), Seth (Miles Higson) and Jasmine (Victoria Atkin). Heidi has been described as \"strong, glamorous and slightly insecure\".", "Jason Costello, played by Victoria Atkin, made her first on-screen appearance on 2 August 2010. Atkins's casting was announced on 1 July 2010 where it was revealed that \"Jasmine\" would suffer from Gender Identity Disorder. He is the son of Carl (Paul Opacic) and Heidi Costello (Kim Tiddy), the brother of Jem (Helen Russell-Clark) and Riley (Rob Norbury) and the twin of Seth (Miles Higson). \"Jasmine\" has been described as a \"cosseted, overly protected little girl\".", "Liam arrives in Hollyoaks, where he spies on Jem's brothers, Riley (Rob Norbury) and Seth (Miles Higson). Jem and Liam go on a date, and Jem explains why she left him. Liam then invites Riley and Seth to a cage fighting party, where Liam is fighting. At the party, Liam and older brother Nathan plot their revenge on the Costellos. At a house party later in the night, Liam drowns Seth in a Jacuzzi. However, he survives. Meanwhile, Riley is drugged. Nathan locks Seth and Riley in a cage and forces them to fight, as Carl is tied up by a noose. Seth and Riley reluctantly fight each other. However, Nathan's girlfriend Sami enters and frees them. Seth, Riley and Carl leave and run through woods. Liam and Nathan follow with a gun. They follow onto a rooftop and Nathan falls onto a spike, killing him, as Liam is arrested. Liam returns and rekindles his relationship with Jem, plotting to destroy Carl by getting Mitzeee (Rachel Shenton) to sleep with him. However, Liam cheats on Jem with Mitzeee.", "Trev introduces himself as a camp French interior designer named Alphonse. He redecorates the kitchen and living area of the Costellos' house in The Dog in the Pond. His nephew Seth Costello (Miles Higson) convinces Duncan Button (Dean Aspen) that Alphonse fancies him. He later appears when Cheryl Brady (Bronagh Waugh) hires him to redecorate Chez Chez at the SU Bar. Cheryl's brother Brendan Brady (Emmett J. Scanlan) is homophobic towards Alphonse and tries to attack him when Alphonse suggests Brendan is gay. Trev sleeps (still posing as Alphonse) with Cheryl. The day after his nephew Riley Costello (Rob Norbury) convinces him to come clean about who he really is to Cheryl. He reveals to Cheryl his name is Trev and is married with three kids.", "|  Logan is a police officer and is friends with Riley Costello (Rob Norbury). Logan meets Theresa McQueen (Jorgie Porter) at a cage fight and becomes attracted to her. Logan and Theresa grow close during a party at a footballer's house and eventually share a kiss. However, pregnant Theresa's waters break and she goes into labour. Logan arrives at hospital to see Theresa, but Theresa's cousin Jacqui McQueen (Claire Cooper) makes her send Logan away so we will never discover Theresa's murder of Calvin Valentine (Ricky Whittle)."]}, {"page": "Riley Costello", "response": ["Riley Costello is a fictional character from the British Channel 4 soap opera, Hollyoaks, played by Rob Norbury. Riley was introduced on 20 July 2010 with the Costello family as part of a cast overhaul of the series. In December 2011, the serial's executive producer Emma Smithwick said that Riley would remain in Hollyoaks despite his family's departure. On 14 September 2012, it was announced Riley was to leave Hollyoaks and Riley was killed off in a shooting during the episode airing 3 October 2012.", "In 2010, auditions were held for the part of Riley, a young footballer and member of the Costello clan. Former Grange Hill and Hollyoaks: In the City actor Rob Norbury was cast in the role. The Costellos were introduced as the family of already-established character Jem Costello (Helen Russell-Clark). The family consists of Carl Costello (Paul Opacic), a former premiership footballer with a history for cheating on his wife, Heidi (Kim Tiddy), a former model, and their children, Riley, who is training to become a footballer to impress his father, Seth (Miles Higson), who is desperate to step out from his older brother's shadow, and Jasmine (Victoria Atkin), who is secretly suffering due to gender dysphoria. Speaking of the family's casting, Marquess said, \"We can't wait for this huge new boost of energy exploding on screen. These exciting new characters join our fantastic core cast. Together they will ensure that 2010 will be a year to remember on Hollyoaks.\"", "Rob Norbury was nominated for the Sexiest Male award in the 2011 Inside Soap Awards A writer for the Sunday Mercury said Riley's time away from the village had \"certainly toughened him up\". Gemma Graham and Jon Horsley of TV Buzz said that Riley and Lynsey are \"a coupling we could definitely get on board with\"."]}, {"page": "Seth Costello", "response": ["On 12 April 2010, media entertainment website Digital Spy reported that a new family, the Costello's, would be introduced to Hollyoaks as part of the soap's ongoing rejuvenation. Newcomer Miles Higson was cast in the role of Seth Costello, the youngest son of ex-model Heidi (Kim Tiddy) and former footballer Carl Costello (Paul Opacic), the brother of Riley (Rob Norbury) and the twin brother of Jasmine (Victoria Atkin). Fifteen-year-old Seth was described as \"desperate to prove himself to his parents\" and \"wants to step out of his brother's shadow\". Of the castings, Hollyoaks series producer Paul Marquess stated: \"We can't wait for this huge new boost of energy exploding on screen. These exciting new characters join our fantastic core cast. Together they will ensure that 2010 will be a year to remember on Hollyoaks.\""]}, {"page": "Hollyoaks Later (series 3)", "response": ["| Rob Norbury"]}, {"page": "Silas Blissett", "response": ["Silas was credited as \"Mystery Man\" in his first episode to keep his identity hidden. He is revealed to be Heidi Costello's (Kim Tiddy) father and the grandfather of Riley Costello (Rob Norbury), Seth Costello (Miles Higson) and Jason Costello (Victoria Atkin). Silas is a serial killer who is described as sinister, scary and complex. Marquess called him mild-mannered and likened him to a bogeyman. Daniel Kilkelly of Digital Spy described Silas as a dual role of the affable older man and sinister killer. Silas is \"old-fashioned\" and dislikes women with \"loose morals\"; believing his murders as a positive, cleansing service to society.", "Silas is angry with Lynsey Nolan (Karen Hassan) after hearing her give sexual health advice on the radio, and seeing her on the radio's webcam wearing a scantily clad nurse costume. Silas stops Lynsey from gaining a promotion by telling her place of work about the radio show. Silas attacks Lynsey but her screams alert her neighbours, causing him to flee. Lynsey realises that Silas was her attacker and confronts him on numerous occasions, but her allegation is ignored. Lynsey also accuses Silas of murdering India and his grandson, Riley Costello (Rob Norbury), begins to question Lynsey's allegations. Silas experiences a heart attack after Riley questions him. In hospital, Lynsey is assigned as Silas's nurse and withholds his treatment as she assumes he is feigning the attack. Silas later recovers. Silas sees Lynsey giving Cheryl Brady (Bronagh Waugh) weight loss drugs and secretly swaps them with his heart medication. Cheryl takes the medication more frequently to suppress her appetite. Whilst Cheryl is alone in her nightclub, she climbs upon the bar and becomes drowsy, causing her to fall. She is found unconscious by Lynsey and begins to recover in hospital. Lynsey is told by a doctor that tests showed a high amount of sedative in Cheryl's system. Silas makes Cheryl doubt Lynsey's state of mind when he tells her that he thinks Lynsey could be capable of swapping the drugs.", "Silas sets his sights on Lynsey Nolan (Karen Hassan) as his next potential victim. Jamil Fadel (Sikander Malik) and Lee Hunter (Alex Carter) start their own radio show and recruit Lynsey to be their on-air agony aunt. Lynsey's advice to \"sexually charged\" young people does not go down well with Silas. Hassan said that Silas assumes the worst about Lynsey. Silas grows more furious when Lynsey dresses up in a sexy nurse's outfit for the radio's webcam. Lynsey is \"horrified\" as her flat becomes dark and Silas grabs her from behind. However, Silas is scared off as Lynsey's screams are heard by Silas's grandson, Riley Costello (Rob Norbury), who arrives to rescue her. Lynsey realises that it was Silas who attacked her and tells people, but they do not believe her. Discussing the plot, Bronagh Waugh (who plays Lynsey's best friend Cheryl Brady) explained that everyone thinks that Lynsey is crazy and making the allegation up. She said \"Lynsey's really upset about it and asks Cheryl for some help. While she hates seeing her best friend in that kind of state, she thinks Lynsey's just being paranoid and Silas is a really upstanding member of society.\" As no one accepts Lynsey's allegation, she wants to bring Silas down even more. Hassan stated that Lynsey is determined to find the evidence she needs to expose Silas. Riley realises that Lynsey is telling the truth and confronts Silas, who has a heart attack. Riley brings Silas into hospital, but Lynsey is not sure whether Silas is genuinely ill. Lynsey is assigned as his nurse and withholds his oxygen mask until he admits that he attacked her. Heidi walks in on Lynsey withholding treatment from Silas and Lynsey calls for help. Norbury later told Digital Spy that he did not think Riley's suspicions of Silas would ever completely go and \"everything that happened shook [Riley] up a bit\".thumb|right|200px|Karen Hassan plays Silas's nemesis, Lynsey Nolan"]}, {"page": "List of Hollyoaks characters (2011)", "response": ["Riley Costello (Rob Norbury) introduces Noah to Doug Carter (PJ Brennan) and Lee Hunter (Alex Carter). Noah advertises for a flatmate which Doug and Lee both decide to apply for. Noah challenges them to run around naked in order to decide who should move into the flat. Lee completes the challenge, but Doug refuses and Noah invites Doug to move in with him because Noah felt that not completing the challenge was the more dignified thing to do. Noah finds employment at Tony Hutchinson's (Nick Pickard) spa Look Sharpe as a personal trainer. Whilst giving Doug a massage, Noah reveals he is homosexual. He meets Ste Hay (Kieron Richardson) and assumes that he is homosexual, but Ste lies and disagrees with him. Noah finds drugs in Doug's possession and tells him to get rid of them.", "Alex, played by Annie Cooper, is the love rival of Mercedes Fisher (Jennifer Metcalfe) who threatens her engagement to Riley Costello (Rob Norbury). She will make her first on-screen appearance on 5 April 2011.", "Bobby Costello, played by Jayden Fox, is the son of Riley Costello (Rob Norbury) and Mercedes McQueen (Jennifer Metcalfe), who made his first appearance on 2 November 2011, the episode in which he was born."]}, {"page": "Hollyoaks Later (series 4)", "response": ["The fourth series of Hollyoaks Later is a British television series and late night spin-off of Channel 4 soap opera Hollyoaks. The series aired in September 2011 at 10pm. The series revolved around Silas Blissett's (Jeff Rawle) search for another murder victim which culminated in the death of Rae Wilson (Alice Barlow), the stag do of Riley Costello (Rob Norbury), the hen party of Mercedes McQueen (Jennifer Metcalfe) and Ricky Campbell (Ashley Margolis) and Duncan Button's (Dean Aspen) trip to fat camp.", "The series follows four stories. Serial killer Silas Blissett (Jeff Rawle) targets Theresa McQueen (Jorgie Porter) only to kill Rae Wilson (Alice Barlow). Riley Costello (Rob Norbury) embarks on a stag do along with brother Seth (Miles Higson) and friends Animal (Aston Kelly), Doug Carter (PJ Brennan) and Warren Fox (Jamie Lomas) whose partner Mitzeee (Rachel Shenton) crashes the stag. Mercedes McQueen (Jennifer Metcalfe) embarks on her hen do along with mother Myra (Nicole Barber-Lane) where she meets up with sister Michaela (Hollie-Jay Bowes), cousin Jennifique (Amy Walsh) and old flame Johnny (Chris Coghill). Ricky Campbell (Ashley Margolis) and Duncan Button (Dean Aspen) go to fat camp where Duncan plans to lose weight and his virginity.", "| Rob Norbury"]}, {"page": "Doug Carter", "response": ["Doug finds out that Mercedes Fisher (Jennifer Metcalfe) has had an affair with Carl Costello (Paul Opacic). Brennan commented on Doug's dilemma of whether or not to tell Mercedes' boyfriend and Carl's son, Riley (Rob Norbury), saying \"It's very complicated because Doug doesn't want to be the one to say anything to Riley. That's partly because of the threats coming from Warren, but also because Seth (Miles Higson) knows and Doug thinks that the news would be better coming from Riley's own brother\". Brennan commented that \"Doug is very separate from the truth of the matter. He knows the secret, but only by chance, while Seth knows all of the people and circumstances involved. That adds to Doug's belief that Seth should be the one to tell the truth, because he's the one with first-hand information about it\". Brennan commented on the friendship between Doug and Riley saying \"Doug values his friendship with Riley far too much to just stand by and do nothing\" adding that \"Doug realises that it's do or die, and it might just have to be him that is the bearer of bad news\". Doug is threatened by Warren not to tell Riley as he plans on blackmailing Carl. Brennan added that to Doug \"the threats feel very real\" and \"the big question is whether Doug's friendship with Riley is strong enough to overpower those threats…\".", "Doug takes fellow students Charlotte Lau (Amy Yamazaki), Jamil Fadel (Sikander Malik) and Dave Colburn (Elliot James Langridge) to France. Doug kisses both Jem Costello (Helen Russell-Clark) and Leanne Holiday (Jessica Forrest) and starts dealing drugs for Brendan Brady (Emmett J. Scanlan). He supplies Charlotte with drugs, but she falls from an archway and damages her spine. Doug feels guilty and overdoses on cocaine. While in hospital, Carl Costello (Paul Opacic), who is against Doug being in Jem's life, orders him to return to America. He does so after Carl admits that he was behind a previous attack on Doug. He later returns to make amends and settles back in. After India Longford (Beth Kingston) is murdered her sister, Texas (Bianca Hendrickse-Spendlove), struggles to deal with India's upcoming funeral and so begs Doug to get her some drugs. At first, he refuses; however, he soon gets the drugs off Brendan and gives her the drugs. She takes the drugs and then sleeps with Doug, but she soon regrets it. On the day of India's funeral, Texas takes more drugs and although Doug tries to help her, she was consequently unable to attend India's funeral. Brendan forces Doug to frame Rae Wilson (Alice Barlow) for cocaine dealing. Riley Costello (Rob Norbury) takes Doug to a party. Riley gets drunk and drives and is pulled over by Ethan Scott (Craig Vye). Before Ethan can see who is driving, Doug and Riley switch places so Riley's career is not damaged."]}, {"page": "Ash Kane", "response": ["Ash arrives during Freshers Week at the HCC, where she meets Will Savage (James Atherton). They make friends and she accompanies him back to his new student accommodation. She meets his roommates Annalise Appleton (Tamaryn Payne), Rob Edwards (David Atkins), Barney Harper-McBride (Tom Scurr) and Scott Sabeka (Calvin Denba). She goes out drinking with them and Ash and Rob do dares in the SU Bar, she strips and takes her bra off in front of the crowd. The next morning Ash is upset with her behaviour, however, she carries on partying for the rest of the week with her new friends. She starts spending time with Will, which makes his girlfriend Theresa McQueen (Jorgie Porter) jealous. She also clashes with Annalise over her behaviour and rapport with Rob. Ash is forced to admit she still lives at home with her family and her brother, Callum Kane (Laurie Duncan), disapproves of her wild behaviour. Ash later goes out drinking with Annalise, where she decides she can find herself a one-night stand. She chooses Riley Costello (Rob Norbury), who has just discovered that his fiancé Mercedes Fisher (Jennifer Metcalfe) has been having an affair with his father Carl Costello (Paul Opacic) on their wedding day. She has sex with Riley in the toilets and is horrible to him when he regrets it. Ash later moves in with her friends. Ash starts to resent Will's behaviour when he starts to hang around with his rugby teammates."]}, {"page": "Hollyoaks Later (series 5)", "response": ["| Rob Norbury"]}, {"page": "Maxine Minniver", "response": ["Maxine arrives from Marbella to visit her sister, Mitzeee (Rachel Shenton), after stealing money from her cheating boyfriend and leaving him. However, Mitzeee isn't happy with her arrival after Maxine stole the first man she loved, her fiancé, Gary. Maxine apologises and reminds Mitzeee of the happier times they shared together. Mitzeee tells Maxine that she has to stop lying to her and Maxine says that she has changed and only needs a chance to prove it. Maxine surprises Mitzeee by buying her old place and they decide to call it even. Maxine is drugged by Kevin Foster because he was told to kill her. Mitzeee tells Maxine about the circumstances around Riley Costello's (Rob Norbury) death, and how devastated she was by this. She later supports Mitzeee and her cousin Heidi Costello's (Kim Tiddy) husband, Carl (Paul Opacic), to get revenge for Riley's death."]}]}}