{"wiki_id": "http://www.wikidata.org/entity/Q6106404", "itemLabel": "J. M. Gordon", "itemDescription": "British theatre director (1857-1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/J._M._Gordon", "wikipedia_page": {"main": "John McRobbie Gordon, né John McRobbie (12 October 1857 – 22 February 1944) was a Scottish singer, actor, stage manager and director, known as an influential stage director of the D'Oyly Carte Opera Company after the death of W. S. Gilbert.\nIn his early career Gordon appeared in the chorus and minor roles in D'Oyly Carte productions, and after a period as a freelance actor, manager and director, he returned to the company permanently in 1910, as stage manager, and later stage director, establishing a reputation as a firm disciplinarian and upholder of the performing practices originated by Gilbert.", "link_mentions": [{"page": "Cox and Box", "response": ["In 1900, the piece was presented at the Coronet Theatre with Courtice Pounds as Box.\"The Coronet Theatre\", The Morning Post, 25 July 1900, p. 3 In 1921, Rupert D'Oyly Carte introduced Cox and Box as a curtain raiser to The Sorcerer, with additional cuts prepared by J. M. Gordon and Harry Norris. This slimmed-down \"Savoy Version\" remained in the company's repertory as curtain raiser for the shorter Savoy Operas. By the 1960s, Cox and Box was the usual companion piece to The Pirates of Penzance.Rollins and Witts, pp. 184–86 It received its final D'Oyly Carte performance on 16 February 1977.Turnbull, Stephen. \"Cox and Box 1869–1994\", in Eden, p. 53"]}, {"page": "D'Oyly Carte Opera Company", "response": ["Carte's son Rupert inherited the company. Beginning in 1919, he mounted new seasons in London with new set and costume designs, while continuing the year-round tours in Britain and abroad. With the help of the director J. M. Gordon and the conductor Isidore Godfrey, Carte ran the company for 35 years. He redesigned the Savoy Theatre in 1928 and sponsored a series of recordings over the years that helped to keep the operas popular. After Rupert's death in 1948, his daughter Bridget inherited the company and hired Frederic Lloyd as general manager. The company continued to tour for 35 weeks each year, issue new recordings and play London seasons of Gilbert and Sullivan. In 1961 the last copyright on the Gilbert and Sullivan operas expired, and Bridget set up and endowed a charitable trust that presented the operas until mounting costs and a lack of public funding forced the closure of the company in 1982. It re-formed in 1988 with a legacy left by Bridget D'Oyly Carte, played short tours and London seasons, and issued some popular recordings. Denied significant funding from the English Arts Council, it suspended productions in 2003. With Scottish Opera, it co-produced The Pirates of Penzance 2013 and The Mikado in 2016.", "After Gilbert's death in 1911, the company continued to produce productions of the operas in repertory until 1982. In 1911, Helen Carte hired J. M. Gordon as stage manager. Gordon, who was promoted to stage director in 1922,Rollins and Witts, p. ii had been a member of the company and a stage manager under Gilbert's direction, and he fiercely preserved the company's performing traditions in exacting detail for 28 years.Stone, David (ed). J M Gordon at Who Was Who in the D'Oyly Carte Opera Company, accessed 21 December 2009 Except for Ruddigore, which underwent some cuts and received a new overture,Cox and Box was cut and arranged into a short curtain raiser very few changes were made to the text and music of the operas as Gilbert and Sullivan had produced them, and the company stayed true to Gilbert's period settings. Even after Gordon's death, many of Gilbert's directorial concepts survived, both in the stage directions printed in the libretti and as preserved in company prompt books. Original choreography was also maintained.See, for instance, 1882 images of the Act II trio in Iolanthe in Mander and Michenson, p. 65 and 1974 images of the same scene on the sleeve of D'Oyly Carte recording, Decca SKL 5188/9 Some of the company's staging became accepted as traditional by Gilbert and Sullivan fans, and many of these traditional stagings are still imitated today in productions by both amateur and professional companies.Bradley (2005), p. 61\"Patricia Leonard: principal contralto of the D’Oyly Carte opera\" . The Times, 22 February 2010"]}, {"page": "Darrell Fancourt", "response": ["Opinions differed about Fancourt's melodramatic style in his roles, especially his interpretation of his best-known role, that of the Mikado of Japan, and his famous Mikado laugh. Frederic Lloyd, who joined the D'Oyly Carte in 1951 and had studied the company's history, told an interviewer that Fancourt invented his interpretation, concerned that the earlier movements used during the Mikado's song could be taken as a Fagin-like caricature.  According to Lloyd, Fancourt had said that, because of his Jewish background, \"I just couldn't go through those movements, it would bother me\", and Lloyd reported that, when Fancourt showed Rupert D'Oyly Carte and his stage director J. M. Gordon his new business for the song, they were delighted. Jessie Bond, who had played Pitti-Sing in the 1885 première, was unimpressed: \"Who, I want to know, intended that the Mikado should prance about like a madman, hissing out his lines like a serpent? ... The raving monster we so often see now is not one bit like the suave and oily Mikado created [by Fancourt's teacher, Richard Temple] at the Savoy.\"Bond, Chapter 14, accessed 4 April 2009  The Times thought that he \"undoubtedly loses a good deal of the Mikado's humour... his 'humane Mikado' scene is the one which seems to have travelled farthest from the 'Savoy tradition'.\"The Times, 21 September 1926, p. 12 A later Times review commented more favourably: \"Mr Darrell Fancourt... can (and did) add a terrifying aspect to the benignity of his humaner punishment manifesto, and left us wondering how his vocal cords ever managed to function normally after those expressions of emphasis with which he punctuated its paragraphs.\"The Times, 25 October 1932, p. 12 The Manchester Guardian praised Fancourt's fresh approach and added, \"He makes more of the punishment-fitting-the-crime song than we can remember having seen from any other actor.\"The Manchester Guardian, 16 November 1920, p. 6 The Pall Mall Gazette said, \"Mr Fancourt has recognised that people can do with a 'thrill' in these Grand Guignol days. So he has given us a Mikado who really does curdle the blood, with a voice like a steam hammer slowly crushing a ton of Brazil nuts, and a make up of ghastly villainy, and a fiendish, gurgling laugh, which must be heard to be appreciated.\"Bettany, unnumbered page Another critic described the sound of Fancourt's laugh as \"a dragon getting up steam\". With respect to Fancourt's portrayal of the Pirate King, fellow actor Henry Lytton told an interviewer, \"The King should be a story book pirate, not a real one and blood thirsty to boot. But that's the way Mr. Fancourt plays it\"."]}, {"page": "Rupert D'Oyly Carte", "response": ["After London seasons in 1906–07 and 1908–09, the opera company did not perform in the West End again until 1919, although it continued to tour in Great Britain.  According to the theatre writer H. M. Walbrook, \"Through the years of the Great War they continued to be on tour through the country, drawing large and grateful audiences everywhere. They helped to sustain the spirits of the people during that stern period, and by so doing they helped to win the victory.\"Walbrook, p. 125 Nevertheless, Carte later recalled, \"I went and watched the Company playing at a rather dreary theatre down in the suburbs of London. I thought the dresses looked dowdy . . . I formed the view that new productions should be prepared, with scenery and dresses to the design of first class artists who understood the operas but who would produce a décor attractive to the new generation.\"Baily, p. 430. Reprinted in \"Rupert D'Oyly Carte's Season ... 1919–20\", at The Gilbert and Sullivan Archive, retrieved 11 January 2019 In a 1922 memoir, Henry Lytton, having admired Richard D'Oyly Carte's keen eye for stagecraft, added, \"That 'eye' for stagecraft ... has been inherited in a quite remarkable degree by his son, Mr. Rupert D'Oyly Carte. He, too, has the gift of taking in the details of a scene at a glance, and knowing instinctively just what must be corrected\".Lytton, p. 66 In 1910 the company engaged J. M. Gordon as stage manager, and Carte promoted him to stage director in 1922. Under Carte's supervision Gordon preserved the company's traditions in exacting detail for 28 years.Stone, David. J. M. Gordon at Who Was Who in the D'Oyly Carte Opera Company, 27 August 2001, retrieved 11 January 2019"]}, {"page": "Helen Carte", "response": ["By the time of her death in 1913, the opera company had become a repertory touring company. Helen engaged J. M. Gordon to preserve the company's unique style. In her will, she left the Savoy Theatre, the hotel business and the opera company to her stepson, Rupert D'Oyly Carte.", "After the repertory seasons in 1906–07 and 1908–09 the company did not perform in London again until 1919, only touring throughout Britain during that time.Rollins and Witts, pp. 21–22 Carte wrote in 1911 that her health made it impossible for her to produce any more revivals at the Savoy.Carte, p. 7 In March 1909 Charles H. Workman took over the  management of the Savoy Theatre from the now frail Carte. She continued to manage the rest of the family businesses with the assistance of Rupert. In 1911 she engaged J. M. Gordon, who had been a member of the company under Gilbert's direction, as stage manager.Carte, pp. 7–8 "]}, {"page": "Mock Turtles (opera)", "response": ["Mock Turtles is a one-act comic opera with a libretto by Frank Desprez and music by Eaton Faning.  It was first produced at the Savoy Theatre on 11 October 1881 as a curtain raiser to Patience,Advertisement, The Pall Mall Gazette, 11 October 1881, p. 13; \"Lyceum Theatre\", The Morning Post, 11 October 1881, p. 4; advertisement, The Standard, 11 October 1881, p. 4 then from 26 November 1882 to 30 March 1883 with Iolanthe.  The piece also toured from December 1881 throughout 1882.  It also toured in 1883 and 1884\"Provincial\", The Era, 6 May 1882, p. 9; \"Patience at the Royal Opera House\", Leicester Chronicle, 17 June 1882, p. 6; and The Sheffield & Rotherham Independent, 20 March 1883, p. 2 and enjoyed further revivals, including a tour in 1897 with J. M. Gordon and his company.\"The Era, 14 August 1897, p. 12"]}, {"page": "The Carp (opera)", "response": ["At the end of July 1886, Amandus was taken over by Charles Wilbraham.  In September 1896, Rose Hervey took over the role of Amanda and sometimes shared the part with Miss Lindsay.  After The Mikado closed, J. M. Gordon took over the role of Piscator."]}, {"page": "Mrs. Jarramie's Genie", "response": ["When the piece was performed with Yeomen, Brownlow was replaced by J. M. Gordon. Shortly after opening, Le Breton was replaced by Jesse Smith. In August 1889, Wilkinson was replaced by A. Medcalf and Bowden Haswell replaced Medcalf as Jim.  Other substitutions occasionally took place."]}, {"page": "Grahame Clifford", "response": ["In September 1939, at the outbreak of the Second World War, the British government ordered all theatres to close indefinitely.\"War and the Theatre\", The Times, 7 September 1939, p. 7 Rupert D'Oyly Carte cancelled the D'Oyly Carte Opera Company's entire autumn tour and terminated the contracts of all of his performers.  When the company started up again at Christmas 1939,Rollins and Witts, p. 164 Carte's principal comedian, Martyn Green, had accepted another engagement and was not available.Green, pp. 175–79 At Richard Watson's suggestion Clifford auditioned for the vacancy and was engaged to play Green's roles in the Gilbert and Sullivan operas, which were produced in repertory by the company. He was coached by the company's director, J. M. Gordon, who had worked with W.S. Gilbert, but Carte encouraged Clifford to recreate all his characters afresh. The Times said of his performance in The Yeomen of the Guard, \"the final moments in which the heartbroken merryman struggles to hide his grief are played with real beauty. Mr Clifford makes no attempt to imitate his predecessors in the part, and his performance gains immensely as a result.\"\"Savoy Theatre\", The Times, 19 June 1940, p. 6 The Times critic, who had seen the original cast of The Mikado, considered Clifford \"second to none\" as Ko-Ko.\"Princes Theatre\", The Times, 23 June 1942, p. 2"]}, {"page": "Harry Norris (conductor)", "response": ["As musical director, Norris was responsible for a number of changes to Sullivan's scores. Prominent horn parts were added to the accompaniment to \"A Lady Fair\" in Princess Ida that are customarily referred to as the \"Norris\" horn parts, though they may have been written by Toye.  They were expunged by Sargent but subsequently restored by the D'Oyly Carte musical director Royston Nash in the 1970s.  In addition, in 1921 Norris, in collaboration with J. M. Gordon, cut Cox and Box from its original one-hour running time to play in about half an hour, so that it became suitable as a curtain raiser for The Sorcerer or other shorter full-length pieces. This version remained in the company's repertoire until 1977 and continues to be used in many productions.Walters, Michael. \"A Brief Overview of the Life of Rutland Barrington\", The Gilbert & Sullivan News, vol. II, no. 13, p. 15 (Autumn/Winter 1998; The Gilbert and Sullivan Society)"]}, {"page": "J M Gordon", "response": ["#REDIRECT J. M. Gordon "]}, {"page": "J.M. Gordon", "response": ["#REDIRECT J. M. Gordon "]}, {"page": "JM Gordon", "response": ["#REDIRECT J. M. Gordon "]}]}}