{"wiki_id": "http://www.wikidata.org/entity/Q610867", "itemLabel": "Danny Fox", "itemDescription": "association football player (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Danny_Fox", "wikipedia_page": {"main": "Daniel Fox (born 29 May 1986) is an English-born Scottish professional footballer who plays as a defender for East Bengal in the Indian Super League. He represented England at under-21 international level, has since been selected for Scotland national team, making his debut in the November 2009 against Wales.", "link_mentions": [{"page": "Walsall F.C.", "response": ["Walsall's form continued into the new season, as the club performed strongly in 2007–08, including a run of 17 League matches without defeat and back-to-back promotions looked possible. However, a January transfer window that culminated in the sales of important first team players Danny Fox and Scott Dann to Coventry City caused a drop in form throughout 2008. The club's promotion challenge ended after a run of poor results in March leading to Richard Money resigning as manager in April."]}, {"page": "Coventry City F.C.", "response": ["| PFA Team OTY:  Danny Fox,  Keiren Westwood"]}, {"page": "Dan Harding", "response": ["In the 2011–12 season Harding was awarded a new three-year contract, and scored his first goal of the season in a 3–2 defeat at Leicester City on 27 August 2011. Throughout the 2011–12 season Harding shared the left back spot with Danny Fox, making twenty appearances. Following Southampton's promotion to the Premier League Harding's future at the club became more uncertain due to new signings.", "Harding started the 2013–14 season as an unused substitute before making his first start in a 3–1 win over Hartlepool United in the first round of League Cup. Harding played against Derby County, but was barely used in the first team as Chris Cohen was preferred in the left-back position. Harding made five appearances when Cohen was injured  but then returned to the substitutes bench following the arrival of Danny Fox in January. Harding provided an assist for Jamie Paterson in a 2–1 loss against Millwall on 5 April 2014. He went on to make nineteen appearances for the club."]}, {"page": "Michael Mancienne", "response": ["On 16 July 2014, Mancienne joined Nottingham Forest on a three-year deal, reuniting with his England U21 manager Stuart Pearce. He made his debut against Blackpool on 9 August, starting at centre-half alongside Danny Fox. He played the entire ninety minutes of the 2–0 Forest win, earning the Man of the Match award in the process. Mancienne was then sent off in his second game for the club, following two bookable offences in Forest's League Cup tie away at Tranmere Rovers on 12 August. Following his suspension, he returned to the side and once again was nominated the fans' Man of the Match in a 1–0 away win at Sheffield Wednesday."]}, {"page": "Armand Traoré", "response": ["However, Traoré was not immediately fit to play, having missed the previous season through injury and having played his last match in April 2015. He made his Nottingham Forest debut, starting the whole game, in a 2–1 win against Doncaster Rovers in the first round of the League Cup. Shortly after, Traoré found himself in a competition with Danny Fox and Alex Iacovitti over the left–back position. Despite this, he made four starts in the first three months since joining the club. However, Traoré found himself sidelined on two separate occasions between November and March, including a knee injury that he sustained during a 1–1 draw against Preston North End on 14 December 2016. It wasn't until on 4 March 2017 when Traoré returned from injury, starting the whole game, in a 3–0 win against Brighton & Hove Albion. He then made four more starts for Nottingham Forest between 11 March 2017 and 14 April 2017. However, Traoré continued to be plagued by injuries on three occasions that saw him out for the rest of the 2016–17 season, as the club managed to avoid relegation. At the end of the 2016–17 season, he made thirteen appearances in all competitions."]}, {"page": "Anthony Gerrard", "response": ["Weeks after being released by Everton, Gerrard signed for Walsall alongside Everton youth teammate Danny Fox. Gerrard 's first appearance after signing for the club on a permanent basis came in the opening match of the season, where he played 90 minutes, in a 2–1 win over Rotherham United. After making a name for himself at Walsall, Gerrard signed a contract extension with the club, keeping him until 2008. However, Gerrard's first full season for the club was mixed as, while his individual performances earned him the Player of the Year award, the club suffered relegation to League Two.", "Gerrard is a cousin of former England captain Steven Gerrard. Gerrard is also a cousin of Jon-Paul Gilhooley, who was the youngest of the 97 victims of the Hillsborough disaster on 15 April 1989. Gerrard is also good friends with Danny Fox, having played together at Walsall and Everton. Despite progressing through the Everton Academy, Gerrard grew up supporting Liverpool."]}, {"page": "List of sportspeople who competed for more than one nation", "response": ["|Danny Fox"]}, {"page": "List of Celtic F.C. international footballers", "response": ["*Danny Fox (1)"]}, {"page": "History of Coventry City F.C.", "response": ["In 2011–12, after five consecutive seasons in the bottom eight of the table, Coventry finally succumbed to relegation from the Championship, falling to the third tier for the first time since 1964. Faced with large losses, SISU had responded by selling many of the club's top stars such as Danny Fox and Scott Dann, while failing to agree new terms with out-of-contract players including Marlon King and goalkeeper Keiren Westwood. Failure to replace them, as well as the team's tendency to concede last-minute goals and suffer vital losses to other teams facing relegation, ultimately led to their finish in the bottom three. A consortium led by supporter Gary Hoffman attempted to buy the club but despite the club's losses and their unpopularity with supporters SISU refused to sell, perhaps because they hoped to acquire ownership of the stadium in future. In April 2012, SISU defaulted on the rent owed to ACL, setting in motion a multi-year battle between the club and the stadium's owners. The club claimed that the annual rent of £1.2million was too high for them, and would not be sustainable given their imminent drop to League One."]}, {"page": "Brian Easton (footballer)", "response": ["On returning to Burnley, Easton said he vowed to become a regular player next season, with the club relegated back to the Championship. However, he was continually left out of the squad from the start of the season until October, when he made his league debut on 19 October 2010 against Barnsley after stepping in for the injured Danny Fox. He scored his first goal for Burnley in a 3–2 defeat to Leeds United on 11 December 2010. However, Easton's first-team opportunities were still limited, having been an unused substitute in most of the matches."]}, {"page": "2008–09 Football League Championship", "response": ["| DF || Danny Fox || Coventry City"]}, {"page": "2009–10 Celtic F.C. season", "response": ["|24 July 2009 ||  Danny Fox ||  Coventry City ||08£1.5 million|| style=\"text-align:center;\"|"]}, {"page": "2009–10 Burnley F.C. season", "response": ["|34||DF|| Danny Fox ||  Celtic || Undisclosed || 29 January 2010", "!scope=\"row\"|Danny Fox"]}, {"page": "Fox (surname)", "response": ["* Danny Fox (born 1986), Scottish footballer"]}, {"page": "Everton F.C. supporters", "response": ["* Danny Fox"]}, {"page": "Daniel Fox (footballer)", "response": ["#REDIRECT Danny Fox"]}, {"page": "Daniel Fox", "response": ["*Danny Fox (born 1986), British footballer"]}, {"page": "Daniel Lafferty", "response": ["Lafferty signed for EFL Championship side Burnley on 30 January 2012 for an undisclosed fee believed to be in the region of £150,000, after a successful trial. On 2 February 2012 he received International Clearance to play for Burnley and as such was awarded the number 3 shirt at the club which was last worn by Danny Fox. On 18 March 2012 he made his first team debut for the Clarets, starting their away fixture at Cardiff City and playing the full 90 minutes. He received a number of plaudits for his performance including that of Manager Eddie Howe and was voted as Man of the Match on Fan Site Clarets-Mad. Lafferty made his fourth appearance for Burnley in a 4–0 away defeat to Lancashire rivals Blackpool on 21 April 2012, along with four other appearances all coming in away fixtures."]}, {"page": "2010–11 Burnley F.C. season", "response": ["!scope=\"row\"|Danny Fox"]}]}}