{"wiki_id": "http://www.wikidata.org/entity/Q6106153", "itemLabel": "J. J. Stevenson", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/J._J._Stevenson", "wikipedia_page": {"main": "John James Stevenson FRSE FSA FRIBA (24 August 1831 – 5 May 1908), usually referred to as J. J. Stevenson, was a British architect of the late-Victorian era. Born in Glasgow, he worked in Glasgow, Edinburgh and London. He is particularly associated with the British Queen Anne revival style.", "link_mentions": [{"page": "Christ's College, Cambridge", "response": ["The Stevenson Building in Third Court was designed by J. J. Stevenson in the 1880s and was extended in 1905 as part of the College's Quadcentenary. In 1947 Professor Albert Richardson designed a new cupola for the Stevenson building, and a second building, the neo-Georgian Chancellor's Building (W staircase, now known as The Blyth Building), completed in 1950. Third Court's Memorial Building (Y staircase), a twin of the Chancellor's building, also by Richardson, was completed in 1953 at a cost of £80,000.Christ's College Magazine, Michaelmas 1953 Third Court is also noted for its display of irises in May and June, a gift to the college in 1946.Christ's College Magazine no. 228, p 53, 2003"]}, {"page": "List of architects", "response": ["*J. J. Stevenson (1831–1908), Scottish"]}, {"page": "George Gilbert Scott", "response": ["Scott's success attracted a large number of pupils and many would go on to have successful careers of their own, not always as architects. Some notable pupils are as follows, their time in Scott's office shown after their name: Hubert Austin (1868), Joseph Maltby Bignell (1859–78), George Frederick Bodley (1845–56), Charles Buckeridge (1856–57), Somers Clarke (1865), William Henry Crossland (dates uncertain), C. Hodgson Fowler (1856–60), Thomas Garner (1856–61), Thomas Graham Jackson (1858–61), John T. Micklethwaite (1862–69), Benjamin Mountfort (1841–46), John Norton (1870–78), George Gilbert Scott, Jr. (1856–63), John Oldrid Scott (1858–78), J. J. Stevenson (1858–60), George Henry Stokes (1843–47), George Edmund Street (1844–49), William White (1845–47), William Niven (dates unknown)."]}, {"page": "Hall Caine", "response": ["In 1879 Caine edited a booklet of the papers presented to the Notes and Queries Society by William Morris, Samuel Huggins and John J. Stevenson on the progress of public and professional thought on the treatment of ancient buildings which was described as \"'well worth reading\".The Restoration of Ancient Buildings. Papers by William Morris, Samuel Huggins, J. J. Stevenson, etc., edited by T. H. Hall Caine. Royal Institution, Liverpool. 1877. Crown 8vo. 50 pp. At the 1879 Social Science Congress held in Manchester Town Hall, Caine read his paper A New Phase of the Question of Architectural Restoration. He spoke of the Society for the Protection of Ancient Buildings, its purpose, actions and achievements. Caine had joined the society the previous year and remained a member for the rest of his life. One of the society's founders was William Morris."]}, {"page": "North Kelvinside", "response": ["Architecturally significant buildings in the area include the Kelvin Stevenson Memorial Church (by J. J. Stevenson, 1898); Gillespie, Kidd & Coia's St. Charles Parish Church (1959), noted for its hyperbolic paraboloid concrete roof and Stations of the Cross sculptures by Benno Schotz; and the unique Mackintosh Church at Queen's Cross, the only church designed by Charles Rennie Mackintosh. Another local landmark is Alexander \"Greek\" Thomson's Sixty Steps (1872). Contemporary published sources suggest that the steps, associated retaining wall and the original Queen Margaret Bridge were actually part of John E. Walker's co-ordinated civil engineering works of 1869/1870 to the designs of Ritchie Rodger C.E. in preparation for the development of the suburb.Glasgow Herald, 11 October 1869Glasgow Herald, 20 October 1870"]}, {"page": "Stevenson", "response": ["*J. J. Stevenson (1831–1908), British architect of the late-Victorian era", "**J. J. Stevenson (1831–1908), architect"]}, {"page": "David Bryce", "response": ["In his banks and public buildings, he preferred to use Italianate classical styles similar to those of Charles Barry - his design for Fettes College, Edinburgh was one of the first to revive the French château style. Several other architects trained under Bryce including Charles Kinnear, John Starforth,  James M. Wardrop, James McLaren, John Milne,  J. J. Stevenson, Sir James Gowans, William Hamilton Beattie and James Campbell Walker."]}, {"page": "John Stevenson", "response": ["*J. J. Stevenson (1831–1908), British architect"]}, {"page": "Harry Redfern", "response": ["Redfern practiced from Porchester Gardens, London, and later resided at St Dunstan's Gdns, Ealing. His early business partner was J. J. Stevenson, FSA, (1831-1908). He was author of the article: Some Recollections of William Butterfield and Henry Woodyer (1950)."]}, {"page": "Flora Stevenson", "response": ["*J. J. Stevenson and James Cochran Stevenson, two of her brothers"]}, {"page": "John James Stevenson", "response": ["#REDIRECT J. J. Stevenson"]}, {"page": "James Cochran Stevenson", "response": ["He had many siblings who included Flora Stevenson, J. J. Stevenson and Louisa Stevenson."]}, {"page": "Cambridge Medical School building", "response": ["The committee also influenced the design in other ways, such as insisting on a stone façade. In style, the building is based on English Baroque, heavily influenced by recent buildings by architects such as Belcher, Pite and Blomfield. It also reflects the presence of J. J. Stevenson's Chemical Laboratories (1886-8), immediately to the west of the site."]}, {"page": "John Rhind", "response": ["John Rhind was born in Banffshire in 1836, son of the Inverness architect builder George Rhind and his wife Isabella Milne. He was probably initially articled to his father, but  around 1854 he went to Glasgow, where he became an assistant to Campbell Douglas, remaining with him during the early years of his partnership with J. J. Stevenson. At Douglas' he became acquainted with Bruce James Talbert and took an interest in the work of Alexander 'Greek' Thomson whose influence was later to be reflected in Rhind's Imperial Hotel and Union Street buildings, both in Inverness. While in Glasgow he is said to have been a Vice-President of the Young Architectural Association of Glasgow, perhaps a junior branch of the Glasgow Architectural Society."]}, {"page": "J.J. Stevenson", "response": ["#REDIRECT J. J. Stevenson"]}, {"page": "JJ Stevenson", "response": ["#REDIRECT J. J. Stevenson "]}, {"page": "Cadogan Square", "response": ["The west side has the greatest variety of houses, all variations on the same Flemish-influenced theme. Numbers 54-58 were designed by William Young in 1877 for Lord Cadogan, and the architect J. J. Stevenson was largely responsible for the south side, built in 1879–85."]}, {"page": "Edward Robert Robson", "response": ["Born in Durham,Philip Robson, \"E.R. Robson: a memoir by his son\", Journal of the Royal Institute of British Architects (February 1917) still provides the most extensive biographical details. he was the elder son of Robert Robson, a Durham Justice of the Peace.Who Was Who, online edition, ROBSON, Edward Robert (subscription required), accessed 13 December 2008 He apprenticed in Newcastle upon Tyne with John Dobson, who worked in a classicising, Italianate manner; he then worked under Sir George Gilbert Scott (1854–59) during the restoration of Durham Cathedral's tower, taking a break in 1858 for \"extensive Continental travel\",Robson 1917. and went on to serve as architect in charge of the Cathedral for six years. He was also in partnership for a time prior to 20 August 1862 with John Wilson Walton (c. 1822–1910).A. Felstead, J. Franklin and L. Pinfield, Directory of British Architects 1834–1900, (R.I.B.A., 1993), s.v. Walton, John Wilson\" (on-line abstract ).  The dissolution of their partnership is also noted in the  His first church, St. Cuthbert's, Durham (1863), was inspired in part by the plain 13th-century church at Formigny, Normandy.Gavin Stamp, \"High Victorian Gothic and the Architecture of Normandy\" The Journal of the Society of Architectural Historians 62.2 (June 2003:194–211) pp 204f, ill. Robson's perspective and plan from The Builder (1 August 1863) as fig. 15, p. 204 During (1865-71) he served as architect and surveyor to the city of Liverpool, which served to give him sufficient experience when he was the surprising choiceJacqueline Banerjee, \"Edward Robert Robson, pioneering architect of State Schools\" as chief architect for the newly erected School Board of London, in 1871. He became a fellow of the Royal Institute of British Architects. Under the terms of the reforming Elementary Education Act 1870, a great number of new state-funded schools had to be built as quickly as possible, especially in the East End. Robson's experience, for which he travelled in the Continent for the most up-to-date school-planning ideas, was encapsulated in his School Architecture (1874).School Architecture; Being Practical Remarks on the Planning, Designing, Building and Furnishing of School-Houses; it was reprinted by Leicester University Press (distributed by Humanities Press, New York) 1972. For the workload, he formed a partnership with J. J. Stevenson from 1871 until 1876. The schools themselves were of brick and architectural terracotta in the many-gabled free Anglo-Flemish Renaissance style known at the time as \"Queen Anne style\", which Robson chose as more suitably enlightened and secular than Gothic Revival and in which Stevenson had already shown himself proficient."]}, {"page": "Kelvin Stevenson Memorial Church", "response": ["This distinctive church was designed by the architect J. J. Stevenson and built 1898–1902. Red sandstone is used, as in many buildings in Glasgow. It was built by the Free Church of Scotland as the Nathanial Stevenson Memorial Free Church, becoming part of the United Free Church of Scotland in 1900, which in turn united with the Church of Scotland in 1929."]}, {"page": "Marshall House, Cambridge", "response": ["Marshall House has been the President's Lodge at Lucy Cavendish College, Cambridge, England, since 2001.Cambridge 2000: Lucy Cavendish College: Madingley Road: Marshall House (Balliol Croft). It was designed by the Scottish architect J. J. Stevenson and built in 1886. It is a Grade II listed building."]}, {"page": "Daniel Cottier", "response": ["After managing Field & Allan for two years, Cottier felt sufficiently confident to open his own business in Edinburgh aged 26. He shared the top floor of 24 George Street with the architects Campbell Douglas and J. J. Stevenson. Cottier persuaded Andrew Wells (1845–1915), his talented young assistant at Field & Allan, to join the new venture, together with Stephen Adam (1848–1910) from Ballantine & Co, and Charles Gow (1830–1891). However, Cottier's connection with Field & Allan did not end completely: he married Marion, the late William Field's daughter, in Edinburgh on 15 June 1866."]}, {"page": "List of Oxford architects", "response": ["* J. J. Stevenson"]}, {"page": "Campbell Douglas", "response": ["*J. J. Stevenson"]}, {"page": "Red House, London", "response": ["* The Red House, Bayswater, designed by the British Queen Anne Revival architect J. J. Stevenson for himself in 1874"]}, {"page": "Saint Mark's Coptic Orthodox Church (London)", "response": ["To attempt to address these issues, alterations were soon begun. In 1866–1867, advice was sought from J. J. Stevenson about acoustical matters, and in particular the design of the pulpit.K.P.L., MS. 21555. An architect, J. Theodore Barker, made large charges between 1876–1880 and 1882. A chancel arch was inserted, galleries inserted at either end of the transept to increase the seating from 500 to 750. A missing organ was supplied and the pulpit replaced. The heating apparatus and stained glass were also replaced in the work.St. John’s Presbyterian Church, Kensington 1862–1962, n.d., p. 8: K.P.L., MS. 21561: Kensington News, 11 Nov. 1876; 9 Dec. 1876: M.B.W. case no. 31368: R.I.B.A. Library, Fellowship Nomination Papers, J. T. Barker, 9 Jan. 1882."]}, {"page": "Robert Omond", "response": ["His daughter Jane Omond (1839–1932) married the architect J. J. Stevenson, brother of Flora Stevenson and Louisa Stevenson.https://www.wikitree.com/genealogy/Omond-Family-Tree-35"]}, {"page": "Òran Mór", "response": ["The building was founded as the Kelvinside Free Church, as a parish church of the Free Church of Scotland. The foundation stone was laid on 4 September 1862, and the church was built in the Neo-Gothic style, on designs by J. J. Stevenson. A spire was built in an Italian Gothic Pyramid style.\"History\", Oran Mor. Retrieved on 23 July 2020. After the Free Church of Scotland joined the United Presbyterian Church in 1900 to form the United Free Church of Scotland, the church was renamed the Kelvinside United Free Church. \"Kelvinside Literary Association (Kelvinside United Free Church) (later becomes The Young People’s At Home)\", Glasgow Literary Bonds, 28 November 2017. Retrieved on 23 July 2020."]}, {"page": "Queen Anne Revival architecture in the United Kingdom", "response": ["The Queen Anne Revival was to a large extent anticipated by George Frederick Bodley, George Gilbert Scott, Norman Shaw, W. Eden Nesfield, J. J. Stevenson, and Philip Webb in the 1860s; they had used and mixed together brick pediments and pilasters, fan-lights, ribbed chimneys, Flemish or plain gables, hipped roofs, wrought-iron railings, sash windows, outside shutters, asymmetry and even sunflower decorations.", "=== J. J. Stevenson ===", "In 1871–3, the Scottish architect J. J. Stevenson built his widely-imitated Red House on Bayswater Hill; its name may have been a response to William Morris's Red House, Bexleyheath. Both inside and out it was an eclectic mix of styles, with furnishings from different continents and centuries. Outside it was brown brick with red brick dressings; dormer windows with Flemish gables in a flat facade over a cornice; bay windows, and sashes with louvred shutters.", "File:The Red House, No 3 Bayswater Hill J. J. Stevenson 1874.jpg|The Red House, Bayswater, J. J. Stevenson, 1874", "Professional criticism of the style began quickly, with comments such as that in the Building News of 31 May 1872, likely by the church architect J. P. Seddon, that it was \"mediaeval, but freely treated, with a good deal of impure classical details, introduced after the fashion of the Queen Anne period, now so much and so foolishly imitated\". Other Gothic Revival architects followed suit, though the younger ones were more accepting; E. W. Godwin remarked on the \"excellence both of the materials and workmanship\" of J. J. Stevenson's Red House. When in 1873 the Royal Academy showed off the designs for George Frederick Bodley's School Board Offices, Edward Robert Robson & Stevenson's Board Schools, and Shaw's New Zealand Chambers, they were found in Girouard's words \"clever, no doubt, but also startling and even shocking\"."]}, {"page": "Red House (Stevenson)", "response": ["#REDIRECT J. J. Stevenson"]}, {"page": "St Leonard's-in-the-Fields Church", "response": ["St Leonard's-in-the-Fields is a Church of Scotland church in Perth, Perth and Kinross, Scotland. Standing on Marshall Place, at its junction with Scott Street, overlooking the northern end of the South Inch, it was built between 1882 and 1885, to a design by J. J. Stevenson, and is now a Category A listed building. It is in the Gothic Revival style.\"Marshall Place, St Leonard's-in-the-fields Church and Halls (Church of Scotland), Including Boundary Wall and Gatepiers\" – Historic Environment Scotland "]}]}}