{"wiki_id": "http://www.wikidata.org/entity/Q6113745", "itemLabel": "Jack Lowden", "itemDescription": "Scottish actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Lowden", "wikipedia_page": {"main": "Jack Andrew Lowden (born 2 June 1990) is a Scottish actor. Following a four-year stage career, his first major international onscreen success was in the 2016 BBC miniseries War & Peace, which led to starring roles in feature films.\nLowden starred as Eric Liddell in the 2012 play Chariots of Fire in London. In 2014, he won an Olivier Award and the Ian Charleson Award for his role as Oswald in Richard Eyre's 2013 adaptation of Ibsen's Ghosts. In 2013, he began to have substantial roles in British television series and feature films, including The Tunnel (2013) and '71 (2014), and had leading roles in the BBC miniseries The Passing Bells (2014) and War & Peace (2016).\nHis screen projects since War & Peace have included the title role as golfing legend Tommy Morris in Tommy's Honour (2016), the starring role of Morrissey in the biopic England Is Mine (2017), a main-cast role as an RAF fighter-pilot in Christopher Nolan's Dunkirk (2017), a starring role in the Scottish Highlands thriller Calibre (2018, for which he won the British Academy Scotland Award for Best Film Actor), Lord Darnley in Mary Queen of Scots (2018), a starring role as a plantation owner in 19th-century Jamaica in the 2018 BBC miniseries The Long Song, and Zak \"Zodiac\" Bevis in the 2019 comedy-drama WWE film Fighting with My Family.", "link_mentions": [{"page": "Chariots of Fire", "response": ["A stage adaptation of Chariots of Fire was mounted in honour of the 2012 Olympics. The play, Chariots of Fire, which was adapted by playwright Mike Bartlett and included the iconic Vangelis score, ran from 9 May to 16 June 2012 at London's Hampstead Theatre, and transferred to the Gielgud Theatre in the West End on 23 June, where it ran until 5 January 2013.Rees, Jasper. \"Chariots of Fire Is Coming!\" The Arts Desk. 18 April 2012. It starred Jack Lowden as Eric Liddell and James McArdle as Harold Abrahams, and Edward Hall directed. Stage designer Miriam Buether transformed each theatre into an Olympic stadium, and composer Jason Carr wrote additional music.\"Cast Announced for Hampstead Theatre's Chariots of Fire; Opens May 9\". Broadway World. 2 April 2012.Girvan, Andrew. \"Black Watch's Lowden plays Eric Liddell in Chariots of Fire\" . What's on Stage. 9 March 2012.Chariots of Fire – Hampstead Theatre   Vangelis also created several new pieces of music for the production.Twitter: Chariots Tweeter, 16 April 2012, 18 April 2012.Rees, Jasper. \"Chariots of Fire: The British Are Coming... Again\". The Daily Telegraph. 3 May 2012. The stage version for the London Olympic year was the idea of the film's director, Hugh Hudson, who co-produced the play; he stated, \"Issues of faith, of refusal to compromise, standing up for one's beliefs, achieving something for the sake of it, with passion, and not just for fame or financial gain, are even more vital today.\"Jury, Louise. \"Theatre to Run Chariots of Fire with Vangelis Tracks\". London Evening Standard. 30 January 2012."]}, {"page": "Irn-Bru", "response": ["A 2009 advertisement for the product featured a group of high school pupils performing a musical number, with the refrain \"It's fizzy, it's ginger, it's phenomenal!\" It was a parody of High School Musical, and starred Jack Lowden."]}, {"page": "1990", "response": ["** Jack Lowden, Scottish actor"]}, {"page": "Siegfried Sassoon", "response": ["Peter Capaldi and Jack Lowden portrayed Sassoon in Terence Davies's 2021 movie Benediction."]}, {"page": "Measure for Measure", "response": ["In 2018, Josie Rourke directed a uniquely gender-reversal production of the play at the Donmar Warehouse in London, in which Jack Lowden and Hayley Atwell successively alternate the roles of Angelo and Isabella.Brown, Mark. \"Measure for Measure gender swap may be theatrical first\". The Guardian. 24 April 2018.Snow, Georgia. \"Hayley Atwell and Jack Lowden to swap roles in Donmar Warehouse Measure for Measure\". The Stage. 24 April 2018."]}, {"page": "1990 in film", "response": ["* June 2 – Jack Lowden, British actor"]}, {"page": "Christopher Nolan", "response": ["After serving as an executive producer alongside Thomas on Zack Snyder's Batman v Superman: Dawn of Justice (2016) and Justice League (2017), Nolan returned to directing with Dunkirk (2017). Based on his own original screenplay and co-produced with Thomas, the story is set amid World War II and the evacuation of Allied soldiers from the beaches of Dunkirk, France, in 1940. Describing the film as a survival tale with a triptych structure, Nolan wanted to make a \"sensory, almost experimental movie\" with minimal dialogue. He said he waited to make Dunkirk until he had earned the trust of a major studio to let him make it as a British film, but with an American budget. Before filming, Nolan sought advice from Spielberg, who later said in an interview with Variety, \"knowing and respecting that Chris [Nolan] is one of the world's most imaginative filmmakers, my advice to him was to leave his imagination, as I did on Ryan, in second position to the research he was doing to authentically acquit this historical drama.\" Starring Fionn Whitehead, Jack Lowden, Aneurin Barnard, Harry Styles, Tom Hardy, Mark Rylance, Cillian Murphy, and Kenneth Branagh, Dunkirk was released in theatres in July 2017 to widespread critical acclaim and strong box office results. It grossed over $526million worldwide, which made it the highest-grossing World WarII film of all time. In his review, Mick LaSalle of the San Francisco Chronicle wrote: \"It's one of the best war films ever made, distinct in its look, in its approach and in the effect it has on viewers. There are movies—they are rare—that lift you out of your present circumstances and immerse you so fully in another experience that you watch in a state of jaw-dropped awe. Dunkirk is that kind of movie.\" The film received many accolades, including Nolan's first Oscar nomination for Best Director."]}, {"page": "Eric Liddell", "response": ["* In 2012, the play Chariots of Fire, based on the 1981 film, starred Jack Lowden as Liddell."]}, {"page": "Ghosts (play)", "response": ["An award-winning 2013–14 London production opened at the Almeida Theatre on 26 September 2013 and transferred to the West End at Trafalgar Studios on 9 December, running through 22 March 2014.http://www.playbill.com/news/article/184459-Richard-Eyres-Production-of-Ibsens-Ghosts-to-Transfer-to-West-Ends-Trafalgar-Studios/I%3E-to-Transfer-to-West-Ends-Trafalgar-Studios Adapted and directed by Richard Eyre, it featured Lesley Manville, Jack Lowden, Will Keen, Charlene McKenna, and Brian McCardie. Manville and Lowden won Olivier Awards for their performances; Manville also won the Critics' Circle Theatre Award for Best Actress, and Lowden also won the Ian Charleson Award.\"Jack Lowden wins Ian Charleson Award\", West End Theatre Eyre won the Evening Standard Award for Best Director.\"2013: How we chose the winners\", Evening Standard  The production also won the Olivier Award for Best Revival, and received Olivier Award nominations for Best Director and Best Lighting Design. A filmed February 2014 performance of the production screened in more than 275 UK and Irish cinemas on 26 June 2014.Ghosts Screening (clip). Almeida.co.uk.Billington, Michael. \"Let's stop pretending that theatre can't be captured on screen\", The Guardian. 18 June 2014. The entire filmed performance is viewable online.\"Richard Eyre's 'GHOSTS,' Starring Lesley Manville and Jack Lowden, Out Online Sept 18\", Broadway World. 19 August 2014.\"Ghosts, by Henrik Ibsen, adapted and directed by Richard Eyre\" , DigitalTheatre.com. The production was also adapted for radio by director Richard Eyre, broadcast on BBC Radio 3 on 15 December 2013 and re-broadcast on 26 April 2015.", "In 1987 it was televised on the BBC, directed by Elijah Moshinsky and featuring Judi Dench as Mrs. Alving, Kenneth Branagh as Oswald, Michael Gambon as Pastor Manders, and Natasha Richardson as Regina. In 2014 Richard Eyre's award-winning London stage adaptation starring Lesley Manville and Jack Lowden was filmed and screened at numerous cinemas, and is available to view online."]}, {"page": "Royal Conservatoire of Scotland", "response": ["*Jack Lowden"]}, {"page": "War poet", "response": ["* The 2021 biographical film Benediction, directed by Terence Davies, stars Jack Lowden and Peter Capaldi as English war poet Siegfried Sassoon at different periods of his life. In the same film, Wilfred Owen is played by Matthew Tennyson."]}, {"page": "Stephen Merchant", "response": ["In 2019, Merchant wrote and directed Fighting with My Family, a biographical sports comedy-drama film, based on the 2012 documentary The Wrestlers: Fighting with My Family by Max Fisher. The film depicts the career of English professional wrestler Paige as she makes her way up WWE, and starred Florence Pugh and Jack Lowden, as well as Dwayne Johnson (who also served as a co-producer). Fighting with My Family grossed $41.5 million worldwide against a budget of $11 million."]}, {"page": "Young Tom Morris", "response": ["The 2016 film Tommy's Honour depicts the lives and careers of Old Tom (Peter Mullan) and Young Tom (Jack Lowden), and focuses on their complex and bittersweet relationship. It is based on Kevin Cook's Herbert Warren Wind Book Award–winning 2007 biography, Tommy's Honor: The Story of Old Tom Morris and Young Tom Morris, Golf's Founding Father and Son."]}, {"page": "Jack (given name)", "response": ["*Jack Lowden (born 1990), Scottish actor"]}, {"page": "List of feature films with LGBT characters", "response": ["| Jack Lowden"]}, {"page": "Critics' Choice Movie Award for Best Acting Ensemble", "response": ["| Kenneth Branagh, Tom Hardy, Cillian Murphy, Mark Rylance, Fionn Whitehead, Tom Glynn-Carney, Jack Lowden, Harry Styles, Aneurin Barnard, James D'Arcy, Barry Keoghan."]}]}}