{"wiki_id": "http://www.wikidata.org/entity/Q6118346", "itemLabel": "Jacob Behrens", "itemDescription": "Anglo-German businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Jacob_Behrens", "wikipedia_page": {"main": "Sir Jacob Behrens (13 November 1806 – 22 April 1889) was an Anglo–German textile merchant. His company, Sir Jacob Behrens & Son Ltd., was established in 1834 and still operates today. Behrens was Jewish and was a prominent member of the Anglo-Jewish Association.", "link_mentions": [{"page": "Undercliffe Cemetery", "response": ["* Behrens Monument (1889), a monument in renaissance style to Sir Jacob Behrens and family."]}, {"page": "Anglo-Jewish Association", "response": ["The Anglo-Jewish Association (AJA) is a British organisation. It was formed in 1871 for the 'promotion of social, moral, and intellectual progress among the Jews; and the obtaining of protection for those who may suffer in consequence of being Jews'. Many Anglo-Jewish businessmen, such as Jacob Behrens, were members."]}, {"page": "Sir Jacob Behrens", "response": ["#REDIRECT Jacob Behrens"]}, {"page": "Bradford", "response": ["During the 1820s and 1830s, there was immigration from Germany. Many were Jewish merchants and they became active in the life of the town. The Jewish community mostly living in the Manningham area of the town, numbered about 100 families but was influential in the development of Bradford as a major exporter of woollen goods from their textile export houses predominately based in Little Germany and the civic life of Bradford. Charles Semon (1814–1877) was a textile merchant and philanthropist who developed a productive textile export house in the town, he became the first foreign and Jewish mayor of Bradford in 1864. Jacob Behrens (1806–1889) was the first foreign textile merchant to export woollen goods from the town, his company developed into an international multimillion-pound business. Behrens was a philanthropist, he also helped to establish the Bradford chamber of commerce in 1851. Jacob Moser (1839 – 1922) was a textile merchant who was a partner in the firm Edelstein, Moser and Co, which developed into a successful Bradford textile export house. Moser was a philanthropist, he founded the Bradford Charity Organisation Society and the City Guild of Help. In 1910 Moser became the first Jewish Lord Mayor of Bradford.", "In the field of industry, Sir Jacob Behrens (1806–1889) was an Anglo–German textile merchant who was instrumental in Bradford becoming a major exporter of woollen goods."]}, {"page": "List of people from Bradford", "response": ["* Sir Jacob Behrens – (1806–1889) Anglo-German textile merchant. He was a founder of the Bradford Chamber of Commerce in 1851."]}, {"page": "Jacob Unna", "response": ["Jacob Unna (1800 – 1881),  was born in Hamburg, of German Jewish descent. Unna was a leading industrialist in Bradford and a leading figure in establishing the town's worsted trade. He was Jacob Behrens' right-hand man, and was instrumental in building Behrens's business into one of the great Bradford textile export houses."]}, {"page": "Timeline of Bradford", "response": ["** Jacob Behrens moves to Bradford, opening a factory in Thornton Road."]}, {"page": "1951 New Year Honours", "response": ["* Edgar Charles Behrens, , Chairman, National Wool Textile Export Corporation. Director of Sir Jacob Behrens & Sons Ltd., Bradford."]}, {"page": "Listed buildings in Bradford (Bowling and Barkerend Ward)", "response": ["|The mausoleum in Undercliffe Cemetery is to the memory of Sir Jacob Behrens and his family.  It is in stone, and in Renaissance style.  The mausoleum has a stepped plinth and is supported by carved scrolls.  It is flanked by pairs of fluted Corinthian columns carrying a swagged frieze and a segmental pediment.  On the top is an achievement crest surmounted by an anthemion acroterion."]}]}}