{"wiki_id": "http://www.wikidata.org/entity/Q6112322", "itemLabel": "Jack Elkes", "itemDescription": "English footballer (1894-1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Elkes", "wikipedia_page": {"main": "Albert John \"Jack\" Elkes (31 December 1894 – 22 January 1972) was an English professional footballer who played as an inside left for various clubs between the two world wars.", "link_mentions": [{"page": "Oakengates", "response": ["*Jack Elkes (1894-1972), professional footballer, born at Snedshill."]}, {"page": "Jimmy McIntyre", "response": ["In March 1922, just as Saints fans were confident of gaining promotion, McIntyre shocked them by announcing a four player transfer with wingers Fred Foxall and Joe Barratt moving to Birmingham in exchange for Jack Elkes (a forward) and George Getgood (a half-back). The move was a success, however, as Southampton were able to claim the title by overtaking Plymouth Argyle on the final day of the season."]}, {"page": "Frank Osborne (footballer)", "response": ["He made a slow start to his Tottenham career, scoring only once in his first season and a half, although he was again selected for England against Belgium on 8 December 1924 (won 4–0). In 1925–26 however, playing alongside Jimmy Dimmock and Jack Elkes, he struck a rich vein of form scoring three hat tricks in the space of two weeks in October/November 1925, finishing the season as the club's top scorer on 25 goals."]}, {"page": "George Getgood", "response": ["At the time Southampton were leading the Third Division South table and their fans were confident of gaining promotion. Manager Jimmy McIntyre shocked them by announcing a four-player transfer: wingers Fred Foxall and Joe Barratt were to join Birmingham in exchange for Jack Elkes (a forward) and Getgood. The move was a success, however, as Southampton were able to claim the title by overtaking Plymouth Argyle on the final day of the season."]}, {"page": "Joe Barratt", "response": ["In March 1921, he was injured (to be replaced by Charlie Brown) and was unable to help in the run-in to the end of the season when Saints finished second, missing out on the only available promotion spot. For the following season, he reclaimed his place in the starting line-up from Brown and missed only a few games before he was suddenly transferred to Birmingham in March. At the time Southampton were leading the Third Division South table and their fans were confident of gaining promotion. Manager Jimmy McIntyre shocked them by announcing a four player transfer, with wingers Fred Foxall and Barratt moving to Birmingham in exchange for Jack Elkes (a forward) and George Getgood (a half-back). In his three years at The Dell Barratt made 101 appearances in all competitions, scoring eight goals."]}, {"page": "Fred Foxall", "response": ["At the end of the season, he provoked controversy when he signed a contract with Aston Villa, although he was still registered with Southampton. He was ordered by the Football Association to re-join Southampton and he continued to give good service until he was transferred to Birmingham in March 1922. At the time Southampton were leading the Third Division South table and their fans were confident of gaining promotion. Manager Jimmy McIntyre shocked them by announcing a four player transfer, with wingers Foxall and Joe Barratt moving to Birmingham in exchange for Jack Elkes (a forward) and George Getgood (a half-back). In his three years at The Dell Foxall made 114 appearances in all competitions, scoring 12 goals."]}, {"page": "George Davies (footballer, born 1900)", "response": ["Davies was born in Wellington, Shropshire. He played football for Wellington St George's and Ironbridge and made guest appearances for Wrexham during the First World War, before joining Birmingham of the Football League Second Division in 1918; he was recommended to the club by Birmingham player Jack Elkes, who came from the same area.Matthews, p. 85. He made his debut in a 2–0 win at Wolverhampton Wanderers on 15 November 1919, and played regularly in the second half on that season.Matthews, p. 161. The following season, he lost his place to Ted Linley, but returned for the last eight games of the 1920–21 season to score five goals and help the club to the Second Division title.Matthews, p. 162. Davies played only three games in the First Division,Matthews, p. 163. and had a brief spell with Wellington Town before signing for Southend United of the Third Division South in June 1922. After 13 goals from 70 games in all competitions for Southend, Davies returned to Wellington Town at the end of the 1923–24 season. In June 1934 he was appointed to the club's committee."]}, {"page": "Henry Johnson (footballer)", "response": ["For Southampton's first season in the Second Division, McIntyre preferred Jack Elkes at inside-right; Elkes had arrived from Birmingham in March as part of the exchange deal with Foxall, but had broken his collar bone in his second appearance. Johnson only made sporadic appearances during the 1922–23 season as cover for the other forwards, with five of his nine appearances coming in the last three weeks of the season."]}, {"page": "History of Tottenham Hotspur F.C.", "response": ["In the 1921–22 season, Spurs finished second to Liverpool in the league, their first serious challenge for the title. After the success of the two post-war seasons, Spurs only managed to finish mid-table in the next five. The team had begun to deteriorate, and new signings Jack Elkes and Frank Osborne could not overcome weaknesses in other positions. They were in first place for a while in 1925, until Grimsdell broke his leg and they dropped down the table.  McWilliam left for Middlesbrough in February 1927 when Middlesbrough offered him significantly better pay while the Tottenham board refused his request for a smaller increase. Billy Minter, who first joined the club as a player in 1907 and became the first player to score 100 goals for the club in 1919, took over as manager. In the 1927–28 season, his first full season in charge, Spurs were unexpectedly relegated despite finishing with 38 points, only 6 points behind 4th-placed Derby County. One factor in their relegation may have been the sale of Jimmy Seed to Sheffield Wednesday—Wednesday had looked certain to be relegated, but Seed helped them escape, beating Tottenham twice along the way, and they went on to win the League Championship title in each of the next two seasons."]}, {"page": "1925 FA Charity Shield", "response": ["Centre-forward Ashton gave the Amateurs the lead after five minutes, with a hard shot into the corner off Walter Bellamy's cross. In the next quarter of an hour, the Professionals hit the frame of the goal three times. On the first occasion, Benjamin Howard Baker rushed out of goal but failed to collect Ernie Simms' shot; the ball struck the foot of the post, and Gates was able to clear before it spun back into the net. Then a shot from Jimmy Walsh and a volley by Jack Elkes each struck a post, rebounded into play, and were cleared by the defence. Soon afterwards, Simms suffered a leg strain. He played on, limping on the wing, until half-time, but took no part in the second half. After 35 minutes, Ashton scored his second goal, in similar fashion to the first; he trapped Bellamy's cross and shot hard into the corner. In what remained of the first half, Frank Macey had two close-range shots, \"but both were saved most brilliantly\" by Harry Hardy.", "|Forward|| Jack Elkes||Tottenham Hotspur"]}, {"page": "1921–22 Southampton F.C. season", "response": ["In addition to Andrews, Jimmy McIntyre brought in another two new players to Southampton before the start of the 1921–22 season. Full-back Harry Hooper joined for £10 from Brierley Hill Alliance, while centre-forward John Horton was brought in from Wombwell. A few months into the campaign, centre-half Ted Hough was signed from Talbot Stead Tubeworks, who were paid £200 and 52 pints of beer for his services. In January 1922, Sammy Meston – the son of former Southampton half-back Samuel Meston – joined from Sholing Athletic, and outside-right Robert Blyth signed from Portsmouth. In March, the club released two popular players to recently promoted First Division club Birmingham, who provided two of their own players in return. McIntyre's contributions were outside-left Fred Foxall and outside-right Joe Barratt, both of whom had played the majority of games up to that point, while their replacements were inside-left Jack Elkes and half-back George Getgood. Foxall had originally attempted to join top-flight side Aston Villa in May, but his transfer was reversed by the Football Association as Southampton had not given permission for the sale (he was also ordered to donate his signing-on fee to the National War Fund).", "!scope=\"row\"|Jack Elkes", "The club's unbeaten run finally came to an end on 14 January 1922, when they were beaten by a single goal at mid-table side Brentford. Rawlings scored four goals for a second time during the season the following week when the Saints faced Millwall, making him the first Southampton player to do so three times. However, the club continued to drop points in early 1922, and as a result dropped below main title contenders Plymouth Argyle in the table following a third loss of the season at Swansea Town on 25 February. New signings Jack Elkes and George Getgood debuted against Southend United in the next game, with the former scoring two goals in the convincing 5–2 win; however, he broke his collar bone in the next match, and remained injured for the remainder of the campaign. Southampton dropped valuable points against Argyle in April, when they lost 1–0 at Home Park and were held to a goalless draw at The Dell, with the Devon club pulling five points ahead at the top of the league table.", "!scope=\"row\"|Jack Elkes", "|align=\"left\"|Jack Elkes"]}, {"page": "1922–23 Southampton F.C. season", "response": ["The pattern of results continued in the third round, as Bury and Southampton competed a goalless draw at Gigg Lane on 24 February. Again, it took a home replay for the Saints to beat the Shakers, which they did with another single goal from Arthur Dominy. In the fourth round, Southampton hosted fellow Second Division side West Ham United, who were then in fourth place in the table. Vic Watson scored for the visitors early on, but a \"clever header\" from Jack Elkes secured a 1–1 draw and forced at replay at Upton Park ten days later. The replay also ended 1–1, with Bill Rawlings scoring for the Saints. A second replay took place on 19 March at Villa Park, the home of top-flight club Aston Villa, in which the Hammers scored the only goal to advance to the semi-finals. Southampton brought in a total of £28,482 in FA Cup receipts, around £4,000 of which was used to improve the facilities at The Dell. West Ham later made it to the 1923 FA Cup Final, the first to be played at Wembley Stadium.", "!scope=\"row\"|Jack Elkes", "|align=\"left\"|Jack Elkes", "|align=\"left\"|Jack Elkes"]}, {"page": "1923–24 Southampton F.C. season", "response": ["Southampton manager Jimmy McIntyre bought and sold several players before the start of the 1923–24 season. One of the first departures during the summer was inside-forward John Cooper, who returned to his former club Darlaston after having made just five league appearances with the Saints during two seasons. Also leaving was outside-left Joe Clark, who was sold to Third Division North side Rochdale after losing his place in the first team to Len Andrews late the previous season. Two players were brought in to take Clark's place – Elias MacDonald from Burton All Saints in May, and Jimmy Carr from Reading in June. Also arriving in the summer were George Harkus, a half-back who joined from First Division side Aston Villa for £250, and Harold Pearson, a forward who was transferred from Brierley Hill Alliance in the Birmingham & District League. Half-back Alex Christie also left for Norwich City after just one season at the club, while Jack Elkes was sold to Tottenham Hotspur for a club record fee of £1,050.", "!scope=\"row\"|Jack Elkes"]}]}}