{"wiki_id": "http://www.wikidata.org/entity/Q6114314", "itemLabel": "Jack Newnes", "itemDescription": "Welsh footballer (1895-1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Newnes", "wikipedia_page": {"main": "Jack Newnes (6 June 1895 – 3 February 1969) was a Welsh professional footballer who played as a half-back. He played amateur football while working as a collier and a steel worker prior to entering professional football with Bolton Wanderers in 1922. He went on to play almost 150 matches in the Football League for Bolton, Nelson and Southport, before moving into non-league football in 1928. Newnes spent several years in the non-league game and represented a number of clubs around Manchester. He won one cap for the Wales national football team in 1926.", "link_mentions": [{"page": "Harry Beadles", "response": ["Beadles never played in the first-team at Sheffield Wednesday, only ever making appearances for the Yorkshire club's reserve side, and was allowed to join Southport in 1926, being appointed club captain on arrival and scoring on his debut during a 1–1 draw with Lincoln City on 28 August 1928. Arriving alongside fellow Welsh international Jack Newnes, Beadles scored 20 league goals during his first season at the club, including hat-tricks during victories over New Brighton and Walsall. He also scored in the side's third round FA Cup victory over First Division side Blackburn Rovers. However, he was forced to miss their fourth round tie against Beadles' former club Liverpool due to injury. He spent three seasons at Southport, finishing as the club's top scorer in all three seasons and setting a new club record by scoring in six consecutive matches, between 21 April 1928 and 15 September 1928."]}, {"page": "1923–24 Nelson F.C. season", "response": ["Nelson entered the FA Cup in the Fifth Qualifying Round, and were knocked out in a replay at that stage by Wigan Borough, having drawn the original tie. A total of 30 players were used by Nelson throughout their 44 first-team matches. The majority of the championship-winning team remained with Nelson. New signings included defender Jack Newnes, who went on to become a Wales international, Billy Caulfield and Eddie Cameron. With 14 goals in 42 appearances, Joe Eddleston was the team's top goalscorer for the third season in succession, and also played the highest number of matches of all the first-team squad. The highest attendance of the season at the club's Seedhill stadium was 12,000 on two occasions, the first of these the opening day game against Clapton Orient on 26 August 1923. The lowest attendance in the league was 7,000 for three different matches, while the FA Cup replay against Wigan Borough attracted a crowd of only 4,000 spectators.", "|align=\"left\"|Jack Newnes"]}, {"page": "1925–26 Nelson F.C. season", "response": ["|align=\"left\"|Jack Newnes"]}, {"page": "Mav Weller", "response": ["In 2015, Weller was named in St Kilda's leadership group along with captain Nick Riewoldt and fellow players Leigh Montagna, Sean Dempster, Jarryn Geary, David Armitage and Jack Newnes. He played 20 matches and kicked 12 goals in his second season with the Saints.  Weller received a one-match ban for an off-the-ball hit on 's Rohan Bewick in round 9."]}, {"page": "1924–25 Nelson F.C. season", "response": ["While there were several changed to the playing staff, the core of the team that had played in the Second Division remained intact. Centre forward Joe Eddleston, Nelson's top goalscorer in each of the previous three seasons, was retained along with captain Clem Rigg, Welsh half-back Jack Newnes and goalkeeper Harry Abbott. The two most senior squad members, David Wilson and goalkeeper Joseph Birds, retired from professional football aged 40 and 36 respectively. Inside forward Dick Crawshaw, who had been the team's second-highest scorer in 1923–24 with five goals, moved to Stalybridge Celtic.Dykes (2009), p. 30 Scottish forward Mike McCulloch ended his two-year association with the club by joining Chesterfield on a free transfer, while half-back Leigh Collins signed for New Brighton. Other players, including William Lammus and Ernest Gillibrand, left Nelson having failed to establish themselves in the first-team during their time with the club.Dykes (2009), p. 37 Manager Wilson spent a total of £750 (£ as of 2011) on new players in the summer of 1924. Billy Bottrill and Bill Ellerington arrived from Middlesbrough, while Barrow full-back James Phizacklea was signed to bolster the defensive line.Dykes (2009), p. 58 Several young players were acquired from local non-League football during the close season, including Ambrose Harris from Briercliffe and Billy Harper, formerly of Feniscowles. The Nelson squad was considered by the local newspaper to be stronger than the one which had won the Third Division North two seasons earlier.", "Nelson began their league campaign on 30 August 1924 with an away match at Southport, who had ended the previous season in seventh position. New signings Billy Bottrill, Bill Ellerington and Joseph O'Beirne went straight into the starting line-up but they could not prevent Southport winning by a single goal from Jack Barber,  giving them their first ever League win against Nelson. A week later, Nelson played their first home game of the season, in which James Phizacklea made his debut for the club. A crowd of around 6,000 saw Ashington beaten 4–0 thanks to goals from Bottrill, Joe Eddleston, Jack Newnes and Sid Hoad. Three days later, Eddleston scored twice as Doncaster Rovers were defeated by three goals to nil in the first midweek match of the campaign. However, Nelson could not continue their winning streak as they lost 0–2 against Accrington Stanley at Peel Park in the following fixture. On 16 September, Nelson achieved their biggest victory in the Football League at that time with a 7–1 win over Durham City at Seedhill. The game saw Eddleston score his first hat-trick since the 3–0 victory away at Rochdale in January 1923, and O'Beirne and Eddie Cameron score their first goals of the season. Four days later, Nelson suffered their third consecutive defeat away from home, losing 0–3 to Barrow at Holker Street. The team continued their good home form the following week with a narrow win against Lincoln City. Nelson named the same team for the seventh game in succession for the trip to Tranmere Rovers on 4 October, but the side were beaten for the fourth straight away match thanks to goals from Dixie Dean and Jimmy Moreton.", "Nelson used a total of 23 players during the 1924–25 season and there were 13 different goalscorers. There were also four squad members who did not make a first-team appearance in the campaign. The team played in a 2–3–5 formation (the standard formation at the time) throughout the campaign, with two full-backs, three half-backs, two outside forwards, two inside forwards and a centre forward. Two players, goalkeeper Harry Abbott and half-back Ernie Braidwood, appeared in all 44 Third Division and FA Cup matches. Joe Eddleston missed just one game, the defeat against Durham City on 29 April, while Welsh international Jack Newnes made 42 appearances in the season. Two players played only once during the season; Fred Smith deputised for Edgar Chadwick at inside-left in the win against Southport on 21 April, and Allan Bottrill appeared in the final match of the season in place of Eddleston. Neither ever played another senior match for the club.", "|align=\"left\"|Jack Newnes"]}, {"page": "Brymbo Institute Cricket and Football Club", "response": ["*  Jack Newnes – Wales International"]}, {"page": "2020 Carlton Football Club season", "response": ["| 32 ||  || Jack Newnes || 26 || 2012 || Northern (U18) || 155 || 55||17||13 ||4 ||222 || 139|| 83|| 53|| 44||0", "|  Jack Newnes ||  || AFL || Delisted free agent signing.", "*Round 12 – Carlton won by four points against Fremantle after Jack Newnes kicked a goal after the final siren, from a 45m set shot outside the boundary line. It was the first time Carlton had won on an after-the-siren kick since Round 22, 1987.", "| Jack Newnes || 13 || 4", "*Jack Newnes, for the 50m after the siren set shot from the boundary line which secured Carlton's Round 12 victory against ."]}]}}