{"wiki_id": "http://www.wikidata.org/entity/Q6111669", "itemLabel": "Jack Chilcott", "itemDescription": "Welsh rugby union and rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Chilcott", "wikipedia_page": {"main": "John \"Jack\" Chilcott (19 August 1885 – 1 July 1973) was a Welsh rugby union and professional rugby league footballer who played in the 1910s. As a Northern Union international he played in the sensational Test Match against Australia on 2 July 1914. This historic match has attained legendary status in the sport. In many ways, the 14-6 victory of the Northern Union over Australia has come to be a metaphor for the values of courage, solidarity and the ability to face adversity that characterise the game.\nThe name for the game was coined as a tribute to the courage of the Northern Union players, with it being compared to the battle fought at Rorke’s Drift in the Zulu War in 1879, when British troops held a post in the face of overwhelming odds. In the game the Northern Union, led by Harold Wagstaff, ended the match with only 10 players and produced an outstanding defensive display to win by 14 points to 6. Jack played club level rugby union (RU) for Ogmore Vale RFC and Cross Keys RFC, and representative level rugby league (RL) for Great Britain and Wales, and at club level for Huddersfield, as a forward (prior to the specialist positions of; prop, hooker, second-row, loose forward), during the era of contested scrums.", "link_mentions": [{"page": "Billy Lynch (rugby league)", "response": ["|Jack Chilcott (Huddersfield & Wales)|| || Fred Carter (Leeds) "]}, {"page": "List of Great Britain national rugby league team players", "response": ["* Jack Chilcott circa-1914", "* Jack Chilcott circa-1914", "* Jack Chilcott circa-1914"]}, {"page": "Chilcott", "response": ["* Jack Chilcott, Welsh rugby player"]}, {"page": "1914 Great Britain Lions tour of Australia and New Zealand", "response": ["* Jack Chilcott, forward for Huddersfield", "Northern Union: Gwyn Thomas, William Davies, Harold Wagstaff (c), Bert Jenkins, Stan Moorhouse, Billy Hall, Johnny Rogers, Percy Coldrick, Douglas Clark, Arthur Johnson, Billy Jarman, Dave Holland, Jack Chilcott", "Northern Union: Gwyn Thomas, Frank Williams, Harold Wagstaff (c), William Davies, Alfred Francis, Fred Smith, Jack O'Garra, Joseph Guerin, Douglas Clark, Fred Longstaff, Dick Ramsdale, John Smales, Jack Chilcott", "Northern Union: Gwyn Thomas, Frank Williams, Harold Wagstaff (c), Bert Jenkins, Stan Moorhouse, Billy Hall, Johnny Rogers, Percy Coldrick, Douglas Clark, Fred Longstaff, Dick Ramsdale, Billy Jarman, Jack Chilcott", "|SR ||10|| Jack Chilcott", "|LF ||8|| Jack Chilcott", "|PR ||13|| Jack Chilcott", "Northern Union: Alf Wood, Stan Moorhouse, Harold Wagstaff (c), Bert Jenkins, William Davies, Billy Hall, Johnny Rogers, Percy Coldrick, James Clampitt, Dick Ramsdale, Fred Longstaff, Jack Chilcott, Arthur Johnson", "Northern Union: Gwyn Thomas, Joseph Houghton, Billy Hall, William Davies, Jack O'Garra, Stuart Prosser, Fred Smith, Joseph Guerin, Billy Jarman, Jack Chilcott, John Smales, Walter Roman, James Clampitt", "Northern Union: Alf Wood, Stan Moorhouse, Billy Hall, Bert Jenkins, William Davies, Johnny Rogers, Fred Smith, Dick Ramsdale, Arthur Johnson, Jack Chilcott, Fred Longstaff, Percy Coldrick, Dave Holland"]}, {"page": "1913–14 Yorkshire Cup", "response": ["|Jack Chilcott||10||W. H. Mitchell"]}]}}