{"wiki_id": "http://www.wikidata.org/entity/Q6111012", "itemLabel": "Jack Angus", "itemDescription": "Scottish footballer (1868-1933)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Angus_(footballer,_born_1868)", "wikipedia_page": {"main": "John William Angus (1 December 1868 –1933) was a Scottish professional footballer who played as an outside left for Everton during the inaugural English Football League season, 1888/89. He later appeared as a forward in Southampton's inaugural season in the Southern League, 1894/95.", "link_mentions": [{"page": "Herbert Ward (footballer)", "response": ["In 1894 Southampton were founder members of the Southern League. In the inaugural season Ward was asked to take over the role of centre forward. According to Holley & Chalk's \"Alphabet of the Saints\" he was \"a tireless worker at all times\"; he was joint top-scorer (with Charles Baker and Jack Angus) for the team for the 1894–95 season with six league goals from only nine appearances, and his goalscoring abilities earned him five Hampshire County caps, two as captain."]}, {"page": "John Angus", "response": ["John or Jack Angus may refer to:", "*Jack Angus (footballer, born 1868) (1868–1933), Scottish footballer, who played for Ardwick, Southampton and Fulham", "*Jack Angus (footballer, born 1909) (1909–1965), English footballer, who played for Exeter City from 1930 to 1948"]}, {"page": "Harry Offer", "response": ["In 1894, Southampton were one of the nine founder members of the Southern League, which had been created to enable clubs in southern England, who were not admitted to the Football League to play competitive football on a regular basis. For Southampton's inaugural league season, Offer was part of a forward line-up including Jack Angus, Charles Baker, Fred Hollands and Herbert Ward. Saints' first league match was played at The Antelope Ground on 6 October 1894; Offer opened the scoring in a 3–1 victory over Chatham."]}, {"page": "Antelope Ground", "response": ["Before the start of the 1893–94 season, the Saints signed further players on professional terms, including Jack Angus and Harry Offer, who had previously played for Ardwick (later Manchester City) and Royal Arsenal respectively. In the FA Cup, Uxbridge were defeated 3–1 at the Antelope Ground, before a defeat at Reading in the next round. In the local cups, the Saints were defeated 1–0 by the Royal Engineers (Aldershot) in the final (with Angus being sent off), played at the County Ground, but did gain revenge by winning the Hampshire County Cricket Club Charity Cup 5–0 a few weeks later.", "Saints' first league match was played at the Antelope Ground on 6 October 1894 in front of a crowd estimated at between 4,000 and 5,000, who paid 6d each for admittance; Harry Offer, Jack Angus and Fred Hollands scored in a 3–1 victory over Chatham. During the match, Chatham's centre-forward, Gamble, was sent-off for making \"uncomplimentary\" comments to the referee following Southampton's second goal, for which he claimed the ball had been \"carried right into goal on one of the player's arms\".", "The Saints' first defeat at the Antelope Ground came against Luton on 22 December (2–1), whilst their best result was a 7–1 victory over Swindon Town on 30 March, with two goals each from Jack Angus and Herbert Ward. Saints finished their inaugural league season in third place, behind Millwall and Luton Town."]}, {"page": "Freemantle F.C.", "response": ["Freemantle and Southampton St. Mary's next cup meeting was in the semi-final of the Hampshire Senior Cup on 24 February 1894, when the Saints gained their revenge for the previous season's defeat, with a 2–1 victory in a replay (despite having Jack Angus sent off for an \"over zealous\" tackle) after a 1–1 draw in the first match, with both matches played at the County Ground."]}, {"page": "1891–92 Ardwick A.F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Jack Angus", "| Jack Angus", "| Jack Angus"]}, {"page": "1892–93 Ardwick A.F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Jack Angus", "| Jack Angus", "| Jack Angus", "|  Jack Angus"]}, {"page": "1894–95 Southampton St. Mary's F.C. season", "response": ["Saints' first league match was played at the Antelope Ground on 6 October 1894 in front of a crowd estimated at between 4,000 and 5,000, who paid 6d each for admittance; Harry Offer, Jack Angus and Fred Hollands scored in a 3–1 victory over Chatham. During the match, Chatham's centre-forward, Gamble, was sent-off for making \"uncomplimentary\" comments to the referee following Southampton's second goal, for which he claimed the ball had been \"carried right into goal on one of the player's arms\".", "The Saints' first home defeat came against Luton on 22 December (2–1), having previously lost at Luton by a 4–1 scoreline; the worst defeat (4–0) came at Millwall on 23 March with their best result coming a week later, a 7–1 victory over Swindon Town on 30 March, with two goals each from Jack Angus and Herbert Ward. Saints finished their inaugural league season in third place, behind Millwall and Luton Town."]}, {"page": "1895–96 Southampton St. Mary's F.C. season", "response": ["| Jack Angus"]}, {"page": "John Angus (footballer, born 1867)", "response": ["Tragically, by the time Everton, the newly-crowned champions of England, kicked off their 1891/92 campaign, again at W.B.A, only this time ending up on the wrong end of a 4–0 hiding, Jack Angus would be dead. A short paragraph in the Liverpool Mercury, dated 10 August 1891, reads:"]}, {"page": "1893–94 St. Mary's F.C. season", "response": ["Having embraced professionalism in the previous season, the club recruited two players from The Football League in the summer of 1893: Jack Angus from Ardwick and Harry Offer, who had previously been with Royal Arsenal. The season started well, with four consecutive victories in friendly matches, including a 9–2 victory over Christchurch (in which Angus scored four) on 22 September and a 7–0 victory over the Royal Engineers two weeks later.", "The first match ended in a 1–1 draw so the teams met again three weeks later. Despite having Jack Angus sent off for an \"over zealous\" tackle (thus becoming the first St. Mary's player to be dismissed) and Freemantle having a shot hit the crossbar, St. Mary's won the replay 2–1 to set up the final with the Royal Engineers.", "| Jack Angus"]}]}}