{"wiki_id": "http://www.wikidata.org/entity/Q6116781", "itemLabel": "Jacko Page", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Jacko_Page", "wikipedia_page": {"main": "Lieutenant General Jonathan David \"Jacko\" Page,  (born 25 February 1959) is a retired senior British Army officer.", "link_mentions": [{"page": "St Benet's Hall, Oxford", "response": ["*General Jacko Page, alumnus and lieutenant general of the 6th Infantry Division, British Army"]}, {"page": "Jacko", "response": ["* Jacko Page (born 1959), British Army general"]}, {"page": "16 Air Assault Brigade Combat Team", "response": ["During the build-up to the invasion of Iraq, the brigade, commanded by Brigadier Jacko Page, was deployed to Kuwait in February 2003. The brigade was part of 1 (UK) Armoured Division and after extensive training in Kuwait it took part in the beginning of the invasion on 20 March. The brigade's objective was to secure the southern oil fields before they were destroyed by Saddam Hussein's forces. The brigade's 7th Parachute Regiment, Royal Horse Artillery entered Iraq on 20 March to support U.S. Marine Corps forces in their efforts to capture the Rumaila oil fields, nearly all of the oil wells being taken intact. The rest of the brigade, supported by its AAC helicopters, entered Iraq soon afterwards, still tasked with securing Rumaila. The brigade often met sporadic resistance and had to deal with disarming the many explosives attached to the infrastructure.", "*2002–2004 Brigadier Jacko Page (late Parachute Regiment)"]}, {"page": "Operation Achilles", "response": ["May 1: southern Afghanistan NATO Commander Major-General Ton van Loon of the Netherlands was succeeded by Major-General Jacko Page of the United Kingdom."]}, {"page": "Coalition combat operations in Afghanistan in 2007", "response": ["On May 1, British Major-General Jacko Page replaced Dutch Major-General Ton van Loon as ISAF Regional Commander South.British Maj.-Gen. Jacko Page takes helm of ISAF's southern command"]}, {"page": "Director Special Forces", "response": ["* 2009–2012 Major General Jacko Page (late Parachute Regiment)"]}, {"page": "Jonathan David Page", "response": ["#REDIRECT Jacko Page"]}, {"page": "Train Advise Assist Command – South", "response": ["* 1 May 2007: British Major-General Jacko Page"]}, {"page": "Jonathan Page", "response": ["* Jacko Page (Jonathan Page), British general"]}, {"page": "Kevin Hurley", "response": ["On 1 February 1993, he transferred once more to the Royal Military Police, Territorial Army, as a Major with seniority from 2 March 1991. He was mobilised for the 2003 invasion of Iraq. He first served as the CBRN advisor to Brigadier Jacko Page, the commander of 16 Air Assault Brigade."]}, {"page": "General Page", "response": ["*Jacko Page (born 1959), British Army lieutenant general"]}]}}