{"wiki_id": "http://www.wikidata.org/entity/Q6115003", "itemLabel": "Jack Sangster", "itemDescription": "British industrialist and philanthropist", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Sangster", "wikipedia_page": {"main": "John Young Sangster (29 May 1896 – 26 March 1977, more commonly known as Jack Sangster) was a British industrialist and philanthropist. He was an important figure in the British motorcycle industry, where he was involved with Ariel, BSA and Triumph.", "link_mentions": [{"page": "Birmingham Small Arms Company", "response": ["BSA produced the first Sunbeam bicycle catalogue in 1949 and produced its own '4 Star' derailleur gear with an associated splined cassette hub and 4 sprocket cassette.BSA Cycles Ltd, 1951 Bicycle Replacement Parts, BSA, Sunbeam, New Hudson Birmingham Small Arms Company Ltd, no ISBN This design was different from the 1930s Bayliss Wiley cassette hub which had a threaded sprocket carrier.  BSA bought New Hudson motorcycle and bicycle business in 1950 and followed this up in 1951 with the purchase of Triumph Motorcycles which brought Jack Sangster onto the BSA board. The effect of this acquisition was to make BSA into the largest producer of motorcycles in the world at that time.", "Sir Bernard Docker remained chairman of BSA until 1956 when the BSA removed him.  In an acrimonious dispute conducted in the media the matter was brought to the BSA shareholders at the Annual General Meeting where the decision of the Board was upheld. Another significant departure for the fortune of the BSA Group but less controversial was the retirement on ill health grounds of James Leek CBE, managing director from 1939 until his retirement. Sir Bernard Docker was replaced as Chairman of the BSA Board by Jack Sangster.", "The good times were coming to an end and demand for bicycles fell with the end of rationing in 1954.BBC ON THIS DAY | 4 | 1954: Housewives celebrate end of rationing James Leek, managing director of BSA Cycles Ltd was suffering ill health and he retired in 1956, the same year the BSA Chairman, Sir Bernard Docker,Time magazine 11 June 1956 was removed from the BSA Board. Jack Sangster who had joined the BSA Board in 1951 following the purchase of his company Triumph Motorcycles became chairman. The bicycle manufacturing business BSA Cycles Ltd was sold to Raleigh Industries in 1957."]}, {"page": "Daimler Company", "response": ["Jack Sangster sold his motorcycle companies Ariel and Triumph to BSA in 1951 and joined their board. In 1956 Sangster was elected chairman, defeating Sir Bernard 6 votes to 3. After a certain amount of electioneering by the Dockers an extraordinary shareholders' meeting backed the board decision and Bernard and Norah left buying a brace of Rolls-Royces as they went registering them as ND5 and BD9. Many important European customers turned out to have been Docker friends and did not re-order Daimler cars."]}, {"page": "Triumph Motor Company", "response": ["The company encountered financial problems however, and in 1936 the Triumph bicycle and motorcycle businesses were sold, the latter to Jack Sangster of Ariel to become Triumph Engineering Co Ltd. Healey purchased an Alfa Romeo 8C 2300 and developed a new car model with an Alfa inspired straight-8 engine type named the Triumph Dolomite. Three of these cars were made in 1934, one of which was used in competition and destroyed in an accident. The Dolomites manufactured from 1937 to 1940 were unrelated to these prototypes."]}, {"page": "Triumph Engineering", "response": ["In 1936, the company's two components became separate companies. Triumph always struggled to make a profit from cars, and after becoming bankrupt in 1939 was acquired by the Standard Motor Company. The motorcycle operations fared better, having been acquired in 1936 by Jack Sangster, who also owned the rival Ariel motorcycle company. That same year, the company began its first exports to the United States, which quickly grew into the company's single most important market. Sangster formed the Triumph Engineering Co Ltd. largely directed by ex-Ariel employees, including Edward Turner who designed the 500 cc 5T Triumph Speed Twin—released in September 1937, and the basis for all Triumph twins until the 1980s. Contrary to popular belief, however, this was not Triumph's first parallel twin. The first was the Val Page designed model 6/1, introduced in 1933. This first twin performed well as a racer but was ultimately unpopular with the public and did not sell well.  After Turner arrived, with his usual brusque manner, the 6/1 ended, later to be replaced with Turner's design. The 6/1 engine was later reused, somewhat modified, as the BSA A10. In 1939, the 500 cc Tiger T100, capable of , was released, and then the war began."]}, {"page": "Bournbrook", "response": ["Until the mid-sixties, Bournbrook was the home to Ariel motorcycles owned by first Charles Sangster then his son Jack Sangster, and with their main factory in Dale Road. Ariel was the first motorcycle company to employ noted designer Edward Turner from Peckham to join their established engineer, Val Page. He introduced the Ariel Square Four model and re-vamped their Ariel Red Hunter range. Ariel acquired Triumph motorcycles  before the Second World War and, with Triumph, was itself later absorbed into the Birmingham Small Arms group when Jack Sangster joined their board. Although introducing new models, the Ariel Leader and Ariel Arrow, the Bournbrook site gradually lost importance within the BSA group with their final model, the ignominious Ariel 3 being wholly produced at Small Heath."]}, {"page": "1981–82 WHL season", "response": ["|Coach of the Year - Dunc McCallum Memorial Trophy: Jack Sangster, Seattle Breakers"]}, {"page": "Ariel Motorcycles", "response": ["Components Ltd. suffered several financial crises including spells in receivership in 1911 and in the early 1930s. In 1932, Components Ltd went bankrupt, and Jack Sangster, Charles Sangster's son, bought the Ariel subsidiary from the receivers at a bargain price. The company was renamed Ariel Motors (J.S.) Ltd, and promptly resumed production. A new factory was set up at Selly Oak in Birmingham. One of their first bikes was the Ariel Square Four, designed by Edward Turner, followed by the Ariel Red Hunter. The Red Hunter was a success, and enabled Ariel to purchase Triumph.", "In 1951, Jack Sangster sold Ariel and Triumph (bought in 1936) to the Birmingham Small Arms Company group (BSA) and joined their board. Ariel began making the 500 cc KH model and the 650 cc Huntmaster, which had an engine based on the BSA A10 parallel twin. Reliable and capable of , the Huntmaster proved popular with sidecar enthusiasts.", "Ariel resumed making motor cars in 1922 when it launched the Ariel Nine light car. The Nine had a 997 cc water-cooled side-valve flat twin engine with \"square\" dimensions of 85 mm bore and 85 mm stroke made by A Harper Sons & Bean, Ltd of Dudley. The Nine was designed by Jack Sangster, the son of Ariel's owner, who had designed the similar, but air-cooled, twin-cylinder Rover 8 when he worked for Rover."]}, {"page": "New Imperial Motors", "response": ["===Jack Sangster===", "Jack Sangster, of Ariel and Triumph, announced on 30 December that he had purchased New Imperial and that production would continue, and on 27 January 1939, production resumed."]}, {"page": "Edward Turner (motorcycle designer)", "response": ["By now, living at various addresses in Peckham and East Dulwich, in the London Borough of Southwark and running Chepstow Motors, a Peckham Road motorcycle shop with a Velocette agency, Turner conceived the Square Four engine in 1928. At this time he was looking for work, showing drawings of his engine design to motorcycle manufacturers. The engine was essentially a pair of 'across frame' OHC parallel twins joined by their geared central flywheels, with a one-piece four-cylinder block (or Monobloc) and single head. The idea for the engine was rejected by BSA, but adopted by Ariel. Thus it became the Ariel Square Four, and not the BSA Square Four. Turner was then invited by Jack Sangster to join Ariel.", "By 1929, at Ariel, Jack Sangster had Edward Turner and Bert Hopwood working under Val Page in design. Turner, now 28, married Edith Webley.", "In 1936 Triumph decided to create separate motorcycle and car companies, and sell the motorcycle company. Ariel owner Jack Sangster bought it and changed the name to Triumph Engineering Company. The Ariel Square Four changed from the 4F 600 cc OHC version to the 4G OHV 995 cc version that year.", "In 1942, Turner designed a generator, using an all-alloy Triumph vertical twin engine, for the Air Ministry. After a heated disagreement with Jack Sangster, Turner quit his position at Triumph and promptly became chief designer at BSA, where he worked on a side-valve vertical twin for the War. Bert Hopwood was made Triumph's new designer and Sangster put him to work on a 500 cc side-valve twin competing for the same contract.", "In 1956, after a boardroom struggle over power and control, Jack Sangster became Chairman of BSA Group, succeeding Sir Bernard Docker. He appointed Turner Chief Executive of the Automotive Division (comprising BSA, Ariel, Triumph, Daimler and Carbodies – makers of London taxicabs)."]}, {"page": "Rover 8", "response": ["The Rover 8 light car announced in October 1919A New Light Car. The Times, Saturday, Oct 25, 1919; pg. 5; Issue 42240 was designed by Jack Sangster largely before he joined Rover. Built in a new factory in Tyseley, Birmingham it was driven to Coventry to have its body fitted. It was a great sales success for the company."]}, {"page": "Sangster", "response": ["*Jack Sangster (1896–1977), English motorcycle manufacturer"]}, {"page": "Bert Hopwood", "response": ["Hopwood left school at an early age to work for Ariel under designer Val Page. Following Jack Sangster's purchase of Triumph in 1936, Hopwood moved there under Edward Turner and assisted with the design of the Triumph Speed Twin which influenced many motorcycles of the time and since.  His success led to an offer from rival manufacturer Norton in April 1947, where he designed the 500cc Norton Dominator engine. This came to a somewhat acrimonious end when the Technical Director, Joe Craig, refused to release the complete machine for production, despite Norton's financial situation. This was based on the allegation that the engine lacked power and the performance was below par as a result. It was subsequently produced with no alterations to the engine, after Hopwood had left the company."]}, {"page": "Bernard Docker", "response": ["He was succeeded by Jack Sangster as Chairman of BSA, following a 1956 boardroom coup. He also served as the chairman of the British Hospitals Association.", "At the end of May 1956, Docker was removed from the board of Birmingham Small Arms Company (BSA), and he was replaced as chairman of BSA by Jack Sangster. The company, which owned the Docker Daimlers, had the Dockers return them."]}, {"page": "Siegfried Bettmann", "response": ["In 1921 Bettmann further diversified into car production and bought the Dawson Car Company to produce the Triumph 10/20. In 1927 he developed the Triumph Super 7 which sold well until 1934. In 1930 the company changed its name to the Triumph Motor Company and produced the Triumph Southern Cross and Gloria ranges. In 1936 the company had financial problems, and in 1936 the Triumph bicycle and motorcycle businesses were both sold. The motorcycle business was bought by Jack Sangster of Ariel Motorcycles to become Triumph Engineering Co Ltd."]}, {"page": "New Imperial Model 76", "response": ["New Imperial ceased trading in 1938, and sold the company to Jack Sangster, owner of Ariel and Triumph motorcycles. Surviving examples prove that limited production continued even after the company was liquidated, however, being assembled from spare parts right up to the outbreak of war, when a former director of New Imperial, Solomon Joseph, negotiated the purchase of the company and moved the equipment to the Triumph works in Coventry to turn it to production for World War II and the Model 76 was finally discontinued."]}, {"page": "Triumph Tiger 80", "response": ["Triumph had been losing money during the great depression of the 1930s and decided to concentrate on car production. However; Ariel Motorcycles Managing Director Jack Sangster had brought his company back into the black with the Ariel Square Four and was persuaded by its designer Edward Turner to take over Triumph.  In 1935, Sangster appointed Turner to run the Triumph motorcycle division.", "Harold \"Harry\" Perrey was a motorcycle trials rider and the Competitions Manager at Ariel during the 1930s and responsible for sporting events to promote  Ariel's motorcycle sales. In 1937, Jack Sangster asked Perrey to create a promotional event for Triumph and he devised a three hour, high speed race for the three Tiger singles around Donington Park race track, followed the next day by a maximum speed lap of the Brooklands circuit. The motorcycles used were a Tiger 70, 80, and 90 from local Triumph dealerships and not specially race prepared. The Brooklands results for the Tiger 80, which was ridden by Allan Jefferies was an average speed of 74.68 mph."]}, {"page": "Outline of motorcycles and motorcycling", "response": ["*Jack Sangster – industrialist who became an important figure in the history of the British motorcycle industry"]}, {"page": "Old Johnians (Hurstpierpoint College)", "response": ["* Jack Sangster, industrialist"]}, {"page": "John Young Sangster", "response": ["#REDIRECT Jack Sangster"]}, {"page": "Charles Thomas Brock Sangster", "response": ["Charles's first born Fredrick Charles Sangster was killed in action during 1916. His second son Jack Sangster went on to become chairman of BSA."]}]}}