{"wiki_id": "http://www.wikidata.org/entity/Q6118734", "itemLabel": "Jacob Henry Tillett", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Jacob_Henry_Tillett", "wikipedia_page": {"main": "Jacob Henry Tillett (1 November 1818 – 30 January 1892 ) was an English Liberal Party politician who sat in the House of Commons variously between 1870 and 1885.\nTillet was born in Norwich, the son of Jacob Tillett and his wife Elizabeth Towler. He became  a solicitor in 1839  and was the political leader of  non-conformity and liberalism in Norwich. He was a lay preacher and trustee of New Catton Sunday School. In 1845 he was one of the founders of Norfolk News with Jeremiah Colman, John Copeman, Thomas Jarrold and Joseph Massingham. He became guardian of Massingham's son Henry William Massingham. Tillett was acquainted with leading liberals including Richard Cobden, Bright and John Morley. Tillet was clerk to the Commissioners of Income Tax and an alderman of Norwich. He campaigned against corruption, setting up a vigilance committee. As mayor in 1859 he exposed attempts to bribe a councillor to elect aldermen. A Conservative councillor noted for that for the first time an election was held in Norwich without drunkenness corruption and bribery.  However Tillett himself was embarrassed by electoral difficulties when he stood for parliament.\nIn July 1870, Tillett was elected at a by-election as a Member of Parliament (MP) for Norwich,\nbut his election was declared void on petition and a new election was held.\nHe contested the seat unsuccessfully at the 1874 general election,\nbut won the seat again at a by-election March 1875,\nand again his election was declared void. This time it was found that party agents had given jobs to voters to secure their votes. The writ for the constituency was suspended and a Royal Commission was appointed to investigate allegations of corruption. He was Mayor of Norwich again in 1875 and was chairman of the Norwich School Board from 1877 to 1880. He was elected successfully for Norwich at the 1880 general election, and held the seat until the 1885 general election, which he did not contest. He stood again in 1886, but was not elected.Tillett lived at Carrow Abbey, and died at the age of 73.", "link_mentions": {}}}