{"wiki_id": "http://www.wikidata.org/entity/Q6110688", "itemLabel": "Jacey Sallés", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Jacey_Sall%C3%A9s", "wikipedia_page": {"main": "Jacey Sallés is a British actress. She portrayed the role of Ramona Ramirez across all five series of ITV drama Cold Feet, and reprised the role when the series was revived. She has also appeared in television shows Hollyoaks, Keith Lemon: Coming in America and My Family, as well as the films Attack the Block and The Misadventures of Margaret. In 2019, she began appearing in Casualty as Rosa Cadenas.", "link_mentions": [{"page": "Casualty (TV series)", "response": ["Currently, the regular cast consists of acting clinical lead Dylan Keogh (William Beck) and consultant Ethan Hardy (George Rainsford) and Stevie Nash (Elinor Lawless); foundation training doctor Rash Masum (Neet Mohan); clinical nurse manager, Jacob Masters (Charles Venn), senior charge nurse and emergency nurse practitioner Charlie Fairhead (Derek Thompson); advanced clinical practitioner Faith Cadogan (Kirsty Mitchell); staff nurses Robyn Miller (Amanda Henderson), David Hide (Jason Durr), Marty Kirkby (Shaheen Jafargholi), and Jade Lovall (Gabriella Leon); operational duty manager Jan Jenning (Di Botcher), paramedics Iain Dean (Michael Stevenson), Teddy Jenning (Milo Clarke) and Sah (Arin Smethurst); and healthcare assistant Rosa Cadenas (Jacey Sallés)."]}, {"page": "List of former Hollyoaks characters", "response": ["| Juanita Salvador Martinez Hernandez De La Cruz || Jacey Sallés || 2016"]}, {"page": "Jacey Salles", "response": ["#REDIRECT Jacey Sallés"]}, {"page": "Myra McQueen", "response": ["The casting team hired Jacey Sallés to play Diego's millionaire mother Juanita Salvador Martinez Hernandez De La Cruz in September 2016. Juanita arrives to assess Myra's suitability for her son as she has promised him \"a large sum of money\" for finding an appropriate match. A show spokesperson told Amy Duncan from the Metro that Myra wants a reconciliation between Diego and Juanita so they can have her money. Juanita's introduction plays a role in one of Myra's scams. After deciding that she would not be a suitable match for Diego in Juanita's eyes, Myra enlists Celine to act as Diego's fiancée. George explained that Myra and the family place \"a lot of pressure\" on Celine to go through with the scheme, even though she does not think it is right. After a change of heart, Myra stops the wedding and Juanita leaves, furious about Diego's relationship. A further twist was included in the episode when four women arrived in the church to claim that Diego is actually a conman."]}, {"page": "Characters of Casualty", "response": ["Rosa Cadenas, portrayed by Jacey Sallés, made her first appearance in the thirty-third series, in an episode originally broadcast on 27 July 2019. The character and Sallés' casting details were first announced on 31 May 2019. Rosa is billed as an \"outspoken and confident\" hospital porter from a Venezuelan background. Sallés described Rosa as \"solitary\", \"fabulous [and] strong\", and \"a passionate, spirited lady, who's full of energy\"."]}, {"page": "Cold Feet (series 6)", "response": ["* Jacey Sallés as Ramona Ramirez"]}, {"page": "The Misadventures of Margaret", "response": ["* Jacey Sallés as Astronaught #1"]}, {"page": "List of Hollyoaks characters (2014)", "response": ["When treating Cameron Campbell (Cameron Moore) for an infection, Celine becomes attracted to him, and she is delighted when he asks her out on a date. However, Cameron is secretly still in love with Tegan's older sister, Leela (Kirsty-Leigh Porter), who is engaged to Ziggy. Cameron later asks Celine for help when he wants to make Leela jealous, and she reluctantly agrees. When this does not work and Leela does not seem jealous, Cameron and Celine sleep together. However, Cameron reads a text message on Celine's mobile phone which reveals that Ziggy and Tegan have feelings for each other, resulting in Cameron confronting Tegan the following day. Cameron later finishes with Celine completely. Celine is now a senior nurse after blackmailing Dr. Charles S'avage (Andrew Greenough). In April 2016, it is revealed that Celine attempted to kill Pete Buchanan (Kai Owen), who was thought to be a victim of serial killer Lindsey Butterfield (Sophie Austin). Celine is later pressured into marrying her aunt, Myra McQueen's (Nicole Barber-Lane) fiancé, Diego Salvador Martinez Hernandez De La Cruz (Juan Pablo Yepez), in an attempt for Diego's mother, Juanita (Jacey Sallés) to give the family £5 million. However, this ultimately ends Celine's blossoming romance with Jesse Donovan (Luke Jerdy). This stresses Celine immensely, as she feels guilty for lying to everybody she knows. On the day of the wedding, Myra declares her love for Diego in front of Juanita, ruining the scam, and so Celine declares her love for Jesse, and they begin a relationship."]}, {"page": "Diego Salvador Martinez Hernandez De La Cruz", "response": ["Jacey Sallés was then cast as Diego's mother Juanita Salvador Martinez Hernandez De La Cruz. The character was billed as glamorous, wealthy and has the best intentions for her son. A publicist from Hollyoaks told Amy Duncan from Metro that Juanita had \"very high hopes\" for Diego and even made monetary promises if she approved of his choice of partner.  They revealed that in Diego's backstory Diego and Juanita became estranged following his divorce from Maria. Her \"hopes were utterly dashed\" and she refused to give Diego money and ceased contact with him. They added that Diego has a \"complicated family history\" and Myra would support a reconciliation between Diego and Juanita."]}, {"page": "List of Hollyoaks characters (2016)", "response": ["D.S. Armstrong (Andrew Hayden-Smith), a police officer, debuted in June. August saw the first appearance of Maria (Fernanda Diniz), the former wife of Diego Salvador Martinez Hernandez De La Cruz (Juan Pablo Yepez), Ryan Knight (Duncan James), the fiancée of Amy Barnes (Ashley Slanina-Davies), and Courtney Campbell (Amy Conachan), the cousin of Cameron Campbell (Cameron Moore). Tracey Donovan (Lisa Maxwell), the mother of Grace, Liam, Jesse and Adam, joined the recurring cast in September, while Juanita Salvador Martinez Hernandez De La Cruz (Jacey Sallés), the mother of Diego, and Billy Brodie (Clive Russell), the estranged brother of Jack Osborne (Jimmy McKenna), were introduced for guest appearances.", "Juanita Salvador Martinez Hernandez De La Cruz, played by Jacey Sallés made her first on-screen appearance on 19 September 2016. She was introduced as the mother of Diego Salvador Martinez Hernandez De La Cruz (Juan Pablo Yepez)."]}, {"page": "Casualty (series 33)", "response": ["On 1 August 2018, Sophie Dainty of Digital Spy reported that former EastEnders actor Shaheen Jafargholi had joined the cast as new nurse, Marty Kirkby. Series producer Lucy Raffety revealed on 15 August 2018 that actress Gabriella Leon would join the show alongside Jafargholi, playing student nurse Jade Lovall. Jade first appears in episode 12, originally broadcast on 3 November 2018, while Marty first appears in episode 13, originally broadcast on 17 November 2018. Raffety also announced plans to introduce new doctors during this series. Genesis Lynea and Jack Nolan were later cast as registrars Archie Hudson and Will Noble. Archie is characterised as \"bold, bolshy and extremely confident\", while Will is billed as unfazed by Archie's personality. Department troubleshooter Ciaran Coulson (Rick Warden) is introduced in episode 37 as part of the semi-regular cast. He is created as an unlikeable character and rival to Connie, who tries to improve the ED after they fail to meet targets. Raffety announced on 31 May 2019 that Jacey Sallés would join the cast as porter Rosa Cadenas during the series and feature in an \"interesting story\" with David. Rosa first appears in episode 44.", "* Jacey Sallés as Rosa Cadenas"]}, {"page": "Casualty (series 34)", "response": ["The thirty-fourth series of Casualty features a cast of characters working in the emergency department of Holby City Hospital. The majority of the cast from the previous series continue to appear in this series. William Beck and George Rainsford appear as Dylan Keogh and Ethan Hardy, both consultants in emergency medicine. Jack Nolan portrays Will Noble, a consultant in pediatric emergency medicine, and Genesis Lynea features as Archie Hudson, an emergency medicine registrar. Longest-serving cast member Derek Thompson stars as Charlie Fairhead, the department's clinical nurse manager, senior charge nurse and emergency nurse practitioner, and Charles Venn portrays Jacob Masters, a charge nurse. The cast portraying the department's staff nurses are: Amanda Henderson (Robyn Miller, Jason Durr (David Hide), Gabriella Leon (Jade Lovall) and Shaheen Jafargholi (Marty Kirkby). Michael Stevenson and Maddy Hill play Iain Dean and Ruby Spark, both paramedics. Di Botcher plays operational duty manager and paramedic Jan Jenning, and Tony Marshall appears as Noel Garcia, the ED receptionist. Jacey Sallés portrays hospital porter Rosa Cadenas and Cathy Shipton stars as former nurse Duffy.", "* Jacey Sallés as Rosa Cadenas"]}, {"page": "Casualty (series 35)", "response": ["The thirty-fifth series of Casualty features a cast of characters working for the NHS within the emergency department of Holby City Hospital and the Holby Ambulance Service. Most cast members from the previous series reprise their roles in this series. William Beck appears as Dylan Keogh, a consultant in emergency medicine, while Di Botcher portrays Jan Jenning, the operational duty manager at Holby Ambulance Service. Olivia D'Lima stars as Fenisha Khatri, a paramedic, and Jason Durr features as David Hide, a senior staff nurse. Uriel Emil plays paramedic Lev Malinovsky, and Amanda Henderson appears as staff nurse Robyn Miller. Shaheen Jafargholi and Gabriella Leon reprise their roles as staff nurses Marty Kirkby and Jade Lovall, respectively. Tony Marshall features as Noel Garcia, a receptionist, and Amanda Mealing portrays Connie Beauchamp, the department's clinical lead and a consultant in emergency medicine. Kirsty Mitchell stars as Faith Cadogan, an advanced clinical practitioner (ACP), and Neet Mohan appears as Rash Masum, a F1 doctor. Jack Nolan portrays Will Noble, a consultant in pediatric emergency medicine, and George Rainsford plays consultant Ethan Hardy. Original cast member Derek Thompson appears as Charlie Fairhead, a senior charge nurse and emergency nurse practitioner. Charles Venn stars as Jacob Masters, the department's clinical nurse manager. Additionally, three cast members feature in a recurring capacity: Harry Collett appears as Oliver Hide, the son of David, Stirling Gallacher plays Ffion Morgan, a police officer, and Jacey Sallés portrays Rosa Cadenas, a healthcare assistant.", "* Jacey Sallés as Rosa Cadenas"]}, {"page": "Casualty (series 36)", "response": ["The thirty-sixth series of Casualty features a cast of characters working for the NHS within the emergency department of Holby City Hospital and the Holby Ambulance Service. Most cast members from the previous series reprise their roles in this series. William Beck appears as Dylan Keogh, a consultant in emergency medicine, while Di Botcher portrays Jan Jenning, the operational duty manager at Holby Ambulance Service. Jason Durr features as David Hide, a senior staff nurse, and Amanda Henderson appears as staff nurse Robyn Miller. Shaheen Jafargholi, Adele James and Gabriella Leon reprise their respective roles as staff nurses Marty Kirkby, Christina \"Tina\" Mollett, and Jade Lovall. Kirsty Mitchell stars as Faith Cadogan, an advanced clinical practitioner (ACP), and Neet Mohan appears as Rash Masum, a F1 doctor. Oli Okerafor portrays locum registrar Matthew Afolami, and George Rainsford plays consultant Ethan Hardy. Jacey Sallés stars as Rosa Cadenas, a healthcare assistant, and Michael Stevenson reprises his role as Iain Dean, a paramedic. Original cast member Derek Thompson appears as Charlie Fairhead, a senior charge nurse and emergency nurse practitioner. Charles Venn stars as Jacob Masters, the department's clinical nurse manager. Additionally, Stirling Gallacher appears in a recurring capacity as Ffion Morgan, a police officer.", "* Jacey Sallés as Rosa Cadenas"]}]}}