{"wiki_id": "http://www.wikidata.org/entity/Q6113205", "itemLabel": "Jack Horton", "itemDescription": "Footballer (1866-1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Horton", "wikipedia_page": {"main": "John Henry Horton, known as Jack Horton (15 February 1866 – 28 December 1946) was an English footballer who played in the English Football League and the 1895 FA Cup Final for West Bromwich Albion. He also played for Burslem Port Vale and Wednesbury Old Athletic. His brother Ezra was also a footballer, and was a teammate of many years at West Brom.", "link_mentions": [{"page": "1895 FA Cup Final", "response": ["Aston Villa and West Bromwich Albion became the first pair of clubs to meet in the FA Cup Final for a third time: the teams had previously met in the 1887 final, won by Villa, and the 1892 final, won by Albion. The final was played for the first time at Crystal Palace, which was to host the finals for the next twenty years. The weather for the final was described as \"a beautiful spring day\", and consequently the crowd and press were still coming into the ground when the game kicked off. From the kick-off, John Devey, the Villa centre-forward, swung the ball out to his inside-left, Dennis Hodgetts. Hodgetts' long cross-pass found Charlie Athersmith on the right, and his centre fell to Bob Chatt who sent the ball goalwards on a half volley. Albion's keeper Joe Reader was only able to get his fingers to the shot, and turned the ball across the goal mouth and, after a goalmouth scramble involving Devey and Albion defender Jack Horton, the ball was turned in to the net. There are no accurate timings for the goal and different reports time it at between 30 and 39 seconds. At the time, many of the crowd and press missed the goal as they were still taking their seats, and the press reports indicated that Chatt had scored. According to Ward & Griffin in their \"Essential History of Aston Villa\" however, \"after the game, the Villa players confirmed that John Devey had netted after Chatt's shot had been blocked straight into the latter's path and had ricocheted off his knee.\" Despite this claim, The Football Association still credit the goal to Chatt as having been scored on thirty seconds. The fastest accurately timed goal was Louis Saha's effort for Everton after 25 seconds in the 2009 final.", "|DF || ||Jack Horton"]}, {"page": "Bob Chatt", "response": ["The final on 20 April 1895 was played for the first time at Crystal Palace, which was to host the finals for the next twenty years. The weather for the final was described as \"a beautiful spring day\", and consequently the crowd and press were still coming into the ground when the game kicked off. From the kick-off, John Devey, the Villa centre-forward, swung the ball out to his inside-left, Dennis Hodgetts. Hodgetts' long cross-pass found Charlie Athersmith on the right, and his centre fell to Chatt who sent the ball goalwards on a half volley. Albion's keeper Joe Reader was only able to get his fingers to the shot, and turned the ball across the goal mouth and, after a goalmouth scramble involving Devey and Albion defender Jack Horton, the ball was turned into the net. There are no accurate timings for the goal and different reports time it at between 30 and 39 seconds. At the time, many of the crowd and press missed the goal as they were still taking their seats, and the press reports indicated that Chatt had scored. According to Ward & Griffin in their \"Essential History of Aston Villa\" however, \"after the game, the Villa players confirmed that John Devey had netted after Chatt's shot had been blocked straight into the latter's path and had ricocheted off his knee.\" Despite this claim, The Football Association still credit the goal to Chatt as having been scored on thirty seconds. Chatt's record stood for 114 years until beaten by Louis Saha's effort for Everton after 25 seconds in 2009."]}, {"page": "List of Charlton Athletic F.C. seasons", "response": ["|Jack Horton"]}, {"page": "1888–89 West Bromwich Albion F.C. season", "response": ["|align=\"left\"|FB||align=\"left\"| Jack Horton"]}, {"page": "John Horton", "response": ["* Jack Horton (1866–1946), English footballer with West Bromwich Albion F.C."]}]}}