{"wiki_id": "http://www.wikidata.org/entity/Q6114008", "itemLabel": "Jack McIntosh", "itemDescription": "strongman", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_McIntosh_(strongman)", "wikipedia_page": {"main": "Jack McIntosh (born 23 August 1988) is a British strongman competitor, who was the youngest competitor at the 2011 World's Strongest Man.", "link_mentions": [{"page": "John McIntosh", "response": ["John or Jack McIntosh may refer to:", "*Jack McIntosh (English footballer) (1876–?), English football forward", "*Jack McIntosh (Australian footballer) (1878–1944), Australian rules footballer for Melbourne", "*Jack McIntosh (politician) (1909–1988), member of the Canadian House of Commons from Saskatchewan", "*Jack McIntosh (strongman) (born 1988), British strongman competitor"]}, {"page": "Britain's Strongest Man", "response": ["In 2011, an event was organised in Boroughbridge advertised to allow spectators to see \"top British strongmen compete to take a step closer towards a place at World's Strongest Man\". The event was organised by multiple World's Strongest Man entrant Darren Sadler and the top two places, won by Rob Frampton and Jack McIntosh, received invitations to North Carolina to compete at the 32nd World's Strongest Man. Clash of the Giants was designed to fill the void left by the absence of the Britain's Strongest Man competition last held in 2008, much as the 1988 John Smith's Trial of Strength had been created following the discontinuation of the BSM in 1984. Unlike the BSM, which is the final stage of a knockout competition comprising a number of regional and national rounds, the Clash of the Giants was a singular event. Because there was no regional tiered competition preceding, it there was no prerequisite that the Clash of the Giants have a field of athletes representing each area of Britain and notably all the athletes competing were English. In addition, the three most successful British strength athletes actively competing at the time, namely Hollands, Felix and Shahlaei, had qualified for the WSM via international grand prix events and did not compete."]}, {"page": "Strength athletics in the United Kingdom and Ireland", "response": ["| Chris GearingEddie HallGraham HicksTerry HollandsJack McIntoshLaurence Shahlaei(injured - withdrew)", "| Mark FelixRob FramptonTerry HollandsJack McIntoshLaurence Shahlaei"]}, {"page": "Giants Live", "response": ["| Jack McIntosh"]}, {"page": "2011 World's Strongest Man", "response": ["| Jack McIntoshJack McIntosh", "|Jack McIntosh"]}, {"page": "Jack McIntosh (Strongman)", "response": ["#REDIRECT Jack McIntosh (strongman) "]}, {"page": "2012 World's Strongest Man", "response": ["| Jack McIntoshJack McIntosh", "|Jack McIntosh"]}]}}