{"wiki_id": "http://www.wikidata.org/entity/Q6114535", "itemLabel": "Jack Parsons", "itemDescription": "English cricketer (1890-1981)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Parsons_(cricketer)", "wikipedia_page": {"main": "The Rev. Canon John Henry Parsons MC (30 May 1890 – 2 February 1981) was an English first-class cricketer for Warwickshire County Cricket Club. A right-handed batsman, he made 17969 runs at 35.72 in his 355-game career which extended over 26 years. He became a Church of England clergyman.\nHe was born in Oxford, and qualified by residence for Warwickshire County Cricket Club after moving to Coventry. He played for the county from 1910 to 1914 as a professional. He was commissioned into the British Army during the Great War, in which he won a Military Cross for gallantry. He continued in the Army afterwards, appearing for his county as an amateur in 1919 and 1923 as Capt. J. H. Parsons. In 1924, he resumed his professional career. In 1929, he was ordained, and from then until his retirement from the game in 1934 played again as an amateur. According to his obituary in Wisden, he might well have played for England but for the break in his career between 1914 and 1923. \"A tall man, who made full use of his height, he was a superb driver of fast bowling, and one of the safest slips of his day.\"\nIn his final game for Warwickshire, against Yorkshire at Scarborough in 1934, under his captaincy, 216 runs were required to win in the fourth innings. Parsons scored 94 out of 121 in under two hours, including three 6s and twelve 4s; Warwickshire won by one wicket.In the 1950s he was vicar of Liskeard in Cornwall. He died in a Plymouth nursing home at the age of 90.", "link_mentions": [{"page": "Arthur Gilligan", "response": ["During the winter of 1926–27, with other candidates unavailable, Gilligan was chosen to captain an MCC team which toured India; the side was not fully representative and did not play Test matches.Marshall, p. 107. In first-class games, he scored three fifties and, bowling infrequently, took ten wickets on the tour. The team, the first to tour India under the colours of the MCC, was very successful.Bose, p. 30. Gilligan left most of the day-to-day organisation to his vice-captain, Raleigh Chichester-Constable,Pawle, p. 27. and did not take his speech-making duties particularly seriously.Pawle, p. 36. He nevertheless had to deal with several issues. One of the team, Jack Parsons, refused for religious reasons to take part in matches that included  "]}, {"page": "John Parsons", "response": ["*Jack Parsons (cricketer) (1890–1981), English cricketer also known as John Parsons", "*Jack Parsons (disambiguation)"]}, {"page": "Bablake School", "response": ["*Jack Parsons (1890–1981), cricketer"]}, {"page": "Jack Parsons", "response": ["Jack Parsons may refer to:", "*Jack Parsons (academic) (1920–2006), sociologist, advocate of population control", "*Jack Parsons (cricketer) (1890–1981), English first class cricketer for Warwickshire County Cricket Club", "*Jack Parsons (producer) (1906–1971), British film producer", "*Jack Parsons (rocket engineer) (1914–1952),  American occultist and rocket propulsion researcher"]}, {"page": "Richard Blakeney", "response": ["Returning to the Raj, Blakeney made his first-class debut for the Europeans (India) against the Marylebone Cricket Club in 1926.  In the Marylebone Cricket Club's first-innings he took a single wicket, that of Jack Parsons.  In the Europeans first-innings he scored 16 runs before being dismissed by Maurice Tate.  He played his second first-class match in 1934 for Sind against Northern India.  In the Sind first-innings he scored just a single run before being dismissed by Baqa Jilani, and in their second-innings he scored 5 runs, being  dismissed by Khadim Hussain."]}, {"page": "Parsons, John Henry", "response": ["#redirectJack Parsons (cricketer)"]}, {"page": "List of Warwickshire County Cricket Club players", "response": ["* Jack Parsons (1910–1934) : J. H. Parsons (312)"]}, {"page": "List of Gentlemen cricketers (1841–1962)", "response": ["* Jack Parsons (1929–1931)"]}, {"page": "List of Marylebone Cricket Club players (1919–1939)", "response": ["* Jack Parsons (1926/27–1936) : J. H. Parsons (Warwickshire). Tours: India & Ceylon (1926/27)."]}, {"page": "History of English cricket from 1919 to 1939", "response": ["Warwickshire were bottom of the table in 1919 and, apart from a few seasons after 1930 when they reached the top ten (including a creditable fourth in 1934), were always in the bottom half. Warwickshire's best player was the England batsman Bob Wyatt. Other noted batsmen were Leonard Bates, Tom Dollery, Norman Kilner and Jack Parsons. Harry Howell was their best bowler in the 1920s. In the 1930s, Warwickshire had Joseph Mayer, George Paine and the young Eric Hollies. The wicket-keeper in the 1920s was Tiger Smith, who had made his debut in 1904; he was followed by Jack Smart and John Buckingham."]}]}}