{"wiki_id": "http://www.wikidata.org/entity/Q6115118", "itemLabel": "Jack Shelton", "itemDescription": "English footballer (1884-1918)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Shelton_(footballer)", "wikipedia_page": {"main": "John Shelton (1884 – 7 September 1918) was an English footballer who played as a right-half and inside-forward. He was the elder brother of George Shelton. He played for Wolverhampton Wanderers in the 1908 FA Cup Final and later won minor cup competitions with Port Vale.", "link_mentions": [{"page": "1908 FA Cup Final", "response": ["| || ||Jack Shelton"]}, {"page": "John Shelton", "response": ["*Jack Shelton (1905–1941), Australian rules footballer", "*Jack Shelton (footballer) (1884–1918), English soccer player", "*Jack Shelton (disambiguation)"]}, {"page": "Jack Shelton", "response": ["As a VFL footballer, he was sometimes known as \"J. A. Shelton\" (rather than \"J. T. Shelton\" ), with the \"A\" most likely a reference to Avenel, in order to distinguish him from the other \"Jack Shelton\", one John Frederick \"Jack\" Shelton, a prolific goalkicker, who had been recruited from Koo Wee Rup in 1926 (and was playing for St Kilda at the same time).Main and Allen, (2002), pp.335-336.", "He returned to Avenel for the 1927 season; and, rejoined play with St Kilda in mid-1928, resuming his senior career in the eighth round match against Essendon, in the first ruck, at Windy Hill, on 4 June 1928.Football: The Teams: Essendon v. St. Kilda,The Argus, (Monday 4 June 1928), p.6; Note: the\"St Kilda Team\" in the photograph that appears on the same page is the team (minus Jack Shelton), that lost to Footscray by one point two days earlier. Shelton played very well in his first game back in the VFL, and St Kilda won by 9 points.Football: St. Kilda Defeats Essendon,The Argus, (Tuesday 6 June 1928), p.6. He played eleven senior matches for St Kilda in 1928 (rounds 8 to 18 inclusive) and six in 1929, with his last match against Richmond, at the Punt Road Oval on 13 July 1929 (round eleven).Football: The Teams: Richmond v. St. Kilda, The Argus, (Friday, 12 July 1929), p.15.Poor Game: Richmond Scrambles Home, The Argus, (Monday, 15 July 1929), p.15."]}, {"page": "Jack Needham", "response": ["Needham married Sarah Shelton, the widow of his former Wolves teammate Jack Shelton."]}, {"page": "George Shelton (footballer, born 1894)", "response": ["George Henry Shelton (1894 – 1960) was an English footballer who played at inside-right for Wellington Town and Port Vale. He was the younger brother of Jack Shelton."]}, {"page": "John F. Shelton", "response": ["A forward, he was St Kilda's leading goalkicker for three consecutive seasons in 1925, 1926 and 1927.Sharland, W.S., \"McNamara;s Successor: Jack Shelton, Wonderful Distance Kick\", The Sporting Globe, (Saturday, 30 June 1928), p.6.Kicking Finals: Champions at Melbourne Ground on Friday, The Sporting Globe, (Wednesday, 19 September 1928), p.8.", "On Saturday, 7 August 1926, as the extensive contemporary newspaper reports attest, Shelton was involved in an act of violence directed at Geelong's full-back Arthur Rayson (who also worked as the caretaker at the Corio Oval), through which Rayson received broken ribs, amongst other injuries. The spectators' response to Rayson's injury, specifically directed at Shelton was such that Shelton required police protection from attacks with fence pickets.Football Sensations: Disgraceful Scenes: Police Intervention at Geelong, The Argus, (Monday, 9 August 1926), p.11.Football: Topical and Personal: Melee at a Melbourne Match, The (Adelaide) Advertiser, (Friday, 13 August 1926), p.25.Brawl at Geelong: Players and Spectators Fight: Picket Used in Melee, The Age, (Monday, 9 August 1926), p.7.A Spiteful Game, The Argus, (Monday, 9 August 1926), p.16.St Kilda Outplayed, The Age, (Monday, 9 August 1926), p.7.It is important to note that Main and Allen, (2002, p.336) have, along with Feldman and Holmesby (1992), become confused between this \"Jack Shelton\" (John Frederick \"Jack\" Shelton), and the other St Kilda \"Jack Shelton\" (John Thomas \"Jack\" Shelton). They have mistakenly stated that it was the second Jack Shelton involved in this incident; when, in fact, not only was it most definitely this Jack Shelton who was involved, but also a plain fact that the second Jack Shelton did not play in that St Kilda team, against Geelong, on that day,at all."]}, {"page": "1915–16 Stoke F.C. season", "response": ["|MF||align=\"left\"| Jack Shelton"]}, {"page": "Jack Shelton (disambiguation)", "response": ["Jack Shelton may refer to:"]}, {"page": "1916–17 Port Vale F.C. season", "response": ["Following a year in effective hibernation, the club reinstated first-team football after chairman Frank Huntbach \"realised that the war workers needed recreation as much as ever and as long as the players were men working for the war effort, no harm could be done\". The club were fortunate to gain admittance to the Football League's Lancashire Region, allowing them to compete with clubs such as Liverpool, Manchester City and Preston North End. Manager Tom Holford re-signed Teddy Bateup, Edgar Bentley, Jim Bennett, Jack Shelton, Joe Brough and Jock Cameron to give some continuation of the team that had competed well in The Central League. However attempts to re-sign former top-scorer Chris Young failed as he opted to stay with Grimsby Town.", "A six-match Subsidiary Tournament concluded the season, with the Vale going unbeaten at home against Stoke, Manchester City and Manchester United. They recorded a 3–2 victory over Stoke and beat United 5–2 after being helped by guest player Billy Meredith. The club's annual meeting revealed a profit of £692 as the gate receipts of £2,582 were well above the playing wages of £649. Wartime football was profitable but had its unique challenges, with Holdford, Brough, Needham, Bentley and Jack Shelton all needing replacing at the end of the season as they were conscripted.", "|align=\"left\"|FW||align=\"left\"| Jack Shelton"]}, {"page": "1917–18 Port Vale F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Jack Shelton"]}, {"page": "1918–19 Port Vale F.C. season", "response": ["With Tom Holford largely unavailable, Jock Cameron was promoted to captain and team manager. The squad had to be made up largely of players available and willing to play, with only the Pearson brothers (Harry and Albert) offering much in the way of continuity from the previous campaign. The team started with a four-game unbeaten run, only to pick up one point from their next six games. The poor run included an embarrassing 8–1 defeat by Stoke at the Old Recreation Ground. The war was drawing to a close, ending on 11 November, but not before claiming the lives of Bob Suart and Jack Shelton. Vale beat bottom-club Burnley 4–2 five days later, and began to be strengthened by first-team players who returned from their wartime duties – as were every other club however. From this point Vale began winning their home games but losing their away matches, ending this run with a 2–0 win over Preston North End at Deepdale on 18 January – the first away win of the campaign. A sign of things returning to normal was the sale of Albert Pearson to Liverpool in January."]}]}}