{"wiki_id": "http://www.wikidata.org/entity/Q6113441", "itemLabel": "Jack Kennedy", "itemDescription": "English footballer (born 1906)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Kennedy_(footballer,_born_1906)", "wikipedia_page": {"main": "Jack Kennedy (1906 – after 1932) was an English footballer who played as an inside left for Blyth Spartans, Sheffield United, Tranmere Rovers, Exeter City and Torquay United.Kennedy joined Torquay on November 9th, 1933 to enable Torquay to field a side at Reading on Nov 10th. T. Walters also signed for Torquay from Exeter on the same date and for same reason. Both played on 10th November.", "link_mentions": [{"page": "Jack Kennedy (disambiguation)", "response": ["Jack Kennedy is a common popular reference to John F. Kennedy (1917–1963), the 35th president of the United States.", "Jack Kennedy may also refer to:", "*Jack Kennedy (footballer, born 1873), Scottish international football player", "*Jack Kennedy (footballer, born 1906), English football player", "*Jack Kennedy (hurler), Irish forward", "*Jack Kennedy (jockey) (born 1999), Irish jockey", "*Jack Kennedy (train robber) (c. 1870–1922), American outlaw", "*Jack Kennedy (Virginia politician) (born 1956), member of the Virginia House of Delegates", "*Uncle Jack Kennedy (1919–2005), activist and spokesman for Australian Aboriginal rights"]}, {"page": "Jack Kennedy (footballer born 1906)", "response": ["#REDIRECT Jack Kennedy (footballer, born 1906)"]}, {"page": "Mick Connaboy", "response": ["Although Yeovil offered terms to Connaboy for the 1931–32 season, and amid interest from other Football League clubs, he signed for Second Division club Wolverhampton Wanderers. As part of the deal, Wolves played a friendly match at Yeovil's ground, which they won 8–4, Connaboy scoring their fourth goal. Speculation by the Daily Express that the existing forwards would prove \"difficult to displace\" proved accurate. He never played for Wolves' first team, and signed for Exeter City of the Third Division South after just one season. He played in Exeter's first four league matches – their first goal of the season came when Bristol City's goalkeeper was shoulder-charged over the line after collecting Connaboy's shot, and he scored in their second match, a 5–3 defeat to Northampton Town – but was dropped in favour of Jack Kennedy and never regained his first-team place."]}]}}