{"wiki_id": "http://www.wikidata.org/entity/Q6114758", "itemLabel": "Jack Raymond", "itemDescription": "British actor and film director (1886-1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Raymond", "wikipedia_page": {"main": "Jack Raymond (1886–1953) was an English actor and film director. Born in Wimborne, Dorset in 1886, he began acting before the First World War in A Detective for a Day. In 1921 he directed his first film and gradually he wound down his acting to concentrate completely on directing - making more than forty films in total before his death in 1953.He was associated with the Hepworth Studios of Walton on Thames, since his portrait appears on a studio publicity postcard when he was probably in his early twenties.\nHe had a major success in 1930 with The Great Game, one of the earliest films devoted to football and followed it up with Up for the Cup a year later. He remade Up for the Cup in 1950.", "link_mentions": [{"page": "1931 in film", "response": ["*The Speckled Band, directed by Jack Raymond, starring Raymond Massey – (GB)", "*Tilly of Bloomsbury, directed by Jack Raymond, starring Sydney Howard, Phyllis Konstam (Britain)"]}, {"page": "Anton Walbrook", "response": ["| Jack Raymond"]}, {"page": "Alice Duer Miller", "response": ["*Come Out of the Pantry, directed by Jack Raymond (UK, 1935, based on the novel Come Out of the Kitchen)"]}, {"page": "The Last Command (1928 film)", "response": ["In 1928 Hollywood, director Leo Andreyev (William Powell) looks through photographs for actors for his next movie. When he comes to the picture of an aged Sergius Alexander (Emil Jannings), he pauses, then tells his assistant (Jack Raymond) to cast the man. Sergius shows up at the Eureka Studio with a horde of other extras and is issued a general's uniform. As he is dressing, another actor complains that his continual head twitching is distracting. Sergius apologizes and explains that it is the result of a great shock he once experienced.", "* Jack Raymond as the Assistant Director"]}, {"page": "Marie Glory", "response": ["* The King of Paris (dir. Jack Raymond, 1934), as Maike Tamara"]}, {"page": "'Neath Brooklyn Bridge", "response": ["*Jack Raymond as Sniffy"]}, {"page": "Sydney Howard", "response": ["Already a major stage star, Howard made his feature film début in Jack Raymond's Splinters (1929), and went on appearing in unique roles in films such as French Leave, Up for the Cup and The Mayor's Nest. Despite his popularity in the 1920s and 1930s films he appeared in, Howard is almost totally forgotten today. His most revived film is When We Are Married, in which he played a drunken photographer."]}, {"page": "The Great Game (1930 film)", "response": ["Category:Films directed by Jack Raymond"]}, {"page": "Sewell Stokes", "response": ["Stokes, together with Christine Jope-Slade, wrote the play Britannia of Billingsgate, which was produced by A. R. Whatmore at the St Martin's Theatre, London, on 30 November 1931 and made into a film of the same name, directed by Sinclair Hill, in 1933.  Other screenwriting successes followed in 1934 with Rolling in Money, directed by Albert Parker, and in 1941 when Stokes co-wrote, with Lydia Hayward, the script for the film You Will Remember, directed by Jack Raymond. The film was based on the life of the popular late Victorian songwriter Leslie Stuart, played here by Robert Morley, and co-starred Emlyn Williams as Stuart's best friend."]}, {"page": "List of British films before 1920", "response": ["| A Midnight Adventure || Frank Wilson || Alma Taylor, Jack Raymond, Harry Royston || Drama ||", "| Creatures of Clay || Frank Wilson || Alice De Winton, Stewart Rome, Jack Raymond || Crime ||", "| In the Shadow of Big Ben || Frank Wilson || Tom Powers, Alma Taylor, Jack Raymond || Thriller ||"]}, {"page": "List of American films of 1932", "response": ["|Life Goes On || Jack Raymond || Elsie Randolph, Betty Stockfeld || Crime || Paramount "]}, {"page": "List of British films of 1940", "response": ["|The Missing People||Jack Raymond||Will Fyffe, Kay Walsh||Mystery||"]}, {"page": "List of British films of 1941", "response": ["|You Will Remember||Jack Raymond||Robert Morley, Emlyn Williams||Musical||"]}, {"page": "List of British films of 1950", "response": ["|Up for the Cup||Jack Raymond||Albert Modley, Mae Bacon ||Sports/comedy||"]}, {"page": "List of British films of 1951", "response": ["|Reluctant Heroes||Jack Raymond||Ronald Shiner, Derek Farr||Comedy||", "|Take Me to Paris || Jack Raymond || Albert Modley, Bruce Seton || Comedy ||", "|Worm's Eye View || Jack Raymond || Ronald Shiner, Diana Dors || Comedy ||"]}, {"page": "List of British films of 1952", "response": ["| Little Big Shot || Jack Raymond ||  Ronald Shiner, Marie Lohr || Comedy ||"]}, {"page": "Ronald Shiner", "response": ["He became a film star almost overnight when cast as a drill sergeant in the comedy Reluctant Heroes (1951) which he had played on stage. Directed by Jack Raymond, this was one of the most popular films in British cinemas in 1952. Also popular was Worm's Eye View (1952), the film version of the stage comedy, with Diana Dors, also directed by Raymond. These two films saw Shiner voted Britain's most popular local male star in cinemas in 1952 – having never made the list before."]}, {"page": "Timeline of music in the United States (1950–1969)", "response": ["*Alexander Kuchma, Jack Raymond and Mark Selivan form the Balalaika and Domra Society of New York, which helps sustain and inspire the Russian balalaika orchestra tradition in the United States.Livingston, Tamara E. and Katherine K. Preston, \"Snapshot: Two Views of Music and Class\", pp. 55–62, in Garland Encyclopedia of World Music."]}, {"page": "List of British films of 1935", "response": ["|Come Out of the Pantry||Jack Raymond ||Jack Buchanan, Fay Wray, James Carew ||Musical||", "| Where's George? || Jack Raymond || Sydney Howard, Frank Pettingell || Comedy ||"]}, {"page": "List of British films of 1934", "response": ["|Girls, Please!||Jack Raymond ||Sydney Howard, Jane Baxter ||Comedy||", "|The King of Paris||Jack Raymond ||Cedric Hardwicke, Marie Glory ||Drama ||", "|Sorrell and Son||Jack Raymond||H. B. Warner, Margot Grahame||Drama||"]}, {"page": "List of British films of 1933", "response": ["|It's a King || Jack Raymond || Sydney Howard, Joan Maude || Comedy||", "|Just My Luck||Jack Raymond ||Ralph Lynn, Winifred Shotter||Comedy||", "|Night of the Garter || Jack Raymond || Sydney Howard, Elsie Randolph || Comedy ||", "|Up to the Neck || Jack Raymond || Ralph Lynn, Winifred Shotter || Comedy ||"]}, {"page": "List of British films of 1932", "response": ["|Life Goes On||Jack Raymond||Elsie Randolph, Betty Stockfeld||Crime||", "|Say It with Music||Jack Raymond||Jack Payne, Percy Marmont||Musical||"]}, {"page": "List of British films of 1931", "response": ["|Almost a Divorce||Jack Raymond, Arthur Varney||Marjorie Binner, Sydney Howard, Kay Hammond||Comedy||", "|The Speckled Band||Jack Raymond||Raymond Massey, Lyn Harding||Mystery drama||", "|Tilly of Bloomsbury||Jack Raymond||Sydney Howard, Phyllis Konstam||Comedy||", "|Up for the Cup||Jack Raymond||Sydney Howard, Joan Wyndham||Comedy||"]}, {"page": "List of British films of 1930", "response": ["|French Leave||Jack Raymond||Madeleine Carroll, Sydney Howard, Henry Kendall||Comedy||", "|The Great Game||Jack Raymond||John Batten, Renee Clama||Sports||", "|Splinters||Jack Raymond||Hal Jones, Reg Stone||Musical comedy||"]}, {"page": "List of British films of 1939", "response": ["|The Mind of Mr. Reeder||Jack Raymond||Will Fyffe, Kay Walsh||Mystery||  "]}, {"page": "List of British films of 1938", "response": ["|Blondes for Danger||Jack Raymond||Gordon Harker, Enid Stamp-Taylor|||Comedy thriller||", "|Luck of the Navy||Jack Raymond||Geoffrey Toone, Judy Kelly||Comedy||", "|No Parking||Jack Raymond||Gordon Harker, Leslie Perrins||Comedy||", "|A Royal Divorce||Jack Raymond||Ruth Chatterton, Pierre Blanchar||Drama||"]}, {"page": "List of British films of 1937", "response": ["|The Frog||Jack Raymond||Noah Beery, Jack Hawkins||Thriller||"]}, {"page": "List of British films of 1936", "response": ["|When Knights Were Bold||Jack Raymond||Jack Buchanan, Fay Wray||Comedy||"]}, {"page": "Union Depot (film)", "response": ["* Jack Raymond\t as Photographer (uncredited)"]}, {"page": "W. P. Lipscomb", "response": ["He also wrote some Jack Raymond films including French Leave (1930), The Great Game (1930), Tilly of Bloomsbury (1931), and The Speckled Band (1931). The latter was a Sherlock Holmes story as was The Sign of Four (1932)."]}, {"page": "Walter C. Hackett", "response": ["* Life Goes On, directed by Jack Raymond (UK, 1932, based on the play Sorry You've Been Troubled)"]}, {"page": "List of films based on military books covering peacetime", "response": ["|  2 || Reluctant Heroes || 1951 || Jack Raymond|| UK||Reluctant Heroes || Colin Morris || 195?|| Play ||-||-||-"]}, {"page": "A Royal Divorce (1938 film)", "response": ["A Royal Divorce is a 1938 British historical drama film directed by Jack Raymond and starring Ruth Chatterton, Pierre Blanchar and Frank Cellier. The film portrays the complex relationship between Napoleon I of France and his wife, Josephine Bonaparte from their first meeting until their divorce more than a decade later.", "Category:Films directed by Jack Raymond"]}, {"page": "Tilly of Bloomsbury (1931 film)", "response": ["Tilly of Bloomsbury is a 1931 British comedy film directed by Jack Raymond and starring Sydney Howard, Phyllis Konstam, Richard Bird and Edward Chapman. It is based on the play Tilly of Bloomsbury by Ian Hay. The screenplay concerns a woman who falls in love with an aristocrat.", "Category:Films directed by Jack Raymond"]}, {"page": "Up for the Cup (1931 film)", "response": ["Up for the Cup is a 1931 British comedy film directed by Jack Raymond and starring Sydney Howard, Joan Wyndham, Stanley Kirk and Moore Marriott. The screenplay concerns a man who comes to London to watch the FA Cup final.", "The film was remade in 1950, again directed by Jack Raymond.", "* Jack Raymond - Railway clerk", "Category:Films directed by Jack Raymond"]}, {"page": "Rogues' Gallery (1944 film)", "response": ["*Jack Raymond as Mike, the Night Watchman"]}, {"page": "Just My Luck (1933 film)", "response": ["Just My Luck is a 1933 British comedy film directed by Jack Raymond and starring Ralph Lynn, Winifred Shotter, Davy Burnaby and Robertson Hare. The screenplay was written by Ben Travers based on a 1932 Aldwych farce by H.F. Maltby, Fifty-Fifty, adapted from the French play Azaïs by Louis Verneuil and Georges Berr."]}, {"page": "The Speckled Band (1931 film)", "response": ["The Speckled Band is a 1931 British film directed by Jack Raymond and an adaptation of Arthur Conan Doyle's original 1892 story \"The Adventure of the Speckled Band\" and the 1910 play he adapted from it, The Speckled Band.", "Category:Films directed by Jack Raymond"]}, {"page": "The King of Paris (1934 film)", "response": ["The King of Paris is a 1934 British drama film directed by Jack Raymond and starring Cedric Hardwicke, Marie Glory and Ralph Richardson. It is based on a play La Voie Lactee by Alfred Savoir based on the life of Sacha Guitry."]}, {"page": "Up for the Cup (1950 film)", "response": ["Up for the Cup is a 1950 British comedy film directed by Jack Raymond and starring Albert Modley, Mae Bacon, Helen Christie and Harold Berens. The film is a remake of the 1931 film Up for the Cup, also directed by Jack Raymond.", "Category:Films directed by Jack Raymond"]}, {"page": "Girls, Please!", "response": ["Girls, Please! is a 1934 British comedy film directed by Jack Raymond and starring Sydney Howard, Jane Baxter, Meriel Forbes and Peter Gawthorne. It was made at Elstree Studios.Wood p.82 In the film, a physical education teacher at a girls school is left in charge when the headmistress is absent, and has to confront the elopement of one of the pupils.", "Category:Films directed by Jack Raymond"]}, {"page": "Come Out of the Pantry", "response": ["Come Out of the Pantry is a 1935 British musical film directed by Jack Raymond and starring Jack Buchanan, Fay Wray, James Carew and Fred Emney. It is based on a 1934 novel of the same name by Alice Duer Miller, and features musical numbers by Al Hoffman, Al Goodhart and Maurice Sigler.", "Category:Films directed by Jack Raymond"]}, {"page": "The Frog", "response": ["The Frog is a 1937 British crime film directed by Jack Raymond and starring Gordon Harker, Noah Beery, Jack Hawkins and Carol Goodner. The film is about the police chasing a criminal mastermind who goes by the name of The Frog, and the 1936 play version by Ian Hay. It was based on the 1925 novel The Fellowship of the Frog by Edgar Wallace. It was followed by a loose sequel The Return of the Frog, the following year.", "Category:Films directed by Jack Raymond"]}]}}