{"wiki_id": "http://www.wikidata.org/entity/Q6112882", "itemLabel": "Jack Hall", "itemDescription": "English footballer, born 1912", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Hall_(footballer,_born_1912)", "wikipedia_page": {"main": "John Hall (23 October 1912 – August 2000) was an English footballer who played as a goalkeeper. Born in Failsworth, Lancashire, he played for Failsworth Dynamoes, Manchester United, Tottenham Hotspur, Stalybridge Celtic and Runcorn, as well as guesting for several teams during the Second World War.", "link_mentions": [{"page": "Jack Hall", "response": ["Jack Hall may refer to:", "*Jack Hall (footballer, born 1883) (1883–1949), English football forward for Stoke, Brighton & Hove Albion, Middlesbrough, Leicester Fosse and Birmingham", "*Jack Hall (footballer, born 1885) (1885–?), English-born football manager active in the Netherlands", "*Jack Hall (footballer, born 1890) (1890–?), English-born football fullback for Barnsley, Manchester City and Bristol Rovers", "*Jack Hall (footballer, born 1902), played for Heywood St James, Rochdale, Great Harwood, Rossendale Utd and Bacup Borough between 1922 and 1934", "*Jack Hall (footballer, born 1905) (1905–?), English-born football forward for Lincoln City, Accrington Stanley and Manchester United", "*Jack Hall (footballer, born 1912) (1912–2000), English football goalkeeper for Manchester United and Tottenham Hotspur", "*Jack Hall (architect) (1913–2003), American architect working in the modernist style", "*Jack Hall (trade unionist) (1915-1971), American trade unionist in Hawaii", "*Jack Hall (politician) (1910–1970), Australian state politician in Western Australia", "*Mad Jack Hall (1672–1716), Jacobite-leader and property owner, tried for treason", "*Jack Hall (song), British folksong"]}, {"page": "Jack Breedon", "response": ["Breedon made his debut for Manchester United in the 1–3 defeat away at Plymouth Argyle on the opening day of the 1935–36 campaign. He was dropped for the following match in favour of Jack Hall, who went on to keep his place for most of the remaining season as the team were crowned Second Division champions. Following the departure of Hall in 1936, Breedon was unable to capitalise as new signing Tommy Breen was installed as first-choice goalkeeper. Breedon made 13 league appearances in total during his first three years at Old Trafford, but became more involved in the first team during the 1938–39 season as United achieved a 14th-place finish in the First Division. He had retained his place in the side for the beginning of the following campaign, appearing in the opening three games, but the season was abandoned following the outbreak of the Second World War and the records were expunged."]}, {"page": "Jack Hall (footballer born 1912)", "response": ["#REDIRECT Jack Hall (footballer, born 1912)"]}]}}