{"wiki_id": "http://www.wikidata.org/entity/Q6112036", "itemLabel": "Jack Davis", "itemDescription": "British miller", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Davis_(veteran)", "wikipedia_page": {"main": "John Edward 'Jack' Davis (1 March 1895 – 20 July 2003) was one of the last surviving British veterans of the First World War and the last of Kitchener's Volunteers. He died aged 108, by which point he was the oldest living British veteran of the First World War.\nHe once made a famous speech about his life:\n\n\"I would not agree to participate in any form of warfare again. Wars have proved nothing, other than that everyone emerges from them as a loser in some way or another. I joined up in 1914, aged 19, in response to Lord Kitchener's appeal for 100,000 volunteers. My friends and I thought it would offer a welcome change to our normal lives. We were excited by the prospect of going to war - but we didn't know what we were getting into.\nWhen my regiment first saw action, we found it wasn't anything like we were expecting. Where I was - the Ypres Salient in Belgium - there was no drainage at the Front. For the most part you were up to your thighs in water or mud. You can't be an effective fighting force slopping about like that. Soon we suffered the great discomfort and humiliation of becoming lice-bound and having rats running over us. We were forced to take rest wherever we could, without even taking our clothes off. Normally we slept through sheer exhaustion.\nThe Germans held all the advantages at the Salient [a bulge in the frontline]. They held the high ground around us, so we were under constant observation. Because we were inside the Salient, they could shell us not just from the front, but from both sides too. Whether we were in the frontlines, No Man's Land or collecting rations from the dump at Hellfire Corner, we came under constant bombardment. I never panicked though. I kept myself under control, even if I was detailed to occupy a dangerous position. I had a very keen sense of self-preservation and never took undue risks. Keeping a clear head wasn't easy and many men cracked.\nI was once sent out into No Man's Land with another man to a shell crater by the German trench. They were just yards away - you could hear them talking and stamping their feet to keep warm. Armed only with a Mills bomb, we were there to decide whether the Germans were preparing to attack. Unfortunately, my comrade was shell-shocked. He was whimpering like a child. We couldn't stay there with him like that - I saw three Germans who might have surrounded us. That would have meant surrender, or worse, the finish. I threw my hand grenade and we went back to our trench. When I explained what had happened my partner was sent back for medical treatment.\nIn most cases, shell-shocked men weren't regarded as being ill and not responsible for their actions. I have thought a lot about the 306 men who were executed for cowardice or desertion. I think most were either shell-shocked or not calm in the mind. They almost selected me for an execution firing squad, and I'm glad another man was found to carry out the sentence. If I was detailed by those in authority, I would have had to obey.\nI could have been shot at dawn myself. My brothers had been rejected by the Army, but they worked at a military club in London where everyone knew they wanted to join their brother at Ypres. I was sent to occupy a trench ahead of my comrades. I approached it and got the usual challenge: 'Halt, who goes there?' I recognised my brother's voice. There they both were in a trench, up to their thighs in water. It was indescribable, the emotions. But I had a job to do, so it was just a few words, then 'see you'. When they were at the Front, my brigade was in support, and vice versa. After one battle, I heard many men in their brigade had been killed - so I went off to try to find my brothers. Staying off the roads so I wouldn't get caught , I eventually found my older brother Percy - the younger one, William, was being treated for his wounds. When I returned to my brigade I was immediately arrested. I was given the choice between a court martial or my commanding officer's punishment. I took his punishment and lost three days' pay. Had I got lost on my way back to my unit and been caught by soldiers who didn't know me, who would have believed my story? I'd have been shot.\nThere were times when I had occasion to respect the Germans - they were doing a job the same as we were. But we were over there to fight and we treated them as the enemy. It is only since the war that I have had time - a lot of time - to think whether it was justified to send all those men out to make the supreme sacrifice. I think that is still unanswered. It was not the war to end all wars. We've had Korea, Vietnam, Israel, Northern Ireland, Bosnia - and what have they successfully achieved?\"", "link_mentions": [{"page": "Jack Davis", "response": ["Jack Davis may refer to:", "*Jack Davis (actor) (1914–1992), American child actor", "*Jack Davis (playwright) (1917–2000), Australian playwright and poet", "*Jack Davis (cartoonist) (1924–2016), American cartoonist and illustrator", "*Jack Davis (ENIAC), American engineer who worked on the ENIAC computer in the 1940s", "*Jack Davis (industrialist) (born 1933), American industrialist", "*Jack Davis (Novell), American businessman, co-founder of Novell", "*Jack Davis (English footballer) (1882–1963), English footballer", "*Jack Davis (Australian footballer) (1908–1991), Australian rules footballer", "*Jack Davis (hurdler) (1930–2012), American Olympic hurdler", "*Jack Davis (guard, born 1932) (1932–2013), American football player for the Boston Patriots", "*Jack Davis (guard, born 1933) (1933–2015), American football player for the Denver Broncos", "*Mildirn, (a.k.a. Jack Davis, 1835–1914), Australian Aboriginal leader, translator and merchant", "*Jack Davis (prospector) (1879–1949), American prospector", "*Jack Davis (veteran) (1895–2003), British military veteran", "*Jack Davis (Canadian politician) (1916–1991), Canadian politician in British Columbia", "*Jack Davis (Illinois politician) (1935-2018), American politician in Illinois House of Representatives"]}, {"page": "World War 1 in Colour", "response": ["*Jack Davis (1895–2003), the last of Kitchener's Volunteers"]}, {"page": "John E. Davis", "response": ["* Jack Davis (veteran) (John Edward Davis, 1895–2003), British World War I veteran"]}, {"page": "Davis, John Edward (Jack)", "response": ["#REDIRECT Jack Davis (veteran)"]}]}}