{"wiki_id": "http://www.wikidata.org/entity/Q6116285", "itemLabel": "Jackie Chew", "itemDescription": "English footballer (1920-2002)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jackie_Chew", "wikipedia_page": {"main": "John Chew (13 May 1920 – 21 October 2002) was a footballer who played for Burnley, Bradford City and Darwen. He made more than 200 league appearances for Burnley side, scoring more than 40 goals. He played just one season with Bradford City, scoring four goals from 36 games. Chew was dubbed to have the hardest shot in league football and had one of the most feared left foots ever. He was born in Blackburn.", "link_mentions": [{"page": "1947 FA Cup Final", "response": ["|OR ||7 || Jackie Chew"]}, {"page": "List of Bradford City A.F.C. players (1–49 league appearances)", "response": ["|Jackie Chew||||1954–1955||36||4||"]}, {"page": "Chew (surname)", "response": ["* Jackie Chew (1920–2002), English football winger"]}, {"page": "Tommy Henderson (footballer, born 1927)", "response": ["Henderson, an outside right, joined Burnley as an amateur during the 1944–45 season and played three matches in the Wartime Football League. He established himself as a regular in the reserve team at Burnley over the following seasons and in 1948–49 was a part of the side that won the Central League title. He made his senior debut for the club on 12 September 1949 for the visit to Stoke City, taking the place of Scottish winger Ian Wilson, who had worn the number 7 shirt two days earlier in the defeat to Derby County. Burnley drew 1–1 at Stoke, Reg Attwell equalising with a penalty kick after the home side had taken the lead in the first minute of the game.Simpson (2007), pp. 254–255 Henderson was dropped in favour of Jack Spencer for the next match against West Bromwich Albion and was subsequently forced to wait another month for his second first-team appearance. His second and ultimately final league outing for Burnley came in the 0–1 defeat away at Fulham on 15 October 1949, after which regular outside right Jackie Chew returned to the team and kept his place for much of the remainder of the season. Henderson remained at Turf Moor for another season, but played solely for the reserve team and was released in May 1951.Simpson (2007), p. 497"]}]}}