{"wiki_id": "http://www.wikidata.org/entity/Q6111322", "itemLabel": "Jack Board", "itemDescription": "Cricket player of England. (1867-1924)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Board", "wikipedia_page": {"main": "John Henry Board (23 February 1867 – 15 April 1924) was an English cricketer who played in six Tests from 1899 to 1906.\nJack Board was a wicketkeeper and a right-handed batsman who started out as a tail-ender but developed into a useful player who often opened the innings for his county, Gloucestershire. Picked by W. G. Grace out of Bristol club cricket for the South v North match at Lord's in 1891, Board went straight into the Gloucestershire side afterwards and stayed there for 20 years. In 1895, he set the county record for dismissals in a season, with 75. As a batsman, he scored 214 in 210 minutes against Somerset in 1900, the highest by a Gloucestershire wicketkeeper, and in 1903 he shared in a sixth wicket partnership of 320 with Gilbert Jessop against Sussex at Hove, though his share was just 71, while Jessop scored 286. The stand remains the county record for the sixth wicket.\nBoard toured Australia in 1897-98 under A.E. Stoddart without playing in the Tests, and twice toured South Africa, where he played his only Tests. He went with Lord Hawke in 1898–99, and won his first two Test caps; he top-scored in his first Test innings, but then never exceeded the 29 he scored in that match. In 1905–06, he played in four Test matches in the tour led by Plum Warner.\nBoard was born in Clifton, Bristol. A gardener by trade before he took to professional cricket, he  became a well-known cricket coach at the end of his career. From 1910, he went each winter to New Zealand, where he coached and played for Hawke's Bay, returning each English summer for a few games for Gloucestershire. After the First World War, he became an umpire in English cricket and combined that with winters in South Africa coaching. It was on the return trip from South Africa to England in 1924 aboard the Kenilworth Castle that he had a heart attack and died. He was buried at sea.\n\n", "link_mentions": {}}}