{"wiki_id": "http://www.wikidata.org/entity/Q6123556", "itemLabel": "Jaik Mickleburgh", "itemDescription": "English cricketer (born 1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jaik_Mickleburgh", "wikipedia_page": {"main": "Jaik Charles Mickleburgh (born 30 March 1990) is an English cricketer. He is a right-handed batsman, who used to play for Essex. Mickleburgh is in the Essex 1st team squad for the first time during the 2008 season. He has also played Minor Counties cricket for Norfolk & Suffolk. Mickleburgh also spent the 2007/2008 Australian season with the Newtown and Chilwell Cricket Club playing in the Geelong Cricket Association, where he was warmly welcomed.Mickleburgh learnt much of his cricket playing for Horsford CC where the senior pros, Paul Newman, the ex-Derbyshire player, and Chris Brown from Lancashire, helped nurture him. He came through the Essex academy, playing Minor Counties cricket with Norfolk, and made his first-team debut in September 2007 in the Twenty20 Floodlit Cup.\nMickleburgh made his first appearance for Essex in the non-first-class Pro ARCH Trophy in September 2007 against the PCA Masters XI. He made his first-class debut in August 2008 against Leicestershire, he scored 60 as Essex won by an innings. After his debut Mickleburgh's efforts resulted in the youngster getting a call-up to the England Under-19 squad over the winter, for whom he toured South Africa in the New Year.\nOn 15 and 16 April 2010 Mickleburgh scored his debut first-class century of 174 off 388 balls including 13 fours and a six against Durham. With James Foster this helped to set a record 5th wicket partnership for Essex of 339.\nMickleburgh has spent two summers in Australia, the first as a 17-year-old with the Newtown and Chilwell Cricket Club, the second attending the Darren Lehmann academy in Adelaide.\nHe spent the 2012-13 winter playing for Mid West Rhinos in Zimbabwe, with limited success, looking to reinvigorate his game after three years as a first-team regular while averaging in the twenties. Another overseas spell followed with North Sydney where his captaincy potential was held in high regard. There was talk from some he was Essex captaincy material, but he failed to provide the runs needed to become a serious contender.\nOne of his brightest seasons at Essex came in 2013. Despite having started the season out of the side, due to the signing of Rob Quiney as overseas player, he finished that summer as Essex's leading Championship run-scorer with 829 at an average of 41.45. When he played against an England XI ahead of the 2013 Ashes, he also made 90 and 58 (the match had its first-class status removed), and went on to have his most productive spell in county cricket, including a career-best 243 against Leicestershire. He failed to press on the following season, however, managing just one half-century as the emergence of another young opener in Nick Browne cost him his place in the Championship XI and his star never really rose again.\nMickleburgh helped Essex win the County Championship Division Two title in 2016 with Essex to play in Division One in the 2017 season.\nAt the end of the domestic 2016 season it was announced Mickleburgh was not being offered a new contract which ends his 9 year affiliation with Essex leaving him as a free agent. For the 2017 season, Mickleburgh played for Copdock & Old Ipswichian Cricket Club and Suffolk.", "link_mentions": [{"page": "List of Essex first-class cricket records", "response": ["| 5th || 339 ||  James Foster Jaik Mickleburgh || v Durham || Chester-le-Street || 2010"]}, {"page": "David Payne (cricketer)", "response": ["Payne took a career best of 7–29 in the 2010 Clydesdale Bank 40 group match against Essex at Chelmsford in 2010. He dismissed James Foster, Grant Flower, Tim Phillips and Jaik Mickleburgh in just 4 balls, having previously dismissed Graham Napier just 2 balls before. Coincidentally he also recorded his best batting score in List A cricket in the same game. Essex won the game by 42 runs."]}, {"page": "Mid West Rhinos", "response": ["| Jaik Mickleburgh || Essex"]}, {"page": "Jaik", "response": ["* Jaik Mickleburgh (born 1990), English cricketer"]}, {"page": "Mickleburgh", "response": ["*Jaik Mickleburgh (born 1990), English cricketer"]}]}}