{"wiki_id": "http://www.wikidata.org/entity/Q6128407", "itemLabel": "James Agg-Gardner", "itemDescription": "English brewery-owner and politician (1846-1928)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Agg-Gardner", "wikipedia_page": {"main": "Sir James Tynte Agg-Gardner  (25 November 1846 in Cheltenham – 9 August 1928 in Carlton Club) was an English brewery-owner and Conservative Party politician from Cheltenham in Gloucestershire.  An early supporter of women's suffrage, he was Member of Parliament (MP) for the Cheltenham constituency for four separate periods between 1874 and 1928, serving a total of 39 years in Parliament in which he made only two speeches in the House of Commons.", "link_mentions": [{"page": "List of United Kingdom MPs: A", "response": ["|Sir James Agg-Gardner"]}, {"page": "List of Privy Counsellors (1910–1936)", "response": ["*Sir James Agg-Gardner (1846–1928)"]}, {"page": "List of MPs elected in the 1924 United Kingdom general election", "response": ["|Rt Hon. Sir James Agg-Gardner"]}, {"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| James Agg-Gardner"]}, {"page": "Cheltenham (UK Parliament constituency)", "response": ["| James Agg-Gardner", "| James Agg-Gardner", "| James Agg-Gardner", "| Sir James Agg-Gardner ", "*Unionist Party: James Agg-Gardner"]}, {"page": "List of Old Harrovians", "response": ["*Sir James Agg-Gardner (1846–1928), Conservative MP for Cheltenham (1874–1880; 1885–1895; 1900–1906; 1911–1928)"]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| James Agg-Gardner"]}, {"page": "List of United Kingdom by-elections (1918–1931)", "response": ["|James Agg-Gardner"]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["| Sir James Agg-Gardner"]}, {"page": "List of MPs elected in the 1923 United Kingdom general election", "response": ["|Sir James Agg-Gardner"]}, {"page": "List of MPs elected in the 1922 United Kingdom general election", "response": ["|Sir James Agg-Gardner"]}, {"page": "List of MPs elected in the 1886 United Kingdom general election", "response": ["| James Agg-Gardner"]}, {"page": "List of MPs elected in the 1900 United Kingdom general election", "response": ["| James Agg-Gardner"]}, {"page": "List of United Kingdom by-elections (1900–1918)", "response": ["|James Agg-Gardner"]}, {"page": "1928 Cheltenham by-election", "response": ["The seat had become vacant when the constituency's Conservative Member of Parliament (MP), Sir James Agg-Gardner, had died on 9 August 1928, aged 81. He had held the seat since a by-election in 1911, having previously been Cheltenham's MP from 1874 to 1880, 1885 to 1895, and 1900 to 1906."]}, {"page": "James Tynte Agg-Gardner", "response": ["#REDIRECT James Agg-Gardner"]}, {"page": "Sir James Tynte Agg-Gardner", "response": ["#REDIRECT James Agg-Gardner"]}, {"page": "Sir James Agg-Gardner", "response": ["#REDIRECT James Agg-Gardner"]}, {"page": "Richard Mathias", "response": ["Sir Richard Mathias, 1st Baronet (1 June 1863 – 26 October 1942) was a Liberal Party politician in the United Kingdom.  He was elected at the December 1910 general election as Member of Parliament (MP) for Cheltenham, but was subsequently unseated on petition.Dictionary of National Biography: Gardner, Sir James Tynte Agg His brother was the Liberal candidate at the resulting by-election in April 1911, but lost by four votes to the Conservative Party candidate, former MP Sir James Agg-Gardner."]}, {"page": "Agg-Gardner", "response": ["#REDIRECT James Agg-Gardner"]}, {"page": "Records of members of parliament of the United Kingdom", "response": [":James Agg-Gardner: 1885, 1900, 1911 b"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Sir James Agg-Gardner; MP for Cheltenham (1874–1880; 1885–1895; 1900–1906; 1911–1928)"]}, {"page": "Henry Davies (journalist)", "response": ["He provided effective support to the Conservative Party in the town and county both directly and through the organ of his periodical.  In the 1847 election, Sir Willoughby Jones was returned as Conservative MP for Cheltenham, after several years of Liberal dominance. The Cheltenham Examiner, which represented the Liberal Party wrote that Davies \"was aided towards the prominent part he took in discussions by oratorical powers of no mean order, and by a courage in the expression of his views which enabled him to face the tumultuous and hostile demonstrations inseparable from political contest.\"Cheltenham Examiner 12 March 1890 In 1865 Davies' political efforts helped secure the election of Charles Schreiber as Conservative MP. His political services to the Conservative party were recognised when he was presented with a Testimonial in 1877 by James Agg-Gardner, M.P who was returned as a Conservative three timesCheltenham Looker-On 23 June 1877"]}, {"page": "Herbert Armitage James", "response": ["He was made a Companion of Honour by King George V in the Birthday Honours List of 1926. On 15 October 1926, over two hundred friends and former students attended a dinner held in his honour at the Hotel Victoria to celebrate the award, with Viscount Cave (who was Lord Chancellor and also Chancellor of Oxford University) presiding. Other guests included Viscount Lee, Sir Maurice Hankey (the Cabinet Secretary), the sculptor Sir George Frampton, the civil servant Ernest Gowers (who had been educated at Rugby when James was headmaster) and the MP Sir James Agg-Gardner. Austen Chamberlain (the Secretary of State for Foreign Affairs and a governor of Rugby School) spoke, along with representatives of the other schools with which he had been associated. Lord Cave praised James's directness in his opinions and decisions, his weighty judgment, his high character and his kindly nature. He said that membership of the Companionship of Honour had been given only to a few who had rendered \"special social service\" to the country, and he rejoiced that James had been \"enrolled\" in this \"select band\". He added that St John's College and Oxford University owed James a \"debt of gratitude\" for his \"wise advice and guidance\". James, he said, \"had never dealth in the fine shades, or in the analysis of tendencies, or the exploration of avenues. Whatever was right had to be done. Whatever was wrong he fought with all his might.\""]}, {"page": "List of MPs elected in the 1874 United Kingdom general election", "response": ["| Sir James Agg-Gardner"]}, {"page": "James Templer (balloon aviator)", "response": ["On 10 December 1881 Captain Templer was accompanied by Walter Powell the MP for Malmesbury and Mr. A. Agg-Gardner, brother of James Agg-Gardner – then between terms as MP for Cheltenham – in the balloon Saladin.  The group departed Bath and headed towards Dorset.  In time they found themselves within half a mile of the sea near Eypesmouth which is to the west of Bridport.  As the balloon was rapidly drifting seaward, they attempted to descend.  The balloon touched the ground a mere 150 yards from the cliff edge.  The balloon dragged along and ground and Templer exited the basket holding the valve line in his hand.  As the balloon had just been lightened, it rose about eight feet and Agg-Gardner jumped out breaking his leg.  Powell was now the only occupant of the balloon.  Templer, who had still hold of the line, shouted to Powell to climb down the line.  Powell made a move for the rope but the balloon rose, tearing the line out of Templer's hands.  The balloon climbed rapidly and Powell was taken out to sea. He was never seen again."]}, {"page": "Walter Powell (politician)", "response": ["The Meteorological Society had borrowed a balloon called Saladin from the War Office. On 10 December 1881, Powell accompanied Captain Templer and Mr A. Agg-Gardner, brother of  James Agg-Gardner MP, in an ascent at Bath, Somerset. The balloon was carried over Somerset to Exeter and then into Dorset. The crew tried to descend near Bridport but the balloon hit the ground so hard that Templer was thrown out. As a result, the balloon rose again; Agg-Gardner fell out from a height of about eight feet and broke his leg, and Powell, remaining in the car, was swept out to sea to the southeast. He was last seen waving his hand to Captain Templer.  It seemed likely that he might have crashed into the English Channel, and a search was made for three days.World Famous Strange But True (1994) Colin Wilson, Damon Wilson and Rowan Wilson; Magpie Books Ltd; p.19;   The beaches on England's southern coast were combed for washed-up wreckage or clues but neither Powell nor the balloon were recovered.The Times 13 December 1881 The by-election to replace him as MP for Malmesbury was held on 7 March 1882."]}, {"page": "John Sears (British politician)", "response": ["At the 1906 general election Sears was chosen by the Liberals to contest the constituency of Cheltenham. The seat had been held by the Conservative Party since the 1880s, but Sears unexpectedly unseated James Agg-Gardner, the sitting Member of Parliament. He served a single term in the Commons, and the Conservatives regained the Cheltenham seat at the next election in January 1910."]}, {"page": "List of LGBT politicians in the United Kingdom", "response": ["|rowspan=4|  James Agg-Gardner"]}, {"page": "Agg-Gardner, James", "response": ["#redirectJames Agg-Gardner"]}]}}