{"wiki_id": "http://www.wikidata.org/entity/Q6129486", "itemLabel": "James Baxendale", "itemDescription": "English footballer (born 1992)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Baxendale_(footballer,_born_1992)", "wikipedia_page": {"main": "James Robert Baxendale (born 16 September 1992) is an English footballer who plays as a midfielder for Sheffield.", "link_mentions": [{"page": "Julian Gray", "response": ["After leaving Walsall when his contract expired, Gray spent two seasons in Cyprus with Nea Salamis Famagusta. He returned to England in 2013, and trained with Walsall before signing a contract with them on 27 September, to run until January of the following year. Gray made his second debut for the club on 12 October, as a 71st-minute substitute for James Baxendale in a 1–1 draw away at Colchester United. He was released when his contract expired."]}, {"page": "Dean Smith (footballer, born 1971)", "response": ["In summer 2012, he offered professional contracts to youth team players Mal Benning, Ben George, Aaron Williams and Kieron Morris. He continued to add promising young players by bringing in 21-year-old winger Ashley Hemmings, 19-year-old former loanee Florent Cuvelier, 19-year-old winger James Baxendale, 20-year-old defender Paul Downing, 19-year-old striker Connor Taylor, 23-year-old striker Febian Brandy, in addition to 32-year-old right-back Dean Holden. He also brought in full-back James Chambers, twin brother of Adam Chambers. He also brought in a number of players on loan, including: Karl Darlow (21), Sam Mantom (20), Aaron McCarey (20), and Craig Westcarr (27). Mantom was made into a permanent signing in January. Smith signed a new two-and-a-half-year contract in October, keeping him at the club until summer 2015. This came after the club announced a £10,000 profit on the previous campaign as Smith's 'Total Football' approach yielded a mid-table position for the young Walsall team, in addition to praise from pundits and fans. A poor run of results saw the team slip to just above the relegation zone in mid-December. Walsall recovered to win four of their five games in January, as Smith was named as Manager of the Month. They ended the season in ninth place, six points outside the play-offs."]}, {"page": "Richard O'Kelly", "response": ["On 5 March 2012, O'Kelly was appointed manager of Hereford United, replacing Jamie Pitman, who stayed on at Edgar Street as a coach. He took charge with the club two places and two points above the League Two relegation zone, and signed a contract until the end of the 2011–12 season. On taking charge he said \"It's my first job as manager but what better team to start with. We've got 12 games to show and prove to people just what we can do.\" He got his first point in charge at the club the following day, when his side squandered a two-goal lead to draw 2–2 with Macclesfield Town at Moss Rose. Four days later they beat Morecambe 1–0 at the Globe Arena, further boosting their chances of survival. He later signed full-back James Chambers and winger James Baxendale on loan from Doncaster Rovers. To avoid relegation on the last day of the campaign, the \"Bulls\" needed to beat Torquay United and hope Burton Albion could avoid defeat at home to Barnet. Chairman David Keyte said that he should have appointed O'Kelly earlier in the season. His team won a futile 3–2 victory, as a win for Barnet sent Hereford back down to the Conference. He was asked to remain in charge for the subsequent Conference campaign, but declined the offer."]}, {"page": "Leeds United F.C. Reserves and Youth Team", "response": ["* James Baxendale"]}, {"page": "2011–12 Doncaster Rovers F.C. season", "response": ["|James Baxendale"]}, {"page": "2011–12 Hereford United F.C. season", "response": ["| James Baxendale"]}, {"page": "Baxendale", "response": ["* James Baxendale (footballer, born 1992), English footballer", "* James Baxendale (footballer, born pre-1900), English footballer"]}, {"page": "Billy Clifford (footballer)", "response": ["On 7 August 2014, Clifford agreed to cancel his contract with Chelsea by mutual consent to seek regular football. On 8 August 2014, Walsall signed the midfielder on a six-month contract. The next day, Clifford made his debut for the club, where he came on as substitute for James Baxendale in the 70th minute, in a 1–1 draw against Port Vale. Clifford made thirteen league appearances for Walsall before leaving the club on 9 January 2015 at the end of his contract."]}, {"page": "2013–14 Port Vale F.C. season", "response": ["Vale faced League One rivals Walsall at home in the First Round of the League Cup. The club's abysmal record in the competition continued with a bitter 2–1 defeat – James Baxendale's winning goal coming seconds after Vale had a strong penalty appeal waved away."]}, {"page": "James Baxendale", "response": ["James Baxendale may refer to:", "* James Baxendale (footballer, born 1992), English footballer", "* James Baxendale (footballer, born pre-1900), English footballer"]}, {"page": "James Baxendale (footballer born 1992)", "response": ["#REDIRECT James Baxendale (footballer, born 1992)"]}, {"page": "2015 Football League Trophy Final", "response": ["|MF ||11 || James Baxendale || || "]}, {"page": "2015–16 Mansfield Town F.C. season", "response": ["|MF||31||||data-sort-value=\"Baxendale, James\"|James Baxendale||1||–||–||–||1", "| 9 January 2016 || MF ||  || James Baxendale || Walsall || 9 February 2016 || "]}, {"page": "List of foreign USL Championship players", "response": ["*James Baxendale – Orange County SC – 2017"]}, {"page": "2016–17 Mansfield Town F.C. season", "response": ["|align=\"left\"|11||align=\"left\"|MF||align=\"left\"| James Baxendale"]}, {"page": "2017–18 Mansfield Town F.C. season", "response": ["| 1 July 2017 || RM ||  || James Baxendale || Free agent || Released || "]}, {"page": "2018 Orange County SC season", "response": ["|  James Baxendale"]}]}}