{"wiki_id": "http://www.wikidata.org/entity/Q6121000", "itemLabel": "Jacquetta May", "itemDescription": "British actor, writer and director", "wikipedia_url": "https://en.wikipedia.org/wiki/Jacquetta_May", "wikipedia_page": {"main": "Jacquetta May is a British writer, actress and theatre director. She co-founded the award-winning new-writing theatre company Plain Clothes Productions, commissioning, producing and directing for the company. She directed Her Sister Tongue at Lyric Theatre in Hammersmith, London, in 1997.", "link_mentions": [{"page": "EastEnders", "response": ["EastEnders has been known to feature a 'comedy double-act', originally demonstrated with the characters of Dot and Ethel, whose friendship was one of the serial's most enduring. Other examples include Paul Priestly (Mark Thrippleton) and Trevor Short (Phil McDermott), In 1989 especially, characters were brought in who were deliberately conceived as comic or light-hearted. Such characters included Julie Cooper (Louise Plowright)—a brassy maneater; Marge Green—a batty older lady played by veteran comedy actress Pat Coombs; Trevor Short (Phil McDermott)—the \"village idiot\"; his friend, northern heartbreaker Paul Priestly (Mark Thrippleton); wheeler-dealer Vince Johnson (Hepburn Graham) and Laurie Bates (Gary Powell), who became Pete Beale's (Peter Dean) sparring partner. The majority of EastEnders characters are working-class. Middle-class characters do occasionally become regulars, but have been less successful and rarely become long-term characters. In the main, middle-class characters exist as villains, such as James Wilmott-Brown (William Boyde), May Wright (Amanda Drew), Stella Crawford (Sophie Thompson), Yusef Khan (Ace Bhatti) and Gray Atkins (Toby-Alexander Smith) or are used to promote positive liberal influences, such as Colin Russell (Michael Cashman) or Rachel Kominski (Jacquetta May)."]}, {"page": "Barbara Cartland", "response": ["BBC Four aired a biopic drama film, titled In Love with Barbara (26 October 2008), starring Anne Reid as Cartland and David Warner as Lord Mountbatten. The film was written by Jacquetta May."]}, {"page": "Peggy Mitchell", "response": ["Actress and writer Jacquetta May, who played the character Rachel Kominski between 1991 and 1993, has discussed the storyline and the role of women in an article about EastEnders. According to May, the scriptwriters were faced with a problem once Peggy, \"a key figure of the community\", was shown to exhibit such \"pig-headed ignorance and appalling prejudice\". In order for Peggy to be redeemed, she had to be seen to be punished, and so the character was given breast-cancer later that year. May comments, \"Peggy, malicious gossip and bigot, herself becomes the victim of a life-threatening illness. At Christmas they run a Christian forgiveness story. Peggy calls on Mark and tells him she now knows what it is like to suffer as he has. She apologises, thus underlining one of the basic tenets of the programme: underneath the skin we are all the same, human and vulnerable, and recognition of this should unite us not divide us. Along the way, a great deal of useful information about these illnesses was broadcast. So, although EastEnders endlessly repeats its conservative format, and although all issues are there primarily to feed the great hungry story-beast, its positive by-products cannot be denied.\""]}, {"page": "Mark Fowler", "response": ["Later that year, following the example of a friend Joe Wallace (Jason Rush) who had told his parents about being gay and HIV-positive, Mark decides to tell his parents. By now, he is dating Rachel Kominski (Jacquetta May), who advises him not to but Mark is tired of the pretence. On Boxing Day Mark tells Pauline and Arthur that he is HIV-positive. They sit in stunned silence while he scatters helpful leaflets around the house and then goes away for a while. On his return, he faces Pauline's irrational terror and Arthur's hostility. Arthur's ignorance is apparent initially as he fears that Mark will pass HIV on to him; he even bleaches everything Mark touches to avoid infection. Pauline and Michelle Fowler (Susan Tully) are understandably distraught but help Arthur to understand the illness, and are a huge support to Mark. Mark's relationship with Rachel ends, and the animosity at home sends Mark back to his girlfriend Gill, who moves to London and becomes seriously ill. Gill's HIV has already progressed into AIDS and her deterioration is rapid. She is diagnosed with non-Hodgkin's lymphoma and goes into a hospice. Mark realises that he is in love with her and asks her to marry him. Mark and Gill marry, and their honeymoon consists of one night in a hotel, before Gill returns to the hospice and dies."]}, {"page": "Pauline Fowler", "response": ["Pauline's marriage to the luckless Arthur is central to her character, remaining one of her defining traits even after his death in 1996. The dynamics of the relationship were clear from the beginning of the programme, with Pauline depicted as the matriarchal force that holds the Fowler family together, while Arthur is depicted as weak, emotionally unstable and easily dominated by the stronger females of his family. Writer Jacquetta May, who once played Rachel Kominski in the programme, has commented that \"[Pauline and Arthur] represented the matriarchal relationship of strong woman/weak man ... Arthur, only sporadically employed and disabled by a breakdown, often behaved like a little boy, while Pauline had to make the decisions and keep the family functioning in the face of poverty and unemployment, teenage pregnancy and depression.\""]}, {"page": "Phil Mitchell", "response": ["Among the many issues Phil has been used to cover is alcoholism and the consequences the condition has upon the sufferer's life. The relationship between alcohol abuse and domestic violence was explored between Phil and his wife Kathy (played by Gillian Taylforth) culminating in the slow deterioration of their marriage, which gripped viewers throughout 1997. Of particular note is an episode where Phil attends Alcoholics Anonymous (February 1997), an \"alien and uncomfortable arena\" where he was forced to talk about his condition, expose his vulnerability and reveal the basis of his problem – the physical abuse he'd received from his father and his fear that he will do the same. Writer Jacquetta May, who once played Rachel Kominski in the show, evaluated the episode in an article about social realism, education and the moral messages within EastEnders storylines, commenting: \"The episode blames his destructiveness on the 'male' response to self-hate: violence. It says that unless problems are worked through (the female method), they will be repeated generation after generation\".\"Square Deal \", redpepper.org. Retrieved 24 February 2007. This particular episode has also been used in a study by the Stirling Media Research Institute, where men were asked questions about the violence contained within a spectrum of broadcast television material. The study reported that much group discussion centred on the Alcoholics Anonymous group scene, which was, for the most part, seen as an accurate depiction of an AA group therapy session. In addition, Phil's portrayal of a suffering alcoholic was also seen as realistic and a \"typical portrayal of bottled-up masculinity\".\"Men Viewing Violence \", Stirling Media Research Institute. Retrieved 24 February 2007."]}, {"page": "Get Real (film)", "response": ["* Jacquetta May as Steven's Mother"]}, {"page": "List of former EastEnders characters", "response": ["|Rachel Kominski || Jacquetta May || 1991–1993"]}, {"page": "Kathy Beale", "response": ["Writer and actress Jacquetta May, who played Rachel Kominski in EastEnders in the early 1990s, has commented on Kathy and questioned whether the events that happened in her fictional life reflected \"any sort of true experience\". In an article she comments, \"Surely no woman's life could contain such a catalogue of disasters: slum childhood, two rapes, a drug-taking daughter, product of the first rape who tops herself, a broken marriage, disastrous affairs and now an alcoholic husband who endangered their son's life.\" She states that Kathy's biography is a \"contrast between a realistic portrayal\" of a woman and familiar stereotypes —  Kathy \"the good, long-suffering woman and victim\"."]}, {"page": "Dangerfield (TV series)", "response": ["* Jacquetta May as Liz Moss (Series 3)"]}, {"page": "Michelle Fowler", "response": ["As time goes on, Michelle finds herself involved in another marriage—this time with a computer salesman named Danny Whiting (Saul Jephcott). This first emerged when Whiting told Michelle that his previous marriage was over after being unable to make amends with his ex-wife. Michelle soon plans to move to Newcastle with Whiting, but she ends up changing her mind; Whiting, though, appears unwilling to accept her decision. Michelle moves in with Rachel Kominski (Jacquetta May), a lecturer who persuades Michelle to resume her studies and enroll at university. Michelle and Rachel become inseparable, and rumours about their sexuality prompt Michelle to start dating Clyde Tavernier (Steven Woodcock), a fellow single parent. Some of the Albert Square residents, including Arthur, view their interracial relationship with concern. Later that year, Clyde is falsely accused of murdering local publican Eddie Royle (Michael Melia). With the police closing in, Clyde resolves to leave the square with his son Kofi (Marcel Smith) and tells Michelle about this; she later decides to go with him and take Vicki along in the process. Their getaway fails and Clyde is imprisoned for three months. He is eventually exonerated, but by then Michelle has already moved on to his companion Jack Woodman (James Gilbey) during the events of Clyde's prison stint; Clyde ends his relationship with Michelle after catching her in bed with Woodman."]}, {"page": "Cardiac Arrest (TV series)", "response": ["* Jacquetta May as Sister Julie Novac (series 2–3)", "There are continuing public scandals about patient care at the hospital. The hospital has written letters to all patients cared for by James warning them of their possible HIV exposure. The outrage of the patients places further pressure on James to resign. Sister Jackie Landers (Ellen Thomas) speaks on television about bad patient care and is severely reprimanded by Tennant. However, soon Casualty Sister Julie Novac (Jacquetta May) makes similar comments to reporters, and Tennant ends up suspended over her remarks: it is revealed that she is Tennant's estranged wife and that he has protected her to his own cost. After being reinstated following Phil's exoneration, Tennant attempts to have Julie's new partner, Scissors Smedley, fired over procedural errors he committed asking a student nurse to administer intravenous medication to a critically ill child when casualty was understaffed, and fails to protect James from false accusations of child abuse. When Julie finds out both that Scissors had not told her about Tennant's manipulations, and that he had failed to confide in her that his neglect of the drink driver was due to his own wife's death in a similar accident, she breaks up with him."]}, {"page": "Richard Cole (EastEnders)", "response": ["Richard Cole arrives in Walford in 1992 as the new market inspector. He is known as a corrupt man who will pull every trick in the book to make money and he is not well liked by the community. He is also a notorious womaniser who has various brief flings. He briefly dates market trader Rachel Kominski (Jacquetta May) in 1992, but antagonises her later when he decides to give her permanent market pitch to his newly arrived friend, Sanjay Kapoor (Deepak Verma). In 1993, he has a romance with Kathy Beale (Gillian Taylforth), which sours when she discovers that he is taking a cash bribe and allowing a mobile hot dog van to trade in direct competition to her café. Later, he has sex with 17-year-old Bianca Jackson (Patsy Palmer), and when he dumps her shortly after, she and her friend Natalie (Lucy Speed) vandalise his flat."]}, {"page": "Steve Elliot", "response": ["Steve Elliot was the second of only two regular characters to be introduced into EastEnders in 1991, the other was Rachel Kominski (Jacquetta May). Described by writer Colin Brake as a \"young black cook with ambitions to see the world\", Steve was originally paired storyline-wise with Ian Beale (Adam Woodyatt)  when he became involved in his catering service \"The Meal Machine\", as well as the character Hattie Tavernier (Michelle Gayle) with whom he had a relationship."]}, {"page": "Sanjay Kapoor (EastEnders)", "response": ["Sanjay is first seen in Albert Square in February 1993 as a friend of market inspector Richard Cole (Ian Reddington), who comes to persuade him to bend the rules and give him a pitch in the market for his clothing stall. Richard gives him Rachel Kominski (Jacquetta May)'s permanent pitch, much to her dismay. Sanjay, a Hindu, is married to Gita Kapoor (Shobu Kapoor) and at the time of his arrival she is heavily pregnant with their first child, which is due in March 1993. They had been living separately since the failure of their previous business, and Sanjay needs to find them a home. However, he gambles away their flat-deposit money, so they have to lodge with Richard until Sanjay (via more gambling) manages to get some money together and put down a deposit on flat number 43B Albert Square, the very day Gita gives birth to their daughter Sharmilla (Priya Bilkhu). Soon after, Sanjay gets into trouble with trading standards for selling fake designer labels on his clothing stall. Gita despairs over Sanjay's moneymaking schemes as they all end disastrously."]}, {"page": "List of EastEnders characters (1991)", "response": ["Rachel Kominski, played by Jacquetta May, owns number 55 Victoria Road. She befriends Michelle Fowler (Susan Tully) and is initially keen for her to become her lodger, but when she learns Michelle has a young daughter, she rents the bedroom to singer Karen (Adjoa Andoh). Rachel later befriends Michelle's uncle Pete Beale (Peter Dean), and agrees to have a drink with him sometime. Pete mistakes this for a date and is disappointed when she does not show up. Rachel apologises to him the following day and supports him when she discovers his flat has been trashed. Rachel helps Michelle get her wages from a timeshare company that tried to withhold it.", "Russell Nash, played by Ray Ashcroft, is the ex-boyfriend of Rachel Kominski (Jacquetta May), who arrives in Walford after she unknowingly hires one of his friends to put some bookshelves up for her. He attempts to reconcile with her, but she does not want to get back together with him, and ends up telling him that she had hated their three years together, especially the sex."]}, {"page": "List of EastEnders characters (1992)", "response": ["Lilian Kominski, played by Anna Korwin, is the mother of Rachel Kominski (Jacquetta May). She comes to stay with Rachel unexpectedly following a row with her husband, Joseph, and she refuses to return home until her husband begs her to. Lilian is an interfering, judgemental and critical person, who constantly upsets and embarrasses Rachel in front of her friends. She jibes Rachel for not dressing attractively or having a husband; criticises her lifestyle; meddles in her blossoming relationship with Richard Cole (Ian Reddington); frowns upon Rachel's lodger, Michelle Fowler (Susan Tully), for having an interracial relationship with Clyde Tavernier (Steven Woodcock); and tells anyone who cares to listen about how badly Rachel treats her and how much she has sacrificed for her. Rachel finds her presence highly stressful, but whenever she confronts her mother, Lilian gets upset, so Rachel is forced to backtrack to spare her feelings.", "Shelley Lewis, played by Nicole Arumugam, is a college friend of Michelle Fowler (Susan Tully), and is first seen in November 1992. When Michelle's housemate, Rachel Kominski (Jacquetta May), leaves Walford early in 1993, Shelley moves in with Michelle and her daughter Vicki Fowler (Samantha Leigh Martin) at 55 Victoria Road. She later gets a job as a part-time barmaid in The Queen Victoria pub, and is often seen hanging around with her other student pals Rich and her on/off boyfriend Clem (Jason Yates), which causes problems with Michelle when are caught smoking cannabis in front of Vicki.", "Jack reappears in December 1992 when he arrives unexpectedly at the Fowler house on Christmas Day, to visit Michelle. Jack soon reveals that he wants to continue his fling with Michelle, although she is adverse to this and gently but firmly declines. Jack is not perturbed and he continuously shows up in Walford with various different excuses in a bid to get close to Michelle. He secretly takes photos of her; arranges to be privately home tutored by her landlady Rachel Kominski (Jacquetta May) and interferes with her lingerie; has numerous fights with Clyde; begins to spend time with her mother Pauline (Wendy Richard) so he can pry into Michelle's private life and then smashes his head against a brick wall and turns up at Michelle's looking for sympathy."]}, {"page": "Home Farm Twins", "response": ["* Jacquetta May as Mary Moore"]}, {"page": "In Love with Barbara", "response": ["In Love with Barbara is a 2008 drama television film, inspired by the life of the romantic novelist Barbara Cartland, which tells the story of what made her the Queen of Romance. It was written by Jacquetta May and shown on BBC Four at 9:00pm, on Sunday 26 October 2008.", "* Jacquetta May – Polly Cartland "]}, {"page": "Annie Sawyer", "response": ["In series two (2010), Annie has a greater physical presence due to her inner strength and happiness; she is seen by normal humans and able to get a job in a bar. However, after a flirtatious relationship with Saul (Alex Lanipekun) he attempts to assault her which leaves her distressed. Her employer Hugh (Nathan Wright) expresses his affection; Annie states she will wait until she feels ready to reciprocate. After Saul dies Annie is confronted by his spirit which attempts to drag her through the door of death. Though she escapes the trauma causes her to lose her physical presence, her job and the possibility of a relationship with Hugh. When George is dumped by Nina (Sinead Keenan), Annie encourages him out of his depression by enlisting his help in helping set Hugh up with his ex-girlfriend. After another brush with a malevolent spirit — or Gatekeeper — trying to take her through the door, Annie is taught defence skills by the ghost Sykes (Bryan Dick) including how to close these doors and read the auras of others. In the sixth episode of the series Annie encounters her mother Carmen (Jacquetta May) for the first time since her death, and with the aid of a psychic is able to tell her to move on. The series finale sees Annie sent through a Door to the other side by Kemp (Donald Sumpter). She manages to return briefly through another door, exacting revenge on Kemp and saving Nina's life by dragging the former to the other side with her. Following this second disappearance, she appears on George, Nina and Mitchell's television explaining her situation in the afterlife as 'complicated' and excessively bureaucratic."]}, {"page": "List of LGBT-related films of 1998", "response": ["|Get Real ||  || United Kingdom || Romance, drama || Ben Silverstone, Brad Gorton, Charlotte Brittain, Jacquetta May, David Lumsden, Richard Hawley, Martin Milman, Stacy Hart, Kate McEnery, Patrick Nielsen, Tim Harris, James D. White, James Perkins, Nicholas Hunter, Steven Mason, Morgan Jones, Ian Brimble, Judy Buxton, David Elliot, Charlotte Hanson, Louise J. Taylor, Steven Elder, Leonie Thomas, David Paul West and Andy Rashleigh || Screenplay by Patrick Wilde, based on his play What's Wrong with Angry?"]}, {"page": "Jacquetta", "response": ["* Jacquetta May, British writer, actress and theatre director"]}]}}