{"wiki_id": "http://www.wikidata.org/entity/Q6125171", "itemLabel": "Jakie Astor", "itemDescription": "English politician (1918-2000)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jakie_Astor", "wikipedia_page": {"main": "Major Sir John Jacob Astor VII,   (29 August 1918 – 10 September 2000) was an English politician and sportsman. He was a member of the prominent Astor family.", "link_mentions": [{"page": "St Leger Stakes", "response": ["| Jakie Astor", "| Sir Jakie Astor"]}, {"page": "List of political families in the United Kingdom", "response": ["** Jakie Astor (1918–2000), Conservative MP for Plymouth Sutton 1951–1959; Waldorf and Nancy's son"]}, {"page": "Viscount Astor", "response": ["John Jacob Astor, 1st Baron Astor of Hever, was the third son of the first Viscount. This peerage, Baron Astor of Hever, was a separate creation in 1956 and not to be confused with the Viscount's subsidiary title of Baron Astor, of Hever Castle in the County of Kent. The Hon. David Astor CH, the Hon. Michael Astor and the Hon. Sir Jakie Astor, younger sons of the second Viscount, all gained prominence in public life."]}, {"page": "Astor family", "response": ["****** (10) Jakie Astor (b. 2003)"]}, {"page": "John Jacob Astor VI", "response": ["Even though some sources refer to Jakey as John Jacob V, John Jacob Astor, 1st Baron Astor of Hever (1886–1971) was born first and therefore is actually John Jacob Astor V. Sir Jakie Astor (1918–2000), youngest brother of David Astor, was John Jacob Astor VII; the 3rd Baron Astor of Hever is John Jacob Astor VIII. Jakey is sometimes (incorrectly) referred to as John Jacob III."]}, {"page": "Gordon Richards (jockey)", "response": ["At the end of the 1970 season, circumstances forced his hand and he had to give up training. Bookmaker William Hill, from whom he leased his stables, wished to restart his breeding operation there. Sobell and Weinstock negotiated to buy West Ilsley Stables from Jakie Astor, but a stipulation of the purchase was that incumbent trainer, Dick Hern, and stable jockey, Joe Mercer remained in place. He gave up training, but was elected an honorary member of the Jockey Club that year."]}, {"page": "Lockinge Stakes", "response": ["| Jakie Astor"]}, {"page": "Coronation Stakes", "response": ["| Jakie Astor"]}, {"page": "Yorkshire Oaks", "response": ["| Jakie Astor"]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|Jakie Astor"]}, {"page": "Plymouth Sutton (UK Parliament constituency)", "response": ["| 1951 || Jakie Astor || Conservative"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| Hon. Jakie Astor"]}, {"page": "Warburg family", "response": ["****** Daphne Warburg (b. 1949), married to Michael Ramon Langhorne Astor, eldest son of Jakie Astor."]}, {"page": "John Jacob Astor (politician)", "response": ["#REDIRECT Jakie Astor"]}, {"page": "Arnold Weinstock", "response": ["A member of the Jockey Club, Weinstock owned a number of thoroughbred racehorses. He and his father-in-law, Michael Sobell, entered ownership in 1957 and were immediately successful when purchasing London Cry, who won the 1958 Cambridgeshire Handicap. In 1960 they purchased the Ballymacoll Stud in Ireland from the estate of Dorothy Paget. Although they had many winners their first really good racehorse was a colt called Reform, who was the champion miler of 1967 and won amongst other races the St. James's Palace Stakes Sussex Stakes and Champion Stakes. Up until 1971 his horses were trained by Sir Gordon Richards but in 1970 with his father in law he purchased the West Ilsley stables from Jakie Astor, whereupon Dick Hern became his trainer. They had almost immediate success with two good Ballymacoll bred two-year-olds, and subsequent three-year-old milers, in Sallust and Sun Prince. They also owned and bred the St Leger Stakes runner-up Homeric. In 1974 Gaily, a purchased filly, won the Irish One Thousand Guineas. Their next good horse was Admetus who won the Washington International Stakes and the Prince of Wales's Stakes. A few years later they bred and owned Cistus who won the Lupe Stakes, Child Stakes, Nassau Stakes and the Prix de l'Opéra. They achieved every owner/breeders dream when Troy won the 200th Epsom Derby in 1979. In 1981 they sold the stables to the Queen."]}, {"page": "Lucy Middleton", "response": ["Middleton held Plymouth Sutton until 1951, when it was gained by another member of the Astor family, Jakie Astor."]}, {"page": "Joe Mercer (jockey)", "response": ["Despite winning his jockey championship with Henry Cecil, it was his relationship with the West Ilsley stable under Dick Hern for which he is most famous. Hern took over as trainer at West Ilsley at the end of 1962 on the retirement of Jack Colling, and there was no question he would remain in place on Hern's takeover. The stable was endowed with several top owner-breeders and was now owned by John Jacob Astor (then known as Jakie Astor, and later as Sir John Astor), who with his brother Lord Astor provided most of the horse firepower.", "1968 promised much and Mercer scored two early victories in Classic Trials when Heathen (owned by Holliday) won the Greenham Stakes and La Mome (owned by Jakie Astor) won the Princess Elizabeth Stakes. Early in May, Remand (owned also by Astor) beat Connaught in the Chester Vase, a recognised Epsom Derby trial, whilst giving the Noel Murless trained colt weight. Soon afterwards the horses appeared to lose form and Dick Hern described Remand's appearance in the paddock at Epsom prior to the Derby as being 'horrible, his coat was standing up like a hedgehog'. Beaten by both Sir Ivor and the Chester Vase second, Connaught, Remand finished fourth. Through the equine virus in the stables, Mercer missed a good chance of winning the Derby, a race he was ultimately never to win. Remand was very ill after the race, not appearing again that season and the stable went into decline. Despite shutting down completely for months on end, the virus did not leave the stable until the end of the 1969 season. However Mercer did manage to win the Doncaster Cup, a leading late-season Group race for his stable with The Accuser.", "Jakie Astor negotiated to sell West Ilsley to Sobell and his son-in-law Arnold Weinstock on the understanding that both Hern and Mercer were kept in place as trainer and stable jockey respectively. Before the 1971 flat season started most interest was on the Lady Beaverbrook-owned pair of Seaepic and Seaswan (both sired by Sea Bird II). Both disappointed in their trial races and later, whilst Brigadier Gerard, without a prep race, won what would in hindsight be regarded as the best Two Thousand Guineas since 1947. A Sobell/Weinstock-owned colt, Homeric, won the Lingfield Derby Trial ridden by Mercer. Homeric was the stable's first Derby runner since 1968 when running at Epsom but was outclassed by Mill Reef, finishing fifth. Later in the year Homeric finished second in the St. Leger under Mercer's ride. Brigadier Gerard finished the year the unbeaten winner of six races (five of them Group One). The new power to appear was in the two-year-old ranks, where three smart colts ran at Royal Ascot, all ridden by Mercer. Sun Prince, as a maiden, won the Coventry Stakes and later followed up by winning the Prix Robert Papin in France then finishing third in the Middle Park Stakes. Fellow maiden Sallust was made favourite for the Windsor Castle Stakes but finished unplaced. However he won his next race before ending his season with a win in the Richmond Stakes at Goodwood Racecourse. The third colt, Rampage, having won his maiden decisively attempted the Norfolk Stakes despite the presence of good horses such as Deep Diver and Philipp of Spain. Unfortunately Rampage died of a heart attack during the race."]}, {"page": "GHQ Liaison Regiment", "response": ["Famous Phantom officers included: actors Major David Niven (who initially commanded A Squadron and who remarked in a letter, \"these were wonderful days which I would not have missed for anything\"), Tam Williams and Willoughby Gray; MPs Sir Jakie Astor, The Hon. Michael Astor, Peter Baker, Sir Hugh Fraser, Maurice Macmillan (Viscount Macmillan), Sir Carol Mather and Christopher Mayhew (Lord Mayhew); Law Lord Nigel Bridge, Baron Bridge of Harwich; journalist Sir Peregrine Worsthorne; and Metropolitan Police Commissioner Sir Robert Mark. Others, such as Michael Oakeshott and John Hislop, excelled in the fields of academia or athletics."]}, {"page": "List of New College, Oxford people", "response": ["*Jakie Astor, British Conservative Party politician and sportsman"]}, {"page": "Index of World War II articles (J)", "response": ["# Jakie Astor"]}, {"page": "John Astor", "response": ["*Jakie Astor (Sir John Jacob Astor VII, 1918–2000), nephew of the 1st Baron, English politician and sportsman "]}, {"page": "Sir John Jacob \"Jakie\" Astor", "response": ["#REDIRECT Jakie Astor"]}, {"page": "Sir John Jacob Astor", "response": ["#REDIRECT Jakie Astor"]}, {"page": "Provoke (horse)", "response": ["Provoke was a bay horse with a narrow white blaze and white socks on his hind feet, bred and owned by Jakie Astor. He was sired by the King George VI and Queen Elizabeth Stakes winner Aureole. His dam, Tantalizer was a good racemare who was placed in the Irish Oaks and the Ribblesdale Stakes and was a half-sister of the outstanding stayer Trelawny. As a descendant of the mare Popinjay, Provoke was a member of the same branch of Thoroughbred family 1-n which produced Swale and Shadeed."]}, {"page": "Astor (surname)", "response": ["*Jakie Astor (19182000), British politician"]}, {"page": "Persian War (horse)", "response": ["Persian War was bred by Jakie Astor (The Honourable John Jacob Astor), later Sir John Astor, and was a big bay gelding. His sire, Persian Gulf, was a son of Triple Crown winner Bahram and had won the Coronation Cup in 1944. His dam, Warning, was a big boned daughter of champion sire Chanteur (also the winner of the Coronation Cup), and had produced Escort, who finished fourth in the Derby for Jakie Astor. Warning was not a product of the Astor Studs (from which most of Jakie's mares derived) but had been purchased by Jakie."]}, {"page": "Edward Warburg", "response": ["* Daphne Warburg (b. 1949), who married Michael Ramon Langhorne Astor (b. 1946), eldest son of Jakie Astor."]}, {"page": "Deaths in September 2000", "response": ["*Jakie Astor, 82, English politician and sportsman."]}]}}