{"wiki_id": "http://www.wikidata.org/entity/Q6129879", "itemLabel": "James Blindell", "itemDescription": "British politician (1884-1937)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Blindell", "wikipedia_page": {"main": "Sir James Blindell (1884 – 10 May 1937) was an English Liberal Party politician in the United Kingdom, who served as the Member of Parliament (MP) for Holland with Boston from 1929 until his death.Born in Hitchin, Hertfordshire, Blindell was first elected as the constituency's MP at a by-election in March 1929, caused by the death of the Conservative MP Arthur Dean.  At the time he was managing director of a boot manufacturing business. Blindell overturned a Conservative majority of nearly 5,000 to win with a majority of 3,706.  His victory was the last Liberal by-election gain until Torrington in 1958.\nBlindell was re-elected as a Liberal at the 1929 general election, but in 1931 he was one of the Liberal MPs who broke with their party to support Ramsay MacDonald's National Government, eventually forming the National Liberal Party.\nHe was re-elected as a National Liberal at the 1931 general election and at the 1935 general election.  In both elections, the Conservatives (who also supported the National Government) did not field a candidate against him, and he was returned with large majorities.Blindell was knighted in 1936. He was killed in a car accident in 1937 in Stickford, near Spilsby, Lincolnshire. The car overturned when the driver swerved to avoid dogs in the road. Sir James died within five minutes of massive head injuries. Lady Blindell survived the accident with minor injuries.At the consequent 1937 Holland with Boston by-election, Herbert Butcher held the seat for the National Liberals.", "link_mentions": [{"page": "1937", "response": ["* May 10 – Sir James Blindell, British politician (b. 1884)"]}, {"page": "John Parker (Labour politician)", "response": ["He contested the seat of Holland with Boston in Lincolnshire in the 1931 general election, but the sitting National Liberal MP James Blindell was reelected."]}, {"page": "National Government (1935–1937)", "response": ["| James Blindell"]}, {"page": "National Liberal Club", "response": ["*Sir James Blindell, Liberal and National Liberal MP 1929–37."]}, {"page": "List of MPs elected in the 1931 United Kingdom general election", "response": ["|James Blindell"]}, {"page": "List of MPs elected in the 1935 United Kingdom general election", "response": ["|Sir James Blindell"]}, {"page": "List of United Kingdom by-elections (1918–1931)", "response": ["|James Blindell"]}, {"page": "List of United Kingdom by-elections (1931–1950)", "response": ["|James Blindell"]}, {"page": "List of Liberal Party (UK) MPs", "response": ["* James Blindell, Holland with Boston, 1929–31"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|James Blindell"]}, {"page": "List of National Liberal Party (UK, 1931) MPs", "response": ["| James Blindell || Holland with Boston || 1931 || 1937"]}, {"page": "Holland with Boston (UK Parliament constituency)", "response": ["|rowspan=\"2\"| Sir James Blindell"]}, {"page": "1937 in the United Kingdom", "response": ["* 10 May – Sir James Blindell, politician (born 1884)"]}, {"page": "Herbert Butcher", "response": ["He was elected as the Member of Parliament (MP) for Holland with Boston at a by-election in June 1937, after the death of the National Liberal MP Sir James Blindell. He held the seat at the next six general elections until his retirement at the 1966 general election, when Richard Body was elected as his successor."]}, {"page": "Arthur Dean (British politician)", "response": ["Dean of Carlton Scroop Manor, Grantham,  was elected as the Member of Parliament (MP) for Holland with Boston at a by-election in July 1924 and re-elected at the general election in November 1924. He held the seat until his death in early 1929.  The resulting by-election for his seat was won by the Liberal Party candidate James Blindell, the Liberals' last by-election gain until the 1958 Torrington by-election."]}, {"page": "Sir James Blindell", "response": ["#REDIRECT James Blindell"]}, {"page": "1929 Holland with Boston by-election", "response": ["The Labour candidate was George Blanco White, a  lawyer who had stood here last time. The Liberals chose a new candidate in James Blindell a Managing Director of a Boot Manufacturing business.", "The result was a victory for the Liberal Party candidate James Blindell, who overturned a Unionist majority of 4,770 to win by a majority of 3,706 votes.  "]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["|Sir||James Blindell||1884||1937 (killed when car overturned)||Holland with Boston (1929-death)||National Liberal||"]}, {"page": "1937 Holland with Boston by-election", "response": ["The seat had become vacant when the constituency's National Liberal Member of Parliament (MP), Sir James Blindell (1884 – 10 May 1937) died."]}, {"page": "Chief Whip of the Liberal Democrats", "response": ["|James Blindell (knighted in 1936)"]}, {"page": "List of Lords Commissioners of the Treasury", "response": ["**James Blindell", "**James Blindell", "**James Blindell", "**James Blindell", "**James Blindell"]}, {"page": "National Government (1931–1935)", "response": ["| James Blindell"]}, {"page": "G. R. Blanco White", "response": ["He served in the First World War with the Royal Garrison Artillery. He stood for the Labour Party at the 1929 Holland with Boston by-election, coming second to Liberal James Blindell."]}, {"page": "1936 New Year Honours", "response": ["*James Blindell  Member of Parliament for Holland-with-Boston, since 1929. A Lord Commissioner of the Treasury, since 1932."]}, {"page": "Blindell, James", "response": ["#redirectJames Blindell"]}]}}