{"wiki_id": "http://www.wikidata.org/entity/Q6128765", "itemLabel": "Simon Wheeler", "itemDescription": "British screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Wheeler", "wikipedia_page": {"main": "Simon Wheeler is a British screenwriter and television producer who created the ITV1 drama Kingdom. He has also written for Wire in the Blood, a series that formerly starred his future wife Hermione Norris. Norris and Wheeler have two children together, Wilf (June 2004) and Hero (August 2007).Wheeler is one of the three sons of General Sir Roger Wheeler.In 2013, he produced Castles in the Sky. Currently (2021) teaches Film at the very exclusive private school Bryanston near his home in Blandford Forum, Dorset.", "link_mentions": [{"page": "Queens' College, Cambridge", "response": ["*In Kingdom (2007–2009 TV series), created by Simon Wheeler and Alan Whiting, solicitor Peter Kingdom (played by Stephen Fry) and his brother (Dominic Mafham) are both Cambridge graduates. In the fourth episode of the first series, Kingdom returns to Cambridge and meets his old tutor (Richard Wilson), when one of his clients alleges that her daughter has been rejected by his old college purely because of her working-class background. Although the college is never identified, it is Queens', where Fry himself was a student, that appears on screen."]}, {"page": "Roger Wheeler (British Army officer)", "response": ["In 1980 he married Felicity Hares; they have three sons, including Simon Wheeler, and one daughter by a former marriage. He is the nephew of the late Air Chief Marshal Sir Neil Wheeler."]}, {"page": "Hermione Norris", "response": ["In 2002, Norris began a relationship with Simon Wheeler, a writer on Wire in the Blood. The couple married in December 2002 in a ceremony at the Tower of London.Tweedie, Neil (28 February 2008). \"Hermione Norris: 'I nearly gave up acting to be a lawyer...'\". The Daily Telegraph (Telegraph Media Group). They have two children.Staff (31 August 2007). \"Cold Feet actress has baby girl\". BBC News. Retrieved 1 September 2007. Norris's father-in-law is General Sir Roger Wheeler, the Chief of the General Staff from 1997 to 2000."]}, {"page": "Kingdom (British TV series)", "response": ["Kingdom is a British television series produced by Parallel Film and Television Productions for the ITV network. It was created by Simon Wheeler and stars Stephen Fry as Peter Kingdom, a Norfolk solicitor who is coping with family, colleagues, and the strange locals who come to him for legal assistance. The series also starred Hermione Norris, Celia Imrie, Karl Davies, Phyllida Law and Tony Slattery."]}, {"page": "He Died with a Felafel in His Hand (film)", "response": ["The roommates all complain to themselves about their problems. Dirk enters to declare that he is gay, but is disappointed by the lack of reaction from the roommates, who had all assumed as much. Danny loses his temper with Dirk, urging Dirk to chill out, since he is not the only one with problems. Danny then locks himself in his bedroom with a telephone sitting on his chest. Taylor slides food to him under the door. Several hours later, Anya slides a cigarette through, and, sitting on the other side of the door, tells Danny a story about lovers, the plot of Solaris. Danny takes the cigarette. Taylor discovers that Penthouse has published Danny's story. As Taylor gives Danny the good news, Flip arrives at the door, and reveals that he has left rehab. Sgt. O'Neill arrives with a partner (Simon Wheeler). She adds up the amount due in Corcoran's bills as $24,974 and issues a summons to Danny to appear in court. At night, Danny tells Flip that he is going to be sent to prison for credit fraud, but Flip says he needs Danny because he is the only friend he has who is not on drugs. Flip leaves Danny's room to get something to eat.", "*Simon Wheeler as O'Neill's Partner"]}, {"page": "University of Cambridge in popular culture", "response": ["* In Kingdom (2007–2009 TV series), created by Simon Wheeler and Alan Whiting, solicitor Peter Kingdom (played by Stephen Fry) and his brother (Dominic Mafham) are both Cambridge graduates. In the fourth episode of the first series, Kingdom returns to Cambridge and meets his old tutor (Richard Wilson), when one of his clients alleges that her daughter has been rejected by his old college purely because of her working-class background. Although the college is never identified, it is Queens', where Fry himself was a student, that appears on screen."]}, {"page": "Castles in the Sky (film)", "response": ["Castles in the Sky was commissioned by Janice Hadlow for BBC Two and Kim Shillinglaw, head commissioner for science and natural history. It is produced by Simon Wheeler for Hero Film and Television with Arabella Page Croft and Kieran Parker as co-producers for Black Camel Pictures. The director is Gillies MacKinnon and the writer is Ian Kershaw, who has previously worked on Shameless. Castles in the Sky is produced with Open University, BBC Two, BBC Scotland, BBC Worldwide and Creative Scotland with Glasgow Film Office, Robert Watson Watt Trust and Brechin Civic Trust."]}]}}