{"wiki_id": "http://www.wikidata.org/entity/Q6128926", "itemLabel": "James Athol Wood", "itemDescription": "Royal Navy admiral", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Athol_Wood", "wikipedia_page": {"main": "Sir James Athol Wood CB (1756 – July 1829), was an officer of the Royal Navy. After serving on merchant ships for the East India Company from a young age, he entered the Royal Navy in 1774. Wood served in the navy for almost his whole life, and took part in several of the wars fought by Kingdom of Great Britain throughout the eighteenth and nineteenth century. During his career he was involved in several personal conflicts and feuds, which resulted in him being the subject of two courts-martial.", "link_mentions": [{"page": "James Wood", "response": ["* James Athol Wood (1756–1829), British rear-admiral"]}, {"page": "Sir John Duckworth, 1st Baronet", "response": ["Duckworth remained in Jamaica until 1805, returning to England that April aboard .pp.108-122, Lysons On his return to England again, he was called to face court-martial charges brought by Captain James Athol Wood of HMS Acasta, who claimed that Duckworth had transgressed the 18th Article of War; \"Taking goods onboard other than for the use of the vessel, except gold & etc.\" Duckworth had apparently acquired some goods, and in wishing to transport them home in person reassigned Captain Wood to another vessel on Jamaica station knowing that the vessel was soon to be taken under command by another flag officer. Consequently, Duckworth was able to take the goods to England as personal luggage, and Wood was forced to sail back as a passenger on his own ship. The court-martial was held on board  in Portsmouth on 25 April 1805, but the charge was dropped on 7 June 1805. Sir John Thomas Duckworth, K.B., Papers, 1801-1807 Manuscript Group 18p.78, James; p.84, Stanier Clarke, Jones, Jones"]}, {"page": "HMS Neptune (1797)", "response": ["Threatened, Troude put to sea, chased by Cochrane's squadron. After a running battle over several days the Hautpoult was brought to action and captured. Neptunes captain, Charles Dilkes, was given command of her, while Captain James Athol Wood succeeded him in command of Neptune on 2 August."]}, {"page": "Action of 5 November 1813", "response": ["| align = left |Captain James Athol Wood"]}, {"page": "HMS Anson (1781)", "response": ["Anson was then assigned to Charles Brisbane's squadron and joined Brisbane's  and James Athol Wood's ."]}, {"page": "Gatton (UK Parliament constituency)", "response": ["| James Athol Wood"]}, {"page": "HMS Armada (1810)", "response": ["On 4 November 1813 Armada arrived off Cap Sicié and the next day was involved in a skirmish with a French squadron off Toulon. Admiral Sir Edward Pellew's inshore squadron consisted of the 74-gun third rates Scipion, , , and Armada, Captains Henry Heathcote, Thomas James Maling, James Brisbane, and Charles Grant. The 74-gun third rate Pompée, Captain Sir James Athol Wood, joined them. These vessels opened fire on the French fleet consisting of 14 sail of the line and seven frigates, which had sortied from Toulon on a training exercise. Pellew and the main body of his force soon arrived to join the fray. Neither side accomplished much as the French rapidly returned to port. Armada had no casualties though one shot did hit her, and in all the British suffered 12 men wounded by enemy fire and one man killed and two wounded in an accident. Pellew mentioned in his letter that the only reason he had reported the incident was to provide an accurate account to counteract French propaganda. The French suffered 17 wounded."]}, {"page": "HMS Acasta (1797)", "response": ["In spring 1802 James Athol Wood replaced Fellowes. Acasta spent some time the Mediterranean before returning to Portsmouth on 8 July 1802. She then sailed again for the Mediterranean on 8 November carrying dispatches relating to the Treaty of Amiens.  After her return to England Wood again recommissioned her. From January 1803 she was on the North Sea station, based at Lieth."]}, {"page": "List of people with surname Wood", "response": [":* James Athol Wood (1756–1829), British rear-admiral"]}, {"page": "Invasion of Martinique (1809)", "response": ["| align= left  |Captain James Athol Wood"]}, {"page": "HMS Favourite (1794)", "response": ["===Commander James Athol Wood===", "Favourite was commissioned in March 1794 under Commander Charles White. In September of the next year Commander James Athol Wood took command and sailed her for the Leeward Islands."]}, {"page": "Charles Lydiard", "response": ["Anson was then assigned to Charles Brisbane's squadron and joined Brisbane's Arethusa and James Athol Wood's . The ships were despatched in November 1806 by Vice-Admiral James Richard Dacres to reconnoitre Curaçao. They were joined in December by  and Brisbane decided to launch an attack on 1 January 1807. The British ships approached early in the morning of 1 January and anchored in the harbour. They were attacked by the Dutch, at which Brisbane boarded and captured the 36-gun frigate Halstaar, while Lydiard attacked and secured the 20-gun corvette Suriname. Both Lydiard and Brisbane then led their forces on shore, and stormed Fort Amsterdam, which was defended by 270 Dutch troops. The fort was carried after ten minutes of fighting, after which two smaller forts, a citadel and the entire town were also taken. More troops were landed while the ships sailed round the harbour to attack Fort République. By 10 am the fort had surrendered, and by noon the entire island had capitulated. Lydiard was sent back to Britain carrying the despatches and captured colours. The dramatic success of the small British force carrying the heavily defended island was rewarded handsomely. Brisbane was knighted, and the captains received swords, medals and vases."]}, {"page": "Thomas Herbert (Royal Navy officer)", "response": ["From March 1810 to June 1814, Herbert served as a lieutenant on board HMS Pompée under Captain James Athol Wood in the West Indies, Home, and Mediterranean stations. In 1814, he became first lieutenant under Captain Charles John Napier of the frigate HMS Euryalus, in which he served in the War of 1812 against the United States.Stephen, Leslie; Lee, Sidney (1891). Dictionary of National Biography. Volume 26. New York: Macmillan and Co. pp. 217–218. He was mentioned in the dispatches of Sir James Gordon for his ability and exertions displayed throughout the operations on the Potomac River, including the capture of Fort Washington and Raid on Alexandria. After serving in over twenty engagements and being wounded three times, he was promoted to commander on 19 October 1814. He did not take up his commission until February 1815, and he remained on half-pay until 6 September 1821."]}, {"page": "Sir Mark Wood, 1st Baronet", "response": ["Mark Wood was the eldest son of Alexander Wood of Perth, descended from the family of the Woods of Largo, to the estates of which Alexander succeeded on the death of his cousin, John Wood, sometime governor of the Isle of Man. Mark became a cadet of the East India Company's army in 1770, and went to India with his brother George (afterwards a major-general of the Indian army and K.C.B.), who died in 1824. Another brother was Sir James Athol Wood."]}, {"page": "HMS Charlotte (1798)", "response": ["The Royal Navy armed Charlotte with eight 6-pounder guns and gave her a crew of 60 men. There are no records of any of her dimensions.  She was commissioned under Lieutenant John Williams. A letter from Commander James Athol Wood of  reporting on the recapture of a vessel on 9 March 1796, states that he put \"The Officers on Board the Charlotte Sloop, Lieutenant Williams...\"."]}, {"page": "HMS Sibyl (1779)", "response": ["In February 1798 Captain J. C. Searle sailed Garland for the Cape of Good Hope. There Captain James Athol Wood replaced him."]}, {"page": "List of MPs elected in the 1806 United Kingdom general election", "response": ["| James Athol Wood"]}]}}