{"wiki_id": "http://www.wikidata.org/entity/Q6129724", "itemLabel": "James Berrett", "itemDescription": "association football player (born 1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Berrett", "wikipedia_page": {"main": "James Trevor Berrett (born 13 January 1989) is a professional footballer who plays as a midfielder for Grantham Town. He played for the Republic of Ireland national under-21 team.", "link_mentions": [{"page": "Carlisle United F.C.", "response": ["Carlisle completed two full seasons with Abbot at the helm, and achieved comfortable mid-table finishes in both. More noteworthy were the two runs in the Football League Trophy which took place in those seasons. The team were beaten in the final in 2010 but returned the following year, with new signings including François Zoko and James Berrett, to win the trophy in 2011. The following season started successfully for the Cumbrians with Rory Loy, Lee Miller and Zoko all forming a hugely successful strike-partnership. They sustained a considerable play-off push throughout the season. Having occupied 6th place (final play-off position) for a period of the season, a dip in form towards the end of the seasons saw The Cumbrians miss out by just two points to Stevenage, meaning a successful seasons for the Cumbrians couldn't be rounded off with an appearance in the League One play-offs."]}, {"page": "2006–07 Huddersfield Town A.F.C. season", "response": ["On 5 May, it was announced that six of Town's second-year scholars were offered professional contracts. They were Joe Skarz (who had already signed his), Luke Malcher, Simon Eastwood, James Berrett, Mitchell Bailey, and Lucas Akins,   who had already been offered a new professional contract. Fellow youngster Alex Hallam was released.", "|25||James Berrett||||MF||0 (2)||0||0||0||0||0||0||0||0 (2)||0"]}, {"page": "2007–08 Huddersfield Town A.F.C. season", "response": ["|22||James Berrett||||MF||10 (5)||1||2||0||0||0||0||0||12 (5)||1"]}, {"page": "2008–09 Huddersfield Town A.F.C. season", "response": ["On 6 May 2008, following the mixed season, new manager Stan Ternent released nine players from the club. They were Chris Brandon, Danny Schofield (who had already announced his plans to leave), Frank Sinclair, Matty Young, Aaron Hardy, Danny Racchi, Lucas Akins, Mitchell Bailey and Luke Malcher. Matt Glennon, Joe Skarz and James Berrett were offered new deals, while captain Rob Page had signed a pre-contract agreement with League 2 side Chesterfield, much to the disappointment of Ternent, who hadn't had chance to offer him a new contract at the Galpharm Stadium. The following day, Danny Schofield agreed a pre-contract agreement with fellow League 1 side Yeovil Town. On that same day, Matt Glennon signed a two-year contract with an optional third year and then Joe Skarz put pen to paper on his new three-year contract, the day after that. Recently called-up Ireland U-21 international James Berrett signed his new two-year deal on 13 May. On 30 May, Chris Brandon completed a move to his hometown club Bradford City. On 1 July, Frank Sinclair re-joined ex-Town manager Peter Jackson at Lincoln City. On 7 July, Matty Young joined Conference North side Harrogate Town. Aaron Hardy joined him there on 26 July. On 22 July, Lucas Akins made a surprise move to newly promoted Scottish Premier League side Hamilton Academical. 6 days later, Danny Racchi joined Bury. Mitchell Bailey joined Conference North side Hyde United on 7 August. On 11 August, central defender David Mirfin joined fellow League 1 side Scunthorpe United in a deal worth £150,000. Young defender Shane Killock joined Conference North side Harrogate Town on a month's loan on 1 September. He returned to Town on 7 October. He was loaned out to Oxford United on 2 January 2009. He signed a permanent deal at the Kassam Stadium on 3 February. Sierra Leonean international Malvin Kamara joined Football League Two side Grimsby Town on a month's loan on 24 September. He returned to the Galpharm on 25 October. On 23 October, Tom Clarke moved across West Yorkshire to Bradford City on a month's loan. The loan was extended, but he was recalled by Town on 3 December. On 27 November, Town sent 3 players out on loan just before the end of the transfer deadline window. Michael Flynn joined League 2 side Darlington and young duo Simon Eastwood and Tom Denton joined Conference National side Woking. Flynn returned to the Terriers on 29 December, Denton returned in January and Eastwood returned following an injury to Matt Glennon. Meanwhile, striker Luke Beckett left the club and joined Conference North side Gainsborough Trinity until the end of the season. Luke Malcher joined Harrogate Town on 11 December. Young striker Daniel Broadbent joined Rushden & Diamonds on loan on 15 January, he returned to the Galpharm on 16 February. 3 days later, he joined Town's new signing, Lee Novak, on loan at Gateshead, before returning on 19 March. On 24 March, he joined Harrogate Town on loan. Ex-captain Jon Worthington joined fellow League 1 side Yeovil Town on 30 January on a month's loan, which was extended, before he returned on 26 March. Keigan Parker joined fellow League 1 side Hartlepool United on loan on 2 March. Tom Denton joined his previous club Wakefield on loan on 6 March. He was joined there by fellow youngster Dan Codman on 10 March. Striker Phil Jevons joined League Two side Bury on a month's loan on 23 March. Joe Skarz joined Keigan Parker on loan at Hartlepool United on 26 March, as the loan window closed. David Unsworth, signed by Ternent at the start of the season was released from his contract on 30 March.", "|22||James Berrett||||MF||8 (1)||1||0||0||0||0||1||0||9 (1)||1"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|James Berrett||||2007–2010||20 (15)||2||2 (1)||0||0 (1)||0||2||0||0||0||24 (17)||2"]}, {"page": "2009–10 Huddersfield Town A.F.C. season", "response": ["|22||James Berrett||||MF||2 (7)||0||0 (1)||0||0 (1)||0||1||0||0||0||3 (9)||0"]}, {"page": "Huddersfield Town A.F.C. Reserves and Academy", "response": ["The role of the Huddersfield Town Academy is to develop players and their abilities to their full potential for the club's first team. The academy has produced a number of players, including former England under-21 players Andy Booth and Jon Stead, former Irish Under 21 internationals Michael Collins and James Berrett as well as Nathan Clarke, who made 300 appearances for the first team. The academy is currently managed by former Sheffield Wednesday and Sheffield United player Leigh Bromby.", "|James Berrett  || Halifax Town ||   Halifax ||  Rep. Ireland U-21 || Age 18 v Oldham Athletic (a), 7 April 2007 || style=\"text-align:center;\"| 41 || style=\"text-align:center;\"| 2 || rowspan=\"2\" style=\"text-align:center;\"|  Gerry Murphy"]}, {"page": "2010–11 Plymouth Argyle F.C. season", "response": ["Having issued a notice of intention to appoint an administrator in February, the club officially went into administration on 4 March.\"Plymouth go into administration to avoid high court winding up move\". The Guardian. David Conn. 4 March 2011. Retrieved 4 March 2011. Brendan Guilfoyle of P&A Partnership was appointed to run the club and search for a buyer.\"Plymouth Argyle go into administration\". BBC Sport. 4 March 2011. Retrieved 4 March 2011. A brace from Joe Mason and one each from Bondz N'Gala and Yannick Bolasie earned Argyle a 4–2 win at Sheffield Wednesday. Giles Coke and former player Réda Johnson scored for the home side.\"Sheff Wed 2–4 Plymouth\". BBC Sport. 5 March 2011. Retrieved 5 March 2011. Argyle moved off the bottom of the League One table after winning their third match in a row. They were replaced by Swindon Town, who they defeated 1–0 at home. The winning goal was scored by Rory Fallon in the tenth minute.\"Plymouth 1–0 Swindon\". BBC Sport. 8 March 2011. Retrieved 9 March 2011. The club's run of wins came to an end at Hartlepool United as Antony Sweeney and Sam Collins scored either side of half time in a 2–0 win for the home side.\"Hartlepool 2–0 Plymouth\". BBC Sport. 12 March 2011. Retrieved 13 March 2011. A late goal from Yannick Bolasie earned Argyle a 1–1 draw at Carlisle United, who had taken the lead in the first half through James Berrett.\"Carlisle 1–1 Plymouth\". BBC Sport. 15 March 2011. Retrieved 16 March 2011."]}, {"page": "2010–11 Huddersfield Town A.F.C. season", "response": ["On 2 June, Icelandic international Joey Guðjónsson signed on a 2-year contract from recently relegated Premier League side Burnley. Two days later, Scottish international left-back Gary Naysmith signed for the Terriers after rejecting a new contract at Sheffield United. On the same day, goalkeeper Simon Eastwood left the club to join newly promoted Football League Two side Oxford United. On 17 June, goalkeeper Ian Bennett was signed on a free transfer from Sheffield United. On 22 June, striker Tom Denton left the club by mutual consent. The following day, defender Andy Butler also had his contract paid up and left the club. On 29 June, left-back Joe Skarz signed for Football League Two side Bury for an undisclosed fee. The following day, winger Lee Croft joined the Terriers on a 6-month loan deal from Derby County. He returned to Derby on 3 January 2011. On 1 July, defender Jamie McCombe, whose brother John, played for Town in the not too distant past, joined the Terriers for an undisclosed fee from Bristol City. The following day, after failing to reach a new deal, Krystian Pearce left the club after playing just 45 minutes for the Terriers. He eventually joined Notts County. On 6 July, midfielder James Berrett left the club to join fellow League One side Carlisle United on a free transfer. Later that day, midfielder Michael Collins joined Football League Championship side Scunthorpe United for an undisclosed fee. On 14 July, young Irish winger Graham Carey signed on a 6-month loan from Scottish Premier League runners-up Celtic. He returned to Celtic on 13 January 2011, after Town failed to agree terms on an extension to his deal. On 21 July, striker Joe Garner signed on a 6-month loan from Nottingham Forest. He returned to Forest on 4 January 2011. On 28 July, two of Town's youngsters, Jack Hunt and Leigh Franks, were sent out on 6-month loans to Chesterfield and Oxford United respectively. On 5 August, midfielder Damien Johnson was signed on a season-long loan from League One rivals Plymouth Argyle. The following day, striker Robbie Simpson joined Brentford on a season-long loan. On 25 August, striker Alan Lee joined the club for an undisclosed fee from Crystal Palace. On 31 August, Jim Goodwin left the club my mutual consent. He would join Scottish Premier League side Hamilton Academical on 6 September. On 8 September, Theo Robinson joined Championship side Millwall on an emergency 3-month loan deal, but he returned in November, after picking up an injury. He then rejoined the club on a permanent deal on 13 January, for an undisclosed fee. On 15 October, Town brought in experienced keeper Nick Colgan on a one-month loan from Conference National side Grimsby Town. He returned a month later, after making no appearances for Town. On 21 January 2011, he signed for Town on a permanent deal, after being released by Grimsby. On 1 January 2011, as the transfer window reopened, Town signed the experience Ireland international Kevin Kilbane on loan from Hull City for the rest of the season. On 10 January, Town signed Newcastle United's Hungarian international defender Tamás Kádár on loan. On 27 January, Town stalwart Nathan Clarke joined Town's League One rivals Colchester United on loan. On 31 January, as the transfer window was about to shut, Danny Cadamarteri returned to the Terriers on a short-term contract following his release by Scottish Premier League side Dundee United. On 26 February, Town signed left-back Stephen Jordan on an emergency one-month loan from Sheffield United, following injuries to Gary Naysmith and Liam Ridehalgh. On 15 March, a week after the sickening injury that curtailed Anthony Pilkington's involvement in the season, Town increased their attacking options by bringing in winger Danny Ward on loan from Premier League side Bolton Wanderers for the rest of the season. They then bolstered their defensive options by signing centre-back Sean Morrison on loan from Reading on 23 March. Just as the transfer window shut, young midfielder Aidan Chippendale was sent on loan to Conference National side York City", "| James Berrett"]}, {"page": "2011 Football League Trophy Final", "response": ["|LM ||21|| James Berrett"]}, {"page": "2011–12 Carlisle United F.C. season", "response": ["|3 ||MF || ||21 ||James Berrett || 9 || 1 || 0 || 0 || 10", "|21 || ||MF ||James Berrett || 10 || 0 || 0 || 0 || 2 || 0 || 1 || 1 || 13 || 1"]}, {"page": "2011–12 Sheffield Wednesday F.C. season", "response": ["The first week of April saw new Sheffield Wednesday manager Dave Jones win the Football League One Manager of the Month award, while Michail Antonio just missed out on Player of the Month award. 7 April saw another early kick-off with Sheffield Wednesday playing West Yorkshire rivals Huddersfield Town who were six points behind Sheffield Wednesday in fourth place and with a game in hand – meaning if they won Wednesday and their game in hand they would be above The Owls on goal difference. While Sheffield Wednesday of course were still trying to catch Sheffield United and every game was seen as a must win game. After a goalless first half Sheffield Wednesday seemed to be much of the better team, which was surprising considering the importance of the game for both teams, as well as both teams being next to each other in the table. It was a much closer contest in relation to goals, as the last meeting at Hillsborough Stadium finished an amazing 4–4. On the fifty-fourth minute Spaniard Miguel Llera struck a free-kick round the wall and into the bottom corner, scoring his first goal for Wednesday and giving them a well deserved lead. Then Nile Ranger found himself through on goal eighteen minutes later and having missed a 'sitter' and hitting the bar earlier, he showed composure to double The Owls' lead and the game finished 0–2. Sheffield Wednesday went home happy in knowledge of the importance of the game and the fact that they won comfortably compared to what was expected to be a very tough game. Sheffield United played later on in the day and again won as they edged out a 2–1 victory over Bournemouth. Two days later on the Bank Holiday Monday The Owls played their third consecutive early kick-off in a row as they played back at home and were live on Sky Sports against Oldham Athletic. Sheffield Wednesday had so far had similar results against the same clubs as their rivals Sheffield United, such as both losing at the likes of Carlisle United, Charlton Athletic, and Walsall, and both winning against teams such as Bournemouth, Bury etc. And with the knowledge of Sheffield United losing to Oldham Athletic earlier on in the season at home, Wednesday needed to ensure that this did not happen here. Gary Madine scored just before half-time and then Keith Treacy's two crosses with each foot secured victory for The Owls as Miguel Llera and Ryan Lowe headed home from them. Sheffield United again played later, this time a day after Sheffield Wednesday and they won bottom of the league Rochdale. With both rivals in such good form as they aim for automatic promotion it was likely to be who 'slipped' up first. And unfortunately for Sheffield Wednesday it was them as they drew with Colchester United, who had drawn their last four games at home. This game finished 1–1 after an early goal from Ian Henderson from a poor mistake by Michail Antonio and Miguel Llera equalised in the second half but The Owls were unable to pull off those three vital points and drew meaning with Sheffield United winning they were four points behind their rivals with three games to go – so although it had once before in the season looked like Sheffield United had secured the automatic promotion spot, it looked near enough confirmed this time as they had such a large goal difference as well. During the week though Sheffield United star striker and player Ched Evans was in court for the R v Evans and McDonald criminal prosecution case. Ched Evans on the Friday was found guilty of rape and was sentenced to five years in jail, meaning Sheffield United were without their best player of the season, who had led them to victory in so many games and scored over thirty goals throughout the season. However, with Sheffield United in such good form, there was still little doubts about the outcome of the season. The next day Sheffield Wednesday faced Carlisle United who were fighting for a play-off spot and was a must win game for them as well. While Sheffield United were away to in-form Milton Keynes Dons who lay in fifth place. Chris Lines's right-footed shot rolled into the bottom corner in the twenty-sixth minute of the match to put Sheffield Wednesday 1 goal up. Sheffield United however had conceded in their game to make things as they stood Wednesday one point behind their city rivals with two games to go. As Sheffield United were still trailing, Wednesday were cruelly punished for not finishing their chances within the game as James Berrett equalised to send Carlisle United into jubilation. As the Sheffield United game had finished Wednesday still had several minutes of stoppage time to play. And their deserved goal came as Michail Antonio who had injured his right foot and right shoulder during the game, continued to play and dribbled round one player and finished in a tight corner to send the Sheffield Wednesday fans absolutely crazy as Antonio's winning goal came in the ninety-fifth minute of the game. This goal still gave Wednesday a chance as they were now one point behind Sheffield United thanks to that late, late goal. With both Sheffield clubs playing teams who were likely to be relegated by the last game of the season, the second-to-last games of the season were seen to most as the decider in the automatic promotion race. It was Sheffield Wednesday who kicked off first at three o'clock on the Saturday of the last weekend of April. They faced another difficult challenge as Brentford who they were playing away, were desperate for maximum points as they looked to get into the final play-off place. In the first-half it was Brentford who were the better side as they missed one 'sitter' and hit the bar from four-yards out and should have been in front. However, a free-kick saw Keith Treacy pick out the bottom corner as the goalkeeper was not covering his near post and was caught unaware of that possibility. Wednesday went into the break ahead, although they had scored against the run of play. The second half was similar to the first but Wednesday were playing better, but Brentford still had the better of the play. And then in the sixty-second minute Mark Beevers conceded a penalty and was lucky not to be sent off after already having a yellow card. Clayton Donaldson scored and Sheffield Wednesday still being on the back foot, were looking unlikely to win even though they so desperately had to. Then up-jumped Miguel Llera to head the ball up into the net four minutes later to put Wednesday back in front. After several misses from Brentford, a one-on-one and a great save from Stephen Bywater, Sheffield Wednesday went home with a 2–1 win. Sheffield United had a late kick-off and was live on Sky Sports and was being viewed by all supporters of both rival clubs. They played Stevenage who were in an incredible run of form going into the game, as they pushed for the final play-off place themselves. Although, Sheffield United started brightly they were unable to convert any chances and was missing their star player Ched Evans. And then joy for Stevenage and Sheffield Wednesday fans alike as Joel Byrom scored and put Stevenage one nil up at half-time. Two minutes into the second half and Stevenage scored again, sending The Owls and Stevenage wild again. Sheffield United had to win to stay above Sheffield Wednesday and pulled a goal back and then Matthew Lowton equalised to make it 2–2 with five minutes to go plus stoppage time. It was the most tense and heart-racing moments of both Sheffield United and Sheffield Wednesday as they knew one goal for The Blades in those final moments could be the decisive goal in the automatic promotion race. A fabulous save from Chris Day in the final minutes was able to stop Sheffield United and they could only manage to draw. Meaning Sheffield Wednesday after such an amazing season, for fans of both clubs and the neutral, were now second and in the driving seat for automatic promotion."]}]}}