{"wiki_id": "http://www.wikidata.org/entity/Q612632", "itemLabel": "William Denis Battershill", "itemDescription": "British military personnel (1896-1959)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Denis_Battershill", "wikipedia_page": {"main": "Sir William Denis Battershill KCMG (29 June 1896 – 11 August 1959) was a British colonial administrator. He was Governor of Cyprus from 1939 to 1941 and Governor of Tanganyika from 1945 to 1949. He was largely known for taking land that had previously been set aside for German settlers during the era of German East Africa and redistributing it to indigenous Africans. He also sought to increase the role of Africans in government by increasing African participation in voting and by replacing European officials with African officials. Battershill also saw to it that it was illegal to pay Africans less than Europeans or Asians for doing the same work in Tanganyika. In the early 1950s he was given a tour of French Algeria, French Guinea and French Indochina. In all of those territories he said that based on the way France was governing he felt the French were \"driving those territories into the arms of communism.\" He also briefly visited Britain's Sierra Leone Colony and Protectorate as well as Bermuda, the Cayman Islands and Anguilla, which he favorably compared to France's colonies. He was of the opinion that Britain's African colonies \"can and should govern themselves independently\" and that he hoped they would have a positive relationship with Britain once they did, however he warned that the French were alienating people in the three French colonies of French Algeria, French Guinea and French Indochina and the end result of that would be those countries \"both separating from France, and also having an acrimonious relationship with her once they do.\"\n\n", "link_mentions": [{"page": "List of colonial governors and administrators of British Cyprus", "response": ["|William Denis Battershill(1896–1959) || 60px || 4 July 1939 || 3 October 1941"]}, {"page": "High Commissioners for Palestine and Transjordan", "response": ["| 70px || William Denis Battershill(acting for multiple periods) || 21 June 1937 || 3 March 1938"]}, {"page": "List of governors of Tanganyika", "response": ["|28 April 1945 to 11 December 1946|| ||Sir William Denis Battershill, Governor||", "|11 December 1946 to 18 June 1949|| ||Sir William Denis Battershill, Governor||"]}, {"page": "1941 New Year Honours", "response": ["*William Denis Battershill, Esq., C.M.G., Governor and Commander-in-Chief, Cyprus."]}, {"page": "William Battershill", "response": ["#REDIRECT William Denis Battershill"]}]}}