{"wiki_id": "http://www.wikidata.org/entity/Q6129276", "itemLabel": "James Baker Pyne", "itemDescription": "artist (1800-1870)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Baker_Pyne", "wikipedia_page": {"main": "James Baker Pyne (5 December 1800 – 29 July 1870) was an English landscape painter who became a successful follower of Turner, after having been in his earlier years a member of the Bristol School of artists and a follower of Francis Danby.", "link_mentions": [{"page": "Wolverhampton Art Gallery", "response": ["The display in the two Victorian rooms present British 19th-century art in its relation with wider world. It includes landscapes by Henry Mark Anthony, David Cox, James Baker Pyne, David Roberts, narrative paintings by the Cranbrook Colony artists, religious paintings by Pre-Raphaelite artist Frederic Shields, japanned ware by local manufacturers which were shown at The Great Exhibition, examples of local Myatt pottery, and Eastern objects - Chinese ceramics and mirror paintings, Japanese woodblock prints, Indian pottery and weapons, Persian metalware - collected by local people."]}, {"page": "William James Müller", "response": ["Müller was born at Bristol, the son of J. S. Müller, a Prussian from Danzig, curator of a museum in Bristol. He first studied painting under James Baker Pyne. His early pictures were mostly of the scenery of Gloucestershire and Wales, and he learned much from his study of Claude, Ruysdael, and earlier landscape-painters. He witnessed the 1831 Bristol riots and recorded some of the scenes in a series of \"raw and brilliant oil and watercolour sketches\". In 1833 he exhibited at the Royal Academy for the first time, showing   Destruction of Old London Bridge-Morning. The next year he made a tour through France, Switzerland and Italy."]}, {"page": "Royal West of England Academy", "response": ["At first, the core of the Academy was a well-known group of artists in Bristol, known as the Bristol Society of Artists, who were mostly landscape painters, and many, such as William James Müller, Francis Danby, James Baker Pyne and John Syer were well known. In 1844, when the Bristol Academy for the Promotion of Fine Arts was founded, the Bristol Society of Artists was incorporated into it. At this time the president and committee was predominantly its patrons, rather than its artists. In 1913 King George V granted the academy its Royal title, with the reigning monarch as its Patron, and by 1914 a major extension to the front of the building, including the dome and Walter Crane lunettes, was completed."]}, {"page": "Museo Poldi Pezzoli", "response": ["Painters in the collection include: Breughel the younger; Cranach; Goltzius; James Baker Pyne; Thomas Shotter Boys; Sutterman; Teniers the younger;  Jacob Toorenvliet; Pierre Tetar van Elven; Mathijs Van Hellemont; Jan Van der Meer II; Willem Van Mieris; Jacob Ferdinand Voet; Nicolaus Alexander Mair Von Landshut, (Mair Landshut); and Cornelis de Wael."]}, {"page": "George Arthur Fripp", "response": ["Fripp was born in Bristol, and educated in Bristol, Birmingham and Leamington. He had lessons in oil painting from James Baker Pyne and first exhibited at the Bristol Society of Artists in 1832. In 1834 he accompanied the Bristol artist William James Müller on a sketching tour of Europe, which produced works he later exhibited at the Royal Academy from 1838."]}, {"page": "Bristol School", "response": ["The school initially formed around Edward Bird some years before his death in 1819. Having arrived in Bristol from Ireland in 1813, Francis Danby was a participant from around 1818–19 and remained connected to the group for around a decade, although he left Bristol for London in 1824. Other artists involved were Edward Villiers Rippingille, Samuel Jackson, James Johnson, Nathan Cooper Branwhite, William West, James Baker Pyne, George Arthur Fripp and Paul Falconer Poole.", "Around 1832–33 a new series of sketching meetings was started. This initially included William James Müller, Thomas Leeson Scrase Rowbotham, John Skinner Prout and Robert Tucker, according to Tucker's own account. The meetings later grew to include more artists, although relatively few surviving drawings have been identified, compared to the meetings of the 1820s, and by the 1830s the works of the Bristol School were less original. Other participants in the meetings probably included Samuel Jackson, Stephen C. Jones, James Baker Pyne, Henry Brittan Willis, W. Williams, Joseph Walter, George Arthur Fripp, Edmund Gustavus Müller, and William Evans. These sketching meetings may have lasted into the 1840s."]}, {"page": "Edward Villiers Rippingille", "response": ["In 1830 Rippingille left Bristol and travelled to France and Germany. He returned to London where he married in 1832, before travelling to France again, in the company of James Baker Pyne. In 1835, returning to London, he held his own exhibition at Regent Street. From 1837 he conducted trips to Italy and concentrated on Italian subjects. He died on 22 April 1859 at Swan Village railway station in the West Midlands."]}, {"page": "J. B. Pyne", "response": ["#REDIRECT James Baker Pyne"]}, {"page": "Pyne", "response": ["*James Baker Pyne"]}, {"page": "James Dafforne", "response": ["|James Baker Pyne"]}, {"page": "James Astbury Hammersley", "response": ["Hammersley was born at Burslem, Staffordshire, and studied art under James Baker Pyne. During the 1840s he taught at the Nottingham School of Design, where his pupils included Henry Hunter and Andrew MacCallum."]}, {"page": "Thomas Ashburton Picken", "response": ["*  (Lithographs after James Baker Pyne)."]}]}}