{"wiki_id": "http://www.wikidata.org/entity/Q6139528", "itemLabel": "James McNally", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/James_McNally_(musician)", "wikipedia_page": {"main": "James McNally is a British musician, composer and producer of the band Afro Celt Sound System. He was previously a member of the Pogues and Storm (with Tom McManamon).He released a solo album, Everybreath, in 2008, which included covers of U2's \"I Still Haven't Found What I'm Looking For\" and The Police's \"Every Breath You Take\".", "link_mentions": [{"page": "Afro Celt Sound System", "response": ["On 20 May 2014, Afro Celt Sound System announced the release of the album Born. In January 2016, a posting to that website revealed that due to a dispute with Emmerson, who announced his departure from the band in 2015, there were two active versions of the band, a version led by Emmerson and a separate line-up headed by James McNally and Martin Russell. Emmerson's version of the band released the album The Source in 2016.  The dispute ended on 21 December 2016, with an announcement on social media.", "\"Prior to that first album being made, none of us knew if it would work,\" musician James McNally told Larry Katz of the Boston Herald. \"We were strangers who didn't even speak the same language. But we were bowled over by this communication that took place beyond language.\" McNally, who grew up second-generation Irish in London, played whistles, keyboards, piano, bodhran, and bamboo flute.", "During 2015, the band had split into two formations, one of them including Simon Emmerson, N'Faly Kouyate and Johnny Kalsi, the other one James McNally and Martin Russell. The split was announced on the band's website in January 2016. The dispute officially ended with an announcement on social media on 21 December 2016. ", "*James McNally"]}, {"page": "The Pogues", "response": ["The band was at the peak of its commercial success, with both albums making the top 5 in the UK (numbers 3 and 5 respectively), but MacGowan was increasingly unreliable. He failed to turn up for the opening dates of their 1988 tour of America, and prevented the band from promoting their 1990 album Hell's Ditch, so in 1991 the band sacked him. Vocal duties were for a time handled by Joe Strummer. Spider Stacy took over permanently after Strummer left in the winter of 1991. After Strummer's departure, the remaining seven Pogues recorded in 1993 Waiting for Herb, which contained the band's third and final top twenty single, \"Tuesday Morning\", which became their best-selling single internationally. Terry Woods and James Fearnley then left the band and were replaced by David Coulter and James McNally respectively. Within months of their departures, ill health forced Phil Chevron to leave the band; he was replaced by his former guitar technician, Jamie Clarke. This line-up recorded the band's seventh and final studio album, Pogue Mahone. The album was a commercial failure, and, following Jem Finer's decision to leave the band in 1996, the remaining members decided it was time to call it quits. According to Shane MacGowan, among the reasons of the break-up was disagreement concerning the political orientation of his songs, the band not wanting to sing too obvious pro-Republican songsInterview  from The Irish World, 21 November 1997, Tonya Henderson. – though some of their previous songs were already politically engaged: for instance, Streams of Whiskey is about the poet and IRA member Brendan Behan. Soon after the break-up Shane MacGowan recorded a song titled Paddy Public Enemy Number One as a tribute to the Republican leader Dominic McGlinchey, a former leader of the INLA killed a few years before.", "* James McNally – accordion, whistles, percussion (1993–1996)", "  bar:mcnally text:\"James McNally\""]}, {"page": "Medusa (Annie Lennox album)", "response": ["* James McNally – accordion"]}, {"page": "Why the Long Face (album)", "response": ["*James McNally - low whistle on \"God's Great Mistake\""]}, {"page": "Roland MC-505", "response": ["* James McNally (Afro Celts)"]}, {"page": "OVO", "response": ["* James McNally – bodhran (1, 4, 5), whistle (4, 5), piano accordion"]}, {"page": "James McNally", "response": ["James McNally or Jim McNally may refer to:", "* James McNally (American football), American football player and coach", "* James McNally (musician), British musician, composer and producer of the band Afro Celt Sound System", "* James Wilson (Irish nationalist) (1836–1921; born James McNally), Fenian who was transported as a convict to Western Australia"]}, {"page": "Volume 1: Sound Magic", "response": ["* James McNally – accordion, bodhran"]}, {"page": "Volume 2: Release", "response": ["* James McNally – keyboard, whistle, low whistle, bodhran, accordion, additional production"]}, {"page": "Volume 3: Further in Time", "response": ["The album features N'Faly Kouyate in a more prominent role as a main contributor, a deliberate choice, as James McNally explained: \"We felt the last album's African element wasn't as strong as it could have been. N'Faly had become a new member, and that was his first album. This time, he's much closer to the way we work and brought much more to the table than we could have ever imagined.\"", "* James McNally – high and low whistles, accordion, harmonium, piano, keyboards, bodhran, drum & keyboard programming"]}, {"page": "Pod (Afro Celt Sound System album)", "response": ["# \"Rise Above\" (remix by Simon Emmerson, James McNally and Simon ‘Mass’ Massey) – 6:17"]}, {"page": "Marxman", "response": ["Although once touted as the Anglo-Irish answer to Public Enemy, the group themselves played down such comparisons. Their politics was at the fore and breaking down musical boundaries was paramount.  The band were very well respected live and it was onstage that the power of their music really came across. Despite working with a number of high-profile musicians, collaborating with James McNally of The Pogues and having Sinéad O'Connor as guest vocalist on the single \"Ship Ahoy\" the band were very much a rap group and their track \"Drifting\" was produced in New York by Hip Hop legend DJ Premier of Gang Starr. The band also worked with SD50, Dante Ross' production team and Mike Mangini and Shane Faber (Brand Nubian, Digable Planets and many more) were producers on the Time Capsule Album. They also supported U2 and Depeche Mode on their respective Zoo TV and Devotional tours. Marxman toured extensively around Europe as well as the USA and played many events and fundraisers for the various causes they believed in. A percentage of their single \"All About Eve\" was donated to Victim Support charities and they played a sold out gig at London's Jazz Cafe in support of that single and cause. They are considered to have been forerunners of the trip hop genre alongside bands such as Massive Attack and Portishead, and contributed to the establishment of the \"Bristol sound\"."]}, {"page": "When You Say Nothing at All", "response": ["* James McNally – whistle, accordion"]}, {"page": "Pogue Mahone", "response": ["# \"Living in a World Without Her\" (Darryl Hunt, James McNally) – 3:20", "* James McNally - accordion, whistle, low whistle, piano, Uilleann pipes"]}]}}