{"wiki_id": "http://www.wikidata.org/entity/Q6131950", "itemLabel": "James Cropper", "itemDescription": "English businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Cropper_(businessman)", "wikipedia_page": {"main": "Sir James Anthony Cropper KCVO (born 22 December 1938) is the former Lord-Lieutenant of Cumbria and Honorary President of James Cropper plc, speciality paper makers, of Burneside, a business founded by his great-great grandfather James Cropper in 1845.\nHe was educated at Eton College and Magdalene College, Cambridge (BA, 1962).He served as High Sheriff of Westmorland for 1971. He was appointed Knight Commander of the Royal Victorian Order (KCVO) in the 2011 New Years Honours List.\n\n", "link_mentions": [{"page": "Burneside", "response": ["Burneside's economy is based upon the paper mill James Cropper plc, founded in 1845 by James Cropper. Originally, most villagers worked in the factory. Until the year 2000 James Cropper (a descendant of the original James Cropper) owned a large proportion of the village; it was then sold to housing agencies."]}, {"page": "James Cropper", "response": ["James Cropper may refer to:", "*James Cropper (abolitionist) (1773–1840), English businessman in Liverpool and philanthropist", "*James Cropper (politician) (1823–1900), British politician", "*James Cropper (priest) (1862–1938), British Anglican clergyman", "*Sir James Cropper (businessman) (born 1938), British paper manufacturer and Lord-Lieutenant of Cumbria", "*James Cropper plc, English papermaking company"]}, {"page": "Cambridge University Wine Society", "response": ["* James Cropper, businessman"]}, {"page": "2011 New Year Honours", "response": ["* James Cropper, Her Majesty's Lord-Lieutenant of Cumbria"]}, {"page": "James Anthony Cropper", "response": ["#REDIRECT James Cropper (businessman)"]}, {"page": "Cropper (surname)", "response": ["*James Cropper (abolitionist) (1773–1840), English businessman, philanthropist, and abolitionist", "*James Cropper (politician) (1823–1900), English Liberal politician and papermaker.great-great-grandfather of James (businessman)", "*James Cropper (priest) (died 1938), Anglican priest", "*James Cropper (businessman) (born 1938), English businessman, great-great-grandson of James (politician)"]}, {"page": "Cumbria County History Trust", "response": ["* Sir James Cropper KCVO"]}, {"page": "Burneside Paper Mills Tramway", "response": ["The Burneside Tramway was initially a narrow gauge and later a standard gauge industrial railway serving the James Cropper paper mills around Burneside, Cumbria.", "The tramway was built in 1879-80 as a  line to connect the paper mills run by James Cropper and Co in Burneside and Cowan Head. Wagons were hauled by horse power."]}, {"page": "Newton Rigg College", "response": ["The Cumberland and Westmorland Farm School was founded in 1896 by Henry Charles Howard, of Greystoke Castle, MP for Penrith. Local business leaders involved in the committee which led to its foundation included builder George Henry Pattinson JP, OBE, engineer Gilbert Gilkes and paper-maker James Cropper. Newton Rigg farm, between Newton Reigny and Penrith, was bought to be the school's premises. Initially the school offered dairying courses for girls in summer, and farming courses for boys in the winter when they had less farm work and could be spared."]}, {"page": "James Cropper plc", "response": ["James Cropper plc is an English papermaking company based in Burneside, Kendal, Cumbria, England. The company was founded in 1845 by James Cropper (1823-1900), whose great-great-grandson James Cropper is the Honorary President of the company.", "The company have been at the same site at Burneside since 1845. There were earlier mills on the same site including a sickle mill and a fulling mill which were bought in 1750 by John Wakefield who built a woollen mill on the site in 1760 and converted the sickle mill for cotton 1770. In 1828 the mill was leased to Hudson and Forster who installed second-hand papermaking machines, and in 1845 James Cropper rented the premises.", "A historian was commissioned to write a history of the company but failed to deliver, at which point the current chairman Mark Cropper (great-x-3-grandson of the founder) stepped in to write The leaves we write on : James Cropper, a history in paper making (Ellergreen, 2004: )."]}]}}