{"wiki_id": "http://www.wikidata.org/entity/Q6131820", "itemLabel": "James Cowan", "itemDescription": "Australian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Cowan_(South_Australian_politician)", "wikipedia_page": {"main": "James Cowan (21 April 1848 – 21 July 1890), flour miller and investor, had been a member of the South Australian House of Assembly for the Yatala for only 2 months when he was killed in an accident at a railway crossing. Cowan was an early investor in Broken Hill Proprietary Company Ltd. The property associated with Erindale, Cowan's residence at Burnside, was sub-divided after his death into a new suburb which was also named Erindale.", "link_mentions": [{"page": "James Cowan", "response": ["James Cowan may refer to:", "*James Cowan (author) (1942–2018), Australian author ", "*James Cowan (bishop) (born 1952), Anglican Bishop of Columbia from 2004 to 2013", "*James Cowan (British Army officer), Major General in the British Army", "*James Cowan (footballer) (1868–1918), Aston Villa footballer of the 19th century", "*James Cowan (Manitoba physician) (1831–1910), Manitoba physician and politician from the 19th century", "*James Cowan (Manitoba politician) (1914–1997), Manitoba politician from the 20th century", "*James Cowan (New Zealand writer) (1870–1943), New Zealand writer of the  20th century ", "*James Cowan (Ontario politician) (1803–1900), politician in Canada West", "*James Cowan (Scottish politician) (1816–1895), Liberal Member of Parliament for Edinburgh 1874–1882", "*James Cowan (South Australian politician) (1848–1890), South Australian politician", "*James Cowan, fl. 1879, Australian public servant, husband of Edith Cowan", "*James Cowan (sport shooter) (1856–1943), British Olympic shooter", "*James Cowan (cricketer) (born 1989), English cricketer"]}, {"page": "Erindale, South Australia", "response": ["The suburb came into existence in 1912 by the sub-division of a property formerly belonging to the estate of James Cowan.  Cowan had purchased the property in 1889 from John Stuart Sanders and renamed it Erindale after his place of birth. Warburton; Elizabeth, (1981), The Paddocks Beneath: a history of Burnside from the beginning, The Corporation of the City of Burnside, South Australia, pages 16 and 17. ()"]}, {"page": "Angle Park, South Australia", "response": ["Angle Park was original a subdivision of sections 401 and 402 of the Hundred of Yatala. It was divided into 16  allotments by Henry Cowan (son of James Cowan) in the 1920s."]}, {"page": "Essington Lewis", "response": ["In 1910, he married Gladys Rosalind Cowan, OBE, the only daughter of James Cowan. Their family consisted of five children – sons James Essington Lewis and Robert Brook Lewis OAM, and daughters Helen Clarke, Mary Munckton OAM and Jane Nevile.  His sons were educated at Geelong Grammar School and the daughters at the Clyde School. Two children died in infancy - David and Janet. The family lived in Malvern, Victoria and owned a country property named \"Landscape\" near Tallarook in central Victoria.  Robert Brook (1918–2009) is notable as being the Master of St Mark's College, University of Adelaide from 1957 to 1968 and the Master of Menzies College, La Trobe University from 1968 to 1970.SLSA, 2012, page 3.'Births, marriages and deaths', The Register, Thursday 21 April 1910, page 6, , retrieved 18 September 2012.'Death of Mrs Essington Lewis', The Advertiser, 7 July 1954, page 2, , retrieved 25 September 2012.SLSA, 2012, page 4."]}, {"page": "Richard Butler (Australian politician)", "response": ["Butler attempted to enter parliament early in 1890 when he stood for Yatala but was defeated. A few months later he won the seat at a by-election caused by the death of one of the seat's sitting members, James Cowan. On 13 April 1898 he succeeded Cockburn as minister of agriculture in the Kingston ministry which resigned in December 1899. Yatala was abolished in 1902 and Butler represented Barossa from 3 May 1902 to 4 April 1924."]}, {"page": "Political families of Australia", "response": ["*James Cowan (1848–1890), Member for the South Australian House of Assembly (MHA) Electoral district of Yatala 1890"]}, {"page": "James Cowan (author)", "response": ["James Cowan (9 April 1942 – 6 October 2018) was an Australian author.  He was the author of a number of internationally acclaimed books, including A Troubadour's Testament and Letters from A Wild State.  In 1998 he was awarded the prestigious Australian Literature Society's Gold Medal for his novel, A Mapmaker's Dream.'ALS Gold Medal', , retrieved 23 September 2012. His work has been translated into seventeen languages.", "James Cowan then began a ten-year study of the Aboriginal culture that led him to work, study, and finally live among Aborigines in the Center, the Far North and the Kimberly region.  This resulted in a series of books that explored Aboriginal themes: Mysteries of the Dreaming, Myths of Dreaming, Sacred Places, The Aboriginal Tradition, Two Men Dreaming and finally Messengers of the Gods all found their inspiration in traditional cultural perspectives that the author encountered during his journeys.", "In 2000, James Cowan returned to Australia after spending three years in Italy where he researched and wrote Francis: A Saints Way. This book became the inspiration for a new ballet devised by the Queensland Ballet Co. and performed in 2002. His latest book is Journey to the Inner Mountain, a study of St Antony of Egypt in the 3rd century, and  A Spanner in the Works, a study of the impact of science and technology on contemporary spiritual life.", "James Cowan was the recipient of an honorary doctorate of Humane Letters from Grand Valley State University in Michigan for his life's work. He has lectured throughout the world on themes related to his deep knowledge of traditional peoples, Aboriginal art, metaphysics, and literature.", "*James Cowan Author official webpage", "*'An Interview with James Cowan, Australian Novelist and poet, about his new book on St. Anthony', retrieved 21 September 2012."]}, {"page": "List of South Australian House of Assembly by-elections", "response": ["|James Cowan"]}, {"page": "Cowan (surname)", "response": ["* James Cowan (author), Australian author", "* James Cowan (British Army officer) MAjor General British Army", "* James Cowan (South Australian politician)", "*James Cowan (disambiguation)"]}, {"page": "Political families of South Australia", "response": ["*James Cowan (1848–1890) (brother of Thomas) MHA for Yatala 1890"]}, {"page": "Railway accidents in South Australia", "response": ["On 21 July 1890, James Cowan, a member of the South Australian Parliament, and his fellow passenger, Mark Bullimore, the local branch manager of the General Electric Supply Company of Australia, were both killed when a train collided with Cowan’s horse-drawn buggy at the intersection of Grand Junction Road and the main railway line running north from Adelaide in the suburb of Dry Creek."]}, {"page": "Thomas Cowan (South Australian politician)", "response": ["Cowan considered re-standing for the Electoral district of Yalata when a vacancy was created in July 1890 by the death of James Cowan, his younger brother who was the one of the two current sitting members.  Cowan nominated but later stood down for medical reasons.  The vacancy was subsequently filled by Richard Butler who had unsuccessfully stood for the seat earlier in 1890.'Election for Yatala', South Australian Register (Adelaide, SA : 1839 - 1900), Tuesday 5 August 1890, page 6, , retrieved 26/08/2012.'Election for Yatala', South Australian Register (Adelaide, SA), Thursday 14 August 1890, page 7, , retrieved 26/08/2012."]}, {"page": "James Cowan (1848-90)", "response": ["#REDIRECT James Cowan (South Australian politician)"]}, {"page": "Electoral district of Yatala", "response": ["| James Cowan "]}, {"page": "Crown Point Station", "response": ["The owner of the property in 1890 was James Cowan who, along with another man named Bullimore, was killed in a railway accident the same year. The property occupied an area of  and was stocked with approximately 7.000 head of cattle and was being managed by Mr Ross. Drought struck the area in 1892 but this was followed by successive good seasons from 1893 to 1897. By 1910 the owner of the property was Horace Cowan and it was being managed by Richard Taylor."]}, {"page": "North Adelaide Grammar School", "response": ["*James Cowan flour miller and politician"]}, {"page": "Members of the South Australian House of Assembly, 1890–1893", "response": ["|| James Cowan  ||  || Yatala || 1890", ": Yatala MHA James Cowan was killed in an accident on 21 July 1890, only two months after his election. Richard Butler won the resulting by-election on 13 August."]}, {"page": "Samuel Dening Glyde", "response": ["Glyde moved to South Australia in mid-1871 and found employment with his brother's firm Morgan, Connor, & Glyde, wheat merchants, later becoming a partner. In 1882 they joined a consortium, the Adelaide Milling Company, with John Hart & Co., W. Duffield & Co., James Cowan & Co., and Harrold Brothers. This was the largest company registered in South Australia up to that time."]}, {"page": "Hugh Craine Kelly", "response": ["He was elected to the seat of Wooroora in the South Australian House of Assembly and served from April 1890 until the following January, when he died as a result of being thrown from a buggy near Port Wakefield. James Cowan and J. G. Ramsay met similar deaths. One critic praised him for his clear and melodious voice, his matter-of-fact clarity of expression, steadfastness of purpose and imperviousness to flattery."]}, {"page": "Darcy Rivers Warren Cowan", "response": ["The sixth of seven sons of James Cowan and Sarah Ann (née Warren) and brother of Gladys Rosalind Lewis."]}]}}