{"wiki_id": "http://www.wikidata.org/entity/Q6133819", "itemLabel": "James Fellowes", "itemDescription": "cricketer (1841-1916)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Fellowes_(cricketer)", "wikipedia_page": {"main": "Colonel James Fellowes  (21 August 1841 – 3 May 1916) was an English soldier and amateur cricketer. Fellowes served in the Royal Engineers and played first-class cricket for Kent County Cricket Club and Hampshire County Cricket Club. He was a right-handed who bowled right-arm fast roundarm.", "link_mentions": [{"page": "Fellows (surname)", "response": ["* James Fellowes (cricketer) (1841–1916), English cricketer", "* James Fellowes (lord lieutenant) (1849–1935), English lord lieutenant", "* James Fellowes (physician) (1771–1857), English physician"]}, {"page": "County Ground, Southampton", "response": ["Early Hampshire cricket teams had played first-class cricket in Southampton since 1842 at the Antelope Ground, under the supervision of Daniel Day. Following building speculation, the county team moved across the River Itchen to Day's Antelope Ground, although the building proposal fell through and so Hampshire returned across the river to the Antelope Ground. Hampshire County Cricket Club, formed in September 1863, became tenants. In 1883, James Fellowes began negotiations for the lease and development of  land in Northlands Road which formed part of the Hulse estate. With an agreement reached between Hampshire County Cricket Club and the estate, Hampshire played their final match at the Antelope Ground in August 1884 and moved to Northlands Road for the 1885 season."]}, {"page": "Antelope Ground", "response": ["In 1883, Col. James Fellowes opened negotiations for the lease and development of land in Northlands Road, Southampton (part of the Hulse Estate) and by the Annual General Meeting of Hampshire County Cricket Club, held at the George Hotel, Winchester in January 1884, Col. Fellowes was able to report that  of land had been leased at an annual rent of £160 on condition that the club erected a pavilion. The new lease was to run for 28 years. The first match played at the new County Ground was on 9 May 1885."]}, {"page": "Coote Hedley", "response": ["Hedley married Anna Susan Fellowes in 1894 at Gibraltar Cathedral. Her father, James Fellowes, was a Colonel in the Royal Engineers who had worked at the Ordnance Survey and played for Kent County Cricket Club in the 1870s. The couple had three daughters: Rosalind who married Henry Frank Heywood, Kathleen and Christian Elizabeth Ann who married Cecil De Sauzmerez, of Sausmarez Manor in Guernsey."]}, {"page": "James Fellowes", "response": ["James Fellowes may refer to:", "* James Fellowes (artist), 18th-century portrait painter", "* James Fellowes (cricketer) (1841–1916), English engineer and amateur cricketer", "* James Fellowes (lord lieutenant) (1849–1935), English lord lieutenant", "* Sir James Fellowes (physician) (1771–1857), English physician"]}, {"page": "1887–88 St. Mary's Y.M.A. season", "response": ["The most significant new arrival was George Carter: Carter was employed as an engraver by the Ordnance Survey and in 1887 he was posted to their offices in Southampton. Speaking in 1999, Carter's daughter-in-law, Nellie Carter, said that Carter was \"not at all happy\" about being posted to Southampton and that Carter maintained that the move was arranged by Dr. Russell Bencraft who was medical officer at the Ordnance Survey and was later to become the president of Southampton St. Mary's F.C. As secretary of the Hampshire County Cricket Club, Bencraft was also a colleague of Col. James Fellowes, who was an assistant to the Director-General of the Ordnance Survey. It would seem, therefore, that Carter was transferred to Southampton as a quasi-professional footballer."]}, {"page": "Harry Thornber", "response": ["Thornber played his club cricket for Manchester and Sale, before making his appearance in first-class cricket for Lancashire in 1874 against Kent at Maidstone. He opened the batting alongside Dick Barlow in Lancashire's first-innings, but was dismissed for a duck by James Fellowes, while in their second-innings he batted lower in the order, but was again dismissed for a duck, this time run out. He was described as a steady middle order batsman with a sound defence."]}, {"page": "List of Marylebone Cricket Club players (1864–1894)", "response": ["* James Fellowes (1870) : J. Fellowes ()"]}, {"page": "St John the Evangelist Church, Hale, Surrey", "response": ["* James Fellowes (cricketer) played first class cricket for Kent County Cricket Club and Hampshire County Cricket Club.James Fellowes, CricInfo. Retrieved 2019-08-04."]}]}}