{"wiki_id": "http://www.wikidata.org/entity/Q6134671", "itemLabel": "James Glass Bertram", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Glass_Bertram", "wikipedia_page": {"main": "James Glass Bertram (1824 – 3 March 1892) was a Scottish author.\nHe was apprenticed to Tait's Edinburgh Magazine and became managing clerk, before joining a company of strolling players.  He returned to Edinburgh and set up as a bookseller and newsagent. In 1855 he was appointed the editor of the North Briton and in 1872 of the Glasgow News, leaving to become a freelance journalist two years later.\nBertram's output included pornography on the theme of flagellation, such as Flagellation and the Flagellants: A History of the Rod published in 1868 under the pseudonym of \"Revd William Cooper\" and Personal Recollections of the Use of the Rod as \"Margaret Anson\", published by John Camden Hotten.He also wrote works on sport under the pseudonym Ellangowan (named after a location in Walter Scott's novel Guy Mannering), notably Sporting anecdotes: being anecdotal annals, descriptions, tales and incidents of horse-racing, betting, card-playing, pugilism, gambling, cock-fighting, pedestrianism, fox-hunting, angling, shooting, and other sports, collected and edited by him and published in London, 1889.", "link_mentions": [{"page": "Sadism and masochism in fiction", "response": ["*Personal Recollections of the Use of the Rod (1868) by \"Margaret Anson\", pseudonym of British author James Glass Bertram (John Camden Hotten: York, date given as 1857).  As is common in this genre, the author/narrator is given as female, and the perpetrators and victims are mainly women.  Reprinted by Blue Moon Books in 2000; also published as The Merry Order of St. Bridget. Translated in French as Une société de flagellantes. Réminiscences et révélations d'une soubrette de grande maison (1901) by Jean de Villiot, illustrated by Martin van Maële.", "* Flagellation & the Flagellants: A History of the Rod (1868) by \"Rev. William Cooper\", again James Glass Bertram, a best-seller for Hotten."]}, {"page": "James Bertram", "response": ["*James Glass Bertram (1824–1892), Scottish author"]}, {"page": "Margaret Anson", "response": ["#REDIRECT James Glass Bertram"]}, {"page": "William M. Cooper", "response": ["#REDIRECT James Glass Bertram"]}, {"page": "Ellangowan", "response": ["*Ellangowan, a pseudonym of Scottish author James Glass Bertram (1824–1892)"]}, {"page": "Revd William Cooper", "response": ["#REDIRECT James Glass Bertram"]}]}}