{"wiki_id": "http://www.wikidata.org/entity/Q6134003", "itemLabel": "James Floyd", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Floyd_(actor)", "wikipedia_page": {"main": "James Krishna Floyd is a British actor. He is known for his roles in My Brother the Devil, Everywhere and Nowhere, and the TV series The Good Karma Hospital.\nIn 2013, Floyd was named as a Breakthrough Brit by the British Academy of Film and Television Arts, and won a British Independent Film Award for his role in My Brother the Devil.", "link_mentions": [{"page": "Freddie Mercury", "response": ["Mercury appeared as a supporting character in the BBC television drama Best Possible Taste: The Kenny Everett Story, first broadcast in October 2012. He was portrayed by actor James Floyd. He was played by actor John Blunt in The Freddie Mercury Story: Who Wants to Live Forever, first broadcast in the UK on Channel 5 in November 2016. Although the programme was criticised for focusing on Mercury's love life and sexuality, Blunt's performance and likeness to the singer did receive praise."]}, {"page": "Elyes Gabel", "response": ["He later appeared as the Dothraki \"Bloodrider\" Rakharo, loyal bodyguard of Daenerys Targaryen in the season-1 and beginning of season-2 of HBO fantasy series Game of Thrones. According to the showrunners David Benioff and D. B. Weiss, journey of his character in the show had to be cut short as he quit the show to pursue projects that put him more front and center. In 2011, he joined the cast of CIA procedural Fox pilot Exit Strategy, portraying transport expert Tarik Fayad alongside Ethan Hawke but the show was dropped after being considered for a midseason airing and later released as a TV movie (2015). In the same year, he appeared as Jaz in British coming of age drama film Everywhere and Nowhere alongside James Floyd and Adam Deacon. In 2012, he appeared as Troy Vargas in David Hubbard's CBS TV movie Widow Detective. In the same year, he appeared as Umar in two part episode titled \"And Then I Fell in Love\" of series-15 of British crime drama television series Silent Witness."]}, {"page": "Screen International", "response": ["* James Floyd"]}, {"page": "Compulsion (2009 film)", "response": ["Compulsion is an ITV television tragedy, produced by Size 9 Productions and broadcast on 4 May 2009. Inspired by the Jacobean tragedy The Changeling by Thomas Middleton and William Rowley, it follows a young female Cambridge graduate called Anjika Indrani (Parminder Nagra) and attempts by her father Satvick (Vincent Ebrahim) to force her into a marriage with Hardik (Sargon Yelda) despite her existing happy relationship with Alex (Ben Aldridge). It also stars Ray Winstone as Don Flowers, Satvick's chauffeur, and James Floyd as Jaiman.", "* James Floyd - Jaiman"]}, {"page": "Sally El Hosaini", "response": ["Her debut feature film My Brother the Devil won international awards, including at the 2013 Evening Standard Film Awards, 2012 Sundance Film Festival, 2012 Berlin International Film Festival and 2012 BFI London Film Festival Awards, amongst others. It stars Fady Elsayed, BIFA Award winning James Floyd and César Award nominated actor Saïd Taghmaoui. It was filmed on location in Hackney, London."]}, {"page": "Tormented (2009 British film)", "response": ["At school, Bradley threatens Nasser (James Floyd), the leader of the school's emo clique, about removing a website he had put up about Mullet. Justine drops her old friends Helena and Emily to hang out with the popular crowd. She finds a teddy bear (stolen from Mullet's grave) in her locker and, assuming it is from Alex, agrees to go on another date with him. Jason tells her that Mullet was in love with her and hands her his suicide note. In the school's recording studio, Mullet's ghost forces Nasser to listen to music at top volume through his headphones, rendering him permanently deaf.", "* James Floyd as Nasser", "On 5 January 2009, it was announced that Jon Wright would direct a 2009 British comedy horror and slasher film titled Tormented which would be released in cinemas on 22 May 2009 in the UK. Cavan Ash, Tracy Brimm, Arvind Ethan David and Kate Myers produced the film with the budget of £703,000 and Stephen Prentice wrote the film. It was announced that Alex Pettyfer, April Pearson, Dimitri Leonidas, Georgia King, Larissa Wilson, Calvin Dean, Tom Hopper, Tuppence Middleton, Mary Nighy, Olly Alexander, Sophie Wu, Hugh Mitchell, James Floyd, Peter Amory, Ruby Bentall and Geoff Bell would star in the movie. Warner Bros., Paramount Vantage, MPI Home Video and IFC Films acquired distribution rights to the film. Paul Hartnoll would compose the music for the movie. BBC Films, Pathé and Forward Films co-produced the film. The film was shot at: Bishop Vesey's Grammar School, Sutton Coldfield, West Midlands, England; Streetly School, Birmingham, West Midlands, England and Sutton Coldfield, West Midlands, England, on 20 January 2009."]}, {"page": "The Infidel (2010 film)", "response": ["* James Floyd as Gary Page"]}, {"page": "James Floyd", "response": ["James Floyd may refer to:", "* James Floyd (actor) (born 1987), British actor"]}, {"page": "Everywhere and Nowhere", "response": ["Everywhere and Nowhere is a 2011 coming of age British drama film focusing on the identity struggles of Ash (James Floyd) a young British Pakistani who is torn between the traditions of middle-class family life and his passion for DJing. The film comes from Kidulthood director Menhaj Huda.", "*James Floyd as Ash Khan", "However James Floyd got significant critical praise for his lead performance, including Screen International, The Guardian https://www.theguardian.com/film/2011/apr/14/first-sight-james-floyd and Time Out."]}, {"page": "List of British films of 2011", "response": ["|| Director: Menhaj Huda   Cast: James Floyd, Adam Deacon"]}, {"page": "List of British films of 2012", "response": ["|| Director: Sally El Hosaini   Cast: James Floyd, Fady Elsayed, Saïd Taghmaoui"]}, {"page": "My Brother the Devil", "response": ["It stars James Floyd, Fady Elsayed and Saïd Taghmaoui. It tells the story of two sons of Egyptian immigrants coming of age in east London. It was released in UK on 9 November 2012 and was in US cinemas from 22 March 2013. Further releases in Canada, Germany, Australia and New Zealand.", "Mo (Fady Elsayed) and Rashid \"Rash\" (James Floyd) are teenage brothers of Egyptian descent living with their parents in Hackney. Elder brother Rash is fiercely protective of Mo, giving him a TV when he does well and encouraging him to stay in school. However Mo begins to want to emulate Rash who works as a low level drug dealer, and is able to use money from his job to pay for small luxuries to make their lives more comfortable.", "*James Floyd as Rashid", "* Won BIFA for Best Newcomer - James Floyd at British Independent Film Awards", "* Won Best Actor - James Floyd at Milan Film Festival", "* Nominated Most Promising Newcomer - James Floyd at Evening Standard Film Awards"]}, {"page": "List of LGBT-related films of 2012", "response": ["| My Brother the Devil || Sally El Hosaini || United Kingdom || Drama || James Floyd, Fady Elsayed, Saïd Taghmaoui||"]}, {"page": "Falcón (TV series)", "response": ["*James Floyd as Rafa Falcón, nephew of Javier"]}, {"page": "British Independent Film Awards 2012", "response": ["*James Floyd - My Brother the Devil"]}, {"page": "Priyanka Bose", "response": ["Bose performed with David Arquette in the Hollywood movie The MisEducation of Bindu directed by Prarthana Mohan, produced by Edward Timpe, which the Duplass Brothers executive produced. She appeared in the 2018 film Mortal directed by André Øvredal which co-starred Nat Wolff. She appeared in Season 3 of The Good Karma Hospital starring alongside Amanda Redman, Sagar Radia, James Floyd, and Amrita Acharia."]}, {"page": "List of British films of 2016", "response": ["|| Director: Pete Travis  Cast: Riz Ahmed, James Floyd, Billie Piper, Cush Jumbo, Roshan Seth, Antonio Aakeel"]}, {"page": "Of Kings and Prophets", "response": ["* James Floyd as Ishbaal, the younger son of Saul and Ahinoam"]}, {"page": "City of Tiny Lights", "response": ["City of Tiny Lights is a 2016 British crime thriller film directed by Pete Travis and written by Patrick Neate, based on his own 2005 novel of the same name. It stars Riz Ahmed, Cush Jumbo, James Floyd, Billie Piper and Roshan Seth. Set in London, it tells the story of a private detective who investigates the disappearance of a Russian prostitute. The film had its world premiere in the Special Presentations section at the 2016 Toronto International Film Festival on 12 September 2016. It was released in the United Kingdom on 7 April 2017.", "On 21 April 2015, it was announced that Pete Travis would be directing a London-set crime film City of Tiny Lights based on the 2005 novel of same name by Patrick Neate, who also adapted the novel into the film. Riz Ahmed was attached to play the lead role of a British detective Tommy Akhtar, and Billie Piper to play Akhtar's long-lost love, Shelley, while the other cast would include James Floyd, Cush Jumbo and Roshan Seth. BBC Films and BFI developed the script and would finance the film in association with Lip Sync Productions, Fel UK and Ingenious Media. Ado Yoshizaki Cassuto and Rebecca O'Brien would be producing the film for NDF International and Sixteen Films. Protagonist Pictures would handle the international rights while Icon Film Distribution would release the film in the UK and Ireland."]}, {"page": "The Good Karma Hospital", "response": ["* James Floyd as Dr Gabriel Varma (Series 1–3)"]}, {"page": "British Independent Film Award for Breakthrough Performance", "response": ["| rowspan=\"5\" style=\"text-align:center;\"| 2012 || style=\"background:#B0C4DE\" | James Floyd"]}]}}