{"wiki_id": "http://www.wikidata.org/entity/Q6133451", "itemLabel": "James Elphinstone Roe", "itemDescription": "journalist, educational reformer", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Elphinstone_Roe", "wikipedia_page": {"main": "James Elphinstone Roe (c. 18 October 1818 – May 1897) was a convict transported to Western Australia. After serving his sentence he became one of the colony's ex-convict school teachers.  Through his agitation for education reform, he played an important role in \"shaping the education system and political policies in the colony\". He later distinguished himself as a journalist.\nJames Elphinstone Roe was born in Kirkby on Bain, Lincolnshire, and baptised there on 18 October 1818.  His father was Rev. Thomas Roe, the town's rector, and his mother was Catherine Sarah née Elphinstone. Nothing is known of his childhood, but in June 1836 he began studies at Worcester College, Oxford. During his university years he was a member of the Oxford Movement, an organisation that aimed to return the Church of England to its Catholic roots, and which later collapsed after one of its leaders renounced the Church of England and converted to Catholicism. Although Roe himself remained an Anglican throughout his life, he was often sympathetic to and supportive of Catholic causes, and had a number of Catholic friends.\nRoe graduated with a Bachelor of Arts in 1841, and is thought to have taken his holy orders shortly afterwards. In August 1843, he married Susannah Moore. They would have fourteen children, of which nine survived beyond childhood.\nIn 1861, James Roe was convicted in the Old Bailey of forging a money order. Apparently Roe had expected to be left money by an uncle, Edward Roe, but a cousin had induced the uncle to make a will in the cousin's favour only a week before the uncle's death. After the uncle's death, Roe had produced a money order for £6000 apparently made out to him from the uncle.  The cousin challenged the authenticity of the order, and Roe was charged with forgery. The prosecution's case mainly hinged upon evidence suggesting that the date stamp on the envelope in which the money order was claimed to have been sent had been faked.  Roe was found guilty and sentenced to ten years' penal labour.  According to Rica Erickson, his family always believed in his innocence.\n\nRoe was transported to what was then the British penal colony of Western Australia on board the York, arriving in December 1862.  He received his ticket of leave in August 1864, and took work as a privately employed schoolmaster at York.  Four months later his family arrived in Western Australia on board the Hastings.  Roe met his family at Fremantle and immediately escorted them back to York.  It is said that Roe's wife refused an offer of hospitality from Bishop Hale's wife Sabina at Fremantle, because the offer did not include her husband. During their time at York, the financial needs of the large family kept Roe and his wife separated. Susannah Roe found work teaching a class in the town, and James Roe worked at the Seven Mile Spring on the road to Guildford, probably also as a teacher. \nRoe was probably more highly qualified to teach than anyone else in the colony at the time, but his convict status, especially the fact that he had not yet received his conditional pardon, would normally have precluded him from being offered an official teaching position.  However Bishop Hale, who was also chairman of the Board of Education, sympathised with the family's plight, and in 1866 he tried to secure for Roe and his wife a joint appointment to a new school at Greenough. Unable to organise accommodation for Roe's large family, the Board of Education eventually appointed only James Roe to the position, but arranged for Susannah Roe to be offered a position at a private school in Geraldton.\nJames Roe started at Greenough early in 1867, and by April the local Education Board reported positively on his progress. Susannah Roe was then transferred to his school, and the couple were finally able to live under the same roof.  This arrangement was to last only nine months, however, as in January 1868, Susannah Roe was transferred to a new school at South Greenough.\nRoe's relationship with his local Education Board began to sour in 1870, after the appointment of Hayes Laurence as its chairman. Roe and Laurence immediately found themselves on opposing sides of one of the most controversial issues of the day: the question of whether Catholic schools should receive a government grant. Laurence and other Protestants on the Board interpreted Roe's support for the measure as \"a sign of pro-Popery\". It is also thought that Roe contributed to his disfavour with the Board by voicing his strong views on school management. These issues were cited in a list of complaints sent to Roe in the middle of the year. A few months later he was late to school one day, and the local Board unanimously asked the General Board to dismiss him. The parents of forty-two of the forty-six school children signed a memorial to the General Board stating that Roe had their full confidence, but the request of the local Board was endorsed nonetheless, and Roe was dismissed.\nHaving been dismissed from his post, Roe was now able to speak freely on the education system in which he had worked.  On 28 January 1871, he wrote a long letter to the Fremantle Herald, outlining a series of recommendations for education reform.  He proposed:\n\nThat attendance should be made compulsory;\nThat the ages of attendance should be raised;\nThat good books and teaching aids should be provided, instead of the current \"execrable rubbish... bad grammar, bad English, bad taste and unutterable tediousness\";\nThat salaries should be raised substantially to attract decent teachers;\nThat qualified inspectors should be appointed to assess the quality of teaching;\nThat teaching should be secular only;\nThat control of the education system should be in the hands of a secular board or minister of education.Later that year, the Elementary Education Act 1871 was passed, and some of Roe's proposals were adopted.  Attendance of children who lived within three miles of a school was made compulsory, the ages of attendance was raised, and a system of inspection was introduced.  Within his lifetime, Roe would see more of his measures introduced: salaries were raised and large numbers of trained teachers  recruited; and responsibility for administration of government schools was passed to a minister of education responsible to parliament.\nFor the next two years Roe and his family remained at Greenough.  Susannah Roe continued in her teaching post at South Greenough, and Roe leased a small farm and cut sandalwood.  He also acted as agent, auctioneer and clerk for Henry Gray. He also began to work as a local correspondent for the Fremantle Herald, and in 1873 this resulted in an offer of full-time work as a reporter on the newspaper.  At the end of the year, Susannah Roe resigned her job as a teacher, and the family moved to Perth, where Roe took up his position with the Herald. Shortly afterwards he joined James Pearce and William Beresford as co-editors. He worked at the paper for the rest of his life, by which time Beresford had died, and Pearce had sold the Herald to the Inquirer.\nSusannah Roe died in 1887.  James Roe found it increasingly difficult thereafter to live on the money he made from the Herald, so from 1890 he also worked in his daughter's market garden.  He died in May 1897.\nJames Roe's daughter Helen married Patrick Stone, who later became a Member of the Western Australian Legislative Assembly.  His daughter Georgina married Joseph Walton, and another daughter Agnes married Herman Moll.", "link_mentions": {}}}