{"wiki_id": "http://www.wikidata.org/entity/Q6136425", "itemLabel": "James Hunt", "itemDescription": "English speech therapist", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Hunt_(speech_therapist)", "wikipedia_page": {"main": "James Hunt (1833 – 29 August 1869) was a speech therapist in London, England who had among his clients Charles Kingsley, Leo Tennyson (son of the poet laureate Alfred Tennyson) and Lewis Carroll (Charles Lutwidge Dodgson) author of Alice’s Adventures in Wonderland.\nLewis Carroll was a children’s author, mathematician, and clergyman. He had a stammer that was said to have affected his job.  The 1861 census shows that Charles Lutwidge Dodgson was staying at Ore House in 1861 and being treated by Dr Hunt a psellismolligist.  Since his book was published in 1865 it is quite possible that some of it was written during his stay.His other main interest was in anthropology and in 1863 he established the Anthropological Society of London, which after his death merged with the more established Ethnological Society of London to become the Royal Anthropological Institute.", "link_mentions": [{"page": "Anthropology", "response": ["Waitz was influential among British ethnologists. In 1863 the explorer Richard Francis Burton and the speech therapist James Hunt broke away from the Ethnological Society of London to form the Anthropological Society of London, which henceforward would follow the path of the new anthropology rather than just ethnology. It was the 2nd society dedicated to general anthropology in existence. Representatives from the French Société were present, though not Broca. In his keynote address, printed in the first volume of its new publication, The Anthropological Review, Hunt stressed the work of Waitz, adopting his definitions as a standard. Among the first associates were the young Edward Burnett Tylor, inventor of cultural anthropology, and his brother Alfred Tylor, a geologist. Previously Edward had referred to himself as an ethnologist; subsequently, an anthropologist."]}, {"page": "Noble savage", "response": ["In 1860, John Crawfurd and James Hunt linked the \"noble savage\" concept with developing schools of thought regarding scientific racism.See Ellingson (2001), pp. 249–323. Crawfurd, in alliance with Hunt, was elected to the presidency of the Ethnological Society of London, which was an offshoot of the Aborigines' Protection Society, founded with the intent to prevent indigenous peoples from being enslaved or otherwise exploited.History page: Royal Anthropological Institute of Great Britain and Ireland . The Ethnological Society later merged with the Anthropological Society of London to form the Institute. Invoking \"science\" and \"realism\", the two men derided their \"philanthropic\" predecessors for believing in human equality and for not recognizing that mankind was divided into superior and inferior races. Crawfurd, who opposed Darwinian evolution, \"denied any unity to mankind, insisting on immutable, hereditary, and timeless differences in racial character, principal amongst which was the 'very great' difference in 'intellectual capacity. For Crawfurd, the races had been created separately and were different species. Both Crawfurd and Hunt supported the theory of polygenism, believing in the plurality of the human species. Crawfurd and Hunt routinely accused those who disagreed with them of believing in \"Rousseau's Noble Savage\". Ultimately, however, their partnership fell apart due to Hunt giving a speech in 1865 entitled On the Negro's place in Nature, in which he defended the institution of slavery in the Confederacy during the end of the American Civil War; Crawfurd, being an ardent abolitionist, cut his ties with Hunt after the speeech. \"As Ter Ellingson demonstrates, Crawfurd was responsible for re-introducing the Pre-Rousseauian concept of 'the Noble Savage' to modern anthropology, attributing it wrongly and quite deliberately to Rousseau.\" In an otherwise rather lukewarm review of Ellingson's book in Journal of Colonialism and Colonial History 4:1 (Spring 2003), Frederick E. Hoxie writes:"]}, {"page": "Richard Francis Burton", "response": ["In 1863 Burton co-founded the Anthropological Society of London with Dr. James Hunt. In Burton's own words, the main aim of the society (through the publication of the periodical Anthropologia) was \"to supply travellers with an organ that would rescue their observations from the outer darkness of manuscript and print their curious information on social and sexual matters\". On 13 February 1886, Burton was appointed a Knight Commander of the Order of St Michael and St George (KCMG) by Queen Victoria."]}, {"page": "Ethnological Society of London", "response": ["James Hunt joined the ESL in 1854, and became a divisive figure because of his attacks on humanitarian attitudes of missionaries and abolitionists. He served as secretary from 1859 to 1862. He found an ally in John Crawfurd, who had retired from service as colonial diplomat and administrator for the East India Company. Crawfurd came to ethnology through its section in the BAAS. His published views on race were discordant with the Quaker and APS tradition in the ESL.Terry Jay Ellingson, The Myth of the Noble Savage (2001), p. 265; Google Books. Hunt and Crawfurd in 1858 tried to dislodge the President Sir James Clark at an ESL meeting, unsuccessfully, while Hodgkin was out of the country.Ellingson, p. 275; Google Books."]}, {"page": "Anthropological Society of London", "response": ["The Anthropological Society of London was founded in 1863 by Richard Francis Burton and Dr. James Hunt.  It broke away from the existing Ethnological Society of London, founded in 1843, and defined itself in opposition to the older society.  The Anthropological Society, Hunt proclaimed, would concern itself with the collection of facts and the identification of natural laws that explained the diversity of humankind.  It would also cast its intellectual nets more broadly, dealing with the physical as well as the cultural aspects of humans.", "According to noted Darwin biographers Adrian Desmond and James Moore, however, founder James Hunt was a paid agent of the Confederate States of America, as was his friend Henry Hotze and two other council members.  Their purpose in founding the society was \"to swing London opinion during the [American Civil] war.\"  Hunt and Hotze put pro-slavery pseudoscience into the Anthropological Society library, \"bought journalists, printed and distributed thousands of pamphlets,... ran a propaganda weekly in Fleet Street, The Index...\" and in general promoted the pro-slavery dogma that black people were a separate species and inherently capable of no higher development than that of enslavement.Darwin's Sacred Cause: How a hatred of slavery shaped Darwin's views on human evolution, A Desmond and J Moore, 2009 Houghton Mifflin Harcourt, Boston/NYC; quotes from p. 332-3", "Efram Sera-Shriar, ‘Observing Human Difference: James Hunt, Thomas Huxley, and Competing Disciplinary Strategies in the 1860s’, Annals of Science, 70 (2013), 461-491"]}, {"page": "History of anthropology", "response": ["The mixed character of Greek anthropos and Latin -logia marks it as New Latin. There is no independent noun, logia, however, of that meaning in classical Greek. The word λόγος (logos) has that meaning. James Hunt attempted to rescue the etymology in his first address to the Anthropological Society of London as president and founder, 1863. He did find an anthropologos from Aristotle in the standard ancient Greek Lexicon, which he says defines the word as \"speaking or treating of man\". This view is entirely wishful thinking, as Liddell and Scott go on to explain the meaning: \"i.e. fond of personal conversation\". If Aristotle, the very philosopher of the logos, could produce such a word without serious intent, there probably was at that time no anthropology identifiable under that name."]}, {"page": "Polygenism", "response": ["Polygenist schools arose in the 1830s and 1840s across Europe. The Scottish anatomist and zoologist Robert Knox was considered to have influenced polygenism in Britain; he argued in his The Races of Men (1850) that \"[r]acial natures ... were unchanging over thousands of years, and were so different that they should be called different species\". A colleague of Knox, James Hunt, was also an early author who promoted polygenism in Britain, though he was more concerned with establishing white superiority. Hunt dedicated his On the Negro's Place in Nature (1863) to Knox who had died a year before its publication.Claeys, Gregory, Encyclopedia of nineteenth-century thought, Taylor & Francis, 2005, p. 21."]}, {"page": "John Crawfurd", "response": ["Ellingson points to a 1781 work of William Falconer, On the Influence of Climate, with an attack on Rousseau, as a possible source of Crawfurd's thinking; while also pointing out some differences.Ellingson, p. 300. Ellingson also places Crawfurd in a British group among those of his period whose anthropological views not only turned on race, but who also drew conclusions of superiority from those views, others being Luke Burke, James Hunt, Robert Knox, and Kenneth R. H. Mackenzie.Ellingson, p. 239."]}, {"page": "Monogenism", "response": ["Around 1850 polygenism was a rising intellectual trend. On the other hand, monogenism retained support in London's learned societies. The Ethnological Society of London had the monogenist tradition of Thomas Hodgkin and James Cowles Prichard, continuing in Robert Gordon Latham. Others on that side of the debate were William Benjamin Carpenter, Charles Darwin, Edward Forbes, Henry Holland, Charles Lyell, and Richard Owen.Adrian Desmond and James Moore, Darwin's Sacred Cause (2009), p. 400 note 27. The direction of the Ethnological Society was challenged by James Hunt, a polygenist who became a secretary in 1859, and John Crawfurd, who was president two years later, who believed in a large number of separately created racial groups.David N. Livingstone, Adam's Ancestors: race, religion, and the politics of human origins, 2008, p. 113; Google Books."]}, {"page": "The Book of the Thousand Nights and a Night", "response": ["In 1863 Burton co-founded the Anthropological Society of London with Dr. James Hunt. In Burton's own words, the main aim of the society (through the publication of the periodical Anthropologia) was \"to supply travelers with an organ that would rescue their observations from the outer darkness of manuscript and print their curious information on social and sexual matters\". Burton had written numerous travel books which invariably included sexual curiosa in extensive footnotes and appendices. His best-known contributions to literature were those considered risqué or even pornographic at the time and which were published under the auspices of the \"Kama Shastra Society\", a fictitious organisation created by Burton and Forster Fitzgerald Arbuthnot as a legal device to avoid the consequences of current obscenity laws. (Burton and Arbuthnot were the only members of the \"Society\".) These works included The Kama Sutra of Vatsyayana (1883), published just before his Nights, and The Perfumed Garden of the Shaykh Nefzawi (1886), published just after it."]}, {"page": "James Hunt (disambiguation)", "response": ["James Hunt (1947–1993) was a British racing car driver.", "*James Hunt (sailor) (born 1936), American sailor, Olympic champion in 1960", "*James Hunt (judge) (1943–2006), judge of the High Court of England and Wales", "*James Hunt (footballer) (born 1976), English footballer", "*James Hunt (speech therapist) (1833–1869), speech therapist and founder of the Anthropological Society of London, England ", "*James Hunt (Canadian politician) (1835–1915), Canadian politician"]}, {"page": "Thomas Hunt (speech therapist)", "response": ["He died at Godlingstone, near Swanage, Dorset, on 18 Aug. 1851, leaving his practice to his son James Hunt. His widow, Mary, died 25 Jan. 1855, aged 49."]}, {"page": "John Epps", "response": ["In the later 1830s and early 1840s, the Anthropological Society of London (not to be confused with the Anthropological Society of London founded in 1863 by Richard Francis Burton and Dr. James Hunt) was a phrenological group holding meetings, associated with the Christian Physician and Anthropological Magazine edited by Epps. John Isaac Hawkins acted as president.Waterloo page on the Royal Anthropological Institute of Great Britain and Ireland.The Phrenological Journal and Miscellany, no. 49, vol. 10 (1837)), p. 244; Google Books.The Christian Physician and Anthropological Magazine (1835); archive.org. Other members were Luke BurkeRichard Handler, Excluded Ancestors, Inventible Traditions: essays toward a more inclusive history of anthropology (2000), pp. 24–25 with note 7; Google Books. and William Mattieu Williams.William Mattieu Williams, Science Notes: John Isaac Hawkins and Brain Growth, in Gentleman's Magazine, vol. 258, January–June 1885, p. 510; archive.org. After 1842 it became part of the Christian Phrenological Society."]}, {"page": "The Cannibal Club", "response": ["The Cannibal Club was a Victorian dining club associated with the Anthropological Society, likely founded at the same time in 1863 by Sir Richard Francis Burton and Dr James Hunt.Kennedy, p. 168. The club met in Bartolini's dining rooms near Fleet Street. Its official symbol was a mace carved to look like an African head gnawing on a human thighbone. The club's name is thought to derive from Burton's interest in cannibalism which he regretted that he never witnessed on his travels.Lovell, p. 413 Club members included: Richard Monkton Milnes, Charles Bradlaugh, Thomas Bendyshe, Algernon Swinburne, Sir James Plaisted Wilde, General Studholme John Hodgson and Charles Duncan Cameron."]}, {"page": "John H. Van Evrie", "response": ["The series of anti-abolition tracts of which Abolition is National Death was part also included The Six Species of Men (1866) and The Abolition Conspiracy. The sixth of the Anti-Abolition Tracts, entitled \"Soliloquies\", featured a parody of a \"political preacher\", in which Van Evrie accused antislavery clergy of replacing the teachings of Christ with their own politics by creating a fictional minister who \"forsook Christ and took up politics ... And I taught people to hate each other. And ... I preached the negro and Abolitionism instead of Christ and salvation.\" Also in 1866, Van Evrie published an unsigned pamphlet alongside a series of drawings intended to illustrate white superiority. Two years later the same piece was serialized under Van Evrie's name in The Old Guard. In 1868, Van Evrie's Democratic Alamanac devoted 20 pages to reprinting Bryan Edwards's narrative of the Haitian Revolution in an attempt to prove that the same \"means and agencies\" that had fomented the rebellion in Haiti were at work in the Republican Party. In the 1870s Van Evrie continued to advertise and distribute his own pamphlets under the title \"The White Man's Political Library.\" James Hunt's pamphlet \"On the Negro's Place in Nature\" was published in the United States by Van Evrie."]}, {"page": "Thomas Bendyshe", "response": ["Bendyshe wrote in 1864 in the Society's Anthrological Review an article \"On the Extinction of Races\". His view on the Aboriginal Australians was that their population decline was caused by \"promiscuous intercourse, artificial abortion, infanticide, wars, diseases, and poverty\". James Hunt of the Society concurred. Lorimer considers this an example of the joint use of racist and Malthusian arguments.", "According to Adrian Desmond, Bendyshe, Hunt and James McGrigor Allan were major proponents of the views of the polygenist Carl Vogt. Bendyshe was impressed by the diversity of African skulls, but did not conclude that the Africans were a different species of human, making his attitude more nuanced than some others. He dissented at length from Hunt's negative position stated in 1864 as an address \"On the Negro's Place in Nature\" on civilisation.James Hunt, On the Negro's Place in Nature, Journal of the Anthropological Society of London Vol. 2 (1864), pp. xv–lvi from p. xxxiv. Published by: Royal Anthropological Institute of Great Britain and Ireland "]}, {"page": "The Reader (weekly)", "response": ["While the scientific content of The Reader ended with Bendyshe's ownership, the scientific group supplying it was the milieu for the founding of Nature in 1869. As far as Bendyshe's interests in human diversity went, James Hunt set up as successor the Popular Magazine of Anthropology in early 1866."]}]}}