{"wiki_id": "http://www.wikidata.org/entity/Q6138888", "itemLabel": "James Mansergh", "itemDescription": "civil engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Mansergh", "wikipedia_page": {"main": "James Mansergh FRS (29 Apr 1834 – 15 Jun 1905) was an English civil engineer.\nMansergh was born in Lancaster. He started his career in railway work and then designed many sewerage schemes and fresh water schemes.\nHis most famous projects were:\n\nElan Valley Dam and Elan aqueduct for Birmingham Corporation Water Department, England (water supply).\nHury Reservoir for Stockton and Middlesbrough, England (water supply).\nAbbeystead Dam, one of the first stone-faced concrete dams.\nWerribee sewage works and farm for Melbourne, Australia.\nClaymills Pumping Station for Burton upon Trent, England (sewage disposal).\nLaid out parts of Ramsey, Isle of Man (drainage).He became a member of the council of the  Institution of Civil Engineers in 1884, vice-president in 1895 and was elected to the chair of the institution from November 1900 to November 1901.He became the elected chairman of the Engineering Standards Committee, when it was formed in 1901 from a combination of organizations, which later became the British Standards Institution. He served as High Sheriff of Radnorshire for 1901.He was elected a Fellow of the Royal Society in 1901. His candidature citation read:\n\nPresident of the Institution of Civil Engineers. Author of 'Lectures on Water Supply, Prospecting for Water, Prospecting and Boring' delivered at the School of Military Engineering, Chatham, also of 'The Supply of Water to Towns,' and other works. The designer of the waterworks and sewerage of Lancaster, Lincoln, Stockton, Middlesbrough, Rotherham, Southport, Burton-on-Trent, Melbourne (Australia), Birmingham, and many other towns. These designs include some of the largest schemes of water supply, sewerage or sewage disposal for Halifax, Herford, St Helens, Darlington, Whitby, the Potteries, Derby, Southampton, Durham, Shrewsbury, Malvern, Cambridge, Edinburgh, Plymouth, York, Antigua, Philadelphia (US), and other places. Was a member of the Royal Commission on Metropolitan Water Supply. Eminent as a hydraulic engineer.\nIn March 1903 he received the honorary freedom of his native town of Lancaster\nHe died at 51 Fitzjohn's Avenue, Hampstead, London and was buried in Hampstead Cemetery.", "link_mentions": [{"page": "British Standards", "response": ["BSI Group began in 1901 as the Engineering Standards Committee, led by James Mansergh, to standardize the number and type of steel sections, in order to make British manufacturers more efficient and competitive. Over time the standards developed to cover many aspects of tangible engineering, and then engineering methodologies including quality systems, safety and security."]}, {"page": "Clevedon", "response": ["In 1863, Sir Arthur Elton, 7th Baronet of Clevedon Court was largely responsible for the creation of the Clevedon Waterworks Company, which had built the first water works and sewage treatment works in Clevedon by 1867. Features included reservoirs to the north of Dial Hill and Old Street pumping station. As the population increased, the water works proved inadequate and a new pumping station was created on Tickenham Road in 1901, some  to the north-east. The new site could be seen from Clevedon Court, and the 8th Baronet, Sir Edmund Elton, took exception to the designs of the engineer James Mansergh. The Waterworks Company employed the architect Henry Dare Bryan to improve the appearance of the buildings, which included the pumping station, a coal shed and store, a lodge for the foreman, and the boundary wall and gates. The original pumping station was reused as a fire station. The new pumping station contained a vertical triple-expansion engine manufactured by the Scottish company Glenfield and Kennedy. This was upgraded to a Marshal horizontal compound engine in 1916, in turn replaced in 1938, when a steam turbine was fitted. The boiler house, engine house and chimney are grade II listed, as largely unaltered buildings in Domestic Revival style, with the interior retaining its glazed tiling and elaborate roof trusses, although the machinery has been replaced by modern equipment, and the site is still operational. Clevedon Waterworks Company were one of the first of the smaller waterworks in the region to amalgamate with Bristol Water, which occurred on 1 January 1953."]}, {"page": "Elan Valley Reservoirs", "response": ["Victorian politician, Joseph Chamberlain, the leader of Birmingham City Council began a campaign to get clean water from the Elan and Claerwen valleys in mid Wales. The area, which had been identified by civil engineer James Mansergh, would be ideal for water reservoirs because:", "Work began to construct the reservoirs the following year in 1893. Construction was overseen by James Mansergh, on behalf of the City of Birmingham's Water Department. Due to the height above sea level of the Elan Valley, water would be fed to Birmingham along a  pipeline that employed a gravity feed with a gradient of 1 in 2,300. The schedule for the project was to build the four lower Elan Valley dams first. The Claerwen would then be built later (work was expected to begin 1939 but was delayed by the Second World War; it was completed in 1952).", "* Report of a 1901 lecture by James Mansergh"]}, {"page": "Claymills Pumping Station", "response": ["Claymills Pumping Station is a restored Victorian sewage pumping station on the north side of Burton upon Trent, Staffordshire, England.  It was designed by James Mansergh and used to pump sewage to the sewage farm at Egginton."]}, {"page": "Western Treatment Plant", "response": ["Eminent British engineer James Mansergh was appointed to advise on a suitable system, while local engineer William Thwaites was ultimately responsible for the design and implementation of the system. At a time when most cities dumped their untreated wastes directly into rivers and the sea, Mansergh advised treatment of Melbourne's sewage by broad irrigation with a capacity large enough able to deal with the expansion in population expected over 50 years. The system he conceived and which was implemented in only slightly modified form began with a water closet at every property which delivered the sewage by gravity through a network of underground sewers of increasing diameter to a steam pumping station at Spotswood where it was forced up wrought iron rising mains to Brooklyn to begin its 25 kilometre journey along the Main Outfall Sewer to the sewage farm at Werribee.http://vhd.heritage.vic.gov.au/vhd/heritagevic/?timeout=yes#detail_places;11868"]}, {"page": "Elan aqueduct", "response": ["The engineer for the Elan aqueduct scheme was James Mansergh."]}, {"page": "Listed buildings in Worthing", "response": ["|Built in 1861–62 to a length of  and a width of  by Robert Rawlinson—provider of the town's first regular water supply a decade earlier—the pier was rebuilt by James Mansergh in 1889 and had its landward pavilion added in 1925 by Stanley Adshead. The contemporary seaward pavilion burnt down in 1933 (a replacement was immediately built), and the structure had previously been wrecked by storms at Easter 1913."]}, {"page": "Birmingham Corporation Water Department", "response": ["The Birmingham Corporation Water Act passed in 1892 authorised the purchase of land in Mid Wales on the upper portion of the Rivers Elan and Claerwen. Three reservoirs on the Elan and three on the Claerwen (collectively the \"Elan Valley Reservoirs\") were authorised, together with an aqueduct to carry the water to Birmingham. The engineer for the Elan aqueduct scheme was James Mansergh. Construction work started in 1893 and the Elan Valley Railway was built to aid construction.Steam nostalgia: locomotive and railway preservation in Great Britain. Gerald Nabarro King Edward VII and Queen Alexandra performed the official opening on 21 July 1904 although building works were not completed until near the end of 1906."]}, {"page": "List of fellows of the Royal Society M, N, O", "response": ["| James Mansergh||06/06/1901||29 April 1834 – 15 June 1905"]}, {"page": "Maurice Mansergh", "response": ["Admiral Sir Maurice James Mansergh KCB CBE (14 October 1896 – 29 September 1966) was a Royal Navy officer who went on to be Commander-in-Chief, Plymouth.", "Mansergh was born in Ealing, Essex, the second son of civil engineer Ernest Lawson Mansergh and grandson of James Mansergh. He was educated at a school near Nuneaton before entering Royal Naval College, Osborne in 1909 as a naval cadet.", "Mansergh joined the Royal Navy in 1914 at the start of World War I.Sir Maurice James Mansergh Liddell Hart Centre for Military Archives He served on the staff of the Commander-in-Chief, Mediterranean Fleet from 1934 and then became Executive Officer on the battleship HMS Rodney from 1936. In 1939 he became Director of the Trade Division at the Admiralty where his main role was the protection of shipping.B. B. Schofield. The Defeat of the U-Boats during World War II. Journal of Contemporary History 16 (1) The Second World War: Part 1 (Jan., 1981), 119-129. Sage Publications, Ltd."]}, {"page": "Daniel Joseph Jaffé", "response": ["Daniel Jaffé was born in London to the Jaffe family and educated at City & Guilds Westminster, earning a diploma of associate (A.C.G.I). In 1896, he was articled for three years as civil engineer to Sir James Mansergh, who was famous as a waterworks consulting engineer."]}, {"page": "William Thwaites (engineer)", "response": ["Thwaites' greatest achievement was in the design and supervision of the construction of Melbourne's underground sewerage scheme, which was at the time the largest civil engineering project in the history of Victoria. He initially gave evidence to the Royal Commission into the Sanitary Conditions of Melbourne in 1889 at which he produced a detailed and comprehensive scheme for underground sewers for Melbourne. While British engineer James Mansergh was brought to Australia to advise on the Sewerage System and proposed a number of design options, a 2011 biography by Robert La Nauze has demonstrated that Mansergh drew strongly from Thwaites' earlier report, and it was left to Thwaites, when appointed to the task, to put the plans into practice and he successfully argued for a modification of Mansergh's proposals by reducing the size of the main sewer pipes and so \"...removed a design fault in Mansergh’s scheme that would have led to embarrassing blockages\". The large main sewers proposed by Mansergh would not have created sufficient velocity to scour the solids, particularly in the early stages before many properties were connected, and so Thwaites believed they would require manual cleaning. His solution was to reduce the diameter of the mains, and use ovoid section sewers, which had a narrow section at the base that concentrated the flow and therefore increased the velocity.Jon Schladweiler 'History of Sanitary Sewers', Pipe - Oval / Egg-shaped (2)  Other changes were the construction of a single pumping station at Spotswood and a single sewage treatment farm at Werribee."]}, {"page": "Mansergh (surname)", "response": ["*James Mansergh (1834–1905), English civil engineer"]}, {"page": "List of fellows of the Royal Society elected in 1901", "response": ["*James Mansergh  (1834–1905), civil engineer"]}, {"page": "Stephen W. Williams", "response": ["In 1892 the Birmingham Corporation Water Act was passed which gave the Birmingham City Council powers to compulsorily purchase land in the Elan Valley close to Rhayader, for the construction of dams for a water supply for the city. Birmingham Corporation had appointed the engineer, James Mansergh, to oversee the project but he needed someone to plan and build the workers' village.\"Scourfield\", 311–314 In October 1892 Williams was requested to value various estates by the Birmingham Town Clerk and in May 1893 he was appointed Elan Valley Estate Agent by the City Council.'Williams\", 1992, 66–67 This involved the management of 45,000 acres of land and he was also involved in the delicate negotiations over land leases, dealing fairly and discreetly with local tenants, many of whom lost their lands as a result of building the reservoirs. In these matters he was to work closely with James Mansergh, who referred to him as 'our ubiquitous friend'R W D Fenn and J B Sinclair '‘Our Ubiquitous Friend\" (The work of Stephen Williams), \"Transactions of the Radnorshire Society\" Vol 59,1989."]}, {"page": "Spotswood sewer tunnel", "response": ["The Melbourne and Metropolitan Board of Works (MMBW) was created in 1892 and appointed eminent British engineer James Mansergh to advise on a suitable system. However, local engineer William Thwaites was responsible for the design and construction. The system included sewer mains from the Melbourne CBD and south-eastern suburbs extending across Fishermans Bend to a point opposite the pumping station. A tunneling apparatus was imported from Britain, designed by British engineer James Henry Greathead. It consisted of a cylindrical shield, 3.4 metres in diameter, made of cast iron and steel plate, which was driven into the soft alluvial clays by hydraulic rams. Air pressure inside the shield was maintained at two or three times atmospheric pressure to inhibit groundwater inflow, with an airlock to allow tunnellers to enter and exit. Cast-iron ring segments were bolted behind the shield as it advanced, and then the tunnel was lined with 30 centimetres of concrete."]}, {"page": "Francis Alfred Cooper", "response": ["Cooper was the fourth son of the Rev. William Waldo Cooper, M.A., Rural Dean of Walshcroft, Rector of West Rasen, Lincolnshire, Justice of the Peace of the Parts of Lindsey. Cooper was educated at Rossall School and at Loughborough Grammar School and served as a pupil from 1879 to 1882 and later an assistant from 1882 to 1887 at the office of James Mansergh, then President of the Institution of Civil Engineers, Westminster. During the time he became Member of the Institution of Civil Engineers and Fellow of the Royal Sanitary Institute."]}, {"page": "Mansergh, James", "response": ["#redirectJames Mansergh"]}, {"page": "Listed buildings in Burton, Staffordshire (civil parish)", "response": ["|A former steam-powered sewage pumping station, later a visitor attraction, it was designed by James Mansergh to process brewery effluent.  It is built in red brick with parapets and hipped slate roofs, and consists of two rectangular engine houses linked by a rectangular boiler house with a chimney stack.  Each engine house has two storeys and a semi-basement on a plinth, with angle pilasters, bands and moulded cornices.  The boiler house has one storey and a semi-basement, and pilasters dividing the bays.  The chimney is octagonal and tapering, and is about  high."]}, {"page": "George Robert Graham Conway", "response": ["G. R. G. Conway was born in Southampton, and educated at Taunton's School and Hartley University College, both in Southampton. After completing his engineering training he worked as assistant to James Mansergh and then became Resident Engineer to the City of Aberdeen in 1895. He worked in Monterrey, Mexico from 1907–1910, in British Columbia, Canada, from 1910–1916, and in Mexico City from 1916 until he retired in 1942. He died in Mexico City on 20 May 1951"]}]}}