{"wiki_id": "http://www.wikidata.org/entity/Q6137943", "itemLabel": "James Lees-Milne", "itemDescription": "British writer (1908-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Lees-Milne", "wikipedia_page": {"main": "(George) James Henry Lees-Milne (6 August 1908 – 28 December 1997) was an English writer and expert on country houses, who worked for the National Trust from 1936 to 1973. He was an architectural historian, novelist and biographer. His extensive diaries remain in print.", "link_mentions": [{"page": "Evelyn Waugh", "response": ["In the course of his lifetime, Waugh made enemies and offended many people; writer James Lees-Milne said that Waugh \"was the nastiest-tempered man in England\".Lees-Milne, p. 169 Waugh's son, Auberon, said that the force of his father's personality was such that, despite his lack of height, \"generals and chancellors of the exchequer, six-foot-six and exuding self-importance from every pore, quail[ed] in front of him\".Auberon Waugh, p. 43"]}, {"page": "Chatsworth House", "response": ["*English Country Houses: Baroque (1970) by James Lees-Milne. Country Life / Newnes Books. "]}, {"page": "St. Peter's Basilica", "response": ["Designed principally by Donato Bramante, Michelangelo, Carlo Maderno and Gian Lorenzo Bernini, St. Peter's is the most renowned work of Renaissance architecture and the largest church in the world by interior measure. While it is neither the mother church of the Catholic Church nor the cathedral of the Diocese of Rome (these equivalent titles being held by the Archbasilica of Saint John Lateran in Rome), St. Peter's is regarded as one of the holiest Catholic shrines. It has been described as \"holding a unique position in the Christian world\"James Lees-Milne describes St. Peter's Basilica as \"a church with a unique position in the Christian world\" in . and as \"the greatest of all churches of Christendom.\"Banister Fletcher, the renowned architectural historian calls it \"the greatest creation of the Renaissance\" and \"... the greatest of all churches of Christendom\" in .", "Sangallo's plan (1513), of which a large wooden model still exists, looks to both these predecessors. He realized the value of both the coffering at the Pantheon and the outer stone ribs at Florence Cathedral. He strengthened and extended the peristyle of Bramante into a series of arched and ordered openings around the base, with a second such arcade set back in a tier above the first. In his hands, the rather delicate form of the lantern, based closely on that in Florence, became a massive structure, surrounded by a projecting base, a peristyle and surmounted by a spire of conic form. According to James Lees-Milne the design was \"too eclectic, too pernickety and too tasteless to have been a success\".", "The facade is often cited as the least satisfactory part of the design of St. Peter's. The reasons for this, according to James Lees-Milne, are that it was not given enough consideration by the Pope and committee because of the desire to get the building completed quickly, coupled with the fact that Maderno was hesitant to deviate from the pattern set by Michelangelo at the other end of the building. Lees-Milne describes the problems of the façade as being too broad for its height, too cramped in its details and too heavy in the attic story. The breadth is caused by modifying the plan to have towers on either side. These towers were never executed above the line of the facade because it was discovered that the ground was not sufficiently stable to bear the weight. One effect of the facade and lengthened nave is to screen the view of the dome, so that the building, from the front, has no vertical feature, except from a distance."]}, {"page": "National Trust", "response": ["Bailey was followed as chairman of the Trust by the 2nd Marquess of Zetland, and in 1936 the Trust set up the Country Houses Committee, with James Lees-Milne as secretary, to look into ways of preserving country houses and gardens at a time when their owners could no longer afford to maintain them. A country house scheme was set up and the National Trust Acts of 1937 and 1939 facilitated the transfer of estates from private owners to the Trust. The scheme allowed owners to escape estate duty on their country house and on the endowment which was necessary for the upkeep of the house, while they and their heirs could continue to live in the property, providing the public were allowed some access. The first house offered under the scheme was Stourhead in Wiltshire, although it was not acquired by the Trust until after the death in 1947 of the owners Sir Henry and Lady Hoare."]}, {"page": "Mitford family", "response": ["*Thomas \"Tom\" Mitford (2 January 1909 – 30 March 1945), the only son, was educated at Eton, where he had an affair with James Lees-Milne. He later had a lengthy affair with Austrian Jewish dancer Tilly Losch during her marriage to Edward James. According to Jessica's letters, Thomas supported British fascism and was posted to the Burma campaign after he had refused to fight in Europe. He died in action."]}, {"page": "Nancy Mitford", "response": ["Frederick the Great was published later in 1970 to a muted reception. Mitford's remaining years were dominated by her illness, although for a time she enjoyed visits from her sisters and friends, and working in her garden. In April 1972 the French government made her a Chevalier of the Légion d'Honneur, and later that year the British government appointed her a Commander of the Order of the British Empire (CBE). She was delighted by the former honour, and amused by the latter—which she remembered Waugh had called an \"insult\" and turned down. At the end of 1972 she entered the Nuffield Clinic in London, where she was diagnosed with Hodgkin's lymphoma, a cancer of the blood. She lived for another six months, unable to look after herself and in almost constant pain, struggling to keep her spirits up. She wrote to her friend James Lees-Milne: \"It's very curious, dying, and would have many a drôle amusing & charming side were it not for the pain\". She died on 30 June 1973 at her home in the rue d'Artois and was cremated in Versailles, after which her ashes were taken to Swinbrook for burial alongside her sister Unity.Hastings, p. 255"]}, {"page": "Unity Mitford", "response": ["Stating she could remember nothing of the incident, Mitford returned to England with her mother and sister in January 1940 amid a flurry of press interest and her comment, \"I'm glad to be in England, even if I'm not on your side\", led to public calls for her internment as a traitor. Due to the intervention by Home Secretary John Anderson, at the behest of her father, she was left to live out her days with her mother at the family home at Swinbrook, Oxfordshire. Under the care of Professor Hugh Cairns, neurosurgeon at the Nuffield Hospital in Oxford, \"She learned to walk again, but never fully recovered. She was incontinent and childish.\" Her mental age was likened to that of a 10 year old, or a \"sophisticated child\" as James Lees-Milne called her (although he continues that she was \"still very amusing in that Mitford manner\").The Mitford Girls: The Biography of An Extraordinary Family, Mary S. Lovell, Hachette, 2001. She had a tendency to talk incessantly, had trouble concentrating her mind, and showed an unusually large appetite with sloppy table manners. Lees-Milne observed her to be \"rather plain and fat, and says she weighs \". She did however, retain at least some of her devotion to the Nazi party; her family friend Billa Harrod recalled Unity stating that she wished to have children and name the eldest Adolf."]}, {"page": "Diana Mitford", "response": ["Her appearance on the BBC's Desert Island Discs in 1989 was controversial.  She was also a regular book reviewer for Books & Bookmen and later at The Evening Standard in the 1990s. A family friend, James Lees-Milne, wrote of her beauty, \"She was the nearest thing to Botticelli's Venus that I have ever seen\". She was described as \"unrepentant\" about her previous political associations by obituary writers such as the historian Andrew Roberts.Diana Mosley, unrepentantly Nazi and effortlessly charming The Telegraph. 13 August 2003Diana Mosley, Hitler's angel, dies unrepentant in Paris  The Guardian. 13 August 2003"]}, {"page": "John Gielgud", "response": ["In 1932 Gielgud turned to directing. At the invitation of George Devine, the president of the Oxford University Dramatic Society, Gielgud took charge of a production of Romeo and Juliet by the society, featuring two guest stars: Peggy Ashcroft as Juliet and Edith Evans as the Nurse. The rest of the cast were students, led by Christopher Hassall as Romeo, and included Devine, William Devlin and Terence Rattigan.\"OUDS – Romeo and Juliet\", The Times, 11 February 1932, p. 10 The experience was satisfactory to Gielgud: he enjoyed the attentions of the undergraduates, had a brief affair with one of them, James Lees-Milne,Morley, p. 84 and was widely praised for his inspiring direction and his protégés' success with the play.Morley, p. 86 Already notorious for his innocent slips of the tongue (he called them \"Gielgoofs\"), in a speech after the final performance he referred to Ashcroft and Evans as \"Two leading ladies, the like of whom I hope I shall never meet again\".Morley, p. 85"]}, {"page": "1993 in literature", "response": ["*James Lees-Milne – People and Places: Country House Donors and the National Trust"]}, {"page": "William Cavendish, 6th Duke of Devonshire", "response": ["*James Lees-Milne: The Bachelor Duke: Life of William Spencer Cavendish, 6th Duke of Devonshire, 1790-1858 (1991). John Murray. "]}, {"page": "Castle Drogo", "response": ["After Julius's death, his wife Frances and her son Basil continued to live at the castle. During 1939–45, Frances and her daughter Mary ran the house as a home for babies made homeless during the bombings of London. Frances Drewe died in 1954 and Basil was then joined at Drogo by his son Anthony and his wife. In 1974, Anthony and his son, Dr Christopher Drewe, gave Castle Drogo, Whiddon Farm, several cottages in Drewsteignton, a financial dowry and  of the surrounding land to the National Trust. It was the first 20th-century property the charity acquired. The writer and National Trust administrator James Lees-Milne recorded his impressions of the house and its owners in a diary entry dated 9 September 1976; \"Reached Castle Drogo ... at eleven. Very satisfactory house of clean-cut granite. A new family aspiring to, rather arriving at, landed gentry-hood and now the representative living upstairs in a tiny flat, all within my lifetime\"."]}, {"page": "Wilton House", "response": ["There was however one huge improvement created by Wyatt – the cloisters. This two-storeyed gallery which was built around all four sides of the inner courtyard, provided the house with not only the much needed corridors to link the rooms, but also a magnificent gallery to display the Pembroke collection of classical sculpture. Wyatt died before completion, but not before he and Lord Pembroke had quarrelled over the designs and building work. The final touches were executed by Wyatt's nephew Sir Jeffry Wyatville. Today nearly two hundred years later Wyatt's improvements do not jar the senses as much as they did those of the great architectural commentators James Lees-Milne and Sir Sacheverell Sitwell writing in the 1960s. That Wyatt's works are not in the same league of style as the south front, and the Tudor tower, is perhaps something for future generations to judge."]}, {"page": "Prince Pierre, Duke of Valentinois", "response": ["According to James Lees-Milne, a British writer and friend of Pierre's, his unhappy arranged marriage was complicated by his homosexuality and Princess Charlotte's affairs.Michael Bloch, James Lees-Milne: The Life (John Murray, 2009), p. ?? In the mid-1920s, the couple unofficially separated."]}, {"page": "Ian Hamilton (British Army officer)", "response": ["He was a cousin of the diarist James Lees-Milne."]}, {"page": "Inveraray Castle", "response": ["Designers who worked on the house include William Adam and Roger Morris; the interior has a number of neoclassical rooms created for the 5th Duke by Robert Mylne. These are among the rooms open to the public. James Lees-Milne was not impressed by the house when he visited it in 1943, noting the \"ugly\" grey stone and calling it \"grim and forbidding\"."]}, {"page": "Palladian architecture", "response": ["In Britain, Palladianism was briefly in vogue during the 17th century, but its flowering was cut short by the onset of the English Civil War and the imposition of austerity which followed. In the early 18th century it returned to fashion, not only in England but also, directly influenced from Britain, in Prussia. Count Francesco Algarotti may have written to Lord Burlington from Berlin that he was recommending to Frederick the Great the adoption in Prussia of the architectural style Burlington had introduced in England,James Lees-Milne, The Earls of Creation 1962:120. but Knobelsdorff's opera house on the Unter den Linden boulevard, based on Campbell's Wanstead House, had been constructed from 1741. Later in the century, when the style was falling from favour in Europe, it had a surge in popularity throughout the British colonies in North America, highlighted by examples such as Drayton Hall in South Carolina, the Redwood Library in Newport, Rhode Island, the Morris-Jumel Mansion in New York City, the Hammond-Harwood House in Annapolis, Maryland and Thomas Jefferson's Monticello and Poplar Forest in Virginia.", "Palladio used these elements extensively, for example in very simple form in his entrance to Villa Forni Cerato. It is perhaps this extensive use of the motif in the Veneto that has given the window its alternative name of the Venetian window; it is also known as a Serlian window. Whatever the name or the origin, this form of window has probably become one of the most enduring features of Palladio's work seen in the later architectural styles evolved from Palladianism.Andrea Palladio, Caroline Constant. The Palladio Guide. Princeton Architectural Press, 1993. p. 42. According to James Lees-Milne, its first appearance in Britain was in the remodeled wings of Burlington House, London, where the immediate source was actually in Inigo Jones's designs for Whitehall Palace rather than drawn from Palladio himself.\"The earliest example of the revived Venetian window in England\", Lees-Milne, The Earls of Creation, 1962:100.", "A variant, in which the motif is enclosed within a relieving blind arch that unifies the motif, is not Palladian, though Lord Burlington seems to have assumed it was so, in using a drawing in his possession showing three such features in a plain wall. Modern scholarship attributes the drawing to Vincenzo Scamozzi. Burlington employed the motif in 1721 for an elevation of Tottenham Park in Savernake Forest for his brother-in-law Lord Bruce (since remodeled). Kent picked it up in his designs for the Houses of Parliament, and it appears in Kent's executed designs for the north front of Holkham Hall.James Lees-Milne 1962:133f."]}, {"page": "Montacute House", "response": ["Finally, in 1931, the house was sold to the philanthropist Ernest Cook, who presented it to the Society for the Protection of Ancient Buildings, and from that Society, it passed to the National Trust. It was one of the Trust's first great houses. The following year, in 1932, it opened to the public for the first time. Bare of furnishing and without sufficient funds to maintain it, James Lees-Milne, the secretary of the Trust's country house committee, described the mansion as an \"empty and rather embarrassing white elephant\"."]}, {"page": "West Wycombe Park", "response": ["During World War II, the house saw service as a depository for the evacuated Wallace Collection and a convalescent home. A troop of gunners occupied the decaying service wing, and the park was used for the inflation of barrage balloons. During this turmoil, the Dashwoods retreated to the upper floor and took in lodgers to pay the bills, albeit very superior lodgers, who included Nancy Mitford and James Lees-Milne,Dashwood p 114. who was secretary of the Country House Committee of the National Trust and instrumental in the Trust's acquisition of many such houses. In 1943, Sir John gave the house and grounds to the National Trust, on condition that he and his descendants could continue living in the house."]}, {"page": "List of Old Etonians born in the 20th century", "response": ["*James Lees-Milne (1908–1997), author and diarist"]}, {"page": "Chartwell", "response": ["In February 1926, Churchill's political colleague Sir Samuel Hoare described a visit in a letter to the press baron Lord Beaverbrook; \"I have never seen Winston before in the role of landed proprietor, ... the engineering works on which he is engaged consist of making a series of ponds in a valley and Winston appeared to be a great deal more interested in them than in anything else in the world\". As Hoare's presence indicated, Churchill's holidays were very rarely pure vacations. Roy Jenkins, in his study, The Chancellors, contrasted Churchill's approach to holidaying with that of his then boss, Stanley Baldwin. \"Churchill went to Chartwell or elsewhere to lengthen the stride of his political work, but not greatly to reduce its quantity; far from shutting himself off, he persuaded as many as possible of his colleagues and henchmen to visit him, to receive his ever-generous hospitality.\" In January 1928, James Lees-Milne stayed as a guest of Churchill's son Randolph. He described an evening after dinner; \"We remained at that round table till after midnight. Mr Churchill spent a blissful two hours demonstrating with decanters and wine glasses how the Battle of Jutland was fought. He got worked up like a schoolboy, making barking noises in imitation of gunfire, and blowing cigar smoke across the battle scene in imitation of gun smoke\". On 26 September 1927, Churchill composed the first of his Chartwell Bulletins, which were lengthy letters to Clementine, written to her while she was abroad. In the bulletins, Churchill described in great detail the ongoing works on the house and the gardens, and aspects of his life there. The 26 September letter opens with a report of Churchill's deepening interest in painting; \"Sickert arrived on Friday night and we worked very hard at various paintings ... I am really thrilled ... I see my way to paint far better pictures than I ever thought possible before\"."]}, {"page": "Winnaretta Singer", "response": ["Polignac had a relationship with painter Romaine Brooks, which had begun in 1905, and which effectively ended her affair with Olga de Meyer, who was married at the time and whose godfather (and purported biological father) was Edward VII. Composer and conductor Ethel Smyth fell deeply in love with her during their affair. In the early 1920s, Polignac became involved with pianist Renata Borgatti. From 1923 to 1933, her lover was the British socialite and novelist Violet Trefusis, with whom she had a loving but often turbulent relationship. Alvilde Chaplin, the future wife of the author James Lees-Milne, was involved with Singer from 1938 to 1943; the two women were living together in London at the time of Winnaretta's death. In addition, she had an affair with Virginia Woolf."]}, {"page": "Burlington House", "response": ["Campbell's work closely followed the form of the previous building and reused much of the structure, but the conventional front (south) façade was replaced with an austere two-storey composition, taking Palladio's Palazzo Iseppo di Porti in Vicenza for a model\"A fairly faithful transcript\", according to James Lees-Milne, The Earls of Creation, 1962:99; Leoni had provided an engraving; Campbell had already used the scheme in a design dedicated to Lord Islay in his Vitruvius Britannicus. but omitting sculpture and substituting a balustrade for the attic storey. The ground floor became a rusticated basement, which supported a monumental piano nobile of nine bays. This had no centrepiece but was highlighted by venetian windows in the projecting end bays, the first to be seen in England. Other alterations included a monumental screening gateway to Piccadilly and the reconstruction of most of the principal interiors, with typical Palladian features such as rich coved ceilings."]}, {"page": "Clandon Park House", "response": ["Historian James Lees-Milne described the house in 1942 as \"dirty and in decay\", and Merlin Waterson, former director of historic properties at the National Trust, said it was \"much depleted when it came to the Trust\". Its state rooms were almost empty, but as well as many paintings and items of furniture belonging to the Onslow family, the house also contained some 18th-century porcelain, textiles and furniture donated by Hannah Gubbay, a member of the Sassoon family."]}, {"page": "Farnley Hall, North Yorkshire", "response": ["Farnley Hall is a stately home in Farnley, North Yorkshire, England. It is located near Otley. The original early seventeenth-century house was added to in the 1780s by John Carr, who also designed Harewood House.James Lees-Milne, Ancestral Voices, London: Chatto & Windus, 1975, p. 103 The hall is now a Grade I listed building."]}, {"page": "Ham House", "response": ["In 1943, Sir Lyonel invited the National Trust's first Historic Buildings Secretary, James Lees-Milne, to visit the house. Lees-Milne saw the neglected state of the house and grounds but, even though devoid of its contents, the historical importance of the underlying estate was immediately apparent. He recorded his impressions in his diary for 1947, extracts from which were later reproduced in the volume Some Country Houses and their Owners: \"The grounds are indescribably overgrown and unkempt. All the rooms are dirty and dusty. The garden and front doors look as they had not been used for decades.\" Despite the neglect, a report commissioned by Lees-Milne in 1946 concluded that it was \"by far the finest, most valuable and most representative building of the period to which it belongs in the United Kingdom\". Following lengthy negotiations, Sir Lyonel and his son donated the house and its grounds to the Trust in 1948. The stables and other outlying buildings were sold privately and much of the remaining estate was auctioned in 1949."]}, {"page": "Long Crichel", "response": ["Long Crichel House, the Grade II listed Georgian rectory, was bought jointly in 1945 by Edward Sackville-West, the music critic Desmond Shawe-Taylor and artist and art dealer Eardley Knollys,Fight for your rights - Friends of Friendless Churches. Retrieved 8 October 2020 who along with architectural historian James Lees-Milne, literary critic Raymond Mortimer and the gay activist and eye surgeon Patrick Trevor-Roper, established \"one of the last great post-war salons, hosting guests including Sibyl Colefax, Anthony Asquith, Graham Sutherland, Lord Berners, Nancy Mitford, Benjamin Britten, Laurie Lee, Ben Nicolson, Cecil Day-Lewis and Graham Greene.\" Somerset Maugham and E.M. Forster were also visitors."]}, {"page": "Venetian window", "response": ["Palladio used the motif extensively, most notably in the arcades of the Basilica Palladiana in Vicenza. It is also a feature of his entrance to Villa Forni Cerato. It is perhaps this extensive use of the motif in the Veneto that has given the window its alternative name of the Venetian window; it is also known as a Serlian window. Whatever the name or the origin, this form of window has probably become one of the most enduring features of Palladio's work seen in the later architectural styles evolved from Palladianism.Andrea Palladio, Caroline Constant. The Palladio Guide. Princeton Architectural Press, 1993. p. 42. According to James Lees-Milne, its first appearance in Britain was in the remodeled wings of Burlington House, London, where the immediate source was actually in Inigo Jones's designs for Whitehall Palace rather than drawn from Palladio himself.\"The earliest example of the revived Venetian window in England\", Lees-Milne, The Earls of Creation, 1962:100.", "A variant, in which the motif is enclosed within a relieving blind arch that unifies the motif, is not Palladian, though Burlington seems to have assumed it was so, in using a drawing in his possession showing three such features in a plain wall (see illustration of Claydon House right). Modern scholarship attributes the drawing to Scamozzi. Burlington employed the motif in 1721 for an elevation of Tottenham Park in Savernake Forest for his brother-in-law Lord Bruce (since remodelled). Kent picked it up in his designs for the Houses of Parliament, and it appears in Kent's executed designs for the north front of Holkham Hall.James Lees-Milne 1962:133f."]}, {"page": "The Ritz Hotel, London", "response": ["Edvard Beneš would entertain guests at a private luncheon at the hotel several times a week during the war years. In 1942, Winston Churchill, Dwight Eisenhower and Charles de Gaulle met in the Marie Antoinette suite of the hotel to discuss operations, Brendan Bracken, who served as an observer and mouthpiece on political society in London, and Anglo-American politician Ronald Tree spent much time at the Ritz, and Tree lived there during the winter of 1940.  Laura Long, who would later become Laura Spencer-Churchill, Duchess of Marlborough, the second wife of John Spencer-Churchill, 10th Duke of Marlborough, the architectural writer James Lees-Milne, Harold Acton and writer Norman Douglas were regular diners at the Ritz during wartime."]}, {"page": "George Lloyd, 1st Baron Lloyd", "response": ["George Ambrose Lloyd, 1st Baron Lloyd,James Lees-Milne, Ancestral Voices, London:Chatto & Windus, 1975, p. 6, n. 1  (19 September 1879 – 4 February 1941) was a British Conservative politician strongly associated with the \"Diehard\" wing of the party. From 1937 to 1941 he was chairman of the British Council, in which capacity he sought to ensure support for Britain's position in the Second World War.", "In 1930, Lloyd became president of the Navy League which lobbied the government for to spend more money on the Royal Navy and was a member of the India Defence League, which lobbied the government not to grant home rule to India. During the 1930s he was one of the most prominent opponents of proposals to grant Indian Home Rule, working alongside Winston Churchill against the National Government. From 1931 to 1935 Lord Lloyd employed James Lees-Milne as one of his male secretaries. He was suspicious of Adolf Hitler and the Nazi movement, which he saw as a threat to Britain.Michael Bloch, biography of James Lees-Milne, page 57, 2009 He was agitating for rearmament against Germany as early as 1930, before Churchill did.Lord Lloyd and the decline of the British Empire J Charmley, pp. 1, 2, 213ff. "]}, {"page": "Lansdown Crescent, Bath", "response": ["* James Lees-Milne Diarist, writer, architecture scholar"]}, {"page": "Tom Bridges", "response": ["Bridges was born at Park Farm, Eltham, Kent, England, to Major Thomas Walker Bridges and Mary Ann Philippi. He was educated at Newton Abbot College and later at the Royal Military Academy, Woolwich. He was married in London on 14 November 1907, to a widow, Janet Florence Marshall; they had one daughter, Alvilde Bridges, who was married first to Anthony Chaplin, 3rd Viscount Chaplin, and then to James Lees-Milne.Lt.-Gen. Sir George Tom Molesworth Bridges – The Peerage, page 4570Bloch, Michael (2013-08-06). James Lees-Milne: The Life (Kindle Locations 3174–3175)."]}, {"page": "Alan Lennox-Boyd, 1st Viscount Boyd of Merton", "response": ["According to many sources Lennox-Boyd was gay.Double lives – a history of sex and secrecy at Westminster, The Guardian, 16 May 2015Covent Garden: The Untold Story : Dispatches from the English Culture War 1945–2000, Norman Lebrecht, UPNE, 2001, page 174 He is depicted in James Lees-Milne's diary of 1942–1943, Ancestral Voices, as being infatuated with the American aesthete Stuart Preston.Lees-Milne, James. \"Ancestral Voices\". London: Faber and Faber (1984), , pp. 173–182. His passionate gay love affairs (and their recklessness), are revealed in Channon's diaries.Heffer, Simon. \"Henry 'Chips' Channon: The Diaries, 1938-1843\". London: Hutchinson (2021), ISBN 0781786331823. Historian and biographer Michael Bloch describes the former regent and Crown Prince of Iraq, Abd al-Ilah, as being homosexual and a \"close friend\" of Lennox-Boyd. Bloch writes that after Abd al-Ilah was killed during the 1958 anti-Hashemite revolt, \"the revolutionaries discovered intimate letters from Lennox-Boyd among the Prince's papers, which they released to the world's press.\"Bloch, Michael (2015). Closet Queens. Little, Brown. ISBN 1408704129. Page 157"]}, {"page": "Henry Somerset, 10th Duke of Beaufort", "response": ["Among the Duke's myriad personal friends was David Niven;Beaufort, Henry, Duke of, Memoirs, Country Life, London, 1981, Pg154 during World War II he hosted Eleanor Roosevelt and Haile Selassie at Badminton. James Lees-Milne, the conservationist, rented a house next door and records their poor relationship in his celebrated diaries—he thought the Duke was \"feudal\". He was \"a legendary womaniser\" who conducted affairs with, among others, Lavinia, Duchess of Norfolk and Sally, Duchess of Westminster, a cousin of his wife's.The Daily Telegraph "]}, {"page": "Alexander Mountbatten, 1st Marquess of Carisbrooke", "response": ["According to the published diaries of Cecil Beaton, in his later years Lord Carisbrooke had a longtime male lover, Simon Fleet. More is written about Lord Carisbrooke and his wife in the published diaries of James Lees-Milne."]}, {"page": "Osbert Lancaster", "response": ["At the age of seventeen Lancaster passed his final school examinations and gained entrance to Lincoln College, Oxford, to study history. He persuaded his mother to allow him to leave Charterhouse at once, giving him several months between school and university, during which he enrolled on a course of life classes at the Byam Shaw School of Art in London.Knox, p. 22 In October 1926 he started at Oxford. There, as at Charterhouse, he found two camps in which some students chose to group themselves: the \"hearties\" presented themselves as aggressively heterosexual and anti-intellectual; the \"aesthetes\" had a largely homosexual membership.Catto, Evans and McConica, pp. 98–99 Lancaster followed his elder contemporary Kenneth Clark in being contentedly heterosexual but nonetheless one of the aesthetes, and he was accepted as a leading member of their set.Clark, pp. 73–74; and Boston, p. 54 He cultivated the image of an Edwardian dandy, with large moustache, a monocle and check suits, modelling his persona to a considerable degree on Beerbohm, whom he admired greatly.Boston, pp. 53–54 He also absorbed some characteristics of the Oxford don Maurice Bowra; Lancaster's friend James Lees-Milne commented, \"Bowra's influence over Osbert was marked, to the extent that he adopted the guru's booming voice, explosive emphasis of certain words and phrases, and habit in conversation of regaling his audiences with rehearsed witticisms and gossip.\" Lancaster's undergraduate set included Stephen Spender, Randolph Churchill, and most importantly John Betjeman, who became a close friend and lifelong influence.Boston, p. 59"]}, {"page": "Alderley, Gloucestershire", "response": ["* Alderley Grange was rebuilt, probably by a Bristol architect, about 1760; it occupies the site of an earlier house where Sir Matthew Hale (jurist) was born. It was the home of James Lees-Milne, the architectural writer and memoirist, and his wife Alvilde Chaplin, who created a much-admired garden."]}]}}