{"wiki_id": "http://www.wikidata.org/entity/Q6138997", "itemLabel": "James Martin Charlton", "itemDescription": "British director, writer and filmmaker", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Martin_Charlton", "wikipedia_page": {"main": "James Martin Charlton (born 29 July 1966) is an English playwright, theatre director and filmmaker. He was born in Romford, Greater London, United Kingdom in 1966.", "link_mentions": [{"page": "Keir Hardie", "response": ["In August 2016, Jim Kenworth's play A Splotch of Red: Keir Hardie in West Ham was premiered at various venues in Newham, including Neighbours Hall in Canning Town at which Hardie spoke. The play deals with Hardie's battle to win the constituency of West Ham South. It was directed by James Martin Charlton; Samuel Caseley played Keir Hardie."]}, {"page": "List of British playwrights since 1950", "response": ["*James Martin Charlton"]}, {"page": "Paul Danan", "response": ["On stage, Danan played \"the Monster\" in Desires of Frankenstein by James Martin Charlton at the 2002 Edinburgh Festival Fringe."]}, {"page": "Jason Orange", "response": ["Orange appeared in the 1998 Lynda La Plante television crime drama Killer Net in 1998, for which his appearance was a major selling point. The following year he was in the London stage production of Gob in 1999. He was the lead actor together with Tom Hayes in the play, which was written by Jim Kenworth, and directed by James Martin Charlton."]}, {"page": "Nicola Duffett", "response": ["Duffett had a supporting role in the Oscar-winning film Howards End (1992) by James Ivory. She is known for two long-running soap opera roles.  After appearing as Debbie Bates in EastEnders from 1993 to 1995, she went into the role of boozy floozie Cat Matthews in Family Affairs. Cat first appeared in Family Affairs in late 1998, and was a key character in the show's story lines until the series ended in December 2005. She has appeared on stage in Simon Gray's Simply Disconnected at Chichester Festival Theatre; as Titania in A Midsummer Night's Dream and Helen of Troy in Troilus and Cressida at the Open Air Theatre, Regent's Park; and in Coming Up by James Martin Charlton at the Warehouse Theatre."]}, {"page": "List of people associated with Middlesex University", "response": ["* James Martin Charlton (Creative Writing)"]}, {"page": "Stephen Henry", "response": ["Henry's Oxford Playhouse revival of Another Country, by Julian Mitchell, reopened the Arts Theatre in the West End where he also developed a new transgender themed play by Sam McCartney, Body Language (Being Olivia). Other projects include the controversial play tackling the subject of pedophilia, ecstasy + GRACE by James Martin Charlton, at the Finborough Theatre, London where he produced Pains of Youth by Ferdinand Bruckner starring Stephen Billington, Stevie Jay in Life, Love and other works in progress and a new play exploring the subject of dementia, The Silent Treatment by Chris Pickles. He directed rehearsed workshops of Fuddy Meers by David Lindsay-Abaire for the National Theatre Studio and Southwark Playhouse and The Lightning Child by Elizabeth Hopley at The Old Vic."]}, {"page": "James Charlton", "response": ["* James Martin Charlton (born 1966), English playwright and theatre director"]}, {"page": "William Traylor", "response": ["During that production Traylor had a problematic and apparently sexual relationship with Coward, which caused them both anguish, and resulted in an apparent suicide attempt by Traylor. The run of show ended soon after, and the company dispersed.Hoare, Phillip. Noel Coward: A Biography of Noel Coward. Simon and Schuster (2013) . Coward, Noel. Coward Plays: 6: Semi-Monde; Point Valaine; South Sea Bubble; Nude With Violin. World Classics. (2013)   In 2013, British playwright, James Martin Charlton, used this episode as the basis for a fictionalized theatrical dramatization, entitled Coward. According to the press and the reviews of the production, the names of the characters, and the setting, and the period were all changed in the manner of a roman à clef, and none of the fictional characters were portrayed in an especially positive light by the playwright.Wainwright, Jon. \"Coward – White Bear Theatre, London.\" The Public Reviews. October 25, 2013."]}, {"page": "Warehouse Theatre", "response": ["The South London Playwriting Festival quickly became the International Playwriting Festival, reflecting the number of entries from all over the globe. Finalists included playwrights from the United States, Trinidad and Tobago, Australia and Bulgaria, with the 1994 winner, Dino Mahoney, being half Irish, half Greek, living in Hong Kong. Mahoney's selected play Yo Yo had its premiere in April 1995. In 1996, the Warehouse Theatre inaugurated a partnership with the leading Italian playwriting festival, the Premio Candoni Arta Terme and in 1999 a partnership was also formed with Theatro Ena in Cyprus providing selected writers with a window for further productions in Europe. The new writers discovered by the festival, including James Martin Charlton, Sheila Dewey, Richard Vincent, Mark Norfolk, Maggie Nevill and Roumen Shomov have gone on to further productions, radio and screen contracts."]}]}}