{"wiki_id": "http://www.wikidata.org/entity/Q6130895", "itemLabel": "James Calvert Spence", "itemDescription": "British paediatrician", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Calvert_Spence", "wikipedia_page": {"main": "Sir James Calvert Spence,  & Bar (19 March 1892 – 26 May 1954) was an English paediatrician who was a pioneer in the field of social paediatrics. He was a founding member of the British Paediatric Association.", "link_mentions": [{"page": "Amble", "response": ["*Sir James Calvert Spence (1892–1954) - nutritionist and paediatrician ", "*James Calvert Spence College"]}, {"page": "James Spence", "response": ["* James Calvert Spence (1892–1954),  British paediatrician"]}, {"page": "Sir James Calvert Spence", "response": ["#REDIRECT James Calvert Spence"]}, {"page": "Calvert (name)", "response": ["* James Calvert Spence (1892–1954), English paediatrician"]}, {"page": "Lartington Hall", "response": ["of Brough Hall married Anna Anastasia, the Maire heiress. Their grandson Henry Thomas Maire Silvertop, who inherited the estate, married Eliza Witham and changed his surname to Witham. As Henry Witham he was High Sheriff of Durham in 1844. His fourth son Right Reverend Monsignor Thomas Edward Witham lived in the Hall from 1847 until his death in 1897 when the estate passed to his grandnephew Francis Silvertop of Minsteracres, who sold it out of the family in 1911 to architect David Magnus Spence, father of renowned social paedriatrician James Calvert Spence. The house was sold again in 1919. In subsequent years the house was let to Richard Forster Matthews and then to his nephew Frederick Berkley-Matthews."]}, {"page": "List of people from Northumberland", "response": ["* James Calvert Spence (1892–1954), paediatrician"]}, {"page": "Douglas Gairdner", "response": ["He became first assistant in the paediatric department at Newcastle where he began to work under Professor Sir James Calvert Spence in 1945. In 1948, he became a consultant paediatrician at Addenbrooke's Hospital, Cambridge, and associate lecturer in paediatrics at the University of Cambridge, where he remained until his retirement in 1975."]}, {"page": "1950 Birthday Honours", "response": ["*Professor James Calvert Spence, MC, MD, DSc, FRCP, Professor of Child Health, University of Durham."]}, {"page": "James Calvert Spence College", "response": ["James Calvert Spence College is a coeducational community school and sixth form located in Amble in the English county of Northumberland. The school is named after Sir James Calvert Spence, a decorated war hero and paediatrician.", "James Calvert Spence College offers GCSEs and BTECs as programmes of study for pupils, while students in the sixth form have the option to study from a range of A-levels and further BTECs.", "*James Calvert Spence College official website"]}, {"page": "Leonard B. Strang", "response": ["Strang was born in Scotland to father who was from farming family in East Kilbride and a mother from the Don Valley of Aberdeen. The family relocated to England when he aged five. He was the youngest of three siblings, all of whom pursued careers in medicine. Strang's formative influence in early life was the paediatrician James Calvert Spence. Strang had been Spence's patient, when at the age of 10, he suffered from septicaemia following a bought Mastoiditis,  which destroyed both his hips, and left his legs weakened causing him to walk with shoulder crutches and then walking sticks for the rest of his life. This was in the time before antibiotics meaning surgery was required in an attempt to repair and correct the damage. Following the large number of surgeries left Strang with a deep understanding of doctor patient divide and following months of convalescence enabled him to read widely.", "Strang was educated at the Royal Grammar School, Newcastle. Strang gained his MB BS from Durham University in 1949. Strang undertook his postgraduate training in paediatrics at the Royal Victoria Infirmary in Newcastle, in the department founded by James Calvert Spence, a supreme clinician. It was during the seven years period while he was at the infirmary working under Spence, that Strang's talent as a clinical researcher emerged and the first initial research efforts into harlequinism and of catecholamine secretion in neuroblastoma emerged."]}, {"page": "Tina Cooper", "response": ["Cooper began her medical career at London's Royal Free Hospital as a house physician, a house officer in obstetrics, and first assistant in the paediatric department. She received a diploma in child health in 1948 and moved to Newcastle the following year to join James Calvert Spence as a paediatric registrar at Newcastle General Hospital. She was appointed consultant in 1952, and held the role until her retirement in 1983. From 1964, she spent two years in Sierra Leone advising the government on child health policy, which included establishing a national immunisation programme against measles and other childhood infections. She was awarded an OBE in 1967 for her services to children's health in Sierra Leone, and elected Fellow of the Royal College of Physicians in the same year."]}, {"page": "James Spence Medal", "response": ["James Spence Medal is a medal that was first struck in 1960, six years after the death of the paediatrician James Calvert Spence and is awarded for outstanding contributions to the advancement or clarification of paediatric knowledge and is the highest honour bestowed by The Royal College of Paediatrics and Child Health."]}, {"page": "Ronald MacKeith", "response": ["In 1972 he was awarded the James Spence Medal gold medal named in honour of the war paediatrician Professor Sir James Calvert Spence. In 1974 he received the Rosén von Rosenstein Medal of the Swedish Paediatric Association, named after the Swedish pioneer in paediatrics, Nils Rosén von Rosenstein. In 1975 he was awarded the Special Merit Award of the American Academy for Cerebral Palsy. MacKeith was awarded the Albrecht von Haller Medal from the University of Göttingen, that is named after the Albrecht von Haller, the father of modern physiology."]}, {"page": "Donald Court", "response": ["Court was awarded a Commander of the Most Excellent Order of the British Empire (CBE) in 1969. In 1978 was awarded the prestigious James Spence Medal of the BPA, named in honour of his old colleague, James Calvert Spence. Professor Otto Wolff, spoke of the citation when awarding the medal to court,  Wolff stated:"]}, {"page": "Dermod MacCarthy", "response": ["In 1982, MacCarthy received the prestigious James Spence Medal,  named after Professor Sir James Calvert Spence, and is the highest award of the British Paediatric Association."]}, {"page": "Platt Report 1959", "response": ["However, there were dissenting voices, both for those who had started to question the tenets of behaviourism, and those who already recognized the unique link between the child and their mother, who would nurse them in times of ill health and who always felt responsible for the child's recovery. Sir James Calvert Spence began the practice, then unique in Britain, of admitting mothers to hospital with their sick children, so that they might nurse them and feel responsible for the child's recovery. However, as a visionary, Spence was unique in this position, during that period in the 1920s, when he established his resident mother and baby unit in 1926. By the 1930s there was physicians who recognised the need, including Agnes Hunt, who introduced open visiting."]}, {"page": "Kenneth Cross (physiologist)", "response": ["On 28 March 1979 Cross was awarded the James Spence Medal, named after Professor Sir James Calvert Spence, and is the highest award of the British Paediatric Association."]}, {"page": "John Webb (paediatrician)", "response": ["Having undertaken his medical training at the Radcliffe Infirmary, Webb enlisted in the British Army during the Second World War, being enlisted as a second lieutenant in the Royal Army Medical Corps in October 1942. Following the war, he served as a graded physician in the British Army of the Rhine from 1945–47. He was demobilised in 1948, returning to Oxford where he was children's registrar at Churchill Hospital until 1950, before moving to Newcastle to train in paediatrics under James Calvert Spence at the Royal Victoria Infirmary. "]}]}}