{"wiki_id": "http://www.wikidata.org/entity/Q6136025", "itemLabel": "James Higgins", "itemDescription": "footballer (1874-?)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Higgins_(footballer)", "wikipedia_page": {"main": "James Higgins (1874 – after 1899) was an English professional footballer who played in the Football League for Small Heath. Born in Cradley Heath, Staffordshire, Higgins played local football for Stourbridge before joining Small Heath in 1897. A centre forward, he made his debut in the Second Division on 2 April 1898 in a 2–1 win at Luton Town. He kept his place for the remaining five games of the 1897–98 season, and scored three goals, but when the club signed Bob McRoberts he decided his future lay back in non-league football.", "link_mentions": [{"page": "James Higgins", "response": ["James Higgins may refer to:", "*James Higgins (Australian cricketer) (1874–1957), Australian cricketer", "*James Higgins (English cricketer) (1877–1954), English cricketer", "*James Higgins (footballer) (1874–?), English footballer", "*James Higgins (rugby league) (born c.1922), rugby league footballer of the 1940s for Wakefield Trinity", "*James Higgins (Wisconsin politician) (1824–1910), member of the Wisconsin legislature"]}, {"page": "1897–98 Small Heath F.C. season", "response": ["On a fine April day, Ike Webb made his debut in goal away to Luton Town, where Jimmy Inglis scored the decisive goal for Small Heath in the second half.\"Luton v. Small Heath\". The Standard (London): p.8. 4 April 1898. Visiting Newton Heath, Small Heath won the toss, and elected to play with the benefit of the wind behind them. They soon opened the scoring, James Higgins reacting to a shot parried by the goalkeeper, but by half time the home team had regained the lead. On change of ends, Newton Heath had much of the play, and eventually increased their lead through a Matthew Gillespie tap-in. The Manchester club's goalkeeper had no shot to save in the second half.\"Newton Heath v. Small Heath\". Manchester Guardian: p.3. 11 April 1898. On a wet pitch at Manchester City's Hyde Road ground, the scoring alternated. Clutterbuck, back in goal after two games out, got a hand to Billy Meredith's shot but failed to stop it, Abbott equalised, then Stockport Smith converted a penalty awarded for handball. Leake scored from distance, then Clutterbuck parried a Meredith shot to Smith's feet. In the second half, the surface became increasingly slippery, the play correspondingly scrappy, and Michael Good tied the scores from a free kick.\"Manchester City v. Small Heath\". Manchester Guardian: p.7. 12 April 1898. Higgins' goal settled the meeting at home to Newcastle United, who had already made sure of their position in the promotion test matches.\"Small Heath v. Newcastle United\". The Morning Post (London): p.3. 13 April 1898. In \"weather of almost summer warmth and brightness\" at home to Lincoln City,\"League. Division II\". The Bristol Mercury: p.3. 18 April 1898. four different scorers gave the Heathens a 4–0 win.\"Small Heath v. Lincoln City\". The Standard (London): p.3. 18 April 1898. The competitive season ended with a home win, Abbott scoring twice to Woolwich Arsenal's single reply.\"Small Heath v. Woolwich Arsenal\". The Standard (London): p.3. 25 April 1898."]}]}}