{"wiki_id": "http://www.wikidata.org/entity/Q6136544", "itemLabel": "James Iles", "itemDescription": "English cricketer (born 1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Iles", "wikipedia_page": {"main": "James Alexander Iles (born 11 February 1990) is a former English professional cricketer. He played twice for Kent County Cricket Club.\nBorn in Chatham, Medway and educated at Maidstone Grammar School, Iles signed for Kent as an academy scholar in 2005, having played age-group cricket for Kent since under-13 level. Despite only making two appearances for the academy side and none for the county's second eleven, he made his first-class cricket debut against Cambridge University in May 2006. Iles was 16 years and 95 days old on his debut and became Kent's youngest ever cricketer, beating Wally Hardinge's record which had stood since the 1902 season.He made his List A cricket debut the following season in a match against the touring Sri Lanka A side. In the match, which was later abandoned due to rain, Iles bowled six overs taking the wicket of opening batsman Dilruwan Perera.These were Iles' only First XI appearances for Kent, although he continued to play Second XI cricket into the 2008 season. He also played rugby, representing Kent for three years.", "link_mentions": [{"page": "List of Kent County Cricket Club players", "response": ["* James Iles (2006–2008) : J. A. Iles "]}, {"page": "Kent County Cricket Club in 2009", "response": ["|James Iles ||  ||  || Right-handed || Right arm medium-fast ||"]}, {"page": "Iles", "response": ["*James Iles (born 1990), English cricketer"]}, {"page": "Kent County Cricket Club in 2008", "response": ["|James Iles ||  ||  || Right-handed || Right arm medium-fast ||"]}, {"page": "Kent County Cricket Club in 2007", "response": ["|James Iles ||  ||  || Right-handed || Right arm medium-fast ||", "|align=\"left\"|James Iles", "|align=\"left\"|James Iles"]}, {"page": "Iles, James", "response": ["#redirectJames Iles"]}]}}