{"wiki_id": "http://www.wikidata.org/entity/Q6137309", "itemLabel": "James Kilfedder", "itemDescription": "British politician (1928-1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Kilfedder", "wikipedia_page": {"main": "Sir James Alexander Kilfedder (16 July 1928 – 20 March 1995), usually known as Sir Jim Kilfedder, was a Northern Ireland unionist politician.\n\n", "link_mentions": [{"page": "County Leitrim", "response": ["*James Kilfedder (1928-1995) Unionist Politician and former MP for North Down (UK Parliament constituency)"]}, {"page": "1992 United Kingdom general election", "response": ["The election also saw a small change in Northern Ireland: the Conservatives organised and stood candidates in the constituent country for the first time since the Ulster Unionist Party had broken with them in 1972 over the Sunningdale Agreement. Although they won no seats, their best result was Laurence Kennedy achieving over 14,000 votes to run second to James Kilfedder in North Down."]}, {"page": "List of political parties in the United Kingdom", "response": ["| James Kilfedder"]}, {"page": "Peter Tatchell", "response": ["Some OutRage! activities were highly controversial. In 1994, it unveiled placards inviting ten Church of England bishops to \"tell the truth\" about what Outrage! alleged was their homosexuality and accusing them of condemning homosexuality in public while leading secret gay lives. Shortly afterwards the group wrote to twenty UK MPs, condemning their alleged support for anti-gay laws and claiming they would out them if the MPs did not stop what they described as attacks on the gay community. The MP Sir James Kilfedder, one such opponent of gay equality, who had received one of the letters, died two months later of a sudden heart attack on the day one of the Belfast newspapers planned to out him. In a comment in The Independent in October 2003, Tatchell claimed the OutRage! action against the bishops was his greatest mistake because he failed to anticipate that the media and the church would treat it as an invasion of privacy."]}, {"page": "List of political parties in Northern Ireland", "response": ["|James Kilfedder ||15y ||Ulster Popular Unionist Party 1980–1995 ||North Down"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Sir James Kilfedder"]}, {"page": "Robert McCartney (Northern Irish politician)", "response": ["He was initially a member of the Ulster Unionist Party (UUP) but was expelled in June 1987 when he refused to withdraw from the general election of that year. He stood against the incumbent Popular Unionist Party MP Sir James Kilfedder in North Down as a \"Real Unionist\" but failed to win the seat."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|James Kilfedder"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|James Kilfedder"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|James Kilfedder"]}, {"page": "List of MPs elected in the October 1974 United Kingdom general election", "response": ["|James Kilfedder", "*1977: James Kilfedder (North Down) left the Ulster Unionist Party and sat as an independent unionist."]}, {"page": "List of United Kingdom MPs: K", "response": ["* James Kilfedder"]}, {"page": "OutRage!", "response": ["In January 1995 OutRage! had sent 20 Members of Parliament known or believed to be gay letters inviting them to come out. On 20 March the Belfast Telegraph carried the story that one of the MPs was from Northern Ireland, widely assumed to be James Kilfedder. That day he died suddenly of a heart attack. The press immediately assumed that the death and the letter were linked and some of the fiercest denunciations of OutRage! were written."]}, {"page": "Ulster Popular Unionist Party", "response": ["The Ulster Popular Unionist Party (UPUP) was a unionist political party in Northern Ireland. It was founded in 1980 by James Kilfedder, independent Unionist Member of Parliament for North Down, who led the party until his death in 1995. For a brief period in 1980, it was known as the Ulster Progressive Unionist Party before it adopted the \"Popular\" name."]}, {"page": "List of MPs elected in the February 1974 United Kingdom general election", "response": ["|James Kilfedder"]}, {"page": "1979 European Parliament election in the United Kingdom", "response": ["| align=\"left\" |James Kilfedder"]}, {"page": "List of United Kingdom by-elections (1979–2010)", "response": ["There were 18 by-elections in the 1992–1997 Parliament. Eight were in seats held by the governing Conservative party, nine by Labour and one by the Ulster Popular Unionist Party. Nine by-elections were won by the incumbent party, all of which happened to be Labour. The Conservatives lost all eight seats in the by-elections - four to the Liberal Democrats, three to Labour and one to the SNP. The UK Unionist Party gained North Down from the Ulster Popular Unionists. 16 by-elections were a result of the death of the incumbent MP - eight Conservatives died, along with seven Labour MPs and the Ulster Popular Unionist MP Sir James Kilfedder.", "|Sir James Kilfedder", "|James Kilfedder", "|James Kilfedder"]}, {"page": "Belfast West (UK Parliament constituency)", "response": ["| James Kilfedder"]}, {"page": "North Down (UK Parliament constituency)", "response": ["The parliamentary constituency was original held by the Ulster Unionist Party with no serious opposition. In 1970 James Kilfedder was first elected and he proceeded to accumulate a high level of personal popularity in the constituency. In 1977 he left the Ulster Unionists in protest over their increasing support for Enoch Powell's proposed policy of integration for Northern Ireland, rather than the restoration of devolved government. Standing as an independent Unionist, Kilfedder successfully defended his seat against a UUP challenge in the 1979 general election. The following year he formed the Ulster Popular Unionist Party, with a few local councillors being elected on the label.", "|rowspan=\"3\"| James Kilfedder"]}, {"page": "Elections in Northern Ireland", "response": ["|James Kilfedder", "|James Kilfedder", "|Sir James Kilfedder"]}, {"page": "Harry West", "response": ["The 1979 general election was relatively disappointing for the Ulster Unionists, as they won only five of the province's twelve constituencies.  In June 1979 West stood as one of two candidates in the first elections to the European Parliament.  However he was unsuccessful in the Single Transferable Vote constituency for the entire province and had the personal humiliations of seeing rival DUP leader Ian Paisley top the poll, fellow Ulster Unionist John Taylor win one of the seats and former Ulster Unionist member James Kilfedder performing better than West to become runner up. West resigned shortly afterwards."]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| James Kilfedder"]}, {"page": "Kinlough", "response": ["* James Kilfedder (16 July 1928 – 20 March 1995) was a Northern Ireland unionist politician."]}, {"page": "List of MPs elected in the 1964 United Kingdom general election", "response": ["| James Kilfedder"]}, {"page": "Harry Diamond (politician)", "response": ["In 1964, Diamond joined with Gerry Fitt to found the Republican Labour Party. He stood for the Westminster constituency of Belfast West in the October 1964 general election, but was defeated by James Kilfedder. The campaign was disfigured by riots after Ian Paisley attempted to lead a Unionist crowd up Divis Street to remove an Irish tricolour from the offices of Sinn Féin, who were supporting the candidacy of Billy McMillen. The riots galvanised the Unionist vote while the nationalist vote was split between Diamond and McMillen. Diamond alleged that the official Ulster Unionist Party had colluded in this."]}, {"page": "Northern Ireland Constitutional Convention", "response": ["* James Kilfedder – UUP"]}, {"page": "List of UK minor party and independent MPs elected", "response": ["| James Kilfedder 2", "| James Kilfedder 2", "| James Kilfedder 2", "| James Kilfedder 2", "| James Kilfedder 2"]}, {"page": "1995 North Down by-election", "response": ["The 1995 North Down by-election, in the North Down constituency, was held on 15 June, following the death of James Kilfedder, who had represented the constituency since the 1970 general election. Kilfedder had formed the Ulster Popular Unionist Party in 1980, but the party disintegrated on his death."]}, {"page": "List of Ulster Unionist Party MPs", "response": ["| rowspan=2 | James Kilfedder"]}, {"page": "March 1995 Ulster Unionist Party leadership election", "response": ["Whilst Molyneaux won by a massive margin, the number of delegates who did not vote for him was seen as a substantial number. Two days later independent North Down MP, Sir James Kilfedder died in London and that the subsequent by-election was not won by the UUP was seen as further evidence of Molyneaux's failings as leader after 15 years. Molyneaux resigned on 28 August and was replaced in September. Reynolds was later elected to Belfast City Council as a member of the DUP."]}, {"page": "Northern Ireland Assembly (1982)", "response": ["*1982–1986 James Kilfedder (Ulster Popular Unionist Party)"]}, {"page": "James Alexander Kilfedder", "response": ["#REDIRECTJames Kilfedder"]}, {"page": "United Kingdom by-election records", "response": ["|James Kilfedder"]}]}}