{"wiki_id": "http://www.wikidata.org/entity/Q6132772", "itemLabel": "James Douglas", "itemDescription": "journalist, born 1867", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Douglas_(journalist)", "wikipedia_page": {"main": "James Douglas (1867–1940) was a British critic, newspaper editor and author.\nDouglas edited The Star from 1908 to 1920, then the Sunday Express until 1931.  He was a supporter of censorship, and called for several books to be banned, most notably The Well of Loneliness.  He was mocked by P. R. Stephensen and Jack Lindsay in The Sink of Solitude (1928).", "link_mentions": [{"page": "Ulysses (novel)", "response": ["The book had its critics, largely in response to its then-uncommon inclusion of sexual elements. Shane Leslie called Ulysses \"literary Bolshevism ... experimental, anti-conventional, anti-Christian, chaotic, totally unmoral\". quote p. 220 Karl Radek called it \"a heap of dung, crawling with worms, photographed by a cinema camera through a microscope\". Virginia Woolf wrote, \"Ulysses was a memorable catastrophe—immense in daring, terrific in disaster.\"Woolf, Virginia (5 April 1923). \"How It Strikes a Contemporary\". The Times Literary Supplement. London. Retrieved 4 September 2018. One newspaper pundit said it contained \"secret sewers of vice ... canalized in its flood of unimaginable thoughts, images, and pornographic words\" and \"revolting blasphemies\" that \"debases and perverts and degrades the noble gift of imagination and wit and lordship of language\".James Douglas of the Sunday Express, quoted in Bradshaw, David, \"Ulysses and Obscenity\", Discovering Literature:  20th century.  British Library.  Retrieved on Bloomsday, 2016."]}, {"page": "Douglas (surname)", "response": ["* James Douglas (composer) (born 1932), Scottish composer", "* James Douglas (actor) (born 1933), American soap opera actor", "* James Douglas (businessman) (1867–1949), Canadian mining engineer and businessman", "* James Douglas Jr. (born 1967), businessman and mining executive in Canada, US and Mexico", "* Admiral James Douglas, (abt 1755–1839), British naval officer", "* Sir James Douglas, Lord of Douglas (James 'the Good', 1286–1330), Scottish soldier and knight in the Scottish wars of independence", "* Sir James Douglas, 1st Baronet (1703–1787), Commodore for Newfoundland and Labrador", "* Lord James Douglas (1617–1645), son of the 1st Marquess of Douglas", "* James Douglas, 2nd Earl of Douglas (1358–1388), influential lord in the Kingdom of Scotland", "* James Douglas, 7th Earl of Douglas (1371–1443)", "* James Douglas, 1st Lord Dalkeith (born after 1372, died before 22 May 1441)", "* James Douglas, 9th Earl of Douglas (1426–1488)", "* James Douglas, 1st Earl of Morton (died 1493)", "* James Douglas, 3rd Earl of Angus (1426)–1446", "* James Douglas, 3rd Earl of Morton (died 1548)", "* James Douglas, 7th Baron Drumlanrig (died 1578), son of the 6th Baron Drumlanrig", "* James Douglas, 4th Earl of Morton (c. 1525 – 1581), younger brother of 7th Earl of Angus; the last of the four regents of Scotland during the minority of King James VI", "* James Douglas, 2nd Marquess of Douglas (1646–1699)", "* James Douglas, 3rd Marquess of Queensberry (1697–1715), lunatic and cannibal", "* James Douglas, Earl of Angus (1671–1692), Scottish nobleman and soldier, son of the previous", "* James Douglas, 2nd Duke of Queensberry and 1st Duke of Dover (1662–1711)", "* James Douglas, 14th Earl of Morton (c. 1703 – 1768)", "* John Douglas, Lord of Balvenie (c. 1433 – 1463),  son of James Douglas, 7th Earl of Douglas ", "* James Douglas-Hamilton, Baron Selkirk of Douglas (briefly 11th Earl of Selkirk) (born 1942), younger son of the 14th Duke of Hamilton and Brandon", "* James Douglas (governor) (1803–1877), Scottish-Canadian governor of the colony of Vancouver Island", "* James Douglas-Hamilton, Baron Selkirk of Douglas (born 1942), Scottish nobleman, Conservative politician", "* James Douglas (Buster Douglas), born 1960), American heavyweight boxer", "* James Douglas (cricketer) (1870–1958), English cricketer", "* James Douglas (physician) (1675–1742), Scottish physician and anatomist", "* James Douglas (journalist) (1867–1940), British newspaper editor, author and critic"]}, {"page": "1928 in literature", "response": ["*November 9–16 – Radclyffe Hall's novel The Well of Loneliness, published on July 27 by Jonathan Cape in London with an appreciation by Havelock Ellis, is tried and convicted at Bow Street Magistrates' Court on the grounds of obscenity under the Hicklin test, for its theme of lesbian love, after a campaign against it by James Douglas in the Sunday Express. The presiding magistrate, Sir Chartres Biron, holds that the book contains \"not one word which suggested that anyone with the horrible tendencies described was in the least degree blameworthy. All the characters in the book were presented as attractive people and put forward with admiration.\" Other lesbian literature published in England this year evades prosecution: Elizabeth Bowen's novel The Hotel, Virginia Woolf's fictional Orlando: A Biography, and Compton MacKenzie's satirical Extraordinary Women. Djuna Barnes' novel Ladies Almanack, published in Paris, also alludes to the controversy."]}, {"page": "James Douglas", "response": ["James Douglas may refer to:", "* James Douglas, 3rd Earl of Angus (1426–1446), Scottish nobleman", "* James Douglas, Earl of Angus (1671–1692), son of the 2nd Marquess of Douglas", "* James Douglas, Lord of Douglas (1286–1330), (\"the Good\", \"the Black\"), Scottish warlord and champion of Robert the Bruce", "* James Douglas, 2nd Earl of Douglas (c. 1358–1388)", "* James Douglas, 7th Earl of Douglas (1371–1443), \"the Gross\"", "* James Douglas, 9th Earl of Douglas (1426–1488), Scottish nobleman", "* Lord James Douglas (1617–1645), son of the 1st Marquess of Douglas", "* James Douglas, 2nd Marquess of Douglas (1646–1700)", "* James Douglas, 1st Earl of Morton (1426–1493)", "* James Douglas, 3rd Earl of Morton (died 1548)", "* James Douglas, 4th Earl of Morton (c. 1516–1581)", "* James Douglas, 10th Earl of Morton (died 1686), Earl of Morton", "* James Douglas, 11th Earl of Morton (died 1715), Earl of Morton", "* James Douglas, 14th Earl of Morton (1702–1768), Scottish astronomer and peer", "* James Douglas, 2nd Earl of Queensberry (died 1671)", "* James Douglas, 4th Duke of Hamilton (1658–1712)", "* James Douglas, 2nd Duke of Queensberry (1662–1711), also 1st Duke of Dover", "* James Douglas, 3rd Marquess of Queensberry (1697–1715), lunatic and cannibal", "* James Douglas-Hamilton, Baron Selkirk of Douglas (born 1942), former MP and MSP, also briefly 11th Earl of Selkirk", "* James Douglas, 1st Lord Mordington (died 1656)", "* James Douglas, 3rd Lord Mordington (1651–?)", "* James Douglas, 7th Baron Drumlanrig (died 1578), Scottish nobleman", "* James Douglas, 1st Lord Dalkeith, Scottish nobleman", "* James Douglas, 4th Baron Douglas (1787–1857)", "* James Douglas Stoddart Douglas (1793–1875), MP for Rochester", "* James Douglas (died 1751), British Member of Parliament for Malmesbury and St. Mawes", "* Sir James Douglas (governor) (1803–1877), governor of Vancouver Island and British Columbia; head of Hudson's Bay Company operations in the Columbia District", "* James Douglas (British Army officer) (1785–1862), British Army officer and Lieutenant Governor of Guernsey", "* James Douglas (Australian politician) (died 1905), New South Wales colonial politician", "* James Douglas (cricketer) (1870–1958), English cricketer", "* Buster Douglas (James Douglas, born 1960), American boxer", "* James Douglas (English Army officer) (died 1691), Colonel of the Scots Regiment of Footguards, a regiment on the establishment of the English Army", "* Sir James Douglas, 1st Baronet (1703–1787), Commodore for Newfoundland and Labrador", "* James Douglas (antiquary) (1753–1819), English clergyman", "* James Douglas (physician) (1675–1742), Scottish anatomist and physician", "* James Douglas (businessman) (1837–1918), Canadian-born U.S. mining engineer, industrialist, and philanthropist", "* James Douglas Jr. (1868–1949), Canadian-American businessman and mining executive", "* James Douglas (composer) (born 1932), Scottish composer", "* James Douglas (journalist) (1867–1940), British newspaper editor, author and critic", "* James Douglas (actor) (1929–2016), American soap opera actor", "* James Douglas (architect), American architect in Wisconsin", "* James Douglas (judge) (born 1950), justice of the Supreme Court of Queensland", "* James Douglass (disambiguation)"]}, {"page": "Daily Express", "response": [":1920: James Douglas", ":1928: James Douglas and John Gordon"]}, {"page": "The Well of Loneliness", "response": ["The novel became the target of a campaign by James Douglas, editor of the Sunday Express, who wrote, \"I would rather give a healthy boy or a healthy girl a phial of prussic acid than this novel.\" A British court judged it obscene because it defended \"unnatural practices between women\".Quotation from Hall, 313. For accounts of the British trial and the events leading up to it, see Souhami, 192–241, and Cline, 225–267. For a detailed examination of controversies over The Well of Loneliness in the 1920s, see chapter 1 of Doan, Fashioning Sapphism. An overview can be found in the introduction to Doan & Prosser, Palatable Poison, which also reprints the full text of several contemporary reviews and reactions, including the Sunday Express editorial and Chief Magistrate Sir Chartres Biron's legal judgement. In the United States the book survived legal challenges in New York state and in Customs Court.A detailed discussion of the US trials can be found in Taylor, \"I Made Up My Mind\".", "thumb|right|James Douglas's editorial in the Sunday Express, 19 August 1928", "James Douglas illustrated his denunciation of The Well with a photograph of Radclyffe Hall in a silk smoking jacket and bow tie, holding a cigarette and monocle. She was also wearing a straight knee-length skirt, but later Sunday Express articles cropped the photo so tightly that it became difficult to tell she was not wearing trousers.Doan, Fashioning Sapphism, 185–191. Hall's style of dress was not scandalous in the 1920s; short hairstyles were common, and the combination of tailored jackets and short skirts was a recognised fashion, discussed in magazines as the \"severely masculine\" look.Doan, Fashioning Sapphism, 114–117 and passim. Some lesbians, like Hall, adopted variations of the style as a way of signalling their sexuality, but it was a code that only a few knew how to read.Langer, 45 and Elliott, 74. With the controversy over The Well of Loneliness, Hall became the public face of sexual inversion, and all women who favoured masculine fashions came under new scrutiny.Doan, Fashioning Sapphism, 27, 193. Lesbian journalist Evelyn Irons – who considered Hall's style of dress \"rather effeminate\" compared to her own – said that after the publication of The Well, truck drivers would call out on the street to any woman who wore a collar and tie: \"Oh, you're Miss Radclyffe Hall\".Doan, Fashioning Sapphism, 113, 123. Some welcomed their newfound visibility: when Hall spoke at a luncheon in 1932, the audience was full of women who had imitated her look.Doan, Fashioning Sapphism, 124–125. But in a study of lesbian women in Salt Lake City in the 1920s and '30s, nearly all regretted the publication of The Well because it had drawn unwanted attention to them.Bullough, 897.", "James Douglas, editor of the Sunday Express, did not agree. Douglas was a dedicated moralist, an exponent of muscular Christianity, which sought to reinvigorate the Church of England by promoting physical health and manliness. His colourfully worded editorials on subjects such as \"the flapper vote\" (that is, the extension of suffrage to women under 30) and \"modern sex novelists\" helped the Express family of papers prosper in the cutthroat circulation wars of the late 1920s. These leader articles shared the pages of the Sunday Express with gossip, murderers' confessions, and features about the love affairs of great men and women of the past.Doan & Prosser, 10–11; Doan, 15."]}, {"page": "1928 in the United Kingdom", "response": ["* 9–16 November – Radclyffe Hall's novel The Well of Loneliness (published on 27 July by Jonathan Cape in London) is tried and convicted on the grounds of obscenity due to its theme of lesbian love, following a campaign by James Douglas in the Sunday Express newspaper."]}, {"page": "Beverley Baxter", "response": ["In 1922 Baxter was appointed the managing editor of the Sunday Express, launched in 1918 by Beaverbrook after he had failed to acquire the Sunday Times, and loss-making for a decade; the editor there was James Douglas.  Under the headline \"Three Nights of Horror\" Baxter reviewed for it in November 1922 a dramatisation of The Secret Agent, which he called \"actionless and unmoving\", and two other plays. "]}, {"page": "1867 in Ireland", "response": ["* 9 February – James Douglas, journalist (died 1940)."]}]}}