{"wiki_id": "http://www.wikidata.org/entity/Q6137372", "itemLabel": "James Kinnier Wilson", "itemDescription": "English assyriologist", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Kinnier_Wilson", "wikipedia_page": {"main": "James V. Kinnier Wilson (born 27 November 1921) is a British Assyriologist. He was Eric Yarrow Lecturer, from 1955 until 1989, and is Emeritus Fellow, Wolfson College, Cambridge.", "link_mentions": [{"page": "1921", "response": ["** James Kinnier Wilson, English assyriologist"]}, {"page": "James Wilson", "response": ["*James Kinnier Wilson (born 1921), British assyriologist"]}, {"page": "1921 in the United Kingdom", "response": ["* 27 November – James Kinnier Wilson, assyriologist "]}, {"page": "Samuel Alexander Kinnier Wilson", "response": ["Samuel Alexander Kinnier Wilson (December 6, 1878 – May 12, 1937) was an American-born British neurologist. His research of hepatolenticular degeneration led the disease to be named after him as Wilson's disease. He was the father of British Assyriologist James Kinnier Wilson."]}, {"page": "List of people with surname Wilson", "response": ["**James Kinnier Wilson (born 1921), British Assyriologist"]}, {"page": "Franz Köcher", "response": ["Ebeling was Köcher’s doctoral advisor for his doctorate, which was awarded in Assyriology, Near Eastern Philology (Orientalische Philologie) and Philosophy in March 1949. The subject of his dissertation was \"Incantations against the demoness Lamaštu\" (Beschwörungen gegen die Dämonin Lamaštu). From May 1949 on, Köcher first worked as a research assistant and later, beginning in October 1952, as a research associate at the Institute for Oriental Studies (Institut für Orientforschung) of the Deutsche Akademie der Wissenschaften zu Berlin. Due to the construction of the Berlin Wall in 1961, he was forced to abandon his work, since he lived in West Berlin and the Akademie was in the east. Because of his relentless work in the years prior to these events, Köcher had already laid the foundations of his afore mentioned magnum opus. His talent for making hand copies of cuneiform tables quickly became apparent when he assisted Erich Ebeling with his volume \"Literarische Keilschrifttexte aus Assur\" in 1953. Köcher was introduced to cuneiform medicine through, among others, the work on Ebeling's \"Keilschrifttexte zur assyrisch-babylonischen Drogen- und Pflanzenheilkunde\" in 1955, which was mostly focused on the pharmacological series URU AN.NA. He kept working on the series even long after his retirement.James Kinnier Wilson: The Assyrian Pharmaceutical Series URU.AN.NA : MAŠTAKAL. In: Journal of Near Eastern Studies Vol. 64, No.1 (January 2005), pp. 45-52"]}]}}