{"wiki_id": "http://www.wikidata.org/entity/Q6135371", "itemLabel": "James Hakewill", "itemDescription": "architect", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Hakewill", "wikipedia_page": {"main": "James Hakewill (1778–1843) was an English architect, best known for his illustrated publications.", "link_mentions": [{"page": "Tatton Park", "response": ["Rostherne Lodge to the west has a hexastyle Greek Doric portico.  Above this is a full entablature with triglyphs and guttae below. The pediment is plain.  The lodge was designed in 1833 by James Hakewill."]}, {"page": "Rose Hall, Montego Bay", "response": ["Rose Hall is widely regarded to be a visually impressive house and the most famous in Jamaica. It is a mansion in Jamaican Georgian style with a stone base and a plastered upper storey, high on the hillside, with a panorama view over the coast. The architect James Hakewill visited the building and wrote:"]}, {"page": "Jamaican art", "response": ["Jamaican art dates back to Jamaica's indigenous Taino Indians who created zemis, carvings of their gods, for ritual spiritual purposes. The demise of this culture after European colonisation heralded a new era of art production more closely related to traditional tastes in Europe, created by itinerant artists keen to return picturesque images of the \"new world\" to Europe. Foremost among these were Agostino Brunias, Philip Wickstead, James Hakewill and J. B. Kidd."]}, {"page": "George Cooke (engraver)", "response": ["Between 1817 and 1833 he produced, in connection with Loddiges of Hackney, London a number of plates for the Botanical Cabinet,'Conrad Loddiges (and sons). The Botanical Cabinet (J. & A. Arch, 1822) and about the same time he engraved some of the plates, after Turner, for Hakewill's Picturesque Tour of Italy, 1820,James Hakewill. A picturesque tour of Italy: from drawings made in 1816-1817 (J. Murray, 1820). and Sir Walter Scott's Provincial Antiquities and Picturesque Scenery of Scotland, 1826,Walter Scott. Provincial antiquities of Scotland, volume II (R. Cadell, 1834). in which latter work should be especially noted \"Edinburgh from the Calton Hill\". To these were added plates for Thomas Allason's Antiquities of Pola, 1819, John Spencer-Stanhope's Olympia, (published by Rodwell and Martin, 1824), and D'Oyly and Mant's Bible,George D'Oyly & Richard Mant. The Holy Bible (Clarendon press, 1818). as well as some of those for John Hughes' Views in the South of France, chiefly on the Rhone, after Peter De Wint."]}, {"page": "Samuel Rawle", "response": ["He practised in London. From 1798, he engraved many plates for the European Magazine and Gentleman's Magazine. Later he was employed on some of the major topographical publications of the time. These included: James Cavanah Murphy's Arabian Antiquities of Spain, 1816; Robert Surtees's History and Antiquities of the County Palatine of Durham, 1816; Robert Wilkinson's Londina Illustrata, 1819; James Hakewill, Picturesque Tour of Italy, 1820; Thomas Frognall Dibdin's Bibliographical, Antiquarian and Picturesque Tour in France and Germany, 1821; and Thomas Dunham Whitaker's Richmondshire, 1823. Rawle exhibited landscapes at the Royal Academy in 1801 and 1806. "]}, {"page": "John Pye", "response": ["* The Rialto, Venice, La Riccia, and Lake of Nemi (for James Hakewill's Tour in Italy, 1818);"]}, {"page": "Hakewill", "response": ["* James Hakewill (1778–1843), English architect, best known for his illustrated publications"]}, {"page": "John Scott (engraver)", "response": ["A pair of large plates, Breaking Cover, after Philip Reinagle, and Death of the Fox, after Sawrey Gilpin, issued in 1811, are regarded as his masterpieces. Scott also did much work for publications of a different kind, such as Henry Tresham and William Young Ottley's British Gallery, Ottley's Stafford Gallery, John Britton's Fine Arts of the English School, James Hakewill's Tour of Italy, and Peter Coxe's Social Day."]}, {"page": "Bridge of Augustus (Narni)", "response": ["James Hakewill wrote in A picturesque tour of Italy (1816–1817):"]}, {"page": "Henry Moses (engraver)", "response": ["Moses contributed many of the illustrations to James Hakewill's Tour of Italy, 1820, and Woburn Abbey Marbles, 1822. He etched from his own designs Picturesque Views of Ramsgate, 23 plates, 1817; Sketches of Shipping and Marine Sketch Book, 1824 (reissued by Ackermann, 1837); and Visit of William IV, when Duke of Clarence, to Portsmouth in 1827, 17 plates, 1830. Moses's final work was a set of twenty-two illustrations to Pilgrim's Progress, after Henry Courtney Selous, executed for the Art Union of London, 1844."]}, {"page": "John Le Keux", "response": ["Le Keux's engravings were found in the architectural publications of John Britton, Augustus Welby Pugin, John Preston Neale, and others; they were an influence in the revival of Gothic architecture. He engraved the plates to James Ingram's Memorials of Oxford, and published himself two volumes of engravings, Memorials of Cambridge, with text by Thomas Wright and Harry Longueville Jones; some of these plates were subsequently used for Charles Henry Cooper's Memorials of Cambridge. He engraved, after J. M. W. Turner, Rome from the Farnese Gardens for James Hakewill's Italy, and St. Agatha's Abbey, Easby, for Thomas Dunham Whitaker's History of Richmondshire."]}, {"page": "St John the Baptist, Kentish Town", "response": ["That church was in turn substantially rebuilt in 1843-45 by James Hakewill although the nave walls and apse of the original church were reused in the new church. The church became redundant in 1993 and was used for all-night raves but more recently it has been taken over by the Christ Apostolic Church UK and is used as a place or worship once more."]}, {"page": "Whitney Estate", "response": ["James Hakewill visited the estate during his tour of Jamaica 1820-1. The estate was 3,243 in extent, all of which was fertile. Edward Long wrote: \"\"The plantation(...) is one of the most celebrated for its fertility. It is a small dale surrounded with rocky hills, and so rich that it produces invariably three hundred hogsheads of sugar per annum, with so little labour upon it, that [the enslaved Africans] multiply sufficiently to keep up their stock, without having recourse to African recruits.\""]}, {"page": "Maria C. Hakewill", "response": ["Maria Catherine Browne was born in the latter part of the 18th century. She married the architect James Hakewill, whom she accompanied to Italy, where they spent two years, 1816 and 1817. Her novel, Coelebs Suited; or, The Stanley Letters was published in 1812. Hakewill painted portraits and scenes in oil. She exhibited at the Royal Academy, the British Institution, and the Society of British Artists, between 1808 and 1838. She died at Calais in 1842. Children included the sons Henry James, John Henry, Arthur William, and Frederick Charles, who also painted portraits."]}, {"page": "Hamilton Brown", "response": ["thumb|A plantation in Saint Ann Parish. James Hakewill, 1820s."]}, {"page": "Hakewill, James", "response": ["#redirectJames Hakewill"]}]}}