{"wiki_id": "http://www.wikidata.org/entity/Q6137437", "itemLabel": "James Knott", "itemDescription": "English cricketer (born 1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Knott_(cricketer)", "wikipedia_page": {"main": "James Alan Knott (born 14 June 1975) is a former English cricketer. Knott was a right-handed batsman and wicket-keeper, although he did occasionally bowl right-arm medium pace. He was born in Canterbury, Kent and is the son of former England international wicket-keeper Alan Knott.\nKnott made his first-class cricket debut for Surrey County Cricket Club against New South Wales during the state's 1995 visit to England. Knott appeared in first-class cricket for Surrey from 1995 to 1998, making 12 appearances, the last of which came against Nottinghamshire in the 1998 County Championship. An able, if somewhat inconsistent batsman, Knott scored 273 runs at an average of 21.00, with a high score of 49*. Behind the stumps he took 12 catches and made 2 stumpings. It was for Surrey that he made his List A debut for in the 1997 Benson & Hedges Cup against British Universities. He played List A cricket for Surrey until 1998, making 10 appearances, the last of which came against Derbyshire in the 1998 AXA League. In those 10 matches, he scored a total of 142 runs at an average of 17.75, with a high score of 98. Behind the stumps he took 15 catches. His score of 98, which came against Gloucestershire in 1998, was to remain his highest List A score. During his time at Surrey, Knott largely stood in for Alec Stewart when he was unavailable due to England duties, toward the end of his time with the county, he was below Jonathan Batty in the selection pecking order. He was released by Surrey at the end of the 1998 season.\nAfter playing Minor counties cricket for Cambridgeshire in 2000, Knott joined Bedfordshire for the 2001 season. His debut for Bedfordshire came in the Minor Counties Championship against Lincolnshire. Knott played Minor counties cricket for Bedfordshire from 2001 to 2009, making 47 Minor Counties Championship appearances and 27 MCCA Knockout Trophy appearances. Knott also played List A cricket for the county, appearing in 9 matches, the last coming against Sussex in the 2005 Cheltenham & Gloucester Trophy. In his 9 matches for Bedfordshire in limited-overs cricket, he scored 193 runs at an average of 32.16, with a high score of 66*. Behind the stumps he took 11 catches and made 4 stumpings. Overall, Knott made 19 List A appearances in his career, scoring 335 runs at an average of 23.92. Behind the stumps he took 26 catches and made 4 stumpings.He also played Second XI cricket for the Kent and Somerset Second XI's.After Knott retired, he became a teacher, first at King's College School and is currently at Stowe School.", "link_mentions": [{"page": "James Knott", "response": ["James Knott is the name of:", "* Sir James Knott, 1st Baronet (1852–1934), English shipping magnate and politician", "* James Knott (cricketer) (born 1975), English cricketer"]}, {"page": "Knott (surname)", "response": ["* Sir James Knott, 1st Baronet (1855–1934), English shipping magnate and politician", "* James Knott (born 1975), English cricketer, the son of Alan Knott"]}, {"page": "List of Bedfordshire County Cricket Club List A players", "response": ["| James Knott || 2001–2005 || 9 || Had previously played first-class cricket for Surrey and had one season with Cambridgeshire before joining Bedfordshire. Played more than 75 Minor Counties matches for the county. || James Knott, CricketArchive. Retrieved 2019-08-14. "]}]}}