{"wiki_id": "http://www.wikidata.org/entity/Q6139632", "itemLabel": "James Melville Babington", "itemDescription": "British general (1854-1936)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Melville_Babington", "wikipedia_page": {"main": "Lieutenant General Sir James Melville Babington  (31 July 1854 – 15 June 1936) was a British Army officer and a renowned leader of cavalry, making a name for himself for his actions in the Second Boer War. He was Commander of the New Zealand Defence Force and one of the most respected British generals in the First World War, in command of the 23rd Division. After the war he was Commander of the British Forces in Italy.\nGeneral Babington's image was chosen by Paul McCartney and used by the Beatles to depict the fictional \"Sgt. Pepper\" for the album Sgt. Pepper's Lonely Hearts Club Band in 1967.", "link_mentions": [{"page": "Croix de Guerre", "response": ["* Lt.-Gen. Sir James Melville Babington, Commander of the 23rd Division (United Kingdom)"]}, {"page": "23rd Division (United Kingdom)", "response": ["The 23rd Division was an infantry division of the British Army raised in 1914 in the Great War as part of Kitchener's Army. The division was sent to France in August 1915 under the command of Major-General Sir James Melville Babington C.B. C.M.G.. During the war the division fought on the Western Front until October 1917 when it moved to the Italian Front. It remained in Italy and was disbanded by March 1919.", "The division formed part of Kitchener's third New Army, with concentration of units beginning on 16 September, the 68th Brigade at Bullswater and the 69th and 70th brigades, together with Royal Engineers companies at Frensham.Sandilands p. 6 It was commanded by Maj. Gen. James Melville Babington, who was at first hampered by a lack of clerks, cooks and a means of communicating orders, other than verbally. Together with other New Army divisions, uniforms of any description were not received until mid October, by which time many of the civilian clothes the men wore were reduced to rags.Sandilands p. 7 Division artillery began to be formed in early November. Initial weapons training was carried out with small numbers of Lee-Metford rifles and French 90mm guns.Sandilands pp. 9, 12 The division was concentrated at Aldershot in January 1915, where the division train was formed. Khaki uniforms were received at the end of February and the division moved to the Shorncliffe area in March and continued training.Sandilands p. 14 In May the division moved to Borden where 18 pounders and 4.5 inch howitzers were issued to the division artillery and in June the Infantry received its rifles.Sandilands pp. 16–17 On 16 August the division was inspected by the King and next day received its orders for embarkation.Sandilands p. 18"]}, {"page": "Battle of Vittorio Veneto", "response": ["** 14th British Corps of General James Melville Babington."]}, {"page": "16th/5th The Queen's Royal Lancers", "response": ["*1922–1936 (16th Lancers): Lt-Gen. Sir James Melville Babington, KCB, KCMG (ex 16th Lancers)"]}, {"page": "16th The Queen's Lancers", "response": ["*1909–1922: Lt-Gen. Sir James Melville Babington, KCB, KCMG (to 16th/5th Lancers)"]}, {"page": "Anthony Babington (politician)", "response": ["Babington was born into the Anglo-Irish Babington family that arrived in Ireland in 1610 when Brutus Babington was appointed Bishop of Derry. Notable relations include Robert Babington, William Babington, Benjamin Guy Babington and James Melville Babington and author Anthony Babington."]}, {"page": "Sir James Melville Babington", "response": ["#REDIRECT James Melville Babington"]}, {"page": "James Babington", "response": ["#Redirect James Melville Babington"]}, {"page": "New Zealand Staff Corps", "response": ["The Volunteer Force had a number of defects, the first of which was the quality of its men. Although they funded their own equipment and trained on their own time, the equipment was often of low quality and time spent training was insufficient.  Officers were elected by their men but generally lacked professional military training, and were often compromised when giving orders to men that elected them to command.  Co-operation between the Volunteer Force and the Permanent Force was lacking.   By 1905, the constraints of New Zealand society and increasing work commitments began to impact on the number of willing volunteers.  The commandant of the New Zealand Military Forces at the time, Major General James Melville Babington, considered the Volunteer Forces to be an inefficient fighting force.   "]}, {"page": "1907 Birthday Honours", "response": ["*Colonel James Melville Babington, C.M.G., half-pay."]}, {"page": "Babington (surname)", "response": ["* Sir James Melville Babington (1854–1936), Boer War commander"]}, {"page": "1919 Birthday Honours", "response": ["*Maj.-Gen. Sir James Melville Babington "]}, {"page": "1917 New Year Honours", "response": ["*Honorary Major-General James Melville Babington, , Colonel, 16th Lancers"]}, {"page": "Babington family", "response": ["William Babington (1756-1833)'s eldest son was William Babington (1789-1828) who was the father of Lieutenant-Colonel William Babington (1826-1913) who lived at Brooklands House in Sarisbury Green.L. G. Pine, editor, Burke's Genealogical and Heraldic History of the Landed Gentry, 17th edition, (London, England: Burke's Peerage Ltd, 1952), page 83. Colonel Babington (1826-1913) had nine children, including Lieutenant-General Sir James Melville Babington, who commanded the 1st Cavalry Brigade as a Major-General during the Second Boer War and commanded the 23rd Division during the First World War. General Babington's image was used by The Beatles as the fictional \"Sgt. Pepper\" for the album \"Sgt. Pepper's Lonely Heart's Club Band\" in 1967. Another son of Colonel Babington was Charles Hagart Babington (1859-1951) who was President of the Institute of Brewing and Distilling in 1904. Charles Hagart Babington was the father of Air Marshal Sir John Tremayne Babington and Air Marshal Sir Philip Babington, who were both on the Air Council during the Second World War.", "* Sir James Melville Babington (1854–1936), Boer War commander"]}, {"page": "Recipients of the Croix de Guerre", "response": ["* Lt.-Gen. Sir James Melville Babington, Commander of the 23rd Division (United Kingdom)"]}, {"page": "Australian Regiment (1899–1900)", "response": ["The 1st Gordon Highlanders, two more field guns, and detachments of Royal Engineers and Rimington's Guides were sent to the camp on 16 December, where they came under the command of Hoad. On New Years' Day 1900 fifty men from the Victorian Mounted Rifles under Captain Duncan McLeish made a reconnaissance toward Douglas and scouted a Boer laager there without engagement. The Victorian Mounted Rifles participated in another reconnaissance into the Orange Free State under Major General James Melville Babington on 9 January. The 12th Lancers came under the command of Hoad at Enslin on 17 January."]}]}}