{"wiki_id": "http://www.wikidata.org/entity/Q6131591", "itemLabel": "James Colnett", "itemDescription": "British Royal Navy officer, an explorer, and maritime fur trader", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Colnett", "wikipedia_page": {"main": "James Colnett (1753 – 1 September 1806) was an officer of the British Royal Navy, an explorer, and a maritime fur trader. He served under James Cook during Cook's second voyage of exploration. Later he led two private trading expeditions that involved collecting sea otter pelts in the Pacific Northwest of North America and selling them in Canton, China, where the British East India Company maintained a trading post. Wintering in the recently discovered Hawaiian Islands was a key component of the new trade system. Colnett is remembered largely for his involvement in the Nootka Crisis of 1789—initially a dispute between British traders and the Spanish Navy over the use of Nootka Sound on Vancouver Island that became an international crisis that led Britain and Spain to the brink of war before being peacefully resolved through diplomacy and the signing of the Nootka Conventions.\nDue to Colnett's central role in the initial incident that sparked the international crisis, Colnett's account of his second fur trading voyage, including the events at Nootka Sound in 1789, was published in 1940, as part of the Champlain Society's General Series. His first trading voyage journal remained unpublished until 2005.", "link_mentions": [{"page": "New Spain", "response": ["In 1789, at Santa Cruz de Nuca, a conflict occurred between the Spanish naval officer Esteban José Martínez and the British merchant James Colnett, triggering the Nootka Crisis, which grew into an international incident and the threat of war between Britain and Spain. The first Nootka Convention averted the war but left many specific issues unresolved. Both sides sought to define a northern boundary for New Spain. At Nootka Sound, the diplomatic representative of New Spain, Juan Francisco de la Bodega y Quadra, proposed a boundary at the Strait of Juan de Fuca, but the British representative, George Vancouver refused to accept any boundary north of San Francisco. No agreement could be reached and the northern boundary of New Spain remained unspecified until the Adams–Onís Treaty with the United States (1819). That treaty also ceded Spanish Florida to the United States."]}, {"page": "Galápagos Islands", "response": ["In 1793, James Colnett described the flora and fauna of Galápagos, and suggested the islands could be used as base for the whalers operating in the Pacific Ocean. He drew the first accurate navigation charts of the islands. Whalers and maritime fur traders killed and captured thousands of the Galápagos tortoises to extract their fat. The tortoises could be kept on board ship as a means of providing of fresh protein, as these animals could survive for several months on board without any food or water. The hunting of the tortoises was responsible for greatly diminishing, and in some cases eliminating, certain species. Along with whalers came the fur-seal hunters, who brought the population of this animal close to extinction."]}, {"page": "Senkaku Islands", "response": ["The name, \"Pinnacle Isles\" was first used by James Colnett, who charted them during his 1789-1791 voyage in the Argonaut.\"Pinnacle Rock in Latitude 29°40′ and Longitude 132° E. of London... This Navigation is no ways dangereous were you sure of your Latitude and to make Pinnicle Isle\". James Colnett, The Journal ... aboard the Argonaut from April 26, 1789 to Nov. 3, 1791, ed. with introd. and notes by F. W. Howay, Toronto, Champlain Society Vol. 26, 1940, p. 47. William Robert Broughton sailed past them in November 1797 during his voyage of discovery to the North Pacific in HMS Providence, and referred to Diaoyu Island/Uotsuri Island as \"Peaks Island\".William Robert Broughton, William Robert Broughton's Voyage of Discovery to the North Pacific, 1795–1798, edited by Andrew David; with an introduction by Barry Gough,  Ashgate for the Hakluyt Society, Farnham, England; Burlington, VT, 2010, p. 202. Reference was made to the islands in Edward Belcher's 1848 account of the voyages of HMS Sammarang.Suganuma, Unryu. (2001).  Captain Belcher observed that \"the names assigned in this region have been too hastily admitted.\"Belcher, Edward. (1848). ; Belcher,  Belcher reported anchoring off Pinnacle Island in March 1845.Belcher, ; excerpt at p. 317, \"On the 16th, we endeavoured to obtain observations on Tia-usu; a landing was effected, but the absence of sun prevented our obtaining satisfactory observations, and bad weather coming on hastened our departure. This group, comprehending hô-pîng-san (和平山, \"Peace Island\", Uotsuri-shima), Pinnacle Rocks, and Tias-usu (Kuba-shima), form a triangle, of which the hypothenuse, or distance between Hoa-pin-san and Tia-usu, extends about fourteen miles, and that between Hoa-pinsan and the Southern Pinnacle, about two miles.\""]}, {"page": "Pinta Island tortoise", "response": ["The Pinta Island tortoise was originally described in 1877 by German-born British herpetologist Albert Günther, who named it Testudo abingdonii in his book The Gigantic Land-tortoises (Living and Extinct) in the Collection of the British Museum. The name abingdonii derives from Abingdon Island, now more commonly known as Pinta Island. The knowledge of its existence was derived from short statements of the voyages of Captain James Colnett in 1798 and Basil Hall in 1822. In 1876, Commander William Cookson brought three male specimens (along with other species of Galápagos tortoise) to London aboard the Royal Navy ship HMS Peterel."]}, {"page": "Tsimshian", "response": ["Kitkatla was probably the first Tsimshian village contacted by Europeans when Captain Charles Duncan and James Colnett arrived in 1787.http://faculty.arts.ubc.ca/menzies/anth220/a_Tsmshian_Overview.pdf Although Captain George Vancouver sailed up the Portland Canal into Nisga'a territory in 1793, the Gitksan were not subject to settlement pressure until the confluence of the Skeena and Bulkley Rivers, formerly the site of the Tsimshian village of Kitanmaks, became the new European settlement of Skeena Forks (today known as Hazelton). When the Hudson's Bay Company moved their fort to modern-day Port Simpson in 1834, nine Tsimshian villages moved to the surrounding area. Many of the Tsimshian peoples in Canada still live in these regions."]}, {"page": "The Far Side of the World", "response": ["*Mr Michael Allen: New master on HMS Surprise, a man with whaling experience and knowledge of the southern whaling waters. He sailed previously with James Colnett on a semi exploration-whaling expedition to the South Atlantic."]}, {"page": "Nihoa", "response": ["The island is home to 25 species of plants and several animals, making it the most diverse island in the entire NWHI. Endemic birds like the Nihoa finch and Nihoa millerbird, and endemic plants like Pritchardia remota and Schiedea verticillata are found only on Nihoa. Amaranthus brownii  was considered the rarest plant on Nihoa and has not been directly observed on the island since 1983, and is now considered to be extinct. The plant communities and rocky outcrops provide nesting and perching areas for 18 species of seabirds, such as red-footed boobies and brown noddies, terns, shearwaters, and petrels. Prehistoric evidence indicates Native Hawaiians lived on or visited the island around AD 1000, but over time the location of Nihoa was mostly forgotten, with only an oral legend preserving its name.  Captain James Colnett rediscovered the island in 1788, and Queen Kaʻahumanu visited it in 1822. It was made part of the Kingdom of Hawaii by King Kamehameha IV.", "The first Westerner to discover Nihoa was Captain James Colnett of the Prince of Wales, on March 21, 1788. Due to Colnett's lengthy absence from England, including his imprisonment by the Spanish for his part in the Nootka Sound Incident, the discovery was once widely accredited to Captain William Douglas of the Iphigenia, who sighted Nihoa almost a year later.."]}, {"page": "Northwestern Hawaiian Islands", "response": ["The first of the Leeward Isles to be discovered by Europeans was Nihoa. James Colnett discovered it in 1786, although historically the credit has gone to William Douglas. Later that year, La Pérouse discovered Necker, and named it for Jacques Necker, the French Minister of Finance. La Pérouse then went on to discover French Frigate Shoals. The last of the NWHI to be discovered was Midway Atoll, which was found by N.C. Middlebrooks in 1859. In 1925, the Tanager Expedition travelled to many of the NWHI. The islands were mapped, new species were discovered and described, and the archeological sites on Nihoa and Necker were found."]}, {"page": "Galápagos Province", "response": ["In 1793, James Colnett, (1753 – 1 September 1806) was an officer of the British Royal Navy, an explorer, and a maritime fur trade  described the flora and fauna of the islands and suggested they could be used as base for the whalers operating in the Pacific Ocean. Collnet also drew the first charts of the Galapagos. These whalers captured and killed thousands of tortoises in the archipelago because the tortoises could survive for months without food or drink.  The gigantic Galapagos tortoises were transported inside the holds of whaling ships.  A phrase \"living cupboards\" could be desortugas would be kept alive and killed when fresh meat was required by the whailing crews. Tortoises provided fresh protein on the long journeys typical of whaling ships. Hunting of these tortoises was the cause of the large decrease of their population, and in some cases the destruction of certain species of the Galapagos Tortoise."]}, {"page": "Archibald Menzies", "response": ["In 1786 Menzies was appointed surgeon on board the Prince of Wales (Captain James Colnett), on a fur-trading voyage round Cape Horn to the northern Pacific. This ship, in company of Princess Royal (Captain Duncan), visited North America, China, and Hawaii (the Sandwich Isles) several times; Menzies collected a number of new plants on this voyage, and also ensured that none of the crew died of illness. Menzies returned to Great Britain in 1789. He was elected a fellow of the Linnean Society in 1790."]}, {"page": "John Meares", "response": ["During the winter of 1788–89 Meares was in Guangzhou (Canton), China, where he and others formed a partnership called the Associated Merchants Trading to the Northwest Coast of America. Plans were made for more ships to sail to the Pacific Northwest in 1789, including the Princess Royal, under Thomas Hudson, and the Argonaut under James Colnett. The consolidation of the fur trading companies of Meares and the Etches (King George's Sound Company) resulted in James Colnett being given the overall command. Meares instructed Colnett to establish a permanent fur trading post at Nootka Sound based on the foothold accomplished by Meares the year before. The Iphigenia Nubiana and North West America were to join the Argonaut and Princess Royal at Nootka Sound. Meares himself remained in China."]}, {"page": "Nootka Convention", "response": ["The Nootka Sound dispute began in 1789 when Spain sent José Martínez to occupy Nootka Sound and establish exclusive Spanish sovereignty. During the summer of 1789 a number of fur trading vessels, British and American, arrived at Nootka. A conflict over sovereignty arose between the captain of the British Argonaut, James Colnett, and Martínez. By the end of the summer Martínez had arrested Colnett, seized several British ships, and arrested their crews. Colnett had come to Nootka Sound intending to build a permanent trading post and colony on land previously acquired by his business associate John Meares. At the end of the summer Martínez abandoned Nootka and took the captured ships and prisoners to San Blas, New Spain. The news about these events triggered a confrontation between Spain and Britain known as the Nootka Crisis, which nearly led to war."]}, {"page": "Chatham Strait", "response": ["The meanings of the parts of the name in the Tlingit language for Chatham Strait are as follows: Shee, Baranof Island; Ya, face; Xhaak, Center.  The southern part of the strait was named Ensenada del Principe in 1775 by Juan Francisco de la Bodega y Quadra.  In 1786 La Perouse gave it the name Tschirikow Bay, and in 1789 the fur trader James Colnett named it Christian Sound.  Other early fur traders called it Menzies Strait.  It received its present name in 1794 when George Vancouver named it Chatham Strait in honor of William Pitt, 1st Earl of Chatham;   Chatham Sound, farther south in British Columbia, was named by Vancouver for his son John Pitt, 2nd Earl of Chatham, whose brother William Pitt, was Prime Minister of Great Britain."]}, {"page": "Japan–United Kingdom relations", "response": ["*1791. James Colnett sails HMS Argonaut from Canton to Japan becoming the second unsuccessful attempt at trade with Sakoku Japan."]}, {"page": "Spanish Canadians", "response": ["A major war between Spain and Britain over British Columbia could have begun via the Nootka Sound dispute in 1789. Spain at the time sent José Martínez to occupy Nootka Sound and establish exclusive Spanish sovereignty. During the summer of 1789 a number of fur trading vessels, British and American, arrived at Nootka. A conflict over sovereignty arose between the captain of the British Argonaut, James Colnett, and Martínez. By the end of the summer Martínez had arrested Colnett, seized several British ships, and arrested their crews. Colnett had come to Nootka Sound intending to build a permanent trading post and colony on land previously acquired by his business associate John Meares. At the end of the summer Martínez abandoned Nootka and took the captured ships and prisoners to San Blas, New Spain. The news about these events triggered a confrontation between Spain and Britain known as the Nootka Crisis which nearly led to war. A major war over British Columbia with the British was peacefully resolved via the Nootka Convention, with both parties retaining their claims until a future solution could be finalized."]}, {"page": "Robert Gray (sea captain)", "response": ["According to the letter signed by Ingraham and Gray, Meares had made many false claims about the events of 1789. The Portuguese ships, Ingraham said, were definitely British ships flying Portuguese flags. The \"house\" that Meares said he built at Nootka Sound, and which was explicitly mentioned in the Nootka Convention, was only a \"rough hut\", built and torn down in 1788. By 1789, when the Spanish arrived, \"there was no vestige of any house remaining\". The Nootka Convention said that Spain had seized buildings and that these must be restored to Britain. Further, Ingraham wrote that Meares had not purchased any land from Maquinna, as claimed. About the arrest of James Colnett by Esteban José Martínez, Ingraham and Gray wrote that Colnett had insulted and threatened Martínez, and that Colnett had drawn his sword on Martínez, justifying Colnett's arrest. The letter closed with a statement of friendship: \"We sincerely hope, sir, when things are represented with truth, it will rescue our friend Don Estevan J. Martínez from censure... As to the treatment of the Americans by Don Estevan, we have ever testified to it in terms due to such hospitality, and we are again happy to have it in our power to do what we deem justice to his conduct.\" The Americans were not a neutral party; the United States had only gained its independence from Britain through war a few years before. Also, the Americans were in direct competition with the British, but not the Spanish, for the fur trade of the Northwest coast. It was in their interest to support the Spanish case."]}, {"page": "Malpelo Island", "response": ["* 1793 – James Colnett visited."]}, {"page": "Marine iguana", "response": ["Early visitors to the Galápagos Islands considered the marine iguanas ugly and disgusting. In 1798, captain James Colnett of the British Royal Navy wrote:"]}, {"page": "HMS Glatton (1795)", "response": ["Captain Nathaniel Portlock recommissioned her in May 1802 as a convict ship. Next, Commander James Colnett assumed command and on 23 September Glatton left England, carrying over 270 male, and 135 female prisoners; of these, seven men and five women died on the journey. She also carried some 30 Free Settlers. A family from the Royal Household boarded the Glatton - this was one of the reasons a Royal Navy vessel was used, to ensure a safe passage. She sailed via a resupply stop at Rio de Janeiro to the penal settlement at Sydney, where she arrived on 13 March 1803. When Glatton arrived about 100 of the people on board her were suffering to varying degrees from scurvy.Sydney Gazette and New South Wales Advertiser, 1803."]}, {"page": "Maquinna", "response": ["Maquinna was a powerful chief whose summer coastal village, Yuquot, became the first important anchorage in the European jockeying for power and commerce as the era of the maritime fur trade began. Yuquot became known as Friendly Cove after the British explorer Captain James Cook visited in 1778. Cook did not record the name of the chief of Yuquot, who may not have been Maquinna in 1778, even though writers have often assumed it was. Imperial Spain had sent two voyages to the region before Cook's visit, including Juan Pérez, who in 1774 had anchored in or near the entrance of Nootka Sound. In response to Russian activity in Alaska and the increasing visits by British fur-traders, Spain, which claimed the coast from Mexico to Alaska, asserted its authority by launching further voyages to the Pacific Northwest, including scientific and surveying expeditions. In 1788, John Meares explored Nootka Sound and the neighboring coasts and claimed to have bought some land from Maquinna, where he built a trading post. In 1789, Esteban José Martínez of the Spanish Navy occupied and claimed Nootka Sound for Spain. He built Fort San Miguel and a settlement called Santa Cruz de Nuca. Ensuing events led to Martínez's seizure of the British subject James Colnett and several British ships, which provoked an international episode known as the Nootka Crisis."]}, {"page": "John Kendrick (American sea captain)", "response": ["On June 15, 1789, Meares's small sloop , under Thomas Hudson, arrived at Friendly Cove. Needing repairs and in no condition to resist, Hudson readily accepted Martínez's authority.Ridley (2000), p. 114 Robert Gray returned to Nootka Sound on June 17, finding the Spanish in control, Fort San Miguel built, North West America captured and Princess Royal detained. Gray sailed Lady Washington directly to Kendrick's outpost at Marvinas Bay. While Gray had been away Kendrick's friendship with the natives had resulted in his collecting of hundreds of furs. Thinking they would soon depart, Kendrick took Columbia and Washington to Friendly Cove, anchoring there on June 28. On July 2, Martínez let the Princess Royal depart. Within hours Meares's command ship Argonaut under James Colnett arrived.Ridley (2000), pp. 112–118", "thumb|The arrest of James Colnett."]}, {"page": "Murray Maxwell", "response": ["In December 1795 Maxwell was taken prisoner when Nemesis was captured by a superior French force in Smyrna harbour. Despite Smyrna's neutrality, the large French frigate Sensible and the smaller corvette Sardine entered the port, followed later by the corvette Rossignol, and called on Nemesis to surrender. Linzee protested at the illegal nature of the French demands, but decided it would be futile to engage the significantly stronger force inside a neutral harbour, and complied with the French order.James, Vol. 1, p. 275 Maxwell was rapidly exchanged, and returned to service aboard  under Captain James Colnett. However, on 27 December 1796, Hussar was wrecked off Southern France, and Maxwell once again became a prisoner of war.James, Vol. 2, p. 378 Exchanged a second time, he joined , and later moved to , before being made lieutenant in October 1796. Following his promotion, Maxwell was not employed at sea again until 1802. In 1798 he married the daughter of an army officer, Grace Callander Waugh."]}, {"page": "Galápagos tortoise", "response": ["An estimated 200,000 animals were taken before the 20th century. The relatively immobile and defenceless tortoises were collected and stored live on board ships, where they could survive for at least a year without food or water (some anecdotal reports suggest individuals surviving two years), providing valuable fresh meat, while their diluted urine and the water stored in their neck bags could be used as drinking water. The 17th-century English pirate, explorer, and naturalist William Dampier wrote, \"They are so extraordinarily large and fat, and so sweet, that no pullet eats more pleasantly,\" while Captain James Colnett of the Royal Navy wrote of \"the land tortoise which in whatever way it was dressed, was considered by all of us as the most delicious food we had ever tasted.\" US Navy captain David Porter declared, \"after once tasting the Galapagos tortoises, every other animal food fell off greatly in our estimation ... The meat of this animal is the easiest of digestion, and a quantity of it, exceeding that of any other food, can be eaten without experiencing the slightest of inconvenience.\" Darwin was less enthusiastic about the meat, writing \"the breast-plate roasted (as the Gauchos do \"carne con cuero\"), with the flesh on it, is very good; and the young tortoises make excellent soup; but otherwise the meat to my taste is indifferent.\""]}, {"page": "List of historical ships in British Columbia", "response": ["| James Colnett", "| James Colnett, James Johnstone"]}, {"page": "The Encantadas", "response": ["In the fourth sketch Cowley's Voyage Round the Globe from 1699 is quoted.Hayford, MacDougall, and Tanselle (1987), 602 The basis for the fifth sketch is Journal of a Cruise Made to the Pacific Ocean by Captain David Porter, first published in 1815, which Melville had first used for Typee. This book \"provided ore for at least a dozen passages\", including the Oberlus story in the ninth sketch and the epitaph which concludes the tenth. In sketch six, Melville applied the brief description of James Island which he found in A Voyage to the South Atlantic and Round Cape Horn into the Pacific Ocean by Captain James Colnett, published in 1798, to Barrington Isle.Hayford, MacDougall, and Tanselle (1987), 603"]}, {"page": "Ralph Simpson Kuykendall", "response": ["1924 James Colnett and the Princess Royal, Quarterly of the Oregon Historical Society, XXV:26-53 (March, 1924)"]}, {"page": "Esteban José Martínez Fernández y Martínez de la Sierra", "response": ["A conflict over violating Spanish sovereignty rights of trade and navigation on the coast arose between the captain of John Meares' British Argonaut, James Colnett and his claim of the Meares company land, and Martínez. By the end of the summer Martínez had arrested Colnett, seized several British ships, and arrested their crews. Martínez and the Spanish departed Nootka Sound in late summer 1789. They returned to San Blas, New Spain, with captured ships, including the British sloop  and prisoners."]}, {"page": "José María Narváez", "response": ["While Narváez was away, Martínez performed an elaborate ceremony of possession at Nootka. Soon after he fought a brawl with the British Captain James Colnett, had him imprisoned, and seized several English ships and their crews. These events escalated into a major international crisis. Martínez forced a group of captured Chinese workmen to construct Fort San Miguel and other structures. Shortly after Narváez returned in July, Martínez captured a newly arrived English ship, the Princess Royal. This led to an incident in which the Spanish shot and killed Nuu-chah-nulth (Nootka) Chief Callicum, son of Chief Maquinna."]}, {"page": "History of the Tlingit", "response": ["*James Colnett (1788)"]}, {"page": "Fenis and St. Joseph", "response": ["In mid-September, having gathered about 700 sea otter pelts, Fenis and St. Joseph arrived at Nootka Sound. At the time, diplomatic discussions taking place between George Vancouver and Juan Francisco de la Bodega y Quadra over how to carry out the First Nootka Convention resulting from the Nootka Crisis of 1789. Since Duffin had been at Nootka Sound with Meares in 1788 and with James Colnett in 1789—both key moments of the Nootka Crisis—Vancouver quickly asked him for a sworn statement about the events of 1789 at Nootka Sound. Duffin's report contradicted the reports of Robert Gray and Joseph Ingraham, which Bodega y Quadra had been using to undermine Vancouver's diplomatic position. Where Gray and Ingraham swore that Meares had never purchased any land from the local indigenous chief Maquinna, Duffin said Meares had in fact purchased the whole of Friendly Cove. The point was central to whether Bodega y Quadra would or would not turn over the Spanish settlement at Nootka Sound to Vancouver. Vancouver seems to have had doubts about the veracity of Duffin's account, but confronted Bodega with the new information. Bodega dismissed it, claiming that Duffin could not be objective on the matter. In response to Vancouver's use of Duffin's sworn statements Bodega sought a formal statement from Maquinna, from whom Meares had supposedly made the land purchase. Maquinna came before a group assembled at Bodega's house, including Barros Andrade, the captain of the San José el Fénix (Fenis and St. Joseph), and a number of others, all of whom were to serve as witnesses for an affidavit. Before this group Maquinna flatly denied selling Meares any land. He had only sold a bit of land in Marvinas Bay to the American John Kendrick and he had donated the land at Friendly Cove to Francisco de Eliza, where the Spanish settlement then stood, on the condition that the land be returned when the Spanish withdrew. Between the statements of Duffin and Maquinna the negotiations between Vancouver and Bodega reached a complete deadlock."]}]}}