{"wiki_id": "http://www.wikidata.org/entity/Q6137884", "itemLabel": "James Leach", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Leach_(VC)", "wikipedia_page": {"main": "James Edgar Leach VC (27 July 1892 – 15 August 1958) was a British Army officer and English recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.\nLeach was 22 years old, and a Second Lieutenant in the 2nd Battalion, The Manchester Regiment, in France during the First World War. The 2nd Manchesters formed part of 5 Division, which had crossed the Béthune–La Bassée canal and then came under heavy attack. On 29 October 1914, near Festubert, the following deed took place for which Leach and Sergeant John Hogan were awarded the VC.\nTheir citation reads:\n\nFor conspicuous bravery near Festubert on 29 October, when, after their trench had been taken by the Germans, and after two attempts at recapture had failed, they voluntarily decided on the afternoon of the same day to recover the trench themselves, and, working from traverse to traverse at close quarters with great bravery, they gradually succeeded in regaining possession, killing eight of the enemy, wounding two, and making sixteen prisoners.\nLeach later achieved the rank of Captain. After the war, he served in the Auxiliary Division of the Royal Irish Constabulary. His VC is on display in the Lord Ashcroft Gallery at the Imperial War Museum, London.", "link_mentions": [{"page": "Manchester Regiment", "response": ["The 1st Battalion moved to France, landing at Marseille in September 1914. Having been briefly attached to French cavalry, the 1st Battalion moved to the frontline on 26 October, relieving a battalion of the Bedfordshire Regiment near Festubert.Wylly, H C (1923), History of the Manchester Regiment (Late the 63rd and 96th Foot), p. 108 Three days later, a heavy bombardment preceded an attack by a German force directed against the 2nd Battalion, Manchesters and the 1st Battalion, Devonshire Regiment. Despite capturing a trench line, the Germans were unable to capitalise due to the actions of a platoon commanded by Second-Lieutenant James Leach. In the process of their methodical retaking of the trench, the party killed eight, wounded two and captured 14 soldiers.Mileham (2000), p. 86 For their contribution to the defence of the Manchesters' trenches, Second-Lieutenant Leach and Sergeant John Hogan were awarded the Victoria Cross. Severe casualties were sustained by the 1st Manchesters and its brigade during the Battle of Neuve Chapelle. A succession of intensely fought battles followed, culminating in the Second Battle of Ypres and Battle of Loos."]}, {"page": "Auxiliary Division", "response": ["The ADRIC was recruited in Great Britain from among ex-officers who had served in World War I, especially those who had served in the British Army (including the Royal Flying Corps). Most recruits were from Britain, although some were from Ireland, and others came from other parts of the British Empire.  Many had been highly decorated in the war and three, James Leach, James Johnson, and George Onions, had been awarded the Victoria Cross. Their decorations make it clear that many had been promoted from the ranks: some men, for example, had been awarded the common soldier's Military Medal instead of (or in addition to) the officer's Military Cross.  Enlisted men who had been commissioned as officers during the war often found it difficult to adjust to their loss of status and pay in civilian life, and some historians have concluded that the Auxiliary Division recruited large numbers of these \"temporary gentlemen\"."]}, {"page": "North Shields", "response": ["*James Leach - British Army office and recipient of the Victoria Cross"]}, {"page": "John Hogan (VC)", "response": ["Hogan was 30 years old, and a sergeant in the 2nd Battalion, The Manchester Regiment, British Army during the First World War. On 29 October 1914 near Festubert, France he performed a deed along with Second Lieutenant James Leach for which he was awarded the Victoria Cross."]}]}}