{"wiki_id": "http://www.wikidata.org/entity/Q6136972", "itemLabel": "James Jordan", "itemDescription": "British dancer", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Jordan_(dancer)", "wikipedia_page": {"main": "James Jordan (born 13 April 1978) is an English ballroom dancer and choreographer. His dance partner is his wife Ola Jordan, with whom he turned professional in 2000. Jordan appeared as a professional on Strictly Come Dancing from 2006 to 2013. In August 2014, he participated in the fourteenth series of Celebrity Big Brother. He finished in third place. He returned as an All-Star for the nineteenth series, where he was evicted in thirteenth place.\nIn 2018 he appeared along with his wife, Ola, on Comedy Central's Your Face or Mine?. On 10 March 2019, Jordan won the eleventh series of Dancing on Ice, where he was partnered with professional Finnish figure skater Alexandra Schauman.", "link_mentions": [{"page": "Pamela Stephenson", "response": ["In December 2010, Stephenson competed in the eighth series of the BBC1 television show Strictly Come Dancing, consistently winning praise. She received on 4 December a perfect score of 10 from each of the four judges for her Viennese Waltz, becoming only the eighth celebrity (up until that point) to do so. She then reached the final along with Matt Baker and Kara Tointon. On 18 December, with dancing partner James Jordan, she came third in the competition."]}, {"page": "Gillingham, Kent", "response": ["*James Jordan – professional dancer, appears on Strictly Come Dancing"]}, {"page": "Denise van Outen", "response": ["In September 2012, van Outen was announced as one of the celebrities competing on the tenth series of Strictly Come Dancing. She partnered with professional dancer James Jordan. The couple secured top of the leaderboard seven times. However, controversy arose when viewers criticised her participation in the competition because of the advantage of having had previous stage experience. On 20 December 2012, van Outen and Jordan finished as the runners-up alongside Kimberley Walsh & Pasha Kovalev, behind winning couple Louis Smith and Flavia Cacace."]}, {"page": "Kenny Logan", "response": ["Logan and his wife took part in the fifth series of the BBC celebrity dancing programme Strictly Come Dancing. Kenny was partnered with Ola and Gabby was partnered with James Jordan. Logan ended in 5th place. Gabby finished in 12th place. "]}, {"page": "Strictly Come Dancing", "response": ["! James Jordan", "|Pamela Stephenson & James Jordan", "| Denise van Outen & James Jordan, Kimberley Walsh & Pasha Kovalev", "This series introduced four new professional dancers: Flavia Cacace, James Jordan, Ola Jordan and Vincent Simone. Andrew Cuerden, Hanna Haarala and Izabela Hannah did not return to the programme. This series also saw the return of Nicole Cutler, who had taken part in series 2 but not in series 3.", "|James Jordan", "|James Jordan", "|James Jordan", "|James Jordan", "|James Jordan", "|James Jordan", "|James Jordan", "|James Jordan", "It was announced on 1 June 2014 that professional dancers Artem Chigvintsev, James Jordan and Anya Garnis would not be returning for the new series, although Garnis would remain on the show's choreography team. It was also announced that Tristan MacManus and Joanne Clifton would be joining the show's professional line-up. It was then announced in August that Robin Windsor had pulled out of the competition due to a back injury. Windsor was replaced by new professional Trent Whiddon. In week three, entertainer Donny Osmond joined the four regular judges, making the maximum score that week 50 points. Due to Winkleman's absence in weeks 6, 7 and 8, It Takes Two presenter Zoë Ball co-presented with Daly.", "| 3 || 6 8 10 11 15 1718 ||3rd Place 3rd Place Runner-up Runner-up Runner-up Runner-upRunner-up || Lisa Snowdon Pamela Stephenson Kimberley Walsh Natalie Gumede  Alexandra Burke Karim ZeroualHRVY || Brendan Cole James Jordan Pasha Kovalev Artem Chigvintsev Gorka Márquez Amy Dowden Janette Manrara ", "| Vincent Simone Brian Fortuna Aliona Vilani Kristina Rihanoff James Jordan Aljaž Škorjanec Kevin Clifton Joanne Clifton Giovanni Pernice Oti Mabuse Gorka MárquezJohannes Radebe", "| 5 || Gorka MárquezJames Jordan", "Alexandra Burke and her partner Gorka Márquez and Ashley Roberts and her partner Pasha Kovalev share the record of most 10s awarded to a couple, with 32. This is followed by Faye Tozer and Giovanni Pernice with 31, then Rose Ayling-Ellis and Giovanni Pernice with 30, then Karim Zeroual and Amy Dowden with 29, then Ricky Whittle and Natalie Lowe and John Whaite and Johannes Radebe each with 28. However, if the four tens given by Darcey Bussell during her tenure as a fifth judge are removed, Whittle is behind Oti Mabuse and her respective celebrity partners Danny Mac and Kelvin Fletcher, both with 26 tens, and Rachel Stevens with Vincent Simone and Harry Judd with Aliona Vilani with 25 each. They are followed by Natalie Gumede and Artem Chigvintsev and Ore Oduba and Joanne Clifton with 24 each, Caroline Flack and Pasha Kovalev with 23, Abbey Clancy and Aljaž Škorjanec and Debbie McGee and Giovanni Pernice with 22, Kara Tointon and Artem Chigvintsev with 21 and Lisa Snowdon and Brendan Cole, Kimberley Walsh and Pasha Kovalev and Denise van Outen and James Jordan with 20.League table for Celebrities scoring 10s  Ultimate Strictly Of the above pairings, Snowdon and Cole, Flack and Kovalev, Tozer and Pernice and Roberts and Kovalev are the only pairings to receive straight tens for all of their dances in their respective series finals. Flack and Kovalev, Tozer and Pernice and Roberts and Kovalev are the only pairs to receive three sets of perfect 40s in the final. Of these couples, Roberts and Kovalev and Flack and Kovalev also hold the records for the judges longest consecutive streak of 40s, with four, both stretching from the second performance of the semi-final to the end of the final. Meanwhile, Pernice holds the record for the most 10s received by a professional, with 98, whilst Ayling-Ellis holds the record for the most 10s received by a series champion, with 30.", "| Chris Hollins & Ola JordanKimberley Walsh & Pasha KovalevDenise van Outen & James JordanCaroline Flack & Pasha Kovalev Georgia May Foote & Giovanni Pernice Danny Mac & Oti Mabuse Joe McFadden & Katya Jones Faye Tozer & Giovanni PerniceAshley Roberts & Pasha Kovalev HRVY & Janette ManraraRhys Stephenson & Nancy Xu", "| Lisa Snowdon & Brendan Cole Ricky Whittle & Natalie LowePamela Stephenson & James JordanHarry Judd & Aliona VilaniKelvin Fletcher & Oti Mabuse  Karim Zeroual & Amy Dowden AJ Odudu & Kai Widdrington", "| Jason Donovan & Kristina Rihanoff Denise van Outen & James Jordan Louis Smith & Flavia Cacace Natalie Gumede & Artem Chigvintsev Caroline Flack & Pasha KovalevKellie Bright & Kevin Clifton Ore Oduba & Joanne CliftonDanny Mac & Oti MabuseAshley Roberts & Pasha Kovalev Faye Tozer & Giovanni PerniceKelvin Fletcher & Oti MabuseBill Bailey & Oti Mabuse Maisie Smith & Gorka MárquezRose Ayling-Ellis & Giovanni Pernice John Whaite & Johannes Radebe", "| Ali Bastian & Brian FortunaPamela Stephenson & James JordanFaye Tozer & Giovanni Pernice"]}, {"page": "Cherie Lunghi", "response": ["In 2008, she competed in the sixth series of BBC television's Strictly Come Dancing (14-week run), partnered by James Jordan. After her first dance, the Foxtrot on the Ladies Night in week two, she scored the highest points of the first two weeks (33). She beat this score with another series-best score of 35/40 for the rumba to finish week four atop the remaining 12 contestants with an average score of 34/40. The score for her third dance, the American Smooth, was an impressive 34 to maintain her average, though she slipped to 31/40 for the Paso Doble, and further to 26/40 on her fifth outing, in the Salsa. She returned to form the following week with a Waltz, scoring 36/40, and was joint first on the leaderboard. ", "She was voted off the competition on 16 November 2008 (week nine), losing by three votes to one in the dance-off against model Lisa Snowdon after performing a Cha-Cha-Cha. In the January/February 2009 Strictly Tour, she danced an American Smooth and a rumba with James Jordan."]}, {"page": "Georgina Bouzova", "response": ["Bouzová has also appeared on BBC TV series Strictly Come Dancing series 4 with dance partner James Jordan, as a last-minute replacement for Gabby Logan, who was declined permission by her employers, ITV, to take part in the rival network's programme. Bouzová and her partner were voted off on the fourth show of the series."]}, {"page": "Zöe Lucker", "response": ["In September 2009, Lucker was announced as a contestant for series 7 of Strictly Come Dancing. Her former Footballers Wives co-star, Laila Rouass also participated in the series. She was partnered up with professional ballroom dancer James Jordan. Despite earning high scores and having the third highest average, the couple were eliminated on 31 October, after being in a dance-off against Ali Bastian and her partner Brian Fortuna. In November that year, it was confirmed that she would take part in the Strictly Come Dancing 2010 live tour at arenas across the UK."]}, {"page": "Dancing on Ice", "response": ["| James Jordan & Alexandra Schauman", "|style=\"background: gold;\"| James Jordan", "| James Jordan"]}, {"page": "James Jordan", "response": ["*James Jordan (cricketer) (1793–1866), English first-class cricketer", "*James Jordan (American football) (born 1978), American football player", "*James Jordan (conductor) (born 1953), American musician, writer and educator", "*James Jordan (dancer) (born 1978), English professional ballroom dancer", "*James Jordan (actor) (born 1979), American television performer", "*James Jordan (Indiana judge) (1842–1912), Indiana Supreme Court Justice", "*James Jordan (publicist) (1930–2004), American publicist and advertising copywriter"]}]}}