{"wiki_id": "http://www.wikidata.org/entity/Q6132709", "itemLabel": "James Donaldson", "itemDescription": "Scottish printer and newspaper publisher, founder of Donaldson's Hospital", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Donaldson_(publisher)", "wikipedia_page": {"main": "Sir James Donaldson (10 December 1751 – 16 December 1830) was a Scottish printer and newspaper publisher. He bequeathed a large part of his estate to the founding of Donaldson's Hospital.", "link_mentions": [{"page": "List of Scots", "response": ["* James Donaldson (1751–1830), publisher of the Edinburgh Advertiser; founder of Donaldson's Hospital"]}, {"page": "Princes Street", "response": ["*85 – James Donaldson (publisher)"]}, {"page": "John Kay (caricaturist)", "response": ["* James Donaldson"]}, {"page": "Donaldson's School", "response": ["Donaldson's School was founded in 1851 and was housed in the Donaldson's Hospital Building in West Coates, Edinburgh. The school and building were paid for by Sir James Donaldson (1751–1830), who, for a time, was publisher of the Edinburgh Advertiser. The original benefaction was that there should be 200 boys and 200 girls and allowed for special bursaries for poor children. Not all were deaf, although applications on behalf of deaf children were encouraged. From 1938, pupils were exclusively deaf. This benefaction was similar in style to the benefaction of George Watson, who founded and supported other schools in Edinburgh."]}, {"page": "History of Edinburgh Zoo", "response": ["Scotland's first zoo was called The Royal Edinburgh Zoological Gardens, and predated the modern Edinburgh Zoo by some 70 years. After the death of James Donaldson, a wealthy Scottish publisher and bookseller, the gardens of his country house, Broughton Hall (the area now covered by Bellevue) were converted into a zoological park."]}, {"page": "St John's, Edinburgh", "response": ["* James Donaldson (1751–1830), founder of Donaldson's School for the Deaf"]}, {"page": "Edinburgh Advertiser", "response": ["Its first publishers were Alexander Donaldson and John Reid. Reid's name appeared on the masthead briefly, only through 21 August 1764, at which time, only Donaldson's continued.Couper, P. 106 Donaldson, a bookseller as well as printer and publisher, is most notable for the 1774 Donaldson v Beckett court case relating to shared perpetual copyrights. In 1774, the newspaper passed from Donaldson to his son, James Donaldson. In 1820, James sold the paper to Claud Muirhead of Heriot Row and Gogar Park, Midlothian. Of the large fortune made by the Donaldsons, James bequeathed it for the endowment of Donaldson's Hospital."]}, {"page": "Alexander Donaldson (bookseller)", "response": ["Donaldson was the son of Dr James Donaldson (died 1754), a textile manufacturer and Treasurer of Edinburgh. His mother was Elizabeth Weir (died 1768).  He had an older brother, John. His paternal grandfather was Capt. James Donaldson, publisher of The Edinburgh Gazette.Couper, p 108  Donaldson inherited approximately £10,000 from his father."]}, {"page": "James Donaldson", "response": ["James Donaldson may refer to:", "*James Donaldson (classical scholar) (1831–1915), Scottish classical scholar, and educational and theological writer", "*James Donaldson (basketball) (born 1957), retired professional English-American basketball player", "*James Donaldson (publisher) (1751–1830), publisher of the Edinburgh Advertiser; founder of Donaldson's Hospital", "*James Donaldson (rugby league) (born 1991), English rugby league player", "*James Donaldson (cricketer) (born 1943), English cricketer"]}, {"page": "1830 in Scotland", "response": ["* 16 December – Sir James Donaldson printer and newspaper publisher, who bequeathed a large part of his estate to the founding of Donaldson's Hospital (born 1751)"]}, {"page": "1751 in Scotland", "response": ["* 10 December – James Donaldson, printer, newspaper publisher and philanthropist (died 1830) "]}, {"page": "Alexander Gillespie", "response": ["He was surgeon to Donaldson's Hospital, a school which had family connections. His sister Jane Gillespie (1770–1828)The Edinburgh Magazine, Or Literary Miscellany,(1792) Edinburgh. Volume 16 p 359. https://books.google.co.uk/books?id=B183AQAAMAAJ&pg=PA350&lpg=PA350&q=jane+gillespie+donaldson+edinburgh&source=bl&ots=4snJR2Iur5&sig=dg6q98J64G1fxIwx7iWnbKbdAAM&hl=en&sa=X&ved=0ahUKEwjM3sPJgcHXAhUD2RoKHXTFDUoQ6AEIVTAO#v=onepage&q=jane%20gillespie%20donaldson%20edinburgh&f=false married James Donaldson (1751–1830), who bequeathed a large part of his estate to establish Donaldson's Hospital, founded to maintain and educate poor children.Hogg, James. (ed) Donaldson's Hospital in Titan: a monthly magazine.Edinburgh, James Hogg, Vol 4, 1850. p103. https://play.google.com/books/reader?id=i7ERAAAAYAAJ&printsec=frontcover&output=reader&hl=en_GB&pg=GBS.PP103 There is an insight into Alexander Gillespie's practice in his son's obituary which observes that Alexander Gillespie 'worked his easy largely aristocratic practice with a light hand...'Obituary. Dr James Donaldson Gillespie. Edinburgh Medical Journal. January 1892 p674", "Their son, James Donaldson Gillespie (1824-1891) graduated MD from the University of Edinburgh, gained the FRCSEd diploma, became a surgeon in the Royal Infirmary of Edinburgh and was President of the Royal College of Surgeons of Edinburgh between 1869 and 1871.Obituary. Dr James Donaldson Gillespie. Edinburgh Medical Journal. January 1892 p674"]}, {"page": "Bellevue, Edinburgh", "response": [", then owned by James Donaldson "]}, {"page": "Claud Muirhead", "response": ["In 1820 he purchased the publication rights of the Advertiser from James Donaldson (the founder of Donaldson's School). He moved the publishing of the paper to his father's printworks at Rose Street. An extra storey was built onto the two storey building at this time."]}, {"page": "Lady Glenorchy's Church", "response": ["*James Donaldson founder of Donaldson's School for the Deaf"]}]}}