{"wiki_id": "http://www.wikidata.org/entity/Q6134804", "itemLabel": "James Gowans", "itemDescription": "English cricketer and rugby union footballer (1872-1936)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Gowans_(rugby_union)", "wikipedia_page": {"main": "Major James Gowans, DSO (23 April 1872 – 14 March 1936) was an English-born sportsman who played international rugby union as a wing for Scotland and as a cricketer represented Marylebone Cricket Club.", "link_mentions": [{"page": "List of Old Harrovians", "response": ["*James Gowans (1872–1936), rugby player"]}, {"page": "Gowans", "response": ["* James Gowans (disambiguation), multiple people, including:", "**James Gowans (architect) (1821–1890), Scottish architect and quarry owner", "**James Gowans (rugby union) (1872–1936), Scottish rugby union player", "**James Gowans (Australian footballer) (born 1977), Australian footballer"]}, {"page": "List of cricket and rugby union players", "response": ["| James Gowans"]}, {"page": "James Gowans", "response": ["James Gowans may refer to:", "*Sir James Gowans (architect) (1821–1890), Scottish architect and quarry owner", "*James Gowans (rugby union) (1872–1936), Scottish rugby union player", "*James Gowans (Australian footballer) (born 1977), Australian footballer"]}, {"page": "1899 British Lions tour to Australia", "response": ["The makeup of the touring squad was described in the earliest communication of 1897 from Mullineux, as a team made of University students from his school Cambridge, as well as Oxford University, and also of international representatives. Two problems faced Mullineux, the first was that the timing of the tour meant that players would need to leave Britain in early May, when the university vacations had not yet begun. The second was that a long tour would preclude many of the best players from participating due to other commitments. Consequently, early lists of probable touring players had few players listed that finally made the tour. In the pool of potential players the following were noted: James Byrne, Cecil Boyd, Viv Huzzey, Zimans, Ernest Fookes,The Star misspells the name as Tookes. Lindsay Watson, M Elliott, Herbert Dudgeon, James Gowans, James Franks, J H Kipling, R Forest, Lawrence Bulger, Timoins,Otago Witness, 11 May 1899. Timoins is probably Alec B Timms who did tour. R O Swartz, C B Marston, W Neeks (or Needs), Dr Rowland, J W Gorman, and James Couper. Among these names were several high-profile players that recruitment attempts failed to secure. Byrne declined due to pressure of business, while Ernest Fookes was awaiting a serious medical operation. The final member to join the team was Scottish international Alf Bucher, after failed approaches were made to recruit fellow Scot James Couper and Welsh wing Viv Huzzey."]}, {"page": "List of Scottish rugby union players", "response": ["| James Gowans"]}, {"page": "James Gowans (rugby player)", "response": ["#REDIRECT James Gowans (rugby union)"]}, {"page": "List of Scotland national rugby union players", "response": ["|174||GowansJames Gowans||three-quarters||1893-02-04||v Wales at Edinburgh"]}, {"page": "List of Marylebone Cricket Club players (1864–1894)", "response": ["* James Gowans (1891) : J. Gowans ()"]}]}}