{"wiki_id": "http://www.wikidata.org/entity/Q6130260", "itemLabel": "James Brodie of Brodie", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Brodie_(botanist)", "wikipedia_page": {"main": "James Brodie of Brodie, 21st Thane and Chief of Clan Brodie, FRS FLS (31 August 1744 – 17 January 1824) was a Scottish politician and botanist. He was educated at Elgin Academy and St. Andrews University. He was returned to parliament in 1796 as MP for Elginshire, serving until 1807. He was appointed Lord Lieutenant of Nairn.As a botanist, Brodie specialised in cryptogamic flora, i.e. plants which reproduce by spores, such as algae, ferns and mosses. He discovered a number of new species both around Edinburgh and on his own property at Brodie. His collection is now held at the Royal Botanic Garden Edinburgh. He corresponded with other eminent botanists of his time, including Sir William Jackson Hooker and Sir James Edward Smith. Brodie was elected a Fellow of the Linnaean Society in 1795, and of the Royal Society in 1797. The genus Brodiaea is named in his honour.He married Lady Margaret Duff, sister of James Duff, 2nd Earl Fife, and had two sons and two daughters.", "link_mentions": [{"page": "Richard Anthony Salisbury", "response": ["Salisbury contributed annotations to Edward Rudge's Plantarum Guianæ Icones (1805–07), and descriptions to Paradisus Londinensis (1806–09). The latter was illustrated by William Hooker, and contained the genus name Hookera honouring him. Smith improperly renamed the genus Brodiaea a few years later, after his wealthy \"friend and patron\", James Brodie of Brodie."]}, {"page": "Clan Brodie", "response": ["*During the Jacobite rising of 1715, James Brodie of Brodie, the 18th chief, refused to surrender his horse and arms to Lord Huntley. Lord Huntley threatened the \"highest threats of military execution, as that of battering down his house, razing his tenants, burning their corns, and killing their persons.\" if Brodie did not comply. Clan Brodie continued to resist, holding fort in the now rebuilt Brodie Castle. Unable to secure enough cannon and gunpowder to proceed with an assault, Lord Huntley was forced to abandon his threats.Bain (1893), pp. 302–304", "*By 1774 the Brodie estate was in financial trouble and sold by judicial sale. James Brodie of Brodie, the 21st Chief, was married to Lady Margaret Duff, daughter of William Duff, 1st Earl of Fife. The Earl of Fife came to the rescue, purchased the estate, returning half to The Brodie.Bain (1893), pp. 433–434", "*James Brodie of Brodie's younger brother, Alexander, left for India to seek his fortune. He returned from Madras a very rich man and purchased the estates of Thunderton House in Elgin, Arnhall in Kincardineshire, and The Burn. He married a daughter of James Wemyss of Wemyss by Lady Elizabeth Sutherland, daughter of the William Sutherland, 17th Earl of Sutherland and had an only child, a daughter, Elizabeth. Elizabeth Brodie was an heiress, and in 1813 married George Gordon, Marquess of Huntly who became, on his father's death in 1827, The 5th Duke of Gordon. George and Elizabeth did not have any children, and on his death in 1836, the line of the Dukes of Gordon became extinct. Leaving Elizabeth the last Duchess of Gordon. After her husband's death, the Duchess joined the Free Church of Scotland, and was its most prominent benefactor. The Duchess was \"much respected and beloved by the people of Huntly and the surrounding district.\" and lived \"a remarkably unaffected, charitable, and Christian life\".Bain (1893), pp. 389–390.Oxford Dictionary of National Biography, entry: Gordon née Brodie, Elizabeth, duchess of Gordon (1794–1864)Electric Scotland-Historic Earls and Earldoms of Scotland, Chapter III – Earldom and Earls of Huntly, Section XIX Gordon (1865).", "*James Brodie of Brodie's son, James Brodie, younger of Brodie, went to India and worked for the East India Company. He built a mansion in Madras, on the banks of the river Adyar, and named it Brodie Castle (Madras) {Photo}. This property still stands and has become the College of Carnatic Music. James (the younger) died in India in a boating accident on the Adyar River in 1801/02.Brodie, James (1991), pp. 132–134."]}, {"page": "Master of Work to the Crown of Scotland", "response": ["*1809–1824: James Brodie of Brodie"]}, {"page": "List of alumni of the University of St Andrews", "response": ["| James Brodie of Brodie"]}, {"page": "1824 in Scotland", "response": ["* 17 January – James Brodie of Brodie, botanist, clan chief and politician (born 1744)"]}]}}