{"wiki_id": "http://www.wikidata.org/entity/Q6147109", "itemLabel": "Jamie Lewis", "itemDescription": "Welsh darts player", "wikipedia_url": "https://en.wikipedia.org/wiki/Jamie_Lewis", "wikipedia_page": {"main": "Jamie Lewis (born 8 November 1991) is a Welsh professional darts player.", "link_mentions": [{"page": "Phil Taylor (darts player)", "response": ["Taylor then won the Gibraltar Darts Trophy. He dropped just seven legs in the six matches he played which concluded with a 6–1 victory over Jamie Lewis in the final. However, Taylor's win in Gibraltar was later the subject of controversy as footage emerged showing him winning a leg and retrieving his dart when he had actually missed the double. Neither referee Russ Bray nor his opponent Dean Winstanley noticed the error and Taylor went on to win the match 6–1. Taylor insisted that he had not realised that the dart had missed and offered to replay the match and forfeit his prize money. The PDC released a statement blaming the incident on human error. The incident led to a feud with Taylor's old mentor Eric Bristow who stated: \"The player knows if it's not in the bed and has to declare it. You don't want cheats in the game\". Taylor responded by claiming that Bristow's comments were \"hurtful\" and that he would not be talking to Bristow again.", "The 2018 PDC World Darts Championship was Taylor's 29th world championship appearance, surpassing the record he held jointly with John Lowe. He had previously announced that he would retire after the tournament. He entered the tournament ranked 6th in the PDC Order of Merit. Wins over Chris Dobey, Justin Pipe, Keegan Brown, Gary Anderson and Jamie Lewis took him to his 21st world final, extending his own record. However, he was beaten 7–2 in the final by Rob Cross, who was making his first appearance in the tournament. During the match, Taylor also missed a double for a nine-dart finish, which would have been his first in a world championship match. Taylor said afterwards: \"I tried my best but he was like me 25 years ago, he was relentless and didn't stop putting me under pressure.\" He added: \"It was like an old man against a young man, it was a mis-match. That's it for me because I haven't got the energy or interest to beat Michael van Gerwen or him (Cross).\""]}, {"page": "Jamie", "response": ["* Jamie Lewis (born 1991), Welsh darts player"]}, {"page": "World Matchplay (darts)", "response": ["| Jamie Lewis"]}, {"page": "James Wade", "response": ["At the World Series of Darts Finals, Wade defeated debutant Ross Smith 6–3 in the first round. He then defeated hometown favorite Mensur Suljović 6–3 in the second round and Jamie Lewis 10–5 in the Quarter-Finals, continuing his excellent stretch of form. It was the first time since 2011 that Wade won 8 consecutive TV major matches. In the Semi-Finals, Wade dispatched 5-time World Champion Raymond van Barneveld 11–2 in a high quality affair in which Wade averaged 100 and hit 65% of his doubles. This win stretched Wade's unbeaten TV run to 9 matches, the first time he had achieved this feat since 2008. In the Final, Wade played Michael Smith. Wade got off to a 3-leg advantage but Smith would peg him back to 5–5 before the second break. Wade would go onto break Smith in the 19th leg to serve the title out at 10–9 but he busted his score of 121, and Smith eventually came back and won the leg. In the decider, Smith missed 5 match darts and Wade sealed the title on D18. The tournament victory was Wade's second major in 7 days, and the 10th of his career. It was also Wade's first World Series Title. Wade's tournament victories sealed his place in the 2018 Grand Slam of Darts where he drew Keegan Brown, Mark Webster and Wesley Harms to comprise Group C. Wade won his opening group match, whitewashing BDO player Wesley Harms 5–0 with a 99 average. In his second group game, Wade defeated Keegan Brown 5–3, averaging 105. In doing so, Wade set a new personal record of 12 TV major wins in succession. Wade defeated Mark Webster 5–1 with a 102 average in the final group match to top the group, extending his unbeaten run to 13 matches and setting up a Round of 16 showdown with Michael Unterbuchner. Wade lost, rather surprisingly, to Michael Unterbuchner 10–6."]}, {"page": "World Masters (darts)", "response": ["|  Jamie Lewis", "|  Jamie Lewis"]}, {"page": "WDF World Cup", "response": ["| Jamie Lewis"]}, {"page": "Darren Webster", "response": ["*2018: Quarter-finals (lost to Jamie Lewis 0–5)"]}, {"page": "Mark Webster (darts player)", "response": ["Webster saw off Ron Meulenkamp 3–1 in the first round of the 2015 World Championship and then missed one dart to level at 1–1 in the next round against Phil Taylor, going on to be whitewashed 4–0. He just hung on to his top 32 ranking after the event as he was the world number 32. At the first UK Open Qualifier of the year, Webster reached his first semi-final in an individual event for three years where he was edged out 6–5 by Michael van Gerwen. The result helped him enter the UK Open at the third round stage but he was beaten 9–5 by William O'Connor. Webster played with Jamie Lewis at the World Cup for the first time and they suffered a surprise 5–3 loss to Hong Kong in the opening round."]}, {"page": "Mick McGowan", "response": ["He played in his second World Cup for Ireland in 2012, again paired with O'Connor and, as in 2010, they reached the second round this time by defeating Malaysia 5–2. They played the same Australian pair as in 2010 next and were whitewashed 0–4. In the rest of 2012 he could not advance beyond the last 64 of any of his events. McGowan finished the year ranked world number 169, well outside of the top 64 who retain their places on the PDC tour and he did not have automatic entry into any event in the future. In the 2015 Tom Kirby Memorial Irish Matchplay final he beat Tom Biggane  6-5 to qualify for the preliminary round of the 2016 PDC World Championship. At Q School, Mick picked up his tour card via the Q School Order Of Merit by reaching the Final on the fourth day, only to lose to Ross Smith 5-4. However, his run on the final day got him inside the Order Of Merit to qualify, earning him a Tour Card for the 2016 and 2017 seasons. At the World Grand Prix, McGowan blew a 1-0 lead to lose 2-1 in sets in his first-round match against James Wilson, while at the Players Championship Finals, McGowan upset Chris Dobey in the first round by a score of 6 legs to three, only to lose by the same score to Alan Norris in the next round. McGowan defeated Radoslaw Szaganski 6-5 in the final of 2016 Tom Kirby Memorial Irish Matchplay to qualify for the 2017 PDC World Championship at Alexandra Palace. As one of the three highest-ranked international qualifiers for the event, McGowan received a bye straight through to the first round of the tournament, where he faced Jamie Lewis in a losing effort.", "*2017: First round (lost to Jamie Lewis 2–3)"]}, {"page": "Steve Brown (English darts player)", "response": ["It was largely thanks to these results that he reached the 2013 World Championship by finishing 41st on the ProTour Order of Merit, taking the 11th of 16 spots that were awarded to the highest non-qualified players. Brown lost to Terry Jenkins 0–3 in the first round. After the tournament, Brown was ranked world number 36. He lost 5–4 to Adrian Gray in the first round of the 2013 UK Open. At the fifth Players Championship of the year, Brown threw a nine-dart finish during a 6–2 second round win over Connie Finnan, but lost 6–0 to Joe Cullen in the next round. At the Gibraltar Darts Trophy he hit six doubles from eight attempts to defeat Brendan Dolan 6–4 and then beat Paul Nicholson 6–3, before being whitewashed 6–0 by youngster Jamie Lewis in the third round. He reached the same stage of the German Darts Championship with impressive 6–2 wins over both Gary Anderson and Ian White, but lost by a reverse of this scoreline to Richie Burnett. These two results made up almost half of Brown's prize money in 2013 and he earned the final spot for the 2014 World Championship through the ProTour Order of Merit. Brown played 27th seed Andy Smith in the opening round and missed one dart to take a 2–0 set lead. In the third set Brown wired a dart at double 12 to fall agonisingly close to hitting the third nine-dart finish of the event. He did get the double in his next visit to take the leg in 10 darts but this was the last leg he could win in the match as he was beaten 3–1. He dropped 10 places over the course of the year to begin 2014 ranked world number 46."]}, {"page": "Mensur Suljović", "response": ["In the 2014 World Championship, Suljović missed four darts to take a 2–0 set lead against Mark Webster in the first round with the match going into a deciding set. With the set on throw with Webster three legs to two ahead, Suljović attempted to finish 57 but hit consecutive single twos to fail to set up a double, and watched Webster step in to take the match. He increased his ranking by 14 places over the year to be world number 45. The first PDC major quarter-final of his career came at the UK Open by seeing off Keegan Brown, Tony Randall, Robert Thornton and Jamie Lewis. Suljović played Adrian Lewis and, although both players averaged 98, Lewis was much more clinical on his doubles to win 10–3. Suljović partnered Rowby-John Rodriguez for the first time in the 2014 World Cup of Darts and they lost both of their singles matches in the second round against the Belgium brothers Kim and Ronny Huybrechts to exit the event. At his home event the Austrian Darts Open, Suljović produced four fine displays to reach the semi-finals where he was defeated 6–3 by Vincent van der Voort. At the European Championship he lost 6–2 to Jamie Caven in the first round."]}, {"page": "Paul Hogan (darts player)", "response": ["Hogan rebounded by once again qualifying for the UK Open at Minehead, where he defeated Keegan Brown and Jamie Lewis in the opening two rounds, before upsetting back-to-back two-time world champions Gary Anderson and Adrian Lewis to reach the last 16. He was beaten by eventual runner-up Gerwyn Price."]}, {"page": "Michael Rosenauer", "response": ["In the next two years Rosenauer curtailed his darts schedule and only competed in European Tour events. In 2014 he qualified for the European Darts Open, European Darts Grand Prix and European Darts Trophy, losing in the second round of the first two and the opening round of the latter. He did attempt to qualify for the 2015 UK Open but could not win enough games. Rosenauer qualified for the European Darts Open, but lost 6–5 to Jamie Lewis in the first round."]}, {"page": "Brendan Dolan", "response": ["Dolan was outplayed by Gary Anderson in the World Championship in a 4–1 defeat. He won the fourth UK Open Qualifier by beating Jamie Lewis 6–1. A favourable draw saw Dolan beat Steve Beaton, Nigel Heydon and Aden Kirk to reach the quarter-finals of the UK Open for the first time, where he lost 10–4 to Terry Jenkins. His second title of the season and fourth in sixth months came at the fifth Players Championship where he averaged 103.66 in whitewashing Michael Smith 6–0 in the final. In June, Dolan and Mansell beat Peter Wright and Robert Thornton from Scotland in the quarter-finals of the World Cup. In the semis, Dolan edged world number one Michael van Gerwen 4–3, but Mansell lost 4–0 to Van Barneveld to send the match into a deciding doubles game in which the Dutch pair averaged an incredible 117.88 to progress with a 4–0 whitewash. Dolan won the 16th Players Championship with a 6–2 victory over Anderson at the Citywest Hotel in Dublin, the same venue where he reached the final and threw a nine-dart finish in the 2011 World Grand Prix. A day later, Anderson exacted revenge by knocking Dolan out of the first round of the World Grand Prix 2–0 in sets. He missed doubles in successive legs at 8–7 up against Van Gerwen in the second round of the European Championship and was eliminated 10–8. Dolan earned a spot in the Grand Slam through the qualifier, but lost each of his group games against Wright, Simon Whitlock and Michael Smith to finish bottom of the table."]}, {"page": "Lourence Ilagan", "response": ["Ilagan won the Philippines Qualifying Event for the 2013 World Championship and once there came back from three to one down in legs to Jamie Lewis in the preliminary round to win 4–3. He faced Colin Osborne in the first round and despite impressing with some clinical finishes, he lost 3–0. He was due to play with Perez once more in the 2013 World Cup of Darts but they were forced to withdraw due to travel problems. Later in the year he won the Hong Kong Open by beating Edward Santos in the final."]}, {"page": "Ross Smith (darts player)", "response": ["He was seeded into the third round of 2020 UK Open, but lost in his first match against Jamie Lewis 5–6. Even though the European Tour was cut short due to COVID-19, he qualified for 2020 European Championship, but lost in the deciding leg to Michael Smith. Smith had his best run in 2020 Players Championship Finals, reaching the third round after wins over Kim Huybrechts and Nathan Aspinall, before losing to Damon Heta.https://dartsnews.com/pdc/white-defeats-clemens-in-high-quality-tie-smith-dumps-out-aspinall"]}, {"page": "Daryl Gurney", "response": ["* 2019: Third round (lost Jamie Lewis 3–4)"]}, {"page": "Steve Farmer (darts player)", "response": ["He reached the second round of the PDC World Championship for the first time in 2012. In a tight game against number fourteen seed Ronnie Baxter, Farmer trailed 1–2 in the best-of-five-sets match. He then produced some of his best darts by hitting five 180's in taking six of the final eight legs to seal a 3–2 victory. He continued his run by beating German qualifier Kevin Münch in the second round, but was then whitewashed 0–4 by world number three James Wade in the last 16. In March he hit a nine-dart finish in the third UK Open Qualifier during a first round match against Andy Relf. Farmer was knocked out in the last 16 of the event by Andy Smith. Farmer lost in the preliminary round of the UK Open 1–4 to Jamie Lewis, and reached the last 16 once more in his final ten tournaments of 2012, at the penultimate Players Championship where he was beaten by Gary Anderson 6–1."]}, {"page": "William O'Connor (darts player)", "response": ["O'Connor entered 2014 ranked world number 68, just outside the top 64 who had full playing privileges for the year ahead. He entered Q School and had his best result on the third day when he was defeated 5–0 by Pete Dyos in the last 16. The result helped him finish 24th on the Q School Order of Merit to claim the final place on offer for a two-year tour card. He was edged out in the third round of the UK Open 9–8 by Jamie Lewis. O'Connor and Finnan lost five successive legs in the first round of the World Cup of Darts to be beaten 5–3 by Singapore. He was knocked out in the first round of two European Tour events, before picking up his first victory of the season at the European Darts Trophy by averaging 104.36 in a 6–4 win over Mensur Suljović. In the second round, O'Connor was 5–4 ahead of Justin Pipe but bust his score when on 70 and missed one match dart at double six to be beaten 6–5.", "At the 2015 UK Open, O'Connor overcame Dean Winstanley 5–3, Mark Webster 9–5 and Ian White 9–6 to reach the fifth round of the event for the first time where he played Stephen Bunting. The opening eight legs were shared, before Bunting took four of the next five and he went on to eliminate O'Connor 9–6. He saw off Ian White 6–1 and Vincent van der Voort 6–3 to reach his first quarter-final in three years and first in a European Tour event at the German Darts Masters. O'Connor led world number one Michael van Gerwen 3–1, but went on to lose 6–4 despite taking out three 100 plus finishes. O'Connor and Finnan's World Cup second round match with Hong Kong went to a doubles match which they lost 4–3. O'Connor was unable to advance past the first round of the World Grand Prix for the fourth time as he missed two match darts against Jamie Lewis."]}, {"page": "2009 WDF World Cup", "response": ["|  Jamie Lewis"]}, {"page": "Wales Classic", "response": ["|  Jamie Lewis"]}, {"page": "Justin Pipe", "response": ["At the 2015 World Championship, Pipe led Australian qualifier Laurence Ryder 2–1 in the first round but then lost six consecutive legs to suffer a surprise 3–2 defeat. He was knocked out in the third round of the UK Open for the second year in a row, this time 9–5 by Jan Dekker. Pipe's first final of the year came at the Dutch Darts Masters in June which he reached without facing a single top 20 player, but he was whitewashed 6–0 by Michael van Gerwen. He lost 10–7 in the first round of the World Matchplay to Jamie Lewis and 3–0 in sets to Robert Thornton in the second round of the 2015 World Grand Prix. After failing to get past the second round of the last two majors he played in 2015, it meant that Pipe has not reached the quarter-finals of a major event in over two years."]}, {"page": "Scott MacKenzie (darts player)", "response": ["Mackenzie qualified for his 3rd PDC World Championship in 2015 where MacKenzie reached the final of the 2015 World Championship PDPA qualifier and lost 5–2 to Jason Hogg. However, it was enough to earn him a spot in the preliminary round of the event where he raced into a 3–0 lead over Daryl Gurney and missed one dart to win 4–0. Gurney levelled the match at 3–3, before MacKenzie missed a dart at double 11 to complete a 142 finish and was defeated 4–3. MacKenzie and Lam caused a couple of shocks at the World Cup. First they defeated Wales' Mark Webster and Jamie Lewis 5–3. Lam then beat Ireland's William O'Connor 4–1, but MacKenzie missed six match darts against Connie Finnan from 3–0 up to lose 4–3 meaning a doubles match was needed to settle the tie. It went to the final leg in which MacKenzie finished 86 to send Hong Kong into the quarter-finals. However, number two seeds Scotland proved to be too much as Gary Anderson and Peter Wright won both their singles matches 4–2 to eliminate Hong Kong. MacKenzie claimed the 2015 Hong Kong Open by beating Alex Hon. Mackenzie and Lam represented Hong Kong for a third successive time at the PDC World Cup in 2016 where again they played Ireland, a team consisting of William O'Connor and Mick McGowan, and they eventually lost 5–4 in the first round."]}, {"page": "Ian White (darts player)", "response": ["White won six consecutive legs against Kim Huybrechts in the second round of the 2015 World Championship to take a 3–2 lead, but from there could only win one more leg as he lost 4–3. White threw a nine-dart finish in a 6–3 victory over Mervyn King in the quarter-finals of the final UK Open Qualifier and then averaged 109.37 in edging past Raymond van Barneveld 6–5, before losing 6–2 against Phil Taylor in the final. He also hit a nine darter during a 6–3 success over Jamie Lewis in the semi-finals of the 11th Players Championship, but lost 6–1 to Dave Chisnall in the final. A third defeat in a final this year came at the 14th event where he was eliminated 6–2 by Jelle Klaasen."]}, {"page": "Michael Smith (darts player)", "response": ["After seeing off Mensur Suljović 3–1 in the first round of the 2015 World Championship, Smith beat Brendan Dolan 4–2 after having been 2–0 down, to set up a third round tie with fellow St. Helens player Stephen Bunting. Despite taking out checkouts of 170 and 132, Smith was 3–0 down, before finding his scoring game to restrict Bunting to one leg as he closed the gap to 3–2. Ultimately his slow start to the match proved costly as he lost the next set to be knocked out 4–2 in a game that saw each player average 102 and hit eight 180s apiece. Smith won the fifth UK Open Qualifier by beating Adrian Lewis 6–5. A rematch with Bunting followed in the third round of the UK Open, with Smith missing two match darts in the deciding leg to be beaten 9–8. He claimed the second European Tour title of his career by winning the International Darts Open with a 6–3 victory over Benito van de Pas in the final. Smith suffered a 10–4 defeat to Gerwyn Price in the first round of the World Matchplay, but retained his European Darts Trophy title by seeing off Michael van Gerwen in the final for the second year in a row. At the World Grand Prix he punished two missed match darts from Price to beat him 2–1, but Smith then lost from 2–0 up in sets against Jamie Lewis in the second round. Wins over Wayne Jones, Lewis and Andy Fordham saw Smith top his group at the Grand Slam and he then averaged 104.59 to beat Dave Chisnall 10–7 and reach the quarter-finals. Smith's first major event semi-final soon followed as he defeated Lewis 16–11, but he was heavily beaten 16–6 by Van Gerwen."]}, {"page": "Peter Hudson (darts player)", "response": ["Hudson's best result in 2012 was at the seventh Players Championship of the year, where he beat the likes of Mervyn King and Robert Thornton, before losing to Ronnie Baxter 6–1 in the quarter-finals. Hudson beat Jamie Lewis to reach the last 64 of the UK Open for the second successive year. There he played Kim Huybrechts and lost 9–4. He qualified for three of the five new European Tour events, losing in the first round in two of them. In the other, the German Darts Masters he saw off Alan Tabern 6–4, before being defeated by reigning world champion Adrian Lewis 6–1 in the second round."]}, {"page": "James Richardson (darts player)", "response": ["In 2017 he played in the quarter-finals of the eighth Players Championship and was beaten 6–4 by Joe Cullen. He qualified for multiple European Tour events and also for European Championship (finishing in last 32) and Players Championship Finals (finishing in last 64). He made a great run in PDC World Darts Championship 2018, defeating Kim Huybrechts and Alan Norris. He lost in last 16 to Jamie Lewis, but made his best result in the event.", "*2018: Third round (lost to Jamie Lewis 1–4)"]}, {"page": "PDC Awards Dinner", "response": ["Silver Pins (non-televised): Robbie Green, Ian White, Michael van Gerwen (x3), Peter Jacques, John Goldie, Cameron Menzies, Jamie Lewis, Noel Malicdem, Steve Hine, Stephen Bunting, Nathan Aspinall, Dawson Murschell, Dennis Nilsson, Lee Turle, Simon Preston, Adrian Lewis, Vincent van der Voort, James Wade, Krzysztof Ratajski, Rowby-John Rodriguez, George Killington, Peter Hudson, Andrew Gilding, Jimmy Hendriks, Eddie Lovely", "Silver Pins (non-televised): Robert Allenstein, Kyle Anderson, Steve Beaton, Dave Chisnall, Joe Cullen, Mike De Decker, Mark Dudbridge, Ted Evetts, Rob Hewson, Kim Huybrechts, Ronny Huybrechts, Christian Kist, Adrian Lewis, Jamie Lewis, Mickey Mansell, Ryan Meikle, Kenny Neyens, Mensur Suljovic, Michael van Gerwen, Darren Webster, Ricky Williams, Peter Wright", "**Jamie Lewis", "Silver Pins (non-televised): Alan Norris (x2), Dyson Parody, Andrew Gilding, Simon Whitlock, Ian White (x2), Kyle Anderson, Nathan Derry, Jeffrey de Zwaan, Cristo Reyes (x2), Darren Johnson, Benito van de Pas, Matt Dicken, Dirk van Duijvenbode, Devon Petersen, James Wade, Peter Wright, Max Hopp, Magnus Caris, Simon Preston, Kim Huybrechts, Jamie Lewis, Michael van Gerwen, Phil Taylor", "**Jamie Lewis", "**Jamie Lewis"]}, {"page": "Christian Kist", "response": ["Kist lost 5–2 to Matt Padgett in the final round of the third day, but finished in the top 24 on the Q School Order of Merit to seal a two-year PDC tour card. His first quarter-final came a month later at the fourth UK Open Qualifier where he lost 6–1 to Jamie Lewis. At the UK Open he saw off Antonio Alcinas 9–2 and survived as Vincent van der Voort missed match darts in three successive legs in the next round to win 9–8. In the fifth round, Kist was beaten 9–6 by Mervyn King. At the third Players Championship, Kist beat James Wade 6–3 to reach his first semi-final on the PDC tour where he missed four match darts against Gary Anderson and went on to lose 6–5. He let 3–1 and 5–3 leads slip in the first round of the European Championship against Mervyn King to lose 6–5. At the Grand Slam he enjoyed 5–2 and 5–1 wins over Andy Hamilton and Richie George to finish second in his group behind Phil Taylor. In the last 16, Kist started well to be 3–0 ahead of Michael Smith, but went on to be eliminated 10–5. Kist was the final qualifier for the Players Championship Finals and missed one dart at the bull to beat Anderson, instead being defeated 6–5 with an average of 100.40 to Anderson's 110.62."]}, {"page": "2013 PDC World Darts Championship", "response": ["*  Jamie Lewis", "|  Jamie Lewis", "|align=\"left\"|  Jamie Lewis"]}, {"page": "2012 UK Open", "response": ["| Jamie Lewis", "| Jamie Lewis", "| Jamie Lewis"]}, {"page": "2012 European Darts Open", "response": ["*  Jamie Lewis (First round)"]}, {"page": "2012 German Darts Masters", "response": ["*  Jamie Lewis (First round)"]}, {"page": "Jamie Lewis (darts player)", "response": ["#REDIRECT Jamie Lewis"]}]}}