{"wiki_id": "http://www.wikidata.org/entity/Q6141184", "itemLabel": "James Peter Hill", "itemDescription": "British zoologist", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Peter_Hill", "wikipedia_page": {"main": "James Peter Hill FRS (21 February 1873 – 24 May 1954) was a Scottish embryologist.", "link_mentions": [{"page": "Linnean Medal", "response": ["*1930: James Peter Hill"]}, {"page": "D. M. S. Watson", "response": ["After his MSc, Watson continued to develop his wide interest in fossils and studied intensively at the British Museum of Natural History in London, and on extended visits to South Africa, Australia, and the United States. In 1912 he was appointed as a lecturer in Vertebrate Palaeontology, at University College London by Professor James Peter Hill."]}, {"page": "James Hill", "response": ["* James Peter Hill (1873–1954), British-born Australian embryologist"]}, {"page": "C. R. Narayan Rao", "response": ["Professor Rao presided over the zoology section of the Indian Science Congress in 1938 at Lahore. His account of the ovarian ovum of the slender loris was presented to the Royal Society by James Peter Hill in the latter's Croonian Lecture."]}, {"page": "Australian and New Zealand Association for the Advancement of Science", "response": ["* 1907 James Peter Hill"]}, {"page": "Golden Book of Cycling", "response": ["* James Peter Hill, Citation in 1964"]}, {"page": "List of fellows of the Royal Society G, H, I", "response": ["| James Peter Hill||01/05/1913||22 February 1873 – 24 May 1954"]}, {"page": "List of fellows of the Royal Society elected in 1913", "response": ["*James Peter Hill"]}, {"page": "Edward Alfred Minchin", "response": ["Lankester had long lobbied for a permanent Chair of Protozoology at the University of London and in 1906 the position was finally created, associated with the Lister Institute of Preventive Medicine. Minchin was appointed to the job which he continued to hold until his death in 1915. He was succeeded as the Jodrell Chair of Zoology and Comparative Anatomy by James Peter Hill.  While working at the Lister Institute Minchin's research focus moved to parasitic protozoa, especially trypanosomes. In 1905 he visited Uganda to study sleeping sickness, and went on to study trypanosomes in humans and other animals including rats and birds."]}, {"page": "Jodrell Professor of Zoology and Comparative Anatomy", "response": ["*1906-21 James Peter Hill "]}]}}