{"wiki_id": "http://www.wikidata.org/entity/Q6140090", "itemLabel": "James Motley", "itemDescription": "British botanist and naturalist (1822-1859)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Motley", "wikipedia_page": {"main": "James Motley (2 May 1822 – 1 May 1859) was a Yorkshireman closely associated with South Wales and Borneo.", "link_mentions": [{"page": "Hugh Low", "response": ["In Labuan, Low acquired administrative experience, fluency in Malay and an enduring reputation as a naturalist, although he quarrelled with geologist/naturalist James Motley. He was Police Magistrate from 1850 to 1877. It was also from Labuan he made his three visits to Mount Kinabalu, the first in March 1851 and twice with Spenser St. John, the consul General of Brunei, in 1858.The Living Age By Eliakim Littell, Making of America Project, Robert S. Littell Published by Living Age Co., 1848The Annual Register Published by Rivingtons, 1906; Item notes: 1905"]}, {"page": "Baccaurea motleyana", "response": ["The specific name is for James MotleyProdr. (DC) 15.2 p.461 (1866) who collected it in southeast Borneo prior to his murder."]}, {"page": "Lewis Llewelyn Dillwyn", "response": ["Dillwyn was a prominent member of the Aborigines' Protection Society, a Fellow of the Linnean Society and a Fellow of the Geological Society and delivered talks on ornithology and natural history to the Royal Institution of South Wales. One of the lectures was about Labuan, a tiny British colony next to Borneo. Dillwyn, together with James Motley, a fellow member of the RISW, published an illustrated volume, intended as first of a series, on the natural history of Labuan.Contributions to the natural history of Labuan, and the adjacent coasts of Borneo Within the field of ornithology Dillwyn also named the bird species Megapodius cumingii (Philippine megapode). He was also a photographer, his brother John Dillwyn Llewelyn being a pioneer photographer and botanist."]}, {"page": "Leeds Philosophical and Literary Society", "response": ["*James Motley – donor"]}, {"page": "Eastern Archipelago Company", "response": ["Operations began when James Motley was sent to Labuan in 1849. He was to take over the rudimentary coal workings and commence supplies to Royal Navy and East India Company steamers, for which a contract with the British Admiralty was already in place. The company did not provide him with sufficient resources to develop underground works at the same time as supplying the navy and he had to apply for funds from the government. The governor, James Brooke, ruled that the price of coal should be raised temporarily, but omitted to tell the navy who refused to pay and even made deductions for transport to their ships although the contact did not require it.Parliamentary Papers [1976] (1855) The company hoped to supply P&O China mail ships, but there were complaints about quality as well as quantity which were not helped by friction with the authorities. James Brooke commenced legal action in 1850 to have the charter revoked: the confirmation of the grant of the charter in 1848 was ruled fraudulent in 1852 but the company considered this a technicality."]}, {"page": "Banjarmasin War", "response": ["On 1 May 1859, all the Europeans at the Julia Hermina coal mine at Kalangan were murdered, as were all at the missionary settlement near Poctor Petak. At the mine, Englishman James Motley, his wife, and three children, all died.1859, July 16th, Leeds Mercury, The Massacre of Europeans in Borneo Hidayat responded with loyalty to the Dutch: he was the first to alarm the Government of what had happened during the attack on the Pengaron mining complex three days earlier and the further attack plans of the rebels; when the mining complex at Kalangan was assaulted on 1 May, he tracked down the women and children who survived the attack and put them under protection in Bandjermasin, and he helped organise the defence."]}, {"page": "Motley (surname)", "response": ["*James Motley (1822–1859), English engineer and naturalist"]}, {"page": "Madhuca motleyana", "response": ["Madhuca motleyana is a tree in the family Sapotaceae. It is named for engineer and naturalist James Motley, who lived and worked in Borneo in the 1850s."]}, {"page": "List of botanists by author abbreviation (M)", "response": ["* Motley – James Motley (1822–1859)"]}, {"page": "Castanopsis motleyana", "response": ["Castanopsis motleyana is a tree in the family Fagaceae. It is named for the botanist James Motley."]}, {"page": "Motley, James", "response": ["#redirectJames Motley"]}, {"page": "List of plant genera named for people (K–P)", "response": ["|data-sort-value=\"Motley\"|James Motley (1822–1859)"]}]}}