{"wiki_id": "http://www.wikidata.org/entity/Q614576", "itemLabel": "James Hook", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Hook_(composer)", "wikipedia_page": {"main": "James Hook (3 June 1746 – 1827) was an English composer and organist.", "link_mentions": [{"page": "1746", "response": ["* June 3 – James Hook, English composer (d. 1827)"]}, {"page": "1805 in music", "response": ["*James Hook – The Soldier's Return"]}, {"page": "1827 in music", "response": ["**James Hook, composer (b. 1746)"]}, {"page": "1797 in music", "response": ["*James Hook – 6 Trios, Op. 83"]}, {"page": "Pat-a-cake, pat-a-cake, baker's man", "response": ["The earliest version set to music appears in James Hook's \"A Christmas Box\" (1796).Christmas Box by Mr Hook (p.13)"]}, {"page": "Theodore Hook", "response": ["Hook was born in Charlotte Street, Bedford Square, London. His father, James Hook (1746–1827), was a composer; his elder brother, also called James Hook, became Dean of Worcester."]}, {"page": "1790 in music", "response": ["*James Hook – \"Rosy Hannah\""]}, {"page": "1776 in music", "response": ["*James Hook – The Ascension (oratorio)"]}, {"page": "1773 in music", "response": ["*Composer James Hook vacates his post at Marylebone Gardens in London."]}, {"page": "1771 in music", "response": ["* James Hook – 6 Keyboard Concertos, Op. 1"]}, {"page": "1769 in music", "response": ["*James Hook is appointed composer to Marylebone Gardens."]}, {"page": "1767 in music", "response": ["* James Hook's first collection of songs for the Vauxhall Gardens."]}, {"page": "1765 in music", "response": ["*James Hook – \"I wish you all good night\" (song)"]}, {"page": "1763 in music", "response": ["* James Hook becomes musical director of Marylebone Gardens in London."]}, {"page": "1746 in music", "response": ["*June 3 (probable) – James Hook (composer), composer (died 1827)"]}, {"page": "Clarinet concerto", "response": ["*James Hook (1746–1827)"]}, {"page": "List of Classical-era composers", "response": ["*James Hook (1746–1827)"]}, {"page": "Vauxhall Gardens", "response": ["*James Hook, organist and composer at Vauxhall Gardens, 1773–1820."]}, {"page": "Charles Incledon", "response": ["Upon discharge in 1783 he was sent with a recommendation to George Colman at the Haymarket, but was turned away. For a while he struggled in companies at Southampton and Salisbury, before gaining a place for a few seasons under John Palmer at the Theatre Royal, Bath:William Parke, Musical Memoirs (Henry Colburn and Richard Bentley, London 1830), vol. 1, p. 127. he soon came to the attention of the Venanzio Rauzzini, who gave him instruction, and, much admiring his Handelian singing (notably in 'Total Eclipse' from Samson), publicly called him his scholar. He first sang at Vauxhall Gardens in London, his songs of James Hook being found appropriate and pleasing, in summer 1786:W. Parke, Musical Memoirs (1830), vol. 1, p. 71. In 1787 Charles Dibdin mentions him as an established singer there.C. Dibdin, The Musical Tour of Mr. Dibdin; in which, previous to his embarcation for India, he finished his career as a public character (J. Gales, Sheffield 1788), p. 23, Letter VI (5 October 1787): 'I gave the song to Mr. Incledon, who sings it charmingly at Vauxhall.' On 12 January 1791 he sang before Josef Haydn at a meeting of the Anacreontic Club.L.M. Middleton, 'Incledon, Charles', Dictionary of National Biography, Vol XXVIII (Macmillan & Co, London & New York 1891), pp. 427–8."]}, {"page": "James Hook", "response": ["James Hook may refer to:", "* James Hook (rugby union) (born 1985), Wales international rugby union player", "* James Hook (composer) (1746–1827), English composer and organist", "* James Hook (priest) (1771–1828), Dean of Worcester"]}, {"page": "Hook (surname)", "response": ["* James Hook (born 1985), Welsh rugby player", "* James Hook (1746–1827), English composer"]}, {"page": "1789 in Great Britain", "response": ["* The song The Lass of Richmond Hill, with music by James Hook to words by Leonard McNally, is first performed publicly by Charles Incledon at Vauxhall Gardens in London."]}, {"page": "1746 in Great Britain", "response": ["* 3 June – James Hook, composer (died 1827)"]}, {"page": "Marylebone High Street", "response": ["1738 saw the official opening of Marylebone Gardens on the east side of the street, a stylish concert venue which attracted eminent composers such as George Frideric Handel and James Hook; the entrance to the Gardens was through the \"Rose Tavern\", a public house on 35-36 Marylebone High Street, which until September 2009 was the home of BBC London which has since moved to BBC Broadcasting House."]}, {"page": "Marylebone Gardens", "response": ["Many of the foremost London musicians and composers including George Frideric Handel and James Hook performed works here, The original principal female singer was a Miss Faulkner and the orchestra was led by William Defesch. From 1763 to 1768 the Gardens were run by Thomas Lowe, who had been a singer at Vauxhall Gardens, with the musical management undertaken by Samuel Arnold who took over the ownership and management with the violinist Thomas Pinto which arrangement continued from 1769 to 1774.  "]}, {"page": "English art song", "response": ["* James Hook (1746–1827), composed keyboard works and songs, as well as one oratorio"]}, {"page": "Amy Evans", "response": ["Evans returned to the studio, and to cylinders, once more in 1910, when she recorded four solo numbers for Edison on four-minute cylinders: Thomas Moore's \"The Last Rose of Summer\", Guy d'Hardelot's \"The Dawn\", James Lyman Molloy's \"The Kerry Dance\", and Hermann Löhr's \"I Wish I Were a Tiny Bird.\"  No further recording sessions involving Evans are known in the acoustic era, although at some unknown time she recorded at least one cylinder for Edison in the earlier two-minute format: \"Within a Mile of Edinboro Town\" by James Hook.Title information from Edison cylinder 13979"]}, {"page": "William Kenrick (writer)", "response": ["1778 saw the production of two more Kenrick plays: The Lady of the Manor, a comic opera with music by James Hook, was the most successful of Kenrick's such works; and The Spendthrift; or, The Christmas Gambol, a farce based on Charles Johnson's The Country Lasses which was taken off after only two nights."]}, {"page": "Thomas Bridges (dramatist and parodist)", "response": ["Bridges' only novel was The Adventures of a Bank-Note, published in 1770.  He wrote two plays: Dido, a comic opera produced at the Haymarket Theatre in 1771, with music by James Hook; and The Dutchman (1775), a musical entertainment also with music by Hook."]}, {"page": "Gottlieb Graupner", "response": ["As a music publisher, Graupner promoted the popular Rudiments of the Art of Playing on the Piano-Forte (Boston, 1806; 2nd ed., 1819), one of the earliest such volumes published in the United States, and possibly the first.Rudiments of the Art of Playing on the Piano Forte: containing elements of music, preliminary remarks on fingering with examples, thirty fingered lessons, and a plain direction for tuning. Arranged by Gottlieb Graupner, described at Via Libri: Graupner, Gottlieb , accessed November 4, 2011 He also published sheet music by numerous composers including Henry Bishop, John Braham, John Clarke Whitfield, Muzio Clementi, John Davy, Johann Dussek, James Hook, Michael Kelly, George Kiallmark, Thomas Moore, Wolfgang Amadeus Mozart, Francis Panormo, William Parsons, Ludwig van Beethoven, David Dean Roche, John Ross, Oliver Shaw, and John Andrew Stevenson.Massachusetts Historical Society. Catalog. Retrieved 2011-11-07"]}, {"page": "Robert Anderson (poet)", "response": ["Having some artistic ability, he was apprenticed in 1783 to a pattern drawer and eventually went to London for five years for further training. While there he started writing - \"Lucy Gray of Allendale\" being the first of his compositions. This and others written that year were set to music by the composer James Hook and performed to some applause in 1794. In 1796 he returned to support his father in Carlisle and found work with a firm there. Two years later his English Poems on Various Subjects were published by subscription.Google Books Afterwards he turned to lighthearted humorous poems in dialect and the first edition of Ballads in the Cumbrian dialect was published in Carlisle in 1805.Google Books Since music was a favourite diversion of his, he composed the music to accompany many of these himself.", "Anderson had started writing at a time when the Scots dialect poetry of Robert Burns was spawning fashionable imitations. His initial impulse to write had sprung from disgust at songs \"written in a mock pastoral Scottish style\" that he had encountered while in London.Poetical Works, p.xxiv But this did not prevent him from writing in the same debased Lallans that he deprecated. Indeed, beside the lyrics of his in standard English set by James Hook, several others were in Anderson's derivative Scots, including \"Donald of Dundee\", \"Bonny Jem\", \"Muirland Willy\", \"Dearly I love Johnny O\" and \"The Press Gang\". He also used it later in a verse epistle addressed to Burns and in his narrative poems, \"The Harper\", \"The Dying Harper\" and \"Fair Margaret's Bower\". Shortly after his death, some of his lyrics were published alongside those of his model in  the chapbook Burns' songs and Anderson's Cumberland ballads (Newcastle upon Tyne, 1839).Burns Museum By comparison with his writing in Scots, Anderson's own dialect work was more uncompromising and brought better success.Romantic masculinities, Edinburgh U 1997 p.49"]}, {"page": "The Lass of Richmond Hill", "response": ["\"The Lass of Richmond Hill\", also known as \"The Sweet Lass of Richmond Hill\", is a song written by Leonard McNally with music composed by James Hook, and was first publicly performed in 1789. It was said to be a favourite of George III and, at one time, was thought to have been written by his son, George IV. It is a love ballad which popularized the poetic phrase \"a rose without a thorn\" as a romantic metaphor. Associated with the English town of Richmond in North Yorkshire, it is now often mistakenly considered to be a traditional or folk song, and has even been assigned the number 1246 on the Roud Folk Song Index. The music is also used as a military march by the British army.", "According to the musicologist and conductor Peter Holman, \"a way of celebrating national identity was to place a love-story in a picturesque British rural setting. The most famous song of this type is James Hook’s The Lass of Richmond Hill\" The song was seen as so quintessentially English that authorship by an Irishman, that is, by McNally, was, as mentioned earlier, periodically challenged.", "The music was composed by James Hook (1746 – 1827), a composer and organist at Vauxhall Gardens from 1774 to 1820. Hook composed over 2,000 songs, the best known of which is \"The Lass of Richmond Hill\"."]}, {"page": "James Hook (priest)", "response": ["James Hook,   (16 June 1771 – 5 February 1828) was an English Anglican priest. He was Dean of WorcesterCatalogue of the Lansdowne Manuscripts in the British Museum 1819 p252 from 1825Berrow's Worcester Journal (Worcester, England), Thursday, August 11, 1825; Issue 6397 until his death.", "The son of the composer James Hook,Bishops & Deans of Worcester Green,B: Worcester, Worcester Cathedral, 1979 he was born 16 June 1771.The annual biography and obituary for the year 1829, Vol.XIII, London, 1829, p.65. He was educated at Westminster School and St Mary Hall, Oxford."]}, {"page": "Charles Dignum", "response": ["His career progressed, principally at Drury Lane, in musical theatre (mainly ballad opera) and pantomime, in lesser roles in Shakespearean theatre. He remained a popular choice in ballad recitals, singing much at Ranelagh Gardens and in taverns: in the summer seasons he continued singing at Vauxhall Gardens until at least 1810. He was specially associated with the songs of James Hook, but also composed and arranged many songs both for his own use and for others to perform.See lists in Highfill, Burnim and Langhans, Vol. 4, p. 420. See also A collection of favourite songs : sung by Mr. Dignum, Mr. Taylor, Mrs. Franklin, Miss Milne, Master Welsh, & Mrs. Mountain, at Vauxhall Gardens (Authors: Hook, Mr.; Vint, Mr.; Addison, Mr.; William Upton; Charles Dignum) (A. Bland & Weller's music warehouse, London 1795).See also, C. Dignum, Vocal Music. Consisting of songs duetts and glees, the melodies composed and adapted by Charles Dignum of the Theatre Royal Drury Lane, Folio. Published by Printed and sold for the Author by Preston. 1803."]}, {"page": "Robert Houlton", "response": ["Houlton, according to Boaden, was an admirer of Isaac John Bickerstaff and the \"innocent opera\". With James Hook writing the music, he brought out at Drury Lane on 21 October 1800 a comic opera, called Wilmore Castle. It closed after five nights. Houlton took work with lottery promoters. At the end of his life, in 1815, he was applying to the Royal Literary Fund for support."]}, {"page": "Margaret Martyr", "response": ["She came to notice in 1778 when she was singing songs by James Hook in Vauxhall Gardens. She was Hook's pupil and she sang there each summer until 1780. She moved to singing Ballad opera and appeared in Love in a Village at the Covent Garden Theatre in 1779."]}]}}