{"wiki_id": "http://www.wikidata.org/entity/Q6145301", "itemLabel": "James Welldon", "itemDescription": "Anglican bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Welldon", "wikipedia_page": {"main": "James Edward Cowell Welldon (25 April 1854 – 17 June 1937) was an English clergyman and scholar. He was Bishop of Calcutta from 1898 to 1902, Dean of Manchester from 1906 to 1918, and Dean of Durham from 1918 to 1933.\n\n", "link_mentions": [{"page": "Ecclesiastical Household", "response": ["* James Welldon 1892 - 6 December 1898 (resigned, appointed Bishop)", "* James Welldon 1888-1892"]}, {"page": "Young Winston", "response": ["16 September 1897. Churchill is a junior officer in India determined to make a name for himself and to become a member of Parliament. As Sir Winston Churchill (voiced by Simon Ward) narrates, events shift back to his childhood. As a boy, Churchill is sent to a boarding school but is unhappy there. Due to excessive whippings, Churchill is removed from there and sent to another school, Harrow School. Churchill writes nothing down on the exam paper; however the headmaster, James Welldon sees the potential in Churchill and accepts him. One evening he recites a long poem of 1000 lines in Harrow. His nanny comes down to listen but his parents do not despite Churchill sending them a letter to."]}, {"page": "Diocese of Calcutta (Church of North India)", "response": ["| James Welldon"]}, {"page": "Hensley Henson", "response": ["Henson was translated to Durham – England's most senior diocese after Canterbury, York and LondonWhitaker, p. 235 – in October 1920.\"Bishop Henson Enthroned\", The Times, 1 November 1920, p. 15 The appointment was challenging: the area was in grave economic difficulty, with the important coal-mining industry in a crisis caused by falling industrial demand for coal in the years after the war. Ecclesiastically there was potential for friction, as the Dean of Durham, James Welldon, who had once been a bishop himself, was temperamentally and politically at odds with his new superior, given to making public statements that Henson found infuriating. Welldon, in Henson's view,  \"could neither speak with effect nor be silent with dignity\".Lyttelton–Hart-Davis, pp. 17–18 They clashed on several occasions, most conspicuously when Welldon, a strong admirer of prohibition, publicly criticised Henson's tolerant views on the consumption of alcohol.Peart-Binns, p. 124 Relations between the Deanery and Auckland Castle, the bishop's official residence, improved markedly in April 1933 when Cyril Alington, the Head Master of Eton from 1917 to 1933, succeeded Welldon.\"New Dean of Durham\", The Times, 3 May 1933, p. 14 Alington was almost universally loved, and though he and Henson differed on points of ecclesiastical practice, they remained warm friends.Chadwick, p. 297"]}, {"page": "1876 FA Cup Final", "response": ["|FB || ||James Welldon "]}, {"page": "JEC Welldon", "response": ["#REDIRECT James Welldon "]}, {"page": "Dean of Manchester", "response": ["*1906–1918 James Welldon"]}]}}