{"wiki_id": "http://www.wikidata.org/entity/Q6143113", "itemLabel": "James Sherwood", "itemDescription": "British comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Sherwood_(comedian)", "wikipedia_page": {"main": "James Sherwood (born 26 February 1975) is a stand-up comedian, comedy writer, singer, pianist, and composer. He lives in Peckham, south London.\nBorn in Rochford, Essex, in 1975, Sherwood grew up in Oxford, Bristol, Essex, and London. He was a chorister in the choir of Magdalen College, Oxford, and attended Magdalen College School. As an undergraduate English student at Magdalen he became an academical clerk in the same choir.\nHe had a brief career in public relations and new media working on campaigns for brand including BlackBerry before starting his comedy and music career.Sherwood was a semi-finalist in ITV's stand-up talent show Take the Mike in 2002. In 2004 he was runner-up in the BBC New Comedy Awards in 2004, and in the FHM Holsten Pils stand-up competition. In 2008 he was awarded the BBC Radio Comedy Writers Bursary.Sherwood has performed several shows at the Edinburgh Festival Fringe, and in August 2010 he performed his latest show, One Man and his Piano. He also runs a popular residency, Piano Bar, in central London.", "link_mentions": [{"page": "The News Quiz", "response": ["* James Sherwood"]}, {"page": "Josie Long", "response": ["Along with fellow comics Hils Barker, Steve Hall and James Sherwood, she founded the All-Singing, All-Dancing Competitive News Bonanza, a live topical panel show that ran at the Red Lion pub in Soho in 2004/05, and at the Arts Theatre Club in Soho in 2006. In 2006 she also launched her own monthly comedy clubs, the Sunday Night Adventure Club, at the ABC Café in Crystal Palace, London (later at the Black Sheep pub), and The OK Club at the Boogaloo pub in Highgate, North London. She currently runs and hosts \"The Lost Treasures of the Black Heart\" comedy club in Camden Town, which is recorded and made available as a podcast."]}, {"page": "28 Acts in 28 Minutes", "response": ["* James Sherwood"]}, {"page": "Andrew O'Neill", "response": ["* Andrew O'Neill and James Sherwood, Apparently (2004)"]}, {"page": "James Sherwood", "response": ["Although valued with a net worth of £60million in the 2004 Sunday Times Rich List,Sunday Times Rich List 2004 - James Sherwood Times Online as Sea Containers hit financial troubles, he resigned as Co-Chief Executive Officer from each of his companies in 2006.Sherwood to hand over helm at Sea Containers Daily Telegraph 8 December 2002 He continued as a Director of Orient Express Hotels Ltd until retiring on 9 June 2011. He was later designated as Founder and Chairman Emeritus.", "*Portrait Sculpture of James Sherwood by John W Mills"]}, {"page": "BBC New Comedy Award", "response": ["| 2004 || Andrew Lawrence || Liam MulloneDavid NichollsJarlath ReganJames Sherwood (runner-up)Danielle Ward (runner-up)"]}, {"page": "4 Stands Up", "response": ["|2||9 Apr 2009||Sarah Millican, James Sherwood and Jeff Green "]}, {"page": "I Guess That's Why They Call It The News", "response": ["I Guess That's Why They Call It The News is a BBC Radio 4 satirical panel game hosted by Fred MacAulay and created by James Sherwood. The only series began broadcasting on 21 August 2009 and continued for five episodes."]}, {"page": "BBC Radio Comedy Writers Bursary", "response": ["* 2008: James Sherwood, Stephen Carlin"]}, {"page": "Guerilla Cricket", "response": ["As well as providing cricket commentary, Guerilla Cricket also provided on-air coverage of the UK General Elections in 2015 and 2017, providing their usual irreverent views as events unfolded. Key events were marked with musical jingles provided by James Sherwood who has provided a number of songs which are used within the cricket commentary, including the Guerilla Cricket theme tune."]}]}}