{"wiki_id": "http://www.wikidata.org/entity/Q6141301", "itemLabel": "James Piotr Montague", "itemDescription": "British journalist and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Piotr_Montague", "wikipedia_page": {"main": "James Piotr Montague (born 28 July 1979) is a British writer.\nAfter studying Politics at Exeter University, Montague discovered a love for writing.  His first book, When Friday Comes: Football in the War Zone (Mainstream), follows his travels across the Middle East, visiting some of the most difficult countries in that area and looking at the relationship between football and politics. The book won him the Best New Writer Award at the 2009 British Sports Book Awards, run by the National Sporting Club. A heavily revised second edition, When Friday Comes: Football, War & Revolution in the Middle East was published in May 2013.\nHis second book, Thirty One Nil: On The Road With Football's Outsiders, a World Cup Odyssey, was published by Bloomsbury in May 2014. The book was named Football Book of the Year at the 2015 British Sports Book of the Year Awards.Montague's third book, The Billionaires Club: The Unstoppable Rise of Football's Super-Rich Owners (Bloomsbury), was published in August 2017. And his fourth, 1312: Among the Ultras, A Journey With the World’s Most Extreme Fans, was published in March 2020.", "link_mentions": [{"page": "DPR Korea Football Association", "response": ["PRKFA is \"notoriously hard to contact\". The association used to have a single fax number, and nowadays hosts a single email address. FIFA executive Jérôme Champagne remembers: \"You sent a fax. Sometimes you got a reply\", while football journalist James Piotr Montague's emails for \"the best part of a decade\" were always left unanswered. Even FIFA does not know for certain what the league system overseen by the PRKFA is like and what teams play in it."]}, {"page": "James Montague", "response": ["* James Piotr Montague (born 1979), British writer and journalist"]}, {"page": "Montague (surname)", "response": ["*James Piotr Montague (born 1979), British writer and journalist"]}]}}