{"wiki_id": "http://www.wikidata.org/entity/Q6145526", "itemLabel": "James Wilkinson Breeks", "itemDescription": "British colonial administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Wilkinson_Breeks", "wikipedia_page": {"main": "James Wilkinson Breeks (March 5, 1830 – June 7, 1872), was an Indian civil servant and author.\nBreeks was the author of 'An Account of the Primitive Tribes and Monuments in the Nilagiris,' was born at Warcop, Westmorland, on 5 March 1830, and entered the Madras civil service in 1849. After filling various subordinate offices in the revenue and financial departments, he was appointed private secretary to Sir William Denison, governor of Madras, in 1861, holding that appointment until the latter part of 1864, when, owing to ill-health, he left India and joined a mercantile firm in London, with the intention of retiring from the public service; but this arrangement not proving satisfactory, he returned to Madras in the autumn of 1867, and was shortly afterwards appointed to the newly constituted office of commissioner of the Niligiris, the principal sanatorium of the south of India.\nWhile thus employed, Breeks, in common with other heads of districts in the Madras presidency, was, in 1871, called upon by the government, at the instance of the trustees of the Indian Museum at Calcutta, to make a collection of arms, ornaments, dresses, household utensils, tools, agricultural implements, &c., which would serve to illustrate the habits and modes of life of the aboriginal tribes in the district, as well as a collection of objects found in ancient cairns and monuments. The discharge of this duty, which he performed in a very thorough and satisfactory manner, cost him his life; for having occasion, towards the close of his investigation, to visit a feverish locality in a low part of the mountain range, he there laid the seeds of an illness which a few months later caused his death. In the meantime he had made a complete collection of the utensils, arms, &c., in use among the four aboriginal tribes of the Niligiris, the Todas, Kotas, Kurumbas, and Irulas, and of the contents of many cairns and cromlechs, and had written the greater part of the rough draft of a report, which, completed and edited by his widow, who had been closely associated with him in his inquiries, was published in London by order of the secretary of state. A significant part of Breeks' collection of prehistoric artefacts from the Nilgiri mountains is now in the British Museum.\n\nThis report contains a very full account of each of the four tribes above mentioned, illustrated by drawings and photographs, and supplemented by a brief notice of some similar remains in other parts of India. Photographs of the men and women of the several tribes, of their villages, houses, temples, &c., are also given; as well as a vocabulary of the tribes, and descriptive catalogues of the ornaments, implements, &c., now in use. The book is a valuable record of intelligent and accurate research.\nThe Breeks Memorial School at Ootacamund, for the children of poor Europeans and Eurasians, was erected by public subscription shortly after his death as a memorial of his services to the Nilagiri community.Breeks married in 1863 Susan Maria, the eldest surviving daughter of Colonel Sir William Thomas Denison, R.E., K.C.B., at that time governor of Madras. He left three sons and one daughter. He fell ill and died June 7, 1872.", "link_mentions": [{"page": "British Museum", "response": ["The scope of the Department of Asia is extremely broad; its collections of over 75,000 objects cover the material culture of the whole Asian continent (from East, South, Central and South-East Asia) and from the Neolithic up to the present day. Until recently, this department concentrated on collecting Oriental antiquities from urban or semi-urban societies across the Asian continent. Many of those objects were collected by colonial officers and explorers in former parts of the British Empire, especially the Indian subcontinent. Examples include the collections made by individuals such as James Wilkinson Breeks, Sir Alexander Cunningham, Sir Harold Deane,  Sir Walter Elliot, James Prinsep, Charles Masson, Sir John Marshall and Charles Stuart. A large number of Chinese antiquities were purchased from the Anglo-Greek banker George Eumorfopoulos in the 1930s. The large collection of some 1800 Japanese prints and paintings owned by Arthur Morrison was acquired in the early twentieth century. In the second half of the twentieth century, the museum greatly benefited from the bequest of the philanthropist PT Brooke Sewell, which allowed the department to purchase many objects and fill in gaps in the collection."]}, {"page": "James Wilkinson (disambiguation)", "response": ["* James Wilkinson Breeks (1830–1872), Indian civil servant and author"]}, {"page": "Breeks Memorial School", "response": ["Breeks Memorial Anglo-Indian Higher Secondary School is a Christian co-educational school established in 1874. It was named after James Wilkinson Breeks, the first Commissioner (District Collector) of the Nilgiris. It was erected for the children of Europeans and Eurasians by public subscription shortly after his death, as a memorial to his services to the Nilgiris community.The first non Christian principal and correspondent was Mr N Raman. He headed the school for a very long time. The school is just 1.5 km from the Government Botanical Gardens, Ooty."]}, {"page": "Nilgiri Mountains", "response": ["The high steppes of the Nilgiri Hills have been inhabited since prehistoric times, demonstrated by a large number of artifacts unearthed by excavators. A particularly important collection from the region can be seen in the British Museum, including those assembled by colonial officers James Wilkinson Breeks, Major M. J. Walhouse and Sir Walter Elliot."]}, {"page": "James Breeks", "response": ["#REDIRECT James Wilkinson Breeks"]}]}}