{"wiki_id": "http://www.wikidata.org/entity/Q6142811", "itemLabel": "James Scaramanga", "itemDescription": "British flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Scaramanga", "wikipedia_page": {"main": "Lieutenant James John Scaramanga (25 July 1898 – 10 July 1918) was a First World War British ace credited with twelve aerial victories. He scored his last victory after he had already received the wound which would soon prove fatal. The observer ace hailed from a wealthy Greek family with a connection to James Bond series author Ian Fleming.", "link_mentions": [{"page": "Scaramanga", "response": ["* James Scaramanga (1898–1918), First World War Greek-British flying ace credited with twelve aerial victories"]}, {"page": "Dennis Latimer", "response": ["Latimer was commissioned from cadet to temporary second lieutenant (on probation) for duty in the Royal Flying Corps on 26 January 1917, and was appointed a flying officer on 27 April. In early 1918 he was posted to No. 20 Squadron RFC to fly a Bristol F.2b two-seater fighter. Latimer scored his first victory on 13 March with Lieutenant James Scaramanga as his observer/gunner, the only one he scored in the Royal Flying Corps. On 1 April 1918, the Army's Royal Flying Corps was merged with the Royal Naval Air Service to form the Royal Air Force. Latimer was then paired with Lieutenant Tom Noel, gaining his second victory on 21 April. Latimer and Noel gained another 13 victories between 8 and 20 May, and on 25 May Latimer was appointed a flight commander with the temporary rank of captain. Latimer and Noel gained nine more victories in June and July, and in August Latimer and Sergeant Arthur Newland gained five more. However, on 22 August, Latimer was again flying with Noel, when they were shot down by Leutnant Willi Nebgen of Jasta 7. Noel was killed and Latimer captured. Latimer's final total claimed in conjunction with his gunners was one aircraft captured, seventeen destroyed (including one shared), and ten 'out of control' wins (two shared), making him the highest-scoring ace of No. 20 Squadron.", "|1 || 13 March 1918@ 1255 || Bristol F.2b(C4615) || Albatros D.V || Out of control || Comines—Wervicq || Observer: 2nd Lt. James Scaramanga."]}, {"page": "List of World War I aces credited with 11–14 victories", "response": ["| James Scaramanga"]}, {"page": "Douglas Graham Cooke", "response": ["Assigned to No. 20 Squadron, Cooke's string of victories began on 22 January 1918 and extended until 19 May. His observers manning the guns in the rear seat of his Bristol F.2 Fighter included fellow aces Henry Crowe, James Scaramanga and Ernest Hardcastle. His final tally was five enemy fighter planes destroyed and eight driven down out of control, with nine enemy planes falling to his pilot's gun. Cooke's successes earned him the post of flight commander with its concomitant promotion to temporary captain on 11 April, as well as the award of the Military Cross in July. He was transferred to the unemployed list on 26 July 1919."]}, {"page": "List of World War I flying aces from the British Empire", "response": ["* James Scaramanga"]}, {"page": "Scaramanga, James", "response": ["#redirectJames Scaramanga"]}]}}