{"wiki_id": "http://www.wikidata.org/entity/Q6144361", "itemLabel": "James Towers", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Towers", "wikipedia_page": {"main": "James Towers, VC (9 September 1897 – 24 January 1977) was an English soldier, farmer, and a recipient of the Victoria Cross (VC), the highest award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces. A soldier with The Cameronians during the First World War, he was awarded the VC for his actions on 6 October 1918, during the Hundred Days Offensive.", "link_mentions": [{"page": "List of English Victoria Cross recipients", "response": ["|James Towers || British Army || 1918 || First World War || Mericourt"]}, {"page": "20th (Light) Division", "response": ["On 27 August the whole division moved to the right, entirely south of the river Souchez on a three brigade front, patrolling and trench raiding were continued. At the end of September the First Army was ordered to advance along with the rest of the front. The initial moves of this by the 20th Division were an attack on the lines south of Lens at Acheville carried out by the 7th D.C.L.I, which on the night of 27–28 September captured  of the German front line trench and held it against a counter-attack the next day. On 2 October, seeing that the Germans were withdrawing to the Hindenburg Line, the division advanced on a front of six battalions from all three brigades (from the left: 7th D.C.L.I, 12th King's, 12th K.R.R.C., 6th K.S.L.I., 2nd Scottish Rifles and 11th K.R.R.C., with the remainder in reserve). With the close support of the artillery, advances of up to  were made across the 'Bull Ring' and the village of Méricourt was entered, there Pte. James Towers of the 2nd Scottish Rifles won the V.C. after volunteering to take a message to a trapped patrol after five other messengers had been killed, he subsequently led the patrol to safety after dark. The Germans left many machine gun nests to slow the pursuit, which were slowly overrun. The division was relieved between 5 and 8 October by the 12th (Eastern) Division,inglefield pp. 285–299 except for the artillery which was sent to the Chérisy – Foutaine area  south east of Arras.Inglefield p. 300", "* Private James Towers 2nd Cameronians (Scottish Rifles"]}, {"page": "Broughton, Lancashire", "response": ["*James Towers, recipient of the Victoria Cross"]}, {"page": "Towers, James", "response": ["#redirectJames Towers"]}]}}