{"wiki_id": "http://www.wikidata.org/entity/Q6141275", "itemLabel": "James Piers St Aubyn", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Piers_St_Aubyn", "wikipedia_page": {"main": "James Piers St Aubyn (6 April 1815 – 8 May 1895), often referred to as J P St Aubyn, was an English architect of the Victorian era, known for his church architecture and confident restorations.", "link_mentions": [{"page": "Tintagel", "response": ["The Church of St Materiana (Tintagel Parish Church) has been Anglican since the English Reformation. It was originally built in Norman times. Writing in 1951, Nikolaus Pevsner was uncertain about the dating and suggests that the Norman work has some Saxon features while the tower may be 13th or 15th century in date. It stands on the cliffs between Trevena and Tintagel Castle and is listed Grade I. The first church on the site was probably in the 6th century, founded as a daughter church of Minster: these are the only churches dedicated to St Materiana though she is usually identified with Madryn, Princess of Gwent. The existing church may be late 11th or early 12th century: the tower is some three centuries later and the most significant change since then was the restoration in 1870 by James Piers St Aubyn. An area of the churchyard was excavated in 1990–91 by the Cornwall Archaeological Unit.Nowakowski, Jacqueline A.; Thomas, Charles (1990) Excavations at Tintagel Parish Churchyard ... interim report. Truro: Cornwall Archaeological Unit.Nowakowski, Jacqueline A.; Thomas, Charles (1992) Grave News From Tintagel: an Account of a Second Season of Archaeological Excavations at Tintagel Churchyard ... Truro: Cornwall Archaeological Unit. There are modern stained glass windows, three modern copies of Old Master paintings, and a Roman milestone (described above under Antiquities). The parish war memorial stands at the western end of the churchyard and a modern churchyard cross (c. 1910) near the south entrance. "]}, {"page": "St. Peter's Church", "response": ["* St Peter's Church, Rose Ash, by architect James Piers St Aubyn", "* St Peter's Church, Belsize Park, by architect James Piers St Aubyn"]}, {"page": "Marazion", "response": ["The Old Manor House on Fore Street is a Grade II listed building. The Listing states that it was built circa 1775 for William Cornish a former mayor; extensions were added in the mid 19th century at the rear and the east side of the building. During an unstated number of years in the 1800s, this was the home of noted architect James Piers St Aubyn. THE OLD MANOR HOUSE OR CHY-AN-EGLOS AND STABLES AT REAR The property was listed for sale in 2019. The listing report stated that the house included \"original slate floors, open fireplaces, sash windows, exposed beams, intricate cornices and wood panelling\" and featured views of St Michael's Mount. This romantic residence in Marazion overlooks Saint Michael’s Mount"]}, {"page": "Camborne", "response": ["Camborne's parish church is dedicated to St Martin and St Meriadoc: it is entirely of granite, of 15th century date, but incorporating earlier structural features, including a Norman chevron stone in the west wall of the north aisle found in 2009 and is listed Grade I. St Martin was added to the original dedication to St Meriadoc in the 15th century. There is a western tower about 60 feet high containing eight bells (with a clock before 1882) and the aisles are identical in design: the building was gutted and restored in 1861-62 and an outer south aisle was added in 1878–79 to a design by James Piers St Aubyn.Pevsner, N. (1970) Cornwall, 2nd ed., revised by Enid Radcliffe. Penguin Books; pp. 49–50 The church was re-opened on 7 August 1879 by Edward Benson, the Bishop of Truro."]}, {"page": "Watchet", "response": ["The Anglican St Decuman's church is probably on an ancient pre-Christian site, on a hill top between Watchet and Williton. An earlier church was situated by the sea at Daw's Castle (probably the original site of Watchet) but was abandoned because of sea erosion. When the church was rebuilt in the 12th century it appears that the bones of St Decuman were moved. The chancel of the present church is unusually wide and may have housed the tomb of St Decuman. The \"Translation of Saint Decuman\" used to be celebrated. The 15th century, Grade I listed, Church of St Decuman is dedicated to him. The Norman church was rebuilt in the 15th and 16th centuries when the central tower was demolished and the present one built at the west end. It was restored and reseated by James Piers St Aubyn between 1886 and 1891, with further internal alterations being made in 1896 when the Caen stone reredos was erected."]}, {"page": "Little Horwood", "response": ["The Church of England parish church of Saint Nicholas has a Perpendicular Gothic belltower built of large blocks of ashlar, the remainder of the church externally dates from the restoration of 1889 by the architect James Piers St Aubyn. This architect's work is not always viewed kindly today. His Victorian Gothicisation of many churches and houses has been described in terms ranging from vandalism to ruthless. Little Horwood church was lucky, as the interior survived relatively unscathed and the early 16th-century wall paintings depicting the seven deadly sins also survived, as did the Jacobean pulpit and the Decorated Gothic chancel arch. The Tower has a ring of five bells, with a tenor of 9cwt 2qtrs 22lbs, tuned to the note of G."]}, {"page": "Temple Church", "response": ["The church escaped damage in the Great Fire of London of 1666. Nevertheless, it was refurbished by Christopher Wren, who made extensive modifications to the interior, including the addition of an altar screen and the installation of the church's first organ. The church underwent a Victorian restoration in 1841 by Smirke and Burton, who decorated the walls and ceiling in high Victorian Gothic style in an attempt to return the church back to its supposed original appearance. Further restoration work was executed in 1862 by James Piers St Aubyn."]}, {"page": "Silverstone", "response": ["Silverstone had a chapel by AD 1200. In about 1780 the medieval building was replaced by a Georgian one, which was enlarged by the addition of a chancel in 1841 and a north aisle and vestry in 1852. The entire church was demolished in the 1880s and replaced by the present Church of England parish church of Saint Michael, which is a Gothic Revival building designed by James Piers St Aubyn and completed in 1884.Pevsner & Cherry, 1973, page 404"]}, {"page": "Rousham House", "response": ["Burke's Genealogical and Heraldic History of the Landed Gentry, 15th Edition, ed. Pirie-Gordon, H., London, 1937, p.627Dictionary of National Biography, Cotterell, Sir Charles (1612?–1702), master of the ceremonies and translator, by Sidney Lee. Published 1887. At this time Kent also embellished the house itself, with crenellations and two wings containing a drawing room and a \"delightful\" library, according to Horace Walpole who said of Rousham in 1760 \"it reinstated Kent with me; he has no where shewn so much taste\".Walpole to George Montagu, 19 July 1760 The interiors were altered a century later but the hall, the principal room of the house, has survived alteration by successive generations unchanged, and remains as completed in the 17th century.  Kent's exterior work is today almost as built, but in 1876 the original octagonal paned glazing was replaced with innovative large sheets of plate glass, during a heavy-handed restoration of the house by the architect James Piers St Aubyn.  The house contains fine collections of Jacobean and 18th-century furniture, paintings and statuary, all displayed in a domestic setting."]}, {"page": "Dilton Marsh", "response": ["Chalcot House, a Grade II* listed country house, stands in Chalcot Park in the south of the parish. The house was built in the early 18th century on the site of an older one, extensively altered in 1872 by James Piers St Aubyn, and restored in the 1970s."]}, {"page": "Belsize Park", "response": ["The passing of the Ecclesiastical Leases Act 1842 allowed all church lands to be let on long term construction leases, which unlocked the accelerated urban development of Belsize Park. The opening in 1851 of Hampstead Road railway station on the L&BR prompted William Lund in 1852 to agree a 99-year construction sublease on the former Forsyth estate. He proposed developments to the west of Haverstock Hill, although his plans were curtailed by construction issues associated with building over both the Pond Street sewer and the L&BR tunnel. In 1852 Charles James Palmer, a Bloomsbury-based solicitor bought the lease of Belsize House. In 1853 he proposed demolition of the main house, with Daniel Tiley taking the lead role in constructing Belsize Square and associated properties. Palmer commissioned architect James Piers St Aubyn to design St Peter's Church. In 1864 the church bought-back the lease on the undeveloped backlot of the Bliss lands. Tiley gained agreement from Palmer and Eton College to buy the construction lease from the church, and hence extend development south of Belsize Square to connect with the college's estate. Mimicking the then fashionable styles of Kensington and Bayswater, between 1851 and the late 1860s he built over 250 8-10 bedroom semi-detached stucco houses with large porticos, aimed at the middle classes. The church undertook a similar agreement in 1857, reacquiring full control over the portion of Todd's lease north of Belsize Lane in 1865, and again selling it to Tiley. With construction almost complete, fashion changed and Tiley went bankrupt in 1870."]}, {"page": "Mawlamyine", "response": ["* St Matthew's Church: It was the first English Church (Anglican Church) built in Myanmar. It was initially erected in 1832 and the current handsome structure was rebuilt in 1887. It was designed and restored by the English architects James Piers St Aubyn and Henry J. Wadling of London and the foundation stone was laid by Sir Charles Crosthwaite, then Chief Commissioner of Burma. It is of red brick, the capitals of interior pillars being stone, and is said to be a model of English Church at Dresden. George Orwell attended the church during his days as Imperial Policeman in Moulmein in 1926 and the church compound has grave stones of his relatives. During the Japanese conquest of Burma in WWII, the Japanese Army stored salt in the church. Though the church is still in use, it is in a state of decay and is in urgent need of conservation."]}, {"page": "Uley", "response": ["St Giles's Church near the village green was designed by the 19th-century architect Samuel Sanders Teulon. His building replaced an earlier church dating back to Norman times, which had in its turn replaced a Saxon church. The nearby church of the Holy Cross at Owlpen also has Saxon origins: the church there was rebuilt in 1828 by Samuel Manning and enlarged and decorated in 1876 by James Piers St Aubyn. There were also non-conformist chapels at South St and Whitecourt until the early 1970s."]}, {"page": "Calstock", "response": ["This resulted in the thorough restoration of 1867, carried out at a cost of £600, and under the direction of Mr James Piers St Aubyn (1815–95). St. Aubyn, a relative of the well-known family residents of St Michael’s Mount, had an architectural practise in London and Devonport, and was responsible for the restoration (some would say butchering) of many West Country churches. Here at Calstock the floor levels were altered, the existing tiles laid, the chancel given its present roof, and the buildings furnished with its plain pitched-pine benches. However, severe though the restorations was, many of interesting features of the church were preserved."]}, {"page": "J P St. Aubyn", "response": ["#REDIRECT James Piers St Aubyn"]}, {"page": "J P St Aubyn", "response": ["#REDIRECT James Piers St Aubyn"]}, {"page": "William White (architect)", "response": ["* James Piers St Aubyn"]}, {"page": "South Cerney", "response": ["*James Piers St Aubyn, architect"]}, {"page": "Powick", "response": ["* James Piers St Aubyn, architect, was born at Powick Vicarage in 1815"]}, {"page": "Perranarworthal", "response": ["The 15th-century Anglican parish church dedicated to Saint Piran was rebuilt to the design of James Piers St Aubyn between May 1881 and 1882, at a cost of £1,200. At the time of the consecration ceremony which took place on 16 May 1882, a further £150 was required to install the pews. While the church was closed services were held in the old Wesleyan chapel. The original granite tower remains from the 15th-century church. Pevsner described the church as \"indifferent\".Pevsner, N. (1970) Cornwall; 2nd ed. Penguin Books; p. 139"]}, {"page": "Owlpen", "response": ["The Church of the Holy Cross stands above the manor house. Of medieval origins (first recorded in 1262), the nave was rebuilt by the architect Samuel Manning (Senior) in 1828 and the chancel added with restoration by James Piers St Aubyn in 1876. The result includes a number of interior mosaics, with opus sectile tiles designed by Charles Hardgrave and made by James Powell and Sons of the Whitefriars Glassworks; encaustic floor tiles by William Godwin & Son of Lugwardine; and stained glass windows, by Powells and Heaton, Butler and Bayne. A baptistery with further mosaics and Cosmatesque pavement was added in 1912–1913, when the old Norman font was installed. It has been described as ‘the most elaborate Victorian-Edwardian interior in the Cotswolds’ (David Verey, Cotswold Churches). The church has been used as a filming location, including in 2008 for the BBC's four-part drama series, Tess of the d'Urbervilles."]}, {"page": "New Mill, Cornwall", "response": ["The area includes the hamlets of Boskednan and Bodrifty, which has a former Iron Age settlement. Nearby is Trythall School and the former mission church of All Saints which was designed by James Piers St Aubyn and opened in 1885, to service the mining community. It closed in 1957, the altar was moved to Gulval Church and placed in the Harris Chapel which was renamed the Trythall Chapel. New Mill lies within the Cornwall Area of Outstanding Natural Beauty (AONB)."]}, {"page": "Noss Mayo", "response": ["The village's church, dedicated to St. Peter, was built in 1880–1882 at the expense of Edward Baring, 1st Baron Revelstoke (head of the family firm of Barings Bank) to a design by James Piers St Aubyn. It took over from the Church of St Peter the Poor Fisherman, Revelstoke which was built in 1226, on the coast just over  to the south."]}, {"page": "Ashton, Cornwall", "response": ["A Mission Church designed by James Piers St Aubyn was dedicated by George Wilkinson (Bishop of Truro) on 11 March 1884. Costing between £600 and £700, it is built in the Gothic early-English style on a site donated by the Duke of Leeds. Ashton has a pub called the Lion and Lamb and in the past had a football team."]}, {"page": "The Abbey, Ditcheat", "response": ["The Abbey was built as the rectory by John Gunthorpe who was rector of Ditcheat and Dean of Wells, in 1473. The house was altered in 1667 for Christopher Coward; and given a new facade and rearranged internally in 1864–68, probably by James Piers St Aubyn for Rev. William Leir."]}, {"page": "Ditcheat", "response": ["The Abbey is a large house (formerly known as The Priory), built as the rectory by John Gunthorpe who was rector of Ditcheat, Dean of Wells and Lord Privy Seal, in 1473. The house was altered in 1667 for Christopher Coward; and given a new facade and rearranged internally in 1864–68, probably by James Piers St Aubyn for Rev. William Leir.  The exterior is now mostly his Victorian neo-Tudor; inside there are reused fragments and some original 15th- and 17th-century work – coffered ceilings and the arch-braced roof of the ‘chapel wing’, but most of the elaborate Gothic work dates from the 1860s."]}, {"page": "List of Anglo-Catholic churches", "response": ["| Grade 2 listed building designed by James Piers St Aubyn."]}, {"page": "Thringstone", "response": ["Saint Andrew's Church is a small cruciform structure built in 1862 entirely from Charnwood Forest stone in the Early English style. The building was designed by James Piers St Aubyn (1815–1895) and has an unusual plan, consisting of a broad nave with shallow transepts and a round-ended sanctuary, with a round-ended vestry on its north side. A small bell-cote containing one small bell sits at the western end of the nave roof and a south porch was added in 1911, in memory of the first vicar, Edwin Samuel Crane, MA, designed by Thomas Ignatius McCarthy of Coalville."]}, {"page": "St Giles' Church, Reading", "response": ["In 1872, the original small mediaeval church was rebuilt by James Piers St Aubyn in Early English style retaining only the 13th century aisle walls and Perpendicular style west tower. A new ashlar steeple was added in 1873. The exterior of the church is faced in flint and the roof is tiled. The church is a Grade II listed building."]}, {"page": "St Michael and All Angels Church", "response": ["* St Michael and All Angels Church, Galleywood Common, Essex, a church designed by James Piers St Aubyn"]}, {"page": "All Saints' Church, Reading", "response": ["The church was built between 1865 and 1874, as a daughter church of the Minster Church of St Mary, to serve the growing population of the Bath Road area. It was designed by the architect James Piers St Aubyn. The construction is of coursed rubble with ashlar dressings and weathered buttresses. The roof is tiled, and the church has a five bay aisled nave with a short transept. The interior includes a painted arcade, a rich five-window apse, and mural mosaics, the finest of which is a glass mosaic reredos depicting the last supper. This came from the London workshop of the renowned glass artist Antonio Salviati and was installed in 1866. The foundations for a tower to the south side of the church were constructed, but the tower itself was never completed."]}, {"page": "Godolphin Cross", "response": ["The Church of St John the Baptist is now redundant. It was designed by James Piers St Aubyn and built in 1849–50.Pevsner, N. Cornwall, (Buildings of England series) (1951; 1970) (rev. Enid Radcliffe) Penguin Books ; p. 73 In 2006, an application was received by Kerrier District Council to convert the church into a private dwelling."]}, {"page": "List of British architects", "response": ["*James Piers St Aubyn (1815–1895)"]}, {"page": "Sticker, Cornwall", "response": ["An Anglican church was designed by architect George Edmund Street in 1848/49,A. E. Street, A Memoir of George Edmund Street, p. 11 (1972) but was never built. The current St Mark's Mission Church was designed by James Piers St Aubyn and opened in 1877. St Mark's is a chapel of ease for the parish church at St Mewan."]}, {"page": "List of Gothic Revival architects", "response": ["*James Piers St Aubyn"]}]}}