{"wiki_id": "http://www.wikidata.org/entity/Q6145523", "itemLabel": "James Wilkes Maurice", "itemDescription": "British officer of the Royal Navy", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Wilkes_Maurice", "wikipedia_page": {"main": "Vice-Admiral James Wilkes Maurice (10 February 1775 – 4 September 1857) was an officer of the Royal Navy during the French Revolutionary and Napoleonic Wars. Unlike his contemporaries who won fame commanding ships, Maurice gained accolades for his command of a number of island fortresses.\nMaurice was employed on a number of ships prior to the outbreak of the French Revolutionary Wars, and by 1794 held the position of midshipman. He saw action in the English Channel and in the Western Approaches the following year, participating in the Battle of Groix and the Quiberon expedition. Good service in these actions led to his appointment to a number of acting commissions as a lieutenant. His career took a major step forward when Maurice, his lieutenant's commission by now confirmed, went out to the West Indies with Commodore Sir Samuel Hood.\nHood had decided to fortify Diamond Rock, in order to harass French shipping off the port of Fort de France in Martinique and Maurice, as first lieutenant of Hood's flagship, began to oversee the arduous task. After work was completed Hood commissioned the Rock and rewarded Maurice's efforts by putting him in command. For seventeen months Maurice and his men raided and interdicted shipping off Martinique, and proved a continual thorn in the side of the French. The arrival of a large fleet under Pierre de Villeneuve in May 1804 during the Trafalgar Campaign gave the French enough resources to assault the Rock. In the subsequent battle, Maurice held out for several days until the exhaustion of the Rock's supplies of water and ammunition forced him to surrender.\nMaurice spent a brief period in command of a sloop, before being appointed governor of Marie-Galante, tasked with the defence of the island. His next posting was as governor of Anholt during the Gunboat War. In 1811 he fought off an attack from a much larger Danish force, inflicting heavy casualties. Maurice then returned to Britain and largely retired from active service, though he continued to be promoted. He reached the rank of vice-admiral before his death in 1857.\n\n", "link_mentions": {}}}