{"wiki_id": "http://www.wikidata.org/entity/Q6147089", "itemLabel": "Jamie Langley", "itemDescription": "English rugby league footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Jamie_Langley", "wikipedia_page": {"main": "Jamie John Langley (born 21 December 1983) is the assistant coach at the London Broncos in the Super League and an English former professional rugby league footballer.A Great Britain representative Loose forward, he has also played for England and with Bradford Bulls won the Super League championship and Challenge Cup with them, and he has also played for the Hull Kingston Rovers and the Sheffield Eagles. Jamie Langley is the son of the rugby league footballer who played in the 1960s and 1970s for Leeds; John Langley.\nHis position of choice was loose forward though he could also play in the second-row. He played for the  Super League side the Bradford Bulls in England. He was named the vice-captain for the 2010 season, which was also his testimonial season.", "link_mentions": [{"page": "November 21", "response": ["*1983 – Jamie Langley, English rugby player"]}, {"page": "Bradford Bulls", "response": ["|||19||Jamie Langley"]}, {"page": "Normanton, West Yorkshire", "response": ["*Jamie Langley- rugby league player for Hull Kingston Rovers"]}, {"page": "Wayne Godwin", "response": ["In 2013, Godwin launched a clothing brand with former team mates Jamie Langley and Duane Straugheir named 'We Are Taurus'."]}, {"page": "Sheffield Eagles", "response": ["* Jamie Langley"]}, {"page": "Paul Sykes (rugby league)", "response": ["On rejoining Bradford he said: \"A lot's changed at Bradford since the first time around and I think there's only Paul Deacon and Jamie Langley still there. \"But I'm ready for a fresh challenge and I'm hoping to move back north to win some silverware. Bradford are always challenging and I'm glad I'm going to be a part of that. \"Also, my girlfriend has just given birth to our first child as well and we want to be closer to our family.\" Boss Steve McNamara reckons he has picked up a rare talent, and added \"I'm absolutely delighted to have secured an outstanding English centre and thank the board for making the deal possible\"."]}, {"page": "Bradford Bulls Academy", "response": ["!width=15%|Jamie Langley"]}, {"page": "List of Bradford Bulls internationals", "response": ["|align=center|Jamie Langley", "* Jamie Langley won caps for England while at Bradford Bulls in 2004 against Russia, France, Ireland, and won caps for Great Britain while at Bradford Bulls in 2007 against Fiji (sub) "]}]}}