{"wiki_id": "http://www.wikidata.org/entity/Q6142179", "itemLabel": "James Roache", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Roache", "wikipedia_page": {"main": "William James Roache (born 29 December 1985) is an English actor who is perhaps best known for his roles in connection with his father William Roache. In Coronation Street he played James, the long-lost grandson of Ken Barlow (played by his father). He also played the role of his own father William as a young man in the ITV drama The Road to Coronation Street.", "link_mentions": [{"page": "Coronation Street", "response": ["The BBC commissioned a one-off drama called The Road to Coronation Street, about how the series first came into being. Jessie Wallace plays Pat Phoenix (Elsie Tanner) with Lynda Baron as Violet Carson (Ena Sharples), Celia Imrie as Doris Speed (Annie Walker) and James Roache as his own father William Roache (Ken Barlow). It was broadcast on 16 September 2010 on BBC Four."]}, {"page": "Ken Barlow", "response": ["Despite his somewhat antagonistic role in the show's early years, Ken developed a reputation among critics for representing an archetypal \"boring man\". This is an allegation denied by Roache, who has cited Ken's evolution over the years, his chaotic love life and dysfunctional family as evidence to the contrary. Roache has been honoured with a lifetime achievement award at the British Soap Awards for his portrayal of Ken. Away from the canonical serial, Ken has been portrayed by James Roache (William Roache's son) in the dramatisation The Road to Coronation Street, and by Simon Chadwick in the play Corrie!. He has also been spoofed by impressionist Jon Culshaw.", "In late August 2010, Norris Cole (Malcolm Hebden) discovers an unopened letter addressed to Ken, dating back to the 1960s. The letter is written by Ken's first girlfriend, Susan Cunningham (Patricia Shakesby), whom Ken had dated in 1960. Susan has a son named Lawrence (Linus Roache), who turns out to be Ken's child. Ken and Lawrence bond, which temporarily threatens Ken's relationship with his other son Peter. When Ken discovers that Lawrence is intolerant of the homosexuality of his own son, James (James Roache), Ken severs contact. Realising that he has been unappreciative and neglectful of Peter over the years, he makes an effort to bond, supporting him through his relationship and health problems that follow."]}, {"page": "Deirdre Barlow", "response": ["In July 2009, Deirdre has to reapply for her job as a council employee when redundancies are announced. In August, she loses her job and confides in Betty that she does not know what to do. When Peter decides to open a bar with girlfriend, Leanne Battersby (Jane Danson), Ken is so against the idea that he calls a meeting at The Rovers and has an article written in a newspaper which also details Deirdre's relationship with Jon Lindsay and Tracy murdering Charlie. Deirdre and Ken fall out but Eileen Grimshaw (Sue Cleaver) helps them reconcile. During a row in 2010, Gail McIntyre (Helen Worth) throws a pie in Deirdre's face. Ken, despite repeated requests by Deirdre to \"do something\", fails to come to her assistance. On 3 May 2010, Deirdre is dealt a blow when she discovers that Blanche has died in Portugal. She and Ken are even more surprised to learn that Blanche had been romantically involved with a man called Arnold. Deirdre flies to Portugal to meet him, learning more about her mother's final days. At Blanche's funeral, she is happy to see Tracy and gives an emotional eulogy paying tribute to her mother's unique character. In September, she is disgusted to discover that Lawrence Cunningham (Linus Roache) is Ken's son and that Lawrence has a gay son James Cunningham (James Roache). Deirdre is delighted when Tracy is released from prison on Christmas Day 2010. Despite knowing about Tracy's manipulative personality, Deirdre supports her but she finds Tracy in a pool of blood on New Year's Day, with Steve McDonald (Simon Gregson), Amy's father, standing over her. When Tracy awakes from her coma, she claims that Steve's wife Becky (Katherine Kelly) is responsible for her injuries. When Ken doubts Tracy's word, Deirdre stands by her; Becky is arrested and questioned by the police. Tracy's lies are exposed again when Claire Peacock (Julia Haworth) admits she attacked Tracy because Tracy had insulted her recently deceased husband, Ashley (Steven Arnold)."]}, {"page": "Betty Driver", "response": ["Driver lived with and cared for her sister Freda until Freda's death in December 2008. She was godmother to James Roache, the youngest son of Bill Roache, who plays Ken Barlow in Coronation Street. Roache's son James had a role as Ken's long-lost grandson who was also called James."]}, {"page": "Kevin Webster", "response": ["In May 2011, Kevin and Tyrone's feuding at the garage turns violent after Tyrone, in a fit of rage, damages a new hydraulic lift that Kevin has bought. Kevin is crushed under a car he is working on when it gives way and is saved by Tyrone and Tommy Duckworth (Chris Fountain). When Tyrone admits he damaged the lift, Kevin forgives him and they call a truce so they can work together. Sally returns from Paris that day and asks Kevin and Jack to stay with her until his injuries heal and he agrees. One day in June, he isn't happy to see Sophie and Sian giving money to Ken Barlow's (William Roache) grandson, James Cunningham (James Roache), when the soup kitchen is reportedly burgled. He bans them from the kitchen and is surprised when Sally backs him up but Sophie ignores them and starts working there as a manager. Kevin softens and supports the charity auction held at the bistro. The following day, Kevin gets the all-clear about his collarbone and is shocked when Sophie asks him to loan her £20,000 so the charity can buy the house they've been renting. After Kevin refuses, Sophie hacks into his bank account and transfers £20,000 to the charity. Meanwhile, Sally and Kevin's relationship is improving as Sally doesn't ask Kevin to return to his flat and they have stopped arguing. However, the next day, Sophie and Sian are horrified to learn that the charity never bid for the house and that the soup kitchen is being demolished, with builders insisting it hasn't been occupied for months. Failing to find the charity leaders, Rob and Janet, Sophie and Sian realise that they've lost £20,000. Forced to confess, she tells Kevin, who angrily confronts James, who insists he knows nothing about the scam and is supported by the Barlow family, except Tracy Barlow (Kate Ford), who has suspicions. Kevin calls the police but tells them that he transferred the cash, ending the tension in the Webster home. A few days later, Kevin learns that the two con artists behind the charity scam have been arrested and tells Sally. James panics, realising that the truth will come out; he attacks Ken and flees Weatherfield. Ken tells the Websters what has happened and Kevin tells the police. In September, Kevin learns that Tyrone has a new girlfriend, Kirsty Soames (Natalie Gumede), a police officer he met in a bar. Tommy admits to Kevin he paid Kirsty to flirt with Tyrone and Kevin insists Tommy tell Tyrone the truth."]}, {"page": "Amy Barlow", "response": ["In August 2009, Steve marries Becky Granger (Katherine Kelly), who cares for Amy as if she was her own daughter. In May 2010, when Amy is bullied about Tracy, Becky tells her about Tracy being in prison and they later visit her. Tracy's grandmother Blanche Hunt (Maggie Jones) dies in the same month. Becky looks after a confused and upset six-year-old Amy and she ties a picture to a balloon for Blanche. Tracy attends Blanche's funeral and is reunited with Amy, who is initially frightened of her. On Christmas Day 2010, Amy is upset further when Tracy attacks Becky. Tracy is freed and visits Amy, who tells her about Steve and Becky buying Max Turner (Harry McDermott). Amy moves in with Tracy at the Barlow house. In early 2011, Amy goes to Blackpool with Steve and Tracy. When she becomes fed up with them arguing, she runs off. Amy is eventually found and the family spend the night in Blackpool, after Steve's car is towed away. Amy is diagnosed with a dairy allergy after she ends up in hospital. Amy deliberately starts making herself ill, so Steve will come and look after her with Tracy. Tracy and Steve are mortified when Amy admits she has been drinking milk on purpose in a bid for more attention. In the summer of 2011, Steve leaves Amy with Tracy's adoptive nephew James Cunningham (James Roache), when he has a work problem to deal with. James asks Amy to go upstairs, but she overhears his conversation with a surveyor. James threatens to put Tracy in prison if Amy tells anyone. A few days later, Amy tells Tracy and James insists she is making the story up. Tracy and Amy then leave for London for a few weeks."]}, {"page": "William Roach", "response": ["* William James Roache (born 1985), his son and fellow actor"]}, {"page": "Roache", "response": ["*James Roache, British actor and son of William Roache"]}, {"page": "List of former Coronation Street characters", "response": ["|James Cunningham || James Roache || 2010–2011"]}, {"page": "List of British actors", "response": ["* James Roache (born 1985)"]}, {"page": "Sian Powers", "response": ["The couple volunteer at a charity kitchen for the homeless but Sophie is ripped off by James Cunningham (James Roache). Sian goes on holiday to France with her mother and Amber Kalirai (Nikki Patel) kisses Sophie while she's away. Sian returns to Weatherfield early from her holiday in France. Sophie is surprised to see Sian; and feels guilty about the kiss with Amber on a girls' night out the previous evening. Later that afternoon, Sophie tells Sian that her life without her is worthless, and empty, and that she wants to marry Sian some time soon. Sian is very happy by this proposal, as they have been dating for a while. Over the next few weeks Sophie's life becomes complicated, as her unreciprocated feelings for Amber escalate. Sophie begins feeling guilty and suggests to Sian, that as their parents disapprove of them getting married, as they are too young; they should elope to Gretna Green. Sian reluctantly agrees, worrying about the upset eloping would cause their parents. They pack their bags and make their way to Manchester coach station, to catch a coach to Carlisle. Meanwhile, Sally discovers a hand written note, detailing the coach departure time. Both Sally and Rosie rush to the coach station, to explain that she will allow them to get married, if Kevin Webster agrees also. Sian and Sophie are both thrilled and their wedding date is set for late December 2011."]}, {"page": "List of Coronation Street characters (1960)", "response": ["Some time later, Susan discovered that she was pregnant and wrote to him, asking if he wanted to try again with their relationship, but the letter was misplaced and Ken did not read it or become aware of its existence. Her son, Lawrence Cunningham (Linus Roache), was born later that year. Lawrence went on to become an English lecturer and had two children of his own, James Cunningham (James Roache) and Chloe, with Ken none the wiser until August 2010 when Susan's letter was found behind a skirting board at No.3. By this time, Susan had been dead for several years but the discovery of the letter prompted Ken to contact Lawrence and on meeting him, it became obvious to Ken that Lawrence was his son. Ken began to bond with his son but after discovering that Lawrence was homophobic and disapproved of his son, James, being homosexual, Ken cut all contact with him, angry that he would disown his own son for being different."]}, {"page": "List of Coronation Street characters (2010)", "response": ["James Cunningham is the son of Lawrence Cunningham (Linus Roache), played by James Roache. James' grandfather, Ken Barlow (William Roache), never knew Lawrence and James existed until 2010 when Norris Cole (Malcolm Hebden), who lives in Ken's old house, discovers a letter from James' grandmother Susan Cunningham (Patricia Shakesby) behind a skirting board telling him she was pregnant with his child. After Ken contacts Lawrence, he discovers he has a son, James, and a daughter, Chloe. James visits Ken in The Rovers and tells him he does not get on with his father because he is gay. James reveals that he works at a charity shop and has been a musician, playing the guitar. Ken visits Lawrence at his home and tries to resolve things between his son and grandson but James storms out after another argument with his father erupts. Ken falls out with Lawrence as he feels he cannot accept his son's homosexuality. James later visits Ken at his home and reveals that he did not make it easy for Lawrence to accept him being gay by having an older boyfriend and rubbing his father's face in his sexuality. James tells Ken that he should not bother trying to change Lawrence's views and that he is happy that he has a new grandfather, telling Ken it is a result. In October 2010, James sends Ken a card on his 71st birthday, indicating that they have kept in touch."]}, {"page": "The Road to Coronation Street", "response": ["Jessie Wallace was given the role of Pat Phoenix, who played Elsie Tanner in Coronation Street. Wallace briefly had sessions with a dialect coach before filming commenced. James Roache plays his father William Roache in the drama. The elder Roache has played Ken Barlow in Coronation Street since its inception. As well as acting in The Road to Coronation Street, James was filming scenes for Coronation Street in a non-regular role as Ken Barlow's grandson, James Cunningham at the same time. Celia Imrie played Doris Speed, who played the character of Annie Walker and Lynda Baron played the role of Violet Carson, who played one of Coronation Streets most iconic characters, Ena Sharples. John Thomson and Michelle Holmes, who had previously been members of the Coronation Street cast, appeared as H.V. Kershaw and Harry Elton's secretary respectively.", "* James Roache as William Roache"]}, {"page": "List of Coronation Street characters (2011)", "response": ["| A volunteer raising money for the soup kitchen run by James Cunningham (James Roache).", "| A surveyor who James Cunningham (James Roache) hires in an attempt to remortage the Barlow home from under them."]}, {"page": "List of LGBT characters in soap operas", "response": ["*James Cunningham, portrayed by James Roache, appeared in the serial between 2010 and 2011. James is gay, which causes his rejection by his father, Lawrence Cunningham (Linus Roache)."]}, {"page": "William James Roache", "response": ["#REDIRECT James Roache"]}, {"page": "William Roache", "response": ["Roache lives in Wilmslow, Cheshire. His eldest son, by his first wife Anna Cropper (1938–2007), is actor Linus Roache (born 1964). The couple also had a daughter named Vanya (1967–2018). Roache and Cropper were married from 1961 until divorcing in 1974. Roache married his second wife, Sara McEwan Mottram, in 1978. She died suddenly on 7 February 2009 at their home, at the age of 58. With Sara, he had a daughter named Verity (born 1981) and a younger son, actor James Roache (christened William; born 1985). A second daughter, Edwina, died at the age of 18 months on 16 November 1984. Roache dated weather reporter Emma Jesson from 2010 to 2012."]}, {"page": "William Roache (actor, born 1985)", "response": ["#REDIRECTJames Roache"]}, {"page": "Roache, James", "response": ["#redirectJames Roache"]}]}}