{"wiki_id": "http://www.wikidata.org/entity/Q6145956", "itemLabel": "James Young", "itemDescription": "Scottish chemist, born 1811", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Young_(chemist)", "wikipedia_page": {"main": "James Young FRS FRSE FCS DL LLD (13 July 1811 – 13 May 1883) was a Scottish chemist best known for his method of distilling kerosene (known as paraffin in the British English) from coal and oil shales. He is often referred to as Paraffin Young.", "link_mentions": [{"page": "Kerosene", "response": ["* Butt, John (1963) \"James Young, Scottish Industrialist and Philanthropist,\" PhD thesis (University of Glasgow, Scotland, UK), p. 227.", "Despite clear priority of discovery, Gesner did not obtain his first kerosene patent until 1854, two years after James Young's United States patent.Gesner, Abraham, \"Improvement in kerosene burning-fluids,\" U.S. Patent no.s 11,203 ; 11,204 ; 11,205 (issued:  27 June 1854).Young, James, \"Improvement in making paraffine-oil,\" U.S. Patent no. 8,833 (issued:  23 March 1852). Gesner's method of purifying the distillation products appears to have been superior to Young's, resulting in a cleaner and better-smelling fuel. Manufacture of kerosene under the Gesner patents began in New York in 1854 and later in Boston—being distilled from bituminous coal and oil shale. Gesner registered the word \"Kerosene\" as a trademark in 1854, and for several years, only the North American Gas Light Company and the Downer Company (to which Gesner had granted the right) were allowed to call their lamp oil \"Kerosene\" in the United States.", "In 1848, Scottish chemist James Young experimented with oil discovered seeping in a coal mine as a source of lubricating oil and illuminating fuel. When the seep became exhausted, he experimented with the dry distillation of coal, especially the resinous \"boghead coal\" (torbanite). He extracted a number of useful liquids from it, one of which he named paraffine oil because at low temperatures, it congealed into a substance that resembled paraffin wax. Young took out a patent on his process and the resulting products in 1850, and built the first truly commercial oil-works in the world at Bathgate in 1851, using oil extracted from locally mined torbanite, shale, and bituminous coal. In 1852, he took out a United States patent for the same invention. These patents were subsequently upheld in both countries in a series of lawsuits, and other producers were obliged to pay him royalties."]}, {"page": "Petroleum", "response": ["Chemist James Young noticed a natural petroleum seepage in the Riddings colliery at Alfreton, Derbyshire from which he distilled a light thin oil suitable for use as lamp oil, at the same time obtaining a more viscous oil suitable for lubricating machinery. In 1848, Young set up a small business refining the crude oil."]}, {"page": "David Livingstone", "response": ["Livingstone attended Blantyre village school, along with the few other mill children with the endurance to do so despite their 14-hour workday (6 am–8 pm). Having a family with a strong, ongoing commitment to study reinforced his education. After reading the appeal by Gutzlaff for medical missionaries for China in 1834, he began saving money to enter Anderson's University, Glasgow in 1836, where he made lifelong friends including James Young, as well as attending Greek and theology lectures at the University of Glasgow."]}, {"page": "Abraham Pineo Gesner", "response": ["By the late 1850s, the North American Kerosene Company began to face increased competition as various coal oil competitors entered the scene. In response to the increased competition, the North American Kerosene Company published a pamphlet on March 28, 1859, that advised customers that kerosene is their registered trademark and that oils made by others can not use the name. One prominent rival manufacturer, Samuel Downer of Boston, Massachusetts, made an agreement in early 1859 to license the name and Gesner's refinement process. When James Young, a Scottish chemist, who had independently developed a process of distilling a petroleum fuel into a product he named \"paraffin oil,\" became aware of the North American Kerosene Company's claims, he filed for patent infringement and won.  Although Young only began his distillation experiments in 1848, two years after Gesner's first public demonstration of Kerosene, he was first to file an American patent for his process in 1852. Thereafter, the North American Kerosene Company had to pay royalties to Young."]}, {"page": "Paraffin Young", "response": ["#REDIRECT James Young (chemist)"]}, {"page": "Wemyss Bay", "response": ["===James Young of Kelly===", "In 1867 Scott sold the Kelly estate to James Young, who had become a wealthy industrialist by inventing paraffin, and was known from then as James Young of Kelly. After his wife Mary died in April 1868,Memorial in Inverkip Cemetery names James Young of Kelly, Mary Young died 5 April 1868 he continued living at Kelly House with his family."]}, {"page": "African Lakes Corporation", "response": ["The predecessor of this company was established as the Livingstonia Central Africa Company in 1877 with its head office in Glasgow by a group of local businessmen. Its first directors were James Cochran Stevenson, John Stephen, James S Napier, James White and James Young, and David Livingstone's son-in law Alexander Low Bruce joined them soon after. Its first managers were two brothers, John Moir and Frederick Moir.Records of The African Lakes Corporation plc, "]}, {"page": "James Napier (chemist)", "response": ["He joined the Philosophical Society of Glasgow in 1849, and many of his 32 known scientific papers were presented to the Society. He was elected a Fellow of the Royal Society of Edinburgh in 1876. His proposers were James Young, George Forbes, Lord Kelvin, and John Hutton Balfour."]}, {"page": "M. M. Pattison Muir", "response": ["In 1873 he married Florence Haslam. In the same year he was elected a Fellow of the Royal Society of Edinburgh. His proposers were William Thomson. Lord Kelvin, James Thomson Bottomley, Sir Thomas Edward Thorpe and James Young. He resigned from the Society in 1889."]}, {"page": "James Young", "response": ["James Young may refer to:", "*James Young (physician) (1929–2008), American White House physician", "*James Young (chemist) (1811–1883), Scottish chemist; distilled paraffin from coal", "*James Young (Canadian politician) (1835–1913), member of the Canadian House of Commons", "*James Young (congressman) (1866–1942), U.S. Representative from Texas", "*James Young (mayor) (born 1955), first African American to be elected mayor of Philadelphia, Mississippi, 2009", "*James Young (New Brunswick politician) (1841–1907), merchant and political figure in New Brunswick, Canada", "*James Young (Upper Canada politician) (1777–1831), political figure in Upper Canada", "*James Young (trade unionist) (1887–1975), Scottish politician and trade unionist", "*James Young (Missouri politician) (1800–1878), Lieutenant Governor of Missouri who also served in the Tennessee House of Representatives", "*James Young (American football) (born 1950), former professional American football defensive end", "*James Young (basketball) (born 1995), American basketball player", "*James Young (cricketer) (1913–1994), South African cricketer", "*James Young (footballer, born 1882) (1882–1922), Scottish footballer, played for Celtic F.C. and Scotland", "*James Young (footballer, born 1891) (1891–?), Scottish footballer", "*James Young (hurler), hurling player from County Laois, Ireland", "*James Young (American musician) (born 1949), guitarist for the band Styx", "*James Young (British musician) (born 1952), author and musical collaborator with Nico", "*James Young (comedian) (1918–1974), Northern Irish comedian", "**James Young (album), a comedy album by James Young ", "*James Young (director) (1872–1948), American film director and actor", "*James Hardy Vaux (1782–?), wrote the first Australian dictionary and used James Young as an alias", "*James Young (Royal Navy officer, born 1717) (1717–1789), Royal Navy officer", "*James Young (Royal Navy officer, born 1762) (1762–1833), Royal Navy officer", "*James Young (British Army officer) (1858–1926), British general", "*James Young (Arizona pioneer) (1844–1935), African-American boxer and Arizona pioneer", "*James Young (coachbuilder), a coachbuilder for carriages or automobiles"]}, {"page": "Dechmont", "response": ["*Edward Meldrum, the business partner of James Young bought Old Dechmont House in 1865 and rebuilt it as Dechmont Castle in 1869. He died there in 1875.http://www.dailyrecord.co.uk/news/local-news/memory-lane-story-dechmont-castle-10044880 "]}, {"page": "Chuma and Susi", "response": ["They supported Livingstone on his last travels, and after his death played a leading role in taking his body to the coast for return to Britain. In 1874 they went to Britain, visiting his family and friend and benefactor James Young, and helped Horace s.", "Although Susi and Chuma did not travel with the body from Africa or attend the funeral they were invited by James Young later in 1874 to come to Britain with a view to helping Horace Waller to edit Livingstone's last journals for publication. While in the UK they stayed at Newstead Abbey, home of Livingstone's friend William Webb. They returned to Africa in October the same year."]}, {"page": "1883 in the United Kingdom", "response": ["* 13 May – James Young, Scottish chemist (born 1811)"]}, {"page": "James young (chemist)", "response": ["#REDIRECT James Young (chemist)"]}, {"page": "Young (surname)", "response": ["*James Young (American musician) (born 1949), singer and guitarist for Styx", "* James Young (basketball) (born 1995), NBA player; 2019-20 top scorer in the Israel Basketball Premier League", "*James Young (chemist) (1811–1883), Scottish chemist best known for his method of distilling paraffin from coal"]}, {"page": "George Wilson (chemist)", "response": ["In 1838 he moved to London to join his brother Daniel, working (unpaid) under Thomas Graham, working alongside James Young and Lyon Playfair. Here he formed a lifelong friendship with one of his students: David Livingstone. He completed a doctoral thesis on haloid salts in 1839 and returned to Edinburgh."]}, {"page": "Oil tanker", "response": ["The technology of oil transportation has evolved alongside the oil industry. Although human use of oil reaches to prehistory, the first modern commercial exploitation dates back to James Young's manufacture of paraffin in 1850.Woodman, 1975, p. 175. In the early 1850s, oil began to be exported from Upper Burma, then a British colony. The oil was moved in earthenware vessels to the river bank where it was then poured into boat holds for transportation to Britain.Woodman, 1975, p. 176."]}, {"page": "List of British innovations and discoveries", "response": ["*The world's first oil refinery and a process of extracting paraffin from coal laying the foundations for the modern oil industry – James Young (1811–1883)", "*General anaesthetic – Pioneered by Scotsman James Young Simpson and Englishman John Snow", "* Pioneering the use of surgical anaesthesia with Chloroform: Sir James Young Simpson (1811–1870) Drug discovery: a history By Walter Sneader", "* Pioneering the use of surgical anaesthesia with Chloroform: Sir James Young Simpson (1811–1870) ", "*Kerosene invented : Abraham Gesner and James Young."]}, {"page": "List of fellows of the Royal Society W, X, Y, Z", "response": ["|James Young||12/06/1873||13 July 1811 – 13 May 1883"]}, {"page": "James Young (Scottish chemist)", "response": ["#REDIRECT James Young (chemist)"]}, {"page": "Edward Meldrum", "response": ["Edward Meldrum  FRSE DL (1821–1875) was a Scottish chemist who was partner to James Young in his oil and paraffin ventures creating the company Young & Meldrum and the independent company of Meldrum & Co in Glasgow.", "He gained early experience at Muspratt's Chemical Works in Liverpool. Here in 1842 he encountered and befriended the company's manager, James Young. In 1848 he went into partnership with Young in the petrol works at Alfreton discovered by Lyon Playfair. When Young made his famous paraffin discoveries near Bathgate it was Meldrum with whom he formed a business partnership to extract the paraffin.", "His marble bust sculpted by William Brodie was presented to Bathgate Town Hall in 1876 by James Young."]}, {"page": "Thomas Rowatt", "response": ["He was born in Kew on 7 November 1879 to Scottish parents. His grandfather Thomas Rowatt (d.1880) was involved with James Young in the Scottish shale oil industry.https://www.scottishshale.co.uk/KnowledgePages/Companies/Rowatt_Yool.html"]}, {"page": "1st Linlithgowshire Rifle Volunteers", "response": ["* 4th Linlithgowshire RVC, formed at Bathgate 9 August 1862 from employees of Young's Chemical Works under the command of James Young"]}, {"page": "James \"Paraffin\" Young", "response": ["#redirect James Young (chemist)"]}, {"page": "Kirk of Calder", "response": ["The interior includes a memorial window to James Young FRS (\"Paraffin Young\")."]}]}}