{"wiki_id": "http://www.wikidata.org/entity/Q6145935", "itemLabel": "James Yorke", "itemDescription": "Anglican bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Yorke_(bishop)", "wikipedia_page": {"main": "James Yorke (9 March 1730 – 26 August 1808) was a British clergyman.\nYorke was the son of Philip Yorke, 1st Earl of Hardwicke and Margaret Cocks.\nHe was educated at Newcome's School, proceeding in 1748 to Corpus Christi College, Cambridge (M.A. 1752, D.D. 1770).", "link_mentions": [{"page": "Charles Simeon", "response": ["Simeon received the living of Holy Trinity Church, Cambridge, in 1783. The appointment, technically a curacy, followed the death of the Rev. Henry Therond. Simeon's father intervened with James Yorke, the Bishop of Ely, and he was appointed, under the age of 23, as a curate-in-charge for the bishop. He was at first unpopular, and indeed the congregation would have preferred John Hammond (died 1830), who had been curate there, and became lecturer. Services were disrupted, and he was insulted in the streets. Simeon remained there for the rest of his life, eventually with a crowded church."]}, {"page": "Philip Yorke, 1st Earl of Hardwicke", "response": ["* Hon. James Yorke (1730–1808), became Bishop of Ely"]}, {"page": "Earl of Hardwicke", "response": ["Numerous other members of the Yorke family have also gained distinction. The Honourable Charles Yorke, second son of the first Earl, was also Lord Chancellor of Great Britain. He was the father of 1) the third Earl, 2) Charles Philip Yorke, Home Secretary between 1803 and 1804, and 3) Sir Joseph Sydney Yorke, an Admiral in the Royal Navy, who was the father of the Honourable Eliot Yorke, Member of Parliament for Cambridgeshire. The Honourable Joseph Yorke, third son of the first Earl, was a soldier, politician and diplomat and was created Baron Dover in 1788. The Honourable John Yorke, fourth son of the first Earl, sat as Member of Parliament for Reigate and Higham Ferrers. The Right Reverend the Honourable James Yorke, fifth son of the first Earl, was Bishop of Ely. He was the father of 1) Joseph Yorke, who was the father of Joseph Yorke, Member of Parliament for Reigate, who was the father of John Yorke, a Conservative politician, who was the grandfather of the author Henry Green; and 2) Reverend Philip Yorke, who was the father of Colonel Philip James Yorke (1799-1874), a Fellow of the Royal Society, and Reginald Yorke (1803-1870), a Rear-Admiral in the Royal Navy.", "**Charles James Yorke, Viscount Royston (1797–1810)"]}, {"page": "James Nasmith", "response": ["He was nominated by his college in 1773 to the rectory of St Mary Abchurch with St Laurence Pountney, London, but before he could be instituted he exchanged for the rectory of Snailwell, Cambridgeshire. When the headship of his college became vacant in 1778; but he declined the offer of it, and was promoted by Bishop James Yorke in 1796 to the rectory of Leverington, in the Isle of Ely."]}]}}