{"wiki_id": "http://www.wikidata.org/entity/Q6147336", "itemLabel": "Jamie Paterson", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Jamie_Paterson_(footballer,_born_1991)", "wikipedia_page": {"main": "Jamie Charles Stuart Paterson (born 20 December 1991) is an English professional footballer who formerly played for Swansea City.   He can operate as both a winger and forward.\n\n", "link_mentions": [{"page": "Mat Sadler", "response": ["Sadler made his Walsall debut, in the opening game of the season, in a 1–0 win over Leyton Orient. In the next game against Hartlepool United seven days later, Sadler provided an assist when he was fouled in the penalty box, leading to penalty and was successfully converted by Jon Macken in a 1–1 draw. His impressive display in the first team lead to being praised by Manager Dean Smith, who gave him a nickname as 'Mr Reliable'. Then on 5 November 2011, Sadler provided assist for Jamie Paterson, in a 1–1 draw against Huddersfield Town to end three games without a point. However, in a 1–1 draw against Charlton Athletic on 10 December 2011, Sadler was sent–off after a second bookable offence in a last minutes and missed a match in the FA Cup second round replay against Dagenham & Redbridge, which saw Walsall lost in a penalty–shootout. Despite the suspension, Sadler remained in the first team and then scored his first goal for Walsall on 27 March 2012, in a 3–1 win over Colchester United in what BBC Sport described as \"breaking one of football's longer droughts in his 193rd league game (also 222nd in all appearance\". Then in the match against Huddersfield Town on 28 April 2012, Sadler provided assist for Florent Cuvelier, in a 1–1 draw, to ensure that the club will be playing in League One next season."]}, {"page": "Dan Harding", "response": ["Harding started the 2013–14 season as an unused substitute before making his first start in a 3–1 win over Hartlepool United in the first round of League Cup. Harding played against Derby County, but was barely used in the first team as Chris Cohen was preferred in the left-back position. Harding made five appearances when Cohen was injured  but then returned to the substitutes bench following the arrival of Danny Fox in January. Harding provided an assist for Jamie Paterson in a 2–1 loss against Millwall on 5 April 2014. He went on to make nineteen appearances for the club."]}, {"page": "James Paterson", "response": ["*Jamie Paterson (footballer, born 1973), Scottish footballer", "*Jamie Paterson (footballer, born 1991), English footballer"]}, {"page": "Danny Fox", "response": ["Fox made his Nottingham Forest debut on 2 February 2014, where he played 62 minutes before being substituted, in a 3–1 win over Yeovil Town. After making his debut, Fox expressed delight to make his Nottingham Forest debut, though he stated the game was tough. A week later on 11 February 2014 against Huddersfield Town, Fox provided an assist for Jamie Paterson, who scored twice, in a 3–0 win. However, personal reasons and an injury, which he sustained in a match against Birmingham City on 19 April 2014, restricted him to 14 appearances."]}, {"page": "Djamel Abdoun", "response": ["Djamel Abdoun scored his first goal in a home FA Cup Third Round tie against West Ham United. The goal came from a penalty awarded for a challenge on Jamie Paterson. Abdoun was insistent he was taking the penalty, even arguing with his fellow team-mates on the pitch, and his persistence paid off as he scored with an audacious chip from the spot. Forest went on to win the game 5–0."]}, {"page": "Caludon Castle School", "response": ["* Jamie Paterson (born 1991), Professional football player, currently playing for Swansea, formerly of Bristol City, Nottingham Forest, Huddersfield and Walsall"]}, {"page": "List of Adidas sponsorships", "response": ["*  Jamie Paterson"]}, {"page": "Febian Brandy", "response": ["Brandy made his debut for Walsall as an 89th-minute substitute in a 1–0 win over Brentford in the first round of League Cup. He then came on for Jamie Paterson in the opening match of the league season, a 3–0 loss against Doncaster Rovers. After the match, Brandy suffered a hamstring injury that saw him sidelined for a month. Brandy made his return from injury, coming on as a late substitute, in a 2–1 win over AFC Bournemouth on 29 September 2012. After making a slow start without scoring, Brandy finally scored his first goal for the club (and his first goal in English Football since late-2009) in a 2–2 draw against Crawley Town on 17 November 2012. Brandy continued to impress the club when he made a double assist for Jamie Paterson and Will Grigg in a 2–2 draw against Yeovil Town on 15 December 2012. This was followed by scoring a winner in a 1–0 win over Colchester United; and then scoring an equaliser and then set up a goal for Paterson, for the third goal, in a 4–2 win over Milton Keynes Dons. After serving a one match, he scored his fourth goal on his return on 4 January 2013, coming in Walsall's televised league match on Sky Sports against Portsmouth and set up a goal for Grigg, in a 2–0 win. This was followed up by scoring his fifth goal for the club, in a 3–1 win over Preston North End. Due to his goalscoring form, Brandy said he proved the critics wrong by placing 14th, 14 points clear of the relegation zone. However, he was sent–off for a second bookable offence, in a 3–1 win over Bournemouth on 19 January 2013. After returning from suspension, Brandy scored his sixth goal of the season, in a 2–1 win over Doncaster Rovers on 9 February 2013. For his performance, he was nominated for nPower League One Player of the Month Award for February 2013 but lost out to Peter Hartley. In addition, Walsall opened talks with Brandy over a new contract. Brandy broke his three months goal drought when he scored in a 1–1 draw against Bury on 20 April 2013. At the end of the 2012–13 season, making thirty–seven appearances and scoring seven times in all competitions, he left the club after turning down a contract offer from Walsall."]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Jamie Paterson||||2015–2016||22 (12)||6||2||2||0||0||0||0||0||0||24 (12)||8"]}, {"page": "Walsall F.C. Youth and Reserves", "response": ["Walsall's Youth Academy has produced a number of first team players throughout the club's history. In recent years, notable graduates to go on to play in higher divisions include Matty Fryatt, Julian Bennett, Scott Dann, Jamie Paterson, Will Grigg and Troy Deeney."]}, {"page": "List of Nottingham Forest F.C. seasons", "response": ["|Jamie Paterson"]}, {"page": "Romaine Sawyers", "response": ["On 27 July 2019, Sawyers returned to West Bromwich Albion, signing a three-year contract after being bought for an undisclosed fee (reported to be £2.9 million); Sawyers stated that \"this is the team that I have always wanted to play for\". Manager Slaven Bilić said that \"we targeted him as a player who will raise the quality in our midfield\". He chose to wear the #19 shirt in homage to former midfielder Jason Koumas. On 22 February 2020, he was sent off after putting his hand to the throat of former Walsall teammate Jamie Paterson during a 3–0 win at Bristol City. During break in play due to the COVID-19 pandemic in England, FourFourTwo magazine listed Sawyers as the ninth best player in the EFL. He ended the 2019–20 season with one goal in 43 appearances as the \"Baggies\" secured the Championship's second automatic promotion place. He was also named in the Championship's PFA Team of the Year."]}, {"page": "2012–13 Stevenage F.C. season", "response": ["The new year began with a 1–0 defeat by Walsall at the Bescot Stadium on 1 January. A long-range Jamie Paterson strike with three minutes remaining was enough to settle the game. Four days later, Stevenage travelled to Crewe looking for their first win in a month. The game ended 2–1 to Stevenage, coming back from a first-half deficit to take all three points. Former Stevenage loanee, Chuks Aneke, had given Crewe the lead with a calm side-footed effort mid-way through the first period. Stevenage replied twice within the space of five second-half minutes; first Lucas Akins tapped in Anthony Grant's centre, before Akins' flick-on gave Marcus Haber room to run and slide the ball through Steve Phillips' legs in the Crewe goal. A week later, on 12 January, Stevenage's bad home form continued when they lost 2–1 to promotion chasing Doncaster Rovers. Doncaster, without a manager at the time of the game due to Dean Saunders leaving for Wolverhampton Wanderers, scored twice late-on to secure victory after Stevenage had led through James Dunne's powerful half-volley. The defeat meant that Stevenage were without a home win in six league matches. Stevenage's scheduled away game against Bury on 19 January was postponed as a result of heavy snowfall in the days leading up to the fixture. The Gigg Lane pitch failed an 11:30am inspection a day before the match was due to be played."]}, {"page": "Jamie Paterson", "response": ["Jamie Paterson may refer to:", "*Jamie Paterson (footballer, born 1973), Scottish footballer", "*Jamie Paterson (footballer, born 1991), English footballer"]}]}}