{"wiki_id": "http://www.wikidata.org/entity/Q6145875", "itemLabel": "James Wyllie", "itemDescription": "British draughts player", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Wyllie", "wikipedia_page": {"main": "James Wyllie (8 July 1818 – 5 April 1899) was a Scottish draughts player who is important to the history of the game. He is often nicknamed \"The Herd Laddie\". For many years the date of his birth was uncertain. The day was thought to have been 6 July and 1818 and 1820 were both candidates for the year. However, in 2005 research at the National Archives confirmed the correct date.", "link_mentions": [{"page": "English draughts", "response": ["The men's World Championship in English draughts dates to the 1840s, predating the men's Draughts World Championship, the championship for men in International draughts, by several decades. Noted world champions include Andrew Anderson, James Wyllie, Robert Martins, Robert D. Yates, James Ferrie, Alfred Jordan, Newell W. Banks, Robert Stewart, Asa Long, Walter Hellman, Marion Tinsley, Derek Oldbury, Ron King, Michele Borghetti, Alex Moiseyev, Patricia Breen, and Amangul Durdyyeva.WCDF champions list Championship held in GAYP (Go As You Please) and 3-Move versions. The winners in men's have been from the United Kingdom, United States, Barbados, and most recently Italy in the 3-Move division."]}, {"page": "List of draughts players", "response": ["*James Wyllie"]}, {"page": "Robert D. Yates", "response": ["Robert D. Yates (December 27, 1857 in Brooklyn; September 19, 1885) was an American draughts champion and medical doctor. He was considered to be prodigious at draughts and was the only American to hold the title of world champion in the 19th century, which he won from James Wyllie in 1876 at age 18. He held the title until 1878 when he retired as world champion and the title reverted to Wyllie. He died of typhus at age 27 while serving as ships physician aboard the steamship Scheidam and was buried at sea."]}, {"page": "World Checkers/Draughts Championship", "response": ["| 1844–1847||  James Wyllie||align=\"left\"| ", "| 1849–1859||  James Wyllie||align=\"left\"|  ", "| 1864–1876||  James Wyllie||align=\"left\"|  ", "| 1878–1894||  James Wyllie ||align=\"left\"| "]}, {"page": "James Ferrie", "response": ["James Ferrie (born 1857; died 1929Old Time Players page at Checkerworld ) was a Scottish checkers or English draughts player of Irish descent.Chambers's Journal for 1896, pg 430 He was the World Checkers/Draughts Champion from 1894 to 1896 and again from 1903 to 1912WCDF champions list He first became champion by defeating James Wyllie in 1894.Reading Eagle of July 25, 1895 He is mentioned in the book One Jump Ahead: Computer Perfection at Checkers by Jonathan Schaeffer.One Jump Ahead by Jonathan Schaeffer"]}, {"page": "Robert Martins", "response": ["Robert Martins (born in Penryn, Cornwall on 26 February 1822;The People's Draughts Book, pg 39 died 1904Checkers Chest) was a British draughts player who was World Checkers/Draughts Champion from 1859 to 1864.WCDF champions list Although of English/Cornish origin he spent much of his later life in Scotland. He was a noted rival of James Wyllie. \"Chambers's Journal\" physically described him as tall, pale-faced, and long-headed. While in personality they considered him courteous and cautious in expressing opinions on points of the game.Chambers's Journal, Volume 73 by William Chambers and Robert Chambers, pgs 429-430"]}, {"page": "Wyllie", "response": ["* James Wyllie (1818–1899), Scottish draughts player"]}, {"page": "Wyllie, James", "response": ["#redirectJames Wyllie"]}]}}