{"wiki_id": "http://www.wikidata.org/entity/Q6145786", "itemLabel": "James Woodford", "itemDescription": "English sculptor", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Woodford", "wikipedia_page": {"main": "James Arthur Woodford  (1893–1976) was an English sculptor. His works include sets of bronze doors for the headquarters of the Royal Institute of British Architects and Norwich City Hall; the Queen's Beasts, originally made for the Coronation in 1953, and later replicated in stone, and the statue of Robin Hood outside Nottingham Castle.", "link_mentions": [{"page": "Royal Institute of British Architects", "response": ["The RIBA's headquarters has been at 66 Portland Place, London, since 1934. This Grade II* listed building was designed by architect George Grey Wornum for the institute and features sculptures by Edward Bainbridge Copnall and James Woodford. The building is open to the public, and includes a library, architectural bookshop, a café, bar, exhibition galleries and lecture theatre. Rooms are hired out for events."]}, {"page": "British Medical Association", "response": ["A 1954 war memorial by James Woodford in the central courtyard – a bronze fountain in a stepped pool, with four stone statues – is Grade II* listed, and described by Historic England as a particularly good example of a Second World War memorial to a civilian profession."]}, {"page": "The Queen's Beasts", "response": ["The Queen's Beasts are ten heraldic statues representing the genealogy of Queen Elizabeth II, depicted as the Royal supporters of England. They stood in front of the temporary western annexe to Westminster Abbey for the Queen's coronation in 1953. Each of The Queen's Beasts consists of an heraldic beast supporting a shield bearing a badge or arms of a family associated with the ancestry of Queen Elizabeth II. They were commissioned by the British Ministry of Works from the sculptor James Woodford, who was paid the sum of £2,750 for the work. They were uncoloured except for their shields at the coronation.Bellew, p. 16. They are now on display in the Canadian Museum of History in Gatineau, Quebec.", "In the autumn of 1952 the Minister of Works, in preparation for the coronation some months ahead, called upon the Royal Academician and sculptor James Woodford, OBE, to create ten new beasts similar in form and character to the ten at Hampton Court but more particularly, appropriate to the Queen. Exact replicas of those at Hampton Court would have been unsuitable for the occasion, for some of them would have little connection with Her Majesty's own family or ancestry,Bellew, p.9. as although the Queen is descended (via female lines) from King Henry VII (the father of King Henry VIII),Elizabeth II is descended from Henry VIII’s sister, Queen Margaret of Scotland the grandmother of Mary Queen of Scots. Mary’s son, James I of England had a daughter, Elizabeth who married Frederick V, the Elector Palatine. she is not descended from Jane Seymour whose only son King Edward VI died unmarried."]}, {"page": "James Woodforde", "response": ["James Woodforde (1740–1803) was an English clergyman, mainly in Somerset and Norfolk, remembered as the author of The Diary of a Country Parson. This vivid account of parish life remained unpublished until the 20th century.John Beresford, ed., 5 vols. 1924–1931.", "James Woodforde was born at the Parsonage, Ansford, Somerset, England on 27 June 1740. In adulthood he led an uneventful, unambitious life as a clergyman of the Church of England: a life unremarkable except that for nearly 45 years, he kept a diary recording the everyday routines and concerns of 18th-century rural England.", "In Norfolk, his social life was more limited, but he enjoyed the fellowship of the local clergy who took it in turns to entertain one another to dinner – \"our Rotation Club\".Many references to the Rotation Club, beginning with entry for 13 January 1776 – see R. L. Winstanley, ed., The Diary of James Woodforde, Vol 7, 1776–1777, p. 103. Because he always recorded what was provided for dinner, which very occasionally was an elaborate banquet, he is often wrongly characterised as a glutton. Among the gentry in the 18th century, it was a matter of pride to provide a variety of dishes. Because Woodforde recorded them all, does not mean that he ate from them all.", "The Revd James Woodforde was one of several Woodforde diarists. His niece Nancy, and his nephew Bill's three daughters all kept diaries, as did a number of his predecessors, for instance his great-great-grandfather Robert Woodford of Northampton (1606–1654).", "11 Jan. 1763 – Went on the River again this Morning a skating, and I have improved in the out Stroke a good deal, I was on the Ice from 12 this Morning , 'till 5 this Afternoon; and I gave a Fellow for putting on my Skates , and sometimes altering then – 0 : 0 : 2.R.L. Winstanley (ed.), The Diary of James Woodforde, Vol. 2 (1763–1765).", "13 Nov. 1769 – We had News this Morning of Mr Wilkes gaining his Point against Lord Halifax and 400 Pounds Damages given him. Cary & Ansford Bells rung most part of the Day on the Occasion.R.L. Winstanley (ed.), The Ansford Diary of James Woodforde, Vol. 4 (1769–1771).", "14 April 1775 – We breakfasted, dined, suppd & slept at Norwich. We took a Walk over the city in the morning & we both agreed it was the fairest City in England by far.R.L. Winstanley (ed.), The Oxford & Somerset Diary of James Woodforde (1774–1775).", "1 Jan. 1779 – This morning very early about 1. o'clock a most dreadful Storm of Wind with Hail & Snow happened here and the Wind did not quite abait till the Evening. – A little before 2. o'clock I got up, my bedstead rocking under me, and never in my Life that I know of, did I remember the Wind so high or of so long continuance – I expected every Moment that some Part or other of my House must have been blown down, but blessed be God the whole stood, only a few Tiles displaced... My Chancel received great Damage as did my Barn – the Leads from my Chancel were almost all blown up with some Parts of the Roof – the North West Window blown in & smashed all to pieces.R. L. Winstanley and Peter Jameson, eds., The Diary of James Woodforde, Vol. 8 (1778–1779).", "25 Dec. 1786 – It being Christmas Day, I had the following old men dine at my House on roast beef & plumb Pudding and after Dinner half a Pint of strong ale and a shilling to each to carry home to their Wives – Richd Buck, Thos Cushing, Thos Cary, Thos Carr, Nathaniel Heavers, John Buckman, and my Clerk Js Smith.R. L. Winstanley and Peter Jameson, eds., The Diary of James Woodforde, Vol.11, (1785–1787) ", "25 Jan. 1795 – We breakfasted, dined &c. again at home. The frost this Morning more severe than Yesterday. It froze the Chamber Pots above Stairs.Peter Jameson, ed.,The Diary of James Woodforde, Vol. 14 (1794–1795).", "The artist Samuel Woodforde, one of James Woodforde's nephews, was a member of the Royal Academy.", "**** James Woodforde, diarist, fellow of New College (Oxford), rector of Weston Longville (Norfolk), unmarr. (1740–1803)", "*Hughes, D. (ed.), The Diary of a Country Parson: The Revd James Woodforde, 2015, The Folio Society, London. "]}, {"page": "Nottingham Council House", "response": ["*'Prosperity' by James Woodford.  Strikingly Art-Deco, a female holds a sword.  At her feet are a mother and baby, and a female holding the fruits of the earth.  This group is at the Long Row East corner, (best seen from outside the Yorkshire Bank).  Woodford is the most famous of the sculptors outside his native Nottingham, having created the heraldic Queen's Beasts for the 1953 Coronation Pavilion at Westminster Abbey.  He also had commissions for the liner RMS Queen Mary, the RIBA building in London, as well as the famous statue of Robin Hood at Nottingham Castle.", "File:ccl-hse-stat-1-sml.jpg|‘Prosperity’ by James Woodford"]}, {"page": "Brighton Dome", "response": ["The Corn Exchange was built as the riding school for the Prince Regent (later George IV). The Riding School measured  long,  wide, and  high, and work halted several times because there were difficulties in finding timber large enough to create the roof. The roof is unique; in order to provide as much height as possible no tie beams were provided, instead arched timbers. There was a Royal balcony built for the Prince Regent to watch his horses on the Eastern wall which was later removed. From 1856 to 1864 the stables and the Riding School were let as Cavalry Barracks and on 1 October 1868 the Riding School officially became the town's Corn Exchange. The Corn Exchange underwent a number of transformations and in 1934–35 a new frontage was built featuring a large sculpture of the goddess of corn Ceres by the artist James Woodford. The Canadian maple sprung floor was installed during this period and a new balcony installed at the South End which provided a new entrance into the Supper Rooms. Extensive works began in 2017 to renovate the Corn Exchange and Studio Theatre."]}, {"page": "Eric Aumonier", "response": ["Aumonier worked on the new City Hall in Norwich with Alfred Hardiman and James Woodford."]}, {"page": "Norman Sillman", "response": ["He commenced his art studies in September 1935 at Blackheath School of Art. His tutor was James Woodford RA. As the art school was bombed during the Blitz of 1940, he was unable to take his final examination but he had already been accepted for the Royal College of Art and awarded a scholarship by the London County Council. He began his studies there in September 1940 at their wartime quarters in Ambleside before entering the army in April 1941."]}, {"page": "City Hall, Norwich", "response": ["The architects designed for Norwich an Art Deco public building of national significance. It was built to the highest standards, using superior materials and methods of its day. Even the bricks were specially made, each one being two inches longer than usual to better reflect the proportions of the finished building. Charles Holloway James and Stephen Rowland Pierce engaged Alfred Hardiman as their consultant sculptor.Eastern Daily Press, 21 October 1937 He contributed the iconic lions passant which guard the building, and three figures of Recreation, Wisdom and Education outside the Council Chamber. His colleague James Woodford designed the six main bronze doors, incorporating 18 roundels showing the history and industry of Norwich. Eric Aumonier carved the city arms above the Regalia Room window on Bethel Street, and Margaret Calkin James provided textiles for some of the important rooms."]}, {"page": "Alfred Frank Hardiman", "response": ["Hardiman's best-known (but also most controversial) work is the Earl Haig Memorial on Whitehall in London. More universally admired are the heraldic lions flanking the main entrance to the City Hall, Norwich, a work which fully epitomises his style. He was appointed consultant sculptor to the building,Eastern Daily Press 21 October 1937 having worked with one of the architects, Stephen Rowland Pierce, on the Haig Memorial. Hardiman also carved three large stone figures for the outside of the council chamber, and worked with other sculptors on the project including James Woodford and Eric Aumonier."]}, {"page": "Kew Gardens", "response": ["The Palm House (1844–1848) was the result of cooperation between architect Decimus Burton and iron founder Richard Turner, and continues upon the glass house design principles developed by John Claudius Loudon and Joseph Paxton. A space frame of wrought iron arches, held together by horizontal tubular structures containing long prestressed cables, supports glass panes which were originally tinted green with copper oxide to reduce the significant heating effect. The  high central nave is surrounded by a walkway at  height, allowing visitors a closer look upon the palm tree crowns. In front of the Palm House on the east side are the Queen's Beasts, ten statues of animals bearing shields. They are Portland stone replicas of originals done by James Woodford and were placed here in 1958."]}, {"page": "Woodford (surname)", "response": ["*James Woodford (bishop) (1820–1885), Bishop of Ely from 1873", "*James Woodford (1893–1976), English sculptor", "*James Woodforde (1740–1803), English author of The Diary of a Country Parson, published posthumously"]}, {"page": "Roy Noakes", "response": ["Noakes changed his indentures to Gerald Giudici, a master carver who executed large-scale public sculptures by Sir Charles Wheeler, Gilbert Ledward and James Woodford; at the end of a long tradition of figurative sculpture, these free-standing monuments and architectural reliefs represented for the ‘modernist’ Patrick Heron, ‘spurious sentiment and meaningless skill’. Noakes might have agreed, but the path he took in the 1960s related neither to the ‘abstraction’ of Anthony Caro, Phillip King or William Tucker, nor to the vestigial figurative tradition represented by John Davis or the mechanistics of George Fullard and Eduardo Paolozzi."]}, {"page": "Grade II listed buildings in Brighton and Hove: C–D", "response": ["| ||Brighton||100px||Robert Atkinson added this wing to the Corn Exchange/Dome complex in 1934.  Its grey-brick exterior is in a simplified version of William Porden's Islamic-influenced work in the early 1800s.  The four-bay façade has sculptures by James Woodford.||"]}, {"page": "Flag of Nottinghamshire", "response": ["The flag includes a white-fimbriated red St George's Cross on a green background, and a green silhouette of James Woodford's bronze statue of Robin Hood on a white shield."]}, {"page": "List of public art in Nottingham", "response": ["|James Woodford", "|James Woodford"]}, {"page": "James Arthur Woodford", "response": ["#REDIRECT James Woodford"]}, {"page": "Woodford, James", "response": ["#redirectJames Woodford"]}, {"page": "British Medical Association War Memorial", "response": ["The war memorial at British Medical Association House, Tavistock Square, Bloomsbury, London, commemorates men and women of the medical professions from the British Empire and Commonwealth who died in the Second World War. The memorial was commissioned by the British Medical Association and designed by the sculptor James Woodford.  Unveiled in 1954 by Sir John McNee, then President of the BMA, and dedicated by Geoffrey Fisher, the Archbishop of Canterbury, it became a Grade II* listed structure in 1998.", "At the end of World War II, the BMA commissioned a second memorial from the sculptor James Woodford. Woodford, who trained at the Nottingham School of Art, the Royal College of Art and the British School at Rome, had established a reputation as a designer of architectural and heraldic sculpture. The memorial comprises a bronze fountain of intertwined serpents set in a lead-lined circular pool and surrounded by four statues representing \"Sacrifice\", \"Cure\", \"Prevention\" and \"Aspiration\". The statues and the fountain are of Portland stone and the grouping has a base constructed of York stone. The side of the stone fountain surround is inscribed with the words IN MEMORIAM 1939–1945, and a bronze dedicatory plaque reads IN HONOUR OF THE MEDICAL MEN AND WOMEN OF / THE BRITISH EMPIRE AND COMMONWEALTH OF NATIONS / WHO GAVE THEIR LIVES IN THE SECOND WORLD WAR.Fountain: World War 2 fountain at BMA, londonremembers.com  The whole stands within the building's east courtyard, the Court of Honour. It was unveiled by Sir John McNee, President of the BMA, on 2 November 1954. The dedication was given by Geoffrey Fisher, the Archbishop of Canterbury. Fisher's address spoke of \"these medical men [who] saved others, themselves they could not and would not save\". The World War II memorial was separately listed at Grade II* in 1998."]}, {"page": "Listed buildings in Huddersfield (Newsome Ward - central area)", "response": ["|The library and art gallery are steel framed and clad in pink stone, and have a square plan, three storeys and a basement.  The central part of the entrance front protrudes and contains a doorway with a cornice on ogee-shaped consoles.  Flanking and above the doorway are metal-framed rectangular windows, above them is a cornice, and over that a decorative panel.  On the sides are two tiers of similar windows with a bas-relief frieze between.  At the sides of the entrance steps are two free-standing statues by James Woodford."]}]}}