{"wiki_id": "http://www.wikidata.org/entity/Q6145479", "itemLabel": "James Whitworth", "itemDescription": "English cartoonist and journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Whitworth", "wikipedia_page": {"main": "Dr James Whitworth is a nationally syndicated cartoonist and writer. His daily news cartoons appear in papers across the UK from Scotland to the south of England, including the Sheffield Star and the Edinburgh Evening News. He draws a weekly news cartoon for the Sheffield Telegraph as well contributing to  The Author, Hi-Fi News, Copper (in America) and the Dalesman. He has contributed cartoons to a wide range of publications including Private Eye (for whom he has also written gags), Prospect', Phoenix  and The Independent.\nHe also published a weekly strip cartoon, The Steels' City which ran for 150 weeks 2017–2019. \nHe compiled a book of his father's (Ralph Whitworth's) cartoons to much acclaim, and has illustrated a number of books.\nBorn in Sheffield, United Kingdom, Whitworth was educated at Tapton School and Sheffield Hallam University, where he graduated with a degree in English language and literature.  He also holds a postgraduate degree in English. In 2021 he completed a PhD at the University of Sheffield on the history of the British political cartoon.\nWhitworth is a journalist who has written for a wide variety of magazines and newspapers including regular features for the Sheffield Telegraph, as well as online markets. He has also written copy for international companies such as Adobe and Hewlett-Packard. \nHe is a regular guest on BBC radio and has appeared on TV. His work has been published in many countries, including the United States (including school textbooks), and he has illustrated a number of books.\nWhitworth's work is regularly seen in galleries and he has had three solo exhibitions.  In 2013 Whitworth collaborated with Canadian artist Wildago on an exhibition to celebrate the centenary of stainless steel. Whitworth is the official cartoonist of Record Store Day. \nWhitworth is also the author of a series of crime novels set in the North Yorkshire town of Whitby. The first three novels are Death's Disciple, The Eve of Murder, and Bidding to Die. The fourth title, Better the Devil You Know, was published in May 2015, and a fifth novel, Murder on the Record, was published in May 2017. A sixth novel has been commissioned for publication in autumn 2022. \nWhitworth lectures in Journalism at the University of Sheffield. He is an Associate Lecturer at Sheffield Hallam University, Derby University, Leeds Trinity, and Huddersfield. He teaches Public Affairs to NCTJ apprentices. He has also published widely on the history of newspaper cartoons as well as speaking at literary festivals.", "link_mentions": [{"page": "Whitby", "response": ["A crime novel series by James Whitworth is set in Whitby. The first two novels are Death's Disciple and The Eve of Murder. These were followed by Bidding to Die, Better the Devil you Know and Murder on the Record. "]}, {"page": "Sheffield Telegraph", "response": ["Notable staff at the Telegraph have included Sir Harold Evans, who was later PRO to Prime Minister Harold Macmillan, and head of ITV News Service (not to be confused with another Harold Evans, the former editor of The Sunday Times); author Peter Tinniswood; novelists John Harris and J.L. Hodson; cartoonists Ralph Whitworth and J. F. Horrabin for the daily and Pete McKee and James Whitworth for the weekly; critics George Linstead and E. F. Watling; sports writers John Motson, Lawrence Hunter, Peter Keeling, Peter Cooper, Frank Taylor (who later survived the Munich Air crash of 1958), and Keith Farnsworth; sub-editors Jack Westwood and Israel Panner. "]}, {"page": "Tapton School", "response": ["* Dr James Whitworth, cartoonist (Sheffield Star, Sheffield Telegraph, Private Eye), academic and writer (DCI Miller novels & journalism)"]}, {"page": "List of American films of 1978", "response": ["|Planet of Dinosaurs||James Shea||James Whitworth, Charlotte Speer || Sci-fi || Independent"]}, {"page": "Ralph Whitworth", "response": ["In January 1970, Ralph and Lois had a second son, the cartoonist and writer James Whitworth."]}, {"page": "Whitworth, James", "response": ["#redirectJames Whitworth"]}]}}