{"wiki_id": "http://www.wikidata.org/entity/Q6149622", "itemLabel": "Mark Weir", "itemDescription": "British martial artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Weir", "wikipedia_page": {"main": "Mark Anthony Weir (19 September 1967) is an English retired mixed martial artist usually fighting in the middleweight division at 185 lbs. He has fought in the UFC, the WEC, PRIDE, Cage Rage, UCMMA, Pancrase, and BodogFIGHT. He is the former Cage Rage British Middleweight Champion.", "link_mentions": [{"page": "List of male mixed martial artists", "response": ["*  Mark Weir - (UFC, WEC, Cage Rage, PRIDE, Pancrase)"]}, {"page": "Denis Kang", "response": ["It was at this time that Kang caught the attention of the PRIDE Fighting Championships. Kang signed a contract with PRIDE and made his debut at PRIDE Bushido 6, where he defeated Japanese opponent Takahiro Oba via armbar at 4:24 of round one. Under the Korean banner, Denis went on to win his next two fights in PRIDE, with a victory coming over Englishman Mark Weir at PRIDE Bushido 10. In between fights for Pride, Denis fought American Albert Basconcelles and knocked him out within 12 seconds of the opening bell.  At Bushido 11, Kang continued his winning streak by knocking out Chute Boxe member Murilo \"Ninja\" Rua in 15 seconds in the first round of the PRIDE Bushido Welterweight (183 lb) Grand Prix.  At Bushido 12, Denis submitted Armenian Amar Suloev via rear naked choke to advance to the semi-final round of the Welterweight Grand Prix. With this win, Kang was then 18–0–1 in his last 19 contests. However, after advancing through the semi-final round of the Bushido tournament and beating Akihiro Gono on November 5, 2006, he was defeated by Kazuo Misaki in the final at Bushido 13. Kang had torn his right biceps muscle earlier that night in his win over Gono.", "| Mark Weir"]}, {"page": "Akira Shoji", "response": ["| Mark Weir"]}, {"page": "Daijiro Matsui", "response": ["Matsui made his debut for the England-based Cage Rage organization a year later against former Alex Reid and fought to a draw. In his next bout, Matsui faced former UFC veteran Curtis Stout and won via majority decision. Matsui then lost three consecutive bouts before defeating future BAMMA Middleweight Champion and current UFC veteran, Tom \"Kong\" Watson with an armbar submission, the only submission win of Matsui's career to date. Matsui lost his last fight for the organization against Mark Weir.", "| Mark Weir"]}, {"page": "Matt Lindland", "response": ["| Mark Weir"]}, {"page": "David Loiseau", "response": ["Loiseau made his UFC debut in April 2003 at UFC 42, defeating Mark Weir by KO. Later in the year, at UFC 44, he lost a unanimous decision to Jorge Rivera.", "| Mark Weir"]}, {"page": "Jorge Rivera (fighter)", "response": ["| Mark Weir"]}, {"page": "List of Cage Rage champions", "response": ["|align=center |  Paul Daley(def. Mark Weir)", "|align=center |  Mark Weir(def. Sol Gilbert)", "|align=center | Zelg Galesic(def. Mark Weir)"]}, {"page": "Murilo Rua", "response": ["Rua fought three more times in Pride, defeating newcomer Murad Chunkaiev before dropping a lacklustre decision against top ranked Paulo Filho. Nevertheless, Rua was selected as part of the Pride welterweight (185 pound) Grand Prix. In the opening bracket, however, he was knocked out by Denis Kang. Rua then left Pride for a tenure with British MMA promotion Cage Rage in order to strengthen the tie between the two promotions. His first bout, against English UFC veteran Mark Weir, resulted in a victory by submission after a rough and tumble affair. He also defeated Alex Reid via doctor stoppage before the newly created EliteXC organization purchased Cage Rage, therefore he fought for the vacant Elite XC middleweight at Strikeforce: Shamrock vs. Baroni against Greg Jackson trained Joey Villasenor and recorded a second-round TKO, stopping Villasenor with strikes. After three months as the champion, his first title defense came to ICON sport middleweight champion Robbie Lawler. Despite narrowly winning the first two rounds, an exhausted Ninja was defeated via a third-round TKO at EliteXC: Uprising. He rebounded with a victory over Muay Thai fighter and Cage Rage contender Xavier Foupa-Pokam at Cage Rage 24: Feel the pain.", "| Mark Weir"]}, {"page": "Zelg Galešić", "response": ["| Mark Weir"]}, {"page": "Lee Hasdell", "response": ["These events produced and featured fighters such as James Zikic, Bobby Razak, Paul Cahoon, Gary Turner, Ian Freeman, Lee Murray, Mark Weir, Valentijn Overeem, Wataru Sakata, Hiromitsu Kanehara, Yasuhito Namekawa, Jess Liaudin and Danny Batten."]}, {"page": "Nick Thompson (fighter)", "response": ["Nicholas Delton Thompson (born June 23, 1981) is a retired American mixed martial artist. He retired with a professional mixed martial arts record of 38–14–1. He has fought professionally for the Ultimate Fighting Championship (UFC), Strikeforce, Bellator Fighting Championships, and Bodog Fight. He is the former Bodog Fight Welterweight Champion and holds wins over Eddie Alvarez, Josh Neer, Paul Daley, Mark Weir and Chris Wilson.", "| Mark Weir"]}, {"page": "Drew Fickett", "response": ["| Mark Weir"]}, {"page": "Paul Daley", "response": ["After defending his title twice and picking up a knockout win over Duane Ludwig in Strikeforce, Daley was scheduled to make his third title defence in a title unification against Cage Rage World Welterweight Champion Mark Weir at Cage Rage 23. Daley won via second-round knockout, therefore holding both titles. After two more knockout wins in the ShoXC and Cage Warriors promotions, Daley fought Jake Shields at EliteXC: Heat for the EliteXC Welterweight Championship. Daley lost via armbar submission in the second round, snapping a six-fight winning streak. Daley then compiled a record of 3–1 in his next four fights with two appearances for the MFC in Canada.", "| Mark Weir"]}, {"page": "Che Mills", "response": ["Spent early years training with Mark Weir."]}, {"page": "Shannon Ritch", "response": ["| Mark Weir"]}, {"page": "Alex Serdyukov", "response": ["| Mark Weir"]}, {"page": "Alex Reid (fighter)", "response": ["| Mark Weir"]}, {"page": "List of Pride FC alumni", "response": ["|  || Mark Weir|| The Wizard|| 0–1–0 (0)|| Welterweight"]}, {"page": "Johil de Oliveira", "response": ["After his loses at Pride, de Oliveira returned to Brazil to compete in several local organizations. During this period he made a lone appearance in the British MMA promotion Cage Rage, against Mark Weir at Cage Rage 8 being defeated via Arm triangle choke at the 1:35 mark of the first round. During this period, de Oliveira had a nine fight losing streak, mired in complications with his eye sight and fighting against names such as Carlos Newton, Nino Schembri, Rodrigo Damm, Daiju Takase, Mark Weir and future UFC Lightweight Championship winner Rafael dos Anjos.", "| Mark Weir"]}, {"page": "Ultimate Challenge MMA", "response": ["*Mark Weir\t"]}, {"page": "2002 in UFC", "response": ["* Mark Weir"]}, {"page": "Tor Troéng", "response": ["After going 6 amateur-fights 2001-2004, Troéng started doing MMA as a professional in 2005 mostly fighting in smaller promotions in Sweden and other parts of Europe. Since Troéng didn’t have a manager at the time, he accepted every fight that he was offered, even against opponents that was considered to be way above him in the ranks, which was leading to him being an underdog in a lot of his fights. Despite all this, by 2012 he had racked up a record of 15-4-1 (11-1-1 in his last 13 fights) with a victory over UFC veteran Mark Weir and fights against notable opponents like Mamed Khalidov, Lucio Linhares, former UFC title challenger Thales Leites and Pride veteran Daniel Acácio. Troéng is considered one of the best middleweight mixed martial artists to come out of Sweden and Scandinavia.", "|Mark Weir"]}]}}