{"wiki_id": "http://www.wikidata.org/entity/Q6141018", "itemLabel": "James Patrick Gardner", "itemDescription": "British politician (1883-1937)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Patrick_Gardner", "wikipedia_page": {"main": "James Patrick Gardner (5 March 1883 – 25 July 1937) was a Labour Party politician in the United Kingdom.Born in Belfast, he was educated by the Christian Brothers there before taking up the trade of architectural sculptor. He moved to Hammersmith in West London, where he became a member of the borough council in 1919. He was also an official in the National Furnishing Trades Association.In 1922 he was chosen by the Labour Party to contest the Conservative-held seat of Hammersmith North. He failed to be elected on that occasion, but whereas the previous Labour candidate in the seat had finished a poor fourth, Gardner clinched second place, greatly increasing the Labour vote share. When another election was held in the following year he was elected MP for North Hammersmith by the narrow margin of 845 votes over the new Conservative candidate Ellis Ashmead-Bartlett. A further general election was held in October 1924. Unlike 1922 and 1923 when the Liberals had fielded a candidate in North Hammersmith, the 1924 contest was a straight fight between Gardner and his previous Conservative opponent, Ashmead-Bartlett.  Although Gardner actually increased both his vote share and the number of votes he received, Ashmead-Bartlett emerged victorious with a majority of just under 2,000 votes. In 1926, Ellis Ashmead-Bartlett, the MP for Hammersmith North, resigned. In the resulting by-election, held against the background of the General Strike, Gardner regained the seat with the substantial majority of 3,611 votes over the Conservative's Samuel Gluckstein. He retained the seat at the 1929 general election. Following the election the Labour Party formed a minority government. This was subsequently replaced by a National Government in August 1931 leading to a split in the Labour Party. At the election held in October 1931 Gardner, like most Labour MPs opposing the government, was defeated.Gardner did not return to parliamentary politics after his 1931 defeat, but was a member of the Hammersmith council until his death.", "link_mentions": [{"page": "List of United Kingdom by-elections (1918–1931)", "response": ["|James Patrick Gardner"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*James Patrick Gardner, Hammersmith North, 1923–24; 26–31"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|James Patrick Gardner"]}, {"page": "James Gardner", "response": ["* James Patrick Gardner (1883–1937), Member of Parliament for Hammersmith North"]}, {"page": "List of MPs elected in the 1923 United Kingdom general election", "response": ["|James Patrick Gardner"]}, {"page": "1926 Hammersmith North by-election", "response": ["The Hammersmith North by-election of 1926 was held on 20 May 1926.  The by-election was held due to the resignation of the incumbent Conservative MP, Ellis Ashmead-Bartlett.  It was won by the Labour candidate James Patrick Gardner.", "James Patrick Gardner had first contested the seat in 1922, and while he had failed to win he had come second in a seat Labour had finished in fourth place in 1918. He had then been elected as the MP for Hammersmith North at the 1923 general election, gaining the seat from the Conservatives by a majority of 845 votes in a three-way contest. He actually increased his vote share at the 1924 election, but with the Liberals not fielding a candidate, he lost to Ashmead-Bartlett by just under 2,000 votes in a two-way context."]}, {"page": "National Amalgamated Furnishing Trades Association", "response": [":1919: James Patrick Gardner"]}]}}