{"wiki_id": "http://www.wikidata.org/entity/Q6141049", "itemLabel": "James Pattison Cockburn", "itemDescription": "British Army general and artist (1779-1847)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Pattison_Cockburn", "wikipedia_page": {"main": "James Pattison Cockburn (18 March 1779 – 18 March 1847) was an artist, author and military officer. He was born into a military family and received his military training at the Royal Military Academy, Woolwich where he received training in drawing which was related to the skills required for topography.", "link_mentions": [{"page": "Cockburn (surname)", "response": ["*James Pattison Cockburn (1779–1847), British artillery officer and important painter of watercolors in Upper and Lower Canada"]}, {"page": "Musée national des beaux-arts du Québec", "response": ["File:James Pattison Cockburn - Le Cône de glace de la chute Montmorency.jpg|James Pattison Cockburn, The Ice Cone at Montmorency Falls. c. 1830."]}, {"page": "James Cockburn", "response": ["*James Pattison Cockburn (1779–1847), artist, author and military officer"]}, {"page": "Edward Thomas Daniell", "response": ["The route Daniell took during his eighteen months on the Continent is revealed by the order of his paintings. His travels through Switzerland are reminiscent of those of the artist James Pattison Cockburn, who published his Swiss Scenery in 1820. In Rome and Naples he met the artist Thomas Uwins, who wrote: \"What a shoal of amateur artists we have got here!... there is a  too come to judgement!  second Daniel!, I have gotten more substantial criticism from this young man than from anyone since Havell was my messmate.\""]}, {"page": "Rodwell & Martin", "response": ["The firm's output included Swiss Scenery by James Pattison Cockburn (1820),Swiss Scenery James Pattison Cockburn, 1820. archive.org Retrieved 31 July 2015. Italian Scenery by Elizabeth Frances Batty (1820), Specimens of Ancient Decorations from Pompeii by John Goldicutt (1825),Specimens of Ancient Decorations from Pompeii John Goldicutt, 1825. archive.org Retrieved 31 July 2015. and similar works."]}, {"page": "John Thirtle", "response": ["By 1824 Thirtle was taking on pupils: he was employed by Thomas Blofield to instruct his daughter Mary Catherine and he also taught James Pattison Cockburn. Thirtle's mother died in 1823; an inheritance from his father, who died in 1825, may have given him some financial security for the remainder of his life, as 1825 is the first year in which he is known to have independently owned property."]}, {"page": "James Pattison", "response": ["* James Pattison Cockburn (1779–1847), British author and artist"]}, {"page": "General Cockburn", "response": ["*James Pattison Cockburn (1779–1847), British Army major general"]}]}}