{"wiki_id": "http://www.wikidata.org/entity/Q6153154", "itemLabel": "Janet Amsden", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Janet_Amsden", "wikipedia_page": {"main": "Janet Amsden is a British actress who appeared in EastEnders as Margaret Wilson and was in Family Affairs, playing Marie Taylor.\nShe trained under Yat Malmgren at Drama Centre, and is one of the few practitioners currently working to share his methods. She is also an acting tutor and director, Ray Fearon being one of her students. She teaches and directs at ALRA. Since 2013 she has taught this method, Movement Psychology, at the Giles Foreman Centre for Acting in London, and also for GFCA in Paris and in New York.", "link_mentions": [{"page": "Sonia Fowler", "response": ["Sonia eventually forgives Martin and as they grow closer, they fall in love and eventually elope. Sonia begins nursing training and she and Martin live with Pauline but struggle to cope with her interference. Martin gets unwittingly involved with a stalker, Sarah Cairns (Alison Pargeter), who tries to ruin his marriage. This culminates in Sarah holding Sonia and Martin hostage and stabbing Martin, until Sonia knocks her unconscious. Sonia and Martin face further upset when they discover that their daughter's adoptive parents have died in a car crash. They visit Rebecca's (Jade Sharif) guardian, Margaret Wilson (Janet Amsden), hiding their true identity but when Margaret realises who they are, she asks them to leave. Pauline also interferes and visits Rebecca with Martin. Sonia is furious when she learns this and animosity in the Fowlers' home puts a strain on Martin and Sonia's relationship so she spends her time with a colleague, Naomi Julien (Petra Letang); feelings develop and they begin an affair. Martin is heartbroken when his marriage ends and the situation is complicated further by Rebecca, who, on Margaret's request, is spending more time at the Fowlers'. Margaret decides to make the Fowlers' Rebecca's legal guardians but does not include Sonia when she finds out about her lesbian fling. Margaret dies and Martin takes custody of Rebecca and Pauline tries to stop Sonia having any contact with Rebecca. This makes Sonia distraught and preoccupied with Rebecca. Feeling neglected, Naomi ends their relationship."]}, {"page": "Naomi Julien", "response": ["After a while, Sonia and Naomi argue about Sonia and Martin's ongoing battle to become their biological daughter Rebecca's (Jade Sharif) legal guardians in case of her adopted grandmother Margaret Wilson's (Janet Amsden) death. Sonia prioritises Rebecca over Naomi, so Naomi throws Sonia out and they split up. Naomi joins Dr. May Wright (Amanda Drew) working at Albert Square's surgery, and plans to buy a house with Garry and Minty. She is accepted for a job at the local children's hospital. When she discovers that May is taking pills prescribed to Manju Patel (Leena Dhingra), Naomi agrees to keep quiet but May does not believe her so plants the pills on Naomi and blames her for taking them. May tells Naomi if she does not leave Walford she will make a phone call to ruin the career for which she has been preparing for three years. Naomi pulls out of the sale of the flat and leaves even though Garry, Minty and Dawn Swann (Kara Tointon) try to get her to bring May down."]}, {"page": "List of former EastEnders characters", "response": ["|Margaret Wilson || Janet Amsden || 2005–2006"]}, {"page": "List of EastEnders characters (2005)", "response": ["Margaret Wilson, played by Janet Amsden, is the adoptive grandmother of Sonia (Natalie Cassidy) and Martin Fowler's (James Alexandrou) daughter, Rebecca Miller, and mother of Rebecca's adoptive mother, Sue Miller (Sadie Shimmin/Victoria Willing). When Sue, along with her husband Neil (Robin Sneller) were killed in a car crash in 2005 Margaret became the parental guardian of Rebecca."]}, {"page": "List of The Tomorrow People serials", "response": ["| colspan=\"5\" | Guest Cast: Jean Marsh (Eliza Jeffries / Doctor Culex), Connie Booth (Doctor Lucy Connor), Denise Coffey (Aunt Ruth Tanner), Roger Sloman (Inspector Platt), Adam Blackwood (Doctor Poole), Sally Sagoe (Mrs Jackson), Deborah Vale and Tessa Vale (The Twins), Jeff Harding (General Damon), Bazil Otoin (Jim), Richard Rees (Doctor Leong), Janet Amsden (Commander Scott), Nicky Twining (Richie Conrad) "]}, {"page": "Greek (play)", "response": ["* Mum, Sphinx & Waitress 2 - Janet Amsden", "The production transferred in September 1980 to the Arts Theatre Club, with Deirdre Morris replacing Janet Amsden."]}, {"page": "The Thirteenth Tale (film)", "response": ["* Janet Amsden as the Missus, housekeeper at the Angelfield estate"]}, {"page": "List of EastEnders characters (2000)", "response": ["In 2005, Neil and Sue are killed in a car crash and Rebecca moves in with Sue's mother, Margaret Wilson (Janet Amsden). Sonia reads about the crash in the newspaper and she and Martin, who are now married, are concerned for their daughter and decide to track her down to make sure she is well. Posing as friends of the Millers, Margaret allows the Fowlers into their home where they meet Rebecca (now Sharif). It is only when they admit who they really are that she tells them to leave. Pauline Fowler (Wendy Richard), Martin's mother, demands to be part of Rebecca's life, causing upset. Sonia is furious when she discovers Pauline and Martin have been seeing her daughter behind her back. Eventually Sonia gives into her urges and grows closer to Rebecca too. Margaret decides to make Sonia and Martin Rebecca's legal guardians in case anything happens to her, unaware that Sonia and Martin have separated due to Sonia's lesbian adultery. Sonia persuades Martin not to tell Margaret that they have split up, but when the truth comes out, Margaret is furious and refuses to give Sonia guardianship of Rebecca. When Margaret has a fall and dies, Rebecca is given to Martin and Pauline refuses Sonia access, causing many rows."]}, {"page": "Amsden", "response": ["*Janet Amsden, British actress"]}]}}