{"wiki_id": "http://www.wikidata.org/entity/Q61582442", "itemLabel": "George Lauder", "itemDescription": "Scottish politician", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Lauder_Sr.", "wikipedia_page": {"main": "George Lauder Sr. (May 9, 1815 – November 18, 1901) was a political leader in Scotland who was the father of Scottish industrialist George Lauder and surrogate father to his nephew Andrew Carnegie. He was the also the progenitor of the Lauder Greenway Family. Lauder Sr. has been described as Carnegie's \"intellectual father.\" Lauder was consistently credited by Carnegie throughout his lifetime, saying in his 1920 autobiography: \"...a man whose influence on me cannot be underestimated, my Uncle Lauder.\"", "link_mentions": [{"page": "Andrew Carnegie", "response": ["Carnegie's maternal uncle, Scottish political leader George Lauder, Sr., deeply influenced him as a boy by introducing him to Robert Burns' writings and historical Scottish heroes such as Robert the Bruce, William Wallace, and Rob Roy. Lauder's son, also named George Lauder, grew up with Carnegie and became his business partner. When Carnegie was 12, his father had fallen on very hard times as a handloom weaver; making matters worse, the country was in starvation. His mother helped support the family by assisting her brother and by selling potted meats at her \"sweetie shop\", leaving her as the primary breadwinner. Struggling to make ends meet, the Carnegies then decided to borrow money from George Lauder, Sr. and move to Allegheny, Pennsylvania, in the United States in 1848 for the prospect of a better life.MacKay, pp. 37–38. Carnegie's migration to America would be his second journey outside Dunfermline – the first being an outing to Edinburgh to see Queen Victoria.", "*Lauder College (named after his uncle George Lauder Sr.) in the Halbeath area of Dunfermline was renamed Carnegie College in 2007."]}, {"page": "George Lauder (disambiguation)", "response": ["George Lauder (died 1466) was a medieval Scottish bishop.", "George Lauder may also refer to:", "*George Lauder of the Bass (died 1611), Scottish Member of Parliament", "*George Lauder (surgeon) (1712–1752), Scottish surgeon", "*George Lauder Sr. (1815–1901), Scottish political leader ", "*George Lauder (Scottish industrialist) (1837–1924), partner in the  Carnegie Steel Company"]}, {"page": "Lauder (surname)", "response": ["*George Lauder Sr. (1815–1901), leader of the Chartism movement in Scotland, progenitor of the Lauder Greenway family", "*George Lauder (Scottish industrialist) (son) (1837–1924), Scottish billionaire industrialist, partner in the Carnegie Steel Company", "*George Lauder (died 1466), medieval Scottish bishop", "*George Lauder of the Bass (died 1611), Scottish administrator", "* George Lauder (disambiguation)"]}, {"page": "Lauder Greenway family", "response": ["The Lauder Greenway family is a Scottish-American family whose influence on, and involvement in, American political and economic affairs dates from the 1640s through the contemporary era. Their primary contributions have been in the sciences, government, and intelligence. The most notable members are George Lauder and his \"cousin-brother\" Andrew Carnegie. They co-created the Carnegie Steel Corporation, the forerunner to U.S. Steel, and subsequently became two of the richest men in the world.", "George Lauder Sr. was a 19th century Scottish businessman and political radical in Dunfermline who raised and educated George Lauder and Andrew Carnegie. After the two younger men moved to the United States, Lauder married Anna Maria Romeyn Varick, a patrician Old Dutch New Yorker. She was a direct descendant of many prominent New Yorkers of history including Joris Jansen Rapelje a founder of the colony of New Amsterdam in 1624 who was a member of the Council of Twelve Men, the first democratic body in the history of the United States (1641). Also, Colonel Richard Varick, a Founding Father who was private secretary to George Washington would be the first mayor of New York City after independence from 1789–1800.", "George and Anna Lauder had three children, including George Lauder III, Elizabeth Storm Lauder, and Harriet Lauder. Harriet married Dr. James C. Greenway in 1903 connecting the two families. Dr. Greenway was descendant from several prominent generations of Americans since the Revolutionary War including two signers of the Fincastle Resolutions (General Evan Shelby and General William Campbell) and Governor Issac Shelby, the first Governor of the state of Kentucky. His great-grandfather was Dr. Ephraim McDowell the pioneer surgeon who was the first person to successfully remove an ovarian tumor. He has been called \"the father of ovariotomy\"Ira M. Rutkow (1988). The History of Surgery in the United States, 1775–1900, Volume 2. Norman Publishing, p. 90  as well as founding father of abdominal surgery.Leslie Thomas Morton, Robert J. Moore, 2005, A Bibliography of Medical and Biomedical Biography. Ashgate,. p. 238James Ramage, Andrea S. Watkins (2011). Kentucky Rising: Democracy, Slavery, and Culture from the Early Republic to the Civil War. University Press of Kentucky", "The Lauder Greenway family made an enormous impact on the Industrial Revolution in their contributions to metals, mining, and mechanical engineering industries which is the source of their modern wealth. George Lauder was a mechanical engineer who studied under Lord Kelvin and lead the scientific arm of the Carnegie Steel Corporation. He was the second largest shareholder of the company, behind Andrew Carnegie when they sold Carnegie Steel to J.P. Morgan and created U.S. Steel which Lauder sat on the board of. This was the first corporation in the world with a market capitalization exceeding US$1 billion ($ billion today).", "*George Lauder Sr. (1815–1901), Leader of Chartism in Scottish politics", "*George Lauder (1837–1924), billionaire industrialist, Mechanical engineer, partner in Carnegie Steel Corporation, director of U.S. Steel", "*George Lauder Jr. (1878–1916), philanthropist and yachtsman whose schooner, the Endymion, held the record for fastest transatlantic crossing."]}, {"page": "George Lauder, Sr.", "response": ["#REDIRECT George Lauder Sr."]}]}}