{"wiki_id": "http://www.wikidata.org/entity/Q6151187", "itemLabel": "Jane Bown", "itemDescription": "British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_Bown", "wikipedia_page": {"main": "Jane Hope Bown CBE (13 March 1925 – 21 December 2014) was an English photographer who worked for The Observer newspaper from 1949. Her portraits, primarily photographed in black and white and using available light, received widespread critical acclaim and her work has been described by Lord Snowdon as \"a kind of English Cartier-Bresson.\"", "link_mentions": [{"page": "List of photographers", "response": ["* Jane Bown (1925–2014)"]}, {"page": "The Observer", "response": ["* Jane Bown (resident from 1949 until her death in 2014)", "* Jane Bown (2015), A Lifetime of Looking, Faber & Faber Ltd.. Contains the most iconic photos she took for The Observer from 1949 to the last photo she took a few months before her death in December 2014.  Photos include The Beatles, Mick Jagger, the Queen, John Betjeman and Bjork."]}, {"page": "1925 in art", "response": ["* 13 March – Jane Bown, English portrait photographer (d. 2014)."]}, {"page": "List of photojournalists", "response": ["* Jane Bown (1925–2014)"]}, {"page": "Guildford School of Art", "response": ["The school had once enjoyed a reputation as a major centre of photographic excellence under the Head of Photography, Ifor Thomas. Among his students were Jane Bown, John Hedgecoe, John Cleare, and Ray Dean. Staff included Thurston Hopkins. ", "* Jane Bownhttp://arts.guardian.co.uk/art/photography/story/0,,2173276,00.html"]}, {"page": "Olympus OM-1", "response": ["Professional photographers who used the OM-1 include Patrick Lichfield, Jane Bown, David Bailey, Josef Koudelka, Chris Bonington, and Kate Garner."]}, {"page": "Jill Furmanovsky", "response": ["Furmanovsky has received several awards for her music photography--including 'The Jane Bown Observer Portrait Award' for her portrait of Charlie Watts in 1992. Following in the lead of the photographic co-operative Magnum Photos. Furmanovsky established a website--rockarchive.com in 1998. Its aim was to make her work and those of her photographic colleagues more accessible to fans and collectors. To launch the project she selected 30 classic black and white images of major rock artists from her 30-year archive to  make into an edition of 30 darkroom prints."]}, {"page": "Björk (book)", "response": ["* Jane Bown"]}, {"page": "Bown", "response": ["* Jane Bown (born 1925), British photographer"]}, {"page": "The Midland Group", "response": ["*1985\tThe Miner's World—Miners in Photography and Literature, Edith Tudor-Hart, Edwin Smith, Bruce Davidson, Dennis Thorpe, Jane Bown, John Davies, Raissa Page, John Sturrock, Brenda Price, Ian Berry, Humphrey Spender, David Hurn, John Harris, Bill Brandt. Shown in Nottingham then toured during 1985 and 1986. Funded by Arts Council England."]}, {"page": "Martin Moss (businessman)", "response": ["Martin Grenville Moss, CBE, (1923–2007) was managing director of now-demolished Knightsbridge department store Woollands for twelve years, turning Knightsbridge into a fashionable shopping location. Moss was educated at Lancing College, Sussex, and served during the Second World War as a fighter pilot. After the war, Moss married the photographer Jane Bown CBE and was promoted to managing director of Woollands in 1954. He is credited with reviving the store's fortunes. He was hailed for his achievements as \"London's one-man wave of fashion\" by the New York magazine Women's Wear Daily."]}, {"page": "Janette Beckman", "response": ["Here We Are is Burberry's exhibition of British social and documentary photography, featuring Beckman, Bill Brandt, Shirley Baker, Jane Bown, Martin Parr, and others, which opened in Clerkenwell in September 2017. Worn in New York: 68 Sartorial Memoirs of the City, a book by Emily Spivack (Abrams Books, 2017), had \"clothing-inspired narratives\" and included Beckman's Def Jam jacket."]}, {"page": "Culture of Dorset", "response": ["Dorset is a popular home for performing artists. Those who have moved to or own second homes in Dorset include the director Guy Ritchie, actors Martin Clunes and Edward Fox; singer-songwriters Billy Bragg and Noel Gallagher; and television personalities Jonathan Ross and Hugh Fearnley-Whittingstall, whose programmes are filmed at his home, just outside Bridport. The classical composer Muzio Clementi lived and worked near Blandford in Dorset. Several writers have called Dorset home, including Douglas Adams (author of The Hitchhiker's Guide to the Galaxy), who lived in Stalbridge for a time; Ian Fleming (James Bond), who boarded at Durnford School, poet William Barnes; John le Carré, author of espionage novels; Tom Sharpe of Wilt fame lived there as does P.D. James (The Children of Men); satirical novelist Thomas Love Peacock; John Fowles (The French Lieutenant's Woman), lived in Lyme Regis before he died in late 2005;Blamires p.88. Robert Louis Stevenson wrote The Strange Case of Dr Jekyll and Mr Hyde while living in Bournemouth. Dorset is also the birthplace of artist Sir James Thornhill, and photographer Jane Bown,"]}, {"page": "2014 in art", "response": ["* December 21 - Jane Bown, 89, English portrait photographer"]}, {"page": "2014 in the United Kingdom", "response": ["**Jane Bown, 89, photographer (The Observer)."]}, {"page": "Deaths in December 2014", "response": ["*Jane Bown, 89, British photographer (The Observer).Observer newspaper photographer Jane Bown dies aged 89"]}, {"page": "Chris Harrison (photographer)", "response": ["* How we are: Photographing Britain from the 1840s to the Present. curated by Susan Bright & Val Williams. Works by, (Selection) William Henry Fox Talbot, Julia Margaret Cameron, Roger Fenton, Robert Howlett, Alvin Langdon Coburn, Cecil Beaton, Bill Brandt, Bert Hardy, Madame Yevonde, David Bailey, David Hurn, Roger Mayne, Tony Ray Jones, Jane Bown, John Davies, Anna Fox, Paul Graham, Chris Killip, Daniel Meadows, Martin Parr, Paul Reas, Paul Seawright, Homer Sykes, Tom Wood, Jason Evans, Chris Harrison, Tom Hunter, Simon Norfolk, Sarah Pickering, Nigel Shafran, Jem Southam, Clare Strand. Tate Britain, London, England. 2007.   "]}, {"page": "Lucie Awards", "response": ["*Jane Bown – 2014 Lifetime Achievement"]}, {"page": "Peter Mitchell (photographer)", "response": ["*How We Are: Photographing Britain, Tate Britain, London, 2007. With Mitchell, Keith Arnatt, Nicholas Battye, Jane Bown, Vanley Burke, Stephen Dalton, John Davies, Anna Fox, Paul Graham, Nancy Hellebrand, Chris Killip, Daniel Meadows, Horace Ové, Martin Parr, Martin Pover, Paul Reas, Derek Ridgers, Paul Seawright, Chris Steele-Perkins, Homer Sykes, Paul Trevor, and Tom Wood."]}, {"page": "List of British women photographers", "response": ["* Jane Bown (1925–2014), portrait photographer, also worked for The Observer"]}, {"page": "John Gale (British journalist)", "response": ["After serving in the army he returned to London and became a successful journalist, working for The Observer during the 1950s and 1960s. He worked closely with the photographer Jane Bown."]}, {"page": "Julia Hedgecoe", "response": ["Julia Mardon (hereinafter Hedgecoe) trained at the Guildford School of Art where the head of the photography department was Ifor Thomas whose students included Jane Bown and John Hedgecoe."]}]}}