{"wiki_id": "http://www.wikidata.org/entity/Q615124", "itemLabel": "Charlie McDonnell", "itemDescription": "British vlogger", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_McDonnell", "wikipedia_page": {"main": "Charles Joseph McDonnell (born 1 October 1990) is a British filmmaker, screenwriter, musician, former vlogger and author from Bath, Somerset. On 15 June 2011, his YouTube channel charlieissocoollike became the first in the UK to reach one million subscribers.\nAs a musician, McDonnell was a member of Doctor Who-themed rock band Chameleon Circuit and was also a member of the short-lived project Sons of Admirals until it was disbanded in May 2011. In 2010, McDonnell released a solo album titled This Is Me. McDonnell directed a series of short films from 2013 to 2014, and co-hosted the weekday morning YouTube breakfast show Cereal Time with Capital FM presenter and fellow YouTube vlogger Jimmy Hill from 2015 to 2016. In 2016, he published a book, Fun Science.After over a decade of regular uploads, McDonnell ended his YouTube career in December 2018 and moved on to screenwriting and television production duties. His first series, the science fiction drama Don't Look Deeper, was released on the streaming platform Quibi in July 2020.\n\n", "link_mentions": [{"page": "List of comedians", "response": ["* Charlie McDonnell (born 1990)"]}, {"page": "1990 in music", "response": ["*October 1 – Charlie McDonnell, English singer-songwriter and guitarist (Chameleon Circuit)"]}, {"page": "List of singer-songwriters", "response": ["*Charlie McDonnell"]}, {"page": "Ben Folds", "response": ["Folds' final solo album before his reunion with Ben Folds Five, a collaboration with English author Nick Hornby, was entitled Lonely Avenue and was released on September 28, 2010. On June 14, 2010, Folds released the official album art via his Twitter account. \"From Above\", the first single from the album, premiered on Richard Kingsmill's new music show 2010 on Triple J in Australia on July 18, 2010. \"From Above\" features Australian singer Kate Miller Heidke on backing vocals. Folds also recorded a video song with Nick Hornby and Pomplamoose. As well, English YouTuber Charlie McDonnell was commissioned to create the music video for Folds' song \"Saskia Hamilton\", which was uploaded on October 1, 2010."]}, {"page": "Derren Brown", "response": ["Brown co-presented two web-based series for Channel 4; The Science of Scams and The Science of Attraction. In The Science of Scams, a number of videos were placed on YouTube purporting to show various kinds of paranormal phenomena such as ghosts, telekinesis and a tarot card reading. In a second series of videos, Brown and his co-presenter Kat Akingbade explained what was actually happening, exposing each as a specially created scam. The Science of Attraction was co-presented by Brown, Akingbade and Charlie McDonnell. The shows examined the physical and psychological factors that can influence our feelings of attraction to other people, especially those of the opposite sex. The series featured a number of experiments designed to show how these factors can be influenced."]}, {"page": "Combe Down", "response": ["Charlie McDonnell, once the most subscribed YouTube vlogger in the United Kingdom, grew up in Combe Down before moving to London in 2010."]}, {"page": "Beechen Cliff School", "response": ["* Charlie McDonnell, musician and vlogger"]}, {"page": "1990 in the United Kingdom", "response": ["* 1 October – Charlie McDonnell, YouTube personality"]}, {"page": "MacDonnell (surname)", "response": ["* Charlie McDonnell British musician and YouTube personality (charlieissocoollike)"]}, {"page": "List of people from Bath", "response": ["*Charlie McDonnell (born 1990) – YouTube star as \"Charlieissocoollike\""]}, {"page": "Blink (Doctor Who)", "response": ["British \"Timelord rock\" band Chameleon Circuit, composed of YouTube bloggers Alex Day and Charlie McDonnell among others, wrote a song about the episode, also entitled \"Blink\", and released it on their debut eponymous album."]}, {"page": "List of YouTubers", "response": ["! scope=\"row\"| Charlie McDonnell"]}, {"page": "Charlieissocoollike", "response": ["#REDIRECT Charlie McDonnell"]}, {"page": "Charlie Mcdonnell", "response": ["#REDIRECT Charlie McDonnell "]}]}}