{"wiki_id": "http://www.wikidata.org/entity/Q6152540", "itemLabel": "Jane McAdam Freud", "itemDescription": "English artist (born 1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_McAdam_Freud", "wikipedia_page": {"main": "Jane McAdam Freud MA(RCA) FRBS (born 24 February 1958) is a British conceptual sculptor working in Installation art and digital media. She was the winner of the 2014 European Trebbia Awards for artistic achievement.", "link_mentions": [{"page": "Plasticine", "response": ["Television presenter James May together with Chris Collins, Jane McAdam Freud, Julian Fullalove and around 2000 members of the public created a show garden made entirely of Plasticine for the 2009 Chelsea Flower Show. Called 'Paradise in Plasticine', it took 6 weeks and 2.6 tons of Plasticine in 24 colours to complete. May said, \"This is, to our knowledge, the largest and most complex model of this type ever created.\" It couldn't be considered as part of the standard judging criteria as it contained no real plants, but was awarded an honorary gold award made from Plasticine. The garden was extremely popular with the public and went on to win the Royal Horticultural Society's 'peoples choice' for best small garden."]}, {"page": "William Harbutt", "response": ["The Paradise in Plasticine garden, a creation of journalist and presenter James May displayed at the 2009 Chelsea Flower Show included a bust of Harbutt sculpted by Jane McAdam Freud.Paradise in Plasticine"]}, {"page": "List of medallists", "response": ["*Jane McAdam Freud (born 1958)"]}, {"page": "Artparks Sculpture Park", "response": ["| Jane McAdam Freud"]}, {"page": "Freud family", "response": ["###Jane McAdam Freud (born 1958)"]}, {"page": "Template talk:Infobox artist/Archive 3", "response": ["I'm surprised there's no parameter for \"Parents\" or \"Children\", for Infobox creators to infill or leave blank according to relevance. Many artists are the offspring of equally famous artists. I think the additional parameter could be very useful, to help summarise important relationships at-a-glance. Note how, given no such optional parameters to use, the creator(s) of Hans Holbein the Younger had to use the \"Influenced by\" paramemeter to get his elder namesake in! Influenced by his dad, well well! Similarly Hans Holbein the Elder's Infobox says he \"influenced\" Hans Holbein the Younger and Ambrosius Holbein, although you have to read the full article to find they were his sons! Other families who could benefit from the extra Infobox parameter(s) are the Freuds (Lucien Freud and Jane McAdam Freud, the Nicholsons [[painters Sir William Nicholson and Mabel Pryde, with children including artist Ben Nicholson, artist Nancy Nicholson and architect Christopher Nicholson), the Berninis (Gian Lorenzo Bernini and author son Domenico Bernini), the Breugels (Pieter Bruegel the Elder and sons - their father apparently died too young to \"influence\" them, and thus that parameter if used would have to state their grandmother, artist Mayken Verhulst!). Artistic relatives are rarer than theatrical relatives, but they do exist! With no optional extra \"relatives\" parameters there's a potential for inconsistency, too. Take the Renoirs for example: Pierre-Auguste Renoir's \"artist\" Infobox has no \"children\" parameter and yet his children, filmmaker Jean Renoir and actor Pierre Renoir, have \"person\" Infoboxes that can include their \"father\" whenenever anyone desires to expand them from basic to full parameter boxes. Are artists' box \"parents/children\" paramemeters forbidden or deprecated, or are editors allowed the discretion of adding particular parents or children to the artist Infobox wherever it seems appropriate or useful? Pete Hobbs (talk) 19:11, 5 February 2013 (UTC)"]}, {"page": "List of alumni of the Central School of Art and Design", "response": ["* Jane McAdam Freud"]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Jane McAdam Freud"]}, {"page": "Jane Freud", "response": ["#REDIRECT Jane McAdam Freud"]}]}}