{"wiki_id": "http://www.wikidata.org/entity/Q6154279", "itemLabel": "Janice Long", "itemDescription": "British radio broadcaster and disc jockey", "wikipedia_url": "https://en.wikipedia.org/wiki/Janice_Long", "wikipedia_page": {"main": "Janice Berry (née Chegwin; 5 April 1955 – 25 December 2021), known professionally by her first married name Janice Long, was an English broadcaster who was best known for her work in British music radio. In a career that spanned five decades, she became the first woman (same as Annie Nightingale) to have her own daily music show on BBC Radio 1. She also appeared on other BBC Radio stations, such as BBC Radio 2, BBC Radio London, BBC Radio WM, and BBC Radio 6 Music, and was a regular presenter on the television chart show Top of the Pops.\nAt the end of her career, Long hosted four nights a week on BBC Radio Wales and Saturday afternoons on Greatest Hits Radio.", "link_mentions": [{"page": "BBC Radio 1", "response": ["At the start of 1981, Mike Read took over The Radio 1 Breakfast Show from Dave Lee Travis. Towards the end of the year, Steve Wright started the long-running Steve Wright in the Afternoon show. In 1982, the new Radio 1's Weekend Breakfast Show started, initially with Tony Blackburn supported by Maggie Philbin and Keith Chegwin. Adrian John and Pat Sharp also joined for the early weekend shows. Gary Davies and Janice Long also joined, hosting Saturday night late and evening shows respectively.", "In response to the growth in dance and rap music, Jeff Young joined in October 1987 with the Big Beat show. At the end of the year, Nicky Campbell, Mark Goodier, and Liz Kershaw all joined and Janice Long left."]}, {"page": "Craig Charles", "response": ["Charles realised he was using poetry as a vehicle for his sense of humour and progressed into stand-up comedy. He was part of the Red Wedge comedy tour in 1986, which aimed to raise awareness of the social problems of the time, in support of the Labour Party. He also performed his first one-man show in 1986,Raising the Roof for the Gateway Exchange, 29 August 1986, Edinburgh Festival Fringe which premiered in Edinburgh, and then toured internationally.The Glasgow Herald, 13 August 1987, Andrew Young The Fringe: Craig Charles Charles was a guest on programmes including Janice Long's Radio 1 show, and was a regular panellist on Ned Sherrin's chat show Loose Ends (1987–88) on BBC Radio 4.", "From January until November 2014, Charles also broadcast the Funk and Soul Show live on BBC Radio 2, immediately after his 6 Music show. He regularly sits in for Janice Long, Steve Wright and Jo Whiley, and has presented numerous programmes on the station, including The Craig Charles Soul All-Nighter (2011), which he hosted continuously for 12 hours, and the Beatleland (2012) documentary on The Beatles. Charles has also chosen music as a guest of other broadcasters such as Ken Bruce on Radio 2 and Liz Kershaw on 6 Music.  Charles covered for Graham Norton on Radio 2's Saturday mid-morning show during Norton's 10-week 2015 summer break."]}, {"page": "The Stranglers", "response": ["During an interview with Janice Long, on BBC Radio Wales, on 10 July 2018, Burnel revealed that Black continued to be in fairly poor health and had suffered a minor stroke earlier in 2018."]}, {"page": "Live Aid", "response": ["The concert was the most ambitious international satellite television venture that had ever been attempted at the time. In Europe, the TV feed was supplied by the BBC, whose broadcast was presented by Richard Skinner, Andy Kershaw, Mark Ellen, David Hepworth, Andy Batten-Foster, Steve Blacknell, Paul Gambaccini, Janice Long and Mike Smith and included numerous interviews and chats in between the various acts. The BBC's television sound feed was mono, as was all UK TV audio before NICAM was introduced, but the BBC Radio 1 feed was stereo and was simulcast in sync with the TV pictures. Unfortunately, in the rush to set up the transatlantic feeds, the sound feed from Philadelphia was sent to London via transatlantic cable, while the video feed was via satellite, which meant a lack of synchronisation on British television receivers. Due to the constant activities in both London and Philadelphia, the BBC producers omitted the reunion of Crosby, Stills, Nash & Young from their broadcast. The BBC, however, did supply a 'clean feed' to various television channels in Europe."]}, {"page": "Jonathan Ross", "response": ["Ross' first radio work was on BBC Radio 1 in 1987, when he sat in for Janice Long for two weeks. Ross began presenting a Saturday morning show on BBC Radio 2 in July 1999. He has also presented radio shows for Virgin Radio (having previously worked on Richard Branson's earlier venture, Radio Radio), as well as the now-defunct commercial radio network service The Superstation, where his producer was Chris Evans. Ross' show on Radio 2 last aired on 17 July 2010 when his contract at the BBC ended."]}, {"page": "Top of the Pops", "response": ["On 20 June 2006, the show was formally cancelled and it was announced that the last edition would be broadcast on 30 July 2006. Edith Bowman co-presented its hour-long swansong, along with Jimmy Savile (who was the main presenter on the first show), Reggie Yates, Mike Read, Pat Sharp, Sarah Cawood, Dave Lee Travis, Rufus Hound, Tony Blackburn and Janice Long."]}, {"page": "John Walters (broadcaster)", "response": ["Walters also produced Vivian Stanshall's first foray into radio, both by overseeing Stanshall's Rawlinson End Radio Flashes when Stanshall stood in for a vacationing John Peel, and Stanshall's Sir Henry at Rawlinson End. He presented the long-running Radio 1 arts magazine Walters' Weekly, as well as Loose Ends and Idle thoughts, and was heard reviewing the music papers on the Janice Long show in the 1980s. In the 1990s, he was a reporter on the BBC's current affairs magazine Here and Now."]}, {"page": "BBC Radio 6 Music", "response": ["The station opened at 7 am, Monday 11 March 2002, with a show presented by Phill Jupitus. At the start-up, presenters included Liz Kershaw, Andrew Collins, Tom Robinson, Gideon Coe, Janice Long, Chris Hawkins, Gary Burton, Craig Charles, Stuart Maconie, Brinsley Forde, Suggs, Clare McDonnell, Bruce Dickinson, Tracey MacLeod, Sean Hughes, and Bob Harris. The first record played was Ash's Burn Baby Burn"]}, {"page": "The Supernaturals", "response": ["Songwriter McColl went on to be guitarist in band The Hussys. In 2007 the band released \"We Expected\" an eight track album on Quince Records in Japan. The band's 2008 album \"Super Pro\" was recorded by Kevin Burleigh (Glasvegas, Supernaturals, Simple Minds) at the Byre Studio in Beauly. This was augmented by four songs and released as \"Super Pro +\" by Quince Records in Japan in 2009. The band's 2009 UK album \"Japanese Graffiti\" had a more 1980s sound. The band then recorded \"Tokyo Elephant Brothers\" in a camper van in 2010. The band's final album to date is \"Please Secure Your Valuables\" which was released in 2011. The band have played sessions on Rapal, Channel M and the Janice Long radio show."]}, {"page": "List of show business families", "response": ["*Keith Chegwin is the twin of Jeffrey Chegwin and brother of Janice Long"]}, {"page": "Keith Chegwin", "response": ["DJ Janice Long (1955–2021) was his older sister. He also had a twin brother, Jeff, with whom he attended stage school and whose son, Hugo Chegwin, co-created and starred in BBC Three mockumentary sitcom People Just Do Nothing. He regularly made public appearances around the UK and was involved in charity work."]}, {"page": "Orange Juice (band)", "response": ["Despite increasing exposure on TV and media, both of Orange Juice's 1982 singles failed to deliver the anticipated hit. However. the album Rip It Up issued in November 1982 was to spawn the eponymous single \"Rip It Up\", which reached number 8 on the UK Singles Chart in February 1983. Referencing both Chic and the Buzzcocks, the single cemented Orange Juice as one of the brightest bands in the so-called 'new pop' scene. The single was promoted through two memorable Top of the Pops performances, including one where bass player David McLymont appeared to fall into the crowd, apparently inebriated, gaining them a ban from the programme. DJ Janice Long championed the band, commissioning two further Radio One Sessions in March 1983 (neither commercially released, and assumed missing from the BBC archive), while magazines including Smash Hits continued to showcase the band (its editor Ian Cranna becoming the band's manager). However, the follow-up to Rip It Up, single \"Flesh of My Flesh\", narrowly failed to chart, peaking at number 41 in the Spring of 1983, and though the following six-track mini-album Texas Fever issued in March 1984 was critically feted, it too failed to spawn a hit with its only single Bridge."]}, {"page": "London 0 Hull 4", "response": ["# \"Anxious\" [BBC Janice Long session 6/11/85]", "# \"We're Not Deep\" [BBC Janice Long session 6/11/85]", "# \"Freedom\" [BBC Janice Long session 6/11/85]"]}, {"page": "Now That's What I Call Quite Good", "response": ["#\"Freedom\" – 3:27  Janice Long Session 6/11/85."]}, {"page": "BBC Radio London", "response": ["Chris Evans took on a variety of roles on GLR, often presenting a weekend show, ending in 1993 as his media career took off. Danny Baker has had a long association with the station, presenting Weekend Breakfast from 1989 to 1990 and then returned to present a Sunday morning show from 1996 to 1998. Janice Long presented the Breakfast show on the station from 1989 to 1991, and Kevin Greening started as a producer in 1989, before becoming a presenter of the Breakfast show with Jeremy Nicholas in 1991. Bob Harris also presented shows for the station from 1994 to 1998 after leaving BBC Radio 1. Early afternoon programming previewed London's varied entertainment scene, interviewing comedians and other performers.  Richard Cook had a Saturday night jazz show.", "*Janice Long"]}, {"page": "BBC Radio Merseyside", "response": ["*Janice Long (BBC Radio Wales / Greatest Hits Radio)"]}, {"page": "BBC Radio WM", "response": ["* Janice Long (2000–2010, died in 2021)"]}, {"page": "Andy Partridge", "response": ["During the mid-1980s, Partridge was a regular performer on BBC Radio 1. He has had acting roles, including a character named \"Agony Andy\", a spoof aunt on the Janice Long show, and he was a regular panelist on Roundtable. In 1987, he filmed a pilot for an ITV children's quiz show, Matchmakers. In 2004, he contributed the theme song to the Fox television series Wonderfalls."]}, {"page": "Sara Cox", "response": ["In June 2011, Cox began hosting the fourth series of the comedy programme Hot Gossip on BBC Radio 2, covering for Claudia Winkleman, who chose not to present the series as she was heavily pregnant at the time. in 2012, Cox has covered for Alex Lester, the late Janice Long, Ken Bruce, and Vanessa Feltz, as well as providing cover for Simon Mayo Drivetime and Steve Wright in the Afternoon."]}, {"page": "Bargain Hunt", "response": ["| Janice Long and Mike Read"]}, {"page": "Pebble Mill Studios", "response": ["Studio 6 was not equipped until about 1995 but was where Radio 2 Through the Night originated, presented by Janice Long, Alex Lester and Mo Dutta. The Mailbox has facilities intended to replicate the functionality of Studios 5 and 6, as well as the M3 & M4 editing facilities.", "Pebble Mill housed Radio West Midlands (Radio WM) but also produced programming for Radio 2, 3 and 4. Most of Radio 4's 1990s dramas came from Pebble Mill. Radio programming included over the years Woman’s Hour, The Ed Stewart Show on Sunday afternoons. The Richard Bacon Show, live Saturday and Sunday nights on Radio 5. Radio 2’s specialist popular music shows such as Best of Jazz, Paul Jones, Stuart Maconie’s Critical List and Radio 2's Through the Night, presented by Janice Long, Alex Lester and Mo Dutta. The world's longest running radio soap, The Archers, was produced in Studio 3."]}, {"page": "Talulah Gosh", "response": ["For their third single, the group returned to a song they had first recorded in session for Janice Long's show on Radio 1 in August 1986, \"Talulah Gosh\". Elizabeth Price left toward the end of the year to form The Carousel with Razorcuts frontman Gregory Webster, and so the single, released on 30 May 1987, was the first to feature replacement Eithne Farry (vocals, tambourine). The single was less shambolic than their earlier offerings, and a video was made for it which was played on The Chart Show (then shown on Channel 4), giving the band some mainstream exposure. The single was produced (some critics suggested it was over-produced) by John Rivers, as was the follow-up \"Bringing Up Baby\", a sophisticated pop song that reduced the band's \"shambling\" element to the point where mainstream success seemed a possibility. Indeed, The Primitives would later take precisely this route to success – but Talulah Gosh never made the national chart. The ironically-titled debut (compilation) album Rock Legends: Volume 69 was released in October 1987, collecting tracks from the earlier singles and radio sessions."]}, {"page": "Matthew Bannister", "response": ["Bannister first established himself as a name in the radio industry in the late 1980s and early 1990s as Managing Editor of GLR (Greater London Radio), the BBC's local radio station for London. Here he worked for the first time with Chris Evans, who was pioneering many of the ideas which would later win him greater success and much controversy at Radio 1, and also employed a number of the more musically credible DJs from Radio 1's past, such as Annie Nightingale, Tommy Vance, Janice Long and Johnnie Walker. The line-up also included Danny Baker, Emma Freud and Chris Morris."]}, {"page": "Pop Will Eat Itself", "response": ["In 1986, the band released the \"Poppies Say Grrr!\" single, which became Single of the Week in the NME and playlisted by Janice Long on BBC Radio 1. The single was sold in a brown paper bag and was made available for sale at Martin Newsagents in Stourbridge High Street as well as from the home of one of the band."]}, {"page": "Liz Kershaw", "response": ["In 1986 her day job with British Telecom saw her move to London to set up \"Livewire\" a dial-in pop service which superseded Dial-a-Disc. In running this she produced Radio 1 DJs Mike Smith, Janice Long and Dave Pearce before devising her own show for Radio 1 in 1987, Backchat, which won several awards."]}, {"page": "Rainford", "response": ["*Janice Long, BBC Radio 2 presenter"]}, {"page": "Capital Liverpool", "response": ["The station was launched by Janice Long and Bernie Connor as Liverpool's answer to XFM, with the idea for an alternative music radio station being thought up by the pair at Keith’s Wine Bar on Lark Lane in 1994. Crash FM acquired a Restricted Service Licence (RSL) to broadcast for a month from 5 November 1995, with the studios at Mabel Fletcher College on Greenbank, seeing presenters such as Inspiral Carpets member Clint Boon take to the airwaves.", "* Janice Long"]}, {"page": "3-2-1", "response": ["The DJ Janice Long appeared as a contestant on the very first episode with her then husband, Trevor, in July 1978", "3–2–1 become notorious for the unconventional prizes it awarded to winners. For instance, couples only won a brand new metal dustbin if the final clue revealed was \"Dusty Bin\". A pet dog was also awarded (Episode 1 featured a St. Bernard and a year's supply of brandy. This was rejected by Janice Long and her then husband Trevor. Other less extravagant prizes have included: a sofa that turns into a pool table, gold nuggets, a share in a racehorse, a family set of folding bicycles, a year's supply of fish, and matching 'his and hers' sheepskin coats."]}, {"page": "Jackie Brambles", "response": ["She joined Capital London in 1987 as its youngest DJ, and after a year on the evening show joined the BBC in 1988 as the first female presenter (same as Annie Nightingale & the late Janice Long) to get her own prime time show on the national pop network BBC Radio 1. She took on the Radio 1's early morning show, first at weekends, before moving to weekdays. She also joined her colleagues on the Top of the Pops presentation roster. When Sybil Ruscoe left her role as Simon Mayo's weather and travel reporter on the breakfast show, Brambles took over that slot, thereby keeping her on air every day over two separate programmes. On her own shows she sometimes worked standing up to maintain a more \"live\" feel, claiming she found it difficult to keep her demeanour lively enough if she was seated. The combination with Mayo worked quite well until a minor revamp in 1990 saw Brambles progress to a 90-minute drivetime show and then, to the important lunchtime slot when Gary Davies went to weekends. "]}, {"page": "Liverpool Institute for Performing Arts", "response": ["*2014: Don Black; Samuel West; Adrian Jackson; Nick Starr; Colin Richmond; Patrick Woodroffe; Briony Albert; Giles Martin. Janice Long and Suzahn Fiering were presented as Honoured Friends."]}, {"page": "Echobelly", "response": ["The most prominent part of Echobelly's success formula was vocalist Sonya Madan, who was also the group's lyricist. Born in Delhi, India, before moving to England at the age of two, Madan had an unusual background for a pop star. Her upbringing made rock music an unusual choice for her as a youngster and she did not attend her first rock concert until she was in college. In 1990 she met Glenn Johansson, a guitarist from Sweden. In a radio interview with Janice Long, on BBC Radio Wales, in December 2017, she admitted that her parents had initially found it hard to accept her choice of career."]}, {"page": "James Moir (executive)", "response": ["Having been BBC Head of Light Entertainment from 1987–1993, he was appointed Controller of BBC Radio 2 in 1995 and took up his post in 1996. Many assumed this would be a quiet end to his career but he turned the station from a declining backwater to the most popular in the UK, winning back many former Radio 1 listeners who had defected to commercial radio. This was achieved through broadcasters like Steve Wright, Johnnie Walker, Janice Long, Paul Gambaccini, Lynn Parsons, Bob Harris and Alan Freeman, all of whom joined Radio 2 during Moir's controllership."]}, {"page": "BBC Radio Wales", "response": ["*Janice Long"]}, {"page": "Nerina Pallot", "response": ["Pallot met fellow Jersey resident and Grammy Award-nominated record producer Andy Chatterley in January 2007. They became engaged within the first half-hour of their first date, and married six weeks later on 14 February 2007. The story was told by Pallot on Janice Long's BBC Radio 2 show on 3 June 2009. In 2009 she completed her degree in English Literature at Birkbeck, University of London. The couple reside in London.Nerina Pallot Blog  MySpace"]}, {"page": "List of people from Merseyside", "response": ["* Keith Chegwin (\"Cheggers\"): Television presenter. Brother of Janice Long.", "* Janice Long: Influential Radio 1 DJ of the 1980s. Sister of Keith Chegwin."]}, {"page": "BMX Bandits (band)", "response": ["The band signed to 53rd & 3rd and released their first single during the first half of 1986; \"E102\" / \"Sad?\". Both songs were written by Stewart with Sean Dickson, who played guitar and keyboards on the recording alongside his Soup Dragons bandmate Jim McCullough. The band's cheerful and playful sound, inspired by 1960s pop music along with Duglas T. Stewart's sense of humour was unusual in rock music at the time and caused mixed responses. However, Radio 1 DJ Janice Long was an early supporter of the group; regularly playing their single and asking them to record a session for her show. They followed up \"E102\" that same year with a cover of \"What a Wonderful World\", backed with \"The Day Before Tomorrow\", which has since become a staple of their live sets. By the end of the year, Dickson left to focus on The Soup Dragons. During the following year, Norman Blake and Joe McAlinden became more involved, with Blake contributing guitar, keyboards and songwriting and McAlinden primarily playing bass and violin. In 1988, the band released another 4-song EP and made a television appearance on the BBC Scotland music show Full Scale Deflection on the same episode as Primal Scream. Their set included a cover of the Beastie Boys song \"(You Gotta) Fight for Your Right (To Party!)\" and Norman Blake dressed up as an old man with a false moustache."]}, {"page": "Terry Christian", "response": ["Christian managed a twelve-piece reggae band from the Derby/Nottingham area, Junior C Reaction, who received airplay on John Peel and Janice Long's shows on BBC Radio 1 for their first independent release on Centurion Records, a double A Side, \"Cry Jahoviah\", and \"Love & Emotion\". They were signed to Cooltempo, a Chrysalis subsidiary, and enjoyed a modicum of success with their first release, a version of the Delroy Wilson classic \"Better Must Come\", which was C-listed on Radio 1 and Capital Radio at the time, as well as playing a live session on Radio One's Saturday Live. Christian also promoted concerts around the Derby and Nottingham area, and regular house nights at Derby's Twentieth Century club, where the resident Saturday-night DJ was Graeme Park."]}, {"page": "Alex Lester", "response": ["The programme was broadcast from 4am until 6:30am until December 1992, and from 3am to 5am during 1993. For 16 years, starting in January 1994, the programme began at 3am and finished at 6am, until it was rescheduled in 2010 after changes to the Radio 2 morning schedule. It was then broadcast from 2am to 5am every weekday. With the introduction of After Midnight on Radio 2 in October 2014, the show was broadcast from 12am to 3am from Fridays to Sundays. Alex shared the After Midnight slot with Janice Long, with Long presenting Monday - Thursday and Lester Friday, Saturday and Sunday. The show was cancelled in January 2017 due to Radio 2 cutting costs.", "From 10 February 2020, Alex started presenting the weekday overnight show on Greatest Hits Radio networks across England and Scotland from 1am until 6am, and from September 2020, his shows were (initially the last hour only) also heard on Greatest Hits South Wales. He also presents the Weekend Anthems show on a Saturday afternoon from 4pm.https://planetradio.co.uk/greatest-hits/shows/Weekend-Anthems/ From 8 June 2020, he permanently moved to the late night show 10pm-1am. From 3 January 2021, Alex moved back to 1am-6am, and from 8 January 2022 Alex replaced the late Janice Long on Saturday afternoons 1pm-4pm "]}, {"page": "Clint Boon", "response": ["In 1995, Boon began working for Liverpool's Crash FM after being recruited by DJ Janice Long and has also stood in for DJ Terry Christian on Century FM in Manchester."]}, {"page": "Amsterdam (band)", "response": ["Amsterdam were formed on Merseyside in 1999, and the following year won an NME competition to find the best unsigned band of 2000. They were also among the winners at the prestigious music business event In the City. Amsterdam appeared on an EMI compilation album, Mersey Boys and Liverpool Girls, alongside Paul McCartney and other Liverpool musicians. They performed sell out shows in Liverpool and London to critical acclaim, and played three tracks on Janice Long's BBC Radio 2 show."]}, {"page": "Steve Jones (Welsh presenter)", "response": ["In February 2009, Jones made his BBC One debut hosting Let's Dance for Comic Relief with Claudia Winkleman, who was later replaced with Alex Jones. In early 2009, he presented Sky1's Guinness World Records Smashed with Konnie Huq. The same year, Jones began presenting the BBC TV quizshow As Seen On TV.Steve Jones to host new BBC One entertainment show, As Seen On TV BBC Press Office 2009-04-08 He also presented 101 Ways to Leave a Gameshow for the channel, which aired in July 2010. In August 2009 and September 2013, he sat in for Janice Long on BBC Radio 2."]}, {"page": "Johnnie Walker (DJ)", "response": ["In early 1999, Walker came off his show having been the subject of a tabloid exposé over his cocaine problem. BBC Radio 2 bosses gave Walker back his drivetime show after he was fined £2,000 for possession of cocaine. He was suspended by the BBC when the drug allegations were published in the News of the World in April 1999. Bosses later reinstated him after the court case. During Walker's absence Richard Allinson filled in for him on Drivetime while Billy Bragg took over Saturday afternoon. Walker returned to his Drivetime show, now presenting from Monday to Friday, towards the end of 1999. The first record he played on his return was Alright Guy by Todd Snider, some of the lyrics of which seemed appropriate in the context of his enforced absence. Janice Long then took over Saturday afternoons."]}, {"page": "Aslan (band)", "response": ["In the summer of 1986, they played a series of shows in the UK and Melody Maker noted: \"Lucky the label that signs this band!\" Janice Long at BBC Radio 1 recorded Aslan in session and it aired three times in the subsequent weeks. At the end of 1986, Aslan were awarded The Stag/Hot Press \"Most Promising New Band\" award and signed to EMI."]}, {"page": "Radio X (United Kingdom)", "response": ["*Janice Long"]}]}}