{"wiki_id": "http://www.wikidata.org/entity/Q6152441", "itemLabel": "Jane Kennedy", "itemDescription": "British politician (born 1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_Kennedy_(politician)", "wikipedia_page": {"main": "Jane Elizabeth Kennedy (née Hodgson; born 4 May 1958) is a British politician and the inaugural Merseyside Police and Crime Commissioner. She was Member of Parliament (MP) for Liverpool Wavertree, formerly Liverpool Broadgreen, from 1992 to 2010.\nFormerly a member of the Government, on 8 June 2009, she returned to the backbenches leaving her position as Minister of State for Farming and the Environment at the Department for Environment, Food and Rural Affairs.Originally a member of the Labour Party, she left the party in March 2019 after the resignation of her successor, Luciana Berger MP, and the announcement that former Liverpool City councillor Derek Hatton - a former member of the Militant tendency - had been re-admitted to party membership.", "link_mentions": [{"page": "May 4", "response": ["*  1958   – Jane Kennedy, English politician"]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Jane Kennedy", "| Jane Kennedy"]}, {"page": "1992 United Kingdom general election", "response": ["|Jane Kennedy"]}, {"page": "Force Research Unit", "response": ["FRU are also alleged to have handled agents within republican paramilitary groups. A number of agents are suspected to have been handled by the FRU including IRA units who planted bombs and assassinated.  Attacks are said to have taken place involving FRU-controlled agents highly placed within the IRA. The main agent to have been uncovered so far was codenamed \"Stakeknife\". There is a debate as to whether this agent is IRA member Freddie Scappaticci or another, as yet unidentified, IRA member.Scappaticci denies the allegations and in May 2003 began legal action to force the then NI Secretary of State, Jane Kennedy, to deny he is/was a British Agent. At this point (May 2006) Scappaticci has launched no libel actions against media making the allegations. There is also suspicion in Irish republican circles that the real \"Stakeknife\" and/or other British agents have yet to be unmasked, this suspicion was compounded by the revelation that Denis Donaldson was a mole within Sinn Féin/the Republican movement, and by interviews given by the man calling himself \"Kevin Fulton\" in March 2006."]}, {"page": "Alistair Darling", "response": ["On 28 June 2007, the new Prime Minister Gordon Brown appointed Darling Chancellor of the Exchequer, a promotion widely anticipated in the media. Journalists observed that three of Darling's four junior ministers at the Treasury (Angela Eagle, Jane Kennedy and Kitty Ussher) were female and dubbed his team, \"Darling's Darlings\"."]}, {"page": "Lord Chancellor's Department", "response": ["|Jane Kennedy"]}, {"page": "List of current members of the British Privy Council", "response": ["| Jane Kennedy"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Jane Kennedy"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Jane Kennedy"]}, {"page": "Huw Irranca-Davies", "response": ["Irranca-Davies has spoken in the House of Commons on topics as varied as international trade union rights, compulsory voting, anti-social behaviour, renewable energy and climate change, fair trade, social justice and poverty and inequality. In June 2005 he became Parliamentary Private Secretary (PPS) to Tessa Jowell, having previously served as PPS to Jane Kennedy at the Northern Ireland Office. He served as PPS to Ministers of the Department for Work and Pensions and Department for Culture, Media and Sport. He worked as Parliamentary Under-Secretary of State of Wales, and as an Environment Minister in the Department for Environment, Food and Rural Affairs (DEFRA). Between October 2010 and October 2011, he served as the Shadow Energy Minister where he led the Labour campaign on the protection of the Feed-In Tariff for solar power. In October 2011, he was appointed as the Shadow Minister on Food and Farming."]}, {"page": "Peter Kilfoyle", "response": ["In the 2012 England and Wales Police and Crime Commissioner elections, he stood in the Labour nomination race to represent Merseyside Police; he was defeated for nomination by another former MP Jane Kennedy. In July 2014, he broke with official party policy to come out in support of Scottish independence and the SNP."]}, {"page": "Jane Kennedy", "response": ["Jane Kennedy may refer to:", "*Jane Kennedy (courtier) (died 1589), Scottish courtier", "*Jane Kennedy (actress) (born 1964), Australian actress and comedian", "*Jane Kennedy (politician) (born 1958), British Labour Party Member of Parliament"]}, {"page": "John Healey (politician)", "response": ["On 29 June 2007, he was moved to the Department for Communities and Local Government as a result of a government reshuffle.  His position as Financial Secretary was filled by Jane Kennedy. Shortly after his appointment he assumed responsibility for assisting the recovery from recent widespread flooding across the United Kingdom. It was announced he would be appointed to the Privy Council in October 2008."]}, {"page": "List of United Kingdom MPs: K", "response": ["* Jane Kennedy (1992–2010)"]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*Jane Kennedy (b. 1958)"]}, {"page": "Financial Secretary to the Treasury", "response": ["|Jane Kennedy"]}, {"page": "Parachute candidate", "response": ["*Luciana Berger was an example of Labour parachuting a middle-class southerner into one of its traditional heartland seats, in her case the northern working-class safe seat of Liverpool Wavertree. She was heavily criticised for having no connection to the Wavertree constituency or Liverpool when she first ran in 2010. When asked by a local radio station to answer basic questions about Liverpool she was unable to, and during the candidate selection process stayed at local MP Jane Kennedy's house rather than make any permanent home in the area. The media raised suggestions that she was only selected for the seat because of her close connections to the Blair family. She went on to win the seat in 2010 and retain it in 2015 and 2017. After joining the Liberal Democrats in 2019, she unsuccessfully contested the Greater London seat of Finchley and Golders Green in the 2019 general election. She made the decision to stand there because of the seat's high Jewish population and Remain vote, as well as her affinity towards living in London and choice to raise her children there, rather than in Liverpool."]}, {"page": "Kit Malthouse", "response": ["Malthouse's first run for office was to represent the constituency of Liverpool Wavertree in the 1997 general election. The seat, which had been recreated after being abolished following the 1979 general election, was easily won by Labour candidate Jane Kennedy, who took 29,592 votes (64.4%). Malthouse came third with 4,944 votes (10.8%), behind Liberal Democrat candidate Richard C. Kemp."]}, {"page": "Dawn Butler", "response": ["She was appointed to the Select Committee on the Modernisation of the House of Commons shortly after her election, and served on standing committees. In November 2007 she was appointed to the Children & Families Select Committee. Earlier (in November 2005), she had been promoted to Parliamentary Private Secretary to the health minister Jane Kennedy, but decided to stand down from this post in early 2006."]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Liverpool Wavertree || Jane Kennedy || Labour || Jane Kennedy || Labour"]}, {"page": "Liverpool Wavertree (UK Parliament constituency)", "response": ["The present Liverpool Wavertree constituency dates from 1997. It contained parts of the former constituencies of Liverpool Broadgreen and Liverpool Mossley Hill. It was held by Jane Kennedy of the Labour Party from 1997 to 2010, who was also the former MP for Liverpool Broadgreen. At  the 2005 general election, the Labour lead over the Liberal Democrats was cut from 38 points to 15 points.  At the 2010 general election, Jane Kennedy retired, and Luciana Berger was selected as the official Labour candidate, which caused some friction in the local CLP, especially due to her close connection with Kennedy.", "|Jane Kennedy"]}, {"page": "Rosie Cooper", "response": ["At the 1992 general election, now a Liberal Democrat, she was back in her native Liverpool, coming second at Liverpool Broadgreen 7,027 votes behind Labour's Jane Kennedy, but ahead of the former deselected Labour MP Terry Fields."]}, {"page": "Terry Fields", "response": ["At the 1992 general election, Fields stood as an independent, winning 14% of the vote, while the official Labour Party candidate, Jane Kennedy, was elected. After losing his seat, Fields ran The Mayflower, a pub on Fazakerley Street in Liverpool, for six months. He did not join the Socialist Party, into which Militant eventually developed."]}, {"page": "1994 Labour Party leadership election", "response": ["| Jane Kennedy || Blair || Prescott"]}, {"page": "Labour Friends of Israel", "response": ["* Jane Kennedy, Chair of LFI (2007)"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Jane Kennedy, Liverpool Broadgreen, 1992–97; Liverpool Wavertree, 1997–2010"]}, {"page": "Queen Elizabeth Sixth Form College", "response": ["* Jane Kennedy, Labour MP for Liverpool Wavertree (1992–2010)"]}, {"page": "Department for Employment and Learning", "response": ["*Jane Kennedy (2002–04)"]}, {"page": "Department of Education (Northern Ireland)", "response": ["* Jane Kennedy (2002–04)"]}, {"page": "Liverpool Broadgreen (UK Parliament constituency)", "response": ["|| 1992 || Jane Kennedy || Labour"]}, {"page": "1958 in the United Kingdom", "response": ["** Jane Kennedy, British Labour politician, MP for Liverpool Wavertree"]}, {"page": "Blair Babe", "response": ["| 56. || Jane Kennedy || Liverpool Broadgreen/Liverpool, Wavertree || 1992 || 2010 || Retired"]}, {"page": "1994 Labour Party deputy leadership election", "response": ["| Jane Kennedy || Tony Blair || John Prescott"]}]}}