{"wiki_id": "http://www.wikidata.org/entity/Q6152735", "itemLabel": "Jane Scott", "itemDescription": "English Conservative politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_Scott,_Baroness_Scott_of_Bybrook", "wikipedia_page": {"main": "Jane Antoinette Scott, Baroness Scott of Bybrook,  (born 1947) is a British Conservative politician, a member of the House of Lords and a government whip. She was leader of Wiltshire County Council between 2003 and 2009 and then of its successor the Wiltshire Council unitary authority from June 2009 until July 2019, when she stood down, also retiring as a councillor in February 2020.", "link_mentions": [{"page": "List of barons in the peerages of Britain and Ireland", "response": ["#*Jane Scott, Baroness Scott of Bybrook"]}, {"page": "Castle Combe", "response": ["Castle Combe is represented in Parliament by James Gray, and in Wiltshire Council by Jane Scott, both Conservatives."]}, {"page": "Wiltshire County Council", "response": ["The council was controlled by the Conservatives from 2000 until 2009 and from 2005 was led by Jane Scott. She became the first leader of the new Wiltshire Council.", "*Jane Scott, Baroness Scott of Bybrook, 1997–2009 (leader, 2003–2009)PR 1220 Wiltshire County Council elects a new leader (Tuesday 15 July 2003) at wiltshire.gov.uk"]}, {"page": "Myerscough College", "response": ["*Jane Scott, Baroness Scott of Bybrook, Conservative politicianPeter Hetherington, Leader of Wiltshire Council in The Guardian dated 28 May 2013, online at the guardian.com, accessed 16 November 2014 "]}, {"page": "Grittleton", "response": ["The parish is represented in parliament by James Gray and on Wiltshire Council by Jane Scott, both Conservatives."]}, {"page": "Flag of Wiltshire", "response": ["The Bustard Flag was first raised in Trowbridge by Lord Bath in September 2006 and was later flown by Jane Scott, leader of the former county council, at County Hall, Trowbridge, on 5 June 2007."]}, {"page": "Yatton Keynell", "response": ["The parish falls within the By Brook electoral division of Wiltshire Council, a unitary authority, and was represented by Jane Scott for the Conservatives until she stood down in February 2020. The seat remained vacant until the local elections in May 2021, since the COVID-19 pandemic prevented the holding of by-elections."]}, {"page": "Conservative A-List", "response": ["*Jane Scott, Leader of Wiltshire Council, now member of the House of Lords"]}, {"page": "Jane Antoinette Scott", "response": ["#REDIRECT Jane Scott, Baroness Scott of Bybrook"]}, {"page": "St Claudine's Catholic School for Girls", "response": ["*Jane Scott, politicianPeter Hetherington, Leader of Wiltshire Council in The Guardian dated 28 May 2013, online at the guardian.com, accessed 16 November 2014. "]}, {"page": "Andrew Kerr (civil servant)", "response": ["Kerr was appointed to the Wiltshire job in January 2010, and in May 2011 he made headlines with an increase to his £189,000 salary while the Council was cutting hundreds of jobs. While initially defending his pay rise, after media and political pressure he decided to turn down the increase. However, in October 2011 he was made redundant, with council leader Jane Scott commenting \"This is an organisation which is led by politicians, not by officers, and that is what we are talking about here.”Mike Wilkinson, Wiltshire Council chief Andrew Kerr ousted from his job dated 6 October 2011 in Swindon Advertiser online"]}, {"page": "Jane Scott", "response": ["Jane Scott may refer to:", "*Jane Scott, Duchess of Buccleuch (1929–2011), British peeress", "*Jane Scott (film producer), Australian film producer", "*Jane Scott, Baroness Scott of Bybrook (born 1947), British politician", "*Jane Scott (rock critic) (1919–2011), American rock critic", "*Jane Scott (theatre manager) (1779–1839), 19th century theater manager, actor, and playwright", "*Jane Scott, Countess of Dalkeith (1701–1729)"]}, {"page": "2015 Dissolution Honours", "response": ["* Cllr Jane Scott , to be Baroness Scott of Bybrook, of Upper Wraxall in the County of Wiltshire"]}, {"page": "Baron Scott", "response": ["*Jane Scott, Baroness Scott of Bybrook"]}, {"page": "Jane Scott (politician)", "response": ["#REDIRECT Jane Scott, Baroness Scott of Bybrook"]}, {"page": "Baroness Scott of Bybrook", "response": ["#REDIRECT Jane Scott, Baroness Scott of Bybrook"]}, {"page": "2017 Wiltshire Council election", "response": ["Note: Jane Scott retired in February 2020.", "Jane Scott retired as councillor for By Brook in February 2020, following her appointment to a government role in the House of Lords. The seat remained vacant until the full local elections in May 2021, since the COVID-19 lockdown restrictions prevented the holding of by-elections."]}, {"page": "Baroness Scott", "response": ["*Jane Scott, Baroness Scott of Bybrook (born 1947), British politician"]}, {"page": "Nick Botterill", "response": ["In March 2020, Botterill was selected as the Conservative candidate for a by-election in the Wiltshire Council By Brook division, following the resignation of Jane Scott, Baroness Scott of Bybrook, who had been appointed as a government whip in the House of Lords. Matthew McLaughlin, \"By-election: Meet the two By Brook candidates\", wiltshiretimes.co.uk, 17 March 2020, accessed 25 April 2020 However, the by-election was cancelled only a month later, due to COVID-19 lockdown guidance. \"SUSPENDED: Unitary council by-election for By Brook Unitary Division on Thursday 2 April 2020\", wiltshire.gov.uk, 2 April 2020 Botterill commented to the Gazette and Herald that this was \"completely the right decision under the circumstances\".Matthew McLaughlin, \"By Brook by-election suspended due to Coronavirus\", Gazette and Herald, 23 March 2020, accessed 25 April 2021"]}, {"page": "Peter Chalke", "response": ["In Wiltshire, Chalke was succeeded by Jane Scott.PR 1220 \"Wiltshire County Council elects a new leader\", wiltshire.gov.uk, 15 July 2003 She commented some years later that her style of leadership was quite different to the \"very traditional and old-fashioned way\" that Chalke had run the county.Heather Jameson, \"PODCAST: People, passion and progress\", theme.co.uk, 19 July 2017, accessed 5 June 2021 Very different from her more confrontational style."]}]}}