{"wiki_id": "http://www.wikidata.org/entity/Q6152511", "itemLabel": "Jane M. Joseph", "itemDescription": "English composer (1894-1929)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_Joseph", "wikipedia_page": {"main": "Jane Marian Joseph (31 May 1894 – 9 March 1929) was an English composer, arranger and music teacher. She was a pupil and later associate of the composer Gustav Holst, and was instrumental in the organisation and management of various of the music festivals which Holst sponsored. Many of her works were composed for performance at these festivals and similar occasions. Her early death at age 35, which prevented the full realisation of her talents, was considered by her contemporaries as a considerable loss to English music.\nHolst first observed Joseph's potential when he was teaching her composition at St Paul's Girls' School. She began to act as his amanuensis in 1914, when he was composing The Planets, her special responsibility being the preparation of the score for the \"Neptune\" movement. She continued to assist Holst with transcriptions, arrangements and translations, and was his librettist for the choral ballet The Golden Goose.\nDuring her short professional life she became an active member of the Society of Women Musicians, was the prime mover behind the first Kensington Musical Competition Festival, and helped to found the Kensington Choral Society.  She also taught music at a girls' school, where Holst's daughter Imogen was one of her pupils, and became a leading figure in the musical life of Morley College. Two memorial prizes and scholarships were endowed in her name.\nMost of Joseph's compositions were never published and are now considered lost. Of her published works, two early short orchestral pieces, Morris Dance and Bergamask won considerable critical praise, although neither became part of the general orchestral repertory.  Two choral works, A Festival Venite and A Hymn for Whitsuntide were admired during her lifetime, but never commercially recorded. Since her death, her work has seldom been performed, but occasionally been broadcast.  Her carol \"A Little Childe There is Ibore\" was thought by Holst to be among the best of its kind.", "link_mentions": []}}