{"wiki_id": "http://www.wikidata.org/entity/Q6153138", "itemLabel": "Jennie Adamson", "itemDescription": "British politician (1882-1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jennie_Adamson", "wikipedia_page": {"main": "Janet Laurel Adamson (née Johnston; 9 May 1882 – 25 April 1962) was a British Labour Party politician who served as a Member of Parliament from 1938 to 1946, and a junior minister in Clement Attlee's post-war Labour government.", "link_mentions": [{"page": "List of United Kingdom MPs: A", "response": ["|Jennie Adamson"]}, {"page": "List of MPs elected in the 1945 United Kingdom general election", "response": ["|Jennie Adamson"]}, {"page": "Dartford (UK Parliament constituency)", "response": ["| Jennie Adamson"]}, {"page": "Attlee ministry", "response": ["|rowspan=3|Parliamentary Secretary to the Minister of Pensions||Jennie Adamson||4 August 1945|| "]}, {"page": "Proxy marriage", "response": ["Proxy marriage was argued for in the House of Commons by Jennie Adamson in 1943."]}, {"page": "The Black Book (list)", "response": ["* Jennie Adamson, Labour politician"]}, {"page": "List of United Kingdom by-elections (1931–1950)", "response": ["|Jennie Adamson", "|Jennie Adamson"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Jennie Adamson, Dartford, 1938–45; Bexley, 1945–46"]}, {"page": "Parliamentary Secretary to the Minister for Pensions", "response": ["|Jennie Adamson || 1945 || 1946 "]}, {"page": "Bexley (UK Parliament constituency)", "response": ["| Jennie Adamson"]}, {"page": "Norman Dodds", "response": ["As the war came to an end, the Government invited the Boundary Commission to divide the abnormally large constituencies; one of them was the Dartford division of Kent, which had a 1939 electorate of 134,935. The Commission recommended that two new boroughs, Bexley and Dartford be created out of the division.\"Report of the Boundary Commission for England 1944 in regard to certain abnormally large Constituencies\", Cmd. 6634, His Majesty's Stationery Office, 1945, p. 24. The sitting MP for Dartford was Jennie Adamson, who had won a by-election for Labour in 1938; she decided to fight in the new Bexley constituency. Dodds, who was living in Dartford, was selected as Labour candidate for the new Dartford borough constituency."]}, {"page": "Janet Laurel Adamson", "response": ["#REDIRECT Jennie Adamson "]}, {"page": "List of members of London County Council 1919–1937", "response": ["| Jennie Adamson"]}, {"page": "Jennie Laurel Adamson", "response": ["#REDIRECT Jennie Adamson"]}, {"page": "1946 Bexley by-election", "response": ["The Bexley by-election of 1946 was held on 22 July 1946.  The byelection was held due to the deputy chairman of assistance board of the incumbent Labour MP, Jennie Adamson.  It was won by the Labour candidate Ashley Bramall, with a much reduced majority."]}, {"page": "1938 Dartford by-election", "response": ["The Dartford by-election of 1938 was held on 7 November 1938.  The by-election was held due to the death of the incumbent Conservative MP, Frank Edward Clarke.  It was won by the Labour candidate Jennie Adamson. Adamson afterwards stated that she won, because the voters \"were ashamed of Mr. Chamberlain's betrayal of Czechoslovakia and of democracy.\" "]}, {"page": "Janet Adamson", "response": ["#REDIRECT Jennie Adamson"]}, {"page": "Kirkcudbright Academy", "response": ["*Jennie Adamson was a Labour Party politician in the United Kingdom. She sat in the House of Commons from 1938 to 1946, and served as a junior minister in Clement Attlee's post-war Labour government."]}, {"page": "Lambeth North (London County Council constituency)", "response": ["| Jennie Adamson"]}, {"page": "Workers' Birth Control Group", "response": ["Other active supporters were Jennie Adamson, Stella Browne and Janet Chance."]}]}}