{"wiki_id": "http://www.wikidata.org/entity/Q6153190", "itemLabel": "Janet Beer", "itemDescription": "British academic administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Janet_Beer", "wikipedia_page": {"main": "Dame Janet Patricia Beer,  (born 1 August 1956) is the Vice-Chancellor of the University of Liverpool. She took over from Howard Newby in February 2015, having previously been Vice-Chancellor at Oxford Brookes University and Pro-Vice Chancellor and Dean of Humanities, Law and Social Sciences at Manchester Metropolitan University.", "link_mentions": [{"page": "University of Liverpool", "response": ["* 2015–present: Dame Janet Beer"]}, {"page": "Oxford Brookes University", "response": ["Baroness Kennedy served as the university's chancellor from 1994 to 2001. In 2007, Graham Upton retired as vice-chancellor and his successor, Janet Beer, was inaugurated in September. In July 2008, Shami Chakrabarti, director of Liberty, replaced Jon Snow as chancellor.", "In March 2015, Alistair Fitt was inaugurated as vice-chancellor, replacing Janet Beer. Dame Katherine Grainger, a former British Olympic rower, replaced Shami Chakrabarti as chancellor. Grainger is Britain's most decorated female Olympic athlete and the first British woman to win medals at five successive games (Rio 2016, London 2012, Beijing in 2008, Athens in 2004 and Sydney in 2000). She was made a dame for her services to rowing and charity in the 2017 New Years Honours.", "* Janet Beer (2007–2015)"]}, {"page": "List of chancellors and vice-chancellors of British universities", "response": ["| Janet Beer"]}, {"page": "University Alliance", "response": ["|Janet Beer"]}, {"page": "List of Dames Commander of the Order of the British Empire", "response": ["*2018: Mary Beard, Janet Beer, Darcey Bussell, Hilary Chapman, Jane Dacre, Jacqueline Daniel, Louise Ellman, Pratibha Gai, Cheryl Gillan, Moya Greene, Sue Hill, Vivian Hunt, Eleanor Laing, Stella Manzie, Clare Marx, Angela McLean, Angela Pedder, Susan I. Rice, Christine Ryan, Frances Saunders, Rosemary Squire, Emma Thompson, Janet Vitmayer, Cathy Warwick"]}, {"page": "Xi'an Jiaotong-Liverpool University", "response": ["* Janet Beer - Professor and vice-chair of the board at XJTLU"]}, {"page": "MacMillan Center for International and Area Studies", "response": ["* Janet Beer (MA '95) – vice-chancellor of Oxford Brookes University"]}, {"page": "John Craven (economist)", "response": ["In August 2009 he was replaced as chair by the Chancellor (education)#Vice-chancellor|vice-chancellor of Oxford Brookes University, Professor Janet Beer."]}]}}