{"wiki_id": "http://www.wikidata.org/entity/Q616573", "itemLabel": "Tony Norris", "itemDescription": "British ornithologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Norris", "wikipedia_page": {"main": "Cuthbert Antony (Tony) Norris (9 January 1917 in Cradley, Worcestershire - 25 February 2005 in Worcester) was an English ornithologist. He was a member of the RSPB's council in the 1950s and 1960s, chairing its finance and general purposes committee. During that time, he persuaded the organisation to move from London to its current headquarters at The Lodge, Sandy, Bedfordshire. Using his own money to facilitate the transaction he was, for one day, owner of the Lodge.\nNorris was BTO President from 1961–64 and was awarded their Bernard Tucker Medal in 1959. He was also secretary and chairman of the West Midland Bird Club from 1953–1975 and its president from 1975–1999. He was the youngest member of the British Ornithologists' Union. He was the instigator of the Bardsey Bird and Field Observatory and was the youngest member of the British Ornithologists' Union.\nIn December 1958 he presented a talk on the BBC Home Service, In Search of Prunella, about the alpine accentor (Prunella collaris).In 1940, he married Cicely Hurcomb, daughter of Lord Hurcomb, and they had two daughters. He ran a garden nursery and specialised in growing South African nerine lilies, for which he was awarded an RHS gold medal. Cicely died in 1976 and in 1985 Norris bred a Nerine 'Cicely Norris', named in her honour He was a personal friend of Peter Scott and assisted him in setting up the Wildfowl and Wetlands Trust.", "link_mentions": [{"page": "West Midland Bird Club", "response": ["*Tony Norris"]}, {"page": "British Trust for Ornithology", "response": ["In December 1962, at the behest of Tony Norris, the BTO purchased Beech Grove, a large Victorian house in Tring, Hertfordshire, relocating there from Oxford, along with their Ringing Office, which had been at the British Museum."]}, {"page": "Cyril Hurcomb, 1st Baron Hurcomb", "response": ["Hurcomb was Permanent Under-Secretary of the Ministry of Transport from 1927 to 1937; of the Ministry of Shipping from 1939; and then of its successor the Ministry of War Transport from 1941 until 1947. He was the first chairman of the British Transport Commission between 1948 and 1953. He was also a keen ornithologist and conservationist, and played a key role in the 1954 Protection of Birds Act. He served as chairman of the Royal Society for the Protection of Birds' council, as president of the RSPB, and president of the West Midland Bird Club from 1960 to 1975 (when he was succeeded by his son-in-law, Tony Norris, the husband of his daughter Cicely Hurcomb (d. 1976). In July 1950 he was elevated to the peerage as Baron Hurcomb, of Campden Hill in the Royal Borough of Kensington. He was also a Grand Officer of the Order of the Crown (Belgium) and Grand Cross of the Order of St. Olav. The BR Standard Class 7 locomotive number 70001 was named Lord Hurcomb in his honour."]}, {"page": "Deaths in February 2005", "response": ["*Tony Norris, 88, British ornithologist."]}, {"page": "2005 in birding and ornithology", "response": ["* 25 February - Tony Norris (born 1917)"]}, {"page": "Bird atlas", "response": ["& T. Nelson, London. The first bird atlas, the Atlas of breeding birds of the West Midlands, covered Staffordshire, Warwickshire and Worcestershire (England) and was published by Collins for the West Midland Bird Club, in 1970., It built on work done by the Club and its subsequent president, Tony Norris, for its West Midland Bird Distribution Survey, circulated privately in 1951, (published for private circulation) which mapped frequency of sightings and breeding densities against districts based on the boundaries of Rural District Councils. The British Trust for Ornithology published updated atlases, covering Britain and Ireland, in 1993 and 2013. The West Midlands atlas influenced and was followed by the 1976 Atlas of Breeding Birds in Britain and Ireland.Sharrock, J.T.R. (1976) The Atlas of Breeding Birds in Britain and Ireland. T. & A.D. Poyser, Berkhamsted. In the US, the first breeding bird atlas to be published was for the State of Vermont.Laughlin, Sarah B., and Douglas P. Kibbe (eds.). 1985. The atlas of breeding birds of Vermont. Vermont Inst. of Natural Science, Woodstock,VT. 456 p. In the decades that followed a number of atlases have been made all over the world and by 2008 atlases had summarised as many as 27.9 million records of birds gathered by at least 108000 contributors, over an area covering roughly 31.4% of the world's land. While early atlases focused on merely the presence or absence of species and evidence of their breeding, there is an increasing trend towards those that indicate abundance or relative abundance."]}, {"page": "The Lodge RSPB reserve", "response": ["After Princess Margaret decided not to buy The Lodge (having been advised that a public bridleway through the grounds was a security risk), the RSPB acquired it in 1961.RSPB 'about us' webpage The purchase was arranged by Tony Norris, then chairman of its finance and general purposes committee, who used his own money to facilitate the transaction and was, for one day, owner of the Lodge. It has been their headquarters ever since."]}, {"page": "Norris (surname)", "response": ["* Tony Norris, British ornithologist"]}, {"page": "Birds In Britain", "response": ["Other presenters and guests included notable ornithologists, such as Arnold Boyd, William Condry, Eric  Ennion,  Julian Huxley, Tony Norris, Peter Scott, and Tony Soper. Soper was also the producer of some episodes."]}]}}