{"wiki_id": "http://www.wikidata.org/entity/Q6162267", "itemLabel": "Jason Cowley", "itemDescription": "British journalist born 1965", "wikipedia_url": "https://en.wikipedia.org/wiki/Jason_Cowley_(journalist)", "wikipedia_page": {"main": "Jason Cowley (born 19 June 1965) is an English journalist, magazine editor and writer. After working at the New Statesman, he became the editor of Granta in September 2007, while also remaining a writer on The Observer. He returned to the New Statesman as its editor in September 2008.", "link_mentions": [{"page": "List of winners and shortlisted authors of the Booker Prize", "response": ["*Jason Cowley"]}, {"page": "List of newspapers in the United Kingdom", "response": ["|Jason Cowley"]}, {"page": "Granta", "response": ["In April 2007, it was announced that Jason Cowley, editor of the Observer Sport Monthly, would succeed Jack as editor in September 2007. Cowley redesigned and relaunched the magazine; he also launched a new website. In September 2008, he left when he was selected as editor of the New Statesman."]}, {"page": "New Statesman", "response": ["Today, the magazine is a print-digital hybrid. According to its present self-description, it has a liberal and progressive political position. Jason Cowley, the magazine's editor, has described the New Statesman as a publication \"of the left, for the left\" but also as \"a political and literary magazine\" with \"sceptical\" politics.", "The magazine was founded by members of the Fabian Society as a weekly review of politics and literature. The longest-serving editor was Kingsley Martin (1930–1960), and the current editor is Jason Cowley, who assumed the post in 2008.", "In April 2008, Geoffrey Robinson sold a 50% interest in the magazine to businessman Mike Danson, and the remainder a year later. The appointment of the new editor Jason Cowley was announced on 16 May 2008, but he did not take up the job until the end of September 2008.", "Cowley was named current affairs editor of the year at the British Society of Magazine Editors awards in 2009, and in 2011 he was named editor of the year in the Newspaper & Current Affairs Magazine Category at the British Society of Magazine Editors awards, while Jon Bernstein, the deputy editor, gained the award for Consumer Website Editor of the Year. Cowley had been shortlisted as Editor of the Year (consumer magazines) in the 2012 PPA (Professional Publishers Association) Awards. He was also shortlisted for the European Press Prize editing award in January 2013, when the awards committee said: \"Cowley has succeeded in revitalising the New Statesman and re-establishing its position as an influential political and cultural weekly. He has given the New Statesman an edge and a relevance to current affairs it hasn’t had for years.\"\"Jason Cowley | NOMINEE OF THE ’13 Distinguished award\" , European Press Prize.", "At the 2020 British Society of Magazine Editors (BSME) awards, editor Jason Cowley was named Current Affairs and Politics editor of the year for the fourth time, defeating rivals from The Spectator, The Big Issue and Prospect. \"In increasingly tribal times, Jason Cowley continues to champion independence of thought and diversity of opinion, challenging his audience and producing a magazine that's imaginative, unpredictable and interesting\", the BSME judges said on presenting the award.", "*Jason Cowley (2008–)"]}, {"page": "Bryan Magee", "response": ["In 2018 Magee, who was then living in one room in a nursing hospital in Oxford, was interviewed by Jason Cowley of New Statesman and discussed his life and his 2016 book Ultimate Questions. Magee said that he believed he lacked originality and, until Ultimate Questions, had struggled to make an original contribution to philosophy, saying: Popper had this originality, Russell had it, and Einstein had it in spades. Einstein created a way of seeing things which transformed the way we see the world and the way we even understand such fundamental things as time and space. And I fundamentally understand that I could never do that, never. I wish I was in that class – not because I want to be a clever chap but because I want to do things that are at a much better level than I've done them. He explained that he followed the news and politics closely and that he considered the vote for Brexit to have been a \"historic mistake\"."]}, {"page": "John Gray (philosopher)", "response": ["In 2002 Straw Dogs was named a book of the year by J. G. Ballard in The Daily Telegraph; by George Walden in The Sunday Telegraph; by Will Self, Joan Bakewell, Jason Cowley and David Marquand in the New Statesman; by Andrew Marr in The Observer; by Jim Crace in The Times; by Hugh Lawson Tancred in The Spectator; by Richard Holloway in the Glasgow Herald; and by Sue Cook in The Sunday Express."]}, {"page": "Snow Country", "response": ["Snow Country has received favorable reviews both at time of its publishing, and over the following years. The Times stated: \"He has fashioned an idyll out of unpromising material\", while Eileen Fraser of the Times Literary Supplement stated: \"Mr. Kawabata's beautifully economical novel. This is a finely written book, excellently translated.\" Jason Cowley has called Snow Country as \"..perhaps his finest work.\"."]}, {"page": "Binyavanga Wainaina", "response": ["In July 2002 he won the Caine Prize for his short story \"Discovering Home\" (the judges being Ahdaf Soueif, Margaret Busby, Jason Cowley and Abdulrazak Gurnah).Caine Prize judges since 2000. Wainaina was the founding editor of Kwani?, the literary magazine in East Africa that sprung out of an artistic revolution that started in 2002. Established in 2003, Kwani? has since become an important source of new writing from Africa; Yvonne Owuor also wrote for the magazine and won the Caine Prize in 2003."]}, {"page": "Peregrine Worsthorne", "response": ["In the 2000s he regularly contributed book reviews to the New Statesman, and was still a subscriber to the magazine in the 2010s. He told Jason Cowley of the New Statesman in a 2016 interview: \"I've always thought the English aristocracy so marvellous compared to other ruling classes. It seemed to me that we had got a ruling class of such extraordinary historical excellence, which is rooted in England almost since the Norman Conquest.\""]}, {"page": "My Life in the Bush of Ghosts (album)", "response": ["In later years, My Life has come to be regarded as a highly influential album, particularly in its use and treatment of sampled source material. AllMusic critic John Bush describes it as a \"pioneering work for countless styles connected to electronics, ambience and Third World music\". The Independents Andy Gill found the album groundbreaking in its recontextualisation of sampling in a less overtly avant-garde context, with its sampled sounds instead being \"marshalled by funk rhythms into repetitive hooks.\" Writing in The Observer, Jason Cowley said that its immediate influence was felt \"in the work of young artists of ambition, from David Sylvian to Kate Bush\", and subsequently on later acts, among them electronic artists such as Massive Attack, Moby, and Thievery Corporation. Chris Dahlen of Pitchfork felt that while its sampled vocals had lost some of their revolutionary impact, the album mostly lives up to its critical reputation \"as a near-masterpiece, a milestone of sampled music, and a peace summit in the continual West-meets-rest struggle.\""]}, {"page": "In Dreams Begin Responsibilities", "response": ["The story has been available in print since the author's death in two posthumously published collections of Schwartz's work, In Dreams Begin Responsibilities and Other Stories (1978) and Screeno: Stories and Poems (2004). In a 2003 review of In Dreams Begin Responsibilities and Other Stories that appeared in The Observer, Jason Cowley wrote, \"[Schwartz] never wrote a finer story than 'Dreams'.\""]}, {"page": "Bishop's Stortford College", "response": ["The Ferguson Building, opened in 2007 and named after Old Stortfordian Professor John Ferguson, who was a founding member of the Open University, provides a lecture theatre for up to 180 people, meeting room, ICT suite and sixth form social centre. It is built on the site of the old indoor swimming pool and retains some of its original features. It hosts the Ferguson Lectures, which focus on contemporary issues and are open to the public; speakers have included former archbishop of Canterbury Dr Rowan Williams; Jason Cowley, editor of the New Statesman; Brendan Simms, Professor of History of International Relations at Peterhouse, Cambridge; Jonathan Bartley, co-leader of the Green Party of England and Wales; the late Tony Benn, politician; and writer and historian Tom Holland."]}, {"page": "Ian Folley", "response": ["Two years later, playing for Whitehaven, Folley was hit underneath the eye in a freak accident while batting in a match against Workington, and was taken to local hospital for a minor operation to repair his perforated eyeballJason Cowley Spinning a cricketing hero in my mind's eye,  The Guardian, 3 September 2007. Retrieved 28 November 2014 There, while under anaesthesia, he suffered a heart attack and died. The hospital later admitted negligence.Ten fatal cricket injuries before Phillip Hughes died, Sydney Morning Herald, 28 November 2014 He was thirty years old."]}, {"page": "God Is Not Great", "response": ["Jason Cowley in the Financial Times called the book \"elegant but derivative\"."]}, {"page": "Douglas Murray (author)", "response": ["In 2019, Murray spent weeks urging New Statesman journalist George Eaton and editor Jason Cowley to share the original recording of an interview between Eaton and Sir Roger Scruton, with Murray branding the published interview – which attributed a number of controversial statements to Scruton – as \"journalistic dishonesty\".. Murray eventually managed to acquire the recording, which formed the basis of an article defending Scruton, arguing that his remarks had been misinterpreted. The New Statesman subsequently apologised for Eaton's misrepresentation."]}, {"page": "Wessex Scene", "response": ["*Jason Cowley (Editor, New Statesman)"]}, {"page": "George Galloway", "response": ["In July 2015, Galloway endorsed Jeremy Corbyn's campaign in the Labour Party leadership election. He tweeted: \"Congratulations to Jeremy Corbyn MP and good fortune in the labour leadership contest. If he wins it will change everything...\" He also said that he would become a Labour Party member \"pretty damn quick\" if Corbyn was elected as Labour leader. Less than a week after Corbyn became leader, a Labour spokeswoman told The Times: \"George Galloway has not applied to rejoin the Labour party and he will not be receiving an invitation.\"  Corbyn himself said in July 2015 during an interview with New Statesman editor Jason Cowley that he was appalled at the tactics Galloway used while defending his seat against Naz Shah (Labour) during the general election. In an interview to The Huffington Post journalist Paul Waugh in December 2015, Corbyn said that Galloway's readmission to the party was a decision not within his powers."]}, {"page": "Outliers (book)", "response": ["Jason Cowley, reviewing the book in The Guardian, felt that Outliers was an argument between Gladwell and himself, referring to the many times that he uses the word \"we\" when defining his position, such as in the example: \"There is something profoundly wrong with the way we look at success. ... We cling to the idea that success is a simple function of individual merit and that the world in which we grow up and the rules we choose to write as a society don't matter at all.\" He also believed that there was a \"certain one-dimensional Americanness at work\", observing that many of Gladwell's examples are from the United States, particularly in New York City. In an article about the book for The New York Times, Steven Pinker wrote, \"The reasoning in 'Outliers,' which consists of cherry-picked anecdotes, post-hoc sophistry and false dichotomies, had me gnawing on my Kindle.\" In a review in The New Republic, Isaac Chotiner called the final two chapters of Outliers \"impervious to all forms of critical thinking\"."]}, {"page": "List of University of Southampton people", "response": ["* Jason Cowley, editor for the New Statesman magazine"]}, {"page": "Liverpool 0–2 Arsenal (1989)", "response": ["The match has been cited as a pivotal turning point in English football. Author Jason Cowley noted how instead of rioting, Liverpool fans stayed on after the game and applauded Arsenal \"as if they understood that we were at the start of something new; that there would be no returning to the ways of old\". Cowley noted that \"the speed and audacity of a movement that took the Kop's breath away and left Kenny Dalglish standing open-mouthed in disbelief by the Liverpool bench epitomised the healthier qualities of English football as the game approaches the 90s\" and \"describes the match as \"the night football was reborn\" and that the event \"repaired the reputation of football\". "]}, {"page": "Arsène Wenger", "response": ["Wenger was one of the first managers in English football to scout abroad for talent. His double-winning team of 1998 was described by editor Jason Cowley as \"a model of racial and multicultural integration. They were the first truly globalised team\". Richard Jolly writing for The National added that Wenger aided the Premier League's globalisation and \"showed the merit of hiring foreign managers on the basis of their record abroad\". Wenger himself felt he had changed attitudes towards foreign managers in England:"]}, {"page": "Cowley (surname)", "response": ["*Jason Cowley (born 1966), British journalist, magazine editor and writer"]}, {"page": "Alex Clark (journalist)", "response": ["Clark is Editor at Large at Union Books.\"Between The Covers: 21/08/2011\" (article on Union Books), The Independent, 21 August 2011. Having previously served as deputy editor, she was appointed as the first female editor of Granta magazine in May 2008, in succession to Jason Cowley. Clark assumed the post in the following September, but left in May 2009. She was succeeded by John Freeman."]}, {"page": "George Eaton (journalist)", "response": ["After working for PoliticsHome, he was recruited to the New Statesman in 2009 by editor Jason Cowley as a staff writer and later edited the magazine's political blog The Staggers, which was named online comment site of the year at the 2013 Comment Awards. He was political editor of the New Statesman from 2014 to 2018, joint deputy editor from 2018 to 2019. After his controversial Roger Scruton article, he moved to the position of assistant editor. Since February 2020 he has worked as Senior Online Editor. He has also written for The Times, The Sunday Times and The Evening Standard."]}, {"page": "Death of Arkadiusz Jóźwik", "response": ["In an article about another crime in April 2017, The New York Times brought up the death of Jóźwik and said he was \"repeatedly pummeled and kicked by a group of boys and girls\". Harlow-born journalist Jason Cowley wrote that this was inaccurate for several reasons: the group of youths was all male, only one was charged, and he threw only one punch."]}, {"page": "Jason Cowley", "response": ["Jason Cowley is the name of:", "*Jason Cowley (footballer)", "*Jason Cowley (journalist)"]}, {"page": "Straw Dogs (book)", "response": ["In 2002 Straw Dogs was named a book of the year by J. G. Ballard in The Daily Telegraph; by George Walden in The Sunday Telegraph; by Will Self, Joan Bakewell, Jason Cowley and David Marquand in the New Statesman; by Andrew Marr in The Observer; by Jim Crace in The Times; by Hugh Lawson Tancred in The Spectator; by Richard Holloway in the Glasgow Herald; and by Sue Cook in The Sunday Express."]}]}}