{"wiki_id": "http://www.wikidata.org/entity/Q6161761", "itemLabel": "Jasmine Dotiwala", "itemDescription": "British broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Jasmine_Dotiwala", "wikipedia_page": {"main": "Jasmine Dotiwala is a British broadcaster, producer, and columnist based in West London. Dotiwala has worked with television and radio news platforms such as MTV News UK and BBC Radio London.", "link_mentions": [{"page": "MTV News", "response": ["*  Jasmine Dotiwala"]}, {"page": "The Word (TV series)", "response": ["The show's presenters included Terry Christian, comedian Mark Lamarr, Dani Behr, Katie Puckrik, Jasmine Dotiwala, Alan Connor, Amanda de Cadenet and Huffty.  Originally broadcast in the old Tube time slot of 6 pm Friday evenings, The Word's main live show was shifted to a late-night timeslot from 9 November 1990. The magazine format allowed for interviews, live music, features and even game shows. The flexible late-night format meant that guests could do just about anything to be controversial."]}, {"page": "List of MTV VJs", "response": ["* Jasmine Dotiwala"]}, {"page": "The Voice (British newspaper)", "response": ["Former writers for The Voice include one-time Commission for Racial Equality chair Trevor Phillips, former BBC and currently Al Jazeera newsman Rageh Omaar,Burrell, Ian, \"Lester Holloway: 'Victim stories have had their day in black papers'\", The Independent, 5 May 2008. Martin Bashir,Chrisafis, Angelique, \"McCalla, publisher who gave black people a voice, dies\", The Guardian, 24 August 2002. authors Diran Adebayo, Leone Ross, and Gemma Weekes; film maker and novelist Kolton Lee, novelist Vanessa Walters, broadcasters Jasmine Dotiwala, Henry Bonsu,Steve Pope, \"Total blackout\", Comment, The Guardian, 19 March 2004. Dotun Adebayo, Onyekachi Wambu, Joel Kibazo, educationalist Tony Sewell and publisher Steve Pope, among others."]}, {"page": "Forever (Chris Brown song)", "response": ["The song was written by Brown and his songwriting team, the Graffiti Artists (Rob Allen and Andre Merritt). He stated that after entering the studio, Polow da Don created a beat that Brown wrote along to. Because the producer's style was \"more of a European, techno, house-type feel,\"Shaheem Reid, Jasmine Dotiwala (March 25, 2008). Chris Brown readies deluxe Edition Of Exclusive MTV. Accessed March 25, 2008. the group \"wanted to give it that other side of crossover, and go a little bit to that pop realm\". \"Forever\" is one of four new songs Brown recorded for the re-release of his second studio album Exclusive. He recorded the song using an autotune effect, as he did in one of his previous singles, \"Kiss Kiss\".The Gerbil's Revenge: Musical Events: The New Yorker Accessed July 23, 2008 The song was first intended to be on Brown's following album, but decided he \"wasn't ready to release a new album yet\"."]}, {"page": "List of British Indians", "response": ["* Jasmine Dotiwala, television / radio presenter, reporter, producer, journalist, columnist"]}, {"page": "United Kingdom in the Eurovision Song Contest 2009", "response": ["* Jasmine Dotiwala"]}, {"page": "List of GMTV presenters and reporters", "response": ["| Jasmine Dotiwala"]}, {"page": "List of Eurovision Song Contest 2009 jurors", "response": ["| Jasmine Dotiwala (Final)"]}, {"page": "Obsessed (Mariah Carey song)", "response": ["On June 16, 2009, an accompanying remix featuring rapper Gucci Mane was released alongside the original. The song kept to its original arrangement and vocals, only adding ad libs throughout the song, as well as adding a new intro and replacing the bridge with another verse by Mane. Two days before the remix's release, Jasmine Dotiwala, Carey's longtime friend tweeted regarding it, saying \"Listening to 'Obsessed' remix on repeat, -guest rapper-cant tell u who it is but he put the G in Ghetto! Sick combo-hotness.\" In an interview with MTV News, Mane described the remix as his \"biggest collaboration yet\":"]}, {"page": "London 360", "response": ["Executive editor for London360 is: Jasmine Dotiwala"]}]}}