{"wiki_id": "http://www.wikidata.org/entity/Q6162123", "itemLabel": "Jason Brown", "itemDescription": "English cricketer (born 1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jason_Brown_(cricketer)", "wikipedia_page": {"main": "Jason Fred Brown (born 10 October 1974 in Newcastle-under-Lyme, Staffordshire, England) is a cricketer who has previously played for Northamptonshire, Nottinghamshire, England A and Staffordshire.", "link_mentions": [{"page": "Northamptonshire County Cricket Club in 2005", "response": ["*  Jason Brown", "They moved up to second place in the already decided National League with a no-result at Glamorgan, before drawing two successive Championship matches, with Somerset and Durham. Monty Panesar and Jason Brown then took ten wickets each in the final Championship game, which Northamptonshire won by an innings and 21 runs, before they rounded off their National League season with a loss to Essex.", "The first day of this game at Northampton saw Northamptonshire progress to 373 for 7 declared off only 69 overs. Kevin Innes top-scored with 80 off only 59 balls. The declaration left time for 23 more overs on the first day, in which Bradford/Leeds UCCE slumped to 60 for 5. The second day, Bradford/Leeds UCCE fared equally badly, being dismissed for 137. Northamptonshire chose to enforce the follow-on rather than opt for batting practice, and saw off Bradford/Leeds UCCE for 174 to win by an innings and 62 runs in two days. Spinners Monty Panesar and Jason Brown both got five wickets each in the match. (Cricinfo scorecard)", "On the third day, Leicestershire progressed to 339 all out, with Darren Robinson scoring 100. However, the innings was controversial, with three debatable decisions going against the visitors. First Robinson was given out caught, when the ball probably hit his forearm. Then HD Ackerman was out leg before to a delivery that looked high. Then, at 220 for 5 Aftab Habib edged Jason Brown low to Martin Love at first slip. Habib thought it had not carried, and Love and one umpire were not sure. The other umpire said he was out, so off Habib went. But he returned to confront Shafayat who taunted Habib on the dismissal. Northamptonshire progressed to 45 for 0 at close.", "Somerset won the toss at Northampton and chose to bowl – and although they got the hosts Northamptonshire out in a day, Martin Love (166) and wicketkeeper Riki Wessels (son of Kepler) (102) made quick centuries to lift the hosts to 408. Conversely, however, two Northamptonshire batsmen batting at 4 and 5 perished for ducks to Richard Johnson. Somerset replied well, though, with 53 from opener Matthew Wood, but rash strokes gave wickets around everywhere as Somerset made 356 – admittedly only 52 behind. Off-spinner Jason Brown got six wickets for 112, just as many as he had taken before this game, while Ian Blackwell played a typical 59 off 77 balls.", "At Northampton, Andy Caddick served up an unusually economical spell, taking two for 12 in three overs despite two wides. That helped tie the hosts Northamptonshire Steelbacks down to 95 for 6 in 12 overs in the rain-shortened game, and with Graeme Smith and Keith Parsons at the crease and the score 55 for 1, things looked bright for Somerset Sabres. Two wickets from Jason Brown helped put the odds for a Northamptonshire win down, but Somerset prevailed, Parsons hitting the winning runs on the last ball as Somerset finished on 97 for 5.", "Michael Lumb with 89 and Ian Harvey with 74 lifted Yorkshire to 270 all out at Headingley in the fourth quarter-final of the C&G Trophy. It was a bit of an implosion from 227 for 3, but runs came thick and fast in that period, so Yorkshire wouldn't be too disappointed with losing their wickets. Northamptonshire started well, getting to 163 for 2 after all their top four got starts, but two wickets from England Test bowler Matthew Hoggard started to turn the match. From then on, the Northamptonshire effort just stopped dead, as they lost five wickets for 24 runs to fall to 216 for 9. Steffan Jones and Jason Brown paired up for 21 for the last wicket, but it was too little, too late.", "Worcestershire's fast bowler Shoaib Akhtar had a field day despite serving up no balls on the first day at Northampton, but that was only the first day, and Northamptonshire came back to win the game. The match had started well enough for the hosts Northamptonshire, but a menacing spell from the Pakistani fast bowler reduced them from 150 for 2 to 173 for 8 – Matt Mason helping out with two wickets as well. Shoaib finished with six for 47, including twenty runs conceded due to no-balls – while Monty Panesar and Jason Brown rescued the hosts to 299 with a last-wicket stand of 62. Young wicket-keeper Steve Davies then made a career-best 95 in his sixth first-class game, which helped lift Worcestershire to 381, a lead of 82.", "After Welch's bowling had yielded two early catches to see Northamptonshire to 43 for 2, Australian Martin Love took centre stage. He slashed 34 fours to end the second day unbeaten on 159, an innings higher than the entire Northamptonshire first innings total, and the hosts closed the second day's play on 311 for 3, Usman Afzaal having added 59 from number four as well. Love added only 18 before he was lbw to Mohamed Sheikh, but half-centuries from David Sales and Riki Wessels, ensured that Northamptonshire could declare with a lead of 388, giving themselves five sessions to win the game. The weather forecast for the final day, however, had predicted rain, so Northamptonshire wanted to get in early. Spinners Jason Brown and Monty Panesar shared nine wickets, as Derbyshire battled out the third day to 204 for 9, but Australian Damien Wright wrapped up the innings by having Hunter bowled two balls into the fourth morning.", "Northamptonshire recorded their fourth win of the season thanks to their top order batting and their spin bowling. They had won the toss and batted, placing themselves well at 224 for 4, but the last six wickets yielded only 63 runs, and Lancashire seamer Dominic Cork could take three late wickets to end with four for 27. Northamptonshire were bowled out early on the second morning for 289, but immediately hit back, Damien Wright dismissing Lancashire's captain Mark Chilton for 0. In a bowling effort dominated by spinners – Jason Brown and Monty Panesar sharing 68 of the 94 overs bowled – Northamptonshire tugged away, and but for Stuart Law's 111, the hosts might have got a first innings lead. However, it was Lancashire who got a lead of 12, with Brown taking five for 113 from 36.3 overs.", "Northamptonshire spinners Jason Brown and Monty Panesar shared all ten Yorkshire wickets on the first day at Northampton. Yorkshire had won the toss and recorded a 66-run opening stand when the spinners first broke through, Panesar having Matthew Wood caught by Robin White. The rest was one of classic spin bowling – few runs and the occasional wicket – Panesar conceded just over one run an over (ending with figures of 27.5–11–32–5), and the average run rate for the innings was just above two. Former England all-rounder Craig White added 51 as Yorkshire were bowled out for 177. Early wickets from Deon Kruis reduced Northamptonshire to 34 for 2, but a three-hour stand of 220 across two days between Martin Love and Usman Afzaal took Northamptonshire to a lead of 77 with seven wickets in hand when Love fell for 95. Afzaal pushed on, making 157 before being dismissed by Kruis – who took five for 75 – and a 76-run partnership between Simon Crook and Panesar took Northamptonshire to 476 for 9 before the declaration came. Crook fell three short of a maiden first-class century, while Yorkshire leg spinner Mark Lawson was taken for 150 in 30 overs."]}, {"page": "Somerset County Cricket Club in 2005", "response": ["Somerset won the toss at Northampton and chose to bowl – and although they got the hosts Northamptonshire out in a day, Martin Love (166) and wicketkeeper Riki Wessels (son of Kepler) (102) made quick centuries to lift the hosts to 408. Conversely, however, two Northamptonshire batsmen batting at 4 and 5 perished for ducks to Richard Johnson. Somerset replied well, though, with 53 from opener Matthew Wood, but rash strokes gave wickets around everywhere as Somerset made 356 – admittedly only 52 behind. Off-spinner Jason Brown got six wickets for 112, just as many as he had taken before this game, while Ian Blackwell played a typical 59 off 77 balls.", "At Northampton, Andy Caddick served up an unusually economical spell, taking two for 12 in three overs despite two wides. That helped tie the hosts Northamptonshire Steelbacks down to 95 for 6 in 12 overs in the rain-shortened game, and with Graeme Smith and Keith Parsons at the crease and the score 55 for 1, things looked bright for Somerset Sabres. Two wickets from Jason Brown helped put the odds for a Northamptonshire win down, but Somerset prevailed, Parsons hitting the winning runs on the last ball as Somerset finished on 97 for 5."]}, {"page": "MCC University matches in 2005", "response": ["The first day of this game at Northampton saw Northamptonshire progress to 373 for 7 declared off only 69 overs. Kevin Innes top-scored with 80 off only 59 balls. The declaration left time for 23 more overs on the first day, in which Bradford/Leeds UCCE slumped to 60 for 5. The second day, Bradford/Leeds UCCE fared equally badly, being dismissed for 137. Northamptonshire chose to enforce the follow-on rather than opt for batting practice, and saw off Bradford/Leeds UCCE for 174 to win by an innings and 62 runs in two days. Spinners Monty Panesar and Jason Brown both got five wickets each in the match. (Cricinfo scorecard)"]}, {"page": "Leicestershire County Cricket Club in 2005", "response": ["On the third day, Leicestershire progressed to 339 all out, with Darren Robinson scoring 100. However, the innings was controversial, with three debatable decisions going against the visitors. First Robinson was given out caught, when the ball probably hit his forearm. Then HD Ackerman was out leg before to a delivery that looked high. Then, at 220 for 5 Aftab Habib edged Jason Brown low to Martin Love at first slip. Habib thought it had not carried, and Love and one umpire were not sure. The other umpire said he was out, so off Habib went. But he returned to confront Shafayat who taunted Habib on the dismissal. Northamptonshire progressed to 45 for 0 at close."]}, {"page": "Lancashire County Cricket Club in 2005", "response": ["Northamptonshire recorded their fourth win of the season thanks to their top order batting and their spin bowling. They had won the toss and batted, placing themselves well at 224 for 4, but the last six wickets yielded only 63 runs, and Lancashire seamer Dominic Cork could take three late wickets to end with four for 27. Northamptonshire were bowled out early on the second morning for 289, but immediately hit back, Damien Wright dismissing Lancashire's captain Mark Chilton for 0. In a bowling effort dominated by spinners – Jason Brown and Monty Panesar sharing 68 of the 94 overs bowled – Northamptonshire tugged away, and but for Stuart Law's 111, the hosts might have got a first innings lead. However, it was Lancashire who got a lead of 12, with Brown taking five for 113 from 36.3 overs."]}, {"page": "Yorkshire County Cricket Club in 2005", "response": ["Michael Lumb with 89 and Ian Harvey with 74 lifted Yorkshire to 270 all out at Headingley in the fourth quarter-final of the C&G Trophy. It was a bit of an implosion from 227 for 3, but runs came thick and fast in that period, so Yorkshire wouldn't be too disappointed with losing their wickets. Northamptonshire started well, getting to 163 for 2 after all their top four got starts, but two wickets from England Test bowler Matthew Hoggard started to turn the match. From then on, the Northamptonshire effort just stopped dead, as they lost five wickets for 24 runs to fall to 216 for 9. Steffan Jones and Jason Brown paired up for 21 for the last wicket, but it was too little, too late.", "Northamptonshire spinners Jason Brown and Monty Panesar shared all ten Yorkshire wickets on the first day at Northampton. Yorkshire had won the toss and recorded a 66-run opening stand when the spinners first broke through, Panesar having Matthew Wood caught by Robin White. The rest was one of classic spin bowling – few runs and the occasional wicket – Panesar conceded just over one run an over (ending with figures of 27.5–11–32–5), and the average run rate for the innings was just above two. Former England all-rounder Craig White added 51 as Yorkshire were bowled out for 177. Early wickets from Deon Kruis reduced Northamptonshire to 34 for 2, but a three-hour stand of 220 across two days between Martin Love and Usman Afzaal took Northamptonshire to a lead of 77 with seven wickets in hand when Love fell for 95. Afzaal pushed on, making 157 before being dismissed by Kruis – who took five for 75 – and a 76-run partnership between Simon Crook and Panesar took Northamptonshire to 476 for 9 before the declaration came. Crook fell three short of a maiden first-class century, while Yorkshire leg spinner Mark Lawson was taken for 150 in 30 overs."]}, {"page": "Worcestershire County Cricket Club in 2005", "response": ["Worcestershire's fast bowler Shoaib Akhtar had a field day despite serving up no balls on the first day at Northampton, but that was only the first day, and Northamptonshire came back to win the game. The match had started well enough for the hosts Northamptonshire, but a menacing spell from the Pakistani fast bowler reduced them from 150 for 2 to 173 for 8 – Matt Mason helping out with two wickets as well. Shoaib finished with six for 47, including twenty runs conceded due to no-balls – while Monty Panesar and Jason Brown rescued the hosts to 299 with a last-wicket stand of 62. Young wicket-keeper Steve Davies then made a career-best 95 in his sixth first-class game, which helped lift Worcestershire to 381, a lead of 82."]}, {"page": "Derbyshire County Cricket Club in 2005", "response": ["After Welch's bowling had yielded two early catches to see Northamptonshire to 43 for 2, Australian Martin Love took centre stage. He hit 34 fours in 177 – an innings lasting from lunch on day two until the morning session on day three, and with a higher number of runs than the entire Northamptonshire first innings total. Usman Afzaal added 59 from number four as well, and half-centuries from David Sales and Riki Wessels, ensured that Northamptonshire could declare with a lead of 388, giving themselves five sessions to win the game. Welch got no further wicket, but conceded 63 runs, while spinner Andy Gray got two wickets but at a cost of 65 runs per wicket. The weather forecast for the final day, however, had predicted rain, so Northamptonshire wanted to get wickets early. Spinners Jason Brown and Monty Panesar shared nine wickets on the third day, while Derbyshire made 204 from 99 overs (di Venuto and Welch both scoring 47), but Australian Damien Wright wrapped up the innings by having Hunter bowled two balls into the fourth morning."]}, {"page": "Twenty20 in England in 2005", "response": ["At Northampton, Andy Caddick served up an unusually economical spell, taking two for 12 in three overs despite two wides. That helped tie the hosts Northamptonshire Steelbacks down to 95 for 6 in 12 overs in the rain-shortened game, and with Graeme Smith and Keith Parsons at the crease and the score 55 for 1, things looked bright for Somerset Sabres. Two wickets from Jason Brown helped put the odds for a Northamptonshire win down, but Somerset prevailed, Parsons hitting the winning runs on the last ball as Somerset finished on 97 for 5."]}, {"page": "County Cricket Ground, Northampton", "response": ["The County Cricket Ground is known to be a venue which favours spinners, and in the last County Championship game of 2005, Northamptonshire's two spin bowlers Jason Brown and Monty Panesar took all 20 wickets for Northamptonshire."]}, {"page": "Billy Godleman", "response": ["In his next game, Godleman top-scored in the first innings, reaching 77 against Northamptonshire at Lord's. At that point he had passed 50 in all five innings he had played in first-class cricket, but his run came to an end in the second innings when he was lbw to Jason Brown for 40."]}, {"page": "Jason Brown", "response": ["Jason Brown may refer to:", "*Jason Brown (American football) (born 1983), American football player turned farmer", "*Jason Brown (baseball) (born 1974), American baseball coach", "*Jason Brown (cricketer) (born 1974), English cricketer", "*Jason Brown (footballer) (born 1982), Welsh international football goalkeeper", "*Jason Brown (figure skater) (born 1994), American figure skater", "*Jason Brown (writer) (born 1969), American writer", "*Colt Ford (born 1969), American musician who formerly golfed under the name Jason Brown"]}, {"page": "Brian Crump", "response": ["He was released at the end of his benefit year, 1972, but was still trundling away in club and over-50's cricket the best part of three decades later. His influence has been continued to be felt through his encouragement of Northamptonshire's former off-spinner and fellow Staffordshire boy Jason Brown."]}, {"page": "2005 Cheltenham & Gloucester Trophy", "response": ["Michael Lumb with 89 and Ian Harvey with 74 lifted Yorkshire to 270 all out at Headingley in the fourth quarter-final of the C&G Trophy. It was a bit of an implosion from 227 for 3, but runs came thick and fast in that period, so Yorkshire wouldn't be too disappointed with losing their wickets. Northamptonshire started well, getting to 163 for 2 after all their top four got starts, but two wickets from England Test bowler Matthew Hoggard started to turn the match. From then on, the Northamptonshire effort just stopped dead, as they lost five wickets for 24 runs to fall to 216 for 9. Steffan Jones and Jason Brown paired up for 21 for the last wicket, but it was too little, too late."]}, {"page": "List of Northamptonshire List A cricket records", "response": ["|Jason Brown || 136"]}, {"page": "List of Northamptonshire Twenty20 cricket records", "response": ["|align=left|1. Andrew Hall2. Jason Brown3. Andrew Hall"]}, {"page": "List of Northamptonshire County Cricket Club seasons", "response": ["|align=left|Jason Brown", "|align=left|Jason Brown"]}, {"page": "2005 County Championship", "response": ["|style=\"text-align:center;\"| 55 ||style=\"text-align:center;\"| 28.20 || Jason Brown || Northamptonshire"]}]}}