{"wiki_id": "http://www.wikidata.org/entity/Q6168037", "itemLabel": "Jaz Lochrie", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Jaz_Lochrie", "wikipedia_page": {"main": "Jaz Lochrie (born 18 April 1970) is a bass guitarist born in Paisley, Scotland, UK.", "link_mentions": [{"page": "Bad Company", "response": ["Paul Rodgers again rejoined Kirke in 2001 for a tour that kicked off in the US and included co-headlining dates with Styx and Billy Squier as special guest. Dave Colwell and Rick Wills took over for the departed Ralphs and Burrell. The tour did decent business then moved to the UK. The band secured some dates on the West Coast of the US in January 2002 to record a new live album and DVD, Merchants of Cool, recorded by Chris Mickle, Bud Martin & Justin Peacock and which featured the song \"Joe Fabulous\", which hit No. 1 on radio and the top 20 on Mainstream Rock Radio in the US in its debut week. The Merchants of Cool tour in 2002 once again featured Kirke and Rodgers as the only original members left. Colwell again took lead guitar and Jaz Lochrie, who had played live and recorded with Paul Rodgers from 1995 on, was on bass. Guest performers at the shows included former Guns N' Roses guitarist Slash and Neal Schon of Journey fame. After the 2002 tour, Bad Company went inactive once again as Rodgers returned to his solo career.", "On 6 May 2007, Robert Hart, Dave \"Bucket\" Colwell and Jaz Lochrie performed in a small pub in Surbiton for The Macmillan Cancer Trust. Performing as Rock and Roll Fantasy, they offered a show of Bad Company songs for an audience of a few hundred. They were joined by Mick Ralphs. Chris Grainger was the drummer.", "In 2008, \"Mick Ralphs' Bad Company\" toured in the following formation: Robert Hart, Mick Ralphs, Dave \"Bucket\" Colwell, Jaz Lochrie, Gary \"Harry\" James."]}, {"page": "Paul Rodgers", "response": ["In 1995 he formed a new band consisting of Jaz Lochrie on bass, Jimmy Copley on drums and Geoff Whitehorn on guitar. The band (The Paul Rodgers Band) toured extensively in Europe, US and in the UK until 1998 and released three albums – Now, Now and Live and Electric. Now charted internationally in the Top 40. The single \"Soul of Love\" remained in rotation on more than 86 US radio stations for six months but was not a sales success. His 1997 world tour included Russia, Japan, Canada, US, UK, Germany, France, Romania, Bulgaria, Israel, Brazil, Greece and Argentina."]}, {"page": "Jaz", "response": ["* Jaz Lochrie, Scottish musician"]}, {"page": "Psychoderelict", "response": ["* Jaz Lochrie"]}, {"page": "List of Scottish musicians", "response": ["*Jaz Lochrie, bass guitarist with Bad Company"]}, {"page": "In Concert: Merchants of Cool", "response": ["In Concert: Merchants of Cool is a live album and DVD by English hard rock band Bad Company. It was recorded principally at The Paramount Theater, Denver, Colorado and The Grove of Anaheim, Anaheim, California, in January 2002. It features hits from both Bad Company and precursor band Free as well as two new studio tracks, \"Joe Fabulous\" and \"Saving Grace\". It is their only album not to feature guitarist Mick Ralphs. Longtime session guitarist  Dave “Bucket” Colwell, who had appeared on the three previous studio albums, plays in Mick’s place. Additionally, Jaz Lochrie plays bass instead of Boz Burrell. The band covers two songs from the Beatles, \"Ticket to Ride\" and \"I Feel Fine\", as well as one from Paul Rodgers' and Simon Kirke's former band Free, \"All Right Now\".", "*Jaz Lochrie – bass, background vocals"]}, {"page": "Now & Live", "response": ["*Jaz Lochrie - bass, backing vocals", "*Jaz Lochrie - bass"]}, {"page": "Live: The Loreley Tapes", "response": ["*Jaz Lochrie - bass"]}, {"page": "Dave Colwell", "response": ["Colwell started recording his first solo album Guitars, Beers & Tears in 2008, and it was released in 2010. There were a number of Colwell's associates playing on this album, including Steve Conte (New York Dolls), Adrian Smith (Iron Maiden), Robert Hart (The Jones Gang), Edwin McCain, Bekka Bramlett, Danny Bowes (Thunder), Spike (The Quireboys) and Jaz Lochrie."]}, {"page": "Now (Paul Rodgers album)", "response": ["*Jaz Lochrie - bass, backing vocals"]}, {"page": "Jaz lochrie", "response": ["#REDIRECT Jaz Lochrie "]}]}}