{"wiki_id": "http://www.wikidata.org/entity/Q6163251", "itemLabel": "Jason Perry", "itemDescription": "English rock singer, songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Jason_Perry_(singer)", "wikipedia_page": {"main": "Jason Perry (born 29 December 1969) is a Grammy Award-winning English record producer and singer/songwriter. He is the lead vocalist of the Suffolk based band alternative rock 'A'. He has an identical twin brother, Adam, and a younger brother, Giles, both of whom are also members of the band. Recently, Perry has produced albums by Greywind, Fatherson, Don Broco, Molotov, McBusted, Matthew P, Ivyrise, The Blackout, Kids in Glass Houses, Get Cape. Wear Cape. Fly, Futures, Matt Willis and McFly.", "link_mentions": [{"page": "So Long, Astoria", "response": ["Early in the writing process for the record, Roe found a book that gave him the theme for the album. The book, which was Go Now by Richard Hell, contained a chapter \"where he had a quote that said memories are better than life ... I wanted this record to portray, that life is only as good as the memories we make.\" Roe said the group \"focus[ed] on writing good songs [and] straightforward rock songs\". Musically, the album's sound has been described as pop punk, pop rock, punk rock and rock, drawing comparison to Blink-182, Green Day, Good Charlotte, New Found Glory, Lit and A, with Roe sounding like A frontman Jason Perry. All of the songs were written by Roe, except for \"The Hero Dies in This One\" and \"All You Can Ever Learn Is What You Already Know\" by Roe, Collura, Davenport and Knapp, and \"The Boys of Summer\" by Don Henley and Michael Campbell."]}, {"page": "A (band)", "response": ["A released their fourth album, Teen Dance Ordinance (TDO), on 27 June 2005. The album had been recorded two years earlier, but was heavily delayed due to Jason Perry's illness and disputes with the record company. It featured a more straight rock sound and displayed an almost complete absence of the keyboards and sampling that marked the early sound of the band. Unlike their last two albums, Teen Dance Ordinance was not released in the US. Hollywood Records agreed early on to release it in the US, but ultimately did not.", "Following the release of Teen Dance Ordinance in 2005, the band worked on other projects. Jason Perry spent time writing, recording, and touring with Matt Willis, formerly of Busted, and has now become a successful producer, working with the likes of the Blackout, Kids in Glass Houses, and McFly. Adam Perry and Daniel P Carter briefly became full-time members of the Bloodhound Gang: Perry replaced drummer Willie the New Guy in 2005, and Carter replaced guitarist Lupus Thunder in 2009.", "Carter continued writing material with Jason Perry and artists such as McFly, as well as playing bass in Matt Willis' band for his first album. He also plays guitar and lead vocals in hardcore punk band, Hexes. He has hosted BBC Radio 1's Rock Show since 25 September 2006.", "When questioned at the Download Festival in 2007, Daniel Carter said the band would be reuniting for a \"few shows\" at the end of the year. In a 2008 interview, Jason Perry explained the hiatus and expressed how much he had enjoyed being in the band, reiterating the desire to record and tour again in the future.", "* Jason Perry – lead vocals (1993–2005, 2008–present)"]}, {"page": "Teen Dance Ordinance (album)", "response": ["Due to many delays in the release of the album, which consisted of the label shelving the album for two years after recording was already completed in 2003 and Jason Perry experiencing illness, the band already were out of general public interest due to the long time they were away from releasing material. This meant the album was given very little promotional attention by the label and media, meaning it only charted at #95 in the UK charts and the band was dropped by Warner in October as a result.  After the failure of the album, the band broke up until reforming in 2008. To date, this is the band's final album."]}, {"page": "Buttons (The Pussycat Dolls song)", "response": ["\"Buttons\" is a song by American girl group the Pussycat Dolls from their debut studio album, PCD (2005). It was written by Sean Garrett, Jamal Jones, Jason Perry and group member Nicole Scherzinger and produced by the former two alongside Ron Fair. A remix version featuring American rapper Snoop Dogg was released as a digital download on April 11, 2006, as the album's fourth single. It is a hip hop-influenced pop and R&B track that features synthesizers and a Middle Eastern rhythm, with the group pleading a reluctant man to help them undress whilst adopting a submissive stance.", "\"Buttons\" was written and produced by Sean Garrett and Jamal \"Polow Da Don\" Jones with additional writing by Jason Perry and the group's lead singer Nicole Scherzinger and additional production by Ron Fair. According to Garrett, \"Buttons\" was conceived in a short amount of time, with Scherzinger in mind saying, \"[she] is very sexy so the concept of loosening up her buttons,—every guy would want that and women wouldn't have a problem with guys loosening up their buttons.\" Moreover, he credits PCD executive producer Jimmy Iovine for \"[pushing] me to be creative and the more creative I am, the more he likes it.\" Fair and Young Smoke handled the vocal and additional production respectively with Tal Herzberg being credited as a co-producer. Herzberg also operated Pro Tools and engineering along with J.D. Andrew and Mike \"Angry\" Eleopoulos with the assistance of Ariel Chobaz.", "* Jason Perry – songwriting", "Category:Songs written by Jason Perry (singer)"]}, {"page": "Please, Please/Don't Stop Me Now", "response": ["\"Please, Please\" was written by McFly and Jason Perry. The song is about actress Lindsay Lohan because the lyrics mention a girl named Lindsay with red hair and green eyes, like Lohan, and the nurse in the video is named Lindsay Allbright while, in the film Just My Luck, Lindsay's on-screen character is called Ashley Allbright. A recurring line in the song is \"Please, please, Lindsay, please\". While filming Just My Luck, tabloids published articles reporting that McFly drummer Judd had a romantic relationship with her. Jones was unsure, saying, \"He had a dream about it but thought it actually happened!\" Tom Fletcher revealed on the DVD single that it was the most fun video shoot other than \"5 Colours in Her Hair\". \"Don't Stop Me Now\" is a cover of Queen's 1978 single Don't Stop Me Now\", written by Freddie Mercury.", "Category:Songs written by Jason Perry (singer)"]}, {"page": "Something's Going On (song)", "response": ["Category:Songs written by Jason Perry (singer)"]}, {"page": "Rockin' Like Dokken", "response": ["All music written by A. All lyrics written by Jason Perry; except \"Just Like Paradise\" music and lyrics by Brett Tuggle and David Lee Roth.", "*Eds and Jason Perry - mixing (1-5)", "*Jason Perry - film editing (7)"]}, {"page": "49th Annual Grammy Awards", "response": ["**Johntá Austin, Mary J. Blige, Bryan-Michael Cox & Jason Perry, songwriters", "**Johnta Austin, Mary J. Blige, Bryan-Michael Cox & Jason Perry songwriters"]}, {"page": "Motion in the Ocean", "response": ["Category:Albums produced by Jason Perry"]}, {"page": "Star Girl (song)", "response": ["\"Star Girl\" was written by McFly, Jason Perry, Julian Emery and Daniel P. Carter. The single features a live recording of \"Silence is a Scary Sound\" from the Wonderland Tour 2005 DVD. \"Silence is a Scary Sound\" was written by McFly bassist Dougie Poynter when he was 14 years old. The single also includes the first track from the Motion in the Ocean album, \"We Are the Young\". The song was inspired by a dream Tom Fletcher had, about falling in love with an alien woman. The song was originally called \"Good Night\", but the band felt the lyrics didn't fit. Tom had a dream about writing a massive, Westlife style song written about falling in love with an alien woman so he decided to replace the \"Good Night\" lyrics with the new lyrics, hoping it would be a bigger success than the song he wrote in his dream.", "Category:Songs written by Jason Perry (singer)"]}, {"page": "Air Guitar (song)", "response": ["\"Air Guitar\" is the debut single by English pop rock supergroup McBusted. It was written by Tom Fletcher, James Bourne, Matt Willis and Steve Robson, and produced by Robson and Jason Perry. The song was released on 23 November 2014 through Island Records as the lead single from the band's self-titled debut studio album, McBusted (2014)."]}, {"page": "Baby's Coming Back/Transylvania", "response": ["It was originally announced that \"Transylvania\", written by Tom Fletcher and Dougie Poynter and produced by Jason Perry, would be released by itself, before the announcement of a further double A-side was made on 20 March 2007. \"Baby's Coming Back\" is a cover of the 1991 Jellyfish song. The pipe organ introduction to \"Transylvania\" is the opening of Johann Sebastian Bach's Toccata and Fugue in D minor."]}, {"page": "The Union of Souls", "response": ["* Jason Perry- Vocals"]}, {"page": "Exit Stage Right", "response": ["All songs written by Jason Perry", "Category:Albums produced by Jason Perry"]}, {"page": "Radio:Active", "response": ["*Jason Perry – guitar, backing vocals, producer, executive producer", "Category:Albums produced by Jason Perry"]}, {"page": "Daniel P. Carter", "response": ["In 2005 Carter teamed up with old friend and established songwriter Julian Emery and fellow 'A' member Jason Perry, and formed \"Collective\", a songwriting and production team. Collective is managed by Jason Perry's brother Adam. Their first project was co-writing and producing the debut album from Matt Willis, Don't Let It Go to Waste. Carter co-wrote \"Luxury\", \"Who You Gonna Run To\", \"Get Bored\", \"Not Over\" and \"Whats the Point\". The album reached gold status and included three top 40 UK singles."]}, {"page": "The Best in Town", "response": ["In August 2008, vocalist Sean Smith said the band had written six new songs, and were aiming to record a new album later in the year. They were in the process of discussing with a few labels. Following this, the group went on a UK tour in September and October, with a handful of Christmas shows in December. They recorded at Sonic Ranch Studios in Alameda, Texas with producer Jason Perry; he and Mike Morgan served as engineers. John Mitchell mixed the album at Outhouse Studios in Reading, UK. Tom Baker mastered the album at Precisions Masters in Los Angeles, California.", "The song \"Save Our Selves\" came about the Blackout had an untitled song for the  untitled new album in 2008. They were not happy with the way it sounded, but Producer Jason Perry thought it resembled a song of his own, which he had written with friend and former bandmate Dan P Carter, and was initially given to the band \"Area\" that they were both working with, it was titled \"Robot\". Both song ideas were put together to produce \"Save Our Selves (The Warning)\", which ended up being the band's most commercial single from the album.", "* Jason Perry – producer, engineer, mixing", "Category:Albums produced by Jason Perry"]}, {"page": "Julian Emery", "response": ["In 2005, he developed a partnership with the former lead singer of British rock band, A, Jason Perry. They co-wrote and produced Don't Let It Go To Waste, the solo album by Matt Willis, formerly of Busted in 2006. The album produced one top 10 and two top 20 singles that year. The team co-wrote and produced Motion In The Ocean by McFly, which went platinum in the UK and included three No 1 singles including Please Please, Stargirl and Transylvania.", "|Matt Willis, Jason Perry, John Kwiecinski", "|Matt Willis, Jason Perry", "|Matt Willis, Jason Perry", "|Matt Willis, Jason Perry", "|Matt Willis, Jason Perry,Rick Parfitt Junior", "|Matt Willis, Jason Perry", "|Matt Willis, Jason Perry", "|Matt Willis, Jason Perry", "|Matt Willis, Jason Perry", "|Jason Perry, Daniel P. Carter, Tom Fletcher, Daniel Jones", "|Jason Perry, Daniel P. Carter, Tom Fletcher, Daniel Jones", "|Jason Perry, Daniel P. Carter, Tom Fletcher, Daniel Jones", "|Jason Perry, Daniel P. Carter, Tom Fletcher, Daniel Jones", "|Jason Perry, Daniel P. Carter, Tom Fletcher, Daniel Jones", "|Jason Perry, Daniel P. Carter, Tom Fletcher, Daniel Jones"]}, {"page": "Jason Perry", "response": ["Jason Perry may refer to:", "*Jason Perry (American football) (born 1976), former American football safety in the National Football League", "*Jason Perry (Arena football) (born 1984), American football player who plays for the Jacksonville Sharks", "*Jason Perry (baseball) (born 1980), former Major League Baseball outfielder", "*Jason Perry (footballer) (born 1970), Welsh footballer", "*Jason Perry (singer) (born 1969), English singer-songwriter and member of A", "*Jason Perry, former member of Plus One"]}, {"page": "Above the Noise", "response": ["* Jason Perry – producer, executive producer, drums (on track 2,6,8), guitar (on track 2,6)", "Category:Albums produced by Jason Perry"]}, {"page": "Hope (The Blackout album)", "response": ["The album was first announced in mid-2010 that the band had begun work on the album. The album was recorded at the end of 2010 and was funded by donations by fans on the website PledgeMusic. Recording was held at AIR Studios, Angelic Studios, and The Yard, with producer Jason Perry. Adam Noble acted as engineer, with additional engineering from Perry; the pair  did Pro Tools editing. An assistant engineer aided them at each studio: Fiona Cruickshank (AIR), Tom Fuller (Angelic), and Mark Allaway (The Yard). Due to drummer Gareth Lawrence does not drum on the album, his place was taken by drummers Phillip Jenkins of Kids in Glass Houses and Tom Winch of Hexes. John Mitchell mixed all of the recordings, before they were mastered by Tom Baker at Precision Mastering.", "All music and lyrics by the Blackout and Jason Perry, except for \"Higher & Higher\" by the Blackout, Perry, and Hyron Fenton.", "* Jason Perry – producer, additional engineering, Pro Tools editing"]}, {"page": "Start the Party (album)", "response": ["Start the Party is the fourth and final studio album by Welsh post-hardcore band the Blackout. It was released by Cooking Vinyl on 21 January 2013. Following the touring cycle for their third studio album, Hope (2011), the band began writing material for their next album. They recorded the album with A frontman Jason Perry acting as producer. It revolves around party-going, having received comparisons to the output of the Beastie Boys, and the guitar work of the Foo Fighters and Papa Roach.", "Spurred on by the positive reception of their touring, the Blackout decided to incorporate this sensation into their new music. They aimed to release another album by September or October 2012. The band recorded with A frontman Jason Perry, who served as producer, and engineer Michael Morgan. John Mitchell mixed the recordings and Tom Baker mastered them at Precision. The Blackout initially planned to feature musicians Andrew W.K. and Wes Borland of Limp Bizkit on the album. Vocalist Sean Smith said W.K. \"doesn't party hard enough for The Blackout\", while Borland's guitar solo was not required when the band realised they could use vocals instead.", "Track listing per booklet. All recordings produced by Jason Perry.", "* Jason Perryproducer", "Category:Albums produced by Jason Perry"]}, {"page": "Emma Blackery", "response": ["Jason Perry produced Blackery's fourth EP, Sucks to Be You, which was released in 2016. Its title track peaked at number 85 on the Scottish Singles Chart. On 4 April 2016, Blackery announced that she would join pop punk band Busted on their Pigs Can Fly tour. \"Sucks to Be You\" was the runner-up for the first Summer in the City Song of the Year award. After touring with Busted, Blackery toured on her own and performed her music at other YouTube events."]}, {"page": "Jason Perry (British singer)", "response": ["#REDIRECT Jason Perry (singer)"]}]}}