{"wiki_id": "http://www.wikidata.org/entity/Q6163583", "itemLabel": "Jason Sutton", "itemDescription": "Royal Air Force officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jason_Sutton", "wikipedia_page": {"main": "Jason Paul Sutton, OBE, is a Royal Air Force Regiment officer who was appointed Officer of the Order of the British Empire for his actions whilst serving in Iraq in 2007.\nSutton was born in Reading, Berkshire in 1966 and joined the RAF Regiment in 1989 after completing Initial Officer Training at RAF College Cranwell.\nHe served as a junior officer on No. 20 Sqn RAF Regiment and No. 3 Sqn RAF Regiment, and as Station Regiment Officer at RAF Cranwell.  He has been Officer Commanding on the Junior Regiment Officers' Course at RAF Honington and Second-in-Command of The Queen's Colour Squadron.\nPromoted to squadron leader in 2001, he was SO2 in the RAF Ceremonial Office whilst it was based at RAF Bentley Priory.  Whilst in the Ceremonial Office, Sutton was involved in organising ceremonial occasions including the unveiling of the Battle of Britain Monument in London, Service of Thanksgiving and Rededication on Battle of Britain Sunday, Annual Church Service of the RAF, 80th Anniversary of the Royal Auxiliary Air Force, Memorial Service for HRH Princess Alice, the Duchess of Gloucester the RAF element to the Lord Mayor's Show and the RAF element at all the Remembrance weekend events, including Royal British Legion Festival of Remembrance.\nSutton then assumed command of No. 1 Sqn RAF Regiment in March 2006. He has served on operations in Northern Ireland, Georgia, East Timor, Afghanistan and Iraq.\nHis citation reads:\n\nAs Officer Commanding Number 1 Squadron RAF Regiment, Squadron Leader Sutton displayed outstanding leadership in maintaining the operational efficiency of his Squadron during its 6-month operational tour at Basrah Contingency Operating Base, from April to September 2007.  The Squadron’s operational role was made especially challenging due to incessant attacks from enemy insurgents, with over 800 rockets being fired at the Base during the Squadron’s tenure, resulting in 3 Squadron personnel being killed, and a number being seriously injured. In addition, the Squadron suffered a further fatality during an extended fire-fight with insurgents in Al Wake.\nFor the outstanding leadership of his Squadron over a relentless 6-month operational detachment, Squadron Leader Sutton is appointed as an Officer of the Most Excellent Order of the British Empire.\nSutton was promoted to wing commander in the Operational Support Branch of the RAF on 1 July 2008.\n\n", "link_mentions": [{"page": "Sutton (surname)", "response": ["*Jason Sutton OBE (born 1966), Royal Air Force Regiment Officer"]}, {"page": "Jason sutton", "response": ["#REDIRECT Jason Sutton "]}, {"page": "House!", "response": ["House! is a 2000 British comedy film written by Eric Styles and Jason Sutton and directed by Julian Kemp. The film stars Kelly Macdonald, Freddie Jones, Miriam Margolyes and Jason Hughes.", "Derek Elley of Variety called House! an \"Ealing-style light comedy\", writing that the film was \"helmed with impressive technical finesse\" by director Julian Kemp\" and \"propelled by a knockout performance from Kelly Macdonald\".  Praising Jason Sutton's script, he wrote \"none of this would have worked if the characters were simply cutouts and the thesps just mugging along in colorful accents. But Sutton's script, which also makes room for a variety of smaller roles, allows the protags to grow and isn't, as becomes clear later on, simply about winning.\""]}]}}