{"wiki_id": "http://www.wikidata.org/entity/Q6178478", "itemLabel": "Jennifer Johnston", "itemDescription": "singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jennifer_Johnston_(mezzo-soprano)", "wikipedia_page": {"main": "Jennifer Johnston is an English operatic mezzo-soprano. Born in Liverpool, she studied law at the University of Cambridge and worked in London chambers as a barrister before studying opera at the Royal College of Music (RCM). \nA former BBC New Generation Artist, she made her professional debut as Humperdinck's Hänsel for Scottish Opera, followed by her international debuts at the Aix-en-Provence Festival as Dido in Purcell’s Dido and Aeneas, and at the Salzburg Festival as Carmi in Mozart's La Betulia Liberata; a performance which was recorded and released on DVD by Deutsche Grammophon. She is particularly associated with the Bayerische Staatsoper and its distinguished musical director Kirill Petrenko, where her roles have included Second Norn, Roßweise, Floßhilde, Hedwige and La Ciesca. She has appeared in opera at the Teatro alla Scala as Mrs Grose/The Turn of the Screw (Britten) and Gaia/CO2 (Batistelli), and at the Salzburg Festival as Carmi/La Betulia Liberata (Mozart), Lady de Hautdesert/Gawain (Birtwistle), and Leda/Die Liebe Der Danae (Strauss).\nA prolific concert performer, she has performed with many of the world's greatest orchestras and conductors, including Jocaste in Stravinsky's Oedipus Rex (Sir John Eliot Gardiner/Berlin Philharmonic & London Symphony Orchestras, released as an LSO Live disc), Beethoven’s Missa Solemnis (Sir John Eliot Gardiner/Orchestre Revolutionnaire et Romantique at the BBC Proms and on disc), Mahler’s Second Symphony (De la Parra/London Philharmonic Orchestra), Mahler's Third Symphony (Welser-Möst/Cleveland Orchestra, Zinman/Orchestre National de Lyon), Elgar's Sea Pictures (Tate/Hamburg Symphony Orchestra), Elgar’s The Dream of Gerontius (Brabbins/BBC Scottish Symphony Orchestra), Verdi's Requiem (Gardner/Bergen Philharmonic Orchestra, Slatkin/Orchestra National de Lyon), Schumann’s Das Paradies und die Peri (Gatti/Accademia Di Santa Cecilia), Adès's Totentanz (Adès/Royal Concertgebouw Orchestra, Harding/Swedish Radio Symphony Orchestra), and Pasqualita in Adams' Doctor Atomic (Adams/BBC Symphony Orchestra, recorded for Nonesuch). \nShe made her solo recital debut at the Wigmore Hall accompanied by Joseph Middleton and broadcast live on BBC Radio 3. She is a founder member of The Prince Consort, with whom she has recorded for Linn Records, and has appeared in recital at Wigmore Hall, the Concertgebouw and the Aldeburgh Festival. Her extensive discography includes Anthony Payne's arrangement of Vaughan Williams's Four Last Songs with the BBC Symphony Orchestra under Martyn Brabbins for Albion Records, which she premiered at the BBC Proms (Vänska/BBCSO) and which was nominated for a Grammy Award.", "link_mentions": [{"page": "Merchant Taylors' Girls' School", "response": ["*Jennifer Johnston, mezzo soprano"]}, {"page": "Four Last Songs (Vaughan Williams)", "response": ["In 2013, Anthony Payne orchestrated all four of the songs; the work premiered on 4 September 2013 for the BBC Proms with Osmo Vänskä conducting, soprano Ruby Hughes and mezzo-soprano Jennifer Johnston."]}, {"page": "Saint Peter's Singers of Leeds", "response": ["The members were privileged to have been invited in February 2014 by Leeds Philharmonic Society to provide the semi-chorus for the \"Phil's\" performance of Elgar's The Dream of Gerontius at Leeds Town Hall. Also participating was the Bournemouth Symphony Orchestra and Sheffield Philharmonic Chorus under the direction of Leeds Phil Music Director Dr David Hill. The organist was Darius Battiwalla and the vocal soloists Jennifer Johnston, Andrew Kennedy and Keith Brynmor John."]}, {"page": "Jennifer Johnson (English mezzo-soprano)", "response": ["#REDIRECT Jennifer Johnston (mezzo-soprano)"]}, {"page": "BBC Radio 3 New Generation Artists scheme", "response": ["* Jennifer Johnston (mezzo-soprano - UK)"]}, {"page": "Jennifer Johnston (English mezzo-soprano)", "response": ["#REDIRECT Jennifer Johnston (mezzo-soprano)"]}, {"page": "Alisdair Hogarth", "response": ["Hogarth has performed with  Barbara Bonney and Thomas Allen. He is a accompanist to many emerging young artists, such as Jacques Imbrailo, Anna Leese, Jennifer Johnston, Tim Mead, Andrew Staples, and Elisabeth Meister. In commercial spheres, he has worked with Katherine Jenkins, Blake, Lesley Garrett, All Angels, Amici Forever, and X Factor winner Joe McElderry. He has appeared and performed onscreen in the films The Duchess and The Young Victoria."]}, {"page": "Joseph Middleton", "response": ["* Cheryl Frances-Hoad Songs: with Jennifer Johnston (CHR 2014)"]}, {"page": "Jennifer Johnston (disambiguation)", "response": ["Jennifer Johnston may refer to:", "* Jennifer Johnston (born 1930), Irish novelist", "* Jennifer Johnston (mezzo-soprano), English opera singer", "* Jennifer Johnston (politician), American politician from Alaska"]}]}}