{"wiki_id": "http://www.wikidata.org/entity/Q6175921", "itemLabel": "Jeffrey Cuthbert", "itemDescription": "British politician (born 1948)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeffrey_Cuthbert", "wikipedia_page": {"main": "Jeffrey Hambley Cuthbert (born 4 June 1948) is a Welsh politician serving as Gwent Police and Crime Commissioner since 2016. Cuthbert served as a Labour Party member of the National Assembly for Wales for Caerphilly from 2003 to 2016. He began his career in the mining industry and later worked for the Welsh Joint Education Committee (as it was then) as Head of the Asset to Industry Unit.\nCuthbert was born in Glasgow to a Welsh mother and Scottish father, but brought up in Cardiff, where he attended Whitchurch County Secondary Modern followed by studying mining engineering at University College, Cardiff. He joined the Labour Party in the mid-1960s. As a mining engineer he worked at Markham and Oakdale pits.\nA member of the Militant group from the mid-60s to early-80s, Cuthbert later became Chair of Caerphilly Constituency Labour Party. He left the mining industry to develop qualifications for Modern Apprenticeships with WJEC, and became a Corporate Member of the Chartered Institute of Personnel and Development. He was a governor of the Lewis School, Pengam, and served as principal of a part-time Adult Education Centre at Aberbargoed.\nIn the 2003 election to the National Assembly for Wales, Cuthbert was selected at the last minute to replace Ron Davies who stood down following a sex scandal. He increased the Labour majority in the Caerphilly constituency.\nCuthbert was appointed Chair of the Objective One Programme Monitoring Committee for Wales in 2004, and subsequently Chair of its All-Wales successor body in 2007. He is a Chair of the Assembly's Cross-Party Groups on Healthy Living and the Built Environment; and is co-Chair of the Cross-Party Group on Beer and the Pub. As an active trade unionist, he is co-ordinator of the UNITE Group of Labour Assembly Members. At the 2007 election he successfully defended his seat after Ron Davies, challenged to regain it as an Independent candidate.\nAt the 2011 Welsh General Election, Cuthbert successfully defended his seat once again, after another challenge from Davies, who this time stood for Plaid Cymru.\nIn March 2012 he was appointed Deputy Minister for Skills and Technology and was joined the Cabinet in June 2013 as Minister for Communities and Tackling Poverty in the Welsh Government.In September 2014 he announced his decision to stand down as Caerphilly AM at the 2016 elections. Because of that, he also stood down from the Welsh Government Cabinet.In May 2016 Cuthbert was elected as Gwent Police and Crime Commissioner.", "link_mentions": [{"page": "Newport, Wales", "response": ["| style=\"text-align:center;\"|Police and crime commissioner|| style=\"text-align:center;\"| Gwent Police: Jeffrey Cuthbert, Labour Party, first elected 2016"]}, {"page": "Cardiff University", "response": ["*Jeffrey Cuthbert, Gwent Police and Crime Commissioner, MS for Caerphilly and  Welsh Government Minister for Communities and Tackling Poverty"]}, {"page": "Co-operative Party", "response": ["|Jeffrey Cuthbert || Gwent"]}, {"page": "Brecon and Radnorshire (UK Parliament constituency)", "response": ["The Labour candidate, Chris Mann, won the selection over future AMs Carwyn Jones and Jeffrey Cuthbert, and future AM and MP Peter Law."]}, {"page": "South Wales East (Senedd electoral region)", "response": ["|rowspan=\"5\"|Jeffrey Cuthbert(Lab)"]}, {"page": "Caerphilly (Senedd constituency)", "response": ["| Jeffrey Cuthbert "]}, {"page": "Jeff Cuthbert", "response": ["#REDIRECT Jeffrey Cuthbert"]}, {"page": "Members of the 3rd National Assembly for Wales", "response": ["| Jeffrey Cuthbert"]}, {"page": "Cuthbert (surname)", "response": ["*Jeffrey Cuthbert (born 1948), Welsh politician, member of the National Assembly of Wales"]}]}}