{"wiki_id": "http://www.wikidata.org/entity/Q6172307", "itemLabel": "Jeannette Sinclair", "itemDescription": "singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeannette_Sinclair", "wikipedia_page": {"main": "Jeannette Sinclair (born 1928) is an English soprano. She sang a variety of roles as a principal soprano at the Royal Opera House, Covent Garden and at Glyndebourne Festival Opera, during the 1950s and 1960s. Her work for the BBC encompassed opera, oratorio and many recitals of lieder, English song and French chanson, light music and appearances at the BBC Henry Wood Promenade concerts, 1960–9.", "link_mentions": [{"page": "On Such a Night (1955 film)", "response": ["* Jeannette Sinclair as Barbarina"]}, {"page": "Siegfried discography", "response": ["|Wolfgang Windgassen, Birgit Nilsson, Peter Klein, Hans Hotter, Frederick Dalberg, Jeannette Sinclair"]}, {"page": "Dido and Aeneas discography", "response": ["|Claire WatsonJeannette SinclairPeter PearsArda Mandikian"]}, {"page": "Malcolm Sargent discography", "response": ["**The Mikado: Owen Brannigan, Richard Lewis, Geraint Evans, Ian Wallace, John Cameron, Elsie Morison, Marjorie Thomas, Jeannette Sinclair, Monica Sinclair, Pro Arte Orchestra, Glyndebourne Festival Chorus, HMV, 1957"]}, {"page": "Martin Isepp", "response": ["Isepp was born in Vienna, the son of , who was an artist and art restorer, and his wife, a singer and teacher Hélène Isepp, née Hammerschlag, whose pupils after she moved to Britain included Janet Baker, Bernadette Greevy, Heather Harper and Jeannette Sinclair.\"Hélène Isepp\", Oxford Music Online, Oxford University Press, retrieved 27 June 2014  In 1938 the Isepps fled from Vienna to Britain, where Sebastian secured posts at the National Gallery in London and the Ashmolean Museum in Oxford.Millington, Barry. \"Martin Isepp : Piano accompanist to many great singers\", The Guardian, 17 February 2012Martin Isepp – Musician, accompanist, teacher and conductor who was a pivotal figure at Glyndebourne and Aldeburgh\", The Times, 3 January 2012, p. 46"]}]}}