{"wiki_id": "http://www.wikidata.org/entity/Q6173204", "itemLabel": "Jeff Allen", "itemDescription": "English rock and blues session drummer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeff_Allen_(musician)", "wikipedia_page": {"main": "Jeffrey Allen (born 23 April 1946, Matlock, Derbyshire) is an English rock and blues session drummer.  Allen is best known for his work with East of Eden, Snowy White, Bonnie Tyler, Mick Taylor and Van Morrison. \nHe is not to be confused, although in many listings often is, with the similarly named former drummer with the British glam rock outfit, Hello, whose brother is Ultravox's Chris Cross.", "link_mentions": [{"page": "Jeff", "response": ["* Jeff Allen, English session drummer"]}, {"page": "First Base (album)", "response": ["*Jeff Allen - drums on \"The Runaways\""]}, {"page": "Babe Ruth (band)", "response": ["* Jeff Allen (born Jeffrey Allen, 23 April 1946, Matlock, Derbyshire) – drums (1970–1971)"]}, {"page": "East of Eden (band)", "response": ["Original guitarist Nicholson left in May 1970. The band broke up in 1978 having undergone various changes in membership. Important members in late line-ups included vocalist Al Read; bassist Terence 'Terry' Brace; bassist Andy Sneddon; bassist/vocalist David 'Davy' Jack (b. 24 January 1940, Glasgow, Strathclyde, Scotland); drummer Jeff Allen (b. Jeffrey Allen, 23 April 1946, Matlock, Derbyshire – from June 1970); bassist/vocalist Martin Fisher (b. 1947, Kingston-upon-Thames, Surrey); violinist Joe O'Donnell (from March 1973); Alan 'Al' Perkes (b. 26 May 1949, Bow, east London); and guitarist Garth Watt-Roy (b. Garth Philip Watt-Roy, December 1947, Bombay, India – from February 1972).", "*Jeff Allen - drums", "*Jeff Allen - drums", "*Jeff Allen - drums", "*Jeff Allen - drums", "*Jeff Allen - drums", "*Jeff Allen - drums", "*Jeff Allen - drums", "*Jeff Allen - drums"]}, {"page": "Grace and Danger", "response": ["*Jeff Allen - drums on Disc 1, tracks 12-14"]}, {"page": "Well Kept Secret (John Martyn album)", "response": ["*Jeff Allen - drums"]}, {"page": "The Blistering Sun", "response": ["* Jeff Allen – bass on 2-4 6 7 11 12 14"]}, {"page": "Arthur's Club-Geneve 1995", "response": ["*Jeff Allen - drums, percussion"]}, {"page": "Alan Mair", "response": ["Mair grew up in the Glasgow area. He began playing guitar at about age 13 and gained experience in various bands during the 1960s. In 1962, Mair and Eddie Campbell formed the Glasgow band The Beatstalkers. The line-up included Davie Lennox on vocals, Eddie Campbell on guitar, Mair on bass and 'Tudge' Williamson on drums (replaced by Jeff Allen). Later Ronnie Smith joined the group on rhythm guitar. Under the management of Joe Gaffney, the band went on to become Scotland's \"top group\" at the time. They were called the \"Scottish Beatles\" by the local press because of the screaming and riots that occurred anywhere they made an appearance; although the band toured England and Europe many times, had a 6-week sell-out residency at the famous Marquee Club and performed on the TV show Ready Steady Go!, they never achieved the same dizzy heights of success as they did in Scotland. The band signed a recording contract with Decca Records. Their records sold thousands of copies in Scotland, but with only two chart shops in Scotland their sales made no impact on the UK charts. They split in 1969 after their van was stolen with all their equipment in it."]}, {"page": "Goodbye to the Island", "response": ["*Jeff Allen, Liam Genockey - drums"]}, {"page": "Voices (Murray Head album)", "response": ["*Jeff Allen - drums"]}, {"page": "Goldtop: Groups & Sessions '74–'94", "response": ["*Jeff Allen – drums (tracks 4, 9, 15)"]}, {"page": "Change My Life", "response": ["#\"Change My Life\" (Snowy White, Kuma Harada, Graham Bell, Jeff Allen) – 6:25", "*Jeff Allen – drums, percussion"]}, {"page": "Jeffrey Allen", "response": ["*Jeff Allen (musician) (born 1946), English drummer", "*Jeff Allen (comedian) (born 1956), American comedian and film actor", "*Jeff Allen, musician in swing revival band Alien Fashion Show", "*Jeff Allen (basketball) (born 1987), American basketball player", "*Jeff Allen (defensive back) (born 1958), American and Canadian football defensive back", "*Jeff Allen (offensive lineman) (born 1990), American football offensive guard"]}, {"page": "Rob Burns", "response": ["Following on from his work on British TV comedy shows, Burns played bass in subsequent theatre productions, namely the \"Rowan Atkinson in Revue\" tour (1981), which won an Olivier Award, and  \"Not in Front of the Audience\" with the Not the Nine O'Clock News cast in London (1982). Around this time, Burns played, along with drummer Jeff Allen, in support of comedian Spike Milligan, Lynsey de Paul, and Gerard Kenny at a charity event at the Commonwealth Institute in London."]}, {"page": "The Beatstalkers", "response": ["In 1962, Alan Mair and Eddie Campbell formed the Glasgow band with a lineup including Davie Lennox on vocals, Eddie Campbell on guitar, Alan Mair on bass and ‘Tudge’ Williamson on drums (replaced by Jeff Allen). Later Ronnie Smith joined the group on rhythm guitar. Under the management of Joe Gaffney, the band went on to become Scotland's \"top group\" at the time.", "Alan Mair went on to play with the Only Ones and drummer Jeff Allen played with East of Eden.Nicholas Rombes  A Cultural Dictionary of Punk: 1974-1982 1441105050 2010 Perrett had been in a group called England's Glory (the great song “Peter and the Pets” is from that era), and bassist Alan Mair, from Glasgow, had been in the Beatstalkers. Mike Kellie was in Spooky Tooth, while John Perry played in the Rats. The Beatstalkers played a reunion concert On 23 December 2005 in Glasgow."]}, {"page": "Ken Burgess (musician)", "response": ["Burgess also worked in various projects with musicians such as: Tommy Eyre, Jeff Beck, Liam Genockey, Trevor Murrel, John McCoy, Steve Howe, Steve Gregory, Richard Brunton, Steve Bird, Dave Quincy, Loughty Amao, Terry Smith, Garth Watroy, Jeff Allen, Roger Sutton, Gus Yeadon, Dion Estos and The London Symphony Orchestra."]}]}}