{"wiki_id": "http://www.wikidata.org/entity/Q6177041", "itemLabel": "Jem Evans", "itemDescription": "Welsh rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Jem_Evans", "wikipedia_page": {"main": "Owen James 'Jem' Evans (1867 - 14 October 1942) was a Welsh rugby union half-back who played club rugby for Cardiff and international rugby for Wales. Evans was one of the earliest half-backs to play for Wales and was awarded four caps between 1887 and 1888, though never with the same partner.", "link_mentions": [{"page": "List of people with surname Evans", "response": ["*Jem Evans (1867–1942), Welsh rugby union international"]}, {"page": "1942 in Wales", "response": ["*14 October – Jem Evans, Wales international rugby union player, 75"]}, {"page": "1887 Home Nations Championship", "response": ["Wales: Harry Bowen (Llanelli), Charles Taylor (Blackheath), Arthur Gould (Newport), Charlie Newman (Newport) capt., Billy Douglas (Cardiff), Jem Evans (Cardiff), Albert Hybart (Cardiff), Bob Gould (Newport), Alexander Bland (Cardiff), William Bowen (Swansea), D Morgan (Swansea), Edward Alexander (Cambridge Uni.), Tom Clapp (Newport), Willie Thomas (Llandovery), Thomas William Lockwood (Newport)", "Wales: Hugh Hughes (Cardiff), David Gwynn (Swansea), Arthur Gould (Newport), George Bowen (Swansea), Billy Douglas (Cardiff), Jem Evans (Cardiff), William Williams (Cardiff), Bob Gould (Newport) capt., Alexander Bland (Cardiff), William Bowen (Swansea), D Morgan (Swansea), Evan Richards (Swansea), Tom Clapp (Newport), Willie Thomas (Llandovery), Thomas William Lockwood (Newport)"]}, {"page": "1888 Home Nations Championship", "response": ["Wales: Ned Roberts (Llanelli RFC), George Bowen (Swansea), Arthur Gould (Newport),  Pryce-Jenkins (London Welsh), Jem Evans (Cardiff), William Stadden (Cardiff), Tom Clapp (Newport) capt., Richard Powell (Newport), Willie Thomas (London Welsh), Alexander Bland (Cardiff), Frank Hill (Cardiff), Dick Kedzlie (Cardiff), John Meredith (Swansea), T. Williams (Swansea), William Howell (Swansea)", "Wales: Ned Roberts (Llanelli RFC), Pryce-Jenkins (London Welsh), George Bowen (Swansea), Charlie Arthur (Cardiff), Jem Evans (Cardiff), Charlie Thomas (Newport), Tom Clapp (Newport) capt., Richard Powell (Newport), Frank Hill (Cardiff), Dick Kedzlie (Cardiff), Willie Thomas (London Welsh), Alexander Bland (Cardiff), John Meredith (Swansea), T. Williams (Swansea), William Howell (Swansea)"]}, {"page": "William Stadden", "response": ["Stadden's next two matches for Wales were against Ireland as part of the 1887 Championship, partnered with John Goulstone Lewis, and Scotland in 1888 with Cardiff team-mate Jem Evans; both were Welsh wins. Towards the end of 1888, Wales hosted their first oversea's tourists when the New Zealand Native team visited Britain. Under the captaincy of Frank Hill, Stadden partnered Charlie Thomas in a Welsh win over the Māori team. Stadden's last games for Wales both came in the 1890 Home Nations Championship, the first was a loss to Scotland at the Cardiff Arms Park, the second was Wales' first ever win over England. Stadden was the Welsh hero of the match after scoring the only point of the game played in England at Dewsbury.History of Welsh Rugby Rugby Canada website Early in the second half, Stadden took a line out and motioned that he was going to throw the ball long. The Welsh and England lines both shuffled back expecting a long throw, for Stadden to bounce the ball into the ground close to his feet, regathering the ball he rushed past two defending players to score the winning try.Godwin (1984), pg 24. Bouncing the ball from the line out was banned under IRB rules in 1906."]}, {"page": "John Goulstone Lewis", "response": ["Lewis, nicknamed \"Johnny Bach\", played club rugby for first class Welsh team, Llanelli. While playing for Llanelli, Lewis was awarded his one and only international cap, when he was selected to represent Wales against Ireland in the 1887 Home Nations Championship. The game was the third and last in the series, and Wales had drawn against England, but lost to Scotland, so a win over Ireland would give Wales their highest finish in the Championship to date. Wales were also suffering from a lack of continuity in their half-back pairings, with the team not fielding an identical pair of half-backs since 1885. The Ireland game was no exception; the previous match away to Scotland saw the Welsh selectors choose the Cardiff pairing of George Bowen and Jem Evans; but with Bowen moved to threequarters, Lewis was brought in alongside veteran half-back William \"Buller\" Stadden. Played on the neutral territory of Birkenhead Park, Wales won by a single dropped goal from Arthur 'Monkey' Gould, even though Ireland outscored the Welsh team three tries to one. Despite the win, Lewis found his position taken by Evans the next season, and did not represent Wales again. Despite being out of favour with the Welsh selectors, he was rewarded by his home club during the 1887-88 season when he was made captain of the senior team."]}, {"page": "Owen Evans", "response": ["* Jem Evans (Owen James Evans, 1867–1942), Welsh rugby union half-back"]}]}}