{"wiki_id": "http://www.wikidata.org/entity/Q6171682", "itemLabel": "Jean Williams", "itemDescription": "English historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Jean_Williams", "wikipedia_page": {"main": "Jean Williams is a British Professor in Sport History and author specialising in Women's history; sport and literat←ure; sportswear and motorsport. Having previously taught English for a decade, Williams was a senior research fellow at the International Centre for Sport History and Culture, De Montfort University. She acted as a historical consultant to the National Football Museum, particularly for elections to the English Football Hall of Fame. Though mainly known for her work on women's football, Williams has produced a range of material on the history of sports and the social contexts of events: these include articles on a collection of early modern sporting poems and 1950s British Bridge to a chapter on the Indianapolis 500 motor race in the United States. Williams also looked at women's motor racing for a special edition on Britain's motorists published in 2014. In terms of public history, Williams is very interested in the midlands and wrote about Leicestershire cricketer George Geary for Our Sporting Life, an exhibition held at Curve Theatre in February 2011.She is a lifelong supporter of Leicester City Football Club Williams is author of A Game For Rough Girls: A History of Women's Football in England (Routledge 2003) and A Beautiful Game: International Perspectives on Women's Football (Berg 2007). Her main projects for 2010-11 include a research monograph called A Contemporary History of Women’s Sport (Routledge Research, 2011) and a 17,000 Euro UEFA-funded project Women's Football, Europe and Professionalization 1971-2011. She is also writing a history of Britain's Women Olympians 1900-2012. In 2012 the Oxford DNB published articles on Leicester swimmer Jennie Fletcher and St Helen's footballing prodigy Lily Parr, for example. Williams has acted as consultant to sports organisations, including FIFA, and for the media, including the BBC Nation on Film Series and Edwardian Farm. Corporate consultations include deodorant brand Sure. She also appeared on the BBC Radio 4 history comedy series 'You're Dead To Me' alongside Greg Jenner and Tom Parry as a football historian.Williams is also a UEFA 'B' Licence Coach and an FA Child Protection Tutor.", "link_mentions": [{"page": "Dorothy Levitt", "response": ["When or how Levitt met Edge is unclear, as several versions and nuances are reported and both she and Edge appear to have been \"orientated towards self-publicity\". Napier cars were driven by Edge in motor races and he piloted one to win the 1902 Gordon Bennett Cup, a race from Paris to Austria; while competing there he noticed the influence Camille du Gast's participation had in drawing media attention to French racing cars. One suggestion was that Edge was seeking an English version of du Gast to enhance the sale of British cars. Jean Williams, British sports historian, hypothesises it may also have been to initiate a similar strategy to that employed by Kodak to infer \"even women\" could manage it. Edge noticed Levitt, who was described by author Jean Francois Bouzanquet as a \"beautiful secretary with long legs and eyes like pools\", working in the Napier office and promoted her to become his personal assistant, as she fulfilled almost all of his criteria for a suitable woman to attract extra publicity for the company."]}, {"page": "List of people with surname Williams", "response": ["*Jean Williams (born 19??), British sports historian and author"]}, {"page": "Jean Williams (historian)", "response": ["#REDIRECT Jean Williams"]}, {"page": "1979 European Competition for Women's Football", "response": ["In the late 1970s the issue of international tournaments for women's football teams was contentious. The international governing body International Federation of Association Football (FIFA) refused several requests to sanction independently organised tournaments, declaring that such matters \"were only possible through the National Association and the Confederations.\" Writing in 2007, Jean Williams observed that \"The fact that they had been busy not organising these events seems to have escaped [FIFA's] notice. According to Williams, FIFA's bureaucratic suppression of women's football was becoming unsustainable: \"By the 1970s it simply wasn't a viable option for FIFA to ignore women playing the game and hope that they would go away.\""]}]}}