{"wiki_id": "http://www.wikidata.org/entity/Q6171460", "itemLabel": "Jean Rook", "itemDescription": "English journalist and columnist (1931-1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jean_Rook", "wikipedia_page": {"main": "Jean Kathleen Rook (13 November 1931 in Kingston upon Hull – September 1991)  was an English journalist dubbed The First Lady of Fleet Street for her regular opinion column in the Daily Express. She was also, along with Lynda Lee-Potter, a model for the Glenda Slagg column in the satirical magazine Private Eye.", "link_mentions": [{"page": "Daily Express", "response": ["* Jean Rook"]}, {"page": "Robert Holmes (scriptwriter)", "response": ["Holmes continued as script editor for the next three years, seeing Doctor Who through one of its most successful eras in terms of both viewing figures and critical acclaim. Despite this, a number of stories came under fire from Mary Whitehouse of the National Viewers' and Listeners' Association for their alleged excessive violence or frightening tone. Some of the most controversial stories were written by Holmes himself. A scene from Holmes' story The Deadly Assassin, in which the Fourth Doctor's head is held under water as the cliffhanger, led to BBC Director General Sir Charles Curran apologising to Mary Whitehouse for the offence caused.Graeme Burk and Robert Smith Who's 50: The 50 Doctor Who Stories to Watch Before You Die—An Unofficial Companion, Toronto: ECW Press, 2013, p.148-49 On 11 February 1977, the Daily Express published an interview with Holmes by Jean Rook under the title \"Who do you think you are, scaring my innocent child?\", in which Holmes said \"Parents would be terribly irresponsible to leave a six-year-old to watch it alone. It's geared to the intelligent fourteen-year-old, and I wouldn't let any child under ten see it.\"  The scene was removed from the master tape, and was absent from all rebroadcasts and home releases of the story until it was restored from home recordings for the DVD release."]}, {"page": "Diana Dors", "response": ["After her death, Alan Lake burned all of Dors' remaining clothes and fell into a depression. On 10 October 1984, Lake did a telephone interview with Daily Express journalist Jean Rook and then walked into their son's bedroom and took his own life by firing a shotgun into his mouth. He was 43. This was five months after her death from cancer, and 16 years to the day since they had first met.Donnelley, Paul (2003) Fade to Black: A Book of Movie Obituaries, Omnibus Press, , p. 221-2"]}, {"page": "Lynda Lee-Potter", "response": ["She joined the Daily Mail as a feature writer in 1967, but her big break came five years later, when Jean Rook left the Daily Mail for the Daily Express. Lee-Potter recalled: \"I remember I had the day off, and our features editor phoned up and said: 'the editor (David English) wants you to come in and do a column,' and I said 'Oh, right'. I went in and did it. Every week I thought somebody else would probably take over. But it's just carried on.\""]}, {"page": "Bedford College, London", "response": ["*Jean Rook (1931–1991), English journalist"]}, {"page": "Glenda Slagg", "response": ["Glenda Slagg is a fictional parodic columnist in the satirical magazine Private Eye. She first appeared in the mid-1960s. Slagg's writing style is a pastiche of several female columnists in British newspapers, notably Jean Rook and Lynda Lee-Potter, and is depicted as brash, vitriolic, and inconsistent. Glenda Slagg has become an archetype of British journalism. "]}, {"page": "Jane Kelly (artist)", "response": [":In the 1970s it was Lynda Lee-Potter against Jean Rook on the Daily Express, and we younger women writers all thought we would inherit that. But it's faded out. There's been a change in editorial approach. Perhaps lippy women aren't as much of a draw as they were.Thynne, Jane. \"Media: Where now for the angry old (and not so old) women of Fleet\", The Independent on Sunday, 24 October 2004. Retrieved from findarticles.com, 28 March 2008."]}, {"page": "Sheffield Telegraph", "response": ["Other editorial staff members have included Keith Graves, who was later with the BBC and Sky TV as a much-travelled reporter; Peter Harvey, a long-serving feature writer who was awarded the MBE in 2002; Geoffrey L. Baylis, who in later years was honoured for services to journalism in New Zealand; Barry Lloyd-Jones, Brian Stevenson and Clive Jones, who were news editors; Leslie F. Daniells and Frazer Wright were long serving industrial reporters; Alf Dow, a news editor who was later the company's first training officer, and ended his career as PRO at Newton Chambers & Co.Ltd; Richard Gregory, who became a leading figure at Yorkshire Television and was later chairman of the Yorkshire Bank; George Hopkinson; Jean Rook, who was later a women's writer with the Daily Express; and Will Wyatt."]}, {"page": "London Student", "response": ["Sennet was the direct predecessor of London Student. It was published from 1954. Its first three editors  were Fred Allgood, Dinesh Kale and Peter Stamford. In 1959 the editor was Jean Rook, later best known for her long association with the Daily Express where she was nicknamed the \"first lady of Fleet Street\"."]}, {"page": "Friday Night, Saturday Morning", "response": ["| 7 November 1980 || Jackie Collins || Paula Yates, Jean Rook, Dennis Waterman, Phil Palmer, Bryan Ferry, Bruce Oldfield, Marie Helvin, Wendy Medway, Peter York"]}, {"page": "Malet Lambert School", "response": ["*Jean Rook, who was dubbed The First Lady of Fleet Street, a journalist of The Yorkshire Post, Daily Sketch and most successfully The Daily Express"]}, {"page": "List of Desert Island Discs episodes (1981–1990)", "response": ["|||Jean Rook||The Mayor of Casterbridge by Thomas Hardy||Computer|| more"]}, {"page": "Sara Leighton", "response": ["1980 saw Leighton publish her autobiography titled Of Savages and Kings, which recounts her adventures around the world with the diverse and interesting people that were part of her exciting life. She recalls her encounters with many of her clients and friends including Lord Olivier, The Prince of Wales, Muhammad Ali, Sheikh Yamani, Gloria Swanson, Pietro Annigoni, Sir Roger Moore, Jean Rook, David Niven, Shirley Bassey, Joan Collins, Queen Elizabeth The Queen Mother, The Princess Royal and the Beaverbrook family.Leighton, Sara. Of Savages and Kings (Bachman and Turner, 1980)"]}, {"page": "Richard Meredith (author)", "response": ["At Thomson's Evening Echo at Hemel Hempstead his newsroom colleagues included John Clare and John Coldstream (later with the Daily Telegraph), Tony Holden, the Royal biographer and Stephen Pile, the TV critic and author; while at the Express, his era included the brief editorship of former ITN newscaster Sir Alastair Burnet, Chapman Pincher, the Defence Correspondent, and Jean Rook, Women's Editor."]}, {"page": "Rook (surname)", "response": ["*Jean Rook (1931–1991), British newspaper columnist"]}, {"page": "Victoria Nixon", "response": ["As a result of her modelling career she also appeared on a number of TV programmes, most notably in the 1969 live coverage of the Apollo 11 moon landing where she appeared with presenter Cliff Michelmore and journalist Jean Rook during the live studio broadcast wearing a \"space-fashion outfit\". She was the first \"promo star\" of the BBC's 'Top of the Pops'Top of the Pops 2 April 1970 & 9 April 1970 described in Disc and Music Echo April 11 issue as an \"Angelic looking Hell's Angel\", and \"girlfriend of promotion ace Bill Fowler.\"Disc and Music Echo 11 April 1970 When a music act, such as Andy Williams or Kenny Rogers, was unable to appear live, producer/director Mel Cornish would pre-film a clip of her to broadcast with the song. She was featured in a 1975 version of the hugely successful and long running TV campaign for Cadbury's flake."]}]}}