{"wiki_id": "http://www.wikidata.org/entity/Q618515", "itemLabel": "Aphrodite", "itemDescription": "UK jungle and drum and bass DJ/producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Aphrodite_(musician)", "wikipedia_page": {"main": "Gavin King, better known by his stage name Aphrodite, is a British jungle and drum and bass DJ/producer on the Urban Takeover label. Also known as A Zone or DJ Aphro, he contributed to and influenced the genre's styles and techniques. He was born in Aberystwyth, Wales, and moved to London with his family as a toddler. He has studied computer science. He was one half of breakbeat hardcore group Urban Shakedown (with Claudio Giussani) who scored a UK top 40 hit with \"Some Justice\". The duo appeared in an article of Amiga Format magazine after using two Amiga 500 computers to help create the track.DJ Aphrodite is behind Aphrodite Recordings which was inspired by a club he ran in 1988 called 'Aphrodite'. His debut album was a self-titled effort under V2 Recordings, released in 1999. The follow-up was Aftershock which was again released under V2 Recordings on 24 June 2002.", "link_mentions": [{"page": "Jungle music", "response": ["Notable releases include: \"Burial\" by Leviticus, \"Dangerous\" by DJ Ron, \"Lover to Lover / Maximum Style\" by Tom & Jerry, \"Original Nuttah\" by Shy FX, \"All the Crew Big Up\" by Roni Size & DJ Die, \"Incredible / Sweet Love\" by M-Beat, \"The Helicopter Tune\" by Deep Blue, \"Super Sharp Shooter\" by DJ Zinc, \"Sovereign Melody / Lion Heart\" by Dillinja, \"Everyman\" by Kenny Ken, \"The Victory / Lovable\" by DJ Dextrous, \"Bad Ass\" by Aphrodite, \"The Lighter\" by DJ SS, and \"Tiger Style\" by DJ Hype."]}, {"page": "OctaMED", "response": ["* Drum & Bass producer and DJ Aphrodite who was also part of Urban Shakedown, used two Amiga 1200's running OctaMED to create a range of his early hits such as \"Dub Moods\", \"Summer Breeze\", \"King Of The Beats\", joint productions with Micky Finn such as \"Bad Ass\" and the remix of The Jungle Brothers - \"True Blue\" and also including his first album, Aphrodite."]}, {"page": "List of jungle and drum and bass artists", "response": ["* Aphrodite"]}, {"page": "Module file", "response": ["Although trackers can be considered to have some technical limitations, they do not prevent a creative individual from producing music that is indiscernible from professionally created music. The demosceners were focused on pushing the limits of technology. Many tracker musicians gained international prominence within MOD software users and some of them went on to work for high-profile video game studios, or began to appear on large record labels. Notable artists include Andrew Sega, Purple Motion, Darude, Alexander Brandon, Peter Hajba, Axwell, Venetian Snares, Jesper Kyd, TDK, Thomas J. Bergersen, Markus Kaarlonen, Michiel van den Bos and Dan Gardopée. It is also widely known that many of Aphrodite's early releases were made on two synchronized Amigas running OctaMED, and that James Holden made majority of his early material in Jeskola Buzz. Deadmau5 and Erez Eisen of Infected Mushroom have both used Impulse Tracker in their early career."]}, {"page": "V Festival", "response": ["* Reebox Arena: Paul Oakenfold, DJ Sneak, Dave Ralph, Derek Carter, Dope Smugglaz, Justin Robertson, Aphrodite, Dave Angel, Jumping Jack Frost, Andy Weatherall, Layo, Mr. C, Matthew B"]}, {"page": "Aphrodite (disambiguation)", "response": ["Aphrodite is the Greek goddess of love and beauty. It is also used as a female personal name.", "Aphrodite may also refer to:", "* Aphrodite Jones (born 1958), American author, reporter, and television producer", "* Aphrodite Glacier, Graham Land, Antarctica", "* 1388 Aphrodite, an asteroid ", "* Aphrodite gas field, off the southern coast of Cyprus", "* Aphrodite 2, a submarine telecommunications cable system linking Greece and Cyprus", "* Operation Aphrodite, a series of drone experiments by the U.S. Army Air Forces during World War II", "* USS Aphrodite (SP-135), a U.S. Navy patrol vessel, from 1917 to 1919", "* HMS Aphrodite, a cancelled Amphion-class submarine", "* Aphrodite, an 1896 novel by Pierre Louÿs", "* Aphrodite LaFonte, in the book series House of Night", "* Aphrodite (film), a movie by Robert Fuest very loosely inspired by an episode from the Louÿs novel", "*The Aphrodite Inheritance BBC", "* Aphrodite (Xena and Hercules), from the TV shows Xena: Warrior Princess and Hercules: The Legendary Journeys", "* Aphrodite (comics), various characters", "* Aphrodite A, a female mecha from the Mazinger Z anime and manga series", "* Aphrodite Aperyi, a character on the ANT1 television series Erotas", "* Pisces Aphrodite, in the Saint Seiya manga series", "* Aphrodite,  a playable character in Smite (video game)", "* Aphrodite (musician), born Gavin King, a UK jungle and drum and bass DJ/producer", "*Aphrodite's Theme by George Kotsonis  Love Theme From \"The Aphrodite Inheritance\" BBC 1979", "*Aphrodite, composition by George Whitfield Chadwick", "* Aphrodite (album), a 2010 album by Kylie Minogue", "* Aphrodite, 1997 album by Aphrodite (musician) ", "* Aphrodite, 2004 album by Ikuko Kawai", "* \"Aphrodite\" (song), a 2010 song by Kylie Minogue", "*\"Aphrodite\", a song by Ash from Nu-Clear Sounds", "*\"Aphrodite\", a song by Kamaliya", "* Aphrodita aculeata, the sea mouse, a marine worm named for the goddess Aphrodite", "* Aphroditeola, a pink fragrant mushroom genus"]}, {"page": "Aftershock (disambiguation)", "response": ["* Aftershock, an album by Aphrodite"]}, {"page": "Down Boy", "response": ["# \"Down Boy\" (Aphrodite remix) – 6:25", "# \"Down Boy\" (Aphrodite remix) – 6:25"]}, {"page": "Any Way the Wind Blows (film)", "response": ["# Aphrodite as \"Lava Flows\""]}, {"page": "Patronaat", "response": ["With a strong program and a character of its own Patronaat provides progressive pop music and meets the wishes of its catchment. Over the years artists like Willy DeVille, Solomon Burke, Tori Amos, Dick Dale, Herman Brood, Living Colour, Bo Diddley, dEUS, Zita Swoon, Gabriel Rios, Rickie Lee Jones, The Gutter Twins, Steve Lukather, José Feliciano, Babyshambles, Calexico, Michael Franti & Spearhead, but also heavy acts like Limp Bizkit, Anthrax, The Bloodhound Gang, Marillion, The Misfits, Danko Jones, Soulfly, Therapy?, New Model Army, Y&T, Neurosis, Cradle of Filth, Obituary, D.R.I., Helmet, Dimmu Borgir and Deicide, as well as large names in the electronic music world like Paul Kalkbrenner, Dave Clarke, Knife Party, Steve Aoki, Modeselektor, Jeff Mills, James Holden, DJ Hell,  Orbital, Leftfield, Battles, Pendulum, Chase & Status, Nero, Camo & Krooked, Andy C, Sub Focus, Aphrodite, Ed Rush, Benga, Skream, Caspa and Rusko have found their way to the Haarlem venue."]}, {"page": "Passin' Me By", "response": ["The song was remixed and called \"Rinsing Quince\" by Aphrodite in 2003."]}, {"page": "Honey (Moby song)", "response": ["\"Honey\" was released as the lead single from Play on August 24, 1998, in Europe, nine months prior to the release of the album. Numerous remixes of the song were produced for its single release by different artists, including Aphrodite, WestBam, Faithless members Rollo Armstrong and Sister Bliss, and Moby himself. Instead of choosing specific ones to include on the single, Moby and his label Mute Records opted to commercially release all of the remixes that had been produced. Moby recalled that European radio stations were hesitant to play \"Honey\" because \"they said it was an instrumental dance track\", a categorization that he disputed: \"I listen to it and all I hear is singing. Are they talking about the same song?\"", "# \"Honey\" (Aphrodite & Mickey Finn remix) – 6:21", "# \"Honey\" (Aphrodite & Mickey Finn mix) – 6:21", "# \"Honey\" (Aphrodite & Mickey Finn mix) – 6:21"]}, {"page": "Stalker (disambiguation)", "response": ["* \"Stalker\", a song by Aphrodite from his album Aphrodite"]}, {"page": "All Over Me", "response": ["* \"All Over Me\", a 2002 song by Aphrodite"]}, {"page": "GrapeFestival", "response": ["The festival took place on 9-10 August and featured Yeasayer, Welshly Arms, Tom Grennan, The Black Madonna, Superorganism, Puding pani Elvisovej, Para, Medial Banana, Max Cooper, Kruder & Dorfmeister, Katarzia, Joyce Muniz, Jon Hopkins, IAMDDB, Dub FX, Daniel Avery, Black Honey, Billy Barman, Bad Karma Boy, APRE, Aphrodite, Andy C, Algiers, Adriatique, Tove Lo, The Vaccines, The Kooks, Rudimental, Chvrches and other acts. Around 20,000 persons attended the festival."]}, {"page": "Underwater Love (Smoke City song)", "response": ["# \"Underwater Love\" (Aphrodite mix) – 6:28"]}, {"page": "Biga Ranx", "response": ["In 2011 Biga signed to the French label X-Ray Production and began creating On Time, which was released in October of that year. It was then elected the best Ragga/Dancehall album in France by the website Reggae.fr. In 2012 The World of Biga*Ranx, a project consisting of four 12-inch records was released, each a collaboration with a different producer: Maffi, Ondubground, Kanka and Mungo's Hi Fi. Biga released a remix of On Time in November 2012, with all the songs from his debut album remixed by artists such as Chinese Man, Aphrodite, A State of Mind and Tom Fire. Biga often works with Joseph Cotton, who did a guest appearance at his concert at La Cigale in May 2013 and appears on his album On Time."]}, {"page": "Aphrodite (artist)", "response": ["#REDIRECT Aphrodite (musician)"]}, {"page": "LiveSummit", "response": ["LiveSummit are an English electronic dance music group from Manchester, started in 2008 by Alex Matt. LiveSummit primarily focus on electronic dance music, trap music, drum and bass, dubstep, and similar, though they do play other musical styles.Last.fm // Last.fm about LiveSummitLive & Dangerous // Live & Dangerous about LiveSummit They have played with producers, DJs and musicians as DJ Fresh, John B, Mistabishi, Yoji, Kutski, The Panacea, Black Sun Empire, The Sect, Phace, Concord Dawn, Aphrodite as well being headliners at many big music festivals.Nightparty // Nightparty afisha LiveSummitNightparty // Nightparty about LiveSummitclubnews.com.ua  // Club News interview LiveSummit They worked with different musicians and recording studio from around the World (Studios 301 (Australia), and studios (Germany), Star Delta (UK) and other).Radio Show \"Blazin\" // Drum & Bass Radio Show \"Blazin\" about LiveSummit They have released albums on labels in Britain and the US.Discogs.com // Discogs.com about LiveSummitkmag.com  // DNA about LiveSummitrecord label Dangerous New Age // Dangerous New Age about LiveSummit"]}, {"page": "Alfa Future People Festival", "response": ["| Afrojack, Alesso, Aly & Fila, Aphrodite, DVBBS, Gareth Emery, Going Deeper, Infected Mushroom DJ Set, KSHMR, Steve Aoki, Swanky Tunes, Tiësto, Vini Vici, Yellow Claw"]}, {"page": "Urban Shakedown", "response": ["#REDIRECT Aphrodite (musician)"]}, {"page": "Aphrodite (Aphrodite album)", "response": ["#REDIRECT Aphrodite (musician)"]}]}}