{"wiki_id": "http://www.wikidata.org/entity/Q6181831", "itemLabel": "Jeremy Rogers", "itemDescription": "British yacht racer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeremy_Rogers", "wikipedia_page": {"main": "Jeremy Charles Rogers, MBE (born Thaxted, Essex, 16 September 1937) is a British boat builder and sailor, based in Lymington, Hampshire, in the United Kingdom, and the manager of the Jeremy Rogers Limited boatyard.During his 50-year career Rogers has been responsible for the construction of a large number of well-known yachts and established himself as a first-class yachtsman.", "link_mentions": [{"page": "Brian Sumner", "response": ["In 2001, Brian wrote, produced, directed, filmed and edited an instructional skateboard video called, \"The Tao of Skateboarding.\" It starred skaters from Paul Rodriguez, Ed Templeton, Bam Margera, Andrew Reynolds, Jim Greco, Kevin Long, Jeremy Rogers and more. He became known for his dyed black hair and fitted clothes, as he took flip tricks to rails and stairs while skating to fast music. In 2003 Brian was a stunt double for Adam Brody in the film Grind and also made a cameo appearance as himself. In 2004 he appeared in Sleepover where he jumped over a fountain at USC with a rubber mask on. At this time he also worked in music videos for Reggie and the full effect, Saves the Day and OPM. Working with Adio, the Brian shoe with his staple Union Jack graphic sold thousands of pairs around the world. He also had endorsement deals for video games, tech decks, wheels, boards, pants, stickers and trading cards."]}, {"page": "Rogers (surname)", "response": ["* Jeremy Rogers, (Born 1974) Electrical Engineer"]}, {"page": "One Ton Cup", "response": ["| 1974 Torquay ||  || 27,5 ft. IOR Rating || Jeremy Rogers || Doug Peterson"]}, {"page": "Contessa 32", "response": ["The Contessa 32 is a 9.75 metre (32 ft) fibreglass monohull sailing yacht, designed in 1970 by David Sadler in collaboration with yachtbuilder Jeremy Rogers, as a larger alternative to the Contessa 26. With over 750 hulls built, the yacht has become the most successful one-design cruiser-racer of all time. The yachts have a masthead sloop rig, with a fin keel and a skeg-mounted rudder, a cutting edge concept for the period which now represents a cross between newer and older designs. ", "The Contessa 32 is seaworthy enough for offshore voyages in extreme weather conditions, but also performs well in races, and as a one-design racing class is administered by an active Association. The trait most often associated with the Contessa 32 though is its ability to endure harsh weather and rough seas. A Contessa 32 was the only yacht in the small boat class to finish the disastrous 1979 Fastnet race, in which 15 lives were lost. Production by the Jeremy Rogers boatyard ceased in 1982, then restarted in 1996 and still continues. The qualities and long production span of the Contessa have given the yacht a dedicated 'cult' following.", "The Contessa 32 was designed by David Sadler in 1970, in response to demand for a larger version of his popular Contessa 26 which had been launched by the Jeremy Rogers boatyard five years earlier. The first two hulls were moulded by Jeremy Rogers in the same year. The yacht was exhibited at the London Boat Show in 1971, and was an immediate success, winning 'Boat of the Show' and securing numerous orders. Demand rapidly outstripped production, and until new facilities were built the waiting list ran to two years. In the next decade, the Rogers yard built 500 Contessa 32s, and when production stopped in 1983 over 700 had been built, and had been sold around the world. Between 1973 and 1990, an additional 87 were built under licence by J.J. Taylor of Canada after a hull and deck were shipped out and a set of moulds produced. These 'Canadian Contessas' have various production differences; the tiller was replaced with a wheel, the rig was made 3 feet taller, more GRP mouldings rather than wood were used in the interior, and a coremat cored deck replaced the solid deck. At least two other Contessa 32s were built by MacBar Marine in Poole in 1986, and about 15 more were built between 1988 and 1995 by Mike Slack. In 1996, after rebuilding his bankrupt business from scratch, Jeremy Rogers was able to buy the moulds back, and after their restoration was able to resume production of the Contessa 32 on a bespoke hand-crafted basis. The first of these 'new Contessas', Wild Call, was built in the same year. By 2010 another 20 had been built, of which the Rogers family boat, Calypso, was exhibited at the Southampton Boat Show that year.", "In 1984, in a Contessa 32 named Gigi, John Kretschmer and the owner, Ty Techera, sailed from New York City down to Cape Horn, rounding the Horn against the prevailing winds and currents, and sailed up to San Francisco. This was recorded in Kretschmer's book Cape Horn to Starboard. Gigi was then bought in Florida by Kley Hughes from Texas. She was sailed in the Gulf of Mexico on multiple coastal races and twice in the former \"Regata de Amigos\" which crossed the Gulf from Galveston, TX to Veracruz, MX. \"Gigi\" was then purchased and completely refurbished by builder Jeremy Rogers in 2007.Kretschmer, John. Cape Horn to Starboard. Camden, Maine: International Marine Publishing, 1986. ", "* Jeremy Rogers", "* Jeremy Rogers Limited"]}, {"page": "Clayesmore School", "response": ["* Jeremy Rogers MBE, Designer and builder of racing yachts such as Contessa 26 and Contessa 32"]}, {"page": "Contessa 26", "response": ["The Contessa 26 is a 7.77 meter (25.6 ft) fiberglass monohull sailboat, brought about when Jeremy Rogers, with a background in traditional wooden boatbuilding along with one of his Folkboat customers, David Sadler, created a modified version of the same boat in GRP.Peter de Jersey The Contessa 26 - A Brief History (Contessa 26 Class Association). Rigged as a masthead sloop, with a deep keel and a hull-mounted rudder, the Contessa 26 was launched in 1966 and early boats proved to be very successful racers, including long-distance events. Jeremy Rogers Limited went on to produce the Contessa 32.", "The Contessa 26 was first manufactured by Jeremy Rogers in Lymington, England in 1966. The Rogers boat works built approximately 350 Contessa 26s from 1966 to 1977, after which the moulds were sold to Chris Carrington of Maclan Marine, Lymington, who produced a few more during 1977/8. Another set of moulds was shipped to Canada, where they were built until 1990 under licence by J. J. Taylor & Sons Ltd. of Toronto.  J.J. Taylors built another 400 or so boats, originally being sold as Contessa 26s, but after 1984 being called J J Taylor 26s - some of these later boats had a slightly modified deck moulding with an enlarged 'hump' by the hatchway to give greater headroom, and a slightly revised interior layout, although the hull always remained the same.Yachtsnet http://www.yachtsnet.co.uk/archives/contessa-26/contessa-26.htm .", "Australian Nick Jaffe sailed singlehanded in his Jeremy Rogers 1972 Contessa 26 named Constellation, to Sydney, Australia. He set off from Monnikendam, the Netherlands on 17 September 2007 and arrived in Sydney in the early hours on 1 February 2010.Nick Jaffe, S/V Constellation http://www.bigoceans.com.", "*Jeremy Rogers Limited"]}, {"page": "Jeremy Rogers MBE", "response": ["#REDIRECT Jeremy Rogers"]}, {"page": "Jeremy Rogers Limited", "response": ["Jeremy Rogers Ltd. is a British boatyard based in Lymington. Founded by English boatbuilder and sailor Jeremy Rogers in 1961, it is currently known for construction to order of the classic Contessa 32 design, and refurbishment of Contessa and other yachts. The yard is notable for the high quality handbuilding of the yachts, and the renowned seaworthiness of the designs compared to modern mass-production yards.", "*Jeremy Rogers Limited"]}]}}