{"wiki_id": "http://www.wikidata.org/entity/Q6186153", "itemLabel": "Jesse Birdsall", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jesse_Birdsall", "wikipedia_page": {"main": "Jesse Birdsall (born 13 February 1963) is an English actor, known for his roles as Marcus Tandy in the BBC1 soap opera Eldorado, Nick Beckett in the adventure series Bugs (1995–1999), football manager Roger Webb in Footballers' Wives between 2004 and 2006, and Fraser Black in Hollyoaks, as well as for villain Ron Gregory in a few episodes of The Bill.", "link_mentions": [{"page": "1987 in film", "response": ["| Wish You Were Here || Atlantic Releasing Corp || David Leland (director/screenplay); Emily Lloyd, Tom Bell, Jesse Birdsall, Clare Clifford, Barbara Durkin, Geoffrey Hutchings, Charlotte Barker, Chloë Leland, Pat Heywood, Geoffrey Durham, Neville Smith, Heathcote Williams, Val McLane, Susan Skipper, Lee Whitlock, Sheila Kelley, Charlotte Ball, Abigail Leland || Comedy, Drama || Live action"]}, {"page": "1985 in film", "response": ["| Revolution || Warner Bros. || Hugh Hudson (director); Robert Dillon (screenplay); Al Pacino, Donald Sutherland, Nastassja Kinski, Dexter Fletcher, Sid Owen, Joan Plowright, Dave King, Steven Berkoff, John Wells, Annie Lennox, Richard O'Brien, Paul Brooke, Frank Windsor, Jesse Birdsall, Graham Greene, Robbie Coltrane || Historical, Drama || Live action"]}, {"page": "1979 in film", "response": ["| Quadrophenia || World-Northal Corporation / The Who Films Ltd || Franc Roddam (director/screenplay); Dave Humphries, Martin Stellman, Pete Townshend (screenplay); Phil Daniels, Leslie Ash, Toyah Willcox, Philip Davis, Mark Wingett, Sting, Ray Winstone, Gary Shail, Garry Cooper, Trevor Laird, Andy Sayce, Kate Williams, Michael Elphick, Kim Neve, Benjamin Whitrow, Daniel Peacock, Jeremy Child, John Phillips, Timothy Spall, Patrick Murray, George Innes, John Bindon, P.H. Moriarty, Hugh Lloyd, Gary Holton, John Altman, Jesse Birdsall, Olivier Pierre, Julian Firth, Simon Gipps-Kent, Mickey Royce, Dave Cash, John Blundell || Drama || Live Action "]}, {"page": "The StoryTeller (TV series)", "response": ["The episode stars Art Malik as Orpheus, Gina Bellman as Eurydice, Jesse Birdsall as Aristaeus, Robert Stephens as Hades, Mel Martin as Persephone."]}, {"page": "Birdsall (name)", "response": ["* Jesse Birdsall (born 1963), English actor"]}, {"page": "Eldorado (TV series)", "response": ["Although the show featured many professional actors, such as Patricia Brake and Jesse Birdsall, many of the cast were inexperienced actors whose limitations were clearly exposed on such a new and ambitious project. (German-born Kai Maurer had apparently never acted on stage or screen previously before being cast in the show). Prior to filming, some of the cast did not even know what a read-through was; the quality of the acting was derided by some tabloid newspapers and regularly mocked during the \"film styles\" round of comedy show Whose Line Is It Anyway?.", "The series ended with one of its star characters, Marcus Tandy (played by Jesse Birdsall), escaping an attempt on his life with his car being blown up, and sailing off into the distance on a boat with his girlfriend Pilar Moreno (played by Sandra Sandri). Some viewers noticed that the car that was blown up was not, in fact, the Renault Alpine A610 driven by Marcus, but a thinly disguised much older model, the Triumph TR7.A610 exploding on Eldorado The final line of dialogue, delivered by Tandy, was: 'You can't trust anyone these days, can you?'"]}, {"page": "Sharon Watts", "response": ["Sharon returns to Walford in August 2012 asking Phil to help her retrieve Dennis from her fiancé, John Hewland (Jesse Birdsall), whom she has just jilted at their wedding ceremony. Furious, John suggests that he saved Sharon from destitution and kidnaps Dennis but Phil rescues him. Sharon manages Phil's nightclub \"R&R\" and starts dating Jack Branning (Scott Maslen). Sharon and Jack's romance is complicated by Phil, who is determined to reignite a relationship with Sharon. A feud between Jack and Phil ensues, with both proposing to Sharon. She accepts Jack's proposal but, realising he still loves his former wife Ronnie Mitchell (Samantha Womack), Jack cancels the wedding. Phil then persuades Sharon to move in with him but she struggles to cope with Jack's rejection and resumes dependency on painkillers, an addiction that developed to manage her grief following Dennis' murder. When Sharon passes out unconscious while looking after Phil's granddaughter Lexi Pearce, he throws her out. The upheaval affects Dennis; he starts misbehaving and clashes at school with teaching assistant Whitney Dean (Shona McGarty). Dennis lies when he falls and grazes his arm, telling Sharon that Whitney has assaulted him. Blind to Dennis 's misbehaviour, Sharon reports Whitney to the school board requesting her dismissal but is forced to contemplate the truth when Whitney is exonerated.", "Dean returned to filming on 6 June 2012. Sharon's return storyline saw her fiancé John (Jesse Birdsall) kidnap her son Dennis Rickman Jnr following a \"furious bust up\". Sharon enlisted the help former lover Phil to retrieve her son. Sharon returned to EastEnders on 13 August 2012. Sharon's return storyline was marked with seven episodes being broadcast over a period of a week (the typical weekly output at this time was four) and it coincided with EastEnders' return to BBC1 following its brief departure to the network's sister channel BBC2 to allow for coverage of the 2012 Olympic Games in London. To promote the character's return, the BBC began airing a trailer across its network's channels during July and August 2012. The trailer showed Albert Square and its residents being blown away by \"Hurricane Sharon\", who floated down from the sky wearing a wedding dress to the soundtrack of \"Gimme Shelter\" by The Rolling Stones."]}, {"page": "Footballers' Wives", "response": ["*Jesse Birdsall as Roger Webb (Series 3–5)"]}, {"page": "Revolution (1985 film)", "response": ["* Jesse Birdsall as Cpl./Sgt. Peasy"]}, {"page": "Bugs (TV series)", "response": ["The plot of the programme involved a team of specialist independent crime-fighting technology experts, who faced a variety of threats involving computers and other modern technology. The main trio of regulars were Nick Beckett (Jesse Birdsall), Ros Henderson (Jaye Griffiths) and Ed (Craig McLachlan in series one to three, Steven Houghton in series four). Initially an independent team, they began working alongside the government agency 'Bureau of Weapons Technology' in series two and from series three, with the original Bureau decimated, they came under the authority of the newly created Bureau 2, whose head was codenamed Jan (Jan Harvey) (her real first name was revealed to be Barbara, but her surname was never given) and her secretary, Alex Jordan (Paula Hunt). The series evolved, as a result, from a series of relatively unconnected one-off episodes to an overarching 'soap opera' complete with office romances. There has been controversy over Ed's surname - because he was never called anything other than \"Ed\", some people have taken his surname to be Russell, simply because he was addressed as \"Dr Russell\" in one episode. However, that was more likely a pseudonym, as both Ros and Beckett used plenty of false names throughout the series.", "* Jesse Birdsall as Nicholas Beckett"]}, {"page": "Randal Kleiser", "response": ["Kleiser directed several more feature films, including The Blue Lagoon (1980) with Brooke Shields, Summer Lovers (1982) with Daryl Hannah, Grandview, U.S.A. (1984) with Jamie Lee Curtis, Flight of the Navigator (1986), featuring the first use of digital morphing in a film, Big Top Pee-wee (1988), White Fang (1991) and Honey, I Blew Up the Kid (1992). In London, Kleiser directed the comedy Getting It Right (1989), starring Jesse Birdsall, Lynn Redgrave, Helena Bonham Carter, Jane Horrocks and Sir John Gielgud. In 1996, he wrote and directed It's My Party, starring Eric Roberts, Gregory Harrison, Lee Grant, Bruce Davison, George Segal and Marlee Matlin. As a writer-producer, he was responsible for the surfing film North Shore (1987) for Universal Pictures. He also directed the thriller Shadow of Doubt (1998) with Melanie Griffith and Tom Berenger. "]}, {"page": "As If (British TV series)", "response": ["* Paul Sutton (Jesse Birdsall): Nikki's father who went to prison for tax evasion."]}, {"page": "Wish You Were Here (1987 film)", "response": ["Wish You Were Here is a 1987 British comedy-drama film written and directed by David Leland and starring Emily Lloyd, Tom Bell, Geoffrey Hutchings, and Jesse Birdsall. The film follows a girl's coming-of-age in a small coastal town in postwar England. It is loosely based on the formative years of British madam Cynthia Payne. The original music score was composed by Stanley Myers. "]}, {"page": "Celebrity Poker Club", "response": ["* Jesse Birdsall"]}, {"page": "Phil Mitchell", "response": ["During a charity abseil on top of The Queen Vic, Shirley proposes to Phil and he accepts. At their engagement party, Sharon returns, begging for help, as she has left her fiancé John Hewland (Jesse Birdsall) at the altar and he has her son, Dennis Rickman (Harry Hickles). Phil helps her to rescue Dennis and they return with Phil to Walford. When Phil gets home, he finds that Shirley knows the truth about Heather's death. After a furious confrontation, he tries to convince her not to tell the police but Ben confesses to the police and is charged with Heather's murder. Jay is charged with perverting the course of justice and Phil orders him to change his statement so Ben will not go to prison, but Jay refuses and Phil disowns him but does manage to convince Roxy to lie in her statement. His solicitor, Ritchie Scott (Sian Webber), tells him that Ben could face a minimum of 10 years in prison. Shirley ends her relationship with Phil as she is unable to cope with his betrayal. Phil visits Ben in prison with Ian in the hope of persuading Ben to retract his confession but Ben refuses, insisting that he is doing the right thing as he needs to be punished. Ben refuses to have any contact with his family until his release."]}, {"page": "Gwyneth Strong", "response": ["Strong married former Footballers' Wives and Eldorado star Jesse Birdsall in 2000. They have a son Oscar (b. 1988) and a daughter Lottie (b. 1991)."]}, {"page": "List of former EastEnders characters", "response": ["|John Hewland || Jesse Birdsall || 2012"]}, {"page": "Our Daughter's Wedding", "response": ["In 1981, the group's \"Lawnchairs\", an independently funded and released single, reached #31 on the Billboard Disco Chart and #49 on the UK Singles Chart in August 1981. They toured with other bands of the day including U2, Duran Duran, Orchestral Manoeuvres in the Dark, Iggy Pop, The Psychedelic Furs and frequently appeared on MTV as guest hosts. Their television resume also included various shows on both BBC & ITV. They appeared in Episode One of the ITV drama 'Jangles' (Opportunity) which starred Hazel O'Connor and Jesse Birdsall."]}, {"page": "List of former Hollyoaks characters", "response": ["| Fraser Black || Jesse Birdsall || 2013–2014"]}, {"page": "The British Soap Awards", "response": ["| \"Villain of the Year\"Presented by Martin Kemp|| Anna Passey (Sienna Blake in Hollyoaks) || Charlie Brooks (Janine Butcher in EastEnders)Dominic Power (Cameron Murray in Emmerdale)Greg Wood (Trevor Royle in Hollyoaks)Jesse Birdsall (Fraser Black in Hollyoaks)"]}, {"page": "Rides (British TV series)", "response": ["The first series also starred Jesse Birdsall as Julian, Patrice's love interest, however in series two Julian was played by a different actor, James Purefoy.", "*Julian - Jesse Birdsall"]}, {"page": "Clare Devine", "response": ["Fraser Black (Jesse Birdsall) and Jim McGinn (Dan Tetsell) visit Clare in prison, Fraser asks Jim to help secure her release and it is revealed that Fraser is Clare's father. She tells him never to return and she will not forgive him. Clare cannot cope with prison life and accepts help. When she is released Fraser hands over The Loft to Clare. She reveals that she was pregnant with Trevor Royle's (Greg Wood) baby and Fraser pushed her down the stairs, causing her to miscarry. Clare wants revenge and decides to plant a bomb in The Loft. She invites Mercedes to have her birthday party inside, but when Clare detonates the bomb, a block of council flats blow up instead after Sinead O'Connor (Stephanie Davis) took the bag containing the bomb by mistake, killing Leanne, Ash Kane (Holly Weston), Doug Carter (PJ Brennan). Clare is then killed when Mercedes pushes her in front of Doctor Browning's car following a fight.", "Bissix told a Birmingham Mail reporter that she would resume filming in July with her return airing in September. She said her return storyline was a \"top secret\" and that \"just when I think she can’t get any worse, she does.\" Clare returned on-screen during the show's \"first look\" episode on 26 September 2013 and was being held in prison. Producers decided to keep details of her reappearance a secret until transmission. Fraser Black (Jesse Birdsall) being revealed as her father was another secret aspect of the storyline. However Clare was killed off in another \"shock\" storyline twist, which sees Doctor Browning run her over with his car. Bissix described Clare as the best character she had played in her career and thanked her supportive fans. She explained that Clare's departure would ultimately allow other villains to become embroiled in main storylines."]}, {"page": "Foyle's War (series 5)", "response": ["|colspan=\"6\"|Guests: Nicholas Woodeson, Graham Crowden, Duncan Bell, Phyllida Law, Natasha Little, Joseph Mawle, Roger Sloman, Jay Simpson, Jesse Birdsall"]}, {"page": "Hey Mister Heartache", "response": ["The music video contained an appearance by actor Jesse Birdsall."]}, {"page": "List of Footballers' Wives characters", "response": ["*Jesse Birdsall as Roger Webb (Series 3–5)"]}, {"page": "The Squad (TV series)", "response": ["The series aired at 4.30pm on Wednesdays, and featured a team of high quality notable writers, including the likes of John Kershaw, Paula Milne, Roy Russell, Simon Masters, William Humble, Barry Purchese and James Follett. The series also featured early acting credits from the likes of Gary Beadle, Jesse Birdsall, Perry Fenwick, Rik Mayall, Caroline Quentin and Josette Simon. Notably, the series has never been released on VHS or DVD."]}, {"page": "Jack Branning", "response": ["Denise Fox (Diane Parish) poaches the builder that Jack has hired. Jack argues with Denise, leading to her barring him from the Minute Mart. He later accidentally soaks her with water while washing his car. Jack then agrees to go on a blind date set up by Tanya and Zainab Masood (Nina Wadia), but is horrified when he discovers it is with Denise. After the pair throw insults at one another, Denise throws water in his face and storms out. Jack later expresses his attraction to Sharon Rickman (Letitia Dean), who has jilted her fiancé John Hewland (Jesse Birdsall). They flirt and when Sharon is desperate for money, he buys her engagement ring. Sharon decides to stay at the B&B, but Jack invites her to stay at his flat, where they have sex. Sharon constantly seduces him afterwards and on Sharon's terms, knowing about her addiction to painkillers, they start dating. However, their relationship starts to shake when Sharon agrees to a plan in order to gain custody of Lola Pearce's (Danielle Harold) baby, pretending to be Phil's fiancée, which makes Jack jealous; however, the lie becomes too much for Phil, so Sharon stops playing the part. Jack and the rest of his family fall out with Derek, and when he suffers a heart attack on Christmas Day, he, along with Max, Kat and Derek's son Joey (David Witts), do nothing to help him as he suffers. Jack tries to pull the group together in hiding this from the police. Phil jaunts the fact to Jack that he is still in love with Sharon on New Year's Eve, prompting a paranoid Jack to propose to her in an argument. However, on the same night, Phil proposes also, but Sharon says yes to Jack. However, he is still unnerved by Phil and sees him an opponent for his lover. When Sharon's son, Dennis Rickman Jr (Harry Hickles) starts a fight at school, Jack admits he taught Denny to box, angering Sharon. Jack receives a letter from Ronnie saying she is due to be released from prison. He visits Ronnie in secret and realises he will never love Sharon like he loved Ronnie, so he jilts her moments before they are due to marry, and leaves Walford for a while."]}, {"page": "Getting It Right (film)", "response": ["Getting It Right is a 1989 British-American comedy-drama film starring Jesse Birdsall, Jane Horrocks, and Helena Bonham Carter. The tagline was: \"Gavin is 31... and a virgin. One wild night and three women later, he's finally... Getting It Right\"", "* Jesse Birdsall as Gavin Lamb "]}, {"page": "List of British films of 1989", "response": ["|Getting It Right|| Randal Kleiser || Jesse Birdsall, Jane Horrocks, Helena Bonham Carter || Comedy ||"]}, {"page": "List of fictional crime bosses and gang leaders", "response": ["*Fraser Black (Jesse Birdsall) - Hollyoaks"]}, {"page": "Dan Tetsell", "response": ["In 2012 he joined British soap Hollyoaks, playing new regular \"cunning\" solicitor Jim McGinn; he made his first appearance on 30 November. His character was killed by Fraser Black (Jesse Birdsall) in January 2014."]}, {"page": "Watts family", "response": ["In August 2012, Sharon sought out Phil's help after her son Dennis (Harry Hickles) had been kidnapped by her fiancé John Hewland (Jesse Birdsall). Phil's family fell apart when it was discovered that his teenage son, Ben (Joshua Pascoe), had killed Heather Trott (Cheryl Fergison) and in an attempt to rebuild his family and win custody of his granddaughter Lexi Pearce, Sharon has agreed to help Phil by faking an engagement between the two."]}, {"page": "Bloody Kids", "response": ["* Jesse Birdsall as Ken's Gang 5"]}, {"page": "Derek Birdsall", "response": ["He married in 1954 and has two sons and one daughter, including actor Jesse Birdsall. "]}, {"page": "Sinead O'Connor (Hollyoaks)", "response": ["Sinead steals a car after being cautioned at the police station to get to the hospital, but Fraser Black (Jesse Birdsall) crashes into Sinead and leaves her trapped inside her car. Luckily, Sinead is found and is taken to the hospital, but Freddie informs her that Katy has died. Sinead is put on a psychiatric ward as Finn confesses that Sinead was alone with Katy before she was rushed to hospital and everybody, including Diane, believes Sinead poisoned Katy in a bid for attention however it is revealed at Katy's funeral that Katy really was ill and Sinead had nothing to do with her death. Sinead leaves Freddie because he didn't believe that she didn't hurt Katy. In May, she finds out about Sonny Valentine's (Aaron Fontaine) part in the death of Superintendent Marlow (Paul Clayton). She threatens to tell the police unless Sonny helps her get back at Lindsey. After injuring herself, she goes to the hospital with Sonny where she is treated by Lindsey. Lindsey tries to sympathise with Sinead while treating her, but only causes her to get angrier. Sinead slaps Lindsey, then pushes her over, causing a syringe to enter her. Sinead then announces she is HIV positive. Believing her claims, Carmel Valentine (Gemma Merna) organises an AIDS charity event during which Joe arrives and reveals Sinead has been lying to make Lindsey suffer. Sinead decides that she needs to punish Lindsey and make her pay for \"killing her baby\". Sinead steals a car from Freddie's work and kidnaps Lindsey, handcuffing her to the door. She drives to a canal and threatens to drive into it unless Lindsey and Freddie, who is in the car, admit they had an affair. Lindsey, scared for her life, admits that she loved Freddie because she was lonely and briefly wanted them to run away together and bring up a baby. Sinead unties her and lets her go, then reveals to them that she had a phone which she phoned Joe on, and he overheard everything."]}, {"page": "Shadey", "response": ["* Jesse Birdsall – Carl"]}, {"page": "All Star Mr & Mrs", "response": ["| Gwyneth Strongwith husband Jesse Birdsall"]}]}}