{"wiki_id": "http://www.wikidata.org/entity/Q6187352", "itemLabel": "Jessica Martin", "itemDescription": "English entertainer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jessica_Martin", "wikipedia_page": {"main": "Jessica Cecelia Anna Maria Martin (born 25 August 1962) is an English actress, singer, and impressionist whose career has diversified to include comic writing and illustrating.", "link_mentions": [{"page": "Spitting Image", "response": ["*Jessica Martin (1985–1988)"]}, {"page": "List of Doctor Who supporting characters", "response": ["*Queen Elizabeth II (Jeannette Charles, Herself [archival], Jessica Martin [voice], Angharad Baxter [body])Queen Elizabeth II is seen in the Seventh Doctor serial Silver Nemesis (played by Jeanette Charles) and \"Voyage of the Damned\" (Jessica Martin providing her voice, and Angharad Baxter acting on-camera).Queen Elizabeth II is also present but unseen in the Olympic Stadium at the end of the Tenth Doctor episode \"Fear Her\" and in the Eleventh Doctor mini-episode \"Good as Gold\", both of which take place with the torch's arrival, and thus after Her Majesty's entrance and formal opening of the games; and is at an off-camera party outside of the TARDIS in the Eleventh Doctor mini-episode, \"Bad Night\" (the Queen is unidentified in the mini-episode itself, but is revealed as \"Liz Two\" in the associated behind-the-scenes featurette.An alternate universe Queen Elizabeth II is said to have been executed prior to the events of the Third Doctor serial Inferno, and another alternate universe ER II is killed in the Tenth Doctor episode \"Turn Left\", in the Doctor-less version of the events of \"Voyage of the Damned\"."]}, {"page": "Shirley Porter", "response": ["In November 2009, BBC Radio 4 broadcast the radio play Shirleymander, which dramatised the events of Porter's time as leader of Westminster City Council, with the role of Porter played by Tracy Ann Oberman. In 2018, a stage adaptation of the play starred Jessica Martin as Porter and had a brief run at the Playground Theatre in North Kensington, west London."]}, {"page": "Me and My Girl", "response": ["The musical was revived in 1941, 1945 and 1949 in the West End. Lupino Lane starred and directed each of these productions, with choreography by Fred Leslie. In 1984, a revised production opened at the Leicester Haymarket Theatre with a revised script by Stephen Fry and contributions by director Mike Ockrent. It transferred to the Adelphi Theatre on 12 February 1985 and closed on 16 January 1993 after an eight-year run and 3,303 performances. It starred Robert Lindsay as Bill Snibson, Emma Thompson and Frank Thornton. The production won two Olivier Awards: Musical of the Year and Outstanding Performance by an Actor in a Musical (Robert Lindsay).Me and My Girl, This Is Theatre, accessed 29 May 2017Olivier Winners 1985, OlivierAwards.com, accessed 29 May 2017 Cast changes included Enn Reitel as Bill and Su Pollard as Sally in 1986; Gary Wilmot as Bill and Jessica Martin as Sally in 1989. Thornton was succeeded by Nicholas Smith. The production subsequently toured throughout Britain."]}, {"page": "Mack and Mabel", "response": ["It was revived in July 2012 at the Southwark Playhouse, under the direction of Thom Southerland, with choreography by Lee Proud. The title roles were played by Norman Bowman and Laura Pitt-Pulford, with Jessica Martin as Lottie, Stuart Matthew Price as Frank Capra and Peter Kenworthy as William Desmond Taylor.", "|style=\"text-align:center;\" | Jessica Martin"]}, {"page": "Spamalot", "response": ["Todd Carty played Patsy, assistant to King Arthur for the duration of the tour. Marcus Brigstocke made his musical theatre debut as King Arthur following Jupitus' departure. Jodie Prenger, Hayley Tamaddon, Amy Nuttall and Jessica Martin shared the role of The Lady of the Lake."]}, {"page": "3-2-1", "response": ["Acts who appeared included: Gloria Gaynor, George Roper, Ken Dodd, Charlie Williams, Bonnie Langford, Duncan Norvelle, Black Lace, Bernie Winters, Stutz Bear Cats, Kit and the Widow, Wall Street Crash, Kiki Dee, Michael Ball, 'Nasty Nigel' Lythgoe, Martin \"The Beast\" Francis, Tom Pepper, Fay Presto, Pete Price, Manhattan Transfer, Shane Richie, the Flaming Hamsters, Stan Boardman, Fascinating Aida, Showaddywaddy, Kajagoogoo, Frankie Howerd, Colm Wilkinson, Wilfrid Brambell from Steptoe and Son, Sinitta, Five Star, Indigo Lady, Cheryl Baker, Phil Cornwell, Jaki Graham, Nana Mouskouri, the Chuckle Brothers, Brian Conley, Roy Walker, the Drifters, John Sparkes, Wayne Sleep, Andrew O'Connor, Gareth Hunt, Peter Beckett, Syd Lawrence (with his orchestra), Humphrey Lyttelton, Frankie Vaughan, Jessica Martin, the Foxes, Mud, Keith Harris and Orville, Mick Miller, Diane Solomon, Tony Christie, Cover Girls, Lyn Paul, the Searchers, the Rockin' Berries, Stephanie Lawrence, Don Lusher (with his band), Madeline Bell, Georgie Fame, Wayne Dobson, the Real Thing, Rebecca Storm, Richard Digance, Anna Dawson, Marion Montgomery, Bill Maynard, the Krankies, Terry Scott, Carmel McSharry, Bob Carolgees, Diana Dors, Lionel Blair, Alvin Stardust, Phil Cool, Vince Eager, Mike Reid, Nicholas Parsons, Sheila Steafel, Danny La Rue, Les Dennis, The Wurzels, Joan Benham, Ken Colyer (with his jazzmen), Frazer Hines, Charlie Williams, Pan's People (as Dee Dee Wilde's Pan's People), Rita Webb, The Great Soprendo, Bernard Bresslaw, Charlie Drake, Aimi MacDonald, Mark Heap (the Two Marks), Vince Hill and Paul Da Vinci."]}, {"page": "The Greatest Show in the Galaxy", "response": ["Director Alan Wareing provides the voice for the third God of Ragnarok in Part Four. Dean Hollingsworth as the Bus Conductor is credited for Part Three, but does not appear. Hollingsworth previously played an Android in Timelash (1985). Jessica Martin, who plays Mags in this episode, briefly returns in \"Voyage of the Damned\" (2007) voicing Queen Elizabeth II. Martin later reprised her role as Mags when she became a companion of the Seventh Doctor in Big Finish audio plays. Ian Reddington, the Chief Clown, reprised his role in the audio play The Psychic Circus and later played Nobody No-One in the audio play A Death in the Family. Harry Peacock, the brother of Daniel Peacock, who plays Nord the Vandal in this serial, later appeared in the 2008 episodes \"Silence in the Library\" and \"Forest of the Dead\" as Proper Dave."]}, {"page": "There's No Business Like Show Business", "response": ["* British comedian and impressionist Bobby Davro included a sketch \"The Kidnapping of Bonnie Langford\" on his 1980s ITV show, which concluded with Langford (played by Jessica Martin) loudly performing the song in order to nauseate her kidnappers into releasing her."]}, {"page": "The Garden (1990 film)", "response": ["Dawn Archibald,\tMilo Bell, Vernon Dobtcheff, Michael Gough, Mirabelle La Manchega and Jessica Martin."]}, {"page": "Faeries (1999 film)", "response": ["* Jessica Martin as Helen and Skrawk"]}, {"page": "You Bet!", "response": ["|bgcolor=\"ffdddd\"| Jessica Martin", "|Jessica Martin"]}, {"page": "Index of Singapore-related articles", "response": ["* Jessica Martin"]}, {"page": "List of companions in Doctor Who spin-offs", "response": ["She later left the Psychic Circus after her transformations became far too deadly to those around her for her to stay, she set out into the universe and was eventually reunited with the Seventh Doctor in the Big Finish audio play The Monsters of Gokroth where at the end of the play she became his travelling companion. She is portrayed by Jessica Martin."]}, {"page": "List of Hispanic and Latino Americans", "response": ["* Jessica Martin - professional wrestler"]}, {"page": "Andrew Agnew (actor)", "response": ["He played Smee in Peter Pan alongside Jennifer Ellison, Ace Bhatti and Gemma Hunt... He returned to the Churchill Theatre, Bromley the following Christmas to play Buttons in Cinderella with Matt Lapinskas, Anna Williamson and Jessica Martin."]}, {"page": "Nick Awde", "response": ["In 2007 two other plays followed, premiering at the Edinburgh Festival. Written with Chris Bartlett, directed by David Giles and starring Jessica Martin and Jason Wood, Unnatural Acts is a comedy about two flatmates, a gay man and a straight woman, who try to have a baby together. Written by Awde and directed by Jon Bonfiglio, Blood Confession is a violent drama about an interrogation, about a child murder from 25 years ago, that goes horribly wrong."]}, {"page": "Big (musical)", "response": ["| align=\"center\"|Jessica Martin"]}, {"page": "Chris Bartlett (writer)", "response": ["A follow-up, Unnatural Acts, a comedy drama also written with Awde about two flatmates – one a gay man and the other a heterosexual woman – who decide to have a baby, premiered at the Gilded Balloon as part of the 2007 Edinburgh Festival Fringe, starring Jessica Martin and Jason Wood."]}, {"page": "The Card (musical)", "response": ["The 1994 revival at the Open Air Theatre in Regent's Park, London, starred Peter Duncan, Jessica Martin, Hayley Mills, and Jenna Russell and was extensively re-worked by the original authors with lyricist Anthony Drewe.Koenig, Rhoda.THEATRE / Plain dealer:The Card in Regent's ParkThe Independent, 3 August 1994  Amendments were made to the libretto, existing songs were re-written and others dropped and new ones introduced.  This production was also presented in Moscow as part of a cultural exchange program, one of the first times a western-style musical was staged in the former Soviet Union."]}, {"page": "St Michael's Catholic Grammar School", "response": ["*Jessica Martin, actress and comedienne"]}, {"page": "Personality and image of Elizabeth II", "response": ["* Jessica Martin briefly at the end of the Christmas special of the BBC series Doctor Who entitled \"Voyage of the Damned\" (2007)"]}, {"page": "Jessica (given name)", "response": ["* Jessica Martin (born 1962), British actress and comedian"]}, {"page": "Bernard J. Taylor", "response": ["Meanwhile, Taylor turned his attention to something entirely different. The show (originally entitled  Success! and renamed in 2009)  was a backstage musical, loosely based on Faust, and set in New York. Peppered with parody and pastiche, with additional lyrics by Vivian Wadham, its typical, and often cynical, view of the ups and downs of show business was accompanied by a jazzy and sometimes tender score, with Claire Moore, Lon Satton, Kathryn Evans, Jessica Martin and Maurice Clarke forming the CD cast.  The musical was revamped in 2006 and retitled \"Make Me a Musical\"."]}, {"page": "Voyage of the Damned (Doctor Who)", "response": ["Clive Swift and Geoffrey Palmer have had previous roles in Doctor Who. Swift portrayed Jobel in Revelation of the Daleks (1985), while Palmer played Undersecretary Masters in Doctor Who and the Silurians (1970), and the Administrator in The Mutants (1972). Jessica Martin had played Mags in The Greatest Show in the Galaxy (1988–89). In addition, Bernard Cribbins played Tom Campbell in Daleks' Invasion Earth 2150 A.D., the second Doctor Who feature-film adaptation starring Peter Cushing as well as Arnold Korns in the audio play Horror of Glam Rock. Colin McFarlane, who provided the voices of the Heavenly Host for the episode, went on to play General Pierce in Torchwood: Children of Earth (2009), before later reappearing in Doctor Who as Moran in \"Under the Lake\". Jimmy Vee had previously played aliens in \"The End of the World\" and \"Aliens of London\" (2005), and would later play other aliens in \"The End of Time\" (2009–10) and \"The Caretaker\" (2014)."]}, {"page": "Win, Lose or Draw (British game show)", "response": ["*Week 4 - Gaby Roslin, Andrew O'Connor, Jessica Martin, Derek Lord"]}, {"page": "A Marshmallow World", "response": ["* Jessica Martin and Mark Steyn (on a 2008 digital download)", "* Jessica Martin and Mark Steyn (on a 2010 digital download - 'Disco Fever Edition')"]}, {"page": "Success!", "response": ["Success! is a musical by Bernard J. Taylor that was first recorded in 1993 as a studio concept album featuring various West End performers including Lon Satton (who created the role of Poppa in Andrew Lloyd Webber's Starlight Express), Claire Moore,  Kathryn Evans, Jessica Martin and Maurice Clarke.  It had its world premiere stage production in Rotherham, Yorkshire, in 1995. "]}, {"page": "Junglies", "response": ["Like Nellie the Elephant, another series by Ward, all the characters were only voiced by two actors, in this cast, all voices were provided by Gary Wilmot and Jessica Martin."]}, {"page": "Gallifrey One", "response": ["| colspan=\"3\" |John Hurt, Peter Davison, Colin Baker, Michelle Gomez, Ingrid Oliver, Samuel Anderson, Nicola Bryant, Frazer Hines, Clare Higgins, Neve McIntosh, Julian Glover, Patricia Quinn, Ian McNeice, Sarah Dollard, Jamie Mathieson, Jessica Martin, India Fisher, Sarah Douglas, Naoko Mori, Andrew Hayden-Smith, Andy Pryor, Andrew Cartmel, Gary Russell, Paul Cornell, Phil Plait, Michelle Thaller, Simon Guerrier, Nichelle Nichols, Tony Lee, Richard DinnickConvention Guests Gallifrey 2016 GallifreyOne.com. Retrieved 13 February 2016.", "| colspan=\"3\" |Steven Moffat, Sylvester McCoy, Matt Lucas, Sophie Aldred, David Bradley, Jemma Redgrave, Camille Coduri, Wendy Padbury, Frazer Hines, Murray Gold, Chase Masterson, Lisa Bowerman, Terry Molloy, Brian Minchin, Rona Munro, Robert Shearman, Andrew Cartmel, Jamie Mathieson, Sarah Dollard, Peter Harness, Paul Cornell, Rachel Talalay, Lawrence Gough, Hayley Nebauer, Wayne Yip, Lindsey Alford, Jessica Martin, Stephen Wyatt, Philip Martin, Mike Tucker, Mark Ayres, Chris Achilleos, Jenny Colgan, Carrie Henn, Dee Sadler, Simon Fraser, George Mann, John Dorney, Matt Fitton, Cavan Scott, Jon Davey, Tony Lee, Christopher Jones, Richard Dinnick, Edward Russell, Charlie Ross, Jason Haigh-Ellery, Sue Cowley, Sam Watts Convention Guests Gallifrey 2018 GallifreyOne.com. Retrieved 5 March 2018."]}, {"page": "The Music Hall Guild of Great Britain and America", "response": ["The Music Hall Guild of Great Britain and America and the Theatre and Film Guild of Great Britain and America is a registered theatre charity and non-profit making theatre organisation based in London.  The Guild's patrons include Brian Croucher, Anita Dobson, Sheila Ferguson, Jessica Martin, Lorraine Chase, Gillian Gregory, Mark Lester, and Shani Wallis."]}, {"page": "List of Royal Variety Performances", "response": ["| Anthony Newley, The Alan Harding Dancers, Jessica Martin, Gary Wilmot, Peter Goodwright, Hilary O'Neil, Allan Stewart, Bernie Winters, Leslie Crowther, George Carl, Bobby Davro, Johnny Logan, Les Dawson, The Roly Polys, Danny La Rue, Dolores Gray, Cannon & Ball, Eartha Kitt, Richard Branson, Hale & Pace, James Galway, Jimmy Tarbuck, Kenny Lynch, Shirley Bassey, Five Star, Ronn Lucas, Les Misérables (Dudu Fisher, Kaho Shimada & Michael McGuire), Stephen Fry, Hugh Laurie, Mel Tormé, George Shearing, Michael Barrymore, Sarah Brightman, Mike Yarwood, Johnnie Ray, Rosemary Clooney, Harry Secombe, Tom Jones"]}, {"page": "List of acts that have appeared on the Royal Variety Performance", "response": ["*Jessica Martin: 1987"]}, {"page": "Homes for votes scandal", "response": ["In November 2009 (and repeated in October 2011), BBC Radio 4 broadcast a radio play — Shirleymander — depicting the principal events of Shirley Porter's time as leader of Westminster City Council in the 1980s, in which she was played by Tracy Ann Oberman. In 2018, a stage adaptation starring Jessica Martin opened at the Playground Theatre in North Kensington, west London, ran for several weeks."]}, {"page": "Elf (musical)", "response": ["| align=\"center\"| Jessica Martin"]}, {"page": "Jessica Martin (actor and comedian)", "response": ["#REDIRECT Jessica Martin"]}, {"page": "Lost Musicals", "response": ["The project's final season at the Barbican took place in 1998, when five productions were offered. Irving Berlin and Moss Hart's revue As Thousands Cheer opened the season with a cast featuring Danielle Carson and Paula Wilcox. This was followed by Alan Jay Lerner and Burton Lane's first Broadway musical, On a Clear Day You Can See Forever, with Jessica Martin and David Firth. Later in the year, George S. Kaufman's Hollywood Pinafore (based on Gilbert and Sullivan's H.M.S. Pinafore) was presented with actors including Ian Lavender, Frank Lazarus and Matt Zimmerman. This was followed by a rare stage performance of Stephen Sondheim's The Frogs, starring James Vaughan. Finally, to mark the Gershwin centenary the company presented Strike Up the Band in the Barbican Concert Hall, with the BBC Concert Orchestra. The cast included Barry Cryer and Sam Kelly.http://www.qsulis.demon.co.uk/Reviews/Lost_Musicals_1998_Review.htm", "This was followed in 2000 by a move to the Royal Opera House, Covent Garden. The Kurt Weill centenary was marked in December of that year by a semi-staging of One Touch of Venus, which included a reconstruction of Agnes de Mille's original choreography, which was performed by the Central School of Ballet. The cast included Jessica Martin and Louise Gold, with the Royal Philharmonic Concert Orchestra.http://www.whatsonstage.com/news/theatre/london/E0194408679/Lost+Musicals+Celebrates+Weill+with+Venus.html", "In 2001, Fisher presented a fund-raising gala at the Royal Opera House called A Lost Musicals Occasion, which featured appearances by Gold, Kitty Carlisle Hart, Liza Pulman and Jessica Martin.http://www.whatsonstage.com/index.php?pg=207&story=E882992883195 This was followed later that year by two performances of Porter's Du Barry Was a Lady at Her Majesty's Theatre, with accompaniment by the BBC Concert Orchestra. The cast included Gold, Lauren Ward, James Vaughan and Desmond Barrit. The production was broadcast on BBC Radio 3 on 27 December 2001.http://www.qsulis.demon.co.uk/Website_Louise_Gold/Dubarry_Was_A_Lady_2001.htm The 2001 season also included three fund-raising performances of Cole Porter's Let's Face It in New York at the New York Historical Society in September, while the short 2002 season consisted of two performances of Porter's Fifty Million Frenchmen at the Royal Opera House, with a cast including Laura Michelle Kelly, Dilys Laye and Alan Cox.http://www.whatsonstage.com/news/theatre/london/E8821025686187/Lost+Musicals+Premieres+Cole+Porter's+Frenchmen.html"]}, {"page": "List of LGBT-related films of 1990", "response": ["|The Garden ||  || United KingdomGermany || Drama || Tilda Swinton, Johnny Mills, Philip MacDonald, Pete Lee-Wilson, Spencer Leigh, Jody Graber, Roger Cook, Kevin Collins, Jack Birkett, Dawn Archibald, Milo Bell, Vernon Dobtcheff, Michael Gough, Mirabelle La Manchega and Jessica Martin ||"]}, {"page": "Gregory Evans (dramatist)", "response": ["Gregory Evans is a British television scriptwriter, playwright and radio dramatist. He has also written short stories, features and reviews for journals such as Harpers & Queen, Woman's Journal, The Observer and The Guardian online, and worked as a film critic for Harper's. He has published a book for young children, Owl in the House. His stage adaptation of H. E. Bates's novel Fair Stood the Wind for France was produced at the Royal Theatre (Northampton). His tragi-comedy Shirleymander, inspired by Andrew Hosken's book Nothing Like a Dame, was staged at the newly-opened Playground Theatre in West London in May and June 2018. It was directed by Anthony Biggs and starred Jessica Martin and Jack Klaff."]}, {"page": "Shirleymander", "response": ["In 2018, a stage play adapted from the radio drama opened at the Playground Theatre in west London, where the production ran for several weeks. It starred Jessica Martin as Porter."]}, {"page": "And There's More", "response": ["* Jessica Martin"]}]}}