{"wiki_id": "http://www.wikidata.org/entity/Q6181874", "itemLabel": "Jeremy Sheldon", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeremy_Sheldon", "wikipedia_page": {"main": "Jeremy Sheldon (born 1971) is a British screenwriter, author and lecturer.\nSheldon was educated at Eton College and at the University of East Anglia where he graduated with a degree in English Literature and Philosophy and an MA in Creative Writing.", "link_mentions": [{"page": "List of Old Etonians born in the 20th century", "response": ["*Jeremy Sheldon (born 1971), author"]}, {"page": "UEA Creative Writing Course", "response": ["*Jeremy Sheldon (MA, 1996), novelist"]}, {"page": "Horror convention", "response": ["* Fright Night Film FestJeremy Sheldon HORROR HOUND Issue #40. HORROR HOUND LTD., Publishers. March/April, 2013. p.66.Jeremy Sheldon HORROR HOUND Issue #41. HORROR HOUND LTD., Publishers. May/June, 2013. p.59."]}, {"page": "C. M. Taylor", "response": ["Taylor co-wrote (with Jeremy Sheldon) the screenplay of the 2015 film Writers Retreat."]}, {"page": "Comfort zone (disambiguation)", "response": ["*The Comfort Zone, a novel by Jeremy Sheldon"]}, {"page": "Fright Night Film Fest", "response": ["The horror magazine Horror Hound has sponsored the festival for many years and called it \"the largest genre film festival in the country.\"Jeremy Sheldon HORROR HOUND Issue #40. HORROR HOUND LTD., Publishers. March/April, 2013. p.66. Moreover, the Louisville government publicly announced that this film festival is the country's largest genre-specific film festival."]}, {"page": "Allies (film)", "response": ["Allies is a 2014 British Independent World War II film written by Jeremy Sheldon and directed by Dominic Burns. It stars Julian Ovenden, Chris Reilly, Matt Willis, Edmund Kingsley, Leon Vickers, Mark Moraghan, Paul Ridley, Frank Leboeuf, and Steven Hartley. Allies was released on 1 November 2014 in the UK and is distributed by eOne."]}, {"page": "Golden Years (2016 film)", "response": ["Golden Years is a 2016 British action comedy film directed by John Miller and written by Miller, Nick Knowles and Jeremy Sheldon. It follows the exploits of a group of pensioners who, having seen their pensions diminished, decide to tour National Trust properties in their caravan and rob nearby banks. It stars Bernard Hill, Virginia McKenna, Simon Callow, Una Stubbs, Alun Armstrong and Phil Davis."]}]}}