{"wiki_id": "http://www.wikidata.org/entity/Q6181920", "itemLabel": "Jeremy Stangroom", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeremy_Stangroom", "wikipedia_page": {"main": "Jeremy Stangroom is a British writer, editor, and website designer. He is an editor and co-founder, with Julian Baggini, of The Philosophers’ Magazine, and has written and edited several philosophy books. He is also co-founder, with Ophelia Benson of the website 'Butterflies and Wheels'.", "link_mentions": [{"page": "Gödel's incompleteness theorems", "response": ["* Jeremy Stangroom and Ophelia Benson, Why Truth Matters, Continuum. "]}, {"page": "Sutton Grammar School", "response": ["*Jeremy Stangroom – author on philosophy"]}, {"page": "List of people associated with the London School of Economics", "response": ["* Jeremy Stangroom, philosopher"]}, {"page": "List of philosophers born in the 20th century", "response": ["* Jeremy Stangroom"]}, {"page": "Ophelia Benson", "response": ["In 2004, Benson co-authored The Dictionary of Fashionable Nonsense with Jeremy Stangroom. It is a satire on post-modernism, modern jargon and anti-rationalist thinking in contemporary academia. The Times Literary Supplement said \"With wit and invention, Benson and Stangroom take us through the checklist argot that so often litters postmodern texts.\""]}, {"page": "Criticism of Muhammad", "response": ["Jeremy Stangroom and Ophelia Benson argue that Aisha \"was much too young to have offered anything like her informed consent, even if it had been sought\". Writing that Muhammad's life is considered exemplary for Muslims and one to which all Muslim men should aspire, they quote Kecia Ali: \"accepting the rightness of his act raises the question: on what basis can one reject the marriage of young girls today?\" They also compare the practice of child marriage to that of colonial slavery, arguing that both practices were legal at the time but are now seen as inherently immoral."]}, {"page": "Why Truth Matters", "response": ["Why Truth Matters is a book by Ophelia Benson and Jeremy Stangroom published by Continuum Books in 2006.", "Author Johann Hari called it \"a sassy and profound response to this cascade of superstition and silliness.\"Johann Hari.Why Truth Matters by Ophelia Benson and Jeremy Stangroom, The Independent, May 14, 2006", "Category:Works by Jeremy Stangroom"]}, {"page": "The Dictionary of Fashionable Nonsense", "response": ["The Dictionary of Fashionable Nonsense: A Guide for Edgy People is a 2006 book by Ophelia Benson and Jeremy Stangroom.", "Category:Works by Jeremy Stangroom"]}, {"page": "Julian Baggini", "response": ["In 1997 Baggini co-founded The Philosophers' Magazine with Jeremy Stangroom."]}, {"page": "List of University of Southampton people", "response": ["* Jeremy Stangroom, writer, editor, and website designer"]}, {"page": "The Philosophers' Magazine", "response": [" (TPM), an independent quarterly magazine founded in 1997, aims  to provide a venue for philosophy in an accessible and entertaining format. The founders were Julian Baggini and Jeremy Stangroom. The magazine includes articles, book reviews, interviews, and other content. TPM is edited by James Garvey, while Jeremy Stangroom edits its sister website, TPM Online. The magazine is distributed in the US and Canada by the Philosophy Documentation Center."]}, {"page": "James Garvey (philosopher)", "response": ["He is Managing Director of the Royal Institute of Philosophy, an educational charity supporting philosophy inside and outside the academy.People, The Royal Institute of Philosophy, 2012. Retrieved 18 October 2012. He is editor of The Philosophers’ Magazine, a quarterly which aims to publish readable, accessible philosophy.The Philosophers’ Magazine   With Jeremy Stangroom, he edits Think Now, a series of books on social and political philosophy. He is a regular and controversial contributor to The Guardian, commenting on morality and climate change, arguing that the developed nations have a moral obligation to take action.Profile from The Guardian He has a PhD in Philosophy from University College London.", "*The Great Philosophers, 2005 (With Jeremy Stangroom)", "*The Story of Philosophy: A History of Western Thought, 2012. (With Jeremy Stangroom)"]}]}}