{"wiki_id": "http://www.wikidata.org/entity/Q6194114", "itemLabel": "Jim Causley", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Jim_Causley", "wikipedia_page": {"main": "Jim Causley is an English folk singer, songwriter, and musician from Devon who specializes in the traditional songs and music of the West Country. Journalist Colin Irwin has called him \"the finest singer of his generation\".", "link_mentions": [{"page": "List of folk musicians", "response": ["*Jim Causley"]}, {"page": "English folk music", "response": ["Outside Devon and Cornwall Celtic influence on music in the West Country is much less obvious, but folk music still retains many distinctive local characteristics. As in Cornwall there are very strong traditions of folk dance and mumming, the best known being the Hobby horse celebrations at Minehead in Somerset.C. Hole and Val Biro, British Folk Customs (London: Hutchinson, 1976), p. 133. The maritime heritage of Devon made sea shanties, hornpipes and naval or sea ballads important parts of regional folk music. From the 19th century accordions have been a popular and accepted part of the local folk sound. Folk songs from the West Country include ‘Widdecombe Fair’, ‘Spanish Ladies’ and ‘The Seeds of Love.’ The region was important in the first folk revival, as the Devon-born antiquarian Sabine Baring-Gould invested effort in collecting regional music, published as Songs and Ballads of the West (1889–91), the first collection published for the mass market. He later collaborated with Cecil Sharp who, with Charles Marson, produced a three volume Folk-Songs from Somerset (1904–09).J. Shepherd, Media, Industry and Society (London: Continuum International, 2003), p. 44. Other collectors included Henry and Robert Hammond in Dorset, the Reverend Geoffrey Hill in Wiltshire, Percy Grainger in Gloucestershire and, perhaps the most famous, Ralph Vaughan Williams' 'Folk Songs from Somerset', which provided themes for his English Folk Song Suite.D. Manning, Vaughan Williams on Music (Oxford: Oxford University Press, 2008), p. 284. In the second folk revival the most famous West country musicians were melodeon-player Bob Cann and writer, performer and broadcaster Cyril Tawney, 'The Father of the West Country Folk Revival'.Civil Tawney, http://myweb.tiscali.co.uk/cyriltawney/enter.htm, retrieved 14/02/09. In the 1970s there were figures such as Tony Rose.‘Tony Rose’ Independent on Sunday 12 June 2002, , retrieved 14/02/09. The same period saw one of the most surprising hybrids in music history Scrumpy and Western with bands like the Wurzels and The Yetties, who took most of the elements of West Country folk music for comical folk-style songs with affectionate parodies of more mainstream musical genres, delivered in local West Country dialects.Scrumpy and Western, http://www.scrumpyandwestern.co.uk/, retrieved 14/02/09. More seriously, the West Country and particularly Devon, have produced some of the most successful folk artists of recent years, including Show of Hands, Mark Bazeley and Jason Rice, Paul Downes, Jim Causley, Seth Lakeman and his brothers.L. Joint, ‘Devon stars up for folk awards’, BBC Devon, 01/06/09, http://www.bbc.co.uk/devon/content/articles/2009/01/06/folk_awards_2009_feature.shtml, retrieved 14/02/09. The region has numerous folk clubs and annual festivals, including those at Portsmouth and the first modern English folk festival to be established at Sidmouth in Devon along with its associated 'Late Night Extra' venue at Bulverton .Folk and Roots, , retrieved 14/02/09."]}, {"page": "Stargazy pie", "response": ["Jim Causley references \"starry-gazey pie\" on the track \"My Young Man's a Cornishman\" on his 2013 album Cyprus Well. The song comes from a poem by his distant relative Charles Causley (1917-2003)."]}, {"page": "Charles Causley", "response": ["Music at the Festival has included regular appearances from Causley's distant relative, folk singer Jim Causley. featuring his settings of Causley poems, some of which have been recorded for commercial CDs. One of these was actually made in (and entitled) 'Cyprus Well', Causley's home of many years in Launceston, and using Causley's own piano there. Many other musicians and groups have featured, too: The Fisherman's Friends, Cahal Dallat, and Seth Lakeman.", "In terms of Causley's musical legacy, an original opera by Steven McNeff based on Causley's libretto 'The Burning Boy', was premiered by the Bournemouth Symphony Orchestra's Kokoro Ensemble in Launceston and St. Ives in November 2017. The majority of the songs of Alex Atterson (1931–1996) are settings of Causley poems.Woods, Fred (1979), Folk Revival. Poole, Dorset: Blandford; p. 118. A number of other settings have been made of Causley poems over many years, by musicians such as Jim Causley (see above), Natalie Merchant, Johnny Coppin, Mervyn Horder and Phyllis Tate. New versions continue to be composed and performed."]}, {"page": "Waterson:Carthy", "response": ["Rose left shortly thereafter to take up a career in the pharmaceutical industry and was replaced by Tim van Eyken in 2000. This line-up went on to release the albums A Dark Light (2002) and Fishes & Fine Yellow Sand (2004) and to consolidate the group's reputation as an outstanding live band. Holy Heathens and the Old Green Man (2006), an album of seasonal songs on which they were joined by vocal trio The Devil's Interval (Jim Causley, Lauren McCormick & Emily Portman) was widely considered both a belated follow-up and an addendum to The Watersons' Frost & Fire (1965). The group had already re-established The Watersons' tradition of performing a pre-Christmas tour under the Frost & Fire banner and by December 2006 this had been expanded to include a Mummers Play, brass section and a more significant contribution from The Devil's Interval."]}, {"page": "Jack Clemo", "response": ["In recent years, there has been a resurgence of interest in Jack Clemo, led by writer and editor Luke Thompson. This has led to the publication of a new Selected Poems (Enitharmon, 2015), a complete collection of dialect tales A Proper Mizz-Maze (Francis Boutle, 2016), a pamphlet short story The Clay Dump (Guillemot Press, 2016), an album of Clemo's poetry, Clay Hymnal, set to music by folk musician Jim Causley, and the first full biography of Jack Clemo, written by Luke Thompson and entitled Clay Phoenix (Ally Press, 2016)."]}, {"page": "Siúil a Rún", "response": ["* Jim Causley – Shulé Rune (Lost Love Found – 05) (2007)"]}, {"page": "Show of Hands", "response": ["As well as carrying on with sharing their music for free, Show of Hands also continue to share their expertise in workshop tours across the world{No Secrets. A Visual History of Show of Hands. Flood Gallery Publishing . pp. 218–219} and to give new acts a break by booking them as their supporting artists. By warmly introducing their guest artists themselves at each gig, and including them in a spot in their performance, Show of Hands aim to ensure that new artists are taken to heart by their audiences.{Jim Causley, Megan Henwood, Philip Henry and Hannah Martin, Jackie Oates: No Secrets. A Visual History of Show of Hands. Flood Gallery Publishing . pp. 218–219}", "Their Five Days in May tour in '97 featured Kate Rusby on her first major solo venture. The tour culminated with a show at the Shepherds Bush Empire. Both separately and as Show of Hands Knightley and Beer continue to mentor and give touring opportunities to new artists, including Seth Lakeman, Jenna Witts, Jackie Oates, Megan Henwood, India Electric Company, Jim Causley, and Phillip Henry & Hannah Martin. Knightley has gone on to collaborate with Lakeman and their co-written Haunt You opened Show of Hands 2012 album, Wake the Union."]}, {"page": "David Rotheray", "response": ["Rotheray announced the release of his first 'solo' album, The Life of Birds for 16 August 2010, on the Proper Music label.Never Enough Notes  Although ostensibly a solo effort, the record featured collaborations with ten different singer/songwriters including Alasdair Roberts, Jim Causley, Eliza Carthy and Camille O'Sullivan.", "Following its release in 2010, The Life of Birds was generally well received critically. In November 2010 and again in March 2011, Rotheray embarked on a tour, playing the album in full, with Jim Causley and Bella Hardy handling all the vocal duties. The live shows were also well received.Spiral Earth live show (Bristol) review, 1 April 2011 "]}, {"page": "Sidmouth Folk Festival", "response": ["The 2014 festival included performances by Ralph McTell, Steve Knightley, Jim Causley, Jackie Oates, India Electric Co., Phillip Henry & Hannah Martin, Martin Simpson, Alex Kumar, Matt Gordon & Leonard Podolak, festival patron Martin Carthy, and others throughout the week.", "The 2013 Sidmouth Folk Week included concerts by Show of Hands with Miranda Sykes, Blowzabella, Colum Sands, the a capella singers Coope, Boyes and Simpson, Tim Eriksen,  John Kirkpatrick, Jim Causley, Maddy Prior with Hannah James and Giles Lewin, The Spooky Men's Chorale from Australia, and Jeff Warner from New England in the USA."]}, {"page": "Exeter College, Exeter", "response": ["* Jim Causley, folk musician"]}, {"page": "Whimple", "response": ["The Whimple Wassail song and processional tune were recorded by local folk musician Jim Causley, a native of Whimple, on his album Fruits of the Earth, a collection of traditional Devonshire and Westcountry songs, released in 2005 on WildGoose Records."]}, {"page": "Clyst Vale Community College", "response": ["*Jim Causley - Musician (born 1980) -"]}, {"page": "Inter Varsity Folk Dance Festival", "response": ["*2009 happened in Exeter, between 27 February and 1 March. The line-up included Kate Rusby, The Demon Barbers. Jackie Oates also appeared with Jim Causley.  Main ceilidhs were provided by The Committee Band and Stomp with over 40 workshops taking place over the weekend, as well as the infamous Survivor's Ceilidh!  All events were back on one site, including sleeping, food and all the late night sessions.  2009 Festival website. The festival was attended by in excess of 1150 visitors, the most ever at any IVFDF."]}, {"page": "Folkworks", "response": ["Folkworks was instrumental in the creation of the first BMus in Folk and Traditional Music in England which began in 2001 and still plays a part in its running at the University of Newcastle upon Tyne, currently under the stewardship of acclaimed Shetland fiddler and teacher Catriona MacDonald. It was initially based in the Old Town Hall, Gateshead for three years due to the late opening of the Sage, Gateshead where it moved to in 2005. Past lecturers have included musicians Alistair Anderson, Sandra Kerr, Kathryn Tickell, Vic Gammon and Karen Tweed. Successful folk musicians who were among the first students to graduate from the degree course include Ian Stephenson, Fay Hield, Damien O'Kane, Tom Oakes, Jim Causley, Rachel McShane, Calum Stewart, Emily Portman and David Newey."]}, {"page": "Holy Heathens and the Old Green Man", "response": [":*Jim Causley (vocals)"]}, {"page": "Trusham", "response": ["Trusham was the ancestral home of the Causley family, whose descendants include the poet Charles Causley and the folk singer Jim Causley. Causley's poem \"Trusham\" is an account of a return he made to the village in his later years; a reflection on one's family roots, what it is to be distant from those, and the legacies we leave behind us. Jim Causley's setting of this poem—amongst a number of other poems by his distant relation—is a modern song-setting, and is available on the album Cyprus Well. A later poem, \"The Prodigal Son\", recounts a further visit by Causley to his ancestral village, linking once again the local geography, history and landscape with the First World War and his own family memories. In 2007, Trusham held the first Charles Causley Festival in conjunction with the Charles Causley Society of Launceston. There is a plaque in the village to celebrate Causley's life and the Charles Causley Society hold regular events in Trusham such as Causley readings and poems set to music, hog roasts and barn dancing."]}, {"page": "List of people from Devon", "response": ["*Jim Causley (b. 1980, Heavitree), folk singer and radio presenter"]}, {"page": "List of people from Exeter", "response": ["*Jim Causley (born 1980), folk singer"]}, {"page": "Seán Rafferty", "response": ["* Various Artists - In Tune with the World: The Poetry of Seán Rafferty (2010 Brown Label Poetry), featuring readings by Jim Causley, Michael and Clare Morpurgo, Carol Hughes, Nicholas Johnson, Jane Fever and Vic Baines."]}, {"page": "Under One Sky (album)", "response": ["*Jim Causley - vocals (\"Will I See Thee More/Hush A Bye\")"]}, {"page": "Arrogance Ignorance and Greed", "response": ["The album begins with \"Lowlands\", a traditional song re-arranged by the duo. The song is an a cappella sung by Knightley alone. One commentary noted that the duo had the \"temerity\" to start the album with the piece, with Knightley's voice being \"starkly unaccompanied,\" whilst another noted that his vocal provides a \"deceptively underpowered-seeming opening gambit, and yet before too long you feel it subliminally creeping up on you with the onset of some eerie drone instrumentation, as Steve's voice acquires a breathtaking and disturbing quality.\" The BBC noted that \"Knightley’s boldly coarse delivery of \"Lowlands\" instantly sets up the mood of rugged wayness that characterises the record.\" The song is followed by the tongue-in-cheek \"Evolution\", which primally purveys Knightley's own personal stance on Darwinian theory. The third track, \"The Man I Was\", is one of the album's most autobiographical and \"penetratingly soul-searching\" songs. The \"biting social comment\" of \"The Napoli\" is a collaboration with Jim Causley and the Delarre Brothers, and features Knightley's \"wry observance and his perceptive wit.\" The song is followed by the duo's cover version of Bob Dylan's \"Senor (Tales of Yankee Power)\".", "*Jim Causley, vocals [4];"]}, {"page": "20 (Kate Rusby album)", "response": ["#\"I Courted a Sailor\" featuring Jim Causley - 4:42", "#\"Home\" featuring Mary Chapin Carpenter and Jim Causley - 3:51"]}, {"page": "Centenary: Words & Music of the Great War", "response": ["The second disc, Songs Inspired by the Great War, is dominated by songs instead of poetry, with Show of Hands presenting distinctive versions of World War I favourites as well as newer material and songs composed especially for the project inspired by the war. Unlike the first disc, Show of Hands were given a free rein, and on occasion, they took music from the first disc and extended it. Knightley created \"Requiem\" and his own setting of Housman's \"The Lads in their Hundreds\", as well as the duo's occasional collaborator Chris Hoban, lead singer of Bellowhead, appearing on \"The Padre\" and \"Love Will Make the World Go Round\", whilst previous collaborator Jackie Oates and Jim Causley appear on a medley of \"Goodbye-ee\" and \"If You Were the Only Girl in the World\" whilst \"The Sunshine of Your Smile\" features Miranda and Rex Preston. Knightley's composition \"The Keeper\" (\"The Gamekeeper\"), played with a mandolin, overlaps with the traditional songs \"The Keeper\" and \"The Water is Wide\" and features Phil Henry and Hannah Martin. The disc also contains a \"beatbox harmonica treatment\" of \"It's a Long Way to Tipperary\".Show of Hands: Centenary – Words & Music of the Great War review | Music | The Guardian \"The Blue Cockade\" features the Urban Soul Orchestra, who had accompanied Show of Hands on tour the previous year."]}, {"page": "Forgotten Kingdom", "response": ["Forgotten Kingdom is folk singer-songwriter Jim Causley's fifth studio album excluding his work with The Devil's Interval and Mawkin:Causley.", "All songs by Jim Causley.", "* Jim Causley – accordion, piano, vocals", "* Executive Producer – Jim Causley", "Category:Jim Causley albums"]}, {"page": "Bryony Griffith", "response": ["In 2017 Griffith joined Paul Sartin, Jim Causley and Jackie Oates to produce The Wanton Seed, a concert series celebrating the reissue of the song books Marrowbones (EFDSS 2007) and The Wanton Seed (2015) and mark the launch of Southern Harvest the new omnibus edition of The Foggy Dew and The Constant Lovers. She also joined Kate Locksley, Ewan McLennan and John Kirkpatrick to produce The Theatre Ballads – a piece blending historic ballads with puppetry and illustration – for Cecil Sharp House in London, and was created by Horse and Bamboo Theatre, and became a Musician in Residence at the National Coal Mining Museum for England, Yorkshire, as part of an EFDSS scheme. She has become a senior lecturer on the BA (Hons) Music (Folk) degree course at Leeds College of Music, which took its first students in September 2018."]}]}}