{"wiki_id": "http://www.wikidata.org/entity/Q6196813", "itemLabel": "Jim McGinlay", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Jim_McGinlay", "wikipedia_page": {"main": "James Anthony McGinlay (born 9 March 1949 in Lennoxtown, Stirlingshire, Scotland) is a Scottish bass guitarist who formed along his elder brother Kevin a hard-rock band called Salvation, in Glasgow, which after numerous line-up changes included Midge Ure, future Ultravox frontman and Live 8 contributor, Billy McIsaac and Kenny Hyslop.\nBy 1964, he began his musical career, forming The Strollers, along his brothers Kevin on lead guıtar and Hugh on rhythm guıtar and cousin Ernie Slater on drums, in which he played bass guitar. In the rest of years of the 1960s he was in another three bands, the last of them, the second with his brother Kevin, called Friendly Persuasion, which became famous.In June 1970, Friendly Persuasion disbanded and Jim and Kevin formed Salvation, a pop supergroup with Nod Kerr on drums, Mario Tortolano on organ, and Ian Kenny on lead guıtar. Kenny left in December 1970 and was replaced by Brian Denniston and Kerr left around May 1971, being replaced by Matt Caırns. They also had Robin Bırrel on organ for a whıle. James Ure (shortly afterwards named Midge Ure) on lead guıtar, Billy McIsaac on organ and Kenny Hyslop on drums joined the brothers in March 1972. That membership remained until Kevin left in April 1974, so the remaining members changed the band name to Slik. The band had numerous musical styles including glam and soft rock, and after failed promising hits and the arrival of punk rock, McGinlay left the band on March 1977, being replaced by Russell Webb, but the band lasted until September and with another name, PVC2.\nLater he joined his brother Kevin's band Revival, that until now are active (but without Kevin).", "link_mentions": [{"page": "Midge Ure", "response": ["Ure joined Salvation as a guitarist in 1972. The band had been formed in Glasgow in June 1970 by the brothers Kevin (vocals) and Jim McGinlay (bass guitar). Jim McGinlay (born James McGinlay) decided to turn Ure's name backwards to \"Mij\" (Midge) to avoid any confusion caused by two members of the band having the same first name. Ure has since presented himself in the music scene as Midge Ure. The band performed covers as house band in the Glasgow and Edinburgh Clouds discothèques. The band also comprised Billy McIsaac on keyboards and Kenny Hyslop on drums.", "Slik achieved a number one single on the UK Singles Chart in February 1976 with \"Forever and Ever\". In early 1977, Jim McGinlay decided to quit the band, being replaced by Russell Webb. Slik terminated their contract with Martin and Coulter, believing that their boy-band image was hindering their chances of success during the rising punk rock scene. They changed their name to PVC2 and adopted a more punkish style. Ure's only release with the band under this name was the single \"Put You in the Picture\"."]}, {"page": "Slik", "response": ["Slik were formed as the Glasgow based band 'Salvation' in June 1970, comprising brothers Kevin McGinlay (vocals) and Jim McGinlay (bass), Nod Kerr (drums), Mario Tortolano (keyboards), and Ian Kenny (guitar). Brian Deniston replaced Ian Kenny in December 1970 and Nod Kerr departed in May 1971, followed by Tortolano and they were replaced by Matt Cairns on drums and Robin Birrel on keyboards. Deniston left shortly after this change and they were forced to continue as a four-piece outfit for almost a year, with Kevin McGinlay taking up guitar duties. Birrel and Cairns then left in March 1972 and they recruited Kenny Hyslop on drums, Billy McIsaac on keyboards and Jim \"Midge\" Ure on guitar. They reverted to a four-piece band when Kevin McGinlay left in April 1974 to pursue a solo career, with Midge Ure becoming the band's lead vocalist.", "They changed their name to Slik in November 1974, and linked up with the pop songwriters Bill Martin and Phil Coulter, who were also writing for the Bay City Rollers. Now signed to Polydor, the band members all adopted pseudonyms - Midge, Oil Slik (Kenny Hyslop), Jim Slik (Jim McGinlay) and Lord Slik (Billy McIsaac). These were dropped after the failure of \"Boogiest Band in Town\", their debut single (which was also on the soundtrack of the film Never Too Young To Rock), and their suits were exchanged for baseball shirts.  A change of record label also saw them signing with Bell Records.", "In March 1977, Jim McGinlay left the group and was replaced by Russell Webb, a university drop-out, who continued for the final Slik gigs.", "| \"Again My Love\" (1975) || Jim McGinlay || 3:13", "| \"Again My Love\" (1975) || Jim McGinlay || 3:13", "| \"I Wanna Be Loved\" || Jim McGinlay || 2:35", "| \"No We Won't Forget You\" || Jim McGinlay || 5:17", "* Jim McGinlay — bass, backing vocals (June 1970-March 1977)"]}, {"page": "Lennoxtown", "response": ["*Jim McGinlay, Bass guitar player with bands Salvation and Slik, born Lennox Castle Hospital, 9 March 1949"]}, {"page": "Forever and Ever (Slik song)", "response": ["* B-side: \"Again My Love\" (Jim McGinlay)", "* Jim McGinlay: bass."]}, {"page": "Russell Webb (musician)", "response": ["Future Ultravox and Live Aid organiser, guitarist and singer Midge Ure, drummer Kenny Hyslop, keyboardist Billy McIsaac and bassist Jim McGinlay had been gaining commercial successes as a band named Slik, playing in a variety of styles, such as glam, soft rock and bubblegum pop. With the advent of punk rock, McGinlay left in early 1977. Webb, who had recently dropped out of university, replaced him. Shortly afterwards the band changed their name to PVC2 and their musical style to punk. PVC2 released one single, \"Put You in the Picture\", in 1977."]}, {"page": "Slik (album)", "response": ["The band continued until early 1977, when Jim McGinlay left the band, being replaced  by Russell Webb (later in The Skids and Public Image Ltd.), and the new line-up left the 1970s disco, soft and pop rock-oriented genre, moving to punk and changing the name to PVC2. The band released one single, \"Put You in the Picture\". Shortly afterwards, they disbanded, and Kenny Hyslop, Billy McIsaac and Russell Webb formed The Zones. Midge Ure moved to London and worked with Rich Kids, along ex-Sex Pistols Glen Matlock and future Visage bandmate Rusty Egan.", "* Jim McGinlay - bass guitar"]}, {"page": "Boogiest Band In Town", "response": ["\"Boogiest Band in Town\" is the debut single by Scottish glam rock band Slik. This was the first single and recording released by Midge Ure, singer and guitarist of the band, formed also by drummer Kenny Hyslop, bassist Jim McGinlay and keyboardist Billy McIsaac. The single was released in the first months of 1975,Slik - The Best Of booklet (Repertoire label, 1999). Chris Welch, London, England, 1999.Larkin, Colin. The Guinness Encyclopedia of Popular Music. Pg. 3827, Guinness Pub., 1995. , . In January 1975, their debut single, 'The Boogiest Band In Town' was released (...) being released by Polydor. However the song did not chart, but the band was featured playing the song in the glam rock movie Never Too Young To Rock, the same year.", "Slik were, formerly known by another name, Salvation, and were a popular local band, who played throughout Scotland. Salvation had one more member, Kevin McGinlay, brother of bassist Jim McGinlay, who left to follow a solo career in 1974; and without him, the band changed their name to Slik and signed a contract with Bay City Rollers' songwriters, Bill Martin and Phil Coulter. Martin & Coulter had just recently split with the Bay City Rollers and were looking for another Rollers type band. They struck big beginning with the second single, \"Forever And Ever\".", "* Jim McGinlay: bass"]}, {"page": "Put You in the Picture", "response": ["PVC2 was a Scottish punk band who resurged from the ashes of one-time promising teenybop band Slik, whose songs were a very different repertoire, with the typical 1970s soft and glam rock and Bay City Rollers-like songs. From early to almost-late 1976, the band was very popular in Britain, but the emergence of punk stopped all the prominence of the bands who established some time ago. The Slik album was unsuccessful, like the last singles, released until 1977. That year, then bassist Jim McGinlay departed, and got replaced by Russell Webb, who recently dropped university in Glasgow. The band continued performing like Slik, but changed abruptly of style, naming themselves as PVC2 and beginning to play punk rock."]}, {"page": "Billy McIsaac", "response": ["Previously, he worked as a telephone engineer and played with a band called The Bubbles. In 1972, he joined Salvation, formed by brothers Kevin and Jim McGinlay, along with drummer Kenny Hyslop and guitarist Midge Ure. After Kevin McGinlay left in 1974, the band became Slik and began to release singles, among them, two hits: \"Forever and Ever\" and \"Requiem\", both released in eponymous singles, in 1975 and 1976, respectively. Slik fame was growing during 1976, but late that year, punk rock bands were hitting the musical scene, so in 1977, the band changed their name, to PVC2, after McGinlay was replaced by Russell Webb, and began to play as the latter bands did.  In September 1977, Midge Ure left PVC2, and the rest called Willie Gardner to replace him, and the band renamed themselves as Zones. Zones lasted until 1979, and the band finally split up. McIsaac and Hyslop continued with a project called Science, a band considered as a continuation of Zones, but only McIsaac was the supposedly remaining member. Hyslop and bassist Russell Webb joined The Skids, Ure joined Thin Lizzy, Ultravox and Visage and the McGinlay brothers were working alone again."]}, {"page": "McGinlay", "response": ["*Jim McGinlay (born 1949), Scottish bass guitarist"]}, {"page": "If I Was: The Very Best of Midge Ure & Ultravox", "response": ["*Jim McGinlay – bass"]}]}}