{"wiki_id": "http://www.wikidata.org/entity/Q6192793", "itemLabel": "Jill Daniels", "itemDescription": "British film director", "wikipedia_url": "https://en.wikipedia.org/wiki/Jill_Daniels", "wikipedia_page": {"main": "Dr Jill Daniels is a British independent filmmaker and a Senior Lecturer in Film at University of East London.", "link_mentions": [{"page": "Wimbledon College of Arts", "response": ["* Jill Daniels (film director)"]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Jill Daniels"]}, {"page": "Antisemitism in the UK Labour Party", "response": ["In April 2018, 42 senior academics wrote to The Guardian condemning anti-Corbyn bias in coverage of the debate and suggested that \"Dominant sections of the media have framed the story in such a way as to suggest that antisemitism is a problem mostly to do with Labour and that Corbyn is personally responsible for failing to deal with it. The coverage has relied on a handful of sources such as the Board of Deputies, the Jewish Leadership Council and well-known political opponents of Corbyn himself.\" They continued: \"It is not 'whataboutery' to suggest that the debate on antisemitism has been framed in such a way as to mystify the real sources of anti-Jewish bigotry and instead to weaponise it against a single political figure just ahead of important elections. We condemn antisemitism wherever it exists. We also condemn journalism that so blatantly lacks context, perspective and a meaningful range of voices in its determination to condemn Jeremy Corbyn.\" The academics included Lynne Segal, Annabelle Sreberny, Beverley Skeggs, Gary Hall, Neve Gordon, Margaret Gallagher, Maria Chatzichristodoulou, Jill Daniels and Ruth Catlow. One of the academics, Jane Dipple of the University of Winchester, was herself investigated by her university and the Labour party over allegedly antisemitic posts on Facebook. In August 2018 the university said that Dipple no longer worked there but refused to say if she had been sacked or if she had resigned."]}]}}