{"wiki_id": "http://www.wikidata.org/entity/Q6192757", "itemLabel": "Jill Briscoe", "itemDescription": "Author, editor, and speaker", "wikipedia_url": "https://en.wikipedia.org/wiki/Jill_Briscoe", "wikipedia_page": {"main": "Jill Briscoe (born 29 June 1935) is a British American author, editor, and speaker. She has written or co-written over 40 books and serves as the founder and Executive Editor of Just Between Us magazine. She is a former member of the boards of directors of World Relief and Christianity Today.", "link_mentions": [{"page": "Oconomowoc, Wisconsin", "response": ["* Jill Briscoe – Evangelical author and speaker"]}, {"page": "1935 in the United Kingdom", "response": ["**Jill Briscoe, British American author, editor, and speaker"]}, {"page": "Elmbrook Church", "response": ["In 1998, Elmbrook celebrated its 40th Anniversary. The next year, a live, 10:45 am Sunday morning radio broadcast of worship services was added. In 2000, the church Plaza was completed, Stuart Briscoe retired as senior pastor, and his protégé, Mel Lawrenz, was installed as his successor. Stuart and Jill Briscoe were commissioned international ministers-at-large. In 2004, the International Center was established, a third Sunday service was added, and an 8:00 am live Sunday radio broadcast was added. In 2008, a grass activities area and the Mission Cafe coffee shop opened."]}, {"page": "Stuart Briscoe", "response": ["* Stuart & Jill Briscoe's Ministry website, Briscoe Ministries, Inc."]}, {"page": "Edward T. McDougal", "response": ["Edward T. McDougal grew up in Winnetka, Illinois, and graduated from Colorado College in Colorado Springs.  He is the son of C. Bouton McDougal, Vice President and General Counsel for R. R. Donnelley and former president of The Chicago Sunday Evening Club, a long-running religious radio (1922) and television (1955) broadcast program, which had world renowned speakers that included Billy Graham, Martin Luther King, Jr., John R.W. Stott, Ben Haden, Lloyd John Ogilvie, Bruce Larson, Stuart Briscoe, Jill Briscoe, Joni Eareckson Tada, Madeleine L'Engle, and Elisabeth Elliot."]}, {"page": "Just Between Us", "response": ["* Just Between Us, a Christian women's magazine founded by Jill Briscoe"]}, {"page": "Briscoe (surname)", "response": ["*Jill Briscoe, international speaker, author, magazine head and wife of Stuart Briscoe"]}]}}