{"wiki_id": "http://www.wikidata.org/entity/Q6199891", "itemLabel": "Jimmy Cowie", "itemDescription": "Scottish footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmy_Cowie", "wikipedia_page": {"main": "James G. Cowie (born in Keith, Scotland - died 1966) was a Scottish footballer.", "link_mentions": [{"page": "List of York City F.C. players", "response": ["The goalscoring record is held by Norman Wilkinson, with 127 league goals, and 143 in total, scored between 1954 and 1966. Keith Walwyn came three goals from equalling Wilkinson's total goals record, with 140 goals, including 119 in the league, scored between 1981 and 1987. Jimmy Cowie holds the records for the most league and total goals scored in a season, set in 1928–29, with 49 league goals in as many matches in the Midland League and 56 goals in all competitions. For the Football League-era, the record for most goals in a season is held by Arthur Bottom, who scored 39 in 1954–55."]}, {"page": "List of York City F.C. records and statistics", "response": ["*Most goals in a season: 56, by Jimmy Cowie in 1928–29.", "*Most league goals in a season: 49, by Jimmy Cowie in the Midland League, 1928–29.", "**6, by Jimmy Cowie against Stockton, FA Cup, 29 September 1928.", "**6, by Jimmy Cowie against Worksop Town, Midland League, 23 February 1929."]}, {"page": "History of York City F.C. (1922–1980)", "response": ["For 1924–25, the Midland League was reorganised because eight Football League clubs withdrew their reserve teams from the competition. York finished sixth in the Principal Competition that concluded in February 1925 and were runners-up to Denaby United in the North Subsidiary Competition. The club struggled financially in this period, and was only kept going by the enthusiasm and generosity of the directors. John Fisher, one of these benefactors, was elected chairman in 1925. The Midland League was restored to its previous size for 1925–26 and York finished in 16th place after a poor start to the season, from which they never recovered. York enjoyed their most successful Midland League season in 1926–27, when they finished in sixth place and scored 96 goals in 38 league matches. They surpassed the FA Cup's qualifying rounds for the first time this season, being beaten 2–1 by Second Division team Grimsby Town at Blundell Park in the second round. In 1927, the club made its first serious attempt for election to the Football League, but Barrow and Accrington Stanley were re-elected instead. Fisher resigned as chairman in August 1927 and Brown took the position for the second time. After ranking seventh in the Midland League in 1927–28, York appointed their first official manager in July 1928, with Jock Collier named as player-manager. York finished ninth in 1928–29, and Jimmy Cowie was the divisional top scorer with 49 goals. This was York's last season in the Midland League as the club won election to the Football League on 3 June 1929, taking the place of Ashington in the Third Division North."]}, {"page": "James Cowie", "response": ["* Jimmy Cowie (James G. Cowie, died 1966), Scottish footballer"]}, {"page": "Cowie (surname)", "response": ["*Jimmy Cowie, Scottish footballer"]}, {"page": "List of York City F.C. players (25–99 appearances)", "response": ["Jimmy Cowie set two goalscoring records in the 1928–29 season which, as of the date above, still stand; he scored 56 goals in all competitions, and 49 league goals in as many matches in the Midland League. The first player capped at full international level while with the club was Eamon Dunphy when he appeared for the Republic of Ireland against Spain on 10 November 1965.For country:  The purchase of Adrian Randall from Burnley on 28 December 1995 represents the club's record transfer fee paid, at £140,000.", "Other players took part in significant matches in the history of the club. David Archibald, Jimmy Cowie, Charlie Davis, Sam Evans, Jack Farmery and Bill Gardner appeared in York's first Football League match in 1929. Keith Houchen scored the winning goal with a penalty in a 1–0 win over First Division club Arsenal in the 1984–85 FA Cup. Four men listed here featured in the York team that won in the 2012 Conference Premier play-off Final, those being Jon Challinor, Chris Doig, Jamie Reed and Jason Walker."]}, {"page": "1929–30 York City F.C. season", "response": ["!scope=row|Jimmy Cowie"]}]}}