{"wiki_id": "http://www.wikidata.org/entity/Q61971880", "itemLabel": "Dennis Lennon", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Dennis_Lennon", "wikipedia_page": {"main": "John Dennis Lennon  (23 June 1918 – 16 April 1991) was a British architect, interior designer, and furniture designer. He was responsible for the interior design of the Queen Elizabeth 2 and of 190-192 Sloane Street, London.\nLennon worked for Fry, Drew & Partners and became the first director of London's Rayon Centre. In 1950, he formed his own firm, Dennis Lennon and Partners, later significantly contributing to the 1951 Festival of Britain. He took over Hamper Mill, near Watford, restoring decaying buildings.\nHe was the recipient of the Military Cross for his service during the Second World War and was made a Commander of the Order of the British Empire for his work as an architect and designer.", "link_mentions": [{"page": "Queen Elizabeth 2", "response": ["Dennis Lennon was responsible for co-ordinating the interior design, and his team included Jon Bannenberg and Gaby Schreiber, although Lennon's original designs only remained intact for three years."]}, {"page": "Lennon (name)", "response": ["* Dennis Lennon (1918–1991), British architect and interior designer"]}, {"page": "Terence Conran", "response": ["Conran's first professional work came when he worked in the Festival of Britain (1951) on the main South Bank site. He left college to take up a job with Dennis Lennon's architectural company, which had been commissioned to make a 1/4-scale interior of a Princess Flying Boat."]}, {"page": "Dennis", "response": ["* Dennis Lennon (1918–1991), British architect and interior designer"]}, {"page": "Peter Evans (restaurateur)", "response": ["The chain of steak houses grew but the partnership with Beale and Eastwood did not long survive before Evans split and started the Peter Evans Eating Houses, with establishments in, e.g. Fleet Street (with a teleprinter), Chelsea, and Kensington. Evans turned to David Hicks, the most brilliant of the young designers (others being Terence Conran, Dennis Lennon and Michael Inchbald also making a name for themselves in the 'relatively new field of restaurant design,' according to Mood and Atmosphere in Restaurants) and architects Garnett, Cloughley and Blakemore,  to design the PEEH restaurants and in 1967 Hicks designed the most enduring of Evans's creations, Raffles,  one of the tiny number of traditional and high-flyer clubs surviving from the Sixties to this day."]}, {"page": "John Lennon (disambiguation)", "response": ["*Dennis Lennon or John Dennis Lennon (1918–1991), British architect, interior designer, and furniture designer"]}, {"page": "Glyndebourne Festival Opera: history and repertoire, 1952–63", "response": ["|1963 || Capriccio ||  Strauss  ||  Elisabeth Söderström (Countess), Horst Wilhelm (Flamand), Raymond Wolansky (Olivier), Benno Kusche (La Roche), Tom Krause (Count), Soňa Červená (Clairon) ||  John Pritchard/Bryan Balkwill ||  Günther Rennert ||  Dennis Lennon/Anthony Powell"]}, {"page": "1968 Birthday Honours", "response": ["* John Dennis Lennon, , Architect and Designer."]}, {"page": "190-192 Sloane Street", "response": ["The building was designed by the architects Brett and Pollen, primarily partner Harry Teggin, for the Cadogan Estate, and completed in 1965. The interiors were designed by Dennis Lennon, with fittings by the sculptor Robert Adams, but do not survive."]}, {"page": "John Dennis Lennon", "response": ["#REDIRECT Dennis Lennon"]}, {"page": "Dennis Lennon and Partners", "response": ["#REDIRECT Dennis Lennon"]}, {"page": "Dennis Lennon & Partners", "response": ["#REDIRECT Dennis Lennon"]}, {"page": "Hamper Mill House", "response": ["It was once the home of the interior designer Dennis Lennon."]}]}}