{"wiki_id": "http://www.wikidata.org/entity/Q6193412", "itemLabel": "Jim Appleby", "itemDescription": "English footballer (1934-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jim_Appleby", "wikipedia_page": {"main": "James Park Appleby (15 June 1934 – 6 January 2014) was an English professional footballer who played as a defender.\nAppleby started his professional career with Burnley after playing amateur football with Wingate Welfare. He made his debut for the club on 1 May 1957 in the 0–1 home defeat to Blackpool. He then moved to local rivals Blackburn Rovers but played only two league matches for the club during a four-year spell. In 1961, Appleby joined Southport where he made 13 league appearances in one season with the team. He ended his professional career with Chester, where he played one match in the 1962–63 season before moving into non-league football. He had a spell as manager of Horden Colliery Welfare during the 1960s.Appleby, aged 79, died on 6 January 2014. He was preceded in death by his wife Margaret and is survived by three children.", "link_mentions": [{"page": "Billy Wilson (footballer, born 1936)", "response": ["William Wilson (born 23 September 1936) is a former professional footballer from Northern Ireland. He played as a wing half. He started his career with his hometown club, Portadown, and made his debut for the club at the age of 16. In 1955, Wilson moved to England to join Football League First Division side Burnley and initially played in the reserves. He made his first appearance for the senior team in the 0–1 defeat to Blackpool on 1 May 1957, alongside fellow debutant Jim Appleby. Wilson played only one more match for Burnley, deputising for regular right-half Bobby Seith for the 0–7 loss against Nottingham Forest on 18 September 1957. He was released from his contract in May 1958 and despite interest from Crewe Alexandra and Notts County, he returned to Northern Ireland and signed for Linfield"]}, {"page": "Appleby (surname)", "response": ["*Jim Appleby (1934–2014), English footballer"]}, {"page": "2013–14 in English football", "response": ["* 6 January 2014: Jim Appleby, 79, former Burnley, Blackburn Rovers, Southport and Chester defender."]}, {"page": "Deaths in January 2014", "response": ["*Jim Appleby, 79, English footballer (Blackburn Rovers).Jimmy Appleby passes away"]}, {"page": "2014 in the United Kingdom", "response": ["**Jim Appleby, 79, footballer."]}, {"page": "1962–63 Chester F.C. season", "response": ["||| style=\"text-align:left;\" | Jim Appleby"]}]}}