{"wiki_id": "http://www.wikidata.org/entity/Q6195122", "itemLabel": "Jim Gallacher", "itemDescription": "Scottish footballer (born 1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jim_Gallacher", "wikipedia_page": {"main": "James Gallacher (born 29 March 1951) is a Scottish former football goalkeeper. Gallacher played for Arbroath and Clydebank in the Scottish Football League. He made over 600 league appearances for the Bankies in a career that spanned four decades (late 1960s to early 1990s) and was fondly known as 'Easy the Gal' by the club's supporters. He followed his playing career at New Kilbowie Park by coaching the club's goalkeepers until 1997. Then followed a spell from 2001 until 2008 coaching with the Scotland Women's National team. That ended and until 2016 Jim was goalkeeper coach at DumbartonHis son, Paul Gallacher, also became a professional football goalkeeper, playing for Dundee United, Norwich City and Scotland, while his nephew Tony Gallacher was previously on the books of Liverpool.", "link_mentions": [{"page": "Paul Gallacher", "response": ["He is the son of Jim Gallacher, a goalkeeper who played in the Scottish Football League for 22 years, and the cousin of full-back Tony Gallacher, who was previously on the books of Liverpool."]}, {"page": "Gallacher", "response": ["*Jim Gallacher, Scottish football goalkeeper (Clydebank)"]}, {"page": "Ken Eadie", "response": ["Eadie played as a striker and spent the longest part of his playing career with Clydebank, hitting 149 goals on his 276 league games; he is the club's all-time leading scorer. Eadie won the 'Daily Record Golden Boot' in 1991, clinching it on the final day of the season with 4 second half strikes in a 7–1 victory over Partick Thistle at New Kilbowie Park which saw him pip Gordon Dalziel and finish the season with 30 goals. Eadie was inducted into the Clydebank Hall of Fame alongside Jim Fallon, Jim Gallacher and Davie Cooper."]}, {"page": "Gemma Fay", "response": ["Fay made her senior Scotland debut against Czech Republic in May 1998 and Fay won 23 Scotland caps before the age of 19. She praised the contribution of her national goalkeeping coach, Jim Gallacher."]}, {"page": "Tony Gallacher", "response": ["Tony is the nephew of Jim Gallacher and cousin of Paul Gallacher, both former goalkeepers."]}, {"page": "List of Scottish football families", "response": ["* Jim Gallacher, Paul Gallacher (son), Tony Gallacher (nephew)"]}, {"page": "Clydebank F.C. (1965)", "response": ["Former Bankie Gary Teale who went on to play for Ayr United and Derby County also played for Scotland. Other famous names to have played for the club at some point in their careers include Republic of Ireland international strikers Tommy Coyne and Owen Coyle, Bobby Williamson, Jim Fallon, Gerry McCabe, Jim Gallacher, Ken Eadie, England international defender Terry Butcher, and Partick Thistle cult hero Chic Charnley.", "* Jim Gallacher"]}]}}