{"wiki_id": "http://www.wikidata.org/entity/Q6193594", "itemLabel": "Jim Beaton", "itemDescription": "British police officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jim_Beaton", "wikipedia_page": {"main": "James Wallace Beaton, GC, CVO (born 17 February 1943) is a retired British police officer who was awarded the George Cross, Britain's highest gallantry award for civilians. He was Queen's Police Officer from 1983 to 1992.Beaton received the George Cross in 1974 for protecting Princess Anne from the would-be kidnapper Ian Ball during an attack in The Mall, London.  He received the Director's Honor Award of the United States Secret Service in the same year. He was made an LVO in 1987 and promoted to CVO in 1992.\nIn March 1973, Beaton was transferred to the Royalty Protection Squad, A Division, and from 14 November served as a Personal Protection Officer to Princess Anne. He was given the number 11 in the small team responsible for protecting members of the Royal Family.  On 20 March 1974 the princess and her husband Captain Mark Phillips were returning to Buckingham Palace from a royal engagement. Their car was stopped in the Mall by another vehicle driven into its path. The car was driven by Ian Ball, who was later declared to be mentally ill; Ball jumped out of his vehicle and tried to force the Princess from her car. He shot the royal chauffeur, Alex Callender, and a passing journalist, Brian McConnell, who tried to assist. Inspector Beaton was shot three times, including serious wounds in the chest and abdomen, and a gunshot wound to his hand, sustained when he tried to block Ball's weapon with his own body, after his own gun had jammed. Beaton also sustained injuries to his pelvis while trying to disarm Ball. For his bravery Beaton was awarded the George Cross; Callender and McConnell were each awarded the Queen's Gallantry Medal. Beaton remained with the Princess until February 1979.\nBeaton served in the Metropolitan Police from 1962 to 1992. He spent the first years of his career as a Constable on the beat at Notting Hill from 1962 to 1966. In 1966 he was promoted to Sergeant at Harrow Road, and then in 1971 to Station Sergeant at Wembley. He became an Inspector in 1974, whilst serving in Royal Protection, and was subsequently promoted to Chief Inspector in August 1979, Superintendent in 1983, and Chief Superintendent in 1985.\nIn 1982 he became the Queen's Police Officer. He retired in 1992.", "link_mentions": [{"page": "James Beaton (disambiguation)", "response": ["* Jim Beaton (James Wallace Beaton, born 1943), former Queen's Police Officer and bodyguard"]}, {"page": "Chief Superintendent James Beaton", "response": ["#REDIRECT Jim Beaton"]}, {"page": "James Beaton (Queen's Police Officer)", "response": ["#REDIRECT Jim Beaton"]}, {"page": "Victoria Cross and George Cross Association", "response": ["* Chief Superintendent Jim Beaton , 2006–2014."]}, {"page": "James Wallace Beaton", "response": ["#REDIRECT Jim Beaton"]}, {"page": "James Beaton (GC)", "response": ["#REDIRECT Jim Beaton"]}, {"page": "James Beaton (police officer)", "response": ["#REDIRECT Jim Beaton"]}, {"page": "List of recipients of the George Medal, 1960s–1980s", "response": ["| ||Constable, Metropolitan Police ||For his involvement in an incident involving a kidnap attempt on the Princess Anne in The Mall, in which Inspector Jim Beaton was awarded the George Cross. PC Hills, despite having been shot in the stomach used his personal radio to contact Cannon Row Police Station reporting the situation and calling for assistance. ||1974"]}]}}