{"wiki_id": "http://www.wikidata.org/entity/Q6191717", "itemLabel": "William Scott, 1st Baron Stowell", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Scott,_1st_Baron_Stowell", "wikipedia_page": {"main": "William Scott, 1st Baron Stowell (17 October 1745 – 28 January 1836) was an English judge and jurist. He served as Judge of the High Court of Admiralty from 1798 to 1828.", "link_mentions": [{"page": "Henry Addington", "response": ["Henry Addington was the son of Anthony Addington, Pitt the Elder's physician; and Mary Addington, the daughter of the Rev. Haviland John Hiley, headmaster of Reading School. As a consequence of his father's position, Addington was a childhood friend of William Pitt the Younger. Addington studied at Reading School, Winchester, and Brasenose College, Oxford, and then studied law at Lincoln's Inn. He married Ursula Mary Hammond in 1781; she brought an income of £1,000 a year into the marriage. The couple had eight children, of whom six survived to adulthood. Ursula Addington died in 1811; in 1823 Addington married a widow, Marianne Townsend, daughter of William Scott, 1st Baron Stowell."]}, {"page": "William Scott", "response": ["* William Scott, 1st Baron Stowell (1745–1836), English judge and jurist"]}, {"page": "Earl of Eldon", "response": ["William Scott, 1st Baron Stowell, was the elder brother of the first Earl of Eldon. The Hon. Sir Ernest Scott, second son of the third Earl, was Envoy Extraordinary and Minister Plenipotentiary to Hungary."]}, {"page": "Royal Grammar School, Newcastle upon Tyne", "response": ["* William Scott, 1st Baron Stowell (1745–1836), English judge and jurist"]}, {"page": "William Scott, Baron Stowell", "response": ["#redirectWilliam Scott, 1st Baron Stowell"]}, {"page": "William Scott Stowell", "response": ["#REDIRECT William Scott, 1st Baron Stowell"]}, {"page": "1836 in the United Kingdom", "response": ["* 28 January – William Scott, 1st Baron Stowell, judge (born 1745)"]}, {"page": "Stowell", "response": ["* William Scott, 1st Baron Stowell (1745–1836), judge, jurist"]}, {"page": "Baron Stowell", "response": ["#REDIRECT William Scott, 1st Baron Stowell"]}, {"page": "1745 in Great Britain", "response": ["* 17 October – William Scott, 1st Baron Stowell, judge and jurist (died 1836)"]}, {"page": "William Scott Stowell, 1st Baron Stowell", "response": ["#REDIRECT William Scott, 1st Baron Stowell"]}, {"page": "William Scott, Lord Stowell", "response": ["#redirect William Scott, 1st Baron Stowell"]}, {"page": "Lord Stowell", "response": ["#redirectWilliam Scott, 1st Baron Stowell"]}, {"page": "Thomas E. A. Stowell", "response": ["Stowell was descended from William Scott, 1st Baron Stowell. In 1913, he married Lillian Elizabeth Wagner. Their son, Eldon Stowell, was also a doctor. Their only daughter died in an accident in 1958."]}, {"page": "List of alumni of University College, Oxford", "response": ["* William Scott, 1st Baron Stowell, Camden Reader of Ancient History, judge of the Admiralty Court, MP for Oxford University"]}, {"page": "Joseph White (orientalist)", "response": ["Between 1790 and 1800 he published little. In the latter year his edition of Abdullatif at last appeared, with a dedication to Sir William Scott.The most likely dedicatee would seem to be William Scott, 1st Baron Stowell (knighted 1788). Abdullatif does not seem to be available online; inspection of a physical copy may be needed to make sure.  He had printed the text sixteen years before, but, not being satisfied with it, had presented the copies to Heinrich Paulus who issued the work in Germany. White's edition embodied a translation which had been begun by Edward Pococke the Younger, but was completed by White himself. The elaborate monograph on Pompey's Pillar which White published in 1804 became antiquated in the light of advances in Egyptology. The rest of White's literary work was concentrated on the textual study of the Old and New Testaments, and earned him in 1804 the regius professorship of Hebrew at Oxford, carrying with it a canonry of Christ Church, Oxford. Besides various pamphlets, in which he advocated a retranslation of the Bible, and proposed a new edition of the Septuagint, to be based on the Hexaplar-Syriac manuscript then recently discovered at Milan, he published in 1800 a Diatessaron or Harmony of the Gospels. His edition of the New Testament in Greek (1st edit. 1808; often reprinted) popularised Johann Jakob Griesbach's Critical Studies. His last work, Criseos Griesbachianae in Novum Testamentum Synopsis (1811) contains a summary of the more important results. Both as a theologian and as a critic he was most conservative."]}, {"page": "List of members of Middle Temple", "response": ["* William Scott, 1st Baron Stowell (1745-1836), English judge and jurist."]}]}}