{"wiki_id": "http://www.wikidata.org/entity/Q6196146", "itemLabel": "Jim Kirkpatrick", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Jim_Kirkpatrick_(Northern_Ireland_politician)", "wikipedia_page": {"main": "Jim Kirkpatrick is a Unionist politician who has represented the Ulster Unionist Party (UUP) three times and the Democratic Unionist Party twice.\nKirkpatrick was first elected as a UUP member of the Northern Ireland Assembly for Belfast South in 1982. Three years later he was elected to Belfast City Council, representing the Balmoral electoral area, which covered the Lisburn, Malone and Donegal Road areas of the city.Kirkpatrick joined the Democratic Unionist Party (DUP) in 1996 and lost his council seat in 1997, having moved from Balmoral to Laganbank. He subsequently rejoined the UUP and became chairman of the Drumbo branch in Lagan Valley.He was selected to contest the elections to the Northern Ireland Assembly in 2003 by Lagan Valley UUP in a controversial selection meeting but polled fewer than 700 votes and was quickly eliminated.Following this, in December 2004 he again defected to the DUP and was returned for that party to Belfast City Council in 2005, regaining his original seat in Balmoral. In 2007 however, Kirkpatrick was pictured at a fundraising dinner with Jim Allister MEP, held to raise funds for a new Unionist Party opposed to powersharing. On 2 June 2009 he again defected back to the UUP, accusing senior DUP members of \"caring more about dynasty building and expense claims than voters.\" He lost his seat at the 2011 council elections to businessman and publisher Máirtín Ó Muilleoir (Sinn Féin).Kirkpatrick served as High Sheriff before, having fulfilled the role in 1990. He was sworn in again as High Sheriff of Belfast in a traditional ceremony at Belfast City Hall in January 2007, succeeding Councillor William Humphrey. He is a member of Malone Presbyterian Church, the Masonic Order and the Orange Order.\n\n", "link_mentions": [{"page": "Members of the 1982 Northern Ireland Assembly", "response": ["|Jim Kirkpatrick", "|Jim Kirkpatrick"]}, {"page": "Belfast South (Assembly constituency)", "response": ["| rowspan=2|Jim Kirkpatrick(UUP)"]}, {"page": "2005 Northern Ireland local elections", "response": ["| align=\"right\" |Jim Kirkpatrick"]}, {"page": "1997 Northern Ireland local elections", "response": ["| align=\"right\" |Jim Kirkpatrick"]}, {"page": "1993 Northern Ireland local elections", "response": ["| align=\"right\" |Jim Kirkpatrick"]}, {"page": "1989 Northern Ireland local elections", "response": ["| align=\"right\" |Jim Kirkpatrick"]}, {"page": "1985 Northern Ireland local elections", "response": ["| align=\"right\" |Jim Kirkpatrick"]}, {"page": "High Sheriff of Belfast", "response": ["* 1990: Councillor Jim Kirkpatrick", "* 2007: Councillor Jim KirkpatrickNew High Sheriff of Belfast to be sworn in, Belfast City Council"]}, {"page": "2011 Northern Ireland local elections", "response": ["| style=\"text-align:right;\"|Jim Kirkpatrick"]}, {"page": "James Kirkpatrick", "response": ["James or Jim Kirkpatrick may refer to:", "*Jim Kirkpatrick (Northern Ireland politician), Unionist politician in Northern Ireland", "*Jim Kirkpatrick (Illinois politician), member of the Illinois House of Representatives", "*Jim Kirkpatrick (footballer) (1903–?), Scottish footballer, played for Leeds United and Watford in 1920s"]}, {"page": "Balmoral (District Electoral Area)", "response": ["! rowspan = \"1\" | Jim Kirkpatrick  (DUP)", "! rowspan = \"3\" | Jim Kirkpatrick  (UUP) ", "| style=\"text-align:right;\"|Jim Kirkpatrick"]}, {"page": "Máirtín Ó Muilleoir", "response": ["He re-entered politics in 2011, when he was elected as a Belfast City Councillor for Balmoral, South Belfast, gaining the seat previously held by Jim Kirkpatrick of the Democratic Unionist Party, and was elected Lord Mayor in 2013, serving a one-year term.Balmoral election results, 1993–2011, ARK.ac.uk; accessed 21 June 2013."]}]}}