{"wiki_id": "http://www.wikidata.org/entity/Q6192917", "itemLabel": "Jill Liddington", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Jill_Liddington", "wikipedia_page": {"main": "Jill Liddington (born in Manchester, 1946) is a British writer and academic who specialises in women's history.", "link_mentions": [{"page": "Pacifism", "response": ["The first peace movements appeared in 1815–16. In the United States the first such movement was the New York Peace Society, founded in 1815 by the theologian David Low Dodge, and the Massachusetts Peace Society. It became an active organization, holding regular weekly meetings, and producing literature which was spread as far as Gibraltar and Malta, describing the horrors of war and advocating pacificism on Christian grounds.Pacifism to 1914 : an overview by Peter Brock. Toronto, Thistle Printing, 1994. (pp. 38–9). The London Peace Society (also known as the Society for the Promotion of Permanent and Universal Peace) was formed in 1816 to promote permanent and universal peace by the philanthropist William Allen. In the 1840s, British women formed \"Olive Leaf Circles\", groups of around 15 to 20 women, to discuss and promote pacifist ideas.The Long Road to Greenham : Feminism and Anti-Militarism in Britain since 1820, by Jill Liddington. London, Virago, 1989  (pp. 14–5)."]}, {"page": "Anne Lister", "response": ["Helena Whitbread published some of the diaries in two volumes (1988 and 1992). Their graphic nature meant at first they were believed by some to be a hoax, but documentary evidence has since established their authenticity. A biography by the academic Jill Liddington appeared in 1994. In 2014, a conference held at Shibden Hall focused on Lister's life along with gender and sexuality in the 19th century.Anne Lister Conference", "The 2019 BBC-HBO historical TV drama series Gentleman Jack, starring Suranne Jones as Lister, depicts her life as \"the first modern lesbian\". The series is billed as \"inspired by\" two books about Lister by Jill Liddington, Female Fortune and Nature's Domain. Liddington also acted as a consultant for the series. O'Hooley & Tidow's \"Gentleman Jack\" serves as the series' primary theme music. Penguin Books published a companion volume by the series' senior consultant, Anne Choma, which includes newly transcribed and decoded entries from Lister's diaries."]}, {"page": "List of books with anti-war themes", "response": ["* The Long Road to Greenham: Feminism and Anti-Militarism in Britain since 1820 – Jill Liddington, 1989\"Jill Liddington's The Long Road to Greenham, for example, which examines women's pacifism from 1820 to the 1980s....\" Heloise Brown, The Truest Form of Patriotism: Pacifist Feminism in Britain, 1870-1902, Manchester University Press, 2013. ."]}, {"page": "Three Guineas", "response": ["The views expressed in Three Guineas have been described as feminist, pacifist, anti-fascist, and anti-imperialist.Jill Liddington. The Long Road to Greenham : Feminism and Anti-Militarism in Britain since 1820, London, Virago, 1989  (pp. 14–15). Feminist historian Jill Liddington has praised Three Guineas as \"an eloquent and impish attack on patriarchal structures\", notes how the book puts forward the argument that \"men's power under patriarchy dovetails with militarism\", and claims \"Three Guineas offers an important bridge between the earlier feminist flowering and the later 1980s wave of a women's peace movement\"."]}, {"page": "Peace movement", "response": ["The first formal peace movements appeared in 1815 and 1816. The first movement in the United States was the New York Peace Society, founded in 1815 by theologian David Low Dodge, followed by the Massachusetts Peace Society. The groups merged into the American Peace Society, which held weekly meetings and produced literature that was spread as far as Gibraltar and Malta describing the horrors of war and advocating pacifism on Christian grounds. Pacifism to 1914: an overview by Peter Brock. Toronto, Thistle Printing, 1994. (pp. 38-9). The London Peace Society, also known as the Society for the Promotion of Permanent and Universal Peace, was formed by philanthropist William Allen in 1816 to promote permanent, universal peace. During the 1840s, British women formed 15-to-20 person \"Olive Leaf Circles\" to discuss and promote pacifist ideas. The Long Road to Greenham: Feminism and Anti-Militarism in Britain since 1820, by Jill Liddington. London, Virago, 1989  (pp. 14-5)."]}, {"page": "List of Desert Island Discs episodes (2011–present)", "response": ["|||||Female Fortune: Land, Gender and Authority by Jill Liddington||"]}, {"page": "Ann Walker (landowner)", "response": ["Gentleman Jack is a historical drama television series created by Sally Wainwright, co-produced by HBO and Lookout Point (for the BBC), and starring Suranne Jones as landowner and industrialist Anne Lister and Sophie Rundle as wealthy neighbouring heiress Ann Walker. The series begins in 1832 in Halifax, West Yorkshire and is based on the collected diaries of Lister, which contain over five million words, one-sixth of which are written in code. Series one premiered on 22 April 2019 in the United States, and on 19 May 2019 in the United Kingdom. It was renewed for a second series by BBC One on 23 May 2019. Penguin Books published a companion volume to the series Gentleman Jack: The Real Anne Lister by the series' senior consultant, Anne Choma, which includes newly transcribed and decoded entries from Lister's diaries. The drama's end credits acknowledge that it was \"inspired by the books Female Fortune and Nature's Domain\" by Jill Liddington, who acted as consultant and whose own website summarises Lister's extraordinary life as \"dazzling worldly achievements plus unbuttoned lesbian affairs.\" O'Hooley & Tidow's song \"Gentleman Jack\" serves as the series' primary theme music."]}]}}