{"wiki_id": "http://www.wikidata.org/entity/Q6192740", "itemLabel": "Jill Barklem", "itemDescription": "British artist and writer (1951-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jill_Barklem", "wikipedia_page": {"main": "Jill Barklem (born Gillian Gaze; 23 May 1951 – 15 November 2017) was a British writer and illustrator of children's books. Her most famous work is the Brambly Hedge series, published from 1980.", "link_mentions": [{"page": "List of children's literature writers", "response": ["*Jill Barklem (born 1951) – Brambly Hedge"]}, {"page": "1980 in literature", "response": ["*Jill Barklem – Brambly Hedge series:"]}, {"page": "Brambly Hedge", "response": ["Brambly Hedge is a series of illustrated children's books by Jill Barklem, recounting the adventures of a community of mice who live together in the tranquil surroundings of the English countryside. The writer described Brambly Hedge as a loving and caring society. The tales involve conflict resolution within nature or exploration, and/or the adventures of working together to achieve a common goal. There are no unkind characters or predators."]}, {"page": "Hot Animation", "response": ["The company then made a reboot of Brambly Hedge, a series of 30-minute specials based on the illustrated books for children by Jill Barklem, and Rubbadubbers, a series about bath toys that come alive. Pingu, a British-Swiss animated series about a family of penguins, was recreated with great success in 2003."]}, {"page": "List of people from the London Borough of Waltham Forest", "response": ["* Jill Barklem"]}, {"page": "Epping, Essex", "response": ["* Jill Barklem, writer and illustrator"]}, {"page": "The Enchanted World of Brambly Hedge", "response": ["The Enchanted World of Brambly Hedge is a stop-motion animated series based on the Brambly Hedge books by Jill Barklem. The show was produced by HIT Entertainment; in the United States, episodes began airing on the Starz premium channel in 1997."]}, {"page": "Winter Story (Brambly Hedge)", "response": ["Winter Story is a 1980 children's book, the final of the four seasons of Jill Barklem's Brambly Hedge series.The Bookseller 1981 Page 1234 \"... a large part of the children's book department with a display depicting a scene from the Brambly Hedge series  ... Collins' design team spent three months creating the set, 18ft x 6ft* with a kitchen scene from \"Winter Story\", including ... In the book the biggest snowstorm in years leaves enough snow for an ice ball.Masha Kabakow Rudman, Anna Markus Pearce,  For love of reading: a parent's guide to encouraging young Consumer Reports Books - 1988 0890432090- Page 253 \"Barklem, Jill. Winter Story. Illustrated by the author. New York: Philomel, 1980. Age: 5. Chaps. 4 and 5. Accurate depiction of hedgerow life and Cornish culture form the basis of these stories for young children about the mice of Brambly Hedge.\" The Economist review of books described the book as a \"(Beatrix) potter through Brambly Hedge\", \"mousy little tales with beautiful, busy drawings\". The Economist - Volume 277 1980 Page 74  It is a century away from Jill Barklem's little — Beatrix — potter through Brambly Hedge (Winter Story, Collins, £2.50, with another three in the series, one for each season). These are mousy little tales with beautiful, busy drawings — for ...\" The Children's Literature Council of Central Pennsylvania 1985 \"The book is a companion to WINTER STORY by the same author.\""]}, {"page": "2017 in the United Kingdom", "response": ["**Jill Barklem, 66, writer and illustrator (Brambly Hedge)."]}, {"page": "Deaths in November 2017", "response": ["*Jill Barklem, 66, British writer and illustrator (Brambly Hedge).Brambly Hedge creator Jill Barklem dies aged 66"]}, {"page": "Autumn Story (Brambly Hedge)", "response": ["Autumn Story is a 1980 children's book, the third of the four seasons of Jill Barklem's Brambly Hedge series.The Guardian In it the mouse Little Primrose wanders off and finds herself in uncharted territory.Contemporary Authors -Gale Group, Terrie M. Rooney  Volume 161 - Page 24 0787619949"]}]}}