{"wiki_id": "http://www.wikidata.org/entity/Q6204390", "itemLabel": "Jo Richardson", "itemDescription": "British politician (1923-1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jo_Richardson", "wikipedia_page": {"main": "Josephine Richardson (28 August 1923 – 1 February 1994) was a British Labour Party politician. At the time of her death she was Member of Parliament for Barking, a post she had held since 1974.", "link_mentions": [{"page": "Theresa May", "response": ["In the 1992 general election May was the Conservative Party candidate for the safe Labour seat of North West Durham, placing second to incumbent MP Hilary Armstrong, with future Liberal Democrat leader Tim Farron placing third. May then stood at the 1994 Barking by-election, which was prompted by the death of Labour MP Jo Richardson. The seat had been continuously held by Labour since it was created in 1945, and Labour candidate Margaret Hodge was expected to win easily, which she did. May placed a distant third."]}, {"page": "Eric Forth", "response": ["After standing as a communist at a mock school-election and flirting with distributism at university, Forth developed both conservative and libertarian leanings. Forth was elected as a councillor for the Pilgrims Hatch ward on the Brentwood Urban District Council from 1968 to 1972. He contested the safe Labour seat of Barking at both the February and October 1974 general elections, where on both occasions he was defeated by Labour's Jo Richardson. He was the secretary of Llandeilo Conservative Association from 1975 to 1977, and chairman of the Ross-on-Wye Conservative Political Committee from 1978 to 1979."]}, {"page": "Socialist Campaign Group", "response": ["During his time as Leader Neil Kinnock moved the Labour party to adopt centrist politics. In the 1987 General Election Margaret Thatcher's Conservatives won a landslide victory and were nearly 12% ahead of Labour in the popular vote.  Following this defeat Kinnock introduced a Policy Review, which many on the left thought would lead to an abandonment of the party's commitment to Clause IV, public ownership and the transformation of society. At a meeting of the Campaign Group following this election defeat, it was agreed that Tony Benn should stand against Kinnock in a leadership election, although Benn himself was reluctant to run. The decision to run led to a number of MPs leaving the Campaign Group including Clare Short, Margaret Beckett, Jo Richardson and Joan Ruddock.", "* Jo Richardson"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Jo Richardson"]}, {"page": "Margaret Hodge", "response": ["Hodge has served as the Labour MP for Barking since the by-election on 9 June 1994 following the death of Jo Richardson. Whilst still a new MP, she endorsed the candidature of Tony Blair, a former Islington neighbour, for the Labour Party Labour leadership, after the sudden death of John Smith from a heart attack. In 2017, she had a majority of 21,608."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Jo Richardson"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Jo Richardson"]}, {"page": "Ian Mikardo", "response": ["Mikardo was a Labour Member of Parliament for Reading 1945–50, Reading South 1950–55, Reading 1955–59, Poplar 1964–74, Bethnal Green and Bow 1974–83 and Bow and Poplar 1983–87. He was Chairman of the House of Commons Select Committee on Nationalised Industries, 1966–70. He issued many pamphlets, the most famous were Keep Left (1947) and Keeping Left with Dick Crossman, Michael Foot and Jo Richardson, 1950. He was also a Fabian essayist, a staunch friend of Israel, as well as friend and mentor to many in the Labour movement, where he made a great impact.", "Mikardo's secretary at the time was Jo Richardson (1923–94) who began her political career working for him and later became a Member of Parliament herself. She co-ordinated the 'Keep Left Group' and went on to become the secretary of the Tribune Group. In 1951 Richardson was elected to Hornsey Borough Council and became the full-time secretary and working partner of Mikardo in his business, which involved trade with eastern Europe.Jo Richardson Obituary, The Independent 2 February 1994, accessed 23 August 2014  In February 1958 Mikardo joined Stephen Swingler, Richardson, Harold Davies, Konni Zilliacus, Walter Monslow and Sydney Silverman, to form Victory for Socialism (VFS), which was co-ordinated by Richardson.Jo Richardson – Archives Hub, accessed 23 August 2014"]}, {"page": "List of United Kingdom by-elections (1979–2010)", "response": ["|Jo Richardson"]}, {"page": "Barking (UK Parliament constituency)", "response": ["| Jo Richardson"]}, {"page": "List of United Kingdom MPs: R", "response": ["*Jo Richardson"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Jo Richardson, Barking, 1974–94"]}, {"page": "Hugo Summerson", "response": ["Summerson contested Barking in 1983, but was beaten by Labour's Jo Richardson by 4,026 votes."]}, {"page": "Josephine Richardson", "response": ["#REDIRECTJo Richardson"]}, {"page": "1988 Labour Party leadership election (UK)", "response": ["Following the announcement of the challenge, there was some dissent from parts of the left within the party with Clare Short describing it as a \"waste of time\". Benn's candidacy led to a split in the left-wing Socialist Campaign Group, with Short resigning from the group alongside Margaret Beckett, Jo Richardson, Joan Ruddock and Joan Walley in protest at Benn's decision. The Amalgamated Engineering Union announced that it would deduct the cost of polling its members from the overall donations that would normally go to the party. Overall, it was expected that the cost of the leadership contest for the party would be in the region of £500,000. Kinnock announced that only 15 MPs had backed the challenge, a claim which was disputed by Benn's backers. There was also a fear that the leadership challenge would decrease the party's following in the polls, as had happened during Benn's challenge for the deputy leadership in 1981."]}, {"page": "1994 Barking by-election", "response": ["The Barking by-election was held on 9 June 1994, following the death of Labour Party Member of Parliament for Barking Jo Richardson. Richardson had represented the seat since the February 1974 general election, following Tom Driberg."]}, {"page": "Southend High School for Girls", "response": ["* Jo Richardson, Labour MP for Barking from 1974 to 1994"]}, {"page": "List of people from the London Borough of Barking and Dagenham", "response": ["* Jo Richardson – former Member of Parliament for Barking; Shadow Spokesman for Women's Rights, 1983–1992"]}, {"page": "Richardson (surname)", "response": ["*Jo Richardson, British politician"]}, {"page": "List of Question Time episodes", "response": ["| Hugh Clegg, Reg Prentice, Jo Richardson, Angela Rumbold"]}, {"page": "Jo Richardson Community School", "response": ["The Jo Richardson Community School, often referred to as Jo Richardson or simply JRCS, is a secondary school in Dagenham, East London. The headteacher and the Head of School is Ges Smith. The school is named in honour of MP Jo Richardson."]}, {"page": "Shadow Secretary of State for Women and Equalities", "response": ["| Jo Richardson"]}, {"page": "Shadow Cabinet of Neil Kinnock", "response": ["| Jo Richardson", "*Jo Richardson – Shadow Minister responsible for Women's Rights", "*Jo Richardson – Shadow Minister responsible for Women's Rights", "*Jo Richardson – Shadow Minister responsible for Women's Rights", "*Jo Richardson – Shadow Minister responsible for Women's Rights"]}, {"page": "1985 Labour Party Shadow Cabinet election", "response": ["| Jo Richardson"]}, {"page": "1987 Labour Party Shadow Cabinet election", "response": ["Following the 1987 general election, there were significant changes to the cabinet. Barry Jones, Peter Shore, Peter Archer and Giles Radice lost their seats, and other familiar faces such as Denis Healey did not stand. Michael Meacher, Robert Hughest, Robin Cook, Frank Dobson, Gordon Brown, Jo Richardson and Jack Straw gained seats.", "| Jo Richardson"]}, {"page": "List of United Kingdom MPs who died in the 1990s", "response": ["|Jo Richardson (in office)"]}]}}