{"wiki_id": "http://www.wikidata.org/entity/Q6205412", "itemLabel": "Joan Ryan", "itemDescription": "British politician (born 1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joan_Ryan_(politician)", "wikipedia_page": {"main": "Joan Marie Ryan (born 8 September 1955) is a British politician who served as Member of Parliament (MP) for Enfield North from 1997 to 2010 and from 2015 to 2019. She was first elected as a Labour Party MP but later defected to join Change UK. Ryan is now an Independent politician.\nRyan studied sociology and worked as a teacher, before becoming a Labour councillor on Barnet London Borough Council in 1990, serving as deputy leader of the council from 1994 to 1998. She was a government whip under Tony Blair from 2002 to 2006, a junior Home Office minister responsible for ID cards from 2006 to 2007, and the Prime Minister's Special Representative to Cyprus from 2007 to 2008, when she was sacked. She lost her seat in the 2010 general election after an expenses scandal and was deputy campaign director of NOtoAV in the 2011 Alternative Vote referendum.\nRyan was re-elected in Enfield North in the 2015 general election and became chair of the Labour Friends of Israel (LFI). She was highly critical of party leader Jeremy Corbyn and lost a motion of no confidence put forward by her constituency party in 2018. She left Labour to join The Independent Group, later Change UK, in February 2019. In September, she announced she would stand down at the next general election and was subsequently succeeded by Labour's Feryal Clark.", "link_mentions": [{"page": "Gordon Brown", "response": ["In mid-2008, Brown's leadership was presented with a challenge as some MPs openly called for him to resign.  This event was dubbed the 'Lancashire Plot', as two backbenchers from (pre-1974) Lancashire urged him to step down and a third questioned his chances of holding on to the Labour Party leadership.  Several MPs argued that if Brown did not recover in the polls by early 2009, he should call for a leadership contest.  However, certain prominent MPs, such as Jacqui Smith and Bill Rammell, suggested that Brown was the right person to lead Britain through its economic crisis.  In the autumn, Siobhain McDonagh, an MP and junior government whip, who during her time in office had never voted against the government, spoke of the need for discussion over Brown's position.  While she did not state that she wanted Brown deposed, she implored the Labour Party to hold a leadership election. McDonagh was sacked from her role shortly afterward, on 12 September. She was supported in making clear her desire for a contest by Joan Ryan (who applied, as McDonagh had, for leadership nomination papers, and became the second rebel to be fired from her job), Jim Dowd, Greg Pope, and a string of others who had previously held positions in government. In the face of this speculation over Brown's future, his ministers backed him to lead the party, and Harriet Harman and David Miliband denied that they were preparing leadership bids. After Labour lost the Glasgow East by-election in July, Harman, the deputy leader of the party, said that Brown was the \"solution\", not the \"problem\"; Home Secretary Smith, Justice Secretary Jack Straw, Schools Secretary Ed Balls and Cabinet Office Minister Ed Miliband all re-affirmed their support for Brown. The deputy Prime Minister under Blair, John Prescott, also pledged his support. Foreign Secretary David Miliband then denied that he was plotting a leadership bid, when on 30 July, an article written by him in The Guardian was interpreted by a large number in the media as an attempt to undermine Brown. In the article, Miliband outlined the party's future, but neglected to mention the Prime Minister. Miliband, responded to this by saying that he was confident Brown could lead Labour to victory in the next general election, and that his article was an attack against the fatalism in the party since the loss of Glasgow-East. Miliband continued to show his support for Brown in the face of the challenge that emerged in September, as did Business Secretary John Hutton, Environment Secretary Hilary Benn, and Chief Whip Geoff Hoon."]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Joan Ryan", "| Joan Ryan"]}, {"page": "London South Bank University", "response": ["* Joan Ryan, politician"]}, {"page": "List of current members of the British Privy Council", "response": ["| Joan Ryan"]}, {"page": "Hazel Blears", "response": ["In 2005 Blears was a member of a parliamentary tap-dancing troupe known as the Division Belles (a play on the term \"division bell\"). Other members included Caroline Flint, Beverley Hughes, Laura Moffatt, Meg Munn, Joan Ryan and Dari Taylor."]}, {"page": "Jeremy Corbyn", "response": ["In February 2019, seven MPs – Chuka Umunna, Luciana Berger, Chris Leslie, Angela Smith, Mike Gapes, Gavin Shuker and Ann Coffey – resigned from the Labour Party to form The Independent Group, citing Corbyn's handling of Brexit and of allegations of antisemitism. They were soon joined by Joan Ryan while Ian Austin resigned to sit as an independent. TIG later rebranded as Change UK, and all of the defecting MPs left Parliament at the 2019 general election, with some losing their seats, others not seeking re-election, and some standing and losing in different constituencies from the ones that they had previously held."]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Joan Ryan"]}, {"page": "Louise Ellman", "response": ["Ellman was Chair of the Jewish Labour Movement from 2006 to 2016, after which she became its Honorary President. She was also Vice Chair of Labour Friends of Israel and succeeded Joan Ryan as Chair in August 2019. She said that she intended to remain a member of LFI following her resignation from the Labour Party. She was the chair of the All-Party Britain-Israel Parliamentary Group."]}, {"page": "Mark Field", "response": ["He unsuccessfully contested the Conservative held seat of Enfield North at the 1997 general election following the retirement of the sitting MP Tim Eggar. 1997 was the year of Labour's parliamentary landslide and he was defeated at that election by Labour's Joan Ryan by 6,822 votes."]}, {"page": "Tom Watson (Labour politician)", "response": ["Following defections of Labour MPs in 2019 to The Independent Group, later Change UK, Watson set up the Future Britain Group of Labour politicians. He was criticised for continuing to accept funding from property developer David Garrard, who was reported to have given Change UK £1.5 million and to have financially supported Joan Ryan and Ian Austin since their departure from Labour. Watson has also received funding from businessman Trevor Chinn."]}, {"page": "Joan Marie Ryan", "response": ["#REDIRECT Joan Ryan (politician)"]}, {"page": "Parliamentary Under-Secretary of State for the Home Department", "response": ["*Joan Ryan - 5 May 2006 – 29 June 2007"]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Enfield North || Joan Ryan || Labour || Joan Ryan || Labour"]}, {"page": "Enfield North (UK Parliament constituency)", "response": ["Boundary alterations based on an increased population within the existing area made the seat notionally Conservative before the 6 May 2010 election, and Nick de Bois won the seat. However, the former Labour MP Joan Ryan, who sat for the constituency from 1997 to 2010, regained it in 2015.  The 2015 result gave the seat the 13th most marginal majority of Labour's 232 seats by percentage of majority.List of Labour MPs elected in 2015 by % majority   UK Political.info.  Retrieved 2017-01-29 De Bois and Ryan stood against each other in this seat over five general elections, between 2001 and 2017, with Ryan winning four of those five.", "| Joan Ryan", "|rowspan=\"2\"| Joan Ryan"]}, {"page": "Mary Creagh", "response": ["During the 2017 general election, Creagh was reported as writing to constituents to say that her team had been “speaking to people in your street” who had told them they had “more confidence in Theresa May as Prime Minister than Jeremy Corbyn,” predicted a large Tory majority and called for a vote for them as individuals while promising to “work for a Labour Party that can once again regain your confidence.” The letter was similar to ones sent by Joan Ryan and Gavin Shuker."]}, {"page": "Avtar Lit", "response": ["In 2007, Lit was embroiled in what Joan Ryan, Labour MP and vice-chair, called \"breathtaking and naked Tory opportunism\" in the course of \"David Cameron's personal intervention to overrule local Tories and appoint a candidate\"; The Guardian reported that Lit's son, Tony, Cameron's \"star candidate\" viewed as \"a new type of Tory: young, successful, metropolitan\" and who, it was hoped, would \"deliver a blow to Gordon Brown by winning the contest\", attended with his family a farewell dinner for Tony Blair at the cost of £4,800- spending an additional £4,000 in a bid for \"a weekend trip to Atlanta, the highlight of which was two seats at a dinner with Hillary Clinton\"- despite being announced as the Conservative candidate for the Ealing Southall by-election the next week. The Labour party released photographs of Lit and Blair, and made it known that the £4,000 bid had not been paid, questioning whether this was due to the fact that \"the Lits wanted to avoid all this coming out in the run-up to the election\".https://www.theguardian.com/politics/2007/jul/15/uk.conservatives"]}, {"page": "List of United Kingdom MPs: R", "response": ["*Joan Ryan"]}, {"page": "Labour Friends of Israel", "response": ["In 2011, John Woodcock was appointed chair, followed in May 2013 by Dame Anne McGuire and, in 2015, Joan Ryan.", "In February 2019, after having lost a vote of no confidence by her local constituency Labour Party, Joan Ryan resigned from the Labour Party to join the recently formed The Independent Group but retained her position as Chair of LFI. She became Honorary President in August 2019 and Dame Louise Ellman succeeded her as Parliamentary Chair. In October 2019, Ellman resigned from the Labour Party. Neither stood for reelection in the 2019 General election. However, despite resigning from the Labour Party, they remained members of LFI."]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Joan Ryan, Enfield North, 1997–2010; 2015–2019"]}, {"page": "Blair Babe", "response": ["| 85. || Joan Ryan || Enfield North || 1997/2015 || 2010/2019 || Lost seat to Conservative Nick de Bois. Regained seat in 2015. Resigned from the Labour Party and joined Change UK. Retired"]}, {"page": "United Kingdom general election records", "response": ["* 2015: Boris Johnson, Joan Ryan, Dawn Butler, Rob Marris, Alex Salmond"]}, {"page": "Premiership of Gordon Brown", "response": ["A second assault upon Brown's premiership was launched in September 2008 when Siobhain McDonaghan MP who had never voted against the governmentspoke of the need for discussion over Brown's position. McDonagh, a junior government whip, was sacked from her role on 12 September. McDonagh did not state that she wanted Brown deposed, but she implored the Labour Party to hold a leadership election. McDonagh spoke of a \"huge number\" of Labour MPs who wanted a leadership election. In the following days, several Labour MPsincluding Field, Joan Ryan (who applied, as McDonagh had, for leadership nomination papers, and became the second rebel to be fired from her job), Jim Dowd, Greg Pope, and others who had previously held positions in governmentsaid they wanted a contest. In an unrelated incident, 12 backbenchers signed a letter criticising Brown that was published in Progress magazine. One of these MPs, Eric Joyce, said that Brown's future hinged on his performance at the upcoming Labour Party conference."]}, {"page": "Ryan (surname)", "response": ["*Joan Ryan (politician) (born 1955), UK politician"]}, {"page": "List of Lords Commissioners of the Treasury", "response": ["**Joan Ryan", "**Joan Ryan", "**Joan Ryan", "**Joan Ryan", "**Joan Ryan", "**Joan Ryan", "**Joan Ryan"]}, {"page": "British Tamils Forum", "response": ["Jayananthamoorthi MP and Gagendran MP, a representative of the Sri Lankan High Commissioner in London, Labour Party MPs Joan Ryan MP, Virendra Sharma MP, Keith Vaz MP, Andy Love MP and Lord Waddington QC of the Conservative Party. It was hailed by Neil Gerrard MP as \"making a clear case for self-determination\" and as a final note, Barry Gardiner MP wrote of the exhibition \"We Build a Nation.\""]}, {"page": "United Kingdom parliamentary expenses scandal", "response": ["In May 2010 it was reported in The Daily Telegraph that a number of MPs and their staff have been caught attempting to edit their personal Wikipedia pages to remove references to their expenses claims. Wikipedia staff found that a number of IP addresses associated with the Parliamentary Estate had been attempting to remove potentially embarrassing information surrounding MPs expenses claims from their Wikipedia profiles. The article made specific allegations against Chris Grayling (Con), Margaret Moran (Lab) and Joan Ryan (Lab)."]}, {"page": "Luciana Berger", "response": ["On 18 February 2019, Berger and six other MPs – Chuka Umunna, Chris Leslie, Angela Smith, Mike Gapes, Gavin Shuker and Ann Coffey – resigned from the Labour Party in protest at Jeremy Corbyn's leadership to form The Independent Group, later Change UK. In Berger's resignation speech, she described the Labour Party as being \"institutionally anti-Semitic\" and said she was \"ashamed to remain in the Labour Party\". The group cited disagreements over the handling of Brexit and antisemitism within the party as reasons for leaving. They subsequently gained four additional members, bringing their ranks to eleven in total: adding Labour's Joan Ryan but also the Conservatives' Anna Soubry, Heidi Allen and Sarah Wollaston."]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| Enfield North||style=\"background-color: \"| ||Labour||style=\"background-color: \"| ||Nick de Bois (C)||Gain.  Defeated incumbent Joan Ryan"]}, {"page": "Nick de Bois", "response": ["Geoffrey Nicholas de Bois (born 23 February 1959) is a British Conservative Party politician, who served as Special Adviser and Chief of Staff to Dominic Raab during his brief tenure as Secretary of State for Exiting the European Union. He was elected at the 2010 general election as the Member of Parliament for Enfield North, defeating the Labour incumbent MP Joan Ryan.", "De Bois had contested the Enfield North constituency in the 2001 and the 2005 general elections, taking second place to Joan Ryan on both occasions. He also stood unsuccessfully for Stalybridge and Hyde in 1997."]}, {"page": "Panel of Chairs", "response": ["*Joan Ryan \t        (Labour)"]}, {"page": "Samworth Brothers", "response": ["At the time of introduction of a National Living Wage in April 2016, Samworth Brothers came under widespread criticism for removing premium pay rates in order to pay the new minimum wage. Joan Ryan, Labour Party MP for Enfield North, stated in Parliament:"]}, {"page": "List of elected British politicians who have changed party affiliation", "response": ["|Joan Ryan"]}]}}