{"wiki_id": "http://www.wikidata.org/entity/Q6209568", "itemLabel": "Joe Dorrington", "itemDescription": "footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Dorrington", "wikipedia_page": {"main": "Joseph R. Dorrington was an English professional football goalkeeper. He played 78 games in the Football League for Blackpool.\n\n", "link_mentions": [{"page": "Dorrington", "response": ["*Joe Dorrington, English football goalkeeper"]}, {"page": "1900–01 Blackpool F.C. season", "response": ["Arrivals, either during the season in exile or during this campaign, included Jack Parkinson (returning after a season with Liverpool), goalkeeper Joe Dorrington from Blackburn Rovers, Jack Birchall, John Burden, Edward Threlfall, Alfred Boulton, Lorenzo Evans, former schoolboy Harold Hardman, and Geordie Anderson. Out went Henry Parr (who played in the club's first game in the Football League), Jack Morris (despite scoring four goals in his five appearances the previous season), and Gamble.", "Bob Birkett top-scored with ten goals in his 32 appearances. Goalkeeper Joe Dorrington was ever-present throughout the club's 34 league games.", "New Brighton Tower were their first opponents, and Blackpool returned from Wallasey with a point after a goalless draw, goalkeeper Joe Dorrington keeping a clean sheet on his Football League debut for the club.", "*Joe Dorrington – 34Ever-present", "|Joe Dorrington"]}, {"page": "1901–02 Blackpool F.C. season", "response": ["Three more defeats followed — 3–1 at home to Woolwich Arsenal (Parkinson), 2–0 at Barnsley, and 1–0 at Leicester Fosse. Club secretary Tom Barcroft played in goal for Blackpool in the latter game, deputising for the absent Joe Dorrington, who missed the team's train from Lancashire.", "*Joe Dorrington – 29"]}, {"page": "1902–03 Blackpool F.C. season", "response": ["*Joe Dorrington – 12"]}, {"page": "1903–04 Blackpool F.C. season", "response": ["No appearances: Joe Dorrington and Fred Heywood."]}, {"page": "1904–05 Blackpool F.C. season", "response": ["* Joe Dorrington – 3"]}, {"page": "1905–06 Blackpool F.C. season", "response": ["|Joe Dorrington"]}, {"page": "History of Blackpool F.C. (1887–1962)", "response": ["The club's committee set about rebuilding the team in an attempt to cope with League football again. Notable signings included Joe Dorrington, a goalkeeper from Blackburn Rovers; Harold Hardman, a local schoolboy who played at outside-left but went on to bigger things at Everton and as a director at Manchester United; and Jack Parkinson, who had been the club's top scorer in their first season in the League, returned after a brief taste of First Division football with Liverpool. On his way out of the club was Jack Cox, who was sold to Liverpool for the large sum of £150."]}, {"page": "Tom Barcroft", "response": ["Barcroft remained as secretary at Bloomfield Road for the next quarter-century. On 3 July 1934, he received an illuminated manuscript in recognition of his 31 years of service to the club. He had even deputised in goal during the 1901–02 season, after Joe Dorrington missed the train from Blackpool to Leicester."]}]}}