{"wiki_id": "http://www.wikidata.org/entity/Q6201163", "itemLabel": "Jimmy Robertson", "itemDescription": "Scottish football inside forward, born 1880", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmy_Robertson_(footballer,_born_1880)", "wikipedia_page": {"main": "James Robertson (1880 – after 1915) was a Scottish professional footballer who played as an inside right.\nBorn in Glasgow, Robertson moved to England to join Crewe Alexandra, who were then playing in the Birmingham & District League, where he made his name as a goal-poacher. He signed for Small Heath, newly promoted to the Football League First Division, in 1903 for a fee of £25, but failed to adapt to League football. Two years later, along with fellow Small Heath players Jimmy Windridge and Bob McRoberts, he moved to Chelsea, where he scored 21 goals in the club's first couple of seasons in the Football League, as well as one in the FA Cup. Spells followed with Leyton, Partick Thistle, Ayr United, Barrow, Leeds City and Gateshead Town, before he retired in 1915.", "link_mentions": [{"page": "James Robertson", "response": ["*Jimmy Robertson (footballer, born 1880) (1880–?), Scottish footballer who played as an inside right", "*Jimmy Robertson (footballer, born 1885) (1885–1968), Scottish football forward (Blackburn Rovers, Falkirk)", "*Jimmy Robertson (footballer, born 1909) (1909–1979), Scottish footballer who played for Scotland", "*Jimmy Robertson (footballer, born 1913) (1913–?), for Bradford City", "*Jimmy Robertson (footballer, born 1944), Scottish footballer who played for Scotland", "*Jimmy Robertson (footballer, born 1955), Scottish footballer who played as a left winger", "*Jimmy Robertson (American football) (1901–1974), American football player, coach at Geneva College (1933)", "*Jimmy Robertson (snooker player) (born 1986), English snooker player"]}, {"page": "1905–06 Chelsea F.C. season", "response": ["On 16 September Chelsea made their way to the West Riding of Yorkshire where they drew 1–1 with Bradford City, who had only switched codes from rugby league two years prior. Played at Valley Parade in front of a large crowd of 17,000, the Blues fell behind to a Wally Smith goal after 62 minutes, but saved a point through a late equaliser from Bob McRoberts in the 85th minute. On 23 September, Chelsea earned their third win of the league campaign against 2-time FA Cup winners, recent Second Division champions and former First Division side West Bromwich Albion at Stamford Bridge, the 1–0 victory coming courtesy of another McRoberts goal in the 25th minute. Chelsea ended the month with another victory on 30 September, this time in Leicestershire at Filbert Street against Leicester Fosse. The winner coming via Jimmy Robertson in the 10th minute. Playing 6 games and winning 4 of them, Chelsea ended the month with 9 points and in 3rd place, showing very promising form and exhibiting clear potential to mount a strong promotion push in their début season.", "On 7 October Chelsea began their first cup campaign with a 6-1 drubbing of the 1st Grenadier Guards' football team in an FA Cup First Qualifying Round match at Stamford Bridge, Francis O'Hara opened the scoring after 2 minutes, registering the club's first-ever cup goal, with Jimmy Robertson adding a second shortly after. O'Hara promptly got his second, giving the Blues a 3–0 lead after only 15 minutes. Martin Moran made it 4-0 before Pte. Stanley gave the soldiers a consolation in the 50th minute, however Jimmy Windridge later scored a brace give to Chelsea a wider winning margin. Chelsea maintained their strong league form in Northern Lincolnshire with a convincing 4–1 defeat of Lincoln City at Sincil Bank on 14 October, Windridge opened the scoring in the 30th minute, followed by a Frank Pearson goal two minutes later. McRoberts later added a third and Pearson added a fourth to complete a brace, with William Watson managing a consolation goal for the Imps in the 85th minute. However their seven match unbeaten run in all competitions came to an end on 21 October with the visit of Chesterfield Town to Stamford Bridge, the winner coming from Joe Ball in the 55th minute for a 1–0 win over the Blues.", "Chelsea kept up their good form with a 3–0 defeat of Burton United at Stamford Bridge on 2 December, Jimmy Robertson getting the first goal in the 20th minute with McDermott and Moran adding a second and third respectively. On 9 December, Chelsea narrowly defeated Grimsby Town 2–0 at Stamford Bridge, with two late goals coming from Tom McDermott and Jack Kirwan in the 80th and 85th minutes respectively, with Bob McRoberts also having a penalty saved. On 16 December, Chelsea won once again, this time at The Northolme beating Gainsborough Trinity 2–0, Jimmy Robertson scoring the first goal in the 20th minute with Hall later netting an own goal. Foulke once again kept a clean sheet, his 10th of the season after only 16 league games.", "On 23 December, the Pensioners began a hectic festive period with 3 games in 4 days, the first 2 against promotion rivals. They drew 0–0 with Bristol City at Stamford Bridge, and two days later on Christmas Day, drew with Manchester United at Bank Street by the same scoreline. On Boxing Day, Chelsea travelled to North Road to play Glossop, winning 4–2. The scorers that day were McRoberts, who opened the scoring after 15 minutes for the Blues, with Kirwan following up to make it 2–0. However, Cuffe halved Chelsea's lead 5 minutes before half-time. Kirwan scored his second, completing a brace in the 65th minute to make it 3-1 before Cameron reduced their lead to one goal once more. Jacky Robertson finally sealed the win with the match's 6th goal to make it 4–2. Those two goals by Glossop were the first time the Pensioners conceded in 9 matches. Chelsea ended 1905 on a high with a 4–2 win at Stamford Bridge against Stockport County on 30 December, despite falling behind to a Pass goal after a quarter of an hour. Jimmy Robertson scored two goals in succession to give Chelsea the lead before Waters equalised 3 minutes after half-time. Despite this setback Robertson scored once more to complete his hat-trick with Pearson adding a 4th to complete the scoring. Thus Chelsea ended a second successive month undefeated in the league, their run now stretching to 11 matches. With 30 points and in 3rd place, Chelsea maintained a serious promotion push.", "The Pensioners began 1906 just as they ended 1905, keeping up their 12-game unbeaten run in the league with a 6-0 hammering of Blackpool on 6 January at Stamford Bridge. Kirwan and Jimmy Robertson made the score 2-0 after goals in the 20th and 30th minutes respectively, Pearson and Moran netted the next 2 goals to give Chelsea 4, Jacky Robertson got the 5th after 55 minutes and Pearson wrapped up the scoring, completing a brace in the 67th minute. On 20 January Chelsea won their 4th consecutive league game, beating Bradford City 4–2. The Blues were 2-0 up at half-time courtesy of goals from Jimmy Robertson and McDermott in the 35th and 40th minutes respectively. In the second half goals from Copeland a minute after the restart and from Kirwan in the 65th minute saw Chelsea go 4-0 up. The Citizens however mounted a late, desperate comeback attempt with McMillan scoring their first and Clarke adding a second 2 minutes from time.", "Chelsea began the month with a 3–3 draw with Leicester Fosse at Stamford Bridge on 5 February. The Blues raced to a 2–0 lead within 10 minutes with goals by Windridge and Jimmy Robertson in the 2nd and 10th minutes respectively. Hodgkinson got one back for Leicester in the 25th minute before Pearson gave Chelsea a 3-1 half-time lead with a goal in the 42nd minute. In the second half, goals from Blessington and Hubbard saved a point for Leicester. On 10 February Chelsea's astonishing 15-match unbeaten run in the league was brought to a crashing halt at Anlaby Road as the Blues went 4-0 down to Hull City, all the more surprising as the Tigers were beaten 5-1 by Chelsea in September. The goalscorers for Hull were Rushton, who opened the scoring, followed by a brace from Joe Smith with the 4th scored by Gordon. Chelsea mounted a valiant comeback effort however, but it was to prove in vain as they could only manage three goals from Windridge, Jacky Robertson and Jimmy Robertson.", "Chelsea won their 3rd match in a row with a 7-0 thrashing of Burslem Port Vale at Stamford Bridge on 3 March. Jimmy Robertson opened the scoring and McRoberts added the second from the penalty spot after half an hour. Pearson and Jacky Robertson added another 2 to give the Pensioners 4 goals. Moran scored the fifth and Kirwan completed the scoring with a brace, his second coming 40 minutes from time. Furthermore, Bill Foulke astonishingly managed to keep a clean sheet despite the Blues conceding 2 penalties, by saving both of them. Chelsea maintained their winning ways with a narrow 2–1 win against Barnsley at Oakwell on 10 March. Pearson opened the scoring for the Blues with a goal in the 22nd minute, however Wall later equalised for the Reds before Windridge scored the winner for Chelsea in the 58th minute. This win allowed the Pensioners to overtake Manchester United into second place, who had 2 matches in hand however, putting Chelsea in the promotion places for the first time in the season. On 17 March Chelsea faced Clapton Orient at Stamford Bridge, getting an impressive 6–1 win despite going behind to a Leigh goal after 10 minutes. Windridge opened the scoring for Chelsea followed by goals from Charles Donaghy, Pearson and John Robertson, who scored from 12 yards to make it 4. James Robertson added a fifth before Windridge scored his second to round off the scoring, to secure the Blues' fifth consecutive victory.", "| Jimmy Robertson", "|align=\"left\"|FW||align=\"left\"| Jimmy Robertson"]}, {"page": "Robertson (surname)", "response": ["*Jimmy Robertson (snooker player) (born 1986), English snooker player", "*Jimmy Robertson (footballer, born 1944), Scottish footballer who played for Scotland", "*Jimmy Robertson (footballer, born 1955), Scottish footballer who played as a left winger", "*Jimmy Robertson (American football) (1901–1974), American football player, coach at Geneva College (1933)", "*Jimmy Robertson (footballer, born 1880) (1880–?), Scottish footballer who played as an inside right", "*Jimmy Robertson (footballer, born 1885) (1885–1968), Scottish football forward (Blackburn Rovers, Falkirk)", "*Jimmy Robertson (footballer, born 1909) (1909–1979), Scottish footballer who played for Scotland", "*Jimmy Robertson (footballer, born 1913) (1913–?), for Bradford City"]}, {"page": "Jimmy Robertson (footballer born 1880)", "response": ["#REDIRECT Jimmy Robertson (footballer, born 1880)"]}]}}