{"wiki_id": "http://www.wikidata.org/entity/Q6207385", "itemLabel": "Jock Marshall", "itemDescription": "Australian ornithologist and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jock_Marshall", "wikipedia_page": {"main": "Alan John \"Jock\" Marshall (17 February 1911 – 20 July 1967) was an Australian writer, academic and ornithologist.\nMarshall was born in Redfern, New South Wales.  Despite having lost an arm in a shooting accident at the age of sixteen, he was active in several natural history expeditions, and had a distinguished service record during World War II in New Guinea, 1941–1945.  He was Reader in zoology and comparative anatomy at St Bartholomew's Medical College, University of London, 1949–1960, and foundation professor of zoology and comparative physiology, then Dean of Science, at Monash University 1960–1967.\nHe will be remembered by older generations of radio listeners as \"Jock the Backyard Naturalist\", a regular on the Argonauts Club until 1946.Marshall died in Heidelberg, Victoria.  During his lifetime, he published numerous books and scientific papers and had been awarded the Royal Geographical Society's Back Award in 1948. He was elected a Fellow of the Royal Australasian Ornithologists Union in 1958.", "link_mentions": [{"page": "Penshurst, New South Wales", "response": ["* Jock Marshall (1911–1967)—professor of zoology"]}, {"page": "University of Sydney Union", "response": ["There are a number of publications on campus supported by the USU.  The University of Sydney Union's literary magazine Hermes was first published in 1886 and is the oldest journal in Australia. Distinguished former editors have included Thomas Bavin (1874), H. V. Evatt, John Le Gay Brereton, James McAuley (1937), Jock Marshall (1941), and a duo of Les Murray and Geoffrey Lehmann in 1962."]}, {"page": "Alan Marshall", "response": ["*Jock Marshall (Alan John Marshall, 1911–1967), Australian writer and ornithologist"]}, {"page": "Eric Worrell", "response": ["Among his friends were the naturalist Vincent Serventy, zoologist Jock Marshall, photographer Jeff Carter and artist Russell Drysdale."]}, {"page": "Jock (given name)", "response": ["* Alan John Jock Marshall (1911-1967), Australian writer, academic and ornithologist"]}, {"page": "List of St Paul's College, University of Sydney alumni", "response": ["*Jock Marshall, writer "]}, {"page": "Alan John (Jock) Marshall", "response": ["#REDIRECT Jock Marshall"]}, {"page": "Alan John Marshall", "response": ["#REDIRECT Jock Marshall"]}, {"page": "A. J. Marshall", "response": ["#REDIRECT Jock Marshall"]}]}}