{"wiki_id": "http://www.wikidata.org/entity/Q6201078", "itemLabel": "Jimmy Powell", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmy_Powell_(singer)", "wikipedia_page": {"main": "Jimmy Powell (13 October 1942 – 13 May 2016) was a British soul and rhythm and blues singer who recorded and performed throughout the 1960s and early 1970s, and is best remembered as the lead singer of Jimmy Powell and the 5 Dimensions, a group that briefly included Rod Stewart.", "link_mentions": [{"page": "Rod Stewart", "response": ["After returning to London, Stewart joined a rhythm and blues group, the Dimensions, in October 1963 as a harmonica player and part-time vocalist. It was his first professional job as a musician, although Stewart was still living at home and working in his brother's painting and picture frame shop.Ewbank and Hildred, Rod Stewart: The New Biography, pp. 29–32. A somewhat more established singer from Birmingham, Jimmy Powell, then hired the group a few weeks later, and it became known as Jimmy Powell & the Five Dimensions, with Stewart being relegated to harmonica player.Gray, Rod Stewart: The Visual Documentary, p. 7. The group performed weekly at the famed Studio 51 club on Great Newport Street in London, where The Rolling Stones often headlined; this was Stewart's entrée into the thriving London R & B scene, and his harmonica playing improved in part from watching Mick Jagger on stage.Nelson and Bangs, Rod Stewart, p. 58. Relations soon broke down between Powell and Stewart over roles within the group and Stewart departed. Contrary to popular legend, during this time Stewart likely did not play harmonica on Millie Small's 1964 hit \"My Boy Lollipop\". That was probably Peter Hogman of the Dimensions, although Powell has also claimed credit. Powell did record and release a single during this period, though Stewart did not appear on it.", "* Jimmy Powell and the Five Dimensions (1963)"]}, {"page": "Steve Gibbons (musician)", "response": ["Steve Gibbons started his professional life as a plumber's apprentice in Harborne. He joined the Dominettes in 1958, to replace Colin Smith, who had left to join Jimmy Powell's backing group. Colin Smith later changed his name to Carl Barron and became the singer with The Cheetahs. An Elvis Presley fan, Gibbons' first performance with The Dominettes was at The California public house near Weoley Castle."]}, {"page": "Louis Cennamo", "response": ["Cennamo left school at 16 and undertook his earliest important musical project (1962–65) as a founding member of the popular London-based blues/rock band, Jimmy Powell and the Five Dimensions. They signed a recording deal with Pye Records and released \"That's Alright\" (written by Powell) as a single in June 1964, and were also hired to provide backing for Jamaican singer Millie Small on her recording of \"My Boy Lollipop\" (which was a No. 2 hit in both the UK and the US, selling upwards of six million copies). In June 1964, The 5 Dimensions appeared on the bill at the All Night Rave at the Alexandra Palace with headlining act The Rolling Stones (as well as Alexis Korner, John Lee Hooker and John Mayall & the Bluesbreakers), and they further galvanized their place in rock and roll history with performances on Granada TV (with Sonny Boy Williamson and Sister Rosetta Tharpe), Ready Steady Go! and Thank Your Lucky Stars. In 1965, the band was asked to back up Chuck Berry on both his Chuck Berry in London LP and on his three-week tour of England."]}, {"page": "James Powell", "response": ["*Jimmy Powell (golfer) (1935-2021), PGA Tour and Champions Tour golfer", "*Jimmy Powell (musician) (1914–1994), American jazz saxophonist", "*Jimmy Powell (singer) (born 1942), British rhythm and blues singer"]}, {"page": "The 14 Hour Technicolor Dream", "response": ["At the time, The 14 Hour Technicolor Dream was described as a multi-artist event, featuring poets, artists and musicians. Pink Floyd headlined the event; other artists billed included: the Crazy World of Arthur Brown, One In A Million , Soft Machine, the Move, Tomorrow, the Pretty Things, Jimmy Powell & the Five Dimensions, Pete Townshend, John's Children, Alexis Korner, Social Deviants, the Purple Gang, Champion Jack Dupree, Graham Bond, Savoy Brown, Ginger Johnson and his African conga drummers, the Creation, Denny Laine, the Block, the Cat, the Flies, Charlie Browns Clowns, Glo Macari and the Big Three, Gary Farr, the Interference, Jacobs Ladder Construction Company, Pale Fire, Ron Geesin, Lincoln Folk Group, Mike Horovitz, Poison Bellows, Christopher Logue, Robert C. Randall, Suzy Creamcheese, Sam Gopal's Dream, Giant Sun Trolley, Simon Vinkenoog, Jean Jaques Lavel, the Stalkers, Utterly Incredible Too Long Ago To Remember Sometimes Shouting At People, Barry Fantoni, Noel Murphy, Dick Gregory, Graham Stevens and Yoko Ono.\"The 14 Hour Technicolour Dream\". Excerpted from Syd Barrett: Lost in the Woods by Julian Palacios. In the audience watching Ono's performance art that night was John Lennon who attended the event with his friend John Dunbar.\"John Lennon attends the 14 Hour Technicolour Dream - 10.00pm, Saturday 29 April 1967\". Lennon had met Ono half a year earlier, on 7 November 1966, when he attended a private preview of an exhibition of her work entitled \"Unfinished Paintings and Objects\" at Dunbar's Indica Gallery.Richard Buskin, \"John Lennon - John Lennon Meets Yoko Ono\", How Stuff Works."]}, {"page": "My Boy Lollipop", "response": ["The record's arrangement is credited to Ernest Ranglin, who also plays guitar on the recording. The saxophone solo from the original version was replaced by a harmonica solo. It is unclear who played the harmonica – urban legend credited Rod Stewart for many years, but he has denied it. Instead, it was almost certainly either Pete Hogman or Jimmy Powell, both of The Five Dimensions. Pete Hogman and Five Dimensions guitarist Kenny White both maintain it was Pete Hogman, while Jimmy Powell asserts that it was he who played this solo. In an interview with journalist Tom Graves, in the August 2016 issue of Goldmine magazine, Small insisted that it was Stewart who played the harmonica solo. Mike Wells, drummer with Cliff Adams & The Twilights, was hired by Harry Robinson (1932–1996) (Lord Rockingham's XI) and paid £7 10 shillings for the session after recording over the weekend at IBC Portland Place."]}, {"page": "The Rockin' Berries", "response": ["The Rockin' Berries were originally formed as a beat group at Turves Green School in Birmingham in the late 1950s by guitarist Brian \"Chuck\" Botfield, and were so named because they played several Chuck Berry songs in their set. An early keyboard player with the group was Christine Perfect, later Christine McVie of Fleetwood Mac. When another band was formed locally, by singer Paul Hewitt, guitarist Doug Thompson and drummer Terry Bond, Botfield agreed to join on condition that it used the \"Rockin' Berries\" name. By mid 1961, the group comprised Botfield (lead guitar), Doug Thompson (rhythm guitar), Tim Munns (bass), Dennis Ryland (saxophone), Terry Bond (drums), and singers Paul Hewitt and Jimmy Powell. Later that year, the group went to Germany to play a series of club engagements, with Hewitt being replaced by singer and Elvis Presley impressionist Clive Lea. On their return, the group auditioned for promoter Jack Good, who wanted to sign Powell but not the rest of the group. After a few months, Powell left for a solo career, later leading the Five Dimensions who for a while included Rod Stewart. Thompson, Ryland and shortly afterwards Munns also left, and were replaced by singer and guitarist Geoff Turton — an old friend of Botfield's — and bassist Roy Austin.", "* Jimmy Powell – lead vocals (1961)"]}]}}