{"wiki_id": "http://www.wikidata.org/entity/Q6201286", "itemLabel": "Jimmy Sirrel", "itemDescription": "Scottish footballer and manager (1922-2008)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmy_Sirrel", "wikipedia_page": {"main": "James Sirrel (2 February 1922 – 25 September 2008) was a Scottish football player and manager; he gained his highest profile in the latter role.\nBorn in Glasgow, Sirrel began his career with Celtic before moving to England, spending most of his playing career with Brighton & Hove Albion.\nStarting his management career in the Fourth Division with Brentford, Sirrel moved to Notts County where he achieved promotion to the Second Division, and then after a spell at Sheffield United returned to Notts County to achieve promotion to the First Division for the first time since 1926. He is regarded as a legend of the club, with the County Road Stand at Notts County's Meadow Lane named after him.", "link_mentions": [{"page": "Sheffield United F.C.", "response": ["The first time a crest appeared on the shirt was in the 1891–92 season, when a red crest appeared on the white shirt, but this disappeared the following season. United used the city of Sheffield's coat of arms from 1965–77, when a new crest was used, introduced by former manager Jimmy Sirrel, but designed apparently over 20 years previously by former player Jimmy Hagan. This consisted of two white crossed swords, or blades, the club's nickname, with a Yorkshire Rose above, on a black background. This is surrounded by a red ring with \"Sheffield United F.C.\" written around the top and \"1889\", the year the club was founded, underneath. This has been altered very slightly a few times, with a simple black embroidered crest appearing on shirts from 1987–90, and an all-white crest on a red-edged black shield for the 1992–99 seasons, but reverted to its original form in 2000.", "Experienced Blackburn Rovers manager Ken Furphy was the man United turned to replace John Harris. He initially did well but the team was ageing and there was little money to replace players.  After a good finish in his first season a disastrous string of results the following year led to Furphy being sacked in October 1975. Jimmy Sirrel was recruited from Notts County but he proved unpopular with both the players and fans and could not halt the decline, overseeing relegation and then being sacked in September 1977 with United at the bottom of Division Two. The ambitious and colourful Harry Haslam was handed the reigns and although many of his ideas were ahead of their time he built an ageing side based on 'star' players at the end of their career. Now in the Third Division performances deteriorated still further and Haslam stepped down due to illness in January 1981. World Cup winner and then United player Martin Peters was promoted to the position of manager but United were relegated to Division Four at the end of the season and Peters resigned."]}, {"page": "Notts County F.C.", "response": ["The club were back in the Third Division South by World War II, but were again promoted as champions in 1949–50 and spent most of the 1950s in the second tier before successive relegations saw them drop back into the Fourth Division. County won promotion as runners-up in 1959–60. They returned to the fourth tier by 1964, but were promoted as champions in the 1970–71 season, before securing promotion out of the Third Division under the stewardship of Jimmy Sirrel in 1972–73. They made their return to the top flight by finishing as runners-up of the Second Division in 1980–81. County were relegated after a three-season stay, and ended the decade back in the third tier, before Neil Warnock masterminded play-off successes in 1990 and 1991 that saw them promoted back into the top flight. However they were immediately relegated, thus missing out on the first-ever season of Premier League football. They fell back into the basement division by 1997–98, but managed to finish the season as champions. Following a financial crisis they were relegated again in 2004, before they won the League Two title in 2009–10 amid a takeover bid from a Middle Eastern consortium that eventually fell through despite great publicity and initial expectations. County were relegated back to the bottom tier at the end of the 2014–15 season, and remained there until the end of the 2018–19 season, when they were relegated from the Football League for the first time.", "thumb|right| Jimmy Sirrel & Jack Wheeler statue at Meadow Lane", "The Magpies struggled during the 1960s, being on the brink of financial ruin and striving to avoid the indignity of having to apply for re-election to the league. This situation continued until Jack Dunnett, a local member of parliament, took control of the club. He appointed Jimmy Sirrel, a charismatic Scot who had once played for Celtic, as manager in November 1969. In the 1970–71 season, County clinched the Fourth Division title in record-breaking style, remaining unbeaten at Meadow Lane. Two seasons later, Notts County were again promoted, this time to Division Two. Sirrel departed for Sheffield United in October 1975 but returned two years later. He completed the remarkable transformation of Notts County in May 1981. He had turned The Magpies from Fourth Division strugglers to a top division side in little over a decade, ending an absence of 55 years from the top flight. This achievement was with the same chairman (Jack Dunnett) and trainer (Jack Wheeler) throughout the decade.", "Jimmy Sirrel took charge of the team once again, and while the club's form improved, it came too late, and County suffered their second successive relegation. After two decent but unremarkable finishes in the Third Division, Sirrel finally retired in 1987, bringing to a close one of the most successful and memorable periods in Notts County's history.", "|align=left|Jimmy Sirrel", "|align=left|Jimmy Sirrel", "|align=left|Jimmy Sirrel"]}, {"page": "1922 in the United Kingdom", "response": ["* 2 February – Jimmy Sirrel, footballer and football manager (died 2008)"]}, {"page": "Tommy Lawton", "response": ["He returned to Notts County to work as a coach and chief scout from 1968 to 1970. He was sacked after new manager Jimmy Sirrel decided to appoint his own backroom staff, and Lawton returned to unemployment. In May 1970, he wrote to Chelsea chairman Richard Attenborough asking for a loan of £250 and for possible employment; Attenborough lent him £100. He was interviewed by Eamonn Andrews on ITV's Today programme on his fall from England star to the unemployment line. After his financial troubles became public knowledge he was offered a lucrative job as director of his own subsidiary furniture company by a large furnishing company on Tottenham Court Road; however the company went into liquidation the following year. He continued to write cheques in the company's name, and in June 1972 pleaded Guilty to seven charges of obtaining goods and cash by deception. He was sentenced to three years probation, and ordered to pay £240 compensation and £100 in costs."]}, {"page": "Howard Wilkinson", "response": ["Wilkinson began his full-time coaching career in December 1979<Ref>https://www.coachesvoice.com/howard-wilkinson-first-division-leeds-united/</ref> at Notts County when he was appointed a coach. He was taken on and tutored by County's manager Jimmy Sirrel. After Sirrell became the club's general manager in August 1982, Wilkinson became team manager for the 1982–83 season and County managed a reasonable return of 52 points, achieving a finish of 15th in the First Division."]}, {"page": "Larry Lloyd", "response": ["Lloyd's success as Wigan attracted the attention of Notts County, who were looking for a new first team manager after Jimmy Sirrel \"moved upstairs\". However, after Lloyd's only season at Meadow Lane he left the club after relegation ended their three-year stay in the First Division."]}, {"page": "Micky Adams", "response": ["Adams was born in Sheffield, Yorkshire, and was an associate schoolboy with Sheffield United from the age of twelve, where his boyhood idol was Tony Currie. He was a favourite of manager Jimmy Sirrel, though Adams was released from the youth set-up a few months after Harry Haslam replaced Sirrel as manager in September 1977."]}, {"page": "Meadow Lane", "response": ["Meadow Lane lies just  away from the City Ground, home of Nottingham Forest. Divided by the River Trent, the two grounds are the closest in England and second-closest in the United Kingdom after Dundee and Dundee United. The Trent End of the City Ground is visible from parts of the Jimmy Sirrel stand and the Spion Kop.", "thumb|The Jimmy Sirrel Stand", "thumb|right| Jimmy Sirrel & Jack Wheeler statue at Meadow Lane", "During the 1970s and 80s the stadium became increasingly dilapidated. The Meadow Lane End was demolished in 1978 and replaced by a building which housed new dressing rooms, a social club and a variety of other facilities designed to generate more income. There was no stand at this end for several years and Meadow Lane was reduced to a three sided ground. Eventually a small terrace was installed on this side. The Bradford City stadium fire and Hillsborough disaster brought the safety of football stadia into the public gaze and eventually the Taylor Report required that football clubs modernise their grounds. Meadow Lane was subsequently redeveloped during the early 1990s, although the work was planned before the report was issued. The Meadow Lane End, County Road Stand and Spion Kop were all demolished in the 1992 close season and replaced with the Family Stand, the Jimmy Sirrel Stand and the Spion Kop Stand respectively. The Main Stand was replaced during the close season of 1994 by the Derek Pavis Stand.", "Away supporters are normally restricted to the Jimmy Sirrel stand, at the County Road side. This features a triangular gable (a replica of that on the old County Road stand) with the name of the club and its year of formation. Such gables are also present in the stadia of Sheffield Wednesday, Fulham, and Leyton Orient.", "Outside the stadium on Meadow Lane is a bronze statue of Jimmy Sirrel and coach Jack Wheeler. Entitled \"Legends of the Lane\", the statue was sculpted by Andy Edwards and unveiled on 5 May 2016.", "|Jimmy Sirrel Stand"]}]}}