{"wiki_id": "http://www.wikidata.org/entity/Q6200299", "itemLabel": "Jimmy Harris", "itemDescription": "English footballer born 1933", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmy_Harris_(footballer,_born_1933)", "wikipedia_page": {"main": "James Harris (born 18 August 1933) is an English former professional footballer who played as a forward for Everton and Birmingham City in the First Division. The strengths of his game were his pace and a clear eye for goal.", "link_mentions": [{"page": "List of Everton F.C. players", "response": ["|align=\"left\"|Jimmy Harris||||FW||1955–1960||207||72||First League Cup goalscorer for Everton"]}, {"page": "Gil Merrick", "response": ["Although Merrick spent well in the transfer market, bringing in such players as Jimmy Harris and Welshman Ken Leek, Blues failed to make much impact on the First Division, and finished 17th in the 1961–62 season. Blues once again entered the Inter-Cities Fairs Cup, but went out in the second round to Espanyol."]}, {"page": "1956 FA Cup Final", "response": ["In the fifth-round match, the teams saw out a 0–0 draw at Maine Road, and the match was replayed at Anfield. Goals from Jack Dyson and Bobby Johnstone gave Manchester City a 2–1 lead, but the game finished in controversial circumstances when the referee blew his whistle for full time as Liverpool's Billy Liddell was bearing down on goal. Liddell put the ball in the net, but unbeknown to him the goal did not count as the match was already over. In the quarter final Manchester City again played opposition from Liverpool, facing Everton at Maine Road. Trailing 1–0 at half-time after a Jimmy Harris goal, City overcame the deficit in the second half with goals from Hayes and Johnstone. Further controversy followed in the semi-final against Tottenham Hotspur, when in the final minutes of the match, with the score at 1–0 to Manchester City, Tottenham were denied a penalty after goalkeeper Trautmann grabbed forward George Robb's leg. No further goalscoring opportunities occurred, and City hung on for the victory.Maddox, Saffer & Robinson, Manchester City Cup Kings 1956, pp. 45–46."]}, {"page": "1963 Football League Cup Final", "response": ["|9 ||  Jimmy Harris", "|9 ||  Jimmy Harris"]}, {"page": "Geoff Davies (footballer)", "response": ["Davies represented Wirral Schoolboys and was approached by Shrewsbury Town, but his father persuaded him to instead take a five-year apprenticeship as a vehicle fitter for Shell. He began his career as a part-time professional in English non-league football with Cheshire County League side Ellesmere Port Town, playing as a winger. Manager Jimmy Harris switched him to centre forward after seeing the amount of goals he scored. A financial crisis at Ellesmere resulted in a move to Northern Premier League side Northwich Victoria. He was sold on to league rivals Wigan Athletic for £800 in summer 1970. In 1970–71, he helped the \"Latics\" win the league title, scoring a total of 42 goals in all competitions, including seven hat-tricks. This tally included the opening goal in a 2–1 FA Cup second round victory over Peterborough United at Springfield Park. The win earned them a third round tie with Manchester City at Maine Road, which they lost 1–0. In a later interview he said that \"it was a delight to be supported by the wing play of Derek Temple and Graham Oates, their service was superb. They had the Beckham like ability to pick me out. I also had through balls provided from midfield by Gordon Milne and Jim Fleming, was it any wonder I scored 42 goals that season?\" He spent two seasons with Wigan, finishing as the club's top scorer on both occasions, scoring 28 goals in the 1971–72 campaign despite suffering with injuries. Bill Foulkes later told him that Manchester United had bid for him but were turned down by Wigan."]}, {"page": "John Regan (footballer)", "response": ["Regan was born in Worcester. He played football from age 11 until 16 at the Sacred Heart College in Droitwich and went on to WRGS for A-levels. Royal Grammar School being a rugby-playing establishment, Birmingham City's scouts spotted him with his junior club. He signed for Birmingham in 1959, initially as an amateur, and turned professional two years later. Regan scored the opening goal on his debut in the First Division on 13 October 1962, deputising for Jimmy Harris in a home game against Manchester City which finished as a 2–2 draw. He played once more that season and three times in 1963–64, scoring one more goal,Matthews, p. 198. and was allowed to leave in October 1964, aged still only 20, to join Shrewsbury Town of the Third Division. He went on to play for Brentford, Crewe Alexandra and Doncaster Rovers, scoring regularly but not prolifically, and then moved into non-league football with Bromsgrove Rovers."]}, {"page": "1961 Inter-Cities Fairs Cup Final", "response": ["In Copenhagen, melted snow and rain left standing water on the pitch, and the kickoff had been moved to late afternoon so that the match against KB could be televised. This meant the attendance was very low, and the floodlighting was inadequate. Having twice taken a two-goal lead, Birmingham conceded two late goals and the game ended 4–4. Young goalkeeper Colin Withers had let in six goals in his first appearance as replacement for Johnny Schofield, who had fractured his skull, but made several saves to keep Birmingham from losing this match. The Daily Mirror reporter suggested that if the other forwards had taken full advantage of new signing Jimmy Bloomfield's creativity, the score would have been rather different. The score in the home leg was indeed different. Goals from Robin Stubbs (2), Bloomfield, Mike Hellawell, and debutant Jimmy Harris gave Birmingham a 9–4 aggregate victory.", "|CF||9|| Jimmy Harris", "The match was hostile both on and off the field. Jimmy Harris recalled the Roma players hanging back as the teams approached the pitch, leaving their visitors to be showered with cups of sand which penetrated the wire mesh protecting players from items thrown from above. Although the Birmingham team – nicknamed the \"Brummie bashers\" in the tabloid press – had a reputation for physicality, the Daily Mirror expressed amazement at their self-control \"as the Italians used every trick of body checking and obstruction to make things run their way\". At half-time, the referee warned both captains that any further display of indiscipline or temper would result in the culprit being sent off, and issued an individual warning to Lojacono.", "|CF||9|| Jimmy Harris"]}, {"page": "Jimmy Harris", "response": ["Jimmy Harris may refer to:", "* Jimmy Harris (cornerback) (born 1946), former American football cornerback for the Washington Redskins and Cincinnati Bengals", "* Jimmy Harris (defensive back) (1934–2011), former American football defensive back for the Philadelphia Eagles, Los Angeles Rams, and Dallas Cowboys", "* Jimmy Harris (footballer, born 1907) (1907–?), English footballer who played for West Ham United and Southampton", "* Jimmy Harris (footballer, born 1933), English footballer who played for Everton, Birmingham City and Oldham Athletic", "* Jimmy Harris (politician), politician from New Orleans, Louisiana", "* Jimmy Harris (EastEnders), fictional character in the UK soap opera EastEnders"]}, {"page": "1962–63 Birmingham City F.C. season", "response": ["The first leg of the final, against Birmingham's near neighbours Aston Villa, was played on 23 May at St Andrew's. Birmingham took the lead when Jimmy Harris fed Bertie Auld who crossed for Ken Leek's powerful shot, but Aston Villa equalised via Bobby Thomson. Seven minutes into the second half, the same combination of players made it 2–1, and after 66 minutes Jimmy Bloomfield \"ended an excellent run by scoring from a narrow angle, earning even the applause of Villa players\" to give Birmingham a 3–1 lead.Matthews (1995), p. 33. The second leg, four days later at Villa Park, was goalless. Former England centre half Trevor Smith marked Thomson out of the game, Birmingham's defensive tactics included repeatedly kicking the ball out for throw-ins, and Aston Villa were unable to break their opponents down."]}, {"page": "1961–62 Birmingham City F.C. season", "response": ["Twenty-five players made at least one appearance in nationally organised first-team competition, and there were eleven different goalscorers. Forward Mike Hellawell played in all 50 first-team matches over the season (half back Malcolm Beard missed only one), and Ken Leek and Jimmy Harris finished as joint leading goalscorers with 20 goals in all competitions; Leek was top scorer in league competition with 18 goals.", "The final of the 1960–61 Inter-Cities Fairs Cup took place in late September and mid-October 1961, when the first round of the 1961–62 competition was already under way. In the semi-final, Birmingham had beaten Inter Milan home and away; no other English club beat them in a competitive match in the San Siro until Arsenal did so in the Champions League more than 40 years later. Birmingham played in the final for the second consecutive season, having lost to Barcelona in 1960. In the first leg, missed chances and poor defending allowed Roma to take a two-goal lead at St Andrew's, but second-half goals from Mike Hellawell and Bryan Orritt, whose late equaliser came after Jimmy Harris's shot rebounded from the crossbar, took Birmingham into the second leg on level terms. In front of a large crowd in the Stadio Olimpico, Roma won 2–0 to take the trophy 4–2 on aggregate.Matthews (2010), p. 98.", "As finalists in the previous season's competition, Birmingham were awarded a bye to the second round, in which they were drawn against Espanyol. They lost heavily in the first leg, in Barcelona, where Antonio Camps scored a hat-trick.Matthews (2010), p. 46. They won the ill-tempered return leg 1–0 with a goal from Bertie Auld, but four players, including Birmingham's Jimmy Harris and Auld himself, were sent off."]}, {"page": "1960–61 Birmingham City F.C. season", "response": ["Manager Gil Merrick, appointed to succeed Pat Beasley at the end of the 1959–60 season, brought in former Spanish international winger Emilio Aldecoa – the first Spaniard to play in the Football League – as coach.Matthews (2010), p. 356. Twenty-four players made at least one appearance in nationally organised first-team competition, and there were twelve different goalscorers. Full back Brian Farmer played in 54 of the 55 first-team matches over the season, and Jimmy Harris finished as leading goalscorer with 17 goals in all competitions; in the league, Harris and Mike Hellawell were joint top scorers, each with 10 goals."]}, {"page": "Jimmy Harris (footballer born 1933)", "response": ["#REDIRECT Jimmy Harris (footballer, born 1933)"]}, {"page": "List of St Patrick's Athletic F.C. players", "response": ["*Jimmy Harris"]}, {"page": "List of foreign League of Ireland players", "response": ["* Jimmy Harris – St Patrick's Athletic"]}]}}