{"wiki_id": "http://www.wikidata.org/entity/Q6209774", "itemLabel": "Joe Farman", "itemDescription": "British geophysicist", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Farman", "wikipedia_page": {"main": "Joseph Charles Farman CBE (7 August 1930 – 11 May 2013) was a British geophysicist who worked for the British Antarctic Survey. Together with Brian Gardiner and Jon Shanklin, he published the discovery of the ozone hole over Antarctica, having used Dobson ozone spectrophotometers. Their results were first published on 16 May 1985.", "link_mentions": [{"page": "Montreal Protocol", "response": ["Then, in 1985, British Antarctic Survey scientists Joe Farman, Brian Gardiner and Jon Shanklin published results of abnormally low ozone concentrations above Halley Bay near the South Pole. They speculated that this was connected to increased levels of CFCs in the atmosphere. It took several other attempts to establish the Antarctic losses as real and significant, especially after NASA had retrieved matching data from its satellite recordings. The impact of these studies, the metaphor 'ozone hole', and the colourful visual representation in a time lapse animation proved shocking enough for negotiators in Montreal, Canada to take the issue seriously.Grundmann, Reiner, Transnational Environmental Policy: Reconstructing Ozone, London: Routledge, "]}, {"page": "Ozone layer", "response": ["thumb|Levels of atmospheric ozone measured by satellite show clear seasonal variations and appear to verify their decline over time.The breakdown of ozone in the stratosphere results in reduced absorption of ultraviolet radiation. Consequently, unabsorbed and dangerous ultraviolet radiation is able to reach the Earth's surface at a higher intensity. Ozone levels have dropped by a worldwide average of about 4 percent since the late 1970s. For approximately 5 percent of the Earth's surface, around the north and south poles, much larger seasonal declines have been seen, and are described as \"ozone holes\". The discovery of the annual depletion of ozone above the Antarctic was first announced by Joe Farman, Brian Gardiner and Jonathan Shanklin, in a paper which appeared in Nature on May 16, 1985."]}, {"page": "East of England", "response": ["Sun to be determined. In 1938 at Cambridge, Mary Cartwright developed chaos theory with John Edensor Littlewood; Edward Norton Lorenz, a meteorologist from the US, would mainly develop chaos theory in 1963, and the butterfly effect in 1969. In the 1960s at Cambridge, the scanning electron microscope was developed by Sir Charles Oatley, and first made by the Cambridge Scientific Instrument Company in 1965. In 1966, Cambridge geophysicists Frederick Vine and Drummond Matthews proved the theory of plate tectonics and continental drift; plate tectonics was first suggested at Cambridge by Dan McKenzie; continental drift had first been proposed, though not extensively proved, by the German Alfred Wegener in 1912. In 1985, Norwich's Joe Farman discovered the hole in the Ozone layer, when part of Cambridge's British Antarctic Survey."]}, {"page": "Corpus Christi College, Cambridge", "response": ["|Joe Farman"]}, {"page": "1930 in science", "response": ["* August 7 – Joe Farman (died 2013), British geophysicist working for the British Antarctic Survey."]}, {"page": "Aerosol spray", "response": ["In 1974, Drs. Frank Sherwood Rowland and Mario J. Molina proposed that chlorofluorocarbons, used as propellants in aerosol sprays, contributed to the depletion of Earth's ozone layer. In response to this theory, the U.S. Congress passed amendments to the Clean Air Act in 1977 authorizing the Environmental Protection Agency to regulate the presence of CFCs in the atmosphere.Clean Air Act Amendments of 1977 (, p. 726) The United Nations Environment Programme called for ozone layer research that same year, and, in 1981, authorized a global framework convention on ozone layer protection. In 1985, Joe Farman, Brian G. Gardiner, and Jon Shanklin published the first scientific paper detailing the hole in the ozone layer. That same year, the Vienna Convention was signed in response to the UN's authorization. Two years later, the Montreal Protocol, which regulated the production of CFCs was formally signed. It came into effect in 1989. The U.S. formally phased out CFCs in 1995."]}, {"page": "British Antarctic Survey", "response": ["In 1985, the British Antarctic Survey discovered the hole in the ozone layer over Antarctica. The finding was made by a team of three BAS scientists: Joe Farman, Brian Gardiner and Jonathan Shanklin. Their work was confirmed by satellite data, and was met with worldwide concern."]}, {"page": "Dobson ozone spectrophotometer", "response": ["About 120 Dobsonmeters have been made, mostly by R&J Beck of London, of which about 50 remain in use today. The most famous ones are probably Nos. 31 and 51 with which Joe Farman of the British Antarctic Survey discovered the Ozone Hole in 1984.  The \"World Standard Dobson\", No. 83, is owned and operated by the US Dept of Commerce's, NOAA, as is the secondary standard, No. 65."]}, {"page": "List of climate scientists", "response": ["*Joe Farman, British, ozone hole above Antarctica"]}, {"page": "Joseph Charles Farman", "response": ["#REDIRECT Joe Farman"]}, {"page": "Joseph C. Farman", "response": ["#REDIRECT Joe Farman"]}, {"page": "Jon Shanklin", "response": ["Jonathan Shanklin is a meteorologist who has worked at the British Antarctic Survey since 1977. Together with Joe Farman and Brian G. Gardiner he discovered the \"Ozone Hole\" in the 1980s."]}, {"page": "Brian G. Gardiner (meteorologist)", "response": ["Brian Gerard Gardiner is a retired British meteorologist, formerly working for the British Antarctic Survey. Together with Joe Farman and Jonathan Shanklin he discovered the \"Ozone Hole\". Their results were first published on 16 May 1985. They won the Chree medal and prize in 2001."]}, {"page": "Norwich School", "response": ["Past pupils of Norwich School are known as Old Norvicensians (ONs). Over the years the school has educated a number of notable figures, including Lord Nelson, the jurist Sir Edward Coke,. Rajah of Sarawak Sir James Brooke,. philosopher Samuel Clarke,. former Deputy Chairman of the Conservative Party Michael Ashcroft, author George Borrow and 2010 World Time Trial Champion cyclist Emma Pooley.. Distinguished ONs in science include Joe Farman, co-discover of the Antarctic ozone hole, Tom Cavalier-Smith, Emeritus Professor at the University of Oxford, historical ecologist Oliver Rackham, and at least 18 Fellows of the Royal Society among others. Three ONs have been awarded the Victoria Cross, of whom Derek and Hugh Seagrim have the distinction as the only siblings to have been awarded the Victoria Cross and George Cross respectively.. In the arts, several members of the Norwich School art movement were alumni including John Sell Cotman and John Berney Crome, Greek Revival architect William Wilkins, Frederick Sandys, the \"Norwich Pre-Raphaelite\", maverick architectural theorist and historian of the post-war period Reyner Banham, and the 20th-century Post-Impressionist painter, Edward Seago.."]}, {"page": "Oral History of British Science", "response": ["* Joe Farman (Geophysicist)"]}, {"page": "2013 in science", "response": ["*11 May – Joe Farman, British geophysicist who worked for the British Antarctic Survey (born 1930)."]}, {"page": "2013 in the United Kingdom", "response": ["**Joe Farman, 82, physicist, identified ozone hole."]}, {"page": "Index of physics articles (J)", "response": ["*Joe Farman"]}, {"page": "Deaths in May 2013", "response": ["*Joe Farman, 82, British physicist, identified ozone hole.Joseph Farman, 82, Is Dead; Discovered Ozone Hole"]}, {"page": "List of Old Norvicensians", "response": ["* Joe Farman CBE, geophysicist, co-discover of the Antarctic ozone hole"]}, {"page": "Joseph Farman", "response": ["#REDIRECT Joe Farman"]}, {"page": "Farman (surname)", "response": ["* Joe Farman (1930–2013), British geophysicist"]}]}}