{"wiki_id": "http://www.wikidata.org/entity/Q6205866", "itemLabel": "Joanna Kanska", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Joanna_Kanska", "wikipedia_page": {"main": "Joanna Kanska (born 1 April 1957) is a Polish-British actress who has worked in films, television, theatre and radio. She migrated to the United Kingdom in 1984.", "link_mentions": [{"page": "Capital City (TV series)", "response": ["*Joanna Kanska as Sirkka Nieminen", "*Sirkka Nieminen (Joanna Kanska), a senior trader in the secondary desk; the character is originally from Finland (though the actress is Polish) and experiences numerous personal crises during the series including a battle with alcoholism, an abortion and a lesbian affair;'Strange Fruits', Director: Clive Fleury; Writer: Andrew Maclear. \"Capital City\", Euston Films, 'episode 21, series 2. Original air date: 6 December 1990 she is a serial risk-taker and thrill-seeker who, during episode 11, represents herself as a high-class prostitute on at least two occasions;'Twelve Degrees Capricorn', Director: Sarah Hellings; Writer: Andrew Maclear. \"Capital City\", Euston Films, episode 11, series 1. Original air date: 5 December 1989 during the series it is revealed that Sirkka and Declan McConnochie were romantically involved at one stage in the past"]}, {"page": "A Very Peculiar Practice", "response": ["In the first series, Daker had a romance with a post-graduate policewoman, Lyn Turtle (Amanda Hillwood), after she rescued him from drowning in the swimming pool. In the second series Daker has been promoted to head of the centre, and falls in love with Polish academic Grete Grotowska (Joanna Kanska). Rose Marie also seeks romantic involvement with Grotowska, whilst at the same time sleeping with the VC Jack Daniels in her bid to oust Daker and become head of the medical centre herself. There is further complication when Mrs Daniels informs Rose Marie, who is her doctor, that she thinks her husband is having an affair.", "In the sequel television film, A Very Polish Practice (1992), Daker and Grete live together in Poland, where he  struggles with the former Communist country's antiquated health service. Grete encounters an ex-lover (Tadeusz Melnik, played by Alfred Molina), who helped her get out of Poland and to whom she had promised herself out of gratitude. She battles to decide whether to stay with Stephen and their child or to go with Melnik (with or without the child), confessing that she still loves him as well as Stephen. The idea for the second series was said to have come from the actress Joanna Kanska, who played Grete. Melnik eventually gives the couple his blessing.", "|Joanna Kanska||Grete Grotowska||colspan=7 "]}, {"page": "Nowy Sącz", "response": ["* Joanna Kanska (b. 1959), Polish-British actress"]}, {"page": "The Tall Guy", "response": ["* Joanna Kanska as Tamara"]}, {"page": "Sleepers (TV series)", "response": ["* Joanna Kanska — \"Nina Grishina\""]}, {"page": "Foyle's War (series 1)", "response": ["|colspan=\"6\"|Guests: Robert Hardy, Rosamund Pike, Benedict Sandiford, Edward Fox, David Horovitch, Joanna Kanska, Andrew Powell, Paul Putner, Tom Chadbon, Neil Conrich, Sam Troughton, James McAvoy, Philip Whitchurch, Dominic Mafham"]}, {"page": "Cashcows", "response": ["Cashcows was a short-lived radio programme that originally aired in September 2005.  There were five half-hour episodes and it was broadcast on BBC Radio 4.  It starred Joanna Kanska, Susan Jameson, Elizabeth Spriggs, Adjoa Andoh, and Colleen Prendergast."]}, {"page": "20th Century Vampire", "response": ["Eloise (Louise Lombard) works at the Co-op supermarket in a town in the North of England.  She feels different from the people around her, dresses in black, and is unhappy much of the time, as if some piece of her life is missing.  Then her mysterious Transylvanian Aunt Lucretia (Joanna Kanska) reveals that she is really a vampire, a hereditary condition, and she must enter training to fulfill her destiny.  Eloise eventually embraces her fate, but has to deal with her boyfriend Wayne, played by William Ivory, and her equally mystified co-workers at the store, including flatmate and best friend Debbie (Jane Hazlegrove).  She is horrified to find herself back in \"school\", with Lucretia as the teacher, even to the extent of sitting for three hour examination papers.  Having been a miserable failure at exams in school despite her intelligence, she is convinced she will fail yet again.  However, the exams have a \"practical section\" which saves her grade.", "* Lucretia - Joanna Kanska"]}, {"page": "1959 in British television", "response": ["* 1 April – Joanna Kanska, actress"]}, {"page": "Material Girl (TV series)", "response": ["*Joanna Kanska – Dorota, Ali's studio dressmaker"]}, {"page": "Situation Vacant", "response": ["*Rachel – Joanna Kanska"]}, {"page": "Madson (TV series)", "response": ["The series was produced by McShane's own production company, and was produced by McShane himself, under the guidance of executive producer Chris Parr. The series co-starred Joanna Kanska, Jayne Ashbourne, Matthew Marsh and Charles Gray. Each episode shows the inefficiencies of the law, solves a new crime or helps those whom the law has neglected. Filming on the series took place in West London between 23 August and 29 November 1995. Notably, the series has never been released on DVD.", "* Joanna Kanska as Magda Ostrowska"]}]}}