{"wiki_id": "http://www.wikidata.org/entity/Q6200301", "itemLabel": "Jimmy Harris", "itemDescription": "footballer 1907", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmy_Harris_(footballer,_born_1907)", "wikipedia_page": {"main": "James William Harris (9 March 1907 – 1974) was an English professional footballer who played as an outside-forward in the Football League for West Ham United and  Southampton in the 1930s.", "link_mentions": [{"page": "Jimmy Harris", "response": ["Jimmy Harris may refer to:", "* Jimmy Harris (cornerback) (born 1946), former American football cornerback for the Washington Redskins and Cincinnati Bengals", "* Jimmy Harris (defensive back) (1934–2011), former American football defensive back for the Philadelphia Eagles, Los Angeles Rams, and Dallas Cowboys", "* Jimmy Harris (footballer, born 1907) (1907–?), English footballer who played for West Ham United and Southampton", "* Jimmy Harris (footballer, born 1933), English footballer who played for Everton, Birmingham City and Oldham Athletic", "* Jimmy Harris (politician), politician from New Orleans, Louisiana", "* Jimmy Harris (EastEnders), fictional character in the UK soap opera EastEnders"]}, {"page": "Jimmy Harris (footballer born 1907)", "response": ["#REDIRECT Jimmy Harris (footballer, born 1907)"]}, {"page": "1932–33 Southampton F.C. season", "response": ["Alongside the host of departures, Southampton made a number of low-key signings in the summer of 1932. The first arrival was goalkeeper Billy Light, who joined from Harland and Wolff on amateur terms and did not turn professional until more than a year later. Outside-right Fred Dunmore was signed for the reserve team from Derby County in June, when Accrington Stanley goalkeeper Bob Foster was also signed. Winger Jimmy Harris joined from West Ham United in July, followed by centre-forward Norman Cole from Newport (Isle of Wight) in August. After the season had started, inside-left Tom Ruddy was signed from Chesterfield. Also in September, Willie Haines was sold to Weymouth, George Harkus joined Southport as reserve player-coach, and Sid Grover signed for Bournemouth Gasworks Athletic. Half-back Cyril King signed from Plymouth United on amateur terms in November. In February, with the club still suffering financial problems, Fulham bought outside-left Johnny Arnold and left-back Michael Keeping for a combined fee of £5,100. After the arrival of Keeping, Fulham sent regular left-back Arthur Tilford in return to Southampton on a temporary basis.", "!scope=\"row\"|Jimmy Harris", "!scope=\"row\"|Jimmy Harris"]}, {"page": "1933–34 Southampton F.C. season", "response": ["After the end of the 1932–33 season, Southampton manager George Kay sold several players. In May, amateur forward Bill Charlton joined divisional rivals Fulham, while former Cottagers left-back Arthur Tilford returned to the club after three months at the South Coast side. Frank Osborne also left the Saints after a season playing for the reserve side, retiring from football until returning as a director at Fulham a few years later. Backup goalkeeper Bob Foster joined Third Division North side Wrexham in June, while outside-left Jimmy Harris was sold to Aylesford Paper Mills. The club also signed several new players. In June, versatile forward Fred Tully joined from top-flight side Aston Villa, and in August half-back Johnny McIlwaine returned after a year at Welsh side Llanelli. During the summer, the club also signed winger Norman Catlin from Arsenal, full-back Frank Ward from Preston North End, and inside-forward Ted Withers from Clark's College, all on amateur terms initially.", "!scope=\"row\"|Jimmy Harris"]}]}}