{"wiki_id": "http://www.wikidata.org/entity/Q6209405", "itemLabel": "Joe Davison", "itemDescription": "English footballer (1897-1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Davison_(footballer,_born_1897)", "wikipedia_page": {"main": "Joseph Davison (6 July 1897 – 1965) was an English professional footballer. He played as a full back in the Football League for Middlesbrough, Portsmouth and Watford.Born in Byers Green, Davison started his working life doing national service, during and after the First World War. Once he was demobbed, he signed as a professional for Middlesbrough, where he remained for four years. He joined Portsmouth in 1923, and was appointed captain. In 1923–24, Davison's first season at the club, Portsmouth won promotion from the Third Division South as champions. In 1926–27, Portsmouth finished second in the Second Division, winning promotion to the First Division. However, Davison was released at the end of that season, and joined Watford on a free transfer. He made 147 appearances for Watford in all competitions, scoring two goals. He retired from football at the end of the 1931–32 season.", "link_mentions": [{"page": "Frank Barson", "response": ["In his debut at Crystal Palace Barson was cautioned early on in the game. Watford player Joe Davison was later sent off in that game with the referee reportedly saying \"Off you go, Barson\". In late September Barson was sent off in a home game against Fulham. After entangling legs with Fulham's Temple, Barson was adjudged to have kicked out at him, although both Watford and Fulham players argued that it had not happened. Although a petition of 5,000 signatures arguing Barson's unfair treatment was presented to the FA by Watford's mayor, Barson was suspended for six months. Watford's chairman, John Kilby, spoke out against the decision, citing that a player had recently been suspended for three months for striking a referee. Barson's case was argued for in local and national newspapers, but the revelation that the petition had been burnt at the FA headquarters caused the affair to die down. The suspension stopped Barson from participating in the remainder of the season, and he was released from his contract."]}, {"page": "Joe Davison (footballer, born 1919)", "response": ["Joe Davison (29 July 1919 – 1983) was an English footballer who made 240 appearances in the Football League playing as a full back for Darlington in the years following the Second World War. He was born in Newcastle upon Tyne, and also played non-league football for Throckley Welfare and North Shields."]}, {"page": "Joe Davison", "response": ["Joe Davison may refer to:", "*Joe Davison (footballer, born 1897) (1897–1965), English footballer who played for Middlesbrough, Portsmouth and Watford in the 1920s and 1930s", "*Joe Davison (footballer, born 1919) (1919–1983), English footballer who played for Darlington in the 1940s and 1950s"]}]}}