{"wiki_id": "http://www.wikidata.org/entity/Q6204961", "itemLabel": "Joan Cooper", "itemDescription": "British actress (1922-1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joan_Cooper", "wikipedia_page": {"main": "Joan Cooper (23 August 1922 – 1 July 1989) was a British actress.\nHer second husband was the actor Arthur Lowe whom she met at the Manchester Repertory Theatre in 1946. They were married at the Register Office, Strand, London, in January 1948. She had three children – Jane Gatehouse and David Gatehouse (children from a previous marriage) and Stephen Lowe (born 1953 at Hammersmith, London, UK).\nShe had some minor roles alongside him, particularly playing Private Godfrey's sister Dolly in some episodes of Dad's Army.\nLowe died in April 1982, and five years later she moved to his parents' cottage in Hayfield, Derbyshire, which had been vacant since his mother's death in 1981. Cooper lived there until her death from stomach cancer two years later at the age of 66.", "link_mentions": [{"page": "The Ruling Class (film)", "response": ["* Joan Cooper – Nurse Brice"]}, {"page": "Arthur Lowe", "response": ["During this time Lowe began a romantic relationship with Joan Cooper (1922–1989), a married actress in the company whose husband also began an affair at about the same time. Arthur and Joan were engaged in June 1946 and lived together from August. After Joan's divorce came through they married at a registry office in Robert Adam Street, The Strand, London, on 10 January 1948.GRO Register of Marriages: MAR 1948 5d 800 MARYLEBONE – Arthur Lowe = Gatehouse or Cooper Joan had a son, David Gatehouse, from her first marriage. Another son, Stephen Lowe, was born on 23 January 1953. The couple remained together until Lowe's death. "]}, {"page": "Michael Knowles (actor)", "response": ["After the success of Dad’s Army  and the radio adaptation, Knowles once again teamed up with Snoad to write It Sticks Out Half a Mile, a radio spin-off to Dad's Army. Work started on writing the script in 1980 and when the first one was shown to Arthur Lowe he was so taken with it he tried to persuade the BBC to make it a television series rather than radio, however the BBC said no. Recording began in 1981 and picked up the story in 1948 and follows the attempts at trying to save the town's pier. Unfortunately Arthur Lowe died in 1982 and many believed that that was the end of it, however at Arthur Lowe's funeral Joan Cooper (Arthur Lowe's wife) found Knowles and Snoad, and told them that her husband liked their scripts so much that he would have wanted the full series to go ahead. Recording for the series stated later in 1982 with Ian Lavender and Bill Pertwee filling the void left by Arthur Lowe."]}, {"page": "The Battle of Godfrey's Cottage", "response": ["#Amy Dalby, who featured as Dolly Godfrey, died on 10 March 1969 — two days after the episode first aired.  She was replaced by Joan Cooper when the character reappeared in later episodes."]}, {"page": "The Love of Three Oranges (Dad's Army)", "response": ["*Joan Cooper as Dolly"]}, {"page": "No Spring for Frazer", "response": ["# This was the first appearance in Dad's Army of Arthur Lowe's wife, Joan Cooper, who played Godfrey's sister Dolly in later episodes.", "*Joan Cooper as Miss Baker"]}, {"page": "List of Dad's Army characters", "response": ["*Dolly Godfrey (Amy Dalby and Joan Cooper) (series 2-9) – Private Godfrey's younger sister. Renowned for the quality of her upside-down cakes and cucumber sandwiches. Although she appears rarely, she is constantly referred to by her brother. Amy Dalby played her in one episode of series 2, \"The Battle of Godfrey's Cottage\" (dying two days after transmission), and then Joan Cooper played her in one episode of series 8, \"Is There Honey Still for Tea?\", a Christmas special, \"The Love of Three Oranges\" and the final episode, \"Never Too Old\". Cooper (who was actually married to Arthur Lowe) also appeared in \"No Spring for Frazer\" as Miss Baker, an undertaker's secretary, and in \"Time on My Hands\", as Miss Fortescue, a tea shop owner.", "*Cissy Godfrey (Nan Braunton and Kathleen Saintsbury) (series 2-8) – Private Godfrey's other sister, appeared in one episode of series 2 and three episodes of series 3 (1969), played by Nan Braunton. Braunton reprised the role in two episodes of the radio series, in which Cissy was Private Godfrey's only sister. The role of Cissy was later taken over by Kathleen Saintsbury in an episode of the eighth television series, and by Joan Cooper (who had previously played Dolly Godfrey in the television series) in an episode of the third radio series. Braunton played Cissy in one episode of series 2, \"The Battle of Godfrey's Cottage\" and three episodes of series 3, \"The Day the Balloon Went Up\", \"War Dance\" and \"Branded\". Saintsbury played Cissy in one episode of series 8, \"Is There Honey Still for Tea?\"."]}, {"page": "Never Too Old", "response": ["*Joan Cooper as Dolly"]}, {"page": "Time on My Hands (Dad's Army)", "response": ["*Joan Cooper as Miss Fortescue"]}, {"page": "Is There Honey Still for Tea?", "response": ["*Joan Cooper as Dolly"]}, {"page": "Dad's Army", "response": ["* Dolly (Amy Dalby and Joan Cooper) and Cissy Godfrey (Nan Braunton and Kathleen Saintsbury), Private Godfrey's spinster sisters, who reside with him at their cottage."]}, {"page": "1989 in British television", "response": ["|Joan Cooper"]}, {"page": "Rookery Nook (1970 TV drama)", "response": ["* Joan Cooper ...  Gertrude Twine "]}, {"page": "The Bawdy Adventures of Tom Jones", "response": ["* Joan Cooper as Nellie"]}, {"page": "Joan Cooper (disambiguation)", "response": ["Joan Cooper may refer to:", "* Joan Cooper (1922–1989), British actress", "* J. California Cooper, the pen-name of Joan Cooper (1931–2014), American playwright and author", "* Joan Cooper (social worker) (1914–1999), English civil servant and social worker"]}, {"page": "Kathleen Saintsbury", "response": ["*Ben Travers' Rookery Nook (1970) along with Richard Briers, Arthur Lowe and Joan Cooper"]}]}}