{"wiki_id": "http://www.wikidata.org/entity/Q6210462", "itemLabel": "Joe Hutton", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Hutton_(piper)", "wikipedia_page": {"main": "Joe Hutton (August 16, 1923 – July 17, 1995) was a Northumbrian smallpipe player and fiddler. \n\n", "link_mentions": [{"page": "List of folk musicians", "response": ["*Joe Hutton"]}, {"page": "Northumbrian smallpipes", "response": ["*Joe Hutton"]}, {"page": "Kathryn Tickell", "response": ["Kathryn Tickell was born in Walsall, then in Staffordshire, to parents who originated from Northumberland and who moved back there with the family when Kathryn was seven. Her paternal grandfather played accordion, fiddle, and organ. Her father, Mike Tickell, sang and her mother played the concertina. Her first instrument was piano when she was six. A year later, she picked up a set of Northumbrian smallpipes brought home by her father, who intended them for someone else. Frustrated by fiddle and piano, she learned that the pipes rewarded her effort. She was inspired by older musicians such as Willy Taylor, Will Atkinson, Joe Hutton, and Billy Pigg."]}, {"page": "Music of Northumbria", "response": ["In the early- and mid-twentieth century, influential fiddlers included Ned Pearson, Jim Rutherford, Adam Gray, George Hepple and Jake Hutton, father of the noted piper Joe Hutton. John Armstrong of Carrick played with the piper Billy Pigg. In the later part of the century, Willy Taylor was perhaps the most highly respected of the many fiddlers in the region.", "The second folk revival saw a number of acts drawing on this work, and enjoying some success. Probably the most influential piper from the region was Billy Pigg, but other important pipers in the mid-twentieth century include G. G. Armstrong, George Atkinson, Jack Armstrong, and Joe Hutton.J. Connell, C. Gibson, Sound Tracks: Popular Music, Identity, and Place (Routledge, 2003), p. 34. Figures such Louis Killen, The High Level Ranters and Bob Davenport brought Northumbrian folk to national and international audiences.S. Broughton, M. Ellingham, R. Trillo, O. Duane, V. Dowell, World Music: The Rough Guide (Rough Guides, 1999), pp. 67–8."]}, {"page": "Will Atkinson (musician)", "response": ["In the 1950s, Atkinson played with other musicians near Alnwick forming The Cheviot Ranters, a noted dance band in northern Northumberland, but left the group some time later. He also bought a good mouth organ at this time, intending it to be for his son, but liked it so much he kept it himself. He also refined his mouth organ technique after hearing Larry Adler's playing, and mostly played mouth organ subsequently. In 1974 he was one of the artists recorded by Topic, playing mouth organ, on Bonny North Tyne - Northumbrian Country Music. In later life, he recorded many times, chiefly with producer Geoff Heslop. The first release, with his friends Joe Hutton (piper) and Willy Taylor, collectively known as The Shepherds, was Harthope Burn, next came a compilation of Northumbrian Music and Poetry, From Sewingshields to Glendale (with Kathryn Tickell, Alistair Anderson, Mike Tickell, Hutton and Atkinson, etc.) and in 1989 Heslop and Alistair Anderson recorded him in a solo album called simply Will Atkinson - Mouthorgan. This included tunes from various sources, including five of his own compositions. Several recordings of him playing at folk clubs are available on the FARNE archive. When compiling the multi-album anthology The Voice of the People, Reg Hall selected several recordings of Will, which appeared on the record Ranting and Reeling - these included some of the recordings made for Bonny North Tyne, as well as later recordings made with The Shepherds."]}, {"page": "Geoff Heslop", "response": ["*Joe Hutton of Coquetdale (Joe Hutton)", "*Harthope Burn (Joe Hutton, Will Atkinson and Willy Taylor)", "Joe Hutton, Willy Taylor, Will Atkinson, Mike Tickell, Allan Wood,"]}, {"page": "Redesdale Studios", "response": ["Many well-known artists recorded there during the studio's heyday.  Among the clients were Kathryn Tickell (Kathryn Tickell Band, Signs, The Gathering),  Ribbon Road  (The Mortgaged Heart),  Clan Alba, Rod Clements, Joe Hutton, Alistair Anderson, Simon Thoumire, Catriona MacDonald and many others."]}, {"page": "Joe Hutton", "response": ["Joe Hutton may refer to:", "* Joe Hutton (piper) (1923–1995), Northumbrian smallpiper", "* Joe Hutton (footballer) (1927–1999), Scottish footballer", "* Joe Hutton (basketball) (1928–2009), American basketball player"]}, {"page": "G. G. Armstrong", "response": ["He taught 36 pupils, including Joe Hutton, Tommy Breckons and Colin Caisley, and passed on his pipemaking skills to William Cocks. Some of his teaching was for Scout troops – the Northumbrian Pipers' Society led a move to introduce the instrument among Scouts in Northumberland between the wars. From the playing of these and other pupils, it is clear that Armstrong must have been not only a fine piper but an excellent teacher. Tommy Breckons recalled learning first from Armstrong, and later from Tom Clough: \"Now as to the difference between Tom and George. Tom wouldn't have  been much use to a novice piper.... But George had a gift for teaching a novice. He could show you how to do things. I don't quite know how he did it!\"Some memories, Tommy Breckons, Northumbrian Pipers' Society Magazine, v. 18, 1997", "He was widely respected as a pipemaker and repairer, in collaboration with his brother-in-law John MacCalman; the wood and metal parts were turned and shaped by MacCalman, while Armstrong's part of the work was to \"assemble the parts, fit the stoppers, tune the chanters, pad the keys, and reed the pipes.\"\"G. G. Armstrong's Record Book\", David Geddes, Northumbrian Pipers' Society Magazine, v. 19, 1998.  In 1936 he repaired an old James Reid set for Joe Hutton to learn on, and subsequently made two complete sets for him, in 1938 and 1943. He also repaired and re-reeded pipes for Billy Pigg and others. He was married to Ella, the sister of William Cocks, the noted pipe-maker and collector. His own 17-key set of pipes, a family heirloom, made by James Reid, is now in the Morpeth Chantry Bagpipe Museum.Woodhorn Museum Website He used this as the model for the 17-key chanters he made himself."]}, {"page": "Willy Taylor", "response": ["Willy Taylor (5 January 1916 – 2 November 2000) was a fiddler from Northumberland, England. He performed with Joe Hutton and Will Atkinson as the Shepherds.", "In 1983, he recorded Harthope Burn, with the mouth organ player Will Atkinson and the piper Joe Hutton. This group, known as The Shepherds, travelled widely, playing at clubs and folk festivals across Britain. They also made some broadcasts, often with Alistair Anderson, the English concertina player. After his retirement from farming, he made a solo album Welcome to the Dene. Some recordings of his club performances, solo and with the Shepherds, are available on the FARNE folk audio archive."]}, {"page": "John Armstrong (of Carrick)", "response": ["A series of accidents to his hands, resulting in a stiffening of his fingers, forced John to concentrate on the fiddle in later years. He started playing duets with Joe Hutton in 1972, adapting arrangement for two pipes to pipes and fiddle. In 1973 they won the pairs competition at Newcastleton Traditional Festival. He is featured on the Topic album Bonny North Tyne.Bonny North Tyne 12TS239  However  a project for a subsequent duet album never materialised, owing to his illness and death. Some recordings of them are available on FARNE, as well as a few of Armstrong on solo fiddle. "]}, {"page": "Archie Dagg", "response": ["He also composed tunes - his tunebook, 'A Coquetdale Garland' published in 1978, was reissued in an expanded edition after his death, in 1995,  with a foreword by Joe Hutton. It includes 19 tunes, many of which have since become standards, regularly played at sessions, having been reprinted by the Northumbrian Pipers' Society and the Alnwick Pipers' Society. A recording on the FARNE Archive, by Joe Hutton includes three of these.", "* Joe Hutton's March", "* Joe Hutton's March"]}, {"page": "George Hepple", "response": ["He had been fascinated with the Northumbrian smallpipes for some time, but was frustrated by the considerable difficulty of getting a set at that time. After the war, in 1947, local musician Basil Clough found him a set, from Colin Caisley, and he made some progress on the instrument. His preferred instrument remained the fiddle, however. At this time, the piper Joe Hutton lived nearby at Gilsland, Cumberland and was a frequent visitor. George's son John also took up the smallpipes, and was broadcast by the BBC in 1953, on Children's Hour, presented by Huw Wheldon,.Woodhorn Museum ArchiveProfile by Forster Charlton, NPS Magazine, 1985. John and George made several broadcasts subsequently on the BBC's Barn Dance programme, playing pipe and fiddle duets. Later, both George and Joe Hutton would stay with John, at the time of the annual Pipers' Society competitions in Newcastle, and they would play together from morning till night."]}, {"page": "Forster Charlton", "response": ["He was very active in recording traditional musicians in the area, notably Billy Pigg, and he would take a portable tape recorder to sessions and festivals. Several of these recordings were used to compile the record Billy Pigg, the Border Minstrel,Billy Pigg, the Border Minstrel. Leader Sound, 1971: LEA 4006 while many more may be heard on the FARNE archive. Besides Billy Pigg, musicians he recorded include Joe Hutton, Diana Blackett-Ord, Richard Flemming and George Atkinson, as well as some duet recordings of himself with Colin Caisley. He also made, but did not retain, a recording of Tom Clough, late in the latter's life."]}, {"page": "Deaths in July 1995", "response": ["*Joe Hutton, 71, Northumbrian smallpipe player and fiddler."]}]}}