{"wiki_id": "http://www.wikidata.org/entity/Q6212201", "itemLabel": "Joe Sayers", "itemDescription": "English county cricketer (born 1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Sayers_(cricketer)", "wikipedia_page": {"main": "Joe Sayers (born Joseph John Sayers, 5 November 1983) is a former English first-class cricketer, who has played for the Oxford University Centre of Cricketing Excellence, Oxford University and Yorkshire. He is a left-handed opening batsman and right arm off spin bowler. Sayers was educated at St Mary's School, Menston, and Worcester College, Oxford.", "link_mentions": [{"page": "List of England cricket captains", "response": ["| 33 || Joe Sayers || 2003† || South Africa || England || 1 || 0 || 1 || 0"]}, {"page": "Somerset County Cricket Club in 2005", "response": ["Yorkshire and Somerset fought out a high-scoring draw at Taunton. Having opted to bat first, the visitors lost Joe Sayers for a duck, but Phil Jaques and Michael Lumb made centuries to see Yorkshire to 368 for 4. Then, Charl Langeveldt took the wickets of Craig White and Lumb, and Deon Kruis edged Andy Caddick behind for a duck to leave Yorkshire 377 for 7 overnight. Caddick wrapped up the innings on the second morning, finishing with six for 96, before Somerset opener Michael Wood started notching up boundaries. He made 35 fours and one six in a nine-hour cameo which yielded a total of 297 - before he was caught by Tim Bresnan 14 short of Somerset's highest innings for the season. With help from Ian Blackwell, who made 62, and Keith Parsons' 94, Somerset amassed 581 in a day and a half. Andy Caddick got an early breakthrough for Somerset, but Sayers and Anthony McGrath defied them, with a 119-run partnership for the second wicket. Only six overs of play was possible on day four before rain set in to ensure a drawn game."]}, {"page": "Leicestershire County Cricket Club in 2005", "response": ["Tim Bresnan then removed both the openers for ducks, but John Maunders and Chris Rogers made healthy knocks to take Leicestershire to a somewhat respectable 217 for a sizeable target - while Richard Dawson took four for 54 and Tim Bresnan added another man to his tally and finished with three for 44. Michael Wood and Joe Sayers set Yorkshire on track to chasing the target of 397, pairing up for 115 before Wood was caught out for 70, and Yorkshire were 132 for 1 overnight, setting up an intriguing chase. And, as in May when the teams met at Grace Road and Yorkshire chased a club record 406, Yorkshire recovered from a dismal first innings to take the victory. Sayers made 104, Anthony McGrath 55, and Ian Harvey an unbeaten 54 as Yorkshire reached the target, making their second highest fourth innings total to win in their 142-year history until this match - and both of those were against Leicestershire in 2005."]}, {"page": "Yorkshire County Cricket Club in 2005", "response": ["*  Joe Sayers", "Tim Bresnan then removed both the openers for ducks, but John Maunders and Chris Rogers made healthy knocks to take Leicestershire to a somewhat respectable 217 for a sizeable target – while Richard Dawson took four for 54 and Tim Bresnan added another man to his tally and finished with three for 44. Michael Wood and Joe Sayers set Yorkshire on track to chasing the target of 397, pairing up for 115 before Wood was caught out for 70, and Yorkshire were 132 for 1 overnight, setting up an intriguing chase. And, as in May when the teams met at Grace Road and Yorkshire chased a club record 406, Yorkshire recovered from a dismal first innings to take the victory. Sayers made 104, Anthony McGrath 55, and Ian Harvey an unbeaten 54 as Yorkshire reached the target, making their second highest fourth innings total to win in their 142-year history until this match – and both of those were against Leicestershire in 2005.", "A second-string Yorkshire pummeled the Bangladeshi bowlers, and despite the short timeframe – three days instead of the County Championship's four – they still got a win. With a run-rate of more than four an over they quickly made their way to 357 for 2 on the first day – Matthew Wood made an unbeaten 202, five short of his career highest score, and shared an opening partnership worth 272 with Joe Sayers. In reply, Tushar Imran made his second first-class century on tour, and the fifth of his career, with 116 in a little over three hours, and 19-year-old Nazimuddin made 60 as the tourists made their way to 325 – left-armer David Lucas taking five for 49. Yorkshire lost two wickets before stumps to be 48 for 2, but Michael Lumb made a century on the final day to ensure continued Yorkshire domination as they declared on 240 for 2, setting Bangladesh a target of 273 in three and a half hours. Lucas continued on his fine form from the first innings, taking three wickets, and no Bangladeshi passed 30 as they succumbed for 146 – Lucas took three for 35, fellow left-armer David Wainwright took three for 22 with his spin, and even part-time medium-pacer Richard Pyrah got one wicket in his two overs.", "Yorkshire and Somerset fought out a high-scoring draw at Taunton. Having opted to bat first, the visitors lost Joe Sayers for a duck, but Phil Jaques and Michael Lumb made centuries to see Yorkshire to 368 for 4. Then, Charl Langeveldt took the wickets of Craig White and Lumb, and Deon Kruis edged Andy Caddick behind for a duck to leave Yorkshire 377 for 7 overnight. Caddick wrapped up the innings on the second morning, finishing with six for 96, before Somerset opener Michael Wood started notching up boundaries. He made 35 fours and one six in a nine-hour cameo which yielded a total of 297 – before he was caught by Tim Bresnan 14 short of Somerset's highest innings for the season. With help from Ian Blackwell, who made 62, and Keith Parsons' 94, Somerset amassed 581 in a day and a half. Andy Caddick got an early breakthrough for Somerset, but Sayers and Anthony McGrath defied them, with a 119-run partnership for the second wicket. Only six overs of play was possible on day four before rain set in to ensure a drawn game.", "Worcestershire were then shaken by South African Deon Kruis who took the first three wickets in a frantic last session. Worcestershire hit at nearly a run a ball, ending the day with 126 off 24 overs, but lost four wickets in the process. Only 40 overs of play were possible on the third day, as Australians Cleary and Ian Harvey bowled Worcestershire out for 211. Yorkshire set about chasing 203 at a rapid pace, losing Matthew Wood and Joe Sayers but still making 125 for 2 in 25 overs before rain set in, shortening the day's play to five overs and ruining Yorkshire's chances as they needed 78 more with 8 wickets in hand. Worcestershire were later deducted two points for a slow over rate.", "Yorkshire Phoenix won the toss and chose to bat, and immediately lost both openers at Derby. That set the pace of the innings, and seven maiden overs were bowled out of the total of 45. Jonathan Moss got the best bowling figures for the hosting Derbyshire Phantoms, removing Richard Pyrah and Simon Guy in successive balls and ending with bowling figures of 9–2–27–3. Moss' two wickets set Yorkshire back to 66 for 7, and only a rearguard between Joe Sayers, who made 54 not out in two hours, and David Lucas saw them bat out the allotted overs. The pair added 65 for the ninth wicket as Yorkshire closed on 171 for 9. Derbyshire lost Michael Di Venuto for 1 early on, but despite Anthony McGrath removing Hassan Adnan for 57 and Luke Sutton for 34, Derbyshire made it to the target with fourteen balls. Extras were the second-highest scorer, with 43, including 31 wides.", "Yorkshire, a team chasing points in their attempt to promote from Division Two of the County Championship, racked up a 304-run lead on first innings against Derbyshire, yet failed to win. However, the 12 points earned gave them promotion from Division Two. Winning the toss and batting first, Yorkshire relied on Australians Mark Cleary and Ian Harvey to take wickets, as Cleary ended with three for 46 and Harvey with five for 40. Harvey got his first five-for of the season as Derbyshire were bowled out for 216, while Steve Stubbings was the only batsman to pass 30. Matthew Wood and Joe Sayers then added 113 for the first wicket to put Yorkshire just 103 behind with all wickets intact at the end of the first day's play. On the second morning, Durham got four wickets for 101 before Anthony McGrath and Ian Harvey smacked centuries in a two-and-a-half-hour partnership worth 156. Yorkshire were eventually bowled out at stumps on day two, having made their way to a lead of 304, despite Ant Botha wrapping up the tail to take four for 90.", "Steve Stubbings gave Derbyshire a good start with a four-and-a-half-hour 91, leading Derbyshire to 216 for 4, but Mark Lawson set Derbyshire back with his leg spin, which reduced Derbyshire from 216 for 4 to 233 for 7. However, Botha and Tim Lungley added 133 for the seventh wicket, Botha recording his highest career score as his four hours at the crease yielded an unbeaten score of 156. Lawson wrapped up the Derbyshire innings, ending with five for 155 as Derbyshire were bowled out for 523, having added 290 for the last three wickets. Still, Yorkshire only required 220 in 59 overs, but Botha tied them down – in a marathon 23-over spell after coming on as first change bowler, Botha only conceded 20 runs and took two wickets – helping as Yorkshire lost their first six wickets for 82. Joe Sayers and Simon Guy then batted for three quarters of an hour to save the draw for Yorkshire."]}, {"page": "Worcestershire County Cricket Club in 2005", "response": ["Worcestershire were then shaken by South African Deon Kruis who took the first three wickets in a frantic last session. Worcestershire hit at nearly a run a ball, ending the day with 126 off 24 overs, but lost four wickets in the process. Only 40 overs of play were possible on the third day, as Australians Cleary and Ian Harvey bowled Worcestershire out for 211. Yorkshire set about chasing 203 at a rapid pace, losing Matthew Wood and Joe Sayers but still making 125 for 2 in 25 overs before rain set in, shortening the day's play to five overs and ruining Yorkshire's chances as they needed 78 more with 8 wickets in hand. Worcestershire were later docked two points for a slow over rate."]}, {"page": "Derbyshire County Cricket Club in 2005", "response": ["Yorkshire Phoenix won the toss and chose to bat, and immediately lost both openers at Derby. That set the pace of the innings, and seven maiden overs were bowled out of the total of 45. Jonathan Moss got the best bowling figures for the hosting Derbyshire Phantoms, removing Richard Pyrah and Simon Guy in successive balls and ending with bowling figures of 9–2–27–3. Moss' two wickets set Yorkshire back to 66 for 7, and only a rearguard between Joe Sayers, who made 54 not out in two hours, and David Lucas saw them bat out the allotted overs. The pair added 65 for the ninth wicket as Yorkshire closed on 171 for 9. Derbyshire lost Michael di Venuto for 1 early on, but despite Anthony McGrath removing Hassan Adnan for 57 and Luke Sutton for 34, Derbyshire made it to the target with fourteen balls. Extras were the second-highest scorer, with 43, including 31 wides.", "Yorkshire, a team chasing points in their attempt to promote from Division Two of the County Championship, racked up a 304-run lead on first innings against Derbyshire, yet failed to win. However, the 12 points earned gave them promotion from Division Two. Winning the toss and batting first, Yorkshire relied on Australians Mark Cleary and Ian Harvey to take wickets, as Cleary ended with three for 46 and Harvey with five for 40. Harvey got his first five-for of the season as Derbyshire were bowled out for 216, while Steve Stubbings was the only batsman to pass 30. Matthew Wood and Joe Sayers then added 113 for the first wicket to put Yorkshire 103 behind with all wickets intact at the end of the first day's play. On the second morning, Durham got four wickets for 101 before Anthony McGrath and Ian Harvey notched up centuries in a two-and-a-half-hour partnership worth 156. Yorkshire were eventually bowled out at stumps on day two, having made their way to a lead of 304, despite Ant Botha wrapping up the tail to take four for 90.", "Steve Stubbings opened the batting for Derbyshire with a four-and-a-half-hour 91, leading Derbyshire to 216 for 4, but Mark Lawson set Derbyshire back with his leg spin, which reduced Derbyshire from 216 for 4 to 233 for 7. However, Botha and Tim Lungley added 133 for the seventh wicket, Botha recording his highest career score as his four hours at the crease yielded an unbeaten score of 156. Lawson wrapped up the Derbyshire innings, ending with five for 155 as Derbyshire were bowled out for 523, having added 290 for the last three wickets. Yorkshire required 220 in 59 overs to win, but Botha tied them down – in a marathon 23-over spell after coming on as first change bowler, Botha only conceded 20 runs and took two wickets – helping as Yorkshire lost their first six wickets for 82. Joe Sayers and Simon Guy then added 32 in three-quarters of an hour to save the draw for Yorkshire."]}, {"page": "National League Division Two in 2005", "response": ["Yorkshire Phoenix won the toss and chose to bat, and immediately lost both openers at Derby. That set the pace of the innings, and seven maiden overs were bowled out of the total of 45. Jonathan Moss got the best bowling figures for the hosting Derbyshire Phantoms, removing Richard Pyrah and Simon Guy in successive balls and ending with bowling figures of 9–2–27–3. Moss' two wickets set Yorkshire back to 66 for 7, and only a rearguard between Joe Sayers, who made 54 not out in two hours, and David Lucas saw them bat out the allotted overs. The pair added 65 for the ninth wicket as Yorkshire closed on 171 for 9. Derbyshire lost Michael Di Venuto for 1 early on, but despite Anthony McGrath removing Hassan Adnan for 57 and Luke Sutton for 34, Derbyshire made it to the target with fourteen balls. Extras were the second-highest scorer, with 43, including 31 wides."]}, {"page": "Bangladesh A cricket team in England in 2005", "response": ["A second-string Yorkshire pummeled the Bangladeshi bowlers, and despite the short timeframe - three days instead of the County Championship's four - they still got a win. With a run-rate of more than four an over they quickly made their way to 357 for 2 on the first day - Matthew Wood made an unbeaten 202, five short of his career highest score, and shared an opening partnership worth 272 with Joe Sayers. In reply, Tushar Imran made his second first-class century on tour, and the fifth of his career, with 116 in a little over three hours, and 19-year-old Nazimuddin made 60 as the tourists made their way to 325 - left-armer David Lucas taking five for 49. Yorkshire lost two wickets before stumps to be 48 for 2, but Michael Lumb made a century on the final day to ensure continued Yorkshire domination as they declared on 240 for 2, setting Bangladesh a target of 273 in three and a half hours. Lucas continued on his fine form from the first innings, taking three wickets, and no Bangladeshi passed 30 as they succumbed for 146 - Lucas took three for 35, fellow left-armer David Wainwright took three for 22 with his spin, and even part-time medium-pacer Richard Pyrah got one wicket in his two overs."]}, {"page": "Sayers (surname)", "response": ["* Joe Sayers (cricketer), English cricketer"]}, {"page": "Chris Taylor (cricketer, born 1981)", "response": ["Taylor was present at Yorkshire County Cricket Club for eight seasons, and, although his first-team playing time was limited, he saw plenty of action in the Second XI. Taylor broke through into the first team and made his debut in the County Championship winning season of 2001. His opportunities were limited, although he impressed in the first XI, most notably in 2004, but soon found himself back in the Second XI after he was replaced by Joe Sayers and Andrew Gale."]}, {"page": "Joe (given name)", "response": ["* Joe Sayers (cricketer) (born 1983), English cricketer"]}, {"page": "St Mary's Menston Catholic Voluntary Academy", "response": ["* Joe Sayers, professional cricketer"]}, {"page": "Yorkshire County Cricket Club in 2008", "response": [" Joe Sayers", "|align=\"left\"|  Joe Sayers"]}, {"page": "Joe Sayers", "response": ["Joe Sayers may refer to:", "*Joe Sayers (cricketer) (born 1983), English cricketer"]}]}}