{"wiki_id": "http://www.wikidata.org/entity/Q6219812", "itemLabel": "John Axon", "itemDescription": "British train driver, posthumous recipient of the George Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Axon", "wikipedia_page": {"main": "John Axon GC (4 December 1900 – 9 February 1957) was an English train driver from Stockport (Edgeley Depot) who died while trying to stop a runaway freight train on a 1 in 58 gradient at Chapel-en-le-Frith in Derbyshire after a brake failure. The train consisted of an ex-LMS Stanier Class 8F 2-8-0 No. 48188 hauling 33 wagons and a brake van.", "link_mentions": [{"page": "Stan Kelly-Bootle", "response": ["*Kelly performed the part of \"The Rambler\" in the BBC's 1958 production The Ballad of John Axon. This broadcast won the Italia Prize, and excerpts were subsequently released on a highlights LP. This was the first BBC radio ballad."]}, {"page": "1957", "response": ["** John Axon, English railwayman and hero, in rail accident (b. 1900)"]}, {"page": "Ewan MacColl", "response": ["MacColl had been a radio actor since 1933. By the late 1930s he was writing scripts as well. In 1957 producer Charles Parker asked MacColl to collaborate in the creation of a feature programme about the heroic death of train driver John Axon. Normal procedure would have been to use the recorded field interviews only as source for writing the script. MacColl produced a script that incorporated the actual voices and so created a new form that they called the radio ballad.", "* Ballad of John Axon (1958)"]}, {"page": "Radio ballad", "response": ["# The Ballad of John Axon (1958), about an engine driver who died trying to stop a runaway freight train", "A book about the making of the radio ballads was published on the fiftieth anniversary of the first broadcast of John Axon. Set into Song: Ewan MacColl, Charles Parker and the Radio Ballads was written and researched by Peter Cox, published by Labatie Books  and has an extensive website which carries the first two pages of each chapter, the complete transcripts and cast lists for each programme, bibliography, footnotes and reviews.", "* The Ballad of John Axon - 2 July 1958", "*Musical Traditions article on The Ballad of John Axon"]}, {"page": "British Rail Class 86", "response": ["|valign=\"top\" bgcolor=#eaecf0|Driver John Axon GC"]}, {"page": "LMS Stanier Class 8F", "response": ["*On 9 February 1957, locomotive No 48188 was hauling a freight train that ran away due to the failure of the steam brake pipe in the cab. It collided with a diesel multiple unit at  station, Derbyshire. Staff there had enough warning to be able to evacuate the train before the collision. Driver John Axon had remained with the freight and was killed. He was awarded a posthumous George Cross."]}, {"page": "Dove Holes railway station", "response": ["In 1957, the steep gradient north of here down towards Chapel-en-le-Frith was the scene of a serious accident, in which the driver of a runaway freight train, John Axon remained at his post and died when it ran into the back of a preceding train.Accident at Chapel-en-le Frith on 9 February 1957"]}, {"page": "Buxton line", "response": ["The LNWR had offered the use of the line but, with its climb through Dove Holes, the Midland did not consider it useful for express trains, saying that it went up a steep hill merely for the sake of going down. The LNWR may have saved costs in construction but it proved difficult to operate, even with the powerful locomotives they had been forced to introduce for their lines north of Manchester. In later days, a  stretch was operated using banking engines, the longest such section on the British railway system. In 1957 there was a serious accident at  in which driver John Axon, who died at his post attempting to control a runaway goods train, received the George Cross medal. From 8 October 1956,David Heys diesel multiple units - with photos services on the Buxton branch were in the hands of Class 104 diesel units based at Buxton depot, though some remained steam worked for longer (for example, the 08:20 train to Manchester switched to diesel on 17 June 1957).Railway Magazine September 1957 p. 627 – photo of 08:20 steam train on 13 June and 08:22 diesel on 17 June"]}]}}