{"wiki_id": "http://www.wikidata.org/entity/Q6218562", "itemLabel": "John Alexander Brodie", "itemDescription": "British civil engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Alexander_Brodie", "wikipedia_page": {"main": "John Alexander Brodie (1858 – 1934) was a British civil engineer. He was especially known for his contribution to town planning  in the English city of Liverpool, notably as one of the engineers who led the design of the  Mersey Tunnel under the River Mersey.", "link_mentions": [{"page": "Liverpool", "response": ["In 1889, borough engineer John Alexander Brodie invented the football goal net. He also was a pioneer in the use of pre-fabricated housing and oversaw the construction of the UK's first ring road (A5058) and intercity highway (East Lancashire Road), as well as the Queensway Tunnel linking Liverpool and Birkenhead. Described as \"the eighth wonder of the world\" at the time of its construction, it was the longest underwater tunnel in the world for 24 years."]}, {"page": "Median strip", "response": ["City planners also commonly use media strips to accommodate urban tram tracks along a central segregated track, and examples of this layout are found across Europe. Some of the earliest practices of incorporating central tramways into road designs were pioneered in Liverpool by John Alexander Brodie, and later emulated in Manchester, such as along Princess Parkway or Kingsway."]}, {"page": "List of people from Merseyside", "response": ["* John Alexander Brodie: English civil engineer. "]}, {"page": "Brodie", "response": ["* John Alexander Brodie (1858–1934), British civil engineer"]}, {"page": "Timeline of association football", "response": ["The penalty kick is introduced. Liverpool engineer John Alexander Brodie invents the football netBritish Council history of football  "]}, {"page": "Precast concrete", "response": ["In the modern world, precast panelled buildings were pioneered in Liverpool, England, in 1905. The process was invented by city engineer John Alexander Brodie, a creative genius who also invented the idea of the football goal net. The tram stables at Walton in Liverpool followed in 1906. The idea was not taken up extensively in Britain. However, it was adopted all over the world, particularly in Central and Eastern Europe as well as in Scandinavia."]}, {"page": "Prefabricated building", "response": ["The world's first prefabricated, pre-cast panelled apartment blocks were pioneered in Liverpool. A process was invented by city engineer John Alexander Brodie, whose inventive genius also had him inventing the football goal net. The tram stables at Walton in Liverpool followed in 1906. The idea was not extensively adopted in Britain, however was widely adopted elsewhere, particularly in Eastern Europe."]}, {"page": "A5103 road", "response": ["Princess Road/Princess Parkway was one of two new arterial roads into Manchester built by Manchester Corporation; the other was Kingsway, a few miles to the east, also built as a dual carriageway with reserved tram tracks along the middle. This layout was known as the 'Brodie' system, a new approach to road design that had been pioneered in Liverpool by John Alexander Brodie. The first tracks were laid out in the 1920s, terminating at Southern Cemetery; Manchester Corporation Transport planned to extend the tracks to Northenden and Wythenshawe, but following a change in transport policy in 1930, the Corporation invested in bus services instead. Manchester Corporation Tramways eventually ceased operation in 1949 and the tram tracks were removed."]}, {"page": "List of ring roads", "response": ["* Liverpool, Queens Drive, the UK's first ring road, conceived as early as 1860 by James Newlands; construction began in 1903 under his successor John Alexander Brodie"]}, {"page": "A5058 road", "response": ["Often described as the first ring road in Britain, planning had been in discussion since the 19th century, with a circular boulevard plan proposed in 1853 although ultimately it did not materialise. Construction of the road began in the early 20th century and was designed by civil engineer John Alexander Brodie. Initially conceived with tram tracks running along the centre of the road, it was ultimately decided that a dual-carriageway formation was necessary in order to handle the anticipated increased traffic volumes."]}, {"page": "Alexander Brodie", "response": ["* John Alexander Brodie (1858–1934), civil engineer and town planner"]}, {"page": "John Brodie (disambiguation)", "response": ["*John Alexander Brodie (1858–1934), British civil engineer"]}, {"page": "Architecture of Liverpool", "response": ["The docks saw the increase in traffic in goods from 12.4 million tons in 1900 to over 19 million tons by 1914.Ritchie Noakes (1980), p13 This era would see under the supervision of the borough engineer John Alexander Brodie the start of the construction Queens Drive, of what is now the A5058 road, the first Ring road in Britain, the first section was started in Walton in 1904 and completed in 1909.", "Innovation in transport in the era included the Liverpool–East Lancashire Road, designed by John Alexander Brodie opened in 1934 it was the first purpose-built intercity highway in the UK. Another area of innovation was Speke Airport, it is in the south of the city, the art deco former terminal building, designed by Edward Bloomfield, who also designed the hangar 1, then at 212 feet wide by 400 feet long the world's largest.Pevsner & Pollard (2006), pp457-458 The terminal in use from the 1930s to 1986, has been adapted for use as a hotel and is now the Crowne Plaza Liverpool John Lennon Airport. Speke was the first provincial airport in the UK, opened in 1933, and its restored terminal has been described as \"still the most coherent example of the first generation of purpose-built airports remaining in Europe.\" The terraces from which fans welcomed home the Beatles have been preserved. Another innovation in transport was the road tunnel under the River Mersey known as the Queensway Tunnel, built (1925–34).Sharples (2004), p161 Gladstone Dock was opened 1927.", "* John Alexander Brodie (1858–1934) Borough Engineer (1898–1934), started the ring road; Liverpool–East Lancashire Road; Queensway Tunnel"]}, {"page": "Kingsway (A34)", "response": ["Kingsway was built as a relief road for the congested Wilmslow Road to the west and it was one of the earliest purpose-built roads especially for motor vehicles. Like Princess Road further to the west, Kingsway was designed as a dual carriageway along the \"Brodie System\", a new civil engineering technique that had been pioneered by John Alexander Brodie in Liverpool, in which the central reservation incorporated reserved track for trams. "]}, {"page": "James Newlands", "response": ["Newlands was an early proponent for a ring-road serving Liverpool (not realised for another 50 years, when Queens Drive was constructed by his successor as borough engineer, John Alexander Brodie). In addition to his sewerage projects, he also worked extensively on Liverpool's highways, designed the Cornwallis Street and Margaret Street Baths, and improved the city's lighting."]}]}}