{"wiki_id": "http://www.wikidata.org/entity/Q62123111", "itemLabel": "William Jay", "itemDescription": "English architect", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Jay_(architect)", "wikipedia_page": {"main": "William Jay (16 November 1792 – 17 April 1837) was an architect. He continued his father's and grandfather's interest in stonemasonry and building design.Jay was born in Bath. His father was also William Jay, who had started working with his father as a stonemason, but became a Congregationalist minister. In 1807 the younger William became an apprentice of the architect and surveyor David Riddall Roper.\nJay's designs for Surrey Chapel Almshouses were exhibited at the Royal Academy in 1814. He designed Dr. Fletcher's Albion Chapel in London, laying the foundation stone the following year. In 1817 he moved to the United States for four years, where he established as an architect in Savannah, Georgia. His American work includes the Owens-Thomas House, the William Scarbrough House, Telfair Academy, and The Savannah Theatre. The  design of the Bulloch–Habersham House, which he designed, would later be replicated with the Habersham Memorial Hall.\nWhen the economy of Georgia collapsed in 1822, Jay returned to England and worked primarily in Cheltenham. Later, he went bankrupt and in 1836 moved with his family to the island of Mauritius, where he was an architect and civil engineer until his death in Port Louis.", "link_mentions": [{"page": "William Jay (minister)", "response": ["thumb|Portrait and signature of William Jay, about 1810", "The Rev. William Jay (6 May 176927 December 1853) was an English nonconformist divine who preached for sixty years at Argyle Chapel in Bath. He was an eminent English Congregationalist minister of Regency England.", "William Jay was born at Tisbury in Wiltshire. He adopted his father's trade of stonemason and worked with him on alterations to Fonthill House, but gave it up in 1785 in order to enter the Rev. Cornelius Winter's school at Marlborough. During the three years that Jay spent there, his preaching powers were rapidly developed. Before he was twenty-one he had preached nearly a thousand times, and in 1788 he had for a while occupied Rowland Hill's pulpit at the Surrey Chapel in London. Wishing to have time for self-education or scholarly interests, he accepted the humble pastorate of Christian Malford near Chippenham where he remained about two years. This was followed by one year at the more demanding Hope Chapel, Clifton.", "William Jay's long connection with Argyle Chapel came to an end in January 1853. He died on 27 December following in Bath.", "One of William Jay's sons, also William Jay (1792/3-1837), became an architect, continuing the family's interest in stonemasonry and building design.William Jay (c. 1792–1837), The New Georgia Encyclopaedia, published November 1, 2004. Retrieved 26 January 2012.Bradbury, Oliver C. William Jay's English Works after 1822: Recent Discoveries, Architectural History: Journal of the Society of Architectural Historians of Great Britain, Volume 43, 2000 (archived on JTOR.org). Retrieved 26 January 2012.", "William Jay's eldest daughter, Anne, married Robert Bolton and, among their thirteen children was William Jay Bolton, who became an early artisan of stained glass in America.", "* Jay, William (1854; reprinted 1974) The Autobiography of William Jay (repro. ed. : Edinburgh, Banner of Truth, 1974)", "*Wilson, S. (1854) The Rev. William Jay: a memoir by the Rev. S. S. Wilson. London: Binns & Goodwin 1854", "*Silvester, James (1900) Two Famous Preachers of Bath: brief biographies of William Jay and William Connor Magee. London: C. J. Thynne", "*Sherman, James (1854) Ministerial Qualifications and Success:a  sermon preached at Argyle Chapel, Bath, on Sunday evening, January 6, 1854, on the decease of the Rev. William Jay. London: Ward & Co", "* Life of William Jay, a dissertation", "* Works of William Jay in PDF format (lacking one volume of the 12 plus six volumes of sermons taken in shorthand and a Jubilee memorial)"]}, {"page": "Sorrel–Weed House", "response": ["The National Trust Guide to Historic Places makes architectural comparisons between the Sorrel–Weed House, Thomas Jefferson's Monticello, and William Jay's Owens-Thomas House in Savannah. Although clearly a Greek Revival house, English Regency influences are prominent.", "The stairway built for the Sorrel family mimics the Regency Owens-Thomas House stairway, designed earlier in 1816 by Regency architect William Jay in Savannah. This is a center stairway ascending to a mid-floor stoop, from which one can walk to the left or right to ascend to the second floor.", "A common device used by both William Jay and Charles Cluskey in Savannah architecture was the division of space in a foyer by two columns, intended to differentiate between guest space and private family space. Cluskey's use of this device was more indirect than William Jay's use in the Owens-Thomas House. Cluskey designed a small space between the front door and the two columns where guests would wait to be greeted, after which they could enter the double foyer, library and the main length of the foyer. The Owens-Thomas House has these columns much closer to the stairway leading to the second floor, where public and private spaces were more clearly separated.VAF 2007 p.166"]}, {"page": "Telfair Museums", "response": ["The museum currently contains a collection of over 4,500 American and European paintings, sculptures, and works on paper, housed in three buildings: the 1818 Telfair Academy (formerly the Telfair family home); the 1816 Owens-Thomas House & Slave Quarters, which are both National Historic Landmarks designed by British architect William Jay in the early nineteenth century; and the contemporary Jepson Center for the Arts, designed by Moshe Safdie and completed in 2006."]}, {"page": "Owens–Thomas House", "response": ["This most important and architecturally significant house was begun in 1816 and completed in 1819. Designed by the English architect William Jay of Bath, the house plans were drawn while Jay was still in England. He sent architectural elevations to local workers before his arrival in Savannah sometime after foundations were laid. According to Jay's letters, the house was to be aesthetically compatible to Bath, England. This is evident in the Bath stone of the house's construction as well as its sophisticated architectural detail. It was a gentrifying physical ornament to the newly successful Southern port. The Richardson House, as it was originally known after its first owner and builder, Richard Richardson,Building Data Sheet, Historic Savannah Inventory, Anson Ward, card number 19 is North America's preeminent example of period English Regency architecture.", "The mansion was purchased in 1830 by local attorney and politician George Welshman Owens for $10,000. The family maintained it for several decades until Owens' granddaughter, Margaret Thomas, bequeathed the house to the Telfair Academy of Arts and Sciences (established in 1885) as the South's oldest art museum, in 1951. The house is notable for its early cast iron side veranda with elaborate acanthus scroll supports on which the Marquis de Lafayette addressed the citizens of Savannah on his visit in 1825. William Jay was architect to other Savannah landmarks such as the Scarborough house, the Telfair House as mentioned above, and an attribution to the Gordon-Low House."]}, {"page": "List of British architects", "response": ["*William Jay (1792–1837) (USA)William Jay (c. 1792–1837), The New Georgia Encyclopaedia, published 1 November 2004. Retrieved 26 January 2012.Bradbury, Oliver C. William Jay's English Works after 1822: Recent Discoveries, Architectural History: Journal of the Society of Architectural Historians of Great Britain, Volume 43, 2000 (archived on JTOR.org). Retrieved 26 January 2012."]}, {"page": "William Scarbrough House", "response": ["William Scarbrough House is a historic house in Savannah, Georgia.  Built in 1819, and subjected to a number later alterations, it is nationally significant as an early example of Greek Revival architecture, and is one of the few surviving American works of architect William Jay.  The house was declared a National Historic Landmark in 1973. and    It is now home to the Ships of the Sea Maritime Museum, and it has largely been restored to an early 19th-century appearance.", "The house was built in 1819 for William Scarbrough, a prominent and successful Savannah merchant and shipowner.  It was designed by William Jay, an Englishman who settled in Savannah in 1817, and is credited with a number of high-profile designs in the city, of which this is one of three that survive.  The house underwent a number of alterations, including the addition (and later removal during restoration) of a third floor, and was from 1873 to 1962 owned by the city, which housed the West Broad Street Colored School here.  The house was then acquired by the Historic Savannah Foundation, which modernized its systems and undertook some restorative steps.  The house was turned over to the Telfair Museums in 1990, and in the early 1990s it underwent further rehabilitation and adaptation for use as a museum.  In 1994 it was turned over to the Ships of the Sea Maritime Museum."]}, {"page": "Telfair Academy", "response": ["The Telfair Academy  is a historic mansion at 121 Barnard Street in Savannah, Georgia.  It was designed by William Jay and built in 1818, and is one of a small number of Jay's surviving works. It is one of three sites owned by Telfair Museums. Originally a family townhouse belonging to the Telfair family, it became a free art museum in 1886, and thus one of the first 10 art museums in America, and the oldest public art museum in the South.  Its first director, elected in 1883, was artist Carl Ludwig Brandt, who spent winters in Savannah.   It was declared a National Historic Landmark in 1976. and  ", "Telfair Academy is located in historic central Savannah, on the west side of Telfair Square.  It occupies an entire block, bounded by Barnard, West President, North Jefferson, and West State Streets.  It is a two-story masonry structure, built out of brick finished in stucco. Its entrance is a form typical of architect William Jay, with a projecting four-column portico that is accessed via side-facing stairs.  The columns are of a composite order, and the portico's entablature is continued around the building as a stringcourse.  Unlike the symmetrical exterior, the interior of the house is asymmetrical, its unusually shaped rooms including an octagonal drawing room, round-ended dining room, and long drawing room with rounded ends.  The building's west wing is its former carriage house, which was adapted in the 1880s as part of the building's conversion to a museum, and has fine Adam style woodwork.", "The house was designed by William Jay and built in 1818 for Alexander Telfair, son of Edward Telfair, one of Georgia's early post-independence governors.  The site on which it was built previously housed the official residence of Georgia's colonial royal governors.  In 1875 Alexander's sister, Mary, bequeathed the house, including its furnishings and family collections, to the Georgia Historical Society, which opened the first art museum in the southeastern United States here in 1886.  The house was remodeled and expanded to be a museum by architect Detlef Lienau."]}, {"page": "William Jay", "response": ["William Jay may refer to:", "*William Jay (minister) (1769–1853), English nonconformist reverend", "*William Jay (architect) (1792–1837), English architect who also worked in America, son of the minister", "*William Jay (jurist) (1789–1858), American reformer, jurist, and the son of Founding Father and first U.S. Supreme Court Chief Justice John Jay (1745–1829)", "*William Jay (Colonel) (died 1915), colonel in the US Army and vice president of the New York Herald"]}, {"page": "The Savannah Theatre", "response": ["The Savannah Theatre opened its doors at 5:30pm on December 4, 1818 with a performance of \"The Soldier's Daughter\". The original structure was designed by British architect William Jay, whose other notable works include the Telfair Mansion and the Owens-Thomas House, both located in Savannah. During the 1850s and 1860s, it was sometimes known as the Athenaeum. On March 21, 1861, Alexander H. Stephens delivered the Cornerstone Speech at the theatre."]}, {"page": "Albion Chapel", "response": ["Albion Chapel was a Scottish Presbyterian chapel in the City of London, near Finsbury Circus, on the corner of London Wall and Finsbury Pavement. It was established by Reverend Alexander Fletcher on the site of the old Bethlem Royal Hospital in 1815 and demolished in 1879. It was designed by the noted architect William Jay (1792/3-1837), who later became a leading architect in the United States.", "The first stone of the construction for the Albion Chapel was laid on 7 November 1815 by Reverend Alexander Fletcher, the Minister of a Church of Scotland assembly near Oxford Street. The stone contained several objects inside, including a bible, some coins and a copy each of The Westminster Confession of Faith and The Assembly's Shorter Catechism. The location that the Chapel was being built on was formerly the west wing of Bethlem Royal Hospital. The building was the first commission of architect William Jay.Bradbury, Oliver C. William Jay's English Works after 1822: Recent Discoveries, Architectural History: Journal of the Society of Architectural Historians of Great Britain, Volume 43, 2000 (archived on JTOR.org). Retrieved 26 January 2012."]}, {"page": "Buildings in Savannah Historic District", "response": ["|By William Jay, on the NRHP", "|By William Jay; enlarged and altered in the 1880s to become the Telfair Academy", "|By William Jay, on the NRHP", "|By William Jay (original structure)"]}, {"page": "List of Art Deco architecture in the United States", "response": ["* The Savannah Theatre, Savannah, William Jay, 1818 (Art Deco transformation 1948)"]}, {"page": "Habersham Memorial Hall", "response": ["On February 12, 1900, the Joseph Habersham Chapter of the National Society Daughters of the American Revolution was organized at the Georgia Governor's Mansion, with the wife of Georgia Governor Allen D. Candler serving as one of its founders. The chapter, based in Atlanta, was named in honor of Joseph Habersham, a politician from Georgia who had been a soldier in the Continental Army during the American Revolutionary War and served as the United States Postmaster General, among other government positions. On January 14, 1922, the cornerstone for a new headquarters for the chapter was laid, with the building's construction completed the following year. According to the chapter, the building was erected \"as a memorial to the Heroes of all Wars in which Georgia has participated.\" Henry Hornbostel served as the architect for the building, which was designed as a replica of the Bulloch–Habersham House in Savannah, Georgia. Designed by William Jay in 1819, that house had been demolished in 1916. In April 1923, the hall hosted the 25th annual state conference of the Georgia Daughters of the American Revolution."]}, {"page": "21 West Bay Street", "response": ["In 1984, the significance of the building was recognized by the Historical American Buildings Survey. That same year, architectural students of the Savannah College of Art and Design determined that William Jay was the building's architect.", "The hotel was constructed by Eleazer Early of Charleston, South Carolina, to a design by William Jay,Malcolm Bell, Jr., \"Ease and Elegance, Madeira and Murder: The Social Life of Savannah's City Hotel,\" The Georgia Historical Quarterly, vol. 76, no. 3 (Fall 1992), p. 552.  and completed in 1821 as the City Hotel.  It was built on land purchased by his wife, Jane, four years earlier and was the first hotel in Savannah. It had \"33 rooms, exclusive of the bar.\"Classical Savannah: Fine & Decorative Arts, 1800–1840, Page Talbott (1995), p. 76 In January 1820, during the building's construction, it was damaged by the fire that swept through Savannah. It was at that point that Jane Early transferred the property into her husband's name.", "The hotel housed, as lessees, the first branch of the United States Post Office in the city, as well as a branch of the Second Bank of the United States, of which Eleazer Early was the first cashier. (William Jay is also responsible for the first branch of the bank in the city, which was located on East St Julian Street and built around the same time as the City Hotel. It was demolished in 1924.)WILLIAM JAY: HIS LIFE & ARCHITECTURE - GoSouthSavannah.com Jay's work can especially be seen in the building's interior, including marble mantels, fine woodwork, curved doors and doorways (like those he designed in the city's Richardson House), and a grand staircase \"entrapped within the building's curved walls.\""]}, {"page": "Telfair Square (Savannah, Georgia)", "response": ["*Telfair Academy, 121 Barnard Street (1820) – by William Jay; part of Telfair Museums (enlarged and altered in the 1880s); oldest building on the square"]}, {"page": "Mary Telfair", "response": ["As the last of the Telfair family, she shared her wealth with the City of Savannah. Her will stated that funds be used to complete W. B. Hodgson Hall (built in 1876 and named for her brother-in-law, who died five years previously) for the Georgia Historical Society to use as their home. She also endowed the Savannah Widow's Society and founded the Mary Telfair Hospital for Women (now part of Candler Hospital).Mary Telfair Women's Hospital – St. Joseph's Candler.org Her most well-known legacy, however, is the Telfair Academy (located in her former home, designed by noted architect William Jay), which opened to the public in 1886."]}]}}