{"wiki_id": "http://www.wikidata.org/entity/Q6210500", "itemLabel": "Joe Jackson", "itemDescription": "British barrister and police officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Jackson_(police_officer)", "wikipedia_page": {"main": "Sir Richard Leofric Jackson CBE (12 July 1902 – 17 February 1975), known as Joe Jackson, was a British barrister and police officer in the London Metropolitan Police.\nJackson was born in India, the third son of William Jackson, leader of the Calcutta Bar. His mother was the daughter of Sir Thomas Turton, former Advocate-General of Bengal. He was educated at Cheam School and Eton College, where he acquired the nickname \"Joe\" after a sports writer watching him box in the final of the Public Schools Boxing Championship compared him to heavyweight champion Joe Beckett. He then went on to Trinity College, Cambridge, where he gained a half blue for boxing.\nHe was called to the bar by the Middle Temple in 1927 and set up a criminal practice. In 1933, however, he joined the Department of the Director of Public Prosecutions as a Professional Legal Clerk. In 1946 he was appointed secretary of the Metropolitan Police Office, ranking with the Assistant Commissioners (although a civilian). In 1949 he spent three months in Malaya as a member of the Police Mission to advise the government on problems stemming from the Malayan Emergency.\nIn August 1953 he was appointed Assistant Commissioner \"C\", in charge of the Criminal Investigation Department. He was also British representative to Interpol from 1957, becoming a member of the executive committee in 1958, and president from 1960 to 1963. He was appointed Commander of the Order of the British Empire (CBE) in the 1958 Birthday Honours. In 1962 he edited the fifth English edition of Criminal Investigation, by Hans Gross.\nHe was knighted in the 1963 Birthday Honours, shortly before his retirement, following which he became a director and joint vice-chairman of Securicor. He also wrote his memoirs Occupied with Crime, which were published in 1967.", "link_mentions": [{"page": "Christopher Lee", "response": ["Lee was engaged for a time in the late-1950s to Henriette von Rosen, whom he had met at a nightclub in Stockholm. Her father, Count Fritz von Rosen, proved demanding, getting them to delay the wedding for a year, asking his London-based friends to interview Lee, hiring private detectives to investigate him, and asking Lee to provide him with references, which Lee obtained from Douglas Fairbanks Jr., John Boulting, and Joe Jackson. Lee found the meeting of her extended family to be like something from a surrealist Luis Buñuel film, and thought they were \"killing me with cream.\" Finally, Lee had to have the permission of the King of Sweden to marry. Lee had met him some years before while filming Tales of Hans Anderson, where he received his blessing. However, shortly before the wedding, Lee ended the engagement. He was concerned that his financial insecurity in his chosen profession meant that she \"deserved better\" than being \"pitched into the dishevelled world of an actor.\" She understood, and they called the wedding off."]}, {"page": "Joe Jackson", "response": ["* Joe Jackson Sr. (1873–1942), Austrian clown", "* Joe Jackson (manager) (1928–2018), father and manager of Michael Jackson and The Jacksons", "* Joe Jackson (musician) (born 1954), British singer-songwriter", "*Shoeless Joe Jackson (1887–1951), American baseball player in Black Sox Scandal", "*Joe Jackson (linebacker, born 1953), American football player", "*Joe Jackson (linebacker, born 1962), American football player", "*Joe Jackson (linebacker, born 1976), American football player", "*Joe Jackson (offensive lineman) (born 1979), American football player", "*Joe Jackson (defensive end, born 1996), American football player", "*Joe Jackson (basketball) (born 1992), American basketball player", "*Joe Jackson (footballer) (born 1993), English footballer", "* Joe Jackson (police officer) (1902–1975), Assistant Commissioner of the London Metropolitan Police, 1953–1963", "* Joe Jackson (writer), winner of the 2017 PEN/Jacqueline Bograd Weld Award for Biography"]}, {"page": "Assistant Commissioner of Police of the Metropolis", "response": ["*Sir Joe Jackson, 1953–1963"]}, {"page": "Richard Jackson (police officer)", "response": ["#REDIRECT Joe Jackson (police officer)"]}, {"page": "Richard Leofric Jackson", "response": ["#REDIRECT Joe Jackson (police officer)"]}]}}