{"wiki_id": "http://www.wikidata.org/entity/Q6211956", "itemLabel": "Joe Reader", "itemDescription": "English football goalkeeper (1866-1954)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Reader", "wikipedia_page": {"main": "Josiah \"Joe\" Reader (27 February 1866 – 8 March 1954) was an English footballer who played as a goalkeeper. He spent his entire professional career with West Bromwich Albion and served the club as a player, coach and steward for a total of 65 years. He made one appearance for England in a 2–2 draw against Ireland on 3 March 1894.", "link_mentions": [{"page": "1893–94 in English football", "response": ["Joe Reader (West Bromwich Albion) made his solitary England appearance in goal, whilst Henry Chippendale (Blackburn Rovers) earned his single cap at outside right, with his club team-mate Jimmy Whitehead earning his second, and last, cap alongside him. The other débutante was Jimmy Crabtree of Burnley at full-back, who went on to play a total of 14 games for England over the next 8 years. The remainder of the team were experienced internationals, including three members of Aston Villa's championship winning team (Jack Reynolds, John Devey and Dennis Hodgetts) and were expected to secure a comfortable victory."]}, {"page": "1892 FA Cup Final", "response": ["The 1892 FA Cup Final was contested by West Bromwich Albion and Aston Villa at the Kennington Oval.  This was the last FA Cup Final to be played at Kennington Oval due to the Surrey Cricket authorities becoming increasingly alarmed at the large crowds now being attracted to the main game in the footballing calendar.  Albions form throughout the league season had been erratic and Villa supporters felt that all they had to do was turn up and the cup was theirs for the taking.Taken from 'West Bromwich Albion: A Complete Record by Tony Matthews (1993)  West Bromwich Albion won 3–0, with goals by Alfred Geddes, Sammy Nicholls and Jack Reynolds.  Villa began brightly on a warm, sunny day which helped swell the attendance to almost 33,000, but Albion had an early surprise in store and after just 4 minutes took the lead.  Villa fought back hard but they found the Albion keeper Joe Reader in tremendous form.  Albion then made it 2-0 on the 27 minute mark and 10 minutes into the 2nd half, Villa's last hopes disappeared when Albion went 3 up.  Albion defended resolutely to see out the game with a clean-sheet and return with the cup to their Stoney Lane home.West Bromwich Albion: A Complete Record by Tony Matthews (1993) This was the first FA Cup Final in which goal-nets were used.", "|GK || 1 ||Joe Reader"]}, {"page": "1895 FA Cup Final", "response": ["Aston Villa and West Bromwich Albion became the first pair of clubs to meet in the FA Cup Final for a third time: the teams had previously met in the 1887 final, won by Villa, and the 1892 final, won by Albion. The final was played for the first time at Crystal Palace, which was to host the finals for the next twenty years. The weather for the final was described as \"a beautiful spring day\", and consequently the crowd and press were still coming into the ground when the game kicked off. From the kick-off, John Devey, the Villa centre-forward, swung the ball out to his inside-left, Dennis Hodgetts. Hodgetts' long cross-pass found Charlie Athersmith on the right, and his centre fell to Bob Chatt who sent the ball goalwards on a half volley. Albion's keeper Joe Reader was only able to get his fingers to the shot, and turned the ball across the goal mouth and, after a goalmouth scramble involving Devey and Albion defender Jack Horton, the ball was turned in to the net. There are no accurate timings for the goal and different reports time it at between 30 and 39 seconds. At the time, many of the crowd and press missed the goal as they were still taking their seats, and the press reports indicated that Chatt had scored. According to Ward & Griffin in their \"Essential History of Aston Villa\" however, \"after the game, the Villa players confirmed that John Devey had netted after Chatt's shot had been blocked straight into the latter's path and had ricocheted off his knee.\" Despite this claim, The Football Association still credit the goal to Chatt as having been scored on thirty seconds. The fastest accurately timed goal was Louis Saha's effort for Everton after 25 seconds in the 2009 final.", "|GK || ||Joe Reader"]}, {"page": "Billy Williams (footballer, born 1876)", "response": ["His potential was seen immediately and he went straight into the first team. Although Albion had a difficult league season, narrowly avoiding the end of season \"Test match\" play-offs by a win on the final day of the season, they had more success in the FA Cup. In the semi-final against Sunderland, Williams scored from the penalty spot following a foul on Billy Bassett, thus helping Albion secure their fifth FA Cup Final appearance. In the final itself, played at Crystal Palace against local rivals Aston Villa, Villa took a first-minute lead when Bob Chatt's shot was half saved by goalkeeper Joe Reader and John Devey bundled the ball over the line. This was the fastest goal in FA Cup history, scored after just 30 seconds."]}, {"page": "Bob Chatt", "response": ["The final on 20 April 1895 was played for the first time at Crystal Palace, which was to host the finals for the next twenty years. The weather for the final was described as \"a beautiful spring day\", and consequently the crowd and press were still coming into the ground when the game kicked off. From the kick-off, John Devey, the Villa centre-forward, swung the ball out to his inside-left, Dennis Hodgetts. Hodgetts' long cross-pass found Charlie Athersmith on the right, and his centre fell to Chatt who sent the ball goalwards on a half volley. Albion's keeper Joe Reader was only able to get his fingers to the shot, and turned the ball across the goal mouth and, after a goalmouth scramble involving Devey and Albion defender Jack Horton, the ball was turned into the net. There are no accurate timings for the goal and different reports time it at between 30 and 39 seconds. At the time, many of the crowd and press missed the goal as they were still taking their seats, and the press reports indicated that Chatt had scored. According to Ward & Griffin in their \"Essential History of Aston Villa\" however, \"after the game, the Villa players confirmed that John Devey had netted after Chatt's shot had been blocked straight into the latter's path and had ricocheted off his knee.\" Despite this claim, The Football Association still credit the goal to Chatt as having been scored on thirty seconds. Chatt's record stood for 114 years until beaten by Louis Saha's effort for Everton after 25 seconds in 2009.", "Despite pressure from the Albion forwards, especially from Billy Bassett, Villa were able to hold on to their lead until half-time. In the second half, Villa began to press forward again with Chatt and Devey forcing excellent saves from Joe Reader. Neither side was able to add to the score and Villa won the cup for the second time."]}, {"page": "Bob Roberts (footballer, born 1859)", "response": ["In May 1890 Roberts moved on a free transfer to Sunderland Albion; their offer of 50 shillings per game was one that West Bromwich were unable to match. He failed to settle in the North East, enduring homesickness as well as his wife's illness. On the pitch however, he helped Sunderland Albion finish as runners-up in the Football Alliance and was ever-present in the league. He returned to West Bromwich Albion on another free transfer in May 1891, and was initially given his place back, at the expense of Joe Reader. By this time however, Roberts' wife was seriously ill and she died in October 1891. Goalkeeping duties were alternated, and as Roberts' form declined further, Reader won his place back permanently. Roberts thus played no part in Albion's 1892 FA Cup Final win over Aston Villa, and left Albion to join Villa at the end of the season, again for no transfer fee. Villa director William McGregor said that Roberts was \"Unquestionably the finest goalkeeper of his time\". After playing in just four games for Villa, Roberts retired from playing football in June 1893. He moved back to the North East, where he settled for the remainder of his life, working as a plasterer, and died in Byker on 20 October 1929."]}, {"page": "Josiah Reader", "response": ["#REDIRECT Joe Reader"]}, {"page": "Sandy Lang", "response": ["Alexander Lang (1864 – 8 November 1901) was a Scottish professional footballer who played as a full back. He came to Burnley from Padiham in 1885 and was one of the club's regular full-backs, operating on the left or right side, as well as being the club captain, when Football League came to Turf Moor in 1888. He was born at Bridge of Weir, near Paisley, in 1864 and came south of the border to join Padiham as a 20-year-old in 1884. He brought with him a reputation as a versatile player but it was as a hard-tackling defender that he made his name. He missed only eight League games in the first seasons of League football and was the first Burnley player to complete 100 games for the club, in March 1893. The only two goals of his League career came in the previous season and the second was the club's first–ever from a penalty–kick, in a 3–2 win against West Bromwich Albion on 28 November 1891. The keeper Lang beat that day was Joe Reader, later to play for England. He played his last League game in March 1895 and became a publican in Burnley, although he later resumed his playing career, assisting Nelson to the Lancashire League Championship. He sustained fatal injuries in an accident at his home and died on 9 November 1901, aged 37."]}]}}