{"wiki_id": "http://www.wikidata.org/entity/Q6219174", "itemLabel": "John Anstruther-Gough-Calthorpe", "itemDescription": "English businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Anstruther-Gough-Calthorpe", "wikipedia_page": {"main": "John Austen Anstruther-Gough-Calthorpe (born 14 July 1947) is a property developer and former Chairman of the Watermark Group, son of Sir Richard Anstruther-Gough-Calthorpe, 2nd Baronet, and Nancy Moireach Malcolmson.", "link_mentions": [{"page": "Neill Cooper-Key", "response": ["On 11 January 1941 he married Hon. Lorna Peggy Vyvyan Harmsworth (24 October 1920 – 18 June 2014), elder daughter of the 2nd Viscount Rothermere. They had two sons and two daughters; the second – but only surviving – son, (Kevin) Esmond Peter (1943–1985), married Lady Mary-Gaye Georgiana Lorna Curzon, third daughter of the 6th Earl Howe, whose daughter by her second husband, property magnate and scion of baronets John Anstruther-Gough-Calthorpe, is the actress Isabella Calthorpe."]}, {"page": "Isabella Calthorpe", "response": ["Calthorpe was born on 3 March 1980 in Royal Hampshire County Hospital in Winchester.The Times 1980 March 5, p. 30 She is the daughter of John Anstruther-Gough-Calthorpe and Lady Mary-Gaye Georgiana Lorna Curzon. Her paternal grandfather is Sir Richard Anstruther-Gough-Calthorpe, 2nd Baronet and her maternal grandfather is Edward Curzon, 6th Earl Howe. She was named Isabella Amaryllis Charlotte and came to be known by intimates as Bellie.Telegraph. \"What it's like when Richard Branson is your dad: 'Sometimes we wish dad would let us lie on the sofa.'\" 2016 March 27. Peter Stanford. Retrieved 29 May 2017."]}, {"page": "Dai Llewellyn", "response": ["Often dressed like a latter-day Master of Fox Hounds, he frequented London's clubs quaffing magnums of champagne earning him the soubriquet \"Conquistador of the Canape Circuit\".  He once told an old friend journalist Peter McKay over lunch that he had left his \"secretary tied up in the bath.\" The couple divorced after seven years in 1987, and Vanessa then married John Anstruther-Gough-Calthorpe; one of her children from this marriage is the actress Gabriella Wilde. In 1999, Llewellyn inherited the Llewellyn baronetcy upon the death of his father, along with a home in Aberbeeg, near Abertillery."]}, {"page": "Gabriella Wilde", "response": ["Wilde was born in Basingstoke, Hampshire, England. She is descended from the aristocratic Gough-Calthorpe family. Her father, businessman John Anstruther-Gough-Calthorpe, is a former chairman of the Watermark Group, and the grandson of Sir Fitzroy Anstruther-Gough-Calthorpe, 1st Baronet. Her mother, Vanessa Mary Theresa (née Hubbard), is the former wife of socialite Sir Dai Llewellyn, 4th Baronet. Vanessa is a former model who sat for David Bailey and John Swannell."]}, {"page": "John Austen Anstruther-Gough-Calthorpe", "response": ["#REDIRECT John Anstruther-Gough-Calthorpe"]}, {"page": "Anstruther-Gough-Calthorpe, John", "response": ["#redirectJohn Anstruther-Gough-Calthorpe"]}]}}