{"wiki_id": "http://www.wikidata.org/entity/Q6218766", "itemLabel": "John Allen Giles", "itemDescription": "historian", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Allen_Giles", "wikipedia_page": {"main": "John Allen Giles (1808–1884) was an English historian. He was primarily known as a scholar of Anglo-Saxon language and history. He revised Stevens' translation of the Anglo-Saxon Chronicle and Bede's Ecclesiastical History of the English People. He was a fellow at Corpus Christi College, Oxford.", "link_mentions": [{"page": "Peterborough", "response": ["Hereward the Wake rampaged through the town in 1069 or 1070. Outraged, Abbot Turold erected a fort or castle, which, from his name, was called Mont Turold: this mound, or hill, is on the outside of the deanery garden, now called Tout Hill, although in 1848 Tot-hill or Toot Hill. Scheduled Ancient Monument The abbey church was rebuilt and greatly enlarged in the 12th century.Tim Tatton-Brown and John Crook, The English Cathedral, New Holland (2002)  The Peterborough Chronicle, a version of the Anglo-Saxon one, contains unique information about the history of England after the Norman conquest, written here by monks in the 12th century.Bodleian, MS. Laud 636 (E), see Ingram, James Henry (trans.) The Anglo-Saxon Chronicle J. M. Dent & Sons, London, 1823 (facsimile of the 1847 Everyman's Library ed. with additional readings from the translation of John Allen Giles  from Project Gutenberg. Retrieved 19 September 2007). . A modern edition, comparing the Peterborough version with such others as survive, is in Garmonsway, George Norman (trans.) The Anglo-Saxon Chronicle J. M. Dent & Sons, London, 1972 & 1975. . For the Peterborough Chronicle's unique information, see also Clark, Cecily (ed.) The Peterborough Chronicle 1070–1154 (pp. xxi–xxx) Oxford University Press, 1958. This is the only known prose history in English between the conquest and the later 14th century.Bennett, Jack Arthur Walter Middle English Literature (ed. and completed by Douglas Gray), Oxford University Press, 1986.  The burgesses received their first charter from \"Abbot Robert\" – probably Robert of Sutton (1262–1273).Chisholm, Hugh (ed.) Encyclopædia Britannica (11th ed.) vol.21 Cambridge University Press, 1911 (text in the public domain). The place suffered materially in the war between King John and the confederate barons, many of whom took refuge in the monastery here and in Crowland Abbey, from which sanctuaries they were forced by the king's soldiers, who plundered the religious houses and carried off great treasures. The abbey church became one of Henry VIII's retained, more secular, cathedrals in 1541, having been assessed at the Dissolution (in the King's Books) as having revenue of £1,972.7s.0¾d per annum.", "* Ingram, James Henry (trans.) The Anglo-Saxon Chronicle J. M. Dent & Sons, London, 1823 (1847 Everyman's Library ed. with additional readings from the translation of John Allen Giles)."]}, {"page": "Celtic Christianity", "response": ["According to medieval traditions, Christianity arrived in Britain in the 1st century. Gildas's 6th-century account dated its arrival to the latter part of the reign of the Roman emperor Tiberius:Gildas. De Excidio et Conquestu Britanniae. 6th century.  Translated by Thomas Habington. The Epistle of Gildas the most ancient British Author: who flourished in the yeere of our Lord, 546. And who by his great erudition, sanctitie, and wisdome, acquired the name of Sapiens. Faithfully translated out of the originall Latine (8 vols). T. Cotes for William Cooke (London), 1638. Edited and reprinted by John Allen Giles. \"The Works of Gildas, Surnamed 'Sapiens,' or the Wise\", §8 in Six Old English Chronicles of Which Two Are Now First Translated from the Monkish Latin Originals: Ethelwerd's Chronicle, Asser's Life of Alfred, Geoffrey of Monmouth's British History, Gildas, Nennius, and Richard of Cirencester. Henry G. Bohn (London), 1848. Hosted at Wikisource. an account of the seventy disciples discovered at Mount Athos in 1854 lists Aristobulus as \"bishop of Britain\". Medieval accounts of King Lucius, Fagan and Deruvian, and Joseph of Arimathea, however, are now usually accounted as pious frauds."]}, {"page": "Matthew Paris", "response": ["Matthew Paris, also known as Matthew of Paris (;John Allen Giles (translator), Matthew Paris' English history, from 1235 to 1273, Publ. 1852. (page v) c. 1200 – 1259), was an English Benedictine monk, chronicler, artist in illuminated manuscripts and cartographer, based at St Albans Abbey in Hertfordshire. He wrote a number of works, mostly historical, which he scribed and illuminated himself, typically in drawings partly coloured with watercolour washes, sometimes called \"tinted drawings\". Some were written in Latin, some in Anglo-Norman or French verse."]}, {"page": "Roger Ascham", "response": ["Report and Discourse of the Affairs and State of Germany 1553 was published by John Daye (1570). Ascham's English works were edited by James Bennett, with a life by Samuel Johnson in 1771, reprinted in 1815. John Allen Giles in 1864–1865 published in 4 vols. select letters from the Toxophilus and Scholemaster and the life by Edward Grant."]}, {"page": "Flores Historiarum", "response": ["*  John Allen Giles (1849): vol 1, vol 2"]}, {"page": "Herbert Giles", "response": ["Herbert A. Giles was the fourth son of John Allen Giles (1808–1884), an Anglican clergyman. After studying at Charterhouse, Herbert became a British diplomat to Qing China, serving from 1867 to 1892.  He also spent several years (1885–1888) at Fort Santo Domingo in Tamsui, northern Taiwan. Giles’ great grandson, Giles Pickford, stated in an address at the opening of the Fort San Domingo Museum – 8 November 2005, that his great grandfather, Herbert A Giles, was Her Britannic Majesty's Consul in Tamsui, Fort San Domingo from 1885 until 1891. Prior to that time, in 1869, Giles was based at Kaoshiung.Presentation Notes held at the Australian National University;https://anulib.anu.edu.au/files/guidance/address-by-giles-pickford-text.pdf He was the father of Bertram, Valentine, Lancelot, Edith, Mable, and Lionel Giles. In 1897 Herbert Giles became only the second professor of Chinese language appointed at the University of Cambridge, succeeding Thomas Wade. At the time of his appointment, there were no other sinologists at Cambridge. Giles was therefore free to spend most of his time among the ancient Chinese texts earlier donated by Wade, publishing what he chose to translate from his eclectic reading in Chinese literature.Aylmer, Charles, East Asian History 13–14, 1997, pp. 1–7; Sterckx, Roel, In the Fields of Shennong: An inaugural lecture delivered before the University of Cambridge on 30 September 2008 to mark the establishment of the Joseph Needham Professorship of Chinese History, Science and Civilization. Cambridge: Needham Research Institute, 2008. Giles published over sixty books, lectures, pamphlets, journal articles, book reviews, and newspaper articles. During his long life he completed a comprehensive Chinese-English Dictionary which took over fifteen years to compile and became a standard reference for many years. Giles also published the first history of Chinese literature and art, which also became a reference work. Some of his translations have stood the test of time and are still among the best available. Giles was not afraid to be controversial and outspoken on numerous topics. To quote his great grandson, \"Most of his enemies were people whose work he had criticized.  Such people included E H Parker, a sinologist at Manchester University; Sir Walter Hillier a sinologist from London; and Sir Thomas Wade, Minister to China (1870-76 and 1880-82) and therefore Giles’s superior in the Consular Service. Wade was later Professor of Chinese at the University of Cambridge (1888-95).  Giles was to succeed him in this position in 1897.\" Giles was also outspoken on the work of Christian Missionaries and British traders because of the overcrowding of Chinese emigrants on British ships. Yet as Charles Aylmer wrote, in his Memoirs of H. A. Giles, \"Notwithstanding his reputation for abrasiveness, he would speak to anyone in the street from the Vice-Chancellor to a crossing-sweeper and was remembered by acquaintances as a man of great personal charm. \"Presentation Notes held at the Australian National University;https://anulib.anu.edu.au/files/guidance/address-by-giles-pickford-text.pdfAylmer, Charles, East Asian History 13–14, 1997, pp. 1–7; Sterckx, Roel, In the Fields of Shennong: An inaugural lecture delivered before the University of Cambridge on 30 September 2008 to mark the establishment of the Joseph Needham Professorship of Chinese History, Science and Civilization. Cambridge: Needham Research Institute, 2008. Giles wrote some of his works in conjunction with his son, Dr. Lionel Giles, also an expert on China, who was employed as the Deputy Keeper of Oriental Printed Books and Manuscripts at the British Museum.New York Times, 14 February 1935,\"H.A.Giles is Dead; Chinese Scholar"]}, {"page": "Kingdom of Gwynedd", "response": ["The region became known as Venedotia in Latin. The name was initially attributed to a specific Irish colony on Anglesey, but broadened to refer to Irish settlers as a whole in North Wales by the 5th century. According to 9th century monk and chronicler Nennius, North Wales was left defenseless by the Roman withdrawal and subject to increasing raids by marauders from the Isle of Man and Ireland, a situation which led Cunedda, his sons and their entourage, to migrate in the mid-5th century from Manaw Gododdin (now Clackmannanshire, Scotland) to settle and defend North Wales against the raiders and bring the region within Romano-British control. According to traditional pedigrees, Cunedda's grandfather was Padarn Beisrudd, Paternus of the red cloak, \"an epithet which suggests that he wore the cloak of a Roman officer\", and perhaps it was evidence of a high-ranking officer. Nennius (translated by John Allen Giles) recounts how Cunedda (flourished in the 5th century) brought order to North Wales and after his death Gwynedd was divided among his sons: Dynod was awarded Dunoding, another son Ceredig received Ceredigion,\" Afloeg by Aflogion in Lleyn, Dogfael by Dogfeiling in Dyffryn Clwyd, and Edern by Edeirnion ... Osweilion of Osfael has not yet been located; Tybion, the eldest son, is said to have died in Manaw Gododdin, but his son Meirion (Marianus) comes into the picture as lord of Meirionydd. Einion Yrth completes the number\". Cadwallon Lawhir ap Einion one of his sons, was the final leader to defeat of the Irish on Anglesey. However, this overly neat origin myth has been met with skepticism,"]}, {"page": "City of London School", "response": ["The school has had thirteen headmasters. The first was John Allen Giles, a scholar of Anglo-Saxon history and a Fellow at Corpus Christi College, Oxford,"]}, {"page": "Ecclesiastical History of the English People", "response": ["*1845:  John Allen Giles (London: James Bohn) full text."]}, {"page": "Richard of Devizes", "response": ["* \"Chronicle of the deeds of Richard I\" translated by John Allen Giles."]}, {"page": "Groans of the Britons", "response": ["The text describes Agitius as being consul for the third time, dating the message to the period between 446, when he held his third consulate, and 454, when he held his fourth.In Michael Lapidge and David Dumville, eds. Gildas: New Approaches (Studies in Celtic History 5) 1984. Leslie Alcock has raised a tentative possibility of the \"Agitius\" to whom the gemitus is directed actually being Aegidius—though he was never consul.Alcock, Arthur's Britain, 1971:107: \"Agitius is most reasonably identified with Aegidius... but Aegidius was never a consul.\" Alcock 1971 was critically reviewed by K. H. Jackson in Antiquity 47 (1973), noted by Thomas D. O'Sullivan, The De Excidio of Gildas :169 and notes. Aside from Miller,Miller, \"Bede's use of Gildas,\" English Historical Review 90 (1975:247). who leaves the possibility open, this alternative has not been pursued. The usurper Constantine III had taken the last Roman troops from Britain in 407 and the civilian administration had been expelled by the natives a little later, leaving the inhabitants to fend for themselves during increasingly fraught times. Parts of the plea were recorded:\"The Works of Gildas, Surnamed 'Sapiens,' or the Wise\", in: John Allen Giles, ed., Six Old English Chronicles, of Which Two Are Now First Translated from the Monkish Latin Originals (London: Henry G. Bohn, 1848), pt. 1, ¶20. This is a revision of Thomas Habington, trans., The Epistle of Gildas the most ancient British Author: who flourished in the yeere of our Lord, 546. And who by his great erudition, sanctitie, and wisdome, acquired the name of Sapiens. Faithfully translated out of the originall Latine, 8 vols. (London: T. Cotes for William Cooke, 1638). ", "*De Excidio Britannae, as translated by John Allen Giles"]}, {"page": "John Giles", "response": ["*John Allen Giles (1808–1884), English historian"]}]}}