{"wiki_id": "http://www.wikidata.org/entity/Q6212744", "itemLabel": "Joe Turner", "itemDescription": "British screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Turner_(writer)", "wikipedia_page": {"main": "Andrew \"Joe\" Turner is a British script writer working in the fields of radio and television.  His credits include the 2006 BBC version of Robin Hood (his episode featured Charles Dale), episodes of Holby City and Casualty.\nOriginally an actor, he featured in the BBC television production of The Lion, the Witch and the Wardrobe.\nHe has written extensively for radio, with nine plays including 20th Century Vampire, My Supply Teacher is an Alien, My Sister is a World Class Kleptomaniac and Old Dog and Partridge.\nTurner lives with his family in Abergavenny, Monmouthshire.", "link_mentions": [{"page": "Robin Hood (2006 TV series)", "response": ["Comprising thirteen 45-minute episodes per series, Robin Hood was created by Dominic Minghella and Foz Allan, who serve as executive producers on the series, with Minghella the chief writer. Minghella was previously responsible for the successful ITV network comedy-drama series Doc Martin. Richard Burrell is the producer, and the other writers involved on the first series were Paul Cornell, Mark Wadlow, Debbie Oates, Kurti & Doyle and Joe Turner."]}, {"page": "20th Century Vampire", "response": ["20th Century Vampire is a radio situation comedy series written by Joe Turner.  It was originally broadcast in six episodes on BBC Radio in 1993.  In the UK, it is repeated from time to time on the digital channel BBC Radio 4 Extra (formerly BBC7), available globally via the BBC Sounds website."]}, {"page": "Joe Turner", "response": ["Joe Turner is the name of:", "* Big Joe Turner (1911–1985), blues singer", "* Joe Turner (jazz pianist) (1907–1990), jazz/stride pianist", "* Joe Turner (footballer, born 1872) (1872–1950), English football winger for Southampton, Stoke and Everton", "* Joe Turner (footballer, born 1931), English football goalkeeper for Stockport, Darlington, Scunthorpe and Barnsley", "* Joe Turner (ice hockey) (1919–1944 or 1945), Canadian hockey player", "* Joe Turner (writer), British writer", "* a character  in the play Joe Turner's Come and Gone"]}]}}