{"wiki_id": "http://www.wikidata.org/entity/Q6211612", "itemLabel": "Joe Oastler", "itemDescription": "English association football player (born 1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Oastler", "wikipedia_page": {"main": "Joseph James Oastler (born 3 July 1990) is an English professional footballer who plays for Havant & Waterlooville as a defender.", "link_mentions": [{"page": "Martin Ling", "response": ["He was appointed Torquay United manager on 13 June 2011 after the departure of Paul Buckle to Bristol Rovers. With Buckle taking goalkeeper Scott Bevan and forward Chris Zebroski with him to the Memorial Stadium, Ling made moves for strikers Rene Howe and Taiwo Atieno, midfielders Chris McPhee and Ian Morris, defenders Brian Saah, Daniel Leadbitter and Joe Oastler, and goalkeepers Bobby Olejnik and Martin Rice."]}, {"page": "2008–09 Queens Park Rangers F.C. season", "response": ["|align=left|Joe Oastler"]}, {"page": "2009–10 Queens Park Rangers F.C. season", "response": ["| Joe Oastler", "|28||DF||||Joe Oastler||0||1||0||0||0||0||0||1"]}, {"page": "2010–11 Torquay United F.C. season", "response": ["With Wroe and Charnock on the transfer list, new faces began to appear with the aim of freshening up the side.  First through the door was Joe Oastler on loan from Queens Park Rangers. Capable of playing as both a midfielder and defender, Oastler joined Torquay on a one-month deal. Later in the month, two more loan signings arrived at Plainmoor within twenty four hours of each other. Winger Romone Rose became the second loanee from Neil Warnock's QPR, signing a three-month deal, while the young Wolves striker Ashley Hemmings joined Torquay, like Oastler, on a one-month contract.", "No new additions were made to the squad during the month, although the loan deal for Joe Oastler was extended until January while Wolves agreed to allow Ashley Hemmings to extend his stay at Plainmoor.  With the loan window about to close, leading striker Elliot Benyon appeared to be on the verge of leaving Torquay, with Swindon, Dagenham & Redbridge and Southend among the clubs reported to have been interested in making a move for the young forward.  However, Gulls fans were relieved when the window closed with Benyon still part of the United squad - at least until the January transfer window.  Of the two players placed on the transfer list in October, Kieran Charnock moved on loan to Morecambe, with a view to making the deal a permanent one in January. However, former captain Nicky Wroe now seemed happy to remain at Plainmoor after Paul Buckle revealed the midfielder had rejected a move to Aldershot.", "Another year, another transfer window and another FA Cup run for Torquay United.  Despite being the favourite with many bookmakers to take over at Bristol Rovers, Paul Buckle was left to focus on his job at Plainmoor after Dave Penney was installed as the new manager at the Memorial Stadium.  As is often the case, most of the transfer activity was left until the last day of January, although two predictable changes did take place early in the month with Kieran Charnock making his loan move to Morecambe a permanent one and Martin Gritton returning to parent club Chesterfield after the striker had failed to make an impression during his second spell at the club.  Meanwhile, Joe Oastler had his loan from QPR extended until the end of the season.", "The first new face at Plainmoor was Shaun Taylor, who was appointed as Ling's assistant manager.  Taylor was previously the youth coach at Exeter City and was also brother to former Torquay defender Craig Taylor.  With Taylor on board, Ling now looked to bring new players to Torquay.  Firstly, Joe Oastler signed a permanent two-year deal with Torquay after being released by QPR, while Danny Stevens also agreed in principle to renew his contract.  Another familiar face who returned to Torquay was Chris McPhee.  He had played for the Gulls during their disastrous 2006–07 season and was looking to make amends on his return to the club.  Joining on the same day as McPhee was Daniel Leadbitter, a promising young defender who had just been released by Newcastle United.", "|18 ||  || MF || Joe Oastler || 8 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 8 || 0", "|Joe Oastler", "|Joe Oastler"]}, {"page": "2010–11 Queens Park Rangers F.C. season", "response": ["|  Joe Oastler", "| 28 || DF ||  ||align=left| Joe Oastler || 0 || 0 || 0 || 0 || 0 || 1 || 0 || 1"]}, {"page": "Joseph James Oastler", "response": ["#REDIRECT Joe Oastler"]}, {"page": "Joseph Oastler", "response": ["#REDIRECT Joe Oastler"]}, {"page": "Lee Brown (footballer)", "response": ["He spent the first half of the 2009–10 season on loan at administration-stricken Salisbury City of the Conference National, along with teammate Joe Oastler. He made fourteen appearances for the club, including twelve starts, before returning to Loftus Road before the end of the calendar year. On 24 April 2010 he made his debut in the Football League, replacing Tamás Priskin as a substitute in a 1–0 win over Barnsley at Oakwell.", "At the end of the season Neil Warnock offered him a new one-year deal, which he duly signed. \"Lee Brown has emerged as an exciting prospect from the QPR youth system in recent years and was rewarded with a one-year deal at QPR in 2009. He, along with several youngsters were given the opportunity to train with the first team in the latter part of the 2008–09 season, after impressing in the reserves. The left-back played an important role in QPR's pre-season of 2009–10 and was subsequently given his first squad number in light of the lack of full-backs at the club. Brown, along with fellow defender Joe Oastler, was loaned out to Conference Premier side Salisbury City. His stay there was curtailed due to Salisbury being unable to renew their loan deals\""]}, {"page": "2011–12 Queens Park Rangers F.C. season", "response": ["|  Joe Oastler"]}, {"page": "2011 Football League Two play-off Final", "response": ["Neither side made any changes to their personnel during the interval and the second half started with Torquay United applying pressure.  Five minutes in, Kee was sent clear with a pass from Kevin Nicholson and went one-one-one with the Stevenage goalkeeper Chris Day but his weak shot was deflected round the goalpost.  In the 55th minute, Zebroski was shown the first yellow card of the match for foul on Roberts.  Three minutes later, Stevenage made the first substitution of the match, with Darren Murphy replacing Byrom.  Soon after, Mousinho was booked for time-wasting before Harrison was brought on by Stevenage as a substitute for Reid who had injured his hamstring.  Charles then saw his low shot saved by Bevan before Zebroski's shot following an error from Roberts hit the side netting.  Jake Robinson's  strike was saved by Day and then Zebroski shot over the Stevenage bar.  Murphy's close-range header went wide of the Torquay United goal before Robinson's shot hit the Stevenage crossbar.  In the 79th minute, Joe Oastler came on to replace Damon Lathrope and was booked a minute later for a foul on Harrison.  Three minutes later, Branston's initial shot from a Stevenage corner was blocked and he struck the rebound over the bar from around .  With seven minutes of regular time remaining, Torquay United made a double-substitution, with Danny Stevens and Lathaniel Rowe-Turner coming on for Robinson and Nicholson.  Stevenage then brought Beardsley on to replace Charles.   Stevens late shot for Torquay United was blocked and the match ended 1–0 to Stevenage who secured back-to-back promotions.", "|DF ||18||Joe Oastler ||  || "]}, {"page": "2011–12 Torquay United F.C. season", "response": ["Following the acquisitions in June of Joe Oastler, Chris McPhee and Daniel Leadbitter, Martin Ling further bolstered the Torquay United squad with two crucial defensive signings in goalkeeper Bobby Olejnik and centre back Brian Saah. Olejnik came with a fine pedigree having played for Falkirk in the Scottish Premier League while Saah had previously played under Ling at Leyton Orient and Cambridge United.  With Chris Zebroski making the decision to follow former manager Paul Buckle to Bristol Rovers, Ling needed to improve his attacking options which led to the signings of strikers Rene Howe and Taiwo Atieno and midfielder Ian Morris. Finally, as back-up to Bobby Olejnik, former Gulls keeper Martin Rice returned to Plainmoor after two seasons with Truro City.", "With the squad now missing Chris Robertson and Billy Bodin, Martin Ling sought to bring in replacements for the departed pair.  First in was former Wales under-21 winger Nathan Craig.  Currently a free agent, Craig had impressed Ling while playing for the reserves and was offered what amounted to an extended trial until the end of the season. Another new face arrived in the shape of defender Angus MacDonald who was brought in on loan from Reading for the rest of the season. The new players had yet to make an appearance before Torquay's run of good form came to a shuddering halt with a surprise 2–1 defeat at Plainmoor to struggling Bradford City.  Fans may well have been wondering if they were feeling the delayed effects of the Manager of the Month 'curse' when the Gulls suffered a second successive loss away to Gillingham.  The 2–0 defeat at Priestfield ended in bizarre circumstances with the assistant referee flagging for a penalty when Brian Saah had seemingly brought down former Gulls-loanee Gavin Tomlin in the penalty box.  However, referee Jock Waugh (who had originally waved play-on) decided to send off Joe Oastler instead of Saah.  However, following an appeal, the FA rectified the error and the one-match ban was switched from Oastler to Saah.", "|18 ||  || MF || Joe Oastler || 6 || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 6 || 1"]}, {"page": "2012–13 Torquay United F.C. season", "response": ["|= || DF ||  || 2 || Joe Oastler || 1 || 0 || 0 || 0 || 1", "|2 ||  || DF || Joe Oastler || 9 || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 9 || 1"]}, {"page": "2012–13 York City F.C. season", "response": ["York were knocked out of the FA Cup after a 4–3 extra time defeat away to AFC Wimbledon in a first round replay. Jamie Reed scored in the 89th minute to hand York a 2–2 draw away to Port Vale, after Rodman had scored his first goal for the club earlier in the second half. Carlisle was loaned to divisional rivals Northampton ahead of a permanent transfer in January 2013, while Henderson joined Gateshead on loan and Bullock had his loan extended. York fell to a second successive home defeat after being beaten 2–0 by Torquay United, the away team scoring in each half through Danny Stevens and Joe Oastler. Despite his loan earlier being extended until January 2013, Kearns was recalled by Peterborough, having made 12 appearances for York."]}, {"page": "List of people from Hampshire", "response": ["*Joe Oastler, footballer, was born in Portsmouth"]}, {"page": "2013–14 Torquay United F.C. season", "response": ["|Joe Oastler"]}]}}