{"wiki_id": "http://www.wikidata.org/entity/Q6211492", "itemLabel": "Joe Murrell", "itemDescription": "English footballer (1879-1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Murrell", "wikipedia_page": {"main": "Harry Robert Murrell (19 November 1879 – 15 August 1952), known as Joe Murrell, was an English cricketer who played over 350 matches, mainly for Middlesex County Cricket Club as a wicket-keeper.\nMurrell was born at Hounslow in Middlesex. He made his first-class cricket debut for Kent County Cricket Club in 1899 and played for the county until the end of the 1905 season. Kent's wicket-keeper at the time was Fred Huish and Murrell found it difficult to gain a place in the side, only keeping wicket in six of his 27 first-class matches for the county. In 1906 he joined Middlesex and was associated with the club for the next 46 years.Murrell played 342 times for Middlesex in first-class cricket and developed a reputation as \"a first-class wicket-keeper\" who, when Middlesex won the County Championship in 1920 and 1921, was considered by Wisden as \"one of the best of wicket-keepers\". He was considered a loyal team-mate whose judgment and advice could be relied upon by Middlesex captain Pelham Warner and in his obituary Wisden considered him unfortunate to have not played for England. As a batsman Murrell was considered \"fast-footed\" and \"could hit extremely hard\", although he never scored a century.Over the course of his career, Murrell took 835 dismissals, 564 caught and 271 stumped. After retiring, he was the 1st XI scorer for Middlesex until his death at West Wickham in Kent in 1952 at the age of 72.He also played football for Woolwich Arsenal. After playing for local sides in Kent and Middlesex, he joined Arsenal in October 1898, making his first-team debut against Small Heath on 31 March 1900. He played mainly as a full back filling in for regulars Jimmy Jackson and David McNichol. He left Arsenal for Clapton Orient in the summer of 1900, having played 6 first-team games for them.", "link_mentions": [{"page": "Middlesex County Cricket Club", "response": ["| Joe Murrell || 765 (502 catches & 263 stumpings) (1906–1926)", "| 8th wicket || 182* || Mordaunt Doll & Joe Murrell || v. Nottinghamshire || Lord's || 1913"]}, {"page": "Harry Robert Murrell", "response": ["#REDIRECT Joe Murrell"]}, {"page": "Harry Murrell", "response": ["#REDIRECT Joe Murrell"]}, {"page": "Murrell", "response": ["*Joe Murrell (1879–1952), English cricketer"]}, {"page": "Mordaunt Doll", "response": ["Doll scored 102 not out in a county record eighth wicket stand of 182 in two hours with Joe Murrell for Middlesex against Nottinghamshire at Lord's in 1913. He toured the West Indies in 1912/1913 with an MCC team led by Arthur Somerset."]}, {"page": "List of Marylebone Cricket Club players (1895–1914)", "response": ["* Joe Murrell (1901–1919) : H. R. Murrell (Kent, Middlesex)"]}, {"page": "History of English cricket from 1919 to 1939", "response": ["Middlesex's captain in the twenties was Frank Mann who also led England on their 1922–23 tour of South Africa. The most outstanding players in the two title-winning seasons were England batsman Patsy Hendren and all-rounder J. W. Hearne. Others in that team were wicket-keeper Joe Murrell; fast bowler Jack Durston; and all-rounders Nigel Haig, Harry Lee and Greville Stevens. Walter Robins was the team captain in the thirties and both Jim Smith and Jim Sims were England bowlers at the time. In the last few seasons before the Second World War, Middlesex could call upon Denis Compton, Bill Edrich and Jack Robertson."]}]}}