{"wiki_id": "http://www.wikidata.org/entity/Q6218326", "itemLabel": "John Aidan Liddell", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Aidan_Liddell", "wikipedia_page": {"main": "John Aidan Liddell,  (3 August 1888 – 31 August 1915) was a British military pilot and a recipient of the Victoria Cross, the highest award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.", "link_mentions": [{"page": "De Panne", "response": ["Famous people who have lived or died in De Panne include King Albert I and Queen Elisabeth, and John Aidan Liddell, VC, who died in De Panne in August 1915. The Belgian royal family lived in De Panne during the First World War because it was located in the tiny fraction of their country that was not conquered by the Germans."]}, {"page": "No. 7 Squadron RAF", "response": ["No. 7 Squadron was formed at Farnborough Airfield on 1 May 1914 as the last squadron of the Royal Flying Corps (RFC) to be formed before the First World War,Halley 1988, p. 32. but has been disbanded and reformed several times since, the first being after only three months of existence,West 1974, p. 1. the latter as early as 28 September 1914.West 1974, p. 2. The squadron spent most of the First World War in observation and interception roles and was responsible for the first ever interception of an enemy aircraft over Britain.The Air Defence of Britain 1914–1918, Cole & Cheeseman It deployed to France in April 1915, flying Royal Aircraft Factory R.E.5s for reconnaissance and Vickers Gunbuses as escort fighters. Captain John Aidan Liddell of 7 Squadron won the Victoria Cross for his actions on 31 July 1915, when he continued his reconnaissance mission over Belgium after the aircraft was hit by ground fire, the aircraft being badly damaged and Liddell suffering a broken thigh. Although he successfully recovered the R.E.5 to allied lines, saving his observer, he died of his wounds a month later.Ashworth 1989, p. 41.Yoxall Flight 18 May 1951, pp. 590–591."]}, {"page": "List of Balliol College, Oxford people", "response": ["* John Aidan Liddell"]}]}}