{"wiki_id": "http://www.wikidata.org/entity/Q6218742", "itemLabel": "John Allen", "itemDescription": "historian", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Allen_(historian)", "wikipedia_page": {"main": "John Allen (3 February 1771 – 10 April 1843) was a prominent eighteenth and nineteenth century political and historical writer, and Master of the College of God's Gift in Dulwich (then colloquially called \"Dulwich College\"). More than one street in Kensington, London, is named after him.", "link_mentions": [{"page": "Dulwich College", "response": ["The next two centuries were beset by both external difficulties such as diminishing financial fortunes and failing buildings as well as internal strife between the various Members of the College. The Official Visitor, the Archbishop of Canterbury, whose function was to ensure that the statutes were obeyed, was called in many times.Hodges, S, (1981), God's Gift: A Living History of Dulwich College, pages 11–13, (Heinemann: London) The lack of a disinterested body of governors and of any official connection to the Universities of Oxford or Cambridge contributed significantly to the school failing to fulfill Alleyn's vision in its first two centuries.Hodges, S, (1981), God's Gift: A Living History of Dulwich College, page 26, (Heinemann: London) Some notable Masters did preside over the college during this time, including James Allen (the first Master to drop the 'y' from his surname), who in 1741 made over to the college six houses in Kensington, the rents of which were to be used in the establishment of two small schools in Dulwich, one for boys from the village, the other for girls to read and sew, out of which James Allen's Girls' School (JAGS) arose. Dr John Allen (1771–1843) of Holland House was a most learned and influential man, but neglected the education of the Poor Scholars.Piggott, J R, Dulwich College, a History, 1616–2008, pages 84–88, (Dulwich College: London)."]}, {"page": "John Allen", "response": ["John Allen may refer to:", "*John Allen (Connecticut politician) (1763–1812), U.S. Representative from Connecticut", "*John Allen (Arizona politician), American politician and member of the Arizona House of Representatives ", "*John Allen, 3rd Viscount Allen (1713–1745), Irish peer and politician", "*John Allen, 1st Viscount Allen (1660–1726), Irish peer and politician", "*John Allen, 4th Viscount Allen (died 1753), Irish peer and politician", "*John Allen (historian) (1771–1843), historian and political writer painted in 1836 by Sir Edwin Henry Landseer", "*John Allen (athlete) (1926–2006), American Olympic athlete", "*John Allen (baseball) (1890–1967), American professional baseball player", "*John Allen (basketball) (born 1982), American basketball player", "*John Allen (footballer, born 1955), English former footballer", "*John Allen (footballer, born 1964), football midfielder for Chester City and Mansfield Town, head coach of RoPS in Finland's Veikkausliiga", "*John Allen (hurler) (born 1955), former Cork hurling player and manager", "*John Allen (sportsman, born 1974), Australian rugby union player and cricketer ", "*John Allen (American football), NFL Europa coach", "*John Allen (coach), American college football coach", "*John Allen (rugby union) (born 1942), English rugby union player", "*John Allen (Irish nationalist) (died 1855), Irish nationalist, later a colonel in the French army", "*John Allen (soldier) (1771–1813), American Army officer killed in the War of 1812", "*John Allen (bookseller) (1789–1829), English bookseller and antiquary interested in Herefordshire", "*John Allen (minister) (1741/2–1780s), Baptist minister who supported the independence of America", "*John Allen (murderer) (1934–2015), English criminal who murdered his wife and children", "*John Allen (pioneer) (1796–1851), American pioneer and a co-founder of Ann Arbor, Michigan", "*John Allen (physician) (c. 1660–1741), English physician and inventor", "*John Allen (priest) (1932–2015), Anglican Provost of Wakefield Cathedral", "*John Allen (puritan) (1596–1671), or John Allin, patriarch of New England and Dedham, Massachusetts", "*John Allen (religious writer) (1771–1839), English dissenting layman and religious writer", "*John Allen (trade unionist) (1804–1888), Irish trade union leader", "*John Allen (saloon keeper) (1823–1870), underworld figure in New York City, the \"Wickedest Man in New York\"", "*John Allen (miner) (1775–?), lead miner", "*John Allen (diplomat), acting Administrator of Tokelau, 2009–2011", "*John Allen (Archdeacon of Salop) (1810–1886)", "*John Allen (guitarist), member of The Nashville Teens"]}, {"page": "Colinton", "response": ["* John Allen – eighteenth and nineteenth century political and historical writer"]}, {"page": "Bookland (law)", "response": ["Ignoring any prior conjectures, the idea that folkland was land owned by the entire folk was introduced by John Allen in his 1830 Inquiry into the Rise and Growth of the Royal Prerogative in England. He asserted that the land was the property of the people as a whole, to be let out at will, and returned to the people's control when the grant had expired. Tenure of Landed Property This became the accepted view of mainstream historians, Folkland. A lengthy list of respected historians and jurists is provided, and others are mentioned in the course of the article, including internationals. Allen's view had attracted very wide support. who then developed arguments and theories based on the correctness of the proposition."]}, {"page": "List of philosophers born in the 18th century", "response": ["* John Allen, (1771–1843)"]}, {"page": "College of God's Gift", "response": ["*John Allen (succeeded 1820; died 1843)", "*George John Allen (succeeded 1843; pensioned 1857)"]}, {"page": "King of Clubs (Whig club)", "response": ["The original inspiration for its formation came from the Rev. Sydney Smith's older brother, Robert - nicknamed \"Bobus\" after gaining the reputation at Eton for being such a clever Latin \"versifier\". The founding members were a group of friends who first met at the house of James Mackintosh in February, 1798. As well as Mackintosh, the group comprised Samuel Rogers, James Scarlett, 1st Baron Abinger, Richard \"Conversation\" Sharp, the historian John Allen and Robert Smith and by 1801 what had started as a small clique of friends had become a properly constituted club comprising the following members,", "* John Allen"]}, {"page": "Elizabeth Fox, Baroness Holland", "response": ["Lord Holland died on 22 October 1840. After his death, Lady Holland lived at 33 South Street, a property she had inherited from her mother. She continued to entertain, and it was here that the historian John Allen died in 1843."]}, {"page": "William Dougal Christie", "response": ["In 1839 he produced a work advocating the secret ballot, republished with additions in 1872 as The Ballot, and Corruption and Expenditure at Elections. In the Introductory Note on the ballot he sketched the earlier parliamentary history from his own perspective: George Grote had introduced a motion on it in 1833, and up to 1839 there had been increasing support, with Thomas Babington Macaulay arguing on its side. Henry George Ward took up the cause in 1842, when Grote no longer was an MP. James Mill and Fonblanque were supporters in print; William Empson and John Allen were encouraging about the initial essay of 1839. Only Sydney Smith's witty barbs are mentioned on the other side of the argument.William Dougal Christie, The Ballot, and Corruption and Expenditure at Elections, essays (1872), pp. 4–5; archive.org."]}, {"page": "Allen Thomson", "response": ["The only son of Dr John Thomson by his second wife, Margaret, daughter of John Millar, he was born at Brown SquareEdinburgh and Leith Post Office Directory 1809–1810 in Edinburgh on 2 April 1809, and was named after his father's friend, John Allen, secretary and confidential friend of Lord Holland. Margaret Mylne was his sister and William Thomson his half-brother. Allen Thomson was educated at the high school and University of Edinburgh, and then in Paris. He graduated doctor of medicine at the University of Edinburgh in August 1830. At the time of his graduation he was president of the Royal Medical Society in Edinburgh. He became a fellow of the Royal College of Surgeons of Edinburgh in 1831."]}, {"page": "Holland House", "response": ["Celebrated visitors to the house included the historian Thomas Babington Macaulay, the poets Lord Byron, Thomas Campbell, and Samuel Rogers, the politicians Lord Melbourne, Lord John Russell, Richard \"Conversation\" Sharp and Benjamin Disraeli, and the writers Charles Greville, Charles Dickens and Sir Walter Scott, as well as Joseph Blanco White, a Spaniard who moved to Britain. The political and historical writer John Allen was so much associated with the house that he was known as \"Holland House Allen\", and a room in the house was named after him. Lady Caroline Lamb, who had first met her lover Lord Byron at Holland House, satirised it in her 1816 novel Glenarvon."]}, {"page": "Charles-Gaspard de la Rive", "response": ["De la Rive was born in Geneva, and originally studied law. During the Geneva revolution of 1794, he was a freedom fighter and later fled to Scotland with the physician Alexander Marcet. In 1797, he attained a doctorate of medicine from the University of Edinburgh while working with his teacher John Allen on the work Tentamen physiologicum inaugurale, de calore animali .... According to De la Rive, Allen believed that the body heat of animals is based on the combustion of food particles in the blood. After practising for a few years in London, where he visited several asylums, he returned to Geneva."]}]}}