{"wiki_id": "http://www.wikidata.org/entity/Q621776", "itemLabel": "Alexander John Ellis", "itemDescription": "English mathematician, philologist and musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_John_Ellis", "wikipedia_page": {"main": "Alexander John Ellis,  (14 June 1814 – 28 October 1890) was an English mathematician, philologist and early phonetician who also influenced the field of musicology.  He changed his name from his father's name Sharpe to his mother's maiden name, Ellis in 1825, as a condition of receiving significant financial support from a relative on his mother's side. He is buried in Kensal Green Cemetery, London.\n\n", "link_mentions": [{"page": "International Phonetic Alphabet", "response": ["In 1886, a group of French and British language teachers, led by the French linguist Paul Passy, formed what would be known from 1897 onwards as the International Phonetic Association (in French, ).International Phonetic Association, Handbook, pp. 194–196 Their original alphabet was based on a spelling reform for English known as the Romic alphabet, but to make it usable for other languages the values of the symbols were allowed to vary from language to language.\"Originally, the aim was to make available a set of phonetic symbols which would be given different articulatory values, if necessary, in different languages.\"  (International Phonetic Association, Handbook, pp. 195–196) For example, the sound  (the sh in shoe) was originally represented with the letter  in English, but with the digraph  in French. In 1888, the alphabet was revised so as to be uniform across languages, thus providing the base for all future revisions. The idea of making the IPA was first suggested by Otto Jespersen in a letter to Paul Passy. It was developed by Alexander John Ellis, Henry Sweet, Daniel Jones, and Passy.IPA in the Encyclopædia Britannica"]}, {"page": "Received Pronunciation", "response": ["The introduction of the term Received Pronunciation is usually credited to the British phonetician Daniel Jones. In the first edition of the English Pronouncing Dictionary (1917) he named the accent \"Public School Pronunciation\" but for the second edition in 1926 he wrote: \"In what follows I call it Received Pronunciation, for want of a better term.\" However, the term had been used much earlier by P. S. Du Ponceau in 1818. A similar term, received standard, was coined by Henry C. K. Wyld in 1927. The early phonetician Alexander John Ellis used both terms interchangeably, but with a much broader definition than Jones's, saying, \"There is no such thing as a uniform educated pron. of English, and rp. and rs. is a variable quantity differing from individual to individual, although all its varieties are 'received', understood and mainly unnoticed\"."]}, {"page": "Welsh language", "response": ["Welsh-speaking communities persisted well into the modern period across the border in England. Archenfield was still Welsh enough in the time of Elizabeth I for the Bishop of Hereford to be made responsible, together with the four Welsh bishops, for the translation of the Bible and the Book of Common Prayer into Welsh. Welsh was still commonly spoken there in the first half of the 19th century, and churchwardens' notices were put up in both Welsh and English until about 1860.Transactions Woolhope Naturalists' Field Club, 1887, page 173 Alexander John Ellis in the 1880s identified a small part of Shropshire as still then speaking Welsh, with the \"Celtic Border\" passing from Llanymynech through Oswestry to Chirk. (reprinted as ); "]}, {"page": "Cockney", "response": ["A series of new and expanded towns have often had a strong influence on local speech. Many areas beyond the capital have become Cockney-speaking to a greater or lesser degree, including the new towns of Hemel Hempstead, Basildon and Harlow, and expanded towns such as Grays, Chelmsford and Southend. However, this is, except where least mixed, difficult to discern because of common features: linguistic historian and researcher of early dialects Alexander John Ellis in 1890 stated that Cockney developed owing to the influence of Essex dialect on London speech."]}, {"page": "Accidental (music)", "response": ["Ben Johnston created a system of notation for pieces in just intonation where the unmarked C, F, and G major chords are just major chords (4:5:6) and accidentals create just tuning in other keys. Between 2000 and 2003, Wolfgang von Schweinitz and Marc Sabat developed the Extended Helmholtz-Ellis Just Intonation (JI) pitch notation, a modern adaptation and extension of the notation principles first used by Hermann von Helmholtz, Arthur von Oettingen, and Alexander John Ellis that some other musicians use for notating extended just intonation."]}, {"page": "Dagger (mark)", "response": ["* – used in Alexander John Ellis's \"palaeotype\" transliteration to indicate retracted pronunciation", "* – used in Alexander John Ellis's \"palaeotype\" transliteration to indicate advanced pronunciation", "* – used in Alexander John Ellis's \"palaeotype\" transliteration to indicate retroflex pronunciation"]}, {"page": "Microtonal music", "response": ["Alexander John Ellis, who in the 1880s produced a translation of Hermann Helmholtz's On the Sensations of Tone, proposed an elaborate set of exotic just intonation tunings and non-harmonic tunings. Ellis also studied the tunings of non-Western cultures and, in a report to the Royal Society, stated that they used neither equal divisions of the octave nor just intonation intervals. Ellis inspired Harry Partch immensely."]}, {"page": "Schwa", "response": ["The symbol 〈ə〉 was used first by Johann Andreas Schmeller for the reduced vowel at the end of the German language name . Alexander John Ellis, in his Palaeotype alphabet, used it for the similar English sound in but ."]}, {"page": "Kensal Green Cemetery", "response": ["*Alexander John Ellis FRS (1864)"]}, {"page": "Diesis", "response": ["The small diesis  is 3125:3072 or approximately 29.61 cents.Hermann von Helmholtz, On the Sensations of Tone, 2nd English translation by Alexander John Ellis (1885), page 453. Quoted in the Tonalsoft Encyclopedia of Microtonal Music Theory."]}, {"page": "1890 in music", "response": ["*October 28 – Alexander John Ellis, music theorist (b. 1814)"]}, {"page": "Cent (music)", "response": ["Early in the 19th century, Gaspard de Prony proposed a logarithmic unit of base \\sqrt[12]{2}, where the unit corresponds to a semitone in equal temperament.Gaspard de Prony, Instruction élémentaire sur les moyens de calculer les intervalles musicaux, Paris, 1832. Online: . Alexander John Ellis in 1880 describes a large number of pitch standards that he noted or calculated, indicating in pronys with two decimals, i.e. with a precision to the 1/100 of a semitone,The precision is the same as with cents, but Ellis had not yet devised this unit. the interval that separated them from a theoretical pitch of 370 Hz, taken as point of reference.Alexander John Ellis, \"On the History of Musical Pitch,\" Journal of the Society of Arts, 1880, reprinted in Studies in the History of Musical Pitch, Frits Knuf, Amsterdam, 1968, p. 11-62."]}, {"page": "Scouse", "response": ["The period of early dialect research in Great Britain did little to cover Scouse. The early researcher Alexander John Ellis said that Liverpool and Birkenhead \"had no dialect proper\", as he conceived of dialects as speech that had been passed down through generations from the earliest Germanic speakers. Ellis did research some locations on the Wirral, but these respondents spoke in traditional Cheshire dialect at the time and not in Scouse. The 1950s Survey of English Dialects recorded traditional Lancastrian dialect from the town of Halewood and found no trace of Scouse influence. The phonetician John C Wells wrote that \"the Scouse accent might as well not exist\" in The Linguistic Atlas of England, which was the Survey's principal output.Review of the Linguistic Atlas of England, John C Wells, The Times Higher Education Supplement, 1 December 1978"]}, {"page": "List of musicologists", "response": ["*Alexander John Ellis"]}, {"page": "Mackem", "response": ["There has been very little academic work done on the Sunderland dialect.  It was a site in the early research by Alexander John Ellis, who also recorded a local song called Spottee.  Ellis considered Sunderland part of his 'North Northern' dialect group, which covers the entirety of Northumberland, northern Cumberland, and northern and central parts of County Durham.page 39 of On Early English Pronunciation, Part V. The existing phonology of English dialects compared with that of West Saxon speech, A.J. Ellis, Truebner & Co, London, 1889 http://www.openlibrary.org/details/onearlyenglishpr00elliuoft  In the Survey of English Dialects, the nearby town of Washington was surveyed.  The researcher of the site, Stanley Ellis, later worked with police on analysing the speech in a tape sent to the police during the Yorkshire Ripper investigation, which became known as the Wearside Jack tape because the police switched their investigation to Wearside after Ellis's analysis of the tape.Jack Windsor Lewis, Obituary: Stanley Ellis, The Guardian, 13 November 2009"]}, {"page": "Yorkshire dialect", "response": ["In the fragments of early dialect work, there seems to have been few distinctions across large areas: in the early 14th century, the traditional Northumbrian dialect of Yorkshire showed few differences with the dialect spoken at Aberdeen, now often considered a separate Scots language. The dialect has been widely studied since the 19th century, with an early work by William Stott Banks in 1865 on the dialect of Wakefield,Banks, William Stott (1865), A List of Provincial Words in Use at Wakefield in Yorkshire, WR Hall (Wakefield) and another by Joseph Wright who used an early form of phonetic notation in a description of the dialect of Windhill, near Bradford.Wright, Joseph (1892), A Grammar of the Dialect of Windhill, Truebner & Co, London Significant works that covered all of England include the works of Alexander John Ellis in the mid and late 19th Century, the English Dialect Dictionary around the turn of the 20th century.", "Although Joseph Wright was involved in the Society's foundation, the Society's annual Transactions published one of the first critiques of his work in 1977.  Peter Anderson, then the editor of the Transactions, argued that Wright took much of his material for his work English Dialect Grammar without sufficient citation from the work of Alexander John Ellis, and that Wright did Ellis \"a disservice\" by criticising this same work."]}, {"page": "Andamanese languages", "response": ["One of the first accounts in English of the languages was by the early phonetician Alexander John Ellis, who presented to the Philological Society on the South Andamanese languages on his retirement.  This presentation was later adapted into a Report of Researches into the Language of the South Andaman Island.Appendix in "]}, {"page": "Index of phonetics articles", "response": ["* Alexander John Ellis"]}, {"page": "Alexander Ellis", "response": ["*Alexander John Ellis (1814–1890), English mathematician and philologist"]}, {"page": "Alexander J. Ellis", "response": ["#REDIRECT Alexander John Ellis"]}, {"page": "Alexander Sharpe", "response": ["#REDIRECT Alexander John Ellis"]}, {"page": "Norfolk dialect", "response": ["The study of intonation remains undeveloped in linguistics.  Writing in 1889, the phonetician Alexander John Ellis began his section on East Anglian speech with these comments:"]}, {"page": "Forth and Bargy dialect", "response": ["The dialect of Forth and Bargy was the only dialect in Ireland included in Alexander John Ellis's work On Early English Pronunciation Volume V, which was the earliest survey of dialects of English.  The phonetics of the dialect were taken from a local reverend.page 67 of On Early English Pronunciation, Part V. The existing phonology of English dialects compared with that of West Saxon speech, A.J. Ellis, Truebner & Co, London, 1889 http://www.openlibrary.org/details/onearlyenglishpr00elliuoft"]}, {"page": "Edwin Ellis (poet)", "response": ["Ellis was a son of Alexander John Ellis. He was a long-term friend of John Butler Yeats, sharing an interest in aesthetics, and from 1869 a London studio in Newman Street; but was not on good terms with Susan his wife."]}, {"page": "Scansion", "response": ["Jespersen was not the first to use numerals to mark stress, Alexander John Ellis used them (starting with 0 for least stress) as early as 1873. Nor were W.K. Wimsatt & Monroe Beardsley the first to use multiple slashes: none other than Thomas Jefferson used a 5-level notational system of accents (\"////\" for strongest stress, down to \"/\" for little stress, and no mark for \"no\" stress).Jefferson 1786."]}, {"page": "English-language spelling reform", "response": ["In 1837, Isaac Pitman published his system of phonetic shorthand, while in 1848 Alexander John Ellis published A Plea for Phonetic Spelling. These were proposals for a new phonetic alphabet. Although unsuccessful, they drew widespread interest."]}, {"page": "Dialectology", "response": ["In Britain, the philologist Alexander John Ellis described the pronunciation of English dialects in an early phonetic system in volume 5 of his series On Early English Pronunciation.  The English Dialect Society was later set up by Joseph Wright to record dialect words in the British Isles.  This culminated in the production of the six-volume English Dialect Dictionary in 1905.  The English Dialect Society was then disbanded, as its work was considered complete, although some regional branches (e.g. the Yorkshire Dialect Society) still operate today."]}, {"page": "Alexander J Ellis", "response": ["#REDIRECT Alexander John Ellis"]}, {"page": "History of the International Phonetic Alphabet", "response": ["The International Phonetic Alphabet was created soon after the International Phonetic Association was established in the late 19th century. It was intended as an international system of phonetic transcription for oral languages, originally for pedagogical purposes. The Association was established in Paris in 1886 by French and British language teachers led by Paul Passy. The prototype of the alphabet appeared in . The Association based their alphabet upon the Romic alphabet of Henry Sweet, which in turn was based on the Phonotypic Alphabet of Isaac Pitman and the Palæotype of Alexander John Ellis."]}, {"page": "Salomon de Caus", "response": ["In 1615, he published Les Raisons des forces mouvantes which showed a steam-driven pump similar to one developed by Giovanni Battista della Porta fourteen years earlier. Nevertheless, François Arago called him the inventor of the steam engine as a result. Caus also describes a just-intonation scale,David J. Benson, Music: a mathematical offering now known as the Ellis Duodene, after Alexander John Ellis who reinvented it. Caus was one of the first to employ the term work in the sense that it is used in the modern field of mechanics."]}, {"page": "Manx English", "response": ["Manx English has been unusually well-researched. In the 19th century, Kirk Christ and Kirk Patrick were covered by surveyors working for Alexander John Ellis's work On Early English Pronunciation. In the 20th century, sites on the Isle of Man were covered by both the Survey of English Dialects and the Linguistic Survey of Scotland. The two sites for the former were Andreas and Ronague; the recordings of the local dialects are now accessible for free online via the British Library.Andreas https://sounds.bl.uk/Accents-and-dialects/Survey-of-English-dialects/021M-C0908X0010XX-0500V1 Ronague https://sounds.bl.uk/Accents-and-dialects/Survey-of-English-dialects/021M-C0908X0011XX-0200V1"]}, {"page": "Francisco de Salinas", "response": ["The 19th-century musicologist Alexander John Ellis maintained that Salinas really meant to characterize 1/6-comma meantone, and made a mistake due to his blindness. Others point out that Salinas's descriptions of his tuning as \"languid\" but not \"offensive to the ear\" seem to apply to 1/3-comma meantone, not to 1/6-comma meantone, which in any case has a much sharper fifth than musicians of Salinas's own time preferred."]}, {"page": "Allexander Ellis", "response": ["#REDIRECT Alexander John Ellis"]}, {"page": "Allexander ellis", "response": ["#REDIRECT Alexander John Ellis"]}, {"page": "Septimal minor third", "response": ["In music, the septimal minor third , also called the subminor third (e.g., by EllisAlexander John Ellis, in his translation of Hermann L. F Von Helmholtz (2007). On the Sensations of Tone, p.195. .Alexander J. Ellis, \"Notes of Observations on Musical Beats\", June 17, 1880, Proceedings of the Royal Society of London, p. 531 ()), is the musical interval exactly or approximately equal to a 7/6 ratio of frequencies.Partch, Harry (1979). Genesis of a Music, p.68. . In terms of cents, it is 267 cents, a quartertone of size 36/35 flatter than a just minor third of 6/5. In 24-tone equal temperament five quarter tones approximate the septimal minor third at 250 cents (). A septimal minor third is almost exactly two-ninths of an octave, and thus all divisions of the octave into multiples of nine (72 equal temperament being the most notable) have an almost perfect match to this interval. The septimal major sixth, 12/7, is the inverse of this interval."]}]}}