{"wiki_id": "http://www.wikidata.org/entity/Q6217190", "itemLabel": "George Turpin", "itemDescription": "boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Turpin", "wikipedia_page": {"main": "George Turpin  (born 10 January 1952 in Liverpool) is an Olympic medallist and former bantamweight boxer from the United Kingdom. He won a bronze medal at the 1972 Summer Olympics.", "link_mentions": [{"page": "Liverpool", "response": ["Boxing is massively popular in Liverpool. The city has a proud heritage and history in the sport and is home to around 22 amateur boxing clubs, which are responsible for producing many successful boxers, such as Nel Tarleton, Alan Rudkin, John Conteh, Andy Holligan, Liam Smith, Paul Hodkinson, Tony Bellew and David Price. The city also boasts a consistently strong amateur contingent which is highlighted by Liverpool being the most represented city on the GB Boxing team, as well as at the 2012 London Olympics, the most notable Liverpool amateur fighters include; George Turpin, Tony Willis, Robin Reid and David Price who have all medalled at the Olympic Games. Boxing events are usually hosted at the Echo Arena and Liverpool Olympia within the city, although the former home of Liverpool boxing was the renowned Liverpool Stadium."]}, {"page": "Jim Watt (boxer)", "response": ["|align=left| George Turpin"]}, {"page": "List of people from Merseyside", "response": ["* George Turpin: Boxer, who won a bronze medal at the 1972 Summer Olympics"]}, {"page": "Republic of China at the 1972 Summer Olympics", "response": [":# 1/8-Final - lost to George Turpin of Great Britain"]}, {"page": "Great Britain at the 1972 Summer Olympics", "response": ["* George Turpin — Boxing, Men's Bantamweight"]}, {"page": "Turpin", "response": ["* George Turpin (born 1952), English boxer and 1972 Olympic bronze medalist"]}, {"page": "1952 in the United Kingdom", "response": ["* 10 January – George Turpin, English boxer"]}, {"page": "Orlando Martínez", "response": ["Orlando Martínez (September 2, 1944Cuban sources report his year of birth: 1946 – September 22, 2021Fallece primer monarca olímpico del boxeo cubano ) was a Cuban bantamweight boxer, who won the gold medal at the 1972 Summer Olympics. Three years later he captured the gold at the 1975 Pan American Games. Orlando was awarded a hotly disputed 3–2 split decision over Great Britain's George Turpin in the 1972 Munich Olympics semifinal before coasting to a comfortable points win over future professional world bantamweight champion Alfonso Zamora in the final to win the division's gold medal.", "* Semifinal: Defeated George Turpin (Great Britain) by decision, 3–2"]}, {"page": "GB Boxing", "response": ["| George Turpin ||  ENG || Bantamweight || BRONZE"]}, {"page": "Boxing in Liverpool", "response": ["=== George Turpin ===", "George Turpin won a bronze medal at the 1972 Munich Olympics in the 56 kg division."]}, {"page": "Boxing at the 1972 Summer Olympics – Bantamweight", "response": ["| 3T || align=\"left\"| George Turpin || align=\"left\"| ", "* George Turpin (GBR) def. Pierre Amont N'diaye (SNG), 5:0", "* George Turpin (GBR) def. Chee Yen Wang (TPE), 5:0", "* George Turpin (GBR) def. John Mwaura Nderu (KEN), 4:1", "* Orlando Martínez (CUB) def. George Turpin (GBR), 3:2"]}, {"page": "Pierre Amont N'Diaye", "response": ["Pierre Amont N'Diaye (born 21 April 1944) is a Senegalese boxer. He competed in the men's bantamweight event at the 1972 Summer Olympics. At the 1972 Summer Olympics, he lost to George Turpin of Great Britain."]}, {"page": "England Boxing National Amateur Championships Bantamweight Champions", "response": ["|1971 || George Turpin ||(Golden Gloves ABC)", "|1972 || George Turpin ||(Golden Gloves ABC)"]}, {"page": "Turpin, George", "response": ["#redirectGeorge Turpin"]}]}}