{"wiki_id": "http://www.wikidata.org/entity/Q6210144", "itemLabel": "Joe Guy", "itemDescription": "English cricketer (1813-1873)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Guy_(cricketer)", "wikipedia_page": {"main": "Joseph Guy (30 July 1813 – 15 April 1873) was an English professional cricketer who played first-class cricket from 1837 to 1854.\nA right-handed batsman and occasional wicket-keeper who was mainly associated with Nottinghamshire, he made 149 known appearances in first-class matches.  He represented the Players in the Gentlemen v Players series and was an original member of William Clarke's All-England Eleven.  He also played for Hampshire.\nGuy was a great stylist as a batsman and Clarke said of him: \"Elegance, all elegance, fit to play before the Queen in her parlour.\"Guy scored 3395 runs in his first-class career at 13.41 with a top score of 98 from eight half-centuries.  He took 102 catches and completed 14 stumpings.\n\n", "link_mentions": [{"page": "History of English cricket (1816–1863)", "response": ["Social conditions, including the railways, were a key factor in the creation of the travelling All-England Eleven (AEE). The team was founded in Nottingham by William Clarke. The first AEE match was at Sheffield in September and they played others in Manchester and Leeds. The original AEE team was: William Clarke, Jemmy Dean, William Dorrinton, Fuller Pilch, Alfred Mynn, Joe Guy, Will Martingell, Tom Sewell, G Butler, VC Smith and William Hillyer. Other players who represented the AEE in its early days included George Parr, William Lillywhite, Nicholas Felix, William Denison, Thomas Box and OC Pell."]}, {"page": "Non-international England cricket teams", "response": ["The name \"All-England\" took on a specific meaning in 1846 when William Clarke's All-England Eleven, commonly known as the AEE, was founded as a touring team of leading players, its purpose being to take advantage of the new railway network and play matches at city venues, mainly in the North of England. Clarke's team was indeed a top-class side worthy of its title as, in 1846, it consisted of himself, Joe Guy (cricketer), George Parr (all of Nottinghamshire), William Lillywhite, Jemmy Dean (both Sussex), William Denison, Will Martingell (both Surrey), Fuller Pilch, Alfred Mynn, Nicholas Wanostrocht (aka \"Felix\") and William Hillyer (all Kent). Their matches in Sheffield, Manchester and Leeds were a huge success and very profitable, especially for Clarke himself who was careful to pay his players more than Marylebone Cricket Club (MCC) did (from £4 to £6 per week) and so keep them interested. He kept the surplus for himself."]}, {"page": "North v South", "response": ["* 1 – Arthur Rich, Daniel Hayward, Edward Grimston, Frederick Ponsonby, Henry Hall, John Bayley, John Gibson, Joe Guy, John Wenman, Thomas Heath, William Clarke, William Dorrinton, William Ward, Will Caldecourt"]}, {"page": "List of English cricketers (1826–1840)", "response": ["|Joe Guy"]}, {"page": "List of English cricketers (1841–1850)", "response": ["|Joe Guy"]}, {"page": "List of Nottingham Cricket Club players", "response": ["|Joe Guy"]}, {"page": "Joe Guy", "response": ["Joe Guy may refer to:", "*Joe Guy (cricketer) (1813–1873), English cricketer", "*Joe Guy (musician) (1920–1962), American jazz trumpeter"]}]}}