{"wiki_id": "http://www.wikidata.org/entity/Q621028", "itemLabel": "Malcolm Campbell", "itemDescription": "English racing driver and speed record holder", "wikipedia_url": "https://en.wikipedia.org/wiki/Malcolm_Campbell", "wikipedia_page": {"main": "Major Sir Malcolm Campbell  (11 March 1885 – 31 December 1948) was a British racing motorist and motoring journalist. He gained the world speed record on land and on water at various times, using vehicles called Blue Bird, including a 1921 Grand Prix Sunbeam. His son, Donald Campbell, carried on the family tradition by holding both land speed and water speed records.", "link_mentions": [{"page": "December 31", "response": ["*1948 – Malcolm Campbell, English racing driver and journalist (b. 1885)"]}, {"page": "Donald Campbell", "response": ["Donald Malcolm Campbell,  (23 March 1921 – 4 January 1967) was a British speed record breaker who broke eight absolute world speed records on water and on land in the 1950s and 1960s. He remains the only person to set both world land and water speed records in the same year (1964). He died during a water speed record attempt at Coniston Water in the Lake District, England.", "Donald Campbell was born at Canbury House, Kingston upon Thames, Surrey,Donald Campbell: The Man Behind The Mask, David Tremayne, Bantam Press, London, 2004. the son of Malcolm, later Sir Malcolm Campbell, holder of 13 world speed records in the 1920s and 1930s in the Bluebird cars and boats, and his second wife, Dorothy Evelyn née Whittall.GRO Register of Births: JUN 1921 2a 815 KINGSTON — Donald M. Campbell, mmn = Whittall", "The story of Campbell's last attempt at the water speed record on Coniston Water was told in the BBC television film Across the Lake in 1988, with Anthony Hopkins as Campbell. Nine years earlier, Robert Hardy had played Campbell's father, Sir Malcolm Campbell, in the BBC2 Playhouse television drama \"Speed King\"; both were written by Roger Milner and produced by Innes Lloyd. In 2003, the BBC showed a documentary reconstruction of Campbell's fateful water-speed record attempt in an episode of Days That Shook the World. It featured a mixture of modern reconstruction and original film footage. All of the original colour clips were taken from a film capturing the event, Campbell at Coniston by John Lomax, a local amateur filmmaker from Wallasey, England. Lomax's film won awards worldwide in the late 1960s for recording the final weeks of Campbell's life."]}, {"page": "July 21", "response": ["*  1925   – Malcolm Campbell becomes the first man to exceed  on land. At Pendine Sands in Wales, he drives Sunbeam 350HP built by Sunbeam at a two-way average speed of . "]}, {"page": "March 11", "response": ["*1885 – Malcolm Campbell, English race car driver (d. 1948)"]}, {"page": "September 3", "response": ["*1935 – Sir Malcolm Campbell reaches a speed of 304.331 miles per hour on the Bonneville Salt Flats in Utah, becoming the first person to drive an automobile over 300 mph."]}, {"page": "1948", "response": ["* December 31 – Sir Malcolm Campbell, English land, water racer (b. 1885)"]}, {"page": "1885", "response": ["* March 11 – Sir Malcolm Campbell, English land, water racer (d. 1948)"]}, {"page": "1925", "response": ["** Malcolm Campbell becomes the first man to exceed  on land. At Pendine Sands in Wales, he drives Sunbeam 350HP built by Sunbeam at a two-way average speed of ."]}, {"page": "1935", "response": ["* September 3 – Sir Malcolm Campbell becomes the first person to drive an automobile at 300 miles per hour in Blue Bird, establishing a new absolute land speed record of  on the Bonneville Salt Flats in Utah."]}, {"page": "Tazio Nuvolari", "response": ["Nuvolari was mentioned in 1969 comedy film Monte Carlo or Bust! when Angelo Pincilli and Marcelo Agosti, two Italian policemen taking part in the Monte Carlo Rally, hope to become as famous as Nuvolari and land speed record holder Malcolm Campbell by winning the race."]}, {"page": "Beaulieu, Hampshire", "response": ["* Sir Malcolm Campbell's 1920 Sunbeam 350hp"]}, {"page": "Chislehurst", "response": ["* Malcolm Campbell, former land and water speed record holder, was born in Chislehurst and is buried in St. Nicholas Parish Church"]}, {"page": "The Wash", "response": ["In 1934 a proposal was made, supported by racing driver Malcolm Campbell, to build a  race track on reclaimed land from Boston to Gibraltar Point, near Skegness. It would have been used as a road to Skegness when there was no racing. There was also to be a long lake for boat racing inside the track loop. The financial straits in the 1930s prevented the project from proceeding."]}, {"page": "Daytona Beach, Florida", "response": ["Daytona's wide beach of smooth, compacted sand attracted automobile and motorcycle races beginning in 1902, as pioneers in the industry tested their inventions. It hosted land speed record attempts beginning in 1904, when William K. Vanderbilt set an unofficial record of .Kettlewell, Mike. \"Daytona\", in Northey, Tom, ed. World of Automobiles (London: Orbis, 1974), Volume 5, p.501. Land speed racers from Barney Oldfield to Henry Segrave to Malcolm Campbell would visit Daytona repeatedly and make the  beach course famous.Kettlewell, pp.501–2; Northey, Tom, \"Land-speed  record: The Fastest Men on Earth\", in Northey, Tom, ed. World of Automobiles, Volume 10, pp.1161–1165. Record attempts, including numerous fatal endeavors such as Frank Lockhart (Stutz Black Hawk, 1928) and Lee Bible (Triplex Special, 1929), would continue until Campbell's March 7, 1935 effort, which set the record at  and marked the end of Daytona's land speed racing days.Northey, p.1165."]}, {"page": "Brooklands", "response": ["*Sir Malcolm Campbell (racing driver) "]}, {"page": "Land speed record", "response": ["|September 25, 1924|| Pendine, United Kingdom|| Malcolm Campbell||Sunbeam 350HP ||Internal combustion: V12 Sunbeam aero engine", "|First land speed record by Malcolm Campbell", "|July 21, 1925|| Pendine, United Kingdom|| Malcolm Campbell||Sunbeam 350HP||Internal combustion: V12 Sunbeam aero engine", "|February 4, 1927|| Pendine, United Kingdom|| Malcolm Campbell||Napier-Campbell Blue Bird||Internal combustion: W12 Napier Lion aero engine", "|February 19, 1928|| Daytona Beach, United States|| Malcolm Campbell||Napier-Campbell Blue Bird||Internal combustion: W12 Napier Lion aero engine ||206.956||333.048|| || || ", "|February 5, 1931 || Daytona Beach, United States|| Malcolm Campbell ||Campbell-Napier-Railton Blue Bird ||Internal combustion: W12 Napier Lion supercharged aero engine||246.09||396.025|| || ||Campbell was knighted for this effort", "|February 24, 1932 || Daytona Beach, United States|| Malcolm Campbell ||Campbell-Napier-Railton Blue Bird ||Internal combustion: W12 Napier Lion supercharged aero engine||253.97||408.73|| || || First  pass.", "|February 22, 1933 || Daytona Beach, United States|| Malcolm Campbell ||Campbell-Railton Blue Bird ||Internal combustion: V12 Rolls-Royce R supercharged aero engine||272.46||438.48|| || || ", "|March 7, 1935 || Daytona Beach, United States|| Malcolm Campbell ||Campbell-Railton Blue Bird ||Internal combustion: V12 Rolls-Royce R supercharged aero engine||276.816||445.472|| || || ", "|September 3, 1935 || Bonneville Salt Flats, United States|| Malcolm Campbell ||Campbell-Railton Blue Bird ||Internal combustion: V12 Rolls-Royce R supercharged aero engine||301.129||484.598|| || || First  pass, first absolute record set at Bonneville"]}, {"page": "D. Napier & Son", "response": ["When Napier was no longer in racing, its Lion aero engine was used by several land speed record contestants: Malcolm Campbell's Napier-Campbell Blue Bird of 1927 and Campbell-Napier-Railton Blue Bird of 1931, Segrave's Golden Arrow of 1929, and John Cobb's Napier-Railton and Railton Mobil Special, which held the record from 1939 to 1964.", "The Lion was by now becoming a best-seller for the company, which eventually dropped all the other aero-engines. The Lion went on to be adapted for land and water, to set the land speed record in Malcolm Campbell's Napier-Campbell Blue Bird of 1927 and Campbell-Napier-Railton Blue Bird of 1931 and Henry Segrave's Golden Arrow of 1931 and later in John Cobb's Napier-Railton and Railton Mobil Special, which held the record from 1939 to 1964."]}, {"page": "AVUS", "response": ["The competition on 22 May 1932 saw further notable participants like the Earl Howe, Hans Stuck and Sir Malcolm Campbell. The Czechoslovak driver, Prince George Christian of Lobkowicz, died when his Bugatti Type 54 crashed in the southern hairpin. The following events were won by Achille Varzi (1933) and Guy Moll (1934), to the great annoyance of the new Nazi rulers, who declared the victory of German drivers and cars a matter of national pride. They strongly backed the construction of the new Silver Arrows (Silberpfeile) generation of Mercedes-Benz and Auto Union."]}, {"page": "British Union of Fascists", "response": ["* Malcolm Campbell was a racing motorist and motoring journalist."]}, {"page": "1933 in sports", "response": ["* February 22 - Malcolm Campbell sets world land speed record speed of 272.46 mph driving his famous Blue Bird car at Daytona Beach, Florida"]}, {"page": "Weybridge", "response": ["The world's first purpose-built racing circuit was constructed at Brooklands in 1907. The track hosted the first British Grand Prix in 1926 and was used by Malcolm Campbell to develop his final land speed record car, Campbell-Railton Blue Bird. Throughout the 20th century, Brooklands was an important location for the aerospace industry and aircraft developed and tested there included the Sopwith Camel, the Wellington bomber and the Hurricane fighter. Vickers established a factory at the circuit in 1915 and aircraft manufacturing continued at the site until 1988.", "Motor racing ceased for the duration of the First World War and did not resume until 1920. The first two British Grands Prix took place at the circuit in 1926 and 1927. The JCC 200 Mile race also took place at the circuit from 1921 to 1928, and again in 1938. In the early 1930s, Malcolm Campbell developed the Campbell-Railton Blue Bird, his final land speed record car, at Brooklands. Racing ceased for a second time at the outbreak of the Second World War."]}, {"page": "Grand Prix motor racing", "response": ["* Malcolm Campbell - Great Britain"]}, {"page": "George Formby", "response": ["Bell-Bottom George was described 60 years later by the academic Baz Kershaw as being \"unashamedly gay and ... peppered with homoerotic scenes\"; Bret concurs, and notes that \"the majority of the cast and almost every one of the male extras was unashamedly gay\", The film was a hit with what Bret describes as Formby's \"surprisingly large, closeted gay following\". The reviewer for The Manchester Guardian was impressed with the film, and wrote that \"there is a new neatness of execution and lightness of touch about this production ... while George himself can no longer be accused of trailing clouds of vaudevillian glory\". The reviewer also considered Formby \"our first authentic and strictly indigenous film comedian\". After completing filming, the Formbys undertook a further ENSA tour. Although Dean personally disliked the Formbys, he greatly admired the tireless work they did for the organisation. In August Formby undertook a 53-day tour in a significant portion of the Mediterranean, including Italy, Sicily, Malta, Gibraltar, Libya, Tunisia, Egypt, Lebanon and Palestine; visiting 750,000 troops in thirteen countries, touring  in the process and returning to England in October. The couple travelled around the countryside in a Ford Mercury that Formby had purchased from the racing driver Sir Malcolm Campbell, which had been converted to sleep two in the back."]}, {"page": "Coniston Water", "response": ["In the 20th century Coniston Water was the scene of many attempts to break the world water speed record. On 19 August 1939 Sir Malcolm Campbell set the record at 141.74 miles per hour () in Blue Bird K4. Between 1956 and 1959 Sir Malcolm's son Donald Campbell set four successive records on the lake in Bluebird K7, a hydroplane; in 1967 he was killed just after achieving a speed of over 320 miles per hour () in Bluebird K7 in a record-breaking attempt."]}, {"page": "Jack Vettriano", "response": ["In 1996 Sir Terence Conran commissioned Vettriano to create a series of paintings for his new Bluebird Gastrodome in London. The seven paintings, inspired by the life of Sir Malcolm Campbell, hung there for ten years. Heartbreak Publishing, Vettriano's own publishing company, produced a boxed set featuring signed, limited-edition prints of all seven paintings to mark the 75th anniversary of Sir Malcolm Campbell's final World Land Speed Record. The Bluebird paintings were auctioned by Sotheby's at the Gleneagles Hotel in Perthshire on 30 August 2007, and made more than £1m in all: the most expensive was Bluebird at Bonneville, bought for £468,000."]}, {"page": "Pendine", "response": ["Malcolm Campbell and J. G. Parry-Thomas set the world land speed record five times between 1924 and 1927. Parry-Thomas was killed while making a final record-breaking attempt on Pendine Sands in 1927. For part of the summer the Pendine Museum of Speed has, Parry-Thomas' restored car Babs on display. Carmarthenshire Land Sailing Club is allowed to use the beach for wind-traction activities, including land sailing, kite buggying and kite landboarding."]}, {"page": "Sir Malcolm Campbell", "response": ["#redirect Malcolm Campbell"]}, {"page": "RAF Elvington", "response": ["On 3 October 1970 Tony Densham, driving the Ford-powered \"Commuter\" dragster, set the Official outright wheel driven record at Elvington by averaging  over the flying kilometre course.The Guardian, 5 October 1970, Page 6; The Times, 5 October 1970. This broke Malcolm Campbell's record set 43 years previously at Pendine Sands."]}, {"page": "Pendine Sands", "response": ["The first person to use Pendine Sands for a world land speed record attempt was Malcolm Campbell. On 25 September 1924 he set a world land speed record of 146.16 mph (235.22 km/h) on Pendine Sands in his Sunbeam 350HP car Blue Bird.", "In June 2000 Don Wales, grandson of Malcolm Campbell and nephew of Donald Campbell, set the United Kingdom electric land speed record at Pendine Sands in Bluebird Electric 2, achieving a speed of 137 mph (220 km/h).", "On 7 May 2015, Idris Elba broke the historic 'flying mile' UK land speed record, originally set by Malcolm Campbell, in a Bentley Continental GT Speed. The recorded speed was 180.361 mph.thumb|right|Sunbeam 350HP at Pendine Sands in Wales on the 90th anniversary of Sir Malcolm Campbell's land speed record.", "On 21 July 2015 at Pendine beach the 90th anniversary of Sir Malcolm Campbell's first world land speed record in ‘Bluebird’ was recreated by his grandson, Don Wales, also a land speed record holder, in the fully restored car. Commenting on the restoration appeal Wales said: \"This beautiful car has been lovingly restored and looked after by Doug Hill and the team and it's only right that such an iconic car deserves to have the final pieces in place to complete her!\"' The new gearbox will be part of a long term project to restore the car to its 1925 specifications. This would also require the fabrication of two full-length exhaust pipes, a new seat and upholstery, and the re-manufacture of a slightly dropped nose cone and rear wheel spats."]}, {"page": "Coombe, Kingston upon Thames", "response": ["* Malcolm Campbell, racing driver and former holder of the world land speed record lived at the junction of Kingston Hill and Warboys Approach.", "* Donald Campbell, son of Malcolm Campbell and former holder of the world water speed record lived in the same house as his father on Kingston Hill."]}, {"page": "Sunbeam Motor Car Company", "response": ["He also built a Brooklands racer with a purpose-built V12 18.3-litre engine whose design was a hybrid of the Sunbeam Manitou and the Sunbeam Arab aero engines. This engine had four blocks of three cylinders arranged in two banks set at 60 degrees (unlike the Arab which were set at 90 degrees). Each cylinder had one inlet and two exhaust valves actuated by a single overhead camshaft. The two camshafts were driven by a complex set of 16 gears from the front of the crankshaft – a similar arrangement to that used on the Maori engine which had two OHC per bank of cylinders. This famous car (Sunbeam 350HP) established three Land Speed Records, the first achieved by Kenelm Lee Guinness at Brooklands in 1922 with a speed of 133.75 mph. Malcolm Campbell then purchased the car, had it painted in his distinctive colour scheme, named it Blue Bird and in September 1924 achieved a new record speed of 146.16 mph at Pendine Sands in South Wales, raising it the following year to 150.76 mph. The same year Coatalen's new 3-litre Super Sports came 2nd at Le Mans, beating Bentley – this was the first production twin-cam car in the world. In 1926 Segrave captured the LSR in a new 4-litre V12 Sunbeam racer originally named Ladybird and later renamed Tiger. Coatalen decided to re-enter the LSR field himself, building the truly gigantic Sunbeam 1000HP powered by two  Matabele engines. On 29 March 1927 the car captured the speed record at . The car is now at the National Motor Museum, Beaulieu, UK."]}, {"page": "International Motorsports Hall of Fame", "response": ["A total of 145 individuals were inducted during the period the hall of fame was active in most years from 1990 to 2013. The 20 inaugural members, Buck Baker, Jack Brabham, Malcolm Campbell, Jim Clark, Mark Donohue, Juan Manuel Fangio, France Sr., Graham Hill, Tony Hulman, Junior Johnson, Parnelli Jones, Stirling Moss, Barney Oldfield, Lee Petty, Fireball Roberts, Jackie Stewart, Mickey Thompson, Bobby Unser, and Smokey Yunick, were inducted in 1990. There were three women who were added to the hall of fame. In 1999, Louise Smith, a NASCAR driver during the 1940s and 1950s, became the first woman to be inducted into the hall of fame; the two other female inductees were multiple NHRA Top Fuel dragster champion Shirley Muldowney in 2004, and Janet Guthrie, who was inducted two years later. Wendell Scott, the first African American driver to win a NASCAR Cup Series event in December 1963, was the first African American to be inducted into the hall of fame in 1999. No one was added in each of 1995 and 2010 and nobody has been inducted since 2014. "]}, {"page": "English Racing Automobiles", "response": ["A new chassis was conceived by British designer Reid Railton (who had also successfully designed the Bluebird land speed record cars for Malcolm Campbell) and was constructed by Thomson & Taylor at Brooklands. The engine was based on the well-proven Riley six-cylinder unit, albeit this was modified in a number of significant ways. A stronger forged crankshaft with a large centre Hyatt roller bearing was made and an entirely new aluminium cylinder head designed. The engine was supercharged using a bespoke supercharger designed by Murray Jamieson who had worked with Mays and Berthon on the White Riley. The ERA engine was designed around three capacities— a base 1488cc for the 1500cc racing class, one of 1088cc for the 1100cc class and also was capable of being expanded up to 1980cc for the 2000cc class.RILEY MOTOR CARS -ERA Specifications rileyrob.co.uk, accessed 11 July 2019 It ran on methanol and in its 1500cc form was capable of producing around 180–200 bhp and in excess of 250–275 bhp in 2000cc form."]}, {"page": "Giuseppe Campari", "response": ["The 1928 season saw Giuseppe Campari win his second consecutive Coppa Acerbo and his first at the Mille Miglia. He earned a second-place finish in the Targa Florio, a race he entered several times and although he frequently finished near the top, he never managed a win. The following year he repeated as champion at the Mille Miglia and along with top drivers such as Malcolm Campbell and Rudolf Caracciola, he traveled to Ireland to compete in the inaugural Irish International Grand Prix at Phoenix Park in Dublin. Run in front of more than 100,000 spectators, Campari was hit in the eye by a flying small rock but was successfully treated in hospital and the race was won by the Russian émigré, Boris Ivanowski. Campari also raced in the Tourist Trophy Races at the Ards course in Belfast where he finished second to Caracciola's Mercedes."]}, {"page": "Saltburn-by-the-Sea", "response": ["*Speed record breaker Sir Malcolm Campbell set his first speed record (138.08 mph, unofficial) while driving Blue Bird on Saltburn Sands on 17 June 1922."]}, {"page": "J. G. Parry-Thomas", "response": ["In partnership with another engineer, Major Ken Thomson from New Zealand, he started Thomas Inventions Development Co., based inside the Brooklands circuit itself. After his death, this company became Thomson & Taylor and went on to build such cars as Malcolm Campbell's Blue Bird. From 1923 he lived in the \"flying village\" there, in a bungalow converted from a First World War hut named The Hermitage. It was an ascetic life, shared only with two Alsatian dogs and his cars, in stark contrast to the hedonism of the Bentley Boys. Parry-Thomas achieved some success on the circuit, winning 38 races in five seasons and setting numerous records.", "During the winter of 1926/7 Babs was fitted with yet another new body, partially enclosing the drive and rear wheels by fairings. Parry-Thomas was killed at Pendine Sands on 3 March 1927 while trying to regain his own world land speed record that had been broken just weeks earlier by Malcolm Campbell on the same beach. At the time of the accident it was thought that the right-hand chain had broken and had hit Thomas, causing a fatal head injury as the car was rolling."]}, {"page": "Water speed record", "response": ["Wood's last record would be one of the final records for a conventional, single-keel boat. In June 1937 Malcolm Campbell, the world-famous land speed record breaker, drove Blue Bird K3 to a new record of  at Lake Maggiore. Compared to the massive Miss America X, K3 was a much more compact craft. It was 5 metres shorter and had one engine to X's four.", "The renewed American success persuaded Malcolm Campbell's son, Donald, who had already driven Blue Bird K4 to within sight of his father's record, to make a further push for the record. However, Blue Bird K4 was by now 12 years old, with a 20-year-old engine, and Campbell struggled to reach the speeds of the Seattle-built boat. In late 1951, it was written off after suffering a structural failure at  on Coniston Water.", "||  || Blue Bird K4 ||  Malcolm Campbell || Coniston Water || 19 August 1939", "||  || Blue Bird K3 ||  Malcolm Campbell || Hallwilersee || 17 September 1938", "||  || Blue Bird K3 ||  Malcolm Campbell || Lake Maggiore || 2 September 1937", "||  || Blue Bird K3 ||  Malcolm Campbell || Lake Maggiore || 1 September 1937"]}, {"page": "Sammy Davis (racing driver)", "response": ["Davis was born in South Kensington, London on 9 January 1887, the son of Edwin and Georgina Davis, his father was a merchant and tea importer. He was educated at Westminster School and University College London. While at school, he met Malcolm Campbell, and the duo were involved in a \"spectacular pile-up\" with a borrowed penny-farthing bicycle.Wise, David Burgess. \"Davis: The Grand Old Man of Motor Racing\", in Northey, Tom, ed. World of Automobiles (London: Orbis, 1974), Volume 5, p.499. In 1906 Davis became an apprentice with the Daimler Company. Training as a draughtsman, he became involved with the design of various products, from the Daimler-Renard Road Train to Daimler's team of cars in the 1907 Kaiserpreis race.Wise, p.499. In 1910, he joined the staff of Automobile Engineer, just then being launched by Iliffe (also publishers of The Autocar) as a technical illustrator and was by 1912 also a writer and sub-editor. At the start of the First World War he joined the Royal Naval Air Service and served in France with armoured car section. Following his demobilisation he became sports editor of The Autocar although he also served in the Second World War in the Royal Electrical and Mechanical Engineers."]}, {"page": "Science and invention in Birmingham", "response": ["By 1927 Dunlop tyres have already helped Malcolm Campbell reach a British land speed record and in this year, they help Henry Segrave achieve the world land speed record in a Sunbeam 1000 hp at Daytona Beach Road Course, USA. In 1931 Dunlop tyres help Malcolm Campbell achieve a new land speed record in a Blue Bird at Daytona Beach Road Course, USA. In 1935 Dunlop helps Malcolm Campbell achieve yet another new land speed record in the USA. Foam rubber is also invented at the Dunlop Latex Development Laboratories, Fort Dunlop in 1929. Dunlop continues to pioneer advances in tyre manufacture and becomes industry standard for many prestigious car makers and its tyres have been used, and continue to be used, on cars achieving victory in motor rallies and racing championships such as Formula 1 and touring."]}, {"page": "Charlwood", "response": ["* Sir Malcolm Campbell, father of Donald, lived at Povey Cross House, in Hookwood"]}, {"page": "Bonneville Speedway", "response": ["The salt flats were first used for motor sports in 1912, but did not become truly popular until the 1930s when Ab Jenkins and Sir Malcolm Campbell competed to set land speed records.", "| 1935 || Sir Malcolm Campbell || Blue Bird ||301.129||484.620 ||  [data needed] || "]}, {"page": "Putney Vale", "response": ["In 1919 Guinness sold the firm's distribution rights to S. Smith & Sons. In the inter-war years KLG sparking plugs made at Putney Vale were used in the majority of British cars. This included Henry Segrave's Golden Arrow and Malcolm Campbell's Blue Bird series, which set world land speed records. In 1927 Smith & Sons bought KLG and in the 1930s built a new spark plug factory, in an art deco style, on the Putney Vale site. The factory was demolished in 1989 and replaced by an Asda superstore. Asda donated the old factory gates, bearing the KLG logo, to the Brooklands Motor Museum.Staines & Ashford News. 'Museum gets KLG gates.' 16 February 1989, page 8."]}, {"page": "Bill France Sr.", "response": ["France was familiar with Daytona Beach's land speed record history when he moved his family from Washington D.C. to Daytona in the spring of 1935 to escape the Great Depression. He had less than $100 in his pocket when they left D.C.WestEgg.com Inflation calculator  He began painting houses, then worked at a local car dealership. He set up a car repair shop in Daytona at 316 Main Street Station, still in existence today as an event and entertainment venue. Malcolm Campbell and other land speed record competitors decided to stop competing for land speed records at Daytona in favor of the Bonneville Salt Flats later in 1935 because the track was getting too rutted.Fleischman, page 4 Daytona had lost its claim to fame. City officials were determined to keep speed-related events, events which had been a mid-winter source of revenue for area hotels and restaurants."]}, {"page": "List of sports rivalries", "response": ["|  Malcolm Campbell|| Henry Segrave||Land speed record|| 1926—1930 || ||"]}, {"page": "Coats Mission", "response": ["* Military Police from the Provost Company of the 1st London Division for escort and traffic control, commanded by Captain Sir Malcolm Campbell, MBE. At Campbell's suggestion they were equipped with fast Norton International Model 30 racing motorcycles rather than the standard military Norton WD16H of the era."]}]}}