{"wiki_id": "http://www.wikidata.org/entity/Q6218678", "itemLabel": "John Alfred Gotch", "itemDescription": "British architect and historian", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Alfred_Gotch", "wikipedia_page": {"main": "John Alfred Gotch (28 September 1852, Kettering, Northamptonshire – 17 January 1942, Kettering, Northamptonshire) was a noted English architect and architectural historian. His brother was the Pre-Raphaelite painter and illustrator Thomas Cooper Gotch, who painted his portrait. Married to Annie Gotch, one of their sons, Roby Myddleton Gotch was killed in action during the First World War aged 26.John Gotch attended Kettering Grammar School and later studied at the University of Zürich and at King's College London.In 1879 Gotch set up a private architectural practice in Kettering which developed into Gotch & Saunders by entering into partnership with Charles Saunders in 1887. They were later joined by Henry Ralph Surridge and they jointly retired in 1938. The practice still exists as Gotch, Saunders & Surridge LLP, or GSSArchitecture.In Kettering, Gotch was responsible for the design and construction of shoe factories, warehouses, houses, shops, offices, banks, hospitals, schools, public houses, sports venues, entertainment venues and a temperance hall. The Practice was also responsible for the design of several First World War memorials, and the alteration and expansion of numerous historic country houses, for example, Madingley Hall, now the Institute of Continuing Education, part of the University of Cambridge. Following the end of the War, Gotch's practice designed and built over 140 branches of Midland Bank and, in association with Edwin Lutyens, Gotch designed the interior of the Bank's former headquarters in Poultry, London which is considered an Art Deco icon. The building is now owned by Soho House and was opened as The Ned in 2017.As well as designing many buildings Gotch had an interest in Elizabethan and Jacobean architecture, and became a national authority on the subject through his writing. He was the author of nine books in this field (two of which were reissued), as well as editor of a book on the history of the Royal Institute of British Architects (RIBA). In her dissertation for the Courtauld Institute of Art in the 1930s the art historian Margaret Whinney questioned an earlier assertion made by Gotch in 1912 regarding the reassignment of drawings from Inigo Jones, who Gotch wrote on extensively, to John Webb. ’While Whinney agreed that the drawing was not Jones', she proved, using new evidence, that the Webb sketches had come from original designs by Jones’.Apart from his renown as an architectural historian, he also achieved eminence as a public figure and representative of the architectural profession.\nHe was President of the Architectural Association in 1886-7, Vice-President of the Royal Institute of British Architects (RIBA) in 1914-9, and President of RIBA in 1923-5: the first provincial architect to be appointed president since the formation of the Institute in 1834. In addition, he was Vice-President of the Society of Antiquaries, a founder member of the Royal Fine Art Commission, a Trustee of the Soane Museum, and President of the Northamptonshire Association of Architects in 1911-22. In 1924 he received an honorary M.A. degree from the University of Oxford. John Alfred Gotch was appointed the first Charter Mayor of Kettering in 1938.  In 2018 a blue plaque in honour of the architect, often cited as 'the man who built Kettering', was unveiled on the former Midland Bank building that he designed in Kettering High Street.RIBA has an archive of Gotch’s sketchbooks, topographical drawings and manuscripts whilst further correspondence is held by Northamptonshire Record Office. Historic England hold a series of negatives taken by Gotch and photographs, donated by him, are also held in the Conway Library whose archive of architectural images is in the process of being digitised as part of the wider Courtauld Connects project.", "link_mentions": [{"page": "Kettering", "response": ["Since 2021 Kettering has been part of the North Northamptonshire unitary authority. It formerly fell within the areas of Northamptonshire County Council and Kettering Borough Council, which incorporated the small, satellite towns of Barton Seagrave, Burton Latimer, Desborough and Rothwell. The local council was initially based on the first floor of the Corn Exchange, a building designed by E. F. Law and completed in 1853; it relocated in 1964 to the former home of Kettering Grammar School in Bowling Green Road, a building designed by John Alfred Gotch in the Neoclassical style and completed in 1913."]}, {"page": "Alfred East", "response": ["He was awarded a Knighthood in 1910 by King Edward VII. His portrait was painted by Philip de Laszlo. The Alfred East Art Gallery in Kettering, designed by John Alfred Gotch opened on 31 July 1913. The Alfred East Gallery is Northamptonshire's oldest purpose-built art gallery."]}, {"page": "Royal Institute of British Architects", "response": ["Soon after the passing of the 1931 Act, in the book published on the occasion of the institute's centenary celebration in 1934,The Growth and Work of the Royal Institute of British Architects edited by J. A. Gotch PPRIBA John Alfred Gotch Harry Barnes, FRIBA, Chairman of the Registration Committee, mentioned that ARCUK could not be a rival of any architectural association, least of all the RIBA, given the way ARCUK was constituted.Architects (Registration) Act, First Schedule Constitution of the Council, listing RIBA and other associations entitled to appoint members of the Council1931 21 & 22 Geo. 5. CH.33 Barnes commented that the Act's purpose was not protecting the architectural profession, and that the legitimate interests of the profession were best served by the (then) architectural associations in which some 80 per cent of those practising architecture were to be found. "]}, {"page": "Midland Bank", "response": ["The last head office of the Midland Bank, opposite the Bank of England in Poultry and Princes Street, was sold in October 2006 to a tycoon from Russia, with HSBC vacating the banking hall on the ground floor and huge underground deposit vaults in 2007. In 2012 the ground floor was used in the Channel 4 game show The Bank Job. The architect John Alfred Gotch designed the building, with assistance from Sir Edwin Lutyens."]}, {"page": "Thomas Cooper Gotch", "response": ["Thomas Cooper Gotch or T. C. Gotch (1854–1931) was an English painter and book illustrator loosely associated with the Pre-Raphaelite movement; he was the brother of John Alfred Gotch, the architect.Thomas Gotch Cooper. Art Encyclopedia.", "Thomas Gotch was born 10 December 1854 in the Mission House in Kettering, Northamptonshire.Thomas Cooper Gotch. Cornwall Artists. Retrieved 4 October 2012.Thomas Cooper Gotch. Project Kettering. Manor House Museum, Kettering. Retrieved 5 October 2012. He was the fourth son born to Mary Ann Gale GotchHistorical collections relating to Northamptonshire: family histories, pedigrees, biographies, tracts on witches, historical antiquities, reprints of rare and unique tracts .... Printed by J. Taylor & Son; 1896. p. 115.Pamela Lomax. The golden dream: a biography of Thomas Cooper Gotch. Sansom & Co.; 2004. . p. 26. and Thomas Henry Gotch (born 1805), who was a shoe maker. He had an elder brother, John Alfred Gotch, who was a successful architect and author.", "* John Alfred Gotch, 1926"]}, {"page": "Brigstock", "response": ["The Grade II* listed Manor House was built as a hunting lodge in a clearing of the Royal forest of Rockingham; in 1890 the house was remodelled by the Victorian architect John Alfred Gotch."]}, {"page": "File talk:Haddon-Hall,-Derbyshire-q75-1459x1021.jpg", "response": [": This file would be a welcome addition to Commons and, as the author has been dead for over 70 years, I can't think of any reason why it could not be transferred since John Alfred Gotch died in 1942. Any objection to such a transfer? --Azurfrog (talk) 21:15, 15 October 2012 (UTC)"]}, {"page": "Architectural education in the United Kingdom", "response": ["For further details of the development, in that period, of the policy of the RIBA for architectural education and qualification see  'Statutory Registration – chronology of key events' in Architects Registration in the United Kingdom, and for opposition to the system of registration which was proposed and promoted by successive Bills in Parliament see William H. White,  Thomas Graham Jackson  and John Alfred Gotch."]}, {"page": "Gotch", "response": ["*John Alfred Gotch (1852–1942), British architect and architectural historian"]}, {"page": "Kettering Grammar School", "response": ["The school was based in a building in Gold Street which, together with the master's house, was completed in 1857. It then relocated to Bowling Green Road, a building designed by John Alfred Gotch in the Neoclassical style and completed in 1913. The building was occupied on the left side by Kettering High School (for girls) and on the right side by Kettering Grammar School (for boys)."]}, {"page": "List of alumni of King's College London", "response": ["*John Alfred Gotch – President of the Royal Institute of British Architects"]}, {"page": "John Gotch", "response": ["#Redirect John Alfred Gotch"]}, {"page": "Registration of architects in the United Kingdom", "response": ["The basis of the policy (on registration) had always been that the profession was governed by voluntary associations of practising architects and that the profession would retain control of registration. This was reflected in the composition of the registration body (the Architects' Registration Council of the United Kingdom – ARCUK) established by the 1931 Act. Shortly after, in the book published on occasion of the Institute's centenary celebration in 1934,The Growth and Work of the Royal Institute of British Architects edited by J. A. Gotch PPRIBA John Alfred Gotch"]}, {"page": "Drayton House", "response": ["The core of the house was built by Sir Simon de Drayton around 1300 and still survives. He received his licence to crenellate in 1328. There have been changes to the house in each century since, including works recorded by Isaac Rowe, John Webb, William Talman, Gerard Lanscroon, William Rhodes, Alexander Roos, George Devey and John Alfred Gotch. However, the house is important for the transformation it underwent during the late 17th and early 18th centuries. There is a unique spiral cantilever oak staircase dating from around 1680 and an embroidered State Bed from 1700."]}, {"page": "List of people from Kettering", "response": ["* John Alfred Gotch – architect and architectural historian"]}, {"page": "Charles Latham (photographer)", "response": ["Latham worked for publishers such as Ernst Wasmuth and Batsford, specializing in architecture and outdoor topics. For Wasmuth he provided phographs for an overview of British and Irish architecture published in 1890. His first work for Batsford was with the architect John Alfred Gotch on his book Architecture of the Renaissance in England. Volume 1 available at the Internet Archive He then worked on George Birch's book on London churches of the 17th and 18th centuries, which has been described as \"the handsomest piece of preservation propaganda ever printed\". It contains 64 of Latham's photographs. He provided the photographs for two other Batsford books: Belcher and Macartney's two volume set of Renaissance English architectureVolume 1; Volume 2 and H. Inigo Triggs's book on formal gardens in England and Scotland."]}, {"page": "J.A. Gotch", "response": ["#REDIRECT John Alfred Gotch"]}, {"page": "Thomas Griffin (died 1615)", "response": ["In 1603 Queen Elizabeth died. James VI of Scotland became king, an event known as the Union of the Crowns. His wife, Anne of Denmark came to England in June 1603, and noblewomen and gentry travelled to meet her, perhaps in hope of gaining favour or employment in the royal household. One of the places where Anne of Denmark stayed and received guests was Griffin's house at Dingley Hall in Northamptonshire.John Nichols, Progresses of James the First, vol. 1 (London, 1828), pp. 172-3. Dingley Hall had been rebuilt in the 1550s by Edward Griffin and his second wife Anne Smith, daughter of John Smith, baron of the Exchequer, and the porch is carved with the date 1558 and their initials, and other inscriptions.John Alfred Gotch & Charles Latham, Architecture of the Renaissance in England, vol. 1 (London, 1894), p. 42 and plates.Walter C. Metcalfe, Visitation of Northamptonshire (London, 1887), p. 24."]}, {"page": "Edward Griffin (attorney)", "response": ["Griffin acquired an existing house, a Preceptory of the Knights Hospitallers, at Dingley, Northamptonshire at the dissolution of the monasteries, and rebuilt it in the 1550s. He built a monument in Braybrooke church in English renaissance style. The porch of Dingley Hall is carved with the date 1558 and the initials of Griffin and his second wife, and other inscriptions.John Alfred Gotch & Charles Latham, Architecture of the Renaissance in England, vol. 1 (London, 1894), p. 42 and plates.Walter C. Metcalfe, Visitation of Northamptonshire (London, 1887), p. 24."]}, {"page": "Leonard Shuffrey", "response": ["* Bryn Hafod house in Kettering, by John Alfred Gotch (1896). Shuffrey designed the ceilings."]}, {"page": "The Conway Photographic Library", "response": ["# John Alfred Gotch"]}, {"page": "Listed buildings in Penistone", "response": ["|The war memorial forms part of the western wall of the churchyard of St John's Church, Penistone, and was designed by John Alfred Gotch.  It is in sandstone, and consists of a Latin cross on a square tapering chamfered shaft  high.  The shaft is on a moulded plinth, on a lower square plinth with angled wings and moulded capping.  The lower plinth is on a semicircular and half-hexagonal base of three steps.  On the lower plinth are slate panels with inscriptions, and the names of those lost in the two World Wars.  The memorial is enclosed by a curving and half-coped wall ending in square panelled piers with square caps."]}]}}