{"wiki_id": "http://www.wikidata.org/entity/Q621536", "itemLabel": "Alex Marrow", "itemDescription": "English footballer (born 1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alex_Marrow", "wikipedia_page": {"main": "Alexander James Marrow (born 21 January 1990) is an English professional footballer.", "link_mentions": [{"page": "Marrow", "response": ["* Alex Marrow (born 1990), English footballer"]}, {"page": "Jermaine Easter", "response": ["Just 24 hours after leaving Swansea to return to Milton Keynes, Easter joined Championship side Crystal Palace for an undisclosed fee, signing a two and a half-year deal. Easter was handed the number 19 shirt by Dougie Freedman, becoming the Scot's second signing (after Alex Marrow) since taking over the managerial reins at Selhurst Park. He made his debut for his new club during an away fixture against Swansea City on 15 January, less than two days after having his loan stint at the south Wales club cut short by MK Dons. He scored his first goal for Palace in a 3–3 draw with Reading on 26 February 2011. On 25 January 2012 Easter missed a penalty in the League Cup semi final second leg shootout against Cardiff City, who progressed to the final at Palace's expense."]}, {"page": "2008–09 Blackburn Rovers F.C. season", "response": ["|align=center|Alex Marrow", "|align=center|Alex Marrow"]}, {"page": "2009–10 Oldham Athletic A.F.C. season", "response": [" | align=left|26 || align=left|MF || align=left|Alex Marrow", " | Alex Marrow"]}, {"page": "2009–10 Blackburn Rovers F.C. season", "response": ["| 6 August 2009 || Alex Marrow|| Oldham Athletic||May 2010"]}, {"page": "Tom Cairney", "response": ["He made his debut in a 1–1 draw against Derby County, as a 77th-minute substitute for Alex Marrow. Two days later, Cairney made his full debut for the club in an eventful League Cup clash with Carlisle United, scoring one and providing one assist, before being sent off for the first time in his career after two bookable offences. Cairney equalised for Blackburn in a 5–2 victory over Barnsley on 24 August, opening his Championship account for the club. Since joining Blackburn Rovers, Cairney established himself in the first team there, having quickly made an impact. He then set up two goals on 1 January 2014, in a 2–1 win over Leeds United. The next day, on 2 January 2014, his move to Blackburn was made permanent after a successful first half of the season on loan. Cairney said: \"I'm very pleased to sign permanently – that was a goal of mine when I came on loan in August.\" After completing this permanent deal, Cairney scored his second league for Blackburn Rovers, both of them coming against Barnsley on 28 January 2014. The local newspaper Lancashire Telegraph named him as the top performer for January. However, after being sidelined with ankle injury, which he sustained against Reading, he scored on his return from ankle injury against Brighton & Hove Albion on 1 April 2014, as well as, assisting a goal, in a 3–3 draw. Despite suffering from another injury, Cairney returned to the first team, scoring two more goals against Charlton Athletic and Wigan Athletic. Cairney rounded off his successful season when fans voted him Player of the Year 2013–14. At the end of the 2013–14 season, Cairney scored 6 times in total of 40 appearances."]}, {"page": "2010–11 Blackburn Rovers F.C. season", "response": ["|  Alex Marrow", "|  Alex Marrow"]}, {"page": "2011–12 Preston North End F.C. season", "response": ["|13||||MF||Alex Marrow||1||0||0||0||0||0||0||0||1||0"]}, {"page": "2012–13 Fleetwood Town F.C. season", "response": ["|27||MF||Alex Marrow||4||1||0||0||0||0||0||0||4||1"]}, {"page": "2012–13 Crystal Palace F.C. season", "response": ["|align=\"left\"|12||align=\"left\"|MF||align=\"left\"| Alex Marrow", "| Alex Marrow"]}, {"page": "2013–14 Blackburn Rovers F.C. season", "response": ["|  Alex Marrow", "|  Alex Marrow"]}, {"page": "2013–14 Derby County F.C. season", "response": ["A day before the fixture release day of 19 June, it was announced that Derby County would start their season with a match against Blackburn Rovers at Pride Park, as part of the Football League's 125th anniversary. Derby took the lead through a 43rd-minute penalty form debutant Johnny Russell after a handball from Alex Marrow, Leon Best scored a late equaliser on 89 minutes. In the first League Cup match of the season against Oldham, Derby made six changes from the previous league match and booked their place into the 2nd round for the first time in five years through a Michael Jacobs 20th-minute goal. Two days later in the second round draw, Derby draw another League One side; Brentford at home with the game being played in late August. Derby wouldn't have to wait long for their first league, as they won at Brighton & Hove Albion 2–1 in a come from behind win with a Chris Martin double, trumping a Leonardo Ulloa opener. Out of favour defender Tom Naylor joined League Two newcomers Newport County on loan until early January 2014. Transfer listed striker Theo Robinson let the club to join Doncaster Rovers for a fee of £150,000. Meanwhile, young Norwegian goalkeeper Mats Mørch joined Burton Albion on a months loan. Derby lost 1–0 at home to rivals Leicester City after a Lee Grant own goal. In late August, it was reported that out of favour defender James O'Connor was training with Bristol City of League One with the view of a permanent transfer. Derby however, won consecutive away games, after beating Yeovil Town 3–0 in the first meeting between the clubs through late first half goals from Johnny Russell and Craig Bryson, with Chris Martin rounding out the scoring on 58 minutes. Derby then scored a comfortable passage into the third round of the League Cup with goals from Chris Martin, Conor Sammon and Will Hughes in the first half and Sammon and Martin again in the second half to complete a 5–0 win. Derby then drew Leicester City away for the third round. However, the club's disappointing home league form continued with Derby's August programme finishing with a 3–0 defeat to Burnley through first half Danny Ings and Sam Vokes, with Johnny Russell having a penalty saved by Tom Heaton halfway through the second half, with Jason Shackell finishing the scoring for the visitors on 74 minutes. Derby ended the month 14th in the table on 7 points. Hendrick missed the game with after picking up chipped ankle bone injury in the Yeovil, with a scan revealing damage worse than expected and was later ruled out for 12 weeks."]}, {"page": "2013–14 Crystal Palace F.C. season", "response": ["Crystal Palace announced the release of six players from their academy on 4 June 2013. Bayan Fenwick, Jack Holland, Kadell Daniel, Aaron Akuruka, William Johnson-Cole and Kieran Woodley all left the club having not been offered professional contracts following promotion to the Premier League. André Moritz also left the club by mutual agreement after a new deal could not be agreed.  Owen Garvan, Peter Ramage and Danny Gabbidon all signed new contracts while Stephen Dobbie's loan move from Brighton & Hove Albion was made permanent.  On 3 July 2013, Palace smashed their transfer record after signing Dwight Gayle from Peterborough United for a reported £4.5 million. Jerome Thomas signed a two-year contract with the club in early July. Alex Marrow left the club to return to Blackburn Rovers for an undisclosed fee. Marrow represented the club four times in the previous season."]}, {"page": "2014–15 Carlisle United F.C. season", "response": ["|15 July 2014||MF|| Alex Marrow|| Blackburn Rovers||Free||", "| Alex Marrow", "|14 || ||DF ||Alex Marrow|| 2 || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 2 || 1"]}, {"page": "2014–15 Blackburn Rovers F.C. season", "response": ["On 24 May, Blackburn Rovers announced that Leon Best, D.J. Campbell, Dickson Etuhu, David Goodwillie, Alex Marrow, and Jordan Slew had been placed on the transfer list.", "On 15 July, Alex Marrow was released by Rovers by mutual consent.", "|  Alex Marrow"]}]}}