{"wiki_id": "http://www.wikidata.org/entity/Q6218941", "itemLabel": "John Anderson", "itemDescription": "Scottish businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Anderson_(Scottish_businessman)", "wikipedia_page": {"main": "John Anderson (1747–1820) was a Scottish businessman and entrepreneur. He was a commercial agent in New York and later a business owner in Cork. His business played a pivotal role in creating infrastructure that connected Dublin to Cork. Anderson purchased land in Fermoy that was later used as a military complex. \n\n", "link_mentions": [{"page": "Transport in Ireland", "response": ["Ireland's first mail coach services were contracted with the government by John Anderson with William Bourne in 1791 who also paid to improve the condition of the roads. The system of mail coaches, carriages and \"bians\" was further developed by Charles Bianconi, based in Clonmel, from 1815 as a fore-runner of the modern Irish public transportation system."]}, {"page": "John Anderson", "response": ["John Anderson may refer to:", "*John Anderson (Scottish businessman) (1747–1820), Scottish merchant and founder of Fermoy, Ireland", "*John Anderson (publisher) (1836–1910), Norwegian-American publisher", "*John Anderson (merchant) (1852–1924), Scottish merchant, of Singapore and Eastcote", "*Sir John Anderson, 1st Baronet, of Harrold Priory (1878–1963), Scottish haulage contractor", "*John Anderson (Cal Scale) (1925–2000), founder of Cal Scale model railroad detail parts manufacturer", "*John Anderson (New Zealand businessman, born 1938), New Zealand businessman, founder of Contiki Holidays and professional public speaker", "*John Anderson (inventor) (1942–2012), founder, director and the chief technology officer of HeartSine Technologies", "*John Anderson (New Zealand businessman, born 1945) (1945–2018), chief executive of the ANZ National Bank in New Zealand", "*John Anderson (chairman), non-executive chairman of the North-East Business and Innovation Centre, Sunderland", "* John Anderson (jazz trumpeter) (1921–1974), American jazz musician", "* John Anderson (producer) (born 1948), Northern Irish composer and producer", "* John Anderson (musician) (born 1954), American country musician", "* John Anderson (album), 1980 debut album", "* John Anderson, vocalist for the British rock band Charlie (founded 1971)", "* John Anderson (actor) (1922–1992), American actor", "* John Anderson (TV personality) (born 1931), Scottish television personality, referee on the series Gladiators", "* John Anderson (sportscaster) (born 1965), American television sports journalist and co-host of Wipeout", "* John Anderson (director) (born 1954), American documentary film director, producer, editor and writer", "*John Anderson (British Army officer) (1908–1988), first commander of the Ulster Defence Regiment", "*John Anderson (VC) (1918–1943), English Victoria Cross recipient", "*John Anderson (New Jersey politician) (1665–1736), colonel who served as acting governor of New Jersey in 1736", "*John Anderson (Maine politician) (1792–1853), United States Representative from Maine", "*John Anderson (Wisconsin senator) (1870–1954), Wisconsin state senator", "*John Anderson Jr. (1917–2014), Governor of Kansas, 1961–1965", "*Sir John Anderson, 1st Baronet, of Mill Hill (died 1813), British politician, MP for City of London, 1793–1806", "* John Anderson (diplomatic writer) (1795–1845), Scottish diplomatic writer", "*John Anderson (colonial administrator) (1858–1918), British governor of Straits Settlements and later of Ceylon", "*John Anderson, 1st Viscount Waverley (1882–1958), British civil servant and politician", "*John Anderson, 3rd Viscount Waverley (born 1949), British peer", "* John Anderson (trade unionist), British trade union leader", "*John Anderson (Newfoundland politician) (1855–1930), Newfoundland businessman and politician", "*John Anderson (Australian politician) (born 1956), Deputy Prime Minister of Australia and Leader of the National Party 1999–2005", "*John Anderson (mayor) (1820–1897), mayor of Christchurch, New Zealand, blacksmith, engineer, businessman", "*John Anderson (theologian and controversialist) (1668–1721), Scottish theologian and controversialist", "*John Anderson (theologian) (1748–1830), founder of the first Presbyterian seminary in America", "*John Anderson (missionary) (1805–1855), Scottish missionary", "*John Anderson (archbishop of Moosonee) (1866–1943), Anglican Church of Canada metropolitan bishop", "*John Anderson (philosopher) (1893–1962), Australian philosopher", "*John Anderson (bishop of British Columbia) (1912–1969), Anglican Church of Canada bishop", "*John Anderson (natural philosopher) (1726–1796), Scottish natural philosopher", "*John Anderson (physician) (died 1804), English physician", "*John Anderson (zoologist) (1833–1900), Scottish zoologist", "*John Anderson (New Zealand engineer) (1849–1934), Scottish rugby union player and engineer", "*John Anderson (Scottish engineer) (1814-1886)", "*John Anderson (pathologist) (1918–2011), British pathologist", "*John Anderson (American football) (born 1956), Green Bay Packers linebacker", "*John Anderson (footballer, born 1878) (1878–?), English footballer who played for Woolwich Arsenal and Portsmouth", "*John Anderson (footballer, born 1879) (1879–?), Scottish footballer who played for Chesterfield Town", "*John Anderson (footballer, born 1881) (1881–1942), Scottish footballer who played for Heart of Midothian and Falkirk", "*John Anderson (footballer, born 1915) (1915–1987), Scottish footballer, scorer for Portsmouth in the 1939 FA Cup Final", "*John Anderson (footballer, born 1921) (1921–2006), English footballer, scorer for Manchester United in the 1948 FA Cup Final", "*John Anderson (footballer, born 1928) (1928–2001), Scottish footballer who played as an inside forward", "*John Anderson (footballer, born 1931) (1931–2003), English footballer who played for Grimsby Town", "*John Anderson (footballer, born 1937), Scottish-born footballer who played for Stoke City and Australia", "*John Anderson (footballer, born 1959), Irish international footballer who played for Newcastle United", "*John Anderson (footballer, born 1972), Scottish footballer best known for playing for Greenock Morton", "*John Anderson (outfielder) (1873–1949), American baseball player", "*John Anderson (pitcher) (1929–1998), American baseball player", "*John Anderson (baseball coach) (born 1955), American baseball coach", "*John Anderson (cricketer, born 1955), Australian cricketer", "*John Anderson (Irish cricketer) (born 1982), Irish cricketer", "*John Anderson (Australian footballer) (1888–1957), Australian rules footballer", "*John Anderson (discus thrower) (1907–1948), American Olympic discus thrower", "*John Anderson (runner) (born 1936), British runner", "*John Anderson (bowls) (born 1912), British-South African lawn bowler", "*John Anderson (rugby league) (1913–1984), New Zealand international", "*John Anderson (canoeist) (1924–2001), American sprint canoer", "*John Anderson (ice hockey general manager) (1934–2009), general manager of the Buffalo Sabres", "*John Anderson (sailor) (born 1939), Australian sailor", "*John Anderson (racing driver) (1944–1986), American driver, who is known for a crash at Daytona in 1981", "*John Anderson (ice hockey) (born 1957), Canadian ice hockey player", "*John Anderson (equestrian) (born 1966), Canadian Olympic equestrian", "*John Anderson (hurler) (born 1978), Irish hurler", "*John Anderson (water polo), Canadian water polo player", "* John Anderson (carpenter) (1759–1832), friend of Robert Burns", "* John Anderson (engraver) (1775–?), Scottish engraver", "* John Anderson (genealogist, 1789–1832), Scottish genealogist", "* John Anderson (genealogist, fl. 1825), Scottish genealogist", "* John Anderson (classical scholar) (1870–1952), Camden Professor of Ancient History at the University of Oxford", "* John Anderson (escaped slave), American slave who escaped to Canada in the 1860s, leading to a famous extradition case"]}, {"page": "Fermoy", "response": ["In 1791, the lands around Fermoy were bought by a Scotsman, John Anderson. He was an entrepreneur who developed the roads and started the mail coach system in Ireland. He designed the town and the streets remain much the same as they were originally built. In 1984, some of his descendants, living in Australia, named a winery, Fermoy Estate, after the town he established. A plaque and bust in his honour were unveiled at the entrance to the town park in 2001.", "* John Anderson of Fermoy, the forgotten benefactor, by Niall Brunicardi, (first published 1983)"]}, {"page": "List of Cork people", "response": ["* John Anderson – businessman\"The Cork Directory for the year 1787\"."]}, {"page": "Richard Barry, 7th Earl of Barrymore", "response": ["Lord Barrymore died in perhaps unexpected solvency, with no legitimate son. He had alienated much of his Cork patrimony in 1792, at which time the Buttevant estate passed to Viscount Doneraile and to a Scottish banker, John Anderson."]}, {"page": "Anderson baronets", "response": ["The Anderson Baronetcy, of St Ives in the County of Huntingdon, was created in the Baronetage of England on 3 January 1629 for John Anderson. The title became extinct on his death in 1630.", "The Anderson Baronetcy, of Mill Hill, Hendon, in the County of Middlesex, was created in the Baronetage of Great Britain on 14 May 1798 for John Anderson, Lord Mayor of London from 1797 to 1798. The title became extinct on his death in 1813.", "The Anderson Baronetcy, of Fermoy in the County of Cork, was created in the Baronetage of the United Kingdom on 22 March 1813 for the 20-year-old James Anderson, in recognition of the public services rendered to Ireland by his father, the businessman John Anderson. Sir James later gained recognition in his own right as an inventor. The title became extinct on his death in 1861.", "The Anderson Baronetcy, of Harrold Priory in the County of Bedford, was created in the Baronetage of the United Kingdom on 15 June 1920 for the Scottish businessman, writer and lecturer John Anderson. The title became extinct on his death in 1963.", "*Sir John Anderson, 1st Baronet (died 1630)", "*Sir John Anderson, 2nd Baronet (1628–1670)", "*Sir Charles John Anderson, 8th Baronet (1767–1846)  ", "*Sir Charles Henry John Anderson, 9th Baronet (1804–1891)", "* Sir John Anderson, 1st Baronet (1878–1963)"]}, {"page": "Sir Robert Abercromby, 5th Baronet", "response": ["During the first quarter of the 19th century, Abercromby purchased most of the town and lands of Fermoy in Ireland from fellow Scotsman John Anderson. His grandson, Sir Robert John Abercromby, 7th Baronet is recorded as the owner of 434 acres of land in County Cork during the 1870s."]}, {"page": "John Anderson (Scottish Entrepreneur in Ireland)", "response": ["#REDIRECT John Anderson (Scottish businessman)"]}, {"page": "Sir James Anderson, 1st Baronet", "response": ["James Anderson was the eldest son of John Anderson, the founder of Fermoy, by his second wife, Elizabeth, the only daughter of Mr. James Semple, of Waterford. He was created a baronet on 22 March 1813, of Fermoy in the County of Cork, for the great public services rendered to Ireland by his father. Sir James was a celebrated experimentalist in steam-coaching, and took out various patents for his inventions. He lodged specifications in 1831 for \"improvements in machinery for propelling vessels on water\", in 1837 for \"improvements in locomotive engines\", and in 1846 for \"certain improvements in obtaining motive power, and in applying it to propel carriages and vessels, and to the driving of machinery\"."]}, {"page": "Sir Robert John Abercromby, 7th Baronet", "response": ["Forglen House was the main family seat and Abercromby continued programmes of improvement to the house and policies that had been initiated by his forebears. The Abercrombys also owned land in Ireland after the 5th Baronet bought most of the town of Fermoy from the estate of fellow Scotsman John Anderson after his death in 1820. The 7th baronet is recorded as the owner of 434 acres of land in County Cork during the 1870s and Fermoy House is listed as the family seat in Ireland. Inchdrewer Castle also formed part of his inheritance and MacGibbon and Ross list it in his ownership in 1887."]}, {"page": "Forglen House", "response": ["The Abercromby baronets owned a significant amount of property in Ireland, as most of the town of Fermoy had been purchased by them from John Anderson in the early 19th century. By 1814 Forglen was used as the main family seat of the Abercromby family; in 1877 they also acquired the 1793-built Dunlugas House, which was sited on the other side of the River Deveron. Lady Jane Abercromby's son, Sir Robert Abercromby, 5th Baronet, continued to enhance the grandeur of the estate policies by commissioning the building of a new mansion and several other buildings."]}, {"page": "Fermoy Estate", "response": ["Fermoy Estate is an Australian winery at Wilyabrup, in the Margaret River wine region of Western Australia.  Established by John and Beryl Anderson in 1985, it was named in honour of one of John Anderson's ancestors, a Scottish-born businessman who acquired part of Fermoy estate, just north of Cork, Ireland, and set up several industries there."]}, {"page": "Fermoy Barracks", "response": ["The East Barracks were designed and built by Abraham Hargrave on a site provided by John Anderson between 1801 and 1806. In June 1808 Sir Arthur Wellesley used the barracks as an assembly point from where 9,000 troops would depart for the Cove of Cork and then sail for Portugal to take part in the Peninsular War."]}]}}