{"wiki_id": "http://www.wikidata.org/entity/Q6224925", "itemLabel": "John Cameron", "itemDescription": "Scottish farmer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Cameron_(farmer)", "wikipedia_page": {"main": "John Bell Cameron  FRAgS is a Scottish farmer based in Balbuthie, Fife, with significant interest in railways.", "link_mentions": [{"page": "LNER Class A4", "response": ["|Owned by John Cameron."]}, {"page": "DB Cargo UK", "response": ["| align=\"left\" |John Cameron"]}, {"page": "West Coast Railways", "response": ["|align=left|John Cameron"]}, {"page": "Bo'ness and Kinneil Railway", "response": ["|Arrived at Bo'ness in September 2017. To be displayed in the museum until the completion of owner John Cameron's new visitor centre in Fife."]}, {"page": "LNER Class A4 4488 Union of South Africa", "response": ["The springbok plaque on the side of the locomotive was donated on 12 April 1954 by a Bloemfontein newspaper proprietor. Only the one plaque was fitted on the left hand side of the locomotive. Two cast Springbok plaques were given to John Cameron in the mid 1970s and these were mounted on the cabsides. They have since been removed during overhauls but the original boiler side plaque remains. 60009 is fitted with an American, Crosby chime whistle in common with other members of its class.", "Purchased by John Cameron in July 1966, 60009 was preserved on the now-defunct Lochty Private Railway in Fife, Scotland, travelling the  of track near Anstruther.", "On 9 September 2015, 60009 hauled a train carrying Queen Elizabeth II along with Prince Philip, Duke of Edinburgh and Scottish First Minister Nicola Sturgeon to officially re-open the Borders Railway between Edinburgh Waverley and Tweedbank. The locomotive subsequently operated railtours on the line throughout September. In 2017 John Cameron announced that 60009 would be withdrawn when its boiler ticket expired and placed in the Farming and Railway Visitor Centre in Fife.Cameron A4 and K4 are not for sale at any price The Railway Magazine 10 February 2017Steam Railway magazine issue 462 In March 2019 a 12-month extension to the boiler certificate was granted.Mainline certificate for steam locomotive 60009 Union of South Africa extended On 7 March 2020 it hauled its last main line charter – from Ealing Broadway to York via the Midland Main Line – and was then stored at the National Railway Museum.Show's Over: Union Bows Out of Main Line Steam Railway issue 504 April 2020 page 16End of the line for Number Nine The Railway Magazine issue 1429 April 2020 page 86 In October 2020 it was hauled from York to the East Lancashire Railway (ELR), where it entered service in April 2021.Cameron's Streak silently slips away from network Steam Railway issue 512 November 2020 page 49 It was due to remain operational on the ELR until its boiler certificate expired in April 2022,No 9 back in action at East Lancashire Heritage Railway issue 281 June 2021 page 7 but in October 2021 it was announced that it had been withdrawn because of water tube problems."]}, {"page": "Dollar Academy", "response": ["*1981 John Cameron of BalbuthieCBE, FP"]}, {"page": "LNER Class K4", "response": ["| Preserved, owned by John Cameron", "Only one of the six strong class has survived into preservation, following the efforts of the late Viscount Garnock who bought No.61994 The Great Marquess from British Railways (BR), and had the engine overhauled to working order. Based at Leeds No.3442 undertook railtour work until forced into retirement by the ban imposed on steam working by BR in 1968. From 1972 No.3442 was stored on the Severn Valley Railway (SVR) until 1980 when it was overhauled. In the mid 2000s No.3442 was bought by John Cameron and the locomotive left the SVR for overhaul at Crewe. "]}, {"page": "John Cameron", "response": ["John Cameron may refer to:", "* John Cameron (British Army officer), British military officer and commander during the French Revolutionary and the Napoleonic Wars", "* John Cameron (Royal Navy officer) (1874–1939)", "* John Cameron (Alberta politician) (1845–1919), member of Edmonton's first town council", "* John Cameron (British politician) (born 1969)", "* John Cameron (chief) (1764–1828), Mississauga Ojibwa chief", "* John Cameron (Queensland politician, born 1834) (1834–1902), Brisbane businessman and alderman", "* John Cameron (Queensland politician, born 1845) (1845–1914), member of the Queensland Legislative Assembly", "* John Cameron (Upper Canada politician) (1778–1829), farmer and political figure in Upper Canada", "* John Cameron (bishop) (died 1446), bishop of Glasgow", "* John Cameron (theologian) (c. 1570–1625), Scottish theologian", "* John Cameron (Reformed Presbyterian) (1724–1799), Scottish Presbyterian minister in Ulster", "* John Cameron (Canadian bishop) (1827–1910), Canadian Roman Catholic priest and Bishop of Antigonish", "* John Cameron (athlete) (1881–1953), Canadian athlete", "* John Cameron (footballer, born 1868) (1868–?), Scottish footballer", "* John Cameron (footballer, born 1872) (1872–1935), Scottish footballer, played for Queen's Park, Everton & Scotland; player-manager for Tottenham Hotspur", "* John Cameron (footballer, born 1875) (1875–1944), Scottish footballer", "* John Cameron (New Zealand cricketer) (1898–1988), New Zealand cricketer", "* John Cameron (Rangers footballer), played for Rangers and made one appearance for Scotland in 1886", "* John Cameron (West Indian cricketer) (1914–2000), West Indian cricketer", "* John Cameron (anatomist) (1873–1960), Scottish physician and author", "* John Cameron (farmer), Scottish farmer involved with ScotRail", "* John Cameron, Lord Abernethy (born 1938), Scottish lawyer", "* John Cameron, Lord Cameron (1900–1996), Scottish judge", "* John Cameron, Lord Coulsfield (1934–2016), Scottish judge", "* John Cameron (musician) (born 1944), British composer, arranger, conductor and musician", "* John Cameron (police officer) (1807–1873), law enforcement officer remembered for his work in the New York Draft Riots", "* John Cameron (singer) (1918–2002), Australian operatic baritone", "* John Cameron (1817-1878) (1817–1878), executive officer and director-general of the Ordnance Survey", "* John Cameron, guitar player for the Claw Boys Claw", "* John Cameron, Hong Kong police officer and host of Police Report", "* John Cameron (producer and director) (born 1958), American producer and director known notably for his work on the Fargo TV series", "*John Cameron-Cameron, a character played by Dickie Goodman in a series of novelty records"]}, {"page": "John Cameron (Scottish farmer)", "response": ["#REDIRECT John Cameron (farmer)"]}, {"page": "East Fife Central Railway", "response": ["After line closure, John Cameron purchased a main line steam engine and operated it on a short length of track at Lochty; this developed into the Lochty Private Railway and from 1967 to 1992 the short railway, and a steam museum at Lochty, operated successfully."]}, {"page": "LNER Gresley K4 61994 The Great Marquess", "response": ["Currently owned by John Cameron who also owns LNER A4 Pacific no 60009 Union of South Africa, both engines are usually based at Thornton, but recently both have seen major action around the North West of England allocated to Crewe hauling charter trains.", "61994 was stored at the North Yorkshire Moors Railway after the expiry of its boiler certificate, but departed for Bo'ness on 21 September 2017, where from December it was displayed in the Museum of Scottish Railways. It will eventually be placed in a museum in Fife, Scotland, built by and dedicated to its current owner, John Cameron, along with his other engine, LNER A4 Pacific no 60009 Union of South Africa."]}]}}