{"wiki_id": "http://www.wikidata.org/entity/Q6227628", "itemLabel": "John Crichton-Stuart, 4th Marquess of Bute", "itemDescription": "Scottish peer (1881-1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Crichton-Stuart,_4th_Marquess_of_Bute", "wikipedia_page": {"main": "John Crichton-Stuart, 4th Marquess of Bute, KT (20 June 1881 – 25 April 1947), was a Scottish peer.", "link_mentions": [{"page": "First Minister of Scotland", "response": ["The first minister traditionally resides at Bute House which is located at number 6 Charlotte Square in the New Town of Edinburgh. The house became the property of the National Trust for Scotland in 1966, after the death of the previous owner John Crichton-Stuart, 4th Marquess of Bute and remains in the ownership of the National Trust for Scotland. Prior to devolution, Bute House was the official residence of the Secretary of State for Scotland. Weekly meetings of the Scottish Cabinet take place in the Cabinet room of the house. Bute House is also where the first minister holds press conferences, hosts visiting dignitaries and employs and dismisses government Ministers. The Office of the First Minister is located at St Andrews House in Edinburgh."]}, {"page": "Marquess of Bute", "response": ["*John Crichton-Stuart, 4th Marquess of Bute (1881–1947)"]}, {"page": "Earl of Dumfries", "response": ["*John Crichton-Stuart, 4th Marquess of Bute and 9th Earl of Dumfries (1881–1947); eldest son of the 3rd Marquess and 9th Earl."]}, {"page": "List of Knights and Ladies of the Thistle", "response": ["|John Crichton-Stuart, 4th Marquess of Bute||75px||1881–1947||1922|| "]}, {"page": "1932 in science", "response": ["* A flock of Soay sheep is translocated from Soay to Hirta (also in the depopulated archipelago of St Kilda, Scotland) by conservationist John Crichton-Stuart, 4th Marquess of Bute."]}, {"page": "Crichton", "response": ["* John Crichton-Stuart, 4th Marquess of Bute, (1881–1947)"]}, {"page": "Pan-Celticism", "response": ["Breton Regionalist Union founder Régis de l'Estourbeillon attended the 1907 congress, headed the Breton faction of the procession and placed the Breton stone on the Lia Cineill. Henry Jenner, Arthur William Moore and John Crichton-Stuart, 4th Marquess of Bute likewise attended the 1907 congress."]}, {"page": "Lord Lieutenant of Buteshire", "response": ["*John Crichton-Stuart, 4th Marquess of Bute 31 March 1905 – 1920London Gazette, Issue 11714, published 7 April 1905"]}, {"page": "John Crichton-Stuart, 5th Marquess of Bute", "response": ["John Crichton-Stuart, 5th Marquess of Bute (4 August 1907 – 14 August 1956) was the son of John Crichton-Stuart, 4th Marquess of Bute, and Augusta Bellingham."]}, {"page": "John Crichton-Stuart", "response": ["* John Crichton-Stuart, 4th Marquess of Bute (1881–1947)"]}, {"page": "Charlotte Square", "response": ["On the north side, No. 5 was the home of John Crichton-Stuart, 4th Marquess of Bute (1881–1947), who bought it in 1903 and gave it to the National Trust for Scotland on his death. It was the Trust headquarters from 1949 to 2000. Bute did much to promote the preservation of the Square."]}, {"page": "List of Old Harrovians", "response": ["*John Crichton-Stuart, 4th Marquess of Bute (1811–1947), Scottish peer who restored Caerphilly Castle"]}, {"page": "Montagu Bertie, 7th Earl of Abingdon", "response": ["* Lt-Cdr. Hon. James Willoughby Bertie (1901–1966), who married Lady Jean Crichton-Stuart, daughter of John Crichton-Stuart, 4th Marquess of Bute, on 12 June 1928."]}, {"page": "Augusta Crichton-Stuart, Marchioness of Bute", "response": ["On 6 July 1905, she married John Crichton-Stuart, 4th Marquess of Bute (1881-1947), son of John Patrick Crichton-Stuart, 3rd Marquess of Bute, and Hon. Gwendolen Mary Anne Fitzalan-Howard. Their wedding was held at Castle Bellingham, in the village of Castlebellingham in County Louth, Ireland, and was followed by a party at Mount Stuart House in Scotland. A film company was hired to film the event; and it served as one of the earliest examples of the aristocratic classes making a private film."]}, {"page": "Sir Henry Bellingham, 4th Baronet", "response": ["On 13 January 1874, he married firstly Lady Constance Julia Eleanor Georgiana Noel, daughter of Charles Noel, 2nd Earl of Gainsborough at St Thomas of Canterbury Church, Exton. She died in 1891, and Bellingham married secondly Hon. Lelgarde Harry Florence Clifton, younger daughter of Augustus Wykeham Clifton and his wife Bertha Clifton, 22nd Baroness Grey de Ruthyn at the Church of Our Lady, St John's Wood on 11 June 1895. Bellingham had two sons and two daughters by his first wife. He died aged 74 and was succeeded in the baronetcy by his older son Edward. His second daughter Augusta married John Crichton-Stuart, 4th Marquess of Bute. He was the uncle of Sir Evelyn Wrench, editor of The Spectator"]}, {"page": "1880s in Wales", "response": ["**20 June – John Crichton-Stuart, 4th Marquess of Bute, landowner (died 1947)"]}, {"page": "1881 in Wales", "response": ["*20 June – John Crichton-Stuart, 4th Marquess of Bute, landowner (died 1947)"]}, {"page": "4th Marquess of Bute", "response": ["#REDIRECT John Crichton-Stuart, 4th Marquess of Bute"]}, {"page": "Clan Stuart of Bute", "response": ["John Crichton-Stuart, 4th Marquess of Bute, was a passionate in Architecture who was also created a Knight-Companion of the Most Ancient and Most Noble Order of the Thistle, while his son John Crichton-Stuart, 5th Marquess of Bute, a maternal descendant of William IV of the United Kingdom by Dorothea Bland, was an expert in Ornithology. He was succeeded by his son, John Crichton-Stuart, 6th Marquess of Bute, who had a passion for Scottish heritage and received a Knight-Commander degree of the Most Excellent Order of the British Empire for his efforts before he died in 1993."]}, {"page": "John Crichton-Stuart, 4th Marquis of Bute", "response": ["#REDIRECT John Crichton-Stuart, 4th Marquess of Bute"]}, {"page": "Hugh Ingledew", "response": ["Outside playing rugby, Ingledew was a solicitor, who specialised in railway law. Despite his favoured legal stance in transport law, he was chosen as the solicitor in completing the purchase of the Cardiff Arms Park in 1922.Glamorgan County Cricket Club Cardiff Arms Park a short history As a former sportsman with connections to cricket, and Cardiff Rugby club, Ingledew helped Cardiff Athletic Club purchase the ground from John Crichton-Stuart, 4th Marquess of Bute, for a sum of £30,000."]}, {"page": "List of most expensive books and manuscripts", "response": ["One of 119 complete copies known to exist. Copy originally owned by George Lane Fox (1793–1848) and subsequently by John Crichton-Stuart, 4th Marquess of Bute"]}, {"page": "The Rock Hotel", "response": ["The Rock Hotel, also known as Rock Hotel, is a historic hotel in the British Overseas Territory of Gibraltar. It has been described as \"one of the Mediterranean's most famous hotels,\" and as \"an institution in Gibraltar and the Mediterranean.\" Built in 1932 by John Crichton-Stuart, 4th Marquess of Bute, the hotel is set in a 3.6-hectare (8.9-acre) landscaped garden and contains 104 rooms. It is located in a large white Art Deco building along Europa Road, overlooking the Gibraltar Botanic Gardens.", "The Rock Hotel was built by John Crichton-Stuart, 4th Marquess of Bute, and began operation in 1932. In the years after it opened, the hotel was managed by Rudolph Richard and earned a reputation as one of the finest hotels in Europe."]}]}}