{"wiki_id": "http://www.wikidata.org/entity/Q6223335", "itemLabel": "John Bromley", "itemDescription": "British politician (1876-1945)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Bromley_(politician)", "wikipedia_page": {"main": "John Bromley (16 July 1876 – 7 September 1945) was an English Labour Party politician who served as Member of Parliament (MP) for Barrow-in-Furness from 1924 to 1931, and a trade union leader.", "link_mentions": [{"page": "List of MPs elected in the 1924 United Kingdom general election", "response": ["|John Bromley"]}, {"page": "Barrow and Furness (UK Parliament constituency)", "response": ["| John Bromley "]}, {"page": "Leeds North East (UK Parliament constituency)", "response": ["At the first election in 1918, it was decided that a Conservative candidate would receive the Coalition 'coupon' in Leeds North East, as four Liberals had received coupons in other Leeds divisions and Labour was allowed an unopposed return in Leeds South-East. Major John Birchall, the Coalition Conservative candidate, was opposed by Labour Party candidate John Bromley, leader of the Locomotive Engineman's Society. The Times described Bromley as \"prone to verbal violence\" and with \"an unnecessary railway strike in his war service record\". A third candidate, Captain W.P. Brigstock, announced himself for the National Party, but was felt to have negligible prospects and did not stand.\"Asquith Liberals in Yorkshire\", The Times, 30 November 1918, p. 9. Birchall won comfortably, and went on to represent the seat until he retired in February 1940. His majority never fell below 4,000."]}, {"page": "List of Labour Party (UK) MPs", "response": ["*John Bromley, Barrow-in-Furness, 1924–31"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|John Bromley"]}, {"page": "Hadnall", "response": ["The village church is dedicated to St. Mary Magdalene. General Sir Rowland Hill, 1st Viscount Hill, who lived at nearby Hardwick Grange, is buried here, as was writer Charles Hulbert who lived at Providence Grove. John Bromley, future trade union leader and Labour MP, whose parents lived at Haston Grove in the parish, was born and baptised here in 1876.Article by Philip S. Bagwell."]}, {"page": "John Bromley", "response": ["John Bromley may refer to:", "*John Bromley (translator) (died 1717), English clergyman, Catholic convert, and translator", "*John Bromley (politician) (1876–1945), English trade union leader, general secretary of ASLEF 1914–36, and Labour Party Member of Parliament for Barrow-in-Furness 1924–31", "*John Bromley (umpire) (born 1968), New Zealand cricket umpire", "*John Bromley, designer of Royal Doulton figurines", "*Sir John Bromley (soldier) (died 1419), English soldier and landowner at Baddington, Cheshire", "*John Bromley (the elder) (c. 1652–1707), plantation owner and English politician", "*John Bromley (the younger) (c. 1682–1718), English politician"]}, {"page": "Efford", "response": ["*John Bromley (1876–1945), former Labour Member of Parliament and General Secretary of trade union ASLEF.Article by Philip S. Bagwell."]}, {"page": "Daniel Somerville", "response": ["He was elected at the 1922 general election as Member of Parliament (MP) for Barrow-in-Furness. He was re-elected in 1923, but was narrowly defeated at the 1924 election in a straight contest with the Labour Party candidate John Bromley."]}, {"page": "Hands Off Russia", "response": ["The initial committee members were: Mary Bamber, Isaac Brassington, John Bromley, Alexander Gordon Cameron, Rhys Davies, Robert Dunstan, William Gallacher, W. T. Goode, Alex Gossip, Harold Granville Grenfell, David Kirkwood, George Lansbury, Cecil L'Estrange Malone, Ernest Mander, Tom Mann, John Edmund Mills, Tom Myers, George Peet, Fred Shaw, Robert Smillie, Ben Spoor, and James Winstone.Dictionary of Labour Biography, vol.IX, p.106 Many of those who were active in the Hands off Russia Campaign would go on to found the Communist Party of Great Britain the following year."]}, {"page": "General Council of the Trades Union Congress", "response": ["|rowspan=5| John Bromley"]}, {"page": "Richard Squance", "response": ["During the early 1930s, ASLEF's general secretary, John Bromley, suffered from increasingly poor health, and Squance frequently deputised for him.  As such, when Bromley retired in 1936, Squance was the natural choice as his successor.Dictionary of Labour Biography, vol.XIII, p.55  He also served on the General Council of the Trades Union Congress from 1936, until his retirement in 1939."]}, {"page": "Jack Bromley", "response": ["#REDIRECT John Bromley (politician)"]}]}}