{"wiki_id": "http://www.wikidata.org/entity/Q6222239", "itemLabel": "John Blofeld", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Blofeld", "wikipedia_page": {"main": "John Eaton Calthorpe Blofeld (2 April 1913 – 7 June 1987) was a British writer on Asian thought and religion, especially Taoism and Chinese Buddhism.", "link_mentions": [{"page": "Huangbo Xiyun", "response": ["John Blofeld says he died on Mount Huangbo during the T'ai Chung reign of the Tang Dynasty, or between 847–859. Blofeld says his memorial pagoda is \"The Tower of Spacious Karma\" and that it was Emperor Hsüan Tsung who gave him the title \"The Zen Master Who Destroys All Limitations\".Blofeld, p. 132."]}, {"page": "Stephen Batchelor (author)", "response": ["* Batchelor, Stephen. Alone with Others: An Existential Approach to Buddhism. Foreword by John Blofeld. Grove Press, 1983 ."]}, {"page": "Tara (Buddhism)", "response": ["Another quality of feminine principle which she shares with the dakinis is playfulness. As John Blofeld expands upon in Bodhisattva of Compassion, Tārā is frequently depicted as a young sixteen-year-old girlish woman. She often manifests in the lives of dharma practitioners when they take themselves, or the spiritual path too seriously. There are Tibetan tales in which she laughs at self-righteousness, or plays pranks on those who lack reverence for the feminine. In Magic Dance: The Display of the Self-Nature of the Five Wisdom Dakinis, Thinley Norbu explores this as \"Playmind\". Applied to Tārā one could say that her playful mind can relieve ordinary minds which become rigidly serious or tightly gripped by dualistic distinctions. She takes delight in an open mind and a receptive heart then. For in this openness and receptivity her blessings can naturally unfold and her energies can quicken the aspirants spiritual development.", "The practices themselves usually present Tārā as a tutelary deity (thug dam, yidam) which the practitioners sees as being a latent aspect of one's mind, or a manifestation in a visible form of a quality stemming from Buddha Jnana. As John Blofeld puts it in The Tantric Mysticism of Tibet:"]}, {"page": "Anagarika Govinda", "response": ["In 1947 he married the Parsi artist Li Gotami (original name Ratti Petit, 22 April 1906 - 18 August 1988) from Bombay, who, as a painter, had been his student at Santinekan in 1934. Govinda and Li Gotami wore Tibetan styles robes and were initiates in the Drugpa Kagyu lineage.Hecker, 1990, p.87 The couple lived in a house rented from the writer Walter Evans-Wentz at Kasar Devi, near Almora in northern India.Donald S. Lopez, p.61. Kasar Devi, in hippie circles known as 'Crank's Ridge', was a bohemian colony home to artists, writers and spiritual seekers such as Earl Brewster, Alfred Sorensen and John Blofeld. Many spiritual seekers, including the Beat Poets Allen Ginsberg and Gary Snyder, the LSD Gurus Timothy Leary and Ralph Metzner, the psychiatrist R. D. Laing, and Tibetologist Robert Thurman came to visit Govinda at his ashram. The number of visitors became so great that the couple eventually put signs to keep unwanted visitors away.Donald S. Lopez, p.61."]}, {"page": "Clive Strutt", "response": ["* 2020 Tower of the Yellow Crane: Fourteen Songs of Stillness for the Eight Taoist Immortals - to texts in English translated by John Blofeld"]}, {"page": "Crank's Ridge", "response": ["The ridge became a haunt for bohemian artists, writers and spiritual seekers in the 1920s and 1930s, including notable western Tibetan Buddhists, W. Y. Evans-Wentz, and Lama Anagarika Govinda, who in turn was visited by Anandamayi Ma and Neem Karoli Baba.Alfred Sorensen - Cranks Ridge  Alfred Sorensen Biography. Other early people connected to Crank's Ridge were Earl Brewster, an American artist and his wife Achsah Barlow Brewster, author John Blofeld and Danish mystic Alfred Sorensen.Sunyata, eds: Camhi, Betty and Rai, Gurubaksh Dancing with the Void, Blue Dove Press, 2001,  In 1934, Alfred Sorensen who was earlier introduced to Nehru by Tagore, visited the home of Nehru's sister and brother-in-law at their house Khali, Binsar where he stayed and used his horticultural skills in the garden, while still travelling during the summer.Binsar It was while staying with the Nehru family that one of their friends offered Sorensen a piece of land where he could live on Crank's Ridge, near Almora."]}, {"page": "John Eaton Calthorpe Blofeld", "response": ["#redirect John Blofeld"]}, {"page": "Elsa Gidlow", "response": ["Along with Watts and his soon to be wife Mary Jane Yates, Gidlow planned and then co-founded the Society for Comparative Philosophy here in 1962. This society financed many of the improvements to the property and brought many of the important visitors and \"artists in residence\" for whom Druid Heights is now known. Besides Alan Watts, notable residents who, through Elsa's largess, found cheap rent and a place to create or escape were David Wills, Catherine Mackinnon, Roger Somers, Sunyata, John Blofeld, and many leaders of various women's rights efforts. The Society morphed into the Druid Heights Artist Retreat after her death whereupon she provided the funds to begin the nascent-albeit short-lived-organization, Druid Heights Artists Retreat; A Facebook group called \"Save Druid Heights\" has been formed where many today hope to return DHAR to her home at Druid Heights."]}, {"page": "Blofeld (disambiguation)", "response": ["* John Blofeld (1913–1987), British writer on Asian thought and religion", "* John Blofeld (judge) (born 1932), English barrister and former High Court judge"]}, {"page": "Almora", "response": ["* Alfred Sorensen, John Blofeld, Beat Poets Allen Ginsberg, Peter Orlovsky and Gary Snyder - the original Dharma Bums, the LSD Gurus Timothy Leary and Ralph Metzner, the psychiatrist R. D. Laing, and Tibetologist Robert Thurman were among the many celebrities who lived or stayed in Almora."]}, {"page": "Gu (poison)", "response": ["Gu  names the Yì-Jīng Hexagram 18, which is translated as \"Destruction\" (Z.D. Sung 1935), \"Work on What Has Been Spoiled [Decay]\", \"Decay\" (John Blofeld 1965), \"Degeneration\" (Thomas Cleary 1986), \"Poison, Destruction\" (Wu Jing-Nuan 1991), and \"Ills to Be Cured\" (Richard John Lynn 1994). Wilhelm explains translating \"decay\" for ."]}, {"page": "Sylvester Houédard", "response": ["Houédard cultivated an interest in multiple religious traditions; he wrote commentaries on Meister Eckhart and was a founder-member of the Eckhart Society, as well as an honorary fellow of the Muhyiddin Ibn Arabi Society.Beshara Publications author info He published a fair amount of literary criticism, often with eccentric typography,Richard Kostelanetz, H. R. Brittain: A Dictionary of the Avant-Gardes, p. 291 and corresponded widely with leading poets, artists, theologians and philosophers of the day, including Robert Graves, Edwin Morgan, Allen Ginsberg, William S. Burroughs, Jack Kerouac, Mark Boyle, John Blofeld, Michael Horovitz and Ian Hamilton Finlay. In 1965 he collaborated with Jasia Reichardt from the Institute of Contemporary Arts in London on the connection between poetry and visual art which led to a joint publication. ASIN: B01N7CN9E1 dom sylvester houedard (dsh) collaborated next with Filpino poet and artist David Medalla in a modern ballet entitled The Yellow Wrinkled Pea, inspired by the life and scientific discoveries of the monk Gregor Johann Mendel; the modern ballet, choreographed by Medalla, was performed in 1967 by members of the Exploding Galaxy at Middle Earth in Covent Garden, London, in 1967. dsh contributed a poem to Signals, the avant-garde newsbulletin by Medalla in the sixties. dsh, Medalla and Antonio Sena exhibited together at the Lisson Gallery in London in 1967. Medalla curated the first solo exhibition by dsh in 1976 at Artists for Democracy's Fitzrovia Cultural Centre, 143 Whitfield Street, London."]}, {"page": "Chungliang Al Huang", "response": ["Throughout his career, Huang established many close alliances with highly regarded philosophers and scholars of our time. Notably, his colleague and collaborator, the late philosopher scholar Alan Watts, mythologist Joseph Campbell, and his mentor John Blofeld.", "He has taught at Esalen Institute in Big Sur, CA since the late 1960s.  Huang was a close colleague and collaborator with the late scholar Alan Watts, mythologist Joseph Campbell, Gregory Bateson, Laura Archera Huxley, John Blofeld, and Huston Smith.", "* My Journey in Mystic China: Old Pu's Travel Diary by John Blofeld, with Daniel Reid, and Chungliang Al Huang (2008)"]}, {"page": "I Ching", "response": ["The I Ching has been translated into Western languages dozens of times. The earliest complete published I Ching translation in a Western language was a Latin translation done in the 1730s by the French Jesuit missionary Jean-Baptiste Régis that was published in Germany in the 1830s. The most influential I Ching translation was the 1923 German translation of Richard Wilhelm, which was translated into English in 1950 by Cary Baynes. Although Thomas McClatchie and James Legge had both translated the text in the 19th century, the text gained significant traction during the counterculture of the 1960s, with the translations of Wilhelm and John Blofeld attracting particular interest. Richard Rutt's 1996 translation incorporated much of the new archaeological and philological discoveries of the 20th century. Gregory Whincup's 1986 translation also attempts to reconstruct Zhou period readings."]}, {"page": "Li Gotami Govinda", "response": ["While at Shantiniketan, Petit also studied under Anagarika Govinda, the Bolivian-German Professor of Vishwa Bharati University. Petit married Govinda in 1947, in four separate ceremonies. Civil ceremonies were held in Bombay and Darjeeling, and \"lama marriage\" ceremonies were performed in the Chumbi Valley by Ajo Rinpoche and by Govinda himself. Petit converted to Mahayana Buddhism, and adopted the name Li Gotami, against the wishes of her devout Zoroastrian parents. Govinda, who had acquired British citizenship in 1938, became a citizen of India in 1947.Hecker, 1990, p.86-87. The couple lived in a house rented from the writer Walter Evans-Wentz at Kasar Devi, near Almora in northern India.Donald S. Lopez, p.61. Kasar Devi, in hippie circles known as \"Crank's Ridge\", was a bohemian colony home to artists, writers and spiritual seekers such as Earl Brewster, Alfred Sorensen and John Blofeld. Many spiritual seekers, including the Beat Poets Allen Ginsberg and Gary Snyder, the LSD Gurus Timothy Leary and Ralph Metzner, the psychiatrist R. D. Laing, and Tibetologist Robert Thurman came to visit Govinda at his ashram. The number of visitors became so great that the couple eventually put signs to keep unwanted visitors away."]}, {"page": "List of people educated at Haileybury and Imperial Service College", "response": ["* John Blofeld, Taoist and Buddhist author"]}, {"page": "Blofeld, John", "response": ["#redirectJohn Blofeld"]}]}}