{"wiki_id": "http://www.wikidata.org/entity/Q6226858", "itemLabel": "John Conington", "itemDescription": "British classical scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Conington", "wikipedia_page": {"main": "John Conington (10 August 1825 – 23 October 1869) was an English classical scholar. In 1866 he published his best-known work, the translation of the Aeneid of Virgil into the octosyllabic metre of Walter Scott. He was Corpus Professor of Latin at the University of Oxford from 1854 till his death.", "link_mentions": [{"page": "Boston, Lincolnshire", "response": ["* John Conington (1825–1869) classical scholar"]}, {"page": "John Addington Symonds", "response": ["In January 1858, Symonds received a letter from his friend Alfred Pretor (1840–1908), telling of Pretor's affair with their headmaster, Charles John Vaughan. Symonds was shocked and disgusted, feelings complicated by his growing awareness of his own homosexuality. He did not mention the incident for more than a year until in 1859, when a student at Oxford University, he told the story to John Conington, the Latin professor. Conington approved of romantic relationships between men and boys. Earlier, he had given Symonds a copy of Ionica, a collection of homoerotic verse by William Johnson Cory, the influential Eton College master and advocate of pederastic pedagogy. Conington encouraged Symonds to tell his father about his friend's affair, and the senior Symonds forced Vaughan to resign from Harrow. Pretor was angered by the younger man's part, and never spoke to Symonds again.Kaplan, Morris B. (2012) Sodom on the Thames: Sex, Love, and Scandal in Wilde Times. Cornell University Press. . p. 112"]}, {"page": "Henry Nettleship", "response": ["Nettleship had always been interested in Virgil, and a good deal of his time was devoted to his favourite poet. After John Conington's death in 1869, he saw his edition of Virgil through the press, and revised and corrected subsequent editions of the work. In 1875, he had undertaken to compile a new Latin lexicon for the Clarendon Press, but the work proved more than he could accomplish, and in 1887 he published some of the results of twelve years' labour in a volume entitled Contributions to Latin Lexicography, a genuine piece of original work."]}, {"page": "Charles Vaughan (priest)", "response": ["Through this incident Vaughan was, in the words of Gathorne-Hardy, \"... not for the first time... in the grip of a devastating physical passion which he was completely unable to control.\" In early 1858, Alfred Pretor (1840-1908), a spirited, good-looking friend of Symonds, sent Symonds a letter, telling him that he was having an affair with Vaughan, and showed him several love letters. Symonds did not mention the incident for over a year, and then in 1859, gave the whole story to John Conington. Conington told Symonds to tell his father John Addington Symonds, a doctor."]}, {"page": "Persius", "response": ["The first important editions were: (1) with explanatory notes: Isaac Casaubon (Paris, 1605, enlarged edition by Johann Friedrich Dübner, Leipzig, 1833); Otto Jahn (with the scholia and valuable prolegomena, Leipzig, 1843); John Conington (with translation; 3rd ed., Oxford, 1893), etc.; but there are several modern editions."]}, {"page": "Philip Stanhope Worsley", "response": ["In 1863, he published a volume of Poems and Translations. His unfinished translation of the Iliad was completed after his death by John Conington."]}, {"page": "Carpe diem", "response": ["Seize the present; trust tomorrow e'en as little as you may.Translation by John Conington, 1882"]}, {"page": "Beverley Grammar School", "response": [":John Conington (10 August 1825 – 23 October 1869) who was an English classical Scholar. He was born in Boston, Lincolnshire and was reputed to have been extremely clever learning the alphabet by fourteen months and being able to read at three and a half.", "*John Conington (1825–1869), English classical scholar"]}, {"page": "Dulce et decorum est pro patria mori", "response": ["The poem from which the line comes, exhorts Roman citizens to develop martial prowess such that the enemies of Rome, in particular the Parthians, will be too terrified to resist the Romans. In John Conington's translation, the relevant passage reads:"]}, {"page": "Short, sharp shock", "response": ["John Conington's 1870 translation of the First Satire of Horace includes the following lines: "]}, {"page": "Conington Prize", "response": ["The prize is open to all members of the university and the dissertation may be written in English or Latin. It is named after the English classical scholar John Conington."]}, {"page": "List of presidents of the Oxford Union", "response": ["| align=\"center\" |12px John Conington"]}, {"page": "John Wordsworth (scholar)", "response": ["He resided at Cambridge till 1833, occupying himself with literary pursuits. During this period he contributed to the first number of the ‘Philological Museum’ a review of James Scholefield's Æschylus. In 1833 he visited France, Switzerland, and Italy. At Florence he collated the Medicean manuscript of Æschylus, with a view to a new edition. Some use was made of his material by John Conington in his edition of the Choephoroi. In 1834 he was appointed a classical lecturer in Trinity College, and undertook to edit Richard Bentley's Correspondence (afterwards completed by his brother Christopher Wordsworth, bishop of Lincoln). He also made large collections for a classical dictionary. In 1837 he was ordained deacon, and priest shortly afterwards."]}, {"page": "William Henry Stowe", "response": ["William Henry Stowe (1 January 182522 June 1855), scholar and journalist, eldest son of William and Mary Stowe, was born at Buckingham on 1 January 1825. After attending a school at Iffley, near Oxford, he spent six months at King Edward's School, Birmingham. Leaving at Easter 1840, he studied medicine for three years at Buckingham, but, finding the pursuit uncongenial, entered at Wadham College, Oxford, in January 1844. At Oxford he was intimately associated with George Granville Bradley (afterwards Dean of Westminster), John Conington, and other members of the Rugby set. In 1848 he was placed in the first class in the final classical school with Edward Parry (afterwards Bishop Suffragan of Dover) and William Stubbs (afterwards Bishop of Oxford). After occupying himself for two years in private tuition at Oxford, he began in 1851 a connection with The Times by contributing literary articles, among them a comparison of the characteristics of Thackeray and Dickens. In March 1852 he obtained an open fellowship at Oriel College, and afterwards entered at Lincoln's Inn."]}, {"page": "Eldon Law Scholarship", "response": ["* John Conington, classical scholar (who gave up the scholarship)"]}, {"page": "Corpus Christi Professor of Latin", "response": ["* 1854–1869: John Conington; first incumbent"]}, {"page": "List of student awards", "response": ["| Conington Prize || John Conington (1825–1869) || Cash prize for a dissertation on ancient history, religion, art, and archaeology, or ancient philosophy and ideas, or classical literature, textual criticism, and philology"]}, {"page": "Conington, John", "response": ["#redirectJohn Conington"]}, {"page": "Konstantinos Minas", "response": ["Lewis 1859 edition was entitled Babrii Fabulae Aesopeae: e codice manuscripto partem secundam. It was widely rejected, as giving credibility to the authorship of Babrius, when internal evidence told strongly against: Lewis died in 1863. Carel Gabriel Cobet and Dübner condemned the manuscript L papers as forgery; there was some dissent at the time, from Hermann Sauppe and Theodor Bergk. John Conington wrote that he was convinced against the material by the earlier critical approach of Karl Lachmann."]}]}}