{"wiki_id": "http://www.wikidata.org/entity/Q6224784", "itemLabel": "John Calcraft", "itemDescription": "British politician (1765-1831)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Calcraft_(the_younger)", "wikipedia_page": {"main": "John Calcraft the younger (16 October 1765 – 11 September 1831), of Rempstone in Dorset and Ingress in Kent, was an English landowner and Member of Parliament.\nThe illegitimate son and principal heir of John Calcraft the elder, a politician who had made a fortune as an army contractor, Calcraft inherited his father's estates while still a child. The property included control of the pocket borough of Wareham in Dorset, and while still three months short of coming of age he was returned as its Member of Parliament (MP) in 1786. He is not recorded as having spoken in the House during his first Parliament, and did not stand for re-election in 1790, but subsequently re-entered the House, representing Wareham again (1800–1806 and 1818–1831), Rochester (1806–1818) and Dorset (1831).\nFrom 1800 until 1828, Calcraft was a Whig, and served briefly as a clerk of the ordnance (1806–1807) when the party held power under Lord Grenville. However, in 1828 he accepted office as Paymaster of the Forces in the Duke of Wellington's Tory administration, and was raised to the Privy Council; but he broke with the Tories over parliamentary reform and returned to the Whigs in March 1831, voting for the Reform Bill in the crucial division on the second reading when it passed by a single vote. He was elected as a reformer for the county in the election that followed shortly afterwards, but becoming convinced that both sides in the Commons despised him he became mentally unstable, and later the same year he committed suicide.\nCalcraft married Elizabeth Hales, daughter of Sir Thomas Pym Hales, in 1790, and they had five surviving children. His two sons, John Hales Calcraft and Granby Calcraft, both became MPs for Wareham.", "link_mentions": {}}}