{"wiki_id": "http://www.wikidata.org/entity/Q6223992", "itemLabel": "John Burns", "itemDescription": "Scottish surgeon", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Burns_(surgeon)", "wikipedia_page": {"main": "John Burns MD FRS MIF (13 November 1775 – 18 June 1850) was a Scottish surgeon.", "link_mentions": [{"page": "1775", "response": ["** John Burns, Scottish surgeon (d. 1850)"]}, {"page": "John Burns (disambiguation)", "response": ["John Burns (1858–1943) was an English trade unionist, anti-racist, socialist and politician.", "*John Burns (audio engineer), British recording engineer and producer since the 1960s", "*John Burns (fictional character), a fictional character on the American sitcom Taxi", "*John Burns (radio presenter) (born 1945), Australian radio presenter on 3AW, Melbourne", "*John Burns (Australian rules footballer) (born 1949), Australian former North Melbourne centreman", "*John Burns (baseball) (1861–?), American baseball player", "*John Burns (Irish footballer) (born 1977), Irish footballer", "*John Burns (Scottish footballer) (), Scottish professional footballer", "*John Burns (umpire) (1859–1919), American baseball umpire", "*John Burns (weightlifter) (born 1948), British Olympic weightlifter", "* John Burns (businessman) (born 1944), British property developer", "* John Burns (entomologist), American curator and professor at the Smithsonian Institution", "* John Burns (journalist), Irish journalist for the Irish edition of The Sunday Times", "* John Burns (judge), Australian judge", "* John Burns (minister) (1744–1839), Scottish minister", "* John Burns (surgeon) (1775–1850), Scottish surgeon", "* John Burns, 1st Baron Inverclyde (1829–1901), Scottish ship owner", "*John Burns Hynd (1902–1971), British Labour politician"]}, {"page": "Regius Professor of Surgery (Glasgow)", "response": ["* 1815 – John Burns"]}, {"page": "James Burns (Scottish shipowner)", "response": ["Burns was the third son of the Revd Dr John Burns (1744–1839), minister of the Barony parish of Glasgow, and his wife, Elizabeth, née Stevenson. His eldest brother, Dr John Burns FRS, became the first professor of surgery in the University of Glasgow, and his second brother, Allan Burns, became physician to the empress of Russia at St Petersburg.", "Burns was married twice: first, to Margaret Smith and, second, to Margaret Shortridge, who predeceased him.  With Margaret Shortridge he had one son, John Burns, who inherited his estates and became chairman of the Cunard Line.", "He retired from active business and developed an interest in estate improvement, acquiring the estates of Kilmahew, Cumbernauld, and Bloomhall in Dunbartonshire. He spent much time on improvements and was a liberal supporter of religious and philanthropic enterprises. He died on 6 September 1871 at Kilmahew Castle, Cardross, Dumbarton, and was succeeded in his estates by his only son, John Burns."]}, {"page": "Allan Burns (surgeon)", "response": ["Allan Burns (18 September 1781 – 22 June 1813) was a Scottish surgeon and physician. A lecturer on surgery and anatomy at Glasgow, he studied medicine in Glasgow. He visited Russia in 1804 and he published anatomical treatises. He was the son of Revd Dr John Burns, a minister of the Barony Church, and Elizabeth Stevenson. Of his brothers, Dr John Burns (1775–1850) became Regius Professor of Surgery at the University of Glasgow; James was a shipowner and George was his partner in G & J Burns.", "Allan Burns commenced medical study at fourteen under his brother, John Burns. In 1804 he went to London to seek medical service in the army, and was induced to go to St. Petersburg to take charge of a hospital about to be established by the Empress Catherine on the English plan; but finding the position uncongenial, he returned to Scotland in a few months. He had taken the position for a three-month trial, and very early he 'got into a scrape' for dissecting a Russian, whom he decapitated, and a German. The removal of any body parts was then prohibited, unless they were Tartars or Jews.  He had failed to make arrangements for a salary, and on discovering that government surgeons were paid £90, he returned to Scotland, where he became a highly popular lecturer on anatomy - wearing the diamond and topaz ring given to him by the Empress Catherine when he left Russia. Burns then established himself as a lecturer on anatomy and surgery at Glasgow, his brother having given up his lectures on anatomy, owing to a body-snatching scandal. He attained very considerable success, being both vivid in illustration and accurate in knowledge. Allan authored a number of publications which were quickly translated into German and were published concurrently in the United States. He also published papers in the Edinburgh Medical and Surgical Journal. His work on vascular pressure systems and on heart disease were seen as pioneering and were long in print. In 1809 he published Observations on Diseases of the Heart, and in 1812 Observations on the Surgical Anatomy of the Head and Neck. In the latter, he provides with James Wardrop the first description of what is now considered to be a uveal melanoma that later metastasized to the liver."]}, {"page": "Dr John Burns", "response": ["#REDIRECT John Burns (surgeon)"]}, {"page": "List of fellows of the Royal Society A, B, C", "response": ["| John Burns Brooksby||20/03/1980||25 December 1914 – 17 December 1998", "| John Burns||01/04/1830||1774 – 18 June 1850"]}, {"page": "PS Orion (1847)", "response": ["Orion was a G & J Burns paddle steamer, built by Caird & Co in 1847, which struck a submerged rock and sank off Portpatrick Lighthouse, Wigtownshire, Scotland, on 18 June 1850 on her way from Liverpool to Glasgow, with the loss of 41 of the 200 passengers on board. The eminent surgeon John Burns was one of the passengers killed in the accident. Some of the survivors were rescued by the Isle of Man vessel Fenella, others by boats from Portpatrick."]}, {"page": "George Owen Rees", "response": ["In 1829 Rees entered Guy's Hospital, as apprenticed to Richard Stocker the apothecary there. Later, in 1836, he studied at Paris. In the session of 1836–7 he was enrolled at Glasgow University as a student in the classes of botany (under William Dawson Hooker) and surgery (under John Burns). He graduated M.D. at Glasgow on 27 April 1836, and began to practice in London. He first resided in Guilford Street, Russell Square, subsequently in Cork Street, and finally at 26 Albemarle Street, Piccadilly."]}, {"page": "Blythswood Square", "response": ["*5 - Dr John Burns and Andrew Orr"]}, {"page": "1850 in Scotland", "response": ["* 18 June – John Burns, surgeon (born 1775) (in PS Orion disaster)"]}, {"page": "1775 in Scotland", "response": ["* 13 November – John Burns, surgeon (drowned 1850)"]}, {"page": "Andrew Orr (stationer)", "response": ["in 1858. During his period in office he lived at 5 Blythswood Square,Glasgow Post Office Directory 1855 previously the home of Dr John Burns.Glasgow Post Office Directory 1849"]}]}}