{"wiki_id": "http://www.wikidata.org/entity/Q6224100", "itemLabel": "John Butcher", "itemDescription": "British politician (1946-2006)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Butcher_(British_politician)", "wikipedia_page": {"main": "John Patrick Butcher (13 February 1946 – 25 December 2006) was a Conservative Party politician in the United Kingdom.\nButcher was born in Doncaster but grew up in Huntingdonshire where he was educated at Huntingdon Grammar School and the University of Birmingham. He fought the seat of Birmingham Northfield in February 1974 and was a Birmingham City Councillor from 1972 until 1978.He was Member of Parliament (MP) for Coventry South West from 1979 until 1997, when the seat was abolished by boundary changes. In business he became chairman of Texas Instruments and the Institute of Directors (1997–2001).He was married with three children, including Jessica Butcher, and despite living in Solihull was a common sight at the Carlton Club in London.", "link_mentions": [{"page": "1979 United Kingdom general election", "response": ["|John Butcher"]}, {"page": "Huntingdonshire", "response": ["*John Butcher (1946–2006), Conservative MP and junior minister, was raised in Huntingdonshire and attended Huntingdon Grammar School."]}, {"page": "Maastricht Rebels", "response": ["*John Butcher (Coventry South West)"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|John Butcher"]}, {"page": "Association of British Counties", "response": ["John Butcher was an active member of the group, campaigning in Parliament during the 1990s UK local government reform. In 1991, he suggested to the Secretary of State for Wales the use of the traditional county names Radnorshire, Montgomeryshire and Monmouthshire for unitary authorities in Wales In a 1996 debate, declaring he was honorary president of the ABC, he noted his approval of the abolition of the postal counties, meaning that \"people who live in places like Birmingham, Walsall and Coventry can now use in their addresses the ancient pre-1974 counties\"."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|John Butcher"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|John Butcher"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|John Butcher"]}, {"page": "List of ministers under Margaret Thatcher", "response": ["!scope=row|John Butcher", "!scope=row|John Butcher", "!scope=row|John Butcher"]}, {"page": "Micronet 800", "response": ["Hease negotiated with then telecoms minister John Butcher a £25 subsidy for Micronet subscribers to have their homes equipped free with a telephone jack-socket for the relevant modem."]}, {"page": "Deaths in December 2006", "response": ["*John Butcher, 60, British Conservative MP (1979–1997), heart attack."]}, {"page": "John Butcher", "response": ["John Butcher may refer to:", "*John Butcher (musician) (born 1954), British saxophonist", "*John Butcher (Australian footballer) (born 1991), Australian rules footballer with the Port Adelaide Football Club", "*John Butcher, 1st Baron Danesfort (1853–1935), British lawyer", "*John Butcher (British politician) (1946–2006), Conservative MP for Coventry South-West 1979–1997", "*John Butcher (baseball) (born 1957), former Major League Baseball player", "*John Butcher (English footballer) (born 1956), English association football goalkeeper who played for Blackburn"]}, {"page": "John Patrick Butcher", "response": ["#REDIRECT John Butcher (British politician)"]}, {"page": "Coventry South West (UK Parliament constituency)", "response": ["|| 1979 || John Butcher || Conservative || Retired at 1997 general election, following boundary changes"]}, {"page": "Hinchingbrooke School", "response": ["* John Butcher, Conservative MP from 1979–97 for Coventry South West"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Sir John Butcher, 1st Baronet; MP for York (1892–1906; 1910–1923)", "*John Butcher; MP for Coventry South West (1979–1997)"]}, {"page": "First Thatcher ministry", "response": ["|John Butcher||6 April 1982 – 12 June 1983|| "]}, {"page": "Second Thatcher ministry", "response": ["|rowspan=5|Under-Secretary of State for Trade and Industry||John Butcher||14 June 1983 – June 1987|| "]}, {"page": "Third Thatcher ministry", "response": ["|John Butcher||26 July 1988 – 24 July 1989|| ", "|rowspan=6|Under-Secretary of State for Trade and Industry||John Butcher||June 1987 – 26 July 1988|| "]}, {"page": "List of Question Time episodes", "response": ["|John Banham, John Butcher, Laura Grimond, Ken Livingstone"]}, {"page": "Evolution of Worcestershire county boundaries since 1844", "response": ["The West Midlands Special Review and subsequent West Midlands Order 1965 legislation could be defined as the first real attempt by Government, at creating a unified Black Country for administrative purposes, albeit under the county borough system. Fig 9 - demonstrates that a Proto - West Midlands County appeared to be in existence eight years before the metropolitan county was formally established, if Birmingham and Solihull were also factored in. Although not all areas of the West Midlands conurbation were incorporated into a county borough. The Local Government Act 1972 legislated for a new metropolitan administrative unit to be known as the County of West Midlands,H.M. Government Local Government Act 1972 – Retrieved 8 August 2014 incorporating the North West Warwickshire, South Staffordshire and North Worcestershire border area. The Act also legislated that the new county would be sub-divided into metropolitan districts,Local Government Act 1972, Schedule I, Part I, Metropolitan Counties and Metropolitan Districts although most districts became metropolitan boroughs after being granted or regranted Royal charters giving them borough status.Local Govt. Act 1972, c. 70; The Metropolitan Districts (Names) Order 1973, S.I. 1973, no. 137; letters patent of 27 Feb. 1974 granting the district of Sandwell borough status (in possession of the chief executive) The West Midlands was to be largely centred on the Birmingham and Black Country county boroughs, but with a boundary roughly matching the West Midlands conurbation, as per Fig 11. However the Meriden Gap in Warwickshire was included, enabling Coventry to be incorporated into the new structure.Local Government Act 1972 (1972) c. 70 SCHEDULE 1 Part III Section 1 Within this new authority; Dudley County Borough along with Stourbridge and Halesowen formed Dudley Metropolitan District (later to become Dudley Metropolitan Borough), while Warley County Borough merged with West Bromwich to create Sandwell. Most of the rural hinterland proposed by Redcliffe-Maud was discarded; thus permitting Bewdley, Bromsgrove, Kidderminster, Redditch and Stourport-on-Severn to become part of the new Hereford & Worcester authority. On 1 April 1974; (the day of local government reorganisation) an article in The Times quoted an unnamed 'Department of the Environment' official who said \"The new county boundaries are solely for the purpose of defining areas of first-level government of the future: They are administrative areas and will not alter the traditional boundaries of counties, nor is it intended that the loyalties of people living in them will change\"Gledhill, Raymond \"White Rose ties hold fast despite amputation and shake-up of boundaries\" The Times, 1 April 1974 The Ministry of Housing, Communities and Local Government's guidance entitled 'Celebrating the historic counties of England' stated \"The Act did not specifically abolish historic counties, but they no longer exist for the purposes of the administration of local government, although some historic county areas may be coterminous with non-metropolitan county areas established by the 1972 Act\".HM Government Celebrating the historic counties of England - July 2019 - Retrieved 22 February 2020 Despite the vague reassurances from Government, the new authority was not popular. John Butcher MP (Coventry South West) said in Parliament during 1982 \"The West Midlands Metropolitan County Council is as useful to local government as the appendix is to the digestive system. Its presence is unnecessary and it becomes noticeable only when it malfunctions.\""]}, {"page": "List of United Kingdom MPs who died in the 2000s", "response": ["|John Butcher"]}, {"page": "Jessica Butcher", "response": ["Jessica Butcher  is the co-founder of Blippar and social media video platform Tick. In 2012, she was listed as Fortune \"10 Most Powerful Women Entrepreneurs\", and one of the BBC's 100 Women in 2014. She was one of four new Equality and Human Rights Commission (EHRC) board commissioners appointed in November 2020. She is the daughter of late Conservative MP for Coventry South West, John Butcher."]}]}}