{"wiki_id": "http://www.wikidata.org/entity/Q6222217", "itemLabel": "John Bligh", "itemDescription": "Royal Navy officer during the American War of Independence and the French Revolutionary and Napoleonic Wars.", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Bligh_(Royal_Navy_officer)", "wikipedia_page": {"main": "John Bligh CB (August 1770 – 19 January 1831) was an officer in the Royal Navy who served during the American War of Independence and the French Revolutionary and Napoleonic Wars.\nBligh was born into a naval family and served on a variety of ships from a young age, moving up through the ranks to lieutenant prior to the outbreak of the wars with France. He was in the East Indies when war broke out, but returning to Britain he saw action in the Mediterranean during the early attacks on Corsica, the Siege of Toulon and the Battle of Cape St Vincent. Promoted to his own commands in 1797, he was the victim of a mutiny on his ship, when his crew joined the larger mutinies at Spithead, and was sent ashore. He returned after it had ended and went on to serve at Newfoundland, before beginning a long period of distinguished service in the Caribbean. He was active in the Blockade of Saint-Domingue after the outbreak of the Napoleonic Wars, and arranged the surrender and evacuation of several French-held positions. He then took charge of an expedition to Curaçao, but withdrew his forces in the face of heavy opposition. His final actions there involved several successes against enemy privateers and merchant shipping.\nReturning to Britain in 1806, Bligh went out with the fleet to the Baltic and was present at the Battle of Copenhagen. He then sailed to the Portuguese coast, where he was active landing troops and supporting the army's operations there. He was involved in the Battle of the Basque Roads in 1809, directing efforts to destroy several grounded French ships. While cruising off Belle Île in 1810 he had the good fortune to intercept a French vessel carrying the wealth of the merchants of Île de France back to France. Suddenly wealthy from the prize money and in weakening health after his long service in the tropics, Bligh retired ashore. He settled on the south coast, receiving an appointment as a Companion of the Bath, and a promotion to rear-admiral before his death in 1831.", "link_mentions": [{"page": "HMS Theseus (1786)", "response": ["Four years later a refitted Theseus took part Blockade of Saint-Domingue in 1803, under Captain John Bligh. "]}, {"page": "Battle of Copenhagen (1807)", "response": ["* Alfred 74 (Captain John Bligh)"]}, {"page": "Battle of the Basque Roads", "response": ["Although Gambier had no intention of risking his fleet in the narrow waters of Basque Roads, he had permitted three more transports to be fitted out as fireships, and at 17:30 these were led into the anchorage by Stopford in Caesar, accompanied by Theseus and several launches equipped to fire Congreve rockets. At 19:40 however Caesar grounded on a shoal and remained stuck there until 22:30, close to Valiant, which had also grounded at low tide. At this point six surviving French ships; Océan, four of the line and the frigate Indienne, remained aground close to the mouth of the Charente, while the remainder of the fleet had escaped upriver to secure anchorages.James, p. 116 During the night the wind blew from the land, rendering a fireship attack impractical, and so the British contented themselves with setting Ville de Varsovie and Aquilon on fire, both ships determined by John Bligh on Valiant, over Cochrane's objections, to have been damaged beyond repair.Cordingly, p. 200 During this operation, one of the new fireships was wrecked on a shoal.James, p. 117 The weather was so bad that night that the planned attack with the remaining fireships was abandoned as unfeasible.Clowes, p. 266"]}, {"page": "John Moultrie (politician)", "response": ["Following the Revolutionary War and the loss of Florida by the British, Moultrie moved to England and died there in 1798. He was buried at Shifnal Church in Shropshire. In 1809, his daughter Cecilia married the naval officer John Bligh at St Marylebone. Moultrie's grandson, John Moultrie, was an English clergyman hymn-writer. His great-grandson, Gerard Moultrie, was also a hymn-writer."]}, {"page": "HMS Latona (1781)", "response": ["John Bligh assumed command in May 1797 when Latona served as flagship to Admiral William Waldegrave. At the end of the month, she set sail for Newfoundland, where the Admiral was to serve as the newly appointed governor. In November Frank Sotheron became Latonas captain and on 29 November was off Portugal when she captured the French Bordeaux-based privateer schooner Aigle about  north by west from Lisbon. Aigle had sailed from near Bayonne, on 6 November, but had captured nothing. She was pierced for 14 guns but carried only 12 small carriage guns, and had a crew of 62 men under the command of Francis Harimendy."]}, {"page": "French frigate Minerve (1794)", "response": ["It was during this transit that , under Captain John Bligh, recaptured her on 3 February 1810 near Belle Île after a six-hour chase. She was armed with only 14 guns and had a crew of 135 men, under the command of Captain Jacques François Perroud. She had been 93 days in transit when she was captured, having eluded British vessels 14 times. She was carrying goods worth £150,000,James (1837), Vol. 5, p.97. General Decaen having made her available to the merchants of Île de France to carry home their merchandise. Amongst her passengers was César-Joseph Bourayne."]}, {"page": "French ship Nestor (1793)", "response": ["In April 1809, the French Atlantic Fleet was blockaded by the Royal Navy in Basque Roads at the mouth of the Charente on the Biscay coast of France. On 12 April, during the Battle of Basque Roads, Aquilon was aground on rocks at low tide in Basque Roads near Charenton when British Royal Navy warships attacked.James, William (2002) [1827]. The Naval History of Great Britain, Volume 5, 1808–1811. London: Conway Maritime Press. , p. 111. During the afternoon, the British brig-sloop  took up a position across her bows and raked her with heavy carronades. After two hours of pounding by the British fleet with little chance to fire back, Aquilon surrendered.Clowes, William Laird (1997) [1900]. The Royal Navy, A History from the Earliest Times to 1900, Volume V. London: Chatham Publishing. , p. 264. Although the leader of the British attack, Lord Thomas Cochrane, disapproved of the decision, the commanding officer of the third rate ship of the line , Captain John Bligh, deemed Aquilon beyond repair and set her afire during the night of 12-13 April 1809. The fire completed the destruction of Aquilon′s wreck.Cordingley, David (2007). Cochrane the Dauntless. London: Bloomsbury Publishing. , p. 200."]}, {"page": "Phipps Hornby", "response": ["In 1797, Britain was embroiled in the French Revolutionary Wars, and Hornby's ship  became caught up in the Nore Mutiny just weeks after he joined her. Latona's captain, John Bligh, took Hornby with him when he moved ships, and Hornby saw service on ,  and , mainly serving in the Americas."]}, {"page": "Sir Henry Baker, 2nd Baronet", "response": ["In July 1802 he joined  under Captain Bendall Robert Littlehales, and after taking part in the capture of Saint Lucia under Admiral Sir Samuel Hood, he and Littlehales returned home aboard the hired brig Morne Fortunee with despatches in June 1803. He was then attached to , Captain the Honourable Alexander Cochrane, but soon returned to the West Indies to serve aboard  under Captain John Bligh in operations at Saint-Domingue. Baker took part in the blockade of Cape François; the capture of Fort Dauphin, where two forts and a 28-gun corvette La Sagesse, were taken; and the surrender of the French squadron with the remains of General Rochambeau's army on board."]}, {"page": "HMS Romney (1762)", "response": ["Command then passed to Captain Charles Hamilton. Henry Inman was briefly in command for her return to Britain in March 1795, whereupon Captain Frank Sotheron took over in June when Romney became the flagship of Vice-Admiral Sir James Wallace and returned to Newfoundland. The vessel spent the next several years sailing to and from Newfoundland, under the command of Captain Percy Fraser from June 1797, and then Captain John Bligh from July 1797 when Vice-Admiral William Waldegrave took over the station."]}, {"page": "French frigate Surveillante (1802)", "response": ["Surveillante was present at Saint Domingue (Haiti) in November 1803 during the revolt of slaves against the French, and was trapped by the British blockade of Saint-Domingue. The French naval commander who was also Surveillantes captain, Henry Barre, prevailed upon British Commodore John Loring's representative, Captain John Bligh, to accept the capitulation of Surveillante, in order to put her, as well as her crew and passengers, under British protection. The former slaves threatened to fire red hot shot at the ship from the overlooking forts.", "* On 9 January 1805, Surveillante, Captain John Bligh commanding, in company with , Edward Hawker commanding, captured the Spanish ship El Batidor."]}, {"page": "French ship Ville de Varsovie", "response": ["In April 1809, Ville de Varsovie was part of the French Atlantic Fleet blockaded in Basque Roads at the mouth of the Charente on the Biscay coast of France by a Royal Navy squadron. On the afternoon of 12 April, during the Battle of Basque Roads, Ville de Varsovie was aground on rocks at low tide in Basque Roads near Charenton when British warships attacked.James, William (2002) [1827]. The Naval History of Great Britain, Volume 5, 1808–1811. London: Conway Maritime Press. , p. 111. After two hours of pounding by the British fleet with little chance to fire back, Ville de Varsovie surrendered after her crew suffered about 100 casualties,Clowes, William Laird (1997) [1900]. The Royal Navy, A History from the Earliest Times to 1900, Volume V. London: Chatham Publishing. , p. 264.James, William (2002) [1827]. The Naval History of Great Britain, Volume 5, 1808–1811. London: Conway Maritime Press. , p. 115. and the British 74-gun third rate ship of the line  captured her. Although the leader of the British attack, Lord Thomas Cochrane, disapproved of the decision, the commanding officer of the 74-gun third rate ship of the line , Captain John Bligh, deemed Ville de Varsovie beyond repair and set her afire during the night of 12–13 April 1809. The fire completed the destruction of Ville de Varsovie during the predawn hours of 13 April 1809.Cordingley, David (2007). Cochrane the Dauntless. London: Bloomsbury Publishing. , p. 200."]}, {"page": "John Lawford", "response": ["Lawford was baptised 3 July 1757 in Portsea, the eldest son of John Lawford of Gosport and Sarah Gover of Portsea. He entered the navy at an early age. He served during the war with America, and was first lieutenant aboard the 90-gun  at the Battle of the Saintes. In October 1788 he commissioned the brig  and commanded her for the next two years. Lawford then took command of the 16-gun sloop  during the Spanish Armament and was stationed initially in the English Channel, before departing for Jamaica on 22 October 1790, where he spent the next two years. He was promoted to post-captain on the outbreak of war with France in 1793, and took command of the newly captured 36-gun . He sailed as an escort for a convoy to Britain on 5 February the following year, but his command was short-lived as Convert was wrecked three days later on a reef off the East End of Grand Cayman; the wreck later referred to as the Wreck of the Ten Sail. While court martialled as a result of the shipwreck, Lawford was acquitted and the event did not adversely affect his career.  Lawford remained in service to the Royal Navy and in January 1798 took command of the 64-gun . His time aboard her was brief, and in March he handed her over to Captain John Bligh and took up command of Bligh's old ship, the 50-gun ."]}, {"page": "John Bligh", "response": ["John Bligh may refer to:", "* John Bligh, 1st Earl of Darnley (1687–1728), Irish MP for Trim and for Athboy 1713–1721", "* John Bligh, 3rd Earl of Darnley (1719–1781), his son, Irish MP for Athboy 1739–1747, British MP for Maidstone", "* John Bligh, 4th Earl of Darnley (1767–1831), his son, British peer and cricketer", "* John Bligh, 6th Earl of Darnley (1827–1896), British peer", "* John Bligh (medical educator), British doctor and medical educator", "* John Bligh (Royal Navy officer) (1770–1831), British naval officer "]}, {"page": "Charles Ross (Royal Navy officer)", "response": ["In early 1804 Ross took part in an expedition led by Captain John Bligh to capture the Dutch island of Curaçao. The British believed that the garrison there was only 160 strong, and weakened by disease, so their force consisted only of the 74s  and , frigates  and Pique, and the schooner Gipsy. On their arrival at the Willemstad on 31 January the British learned that they had been misinformed about the local strength, which consisted of 250 regular troops, reinforced by a local militia and the crews of the vessels in the harbour. The Dutch refused to surrender, and unable to force the harbour, which was defended by shore batteries, the frigate Hatslaar and two French privateers, the British were compelled to attempt a landing. Leaving the two frigates to blockade the harbour, the British sailed to a nearby cove and landed a 605-man strong force of seamen and marines which captured Fort Piscadero. The British then landed guns, and erected artillery batteries on heights to the west of the town. Over the next few days the British, the Dutch in Fort Amsterdam and their French allies fought an artillery duel and several skirmishes with little result, so the British turned their guns on the town and shipping, destroying some of the former by fire. However, disease, casualties, and lack of provisions soon took their toll on the British, who were eventually forced to abandon the enterprise on 25 February."]}, {"page": "Blockade of Saint-Domingue", "response": ["The Royal Navy was well prepared for the renewed conflict, with a squadron of ships of the line and numerous frigates based at the Jamaica station, the Navy's western Caribbean base, under Rear-Admiral John Thomas Duckworth. On 18 June 1803 two squadrons were sent to enact a blockade of the principal northern ports in French hands, Cap Français to the east and Môle-Saint-Nicolas to the west.James, p. 207 The first squadron, which cruised off Môle-Saint-Nicolas consisted of the 74-gun ships of the line HMS Cumberland under Captain Henry William Bayntun, HMS Goliath under Captain Charles Brisbane and HMS Hercule under the acting command of Lieutenant John B. Hills.James, p. 187 The second squadron, assigned to the blockade of Cap Français, was commanded by Commodore John Loring in HMS Bellerophon and included HMS Elephant under Captain George Dundas, HMS Theseus under Captain John Bligh and HMS Vanguard under Captain James Walker. Loring's force was accompanied by the frigates HMS Aeolus under Captain Andrew Fitzherbert Evans and HMS Tartar under Captain John Perkins."]}, {"page": "Jacques François Perroud", "response": ["From 1807, Perroud captained the Curieux, and from 1809 the Confiance (formerly the French Navy frigate Minerve). On 3 February 1810, Confiance was captured by  HMS Valiant, under Captain John Bligh."]}, {"page": "HMS Europa (1783)", "response": ["*John Bligh - Royal Navy officer, served during the American War of Independence and the Napoleonic Wars. "]}, {"page": "HMS Kingfisher (1782)", "response": ["Commander George Lumsdaine took over in November 1786, and was in turned superseded by Commander Henry Warre in April 1788. Kingfisher went on to serve under a succession of commanders during the last years of peace and the early years of the French Revolutionary War. Commander Charles Jones was captain from May 1791, succeeded by Commander William Brown in June 1792, and Brown in turn by Commander Thomas Graves in November that year. From April 1794 she was under Commander Thomas Le Marchant Gosselin, though he was replaced by Commander Alexander Wilson in August 1795. Wilson's command was short-lived, in September Kingfisher was under Commander Edward Marsh, who took her out to the West Indies in March 1796, and then to the Lisbon station in January 1797. Marsh was soon superseded by Commander John Bligh, who had distinguished himself at the Battle of Cape St Vincent on 14 February 1797, and been rewarded with a promotion to commander on 8 March 1797 and the command of Kingfisher. While cruising off Oporto he was able to capture the 14-gun French privateer Général on 29 March."]}, {"page": "Fort Amsterdam (Curaçao)", "response": ["In 1804 a cannonball fired by British captain John Bligh, of , hit the church. Bligh led a small squadron that captured the fort in February 1804. The ball is still embedded in the southwestern wall of the fort church."]}, {"page": "HMS Emerald (1795)", "response": ["At 20:00, Emerald, along with the other British frigates and brigs, weighed and anchored with the 74-gun  in the Maumusson passage to the south of Oléron while a second fireship attack was under preparation.James (Vol. V) pp. 116–117 Although the fireships were ready in the early hours on the 13th, contrary winds prevented their deployment. The British instead set Varsovie and Aquilon alight just after 03:00, on the orders of Captain John Bligh, after removing their crews.James (Vol. V) p. 117. Emerald, and the other vessels moored with her, were recalled at 05:00 but owing to the lack of water, only the brigs were able to pass further up the river.James (Vol. V) pp. 118–119. Emerald therefore took no further part in the attack, which continued until 29 April when the last French ship was able to free herself from the mud and escape up the river to Rochefort.James (Vol. V) p. 122."]}, {"page": "Order of battle at the Battle of the Basque Roads", "response": ["| align= left | Captain John Bligh"]}, {"page": "Court-martial of James, Lord Gambier", "response": ["There followed brief testimony from John Dyer, an Admiralty clerk, John Spurling again and then John Wilkinson, Secretary to Lord Gambier, to attest to the accuracy of some of the documents presented to the court.Gurney, p. 139 There was then a close examination by Gambier of Edward Fairfax, Master of the Fleet and drafter of the charts presented to the court, followed by the recalled Thomas Stokes. Both officers testified as to the accuracy of their charts and corroborated Gambier's evidence of the disposition of the anchorage and of the French fleet.Harvey, p. 145 Gambier then called Captain John Bligh of HMS Valiant, who led the reinforcements on 12 April. Bligh described his ships as in \"a perilous situation\", and testified that they were in danger of being wrecked.Gurney, p. 155 The court was then adjourned once more."]}, {"page": "Tomás O'Neill", "response": ["On 26 March 1806 Captain John Bligh arrived on the H.M.S. Surreyance with 144 sailors and soldiers. With only around 30 soldiers in the island's garrison, O´Neill was persuaded to surrender. Bligh thus took control of the islands. He transported O'Neill to the continent and dropped him, his brother Enrique, a priest, and his men on a beach near Cartagena. As he had surrendered to Bligh, he was court-marshalled by the authorities, but was subsequently acquitted. O'Neill returned to the Islands on the 17th of October 1807. Bligh having left the islands poorly defended, O'Neill and his military force took back the islands for Spain. "]}]}}