{"wiki_id": "http://www.wikidata.org/entity/Q6228605", "itemLabel": "John Darwin disappearance case", "itemDescription": "former teacher and prison officer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Darwin_disappearance_case", "wikipedia_page": {"main": "The John Darwin disappearance case was an investigation into the faked death of the British former teacher and prison officer John Darwin. Darwin turned up alive in December 2007, five years after he was believed to have died in a canoeing accident.\nDarwin was arrested and charged with fraud. His wife, Anne, was also arrested and charged for helping Darwin to collect his life insurance of £250,000. The fraudulent death also allowed the couple to pay off their £130,000 mortgage. In December 2007, after it was revealed the couple had been photographed together in Panama a year earlier, Anne confessed to knowing Darwin was alive and that he had been secretly living in their house and the house next door, which allowed him to get the insurance money illegally for his own personal gain. On 23 July 2008. John and Anne Darwin were each sentenced to more than six years in prison.", "link_mentions": [{"page": "John Jones", "response": ["*John Jones, alias used in the John Darwin disappearance case"]}, {"page": "List of premature obituaries", "response": ["* John Darwin: this British prison officer was presumed to have drowned in March 2002 when he disappeared while canoeing in the sea near Hartlepool. Despite a huge search operation, and the calm weather, only his paddle was found, followed weeks later by the wreckage of his canoe. An inquest declared him dead. However, in December 2007, Darwin walked into a London police station, announcing: \"I think I'm a missing person\", and claiming to have no memory of the past five years. Darwin's wife Anne, who had claimed his life insurance, says he turned up at their home in 2003 and lived in secret there and next door for three years. They also spent time together in Panama, where they planned to set up a hotel for canoeing holidays; she emigrated there shortly before Darwin reappeared. Both Darwin and his wife were subsequently convicted and imprisoned.See references in John Darwin disappearance case."]}, {"page": "Kathy Beale", "response": ["Taylforth reprised the role for a charity special in 2014. In the episode broadcast on 19 February 2015, the character made a surprise return to the serial - despite being presumed dead. It was confirmed that the character would be making a permanent return, and - after a guest appearance on 19 May 2015 - Kathy returned permanently on 17 August 2015. Taylforth was initially hesitant about her reintroduction storyline, which was inspired by the John Darwin disappearance case. Kathy's husband, Gavin Sullivan (Paul Nicholas), was also introduced following her return and their turbulent marriage was explored. The character later had an affair with Buster Briggs (Karl Howman), and became critical in the events surrounding Max Branning's (Jake Wood) revenge campaign Albert Square - in light of the Who Killed Lucy Beale? saga - when James Willmott-Brown reappeared in his plan to recoup his relationship with Kathy by taking control of the square for her. Additionally, Kathy has had a brief relationship with Masood Ahmed (Nitin Ganatra) and feuds with both Max Branning (Jake Wood) and Rainie Cross (Tanya Franks) over the custody of her step-grandson Steven's daughter, Abi Jr.", "The character made an unannounced return during a live segment which aired on 19 February 2015 during EastEnders Live Week commemorating the 30th anniversary. Gillian Taylforth was initially hesitant about the storyline. \"I couldn't understand how they could work around the fact that she could do that to her children\" the actress explained. In September 2015, Treadwell-Collins said to the Daily Mirror that the story was inspired by the real life John Darwin disappearance case where John—also known as the Canoe man—with the help of his wife Anne faked his death in a canoe accident in March 2002 in order to claim the insurance. Kathy's husband Gavin Sullivan (Paul Nicholas) had convinced her to fake her death to keep her children safe."]}, {"page": "Saskia Reeves", "response": ["In 2010, she starred as Anne Darwin, the wife of John Darwin, in BBC4's Canoe Man, a dramatisation of the John Darwin disappearance case, and co-starred in the BBC1 series Luther."]}, {"page": "Darren Osborne", "response": ["Initially characterised as a \"bad boy\", Darren has become notable for maturing throughout his tenure. One of his most notable storylines included his battle with a gambling addiction, which led him losing his share in The Dog in the Pond public house, resulting in him being disowned by his family. Darren later helped his father, Jack (Jimmy McKenna), to fake his own death as part of a scam, which drew comparisons to the John Darwin disappearance case. Darren has been known for his multiple relationships, including Cindy Cunningham (Stephanie Waring), a \"shotgun\" marriage to Hannah Ashworth (Emma Rigby), a brief affair with his mother-in-law Suzanne Ashworth (Suzanne Hall), two marriages to Nancy Hayton (Jessica Fox), an affair and subsequent relationship with Sienna Blake (Anna Passey) and his various relationships and brief affair with Mandy Richardson (Sarah Jayne Dunn). Darren has three biological children: twins Jack and Francine (with Suzanne) and Oscar (with Nancy). He has also adopted Nancy's nephew Charlie Dean (Charlie Behan), who Nancy in turn adopted after her sister's death years prior. In 2013, the character was the lead of a storyline where he found out that Sandy Roscoe (Gillian Taylforth) is his biological mother, meaning that he had five half-brothers and became a part of the Roscoe family. Between 2019 and 2020, Darren constructed a friendship with Nancy's new partner Kyle Kelly (Adam Rickitt), in a storyline which saw Kyle support Darren after he became depressed."]}, {"page": "Peter Cellier", "response": ["On television, Cellier has appeared in a wide range of programmes since 1955, including detective series such as Softly, Softly and Bergerac, adventure series such as Doctor Who, historical dramas such as The Six Wives of Henry VIII, Upstairs, Downstairs and The Duchess of Duke Street, and is perhaps best known for his work in two John Mortimer series, Rumpole of the Bailey (in which he played the role of Sir Frank Fawcett, Permanent Secretary for Defence), Paradise Postponed. He also appeared in the sitcoms It Ain't Half Hot Mum, Yes Minister and its sequel Yes, Prime Minister (1981–87) and Keeping Up Appearances, as the Major (1990–91), among others. In the two Minister series, he played Sir Frank Gordon, the Permanent Secretary to HM Treasury, urbanely contending with Nigel Hawthorne's Sir Humphrey Appleby for supremacy within the civil service. He played Roy Difford in the Casualty episode \"The Silence of Friends\".\"The Silence of Friends\" episode of Casualty (2007) at the IMDB database and the Judge in BBC Four's Canoe Man (2010), which recounted the John Darwin disappearance case."]}, {"page": "John Darwin", "response": ["* John Darwin disappearance case, British criminal who in 2002 faked his own death in a canoeing accident"]}, {"page": "Canoe man", "response": ["#REDIRECT John Darwin disappearance case"]}, {"page": "John Darwin (prison officer)", "response": ["#REDIRECT John Darwin disappearance case"]}, {"page": "John Darwin (missing person)", "response": ["#REDIRECT John Darwin disappearance case"]}, {"page": "John Darwin disappearance", "response": ["#REDIRECT John Darwin disappearance case"]}, {"page": "John Darwin (canoeist)", "response": ["#REDIRECT John Darwin disappearance case"]}, {"page": "Seaton Canoe", "response": ["#REDIRECT John Darwin disappearance case"]}, {"page": "Jeremy Swift", "response": ["In 2009, he played the lead in the true story of art forger Shaun Greenhalgh in The Antiques' Rogue Showhttps://www.imdb.com/title/tt1353089/ for BBC2 with Liz Smith and Peter Vaughn, The Deacon in a film adaptation of Anton Chekhov's short story The Duel and featured in Canoe Man, a 2010 TV drama based on the John Darwin disappearance case."]}, {"page": "Canoe Man", "response": ["#REDIRECT John Darwin disappearance case"]}, {"page": "John Darwin (fraudster)", "response": ["#REDIRECT John Darwin disappearance case"]}, {"page": "Anne Darwin (fraudster)", "response": ["#REDIRECT John Darwin disappearance case"]}]}}