{"wiki_id": "http://www.wikidata.org/entity/Q6224066", "itemLabel": "John Bury", "itemDescription": "British set, costume and lighting designer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Bury_(theatre_designer)", "wikipedia_page": {"main": "John Bury OBE  (27 January 1925 - 12 November 2000) was a British set, costume and lighting designer who worked for theatres in London, the rest of the UK, and Broadway and international opera.\nJohn was educated at Hereford Cathedral School. After a period working for Theatre Workshop under the direction  Joan Littlewood at the Theatre Royal Stratford East in London, he joined the Royal Shakespeare Company in 1963, whose artistic director was then Peter Hall. He became Head of Design and associate director of the National Theatre Company in 1973, then still based at the Old Vic. For Hall's Broadway production of Amadeus by Peter Shaffer, Bury was nominated for Tony Awards for scenery, costumes and lighting and received the award for scenery and lighting.\nHe was also nominated for 5 more Tony Awards including his first production on Broadway, Harold Pinter's The Homecoming in 1967 and was appointed OBE in the 1979 New Year Honours.", "link_mentions": [{"page": "Amadeus (play)", "response": ["The play premiered on Broadway on 11 December 1980 at the Broadhurst Theatre, with Ian McKellen as Salieri, Tim Curry as Mozart and Jane Seymour as Constanze. It ran for 1,181 performances, closing on 16 October 1983 and was nominated for seven Tony Awards (Best Actor for both McKellen and Curry, Best Director for Peter Hall, Best Play, Best Costume Design, Lighting and Set Design for John Bury), of which it won five (including Best Play and Best Actor for McKellen). In 2015, Curry stated in an interview that the original Broadway production was the favorite stage production that he had ever been in. During the run of the play McKellen was replaced by John Wood, Frank Langella, David Dukes, David Birney, John Horton and Daniel Davis. Curry was replaced by Peter Firth, Peter Crook, Dennis Boutsikaris, John Pankow, Mark Hamill and John Thomas Waite.Thomas, Bob. \"Hamill changes pace as star of 'Amadeus'\" Pittsburgh Post-Gazette, 20 July 1983 Also playing Constanze were Amy Irving, Suzanne Lederer, Michele Farr, Caris Corfman and Maureen Moore."]}, {"page": "Theatre Workshop", "response": ["MacColl had not supported the move to London, and left the company to concentrate on folk music. With Littlewood, as director, Gerry Raffles (1928–75) as manager and John Bury as designer, the Theatre Workshop continued to present a mixed programme of classics and modern plays with contemporary themes. The cast and crew (again excluding Littlewood, who was then living with Raffles) lived and worked as a commune, sharing the many tasks associated with running and maintaining a theatre, and with a duty roster for \"chef of the week\"."]}, {"page": "John Bury", "response": ["John Bury may refer to:", "*John Bury (English politician) (by 1478-1522/23), MP for Cambridge (UK Parliament constituency)", "*John Bury (Irish politician) (by 1715), MP for Askeaton (Parliament of Ireland constituency)", "*John Bury (translator) (1535–1571), English translator", "*John Bury (divine) (1580–1667), English divine", "*John Bury (captain) (1915–2006), master mariner", "*John Bury (theatre designer) (1925–2000), British theatre designer", "*John Bury (priest) (fl. 1430s - 1470s) Canon of Windsor"]}, {"page": "The Rothschilds (musical)", "response": ["| John Bury"]}, {"page": "Oh, What a Lovely War!", "response": ["The official censor did not grant permission for a transfer to the West End until Princess Margaret attended a performance and commented to the Lord Chamberlain, Lord Cobbold, that \"What you've said here tonight should have been said long ago, don't you agree, Lord Cobbold?\"; at this point the transfer was more or less assured despite the objections of the family of Field Marshal Haig. It was an ensemble production featuring members of the theatre's regular company, which included Brian Murphy, Victor Spinetti and Glynn Edwards, all of whom played several roles. The sets were designed by John Bury. The production subsequently transferred to Wyndham's Theatre in June of the same year. The production was a surprise hit, and the musical was adapted by the BBC for radio several times."]}, {"page": "A Taste of Honey", "response": ["*Setting by John Bury"]}, {"page": "Tony Award for Best Lighting Design", "response": ["| John Bury", "| John Bury", "| John Bury", "* John Bury"]}, {"page": "Betrayal (play)", "response": ["Betrayal was first produced by the National Theatre in London on 15 June 1978. The original cast featured Penelope Wilton as Emma, Michael Gambon as Jerry, Daniel Massey as Robert, and Artro Morris as the waiter; Wilton and Massey were married at the time. It was designed by John Bury and directed by Peter Hall.", "The American premiere took place on Broadway on 5 January 1980 at the Trafalgar Theatre, and ran for 170 performances until it closed on 31 May 1980. The show was directed by Peter Hall, was designed by John Bury, the production stage manager was Marnel Sumner, the stage manager was Ian Thomson, and press was by Seymour Krawitz and Patricia McLean Krawitz. Raul Julia starred as Jerry, Blythe Danner as Emma, Roy Scheider as Robert, Ian Thomson as the Barman, and Ernesto Gasco as the Waiter."]}, {"page": "Family Voices", "response": ["*John Bury, Design and Lighting"]}, {"page": "Hereford Cathedral School", "response": ["*John Bury (theatre designer), theatre designer and Tony Award winner"]}, {"page": "The Homecoming", "response": ["For many critics the missing \"back wall\" in the \"large room\" of the house described by Pinter as \"removed\" (p. 21) and by Teddy as \"knocked [...] down to make an open living area\" after Jessie's death (p. 37) symbolises the absent female influence.\"A Designer's Approach: An Interview with John Bury, pp. 27–35 in Lahr, Casebook.Hannah Davies, The Homecoming, York Theatre Royal (2009), British Theatre Guide, accessed 10 March 2014.See the double-page illustration of the original set for the London production, by John Bury, in the front matter of the Lahrs' Casebook.In Demolition Man, Lahr mentions that the 2007 New York set design is not vast enough to parallel the text's references to its being \"a large room, extending the width of the stage.\""]}, {"page": "Tony Award for Best Scenic Design", "response": ["| John Bury", "| John Bury", "| John Bury", "| John Bury"]}, {"page": "Michael Blakemore", "response": ["Blakemore and Hall had been rivals during the 1959 season at the Royal Shakespeare Company, when Hall had directed Blakemore as an actor and both had had romantic ideas about Vanessa Redgrave.Blakemore (2013) p.147. Neither of their passions were requited, but Hall did not renew Blakemore's contract. Tom Chester, a character in Blakemore's novel Next Season – a devious and aloof theatre director – is recognisable as Peter Hall. Blakemore became one of ten associate directors forming what was called a planning committee.The others were John Schlesinger, Harold Pinter, John Bury, Michael Birkett, Peter Stevens, Bill Bryden, John Russell Brown, Mike Kustow and Harrison Birtwistle Blakemore and Hall's rivalry was dramatised when Blakemore presented a formal manifesto to the committee recommending reform.Blakemore (2013) pp.275–286. Perhaps his most insubordinate suggestion was that Peter Hall should no longer draw full salary from the National during his frequent absences directing elsewhere (Glyndebourne, Bayreuth e.g.) All the other directors had their incomes from the National suspended while guest-directing. The committee refused to discuss the manifesto and Blakemore was eventually forced to resign when his salary was stopped without warning or explanation.Blakemore (2013) p.309 et seq. His other productions included Tyger by Adrian Mitchell, co-directed with John Dexter (1971), The Front Page by Ben Hecht and Charles MacArthur (1972), Macbeth (1972), The Cherry Orchard (translated by Ronald Hingley, 1973), Grand Manoeuvres (1974), Engaged by W. S. Gilbert (1975), and Plunder by Ben Travers (1976)."]}, {"page": "Murray Melvin", "response": ["In October 1957, he became an assistant stage manager, theatre painter and general dogsbody to John Bury, the set designer, and he was cast in his first professional role as the Queen's Messenger in the then in rehearsal production of Macbeth. From the Scottish Court to a building site, his next performance was as a bricklayer in You Won't Always Be On Top, soon followed by a peasant in And the Wind Blew, Bellie in Pirandello's Man Beast and Virtue, Calisto in De Rojas's Celestina; Young Jodi Maynard in Paul Green's Unto Such Glory (all 1957) and then came the last play of the 1957–58 season which was to be the start of an extraordinary year in the history of Theatre Workshop and Melvin's career. He was cast as Geoffrey in Shelagh Delaney's play, A Taste of Honey."]}, {"page": "Tony Award for Best Costume Design", "response": ["| John Bury"]}, {"page": "21st Tony Awards", "response": ["** John Bury – The Homecoming"]}, {"page": "John Bury (Costume Designer)", "response": ["#REDIRECT John Bury (theatre designer)"]}, {"page": "Jean Seberg (musical)", "response": ["Jean Seberg opened on 1 December 1983 at the Royal National Theatre, Olivier Theatre. Directed by Peter Hall, Kelly Hunter and Elizabeth Counsell were featured as the younger and older actress, respectively.Billington, Michael. \"Jean Seberg on the London Stage\" The New York Times, December 18, 1983 The choreographer was Irving Davies, and sets, costumes and lighting were by John Bury.Jean Seberg theatricalia.com, retrieved 8 July 2018"]}, {"page": "26th Tony Awards", "response": ["** John Bury – Old Times", "** John Bury – Old Times"]}, {"page": "25th Tony Awards", "response": ["** John Bury – The Rothschilds"]}, {"page": "35th Tony Awards", "response": ["* John Bury – Amadeus", "** John Bury – Amadeus", "* John Bury – Amadeus"]}, {"page": "John Bury (Theatre Designer)", "response": ["#REDIRECT John Bury (theatre designer) "]}]}}