{"wiki_id": "http://www.wikidata.org/entity/Q6229433", "itemLabel": "John Dighton", "itemDescription": "British screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Dighton", "wikipedia_page": {"main": "John Gervase Dighton (8 December 1909 – 16 April 1989) was a British playwright and screenwriter.\nDighton was born in London to Basil Lewis Dighton, of West Kensington, an antiques dealer, author and poet, and his wife Beatrice Mary (née Franks). He was educated at Charterhouse School and Caius College, Cambridge.His output during the 1940s included comedian Will Hay's last starring features, and several George Formby films as well as the 1947 adaptation of Charles Dickens' Nicholas Nickleby, and the 1943 war movie Undercover starring John Clements and Michael Wilding.\nIn 1947 Dighton wrote his first play for the theatre, The Happiest Days of Your Life, which ran in the West End for more than 600 performances in 1948 and 1949. For Ealing Studios, he collaborated on the screenplays of such celebrated comedies as Kind Hearts and Coronets (1949) and The Man in the White Suit (1952), sharing an Academy Award nomination for the latter. He gained a second nomination for the American-financed Roman Holiday (1953).\nTwo of his more popular stage plays, The Happiest Days of Your Life and Who Goes There! (known as The Passionate Sentry in the USA), were successfully adapted for the screen by Dighton himself, the former in collaboration with Frank Launder. He also wrote the 1955 comedy play Man Alive! that transferred to the West End the following year with Robertson Hare in the lead.\nHe adapted the play Summer of the Seventeenth Doll.His final screen credit was his adaptation of Shaw's The Devil's Disciple, written in collaboration with Roland Kibbee.\nDighton married Kathleen Marie Philipps in 1934.", "link_mentions": [{"page": "Academy Award for Best Adapted Screenplay", "response": ["| John Dighton, Alexander Mackendrick & Roger MacDougall", "| John Dighton & Ian McLellan Hunter"]}, {"page": "Roman Holiday", "response": ["The script was written by John Dighton and Dalton Trumbo, though with Trumbo on the Hollywood blacklist, he did not receive a credit; instead, Ian McLellan Hunter fronted for him. Trumbo's credit was reinstated when the film was released on DVD in 2003. On December 19, 2011, full credit for Trumbo's work was restored. Blacklisted director Bernard Vorhaus worked on the film as an assistant director under a pseudonym.", "| Ian McLellan Hunter and John Dighton", "| Ian McLellan Hunter, Dalton Trumbo and John Dighton"]}, {"page": "The Swan (1956 film)", "response": ["The film is a romantic comedy released by Metro-Goldwyn-Mayer, directed by Charles Vidor, produced by Dore Schary from a screenplay by John Dighton, and based on the play by Ferenc Molnár. The original music score was by Bronisław Kaper, the cinematography by Joseph Ruttenberg and Robert Surtees, the art direction by Randall Duell and Cedric Gibbons, and the costume design by Helen Rose."]}, {"page": "The Moon Is Blue (film)", "response": ["::but lost to Ian McLellan Hunter, Dalton Trumbo, and John Dighton for Roman Holiday."]}, {"page": "1950 in literature", "response": ["*John Dighton – Who Goes There!"]}, {"page": "1955 in literature", "response": ["* John Dighton – Man Alive!"]}, {"page": "Wendy Craig", "response": ["In 1956 she appeared in the West End alongside Robertson Hare in John Dighton's farce Man Alive!."]}, {"page": "Kind Hearts and Coronets", "response": ["The head of Ealing Studios, Michael Balcon, was initially unconvinced by the idea of the film, stating that \"I'm not going to make a comedy about eight murders\"; the studio's creative staff persuaded him to reconsider. Balcon, who produced the film, chose Robert Hamer as director and warned him that \"You are trying to sell that most unsaleable commodity to the British – irony. Good luck to you.\" Hamer disliked Pertwee, who withdrew from the project, leaving the scriptwriting to Hamer and John Dighton. Hamer saw the potential of the story and later wrote:"]}, {"page": "List of musicals: A to L", "response": ["| John Dighton, Angus MacPhail and Austin Melford"]}, {"page": "Writers Guild of America Awards", "response": ["* 1954: Roman Holiday – Ian McLellan Hunter, Dalton Trumbo, and John Dighton *"]}, {"page": "The Man in the White Suit", "response": ["The Man In The White Suit is a 1951 British satirical science fiction comedy film made by Ealing Studios. It stars Alec Guinness, Joan Greenwood and Cecil Parker and was directed by Alexander Mackendrick. The film was nominated for an Academy Award for Best Writing (Screenplay) for Roger MacDougall, John Dighton and Alexander Mackendrick."]}, {"page": "Dighton", "response": ["* John Dighton (1909-1989), British playwright and screenwriter"]}, {"page": "25th Academy Awards", "response": ["**The Man in the White Suit – Roger MacDougall, John Dighton and Alexander Mackendrick from The Man in the White Suit by Roger MacDougall"]}, {"page": "Philip Madoc", "response": ["* Godfrey Pond in The Happiest Days of Your Life by John Dighton. Directed by Braham Murray at the Royal Exchange, Manchester (2003)"]}, {"page": "The Happiest Days of Your Life (film)", "response": ["The Happiest Days of Your Life is a 1950 British comedy film directed by Frank Launder, based on the 1947 play of the same name by John Dighton. The two men also wrote the screenplay. It is one of a stable of classic British film comedies produced by Frank Launder and Sidney Gilliat for British Lion Film Corporation. The film was made on location in Liss and at Riverside Studios, London. In several respects, including some common casting, it was a precursor of St. Trinian's films of the 1950s and 1960s."]}, {"page": "Harold Hecht", "response": ["One of Hecht's most coveted film rights purchases came when he procured The Devil's Disciple from Nobel Prize-winner George Bernard Shaw's estate. Set in Colonial America, the story tells of the American Revolutionary War. Initially planned for a 1956 production, the film was to star Lancaster, Montgomery Clift and Laurence Olivier, with Olivier also directing. But Lancaster decided he didn't want to be directed by another actor.  Plans were delayed and Clift's part was recast with Kirk Douglas and Olivier dropped out from directing. Instead, Alexander Mackendrick was hired as director, but he was later fired shortly after filming began. Mackendrick was replaced by future James Bond director Guy Hamilton. The film was partly shot at the famous Ealing Studios in England, from a script by Roland Kibbee and John Dighton. It also earned a BAFTA Award nomination for Best British Actor (for Olivier). While The Devil's Disciple was shooting in England, Hecht-Hill-Lancaster Productions was simultaneously producing Summer of the Seventeenth Doll in Australia. The film was based on Ray Lawler's successful dramatic play about sugarcane cutters in Australia, but was greatly re-written and Americanized by screenwriter John Dighton. It was directed by Leslie Norman and starred Ernest Borgnine (his final collaboration with Hecht and Lancaster), Anne Baxter, Angela Lansbury and John Mills. The film was released in Australia in late 1959 but was only released in the United States in late 1961, under the title Season of Passion."]}, {"page": "Ralph Smart", "response": ["* Feature film (co-written with Austin Melford and John Dighton, 1940)"]}, {"page": "List of Old Carthusians", "response": ["*John Dighton (1909–1989), British playwright and screenwriter"]}, {"page": "26th Academy Awards", "response": ["**Roman Holiday – Ian McLellan Hunter and John Dighton from a story by Dalton Trumbo"]}, {"page": "Anthony Eden hat", "response": ["The Anthony Eden hat was essentially an accessory of the 1930s and 1940s, although, in the mid-1950s, the Homburg came to be associated with the melancholic image of comedian Tony Hancock.See A. N. Wilson (2008) Our Times In 1949 a character (Mr. Sowter) in John Dighton's play The Happiest Days of Your Life had been described as \"soberly dressed. He wears an \"Anthony Eden\" hat and carries gloves\".The Happiest Days of Your Life, Act II The Suez débâcle, followed by Eden's departure from public life in 1957 due to ill health, tended to hasten the drawing of a line that might have seemed inevitable before long in the era of \"Angry Young Men\", rock 'n' roll and Vespa motor scooters which, according to his wife Clarissa,Clarissa, Lady Eden, quoted by Cecil Beaton: Vickers (1994) Loving Garbo kept Eden awake at night. As the communist historian Eric Hobsbawm put it, \"Suez and the coming of rock-and-roll divide twentieth century British history\"."]}, {"page": "Simon Robson", "response": ["* Rupert Billings in The Happiest Days of Your Life by John Dighton. Directed by Braham Murray at the Royal Exchange, Manchester. (2003)"]}, {"page": "Robertson Hare", "response": ["Hare appeared in films of most of the Aldwych farces, and played more than a dozen film roles in the post-war years. For the rest of his stage career he was usually cast in similar roles. After the last Aldwych farce in 1933 he played his customary types in more than twenty new farces over the next three decades. Among his most successful creations of this kind was Willoughby Pink in Travers's Banana Ridge in 1938, in which he played a British Empire builder with a dubious past. In 1947 he starred at the Apollo Theatre in She Wanted a Cream Front Door, 1954 saw him in the political farce The Party Spirit; in 1956 he was in John Dighton's Man Alive! at the Aldwych. The same year he appeared with Cicely Courtneidge in the long-running The Bride and the Bachelor at the Duchess Theatre. He made a few appearances in revue: his first was Fine Fettle (1959) in which he appeared with Benny Hill and Shani Wallis.\"Benny Hill in a Musical Romp\", The Times, 7 August 1959, p. 13 In 1963 Hare played in a long-running stage musical, A Funny Thing Happened on the Way to the Forum (762 performances), in which he was cast as Erronius to Frankie Howerd's Pseudolus.Hope-Wallace, Philip. \"A Funny Thing ... at the Strand\", The Guardian, 4 October 1963, p. 9"]}, {"page": "The Fortunes of Perkin Warbeck", "response": ["*John Dighton, servant of Tirell and alleged murderer of Richard"]}, {"page": "The Life and Adventures of Nicholas Nickleby (1947 film)", "response": ["The Life and Adventures of Nicholas Nickleby is a 1947 British drama film directed by Alberto Cavalcanti and starring Cedric Hardwicke. The screenplay by John Dighton is based on the Charles Dickens novel The Life and Adventures of Nicholas Nickleby (1839). This first sound screen adaptation of the book followed silent films released in 1903 and 1912.", "Bosley Crowther of The New York Times felt \"comparison to Great Expectations puts it somewhat in the shade, mainly because the former was so much more exciting as to plot and a good bit more satisfying in the nature and performance of its characters. There are just no two ways about it; the story of Nicholas Nickleby – at least, in screen translation – is a good whole cut below that of Great Expectations and its tension is nowhere near as well sustained . . . No doubt, the compression of details and incidents compelled by John Dighton's script put Director Cavalcanti on a somewhat unenviable spot, which is evidenced by his failure to get real pace or tension in the film's last half. And this overabundance also hampers the rounding of characters . . . Withal, Nicholas Nickleby is amusing as a chromo of Dickensian life. It is only that Great Expectations has led us to expect so much more\".New York Times review"]}, {"page": "The Barretts of Wimpole Street (1957 film)", "response": ["The Barretts of Wimpole Street is a 1957 Metrocolor CinemaScope film originating from the United Kingdom, and was a re-make of the earlier 1934 version by the same director, Sidney Franklin.Film synopsis and details: New York Times website. Retrieved on 15 January 2008. Both films are based on the 1930 play The Barretts of Wimpole Street by Rudolf Besier. The screenplay for the 1957 film is credited to John Dighton, although Franklin used exactly the same script for the second movie as he did for the first.Same script: IMDB.com website. Retrieved on 15 January 2008. The film, set in the early 19th century, stars Jennifer Jones, John Gielgud, and Bill Travers."]}, {"page": "Undercover (1943 film)", "response": ["The film is based on the Yugoslav resistance movement under the command of General Draza Mihailovich. But politics overtook the situation because Mihailovich and the Royalists were about to be abandoned by the British government - as parts of the Chetnik movement co-operated with the Nazis - in favour of the Communist and Stalinist leader Josip Broz Tito. Speaking in Parliament on 22 February 1944, the Prime Minister, Winston Churchill, said: \"General Mihailovic, I much regret to say, drifted gradually into a position where his commanders made accommodations with Italian and German troops…\"  The screenplay, by John Dighton and Monja Danischewsky, was accordingly amended, and the film was re-edited. It ended up as a black and white war film, 80 minutes in length.", "* Script: John Dighton, Monja Danischewsky, Sergei Nolbandov (uncredited), and Milosh Sekulich (uncredited). Based on a story by George Slocombe, Milosh Sekulich (uncredited), and Sergei Nolbandov (uncredited)"]}, {"page": "List of British Academy Award nominees and winners", "response": ["| John DightonRoger MacDougallAlexander Mackendrick", "| Ian McLellan HunterJohn Dighton"]}, {"page": "Summer of the Seventeenth Doll (1959 film)", "response": ["HHL assigned the adaptation to John Dighton, who had just written The Devil's Disciple for the company. Dighton travelled to Australia to research the script. He told the press in April 1958 that:", "Leslie Norman later claimed \"I want to keep it Australian, but unfortunately the Americans said they couldn't understand the Australian accent and I had to cut out all the Australianisms. That picture broke my heart. ... What buggered him [John Dighton] - and me - was cutting out the Australianness and giving it a more upbeat ending. It is one of the best plays I have ever seen, but I can't say I'm happy with the film.\"McFarlane, Brian (1997). An Autobiography of British Cinema, Metheun. p. 441."]}, {"page": "Who Goes There!", "response": ["It is based on a 1950 play of the same title by John Dighton, who also wrote the screenplay. It was shot at Shepperton Studios with some location filming around the Palace in London. The film's sets were designed by the art director Wilfred Shingleton."]}]}}