{"wiki_id": "http://www.wikidata.org/entity/Q6224179", "itemLabel": "John Buxton", "itemDescription": "British ornithologist and poet", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Buxton_(ornithologist)", "wikipedia_page": {"main": "Edward John Mawby Buxton, (16 December 1912 – 11 December 1989) was a scholar, university teacher, poet and an ornithologist who played a significant part in the development of ornithology  in Britain in the years immediately after World War II.John Buxton was born in Bramhall, Cheshire, and educated at Yarlet Hall, Malvern College, and New College, Oxford.  Before the war he visited Norway several times and gave lectures on English Literature at Oslo University.  He also went on digging expeditions to Palestine and Ireland.  He was Warden at Skokholm Bird Observatory in 1939 with his wife, Marjorie (Ronald Lockley's sister), conducting research and bird ringing.", "link_mentions": [{"page": "Skomer", "response": ["It was last permanently inhabited by the Codd family (all year round) in 1950. After the Second World War, the owner had offered the West Wales Field Society, now The Wildlife Trust of South and West Wales, the opportunity to make a survey of Skomer which was accepted and Skomer opened for visitors from April 1946.Island of Skomer, John Buxton and Ronald Lockley, Staples Press, 1950. The farm buildings in the centre of the island, now housing visitor accommodation, were refurbished in 2005. Skomer was featured in the BBC TV documentary Coast in  Episode 4 of Series 5 (first aired August 2010)."]}, {"page": "Wiltshire Wildlife Trust", "response": ["Formed in 1962 as The Wiltshire Trust for Nature Conservation Ltd, with just seven members contributing £1 per year, the trust was incorporated under the Companies Act on 23 July 1962. Involved in the creation of the trust was acclaimed author and poet John Buxton. The inaugural meeting was held at County Hall, Trowbridge with some 160 people attending."]}, {"page": "New Naturalist", "response": ["|John Buxton"]}, {"page": "Oflag VII-C", "response": ["* John Buxton, scholar, university teacher, poet, and ornithologist."]}, {"page": "Ronald Lockley", "response": ["* 1950: Island of Skomer. Staples Press: London. (With John Buxton)."]}, {"page": "Yarlet School", "response": ["*John Buxton, academic"]}, {"page": "George Waterston", "response": ["In addition, he, along with John Buxton, Peter Conder, John Barrett and others, conducted ornithological work in Oflag VI-B in Dössel (now part of Warburg) and Oflag VII-B prisoner-of-war camps.Mark Cocker Crow Country Vintage. p178-181, 203-4Stephen Moss.  A bird in the Bush. Aurum. p157-8, 185Niemann, Derek. Birds in a Cage Short Books. p 115 Waterston was the only serving British officer to contribute a paper to a German scientific journal in wartime. Erwin Stresemann published his paper \"A survey of the birds of Crete and bird migration in the Aegean\" in the Journal für Ornithologie, based on ornithological observations made on Crete during the spring of 1941. He was repatriated in October 1943."]}, {"page": "Peter Conder", "response": ["In the autumn of 1941, he was moved to Oflag VI-B in Dössel outside Warburg.  The camp was on a plain which rose slightly to the south and was above the town of Warburg or the village of Dössel, so that except for a hill to the south they could see almost 360 degrees.  Five hundred yards up the hill there was a barn which was important to the escapers. Officers with special interests had a chance to meet others with similar interests who had been in different camps and that went for birdwatchers particularly.  Amongst these were John Barrett, John Buxton and George Waterston.  They met once a month in John Buxton's room to record the birds they had seen and had regular talks and discussions."]}, {"page": "John Buxton", "response": ["John Buxton may refer to:", "*John Buxton (politician) (1608–1660), English lawyer and politician", "*Sir John Buxton, 2nd Baronet (1788–1842), English politician", "*John Buxton (rugby union) (1933–2007), a New Zealand international rugby union representative", "*John Buxton (ornithologist) (1912–1989), scholar, university teacher, poet and ornithologist"]}, {"page": "John Barrett (conservationist)", "response": ["In the 1930s, Barrett joined the RAF and served with Bomber Command, reaching the rank of Wing Commander. During the early part of World War II he was shot down and became a prisoner-of-war. The next years were spent in a succession of prisoner-of-war camps across Germany and Poland: Oflag VI-B (Dössel, near Warburg), Oflag XXI-B (Schubin), Stalag Luft III (Sagan) (where he was part of the support team for the \"wooden horse\" escape) and Stalag III-A (Luckenwalde). It was in Oflag VI-B that he met John Buxton, Peter Conder and George Waterston.Niemann, Derek. Birds in a Cage, p. 73. In their company he developed his lifelong interest in birds, which he later turned to good use in Wales. These four recorded migration patterns and the minutiae of tree sparrow and chaffinch nesting behaviour."]}]}}