{"wiki_id": "http://www.wikidata.org/entity/Q6221554", "itemLabel": "John Bennett", "itemDescription": "English cricketer who played for Derbyshire (1864-1928)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Bennett_(cricketer,_born_1864)", "wikipedia_page": {"main": "John William Bennett (22 February 1864 – 10 November 1928) was an English cricketer who played for Derbyshire in 1895 and 1896.\nBennett was born in Lower Whitfield, Glossop, the son of Hiram Bennett a cotton spinner, and he also worked in the cotton industry. He made his cricketing debut in a match for Cheshire against Leicestershire during the 1893 season, scoring 38 runs in the Cheshire innings from tenth in the batting lineup, and only outscored by teammate Alexander Mere Latham. Bennett played two further matches for Cheshire during the 1894 season before being picked up at the beginning of the 1895 season by Derbyshire.\nBennett made his first-class debut for Derbyshire against Hampshire in June 1895, when he top-scored in the first innings before being placed further down the order. He was a regular starter during the 1895 season, in which Derbyshire finished fifth in the County Championship table. Bennett took three 5-wicket innings in the season, with 5 for 101 against Yorkshire, 5 for 40 against Nottinghamshire and his best performance was 5 for 8 against Essex. His top batting score was 43, achieved against Lancashire from ninth in the batting order.\nBennett appeared less frequently during the 1896 season, playing just four times and with a much reduced bowling form. His final match was in an innings victory against Leicestershire.\nBennett was a slow left-arm bowler and took 35 first-class wickets at an average of 20.02 and a best performance of 5 for 38. He was a right-handed batsman and played 25 innings in sixteen first-class matches with an average of 11.17 and a top score of 43.Bennett died at Stepping Hill, Stockport aged 64.", "link_mentions": [{"page": "John Bennett", "response": ["John Bennett may refer to:", "*John Bennett (actor) (1928–2005), British actor", "*John Bennett (composer) (c. 1735–1784), British composer and organist", "*John Bennett (drummer), drummer of the UK doom metal band The Prophecy", "*John Bennett, American trombonist, founding member of the Kenny Ball and his Jazzmen", "*John Bennett (OITNB), fictional prison guard in Orange Is The New Black", "*John Bennett (potter) (1840–1907), British ceramic artist", "*John Bennett, Royal Navy recipient of the Ushalov Medal for his role in the Second World War Arctic convoys", "*John Bennett (Sheriff of London) (1814–1897)", "*John Bennett (fl. 1586–1589), MP for Heytesbury and Westbury", "*John Bennett (Australian politician) (1942–2019), Tasmanian politician", "*John Bennett (Canadian politician) (1832–1912), Ontario farmer and political figure", "*John Bennett (English barrister) (c. 1658–1723), British politician", "*John Bennett (Irish politician) (c. 1720–1792), Irish politician, barrister and judge", "*John Bennett (Victorian politician) (1824–1859), lawyer and politician in colonial Victoria", "*John Bennett (athlete) (born 1930), American long jumper, Olympic silver medal winner (1956)", "*John Bennett (Australian footballer) (born 1960), Australian rules footballer", "*John Bennett, Canadian football coach for Bramalea Satellites", "*John Bennett (cricketer, born 1777) (1777–1857), English cricketer", "*John Bennett (cricketer, born 1864) (1864–1928), English cricketer", "*John Bennett (diver) (1959–2004), first scuba diver beyond 1,000 feet", "*John Bennett (field hockey) (1885–1973), British Olympic field hockey player", "*John Bennett (footballer, born 1946), former professional footballer in England", "*John Bennett (footballer, born 1949), former footballer in England", "*John Bennett (hurler) (1934–2016), Irish hurler", "*John Bennett (ice hockey) (born 1950), retired American ice hockey left winger", "*John Bennett (author) (1865–1956), author and illustrator of children's books", "*John Bennett (educator) (born 1948), Australian education administrator", "*John Bennett (watchmaker) (1814–1897), watchmaker and local politician"]}, {"page": "James Bennett (cricketer)", "response": ["James Bennett (1775 – 31 March 1855) was an English professional cricketer who made 5 known appearances in first-class cricket matches from 1798 to 1805.  He was a cousin of the more famous John Bennett, not to be confused with John Bennett."]}, {"page": "Derbyshire County Cricket Club in 1895", "response": ["Making their entry in the Championship, the club tried out a large number of players, all of whom played less than 20 games for the club. John Berwick lasted longest as a regular player, while John Hall  and Henry Blackwell appeared infrequently over several seasons. John Goodall, John Bennett and Joseph Brooks  played in 1895 and in 1896, while Harry Storer and Thomas Richardson only played in the 1895 season. Jesse Boot and Harry Spencer played only one match."]}, {"page": "John Bennett (Derbyshire cricketer)", "response": ["#REDIRECT John Bennett (cricketer, born 1864)"]}]}}