{"wiki_id": "http://www.wikidata.org/entity/Q6223184", "itemLabel": "John Briggs", "itemDescription": "English prelate of the Roman Catholic Church", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Briggs_(bishop)", "wikipedia_page": {"main": "John Briggs (20 May 1788 – 4 January 1861) was an English prelate of the Roman Catholic Church. He served as the first Bishop of Beverley from 1850 to 1860. \n\n", "link_mentions": [{"page": "Ushaw College", "response": ["* 1833–1836 \tJohn Briggs"]}, {"page": "Apostolic Vicariate of the Northern District (England)", "response": ["| John Briggs, Titular Bishop of Trachis"]}, {"page": "John Briggs", "response": ["John Briggs may refer to:", "*John Briggs (baseball) (1934–2018), American baseball pitcher", "*John Briggs (politician) (1930–2020), American politician", "*John Briggs (author) (born 1945), American author and university lecturer", "*John Briggs (bishop) (1789–1861), bishop and Vicar Apostolic of the Northern District of England", "*John Briggs, activist from Gainesville, Florida, and member of the Gainesville Eight group in the 1960s", "*John Briggs (East India Company officer) (1785–1875), British officer in the army of the East India Company, and author"]}, {"page": "Universalis Ecclesiae", "response": ["| John Briggs"]}, {"page": "Roman Catholic Diocese of Beverley", "response": ["| John Briggs, Titular Bishop of Trachis", "| John Briggs"]}, {"page": "Robert Cornthwaite (bishop)", "response": ["On 3 September 1861, Cornthwaite was appointed to succeed John Briggs as bishop of the Diocese of Beverley. His consecration to the Episcopate took place on 10 November 1861, the principal consecrator was Cardinal Nicholas Wiseman, Archbishop of Westminster, with Thomas Grant, Bishop of Southwark, and Richard Roskell, Bishop of Nottingham serving as co-consecrators. "]}, {"page": "John Briggs (Roman Catholic Bishop)", "response": ["#REDIRECT John Briggs (bishop)"]}, {"page": "Roman Catholic Diocese of Hexham and Newcastle", "response": ["*John Briggs (1836-1840), appointed Vicar Apostolic of Yorkshire District", "*John Briggs (1833-1836)"]}, {"page": "William Gordon (bishop of Leeds)", "response": ["William Gordon was born in the village Thirsk in the North Riding of Yorkshire. He was ordained to the priesthood by John Briggs, Bishop of Beverley, in 1856 at an age of 22."]}, {"page": "George Brown (bishop of Liverpool)", "response": ["He was appointed Vicar Apostolic of the Lancashire District and Titular Bishop of Bugia on 5 June 1840, and consecrated to the Episcopate at Vauxhall, Liverpool on 24 August 1840. The principal consecrator was Bishop John Briggs, and the principal co-consecrators were Bishop Thomas Griffiths and Bishop Thomas Walsh. His titular see was translated from Bugia to Tlos on 22 April 1842."]}, {"page": "Joseph William Hendren", "response": ["Born in Birmingham on 19 October 1791, he was ordained a priest in the Order of Friars Minor on 28 September 1815. He was appointed the Vicar Apostolic of the Western District and Titular Bishop of Verinopolis on 28 July 1848. His consecration to the Episcopate took place on 10 September 1848, the principal consecrator was William Bernard Ullathorne, and the principal co-consecrators were John Briggs and Nicholas Wiseman."]}, {"page": "Francis Mostyn (vicar apostolic of the Northern District)", "response": ["He was appointed the Vicar Apostolic of the Northern District and Titular Bishop of Abydus on 22 September 1840. His consecration to the Episcopate took place on 21 December 1840, the principal consecrator was Bishop John Briggs, with  bishops Walsh and Brown as co-consecrators."]}, {"page": "William Riddell", "response": ["He was appointed coadjutor to the Vicar Apostolic of the Northern District, Bishop Francis George Mostyn, on 22 December 1843. On the same day, he was appointed Titular Bishop of Lagania, and was consecrated to the Episcopate by Bishop John Briggs on 17 March 1844. On the death of Bishop Mostyn on 11 August 1847, Riddell briefly succeeded as Vicar Apostolic of the Northern District."]}, {"page": "William Hogarth (bishop)", "response": ["He was appointed the Vicar Apostolic of the Northern District of England and Titular Bishop of Samosata on 28 July 1848. His consecration to the Episcopate took place at St Cuthbert's Chapel, Ushaw College on 24 August 1848, the principal consecrator was Bishop John Briggs, with bishops Brown and Wareing as co-consecrators."]}, {"page": "Briggs (surname)", "response": ["*John Briggs (disambiguation), multiple people by the name of John, Johnny, and other variations", "*John Briggs (author), American author and university lecturer", ":*John Briggs (baseball) (1934–2018), American baseball pitcher", ":*John Briggs (bishop) (1789–1861), Vicar Apostolic of the Northern District of England", ":*John Briggs (East India Company officer) (1785–1875), British officer and author", ":*John Briggs (politician) (1930–2020), American politician", ":*John Briggs, activist from Florida, member of the Gainesville Eight"]}, {"page": "Revell Grange", "response": ["After the widowed Mistress Wright had re-married Mr. Sutton in 1854, it was agreed that the chapel should be reopened and on December 17 of that year, Father Burke of St Vincent's Church, Sheffield conducted Mass for the first time in almost 27 years and revived the tradition of flying a white sheet as a signal to the local populace that Mass was to be celebrated in the Grange. In 1858, a new chapel was built on the site of the old one and was opened by John Briggs Bishop of Beverley and was dedicated to St Mary of the Assumption. Revell Grange continued to be occupied by the Sutton family until 1954 when the last descendant, Captain Revell Sutton died. Today the Grange continues as a private house. The Grange has adjacent outbuildings which were constructed in the late 18th or early 19th century, these consist of a barn and a coach house which has been converted into a cottage. Both outbuildings are grade two listed.  Rotherhamweb.co.uk. Gives genealogy of Revells."]}, {"page": "St Stephen's Church, Skipton", "response": ["In 1836, seven years after Catholic emancipation the foundation stone for the church was laid by Charles Tempest. A dispute arose between the new parish priest Fr Michael Trappes and Charles Tempest on whether the church would be a parish church, which would be under the priest's supervision, or a family chapel, owned by the Tempests. It meant that the church was not opened five years after it was completed. Finally, the Vicar Apostolic of the Northern District, John Briggs solved the dispute by permitting the Tempests to nominate a priest and pay for the running costs of the church.Re-building Catholic life in Skipton in St Stephen's Parish retrieved 4 February 2014"]}, {"page": "Mount St Mary's Church, Leeds", "response": ["On 24 May 1853, the foundation stone of the church was laid by the Bishop of Beverley, John Briggs. The architect was Joseph Hansom.Leeds, Mount Saint Mary’s, 1851–1989  from Missionary Oblates of Mary Immaculate retrieved 11 April 2014 He also designed Plymouth Cathedral and the Church of St Walburge in Preston, both of which, like Mount St Mary's Church, are in the Gothic Revival style. In the same year, Mount Saint Mary's School was founded next door to the church. It was staffed by the Sisters Oblates of Mary Immaculate. They were housed in a nearby convent and also used the church as their place of worship."]}, {"page": "St Mary's Church, Sunderland", "response": ["In 1830, Ignatius Bonomi submitted designs for the church to have a capacity of 1200 people. On 15 September 1835, the church was opened by the Apostolic Vicar of the Northern District, John Briggs.Sunderland - St Mary from English Heritage, retrieved 12 December 2015"]}, {"page": "St Patrick's Church, Bradford", "response": ["In 1852, building work started on the church. It was designed by George Goldie. On 13 July 1853, the church was opened by the Bishop of Beverley, John Briggs. In 1855, it became its own parish."]}, {"page": "St Bede's Church, Rotherham", "response": ["On 29 July 1841, the foundation stone was laid by Benjamin Badger. The architects were Matthew Ellison Hadfield and John Grey Weightman.From the Tablet Ninety Years Ago from The Tablet, 15 August 1931, retrieved 31 December 2015 They also designed St Bede's Church in Widnes and Church of St Mary of the Assumption in Burnley. On 5 October 1842, it was opened and dedicated by the Apostolic Vicar of the Yorkshire District, John Briggs. In the 1930s, a choir loft was added to the church.Project from Church Building and Heritage Review, Issue 139, retrieved 31 December 2015"]}, {"page": "Hendrick Joseph Cornelius Maria de Cocq", "response": ["* Bishop John Briggs (1833)"]}, {"page": "St Peter's Church, Stonyhurst", "response": ["In 1832, construction work on the church began. It was designed by the architect Joseph John Scoles who would go on to build St Ignatius, Preston in 1835, St James the Less and St Helen Church, Colchester in 1837, Cardiff Cathedral in 1842, and Immaculate Conception, Farm Street and St Francis Xavier's, Liverpool both in 1844. King's College Chapel in Cambridge was the inspiration for the design of the church.Red Rose Collections, St Peter's Church, Stonyhurst College, Lancashire County Council, retrieved 23 December 2021 On 23 June 1835, the church was consecrated by Bishop John Briggs, Vicar Apostolic of the Northern District."]}]}}