{"wiki_id": "http://www.wikidata.org/entity/Q6224076", "itemLabel": "John Bush", "itemDescription": "English cricketer (1928-2015)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Bush_(English_cricketer)", "wikipedia_page": {"main": "John Edgar Bush (20 August 1928 – 1 June 2015) was an English cricketer in the 1950s.  \nBush was born in Oxford, Oxfordshire. He attended Magdalen College School, Oxford, before going on to Magdalen College at Oxford University. A right-handed batsman, he made his first-class debut for Oxford University against the Free Foresters in 1950.  He played 7 further first-class matches for the University, the last coming against Cambridge University in 1952.  In his 8 first-class matches, he scored 417 runs at a batting average of 29.78, with a high score of 67.  This came against Middlesex in 1952.Bush made his debut for Oxfordshire before playing for Oxford University, first appearing in the 1949 Minor Counties Championship against Buckinghamshire.  Bush played Minor counties cricket for Oxfordshire from 1949 to 1973 which included 139 Minor Counties Championship matches.  He made his only List A appearance for Oxfordshire against Cambridgeshire in the 1967 Gillette Cup.  In this match he scored 14 runs before being dismissed by Alan Wilson.He was a schoolmaster at St Lawrence College, Ramsgate, from 1956 until his retirement in 1988.", "link_mentions": [{"page": "John Bush", "response": ["John Bush may refer to:", "*John Bush (musician) (born 1963), American metal vocalist for Armored Saint and Anthrax", "*John Bush (English politician), MP for Cambridge 1411 and 1426", "*John Bush (High Sheriff) (c. 1745–?), High Sheriff of Oxfordshire", "*John Bush (provincial soldier), African American provincial soldier during the French-Indian Wars in North America", "*John Bush (admiral of Siam) (1819–1905), English sea captain who worked for the Siamese Government", "*John Bush (New Zealand cricketer) (1867-1913)", "*John Bush (Royal Navy officer) (1914–2013), British Royal Navy officer", "*John Bush (English cricketer) (1928–2015)", "*John Bush (filmmaker), filmmaker, cinematographer, and visual artist", "*John Bush, set decorator, see Academy Award for Best Production Design"]}]}}