{"wiki_id": "http://www.wikidata.org/entity/Q6228855", "itemLabel": "John Davison", "itemDescription": "British Labour Party politician, MP for Smethwick 1918&ndash;1926", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Davison_(politician)", "wikipedia_page": {"main": "John Emanuel Davison (28 November 1870 – 2 March 1927) was a Labour Party politician in the United Kingdom who served as a Member of Parliament (MP) from 1918 to 1926.\nDavison was born in Smethwick, but grew up in Sheffield.  He had a number of short-term jobs before completing an apprenticeship in iron founding, and joining the Friendly Society of Iron Founders (FSIF).  He also studied at night school and qualified as a sanitary inspector.Davison became increasingly prominent in the FSIF, becoming chairman of its executive, then its full-time national organiser.  During World War I, he served on advisory councils for the Ministry of Munitions and the Board of Trade.At the 1918 general election, he was elected as MP for the new Smethwick constituency on the outskirts of Birmingham.  It was an unusual electoral contest: there was no Conservative Party or Liberal Party candidate, and his only opponent was Christabel Pankhurst of the Women's Party, who was supported by the alliance of the Conservative Party and the David Lloyd George-led Coalition Liberal faction.\nDavison won the seat with a majority of only 775 votes, and was returned to the House of Commons at the 1922 general election with a margin of only 382 votes over his only opponent, a Conservative.  He was re-elected by more comfortable margins at the 1923 general election and at the 1924 general election, but resigned his seat in 1926 due to poor health.\nThe resulting by-election on 21 December 1926, was won by the Labour candidate Oswald Mosley, who went on to found the New Party and the British Union of Fascists.\nDavison died in March 1927, aged 56.", "link_mentions": [{"page": "Emmeline Pankhurst", "response": ["In November 1917 the WSPU's weekly newspaper announced that the WSPU was to become the Women's Party. Twelve months later on Tuesday 19 November at the Queen's Hall in London Emmeline Pankhurst said that her daughter Christabel would be their candidate at the forthcoming General Election, the first at which women could stand as candidates. They didn't say which constituency they would fight but a few days later Westbury in Wiltshire was identified. Emmeline lobbied Prime Minister David Lloyd George to ensure Christabel would have coalition backing. However, as these discussions were taking place the Pankhurst's switched their attention to Smethwick in Staffordshire. The Coalition had already settled on a local candidate, Major Samuel Nock Thompson, but Bonar Law, the Conservative leader, was persuaded to ask Thompson to withdraw. Significantly, Christabel was not issued with a formal letter of support from the two leaders, the Coalition Coupon. Christabel then had a straight fight with the Labour candidate John Davison and lost by 775 votes. The Women's Party fought no other elections and closed soon after.Hallam, David J.A. Taking on the Men: the first women parliamentary candidates 1918 , pp18-19, 20, 22, 27"]}, {"page": "Smethwick", "response": ["* John Davison MP (1870–1927) Smethwick's first Member of Parliament (Labour) was born in Spon Lane."]}, {"page": "Christabel Pankhurst", "response": ["After some British women were granted the right to vote at the end of World War I, Pankhurst announced that she would stand in the 1918 general election. At first she said she would contest Westbury in Wiltshire but at the last minute stood as a Women's Party candidate, in the Smethwick constituency in alliance with the Lloyd George/Conservative Coalition. She was not issued with the \"Coalition Coupon\" letter signed by both Liberal and Unionist leaders. Her campaign focussed on a \"Victorious Peace\", \"the Germans must pay for the War\" and \"Britain for the British\". She was narrowly defeated, by only 775 votes, by the Labour Party candidate, local trade union leader John Davison.Hallam, David J.A. Taking on the Men: the first women parliamentary candidates 1918 Studley 2018 Chapter 2."]}, {"page": "Women's Party (UK)", "response": ["At the 1918 general election, following the passing of the Parliament (Qualification of Women) Act 1918, the party stood Christabel as a candidate in the Smethwick constituency in Staffordshire. She won 47.8% of the vote, losing by only 778 votes to her only opponent, the Labour Party's John Davison.* "]}, {"page": "List of MPs elected in the 1924 United Kingdom general election", "response": ["|John Davison"]}, {"page": "Vice-Chamberlain of the Household", "response": ["| John Davison || 1924 || 1924 ||  || "]}, {"page": "List of United Kingdom by-elections (1918–1931)", "response": ["|John Davison"]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["|John Davison"]}, {"page": "List of MPs elected in the 1923 United Kingdom general election", "response": ["|John Davison"]}, {"page": "List of MPs elected in the 1922 United Kingdom general election", "response": ["|John Davison"]}, {"page": "Smethwick (UK Parliament constituency)", "response": ["| John Davison"]}, {"page": "Birmingham Handsworth (UK Parliament constituency)", "response": ["*Labour: John Davison"]}, {"page": "John Emanuel Davison", "response": ["#REDIRECT John Davison (politician)"]}, {"page": "John Davison", "response": ["*John Davison (priest) (1777–1834), English theological writer", "*John Davison (theologian) (1793–1863), theologian and author of Considerations on the Poor Laws", "*John Davison (Kent cricketer) (1828–1871), English cricketer", "*John Davison (politician) (1870–1927), British Labour Party politician, Member of Parliament for Smethwick 1918–1926", "*John Davison (composer) (1930–1999), American composer", "*John Davison (boxer) (born 1958), British boxer", "*John Davison (sport shooter) (born 1966), British sport shooter", "*John Davison (Canadian cricketer) (born 1970), Canadian cricketer"]}, {"page": "1926 Smethwick by-election", "response": ["The by-election was caused by the resignation of the town's Labour Party Member of Parliament (MP), John Davison, who had represented the constituency since its creation for the 1918 general election."]}, {"page": "Mary Macarthur", "response": ["The returning officer insisted that she was listed under her married name of Mrs W.C. Anderson. The defending Liberal MP was John Wilson a director of the Albright and Wilson chemicals firm in Oldbury, which was in the constituency. She was also opposed by Victor Fisher of the National Democratic and Labour Party, who had the support of the Coalition, secret funding from the Unionists, and ran a particularly abusive campaign. During the campaign she worked closely with John Davison the Labour candidate in neighbouring Smethwick to defeat Christabel Pankhurst who was running as the Coalition candidate with Unionist support. Macarthur was defeated, as were most anti-war candidates, including her husband, William Anderson, who was defending Sheffield, Attercliffe., Campaign ManifestoHallam, David J.A. Taking on the Men: the first women parliamentary candidates 1918, Studley 2018, chapter 3 Mary Macarthur in Stourbridge."]}]}}