{"wiki_id": "http://www.wikidata.org/entity/Q6221176", "itemLabel": "John Bayley", "itemDescription": "cricketer (1794-1874)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Bayley_(cricketer)", "wikipedia_page": {"main": "John Bayley (17 May 1794 – 7 November 1874) was an English professional cricketer who played first-class cricket from 1822 to 1850.  He was mainly associated with Surrey and was a member of the county team when Surrey County Cricket Club was founded in 1845.  Bayley was employed by Marylebone Cricket Club (MCC) on its ground staff from 1832 to 1850 and played for the MCC team.  He also played for Hampshire and Middlesex.\nBayley was a right-handed batsman  and a slow roundarm bowler.  He was in addition an occasional wicket-keeper.  He made 83 known appearances in first-class cricket, including matches for The Bs (1822 to 1837), the South (1836) and the Players (1836).", "link_mentions": [{"page": "List of tied first-class cricket matches", "response": ["John Bayley 6/?"]}, {"page": "Sir John Bayley, 2nd Baronet", "response": ["Born in London, he was the son of Sir John Bayley, 1st Baronet and his wife Elizabeth, the youngest daughter of John Markett. Bayley was called to the bar by the Inner Temple in 1835 and went then to the Northern Circuit. He succeeded his father as baronet in 1841."]}, {"page": "John Bayley", "response": ["John Bayley may refer to:", "*John Bayley (died 1611), MP for Salisbury", "*John Bayley (antiquary) (1787–1869), English antiquary", "*Sir John Bayley, 1st Baronet (1763–1841), Justice of the King's Bench", "*Sir John Bayley, 2nd Baronet (1793–1871), British baronet and cricketer 1817–1832", "*John Bayley (cricketer) (1794–1874), English cricketer 1822–1850", "*John Bayley (musician) (1847–1910), English bandmaster, clarinetist, violinist, and organist", "*John Bayley (writer) (1925–2015), British literary critic and writer"]}, {"page": "Frederick Haslett", "response": ["Haslett made his first-class debut for Sussex against the Marylebone Cricket Club in 1837.  He made four further first-class appearances that season, that last of which came against Nottinghamshire.  He scored 23 runs in his five matches that season, which came at an average of 2.87, with a high score of 16.  He later made a single first-class appearance for Sussex County Cricket Club in 1841 at Lord's against the Marylebone Cricket Club.  He batted at number ten in Sussex's first-innings of 48 all out, scoring 3 runs before he was dismissed by John Bayley.  Kent were dismissed for 44 in their reply, with Sussex going on to make 93 in their second-innings, in which Haslett was promoted to open the batting, from which he was dismissed for a duck by James Cobbett.  The Marylebone Cricket Club made 98/7 in their second-innings to win the match by 3 wickets."]}, {"page": "List of English cricketers (1787–1825)", "response": ["|John Bayley", "|Sir John Bayley, 2nd Baronet", "|John Bayley, CricketArchive. Retrieved 2019-01-21."]}, {"page": "List of English cricketers (1826–1840)", "response": ["|John Bayley", "|Sir John Bayley, 2nd Baronet"]}, {"page": "List of English cricketers (1841–1850)", "response": ["|John Bayley"]}, {"page": "Thomas Leventhorpe", "response": ["While studying at Cambridge, Leventhorpe made a single appearance in first-class cricket for Cambridge University against the Marylebone Cricket Club at Parker's Piece in 1835. In a match which the Marylebone Cricket Club won by 88 runs, he was dismissed for a duck twice, firstly by Charles Parnther in Cambridge University's first-innings, and then by John Bayley in their second-innings. Leventhorpe's batting style is unknown."]}, {"page": "List of Marylebone Cricket Club players (1827–1863)", "response": ["* John Bayley (1832–1850) : J. Bayley (Players, South, Surrey)"]}, {"page": "James Faithfull", "response": ["The son of The Reverend Francis Faithfull, he was born at Hatfield in June 1817. He was educated at Harrow School, before going up to Exeter College, Oxford. While studying at Oxford, he made a single appearance in first-class cricket for Oxford University against the Marylebone Cricket Club at Lord's in 1839. Batting twice in the match, Faithfull was dismissed for a single run in the Oxford first-innings by John Bayley, while in their second-innings he was dismissed for 8 runs by Henry Walker."]}, {"page": "George Prothero (cricketer)", "response": ["The son of Thomas Prothero, he was born in March 1818 at Newport. He was educated at Harrow School, before going up to Wadham College, Oxford. While studying at Oxford, he made a single appearance in first-class cricket for Oxford University against the Marylebone Cricket Club at Lord's in 1839. Batting twice in the match, he was dismissed for 3 runs by Henry Walker in the Oxford first-innings, while in their second-innings he was dismissed without scoring by John Bayley. "]}, {"page": "James Wiseman (cricketer)", "response": ["The son of Sir William Saltonstall Wiseman, he was born at Hastings in July 1839. He later studied at University College at the University of Oxford. While studying at Oxford, he made a single appearances in first-class cricket for Oxford University against the Marylebone Cricket Club at Oxford in 1836. Batting twice in the match, he was dismissed for a single run in the Oxford first innings by John Bayley, while in their second innings he was run out without scoring."]}]}}