{"wiki_id": "http://www.wikidata.org/entity/Q6220666", "itemLabel": "John Barham", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Barham", "wikipedia_page": {"main": "John Barham (born 1942) is an English classical pianist, composer, arranger, producer and educator. He is best known for his orchestration of George Harrison albums such as All Things Must Pass (1970) and for his association with Indian sitar maestro Ravi Shankar. Barham trained at the Royal College of Music and the School of Oriental and African Studies in London, before establishing himself during the mid 1960s as a composer of piano interpretations of Indian classical ragas. He became a student of Shankar, for whose East–West collaborations with Yehudi Menuhin and others he transcribed Indian melodies into Western musical annotation. Through Shankar, Barham began a long friendship with Harrison in 1966, then a member of the Beatles, which assisted Harrison's own education in Indian music as well as his promotion of the genre to Western audiences. Barham collaborated with Harrison on the latter's Wonderwall Music soundtrack album (1968), before providing the orchestral arrangements for All Things Must Pass songs such as \"Isn't It a Pity\" and \"My Sweet Lord\", and for Harrison's 1973 album Living in the Material World.\nMost often in the role of orchestral or choral arranger, Barham also contributed to albums such as the Beatles' Let It Be, John Lennon's Imagine and Gary Wright's Footprint in the early 1970s. His projects as a music producer during the same period included three albums by progressive rock band Quintessence, and he has worked on film or TV soundtracks for directors Otto Preminger, Alejandro Jodorowsky and Jonathan Miller. Other artists with whom Barham has worked include Elton John, André Previn, Phil Spector, Roger Daltrey, Yoko Ono and Jackie Lomax.\nContinuing his interest in Indian music, Barham released an album with sarodya Aashish Khan in 1973, Jugalbandi, and contributed to Shankar's final collaboration with Harrison, Chants of India, in 1996. Among his educational positions, he has taught at Trinity College of Music, London, and in Ghana at the Achimota School.", "link_mentions": [{"page": "George Harrison", "response": ["From 1968 onwards, Harrison collaborated with other musicians; he brought in Eric Clapton to play lead guitar on \"While My Guitar Gently Weeps\" for the 1968 Beatles' White Album, and collaborated with John Barham on his 1968 debut solo album, Wonderwall Music, which included contributions from Clapton again, as well as Peter Tork from the Monkees. He played on tracks by Dave Mason, Nicky Hopkins, Alvin Lee, Ronnie Wood, Billy Preston and Tom Scott. Harrison co-wrote songs and music with Dylan, Clapton, Preston, Doris Troy, David Bromberg, Gary Wright, Wood, Jeff Lynne and Tom Petty, among others. Harrison's music projects during the final years of the Beatles included producing Apple Records artists Doris Troy, Jackie Lomax and Billy Preston."]}, {"page": "Let It Be (Beatles album)", "response": ["* John Barham – choral arrangements on \"Across the Universe\", \"I Me Mine\" and \"The Long and Winding Road\""]}, {"page": "Hare Krishna (mantra)", "response": ["Less well-known recordings of the Hare Krishna mantra include versions by the Fugs on their 1968 album Tenderness Junction (featuring poet Allen Ginsberg), by Nina Hagen, in multiple songs by English psychedelic rock band Quintessence (produced by John Barham, a frequent collaborator of George Harrison) and by Hüsker Dü on their 1984 album Zen Arcade.Radha Krsna Temple. Kula Shaker, Boy George, and members of the Rubettes have recorded music tracks about Krishna Consciousness."]}, {"page": "Imagine (John Lennon album)", "response": ["*John Barham – harmonium (3), vibraphone (9)"]}, {"page": "All Things Must Pass", "response": ["Production began at London's EMI Studios in May 1970, with extensive overdubbing and mixing continuing through October. Among the large cast of backing musicians were Eric Clapton and members of Delaney & Bonnie's Friends band – three of whom formed Derek and the Dominos with Clapton during the recording – as well as Ringo Starr, Gary Wright, Billy Preston, Klaus Voormann, John Barham, Badfinger and Pete Drake. The sessions produced a double album's worth of extra material, most of which remains unissued.", "Adding to his and Badfinger's acoustic guitars on some All Things Must Pass tracks, Harrison invited Peter Frampton to the sessions. Although uncredited for his contributions, Frampton also played acoustic guitar on the country tracks featuring Drake;Harry, p. 180. he and Harrison later overdubbed further rhythm parts on several songs. Orchestral arranger John Barham also attended the sessions, occasionally contributing on harmonium and vibraphone.Leng, pp. 80, 82fn, 83fn. Simon Leng consulted Voormann, Barham and Molland for his chapter covering the making of All Things Must Pass and credits Tony Ashton as one of the keyboard players on both versions of \"Isn't It a Pity\".Leng, pp. 78, 82fn, 86, 98. Ginger Baker, Clapton's former bandmate in Cream and Blind Faith, played drums on the jam track \"I Remember Jeep\".", "John Barham's orchestrations were recorded during the next phase of the album's production,Madinger & Easter, p. 428. starting in early September, along with many further contributions from Harrison, such as his lead vocals, slide guitar parts and multi-tracked backing vocals (the latter credited to \"the George O'Hara-Smith Singers\").Spizer, pp. 212, 222.MacFarlane, pp. 76, 79. Barham stayed at Friar Park and created the music scores from melodies that Harrison sang or played to him on piano or guitar. Leng recognises the arrangements on \"pivotal\" songs such as \"Isn't It a Pity\", \"My Sweet Lord\", \"Beware of Darkness\" and \"All Things Must Pass\" as important elements of the album's sound.", "* John Barham – orchestral arrangements, choral arrangement,Harry, p. 24. harmonium, vibraphone"]}, {"page": "The Long and Winding Road", "response": ["*John Barham – choral arrangement"]}, {"page": "Jealous Guy", "response": ["* John Barham – harmonium"]}, {"page": "Living in the Material World", "response": ["Living in the Material World is notable for the uncompromising lyrical content of its songs, reflecting Harrison's struggle for spiritual enlightenment against his status as a superstar, as well as for what many commentators consider to be the finest guitar and vocal performances of his career. In contrast with All Things Must Pass, Harrison scaled down the production for Material World, using a core group of musicians comprising Nicky Hopkins, Gary Wright, Klaus Voormann and Jim Keltner. Ringo Starr, John Barham and Indian classical musician Zakir Hussain were among the album's other contributors.", "Whereas Harrison's Krishna devotionals on All Things Must Pass had been uplifting celebrations of faith,Anthony DeCurtis, \"George Harrison All Things Must Pass\", Rolling Stone, 12 October 2000 (retrieved 7 May 2013). his latest compositions betrayed a more austere quality,Leng, p. 137. partly as a result of the Bangladesh experience.Inglis, pp. 37–38. His musical arranger, John Barham, would later suggest that a spiritual \"crisis\" might have been the cause; other observers have pointed to Harrison's failing marriage to Boyd.Huntley, pp. 91–92. Leng writes of his frame of mind at this time: \"while George Harrison was bursting with musical confidence, Living in the Material World found him in roughly the same place that John Lennon was when he wrote 'Help!' – shocked by the rush of overwhelming success and desperately wondering where it left him.\"", "In another contrast with his 1970 triple album, Harrison engaged a small core group of musicians to support him on Living in the Material World.Clayson, p. 323.Leng, p. 125. Gary Wright, who shared Harrison's spiritual preoccupations, and Klaus Voormann returned, on keyboards and bass, respectively, and John Barham again provided orchestral arrangements. They were joined by Jim Keltner, who had impressed at the 1971 Bangladesh concerts,Lavezzoli, p. 200. and Nicky Hopkins, whose musical link to Harrison went back to the 1968 Jackie Lomax single \"Sour Milk Sea\". Ringo Starr also contributed to the album, when his burgeoning film career allowed,Woffinden, pp. 68–69. and Jim Horn, another musician from the Concert for Bangladesh band, supplied horns and flutes. The recording engineer was Phil McDonald, who had worked in the same role on All Things Must Pass.Spizer, pp. 222, 254.", "* John Barham – orchestral and choral arrangements"]}, {"page": "My Sweet Lord", "response": ["Drummer Alan White once claimed he played on \"My Sweet Lord\" with Carl Radle on bass and Starr on tambourine, and with John Lennon among the rhythm guitarists. Leng lists John Barham as the probable harmonium player; Beatles historian Bruce Spizer says that Peter Frampton may have added acoustic guitar after the main session. The chorus vocals were all sung by Harrison and credited to \"the George O'Hara-Smith Singers\".Schaffner, p. 142. These contributions, together with Harrison's slide guitar parts and Barham's orchestral arrangement, were overdubbed during the next two months,Olivia Harrison, p. 282. partly at Trident Studios in central London with engineer Ken Scott.MacFarlane, pp. 72, 76, 79. Harrison experimented with several harmony ideas in his guitar parts,Clayson, pp. 279–80. having first applied himself to mastering slide during the 1969 Delaney & Bonnie tour.Lavezzoli, p. 188.", "*John Barham – harmonium, orchestral arrangement"]}, {"page": "Quintessence (English band)", "response": ["In 2010, Maha Dev's new Quintessence were invited by Michael Eavis to play the 40th Anniversary Glastonbury Festival, where they were joined by original vocalist Jones. Produced by John Barham, Quintessence's previous producer, this performance was recorded and released as Rebirth: Live At Glastonbury in 2011. The reunion of Phil Shiva Jones with Dev's Quintessence for the 2010 Glastonbury Festival was documented in a BBC One Inside Out programme which was aired in November 2010."]}, {"page": "Wonderwall Music", "response": ["Harrison recorded the album between November 1967 and February 1968, with sessions taking place in London and Bombay. One of his collaborators on the project was classical pianist and orchestral arranger John Barham, while other contributors include Indian classical musicians Aashish Khan, Shivkumar Sharma, Shankar Ghosh and Mahapurush Misra. The Western music features contributions from Tony Ashton and the latter's band, the Remo Four, as well as guest appearances by Eric Clapton and Ringo Starr. Harrison recorded many other pieces that appeared in Wonderwall but not on the soundtrack album, and the Beatles' 1968 B-side \"The Inner Light\" also originated from his time in Bombay. Although the Wonderwall project marked the end of Harrison's direct involvement with Indian music as a musician and songwriter, it inspired his later collaborations with Ravi Shankar, including the 1974 Music Festival from India.", "Harrison collaborated on much of the project with John Barham,Leng, pp. 49–50.Mat Snow, \"George Harrison: Quiet Storm\", Mojo, November 2014, p. 69. who had studied composition under Harrison's sitar teacher, Ravi Shankar.Lavezzoli, pp. 62, 180, 182. A classically trained pianist and musical arranger, Barham annotated some of the melodies that Harrison sang to him and transcribed them onto staves. Leng describes Barham as Harrison's \"fellow traveler\", due to the two musicians' shared appreciation of Indian classical music.Leng, pp. 26, 27. He adds that their musical compatibility made Barham a natural choice over George Martin, the Beatles' producer and orchestral arranger.", "*John Barham – piano, flugelhorn, harmonium, orchestral arrangement"]}, {"page": "Within You Without You", "response": ["The session was also attended by Lennon, artist Peter Blake, and John Barham, an English classical pianist and student of Shankar who shared Harrison's desire to promote Indian music to Western audiences. In Barham's recollection, Harrison \"had the entire structure of the song mapped out in his head\" and sang the melody that he wanted the dilruba player to follow. The twin hand-drums of the tabla were close-miked by recording engineer Geoff Emerick, in order to capture what he later described as \"the texture and the lovely low resonances\" of the instrument."]}, {"page": "Gary Wright", "response": ["To promote Extraction, Wright formed the band Wonderwheel in April 1971, with a lineup comprising guitarist Jerry Donahue – soon replaced by Mick Jones – Archie Legget (bass) and Bryson Graham (drums).Wright, p. 98. Donahue was among the many musicians on Wright's second album, Footprint (1971),Castleman & Podrazik, p. 201. along with George Harrison and All Things Must Pass contributors such as Voormann, White, Jim Gordon, Bobby Keys and John Barham.Wright, pp. 97, 99. Produced by Wright, the album included \"Stand for Our Rights\", a call for social unity, partly inspired by the Vietnam War,Liner notes, Best of Gary Wright: The Dream Weaver. Rhino Records, 1998; produced by Gary Wright, Gary Peterson & David McLees. \"Two Faced Man\" and \"Love to Survive\".Castleman & Podrazik, pp. 105–06. In November 1971, Wright and Wonderwheel performed \"Two Faced Man\" on The Dick Cavett Show in New York, with Harrison accompanying on slide guitar.Rodriguez, pp. 88, 319–20. Wright has expressed gratitude for Harrison's support during this stage of his career, citing the ex-Beatle's uncredited production on Footprint and his arranging the Dick Cavett Show appearance. Despite this exposure, like Extraction, the album failed to chart.Wright, pp. 99–100."]}, {"page": "El Topo", "response": ["Noteworthy figures said to be fans of the film include directors David Lynch, Nicolas Winding Refn and Samuel Fuller; video game writer and director Suda51; actors Peter Fonda and Dennis Hopper; comedians The Mighty Boosh and Patton Oswalt; and performers Bob Dylan, Roger Waters, Marilyn Manson, Frank Ocean, Jarvis Cocker, Peter Gabriel, George Harrison, Lucia Lee, and John Lennon.Havis, Allan (2008), Cult Films: Taboo and Transgression, University Press of America, Inc., page 59 Gabriel has claimed Banks, T.; Collins, P.; Gabriel, P.; Hackett, S.; Rutherford, M. (2007), Genesis: Chapter & Verse, St. Martin's Griffin, page 157 that this movie was an inspiration for the classic Genesis concept album, The Lamb Lies Down on Broadway, while collaborator Jared Eckman described the film as a failed experiment.  John Barham re-recorded the score for release on Apple Records at the request of John Lennon. Suda51 cited El Topo as a key inspiration for his game No More Heroes. Gore Verbinski cited it as an influence on Rango."]}, {"page": "All Things Must Pass (song)", "response": ["The subject matter deals with the transient nature of human existence, and in Harrison's All Things Must Pass reading, words and music combine to reflect impressions of optimism against fatalism. On release, together with Barry Feinstein's album cover image, commentators viewed the song as a statement on the Beatles' break-up. Widely regarded as one of Harrison's finest compositions, its passing on by his former band has provoked comment from biographers and reviewers. Music critic Ian MacDonald described \"All Things Must Pass\" as \"the wisest song never recorded by The Beatles\", while author Simon Leng considers it \"perhaps the greatest solo Beatle composition\". The recording was co-produced by Phil Spector in London; it features an orchestral arrangement by John Barham and contributions from musicians such as Ringo Starr, Pete Drake, Bobby Whitlock, Eric Clapton and Klaus Voormann.", "The recording opens with \"unvaryingly steady\" piano chords, Inglis writes, and what Leng terms \"sensitive\" string orchestration from John Barham, soon joined by the horns and Drake's pedal steel. Leng highlights this combination as providing the song with its rising and falling musical moods, implying variously light and darkness; Inglis writes of the musical arrangement mirroring the \"competing impressions\" of hope and melancholy found in Harrison's lyrics. True to its Catskill roots, the recording evokes the Band's \"The Weight\"Clayson, p. 251. and their eponymous second album,Leng, pp. 53, 96. the tracks on which were similarly inspired by \"the beauty of that autumn in Woodstock\", according to Helm.Helm, p. 178.", "*John Barham – string arrangement"]}]}}