{"wiki_id": "http://www.wikidata.org/entity/Q6222464", "itemLabel": "John Bonnycastle", "itemDescription": "British maths teacher", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Bonnycastle", "wikipedia_page": {"main": "John Bonnycastle (baptized 29 December 1751 in Hardwick or Whitchurch, England – 15 May 1821 in Woolwich, England) was an English teacher of mathematics and author.", "link_mentions": [{"page": "Royal Military Academy, Woolwich", "response": ["*John Bonnycastle, professor of mathematics, 1807–1821"]}, {"page": "Mary Somerville", "response": ["She continued in the traditional role of the daughter of a well-connected family, attending social events and maintaining a sweet and polite manner – she was nicknamed \"the Rose of Jedburgh\" among Edinburgh socialites. Back in Burntisland a young tutor came to stay with the family to educate her younger brother Henry. Mr Craw was a Greek and Latin scholar, and Somerville asked him to purchase elementary books on algebra and geometry for her. He presented Somerville with Euclid's Elements and Algebra by John Bonnycastle. Somerville would rise early to play the piano, painted during the day, and stayed up late to study Euclid and algebra. When the family friend Lord Balmuto invited her to visit his family, Somerville first saw a laboratory. She also spent some time with the Oswalds family in Dunnikeir. Somerville was impressed with their daughter Elizabeth Oswald, a bold horsewoman who became a Greek and Latin scholar and married Thomas Bruce, 7th Earl of Elgin."]}, {"page": "Richard Henry Bonnycastle", "response": ["Lieutenant-Colonel Sir Richard Henry Bonnycastle was the son of Professor John Bonnycastle, and was born in 1791. ", "Through his son, Henry William John Bonnycastle (1813–1888) would come a prominent Bonnycastle family of Canadian politicians and adventurers and the founder of Harlequin Enterprises, the world's largest publisher of romance novels."]}, {"page": "List of names in A Biographical Dictionary of Modern Rationalists", "response": ["* John Bonnycastle"]}, {"page": "William Rutherford (mathematician)", "response": ["* John Bonnycastle's Algebra, with William Galbraith, 1848; "]}, {"page": "Joseph Johnson (publisher)", "response": ["In addition to books for children, Johnson published schoolbooks and textbooks for autodidacts, such as John Hewlett's Introduction to Spelling and Reading (1786), William Nicholson's Introduction to Natural Philosophy (1782), and his friend John Bonnycastle's An Introduction to Mensuration and Practical Mathematics (1782). Johnson also published books on education and childrearing, such as Wollstonecraft's first book, Thoughts on the Education of Daughters (1787)."]}, {"page": "There is No Natural Religion", "response": ["|width=auto| Plate b11 (application) || 225px || ApplicationHe who sees the In--finite in all thingssees God. He whosees the Ratio onlysees himself only || At the bottom of the plate, a bearded man with long hair kneels on the ground and leans forward. His right hand holds a compass, with which he seems to be measuring the foot of a triangle inscribed on the ground. On the left margin stands a tree, one of its branches arching over the man, another extending up the margin and dividing the text from the header above it. || From Copy L. The man measuring the triangle refers to the concept of \"the Ratio\" as mentioned in the text. \"Ratio\" is from the Latin for \"Reason\" (\"Rationis\"), and for Harold Bloom, \"Ratio, in Blake's use, means an abstract image or ghost of an object, which in the aggregate makes up the universe of death which is the natural experience of most men.\"Harold Bloom, \"Commentary\" in Erdman (1982: 894) Similarly, for Peter Otto, the plate depicts Nebuchadnezzar II as \"Locke's Reason, closed within the 'Closet' of the mind while the triangle is one of the simple ideas that in Locke’s system provide the primary building blocks of knowledge.\"Otto (2006: 264) For Eaves, Essick and Viscomi, the plate depicts enslavement to \"abstract reason and bondage to material nature. The latter is emphasised by the barren tree and other vegetation that curve over the figure as though to entrap him.\" Essick sees the illustration as visual pun; the literal application of Reason to the earth (represented by the ground) itself.Bindman (1974: 32) David Bindman speculates that Blake may have been inspired in this image by an engraving he had done in 1782 after a Thomas Stothard design for the frontispiece of An Introduction to Mensuration by John Bonnycastle, which depicts a young child measuring some triangles.Bindman (1978: 467) Eaves, Essick and Viscomi suggest Blake may have been building on Raphael's depiction of Euclid in The School of Athens (1511). Blake himself would use this image as the basis for two of his later planographic prints, Nebuchadnezzar (where he mirrors the posture) and Newton (where he mirrors the action; both c.1795/1805).  "]}, {"page": "Thomas Whittaker (metaphysician)", "response": ["* John Bonnycastle"]}, {"page": "William Galbraith (mathematician)", "response": ["He edited John Ainslie's 1812 treatise on land surveying (1849), and with William Rutherford revised John Bonnycastle's Algebra."]}, {"page": "List of contributors to Rees's Cyclopædia", "response": ["|John Bonnycastle (1780?–1821) ||\tAlgebra, Analysis, Astronomy", "|Algebra||Peter Barlow, John Bonnycastle, John Pond", "|Analysis|| John Bonnycastle, John Pond", "|Astronomy||\tJohn Bonnycastle, John Pond"]}, {"page": "Enoch Lewis (mathematician)", "response": ["He edited mathematical works of John Bonnycastle and Thomas Simpson, and he is well known for the first American edition of Thomas Simpson's Trigonometry with an appendix written by him using the initial E.L.", "* John Bonnycastle: An introduction to algebra; with notes and observations: designed for the use of schools and places of public education, Philadelphia, 1806 .John Bonnycastle: An introduction to algebra; with notes and observations: designed for the use of schools and places of public education,. First American edition. Philadelphia 1806 and in the second edition in 1811 Lewis writes \"errors of former editions and some improprieties in the original are corrected and removed\". "]}, {"page": "Bonnycastle, John", "response": ["#redirectJohn Bonnycastle"]}]}}