{"wiki_id": "http://www.wikidata.org/entity/Q6229261", "itemLabel": "John Despard", "itemDescription": "British Army general, colonial administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Despard", "wikipedia_page": {"main": "General\nJohn Despard (1745–1829) was an Irish-born soldier who had a long and distinguished career in the British Army and as a colonial administrator. He was the brother of Edward Despard, also a soldier, who was executed in 1803 for his part in the Despard Plot.\nJohn Despard was born in Dublin and served in the Seven Years' War and the American War of Independence. He was in 24 engagements, had two horses shot under him, was shipwrecked three times, was taken prisoner twice, and had the standard of his regiment shot out of his hand at the age of 15.He joined the army in 1760 as an Ensign in 12th Foot. In 1762, he purchased a Lieutenancy. After serving in the Seven Years' War, he was reduced to half pay from 1763 until he exchanged into 7th Foot (Royal Fusiliers) in 1768. He went with the regiment to Canada in 1773, and took part in the American War of Independence, being taken prisoner at St. John's in 1775. He was exchanged in 1776 and promoted to Captain-Lieutenant and then Captain of a Company in 1777. In 1778, he was appointed Major and de facto Commanding Officer of an Independent Company raised in America. In 1779, he was appointed Deputy Adjutant General to the Army in South Carolina and was taken prisoner at the surrender of Yorktown in 1781, being paroled to England in 1782. He was promoted to brevet Major in 1785, the rank being confirmed in 1788. He served with the regiment in Gibraltar in 1790-91 and was promoted Lieutenant-Colonel on returning to England. He served in Canada from 1793 to 1798, being promoted to Colonel in 1795. In 1798, he was appointed as a Brigadier on the Staff of the Severn District, and was promoted to Major-General, becoming Commanding Officer in Dorset in 1799 and then appointed to the Staff in Canada. From 1800 to 1807, he was military commander (and therefore civil administrator) of the colony of Cape Breton. He was promoted to Lieutenant-General in 1805 and General in 1814. From 1808 to 1809, he was Commanding Officer of 12th Garrison Battalion. In 1809, he was appointed Colonel of the 5th West India Regiment.\nHe died at his home, Swan Hill, Oswestry.", "link_mentions": {}}}