{"wiki_id": "http://www.wikidata.org/entity/Q6229828", "itemLabel": "John Dorney", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Dorney", "wikipedia_page": {"main": "John Dorney is a British writer and actor best known for stage roles at theatres including the National Theatre, the BBC Radio 4 sitcom My First Planet; and his scripts for the Big Finish Doctor Who range. His script Solitaire was rated the most popular Doctor Who Companion Chronicle of 2010 on the Timescales website and was the runner up in Unreality Sci-fi net's poll for Story of the Year 2010–11. His script Iterations of I won the Scribe Award for best spin-off audio drama of 2014.\nAs well as Doctor Who, he has written for Big Finish's Sapphire and Steel series and on radio co-wrote three series of BBC Radio 4's Recorded for Training Purposes. He won the BBC Show Me the Funny 'Sketch Factor' competition, was a finalist in the BBC 'Laughing Stock' competition, and has performed in Mark Watson's Edinburgh Comedy Award-winning long shows as 'The Balladeer'. On stage, he has written plays for the Royal Court Theatre, Hampstead and Soho Theatres.He trained at LAMDA.\n\n", "link_mentions": [{"page": "Zoe Heriot", "response": ["*\"Lepidoptery for Beginners\" by John Dorney (Short Trips: Defining Patterns)"]}, {"page": "Jamie McCrimmon", "response": ["*\"Lepidoptery for Beginners\" by John Dorney (Short Trips: Defining Patterns)"]}, {"page": "The Last (audio drama)", "response": ["*Make-Up Assistant — John Dorney"]}, {"page": "Faith Stealer", "response": ["*Bakoan — John Dorney"]}, {"page": "Anthony Howell (actor)", "response": ["| John Dorney", "| John Dorney", "| John Dorney", "| John Dorney"]}, {"page": "Mark Watson", "response": ["Watson has performed several unusual shows at the Edinburgh Fringe and Melbourne Festivals, including marathon shows lasting 24 hours and more. The first of these shows was performed at the 2004 Edinburgh Festival Fringe, which lasted 24 hours. At the end of the show he proposed to his girlfriend Emily Howes, who accepted. These shows have also featured guest appearances from other performers such as Tim Key, Tim Minchin, Adam Hills, Daniel Kitson, David O'Doherty, Brendon Burns and John Dorney as the balladeer."]}, {"page": "Gallifrey: Insurgency", "response": ["*Student B'arech - John Dorney"]}, {"page": "Gallifrey: Mindbomb", "response": ["*Captain Henzil - John Dorney"]}, {"page": "List of unmade Doctor Who serials and films", "response": ["Written by Brian Hayles. The story would have been about the origins of the Ice Warriors. The story was initiated after the transmission of their debut story. This storyline was dropped around May 1968. It was later adapted by John Dorney for Big Finish's The Lost Stories range in November 2013. The idea of the Ice Warriors returning to the series inspired Hayles to begin scripting The Seeds of Death.", "Written by Gerry Davis. This story was submitted to the production office, sometime in 1974 and commissioned soon after. The story was reworked by script editor Robert Holmes into Revenge of the Cybermen after the production crew had reservations about it, though Davis still received the full credit. It was later adapted by John Dorney for Big Finish's The Lost Stories in March 2021.", "Written by Robert Banks Stewart as a six-part story,. the story was commissioned in May 1976. This story was replaced by The Talons of Weng-Chiang,. which used the same basic premise of a villain traveling back in time,. when Stewart took up the post of script editor on the series Armchair Thriller and was unable to deliver the scripts, forcing Robert Holmes to step in to rework the story. It was later adapted by John Dorney for Big Finish's The Lost Stories range in January 2012.", "Written by Barbara Clegg this was submitted in late 1982. It dealt with a race of intelligent youths controlled by a lone Dalek. It was later adapted by John Dorney for Big Finish's The Lost Stories in October 2011, which backdated the story to after the events of the Season 20 serial Arc of Infinity, with Nyssa and Tegan as companions of the Fifth Doctor.", "On 1 November 1966, Dalek creator Terry Nation pitched a spin-off series The Daleks to the BBC, writing a thirty-minute teleplay entitled \"The Destroyers\" as a possible pilot episode for an American coproduction. The Daleks was to have focused on the adventures of the SSS. Lead characters included agents Captain Jack Corey, David Kingdom, his sister Sara Kingdom (from the Doctor Who story The Daleks' Masterplan, in which Kingdom died) and Mark Seven, an android. On 22 November 1966, the BBC informed Nation that they were no longer interested in the project. The pilot episode was adapted by Nicholas Briggs and John Dorney for Big Finish's The Lost Stories range for an audio story released in December 2010 and included on The Second Doctor Boxset, although it did not feature the Doctor himself."]}, {"page": "Short Trips: Defining Patterns", "response": ["| Lepidoptery for Beginners || John Dorney || 2nd || Jamie & Zoe"]}, {"page": "Gallifrey One", "response": ["| colspan=\"3\" |Steven Moffat, Sylvester McCoy, Matt Lucas, Sophie Aldred, David Bradley, Jemma Redgrave, Camille Coduri, Wendy Padbury, Frazer Hines, Murray Gold, Chase Masterson, Lisa Bowerman, Terry Molloy, Brian Minchin, Rona Munro, Robert Shearman, Andrew Cartmel, Jamie Mathieson, Sarah Dollard, Peter Harness, Paul Cornell, Rachel Talalay, Lawrence Gough, Hayley Nebauer, Wayne Yip, Lindsey Alford, Jessica Martin, Stephen Wyatt, Philip Martin, Mike Tucker, Mark Ayres, Chris Achilleos, Jenny Colgan, Carrie Henn, Dee Sadler, Simon Fraser, George Mann, John Dorney, Matt Fitton, Cavan Scott, Jon Davey, Tony Lee, Christopher Jones, Richard Dinnick, Edward Russell, Charlie Ross, Jason Haigh-Ellery, Sue Cowley, Sam Watts Convention Guests Gallifrey 2018 GallifreyOne.com. Retrieved 5 March 2018."]}, {"page": "The Second Doctor Boxset", "response": ["*adapted by Nicholas Briggs & John Dorney"]}, {"page": "The First Doctor Boxset", "response": ["*Alexander the Great – John Dorney", "*Rhythm – John Dorney"]}, {"page": "The Demons of Red Lodge and Other Stories", "response": ["* Villagers – Duncan Wisbey, John Dorney", "* Janson Hart – John Dorney", "by John Dorney", "* Mr Pinfield/Yokel/Running Man/Carriage Driver – John Dorney"]}, {"page": "Richard Dinnick", "response": ["* Bernice Summerfield: Dead Man's Switch (with John Dorney) (2010)"]}, {"page": "Robophobia", "response": ["*Leebar/Computer Voice – John Dorney"]}, {"page": "The Fourth Doctor Boxset", "response": ["by Robert Banks Stewart (adapted by John Dorney)"]}, {"page": "The Renaissance Man", "response": ["*Dr Henry Carnforth – John Dorney"]}, {"page": "Energy of the Daleks", "response": ["*Robomen – John Dorney / Alex Lowe / Dan Starkey"]}, {"page": "My First Planet", "response": ["* Richard - John Dorney"]}, {"page": "List of Sapphire & Steel serials", "response": ["| style=\"text-align:center;\"| John Dorney"]}, {"page": "The Light at the End (audio drama)", "response": ["*Bob Dovie – John Dorney"]}, {"page": "The War Doctor (audio drama series)", "response": ["|John Dorney"]}]}}