{"wiki_id": "http://www.wikidata.org/entity/Q6220822", "itemLabel": "John Barr", "itemDescription": "Scottish footballer who played as a centre back (1917-1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Barr_(footballer,_born_1917)", "wikipedia_page": {"main": "John Millar Barr (1917–1997) was a Scottish footballer, who played as a centre back. Barr, born in Bridge of Weir, Renfrewshire, began his career in the late 1930s with Third Lanark. Spending two years at Cathkin Park, Barr's career was – like many players – interrupted by the onset of the Second World War, and he missed several years, primarily due to being held prisoner in Germany for four years.\nReturning in the 1946–47 season with Queens Park Rangers, Barr featured twice, playing a game apiece the following season for both Dunfermline Athletic and Dundee United. Although the progression of his playing career after leaving Tannadice is unknown, Barr returned to Loftus Road as a scout for QPR, moving onto a similar position with Don Revie's Leeds United in 1961. During his time at Elland Road, Barr was responsible for finding a number of Scottish players, with many becoming full internationals. Barr maintained his association with Leeds until his death in 1997.", "link_mentions": [{"page": "John Barr", "response": ["John Barr may refer to:", "*John Barr (Canadian politician) (1843–1909), Canadian physician and politician", "*John Barr (New Zealand politician) (1867–1930), member of the New Zealand Legislative Council", "*John Barr (poet) (1809–1889), New Zealand poet", "*John Barr (basketball) (1918–2002), American basketball player", "*John Barr (shinty) (born 1982), Scottish shinty player", "*John Barr (footballer, born 1885) (1885–?), Scottish footballer (Grimsby Town)", "*John Barr (footballer, born 1917) (1917–1977), Scottish footballer", "*John Barr (librarian) (1887–1971), New Zealand librarian", "*John Barr, president of Poetry Foundation", "*John Barr, a fictional character and namesake of the Jonbar hinge concept"]}, {"page": "Deaths in March 1997", "response": ["*John Barr, 79, Scottish footballer."]}]}}