{"wiki_id": "http://www.wikidata.org/entity/Q6229170", "itemLabel": "John Denison-Pender", "itemDescription": "British businessman (1855-1929)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Denison-Pender", "wikipedia_page": {"main": "Sir John Denison Denison-Pender  (10 October 1855 – 6 March 1929), born John Denison Pender, was chairman and managing director of the Eastern Telegraph Company (now Cable & Wireless).\nPender (he assumed the additional name of Denison, his mother's maiden name, in 1890) was the third son of Sir John Pender, the founder of the Eastern Telegraph Company. His elder half-brother Sir James Pender, 1st Baronet (from Sir John Pender's first marriage) was the first chairman of Eastman Kodak (UK). John was educated at Eton College and in 1878 joined his father's company. He joined the board in 1881 and became managing director in 1893 and also deputy chairman in 1896.\nIn June 1896 Guglielmo Marconi aged 22 applied for his first patent. The technological advances with electro-magnetic waves, that had no need for cables, that Marconi was to instigate would change the entire communications industry forever. In 1901 Eastern Telegraph and Anglo-American threatened Marconi with legal action in Newfoundland if Marconi was to continue to operate his wireless telegraphy, for the next two decades it was Cable versus Wireless. Denison-Pender and his colleagues initially saw no threat from the wireless technology as wireless was slow, had a lack of secrecy and was liable to be interrupted. In 1904 Denison-Pender and the board had conversations with Lee De Forest with a view to buying a percentage of his company but the Eastern Telegraph board declined to make the investment in the end.\nIn 1917, following the retirement of Sir John Barry, he became chairman and his son, John Denison-Pender, 1st Baron Pender, succeeded him as managing director. In 1934, Imperial and International Communications, formerly the Eastern Telegraph Company, became Cable & Wireless. The new name was designed to more clearly reflect the combined radio and cable services which it offered, without reference to the Empire.\nDenison-Pender was appointed Knight Commander of the Order of St Michael and St George (KCMG) for his services to communications in the South African War. In the 1920 civilian war honours he was appointed Knight Grand Cross of the Order of the British Empire (GBE) for similar services during the First World War, in which his company was not only responsible for the lion's share of Britain's submarine telegraph cables, but also successfully cut off Germany's communications with the rest of the world.\n\n", "link_mentions": {}}}