{"wiki_id": "http://www.wikidata.org/entity/Q6220332", "itemLabel": "John Baird", "itemDescription": "Royal Navy officer, born 1832", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Baird_(Royal_Navy_officer)", "wikipedia_page": {"main": "Admiral Sir John Kennedy Erskine Baird, KCB (16 September 1832 – 8 December 1908) was an officer in the Royal Navy, who is chiefly remembered for commanding the losing side in the 1888 annual naval manoeuvres.", "link_mentions": [{"page": "John Baird", "response": ["John Baird may refer to:", "*John Baird (American football), All-American football player", "*John Baird (Australian footballer) (born 1980), Australian rules footballer", "*John Baird (cyclist), former racing cyclist from New Zealand", "*John Baird (footballer, born 1870) (1870–1905), Scottish footballer", "*John Baird (footballer, born 1985), Scottish footballer playing for Forfar Athletic", "*John Baird, Lord Newbyth (1620–1698), Scottish advocate, judge, politician and diplomat", "*John Baird (Canadian politician) (born 1969), Canadian politician and former cabinet minister", "*John Baird, 1st Viscount Stonehaven (1874–1941), eighth Governor-General of Australia", "*John Baird (Michigan politician) (1859–1934), Michigan State Representative and Senator", "*Sir John Baird, 2nd Baronet (1686–1745), Scottish Member of Parliament for Edinburghshire", "*John Baird (North West Lanarkshire MP) (1852–1900), Member of Parliament, 1885–1886", "*John Baird (Wolverhampton MP) (1906–1965), British Labour Party Member of Parliament, 1945–1964", "*John Baird (revolutionary) (1790–1820), Scottish commander in the \"Radical War\" of 1820", "*John Baird (Royal Navy officer) (1832–1908), Victorian British Admiral", "*John Baird (educator) (1795–1858), Irish-born British Army instructor", "*John Baird (RAF officer) (born 1937), British physician and retired Royal Air Force medical officer", "*John Baird (Irish divine) (died 1804)", "*John Baird (Scottish divine) (1799–1861)", "*John Baird, founder of the Create a Comic Project", "*John Baird I (1798–1859), Glasgow architect"]}, {"page": "Wootton Bridge", "response": ["Victorian admiral Sir John Baird died in Wootton in 1908, he is buried in the churchyard."]}, {"page": "Pacific Station", "response": ["|Rear Admiral John Baird || style=\"text-align:right;\"| 13 September 1884 || style=\"text-align:right;\"| 4 July 1885 ||"]}, {"page": "Admiral (Royal Navy)", "response": ["The problem of promoting strictly by seniority was well illustrated by the case of Provo Wallis who served (including time being carried on the books while still a child) for 96 years. When he died in 1892 four admirals under him could immediately be promoted. By request of Queen Victoria, John Edmund Commerell became Admiral of the Fleet rather than Algernon Frederick Rous de Horsey, who as senior active admiral nearing the age limit would customarily have received the promotion; John Baird became an Admiral; James Erskine a vice-admiral; and Harry Rawson a rear-admiral. Ironically, all these younger men would die at least a decade before de Horsey. In the time before squadron distinctions were removed or age limits instituted, the death of James Hawkins-Whitshed resulted in ten men moving up to higher ranks."]}, {"page": "Channel Fleet", "response": ["* Vice Admiral Sir John Baird (1888–1890)"]}, {"page": "HMS Northumberland (1866)", "response": ["While her half-sister , normally flagship of the Channel Squadron, was refitting in 1873–75, Agincourt, normally the flagship of the fleet second-in-command, replaced her as flagship and Northumberland became flagship of the second-in-command until Minotaurs return to duty. She served as the flagship for Rear Admirals George Hancock and Lord John Hay. Northumberland received her own refit and rearmament from 1875 to 1879 and rejoined the Channel Squadron upon its completion. The ship was paid off in 1885 for another refit and became the flagship of Vice Admirals Sir William Hewett and John Baird, successive commanders of the Channel Squadron, upon her completion in 1887.Ballard, pp. 41–42"]}, {"page": "Baird baronets", "response": ["There have been four baronetcies created for persons with the surname Baird, two in the Baronetage of Nova Scotia and two in the Baronetage of the United Kingdom. Two of the creations remain in the name of Baird and are extant as of 2021. The Baird Baronets of Newbyth (created in 1680 and 1809) and of Sauchtonhall (created in 1695) are all descended from Andrew Baird who acquired lands at Auchmedden, Aberdeenshire, in 1534. The main line, Baird of Auchmedden expired on the death in 1806 of Royal Navy Commander John Baird, son of William Baird, 7th of Auchmedden.", "The Baird Baronetcy of Newbyth in the County of Haddington, was created in the Baronetage of Nova Scotia in 4 February 1680 for William Baird, 1654-1737, son of Lord Sir John Baird, 1620-1698. Lord William Baird sat as Member of Parliament for Midlothian and was registered an Advocate and later made Lord of Session. The title became extinct in 1745 on the death of his son Sir John Baird, 2nd Bt. The Newbyth estate passed to his cousin William Baird of the Sauchtonhall branch of the family, father of Sir David Baird, 1st Baronet, of the 1809 creation (see below). See also the Baird Baronetcy of Sauchton Hall below.", "The Baird Baronetcy of Newbyth second creation, in the County of Haddington, was created in the Baronetage of the United Kingdom on 13 April 1809 for the soldier David Baird, grandson of William Baird, a younger son of Sir Robert Baird, 1st Baronet, of Sauchtonhall. His father William Baird had inherited the Newbyth estate in 1745 on the death of Sir John Baird, 2nd Baronet, of the 1680 creations. The baronetcy was created with remainder to Baird's elder brother Robert Baird and the heirs male of his body. Baird died childless and was succeeded according to the special remainder by his nephew David Baird, the second Baronet. As a descendant of Sir Robert Baird, 1st Baronet, of Saughton Hall, the present Baronet of Newbyth is also in remainder to this title.", "Patrick Baird (died 1816), brother of the first Baronet, was a Major-General in the British Army. Wynn Baird (1799–1835), younger brother of the second Baronet, was a captain in the Royal Navy. Sir John Baird, second son of the second Baronet, was an Admiral in the Royal Navy.", "*[[Sir John Baird, 2nd Baronet (1686–1745)"]}, {"page": "Charles Kennedy, 5th Marquess of Ailsa", "response": ["On 15 December 1925, he married Constance Barbara Clarke, widow of Sir John Baird.The Complete Peerage, Volume XIV, page 13 She died in 1931. Kennedy made a second marriage to Helen Ethel McDouall, widow of Richard John Cuninghame, of Hensol House, on 26 April 1933."]}, {"page": "Archibald Kennedy, 3rd Marquess of Ailsa", "response": ["* Charles Kennedy, 5th Marquess of Ailsa (1875–1956), who married Constance Clarke, widow of Sir John Baird."]}, {"page": "John Kennedy Erskine Baird", "response": ["#REDIRECT John Baird (Royal Navy officer)"]}]}}