{"wiki_id": "http://www.wikidata.org/entity/Q6238069", "itemLabel": "John Hartley Durrant", "itemDescription": "British entomologist and scientific illustrator", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hartley_Durrant", "wikipedia_page": {"main": "John Hartley Durrant (10 January 1863 in Hitchin – 18 January 1928 in Putney) was an English entomologist who specialised in Lepidoptera.\nDurrant was an authority on nomenclature. He was Lord Walsingham's secretary and had charge of his collections. When these were left to the Natural History Museum, Walsingham provided funds for Durrant to continue to curate them. He was author, with Lionel Walter Rothschild, of Lepidoptera of the British Ornithologists' Union and Wollaston Expeditions in the Snow Mountains, Southern Dutch New Guinea; Macrolepidoptera. Tring, Zoological Museum (1915) and many scientific papers on Lepidoptera.\nIn 1914 Durrant began a collaboration with Francis David Morice in a significant nomenclatural work entitled \"The authorship and first publication of the \"Jurinean\" Genera of Hymenoptera: being a reprint of a long-lost work by Panzer, with a translation into English, an introduction, and bibliographical and critical notes\".  Transactions of the Entomological Society of London 1914:339-436 (corrections, additions Transactions of the Entomological Society of London 1916:432-442).\nHe was a fellow of the Royal Entomological Society.\nHis collections are divided between the Natural History Museum, London and the Hope Department at the Oxford University Museum of Natural History.", "link_mentions": [{"page": "Francis David Morice", "response": ["*1915 with John Hartley Durrant The authorship and first publication of the \"Jurinean\" Genera of Hymenoptera: being a reprint of a long-lost work by Panzer, with a translation into English, an introduction, and bibliographical and critical notes.  Transactions of the Entomological Society of London1914:339-436."]}, {"page": "John Durrant", "response": ["*John Hartley Durrant,  entomologist"]}, {"page": "Choreutis chi", "response": ["Choreutis chi is a moth in the family Choreutidae. It was described by John Hartley Durrant in 1915. It is found in Papua New Guinea."]}, {"page": "Choreutis topitis", "response": ["Choreutis topitis is a moth in the family Choreutidae. It was described by John Hartley Durrant in 1915. It is found on New Guinea."]}, {"page": "Mometa zemiodes", "response": ["Mometa zemiodes is a moth of the family Gelechiidae. It was described by John Hartley Durrant in 1914. It is found in Angola, the Democratic Republic of the Congo (Katanga, West Kasai), Mozambique, Nigeria, Somalia, South Africa and Zimbabwe."]}, {"page": "Lecithocera deloma", "response": ["Lecithocera deloma is a moth in the family Lecithoceridae. It was described by John Hartley Durrant in 1915. It is found on New Guinea."]}, {"page": "Lecithocera strigosa", "response": ["Lecithocera strigosa is a moth in the family Lecithoceridae. It was described by John Hartley Durrant in 1915. It is found on New Guinea."]}, {"page": "Pacificulla miltina", "response": ["Pacificulla miltina is a moth in the family Lecithoceridae. It was described by John Hartley Durrant in 1915. It is endemic to New Guinea."]}, {"page": "Crocanthes celema", "response": ["Crocanthes celema is a moth in the family Lecithoceridae. It was described by John Hartley Durrant in 1915. It is found on New Guinea."]}, {"page": "Crocanthes crypsichola", "response": ["Crocanthes crypsichola is a moth in the family Lecithoceridae. It was described by John Hartley Durrant in 1915. It is found on New Guinea."]}, {"page": "Crocanthes fallax", "response": ["Crocanthes fallax is a moth in the family Lecithoceridae. It was described by John Hartley Durrant in 1915. It is found on New Guinea."]}, {"page": "Antaeotricha zelleri", "response": ["Antaeotricha zelleri is a moth in the family Depressariidae. It was described by Lord Walsingham and John Hartley Durrant in 1896. It is found in Panama, Costa Rica, French Guiana and Brazil.\"Antaeotricha Zeller, 1854\" at Markku Savela's Lepidoptera and Some Other Life Forms."]}, {"page": "Bursadella acribes", "response": ["Bursadella acribes is a moth in the family Immidae. It was described by John Hartley Durrant in 1916. It is only known from Biak.de Vos, Rob \"Bursadella acribes (Durrant, 1916)  The Immidae (Lepidoptera) of Papua Indonesia\". Papua-Insects.nl. The Papua Insects Foundation. Retrieved January 12, 2021."]}, {"page": "Bursadella timetica", "response": ["Bursadella timetica is a moth in the family Immidae. It was described by John Hartley Durrant in 1915. It is found on New Guinea.de Vos, Rob \"Bursadella timetica (Durrant, 1915)  The Immidae (Lepidoptera) of Papua Indonesia\". Papua-Insects.nl. The Papua Insects Foundation. Retrieved January 12, 2021."]}, {"page": "Moca discophora", "response": ["Moca discophora is a moth in the family Immidae. It was described by John Hartley Durrant in 1915. It is found on New Guinea.De Vos, Rob. \"The Immidae (Lepidoptera) of Papua Indonesia  Moca discophora (Durrant, 1915)\". Papua-Insects.nl. The Papua Insects Foundation. Retrieved 8 September 2020."]}]}}