{"wiki_id": "http://www.wikidata.org/entity/Q6238858", "itemLabel": "John Henry Knight", "itemDescription": "British automotive pioneer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Henry_Knight_(inventor)", "wikipedia_page": {"main": "John Henry Knight (21 January 1847 – 22 September 1917), from Farnham, was a wealthy engineer, landowner and inventor. With the help of the engineer George Parfitt he built one of Britain’s first petrol-powered motor vehicles, Frederick Bremer of Walthamstow having built the first in 1892.  On 17 October 1895, with his assistant James Pullinger, they drove through Farnham, Surrey, whereupon he was prosecuted for using a locomotive with neither a licence nor a man walking in front with a red flag. This is sometimes misreported as the first person to be convicted of speeding in the UK, but that sobriquet subsequently fell to Walter Arnold of East Peckham, Kent, in January 1896.Knight was both an inventor and pioneer, having created a (failed) steam powered road vehicle; a renowned steam powered hop digger; a heat saving radiator; a brick laying machine; a grenade thrower, a speedometer, wooden vehicle tyres, and a patent 'dish lever' for tilting plates when carving meat.\nKnight was a founder member of the Automobile Association and politically active in the repeal of the Red Flag Act, he was also a pioneer of colour photography, plus writing various factual and practical books.\n\n", "link_mentions": [{"page": "Farnham", "response": ["John Henry Knight (1847–1917), who built the first British motor car and designed a number of innovative digging machines for use in hop fields, was born and brought up at Weybourne on the outskirts of the town."]}, {"page": "Daimler Company", "response": ["One of the duties assigned to Simms was to find a suitable location for the factory. Simms found the Trusty Oil Engine Works, a company in receivership whose six-acre site at Cheltenham included a foundry, a machine shop, and testing facilities.John Henry Knight's Trusty Oil Engine Works. Automobile Quarterly, Volume 4, Issue 1. Simms recommended buying the works immediately since, with ready facilities and the availability of skilled workers, they could start up in a very short time. Instead, at the first statutory meeting of the company, held while Simms was overseas, Lawson persuaded the board to buy a disused four-storey cotton mill in Coventry which was owned by Lawson's associate Ernest Terah Hooley. Despite Simms' later protest and pleas to sell the mill and buy the Trusty Oil Engine Works, Daimler stayed with the mill as the site of Britain's first automobile factory."]}, {"page": "Three-wheeler", "response": ["In 1896, John Henry Knight showed a tri-car at The Great Exhibition."]}, {"page": "John Knight", "response": ["*John Henry Knight (inventor) (1847–1917), engineer, landowner and inventor"]}, {"page": "Badshot Lea", "response": ["* John Henry Knight – Inventor, engineer and local landowner"]}, {"page": "Frederick Richard Simms", "response": ["Following the signal success of Daimler-powered Peugeots and Panhards at the 1894 Paris-Rouen Trials, Simms decided to open a motor car factory. In June 1895, Simms and Evelyn Ellis bought in France and brought to England one of the first petrol–powered cars into the UK.At the June 1895 board meeting Simms detailed to the board of The Daimler Motor Syndicate his plans to form The Daimler Motor Company Limited and to build a brand-new factory, incorporating light rail, for 400 workmen making Daimler Motor Carriages. He then proudly produced the first car licence, for a 3½hp Panhard et Levassor (later referred to as a Daimler Motor Carriage).  Bought in France by Evelyn Ellis, who had three Daimler motor launches moored by his house at Datchet, it was landed at Southampton on 3 July and driven by Ellis to Micheldever near Winchester where he met Simms.  Ellis drove on to Datchet then to Malvern.  Simms subsequently described their ride in a long letter to the Saturday Review. This was the first long journey by a motorcar in Britain.  Simms firmed up his plans for the new company and new factory selecting a six-acre site at Cheltenham, John Henry Knight's Trusty Oil Engine Works, but Lawson was to buy this scheme from them and move it to Coventry."]}, {"page": "Weybourne, Surrey", "response": ["thumb|Weybourne House FarnhamWeybourne appears on the 1816 Ordnance Survey First Series map as Weyburn and is limited to a few buildings to the south and east of the Weybourne Road Weybourne Lane crossroads. The buildings to the south of that crossroad are dominated by Weybourne House, a grade II* listed building dated at 1724. Weybourne House - A Grade II* Listed Building in Farnham, Surrey The name of the village may derive from that of the house, which in turn is made up of two elements: \"Wey\", being the name of the river running through Farnham, and 'bourne\" or \"burn\" meaning 'stream'. Weybourne House is the birthplace of John Henry Knight (born 1847), the pioneering motorist and auto-mobile manufacturer, who lived there until his family moved to Barfield in Runfold, Farnham.", "350px|thumb|right|John Henry Knight driving his own creation \"The first petroleum carriage for two people made in England\" ", "*John Henry Knight - Pioneering motorist and auto-mobile manufacturer; lived in Weybourne House, before moving to Barfield in Runfold, Farnham. He designed and built \"The first petroleum carriage for two people made in England\" "]}, {"page": "Frederick Bremer", "response": ["*John Henry Knight"]}, {"page": "History of steam road vehicles", "response": ["In 1868-1870 John Henry Knight of Farnham built a four wheeled steam carriage which originally only had a single-cylinder engine."]}, {"page": "Runfold", "response": ["John Henry Knight, a former resident of Barfield House in the village, built \"The first petroleum carriage for two people made in England\".  Barfield School, an independent mixed gender Primary School, is now located there; Mike Hawthorn, Britain's first Formula One motor racing World Champion was educated here."]}, {"page": "Locomotives on Highways Act 1896", "response": ["The powerful railways lobby and those with interests in transport using horse-drawn vehicles\"About seventy years ago, at the time of the introduction of railways, there were scores of steam coaches and steam carriages running on our roads. The pioneers of this industry were Hancock, Gurney, Summers, and others, many of whose names are lost at the present day. But the opposition of the Turnpike Trustees, the coach proprietors, and the railway companies nipped in the bud a promising industry by the imposition of excessive tolls and adverse Acts of Parliament.\" John Henry Knight Ten Years Progress; 1906,\t", "Motor car enthusiasts strongly urged the removal of these restrictions on motorcars.\"Among the names of those who pushed forward the movement may be mentioned Sir David Salomons, the Hon. Evelyn Ellis, Colonel Holden, Messrs. Shaw Lefevre, C. S. Rolls, F. R. Simms, and H. Sturmey.\" John Henry Knight Ten Years Progress; 1906,\t", "By 1895 some drivers of early lightweight steam-powered autocars thought that these would be legally classed as a horseless carriage and would therefore be exempt from the need for a preceding pedestrian. John Henry Knight brought a test case to court in 1895. On 17 October 1895 Knight's assistant, James Pullinger, was stopped in Castle Street, Farnham, by the Superintendent of Police and a crowd had gathered by the time Knight arrived. The Superintendent asked whether it was a steam engine, Knight replied that it was not and thus admitted liability. He and Pullinger were charged with using a locomotive without a licence. The case was heard at Farnham Petty Sessions in Farnham Town Hall on 31 October 1895. Knight and Pullinger were both fined half a crown 2s 6d (or possibly 5 shillingsWey River, History of Farnham ) plus 10 shillings costs (or possibly 12s 6d).British Local History, The First Motor Offender\"In the same year, 1895, I made my little petrol car to carry two (one besides the driver). It weighed a little under 5 cwt., but the engine did not develop much more than 1 h.p. It was fairly successful, but it brought me into the clutches of the law, and both my man, who was driving at the time, and myself were fined 2s. 6d. and costs for driving a locomotive (in legal phraseology a traction engine) without a licence and without a red flag!\" John Henry Knight Ten Years Progress; 1906,\t"]}, {"page": "Speed limit enforcement", "response": ["By 1895 some drivers of early lightweight steam-powered autocars assumed that these would be legally classed as a horseless carriage and would therefore be exempt from the need for a preceding pedestrian. A test case was brought by motoring pioneer John Henry Knight, who was subsequently convicted of using a locomotive without a licence. The Locomotives on Highways Act 1896 lifted some of the restrictions introduced by the 1865 Act, notably raising the speed limit for \"light locomotives\" under 3 tonnes to . The speed limit was lifted again by the Motor Car Act 1903 to ."]}, {"page": "List of steam car makers", "response": ["| Knight || England || 1868–1870 || In 1868–1870 John Henry Knight of Farnham built a four-wheeled steam carriage which originally only had a single-cylinder engine."]}, {"page": "September 1917", "response": ["* Died: John Henry Knight, British engineer, invented one of the first petrol-powered automobiles in Great Britain (b. 1847)"]}, {"page": "British Motor Syndicate", "response": ["The general public promptly bought all the new capital of the November 1896 flotation despite the financial press's warnings of Lawson's failures with his other recent new flotations. Lawson then sold to embryo subsidiary business, British Daimler, the rights he had just bought from Simms – for near half the capital raised – and asked Simms as BMS consulting engineer to find suitable premises to begin manufacture of engines under the licence and complete cars. Simms found an ideal purpose-built building in Cheltenham belonging to John Henry Knight but Hooley had found a disused four-storey cotton mill in Coventry and despite its unsuitability Lawson bought that from his crony Hooley and so the motor industry developed in Coventry not Cheltenham. The new Coventry premises were shared with Edward Joel Pennington, a confidence trickster who obtained most of the cash BMS raised from the public in exchange for no cars."]}, {"page": "St John the Evangelist Church, Hale, Surrey", "response": ["* John Henry Knight (inventor), builder of one of Britain's first petrol-powered motor vehicles.John Henry Knight, National Motor Museum. Retrieved 2019-08-04."]}]}}