{"wiki_id": "http://www.wikidata.org/entity/Q6232064", "itemLabel": "John Everett-Heath", "itemDescription": "British writer and diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Everett-Heath", "wikipedia_page": {"main": "John Everett-Heath is a British author, former civil servant, and a Fellow of the Royal Geographical Society.  Everett-Heath was a military diplomat in Belgrade and, during his 13 years in the civil service, was concerned with Russia, Central Asia, and the Caucasus. He has lived in Cameroun, Cyprus, Italy, Kenya, Malaysia, Oman, United States, and Yemen.His publications include the Oxford University Press's Concise Dictionary of World Place-Names, and \"Place names of the world: historical context, meanings and changes\" in which he shares his view that:\n\nPlace names are a window onto the history and characteristics of a country.", "link_mentions": [{"page": "Tiber", "response": ["The genesis of the name Tiber probably was pre-Latin, like the Roman name of Tibur (modern Tivoli), and may be specifically Italic in origin. The same root is found in the Latin praenomen Tiberius. Also, Etruscan variants of this praenomen are in Thefarie (borrowed from Faliscan *Tiferios, lit. '(He) from the Tiber' < *Tiferis 'Tiber') and Teperie (via the Latin hydronym Tiber).\"Tiber\". Concise Dictionary of World Place-Names. John Everett-Heath. Oxford University Press 2005.George Davis Chase, \"The Origin of Roman Praenomina\", in Harvard Studies in Classical Philology, vol. VIII (1897)"]}, {"page": "Sunda Strait", "response": ["The Sunda Strait (Indonesian: Selat Sunda) is the strait between the Indonesian islands of Java and Sumatra.  It connects the Java Sea to the Indian Ocean. The name came from Sunda Kingdom, a kingdom ruling the west part of Java (now including West Java, Banten, and some west part of Central Java). It also comes from the name of the Sundanese people, the native people of West Java, with the Javanese people being found mostly in Central and East Java.\"Sunda Islands\". Concise Dictionary of World Place-Names. John Everett-Heath. Oxford University Press 2005. Oxford Reference Online. Oxford University Press."]}, {"page": "Marlborough, Wiltshire", "response": ["The earliest sign of human habitation is the Marlborough Mound, a  prehistoric tumulus in the grounds of Marlborough College. Recent radiocarbon dating has found it to date from about 2400 BC. It is of similar age to the larger Silbury Hill about  west of the town. Legend has it that the Mound is the burial site of Merlin and that the name of the town comes from Merlin's Barrow. More plausibly, the town's name possibly derives from the medieval term for chalky ground \"marl\"—thus, \"town on chalk\". However more recent research, from geographer John Everett-Heath, identifies the original Anglo-Saxon place name as Merleberge, with a derivation from either the personal name of Mærle combined with  beorg (hill), or meargealla beorg: hill where gentian grows. On John Speed's map of Wiltshire (1611), the town's name is recorded as Marlinges boroe. The town's motto is Ubi nunc sapientis ossa Merlini (\"Where now are the bones of wise Merlin\")."]}, {"page": "National delimitation in the Soviet Union", "response": ["*John Everett-Heath (2003) Central Asia: History, Ethnicity, Modernity, Routledge-Curzon,  "]}, {"page": "Duncan Passage", "response": ["* Sunda Strait\"Sunda Islands\". Concise Dictionary of World Place-Names. John Everett-Heath. Oxford University Press 2005. Oxford Reference Online. Oxford University Press.Donald B. Freeman, The Straits of Malacca: Gateway Or Gauntlet?. McGill-Queen's Press, 2006.The designaiton of routing measures in Sunda and Lombok Straits."]}, {"page": "JOHN EVERETT-HEATH", "response": ["#REDIRECT John Everett-Heath "]}, {"page": "Name of Jersey", "response": ["These -ey names could have been reinforced by the Viking heritage, because -ey is similar, so that it is possible to interpret the first part of the toponym as an Old Norse element. The source of it is unclear. Scholars surmise it derives from hjörr (Old Norse for \"sword\") or jarl (earl), or perhaps a personal name, Geirr (\"Geirr's Island\").\"Jersey\", Concise Dictionary of World Place-Names. John Everett-Heath. Oxford University Press 2005. Oxford Reference Online. Oxford University Press. Jersey Library. 6 October 2006  The personal name explanation is accepted by Richard Coates, who also discusses the names of the other Channel Islands.The ancient and modern names of the Channel Islands: a linguistic history. Richard Coates. Paul Watkins 1991. "]}, {"page": "John Everett (disambiguation)", "response": ["* John Everett-Heath, British author, former civil servant, and Fellow of the Royal Geographical Society"]}, {"page": "Everett-Heath, John", "response": ["#redirectJohn Everett-Heath"]}]}}