{"wiki_id": "http://www.wikidata.org/entity/Q6232646", "itemLabel": "John Fairbairn", "itemDescription": "South African politician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Fairbairn_(educator)", "wikipedia_page": {"main": "John Fairbairn (9 April 1794 – 5 October 1864) was a newspaper proprietor, educator, financier and politician of the Cape Colony.\nAccording to the Standard Encyclopaedia of Southern Africa, “The embryo of the State education system we know today, trial by jury, the principle of the mutual life assurance company – all these were fruits of his endeavours at the Cape”.", "link_mentions": [{"page": "List of Scots", "response": ["* John Fairbairn (1794–1864), newspaper proprietor, educator, financier and politician of the Cape Colony"]}, {"page": "List of South Africans", "response": ["*John Fairbairn, founder of Mutual Life (1794–1864)"]}, {"page": "Thomas Pringle", "response": ["Born at Blaiklaw (now named Blakelaw), four miles south of Kelso in Roxburghshire he attended Kelso Grammar School and went on to study at Edinburgh University, where he developed a talent for writing. Injured in an accident in infancy, he did not follow his father into farming, but after attending Kelso grammar school and later Edinburgh University worked as a clerk and continued writing, soon succeeding to editorships of journals and newspapers. In 1816 one of his poems celebrating the countryside near Kelso came to the attention of the novelist Sir Walter Scott, who admired it. A friendship developed between the two and by Scott's influence, whilst facing hard times and unable to earn a living, Pringle secured free passage and a British Government resettlement offer of land in South Africa, to which he emigrated in 1820.This was a scheme to populate the frontier of the Cape with Settlers and provide a buffer against the Africans. He headed a party of Scottish Settlers whose farms were granted in the Baviaans River Valley miles away from the bulk of the 5,000 English Settlers who were granted land in the area of Grahamstown. Being lame, he himself took to literary work in Cape Town rather than farming, opened a school with fellow Scotsman John Fairbairn, and conducted two newspapers, the South African Journal, and South African Commercial Advertiser. However, both papers became suppressed for their free criticisms of the Colonial Government, and his school closed."]}, {"page": "The Witness (newspaper)", "response": ["The founding editor and first proprietor of the newspaper was David Dale Buchanan -Wikitree-, who was born in New Lanark, Scotland on 17 December 1817. In 1829 at age 12 he arrived in Cape Town in the company of his elder brother, William. In Cape Town, he came into contact with men like Thomas Pringle and John Fairbairn who played a prominent role in establishing the freedom of the press during the autocratic governorship of Lord Charles Somerset. Another influence was the missionary Dr John Philip, whose liberal ideas concerning the indigenous people of the Cape Colony had a profound influence on the youthful Buchanan. While still in the Cape he went into partnership with his brother to set up the Cape Town Mail. In January 1846, he disembarked with his family from the Julia in Durban and from there proceeded inland to Pietermaritzburg, which had only three years previously been the capital of a Boer republic."]}, {"page": "1864 in South Africa", "response": ["* 5 October – John Fairbairn, newspaper proprietor, educator, financier and politician. (b. 1794)"]}, {"page": "Old Mutual", "response": ["Old Mutual Limited is a pan-African investment, savings, insurance, and banking group.  It is listed on the Johannesburg Stock Exchange, the Zimbabwe Stock Exchange, the Namibian Stock Exchange and the Botswana Stock Exchange. It was founded in South Africa by John Fairbairn in 1845 and was demutualised and listed on the London Stock Exchange and other stock exchanges in 1999. It introduced a new strategy, called 'managed separation', that entailed the separation of its four businesses - Old Mutual Emerging Markets, Nedbank, UK-based Old Mutual Wealth and Boston-based Old Mutual Asset Management (OMAM) - into standalone entities in 2018. This led to the demerger of Quilter plc (formerly Old Mutual Wealth) and the unbundling of its shareholding in Nedbank. The business, which is now largely based in South Africa, provides sponsorship and supports bursaries at South African universities.", "The company was founded in 1845 as a mutual insurance company by John Fairbairn, together with several other prominent Cape Town figures, such as the liberal politician Saul Solomon. The original name The Mutual Life Assurance Society of the Cape of Good Hope was changed to The South Africa Mutual Life Assurance Society in 1885."]}, {"page": "Cape Argus", "response": ["Saul Solomon, now the sole owner of the Cape Argus from 1863, through Saul Solomon & Co., threw the newspaper entirely behind responsible government and support for non-racialism. He was immensely influential in building and shaping the company, which quickly became the leading newspaper of the Cape, overtaking the \"Commercial Advertiser\" of John Fairbairn."]}, {"page": "John Philip (missionary)", "response": ["John Philip (14 April 1775 – 27 August 1851), was a missionary in South Africa. Philip was born at Kirkcaldy, Fife, Scotland to a local schoolmaster. After starting as an apprentice to a linen draper in Leven, and working as a clerk in Dundee, he entered the Wesleyan theological college at Hoxton, and in 1804 was appointed minister of the first Scottish Congregational chapel in Aberdeen. On 24 September 1809 he married Jane Ross, the daughter of a prosperous Aberdeen engineer; they had seven children. His daughter, Elizabeth (Eliza), married John Fairbairn, the renowned educator, politician and financier, on 24 May 1831."]}, {"page": "Christoffel Brand", "response": ["Together with John Fairbairn, he campaigned for representative government and supported the Anti-Convict Movement. Together with F.W. Reitz, Sr. (father of State President Francis William Reitz of the Orange Free State), Fairbairn and Stockenström, he agitated for an elected Legislative Assembly. When representative government was finally introduced, Brand became the first Speaker of the Cape House of Assembly – a position he held for 20 years. He was knighted in 1860."]}, {"page": "Fairbairn College", "response": ["At the first meeting on 28 March 1977, the School Committee unanimously decided to name the school Fairbairn College.School Committee minutes. However, the Parow School Board and Cape Education Department over-ruled their decision, approving instead the name Fairbairn High School.  The School was named after John Fairbairn who was invited to the Cape by Thomas Pringle to start a school for the children of the 1820 Settlers. After Fairbairn was declared a Model C state-aided school, the Governing Body, on 23 November 1992, unanimously resolved to use its new powers to change the name to Fairbairn College.Governing Body minutes. The Cape Education Department was informed of this decision and the name was changed in the official records on 11 February 1993."]}, {"page": "John Fairbairn", "response": ["John Fairbairn may refer to:", "*John Fairbairn (writer), English political journalist, author and translator", "* John Fairbairn (Horticulturist), Curator of Chelsea Physic Garden 1784–1814", "*John Fairbairn (educator) (1794–1854), newspaper proprietor, educator, financier and politician", "*John Fairbairn, prisoner on St. Michael of Scarborough", "*John Fairbairn (skeleton racer) (born 1983), Canadian skeleton racer", "*John Fairbairn or Ka'imi Fairbairn (born 1994), American football player", "* John Fairbairn (naval officer) (1912–1984), South African naval officer who annexed the Prince Edward islands for South Africa"]}, {"page": "Cape Qualified Franchise", "response": ["There were a range of motivations for the creation of this early non-racial political system. Many powerful members of the Cape's political elite in the 1850s, leaders such as John Fairbairn, Saul Solomon, John Molteno and William Porter, genuinely seemed to believe that it was the only fair way to run a society, and that racial distinctions counted as unjust discrimination. In 1838, it had already been ruled in the Cape Colony that the law was not to discriminate on the basis of race or colour.Vivian Bickford-Smith: Ethnic Pride and Racial Prejudice in Victorian Cape Town Cambridge University Press. 2003. p.26. "]}, {"page": "William Porter (Attorney General)", "response": ["The prominence of his position in the Cape helped to bring liberal principles into the mainstream in the conservative colony. Several progressive local leaders such as Saul Solomon, John Molteno and John Fairbairn soon surfaced and, taking advantage of their beliefs' new acceptability, began to take control of the Cape's politics.RFM Immelman: Men of Good Hope, 1804-1954. CTCC: Cape Town, 1955."]}, {"page": "Parliament of the Cape of Good Hope", "response": ["** John Fairbairn, Swellendam"]}, {"page": "Robert Godlonton", "response": ["The Cape was finally given freedom of the press in 1828, due largely to the efforts of the journalist and politician John Fairbairn. In 1834 Godlonton became partner in the Grahamstown Journal and in 1839 he took over the business. The firm, now renamed Godlonton & White, became the leading newspaper in the Eastern Cape. He eventually developed a wide range of business interests, but his primary activity remained newspapers and the printing industry. He gained a controlling stake in the Kingwilliamstown Gazette, the Uitenhage Times, the Queenstown Free Press, the Eastern Province Herald, the Eastern Province Monthly Magazine, the Friend of Bloemfontein, and Het Grahamstads Register en Boeren-vriend.", "Godlonton's role as the press advocate of Eastern Cape frontier opinion mirrored the powerful role that John Fairbairn (and later Saul Solomon) played as leading press advocates of Western Cape liberal opinion."]}, {"page": "The South African Commercial Advertiser", "response": ["On its founding, the paper was edited by the two Scotsmen, the poet Thomas Pringle and the educator John Fairbairn, and was printed by George Greig. After a series of mergers and name changes it finally ceased publication in 1879. The paper's final name was The Cape Standard and Mail.", "John Fairbairn, now the paper's sole editor, led the publication to become a powerful voice for greater democracy in the Cape Colony. For the next 40 years, it dominated the Cape's media. "]}, {"page": "Francis William Reitz Sr.", "response": ["He was initially only attracted to politics due to the \"Convict agitation\" of 1849, where he represented communities of the Overberg region. He first served on the early, weak & nominal Legislative Council from 6 September 1850, when he was elected, together with Andries Stockenström, Christoffel Brand and John Fairbairn. The Governor Harry Smith however installed a puppet member, the pro-imperialist Robert Godlonton, as a means of influencing the council. The four \"popular\" members attempted to amend the constitution but, being obstructed, they resigned en masse, and drew up the famous \"Sixteen Articles\" as the proposed democratic constitution for the country. These were conveyed to London, and a long controversy ensued."]}, {"page": "Egidius Benedictus Watermeyer", "response": ["When the Cape attained its first Parliament in 1854, several Districts requested him to stand as an MP, and he agreed eventually to stand for the District which had asked first - Worcester. He missed the first session (being on circuit) but immediately on taking his seat, he joined the liberal anti-government party of Saul Solomon, William Porter, John Molteno and John Fairbairn (whom he greatly admired). With several of these colleagues, he helped frame the Standing Rules and Orders of the house. He was one of the Members of Parliament who supported the first (unsuccessful) attempt to institute \"responsible government\" in 1855."]}, {"page": "Frederick Stephanus Watermeyer", "response": ["Watermeyer had been an early supporter of the anti-government \"popular party\" since the 1850 Convict Crisis. This party, led by Frank Reitz, John Fairbairn, Andries Stockenström and Christoffel Brand, was involved in boycotting the British government plans for the Cape, in order to attain full representative government (i.e. an elected legislature).", "He married Jane Agnes Fairbairn, daughter of the educator, humanitarian and MP John Fairbairn. They had six children, none of whom married."]}, {"page": "John Fairbairn (naval officer)", "response": ["Commodore John Fairbairn (12 March 1912 – March 1984) was a South African Naval officer."]}, {"page": "1858–59 Cape Colony parliamentary election", "response": ["|John Fairbairn"]}]}}