{"wiki_id": "http://www.wikidata.org/entity/Q6236252", "itemLabel": "John Gregg", "itemDescription": "English businessman, best known as the founder of Greggs", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Gregg_(baker)", "wikipedia_page": {"main": "John \"Jack\" Robson Gregg (1909–1964) was an English businessman, best known as the founder of Greggs, the United Kingdom's largest bakery chain.\n\n", "link_mentions": [{"page": "John Gregg", "response": ["John Gregg may refer to:", "*John Gregg (Guildford MP) (died 1431 or after), English MP for Guildford", "*John Gregg (Texas politician) (1828–1864), American politician from Texas who was killed in action during the American Civil War", "*John Gregg (bishop of Cork) (1798–1878), Anglican Bishop of Cork, Cloyne and Ross, 1862–1878", "*John Gregg (archbishop of Armagh) (1873–1961), Anglican Archbishop of Armagh 1939–1959", "*John Gregg (1899–1986), companion of philanthropist Robert Allerton", "*John Gregg (baker) (1909–1964), British founder of Greggs bakery", "*John Gregg (actor) (1939–2021), Australian actor", "*John Gregg (loyalist) (1957–2003), Ulster loyalist, member of the UDA", "*John Gregg Fee (1816–1901), founder of Berea College"]}, {"page": "List of companies named after people", "response": ["* Greggs – John Gregg"]}, {"page": "Greggs", "response": ["Greggs was founded by John Gregg as a Tyneside bakery in 1939. It opened its first shop in Gosforth, Newcastle upon Tyne in 1951. When Gregg died in 1964, the bakery was taken over by his son, Ian, assisted by his brother, Colin. Major expansion began soon after, including the acquisitions of other bakeries such as Glasgow-based Rutherglen in 1972, Leeds-based Thurston's in 1974, Broomfields the Bakers, London, Bowketts the Bakers in Kent, Tooks the Bakers (East Anglia) and Price's (Manchester) in 1976."]}, {"page": "Fernwood House", "response": ["During this period, Fernwood House was more commonly known as Fernwood House Maternity Hospital. While it remained as a private hospital throughout, many complicated births were treated in the hospital for people in the surrounding area. In 1945, George Orwell’s wife Eileen Blair, was admitted to the Fernwood House Maternity Hospital and underwent a hysterectomy whilst her husband George was in Paris reporting on the closing states of World War II. Eileen Blair died while under general anesthetic in the hospital. She was buried in nearby Jesmond Cemetery. Other notable births at the hospital included the founder of Greggs, John Gregg and also two senior figures of Lowes Financial Management."]}]}}