{"wiki_id": "http://www.wikidata.org/entity/Q6238272", "itemLabel": "John Hawes", "itemDescription": "Archirect and priest", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hawes", "wikipedia_page": {"main": "John Cyril Hawes  (7 September 1876 – 26 June 1956) was an architect and priest. Hawes was known for designing and constructing church buildings in England, Western Australia and The Bahamas. He served as a priest in the Church of England before converting to Roman Catholicism and received ordination as a Catholic priest. He was later named a Domestic Prelate by Pope Pius XI and given the title \"monsignor\". After retiring he lived as a hermit in The Bahamas, becoming known more commonly as Father Jerome.", "link_mentions": [{"page": "Geraldton", "response": ["The St Francis Xavier Cathedral was designed by World renowned Arts & Crafts architect and Catholic priest Monsignor John Hawes (1876–1956). Construction began in 1916 and was completed in 1938. The cathedral's architecture is unique and considered one of the finest Cathedrals of the world built in the 20th Century."]}, {"page": "Cat Island, Bahamas", "response": ["Cat Island is located in central Bahamas, and is one of its districts.  Cat Island also has the nation's highest point, Mount Alvernia (also known as Como Hill). It rises to  and is topped by a monastery called The Hermitage. This assembly of buildings was erected by the Franciscan \"Brother Jerome\" (John Hawes)."]}, {"page": "Mount Alvernia", "response": ["Originally named \"Como Hill\", it was renamed Mount Alvernia after La Verna, the hill in Tuscany where St. Francis of Assisi received the Wounds of the Cross.\"The Hermitage on Mount Alvernia\" Retrieved 24 September 2011 The mountain was given its name by a Catholic priest, Monsignor John Hawes, also known as Fra Jerome, who built a hermitage there. Hawes was an Englishman who spent the last 17 years of his life in the Bahamas. He was a qualified architect before entering the church, and did a great deal of architectural work for the church throughout the Bahamas."]}, {"page": "Mullewa, Western Australia", "response": ["The architect priest Mgr John Hawes built the Church mainly with his own hands and the help of parishioners. Work started in 1921 and the stone and tile church was completed, after some interruptions, in 1927. The eclectic design of the Church shows some influence of Spanish Mission style. Hawes built a presbytery for himself next to the church and this, known as the Priesthouse, was finished in 1929: it's been used as a museum since 1980."]}, {"page": "Clarence Town", "response": ["Clarence Town is the capital of Long Island and has a population of 86 people as of 2010.LONG ISLAND POPULATION BY SETTLEMENT AND TOTAL NUMBER OF OCCUPIED DWELLINGS: 2010 CENSUS - Bahamas Department of Statistics It has a marina, two restaurants as well as the government dock where the mail boat docks on a weekly basis. It also has a small grocery store, gas station and a small pub as well as a police station, post office and community centre. There are two churches in Clarence Town, both designed by John Hawes, of similar appearance with their twin towers. One is Anglican/Episcopal, named St. Paul's Anglican Church. The other is Roman Catholic, named St. Peter and Paul."]}, {"page": "Utakarra, Western Australia", "response": ["The San Spirito Chapel was built in 1936. It was designed and decorated by Monsignor John Hawes. The chapel is located in the Utakarra cemetery."]}, {"page": "Monsignor John Hawes", "response": ["#REDIRECT John Hawes"]}, {"page": "John Hawes (Monsignor)", "response": ["#REDIRECT John Hawes"]}, {"page": "Hawes (surname)", "response": ["*Monsignor John Hawes, architect and priest "]}, {"page": "Melangata Station", "response": ["It is located  north of Yalgoo and  west of Mount Magnet in the Murchison area of the Mid West region of Western Australia. It was the only private property in Western Australia to have a John Hawes designed structure.", "The John Hawes designed homestead was built in 1917 and is constructed of stone with a corrugated iron roof. It consists of six bedrooms, a large living area, an unusual turret and a chapel with altar."]}, {"page": "Thomas H. Jones", "response": ["Born a slave, Jones grew up on the plantation of John Hawes near Wilmington, North Carolina. At the age of nine, Hawes sold him to Mr. Jones, a storekeeper in Washington, North Carolina located about 45 miles from Hawes' plantation. Jones reports in his autobiography that, \"Mr. Jones sent his slave driver, a colored man, named Abraham, to conduct me to my new home in Washington. I was at home with my mother when he came. He looked in at the door, and called to me, 'Tom, you must go with me.' His looks were ugly and his voice was savage. I was very much afraid, and began to cry, holding on to my mother's clothes and begging her to protect me, and not let the man take me away.\" Thomas H. Jones took his last name from Mr. Jones the storekeeper, for whom he worked as a house servant and then a store clerk. Jones obtained some education from Mr. Jones."]}, {"page": "Henry Edward George Rope", "response": ["Apart from his writings, his life was enriched by many friendships, which he nurtured with a wealth of correspondence.Shrewsbury Diocesan Yearbook, 1980 Apart from Benedict Williamson, on whom he wrote a two-part monograph,The Irish Monthly Vol. 82, No. 966 (Feb., 1954), pp. 62-67 and Vol. 83, No. 967 (Mar., 1954), pp. 108-112 he is associated with G.K.Chesterton, Hilaire Belloc,\"My Memory of Hilaire Belloc,\" The Irish Monthly, Vol. 81, No. 962, Oct. 1953‘Belloc 70: A Conference to Celebrate the Centenary of the Birth of Hilaire Belloc, ed.SCHROEDER, Louis, 1970, p.38 John Hawes\"The Hermit of Cat Island, The Life of Fra Jerome Hawes\" by Peter F. Anson, New York, P.F.Kenedy & Sons, 1957, pp.60, 112, 193) and many others.\"Father H.E.G.Rope: Witness for Continuity\" by Ronald Warwick in Christian Order, October 1978, pp. 452-455"]}, {"page": "St Francis Xavier's Cathedral, Geraldton", "response": ["Construction work on the cathedral began on 20 June 1916. The first phase ended with the construction of the nave and the twin towers, topped by two domes, and was completed in 1918.  The second phase involved the construction of the crypt, sanctuary and Sisters' Chapel  in 1926.  The third and final phase, the dome, the transepts and the sacristy were completed and formally opened on 28 August 1938. It is the largest and most imposing work of Priest and Architect John Hawes."]}, {"page": "Hawes, John", "response": ["#redirectJohn Hawes"]}, {"page": "Adolphus Lecaille", "response": ["In recognition of Lecaille's commitment and contribution to the Geraldton Diocese, on Friday 8 June 1936 the Bishop of Geraldton, James O'Collins, exhumed Lecaille's remains from the graveyard at St Joseph's Orphanage and transferred them to Geraldton to be interred in a new mortuary chapel of St Francis Xavier's Cathedral. This chapel was built under the supervision of Dean John Hawes as its architect. The Bishop directed that Holy Mass should be celebrated there once a month for the souls of those buried in the Catholic portion of the cemetery at Utakarra, then about  out of the city. The mortuary chapel is  on the interior. It is built of stone with a vaulted roof."]}]}}