{"wiki_id": "http://www.wikidata.org/entity/Q6235691", "itemLabel": "John Gooders", "itemDescription": "British writer (1937-2010)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Gooders", "wikipedia_page": {"main": "John Gooders (10 January 1937 – 18 May 2010) was a British writer who first came to prominence with his first book Where to Watch Birds. At the time he was a teacher, and a lecturer at Avery Hill College.", "link_mentions": [{"page": "Birdwatching", "response": ["Increased mobility of birdwatchers ensured that books like Where to Watch Birds by John Gooders became best-sellers.Moss 2004:233–234 By the 1960s air-travel became feasible and long distance holiday destinations opened up with the result that by 1965, Britain's first birding tour company, Ornitholidays was started by Lawrence Holloway.Moss 2004:234–235 Travelling far away also led to problems in name usage, British birds like \"wheatear\", \"heron\" and \"swallow\" needed adjectives to differentiate them in places where there were several related species.Moss 2004:250 The falling cost of air travel made flying to remote birding destinations a possibility for a large number of people towards the 1980s. The need for global guides to birds became more relevant and one of the biggest projects that began as the Handbook of the Birds of the World which started in the 1990s with Josep del Hoyo, Jordi Sargatal, David A. Christie, and ornithologist Andy Elliott.Moss 2004:252–253"]}, {"page": "Richard Mabey", "response": ["In the 1970s and 80s Mabey wrote and presented several television documentaries. He appeared in the 1975 BBC programme In Deepest Britain, with John Gooders and other naturalists, giving an unscripted narration of the wildlife observed during a country walk. He wrote and narrated the 1996 BBC television series Postcards from the Country, for whose eight, 40-minute episodes he was series producer, as well as being the producer-director on four. The book of the series Postcards from the Country: living memories of the British countryside (by Peter Marren and Mike Birkhead) includes a foreword by Mabey. He made a film for the BBC on Kew Gardens. His Unofficial Countryside and The Flowering of Britain were based on his books of the same names. White Rock, Black Water was a specially-written film about the limestone country of the Yorkshire Dales, and a Channel 4 eight-part series – Back to the Roots – explored the role of plants in Britain's contemporary culture . In the 1990s he often appeared on the BBC's Country File."]}, {"page": "2010 in science", "response": ["**John Gooders (b. 1937), birdwatcher and ornithology writer."]}, {"page": "2010 in the United Kingdom", "response": ["*18 May – John Gooders, ornithologist (b. 1937)"]}, {"page": "Deaths in May 2010", "response": ["*John Gooders, 73, British ornithologist."]}, {"page": "Terence Lambert", "response": ["* Collins British Birds. John Gooders and Terence Lambert. 249 colour and 65 black & white illustrations. 1982. Reprint 1987 and 1995 with a new dust wrapper.", "*Kingfisher Field Guide to the Birds of Britain and Ireland. John Gooders. Dustwrapper illustration of a nuthatch, (not attributed to artist). Kingfisher Books. Reprint 1994.", "*Kingfisher Field Guide to the Birds of Britain and Europe. John Gooders. Colour dustwrapper illustration. Different from 1st edition see 1990. Kingfisher Books. 1993.", "*Kingfisher Field Guide to the Birds of Britain and Europe. John Gooders. Colour dustwrapper, front and back. Kingfisher Books. 1990.", "*The Complete Birdwatchers Guide. John Gooders. 23 colour and 15 black & white illustrations. Kingfisher Books. 1988, reprinted 1989 and 1992.", "*Bird Watch. John Gooders (editor). Weekly magazine building into a 2-volume work. Marshall Cavendish. 1983.", "*1982-1995 Annual calendar with 12 colour plates from Collins British Birds by John Gooders."]}, {"page": "Alan Harris (illustrator)", "response": ["* John Gooders, A Field Guide to the Birds of Britain and Europe (1986)"]}, {"page": "Gooders, John", "response": ["#redirectJohn Gooders"]}]}}