{"wiki_id": "http://www.wikidata.org/entity/Q6239464", "itemLabel": "John Hodge", "itemDescription": "English footballer (born 1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hodge_(English_footballer)", "wikipedia_page": {"main": "John Hodge (born 1 April 1969) is an English former professional footballer who played as a tricky right winger.\nHe went on trial with Manchester United from November 1989 to December 1989. Whilst at Swansea he was a part of the team that won after a penalty shootout in the 1994 Football League Trophy Final. He joined Gillingham in July 1998.His only league goal was a second-half injury-time equaliser against Macclesfield on 3 October 1998. He was regarded as a 'supersub', coming off the substitute's bench to often devastating effect - including setting up Robert Taylor for a last-minute goal against Fulham on 28 November 1998, and Andy Thomson for a 100th-minute winner against Walsall in a FA Cup replay on 8 January 2000.\nHe was the only Gillingham player to successfully convert a penalty in their 3-1 penalty shoot-out defeat to Manchester City in the 1998/99 Division Two Play-off final. Hodge was signed by Kidderminster Harriers in January 2003.", "link_mentions": [{"page": "John Hodge", "response": ["John Hodge may refer to:", "*John Hodge (politician) (1855–1937), British politician", "*John Hodge (engineer) (1929–2021), British-born aerospace engineer", "*John Hodge (screenwriter) (born 1964), British screenwriter", "*John Hodge (English footballer) (born 1969), English footballer", "*John Hodge (Scottish footballer), played for Manchester United and Stenhousemuir", "*John Hodge (police commissioner), colonial police officer in Nigeria", "*John Hodges (disambiguation)"]}, {"page": "Russell Coughlin", "response": ["Coughlin joined his hometown club, Swansea City, for the 1990–91 season, and went on to make 101 league appearances for the Welshmen, before leaving for Exeter City in 1993, in part-exchange for John Hodge."]}, {"page": "1999 Football League Second Division play-off Final", "response": ["Horlock scored the opening penalty for Manchester City before Weaver saved Smith's spot kick.  Dickov missed his penalty after it struck both posts, but Adrian Pennock then missed for Gillingham.  Cooke made it 2–0 to City before John Hodge scored for Gillingham. Richard Edghill scored for City to make the score 3–1, meaning that City would win if Guy Butters failed to score with Gillingham's fourth penalty.  Weaver saved the defender's kick to give Manchester City victory and secure promotion to the First Division.", "|MF ||12||John Hodge || || "]}, {"page": "1994 Football League Trophy Final", "response": ["| ||11||John Hodge || "]}, {"page": "List of Swansea City A.F.C. records and statistics", "response": ["|John Hodge"]}, {"page": "PFA Team of the Year (1990s)", "response": ["!scope=row|John Hodge"]}, {"page": "1999–2000 Northampton Town F.C. season", "response": ["|14||John Hodge||W||||Ormskirk||||8||0||Gillingham||6 March 2000||£25,000", "| 14 || RM || style=\"text-align:left;\" |  John Hodge", "| 6 March 2000 || RM ||  || John Hodge || Gillingham || £25,000 ||"]}, {"page": "2000–01 Northampton Town F.C. season", "response": ["| 14 || RM || style=\"text-align:left;\" |  John Hodge"]}, {"page": "2001–02 Northampton Town F.C. season", "response": ["| 14 || RM || style=\"text-align:left;\" |  John Hodge"]}]}}