{"wiki_id": "http://www.wikidata.org/entity/Q6239219", "itemLabel": "Martin White", "itemDescription": "Scottish politician (1858-1928)", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_White_(politician)", "wikipedia_page": {"main": "James Martin White (usually known to as Martin White or  J. Martin White) (1858 – 7 July 1928) was a wealthy Scottish businessman and Liberal Party politician. He also took a keen interest in the establishment of the scientific study of sociology in association with his boyhood friend Patrick Geddes and was an enthusiastic supporter of the development of the pipe organ.\nWhite was born in New York City, the son of wealthy jute merchant James Farquhar White and his wife Elizabeth Grundy.  White Sr. had, in 1849, established a 'dry goods' company, J F White & Co. in New York selling a variety of imported and domestic textiles. However, with the onset of the American Civil War he had returned home to Scotland and leased Castle Huntly, Perthshire as the family home. In 1880 they bought and moved to a baronial castle at Balruddery, Angus, near the city of Dundee. He ran his family business from Dundee and New York, but took a back seat to pursue political and scientific interests.\nJ Martin White studied engineering at Cassel in Germany and was very interested in the technological innovations of his time, becoming chairman of the Dundee Technical Institute. He was a keen photographer and had his own darkroom from the late 1870s.  In April 1881 he and his father, James F White, installed electricity at their house, Balruddery by Longforgan, outside Dundee. They generated the electricity with a Siemens SDJ Shuntwound 50-volt dynamo driven by a turbine on a stream on the estate and thus established probably the first domestic generating plant in Scotland and the second, after Cragside, in Britain.  \nMartin White was also a collector and connoisseur of Japanese art.", "link_mentions": [{"page": "James White", "response": ["* James Martin White (politician) (1857–1928), businessman and Member of Parliament for Forfar", "* James Martin White, (1858-1928), Scottish politician"]}, {"page": "Forfarshire (UK Parliament constituency)", "response": ["|  Martin White"]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["| Martin White", "*30 January: Forfarshire - Capt John Sinclair, Liberal, replacing Martin White"]}, {"page": "Hill of Tarvit", "response": ["Beatrice White, Frederick's wife, was born in 1864 at Castle Huntly in Longforgan, the fifth child of James Farquhar White, who had amassed a fortune trading with America in jute, linen and other 'dry goods'.USA Financial Review 24 August 18897  She married Fred in 1896 - her older sister, Eleanor having married Fred's oldest brother, John Sharp in 1886. Beatrice's oldest brother was the liberal MP, J Martin White, who with his father had installed electricity at their house, Balruddery, in 1881, possibly the first house in Scotland and second in Britain after Cragside to have a domestic electrical generating plantThe Electrician, 22 Jan 1886 (though Lord Kelvin at Largs had installed electricity earlier using batteries). Beatrice was thus well-equipped to partner Frederick in the modernisation of Hill of Tarvit and her house-keeping and hospitality were always considered exemplary."]}, {"page": "1894 Forfarshire by-election", "response": ["The Liberals chose Henry Robson to defend the seat.  Robson, although Scottish born, had made his living as a stockbroker in London.  The choice of the \"stranger\", Robson, rather than the popular Dundee merchant, Martin White, was resented locally. The Unionists, by contrast, chose a local landowner, the Honorable Charles Maule Ramsay. Ramsay was the younger brother of the late Earl of Dalhousie, who had sat as a Liberal MP for Liverpool.", "The Unionist victory was short-lived, however. At the general election held in the following year, the Liberals learned from their mistakes. The preferred local candidate, Martin White, was this time selected, and the seat regained by the party."]}, {"page": "Charles Maule Ramsay", "response": ["He returned to Scotland where he became an officer in the Forfarshire and Kincardineshire Artillery Militia. He was a major landlord in the area having inherited a large estate in Forfarshire. In 1894, he was chosen as Liberal Unionist candidate to contest a parliamentary by-election in Forfarshire in November 1894. The vacancy was caused when the sitting Liberal MP, Sir John Rigby was appointed a Lord Justice of Appeal. The Liberals had chosen a London-based stockbroker as their candidate in preference to a local businessman, Martin White, a decision that led to many voters switching their allegiance to Ramsay, who gained the seat. He held the seat for only a few months, as he was defeated by White at the subsequent general election in 1895."]}, {"page": "James Martin White", "response": ["#REDIRECT Martin White (politician) "]}, {"page": "Martin White", "response": ["Martin White may refer to:", "* Martin White (politician) (1857–1928), Scottish businessman and Liberal Member of Parliament", "* Martin White (comedian) (fl. 2000s–2010s), English musician, comedian and animator", "* Max Martin (born 1971), Swedish music producer and songwriter known for a time as Martin White", "* Martin White (hurler) (1909–2011), Irish hurler", "* Martin White (astronomer), 2011 Guggenheim Fellowship recipient", "* Martin White (director) (born 1939), pseudonym of the Italian film director Mario Bianchi", "* Martin White (British Army officer) (born 1944)", "* Martin White (Royal Navy officer) (1779–1865), Royal Navy admiral and hydrologist", "*Minor White (Minor Martin White, 1908–1976), American photographer"]}, {"page": "J. Martin White", "response": ["#REDIRECT Martin White (politician)"]}, {"page": "Arthur Fell", "response": ["An election petition was lodged against the result by the defeated Liberal Party candidate Martin White,"]}, {"page": "James Graeme (poet)", "response": ["In 1767 he went to the University of Edinburgh, where he studied for three years. His friend and biographer, Robert Anderson (1750–1830), says that he excelled in classical learning, and made a special study of metaphysics, besides reading widely in general literature. In 1769 he was presented to a bursary at the University of St Andrews, but soon resigned it, and, returning to Edinburgh next year, entered the theological class. In 1771 he became tutor to the sons of Major Martin White of Milton, near Lanark. He died of tuberculosis at Carnwath on 26 July 1772."]}, {"page": "Robert Cox (Scottish politician)", "response": ["Cox did not contest the 1892 general election but in June 1895 the Unionist Association of the East Edinburgh division approached him as a possible candidate.The Times, 26 June 1895 p10 The Liberal MP for the seat, Robert Wallace was reported to have fallen foul of his local Liberal Association on the issue of Irish Home Rule and they had selected a Mr J Martin White to fight the seat instead. It was thought possible that Wallace would stand as an independent and create a three-cornered contest.The Times, 26 June 1895 p10 In the end Wallace and the East Edinburgh Liberals must have mended their fences as Wallace stood again as a Liberal at the 1895 general electionF W S Craig, British Parliamentary Election Results 1885–1918;Macmillan, 1974 p498 and White successfully contested Fofarshire in the Liberal interest.F W S Craig, British Parliamentary Election Results 1885–1918;Macmillan, 1974 p541"]}, {"page": "List of UK Parliamentary election petitions", "response": ["| 1906 || Great Yarmouth || Martin White || Arthur Fell || Bribery, etc. || Duly elected || A man named Baker drove voters to the polls in a cart which had been lent to Fell for polling day. He gave each voter between two and five shillings. When one of Fell's campaign workers was told about it, he challenged Baker, who denied doing so; Baker was allowed to continue using the cart. The Judges disagreed on whether Baker was an agent of Fell for the purposes of election law; they needed to agree to avoid the election. An almanac distributed by Fell on Christmas Day was not returnable as an election expense. Meetings and smoking concerts organised by Fell's local association from 1904, at which free drink was distributed, were not election expenses and did not constitute corrupt treating. A party for the retiring MP for the seat openly advertised in local newspapers where some whisky was given was not corrupt treating. || 5 O'M & H 176; HCP 1906 169"]}, {"page": "Victor Branford", "response": ["Victor Branford's involvement in sociology came about through his collaboration with Patrick Geddes in a series of summer schools held in Edinburgh from 1892 to 1895 and associated with his work at the Outlook Tower.Scott, John 2007 The Edinburgh School of Sociology Journal of Scottish Thought 1, 1. With Geddes, Branford first sought to establish a Geographical Institute, but soon recast this as an Edinburgh School of Sociology. As both became more involved in business and intellectual activities in London, they proposed the establishment of a Sociological Society in 1903, drawing on finance from Geddes's friend and supporter the Scottish politician Martin White. The Society brought together the regional and civic interests of Geddes with supporters of Eugenics and a diverse array of social scientists, philosophers, and politicians. It led to the publication of the Sociological Review and the production of series of pamphlets and books.Scott, John and Husbands, Christopher T. 2007. Victor Branford and the Building of British sociology. Sociological Review 55, 3: 460–85"]}, {"page": "Balruddery", "response": ["Balruddery House by Longforgan in Perthshire, Scotland, was designed by David Neave for James Webster circa 1820. In about 1879 it was bought by James F White, who had previously leased Castle Huntly in Longforgan.  James White and his son J Martin White had the house extensively remodelled and modernised by Charle Edward and Thomas Saunders Robertson and the White family moved in circa 1881.  J Martin White was very interested in the technologies of the day and electricity was installed in the house by April 1881, powered by a generator run off a stream on the estate, possibly the first domestic generating plant in Scotland.The Electrician, 22 Jan 1886  Until at least 1960, electricity was still provided by a turbine and generator on the Mill Dam at Balruddery Home Farm.Correspondence of Messrs Sheill & Small, Solicitors, Dundee, 20 October 1960, re. the sale of Balruddery to Eagle Star Insurance Company", "In 1886 a fire destroyed much of the houseDundee Advertiser 27 June 1886 and it was rebuilt by Sidney Mitchell for Martin White, his father having died in 1884. Martin was very interested in the organ and had an electronic organ by Robert Hope-Jones installed in the central hall of the new house, making the house nearly impossible to heat effectively.", "The main gardens contained three ponds, one ornamental, one for swimming and one for curling.  The Balruddery Curling Club founded there is still in existence.  A large Japanese stone lantern, brought back by Martin White from his honeymoon to Japan in 1898,  remained standing after the destruction of the house for over 20 years, until it was acquired by Durham University Oriental Museum in 1985.  "]}]}}