{"wiki_id": "http://www.wikidata.org/entity/Q6235026", "itemLabel": "John Gayle", "itemDescription": "professional footballer (born 1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Gayle_(footballer)", "wikipedia_page": {"main": "John Gayle (born 30 July 1964) is an English former professional footballer who played as a striker for Wimbledon, Birmingham City, Walsall, Coventry City, Burnley, Stoke City, Gillingham, Northampton Town, Scunthorpe United, Shrewsbury Town and Torquay United.", "link_mentions": [{"page": "Newton Abbot A.F.C.", "response": ["Newton Abbot F.C. was a football club based in Newton Abbot, Devon, England. They were established in 1964. In the 2005–06 season, they reached the Second Round of the FA Vase.Newton Abbot on the Football Club History DatabaseNewton Abbot Dynamoes on the Football Club History Database For the 2008–09 season, they were members of the South West Peninsula League Premier Division, but were expelled from the league mid-season after failing to fulfil two fixtures. In their last season, they were managed by ex-professional footballer John Gayle."]}, {"page": "Ian Clarkson", "response": ["At Northampton, he linked up with former Birmingham City teammates John Gayle, Dean Peer and manager Ian Atkins, soon to be joined by John Frain. In his first season, he helped them to promotion via the play-offs, and the next year played in the Second Division play-off final, but lost 1–0 to Grimsby Town. In August 1998, he suffered a badly broken tibia in a match against Lincoln City. Though he made a couple of appearances for Northampton at the start of the 1999–2000 season, it appeared that he was no longer fit enough to compete at that level, and that his league career was over at the age of 28."]}, {"page": "John Gayle", "response": ["John Gayle may refer to:", "* John Gayle (Alabama politician) (1792–1859), governor of Alabama (1831–1835)", "* John Gayle (footballer) (born 1964), English football (soccer) player"]}, {"page": "Nicky Spooner", "response": ["He joined Bolton Wanderers in 1987 after signing YTS forms. His senior career with the club was marred by injury. In October 1994 he suffered a broken leg in a match against Burnley following a tackle by John Gayle, and he never played first-team football for the club again. He finally left Bolton in 1999 and moved to the US, spending a year with Charleston Battery before returning to England to play non-league football for the final years of his playing career."]}, {"page": "1997 Football League Third Division play-off Final", "response": ["In their play-off semi-final, Northampton Town faced Cardiff City, with the first match of the two-legged tie taking place at Ninian Park in Cardiff on 11 May 1997. After a goalless first half, Northampton Town were reduced to ten players when Mark Cooper was sent off for violent conduct with 20 minutes of the match remaining.  Seven minutes later, Sean Parrish scored with a lob from the edge of the Cardiff City penalty area to give Northampton Town a 1–0 victory. The second leg was held at Sixfields Stadium in Northampton three days later. Ian Sampson put Northampton Town ahead midway through the first half with a header and three minutes later, Cardiff's Jeff Eckhardt was sent off for the use of an elbow.  Jason Fowler scored for Cardiff in the 36th minute before goals from Ray Warburton and John Gayle made it 3–1.  Simon Haworth scored a late goal for Cardiff but the match ended 3–2 to Northampton Town who progressed to the final with a 4–2 aggregate victory.", "|FW ||9||John Gayle ||  "]}, {"page": "1994–95 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| John Gayle"]}, {"page": "1995–96 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| John Gayle"]}, {"page": "1996–97 Stoke City F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| John Gayle"]}, {"page": "1994–95 Burnley F.C. season", "response": ["||FW|| John Gayle || Coventry City || £70k || 17 August 1994", "||FW|| John Gayle || Stoke City || £70k || 23 January 1995"]}, {"page": "1991 Associate Members' Cup Final", "response": ["The 1991 Associate Members' Cup Final, known as the Leyland DAF Cup for sponsorship reasons, was the 8th final of the domestic football cup competition for teams from the Third Division and Fourth Division. The final was played at Wembley Stadium, London on 26 May 1991, and was contested by Birmingham City and Tranmere Rovers. Birmingham won the match 3–2, with Simon Sturridge and John Gayle scoring the goals for the winning team.", "| FW || 8 || John Gayle"]}, {"page": "1995–96 Gillingham F.C. season", "response": ["On 9 March, first-placed Gillingham drew 1–1 at home to second-placed Preston; the crowd of 10,595 was the largest attendance of the season at Priestfield Stadium.  During the following week, with the team having only scored one goal in five games, Pulis bolstered his attacking options by signing striker John Gayle on loan from Stoke City.  Gayle scored the only goal on his debut in a 1–0 victory over Mansfield Town and scored again a week later in a 1–1 draw with Leyton Orient.  The next game resulted in a 2–0 defeat to Rochdale, after which Gillingham fell to second place in the table and were overtaken by Preston, who would go on to remain atop the division for the rest of the season.  On 6 April, Gillingham beat Hartlepool United 2–0.  It was the 25th game of the season in which Stannard had kept a clean sheet, breaking the previous club record set by John Simpson in the 1963–64 season."]}, {"page": "1992–93 Birmingham City F.C. season", "response": ["!scope=\"row\"| John Gayle"]}, {"page": "1991–92 Birmingham City F.C. season", "response": ["!scope=\"row\"| John Gayle"]}, {"page": "1990–91 Birmingham City F.C. season", "response": ["The 1990–91 Football League season was Birmingham City Football Club's 88th in the Football League and their second in the Third Division. They finished in 12th position in the 24-team division. They entered the 1990–91 FA Cup in the first round proper and lost to Brentford in the second, and entered at and lost in the first round of the League Cup, beaten over two legs by AFC Bournemouth. They won the Associate Members' Cup, a cup competition open to clubs in the third and fourth tiers of the English football league system, defeating Tranmere Rovers 3–2 in the final at Wembley Stadium with goals from Simon Sturridge and two from John Gayle.", "!scope=\"row\"| John Gayle"]}, {"page": "List of Birmingham City F.C. players (25–99 appearances)", "response": ["Other players took part in significant matches in the history of the club. Harry Morris and Eddy Stanley appeared in every match as Small Heath Alliance progressed through six rounds to the semi-final of the 1885–86 FA Cup. Tom Bayley, George Short and Fred Speller appeared in Small Heath's first Football League match in 1892. In more recent times, John Gayle scored the winning goal as Birmingham beat Tranmere Rovers in the 1991 Football League Trophy Final. The 18-year-old Darren Carter converted the decisive penalty in the 2002 play-off final shootout by which Birmingham were promoted to the Premier League for the first time; goalkeeper Nico Vaesen saved one of the opponents' spot-kicks. The Birmingham team that won the 2011 League Cup featured five men listed here, including Ben Foster, who won the man of the match award. Teenagers Nathan Redmond and Chris Wood scored two of the three goals that took Birmingham through to the group stage of the Europa League in the club's first season in European competition for 50 years."]}, {"page": "1994–95 Coventry City F.C. season", "response": ["|John Gayle"]}, {"page": "James Alabi", "response": ["Alabi was born in London Borough of Southwark and began his career with Stoke City playing for the club's academy in 2010–11 before moving to Scottish club Celtic. After a season at Lennoxtown he moved back to Stoke City for the 2012–13 season. On 21 February 2013 he joined League One side Scunthorpe United on loan for a month. After seeing him in training Irons manager Brian Laws compared him as a 'technically better' version of John Gayle, who Laws believes was one of his best signings in his first spell at Scunthorpe. He made his professional debut on 23 February against Hartlepool United at Glanford Park, scoring 10 minutes after coming on as a 67th-minute substitute. On 26 March 2013 his loan spell at Scunthorpe was extended until the end of the 2012–13 season. He remained at Glanford Park for the remainder of the season, playing in nine matches as they failed to avoid relegation."]}, {"page": "1998 Football League Second Division play-off Final", "response": ["Northampton's opponents for their play-off semi-final were Bristol Rovers and the first match of the two-legged tie took place at the Memorial Ground in Bristol on 10 May 1998. Half an hour in, Peter Beadle scored with a penalty kick  after being fouled by Ian Sampson, to give the home side the lead.  Frankie Bennett then headed in a corner from Gary Penrice to double Bristol Rovers' lead seven minutes later.  Barry Hayles then made it 3–0 after dribbling past two defenders before scoring from inside the Northampton penalty area.  John Gayle scored for the visitors in the 74th minute and the match ended 3–1 to Bristol Rovers.  The second leg was held three days later at Sixfields in Northampton.  Carl Heggs put the home side ahead in the 34th minute after heading in Chris Freestone's pass back from John Frain's corner.  Ian Clarkson then scored from a Heggs pass in the 61st minute to level the tie on aggregate.  Bristol Rovers then pressed to regain the lead but Ray Warburton headed in James Hunt's corner to give Northampton a 3–0 lead in the match and a 4–3 aggregate victory to progress to the final.", "|FW ||||John Gayle|| || "]}, {"page": "Gayle (surname)", "response": ["*John Gayle (Alabama politician) (1792–1859), Governor of US state of Alabama", "*John Gayle (footballer) (born 1964), English footballer"]}, {"page": "1990–91 Wimbledon F.C. season", "response": ["|John Gayle"]}, {"page": "1999 Football League Third Division play-off Final", "response": ["|FW || 10||John Gayle  "]}, {"page": "1997–98 Northampton Town F.C. season", "response": ["|John Gayle||FW||||Bromsgrove||||44||7||Stoke City||10 February 1997||£25,000", "| FW || style=\"text-align:left;\" |  John Gayle"]}, {"page": "1996–97 Northampton Town F.C. season", "response": ["|John Gayle||FW||||Bromsgrove||||44||7||Stoke City||10 February 1997||£25,000", "| FW || style=\"text-align:left;\" |  John Gayle"]}]}}