{"wiki_id": "http://www.wikidata.org/entity/Q6236550", "itemLabel": "John Guille Millais", "itemDescription": "English artist, naturalist, gardener, travel writer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Guille_Millais", "wikipedia_page": {"main": "John Guille Millais ( MIL-ay, also US:  mil-AY; 24 March 1865 – 24 March 1931) was a British artist, naturalist, gardener and travel writer who specialised in wildlife and flower portraiture. He travelled extensively around the world in the late Victorian period detailing wildlife often for the first time. He is noted for illustrations that are of a particularly exact nature.", "link_mentions": [{"page": "Effie Gray", "response": ["In 1855, she married John Millais and they had eight children together: Everett, born in 1856; George, born in 1857; Effie, born in 1858; Mary, born in 1860; Alice, born in 1862; Geoffrey, born in 1863; John in 1865; and Sophie in 1868. Their youngest son, John Guille Millais, was a notable bird artist and gardener. Effie also modelled for a number of her husband's works, notably Peace Concluded (1856), which idealises her as an icon of beauty and fertility. In 1885, her husband was elevated to the baronetage by Queen Victoria, having been created Baronet Millais of Palace Gate, in the parish of St Mary Abbot, Kensington, in the county of Middlesex, and of Saint Ouen, in the Island of Jersey. Upon her husband's creation to the baronetage, Effie became entitled to be Lady Millais."]}, {"page": "John Everett Millais", "response": ["In 1855, after her marriage to Ruskin was annulled, Effie and John Millais married. He and Effie eventually had eight children: Everett, born in 1856; George, born in 1857; Effie, born in 1858; Mary, born in 1860; Alice, born in 1862; Geoffroy, born in 1863; John in 1865; and Sophie in 1868. Their youngest son, John Guille Millais, became a naturalist, wildlife artist, and Millais's posthumous biographer. Their daughter Alice (1862-1936), later Alice Stuart-Worsley after she married Charles Stuart-Worsley, was a close friend and muse of the composer Edward Elgar, and is thought to have been an inspiration for themes in his Violin Concerto.Kennedy, Michael (1984). Liner notes to EMI CD CD-EMX-2058"]}, {"page": "List of British painters", "response": ["*John Guille Millais (1865–1931)"]}, {"page": "Common minke whale", "response": ["The origins of the species' common name are obscure. One of the first references to the name came in Henrik Johan Bull's account of his 1893–95 voyage to the Antarctic, when he mentioned catching a small whale \"called in the Arctic language a Mencke whale, after a German who accompanied Mr. Foyn on some of his voyages.\"Bull, H. J. (1896). The cruise of the 'Antarctic' to the South Polar regions. London: Edward Arnold. According to the British writer John Guille Millais (The mammals of Great Britain and Ireland, 1906, vol. 3, p. 279), \"Minkie was a Norwegian seaman who was always calling 'Hval' at whatever backfin he saw. He is now regarded as the type of the 'tenderfoot' at sea. Norwegians often refer to any small whale with some contempt or amusement as a 'Minkie' or 'Minkie's hval'.\"Allen, G. M. (1916). The whalebone whales of New England. Boston. The American marine biologist and painter Richard Ellis, citing the Norwegian scientist Age Jonsgård, stated \"that Meincke was a German laborer working for Svend Foyn, inventor of the grenade harpoon. Meincke 'one day mistook a school of this whale species for blue whales.... most probably he made this mistake during Foyn's whaling operations in the Varanger Fjord between 1868 and 1885.\"Ellis, Richard. 1980. The Book of Whales. Alfred Knopf, New York."]}, {"page": "Millais", "response": ["*John Guille Millais (1865–1931), British artist, naturalist, gardener and travel writer"]}, {"page": "Frederick Selous", "response": ["In 1909, Selous co-founded the Shikar Club, a big-game hunters' association, with two other British Army Captains, Charles Edward Radclyffe and P. B. Vanderbyl, and regularly met at the Savoy Hotel in London. The association's president was The 5th Earl of Lonsdale; another founding member included the artist, explorer, and Selous biographer John Guille Millais.Callum McKenzie, The British Big-Game Hunting Tradition, Masculinity and Fraternalism with Reference to ‘The Shikar Club’ (University of Strathclyde)", "* The life of Frederick Courtenay Selous, D.S.O. by John Guille Millais (London, 1919)"]}, {"page": "Archibald Thorburn", "response": ["Archibald was born at Viewfield House, Lasswade, Midlothian, the fifth son of Robert Thorburn (1818–1885), portrait miniaturist to Queen Victoria. His first education was at Dalkeith and in Edinburgh, after which he was sent to the newly founded St John's Wood School of Art in London. His stay there was only brief, since on the death of his father he sought the guidance of Joseph Wolf. It was his commission in 1887 to illustrate Lord Lilford's Coloured Figures of the Birds of the British Isles, for which he painted some 268 watercolours, that established his reputation. He illustrated numerous sporting and natural history books, including his own. He taught Otto Murray Dixon and Philip Rickman (both in Nature in Art's collection), and he encouraged the young Donald Watson when he came to visit him in Dumfries and Galloway. Thorburn was friends of other eminent bird illustrators including George Edward Lodge and John Guille Millais with whom he collaborated on a number of works including: Natural History of British Feeding Ducks; British Diving Ducks and British Game Birds."]}, {"page": "Noel Jeddore", "response": ["Miawpukek was a summer camp until Jeannot Pequidalouet - the eastern Mi'kmaq chief of Cape Breton, who had previously overwintered in Newfoundland - began to create a permanent settlement in Miawpukek from in the 1760s. In his MA thesis Butler citing Jackson described how under the leadership of Jeddore, the Mi’kmaq in the Bay D’Espoir \"lived in greater isolation and so were able both to retain their language well into the twentieth century and to continue their traditional practices of living as hunter-gatherers and commercial trappers.\" Jackson described how, the \"uninhabited wilderness of the southern interior offered an abundant variety of small game: fox, muskrat and beaver. Thousands of woodland caribou roamed the bush and barrens.\" Prior to the early nineteenth century Mi'kmaq lived a nomadic life moving in cycles and seasons between Newfoundland and Cape Breton. In the late eighteenth or early nineteenth century they made a transition to semi-sedentary life as hunter-gatherers living \"on the country\" on Newfoundland itself in permanent communities lime St. George's Bay and Miawpukek in Bay d'Espoir.Anger, Dorothy. 1988. Noywa'mkisk (Where the Sand Blows ...). Vignettes of Bay St. George Micmacs. Bay St. George Regional Band Council, Port au Port East, Newfoundland. issn 0316-5981 In a 1907 publication Newfoundland and It's Untrodden Ways by John Guille Millais' (1865 – 1931) the author included his favourable observations of the Jeddore family and other Conne River Mi'kmaq during his visits to Newfoundland in \"two short hunting seasons in 1905-1906.\" Like William Cormack who had undertaken an expedition in 1822 to the interior of Newfoundland with his Mi'kmaq guide Joseph Sylvester, a young Mi'kmaq hunter from Miawpukek, Bay d'Espoir, he provided details on the lives of the Newfoundland Mi'kmaq."]}, {"page": "Horsham", "response": ["* John Guille Millais (1865–1931), painter, naturalist and author, son of the Pre-Raphaelite painter John Everett Millais.John Guille Millais obituary in Geographical Journal Vol 77 6 June 1931", "* Raoul Millais (1901–1999), artist, son of John Guille Millais.The Independent Obituary of Raoul Millais 23 November 2008"]}, {"page": "Raoul Millais", "response": ["Hesketh Raoul Lejarderay Millais (1901–1999), usually known as Raoul or 'Liony' Millais was a portrait painter, equestrian artist and sportsman. He was the grandson of Sir John Everett Millais and the son of John Guille Millais and from them he inherited both his artistic talent and his love of animals and of hunting."]}, {"page": "Zimbabwean art", "response": ["As for travelers to the area during the Victorian period, they used art, especially painting, to depict some of what they saw there. This art of the colonial period took landscape as its main theme and many of the European artists were present as part of expeditions that aimed to inform the public in Europe about life in Africa. For example, Thomas Baines joined the Zambezi expedition led by David Livingstone in 1858 and in 1861 he was one of the first to make oil paintings of Victoria Falls. John Guille Millais spent six months of 1893 sketching and hunting in Zimbabwe.Winter-Irving C. (1991) \"Visual Arts since the Nineteenth Century\", Chapter 9 in \"Stone Sculpture in Zimbabwe\", Roblaw Publishers, Harare, "]}, {"page": "Horsham Museum", "response": ["The Horsham Museum owns a number of prints by local artist John Guille Millais (1865–1931). They also have a significant sculpture by Millais of fighting game birds that is now on permanent display "]}, {"page": "Animal painter", "response": ["* John Guille Millais (1865-1931)"]}, {"page": "Hugh Millais", "response": ["Hugh Millais was the son of Raoul Millais (1901–1999) a painter-illustrator of some considerable importance, and his first wife Elinor Clare (d. 1953), daughter of late Allan Ronald Macdonell, of Montreal. Raoul was the son of painter and gardener John Guille Millais and the grandson of the painter Sir John Everett Millais founder of the pre-Raphaelite movement by his wife Effie Gray who had been previously married to the author John Ruskin. He was brought up Roman Catholic. As a child he lived in Blackwater Valley and Cork in Ireland. He was educated at Ampleforth during the war, and made a deal with his housemaster. If let off games and allowed to keep his two ferrets and 24 snares, he would keep the house provided with meat. On his best day he provided 21 rabbits and a cock pheasant. Legend has it that Basil Hume tried to teach him to play rugby.http://jennydavidson.blogspot.com/2009/07/les-deplorables-hugh-millaiss-greatest.html"]}]}}