{"wiki_id": "http://www.wikidata.org/entity/Q6234771", "itemLabel": "John Galsworthy", "itemDescription": "British diplomat and ambassador to Mexico", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Galsworthy_(diplomat)", "wikipedia_page": {"main": "Sir John Edgar Galsworthy  (19 June 1919 – 18 May 1992) was a British diplomat, ambassador to Mexico 1972–1977, and counsellor to the UK delegation to the EEC. He was knighted KCVO in 1975 on the occasion of the Queen's state visit to Mexico.He was educated at Emanuel School and Corpus Christi College, Cambridge, and served in World War II in the Duke of Cornwall's Light Infantry.Galsworthy's brother, Sir Arthur Galsworthy KCVO, was the Governor of the Pitcairn Islands and High Commissioner to New Zealand from 1970 to 1973. In 1973, he was appointed Ambassador to the Republic of Ireland, where he served from 1973 to 1976. Arthur Galsworthy is the father of the diplomat Sir Anthony Galsworthy.", "link_mentions": [{"page": "John Galsworthy", "response": ["John Galsworthy  (; 14 August 1867 – 31 January 1933) was an English novelist and playwright. Notable works include The Forsyte Saga (1906–1921) and its sequels, A Modern Comedy and End of the Chapter. He won the Nobel Prize in Literature in 1932.", "From the Four Winds, a collection of short stories, was Galsworthy's first published work in 1897. These and several subsequent works were published under the pen name of John Sinjohn, and it was not until The Island Pharisees (1904) that he began publishing under his own name, probably owing to the recent death of his father. His first full-length novel, Jocelyn, was published in an edition of 750 under the name of John Sinjohn—he later refused to have it republished. His first play, The Silver Box (1906),—in which the theft of a prostitute's purse by a rich 'young man of good family' is placed beside the theft of a silver cigarette case from the rich man's father's house by 'a poor devil', with very different repercussions,Description of the plot from  John Galsworthy, by George Orwell, Monde   23 March 1929 though justice was clearly done in each case—became a success, and he followed it up with The Man of Property (1906), the first book of a Forsyte trilogy. Although he continued writing both plays and novels, it was as a playwright that he was mainly appreciated at the time. Along with those of other writers of the period, such as George Bernard Shaw, his plays addressed the class system and other social issues, two of the best known being Strife (1909) and The Skin Game (1920).", "thumb|John Galsworthy", "Galsworthy opposed the slaughter of animals and fought for animal rights.Sternlicht, Sanford. (1987). John Galsworthy. Twayne Publishers. p. 21.  He was also a humanitarianDurey, Jill Felicity. (2019). John Galsworthy (1867–1933) and Animal Welfare. Minnesota Review 92: 95-110. and a member of the Humanitarian League.Wilson, David A. H. (2015). The Welfare of Performing Animals: A Historical Perspective. Springer. pp. 30-31.  He opposed hunting and supported the League for the Prohibition of Cruel Sports.Tichelar, Michael. (2017). The History of Opposition to Blood Sports in Twentieth Century England. Routledge. p. 131. ", "A number of John Galsworthy's letters and papers are held at the University of Birmingham Special Collections.", "* Caravan: The Assembled Tales of John Galsworthy, New York: Charles Scribner's Sons 1925", "* Letters from John Galsworthy 1900–1932, 1970", "* Plays by John Galsworthy on Great War Theatre", "* John Galsworthy at Oxford Dictionary of National Biography", "* John Galsworthy letters. Available online through Lehigh University's I Remain: A Digital Archive of Letters, Manuscripts, and Ephemera.", "* The Papers of John Galsworthy at Dartmouth College Library"]}, {"page": "List of ambassadors of the United Kingdom to Mexico", "response": ["*1972–1977: Sir John Galsworthy"]}, {"page": "John Edgar Galsworthy", "response": ["#REDIRECTJohn Galsworthy (diplomat)"]}, {"page": "Sir John Edgar Galsworthy", "response": ["#REDIRECTJohn Galsworthy (diplomat)"]}, {"page": "Galsworthy (surname)", "response": ["* John Galsworthy (1867–1933), English novelist and playwright", "* John Galsworthy (diplomat) (1919–1992), British diplomat"]}]}}