{"wiki_id": "http://www.wikidata.org/entity/Q6238219", "itemLabel": "John Hatchell", "itemDescription": "Irish Member of UK Parliament and Attorney General for Ireland", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hatchell", "wikipedia_page": {"main": "John Hatchell PC (1788–1870) was an Irish lawyer and politician.\nHe was born in County Wexford, Ireland, to an old established family, the son of Henry Hatchell of Wexford  and Mary Lambert. He was educated at the University of Dublin where he took his degree of Bachelor of Arts in 1807 and Master of Arts in 1810. He lived at Fortfield House, Terenure, County Dublin, and Kingsland, Co. Wexford.He was called to the Irish Bar in 1809 and became King's Counsel in 1833. He was appointed Solicitor-General for Ireland in 1847, and Attorney-General for Ireland in 1850, resigning in 1852. He was elected Member of Parliament (MP) for Windsor in 1850. He was a Commissioner of the Insolvent Debtors Court and a Commissioner for National Education.As a politician he was praised for his \"zealous advocacy of civil and religious liberty\" and his commitment to entrenchment and economy in every department of state. Rather surprisingly, he never became a judge. He married Elizabeth Waddy, daughter of Richard Waddy  of Clougheast Castle, County Wexford, a member of a prominent local  family,  who were descended from  Cromwellian  settlers, and his wife Penelope Hatchell, daughter of Nicholas Hatchell.  Elizabeth died in 1848. Cadwallader Waddy, the  soldier and \npolitician, was her brother. They had three children, John, Mary,  and Penelope. Mary was the second wife of  Sir Maziere Brady, Lord Chancellor of Ireland. Penelope  married John Perrin,  one \nof  the  many  sons of the eminent High Court judge Louis Perrin; they were  the \nparents  of the well-known artist  Mary Perrin.  They lived with   her parents  at Fortfield House, which was demolished in 1934. The younger  John Hatchell was MP for County Wexford.", "link_mentions": [{"page": "Terenure", "response": ["Terenure, Drimnagh and Kimmage, on the south side of Dublin City, were given to the Barnewell family by King John in 1215. The Barnewells gave some of the land to St John The Baptist Hospital outside Newgate, and Cromwell confiscated the remainder from them. Terenure passed through the hands of various owners since then, including what is now Terenure College (bought by the Carmelites in 1860). In the seventeenth century, the main landowners were the Deane family, whose most notable member was Joseph Deane, Chief Baron of the Irish Exchequer; his estates later passed to the Bourne family.  Fortfield House was built around 1785 by a later Chief Baron,   Barry Yelverton, 1st Viscount Avonmore. It was  later owned by John Hatchell,  the  Attorney General for Ireland and passed by inheritance to the Perrin family. It  was  demolished in 1934."]}, {"page": "Solicitor-General for Ireland", "response": ["*John Hatchell: 24 December 1847 – 23 September 1850"]}, {"page": "Windsor (UK Parliament constituency)", "response": ["|rowspan=\"2\"| John Hatchell"]}, {"page": "Attorney-General for Ireland", "response": ["* John Hatchell: 23 September 1850"]}, {"page": "First Russell ministry", "response": ["|John Hatchell||23 September 1850", "|John Hatchell||24 December 1847"]}]}}