{"wiki_id": "http://www.wikidata.org/entity/Q6231462", "itemLabel": "John Egan", "itemDescription": "Canadian politician (1811-1857)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Egan_(Canadian_politician)", "wikipedia_page": {"main": "John Egan (November 11, 1811 – July 11, 1857) was an Irish-Canadian businessman and political figure in the Ottawa region.\nHe was born near Aughrim, Ireland, in 1811. He came to Aylmer, Lower Canada, Canada, in 1830. After working with a lumber company on the upper Ottawa River, he entered the business himself near Bytown. He founded the town of Eganville in Ottawa Valley on the Bonnechere River, later expanding his operation to the Quyon, Petawawa and Madawaska Rivers. Egan was one of four men to finance the construction of the first flour and sawmill in Aylmer in 1839, and in partnership with Joseph Aumond, he founded the Union Forwarding Company in 1845. In the late 1840s, he began building a number of sawmills. Together with Ruggles Wright, he also operated a steamship transporting goods on the Ottawa River. Egan also played an important role in the development of railways service to the area, including the Bytown and Prescott Railway.\nHe bought James Wadsworth's farm at the ‘Fifth Chute’ on the Bonnechere in 1838, which he later developed into the village of Eganville, Ontario. John Egan is known as the namesake for Eganville. He built dams and timber slides along the Bonnechere River and employed thousands of men through lumber camps and transportation. Thanks to Egan's interest in red pine and business investments, the surrounding area would become a hub for lumber activity with Eganville at the centre.By 1850, he was the dominant force in the timber trade along the Ottawa River. He had been elected mayor of Aylmer in 1847. He was elected to the Legislative Assembly of Lower Canada in the riding of Ottawa County in 1848 and was reelected there in 1851. In 1854, he became the first elected representative for the newly formed riding of Pontiac.\nA decline in the red pine market forced him into bankruptcy in 1854.\nHe died in 1857 at Quebec City while still representing Pontiac, after two years of ill health.In 1864, the Egan Township in Quebec was named in his honour (see: Egan-Sud, Quebec).", "link_mentions": [{"page": "Pontiac, Quebec", "response": ["Onslow and Eardley Townships were already plotted on the Gale and Duberger Map of 1795, and it was early in the 19th century that these townships were opened to logging and settlement. One of the first settlements was on Pontiac Bay, founded by Philemon Wright and named at times Wright shanties, Pontiac Village, and Pontiacville. Quyon was founded in 1848 when a sawmill was built by John Egan at the mouth of the Quyon River."]}, {"page": "Aylmer, Quebec", "response": ["In that same year of 1818, Philemon's oldest son, Philemon Junior, cleared the Chaudière Lake Farm (a supply farm for the timber industry) at Turnpike End and built a hotel, a tavern and a store.The Aylmer Road, Diane Aldred, Aylmer Heritage Association, 1994, pg. 18-19 The landing at Turnpike End had become a busy stopping-off point so the hotel, tavern, and store were built to accommodate all the travelers who journeyed to and from the Upper Ottawa River.Aylmer Quebec, Son Patrimoine-Its Heritage, Diane Aldred, Aylmer Heritage Association, 2016, pg. 6 In November 1821, Philemon Junior died suddenly in a tragic coach accident. As a result, Philemon Sr. needed a new manager for the Chaudière Lake Farm. His other sons were busy managing the family's timber business, so Philemon Sr. chose Charles Symmes, his nephew who had been in his uncle's employ for two years, to be the new manager. The hotel was made ready for his occupancy in 1822.Aylmer Quebec, Son Patrimoine-Its Heritage, Diane Aldred, Aylmer Heritage Association, 2016, pg. 8 In October 1823, the arrangement was made official and more equitable with Charles named a partner of the Farm and Landing with P. Wright & Sons in a lease agreement. Charles would manage the farm and also manage the tavern/store at the waterfront but a dispute arose between Charles and his uncle Philemon regarding the terms of their agreement. Charles left P. Wright & Sons to pursue business on his own at Turnpike End, he acquired property and, in 1830, had his property surveyed and divided up into building lots for sale to create a \"government village\", https://qahn.org/fr/node/781 as per the Crown's directive. He developed the waterfront, created a dock, and partnered with John Egan and Joseph Aumond in building and running the steamboat Lady Colborne, the first to operate in that area. In 1831, he replaced the Wright tavern/store with a larger stone building he named the Aylmer Hotel, but soon became known as the Symmes Inn (also known today as l'Auberge Symmes).", "* John Egan (1847–1855)"]}, {"page": "Ruggles Wright", "response": ["In partnership with John Egan, he operated steamships transporting goods on the Ottawa River."]}, {"page": "John Rudolphus Booth", "response": ["Booth's vision and boldness were qualities that made him a success. In 1867, he purchased, for $40,000, the timber rights of John Egan's  of pine on the Madawaska River in what is now Algonquin Park. Five years later, he refused an offer of more than $1 million to sell those rights."]}, {"page": "List of people from Ottawa", "response": ["| John Egan ", "| 80px|John Egan"]}, {"page": "Ottawa (County of) (electoral district)", "response": ["*John Egan, {1848-1854)"]}, {"page": "John Egan", "response": ["John Egan may refer to:", "*John Egan (basketball), basketball player who participated on Loyola University Chicago's 1963 championship team", "*John Egan (Dublin GAA) (1951–2007), former Dublin GAA County Chairman", "*John Egan (footballer, born 1937), Scottish football player", "*John Egan (footballer, born 1992), Irish football player", "*John Egan (Gaelic footballer) (1952–2012), Kerry player", "*John Egan (hurler) (active since 2010), Irish hurler and Gaelic footballer", "*John Egan (Canadian politician) (1811–1857), Canadian businessman and politician", "*John Egan (chairman) (1750–1810), Irish barrister, politician, and chairman of Kilmainham, County Dublin", "*John Egan (CPR) (active 1882–1886), General Superintendent during the completion of the Canadian Pacific Railway", "*John Egan (harp maker) (active 1804–1838), Irish musical instrument maker", "*Sir John Egan (industrialist) (born 1939), British industrialist", "*John Egan (piper) (1840–1897), left-handed Irish piper", "*John Egan (Wisconsin politician) (1876–1942), American politician"]}, {"page": "Eganville, Ontario", "response": ["The first settler in Eganville was Gregoire Belanger in 1825. He built the first lumber shanty on the Bonnechere River. He then sold the area to James Wadsworth in 1826 who called it \"New Fairfield Farm\". Wadsworth then sold the area to Eganville's name-sake John Egan who was both a lumberman and a politician. The power of the river has been harnessed since 1848 but it was John Egan's grist mill that is credited for stimulating the town's growth. After his death in 1857 (at the age of 46) his family ran the business for ten years before selling to James Bonfield and Robert Turner."]}, {"page": "3rd Parliament of the Province of Canada", "response": ["|John Egan"]}, {"page": "4th Parliament of the Province of Canada", "response": ["|John Egan"]}, {"page": "5th Parliament of the Province of Canada", "response": ["|John Egandied in July 1857; George Bryson was elected in a by-election in October 1857."]}, {"page": "Pontiac (provincial electoral district)", "response": ["*John Egan, (1854–1857)"]}, {"page": "Ottawa, Arnprior and Parry Sound Railway", "response": ["John Egan opened logging in central Ontario in the 1840s with a string of saw and grist mills along the Ottawa River. The drainage area for the river allowed timber rafts to be floated to the mills from an enormous area, and Egan purchased lands throughout central Ontario to feed timber to the mills. In 1854 a crash in red pine prices forced the entire empire into bankruptcy, and Egan turned his attention to politics.\"Biography of John Ega\", Dictionary of Canadian Biography"]}, {"page": "1811 in Ireland", "response": ["*11 November – John Egan, businessman and politician in Ottawa (died 1857)."]}, {"page": "James Bonfield", "response": ["He was born in Gortmore, County Tipperary, Ireland in 1825, the son of John Bonfield, and came to Canada in 1848. He worked as a clerk for lumber merchant John Egan, later opened his own general store and afterwards became a lumber merchant in Eganville. He served as reeve for Grattan Township. In 1854, he married Catherine Tracy."]}, {"page": "Bonnechere Valley", "response": ["The power of the Bonnechere River has been harnessed since 1848 but it was John Egan's grist mill that gets credit for stimulating the area's economic growth."]}, {"page": "Robert Campbell (Canadian politician)", "response": ["He was born in Glenurquhart, the son of Dugald Campbell, and came to Lochiel Township, Glengarry County, Upper Canada with his parents in 1820. Campbell entered the timber trade and was manager for John Egan on the Bonnechere River. In 1845, he married Elizabeth Lothian. He was named a justice of the peace and served on the municipal council for Eganville. He established his own lumber company with his son Robert Adam Campbell. He ran unsuccessfully for a seat in the House of Commons in 1878 before being elected in 1882. Campbell died in office in 1887."]}, {"page": "1857 in Ireland", "response": ["*11 July – John Egan, businessman and politician in Ottawa (born 1811)."]}, {"page": "George Bryson Sr.", "response": ["He was born in Paisley, the son of James Bryson and Jane Cochrane, and came to Upper Canada with his parents in 1821. In 1835, he moved to the area near Fort-Coulonge in Lower Canada, where he entered the timber trade. In 1845, he married Robina Cobb. Bryson was mayor of Mansfield-et-Pontefract from 1855 to 1857 and from 1862 to 1867. He also served as justice of the peace, postmaster for Fort Coulonge and warden for Pontiac County. In 1857, he was elected to represent Pontiac in the Legislative Assembly of the Province of Canada  in a by-election held after the death of John Egan, but the assembly was dissolved before he took his seat. Bryson was defeated in the general election that followed in 1858. In 1867, he was named to the province's Legislative Council for Inkerman division. He helped establish the Bank of Ottawa, later serving as a director, and promoted the development of railway links in the region. Bryson retired from politics in 1887 and died in Fort-Coulonge at the age of 86."]}, {"page": "Egan-Sud, Quebec", "response": ["Settlement in this area by Europeans began in the mid-nineteenth century. By 1863, there was a population of 140 people, most of Irish origin and almost all Catholics. In 1864, the Egan Township was proclaimed, named in memory of John Egan (1811-1857), an Irish immigrant, owner of large logging concessions in the Outaouais, and holder of several political offices. In 1881, the Municipality Township of Egan was formed."]}, {"page": "Aed mac Conchbair Mac Aodhagáin", "response": ["* John Egan (Canadian politician) (1811–1857), businessman and politician."]}, {"page": "Ottawa River timber trade", "response": ["Other import names include James Skead (1817-1844), John Rochester (1822-1894), Daniel McLachlin (1810-1872) and John Egan (1811-1857)."]}, {"page": "Robert Conroy (politician)", "response": ["Born in Magherafelt in County Londonderry, Conroy arrived in the Ottawa region in 1830. In 1834 (some sources say 1838) he built the British Hotel in Aylmer. Conroy partnered with John Egan, Charles Symmes and Harvey Parker in the operation of a steam-powered flour mill. He was also a partner with Egan, Richard McConnell and Joseph-Ignace Aumond in the Bytown and Aylmer Union Turnpike Company which completed the Britannia Road (later known as the Aylmer Road) connecting Bytown, Hull and Aylmer to aid in the transport of lumber. Conroy built a sawmill in the Aylmer area which formed the nucleus for the development of the village of Deschênes, now a neighbourhood in the city of Gatineau. Conroy was one of the prominent timber kings of his era who were consulted by the Canadian government during the development of the Crown Timber Act of 1849, which was the first legislation in Canada regulating the use of forest resources on Crown lands. He was a director of the Ottawa Association of Lumber Manufacturers and held extensive timber cutting rights on the Madawaska River and other parts of Renfrew County, Ontario. Conroy was president of the Madawaska River Improvement Company, formed to build timber slides and other structures to aid in the transport of logs on that river. During the 1850s, he bought the Aylmer Hotel, later the Auberge Symmes, from Charles Symmes. He also operated a general store in Aylmer."]}, {"page": "Robert Howard Wright", "response": ["The son of Charles Wright and Lucy Stewart, he purchased the former residence of John Egan in 1909, living there until his death with his wife, Esther J. Lusk, and their daughter Annie and two sons R. Howard and Charles J. He established two companies, a dairy and a large greenhouse flower business, which were both very successful. The greenhouses which covered four acres, were heated with coal which was transported to the site by a private railway line. Wright also raised Holstein cattle and owned two flower shops in Ottawa. He served on the Aylmer municipal council from 1899 to 1900 and was elected to council again in 1914 and 1917. Wright became gravely ill in 1933. In the same year, a severe hail storm destroyed his greenhouses; he died later that year."]}, {"page": "Harvey Parker (politician)", "response": ["Parker was the son of Harvey Parker and Azenath Chamberlain, who came to Aylmer from Newbury, Vermont in 1801. He served on Aylmer municipal council from 1849 to 150 and from 1855 to 1858. Parker also served as municipal assessor. During his term as mayor, wooden sidewalks were built in the village. He was a partner with Robert Conroy, Charles Symmes and John Egan in the operation of a steam-powered flour mill."]}, {"page": "Joseph-Ignace Aumond", "response": ["Aumond was president of the Bytown and Montreal Telegraph Company. He helped establish the Bytown and Prescott Railway and served as one of its first directors. He was a partner with John Egan in the operation of two steamships on the Ottawa River and also partnered with Egan and Ruggles Wright in constructing a horse-drawn railway to provide an overland connection around rapids to link the two steamship routes. He was also a director with Robert Conroy and Richard McConnell of the Bytown and Aylmer Union Turnpike Company which completed the road linking Bytown and Aylmer in 1850; Egan was company president."]}, {"page": "Quyon", "response": ["Already the site of the Sainte-Marie Mission, the village was founded in 1848 by John Egan, a lumber baron of the Ottawa Valley and mayor of Aylmer from 1847 to 1855. It derived its name from the Quyon River, a tributary of the Ottawa River that was used by Egan for log driving, and was originally spelled \"Quio\", from the Native Algonquin word kweia (pronounced \"quia\"), meaning \"Smaller River\"Lemoine, Dictionnaire Française=Algonquin, 1909 or \"sandy bottom river\"."]}, {"page": "Egan Estates Railway", "response": ["The line was built by lumber baron John Rudolphus Booth, who also built the OA&PS. The line is named for John Egan, the owner of 250 square miles of land in today's Algonquin Provincial Park. Egan had developed the land by opening several \"depot farms\" that sold produce to the workers in the surrounding areas."]}]}}