{"wiki_id": "http://www.wikidata.org/entity/Q6230404", "itemLabel": "John Dundas", "itemDescription": "British flying ace (1915-1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Dundas_(RAF_officer)", "wikipedia_page": {"main": "John Charles Dundas,  (19 August 1915 – 28 November 1940) was a Royal Air Force fighter pilot and flying ace of the Second World War credited with 12 victories.\nBorn in West Yorkshire as the son of an aristocrat, Dundas was an able student and academic. After graduating from Christ Church, Oxford, he became a journalist and joined a newspaper in his home county. After two years, Dundas tired of life as a reporter and joined the Royal Auxiliary Air Force (RAuxAF) in July 1938, being commissioned as pilot officer in No. 609 (West Riding) Squadron and trained as a pilot at his own expense.\nIn May 1940 his squadron took part in the Battle of France, during which Dundas claimed his first two victories. Dundas remained with his squadron throughout the Battle of Britain, claiming nine German aircraft shot down. On 9 October he was awarded the Distinguished Flying Cross (DFC) for 10 victories. At the time of his last battle Dundas had been credited with 12 aircraft destroyed, two shared destroyed, four probably destroyed and five damaged. During a battle over the English Channel on 28 November 1940, Dundas is believed to have engaged and shot down Helmut Wick, the highest scoring ace of the Luftwaffe at that time. Moments later Dundas was also shot down into the sea. Both pilots vanished and remain missing in action.", "link_mentions": [{"page": "Dundas (surname)", "response": ["* John Dundas (RAF officer)  (1915– 1940), a British Second World War fighter pilot", "* John Dundas (1808–1866), a British Whig, and later Liberal politician.", "* John Dundas (1845–1892), a British Liberal politician"]}, {"page": "Air Forces Memorial", "response": ["* Flight Lieutenant John Dundas, flying ace"]}, {"page": "Helmut Wick", "response": ["Born in Mannheim, Wick joined the Luftwaffe in 1936 and was trained as a fighter pilot. He was assigned to Jagdgeschwader 2 \"Richthofen\" (JG 2—2nd Fighter Wing), and saw combat in the Battles of France and Britain. In October 1940, he was given the position of wing commander of JG 2—the youngest in the Luftwaffe to hold this position. Wick was shot down in the vicinity of the Isle of Wight on 28 November 1940, most likely by the British ace John Dundas, who was himself shot down by Wick's wingman. Wick was posted as missing in action, presumed dead. By then he had been credited with the destruction of 56 enemy aircraft in aerial combat, making him the leading German ace at the time. Flying the Messerschmitt Bf 109, he claimed all of his victories against the Western Allies.", "Shortly afterwards, around 5 p.m., Wick's Bf 109 E-4 (Werknummer 5344 — factory number) was shot down, probably by twelve–victory ace Flight Lieutenant John Dundas of No. 609 Squadron, though it is also possible that Wick fell victim to Pilot Officer Eric Marrs; Polish pilot Zygmunt Klein of No. 234 Squadron may have also scored hits on Wick's aircraft; he was also shot down and killed during the battle. Fiby and Leie saw the Spitfires diving to attack and managed to get out of the way, but lost track of Wick and Pflanz. Rudolf Pflanz saw a Spitfire shoot down a Bf 109, whose pilot bailed out. Pflanz then shot down the Spitfire, which he observed to crash in the sea with its pilot still inside. Pflanz later claimed Wick survived being shot down and watched him clamber into a dingy."]}, {"page": "Erich Leie", "response": ["World War II in Europe had begun on Friday 1 September 1939 when German forces invaded Poland. On 21 March 1940, Leie was transferred to III. Gruppe (3rd group) of Jagdgeschwader 2 \"Richthofen\" (JG 2—2nd Fighter Wing), named after World War I fighter ace Manfred von Richthofen. He claimed his first victory on 14 May during the Battle of France when he shot down a Bristol Blenheim bomber  east of Sedan. By October 1940, Leie was serving with the Geschwaderstab (headquarters unit) of JG 2. On 28 November 1940, Leie was wingman of Major (Major) Helmut Wick, Geschwaderkommodore (wing commander) of JG 2, on a mission to the Isle of Weight. Leie claimed a Supermarine Spitfire fighter destroyed, his eleventh aerial victory. On that mission, Wick was killed in action when he was shot down, probably by Flight Lieutenant John Dundas of No. 609 Squadron who was also killed that day."]}, {"page": "Kampfgeschwader 55", "response": ["On 13 August KG 55 was involved in Adlertag the all-out offensive against the Royal Air Force (RAF) in southern England, attacking the port of Plymouth, Feltham and RAF Middle Wallop without loss. The following day, KG 55 was to suffer its most significant loss. On 14 August 1940 He 111P G1 + AA was shot down near the Royal Naval Armament Depot at East Dean in Hampshire.Hall & Quinlan 2000, p. 18. Geschwaderkommodore Oberst Alois Stoeckl and his crew were killed.Bergström 2015, p. 115. He was replaced by Major Hans Korte of I./KG 55. Major Friedrich Kless took over command of I./KG 55. Stoeckl and his crews were able to bomb the airfield but the Kommodore fell to the RAF ace John Dundas.Mason 1969, p. 244. KG 55 continue to operate against RAF airfields. On 16 August 1940 it bombed Heathrow Airport. On 26 August it took part in Luftflotte 3's last major daylight raid for three weeks as the air fleet was reassigned to attacking the West and East Midlands industrial areas.Mason 1969, p. 308.Bickers 1990, p. 131."]}, {"page": "Hugh Dundas", "response": ["Born in Doncaster, on 2 July 1920, Dundas was a scion of a noble family. He was the grandson of the Scottish Liberal politician John Dundas and a great-great-grandson of Lawrence Dundas, 1st Earl of Zetland.Bishop 2004, p. 76. Dundas was also related to the Earl of Halifax.Franks 1980, p. 178. Like his elder brother John, he became fascinated by the idea of flying from childhood, and he joined the Auxiliary Air Force (AuxAF) straight after leaving Stowe School in 1938. On 23 July 1939, the day after his 19th birthday, he was commissioned an acting pilot officer in the AuxAF. He was confirmed in the rank of pilot officer on 2 October, with the service number 91001."]}, {"page": "List of aviators by nickname", "response": ["* \"Dogs\" – John Dundas, RAF Battle of Britain fighter ace"]}]}}