{"wiki_id": "http://www.wikidata.org/entity/Q6238651", "itemLabel": "John Hendrie", "itemDescription": "Scottish footballer and manager (born 1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hendrie_(Scottish_footballer)", "wikipedia_page": {"main": "John Grattan Hendrie (born 24 October 1963) is a Scottish former professional association footballer who played on the right wing or in attack.\nHis career started at Coventry City but he moved to Bradford City, where he played 173 consecutive league games, winning one promotion and narrowly missing out on another. Following spells with Newcastle United and Leeds United, he moved to Middlesbrough and scored the final goal at Ayresome Park among his 44 goals for Boro. When he was replaced by Brazilian Juninho he moved to Barnsley where he finished his career and also served as manager.\nHis uncle is another Scottish former pro footballer, Paul Hendrie. Paul has two sons (John's cousins) in the game; Lee Hendrie made a late substitute appearance for England in 1998 and Stuart Hendrie played for Morecambe.", "link_mentions": [{"page": "October 24", "response": ["*  1963   – John Hendrie, Scottish footballer and manager"]}, {"page": "Newcastle United F.C.", "response": ["|1989|| John Hendrie"]}, {"page": "Barnsley F.C.", "response": ["For the 1994–95 season, Barnsley turned to midfielder Danny Wilson to manage the club. His first season brought a sixth-place finish in the First Division, which would normally have meant a play-off place, but a restructuring of the league meant that they missed out. They finished 10th a year later before finally emerging as serious promotion contenders in the 1996–97 season, finally clinching runners-up spot and automatic promotion and gaining the top flight place that they had spent 99 years trying to win. Barnsley lasted just one season in the Premier League but they did reach the quarter-finals of the FA Cup, defeating Manchester United in the fifth round. They also made their record signing that season with Gjorgji Hristov for £2 million. Wilson then departed to take over at Sheffield Wednesday, being succeeded as Barnsley manager by striker John Hendrie, who had been a key player in the promotion-winning team. Barnsley were the only team from outside the Premier League to reach the quarter-finals of the FA Cup in the 1998–99 season, but only finished 13th in the league. Hendrie was then replaced as manager by Dave Bassett, who rejuvenated the team and took them to fourth place in 1999–2000. The team lost in the play-off final to Ipswich Town, the last play-off final at Wembley before the stadium was closed for redevelopment.", "*  John Hendrie (1998–1999)", "|1997|| John Hendrie"]}, {"page": "Bradford City A.F.C.", "response": ["*  John Hendrie"]}, {"page": "Bradford City stadium fire", "response": ["The Bradford City matchday squad of players and staff consisted of Terry Yorath, Trevor Cherry, Chris Withe, Don Goodman, Eric McManus, Tony Clegg, John Hawley, Dave Evans, Bryan Edwards, John Hendrie, Mark Ellis, Stuart McCall, Peter Jackson, Bobby Campbell, Martin Singleton and Greg Abbott.", "On 1 May 2010, to commemorate the 25th anniversary of the fire the football TV show Football Focus was hosted from Valley Parade by Dan Walker, the show included interviews with Terry Yorath and John Hendrie."]}, {"page": "Arjan de Zeeuw", "response": ["De Zeeuw was approached by Barnsley later that year, who signed him for a fee of £250,000 during the 1995–96 season. In December 1995, he scored his first goal in English football in a 2–2 draw against Ipswich Town. He was a key player in the side that won promotion to the Premier League in the 1996–97 season. The club were relegated the following year, and it appeared that De Zeeuw was set to leave the club in the summer after turning down a new contract, but was later persuaded by new manager John Hendrie to sign a one-year deal. When his contract expired at the end of the 1998–99 season, he moved to Wigan Athletic."]}, {"page": "Lee Hendrie", "response": ["Hendrie was set to join Scottish-side Aberdeen but the deal fell through at the last minute. Instead, he started training with Championship side Reading, but was not offered a contract and was instead offered a short-term deal at his cousin John Hendrie's former club Bradford City by manager Peter Taylor. Taylor had previously managed Hendrie for England under-21s. Talking about his signing and the short-term deal, Hendrie said: \"These next few weeks will be very interesting for me, and I will knuckle down. I have to use this to build up my fitness and get back to my peak.\" ", "Lee Hendrie is the son of Scottish former professional footballer Paul Hendrie. Paul Hendrie moved to England in March 1972 to join Birmingham City. Hendrie was born in Birmingham on 18 May 1977. His younger brother, Stuart Hendrie, is also a footballer, who played alongside him at Daventry Town. Hendrie is the cousin of another Scottish professional footballer, John Hendrie."]}, {"page": "Paul Jewell", "response": ["In December 1984, Jewell moved to Wigan Athletic for £15,000. He made his league debut for Wigan against Rotherham United in a 3–3 draw. He appeared 137 times for Wigan, scoring 35 goals, before moving to Bradford City in an £80,000 deal. Terry Dolan brought Jewell to Valley Parade in June 1988 as part of a re-building exercise after the club failed to win promotion to Division One in 1987–88 and had lost Stuart McCall and John Hendrie to Everton and Newcastle United, respectively. He spent a decade as a player at City scoring 56 league goals in 269 appearances, and forged a successful partnership with Sean McCarthy for four of those seasons. Jewell's most successful spell occurred in 1992–93 when he scored 16 league goals to McCarthy's 17 in the first season of new player-manager Frank Stapleton's tenure."]}, {"page": "Dave Bassett", "response": ["Bassett succeeded John Hendrie as Barnsley manager in May 1999. In his first season at the helm Barnsley reached the Division One play-off final but missed out on promotion to the Premier League after losing to Ipswich Town. Bassett left in December 2000 after failing to mount another promotion challenge. He was linked with a move to succeed Colin Lee at fellow Division One club Wolverhampton Wanderers, but when Lee's successor was announced in the new year it was Dave Jones, formerly of Southampton, and not Bassett, who took the role."]}, {"page": "Hendrie", "response": ["*John Hendrie (Scottish footballer) (born 1963), Scottish former footballer", "*John Hendrie (Australian footballer) (born 1953), Australian footballer"]}]}}