{"wiki_id": "http://www.wikidata.org/entity/Q6235587", "itemLabel": "John Godley, 3rd Baron Kilbracken", "itemDescription": "British Baron (1920-2006)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Godley,_3rd_Baron_Kilbracken", "wikipedia_page": {"main": "The Rt Hon. John Raymond Godley, 3rd Baron Kilbracken, DSC (17 October 1920 – 14 August 2006), was a British-born, later Irish-resident peer, wartime naval pilot, journalist, author and farmer.  He was the son of The 2nd Baron Kilbracken; his grandfather, Arthur Godley, 1st Baron Kilbracken, was William Ewart Gladstone's private secretary.  He became the third Baron Kilbracken on his father's death in October 1950, and became an active member of the House of Lords.  After many years living in the Republic of Ireland, he renounced his British nationality and took up Irish citizenship in the 1970s, as a protest at British actions in Northern Ireland.", "link_mentions": [{"page": "Carrigallen", "response": ["* John Godley, 3rd Baron Kilbracken (1920-2006), an author and journalist, lived at Killegar House, the ancestral seat of the Godley family. His grandfather, Arthur Godley, 1st Baron Kilbracken (1847-1932), served as Permanent Under-Secretary of State for India from 1883 until 1909."]}, {"page": "1920 in Ireland", "response": ["*17 October – John Godley, 3rd Baron Kilbracken, author and journalist (died 2006)."]}, {"page": "Godley", "response": ["* John Godley, 3rd Baron Kilbracken (1920–2006), British-born Irish peer"]}, {"page": "2006 in Ireland", "response": ["*14 August – John Godley, 3rd Baron Kilbracken, author and journalist (born 1920)."]}, {"page": "Deaths in August 2006", "response": ["*John Godley, 3rd Baron Kilbracken, 85, British-born Irish peer, wartime Fleet Air Arm pilot and journalist."]}, {"page": "John Raymond Godley, 3rd Baron Kilbracken", "response": ["#REDIRECT John Godley, 3rd Baron Kilbracken"]}, {"page": "Frederik H. Kreuger", "response": ["Kreuger was in an opportune position to write his biography about Van Meegeren because his native language is Dutch and also because he lived in the Netherlands at the time when Van Meegeren was active. He searched for primary sources – especially in the Netherlands – and added in this way to the knowledge gained by John Godley, 3rd Baron Kilbracken,John R. Godley: Master Forger. The Story of Han van Meegeren. New York 1951 and Van Meegeren, Master Forger. New York: Charles Scribner’s Sons, 1967. who was a pioneer in this field, and to that of Marie Louise Doudart de la Grée, who interviewed Van Meegeren in 1946 and wrote a Dutch biography"]}, {"page": "Index of World War II articles (J)", "response": ["# John Godley, 3rd Baron Kilbracken"]}, {"page": "Wynne Godley", "response": ["Godley was born in London to Hugh Godley, 2nd Baron Kilbracken and his wife Elizabeth Usborn. He was born six years after his older brother, John who was to become the John Godley, 3rd Baron Kilbracken."]}, {"page": "Arnold House School", "response": ["* John Godley, 3rd Baron Kilbracken"]}, {"page": "Anglo-Irish big house", "response": ["After Ambrose Congreve died in 2011 aged 104, Mount Congreve was described as the \"last Big House\", meaning the last in which a member of the ascendancy family was resident. Killegar House has been similarly described, and is home of the widow of John Godley, 3rd Baron Kilbracken, who died in 2006."]}, {"page": "Chester Street", "response": ["In 1920, John Godley, 3rd Baron Kilbracken was born in Chester Street."]}]}}