{"wiki_id": "http://www.wikidata.org/entity/Q6237432", "itemLabel": "John Hamilton", "itemDescription": "military officer in the British Army", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hamilton_(Loyalist)", "wikipedia_page": {"main": "John Hamilton (died December 12, 1816) was a military officer in the British Army, and the commander of the Royal North Carolina Regiment of Loyalist provincial volunteers during the American Revolutionary War from 1777 to 1783. Prior to the Revolution, Hamilton was a successful merchant in Halifax, North Carolina, with business interests throughout the Province of North Carolina. Hamilton commanded soldiers in several major engagements, including the battles of Briar Creek, Camden, Guilford Courthouse, and Yorktown.  After the conclusion of the war, Hamilton was made British consul to Norfolk, Virginia, one of only three Loyalists to receive consular positions in the newly created United States.", "link_mentions": [{"page": "Langdon Cheves", "response": ["His mother died on November 20, 1779. Cheves later described standing at his mother's grave as his earliest childhood memory. He was shortly thereafter placed in the care of his paternal aunt and uncle, Thomas and Margaret (née Agnew) Cheves. Cheves's father Alexander enlisted in the Loyalist cause under Major John Hamilton, but his brother Thomas was a Patriot who fought under Andrew Pickens at the Battle of Kettle Creek. After the Loyalist cause became dire in 1782, Alexander Cheves transferred his property to Langdon, likely in fear of confiscation. He entered exile, first in Nova Scotia and then in London. He was not received favorably by British courts and was not remunerated for his service and decided to return to America."]}, {"page": "Monarchism in the United States", "response": ["* John Hamilton"]}, {"page": "John Hamilton (American Revolution)", "response": ["#REDIRECT John Hamilton (Loyalist)"]}, {"page": "Royal North Carolina Regiment", "response": ["* Colonel John Hamilton"]}]}}