{"wiki_id": "http://www.wikidata.org/entity/Q6230175", "itemLabel": "John Drummond, 15th Baron Strange", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Drummond,_15th_Baron_Strange", "wikipedia_page": {"main": "John Drummond, 10th of Megginch, 15th Baron Strange (6 May 1900 – 13 April 1982), was Chief of the Baronial House and Branch of Drummond of Concraig and Lennoch within the clan Drummond and Baron of Megginch.Educated at Eton College, he became a Lieutenant in the Grenadier Guards and Hon. Attaché H.M. Legation Warsaw in 1920. Later, he was elected county councillor for West Perth, Scotland, aged 21. He joined the Black Watch in World War II, but finding himself deskbound, he returned to farm his estate at Megginch. In addition to being an organic soil and fish farmer, he was an author (as John Drummond) of ten books of fact and fiction, inventor, record producer, restaurateur and politician.", "link_mentions": [{"page": "Baron Strange", "response": ["*John Drummond, 15th Baron Strange (1900–1982) (abeyance terminated 1965; abeyant 1982)"]}, {"page": "Victoria Drummond", "response": ["She had two sisters, Jean and Frances, and a younger brother, John Drummond, 15th Baron Strange. She was baptised Victoria after Queen Victoria, who was one of her godmothers. September 2004.  Drummond and her siblings were brought up in both the Church of Scotland and the Scottish Episcopal Church. All four worked as children: growing vegetables and flowers to sell and keeping poultry. Drummond's speciality was hand-churning butter. Their privileged upbringing was straitened after one pair of grandparents lost a fortune in investments in 1906."]}, {"page": "Cherry Drummond, 16th Baroness Strange", "response": ["Although the family home is the 17th century Megginch Castle in Perthshire, Scotland, the family title, Baron Strange, is in the English peerage. Her father, John Drummond, 15th Baron Strange, had spent many years attempting to terminate an abeyance that arose on the death of the Duke of Atholl in 1957; he was confirmed in the title in 1965. The title went into abeyance once again on his death in 1982, but it was terminated in Cherry's favour in 1986, and she made her maiden speech on 4 March 1987.  Upon the Baroness's death the title was inherited by her eldest son, Adam."]}, {"page": "Geraldine Somerville", "response": ["Somerville was born in County Meath, Ireland, the daughter of Sir Quentin Charles Agnew-Somerville, 2nd Baronet, and Hon. Margaret April Irene Drummond, an antiques dealer, but was brought up on the Isle of Man. Her mother is a daughter of John Drummond, 15th Baron Strange, and sister of the late Cherry Drummond, 16th Baroness Strange.\"Hon. Margaret April Irene Drummond1\", The Peerage.com; accessed 16 June 2018."]}, {"page": "John Murray, 4th Duke of Atholl", "response": ["* Lady Charlotte Murray (1775–1832) married 1st Sir John Menzies of Castle Menzies, 4th Baronet and 2nd Admiral Sir Adam Drummond KCH, 7th of Megginch (great-grandparents of John Drummond, 15th Baron Strange)"]}, {"page": "John Drummond", "response": ["* John Drummond, 15th Baron Strange (1900–1982), of Megginch Castle, Scotland, author, farmer, politician"]}, {"page": "Agnew baronets", "response": ["*Sir Quentin Charles Agnew-Somerville, 2nd Baronet (8 March 1929 – 2010). Agnew-Somerville was the son of Sir Peter Agnew, 1st Baronet, and Enid Frances Boan. He attended Britannia Royal Naval College and became a sub-lieutenant in the Royal Navy. Since then, he pursued a career as an insurance consultant. He assumed by Royal Licence in 1950 the additional surname of Somerville, after that of Agnew, and the arms of Somerville quarterly with those of Agnew, in compliance with the will of his uncle (by marriage), James Somerville, 2nd Baron Athlumney; Quentin married 1963 Hon. (Margaret) April Irene Drummond, youngest daughter and co-heiress of John Drummond, 15th Baron Strange and Violet Margaret Florence Jardine, on 14 December 1963, and had issue, by whom he had two daughters, including the actress Geraldine Somerville, and one son."]}, {"page": "William Tyssen-Amherst, 1st Baron Amherst of Hackney", "response": ["*Geraldine Margaret (\"Cherry\"), born 1867, married Malcolm Drummond of Megginch, parents of John Drummond, 15th Baron Strange and Victoria Drummond;"]}, {"page": "Drummond (surname)", "response": ["** John Drummond, 15th Baron Strange (1900–82), of Megginch Castle, Scotland, author, farmer, politician"]}]}}