{"wiki_id": "http://www.wikidata.org/entity/Q6236167", "itemLabel": "John Green", "itemDescription": "Archdeacon Pastor (Diocese of Coventry); Chaplain of the Fleet, Director General Naval Chaplaincy Service and Archdeacon for the Royal Navy", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Green_(priest)", "wikipedia_page": {"main": "John Green,  (born 14 August 1953) is a Church of England priest and former Royal Navy chaplain. He was Chaplain of the Fleet, Director General of the Naval Chaplaincy Service and Archdeacon for the Royal Navy from 2006 to 2010. He was Archdeacon Pastor in the Diocese of Coventry from 2012 until his retirement in 2017.\nHe was born on 14 August 1953 and educated at North East London Polytechnic. From 1974 to 1980 he was a Project Engineer with Thorn Lighting Ltd. He was ordained in 1983 after studying at Lincoln Theological College and began his ecclesiastical career with curacies at St Michael and All Angels, Watford and St Stephen's Church, St Albans.\nHe became a naval chaplain in 1991: his service included\n\nHMS Sultan, 1991–92\n3rd Destroyer Sqdn, 1992–93\nHMNB Portsmouth, 1993–94\nHMS Excellent, 1994–95\nMinor Warfare Vessel Flotilla, 1996–98\nStaff Chaplain to Chaplain of the Fleet, 1998–2001\nHMS Ark Royal, 2001–03\nHMS Collingwood, 2003–06\nChaplain of the Fleet and Director General, Naval Chaplaincy Service 2006-2010He headed the Naval Chaplaincy Service Board of Management with responsibility for policy making and overall leadership. As Archdeacon for the Royal Navy he was the senior Anglican chaplain in the Royal Navy.\nGreen was appointed Companion of the Order of the Bath (CB) in the 2010 New Year Honours.In September 2013, Green became Associate Minister at St Mary Magdalen, Chapelfields, in the Diocese of Coventry, a post which he relinquished on his retirement in 2017.", "link_mentions": [{"page": "John Green (disambiguation)", "response": ["John Green (born 1977) is an American author, YouTube content creator and podcaster.", "John Green may also refer to:", "*John Green (painter) (died 1802), American-born Bermudian painter", "*John Green (producer), American TV producer for ABC News", "* John Green (Medal of Honor) (1825–1908), German-born American soldier and recipient of the Medal of Honor", "* Sir John Green (Royal Navy officer) (1866–1948), British admiral", "* John Green (priest) (born 1953), British Chaplain of the Fleet and Director General, Naval Chaplaincy Service", "*John Green (speaker) (1400–1473), Speaker of the House of Commons of England", "*John Green (judge) (1807–1887), American judge and Indiana State Senator", "*John Green (Wisconsin politician) (fl 1867), American military officer and Wisconsin State Assemblyman", "*John Greene (Kilkenny MP) (died 1883), Irish Member of Parliament in the British House of Commons, sometimes referred to as John Green", "*John Green (Australian politician) (born 1945), Tasmanian politician", "*John Green (Idaho politician) (born 1959), American politician, attorney, and former peace officer from Idaho", "*John Green (defensive end) (1921–1989), American football player for the Philadelphia Eagles of the NFL", "*John Green (guard) (1924–1981), American football player and coach, College Football Hall of Fame inductee", "*John Green (footballer, born 1894) (1894–1966), English footballer", "*John Green (footballer, born 1896) (1896–1927), English footballer", "*John Green (footballer, born 1939) (1939–2010), English football midfielder for Tranmere, Blackpool, Port Vale and Vancouver Royals", "*John Green (footballer, born 1958) (born 1958), English football defender for Rotherham, Scunthorpe and Darlington", "*John Green (Middlesex cricketer) (1896–1960), English cricketer", "*John Green (Warwickshire cricketer) (1908–1987), English cricketer", "*John Green (Trinidadian cricketer) (born 1918), Trinidadian cricketer", "*John Green (rugby union) (1881–1968), England rugby union international", "*John Green (Australian footballer) (1885–1949), Australian rules footballer", "*John Green (bishop) (1706–1779), British clergyman and academic", "*John Green (1787–1852), English architect and one half of the father-and-son architectural team", "*John Green (lay preacher) (1830–1903), manager of Coranderrk Aboriginal reserve in Victoria, Australia ", "*John Green (agriculturalist) (1862–1953), British agriculturalist", "*John Green (educationalist) (1867–1922), British educationalist and professor of education", "*John Green (botanist) (born 1930), Australian botanist", "*John Green (headmaster) (born 1967), British rugby player and schoolmaster", "*John Green (sociologist), American sociologist", "*John Greene (disambiguation)"]}, {"page": "Diocese of Coventry", "response": ["While the diocese is divided into archdeaconries and has archdeacons like other dioceses, Coventry diocese is unique in that the two do not correlate. In 2010, the post of Archdeacon of Warwick was replaced by that of Archdeacon Missioner (Morris Rodham was appointed) and statutory oversight over the archdeaconry of Warwick was delegated to the Archdeacon of Coventry (then Ian Watson). Following Watson's retirement in 2012, John Green was appointed as Acting Archdeacon of Coventry pending his installation into the new role of Archdeacon Pastor, which duly occurred on 9 December 2012.Coventry Diocese – A New Archdeacon for Coventry and Warwickshire  These arrangements follow the Bishop's 2009 document Signposts for the Future, and the creation of the two posts of Archdeacon Missioner and Archdeacon Pastor are consistent with the suggested \"transitional period\" after which there will be only one archdeacon in the diocese. Rodham and Green remained, legally, collated to the Archdeaconries of Warwick and of Coventry.National Archdeacons' Forum — Archdeacons’ News — #26, July 2017 (Accessed 9 September 2017) Green retired at the end of August 2017, and Clive Hogger joined him as Acting Archdeacon for July and August, then remained Acting Archdeacon after Green's retirement.Diocese of Coventry — Appointment of Acting Archdeacon (Accessed 9 September 2017) Sue Field was collated Archdeacon Pastor and Archdeacon of Coventry on 18 March 2018;Diocese of Coventry — Hundreds welcome our new Archdeacon Pastor (Accessed 25 March 2018) Barry Dugmore was collated Archdeacon Missioner and Archdeacon of Warwick on 6 October 2019."]}, {"page": "John Green (DGNCS)", "response": ["#REDIRECT John Green (priest)"]}, {"page": "Archdeacon of Coventry", "response": ["*December 201231 August 2017: John Green (Acting, April–December 2012;Coventry Diocese – Acting Archdeacon of Coventry  called Archdeacon Pastor)"]}, {"page": "Lincoln Theological College", "response": ["* John Green - Royal Navy chaplain & Chaplain of the Fleet"]}, {"page": "Royal Navy Chaplaincy Service", "response": ["* 2006–2010: John Green"]}, {"page": "John Green (Royal Navy chaplain)", "response": ["#REDIRECT John Green (priest)"]}, {"page": "Military archdeacon", "response": ["* John Green (2006 to 2010); also Chaplain of the Fleet from 2006 to 2010"]}]}}