{"wiki_id": "http://www.wikidata.org/entity/Q6239151", "itemLabel": "John Hewitt", "itemDescription": "Northern Ireland poet", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hewitt_(poet)", "wikipedia_page": {"main": "John Harold Hewitt (28 October 1907 – 22 June 1987), who was born in Belfast, Ireland, present day Northern Ireland, was the most significant Belfast poet to emerge before the 1960s generation of Northern Irish poets that included Seamus Heaney, Derek Mahon and Michael Longley. He was appointed the first writer-in-residence at Queen's University Belfast in 1976. His collections include The Day of the Corncrake (1969) and Out of My Time: Poems 1969 to 1974 (1974). He was also made a Freeman of the City of Belfast in 1983, and was awarded honorary doctorates the University of Ulster and Queen's University Belfast.From November 1930 to 1957, Hewitt held positions in the Belfast Museum & Art Gallery. His radical socialist ideals proved unacceptable to the Belfast Unionist establishment and he was passed over for promotion in 1953. Instead in 1957 he moved to Coventry, a city still rebuilding following its devastation during World War II . Hewitt was appointed Director of the Herbert Art Gallery & Museum where he worked until retirement in 1972.Hewitt had an active political life, describing himself as \"a man of the left\", and was involved in the British Labour Party, the Fabian Society and the Belfast Peace League. He was attracted to the Ulster dissenting tradition and was drawn to a concept of regional identity within the island of Ireland, describing his identity as Ulster, Irish, British and European. John Hewitt officially opened the Belfast Unemployed Resource Centre (BURC) Offices on Mayday 1985.\n\nHis life and work are celebrated in two prominent ways – the annual John Hewitt International Summer School – and, less conventionally, a Belfast pub is named after him – the John Hewitt Bar and Restaurant, which is situated on the city's Donegall Street and which opened in 1999. The bar was named after him as he officially opened the Belfast Unemployed Resource Centre, which owns the establishment. It is a popular meeting place for local writers, musicians, journalists, students and artists. Both the Belfast Festival at Queen's and the Belfast Film Festival use the venue to stage events.", "link_mentions": [{"page": "List of English-language poets", "response": ["*John Hewitt (1907–1987, NI)"]}, {"page": "October 28", "response": ["*1907 – John Hewitt, Irish poet, playwright, and critic (d. 1987)"]}, {"page": "1907", "response": ["** John Hewitt, Irish poet (d. 1987)"]}, {"page": "William Allingham", "response": ["Allingham had a substantial influence on W.B. Yeats; while the Ulster poet John Hewitt felt Allingham's impact keenly, and attempted to revive his reputation by editing, and writing an introduction to, The Poems of William Allingham (Oxford University Press/ Dolmen Press, 1967).  Allingham's wide-ranging anthology of poetry, Nightingale Valley (1862) was the inspiration for the 1923 collection Come Hither by Walter de la Mare.T Whistler, Imagination of the Heart (1993) p. 322"]}, {"page": "Irish poetry", "response": ["The promotion of standard English in education gradually reduced the visibility and influence of such movements. In addition, the polarising effects of the politics of the use of English and Irish language traditions also limited academic and public interest until the studies of John Hewitt from the 1950s onwards. Further impetus was given by more generalised exploration of non-\"Irish\" and non-\"English\" cultural identities in the latter decades of the 20th century.", "While Yeats and his followers wrote about an essentially aristocratic Gaelic Ireland, the reality was that the actual Ireland of the 1930s and 1940s was a society of small farmers and shopkeepers. From this environment emerged poets who rebelled against the example of Yeats, but who were not Modernist by inclination. Patrick Kavanagh (1904–1967), who came from a small farm, wrote about the narrowness and frustrations of rural life. John Hewitt (1907–1987), whom many consider to be the founding father of poetry in Northern Ireland also came from a rural background but lived in Belfast and was amongst the first Irish poets to write of the sense of alienation that many at this time felt from both their original rural and new urban homes. Louis MacNeice (1907–1963), another poet from Northern Irand, was associated with the left-wing politics of Michael Roberts's anthology New Signatures but was much less political a poet than W. H. Auden or Stephen Spender, for example. MacNeice's poetry was informed by his immediate interests and surroundings and is more social than political.", "In addition to John Hewitt, mentioned above, other important poets from Northern Ireland  include Robert Greacen (1920–2008) who, along with Valentin Iremonger, edited an important anthology, Contemporary Irish Poetry in 1949. Greacen was born in Derry, lived in Belfast in his youth and then in London during the 1950s, 1960s and 1970s. He won the Irish Times Prize for Poetry in 1995 for his Collected Poems, after he returned to live in Dublin when he was elected a member of Aosdana. Other poets of note from this time include Roy McFadden (1921–1999), a friend for many years of Greacen. Padraic Fiacc (born 1924), was born in Belfast, but lived in America during his youth. In the 1960s, and coincident with the rise of the Troubles in the province, a number of Ulster poets began to receive critical and public notice. Prominent amongst these were John Montague (born 1929), Michael Longley (born 1939), Derek Mahon (born 1941), Séamus Heaney (1939-2013) and Paul Muldoon (born 1951).", "*John Hewitt (ed), Rhyming Weavers: And Other Country Poets of Antrim and Down (Belfast: Blackstaff Press,2004)"]}, {"page": "Irish literature", "response": ["The earliest works of literature produced in Ireland are by Saint Patrick; his Confessio and Epistola, both in Latin. The earliest literature in Irish consisted of original lyric poetry and prose sagas set in the distant past. The earliest poetry, composed in the 6th century, illustrates a vivid religious faith or describes the world of nature, and was sometimes written in the margins of illuminated manuscripts. \"The Blackbird of Belfast Lough\", a fragment of syllabic verse probably dating from the 9th century, has inspired reinterpretations and translations in modern times by John Montague, John Hewitt, Seamus Heaney, Ciaran Carson, and Thomas Kinsella, as well as a version into modern Irish by Tomás Ó Floinn.", "The polarising effects of the politics of the use of English and Irish language traditions limited academic and public interest until the studies of John Hewitt from the 1950s onwards. Further impetus was given by more generalised exploration of non-\"Irish\" and non-\"English\" cultural identities in the latter decades of the 20th century.", "Northern Ireland has also produced a number of significant poets since 1945, including John Hewitt, John Montague, Seamus Heaney, Derek Mahon, Paul Muldoon, James Fenton, Michael Longley, Frank Ormsby, Ciarán Carson and Medbh McGuckian. John Hewitt (1907–87), whom many consider to be the founding father of Northern Irish poetry, was born in Belfast, and began publishing in the 1940s. Hewitt was appointed the first writer-in-residence at Queen's University, Belfast in 1976. His collections include The Day of the Corncrake (1969) and Out of My Time: Poems 1969 to 1974 (1974) and his Collected Poems in 1991."]}]}}