{"wiki_id": "http://www.wikidata.org/entity/Q6238477", "itemLabel": "John Heath", "itemDescription": "English entomologist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Heath_(entomologist)", "wikipedia_page": {"main": "John Heath (18 January 1922 – 6 July 1987) FRES was an English entomologist, specialising in lepidoptera. He helped to established data banks as a tool for conservation policy, both at a national and local level; was chief editor of The Moths and Butterflies of Great Britain and Ireland; and helped to develop the Heath Trap, a portable moth light used for recording moths at light.", "link_mentions": [{"page": "King Edward VI School, Southampton", "response": ["* John Heath, entomologist"]}, {"page": "The Moths and Butterflies of Great Britain and Ireland", "response": ["* Editor: John Heath", "* Editor: John Heath and A. Maitland Emmet", "* Editor: A. Maitland Emmet and John Heath", "* Editor: A. Maitland Emmet and John Heath", "* Editor: John Heath and A. Maitland Emmet", "* Editor: John Heath and A. Maitland Emmet"]}, {"page": "John Heath", "response": ["John Heath may refer to:", "* John Heath (MP), member of parliament for Clitheroe, 1661–1679", "* John Heath (later John Duke) (1717–1775), MP 1747–1768", "* John Heath (politician) (1758–1810), United States politician", "* John Heath (entomologist) (1922–1987), British entomologist", "* John Heath (cricketer, born 1807) (1807–1878), English cricketer", "* John Heath (cricketer, born 1891) (1891–1972), English cricketer", "* John Heath (cricketer, born 1978), English cricketer", "* John Heath (judge) (1736–1816), English judge", "* John Heath (footballer) (born 1936), English footballer", "* John Heath (racing driver) (1914–1956), English racing driver", "* John Heath, duelled with Oliver Hazard Perry, 1817", "* John Heath-Stubbs (1918–2006), English poet and translator", "* John Heath, victim of lynching in the Bisbee massacre in 1884"]}, {"page": "Micropterix amsella", "response": ["Micropterix amsella is a species of moth belonging to the family Micropterigidae, first described by John Heath in 1975 and is endemic to Croatia. Retrieved April 21, 2018.", "Category:Taxa named by John Heath"]}, {"page": "Micropterix aureocapilla", "response": ["Micropterix aureocapilla is a species of moth belonging to the family Micropterigidae. It was described by John Heath in 1986, and is known only from the type locality, El Hadjar in Algeria. Retrieved April 21, 2018.nkis.info ", "Category:Taxa named by John Heath"]}, {"page": "Micropterix aureofasciella", "response": ["Category:Taxa named by John Heath"]}, {"page": "Micropterix aureopennella", "response": ["Micropterix aureopennella is a species of moth belonging to the family Micropterigidae. It was described by John Heath in 1986, and is known from Algeria. Retrieved April 21, 2018.", "Category:Taxa named by John Heath"]}, {"page": "Micropterix carthaginiensis", "response": ["Micropterix carthaginiensis is a species of moth belonging to the family Micropterigidae, native to Tunisia. It was described by John Heath in 1986. Retrieved April 21, 2018. It is found in the marshland on the southern shore of Lake Ichkeul and at Jebel Boukornine, its type locality.", "Category:Taxa named by John Heath"]}, {"page": "Micropterix conjunctella", "response": ["Micropterix conjunctella is a species of moth belonging to the family Micropterigidae. It was described by John Heath in 1986, Retrieved April 21, 2018. and is endemic to the type locality at Skikda in Algeria.nkis.info", "Category:Taxa named by John Heath"]}, {"page": "Micropterix cypriensis", "response": ["Micropterix cypriensis is a species of moth belonging to the family Micropterigidae, and was first described by John Heath in 1985 from specimens collected in Cyprus. The holotype male was collected from Yermasoyia, Limassol on 11 March 1979 and is now in the Natural History Museum, Stockholm. It was thought to be the first time a Micropterix had been recorded on Cyprus and it is an endemic species of that island. Retrieved April 21, 2018."]}, {"page": "Micropterix eatoniella", "response": ["Category:Taxa named by John Heath"]}, {"page": "Micropterix fenestrellensis", "response": ["Micropterix fenestrellensis is a species of moth belonging to the family Micropterigidae. It was described by John Heath and T. Kaltenbach in 1984. Retrieved April 21, 2018. It is known from Italy.", "Category:Taxa named by John Heath"]}, {"page": "Micropterix hartigi", "response": ["Category:Taxa named by John Heath"]}, {"page": "Micropterix lakoniensis", "response": ["Micropterix lakoniensis is a species of moth belonging to the family Micropterigidae and is an endemic species from Greece. The first specimens were collected from Monemvasia, Greece by G Christensen, M Horak and B Skule, and described by John Heath in 1985. The holotype male is held in the UZM Copenhagen."]}, {"page": "Micropterix trifasciella", "response": ["Micropterix trifasciella is a species of moth belonging to the family Micropterigidae and was described by John Heath in 1965. Retrieved April 21, 2018. It is recorded in the French and Italian Alps, and is known to inhabit herbaceous plants at an elevation range of . Male Micropterix trifasciella have a wingspan of , while females have a wingspan of .", "Category:Taxa named by John Heath"]}, {"page": "Micropterix schaefferi", "response": ["Micropterix schaefferi is a species of moth belonging to the family Micropterigidae that was described by John Heath in 1975. Retrieved April 21, 2018. Male Micropterix schaefferi have a wingspan of , while females have a wingspan of . It is known from France, Corsica, Italy, Belgium, the Netherlands, Germany, Switzerland, Austria, Hungary, Czech Republic, Bulgaria, Denmark, and Poland. Moths in this species inhabit woodlands with many beech and coniferous trees, and are also known to inhabit moist ravine forests and dry pine forests.", "Category:Taxa named by John Heath"]}, {"page": "Micropterix zangheriella", "response": ["Micropterix zangheriella is a species of moth belonging to the family Micropterigidae. It was described by John Heath in 1963. Retrieved April 21, 2018. It is only known from the northern Apennines and has been found only in the Emilia-Romagna so far.nkis.info", "Category:Taxa named by John Heath"]}, {"page": "Micropterix tuscaniensis", "response": ["Micropterix tuscaniensis is a species of moth belonging to the family Micropterigidae. It was described by John Heath in 1960. Retrieved April 21, 2018. It is only known from central and southern Italy, where it has been found in the provinces of Tuscany, Calabria, Apulia and Basilicata. However, it is probably distributed throughout the whole of mainland Italy, except for the Alps.", "Category:Taxa named by John Heath"]}, {"page": "Micropterix vulturensis", "response": ["Micropterix vulturensis is a species of moth belonging to the family Micropterigidae. It was described by John Heath in 1981. Retrieved April 21, 2018. It is widely distributed in the central and southern Apennines.nkis.info", "Category:Taxa named by John Heath"]}]}}