{"wiki_id": "http://www.wikidata.org/entity/Q6236425", "itemLabel": "John Grillo", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Grillo", "wikipedia_page": {"main": "John Martin Grillo (born 29 November 1942, Watford, Hertfordshire) is an English actor.", "link_mentions": [{"page": "Blackadder", "response": ["More established actors, some at the veteran stage of their careers, were also recruited for roles. These included Peter Cook, John Grillo, Simon Jones, Tom Baker, Jim Broadbent, Hugh Paddick, Frank Finlay, Kenneth Connor, Bill Wallis, Ronald Lacey, Roger Blake, Denis Lill, Warren Clarke and Geoffrey Palmer, who played Field Marshal Sir Douglas Haig in \"Goodbyeee\", the final episode of Blackadder Goes Forth. Miriam Margolyes played three different guest roles: The Spanish Infanta in The Queen of Spain's Beard, Lady Whiteadder in Beer, and Queen Victoria in Blackadder's Christmas Carol."]}, {"page": "November 29", "response": ["*  1942   – John Grillo, English actor and playwright"]}, {"page": "1942 in television", "response": ["*November 29 – John Grillo, actor"]}, {"page": "1992 in film", "response": ["| Blame It on the Bellboy || Hollywood Pictures || Mark Herman (director/screenplay); Dudley Moore, Bryan Brown, Patsy Kensit, Richard Griffiths, Andreas Katsulas, Bronson Pinchot, Alison Steadman, Penelope Wilton, Jim Carter, Alex Norton, John Grillo, Ronnie Stevens, Lindsay Anderson || Comedy || Live action "]}, {"page": "1985 in film", "response": ["| Brazil || 20th Century Fox (International) / Universal Pictures (United States) || Terry Gilliam (director/screenplay); Tom Stoppard, Charles McKeown (screenplay); Jonathan Pryce, Robert De Niro, Katherine Helmond, Ian Holm, Bob Hoskins, Michael Palin, Ian Richardson, Peter Vaughan, Kim Greist, Jim Broadbent, Brian Miller, Sheila Reid, Simon Nash, Barbara Hicks, Kathryn Pogson, Bryan Pringle, Derrick O'Connor, Elizabeth Spender, Derek Deadman, Nigel Planer, Charles McKeown, Ray Cooper, Gorden Kaye, John Pierce Jones, Ann Way, Myrtle Devenish, Simon Jones, Bill Wallis, Don Henderson, Howard Lew Lewis, Oscar Quitak, Harold Innocent, John Grillo, Patrick Connor, Roger Ashton-Griffiths, Jack Purvis, Andre Gregory, Terry Gilliam, Sue Hodge || Sci-Fi || Live action"]}, {"page": "Abstract Imagists", "response": ["*John Grillo"]}, {"page": "Howard Brenton", "response": ["Brenton was born in Portsmouth, Hampshire, son of policeman (later Methodist minister) Donald Henry Brenton and his wife Rose Lilian (née Lewis). He was educated at Chichester High School For Boys and read English Literature at St Catharine's College, Cambridge. In 1964 he was awarded the Chancellor's Gold Medal for Poetry.ADC Theatre Archives, Cambridge. While at Cambridge he wrote a play, Ladder of Fools which was performed at the ADC Theatre as a double bill with \"Hello-Goodbye Sebastian\" by John Grillo in April 1965, and at the Oxford Playhouse in June of that year. It was described by Eric Shorter of The Daily Telegraph as \"Actable, gripping, murky and moody: how often can you say that of the average new play tried out in London, let alone of an undergraduate's work...\" Brenton's one-act play, It's My Criminal, was performed at the Royal Court Theatre (1966)."]}, {"page": "Chalk (TV series)", "response": ["Mr Carkdale (John Grillo), the head of English, very rarely utters anything but expletives. Struggling to find a rationale for his character, Grillo paced up and down a rehearsal room carrying a brown briefcase, which he remembers all of his own teachers carrying around, and shouting profanities.", "In an interview in the early 2000s, Moffat refused to even mention Chalk, joking that he might get attacked in the street.Coupling: Behind the Scenes, featurette (2002, prod./dir. Sarah Barnett & Christine Wilson) Coupling Season 1 DVD (Region 1), BBC Video,  The first series received criticism from some teachers and teaching unions, who criticised the representation of their professions. Letters were printed in specialist publications such as the Education Guardian. The Association of Teachers and Lecturers labelled Chalk as \"perverse\" and \"vapid\", and its leader called upon the show to be axed. Teachers, according to the Daily Record, complained that the show portrayed teachers as \"mentally unstable\", and deterred people from entering the profession. John Grillo, who played Mr Carkdale, recalls that he was appearing in a West End play at the time he was auditioning for the role; a fellow actor in the play was meant to be auditioning for Chalk but, having been a deputy head teacher earlier in his career, was so disgusted by the material that he refused to attend.\"The Staff Meeting\" DVD audio commentary, Chalk Series 1 DVD, ReplayDVD The unions' derision actually inspired The Times's Matthew Bond to like the show. However, despite identifying \"genuine humour\" such as Slatt's rant against French teachers, Bond's review is largely critical. He concedes, \"the teaching organisations, you see, are half right. Slatt has no credible basis in the teaching profession, but far more importantly he has no credible basis in the human race. And what we don't believe in, we rarely find funny.\"", "The complete first series was released on Region 2 PAL DVD by ReplayDVD, the independent label that had released Joking Apart, on 15 December 2008. The disc contains audio commentaries on all six episodes; Nicola Walker, Martin Ball, Geraldine Fitzgerald and John Grillo commentate over four of the episodes, with David Bamber and Amanda Boxer contributing to the remaining two. All of the above, along with producer Andre Ptaszynski, also feature in a 45-minute retrospective documentary, After the Chalk Dust Settled."]}, {"page": "Tim Cobb", "response": ["* John Grillo, member of the Pittsburgh Opera"]}, {"page": "Watford Grammar School for Boys", "response": ["* John Grillo (1942– ), theatre, film and television actor and playwright"]}, {"page": "Three Up, Two Down", "response": ["*John Grillo as Wilf Perkins (series 2 onwards)"]}, {"page": "Watt on Earth", "response": ["The show centres around the titular character Watt (Garth Napier Jones); an extraterrestrial with, by human standards, an odd taste in food, and the ability to transanimateobjectify. He comes to Earth to flee his evil uncle: Watt is heir to the throne on his home planet, and his uncle (voice: Michael Kilgarriff) had sent his top henchman Jemadah (John Grillo) to follow and kill Watt. The planet's previous heirs, Watt's parents, are mentioned by Watt as having died in a mysterious 'accident' while on the way to their coronation, which was no doubt caused by the uncle. While Watt is over 300 years of age, he appears to be a human in his early twenties.", "*Mr Jemadah/Jemadah - John Grillo"]}, {"page": "Bells (Blackadder)", "response": ["*John Grillo as Dr. Leech"]}, {"page": "Danny, the Champion of the World (film)", "response": ["|John Grillo || Mr Parker (Social Worker)"]}, {"page": "The Tooth of Crime", "response": ["*Doc – John Grillo"]}, {"page": "Brideshead Revisited (TV serial)", "response": ["* John Grillo as Mr. Samgrass"]}, {"page": "Shackleton (TV serial)", "response": ["* John Grillo as Franks"]}, {"page": "Portable Theatre Company", "response": ["In 1971, Portable were awarded an £8000 subsidy from the Arts Council. Although ‘they could now afford to pay themselves to run the company’ neither  Bicât nor Hare wanted that jobBicat, Tony etc and rather than giving the money back they appointed  Malcolm Griffiths to become the company’s artistic director.The Stage, 22 April 1971 Bicât and Hare also knew Griffiths from Cambridge. He had then worked for four years in repertory theatre where he had become disillusioned by what he saw as their ‘reactionary’ programming '…. I told them exactly what I thought’.Ansorge, Peter, p.20 He began his season with Portable in April directing two new John Grillo plays, Zonk and Food at Edinburgh, London, Nottingham, the Midlands, Yorkshire, the South West and East Anglia."]}, {"page": "Mother Love (TV series)", "response": ["*John Grillo, Carl Duering as Art Critics"]}, {"page": "Germaine Greer", "response": ["As soon as she arrived, Greer auditioned (with Clive James, whom she knew from the Sydney Push) for the student acting company, the Footlights, in its club room in Falcon Yard above a Mac Fisheries shop. They performed a sketch in which he was Noël Coward and she was Gertrude Lawrence. Joining on the same day as James and Russell Davies,\"Pete & Clive\", BBC Radio 4, 9 November 2015, from 00:06:43. Greer was one of the first women to be admitted as a full member, along with Sheila Buhr and Hilary Walston. The Cambridge News carried a news item about it in November 1964, referring to the women as \"three girls\". Greer's response to being accepted was reportedly: \"This place is jumping with freckle-punchers. You can have it on your own.\" She did take part in its 1965 revue, My Girl Herbert, alongside Eric Idle (the Footlights president), John Cameron, Christie Davies and John Grillo. A critic noticed \"an Australian girl who had a natural ability to project her voice\". Other members of the Footlights when she was there included Tim Brooke-Taylor, John Cleese, Peter Cook and David Frost."]}, {"page": "Blame It on the Bellboy", "response": ["| John Grillo"]}, {"page": "Primetime Emmy Award for Outstanding Cinematography for a Single-Camera Series (One Hour)", "response": ["| John Grillo"]}, {"page": "Darío Suro", "response": ["Among the artists befriended by Suro in New York City were Fritz Glarner, Ronnie Elliott, Jean Arp, Stuart Davis, Adolf Fleischmann, Minna Citron, Bud Hopkins, Burgoyne Diller, Philip Guston, Charmion von Wiegand, John Grillo, Jean Xceron, Judith Rothschild, Lil Picard, Esteban Vicente, Raymond Hendler, John Hultberg and Lynne Drexler."]}, {"page": "Scorpion Tales", "response": ["| colspan=\"5\" | David Robb (Lieutenant James White), Stephen Murray (Commodore Jacobs), Norman Jones (Major Chadwick), Rosie Kerslake (Penny), Graham Ashley (Captain Sutton), Eric Mason (Warrant Officer Watson), John Grillo (Ministry Official), Al Lampert (Mechanic), Cornelius Garrett (Young Officer), John Dawson (Waiter), Lewis Wilson (Train Passenger), David Arlen (Leading Rating)"]}, {"page": "List of former Footlights members", "response": ["| John Grillo || 1942 || — || Actor, playwright"]}, {"page": "The Good Soldier (1981 film)", "response": ["* John Grillo as Herr Schontz"]}, {"page": "Provincetown Arts", "response": ["* John Grillo"]}, {"page": "Max and Helen", "response": ["*John Grillo as Joseph Weiss"]}, {"page": "Trust (1999 film)", "response": ["* John Grillo as Dr. Ian Matthews"]}, {"page": "Grillo, John", "response": ["#redirectJohn Grillo"]}, {"page": "Strangers and Brothers (TV series)", "response": ["* John Grillo as Arthur Brown 3 episodes)"]}, {"page": "Amy (1984 film)", "response": ["* John Grillo as Bell"]}]}}