{"wiki_id": "http://www.wikidata.org/entity/Q6236260", "itemLabel": "John Gregory", "itemDescription": "Player of American and Canadian football", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Gregory_(American_football_coach)", "wikipedia_page": {"main": "John Gregory (born November 22, 1938) is a former American football head coach. Gregory's last head coaching stint came with the Iowa Barnstormers of the Arena Football League.", "link_mentions": [{"page": "Saskatchewan Roughriders", "response": ["After a carousel of head coaches since John Payne's departure in 1977, the Roughriders hired John Gregory after the 1986 season. Gregory took over a team that had missed the playoffs for ten consecutive seasons. Before the 1987 season started, after almost a decade out of the playoffs and poor attendance saddling the team, the Roughriders felt it was necessary to conduct a telethon to keep the team afloat; the Montreal Alouettes had recently folded early in the season, and the Riders were determined not to let the same fate befall them. The province-wide \"Save the Roughriders\" telethon was a success in that the team sold enough tickets to keep the team in operation. Also in 1986, team executive Tom Shepherd founded the group \"Friends of the Riders\" to run an annual Touchdown Lottery to further bolster the club's finances. Originally conceived as a one-time fundraiser, it raised almost $22.6 million during its run and operated for 33 years. By the time the lottery was discontinued with Shepherd's retirement in 2019, the club's financial situation had long been stabilized.", "* John Gregory (1987–1991)", "| 1990 || John Gregory || 9 || 9 || 0 || 18 || 557 || 592 || 7–2 || 2–7 || 4–6 || 3rd || Lost West Semi-Final 43–27 to Edmonton"]}, {"page": "New York Dragons", "response": ["|John Gregory"]}, {"page": "ArenaBowl", "response": ["|John Gregory || 2 || 0 || 2 ||  || Iowa Barnstormers || 1996, 1997"]}, {"page": "Carolina Cobras", "response": ["They played their home games in Raleigh, North Carolina, at the Raleigh Entertainment & Sports Arena (now called the PNC Arena) prior to the 2003 season. The team was based in the Charlotte Coliseum through 2004. Coaching staff included: Ed Khayat, John Gregory, Ron Selesky, Ray Jauch. On September 20, 2004, prior to the arrival of the NBA's Charlotte Bobcats, the league announced the termination of this franchise; its players were made available to the other AFL teams in a dispersal draft."]}, {"page": "Hamilton Tiger-Cats", "response": ["*John Gregory (1991–1994)", "*John Gregory (1993–1994)"]}, {"page": "Iowa Barnstormers", "response": ["Behind the strength of AFL Coach of the Year John Gregory, the Barnstormers raced to a 3–0 start and secured the 5th seed for the playoffs. After upsetting defending ArenaBowl champion Arizona, 56–52, in their first playoff game, the Barnstormers fell, 56–49, to 6th-seeded Orlando in the semifinals.", "| align=left | John Gregory || –– || 82 || 57 || 0 ||  || 7 || 6 || align=left |"]}, {"page": "Annis Stukus Trophy", "response": ["*  – John Gregory, Saskatchewan Roughriders"]}, {"page": "Matt Nagy", "response": ["Without any opportunities in the NFL, Nagy tried out for the New York Dragons of the Arena Football League. There, he caught the eye of head coach John Gregory, who likened him to his former Iowa Barnstormers star and Pro Football Hall of Fame quarterback Kurt Warner as the two were comparable in size, possessed the ability to throw while running, and shared similar leadership qualities. Gregory was also close with Raymond and formerly ran the Wing T offense, further supporting his decision to sign Nagy. The Dragons offered him a three-year contract, though agent Art Weiss opted for a two-year deal."]}]}}