{"wiki_id": "http://www.wikidata.org/entity/Q6239482", "itemLabel": "John Hodgetts-Foley", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hodgetts-Foley", "wikipedia_page": {"main": "John Hodgetts Hodgetts-Foley (17 July 1797 – 13 November 1861), born John Hodgetts Foley, of Prestwood House (then in Kingswinford, and now in Kinver) in Staffordshire was a British MP.\nHe was the second son of the Hon. Edward Foley of Stoke Edith, Herefordshire and his wife Eliza Maria Foley Hodgetts.  He inherited the Prestwood estate from his mother, whose mother Eliza Foley was a descendant of Philip Foley.\nHe represented the borough of Droitwich in Parliament from 1822 to 1835 as a Whig and East Worcestershire from 1847 to 1861 (initially as a Whig and from 1859 as a Liberal).\nHe married Charlotte Margaret Gage, daughter of John Gage and Mary Milbanke and granddaughter of General Thomas Gage and Margaret Kemble, on 20 October 1825. Their son was Henry John Wentworth Hodgetts-Foley", "link_mentions": [{"page": "1797", "response": ["** John Hodgetts-Foley, British Member of Parliament (d. 1861)"]}, {"page": "List of political families in the United Kingdom", "response": ["******* John Hodgetts-Foley (1797–1861), MP 1822–1835 1847–1861. Son of Edward."]}, {"page": "Kinver", "response": ["* John Hodgetts-Foley (1797 Prestwood House, Kinver – 1861) a British MP.HANSARD 1803–2005, People (F), Mr John Foley, 1797 - 1861 retrieved 8 June 2018"]}, {"page": "List of MPs elected in the 1852 United Kingdom general election", "response": ["|John Hodgetts-Foley||Liberal"]}, {"page": "1861 in the United Kingdom", "response": ["** John Hodgetts-Foley, politician (born 1797)"]}, {"page": "1797 in Great Britain", "response": ["* 17 July – John Hodgetts-Foley, Member of Parliament (died 1861)"]}, {"page": "Droitwich (UK Parliament constituency)", "response": ["|rowspan=\"2\"| John Hodgetts-Foley", "| John Hodgetts-Foley"]}, {"page": "East Worcestershire (UK Parliament constituency)", "response": ["|rowspan=\"3\"| John Hodgetts-Foley"]}, {"page": "John Hodgetts Hodgetts-Foley", "response": ["#REDIRECT John Hodgetts-Foley"]}, {"page": "List of MPs elected in the 1857 United Kingdom general election", "response": ["|John Hodgetts-Foley||Liberal"]}, {"page": "John Hodgetts Hodgetts Foley", "response": ["#REDIRECT John Hodgetts-Foley"]}, {"page": "List of United Kingdom by-elections (1857–1868)", "response": ["|John Hodgetts-Foley"]}, {"page": "Prestwood (Kinver)", "response": ["Philip Foley rebuilt the house as a mansion, which remained the family home of his descendants for over 250 years, passing to his son Paul, his grandson William, and great grandson (also William).  On the death of the great-grandson, it passed to his sister Elizabeth Foley, who married John Hodgetts of Shut End.  Their only child Eliza Maria Foley Hodgetts in 1790 married her distant cousin Hon. Edward Foley.   Under their marriage settlement the Prestwood estate passed to her second son John Hodgetts-Foley and then to his son Henry Hodgetts-Foley.  Henry's son Paul Henry Foley inherited the Stoke Edith estate on the death of Lady Emily Foley, but sold most of the Prestwood estate in the 1920s.The descent from the 1670s is much the same as the manor of Kinver: Victoria County History: Staffordshire, XX, 130."]}, {"page": "Hodgetts", "response": ["* John Hodgetts-Foley"]}, {"page": "Sir Harry Vernon, 1st Baronet", "response": ["Vernon was elected Liberal MP for East Worcestershire at a by-election in 1861—caused by the death of John Hodgetts-Foley—and held the seat until 1868 when he did not seek re-election."]}, {"page": "Hodgetts-Foley, John", "response": ["#redirectJohn Hodgetts-Foley"]}]}}