{"wiki_id": "http://www.wikidata.org/entity/Q6238133", "itemLabel": "John Harvey", "itemDescription": "English actor (1911-1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Harvey_(actor)", "wikipedia_page": {"main": "John Harvey (27 September 1911 – 19 July 1982) was an English actor. He appeared in 52 films, two television films and made 70 television guest appearances between 1948 and 1979.\nBorn in London, England, he began his acting career on the stage in the 1930s as one of the Harry Hanson's Court Players at the Peterborough Repertory. While there, he met the actress Diana King.\nHarvey and King were married, remaining together for more than forty years, until his death.\nDuring the Second World War, he was commissioned in the Royal Air Force. Post-war, he performed at the Theatre Royal in Drury Lane, London, for some six years, during the entire West End runs of Rodgers and Hammerstein's South Pacific and The King and I.\nHarvey's film debut was in the role as Eddie in the British crime drama A Gunman Has Escaped (1948), in which he was the leading star. Harvey then moved to character roles and five films later played Inspector Loomis in Hitchcock's Stage Fright (1950) starring Jane Wyman and Richard Todd. His next role was as Bland in the drama Chance of a Lifetime (1950).Harvey's television debut was as Angelo Verona in the BBC film On the Spot (1948). He played Buster Cox in the United Artists film noir crime/thriller The Man with My Face (1951) starring Barry Nelson.Among his guest appearances on series television was his role as Sir William Duffy in Dr. Finlay's Casebook (1962) and two Doctor Who appearances – Professor Brett in The War Machines (1966), and Officia in The Macra Terror (1967), all for the BBC.John Harvey died at age 70 in Henley-on-Thames, Oxfordshire.", "link_mentions": [{"page": "1911", "response": ["* September 27 – John Harvey, American actor (d. 1982)"]}, {"page": "1982", "response": ["** John Harvey, American stage and film actor (b. 1911)"]}, {"page": "Two-Way Stretch", "response": ["* John Harvey as Governor Rockhampton Prison"]}, {"page": "1982 in film", "response": ["| style=\"text-align:center;\"| 19 || John Harvey || style=\"text-align:center;\"| 70 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "Armstrong Circle Theatre", "response": ["| August 15, 1950 || \"Ring Around My Finger\" || Patricia Wheel, John Harvey, Joanne Dolan, Lucille Patten, Jack Sherry, Willis Townsend, John Marley, Elaine Williams"]}, {"page": "Randall and Hopkirk (Deceased)", "response": ["*John Harvey"]}, {"page": "X the Unknown", "response": ["* John Harvey as Major Cartwright"]}, {"page": "The War Machines", "response": ["Sandra Bryant appeared in The Macra Terror, as did John Harvey. John Rolfe later played Sam in The Moonbase and Fell in The Green Death. Frank Jarvis later played Ankh in Underworld and Skart in The Power of Kroll."]}, {"page": "Comedy Playhouse", "response": ["View by Appointment (3 May 1968) starring Beryl Reid, Hugh Paddick, Derek Fowlds, Pauline Collins and John Harvey. This was the pilot episode for the BBC series, Wink to Me Only."]}, {"page": "The Wednesday Play", "response": ["| Henry McGeeJohn HarveySuzanne MocklerDerek FrancisPamela Ann Davy", "| Tom AdamsGriffith DaviesBen HowardGeorge SewellFrank JarvisJune MurphyPeter DucrowJohn Harvey"]}, {"page": "Theatre 625", "response": ["|Sonia Fraser,Stanley Meadows,Margery Mason,John Allison,John Harvey,Stella Tanner,Hilda Kriseman,Patrick O'Connell,Jeremy Bulloch,Jack Wild"]}, {"page": "Private's Progress", "response": ["* John Harvey as RAF officer at headquarters (uncredited)"]}, {"page": "Play of the Month", "response": ["|Virginia McKenna,Pamela Brown,Derek Godfrey,Peter Cellier,Fanny Rowe,Walter Fitzgerald,John Harvey,Bernard Hepton,Tony Steedman"]}, {"page": "The Man with My Face (film)", "response": ["* John Harvey as Buster Cox"]}, {"page": "The Kiss of the Vampire", "response": ["* John Harvey as Police sergeant"]}, {"page": "The Macra Terror", "response": ["Peter Jeffrey later played Count Grendel in The Androids of Tara (1978). Sandra Bryant had previously played Kitty in The War Machines (1966) and John Harvey played Professor Brett in the same serial. Gertan Klauber had previously appeared in The Romans (1965) and Graham Leaman would later appear in Fury from the Deep (1968) and again in The Three Doctors (1973).https://www.radiotimes.com/tv/sci-fi/doctor-who-guide/the-three-doctors/"]}, {"page": "The Wrong Arm of the Law", "response": ["In London, a gang of criminals from Australia led by Jack Coombes (Bill Kerr) impersonate policemen to carry out robberies. Local gang leader \"Pearly\" Gates (Sellers), who operates from the cover of a French couturier, finds his takings cut severely, and blames rival crook \"Nervous\" O'Toole (Bernard Cribbins). When it emerges that they are both being scammed by the same gang, they join forces, along with Lionel Jeffries' Police Inspector \"Nosey\" Parker, to bring the so-called \"I.P.O. mob\" (I.P.O. - Impersonating a Police Officer) to justice. Nanette Newman provides the love interest, John Le Mesurier plays a senior policeman, and a young Michael Caine has a small and uncredited role as a young PC. Other uncredited roles include John Junkin (Maurice), Dennis Price (Educated Ernest), Cardew Robinson (Postman), Dick Emery (Man in Flat 307), Mario Fabrizi (Van Driver), John Harvey (Police Station Sergeant), Harold Siddons (PC in Basement Garage), Jack Silk (Police Station PC), Derek Guyler (non-speaking PC at Scotland Yard), Gerald Sim (Airfield Official) and Marianne Stone (“The bird in the front row” at Gangsters' Meeting)."]}, {"page": "Twisted Nerve", "response": ["* John Harvey as Store Detective 2"]}, {"page": "Tunes of Glory", "response": ["* John Harvey as Sergeant Finney"]}, {"page": "The Satanic Rites of Dracula", "response": ["* John Harvey as the Commissionaire"]}, {"page": "John Harvey", "response": ["John Harvey may refer to:", "*John Harvey (racing driver) (1938–2020), winner of the 1983 Bathurst 1000", "*John Harvey (cricketer) (1939–2003), English cricketer", "*John Harvey (rugby league) (born 1955), Australian rugby league player and coach", "*John Harvey (American football) (born 1966), National Football League running back", "*John Harvey (Canadian football) (born 1950), Canadian Football League running back", "*John Harvey (football manager), manager of Heart of Midlothian F.C. 1966–1970", "*John Harvey (footballer, fl. 1890–1900), Scottish footballer (Sunderland AFC)", "*John Harvey (footballer, born c. 1934), Scottish footballer (Partick Thistle)", "*John Harvey (cyclist), English Cyclist (Born 1884)", "*John Harvey (Virginia governor) (died 1646), 17th-century Crown governor of Virginia", "*John Harvey (Albemarle) (died 1679), Governor of Colonial North Carolina", "*John Harvey (North Carolina politician) (died 1775), 18th-century Speaker of the North Carolina House of Representatives ", "*John Harvey (British Army officer) (1778–1852), officer during the War of 1812 and Governor of several Canadian provinces", "*John Harvey (Australian politician) (1823–1893), politician in the early days of South Australia, founder of the town of Salisbury", "*John Harvey (British politician) (1920–2008), British Conservative MP for Walthamstow East", "*John Harvey (Royal Navy officer, born 1772) (1772–1837), long serving Royal Navy officer", "*John Harvey (Royal Navy officer, born 1740) (1740–1794), long serving naval officer killed at the Glorious First of June", "*John Harvey (RAAF officer) (born 1954), current serving RAAF Air Marshal", "*John Harvey (actor) (1911–1982), English stage and film actor", "*John Harvey (American actor) (1917–1970), American actor", "*Harvey (announcer) (John Harvey, born 1951), American television and radio personality", "*John Harvey (author) (born 1938), British author of crime fiction", "*John Harvey (ironfounder), partner in Harveys of Hayle, late-18th-century ironfounders, father-in-law of Richard Trevithick", "*John Harvey (astrologer) (1564–1592), English astrologer and physician", "*John Harvey (historian) (1911–1997), British architectural historian, who wrote on English Gothic architecture and architects", "*John Harvey (psychologist) (born 1943), American psychologist", "*SS John Harvey, a 1942 Second World War Liberty ship", "*Sir John Harvey-Jones (1924–2008), British businessman, chairman of ICI, then presenter of BBC TV show Troubleshooter"]}, {"page": "Hell Is a City", "response": ["* John Harvey as Fingerprint Officer (uncredited)"]}, {"page": "Horrors of the Black Museum", "response": ["* John Harvey as Man in Bookshop"]}, {"page": "The Scarlet Blade", "response": ["* John Harvey as Sgt. Grey  "]}, {"page": "The Deadly Bees", "response": ["* John Harvey as Thompson"]}, {"page": "Legend of the Werewolf", "response": ["* John Harvey as Prefect of Police"]}, {"page": "Comedy Playhouse (series 2)", "response": ["| style=\"font-size: 100%;\" |Lionel Hogg (played by Alfred Marks) is an unemployed, but highly qualified machine minder who is given a temporary job as handyman at a health clinic. Also starring Anthony Sharp as Dr Dennison, Damaris Hayman as Matron, Frank Williams as the Labour Exchange clerk, Edwin Apps as the first card player, Julian Orchard as the second card player and John Harvey."]}, {"page": "Double Bunk", "response": ["* John Harvey as Johnnie "]}, {"page": "Angels One Five", "response": ["* John Harvey as SWO (Station Warrant Officer) "]}, {"page": "Rings on Their Fingers", "response": ["|John Harvey"]}, {"page": "List of British films of 1951", "response": ["|Files from Scotland Yard||Anthony Squire||John Harvey, Moira Lister||Crime||"]}, {"page": "The Old Dark House (1963 film)", "response": ["*John Harvey as Club Receptionist"]}, {"page": "Mildred Roper", "response": ["After George and Mildred move into their new home, they are invited for a welcoming drink by the Fourmiles, but Jeffrey doesn't want them around by the time the Fourmiles' dinner guests arrive - the local Conservative MP (Diana King), and her husband (John Harvey). George doesn't want to go and has a rare bath instead. Unfortunately, when Mildred goes home, she finds George has accidentally locked them out and left the bathwater running. Mildred later gets a job as a secretary in Jeffrey's estate agency. George is thus the house husband but he is a disastrous cook and home-maker. Mildred is relieved when he finally gets a job, but less so when she discovers it is as a night-watchman, and he will be away all night; thankfully, he leaves the job soon after. Having baby-sat Tristram for Ann and Jeffrey while they go out for the night, Mildred is broody and wants a child of her own. George is less keen but is persuaded to apply for adoption. His crassness and the Ropers' age means that the adoption agency turns them down, but instead, George buys Mildred a Yorkshire Terrier called Truffles (Mildred later registers her with the kennel club as \"Truffles duBorbon Fitzwilliam III\"). When the Fourmiles go on holiday to Scotland,  Mildred is given the key to their house so she can water their plants, but George abuses this by going in to watch the couple's superior colour television. Mildred has asked George to decorate their lounge but George calls in professionals - who follow him into the Fourmiles' house, wrongly assuming that this is where the re-decoration is needed. George and Mildred have to put the resultant unwanted make-over back to normal."]}, {"page": "Doctor at Large (TV series)", "response": ["Dr Upton is asked by Dr Maxwell to give sex education classes at the local all-girls school and becomes over-popular with the teenage pupils. With Barbara Mitchell as a teacher, Cathy Collins as Carol and John Harvey as Carol's father."]}, {"page": "Castle in the Air (film)", "response": ["* John Harvey as Andrews"]}, {"page": "Chance of a Lifetime (1950 film)", "response": ["*John Harvey as Bland"]}, {"page": "Cairo Road (film)", "response": ["* John Harvey as Major Maggoury"]}, {"page": "They Came from Beyond Space", "response": ["* John Harvey as Bill Trethowan"]}]}}