{"wiki_id": "http://www.wikidata.org/entity/Q6231739", "itemLabel": "John Emburey", "itemDescription": "English Test and County cricketer (born 1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Emburey", "wikipedia_page": {"main": "John Ernest Emburey (born 20 August 1952) is a former English first-class cricketer who played for Middlesex, Northamptonshire, Western Province, Berkshire and England.\nAccording to cricket writer Colin Bateman, Emburey's participation in two South African rebel tours \"cost him six lost years as far as Test cricket was concerned... and, more significantly, probably an extended run as England captain, a job for which he was better suited than some who held the position post-Mike Brearley\".", "link_mentions": [{"page": "The Ashes", "response": ["In 1982–83 Australia had Greg Chappell back from WSC as captain, while the England team was weakened by the enforced omission of their South African tour rebels, particularly Graham Gooch and John Emburey. Australia went 2–0 up after three Tests, but England won the Fourth Test by 3 runs (after a 70-run last wicket stand) to set up the final decider, which was drawn.Harte, pp. 636–637.", "The Australian team of 1989 was comparable to the great Australian teams of the past, and resoundingly defeated England 4–0.Harte, pp. 679–682. Well led by Allan Border, the team included the young cricketers Mark Taylor, Merv Hughes, David Boon, Ian Healy and Steve Waugh, who were all to prove long-serving and successful Ashes competitors. England, now led once again by David Gower, suffered from injuries and poor form. During the Fourth Test news broke that prominent England players had agreed to take part in a \"rebel tour\" of South Africa the following winter; three of them (Tim Robinson, Neil Foster and John Emburey) were playing in the match, and were subsequently dropped from the England side."]}, {"page": "Northamptonshire County Cricket Club", "response": ["* John Emburey"]}, {"page": "3AW", "response": ["* John Emburey"]}, {"page": "Navjot Singh Sidhu", "response": ["Sidhu was recalled when England toured India later that season. He made his third Test hundred in the Second Test in Madras, scoring 106 off 273 balls while opening the innings. He struck a partnership with Tendulkar who made 165 taking their team to 560 before declaration. India went on to win the match and the series. Sidhu particularly attacked spinner John Emburey in his innings that included nine fours. He aggregated 235 in the series at 58.75. Sidhu was India's best performer in the ODI series that followed, scoring 287 runs at 57.40. He played two match-winning knocks: a 76 in Chandigarh followed by an unbeaten 134 in Gwalior. He received man of the match awards for both performances. The latter innings followed after India were down having lost two wickets with 4 runs on the board. Sidhu put together a 175-run stand with Mohammad Azharuddin for the third wicket. En route to his century, Sidhu passed 2,000 runs in ODIs. After India's series-leveling victory in the final game, Sidhu was given the man of the series award."]}, {"page": "Wisden Cricketers of the Year", "response": ["|  John Emburey"]}, {"page": "Middlesex County Cricket Club", "response": ["Strong 1974 winning side included a batting line-up of international players in Roland Butcher,cricketarchive.com. Ian Gould, Phillipe-Henri Edmonds, John Emburey, Mike Gatting, Graham Barlow, and Larry Gomes.The club also won the Under 25 Warwick Pool Championship the same year.", "Middlesex's most successful period coincided with the captaincies of Mike Brearley and Mike Gatting from 1971 to 1997. Brearley proved as astute for his county as he did for his country between 1971 and 1982. His team included Gatting and England spin bowlers John Emburey and Phil Edmonds, and overseas fast bowlers such as Wayne Daniel.", "| John Emburey || 1,250 (1973–1995)"]}, {"page": "List of England cricket captains", "response": ["| 66 || John Emburey || 1988 || || West Indies || England || 2 || 0 || 2 || 0", "| 15 || John Emburey || 1987 || 4 || 2 || 0 || 2 || 0"]}, {"page": "Ken Barrington", "response": ["The English WSC players were unavailable so youngsters like Ian Botham, Phil Edmonds, David Gower, Graham Gooch and John Emburey were on the tour with the old hands Mike Brearley, Geoff Boycott, Bob Willis and Bob Taylor. This gave them an advantage over Australia who had no experienced players in their team, though they had the young batsmen Allan Border and Kim Hughes and the fast bowler Rodney Hogg, who took a record 41 wickets (12.85). The batting was poor throughout the series on both sides, a concern for Barrington, but England won 5–1 and there were no other problems."]}]}}