{"wiki_id": "http://www.wikidata.org/entity/Q6234171", "itemLabel": "John Freeborn", "itemDescription": "British flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Freeborn", "wikipedia_page": {"main": "John Connell Freeborn,  (1 December 1919 – 28 August 2010) was a fighter pilot and flying ace in the Royal Air Force (RAF) during the Second World War.\nIn 1939, he shot down another RAF fighter in a friendly-fire incident that marked the first death of an RAF fighter pilot in the war, as well as the Supermarine Spitfire's first aerial victory. The following year, he flew more operational hours than any other RAF pilot during the Battle of Britain.", "link_mentions": [{"page": "Sailor Malan", "response": ["No. 74 Squadron saw its first action only 15 hours after war was declared, sent to intercept a bomber raid that turned out to be returning RAF planes. On 6 September 1939, \"A\" Flight was scrambled to intercept a suspected enemy radar track and ran into the Hurricanes of No. 56 Squadron RAF. Believing 56 to be the enemy, Malan ordered an attack. Paddy Byrne and John Freeborn downed two RAF aircraft, killing one officer, Montague Hulton-Harrop, in this friendly fire incident, which became known as the Battle of Barking Creek. At the subsequent courts-martial, Malan denied responsibility for the attack. He testified for the prosecution against his own pilots stating that Freeborn had been irresponsible, impetuous, and had not taken proper heed of vital communications. This prompted Freeborn's counsel, Sir Patrick Hastings to call Malan a bare-faced liar. Hastings was assisted in defending the pilots by Roger Bushell, who, like Malan, had been born in South Africa. A London barrister and RAF Auxiliary pilot, Bushell later led the Great Escape from Stalag Luft III. The court ruled the entire incident was an unfortunate error and acquitted both pilots.", "On the ground, Malan earned a reputation as an inveterate gambler who often owed his subordinates money. Malan was older than most of his charges and although sociable and relaxed off-duty, he spent most of his time with his wife and family living near Biggin Hill. He soon developed a flying routine of leading the first sortie of the day, then handing the squadron to a subordinate while he stayed on the ground to perform the Squadron commander's administration. Despite frosty relations after the Battle of Barking Creek he would often give command of the squadron to John Freeborn (himself an ace), showing Malan's ability to keep the personal and professional separate."]}, {"page": "No. 74 Squadron RAF", "response": ["At the outbreak of war, No. 74 (F) Squadron was operating from RAF Rochford, a satellite aerodrome of RAF Hornchurch. On 6 September 1939, after an early morning air raid alert, a flight of No. 56 (F) Squadron Hawker Hurricanes took off from North Weald. These were followed by two reserve Hurricanes. The two reserves were identified as enemy aircraft and Spitfires from RAF Hornchurch, among them No. 74 (F) Squadron, were ordered to attack them. Both were shot down. One pilot, P/O Montague Hulton-Harrop was killed; the other pilot, Frank Rose, survived. The pilot who fired the fatal shots was No. 74 (F) Squadron's John Freeborn. ", "*John Freeborn – 12 kills, 1 probable, 5 damaged, was with his squadron longer than any other Battle of Britain pilot and had flown more operational hours."]}, {"page": "Roger Bushell", "response": ["Although Bushell was pursuing a career with the RAF, he was not hampered in his attempts to become a barrister-at-Law of Lincolns Inn, London. From the outset of his legal career, many commented on his ability as a lawyer, particularly in criminal defense. After a period, Bushell was appointed to military cases in prosecuting RAF personnel charged with various offenses. These often involved pilots charged with dangerous flying. In October 1939, acting as assistant to Sir Patrick Hastings, he successfully defended two RAF pilots, John Freeborn and Paddy Byrne, court-martialled after the friendly fire incident known as the Battle of Barking Creek. Byrne would later be incarcerated"]}, {"page": "RAF Montrose", "response": ["*Wing Commander John Freeborn DFC*"]}, {"page": "Battle of Barking Creek", "response": ["With everyone in the air expecting to see enemy aircraft and no experience of having done so, 'A' Flight of 74 Squadron saw what they believed were German aeroplanes, and their commander, Adolph \"Sailor\" Malan, allegedly gave an order to engage. Two of the three, Flying Officer Vincent 'Paddy' Byrne and Pilot Officer John Freeborn, opened fire. Malan later claimed to have given a last-minute call of \"friendly aircraft – break away!\", but, if this was true, it was not heard by Byrne and Freeborn. Richard Hough and Denis Richards wrote that further losses were prevented by the 151 Squadron commanding officer, Squadron Leader Edward Donaldson, who alerted his pilots that the attacking aircraft were British and gave the order not to retaliate.", "Frank Rose and Pilot Officer Montague Hulton-Harrop were shot down, and Hulton-Harrop was killed. Fired upon by John Freeborn, he had been hit in the back of the head and was dead before his Hurricane crashed at Manor Farm, Hintlesham, Suffolk, about  west of Ipswich. Hulton-Harrop was the first British pilot killed in the war, and his Hurricane was the first aircraft shot down by a Spitfire. A Spitfire was shot down by British anti-aircraft fire.", "The court martial of John Freeborn and Paddy Byrne at Bentley Priory, the headquarters of Fighter Command, was held in camera. In 2019, The National Archives released limited records, previously restricted, including the Operations Record Books of the relevant RAF Fighter Squadrons and certain court documents. The court martial transcript has not been released  According to Bill Nasson in a 2009 publication, it is well known that Freeborn felt that his commanding officer, Sailor Malan, tried to evade responsibility for the attack. Malan testified for the prosecution against his pilots, stating that Freeborn had been irresponsible, impetuous and had not taken proper heed of vital communications. During the trial, Freeborn's counsel, Sir Patrick Hastings, called Malan a bare-faced liar.", "Paddy Byrne was shot down and captured over France in 1940. He was detained at Stalag Luft III with his former defence lawyer Roger Bushell. In 1944 he was repatriated, having convinced the Germans and the repatriation board that he was mad. On his return to England he was reinstated into the RAF and given a ground position. John Freeborn flew more operational hours in the Battle of Britain than any other pilot, remained on operations for the rest of the war and proved to be an outstanding airman. He was awarded the Distinguished Flying Cross and bar and rose to wing commander. Freeborn finally told some of his version of events in a 2002 biography A Tiger's Tale, before co-authoring a more complete account in Tiger Cub. In 2009, Freeborn told an interviewer of his regret about Hulton-Harrop's death, saying, \"I think about him nearly every day. I always have done... I've had a good life, and he should have had a good life too\". Freeborn was twice married, first in 1941 to Rita Fielder, who died in 1979, and then Peta in 1983, who died in 2001. Freeborn died on 28 August 2010 and was survived by a daughter from his first marriage."]}, {"page": "1919 in the United Kingdom", "response": ["* 1 December – John Freeborn, World II air ace (died 2010)"]}, {"page": "Leeds Grammar School", "response": ["* John Freeborn (b. 1919) - Battle of Britain RAF pilot"]}]}}