{"wiki_id": "http://www.wikidata.org/entity/Q6248269", "itemLabel": "John McQuade", "itemDescription": "British politician (1911-1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_McQuade", "wikipedia_page": {"main": "John McQuade (9 August 1911 – 19 November 1984), known as Johnny McQuade, was a Northern Ireland politician.  He was a professional boxer under the name of Jack Higgins.\nAfter serving with the British Army in Dunkirk and Burma, he was an Ulster Unionist Party (UUP) member of Belfast City Council from 1955 to 1972.  He was a UUP Member of the House of Commons of Northern Ireland for Belfast Woodvale (Greater Shankill) from 1965 to October 1971, when he resigned from the UUP and joined the Democratic Unionist Party. On 28 March 1972 (the last day the Parliament sat), he resigned his parliamentary seat in protest at the prorogation of the Parliament.In February 1972, in response to the escalating violence in Northern Ireland, he called for the British security forces to take over the town of Newry and for the border with the Republic of Ireland to be closed, stating his belief that the Roman Catholic Church controlled the government of the Republic of Ireland.He contested the February and October 1974 Westminster elections unsuccessfully for Belfast West. He was elected as the Member of Parliament for Belfast North in 1979, aged 67, and served until 1983, when he retired. He died on 19 November 1984, aged 73.", "link_mentions": [{"page": "August 9", "response": ["*  1911   – John McQuade, Northern Irish soldier, boxer, and politician (d. 1984)"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|John McQuade"]}, {"page": "Cecil Walker", "response": ["He became actively involved in Unionist politics in the 1970s, was an unsuccessful pro-White Paper Unionist candidate at the election to the 1973 Northern Ireland Assembly and was elected to Belfast City Council in 1977.Northern Ireland elections  He contested the Belfast North constituency in the 1979 general election, narrowly losing to John McQuade of the Democratic Unionist Party.  He won the seat 4 years later, in the 1983 general election, after McQuade retired. He was one of the MPs with the lowest attendance rate at Westminster."]}, {"page": "Belfast North (UK Parliament constituency)", "response": ["| John McQuade"]}, {"page": "Shankill Road", "response": ["A Belfast Shankill constituency also returned a member to the Parliament of the United Kingdom from 1918–1922, with Labour Unionist Samuel McGuffin holding the seat. The areas south of the road were covered by the Belfast Woodvale seat at Westminster and a seat of the same name at Stormont. Robert John Lynn of the Irish Unionist Alliance represented the seat at Westminster for the entirety of its existence (1918–1922). The Stormont seat was held by John William Nixon (independent Unionist) from 1929 to 1950, Ulster Unionists Robert Harcourt (1950–1955) and Neville Martin (1955–1958), Billy Boyd of the Northern Ireland Labour Party until 1965 then finally John McQuade, who was variously Ulster Unionist, independent Unionist and Democratic Unionist until the seat was abolished in 1972."]}, {"page": "Glenn Barr", "response": ["Always something of a maverick within Unionist politics, Barr served a three-month suspension from the United Ulster Unionist Council (UUUC) after endorsing the candidacy of Ken Gibson of the Volunteer Political Party for West Belfast in the October 1974 general election despite the Democratic Unionist Party's John McQuade representing the UUUC. During his suspension Barr was part of a UDA delegation that made a fund-raising trip to Libya where they met with Muammar Gaddafi. Barr claimed when he returned that Gaddafi, who at the time was funding the Provisional IRA, had expressed a firm interest in providing money for an independent Northern Ireland. The trip however, on which Barr was accompanied by Tommy Lyttle, Andy Robinson and Harry Chicken, was widely condemned by unionist politicians because of the purportedly left-wing nature of the Gaddafi regime whilst the same reason was used a basis by Charles Harding Smith to launch a loyalist feud against UDA leader Andy Tyrie, whose idea the trip had been.McDonald & Cusack, UDA, pp. 84–86 In the course of this feud, Harding Smith placed Barr under a death threat, although nothing came of this as the pro-Tyrie forces quickly dispatched the challenge of Harding Smith.McDonald & Cusack, UDA, p. 87"]}, {"page": "George Seawright", "response": ["Seawright was noted for his fiery rhetoric. He was elected to Belfast City Council in 1981, and soon developed a following amongst unionists. The following year he was elected as the Democratic Unionist Party (DUP) candidate to the 1982 Northern Ireland Assembly. Seawright, who had initially campaigned for John McQuade before securing his own candidacy, had problems with the party leadership from the beginning of his political career. Seawright stated that he was viewed as lacking respectability due to his rough personality, his residence in social housing, and the fact that he was in arrears to the Northern Ireland Housing Executive."]}, {"page": "Gusty Spence", "response": ["From an early age Spence was a member of the Prince Albert Temperance Loyal Orange Lodge, where fellow members included John McQuade.Moloney, Paisley, pp. 130–131 He was also a member of the Royal Black Institution and the Apprentice Boys of Derry.Susan McKay, Northern Protestants: An Unsettled People, Belfast: Blackstaff Press, 2005, p. 139 Due to his later involvement in a murder he was expelled from the Orange Order and the Royal Black Institution, although it is unknown whether the Apprentice Boys of Derry took any disciplinary action. The Reverend Martin Smyth was influential in the expulsion of Spence by the Orange Order.Brian Kennaway The Orange Order-A Tradition Betrayed, p. 47", "Spence began to move towards a position of using political means and persuaded the UVF leadership to declare a temporary ceasefire in 1973.Taylor, Loyalists, p. 138 Following Merlyn Rees' decision to legalise the UVF in 1974, Spence encouraged them to enter politics and supported the establishment of the Volunteer Political Party. However, Spence's ideas were abandoned as the UVF ceasefire fell apart that same year following the Ulster Workers' Council strike and the Dublin and Monaghan bombings; the carnage of the latter had shocked and horrified Spence.Taylor, Loyalists, p.139 Furthermore, the VPP suffered a heavy defeat in West Belfast in the October 1974 general election, when the DUP candidate John McQuade captured six times as many votes as the VPP's Ken Gibson.Taylor, pp. 139–140"]}, {"page": "Belfast (Northern Ireland Parliament constituencies)", "response": ["*1965-1972 John McQuade (U) Woodvale"]}, {"page": "Ernie Roberts", "response": ["After unsuccessfully contesting Stockport South in 1955 United Kingdom general election, Roberts was elected as the Member of Parliament for the Inner London constituency of Hackney North and Stoke Newington aged 67, according to his obituary writer Frank Allaun the oldest new MP since the Second World War, (although John McQuade who also took his only Westminster seat at the same election was eight months older than Roberts). He served from the 1979 general election until the 1987 general election, when he was deselected in favour of Diane Abbott who would go on to become the first-ever Black British female MP."]}, {"page": "Johnny McQuade", "response": ["#REDIRECTJohn McQuade"]}, {"page": "Hugh Smyth", "response": ["Smyth was first elected to the council in 1972 as representative for the Shankill ward. He won a by-election resulting from the resignation of John McQuade, and beat James Brown of the Ulster Unionist Party and David Robb of the Ulster Constitution Party in a three-way contest. In the election, he received the support of McQuade's party, the Democratic Unionists.The Troubles #13 (May 1972), pp. 31, 37.  Following a change in council structure, he was re-elected the following year for \"Area E\" which included the Glencairn, Woodvale, Ballysillan, Highfield, Legoniel and Ardoyne areas. He subsequently represented the Court electoral area which covered Glencairn, Highfield, Woodvale and the mid and lower Shankill areas.COUNCILLOR HUGH SMYTH CV Smyth was appointed as Alderman in 1978, receiving the same honour in 1985, 1989 and 1993. In 1983 he was chosen as deputy mayor and served in this capacity again in 1993 before being appointed as Lord Mayor in June 1994. He again served as deputy mayor in 2001. As a councillor Smyth had been willing to oppose the main unionist parties on some issues, as he demonstrated in 1991 when he helped to overturn a ban on government ministers visiting Belfast City Hall, an initiative passed by unionist councillors in 1985 as a reaction to the Anglo-Irish Agreement.W.D. Flackes & Sydney Elliott, Northern Ireland: A Political Directory 1968–1993, Belfast: Blackstaff Press, 1994, p. 305."]}, {"page": "1969 Northern Ireland riots", "response": ["Loyalists began pushing into the Falls Road area along Percy Street, Beverly Street and Dover Street. The rioters contained a rowdy gang of loyalist football supporters who had returned from a match.Taylor, Peter (1999). Loyalists. London: Bloomsbury Publishing Plc. p.68  On Dover Street, the loyalist crowd was led by UUP MP John McQuade.Hastings, p.40 On Percy Street, a loyalist opened fire with a shotgun, and USC officers helped the loyalists to push back the nationalists. As they entered the nationalist ghetto, loyalists began burning Catholic homes and businesses on Percy Street, Beverly Street and Dover Street."]}, {"page": "Ulster Protestant Action", "response": ["The initial executive of the UPA consisted of John McQuade, Billy Spence, Charles McCullough, Richard Fenton, Frank Millar, Sammy Verner, Herbert Ditty, Bob Newman and Noel Doherty, with Paisley as an ex officio member.Ed Moloney and Andrew Pollak, Paisley, p.82"]}, {"page": "Members of the 1973 Northern Ireland Assembly", "response": ["*John McQuade"]}, {"page": "List of members of the 12th House of Commons of Northern Ireland", "response": ["|John McQuade", "*19 March 1970: Desmond Boal, William Craig, Norman Laird, John McQuade and Harry West expelled from the Ulster Unionist parliamentary party.", "*30 October 1971: William Beattie, Desmond Boal, Ian Paisley and John McQuade founded the Democratic Unionist Party."]}, {"page": "List of members of the 11th House of Commons of Northern Ireland", "response": ["|John McQuade"]}, {"page": "Belfast North (Assembly constituency)", "response": ["| John McQuade(DUP)"]}, {"page": "United Kingdom general election records", "response": ["*John McQuade, 1979: 67"]}, {"page": "Belfast Woodvale (Northern Ireland Parliament constituency)", "response": ["| rowspan=3| John McQuade"]}, {"page": "McQuade", "response": ["*John McQuade (1911–1984), Northern Ireland politician and professional boxer"]}, {"page": "Naming (parliamentary procedure)", "response": ["| Ian Paisley, Peter Robinson, John McQuade"]}, {"page": "John McQuade (disambiguation)", "response": ["John McQuade (1912–1984) was British soldier and Northern Irish politician.", "John McQuade may also refer to:", "*John McQuade (footballer) (born 1970), Scottish footballer"]}, {"page": "Ken Gibson (loyalist)", "response": ["Gibson stood as the VPP's candidate for the West Belfast constituency in the October 1974 General Election. His candidacy came in for criticism from within the UVF. Gusty Spence, who supported the formation of the VPP, criticised Gibson's decision to run for election, arguing that it was much too soon for the party to think about making any inroads on the mainstream unionist vote.Cusack & McDonald, UVF, p. 151 Stronger criticism came from an anonymous commentator, identified by Jim Cusack and Henry McDonald as a \"senior west Belfast UVF figure at the time\", who claimed that not only did Gibson attempt to force him out of his role as head of the Young Citizen Volunteers but even accused Gibson of orchestrating the assassination of former UVF Chief of Staff Jim Hanna, who was killed on 1 April 1974.Cusack & McDonald, UVF, p. 151-152 Although Gibson received the support of West Belfast UDA leader Charles Harding Smith, Glenn Barr of Vanguard and independent Shankill councillor Hugh Smyth, he finished fourth behind the Democratic Unionist Party (DUP) candidate John McQuade, who garnered 16,265 votes against Gibson's 2,690,Taylor, Peter (1999). Loyalists. London: Bloomsbury Publishing Plc. pp.139–140  with the seat won by the incumbent MP, Gerry Fitt of the Social Democratic and Labour Party (SDLP)."]}, {"page": "Billy Spence", "response": ["In 1956, Spence was a founding member of the Ulster Protestant Action (UPA) executive, and was appointed as its chairman.Ed Moloney and Andrew Pollak, Paisley, pp.82, 100  Billy introduced Ian Paisley to his younger brother,Ed Moloney and Andrew Pollak, Paisley, p.138  In 1962, along with John McQuade, he joined the Ulster Unionist Party's Court ward branch, as part of an entryist campaign by UPA members,Ed Moloney and Andrew Pollak, Paisley, p.101 and was soon appointed as Jim Kilfedder's election agent.Ed Moloney and Andrew Pollak, Paisley, p.135  During the 1966 general election, Paisley said that Kilfedder had links with Fine Gael, and Spence blamed this for the loss of the Belfast West seat to the Republican Labour Party's Gerry Fitt.Ed Moloney and Andrew Pollak, Paisley, p.139 Spence also served as secretary of the West Belfast Imperial Unionist Association.Garland, Gusty Spence, p. 7"]}, {"page": "McQuade, John", "response": ["#redirectJohn McQuade"]}, {"page": "1979 United Kingdom general election in Northern Ireland", "response": ["|John McQuade"]}]}}