{"wiki_id": "http://www.wikidata.org/entity/Q6244955", "itemLabel": "John Lister", "itemDescription": "journalist; associate professor in journalism and health journalism", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Lister_(academic)", "wikipedia_page": {"main": "John Lister is a Senior Lecturer (associate professor) in Journalism, and Health Journalism at the Coventry University Department of Media and Communication.\nLister is the author of two books on international health reform: Health Policy Reform: Driving the Wrong Way? and Global Health vs. Private Profit. He writes about Private Finance Initiative in the NHS. Dr. Lister has worked in print journalism since 1974, and has also been involved in public relations and investigative research on health policy in the UK and worldwide.\nHe is the executive director and founder of London Health Emergency, a pro-NHS public interest group, and has focused on investigative health journalism since 1984 conducting research and consulting for local authorities and campaign groups across England and internationally and for trade unions at the local and regional level. He edited the 1988 book Cutting the Lifeline: The Fight For the NHS, and is one of the founders of the national campaign \"Save Our NHS\".", "link_mentions": [{"page": "Workers' Socialist League", "response": ["The WSL was founded in 1975 with a leadership grouped around Thornett, Tony Richardson and John Lister. Terry Eagleton was a well-known member. Unlike the WRP, whose politics it inherited, it covered Irish politics, women's struggles and broke with the homophobia characteristic of Gerry Healy. The group also concluded that Cuba had been a deformed workers state since the revolution of 1959. It published the weekly paper Socialist Press and a number of issues of a theoretical journal Trotskyism Today."]}, {"page": "History of the National Health Service", "response": ["* John Lister, Cutting the Lifeline: The Fight for the NHS (London: Journeyman, 1988)."]}, {"page": "John Lister", "response": ["John Lister may refer to:", "*John Lister (Australian politician) (1875–1935), member Australian House of Representatives", "*John Lister (gold miner), 19th century New South Wales gold miner, see 1851 in Australia", "*John Lister (priest) (1916–2006), Anglican Provost of Wakefield Cathedral", "*John Lister (golfer) (born 1947), New Zealand professional golfer", "*John Lister (academic), lecturer in journalism at Coventry University and investigative journalist specializing in health and hospitals", "*John Lister (cricketer) (born 1959), cricketer ", "*John Lister, co-organizer of UK's Workers' Socialist League", "*John Lister (philanthropist) (1847–1933), first treasurer of the British Independent Labour Party", "*John Lister (died 1640) (1587–1640), English merchant and politician", "*John Lister (died 1616), English lead merchant and politician", "*John Lister (American football), American football coach"]}, {"page": "Jacky Davis", "response": ["She also co-authored, along with David Wrigley and John Lister, the 2015 book NHS For Sale: Myths, Lies and Deception which exposes the myths and debunks the lies told by the Coalition during the passage of the Health and Social Care Bill. It takes an evidence based approach to exposing government claims such as that the new legislation would give power to patients and doctors and would not result in the privatisation of the NHS"]}, {"page": "John Lister (journalist)", "response": ["#REDIRECT John Lister (academic)"]}, {"page": "Sustainability and transformation plan", "response": ["The Nuffield Trust think tank claims many suggestions would fail to implement government financial targets and involve a \"dauntingly large implementation task\".  Sally Gainsbury of the Nuffield Trust said many current plans involve shifting or closing services... \"Our research finds that, in a lot of these kinds of reconfigurations, you don't save very much money - all that happens is the patient has to go to the next hospital down the road.  They're more inconvenienced... but it rarely saves the money that's needed.\"NHS cuts 'planned across England' BBC There will be a shift from inpatient to outpatient care but critics fear cuts that could put lives at risk, that the plans dismantle the health service rather than protecting it, further that untested plans put less mobile, vulnerable people at risk.  By contrast, NHS England claims that the plans bring joined-up care closer to home. John Lister of Keep Our NHS Public said there are too many assumptions, and managers desperate to cut deficits were resorting to untried plans.Plan to 'transform' NHS could lead to downgrade of major London hospitals The Guardian  A survey of ninety-nine clinical commissioning group chairs and accountable officers conducted by the Health Service Journal in October 2016 found very little confidence that the plans would deliver."]}, {"page": "Private providers of NHS services", "response": ["According to John Lister 30% of all mental health spending in 2018-9 was in the private sector and in child and adolescent mental health services 44%.  The boundary between healthcare, which is free, and social care, which is meanstested, is quite unclear in this area.  The process of deinstitutionalisation, which involved the closure of the large asylums, meant the transfer of patients to community care, much of which is regarded as social care.  In 2019 13% of inpatient beds in England were provided by American companies. According to the Candesic consultancy around £1.8 billion of the £13.8 billion spent by the NHS on mental healthcare in 2018, including non hospital services, went to the private sector. About 25% of NHS mental healthcare beds in England were provided by the private sector, and 98% of their earnings came from the NHS."]}]}}