{"wiki_id": "http://www.wikidata.org/entity/Q6247430", "itemLabel": "John McCallister", "itemDescription": "British politician (born 1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_McCallister", "wikipedia_page": {"main": "John McCallister (born 20 February 1972) is a Northern Irish Unionist politician. In 2007, he was elected to the Northern Ireland Assembly as an Ulster Unionist Party (UUP) member for South Down. On 14 February 2013, McCallister announced that he had resigned from the UUP due to its decision to engage in an electoral pact with the Democratic Unionist Party. He was a co-founder of the NI21 party with fellow ex-UUP member Basil McCrea but resigned the following year following disputes with McCrea. He re-contested his seat as an Independent at the 2016 election but lost his seat, receiving just 2.8% of the vote.", "link_mentions": [{"page": "Ulster Unionist Party", "response": ["Tom Elliott was criticised for comments he made in his victory speech where he described elements of Sinn Féin as \"scum\". Elliott resigned in March 2012 saying some people had not given him a 'fair opportunity' to develop and progress many party initiatives. Mike Nesbitt was elected leader on 31 March 2012, beating the only other candidate, John McCallister, by 536 votes to 129."]}, {"page": "Ulster Defence Regiment", "response": ["On Saturday, 28 April 2012 a memorial to the UDR was unveiled at the National Memorial Arboretum by Colonel Sir Dennis Faulkner CBE (Patron of the Regimental Association) along with Memorial Trees in memory of those UDR Soldiers who were murdered after having left the Regiment. Memorial Trees in memory of all those who were killed while serving had already been planted some years ago.  The memorial takes the form of a 6-foot Mourne granite monument.  The event was attended by around 100 UDR families, joined by the Northern Ireland Minister of State, Hugo Swire, DUP Junior Minister Jonathan Bell and UUP deputy leader John McCallister.  A parade to the monument was led by the band of the 1st Battalion Royal Irish Regiment."]}, {"page": "Willie Frazer", "response": ["In November 2011, after an apology by UUP MLA John McCallister for \"unionist failings\" in the past (at a Sinn Féin conference in Newry), Frazer reacted furiously. Frazer stated that people were \"appalled\" by McCallister's remarks."]}, {"page": "Mike Nesbitt", "response": ["Mike Nesbitt was elected as UUP party leader on 31 March 2012. He defeated South Down assembly member John McCallister with a final vote tally of 536 votes to 129. Nesbitt said he wanted the UUP to become \"the party of choice for every pro-union voter in Northern Ireland\"."]}, {"page": "Independent Unionist", "response": ["*Basil McCrea and John McCallister took on the label after leaving the UUP in 2013."]}, {"page": "David McClarty", "response": ["In early 2013, McClarty was in talks with John McCallister and Basil McCrea, who were both elected as MLAs for the UUP but left the party in February 2013. The three were considering registering as an informal grouping within the Assembly.McCallister and McCrea to sit in the ‘naughty seats’ , News Letter, Rebecca Black, 18 February 2013. (McCallister and McCrea went on to form NI21 later in the year.)"]}, {"page": "List of members of the 3rd Northern Ireland Assembly", "response": ["|John McCallister", "|John McCallister"]}, {"page": "South Down (Assembly constituency)", "response": ["Some of the most high-profile MLA's for the constituency have included Caitríona Ruane, Margaret Ritchie, and John McCallister.", "| rowspan=\"3\" |John McCallister(UUP/Independent)"]}, {"page": "Dermot Nesbitt", "response": ["Nesbitt was a junior minister in the Office of the First Minister and Deputy First Minister of Northern Ireland from 1998 until 2002, when he took up the post of Minister of the Environment. He retired in 2007, and party colleague John McCallister retained a UUP seat in the South Down constituency. At the 1997, 2001 and 2005 general elections, Nesbitt stood unsuccessfully for the Westminster seat of South Down. He currently works as a lecturer in finance at QUB and has lived in Crossgar for most of his life."]}]}}