{"wiki_id": "http://www.wikidata.org/entity/Q6241966", "itemLabel": "John Johnston", "itemDescription": "Scottish footballer, born 1878", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Johnston_(footballer,_born_1878)", "wikipedia_page": {"main": "John Shand Johnston (12 July 1876 – 31 December 1955) was a Scottish footballer who played as a wing half and won the FA Cup with Bury in 1903.", "link_mentions": [{"page": "John Johnston", "response": ["John Johnston may refer to:", "* John Johnston (poet) (c. 1570–1611), Scottish poet and academic", "* John Johnston (Indian agent) (1775–1861), US", "* John Johnston (Nova Scotia politician) (1790–1836)", "* John Johnston (New Zealand politician) (1809–1887)", "* John Johnston (Australian politician) (1823–1872)", "* John Johnston (courtier) (1922–2006), UK", "* John Johnston (footballer, born 1878) (1876–1955), Scottish footballer (Bury FC, Southampton FC)", "* John Johnston (football full-back), footballer for Sunderland", "* John Johnston (footballer, born 1902) (1902–1987), Scottish international footballer", "* John Johnston (footballer, born 1921) (1921–1989), Scottish footballer (Motherwell FC, Hamilton Academical)", "* Sir John Johnston, 3rd Baronet (c. 1648–1690), Scottish soldier", "* John Johnston (chemist) (1881–1950), Scottish-born chemist", "* John Johnston (fur trader) (1762–1828), British", "* John Johnston (merchant) (1781–1851), Scottish-American merchant", "* John Johnston (farmer) (1791–1880), Scotland", "* John Johnston (priest) (1852–1923), Anglican", "* John Johnston (econometrician) (1923–2003), British academic", "* John Johnston (physiotherapist), Scottish-born Australian physiotherapist", "* John Johnston, 13-year-old boy murdered in 1923 by Susan Newell in Coatbridge, Scotland", "* John Johnstone (disambiguation)"]}, {"page": "Lennoxtown", "response": ["*John Johnston, born 1878"]}, {"page": "1903 FA Cup Final", "response": ["|RH || John Johnston  "]}, {"page": "Stalybridge Rovers F.C.", "response": ["Other players included former Blackburn Rovers and Woolwich Arsenal star Tommy Briercliffe, and John Johnston and Frank Thorpe, who both went on to play for Bury, where they won the FA Cup in 1903, and later for Southampton."]}, {"page": "Frank Costello (footballer)", "response": ["He also played in all six FA Cup matches as Saints reached the semi-finals, losing to Wolverhampton Wanderers who went on to take the cup in the final. In the round four (quarter final) replay against Everton at The Dell on 11 March 1908 he played his best game for the \"Saints\". In the first half he hooked a John Johnston cross past the Everton goalkeeper Billy Scott. With the score 2–1 to Southampton at half-time, the second half \"belonged to Frank Costello\". He was involved in most of Southampton's attacks and when John Bainbridge swung over a deep cross from the right it appeared to have been over hit and going out of play. Suddenly, \"out of nowhere\", Costello arrived and met the ball with his head, sending it back over the goalkeeper into the far corner of the net. According to Duncan Holley in \"Match of the Millennium\", \"a contortionist would have had problems attaining a position ... to reach the ball.\" The Saints won the match 3–2, but lost to Wolverhampton Wanderers in the semi-final with goals from former Southampton players Wally Radford and George Hedley."]}, {"page": "Martin Dunne (footballer, born 1886)", "response": ["In the summer of 1911, he returned to his native Lancashire to join his Southampton teammate, John Johnston at Stalybridge Celtic."]}, {"page": "Bert Hodgkinson", "response": ["In May 1907, Hodgkinson returned to the Southern League when he joined Southampton, along with his Bury teammate John Johnston. Described by the Saints' historians, Holley and Chalk, as \"a consistent performer with all his previous clubs\", Hodgkinson was \"still developing as a dashing outside-left\" when he came to Southampton. He made his debut for the Saints on 7 September 1907, when he scored in a 3–2 defeat at home to Crystal Palace. He soon formed useful partnerships with his fellow Welsh forward John Lewis and with George Smith, going on to make 29 appearances in 1907–08, scoring nine goals as Southampton finished the league season in mid-table. He also played in all six FA Cup matches as Saints reached the semi-finals, losing to Wolverhampton Wanderers who went on to take the cup in the final."]}, {"page": "Sam Jepp", "response": ["He made his debut for the \"Saints\" on 15 February 1908, when he replaced former England international Harry Hadley at left-half in a 4–0 defeat at Brentford. He made four further appearances in the 1907–08 season, including each of the half-back positions and at right-back. In 1908–09, he had two runs in the side with six matches at left-half in October (replacing John Johnston with Bert Trueman switching to the right), and twelve matches from mid-January at centre-half whilst Frank Thorpe was out with injury."]}, {"page": "Frank Thorpe", "response": ["Thorpe was born in Hayfield, Derbyshire and started his football career with Stalybridge Rovers, before a brief spell on the books of Newton Heath, where he failed to break into the first-team. In June 1901, he joined Bury, where he was re-united with his former Stalybridge teammate, wing-half John Johnston.", "For the 1907–08 season, Thorpe was re-united with his former Stalybridge and Bury teammate, John Johnston. Thorpe was an intelligent centre-half, whose experience strengthened the \"Saints\" defence, and he was quickly appointed as team captain, helping the \"Saints\" to reach the FA Cup semi-finals where they went out to Wolverhampton Wanderers, beating First Division Everton en route."]}, {"page": "Bert Trueman", "response": ["He was recruited by the \"Saints\" as replacement for the former England international Harry Hadley who had just retired from professional football. Despite being considered too small to be a half-back, Trueman soon proved that his judgement and skill made up for his lack of height and he showed himself to be \"quick, resourceful and decisive in action (who was) overall a most difficult obstacle for opposing forwards\". His debut came on 7 September 1908 in a 4–1 victory over Brighton & Hove Albion, when Frank Jefferis scored a hat-trick. He soon became established at left-half, alongside Frank Thorpe or Sam Jepp in the centre and John Johnston on the right, although Trueman was able to play in any of the half-back positions. In the 1908–09 season, Trueman made 31 league appearances, with Southampton finishing third in the table, having led the table until a run of injuries to key players such as Thorpe and Jefferis in mid-season disrupted the side."]}]}}