{"wiki_id": "http://www.wikidata.org/entity/Q6245430", "itemLabel": "John Lowey", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Lowey_(boxer)", "wikipedia_page": {"main": "John Lowey (born 6 August 1966 in Dundonald, Northern Ireland) is a former professional boxer. Lowey fought at super bantamweight and won the IBO world title in 1995. He represented Ireland at the 1988 Olympics in the bantamweight category. He defeated Mustafa Selah of Iraq and Mohamed Sabo of Nigeria in his first two bouts before being eliminated by Nyamaagiin Altankhuyag of Mongolia in the Round of 16.", "link_mentions": [{"page": "Érik Morales", "response": ["In his first defense, Morales defeated John Lowey (24–2) by 7th-round knockout. In his next fight, he defeated Remigio Molina (31–1) by 6th-round knockout. On May 16, 1998, he defeated former champion Jose Luis Bueno via a second-round knockout.", "|style=\"text-align:left;\"| John Lowey"]}, {"page": "Óscar Larios", "response": ["|align=left| John Lowey"]}, {"page": "List of IBO world champions", "response": ["|align=left |  John Lowey"]}, {"page": "Emmanuel Lucero", "response": ["He challenged Daniel Ponce de Leon for the vacant WBO NABO super bantamweight title on October 22, 2004 at the County Coliseum, El Paso, Texas. Lucero lost; he was knocked out in the third round. He won the WBC Continental Americas super bantamweight title when he defeated John Lowey. Lucero was a very high prospect when he fought Manny Pacquiao. At the time, his record was twenty two fights with one draw and no defeats. He fought Robert DaLuz on 26 August 2010 the fight was quite close but Lucero won the bout after two separate defeats by unanimous decision."]}, {"page": "Nyamaagiin Altankhuyag", "response": ["*Defeated John Lowey (Ireland) 3-2"]}, {"page": "Boxing at the 1988 Summer Olympics – Bantamweight", "response": ["| 9T || align=\"left\"| John Lowey || align=\"left\"| ", "* John Lowey (IRL) def. Mustafa Saleh (IRQ), 5:0", "* John Lowey (IRL) def. Mohamed Sabo (NGA), 4:1", "* Nyamaagiin Altankhuyag (MGL) def. John Lowey (IRL), 3:2"]}, {"page": "Moustafa Mohammed Saleh", "response": ["Moustafa Mohammed Saleh (born 3 September 1963) is an Iraqi boxer. He competed in the men's bantamweight event at the 1988 Summer Olympics. He lost in the opening round of the tournament to John Lowey of Ireland."]}, {"page": "John Lowey", "response": ["John Lowey may refer to:", "*John Lowey (boxer) (born 1966), Northern Irish boxer", "*John Lowey (footballer) (1958–2019), English footballer"]}]}}