{"wiki_id": "http://www.wikidata.org/entity/Q6244080", "itemLabel": "John Latham", "itemDescription": "Rhodesian-British visual artist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Latham_(artist)", "wikipedia_page": {"main": "John Aubrey Clarendon Latham, (23 February 1921 – 1 January 2006) was a Northern Rhodesian-born British conceptual artist.\n\n", "link_mentions": [{"page": "Conceptual art", "response": ["* 1965: A complex conceptual art piece by John Latham called Still and Chew. He invites art students to protest against the values of Clement Greenberg's Art and Culture, much praised and taught at Saint Martin's School of Art in London, where Latham taught part-time. Pages of Greenberg's book (borrowed from the college library) are chewed by the students, dissolved in acid and the resulting solution returned to the library bottled and labelled. Latham was then fired from his part-time position.", "* John Latham (1921–2006)"]}, {"page": "British Poetry Revival", "response": ["These poets included Roy Fisher, Gael Turnbull, Ian Hamilton Finlay, Bob Cobbing, Jeff Nuttall, Tom Raworth, Michael Horovitz, Eric Mottram, Peter Finch, Edwin Morgan, Jim Burns, Elaine Feinstein, Lee Harwood, and Christopher Logue. Many of these poets joined Allen Ginsberg and an audience of 7,000 people at the Albert Hall International Poetry Incarnation on 11 June 1965 to create what has often been claimed as the first British happening. Earlier British happenings included John Latham's event-based art and Skoob Tower ceremonies; Gustav Metzger's 1964 auto-destructive art; Adrian Henri's 1962 collage-events in Liverpool's The Cavern Club; and Jeff Nuttall's events in Better Books. They had their roots in Dada events at the Cabaret Voltaire (Zurich) at the start of the century.Jeff Nuttall, Bomb Culture"]}, {"page": "List of modern artists", "response": ["* John Latham"]}, {"page": "Chelsea College of Arts", "response": ["At the beginning of the 1930s, the School of Art began to widen, including courses in craft training and commercial design from 1931. H.S Williamson, the school's appointed headmaster from 1930 to 1958, introduced sculpture shortly after World War II. Notable artists from this period were employed as teachers such as Henry Moore and Graham Sutherland. Alumni from this period included Elisabeth Frink, Edward Burra, Patrick Caulfield, Ethel Walker, Dirk Bogarde, Robert Clatworthy, John Latham and John Berger.", "* John Latham (conceptual artist)"]}, {"page": "Iain Sinclair", "response": ["|Featuring Martin Stone, John Latham, Alan Moore, Driff Field, Brian Catling, Directed by Chris Petit"]}, {"page": "David Hall (video artist)", "response": ["In 1966 he was a founder of the pioneering artists' organisation Artist Placement Group, APG, along with Barbara Steveni, John Latham, Barry Flanagan, Anna Ridley, and Jeffrey Shaw among others. APG was a milestone in Conceptual Art in Britain, reinventing the means of making and disseminating art."]}, {"page": "Frestonia", "response": ["The Car Breaker Gallery's exhibitors included Joe Rush of the Mutoid Waste Company, Julie Umerle, Brett Ewins, Giles Leaman and Brendan McCarthy. The gallery opened to the public at 4 Bramley Road on 14 December 1979. In 1980, conceptual artist John Latham was a member of the audience at the private view of one of the performances presented there. Professional lighting for the gallery was donated by Sandy Nairne, later to be Director of the National Portrait Gallery."]}, {"page": "Guglielmo Achille Cavellini", "response": ["On 2 June 1958 Cavellini published his first book Arte astratta (Abstract Art), printed by Giampiero Giani and presented at the Venice Biennale. The book participated in the Viareggio Prize, reaching the final selection. Abstract Art was positively reviewed by Elda Fezzi, Guido Ballo, Giorgio Kaisserlian, Duilio Morosini, Angelo Dragone and Rosanna Apicella. Some pages of Cavellini's diary were published by Alfredo Mezio on the magazine Mondo, directed by Mario Pannunzio. In the summer of the same year he traveled to London with his daughter Mariella, and there he met painter John Latham and bought some of his works. In the same period he visited the exhibitions by Yves Klein at the Apollinaire Gallery in Milan, those by Arman and Shusaku Arakawa at the Arturo Schwarz Gallery in Milan, the group exhibitions by Luciano Pistoi and Michel Tapié in Turin and the ones set up by Attilio Codognato in Venice. At one of those exhibitions he met Christo, who then visited Cavellini's home."]}, {"page": "2006 in art", "response": ["*1 January – John Latham, Zambian conceptual artist (b.1921)"]}, {"page": "1921 in art", "response": ["* February 23 – John Latham, Zambian conceptual artist (d. 2006)"]}, {"page": "John Latham", "response": ["John Latham may refer to:", "* John Latham (ornithologist) (1740–1837), British physician, naturalist and author", "* John Latham (1761–1843), English physician, President of the Royal College of Physicians", "* John Latham (1787–1853), his son, English magistrate  and poet", "* John Latham (judge) (1877–1964), Australian judge and politician", "* John Latham (artist) (1921–2006), conceptual artist born in Zambia", "* John Latham (Whitewater), U.S. bank executive involved in Whitewater controversy, 1990s", "* John Latham (physicist) (1937–2021), British physicist"]}, {"page": "Ian Breakwell", "response": ["During the 1970s Breakwell worked with the Artist Placement Group a pioneering artists' organisation founded in 1966 by Barbara Steveni and  John Latham, together with David Hall, Barry Flanagan, Anna Ridley, and Jeffrey Shaw among others. It was a milestone in Conceptual Art in Britain, reinventing the means of making and disseminating art."]}, {"page": "Auto-destructive art", "response": ["Along with Metzger, John Latham was another influential destructive artist. Latham had an interest in \"temporality\" and \"time based\" destruction.Iles, C. (2006, April). Book smart: Chrissie Iles on John Latham. Retrieved October 26, 2016, from http://go.galegroup.com/ps/retrieve.do?tabID=T002&resultListType=RESULT_LIST&searchResultsTye=SingleTab&searchType=BasicSearchForm¤tPosition=1&docId=GALE|A144705010&docType=Biography&sort=RELEVANCE&contentSegment=&prodId=AONE&contentSet=GALE|A144705010&searchId=R2&userGroupName=colu91149&inPS=true His most recognized piece was the Skoob Tower Ceremonies. Latham used stacks of books to create towers that he then set on fire. This demonstration was controversial due to the recent Nazi attacks and book burnings that took place. Latham noted that he was not against the content in the books, but rather the idea that books are the only source of knowledge. Beaven, K. (2012, July 16). Performance Art 101: Rebellion, destruction, ritual and taboo. Retrieved October 18, 2016, from http://www.tate.org.uk/context-comment/blogs/performance-art-101-rebellion-destruction-ritual-and-taboo"]}, {"page": "Lisson Gallery", "response": ["Lisson Gallery is a contemporary art gallery with locations in London and New York, founded by Nicholas Logsdail in 1967. The gallery represents over 50 artists such as Art & Language, Ryan Gander, Carmen Herrera, Richard Long, John Latham, Sol LeWitt, Robert Mangold, Jonathan Monk, Julian Opie, Richard Wentworth, Anish Kapoor, Richard Deacon and Ai Weiwei.Colin Gleadell, \"Art Sales: dealer who opened Saatchi's eyes\", on telegraph.co.uk, 22 June 2009.\"Artists\", on lissongallery.com.", "* John LathamColin Gleadell (13 June 2017), Sleeping with the enemy? Dealers and galleries work with Sotheby's to shine light on under-recognised artists The Daily Telegraph."]}, {"page": "Deaths in January 2006", "response": ["*John Latham, 84, Zambian artist, natural causes."]}, {"page": "John latham (artist)", "response": ["#REDIRECT John Latham (artist) "]}, {"page": "John Kasmin", "response": ["Other artists that Kasmin showed included Barnett Newman, Ad Reinhardt, Frank Stella, Kenneth Noland, Morris Louis, Helen Frankenthaler, Anthony Caro, William G. Tucker, John Latham, Richard Smith, Bernard Cohen, Robin Denny, Howard Hodgkin and Gillian Ayres."]}, {"page": "West Calder", "response": ["The Five Sisters shale bings to the north of West Calder are a local landmark and scheduled monument. The bings rise to a height of 720 feet (220 m), some 230 feet (70 m) above the surrounding area, and are the spoil tips from the oil shale industry that was a feature of the area. The Five Sisters were named by artist John Latham during his time with an Artist Placement Group project with the Scottish Office's Development Agency in 1975–6.,"]}, {"page": "Destruction in Art Symposium", "response": ["Happenings took place in venues all over London, including Conway Hall. At Africa Centre, co-owner of Indica Gallery, John Dunbar, saw Yoko Ono's performances of Cut Piece and invited her to make an exhibition for Indica. John Latham constructed three large Skoob Towers out of books called The laws of England and set fire to them outside the British Museum. Raphael Montañez Ortiz destroyed a piano for his Duncan Terrace Piano Destruction Concert. Guy Pro-Diaz produced his work Painting with Explosion at the Freeschool Playground in London, on 12 September 1966.", "*John Latham"]}, {"page": "Artist Placement Group", "response": ["Among the participants were Barbara Steveni, John Latham, Maurice Agis, Joseph Beuys, Ian Breakwell, Stuart Brisley, Hugh Davies, Andrew Dipper, Barry Flanagan, David Hall, Ian Macdonald Munro, Yoko Ono, Anna Ridley, Jeffrey Shaw, David Toop, and the Fluxus Group.", "After 1989 the organisation became known as Organisation and Imagination (O+I). In 2004 the Tate Archive in London purchased the APG records. Co-founder John Latham died shortly after, in 2006."]}, {"page": "Jyllands-Posten Muhammad cartoons controversy", "response": ["Rose wrote the editorial which accompanied the cartoons in which he argued there had been several recent cases of self-censorship, weighing freedom of speech against the fear of confronting issues about Islam, so he thought it was legitimate news story. Among the incidents he cited were: the translators of a book critical of Islam did not want their names published; the Tate gallery in London withdrew an installation by the avant-garde artist John Latham depicting the Quran, Bible and Talmud torn to pieces, and comedian Frank Hvam said in an interview with Jyllands-Posten that he would hypothetically dare to urinate on the Bible on television, but not on the Quran. Rose also mentioned the case of a Danish imam who had met with Prime Minister Anders Fogh Rasmussen and \"called on the prime minister to interfere with the press in order to get more positive coverage of Islam.\""]}, {"page": "Metronome (artists' and writers' organ)", "response": ["Artists & Writers contributors: Michael Archer; Dave Beech; Rut Blees Luxemburg; Colin Cina; Neil Cummings; R. Nick Evans; Rose Finn-Kelcey; Ben Fitton; Anna Fasshauer; Kendell Geers; Babak Ghazi; Liam Gillick; Felicity Greenland; Alan Johnston; Annis Joslin; Stephen Klee; Langlands and Bell; John Latham; Douglas Park; Barbara Steveni; Gavin Turk; Hans Weigand; Cerith Wyn Evans."]}, {"page": "Duncan of Jordanstone College of Art & Design", "response": ["The DJCAD Library houses a large collection of Artists' books (artists’ books collection Dundee -abcD)- originally established in 1999 as the Centre for Artists Books by Alec Finlay, now with 1,450 books, multiples and ephemera from 600 artists represented in the collection. (Notable names include Andy Warhol, Marcel Duchamp, Carl Andre, John Cage, Valie Export, Bruce Nauman, Dieter Roth, Carolee Schneemann, Jake & Dinos Chapman, Susan Hiller, Yoko Ono, Helen Douglas, Tacita Dean, Bruce Maclean, David Shrigley, Julian Opie, John Latham, Simon Starling, Ian Hamilton Finlay, David Bellingham and Toby Paterson)."]}, {"page": "Nantgarw China Works", "response": ["Young put the Nantgarw Pottery and its contents up for sale via public auction in October 1820, enabling him to buy out his minor partners, become sole proprietor and manage the completion and sale of the stock; effectively salvaging the business. He invited his friend and former co-working artist from the Cambrian Pottery, Thomas Pardoe, to aid him with the completion and decoration of the salvaged porcelain. Young and Pardoe experimented to perfect a glaze for the biscuit ware, but were unable to add to Billingsley's stockpile of porcelain, having no access to his recipe. The final sales of the finished porcelain (sold between 1821 and 1822), paid Pardoe and his staff's salaries in arrears, but failed to recoup Young's total losses, leaving Young narrowly avoiding bankruptcy. Besides the porcelain decorated by Young, but predominantly by Pardoe at Nantgarw, many pieces were sold in the white to be decorated in London. These wares are known to have been decorated by Thomas Martin Randall (working for John Mortlock at the time),  John Latham, William Peg and probably Matthew Colclough."]}, {"page": "List of Old Wykehamists", "response": ["*  John Latham, artist"]}, {"page": "Latham (surname)", "response": ["* John Latham (1761–1843) English physician, President of the Royal College of Physicians", "* John Latham (1787–1853), English poet", "* John Latham (artist) (1921–2006), British conceptual artist", "* John Latham (judge) (1877–1964), Chief Justice of the High Court of Australia", "* John Latham (ornithologist) (1740–1837), British ornithologist"]}, {"page": "Sociological art", "response": ["For six years, the Collective carried out a handful of collaborative sociological art projects, participated in colloquia and exhibition, generated a community of collaborators, and provided support for independent work. Interlocutors included Henri Lefebvre, Edgar Morin, Vilem Flusser, Jean Duvignaud, Jorge Glusberg, Kristine Stiles, and numerous artists, including John Latham of the Artist Placement Group, Stephen Willats, and Ken Friedman. Tensions developed among Fischer, Forest, and Thenot, and in 1980, Forest and Thenot published an ad in Art Press selling the Ecole Sociologique Interrogative, which was located in Fischer's apartment, and wrote a tract declaring the end of the Collective."]}, {"page": "Tate Britain", "response": ["The main display spaces show the permanent collection of historic British art, as well as contemporary work. It has rooms dedicated to works by one artist, such as: Tracey Emin, John Latham, Douglas Gordon, Sam Taylor-Wood, Tacita Dean, Marcus Gheeraerts II, though these, like the rest of the collection, are subject to rotation."]}, {"page": "Jeffrey Shaw", "response": ["Shaw's numerous internationally exhibited and critically acclaimed artworks are milestones of technological and cultural innovation that have had a seminal impact on the theory, design, and application of digital media in art, society, and industry, and his artistic achievements are amongst the most cited in new media literature. During his career, his works have been presented at leading public galleries museums including the Stedelijk Museum Amsterdam, Centre Georges Pompidou Paris, Kunsthalle Bern, Guggenheim Museum New York, ZKM Karlsruhe, Hayward Gallery London and Power Station of Art Shanghai. Shaw's career is also distinguished by his collaborations with fellow artists including Tjebbe van Tijen, Theo Botschuijver, Dirk Groeneveld, Peter Gabriel/Genesis, Agnes Hegedüs, David Pledger, The Wooster Group, William Forsythe, Dennis Del Favero, Peter Weibel, Jean Michel Bruyere, Bernd Lintermann, Harry de Wit, John Latham and Sarah Kenderdine."]}, {"page": "David Roberts (art collector)", "response": ["Roberts began collecting in the early 1990s, and the David Roberts Collection (now the David and Indrė Roberts Collection) now consists of more than 2,500 works by over 850 artists. It comprises modern and contemporary works by British and international artists including Ida Applebroog, Charles Avery, John Baldessari, Fiona Banner, Phyllida Barlow, Louise Bourgeois, Martin Boyce, Anthony Caro, Maurizio Cattelan, Patrick Caulfield, Jake & Dinos Chapman, Martin Creed, Enrico David, Tracey Emin, Cerith Wyn Evans, Lucian Freud, Ellen Gallagher, Theaster Gates, Douglas Gordon, Anthony Gormley, Rodney Graham, Andreas Gursky, Philip Harris, Mona Hatoum, Eva Hesse, John Latham, Damien Hirst, Peter Howson, Gary Hume, Bethan Huws, Pierre Huyghe, Anish Kapoor, Anselm Kiefer, Jim Lambie, Sol LeWitt, Roy Lichtenstein, Sarah Lucas, Christian Marclay, Bruce McLean, Joan Miró, Henry Moore, Grayson Perry, Man Ray, Tobias Rehberger, Gerhard Richter, Bridget Riley, Sterling Ruby, Ed Ruscha, Yinka Shonibare, David Shrigley, John Stezaker, Wolfgang Tillmans, Rosemarie Trockel, Oscar Tuazon, Danh Vo, Mark Wallinger, Andy Warhol, Ai Weiwei, Franz West."]}, {"page": "Herbert and Dorothy Vogel", "response": ["* John Latham"]}, {"page": "John A. Walker (art critic)", "response": ["'Design history and the history of design'. Pluto Press: London. Retrieved 28 June 2009. John Latham: The Incidental Person - His Art and Ideas (1994),Walker, John A. (1994). 'John Latham: The Incidental Person - His Art and Ideas'. Middlesex University Press (publisher). Retrieved 28 June 2009. Cultural Offensive: America's Impact on British Art since 1945 (1998),Walker, John A. (1998). 'Cultural Offensive: America's Impact on British Art since 1945'. Pluto Press: London. Retrieved 28 June 2009. Art & Outrage (1999),Walker, John A. (1999). 'Art & Outrage'. Macmillan (publisher). Retrieved 28 June 2009. Supercollector: A Critique of Charles Saatchi with Rita Hatton (2000),Hatton, Rita & Walker, John A. (2000). 'Supercollector: A Critique of Charles Saatchi'. Ellipses: London. Retrieved 28 June 2009. ", "With regard to John Latham: The Incidental Person - His Art and Ideas (1994), John A. Walker wrote a contentious article on Artnet.com after John Latham's death. In it, Walker revealed that there was a legal conflict with Latham concerning the book. The article is titled \"The Perils of Publishing\".Walker, John A. (Undated).'The perils of publishing'.  Artnet.com. Retrieved 28 June 2009. He also released legal letters concerning the conflict, in which he is quoted: \"Latham acts as if he is the commissioner or patron of the book rather than its subject matter... He tries to treat me like a slave whose function is to write down exactly what he dictates. This is not on…\".(22 June 2009). 'Re John Latham book: John A. Walker releases legal letters'. Art Design Publicity. Retrieved 8 November 2009."]}, {"page": "Theo Crosby", "response": ["Attaching himself to the Institute of Contemporary Arts (ICA) in London, Crosby attended meetings of the Independent Group there, and was particularly impressed by the group's discussions of the impact of mass communication and information theory on architecture and design. It was Crosby who suggested, and steered to completion, what would be the Independent Group's swansong—the watershed exhibition This Is Tomorrow at London's Whitechapel Gallery in 1956. Characteristically the exhibition was organised around twelve multidisciplinary teams. Crosby collaborated on his installation with graphic designers Germano FacettiFacetti had been a student in Wright's evening class at the Central School and Edward Wright, and the sculptor William Turnbull. The installations which garnered most attention, however, were those of Richard Hamilton, John McHale and John Voelcker (with its Pop-Art imagery including Robby the Robot), and Eduardo Paolozzi, Alison and Peter Smithson and Nigel Henderson (which featured a \"primitive\" pavilion studded with evocative ephemera). In AD Crosby wrote that the exhibition was \"evidence of attempts towards a new sort of order, a way towards that integration of the arts that must come if our culture is not merely to survive, but come truly to life\". It was, he said later, \"my first experience at a loose, horizontal organisation of equals\", and claimed it was the inspiration behind the distinctive organisation of Pentagram.\"The Painter as Designer\", op cit, pp. 49–50 In characteristic fashion, Crosby—alert to practicalities—sold the ads that made the memorable exhibition catalogue possible. In 1960 he showed his own sculpture at the ICA, alongside paintings by Peter Blake and interventions by John Latham."]}, {"page": "Bellenden Road", "response": ["Artists such as Anthony Gormley, Tom Phillips and John Latham have lived and worked on Bellenden Road and in the area. As part of Southwark Council's Bellenden Area Renewal programme Gormley designed bollards and street furniture for the area, Phillips designed lampposts and mosaics, several shop fronts were refitted and Latham installed a major artwork through the front of his house and studio which he named Flat Time House. Flat Time House is now a publicly accessible art and education space and houses the John Latham archive."]}, {"page": "Anti-monumentalism", "response": ["The movement of anti-monumentalism has progressed into a movement of challenging difficult and controversial historical individuals or events. Examples include Krzysztof Wodiczko's Bunker Hill Monument Projections (1998), The Fourth Plinth Commissions – especially Marc Quinn’s Alison Lapper Pregnant (2005) and Mark Wallinger’s Ecce Homo (1999), John Latham's Five Sisters (1976), Kori Newkirk's Prime (2016), and Aria Dean's New Monument for Franska Tomten (2020). Other notable examples include:"]}, {"page": "Wysing Arts Centre", "response": ["* The Starry Rubric Set – including artists Marjolijn DijkmAn, Ruth Beale, Nicholas Deshayes, Rob Filby, John Latham, Karin Kihlberg & Reuben Henry, Kate Owens, Laure Prouvost, Giles Round"]}, {"page": "Russell Hill (artist)", "response": ["Hill is a graduate of the BA Fine Art Sculpture programme at Wimbledon College of Art, University of the Arts London and the Royal College of Art MA Sculpture programme under the guidance of Professor Richard Wentworth. He was selected for inclusion in Anticipation, an exhibition curated by art collector Kay Saatchi, alongside Catriona Warren, former editor of Art Review magazine. He was selected for inclusion in the Catlin Guide to the 40 important emerging artists in the UK (a publication which was launched at the London Art Fair)\"The Catlin Guide 2011: New Artists in the UK.\" Justin Hammond (ed.) 2011.  and subsequently won the Annual Catlin Art Prize in 2011,\"Wimbledon College of Arts graduate Russell Hill wins the Catlin Art Prize with Fabric Softeners.\"Culture24, 2 June 2011.Vanessa Thorpe (22 May 2011) \"Next generation turns its back on Emin and Hirst's conceptual artworks\", The Observer. Retrieved 2013-09-10. selected by curator Justin Hammond and judged by London gallerist Simon Oldfied, curator Julia Royse and art collector Richard Greer. The Catlin Guide 2011 and its 40 most promising UK art school graduates, including Hill, was featured in The Independent newspaper.\"Artists to Watch in 2011.\" The Independent. 12 January 2011. Retrieved 2 July 2014. His work was selected by curator (and creator of the Catlin Art prize) Justin Hammond, to appear in '100 Curators, 100 Days',\"100 Curators, 100 Days.\" Saatchi Online, June 2011. . hosted by Saatchi Online. He is Visiting Tutor at Brit School in Croydon, London and lectures at Wimbledon College of Art and Camberwell College of Arts. He has work in many private collections, in Asia, Europe and America. In 2012 he was profiled in a University of the Arts London film which charted his progress through art college and his experiences on the London contemporary art scene.\"Russell Hill – Wimbledon Graduate.\"University of the Arts London, 16 May 2012. In 2014 Hill was selected to show a solo presentation at Baltic Center For Contemporary Art. Recently, Hill has worked with toothpaste to create large installations at Baltic Centre For Contemporary Art, Royal College of Art and at John Latham's home and studio, Flat Time House, Peckham, London. Rob Alderson, states 'Hill’s huge piece created using toothpaste has the perfect combination of wit and technical skill'"]}, {"page": "Laure Prouvost", "response": ["Prouvost was born in Croix, an upscale suburb of Lille, France, and attended a local school with a strong arts focus. She studied film  at Central Saint Martins and also attended Goldsmiths, University of London. After graduating from Saint Martins, she worked as an assistant to the artist John Latham, who she describes as \"more like a grandfather than my real grandfather\". She has exhibited at Tate Britain and the Institute of Contemporary Arts. She was awarded the biennial MaxMara Art Prize for Women in 2011 in collaboration with the Whitechapel Gallery and her work has appeared in the private contemporary art collection Collezione Maramotti in Reggio Emilia, Italy. Prouvost's work combines installation, collage and film."]}, {"page": "List of avant-garde films of the 1960s: 1960–1964", "response": ["|John Latham"]}, {"page": "Thomas Latham (cricketer)", "response": ["Educated at Highgate School, Winchester College and St John's College, Cambridge, Latham graduated in 1874 and was called to the bar as a barrister in the same year. He practised on the Western circuit; then from 1881 to 1888 he was special pleader at the courts in Shanghai, after which he retired to Folkestone where he died in 1926. His son was the cricketer and colonial administrator Geoffrey Latham, while his grandson was the artist John Latham."]}]}}