{"wiki_id": "http://www.wikidata.org/entity/Q6244929", "itemLabel": "John Liptrot Hatton", "itemDescription": "English musical composer, conductor, pianist and singer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Liptrot_Hatton", "wikipedia_page": {"main": "John Liptrot Hatton (12 October 1809 – 10 September 1886) was an English musical composer, conductor, pianist, accompanist and singer.", "link_mentions": [{"page": "Aldeburgh", "response": ["*John Liptrot Hatton (12 October 1809 – 10 September 1886) was an internationally celebrated English composer, conductor, pianist and singer who stayed in Aldeburgh for some time and wrote, for the place he loved, an Aldeburgh Te Deum. Augener, 1868. See Fuller Maitland, 'Hatton, John Liptrot', Old D.N.B. p. 166 col. 2."]}, {"page": "1886 in music", "response": ["*September 10 – John Liptrot Hatton, composer (b. 1809)"]}, {"page": "1809 in music", "response": ["*October 12 – John Liptrot Hatton, composer, conductor, pianist and singer (died 1886)"]}, {"page": "Barbara Allen (song)", "response": ["Baritone vocalist Royal Dadmun released a version in 1922 on Victor Records. The song is credited to the arrangers, Eaton Faning and John Liptrot Hatton."]}, {"page": "Hatton", "response": ["* John Liptrot Hatton (1809–1886), English composer and conductor"]}, {"page": "Classical music of the United Kingdom", "response": ["The works of Handel, Mendelssohn and Spohr continued to be a major part of the British musical repertoire but there was an increasing emphasis on religious drama. The Italian-born Sir Michael Costa's Eli (1855) and Naaman (1864) set the pace for the later development in the works of Sullivan, including The Martyr of Antioch (1880) The Light of the World (1873), and The Golden Legend (1886), John Liptrot Hatton's Hezekiah (1877), Joseph Barnby's Rebekah (1870), William Cusins's Gideon (1871), Alfred R. Gaul's The Holy City (1882), Charles Gounod's Redemption (1882) and Mors et Vita (1885) (produced expressly for the British public), and Sir John Stainer's The Crucifixion (1887).H. E. Smither, A History of the Oratorio: the Oratorio in the Nineteenth and Twentieth Centuries (UNC Press, 2000), p. 311. Arguably the last of the great English Victorian composers to emerge was Edward Elgar (1857–1934), who during the 1890s produced his Caractacus and King Olaf cantatas, the Enigma Variations in 1899, and the revolutionary Dream of Gerontius in 1900.J. N. Moore, Edward Elgar: a Creative Life (Oxford: Oxford University Press, 1999)."]}, {"page": "John L. Hatton", "response": ["#REDIRECT John Liptrot Hatton"]}, {"page": "1809 in the United Kingdom", "response": ["* 12 October – John Liptrot Hatton, composer, conductor, pianist and singer (died 1886)"]}, {"page": "Kathleen Fitzwilliam", "response": ["She studied under John Barnett (singing), John Liptrot Hatton  (piano) and Balzir Chatterton (harp). Her first appearance in public was on 15 March 1845 at the Hanover Square Rooms as a singer on the occasion of the first performance of an original 'Stabat Mater' composed by her brother  Edward Francis Fitzwilliam. In the same year she made her stage debut at the Theatre Royal, Birmingham as Rosina in The Barber of Seville. "]}, {"page": "Part song", "response": ["Early British composers of part songs include John Liptrot Hatton, R. J. S. Stevens, Henry Smart and George Alexander Macfarren, who was renowned for his Shakespearean settings. Around the turn of the 20th century in the heyday of the part song, Hubert Parry, Charles Villiers Stanford and Edward Elgar were the principal exponents, often bringing a high-minded seriousness to their settings of great English poetry both contemporary and from earlier epochs. More recent major contributors to the genre include Ralph Vaughan Williams, Granville Bantock, Arnold Bax, Peter Warlock, Gustav Holst and Benjamin Britten. The development of the part song has been marked by increasing complexity of form, and contrapuntal content."]}, {"page": "1886 in the United Kingdom", "response": ["* 10 September – John Liptrot Hatton, composer, conductor, pianist and singer (born 1809)"]}, {"page": "Yelverton Lodge", "response": [":*Richard J T Hatton (brother of John Liptrot Hatton)"]}, {"page": "24 Caprices for Solo Violin (Paganini)", "response": ["* version of the 24 caprices \"\" by John Liptrot Hatton (1870)"]}, {"page": "Come Live with Me (film)", "response": ["* \"Come Live with Me\" (John Liptrot Hatton, Christopher Marlowe)"]}, {"page": "William Cox Bennett", "response": ["His 'Songs for Sailors' were set to music in 1878 by John Liptrot Hatton. A collective edition of his poems appeared in 1862 in Routledge's British Poets."]}, {"page": "Hellmuth Ladies' College", "response": ["* 1869: Frances Josephine Hatton (1840–1906), 1871 marriage to Charles Greenwood Moore, MD (1818–1886) – Composer, Professor of Composition and Singing (daughter of English composer John Liptrot Hatton)"]}, {"page": "John Hatton", "response": ["*John Liptrot Hatton, English musical composer"]}, {"page": "Thomas Oliphant (lyricist)", "response": ["Oliphant commissioned eighteen works by John Liptrot Hatton who worked under the pseudonym of 'P.B. Czapek' (alluding to the Hungarian word for a Hat, for 'Hatton'). These compositions were based on the style of German classics.Fuller-Maitland, 'Hatton, John Liptrot', Old D.N.B. Simpson, A Century of Ballads, p. 125."]}, {"page": "List of burials at Kensal Green Cemetery", "response": ["* John Liptrot Hatton (1809–1886)"]}]}}