{"wiki_id": "http://www.wikidata.org/entity/Q6241666", "itemLabel": "John Jarman", "itemDescription": "Welsh footballer (1931-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Jarman_(footballer)", "wikipedia_page": {"main": "John Emlyn Jarman (4 February 1931 – 21 October 2009) was a Welsh footballer and coach.\nAs a player, Jarman began his career at Wolverhampton Wanderers, but never played for the club, in part because of a serious knee injury. He was sold to Barnsley in 1950 for an £8,000 transfer fee. In six years at Oakwell, he played 47 games and scored two goals. He later moved to Walsall as player-coach. In 1958, he retired as a player because of injuries.\nIn 1962, Jarman became chief coach at West Bromwich Albion. Five years later, he joined the Football Association as a regional staff coach with responsibility for the Midlands, and subsequently held a similar job for the Football Association of Ireland. He returned to club football in 1977, when he rejoined Wolverhampton Wanderers, and held a senior coaching role serving under managers John Barnwell, Sammy Chung and Ian Greaves.\nIn March 1983, following Ian Greaves' appointment as manager of Mansfield Town, Jarman was named the club's assistant manager. Greaves and Jarman worked together at Field Mill for the next six years, which are widely regarded as one of Mansfield's most successful periods in the club's history, winning promotion in 1985–86, and winning the Associate Members' Cup at Wembley the following season.\nJarman left Mansfield Town in September 1988, and later worked for Derby County, where he helped to establish the Rams Soccer Academy in the early 1990s. In his later years, he settled in Forest Town near Mansfield, and helped out coaching youngsters at his local football club Forest Town Welfare until 2008. He died in October 2009, aged 78.", "link_mentions": [{"page": "2009 in association football", "response": ["*21 October – John Jarman (78), Welsh midfielder"]}, {"page": "2009–10 in English football", "response": ["*21 October 2009 – John Jarman, 78, former Barnsley and Walsall wing-half, who later worked as a coach for Wolverhampton Wanderers, West Bromwich Albion, Mansfield Town and Derby County.Stags mourn Wembley assistant manager John Jarman, Mansfield Chad. Retrieved 1 November 2009."]}, {"page": "Deaths in October 2009", "response": ["*John Jarman, 78, Welsh football player (Barnsley, Walsall) and coach."]}, {"page": "Derby County F.C. Women", "response": ["In 1990, John Jarman started the Community Department at Derby County Football Club and in the same year, he held discussion with the management of Beacon Wanderers which eventually led to the formation of Derby County Ladies FC. At that time the club consisted of a single open-age team, however, the association with Derby County quickly saw it extended to a reserve and third team. The first manager of the newly formed DCLFC was Neil Crofts."]}]}}