{"wiki_id": "http://www.wikidata.org/entity/Q6249021", "itemLabel": "John Mitchinson", "itemDescription": "British opera singer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Mitchinson_(tenor)", "wikipedia_page": {"main": "John Leslie Mitchinson (31 March 1932 – 17 December 2021) was an English operatic tenor.Mitchinson was born in Blackrod, Lancashire. He made his début singing the role of Jupiter in Handel's Semele. From 1972 to 1978, he was associated with the Sadler's Wells opera company; during that time, he created the role of the Poet in Joseph Tal's opera Massada 967 which premiered in 1972. In 1978 he joined the Welsh National Opera, with whom he worked for four years. Able to sing a variety of roles, he portrayed Peter Grimes and Tristan during this period, among others.\nHe sang the title role of Wagner's Rienzi in a 1976 BBC broadcast of one of the rare performances in recent history of the complete opera; a recording of this broadcast survives and has circulated.\nMitchinson married the mezzo-soprano Maureen Guy in 1958. She died in 2015. He died on 17 December 2021, at the age of 89. He was survived by his two sons, David and Mark.\n\n", "link_mentions": [{"page": "Béatrice et Bénédict", "response": ["* Josephine Veasey (Béatrice), John Mitchinson (Bénédict), April Cantelo (Héro), Helen Watts (Ursule), John Cameron (Claudio), John Shirley-Quirk (Don Pedro), Eric Shilling (Somarone), London Symphony Orchestra conducted by Colin Davis. L'Oiseau-lyre SOL 256-7 (1962)."]}, {"page": "Das Lied von der Erde", "response": ["* Jascha Horenstein, with Alfreda Hodgson and John Mitchinson, BBC Northern Symphony Orchestra (BBC Legends BBC 4042)", "* Raymond Leppard, with Janet Baker and John Mitchinson, BBC Northern Symphony (BBC Legends BBCL 4243-2)"]}, {"page": "Janet Baker", "response": ["* Mahler: Das Lied von der Erde with John Mitchinson and the BBC Northern Symphony Orchestra under Raymond Leppard (BBC Legends, 1977) "]}, {"page": "Rienzi", "response": ["* Edward Downes conducting the BBC Northern Symphony Orchestra. John Mitchinson, Lorna Haywood, Michael Langdon, Raimund Herincx. 1976 (Ponto POCD1040) (Complete and uncut recording of Wagner's \"original\" 1842 version)"]}, {"page": "Symphony No. 1 (Brian)", "response": ["|25 May 1980||Royal Albert Hall, London||London Symphony Orchestra,London Symphony Chorus,London Philharmonic Choir,BBC Singers,BBC Club Choir,Hampstead Choral Society,Bach Choir,English Chamber Choir||Jane Manning (soprano),Shirley Minty (alto),John Mitchinson (tenor),David Thomas (bass)||Ole Schmidt||First performance of corrected edition."]}, {"page": "Die Feen", "response": ["*Die Feen, conducted by Edward Downes with April Cantelo (Ada), John Mitchinson (Arindal), Della Jones (Farzana), Tom McDonnell (Morald) etc. BBC Northern Symphony Orchestra, BBC Northern Singers. Uncut, studio recording (Manchester College of Music), early May 1974. (Deutsche Grammophon Complete Wagner Edition 00289 479675-7)"]}, {"page": "The Greek Passion (opera)", "response": ["* sung in English - John Mitchinson (Manolios), John Tomlinson (Grigoris), Helen Field (Katerina), Geoffrey Moses (Fotis); Czech Philharmonic Chorus; Brno State Philharmonic Orchestra; Sir Charles Mackerras, conductor - Supraphon 1116 3611/2 (recorded Stadion, Brno, 1-6 June 1981)"]}, {"page": "Tristan und Isolde discography", "response": ["|John Mitchinson,Linda Esther Gray,Anne Wilkens,Gwynne Howell,Phillip Joll"]}, {"page": "Opera North: history and repertoire, seasons 1981–82 to 1989–90", "response": ["Notable singers for the company during the period included Josephine Barstow, Lesley Garrett, Jane Eaglen, Lynne Dawson, Sally Burgess, Wilhelmenia Fernandez (of Diva fame), Valerie Masterson, Pauline Tinsley, Felicity Palmer, William Lewis, John Mitchinson, Anthony Rolfe Johnson, Dennis O'Neill, Malcolm Donnelly, Jonathan Summers, David Wilson-Johnson, Sergei Leiferkus, Anthony Michaels-Moore, John Tomlinson, Philip Joll, Andrew Shore and Willard White.", "|1982–83 || Der Freischütz ||  Weber ||  John Mitchinson (Max), Margaret Curphey (Agathe), Malcolm Rivers (Caspar), Kate Flowers (Aennchen) ||  Clive Timms  || colspan=\"2\"|  Revival of  1980–81 production"]}, {"page": "Mahler Symphony No. 8 discography", "response": ["|Erna Spoorenberg, Gwyneth Jones, Gwenyth Annear, Anna Reynolds, Norma Procter, John Mitchinson, Vladimir Ruzdjak, Donald McIntyre", "|Joyce Barker, Elisabeth Simon, Norma Burrowes, Joyce Blackham, Alfreda Hodgson, John Mitchinson, Raymond Myer, Gwyne Howell"]}, {"page": "Frederic Cox", "response": ["Distinguished pupils of his included John Mitchinson, Joseph Ward, Ryland Davies, Anne Howells, Elizabeth Harwood, Rosalind Plowright, Robert Alderson, Dennis O'Neill, Mary Brennan, Sandra Browne, and Ann Murray."]}, {"page": "The Dream of Gerontius discography", "response": ["| John Mitchinson"]}, {"page": "John Mitchinson", "response": ["John Mitchinson may refer to", "* John Mitchinson (bishop) (1833–1918), English-born Bishop of Barbados", "* John Mitchinson (researcher), head of research for the British TV quiz QI", "* John Mitchinson (tenor) (born 1932), English operatic singer"]}, {"page": "Mitchinson", "response": ["*John Mitchinson (bishop), DD (1833–1918), English teacher, Anglican priest, Bishop of Barbados, Master of Pembroke College, Oxford", "*John Mitchinson (researcher), the head of research for the British television panel game QI", "*John Mitchinson (tenor) (born 1932), English operatic tenor"]}, {"page": "1932 in British music", "response": ["*31 March – John Mitchinson, operatic tenor"]}, {"page": "Maureen Guy", "response": ["Guy made her debut as a mezzo-soprano singer at Sadler's Wells Theatre as Dryade in Ariadne auf Naxos. She gave a recital at London's Wigmore Hall, where she sang arias by George Friedrich Händel and Gaetano Donizett in 1957. Guy received praise for her performance and one critic noted \"the assurance with which [she] projected her resonant contralto tone … was irresistible\". The following year, she married the tenor John Mitchinson at Bethel Chapel, Penclawdd. Several of Guy's early engagements were with the London Mozart Players under their founder and conductor Harry Blech. One such concert was the one to mark the 150th anniversary of Joseph Haydn's death at the Royal Festival Hall in May 1959. In 1960, she sang in Schubert's Mass with the same orchestra. She participated in a concert to commemorate astronaut Yuri Gagarin's achievement of being the first human to go into space the following year."]}, {"page": "Irmelin", "response": ["* BBC Artium (1985): Eilene Hannan (Irmelin), Ann Howard (Maid), John Mitchinson (Nils), Michael Rippon (King), Brian Rayner Cook (Rolf); BBC Singers and Concert Orchestra conducted by Norman Del Mar. Recording from a broadcast on BBC Radio 3, 18 December 1984.Worldcat entry for BBC recording of Irmelin accessed 5 March 2020."]}, {"page": "Deaths in December 2021", "response": ["*John Mitchinson, 89, English operatic tenor.John Mitchinson obituary"]}]}}