{"wiki_id": "http://www.wikidata.org/entity/Q6242611", "itemLabel": "John Keeble", "itemDescription": "English pop musician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Keeble", "wikipedia_page": {"main": "John Leslie Keeble (born 6 July 1959) is an English pop and rock drummer. He is best known for his membership of the 1980s new wave band Spandau Ballet.", "link_mentions": [{"page": "1959", "response": ["** John Keeble, English pop and rock drummer"]}, {"page": "Fish (singer)", "response": ["Fish’s debut solo album Vigil in a Wilderness of Mirrors was released in January 1990. Several well known musicians contributed to the album, including former Dire Straits guitarist Hal Lindes, who played guitar on most tracks and also contributed to the writing of three of the album’s songs. Frank Usher, a Fish companion from pre-Marillion times, also contributed. Drums were played by Mark Brzezicki (Big Country) and John Keeble (Spandau Ballet), John Giblin contributed bass and Luís Jardim contributed additional percussion. Backing vocals came from Tessa Niles, who had appeared on Clutching at Straws. Fish also composed the theme music for the 1990s BBC TV series Between the Lines."]}, {"page": "Band Aid (band)", "response": ["*John Keeble (Spandau Ballet)"]}, {"page": "Spandau Ballet", "response": ["The band's classic line-up featured Gary Kemp on guitar, synthesiser and backing vocals, his brother Martin Kemp on bass, vocalist Tony Hadley, saxophonist Steve Norman and drummer John Keeble. Gary Kemp was also the band's songwriter. Their debut single, \"To Cut a Long Story Short\", reached No. 5 in the UK in 1980. It was the first of ten UK top 10 singles. The band peaked in popularity in 1983 with the album True, with its title track reaching No. 1 in the UK and the top five in the US. In 2011, it received a BMI award as one of the most played songs in US history with four million airplays. In 1984, they received a Brit Award for technical excellence and were the first act to be approached by Bob Geldof to join the original Band Aid line-up. In 1985, they performed at the Live Aid benefit concert at Wembley Stadium.", "Gary Kemp and Steve Norman first decided to form a band, both playing guitar, in October 1976 after witnessing The Sex Pistols perform that summer at Islington's Screen on the Green. Close friends and school mates at Dame Alice Owen's in Islington, they were joined by John Keeble on drums, Michael Ellison on bass and Tony Hadley on vocals when the school relocated to Potters Bar. They rehearsed at lunchtimes in the school's music room, playing sped-up versions of The Rolling Stones’ \"Silver Train\", The Beatles \"I Wanna Be Your Man\" and The Animals \"We've Gotta Get Out of This Place.\" They also played an original Gary Kemp composition, \"I've Got Roots\", which inspired their band name, Roots. Their first gig was a fourth-form Christmas party December 1976 in the school dining room.", "Gary and Martin Kemp took the leading roles as notorious East End gangster twins Ronald and Reginald Kray in The Krays which premiered in London in April 1990. The film won two Evening Standard British Film Awards for Best Film and Most Promising Newcomer (writer Philip Ridley). Tony Hadley recorded his first solo album in Los Angeles produced by Ron Nevison. Steve Norman moved to Ibiza to collaborate on chilled out Balearic records with local producers. John Keeble continued as drummer with Tony Hadley and formed his own band, 69 Daze, with former Sigue Sigue Sputnik guitarist Neal X, followed by 99 shows across Europe with The Herbs and Pacific with guitarist John McGeoch.", "The band confirmed the rumours at a press conference on 25 March 2009, on board HMS Belfast in London, a return to the venue of one of their first gigs to announce their comeback tour. They were introduced by friend and broadcaster Robert Elms after a Billy's and Blitz era DJ set by Rusty Egan. John Keeble and Gary Kemp revealed current musical influences as The Killers, Kaiser Chiefs, MGMT and Florence and the Machine.", "* John Keeble – drums, percussion, backing vocals (1979–1990, 2009–2019)"]}, {"page": "List of drummers", "response": ["* John Keeble (Spandau Ballet)"]}, {"page": "True (Spandau Ballet album)", "response": ["* John Keeble – drums"]}, {"page": "Tony Hadley", "response": ["Hadley co-founded Spandau Ballet in 1976 as The Cut, with Gary Kemp, Steve Norman, John Keeble and Michael Ellison, all of whom were students at Dame Alice Owen's Grammar School. As a member of Spandau Ballet, Hadley went on to enjoy international success in the 1980s, including hits such as \"True\", \"Gold\" and \"Through the Barricades\", as well as appearing at Live Aid in 1985.", "In April 1999, Hadley, along with fellow band members Steve Norman and John Keeble, failed in their attempt to sue Gary Kemp, the band's songwriter, for a share of his royalties. On 25 March 2009, it was confirmed that the band had reformed with Hadley and were embarking on a tour of the UK and Ireland in October 2009. Hadley remained a member of the band intermittently until 2017, when he announced his permanent departure. He later said in 2020: \"I'd rather be happy on my own than be in that band again.\"", "He also collaborated, in the past and present, with various dance acts and DJs, such as Tin Tin Out, Eddie Lock, Marc et Claude, Regi Penxten (Milk Inc.) and the Disco Bros, and played alongside people such as Alice Cooper, Paul Young, Jon Anderson, and Brian May. In 1999, Alan Parsons chose him as lead singer for the track \"Out of the Blue\" on the album The Time Machine. Hadley's usual band line up features John Keeble (drums), Phil Taylor (keyboards), Phil Williams (bass guitar), Richie Barrett (guitar), and Dawn Joseph on backing vocals. His early band, with whom he released his debut album, included, besides himself and Keeble, Spandau Ballet's regular keyboard player Toby Chapman, Jerry Stevenson (guitar) and Kevin Miller (bass guitar)."]}, {"page": "Steve Norman", "response": ["Steve Norman was born in Stepney, east London, and was considered a musical child prodigy. He started pursuing an interest in popular music as a guitarist in a Dame Alice Owen's School band called The Cut with Gary Kemp, Tony Hadley and John Keeble in 1976. The band was later named The Makers, The Gentry and then Spandau Ballet.", "Because of a dispute over royalties, the band split up in the early 1990s. After a 20-year hiatus, newspaper reports claimed early in 2009 that Spandau Ballet was set to reform later that year. On 25 March 2009, Norman, Gary Kemp, Martin Kemp, Tony Hadley and John Keeble announced their reunion at a press conference on board . The band also announced their 'Reformation Tour' starting in October 2009."]}, {"page": "Blitz Kids", "response": ["* John Keeble (Spandau Ballet)"]}, {"page": "Gary Kemp", "response": ["The first band he formed with Alice Owen's schoolmates Steve Norman, John Keeble and Tony Hadley was called Roots after Kemp and Norman saw the Sex Pistols perform at The Screen On The Green in August 1976. The band changed its name to The Cut then became power pop group The Makers, favourably reviewed by New Musical Express in Dec 1977. Martin Kemp joined as bass player when they became Gentry in July 1978 before transforming into Spandau Ballet and playing live for the first time at Blitz on Weds 5 December 1979. The band's early success was driven by London's burgeoning nightclubbing scene in which Gary Kemp identified Spandau's role: \"We are making the most contemporary statement in fashion and music.\"", "After recording Spandau Ballet's final album Heart Like a Sky, in 1989, Kemp and his brother returned to acting. He earned criticism from his fellow band members Tony Hadley, Steve Norman and John Keeble, but received good reviews for his performance as Ronnie Kray in The Krays (1990). The success of this film was the death-knell for Spandau Ballet."]}, {"page": "Do They Know It's Christmas?", "response": ["*John Keeble (Spandau Ballet)"]}, {"page": "John McGeoch", "response": ["In 1992 he was invited by the Icelandic band the Sugarcubes to play the guitar track on the song \"Gold\" for their Stick Around for Joy long-player. In early 1990s, without a band, he ended his career seeking to form one via a variety of short-lived ventures, including working with Glenn Gregory and the songwriter/producer Keith Lowndes. With John Keeble of Spandau Ballet and vocalist Clive Farrington of When in Rome, he formed a line-up provisionally titled 'Pacific', but no commercial material came of it."]}, {"page": "Vigil in a Wilderness of Mirrors", "response": ["Fish had departed Marillion in 1988. Although the recordings for this album finished as early as June 1989, EMI Records decided to delay the release until early 1990 to avoid collision with Marillion's album Seasons End, released in September. However, the track \"State of Mind\", featuring guest musician John Keeble from Spandau Ballet on drums, was released as a single as early as 16 October 1989, more than three months ahead of the album. Further singles from the album were \"Big Wedge\" (the actual lead single, 27 December 1989), \"A Gentleman's Excuse Me\" (5 March 1990) and \"The Company\" (18 July 1990, only released in Germany).", "The album covers a variety of musical styles, including progressive rock (\"Vigil\"), pop rock (\"Big Wedge\"), hard rock (\"View From the Hill\"),  and folk music (\"The Company\"). As he is primarily a lyricist and not a musical composer, Fish collaborated with keyboardist Mickey Simmonds in writing all songs except \"View From the Hill\", which was co-written and recorded with current Iron Maiden guitarist Janick Gers. Ex-Dire Straits guitarist Hal Lindes contributed additionally to the writing of \"State of Mind\", \"Family Business\" and \"Cliché\". He also played guitar on most tracks, along with Frank Usher, a Fish companion from pre-Marillion times. Drums were handled by Mark Brzezicki (of Big Country), John Keeble (of Spandau Ballet, \"State of Mind\" only), bass by John Giblin, additional percussion by Luís Jardim, backing vocals by Tessa Niles, who had already appeared on Clutching at Straws, Marillion's last album with Fish (1987), and Carol Kenyon. Apart from these, there  are performances on individual songs by The Kick Horns (brass instruments on \"Big Wedge\"), Davy Spillane (pipes and tin whistle on \"Vigil\"), Phil Cunningham (tin whistle, bodhran, accordion on \"The Company\", \"Internal Exile\"), Aly Bain (violin on \"The Company\", \"Internal Exile\") and Gavyn Wright (credited as Gavin Wright, violin on \"The Company\", orchestral arrangement on \"A Gentleman's Excuse Me\", which was recorded with a 23-piece orchestra at Abbey Road Studios).", "*John Keeble – drums (3)"]}, {"page": "Department S (band)", "response": ["In February 2007, a reunited Department S (guitarist Herbage, drummer Mizon and former keyboardist Roxy, now on vocals) recorded their first new single in 26 years, a cover version of Alvin Stardust's 1973 hit \"My Coo-Ca-Choo\", with guest musicians Mark Bedford of Madness on bass, Terry Edwards on brass and Michelle Brigandage on backing vocals. It was released on Sartorial Records in October. Several other new tracks were recorded at that time, including \"Wonderful Day\" (which included guest contributions from Edwards, Glen Matlock and Marco Pirroni) and \"God Squad Saviour\" (with John Keeble of Spandau Ballet guesting on drums)."]}, {"page": "Simmons (electronic drum company)", "response": ["The SDS 5 (or SDSV; notated as SDS-5) was developed in conjunction with Richard James Burgess of Landscape and released in 1981. The first recordings of the instrument were made by Burgess, on From the Tea-rooms of Mars ...., \"Chant No. 1\" by Spandau Ballet, and \"Angel Face\" by Shock. After Burgess and Spandau Ballet appeared on Top of the Pops with the instrument, many other musicians began to use the new technology, including A Flock of Seagulls, Howard Jones, Jez Strode of Kajagoogoo, John Keeble of Spandau Ballet, Roger Taylor of Duran Duran, Darren Costin of Wang Chung, Steve Negus of Saga, Bobby Z., Rick Allen of Def Leppard, Thomas Dolby, Prince, Phil Collins, Neil Peart, Bill Bruford, Talk Talk, Tangerine Dream, Cameo, Jonzun Crew, Depeche Mode, Jean-Michel Jarre and Vangelis.", "*John Keeble of Spandau Ballet"]}, {"page": "Simmons SDS-V", "response": ["Burgess pioneered the use of the SDS-V, triggering the prototype version with a Roland MC-8 Microcomposer in 1979 to make Landscape's groundbreaking computer-programmed futurist album From the Tea-Rooms of Mars... To the Hell-Holes of Uranus. Burgess's original concept had been to make a machine which could be played by a drummer as a replacement for acoustic drums. This idea was developed from dealing with the problems of audio spill via the microphones on a live stage and was fleshed out via an article he wrote for Sound International Magazine in 1979 called \"Skin and Syn\". He finally recorded the first example of the SDS-V to be played by a drummer in 1981 when he produced the Spandau Ballet hit, \"Chant No. 1 (I Don't Need This Pressure On)\", featuring John Keeble on the now famous hexagonal pads and the first production SDS-V 'brain', which immediately became popular with several 1980s musicians.", "*John Keeble of Spandau Ballet"]}, {"page": "University of Oregon Press", "response": ["Dialogues With Northwest Writers Dialogues With Northwest Writers, University of Oregon Press, 2001, Paperback, 284 pages, . (originally published in 1982) features interviews with writers such as Ursula K. Le Guin, Tom Robbins, Lawson Fusao Inada, John Keeble, Richard Hugo, James Welch, Mary Barnard and others about their writings and inspirations.Dialogues With Northwest Writers ~ Powell's Books review"]}, {"page": "To Cut a Long Story Short", "response": ["*John Keeble – drums"]}, {"page": "Journeys to Glory", "response": ["* John Keeble – drums"]}, {"page": "Diamond (Spandau Ballet album)", "response": ["* John Keeble – electronic drums"]}, {"page": "Parade (Spandau Ballet album)", "response": ["* John Keeble – drums "]}, {"page": "Through the Barricades", "response": ["* John Keeble – drums"]}, {"page": "Heart Like a Sky", "response": ["* John Keeble – drums, drum programming, arrangements (1–4, 6–9)"]}, {"page": "Arsenal F.C. supporters", "response": ["*Tony HadleyFamous Fans: Tony Hadley and John Keeble. Arsenal F.C..com (2 April 2009). Retrieved 25 August 2012.", "*John Keeble"]}, {"page": "State of Mind (Fish song)", "response": ["The a-side track is a slow to mid-tempo rock song with strong bass and percussion elements and some Celtic folk elements. Lyrically, the song articulates the general political discontent in the late Thatcher years. In terms of music, lyrics and general mood, it is perhaps closest to the Marillion song \"Sugar Mice\" (1987). The b-side \"The Voyeur (I Like To Watch)\" is a harder, although mainly keyboard-based rock song, somewhat similar to Peter Gabriel's \"Shock the Monkey\"; and \"Intruder\", the lyrics criticise \"TV voyeurism\". \"The Voyeur\" was also included as a bonus track on the CD version of Vigil in a Wilderness of Mirrors. Fish co-wrote both tracks with keyboardist Mickey Simmonds, the dominant musical composer on his debut solo album. Guitarist Hal Lindes has additional credits on \"State of Mind\". Drums are played by John Keeble, best known for his membership of 1980s pop group Spandau Ballet.", "*John Keeble - Drums"]}, {"page": "Julian Colbeck", "response": ["In 1991, Colbeck released a solo album Back to Bach, [EG/Virgin] collaborating with concert pianist Jonathan Cohen, plus Steve Hackett, Milton McDonald, John Keeble, Mary Hopkin, and the Irish poet Brian Keenan."]}, {"page": "The Best American Short Stories 1994", "response": ["|John Keeble || \"The Chasm\"  || Prairie Schooner  "]}, {"page": "Keeble", "response": ["* John Keeble, British pop musician"]}]}}