{"wiki_id": "http://www.wikidata.org/entity/Q6249049", "itemLabel": "John Moffat", "itemDescription": "Royal Navy officer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Moffat_(Royal_Navy_officer)", "wikipedia_page": {"main": "John William Charlton Moffat (17 June 1919 – 11 December 2016) was a Royal Navy Fleet Air Arm pilot, widely credited as the pilot whose torpedo crippled the German battleship Bismarck  and author of the biographical I sank the Bismarck. \nMoffat took part in the courageous strike on the German battleship Bismarck during its Atlantic sortie, codenamed Operation Rheinübung, on 26 May 1941 whilst flying a Fairey Swordfish biplane.", "link_mentions": [{"page": "June 17", "response": ["*  1919   – John Moffat, Scottish lieutenant and pilot (d. 2016)"]}, {"page": "Sink the Bismarck!", "response": ["The aircraft carrier  is briefly shown as herself, despite the postwar addition of a large angled flight deck and a massive Type 984 \"searchlight\" radar; the same ship is also used to depict HMS Ark Royal sailing from Gibraltar. All flying from both carriers was filmed aboard  – clearly marked with her postwar pennant number R06 – and three surviving Fairey Swordfish aircraft were restored, of which two were flown from her flight deck. These three aircraft now form the core of the Royal Navy Historic Flight.\"Fairey Swordfish\". Royal Navy Historic Flight, 2011. Retrieved 1 December 2013. A 2010 article in Aeroplane identifies the Swordfish flown in the production: LS326, carrying its true serial, was marked as \"5A\" of 825 Naval Air Squadron, while NF389 was marked as LS423 / \"5B\".Howard, Lee. \"Return of the Stringbag\". Aeroplane, Volume 38, Number 12, Number 452, December 2010, p. 48. The same actor plays the leader of the Swordfish attack from HMS Victorious (in reality, Lt Cdr Eugene Esmonde VC, DSO), and also the pilot from HMS Ark Royal who later fired the torpedo which crippled Bismarcks steering gear (in reality Lt John Moffat RNR)."]}, {"page": "May 1941", "response": ["*The last battle of the battleship Bismarck began in the Atlantic Ocean. That morning a British Catalina reconnaissance aircraft spotted the Bismarck. Starting at dusk, ships and aircraft of the Royal Navy and Royal Air Force attacked the battleship with torpedoes. A hit from a Fairey Swordfish torpedo bomber flown by John Moffatt damaged the Bismarck's rudder."]}, {"page": "1919 in the United Kingdom", "response": ["** John Moffat, Scottish Royal Navy pilot (died 2016)"]}, {"page": "John Moffat", "response": ["John Moffat may refer to:", "*John Moffat (physicist) (born 1932), professor and physicist", "*John Moffat (missionary) (1835–1918), British missionary and imperial agent in southern Africa", "*John Moffat (mining pioneer) (1841–1918), Scottish-born mining entrepreneur in Australia", "*John Moffat (Royal Navy officer) (1919–2016), Royal Navy Fleet Air Arm pilot", "*John Moffatt (actor) (1922–2012), English actor and playwright", "*John Moffatt (disambiguation)"]}, {"page": "John Moffat (pilot)", "response": ["#REDIRECT John Moffat (Royal Navy officer)"]}, {"page": "Kelso High School, Scotland", "response": ["* John Moffat - Royal Navy officer"]}, {"page": "2016 in the United Kingdom", "response": ["**John Moffat, 97, Royal Navy pilot during the Second World War and veteran of the sinking of the Bismarck."]}, {"page": "Deaths in December 2016", "response": ["*John Moffat, 97, British navy pilot."]}, {"page": "Jock Moffat", "response": ["#redirect John Moffat (Royal Navy officer)"]}, {"page": "Kenneth Pattisson", "response": ["At the time of the attack no official statement was made as to whose torpedo hit Bismarck. Following the recovery of Bismarck in 1998, many historians and the official Royal Navy press release credit John Moffat with that attack"]}]}}