{"wiki_id": "http://www.wikidata.org/entity/Q6241746", "itemLabel": "John Jeffcott", "itemDescription": "British colonial judge", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Jeffcott", "wikipedia_page": {"main": "Sir John William Jeffcott (1796 – 12 December 1837) was the first judge of the Supreme Court of South Australia. He also served as Chief Justice of Sierra Leone.", "link_mentions": [{"page": "Supreme Court of South Australia", "response": ["The Court was endowed with all the common law and probate jurisdiction of the courts of Westminster. The first sessions of the Court were not held until May 1837, presided over by Sir John Jeffcott, the first judge of the court. (The title of Chief Justice was not officially introduced until the coming into force of Act No 31 of 1855-1856.)"]}, {"page": "History of South Australia", "response": ["By 1835, negotiations had been completed for the founding of the new colony of South Australia. Colonel Charles James Napier was first offered the position as Governor, but turned it down because he was not allowed to take a body of troops, and recommended Colonel William Light for the position instead. However, before receiving the recommendation, Lord Glenelg had already appointed Royal Navy Rear-Admiral John Hindmarsh as Governor in January 1836. Light was appointed Surveyor General of South Australia the following month, and various other officials were appointed to other positions: James Hurtle Fisher was Resident Commissioner and Registrar; Robert Gouger, Colonial Secretary; John Jeffcott, Judge; Charles Mann, Advocate-General; Osmond Gilles, Colonial Treasurer; George Strickland Kingston Deputy Surveyor, along with a team of assistant surveyors. (Trove catalogue entry here)"]}, {"page": "Exeter Racecourse", "response": ["The last duel in Devon occurred at the racecourse in 1833, when Peter Hennis, a doctor, and Sir John Jeffcott, a judge, drew pistols over Hennis spreading gossip. Hennis was wounded in the exchange, and died the following week; Jeffcott fled to Sierra Leone."]}, {"page": "Street Naming Committee (Adelaide)", "response": ["|Judge Sir John Jeffcott"]}, {"page": "Henry Jickling", "response": ["On 19 November 1837, Judge John Jeffcott left the colony of South Australia for Tasmania.  This left Jickling as the only lawyer in Adelaide, South Australia's capital; consequently, he was appointed an acting judge while Jeffcott was gone. Jeffcott, however, died at sea on 12 December 1837, leaving Jickling in charge of the Court. Although appointed as a caretaker judge, Jickling was responsible for two important issues: he codified the testamentary causes jurisdiction of the Court and admitted the first practitioners of the Court, in March 1838."]}, {"page": "Edward Castres Gwynne", "response": ["At the end of 1837 Gwynne was appointed clerk of court by the Supreme Court of South Australia judge John Jeffcott. Gwynne left for South Australia, arriving in Adelaide aboard the Lord Goderich on 15 April 1838. His appointment as clerk of court was not confirmed and Gwynne immediately applied for admission to the bar and practised as a barrister. In 1840 he entered into partnership with William Bartley, and later was joined by Charles Mann. Gwynne established a reputation as a lawyer, especially for his knowledge of equity law and the law of property. In 1851 he was nominated to the South Australian Legislative Council, and soon afterwards brought in a bill to establish state aid to religion, which was however defeated. In 1853, during the discussion of the proposed new constitution, he spoke in favour of a nominee upper house, but it was eventually decided that the house should be an elected one with a property qualification for voters. Gwynne was defeated at the election for the council for the seat of East Torrens in 1854, but was elected unopposed to the new Legislative Council in 1857. Gwynne opposed the Robert Torrens real property bill, being afraid that it would have dangerous consequences. Though his opposition was not successful his criticisms had the effect of improving the bill. He was Attorney-General of South Australia in the John Baker ministry which lasted for only 10 days in August 1857, and in 1859 was appointed third judge of the South Australian Supreme Court. In 1867 he became second judge and primary judge in equity. From December 1872 to June 1873 he was acting chief justice, and in February 1877 received extended leave of absence to visit England. Gwynne was never appointed Chief Justice in spite of his seniority; he retired on a pension on 28 February 1881."]}, {"page": "List of judges of the Supreme Court of South Australia", "response": ["Of the judges of the Supreme Court of South Australia, , 14 had previously served in the Parliament of South Australia Edward Gwynne, Sir Richard Hanson, Randolph Stow, Sir Samuel Way, Sir James Boucaut, Richard Andrews, Sir William Bundey, Sir John Gordon, Robert Homburg, Sir Angas Parsons, Sir Charles Abbott, Leo Travers, Len King and Robin Millhouse. In addition, Sir John Jeffcott served as a member of the South Australian Legislative Council concurrent with his brief tenure as a judge in South Australia.", "| data-sort-value=\"Jeffcott, John\" | Sir John Jeffcott ||  ||  ||  ||  || "]}, {"page": "John Barton Hack", "response": ["Hack was born in Chichester, England to Stephen Hack, a banker, and the educational writer Maria Hack (née Barton), sister of the poet Bernard Barton. He was educated at Southgate, Middlesex before going into the leather trade, building up a business in Sussex. On 9 July 1827, Hack married Bridget Watson (born 27 September 1806), daughter of William Watson of Hardshaw, Lancashire. After an illness which affected his lungs, he was advised to move to a warmer climate. While in Portsmouth he met Captain Thomas Lipson, who was fitting out the \"Buffalo\" for its pioneering voyage to South Australia. This new colony captured his imagination. He read Robert Torrens's book The Colonization of South Australia and met with Edward Gibbon Wakefield and some members of the South Australian Company and was so convinced of the colony's future that he sold up his considerable business interests and purchased three 134-acre sections with their three accompanying town acres. In September 1836 he embarked with his wife, six children and younger brother Stephen (who was to become an explorer of some noteMr. Hack's Exploring Expedition South Australian Register 27 October 1857 p.3 accessed 7 September 2011 and father of Wilton Hack), on the Isabella, commanded by Captain Hart for the owner Griffiths of Launceston, Van Diemen's Land. A surprise last-minute addition to the passenger list was Sir John Jeffcott, who had been appointed Chief Justice of South Australia, and was \"slipping away\" surreptitiously to avoid creditors. The Isabella's first stop in Australia was Launceston, where he spent a month purchasing livestock and equipment, which were loaded on the Isabella for shipping to South Australia.Street Corner History: Barton Terrace Register News-Pictorial 19 September 1929 p.5 accessed 7 September 2011 His purchases included nearly 400 sheep, six cows and a bull, ten bullocks, a large wagon and a dray, three horses and a Timor pony. Another livestock importer from Launceston aboard the Isabella was Henry Jones (1799-1889), son of a prosperous London oil merchant, and, like Hack, an influential colonist.Yelland, E.M., Henry Jones, Esq., J.P. (1799-1889), South Australian pastoralist and pioneer, Pioneers Assoc. of S.A. pamphlet, 1969.", "Hack also became involved in public life, sitting on the Street Naming Committee, which decided the names of streets that now run through Adelaide city centre and North Adelaide, as well as the Chamber of Commerce and several other bodies. As part of his business ventures, he was paid £800 for cutting the original channel in Port Adelaide. In 1838, he purchased Blenkinsop's whaling station at Encounter Bay (Blenkinsop had drowned with Sir John Jeffcott at the Murray Mouth the previous December). He squatted 400 head of cattle at Mount Barker, but was moved on in 1839. Not put off, he then bought  of land at nearby Echunga Springs and made his home there. His farming venture was initially very successful and it was at this time that he planted some of the first wine-grape vines in the colony. A drawing of his farm by George French Angas, possibly from a sketch by Gawler may be viewed here. (A similar hand-tinted lithograph by J. Hitchen used by Gawler to support his strategy of attracting wealthy immigrants can be viewed here)Kerr, Joan (ed) Painters, Sketchers, Photographers and Engravers to 1870 p.289 \"Gawler, George\" Oxford University Press, Melbourne "]}, {"page": "Peter Hennis", "response": ["In May 1833, Hennis had a disagreement with Sir John Jeffcott which resulted in a duel with pistols on 10 May. Hennis later died on 18 May 1833 from his wounds."]}, {"page": "John Moore Jeffcott", "response": ["John Jeffcott married Lucy Mylrea of Orrisdale in the parish Michael. The marriage produced seven children, five daughters and two sons.", "His elder son, also named John Jeffcott, became an engineer in Vancouver, British Columbia, in the service of the Pacific Steam Navigation Company. His other son, William Lowther Jeffcott, predeceased him in 1877.Manx Sun. Saturday, November 26, 1887; Page: 4 "]}, {"page": "William Jeffcott", "response": ["Born in Ireland, he obtained a bachelor of arts from Trinity College, Dublin and in 1828 he was called to the Irish Bar. In 1836 his brother John Jeffcott became the first judge of the Supreme Court of South Australia. In June 1843, Jeffcott migrated to the Colony of New South Wales."]}, {"page": "Jeffcott", "response": ["* John Jeffcott (1796–1837), first judge of the Supreme Court of South Australia"]}, {"page": "O'Connell Street, North Adelaide", "response": ["The street was named on 23 May 1837 at a meeting between the Governor John Hindmarsh, the Colonial Secretary Robert Gouger and several advisers including judge John Jeffcott. It has been suggested that it was not named, as might have been presumed, for Irish political leader and Catholic emancipist Daniel O'Connell who was then at the peak of his career, but his son parliamentarian Maurice O'Connell, a fellow student of Jeffcott's at Trinity College and fellow expatriate of Tralee, Kerry."]}, {"page": "Jeffcott, John", "response": ["#redirectJohn Jeffcott"]}, {"page": "Jeffcott Street", "response": ["Jeffcott Street was named in 1837 at a meeting to set street names after John Jeffcott, the  first judge of the Supreme Court of South Australia and one of the members of the committee."]}]}}