{"wiki_id": "http://www.wikidata.org/entity/Q6245039", "itemLabel": "John Lloyd", "itemDescription": "British journalist, born 1946", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Lloyd_(journalist)", "wikipedia_page": {"main": "John Lloyd (born 15 April 1946) is a journalist, presently contributing editor to the Financial Times and an Associate Fellow of Nuffield College, Oxford.", "link_mentions": [{"page": "April 15", "response": ["*1946 – John Lloyd, Scottish journalist and author"]}, {"page": "Margaret Thatcher", "response": ["According to theatre critic Michael Billington, Thatcher left an \"emphatic mark\" on the arts while prime minister. One of the earliest satires of Thatcher as prime minister involved satirist John Wells (as writer and performer), actress Janet Brown (voicing Thatcher) and future Spitting Image producer John Lloyd (as co-producer), who in 1979 were teamed up by producer Martin Lewis for the satirical audio album The Iron Lady, which consisted of skits and songs satirising Thatcher's rise to power. The album was released in September 1979. Thatcher was heavily satirised on Spitting Image, and The Independent labelled her \"every stand-up's dream\"."]}, {"page": "John Pilger", "response": ["John Lloyd in the Financial Times said The War You Don't See was a \"one-sided\" documentary which \"had no thought of explaining, even hinting, that the wars fought by the US and the UK had a scrap of just cause, nor of examining the nature of what Pilger simply stated were \"lies\" – especially those that took the two countries to the invasion of Iraq\"."]}, {"page": "John Lloyd", "response": ["John Lloyd may refer to:", "*John Lloyd (graphic designer) (born 1944), co-founder of design consultancy Lloyd Northover", "*John Lloyd (journalist) (born 1946), Scottish-born writer, journalist and publicist", "*John Lloyd (producer) (born 1951), British television producer and comedy writer", "*John Lloyd (Australian footballer) (born 1945), father of Matthew Lloyd", "*John Lloyd (boxer), British Olympic boxer", "*John Lloyd (referee) (born 1948), Welsh former football referee", "*John Lloyd (rugby union) (born 1943), former head coach to Wales national rugby union team", "*John Lloyd (tennis) (born 1954), British tennis player", "*John Lloyd (cricketer) (1844–1910), Welsh cricketer and barrister", "*John Lloyd (Australian politician) (1818–1881), New South Wales politician", "*John Lloyd (Australian public servant), former Australian Public Service Commissioner", "*John Lloyd (brigadier) (1894–1965), Australian soldier and commander 16th Brigade", "*John Lloyd (MP for Denbighshire) (c. 1560–1606), British Member of Parliament", "*John Lloyd (Canadian politician) (1908–1985), member of Canadian House of Commons for Halifax electoral district", "*John Lloyd (Cardiganshire) (c. 1717–1755), Welsh Member of Parliament for Ceredigion", "*John Lloyd (civil servant) (born 1940), formerly Clerk to the National Assembly for Wales", "*John Lloyd (judge) (died 1607), one of the founding fellows of Jesus College, Oxford and judge of the High Court of Admiralty", "*John Lloyd (political reformer) (1833–1915), Welsh-born member of the London County Council", "*John Lloyd (scholar) (1750–1815), Welsh scholar, Fellow of the Royal Society and Member of Parliament for Flintshire", "*Sir John Lloyd, 1st Baronet (died 1664), British Member of Parliament for Carmarthenshire", "*John Lloyd (rector of Caerwys) (1733–1793), Welsh cleric and antiquarian", "*John Lloyd (bishop of St David's) (1638–1687), Vice-Chancellor of Oxford University, 1682–85", "*John Lloyd (bishop of Swansea) (1847–1915), Welsh suffragan bishop", "*John Lloyd (vicar of Cilcain) (1754–c. 1807), Welsh clergyman and academic", "*Saint John Lloyd (died 1679), one of the Catholic Forty Martyrs of England and Wales", "*John Lloyd (archdeacon of Montgomery) (1879–1951), Welsh clergyman", "*John Lloyd Cruz (born 1983), Filipino actor"]}, {"page": "Anglosphere", "response": ["The term Anglosphere was first coined, but not explicitly defined, by the science fiction writer Neal Stephenson in his book The Diamond Age, published in 1995. John Lloyd adopted the term in 2000 and defined it as including English-speaking countries like the United Kingdom, the United States, Canada, Australia, New Zealand, Ireland, South Africa, and the British West Indies. The Merriam-Webster dictionary defines the Anglosphere as \"the countries of the world in which the English language and cultural values predominate\".*"]}, {"page": "Middle East Media Research Institute", "response": ["In 2003 John Lloyd defended MEMRI in the New Statesman:"]}, {"page": "New Statesman", "response": ["After Johnson's departure in 1970, the Statesman went into a long period of declining circulation under successive editors: Richard Crossman (1970–72), who tried to edit it at the same time as playing a major role in Labour politics; Anthony Howard (1972–78), whose recruits to the paper included Christopher Hitchens, Martin Amis and James Fenton (surprisingly, the arch anti-Socialist Auberon Waugh was writing for the Statesman at this time before returning to The Spectator); Bruce Page (1978–82), who moved the paper towards specialising in investigative journalism, sacking Arthur Marshall, who had been writing for the Statesman on and off since 1935, as a columnist, allegedly because of the latter's support for Margaret Thatcher; Hugh Stephenson (1982–86), under whom it took a strong position again for unilateral nuclear disarmament; John Lloyd (1986–87), who swung the paper's politics back to the centre; Stuart Weir (1987–90), under whose editorship the Statesman founded the Charter 88 constitutional reform pressure group; and Steve Platt (1990–96).", "*John Lloyd (1986–1987)"]}, {"page": "Tony Barrell (broadcaster)", "response": ["Barrell made a four-part radio documentary series in the UK in 1987. Two parts, Welcome to the Post-Industrial Museum and Militants on Merseyside, were about the industrial decline of Liverpool and the control of the city council by the Militant tendency; and the other two were about the British press. The Wapping Truth was the story of the Wapping dispute that followed the relocation of News International papers from Fleet Street to Wapping, and Nothing Left to Read was an examination of the perceived bias of most British newspapers in favour of the government of Margaret Thatcher. The programmes included interviews with author Linda Melvern, Tony Benn MP and the then-editor of the New Statesman, John Lloyd."]}, {"page": "Oliver Kamm", "response": ["Kamm was a consistent supporter of former British Prime Minister Tony Blair and the foreign policies of his government. According to John Lloyd in 2005, Kamm viewed Blair's policies \"as the expression of true social-democratic values\". At its launch in 2005, Kamm subscribed to the founding principles of the Henry Jackson Society and was an initial signatory."]}, {"page": "Waid Academy", "response": ["* John Lloyd – Journalist, chiefly for the Financial Times."]}, {"page": "Paul Dacre", "response": ["As recounted by the academic and journalist John Lloyd in 2004, Campbell's assistant in Labour's first term, Tim Allan, believed \"the government [spent] years trying to be chummy with the Daily Mail... Blair sees himself as the great persuader, able to convince anyone. But they didn't want to like him. The government raised far too much time trying to turn the Mail around\".", "According to John Lloyd writing in April 2012, Dacre's newspaper \"is a daily and brilliantly disciplined savaging of government follies, progressive fads and flouters of the time-honoured verities of British and family life\". Dacre, he commented in 2007, is the only \"British newspaper editor who stamps himself on his newspaper every morning\" reflecting \"his unique blend of libertarian-authoritarian Conservatism\". According to Roy Greenslade in The Guardian: \"The Mail is a rare national newspaper in that it is the embodiment of the values and views of its editor rather than its proprietor. It is very much Paul Dacre's paper. This is to the credit of\" Jonathan Harmsworth, 4th Viscount Rothermere \"in the sense that he allows the editor to hold sway\".", "The actor Hugh Grant had accused the Mail of using phone hacking to report on his private life,Among other reasons for Grant's suspicions was his secretly taped conversation with Paul McMullan, a former tabloid journalist and photographer, had said the Mail used phone hacking until about 2006 or 2007. See Hugh Grant \"The bugger, bugged\", New Statesman, 12 April 2011 he told the Inquiry \"voice messages on my mobile\" could be the only source for a February 2007 Mail on Sunday article, although Dacre himself made \"extensive enquiries\" to establish his newspapers had not used phone hacking. John Lloyd in an April 2012 article for the Financial Times wrote that there was \"no evidence that the Daily Mail journalists asked for phones to be hacked\". Dacre accused Grant of indulging in a \"mendacious smear\" in a November 2011 statement for his comment about voice messages.Dacre had been directly involved in drafting the publisher's November 2011 statement according to Liz Hartley, manager of Associated Newspaper's editorial legal services, see Lisa O'Carroll \"Paul Dacre had hand in accusing Hugh Grant of smears, Leveson inquiry hears\", The Guardian, 11 January 2012 Dacre refused to retract his response to Hugh Grant at both appearances at the hearings, unless Grant withdrew his statement. He was quickly recalled on this specific issue,Lisa O'Carroll \"Leveson recalls Paul Dacre over Hugh Grant 'mendacious smears' claim\", The Guardian, 7 February 2012 and again on 9 February 2012, he rejected calls that he should retract his allegation that actor Hugh Grant lied.David Leigh and Josh Halliday \"Daily Mail editor Paul Dacre refuses to retract Hugh Grant accusation\", The Guardian, 9 February 2012."]}, {"page": "Lance Price", "response": ["Price's third book, Where Power Lies, received positive reviews by critics. The Guardian described it as \"witty, well informed and extremely readable\". Progress, a Blairite think-tank, described it as a \"thoughtful reflection on the balance of roles between the Prime Ministers and the Media,\" regarding its focus on Blair's relationship with the media, and how and why future Labour leaders could draw inspiration from it. Rod Liddle argued it was \"required reading for those on both sides\" in the Sunday Times. Total Politics reviewer Peter Riddle surmises that Price places the media question \"firmly in its historical context\". The Financial Times's John Lloyd described the book as an \"elegant and well grounded survey of relations between premieres and the press in the UK over the past century\"."]}, {"page": "Media Standards Trust", "response": ["In light of the June 2011 allegations of the News of the World journalists phone hacking into the mobile phone voice mail of murder victim Milly Dowler, on 5 July 2011 in partnership with Brian Cathcart and other concerned individuals, MST formed the \"Hacked Off\" campaign, registering the site hackinginquiry.org, and campaigning for a public inquiry into phone hacking. The campaign was directly supported by Norman Fowler, Onora O’Neill, Francis Wheen, Tom Watson MP, Ben Goldacre, Baroness Helena Kennedy, Sir David Bell, D. D. Guttenplan, Roy Greenslade, Ian Hargreaves, John Lloyd, Isabel Hilton, Ian Jack, John Pilger, John Prescott, Richard Peppiatt, Andreas Whittam Smith, J. K. Rowling, and others. Actor Hugh Grant supported the campaign and became a public spokesperson, appearing on the BBC television programmes Question Time and Newsnight. The campaign was criticised by Lewis Page in The Register, who described it as a \"secretive pressure group ... of wealthy and powerful individuals and celebrities ... which has successfully campaigned for state control of the media\". In 2012, Hacked Off became independent of the Media Standards Trust. Hacked Off produces a magazine, Free & Fearless."]}, {"page": "John Lloyd (UK journalist)", "response": ["#REDIRECT John Lloyd (journalist)"]}, {"page": "The Fall-Out", "response": ["John Lloyd wrote in The Observer, \"The guilty liberalism he excoriates, in a book that retains a force and a passion and an insistence that you examine the thoughts you think that you think through some 300 finely written pages, is not a definition of the contemporary left, but a barrier to its development.\""]}, {"page": "Nina Fishman", "response": ["She gained a teaching job at Harrow College of Higher Education, which merged with the Polytechnic of Central London in 1990. The polytechnic became the University of Westminster in 1992. She taught there until taking early retirement in 2007, serving from 2004 as Professor of Industrial and Labour History. Following her retirement she moved to Swansea, becoming an honorary research professor at Swansea University. In the 1990s, Fishman was one of several prominent members of Common Voice, a British group that advocated voting reform.Nina Fishman and others, \"Letters\", The Guardian, 2 January 1992, p18. Other signatories of the letter included Gerald Aylmer, Beatrix Campbell, John Lloyd, Dick Pountain, and David Marquand."]}, {"page": "Wallander (Swedish TV series)", "response": ["To coincide with the BBC television adaptation, Wallander, BBC Four began broadcasting the 2005 series to United Kingdom audiences. Before the Frost and Mastermind were shown in November 2008; broadcast of the others began weekly in July 2009. Reviewing The Village Idiot and The Brothers in the Financial Times, John Lloyd wrote:"]}, {"page": "Nomad: From Islam to America", "response": ["Nomad: From Islam to America: A Personal Journey Through the Clash of Civilizations (first published May 18, 2010) is a memoir by Ayaan Hirsi Ali. It is a sequel to her New York Times bestseller Infidel. It deals in greater depth than the earlier book with certain aspects of the author's childhood in Somalia, Kenya and Saudi Arabia, and in particular with her family, as well as with her exile from the Netherlands and her present home with the American Enterprise Institute in the United States. The book is critical of Islam and the multiculturalism which the author sees as enabling Muslim extremism. It sets out to make the case that moderate Christian churches should seek actively to convert Muslim believers.  The book has been praised by Christopher Hitchens, John Lloyd, and Richard Dawkins."]}, {"page": "Christopher and His Kind (film)", "response": ["Less impressed was John Lloyd for the Financial Times who found the gay sex scenes discomfiting. Additionally he thought that the acting was not intense enough, finding the scenes between Christopher and his mother to be the most effective. The film, he concluded, \"wasn’t great but it was bravely done, all the same\"."]}, {"page": "The War You Don't See", "response": ["John Lloyd wrote in the Financial Times that Pilger asserted the British and American media tried to advocate that \"wars were noble, should be fought, and that death for one’s country was both sweet, and right\". Lloyd thought that individuals disagreeing with Pilger's interpretation were \"ruthlessly marshalled into a narrative that gave them no quarter\" and that by juxtaposing \"two strongly put points of view\" those watching \"could have made up\" their own minds. According to Lloyd, Pilger \"showed, in his demolition of propaganda – which is what he calls government statements or politicians’ arguments – the mastery of the propagandist arts\"."]}, {"page": "Neoconservatism: Why We Need It", "response": ["*  A discussion of the book in the New Statesman by John Lloyd"]}, {"page": "Bill O'Neill (media)", "response": ["He brought an interest in trade unionism with him from America and became a vice president of the New South Wales branch of the Printing Industries Employees' Union of Australia.  Disenchanted with union politics,The History of The Times, Graham Stewart, HarperCollins, London, 2005, p. 33;  he joined a research and development team within Murdoch's News Limited and after a short time was selected to lead the company's industrial relations. In 1981 he was sent to London to negotiate with the Fleet Street unions.Tough talker at The Times, Financial Times, February 9, 1981. Written by John Lloyd.  A successful agreement allowed Rupert Murdoch to purchase The Times and Sunday Times. O'Neill and fellow British negotiator, John Collier, were named Joint General Managers of Times Newspapers Limited and appointed to its board."]}, {"page": "List of St Anne's College, Oxford people", "response": ["*John Lloyd – current Supernumerary Fellow, journalist, contributor to the Financial Times, and co-founder of the Reuters Institute for the Study of Journalism at Oxford University"]}, {"page": "UK Late", "response": ["The anchors were journalist John Lloyd and commentator Mary Harron. The television critic of The Times Literary Supplement reviewed it as follows: \"I am not sure what has happened to the spirit of the Sixties, but the corpse is currently being trundled around the television studios. Channel 4’s new late-night talk show, UK Late (July 17), consigned it to a circle of hell superficially disguised as a salon from an existentialist play.\"TLS, Personal column', 24 July 1987"]}, {"page": "Jacob Fortune-Lloyd", "response": ["Fortune-Lloyd was born in the West London Borough of Hillingdon, the son of journalist John Lloyd. Fortune-Lloyd is Jewish. He studied at St. Anne's College, Oxford University where he earned a Bachelor of Arts in English literature. He then went on to train at the Guildhall School of Music and Drama, graduating in 2014. As a student, he performed in various plays such as Agamemnon, The Man of Mode, Guys & Dolls, and Medieval Mystery Plays."]}]}}