{"wiki_id": "http://www.wikidata.org/entity/Q6243416", "itemLabel": "John Kosh", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Kosh", "wikipedia_page": {"main": "John Kosh, known simply as Kosh, is an English art director, album cover designer, graphic artist, and documentary producer/director. He was born in London, England and rose to prominence in the mid-1960s while designing for the Royal Ballet and the Royal Opera House. He was the creative director of The Beatles' 1969 album Abbey Road.", "link_mentions": [{"page": "Let It Be (Beatles album)", "response": ["The LP cover was designed by John Kosh and includes individual photos of the four band members, again taken by Russell. On the front cover, the photos are set in quadrants on a black surround. The album title appears in white text above the images but, as on Abbey Road and other Beatles LPs, the cover does not include the band's name. Written by Apple press officer Derek Taylor, the LP's liner notes described Let It Be as a \"new phase Beatles album\", adding that \"in come the warmth and the freshness of a live performance; as reproduced for disc by Phil Spector\". Martin and Johns were among those listed for \"special thanks\"."]}, {"page": "20th Annual Grammy Awards", "response": ["**John Kosh (art director) for Simple Dreams performed by Linda Ronstadt"]}, {"page": "28th Annual Grammy Awards", "response": ["**John Kosh & Ron Larson (art directors) for Lush Life performed by Linda Ronstadt"]}, {"page": "25th Annual Grammy Awards", "response": ["**John Kosh & Ron Larson (art directors) for Get Closer performed by Linda Ronstadt"]}, {"page": "Hotel California (Eagles album)", "response": ["* Don Henley, John Kosh – art direction", "* John Kosh – design"]}, {"page": "Night in the Ruts", "response": ["*John Berg, John Kosh - art direction, design"]}, {"page": "The Long Run (album)", "response": ["*John Kosh – art direction, design"]}, {"page": "Wedding Album", "response": ["Wedding Album was initially released on Apple on 20 October 1969 in the US, and 7 November 1969 in the UK. The record came as an elaborate box set designed by John Kosh, including sets of photos, drawings by Lennon, a reproduction of the marriage certificate, a picture of a slice of wedding cake (inside a white sleeve), and a booklet of press clippings about the couple. It also included a Mylar bag that had the word \"Bagism\" printed on it. The album did not chart in the UK, but managed to peak at number 178 in the US, staying on the charts for three weeks. Regarding the limited success, Lennon later addressed it saying, \"It was like our sharing our wedding with whoever wanted to share it with us. We didn't expect a hit record out of it. It was more of a... that's why we called it Wedding Album. You know, people make a wedding album, show it to the relatives when they come round. Well, our relatives are the... what you call fans, or people that follow us outside. So that was our way of letting them join in on the wedding\". The album was available on vinyl, cassette tape and 8-track tape, each with the same deluxe packaging. The album was also advertised through magazine print advertisements, which Lennon and Ono's previous two albums had not been. The album was reissued in 1997 through Rykodisc with three bonus cuts – two of them B-sides by The Plastic Ono Band composed by Ono. The album was reissued again in March 2019 on Sean Lennon's Chimera label in collaboration with Secretly Canadian. This edition was released with the two original tracks. The release commemorated the 50th anniversary of the famous Bed-In in the Amsterdam Hilton Hotel in March 1969."]}, {"page": "JT (album)", "response": ["* John Kosh – art direction, design"]}, {"page": "Dad Loves His Work", "response": ["* Art Direction and Design – John Kosh"]}, {"page": "Flag (James Taylor album)", "response": ["* Art Direction and Design – John Kosh"]}, {"page": "Red (King Crimson album)", "response": ["*John Kosh – cover"]}, {"page": "Chicago 16", "response": ["* Original Art Design and Direction by John Kosh and Ron Larson"]}, {"page": "Hi Infidelity", "response": ["* John Kosh – art direction, design "]}, {"page": "The Glow (Bonnie Raitt album)", "response": ["* Art Direction and Design – John Kosh "]}, {"page": "Nether Lands", "response": ["* Design by John Kosh"]}, {"page": "Twin Sons of Different Mothers", "response": ["* John Kosh – art direction, design "]}, {"page": "High Country Snows", "response": ["* Art Direction and Design – Ron Larson and John Kosh"]}, {"page": "The Wild Places (Dan Fogelberg album)", "response": ["* Art Direction and Design – Amy Dakos and John Kosh"]}, {"page": "River of Souls", "response": ["* Art Direction and Design – John Kosh and Brian Wittman"]}, {"page": "No Resemblance Whatsoever", "response": ["* John Kosh – art direction, design "]}, {"page": "Trio (1987 album)", "response": ["* John Kosh – art direction, design"]}, {"page": "Moving Violation", "response": ["The album was arranged by Michael Lovesmith, Arthur G. Wright, Dave Blumberg and James Anthony Carmichael, with Lovesmith and John Bahler being responsible for the vocal arrangements. John Kosh was the album cover's designer with photography credited to Jim Britt."]}, {"page": "Canciones de Mi Padre", "response": ["* John Kosh – art direction, design "]}, {"page": "Stop and Smell the Roses (Ringo Starr album)", "response": ["*John Kosh - artwork"]}, {"page": "Wheels Are Turnin'", "response": ["* John Kosh – art direction, design "]}, {"page": "Trio II", "response": ["* John Kosh – art direction, design"]}, {"page": "Kosh (Art Director, Designer)", "response": ["#REDIRECT John Kosh"]}, {"page": "Badfinger (album)", "response": ["The album cover was designed by John Kosh."]}, {"page": "Tanx", "response": ["*John Kosh - cover design"]}, {"page": "Cry Like a Rainstorm, Howl Like the Wind", "response": ["* John Kosh – art direction, design"]}, {"page": "No Frills (Bette Midler album)", "response": ["* John Kosh – art direction, design"]}, {"page": "Ron Larson (artist)", "response": ["Ron Larson is an art director, album cover designer and graphic artist.  He has won two Grammys for his designs.  He has worked closely with John Kosh and also done many various projects for Disney. He was also responsible for helping with the design of the original Star Wars Episode IV: A New Hope logo as well as designing the logo for The Empire Strikes Back. He rendered the logo for Spinal Tap LP Break Like the Wind and the movie poster for Prince's Under The Cherry Moon. Besides working in both the movie industry and recording industry he was also involved in the art used on video game covers. Larson also helped design the logo used by United Artists Films. He currently teaches graphic design classes for undergraduate students at California State University, Fullerton.", "*Grammy Awards of 1985-John Kosh & Ron Larson (art directors) for Lush Life performed by Linda Ronstadt", "*Grammy Awards of 1982-John Kosh & Ron Larson (art directors) for Get Closer performed by Linda Ronstadt"]}, {"page": "Fearless (Family album)", "response": [" Fearless is the fifth album by the British progressive rock band Family, which was released on 29 October 1971, on Reprise Records in the UK and United Artists Records in the US. It is known for its innovative cover design by John Kosh, using layered-page album headshots of the band's members melding into a single blur."]}, {"page": "Contact (Pointer Sisters album)", "response": ["* Art direction and design by John Kosh and Ron Larson"]}]}}