{"wiki_id": "http://www.wikidata.org/entity/Q6241936", "itemLabel": "John Johnson", "itemDescription": "English association football player (born 1988)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Johnson_(footballer)", "wikipedia_page": {"main": "John James Johnson (born 16 September 1988) is an English footballer who plays as a defender for I-League club RoundGlass Punjab FC. A graduate of the Middlesbrough youth academy, he made his debut for the club against Chelsea. A lack of first team opportunities saw him being loaned to Football League clubs Tranmere Rovers and Northampton Town.\nAfter playing for a season on loan, Northampton signed Johnson on a permanent basis. He was also given club captainship but was replaced in the role after the arrival of Clarke Carlisle. In the 2012–13 season, his appearances for the club were hindered due to a cartilage injury. Johnson then signed for debutant Bengaluru FC in the I-League in India, managed by his former Northampton Town teammate Ashley Westwood. Johnson, along with Kenyan Curtis Osano, became the first foreigners to play for the club. Despite being an English player, he has spent the majority of his professional career playing for Indian clubs such as Bengaluru FC and ATK, in the I-League and Indian Super League.", "link_mentions": [{"page": "John Johnson", "response": ["John Johnson may refer to:", "*John Johnson (astronomer), current Harvard professor", "*John Johnson (composer) (c. 1545–1594), English lutenist and composer", "*John Johnson (musician) (born 1964), trombonist and percussionist with Simply Red", "*John Johnson (reporter) (born 1938), American television reporter and anchor", "*John Johnson (architect, born 1732) (1732–1814), English architect and surveyor", "*John Johnson (architect, born 1807) (1807–1878), English architect", "*John Johnson (architect, born 1843) (1843–1919), English architect", "*John Johnson (trainer) (1917–2016), American football athletic trainer for the New York Giants", "*John Johnson (defensive tackle) (born 1941), American football player", "*John Johnson (linebacker) (born 1968), American football player", "*John Johnson (safety) (born 1995), American football player", "*John Johnson (baseball) (1869–1941), Major League pitcher known as Lou Johnson", "*John Johnson (cricketer, born 1871) (1871–1930), English cricketer", "*John Johnson (rugby league), rugby league footballer of the 1930s", "*John Johnson (basketball) (1947–2016), U.S. basketball player", "*John Johnson (basketball, born 1956), U.S. basketball player", "*John Johnson (footballer) (born 1988), English footballer", "*John Johnson, 8th Seigneur of Sark (died 1723), Seigneur of Sark, 1720–1723", "*Sir John Johnson, 2nd Baronet (1741–1830), loyalist leader during the American Revolution", "*John Johnson (Medal of Honor, 1839) (1839–?), United States Navy sailor", "*John Johnson (Medal of Honor, 1842) (1842–1907), Norwegian-American Medal of Honor recipient", "*John Johnson (Ohio congressman) (1805–1867), politician", "*John Johnson (Kansas City mayor) (1816–1903), mayor of Kansas City, Missouri", "*John Johnson (b. 1833) (1833–1892), Wisconsin State Assemblyman from York, Dane County, Wisconsin", "*John Johnson (Ohio state representative) (born 1937), former member of the Ohio House of Representatives", "*John Johnson (New Jersey), mayor of Paterson, New Jersey", "*John Johnson Sr. (1770–1824), Chancellor of Maryland", "*John Johnson Jr. (1798–1856), Chancellor of Maryland", "*John Johnson (Indiana judge) (1776–1817), associate justice of the Indiana Supreme Court", "*John Johnson, alias of John Cornelius (MP) (died 1567), English politician", "*John Johnson (British politician) (1850–1910), British trade unionist and politician", "*John Johnson (theologian) (1662–1725), English clergyman and theologian", "*John Johnson (baptist) (1706–1791), English minister, founder of the Johnsonian Baptists", "*John Johnson (clergyman) (1769–1833), Church of England clergyman, poet, and editor", "*John Johnson (Latter Day Saints) (1778–1843), early Latter Day Saint and owner of the John Johnson Farm, a historical site in Mormonism", "*Enmegahbowh (c. 1820–1902), also known as John Johnson, first Native American Episcopal priest", "*John Johnson (explorer), Arctic explorer and World War II veteran", "*John Johnson (inventor) (1813–1871), American pioneer photographer and inventor", "*Guy Fawkes (1570–1606) or John Johnson", "*John Johnson, one of the Colchester Martyrs"]}, {"page": "Darius Charles", "response": ["Charles turned down a new contract with Ebbsfleet to sign for newly promoted League Two club Stevenage on a two-year contract for a compensation fee on 18 May 2010. He made his Stevenage debut in the club's 3–1 home victory against Stockport, playing 78 minutes of the match. The following week, he started against Aldershot Town, but was taken off after 38 minutes after struggling with injury. Charles returned to the starting eleven on 18 September 2010, starting in a 0–0 draw against Torquay United, Stevenage's first clean sheet of 2010–11. He scored his first goal for the club in Stevenage's 1–1 draw with Milton Keynes Dons in an FA Cup first round replay in November 2010. Charles' goal came in the fifth minute of stoppage time, taking the match to extra time and then to a penalty shoot-out, which Stevenage won 7–6. Charles received a straight red card for a professional foul on John Johnson in Stevenage's 1–0 home loss to Northampton Town on 11 December 2010, just ten minutes after coming on as a substitute. He scored his second goal for Stevenage in the club's fourth round FA Cup tie against Championship team Reading, cutting inside and curling the ball past the outstretched arm of Adam Federici to restore parity in a match that Stevenage went on to lose 2–1. Charles scored his first league goal of 2010–11 with a shot from 12 yards in Stevenage's 2–1 home win against Bradford City on 2 April 2011. He provided the assist for Joel Byrom's goal after flicking a right-wing cross in Stevenage's 2–0 play-off victory over Accrington Stanley, a match in which he also hit the crossbar with a strike from 30 yards out. Charles started upfront for Stevenage in the 2011 League Two play-off Final, played at Old Trafford on 28 May 2011. Charles' pass through to John Mousinho resulted in the only goal of the match, as a 1–0 victory over Torquay United meant Stevenage were promoted to League One. He played 33 matches for Stevenage during 2010–11, scoring four goals."]}, {"page": "Ashley Westwood (footballer, born 1976)", "response": ["On 2 July 2013 it was announced that Westwood had signed on as the very first head coach of newly founded team Bengaluru FC in the Indian I-League. He made his debut as head coach on 25 August in a pre-season friendly 1–1 draw with the India national football team. Westwood then made his competitive coaching debut with Bengaluru on 22 September in his side's opening league game against Mohun Bagan A.C. at the Bangalore Football Stadium. His side drew the match 1–1 with Sean Rooney scoring the first ever official goal in Westwood's reign. Westwood then coached Bengaluru to their first ever victory in their next match against Rangdajied United at the Bangalore Football Stadium in which goals from Sean Rooney, John Johnson, and Sunil Chhetri saw Bengaluru won the match 3–0. On 21 April 2014, Westwood led Bengaluru FC to the 2013–14 I-League title in their very first season by beating Dempo 4–2 at the Fatorda Stadium. In doing so Westwood became the youngest coach to win the I-League. However, on 24 April 2014, it was announced that Westwood would be suspended for four games after his unsporting behaviour during the match away to Mohun Bagan on 6 April."]}, {"page": "Middlesbrough F.C. Reserves and Academy", "response": ["|  John Johnson || Centre Back || 1"]}, {"page": "Oliver Risser", "response": ["In June 2011, Risser went on a one-week trial with English League Two side Swindon Town, and after three days, manager Paolo Di Canio announced that Risser was to be offered a contract. He signed a two-year deal along with Ibrahim Atiku on the same day, 10 July. Ten days later, on 20 July, he was named Swindon captain for the 2011–12 season. He made a goalscoring debut for Swindon, netting the club's second goal with a 30-yard strike against Crewe Alexandra in a 3–0 win at The County Ground on the opening day of the season. In October 2011, Risser was replaced by Paul Caddis as club captain after losing his place in the side due to a groin injury. He scored his second goal for the club in a 1–1 draw against AFC Wimbledon in the Football League Trophy on 8 November 2011, a game in which Swindon went on to win 3–1 on penalties. Risser received the first red card of his Swindon career in a 2–1 away win against Northampton Town, receiving a straight red card for a tackle on Northampton's John Johnson. He went on to score two further goals during the campaign, in 2–0 victories against Torquay United and Barnet respectively. Risser made 40 appearances during the season, scoring four goals, as Swindon were promoted to League One as champions."]}, {"page": "2008–09 Middlesbrough F.C. season", "response": ["|25 November 2008 || John Johnson ||Tranmere Rovers ||To 31 December 2008 ||", "Following another international break, Middlesbrough's next game was at home to Chelsea. Both sides were missing first-team players, but the quality of Chelsea's reserves showed as they outclassed Boro and ran out 5–0 victors. Hoyte was ruled out injured before the game and so Grounds covered at right-back, while Alves started the game on the bench. The home side were just a goal behind going into half-time, but four goals in twenty-two minutes after the break left Boro dejected, including an own goal from Wheater that was originally credited to Salomon Kalou. John Johnson came on to make his debut as a substitute for Grounds around the hour mark on a \"horrendous day\" for his club."]}, {"page": "2009–10 Middlesbrough F.C. season", "response": ["On 23 September, John Johnson was loaned out to Northampton Town for one month.", "| John Johnson"]}, {"page": "2009–10 Northampton Town F.C. season", "response": ["| 3 || RB || style=\"text-align:left;\" |  John Johnson", "| Young Player of the Year || RB || John Johnson", "| 24 September 2009 || DF ||  || John Johnson || Middlesbrough || 30 June 2010 ||align=\"center\"| Cobblers Bring In Boro Defender ntfc.co.uk. 24 September 2009. Retrieved 8 January 2010."]}, {"page": "2010–11 Middlesbrough F.C. season", "response": ["|  John Johnson"]}, {"page": "2010–11 Northampton Town F.C. season", "response": ["| John Johnson", "| 14 || RB || style=\"text-align:left;\" |  John Johnson", "| John Johnson"]}, {"page": "2011–12 Football League Two", "response": ["| John Johnson"]}, {"page": "2011–12 Northampton Town F.C. season", "response": ["| John Johnson2", "| 14 || RB || style=\"text-align:left;\" |  John Johnson"]}]}}