{"wiki_id": "http://www.wikidata.org/entity/Q6241890", "itemLabel": "Ricky Wilde", "itemDescription": "British songwriter, musician, record producer, landscape gardener and brother of singer Kim Wilde, and son of the singer and actor, Marty Wilde", "wikipedia_url": "https://en.wikipedia.org/wiki/Ricky_Wilde", "wikipedia_page": {"main": "Ricky Wilde (born Richard James Reginald Steven Smith, 6 November 1961, sometimes credited as Ricki Wilde) is a British songwriter, musician, and record producer. He is the younger brother of singer Kim Wilde (the two are \"Irish twins\", having been born slightly less than one year apart); their father is singer-actor Marty Wilde.", "link_mentions": [{"page": "Orchestral Manoeuvres in the Dark", "response": ["OMD influenced several 1980s contemporaries, including Men Without Hats and Depeche Mode. Vince Clarke, who established the latter group's electronic direction and later founded Yazoo and Erasure, cites OMD as his inspiration to become an electronic musician. OMD were an important act for Pet Shop Boys, whose singer, Neil Tennant, identified the band as \"pioneers of electronic music\". The group were revered by Frankie Goes to Hollywood, Howard Jones, Alphaville, Book of Love and Ricky Wilde (songwriter/producer for Kim Wilde), and were also influential on New Order and Tears for Fears' exploration of electronic instruments. The band have garnered praise from other synth-pop peers including the Human League's Philip Oakey, Thompson Twins' Tom Bailey, Trevor Horn, and Gary Numan, who credited OMD for \"some of the best pop songs ever written\". Within the rock genre, the group influenced then-progressive band Spoons, and were championed by ZZ Top, who drew inspiration from OMD's use of synthesizers and onstage dancing."]}, {"page": "Wilde", "response": ["* Marty Wilde (born 1939), British rock and roll singer and actor; father of Kim and Ricky Wilde", "* Marty Wilde (born 1939), British rock and roll singer and actor; father of Kim and Ricky Wilde", "* Ricky Wilde (born 1961), British songwriter, musician, and record producer"]}, {"page": "List of show business families", "response": ["* Singer-songwriter Marty Wilde and singer/actress Joyce Baker are the parents of composer-performer-producer Ricky Wilde and singer-actress Kim Wilde."]}, {"page": "Jonathan King", "response": ["The label's first hit was \"Seaside Shuffle\" by Terry Dactyl and the Dinosaurs, followed by King's \"Loop di Love\", which reached number four, released under the pseudonym Shag.\"Shag\", 45cat.com. Retrieved 31 July 2016. Other signings included Ricky Wilde, then 11 years old and promoted to fill the gap later taken by Donny Osmond, a potential David Cassidy, Simon Turner,Partridge, Rob (23 December 1972). \"New Pop Audience Emerging in U.K.\", Billboard, 10. Roy C, the First Class and Lobo. The label also released King's cover of \"(I Can't Get No) Satisfaction\" (1974) under the name Bubblerock, described as a \"Grateful Dead\"-style country version\", which met the approval of Mick Jagger.\"Jonathan King – Satisfaction\", YouTube."]}, {"page": "You Keep Me Hangin' On", "response": ["\"You Keep Me Hangin' On\" was covered in an updated version by English singer Kim Wilde in 1986. Wilde's version was a total re-working of the original, completely transforming the Supremes' Motown Sound into a hi-NRG song. She and her brother, producer Ricky Wilde, had not heard \"You Keep Me Hangin' On\" for several years when they decided to record it. The song was not a track they knew well, so they treated it as a new song, even slightly changing the original lyrics."]}, {"page": "Marty Wilde", "response": ["He also tried to tap into the growing glam rock boom, releasing the single \"Rock'n'Roll Crazy\" / \"Right On!\" billed as Zappo, and recording as The Dazzling All Night Rock Show (\"20 Fantastic Bands\"), and Ruby Pearl and The Dreamboats (\"The Shang-A-Lang Song\"). None of the releases were a commercial success, and Wilde ditched the glam rock genre,Rutland, David. \"Going Wilde for Marty\", North Wales Live, Cardiff, 15 March 2007. Retrieved on 27 November 2019. going on to work with his son, Ricky Wilde.Marcello, Carlin. \"The Blue In The Air\", published by Zero Books, 2011. Retrieved on 27 November 2019."]}, {"page": "Rick wilde", "response": ["#redirect Ricky Wilde"]}, {"page": "The Vernons Girls", "response": ["Joyce Baker married Marty Wilde; they formed a trio with Justin Hayward called the Wilde Three, and were the parents of singers Ricky Wilde, Roxanne Wilde and  Kim Wilde. ", "*Joyce Smith (born Joyce Baker, 1941) – married Marty Wilde, mother of Kim and Ricky Wilde"]}, {"page": "ARP String Ensemble", "response": ["In 1975, George Harrison used the ARP on his song \"You\", and the same year the Bee Gees played it on their hit \"Nights on Broadway\". Stevie Wonder played the famous string line on Peter Frampton's 1977 ballad \"I'm in You\". The Solina string sound has also been used by Kim and Ricky Wilde, Brian Eno, Fun Lovin' Criminals, The Cure, Gorillaz, The Chameleons, Carpenters, Joy Division, Neil Young, Air, Anthony Cedric Vuagniaux and Rikk Agnew. Fleetwood Mac keyboardist Christine McVie used it on the band's Heroes Are Hard to Find album, most notably on her song \"Come a Little Bit Closer.\" Brian Wilson of The Beach Boys used it on 15 Big Ones and The Beach Boys Love You, Charly Garcia on Pequeñas anécdotas sobre las instituciones, Porsuigieco, La Máquina de Hacer Pájaros, and with Serú Girán. Regional Mexican band Grupo Yndio had used a Solina in their Spanish-language cover of Leo Sayer's hit \"When I Need You\" (\"Me Haces Falta\")."]}, {"page": "Mitch Murray", "response": ["In 1968, Murray became the youngest ever director of PRS for Music. In 1971, he conceived and founded the Society Of Distinguished Songwriters (SODS). Current members include Sir Tim Rice, Guy Chambers, Gary Barlow, David Arnold, Mike Batt, Justin Hayward, Don Black, Marty Wilde, Ricky Wilde, and more than thirty others. Bill Martin, who was also a founding member, died in April 2020."]}, {"page": "Kids in America", "response": ["RAK Records boss Mickie Most heard Wilde singing on a backing track to another song recorded by her brother Ricky Wilde, an aspiring young songwriter and producer who had some fame as a child singer in the style of Donny Osmond in the early 1970s.Hitlåtens historia: Kids in America. SVT. 2011.", "Category:Songs written by Ricky Wilde"]}, {"page": "Chequered Love", "response": ["\"Chequered Love\" is the second single by British singer Kim Wilde. The song was released in the spring of 1981 to follow Wilde's successful debut \"Kids in America\". As with that single, writing credits were given to Wilde's father and brother Marty and Ricky Wilde, with the latter also being given production credits. The 12\" version is no longer in length than the 7\"; however, better sound quality is achieved by the grooves not being as compressed - a common practice for \"marketing\" during the 1980s. The song later appeared on Wilde's self-titled debut album.", "Category:Songs written by Ricky Wilde"]}, {"page": "Water on Glass", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "Cambodia (song)", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "View from a Bridge", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "Child Come Away", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "Love Blonde", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "Dancing in the Dark (Kim Wilde song)", "response": ["* Ricky Wilde : Keyboards, bass, Linn programmes, synclavier, backing vocals"]}, {"page": "House of Salome", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "The Second Time", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "The Touch (Kim Wilde song)", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "Rage to Love", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "Schoolgirl (song)", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "You Came", "response": ["\"You Came\" is a song by English singer Kim Wilde from her sixth studio album, Close (1988). It was released on 4 July 1988 as the album's second single. The song was written by Wilde and Ricky Wilde, after the birth of his first child, Marty.", "Category:Songs written by Ricky Wilde"]}, {"page": "Never Trust a Stranger", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "Four Letter Word (Kim Wilde song)", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "Love in the Natural Way", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "It's Here", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "Time (Kim Wilde song)", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "Can't Get Enough (Of Your Love)", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "World in Perfect Harmony", "response": ["Category:Songs written by Ricky Wilde"]}, {"page": "I Can't Say Goodbye (Kim Wilde song)", "response": ["Category:Songs written by Ricky Wilde"]}]}}