{"wiki_id": "http://www.wikidata.org/entity/Q6242706", "itemLabel": "John Kelly", "itemDescription": "Lancashire and Derbyshire cricketer (1922-1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Kelly_(Lancashire_and_Derbyshire_cricketer)", "wikipedia_page": {"main": "John Martin Kelly (19 March 1922 – 13 November 1979)  was an English cricketer who played first-class cricket for Lancashire from 1947 to 1949 and for Derbyshire from 1950 to 1960.\nKelly was born at Bacup, Lancashire. He was playing for Bacup as a teenager in 1938 and 1939, and again in 1946 after World War II. Also in 1946 he played a match for Lancashire second XI. For the next three years at Lancashire he played mainly for the second team, but made a first-class appearance against Hampshire in August when he scored a duck. He played two first-class games in 1948, retiring hurt against Derbyshire. He played three county championship matches in 1949 and started to make reasonable scores but left Lancashire at the end of the season. For Lancashire he played 11 innings in 6 first-class matches with an average of 18.75 and a top score of 58. He bowled just two overs.\nKelly made his debut for Derbyshire in the 1950 season against Surrey when he made 74 in his second innings. He was to play full seasons for the club until 1959 making nearly 9,500 runs. In 1950 he scored 130 against Essex . He made 116 against Hampshire in the 1954 season. In the 1956 season he made his top score of 131 against Middlesex and 104 against Yorkshire. He scored four centuries in the 1957 season with 106 against Yorkshire, 109 not out against Glamorgan, 113 against Gloucestershire and 127 against Leicestershire. In the 1959 season he made 113 not out against Nottinghamshire. He played for Derbyshire second XI in the 1960 season, apart from one match against Yorkshire. In 1962 he was playing for Bacup again.\nKelly was a right-hand batsman and played 437 innings in 259 first-class matches with an average of 23.56 and a top score of 131 among nine centuries. He bowled about 34 overs and took one wicket for an average of 103.00.Kelly died at Rochdale at the age of 57.", "link_mentions": {}}}