{"wiki_id": "http://www.wikidata.org/entity/Q6249069", "itemLabel": "John Mogg", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Mogg_(British_Army_officer)", "wikipedia_page": {"main": "General Sir Herbert John Mogg,  (17 February 1913 – 28 October 2001) was a senior British Army officer who also held the NATO position of Deputy Supreme Allied Commander Europe (DSACEUR) and was \"in his time, probably the British army's most popular general\".", "link_mentions": [{"page": "I Corps (United Kingdom)", "response": ["* 1966–1968 Lieutenant-General Sir John Mogg"]}, {"page": "Supreme Allied Commander Europe", "response": ["|7. || General Sir John Mogg || 60px || November 12, 1973 || March 12, 1976||  British Army "]}, {"page": "St. Michaels University School", "response": ["*John Mogg - British Army - DSACEUR"]}, {"page": "Aide-de-camp general", "response": ["| General Sir John Mogg || 6 February 1971 || 6 February 1974 ||"]}, {"page": "Durham Light Infantry", "response": ["* General Sir Herbert John Mogg, GCB, CBE, DSO & bar (17 February 1913 – 28 October 2001) - Commanding Officer 9th Battalion, 14 June 1944-July 1945"]}, {"page": "List of former Parachute Regiment personnel", "response": ["* John Moggformer DSACEUR"]}, {"page": "John Mogg", "response": ["John Mogg is the name of:", "*John Mogg, Baron Mogg, British civil servant and later a life peer", "*Sir John Mogg (British Army officer), senior British Army officer who also held NATO command positions"]}, {"page": "Fairbridge (charity)", "response": ["Operation Drake was launched in 1978 at the suggestion of The Prince of Wales. It was a two-year, round-the-world venture in which 400 young people from 27 nations worked with scientists and servicemen on projects in 16 countries. John Mogg (British Army officer)(also known as Sir Herbert John Mogg) was a chairman of the Operation Drake Fellowship."]}, {"page": "Southern Command (United Kingdom)", "response": ["*1968 Lieutenant General Sir John Mogg"]}, {"page": "List of Old Malvernians", "response": ["* General Sir John Mogg, Deputy Supreme Allied Commander Europe (DSACEUR)"]}, {"page": "Land Command", "response": ["The headquarters, abbreviated as STRATCO, was established on 1 April 1968 in the wake of the government's decision, announced in January of that year, to withdraw all British troops from bases east of Suez. In future Britain's defence efforts would be concentrated 'mainly in Europe and the North Atlantic area'. Its major task was to direct the strategic reserves of the British Army; its headquarters was formed from HQ Southern Command at Erskine Barracks near Fugglestone (Wilton, Wiltshire). The first Commander-in-chief of the new Command was Lieutenant General Sir John Mogg KCB, CBE, DSO, (previously Commander-in-chief, Southern Command), who described the reasoning behind its formation as being: \"to raise the standard and training of field force units to ensure any force sent abroad is correctly prepared, equipped and mounted to carry out its task speedily and successfully\".", "*General Sir John Mogg 1968–1970 "]}, {"page": "List of governors and commandants of Sandhurst", "response": ["*1963–1966: Major-General John Mogg"]}, {"page": "List of British Army full generals", "response": ["| Sir John Mogg"]}, {"page": "1966 New Year Honours", "response": ["* Major-General Herbert John Mogg,  (73153), late Infantry, Colonel Commandant, 1st Battalion The Royal Green Jackets (43rd & 52nd). Colonel Commandant, Army Air Corps."]}, {"page": "1972 New Year Honours", "response": ["* General Sir John Mogg, , (73153), late Infantry. Colonel Commandant, The Royal Green Jackets; Colonel Commandant, Army Air Corps."]}, {"page": "1964 Birthday Honours", "response": ["* Major-General Herbert John Mogg,  (73153), late Infantry; Colonel Commandant, Army Air Corps."]}, {"page": "John Youens", "response": ["In 1978, Youens appeared before a Magistrate having been charged with 'insulting behaviour likely to cause a breach of the peace'. Two police officers stated that they had seen him lift up a girl's skirt, behind whom he was standing, a number of times while watching a tennis match at Wimbledon. The girl was identified as 14 years old. Youens argued that he was in fact unconsciously exercising his left hand; he had undergone surgery on it two years before to cure Dupuytren's contracture and he needed to regularly exercise the hand to keep the circulation going. Having heard a character witness from General Sir John Mogg, the judge found him not guilty. Speaking to the press following the court hearing he stated: 'I'm absolutely delighted my name has been cleared and all I want to do is forget'."]}, {"page": "Adjutant-General to the Forces", "response": ["*1970 to 1973 General Sir John Mogg"]}, {"page": "Deaths in October 2001", "response": ["*Sir John Mogg, 88, British army general."]}]}}