{"wiki_id": "http://www.wikidata.org/entity/Q6242834", "itemLabel": "John Kennedy", "itemDescription": "Australian musician (20th century)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Kennedy_(cellist)", "wikipedia_page": {"main": "John Kennedy (30 December 1922 – 9 February 1980) was a British cellist who had significant associations with Australia, where he worked in the latter part of his life and where he died. He was the father of the violinist Nigel Kennedy.\nJohn Kennedy was born in London. His parents were Australians, the cellist Lauri Kennedy and the pianist Dorothy Kennedy. He studied at the Royal Academy of Music (RAM). At age 24, he became first cello with the Liverpool Philharmonic Orchestra, making him the youngest principal in Great Britain. He joined the Sydney Symphony Orchestra in 1949, as principal, where he performed as soloist in such works as the Elgar Cello Concerto under Otto Klemperer.He taught at the New South Wales Conservatorium of Music for two years and appeared in concerts for Musica Viva Australia. In 1952, he toured New Zealand as part of the Llewellyn-Kennedy Piano Trio with the violinist Ernest Llewellyn and the pianist Scylla Stoner - who was billed as \"Scylla Kennedy\", John's first wife.\nHe returned to the UK, where he was principal cello at Covent Garden. He later became the principal cellist with the Royal Philharmonic Orchestra under Sir Thomas Beecham. He was the first person to perform a cello concerto at the Edinburgh Festival.He returned to Australia as senior cello lecturer at the University of Melbourne Conservatorium. When he left the UK, he ended his marriage with Scylla Stoner. When they divorced he was not aware that Scylla was pregnant by him, and she later gave birth to his son,  the violinist Nigel Kennedy (born 28 December 1956). His mother wanted Nigel taught a string instrument but chose the violin because she did not want a cello in the house as a reminder of John Kennedy. John and Nigel Kennedy did not meet until Nigel was 11. John married the Welsh soprano Joan Dargavel, and had more children (Nigel’s half-siblings), including the bassist Debbie Kennedy and the cellist Laurien Kennedy, who won the 1978 ABC Young Performers Award. John and Joan divorced in 1975. He had a fourth child in 1976, violinist, Erica Kennedy (1st violinist in the Flinders String Quartet). He continued teaching, playing and broadcasting in Australia until he retired in 1979 due to ill health.John Kennedy became an alcoholic and died of liver failure in 1980, at Box Hill, Melbourne.", "link_mentions": [{"page": "John Kennedy (disambiguation)", "response": ["John Kennedy may also refer to:", "*John Kennedy (Australian musician) (born 1958), Australian musician", "*John Kennedy (cellist) (1922–1980), Australian musician", "*John Kennedy (born 1965), British DJ with Radio X (United Kingdom)", "*John Kennedy (Irish celebrity) (fl. 1968, 2009), songwriter", "*John Kennedy (American musician) (fl. 1987), American musician", "*John Kennedy (fl. 1620s), English author of the 1626 poem Calanthrop and Lucilla", "*John Kennedy (puppeteer) (born 1968), American puppeteer ", "*John Kennedy Toole (1937–1969), American novelist", "*John Kennedy (Brazilian footballer) (born 2002), football forward", "*John Kennedy (English footballer) (born 1978), footballer for Bury Town", "*John Kennedy (Northern Irish footballer) (born 1939), football goalkeeper", "*John Kennedy (Scottish footballer) (born 1983), Scottish footballer and manager", "*John Kennedy (Dublin Gaelic footballer) (fl. 1891–1894), Irish Gaelic footballer", "*John Kennedy (Canadian football) (born 1950), Canadian football player", "*John Kennedy Jr. (footballer) (born 1959), former Australian rules footballer", "*John Kennedy (Gaelic footballer) (fl. 1984–2010), Gaelic football player and manager", "*John Kennedy Sr. (footballer) (1928–2020), Australian football player and coach", "*John Kennedy (canoeist) (fl. 1970s), American canoeist", "*John Kennedy (cricketer) (born 1931), English cricketer", "*John Kennedy (cyclist) (1931–1989), British cyclist", "*John Kennedy (hurler) (born 1964), retired Irish hurler", "*John Kennedy (racing driver) (fl. 1970s), American racing driver", "*John Kennedy (rowing) (1900–1971), American coxswain", "*John Kennedy (shortstop) (1926–1998), American Major League Baseball player", "*John Kennedy (third baseman) (1941–2018), American Major League Baseball player", "*John Kennedy (Louisiana politician) (born 1951), United States Senator from Louisiana", "*John Kennedy (Pennsylvania politician) (born 1938), member of the Pennsylvania House of Representatives", "*John Kennedy (Utah politician) (1847–1928), Utah House of Representatives", "*John Kennedy (Manitoba politician) (1867–1927), Canadian politician", "*John Kennedy (public servant) (1884–?), Australian public servant, Controller-General of the Department of Trade and Customs", "*John Kennedy (Medal of Honor) (1834–1910), American soldier", "*Sir John Kennedy (British Army officer, born 1878) (1878–1948), British general", "*Sir John Kennedy (British Army officer, born 1893) (1893–1970), British general", "*John Kennedy (1759–1842), English nurseryman, of Lee and Kennedy", "*John Kennedy, 2nd Lord Kennedy (before 1454–c. 1508/9), Scottish lord", "*John Kennedy, 5th Earl of Cassilis (1575–1615), Scottish peer", "*John Kennedy, 6th Earl of Cassilis (died 1668), Scottish peer", "*John Kennedy, 7th Earl of Cassilis (1653–1701), Scottish peer", "*John Kennedy, 8th Earl of Cassilis (1700–1759), Scottish peer", "*John Kennedy (engineer) (1838–1921), Canadian civil engineer", "*John Kennedy (manufacturer) (1769–1855), Scottish-born textile manufacturer in Manchester, UK", "*John Kennedy (music industry executive) (born 1953), British entertainment lawyer", "*John Kennedy (theologian) (1813–1900), British religious leader and author ", "*John Kennedy (journalist) (1926–1994), New Zealand newspaper editor and political analyst", "*John Kennedy (The Inbetweeners), in the 2009–2010 British sitcom"]}, {"page": "Nigel Kennedy", "response": ["Kennedy's grandfather was Lauri Kennedy, principal cellist with the BBC Symphony Orchestra, and his grandmother was Dorothy Kennedy, a pianist. Lauri and Dorothy Kennedy were Australian, while their son, the cellist John Kennedy, was born in England. After graduating from the Royal Academy of Music in London, at age 22, John joined the Liverpool Philharmonic Orchestra, later becoming the principal cellist of Sir Thomas Beecham's Royal Philharmonic Orchestra. While in England, John developed a relationship with an English pianist, Scylla Stoner, with whom he eventually toured in 1952 as part of the Llewellyn-Kennedy Piano Trio (with the violinist Ernest Llewellyn; Stoner was billed as \"Scylla Kennedy\" after she and John married).  But they ultimately divorced, and John returned to Australia. "]}, {"page": "List of cellists", "response": ["*John Kennedy (1922–1980, born in England, moved to Australia)"]}, {"page": "Daisy Kennedy", "response": ["She was a cousin of cellist Lauri Kennedy,Peter Campbell, 'Kennedy, Irvine Robert Laurie (Lauri) (1896–1980)', Australian Dictionary of Biography, Volume 17, Melbourne University Press, pp 617-618. and thus also related to Lauri's son John Kennedy, another cellist, and grandson, the violinist Nigel Kennedy."]}, {"page": "Ernest Llewellyn", "response": ["Llewellyn was appointed Concertmaster of the Sydney Symphony Orchestra in 1949, and Assistant Conductor in 1959.  From 1949 to 1955 he was the leader of the ABC String Quartet.  In 1952 he again toured New Zealand, this time as part of the Llewellyn-Kennedy Piano Trio (with John Kennedy, cello, and Scylla Kennedy, piano; they were the parents of Nigel Kennedy, although they never married)."]}, {"page": "Lauri Kennedy", "response": ["Their son John Kennedy was also a cellist and was the natural father of the violinist Nigel Kennedy."]}, {"page": "Frederick Riddle", "response": ["* Richard Strauss: Don Quixote (recorded with John Kennedy, RPO, Beecham conducting)somm recordings"]}]}}