{"wiki_id": "http://www.wikidata.org/entity/Q6248277", "itemLabel": "John McQuade", "itemDescription": "British footballer (born 1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_McQuade_(footballer)", "wikipedia_page": {"main": "John McQuade (born 8 July 1970) is a Scottish former footballer. A midfielder, he scored 69 goals in 335 league games in a 15-year professional career in the Scottish and English leagues.\nHe began his career with Dumbarton in 1987, helping the club to the Second Division title in 1991–92, before winning a £80,000 move to Hamilton Academical in 1993. He helped the \"Accies\" to win promotion out of the Second Division in 1996–97. In June 1998, he was signed by English club Port Vale, before he returned to Scotland in April 1999 to sign with Raith Rovers. He moved on to Ross County in July 2000, before switching to Peterhead for a one-month spell in January 2002.", "link_mentions": [{"page": "List of Hamilton Academical F.C. players", "response": ["|John McQuade||||1993–1998||82||3||"]}, {"page": "John McQuade (disambiguation)", "response": ["John McQuade (1912–1984) was British soldier and Northern Irish politician.", "John McQuade may also refer to:", "*John McQuade (footballer) (born 1970), Scottish footballer"]}, {"page": "1998–99 Port Vale F.C. season", "response": ["The pre-season saw John Rudge splash out £300,000 on Bristol Rovers forward Peter Beadle and £100,000 on Scunthorpe United defender Michael Walsh. He also signed Dave Barnett (Dunfermline Athletic); Brian McGlinchey and Paul Beesley (Manchester City); and John McQuade (Hamilton Academical) on free transfers. Stéphane Pounewatchy also became the first French player to play for the club when he was signed on a monthly contract from Dundee. Scott Mean was loaned to the club by West Ham United, though he went on to sustain a knee injury during his spell that would damage his career. Also Andy Clarke was signed on loan from Wimbledon.", "At the end of the season there was a complete clear-out, with ten players leaving: ten-year club veteran Neil Aspin (Darlington); Dave Barnett (Lincoln City); Brian McGlinchey (Gillingham); John McQuade (Raith Rovers); Chris Allen (Stockport County); Rogier Koordes (TOP Oss); Jan Jansson (IFK Norrköping);  Paul Mahorn (Stevenage Borough); Stéphane Pounewatchy (Colchester United); and Paul Beesley (Blackpool).", "|align=\"left\"|MF||align=\"left\"| John McQuade", "| June 1998 || MF ||  || John McQuade ||  Hamilton Academical || Free transfer || ", "| April 1999 || MF ||  || John McQuade ||  Raith Rovers || Free transfer || "]}, {"page": "1988–89 Dumbarton F.C. season", "response": ["|  John McQuade"]}, {"page": "1990–91 Dumbarton F.C. season", "response": ["* The League match against East Stirling on 27 April marked John McQuade's 100th appearance for Dumbarton in all national competitions - the 98th Dumbarton player to reach this milestone."]}, {"page": "1993–94 Dumbarton F.C. season", "response": ["| John McQuade"]}]}}