{"wiki_id": "http://www.wikidata.org/entity/Q6244697", "itemLabel": "John Lever", "itemDescription": "English Test and County cricketer (born 1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Lever", "wikipedia_page": {"main": "John Kenneth Lever  (born 24 February 1949) is an English former international cricketer who played Test and One Day International cricket for England. Lever was a left-arm fast-medium bowler who predominantly swung the ball into right-handed batsmen.\nCricket correspondent Colin Bateman remarked that \"for 23 years he plied his trade with Essex, becoming the finest left-arm pace bowler in the country. Tough, astute, and entertaining in the dressing room, Lever was, as the title of his autobiography suggests, A Cricketer's Cricketer\".", "link_mentions": [{"page": "Wisden Cricketers of the Year", "response": ["|  John Lever"]}, {"page": "Bishan Singh Bedi", "response": ["In England's tour of India in 1976–77 he accused John Lever of using Vaseline to illegally polish the ball in the Third Test at Madras. Lever wore Vaseline strips on his forehead to keep the sweat out of his eyes; he was subsequently cleared of any wrongdoing."]}, {"page": "Gordon Greenidge", "response": ["Greenidge's son Carl is a former cricketer who coaches at Bancroft's School with John Lever. He was claimed to be the Grandfather of Reiss Greenidge, who is a footballer, however this was subsequently reported to be untrue."]}, {"page": "Ken Barrington", "response": ["After passing a medical Barrington was chosen to manage the MCC tour of India in 1976–77, where his own legendary status was soon emulated by that of Tony Greig. In the First Test John Lever took 10/70 as England won by an innings. In the Second Test Barrington advised Greig to bat as long as possible so that India would have to bat on a wearing pitch. The England captain took 434 minutes making 103 with a fever, India were bowled out for 181 in the second innings and England won by 10 wickets. Another win in the Third Test gave England their first series victory in India since Douglas Jardine in 1933–34, but it was spoilt by accusations by the Indian captain Bishan Bedi that Lever used Vaseline to shine the ball. After investigation the matter was referred the MCC. Barrington diplomatically thanked the Indian Board for not finding anything averse and was criticised for not defending his players more, but as Lever said \"if he had overreacted, the tour could have been called off\".p. 160, Peel"]}, {"page": "International cricket in South Africa from 1971 to 1981", "response": ["DH Robins' XI team squad comprised: Tony Brown; David Brown; Frank Hayes; Jackie Hampshire; Robin Hobbs; David Hughes; Robin Jackman; Roger Knight; John Lever; Peter Lewington;  Arnold Long; John Murray; Clive Radley; Mike Smith; David Turner; Peter Willey;  Bob Willis;", "At the start of the next South African season, Derrick Robins took another group of tourists to South Africa. Only Mike Smith and John Lever of those who toured earlier in 1973 went on this tour. Whilst the other players on the team were mostly English, there were also a number of players from other countries. Most notably the tour included Pakistani Younis Ahmed and West Indian John Shepherd. The other players in the touring squad were (English unless stated otherwise):", "The first of the representative games contained little of note, with slow scoring (South Africa's second innings of 287 took 112 overs) meant that it ended in a draw. The second game was dominated by two huge scores. John Edrich made 170 for DH Robins' XI, then Barry Richards made 180 for South Africa to ensure a second draw. The third and final first-class representative game started with South Africa winning the toss and putting DH Robins' XI into bat. DH Robins' XI only made 227 for 9 declared. The South African innings was dominated by 211 from Eddie Barlow and 125 from Lee Irvine as they piled on 528, with John Lever taking 6 for 117. A strong performance of 4 for 66 from Vintcent van der Bijl then helped South Africa dismiss DH Robins' XI for 218 to record a strong win in the match, and to take the three-match series 1-0."]}, {"page": "Essex County Cricket Club", "response": ["Along with Gooch, county captain and England batsman Keith Fletcher built a powerful eleven in the late 1970s that dominated domestic cricket from 1979 to 1992, when Essex won six of thirteen County Championship titles. The bowling in the first half of this period was borne by tireless left arm seamer John Lever and spinner and prankster Ray East. The South African Ken McEwan and Fletcher were the best batsmen after Gooch. As Lever declined, England all rounder Derek Pringle and fast bowler Neil Foster took over, whilst John Childs crossed from Gloucestershire to take over as the chief spinner.", "* John Lever", "|John Lever || 1,473"]}, {"page": "Derek Pringle", "response": ["Pringle was educated at St. Mary's School (Nairobi), Felsted School and Fitzwilliam College, Cambridge. He played for Essex between 1978 and 1993. He was a member of the successful Essex sides of the 1980s and early 1990s, alongside cricketers such as Graham Gooch, Mark Waugh, Nasser Hussain, John Lever and Neil Foster, which in that period won the County Championship six times. As an undergraduate, Pringle played for Cambridge University. In 1982, while captain of the university, he was selected for England Pringle went on to play 30 Tests, the last of which was in 1992, scoring 695 runs and taking 70 wickets. He also played in 44 One-Day Internationals between 1982 and 1993. He appeared in two World Cups and was a member of England's 1992 World Cup Final team."]}, {"page": "Graham Dilley", "response": ["Although he also played in the second Test, he was replaced by John Lever for the third and final match of the series. Dilley took only seven wickets on that tour – \"£7,000 for seven wickets\" as the tour manager Alec Bedser commented."]}, {"page": "Centenary Test", "response": ["After Australian opener Ian Davis had fallen cheaply to the left-armer John Lever, the score advanced to thirteen. Bob Willis, working up some good pace with his ungainly style, bounced Australia's Rick McCosker, who decided to take on the delivery and play the hook shot. Realising too late that he had been beaten for pace, McCosker was struck flush on the jaw by the ball, which then fell on the stumps. England's joy at capturing the wicket quickly turned to concern when McCosker collapsed to the ground, holding his broken jaw. The plucky opener was helped from the ground, but looked unlikely to take further part in the game. The Australian batsmen appeared tentative and the England bowlers pressed home their advantage, taking the wickets of Gary Cosier, David Hookes and Doug Walters to leave Australia at 5 for 51 mid-afternoon. Hookes played a brief cameo of 17 runs from 19 balls, but it was not a day for fast scoring. Wicketkeeper Rod Marsh joined his captain Greg Chappell for the only substantial partnership of the innings (51), but when Marsh was dismissed for 28 after an hour and a half of batting, the wickets began to fall again. Chappell was the ninth man out after almost four hours of batting – to illustrate the difficulty of the Australians' struggle, the aggressive Chappell failed to hit a boundary, while he scored his runs at a strike rate of just 28.7. All out 138 in only 44 overs, Australia had left England one hour's batting time before stumps. The English negotiated the period reasonably well, losing only Bob Woolmer for 9 in a total of 1 for 29. The visitors were clearly in the ascendancy at this point."]}, {"page": "South African rebel tours", "response": ["*Squad: Graham Gooch (captain), Dennis Amiss, Geoffrey Boycott, John Emburey, Mike Hendrick, Geoff Humpage, Alan Knott, Wayne Larkins, John Lever, Chris Old, Arnold Sidebottom, Les Taylor, Derek Underwood, Peter Willey, Bob Woolmer. Graham Dilley had pulled out of the tour before it got underway."]}, {"page": "Carl Greenidge", "response": ["He currently (2012) works as a cricket coach at Bancroft's School along with John Lever. Together they run the 1st XI and he has led many Sports tours abroad. He also coaches basketball."]}, {"page": "Eddie Hemmings (cricketer)", "response": ["In county cricket, requiring four runs off the last ball of the Benson & Hedges Cup final in 1989, Hemmings struck a boundary off John Lever of Essex to ensure victory for Nottinghamshire. Soon after this win he was reinstated in the England side for the 5th Ashes Test match of the same year, thanks in part to the fact that several players had just announced their decision to go on a rebel tour to South Africa, including off-spinner John Emburey. Hemmings took no wickets but scored more than 30 in both innings. Hemmings toured Australia in 1990/91, where he played his last Test."]}, {"page": "Neil Foster", "response": ["Born 6 May 1962 at Colchester in Essex, Foster was educated at Philip Morant Comprehensive, Colchester. He played for Essex during their most successful period in their history. Supported by a star-studded team that included other England players such Graham Gooch, Keith Fletcher, John Lever and Derek Pringle, Essex with Foster as their spearhead fast bowler won the County Championship on five occasions (1983, 1984, 1986, 1991 and 1992) during his time there."]}]}}