{"wiki_id": "http://www.wikidata.org/entity/Q6246458", "itemLabel": "John Maitland", "itemDescription": "British politician, died 1977", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Maitland_(Conservative_politician)", "wikipedia_page": {"main": "Sir John Francis Whitaker Maitland (24 March 1903 – 17 November 1977) was a Conservative Party politician in the United Kingdom.In the 1945 general election, he was elected as Member of Parliament for the safe Conservative seat of Horncastle in Lincolnshire.  He held the seat until he retired from the House of Commons at the 1966 general election.\nHis daughter Sally Louisa Mary Maitland married the Conservative Member of Parliament Jock Bruce-Gardyne.", "link_mentions": [{"page": "List of MPs elected in the 1945 United Kingdom general election", "response": ["|John Maitland"]}, {"page": "List of MPs elected in the 1950 United Kingdom general election", "response": ["|John Maitland"]}, {"page": "Maitland", "response": ["*John Maitland, 1st Lord Maitland of Thirlestane (1537–1595), Lord Chancellor of Scotland", "*John Maitland, 1st Duke of Lauderdale (1616–1682), Scottish politician, and leader within the Cabal Ministry", "*John Maitland (British Army officer) (1732–1779), British military officer", "*John Maitland (Royal Navy officer) (1771–1836), Royal Navy admiral", "*John Maitland (Conservative politician) (1903–1977), British politician in the Conservative party (Tory)"]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|Cmdr John Maitland"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| John Maitland"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| John Maitland"]}, {"page": "Jock Bruce-Gardyne", "response": ["He married Sally Louisa Mary Maitland, daughter of Commander Sir John Maitland, in 1959. He died of a brain tumour in Kensington and Chelsea at the age of sixty."]}, {"page": "Horncastle (UK Parliament constituency)", "response": ["| Sir John Maitland"]}, {"page": "John Maitland", "response": ["John Maitland may refer to:", "* Sir John Maitland, 1st Lord Maitland of Thirlestane (1537–1595), Commendator of Coldingham Priory", "* John Maitland, 1st Earl of Lauderdale (died 1645), Viscount of Lauderdale, Viscount Maitland and Lord Thirlestane & Boltoun, 2nd Lord Maitland of Thirlestane", "* John Maitland, 1st Duke of Lauderdale (1616–1682), 2nd Earl of Lauderdale", "* John Maitland, 5th Earl of Lauderdale (1655–1710), Scottish judge and politician", "* John Maitland (Haddington MP) (1732–1779), MP for Haddington Burghs, 1774–1880", "* John Maitland (Chippenham MP) (c. 1754–1831), MP for Chippenham, 1806–1812 and 1817–1818", "* John Maitland (Royal Navy officer) (1771–1836), Royal Navy admiral ", "* John Maitland (Kirkcudbright MP) (1841–1922), MP for Kirkcudbright, 1874–1880", "* Sir John Maitland (Conservative politician) (1903–1977), MP for Horncastle, 1945–1966", "* John Maitland (British Army officer) (1732–1779), British commander in American Revolutionary War", "* John Maitland (The Bill), a fictional police officer in the TV series The Bill"]}, {"page": "John Francis Whitaker Maitland", "response": ["#REDIRECT John Maitland (Conservative politician)"]}, {"page": "Debden, Epping Forest", "response": ["In 1944 John Maitland sold  of land to the London County Council for the building of a housing estate. The Debden Estate was constructed between 1947 and 1952. Because of post-war restrictions on building, a supermarket could not be opened until 1952."]}, {"page": "Loughton Hall", "response": ["The original Loughton Hall was the property of the Abbots of Waltham Abbey before passing to Mary Tudor shortly before she became Queen in 1553. It later passed to the Wroth family, including the novelist Lady Mary Wroth, and regular visitors included Ben Jonson and Sir Philip Sidney. In 1745, it passed to the Whitaker family, and Miss Anne Whitaker left it to John Maitland, and then his son William Whitaker Maitland, who spent heavily on the building. It burnt down on 11 December 1836.", "The last family member to live there was the Conservative politician Sir John Maitland, but it was requisitioned by the British Army during the Second World War to billet officers. It was sold to London County Council, and most of the land was used to build the Debden housing estate, with the Hall transferred to Essex County Council, and leased to Debden Community Association, and then given to Epping Forest College, but fell into disrepair by 2007. It is now a 33-bedroom residential care home for elderly people.http://www.veecare.co.uk/loughtonhall.html"]}, {"page": "John Whitaker Maitland", "response": ["He is the grandfather of the politician Sir John Maitland through his son William Whitaker Maitland."]}]}}