{"wiki_id": "http://www.wikidata.org/entity/Q6243330", "itemLabel": "John Knill", "itemDescription": "Mayor of St Ives, Cornwall", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Knill", "wikipedia_page": {"main": "John Knill (1 January 1733 – 29 March 1811) born at Callington in Cornwall was a slightly eccentric mayor of St Ives, Cornwall, UK, in 1767 and Collector of Customs at St Ives from 1762 to 1782. He built his own memorial, a 15-metre (49 ft) high granite obelisk known as Knill's steeple. This obelisk was sited on the summit of Worvas hill (now known as \"Knill's Monument\", or \"The Steeple\") with views over St Ives Bay, with the intention that he should be buried in a vault within it, but his body was interred in St Andrew's Church, Holborn. The steeple bears on one side the painted coat of arms of Knill, with the Latin Nil Desperandum (Never Despair); also inscribed on the monument are the words of Johannes Knill 1782, Resurgam (I shall arise), and, in English, I know that my Redeemer liveth.", "link_mentions": [{"page": "St Ives, Cornwall", "response": ["Knill's Monument, near St Ives, commemorating the mayor, John Knill|thumb", "John Knill, a former mayor, constructed the Knill Steeple, a granite monument overlooking the town. In 1797, Knill laid down instructions for the celebration of the Knill Ceremony, which was to take place every five years on 25 July (St James's Day). The ceremony involves the Mayor of St Ives, a customs officer, and a vicar accompanied by two widows and ten girls who should be the \"daughters of fishermen, tinners, or seamen\".", "* John Knill (1733 in Callington – 1811) slightly eccentric mayor of St Ives and Collector of Customs at St Ives from 1762–1782"]}, {"page": "Carbis Bay", "response": ["The parish church, which is dedicated to St Anta and All Saints, contains a ring of ten bells. This was the largest peal in a Cornish parish church until St Keverne's bells was increased to ten in 2001.Dove, R. H. (2012) A Bellringer's Guide to the Church Bells of Britain and Ringing Peals of the World, 10th ed. Guildford: Viggers The Carbis Bay Hotel, on the seafront, was built in 1894 by Silvanus Trevail. Behind the village stands the Knill Monument, known locally as \"The Steeple\", a 50-foot (15 m) high monument to John Knill, a mayor of nearby St Ives during the 18th-century."]}, {"page": "Henry Every", "response": ["British author and pirate biographer Charles Johnson suggested that, after attempting to sell his diamonds, Every died in poverty in Devon after being cheated out of his wealth by Bristol merchants. It is, however, unclear how Johnson could have discovered this. If Every was known to be living in poverty, it is most likely that he would have been apprehended and the large bounty on his head collected. So ascribing this fate to Every may have been a type of moral propagandizing on Johnson's part. Others have suggested that after Every changed his name, he settled in Devon and lived out the rest of his life peacefully, dying on 10 June 1714; however, the source for this information is The History and Lives of All the Most Notorious Pirates and their Crews (London: Edw. Midwinter, 1732), considered an unreliable (and slightly expanded) reprint of Johnson's General History. In October 1781 John Knill, the Collector of Customs at St Ives, Cornwall, held a meeting with a descendant of Every who stated that his ″father had told him that Captain Every, after wandering about in great poverty and distress, had died in Barnstaple, and was buried as a pauper ...″"]}, {"page": "List of Cornish philanthropists", "response": ["* John Knill, mayor of St Ives"]}, {"page": "Knill (surname)", "response": ["*John Knill (1733–1811), mayor of St Ives, Cornwall", "*John Knill (MP) (by 1519 – 1561 or 1564), English Member of Parliament."]}, {"page": "John Knill (disambiguation)", "response": ["John Knill (17331811), was Mayor of St Ives, Cornwall, England.", "John Knill may also refer to:", "* Frank John Knill, British Marine, winner of the Conspicuous Gallantry Medal", "* John Knill (MP) for Radnorshire"]}, {"page": "John Jope Rogers", "response": ["thumb|left|John Knill, portrait by John Opie", "One of Opie's sitters was John Knill (1733–1811), related to the Hichens family into which Rogers married. He possessed Knill's portrait by Opie, and wrote a short life of him. It was published in 1871 by Cunnack of Helston (anonymous)."]}, {"page": "Knill, John", "response": ["#redirectJohn Knill"]}]}}