{"wiki_id": "http://www.wikidata.org/entity/Q6240089", "itemLabel": "John Howard Umney", "itemDescription": "British WWI flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Howard_Umney", "wikipedia_page": {"main": "Second Lieutenant John Howard Umney  (11 April 1898 – 14 August 1934) was an English flying ace from World War I. He flew as a gunner/observer in the rear seat of Bristol F.2B Fighters, and was credited with 13 official aerial victories.", "link_mentions": [{"page": "No. 22 Squadron RAF", "response": ["The squadron moved to Spich, near Cologne in Germany as part of the British Army of Occupation in March 1919, leaving for home at the end of August that year. After a period as a cadre unit (without aircraft) at RAF Ford, the squadron formally disbanded on 31 December 1919.Halley 1973, pp. 13, 26. By the time it was demobilised, it had had 27 flying aces within its ranks, both pilots and observers, including William Meggitt, Samuel Frederick Henry Thompson, Alfred Atkey, John Everard Gurdon, William Frederick James Harvey, Ernest Elton, Frank Weare, Carleton Main Clement, Frank George Gibbons, Edwin C. Bromley, Chester Thompson, Hiram Frank Davison, Sydney A. Oades, George William Bulmer, George S. L. Hayward, Stanley Wallage, Frederick Stanton, James Bush, Rothesay Stuart Wortley, William Lewis Wells, Chester Stairs Duffus, John Howard Umney, Josiah Lewis Morgan, and Dennis Waight."]}, {"page": "List of World War I aces credited with 11–14 victories", "response": ["| John Howard Umney"]}, {"page": "Edwin Claude Bromley", "response": ["Lieutenant Edwin Claude Bromley (18 August 1888 – 14 April 1928) was a Canadian World War I flying ace credited with twelve aerial victories. Bromley piloted a two-seater Bristol F.2b Fighter for No. 22 Squadron. The observers that manned the rear guns for Bromley were John Howard Umney, for ten victories, and Charles George Gass, for two."]}, {"page": "List of World War I flying aces from the British Empire", "response": ["* John Howard Umney"]}]}}