{"wiki_id": "http://www.wikidata.org/entity/Q6246998", "itemLabel": "John Martin Robinson", "itemDescription": "architectural historian", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Martin_Robinson", "wikipedia_page": {"main": "John Martin Robinson FSA (born 1948) is a British architectural historian and officer of arms.\nHe was born in Preston, Lancashire, and educated at Fort Augustus Abbey, a Benedictine school in Scotland, the University of St Andrews (graduating MA and awarded D.LITT in 2002) and then in 1970 arrived at Oriel College, Oxford, to prepare for a DPhil. The doctoral degree was awarded in 1974 for work on the architect Samuel Wyatt. He worked for the Greater London Council's Historic Buildings Division from 1974 to 1986, where he worked inter alia as architectural editor of the Survey of London, and Historic Buildings Inspector for Westminster, and also revised the Statutory Lists of Historic Buildings for 2 east London boroughs. As an independent consultant since 1988 he has advised on the restoration of numerous country houses, churches and other listed buildings. His contribution to the Conservation Plan for 7 Dials and Covent Garden in London won the 1998 Camden Environmental Award. He also wrote the Conservation Plan for the Ashmolean Museum, Oxford, in association with Rick Mather Architects.\nHe has been an Architectural Writer for Country Life for over 40 years contributing nearly 400 articles and reviews.\nAs chairman of the Art and Architecture Committee of Westminster Cathedral he has overseen the completion of the mosaics in St George's and St Joseph's chapels, the Vaughan Chantrey and several individual panels.\nRobinson was Fitzalan Pursuivant Extraordinary at the College of Arms from 1982 and is now Maltravers Herald Extraordinary. In 1978 he was appointed Librarian to the Duke of Norfolk Earl Marshal.Robinson is also a Knight of Magistral Grace of the Sovereign Military Order of Malta. He lives at Beckside House, Cumbria, and is an active member of the Georgian Group of which he was a trustee and vice-chairman for 20 years, acquiring their HQ Adam townhouse in Fitzroy Square, setting up the Casework committee, and instituting the Young Georgians, and founding and presiding over the Annual conservation Awards for 10 years from 2003 to 2013.\nHe served on the North West Regional Committee of the National Trust for 10 Years and is Heraldic Adviser to the National Trust. He was a trustee of the Lakeland Arts Trust for 25 years, and served on the Council of the Society of Antiquaries, the council of the National Records Association, and is a trustee of Arundel Castle, Burghley House and Wilton House. He was a founder member of the Friends of Christ Church Spitalfields and helped establish the music Festival there. His scholarly book on James Wyatt is the definitive treatment of the subject. His New Georgian Handbook, written jointly with Alexandra Artley of Harpers Magazine, was the architectural face of the Young Fogey movement and has become collectable.", "link_mentions": [{"page": "List of University of Oxford people", "response": ["*John Martin Robinson"]}, {"page": "Lord of the manor", "response": ["John Martin Robinson, Maltravers Herald Extraordinary and co-author of The Oxford Guide to Heraldry, gave his opinion that \"Lordship of this or that manor is no more a title than Landlord of The Dog and Duck\", eventhough the Earldom of Arundel Castle also falls under land property laws and inheritance and hence can be sold by its present owner.Baronage FAQs\"The Dog and Duck\" is a common pub name in England. The owner of a pub is often referred to as the landlord. The style 'Lord of the Manor of X' or 'Lord of X' is, in this sense, more of a description than a title, somewhat similar to the term Laird in Scotland. King's College, Cambridge has given the view that the term 'indicated wealth and privilege, and it carried rights and responsibilities'.King's College Cambridge, Estates: Lord of the manors"]}, {"page": "False titles of nobility", "response": ["According to John Martin Robinson, Maltravers Herald Extraordinary and co-author of The Oxford Guide to Heraldry, \"Lordship of this or that manor is no more a title than Landlord of The Dog and Duck\" (\"The Dog and Duck\" being a stereotypical name for a pub, with \"landlord\" being the usual term for someone who runs such an establishment). However, the journal Justice of the Peace & Local Government Law advises that the position is unclear as to whether a lordship of the manor is a title of honour or a dignity, as this is yet to be tested by the courts.Justice of the Peace & Local Government Law (legal journal) Technically, lords of manors are barons, or freemen; however, they do not use the term as a title. John Selden, in Titles of Honour, wrote in 1672, \"The word Baro (Latin for \"baron\") hath been also so much communicated, that not only all Lords of Mannors have been from ancient time, and are at this day called sometimes Barons (as in the stile of their Court Barons, which is Curia Baronis, &c. And I have read hors de son Barony in a barr to an Avowry for hors de son fee) But also the Judges of the Exchequer have it from antient time fixed on them.\""]}, {"page": "Sandringham House", "response": ["Sandringham House has not been admired by critics. Its chief fault is the lack of harmony between Humbert's original building and Edis's extensions, \"a contrast between the northern and southern halves of the house (that) has been much criticised ever since\". The architectural historian John Martin Robinson wrote in 1982, \"Sandringham, the latest in date of the houses of the British monarchy, is the least distinguished architecturally\". In his biography of Queen Mary, James Pope-Hennessy compared the house unfavourably to \"a golf-hotel at St Andrews or a station-hotel at Strathpeffer\". Simon Jenkins considered Sandringham \"unattractive\", with a \"grim, institutional appearance\". Pevsner described the architectural style as \"frenetic\"; Girouard expressed himself perplexed as to the preference shown by the royal family for A. J. Humbert, a patronage the writer Adrian Tinniswood described as \"the Victorian Royal Family's knack for choosing second-rate architects\". An article on the house in the June 1902 edition of Country Life opined, \"of mere splendour there is not much, but of substantial comfort a good deal\". The writer Clive Aslet suggests that the sporting opportunities offered by the estate were the main attraction for its royal owners, rather than \"the house itself, which even after rebuilding was never beguiling\".", "The fittings and furnishings were also criticised; the biographer of George V, Kenneth Rose, wrote that, \"except for some tapestries given by Alfonso XII, Sandringham had not a single good picture, piece of furniture or other work of art\". Neither Edward VII nor his heir were noted for their artistic appreciation; writing of the redevelopments at Buckingham Palace undertaken by George V, and previously by Edward VII, the architectural historian John Martin Robinson wrote that, \"the King had no more aesthetic sensibility than his father and expressed impatience with his wife's keen interest in furniture and decoration\". In the series of articles on the house and estate published in 1902 by Country Life to celebrate Edward VII's accession, the author noted the royal family's \"set policy of preferring those pictures that have associations to those which have merely artistic merit\". Exceptions came to include works from the collection of mainly 20th-century English art assembled by the Queen Mother, including pieces by Edward Seago and John Piper, who produced a view of Sandringham."]}, {"page": "Country Life (magazine)", "response": ["* John Martin Robinson (architecture)"]}, {"page": "Or (heraldry)", "response": ["* Woodcock, Thomas and John Martin Robinson (1988). The Oxford Guide to Heraldry. Oxford: University Press. "]}, {"page": "Penshaw Monument", "response": ["It is an example of Greek Revival architecture, which is rare in the historic County Durham. The style first appeared there  at country houses like Eggleston Hall; Penshaw Monument is a late example, as is Monkwearmouth Railway Station. John Martin Robinson cites the monument alongside Bowes Museum as an example of the \"eccentric buildings\" found in the county. Nikolaus Pevsner noted that the structure's proximity to the Victoria Viaduct produces a rare juxtaposition of Greek and Roman architecture. A booklet produced by Tyne and Wear County Council Museums compares Penshaw Monument to Jesmond Old Cemetery, whose gates were designed by John Dobson; it says that the monument \"shares the Arcadian intentions of Dobson's Cemetery, but is very much more successful\". In her survey of the monument commissioned by the National Trust, Penny Middleton states that its \"closest architectural and cultural relation\" may be the National Monument of Scotland, an unfinished Grecian temple on Calton Hill in Edinburgh."]}, {"page": "Francis Johnson (architect)", "response": ["*John Martin Robinson and David Neave, (2001), Francis Johnson Architect, Oblong Creative, "]}, {"page": "Charles Cameron (architect)", "response": ["The first comprehensive English biography of Cameron was written by Georgy Lukomsky, veteran of Russian neoclassical revival school, and published in 1943 in England with introduction by David Talbot Rice. Nikolay Lanceray had compiled substantial material on Cameron earlier, in the 1920s. It was lost after his arrest, apart from the fragments used in his book on Vincenzo Brenna, first printed in 2006. In the last quarter of the 20th century Anthony Glenn Cross researched Cameron's life as part of the British diaspora in Saint Petersburg and tracked his family connections; John Martin Robinson contributed studies of Cameron's early career in England. A definitive modern biography of Cameron, The empress and the architect, was published by Dmitry Shvidkovsky in English in 1996 (most recent Russian edition: 2008). Cameron's concise biography in the fourth edition of Howard Colvin's Biographical Dictionary of British Architects cites all the English sources listed above."]}, {"page": "The Georgian Group", "response": ["Since the early 1980s The Georgian Group has employed specialist regional caseworkers to undertake its advisory work within the planning process. Any member of the public can ask the Group for assistance in preventing the destruction of a Georgian building, although the Group's resources are limited. There are four casework regions: London and the South East, Central and Northern England, South West England and the Cotswolds, and Wales. The caseworkers are responsible to a Senior Caseworker (currently James Darwin) and a committee of expert advisers. Recent Senior Caseworkers have included Clare Campbell, Andrew Martindale and John Neale. Dr John Martin Robinson was the founder of its specialist Casework Committee a group of architects, architectural historians and conservation professionals who regularly meet to discuss controversial development schemes. Its present Chairman is the architect Peregrine Bryant. The Georgian Group also has specialist representatives on conservation advisory panels in many English local authority areas including Brighton, Derby, Bristol and Newcastle upon Tyne."]}, {"page": "Maltravers Herald Extraordinary", "response": ["The current Maltravers Herald of Arms Extraordinary is John Martin Robinson, MA (St Andrews) DPhil (Oxford) FSA. ", "|John Martin Robinson"]}, {"page": "Fitzalan Pursuivant Extraordinary", "response": ["|John Martin Robinson"]}]}}