{"wiki_id": "http://www.wikidata.org/entity/Q6247553", "itemLabel": "John McCormick", "itemDescription": "Scottish footballer (1936-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_McCormick_(footballer,_born_1936)", "wikipedia_page": {"main": "John McCormick (18 July 1936 – 2 July 2017) was a Scottish professional footballer. Playing as a centre back he made a total of 334 appearances in the Football League and Scottish League, for Third Lanark, Aberdeen and Crystal Palace before moving into non-league football with Wealdstone.", "link_mentions": [{"page": "Mel Blyth", "response": ["As Palace struggled in Division 1, regularly finishing just above the relegation zone, Blyth became a permanent fixture in the defence alongside John McCormick. He was deposed as centre back for a while by Roger Hynd. But after playing in midfield for much of the 1969–70 season he won his place back when Hynd was temporarily switched to the forward line. The contrasting styles of Blyth and McCormick made for a good mix, and the two of them stayed together until McCormick moved to Wealdstone in 1973."]}, {"page": "Tom White (footballer, born 1939)", "response": ["White moved to Crystal Palace, then playing in the Second Division, in May 1966, in a combined deal along with teammate John McCormick. He scored 14 times for Palace in 40 appearances, in all competitions, before moving to Blackpool in February 1968."]}, {"page": "History of Crystal Palace F.C.", "response": ["Palace's life in the top division of English football began with a home game against Manchester United. Scoring the first ever Division One goal for the club was Mel Blyth after eleven minutes, and a second goal from new signing Gerry Queen saw Palace hold United to a 2–2 draw with goalkeeper John Jackson denying George Best and Brian Kidd. The next match was again at home, this time  against Sunderland which Palace won 2–0. After a season long struggle against relegation, Palace were eventually able to secure safety, finishing in twentieth place above demoted Sheffield Wednesday and Sunderland. The club managed to gain three new records for the First Division at the end of this season: the fewest goals scored; the fewest wins recorded by a non-relegated team; and the tally of twenty-seven points was the smallest number with which a team has avoided relegation from the top flight.Matthews, 113–115 Palace avoided the drop for two more seasons,Matthews, 115–121 and followed the trend of many other top flight clubs by introducing a new \"Player of the Year\" award which has been presented at the end of every season since the 1971–72 campaign. The first recipient was defender John McCormick."]}, {"page": "John McCormick", "response": ["John McCormick may refer to:", "*John McCormick (political scientist) (born 1954), British professor of political science at Indiana University in the United States", "*John McCormick (Canadian politician) (1858–1936), Canadian merchant and politician in Nova Scotia, Canada", "*John McCormick (footballer, born 1936) (1936–2017), Scottish footballer", "*John McCormick (British politician) (1880s–1958), member of the Senate of Northern Ireland", "*John McCormick (producer) (1893–1961), American producer and husband of film star Colleen Moore (1922–1930)", "*John McCormick (American football) (1937–2013), former professional American football player", "*John McCormick (Australian footballer) (1899–1974), Australian rules footballer"]}, {"page": "List of Crystal Palace F.C. players", "response": ["|align=\"left\"|John McCormick||||CB||1965–1973||194||6|||| ", "|1972|| John McCormick"]}, {"page": "2017 in association football", "response": ["* 2 July: John McCormick, Scottish footballer (born 1936)"]}, {"page": "2017 in the United Kingdom", "response": ["**John McCormick, 80, footballer (Crystal Palace, Aberdeen)."]}, {"page": "2017–18 in English football", "response": ["* 2 July 2017: John McCormick, 80, Crystal Palace centre back."]}, {"page": "2017–18 in Scottish football", "response": ["*2 July: John McCormick, 80, Third Lanark and Aberdeen defender."]}, {"page": "Crystal Palace F.C. Player of the Year", "response": ["The Crystal Palace Football Club Player of the Year is awarded at the end of each season. Since the inaugural award was made to John McCormick in 1972, 36 players have won the award. Nine of these players have won the award for a second time, the most recent being Wilfried Zaha. Three players have received the award on more than two occasions, Zaha and Jim Cannon have won it three times and Julián Speroni four times. Paul Hinshelwood was the first to win the trophy in consecutive seasons, a feat since emulated by Andrew Johnson, Julián Speroni and Wilfried Zaha. Speroni and Zaha won it in three consecutive seasons. The current incumbent of the award is Vicente Guaita, who was the 2020–21 recipient."]}, {"page": "Deaths in July 2017", "response": ["*John McCormick, 80, Scottish footballer (Crystal Palace, Aberdeen), dementia.'What a terrific centre-back he was' - Palace fans pay tribute to star of 1969 team John McCormick after passing away"]}]}}