{"wiki_id": "http://www.wikidata.org/entity/Q6241797", "itemLabel": "John Jenkinson", "itemDescription": "British bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Jenkinson_(bishop)", "wikipedia_page": {"main": "John Banks Jenkinson (2 September 1781 – 7 July 1840) was an English bishop who was the Bishop of St David's from 1825.", "link_mentions": [{"page": "St Davids Cathedral", "response": ["The Welsh architect John Nash was commissioned to restore the west front in 1793 to repair the damage done two hundred years previously. Eclectic in style (with Gothic and Perpendicular characteristics – the latter attributed partly to his destruction of the windows of the chapel of St Mary's College in order to reuse that tracery for his west front), his work soon proved to be substandard (as had his previous work on the chapter house). Within a century the Nash west front had become unstable and the whole building was restored by George Gilbert Scott between 1862 and 1870. The lady chapel was restored by public subscription in 1901 and the eastern chapels were restored through a legacy of the Countess of Maidstone, granddaughter of Bishop John Jenkinson, between 1901 and 1910."]}, {"page": "Jenkinson baronets", "response": ["His eldest son, the second Earl, was Prime Minister of the United Kingdom from 1812 to 1827. He was succeeded by his half-brother, the third Earl, who notably held office as Lord Steward of the Household from 1841 to 1846. On his death the barony and earldom became extinct. The titles were revived in 1893 and 1905 respectively for his grandson Cecil Foljambe (the son of his daughter Selina Charlotte; see the Earl of Liverpool). The Jenkinson baronetcy passed to the late Earl's first cousin, the tenth Baronet. He represented Dover in the House of Commons. On his death the title passed to his nephew, the eleventh Baronet, the son of the Rt Revd John Jenkinson, Bishop of St David's. He sat as a Conservative Member of Parliament for Wiltshire North. The family seat is Hawkesbury near Badminton in Gloucestershire.", "**Capt. John Jenkinson (1881–1914)"]}, {"page": "Rice Rees", "response": ["Rees was born at Ton, near Llandovery, Carmarthenshire, Wales, and christened in the local Independent chapel. From 1819, he was educated for a short time at Lampeter grammar school, under Eliezer Williams, before being educated at home and by his uncle, William Jenkins Rees. He matriculated at Jesus College, Oxford in 1822. He was appointed to a college scholarship in 1825 and graduated with a B.A. degree in 1826 and a M.A. degree in 1828.  His tutor was Llewelyn Lewellin, who in 1827 was appointed as the first Principal of St David's College, Lampeter (which later became the University of Wales, Lampeter). Rees was appointed as lecturer in Welsh and librarian at St David's College. He was elected to a Fellowship of Jesus College in 1828, retaining this position until his death.E. G. Hardy's 1899 history of the college gives the date of his election as 1830, not 1828. He was ordained deacon in 1827 and priest in 1828, becoming rector of Llanddewi Velfrey, Pembrokeshire in 1832, obtaining a B.D. degree in 1837 and being appointed chaplain to the Bishop of St Davids, John Jenkinson, in 1838."]}, {"page": "Sir George Jenkinson, 11th Baronet", "response": ["Jenkinson was the son of the Right Reverend John Jenkinson, Bishop of St David's, and Frances Augusta, daughter of Augustus Pechell. Prime Minister Robert Jenkinson, 2nd Earl of Liverpool, was his first cousin once removed. In 1855 he succeeded his uncle as eleventh Baronet. He died in Eastwood House, Falfield, on 19 January 1892 and was buried in a vault in St George's Church, Falfield."]}]}}