{"wiki_id": "http://www.wikidata.org/entity/Q6242624", "itemLabel": "John Keeley", "itemDescription": "English footballer (born 1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Keeley", "wikipedia_page": {"main": "John Henry Keeley (born 27 July 1961) is an English former footballer who played as a goalkeeper. He was most recently the goalkeeping coach at Ipswich Town.", "link_mentions": [{"page": "Lindsay, California", "response": ["The Yandanchei tribe of Native Americans came to hunt and fish at the future site of Lindsay for centuries.http://www.lindsay.ca.us/aacity/history.cfm Future Military Governor of California  John C. Fremont passed through twice by way of the Stockton - Los Angeles Road and the later Butterfield Overland Mail route on two of his four exploration trips.  Julius Orton, a seventh generation descendant of Thomas, served as security for a pack train headed for Placerville, a booming California gold mining town, motivated by his futile search for gold.  In 1859, with his wife and two small daughters, and driving a small herd of cattle,  walked more than  from the coast near Sacramento, to a homestead along the Tule River,  southwest of Lindsay.  In the 1880s,  Julius Orton homesteaded another () piece of land bordering on the property of pioneers Lewis and John Keeley, brothers who had taken on a homestead just a few miles southwest of Lindsay in the mid-1870s."]}, {"page": "Jamie Ashdown", "response": ["A year later after announcing his retirement, Ashdown revealed that he went on a trial at his former club, Portsmouth after learning that John Keeley returned as the club's goalkeeper coach but was turned away and ignored by manager Paul Cook. In September 2018, Ashdown joined Ascot United as one of their new goalkeeping coach."]}, {"page": "David Coles (footballer)", "response": ["He helped HJK win the 1988 Finnish championship, and kept a clean sheet in the European Cup first round second leg as HJK narrowly failed to come back from a 3–0 first-leg deficit against Porto. He was briefly on the books of Crystal Palace before spending the last few months of the 1982–83 season at Brighton & Hove Albion as cover for John Keeley; he made one appearance in the Second Division when Keeley was unwell. Released at the end of the season, he returned to Aldershot, and two years later, having taken his league appearance total for Aldershot to 150, he spent a short spell on Fulham's books before retiring from full-time football."]}, {"page": "Simon Eastwood", "response": ["Due to limited playing time, Eastwood was the main goalkeeper for Portsmouth's development squad. He made his third first-team appearance in a first round FA Cup match against Notts County, on 3 November. On the following Tuesday, he made his league debut at Fratton Park against Brentford; Pompey lost the League One fixture 1–0. On 20 November 2012, first-choice goalkeeper Andersen made his last appearance for Portsmouth in a 2–3 defeat to Leyton Orient before returning to Premier League club Reading, making Eastwood the only goalkeeper at Portsmouth, and securing his first-team place. Just after Andersen's departure, former Swindon Town goalkeeper Phil Smith was signed, initially as back-up for Eastwood. Eastwood's position was under threat, when former Portsmouth goalkeeper Alan Knight (famous for the most appearances for a Portsmouth player) came in as goalkeeper coach (after the departure of John Keeley). Knight backed Eastwood, and on 2 March 2013 Pompey won their first match in over four months (23 matches), a 2–1 win at Crewe Alexandra, Eastwood's first win as a Portsmouth player. In the next month he kept three clean sheets in six matches, against Bury, Preston North End and Tranmere Rovers. Following Portsmouth's relegation, Eastwood said he was determined to stay at the club for the next season. He was offered a new contract with the club."]}, {"page": "Richard Martin (footballer, born 1987)", "response": ["Martin was released at the end of his contract in May 2007, his departure coinciding with that of long time goalkeeping coach John Keeley. In August 2007, two weeks before the start of the new Premiership season Martin, still without a club, was invited to train with Manchester CityCity give month's trial to Richard Martin for a week by goalkeeping coach Eric Steele. However, injuries to Joe Hart and Andreas Isaksson resulted in Martin unexpectedly playing for City that weekend. After impressing in the friendly fixture, Martin was given a month-long contract. Martin continued to impress in subsequent Premier Reserve team fixtures, including a victory over Manchester United. This didn't go unnoticed as City boss Sven-Göran Eriksson saw fit to extend Martin's contract to the end of the season. At the end of the Premier League 2007–08 season, Martin made his Manchester City first team debut in the Pok Oi Charity Cup against a South China Invitational XI."]}, {"page": "Barrie Delf", "response": ["Before turning professional, Delf played amateur football for Leigh Ramblers in the Southend Borough Combination League, Leigh Marshes and Trinity whilst working as civil servant for the Department of Social Security. He had a trial with Aston Villa, but Ron Saunders decided against signing him due to Villa having recently taken on an apprentice goalkeeper. BBC Essex sports presenter Roger Buxton, recommended Delf to Southend United chief scout Bob Walls, eventually signing on non-contract terms in 1983. He made a number of reserve team appearances before making his debut on 26 March 1983 in the Football League Third Division for Southend against Sheffield United, in the 3–1 home victory. Southend's regular goalkeepers Mervyn Cawston and John Keeley were both injured, and Delf was drafted in on the morning of the day of the match. The one goal Delf conceded was a penalty kick taken by Colin Morris. He went on to play non-League football for Dartford under Peter Taylor, signing from Southend in 1986, before joining Grays Athletic for whom he made over 300 appearances."]}, {"page": "1993–94 Colchester United F.C. season", "response": ["Following a campaign of goalkeeping uncertainty where the U's employed six different 'keepers over the course of the season, finding a regular starter between the sticks was key for manager Roy McDonough. With youth team product Nathan Munson on the books, McDonough brought in John Keeley from Oldham Athletic in the summer. However, his performances did not convince and he played his final game for the club in November 1993. This meant a string of mid-season transfers and loans of goalkeepers into the club, and the U's ended the season having once again used six different goalkeepers. McDonough even found himself in goal in October 1993 when facing Hereford United after Keeley and substitute Munson were both sent off for professional fouls. The U's went on to lose that game 5–0. Colchester were the first Football League club to have two goalkeepers sent off in the same fixture. Hereford striker Chris Pike scored a hat-trick in the game, with each of his goals coming against three different goalkeepers.", "|John Keeley", "|John Keeley", "|align=\"left\"|John Keeley", "|align=\"left\"|John Keeley", "|John Keeley"]}]}}