{"wiki_id": "http://www.wikidata.org/entity/Q6247743", "itemLabel": "John McFall", "itemDescription": "British Paralympic sprinter", "wikipedia_url": "https://en.wikipedia.org/wiki/John_McFall_(athlete)", "wikipedia_page": {"main": "John McFall (born 25 April 1981) is a British Paralympic sprinter. In 2000, when he was 19 years old, his right leg was amputated above the knee following a serious motorcycle accident. He took up running again after being fitted with a prosthesis, and participated in his first race in 2004. The following year, he was selected to represent Great Britain at the International Paralympic Committee (IPC) European Championships, and took the bronze medal in the 200 metres (sport class T42).\nIn the 100-metre sprint, McFall subsequently won silver medals at the International Paralympic Committee (IPC) World Championships in 2006 and the Visa Paralympic World Cup in 2007. On 6 July 2007, he was placed third at the Meeting Gaz de France in Paris, part of the ÅF Golden League; and achieved his personal best time (as at 30 May 2008) in the 100 metres of 12.70 seconds by winning silver at the Bayer International Track and Field Competition in Leverkusen on 10 August of that year. In his other main event, the 200 metres, he achieved a bronze in the 2006 IPC World Championships, and a gold at the 2007 Visa Paralympic World Cup with a competition record time of 26.84 seconds. In September 2007, McFall was champion in both the 100 metres and 200 metres at the International Wheelchair and Amputee Sports Federation (IWAS) World Wheelchair and Amputee Games. He was ranked first in the world in 2007 for the 200 metres, and second for the 100 metres.\nMcFall, who has been called one of the fastest men in the world over 100 metres and 200 metres in the class of above-the-knee amputees, competed for Great Britain in the 100 metres (T42) at the 2008 Summer Paralympics in Beijing, winning the bronze in a time of 13.08 seconds.", "link_mentions": [{"page": "April 25", "response": ["*  1981   – John McFall, English sprinter"]}, {"page": "Swansea University", "response": ["* John McFall, Paralympic sprinter"]}, {"page": "Frimley", "response": ["*John McFall, British Paralympic sprinter, was born on 25 April 1981 in Frimley."]}, {"page": "1981 in the United Kingdom", "response": ["* 25 April – John McFall, paralympic sprinter"]}, {"page": "John McFall", "response": ["John McFall may refer to:", "*John McFall (athlete) (born 1981), British Paralympic sprinter", "*John McFall, Baron McFall of Alcluith (born 1944), British politician"]}, {"page": "Great Britain at the 2008 Summer Paralympics", "response": ["|John McFall"]}, {"page": "Cardiff School of Sport", "response": ["* John McFall"]}, {"page": "List of people educated at Millfield", "response": ["* John McFall, Paralympic sprinter"]}]}}