{"wiki_id": "http://www.wikidata.org/entity/Q6247142", "itemLabel": "John Mathew", "itemDescription": "Scottish-Australian minister and anthropologist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Mathew", "wikipedia_page": {"main": "John Mathew (31 May 1849 – 11 March 1929) was an Australian Presbyterian minister and anthropologist, author of \"Eaglehawk and Crow\" and \"Two Representative Tribes of Queensland\".", "link_mentions": [{"page": "Wiradjuri", "response": ["(Pangerang) (Vic.); Booandik (Vic. & SA); Barkunjee (Barkindji) (NSW), Kurnai (Vic.), Thurrawal (Dharawal) (NSW), Wiradjuri (NSW) and Malegoondeet (?) (Vic.) as some of these names, and mentions R.H. Mathews, A.W.Howitt and John Mathew as promulgators of the \"nations\" concept. However, Tindale refers to Wiradjuri in his own work (p. 200): \"Wiradjuri 'Wiradjuri (Wi'raduri)\"."]}, {"page": "Mathew", "response": ["* John Mathew (1849–1929), Australian Presbyterian minister and anthropologist"]}, {"page": "Gubbi Gubbi people", "response": ["John Mathew, who lived among them, described the Gubbi Gubbi lands as roughly coextensive with the Mary River Basin, though stretching beyond it north to the Burrum River and south along the coast itself. He estimated their territory to cover .  According to Norman Tindale, however, the Gubbi Gubbi people were an inland group living in the Wide Bay–Burnett area, and their lands extended over  and lay west of Maryborough. The northern borders ran as far as Childers and Hervey Bay. On the south, they approached the headwaters of the Mary River and Cooroy. Westwards, they reached as far as the Coast Ranges and Kilkivan. Gubbi Gubbi country is currently located between Pumicestone Road, near Caboolture in the south, through to Childers in the north. Their country was originally rain forest, with cleared areas created by regular firing of the scrub.", "thumb|left|John Mathew's 1910 map of the country of the Kabi and Wakka peoples.", "The escaped convict James Davis, in addition to dwelling with several other tribes, is said to have lived for a time with the Gubbi Gubbi. John Mathew, a clergyman turned anthropologist, also spent five years with them at Manumbar and mastered their language. He described their society in a 1910 monograph, Two Representative Tribes of Queensland. The Gubbi Gubbi people he grew up with numbered no more than a score by the early 1880s, and by 1906, after they had been forcibly removed to the Barambah reserve, (an Aboriginal reserve created under the Aboriginals Protection and Restriction of the Sale of Opium Act 1897 ), he stated that only 3-4 full-blooded members of the group remained among the 'remnants'."]}, {"page": "Lorimer Fison", "response": ["Fison returned to Australia in 1884 and for most of the remainder of his life lived near Melbourne. He retired from the ministry in 1888 and from then to 1905 edited the Spectator and made it one of the best Melbourne church papers. At the meeting of the Australasian Association for the Advancement of Science held at Hobart in 1892 he was president of the anthropological section, and from the chair, with charming candour, pointed out that a theory of the Kurnai system, which he had worked out with infinite pains in Kamilaroi and Kurnai, was \"not worth a rush\". In 1894 he visited England and attended the meeting of the British association at Oxford. There he met Max Müller, Professor Edward Burnett Tylor and many other distinguished scientists. At Cambridge he became acquainted with Dr., later Sir James Frazer, who was much impressed by his frank and manly nature. Fison was critical of John Mathew's book Eaglehawk and Crow (1899), seemingly provoked by Mathew's challenge to his own group-marriage theories and perhaps by Mathew's amateur status."]}, {"page": "Percy Leason", "response": ["In 1928, Leason contended some figures described by the ethnologist John Mathew in 1897 were merely natural stains in the rock, which caused some controversy."]}, {"page": "John Mathew (disambiguation)", "response": ["John Mathew (1849 – 1929) was an Australian Presbyterian minister and anthropologist.", "John Mathew may also refer to:", "*John Mathew (MP) for Shaftesbury", "*John Mathews (disambiguation)"]}, {"page": "Wakka Wakka", "response": ["The Wakawaka language belongs to the Waka–Kabic branch of the Pama-Nyungan languages. Linguistic work by the Presbyterian minister and anthropologist John Mathew and, more recently, by linguists such as Nils Holmer, means there is an accompanying grammar to provide clues on how the language was constructed and spoken. However, there are few speakers and there is a real concern that the language is not spoken on a daily basis in communities to keep Wakka Wakka as a thriving, living language."]}, {"page": "Goeng Goeng", "response": ["John Mathew identified the Goeng and the Goreng goreng as the same tribe, though the former is coastal and the latter an inland tribe. Tindale noted and criticised the conflation."]}, {"page": "Wulli Wulli", "response": ["A very late tradition collected in 1979 states that a certain Jimmy Reid, A Camboon station resident, told a third party before his own death, that the Wulili had participated in the Hornet Bank massacre. In her memoir, the Queensland poet Judith Wright affirmed that, together with the Yiman, who were held responsible for the killings of the Fraser family, the Wulili also were wiped out. John Mathew, however, managed to collect samples of their language from native informants decades later, and published the results in 1926."]}, {"page": "John Fraser (ethnologist)", "response": ["He goes on to list the BangarangNote:RH Mathews' spelling. (Pangerang) (Vic.); Booandik (Vic. & SA); Barkunjee (Barkindji) (NSW), Kurnai (Vic.), Thurrawal (Dharawal) (NSW), Wiradjuri (NSW) and Malegoondeet (?) (Vic.) as some of these names, and mentions R.H. Mathews, A.W. Howitt and John Mathew as promulgators of the \"nations\" concept."]}, {"page": "Mathew, John", "response": ["#redirectJohn Mathew"]}]}}