{"wiki_id": "http://www.wikidata.org/entity/Q6254264", "itemLabel": "John Raphael Rodrigues Brandon", "itemDescription": "British architect and architectural writer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Raphael_Rodrigues_Brandon", "wikipedia_page": {"main": "John Raphael Rodrigues Brandon (5 April 1817 in London – 8 October 1877 at his chambers at 17 Clement's Inn, Strand, London) was a British architect and architectural writer.", "link_mentions": [{"page": "Alfred Waterhouse", "response": ["Waterhouse's move to London, was at a fortuitous time. The capital was undergoing major expansion and rebuilding in the 1860s. Both his brothers Edwin and Theodore were already living there. Before his move he had already been commissioned to design the Quaker-run Alexander and Cunliffe's Bank (1864–67) in Lombard Street, City of London, (demolished), Italianate with Gothic features, four-storied of stone.Cunningham & Waterhouse, p. 38 The competition to design the Royal Courts of Justice was by invitation only. It was decided in late 1865 to limit it to six competitors, of which Waterhouse was one. The instructions were drafted in 1866.Brownlee, p. 84 Due to objections the number of invited architects was increased to twelve. But John Gibson dropped out leaving eleven: Waterhouse, William Burges, George Gilbert Scott, John Pollard Seddon, Edward Middleton Barry, the little known Henry Robert Abrahms, the also obscure Henry B. Garling, John Raphael Rodrigues Brandon, Henry Francis Lockwood, Thomas Deane and the eventual winner George Edmund Street. All the competitors chose to produce Gothic designs .Waterhouse's design was based around two large halls that formed a cruciform design. The lower level of the north-south hall was for the general public with short corridors linked to staircases leading to public galleries in the courtrooms. The east-west hall 478 by 60 feet, crossed the lower one at upper level reserved for the use by lawyers. There were four towers the tallest 354 feet in height.Brownlee, pp. 100, 113-114 Waterhouse explained the building's plan:"]}, {"page": "1877 in architecture", "response": ["* October 8 – John Raphael Rodrigues Brandon, English Gothic Revival architect (born 1817)"]}, {"page": "1817 in architecture", "response": ["* April 15 – John Raphael Rodrigues Brandon, English Gothic Revival architect (died 1877)"]}, {"page": "Stow Bardolph", "response": ["Holy Trinity Parish Church was extensively restored by John Raphael Rodrigues Brandon around 1850. A wax effigy of the upper body of Sarah Hare including lifelike face and hands is displayed upright in a mahogany case in the Hare Chapel of the church.  Hare died from blood poisoning in 1744 at the age of 55. Her will stated she wished to be recreated in wax following her death. It is the only funerary effigy of its kind outside Westminster Abbey. There is a stained glass window to the memory of Victoria Cross recipient James Adams who was vicar here from 1896 to 1902.1912 DNB entry"]}, {"page": "Raphael Brandon", "response": ["#REDIRECT John Raphael Rodrigues Brandon"]}, {"page": "Joseph T. Parkinson", "response": ["His pupils included John Raphael Rodrigues Brandon, Thomas Hayter Lewis, and George Ledwell Taylor."]}, {"page": "John Brandon", "response": ["*John Raphael Rodrigues Brandon (1817–1877), British architect"]}, {"page": "John Raphael Brandon", "response": ["#REDIRECT John Raphael Rodrigues Brandon"]}, {"page": "Carroll & Batchelor", "response": ["Carroll was born in Dublin in 1830. He was admitted to the Royal Dublin Society's School of Drawing in Architecture in 1846. He subsequently worked as an apprentice under George Fowler Jones and was his assistant from around 1849 to around 1856. Carroll went on to work for John Raphael Rodrigues Brandon before going into independent practice around 1856. Carroll trained George Gilbert Alexander Andrew Irvine."]}, {"page": "List of places of worship in the Borough of Fareham", "response": ["|The foundation stone for this chapel of ease within Titchfield parish was laid on 16 August 1870, the church was consecrated exactly a year later, and it was parished within six months.  John Raphael Rodrigues Brandon's Gothic Revival church has elements of the Early English, Decorated and Perpendicular styles and is \"a building of many quirks\".  It has a nave with a clerestory, chancel and polygonal apse but no transepts, tower or spire: a bell-cot supported on a prominent buttress rises from the west gable.  The walls are of rubble and ashlar.  The scheme of stained glass dates from 1950, replacing windows destroyed by a World War II bomb."]}]}}