{"wiki_id": "http://www.wikidata.org/entity/Q6253720", "itemLabel": "John Quinton", "itemDescription": "Recipient of the George Cross (1921-1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Quinton", "wikipedia_page": {"main": "Flight Lieutenant John Alan Quinton, GC, DFC (2 February 1921 – 13 August 1951) was a British navigator and pilot who was posthumously awarded the George Cross for an act of outstanding bravery where he unselfishly saved a young air cadet whilst losing his own life after the aircraft he was in was involved in a mid-air collision over Yorkshire.On 13 August 1951, Flight Lieutenant Quinton was a navigator with 228 Operational Conversion Unit, RAF Leeming, under instruction in a Wellington aircraft which was involved in a mid-air collision. An Air Training Corps cadet, 16-year-old Derek Coates, was with him in the rear compartment of the aircraft when the force of the impact caused the Wellington to break up and plunge to the ground out of control.\nFlight Lieutenant Quinton picked up the only parachute he could see, clipped it on to the cadet's harness, showed him how to pull the rip-cord and ordered him to jump. The cadet landed safely and was the only survivor of the disaster; all eight other occupants of the two aircraft perished.\nFor his selfless action he was awarded the George Cross (GC), the UK's highest award for bravery where the award of the Victoria Cross (VC) is not applicable, such as acts of gallantry by a civilian, or by a military person who is not in the presence of the enemy. The George Cross is equal in status to the Victoria Cross, but as the newer award, in order of wear, the George Cross is second to the Victoria Cross.", "link_mentions": [{"page": "RAF Leeming", "response": ["* 13 August 1951 – two aircraft from RAF Leeming collided over Hudswell, near to Richmond, North Yorkshire. A cadet in the No. 228 Operational Conversion Unit Wellington aircraft was given the only serviceable parachute by Flight Lieutenant John Quinton, shown how to operate it and ordered to bale out. The other eight crew members of both aircraft died when their aircraft hit the ground."]}, {"page": "Air Training Corps", "response": ["The Quinton Memorial Trophy is a national award presented annually to the adult non-commissioned officer who has gained the top academic results in the senior non-commissioned officer initial courses held at the Air Cadet Adult Training Facility, Royal Air Force College, Cranwell. This trophy is named in honour of Flight Lieutenant John Quinton.Flight Lieutenant John Alan Quinton was an RAF navigator on a Wellington aircraft, which was flying an air cadet on an Air Experience Flight in 1951. During the flight, the aircraft was involved in a mid-air collision and Flight Lieutenant Quinton gave the only parachute within reach to the cadet, pushing him out of the aircraft. His quick thinking and heroic action saved the life of the cadet but cost him his own, for which he was posthumously awarded the George Cross."]}, {"page": "Leeming, North Yorkshire", "response": ["The village churchyard is the burial place of Flt Lt John Quinton GC DFC, who sacrificed himself to save an air cadet by providing the cadet with the only available parachute after a mid-air collision."]}, {"page": "List of George Cross recipients", "response": ["| Flight Lieutenant || Royal Air Force || GC || style=\"background: #e3d9ff;\" | 23 October 1951* || 100px|alt=John Quinton"]}, {"page": "Armed Forces Memorial", "response": ["*John Quinton (1921–1951), GC recipient"]}, {"page": "No. 604 Squadron RAF", "response": ["In early 1943 the squadron began to switch over to night intruder operations. In February 1944, the squadron was allocated to the 2nd Tactical Air Force and began conversion to the de Havilland Mosquito. Operations from Normandy began in August but the following month the unit returned to the UK, returning to the continent once again in January 1945. They remained there until disbanding at B.51 at Vendeville, near Lille, France, on 18 April 1945. Some 127 air victories had been claimed by the Squadron during the war, 41 since May 1944. A notable member of the squadron, later awarded a posthumous George Cross, was John Quinton DFC."]}, {"page": "List of mid-air collisions and incidents in the United Kingdom", "response": ["* On 13 August 1951 an AF Miles Martinet TT.1 of No. 228 OCU collided with a Vickers Wellington over North Yorkshire and spun in, eight were killed, with one survivor. Flight Lieutenant John Quinton DFC was awarded a posthumous George Cross for his gallantry in the aftermath of the crash, in which he died."]}, {"page": "John Alan Quinton", "response": ["#REDIRECT John Quinton"]}, {"page": "List of fatal accidents and incidents involving Royal Air Force aircraft from 1945", "response": ["*13 August 1951 PG367 a Vickers Wellington Mk XVIII of No. 228 Operational Conversion Unit of RAF Leeming, collided with a Miles Martinet NR570 over Hudswell in North Yorkshire. An Air Cadet on the Wellington was given a parachute, told how to operate it and ordered to jump by the navigator, Flight Lieutenant John Quinton. The Air Cadet survived, but all eight aircrew aboard both planes died, when their aircraft hit the ground."]}, {"page": "Andrew Buxton", "response": ["In 1993, he succeeded Sir John Quinton as chairman of Barclays Bank. He served as Chairman until 1999."]}, {"page": "Quinton, John", "response": ["#redirectJohn Quinton"]}]}}