{"wiki_id": "http://www.wikidata.org/entity/Q6251314", "itemLabel": "John Ormsby", "itemDescription": "British translator", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Ormsby_(translator)", "wikipedia_page": {"main": "John Ormsby (1829–1895) was a nineteenth-century Anglo-Irish translator. He is most famous for his 1885 English translation of Miguel de Cervantes' Don Quixote de la Mancha, perhaps the most scholarly and accurate English translation of the novel up to that time. It is so precise that Samuel Putnam, who published his own English translation of the novel in 1949, faults Ormsby for duplicating Cervantes' pronouns so closely that the meaning of the sentences sometimes becomes confusing.", "link_mentions": [{"page": "Don Quixote", "response": ["La Mancha is a region of Spain, but mancha (Spanish word) means spot, mark, stain. Translators such as John Ormsby have declared La Mancha to be one of the most desertlike, unremarkable regions of Spain, the least romantic and fanciful place that one would imagine as the home of a courageous knight.", "Thomas Shelton's English translation of the First Part appeared in 1612 while Cervantes was still alive, although there is no evidence that Shelton had met the author. Although Shelton's version is cherished by some, according to John Ormsby and Samuel Putnam, it was far from satisfactory as a carrying over of Cervantes' text. Shelton's translation of the novel's Second Part appeared in 1620.", "Around 1700, a version by Pierre Antoine Motteux appeared. Motteux's translation enjoyed lasting popularity; it was reprinted as the Modern Library Series edition of the novel until recent times.Sieber, Harry. \"Don Quixote in Translation\". The Don Quixote Exhibit, Tour 2, Chapter 5. George Peabody Library. 1996. Retrieved 26 December 2012. Nonetheless, future translators would find much to fault in Motteux's version: Samuel Putnam criticized \"the prevailing slapstick quality of this work, especially where Sancho Panza is involved, the obtrusion of the obscene where it is found in the original, and the slurring of difficulties through omissions or expanding upon the text\". John Ormsby considered Motteux's version \"worse than worthless\", and denounced its \"infusion of Cockney flippancy and facetiousness\" into the original.", "In 1742, the Charles Jervas translation appeared, posthumously. Through a printer's error, it came to be known, and is still known, as \"the Jarvis translation\". It was the most scholarly and accurate English translation of the novel up to that time, but future translator John Ormsby points out in his own introduction to the novel that the Jarvis translation has been criticized as being too stiff. Nevertheless, it became the most frequently reprinted translation of the novel until about 1885. Another 18th-century translation into English was that of Tobias Smollett, himself a novelist, first published in 1755. Like the Jarvis translation, it continues to be reprinted today.", "A translation by Alexander James Duffield appeared in 1881 and another by Henry Edward Watts in 1888. Most modern translators take as their model the 1885 translation by John Ormsby.", "* John Ormsby (1885).  The original version, available free on the Internet Archive, is to be preferred to the WikiSource and similar versions, which do not include Ormsby's careful notes and with his Introduction much abbreviated."]}, {"page": "1885", "response": ["* John Ormsby publishes his new English translation of Don Quixote, acclaimed as the most scholarly made up to that time. It will remain in print through the 20th Century."]}, {"page": "1885 in literature", "response": ["**John Ormsby's English translation of Miguel de Cervantes's Don Quixote is published. For many years it is regarded as the most accurate translation of the novel."]}, {"page": "Peter Anthony Motteux", "response": ["Motteux produced an important translation of the Miguel de Cervantes novel Don Quixote; this 4-volume 1700–03 edition (3rd edition in 1712) was credited as \"translated from the original by many hands and published by Peter Motteux.\" Very popular in its own era, Motteux's version of the work has been condemned by later translators. John Ormsby listed numerous faults he found with Motteux's translation, and described it as \"worse than worthless ... worthless as failing to represent, worse than worthless as misrepresenting\" the spirit and flavour of the original.", "*Cervantes, Miguel de. The History of Don Quixote De La Mancha. Translated by John Ormsby. Chicago, Encyclopædia Britannica Press, 1952."]}, {"page": "La Mancha", "response": ["Miguel de Cervantes described La Mancha and its windmills in his two-part 1605/1615 novel Don Quixote de La Mancha. Cervantes was making fun of the region, using a pun; a \"mancha\" was also a stain, as on one's honor, and thus an inappropriately-named homeland for a dignified knight-errant.A Noise Within Translator John Ormsby believed that Cervantes chose it because it was the most ordinary, prosaic, anti-romantic, and therefore unlikely place from which a chivalrous, romantic hero could originate, making Quixote seem even more absurd. However, due to the fame of Cervantes' character, the name of La Mancha did become associated worldwide with romantic chivalry."]}, {"page": "Dulcinea del Toboso", "response": ["As he does not have one, he invents her, making her the very model of female perfection: \"[h]er name is Dulcinea, her country El Toboso, a village of La Mancha, her rank must be at least that of a princess, since she is my queen and lady, and her beauty superhuman, since all the impossible and fanciful attributes of beauty which the poets apply to their ladies are verified in her; for her hairs are gold, her forehead Elysian fields, her eyebrows rainbows, her eyes suns, her cheeks roses, her lips coral, her teeth pearls, her neck alabaster, her bosom marble, her hands ivory, her fairness snow, and what modesty conceals from sight such, I think and imagine, as rational reflection can only extol, not compare\" (Part I, Chapter 13, translation of John Ormsby)."]}, {"page": "Cantar de mio Cid", "response": ["* John Ormsby, The Poem of Cid, 1879, with introduction and notes."]}, {"page": "Great Books of the Western World", "response": ["**The History of Don Quixote de la Mancha (translated by John Ormsby)"]}, {"page": "Thomas Shelton (translator)", "response": ["His performance has become a classic among English translations for its racy, spirited rendering of the original, but was faulted by translators such as John Ormsby (who had a fondness for it), for being so literal that certain words and phrases are completely mistranslated. (\"Gustos\", for example, means \"delights\" or \"likings\", but Shelton renders it as \"gusts\", and \"dedos\", which literally means \"fingers\", is rendered as such by Shelton, although the word can also mean \"inches\", which is the way Cervantes intends it.) Ormsby states, in his introduction to his own 1885 translation, that Shelton failed to recognize that a Spanish word can have more than one shade of meaning, and accuses Shelton of not having had a good knowledge of Spanish. In his introduction to the Tudor Translations (1896) reprint of Shelton's translations, James Fitzmaurice-Kelly sees the performance otherwise: \"Shelton's title to remembrance is based upon the broadest grounds. He had no sympathy for the arid accuracy that juggles with a gerund or toys with the crabbed subjunctive. From the subtleties of syntax, as from the bonds of prosody he sallies free; and the owls of pedantry have bitterly resented his arrogant disdain for them and theirs. And they have sought to avenge themselves, after their manner, by reproaching him with taking a disjunctive for an interjection, and with confounding of predicate and subject. They act after their kind. But Shelton's view of his function was ampler and nobler than the hidebound grammarian's. He appeals to the pure lover of literature; and as a man of letters he survives.\""]}, {"page": "List of translators into English", "response": ["*John Ormsby (later revised by Joseph R. Jones and Kenneth Douglas)"]}, {"page": "Hispanism", "response": ["Sir Walter Scott was an enthusiastic reader of Cervantes and tried his hand at translation. He dedicated his narrative poem The Vision of Roderick (1811) to Spain and its history. Thomas Rodd translated some Spanish folk ballads. Lord Byron also was greatly interested in Spain and was a reader of Don Quixote. He translated the ballad Ay de mi Alhama in part of his Childe Harold and Don Juan. Richard Trench translated Pedro Calderón de la Barca and was friends with some of the emigrated Spaniards, some of whom wrote in both English and Spanish, such as José María Blanco White and Telesforo de Trueba y Cossío, and many of whom (including Juan Calderón, who held a chair of Spanish at King's College), spread knowledge of the Spanish language and its literature. John Hookham Frere was a friend of the Duke of Rivas when the latter was in Malta, and Hookham translated some medieval and classical poetry into English. The brothers Jeremiah Holmes Wiffen and Benjamin B. Wiffen were both scholars of Spanish culture. The \"Lake Poet\" Robert Southey, translated Amadís de Gaula and Palmerín de Inglaterra into English, among others works. English novelists were strongly influenced by Cervantes. Especially so was Charles Dickens, who created a quixotic pair in Mr. Pickwick and Sam Weller of Posthumous Papers of the Pickwick Club. John Ormsby translated the Cantar de Mio Cid and Don Quixote. Percy Bysshe Shelley left traces of his devotion to Calderón de la Barca in his work. The polyglot John Bowring traveled to Spain in 1819 and published the observations of his trip. Other accounts of travel in Spain include those of Richard Ford, whose Handbook for Travellers in Spain (1845) was republished in many editions, and George Borrow, author of the travelogue The Bible in Spain, which was translated into Castilian by Manuel Azaña, the poet and translator Edward Fitzgerald, and the literary historian James Fitzmaurice-Kelly, who was mentor to a whole British generation of Spanish scholars such as Edgar Allison Peers and Alexander A. Parker. Other outstanding Hispanists include the following:"]}, {"page": "John Ormsby", "response": ["John Ormsby may refer to:", "* John Ormsby (negotiator) (1854–1927), negotiator for the Ngāti Maniapoto iwi (tribe)", "* John Ormsby (settler) (1720–1805), American soldier from Ireland and early Pittsburgh-area settler", "* John Ormsby (translator) (1829–1895), nineteenth-century British translator"]}, {"page": "List of English translations from medieval sources: C", "response": ["* The poem of the Cid (1879).Cid, c. 1043-1099., Ormsby, J. (1879). The poem of the Cid: a translation from the Spanish. London: Longmans, Green, and co.. A translation from the Spanish, with introduction and notes by John Ormsby (1829–1895).Thomas Seccombe (1901). \"Ormsby, John\". In Dictionary of National Biography, Supplement. 3. London. p. 235."]}]}}