{"wiki_id": "http://www.wikidata.org/entity/Q6253028", "itemLabel": "John Platts", "itemDescription": "English cricketer (1848-1898)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Platts", "wikipedia_page": {"main": "John Thomas Brown Dumelow Platts (23 November 1848 – 6 August 1898) was an English cricketer who played for Derbyshire between 1871 and 1884. He was a member of the team that played Derbyshire's first match in May 1871.\nPlatts was born to Robert and Alice Platts (née Dumelow) in Chellaston, Derbyshire. In his youth, he worked in the local gypsum mines, and in his spare time would pretend to play cricket by bowling stones at imaginary batsmen. An early game was for Hallam and Staveley in 1861 against an All England Eleven. He was a wheelwright by trade, but by 1868 was a professional at Ipswich School. In 1869 he played for Dudley and also for the Gentlemen of Worcester when he took 8 wickets in an innings.\nIn 1870, Lord Coventry helped raise a subscription for Platts to join the Marylebone Cricket Club (MCC). Platts played a single first-class game for MCC against Nottinghamshire in June 1870 which resulted in tragedy. He was fast bowling on a badly laid wicket at Lord's when the ball struck the batsman George Summers on the head. Summers retired hurt and appeared to recover, but died four days later. W. G. Grace was also playing for MCC in the match and commented on the incident \"...the bowler was not in the least to blame for the catastrophe, but he was terribly cut up, and I shall never forget his mental distraction.\" Platts later turned out against All England XI's, first for Lichfield when he took 10 wickets in the match, and then for Wirksworth where he was upstaged by another future Derbyshire player Dove Gregory.\nAfter Derbyshire County Cricket Club was established, Platts played in the club's first match in the 1871 season against Lancashire in May, and for thirteen years thereafter. Although undistinguished in the first game, he came in to bowl in the second match that season and took 5 for 34. During the 1872 season he took 5–51 in the first innings of the second match against Lancashire. He took four wickets in the 1873 season, while his batting scores improved significantly in the 1874 season. All through these early years Platt appeared in matches involving All England XIs and United South of England XIs sometimes for them and sometimes against them. He was usually against the side in which W. G. Grace was playing. At Birmingham in 1874 he was bowled by Grace, but in 1876, turning out for an assortment of clubs including Swansea, Barrow, Birmingham and Stockport, he took Grace's wicket twice. For Derbyshire in the 1876 season he was top scorer with 235. His first-class bowling took a step forward and he took 6–68 for Derbyshire against Kent. In the 1877 season he made his top score of 115 against Hampshire, which was the club's first century, and topped the scoring for Derbyshire again with 432. He took 5–18 against Lancashire that year. He continued playing other matches for and against other clubs, although this tailed out in the early 1880s. By 1881 he was running the \"Rose and Crown\" public house at Chellaston as well as being a professional cricketer.In the 1880 season he took 5–26 against Yorkshire, in the 1881 season 6–39 against Lancashire and in the 1882 season 5–48 against Lancashire. Platts played against a line-up of Australians several times during the early part of the decade, fixtures intended to help the young members of the international side do their homework for possible upcoming Test fixtures against England. After the final one of these in which he participated, Platts played one final game, and, having continued steadily up the order during his career, played his penultimate game in the 1884 season as an opener.Platts was a left-handed batsman and a right-arm round-arm slow bowler, with the added bonus of some occasionally fiendish pace to his straight-arm action.\nPlatts started umpiring in 1885 immediately after he stopped playing and took 69 first-class games until 1896.\nLater, John Platts was diagnosed with tuberculosis and died at his home in August 1898, at the age of 49.", "link_mentions": [{"page": "1870 English cricket season", "response": ["An unfortunate accident to George Summers which led to his death from head injuries four days after being hit by a sharply rising ball from John Platts that had struck a loose pebble showed that in its first year the heavy roller had not radically altered the Lord’s pitch; though it was to do so from the following seasonBaily’s Magazine of Sports and Pastimes, Volume 20 (1871); p. 286"]}, {"page": "John Smith (Derbyshire cricketer)", "response": ["Smith was born in Clifton, Derby and was a solicitor by profession.British Census 1881 RG11 3404/32 p12 From 1865 he was playing cricket regularly for Gentlemen of Derbyshire and South Derbyshire. Smith debuted for Derbyshire in the 1871 season  in their first match against Lancashire. He was one of five round-arm bowlers of Derbyshire's debut season (the others being James Billyeald, Dove Gregory, William Hickton, John Platts, and John Tilson). Smith played one first-class match in the 1872 season and also played against the Prince's Club. He played no first-class matches in the 1873 season but took part in a miscellaneous game against Nottinghamshire. He made his first real breakthrough playing three of four matches in Derbyshire's undefeated 1874 season. As a lower-order batsman, he was not out for 15 against Sandy Watson, who took nine-wickets for Lancashire in a game which Derbyshire still won. Smith played in five of Derbyshire's seven matches in the  1875 season. He played three matches in the 1876 season and seven in the 1877 season. In his last season for Derbyshire in 1878, he played two first-class matches, his last against an All England XI. He also played two matches for Derbyshire against school teams. In 1879 he played for Gentlemen of Derbyshire against a team of Canadian expatriates, including Walter Wright and Thomas Phillips."]}, {"page": "William Humble", "response": ["Humble made his debut for Derbyshire in the 1873 season and scored 11 in his first innings against Lancashire in a match which Derbyshire lost. In the 1874 season he played three first-class matches, and against Kent he made his top score of 19. He also played a couple of miscellaneous games for Derbyshire. In the 1877 season he played two first-class matches for Derbyshire which were both against Hampshire, in one of which Derbyshire's victory was spearheaded by a century by John Platts. Humble also played for Gentlemen of Derbyshire and later for Free Foresters."]}, {"page": "William Hickton (cricketer, born 1842)", "response": ["In 1871 Hickton decided to move to Derbyshire and join the newly established Derbyshire County Cricket Club in their opening season in a bowling line-up that included Dove Gregory and John Platts. Hickton's first match for Derbyshire, the first County Match played by the team, was against his old team Lancashire. Hickton made a good account of himself, taking four wickets in the first innings of the match. Hickton played in both matches against Lancashire in the  1872 season, whereas a good score in his one match against lancashire in the 1873 season put him top of the batting averages. In the 1874 season he played only two matches but took 17 wickets with 6-15 against Kent and 6-63 against Lancashire. In the 1875 season, he played six of the seven matches and took 32 wickets with 5-38 against United North of England. In the 1876 season he played four of seven matches but took eleven wickets of his twenty-two wickets in one match against Kent with 5-52 and 6-41. He played in all matches with the team in the 1877 season, when he took 40 wickets with 5-37 against Lancashire, 6-47 against Kent and 5-44 against Hampshire. As with earlier seasons, Hickton was kept of the top bowler spot by William Mycroft. Hickton managed just eleven wickets in eleven matches in the 1878 season and retired from first-class cricket. He continued his association with Broughton until 1897. Hickton's benefit match took place on 20 July 1883 between Lancashire and eighteen of the Broughton Club."]}, {"page": "George Hay (cricketer)", "response": ["Hay was back with Derbyshire in the 1878 season, still beating Hickton to the mantle of second-choice bowler, though now he had to shake competition off from John Platts, in the same position. Though he never played as often as he did during the 1878 season on any further occasions, Hay's round-arm bowling was at times preferred to John Platts' occasional deceptively-layered pace. In the 1879 season Hay put in fewer games for Derbyshire as he was playing for Keighley."]}, {"page": "John Richardson (Derbyshire cricketer)", "response": ["Richardson was born in Duckmanton, Derbyshire and became a bricklayer.British Census 1881 His first-class career for Derbyshire began in the 1878 season in a game against the All-England Eleven, a match in which he took two wickets for the team, although his batting contribution, being caught for a duck in the first innings and finishing not-out for 0 in the second, was minimal. He played minor games for Derbyshire in 1878 and 1879. In the 1882 season Richardson played his first County match, against Lancashire. He took at least a wicket in every match he played in the 1882 season. Derbyshire dispensed with the idea of using just two bowlers, most frequently William Mycroft and John Platts at that time, and in his final game of the 1882 season against Yorkshire Richardson achieved his best bowling performance of 7-76. He also made his top score of 18."]}, {"page": "George Summers (cricketer)", "response": ["In the match against MCC at Lord's in 1870, Summers was hit by a short delivery from John Platts, at the time a fast bowler. He was carried off the field. He seemed to recover, and was not taken to hospital, but went by train back to Nottingham. He died from his injury four days later. Lord's at the time was renowned for being a poor pitch. After Summers' death, efforts were made to improve it, and MCC paid for his gravestone. The death of Summers ensured that the bowler never bowled fast again."]}, {"page": "JTBD Platts", "response": ["#REDIRECT John Platts"]}, {"page": "Derbyshire County Cricket Club in 1871", "response": ["The club's first captain was Samuel Richardson, a gentleman's outfitter in the town of Derby. Derbyshire's bowling strength came from the professionals Dove Gregory  who had played for a Derbyshire team in the 1850s, William Hickton a former Lancashire player and John Platts who was on the ground staff of MCC. Amateurs who began long careers with the club were Robert Smith (future captain) a farmer, John Smith a solicitor, Unwin Sowter  a miller and baker, John Tilson a lace maker and John Burnham  a clerk. Shorter careers were enjoyed by Thomas Attenborough a cattle dealer and Joseph Davidson a miner. Single appearances were made by Rev, Arthur Wilmot local rector, Edward Foley Oxford University student and vicar's son and James Billyeald a commercial traveller.  Some had played for Gentlemen of Derbyshire, South Derbyshire and Derby Town.  ", "| Dove Gregory  5-57; A Appleby 6-38 and 7-21; John Platts 5-34", "|| John Platts ||P || 32 || L || 2 || 3 || 16 || 12 || 5.33 || 0    ", " ||John Platts || R F||84 ||38 ||8 ||4.75|| 5-34  "]}, {"page": "List of Derbyshire County Cricket Club seasons", "response": ["| 1876|| 7|| 3|| 4|| 0||  Robert Smith|| John Platts || William Mycroft||Alfort Smith", "| 1877||9 || 5|| 3|| 1|| Robert Smith|| John Platts || William Mycroft  || Alfort Smith Thomas Mycroft"]}, {"page": "Derbyshire County Cricket Club in 1876", "response": ["John Platts  was top scorer and William Mycroft took most wickets."]}, {"page": "Derbyshire County Cricket Club in 1884", "response": ["The season saw the retirement of two originals of the first Derbyshire side in 1871 - Robert Smith and John Platts. Platts returned to the sport as an umpire. Two other long-timers also left - Thomas Foster first played in 1873. He was running a pub and later returned to umpire. Henry Shaw had joined in 1875."]}, {"page": "Sir Matthew Wood, 4th Baronet", "response": ["The son of Sir Francis Wood, 3rd Baronet|Sir Francis Wood]] the 3rd Baronet of the Page Wood baronets, and Louisa Mary Hodgson, Wood was born at Newport on the Isle of Wight. He was educated at Winchester College. He would make a single appearance in first-class cricket for Hampshire against Derbyshire in 1876 at the County Ground, Derby. In a match which Derbyshire won by 8 wickets, Wood was twice dismissed for a duck, by John Platts in Hampshire's first-innings and by William Hickton in their second-innings."]}, {"page": "Derbyshire County Cricket Club in 1877", "response": ["Yorkshire  joined Hampshire, Lancashire and Kent  as the fourth county to play Derbyshire. John Platts became the first cricketer to score a century for Derbyshire.", "John Platts was top scorer and W Mycroft took most wickets with 63. Platts was also the first Derbyshire cricketer to score a century for the club."]}, {"page": "John Platt", "response": ["* John Platts (1848—1898), English cricket player", "* John Platts (Unitarian) (1775–1837), English Unitarian minister and author, compiler of reference works", "* John Platts-Mills (1906–2001), British Labour Party politician"]}, {"page": "William Wall (cricketer)", "response": ["The son of Thomas Wall, the founder of the Wigan Observer, Wall played his club cricket for Wigan, before making his only appearance in first-class cricket for Lancashire in 1877 against Derbyshire at Derby. Batting in the lower-order, Wall scored an unbeaten 17 in Lancashire's first-innings, but was dismissed without scoring in their second-innings by John Platts. In his capacity as wicket-keeper he took two catches and made two stumpings."]}, {"page": "List of Marylebone Cricket Club players (1864–1894)", "response": ["* John Platts (1870) : J. T. B. D. Platts ()"]}, {"page": "Platts, John", "response": ["#redirectJohn Platts"]}]}}