{"wiki_id": "http://www.wikidata.org/entity/Q6258743", "itemLabel": "John St Helier Lander", "itemDescription": "Jersey painter (1868-1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_St_Helier_Lander", "wikipedia_page": {"main": "John St Helier Lander (19 October 1868 in Jersey – 12 February 1944 in Witley, Surrey) was a noted portrait painter. Born John Helier Lander, he added the St. to acknowledge his birthplace of Saint Helier in the Channel Islands.  He was given his first paint box by Lillie Langtry, the famous beauty, actress and mistress of the Prince of Wales, later to become Edward VII. He studied at Calderon's School.\n\nOn leaving school, he was sent to become a watchmaker at the age of fifteen, but spent so much time drawing that he was taken away and allowed to paint. On reaching the age of seventeen and having sold some of his pictures, he went to London to study in an art school. Although he remained there a year, he hated the school. He was invited to breakfast with Sir John Everett Millais, a fellow Jerseyman, who advised him to continue his artistic career and to go to Paris. In Paris he studied at the Académie Julian under William-Adolphe Bouguereau and Fleury.\n\nAfter a year in Paris he returned to London to enter the Royal Academy Schools where he stayed for three years, before returning to Jersey and setting up a studio, taking Millais and Walter William Ouless, another distinguished fellow Jerseyman, as ideals in the art of portrait painting. He taught privately at the Jersey Ladies' College (now Jersey College for Girls) and the Guernsey Ladies' College. He undertook an ambitious group portrait of the Assize d'Héritage (known as \"The Sitting\") which took him four years to complete. In 1897, it was purchased for £400 by Julia Westaway, of the Westaway Trust, and presented to the Royal Court in Jersey where it now hangs.", "link_mentions": [{"page": "John Atkinson, Baron Atkinson", "response": ["On 19 December 1905, he was appointed to the House of Lords as a Lord of Appeal in Ordinary and life peer under the title Baron Atkinson, of Glenwilliam in the County of Limerick, the first Irish barrister to be appointed as a Law Lord directly from his practice at the bar – Judges John Fitzgerald and Michael Morris had served on the Irish Bench for many years before their respective appointments. For the title of his life peerage, he chose Glenwilliam, after Glenwilliam Castle in County Limerick, the home of his father.  Atkinson's appointment, however, was not met with universal approval by his profession. As a former member of the cabinet he was seen as a political judge, however his industry and keen sense of justice came to be seen as a valuable addition to the bench. On his appointment as a Law Lord, he withdrew from active politics, limiting his contributions on political matters in the House of Lords to the discussion of Irish matters, such as the Irish Land Bill in 1909, to which he tabled several amendments. Atkinson retired as a judge in 1928, and died at his home at 39 Hyde Park Gate, London on 13 March 1932. A portrait by John St Helier Lander hangs in the Bar Room of King's Inns, Dublin."]}, {"page": "Henry James, 1st Baron James of Hereford", "response": ["Lord James of Hereford died unmarried in August 1911, aged 82. By his mistress Alice, whom he refused to marry, daughter of Robert Hardwicke (d.1874) of London, he left a daughter Alice Henland (1868–1936), who married Lt. Col. George Talbot Lake Denniss, Royal Wilts. Regt.Debrett's Peerage, 1968, Baron Manton colls. The barony became extinct on his death. His portrait was painted by John St Helier Lander, collection of Middle Temple; his 1893 photo-portrait by Alexander Bassano is in the National Portrait Gallery. Lord James (Sir Henry James at the time) was also president of Bury Golf Club during the 1890s, during which time a championship trophy was awarded in his honour."]}, {"page": "Edmund Blampied", "response": ["After illustrating a new edition of Travels with a Donkey in the Cévennes by Robert Louis Stevenson, Blampied returned to work for magazines in 1933 with a weekly series of illustrations of British life in ink and sepia wash for The Illustrated London News. Blampied’s few published portraits are known from this time, although he did not particularly enjoy doing them. From photographs he drew small pencil portraits of authors and actors for a magazine called The Queen and an oil of Queen Mary (Mary of Teck) for the Christmas issue in 1934; he collaborated with his great friend and benefactor John St Helier Lander, a noted portrait artist and fellow-Jerseyman, on a picture of King George V; and he did an etching of the Jersey-born politician, Lord Portsea (Bertram Falle), which was shown at the Royal Academy in 1934. After finishing his work for the Illustrated London News in 1935 he continue to work for magazines until 1939, mainly doing occasional cartoons for The Sketch, often featuring two tramps called Horace and George."]}, {"page": "John St. Helier Lander", "response": ["#REDIRECT John St Helier Lander"]}, {"page": "Henry Richard Abadie", "response": ["Thereafter Abadie was appointed the Lieutenant Governor of Jersey, a post he held until 1904. There is a painting of him at his regimental museum in Derby by John St Helier Lander,Abadie, painting, Derby Museum and Art Gallery, accessed September 2011 an artist whom he met while living in Jersey."]}, {"page": "Thomas Benjamin Frederick Davis", "response": ["Davis had set up the Howard Leopold Davis scholarship trust in Jersey. One of this educational trust's provisions was that it should benefit boys who, like he, had attended an elementary school. The majority of boys benefiting from this trust went to Victoria College, Jersey and a number went up to Cambridge or Oxford. In 1934 Davis decided he wanted his old friend from his St Luke's elementary school days, John St Helier Lander, the portrait painter, to paint a portrait of King George V, to commemorate the endowment of the scholarship. When the commission was complete the artist and Davis visited the College to discuss where the portrait might be hung. When Davis discovered there was no room remaining in the College's great hall he decided to build another hall for the school. On 18 October 1934 Davis and his wife laid the foundation stone to Howard Hall, now known as Howard Davis Theatre. It was built of granite from Ouaisné and matched the gothic style of the older Victoria College buildings. Inside there was seating for 238, almost exactly the number of boys at school when the building was opened. The panelling and woodwork were of teak, and the clock an exact replica of that at the Greenwich Observatory. On 23 July 1935 the Prince of Wales came to Jersey to open the Hall and unveil the portrait of King George V.", "Davis requested four additional copies of the portrait from John St Helier Lander. These were given to the Howard College in Durban, Canada House, Australia House (now listed as hung in the Parliament of the Commonwealth of Australia) and New Zealand House (now in the collection of the Museum of New Zealand Te Papa Tongarewa). The artist, John St Helier Lander, took pride in the fact that all five of these portraits of the King had been \"unveiled by Royal Princes, an honour no portrait painter has ever had before\"."]}, {"page": "John Lander", "response": ["*John St Helier Lander (1868–1944), British artist"]}, {"page": "List of people from Jersey", "response": ["*John St Helier Lander, portrait painter (1868–1944)"]}, {"page": "Lander (surname)", "response": ["* John St Helier Lander (1868–1944), British artist"]}, {"page": "County Hall, Maidstone", "response": ["Works of art in the county hall include a portrait of the Deputy Lieutenant of Kent, Lionel Sackville-West, 3rd Baron Sackville, by John St Helier Lander and a portrait of the Governor of Bombay, George Harris, 4th Baron Harris, by Hubert von Herkomer."]}]}}