{"wiki_id": "http://www.wikidata.org/entity/Q6256623", "itemLabel": "John Sanders", "itemDescription": "British musician (1933-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Sanders_(musician)", "wikipedia_page": {"main": "John Derek Sanders OBE, FRCO (23 November 1933 – 23 December 2003) was an English organist, conductor, choir trainer and composer.  He was organist of Gloucester Cathedral from 1967 to 1994, and director of the Three Choirs Festival from 1968 to 1994.", "link_mentions": [{"page": "Gloucester Cathedral", "response": ["In 1971 Hill, Norman and Beard performed a total redesign, under the supervision of Cathedral Organist John Sanders and consultant Ralph Downes. In 1999 Nicholson & Co overhauled the organ, when the soundboards, pipework and wind supply were renovated and the computer system was updated. In 2010 Nicholson also added a Trompette Harmonique solo reed.", "In 1582, Robert Lichfield is recorded as the organist of Gloucester Cathedral. Notable among the organists are composers and choral conductors of the Three Choirs Festival, Herbert Brewer, Herbert Sumsion and John Sanders. Herbert Howells, who was a pupil of Brewer, composed a Magnificat and Nunc dimittis for Gloucester Cathedral"]}, {"page": "List of 21st-century classical composers", "response": ["|John Sanders || 1933 || 2003 || English || || "]}, {"page": "Chester Cathedral", "response": ["The earliest recorded appointment of an organist is of John Brycheley in 1541. Notable organists include the composers Robert White and John Sanders, conductor George Guest and the recording artist Roger Fisher.Cathedral Organists. John E West. 1899The Succession of Organists. Watkins Shaw. 1991"]}, {"page": "List of Anglican church composers", "response": ["*John Sanders"]}, {"page": "Herbert Sumsion", "response": ["In his program planning for the festival, Sumsion championed the performance of new English works.  Notable premieres at Sumsion's Gloucester festivals included Gustav Holst's Choral Fantasia (1931), Howells's Hymnus Paradisi (1950), and Finzi's Intimations of Immortality (1950); as well as works by Vaughan Williams, Howard Ferguson, Robin Milford, Tony Hewitt-Jones, John Sanders, and Sumsion himself.  Outside the realm of English music, Sumsion helped sustain a festival connection with Kodály by inviting him back to Gloucester in 1937 and programming his works at six Gloucester festivals."]}, {"page": "Ellington Indigos", "response": ["*John Sanders, (bass trombone)"]}, {"page": "2003 in the United Kingdom", "response": ["* 23 December – John Sanders, organist and composer (born 1933) "]}, {"page": "Black, Brown and Beige (1958 album)", "response": ["*John Sanders – valve trombone"]}, {"page": "1933 in the United Kingdom", "response": ["* 23 November – John Sanders, organist and composer (died 2003)"]}, {"page": "John Sanders", "response": ["John Sanders may refer to:", "*John Sanders (architect) (1768–1826), British architect", "*John Sanders (sportscaster), American sports broadcaster", "*John Sanders (musician) (1933–2003), British organist, conductor, choir trainer and composer", "*John Sanders (baseball) (born 1945), American baseball player and coach", "*John Sanders (painter) (1750–1825), English painter", "*John Sanders, owner and perhaps painter of the Sanders portrait of William Shakespeare (1603)"]}, {"page": "Sanders (surname)", "response": ["*John Sanders (1768–1826), British architect ", "*John Sanders (1933–2003), English musician associated with the tradition of Anglican church music", "*John Sanders (born 1945), American baseball player and coach", "*John Sanders, American sports broadcaster"]}, {"page": "Dresden amen", "response": ["John Sanders based his Responses for Evensong on the Dresden Amen."]}, {"page": "List of 20th-century classical composers", "response": ["| John Sanders || 1933 ||2003 || English || ||"]}, {"page": "Organ and organists of Chester Cathedral", "response": ["*1964 John Sanders"]}, {"page": "Richard Nye", "response": ["His first published work, Three Pyrotechnics for Solo ClarinetCascade Music Publishing website catalogue (1993 - pub. Cascade Music Publishing) is now included as part of the Trinity College Advanced Clarinet repertoire.Trinity College, London Nye was a chorister at Gloucester Cathedral under  John Sanders and began composing at a young age. Guided by the Cheltenham-based composer Tony Hewitt-Jones whilst he was still at school, Nye later went on to study music in London. He received his South Bank debut with 8 'til Late (8 hands on 2 pianos) performed at the South Bank Centre in 2001 by Piano 40, whilst Nye was living on the Isles of Scilly. The work was later released on CD by Regent Records.Music Web International"]}, {"page": "Nicholas O'Neill (composer)", "response": ["O'Neill attended The King's School, Gloucester, and was a chorister at Gloucester Cathedral under the direction of John Sanders. O'Neill went on to study Music at Magdalen College, Oxford, where he was Organ Scholar, first under John Harper and then under Grayston \"Bill\" Ives."]}, {"page": "List of musicians at English cathedrals", "response": ["Notable organists of Chester Cathedral include the composers  Robert White and  John Sanders and the recording artist Roger Fisher.Cathedral Organists. John E West. 1899.The Succession of Organists. Watkins Shaw. 1991.", "*1964 John Sanders", "Notable among the organists of Gloucester Cathedral are Samuel Sebastian Wesley (his final cathedral appointment) and composers and choral conductors of the Three Choirs Festival, Sir Arthur Herbert Brewer, Herbert Sumsion and John Sanders.", "* 1967 John Sanders", "*1958–1963 John Sanders"]}, {"page": "1933 in British music", "response": ["*23 November – John Sanders, organist, conductor and composer (died 2003)"]}, {"page": "Deaths in December 2003", "response": ["*John Sanders, 70, British organist, pneumonia."]}, {"page": "20 College Green", "response": ["Its residents have included the musicians Herbert Sumsion and John Sanders."]}, {"page": "Template talk:London Gazette/Archive 1", "response": ["::::Thanks, I'd still like to see links to the Wikipedia article on the Gazette, and HMSO as publisher, but I notice that you removd these wher I had manually included them in John Sanders (musician).  I would normally include equivalent info when using  or  so it seems a bit restrictive not to be able to include it in this templet (maybe with a switch like that for \"Supplement\").  For those who don't know what the Gazette is, it's a quick way of giving them an idea of its singular authority.  Presumably the same parameters could also be used for the Edinburgh and Belfast Gazettes (I'm not quite clear what goes in these rather than the London one), just using a different GeoType parameter?  David Underdown 09:10, 13 August 2007 (UTC)"]}]}}