{"wiki_id": "http://www.wikidata.org/entity/Q6258418", "itemLabel": "John Smyth", "itemDescription": "British politician, died 1811", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Smyth_(1748%E2%80%931811)", "wikipedia_page": {"main": "John Smyth (1748–1811) was a British politician who sat in the House of Commons from 1783 to 1807.", "link_mentions": [{"page": "Pontefract", "response": ["* John Smyth (1748–1811), MP for Pontefract"]}, {"page": "Robert FitzRoy", "response": ["Robert FitzRoy was married twice. In 1836 he married Mary Henrietta, daughter of Major-General Edward James O'Brien.Burke's Peerage, Baronetage and Knightage, 107th edition, vol. 2, ed. Charles Mosley, Burke's Peerage Ltd, 2003, p. 1617 They had four children: Emily-Unah, Fanny, Katherine and Robert O'Brien. In 1854, after the death of his first wife, he married in London Maria Isabella, daughter of John Henry Smyth, of Heath Hall, Heath, West Yorkshire (son of the politician John Smyth), who had married his first cousin- both being grandchildren of the 3rd Duke of Grafton, as was Robert FitzRoy- Lady Elizabeth Anne FitzRoy. Lady Elizabeth was daughter of the 4th Duke of Grafton and was a first cousin of Robert FitzRoy; Robert's new wife was therefore his first cousin once removed. They had one daughter, Laura Maria Elizabeth (1858-1943).Burke's Peerage, Baronetage and Knightage, 107th edition, vol. 2, ed. Charles Mosley, Burke's Peerage Ltd, 2003, p. 1617"]}, {"page": "Augustus FitzRoy, 3rd Duke of Grafton", "response": ["* Lady Georgiana FitzRoy (8 May 175718 January 1799),The Register of Births & Baptisms in the Parish of St James within the Liberty of Westminster Vol. IV. 1741-1760. 5 June 1757. who married John Smyth (12 February 174812 February 1811) on 4 June 1778."]}, {"page": "Master of the Mint", "response": ["*1802–1804 John Smyth"]}, {"page": "John Smyth", "response": ["John Smyth may refer to:", "*John Smyth (Baptist minister) (1554–1612), considered the earliest Baptist", "*John Smyth (barrister) (1941–2018), British QC", "*John Smyth (footballer) (born 1970), Irish former professional footballer", "*John Smyth (Master of Pembroke) (1744–1809), clergyman and Master of Pembroke College, Oxford", "*John Smyth (minister) (1796–1860), Scottish minister in the Free Church of Scotland ", "*John Smyth (priest) (died 1704), Anglican archdeacon in Ireland", "*John Smyth (sculptor) (c. 1773–1840), Irish sculptor", "*John Smyth (snooker referee) (1928–2007)", "*John Smyth (1748–1811), MP for Pontefract", "*Sir John Smyth, 1st Baronet (1893–1983), British MP, Privy Counsellor in 1962, recipient of the Victoria Cross during the First World War", "*John Smythe (disambiguation)"]}, {"page": "List of Privy Counsellors (1714–1820)", "response": ["*John Smyth (1748–1811)"]}, {"page": "List of Lords Commissioners of the Admiralty", "response": ["**John Smyth", "**John Smyth"]}, {"page": "St. Alban's Tavern group", "response": ["|   John Smyth"]}, {"page": "Pontefract (UK Parliament constituency)", "response": ["|rowspan=\"5\" | John Smyth ||rowspan=\"5\" | Whig"]}, {"page": "Christopher Wyvill", "response": ["A committee under Wyvill was appointed to continue the pressure by correspondence, and the example of Yorkshire was followed by other counties, 25 in all. In the period 1779 to 1781, when there was a delegate conference, the movement gained a broad base. Supporters included John Baynes, Sir Robert Bernard, Newcome Cappe, John Fountayne, Sir James Grant, Thomas Brand Hollis, Sir James Innes-Ker, John Lee, Gamaliel Lloyd, George Montagu, 4th Duke of Manchester, John Smyth, Charles Stanhope, and William Johnson Temple.Their articles in the Oxford Dictionary of National Biography."]}, {"page": "List of Lords Commissioners of the Treasury", "response": ["**John Smyth", "**John Smyth", "**John Smyth", "**John Smyth", "**John Smyth", "**John Smyth"]}, {"page": "Descendants of Ferdinand II of Aragon and Isabella I of Castile", "response": ["|John Smyth, Member of Parliament for Ponterfract, had issue"]}]}}