{"wiki_id": "http://www.wikidata.org/entity/Q6257175", "itemLabel": "John Scurr", "itemDescription": "British Labour Party Member of Parliament (1876-1932)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Scurr", "wikipedia_page": {"main": "John Scurr (born Rennie; 6 April 1876 – 10 July 1932) was an English Labour Party politician and trade union official who served as Member of Parliament (MP) for Mile End from 1923 to 1931.\nScurr was born in Brisbane, Australia, the son of Louis James Rennie, an immigrant from London, but was adopted by his uncle, Captain John Scurr, and brought to London at six months old. He spent his life in Poplar in the East End, from which his family came, a lifelong supporter of left-wing and Labour causes.  In 1900, he married an Irish woman named Julia Sullivan, who became a prominent politician and campaigner for women's rights, who led a deputation (on behalf of Sylvia Pankhurst) to meet Prime Minister Asquith,  in 1914 and pleaded for suffrage for women supported by the poor working-class men and women of East London . They had two sons and a daughter born within four years. She died in 1927.\nHe was an accountant and active member of Poplar Trades Council (and later served as its president) and was elected as an alderman to Poplar Borough Council in 1919. He served as mayor in 1922–1923, vice-chairman (1920–1922) and chairman (1922–1923) of the Metropolitan Boroughs Standing Joint Committee, and an alderman of London County Council from 1925 to 1929. In 1921, he was imprisoned, along with 29 other Poplar councillors, as a protest against unequal rates.\nIn 1913, when Scurr was Chairman of the London District Committee of the Dock, Wharf, Riverside and General Labourers' Union, he was a last minute socialist candidate at the Chesterfield by-election. \n\nHe contested the 1914 Ipswich by-election, where he finished in third place; as the Conservatives gained the seat from the Liberals.\nAt the 1918 general election, he unsuccessfully contested the Liberal seat of Buckingham, splitting the anti-Tory vote and allowing the Conservatives to win. He was defeated again at the 1922 general election in the Mile End constituency in the East End.\nScurr won the Mile End seat at the 1923 general election, unseating the Conservative MP Sir Walter Preston. He was re-elected in 1924 and 1929, but lost his seat when the Labour Party split at the 1931 general election.\n\n", "link_mentions": {}}}