{"wiki_id": "http://www.wikidata.org/entity/Q6257175", "itemLabel": "John Scurr", "itemDescription": "British Labour Party Member of Parliament (1876-1932)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Scurr", "wikipedia_page": {"main": "John Scurr (born John Rennie; 6 April 1876 – 10 July 1932) was an English Labour Party politician and trade union official who served as Member of Parliament (MP) for Mile End from 1923 to 1931. \nScurr was born in Brisbane, Australia, the son of Louis James Rennie, an immigrant from London, but was adopted by his uncle, Captain John Scurr, and brought to London at six months old. He spent his life in Poplar in the East End, from which his family came, a lifelong supporter of left-wing and Labour causes.  In 1900, he married an Irish woman named Julia Sullivan, who became a prominent politician and campaigner for women's rights, who led a deputation (on behalf of Sylvia Pankhurst) to meet Prime Minister Asquith,  in 1914 and pleaded for suffrage for women supported by the poor working-class men and women of East London . They had two sons and a daughter born within four years. She died in 1927.\nHe was an accountant and active member of Poplar Trades Council (and later served as its president) and was elected as an alderman to Poplar Borough Council in 1919. He served as mayor in 1922–1923, vice-chairman (1920–1922) and chairman (1922–1923) of the Metropolitan Boroughs Standing Joint Committee, and an alderman of London County Council from 1925 to 1929. In 1921, he was imprisoned, along with 29 other Poplar councillors, as a protest against unequal rates.\nIn 1913, when Scurr was Chairman of the London District Committee of the Dock, Wharf, Riverside and General Labourers' Union, he was a last minute socialist candidate at the Chesterfield by-election. \n\nHe contested the 1914 Ipswich by-election, where he finished in third place; as the Conservatives gained the seat from the Liberals.\nAt the 1918 general election, he unsuccessfully contested the Liberal seat of Buckingham, splitting the anti-Tory vote and allowing the Conservatives to win. He was defeated again at the 1922 general election in the Mile End constituency in the East End.\nScurr won the Mile End seat at the 1923 general election, unseating the Conservative MP Sir Walter Preston. He was re-elected in 1924 and 1929, but lost his seat when the Labour Party split at the 1931 general election.", "link_mentions": [{"page": "Poplar Rates Rebellion", "response": ["* John Scurr"]}, {"page": "Patrick Hastings", "response": ["On 6 August Campbell's house was raided, and he was arrested by the police. On the same day John Scurr, a Labour backbencher, asked the Home Secretary why Campbell had been detained and on whose orders.Hyde (1960) p. 142 Hastings himself read out a reply, which said that the Director of Public Prosecutions had complained that the article was inciting troops to mutiny. Another Labour backbencher, Jimmy Maxton, rose and asked the Prime Minister \"if he has read the article, and if he is aware that the article contains mainly a call to the troops not to allow themselves to be used in industrial disputes, and that that point of view is shared by a large number of Members sitting on these benches?\"Hyde (1960) p. 143 This statement lead to uproar, and the Speaker was forced to intervene and halt further discussions."]}, {"page": "List of MPs elected in the 1924 United Kingdom general election", "response": ["|John Scurr"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*John Scurr, Mile End, 1923–31"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|John Scurr"]}, {"page": "List of MPs elected in the 1923 United Kingdom general election", "response": ["|John Scurr"]}, {"page": "Mile End (UK Parliament constituency)", "response": ["| John Scurr"]}, {"page": "No More War Movement", "response": ["The British No More War Movement (NMWM) was founded in 1921 as a pacifist and socialist successor to the No-Conscription Fellowship.Martin Ceadel, Semi-Detached Idealists:The British Peace Movement and International Relations, 1854-1945. Oxford University Press, 2000  (p. 432).Lyn Smith, Voices against War : A Century of Protest. Edinburgh: Mainstream Publishing, 2009.  (pp. 63–64). For the first two years of its existence, it was known as the No More War International Movement. It became the British section of War Resisters International. Chaired by Fenner Brockway, it asked members to strive for revolutionary socialism but not to take part in any war. Other notable NMWM members included Wilfred Wellock,Michael Pugh, Liberal Internationalism: The Interwar Movement for Peace in Britain. Palgrave Macmillan, 2012.  (p. 94). Leslie Paul,Leslie Paul, Angry Young Man. Faber, 1951. (pp. 204, 284). A. Barratt Brown, Leyton Richards, W. J. Chamberlain and Monica Whately. \"Whateley, Monica Mary BA, (1890-1960)\" in Cheryl Law, Women, a modern political dictionary. London, I.B. Tauris, 2000.  (p.154). Nigel Copsey and Andrzej Olechnowicz, Varieties of Anti-Fascism: Britain in the Inter-War Period Palgrave Macmillan 2010.  (p. 108). The movement also received messages of support from several international figures, including Albert Einstein.Otto Nathan, Heinz Norden, Einstein on Peace. Simon and Schuster, 1960. (p. 91). In 1926, a member proposed the creation of a white poppy, in the manner of the British Legion's red poppies, but with the added meaning of a hope for an end to all wars. The group did not pursue the idea, but it was later taken up by the Women's Co-operative Guild.Peter Barberis, John McHugh and Mike Tyldesley, Encyclopedia of British and Irish Political Organizations At its peak, the NMWM numbered around 3000 members, many from the Independent Labour Party. In 1929, several prominent British intellectuals signed a statement, \"Why I Believe in the No More War Movement\", supporting the NMWM's aims.W. J. Chamberlain, Fighting for Peace: The Story of the War Resistance Movement, London, 1929. Among the signatories were: Harold Laski, Frederick Soddy, H. M. Swanwick, Margaret Llewelyn Davies, Herbert Henry Elvin, John Scurr, Tom Williams, Evelyn Sharp, Emily Phipps, Canon Charles E. Raven, Rhys J. Davies, Hamilton Fyfe, the Marquis of Tavistock, Barbara Ayrton-Gould and Alfred Salter. The group published two journals: The New World and No More War."]}, {"page": "Louisa Garrett Anderson", "response": ["From 1903, Anderson had been active in organizations affiliated with the NUWSS, which advocated for gaining voting rights through peaceful means. Frustrated by the lack of progress on voting rights, in 1907, she became an active member of the more radical WSPU. On 18 November 1910, Anderson joined her mother, Emmeline Pankhurst, Alfred Caldecott, Hertha Ayrton, Mrs Elmy, Hilda Brackenbury, Princess Sophia Duleep Singh, and 300 women to petition Prime Minister Asquith for voting rights. The protest became known as Black Friday, due to the violence and sexual assault the protesters faced from the police and male bystanders. More than one hundred women were arrested, including Anderson, but all were released without charge. In 1912, she was imprisoned in Holloway, briefly, for her suffragette activities which included breaking a window by throwing a brick. In 1914, Anderson joined Agnes Harben and the new group of women and men: H. J. Gillespie, Gerald Gould, Bessie Lansbury and George Lansbury, Mary Neal, Emmeline Pethick-Lawrence, Julia Scurr and John Scurr, Evelyn Sharp, and Edith Ayrton, Louise Eates and Lena Ashwell  in starting the United Suffragists which grew to have branches in London, Liverpool, Edinburgh and Glasgow."]}, {"page": "Walter Preston (British politician)", "response": ["At the 1918 general election, he was elected as Member of Parliament (MP) for the Mile End constituency in the East End of London.  He lost the seat at the 1923 general election to the Labour Party candidate John Scurr."]}, {"page": "Barnet Kenyon", "response": ["The controversy over Kenyon's party affiliation spilled over into the contest, but in the event he won easily, topping the poll with a majority of 2,186 over the Unionist candidate, Edward Christie, while the socialist, John Scurr, received only 583 votes."]}, {"page": "1913 Chesterfield by-election", "response": ["Despite their earlier willingness to accept Kenyon as the Labour representative, the executive committee of the national Labour party at a meeting at their Victoria Street headquarters in London passed a resolution on 12 August 1913 repudiating Kenyon as an official Labour candidate on the grounds that he was not conducting his campaign in accordance with the Labour Party constitution. This decision caused some disquiet to Labour supporters of Kenyon in the constituency as it now seemed distinctly possible that an official Labour candidate would be put up.The Times, 13 August 1913 They were right to be concerned because on 14 August, just two days before close of nominations, a meeting of trade unionists and socialists in Chesterfield voted to put up John Scurr, Chairman of the London District Committee, Dock, Wharf, Riverside and General Labourers' Union to be Labour and Socialist candidate at the by-election. Scurr had fought a Parliamentary election as a socialist before, at South West Bethnal Green in 1911 where he came bottom of the poll by a long margin.The Times, 31.7.11 He was to contest the same seat again in 1914 and he also fought at Ipswich in 1914. Scurr later became an Alderman on Poplar Borough Council and was imprisoned in the controversial rates case there in the 1920s.The Times, 29 August 1921 He later won a seat on the London County Council and became Labour MP for Mile End.The Times, 11 July 1932", "The result of the election was a triumph for Kenyon. He topped the poll with a majority of 2,186 over the Unionist candidate Edward Christie while John Scurr received only 583 votes. "]}, {"page": "List of members of London County Council 1919–1937", "response": ["| John Scurr MP", "| John Scurr (died 10 July 1932)"]}, {"page": "Walter Windsor", "response": ["On 15 January 1924, as peers and MPs assembled for the State Opening of Parliament, Windsor and fellow MPs Clement Attlee and John Scurr joined a demonstration outside Temple Gardens on the Victoria Embankment which had been organised by the National Unemployed Workers' Movement. Windsor marched with a contingent of workers from Bethnal Green."]}, {"page": "1911 Bethnal Green South West by-election", "response": ["Eric Hoffgaard, who had been the Conservative Party candidate at the previous general election, was again selected to contest the seat. An Australian-born socialist John Scurr made it a three-way fight. When Masterman was selected as the official Liberal candidate, some of Harris' supporters decided to campaign in support of Scurr."]}, {"page": "1914 Ipswich by-election", "response": ["* 38-year-old Australian John Scurr stood as a Socialist candidate. In 1913 he was a Socialist candidate at the Chesterfield by-election. He had also stood as Socialist candidate against Masterman at Bethnal Green. Scurr was Chairman of the London District Committee of the Dock, Wharf, Riverside and General Labourers' Union."]}, {"page": "1914 Bethnal Green South West by-election", "response": ["* Thirty-eight-year-old Australian-born Socialist John Scurr again stood. He had made a habit of contesting by-elections in the hope that he could attract sufficient Liberal votes to let the Unionist win. Since the 1911 by-election he had stood at the 1913 Chesterfield by-election where he finished a poor third. He was the nomination of the Bethnal Green Trades and Labour Council.Hull Daily Mail, 16 Feb 1914", "*Socialist: John Scurr"]}, {"page": "George Green's School", "response": ["* John Scurr, Labour MP"]}, {"page": "United Suffragists", "response": ["Founder members of the United Suffragists included Louisa Garrett Anderson, H. J. Gillespie, Gerald Gould, Agnes Harben and Henry Devenish Harben, Bessie Lansbury, George Lansbury, Mary Neal, Emmeline Pethick Lawrence, Julia Scurr and John Scurr, Evelyn Sharp, and Edith Ayrton. Louise Eates and Lena Ashwell also became members in 1914, and Ellen Smith who was in the Fabian Society,  like H.J. Gillespie, who was the United Suffragists treasurer.  Maud Arncliffe Sennett became its first vice-president."]}, {"page": "Julia Scurr", "response": ["Born in Limehouse in the East End of London, she married John Scurr in 1900, who was an accountant, trade unionist and associate of George Lansbury.  A mother of three children born over four years, she also became a prominent activist for working women in the East End, and was the main organiser of a large demonstration against unemployment in 1905, following which she met the then Prime Minister, Arthur Balfour.  In 1907, she was elected to the Poplar Board of Guardians, representing the Labour Party.\"Poplar councillors\", Oxford Dictionary of National Biography", "She is commemorated in the Julia Scurr garden at the John Scurr Primary School in Stepney. "]}, {"page": "Scurr", "response": ["* John Scurr (1876–1932), English Labour Party politician and trade union official."]}, {"page": "Antisemitism in the UK Conservative Party", "response": ["In November 1925, during parliamentary debates about the renewal of the Aliens Act, Joynson-Hicks was confronted about his actions by Labour MP John Scurr and Jewish Conservative MP Samuel Finburgh. Scurr said that the Aliens Act was being used 'against one section of the community, and particularly against the poorer members of the Jewish community'. Samuel Finburgh highlighted that Jews who 'had been trying to get naturalized [were finding that] every possible obstruction was placed in their way'. Joynson-Hicks responded by challenging Finburgh to give him a single example of when the Home Office had shown anti-Jewish bias, even though, Cesarani points out, Joynson-Hicks had entered and accepted a Home Office already discriminating against Jews in the applications for citizenship and, during his time in office, had received a memorandum on naturalization from John Pedder, the Home Office Principle Assistant Secretary, who regularly processed complaints from the Jewish community about Home Office action."]}, {"page": "National Administrative Council", "response": ["| John Scurr", "| John Scurr"]}, {"page": "Mile End (London County Council constituency)", "response": ["| John Scurr"]}, {"page": "Scurr, John", "response": ["#redirectJohn Scurr"]}, {"page": "Agnes Harben", "response": ["On 13 February 1914, Harben became one of the  founder committee members of the United Suffragists which brought together militant and non-militant women and included men, like her husband, along with Louisa Garrett Anderson, H. J. Gillespie, Gerald Gould, Bessie Lansbury and George Lansbury, Mary Neal, Emmeline Pethick-Lawrence, Julia Scurr and John Scurr, Evelyn Sharp, and Edith Ayrton; Louise Eates and Lena Ashwell also became members in 1914, and the organisation grew rapidly, and it took over the publishing of the weekly Votes for Women from the militant WSPU. United Suffragists established active groups in Amersham, Stroud, Edinburgh and in by-election campaigns in Poplar and Bethnal Green."]}]}}