{"wiki_id": "http://www.wikidata.org/entity/Q6255828", "itemLabel": "John Rowland", "itemDescription": "English footballer, born 1941", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Rowland_(footballer,_born_1941)", "wikipedia_page": {"main": "John Douglas Rowland (7 April 1941 – 2020) was an English footballer who was known for his powerful 'hammer shot'. A forward, he scored 62 goals in 250 league games in a nine-year career in the Football League.\nHe began his career at Nottingham Forest in 1960, before being sold on to Port Vale for £6,000 in August 1962. In September 1966, he was sold on to Mansfield Town for £6,500. Two years later he joined Tranmere Rovers, before dropping into non-league football with South Shields in 1969; he finished his career at Derry City. His death was announced by Port Vale on 20 November 2020.", "link_mentions": [{"page": "John Rowland", "response": ["John Rowland may refer to:", "* John Rowland (diplomat) (1925–1996), Australian diplomat", "* John Rowland (footballer, born 1936) (1936–2002), Welsh footballer", "* John Rowland (footballer, born 1941) (1941–2020), English footballer", "* John Rowland (MP), represented Winchelsea", "* John Rowland (Desperate Housewives), character in the U.S. television series Desperate Housewives", "* John Rowland: the main protagonist in the 1898 novella The Wreck of the Titan: Or, Futility by Morgan Robertson", "* John Rowlands (disambiguation)"]}, {"page": "Norman Low", "response": ["Low planned for the 1962–63 season by signing John Rowland, a 'tall and skilful' outside-right from Nottingham Forest, for £6,000. His team began reasonably well, however Low could not 'see eye to eye with the board on their buying policy' and tendered his resignation in October 1962. One staff member later reported that Low had travelled to Huddersfield Town to sign Willie Davie for a £20,000 fee; however during his absence the Port Vale directors finalised agreements for Freddie Steele to return to the club, and upon his return he found himself out of a job."]}, {"page": "List of Port Vale F.C. records and statistics", "response": ["*Longest consecutive scoring run: 8, John Rowland (1 September to 4 October 1965) & Basil Hayward (28 November 1953 to 26 January 1954)."]}, {"page": "List of Port Vale F.C. seasons", "response": ["|John Rowland"]}, {"page": "History of Port Vale F.C.", "response": ["After a good start to 1966–67, the previous season's top scorer John Rowland was sold to Mansfield Town for £6,500. A 'gloom' descended, multiplied by matters such as debt and the death of ex-player John Nicholson. The season tailed off, especially with new signing, former Wales international Mel Charles failing to impress. Just before the season ended, John Ritchie was sold to Preston North End for £17,500, to help pay off an £80,000 overdraft. On 8 May, Mudie resigned as player-manager due to 'personal reasons'. The club finished in mid-table with a financial loss, despite making a profit in the transfer market. It was noted that 'the weekly income is insufficient to maintain the club. On a more positive note, Roy Sproson was awarded the first 'player of the year' award by the club."]}, {"page": "John Douglas Rowland", "response": ["#REDIRECT John Rowland (footballer, born 1941)"]}, {"page": "Bernard Wright (footballer)", "response": ["Wright played for Sligo Rovers before crossing the Irish Sea to try his luck in England with Norman Low's Port Vale in August 1962. He replaced John Rowland as the Vale's number 7, but in November new manager Freddie Steele dropped Wright for Rowland. He made 14 Third Division and one League Cup appearances for the \"Valiants\", and scored goals in a 1–0 win over Colchester United at Layer Road (10 September) and a 2–1 win over Watford at Vicarage Road (18 May). Wright was loaned out to Stafford Rangers in April 1963, before leaving Vale Park on a free transfer the next month."]}, {"page": "1962–63 Port Vale F.C. season", "response": ["The pre-season saw the arrival of John Rowland, a 'tall and skilful' outside-right from Nottingham Forest for £6,000.", "|align=\"left\"|FW||align=\"left\"| John Rowland", "|5||FW||||John Rowland||7||0||0||7", "| August 1962 || FW ||  || John Rowland || Nottingham Forest || £6,000 || "]}, {"page": "1963–64 Port Vale F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| John Rowland", "|7||FW||||John Rowland||4||0||0||4"]}, {"page": "1964–65 Port Vale F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| John Rowland", "|–||FW||||John Rowland||5||0||0||5"]}, {"page": "1965–66 Port Vale F.C. season", "response": ["They finished in nineteenth spot with 39 points, leaving them two points away from having to apply for re-election. They were ahead of Chesterfield on goal average, and two points ahead of Rochdale, Lincoln City, and Bradford City, and four points ahead of Wrexham. Their 48 goals scored was atrocious, and easily the weakest in the division, though the defence only conceded 59. The one saviour was John Rowland, whose 23 goals in all competitions was almost quadruple that of his nearest rival.", "|align=\"left\"|FW||align=\"left\"| John Rowland", "|1||FW||||John Rowland||21||1||1||23"]}, {"page": "1966–67 Port Vale F.C. season", "response": ["The season opened with a 2–1 home win over Southport using an optimistic 4–2–4 formation. Following Roy Sproson's winning goal there was a pitch invasion – by then a disturbingly common occurrence. Six games without a loss followed, leaving the club in fourth position. Goals were still rare however, and so Lawson was dropped from the first eleven, despite the departure of in-form forward John Rowland to Mansfield Town for £6,500. Financial difficulties made the atmosphere around Burslem quite gloomy, not helped by the news that former Valiant John Nicholson had been killed in a car crash. Vale's form suffered, though the defence remained quite strong. Young Scot Mick Cullerton was a ray of sunshine for the club in front of goal.", "|align=\"left\"|FW||align=\"left\"| John Rowland", "|6||FW||||John Rowland||3||0||1||4", "| September 1966 || FW ||  || John Rowland || Mansfield Town || £6,500 || "]}, {"page": "2020 in the United Kingdom", "response": ["*26 April – John Rowlands, 73, English footballer (Stockport County, Barrow, Workington), COVID-19.", "**John Rowland, 79, English footballer (Nottingham Forest, Port Vale, Mansfield Town)."]}, {"page": "1966–67 Mansfield Town F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| John Rowland"]}, {"page": "1967–68 Mansfield Town F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| John Rowland", "|align=\"left\"|FW||align=\"left\"| John Rowlands"]}, {"page": "Deaths in November 2020", "response": ["*John Rowland, 79, English footballer (Nottingham Forest, Port Vale, Mansfield Town).RIP John Rowland"]}, {"page": "2020–21 in English football", "response": ["* 21 November 2020: John Rowland, 79, Nottingham Forest, Port Vale, Mansfield Town and Tranmere Rovers forward."]}]}}