{"wiki_id": "http://www.wikidata.org/entity/Q6255104", "itemLabel": "John Robert Edwards", "itemDescription": "Professor of psychology", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Robert_Edwards", "wikipedia_page": {"main": "John Robert Edwards  (born 3 December 1947, Southampton, England) received a PhD from McGill University in 1974.  After working as a Research Fellow at the Educational Research Centre in Dublin (now part of Dublin City University), he moved to Nova Scotia and joined the Psychology Department at St Francis Xavier University, where he is now Professor Emeritus and a Senior Research Professor.  He is also an Adjunct Professor (Graduate Studies) at Dalhousie University in Halifax.  He has been a Visiting Lecturer at many universities, and a Visiting Professor in England (University of Bristol), Ireland (Trinity College Dublin) and China (Minzu University, Beijing).  He is an Honorary Professor at the Hong Kong Polytechnic University.  Edwards is a fellow of the British Psychological Society (as of 1989), the Canadian Psychological Association (also 1989), and the Royal Society of Canada (2000).\nHis main research interest is with the establishment, maintenance and continuity of group identity, with particular reference to language in both its communicative and symbolic aspects.  He has lectured and presented papers on this topic in some thirty countries, and his work has been translated into half-a-dozen languages. He is the author of a dozen books, and editor of five.  He has also written some 300 articles, chapters and reviews.\nEdwards is or has been an editorial-board member for about twenty international language journals and several book series.  He was the Editor of the Journal of Multilingual and Multicultural Development (now published by Routledge) for twenty-five years, and remains as Reviews Editor. He was for twenty years the Editor of the Multilingual Matters book series for the Bristol publisher of the same name, a series that now comprises more than 150 titles; he is now the co-editor of the series.  He is a member of half-a-dozen scholarly societies devoted to language, nationalism and their ramifications.\nFor a decade (1990-1999), he was the Chair of the Canadian Ethnic Studies Advisory Committee, a panel within the Department of Multiculturalism & Citizenship (now the Department of Canadian Heritage) that assessed applications for  research grants, research fellowships and the establishment of university chairs.\nEdwards was given the St Francis University President’s Research Award (in 1995) and its University Research Award (in 2008).  In 2012 he received the Gardner Award for research in bilingualism from the International Association of Language and Social Psychology.\n\n", "link_mentions": [{"page": "John Edwards (disambiguation)", "response": ["* John Robert Edwards (born 1947), professor of psychology and language in Nova Scotia"]}, {"page": "Journal of Multilingual and Multicultural Development", "response": ["The Journal of Multilingual and Multicultural Development is a peer-reviewed academic journal covering the study of topics in the sociology and social psychology of language, in language and cultural politics, policy, planning, and practice. The editor-in-chief is John Robert Edwards. It was established in 1980 and is published in 7 issues per year by Routledge."]}]}}