{"wiki_id": "http://www.wikidata.org/entity/Q6257528", "itemLabel": "John Shearman", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Shearman", "wikipedia_page": {"main": "John Kinder Gowran Shearman (pronounced \"Sherman\"; 24 June 1931 – 11 August 2003) was an English art historian who also taught in America. He was a specialist in Italian Renaissance painting, described by his colleague James S. Ackerman as \"the leading scholar of Italian Renaissance painting\", who published several influential works, but whose expected major book on Quattrocento painting, for the Penguin/Yale History of Art series (commissioned in 1984, and still a gap in the series in 2019), never appeared. However, what is widely acknowledged as his most influential book, on the concept of Mannerism, published in 1967, is still in print.", "link_mentions": [{"page": "Mannerism", "response": ["John Shearman, \"Maniera as an Aesthetic Ideal\", in Cheney 2004, 37. In the second edition of his Lives of the Most Excellent Painters, Sculptors, and Architects (1568), Giorgio Vasari used maniera in three different contexts: to discuss an artist's manner or method of working; to describe a personal or group style, such as the term maniera greca to refer to the medieval Italo-Byzantine style or simply to the maniera of Michelangelo; and to affirm a positive judgment of artistic quality.Cheney 1997, 17. Vasari was also a Mannerist artist, and he described the period in which he worked as \"la maniera moderna\", or the \"modern style\".Briganti 1961, 6. James V. Mirollo describes how \"bella maniera\" poets attempted to surpass in virtuosity the sonnets of Petrarch.Mirollo 1984,  This notion of \"bella maniera\" suggests that artists who were thus inspired looked to copying and bettering their predecessors, rather than confronting nature directly. In essence, \"bella maniera\" utilized the best from a number of source materials, synthesizing it into something new.", "As a stylistic label, \"Mannerism\" is not easily defined. It was used by Swiss historian Jacob Burckhardt and popularized by German art historians in the early 20th century to categorize the seemingly uncategorizable art of the Italian 16th century – art that was no longer found to exhibit the harmonious and rational approaches associated with the High Renaissance. \"High Renaissance\" connoted a period distinguished by harmony, grandeur and the revival of classical antiquity. The term \"Mannerist\" was redefined in 1967 by John ShearmanShearman 1967. following the exhibition of Mannerist paintings organised by Fritz Grossmann at Manchester City Art Gallery in 1965.Grossmann 1965. The label \"Mannerism\" was used during the 16th century to comment on social behaviour and to convey a refined virtuoso quality or to signify a certain technique. However, for later writers, such as the 17th-century Gian Pietro Bellori, la maniera was a derogatory term for the perceived decline of art after Raphael, especially in the 1530s and 1540s.Smyth 1962, 1–2. From the late 19th century on, art historians have commonly used the term to describe art that follows Renaissance classicism and precedes the Baroque."]}, {"page": "Raphael", "response": ["Raphael was one of the finest draftsmen in the history of Western art, and used drawings extensively to plan his compositions. According to a near-contemporary, when beginning to plan a composition, he would lay out a large number of stock drawings of his on the floor, and begin to draw \"rapidly\", borrowing figures from here and there.Giovanni Battista Armenini (1533–1609) De vera precetti della pittura(1587), quoted Pon:115 Over forty sketches survive for the Disputa in the Stanze, and there may well have been many more originally; over four hundred sheets survive altogether.Jones & Penny:58 & ff; 400 from Pon:114 He used different drawings to refine his poses and compositions, apparently to a greater extent than most other painters, to judge by the number of variants that survive: \"... This is how Raphael himself, who was so rich in inventiveness, used to work, always coming up with four or six ways to show a narrative, each one different from the rest, and all of them full of grace and well done.\" wrote another writer after his death.Ludovico Dolce (1508–1568), from his L'Aretino of 1557, quoted Pon:114 For John Shearman, Raphael's art marks \"a shift of resources away from production to research and development\".quoted Pon:114, from lecture on The Organization of Raphael's Workshop, pub. Chicago, 1983"]}, {"page": "Anthony Blunt", "response": ["Notable students who have been influenced by Blunt include Aaron Scharf, photography historian and author of 'Art and Photography' (whom Blunt assisted, along with Scharf's wife, in escaping McCarthy condemnation for their support of communism), Brian Sewell (an art critic for the Evening Standard), Ron Bloore, Sir Oliver Millar (his successor at the Royal Collection and an expert on Van Dyck), Nicholas Serota, Neil Macgregor, the former editor of the Burlington magazine, former director of the National Gallery and former director of the British Museum who paid tribute to Blunt as \"a great and generous teacher\",British Museum's Director Follows A Fascination To Germany, Erlanger, Steven, The New York Times, 16 October 2015 John White (art historian), Sir Alan Bowness (who ran the Tate Gallery), John Golding (who wrote the first major book on Cubism), Reyner Banham (an influential architectural historian), John Shearman (the \"world expert\" on Mannerism and the former Chair of the Art History Department at Harvard University), Melvin Day (former Director of National Art Gallery of New Zealand and Government Art Historian for New Zealand ), Christopher Newall (an expert on the Pre-Raphaelites), Michael Jaffé (an expert on Rubens), Michael Mahoney (former Curator of European Paintings at the National Gallery of Art, Washington, D.C., and former Chair of the Art History Department at Trinity College, Hartford), Lee Johnson (an expert on Eugène Delacroix), Phoebe Pool (art historian), and Anita Brookner (an art historian and novelist)."]}, {"page": "Penguin Books", "response": ["For Penguin the series was a departure from their commercial mainstay of paperbacks as the histories of art were the first large format, illustrated hardback books they had produced.Though paperback issues were begun in 1966, designed by Gerald Cinamon \"Penguin paperback cover designs\". Despite their relatively high price they were a financial success, yet for Pevsner they were intended primarily as graduate level texts in what was, for the English speaking world, the newly emerging academic discipline of art history.Harries, Pevsner, p. 562. Nevertheless, the series was criticised from within the academy for its evident biases. Many of its authors were German émigrés, consequently there was a methodological preference for the kunstwissenschaft practiced in Vienna and Berlin between the wars; a formalism that ignored the social context of art.The point of view maintained at the Courtauld, for example: \"After the war many older art historians took the view that the primary tasks of art history had already been accomplished, and that the time had come for summaries. This was the platform from which Pevsner launched his Pelican History of Art project, but it was not how the situation was perceived at the Institute.\" \"A History of the Courtauld\". Moreover, the weight given to some subjects seemed disproportionate to some critics, with seven of its 47 volumes dedicated to English art, a \"tributary of the main European current\" as the Burlington Magazine observed.Harries, Pevsner, p. 566; Burlington Magazine, October 1953. Though the 1955 plan was never fully executed—the volumes on Greek painting and sculpture, quattrocento painting and cinquecento sculpture were not written—the Pelican History remains one of the most comprehensive surveys of world art published.John Shearman was commissioned early on for quattrocento painting, but though he did a large amount of work, he found he could not keep up with the torrent of new research, and never delivered his manuscript."]}, {"page": "Sistine Chapel ceiling", "response": ["* Giacometti, Massimo (1984). The Sistine Chapel, a collection of essays on aspects of the chapel, its decoration and the restoration of Michelangelo's frescoes, by Carlo Pietrangeli, André Chastel, John Shearman, John O'Malley S.J., Pierluigi de Vecchi, Michael Hirst, Fabrizio Mancinelli, Gianluigi Colallucci, and Franco Bernabei. 1984, Harmony Books. "]}, {"page": "Chigi Chapel", "response": ["thumb|right|180px|Drawing from the workshop of Gian Lorenzo Bernini, c. 1655The main altar-piece, a mural depicting the birth of the Virgin by Sebastiano del Piombo was begun in 1530 but it was left unfinished in 1534. Work on the chapel resumed in 1548 when Francesco Salviati was commissioned to create frescoes on the drum and the spandrels, although Raphael intended mosaics on these surfaces. He also completed the mural above the main altar. In 1552 Lorenzo Chigi paid his debt towards the heirs of Lorenzetto, and the two statues were finally placed in the chapel. After this the chapel was unveiled for the first time in 1554.John Shearman: The Chigi Chapel in S. Maria del Popolo, Journal of the Warburg and Courtauld Institutes, Vol. 24, No. 3/4 (Jul. - Dec., 1961)", "The traditional interpretation of the dome is that the composition shows the Creation of the World. Another interpretation, proposed by John Shearman, claims that it represents the cosmos as described by Plato in a Christianized Neoplatonist form. This idea had a widespread popularity in the Renaissance. In this case the dome is a depiction of the \"Realm of the Soul after Death\" with God, the Father receiving the soul (of Agostino Chigi) in his new home. The presence of the signs of the zodiac corroborates this interpretation because the signs were symbols of the passage of time in eternity, and they appeared in antique funeral art around the image of the departed.", "thumb|right|200px|The Birth of the Virgin by Sebastiano del PiomboJohn Shearman proposed that the main altar-piece was intended to be an Assumption of the Virgin but the theory remains heavily disputed. Soon after Raphael died, Sebastiano del Piombo was chosen to carry on the work on the altar-piece but he achieved less than expected. Vasari gives a scathing account in his Lives:"]}, {"page": "John Sherman (disambiguation)", "response": ["*John Shearman (1931–2003), English art historian, pronounced as \"John Sherman\""]}, {"page": "St Edmund's School, Hindhead", "response": ["* John Shearman - Art historian"]}, {"page": "2003 in the United Kingdom", "response": ["** John Shearman, art historian (born 1931)"]}, {"page": "Shearman", "response": ["Shearman is an English surname, which may be pronounced as \"Sherman\" (as for example with John Shearman). Notable people with the surname include:", "*John Shearman (1931–2003), English art historian"]}, {"page": "Restoration of the Sistine Chapel frescoes", "response": ["The building was a little unstable and had already shifted considerably prior to Michelangelo's work of 1508, causing cracking of the ceiling, the crack in the \"Judith\" pendentive being so large that it had to be filled with bricks and mortar before painting. The upper part of the ceiling provided Michelangelo an irregular surface due to cracks and water seepage.John Shearman, essay The Chapel of Sixtus IV in The Sistine Chapel, ed. Massimo Giacometti, (1986) Harmony Books, "]}, {"page": "1931 in the United Kingdom", "response": ["** John Shearman, art historian (died 2003)"]}, {"page": "List of people from Aldershot", "response": ["* John Shearman - art historian"]}, {"page": "Villa Medici at Cafaggiolo", "response": ["The Villa Medicea di Cafaggiolo's origins date from the 14th century. The fortezza that belonged to the Republic of Florence in 1349 was already known as \"Cafaggiolo de' Medici\" by 1359,John Shearman, \"The Collections of the Younger Branch of the Medici\" The Burlington Magazine 117 No. 862 (January 1975, p. 17 when it was the property of Averardo de' Medici (died 1363).   It passed from Giovanni di Bicci  jointly to Averardo and Giuliano di Francesco de' Medici, the grandsons of Averardo's younger son Lorenzo; from them, it passed to Cosimo and Lorenzo jointly;Cafaggiolo appears in their list of joint properties, 1440. (Shearman 1975:17). and it was ceded to Cosimo's sole ownership in a property division of 1451.", "The Medici Pope Leo X, formerly (Giovanni di Lorenzo de' Medici) spent a part of his childhood at the castle, and briefly held court at the villa on 15 December 1515,G. Baccini, Le ville Medicee di Cafaggiolo e di Trebbio in Mugello (Florence) 1897, noted by John Shearman, \"The Florentine Entrata of Leo X, 1515\" Journal of the Warburg and Courtauld Institutes  38 (1975, pp. 136-154) p. 154 note 667. A Cafaggiolo istoriato maiolica dish in the Victoria and Albert Museum commemorates Leo's recent magnificent processional entrata into Florence (illus. fig. 23c). Cafaggiolo lay on the main road from Bologna to Florence. on his return from his secret talks with Francis I at Bologna, in which it was said that he had played a double game in his efforts to drive the French out of Italy.", "*John Shearman, \"The Collections of the Younger Branch of the Medici\" The Burlington Magazine 117 No. 862 (January 1975), pp. 12, 14-27. Inventories of Cafaggiolo and other Medici villas, at the deaths of the brothers Lorenzo (1503) and Giovanni di Pierfrancesco (1498)."]}, {"page": "Bollingen Foundation", "response": ["|John Shearman"]}, {"page": "Figura serpentinata", "response": ["Bousquet holds that the  style arose as a result of the discovery of the Laocoön group in 1506, and its deep impact on all artists, but on Michelangelo in particular.  John Shearman also argues that it was invented by Michelangelo, citing the \"Victors\" that he produced for Pope Julius II's tomb.  Maurer, on the other hand, can only detect this style rarely in Michelangelo's work and cites Beccafumi instead as its pioneer. Beccafumi's student Marco Pino connected Beccafumi's style with those of Salviati, Parmigianino and perhaps even Michelangelo, and his work as a whole is marked by  motifs. Paolo Pino himself says in his Dialogo della Pittura, that his figures' poses are many and varied, and that in all his works to find one single figure, that completely and utterly distorts, is ambivalent and difficult.", "*John Shearman:  Mannerism. Art and Architecture series. London : Penguin Books, 1991, "]}, {"page": "Counter-Maniera", "response": ["Deciding what characterizes a work in Counter-Mannerist style may not be straightforward; in the single brief passage mentioning the term in John Shearman's Mannerism (1967), he picks Santi di Tito's Vision of St Thomas Aquinas (1593, illustrated here, as in both books) as an example of it, but Freedberg excludes Santo's classicising naturalism from the style, though noting his similarities to it.Shearman, 178; Freedberg, 624 Shearman's other main example of Counter-Mannerism is Federigo Barocci, who Freedberg also excludes from his definition.Shearman, 178; Freedberg, 632–640"]}, {"page": "List of Old Felstedians", "response": ["* John Shearman (1931–2003), art historian, specialist in Italian renaissance, prolific author, Professor at Harvard (ODNB)"]}, {"page": "Shepherd with a Flute", "response": ["Bernard Berenson was a strong supporter of the attribution to Giorgione, which still has some support. If by Giorgione, who died in 1510, it would probably date to  around 1508. Crowe and Cavalcaselle had already doubted the attribution in the later 19th century.  The attribution to Titian was most fully stated by John Shearman in his catalogue of this period in the Royal Collection,Whitaker and Clayton, 198–199 and notes. and has been agreed by many, including Freedburg.Freedburg, 682, note 40.  Despite the similarity in the subject, the painting technique is regarded as very different from Giorgione's and close to undoubted early Titians.Whitaker and Clayton, 198–199  "]}, {"page": "List of people from Hampshire", "response": ["*John Shearman, art historian, was born in Aldershot"]}, {"page": "The Layer Quaternity", "response": ["The quartet of figurines sculptured in marble, Pax, Gloria, Vanity, Labor exhibit primary thematic concerns and stylistic attributes of Northern Mannerist art, namely, portraiture of animated human movement, variety and multiplicity, often set in the Classical or mythological world, and inclined towards esoteric concepts. John Shearman Mannerism Pelican 1967 "]}, {"page": "Head of Christ (Correggio)", "response": ["In the early 1520s, Correggio was particularly interested in the study of the characters of the sacred history. Christ has his lips slightly parted, as if he would like to speak to the viewer. Correggio's bold reassessment of the theme filled the face of Christ an intense pathos. He looks at the viewers, as if to implore their  mercy.  According to art historian  John Shearman this kind of depiction is a typical example of a  \"transitive work\", i.e. a work that requires the emotional participation of the viewer and that can only be completed through being in the physical presence of the image.John Shearman makes a plea for a more engaged reading of art works of the Italian Renaissance, one that will recognize the presuppositions of Renaissance artists about their viewers. His book constructs a history of Renaissance paintings and sculptures that are by design completed outside themselves in or by the spectator, that embrace the spectator into their narrative plot or aesthetic functioning, and that reposition the spectator imaginatively or in time and space.Giuseppe Adani, Correggio pittore universale, Silvana Editoriale, Correggio 2007.  (Italian)"]}, {"page": "List of alumni of The Courtauld Institute of Art", "response": ["* John Shearman, Renaissance art historian "]}, {"page": "Deaths in August 2003", "response": ["*John Shearman, 72, British art historian."]}, {"page": "Jonah (Lorenzetto)", "response": ["John Shearman assumed that the statue of Jonah was planned for the niche to the right of the altar because this place offered the best angle to view the composition.John Shearman: The Chigi Chapel in S. Maria del Popolo, Journal of the Warburg and Courtauld Institutes, Vol. 24, No. 3/4 (Jul. - Dec., 1961) The statue was carved by Lorenzetto, Raphael's pupil, with assistance of the master, and he almost finished the work by 1520 when Agostino Chigi and Raphael died. Lorenzetto worked on this commission \"with all the zeal, diligence, and labor in his power, in order to come out of it with credit and to give satisfaction to Raphael\", as Vasari put it. Even so, the statue and its counterpart, the statue of Elijah remained in Lorenzetto's workshop. Vasari records in his Lives, speaking about the statues:", "John Pope-Hennessy was highly critical about Lorenzetto's skill in executing Raphael's design. The design \"was blurred and weakened by the sculptor Lorenzetto. This is one of the few sculptures in the world whose true merits transpire more clearly from plastercasts than from the original\", he wrote.John Pope-Hennessy, Italian High Renaissance and Baroque Sculpture, London, 1963, I, p. 44. John Shearman was less dismissive. \"The two statues that Raphael designed for the chapel have never been given the attention they deserve (and they cannot get it here)\", he observed."]}, {"page": "Elijah (Lorenzetto)", "response": ["There is a disagreement about the originally intended place of the statue. John Shearman thought that it was most likely planned for one of the two niches by the entrance which means that its present position is probably correct.John Shearman: The Chigi Chapel in S. Maria del Popolo, Journal of the Warburg and Courtauld Institutes, Vol. 24, No. 3/4 (Jul. - Dec., 1961)"]}, {"page": "List of fellows of the British Academy elected in the 1970s", "response": ["* Professor John Shearman"]}, {"page": "Howard Burns", "response": ["By the late 1960s Burns was teaching History of Art at Cambridge University using his own colour images of Italian architecture in his lectures. Anthony Blunt, Director of the Courtauld Institute, came to hear of Burns’ talent and encouraged him to teach at the Courtauld. By 1969 he was a lecturer there and this brought him into contact with a number of eminent art historians. such as John Shearman, Michael Hirst and Jennifer Fletcher.  In 1986 Burns moved to a professorship at Harvard University in the Graduate School of Design. Italy, long his passion, became Burns' next destination taking a professorial position at the University of Ferrara in 1994.  A year later he went over to the University of Venice. In 1993 Burns was appointed “Presidente of the Consiglio Scientifico of CISAAP, the Palladio Centre in Vicenza. Burns’ most recent post has been to a chair in architectural history at the Scoula Normale Superiore di Pisa."]}]}}