{"wiki_id": "http://www.wikidata.org/entity/Q6250525", "itemLabel": "John Niven", "itemDescription": "Scottish footballer (1921-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Niven_(footballer)", "wikipedia_page": {"main": "John Niven (15 May 1921 – 4 April 2011) was a Scottish footballer, who played as a goalkeeper for Renfrew, Hibernian, Dundee, East Fife and Kilmarnock.Niven first signed for East Fife in 1942, after being spotted by East Fife manager John McArthur. He made his first senior appearance for Hibernian, during a temporary loan in March 1942. Niven was also loaned to Dundee before he broke into the East Fife first team. He was their regular first choice goalkeeper during their period of success after the Second World War. Niven only conceded one goal in 210 minutes of football in the 1947 Scottish League Cup Final win against Falkirk. Former Scotland goalkeeper Jack Harkness praised Niven afterwards in his match report for the Sunday Post.East Fife won the B Division championship in 1948. Niven appeared to be on course for further success in the 1949–50 season, but he was injured before the League Cup semi-final. East Fife won both the semi-final against Rangers and the final against Dunfermline without him. East Fife then reached the 1950 Scottish Cup Final, but Niven was injured in a league match five days earlier. The second choice goalkeeper was also injured. This meant that 21-year-old Gordon Easson had to make his first team debut for East Fife in the Cup Final. Easson conceded a goal within 30 seconds and East Fife went on to lose 3–0.Niven was transferred to Kilmarnock in 1951. He played in the 1952 Scottish League Cup Final, which Kilmarnock lost 2–0 to Dundee. Niven retired from senior football in 1953 and became a mechanical engineer, working for  Sir William Arrol & Co. He then set up a motor factor business, which he operated until his retirement in 1988. Niven suffered from Parkinson's disease in later life. He died in April 2011, and was survived by his wife, a son and a daughter.", "link_mentions": {}}}