{"wiki_id": "http://www.wikidata.org/entity/Q6252141", "itemLabel": "John Patteson", "itemDescription": "English Tory politician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Patteson_(1755%E2%80%931833)", "wikipedia_page": {"main": "John Patteson (19 November 1755 – 3 October 1833) was an English Tory politician.He was the son of brewer Henry Sparke Patteson and Martha Fromansteel (daughter of Daniel Fromanteel) of Norwich and educated in Greenwich and Leipzig (1768).\nHe was an Alderman in Norwich from 1781 to 1831, served as sheriff for 1785 and mayor for 1788. He was elected at the 1802 general election as a Member of Parliament (MP) for Minehead in Somerset.\nHe held the seat until the 1806 general election, when he was returned as an MP for Norwich.\nHe was re-elected for Norwich in 1807 and held the seat until his defeat at the 1812 general election.He was President of the Norwich Union Life Assurance Society from 1815 to his death in 1833. He had married Elizabeth, the daughter of Robert Staniforth of Manchester and heiress of William Staniforth (d.1786). They had 3 sons and 3 daughters.John was also a noted brewery owner, purchasing Charles Greeves' brewery in 1793. This eventually became Steward & Patteson. His son John Staniforth Patteson was mayor of Norwich. Another of John’s sons was Robert Dossie Patteson, a soldier in the Peninsular War. Robert was wounded and fell at Fort Erie in 1814.", "link_mentions": [{"page": "John Soane", "response": ["In the autumn he met the Bishop of Derry, Frederick Hervey, 4th Earl of Bristol, who had built several grand properties for himself. The Earl presented copies of I quattro libri dell'architettura and De architectura to Soane.Darley, 1999, p. 28 In December the Earl introduced Soane to Thomas Pitt, 1st Baron Camelford, an acquaintance which would lead eventually to architectural commissions.Darley, 1999 p. 29 The Earl persuaded Soane to accompany him to Naples, setting off from Rome on 22 December 1778. On the way they visited Capua and the Palace of Caserta,Darley, 1999, p. 30 arriving in Naples on 29 December. It was there that Soane met two future clients, John Patteson and Richard Bosanquet.Darley, 1999, p. 33 From Naples Soane made several excursions including to Pozzuoli, Cumae and Pompeii, where he met yet another future client, Philip Yorke.Darley, 1999, pp. 33–36 Soane also attended a performance at Teatro di San Carlo and climbed Mount Vesuvius.Darley, 1999, p. 35 Visiting Paestum, Soane was deeply impressed by the Greek temples.Darley, 1999 p. 38 Next he visited the Certosa di Padula,Darley, 1999 P.39 then went on to Eboli and Salerno and its cathedral. Later they visited Benevento and Herculaneum.Darley, 1999, p. 40 The Earl and Soane left for Rome on 12 March 1779, travelling via Capua, Gaeta, the Pontine Marshes, Velletri, the Alban Hills and Lake Albano, and Castel Gandolfo. Back in Rome they visited the Palazzo Barberini and witnessed the celebrations of Holy Week. Shortly after, the Earl and his family departed for home, followed a few weeks later by Thomas Hardwick.Darley, 1999, pp. 40–41", "It was then that Soane met Maria Hadfield (they became lifelong friends) and Thomas Banks. Soane was now fairly fluent in the Italian language, a sign of his growing confidence.Darley, 1999, p. 41 A party, including Thomas Bowdler, Rowland Burdon, John Patteson, John Stuart and Henry Grewold Lewis, decided to visit Sicily and paid for Soane to accompany them as a draughtsman.Darley, 1999, p. 43 The party headed for Naples on 11 April, where on 21 April they caught a Swedish ship to Palermo. Soane visited the Villa Palagonia, which made a deep impact on him.Darley, 1999, pp. 44–45 Influenced by the account of the Villa in his copy of Patrick Brydone's Tour through Sicily and Malta, Soane savoured the \"Prince of Palagonia's Monsters ... nothing more than the most extravagant caricatures in stone\", but more significantly seems to have been inspired by the Hall of Mirrors to introduce similar effects when he came to design the interiors of his own house in Lincoln's Inn Fields.Edward Chaney, The Evolution of the Grand Tour (London, 2000), pp. 32–36 Leaving Palermo from where the party split, Stuart and Bowdler going off together. The rest headed for Segesta, Trapani, Selinunte and Agrigento, exposing Soane to Ancient Greek architecture.Darley, 1999, p. 45 From Agrigento the party headed for Licata, where they sailed for Malta and Valletta returning on 2 June, to Syracuse, Sicily. Moving on to Catania and Palazzo Biscari then Mount Etna, Taormina, Messina and the Lepari Islands.Darley, 1999, pp. 47–48 They were back in Naples by 2 July where Soane purchased books and prints, visiting Sorrento before returning to Rome.Darley, 1999, p. 48 Shortly after, John Patterson returned to England via Vienna, from where he sent Soane the first six volumes of The Life and Opinions of Tristram Shandy, Gentleman, delivered by Antonio Salieri.Darley, 1999, p. 49"]}, {"page": "Norwich (UK Parliament constituency)", "response": ["|rowspan=\"2\"| John Patteson"]}, {"page": "Minehead (UK Parliament constituency)", "response": ["| John Patteson"]}, {"page": "John Patteson", "response": ["John Patteson may refer to:", "* John Patteson (bishop) (1827–1871), Anglican bishop and martyr", "* John Patteson (1755–1833), English Tory politician, Member of Parliament (MP) for Minehead 1802–1806, and for Norwich 1806–1812", "* John Patteson (judge) (1790–1861), English judge"]}, {"page": "John Patteson (1755-1833)", "response": ["#REDIRECT John Patteson (1755–1833) "]}, {"page": "Patteson", "response": ["*John Patteson (1755–1833) (1755–1833), English Tory politician", "*John Patteson (bishop) (1827–1871), Anglican bishop and martyr"]}, {"page": "List of mayors of Norwich", "response": ["|1788 || John Patteson||MP for Norwich, 1806"]}, {"page": "List of MPs elected in the 1806 United Kingdom general election", "response": ["| John Patteson"]}, {"page": "List of MPs elected in the 1802 United Kingdom general election", "response": ["| John Patteson"]}, {"page": "List of MPs elected in the 1807 United Kingdom general election", "response": ["| John Patteson"]}, {"page": "Steward & Patteson", "response": ["The brewery was founded in 1793 when Charles Greeves sold his brewery to John Patteson, the son of Ironmonger Henry Sparke Patteson. John's mother was Martha Fromanteel, the daughter of the Mayor of Norwich and an attorney.", "When John Patteson was nine years of age, his father Henry died, and John was sent to live with his uncle John Patteson (1727–1774). He was educated at Greenwich and later Leipzig.", "John Patteson died in 1833, a year after the death of his son John Staniforth Patteson in 1832.", "By 1901, John Patteson's great-grandson Henry Tyrwhitt Staniforth Patteson was its director."]}, {"page": "John Staniforth Patteson", "response": ["John Staniforth Patteson was an English Tory politician and brewery owner, who served as the mayor of Norwich in 1823. His father John Patteson also held the position of mayor."]}]}}