{"wiki_id": "http://www.wikidata.org/entity/Q6258515", "itemLabel": "John Sotheby", "itemDescription": "British auctioneer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Sotheby", "wikipedia_page": {"main": "John Sotheby (1740–1807) was an English auctioneer, who is the eponym of the famous auction house Sotheby's.\n\n", "link_mentions": [{"page": "List of companies named after people", "response": ["* Sotheby's – John Sotheby"]}, {"page": "Sotheby's", "response": ["Sotheby's was established on 11 March 1744 in London by Samuel Baker, a bookseller. In 1767 the firm became Baker & Leigh, after George Leigh became a partner, and was renamed to Leigh and Sotheby in 1778 after Baker's death when Leigh's nephew, John Sotheby, inherited Leigh's share. Other former names include: Leigh, Sotheby and Wilkinson;  Sotheby, Wilkinson and Hodge (1864–1924); Sotheby and Company (1924–83); Mssrs Sotheby; Sotheby & Wilkinson; Sotheby Mak van Waay; and Sotheby's & Co.", "After Baker's death in 1778, the business was left to Leigh and his nephew John Sotheby, where it became a prominent book auction house and was renamed Leigh and Sotheby."]}, {"page": "List of eponyms (L–Z)", "response": ["* John Sotheby, British businessman – Sotheby's."]}, {"page": "Sotheby", "response": ["* John Sotheby (1740–1807), English auctioneer and founder of Sotheby's", "* Sotheby's, art and auction corporation named for John Sotheby"]}, {"page": "Thomas Baskerfield", "response": ["Following his death, his collection of maps, books and other valuable documents was put up for auction by John Sotheby in 1817."]}, {"page": "Samuel Sotheby", "response": ["Samuel Sotheby's uncle, John Sotheby (1740–1807), was partner and nephew of Samuel Baker, who founded at York Street, Covent Garden, in 1744 the first English sale-exclusively for books, manuscripts, and prints. In 1774 Baker took George Leigh into partnership, and from 1775 to 1777 the firm was styled S. Baker & G. Leigh. After 1778, when Baker died, Leigh carried on the business alone, but from 1780 to 1800 John Sotheby (Baker's nephew) was associated with him, and the firm was known as Leigh & Sotheby.", "The firm became Leigh, Sotheby, & Son in 1800, when John Sotheby's nephew Samuel joined it, and so continued till 1803. After 1803, and until the death of Leigh in 1815, the firm carried on their business at a new address, 145 Strand. John Sotheby died in 1807, and on Leigh's death, eight years later, Samuel continued the concern by himself, moving to 3 Waterloo Street, Strand, about 1817. Soon afterwards he took his son Samuel Leigh Sotheby into partnership, and in 1826 Messrs. Sotheby & Son printed a Catalogue of the Collections sold by Messrs. Baker, Leigh, & Sotheby from 1744 to 1826."]}, {"page": "Egerton Leigh (priest)", "response": ["Dr Leigh married three times (1. Anne Yate; 2. Elizabeth Drinkwater; 3. Cassandra Phelips) and died in 1760 having had nineteen children, including, by the latter, George Leigh (bookseller and partner of John Sotheby);www.thepeerage.com Sir Egerton Leigh, 1st Bt (Attorney-General of South Carolina)www.british-history.ac.ukwww.cracroftspeerage.co.uk was a nephew and the suffragette Lydia Becker was a great-great-great niece.Leighs of West Hall: www.dodmore.co.uk"]}, {"page": "Sotheby, John", "response": ["#redirectJohn Sotheby"]}]}}