{"wiki_id": "http://www.wikidata.org/entity/Q6257620", "itemLabel": "John Sheridan", "itemDescription": "British Royal Navy officer (1778-1862)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Sheridan_(Royal_Navy_officer)", "wikipedia_page": {"main": "Vice-Admiral John Sheridan (c.1778 – 15 May 1862) was an officer of the Royal Navy who saw service in most of the major conflicts of the early nineteenth century, including the French Revolutionary and Napoleonic Wars, the Anglo-Russian War and the War of 1812.\nSheridan had risen to lieutenant by the end of the French Revolutionary Wars, and with the resumption of hostilities in 1803 was serving in the English Channel. Here he acquitted himself well in several actions, after which he moved to the Baltic and was active in several engagements against the Russians during the Anglo-Russian War. Promoted to commander as a result, he took the bomb vessel HMS Terror to North America and was present at the assault on Fort McHenry during the Battle of Baltimore, actions which inspired the writing of the poem that became the words to \"The Star-Spangled Banner\". Promoted to post-captain towards the end of the Napoleonic Wars he retired ashore, and died in 1862 with the rank of vice-admiral.", "link_mentions": [{"page": "John Sheridan", "response": ["John Sheridan may refer to:", "*John Sheridan (footballer) (born 1964), Irish footballer", "*John Sheridan (ice hockey) (born 1954), American ice hockey player ", "*John Sheridan (rugby league) (1933–2012), English rugby league footballer and coach", "*John Sheridan (jazz) (born 1946), American jazz pianist", "*John Sheridan (New Jersey government official) (1942–2014), New Jersey government official", "*John Sheridan (New Brunswick politician) (1856–1932), Canadian politician in the Legislative Assembly of New Brunswick", "*John Sheridan (Royal Navy officer) (c. 1778–1862), vice-admiral of the Royal Navy", "*John Sheridan (editor) (1805–1858), editor of the London Morning Advertiser, migrated to South Australia 1849", "*John Sheridan (Babylon 5), a character in the US TV science fiction series Babylon 5"]}, {"page": "Battle of Baltimore", "response": ["* : Capt. John Sheridan"]}, {"page": "HMS Terror (1813)", "response": ["Terror saw service in the War of 1812 against the United States, during which the ships of the North America and West Indies Station of the Royal Navy blockaded the Atlantic ports of the United States and launched amphibious raids from its base in Bermuda, leading up to the 1814 Chesapeake campaign, a punitive expedition that included the Raid on Alexandria, the Battle of Bladensburg, and the Burning of Washington. Under the command of John Sheridan, she took part in the bombardment of Stonington, Connecticut, on 9–12 August 1814. She also fought in the Battle of Baltimore in September 1814 and participated in the bombardment of Fort McHenry; the latter attack inspired Francis Scott Key to write the poem that eventually became known as \"The Star-Spangled Banner\". In January 1815, still under Sheridan's command, Terror was involved in the Battle of Fort Peter and the attack on St. Marys, Georgia."]}, {"page": "HMS Levant (1813)", "response": ["Captain John Sheridan commanded Levant from June 1815 until she was laid up in Chatham in November that year."]}, {"page": "List of Royal Navy vice admirals", "response": ["| John Sheridan"]}]}}