{"wiki_id": "http://www.wikidata.org/entity/Q6256851", "itemLabel": "John Scarlett", "itemDescription": "Canadian merchant", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Scarlett_(Toronto)", "wikipedia_page": {"main": "John Scarlett (1777–1865) was a merchant-miller who played a significant role in the development of the part of the historic York Township that later became the Junction neighbourhood of Toronto, Ontario.", "link_mentions": [{"page": "Humber River (Ontario)", "response": ["Upon his arrival in York, Simcoe was keenly aware of the need for a lumber mill and grist mill in the area.  He had constructed a sawmill on the west bank of the river near present-day Bloor Street in 1793, which was operated by John Wilson.  In 1797 Simcoe managed to get a grist mill established on the Humber River.  It was owned and operated by John Lawrence. Over the years, numerous mills have been operated along the river by such men as William Cooper, W. P. Howland, Thomas Fisher, John Scarlett, William Gamble and Joseph Rowntree. The last grist mill on the Humber, Hayhoe Mills in Woodbridge, closed in 2007."]}, {"page": "The Junction", "response": ["As with most Toronto neighbourhoods outside of the central downtown core, the area was primarily rural until the 1870s.  John Scarlett was the first land owner and employer in the area and built his home \"Runnymede\" in 1838, near where Dundas Street West and St. John's Road meet today.  By 1817 he had acquired most of property that is now the Junction and much more to the north and west to the Humber River.  From 1857 to 1876 the Carlton Race Course dominated the southeast of the neighbourhood. The race track was owned by the Keele family (William Conway Keele and his son Charles Keele).  The track was the site of the first Queen's Plate. Following the arrival of the railways in the 1880s, the old racetrack and surrounding area was developed by Daniel Webster Clendenan, who would be elected the first reeve of the village of West Toronto Junction, and first mayor of the town of Junction in 1889. The approximate locations of the two main straightaways of the track are now High Park Avenue and Pacific Avenue (between Glenlake Road and Annette Street)."]}, {"page": "Runnymede Collegiate Institute", "response": ["The school was built on land, which had belonged to John Scarlett. His is estate was called “Runnymede” after the field of Runnymede, where King John of England signed the Magna Carta.  The school's colours, red and white, derive partly from Scarlett's name, and also from the fact that the school opened in the year of Canada's Diamond Jubilee.  Owing to their red school jackets, Runnymede students came to be known as Redmen in the 1930s.  Over time an Indian head logo was adopted to go with the name. The Redmen name and logo were retired in 1994."]}, {"page": "Scarlett Heights Entrepreneurial Academy", "response": ["Scarlett refers to John Scarlett, an early land owner and entrepreneur in the area. Former Toronto Mayor Rob Ford was a graduate of the school. The school was originally constructed in 1962 under its working name, Hilltop Collegiate Institute at the cost of $1,311,800.00 ($11,100,260.48 in 2019 dollars) when the Etobicoke Board of Education approved the Hilltop application on December 19, 1961.http://www.metropolicyarchive.ca/wp-content/uploads/2017/04/HSS-1146450-1962D_MSBT-Minutes-1962.pdf The original design consisted of 9 standard classrooms, 1 art, 1 music, 3 science labs., a library, 1 home economics, 1 shop, 3 typing rooms, double gymnasium, cafeteria, secretarial, merchandising, accountancy, and business machines classrooms. Scarlett Heights Collegiate opened in September 1963."]}, {"page": "St. James Cemetery (Toronto)", "response": ["* John Scarlett, developer"]}, {"page": "Runnymede Road", "response": ["John Scarlett, a mill and distillery owner along the Humber River, laid out what is now Runnymede Road in 1817. There is also a subway station on the Bloor–Danforth line by this street."]}, {"page": "Runnymede Park", "response": ["Runnymede Park was initially a block of land laid out on a plan created by Hannah M. Clarke in 1883. According to a City Solicitor's report, submitted to City of Toronto Council in 1923, the land was always treated by the Town of Toronto Junction as a public park and, from 1893 to 1909, was assessed by the Town of Toronto Junction as part of park property. It was subsequently recommended in 1923 that the City of Toronto exercise its rights as official title holder. In 1961, Toronto City Council authorized the construction of the George Bell Arena at Runnymede Park and its designation as a community centre under the Community Centres Act.  Like many other landmarks in the neighbourhood, the park takes its name from the estate of John Scarlett, an early land owner in the area. "]}, {"page": "Scarlett (surname)", "response": ["* John Scarlett (Toronto) (1777–1865), Canadian merchant", "* John Scarlett (footballer) (1947–2019), Australian rules footballer"]}, {"page": "Runnymede, Toronto", "response": ["The name Runnymede originates with the estate of John Scarlett, an early land owner in the area. Scarlett owned land in the area as early as 1817. He gave the name Runnymede to his house on Dundas Street. In 1856, Scarlett's holdings bounded by Jane, St. Clair, Clendenan and Annette were purchased by Marcus Rossin, who sub-divided the lands as the \"Runnymede Estate\". The sub-division was vacant until 1878. "]}, {"page": "John Scarlett (disambiguation)", "response": ["John Scarlett, (born 1948) was Director General of the British Secret Intelligence Service.", "John Scarlett or Scarlet may also refer to:", "*John Scarlett (footballer), (born 1947) former Australian rules footballer", "*John Scarlett (Toronto), (1777–1865) Canadian merchant-miller, and pioneer"]}, {"page": "List of north–south roads in Toronto", "response": ["Keele Street is named for lawyer William Keele. William owned land across the road from John Scarlett at Dundas and Keele Streets, gradually expanding his acreage in the mid-19th century. William opened the Carleton Race Course in 1857, which held the first Queen's Plate in 1860.", "Scarlett Road is named for John Scarlett, who moved to Upper Canada in 1808 and owned several square kilometres of property northwest of Bloor and Keele Streets. \"Scarlett's Road\" was opened along the route of the Toronto Carrying-Place Trail north of his property. The road begins at Dundas Street West immediately south of the CPR crosstown rail line. It connects with the western terminus of St. Clair Avenue, then progresses north alongside the Humber River to north of Lawrence Avenue West, where it curves to the west and becomes Dixon Road.", "Runnymede Road is named for the house of  John Scarlett, built at the corner of Dundas and Keele in 1838. Runnymede is a field in England, southwest of London, where the Magna Carta was signed in 1215."]}]}}