{"wiki_id": "http://www.wikidata.org/entity/Q6259177", "itemLabel": "John Stewart MacArthur", "itemDescription": "Scottish chemist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Stewart_MacArthur", "wikipedia_page": {"main": "John Stewart MacArthur was a chemist from Glasgow.  Born on 9 December 1856, he is credited with the development of the MacArthur-Forrest cyanidation process in 1887, used to extract gold in South Africa. His patent for the process was voided. With the long-lasting legal issues about the cyanidation patents, MacArthur turned to other businesses. First, he investigated vanadium extraction from ore containing significant amounts of radium. From this enterprise he turned to the production of radium. He founded the Radium Works in Halton in 1911. In 1915 he moved it to Balloch, West Dunbartonshire and renamed it as Loch Lomond Radium Works. MacArthur died on 16 March 1920, aged 63.", "link_mentions": [{"page": "Timeline of historic inventions", "response": ["* 1887: John Stewart MacArthur, working in collaboration with brothers Dr. Robert and Dr. William Forrest develops the process of gold cyanidation."]}, {"page": "Gold cyanidation", "response": ["In 1887, John Stewart MacArthur, working in collaboration with brothers Robert and William Forrest for the Tennant Company in Glasgow, Scotland, developed the MacArthur-Forrest process for the extraction of gold from gold ores. Several patents were issued in the same year.  By suspending the crushed ore in a cyanide solution, a separation of up to 96 percent pure gold was achieved."]}, {"page": "John MacArthur", "response": ["*John Stewart MacArthur (died 1920), Scottish inventor of the MacArthur-Forrest process for gold cyanidation (1887)"]}, {"page": "Gold extraction", "response": ["In 1887, John Stewart MacArthur, working in collaboration with brothers Dr Robert and Dr William Forrest for the Tennant Company in Glasgow, Scotland, developed the MacArthur-Forrest Process for the extraction of gold ores. By suspending the crushed ore in a cyanide solution, a separation of up to 96 percent pure gold was achieved."]}, {"page": "John Seward MacArthur", "response": ["#REDIRECT John Stewart MacArthur"]}, {"page": "MacArthur (surname)", "response": ["* John Stewart MacArthur (died 1920), chemist from Glasgow"]}, {"page": "Loch Lomond Radium Works", "response": ["Loch Lomond Radium Works was a company founded by John Stewart MacArthur in 1911 as the Radium Works in Halton, Cheshire, England. The company moved to Balloch, West Dunbartonshire, Scotland in 1915. The company produced radium for use in medicine and for radioluminescent paint until it was closed down in 1927."]}]}}