{"wiki_id": "http://www.wikidata.org/entity/Q6252635", "itemLabel": "John Peter Gandy", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Peter_Gandy", "wikipedia_page": {"main": "John Peter Gandy  (1787 – 2 March 1850 in Hanover Square, London), later John Peter Deering, was a British architect. He served as a Member of Parliament (MP) from 1847 to 1848.", "link_mentions": [{"page": "William Wilkins (architect)", "response": ["In 1822–26, he collaborated with John Peter Gandy on the Clubhouse for the new United University Club, in Pall Mall. He was made an associate of the Royal Society in 1824 and given full membership in 1826."]}, {"page": "Rhamnous", "response": ["In modern times, John Peter Gandy's\"The Unedited Antiquities of Attica\", London 1817, and Antiquities of Ionia, Part V (Suppl. to Part III), W. R. Lethaby, ed., London 1915 admirable work to document the site was the first in 1813. As a pioneer in a discipline then in its infancy, Gandy recorded in his notes and drawings much information which would otherwise be lost, since the temples in the sanctuary were much better preserved then."]}, {"page": "Exeter Hall", "response": ["It was erected between 1829 and 1831 on the site of Exeter Exchange, to designs by John Peter Gandy,Howard Colvin, A Biographical Dictionary of British Architects, 3rd ed. (Yale University Press, 1995), s.v. \"Gandy, afterwards Deering, John Peter\". Exeter Hall was one of his last architectural commissions before inheriting a fortune, adopting the additional surname Deering and retiring to the country as a gentleman. the brother of the visionary architect  Joseph Michael Gandy.  The site had formerly been occupied by part of Exeter House (formerly Burghley House and Cecil House), the London residence of the Earls of Exeter, almost opposite the Savoy Hotel. The official opening date was 29 March 1831."]}, {"page": "1787 in architecture", "response": ["**John Peter Gandy, English architect (died 1850)"]}, {"page": "Joseph Gandy", "response": ["Joseph Gandy was the son of Thomas Gandy (1744–1814) and Sophia née Adams (1743–1818). His father was employed at White's Club, London. Joseph was the brother of the architects Michael Gandy (1778–1862) and John Peter Gandy, later Deering (1787–1850)."]}, {"page": "Cecil House", "response": ["The house became the residence of Burghley's elder son, Thomas Cecil, created Earl of Exeter in 1605; thus, in Wenceslas Hollar's bird's-eye view of London (ca 1658), it is labelled \"Exeter House\".  The structure formed a notch in the north side of The Strand. It was converted in 1676 into Exeter Exchange and demolished in 1829. Exeter Hall was erected between 1829 and 1831 on the site to designs by John Peter Gandy.Howard Colvin, A Biographical Dictionary of British Architects, 3rd ed. (Yale University Press, 1995), s.v. \"Gandy, afterwards Deering, John Peter\". Exeter Hall was one of his last architectural commissions before inheriting a fortune, adopting the additional surname Deering and retiring to the country as a gentleman."]}, {"page": "J. P. Gandy", "response": ["#REDIRECT John Peter Gandy"]}, {"page": "John Peter Deering", "response": ["#REDIRECT John Peter Gandy"]}, {"page": "Gandy (surname)", "response": ["* John Peter Gandy aka John Deering (1787–1850), British architect"]}, {"page": "John Gandy", "response": ["* John Peter Gandy (1787–1850), British architect"]}, {"page": "Francis Octavius Bedford", "response": ["Little is known about Bedford's early years. In 1812–13 he was one of two draughtsmen (along with John Peter Gandy) who accompanied William Gell on an expedition sent to Greece and Asia Minor to record Classical antiquities on behalf of the Society of Dilettanti.  He is also known to have corresponded with Charles Robert Cockerell on the subject of Greek architecture."]}, {"page": "Michael Gandy (architect)", "response": ["Gandy was the son of Thomas Gandy (c1744–1814) and Sophia née Adams (c1743–1818) and younger brother of Joseph Michael Gandy  and of John Peter Gandy-Deering. He was born in 1778. He became a pupil of James Wyatt, whose office he left on receiving an appointment in the Indian naval service. He was thus employed for some years, serving in India and China. In 1812 he exhibited The Burning of Onrust and Kupers Island, Batavia, in 1800, drawn on the spot at the Royal Academy."]}, {"page": "The Destruction of Pompeii and Herculaneum", "response": ["Martin was (unusually) commissioned to paint the subject by Richard Greville, 1st Duke of Buckingham and Chandos, who paid 800 guineas.  The painting is a monumental canvas  by  which depicts a view from Stabiae across the Bay of Naples towards the doomed cities of Pompeii and Herculaneum during the eruption of Vesuvius in AD 79.  The background is dominated by the apocalyptic scene of the erupting volcano, which casts a red light over the rest of the painting.  Some buildings excavated at Pompeii, including the Temple of Jupiter and the amphitheatre, are visible in the middle distance.  In the foreground are tiny figures of the fleeing citizens, including the dying Pliny the Elder.  Martin relied on the recently published Pompeiana (1819) by William Gell and John Peter Gandy for background information on the Roman town, and on Edwin Atherstone's 1821 epic poem The Last Days of Herculaneum, published with Pliny the Younger's letters to Tacitus on the eruption."]}, {"page": "List of Royal Academicians", "response": ["| John Peter Gandy   ||align=\"center\" |  1838 || "]}, {"page": "St Mark's, Mayfair", "response": ["The building was constructed in the Greek revival style to the designs of John Peter Gandy. Gandy was a highly regarded architect of the Greek Revival style, and produced most of his work in neo-classical designs, with St Mark's being one of the finest examples."]}, {"page": "Stamford and Rutland Hospital", "response": ["The hospital was built on a site previously occupied by Greyfriars, Stamford and donated by the Marquess of Exeter. It was funded by a bequest from the will of surgeon Henry Fryer, designed by John Peter Gandy and opened in 1828."]}]}}