{"wiki_id": "http://www.wikidata.org/entity/Q6251365", "itemLabel": "John Oscroft", "itemDescription": "English cricketer (1807-1857)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Oscroft_(cricketer,_born_1807)", "wikipedia_page": {"main": "John Oscroft (21 July 1807 – 28 September 1857) was an English cricketer. Oscroft's batting and bowling styles are unknown. He was born at Arnold, Nottinghamshire.\nOscroft made his first-class debut for Nottingham Cricket Club against Cambridge Town Club in 1834 at Parker's Piece. He made two further first-class appearances in 1834, making a second appearance against Cambridge Town Club at the Forest New Ground and an appearance against Sheffield Cricket Club at Hyde Park Ground, Sheffield. His next first-class appearance came in 1842 for the Gentlemen of Nottinghamshire against the Players of Nottinghamshire at Trent Bridge, with him also making his first-class debut for Nottinghamshire against England in that same season. He made four further first-class appearances for Nottinghamshire, the last of which came against Sussex in 1848. In his nine first-class matches, Oscroft scored 137 runs at an average of 10.53, with a high score of 28. He also took two wickets with the ball.He died at Nottingham, Nottinghamshire on 28 September 1857.", "link_mentions": [{"page": "List of Nottinghamshire County Cricket Club players", "response": ["* John Oscroft (1842–1848) : J. Oscroft", "* John Oscroft (1867–1879) : J. T. Oscroft"]}, {"page": "List of English cricketers (1841–1850)", "response": ["|John Oscroft"]}, {"page": "John Oscroft", "response": ["John Oscroft may refer to:", "* John Oscroft (cricketer, born 1807) (1807–1857), English cricketer", "* John Oscroft (cricketer, born 1846) (1846–1885), English cricketer"]}, {"page": "List of Nottingham Cricket Club players", "response": ["|John Oscroft", "|John Oscroft Snr., Nottinghamshire County Cricket Club. Retrieved 2020-06-17."]}, {"page": "Oscroft", "response": ["* John Oscroft (cricketer, born 1807) (1807–1857), English cricketer", "* John Oscroft (cricketer, born 1846) (1846–1885), English cricketer"]}]}}