{"wiki_id": "http://www.wikidata.org/entity/Q6254562", "itemLabel": "John Reilly", "itemDescription": "Scottish footballer (born 1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Reilly_(footballer,_born_1962)", "wikipedia_page": {"main": "John Reilly (born 21 March 1962, in Dundee) is a Scottish former professional footballer who played as a striker. Reilly began his career with Dundee United, signing as a schoolboy from Strathtay Boys Club in 1979. He played for the Scotland Under 17 and Under 18 professional youth sides before making his first-team debut in August 1980. He was a member of the squad that won a Premier League Winners medal in season 1982–1983 before going onto score the club's first ever goal in the European Cup the following season. Signing for Motherwell in 1985, Reilly suffered an achilles tendon injury in his first game for the club and despite seeing several specialists over the next 18 months was forced into early retirement. After revolutionary surgery five years later however, he was able to continue playing and went on to play a handful of games for a number of Scottish lower league clubs, including Dunfermline Athletic and East Fife, while taking on a player/manager role at Cowdenbeath F.C.\nAfter retiring for the second time in the mid-1990s, Reilly remained in the game working as a journalist covering lower-division football for a national newspaper. Reilly was inducted into Dundee United's Hall of Fame in February 2013.", "link_mentions": [{"page": "John Reilly", "response": ["John Reilly may refer to:", "*John Reilly (baseball) (1858–1937), American baseball player", "*John Reilly (footballer, born 1962), Scottish former professional footballer", "*John Reilly (Australian footballer) (born 1942), former Australian rules footballer", "*John Reilly (Pennsylvania politician) (1836–1904), U.S. Representative from Pennsylvania", "*John Reilly (Michigan politician) (born 1958), member of the Michigan House of Representatives", "*John Reilly, North Carolina State Auditor, 1873–1877", "*John Reilly (judge) (born 1946), Canadian politician, activist and retired judge", "*John Reilly (singer) (1926–1969), Irish traveller and source singer", "*John Reilly (actor, born 1934) (1934–2021), American actor", "*John Reilly (lawyer), American lawyer, author and businessman"]}]}}