{"wiki_id": "http://www.wikidata.org/entity/Q6255576", "itemLabel": "John Roome", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Roome", "wikipedia_page": {"main": "John Roome (born 26 August 1968, a.k.a. Witchman) is a hip hop/breakbeat artist who has worked with The Orb and The Jungle Brothers.\nHaving completed the score on five movies (Messengers, Dead End Road, Song of Songs, Want and Final Curtain) he has provided material for John Leguizamo's Undefeated and Into the Sun, as well as John Carpenter's Masters of Horror.\nRoome has contributed music to various other projects including popular television shows like Cold Case, CSI: Miami, CSI: NY, Nip Tuck and Las Vegas. Most recently completed is the score for Sega's Full Auto video game for the Xbox 360 (PS3 to follow) and music for the Miami Vice film trailer.\nIt has been confirmed that John will be the composer for two up and coming feature films, Death Walks the Streets and Lost Not Found.", "link_mentions": [{"page": "Cydonia (album)", "response": ["Cydonia is the fifth studio album by English electronic music duo the Orb. It was released on 27 February 2001 in the United Kingdom by Island Records and in the United States by MCA Records. Members Alex Paterson and Thomas Fehlmann, along with usual collaborators Andy Hughes, Nick Burton, and Simon Phillips, wrote and produced the album for a planned 1999 release. Featured on the album are Robert Fripp, John Roome, and Fil Le Gonidec, who had previously only worked with the Orb in live performances."]}, {"page": "Terminal Power Company", "response": ["Formed in 1989 in Birmingham, England, by Paul Aspel and John Roome, designed specifically to be a \"cyberpunk band\", the band cited many diverse visual influences on their music. Amongst these were William Gibson, John Shirley - Authors, Blade Runner, Aliens, Spaghetti Westerns and Film Noir. Essentially the band was formed to create virtual sound tracks for these types of films and books. Their first demo tapes were received well and in early 1990 TPC signed to Situation Two and soon released their first single \"Wired\" (SIT 80)."]}, {"page": "Roome", "response": ["*John Roome (born 1972), British hiphop artist"]}, {"page": "Witchman", "response": ["#REDIRECT John Roome"]}, {"page": "The Orb", "response": ["Paterson and Fehlmann, along with usual collaborators Hughes, Nick Burton, and Phillips, wrote and produced Cydonia for a planned 1999 release. Featured on the album were appearances from Robert Fripp, John Roome (Witchman), and Fil Le Gonidec, one of the Orb's live performers. Singers Nina Walsh and Aki Omori appeared on two tracks each, providing vocals and co-writing lyrics with Paterson. Paterson felt that this new direction of songwriting for the Orb was more similar to the experimental work of Orbus Terrarum than to the techno-pop of Orblivion. Island Records was in a period of restructuring due to its recent purchase by Universal Music Group, and Cydonia was not released until 2001. Upon release, critics noted that Cydonia merged pop, trance, and ambient-dub music, which they felt to be a conglomeration of bland vocals and uninventive ambience that lacked the appeal of the Orb's earlier work. NME harshly described it as \"a stillborn relic, flawed throughout by chronically stunted ambitions\" and describing its only appropriate audience to be \"old ravers\" seeking nostalgia. The Orb were generally regarded by the British press as past their prime and an \"ambient dinosaur\" out of place in the current dance music environment. After the release of Cydonia, Hughes left the group for undisclosed reasons, becoming \"another acrimonious departure from the Orb\" according to The Guardian.", "The Orb, now composed of Paterson, Phillips, and Fehlmann, with guest John Roome, accepted an invitation to join the Area:One concert tour with Moby, Paul Oakenfold, New Order and other alternative and electronic artists. Though the Orb were paired with more mainstream artists during the tour such as Incubus, Paterson and Fehlmann made their next releases a series of several low-key EPs for German label Kompakt in 2002. The Orb found critical success on Kompakt; but Badorb.com collapsed soon after releasing the compilation Bless You. Badorb.com had released fourteen records over the course of fourteen months from artists including Guy Pratt (Conduit), Ayumi Hamasaki, and Takayuki Shiraishi, as well as the Orb's three-track Daleth of Elphame EP. Though Badorb.com was an internet-based record label, they sold only vinyl releases (with one exception, the Orb EP), which Paterson later remarked was a poor idea because \"not many people... have record players\"."]}, {"page": "Run Silent, Run Deep (album)", "response": ["*John Roome"]}, {"page": "Red Skin Eclipse", "response": ["*John Roome"]}, {"page": "Cyclops (album)", "response": ["*John Roome"]}]}}