{"wiki_id": "http://www.wikidata.org/entity/Q6258334", "itemLabel": "John Smith", "itemDescription": "English footballer (1939-1988)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Smith_(footballer,_born_1939)", "wikipedia_page": {"main": "John Smith (4 January 1939 – February 1988) was an English footballer.\nBorn in Shoreditch, London, Smith was a product of the Academy of West Ham United. He played for the east London club between 1956 and 1960, playing right half and inside right, and was a key figure in the team that won the Second Division in 1957-58. He made 136 appearances for the club, scoring 23 goals.Smith transferred to Tottenham Hotspur, where he was one of 17 players to represent the club in their Double winning season of 1960–61. Smith played in the Swindon Town side which beat Arsenal in the 1969 Football League Cup Final.At the time of his death he was the steward of McVitie's social club in Park Royal, north west London.", "link_mentions": [{"page": "Dundalk F.C.", "response": ["Dundalk had to sell or release a number of players to survive after Tuohy left, and they slid down the table—with a young, inexperienced team finishing second from bottom in 1972–73. To recover the situation, a new board took over the running of the club, and hired English player-manager John Smith from Walsall. After renegotiating the club's debts, they were able to provide Smith with funds to sign several players. There was a fast start to the new season, and a Leinster Senior Cup Final win over Bohemians, but they subsequently fell away and Smith quit two matches into the 1974–75 league schedule for a job outside football. Following his departure, the club appointed Jim McLaughlin as player-manager in November 1974.", "*1973–1974: John Smith"]}, {"page": "Bernie Wright", "response": ["Wright returned to Walsall in 1973 for a fee of £10,000, and scored 38 goals in 152 league games during his four years at Fellows Park. After struggling in the lower half of the table in 1972–73 and 1973–74 under John Smith and then Ronnie Allen, the \"Saddlers\" came close to promotion in 1974–75 and 1975–76 under Doug Fraser's stewardship. He joined Bobby Kennedy's Bradford City in 1976, where he scored 13 goals in 66 league games. Bradford won promotion out of the Fourth Division in 1976–77, but suffered relegation in 1977–78 under John Napier. Wright and Don Hutchins were joint-top scorer in 1977–78 with ten goals."]}, {"page": "John Smith (Association Football)", "response": ["#REDIRECT John Smith (footballer, born 1939)"]}, {"page": "John Smith (association footballer)", "response": ["#REDIRECT John Smith (footballer, born 1939)"]}, {"page": "List of West Ham United F.C. players", "response": ["| John Smith"]}]}}