{"wiki_id": "http://www.wikidata.org/entity/Q6258111", "itemLabel": "John Skirrow Wright", "itemDescription": "Social reformer of the 19th century in Birmingham, England", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Skirrow_Wright", "wikipedia_page": {"main": "John Skirrow Wright (2 February 1822 – (1880-04-15)15 April 1880) was one of the distinguished pioneers and social improvers of the 19th century in Birmingham, England; and inventor of the postal order. He was involved in many aspects of Birmingham's mid-Victorian life that were intended for the benefit of its citizens, including the General Hospital, the Chamber of Commerce, the School of Art, the Children's Hospital, the early Birmingham Hospital Saturday Fund, and the Blue Coat School.", "link_mentions": [{"page": "List of people from Birmingham", "response": ["*John Skirrow Wright – Social improver"]}, {"page": "Victoria Square, Birmingham", "response": ["Other statues that no longer stand in the square include a statue of King Edward VII, which was moved to Highgate Park when Victoria Square was remodelled in 1951. Following restoration, it was re-erected, on a new plinth, outside Baskerville House in Centenary Square, in November 2010. There were also statues of Robert Peel, which is now located at the Tally Ho police training centre in Edgbaston; and of Joseph Priestley, which is now in Chamberlain Square. A statue of John Skirrow Wright, unveiled in 1883, was moved to Chamberlain Square in 1913, from there into storage in 1951, and eventually scrapped. A statue of George Dawson was later moved to Edmund Street nearby, but is now in store at Birmingham Museum and Art Gallery's Museum Collections Centre."]}, {"page": "Key Hill Cemetery", "response": ["*John Skirrow Wright (1822–1880): reformer and MP. Plot 218.E."]}, {"page": "Council House, Birmingham", "response": ["*To John Skirrow Wright, who died in the building."]}, {"page": "John Wright", "response": ["*John Skirrow Wright (1822–1880), pioneer and social improver of Birmingham, England"]}, {"page": "Science and invention in Birmingham", "response": ["1881: Birmingham businessman John Skirrow Wright invents the postal order and its use subsequently spreads across the world. Skirrow becomes one of the prominent pioneers and social improvers of the 19th century."]}, {"page": "Postal orders of the United Kingdom", "response": ["The United Kingdom was the first country in the world to issue postal orders on 1 January 1881.  They were the brainchild of the president of the Birmingham Chamber of Commerce, John Skirrow Wright which was to enable poorer people to buy goods and services by post, as they were unlikely to have bank accounts.  The rich had bank accounts and could write cheques. A delegation of the Birmingham Chamber went to the annual meeting of chambers of commerce in London and John Skirrow Wright presented the idea, complete with all the details on how it would work including all the postal order values proposed. At first London bankers were against the idea, thinking it would affect their businesses, and the idea was rejected. However, eventually, the bankers realised that the people who would use postal orders were not their customers and therefore no threat to their business. Consequently, at the Annual Meeting a year later John Skirrow Wright presented the idea again and this time it was accepted and the postal order system was started exactly as Skirrow Wright and Birmingham Chamber had proposed."]}, {"page": "Birmingham Civic Society", "response": ["The Society has played a leading role in preserving the city's statues, especially in the 1950s when many were in danger of being scrapped. Subjects that have been preserved in total or in part (the head being cast as a bust) by the action of the Society are Queen Victoria's statue, which was cast in bronze and placed upon a new plinth paid for by the Society for the Festival of Britain in 1951; the busts of Josiah Mason; George Dawson and John Skirrow Wright. More recently the Society has been involved in raising half of the £30,000 needed for the restoration of the Joseph Sturge memorial at Five Ways and initiated the process for the relocation and restoration of the King Edward VII Memorial, which is now in Centenary Square."]}, {"page": "Skirrow", "response": ["*John Skirrow Wright (1822-1880) was one of the prominent pioneers and social improvers of the 19th century who made Birmingham great. He also invented the postal order."]}, {"page": "Birmingham Hospital Saturday Fund", "response": ["On 6 January 1873 Sampson Gamgee raised the suggestion that 'everyone should work overtime for the hospitals on a particular annual Saturday afternoon, to be called \"Hospital Saturday\"'. This new scheme called the Birmingham Hospital Saturday Fund was inaugurated on 15 March 1873 with John Skirrow Wright as Chair and Sampson Gamgee as Honorary Secretary, and was the first British scheme for raising money for all voluntary hospitals in an area. By 1879 the collection had dwindled and it was decided to replace them with a fixed weekly contribution of 1d. On 29 December 1891 the fund was incorporated as a limited non-profit company and was able to hold property, and in 1892 Tyn-y-coed, a stone house on a  site near Llandudno in North Wales, opened as a convalescent home after its purchase price was donated by two Birmingham sisters, Henrietta and Sarah Stokes."]}, {"page": "Nottingham (UK Parliament constituency)", "response": ["| John Skirrow Wright"]}, {"page": "List of MPs elected in the 1880 United Kingdom general election", "response": ["| John Skirrow Wright"]}, {"page": "National Liberal Federation", "response": ["The NLF's early associations were with the city of Birmingham. Its structure – which became known as the \"Caucus\" – was modelled on that of the Birmingham Liberal Association, founded in 1865, which had been so effective in building a mass membership and an efficient electioneering body in the city under the political leadership of Joseph Chamberlain, and drawing on the strategic and organisational skills of William Harris (secretary 1868–73) and Francis Schnadhorst (secretary 1873–84). At the establishment of the NLF, Chamberlain was elected its president (1877–80), Harris its chairman (1877–82), Schnadhorst its salaried secretary (1877–93), and John Skirrow Wright, another Birmingham activist, its treasurer (1877–1880).", "*1877–1880: John Skirrow Wright"]}, {"page": "List of United Kingdom by-elections (1868–1885)", "response": ["|John Skirrow Wright"]}, {"page": "List of Birmingham City University people", "response": ["*John Skirrow Wright"]}, {"page": "Francis John Williamson", "response": ["Williamson received a number of commissions from the municipal authorities in Birmingham. These included a marble bust of the Shakespearian scholar Samuel Timmins, now in the Library of Birmingham, a statue of the dissenting theologian and natural philosopher Joseph Priestley, now in Chamberlain Square, a statue of Sir Josiah Mason, (destroyed, but a 1952 bronze cast of the bust, by William Bloye, is in the suburb of Erdington), a statue of preacher and reformer George Dawson (since destroyed), a statue of John Skirrow Wright (also destroyed; a 1956 bronze cast of the bust by Bloye is in Birmingham Council House), and the decoration on the pediment of the Birmingham Museum and Art Gallery, a work known as the Allegory of Fame Rewarding the Arts. A plaster cast of his bust of Tennyson (1893) is in the National Portrait Gallery.", "* statue of John Skirrow Wright (1883; destroyed)"]}, {"page": "Donald Finnemore", "response": ["He was the son of William and Kate Finnemore. He was a grandson of John Skirrow Wright Liberal MP for Nottingham. He was educated at King Edward's School, Birmingham and Pembroke College, Oxford (Scholar). He was awarded a First Class in Jurisprudence and Proxime accessit for the Vinerian Law Scholarship at Oxford. He served in France as British Red Cross Officer from 1916–19.http://www.ukWhosWho.com"]}, {"page": "Mary J. Newill", "response": ["Mary Jane Newill was born in Shropshire, England in 1860. She studied at the Birmingham School of Art in the 1880s and 1890s. Fellow students included Charles March Gere, Sidney Meteyard, and Henry Payne. Awarded a John Skirrow Wright scholarship in 1880, Newell continued her studies in Paris.  She returned to Birmingham and was hired to teach embroidery and design at the Birmingham School of Art in 1892, a position she occupied until 1919."]}]}}