{"wiki_id": "http://www.wikidata.org/entity/Q6252508", "itemLabel": "John Pennington Thomasson", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Pennington_Thomasson", "wikipedia_page": {"main": "John Pennington Thomasson (19 May 1841, in Bolton – 16 May 1904, in Heaton, Greater Manchester) was an English cotton spinner and Liberal Party politician. He was elected as a Member of Parliament (MP) for Bolton at the 1880 general election along with John Kynaston Cross in the double member constituency, signifying a great victory as two liberals were elected for the first time since 1852. He served for 5 years, when he lost his seat owing to the Home Rule split. He became a Liberal Unionist, although he returned to the Liberal fold eventually.", "link_mentions": [{"page": "Metropolitan Borough of Bolton", "response": ["* John Pennington Thomasson: 10 November 1902."]}, {"page": "National Liberal Club", "response": ["*John Pennington Thomasson, Liberal MP, 1880–85."]}, {"page": "Bolton (UK Parliament constituency)", "response": ["| John Pennington Thomasson"]}, {"page": "List of people from Bolton", "response": ["*John Pennington Thomasson (1841–1904) – cotton spinner, MP and benefactor"]}, {"page": "Franklin Thomasson", "response": ["Descended from a well known family of cotton spinners from Bolton, Lancashire, Franklin Thomasson was born on 16 August 1873 at Alderley Edge, Cheshire, the 3rd child of John Pennington Thomasson, who was a benefactor and MP for Bolton. He married Elizabeth, a daughter of the late Caleb Coffin of New York City on 11 July 1895. They had 3 children, John (1898), Marjorie (1901) and Barbara (1903)."]}, {"page": "Thomas Thomasson", "response": ["Thomasson married Maria Pennington, daughter of a John Pennington a cotton spinner of Hindley, in 1834. She was a sister of Frederick Pennington. They lived at High Bank, Haulgh, and had four children including John Pennington Thomasson (1841)."]}, {"page": "Margaret Bright Lucas", "response": ["Margaret married Samuel Lucas (1811–1865), a cousin, on 6 September 1839. Samuel, a fellow Quaker, was a London corn exchange merchant. The couple went to Manchester in 1845, when Samuel became involved in a cotton mill. The family moved back to London in 1850. Lucas became interested in politics during the anti-corn law protests in 1845. She aided her husband with the organisation of meetings and the raising of finances. Until her husband's death in 1865, however, her main burdens remained within the family, including the rearing of her two children, Samuel, a deaf mute, and Katharine. By 1870, both children had married, Katharine to John Pennington Thomasson (later MP for Bolton)."]}, {"page": "List of MPs elected in the 1880 United Kingdom general election", "response": ["| John Pennington Thomasson"]}, {"page": "Thomasson (surname)", "response": ["*John Pennington Thomasson (1841–1904), English cotton spinner and Liberal Party politician"]}]}}