{"wiki_id": "http://www.wikidata.org/entity/Q6258851", "itemLabel": "John Stanley Chick", "itemDescription": "British flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Stanley_Chick", "wikipedia_page": {"main": "Air Commodore John Stanley Chick,  (22 December 1897 – 21 January 1960), was a Welsh officer of the Royal Air Force, who began his aviation career as a World War I flying ace credited with 16 aerial victories.", "link_mentions": [{"page": "No. 11 Squadron RAF", "response": ["No. 11 Squadron numbered 19 flying aces in its ranks during the war. Among them were Victoria Cross winner Lionel Rees, as well as Andrew Edward McKeever, future Air Commodore John Stanley Chick, Eugene Coler, Albert Ball VC, Frederick Libby, Ronald Maudit, John Quested, Herbert Sellars, Donald Beard, Stephen Price and Hugh Hay Thomas Frederick Stephenson."]}, {"page": "Reginald Makepeace", "response": ["He scored his first victory on 29 June 1917, with Lieutenant Melville Waddington as his observer gunner, and gained his second on 6 July, before his period of probation was over, as he was not confirmed in his rank until 12 July. Makepeace triumphed six more times in the FE.2d, including a triple victory on the evening of 27 July, with his eighth win coming on 17 August 1917. His squadron was then re-equipped with the Bristol F.2 Fighter, and he and Waddington were the first to score with the new aircraft when they shot down an Albatros D.V in flames on 3 September. He would score seven more times flying the Bristol, gaining his sixteenth win on 4 January 1918. For his seventeenth and final victory on 28 January 1918 he flew as observer/gunner for pilot Second Lieutenant John Stanley Chick of No. 11 Squadron."]}, {"page": "Cambridge University Air Squadron", "response": ["* 1934–1937 Squadron Leader John Stanley Chick"]}, {"page": "List of World War I flying aces from the British Empire", "response": ["* John Stanley Chick"]}, {"page": "1926 Birthday Honours", "response": ["*Flight Lieutenant John Stanley Chick "]}]}}