{"wiki_id": "http://www.wikidata.org/entity/Q6259714", "itemLabel": "John Sutro", "itemDescription": "British film producer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Sutro", "wikipedia_page": {"main": "John Sutro (23 April 1903 – 18 June 1985) was a British film producer. He produced seven films between 1941 and 1951. He was a member of the jury at the 7th Berlin International Film Festival.", "link_mentions": [{"page": "Bryan Guinness, 2nd Baron Moyne", "response": ["At Oxford, Guinness was part of the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester, Brian Howard, Michael Parsons, 6th Earl of Rosse, John Sutro, Hugh Lygon, Harold Acton, Patrick Balfour, 3rd Baron Kinross, Mark Ogilvie-Grant, John Drury-Lowe."]}, {"page": "Harold Acton", "response": ["thumb|Railway Club at Oxford, conceived by John Sutro, dominated by Harold Acton. Left to right, back: Henry Yorke, Roy Harrod, Henry Weymouth, David Plunket Greene, Harry Stavordale, Brian Howard. Middle row: Michael Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, Patrick Balfour, Mark Ogilvie-Grant, Johnny Drury-Lowe; front: porters.", "At Oxford Acton dominated the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester, Brian Howard, Michael Parsons, 6th Earl of Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, Mark Ogilvie-Grant, John Drury-Lowe."]}, {"page": "Oxford Wits", "response": ["Others who are cited as Oxford Wits are John Betjeman, Robert Byron, Cyril Connolly, Brian Howard, Alan Pryce-Jones, John Sparrow, John Sutro, and Christopher Sykes.Noel Annan, Our Age (1990), note p. 128."]}, {"page": "Brian Howard (poet)", "response": ["thumb|left|Railway Club at Oxford, conceived by John Sutro, dominated by Harold Acton. Left to right, back: Henry Yorke, Roy Harrod, Henry Weymouth, David Plunket Greene, Harry Stavordale, Brian Howard. Middle row: Michael Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, Patrick Balfour, Mark Ogilvie-Grant, Johnny Drury-Lowe; front: porters.", "At Oxford, Howard was part of the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester, Michael Parsons, 6th Earl of Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, Mark Ogilvie-Grant, and John Drury-Lowe."]}, {"page": "The Ritz Hotel, London", "response": ["The Palm Court is the setting for the world-famous institution that is \"Tea at the Ritz\", once frequented by King Edward VII, Sir Winston Churchill, Judy Garland, Evelyn Waugh and Queen Elizabeth, the Queen Mother. It acquired its reputation as \"the place for tea\" in London after World War I.  In the 1920s a small orchestra would play regularly on the court; film producer John Sutro for instance recalled that Hermione Baddeley once requested the violinist to \"play something hot\". Between the Winter Garden and the central Grand Gallery is a screen featuring two Ionic columns."]}, {"page": "Roy Harrod", "response": ["At Oxford Harrod was part of the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester, Brian Howard, Michael Parsons, 6th Earl of Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, Mark Ogilvie-Grant, John Drury-Lowe."]}, {"page": "Henry Thynne, 6th Marquess of Bath", "response": ["At Oxford, Thynne was part of the Railway Club, which included: Henry Yorke, Roy Harrod, David Plunket Greene, Harry Fox-Strangways, Brian Howard, Michael Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, Patrick Balfour, Mark Ogilvie-Grant, and John Drury-Lowe."]}, {"page": "Sutro", "response": ["* John Sutro (1903–1985), British film producer", "* John Sutro (American football) (born 1940)"]}, {"page": "Barbara Skelton", "response": ["Her final marriage in 1966 to Derek Jackson, a physicist, was brief. The alimony she obtained from Jackson allowed her to live in Paris in relative comfort. She had affairs with, among others, Peter Quennell, Feliks Topolski, Charles Addams, Bernard Frank, John Sutro and Alan Ross. "]}, {"page": "Michael Parsons, 6th Earl of Rosse", "response": ["Lord Rosse was educated at Eton College and Christ Church, Oxford (B.A., 1929; M.A. 1931). At Oxford Parsons was member of the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester, Brian Howard, Michael Parsons, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, Mark Ogilvie-Grant, John Drury-Lowe.  The members of the Railway Club dined in black-tie aboard the Penzance-Aberdeen Express between Oxford and Leicester.\"Then there was the Oxford Railway Club, formed to popularize the pleasures of drinking on trains at night. A party of a dozen young men in full evening dress would board the Penzance-Aberdeen express at Oxford and travel on it as far as Leicester; they would return at once on the Aberdeen-Penzance express. On the outward journey they would dine, and on the way back make speeches.\" Graña, C., & Graña, M. (1990). On Bohemia: The code of the self-exiled. New Brunswick: Transaction Publishers"]}, {"page": "Terence Lucy Greenidge", "response": ["In the summer of 1924, Terence Greenidge, his brother John Greenidge, Evelyn Waugh, and John Sutro, the film producer whom Terence knew at Rugby School,. contributed £5 each to purchase a cine-camera and started filming the Scarlet Woman: An Ecclesiastical Melodrama,Scarlet Woman: An Ecclesiastical Melodrama. a collaboration that would only yield a small dividend, some forty-two years later, to John Sutro and Terence Greenidge, since by then his brother John Greenidge (October 1953) and Evelyn Waugh (April 1966) had died."]}, {"page": "Hugh Lygon", "response": ["thumb|left|Railway Club at Oxford, conceived by John Sutro, dominated by Harold Acton. Left to right, back: Henry Yorke, Roy Harrod, Henry Weymouth, David Plunket Greene, Harry Stavordale, Brian Howard. Middle row: Michael Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, Patrick Balfour, Mark Ogilvie-Grant, Johnny Drury-Lowe; front: porters.", "At Oxford Lygon was part of the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester, Brian Howard, Michael Parsons, 6th Earl of Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, Mark Ogilvie-Grant, John Drury-Lowe."]}, {"page": "Bright young things", "response": ["|John Sutro (1903–1985)"]}, {"page": "7th Berlin International Film Festival", "response": ["* John Sutro, producer (United Kingdom)"]}, {"page": "Harry Fox-Strangways, 7th Earl of Ilchester", "response": ["thumb|Railway Club at Oxford, conceived by John Sutro, dominated by Harold Acton. Left to right, back: Henry Yorke, Roy Harrod, Henry Weymouth, David Plunket Greene, Harry Stavordale, Brian Howard. Middle row: Michael Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, Patrick Balfour, Mark Ogilvie-Grant, Johnny Drury-Lowe; front: porters.", "He was educated at Eton College and Christ Church, Oxford, where he was part of the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Fox-Strangways, Brian Howard, Michael Parsons, 6th Earl of Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, Mark Ogilvie-Grant, John Drury-Lowe."]}, {"page": "Mark Ogilvie-Grant", "response": ["thumb|left|Railway Club at Oxford, conceived by John Sutro, dominated by Harold Acton. Left to right, back: Henry Yorke, Roy Harrod, Henry Weymouth, David Plunket Greene, Harry Stavordale, Brian Howard. Middle row: Michael Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, Patrick Balfour, Mark Ogilvie-Grant, Johnny Drury-Lowe; front: porters.", "He attended Eton College where he met his long-lasting friends Brian Howard and Robert Byron.M.J. Lancaster, Brian Howard, Portrait of a Failure, 1968, p. 212 With them he was an early member of the Bright Young Things. He then moved to Trinity College, Oxford, where he was part of a group including Harold Acton, Robert Byron, Henry Vincent Yorke, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Brian Howard, John Sutro, Hugh Lygon, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross. At Oxford Ogilvie-Grant was part of the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester, Brian Howard, Michael Parsons, 6th Earl of Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, and John Drury-Lowe. Together with Harold Acton, William Howard, 8th Earl of Wicklow, Hugh Lygon, and Robert Byron, Ogilvie-Grant was part of the \"Oxford Set\" that attended the Hypocrites' Club. He was a member of the \"Georgeoisie\" with Alan Pryce-Jones, a group of students who dined every night at the George restaurant. He graduated in 1929 with a Bachelor of Arts (B.A.)"]}, {"page": "John Drury-Lowe", "response": ["thumb|Railway Club at Oxford, coincived by John Sutro, dominated by Harold Acton. Left to right, back: Henry Yorke, Roy Harrod, Henry Weymouth, David Plunket Greene, Harry Stavordale, Brian Howard. Middle row: Michael Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, Patrick Balfour, Mark Ogilvie-Grant, Johnny Drury-Lowe; front: porters.", "He attended Eton College and Oxford University. At Eton his contemporaries were Bryan Guinness, 2nd Baron Moyne, Harold Acton, Michael Parsons, 6th Earl of Rosse, Henry Yorke, Robert Byron, Brian Howard. At Oxford Drury-Lowe was part of the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester, Brian Howard, Michael Parsons, 6th Earl of Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, and Mark Ogilvie-Grant."]}, {"page": "Hypocrites' Club", "response": ["Anthony Powell's first encounter with Evelyn Waugh was a sighting of him at the Hypocrites sitting on the knee of another member, Christopher Hollis. Waugh later teased Christopher Sykes for not having had a homosexual phase. Though Waugh was friends with Terence Lucy Greenidge and Harold Acton, eccentrics and crazy, romantically he was attracted to fragile, beautiful boys like Alastair Hugh Graham and Richard Pares. After Waugh left Oxford he kept going back, and on 12 November 1924 he accepted a lunch date with John Sutro, that was indeed a surprise party at which Sutro invited all of Waugh's \"old friends\": Harold Acton, Mark Ogilvie-Grant, Hugh Lygon, Robert Byron, Arden Hilliard and Richard Pares. That night Waugh got into Balliol and was let out of a window for having mocked Hilliard and Powell. It was to this visit that Waugh later attributed his \"decline\" into alcohol.", "thumb|Railway Club at Oxford. Left to right, back: Henry Yorke, Roy Harrod, Henry Weymouth, David Plunket Greene, Harry Stavordale, Brian Howard. Middle row: Michael Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, Patrick Balfour, Mark Ogilvie-Grant, Johnny Drury-Lowe; front: porters.", "A contemporary club at Oxford was the Railway Club, founded by John Sutro and dominated by Harold Acton; members included: Henry Yorke; Roy Harrod; Henry Thynne, 6th Marquess of Bath; David Plunket Greene; Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester; Brian Howard; Michael Parsons, 6th Earl of Rosse; Hugh Lygon; Bryan Guinness, 2nd Baron Moyne; Patrick Balfour, 3rd Baron Kinross; Mark Ogilvie-Grant; John Drury-Lowe; Evelyn Waugh. The members of the Railway Club dined in black-tie aboard of the Penzance-Aberdeen express between Oxford and Leicester.", "The Scarlet Woman: An Ecclesiastical Melodrama was directed by Terence Lucy Greenidge, and written by Evelyn Waugh in September 1924.Scarlet Woman: An Ecclesiastical Melodrama .  The cast members were: the same Evelyn Waugh, Arden Hilliard, Elsa Lanchester, John Greenidge (Terence's brother), Alec Waugh, John Sutro, the same Terence Greenidge, Septimus Nixon (real name Guy Hemingway), Derek Erskine, Michael Murgatroyd (real name William Lygon, 8th Earl Beauchamp), Archibald Gordon and Sibbald Malcolm. The absurd plot was about the Pope (Guy Hemingway) trying to convert England to Catholicism using Sligger (the Dean of Balliol, Evelyn Waugh). Greenidge, his brother John, Waugh and Sutro put 5 pounds (£ in  sterlings) each and bought a camera. Filming mostly took place in Arthur Waugh's garden at Hampstead with few other locations in London and Oxford. Most of the actors came from the Hypocrites' Club, other than Waugh's brother, Alec, and Elsa Lanchester, not yet a professional actress and managing a night club in Charlotte Street, London. Her pay was a £4 dinner. The Scarlet Woman is Evelyn Waugh's only movie and was never shown in public; it had private screenings in London and Oxford. Christopher Sykes says it \"became a legend rather than an experience\" for most of Waugh's friends. Father C. C. Martindale of Campion Hall, a Catholic house in the University of Oxford, saw it and \"laughed till his tears flowed\"."]}, {"page": "William Acton (painter)", "response": ["In 1925 Acton moved to Christ Church, Oxford, with many of his friends, but remained for only one year. Brian Howard wrote a satirical profile of William Acton in his Continuation of Oxford Portraits of 1925-6 which appeared in the Cherwell. Other profiles were: David Herbert, Mark Ogilvie-Grant, René Crevel, Henry Thynne, 6th Marquess of Bath and Charles Plumb. In the previous issue the profiles had been Robert Byron, Harold Acton, John Sutro, Bryan Guinness, 2nd Baron Moyne, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester. At Oxford William Acton's friends were Hugh Lygon, Robert Byron, Brian Howard, Michael Parsons, David Plunket Greene, Roy Harrod, Evelyn Waugh and John Sutro."]}, {"page": "Railway Club (disambiguation)", "response": ["* Oxford Railway Club, founded by John Sutro"]}, {"page": "Sutro, John", "response": ["#redirectJohn Sutro"]}]}}