{"wiki_id": "http://www.wikidata.org/entity/Q6258703", "itemLabel": "John Sprinzel", "itemDescription": "British racing driver (1930-2021)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Sprinzel", "wikipedia_page": {"main": "John Sprinzel (October 25, 1930 – May 2021) was a British motor racing driver renowned for competing in saloon and sports car races in addition to his main career in rallying.Sprinzel was born in Berlin, where his father was a film director for Paramount Newsreel and his mother a dress designer. Three years later the family moved to England, as John's father had been tasked with setting up Paramount Newsreel's London branch. (The move had nothing to do with the Nazi persecution of Jews, as has been claimed in once-respected national newspapers. The family were members of the Lutheran Church.)He finished third overall in the inaugural 1958 British Saloon Car Championship season driving for his own Team Speedwell in an Austin A35. Navigated by future BMC and Ford Competitions Manager Stuart Turner, he won the British Rally Championship in 1959, driving an Austin-Healey Sprite and an Alfa Romeo Giulietta TI. In International events during 1960, he won his class in the 12 Hours of Sebring race in Florida and scored 2nd place overall in the RAC Rally of Great Britain and third overall in Belgium's gruelling Liège-Rome-Liège. These successes were all achieved in Austin-Healey Sebring Sprites, a car he was instrumental in developing.\nHe published three volumes of memoirs: 'Sleepless Knights' (1962), 'Spritely Years' (1994 and 2008) and 'Lucky John' (2013), as well as a tuning manual for BMC cars 'Modified Motoring' (1959 and 1961). John died of natural causes in Hawaii where he had lived for many years with his life-partner Caryl.", "link_mentions": [{"page": "Austin-Healey Sprite", "response": ["The BMC Competitions Department entered Austin Healey Sprites in major international races and rallies, their first major success coming when John Sprinzel and Willy Cave won their class on the 1958 Alpine Rally. In 1959, the Sprite was introduced to the US market by winning its class in the 12-hour race at Sebring, Florida. Private competitors also competed with much success in Sprites. Because of its affordability and practicality, the Austin-Healey Sprite was developed into a formidable competition car, assuming many variants by John Sprinzel, Speedwell and WSM. Many owners use their Austin Healey Sprites in competition today, fifty years after its introduction."]}, {"page": "Paul Hawkins (racing driver)", "response": ["Hawkins began racing in Australia with an Austin-Healey in 1958. He left Australia and arrived in England in 1960.Castrol advertisement, Motor Sport, October 1967, Page 893. He found employment with the Donald Healey Motor Company Ltd.,Motor Sport, July 1960, Page 554. under John Sprinzel:", "\"I put an ad in the Evening Standard newspaper looking for a mechanic and employed a really good guy to be our works foreman; his name was Paul Hawkins. Paul literally came in straight off the boat from Australia. He’d done a little bit of racing and was a very good mechanic, very good as he knew his stuff, and certainly knew the best parts of the English language, too.\"Interview with John Sprinzel, Vintage Racecar, Vol 12, Issue 5, May 2009."]}, {"page": "Mallory Park", "response": ["|  John Sprinzel"]}, {"page": "British Rally Championship", "response": ["|  John Sprinzel"]}, {"page": "Austin-Healey Sebring Sprite", "response": ["The Austin-Healey Sebring Sprite is a small sports car that was produced by the Donald Healey Motor Company at its Cape Works in Warwick, the Healey's Speed Equipment Division in Grosvenor Street, London and subsequently by John Sprinzel Ltd from their well-known premises in Lancaster Mews. A modified version of the production Austin-Healey Sprite, it was recognized by the governing body of motorsport, the Fédération Internationale de l'Automobile, as a separate model in its own right, featuring Girling disc brakes as well as specified engine and chassis improvements. After its homologation (motorsport) on 17 September 1960, FIA regulations permitted the use of 'special bodies' and a small number of Sebring Sprites were subsequently fitted with coupé bodywork in aluminium alloy and glassfibre, the most strikingly attractive examples being those devised by well-known race and rally driver John Sprinzel, who had won the 1959 RAC British Rally Championship. Sprinzel commissioned the coachbuilders Williams & Pritchard, renowned for their racing and prototype work, to produce the bodies. These are usually said to have numbered six, but eight are known to have been made. Further Sprites received similar alloy bodywork from Alec Goldie and Fred Faulkner of the firm Robert Peel Sheet Metal Works (more usually known as 'Peel Coachworks'). The name 'Sebring Sprite' would become a generic term for any Sprite with disc brakes, and later for any Sprite with coupé or fastback bodywork.'Spritely Years: Race and Rally Memories from the Classic Era Plus the Full History of the Sebring Sprite' (Patrick Stephens, 1994 and John Sprinzel Ltd, 2008) by John Sprinzel and Tom Coulthard", "The Healeys subsequently offered to equip customers' Sprites to a similar specification to the Sebring cars, though using twin 1-inch SU H4 carburettors and a complete replacement braking system by Girling. This comprised 8-inch 'Type 9' calliper discs for the front wheels and 8-inch drums at the rear, with all brake lines, unions, flexibles and fluid being replaced with Girling equipment. One such Sprite (registered 888 HPA) was owned, tuned and raced by Beatrice Shilling, the aeronautical engineer now hailed a Second World War hero for making a small but life-saving improvement to the Rolls-Royce Merlin engines fitted to both the RAF's Hawker Hurricane and Supermarine Spitfire aircraft. These Healey Sebring Sprites were modified at The Cape Works, and from early 1960 also at the small workshop at the London showrooms in Grosvenor Street, where the Healey Speed Equipment Division was run by the then reigning British Rally Champion, John Sprinzel and the chief mechanic was future F1 driver Paul Hawkins.'Lucky John' (The Coulthard Press, 2013) by John Sprinzel", "John Sprinzel had founded the highly successful tuning firm Speedwell Performance Conversions Ltd, where he was joined by future Formula 1 World Champion Graham Hill. Speedwell developed a sleek, alloy-bodied Sprite coupe, the Speedwell GT, designed by aerodynamicist Frank Costin and built by Williams & Pritchard. However, Donald Healey had managed to lure John Sprinzel away from Speedwell by inviting him to set up the Healey Speed Equipment Division and the promise of Healey works drives at both Sebring and Le Mans.", "Because of increasing safety worries about the speed differential between the smallest and largest-engined cars, a separate four-hour race for GT cars of under one litre was organized at Sebring in 1960. Stirling Moss drove a Sebring Sprite to a class win and second overall in this event. In the twelve-hour race, John Sprinzel drove a prototype Sprite with a GRP Falcon kit-car body, built and entered by the Donald Healey Motor Company, to another impressive class win, finishing 41st overall.", "Leaving the Healeys to set up his own tuning and race preparation concern at Lancaster Mews in December 1960, John Sprinzel launched his Williams & Pritchard-bodied coupe to immediate acclaim at the Racing Car Show in London. Sprinzel Sebring Sprites were soon being built for racers Cyril Simson (S 221), Chris Williams (52 LPH), Ian Walker (WJB 707), Andrew Hedges (410 EAO) and for BMC works rally driver David Seigle-Morris (D 20). Sprinzel's personal Sebring Sprite bore the registration number PMO 200, and he campaigned the car at Sebring and in international rallies as well as races throughout the 1961 season, culminating in an outright win in the Targa Rusticana rally at the beginning of 1962.", "No less than 7 Sebring Sprites contested the long-distance races at Sebring in 1961. Five Healey-prepared BMC works cars were driven by Ed Leavens, Briggs Cunningham, Dick Thompson, Bruce McLaren and Walt Hansgen. There were also two of John Sprinzel's striking coupes, piloted by one of the top-rated Grand Prix drivers of all time, Stirling Moss, together with his sister Pat Moss, Britain's most successful woman rally driver. The Sebring Sprites finished in six of the top eight places in the 4-hour race for one-litre homologated GT cars. In the 12-hour race, Sebring Sprites were driven by Ed Leavens, John Colgate, Joe Buzetta, Glenn Carlson, Cyril Simson and future F1 driver Paul Hawkins to strong performances, finishing 2nd, 3rd and 4th in the 1150cc sports (prototype) class and 15th and 25th and 37th overall.", "* John Sprinzel's Austin-Healey Sebring Sprite Coupés"]}, {"page": "1958 British Saloon Car Championship", "response": ["|  John Sprinzel", "|  John Sprinzel", "|  John Sprinzel", "|  John Sprinzel", "|  John Sprinzel", "|  John Sprinzel", "|  John Sprinzel", "|  John Sprinzel", "|  John Sprinzel"]}, {"page": "1930 in Germany", "response": ["* 25 October - John Sprinzel, racing driver"]}, {"page": "1968 London–Sydney Marathon", "response": ["|  John Sprinzel\t\t\t", "|  John Sprinzel   Roy Fidler"]}, {"page": "Williams & Pritchard (coachbuilders)", "response": ["The clients of Williams & Pritchard included: Colin Chapman, Lotus, AC (Aceca coupé), Lola, Cooper, Lister-Jaguar, Elva, John Surtees, Costin, Gordon-Keeble, BRM, John Sprinzel, Speedwell. The last coach building client of William's and Pritchard was designer David Gittens McLaren based Ikenga GT prototypes, constructed between 1967 and completed following Charlie Williams death in June 1969. Another project was carried out for the 1970s when the rare OWEN SEDANCA GT, another original sports car that appeared briefly for sale with Jaguar Straightsix 4235cc running gear from a Jaguar XJ6 car with an aluminium bodyshell of which 80 cars were to be made but only a reputed ten were actually made at their W & S LIMITED Edmonton North London workshops."]}, {"page": "1963 Brands Hatch 6 Hours", "response": ["Grid positions were determined by engine capacity rather than practice times. As a result, the record books show John Sprinzel on pole, in his 7-litre Ford Galaxie.  However, the fastest time in practise was set by the pairing of Dan Gurney and Jack Brabham in their Galaxie.", "The start with the slow car of John Sprinzel on pole, brought Mike Salmon into second place in Jaguar Mk. II following the early leader, Gawaine Baillie’s Galaxie, ahead of the American Dan Gurney (Galaxie) and John Coundley (Jaguar Mk II). Handicapped by wrong tyres, Gurney spun at South Bank, but somehow the whole field avoided him. After two laps, Baillie had dropped to third, giving way to Salmon and Peter Lindner, while Gurney spun again.  By the fourth lap, Gurney came in for a tyre change on the rear – before the start, he could only change the fronts.", "|  John Sprinzel", "| John Sprinzel Racing"]}, {"page": "List of European Rally Championship drivers", "response": ["|align=left|  John Sprinzel"]}, {"page": "1960 12 Hours of Sebring", "response": ["|  John Sprinzel"]}, {"page": "1961 12 Hours of Sebring", "response": ["| John Sprinzel"]}, {"page": "1959 Monte Carlo Rally", "response": ["|align=\"left\"|  John Sprinzel"]}, {"page": "Sprinzel, John", "response": ["#redirectJohn Sprinzel"]}]}}