{"wiki_id": "http://www.wikidata.org/entity/Q6261270", "itemLabel": "John Trillo", "itemDescription": "Anglican bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Trillo", "wikipedia_page": {"main": "Albert John Trillo (London, 4 July 1915 – 2 August 1992, Wenhaston, Suffolk) was a Church of England bishop.\nJohn Trillo (as he was generally known) grew up in Cricklewood, North London, and was educated at the Quintin School and King's College, London. On leaving school he worked in the film industry, for British Lion, and obtained his BA degree as a part-time student.  He was ordained in 1938 and was a curate at Christ Church, Fulham before becoming the priest in charge of St Michael's, Cricklewood. From 1945 he worked for the Student Christian Movement, pioneering its work in Yorkshire grammar schools and becoming its secretary.  From 1950-1955 he was rector of Friern Barnet and a lecturer in divinity at King's College, London.\nIn 1955, Trillo was appointed the principal of Bishop's College, Cheshunt, and remained there until his consecration to the episcopate as the Bishop of Bedford in 1963. He became the Bishop of Hertford in 1968 and the Bishop of Chelmsford in 1971. In retirement he continued to serve as an assistant bishop for a further seven years.", "link_mentions": [{"page": "Bishop of Chelmsford", "response": ["| John Trillo"]}, {"page": "Bishop of Bedford", "response": ["| John Trillo"]}, {"page": "Bishop of Hertford", "response": ["|align=\"center\"| 1967 ||align=\"center\"| 1971 || John Trillo || (1915–1992). Translated from Bedford; later to Chelmsford"]}, {"page": "Jonathan Bailey (bishop)", "response": ["In 1982, John Trillo, Bishop of Chelmsford, appointed him Archdeacon of Southend and his Adviser for Industry and Commerce. The latter brought with it the post of Development Officer for the Essex Churches Council for Industry and Commerce, heading up an ecumenical team of a dozen or more industrial chaplains. He served the diocese as chairman of the statutory Board of Education. During this time he served nationally as a member of the Council for the Care  of Churches. Along with two colleagues he shared an initiative to establish and  deliver induction training for new archdeacons which developed into a continuing programme of in-service training."]}, {"page": "Trillo", "response": ["*John Trillo ( 1915 –1992), bishop of the Church of England"]}, {"page": "List of alumni of King's College London", "response": ["*John Trillo – Bishop of Bedford, Chelmsford & Hertford"]}, {"page": "St John, Friern Barnet", "response": ["After which time the rector of Friern Barnet resumed charge. The Rev Frederick Hall was rector from 1892 to 1902, and his son the Rev Edward Gage Hall from 1902 to 1940.\"Friern Barnet: Churches\", A History of the County of Middlesex: Volume 6: Friern Barnet, Finchley, Hornsey with Highgate, 1980 Available from www.british-history.ac.uk  The Rev'd John Trillo was rector during the 1950s."]}, {"page": "John Taylor (bishop of St Albans)", "response": ["He was made deacon (presumably  at Southwark), and ordained priest at Michaelmas 1957 (22 September), by Bertram Simpson, Bishop of Southwark, at Southwark Cathedral. After a curacy at St Lawrence Church, Morden,Daily Telegraph Issue no 50,086 (dated Saturday 4 June 2016) p25 \"Scholarly Bishop of St Albans who preferred cocoa to claret\" he served as Vicar of Henham and Elsenham from 1959 to 1964. During that time he was appointed an examining chaplain to John Tiarks (and later John Trillo), Bishop of Chelmsford in 1962, continuing until 1980."]}, {"page": "Albert John Trillo", "response": ["#REDIRECT John Trillo"]}, {"page": "Andrew Proud", "response": ["Proud was made a deacon at Petertide 1980 (29 June) by John Trillo, Bishop of Chelmsford, at Chelmsford Cathedral, and began his ministry with a three-year curacy at St Mary's, Stansted Mountfitchet, Essex. At Petertide 1981 (28 June) he was ordained a priest by Roderic Coote, Bishop of Colchester, at St Andrew's, Halstead. In 1983, he became Team Vicar of Borehamwood, Hertfordshire, until 1990, when he moved to Bishop's Hatfield, where he was an assistant priest in the team ministry until 1992. From that point until 2001, he was rector at St Mary's, East Barnet, Greater London, before he returned to university for postgraduate study."]}, {"page": "Church of St George, Letchworth", "response": ["Building work on the triangular piece of land began in August 1962 with the firm of J T Openshaw Ltd of Letchworth as the main contractors; the final cost was £46,000. The foundation stone was laid by John Trillo, the Bishop of Bedford on 27 April 1963, with the church being consecrated on 27 July 1964 by Michael Gresford Jones, Bishop of St Albans."]}, {"page": "Trillo, John", "response": ["#redirectJohn Trillo"]}]}}