{"wiki_id": "http://www.wikidata.org/entity/Q6261066", "itemLabel": "John Townend", "itemDescription": "British politician (1934-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Townend", "wikipedia_page": {"main": "John Ernest Townend (12 June 1934 – 18 August 2018) was a British politician who was a Member of Parliament for the Conservative Party.", "link_mentions": [{"page": "Conservative Party (UK)", "response": ["John Major resigned as party leader after the Conservatives were heavily defeated in a landslide and was succeeded by William Hague. Though Hague was a strong orator, a Gallup poll for The Daily Telegraph found that two-thirds of voters regarded him as \"a bit of a wally\", for headlines such as his claim that he drank 14 pints of beer in a single day in his youth. He was also criticised for attending the Notting Hill Carnival and for wearing a baseball cap in public in what were seen as poor attempts to appeal to younger voters. Shortly before the 2001 general election, Hague was much maligned for a speech in which he predicted that a re-elected Labour government would turn the UK into a \"foreign land\". The BBC also reported that the Conservative peer John Lord Taylor criticised Hague for not removing the whip from John Townend, a Conservative MP, after the latter made a speech in which he said the British were becoming \"a mongrel race\", although Hague did reject Townend's views."]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| John Townend"]}, {"page": "Maastricht Rebels", "response": ["*John Townend (Bridlington)"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|John Townend"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|John Townend"]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|John Townend"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|John Townend"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|John Townend"]}, {"page": "Laurence Robertson", "response": ["Robertson courted controversy in May 2001 by ignoring James Cran's advice not to publicly express support for John Townend. Robertson endorsed Townend's controversial remarks about race on BBC's Newsnight saying that Townend's remarks were \"basically true\" and \"having too many people in different multi-racial groups makes society very difficult to manage, especially in certain parts of the country. It is not that easy to manage that kind of society.\""]}, {"page": "Hymers College", "response": ["*John Townend, politician"]}, {"page": "East Yorkshire (UK Parliament constituency)", "response": ["The East Yorkshire constituency was created for the 1997 general election and replaced the Bridlington constituency. The Conservative MP for that seat since 1979, John Townend, won the new seat and held it until he retired at the 2001 general election. His successor, the current incumbent Greg Knight, had previously represented the marginal seat of Derby North from 1983 until he was defeated in the 1997 general election. To date it has been a Conservative safe seat and ranks 170th in terms of their share of the vote of their 631 candidates, with an approximately equally divided opposition in 2010.", "| John Townend"]}, {"page": "List of United Kingdom MPs: T", "response": ["*John Townend"]}, {"page": "John Townsend", "response": ["*John Townend (rugby league), rugby league footballer who played in the 1890s and 1900s", "*John Townend (born 1934), British politician"]}, {"page": "92 Group", "response": ["Its first chairman was Wall, and John Townend was at one time chairman, as was Gerald Howarth. George Gardiner, David Maclean, Christopher Chope and Edward Leigh have been members. In 1996 there were around one hundred members of the Group.Interview with Michael Heseltine (5 May 1996). They grouped together as a block vote in committee elections and to influence party policy. Norman Tebbit records in his memoirs that shortly after being elected an MP in 1970, he was elected to the party's backbench committee on housing policy, even though he was virtually unknown to most MPs. However, at committee election times, the group met to agree on a slate of candidates they were expected to support, thus explaining Tebbit's success.Norman Tebbit, Upwardly Mobile (Futura, 1991), pp. 122–3."]}, {"page": "John Ernest Townsend", "response": ["#REDIRECTJohn Townend"]}, {"page": "John Ernest Townend", "response": ["#REDIRECT John Townend"]}, {"page": "Bridlington (UK Parliament constituency)", "response": ["| John Townend"]}, {"page": "Townend (surname)", "response": ["* John Townend, British politician"]}, {"page": "1934 in the United Kingdom", "response": ["* 12 June 12 – John Townend, politician (died 2018)"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*John Townend"]}, {"page": "John Townshend", "response": ["*John Townend (1934–2018), British politician"]}, {"page": "List of United Kingdom MPs who died in the 2010s", "response": ["|John Townend"]}, {"page": "2018 in the United Kingdom", "response": ["**John Townend, 84, British politician, MP (1979–2001)."]}, {"page": "Deaths in August 2018", "response": ["*John Townend, 84, British politician, MP (1979–2001).Townend"]}, {"page": "Racism in the UK Conservative Party", "response": ["In 2001 Edgar Griffin, father of Nick Griffin, was sacked from the party due to his support for his son's far-right British National Party. Griffin claimed to have rank and file Tory support for his views, which included financial subsidies for \"the coloured folk\" to leave the UK. This, combined with Conservative MP John Townend's claim that immigrants were \"undermin[ing]\" the purity of Britain's \"homogeneous Anglo-Saxon society\" and were causing a rise in crime rates across the UK led Conservative MP Andrew Lansley to say that there was \"endemic racism in the Tory party\"."]}, {"page": "Townend, John", "response": ["#redirectJohn Townend"]}]}}