{"wiki_id": "http://www.wikidata.org/entity/Q6267859", "itemLabel": "Johnny Warman", "itemDescription": "British singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Johnny_Warman", "wikipedia_page": {"main": "John Robert Waughman (born 29 March 1951), better known as Johnny Warman, is an English singer-songwriter, best known for his 1981 album, Walking Into Mirrors and the hit single \"Screaming Jets\".", "link_mentions": [{"page": "United Kingdom in the Eurovision Song Contest 1986", "response": ["| align=\"left\" | Gary Osborne, Johnny Warman"]}, {"page": "United Kingdom in the Eurovision Song Contest 1993", "response": ["| align=\"left\"| Johnny Warman, Nick Graham"]}, {"page": "Warman", "response": ["* Johnny Warman (born 1951), English rock and roll singer and songwriter"]}, {"page": "Aqua (Asia album)", "response": ["\"Love Under Fire\" was composed in summer 1988 by Downes and Greg Lake under the project named Ride the Tiger. The album contains four songs co-written by Johnny Warman."]}, {"page": "Peter Gabriel discography", "response": ["* 1981 \"Screaming Jets\" on the album Walking into Mirrors by Johnny Warman"]}, {"page": "Archiva 1", "response": ["\"Tears\" was written by Downes and Johnny Warman in February 1988 and was one of the tracks recorded by the duo in the basement of Advision Studios in London from 1988 to 1989. It was first released on Downes' album Vox Humana (1992) with Max Bacon on lead vocals."]}, {"page": "Archiva 2", "response": ["\"Moon Under the Water\" was written by Downes and Johnny Warman in March 1988 and was one of the tracks recorded by the duo in the basement of Advision Studios in London from 1988 to 1989. It was first released on Downes' album Vox Humana (1992) with Steve Overland on lead vocals."]}, {"page": "Ringo Starr and Friends", "response": ["# \"Don't Go Where the Road Don't Go\" – (Starr/Johnny Warman) – 4:34"]}, {"page": "Jerry Marotta", "response": ["* Johnny Warman Walking into Mirrors 1981"]}, {"page": "House of Lords (House of Lords album)", "response": ["Rick Nielsen of Cheap Trick (with whom the band would later tour) co-wrote the song \"Slip of the Tongue\". Jeff Scott Soto of Talisman can be found on backing vocals throughout the whole album. Many other popular hard rock musicians has contributed to the songwriting of the songs on the album, including Stan Bush, David Glen Eisley of Giuffria, Johnny Warman and Mandy Meyer of Asia."]}, {"page": "Better the Devil You Know (album)", "response": ["# \"Our World\" (Johnny Warman, Nick Graham) 2:47"]}, {"page": "Christmas (Elaine Paige album)", "response": ["# \"Father Christmas Eyes\" - 4.36 (Julia Downes, Johnny Warman, Don Black)"]}, {"page": "Steve Byrd", "response": ["In the 1990s, he was also a member of 4 Bills And A Ben, a band with flexible line-up formed by Johnny Warman which also included Jeff Rich and John Edwards from Status Quo."]}, {"page": "Vic Coppersmith-Heaven", "response": ["*Hour Glass – Johnny Warman (1979)"]}, {"page": "Paul Martinez", "response": ["* Johnny Warman, Hour Glass (Angel Air, 2005)"]}, {"page": "List of songs recorded by Ringo Starr", "response": ["| Richard StarkeyJohnny Warman", "| Richard StarkeyJohnny WarmanGary Grainger", "| Richard StarkeyJohnny Warman", "| Richard StarkeyJohnny Warman"]}, {"page": "Weight of the World (Ringo Starr song)", "response": ["#\"After All These Years\" (Richard Starkey, Johnny Warman) – 3:10"]}, {"page": "The Rocket Record Company", "response": ["*Johnny Warman"]}, {"page": "Walking Into Mirrors", "response": ["Walking Into Mirrors is a 1981 album by Johnny Warman. The single \"Screaming Jets\" featured Peter Gabriel singing backing vocals and became Warman's best-known hit.Andrew Grant Jackson, Still the Greatest: The Essential Songs of The Beatles' ... - Page 220 \"Johnny Warman, an English guy known for his 1981 album Walking into Mirrors and the single \"Screaming Jets,\" wrote \"", "All tracks composed by Johnny Warman; except where indicated", "*Johnny Warman - vocals, acoustic and electric guitar", "*Johnny Warman, Vic Coppersmith-Heaven - production, arrangements"]}, {"page": "List of Humble Pie members", "response": ["Humble Pie were an English hard rock band from Moreton, Essex. Formed in January 1969, the group originally included vocalist and guitarist Steve Marriott, guitarist and vocalist Peter Frampton, bassist and vocalist Greg Ridley, and drummer Jerry Shirley. After several lineup changes and breakups, the group's final tour in 2002 featured drummer Shirley alongside bassist and vocalist Ridley (previously a member of the original lineup from 1969 to 1975), guitarist and vocalist Bobby Tench (previously a member from 1980 to 1981), lead vocalist and guitarist Johnny Warman, guitarist Dave \"Bucket\" Colwell and keyboardist Dean Rees, keyboardist Zoot Money, bassist Nigel Harrison, guitarist Clem Clempson and vocalist Dave Walker.", "Shirley reformed Humble Pie again in 2001 to mark the tenth anniversary of Marriott's death, adding original bassist Ridley, former guitarist Tench and new guitarist Dave \"Bucket\" Colwell, all of whom performed on the band's first studio album since 1981, Back on Track. The group later added keyboardist Dean Rees and vocalist and guitarist Johnny Warman for a short European tour in 2002, which was cut short when Ridley was forced to retire due to pneumonia. The illness ultimately led to his death on 19 November 2003.", "|Johnny Warman", "*Johnny Warman – vocals, guitar"]}, {"page": "Don't Call Me", "response": ["*\"Don't Call Me\", song by Johnny Warman"]}, {"page": "Ring O' Records", "response": ["Ring O' signed saxophonist Bobby Keys on a long-term contract. His debut release for the label was the single \"Gimmie the Key\" in August 1975. Starr had hoped to sign his friend Harry Nilsson also, but Nilsson chose to renew his contract with RCA Records. The next two Ring O' releases were singles by Australian singer-songwriter Carl Groszmann, \"I've Had It\", and \"Colonel\" Doug Bogie, with his reggae arrangement of \"Away in a Manger\". As with subsequent Ring O' Records artists such as Graham Bonnet, Stormer, Johnny Warman and Suzanne, none of these acts achieved success on the label."]}]}}