{"wiki_id": "http://www.wikidata.org/entity/Q6266730", "itemLabel": "Johnny Gentle", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Johnny_Gentle", "wikipedia_page": {"main": "John Askew (born 8 December 1936), known as Johnny Gentle, is a British pop singer best remembered for having briefly toured Scotland with the Silver Beetles (later known as the Beatles) as his backing group in 1960.", "link_mentions": [{"page": "The Beatles", "response": ["By January 1959, Lennon's Quarry Bank friends had left the group, and he began his studies at the Liverpool College of Art. The three guitarists, billing themselves as Johnny and the Moondogs, were playing rock and roll whenever they could find a drummer. Lennon's art school friend Stuart Sutcliffe, who had just sold one of his paintings and was persuaded to purchase a bass guitar with the proceeds, joined in January 1960. He suggested changing the band's name to Beatals, as a tribute to Buddy Holly and the Crickets. They used this name until May, when they became the Silver Beetles, before undertaking a brief tour of Scotland as the backing group for pop singer and fellow Liverpudlian Johnny Gentle. By early July, they had refashioned themselves as the Silver Beatles, and by the middle of August simply the Beatles."]}, {"page": "1960 in music", "response": ["*May 20–28 – The Beatles, as the Silver Beetles (uncredited), play their first ever tour, as a backing group for Johnny Gentle on a tour of Scotland. The lineup comprises John Lennon, Paul McCartney, George Harrison, Stuart Sutcliffe and Tommy Moore."]}, {"page": "Alex Harvey (musician)", "response": ["Harvey was born in the Kinning Park district of Glasgow (also reported as the Gorbals in the 2009 STV show The Greatest Scot), a working class neighbourhood, where he grew up.\"Rock Star\" 2 By his own account, he worked in a number of jobs, from carpentry to being a waiter at a restaurant to carving tombstones,Denselow, 8 before finding success in music. He first began performing in skiffle groups in 1954. On Friday, 20 May 1960, at the Town Hall in Alloa, Alex Harvey and his Big Beat Band opened for Johnny Gentle and His Group, \"His Group\" being the Beatles (John, Paul, George, Stuart Sutcliffe and Tommy Moore), on this the opening night – and biggest audience – of the Beatles' seven-date tour of Scotland with Gentle.Lewisohn, Mark, the Beatles: All These Years; Tune In, p. 309-310,"]}, {"page": "John Lennon discography", "response": ["|Johnny Gentle"]}, {"page": "Gentle", "response": ["* Johnny Gentle, stage name of John Askew (born 1936), British pop singer who once toured with the Silver Beetles (later the Beatles) as his backing group"]}, {"page": "Larry Parnes", "response": ["After Steele's success, Parnes looked to find other young men who he could groom to become pop stars. At Bart's suggestion, he next signed Reg Patterson (né Smith), whom he re-christened Marty Wilde, and who also rose to pop stardom in the UK.  Parnes developed a network of contacts within the British recording industry and entertainment business, with leading British songwriters providing songs for his growing stable of talent, and many of his protégés achieving success in the UK Singles Chart.  A flamboyant gay man, Parnes' approach was to select, and then groom, handsome young men who would be attractive to a teenage audience. He also gave them new stage names, which were rumoured to reflect what he considered to be their sexual characteristics.  Among those he managed with at least some degree of success were Billy Fury (originally Ron Wycherley), Vince Eager (Roy Taylor), Dickie Pride (Richard Knellar), Lance Fortune (Chris Morris), Duffy Power (Ray Howard), Johnny Gentle (John Askew), Terry Dene (Terence Williams), Nelson Keene (Malcolm Holland), and Georgie Fame (Clive Powell).  He also managed Tommy Bruce, as well as Joe Brown, who he unsuccessfully tried to persuade to change his name to Elmer Twitch.", "Parnes also promoted concerts, including the 1960 tour by Gene Vincent and Eddie Cochran during which Cochran was killed in a road crash. Later the same year he hired the Silver Beetles, an early incarnation of the then-unknown Beatles, to back one of his singers, Johnny Gentle, on a short tour of Scotland. Although Gentle tried to persuade him to manage the group, Parnes decided not to do so. Parnes developed the idea of the package tour, for which his stars toured the country together in a bus, playing one-night stands around the country. In 1962, he hired the Tornados as backing group for Billy Fury, and also claimed to have given \"their first breaks\" to entertainers Jimmy Tarbuck, Rolf Harris and Mike Yarwood."]}, {"page": "The 2i's Coffee Bar", "response": ["Several recording stars were discovered at, or performed at, the coffee bar, including Rory Blackwell, Tommy Steele, The Vipers Skiffle Group, Cliff Richard, Hank Marvin, Bruce Welch, Brian Bennett, Tony Meehan, Jet Harris, Brian 'Licorice' Locking, Vince Eager, Terry Dene, Wee Willie Harris, Adam Faith, Carlo Little, Joe Brown, Clem Cattini (The Tornados), Eden Kane, Screaming Lord Sutch, Tony Sheridan, Keith Kelly, Timothy Fitzpatrick, Lance Fortune, Albert Lee, Johnny Kidd, Paul Gadd (later to be known as Paul Raven and then Gary Glitter), Ritchie Blackmore, Alex Wharton, Mickie Most (as the Most Brothers), Big Jim Sullivan, Joe Moretti, Vince Taylor, Duffy Power, Johnny Gentle, Keith Kelly, Michael Cox, Kris Kristofferson, Derry and the Seniors and Georgie Fame. Notable non-musical names among the 2i's clientele included Diana Dors, Michael Caine, Terence Stamp and Francis Bacon."]}, {"page": "List of members of bands featuring members of the Beatles", "response": ["! style=\"width:200px;\" | Johnny Gentle and his group(18–30 May 1960)", "* \"Johnny Gentle\" (John Askew) – vocals"]}, {"page": "1960 in British music", "response": ["*20–28 May – The Beatles, as the Silver Beetles (uncredited), play their first ever tour, as a backing group for Johnny Gentle on a tour of Scotland. The lineup comprises John Lennon, Paul McCartney, George Harrison, Stuart Sutcliffe and Tommy Moore."]}, {"page": "The Echoes (English group)", "response": ["In January 1962, the Echoes undertook a two-day concert tour with The Temperance Seven, Shane Fenton and the Fentones, Vince Eager, Michael Cox, Johnny Gentle, and Nero & the Gladiators. Another concert followed in February with Johnny Kidd & the Pirates. In April, a national concert tour started with The Temperance Seven, Chas McDevitt and Shirley Douglas and Bert Weedon, and this led to a concert tour starting on 29 April with Jerry Lee Lewis, Johnny Kidd & the Pirates, The Viscounts, Vince Eager, Mark Eden, Danny Storm, Buddy Britten and Dave Reid. Before the final show at the Tower Ballroom, New Brighton, Laurie Jay announced his departure. A drummer was needed that night, and they recruited Ringo Starr, who had just returned from Hamburg after playing for Rory Storm and The Hurricanes. Jay went into management, later becoming the manager for Billy Ocean and Shirley Bassey. On returning to London, Tommy Frost became The Echoes' new drummer. After this tour Hines also left for Hamburg again, and was replaced by Ray Murray on keyboards. By May 1962, the Echoes line up became Dave Burns (guitar), Tommy Frost (drums), Ray Murray (keyboards), and Douggie Reece (bass). The Echoes performed a summer season in Douglas, Isle of Man in the \"Star Parade of 1962\", a rock and roll concert at The Crescent Pavilion. During the day they were required to play at The Palace Ballroom, playing relief for Ronnie Aldrich and The Squadronaires during the band's breaks. With the completion of the summer season, the Echoes returned to London and a meeting had been arranged with Mike Collier, who had just returned to England, after several years working in the music industry in America. He wanted to put together a team for his company, Micol Productions, and wanted the Echoes to be the rhythm section for his productions. Together with the arranger, Al Saxon, they began their association with Micol Productions. This led to the release on their first of four singles \"Sounds Like Winter\" in November 1961 on the Fontana. Other records for Micol Productions were released on Decca, Columbia and Fontana. The Echoes had already played at The Cavern Club in Liverpool, but on 3 September, they performed on the same bill as The Beatles. The year ended with a tour this time with B. Bumble and the Stingers, Bert Weedon, Johnny Kidd & the Pirates, Tommy Bruce, Michael Cox and Vince Eager. Other concerts to see out the year were with Adam Faith, Gene Vincent, Joe Brown and The Tornados."]}, {"page": "Dickie Pride", "response": ["This was followed by tours, television and, in March 1959, his debut single, \"Slippin' and Slidin'\" (a cover of a song made famous by Little Richard). Pride made eight appearances on the first teenage all-music TV show, Oh Boy! He also performed in 'The Big Beat Show' at Southend with Marty Wilde, Billy Fury, Terry Dene, Johnny Gentle, Duffy Power and Sally Kelly. However, the commercial performance of most of Pride's recordings was far below expectations. The only Pride single that ever made it into the Top 40 in the UK Singles Chart, \"Primrose Lane\", appeared in October 1959 for only one week at No. 28."]}, {"page": "British rock and roll", "response": ["The success of \"Move It\" was partly due to an appearance on Independent Television's Oh Boy! (1958–9).  This followed the BBC's tentative first attempt at youth music programming, Six-Five Special (1957–58), with a much more music-orientated show that did much to promote the careers of British rock and rollers like Marty Wilde, Johnny Gentle, Vince Eager, Adam Faith and Duffy Power, all managed by Larry Parnes who also gave them their stage names."]}, {"page": "Blue Angel (nightclub)", "response": ["Pete Best's audition to join the Beatles took place in the Blue Angel on 12 August 1960. It was also where the Beatles, in 1960, auditioned for impresario Larry Parnes landing them their first tour outside Liverpool, supporting singer Johnny Gentle on a tour of Scotland."]}, {"page": "Tommy Moore (musician)", "response": ["Born in Liverpool, Moore worked as a fork-lift truck driver and part-time musician. He first played drums with the Silver Beetles in May 1960, at the suggestion of Allan Williams, and later that month travelled to Scotland with John Lennon, Paul McCartney, George Harrison and Stuart Sutcliffe, when they acted as a backing band for singer Johnny Gentle. During the tour, he was injured and lost his front teeth when the band's van, driven by Gentle, had a minor accident. However, Lennon and the Scottish organiser of the tour took him out of hospital and insisted that he perform with the rest of the group. After they returned to Liverpool, Moore had already decided that he had 'had enough of Lennon'; when he did not appear for a gig one night, the rest of the band went round to his flat, and were told by his wife, Veronica (Vera) Hughes that he had gone back to his steady job at the bottle works. When they tried to persuade her otherwise, she apparently shouted 'you can all piss off!' He undertook one further performance with the group, before they left for Germany with Pete Best as their drummer in August 1960."]}, {"page": "Lathom Hall", "response": ["On 14 May 1960, the Silver Beats auditioned at the hall during the interval of a performance by Cliff Roberts and the Rockers, Dick Dale and the Deltones, and King Size Taylor and the Dominoes. One report suggests that the venue's promoter, Bill Kelly, curtailed the group's set after just two songs they performed so badly.  Conversely, the Bootle Times reported that the group were \"sensational\".  After the performances, a fight broke out backstage after bassist Stuart Sutcliffe was told to \"cut [his] hair\" as he looked like a girl. Despite this and their group's performance, Kelly booked the group for the following weekend's dance, promoting them as \"Silver Beetles\" in the headline slot. The group later failed to notify Kelly that they could not play at the performance, having received an offer to tour Scotland with Johnny Gentle, leaving him to explain to the audience why the advertised act would not appear."]}, {"page": "1960 in Scotland", "response": ["* 20–28 May – The Beatles, as the Silver Beetles (uncredited), play their first ever tour, as a backing group for Johnny Gentle on a tour of Scotland opening at Alloa Town Hall and ending at Peterhead. The lineup comprises John Lennon, Paul McCartney, George Harrison, Edinburgh-born Stuart Sutcliffe and Tommy Moore."]}, {"page": "The Beat Ballad Show Tour", "response": ["The Beat Ballad Show Tour was a 1960 tour of Scotland by singer Johnny Gentle, backed by the Beatles (billed as Johnny Gentle and his Group). It was the first-ever concert tour by the Beatles.", "On 10 May, the Beatles competed with other local Liverpool bands in an audition for talent manager Larry Parnes for a chance to back singer Billy Fury on a summer tour called \"Idols on Parade\". There was also an opportunity for the second-best band to back singers Duffy Power and Johnny Gentle in a tour of Scotland beginning in June. However, Beatles drummer Tommy Moore arrived late, forcing another drummer to sit in with the band. Parnes and Fury were also unimpressed with bassist Stuart Sutcliffe, and the Beatles were turned down for either spot.", "*Johnny Gentle - vocals"]}, {"page": "Alloa Town Hall", "response": ["The building continued to serve as the headquarters of Alloa Burgh Council throughout the first half of the 20th century but ceased to be the local seat of government when the council moved to Greenfield House at Mar Place in 1952. The building continued to be used as an events venue and the rock band, the Silver Beatles, performed at the town hall during a tour of Scotland as the backing group for the pop singer Johnny Gentle in May 1960. However, the organ was removed from the building and destroyed in January 1970. Queen Elizabeth II met civic officials at the town hall during a visit to the town to re-open the refurbished Alloa Tower in July 1997. A major programme of refurbishment works at the town hall, including redecoration and the upgrading of the heating system, was completed in summer 2011."]}, {"page": "Forres Town Hall", "response": ["The building was used as a British Red Cross hospital for wounded service personnel during the First World War and was then acquired by the burgh council for use as a town hall before being requisitioned for military use for the duration of the Second World War. After the war the building reverted to municipal use but also continued to be used as an events venue: the rock band, the Silver Beatles, performed at the town hall during a tour of Scotland as the backing group for the pop singer Johnny Gentle in May 1960. The building ceased to be local seat of government when the enlarged Moray District Council was formed in 1975. The local masonic lodge, Lodge St Lawrence, continued to use the building as its hall until 1984."]}]}}