{"wiki_id": "http://www.wikidata.org/entity/Q6261106", "itemLabel": "John Toye", "itemDescription": "Scottish television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Toye", "wikipedia_page": {"main": "John Toye (c. 1936 – 28 April 1992) was a presenter and newsreader on Scottish Television for over 20 years, and is best known as the former anchor on its flagship news programme Scotland Today.", "link_mentions": [{"page": "Scotland Today", "response": ["Based in Glasgow, the programme began on 11 September 1972 in a style very similar to its BBC counterpart Reporting Scotland and co-anchored by John Toye and Bill Kerr Elliot. At first, the programme was double headed, but within a year, Toye became its solo presenter and went on to present Scotland Today for 12 years. During the first six years, it was only on air for ten months of the year, taking a regular summer break and having its timeslot filled by regional magazine programmes including Isabel on... and Watch This Space. The programme's first editor was Russell Galbraith, then head of news for Scottish Television – he remained in the role until 1982.", "Following John Toye's departure, a major overhaul of Scotland Today saw the programme relaunched as a feature-led magazine programme on Monday 8 October 1984.Kelly gets his eye in, Gavin Docherty, Evening Times, 8 October 1984 New co-presenters Sheena McDonald and Haig Gordon presented on sofas as opposed to desks, with the main regional news of the day confined to short bulletins before and after the programme, co-presented from Glasgow and Edinburgh. The critics were harsh about the new format – one such newspaper critic described it as The Goon Show – it's Tom and Jerry time but there's not much to laugh at. The Independent Broadcasting Authority also criticised the changes to the programme, and in July 1986, the station's head of news David Scott announced Scotland Today would revert to a harder news format the following Autumn, promising in a newspaper: you won't see pot plants, sofas or sculptures – these are nothing but distractions.STV axes big names, Gavin Docherty, Evening Times, 3 July 1986 The new look programme, launched on Monday 20 October 1986, saw Haig Gordon replaced by former reporter Malcolm Wilson, while feature elements were moved to a new lunchtime programme, Live at One Thirty, which began a fortnight earlier.", "* John Toye (1972–1984)"]}, {"page": "Geoffrey Toye", "response": ["In 1940, Toye joined the staff of the BBC, in the American Liaison and Censorship Department. He was twice married, first in 1915 to the actress Doris Lytton,The Times, 27 February 1915, p. 1 and later to Dorothy Fleitman, with whom he had one son, John, who was an actor and then a long-time news anchor for Scottish Television; he took his own life in 1992.Obituary and report for John Toye, Herald 30 April 1992 and 30 May 1992 Toye's elder brother, Francis, was a well-known critic and Verdi scholar. Their sister Eleanor's daughter became a principal soprano with D'Oyly Carte under the name Jennifer Toye.Eleanor (born 1894) first married Joseph Remington Charter in 1923 and then Joseph Richard Bishop, with whom she had a son Francis Peregrine Bishop and a daughter Jennifer Gay Bishop. Jennifer was a principal soprano with D`Oyly Carte between 1954 and 1965, using her uncles' name, Toye, as her stage name. See, Stone, David. \"Jennifer Toye\". Who Was Who in the D'Oyly Carte Opera Company, 27 May 2004, accessed 25 August 2010"]}, {"page": "Toye", "response": ["*John Toye (c. 1936–1992), British presenter and newsreader", "*John Toye (economist) (1942-2021), British economist"]}, {"page": "Francis Toye", "response": ["Toye was born in Winchester, Hampshire, the eldest son of Arlingham James Toye and his wife Alice Fayrer née Coates.John Francis Toye.  Contemporary Authors Online, Gale Group, 2002, accessed 5 August 2010  His father was a schoolmaster at Winchester College who had a strong interest in music.The Times obituary, 16 October 1964, p. 15 Francis's younger brother was the composer and conductor Geoffrey Toye,Colles, H. C. and Andrew Porter. \"Toye, Francis\". Grove Music Online, Oxford Music Online, accessed 4 August 2010.  whose son was John, a long-time news anchor for Scottish Television,Obituary and report for John Toye, Herald 30 April 1992 and 30 May 1992 and his niece became a soprano with the D'Oyly Carte Opera Company under the name Jennifer Toye.Toye's younger sister, Eleanor, first married Joseph Remington Charter in 1923 and then Joseph Richard Bishop, with whom she had a son, Francis Peregrine Bishop, and a daughter, Jennifer Gay Bishop. Jennifer was a principal soprano with the D'Oyly Carte Opera Company between 1954 and 1965, using her uncles' name, Toye, as her stage name. See Stone, David. \"Jennifer Toye\". Who Was Who in the D'Oyly Carte Opera Company, 27 May 2004, accessed 25 August 2010"]}, {"page": "1992 in Scottish television", "response": ["*28 April – John Toye, journalist and presenter"]}, {"page": "Toye, John", "response": ["#redirectJohn Toye"]}]}}