{"wiki_id": "http://www.wikidata.org/entity/Q6264221", "itemLabel": "John William Mellor", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_William_Mellor", "wikipedia_page": {"main": "John William Mellor PC DL QC (26 July 1835 – 13 October 1911) was an English lawyer and Liberal Party politician.\nBorn in London, the eldest of the eight sons of Rt Hon. Sir John Mellor, of Otterhead, Devonshire, a Judge of the Queen's Bench Division of the High Court, Mellor was educated at Trinity Hall, Cambridge.In 1860 he married Caroline Paget, daughter of Charles Paget, MP.He became a barrister of the Inner Temple in 1860, a Queen's Counsel in 1875 and a Bencher in 1877. He was Recorder of Grantham from 1871 to 1874 and Judge Advocate General from February to August 1886. In 1878 Mellor was involved in the Whistler v Ruskin libel trial.\nHe was Liberal Member of Parliament for Grantham from 1880 to 1886 and for Sowerby, Yorkshire from 1892 until 1904, when he retired from Parliament. In Parliament, he was Chairman of Ways and Means & Deputy Speaker to Arthur Wellesley Peel from 1893 to 1895, and was a member of the Royal Commissions on Tweed and Solway Fisheries in 1896, on the Water Supply to London in 1897, and of the Committees of Royal Commission Patriotic Fund in 1898.\nHe was appointed a Privy Counsellor in 1886.", "link_mentions": [{"page": "List of Privy Counsellors (1837–1901)", "response": ["*John William Mellor (1835–1911)"]}, {"page": "Judge Advocate General of the Armed Forces", "response": ["*22 February 1886: John William Mellor"]}, {"page": "John Mellor", "response": ["* John William Mellor (1835–1911), English lawyer"]}, {"page": "Third Gladstone ministry", "response": ["| John William Mellor"]}, {"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| John William Mellor"]}, {"page": "Chairman of Ways and Means", "response": ["| John William Mellor"]}, {"page": "Grantham (UK Parliament constituency)", "response": ["| John William Mellor ||Liberal", "|John William Mellor||Liberal"]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["| John William Mellor"]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| John William Mellor"]}, {"page": "List of MPs elected in the 1900 United Kingdom general election", "response": ["| John William Mellor "]}, {"page": "List of United Kingdom by-elections (1900–1918)", "response": ["|John William Mellor"]}, {"page": "Sowerby (UK Parliament constituency)", "response": ["| John William Mellor"]}]}}