{"wiki_id": "http://www.wikidata.org/entity/Q6264008", "itemLabel": "John Wile", "itemDescription": "English footballer-manager (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Wile", "wikipedia_page": {"main": "John David Wile (born 9 March 1947) is an English former footballer and manager.\nWile played as a central defender for Sunderland, although he did not play a Football League match for them. In 1967–68 he signed for Peterborough United, having had a trial there first. He made 130 senior appearances for The Posh between 1967 and 1970.Wile then joined West Bromwich Albion in December 1970. He spent more than 12 years at Albion, and was club captain during and after Ron Atkinsons spell as manager. Wile made a total of 619 senior appearances for Albion.His most famous moment came when he played with blood pouring from a headwound during the 1978 FA Cup semi-final against Ipswich at Highbury. After leaving Albion in June 1983, Wile returned to Peterborough as player-manager after missing out on a similar post at Bolton Wanderers a year earlier. He later returned to West Bromwich as managing director, a position he occupied from 1997 through to 2002.\nIn 2004, he was named as one of West Bromwich Albion's 16 greatest players, in a poll organised as part of the club's 125th anniversary celebrations.", "link_mentions": [{"page": "Eric Clapton", "response": ["Clapton is a fan of English football club West Bromwich Albion. In 1982, he performed a concert before West Brom player John Wile's testimonial game at The Hawthorns. It has been reported that the club rejected his offer to invest cash in the club around this time. In the late 1970s Clapton positioned a West Brom scarf on the back cover of his album, Backless. In the 1978–79 season Clapton sponsored West Brom's UEFA Cup home game against Turkish club Galatasaray."]}, {"page": "Bryan Robson", "response": ["Johnny Giles left Albion at the end of 1976–77. His successor, the club's chief scout and former player Ronnie Allen, picked Robson to replace Giles in central midfield. However Allen himself left midway through the season and defender John Wile was put in temporary charge. Results worsened and Robson was dropped from the team.Robson (2007), pp. 33–34. He returned to the side under new boss Ron Atkinson, whom Robson described as \"a down-to-earth, fair-minded, regular bloke\". Atkinson did leave Robson out of the FA Cup semi-final defeat against Ipswich Town, but recalled him for the latter stages of the league campaign as Albion qualified for the UEFA Cup. In 1978–79 Robson was a key player, starting 41 out of 42 league games and wearing the number 7 shirt on each occasion. He played a major part in Albion finishing third in Division One, their highest league placing for more than 20 years, and reaching the UEFA Cup quarter-finals. The following season was a disappointing one by comparison, with the club finishing only 10th in the league, but Robson's performances in midfield helped to earn him his first full England cap in February 1980. In 1980–81 he scored ten goals in 40 league games to help Albion to a 4th-place finish in the First Division."]}, {"page": "Peterborough United F.C.", "response": ["|align=left| John Wile"]}, {"page": "Cyrille Regis", "response": ["Regis also scored in his first FA Cup match in January 1978, helping Albion to beat Blackpool 4–1. A few days later, Albion appointed a new manager, Ron Atkinson. Ronnie Allen had departed in late December to manage the Saudi Arabia national team and John Wile, the club's captain, had acted as caretaker manager in the interim."]}, {"page": "Battle of Bramall Lane", "response": ["Albion were awarded a 3–0 win and the three points by The Football League. The decision was unanimous, and Nagle said \"any other decision would be grossly unfair and set a precedent that would not be in the best interests of the game\". United were fined £10,000 by The Football Association, Santos was given a six-match ban (four, plus two for violent conduct), Suffo paid a £3,000 fine and received a six-match ban (three for the dismissal, three for violent conduct), and Keith Curle was made to pay a fine of £500 and received a two-match ban, while Warnock was made to pay £300 for \"improper conduct towards the fourth official\", but no evidence was found that either he or any player had made a deliberate attempt to have the match abandoned. Following the verdict, Albion chief executive John Wile said there was no \"bad blood\" between the clubs, and said the decision to award the points was correct. Following United's midweek victory against Millwall, Warnock expressed his displeasure regarding the reaction he had received in the media, saying, \"I thought in this country people are innocent until proven guilty, but some of the comments in the papers were out of order\", and said he and his family had endured an \"absolute bloody nightmare\"."]}, {"page": "Sherburn, County Durham", "response": ["Former Sunderland AFC, Peterborough United and West Bromwich Albion Centre-half John Wile was born in Sherburn"]}, {"page": "Brian Talbot", "response": ["A midfielder, Talbot began his football apprenticeship with Ipswich Town in 1968, during which he spent two seasons on loan with Canadian club Toronto Metros of the North American Soccer League,  turning professional in 1972. He made 227 appearances for Ipswich, and won the 1977–78 FA Cup with the club. In the semi-final against West Bromwich Albion, Talbot scored the first goal after seven minutes, but was injured in the act of scoring when he collided head-to-head with Albion's skipper, John Wile. Wile played with a bandaged head for the remainder of the contest while Talbot needed three stitches in a cut above the eye and was unable to continue. In 2013, Talbot was inducted into the Ipswich Town F.C. Hall of Fame."]}]}}