{"wiki_id": "http://www.wikidata.org/entity/Q6266774", "itemLabel": "Johnny Gordon", "itemDescription": "English footballer (1931-2001)", "wikipedia_url": "https://en.wikipedia.org/wiki/Johnny_Gordon", "wikipedia_page": {"main": "John Duncan Sinclair Gordon (11 September 1931 – 26 May 2001) was an English professional footballer who played for Portsmouth and Birmingham City in the First Division as an inside forward.He made a total of 489 appearances for home-town club Portsmouth, placing him fourth in their all-time appearances list. During his three seasons at Birmingham City he was the club's top scorer in 1959–60, became their all-time top goalscorer in European competition, and played in the 1960 Inter-Cities Fairs Cup Final against Barcelona. On his return to Portsmouth he helped them win the Third Division championship in 1961–62.", "link_mentions": [{"page": "Portsmouth F.C.", "response": ["|align=\"left\"|Johnny Gordon||||IF||1949–58/1961–67||—||489||106"]}, {"page": "John Gordon", "response": ["* Johnny Gordon (1931–2001), English football player who played mostly with Portsmouth and Birmingham City"]}, {"page": "List of Portsmouth F.C. seasons", "response": ["|Johnny GordonPeter Harris"]}, {"page": "1960 Inter-Cities Fairs Cup Final", "response": ["|IR||8|| Johnny Gordon", "Barcelona were two goals ahead after six minutes. The first came when Lluís Coll's corner was headed home by Eulogio Martínez, and a neat move was finished off by Zoltán Czibor who received a  lofted pass on the edge of the penalty area, swivelled, and shot home for the second. Despite numerous corners, there was no further score in the first half, and prompted by the \"tireless\" Johnny Gordon, Birmingham had attempted to combat Barcelona in midfield. But shortly after the interval, Barcelona attacked down the right and Martínez passed to Czibor whose second goal killed the game. Gordon Astall had two chances at goal, the former going wide and the latter being deflected in spectacular fashion by Ramallets, before another attack down the right flank allowed Martínez to feed Coll, whose \"fierce right-foot drive through a crowd of players\" gave Barcelona a four-goal lead. With little time left, Peter Murphy, making his last appearance for Birmingham, counter-attacked down the left and sent a long cross-field pass towards Hooper, whose mobility helped him beat Ramallets to the ball and score with a header.", "|IR||8|| Johnny Gordon"]}, {"page": "1961 Inter-Cities Fairs Cup Final", "response": ["Birmingham played Hungarians Újpesti Dózsa in the first round, with the first leg to be played at home. Újpest twice took the lead, equalised by a Johnny Gordon header and Gordon Astall's shot. Birmingham's repeated attacks broke down near goal, until after 83 minutes Gordon headed home an Astall corner. In the away leg, Újpest took a one-goal lead after an hour, that tied the scores on aggregate, before Gordon was sent off. This left Birmingham facing \"tough opposition and downright one-sided refereeing\" without their centre-forward. But Billy Rudd scored with three minutes left, then combined with debutant Ray Barlow in a \"walking-pace attack\" for Jimmy Singer to clinch the tie with a rising shot."]}]}}