{"wiki_id": "http://www.wikidata.org/entity/Q6262625", "itemLabel": "John Waddy", "itemDescription": "Special Air Service Colonel", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Waddy_(British_Army_officer)", "wikipedia_page": {"main": "Colonel John Llewellyn Waddy OBE (17 June 1920 – 27 September 2020) was a British Army officer who served during the Second World War, Palestine and the Malayan Emergency before becoming Colonel of the SAS.\nJoining the British Army shortly before the Second World War, he initially served with the Somerset Light Infantry in India. He subsequently volunteered for the Parachute Regiment and saw action in the Italian Campaign in late 1943. After returning to the United Kingdom with the 4th Parachute Brigade, part of the 1st Airborne Division, he took part in the Battle of Arnhem, where he was wounded and taken prisoner by German troops.\nAfter the war, Waddy remained in the army and saw action in the Mandatory Palestine and during the Malayan Emergency, for which he was mentioned in dispatches. He went on to hold a series of command posts with the Parachute Regiment, both at home and overseas, and was made an Officer of the Order of the British Empire in 1963. He was an early incumbent in the post of Colonel SAS and did much to expand the Special Air Service's role. He subsequently held a number of military advisor positions, most notably in Washington DC, Vietnam, and after resigning from the military, with Westland Helicopters and during the filming of the movie A Bridge Too Far.", "link_mentions": [{"page": "Battle of Arnhem", "response": ["The Allies' failure to secure a bridge over the Lower Rhine spelled the end of Market Garden. While all other objectives had been achieved, the failure to secure the Arnhem road bridge over the Rhine meant that the operation failed in its ultimate objective. Montgomery claimed that the operation was 90 per cent successful and the Allies had driven a deep salient into German-occupied territory that was quickly reinforced.Ryan, p.537 Milton Shulman observed that the operation had driven a wedge into the German positions, isolating the 15th Army north of Antwerp from the First Parachute Army on the eastern side of the bulge. This complicated the supply problem of the 15th Army and removed the chance of the Germans being able to assemble enough troops for a serious counter-attack to retake Antwerp.Shulman, p.210 Chester Wilmot agreed with this, claiming that the salient was of immense tactical value for the purpose of driving the Germans from the area south of the Maas and removing the threat of an immediate counterattack against Antwerp.Wilmot, p.523 Kershaw wrote that the north flank of the west wall was not turned and the 15th Army was able to escape. John Warren wrote that the Allies controlled a salient leading nowhere.Ryan, p.532 John Waddy wrote that the strategic and tactical debate of Market Garden will never be resolved.Waddy, p.9", "In 1945, Louis Hagen, a Jewish refugee from Germany and a British army glider pilot present at the battle, wrote Arnhem Lift, believed to be the first book published about the events at Arnhem. In the same year filming began for the war movie Theirs is the Glory, which featured some original footage and used 120 Arnhem veterans as extras in most of the other scenes. In 1974 Cornelius Ryan's book A Bridge Too Far, brought the battle to a wider audience,Frost, p.251 as did Richard Attenborough's adaptation of the book into the film of the same name in 1977. Frost, Urquhart and Arnhem veteran John Waddy were hired as military consultants.Goldman"]}, {"page": "1920 in the United Kingdom", "response": ["** John Waddy, British Army colonel (died 2020)"]}, {"page": "Somerset Light Infantry", "response": ["The 1st Battalion, Somerset Light Infantry, commanded by Lieutenant Colonel John Harding, was stationed in British India at the outbreak of war and would remain in the Far East throughout the conflict. The battalion fought in the Burma Campaign with the 114th Indian Infantry Brigade which was part of the 7th Indian Infantry Division, itself part of the British Fourteenth Army, led by Bill Slim. John Waddy served with the battalion in the early stages of the war."]}, {"page": "Stalag VII-A", "response": ["* John Waddy"]}, {"page": "Director Special Forces", "response": ["* 1964–1967 Colonel John Waddy (late Parachute Regiment)*"]}, {"page": "List of former Parachute Regiment personnel", "response": ["* John Waddy Ex commander SAS, advisor on the film A Bridge Too Far."]}, {"page": "John Waddy", "response": ["John Waddy may refer to:", "*John Waddy (British Army officer) (1920–2020), officer in the Parachute Regiment during the Second World War, who later became Colonel SAS"]}, {"page": "John Llewellyn Waddy", "response": ["#REDIRECT John Waddy (British Army officer)"]}, {"page": "Richard Lonsdale", "response": ["Lonsdale was promoted to the rank of lieutenant only a month before the outbreak of war. He occasionally held the rank of acting or temporary captain over the next few years before he volunteered for the Parachute Regiment in 1941. Like John Waddy he was a founding member of 151st Parachute Battalion of the Parachute Regiment in India, and remained with the battalion when it transferred to North Africa. In July 1943 he was transferred and made the commanding officer of A Company, 2nd Battalion, Parachute Regiment, part of the 1st Parachute Brigade.Frost, p. 171"]}]}}