{"wiki_id": "http://www.wikidata.org/entity/Q6261365", "itemLabel": "John Tudor", "itemDescription": "English footballer (born 1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Tudor_(footballer)", "wikipedia_page": {"main": "John Tudor (born 25 June 1946) is an English former footballer who played for Coventry City, Newcastle United, Sheffield United and Stoke City.", "link_mentions": [{"page": "Kevin Keegan", "response": ["In the 1974 final, Liverpool played Newcastle United. Keegan explained that Shankly's motivation was made easy after the pre-game talking by Supermac (Malcolm Macdonald) and to a lesser extent John Tudor. Tudor and Keegan's friend, Macdonald, gave interviews confidently proclaiming they had more ability whilst also being critical of older Liverpool pros such as Tommy Smith. Keegan also believed Shankly may have got into the heads of the Newcastle players when on the night before the game Shankly and Joe Harvey were being interviewed and Shankly was heard on the microphone, but off-camera, stating, \"Joe looks a bag of nerves...\" Keegan explained, knowing Shankly it would not surprise him if this was not an accident and Shankly knew what he was doing and that this statement was meant to neutralise any of Newcastle's confidence and that this did indeed rub off into the heads of some of the Newcastle players who became anxious. In the final, Keegan scored two as Liverpool beat Newcastle United 3–0. It was the first brace in an FA Cup final since Mike Trebilcock scored twice for Everton in 1966. The game against Newcastle was Keegan's first FA Cup Final. To Keegan, with the 100,000 inside the ground, the non-stop chanting of both sets of fans, and then the millions watching on TV, this game was as close to a non drug-induced psychedelic experience as he could ever get. He noted how after this final Shankly, he and the other Liverpool players were sympathetic to the devastated Newcastle players and tried to not rub it in with their victory."]}, {"page": "Tudor (name)", "response": ["*John Tudor (footballer), an English football (soccer) player", "*John Tudor (baseball), an American baseball player"]}, {"page": "Joe Harvey", "response": ["The last player Harvey signed at this time was John Tudor who was signed for a bargain £888 from Sheffield United and he proved to be an outstanding strike partner for Malcolm Macdonald. With the new look side in place, Newcastle finished 11th in 1971–72. For 1972–1973 Harvey again used Newcastle's excellent youth system and brought through young fullbacks Alan Kennedy and Irving Nattrass. Newcastle improved and finished eighth, just missing out on qualifying for the UEFA Cup. Tony Green was forced to retire at just 26 because of constant knee injuries and Harvey used the compensation money Newcastle got to sign his replacement Terry McDermott from Bury."]}, {"page": "List of Newcastle United F.C. players", "response": ["|align=\"left\"|John Tudor||||FW||1970–1977||164||53||"]}, {"page": "List of Sheffield United F.C. seasons", "response": ["|John Tudor"]}, {"page": "Tony Green (footballer)", "response": ["In the month of his 25th birthday, October 1971\"Tony Green\", Sporting Heroes after him putting in a transfer request, Newcastle United took Blackpool's Scottish internationalist back to England's top tier. Newcastle made a £150,000 offer in a part-exchange deal involving Keith Dyson. Green became Newcastle's second most expensive signing, after Malcolm Macdonald who had signed in May the same year from Luton Town for £180,000. Green's debut was away at Everton\"Newcastle United Tony Green\" Replay Football on 30 October 1971. The 1–0 defeat put Newcastle bottom of England's top tier at that time after what had been their fifth consecutive defeat. Green scored though in the next game, a 3–1 home win against Southampton. Newcastle's revival for that season was under way to start an unbeaten run of five wins and two draws. The Geordies climbed the table to finish eleventh.\"Newcastle United Results Fixtures 1971/1972\" football.co.uk Macdonald with 30 goals from 52 games was the primary beneficiary of the team's attacking skills. Green was the brains and drive of the team. In a 2–0 victory at Manchester United, Green was instrumental in creating both goals. The first was a precision chip over a defender to release Stewart Barrowclough to centre for John Tudor to score. The second was a box to box solo run that left George Best on the deck in Green's wake. Green crossed for Barrowclough to score.\"12/02/1972 Manchester United v Newcastle United\" youtube.com"]}, {"page": "1974 FA Cup Final", "response": ["|ST ||10|| John Tudor"]}, {"page": "Hereford United 2–1 Newcastle United", "response": ["With St James' Park open on only three sides, due to the ongoing construction of the East Stand, the match kicked off and Hereford took a shock lead after 17 seconds. They had won a free kick straight from the kickoff, which was quickly lofted into the Newcastle box. Brian Owen ran around the Newcastle defence onto the end of the free kick, and put the ball past Willie McFaul to give Hereford a dream start. Newcastle quickly went 2–1 after 13 minutes of play thanks to goals from Malcolm Macdonald and John Tudor. But then Hereford player-manager Colin Addison equalised with a 25-yard shot and the match finished 2–2, in front of 39,301 spectators.", "|FW ||10|| John Tudor"]}, {"page": "1969–70 Football League", "response": ["|32||align=left|  John Tudor ||align=left| Sheffield United ||10||2||0||—||12"]}, {"page": "1970–71 Football League", "response": ["|26||align=left|  John Tudor ||align=left| Newcastle United / Sheffield United ||5 + 9||0||0||—||0||14"]}, {"page": "John Tudor", "response": ["John Tudor may refer to:", "*John Tudor (minister) (1930–2009), English Methodist minister", "*John Tudor (footballer) (born 1946), English former player for several teams, most notably Newcastle United", "*John Tudor (baseball) (born 1954), American former pitcher in Major League Baseball", "*John Tudor (cyclist) (born 1953), Welsh racing cyclist"]}, {"page": "1976–77 Stoke City F.C. season", "response": ["The Stoke fans were totally confused at what was happening to their team and looked for someone to blame. Goals were again in short supply, Stoke failed to find the back of the net for five successive league matches from late November to early January and in fact they managed just 28 goals all season, 21 at home and seven away. Waddington's gambles on experienced player like John Tudor and Alan Suddick were not successful and after an awful defeat at home to Leicester City on 19 March 1977 Waddington's time at Stoke City was up. He had spent 25 years at the Victoria Ground as manager, assistant and coach and is considered to be the club's greatest manager having helped them win their first major trophy in 1972. He remained an avid supporter of the club until his death in 1994.", "|align=\"left\"|MF||align=\"left\"| John Tudor"]}, {"page": "List of Coventry City F.C. seasons", "response": ["|align=left| Ernie Hunt John Tudor"]}, {"page": "1970–71 Football League First Division", "response": ["|26||align=left|  John Tudor ||align=left| Newcastle United / Sheffield United ||5 + 9||0||0||—||0||14"]}, {"page": "1972–73 Football League First Division", "response": ["|align=center| =|| John Tudor || Newcastle United ||align=center| 18"]}, {"page": "1973–74 Liverpool F.C. season", "response": ["|ST ||10|| John Tudor"]}, {"page": "John Hope (footballer)", "response": ["In January 1971, Sheffield United exchanged striker John Tudor for Hope and forward David Ford. Hope went straight into the starting eleven, replacing former England international goalkeeper Alan Hodgkinson. Of his home debut, in a 2–1 defeat of Luton Town on 6 February, the Guardian correspondent wrote that he made some fine saves but \"had a lot on his plate following the popular and long-serving Hodgkinson\". He kept his place as Sheffield United went on to clinch promotion to the First Division at the end of the season, with a run of results that included seven consecutive clean sheets, a club record that stood until beaten by Mark Howard more than 40 years later. According to teammate Tony Currie, Hope \"was a top line player who, like everyone else made a couple of mistakes, but because of his position they were highlighted more than the rest of us. John, though, had the heart of a lion. He was one of the bravest I've ever seen.\""]}]}}