{"wiki_id": "http://www.wikidata.org/entity/Q6266979", "itemLabel": "Johnny Johnson", "itemDescription": "British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Johnny_Johnson_(British_Army_officer)", "wikipedia_page": {"main": "Alexander Percival Johnson DSO (died 12 June 1944, aged 32), known as Johnny Johnson, was a British Army officer.\nJohnson was originally commissioned into the Suffolk Regiment in the 1930s. During World War II he became Commanding officer of the 12th (Yorkshire) Battalion of the Parachute Regiment, serving as part of 5th Parachute Brigade of the 6th Airborne Division, during the Battle of Normandy. He and his division parachuted into Normandy in the early morning of 6 June 1944 as part of Operation Tonga. The 12th Battalion formed a defensive line south of the bridge at Ranville. On 6 and 7 June, the battalion defended the bridgehead against attacks by the German 21st Panzer Division moving north from Caen. Many casualties were caused by heavy fire from enemy machine guns, mortars, artillery, self-propelled guns, and tanks. For his leadership during this defensive stand, Johnson was posthumously awarded the Distinguished Service Order.\nIn the afternoon of 12 June, Lieutenant Colonel Johnson was ordered to hastily prepare his battalion for an attack on the village of Bréville (currently named Bréville-les-Monts). At 21:45, the battalion assembled on the start line near Amfréville and an artillery barrage on enemy positions near Bréville began. Lieutenant Colonel Johnson was conferring with a group of senior officers when he was killed by a stray artillery round. Also wounded by the blast were Brigadier Hugh Kindersley and Colonel Reginald Parker of 6th Airlanding Brigade and Brigadier The Lord Lovat of 1st Special Service Brigade.\n\n", "link_mentions": [{"page": "5th Parachute Brigade (United Kingdom)", "response": ["At the same time, the 3rd Parachute Brigade, supported by the 5th Battalion, Black Watch from the 51st (Highland) Division, were attempting to capture Breville, the only German held village on the high ground overlooking the British positions.Harclerode, pp.330–331 By 12 June Breville was still in German hands, and Gale decided on one more attack, this time at night. This would be carried out by his only reserves; the 12th Parachute Battalion, now only 350 men strong, supported by the pathfinder company, a company from the 12th Devonshire Regiment, and a squadron of tanks from the 13th/18th Hussars. The attack would be supported by artillery fire from five regiments of artillery. The assault started at 22:00, and after fighting throughout the night the village was eventually captured. British casualties were heavy; the 12th Parachute Battalion lost 141 men, the Devons another 35.Saunders, p.188 The 12th Parachute Battalion was now reduced to only 55 men in its three rifle companies, plus the Headquarters Company. Some casualties were victims of the British artillery falling short. These included the 12th Parachute Battalion's commanding officer, Lieutenant Colonel Johnny Johnson, who was killed. The same shell wounded Brigadiers Hugh Kindersley of the airlanding brigade and Lord Lovat of the commandos.Harclerode, pp.343–347 The next day, 13 June, the  51st (Highland) Infantry Division crossed the waterways and took over the defence of the southern sector from the airlanding brigade.Harclerode, p.347 This, and the assignment of the 4th Special Service Brigade to the division, allowed one brigade at a time to go into reserve to rest. The first brigade withdrawn was the 3rd, and the 5th Parachute Brigade took over their positions on the ridge of high ground, between the 1st Special Service Brigade in the north and the Highland Division in the south.Harclerode, p.348"]}, {"page": "Johnny Johnson", "response": ["Johnny Johnson may refer to:", "* Johnny Johnson (baseball) (1914–1991), Major League pitcher", "* Johnny Johnson (footballer) (1921–2003), British footballer", "* Johnny Johnson (American football) (born 1968), American football player", "* Johnny Johnson (British Army officer) (died 1944), British Army officer", "* Johnny Johnson (RAF officer) (born 1921), last survivor of Operation Chastise", "* Johnny Johnson (musical), a 1936 musical by Kurt Weill", "* Johnny Johnson (philatelist) (1884–1966), British stamp dealer and philatelist", "* Johnny Johnson, headliner of Johnny Johnson and the Bandwagon", "* Johnny Johnson, a character on NewsRadio played by Patrick Warburton"]}, {"page": "Anthony Percival Johnson", "response": ["#REDIRECT Johnny Johnson (British Army officer)"]}, {"page": "Index of World War II articles (J)", "response": ["# Johnny Johnson (British Army officer)"]}, {"page": "12th (Yorkshire) Parachute Battalion", "response": ["On 6 June 1944, the 12th Parachute Battalion, under the command of Lieutenant Colonel Johnny Johnson, landed in Normandy at 00:50. The battalion was first tasked with securing the village of Le Bas de Ranville, despite the battalions' drop being heavily dispersed (only two thirds could be accounted for), the village was secured by 04:00 and the battalion began digging in around the village. The 12th held their ground until relieved by elements of the 3rd British Infantry Division advancing from the beaches. During this time the 12th Parachute Battalion was bombarded with heavy mortar and artillery fire, and repelled two German counter-attacks by the 125th Panzer Grenadier Regiment; the first was defeated after destroying a Tiger tank and taking a number of prisoners, and the second was repulsed with the help of an air-landed anti-tank battery which had recently arrived. The battalion then relieved the Glider-borne infantry of the 2nd Battalion, Ox and Bucks Light Infantry at the River Orne and Caen canal bridges."]}, {"page": "Battle of Bréville", "response": ["Lieutenant Colonel Johnny Johnson of the 12th Parachute Battalion was in command of the assault. He decided his own 'C' Company would secure the first crossroads; then the Devonshire company would then the north of the village. At the same time 'A' Company would advance through 'C' Company and secure the south-east. At the rear would be 'B' Company, the battalion reserve. The attack had to cross  of open ground to reach the village. To support the assault and destroy a German position  from the start line, a troop of Sherman tanks would accompany them."]}]}}