{"wiki_id": "http://www.wikidata.org/entity/Q6260753", "itemLabel": "John Thornton Down", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Thornton_Down", "wikipedia_page": {"main": "John Thornton Down VC (2 March 1842 – 27 April 1866) was a British Army officer and a recipient of the Victoria Cross, the highest award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.", "link_mentions": [{"page": "Second Taranaki War", "response": ["On 2 October a large force of the 57th Regiment, Volunteers and militia engaged Māori near Poutoko Redoubt, Omata, 9 km south of New Plymouth. Victoria Crosses were awarded to two members of the 57th, Ensign John Thornton Down and Drummer Dudley Stagpoole, for bravery during the battle.Victoria Cross winners, New Zealand Wars, Teara 1966 Encyclopedia of New ZealandBirkenhead Returned Services Association website"]}, {"page": "List of English Victoria Cross recipients", "response": ["|John Thornton Down || British Army || 1863 || New Zealand Wars || Poutoko"]}, {"page": "Dudley Stagpoole", "response": ["Stagpoole was about 25 years old, and a Drummer in the 57th Regiment of Foot (later The Middlesex Regiment (Duke of Cambridge's Own), during the Second Taranaki War campaign of the New Zealand Wars when the following deed took place on 2 October 1863 at Allan's Hill near Poutoko in Taranaki, for which he and Ensign John Thornton Down were awarded the VC,In the Face of the Enemy by Glyn Harper and Colin Richardson p. 36 (2006, Auckland, HarperCollins)  and a separate incident at Kaipakopako for which he was awarded the Distinguished Conduct Medal:"]}, {"page": "57th (West Middlesex) Regiment of Foot", "response": ["The regiment traveled to New South Wales in detachments as escorts to prisoners in 1824.Warre, p. 73 It moved on to India in 1830Warre, p. 76 and, while there, helped to suppress a rebellion in Mangalore in 1837.Warre, p. 82 The regiment did not embark for home until April 1846.Warre, p. 95 In September 1854 the regiment embarked for service in the Crimean War:Warre, p. 115 it fought at the Battle of Inkerman in November 1854Warre, p. 118 and the Siege of Sevastapol in winter 1854.Warre, p. 121 It moved to Malta in June 1856Warre, p. 139 and then sailed for India to help suppress the Indian Rebellion in May 1858.Warre, p. 145 It then sailed for Auckland in New Zealand in November 1860 for service in the New Zealand Wars.Warre, p. 156 Ensign John Thornton Down and Drummer Dudley Stagpoole were both awarded the Victoria Cross for their actions during a skirmish at Allen's Hill near Omata in October 1863 during the Second Taranaki War.Warre, p. 179 The regiment returned to England in 1867Warre, p. 202 and then moved to Ceylon in 1873.Warre, p. 220 From Ceylon it sailed to South Africa in 1879 for service in the Anglo-Zulu War.", "* Ensign John Thornton Down, New Zealand Wars (2 October 1863)"]}, {"page": "John T. Down", "response": ["#REDIRECT John Thornton Down"]}, {"page": "Down (surname)", "response": ["*John Thornton Down (1842–1866), British Army officer"]}, {"page": "List of people from the London Borough of Hammersmith and Fulham", "response": ["* John Thornton Down, British Army officer, born in Fulham."]}]}}