{"wiki_id": "http://www.wikidata.org/entity/Q6276564", "itemLabel": "Jordan Goddard", "itemDescription": "Footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jordan_Goddard", "wikipedia_page": {"main": "Jordan Calum Goddard (born 9 September 1993) is an association footballer who plays as a midfielder for Nuneaton Borough.", "link_mentions": [{"page": "Jordan (name)", "response": ["*Jordan Goddard, English footballer"]}, {"page": "Goddard (surname)", "response": ["* Jordan Goddard (born 1993), English footballer"]}, {"page": "2011–12 Bristol Rovers F.C. season", "response": ["| Jordan Goddard", "|align=\"left\"|35||align=\"left\"|MF||align=\"left\"| Jordan Goddard"]}, {"page": "2012–13 Bristol Rovers F.C. season", "response": ["*  – Ellis Harrison, Mitch Harding, Jordan Goddard and Ross Staley were all awarded professional contracts.", "*  – Midfielder Jordan Goddard and forward Mitch Harding join Gloucester City on loan for one month.", "*  – Jordan Goddard & Mitch Harding extend their loan deals with Gloucester City for another month.", "| Jordan Goddard", "|Jordan Goddard"]}, {"page": "Mitch Harding", "response": ["Harding, along with teammate Jordan Goddard, joined Gloucester City on an initial month's loan in October 2012. and went on to score less than a minute into his debut, a 5–1 victory over Bishop's Stortford. Harding's loan was extended for a second month but returned early. He went on to feature five times for Bristol Rovers, all as a substitute, in the remainder of the season."]}, {"page": "2013–14 Bristol Rovers F.C. season", "response": ["*  – Midfielders Fabian Broghammer and Jordan Goddard agreed new one-year contracts.", "*  – Jordan Goddard joined Gloucester City on loan for one month.", "*  – Rovers' retained list confirmed that 12 players, Fabian Broghammer, David Clarkson, Seanan Clucas, Steven Gillespie, Jordan Goddard, Conor Gough, Mitch Harding, Pat Keary, Jim Paterson, Eliot Richards, Josh Southway and Danny Woodards, were to be released on completion of their contracts. Ellis Harrison was placed on the transfer list. Lee Brown and Alefe Santos were offered new contracts and Michael Smith was offered a contract extension.", "| Jordan Goddard", "|Jordan Goddard", "|Jordan Goddard"]}]}}