{"wiki_id": "http://www.wikidata.org/entity/Q6273697", "itemLabel": "Jonathan Lewis", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Lewis_(motorsport)", "wikipedia_page": {"main": "Jonathan Lewis is known for his long career in motorsport management where during the 1980s he was the championship winning works Van Diemen FF1600 Formula Ford team boss. Lewis has made regular appearances on television throughout his career including on BBC2 Top Gear motoring programme where he ran presenter Richard Hammond in a Comtec Racing Formula Renault racing car then later a Renault R25 Formula One racing car.\nLewis's early career on the Yorkshire grass tracks set him on course to winning the National Mini Se7en Championship at the age of 19, as well as stints with the Monoposto Racing Club. After moving into team management, he headed the works Van Diemen Formula Ford team before forming Comtec Racing. In 2006, headed by Lewis, Comtec Racing won the World Series by Renault Championship, with the driver Alx Danielsson. Since the works Van Diemen FF1600 racing team dissolved, as new team owner Lewis took responsibility for the newly christened Comtec Racing operation with partner Pierre Moncheur and had the former Formula One driver Martin Donnelly as driver development manager among his other staff.\nLewis also had stints entering single seater racing drivers in Formula Vauxhall Lotus, Vauxhall Junior and, in the early 1990s, Formula Three with Jim Lee Racing based at the Yorkshire team's then headquarters in Batley near Harrogate, North Yorkshire, where the Lewis family lived at the time.\nIn 2006, Comtec Racing competed in the World Series by Renault, while also still remaining in the Formula Renault 2.0 Eurocup and returning to the British Formula Renault Championship after an absence of one year. Comtec Racing went on to win the Drivers Championship at their first attempt.\nLewis diversified into Formula 2 Power Boat Racing and he himself appeared in the No.9 boat for the Red Devil Honda Formula 4-Stroke Power Boat racing team on 24 May 2008 as the driver of a 225 hp racing boat in the Formula 4-Stroke Association event.Now semi-retired, Lewis is still involved in motorsport with Formula One stock cars. He now runs Snetterton Speed Shop, winning the Master Championship in the Mini classic class in 2015. He resides in Attleborough, Norfolk.\n\n", "link_mentions": [{"page": "Comtec Racing", "response": ["Comtec has had a successful period in single seater club racing. Former team owner Jonathan Lewis won the 2003 and 2004 Monoposto 2000 series and also the 2003 Formula 4 Championship. His brother Chris Lewis won the Formula 4 Championship in 2006.", "|  Jonathan Lewis", "|  Jonathan Lewis", "|  Jonathan Lewis", "|  Jonathan Lewis"]}, {"page": "Jonathan Lewis", "response": ["Jonathan Lewis may refer to:", "*Jonathan Lewis (artist) (born 1970), visual artist", "*Jonathan Lewis (American football) (born 1984), American football player", "*Jonathan Lewis (soccer) (born 1997), American soccer player", "*Jonathan Lewis (motorsport), driver and manager", "*Jonathan Lewis (oncologist) (born 1959), oncologist and cancer drug developer", "*Jonathan Lewis (died c. 1820), alleged murderer of Omie Wise"]}, {"page": "Jonathan Lewis (Motor Sport)", "response": ["#REDIRECT Jonathan Lewis (motorsport)"]}]}}