{"wiki_id": "http://www.wikidata.org/entity/Q6274783", "itemLabel": "Jonathan Willcocks", "itemDescription": "English composer and conductor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Willcocks", "wikipedia_page": {"main": "Jonathan Willcocks (born 9 January 1953) is an English composer and conductor.\nWillcocks was born in Worcester, the son of conductor and composer Sir David Willcocks. He was a chorister at King's College, Cambridge, and an Open Music Scholar at Clifton College. He graduated with an Honours degree in Music from the University of Cambridge in 1974, where he held a choral scholarship at Trinity College. He served as director of music at Portsmouth Grammar School (1975–78) and Bedales School, Petersfield (1978–89).He is conductor and musical director of Guildford Choral Society and Chichester Singers, and of the professional chamber orchestra Southern Pro Musica. From 1998 to 2008 he was the director of the Junior Academy, Royal Academy of Music in London. In 2016, Willcocks was appointed Festival Conductor of the Leith Hill Musical Festival, the 5th since Ralph Vaughan Williams and succeeding Brian Kay who held the post for 21 years.", "link_mentions": [{"page": "Battle of Trafalgar", "response": ["* Jonathan Willcocks composed a major choral work, A Great and Glorious Victory, to mark the bicentenary of the battle in October 2005."]}, {"page": "Dorking", "response": ["The three-day Leith Hill Musical Festival for local, amateur choral societies, founded in 1905, takes place at the Dorking Halls each year. Ralph Vaughan Williams was the Festival Conductor until 1953, a post currently held by Jonathan Willcocks."]}, {"page": "Epsom", "response": ["Epsom Choral Society was founded in 1922 by the publisher, Humphrey Milford. His son, the composer Robin Milford was the first conductor. The choir has commissioned  works from the British composers Cecilia McDowall and Jonathan Willcocks. Epsom Symphony Orchestra for amateur musicians was founded in 1951 and gives four concerts each year at the Epsom Playhouse."]}, {"page": "David Willcocks", "response": ["During the Second World War (1939–1945) he served as an officer in the British Army, and was decorated with the Military Cross for his actions on Hill 112 during the Battle of Normandy in July 1944. His elder son, Jonathan Willcocks, is also a composer."]}, {"page": "List of University of Cambridge people", "response": ["*Jonathan Willcocks (Trinity)"]}, {"page": "Burman University", "response": ["Burman University's music department was founded in 1949, but music has been a part of the university since the beginning.  Perlie Park Adams taught the first choir, in 1910.  The current choir was named the Choral Union in 1977, under the leadership of current director Wendolin Pazitka-Munroe.  The choir was given that name because it consisted of both university students and students from Parkview Adventist Academy.  The Choral Union is highly acclaimed, and has sung across Europe, 47 of the 50 United States, Latin America, and China.  They have also sung at Carnegie Hall on three occasions, sung for the Premier of Alberta on three occasions, sung with the Lions Gate Sinfonia, and have collaborated with John Rutter and Jonathan Willcocks.  The membership of the choir fluctuates between 100 and 120 singers each year.  This article describes the time when John Rutter conducted the CUC singers at Carnegie Hall, for a performance of his Requiem."]}, {"page": "Choir of King's College, Cambridge", "response": ["* Jonathan Willcocks (chorister) – composer and conductor."]}, {"page": "Willcocks", "response": ["*Jonathan Willcocks,  British composer"]}, {"page": "Consider the Lilies", "response": ["#\"O Holy Jesus\" (Jonathan Willcocks) - 3:36"]}, {"page": "List of Old Cliftonians", "response": ["* Jonathan Willcocks, composer"]}, {"page": "List of people associated with the Royal Academy of Music", "response": ["* Jonathan Willcocks (1996)"]}, {"page": "Bath Bach Choir", "response": ["The first president of the CBBC was Dr Ralph Vaughan Williams OM until 1958. Sir Arthur Bliss CH KCVO KT, then Master of the Queen's Music (Musik), took over as president in 1959, followed in 1975 by Sir David Willcocks CBE MC, until 2015. In 2016 David Hill (choral director) MBE, musical director of The Bach Choir was elected president of Bath Bach Choir, and Jonathan Willcocks a vice president.", "!colspan=\"3\" |Jonathan Willcocks, is appointed choir Vice President", "|Samuel Scheidt, David Willcocks, Hafliði Hallgrímsson, J S Bach, John Rutter, Reginald Jacques, Richard Rodney Bennett, Ian Pillow; Mary George, Bernard Wight, Jonathan Willcocks, John Kirkpatrick, Harker, Herbert Sumsion, James McKelvy, James Pierpont, Robin Benton, Irving Berlin, Peter Garland, Andy Razaf, Scott Walker", "|Carols by Candlelight – 69th Season. A child is born in Bethlehem, Samuel Scheidt arr Willcocks; Sussex carol, English trad arr Willcocks; Joseph and the Angel, Haflidi Hallgrimmson; O little one sweet, J S Bach; In dulci jubilo, Old German carol arr Rutter; Audience: O come, O come, Emanuel, arr Willcocks; Audience: Good King Wenceslas, Piae Cantiones arr Reginald Jaques; Out of your sleep, Richard Rodney Bennett; The Oxen,Thomas Hardy/Ian Pillow; This Glorious Day, Mary George/Bernard Wight; In excelsis, Jonathan Willcocks; Tomorrow shall be my dancing day, English trad arr Willcocks; Away in a manger, Kirkpatrick arr Harker; I wonder as I wander, Appalachian carol arr Rutter; Lord of the dance, Shaker song arr Willcocks; Audience: Joy to the World, arr Herbert Sumsion; Audience: Birthday Carol, words & music David Willcocks; Deck the halls, arr James McKelvy; Jingle bells!, J.Pierpont arr Robin Benton; I'm dreaming of a white Christmas, Irving Berlin arr JB; In the Christmas Mood, Garland & Razaf arr Walker/Wight; 12 days of Christmas, trad arr John Rutter.", "|Marion Wood, Henry Purcell, Jonathan Willcocks, Eric Whitacre, Howard Goodall, Leonard Bernstein, Vaughan Williams"]}, {"page": "The Really Big Chorus", "response": ["2014 was the 40th anniversary of The Really Big Chorus, and another choral work was commissioned, this time from the composer Jonathan Willcocks (son of Sir David, mentioned above). The work, entitled In Praise of Singing (for soprano and baritone soloists, chorus and symphony orchestra) was commissioned by Don Monro and will receive its first performance on 13 July 2014. Sadly, Don Monro will not hear it, as he died on 25 May 2014 after a year-long battle with cancer."]}, {"page": "Leith Hill Musical Festival", "response": ["The Leith Hill Musical Festival (LHMF) was founded in 1905 by Margaret Vaughan Williams, sister of the composer Ralph Vaughan Williams, and Lady (Evangeline) Farrer, wife of Lord Farrer of Abinger Hall. Ralph Vaughan Williams was the festival conductor from 1905 to 1953. The present festival conductor is Jonathan Willcocks (appointed in June 2016).", "# Jonathan Willcocks      -  2016–"]}, {"page": "Willcocks, Jonathan", "response": ["#redirectJonathan Willcocks"]}]}}