{"wiki_id": "http://www.wikidata.org/entity/Q6272772", "itemLabel": "Jonathan Clark", "itemDescription": "Bishop of Croydon", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Clark_(bishop)", "wikipedia_page": {"main": "Jonathan Dunnett Clark  (born 1961) is a Church of England bishop. He is the current area Bishop of Croydon. An Anglo-Catholic, he was rector general of the Society of Catholic Priests from 2005 to 2008 and chair of Affirming Catholicism from 2008 to 2012\n\n", "link_mentions": [{"page": "Affirming Catholicism", "response": ["*2008–2012: Jonathan Clark"]}, {"page": "Trinity College, Bristol", "response": ["*Jonathan Clark - Bishop of Croydon."]}, {"page": "Alleyn's School", "response": ["* Jonathan Clark (bishop)"]}, {"page": "Anglican Diocese of Southwark", "response": ["Alongside the diocesan Bishop of Southwark (Christopher Chessun), the diocese has three area (suffragan) bishops: Richard Cheetham, area Bishop of Kingston; Jonathan Clark, area Bishop of Croydon; and Karowei Dorgu, area Bishop of Woolwich. Since 1994 the Bishop of Fulham (currently Jonathan Baker, since 2013) has provided 'alternative episcopal oversight' in the diocese (along with those of London and Rochester) to those parishes which do not the ordination of women to the priesthood. Baker is licensed as an honorary assistant bishop in Southwark diocese in order to facilitate his ministry there."]}, {"page": "Bishop of Croydon", "response": ["The Episcopal area was historically in the Diocese of Canterbury, as the Archbishop of Canterbury lived at Croydon Palace and Addington Palace when he did not live at Lambeth Palace or other episcopal residences, from their medieval construction until the 19th century. On 21 March 2012, Jonathan Clark was consecrated as bishop, and took up his post as Area Bishop of Croydon in May 2012.", "|align=center| 2012 ||align=center| present ||Jonathan Clark  ||(b. 1961). Consecrated on 21 March 2012."]}, {"page": "Society of Catholic Priests", "response": ["*Jonathan Clark (2005–2008)"]}, {"page": "Bishop of the Falkland Islands", "response": ["Until well into the twentieth century, the Bishop of the Falkland Islands had episcopal authority over the whole of South America, until power shifted to the Bishop of Argentina. In 1982 as a result of the Falklands War, the Argentinian episcopal authority over the Falkland Islands was abolished; today the Rector of the Cathedral reports directly to the Archbishop of Canterbury and receives pastoral guidance from the Archbishop's Commissary, who since September 2021 has been Jonathan Clark, Bishop of Croydon.Church Times, 24 September 2021 — UK news in brief (Accessed 29 September 2021) The Archbishop retains the title Bishop of the Falkland Islands, while his Commissary takes the title Bishop for the Falkland Islands.", "| Jonathan Clark, Archbishop's Commissary"]}, {"page": "Jonathan Clark", "response": ["Jonathan Clark may refer to:", "*Jonathan Clark (cricketer) (born 1981), South African cricketer", "*Jonathan Clark (soldier) (1750–1811), U.S. general, older brother of George Rogers Clark and William Clark", "*Jonathan Clark (footballer) (born 1958), Welsh footballer", "*Jonathan Clark of the Clark baronets", "*Jonathan Clark (bishop) (born 1961), Church of England bishop", "*Jonathan Clark (TV personality)"]}, {"page": "Croydon Minster", "response": ["Croydon has strong religious links, Croydon Palace having been a residence of the Archbishop of Canterbury from at least the beginning of the 13th century to the beginning of the 19th. The Bishop of Croydon is a position as an area bishop in the Anglican Diocese of Southwark. The current area bishop is Jonathan Clark, who was consecrated on 21 March 2012. Until recently (mid 2016) the vicar was Colin J. Luke Boswell, Vicar of Croydon and Chaplain to the Whitgift Foundation."]}]}}