{"wiki_id": "http://www.wikidata.org/entity/Q6273398", "itemLabel": "Jonathan Hill", "itemDescription": "television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Hill_(presenter)", "wikipedia_page": {"main": "Jonathan Hill is a Welsh television presenter, journalist and producer, who currently presents Wales at Six, the nightly news magazine programme on ITV Cymru Wales. He is also the editor of the station's English language output.\nHill, who studied English at Swansea University before specialising in journalism, started his career freelancing for BBC Radio Wales, before joining HTV Wales as a general news reporter and bulletin presenter in 1993 for HTV Newsdesk and Wales at Six. In February 1994, he was made one of the main presenters of Wales Tonight, and has since been the senior anchor for the station's main regional news programmes, including HTV News and ITV Wales News. He has also presented ITV News at 10 occasionally.\nHill has also presented and produced documentary programmes for ITV Wales, including the popular series Crime Secrets and Helicops (which has been shown latterly on Men & Motors and during ITV's Nightwatch with Steve Scott).\nHe has also contributed to the weekly current affairs programme, Wales This Week. In 2001, Hill was named BT Welsh Journalist of the Year for a Wales This Week report on convicted murderer Mark Shillibier and BT Welsh News Broadcaster of the Year for an interview with the Archbishop of Cardiff.In May 2009, Hill was appointed as associate editor and executive producer for all of ITV Cymru Wales' programming. On 10 August 2013, he made his network debut presenting ITV News weekend bulletins on ITV and ITV News London. He continues to present national weekend bulletins on occasion.\nIn September 2013, Hill released his first book, based upon convicted serial killer John William Cooper - The Pembrokeshire Murders: Catching the Bullseye Killer was co-written with DCI Steve Wilkins, lead investigator of Operation Ottawa.", "link_mentions": [{"page": "Swansea University", "response": ["* Jonathan Hill, presenter of Wales Tonight on ITV Wales"]}, {"page": "ITV Weekend News", "response": ["*Jonathan Hill (2013–) (also a Wales at Six presenter)"]}, {"page": "Wales at Six", "response": ["Wales at Six is the evening news programme produced by ITV Cymru Wales and broadcasting to Wales. It broadcasts for thirty minutes each Monday to Friday from 18:00, covering national news stories, features, sport and weather. It is presented by Andrea Byrne or Jonathan Hill. Shorter bulletins air at other times (as ITV News Cymru Wales).", "Jonathan Hill was promoted from news reporter and newsreader to a main anchor for the main evening news programme during February 1994. Andrea Byrne was appointed co-anchor on 14 January 2008 following the departure of Lucy Owen to rival programme BBC Wales Today. Hill and Byrne anchor alternating editions of the main 6pm programme as of June 2014.ITV begins broadcasting from new Wales HQ in Cardiff Bay ITV News, 30 June 2014 Kylie Pentelow took over from Byrne on 4 February 2019 for one-year.Who is Kylie Pentelow, who's replaced Andrea Byrne on ITV Wales? Wales Online, 4 February 2019 Ruth Dodsworth fronts national weather forecasts for ITV Cymru Wales since 2000."]}, {"page": "List of ITV News on air staff", "response": ["*Jonathan Hill"]}, {"page": "2010 United Kingdom general election debates", "response": ["| Jonathan Hill"]}, {"page": "Jonathan Hill", "response": ["*Jonathan Hill (architect) (born 1958), English architect", "*Jonathan Hill, Baron Hill of Oareford (born 1960), British politician", "*Jonathan Hill (baseball) (), baseball player in the Negro leagues", "*Jonathan Hill (cricketer) (born 1990), Filipino-Australian cricketer", "*Jonathan Hill (presenter) (), Welsh television presenter", "*Jonathan Hill (theologian) (born 1976), English theologian"]}, {"page": "Jonathan Hill (tv presenter)", "response": ["#REDIRECT Jonathan Hill (presenter)"]}, {"page": "Mai Davies", "response": ["After becoming freelance, she presented across a series of channels, including ITV Wales's political programme Waterfront until the end of 2009, but also including Channel 5, BBC Radio 4, BBC 5 Live, and the BBC World Service. In 2009 Davies, widely regarded as \"ITV’s face of Welsh politics\", was replaced as the host of Wales This Week by Jonathan Hill. She then moved to become a daytime anchor at Sky News."]}, {"page": "Wales This Week", "response": ["As of 2017, the programme is presented by Andrea Byrne. Former presenters, producers and reporters include David Williams, Chris Segar, Bruce Kennedy, Clare Hudson, Judith Davies, Catrin Griffith, Paddy French, Mai Davies, Hywel George, Helen Callaghan and Jonathan Hill."]}, {"page": "David Fynn", "response": ["His other television appearances include Game of Thrones, Sherlock, Doctor Who, The Inbetweeners, The Job Lot, Banana, Big Bad World, Mayday, Black Mirror, Life’s Too Short, Pete versus Life, Peep Show, and Spooks. In January 2021 he appeared as one of the lead characters, journalist Jonathan Hill, in the ITV miniseries The Pembrokeshire Murders."]}, {"page": "The Pembrokeshire Murders", "response": ["* David Fynn as Jonathan Hill"]}]}}