{"wiki_id": "http://www.wikidata.org/entity/Q6274239", "itemLabel": "Jonathan Rigby", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Rigby", "wikipedia_page": {"main": "Jonathan Rigby (born 1963) is an English actor and film historian who has written several books. He has been described in Video Watchdog magazine as occupying 'a proud place in the advance guard of film researchers, writers and critics.'In his parallel career as an actor, Rigby played the psychic researcher Harry Price in the part-animated 2017 feature film Borley Rectory: The Most Haunted House in England. Previously he played Kenneth Horne throughout the eighteen-month run of the West End hit Round the Horne ... Revisited (2003–05); the production was adapted for  BBC Four and featured in the 2004 Royal Variety Performance. In 2008-09 he reprised the role in a regional tour of Round the Horne - Unseen and Uncut and in the BBC Radio special Twice Ken is Plenty, then in 2017–18 he appeared in a new stage show called Horne A'Plenty. Some of his earlier theatre work, particularly in Shakespeare, is discussed by Owen Dudley Edwards in the 1991 book City of a Thousand Worlds: Edinburgh in Festival.Rigby's stage adaptation of Dracula toured during 1997, the original novel's centenary year, and in 2013-14 he directed a successful revival of the forgotten Sylvia Rayman play Women of Twilight. He is also an Associate Research Fellow of the Cinema and Television History Research Centre at De Montfort University, Leicester, and has contributed audio and/or video commentaries to the DVD/Blu-ray releases of numerous horror films. In 2010 he was series consultant on the three-part BBC Four documentary A History of Horror, also making a brief appearance as Dracula in the opening episode. Two years later he was programme consultant on the feature-length follow-up, Horror Europa.", "link_mentions": [{"page": "Round the Horne", "response": ["The persona adopted by the writers for Horne was not greatly different from his real-life one, and largely the same as that of his Beyond Our Ken character: the urbane, unflappable, tolerant but sometimes surprised central figure, around whom the other characters revolved. The Times called Horne the \"master of the scandalous double-meaning delivered with shining innocence\", and in Round the Horne he combined the role of straight man to the flamboyant Julian and Sandy, Rambling Syd Rumpo and J.Peasmold Gruntfuttock with that of genial host of the show. Feldman called him \"the best straight man I had ever seen\", who nonetheless had \"a lot of funny lines\"; Jonathan Rigby, who played Horne in a stage show, Round the Horne ... Revisited, thought him \"a stand-up comedian with a posh accent ... part of his genius was that he was able to be himself\".", "A stage version, Round the Horne ... Revisited, was adapted from the original radio scripts by Brian Cooke, the last surviving writer of the series, and directed by Michael Kingsbury. It was first produced in October 2003 at the White Bear, a fringe theatre in south London, and opened in the West End at The Venue, Leicester Square in January 2004, running for more than a year. It featured Jonathan Rigby as Horne, Robin Sebastian as Williams, Nigel Harrison as Paddick, Kate Brown as Marsden and Charles Armstrong as Smith. A scene from the show featured in the 2004 Royal Variety Performance at the London Coliseum. Following the success of the London production, a second cast was assembled to tour the provinces. Stephen Critchlow played Horne, with Stephen Matthews, David Rumelle, Felicity Duncan and Oliver Beamish as Williams, Paddick, Marsden and Smith. The original show ran in London until December 2004, when it was replaced by a Christmas edition with an unchanged cast. A third edition, Round the Horne Revisited 2, rounded off the London run from February to April 2005, and then made a provincial tour."]}, {"page": "John Houseman", "response": ["Houseman was portrayed by Cary Elwes in the Tim Robbins-directed film Cradle Will Rock (1999). Actor Eddie Marsan plays the role of Houseman in Richard Linklater's film Me & Orson Welles (2009). Houseman was played by actor Jonathan Rigby in the Doctor Who audio drama Invaders from Mars set around the War of the Worlds broadcast. Actor Sam Troughton portrayed Houseman in the 2020 film Mank."]}, {"page": "Borley Rectory", "response": ["In 2017, the part-animated film Borley Rectory: The Most Haunted House in England was released. It was written and directed by Ashley Thorpe and starred Reece Shearsmith and Jonathan Rigby."]}, {"page": "The Quatermass Xperiment", "response": ["The Quatermass Xperiment was released in 2003 by DD Video on Region 2 DVD. It contained a number of extra features including a commentary by director Val Guest and Hammer historian Marcus Hearn, as well as an interview with Val Guest, an original trailer, and a production booklet written by Marcus Hearn and Jonathan Rigby. A Region 1 made-on-demand DVD-R, sourced from a high-definition master, was released in 2011"]}, {"page": "Flesh and Blood (Roxy Music album)", "response": ["Jonathan Rigby praised the second single from the album, writing \"If \"Dance Away\" achieved Ferry's long-held ambition and became accepted as a modern standard, it's hard to see why the same accolade has yet to be bestowed on \"Oh Yeah\", which is perhaps the most limpidly beautiful ballad in his portfolio.\"Rigby, Jonathan. Roxy Music: Both Ends Burning. 2008. pg 226. Allmusic.com in its review states \"The sequence of exquisite singles that Roxy Music rattled off as the late '70s became the early '80s was highlighted by any number of songs which, dispassionately, could be ranked among Bryan Ferry's purest pop visions yet. \"Oh Yeah\" surely edges them all, however, not only for its own understanding of the genre's traditions (an everyday story of boy meets girl, in car with radio), but also via its reinvention over a decade later, when London Suede (surely the most convincing of all Roxy's stylistic heirs) borrowed both a lyric and the mood for their own The Wild Ones.\""]}, {"page": "Phantasmagoria (audio drama)", "response": ["*Edmund Carteret — Jonathan Rigby"]}, {"page": "Invaders from Mars (audio drama)", "response": ["*John Houseman/Thug/Streath — Jonathan Rigby"]}, {"page": "Neverland (audio drama)", "response": ["*Matrix Voices — Jonathan Rigby, Dot Smith and Ian Hallard"]}, {"page": "Shivers (magazine)", "response": ["The first 12 issues were edited by Alan Jones and the next 120 by David Miller. Issue #1 appeared in June 1992. After David Miller left the company, the final half-dozen contained no editor credit. The last issue (number 138) appeared in mid-2008. The magazine was produced by Visual Imagination and regular contributors included David J. Howe, Alan Jones, Ingrid Pitt, Jonathan Rigby, Kim Newman, Cleaver Patterson and Alex Wylie."]}, {"page": "Reece Shearsmith", "response": ["In 2017, Shearsmith appeared in the part-animated film Borley Rectory: The Most Haunted House in England. It was written and directed by Ashley Thorpe and co-starred Jonathan Rigby. Shearsmith also appeared in the title role in The Dresser at the Chichester Festival Theatre, as well as reuniting with The League of Gentlemen for three television specials, transmitted on BBC2 in December 2017.  "]}, {"page": "The Satanic Rites of Dracula", "response": ["The film itself is a mixture of horror, science fiction and a spy thriller, with a screenplay by Don Houghton, a veteran of BBC's Doctor Who. The original score was composed by television composer John Cacavas. As film historian Jonathan Rigby has observed, the film \"wrapped on 3 January 1973, 15 years to the day since the original [Hammer] Dracula wrapped.\"Rigby, Jonathan (2015). English Gothic: Classic Horror Cinema 1897-2015, Signum Books. p. 247. "]}, {"page": "Richard Marsh (author)", "response": ["Marsh's greatest commercial success was one of his earlier novels, The Beetle (1897). A story about a mysterious oriental person who pursues a British politician to London, where he wreaks havoc with his powers of hypnosis and shape-shifting, Marsh's novel is similar in some respects to certain other novels of the same period, such as Bram Stoker's Dracula, George du Maurier's Trilby, and Sax Rohmer's Fu Manchu novels. Like Dracula and many of the sensation novels pioneered by Wilkie Collins and others during the 1860s, The Beetle is narrated from the perspectives of multiple characters, a technique used in many late 19th-century novels (those of Wilkie Collins and Stoker, for example) to create suspense. The novel engages with numerous themes and problems of the Victorian fin de siècle, including the New Woman, unemployment and urban destitution, radical politics, homosexuality, science, and Britain's imperial engagements (in particular those in Egypt and the Sudan). \"The Beetle\" sold out upon its initial printing, and continued to sell well and to be published for several decades into the 20th century. The novel was made into a film in 1919, with Leal Douglas in \"the polymorphous title role\",Jonathan Rigby, English Gothic: A Century of Horror Cinema (Reynolds & Hearn, 2004), p. 16 and adapted for the London stage in 1928."]}, {"page": "Dracula Society", "response": ["As well as its regular membership the society also presents Honorary Life Memberships; current holders include Richard Dalby, Christopher Frayling, Jonathan Rigby, Janina Faye and Caroline Munro, and former holders include Michael Carreras, Radu Florescu, Raymond T. McNally and Vincent Price."]}, {"page": "Anthony Hinds", "response": ["The horror script The Unquenchable Thirst of Dracula, which he wrote in the 1970s for Hammer, was never filmed. In October 2015 it was presented as a live stage reading by the Mayhem Film Festival at the Broadway Cinema in Nottingham, featuring the actor and film historian Jonathan Rigby as narrator. In October 2017 a studio production of the script was broadcast on BBC Radio 4, with narration by Michael Sheen."]}, {"page": "Rigby", "response": ["*Jonathan Rigby (born 1963), English film critic and actor"]}, {"page": "Category talk:British journalists", "response": ["Jonathan Rigbynot yet classified"]}, {"page": "I Drink Your Blood", "response": ["It bears some resemblance to several later films, including David Cronenberg's Rabid (1976) and George Romero's The Crazies (1973), which starred I Drink Your Blood actress Lynn Lowry and was remade in 2010. Both films share a similar premise to Durston's film, which has been noted by authors Jonathan Rigby and Stephen Thrower."]}, {"page": "P.R.O.B.E.", "response": ["* Cummings – Jonathan Rigby", "* Cummings – Jonathan Rigby", "*Cummings – Jonathan Rigby"]}, {"page": "Women of Twilight", "response": ["The first notable revival of Women of Twilight was directed by Jonathan Rigby and opened at London's White Bear Theatre on 3 October 2013 as part of its Lost Classics Project. The production was itself revived, at the same venue, on 6 January 2014 and again, this time at Pleasance Islington, from 14 April."]}, {"page": "Melissa Stribling", "response": ["Terence Fisher remembers her asking him how to play the scene. Terence replied, saying that she should imagine that she had one whale of a sexual night and that it should be shown on her face. The author Mark Clark detailed the first encounter between Dracula and Mina in his book Smirk, sneer, and scream: great acting in horror cinema which he described as an implied erotic scene. Jonathan Rigby complimented her performance in his book English gothic: a century of horror cinema, saying that she is a terrific female lead throughout the film. Terence Fisher said that he told her that she produced a satisfied little facial expression that speaks volumes."]}, {"page": "Lennon Naked", "response": ["* Jonathan Rigby as Cynthia's lawyer"]}, {"page": "A History of Horror", "response": ["The documentary was directed by John Das (episodes one and three) and Rachel Jardine (episode two); series consultant was actor and film historian Jonathan Rigby. The series was initially broadcast in the United Kingdom on BBC Four from 11 to 25 October 2010. Each of the three episodes lasted 60 minutes.", "The series was followed in October 2012 by Horror Europa, a 90-minute exploration of European horror that reunited Gatiss with director John Das and consultant Jonathan Rigby."]}, {"page": "Marc Wilkinson", "response": ["Through his work at the National Theatre Wilkinson met Piers Haggard, who was working as an assistant director: the two worked together on the National Theatre production The Dutch Courtesan (1964). Having directed several TV dramas, Haggard was about to direct his first feature film and invited Wilkinson to score it.Wilkinson, Marc. Sleevenotes to Soundtrack album Blood on Satan's Claw, Trunk Records . The result is one of Wilkinson's most celebrated film scores, Blood on Satan's Claw (1971),Spencer, Kristopher. Film and television scores, 1950–1979: a critical survey by genre. McFarland, 2008: p. 254 acclaimed by Jonathan Rigby in English Gothic as \"easily among the best ever composed for a British horror film\".Rigby, Jonathan. English Gothic: A Century of Horror Cinema. Reynolds & Hearn, 2004: p. 200 Wilkinson subsequently gave crucial advice to Paul Giovanni who had been commissioned to score the film The Wicker Man.Bartholomew, David. \"The Wicker Man\" in Cinefantastique Vol. 6, no. 3, 1977: p. 24 "]}, {"page": "The Beetle (film)", "response": ["Jonathan Rigby has called Leal Douglas’s High Priestess “the polymorphous title role”.Jonathan Rigby, English Gothic: A Century of Horror Cinema (Reynolds & Hearn, 2004), p. 16"]}, {"page": "Red Kingdom Rising", "response": ["Red Kingdom Rising has been featured in history books; English Gothic: Classic Horror Cinema (1897-2015) by Jonathan Rigby and The History of British Literature on Film (1895-2015) by Greg M. Colon Semenza and Robert Hasenfratz. The latter described that 'to most viewers, Joss Whedon's Much Ado won't look much different than an equally well-crafted 16mm film such as Red Kingdom Rising, Navin Dev's 2014 horror adaptation of Lewis Carroll's Alice novels.'"]}]}}