{"wiki_id": "http://www.wikidata.org/entity/Q6276832", "itemLabel": "Jordan Moore-Taylor", "itemDescription": "English association football player (born 1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jordan_Moore-Taylor", "wikipedia_page": {"main": "Jordan Alan Moore-Taylor (born 24 January 1994) is an English professional footballer who plays as a defender for League Two club Forest Green Rovers.", "link_mentions": [{"page": "Troy Brown (footballer)", "response": ["Brown joined Exeter City on 3 July 2015, making his debut in a 3–2 win against Yeovil Town. In his first season at the club, Brown was part of the Exeter side that held Liverpool to a draw at St James Park in the third round of the FA Cup. He formed an integral part of the Exeter City defence that reached the play-off finals in the 2016–17 and 2017–18 seasons, enjoying a successful partnership at centre back with Jordan Moore-Taylor, though his 2017–18 season was curtailed following a knee injury sustained against Accrington Stanley in November 2017."]}, {"page": "2013–14 Exeter City F.C. season", "response": ["|Jordan Moore-Taylor"]}, {"page": "2016–17 Exeter City F.C. season", "response": ["The Grecians carried their excellent form into February with a 4–0 thrashing of Crewe Alexandra with David Wheeler breaking the all-time Exeter City record for consecutive matches scored in after his brace, meaning he had scored seven matches in a row. Jordan Moore-Taylor and Lloyd James also scored in the match. City were then only four points behind third-placed Carlisle United. Exeter City also won seven consecutive matches in the league (within a single season) for the first time. Exeter's unbeaten run was ended by rivals Plymouth Argyle in a 3–0 drubbing at Home Park. This was the Grecians' heaviest defeat of the season so far and the club dropped to 5th in the league table. Exeter dropped further down the league table to 6th after losing a 2–0 lead at 90 minutes to draw 2–2 at Notts County. Jake Taylor was sent off in the 87th minute. City drew again in their next game at home against Stevenage, with Reuben Reid equalizing early in the second half. Yet another draw was to follow the next game at home against Blackpool, where City fought back after finding themselves 2–0 down after 39 minutes. This stretched their home unbeaten run to 8 matches. City ended their winless streak with a 2–1 victory over Crawley Town on Shrove Tuesday, their 11th away league victory of the season."]}, {"page": "2017 EFL League Two play-off Final", "response": ["Exeter City faced Carlisle United in their play-off semi-final, the first leg being played at Brunton Park in Carlisle on 14 May 2017.  The visitors took the lead on 15 minutes when Joel Grant scored but Exeter's Jordan Moore-Taylor scored an own goal to level the match.  Ryan Harley restored Exeter's lead just before half-time and David Wheeler made it 3–1 eleven minutes into the second half.  John O'Sullivan's cross floated into the Exeter goal to make it 3–2 midway through the second half and Shaun Miller's header levelled the match which ended 3–3.  The second leg of the semi-final was played St James Park in Exeter four days later.  Ollie Watkins scored the only goal of the first half to put Exeter ahead on aggregate.  With eleven minutes of the game remaining, Watkins scored his and Exeter's second, but Jason Kennedy pulled one back for the visitors two minutes later.  O'Sullivan scored in the 90th minute to make it 2–2, but five minutes into injury time, Jack Stacey scored for Exeter to make it 3–2, and Exeter won the tie 6–5 on aggregate.", "|CB ||15||Jordan Moore-Taylor (c)"]}, {"page": "2017–18 Exeter City F.C. season", "response": ["Prolific goalscorer Christian Doidge netted for Rovers after 26 minutes, the only goal in the first half. Grecians skipper Jordan Moore-Taylor equalised in the 58th minute and Jayden Stockley scored not long after to give City a 2–1 lead. However, Forest Green equalised through Scott Laird in the 88th minute and Doidge scored again in the 92nd to turn the game on its head. To make the game's conclusion even more dramatic, Stockley scored his second goal in the 94th minute as the match finished 3–3."]}, {"page": "2018–19 Milton Keynes Dons F.C. season", "response": ["|| DF ||  Jordan Moore-Taylor || Exeter City "]}, {"page": "2018 EFL League Two play-off Final", "response": ["|CB ||15||Jordan Moore-Taylor (c)"]}]}}