{"wiki_id": "http://www.wikidata.org/entity/Q6278840", "itemLabel": "Jorgie Porter", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Jorgie_Porter", "wikipedia_page": {"main": "Jorgina Porter (born 25 December 1987) is an English actress and model. She is known for portraying the role of Theresa McQueen in the Channel 4 soap opera Hollyoaks from 2008 until 2016 and again from 2020.", "link_mentions": [{"page": "Are You Being Served?", "response": ["Former Only Fools and Horses actor John Challis portrayed Captain Peacock; former Coronation Street actors Sherrie Hewson and Roy Barraclough  were cast as Mrs Slocombe and Mr Grainger respectively, and comedian Arthur Smith as Mr Harman. Mr Humphries was portrayed by Jason Watkins, Miss Brahms by Niky Wardley, and Mr Rumbold by Justin Edwards. New characters introduced in the show included Young Mr Grace's grandson, also called Young Mr Grace, played by Mathew Horne; Miss Croft, named as a tribute to series co-creator David Croft, played by Jorgie Porter; and newcomer Mr Conway, played by Kayode Ewumi. The episode was written by Derren Litten. The BBC issued a press release saying: \"It's 1988 and Young Mr Grace is determined to drag Grace Brothers into, well 1988, but he has a problem on his hands. Mr Humphries, Captain Peacock, Mr Rumbold and Mrs Slocombe all seem to be stuck in another era. A new member of staff, Mr Conway, joins the team but will he help shake things up or will he just put a pussy amongst the pigeons?\""]}, {"page": "Hollyoaks", "response": ["In November 2012, Hollyoaks aired \"Enjoy the Ride\", in which four regular characters were killed: Rhys Ashworth (Andrew Moss), and three sixth form students, Maddie Morrison (Scarlett Bowman), Neil Cooper (Tosin Cole) and Jono (Dylan Llewellyn). In October 2013, as part of the celebration of the soap opera turning 18, the show aired Hollyoaks — The Blast from 15 October until the end of the week. The storyline saw a cast massacre with five main characters being killed off through the week, and two were also killed off in the annual Hollyoaks Later. In November 2014, the show aired Hollyoaks  – End of The Line from 17–21 November. The storyline saw newcomers Porshe McQueen (Twinnie Lee Moore) and Lockie Campbell (Nick Rhys) celebrate their wedding reception on a party train, and Sienna Blake (Anna Passey)'s car becomes stuck on the tracks after a car chase with her father Patrick Blake (Jeremy Sheffield), causing the train to smash into it and derail. Long-running character Carmel McQueen (Gemma Merna) was killed when the wreckage exploded after saving her cousin Theresa McQueen (Jorgie Porter) from \"villainous\" Sonny Valentine (Aaron Fontaine), who also died in the explosion, who wanted revenge on her for killing Calvin in 2010. Long-running character Mercedes McQueen (Jennifer Metcalfe) also \"died\" in November 2014, just a week after her sister Carmel, in a plot that saw her brutally murdered in the McQueen house by Grace Black. As of December 2014, only two original McQueen family members remain on screen, Myra McQueen (Nicole Barbara Lane) and John Paul McQueen (James Sutton). Mercedes returned in February 2015. In June of that year, Phoebe died after Lindsey Butterfield (Sophie Austin) injects her with potassium chloride. Cleo moves into the house in late January 2015."]}, {"page": "Danniella Westbrook", "response": ["Danniella competed in the fifth series of Dancing on Ice and was partnered by newcomer professional Matthew Gonzalez in 2010. She was eliminated from the show in the semi-finals, placing fourth overall. In 2013, she appeared in Channel 4 teen soap opera Hollyoaks as an instalment of a storyline, which saw Westbrook's character Trudy Ryan hire Jacqui McQueen (Claire Cooper) and Theresa McQueen (Jorgie Porter). In 2014, she appeared in the Vigilante Film 'Mob Handed'. She was due to reprise her role as Trudy on Hollyoaks in 2015, however this was cancelled with a representative from Hollyoaks claiming that she \"breached her contract\"."]}, {"page": "Steph Cunningham", "response": ["Following her departure, her co-stars commented favourably on the actress and character, with Jorgie Porter deeming her an \"ultimate original\", Gemma Merna stating that she \"was Hollyoaks\", and Ricky Whittle admitting that he cried during the airing of her final scenes. Television and entertainment website Holy Soap did not see Steph's fire death coming, calling her actions brave and her ten-year duration \"mammoth\". They described her most memorable moment as telling Niall she did not love him and then watching him commit suicide. Inside Soap said if there was an award for \"the unluckiest character in soap\", Steph would certainly win. In his column for The Guardian, television critic Jim Shelley stated that it was time for Steph to go, having \"suffered enough\" during her tenure. Humorously recapping her ten years in Hollyoaks, Shelley wrote:"]}, {"page": "Tony Hutchinson", "response": ["Tony has been part of various storylines, including marriages to Mandy Richardson (Sarah Jayne Dunn), her stepsister Cindy Cunningham (Stephanie Waring) and Diane O'Connor (Alex Fletcher), an affair with married woman Helen Cunningham (Kathryn George), the death of his daughter Grace to sudden infant death syndrome, the discovery of his long-lost son Harry Thompson (Parry Glasspool), sleeping with underage Theresa McQueen (Jorgie Porter), his battle with testicular cancer, impregnating Diane, the birth of his children Anthony and Dee Dee, an affair with his stepdaughter Sinead O'Connor (Stephanie Davis), discovering that his biological daughter is Rose Lomax after she and Dee Dee were switched at birth, coping with Harry's homosexuality and relationship with his best friend Ste Hay (Kieron Richardson), being stabbed and taken hostage by serial killer Breda McQueen (Moya Brady) after he discovered her crimes, struggling to return to his life after Breda's reign of terror comes to an end, the return of his father Edward Hutchinson (Joe McGann) into his life, coming over his trauma from Breda's actions, discovering that Diane had a brief affair when he was taken hostage and discovering it was with Edward.", "Tony meets Theresa McQueen (Jorgie Porter) on a night out at The Loft. Tony, unaware Theresa is fifteen years old and Jacqui's cousin, has sex with Theresa. Pickard said that upon Jacqui discovering Tony's one-night stand with Theresa she \"storms round and starts thwacking him, screaming he's slept with her 15-year-old cousin! What's worse is that Theresa is making out Tony practically raped her\". Pickard explained that Theresa wants a relationship with Tony but Tony tells her a relationship won't happen. Pickard explained that Tony is arrested and \"his life goes into freefall\". Pickard went on to say that if \"he's found guilty then he'll probably have to do time. If he's let off, I think the best thing would be for him to go away for a while to sort himself out\"."]}, {"page": "Dancing on Ice", "response": ["| Jorgie Porter & Matt Evers", "|rowspan=\"2\" style=\"background: silver;\"|Jorgie Porter", "|style=\"background: orange;\"| Jorgie Porter", "|Jorgie Porter", "| Jorgie Porter"]}, {"page": "The British Soap Awards", "response": ["| \"Best Newcomer\" || Craig Gazey (Graeme Proctor in Coronation Street) || Selina Chilton (Ruth Pearce in Doctors)Shona McGarty (Whitney Dean in EastEnders)Jorgie Porter (Theresa McQueen in Hollyoaks)", "| \"Sexiest Female\"Presented by Keith Lemon|| Michelle Keegan (Tina McIntyre in Coronation Street) || Jacqueline Jossa (Lauren Branning in EastEnders)Preeya Kalidas (Amira Masood in EastEnders)Jorgie Porter (Theresa McQueen in Hollyoaks)", "| \"Sexiest Female\"Presented by Union J|| Michelle Keegan (Tina McIntyre in Coronation Street) || Georgia May Foote (Katy Armstrong in Coronation Street)Jacqueline Jossa (Lauren Branning in EastEnders)Natalie Anderson (Alicia Gallagher in Emmerdale)Jorgie Porter (Theresa McQueen in Hollyoaks)", "| \"Sexiest Female\"Presented by Ashley Banjo and Perri Kiely|| Michelle Keegan (Tina McIntyre in Coronation Street) || Georgia May Foote (Katy Armstrong in Coronation Street)Jacqueline Jossa (Lauren Branning in EastEnders)Jorgie Porter (Theresa McQueen in Hollyoaks)Jennifer Metcalfe (Mercedes Browning in Hollyoaks)"]}, {"page": "Matt Evers", "response": ["Evers has competed in all thirteen seasons of the ITV series Dancing on Ice, where he has been partnered with Bonnie Langford, Lisa Scott-Lee, Suzanne Shaw, Zöe Salmon, Heather Mills, Denise Welch and Jorgie Porter. While training, Evers was cut on the forehead by Porter's blade in February 2012, but continued with the season. The pair finished in second place. In series 8, he was paired with Pamela Anderson and they were the first couple to be eliminated, Evers was partnered with Suzanne Shaw for the All-Stars series. Evers was partnered with Candice Brown in series 10 and the pair were first to be eliminated. In series 11, Evers was partnered with The Only Way Is Essex star Gemma Collins, they became the fifth couple to be eliminated in week 6. In October 2019, it was announced that Evers would be part of the show's first ever same-sex partnership for the 2020 series, with Steps singer Ian \"H\" Watkins. Evers partnered Denise van Outen for series 13. The pair were forced to withdraw after their first performance as van Outen fractured her shoulder. However in week 6 of the competition, Evers was re-partnered with Faye Brookes after her original partner Hamish Gaman withdrew from the competition. They finished in second place.", "| Jorgie Porter"]}, {"page": "1987 in the United Kingdom", "response": ["* 25 December – Jorgie Porter, actress"]}, {"page": "Jon Christos", "response": ["in October 2015 a Star Ball at the Hilton hotel Deansgate with guests including  Jorgie Porter Nicole Barber-Lane Tricia Penrose and Ray Quinn saw Christos appear as a surprise singing waiter. He also formed the duo to be known as Il Destino (Classical Crossover Duo) with musical theatre performer Adam Lacey."]}, {"page": "Carmel McQueen", "response": ["Carmel Valentine (also McQueen) is a fictional character from the British Channel 4 soap opera Hollyoaks, played by Gemma Merna. She debuted on-screen during episodes airing on 13 August 2006 and was introduced by series producer Bryan Kirkwood as part of the McQueen family. Carmel has proved popular with fans with her comedic personality and has become notable for her \"dumb blonde\" appearance. Carmel was killed-off as she saved her cousin, Theresa McQueen (Jorgie Porter) from Sonny Valentine (Aaron Fontaine) during the \"End of the Line\" storyline. Her most prominent storylines include her marriage and divorce from Sonny's brother Calvin Valentine (Ricky Whittle), her facial disfigurement after a tanning machine explodes in her face, remarrying Calvin which ends in tragedy after he was shot dead by Theresa, her relationship with Jim McGinn (Dan Tetsell), her feud with Theresa and infatuation with Theresa and Calvin's daughter Kathleen-Angel McQueen, beginning a relationship with Sonny and being killed in an explosion following a train crash at her cousin Porsche McQueen's (Twinnie Lee Moore) wedding reception.", "On 24 August 2014, Merna announced that she would be leaving the role. Carmel was killed off in the train explosion in November after being a hero, saving cousin Theresa McQueen (Jorgie Porter) from the hands of Sonny Valentine (Aaron Fontaine). \"Yours\" by Ella Henderson was played in the background as Carmel calmly died with her family around her. The episode in which Carmel died was broadcast on Channel 4 on 12 November 2014, with cast members and television critics praising Merna's performance in her final scenes.", "Carmel promises Lauren that she would buy her and Barry \"Newt\" Newton (Nico Mirallegro) condoms but Calvin finds them and assumes Carmel is having an affair with Mark Gascoyne (Craig Russell). She tries to tell him they are for Lauren but Calvin kicks her out. Carmel moves back with the McQueens. After a couple of days, Carmel asks Calvin for a divorce since she cannot trust him anymore. At Christmas, Carmel begins auditioning people for her nativity play. Her cousin, Theresa (Jorgie Porter), auditions but is called off the stage by people making fun of her for having sex with Tony, claiming she cannot play a virgin when she clearly is not. Carmel then decides to play the Virgin Mary herself, however, the play is a disaster when the star the Three Wise Men follow catches fire. Calvin tells Carmel that Warren killed her best friend Louise on their wedding day. Carmel does not want to believe that she is dead at first but then in Evissa, she sees a post-it note written by Louise, she then sees Warren with Sasha (Nathalie Emmanuel) and Spencer Gray (Darren John Langford), she leaves Evissa and approaches him crying and accuses him of murdering her best friend, which Warren denies. After Warren is killed by Clare Devine (Gemma Bissix) in a fire at The Loft, Calvin takes in his autistic foster brother Spencer. Carmel comforts him and tells him about Tina's death and how it will get better with time."]}, {"page": "List of The Podge and Rodge Show episodes", "response": ["| 6 || 8 || Melody Thornton, Jorgie Porter ||  N/A|| 2018-12-10"]}, {"page": "Myra McQueen", "response": ["On her time on the serial Myra has often become involved in her family member's storylines. In one storyline Bart McQueen (Jonny Clarke) steals money from Myra. Bart lies about stealing the money when he is accused by Jacqui. This causes tensions between Jacqui and Myra who has \"had enough of Jacqui muscling in\". On her characters reasons for not believing Jacqui, Barber-Lane explained that \"When Myra stopped believing Jacqui, I think it was also partly because Jacqui had hid all the stuff about Theresa (Jorgie Porter) killing Calvin (Ricky Whittle) and it was Myra's way of saying, 'Listen - this is my house, my rules'. Maybe she was wrong, but Bart's 15 so she felt that she couldn't kick him out as he had nowhere else to go, and she just thought that Jacqui should behave herself!\" Jacqui is later raped by Gilly Roach (Anthony Quinlan). Barber-Lane explained that there is a \"part of Myra that thought, 'You'd never let that happen - how have you let that happen? Have you just changed your mind afterwards?\" Mercedes lies she is pregnant to cover up her affair with Carl Costello (Paul Opacic), the father of her fiancé Riley Costello (Rob Norbury). Myra discovers her lies and believes that Mercedes should not tell the truth as Mercedes has \"landed on her feet\" with Riley. Barber-Lane told Daniel Kilkelly of Digital Spy that Myra believes Riley will benefit the McQueen family financially and take them out of the poverty they are in. Myra is getting \"carried away\" with excitement and enthusiasm over how her life could change due to Riley. She said that the most important thing for Myra is what is important for her daughters although \"sometimes she may forget that for a moment, but she's always there for her kids\".", "Katy Finbow of Digital Spy reported on 6 July 2014 that Barber-Lane had reprised the role on a permanent basis. Myra returns alongside Theresa McQueen (Jorgie Porter), who had left the show months prior. Barber-Lane expressed her joy at returning to Hollyoaks, despite her initial decision to leave. She likened the soap to \"a comfortable sofa that you never really want to leave\". The character's return first aired in September 2014 when she helps Theresa escape prison custody. Upon her return, the character's hair is dyed blonde and she wears heavy fake tan. Despite initial plans to return to Spain, Myra decides to stay after learning that John Paul was raped. Barber-Lane explained that although she tries being \"strong\" for John Paul, \"she is utterly devastated\". She added that she could not leave again because \"John Paul's her boy\" and she needs to support him."]}, {"page": "Matthew Wolfenden", "response": ["Wolfenden was partnered with Russian ice dancer Nina Ulanova for the seventh series of Dancing on Ice. His gymnastic and dance background proved to be an advantage and he ended up in the final, against Hollyoaks actress Jorgie Porter and The X Factor contestant Chico Slimani. Wolfenden continued his role in Emmerdale  while training for Dancing on Ice.Nina Ulanova Matthew became the \"King of the Ice\" after beating Porter."]}, {"page": "Mercedes McQueen", "response": ["Calvin and Carmel become reunited and plan to remarry. Metcalfe told a What's on TV reporter that Mercedes was unable to accept Calvin loved Carmel more than her because \"in her head, he doesn't. She can't think rationally about this. Her thing for Calvin is an obsession now\". Mercedes tried to prevent the wedding going forward, including by anonymously threatening Calvin and by canceling the wedding plans. Calvin discovered that Mercedes was behind the threats, and the pair go on to have a \"day of passion\"; Metcalfe explained that their relationship is \"all about the sex\". Mercedes tried everything to convince Calvin not to go through with the wedding. As Metcalfe stated, \"They talk, shout and cry and she tells him she loves him\". Mercedes told Calvin, who \"just sat there like a puppy, being manipulated by her\", that he should marry her instead, and he agreed and promised to tell Carmel. Mercedes later discovered that he has not told Carmel and she can not \"believe he's chosen Carmel over her\". Calvin was killed on his wedding day; Metcalfe revealed to What's on TV that Mercedes has \"got it in her\" to kill Calvin. She added that her character still loves Malachy, but Malachy and Mercedes end their relationship. Mercedes' cousin Theresa (Jorgie Porter) was later found to have shot Calvin."]}, {"page": "Sonny Valentine", "response": ["Sonny Valentine is a fictional character from the British Channel 4 soap opera, Hollyoaks, played by Aaron Fontaine. The role was initially played by Devon Anderson until 2007 when producer Bryan Kirkwood fired Anderson. In 2014, the role was recast when Kirkwood decided to reintroduce the character. On 12 November 2014, Sonny was killed off in a train explosion along with Carmel McQueen (Gemma Merna), when Carmel rescued her cousin Theresa McQueen (Jorgie Porter) from Sonny.", "Sonny, now played by Aaron Fontaine, returns when his former sister-in-law Carmel Valentine (Gemma Merna) contacts him and tells him that his niece Kathleen-Angel (Nieve Grandison) is not safe with her mother, Theresa McQueen (Jorgie Porter). When he refuses to help, Carmel reveals that Theresa murdered his brother and Kathleen-Angel's father, Calvin. Sonny confronts Theresa in the village, revealing that he is now a Detective Sergeant in the police force and threatens her. When Carmel finds out, she confronts Sonny and he asks her to make a full written statement saying that Theresa killed Calvin, but she refuses. When Kathleen-Angel goes missing, Carmel tells Sonny about Theresa's plans to flee the village, so she gives in her statement. As Theresa is being pulled into a police car, Sonny arrives with Kathleen-Angel. When Sonny's superior, Sam Lomax (Lizzie Roper), is demoted to Detective Sergeant and is later killed in a car accident with her husband Danny Lomax (Stephen Billington), Sonny is promoted to Detective Inspector and leads the case into the deaths of Sam and Danny. It is revealed that Sonny is a bent copper and that he is working on both sides of the law, being paid by Grace Black (Tamara Wall) to set Big Bob (Vincent Ebrahim) up on a false charge. When Theresa's mother, Kathleen McQueen (Alison Burrows), returns to the village to help get Theresa released from prison, Sonny threatens her. When Kathleen reveals that Sonny is a recovering alcoholic and she tries to spike his drink with alcohol, he bribes her with money. When Kathleen later goes missing, it is revealed that Sonny has beaten her up and she is in hospital. When Kathleen's sister and Theresa's aunt, Myra McQueen (Nicole Barber-Lane), returns from Alicante to help with Theresa's escape plan, she knocks Sonny unconscious, but Theresa is caught and sent back to prison. Myra is livid when she finds out Sonny and Carmel are engaged and vows to show Sonny's true colours to Carmel. Carmel becomes suspicious of Sonny and follows him to the hospital, realising that he has beaten up Kathleen. Myra and Mercedes vow to deal with Sonny, but Kathleen warns the McQueens that they cannot win against Sonny and returns to Spain. Myra, Mercedes and Phoebe McQueen (Mandip Gill) handcuff Sonny in his car and drive him to a lake. When the McQueens are discussing what to do, Myra forgets to put the handbrake on and the car rolls into the lake with Sonny inside."]}, {"page": "Inside Soap Awards", "response": ["| Jimmi Harkishin (Dev Alahan, Coronation Street)Gwen Taylor (Violet Highway, EastEnders)Tameka Empson (Kim Fox, EastEnders)Lawrence Robb (Mackenzie Boyd, Emmerdale)Samantha Giles (Bernice Blackstock, Emmerdale)Kevin Mathurin (Charles Anderson, Emmerdale)Chelsee Healey (Goldie McQueen, Hollyoaks)Jorgie Porter (Theresa McQueen, Hollyoaks)"]}, {"page": "Leo Valentine", "response": ["In 2009, after Warren Fox's (Jamie Lomas) death, his foster brother Spencer Gray (Darren John Langford) moves in with the Valentines. Leo dislikes Spencer's unruly attitude and tries to convince Calvin to put him in a care home where he can be properly looked after. Calvin eventually does so. Leo discovers that Calvin left Warren to die and is forced to kick him out due to Sasha's upset over the situation. However, things get worse when Leo then discovers that Lauren is pregnant, unaware that she had lied to Spencer in order to con him out of his inheritance. Leo threatens Lauren's boyfriend Gaz Bennett (Joel Goonan) when it appears he is the father. Lauren then admits she made up the pregnancy. Calvin is shot dead by Theresa McQueen (Jorgie Porter) on his wedding day, and Leo is devastated. To make matters worse, Lauren collapses and falls down the stairs at The Loft during an argument with Sasha about her scheme to fleece Spencer out of his inheritance. When she is admitted to hospital, it is revealed that she is suffering from a life-threatening blood clot. Valerie then returns to take her back to Spain with her. Lauren decides to move to Spain as Leo gets a job in London. Lauren then realises how much her father will miss her, so she decides to stay with him. A goodbye party is held for the Valentines, as Lauren, Valerie and Spencer all announce they are also coming to London. The Valentines then leave on August 2010."]}, {"page": "Warren Fox", "response": ["The following day, Warren and Mandy argue and she threatens him. Later, Warren enters the McQueens' home where he asks Theresa McQueen (Jorgie Porter) who she has told and mentions that someone else knows, but does not reveal what he is referring to. It is later revealed that Theresa witnessed Warren escaping The Loft and since then, he has been blackmailed. On another occasion, Warren threatens to push Theresa from a roof in the village if she does not tell him who has been blackmailing him. He also reveals how he escaped the fire. In flashback scenes, days before the fire Warren meets a suicidal man named Dale Greer (Chris Geere). Dale and Warren bond and he begins working for him. When Clare starts the fire and Warren is apparently killed by the mirror, the floors collapsed and Warren is found by Dale in the cellar. After being rescued by Dale, Warren realises everyone believes he is still in the club. Warren kills Dale before putting his body in the cellar. Warren then threatens to kill Theresa, who witnesses him escaping, if she tells anyone. Warren then leaves the village. With Warren still threatening to push her from the walls, Theresa admits she killed Calvin and this forms the beginning of their relationship, as friends, in which they both help protect the other's secret."]}, {"page": "Ste Hay", "response": ["Ste becomes friends with Natty, Daniel and Abi and begins a short-lived relationship with Theresa McQueen (Jorgie Porter), which he ends to focus on getting Amy back. Amy gives birth to her and Ste's son Lucas Hay, helped by Ste, Daniel and Abi. Amy, however, suffers from post-natal depression, and leaves to live with her grandmother, leaving Lucas and Leah with Mike, who later leaves them in Ste's care. Abi and Daniel begin to help Ste with looking after Lucas, with plans of taking Lucas to replace their own son who died. Abi starts drugging Ste as Daniel turns him against Natty, who grows suspicious of Daniel and Abi's interests. Mike finds Ste asleep whilst looking after Lucas, so takes him. However, Ste takes Lucas back and bans Mike from seeing him. Ste almost shakes Lucas, so Daniel convinces him to give his son up. The truth is revealed, Daniel is arrested and later released, he and Abi leave the village. Amy returns and slowly begins to bond with her children again. They move into their old flat together."]}, {"page": "Calvin Valentine", "response": ["Calvin Valentine is a fictional character from the British Channel 4 soap opera, Hollyoaks, played by Ricky Whittle. He arrived in July 2006 as a police officer with his mother Diane Valentine, his brother Sonny Valentine and his sister Sasha Valentine and made his final appearance on 21 May 2010 after he was murdered by Theresa McQueen (Jorgie Porter). Whittle was credited for a flashback episode on 1 December 2010. Calvin appeared again as a ghost to tell his wife and Theresa's Cousin Carmel McQueen (Gemma Merna) that his and Theresa's daughter, Kathleen-Angel McQueen, was fine with Theresa in February 2011.", "It was announced on 28 January 2011 that Calvin would appear to Carmel as a ghost in February 2011. His reappearance is to coincide with the revenge of Kyle Ryder (Neil Toon) on Theresa McQueen (Jorgie Porter), Calvin's murderer. Teasing the surprise storyline, a Hollyoaks statement said: \"Calvin's spirit reignites Carmel's love for the man she lost and leads her to make some tough decisions about her future.\" However, Ricky Whittle will not return to the soap as the forthcoming scenes were filmed while he was still contracted with the show in 2010. Calvin returned for episodes from 14 February 2011.", "Calvin continues his affair with Mercedes until Carmel agrees to give their relationship another try. Mercedes is upset and jealous that Calvin has ended things with her and spots an opportunity for revenge when Carmel confides in her that Calvin left Warren to die. A shocked Mercedes rushes to tell Sasha, who is distraught and tells Calvin he is dead to her. Lauren and Sasha tell Leo that if he does not tell Calvin to leave they will, and Calvin is given no choice but to move into the McQueens. After an argument, Carmel realises how much Calvin means to her and proposes, to which he agrees. The pair begin their wedding plans, but Calvin has a one-night stand with Carmel's cousin, Theresa McQueen (Jorgie Porter). Calvin tells Sasha to tell the police that Lauren's boyfriend Gaz Bennett (Joel Goonan) attacked her in order to keep him away from Lauren. Calvin also angers Jake by refusing to give him his job back. In the run up to the wedding, Calvin receives death threats from racist Des Townsend (Kris Deedigan). Mercedes lures Calvin to a hotel where she sleeps with him again and confesses she loves him. Because of the death threats he has been receiving, Calvin gets hold of a gun which is stolen by Lauren following an argument with Mercedes. Mercedes tells her sister Jacqui McQueen (Claire Cooper) about the affair and Jacqui finds the gun at the Valentines' home and steals it. A number of other things happen to Calvin on his wedding day, including punching Zak Ramsey (Kent Riley) for his racial abuse, being confronted by Malachy about the affair, Spencer finding out he left Warren to die and Theresa telling him she's pregnant. Calvin is shocked to learn Theresa is pregnant, and tells her she must have an abortion. He tells Carmel that Theresa is pregnant, but does not admit to being the father. As he has his first dance with Carmel, an upset Theresa steals the gun from Jacqui's bag and shoots Calvin, and he dies from his injury."]}, {"page": "Daniel Whiston", "response": ["In the seventh series in 2012 Whiston's Partner was Brookside actress Jennifer Ellison. They were eliminated in the semi-final against Jorgie Porter and her partner Matt Evers."]}, {"page": "List of Hollyoaks spin-offs", "response": ["2015 series based on the Channel 4 evening programme Come Dine With Me. The series aired at 7:30pm on E4 during the 20th Anniversary Week. Jimmy McKenna (Jack Osborne), Jessica Fox (Nancy Osborne), Kieron Richardson (Ste Hay), Kirsty Leigh Porter (Leela Lomax), Jessica Ellis (Tegan Lomax) and Jaqueline Boatswain (Simone Loveday) were the Hollyoaks stars that took part. The series was revived in 2020 for the 25th anniversary of Hollyoaks, with Gary Lucy (Luke Morgan), Ruby O'Donnell (Peri Lomax), Rishi Nair (Sami Maalik), Jorgie Porter (Theresa McQueen) and Jeremy Edwards (Kurt Benson) competing.", "1. Amanda Clapham (Holly Cunningham)2. James Sutton (John Paul McQueen) 3. Jessica Fox (Nancy Osborne)4. Jorgie Porter (Theresa McQueen)5. Parry Glasspool (Harry Thompson)6. Jazmine Franks (Esther Bloom)7. Charlie Wernham (Robbie Roscoe)8. Anna Passey (Sienna Blake)9. Cameron Moore (Cameron Campbell)10. Tamara Wall (Grace Black)11. Fabrizo Santino (Ziggy Roscoe)12. Nikki Sanderson (Maxine Minniver)"]}, {"page": "Cindy Cunningham", "response": ["After starting work at Il Gnosh restaurant, Cindy and Tony Hutchinson (Nick Pickard) start dating, despite Darren's jealousy. Darren tells Cindy he still loves her. Although she is seeing Tony, Cindy reciprocates and they plot to scam Tony by Cindy marrying him while Darren deflates The Dog in the Pond's business so they can buy it cheap. Despite his suspicions of Cindy, Tony marries her and they settle into married life and Tony's money. At Christmas, Cindy assumes Tony has bought her an expensive gift, but is disappointed to discover he has gained Holly a place in private school. After Tony buys Tan & Tumble, Cindy instates her position as the manager and reinvents it into clothing shop, Cincerity. Despite Tony's negative views, Cindy is determined to prove him wrong. Holly runs away from home after feeling neglected and seeing Tony kiss Theresa McQueen (Jorgie Porter). Cindy believes her disappearance is just for attention. However, after police find Holly's school bag battered and left in a dustbin, Cindy begins to fear the worst and assumes Holly has been abducted. A nationwide search goes underway. Holly, who had been hiding at Spencer Gray's (Darren John Langford) flat, is found by Jake Dean (Kevin Sacre). Holly is knocked unconscious and Cindy accuses Jake of kidnapping her. As Holly lies in a coma, Cindy feels Tony is not supportive and seeks solace from ex-boyfriend Darren, believing her marriage has terminated. When Holly wakes up, Tony has a heart-to-heart with her, which Cindy overhears. She gives him a second chance. To get their marriage back on track, Cindy suggests they move to North Wales. Tony disagrees, but begins to view properties in the area. While there, he helps Gabby Sharpe (Phina Oruche), who is run over. After a week caring for Gabby, Tony realises that he feels no love for Cindy, so returns and tells her he wants a divorce."]}, {"page": "Jacqui McQueen", "response": ["Jacqui accuses Myra of being a bad mother and suggests it would have been better if Myra had aborted her. Jacqui and Tony reconcile again. Jacqui plans to adopt because of her criminal record. Tony discovers he has a secret child called Harry. Jacqui forces Tony to make a choice: Harry or her. Tony chooses Harry and she ends their relationship and leaves. An intoxicated Tony and Mercedes betray Jacqui by sleeping together. Jacqui fails to resist Tony again and they restart their on-off relationship. She then changes her surname back to McQueen from Malota and Mercedes reveals that she is pregnant and Jacqui asks Mercedes to let her and Tony raise the baby, unaware it's Tony's baby but Mercedes has an abortion, infuriating Jacqui so Myra offers to be her surrogate but she refuses. Tina sees how desperate her sister is for a child and offers to be the surrogate, leaving Jacqui and Tony ecstatic about having a future child. At Tina's scan, Tina's pregnancy paternity results uncover Russ Owen (Stuart Manning) is the baby's father, not her boyfriend and Jacqui convinces her to keep quiet. Niall Rafferty (Barry Sloane) attacks Tina upon discovering she is considering adoption. Tina gives birth to a boy, Max McQueen (Brayden Haynes-Mawdsley) naming him after Max Cunningham (Matt Littler) and then has to have an emergency hysterectomy. Tina then decides to keep Max. Niall holds all the McQueens' hostage in a church and when Myra arrives, she soon learns that Niall is her son. Niall says Myra has to choose two children to die and Jacqui tells Mercedes that she cannot watch her die so Mercedes reveals her night of passion with Tony. Myra comes to a tough decision and chooses Jacqui and Carmel to die. Jacqui is devastated and Niall detonates the explosives and blows up the church and Tina dies. Jacqui confronts Mercedes and Tony, only to learn that the baby Mercedes aborted, was in fact Tony's. This pushes her over the edge. She takes Max from Michaela and refuses to forgive Tony, Mercedes or Myra. Jacqui begins to spend Tony's money and does anything to hurt him, even by sleeping with Mark Gascoyne (Craig Russell). Jacqui and Tony separate and she realises she needs to forgive Myra. Jacqui's cousin Theresa McQueen (Jorgie Porter) arrives and has sex with Tony. Jacqui attacks Tony and reports him to the police, but Theresa later retracts her statement."]}, {"page": "T4 on the Beach", "response": ["At the event, the cast of Hollyoaks filmed a special episode, in which Liberty Savage (Abi Phillips) performs live on the T4 stage, while Ethan Scott (Craig Vye) and Theresa McQueen (Jorgie Porter) are kissing behind her back."]}, {"page": "Newt (Hollyoaks)", "response": ["Newt and Lauren break up as he begins going out with Anita Roy (Saira Choudhry). Jealous, Lauren begins claiming she is being bullied by Anita, although she is not. Newt dumps Anita and tells her never to speak to him again. Newt and Lauren share a kiss and he makes up with Anita, with Lauren still refusing to admit she lied about the bullying. Newt, Theresa McQueen (Jorgie Porter), Lauren and Anita are made to go to detention. Anita and Lauren begin to argue and start to fight, Newt then throws a bucket of water at them, however misses and soaks Theresa. He then offers her his jumper to wear. As she removes her wet top, she tells Newt to turn around, which he does, however watches her in a reflection on a TV. Theresa tells Newt and Lauren that Anita had tried to bleach her skin in order to become white, Lauren admits she had faked being bullied. Newt is angry at Lauren, however Anita tells him not to fight and that she wants everyone to make up."]}, {"page": "Moorside High School, Swinton", "response": ["*Hollyoaks actress Jorgie Porter who attended between 1999 and 2004"]}, {"page": "I'm a Celebrity...Get Me Out of Here! (British TV series)", "response": ["| Jorgie Porter"]}, {"page": "Dancing on Ice: The Tour", "response": ["*Jorgie Porter & Matt Evers"]}, {"page": "Porter (name)", "response": ["* Jorgie Porter (born 1987), British actress"]}, {"page": "Hollyoaks Later", "response": ["On 3 August 2009 it was revealed Hollyoaks Later had been recommissioned for a second series to air in September. The series again follows four storylines: siblings Hannah (Emma Rigby), Josh (Sonny Flood) and Rhys (Andrew Moss) go to a music festival, Tony Hutchinson (Nick Pickard) and Cindy Cunningham (Stephanie Waring) marry, Sarah Barnes (Loui Batley), Zoe Carpenter (Zoë Lister) and Lydia Hart (Lydia Kelly) go to boot camp which ends with \"nightmare consequences\" and Theresa McQueen (Jorgie Porter) and Michaela McQueen (Hollie-Jay Bowes) go to London. On the series, producer Bryan Kirkwood said: \"We've selected some of the best loved Hollyoaks characters, put them in romantic, funny and dangerous situations and I'm hoping viewers love the result\".", "A sixth series of the spin off was announced on 12 June 2013. Long term character Tony Hutchinson (Nick Pickard) will be reunited with former friends Kurt Benson (Jeremy Edwards) and Rory \"Finn\" Finnigan (James Redmond) as well as his brother Dom Reilly (John Pickard) \"on an epic ride of Hangover-style proportions\". They will also be joined by Trevor Royle (Greg Wood) and guest star Danny Dyer.  Other storylines include Esther Bloom (Jazmine Franks), Tilly Evans (Lucy Dixon), Callum Kane (Laurie Duncan) and Holly Cunningham (Wallis Day) celebrating an 18th birthday \"...in a rip-roaring plot as they all find danger in a cabin in the woods.\" Meanwhile, Theresa McQueen (Jorgie Porter) will join up with a new recruit of the McQueen clan on a wild road trip. Jane Steventon, who took charge of last year's successful series, will once again be the show's producer. The series will be executive produced by Hollyoaks boss Bryan Kirkwood. Kirkwood commented: \"We are very happy to announce the commissioning of series six of Hollyoaks Later. It is a returning series that gives an annual late night treat to loyal Hollyoaks fans.\""]}, {"page": "List of British actors", "response": ["* Jorgie Porter (born 1987)"]}, {"page": "Theresa McQueen", "response": ["Theresa McQueen is a fictional character from the British Channel 4 soap opera Hollyoaks, played by Jorgie Porter. She made her first appearance on 24 November 2008. The character was introduced as an extension of already established McQueen family and quickly became a fan favourite for her cute, bubbly personality and dark storylines. During her first five years on the show, Porter was featured in numerous high-profile storylines, including: underage sex; the murder of Calvin Valentine (Ricky Whittle); teenage pregnancy; being the target of serial killer Silas Blissett (Jeff Rawle); falling down a lift shaft; discovering her boyfriend, Ethan Scott (Craig Vye) was dating two other women and forming a friendship with the girls; finding her long-lost father; relationships with Dodger Savage (Danny Mac), Will Savage (James Atherton) and Joel Dexter (Andrew Still); and her arrest for Calvin's murder. Porter announced her departure from the soap in October 2013 so she could focus on Dancing on Ice. Her exit scenes aired on 9 January 2014.", "The character was announced in early November 2008. 20-year-old actress Jorgie Porter was cast as Myra McQueen's (Nicole Barber-Lane) 15-year-old niece, Theresa. She was described as a \"teen temptress\" and \"lolita type\". Porter, speaking of her new role, said: \"I'm thrilled to be joining not just Hollyoaks but one of soap's most notorious families. Although she's feisty with outsiders, Theresa's ranking within the family is low so she's eager to impress. I can’t wait to see how Theresa earns her stripes as part of the McQueen clan!\" Due to the departures of Tina McQueen (Leah Hackett) and John Paul McQueen (James Sutton) earlier in 2008, Hollyoaks producer Bryan Kirkwood added a new member to the McQueen family. Theresa was mentioned earlier before her entrance to the soap on-screen during a conversation between Myra and Nana McQueen (Diane Langton), her mother Kathleen McQueen (Alison Burrows) was also mentioned when it was revealed she was in prison.", "Jorgie Porter made the British Soap Awards shortlist in 2009 and was nominated for 'Best Newcomer' for her portrayal of Theresa. At the 2010 awards, Porter was nominated for 'Sexiest Female' and 'Best Actress'. Porter was nominated in the categories of \"Best Actress\" and \"Sexiest Female\" at the 2011 awards. She has also been nominated for the award of 'Best Serial Drama Performance' at the 2011 National Television Awards. At the 2012 British Soap awards, she was nominated for 'Sexiest Female'."]}, {"page": "List of Hollyoaks characters (1995–1996)", "response": ["Anthony \"Tony\" Hutchinson is a fictional character from the British Channel 4 soap opera Hollyoaks, played by Nick Pickard. He was one of seven original teen characters created for the show. Tony first appeared on-screen on 23 October 1995, the first episode of the series. The character was created by Phil Redmond as one of several main characters for the soap opera and since then has been part of various different storylines including an affair with Helen Cunningham (Kathryn George), the death of his daughter to sudden infant death syndrome and sleeping with underage Theresa McQueen (Jorgie Porter). Tony was the first character to speak on the series."]}, {"page": "List of Hollyoaks characters (2007)", "response": ["In February 2008, Nana returns after Myra is arrested for benefit fraud. After having an argument with Myra she went to The Dog with Niall where she got drunk and confessed to Niall that she forced Myra to give up her son aged 14. In revenge Niall attacked her and left her for dead. She was later found by her granddaughter Tina, and returned home the next day. Nana and the rest of the McQueens were at that point unaware that it was Niall that attacked her. In September 2008, it was revealed that she was on a cruise so she couldn't attend Carmel and Calvin Valentine's (Ricky Whittle) wedding. She returned in November 2008 for Tina's funeral. She was unimpressed with Jacqui and John Paul because they failed to attend the service. Nana mentioned that her daughter, Kathleen McQueen (Alison Burrows), is in prison. She also mentions that Kathleen's daughter, Theresa McQueen (Jorgie Porter), is living with her as a consequence. After arguing with Myra over Niall, Mercedes, threw her out. She returned later the same month when it emerged that Theresa had slept with Tony, who was unaware she was only 15. Nana revealed she used to pose for a Dutch artist whose house she used to clean. In 2009 it turned out that these pictures were worth quite a lot of money; unfortunately for the McQueens, Leila Roy (Lena Kaur) had painted over the canvas. In June 2010 Theresa was sent to stay with Nana but returned after a few weeks, saying she had a miserable time."]}, {"page": "Anita Roy", "response": ["Anita arrives with the Roy family in November 2008. They move into the Ashworths former home. Soon after her arrival, Anita befriends Lauren Valentine (Dominique Jackson) and Barry Newton (Nico Mirallegro). Anita feels she is different from her friends and begins to dress like them, however, is advised by sister Leila Roy (Lena Kaur) to be herself. After helping Bel Roy (Nila Alia) in Evissa, Anita begins to dislike Theresa McQueen (Jorgie Porter). However, the pair do eventually become friends. Anita discovers a CCTV DVD containing Warren Fox (Jamie Lomas) having sex in The Loft with Mandy Richardson (Sarah Jayne Dunn), which Ravi Roy (Stephen Uppal) accidentally left out. Anita then shows Michaela McQueen (Hollie Jay Bowes) and Theresa with Myra McQueen (Nicole Barber-Lane) and Jacqui McQueen (Claire Cooper) deciding to go to Warren's wedding to Louise Summers (Roxanne McKee) and show the wedding party. Gaz Bennett (Joel Goonan) begins to bully Anita, who makes racist comments towards her and he is later expelled from Hollyoaks High School. Lauren and Newt begin to use Anita to cover up their secret relationship with Newt pretending to be Anita's boyfriend. The pair eventually do go out after Lauren and Newt split up."]}, {"page": "Gaz Bennett", "response": ["Gaz first appears as a student at Hollyoaks High School, and he begins work experience at take-away Relish. His work experience turns out bad as he turns up late, does no work and is racist towards Anita, Lauren, Calvin and Ash, which ends up with him being sacked by Ash. At school, local Police Community Support Officer Carmel McQueen (Gemma Merna) opens a police stall. Gaz and his gang turn up a heater, causing Carmel to sweat and take her jacket off. They then give her a lollipop, which she begins to eat, before taking a picture on a mobile phone of her. This phone is then confiscated by Russ Owen (Stuart Manning). The gang later spray-paint a picture of Carmel on the skate ramps, but are interrupted by Calvin, who Gaz is then racist towards. Gaz and his gang steal Relish's week's takings from Gilly Roach (Anthony Quinlan), also beating him up. Zak attacks Gaz, who is scared without his gang. Gilly refuses to acknowledge that it was Gaz who stole the takings. Feeling embarrassed, Gilly tells Ash and Calvin that the man who mugged him was 'huge'. Zak confronts Gaz, but loses his temper and punches him. Zak is cautioned by the police. Gaz and his gang then beat up Gilly, who does not file a complaint. Gaz starts harassing Theresa McQueen (Jorgie Porter), and is warned off by Russ, Jacqui McQueen (Claire Cooper) and Tony Hutchinson (Nick Pickard)."]}, {"page": "The Hammond School", "response": ["Jorgie Porter actress and model, portrayed Theresa McQueen on the Channel 4 soap Hollyoaks and for being a contestant on I'm a Celebrity...Get Me Out of Here! and Dancing on Ice."]}, {"page": "List of Hollyoaks characters (2009)", "response": ["Kathleen McQueen, played by Alison Burrows, made her first appearance in Hollyoaks spin-off Hollyoaks Later in September 2009 as the mother of already-established character Theresa McQueen (Jorgie Porter). After her initial appearance, Burrows reprised the role of Kathleen on the main Hollyoaks show, before making her final appearance in February 2010.Moon, Katy (2 February 2010). \"Who's in? Who's out?\". Inside Soap, Issue 5: 6–12 February 2010. Retrieved 2010-02-02. In October 2010, it was announced that Kathleen would be reintroduced in December 2010, in a storyline which features her blackmailing her family after discovering one of the McQueens' \"darkest secrets\"."]}, {"page": "Hollyoaks Later (series 2)", "response": ["| Jorgie Porter"]}, {"page": "Kathleen McQueen", "response": ["Kathleen McQueen is a fictional character from the British Channel 4 soap opera Hollyoaks, played by Alison Burrows. She first appeared during late-night spin-off Hollyoaks Later in September 2009 as the sister of Myra McQueen (Nicole Barber-Lane) and mother of Theresa McQueen (Jorgie Porter). Burrows reprised her role as Kathleen in August 2014, but left again in September.", "The character of Kathleen was first announced in July 2009 as the mother of Theresa McQueen, another member of the McQueen family. Hollyoaks producers announced that Kathleen would be portrayed by Alison Burrows and would appear in the second series of Hollyoaks Later. Hollyoaks Later producer Bryan Kirkwood described Kathleen's entrance storyline in an interview with Digital Spy: \"Theresa gets a modelling job in the City and wants to kill two birds with one stone and visit her mum Kathleen in prison while she's there. Jorgie Porter's really blossomed over the last year and turns out some emotional stuff when she meets her screen mum.\"", "In October 2010, it was announced that Burrows would reprise her role in December 2010, reintroduced by series producer Paul Marquess in a storyline which features Kathleen blackmailing her family after discovering one of the McQueens' \"darkest secrets\". Jorgie Porter later expressed her excitement over Kathleen's return: \"I love working with Ali. The scenes we do together are so intense — I hope she stays at Hollyoaks for a lot longer this time.\" Marquess later announced a Hollyoaks late-night special called Hollyoaks: King of Hearts, which would focus on the McQueens attempts to collect money to pay Kathleen after her threats to report Theresa for the murder of Calvin Valentine (Ricky Whittle)."]}]}}