{"wiki_id": "http://www.wikidata.org/entity/Q6270317", "itemLabel": "Jon Ashton", "itemDescription": "English association football player (born 1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jon_Ashton", "wikipedia_page": {"main": "Jonathan James Ashton (born 4 October 1982) is an English former professional footballer who played as a defender. He is a first-team fitness coach at League One club Ipswich Town.\nA product of Leicester City's youth academy, Ashton made seven Premier League appearances for the club during the 2001–02 season. During his time at Leicester, he was loaned out to Notts County and Oxford United to gain first-team experience. He joined Oxford on a permanent basis in September 2003 and played 103 matches for the club over three league seasons, before being released in May 2006. Ashton signed for Rushden & Diamonds ahead of the 2006–07 season, spending one season there before joining Essex club Grays Athletic on a free transfer in May 2007. He spent one-and-a-half years with Grays, during which he earned four caps for the England C team.\nAshton signed for fellow Conference Premier club Stevenage Borough for an undisclosed fee in January 2009. He made 234 appearances during his six years at Stevenage, helping the club earn back-to-back promotions from the Conference Premier to League One. Ashton left Stevenage in the summer of 2015 and joined Crawley Town of League Two. He then signed for National League club Braintree Town in July 2016, before returning to Grays Athletic on loan. Having initially joined Grays permanently ahead of the 2017–18 season, Ashton was offered a player-assistant manager contract at hometown club Nuneaton Town, which he signed in August 2017. The campaign proved to be Ashton's final season playing; as he returned to Stevenage as a fitness coach, before joining Ipswich Town in May 2021.", "link_mentions": [{"page": "Ipswich Town F.C.", "response": ["|  Jon Ashton"]}, {"page": "Stevenage F.C.", "response": ["* 2011   Jon Ashton"]}, {"page": "England national football C team", "response": ["|Andy Burgess, John Grant, Jon Ashton"]}, {"page": "John Ashton", "response": ["* Jon Ashton (born 1982), English footballer"]}, {"page": "Mark Roberts (footballer, born 1983)", "response": ["Roberts scored his first goal of the 2009–10 season on his 50th appearance for the club, giving Stevenage the lead in a 3–1 victory over Salisbury City on 17 October 2009. He captained the team in their 2–0 victory against Kidderminster Harriers at Aggborough on 17 April 2010; the match that secured promotion to the Football League for the first time in the club's history. Roberts played 49 times during the season, scoring five times from defence. He was also named as the Conference Premier Player of the Month for April 2010. During the season, Roberts formed a centre-back partnership with Jon Ashton, with Stevenage having the best defensive record in the league, conceding 24 goals in 46 league matches. The team ended the season having not conceded in their last six games; and conceded two goals in their last 15 league matches. In May 2010, Roberts signed a new two-year contract with Stevenage. On signing the new deal, Roberts said \"there was never any doubt that I wanted to stay here, I love the club and love the fans. It will be a privilege to lead the team in the Football League\". At the Football Conference's Annual Presentation Dinner, he was named in the Team of the Year, alongside fellow Stevenage defenders Ronnie Henry and Scott Laird.", "In the summer of 2012, Stevenage stated that they had rejected several bids for Roberts, along with fellow Stevenage centre-back Jon Ashton, from League One club Doncaster Rovers. He captained the team in Stevenage's first game of the 2012–13 season, scoring the third goal in a 3–1 victory against AFC Wimbledon in the League Cup on 14 August 2012. Two days after the game, Stevenage released a statement announcing they would not be selling Roberts during the season. Roberts scored his first league goal of the season in Stevenage's 4–1 defeat to Sheffield United at Bramall Lane, scoring an equaliser just before half-time, heading in Filipe Morais's corner. In February 2013, Roberts was one of three players shortlisted by the Football League for the Player in the Community award as a result of his work in the local community over the past few years. The club stated – \"we are extremely proud that Mark has been shortlisted for this award, he is a credit to the football club and his day to day work and support of the community scheme and the club's community work is due worthy recognition\". Following the departure of manager Gary Smith in March 2013, Roberts was again appointed as caretaker manager while the club searched for a new manager. He managed the team for Stevenage's televised away match against Tranmere Rovers, which ended in a 3–1 defeat on 24 March 2013. In Stevenage's next match, on 29 March 2013, Roberts scored a first-half header in a 1–1 away draw with Crawley Town, briefly giving Stevenage the lead with the team having to play with 10 men for most of the match following Miguel Comminges' early red card. In what was his last match in caretaker charge, Roberts stated he was \"proud of the phenomenal performance\", and that \"the attitude, the way the lads reacted to the adversity we faced was probably something I haven't seen all season, to that level anyway\". A day later, Graham Westley was re-appointed as Stevenage manager, who brought Roberts to the club in 2008, and as a result Roberts was able to concentrate solely on his playing role. He played 48 times during the season, scoring four goals. During his four-and-a-half-year spell at Stevenage, Roberts made 239 appearances in all competitions, an appearance record that places him sixth on the club's all-time appearance list, and scored 27 goals."]}, {"page": "Graham Westley", "response": ["Stevenage started the season poorly, losing three out of their first four games and conceding thirteen goals in the process, including a 5–0 defeat to Wrexham on the first day of the season. The club secured its first victory of the season on 30 August 2008, a 3–1 win away at Barrow, before winning four consecutive matches throughout September. Through the first half of the club's 2008–09 campaign, Westley's team were suffering from the same inconsistency that was common in his first spell as manager of the Hertfordshire club, losing three consecutive matches in November, the last of which was a 2–1 home defeat to Wrexham; it was to be Stevenage's last defeat at Broadhall Way in the league for 18 months. Westley brought in former player, Dino Maamria as first-team coach at the club. This, coupled with signings during the season, such as Chris Day, Mark Roberts, and Jon Ashton, meant that Stevenage improved during the second half of the season. A club record 24-game unbeaten run lasting from December 2008 to April 2009 meant that the club made the Conference Premier play-offs, finishing in the last play-off place. Despite taking a 3–1 lead into the second leg, Stevenage lost 4–3 on aggregate to Cambridge United. The club won the FA Trophy that season, beating York City 2–0 in the Final at Wembley Stadium. The FA Trophy success was Westley's first managerial honours won as manager of Stevenage. After the game, Westley signed a one-year contract extension."]}, {"page": "Dino Maamria", "response": ["Maamria subsequently rejoined former club Stevenage as part of Graham Westley's coaching team in November 2008, appointed as the club's first-team coach. Shortly after joining, Maamria recommended Stevenage sign Mark Roberts, who he had previously managed at Northwich, with Roberts stating he joined the club because of Maamria's belief and desire. Maamria's appointment, alongside a number of new signings such as Roberts and Jon Ashton, coincided with an upturn in form for Stevenage, with the club going on a club record 24-game unbeaten run stretching from December 2008 to April 2009. During the season, he was also included as part of the playing squad, helping the club to its first ever Herts Senior Cup title in April 2009, scoring twice in the final against Cheshunt in a 2–1 victory. Later that month, he made a 90th-minute appearance in Stevenage's 1–0 victory over Ebbsfleet United, in what turned out to be his last professional appearance. Maamria earned his first piece of silverware as first-team coach when the club won the FA Trophy at Wembley Stadium, defeating York City 2–0 in the final on 9 May 2009."]}, {"page": "2009–10 Stevenage Borough F.C. season", "response": ["| Jon Ashton", "This was followed up with another 1–1 draw at newly promoted Conference South play-off winners Hayes and Yeading on 11 August. Stevenage opened the scoring in the second-half through midfielder Andy Drury, but were pegged back ten minutes later following good work from ex-Borough winger Dale Binns, who set-up Danny Allen-Page to finish from close range. Stevenage then drew their third game within the space of a week, playing out a 0–0 stalemate with Barrow at Holker Street. Three days later, Borough recorded their first win of the 2009–10 season, with a 3–0 victory over Ebbsfleet United at Broadhall Way. Chris Beardsley scored on his debut after just 10 minutes, with Joel Byrom and Lawrie Wilson adding to Stevenage's tally courtesy of two second-half goals. Stevenage lost their first game of the season on 22 August, losing 2–1 against Oxford United at the Kassam Stadium, with Yemi Odubade scoring his first goal for Borough deep into injury-time. A week later, Stevenage beat Rushden & Diamonds 2–1, with goals from Lee Boylan and Michael Bostwick after Cliff Akurang had equalised for the away side. The visitors played the majority of the game with 10-men, having had Michael Corcoran sent-off for a tackle on Lawrie Wilson, which resulted in the latter suffering a dislocated ankle and broken leg in three places. The Hertfordshire side then gained their first away win of the season two days later, with a 2–0 victory against Histon despite playing the majority of the game with ten men after Peter Vincenti was sent-off in the sixth minute for violent conduct. However, goals from both Scott Laird and Eddie Odhiambo secured the three points. Daniel Wright also missed a penalty for the home side late on. This was followed up with a third successive victory against Eastbourne Borough at Broadhall Way eight days later. Jon Ashton scored his first goal in Stevenage colours, heading in from Joel Byrom's corner. Ronnie Henry then doubled the home side's lead in the second-half following good work from Mitchell Cole.", "This was followed up with a 2–0 mid-week victory over Chester City at Broadhall Way. In what was a comfortable, but unspectacular, game, Stevenage took the lead through Yemi Odubade, who fired in following Mark Roberts' knock down just before half-time. Borough doubled their lead on the hour mark, with Mark Roberts firing home with his back to goal in the box. Four days later, Stevenage won their fourth consecutive league game with a 1–0 win away at Salisbury City, with Charlie Griffin scoring just before half-time. Borough suffered a second league defeat at the hands of Ebbsfleet United at Stonebridge Road. Stevenage took the lead through a deflected effort from Yemi Odubade, but two second-half strikes from Stefan Bailey secured the home side a valuable victory. Four days later, Stevenage returned to winning ways with a 2–0 victory over Kidderminster Harriers at Broadhall Way, with goals from Jon Ashton and Mitchell Cole.", "A week later, at the beginning of March, Stevenage won their second away game on the bounce; beating Eastbourne Borough 6–0. Captain Mark Roberts gave Stevenage the lead just before the break, following a well-worked free-kick involving both Joel Byrom and Scott Laird. After the interval, Stevenage doubled their lead when David Bridges headed in Joel Byrom's cross. It was three shortly after following a mistake from Eastbourne goalkeeper Danny Knowles, Chris Beardsley blocked the goalkeepers clearance and slid the ball into an empty net. It got worse for the home side ten minutes from time when Beardsley chased a long through ball and was hauled down by Darren Baker just inside the area – the defender being shown a straight red. Substitute Mitchell Cole slotted the penalty home, before adding another after good work from Eddie Odhiambo. Cole completed his hat-trick moments later slotting home Stacy Long's through ball. A third successive victory followed in a 2–0 win at home to Crawley Town. In a tight game, Stevenage took the lead just after the interval thanks to a rasping effort from Michael Bostwick after a well-worked corner. A second goal came deep into injury-time, Chris Beardsley countering and setting up Lee Boylan to slide the ball into the net. Three days later, Stevenage beat Barrow 4–0 to ensure a fourth consecutive win. In a tight first half, the home side took the lead through Yemi Odubade. Borough doubled their lead shortly before the interval; left-back Scott Laird firing the ball home. Odubade then scored his second after countering a Barrow corner, and subsequently completed his hat-trick late on with an effort drilled high into the net. Stevenage recorded their fifth straight win, beating Histon 1–0 at Broadhall Way. Jon Ashton scored the only goal of the game when he swept home Stacy Long's corner."]}, {"page": "History of Rushden & Diamonds F.C.", "response": ["Paul Hart took over as manager on 23 May and during the summer, Hart signed former Gillingham defender Chris Hope, Leo Fortune-West, Glenn Wilson, Paul Watson and Jon Ashton. However, following a poor run of results, Hart left by mutual consent in mid-October, with goalkeeping coach Tony Godden becoming caretaker manager."]}, {"page": "2010 FA Trophy Final", "response": ["|CB ||5 || Jon Ashton"]}, {"page": "2010–11 Stevenage F.C. season", "response": ["Byron Harrison, who joined the club in January 2011, and John Mousinho, finished as joint top goalscorers for the season with eight goals each. Goalkeeper Chris Day played every minute of every one of Stevenage's 56 games during the season. Jon Ashton won all three end of the season awards, including Player of the Year.", "| Jon Ashton", "The 2010–11 League Two fixtures were released on 17 June 2010, with Stevenage opening their league campaign at home to Macclesfield Town on 7 August 2010. The game ended 2–2. Peter Vincenti opened the scoring for the hosts after just six minutes; heading in Charlie Griffin's looping cross. Macclesfield equalised just four minutes later after Matt Hamshaw's cross was headed in by Nat Brown. Tyrone Barnett then put the away side ahead early in the second–half. Stevenage levelled the game with just one minute remaining after Rob Sinclair cut in from the right and slid the ball to Charlie Griffin, who poked the ball past the on–rushing Veiga. The club's first away game in the Football League ended in a 1–0 defeat against Bradford City at Valley Parade. Bradford striker Gareth Evans scored the only goal of the game from the penalty spot in the first–half in a game that was \"rough luck on the visitors\" having dominated large parts of the game. Stevenage won their first game of the season a week later, beating Stockport County 3–1 at Broadhall Way. Charlie Griffin opened the scoring with a looping header after half an hour, before Michael Bostwick's 30-yard effort found the top corner two minutes before the interval. Griffin added the third with a close range effort in the second-half, with Stockport's George Donnelly scoring a consolation goal in injury–time. A week later, Stevenage travelled to Aldershot Town for their second away fixture of the season. The game ended all square, finishing 1–1. Chris Beardsley opened the scoring five minutes into the second-half, with Aldershot striker Damian Spencer equalising fifteen minutes later. With just five minutes remaining, Jon Ashton was adjudged to have fouled Spencer in the area, with referee Mark Halsey pointing to the spot. Marvin Morgan's resulting penalty was palmed away by Chris Day to ensure Stevenage earned their first point on the road.", "Stevenage hosted Crewe Alexandra in the first weekend of September, which resulted in a 1–1 draw. Crewe were forced to wear Stevenage's yellow away strip after the referee deemed their current away kit to clash with the red and white of Stevenage. Stevenage took the lead just before the interval, Yemi Odubade tapping the ball into the net after Stacy Long's initial shot had rebounded off of the post. Crewe equalised ten minutes into the second-half, Ashley Westwood scoring from just outside the area. The home side were reduced to ten men just minutes later as Long was sent-off for two bookable offences. A week later, Stevenage lost their second league game of the season, losing 1–0 to Cheltenham Town at Whaddon Road. The following game, Stevenage drew 0–0 at home to Torquay United – who had sat at the top of the table before the start of the match. Stevenage won their first away game of the season against Lincoln City, winning 1–0 at Sincil Bank. New loan signing Chris Holroyd scored the only goal of the game just before half-time, lashing the ball high into the roof of the net after Charlie Griffin had brought down Darius Charles' throw-in. First-team coach Dino Maamria was also listed as a substitute, but was unused. Three days later, Stevenage recorded their second away win of the campaign, beating Hereford United 4–1. Stevenage opened the scoring after thirteen minutes, Chris Holroyd latching onto Lawrie Wilson's cross to give the visitors a one-goal lead going into the interval. However, just four minutes into the second-half Hereford restored parity through Sean Canham. On the hour mark, the away side led once again, Jon Ashton heading home Wilson's corner to score his first goal of the season. Stevenage doubled their advantage just seven minutes later, Chris Holroyd scoring from six yards out. Holroyd completed his hat-trick with ten minutes remaining; Peter Vincenti broke down the right, squared the ball to Holroyd who composed himself before scoring his fourth goal in two games.", " The teams last met in the Fourth Round of the same competition in January 1998, a tie that is remembered for Giuliano Grazioli's equaliser to take the game to a replay, as well as Alan Shearer's \"controversial goal that appeared to not cross the line\" in the replay at St James' Park. The game was televised on ESPN and took place on 8 January 2011 in front of a crowd of 6,644. Stevenage won the tie 3–1, becoming only the third team in the fourth tier of English football to beat a Premier League side since its formation. Stevenage took the lead five minutes into the second-half, Stacy Long's shot took a deflection off the head of Mike Williamson, beating the stranded Tim Krul. Five minutes later, Stevenage doubled their lead, Michael Bostwick picked up the loose ball and rifled in a shot that went in off the post from 25 yards out. Newcastle substitute Cheik Tiote was given a straight red card with twenty minutes remaining for a foul on Stevenage defender Jon Ashton. Joey Barton pulled a goal back for Newcastle in injury-time with a long range effort that dipped over Chris Day, but Stevenage replied instantly with Peter Winn neatly finishing past Krul after good work from John Mousinho.", "|Jon Ashton", "|Jon Ashton", "|Jon Ashton"]}, {"page": "2003–04 Leicester City F.C. season", "response": ["* Jon Ashton – released, 7 May (later joined Oxford United on 8 September)"]}, {"page": "2001–02 Leicester City F.C. season", "response": ["|align=\"left\"|35||align=\"left\"|DF||align=\"left\"| Jon Ashton"]}, {"page": "2011 Football League Two play-off Final", "response": ["|DF ||5||Jon Ashton"]}, {"page": "2011–12 Stevenage F.C. season", "response": ["| Jon Ashton", "The 2011–12 League One fixtures were released on 17 June 2011, with Stevenage opening their league campaign at home to Exeter City on 6 August 2011. The game ended 0–0, with both sides spurning a number of goalscoring opportunities. The result meant that Stevenage had drawn their opening league fixture for the third consecutive season. A week later, Stevenage drew 1–1 away at Chesterfield. Stevenage took the lead five minutes before the interval, Darius Charles heading in from close range after Michael Bostwick's looping header was guided towards goal. Bostwick was sent-off twenty minutes into the second-half, receiving a second bookable offence for a foul on Mark Allott. The home side equalised late on when Jack Lester headed in Dean Morgan's cross. Three days later, Stevenage earned their first win of the season, securing a 3–1 away victory against Bournemouth. Stevenage took the lead shortly before half-time, Craig Reid's quick turn and shot beating Shwan Jalal in the Bournemouth goal after Lawrie Wilson's threaded ball beat the offside trap. Two minutes after the interval, the home side were level, substitute Harry Arter scoring from Marc Pugh's squared pass. The away side took the lead once more with half an hour remaining, John Mousinho scoring from the penalty spot after Bournemouth captain Adam Barrett handled Stacy Long's shot on the line, receiving a red card in the process for denying a goalscoring opportunity. Stevenage doubled their advantage in injury-time when Chris Beardsley latched on to Scott Laird's pass and beat Jalal with a first time finish. Stevenage then drew 2–2 at home to Hartlepool United on 20 August, coming from two goals down to salvage a point. The visitors opened the scoring through Peter Hartley's headed goal from a corner ten minutes before the interval. Hartlepool doubled their lead just before half-time through an Adam Boyd penalty kick after Colin Nish was fouled in the area by Jon Ashton. With twenty minutes remaining, Byron Harrison scored his first goal of the season when he netted from six yards out. Scott Laird then restored parity with just two minutes remaining, heading in Robin Shroot's corner to ensure Stevenage earned a point. A week later, Stevenage lost their first league game of the season when they travelled to league leaders Milton Keynes Dons, losing 1–0 courtesy of a second-half goal from Charlie MacDonald.", "A third consecutive defeat followed a week later, on 1 October, as Stevenage lost 2–1 to Scunthorpe United at Broadhall Way. Similarly to the club's last home defeat to Notts County, the visitors opened the scoring in first-half injury time, Eddie Nolan cutting in from the left and beating Chris Day from 20 yards out. Michael O'Connor doubled Scunthorpe's advantage in second-half injury time with a finish from an acute angle, before substitute Josh Walker scored two minutes later to half the deficit. Stevenage then lost 2–1 away to Huddersfield Town, a fourth straight defeat. Huddersfield opened the scoring just before half-time through Gary Roberts. Scott Laird briefly levelled the game with twenty minutes remaining, scoring with a shot from just inside the area after John Mousinho had played the ball into his path. The home side took the lead again shortly after, this time Lee Novak scoring after Anton Robinson's shot had hit the post. Mousinho missed a late penalty for Stevenage after Byron Harrison was fouled in the area. The four game losing streak ended a week later, on 15 October, when Stevenage beat Charlton Athletic 1–0, ending Charlton's unbeaten start to the season. The only goal of the game came eleven minutes into the match, former Charlton player Stacy Long saw his 25-yard shot take a deflection to wrongfoot goalkeeper Ben Hamer. Both sides went on to create further chances, with Leon Cort producing a save from Chris Day in the Stevenage goal, as well as Jon Ashton hitting the crossbar for the home side. A 0–0 draw against Yeovil Town followed a week later, with John Mousinho missing a penalty with ten minutes remaining. The penalty came about as a result of Yeovil's Luke Ayling handling the ball on the line, receiving a straight red card. There was a \"great sense of injustice around the ground\" as Mark Roberts scored the rebound after Ayling had handled — with the referee refusing to give Stevenage the advantage and instead opting to award the penalty. Three days after the draw, on 25 October, Stevenage travelled to Brentford, winning the match 1–0, their second away victory of the campaign. The only goal of the game came with twenty minutes left in the second-half; Chris Beardsley picking the ball up in the area before lashing a shot across the face of goal and into the net.", " The club travelled to Sheffield Wednesday on 14 February, manager Gary Smith's first league game in-charge, winning the game 1–0 at Hillsborough. The only goal of the game came shortly before the interval, Joel Byrom's corner was met by Chris Beardsley, whose header was ultimately turned in by Scott Laird. Stevenage then faced Notts County at Meadow Lane on 22 February, losing 1–0 courtesy of a late Jeff Hughes strike. Another defeat followed three days later, with the club losing 2–0 to league leaders Charlton Athletic at The Valley. Charlton took the lead shortly after the interval, defender Michael Morrison opened the scoring with a half volley from the edge of the area. Striker Bradley Wright-Phillips doubled Charlton's advantage with a deflected effort. Three days later, on 28 February, Stevenage faced fourth placed Huddersfield Town at Broadhall Way, drawing 2–2. The hosts were without first-team regulars Jon Ashton, Chris Beardsley, Luke Freeman, and John Mousinho, and goalkeeper Chris Day was forced off with a shoulder injury at half-time. Huddersfield took the lead shortly after the interval, Lee Novak slid in Danny Ward, who finished from an acute angle. The away side doubled their advantage just five minutes later, Novak scoring from 20-yards courtesy of a powerful strike. Stevenage reduced the deficit with twenty minutes left when Joel Byrom's corner found the head of Michael Bostwick, whose powerful header beat Alex Smithies in the Huddersfield goal. The hosts then had the opportunity to draw level after Wilson was fouled in the area by Sean Morrison, although Scott Laird saw his subsequent penalty saved by Smithies. With just two minutes remaining, Stevenage equalised. Substitute Jennison Myrie-Williams found space on the left wing, and fired the ball across goal, reaching fellow substitute Robin Shroot, who finished from a tight angle to ensure Stevenage earned a valuable point.", "Stevenage's nine game unbeaten run was ended on 6 April, losing 3–0 away to Tranmere Rovers courtesy of two early goals from on loan striker Jake Cassidy, and a second-half strike from Lucas Akins. Three days later, on 9 April, Stevenage welcomed Preston North End to Broadhall Way, signalling the return of former manager Graham Westley, who left Stevenage in January 2012 to take up the vacant position at Deepdale. The game ended 1–1, stretching Stevenage's winless run to seven league games. Preston took the lead with just four minutes remaining, with substitute Iain Hume sliding the ball in from six yards out following Danny Mayor's through ball. Stevenage then equalised in the fourth minute of injury time, with captain Mark Roberts heading in Michael Bostwick's floated cross to ensure a share of the spoils. The result meant that Stevenage were in ninth position, six points away from the final play-off place with just six games remaining. Stevenage travelled to in-form Yeovil Town five days after the draw with Preston, looking to secure a first away win in just under two months. Stevenage won the match 6–0, recording their biggest Football League victory to date, as well as recording the joint biggest away victory of 2011–12 League One campaign. Stevenage took an early lead in the match when Patrick Agyemang was played into the area by Craig Reid, Agyemang then squared the ball across goal for Luke Freeman to score from close range. Yeovil were reduced to ten men when Michael Woods fouled Michael Bostwick. Agyemang scored Stevenage's second goal when he collected Jamaal Lascelles long pass, before calmly beating Sam Walker in the Yeovil goal. Two goals within the space of three second half minutes put the game beyond doubt, with Jon Ashton and Lascelles scoring headers from set pieces. Mark Roberts added a fifth goal with ten minutes remaining — prodding in Freeman's centre. Freeman then scored his second, and Stevenage's sixth, when Jordan Slew made room down the right wing after a neat interchange with Agyemang, before finding Freeman at the back post to tap in from six yards out. The club then welcomed play-off rivals Carlisle United to Broadhall Way, knowing that a defeat would virtually end the club's play-off hopes. Stevenage dominated the first-half, but were unable to take an advantage into the interval. The second half was a much more even affair, with both teams spurning goalscoring opportunities. The deadlock was broken with just fifteen minutes remaining, substitute John Mousinho, returning from a six-month injury lay-off, latched onto Stacy Long's chipped through ball, before crashing the ball into the goal off the crossbar. Four days later, on 21 April, Stevenage hosted another team hoping to snatch the final play-off place when Brentford travelled to Broadhall Way. Stevenage secured a 2–1 victory, consequently ending Brentford's play-off hopes in the process. The visitors had the opportunity to take the lead on the half hour mark when Jamaal Lascelles was adjudged to have pushed Clinton Morrison in the area. However, Clayton Donaldson's penalty rebounded off the crossbar and Stevenage were able to clear to ensure the teams went in level at half-time. Brentford were then handed another chance from the penalty spot five minutes after the interval, this time the referee deemed Jon Ashton to have fouled Morrison. Brentford's Sam Saunders stepped up and his powerful penalty rebounded off the post and into the arms of Chris Day. Just three minutes after the second penalty miss, Stevenage were one goal to the good. Craig Reid controlled Lawrie Wilson's low cross, before hitting a shot on the turn that bounced off the ground and past Brentford goalkeeper Simon Moore. Luke Freeman then doubled Stevenage's advantage ten minutes later, dispossessing Adam Thompson before cutting in and hitting a right-footed shot that crashed into the goal off the post. Saunders reduced the deficit in injury-time with a curling free-kick, although Stevenage held on to secure a vital victory. The third straight victory, coupled with Notts County's home loss to Bury, meant that Stevenage were back in the play-off places with just two games remaining. Stevenage then travelled to Bramall Lane to face Sheffield United in a game that was televised live on Sky Sports on 28 April, and attracted a crowd of over 30,000 spectators. The game was an evening kick-off, meaning Stevenage had moved down to seventh in the league table as a result of Notts County's 4–3 win at Wycombe Wanderers earlier in the day. The game ended 2–2, with Stevenage taking a two-goal lead through strikes from Joel Byrom and Scott Laird, before Sheffield United's Richard Cresswell and Matthew Lowton restored parity. The draw meant that Stevenage had regained their place in sixth with just one game remaining."]}, {"page": "2012–13 Stevenage F.C. season", "response": ["| Jon Ashton"]}, {"page": "2013–14 Football League One", "response": ["| Jon Ashton"]}, {"page": "2013–14 Stevenage F.C. season", "response": ["|Jon Ashton"]}]}}