{"wiki_id": "http://www.wikidata.org/entity/Q6274456", "itemLabel": "Jonathan Smith", "itemDescription": "British psychologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Smith_(psychologist)", "wikipedia_page": {"main": "Jonathan Alan Smith is a psychologist currently based at Birkbeck, University of London. He has been very prominent in promoting qualitative research within social psychology and health psychology. In particular, he has developed and promoted a particular approach known as interpretative phenomenological analysis (IPA).Smith achieved a DPhil in Psychology from the University of Oxford and then held lectureships at Keele and Sheffield Universities. He has at least 160 publications to his name.\n\n", "link_mentions": [{"page": "Jonathan Potter", "response": ["Their paper on problems and prospects in the use of qualitative interviews in psychology, published in Qualitative Research in Psychology, generated debate with Jonathan Smith, Wendy Hollway and Elliot Mischler.  It has been widely cited.  This stimulated a further debate in Qualitative Research with Chris Griffin and Karen Henwood."]}, {"page": "Jonathan Smith", "response": ["*Jonathan Smith (novelist) (born 1942), English novelist and playwright", "*Jonathan Smith (musician) (fl. 2002–2013), American drummer in the band Days Difference ", "*Jonathan Smith (A Place to Bury Strangers), aka Jono MOFO, bassist for the band A Place to Bury Strangers", "*Jonathan Smith (American football coach) (born 1979), American college football coach and player", "*Jonathan Smith (wide receiver) (born 1981), American NFL football wide receiver", "*Jonathan Smith (running back) (born 1981), American football running back", "*Jonathan Smith (footballer, born 1891), English player with QPR, Swansea Town; on List of Manchester City F.C. players", "*Jonathan Smith (footballer, born 1986), English footballer", "*Jonathan Smith (footballer, born 1988), English footballer", "*Jonathan Smith (tennis) (born 1955), British tennis player", "*Jonathan Smith (rower) (born 1961), American rower", "*Jonathan Smith (rugby league) (born 1979), New Zealand rugby league footballer", "*Jonathan Smith (racing driver) (born 1986), American race car driver", "*Jonathan Smith (priest) (born 1955), Church of England priest and Archdeacon of St Albans", "*Jonathan Smith (games programmer) (1967–2010), British games programmer", "*Jonathan Smith (psychologist), British psychology professor"]}, {"page": "Rom Harré", "response": ["Harré was one of the world's most prolific social scientists. He wrote on a wide variety of subjects including: philosophy of mathematics, philosophy of science, ontology, psychology, social psychology, chemistry, sociology and philosophy. He was an important early influence on the philosophical movement critical realism, publishing Causal Powers with E. H. Madden in 1975. He supervised Roy Bhaskar's doctoral studies, and continued to maintain close involvement with realism. He also supervised Patrick Baert, German Berrios, and Jonathan Smith's doctoral studies, respectively in social theory, history and epistemology of psychiatry, and social psychology. Another one of Harré's distinctive contributions was to the understanding of the social self in microsociology, which he called \"ethogenics:\" this method attempts to understand the systems of belief or means by which individuals can attach significance to their actions and form their identities, in addition to the structure of rules and cultural resources that underlie these actions.Burkitt, Ian. (1991). Social Selves: Theories of the Social Formation of Personality. London: SAGE Publications, 55, 65–66 In his later years Harre returned to his first love of chemistry and became the honorary president of the International Society for the Philosophy of Chemistry. In addition to regular lectures and articles on the subject, he organized two international conferences on the philosophy of chemistry, one in Oxford and the second at the London School of Economics while he was the director of its Center for the Philosophy of Science."]}, {"page": "Interpretative phenomenological analysis", "response": ["*Jonathan Smith (psychologist)"]}, {"page": "Phenomenology (psychology)", "response": ["Early phenomenologists such as Husserl, Jean-Paul Sartre, and Maurice Merleau-Ponty, conducted philosophical investigations of consciousness in the early 20th century. Their critiques of psychologism and positivism later influenced at least two main fields of contemporary psychology: the phenomenological psychological approach of the Duquesne School (the descriptive phenomenological method in psychology), including Amedeo GiorgiGiorgi, Amedeo. (2009). The Descriptive Phenomenological Method in Psychology. Duquesne University Press: Pittsburgh, PA. and Frederick Wertz; and the experimental approaches associated with Francisco Varela, Shaun Gallagher, Evan Thompson, and others (embodied mind thesis). Other names associated with the movement include Jonathan Smith (interpretative phenomenological analysis), Steinar Kvale, and Wolfgang Köhler. But \"an even stronger influence on psychopathology came from Heidegger (1963), particularly through Kunz (1931), Blankenburg (1971), Tellenbach (1983), Binswanger (1994), and others.\" Phenomenological psychologists have also figured prominently in the history of the humanistic psychology movement."]}]}}