{"wiki_id": "http://www.wikidata.org/entity/Q6273661", "itemLabel": "Jonathan Lee", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Lee_(novelist)", "wikipedia_page": {"main": "Jonathan Lee (born 24 April 1981) is a British writer best known as the author of the novels Who Is Mr Satoshi?, Joy, High Dive and The Great Mistake. The Guardian has described Lee as \"a major new voice in British fiction.\"On publication Who Is Mr Satoshi? was reviewed by the British press. The Observer called it 'elegant and incisive', The Independent said it was a 'masterful first novel', The Daily Telegraph called it a 'funny, insightful and beautiful'. The novel was also praised by several well-known literary fiction writers, including Giles Foden, author of The Last King of Scotland, who called it 'funny and moving'.Who Is Mr Satoshi? was a runner-up in the Edinburgh Festival's First Book Award 2010 and led to Jonathan Lee being shortlisted for the Desmond Elliott Prize for literature 2011.In an interview in the Financial Times it was stated that Jonathan Lee was born in Surrey in 1981, graduated from the University of Bristol with a First in English Literature and was working as a solicitor when he wrote his debut novel.\nLee's second novel, Joy, was released in June 2012. It was widely reviewed, with The Observer declaring that it is 'exquisitely and surprisingly written ... it proves that Lee is a significant talent', the Literary Review saying it is 'an enormously impressive piece of storytelling' and Henry Sutton writing in The Mirror that 'Lee's the real deal—a British writer on the cusp of greatness ... A brilliant & powerful dissection of modern Britain' . Booker Prize shortlisted author A.D. Miller said that 'with its supple prose, ingenious structure, wit & slow-burn sympathy, Joy is a sly miracle of a novel'. However, some reviewers such as the reviewer on the Book Oxygen blog were far more critical, arguing that the book is unnecessarily 'complex and demanding' and can at times 'feel like a product'. An article in The Guardian alleged that Joy was inspired by the death of an ex-colleague of Lee's in 2007, while Lee was working as a lawyer at the same law company.After the publication of Joy, Lee won a Society of Authors K Blundell Trust Award and was long listed for the Sunday Times EFG Short Story Award.High Dive, Lee's third novel, was published in the UK in 2015 and re-imagined events surrounding the Brighton hotel bombing by the Provisional Irish Republican Army in 1984, an attempt to assassinate then Prime Minister Margaret Thatcher The Sunday Times called it \"an extraordinary performance: vividly written, painfully human and fully fleshing the inner lives of its characters\". The Guardian, after publishing a review by Jake Arnott, named it among their \"books of the year\" and stated that it was \"a multi-voiced epic that leads towards a stunning finale.\" The Independent, in its review, called Lee \"a wordsmith of incomparable eloquence\" and also chose it as one of their books of the year. Not all critics were as positive. A negative review of the novel was published in The Financial Times, which argued that \"the novel suffers from some bum notes ... the thoughts of the characters meander in ways that aren't always interesting or revealing.\" In an interview with Mariella Frostrup for the BBC, Lee defended his decision to tell the story of the real-life bombing through largely fictional characters.For the release of High Dive in the United States by Alfred A. Knopf in 2016, the book was chosen by Barnes & Noble for their \"Discover Great New Writers\" program and was selected as a New York Times Editors' Choice. The book was widely reviewed. Jennifer Senior reviewed it for The New York Times and Thomas Mallon wrote about the book for The New Yorker. Review coverage also appeared in The Atlantic, The Washington Post, The Wall Street Journal, and other newspapers and magazines.\nIn an interview with The Independent in 2015 Lee stated that he relocated to New York from London in 2012. The author's Twitter page states that he currently lives in Brooklyn. In an interview for The Paris Review in 2016 the author stated that he is working on another book.In May 2016 it was reported in The Hollywood Reporter that Lee's novel High Dive was being adapted into a feature film by director Brian Kirk. In 2018, it was announced that Lee would write the script with Academy Award winning screenwriter Eric Roth. \nIn 2021 Lee's novel The Great Mistake, concerning the life and death of New York civic leader Andrew Haswell Green, was published. It received reviews in publications including The New York Times, The Los Angeles Times, The Wall Street Journal, The Guardian, The Observer, The Times, and The Sunday Times, among others. Reviewing the book for The New York Times, critic John Williams wrote: \"One presumable motivation behind Jonathan Lee’s fourth novel, “The Great Mistake,” is that Green has not been remembered. Or at least, his name faintly echoes rather than resounds, despite the fact that he was an integral force behind the creation of Central Park, the Metropolitan Museum of Art, the American Museum of Natural History and the New York Public Library, among other postcard destinations in the city.\" The Great Mistake was selected by WNYC as its \"Get Lit\" book club pick for September 2021. \nIt was announced in 2021 that Lee had been appointed Editorial Director of the publisher Bloomsbury.", "link_mentions": [{"page": "Brighton hotel bombing", "response": ["Jonathan Lee's 2015 novel High Dive is a fictionalised account of the bombing, written largely from the alternating perspectives of the hotel manager, his teenage daughter, and an IRA bombmaker who helps Magee. Rights to the book were purchased and it is in development as a potential feature film."]}, {"page": "Jonathan Lee", "response": ["* Jonathan Lee (novelist) (born 1981), British writer and novelist", "* Jonathan Lee (musician) (born 1958), record producer and singer-songwriter from Taiwan", "* Jonathan Lee (satirist), British satirist and humorist", "* M Jonathan Lee (born 1974), British novelist"]}, {"page": "The Lesser Bohemians", "response": ["In The Independent, Max Liu wrote: \"McBride writes in a stream of consciousness style that's as accessible as it is startling. It can make the world new at the same time as evoking its timeless fundamentals\". He did not appreciate a \"60-odd page monologue of abuse, addiction and betrayal\", which he found had a \"capsizing effect\". Reviewing the book in the Financial Times Jonathan Lee wrote that, \"This may not be Eimear McBride’s strongest book, but such moments of highly specific, deeply felt experience remind us what she can do\"."]}]}}