{"wiki_id": "http://www.wikidata.org/entity/Q6274814", "itemLabel": "Jonathan Wittenberg", "itemDescription": "British rabbi", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Wittenberg", "wikipedia_page": {"main": "Jonathan Wittenberg (born 17 September 1957 in Glasgow, Scotland) is a Masorti rabbi, the Senior Rabbi of Masorti Judaism UK. He is a leading writer and thinker on Judaism. He is Rabbi of the New North London Synagogue, with approximately 2400 members.\nHe is also a member of the Elijah Interfaith Institute Board of World Religious Leaders. He sometimes does Thought for the Day on the BBC Radio Four Today programme. \n\n", "link_mentions": [{"page": "Conservative Judaism", "response": ["The current chancellor of the JTS is Shuly Rubin Schwartz, in office since 2020. She is the first woman elected to this position in the History of JTS. The current dean of the Ziegler School of Rabbinic Studies is Bradley Shavit Artson. The Committee on Jewish Law and Standards is chaired by Rabbi Elliot N. Dorff, serving since 2007. The Rabbinical Assembly is headed by President Rabbi Debra Newman Kamin, as of 2019, and managed by Chief Executive Officer, Rabbi Jacob Blumenthal. Rabbi Blumenthal holds the joint position as CEO of the United Synagogue of Conservative Judaism.  The current USCJ President is Ned Gladstein. In South America, Rabbi Ariel Stofenmacher serves as chancellor in the Seminary and Rabbi Marcelo Rittner as president of Masorti AmLat. In Britain, the Masorti Assembly is chaired by Senior Rabbi Jonathan Wittenberg. In Israel, the Masorti movement's executive director is Yizhar Hess and chair Sophie Fellman Rafalovitz."]}, {"page": "Rabbinical Assembly", "response": ["*meditations on the Jewish year by Jonathan Wittenberg"]}, {"page": "List of British Jews", "response": ["* Jonathan Wittenberg, Massorti rabbi"]}, {"page": "Sternberg Centre", "response": ["Designed by van Heyningen and Haward Architects, the new synagogue includes  three prayer venues, a nursery and teenager’s room, as well as  social and administrative spaces. The synagogue's rabbi is Jonathan Wittenberg."]}, {"page": "Vegetarianism and religion", "response": ["Jewish Veg has named 75 contemporary rabbis who encourage veganism for all Jews, including Jonathan Wittenberg, Daniel Sperber, David Wolpe, Nathan Lopes Cardozo, Kerry Olitzky, Shmuly Yanklowitz, Aryeh Cohen, Geoffrey Claussen, Rami M. Shapiro, David Rosen, Raysh Weiss, Elyse Goldstein, Shefa Gold, and Yonassan Gershom. Other rabbis who have promoted vegetarianism have included David Cohen, Shlomo Goren, Irving Greenberg, Asa Keisar, Jonathan Sacks, She'ar Yashuv Cohen, and Yitzhak HaLevi Herzog.  Other notable advocates of Jewish vegetarianism include Franz Kafka, Roberta Kalechofsky, Richard H. Schwartz, Isaac Bashevis Singer, Jonathan Safran Foer, and Aaron S. Gross."]}, {"page": "List of Old Gowers", "response": ["* Jonathan Wittenberg, Masorti Rabbi"]}, {"page": "Wittenberg (surname)", "response": ["* Jonathan Wittenberg (born 1957), Scottish rabbi"]}, {"page": "Jewish Veg", "response": ["In 2017, Jewish Veg published a statement by 75 rabbis encouraging Jews to move towards a vegan diet. Notable rabbis who signed the statement included Jonathan Wittenberg, Daniel Sperber, David Wolpe, Nathan Lopes Cardozo, Kerry Olitzky, Shmuly Yanklowitz, Aryeh Cohen, Geoffrey Claussen, Rami M. Shapiro, David Rosen, Raysh Weiss, Elyse Goldstein, Shefa Gold, and Yonassan Gershom."]}, {"page": "Rosh Hashanah LaBehema", "response": ["Informal celebrations of Rosh Hashanah LaBehemot began in 2009 at the goat barn of Adamah Farm on the campus of the Isabella Freedman Jewish Retreat Center, including a blessing of assembled farm and pet animals, and a meditation on beginning the period of cheshbon hanefesh with a personal accounting of all the domesticated animals relied upon, followed by the shofar blast for Rosh Chodesh Elul. Activists have reached out to synagogues and Jewish food, environment, and animal protection organizations, in order to raise the profile of the festival and raise awareness for the conditions of domesticated animals in contemporary society in Jewish communities. In 2012, the first guided ritual communal meals for Rosh Hashanah LaBehemot were held at the Ginger House in Jerusalem, and in major cities across the United States. Several prominent Masorti and Open Orthodox rabbis have since lent their support for reviving the festival, including Adam Frank, Yitz Greenberg, Jonathan Wittenberg, David Wolpe, and Shmuly Yanklowitz."]}, {"page": "Jewish vegetarianism", "response": ["While most modern-day Jews are not vegetarian, a number of prominent rabbis have advocated vegetarianism or veganism. In 2017, a statement by Jewish Veg encouraging veganism for all Jews was signed by notable rabbis including Jonathan Wittenberg, Daniel Sperber, David Wolpe, Nathan Lopes Cardozo, Kerry Olitzky, Shmuly Yanklowitz, Aryeh Cohen, Geoffrey Claussen, Rami M. Shapiro, David Rosen, Raysh Weiss, Elyse Goldstein, Shefa Gold, and Yonassan Gershom. Other notable rabbis who were vegetarian or spoke positively of vegetarianism include David Cohen (known as \"Ha-Nazir\"), Shlomo Goren, Irving Greenberg, Jeremy Gimpel, Asa Keisar, Jonathan Sacks, She'ar Yashuv Cohen, and Yitzhak HaLevi Herzog, Everett Gendler, Simchah Roth, Joseph Soloveitchik, and Abraham Isaac Kook. While Kook was not completely vegetarian, David Cohen wrote an influential essay, A Vision of Vegetarianism and Peace (first published in installments in 1903–04) summarizing Kook's ideas about the \"coming of the new society\" in which humankind becomes vegan."]}, {"page": "Wittenberg, Jonathan", "response": ["#redirectJonathan Wittenberg"]}, {"page": "Antisemitism in the UK Labour Party", "response": ["The Board of Deputies of British Jews and the Jewish Leadership Council said that the new rules \"only dilute the definition and further erode the existing lack of confidence that British Jews have in their sincerity to tackle anti-Semitism within the Labour movement\".Margaret Hodge MP called Corbyn a \"fucking anti-Semite and a racist.\"Labour MP labels Corbyn an 'antisemite' over party's refusal to drop code , Guardian, Heather Stewart and Jessica Elgot, 17 July 2018 Law lecturer Tom Frost said the code ignored the Macpherson Principle that \"A racist incident is any incident which is perceived to be racist by the victim or any other person.\" On 16 July, over 60 British rabbis, including Harvey Belovski, Laura Janner-Klausner, Danny Rich and Jonathan Wittenberg said that Labour had \"chosen to ignore the Jewish community\", that it was \"not the Labour party's place to rewrite a definition of antisemitism\", and that the full definition had been accepted by the Crown Prosecution Service, the Scottish parliament, the Welsh assembly and 124 local authorities. Later in July, in an unprecedented move, three UK Jewish newspapers, The Jewish Chronicle, Jewish News and Jewish Telegraph, carried a joint editorial saying that a Corbyn government would be an \"existential threat to Jewish life\" in the UK which, according to David Patrikarakos, was the most drastic step taken by the Anglo-Jewish community since Oliver Cromwell allowed Jews back into the country in the 1650s. The former chief rabbi Lord Jonathan Sacks in turn stated that Labour's antisemitism was causing British Jews to consider leaving the country. The newspapers also stated that \"Had the full IHRA definition with examples relating to Israel been approved, hundreds, if not thousands, of Labour and Momentum members would need to be expelled.\" A Labour spokesman said the party posed \"no threat of any kind whatsoever to Jewish people\"."]}]}}