{"wiki_id": "http://www.wikidata.org/entity/Q6279196", "itemLabel": "Josceline Percy", "itemDescription": "British Royal Navy admiral (1784-1856)", "wikipedia_url": "https://en.wikipedia.org/wiki/Josceline_Percy_(Royal_Navy_officer)", "wikipedia_page": {"main": "Vice Admiral The Hon.  Josceline Percy  (29 January 1784 – 19 October 1856) was a Royal Navy officer and politician who went on to be Commander-in-Chief, The Nore.", "link_mentions": [{"page": "1856", "response": ["** Josceline Percy, British admiral (b. 1784)"]}, {"page": "Jocelyn", "response": ["*Josceline Percy, officer in the British Royal Navy", "*Josceline Percy, English politician", "*Josceline Percy, 11th Earl of Northumberland, English nobleman"]}, {"page": "House of Percy", "response": ["***Josceline Percy (1784–1856), Royal Navy officer", "**Lord Josceline Percy (1811–1881), politician"]}, {"page": "Bere Alston", "response": ["Bere Alston elected two members to the unreformed House of Commons. Only a few burgage holders were entitled to vote; but as most, if not all, of these holdings were held by a single individual for most of the time that Bere Alston was a parliamentary borough, elections were seldom contested (see rotten borough). Its MPs included Sir George Beaumont, 7th Baronet, Peter King, 1st Baron King and Josceline Percy. The borough was stripped of its franchise in the Reform Act 1832."]}, {"page": "George Percy, 5th Duke of Northumberland", "response": ["Born in London, he was the eldest son of Algernon Percy, 1st Earl of Beverley, second son of Hugh Percy, 1st Duke of Northumberland. His mother was Susan Isabella, daughter of Peter Burrell, while Algernon Percy, The Right Reverend Hugh Percy (Bishop of Rochester and Carlisle), Josceline Percy and William Henry Percy were his younger brothers.thepeerage.com George Percy, 5th Duke of Northumberland He was educated at St John's College, Cambridge, graduating with a Master of Arts in 1799."]}, {"page": "Earl of Beverley", "response": ["The Honourable Algernon Percy, second son of the first Earl, was a minor diplomat. The Right Reverend the Honourable Hugh Percy, third son of the first Earl, was Bishop of Rochester and of Carlisle. The Honourable Josceline Percy, fourth son of the first Earl, was a vice-admiral in the Royal Navy. The Honourable William Henry Percy, sixth son of the first Earl, was a naval officer and politician."]}, {"page": "Commander-in-Chief, The Nore", "response": ["* Vice-Admiral Josceline Percy (1851–1854)"]}, {"page": "Richard Bagot (writer)", "response": ["Bagot was the member of a well-known family-line of Staffordshire. He was the fourth child of Col. Charles (1801-1881) and Sophia Louisa (Percy; d. 1908) Bagot, the daughter of Vice-Admiral Josceline Percy, son of Algernon Percy, 1st Earl of Beverley. His great grandfather was William Bagot, 1st Baron Bagot. His great uncle, also named Richard Bagot (1782-1854), was Dean of Canterbury and Bishop of Oxford. His father was a Justice of the Peace for the county, and also the Assistant Master of Ceremonies to HM Queen Victoria. "]}, {"page": "Algernon Percy, 1st Earl of Beverley", "response": ["*Hon. Josceline Percy (1784–1856), naval commander."]}, {"page": "1856 in the United Kingdom", "response": ["* 19 October – Josceline Percy, admiral (born 1784)"]}, {"page": "Bere Alston (UK Parliament constituency)", "response": ["| Hon. Josceline Percy"]}, {"page": "Montagu Stopford (Royal Navy officer)", "response": ["He was captain in the Waterloo again from 1 April 1852, this time during her service as Vice-Admiral Josceline Percy's flagship. He left that role on 5 December 1853 on being promoted to rear admiral, becoming the admiral superintendent of Malta Dockyard in 1855, flying his flag in HMS Ceylon. He also remarried, to Lucy Cay, daughter of John Cay, on 29 September 1853, and the couple had three more children (one of whom was Colonel Sir Lionel Stopford). He became a Knight Commander of the Bath on 5 July 1855, and was promoted to vice-admiral on 25 June 1858, and finally admiral on 30 November 1863.  He had retired by 9 February 1864."]}, {"page": "Commander-in-Chief, Africa (Royal Navy)", "response": ["*Rear-Admiral Hon. Josceline Percy, (1841–46)   "]}, {"page": "French frigate Volontaire (1796)", "response": ["The Royal Navy took her into service as HMS Volontaire. Captain Josceline Percy commissioned her and sailed her to St Helena. There he took charge of a convoy for England."]}, {"page": "Josceline Percy", "response": ["Josceline Percy may refer to:", "*Josceline Percy, 11th Earl of Northumberland (1644–1670), peer who supported the Parliamentary cause in the English Civil War", "*Josceline Percy (Royal Navy officer) (1784–1856), Royal Navy admiral and a Member of Parliament", "*Lord Josceline Percy (1811–1881), British Conservative politician"]}, {"page": "Josceline Percy (admiral)", "response": ["#REDIRECT Josceline Percy (Royal Navy officer)"]}, {"page": "Mount Percy", "response": ["Mount Percy () is a prominent mountain, 765 m, the highest feature on Joinville Island, standing immediately north of Mount Alexander near the center of the island. Discovered by a British expedition under James Clark Ross on December 30, 1842, and named for admiral Josceline Percy, Royal Navy, (1784–1856). Although this mountain is not surmounted by twin peaks, as described by Ross, there are a number of peaks of similar height in its vicinity, one of which may have given rise to Ross' description."]}, {"page": "HMS Comus (1806)", "response": ["Captain Josceline Percy took command in November 1807, and sailed to Portugal later that month. There Comus participated in the occupation of Madeira by Sir Samuel Hood.Josceline Percy at Oxford Dictionary of National Biography Here her primary task was to reconnoiter the island. She returned to Hood's fleet on 23 December and the British took unopposed possession the next day.Naval Chronicle, Vol. 33, p. 10."]}, {"page": "HMS Nymphe (1780)", "response": ["In April 1808 Nymphe was cruising off Lisbon, in company with the 18-gun sloop , Commander George Pigot, when Captain Shipley learned that the 20-gun brig Gaivota was lying by Belém Castle, making ready to sail. At 21:00 on the evening of 23 April a force of eight boats with 150 officers and men from Nymphe and Blossom set out to capture her. Unfortunately, a strong ebb tide fed by heavy rains set in, slowing their approach and it was not until 02:30 that the boats of Nymphe reached the brig. Captain Shipley led the boarders, climbing the fore-rigging and attempting to cut away the boarding-netting, but he was shot and fell into the river. His brother, Charles Shipley, serving as a volunteer, immediately ordered the gig to pick him up, but the boats fell afoul of each other and became entangled with a caulking stage moored astern. Having lost the element of surprise, and with the boats of Blossom failing to reach the brig, the enterprise was abandoned. As well as her captain, Nymphe lost a seaman, and one marine was wounded. Captain Shipley's body was later recovered and it was evident that he had been killed instantly by a musket ball through the forehead. Commander Pigot was appointed by Admiral Sir Charles Cotton, the commander-in-chief on the coast of Portugal, to be Captain Shipley's successor on board Nymphe; and on 17 September he was confirmed in his post-rank. Captain The Hon. Josceline Percy, was later appointed to command her, while operating off the coast of Spain."]}, {"page": "Josceline", "response": ["*Josceline Percy (Royal Navy officer) (1784–1856), Royal Navy officer who went on to be Commander-in-Chief", "*Josceline Percy, 11th Earl of Northumberland (1644–1670), of Alnwick Castle, Northumberland and Petworth House, Sussex, an English peer", "*Lord Josceline Percy (1811–1881), British Conservative politician"]}, {"page": "1831 Coronation Honours", "response": ["*Captain the Honourable Josceline Percy"]}, {"page": "List of MPs elected in the 1806 United Kingdom general election", "response": ["| Hon. Josceline Percy"]}, {"page": "List of MPs elected in the 1807 United Kingdom general election", "response": ["| Hon. Josceline Percy"]}, {"page": "List of MPs elected in the 1812 United Kingdom general election", "response": ["| Hon. Josceline Percy"]}, {"page": "List of MPs elected in the 1818 United Kingdom general election", "response": ["| Hon. Josceline Percy"]}, {"page": "Isabella Percy, Countess of Beverley", "response": ["*Hon. Josceline Percy (1784–1856), naval commander, who married Margaret Davidson and had one child"]}]}}