{"wiki_id": "http://www.wikidata.org/entity/Q6273904", "itemLabel": "Jonathan Michael", "itemDescription": "British civil servant", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Michael", "wikipedia_page": {"main": "Sir Jonathan Michael is a British nephrologist and medical executive. From 2000 to 2007, he was the chief executive of Guy's and St Thomas' NHS Trust where he received his medical training, qualifying in 1970, before his 20-year career as a clinical nephrologist.  He spent much of his medical career at Queen Elizabeth Hospital, Birmingham, before becoming first medical director and chief executive of University Hospital Birmingham NHS Trust.In 2007, he became the head of British Telecom's Health division. In 2010, it was announced that he would be moving back into the NHS as Chief Executive of Oxford Radcliffe Hospitals NHS Trust.He announced in 2014 that he would be leaving the trust and is to become the chief medical officer of the 6PM Group, an IT software firm.In January 2016, he was appointed to provide independent oversight of plans for a “single hospital service” in Manchester.He was knighted in the 2005 New Year Honours.", "link_mentions": [{"page": "Maidstone and Tunbridge Wells NHS Trust", "response": ["In November 2021 MPs called for a public inquiry when it was revealed that mortuary technician David Fuller, who had unhindered access to hospital mortuaries, had sexually abused at least 100 bodies. During his trial for the murders of Wendy Knell and Caroline Pierce in 1987, it emerged that Fuller had sexually abused bodies in two Kent hospitals over 12 years. He was sentenced on 15 December 2021 to a whole life jail term. The NHS Trust commissioned an independent investigation, led by Sir Jonathan Michael, a fellow at the Royal College of Physicians, which will look into how the abuse happened and what could have been done to avoid it."]}, {"page": "University Hospital of South Manchester NHS Foundation Trust", "response": ["Plans were announced in 2016 for a merger between the trust and the Central Manchester University Hospitals NHS Foundation Trust  as proposed in a report by Sir Jonathan Michael. The merged trust would then take over North Manchester General Hospital, at present run by Pennine Acute Hospitals NHS Trust."]}, {"page": "2005 New Year Honours", "response": ["* Dr. Jonathan Michael, chief executive of Guy's and St Thomas' NHS Foundation Trust. For services to the National Health Service."]}, {"page": "Central Manchester University Hospitals NHS Foundation Trust", "response": ["Central Manchester University Hospitals NHS Foundation Trust merged with University Hospital of South Manchester NHS Foundation Trust to form Manchester University NHS Foundation Trust on 1 October 2017 as proposed in a report by Sir Jonathan Michael. The merged trust is intended to take over North Manchester General Hospital, at present run by Pennine Acute Hospitals NHS Trust."]}, {"page": "Michael (surname)", "response": ["* Jonathan Michael, British civil servant"]}, {"page": "Oxford University Hospitals NHS Foundation Trust", "response": ["The Trust was formed in 2011 by a merger with the Nuffield Orthopaedic Centre NHS Trust.  It achieved foundation trust status in October 2015.Oxford University Hospitals becomes a Foundation Trust Oxford University Hospitals NHS Foundation Trust, Retrieved 17 October 2015  Sir Jonathan Michael, then chief executive, announced in November 2014 that he planned to retire in 2015 – by which time it was hoped that the Trust would achieve foundation trust status."]}, {"page": "Healthcare in Greater Manchester", "response": ["In January 2016 Sir Jonathan Michael was appointed to provide independent oversight of plans for a “single hospital service” in Manchester which is intended to bring together Central Manchester University Hospitals NHS Foundation Trust, Pennine Acute Hospitals NHS Trust and University Hospital of South Manchester NHS Foundation Trust to provide single clinical services across the city."]}, {"page": "Michael, Jonathan", "response": ["#redirectJonathan Michael"]}, {"page": "Healthcare in the Isle of Man", "response": ["Sir Jonathan Michael conducted a review of arrangements for health and social care services on the Isle of Man which was published in May 2019.  He recommended that they should be delivered \"at arm's length\" from the government and that arrangements for clinical support from the NHS in England should be improved.  The chief executive of the Department of Health and Social Care and his deputy resigned.", "In 2013, about £178.4 million was spent on healthcare.  £138 million came from the Manx government and about £40 million from income National Insurance contributions, prescription charges and private patient fees.  About £80 million was spent on Noble's hospital. In March 2018 Sir Jonathan Michael was asked to conduct a review of the service because of concern that current funding levels are \"unsustainable\".  The Council of Ministers estimated that funding would have to be increased by 23% – an additional £60 million by 2022/23."]}]}}