{"wiki_id": "http://www.wikidata.org/entity/Q6271311", "itemLabel": "Jon Norfolk", "itemDescription": "Cycling Sprint Coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Jon_Norfolk", "wikipedia_page": {"main": "Jonathan Philip Norfolk  (born 29 March 1975) is a Great Britain track cycling national sprint coach, and an ex international cyclist.", "link_mentions": [{"page": "List of British cyclists", "response": ["* Jon Norfolk"]}, {"page": "British National Tandem Sprint Championships", "response": ["| 2002 || VC St RaphaelPeter BoydDave Heald || Yasumitsu SchlappJon NorfolkIan George || Yasumitsu SchlappDouglas NorthcottJoby Ingram Dodd", "| 2007   || Yasumitsu SchlappAnthony GillSimon Churton || VC St Raphael/PCA Ciclos Uno Ben ElliottJohn Saysell || Yasumitsu SchlappJon NorfolkAnthony Kappes ", "| 2008   || Yasumitsu Schlapp/ClitheroeJon NorfolkAnthony Kappes ||Yasumitsu SchlappAnthony GillSimon Churton  ||VC St Raphael/PCA Ciclos Uno Ben ElliottJohn Saysell "]}, {"page": "Anthony Kappes", "response": ["Kappes, began working with a new tandem pilot internationally in 2008, Jon Norfolk sacrificed his career as a member of Great Britain's able-bodied squad in order to work with Paralympians, and had to take a three-year break from competition in order to qualify. Kappes and Norfolk beat Simon Jackson and Storey to win the sprint and kilo (Achieving Worlds Best - 1.02.06) events at the 2008 VISA Paralympic World Cup.", ":1st Sprint, VISA Paralympic World Cup (with Jon Norfolk)"]}, {"page": "Jonathan Norfolk", "response": ["#REDIRECT Jon Norfolk"]}, {"page": "Revolution (cycling series) Season 1", "response": ["Revolution 4 saw the Dutch team provide the opposition for the British riders. Future World Sprint Champion Theo Bos defeated Chris Hoy in the Semi-Finals to set up a meeting with Jamie Staff in the final. Bos took a convincing victory after an early move caught Staff off guard. In the Keirin race Jon Norfolk made an early break for home but was caught by Hoy just before the line for the Scot to take the victory. To complete the sprint action Team GB continued their fine form in the Team sprint competition by defeating the Dutch team of Bos, Teun Mulder and Tim Veldt by over a second.", "Endurance racing launched the Revolution series from the first event, which featured GB stars Bradley Wiggins, David Millar, Rob Hayles and Chris Newton. The very first race was a Motor Paced Scratch race, in which the bike pulled off 6 laps from the end of the race. The race was won by Millar on his track debut, assisted by his Cofidis teammate Wiggins. The next event was a pursuit challenge, featuring 6 riders over 3 heats. The final saw Wiggins take on Hayles, an encounter in which Hayles led by 2 seconds at the halfway point. However Wiggins was able to turn this around to take the victory by a margin of 2 seconds. Other victories on the night went to James Notley in the Devil Scratch race, Jon Norfolk in a mixed Keirin Race, Chris Newton in the Points race and Rob Hayles in the Scratch race."]}, {"page": "British National Keirin Championships", "response": ["| 2001 || Jon Norfolk || Barney Storey || Alwyn McMath", "| 2002|| Jon Norfolk || James Taylor || Ben Elliott"]}]}}