{"wiki_id": "http://www.wikidata.org/entity/Q6272681", "itemLabel": "Jonathan Bushe", "itemDescription": "Irish cricketer (born 1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Bushe", "wikipedia_page": {"main": "Jonathan Alexander Bushe (born 12 December 1978) is an Irish cricketer. He is a left-handed batsman and a wicket-keeper.\nHe played for the Ireland Under-19 team at the 1998 Under-19 World Cup, before making his debut for the Ireland senior team against Scotland in June 1998. He remained a regular member of the team for the following two years, playing a first-class match against Australia A later in 1998. He made his List A debut in the ICC Emerging Nations tournament in 2000, and played two matches against Zimbabwe later in the same year.\nHe returned to the Irish team in August 2003, playing against the Duke of Norfolk's XI. He remained in the team for a further year, winning his 29th and, to date, last cap against Bangladesh on 30 August 2004 in what was a Bangladeshi warm-up match for the 2004 ICC Champions Trophy.", "link_mentions": [{"page": "John Bush", "response": ["*Jonathan Bushe (born 1978), Irish cricketer"]}, {"page": "Garfield Harrison", "response": ["Harrison came from a cricketing family. Three of his brothers (Derryck, Jim and Roy) all played for Ireland, as did his brother-in-law Eddie Bushe and his nephew Jonathan Bushe."]}, {"page": "Deryck Harrison", "response": ["Harrison came from a cricketing family. His brothers Garfield, Jim and Roy all represented Ireland at cricket, as did his brother-in-law Eddie Bushe and his nephew Jonathan Bushe."]}, {"page": "Jim Harrison (cricketer)", "response": ["Harrison came from a cricketing family. Three of his brothers, Deryck, Garfield and Roy all represented Ireland, as did his brother-in-law Eddie Bushe and his nephew Jonathan Bushe."]}, {"page": "Roy Harrison", "response": ["Harrison came from a cricketing family. Three of his brothers, Deryck, Garfield and Jim, all played for Ireland, as did his brother-in-law Eddie Bushe and his nephew Jonathan Bushe."]}, {"page": "Bushe", "response": ["* Jonathan Bushe (b. 1978) Irish cricketer"]}, {"page": "1998 Under-19 Cricket World Cup squads", "response": ["| Jonathan Bushe (wk) ||  || Left || —"]}, {"page": "Bushe, Jonathan", "response": ["#redirectJonathan Bushe"]}]}}