{"wiki_id": "http://www.wikidata.org/entity/Q6272741", "itemLabel": "Jonathan Chapman", "itemDescription": "ecologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Chapman_(academic)", "wikipedia_page": {"main": "Jonathan Chapman (born 1974) is Professor and Director of Doctoral Studies in the School of Design at Carnegie Mellon University, USA. His research tackles our throwaway society by developing design strategies for longer-lasting products, materials and user experiences – an approach he calls, emotionally durable design.He is a Visiting Professor in Design at the Politecnico di Milano and serve as a thesis advisor to Master's and PhD students at MIT, Cambridge University, Royal College of Art, and KAIST. Chapman holds a PhD in design (2008), MA in Design Futures (2001), and BA (Hons) in Product Design (1997). In 2013, aged just 38, he became the youngest person in England to be awarded a Full Professorship in Design.\nChapman's work on the behavioural dimension of product longevity was first established in his book, Emotionally Durable Design: Objects, Experiences & Empathy. The theory proposes the creation of products that endure in terms of their technological, physical and emotional durability – a call to arms for professionals, students and academic creatives to think about designing things we would cherish and keep, rather than throw away. He argues that designing products should incorporate a lasting emotional as well as physical perspective. Through this design approach, we increase value, conserve resources and prevent materials from becoming waste. On describing Chapman's research, New Scientist defined him as 'a new breed of sustainable design thinker'. Chapman feels that emotionally durable design represents a core sustainable design strategy.According to the United Nations Industrial Development Organization Chapman's work has advanced product design and business thinking in a range of settings. He advises a number of global businesses on how they can design their products and services in a more sustainable way – environmentally, socially and financially, including Puma, Philips, Sony and The Body Shop. Through publications, training, exhibitions, master-classes and films, this research has transformed understanding of sustainable design in professional, policy and cultural settings, propelling the field beyond its focus on energy and materials, towards deeper engagements that link psychosocial phenomena with ideas about consumption and waste; helping them to cut waste and to enhance product, material and brand value.Chapman's work is cited in books, journals and a range of popular international publications and broadcast media including, New Scientist CNN International, New Statesman, New York Times, The Telegraph, The Independent and several features and interviews on BBC Radio 4, including: You & Yours, Click-On and The Today Programme.Books\n\nChapman, J., (Ed) \"Meaningful Stuff: Design that Lasts\", MIT Press, 2021\nChapman, J., (Ed) \"Routledge Handbook of Sustainable Product Design\", Routledge, London, 2017\nChapman, J., Emotionally Durable Design: Objects, Experiences and Empathy, Revised and expanded second edition, Routledge, London, 2015\nChapman, J. & Gant, N. (Eds), Designers, Visionaries & Other Stories: A Collection of Sustainable Design Essays, Earthscan, London, 2007Key Texts\n\nChapman, J., 'Designing Meaningful & Lasting User Experiences', in Moran, A. and O'Brien, S. [Eds], Love Objects: Emotion, Design & Material Culture, Bloomsbury, London, 2014\nChapman, J., 'Prospect, Seed & Activate', in Fletcher, K. & Tham, M. [Eds] The Routledge Handbook of Sustainability and Fashion (Routledge International Handbooks), Routledge, UK, 2014\nChapman, J., 'Meaningful Stuff: Towards longer lasting products', in Karana, E., Pedgley, O. & Rognoli, V. [Eds], Materials Experience: Contemporary Issues Connecting Materials and Product Design, Elsevier, Amsterdam, 2013\nChapman, J., 'Emotionally Sustainable Design', in Walker, S. & Giard, J. [eds], The Handbook of Sustainable Design, Berg, London, 2012\nChapman, J., 'Subject Object Relationships and Emotionally Durable Design', a contributing chapter in Cooper, T. (Ed), Longer Lasting Products: Alternatives to the Throwaway Society, Gower, Farnham, 2010, pp61–76\nChapman, J., 'No Alternative', in Predan. B., Krecic, P. & Subic, S. (Eds), Sustainable Alternatives in Design, Pekinpah, Slovenia, 2009, pp124–132\nChapman, J., 'Design for [Emotional] Durability', Design Issues, vol xxv, Issue 4, Autumn, pp29–35, 2009\nChapman, J., 'Evidence Paper', in House of Lords Science and Technology Committee 1: Enquiry into Waste Reduction, House of Lords, London, February 2008, pp56–58\nChapman, J., 'Sustaining Relationships Between People and Things', in Desmet, M. P., van Erp, J. & Karlsonn, M., Design & Emotion Moves, Design & Emotion Society, Cambridge Scholars Publishing, 2008, pp47–65\nMargolin, V., Doordan, D., Brown, B., Woodham, J., Garland, K., Chapman, J., Cooper, R., Lee, S., Salinas, O., Boddington, A., Harper, C. and Pelcl, J., 'Brighton 05-06-07', Design Issues, Winter 2008, Vol. 24, No. 1, pp91–93\nChapman, J., 'Desire, Disappointment and Domestic Waste', in Pavilion Commissions Programme, Pavilion, Leeds, 2007, pp4–11", "link_mentions": [{"page": "Jonathan Chapman", "response": ["Jonathan Chapman (January 23, 1807 – May 25, 1848) was an American politician, serving as the eighth mayor of Boston, Massachusetts from 1840 to 1842.", "Chapman's father also named Jonathan Chapman served as a member of the Town of Boston's Board of Selectmen."]}, {"page": "Chapman (surname)", "response": ["*Jonathan Chapman (1807–1848), American politician and mayor of Boston", "*Jonathan Chapman (academic) (born 1975), British academic, consultant and writer"]}, {"page": "Sustainable design", "response": ["According to Jonathan Chapman of Carnegie Mellon University, USA, emotionally durable design reduces the consumption and waste of natural resources by increasing the resilience of relationships established between consumers and products.\"Chapman, J., ‘Design for [Emotional] Durability’, Design Issues, vol xxv, Issue 4, Autumn, pp29-35, 2009  Essentially, product replacement is delayed by strong emotional ties. In his book, Emotionally Durable Design: Objects, Experiences & Empathy, Chapman describes how \"the process of consumption is, and has always been, motivated by complex emotional drivers, and is about far more than just the mindless purchasing of newer and shinier things; it is a journey towards the ideal or desired self, that through cyclical loops of desire and disappointment, becomes a seemingly endless process of serial destruction\".Chapman, J., Emotionally Durable Design: Objects, Experiences and Empathy, Earthscan, London, 2005 Therefore, a product requires an attribute, or number of attributes, which extend beyond utilitarianism."]}]}}