{"wiki_id": "http://www.wikidata.org/entity/Q6275792", "itemLabel": "Jonny May", "itemDescription": "English rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonny_May", "wikipedia_page": {"main": "Jonathan James May (born 1 April 1990) is a professional rugby union player for Gloucester in Premiership Rugby and for the England national team. He plays as a winger and is known for his speed and try scoring. \nHe began his senior career at Gloucester, and also played for Moseley on loan. He moved to Leicester Tigers in 2017 and returned to Gloucester in July 2020. \nSince making his debut in 2013 he has won 65 caps for England, and is their second top try scorer.", "link_mentions": [{"page": "Swindon", "response": ["English Rugby player Jonny May lived in Chiseldon and attended The Ridgeway School & Sixth Form College located in Wroughton, both nearby villages to Swindon."]}, {"page": "Leicester Tigers", "response": ["| Dan Cole, George Ford, Ellis Genge, Jonny May, Manu Tuilagi, Ben Youngs"]}, {"page": "Premiership Rugby", "response": ["| align=left |  Jonny May"]}, {"page": "England national rugby union team", "response": ["On 24 January, Owen Farrell and Jonny May withdrew from the squad due to injury and were replaced by George Ford and Elliot Daly, respectively. Nick Isiekwe also joined the squad as injury cover for Courtney Lawes.EDDIE JONES UPDATES GUINNESS SIX NATIONS SQUAD"]}, {"page": "List of England national rugby union team records", "response": ["|align=\"left\"|Jonny May", "|align=\"left\"|Jonny May"]}, {"page": "List of leading rugby union test try scorers", "response": ["|Jonny May"]}, {"page": "List of Rugby World Cup try scorers", "response": ["*Jonny May"]}, {"page": "Israel Dagg", "response": ["He had injury trouble in the first test against England, ruling him out of the rest of the series. Regular right wing Ben Smith was used to cover Dagg's injuries and played so well that he took the fullback jersey for the first two Bledisloe tests. Dagg was the given another shot against Argentina in his home province and played well enough to shift Smith back to right wing for the rest of the rugby championship. Against England on the end of year tour, Dagg got shown up on defence by Jonny May and lost his fullback spot to Smith for the last test against Wales."]}, {"page": "2019 Rugby World Cup", "response": ["The first two quarter-finals were played on Saturday. The first quarter-final saw England defeat Australia 40–16 at Ōita Stadium. Two tries from Jonny May, plus the 18 turnovers that the Australians conceded and led to two more being scored by England, sealed the result which saw Michael Cheika resign from the role as Australian manager. The following match saw New Zealand book their spot in the semi-finals, with the All Blacks cruising to a 46–14 win over Ireland at Tokyo Stadium. Aaron Smith scored two of the All Blacks' seven tries, with the Irish only getting on the board in the 69th minute from a Robbie Henshaw converted try. A penalty try was then added seven minutes later."]}, {"page": "2009 end-of-year rugby union internationals", "response": ["| ||21||Jonny May"]}, {"page": "List of England national rugby union players", "response": ["|1356||Jonny May||winger||2013-06-15||v Argentina at Buenos Aires"]}]}}