{"wiki_id": "http://www.wikidata.org/entity/Q6279659", "itemLabel": "Josef Altin", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Josef_Altin", "wikipedia_page": {"main": "Josef Altin (born as Yusuf Altın; 12 February 1983) is a British television and film actor who had the role of Pypar in the HBO fantasy TV series Game of Thrones. Other notable performances is his role as Ekrem in Eastern Promises and his roles in The Bill, Peep Show,  and Casualty. He starred in D.C. Moore's hit play The Empire at the Royal Court Theatre in London. Altin also played the role of Darren in Him & Her, a BBC TV series.", "link_mentions": [{"page": "Stoned (film)", "response": ["* Josef Altin as Bill Wyman"]}, {"page": "Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series", "response": ["| Amrita Acharia, Mark Addy, Alfie Allen, Josef Altin, Sean Bean, Susan Brown, Emilia Clarke, Nikolaj Coster-Waldau, Peter Dinklage, Ron Donachie, Michelle Fairley, Jerome Flynn, Elyes Gabel, Aidan Gillen, Jack Gleeson, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Richard Madden, Jason Momoa, Rory McCann, Ian McElhinney, Luke McEwan, Roxanne McKee, Dar Salim, Mark Stanley, Donald Sumpter, Sophie Turner, Maisie Williams", "| Alfie Allen, Josef Altin, Jacob Anderson, John Bradley-West, Dominic Carter, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Ben Crompton, Charles Dance, Peter Dinklage, Natalie Dormer, Nathalie Emmanuel, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Conleth Hill, Rory McCann, Ian McElhinney, Pedro Pascal, Daniel Portman, Mark Stanley, Sophie Turner, Maisie Williams"]}, {"page": "List of Star Wars cast members", "response": ["| Josef Altin"]}, {"page": "List of American films of 2007", "response": ["| Eastern Promises ‡ || Focus Features || David Cronenberg (director); Steven Knight (screenplay);  Viggo Mortensen, Naomi Watts, Vincent Cassel, Sinéad Cusack, Armin Mueller-Stahl, Mina E. Mina, Jerzy Skolimowski, Donald Sumpter, Raza Jaffrey, Josef Altin, Sarah-Jeanne Labrosse, Tatiana Maslany, Tereza Srbova, Tamer Hassan, Olegar Fedoro || Gangster"]}, {"page": "List of American films of 2008", "response": ["| Boy A || The Weinstein Company || John Crowley (director); Mark O'Rowe (screenplay); Andrew Garfield, Peter Mullan, Katie Lyons, Alfie Owen, Siobhan Finneran, Victoria Brazier, Skye Bennett, Taylor Doherty, Shaun Evans, Anthony Lewis, Jeremy Swift, Helen Wilding, Jessica Mullins, Madeleine Rakic-Platt, Josef Altin || Drama"]}, {"page": "List of British Turks", "response": ["*Josef Altin, actor"]}, {"page": "Being Human (British TV series)", "response": ["| Josef Altin"]}, {"page": "West 10 LDN", "response": ["* Josef Altin as Ratty"]}, {"page": "Soundproof (film)", "response": ["* Josef Altin as Stee"]}, {"page": "God on Trial", "response": ["* Josef Altin - Isaac"]}, {"page": "Misfits (TV series)", "response": ["| Josef Altin"]}, {"page": "Gypo (film)", "response": ["* Josef Altin as Michael"]}, {"page": "List of Game of Thrones characters", "response": ["| Josef Altin || Pypar ||  ||  ||  ||  || colspan=4 ", "* Pypar (seasons 1, 3–4) portrayed by Josef Altin, right|thumb|upright=0.5|Josef Altin is a brother of the Night's Watch, informally called \"Pyp\". He joins at the same time as Jon. Initially, he said that his crime was stealing a wheel of cheese to feed his starving sister. Later, he admits to Jon and Sam that he were merely accused of stealing after refusing the sexual advances of his former lord. In the first season, he is at odds with Jon Snow, who does not hide his superior skills from the other brothers, but he becomes friends with him when Jon, on Tyrion Lannister's advice, helps to train the other brothers. He is later assigned to the stewards. In season 4, Pyp participates in the battle against the wildlings at Castle Black with both a sword and a crossbow. He manages to kill one wildling with a crossbow but is himself shot through the neck and killed seconds later by Ygritte and dies in Sam's arms. His body is later burned at the funeral."]}, {"page": "Him & Her", "response": ["* Darren (Josef Altin; 3 episodes), Paul's friend"]}, {"page": "Altın", "response": ["* Josef Altin (born 1983), British television and film actor"]}, {"page": "The Empire (play)", "response": ["Directed by Mike Bradwell in the Jerwood Theatre Upstairs of the Royal Court Theatre in London, the production starred Josef Altin as Hafizullah, Joe Armstrong as Gary, Nav Sidhu as Zia, Rufus Wright as Captain Simon Mannock and Imran Khan as Jalander.\"The Empire at the Royal Court Theatre\". Retrieved 2011-03-06. After the play's run at the Royal Court Theatre from 31 March to 8 May, it transferred to the Drum Theatre in the Theatre Royal, Plymouth for two weeks from 13 to 29 May,\"The Empire\" , Theatre Royal and Drum Theatre Plymouth. Retrieved 2011-03-06. followed by a short stint at the Theatre Local in the Elephant and Castle shopping centre from 2–5 June as part of the Royal Court Theatre's outreach programme.\"The Empire at the Theatre Local\", Royal Court Theatre. Retrieved 2011-03-06.", "A radio play of The Empire aired on 29 October 2011 on BBC Radio 3's The Wire as part of a series on the theme Conviction, about the consequences of unwavering and uncompromising beliefs. Joe Armstrong, Josef Altin and Imran Khan reprised their roles from the stage production, joined by Ashley Kumar as Zia, James Norton as Captain Mannock and David Kirkbride as Phippy. The story was adapted for radio by DC Moore, including a new opening sequence with Phipps and the RPG attack that was not in the original play.\"New and classic dramas to feature in Radio 3's Conviction Season\", BBC Press Office, 28 September 2011. Retrieved 2011-10-16.\"The Wire - The Empire\", BBC Radio 3. Retrieved 2011-10-21."]}, {"page": "Game of Thrones (season 1)", "response": ["* Josef Altin as Pyp", "|scope=\"row\"| Amrita Acharia, Mark Addy, Alfie Allen, Josef Altin, Sean Bean, Susan Brown, Emilia Clarke, Nikolaj Coster-Waldau, Peter Dinklage, Ron Donachie, Michelle Fairley, Jerome Flynn, Elyes Gabel, Aidan Gillen, Jack Gleeson, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Richard Madden, Jason Momoa, Rory McCann, Ian McElhinney, Luke McEwan, Roxanne McKee, Dar Salim, Mark Stanley, Donald Sumpter, Sophie Turner and Maisie Williams"]}, {"page": "Comes a Bright Day", "response": ["* Josef Altin as Clegg "]}, {"page": "Now Is Good", "response": ["* Josef Altin as Jake"]}, {"page": "Top Boy", "response": ["* Josef Altin as Lee (season 3–present)"]}, {"page": "18th Screen Actors Guild Awards", "response": ["** Game of Thrones (HBO) – Amrita Acharia, Mark Addy, Alfie Allen, Josef Altin, Sean Bean, Susan Brown, Emilia Clarke, Nikolaj Coster-Waldau, Peter Dinklage, Ron Donachie, Michelle Fairley, Jerome Flynn, Elyes Gabel, Aidan Gillen, Jack Gleeson, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Richard Madden, Jason Momoa, Rory McCann, Ian McElhinney, Luke McEwan, Roxanne McKee, Dar Salim, Mark Stanley, Donald Sumpter, Sophie Turner and Maisie Williams"]}, {"page": "Game of Thrones (season 3)", "response": ["* Josef Altin as Pypar", "After an absence of one season David Bradley returns as Walder Frey, Ian McElhinney as Barristan Selmy, Peter Vaughan as Maester Aemon, Josef Altin as Pypar and Luke McEwan as Rast."]}, {"page": "List of awards and nominations received by Game of Thrones", "response": ["! scope=\"row\" data-sort-value=\"Altin, Josef\"|Josef Altin", "| data-sort-value=\"Acharia, Amrita\"| Amrita Acharia, Mark Addy, Alfie Allen, Josef Altin, Sean Bean, Susan Brown, Emilia Clarke, Nikolaj Coster-Waldau, Peter Dinklage, Ron Donachie, Michelle Fairley, Jerome Flynn, Elyes Gabel, Aidan Gillen, Jack Gleeson, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Richard Madden, Jason Momoa, Rory McCann, Ian McElhinney, Luke McEwan, Roxanne McKee, Dar Salim, Mark Stanley, Donald Sumpter, Sophie Turner, and Maisie Williams", "| data-sort-value=\"Altin, Josef\"| Josef Altin, Jacob Anderson, John Bradley, Dominic Carter, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Ben Crompton, Charles Dance, Peter Dinklage, Natalie Dormer, Nathalie Emmanuel, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Conleth Hill, Rory McCann, Ian McElhinney, Pedro Pascal, Daniel Portman, Mark Stanley, Sophie Turner, and Maisie Williams", "| data-sort-value=\"Acharia, Amrita\"| Amrita Acharia, Mark Addy, Alfie Allen, Josef Altin, Sean Bean, Susan Brown, Emilia Clarke, Nikolaj Coster-Waldau, Peter Dinklage, Ron Donachie, Michelle Fairley, Jerome Flynn, Elyes Gabel, Aidan Gillen, Jack Gleeson, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Richard Madden, Jason Momoa, Rory McCann, Ian McElhinney, Luke McEwan, Roxanne McKee, Dar Salim, Mark Stanley, Donald Sumpter, Sophie Turner and Maisie Williams", "| data-sort-value=\"Altin, Josef\"| Josef Altin, Jacob Anderson, John Bradley, Thomas Brodie-Sangster, Dominic Carter, Dean-Charles Chapman, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Ben Crompton, Liam Cunningham, Charles Dance, Peter Dinklage, Natalie Dormer, Nathalie Emmanuel, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Isaac Hempstead-Wright, Conleth Hill, Rory McCann, Ian McElhinney, Pedro Pascal, Daniel Portman, Mark Stanley, Sophie Turner, Indira Varma and Maisie Williams"]}, {"page": "Baby (2010 film)", "response": ["Baby is a Brixton set drama short film, written and directed by Daniel Mulloy and starring Arta Dobroshi, Daniel Kaluuya and Josef Altin.  Baby premiered at the Sundance Film Festival and went on to win multiple awards including the coveted British Independent Film Award."]}, {"page": "Game of Thrones (season 4)", "response": ["* Josef Altin as Pypar", "|scope=\"row\"| Josef Altin, Jacob Anderson, John Bradley, Dominic Carter, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Ben Crompton, Charles Dance, Peter Dinklage, Natalie Dormer, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Conleth Hill, Rory McCann, Ian McElhinney, Pedro Pascal, Daniel Portman, Mark Stanley, Sophie Turner, and Maisie Williams"]}, {"page": "Vendetta (2013 film)", "response": ["*Josef Altin as Rob"]}, {"page": "A Long Way Down (film)", "response": ["* Josef Altin as Maureen's son Matty"]}, {"page": "Child 44 (film)", "response": ["* Josef Altin as Alexander"]}, {"page": "Mhysa", "response": ["After being absent for the entire second season, Peter Vaughan returns as Maester Aemon and Josef Altin returns as Pypar. This episode also marks the return, after a long absence, of Patrick Malahide as Balon Greyjoy and Gemma Whelan as Yara Greyjoy."]}]}}