{"wiki_id": "http://www.wikidata.org/entity/Q6274454", "itemLabel": "Jonathan Smith", "itemDescription": "British video game programmer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Smith_(games_programmer)", "wikipedia_page": {"main": "Jonathan M. \"Joffa\" Smith (1 February 1967 – 26 June 2010) was a British games programmer, best known for his titles for the ZX Spectrum. His games were notable for containing a large number of sprites and parallax scrolling, features which were largely unknown on the Spectrum at the time.\nHis most notable games include Cobra, (which was a license extremely loosely based on a Sylvester Stallone film) one of the first Spectrum games to exhibit full-colour parallax scrolling and his conversion of the arcade game Green Beret. A notable \"trademark\" of Smith's was his habit of writing his name (with \"Jonathan\" and \"Smith\" spelled various ways) as a mirror-image in his games.", "link_mentions": [{"page": "Mike Follin", "response": ["In CRASH issue 59, Follin cited Knight Lore, Codename MAT and Pentagram as video game classics, with Jonathan Smith as his favorite programmer. Follin's Spectrum conversion of The Sentinel was considered by fellow programmers as one of the top five classic games on that platform."]}, {"page": "Jonathan Smith", "response": ["*Jonathan Smith (novelist) (born 1942), English novelist and playwright", "*Jonathan Smith (musician) (fl. 2002–2013), American drummer in the band Days Difference ", "*Jonathan Smith (A Place to Bury Strangers), aka Jono MOFO, bassist for the band A Place to Bury Strangers", "*Jonathan Smith (American football coach) (born 1979), American college football coach and player", "*Jonathan Smith (wide receiver) (born 1981), American NFL football wide receiver", "*Jonathan Smith (running back) (born 1981), American football running back", "*Jonathan Smith (footballer, born 1891), English player with QPR, Swansea Town; on List of Manchester City F.C. players", "*Jonathan Smith (footballer, born 1986), English footballer", "*Jonathan Smith (footballer, born 1988), English footballer", "*Jonathan Smith (tennis) (born 1955), British tennis player", "*Jonathan Smith (rower) (born 1961), American rower", "*Jonathan Smith (rugby league) (born 1979), New Zealand rugby league footballer", "*Jonathan Smith (racing driver) (born 1986), American race car driver", "*Jonathan Smith (priest) (born 1955), Church of England priest and Archdeacon of St Albans", "*Jonathan Smith (games programmer) (1967–2010), British games programmer", "*Jonathan Smith (psychologist), British psychology professor"]}, {"page": "List of ZX Spectrum games", "response": ["|Hyper Sports||Imagine Software||Jonathan Smith||Konami||1985", "|Mikie||Imagine Software||Jonathan Smith, Martin Galway, F. David Thorpe||Konami||1985", "|Pud Pud in Weird World||Ocean Software||Jonathan Smith, Christine Smith||||1985", "|Green Beret||Imagine Software||Jonathan Smith, F David Thorpe||Konami||1986", "|Ping Pong||Imagine Software||Bernie Duggs, Jonathan Smith, Martin Galway||Konami||1986", "|Terra Cresta||Imagine Software||Jonathan Smith, Martin Galway||Nichibutsu||1986", "|Cobra||Ocean Software||Jonathan Smith, Martin Galway||Warner Brothers||1986", "|Daley Thompson's Supertest||Ocean Software||Paul Owens, Jonathan Smith, F David Thorpe, Dan Hartley ||Daley Thompson||1986", "|Hysteria||Software Projects||Special FX Software (Jonathan Smith, Karen Davies, Tony Pomfret, Stephen Wahid)||||1987", "|Batman: The Caped Crusader||Ocean Software||Special FX Software (Jonathan Smith, Charles Davies, Karen Davies, Keith Tinman)||DC Comics||1988", "|Firefly||Ocean Software||Special FX Software (Jonathan Smith, Karen Davies, Keith Tinman)||||1988"]}, {"page": "Pud Pud in Weird World", "response": ["Pud Pud in Weird World (also known simply as Pud Pud) is a computer game published by Ocean Software in 1985 for the ZX Spectrum. It was written by Jonathan Smith. Smith was paid £1000 for Pud Pud by Ocean Software and was given a job at Ocean as a direct result of the game."]}, {"page": "Batman: The Caped Crusader", "response": ["Batman: The Caped Crusader is an action-adventure game developed by Special FX Software (Jonathan Smith, Zach Townsend, Charles Davies, and Keith Tinman) and published by Ocean Software in 1988. It was licensed by Data East and Erbe Software for release in North America and Spain. It was the second of three unrelated Batman games released by Ocean, after Batman in 1986 and preceding Batman: The Movie in 1989. The Apple II version was developed by California-based Quicksilver Software; it requires a 128k IIe or IIc to run. As with many other Ocean releases, the C64 port came in separate cassette and disk releases; the North American NTSC version was based on the latter. The disk version contained slightly remixed music and differences in enemy spawns.", "Batman: The Caped Crusader is an arcade adventure which uses a unique style, innovated by Jonathan Smith and Charles Davies, to display the action as though it takes place in a comic book. This technique involved having each game location set in its own panel, often with a comic book style caption in the upper-left corner, with inactive panels faded out behind the current active location. This concept was expanded upon by Sega's Comix Zone seven years later."]}, {"page": "Deaths in June 2010", "response": ["*Jonathan Smith, 43, British games developer."]}, {"page": "Joffa Smith", "response": ["#REDIRECT Jonathan Smith (games programmer)"]}]}}