{"wiki_id": "http://www.wikidata.org/entity/Q6274948", "itemLabel": "Jonathon Green", "itemDescription": "British lexicographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathon_Green", "wikipedia_page": {"main": "Jonathon Green (born 20 April 1948 in Kidderminster, Worcestershire) is an English lexicographer of slang and writer on the history of alternative cultures. Jonathon Green is often referred to as the English-speaking world's leading lexicographer of slang, and has even been described as \"the most acclaimed British lexicographer since Johnson\".", "link_mentions": [{"page": "Barney Bubbles", "response": ["Following the closure of Teenburger in 1970 as a result of the disappearance of Molton and Warwick, Bubbles worked as the designer of the underground newspaper Friends (later renamed Frendz).Days in the Life: Voices from the English Underground, 1961–1971, Jonathon Green (Pimlico 1998) ", "* Philm Freax: Friends: Barney Bubbles Includes Phil Franks' photos and text extracts from \"Days in the Life: Voices from the English Underground 1961-'71\" by Jonathon Green."]}, {"page": "Slang", "response": ["In its earliest attested use (1756), the word slang referred to the vocabulary of \"low\" or \"disreputable\" people. By the early nineteenth century, it was no longer exclusively associated with disreputable people, but continued to be applied to usages below the level of standard educated speech. The origin of the word is uncertain, although it appears to be connected with thieves' cant. A Scandinavian origin has been proposed (compare, for example, Norwegian , which means \"nickname\"), but based on \"date and early associations\" is discounted by the Oxford English Dictionary. Jonathon Green, however, agrees with the possibility of a Scandinavian origin, suggesting the same root as that of sling, which means \"to throw\", and noting that slang is thrown language – a quick and honest way to make your point."]}, {"page": "Jackanory", "response": ["\"Jackanory, jackanory\" said by someone in the sing-song tones of the theme tune indicates that they think that someone else is making up or \"stretching\" a story, i.e. lying.Cassell's Dictionary of Slang. Jonathon Green. Pub. Cassel & Co. "]}, {"page": "List of lexicographers", "response": ["*Jonathon Green (UK, born 1948) English slang"]}, {"page": "Very Short Introductions", "response": ["| 465 || Slang || Jonathon Green ||  ||"]}, {"page": "Jobsworth", "response": ["\"Jobsworth\" is a British colloquial word derived from the phrase \"I can't do that, it's more than my job's worth\", meaning that to do what is requested of them would be against what their job requires and would be likely to cause them to lose their job. The Oxford English Dictionary defines it as \"A person in authority (esp. a minor official) who insists on adhering to rules and regulations or bureaucratic procedures even at the expense of common sense.\"2nd Edition, Oxford University Press Jonathon Green similarly defines \"jobsworth\" as \"a minor factotum whose only status comes from enforcing otherwise petty regulations\"."]}, {"page": "H. C. McNeile", "response": ["McNeile had a quiet life after the war; his biographer Jonathon Green notes that \"as in the novels of fellow best-selling writers such as P. G. Wodehouse or Agatha Christie, it is the hero who lives the exciting life\". Although he was an \"unremittingly hearty man\", he suffered from delicate health following the war. He had a loud voice and a louder laugh, and \"liked to enliven clubs and restaurants with the sight and sound of military good fellowship\"; his friend and collaborator Gerard Fairlie described him as \"not everybody's cup of tea\", and commented that \"he was loud in every possible way—in his voice, in his laugh, in his clothes, in the unconscious swagger with which he always motivated himself, in his whole approach to life\". McNeile and his wife had two sons.", "In 1920 McNeile published Bull-Dog Drummond, whose eponymous hero—a member of \"the Breed\"—became his most famous creation. He had first written Drummond as a detective for a short story in The Strand Magazine, but the character was not successful and was changed for the novel, which was a thriller. Captain Hugh \"Bulldog\" Drummond DSO, MC was described in the novel's sub-title as \"a demobilised officer who found peace dull\" after service during the First World War with the fictional Loamshire Regiment. Drummond went on to appear in ten full-length novels by McNeile and a further seven by his friend Gerard Fairlie. The character was an amalgam of Fairlie, himself, and his idea of an English gentleman. Drummond also had roots in the literary characters Sherlock Holmes, Sexton Blake, Richard Hannay and The Scarlet Pimpernel. Drummond was characterised as large, very strong, physically unattractive and an \"apparently brainless hunk of a man\", who was also a gentleman with a private income; he could also be construed as \"a brutalized ex-officer whose thirst for excitement is also an attempt to reenact  the war\". The character was later described by Cecil Day-Lewis, author of rival gentleman detective Nigel Strangeways, as an \"unspeakable public school bully\". Drummond's main adversary across four novels is Carl Peterson, a master criminal with no national allegiance, who is often accompanied by his wife, Irma. Irma is described by Jonathon Green as \"the slinky epitome of a twenties 'vamp, and by Lawrence Treadwell as dark, sexy and from an oriental background, \"a true femme fatale\". After Carl Peterson's death in The Final Count, Irma swears revenge on Drummond and kidnaps his wife—whom he had met in Bull-Dog Drummond—with the intent of killing him in the ensuing chase. Irma Peterson appears in six of McNeile's books, and in a further five by Fairlie."]}, {"page": "Oz (magazine)", "response": ["With access to new print stocks, including metallic foils, new fluorescent inks and the freedom of layout offered by the offset printing system, Sharp's artistic skills came to the fore and Oz quickly won renown as one of the most visually exciting publications of its day. Several editions of Oz included dazzling psychedelic wrap-around or pull-out posters by Sharp, London design duo Hapshash and the Coloured Coat and others; these instantly became sought-after collectors' items and now command high prices. Another innovation was the cover of Oz No.11, which included a collection of detachable adhesive labels, printed in either red, yellow or green. The all-graphic \"Magic Theatre\" edition (Oz No.16, November 1968), overseen by Sharp and Mora, has been described by British author Jonathon Green as \"arguably the greatest achievement of the entire British underground press.\" During this period Sharp also created the two famous psychedelic album covers for the group Cream, Disraeli Gears and Wheels of Fire.", "At the appeal trial (where the defendants appeared wearing long wigs) it was found that Judge Argyle had grossly misdirected the jury on numerous occasions and the defence also alleged that Berger, who was called as a prosecution witness, had been harassed and assaulted by police. The convictions were overturned. Years later, Felix Dennis told author Jonathon Green that on the night before the appeal was heard, the Oz editors were taken to a secret meeting with the Chief Justice, Lord Widgery, who reportedly said that Argyle had made a \"fat mess\" of the trial, and informed them that they would be acquitted, but insisted that they had to agree to give up work on Oz. Dennis also stated that, in his opinion, MPs Tony Benn and Michael Foot had interceded with Widgery on their behalf.Green, Jonathon, (1999). All Dressed Up: The Sixties and the Counterculture. London: Pimlico. "]}, {"page": "English underground", "response": ["The phrase was used, in a wider cultural sense, in Jonathon Green's book Days In The Life: Voices from the English Underground, 1961–1971, a collection of first-hand accounts of the 1960s counter-culture that often drew on carnivalesque and music hall traditions and styles."]}, {"page": "Dominic Sandbrook", "response": ["Unlike some previous historians of the 1960s, Sandbrook argues that the period was marked by strong conservatism and conformity. His books attempt to debunk what he sees as myths associated with the period, from the sexual revolution to student protest, and he challenges the \"cultural revolution\" thesis associated with historians like Arthur Marwick. Charles Shaar Murray, writing in The Independent, called Sandbrook \"the Hoodie Historian\" and imagined him \"slouching into shot while throwing whatever passes for gang signs in the history department of the University of Sheffield, and announcing to Arthur Marwick, Jonathon Green et al. that 'You is all mi bitches nuh.'\""]}, {"page": "Mouth breathing", "response": ["In the early 20th century, \"mouth-breather\" was a technical term used by doctors to describe children who were breathing through their mouths due to an underlying medical condition. English lexicographer Jonathon Green notes that by 1915, the phrase \"mouth-breather\" had developed a pejorative connotation within English slang, defined as a \"stupid person.\" Currently, the Macmillan Dictionary defines the term \"mouth breather\" as a pejorative noun that is used to mean \"a stupid person.\""]}, {"page": "Slang dictionary", "response": ["* Green's Dictionary of Slang (by Jonathon Green, Chambers, ), 2010 comprising three volumes: A–E; F–O; P–Z", "* Chambers Slang Dictionary (by Jonathon Green, Chambers Harrap Publishers, ), 2008 previously Cassell Dictionary of Slang (Cassell Reference, 1998; last edition 2006, )"]}, {"page": "Half-truth", "response": ["*Arthur Koestler, a Hungarian-British author and journalist, wrote, \"Two half-truths do not make a truth, and two half-cultures do not make a culture.\"As quoted in Jonathon Green, Says who?: a guide to the quotations of the century, 1988, p. 451."]}, {"page": "Caroline Coon", "response": ["In 1995 her painting Mr Olympia was not shown at Tate Liverpool because the male subject had a semi-erect penis. In June 2000 she won damages of £40,000 and legal costs of £33,000 from publisher Random House after author Jonathon Green made false claims regarding her in his 1998 book All Dressed Up: the Sixties and the Counterculture.Michael Smith \"Sex-for-charity slur costs £40,000\", The Daily Telegraph, 13 June 2000 Coon published an intimate memoir, Laid Bare, in 2016."]}, {"page": "Fruit (slang)", "response": ["Jonathon Green, author of Cassell's Dictionary of Slang, lists several definitions for \"Fruit Loops\" including the loop at the back of a man's shirt collar which can be used to \"hold a victim ready for buggery\" (circa 1980 on college campuses), gay men and an area where they hang out and cruise each other. \"Fruit Loop\" can also refer to a cluster of gay bars, stores and businesses like Las Vegas' \"Paradise Fruit Loop\" just off the Las Vegas Strip. A fruitloop can also refer to a person considered crazy."]}, {"page": "British slang", "response": ["Jonathon Green, in his 1999 book The Cassell Dictionary of Slang, defines slang as \"A counter language, the language of the rebel, the outlaw, the despised and the marginal\". Recognising that there are many definitions, he goes on to say, \"Among the many descriptions of slang, one thing is common, it is a long way from mainstream English\".Green 1999, p. v (intro)."]}, {"page": "Gormogons", "response": ["Jonathon Green suggests in Cassell’s Dictionary of Slang that, in the form gormagon, the word is a blend of gorgon and dragon, while the Oxford English Dictionary describes the etymology as \"meaningless: pseudo Chinese.\"."]}, {"page": "Chambers (publisher)", "response": ["At the end of 2007 Chambers Harrap Publishers acquired the rights to publish the renowned British slang lexicographer Jonathon Green's Slang Dictionary as Chambers Slang Dictionary, originally published by Cassell of the Orion Publishing Group. This new edition was published in October 2008."]}, {"page": "Reference and User Services Association awards", "response": ["*Green’s Dictionary of Slang, by Jonathon Green. Oxford University Press, 9780550104403"]}, {"page": "Twat", "response": ["The literal sense is first attested in 1656, the epithet in the 1930s. The word's etymology is uncertain. The American Heritage Dictionary suggests a conjectural Old English word \"thwāt\", meaning \"a cut\", cognate with the Old Norse \"þveit\" (\"thveit\"). Jonathon Green suggests a connection with \"twitchel\", a dialect term for a narrow passage."]}, {"page": "Jonathon green", "response": ["#REDIRECT Jonathon Green "]}]}}