{"wiki_id": "http://www.wikidata.org/entity/Q6273665", "itemLabel": "Jonathan Legard", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Legard", "wikipedia_page": {"main": "Jonathan Legard (born 7 July 1961 in Cardiff, Wales), is a sports journalist, best known as the lead commentator for the BBC's Formula One TV coverage in 2009 and 2010.\nLegard has been the BBC's motor racing and football correspondent as well as commentating regularly on Formula One races for BBC Radio 5 Live from 1997 to 2004. On 24 November 2008, he was confirmed as the lead commentator for the BBC's Formula One coverage in 2009. On 11 January 2011, the BBC announced changes in the F1 commentary team.\nOn Twitter, Legard confirmed to British F1 fans that he would not be commentating on BBC F1 coverage during the forthcoming season.On 19 January 2011 Legard became a sports presenter on BBC Radio 4's Today programme. In February 2011 Legard began commentating on football in BBC's The Football League Show. He has served as the Olympic Broadcasting Services English-language commentator for volleyball since the 2012 Summer Olympics.", "link_mentions": [{"page": "Today (BBC Radio 4)", "response": ["The programme has a regular slot for sports news and items, 'Sports Desk', between 26 and 30 minutes past each hour, regularly presented by Garry Richardson, Jonathan Legard or Rob Bonnet and occasionally by Alison Mitchell, Karthi Gnanasegaram or Chris Dennis.BBC Radio 4 – Today. BBC (1 January 1970). If Parliament is in session the previous day there will be a summary at about 06:50 (Yesterday in Parliament\"Westminster to your ears\". BBC News (13 May 2004).) presented by two from Robert Orchard, David Wilby,David Wilby  Rachel Hooper and Susan Hulme.Susan Hulme "]}, {"page": "Shrewsbury School", "response": ["* Jonathan Legard (born 1961), journalist and broadcaster"]}, {"page": "List of sports announcers", "response": ["* Jonathan Legard – BBC Radio 1997–2004, 2012, BBC Sport 2009–2010"]}, {"page": "Martin Brundle", "response": ["Having largely retired from motor racing, Brundle became a highly regarded commentator on British television network ITV, whom he joined when they began Formula One coverage in 1997, initially alongside Murray Walker, and from 2002 James Allen. Brundle joined the BBC's commentary team alongside Jonathan Legard when they won back the rights to show F1 from 2009. Before the start of the  season, the BBC announced that Brundle was being promoted to lead commentator and would be joined by fellow former F1 driver, David Coulthard. He signed for Sky Sports' coverage at the end of 2011. At Sky Brundle returned to a co-commentary role, working alongside lead commentator David Croft."]}, {"page": "Jon Champion", "response": ["Champion joined BBC Sport in the late 1980s and worked as a football commentator on BBC Radio Five Live between 1992 and 1996. He worked alongside Alan Green, Mike Ingham, Ron Jones, Rob Hawthorne, and Jonathan Legard covering Premier League, FA Cup, League Cup, and Football League matches for the network. During this time, Champion commentated on the 1994 and 1996 First Division play-off Finals, and the 1996 UEFA Champions League Final between Juventus and Ajax. His fellow commentator on that evening was future ITV colleague Peter Drury."]}, {"page": "BBC Sport", "response": ["BBC Sport regained coverage of the Boat Race from ITV Sport who pulled out of coverage after the 2009 event. A five-year contract was signed by BBC Sport to cover the event from 2010 after last covering the 2004 race. Clare Balding hosts this and commentary came from Andrew Cotter from 2010 to 2011, 2013–present and from Jonathan Legard in 2012. The race is also broadcast on BBC World News. Former presenters for this were Harry Carpenter who also commentated and Steve Rider while Barry Davies also commentated on this from the 1990s to 2004.", "The BBC covered Formula One from 1978 until 1996 and from 2009 to 2015. The BBC provided live coverage of all races from 1995 to 1996 and again from 2009 to 2011, but from 2012 to 2015 the BBC showed 10 races live each season and highlights of all the races including the ones shown live. The BBC always showed the British Grand Prix and the final race live. Coverage was presented by Jake Humphrey from 2009 to 2012 and Suzi Perry from 2013 to 2015, with David Coulthard, Eddie Jordan and Allan McNish providing analysis during the races. Lee McKenzie and Tom Clarkson acted as pitlane reporters. The main commentators were Jonathan Legard in 2009 and 2010, Martin Brundle in 2011 and Ben Edwards from 2012 to 2015. Brundle acted as co-commentator in 2009 and 2010 and David Coulthard from 2011 to 2015. James Allen, Allan McNish and Jack Nicholls provide radio coverage with Jennie Gow as pit reporter though they also appeared on BBC TV. McKenzie presented Inside F1 for BBC News. Murray Walker contributed to coverage across the BBC for over sixty years and triple world champion and Mercedes driver Lewis Hamilton has a blog on BBC's website."]}, {"page": "Andrew Cotter", "response": ["* 2010–present: Boat Race commentator on television (replaced by Jonathan Legard in 2012 and 2015 as the Boat Race clashed with the US Masters Golf)"]}, {"page": "Football on 5", "response": ["Football League coverage on Channel 5 has numerous reporters at each game. Tom Skippings is the main reporter for most programmes. Two other notable reporters are Nick Halling and Sue Thearle - both taken from the BBC. Jack Woodward, Dan Mason, Dave Beckett and John Anderson all also feature semi-regularly. For the 2016/17 season, Channel 5 used 22 reporters during the course of the season, as well as those mentioned. Oliver Wilson, Will Cope, Dan O'Hagan, Alex Gordon-Martin, Faye Carruthers, Chris Maughan, Mick Conway, Jonathan Beck, Steve Lee, Andy Hodgson, Jonathan Legard, Simon Watts, Callum Williams, Chris Wise and Tony Colliver have all appeared during the 2016/17 season."]}, {"page": "Gran Turismo 5", "response": ["On September 5, 2011, Martin Brundle and Jonathan Legard commentated on a race between David Coulthard, driving a real Mercedes-Benz SLS AMG around the Top Gear test track, and 6 leading Gran Turismo players, racing on a console at Mercedes-Benz World. Coulthard won, with Jason Birt trailing by half a second. Reggie Yates, Pollyanna Woodward and Mike Bushell also took part in the race, but did not qualify for the leader board. Coulthard's lap was subsequently available to download for players to race against."]}, {"page": "List of BBC newsreaders and reporters", "response": ["| Jonathan Legard || Today, 5 Live, BBC News Channel"]}, {"page": "Legard baronets", "response": ["*Jonathan Legard (1961-date), grandson of the brigadier-general and nephew of Antony, is a well-known sports journalist with the BBC."]}]}}