{"wiki_id": "http://www.wikidata.org/entity/Q6271559", "itemLabel": "Jon Shaw", "itemDescription": "English association football player (born 1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jon_Shaw", "wikipedia_page": {"main": "Jon Steven Shaw (born 10 November 1983) is an English professional footballer who played as a striker and now as a central defender.", "link_mentions": [{"page": "England national football C team", "response": ["|Luke Moore, Jon Shaw", "|Jon Shaw, Russell Penn"]}, {"page": "Paul Buckle", "response": ["After the defeat, Buckle announced his intention to trim the Luton squad, which had played out the 2011–12 season using 34 contracted professionals, and followed this up by allowing 12 players to leave. Stating that he wanted to \"bring players into the club that are not failures\", he signed, among others, former Stevenage captain Ronnie Henry, who had won two promotions in three years, striker Jon Shaw, who had scored 35 goals throughout the season, and midfielder Jonathan Smith, who had played 48 times the previous season for Swindon Town as they won promotion to League One and finished as runners-up in the Football League Trophy. After a solid start to the 2012–13 season, which saw Buckle's side keep pace with the leaders, Luton's league form soon collapsed with the club winning only three league games between November 2012 and February 2013. Buckle was in charge as Luton beat Premier League side Norwich City 1–0 away at Carrow Road on 26 January 2013 in the FA Cup Fourth Round, striker Scott Rendell's late goal ensuring that the club became the first non-League team in 24 years to defeat a top division side in the competition. However, just three weeks later he left the club by mutual consent for personal reasons. These were later revealed to be an imminent move abroad to the US with his wife, TV sports presenter Rebecca Lowe, who was fronting NBC's Premier League coverage in the country."]}, {"page": "King Ecgbert School", "response": ["*Jon Shaw, footballer"]}, {"page": "Ian Bogie", "response": ["He picked out a gem of a player in Lee Novak for a fee of £3,500 from Newcastle Blue Star. Novak won the golden boot award and was bought by League One side Huddersfield Town for a fee that has brought Gateshead a North East non-league record fee of £150,000. His team retained their Conference National status in 2009–10, finishing above the relegation zone on goal difference (though this was later made into a two-point gap after Salisbury City were expelled from the division). On 28 April 2010, Bogie signed a new two-year contract which made him Gateshead's first full-time manager in over half a century. Under his charge the \"Tynesiders\" posted a 14th-place finish in 2010–11, reaching the semi-final of the FA Trophy and winning the Durham Challenge Cup. Gateshead pushed on again in 2011–12, flirting around the play-off spots all season before finishing in eighth position; they also reached the FA Cup second round and the quarter-finals of the FA Trophy. He signed a one-year extension to his contract in May 2012. He then lost top-scorer Jon Shaw to Luton Town, and attempted to replace him with former Hartlepool United stalwart James Brown. He further signed defender Glenn Wilson, goalkeeper Adam Bartlett, attacker Ryan Donaldson, and defender Chris Bush. However, after opening the 2012–13 season with six leagues without defeat, Gateshead struggled with poor form. On 10 December 2012, Bogie and assistant Terry Mitchell were relieved of their duties at the club."]}, {"page": "2007–08 Football Conference", "response": ["|= ||align=left| Jon Shaw ||align=left| Halifax Town || 20||0||1||4||25"]}, {"page": "2005–06 Manchester United F.C. season", "response": ["The draw for the third round of the FA Cup took place on 4 December 2005, and Manchester United were given an away tie with Conference National side Burton Albion. The game, played on 8 January 2006, ended as a 0–0 draw, with Burton deservedly earning a replay through the draw. The Brewers were the better team in the first half, with Phil Bardsley clearing headers off the line from Jon Shaw and skipper Darren Stride. United struggled on a heavy pitch, although Wayne Rooney twice forced saves from Burton goalkeeper Saul Deeney after coming on as a substitute. And in injury time, Deeney dramatically saved Ritchie Jones' low strike. A late winner for United would have been cruel on Burton, who held firm in the second half as the Premier League side pressed forward."]}, {"page": "Sheffield Wednesday F.C. Academy", "response": ["* Jon Shaw"]}, {"page": "List of Gateshead F.C. seasons", "response": ["|Jon Shaw", "|Jon Shaw"]}, {"page": "2009–10 Stevenage Borough F.C. season", "response": ["On 1 January 2010, Borough entertained Cambridge United in the reverse fixture from Boxing Day. The game ended 4–1 to Stevenage, with Yemi Odubade, Chris Beardsley and a Lee Boylan brace ensuring the home side earned a comfortable win. Three weeks later, Stevenage beat Kettering Town 2–0 at Broadhall Way. Borough took the lead just after the hour mark when substitute Tim Sills headed the ball into the path of Stacy Long, who rifled the ball past Nathan Abbey from just outside the area. Long doubled his tally in injury-time, rounding Abbey to slide the ball home. Stevenage lost their third league match of the season at The Lamb Ground; a 1–0 defeat to Tamworth, a game in which both Ronnie Henry and Darren Murphy were sent-off. Three days later, Borough bounced back with a 3–1 victory over Mansfield Town at Broadhall Way. Stevenage trailed at the interval thanks to a Jon Shaw strike just before half-time. But Yemi Odubade, who also missed a late penalty, fired Borough level from 15 yards after the break and his low drive from the edge of the box gave Borough the lead. Substitute Andy Drury's strike sealed the win and Mansfield's misery was complete when Luke Jones was sent off. Stevenage lost their second successive away game, losing 1–0 at Rushden & Diamonds. Ten days later, Borough picked up a 1–0 win in North Wales against Wrexham thanks to a goal from David Bridges just before the interval."]}, {"page": "2008–09 Rochdale A.F.C. season", "response": ["|  Jon Shaw || Halifax Town || Undisclosed || 05-07-2008 || align=\"center\"|"]}, {"page": "2011–12 Stockport County F.C. season", "response": ["Stockport lost 1–0 at home to Gateshead a week later. The goal for Gateshead was scored by Jon Shaw. On 10 December Stockport played their first ever game in the FA Trophy and drew 2–2 at home to Conference North side Stalybridge Celtic. The goals came from Tom Elliott and Sean McConville, the latter of whom also missed a penalty. Connor Jennings scored twice for the visitors while Rhys Meynell was sent off.", "On 7 January, they were beaten 2–0 away from home to Gateshead. Jon Shaw and Chris Moore scoring the goals for the home side. Three days later, Stockport lost their second game in row when they were beaten 1–0 at Luton Town, they conceded their third penalty in as many games which was converted by Aaron O'Connor. A week after the game with Stockport not playing director of football Jim Gannon decided to say that he is optimistic about the club's future.  On 21 January Stockport drew 2–2 away to Braintree Town. They had to come back from two goals down after Aswad Thomas opened the scoring on 58 minutes. Nicky Symons doubled the lead on 61 minutes but"]}, {"page": "2011–12 Luton Town F.C. season", "response": ["The next day, it was announced that Forest Green had turned down a bid from Luton for their top-scorer Reece Styche. Later, it also emerged Gateshead had rejected a £40,000 bid for their own top-scorer Jon Shaw.", " After these three departures, two further players were signed in the form of strikers Scott Rendell and Jon Shaw. Rendell, penning a two-year contract, joined on an undisclosed fee from Wycombe Wanderers, while Shaw also signed a two-year contract following his rejection of an offer from Gateshead, where he had scored 35 goals during the season. The club made their fifth signing on 25 June with the acquisition of Gillingham centre-back Garry Richards, the deal officially going through on 1 July. Jake Howells, now Luton's current longest-serving player following Keith Keane's departure, signed a three-year contract extension on 27 June. Goalkeeper Lewis Kidd signed a one-year contract on 29 June, while it was announced the same day that striker Dan Walker had rejected two contract offers from Luton and so would be placed on the transfer list.", "| 21 June 2012 ||  Jon Shaw || Gateshead || style=\"text-align:center;\"| Free || style=\"text-align:center;\"| "]}, {"page": "2011–12 York City F.C. season", "response": ["Walker scored what proved to be only a consolation after scoring in the 84th minute against Tamworth, with York losing 2–1 away after conceding two penalties, both of which were awarded from fouls committed by Chris Smith. York's first victory in four matches came after Jamie Reed scored an 88th-minute winner to give the team a 1–0 win at home to Bath City. This was followed by a 3–0 win away to league leaders Wrexham, with first half goals from McLaughlin, Chambers and Reed handing York victory. York then drew 2–2 at home to Darlington; Reed opened the scoring in the second minute with a shot into the top corner from the edge of the penalty area, and in the 79th minute Walker scored with a curling shot into the top corner to equalise for York. Chambers and Walker scored first half goals as York defeated Luton 3–0 at home. After a four-match unbeaten run York were defeated 3–2 away to Gateshead, with former York loanee Jon Shaw scoring their three goals, and Walker and a Curtis own goal making up York's tally."]}, {"page": "2012–13 Luton Town F.C. season", "response": ["Luton signed various out-of-contract players themselves, with former Stevenage captain Ronnie Henry, Gillingham players Danny Spiller and Garry Richards (Richards' transfer becoming permanent on 1 July), and Gateshead striker Jon Shaw, who had scored 35 goals the previous season, all joining the club for free. The club also bought Wycombe Wanderers forward Scott Rendell for an undisclosed fee and made striker Andre Gray's loan from Hinckley United permanent, as he joined the club on a two-year contract for a fee of £30,000. Meanwhile, Jake Howells, JJ O'Donnell, Alex Lacey and Lewis Kidd signed contract extensions.", "Luton started their season once again with high expectations and as the bookmakers' favourite for promotion, but this impression was dealt a reality check within the first 35 minutes of their opening game against Gateshead on 11 August as they conceded two first-half goals, including one from former Luton striker Liam Hatch. Substitute Jon Shaw scored on his debut to halve the deficit, coincidentally against his former club, and a goal from Stuart Fleetwood meant Luton drew 2–2.", "On 17 August, Luton played against Hyde, coming from a goal down scored by former-Hatter Matthew Blinkhorn to win 2–1 courtesy of a first goal from midfielder JJ O'Donnell and Fleetwood's fourth of the season. Luton lost 1–0 at home to AFC Telford United on 25 August, Paul Buckle's first league defeat as manager in a game that saw Ronnie Henry and Telford defender Dan Preston shown red cards, which was swiftly followed two days later with a 3–1 win over Ebbsfleet United. Stuart Fleetwood scored his fifth and sixth goals of the season, with Scott Rendell getting his first goal for the club. Following on from the red cards in the game with Telford, both clubs were charged by the Football Association with failing to control their players. In addition, striker Jon Shaw, who began the incident but was not seen by the referee, was charged by the FA with violent conduct and banned for three matches. With defenders Ronnie Henry and Alex Lacey suspended and injured respectively, Luton signed Gillingham centre-back Connor Essam on a one-month loan on the day of the transfer deadline.", "Luton began September strongly with a 4–1 home victory against Macclesfield Town, the goals coming from Jake Howells, Andre Gray, Scott Rendell and Stuart Fleetwood. A 3–2 win over local rivals Cambridge United followed three days later, Gray scoring again and defenders János Kovács and Dean Beckwith also on the scoresheet with goals from set pieces. Injuries to strikers Fleetwood and Rendell, plus Jon Shaw's suspension, led to Northampton Town forward Jake Robinson signing on a one-month loan on 7 September. He played in Luton's first away defeat of the season the next day, a heavy 3–0 loss to Alfreton Town which caused Paul Buckle to apologise for the performance to the Luton fans.", "Connor Essam's loan from Gillingham was extended for a further month on 3 October. Luton beat Lincoln City 2–1 on 6 October with the Hatters' goals coming from Jon Shaw, his first since the opening day, and an own goal from Lincoln goalkeeper Paul Farman. Forward Jake Robinson and defender Simon Ainge both signed extensions to their loans shortly afterwards; Robinson for one month and Ainge for two. Additionally, Ainge's parent club Guiseley reached an agreement to sell him to Luton when the transfer window in January 2013.", "On New Year's Day, Luton experienced their eighth league loss of the season, being beaten 3–1 by Woking in a reverse of the scoreline on Boxing Day. On 5 January, Luton beat Championship side Wolverhampton Wanderers, a side 59 positions higher than them in the league system, 1–0. The winning goal came 45 seconds after half-time, scored by midfielder Alex Lawless to put the club into the FA Cup Fourth Round for the first time since the 2006–07 season. Lawless later won the FA Cup player of the round award. The club beat bottom-of-the-table club Barrow 6–1 on 8 January, with Jon Shaw scoring a hat-trick. Four days later, Luton progressed to the quarter-finals of the FA Trophy by scoring two late goals against Skelmersdale United. Luton dropped out of the play-off places with a 0–0 draw away to AFC Telford United on 15 January, albeit with games in hand.", "John Still made his first signing on 1 March, loaning in-form striker Alex Wall from Conference South side Maidenhead United following injuries to regular strikers Jon Shaw and Scott Rendell, and illness to Andre Gray. Still's first game as Luton manager on 2 March saw the club win for the first time in eight games, beating Stockport County 1–0 with Jake Howells scoring the only goal of the match. This also marked the club's first away victory in the league for over four months. The club signed 19-year-old Millwall defender Jake Goodman on loan until the end of the season on 4 March. It was also announced that Terry Harris, John Still's deputy at Dagenham, was the club's new assistant manager. Goodman started in Luton's 0–0 away draw with Nuneaton Town on 5 March. Still signed Nigerian midfielder Solomon Taiwo, who he had worked with at Dagenham & Redbridge, on a free transfer on 7 March. Luton drew 1–1 on 9 March at home to Hereford United, Dave Martin scoring his first goal for the club. Meanwhile, winger James Dance rejoined Nuneaton on loan until the end of the season on 11 March. One day later, in a performance described by Still as having \"no positives\", Luton lost 2–1 at home to relegation-threatened Hyde in front of Kenilworth Road's lowest league crowd in over 11 years. The club then drew 0–0 with league leaders Wrexham on 16 March. Three days later, Luton won their second game under Still with a 1–0 home win over Stockport County, Steve McNulty scoring the winning goal. The same day, coaches Carl Emberson and Stuart Cash, who were hired by previous manager Paul Buckle, left the club with immediate effect. Luton drew 0–0 with Tamworth on 23 March, securing their fifth clean sheet in seven matches in the process. The club signed left-back Scott Griffiths on a contract until the end of the season two days later. Griffiths had previously played over 200 games for John Still at former club Dagenham & Redbridge. Defender Greg Taylor, who was dropped from the team following mistakes in the defeat by Hyde earlier in the month, joined Mansfield Town on loan until the end of the season on 28 March. Wayne Thomas also left the club on loan, joining League Two side Rochdale. John Still announced that, along with Taylor, five other out-of-contract players would leave Luton in the summer: central defender János Kovács, wingers Scott Neilson and James Dance, and strikers Alasan Ann and Stuart Fleetwood. In addition, midfielder Arnaud Mendy was placed on the transfer list. Luton drew 2–2 with fellow mid-table side Cambridge United on 30 March, Jon Shaw and Solomon Taiwo scoring the goals.", "|align=\"left\"|9||align=\"left\"|FW||align=\"left\"| Jon Shaw"]}, {"page": "Jessica Ashwood", "response": ["Ashwood is a swimmer, specialising in the 800-metre freestyle event. As a four-year-old, she started swimming. In 2012, she was training with Jayden Hadler, Daniel Arnamnart, James Magnussen and Daniel Tranter. She was coached by Jon Shaw from 2009 to 2010.  Brant Best became her coach in 2010 and was her coach from 2012 to 2014, and by Vince Raleigh since joining the Chandler Swimming Club in Queensland."]}, {"page": "Norwich City F.C. 0–1 Luton Town F.C.", "response": ["|FW ||9 || Jon Shaw || || "]}]}}