{"wiki_id": "http://www.wikidata.org/entity/Q6276952", "itemLabel": "Jordan Robertson", "itemDescription": "English footballer (born 1988)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jordan_Robertson", "wikipedia_page": {"main": "Jordan Steven Robertson (born 12 February 1988) is an English professional footballer who last played as a striker for Harrogate Town.\nBorn in Sheffield he began his career with Sheffield United but failed to ever break into the first team. He was loaned out to a number of clubs during his time with United, including Torquay United, Northampton Town, Dundee United, Oldham Athletic, Southampton, Ferencváros and Bury. While with Southampton he was involved in a traffic accident in which the driver of the other car was killed. Robertson was subsequently jailed for 32 months for causing death by dangerous driving. On his release from prison he returned to football and had a spell with St Johnstone before spending a year at Scunthorpe United.", "link_mentions": [{"page": "HM Prison Doncaster", "response": ["* Jordan Robertson, former footballer jailed for causing death by dangerous driving."]}, {"page": "Nathan Dyer", "response": ["In September 2008, after failing to make it onto Southampton's first team and establish himself under managers Jan Poortvliet and Mark Wotte, Dyer was sent to Sheffield United on loan until December, with the option of a permanent deal in January 2009. The move was part of a loan swap deal, with Jordan Robertson joining Southampton for the same duration."]}, {"page": "Josh Walker (footballer, born 1989)", "response": ["On 13 January 2012 Walker joined Scunthorpe United on a one-month emergency loan deal. Walker's move to Scunthorpe United permanently was changed to Loan because Fifa's rules which mean players can only play for two clubs in a season apply for standard but not emergency loans. Walker scored on his debut for Scunthorpe United in a 1–1 draw against Colchester United. His debut impressed manager Alan Knill and he told the club official website: \"Josh is a good player and fits in well in there. We lost [Manchester United loanee] Oliver Norwood, but we have Josh, who is a bit more streetwise and very good on the ball.\" On 18 February, Walker scored his second goal and set up a goal for Jon Parkin in a 3–1 win over Leyton Orient. On 20 February, Walker extended his loan spell at Scunthorpe for another month after making five appearances and scoring twice. On 6 March, Walker provided a double assist in the late second half for David Mirfin and Garry Thompson respectively in a 2–1 win over Oldham Athletic. On 31 March, Walker scored his third goal and set up a goal for Jordan Robertson in a 4–1 win over Chesterfield."]}, {"page": "2007–08 Dundee United F.C. season", "response": ["The pre-season period began with two new permanent signings at the club, Polish goalkeeper Łukasz Załuska and Darren Dods having signed deals in June. Irishman Willo Flood also arrived from Cardiff City on a season-long loan deal. In July, former Ajax youngster Prince Buaben signed after a successful trial and was joined by a second Polish keeper, Grzegorz Szamotulski, in time for the league season. Englishman Jordan Robertson became the second long-term loan signing when he arrived from Sheffield United in late August.", "*18 January: Jordan Robertson is recalled from his loan spell by Sheffield United."]}, {"page": "2007–08 Oldham Athletic A.F.C. season", "response": ["| Jordan Robertson"]}, {"page": "2008–09 in English football", "response": ["25 December 2008: Sheffield United striker Jordan Robertson, 20, suffers minor injuries in a car crash on the M1 motorway in Leicestershire in which a 38-year-old Coventry man is seriously injured.", "26 December 2008: Nottingham Forest, 22nd in Football League Championship, terminate the contract of manager Colin Calderwood after two and a half years in charge. Omar Mohammed, the man injured in the car crash which also involved Jordan Robertson, dies in hospital."]}, {"page": "Matt Paterson", "response": ["Born in Dunfermline, Fife, Paterson was educated at Neville Lovett Community School in Fareham, Hampshire. He started his career in the youth system at AFC Bournemouth before a number of clubs showed an interest. He then joined the Southampton Academy in 2007. At the end of the 2007–08 season, Paterson won Southampton Academy player of the season. He made his first team debut as a substitute at St Mary's Stadium, coming on for Jordan Robertson against Norwich City on 30 September 2008."]}, {"page": "List of foreign Liga I players", "response": ["*Jordan Robertson – Gaz Metan Mediaș – 2013–2014"]}, {"page": "2009–10 in English football", "response": ["2 October: Sheffield United striker Jordan Robertson is jailed for 32 months on a charge of causing death by dangerous driving in relation to a fatal car crash on the M1 motorway in December 2008."]}, {"page": "2009–10 Sheffield United F.C. season", "response": ["* 2 October 2009 – Jordan Robertson is sentenced for 32 months after causing death by a car crash, forcing his loan spell at Bury to be cut short.", "| Jordan Robertson"]}, {"page": "Meadowhead School", "response": ["*Jordan Robertson, former footballer who played for Sheffield United and Southampton"]}, {"page": "2008–09 Southampton F.C. season", "response": ["|align=\"left\"| Jordan Robertson", "| Jordan Robertson"]}, {"page": "2011–12 St Johnstone F.C. season", "response": ["|Jordan Robertson"]}, {"page": "2011–12 Scunthorpe United F.C. season", "response": ["Scunthorpe began their pre-season campaign against non-league Bottesford Town, who they beat 7–0, the Irons first goal came courtesy of trialist Mustafa Tiryaki, and with Matt Godden and Chris Dagnall putting them up 3–0 within the first half. Four more goals came in the second half from Robert Grant, Paul Reid, Mark Duffy and new signing Jordan Robertson.", "|10||FW||Jordan Robertson||3||0||0||0||3", "|10||FW||Jordan Robertson||2||1||0||0||0||0||0||0||2||1", "|14 April || 3 || Jordan Robertson ||align=left|  vs MK Dons || Huddersfield (A), Bournemouth (H), Tranmere (A)"]}, {"page": "2011–12 Sheffield Wednesday F.C. season", "response": ["The start of 2012 was highly anticipated by Sheffield Wednesday with knowledge of the possibility of being promoted to the Football League Championship at the end of season in May. The key aim was to gain automatic promotion and that was a task that had so far in the first half of the season been greatly helped by on loan winger Ben Marshall, who had probably been the best player for The Owls so far. However, the thing on all the fans' minds was Marshall's future at the club, as his loan from Stoke City was due to end during the middle of the month and his contract at Stoke City due to end in the summer. Only being 20 years of age, it was made clear by Gary Megson, known to be great friends with Stoke City manager Tony Pulis, the outcome would either be that 'Marshall will either sign a new contract at Stoke City and hopefully come back on loan to us (Sheffield Wednesday) or another club will snap him up and buy him'. Wednesday had a match to concentrate on however and their first game of 2012 came at home to Tranmere Rovers. The home game was first of four in a row for Wednesday. Sheffield Wednesday got off to a great start when Reda Johnson scored on just the second minute, then five minutes later Chris Lines scored his first home goal of the club to put The Owls 2–0 up. The game relaxed after this until the eighty-second minute when Ian Goodison scored from a corner to put a nervous last ten minutes of the game, with Sheffield Wednesday losing points in the final minutes of games just weeks earlier. However, Sheffield Wednesday managed to hold on and the game finished 2–1. On the Thursday after this game left back Mark Reynolds who had played only a few games since he joined the club at the beginning of the season was sent out on loan till the end of the season to Aberdeen. Sheffield Wednesday faced top of the Football League Championship West Ham United in the FA Cup the following weekend. Both teams made changes and was a very tight encounter even though the odds were stacked up on West Ham United to go through to the next round. It took a late goal to separate the sides when Chris O'Grady scored with two minutes to go of the ninety and sent Sheffield Wednesday through to the next round of the competition. The next day Sheffield Wednesday found they would be playing Blackpool away in Round 4 of the competition. With the transfer market open for the January month The Owls made their first signing when Miguel Llera, who had signed on loan for the month previously, signed on a two-year contract on a free transfer from Blackpool. Also, the club saw the introduction of Mike Jones a winger signed on an undisclosed fee for two-and-a-half years from fellow League One club Bury. In terms of departures, the club saw three when young goalkeeper Sean Cuff was sent out on loan to Cambridge United for a month, out-of-contract James O'Connor left for American club Orlando City, and Giles Coke went back on loan to Bury for the rest of the season. Back to matches and Sheffield Wednesday faced their toughest opponent of the season so far when the played top of the league Charlton Athletic at home, Charlton Athletic were five points clear of second place Sheffield Wednesday and had not dropped from the top of the league since October. The first goal was largely expected to be the key goal and the team who would go on to win the game. Sheffield Wednesday, unbeaten at home throughout the season and only having two draws at Hillsborough Stadium, started slightly on the back foot in front of a crowd of over 26,000 and were the first to concede when Charlton Athletic captain Johnnie Jackson curled a free-kick around the wall and into the net. That turned out to be the only goal of the game and Sheffield Wednesday were ended of their unbeaten run since the beginning of the season at home. Although with much of the season to go, the game was likely to end any chances of Sheffield Wednesday winning the league with Charlton Athletic now eight points clear of second place and Wednesday slipping down to fourth place with city rivals Sheffield United taking up second place four points ahead of The Owls, although they had played one extra game. The final of the four straight home games was against Hartlepool United and after a goalless first half it was Peter Hartley's goal that put Hartlepool United ahead two minutes into the second half. It took a goal by Jermaine Johnson when he took on four players on the right flank before finishing into the far, low bottom corner to put Sheffield Wednesday back on level terms. That goal lifted the fans in the stadium and the players reacted and scored a second with fifteen minutes to go with Gary Madine on the score sheet this time. However, again The Owls opted to start to defend their lead and then what seemed to be a goal out of nothing from outside the box and caught the keeper off his line, as Antony Sweeney's eighty-eighth minute effort meant Sheffield Wednesday could only manage a draw. With Wednesday reaching Round 3 of the FA Cup it meant that the game they would have played in the league on that same weekend was rescheduled to mid-week. This game was rescheduled to 24 January and was away to Scunthorpe United. After two disappointing results in a row Sheffield Wednesday were looking to bounce back. Sheffield Wednesday did exactly that when Chris O'Grady scored in under a minute after a long ball from Miguel Llera found the striker. Sheffield Wednesday then doubled their lead seventeen minutes later as Chris O'Grady grabbed his second. In the second half there was another goal from Jermaine Johnson, when he took on three players after running from the half-way line and slotted the ball coolly into the net when he found himself one-on-one. Jordan Robertson did pull one back for Scunthorpe United from a corner, but the game did finish 1–3 to The Owls. Sheffield Wednesday's next trip was in the FA Cup against Blackpool. Gary Megson made many changes to the side as he wanted to rest his key players ready for the tough mid-week tie in the league against fifth place MK Dons. One of those changes was striker Clinton Morrison who put The Owls unexpectedly ahead on the fifty-second minute. However, Sheffield Wednesday conceded yet another late, late goal, this time it was in the last minute of stoppage time again when Sheffield Wednesday conceded a penalty and Kevin Phillips scored from the spot in the ninety-minute, meaning a replay had to be played – something that neither team wanted due to their league focuses. The draw for the FA Cup saw the winner of the replay to play Premier League side Everton in the fifth round of the competition. After this Tottenham Hotspur young midfielder John Bostock join The Owls on loan until the end of the season. Mid-week and the last day of the month saw Sheffield Wednesday away to fifth place Milton Keynes Dons. Sheffield Wednesday were six points ahead of Milton Keynes Dons in fourth place; however they had played one more game than Milton Keynes Dons. An effort from distance saw the ball hit the bar and then hit goalkeeper Stephen Bywater's leg and roll into the net, giving Milton Keynes Dons the lead after seventeen minutes. Ten minutes later however a corner for Sheffield Wednesday saw Gary MacKenzie put the ball into his own net after the ball bounced off his knee, making it two own goals in the game. The game finished 1–1 and as a result Sheffield Wednesday went home happy with. However, the bad news of the month was Sheffield Wednesday were unable to extend key player Ben Marshall's loan until the end of the season. Marshall had made twenty-two appearances for the club, scoring five goals, and was signed by Football League Championship club Leicester City for over a million pounds. The loss of Marshall could have affected the team coming up to the 'business' and most crucial part of the season, and with Sheffield Wednesday only winning one of their last four gains with Ben Marshall, how much of an effect would his loss have on Sheffield Wednesday's automatic promotion hopes?"]}, {"page": "Conor McAleny", "response": ["On 23 March 2012, McAleny joined League One side Scunthorpe United on loan for the remainder of the season.\"Scunthorpe United F.C. 23 March 2012. Retrieved 24 March 2012. He made his debut the following day, coming on as a 65th-minute substitute for Jordan Robertson in a 0–0 home draw with Notts County.\"Scunthorpe 0–0 Notts County\" BBC Sport. 24 March 2012. Retrieved 24 March 2012. A knee injury saw him make just three appearances for the club."]}, {"page": "2013 Singapore Cup", "response": ["|Jordan Robertson"]}, {"page": "2013 Global Cebu F.C. season", "response": ["|align=\"left\"|11||align=\"left\"|MF||align=\"left\"| Jordan Robertson"]}]}}