{"wiki_id": "http://www.wikidata.org/entity/Q6283758", "itemLabel": "Joseph Hamilton Beattie", "itemDescription": "Locomotive engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Hamilton_Beattie", "wikipedia_page": {"main": "Joseph Hamilton Beattie (1808-1871) was a locomotive engineer with the London and South Western Railway. Joseph Beattie was born in Ireland on 12 May 1808. He was educated in Belfast and initially apprenticed to his father, a Derry architect. He moved to England in 1835 to serve as an assistant to Joseph Locke on the Grand Junction Railway and from 1837 on the London and Southampton Railway.  After the line opened he became the carriage and wagon superintendent at Nine Elms and succeeded John Viret Gooch as locomotive engineer on 1 July 1850.", "link_mentions": [{"page": "London and South Western Railway", "response": ["*1850–1871: Joseph Hamilton Beattie (as Locomotive Superintendent)", ";1850–1866 (Joseph Hamilton Beattie)", ";1866–1872 (Joseph Hamilton Beattie)"]}, {"page": "Locomotives of the Southern Railway", "response": ["====Joseph Hamilton Beattie (1850–1871)====", "| colspan=9 | Joseph Hamilton Beattie (1850–1871)"]}, {"page": "1871 in rail transport", "response": ["* October 18 – Joseph Hamilton Beattie, locomotive engineer for London and South Western Railway 1850–1871 (b. 1808)."]}, {"page": "1850 in rail transport", "response": ["* July 1 – Joseph Hamilton Beattie succeeds John Viret Gooch as locomotive engineer for London and South Western Railway."]}, {"page": "Beattie", "response": ["* Joseph Hamilton Beattie (1808–1871), locomotive engineer, London and South Western Railway", "* William George Beattie (1841–1918), son of Joseph Hamilton Beattie, also locomotive engineer for the London and South Western Railway"]}, {"page": "1808 in rail transport", "response": ["* May 12 – Joseph Hamilton Beattie, locomotive engineer for London and South Western Railway 1850–1871 (d. 1871), is born."]}, {"page": "LSWR 0298 Class", "response": ["In 1850, the LSWR decided that the London suburban passenger services should be operated using small tank locomotives. To determine the most suitable type, Joseph Hamilton Beattie, the LSWR Mechanical Engineer, prepared a series of designs for six-wheeled well tank locomotives, each of which incorporated one or more differences from the previous class. A small quantity of each was produced: between 1852 and 1859, 26 were built, to six different designs. These were the Tartar and Sussex classes of 1852, the Chaplin and Minerva classes of 1856, the Nelson class of 1858 and the Nile class of 1859. The wheel arrangement was either  or ; the driving wheels varied between  and  in diameter; the cylinder bore varied between ; the stroke was either ; and there were other changes."]}, {"page": "Joseph Hamilton", "response": ["* Joseph Hamilton Beattie (1808–1871), locomotive engineer with the London and South Western Railway"]}, {"page": "Nine Elms Locomotive Works", "response": ["The original locomotive, carriage and wagon workshops were built by the London and South Western Railway (LSWR) adjoining their original passenger terminus near the Vauxhall end of Nine Elms Lane in 1839, but suffered a disastrous fire in March 1841. They were rebuilt and from 1843 were used to construct over one hundred new locomotives for the company, to the designs of John Viret Gooch and Joseph Hamilton Beattie.", "The second Nine Elms works was responsible for the construction of more than 700 steam locomotives before closure in 1909, to the designs of Joseph Hamilton Beattie, his son William George Beattie, William Adams and Dugald Drummond. The company enlarged the workshops on a number of occasions and at its height in 1904 the locomotive works employed 2,438 men, building 22 and repairing 450 locomotives in a year."]}, {"page": "William George Beattie", "response": ["William George Beattie (2 December 1841London, England, Church of England Births and Baptisms, 1813-1917 – 28 May 1918) was an English locomotive engineer. He was born in Lambeth, London the son of Joseph Hamilton Beattie. He joined the London and South Western Railway in 1862 as a draughtsman at Nine Elms Locomotive Works. He succeeded his father as Locomotive Engineer of the LSWR following Joseph's death in 1871. He was not however a success in this post and was forced to resign in 1878.Marshall, John, (1978), A biographical dictionary of locomotive engineers, David & Charles"]}]}}