{"wiki_id": "http://www.wikidata.org/entity/Q6286173", "itemLabel": "Joseph Pemberton", "itemDescription": "British rose breeder (1852-1926)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Pemberton", "wikipedia_page": {"main": "Joseph Pemberton (1852–1926) was a British rosarian, remembered for creating the hybrid musk class of cultivated roses.", "link_mentions": [{"page": "Havering-atte-Bower", "response": ["* Joseph Pemberton, rosarian."]}, {"page": "Pemberton, British Columbia", "response": ["Pemberton was named for Joseph Despard Pemberton, a surveyor for the Hudson's Bay Company and Surveyor-General for the Colony of Vancouver Island in the 1850s. Joseph Pemberton had laid out Victoria's townsite, and supervised the construction of British Columbia's first legislature building, \"the Birdcages\". Joseph Pemberton never visited the place that bears his name."]}, {"page": "Garden roses", "response": ["Although they arose too late to qualify technically as old garden roses, the hybrid musks are often informally classed with them, since their growth habits and care are much more like the old garden roses than modern roses. The hybrid musk group was mainly developed by Rev. Joseph Pemberton, a British rosarian, in the first decades of the 20th century, based upon 'Aglaia', an 1896 cross by Peter Lambert. A seedling of this rose, 'Trier', is considered to the foundation of the class. The genetics of the class are somewhat obscure, as some of the parents are unknown. Rosa multiflora, however, is known to be one parent, and Rosa moschata (the musk rose) also figures in its heritage, though it is considered to be less important than the name would suggest. Hybrid musks are disease-resistant, repeat flowering and generally cluster-flowered, with a strong, characteristic \"musk\" scent. The stems tend to be lax and arching, with limited thorns.", "* Joseph Pemberton was an Anglican clergyman and amateur rosarian who set out to breed 'old fashioned' roses. The resulting hybrid musks include 'Felicia' and 'Penelope'. On his death, the nursery passed to his gardener J.A. Bentall, who produced 'Buff Beauty' and the Polyantha 'The Fairy'."]}, {"page": "Athletics at the 2007 Pan American Games – Men's long jump", "response": ["| 19 || A || align=left| Joseph Pemberton || align=left|  || 6.86 || 6.66 || 6.39 || 6.86 ||"]}, {"page": "Buff Beauty", "response": ["#REDIRECTJoseph Pemberton"]}, {"page": "List of rose breeders", "response": ["*Joseph Pemberton was an Anglican clergyman and amateur rosarian who set out to breed 'old fashioned' roses. The resulting Hybrid Musks include 'Felicia' and 'Penelope'. On his death, the nursery passed to his gardener J.A. Bentall, who produced 'Buff Beauty' and the Polyantha 'The Fairy'."]}, {"page": "Henry Bennett (rose hybridizer)", "response": ["In 1880, Bennett was invited to a meeting of the Horticultural Society of Lyon, then a center of rose breeding and production. It was decided at this meeting that Bennett had created an entirely new class of roses, and that it would be called Hybrid Tea. Other rose growers followed suit, in the UK first by Paul & Son nursery in 1883, then Hugh Dickson of Belfast in 1884. The eminent British rosarian Joseph Pemberton dates the recognition of Hybrid Teas as a separate class at 1890, and credits the nursery Paul & Son with the first commercial offering of a Hybrid Tea in 1873, with 'Cheshunt Hybrid'. The National Rose Society in UK recognised the new class of Hybrid Tea in 1893. Of course, 'La France', introduced in 1872 by Jean-Baptiste André (fils) Guillot, is now generally considered to be the first Hybrid Tea, but was not recognised as a new kind of rose until after the new class was designated at this meeting in Lyon; it was classed as a Hybrid Perpetual when it was introduced.  'La France' also suffers from sterility, making it difficult to use in hybridising, while 'Lady Mary Fitzwilliam' is very fertile. The online database HelpMeFind Roses lists over 14,000 descendants for 'Lady Mary Fitzwilliam'."]}, {"page": "Rosa 'Buff Beauty'", "response": ["Rosa Buff Beauty is an apricot Hybrid musk rose cultivar, bred by Ann Bentall and introduced into Great Britain in 1939. Bentall and her husband, John Bentall, inherited the rose fields of acclaimed rose breeder, the Reverend Joseph Pemberton after his death in 1926. The rose was awarded the Royal Horticultural Society's Award of Garden Merit in 1993.", "The Reverend Joseph Pemberton (1852-1926), Anglican clergyman and rose hybridizer is recognized for creating the Hybrid musk class of roses. He established the Pemberton Nursery at Romford, Essex after his retirement from the clergy in 1914. His primary focus in rose breeding was the development of modern roses similar to the old fashioned, musk scented roses that his grandmother grew in her garden. His rose breeding program was a great success, and at the time of his death, the Pemberton nursery had rose sales of 35,000 to 40,000 annually. In his will, Pemberton bequeathed the Pemberton rose fields to his two long time nursery gardeners, ", "Ann Bentall was a passionate and experienced gardener and rose breeder. She and John Bentall bred and sold roses commercially in the late 1920s and 1930s. The hybridization of 'Buff Beauty' has often been attributed to John Bentall or Joseph Pemberton, with  Ann credited only with the introduction of the rose in 1939, after her husband's death.  Ann Bental is currently recognized as the creator of 'Buff Beauty'. According to author Peter Schneider, \"Even though she (Ann) bred two of the five most widely grown roses in the world today ('The Fairy' and the pink-and-white hybrid musk 'Ballerina'), Ann Bentall has never been admitted into the pantheon of 'Great Hybridizers'."]}, {"page": "Pemberton, Joseph", "response": ["#redirectJoseph Pemberton"]}]}}