{"wiki_id": "http://www.wikidata.org/entity/Q6288795", "itemLabel": "Josh Davey", "itemDescription": "Scottish cricketer (born 1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/Josh_Davey", "wikipedia_page": {"main": "Joshua Henry Davey (born 3 August 1990) is a Scottish cricketer, who plays for Somerset County Cricket Club having previously played for Middlesex as well as representing his country in One Day Internationals (ODIs) and Twenty20 Internationals. He is a right-handed batsman and right-arm medium pace bowler. He was educated at Culford School in Suffolk.", "link_mentions": [{"page": "Somerset County Cricket Club", "response": ["2019 was to prove to be the year Somerset finally broke their 14-year trophy drought, as they claimed victory in the 2019 Royal London One-Day Cup, to end a run of 10 runners-up finishes across all formats over a 10-year span. The campaign began in brilliant style as Somerset secured their largest-ever List A margin of victory by beating Kent by 264 runs in their opening match. Victories in their next three games including a win against Essex in the first-ever game played under the new permanent floodlights at the County Ground, meant at the halfway stage in the competition, qualification to the knockout stages seemed assured. However, defeats in their next three including a resounding loss to Hampshire, who chased a target of 216 in the 32nd over, left Somerset needing a win in their final game just to make it into an away play-off game. They were able to defeat Surrey by 5 wickets, setting up a play-off game against Worcestershire at New Road. A century from Tom Banton, and a five-wicket haul from overseas player Azhar Ali saw Somerset to a comfortable win by 147 runs. In the semi-final, Somerset once again faced Nottinghamshire in a knockout game, at Trent Bridge. Somerset posted exactly the same score of 337 as they had in the play-off match, and the total once again proved to be more than enough, as Nottinghamshire were bowled out for 222, meaning Somerset reached the Lord's final where they would face defending champions Hampshire. Hampshire won the toss and chose to bat but Somerset, thanks mainly to the opening spell of Josh Davey and eventual man-of-the-match Jamie Overton in the middle overs, were able to take wickets at regular intervals, and despite a ninth-wicket stand of 64, Hampshire's total of 244/8 looked to be short of what would be required. This proved to be even more the case when Banton and Azhar Ali put on an opening partnership of 112, and despite losing both in quick succession, Somerset always looked in control. Fittingly the winning runs were scored by James Hildreth, who had also hit the winning runs as a 20-year-old in Somerset's last trophy win in 2005.", "|style=\"text-align:center\"|38|| Josh Davey*  ||  ||  || Right-handed || Right-arm fast-medium ||  "]}, {"page": "Scotland national cricket team", "response": ["| Josh Davey ||  || Right-handed || Right-arm medium-fast || T20I || 38 ||  2016 ||  2019 ||  2021", "* Best individual bowling figures: 6/28, Josh Davey v. Afghanistan, 14 January 2015 at Sheikh Zayed Cricket Stadium, Abu Dhabi", "|Josh Davey || 49 || 22.08 || 2010–2019", "|Josh Davey || 6/34 ||  || Abu Dhabi || 2015", "|Josh Davey || 5/9 ||  || Ayr || 2010", "|Josh Davey || 34 || 23.26 || 2012–2021"]}, {"page": "List of Scotland ODI cricketers", "response": ["Calum MacLeod made the highest score for Scotland on 23 January 2014 when he scored 175 against Canada. Josh Davey holds the records for the best bowling figures for Scotland in an ODI with 6/28 against Afghanistan on 14 January 2015. Kyle Coetzer is Scotland's leading run-scorer with 2,604 runs and Safyaan Sharif holds the record for most wickets in ODIs for Scotland with 68."]}, {"page": "Culford School", "response": ["*Josh Davey (Cricketer, Middlesex and Scotland, Badger)"]}, {"page": "Cambusdoon New Ground", "response": ["|scope=\"row\"| 1 || Josh Davey ||  ||  ||  ||  ||  ||  ||   ||  || Won"]}, {"page": "List of Somerset County Cricket Club players", "response": ["* Josh Davey (2015–2021) 41 matches CA"]}, {"page": "2010 ICC World Cricket League Division One", "response": ["Josh Davey*"]}, {"page": "List of Indian Premier League players", "response": ["|Josh Davey||||X||X||X||X||X||X||X||X||RPS||KKR"]}, {"page": "List of Somerset Twenty20 cricket records", "response": ["| 9th || 69 || Corey Anderson & Josh Davey || Surrey || The Oval || 2017", "|Josh Davey|| 36"]}, {"page": "Simon Watkins", "response": ["Proceeding to Oxford Brookes University, Watkins made his only first-class appearance for Oxford UCCE against Middlesex in 2010. In the University first-innings, Watkins scored an unbeaten 46. In their second-innings, he scored 8 runs before being dismissed by Josh Davey. With the ball, he bowled without success, sending down 17 wicket-less overs."]}, {"page": "Tri-nation series in Scotland in 2011", "response": ["| Trent Johnston || Dilhara Fernando || Josh Davey"]}]}}