{"wiki_id": "http://www.wikidata.org/entity/Q6286974", "itemLabel": "Joseph Shield Nicholson", "itemDescription": "British economist", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Shield_Nicholson", "wikipedia_page": {"main": "Joseph Shield Nicholson, FBA, FRSE (9 November 1850 – 12 May 1927) was an English economist.", "link_mentions": [{"page": "Adam Smith", "response": ["Smith's most prominent disciple in 19th-century Britain, peace advocate Richard Cobden, preferred the first proposal. Cobden would lead the Anti-Corn Law League in overturning the Corn Laws in 1846, shifting Britain to a policy of free trade and empire \"on the cheap\" for decades to come. This hands-off approach toward the British Empire would become known as Cobdenism or the Manchester School.Anthony Howe, Free trade and liberal England, 1846–1946 (Oxford, 1997) By the turn of the century, however, advocates of Smith's second proposal such as Joseph Shield Nicholson would become ever more vocal in opposing Cobdenism, calling instead for imperial federation.J. Shield Nicholson, A project of empire: a critical study of the economics of imperialism, with special reference to the ideas of Adam Smith (London, 1909) As Marc-William Palen notes: \"On the one hand, Adam Smith’s late nineteenth and early twentieth-century Cobdenite adherents used his theories to argue for gradual imperial devolution and empire 'on the cheap'. On the other, various proponents of imperial federation throughout the British World sought to use Smith's theories to overturn the predominant Cobdenite hands-off imperial approach and instead, with a firm grip, bring the empire closer than ever before.\"Marc-William Palen, “Adam Smith as Advocate of Empire, c. 1870–1932,”  Historical Journal 57: 1 (March 2014): 179–98. Smith's ideas thus played an important part in subsequent debates over the British Empire."]}, {"page": "Representative money", "response": ["In 1895 economist Joseph Shield Nicholson wrote that credit expansion and contraction was in fact the expansion and contraction of representative money.Joseph Shield Nicholson, A treatise on money and essays on monetary problems], Chapter VI, Effects of Credit or \"Representative Money\" on prices,  pp. 72–74, A. and C. Black, 1895."]}, {"page": "Dean Cemetery", "response": ["* Joseph Shield Nicholson (1850–1927) economist"]}, {"page": "1920 in literature", "response": ["*Joseph Shield Nicholson – The Revival of Marxism, final book"]}, {"page": "Bimetallism", "response": ["* Joseph Shield Nicholson, Money and Monetary Problems (London, 1897)"]}, {"page": "Nicholson (name)", "response": ["* Joseph Shield Nicholson (1850–1927), English economist"]}]}}