{"wiki_id": "http://www.wikidata.org/entity/Q6289116", "itemLabel": "Josh Low", "itemDescription": "British footballer (born 1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Josh_Low", "wikipedia_page": {"main": "Joshua David Low (born 15 February 1979) is a retired professional footballer who has represented the Wales national under-21 football team. He last played for Bath City.\nAfter spells at Bristol Rovers, Farnborough Town and Leyton Orient he made his name at Cardiff City, before being transferred to Oldham Athletic, where he spent one season before becoming Northampton Town's record signing, costing the club £165,000 in July 2003.\nLow became a popular figure amongst the Northampton fans, who gave him the nickname J-Lo. Predominantly a right winger, he can also play in defence or central midfield. He scored 5 goals in 29 League Two appearances in the 2005/06 season.\nIn the summer of 2006, Low was signed by Leicester City manager Rob Kelly, after his contract expired at Northampton.\nLow made his debut for the Leicester City first team as a substitute in the 1–0 home defeat to Burnley.\nAfter struggling to adapt to Championship level football, Low was sold to Peterborough United for a fee that could have risen to £100,000, but was released at the end of the 2007–08 season\nHowever, after Cheltenham Town came calling, he quickly moved on, signing a two-year deal with the Robins. After failing to make an impact at his new club, on 23 September, Low was one of six squad members placed on the transfer list by manager Martin Allen.\nIn November 2008 Low signed on a months loan with Conference National side Forest Green Rovers. He scored in Forest Green's FA Cup second round giant killing of Football League side Rochdale on 29 November 2008. After a month at Forest Green, Low returned to first team action at Cheltenham, eventually featuring in more than 100 games for the club.\nIn May 2012, Low was released by Cheltenham after the expiry of his contract. He joined part-time Bath City in June 2012 so he could balance playing football with his work in law.\nIn June 2014, he announced his retirement from football to focus on his professional career outside football.", "link_mentions": [{"page": "Northampton Town F.C.", "response": ["* 2006  Josh Low (League Two)"]}, {"page": "Shaun Newton", "response": ["Newton joined Leicester City on loan in March 2007 until the end of the 2006–07 season. He scored his first goal for Leicester against Birmingham on 17 April 2007. He was given the number 16 shirt, the third player to wear the number that season after Josh Low and Luigi Glombard. He signed a permanent one-year deal with the Championship club on 6 July 2007 after the appointment of Martin Allen. However his time at the club came to an end in January 2008, with Leicester now onto their third manager of the season in Ian Holloway, when his contract was terminated by mutual consent. He retired later that year, after spell on trial at Yeovil Town in April."]}, {"page": "1979 in Wales", "response": ["*15 February – Josh Low, footballer"]}, {"page": "2007–08 Peterborough United F.C. season", "response": ["|Josh Low", "|24 July||Stevenage Borough||Away||D 1–1 || align=\"right\" | 1,500 ||Josh Low", "|11 August||Rochdale||Home||3–0 ||2nd ||5,575 ||Josh Low, Aaron McLean, Danny Crow", "|8 September||Mansfield Town||Home||2–1 ||4th || 4,721||Josh Low, Danny Crow"]}, {"page": "Jack Durrant", "response": ["Durrant started his career as a youth player in Cheltenham Town's under-16 team, before signing a scholarship in 2007 with the club. In November 2008, he was loaned out to Southern Football League Premier Division team Mangotsfield United for one-month. He made his first team debut in the FA Cup third round replay away against Doncaster Rovers, on 20 January 2009. Durrant replaced Dave Bird as a substitute in the 77th minute in the 3–0 defeat. He made his Football League debut in a League One match against Leicester City in the 4–0 away defeat on 7 March, replacing Josh Low as a substitute in the 72nd minute. He was released by the club along with seven other players in May 2010."]}, {"page": "List of Northampton Town F.C. records and statistics", "response": ["£165,000 to Oldham Athletic for Josh Low in 2003"]}, {"page": "2010–11 Cheltenham Town F.C. season", "response": ["|align=\"left\"| Josh Low", "|align=\"center\"| Norwegian Robins' Player of the Season ||align=\"center\"| Josh Low"]}, {"page": "2011–12 Cheltenham Town F.C. season", "response": ["|MF || ||8 ||Josh Low || 3 || 0 || 0 || 0 || 3"]}]}}