{"wiki_id": "http://www.wikidata.org/entity/Q6284424", "itemLabel": "Joseph Johnson", "itemDescription": "British watchmaker", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Johnson_(watch_maker)", "wikipedia_page": {"main": "Joseph Johnson of Liverpool, England, was a highly respected and successful British master clock, watch and chronometer maker.\nHe was a nonconformist who was married to Mary Bryers and who worked in Liverpool from 1795 to about 1827. The earliest specific date (from the hallmark in the silver case) known for a watch of his is 1811. He is known to have worked from a factory at 25 Church Street, although census records indicate that his residence was elsewhere in the same street (No. 26 and later (1841 census) No. 49); only No. 25 is named on the movements of his watches. After his death, on 2 March 1827, his wife Mary, son Joseph Johnson and grandsons Joseph Johnson Cashen and Joseph Johnson Norris continued his work until at least 1857.\nHis watches are of high quality and were usually provided with precious metal cases, often in gold; these have often been lost in the course of time, so that many Johnson watches now survive only as uncased movements. Joseph Johnson had a preference for using fully jewelled watch movements. He is credited with inventing several design improvements to the pocket watch and watch movement. His watches were commonly used on U.S. railroads, before the establishment of the U.S. watch industry. In 1816 the United States government chose a chronometer signed by Johnson, No. 508, for a presentation to Commodore Oliver H. Perry in recognition of his action against the British on Lake Erie.", "link_mentions": [{"page": "Joseph Johnson", "response": ["Joseph Johnson may refer to:", "*N.O. Joe (Joseph Johnson, born 1975), American musician, producer and songwriter", "*Joseph Johnson (South Carolina mayor) (1776–1862), mayor of Charleston, South Carolina, United States", "*Joseph Johnson (Virginia politician) (1785–1877), U.S. Representative and Governor of Virginia", "*Joseph Johnson (FDNY Commissioner) (1871–1941), American fire department commissioner", "*Joseph Johnson (cricketer) (1916–2011), English cricketer", "*Joseph Johnson (field hockey) (born 1945), Malaysian Olympic hockey player", "*Joseph Johnson (footballer, born 1903), English footballer for Scunthorpe and Bradford City", "*Joseph Johnson (footballer, born in Felling) (fl. 1914–1921), English footballer for Sunderland", "*Joseph Johnson (figure skater) (born 1994), American ice dancer", "*Charles Leroux (Joseph Johnson, 1856–1889), American balloonist and parachutist", "*Joseph Johnson (publisher) (1738–1809), London bookseller", "*Joseph Johnson (watch maker) (1780–1851), watchmaker from Liverpool", "*Joseph Johnson (murderer) (died 1964), American murderer executed by the state of Texas", "*Joseph Johnson (chef) (born 1984), American chef", "*Joseph Johnson III (1940–2017), American physicist"]}, {"page": "Joseph Johnson (Watch Maker)", "response": ["#REDIRECT Joseph Johnson (watch maker) "]}, {"page": "List of clock manufacturers", "response": ["*Joseph Johnson; Liverpool (1795–1827)"]}]}}