{"wiki_id": "http://www.wikidata.org/entity/Q6287464", "itemLabel": "Joseph Toole", "itemDescription": "British politician (1887-1945)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Toole_(British_politician)", "wikipedia_page": {"main": "Joseph (Joe) Toole (1887 – 4 June 1945) was a British Labour politician.\nToole was born in 1887, and was the eldest of thirteen children. He began working at the age of 12 as a street scavenger in Manchester by day and as a newspaper vendor by night. He subsequently had various jobs, before establishing his own stationery business. He joined the Labour, and was elected to Manchester City Council in 1919.In 1923 he was elected as Labour Member of Parliament for Salford South, unseating the sitting Conservative MP. In the following year another election was held, with the Conservatives regaining the seat. At the following election in 1929 Toole was able to regain Salford South for Labour. He was MP for two years before a swing against Labour at the 1931 general election cost him his seat. He stood again, without success, in 1935.Toole returned to local government as an alderman for the Openshaw ward of Manchester City Council. He was Lord Mayor of the city in 1936/37.In January 1944 Toole stood as an independent anti-government candidate at a parliamentary by-election in Skipton. Although he only garnered 3,029 votes and lost his deposit, his intervention was enough to enable Hugh Lawson of the Common Wealth Party to defeat the coalition candidate by 221 votes. Toole was promptly expelled from the Labour for breaking the war-time electoral truce between the main political parties.By the time of his death in June 1945, Toole had moved to Blackpool, where he operated a private hotel. He continued to be a member of Manchester City Council until his death.", "link_mentions": [{"page": "HMS Manchester (15)", "response": ["Manchester, the first ship of her name to serve in the Royal Navy,Colledge, p. 214 was ordered on 23 October 1935 from Hawthorn Leslie and Company. The ship was laid down at their Hebburn shipyard on 28 March 1936 and was launched on 12 April 1937 by the wife of Joseph Toole, the Lord Mayor of Manchester. She was commissioned on 4 August 1938 and departed for her first duty assignment with the 4th Cruiser Squadron in the East Indies on 24 September.McCart, pp. 178–179; Osborne, p. 7"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Joseph Toole, Salford South, 1923–24; 29–31"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|Joseph Toole"]}, {"page": "List of MPs elected in the 1923 United Kingdom general election", "response": ["|Joseph Toole"]}, {"page": "Salford South (UK Parliament constituency)", "response": ["| Joseph Toole", "| Joseph Toole"]}, {"page": "List of mayors of Manchester", "response": ["|align=center|38 ||Joseph Toole ||align=center|1936 ||align=center|1937 ||align=center|1 ||"]}, {"page": "1944 Skipton by-election", "response": ["*There was much irritation with the electoral truce within local Labour Party ranks. To this end, 57-year-old Mancunian Alderman Joseph Toole a former Labour MP for Salford South announced his candidature. He was a former Lord Mayor of Manchester from 1936 to 1937. He stood as an Independent Labour candidate. He was promptly expelled from the Labour Party for breaking the war-time electoral truce."]}]}}