{"wiki_id": "http://www.wikidata.org/entity/Q628046", "itemLabel": "Tanya Tate", "itemDescription": "British pornographic actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Tanya_Tate", "wikipedia_page": {"main": "Tanya Tate (born 31 March 1979) is an English glamour model, writer, international cosplayer, and pornographic actress.", "link_mentions": [{"page": "Television X", "response": ["On 11 March 2010, Television X launched their own awards called the SHAFTAs (Soft and Hard Adult Film and Television Awards). Winners included Kerry Louise and Tanya Tate. Both Angel Long and Syren Sexton picked up 2 awards each.", "On 3 December 2010, Television X won two awards from UK Adult Producers (UKAP). Tanya Tate collected the award on behalf of Television X for Tanya Tate's Sex Tour of Ireland which won Best Reality Series. She also starred in the Television X series Diamond Geezers, which won Best DVD."]}, {"page": "Club International", "response": ["The magazine has featured a number of well-known models and pornstars, such as Lexi Lowe, Tanya Tate, Monica Sweet, Zsanett Égerházi, Sandra Shine, Peaches, Silvia Saint, Stephanie Swift, and popular Hungarian model Sophie Moone (often credited as 'Stella'). Also among the women featured is the \"Reader's Girlfriend\", presented as an amateur model who is the girlfriend of a Club International reader."]}, {"page": "List of people from Merseyside", "response": ["* Tanya Tate: Award-winning adult film star."]}, {"page": "AVN Awards", "response": ["In 2013, actress Tanya Tate offered some insights into the industry in an interview with the Huffington Post about the 30th AVN Awards at which she was nominated for an award. She stated: \"If you are more popular with the fans, companies are more likely to book you for their production\", \"Being nominated for awards help build your recognition with your fan base. People that win male and female performer of the year are generally solid consistent talent that are open to many 'levels', and some of these performers already have higher basic rates than others\"."]}, {"page": "Tate (surname)", "response": ["*Tanya Tate (born 1979), English model"]}, {"page": "Tanya (name)", "response": ["* Tanya Tate, a US-UK porno actress "]}, {"page": "Deborah Anderson", "response": ["Anderson's first feature documentary film Aroused featured interviews with 16 female pornographic performers, and was released in cinemas in the U.S. in the summer of 2013 and internationally in January 2014. Sixteen actresses were involved: Jesse Jane, Belladonna, Katsuni, Allie Haze, Kayden Kross, April O'Neil, Francesca Lé, Lisa Ann, Brooklyn Lee, Alexis Texas, Asphyxia Noir, Teagan Presley, Ash Hollywood, Tanya Tate, Lexi Belle and Misty Stone. Aroused accompanied a photography book of the same name. The New York Times compared the film's cinematic style to an advertisement for Victoria's Secret, and wrote it would have been better as a television series similar to a combination of Taxicab Confessions and Red Shoe Diaries. Anderson was inspired to work on Aroused, after previously photographing an adult industry actress for a magazine shoot. She wanted to draw attention to a double standard in society regarding consumption of pornography while simultaneously stigmatizing the actresses that perform in the adult industry.<Ref name=kpcc></ref> She stated her attempt was to humanize and provide dignity to the actresses. Anderson cast the actresses in the film in order to showcase, \"the most successful women in the adult film industry\". Aroused was compared by the Chicago Tribune to the documentary After Porn Ends with a more optimistic feel to it. Screen Daily and BroadwayWorld commented favorably on the vulnerability of the subjects. Film critics compared the documentary's style to Michael Moore, Annie Leibovitz and the film Naked Ambition: An R Rated Look at an X Rated Industry.<Ref name=metropolis></ref> A review of the film in the Los Angeles Times was critical, writing that it was only recommended for fans of Alexis Texas, Katsuni and Misty Stone. The Village Voice found the subject more appropriate for a photography book. The Hollywood Reporter and The Washington Post criticized Aroused for its lack of depth.  The New York Daily News criticized Anderson for self-promotion. In 2015, Anderson was one of the first clients for a new photographers' agency launched by Rihanna called The Dog Ate My Homework."]}, {"page": "List of British pornographic actors", "response": ["| Tanya Tate"]}, {"page": "XBIZ Award", "response": ["* 2013: Tanya Tate"]}, {"page": "MILF pornography", "response": ["| Tanya Tate"]}, {"page": "Rik Offenberger", "response": ["In April, 2010, Offenberger, Phil Latter and Ric Croxton founded First Comics News, a web-based division of Super Hero News, covering comics, gaming, wrestling and related pop-culture topics. The name is derived from one of the early independent comics publishers of the 1980s, First Comics. The site logo was also fashioned after the publisher's imprint trademark. The site carries comics news, publisher solicitations, opinion columns, interviews, podcasts and reviews. Contributors include Beau Smith, Bob Almond, Holly Golightly, Ian Flynn, Michael Netzer, Mark Heike and cosplay actress Tanya Tate. The site maintains offices in Canada and Europe."]}, {"page": "Seasoned Players", "response": ["*Seasoned Players Meets Asseaters Unanimous (2009): Adriana Deville, Gina Rome, Hunter Bryce, Raylene, Tanya Tate, Christian XXX, Sean Michaels & Tom Byron"]}, {"page": "The Naughty Show", "response": ["| 122 || MILF Contest & FILF Lapdance || Bryan Callen, Owen Benjamin, Tanya Tate, Cherry Ferretti, Sasha Heart, Natasha & Natalia Starr || May 6, 2013"]}, {"page": "LGBT culture in Liverpool", "response": ["*Tanya Tate (Glamour model, writer, international cosplayer and pornographic actress)"]}, {"page": "Measure B", "response": ["Opponents include porn performers Kayden Kross, Ava Addams, Ron Jeremy, Tera Patrick and Tanya Tate."]}, {"page": "Exxxotica Expo", "response": [" |align=\"center\"|Tanya Tate"]}, {"page": "29th AVN Awards", "response": ["** Tanya Tate (TanyaTate.com)"]}, {"page": "SHAFTA Awards (adult video)", "response": ["The first SHAFTA ceremony was held in 2010 and it was organised by Television X. The 2011 SHAFTAs were held in London on 9 March at the For Your Eyes Only club. Celebrities attending the event included Billi Bhatti, Dane Bowers and Tim Westwood. The 2012 SHAFTAs were held on 15 March at Platinum Lace, which is a strip club on Coventry Street in London. The event was hosted by Tanya Tate, who won the MILF of the Year award for the third year in a row. A minor controversy was caused when transsexual star Holly Harlow was nominated for Best New Starlet, but Television X defended the choice stating that \"the term starlet fits her perfectly, she is feminine, sexy and a great performer\". Award presenters included Danny Dyer, Lethal Bizzle and Terry Coldwell from East 17. ICM Registry co-sponsored the event along with Television X, and the event was streamed live on the awards' official website. Ben Dover was presented with an honorary award, entitled The Palm Phwoar for \"endeavours in adult entertainment\" over his 33 years in the industry. The 2013 SHAFTAs were held on 5 December at the Rise Superclub in Leicester Square. The 2016 SHAFTAs were held at The Rah Rah Room on London's Piccadilly and hosted by Benedict Garrett. The 1920s themed event was attended by the UK press, porn industry and celebrity guests including Big Brother housemate Marco Pierre White Jr and Geordie Shore's Marty McKenna and David Hawley.", "| align=\"center\" |Tanya Tate", "| align=\"center\" |Tanya Tate", "| align=\"center\" |Tanya Tate", "| align=\"center\" |Tanya Tate", "| align=\"center\" |Tanya Tate's Sex Tour of Ireland", "| align=\"center\" |Tanya Tate's Sex Tour of Ireland", "| align=\"center\" |Tanya Tate's Sex Tour of Scotland"]}, {"page": "Aroused (film)", "response": ["* Tanya Tate", "Anderson selected her interview subjects in an attempt to feature, \"the most successful women in the adult film industry\".<Ref name=cleveland></ref> She interviewed 16 actresses from the adult film industry about their experiences and backgrounds.<Ref name=washpost/><Ref name=vvo/> Anderson selected female adult film stars including: Lisa Ann, Belladonna, Lexi Belle, Allie Haze, Ash Hollywood, Jesse Jane, Katsuni, Kayden Kross, Francesca Lé, Brooklyn Lee, Asphyxia Noir, April O'Neil, Teagan Presley, Misty Stone, Tanya Tate, and Alexis Texas. Anderson additionally interviewed talent agent within the adult film industry, Fran Amidor, for her perspective on female stars within the genre. Ages of the cast members selected by Anderson were from 22 through 41 years. "]}]}}