{"wiki_id": "http://www.wikidata.org/entity/Q6287238", "itemLabel": "Joseph Sturge", "itemDescription": "English Quaker, abolitionist and activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Sturge", "wikipedia_page": {"main": "Joseph Sturge (1793 – 14 May 1859) was an English Quaker, abolitionist and activist.  He founded the British and Foreign Anti-Slavery Society (now Anti-Slavery International).  He worked throughout his life in Radical political actions supporting pacifism, working-class rights, and the universal emancipation of slaves.  In the late 1830s, he published two books about the apprenticeship system in Jamaica, which helped persuade the British Parliament to adopt an earlier full emancipation date.  In Jamaica, Sturge also helped found Free Villages with the Baptists, to provide living quarters for freed slaves; one was named \"Sturge Town\" in his memory.\n\n", "link_mentions": [{"page": "Montserrat", "response": ["In 1857, the British philanthropist Joseph Sturge bought a sugar estate to prove it was economically viable to employ paid labour rather than slaves. Numerous members of the Sturge family bought additional land. In 1869, the family established the Montserrat Company Limited and planted Key lime trees, started the commercial production of lime juice, set up a school, and sold parcels of land to the inhabitants of the island. Much of Montserrat came to be owned by smallholders."]}, {"page": "Slavery", "response": ["In 1839, the world's oldest international human rights organization, Anti-Slavery International, was formed in Britain by Joseph Sturge, which campaigned to outlaw slavery in other countries. There were celebrations in 2007 to commemorate the 200th anniversary of the abolition of the slave trade in the United Kingdom through the work of the British Anti-Slavery Society."]}, {"page": "Abolitionism", "response": ["In 1839, the British and Foreign Anti-Slavery Society was formed by Joseph Sturge, which attempted to outlaw slavery worldwide and also to pressure the government to help enforce the suppression of the slave trade by declaring slave traders to be pirates. The world's oldest international human rights organization, it continues today as Anti-Slavery International.Anti-Slavery International UNESCO. Retrieved 11 October 2011. Thomas Clarkson was the key speaker at the World Anti-Slavery Convention it held in London in 1840."]}, {"page": "Coolie", "response": ["The first campaign against the 'coolie' trade in England likened the system of indentured labour to the slavery of the past. The campaign against coolie emigration was led by Joseph Sturge, with the Society of Friends. Petitions from Sturge, the Society of Friends, various other humanitarian groups, and from citizens of entire cities were routinely sent to the Colonial Offices. In response to this pressure, the labour export was temporarily stopped in 1839 by the authorities when the scale of the abuses became known, but it was soon renewed due to its growing economic importance. A more rigorous regulatory framework was put into place and severe penalties were imposed for infractions in 1842. In that year, almost 35,000 people were shipped to Mauritius."]}, {"page": "Richard Cobden", "response": ["In his opposition to the Opium Wars, Cobden argued that just as \"in the slave trade we [the British] had surpassed in guilt the world, so in foreign wars we have the most aggressive, quarelsome, warlike and bloody nation under the sun.\" In October 1850 he wrote a letter to Joseph Sturge, claiming that in the last twenty five years \"you will find that we have been incomparably the most sanguinary nation on earth... in China, in Burma, in India, New Zealand, the Cape, Syria, Spain, Portugal, Greece, etc, there is hardly a country, however remote, in which we have not been waging war or dictating our terms at the point of a bayonet.\" Cobden believed that the British, \"the greatest blood-shedders of all\", had been then involved in more wars than the rest of Europe put together. In this, Cobden blamed the British aristocracy, which he claimed had \"converted the combativeness of the English race to its own ends\".J.A. Hobson, Richard Cobden: The International Man, London 1919 p. 90; S. Hobhouse, Joseph Sturge, pp. 119–120"]}, {"page": "History of Philadelphia", "response": ["Violence was a serious problem. Gangs like the Moyamensing Killers and the Blood Tubs controlled various neighborhoods. During the 1840s and early 1850s when volunteer fire companies, some of which were infiltrated by gangs, responded to a fire, fights with other fire companies often broke out. The lawlessness among fire companies virtually ended in 1853 and 1854 when the city took more control over their operations. During the 1840s and 50s violence was directed against immigrants by people who feared their competition for jobs and resented newcomers of different religions and ethnicity. Nativists often held mostly anti-Catholic, anti-Irish meetings. Violence against immigrants also occurred, the worst being the nativist riots in 1844. Violence against African Americans was also common during the 1830s, 40s, and 50s. Immigrants competed with them for jobs, and deadly race riots resulted in the burning of African-American homes and churches. In 1841, Joseph Sturge commented \"...there is probably no city in the known world where dislike, amounting to the hatred of the coloured population, prevails more than in the city of brotherly love!\" Several anti-slavery societies had been formed and free blacks, Quakers and other abolitionists operated safe houses associated with the Underground Railroad, but working class and ethnic whites opposed the abolitionist movement. "]}, {"page": "Anti-Slavery International", "response": ["With abolition of slavery throughout the British dominions achieved, British abolitionists in the Agency Committee of the Anti-Slavery Society considered that a successor organisation was needed to tackle slavery worldwide. Largely under the guidance of English activist Joseph Sturge, the committee duly formed a new society, British and Foreign Anti-Slavery Society on 17 April 1839,About Anti-Slavery International  antislavery.orgPatricia Hollis (1974). Pressure from without in early Victorian England. p.39.  which worked to outlaw slavery in other countries. It became widely known as the Anti-Slavery Society, as had the earlier society."]}, {"page": "Edgbaston", "response": ["* Joseph Sturge lived at Wheeleys Road (house now demolished)."]}, {"page": "Sparkhill", "response": ["Development of the area began in the 1890s as a result of the Industrial Revolution which was causing Birmingham to expand. In the 1850s, a small area of land was bought by a building society and sold to separate developers who built houses for the working class. People who owned a property were entitled to vote and a campaigner for the working class vote was Joseph Sturge, a Birmingham manufacturer. As a result of his campaigning, a newly created street in the area was named after him. The architecture of the houses was varied due to the different developers. A centre began to develop for the area with its own pub, The Cherry Arbour."]}, {"page": "Emancipation of the British West Indies", "response": ["A Narrative of Events, since the First of August, 1834, by James Williams, an Apprenticed Labourer in Jamaica is one of the few first person accounts by a former slave. It was published in a pamphlet in 1837 and was sold, reprinted and circulated across Britain and Jamaica. The narrative played a critical role in the anti-apprenticeship campaign launched by Joseph Sturge and other members of Britain's Central Emancipation Committee. The abolitionists were steadfast in their belief that apprenticeship was merely an continuation of slavery.Huzzey, Freedom Burning (2012), 11. In 1836, Sturge traveled to Jamaica to gather first hand information about the labour system. While there, he and other anti-apprenticeship activists met James Williams, an apprentice from St. Ann's Parish that worked on the Penshurst Plantation for the Senior family, who shared his experience with the abolitionists. Sturge organized to have his narrative recorded by an amanuensis and published it in hopes of informing the British public about Caribbean labour conditions and gaining widespread support for immediate abolition.Diana Patton, \"Introduction\", in A Narrative of Events Since the First of August, 1834, by James Williams, an Apprenticed Labourer in Jamaica (Durham, NC: Duke University Press, 2001), xix.", "Narrative of Events was popular, widely circulated and positively received by the British public. However, it also produced a considerable backlash in the West Indies. The Jamaica Despatch, a pro-planter Jamaican newspaper, criticized James Williams and Joseph Sturge and insisted that the narrative was propaganda and its claims unfounded. In response, anti-apprenticeship proponents published select apprentice interviews in the local newspapers to bolster Williams' claims. Historian of the Caribbean Diana Patton has suggested that the extent of planter resistance indicates the political efficacy of the narrative.Patton, \"Introduction\", A Narrative of Events (2001), xxxvii–xxxviii."]}, {"page": "Henry Richard", "response": ["* Memoirs of Joseph Sturge (1864) in memory of the abolitionist and founder of the mid-nineteenth century Anti-Slavery Society, the Society for Effecting the Abolition of the Slave Trade;"]}, {"page": "William Allen (Quaker)", "response": [": The cruelty and oppression of the planters of Jamaica, as exercised on those poor sufferers, whose redemption from slavery we have paid twenty millions, has been exposed in the face of day. The West Indies in 1837, the result of personal investigation by our friend Joseph Sturge, has created a great sensation... The Anti Slavery Associations in all quarters are in a high degree of excitement, and petitions are loading the tables of both Houses of Parliament, begging for the abolition of the apprenticeship clause, and the complete establishment of freedom...on the 1st of Eight Month, 1838."]}, {"page": "Olveston", "response": ["Joseph Sturge (1793–1859), born in nearby Elberton, was a member of the Quaker Meeting.  He purchased a plantation in Montserrat to demonstrate that slavery was unnecessary, and named it Olveston,Olveston and Aust website  now a village on the island."]}, {"page": "Elihu Burritt", "response": ["In the summer of 1846, the disillusioned Burritt left the cautious Beckwith, and went to England. He stayed initially with Joseph Sturge. Setting off in July on a walking tour, he went to Worcester, the namesake town, to speak. He travelled widely around a new home in Harborne, then a rural village, largely on foot. He was sympathetic to the industrial and political culture of Birmingham, and became a friend of many of its leading citizens, so that what he wrote about it was largely positive. During his time in Birmingham he lived in a house which he named New Britain Villas. It was later home to Edward Chitham, who also wrote a book on the Black Country.E. Chitham, The Black Country Amberley Publishing,  Burritt was actively involved the local community, taking part in the committee for the rebuilding of St. Peter's Church, Harborne."]}, {"page": "Science and invention in Birmingham", "response": ["1857: Joseph Sturge buys the Elberton Sugar Estate and converts it into a lime production plant. The Montserrat Co. Ltd. is formed in Edgbaston by J.& E. Sturge. Lime juice is produced in the city and then exported for use in the manufacture of citric acid. The failure of Sicily's lemon crop at this time results in an opening in the market, which Sturge takes great advantage of utilizing their extensive chemical works based in Edgbaston. He also tries to prove that Free labour can be made profitable (the Sturge family are instrumental in the anti-slavery movement). A company is set up by the Sturge and Albright families who fund the development of Montserrat estates in 1867."]}, {"page": "Elberton, Gloucestershire", "response": ["Later generations of the Sturge family included the leading abolitionists Joseph Sturge (1793-1859) and Sophia Sturge (1795-1845) who were both born in the village. Joseph Sturge purchased a sugar plantation in Montserrat and renamed it Elberton, hoping to demonstrate the commercial viability of a plantation built on free waged-labour, as opposed to slave labour.There is contradiction between sources on whether the plantation was purchased in 1837 or 1857."]}, {"page": "Slavery Abolition Act 1833", "response": ["In 1823, the Anti-Slavery Society was founded in London. Members included Joseph Sturge, Thomas Clarkson, William Wilberforce, Henry Brougham, Thomas Fowell Buxton, Elizabeth Heyrick, Mary Lloyd, Jane Smeal, Elizabeth Pease, and Anne Knight.Slavery and abolition. Oxford University Press Jamaican mixed-race campaigners such as Louis Celeste Lecesne and Richard Hill were also members of the Anti-Slavery Society."]}, {"page": "Food and drink in Birmingham", "response": ["The Montserrat Co. Ltd. was formed in Edgbaston by J.& E. Sturge. Lime juice was produced in the city and then exported for use in the manufacture of citric acid. The failure of Sicily's lemon crop at that time resulted in an opening in the market which Sturge took great advantage of, utilizing their extensive chemical works based in Edgbaston. The company was set up by the Sturge and Albright families who funded the development of Montserrat estates in 1867. Joseph Sturge bought the Elberton Sugar Estate in 1857 and converted it into a lime production plant. He also wanted to prove that free labour could be made profitable. Members of the Sturge family were instrumental in the British anti-slavery movement."]}, {"page": "Anti-Slavery Society (1823–1838)", "response": ["A successor organisation, the British and Foreign Anti-Slavery Society, also commonly known as the Anti-Slavery Society, was formed in 1839 by English Quaker and activist Joseph Sturge to fight for global abolition of slavery. Through mergers and name changes, it is now known as Anti-Slavery International.", "The latter group, including Joseph Sturge and many others, publicly campaigned throughout Britain. The idea was to engender public pressure for a new parliamentary act to outlaw slavery, rather than continue the gradualism of Whitehall's negotiations, mainly with colonial governments. In 1831 George Stephen and Joseph Sturge formed a ginger group within the Anti-Slavery Society, the Agency Committee, to campaign for this new act of Parliament. This campaign, and public pressure, led to the Slavery Abolition Act of 1833, though it contained compromises which they disliked.", "With abolition of slavery throughout the British dominions achieved, British abolitionists in the Agency Committee of the Anti-Slavery Society considered that a successor organisation was needed to tackle slavery worldwide. Largely under the guidance of Joseph Sturge, the committee duly formed a new society, British and Foreign Anti-Slavery Society on 17 April 1839.About Anti-Slavery International  antislavery.orgPatricia Hollis (1974). Pressure from without in early Victorian England. p.39. It too became widely known as the Anti-Slavery Society."]}, {"page": "John Greenleaf Whittier House", "response": ["The Whittier family made significant modifications to the house during their 80 years of ownership. Whittier added a bedroom to the southeast corner of the house not long after buying it. In 1847, with the financial assistance of Quaker philanthropist Joseph Sturge, the house was significantly enlarged. The new bedroom was enlarged and converted into a sitting room and study, a porch was added to the east side of the house, and a full second story was added over the eastern half of the house."]}, {"page": "International Peace Congress", "response": ["The first International Congress was held in London at the suggestion of Joseph Sturge and on the initiative of the American Peace Society in 1843. The host was the London Peace Society. 294 British, 37 American and six Continental delegates attended."]}, {"page": "Alfred Sturge", "response": ["He came from a family among the Society of Friends from the days of George Fox. His grandfather, Thomas Sturge, was one of the founders of the British and Foreign Bible Society. George Sturge, one of his uncles, left £500,000 to charity, and another uncle, Thomas Sturge, was an intimate friend of Lord Macaulay. Both were active in the movement for the abolition of slavery, as was his relative Joseph Sturge. On his mother’s side, he was descended from a noble French family, and Count Emerie de St. Dalmas was his maternal grandfather, whose eldest son converted to the Protestant Christian faith, and was consequently prevented by the law of those times from inheriting his father’s title and estates.Memoirs of Ministers - No 38 Alfred Sturge, pages 212-214 in The Baptist Hand-Book for 1902, edited by Rev. W.J. Avery, Council of the Baptist Union of Great Britain and Ireland, London 1901.Adam Clarke Portrayed by James Everett, Hamilton, Adams and Co, London 1843. - See p.223 which reads:"]}, {"page": "Peace Society", "response": ["*Joseph Sturge - Quaker abolitionist; founded the Birmingham Auxiliary"]}, {"page": "Henry Hetherington", "response": ["He did not, however, abandon his belief in the Charter. He had joined Lovett in an alliance with Joseph Sturge's Complete Suffrage Movement in 1842,Wiener, Oxford Dictionary of National Biography. and in 1848 he co-founded the moral-force People's Charter Union.National Archives,"]}, {"page": "Morning Star (London newspaper)", "response": ["The Morning Star was a radical pro-peace London daily newspaper started by Richard Cobden and John Bright in March 1856. It had substantial support from Joseph Sturge. "]}, {"page": "History of slavery", "response": ["Somersett's case in 1772 was generally taken at the time to have decided that the condition of slavery did not exist under English law in England. In 1785, English poet William Cowper wrote: \"We have no slaves at home – Then why abroad? Slaves cannot breathe in England; if their lungs receive our air, that moment they are free. They touch our country, and their shackles fall. That's noble, and bespeaks a nation proud. And jealous of the blessing. Spread it then, And let it circulate through every vein.\"Rhodes, Nick (2003). William Cowper: Selected Poems. p. 84. Routledge, 2003 However, slavery continued to thrive in England itself, much like it did in the British Empire, until full emancipation in the 1830s.Simon Schama, Rough Crossings (London: BBC Books, 2005), p. 61. In 1807, following many years of lobbying by the abolitionist movement, led primarily by William Wilberforce, the British Parliament voted to make the slave trade illegal anywhere in the Empire with the Slave Trade Act 1807. Thereafter Britain took a prominent role in combating the trade, and slavery itself was abolished in the British Empire (except for India) with the Slavery Abolition Act 1833. Between 1808 and 1860, the West Africa Squadron seized approximately 1,600 slave ships and freed 150,000 Africans who were aboard.Sailing against slavery. By Jo Loosemore BBC Action was also taken against African leaders who refused to agree to British treaties to outlaw the trade. Akitoye, the 11th Oba of Lagos, is famous for having used British involvement to regain his rule in return for suppressing slavery among the Yoruba people of Lagos in 1851. Anti-slavery treaties were signed with over 50 African rulers. In 1839, the world's oldest international human rights organization, British and Foreign Anti-Slavery Society (now Anti-Slavery International), was formed in Britain as by Joseph Sturge, which worked to outlaw slavery in other countries.Anti-Slavery International UNESCO. Retrieved 15 October 2011"]}, {"page": "William M. Mitchell", "response": ["Mitchell is said to be the only writer who wrote about the Underground Railroad while it was still illegal, although others had described it at an earlier date. The British writer Harriet Martineau had mentioned the concept in 1837 and the British abolitionist Joseph Sturge wrote about it in 1841, but they did not name it. Mitchell's book took the name of the Underground Railroad into his book's title, although the phrase had been used before by James Stirling in 1857. Mitchell's book was published in London in 1860. Mitchell's book garnered recommendations from leading abolitionists including the American activist William Howard Day and the British politician George Thompson."]}, {"page": "William Knibb", "response": ["In 1839 the Birmingham Anti-Slavery Society became the Birmingham Branch of the British and Foreign Anti-Slavery Society. This society was planning a major convention in 1840 with Joseph Sturge taking the lead. Knibb as invited. Thomas Swan, who led Birmingham's Cannon Street Baptist chapel, was able to meet Knibb who he and Joseph Sturge had worked hard to support. Knibb had already encouraged his congregation in Jamaica to take unilateral action and free any of their unpaid staff. Knibb had brought with him to England two deacons from Jamaica named Edward Barrett and Henry Beckford. These two men spoke to 5,000 people at Birmingham Town Hall and Beckford became the central figure in Haydon's painting that commemorated the World Anti-Slavery Convention."]}, {"page": "Samuel Oughton", "response": ["The abuses of indentured apprenticeship were finally abolished on 1 August 1838, following a campaign led by Joseph Sturge, with support from the Baptists, the Society for the Mitigation and Gradual Abolition of Slavery Throughout the British Dominions (Anti-Slavery Society 1823–1838), and longstanding abolitionists such as William Allen. Even so, emancipation was no paradise; the planters frequently harassed tenants (see Free Villages, and sought to drive down wages when they could. Oughton once famously remarked to his flock in the parish of Hanover:", "For a time (during 1840) he was imprisoned by the Jamaican authorities for his outspoken views against liberties being taken by magistrates against African women. Back in Britain, Joseph Sturge of the British and Foreign Anti-Slavery Society (Anti-Slavery Society founded 1839) passed on Oughton's descriptions of the horrendous labour practices suffered by Africans in Jamaica, which Oughton continued to communicate whilst in prison. Joseph Sturge made representations to the Colonial Office on his behalf and Samuel Oughton was eventually discharged after a period released on bail. He records \"simple but ardent expressions of delight and affection\" from \"our poor dear people\", who welcomed him back to East Queen Street chapel with renewed hope. In 1841 Oughton was able to write: \"my affection for the people, and theirs for me, seems to grow stronger by the day\"."]}, {"page": "Alexander Fletcher (minister)", "response": ["In May 1846 Finsbury Chapel was the venue for a huge gathering to hear a speech by Frederick Douglass, who had escaped from slavery in the US and become a major speaker for abolition. This was advertised as a publicity meeting at Finsbury Chapel to receive from Frederick Douglass an account of the dreadful conditions, both in law and practice, of 3,000,000 of slaves in the United States. The meeting was introduced by Joseph Sturge. A contemporary report noted that every part of the large edifice was crowded to suffocation; the firebrand Congregational, John Campbell gave a rousing response of support for abolition."]}, {"page": "Robert Charleton", "response": ["As a Quaker he wrote a critique of Barclay's Apology(1868). He was present in as a child at Congénies in the 1820s.  He was a member of the Peace SocietyThe Times, Wednesday, 23 May 1866; pg. 12; Issue 25505; col C \"THE PEACE SOCIETY.-The 50th anniversary\". and was part of a peace delegation (1854) with Joseph Sturge and Henry Pease that went to St Petersburg to attempt to head off the Crimea War to present an address to the Emperor Nicholas at St. Petersburg against the war. This address was graciously received by the emperor on 10 Feb (Illust. London News, 4 and 11 March 1854)."]}]}}