{"wiki_id": "http://www.wikidata.org/entity/Q6289049", "itemLabel": "Josh Kennet", "itemDescription": "Football (soccer) player", "wikipedia_url": "https://en.wikipedia.org/wiki/Josh_Kennet", "wikipedia_page": {"main": "Joshua Simon Kennet (born 27 September 1987) is an English-Israeli footballer currently with London Lions.", "link_mentions": [{"page": "List of British Jews", "response": ["* Josh Kennet, England, midfielder/right back (Maccabi Herzliya)"]}, {"page": "JFS (school)", "response": ["* Josh Kennet (born 1987), English-Israeli footballer"]}, {"page": "List of Jews in sports", "response": ["*Josh Kennet, England/Israel, midfielder/right back (London Lions)"]}, {"page": "Dean Furman", "response": ["Furman is Jewish and of English descent. He said in 2020: \"I would love to see more Jewish players.... I hope parents and young Jewish players are looking up to me, Joe Jacobson and Nicky Blackman.\" He was born in the Camps Bay suburb of the city of Cape Town, South Africa, to South African parents Ronnie and Carol Furman. His family relocated to England when Furman was five years old. He grew up in Edgware in North London, and attended JFS Jewish mixed comprehensive school, where he was a classmate of footballer Josh Kennet, and later lived in Manchester.\"Furman wins top Maccabi GB award,\" The Jewish Chronicle, 25 November 2013.Danny Caro. \"Furman ready to rub shoulders with Premier League stars at Africa Cup of Nations,\" The Jewish Chronicle. His younger brother Jake has represented Maccabi GB at two Maccabiah Games, and he hopes to represent Maccabi GB at a future Maccabiah Games alongside his brother.\"Pollacks boosts Maccabiah football squad,\" The Jewish Chronicle, 4 April 2013. His uncle is former Hellenic left back Marc Reingold."]}, {"page": "Kennet", "response": ["*Josh Kennet (born 1987), English-Israeli footballer"]}, {"page": "Josh", "response": ["*Josh Kennet (born 1987), English-Israeli footballer"]}, {"page": "List of English people", "response": ["* Josh Kennet (born 1987), English-Israeli footballer"]}, {"page": "Football at the 2009 Maccabiah Games – Men's team squads", "response": ["|13||align=left|Scott ShultonScott Shulton replaced Josh Kennet due to injury. ||align=left| ||align=left|  ||1 ||0 ||0 ||0 ||0"]}, {"page": "2017 Maccabiah Games", "response": ["Canadian Olympian Josh Binstock and his partner won the gold medal in men's beach volleyball.\"Walkover gold for Nusbaum, Binstock at Maccabi Games\", YorkRegion.com. Canadian Pan American Games medalist Sasha Gollish won gold medals running in the 800m, 1,500m, and 5,000m events.\"Canada wraps up Maccabiah games with 50 medals,\" Canadian Jewish News.  Cricketer Zac Elkin won a gold medal with Team South Africa, and cricketer Mark Bott won a silver medal with Great Britain.\"Maccabiah cricket silver a 'tremendous achievement,'\" The Jewish Chronicle. Josh Kennet won a silver medal with Great Britain in soccer."]}, {"page": "Football at the 2017 Maccabiah Games – Men's tournament", "response": ["* Josh Kennet"]}]}}