{"wiki_id": "http://www.wikidata.org/entity/Q6283957", "itemLabel": "Joseph Hepworth", "itemDescription": "English businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Hepworth_(tailor)", "wikipedia_page": {"main": "Joseph Hepworth (1834–1911) was the clothing manufacturer who founded Joseph Hepworth & Son, a company which grew to become the United Kingdom's largest clothing manufacturer and which is now known as Next plc.\n\n", "link_mentions": [{"page": "Next plc", "response": ["The company was founded by Joseph Hepworth in Leeds in 1864 as a tailor under the name of Joseph Hepworth & Son. Initially Hepworth was in partnership with James Rhodes, but the partnership was dissolved in 1872.The London Gazette, 9 July 1872, p.3121"]}, {"page": "Hepworth", "response": ["* Joseph Hepworth (tailor) (1834–1911), founder Joseph Hepworth & Son, clothing manufacturers, now Next plc.", "* Joseph Hepworth (c. 1876–1945), British Conservative Party politician"]}, {"page": "1982 in the United Kingdom", "response": ["* 12 February – Opening of the first Next clothing store, a rebranding of the merged Joseph Hepworth and Kendall chains masterminded by George Davies. It specialises in women's clothing."]}, {"page": "Joseph Hepworth", "response": ["Joseph Hepworth (c. 1876 – 11 May 1945) was a British Conservative Party politician."]}, {"page": "Arthur Marshall (British politician)", "response": ["Arthur Harold Marshall was born in Ashton-under-Lyne, Lancashire, a son of Methodist Minister Rev. H.T. Marshall DD and Mary Keats of Hanley. He was educated privately and at Yorkshire College (University of Leeds).The Liberal Year Book for 1929 He travelled extensively in South Africa, Canada, U.S.A. and Europe.Dods Parliamentary Companion For 1918 In 1896 he married Louie Hepworth, the third daughter of Joseph Hepworth JP of Leeds, Torquay and Harrogate. In 1918 he became a Knight of the British Empire. In 1948 his wife died.(2007, December 01). Marshall, Sir Arthur (Harold), (2 Aug. 1870–18 Jan. 1956), Barrister-at-law, Gray’s Inn (North-Eastern Circuit); MP (L) Wakefield, 1910–18, Huddersfield, 1922–23; was a Liberal Whip. WHO'S WHO & WHO WAS WHO. Retrieved 28 Jan. 2021, from https://www.ukwhoswho.com/view/10.1093/ww/9780199540891.001.0001/ww-9780199540884-e-240396."]}, {"page": "Stephen Williams (fashion designer)", "response": ["Stephen's first job was at Joseph Hepworth & Sons, where George Davies had him trained as a tailor. Stephen then worked on their collaboration with Next and resulting menswear line."]}, {"page": "List of clothing and footwear shops in the United Kingdom", "response": ["|Started in 1982 after the purchase of Kendall & Sons Ltd by clothing manufacturer Joseph Hepworth. In 1984 J Hepworth & Son changes its name to NEXT plc.", "| Joseph Hepworth & Son", "| Founded in Leeds by Joseph Hepworth & James Rhodes and became Britain's largest clothing manufacturer. Started selling from retail shops in the 1880s. Purchased Kendall & Sons in 1982, and in 1983 relaunched Kendalls under the Next brand. In 1984 all Hepworth shops were rebranded Next.", "| Started in 1870 as an umbrella manufacturer, before moving into rainwear and ladies' clothing ranges in the 20th century. Purchased by Combined English Shops in 1977, and sold to Joseph Hepworth & Son in 1982. Rebranded and relaunched as Next in 1983."]}]}}