{"wiki_id": "http://www.wikidata.org/entity/Q6286144", "itemLabel": "Joseph Payne", "itemDescription": "English cricketer (1829-1880)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Payne_(cricketer)", "wikipedia_page": {"main": "Joseph Spencer Payne (29 April 1829 – 12 April 1880) was an English cricketer. Payne was a right-handed batsman who bowled left-arm roundarm medium pace. \nPayne was born at East Grinstead in Sussex in 1829. He made his first-class cricket debut for Sussex County Cricket Club against MCC at Lord's in 1861. He made a second first-class appearance for Sussex in the same season against Kent and went on to play once for Kent against Yorkshire in 1864.Payne died at Greenwich in Kent in April 1880 aged 50. His brothers, Charles and Richard, played first-class cricket, as did his nephews William Payne and Alfred Payne.", "link_mentions": [{"page": "Payne (name)", "response": ["*Joseph Payne (1808–1876), English educationalist", "*Joseph Payne (musician) (1941–2008), English harpsichordist, organist and musicologist", "*Joseph Payne (cricketer) (1829–1880), English cricketer "]}, {"page": "William Payne (cricketer)", "response": ["Outside of cricket, Payne worked as a shoemaker, an occupation which had long been associated with his family. It is known that by 1881 he was married to his wife, Emily, with whom he had a three-month-old daughter. He died at the town of his birth on 25 June 1909. His brother, Alfred, played first-class cricket, as did his uncles Charles Payne, Richard Payne and Joseph Payne."]}, {"page": "Alfred Payne (Sussex cricketer)", "response": ["Outside of cricket, Payne worked as a shoemaker, an occupation which had long been associated with his family. It is known that by 1881 he was single and living with his parents, William and Harriett, both in their sixties. He died at Uckfield, Sussex, on 23 July 1943. His brother, William, played first-class cricket, as did his uncles Charles Payne, Richard Payne and Joseph Payne."]}, {"page": "Joseph Payne", "response": ["Joseph Payne may refer to:", "* Joseph Payne (educationalist) (1808–1876), British educationalist", "* Joseph Payne (cricketer) (1829–1880), English cricketer", "* Joseph Payne (musician) (1941–2008), British musician"]}]}}