{"wiki_id": "http://www.wikidata.org/entity/Q6288119", "itemLabel": "Joseph Yorke", "itemDescription": "British politician (1807-1889)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Yorke_(MP)", "wikipedia_page": {"main": "Joseph Yorke (11 January 1807 – 4 February 1889), was a British Member of Parliament.\nYorke was the son of Joseph Yorke and Catherine, daughter of James Cocks and sister of Charles Cocks, 1st Baron Somers. His grandfather the Right Reverend James Yorke was the fifth son of Philip Yorke, 1st Earl of Hardwicke. He was returned to parliament as one of two representatives for Reigate in 1831, a seat he held until the following year. He later served as High Sheriff of Gloucestershire between 1844 and 1845.Yorke married Frances Antonia, daughter of Reginald Pole-Carew, in 1834. They lived at Forthampton Court in Gloucestershire. Yorke died on 4 February 1889, aged 82. His wife only survived him by three weeks and died on 27 February of the same year. Their son John Yorke was a Conservative politician.", "link_mentions": [{"page": "Earl of Hardwicke", "response": ["Numerous other members of the Yorke family have also gained distinction. The Honourable Charles Yorke, second son of the first Earl, was also Lord Chancellor of Great Britain. He was the father of 1) the third Earl, 2) Charles Philip Yorke, Home Secretary between 1803 and 1804, and 3) Sir Joseph Sydney Yorke, an Admiral in the Royal Navy, who was the father of the Honourable Eliot Yorke, Member of Parliament for Cambridgeshire. The Honourable Joseph Yorke, third son of the first Earl, was a soldier, politician and diplomat and was created Baron Dover in 1788. The Honourable John Yorke, fourth son of the first Earl, sat as Member of Parliament for Reigate and Higham Ferrers. The Right Reverend the Honourable James Yorke, fifth son of the first Earl, was Bishop of Ely. He was the father of 1) Joseph Yorke, who was the father of Joseph Yorke, Member of Parliament for Reigate, who was the father of John Yorke, a Conservative politician, who was the grandfather of the author Henry Green; and 2) Reverend Philip Yorke, who was the father of Colonel Philip James Yorke (1799-1874), a Fellow of the Royal Society, and Reginald Yorke (1803-1870), a Rear-Admiral in the Royal Navy.", "The heir apparent is the present holder's son, Philip Alexander Joseph Yorke, Viscount Royston (b. 2009)."]}, {"page": "Reigate (UK Parliament constituency)", "response": ["|rowspan=\"2\"| Joseph Yorke ||rowspan=\"2\"| Tory"]}, {"page": "List of United Kingdom MPs: Y", "response": ["|Joseph Yorke"]}, {"page": "James Yorke (bishop)", "response": ["*Joseph Yorke (1765–1830), married Catherine Cocks, niece of Charles Cocks, 1st Baron Somers, and became father of Joseph Yorke, politician"]}, {"page": "Joseph Sydney Yorke", "response": ["Yorke was knighted during this period of service, on 21 April 1805, by King George III. On 23 April, Yorke was present at the installation of the Knights of the Garter, standing in for his brother, Philip Yorke, Earl of Hardwicke. Philip was at this time Lord Lieutenant of Ireland, and so was unable to be present in person. In 1810 Joseph Yorke's brother, Charles Philip Yorke became First Lord of the Admiralty and Joseph was transferred from command of the Christian VII to take up a seat on the Board of Admiralty.", "Joseph Yorke was promoted to Rear-Admiral of the Blue on 31 July 1810 and hoisted his flag in the 74-gun  in January 1811. He sailed to the Tagus carrying reinforcements for Arthur Wellesley's army, fighting in the Peninsular War. After carrying this out he escorted a fleet returning to Britain from the East Indies. Yorke was promoted to Rear-Admiral of the White on 12 August 1812, Rear-Admiral of the Red on 4 December 1813 and Vice-Admiral of the Blue on 14 June 1814. He served as First Naval Lord in the Liverpool ministry from October 1813 until May 1816Rodger, p. 69 but remained on the Admiralty Board until April 1818. He was appointed a Knight Commander of the Order of the Bath (KCB) in the restructuring of that order in January 1815, promoted Vice-Admiral of the White on 12 August 1819, and promoted to Admiral of the Blue on 22 July 1830.", "Yorke stood as a candidate for the constituency of Reigate in 1790, and was returned as its member. He represented the borough until 1806, when he was elected as member for St Germans. He stood aside, \"taking the Chiltern Hundreds\" in 1810 so that his brother, Charles Philip Yorke, could be elected. In the 1812 general election Joseph Yorke stood as a candidate for Sandwich and was returned as its member. He represented the borough until 1818 when he was re-elected to the Reigate constituency, which he represented until his death. Yorke's business interests include the chairmanship of the Waterloo Bridge Company.", "On 29 March 1798, Yorke married Elizabeth Weake Rattray, the daughter of James Rattray, in Ireland. The couple had a number of children before Elizabeth's death on 20 January 1812. His eldest son, Charles Yorke also served in the navy, rising to the rank of admiral, and on the death without heir of Joseph Yorke's brother Philip, the 3rd Earl of Hardwicke in 1834, Charles became the 4th Earl. His daughter Agneta Elizabeth Yorke married the banker Robert Cooper Lee Bevan."]}, {"page": "John Yorke (Conservative politician)", "response": ["A member of the Yorke family headed by the Earl of Hardwicke, he was born in Marylebone, London, the son of Joseph Yorke, of Forthampton Court, GloucestershireParishes:Forthampton, A History of the County of Gloucester: volume 8 (1968), pp. 196-208  Date accessed: 8 March 2009 and his wife Frances Antonia, daughter of Reginald Pole-Carew. He was educated at Eton and Balliol College, Oxford.Debrett's House of Commons 1881  Yorke was a second cousin of Charles Lyttleton, 5th Baron Lyttleton, whose mother dowager Lady Lyttelton  referred to Yorke as \"tall and magnificent and promising as ever\".The Barons Lyttleton of Frankley"]}, {"page": "Joseph Yorke", "response": ["Joseph Yorke may refer to:", "*Joseph Yorke, 1st Baron Dover (1724–1792), British soldier, politician and diplomat", "*Joseph Yorke (MP) (1807–1889), British landowner and politician, kinsman of the above", "*Joseph Yorke, 10th Earl of Hardwicke (born 1971), British peer"]}, {"page": "List of MPs elected in the 1831 United Kingdom general election", "response": ["|Joseph Yorke||"]}, {"page": "Yorke Almshouses", "response": ["Burges designed the almshouses in 1865. His patron was Joseph Yorke, of the family of local landowners. The family fortune had been established by Philip Yorke, 1st Earl of Hardwicke, a successful lawyer and politician. His son James Yorke (1730–1808) acquired the Forthampton Court estate in 1762, through his marriage to an heiress, Mary Maddox. James Yorke became successively Bishop of St David's, Bishop of Gloucester and Bishop of Ely. His grandson Joseph commissioned Burges to undertake a restoration of the Forthampton parish church, St Mary the Virgin, between 1863 and 1866, and the almshouses, which stand next to the church, were completed during this period. The restoration and construction work at Forthampton was conceived as a memorial to Joseph's daughter, Augusta Emmeline, who died in 1863, weeks after giving birth to an heir."]}]}}