{"wiki_id": "http://www.wikidata.org/entity/Q6282897", "itemLabel": "Joseph Emberton", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Emberton", "wikipedia_page": {"main": "Joseph Emberton (1889–1956) was an English architect of the early modernist period. He was born 23 December 1889 in Audley, Staffordshire and was educated at the Royal College of Art. He first worked for the London architects Trehearne and Norman between 1913 and 1914, before serving as a gunner in the Honourable Artillery Company during the First World War.\nIn 1923 he designed Olympia National, then known as the New Hall. This sat alongside Olympia Grand at the Kensington event venue. 1932 saw the construction of his second addition to Olympia - Olympia Central (initially named the Empire Hall). These halls, along with other event spaces, all make up one of London's largest event venues - Olympia London.\nHis 1931 design of the Royal Corinthian Yacht Club at Burnham-on-Crouch represented Britain at the influential International Exhibition of Modern Architecture held at Museum of Modern Art in New York City in 1932. He went on to design the Simpsons of Piccadilly department store in 1936 with the interior designed by László Moholy-Nagy, and the Casino at Blackpool's pleasure beach in 1939. Joseph Emberton's archive is located at the University of Brighton Design Archives.", "link_mentions": [{"page": "International Style (architecture)", "response": ["| Joseph Emberton || Royal Corinthian Yacht Club ||  Essex, England || 1931", "* Joseph Emberton"]}, {"page": "Burnham-on-Crouch", "response": ["There are many listed buildings in the town, including the Grade II* listed Royal Corinthian Yacht Club designed in 1931 by the modernist architect Joseph Emberton. The Mangapps Railway Museum is located nearby."]}, {"page": "1889 in architecture", "response": ["* December 23 – Joseph Emberton, English modernist architect (died 1956)"]}, {"page": "1931 in architecture", "response": ["* July – Royal Corinthian Yacht Club clubhouse, Burnham-on-Crouch, eastern England, designed by Joseph Emberton, is opened."]}, {"page": "British Empire Exhibition", "response": ["The exhibition grounds contained commercial kiosks, run by newspapers, cigarette companies and other businesses. All these structures were designed by the architect Joseph Emberton and his team."]}, {"page": "Simpsons of Piccadilly", "response": ["Simpsons of Piccadilly was a large retail store situated at 203-206 Piccadilly in central London. It was created by Alexander Simpson and architect Joseph Emberton. When it opened in April 1936 it was the largest menswear store in Britain, and is now a Grade I listed building due to its innovative construction. Its original purpose was to house the entire range of clothing provided by the tailoring company S. Simpsons and DAKS. It was later purchased by the Waterstones chain of bookshops, and currently serves as their flagship store.", "Simpson’s aim was to build a large, modern menswear store to serve as a flagship for the S Simpson brand, with a steel structure, faced in Portland stone and to be built as high as permitted, and to compete with the store built for the rival Austin Reed ten years prior. Simpson contracted Joseph Emberton as the architect for this project, known for his modernity in architecture and for designing the interior of the Austin Reed store.", "The building is recognised as Joseph Emberton’s masterpiece – the front glass and stone strips aren't quite horizontal as perceived on first glance, but at a slight angle to help appear more horizontal, keep clean for longer and reflect the coloured neon lighting that was in place at the opening; ducts are hidden around the walls so that the lights in them reflect better off the ceiling, the water supply was by an artesian well in the basement; the vast open floors which weren't common of the time, fitted with hidden sliding fire doors; a vacuum cleaning system with vertical tubes installed through the building and in the ceiling ducts; the use of new coloured neon-lighting for the front of the shop that he'd used at the Blackpool Pleasure Beach before; and having the first curved-glass windows in Britain.", "* Joseph Emberton Archive, University of Brighton Design Archives"]}, {"page": "1956 in architecture", "response": ["* November 20 – Joseph Emberton, English modernist architect (born 1889)"]}, {"page": "Royal Corinthian Yacht Club", "response": ["250px|thumb|The Burnham-on-Crouch Royal Corinthian Yacht Club, designed by Joseph Emberton in 1931.", "In 1931 Tiny Mitchell became Commodore of the club where he was responsible for completing the new clubhouse at Burnham-on-Crouch. The Grade II* listed building was designed by Joseph Emberton and represented Britain's contribution to the International Exhibition of Modern Architecture held at the Museum of Modern Art in New York City in 1932.Joseph Emberton, Architect. 1889-1956. Retrieved 2008-07-07. The building is one of the few examples of the International style of architecture in Britain.Bettley, James & Pevsner, Nikolaus. (2007). Essex: Essex since 1914. (p. 69). Yale University Press. .University of Brighton. Design Archives: Joseph Emberton Archive. Retrieved 2008-05-20."]}, {"page": "Architecture of London", "response": ["File:Simpsons of Piccadilly 2005.jpg|Simpsons of Piccadilly (1936) Joseph Emberton"]}, {"page": "1931 in the United Kingdom", "response": ["* July – new Royal Corinthian Yacht Club clubhouse at Burnham-on-Crouch in Essex, a pioneering British example of International Style designed by Joseph Emberton, is opened."]}, {"page": "Big Dipper (Blackpool Pleasure Beach)", "response": ["The coaster was first built in 1923 by John Miller. It was extended in 1936 by American engineer Charles Paige (whose work at the Pleasure Beach is all that survives of the 13 wooden coasters he is known to have built) with arches over the south entrance of the park and additional drops. British architect Joseph Emberton designed the ride station."]}, {"page": "Pleasure Beach Express", "response": ["The main station was built in 1933, but was destroyed by fire in 1934. Redesigned by architect Joseph Emberton and rebuilt in 1935, it was replaced in 1970 by the present Victorian style building."]}, {"page": "Jack Howe (architect)", "response": ["Howe worked for Joseph Emberton, and from 1934 onwards for Maxwell Fry, where he worked on Impington Village College and the Westminster Electricity Showroom in Regent Street. Following Walter Gropius's move to the United States in 1937, Howe oversaw the construction of Impington Village College. At the outbreak of the World War II, he worked with Holland, Hannen & Cubitts for the Royal Ordnance factories at Wrexham and Ranskill. He then joined Arcon in 1944 as associate partner, and worked on the design of the Mark 4 prefabricated house, of which 41,000 were later built. He set up his own practice after the end of the war, and designed Highbury Quadrant Primary School and housing at Windmill House, Lambeth, among other buildings, for the London County Council. He worked on the Kodak pavilion at the Brussels World Fair in 1958 and the British Pavilion at the British Trade Fair in Moscow in 1961."]}, {"page": "Listed buildings in Blackpool", "response": ["|Designed by Joseph Emberton for Leonard Thompson of the Pleasure Beach, in the International Modern style, the White Tower was built 1937–40 and restored and altered in 1972 and 1977–79. It is constructed of reinforced concrete and has a circular plan with long, curved window bands. It has a thin spiral tower on one side of the entrance, which adds, according to Nikolaus Pevsner, \"an appropriate note of gaiety\", and a lower rectangular tower on the other side.", "|A roller coaster ride designed by John A. Miller, it was built by Philadelphia Toboggan Coasters, and was modified in 1936 by Charlie Paige and Joseph Emberton.  There are two trains, each of three cars, and each trains carries 24 passengers.  The length of the ride is  and its maximum height is .", "|A static ride designed by Hiram Maxim, and altered in 1934 by Joseph Emberton, it is the oldest static amusement ride in Britain, and the oldest fairground ride in continuous use in Europe.  The ride consists of ten cars attached by booms to a central shaft which, when it rotates, lifts the cars by centrifugal force."]}, {"page": "DAKS", "response": ["Simeon Simpson's son Alexander Simpson founded Simpsons of Piccadilly. The new building was designed by architect Joseph Emberton as a new and revolutionary retail establishment, the shop front windows exhibited the first curved glass display in Great Britain and the largest in the world at the time, these were designed so that no reflection would be cast to obscure the displays inside. The store opened in April 1936 by Sir Malcolm Campbell, the world-famous motor-racing driver. and was known for its visual merchandising and window displays by László Moholy-Nagy, a former director from the Bauhaus school. Retrieved 27 December 2012 Alexander Simpson died the following year of leukaemia aged just 34."]}, {"page": "Maurice Hurst (architect)", "response": ["After receiving his Masters from the College of Art and Architecture in 1952, he worked with Joseph Emberton in 1953. Hurst was employed with various commercial architectural firms and practices in London. He completed his British military service from 1953-1955, being posted to Egypt where he worked on the Suez Canal with the Royal Engineers. After he completed his military service he worked with some urban planning offices.  At the recommendation of his friend Bernard Joyce who was now living in Australia, Maurice Hurst emigrated to Australia in 1958 where he found employment with the architectural firm of Lund Hutton Newell and Paulsen in Brisbane. He settled in Queensland. During this time he was part of design teams who worked on major projects such as the Church of England in Thargomindah (1959) and the new town hall of Gumdale (1960). At Thargomindah, Hurst's team were at the forefront of adaptation of religious architecture using established conventions while acclimatizing to Queensland's tropical conditions. Equally, at Gumdale Maurice Hurst endeavoured to provide a new space for civil function yet still conserving stylistic trends of old. "]}, {"page": "Architecture of the night", "response": ["*Simpson's Department Store, London (1936): Blue, red, and green neon tubes on dimmers above ribbon windows, to produce either colored or (by combining all three) white light; surfaces inclined to ensure even lighting, vertical light trough framing facade. Neon-lighted store name added later. Building design: Joseph Emberton with László Moholy-Nagy and Felix Samuely. Lighting design: Joseph Emberton.\"Selected Projects,\" Architecture of the Night, pp. 168–69."]}, {"page": "Douglas Gardiner", "response": ["In 1926, Gardiner travelled abroad and worked in New York City for York and Sawyer and later in London for Joseph Emberton. On his return to Sydney in 1929, he worked in the office of Emil Sodersten and then with Hennessy & Hennessy. In the 1930s he lived next door to his old family home at 16 Oakura Street, Rockdale, and worked for himself in private practice. In 1940, construction commenced on a new Rockdale Town Hall to his design. During World War II he served as an architect in the US Army Corps of Engineers in the south-west Pacific areaNarrating Architecture: A Retrospective Anthology Retrieved 15 April 2019. and met Osborn McCutcheon. At war's end, Gardiner was appointed a partner at Bates Smrt & McCutcheon. His work within the firm included:"]}, {"page": "Blackpool Pleasure Beach", "response": ["The success of Paiges' wooden coasters resulted in a complete reprofiling of the Big Dipper in 1936, which was extended towards the south-westerly side of the park. During this time Thompson hired Joseph Emberton, an award-winning architect who was brought in to redesign the architectural style of the Pleasure Beach rides and buildings. He worked on The Casino Building, Noah's Ark and the Ice Drome, a 2,000-seat ice rink. Emberton continued to design for the Pleasure Beach up to his death in 1956. After which Jack Ratcliffe, who had been involved in the Festival of Britain, was brought in to continue the work. Ratcliffe worked for many years at the park, and much of his work can still be seen today.", "| colspan=\"5\" style=\"text-align: left;\" | A dark ride. This ghost train was the first in the world and is where the ride name \"Ghost Train\" originates. It was built by Mr Joseph Emberton."]}, {"page": "University of Brighton Design Archives", "response": ["The archives of Bernard Schottlander, Paul Clark, and Barbara Jones, designers from different periods each having connections with the Design Council's work. Communication designers HA Rothholz, Edwin Embleton and Anthony Froshaug. Architects Joseph Emberton and Theo Crosby, and the display and set designer, Natasha Kroll.", "*2015 - Joseph Emberton: the architecture of display 2015, 18 February - 17 May 2015. Pallant House."]}, {"page": "Natasha Kroll", "response": ["In 1942 Kroll was appointed to the position of display manager for the large retail store Simpson (Piccadilly) Ltd. Her pioneering approach and her display philosophy, with its roots in European modernism, complemented the innovative new premises designed by Joseph Emberton.Natasha Kroll Archive - University of Brighton Design Archives Kroll stayed at Simpsons twelve years, working her way up from the role of display manager to taking full responsibility for all the store's design, publicity and display work. During this time she recruited illustrator André François and gave Terence Conran his first display commission.Artmonsky, Ruth, Showing Off: Fifty Years of London Store Publicity and Display, Artmonsky Arts, 2013, "]}, {"page": "List of places of interest in Essex", "response": ["| Clubhouse designed by Joseph Emberton in 1931 which represented Britain's contribution to the International Exhibition of Modern Architecture held at the Museum of Modern Art in New York City in 1932. Grade II* listed building."]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Joseph Emberton"]}, {"page": "Emberton, Joseph", "response": ["#redirectJoseph Emberton"]}]}}