{"wiki_id": "http://www.wikidata.org/entity/Q6281793", "itemLabel": "Joseph Burgess", "itemDescription": "British journalist and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Burgess", "wikipedia_page": {"main": "Joseph Burgess (1853–1934) was a British journalist, writer and Labour politician.\nHe was born on 3 July 1853 in Failsworth, Lancashire, the third of six children of handloom weavers, and was educated at a print works school in Failsworth. He started work in a card-cutting room at the age of six and worked as a cotton operative until he was 28. He married three times, having six children. He died in January 1934.", "link_mentions": [{"page": "Independent Labour Party", "response": ["Further arguments for the formation of a new party were to be found in Robert Blatchford's newspaper The Clarion, founded in 1891, and in Workman's Times, edited by Joseph Burgess. The latter collected some 3,500 names of those in favour of creating a party of labour independent from the existing political organisations."]}, {"page": "Henry Hyde Champion", "response": ["\"The boast has truth in it. For if any one man could say 'I created the ILP,' that man was Henry Hyde Champion. Others, and notably James Keir Hardie, are extolled as founders of the ILP..... Keir Hardie, Joseph Burgess, Robert Blatchford – were but midwives. The real father was H.H. Champion. And if Champion has been pushed out of the scene, it is partly because he left England for Australia; and partly because, indifferent to fame, he was ambitious rather to get things done than to have the credit for the accomplished fact. "]}, {"page": "Leicester (UK Parliament constituency)", "response": ["thumb|120px|Joseph Burgess"]}, {"page": "Burgess (surname)", "response": ["* Joseph Burgess (1853–1934), British politician", "* Anthony Joseph Burgess (1938–2013), Australian-born Papua New Guinean Roman Catholic bishop"]}, {"page": "Bradford Pioneer", "response": ["In 1914, Joseph Burgess was the editor.A. T. Lane, Biographical Dictionary of European Labor Leaders, 1995, p 165-6  Another editor was Frank Betts, father of Barbara Castle.Tribute to Barbara Castle ", ":1913: Joseph Burgess"]}, {"page": "Yorkshire Factory Times", "response": ["The Yorkshire Factory Times was a British newspaper, founded in 1889.Howell, David. British Workers and the Independent Labour Party, 1888-1906. Manchester [Greater Manchester]: Manchester University Press, 1984. p. 178 It was published weekly between 3 January 1890 and 29 December 1899. The newspaper was initially edited by Joseph Burgess and published from Huddersfield. The Yorkshire Factory Times was sold at the price of one penny.Mutch, Deborah. English Socialist Periodicals: 1880-1900 : a Reference Source. Burlington, VT: Ashgate, 2005. p. 3"]}, {"page": "C. Allen Clarke", "response": ["Charles Allen Clarke (1863–1935), most widely known as C. Allen Clarke, was an English working-class humorist, novelist, journalist and social investigator from Lancashire. An ILP member and friend of Robert Blatchford, Clarke succeeded Joseph Burgess as editor of the Yorkshire Factory Times."]}, {"page": "National Socialist Party (UK)", "response": ["Other prominent members included Henry W. Lee, Hunter Watts, John Stokes and Joseph Burgess."]}, {"page": "National Administrative Council", "response": ["| Edward AvelingJoseph BurgessPete CurranKatherine St John Conway", "|rowspan=2| Joseph Burgess"]}, {"page": "Arthur Field (trade unionist)", "response": ["In 1890, Field organised a conference to found a Kent Independent Labour Party.  This affiliated to the Legal Eight Hours and International League, and was chaired by Edward Aveling.  It sponsored W. C. Steadman as a Liberal-Labour candidate in Mid Kent at the 1892 UK general election, although he was not elected.  Field also helped Joseph Burgess found a Labour Club in Leicester."]}, {"page": "Burgess, Joseph", "response": ["#redirectJoseph Burgess"]}, {"page": "Leicester and District Trades Union Council", "response": ["The council endorsed several candidates for the Leicester Town Council and School Board, including Merrick, Thomas Smith and George Sedgwick.  In 1890, the council backed several Labour Association candidates, who were elected to Leicester Town Council as Liberal-Labour members, but thereafter, the growing influence of socialists on the council led it to distance itself from Liberal candidates.  In 1893, this led it to support a May Day demonstration, in support of the movement for an eight-hour day, while at the 1894 Leicester by-election, it backed Joseph Burgess, the Independent Labour Party candidate.  It became a founding affiliate of the Labour Representation Committee in 1900."]}]}}