{"wiki_id": "http://www.wikidata.org/entity/Q6287490", "itemLabel": "Joseph Trewavas", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Trewavas", "wikipedia_page": {"main": "Joseph Trewavas  (14 December 1835 – 20 July 1905) was a Royal Navy sailor and a recipient of the Victoria Cross, the highest award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.", "link_mentions": [{"page": "List of English Victoria Cross recipients", "response": ["|Joseph Trewavas || Royal Navy || 1855 || Crimean War || Sea of Azov"]}, {"page": "List of people from Cornwall", "response": ["* Joseph Trewavas, able seaman who won the Victoria Cross"]}, {"page": "Mousehole", "response": ["John Keigwin (1641–1716), a scholar in the Cornish language, William Carvosso (1750–1834), the Methodist, and Joseph Trewavas VC CGM (14 December 1835 – 20 July 1905) were also born in Mousehole."]}, {"page": "HMS Beagle (1854)", "response": ["Beagle took part in the Crimean War from 1854 to 1856.  During the Crimean War, two of her ship's company were awarded the Victoria Cross for their actions: Joseph Trewavas was awarded the VC for his actions in the Sea of Azov, and an acting-mate in Beagle, Wiliam Hewett, was awarded the VC for his actions in defending a shore battery."]}, {"page": "Cornwall County Council", "response": ["*Joseph Trewavas VC (1835–1905)"]}, {"page": "List of Cornish soldiers, commanders and sailors", "response": ["* Joseph Trewavas, VC, seaman in the Royal Navy"]}, {"page": "Skirmish at the Genitchi Strait", "response": ["The Skirmish at the Genitchi Strait was a minor action in the Crimean War, which occurred on 3 July 1855. It is notable in that it was the occasion on which a Victoria Cross was awarded,  to seaman Joseph Trewavas.", "The Russians had built a large floating pontoon bridge across the Genitchi Strait, Sea of Azov, to connect the town of Genitchi to the Arabat Spit, and it served as the main supply route to reinforce their troops at Sevastopol. The destruction of the bridge would force the Russians to travel an extra  to deliver supplies, and it therefore became a strategic objective for British forces. Two attacks to cut the floating bridge's hawsers had proved unsuccessful and alerted the Russian garrison. The British made a third attempt on 3 July 1855 using HMS Beagle's four-oared gig, commanded by Gunner John Hayles, and a small paddle-box steamer with one gun, under Midshipman Martin Tracy. The paddle-box steamer moored where the crew could see Russian soldiers marching about on shore and fired the first round in the breech, which drew the gun's securing bolts and made it useless. That left six men in a four-oared boat (including Joseph Trewavas), one rifle, ten rounds of ammunition, and a cutlass apiece to face two hundred enemy on shore behind heaps of coal."]}, {"page": "Trewavas", "response": ["*Joseph Trewavas, British Victoria Cross recipient"]}, {"page": "Trewavas, Joseph", "response": ["#redirectJoseph Trewavas"]}]}}