{"wiki_id": "http://www.wikidata.org/entity/Q6286581", "itemLabel": "Joseph Ritson", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Ritson", "wikipedia_page": {"main": "Joseph Ritson (2 October 1752 – 23 September 1803) was an English antiquary who was well known for his 1795 compilation of the Robin Hood legend.  After a visit to France in 1791, he became a staunch supporter of the ideals of the French Revolution. He was also an influential vegetarianism activist.\n\n", "link_mentions": [{"page": "Robin Hood", "response": ["In 1795, Joseph Ritson published an enormously influential edition of the Robin Hood ballads Robin Hood: A collection of all the Ancient Poems Songs and Ballads now extant, relative to that celebrated Outlaw.Bewick, et al. Robin Hood : a Collection of All the Ancient Poems, Songs, and Ballads, Now Extant Relative to That Celebrated English Outlaw; to Which Are Prefixed Historical Anecdotes of His Life / by Joseph Ritson. 2nd ed., W. Pickering, 1832, online at State Library of New South Wales, DSM/821.04/R/v. 11887 reprint, publisher J.C. Nimmo, https://archive.org/details/robinhoodcollect01ritsrich  accessed 18 January 2016, digitized 2008 from book provided by University of California Libraries. 'By providing English poets and novelists with a convenient source book, Ritson gave them the opportunity to recreate Robin Hood in their own imagination,'Dobson and Taylor (1997), p.  54. Ritson's collection included the Gest and put the Robin Hood and the Potter ballad in print for the first time. The only significant omission was Robin Hood and the Monk which would eventually be printed in 1806. In all, Ritson printed 33 Robin Hood ballads In his table of contents, he separated the longer ballads from the shorter ballads into two parts; Part 1 containing the longer ballads were numbered I-V while the shorter ballads in Part 2 were numbered I-XXVIII (and a 34th, now commonly known as Robin Hood and the Prince of Aragon that he included as the second part of Robin Hood Newly Revived which he had retitled “Robin Hood and the Stranger”).Ritson, ‘’ Robin Hood: A collection of all the Ancient Poems Songs and Ballads now extant, relative to that celebrated Outlaw’’. p. 155, 1820 edition. Ritson's interpretation of Robin Hood was also influential, having influenced the modern concept of stealing from the rich and giving to the poor as it exists today.J.C. Holt, Robin Hood, 1982, pp. 184, 185Robin Hood, Volume 1, Joseph Ritson Himself a supporter of the principles of the French Revolution and admirer of Thomas Paine, Ritson held that Robin Hood was a genuinely historical, and genuinely heroic, character who had stood up against tyranny in the interests of the common people."]}, {"page": "1752", "response": ["** Joseph Ritson, English antiquary (d. 1803)"]}, {"page": "1803", "response": ["* September 23 – Joseph Ritson, English antiquary (b. 1752)"]}, {"page": "Fairy tale", "response": ["* Fairy Tales, Now First Collected: To Which are Prefixed Two Dissertations: 1. On Pygmies. 2. On Fairies (England, 1831) by Joseph Ritson"]}, {"page": "Fairy", "response": ["* Joseph Ritson, Fairy Tales, Now First Collected: To which are prefixed two dissertations: 1. On Pygmies. 2. On Fairies, London, 1831"]}, {"page": "London Corresponding Society", "response": ["Paine subscribed to the Society; as did the radical poet William Blake; Joseph Ritson the noted antiquarian and founder of modern vegetarianism; and Basil William Douglas, Lord Daer, who held concurrent membership of the Society for Constitutional Information and the Scottish Association of the Friends of the People.", "* Joseph Ritson "]}, {"page": "1795 in literature", "response": ["*Joseph Ritson (ed.) – Robin Hood: A Collection of all the Ancient Poems"]}, {"page": "1782 in literature", "response": ["*Joseph Ritson – Observations on the Three First Volumes of the History of English Poetry (on Thomas Warton)"]}, {"page": "1783 in literature", "response": ["*Joseph Ritson – A Select Collection of English Songs"]}, {"page": "Tom Thumb", "response": ["In the mid-18th century, books began appearing specifically for children, and Tom was cited as the author of titles such as Tommy Thumb's Song Book (1744) and Tommy Thumb's Little Story Book (c. 1760). In 1791, Joseph Ritson remarked that Tom's popularity was known far and wide: \"Every city, town, village, shop, stall, man, woman, and child, in the kingdom, can bear witness to it.\""]}, {"page": "John Lydgate", "response": ["His short poems tend to be the best; as he grew older his poems grew progressively longer, and it is regarding Lydgate's later poetry that Joseph Ritson's harsh characterization of him is based: 'A voluminous, prosaick and drivelling monk'. Similarly, one twentieth-century historian has described Lydgate's verse as \"banal\".Wolffe, B. P. (2001). Henry VI. Yale Monarchs (repr. ed.). London: Yale University Press., p.312"]}, {"page": "Stockton-on-Tees", "response": ["* Joseph Ritson, literary critic and editor"]}, {"page": "English folk music", "response": ["In the 18th century there were increasing numbers of collections of what was now beginning to be defined as \"folk\" music, strongly influenced by the Romantic movement, including Thomas D'Urfey's Wit and Mirth: or, Pills to Purge Melancholy (1719–20) and Bishop Thomas Percy's Reliques of Ancient English Poetry (1765). The last of these also contained some oral material and by the end of the 18th century this was becoming increasingly common, with collections including Joseph Ritson's, The Bishopric Garland (1784), which paralleled the work of figures like Robert Burns and Walter Scott in Scotland."]}, {"page": "Edmond Malone", "response": ["The years from 1783 to 1790 were devoted to Malone's own edition of Shakespeare in multiple volumes, of which his essays on the history of the stage, his biography of Shakespeare, and his attack on the genuineness of the three parts of Henry VI, were especially valuable. His editorial work was lauded by Burke, criticised by Walpole and damned by Joseph Ritson. It certainly showed indefatigable research and proper respect for the text of the earlier editions."]}, {"page": "Barghest", "response": ["*Joseph Ritson, Fairy Tales (Lond. 1831), p. 58; Lancashire Folklore (1867)"]}, {"page": "John Pinkerton", "response": ["In 1781, Pinkerton moved to London, where his full career as a writer began in earnest, publishing in the same year a volume of Rimes of no great merit, and Scottish Tragic Ballads. These were followed in 1782 by Two Dithyrambic Odes on Enthusiasm and Laughter, and by a series of Tales in Verse. Under the title of Select Scottish Ballads he reprinted in 1783 his tragic ballads, with a supplement comprising Ballads of the Comic Kind. Joseph Ritson pointed out in 1784 that the so-called ancient ballads were some of them of modern date, and Pinkerton admitted that he was the author of the second part of Hardy Kanute and part-author of some others. He published an Essay on Medals in 1784, and in 1785, under the pseudonym of \"Robert Heron\", his bold but eccentric Letters of Literature depreciating the classical authors of Greece and Rome. In 1786 he edited Ancient Scottish Poems from the manuscript collections of Sir Richard Maitland of Lethington. It was succeeded in 1787 by a compilation, under the new pseudonym of \"H. Bennet\" entitled The Treasury of Wit, and by his first important historical work, the Dissertation on the Origin and Progress of the Scythians or Goths, to which Gibbon acknowledged himself indebted.", "To this end he set his energy to collecting and creating older Anglo-Scottish literature. This was all the more important as far as his agenda was concerned because of the \"Celtomania\" produced by the Ossian poems of James Macpherson. Many such works had been invented by Pinkerton. His \"ancient\" Anglo-Scottish tale of Hardyknute had in fact only been composed in 1719 by Lady Wardlaw of Pitreavie. Pinkerton subsequently invented a sequel to this epic, but after he was exposed by Joseph Ritson, he admitted to the forgery."]}, {"page": "Maeatae", "response": ["As for the tribes themselves Dio also quoted by Joseph Ritson and others describes them in detail although some of the descriptions look suspicious to the modern eye. John Rhys seems convinced that they occupied the land between the Firth of Forth and the Firth of Tay or parts of what is now Clackmannanshire, Fife and Stirlingshire. He also suggests that the Isle of May might derive its name from the tribe. Dio mentions the Maeatae were between the wall and the Caledonians but there is some dispute over whether he is referring to Antonine's Wall or Hadrian's Wall. Alexander del Mar says no-one really knows the identity of the Maeatae but he mentions that some authorities think they may have had a Norse origin.", "In 210 AD they began a serious revolt against the Roman Empire which was reportedly a very bloody affair on both sides. Another revolt took place the following year. In 213 AD, Joseph Ritson records them receiving money from the Romans to keep the peace."]}, {"page": "English folk music (1500–1899)", "response": ["* 1788: Yorkshire Garland, republished in 1809 by Joseph Ritson (1752–1803) ", "* 1793: Northumberland Garland, republished in 1809 by Joseph Ritson (1752–1803)"]}, {"page": "Category talk:English historians", "response": ["List of all pages in category English historians retrieved by PockBot.PockBot is currently Undergoing Trials. If you have any comments on its performance please leave them at Wikipedia:Bots/Requests_for_approval/PockBotArticleClass / StatusPeter Ackroydnot yet classifiedHarold Actonnot yet classifiedJohn Dalberg-Acton, 1st Baron Actonnot yet classifiedAethelweardnot yet classifiedGrace Aguilarnot yet classifiedLucy Aikinnot yet classifiedAilred of Rievaulxnot yet classifiedGeoffrey Aldermannot yet classifiedSir Archibald Alisonnot yet classifiedAndrew Allamnot yet classifiedGeorge Allan (antiquary)not yet classifiedWilliam Edward David Allennot yet classifiedAlured of Beverleynot yet classifiedJames Pettit Andrewsnot yet classifiedWilliam Archer (critic)not yet classifiedGeoffrey Ashenot yet classifiedHarold Brakspearnot yet classifiedRichard Baker (chronicler)not yet classifiedJohn Baker (legal historian)not yet classifiedAdolphus Ballardnot yet classifiedJoshua Barnesnot yet classifiedCorrelli BarnettStartHugh Bichenonot yet classifiedRobert Blake, Baron Blakenot yet classifiedWilliam Henry Blissnot yet classifiedRichard Bonneynot yet classifiedGerald Brenannot yet classifiedFrancis Brinkleynot yet classifiedOscar Browningnot yet classifiedKevin Brownlownot yet classifiedHenry Thomas Bucklenot yet classifiedJames Burneynot yet classifiedWilliam Camdennot yet classifiedJohn Capgravenot yet classifiedEdward Cardwellnot yet classifiedGeorge Carewnot yet classifiedThomas Cartenot yet classifiedPaul Cartledgenot yet classifiedChristopher Catherwoodnot yet classifiedWilliam Cavenot yet classifiedHector Munro Chadwicknot yet classifiedOwen Chadwicknot yet classifiedAllan Chapmannot yet classifiedWinston Churchill14px GAEdward Hyde, 1st Earl of Clarendonnot yet classifiedAlan Clarknot yet classifiedKenneth Clarknot yet classifiedBob Clarke (historian)not yet classifiedRobert Conquestnot yet classifiedCharles Henry Coopernot yet classifiedWilliam Coxenot yet classifiedMandell Creightonnot yet classifiedAndrew Dalbynot yet classifiedSamuel Danielnot yet classifiedBasil Davidsonnot yet classifiedGodfrey Daviesnot yet classifiedChristopher Dawsonnot yet classifiedGoldsworthy Lowes Dickinsonnot yet classifiedDavid Diringernot yet classifiedJohn Andrew Doylenot yet classifiedWilliam Dugdalenot yet classifiedAlfred Duggannot yet classifiedThomas Henry Dyernot yet classifiedBryan Edwardsnot yet classifiedLeonard Elliott Elliot-Binnsnot yet classifiedThomas Elmhamnot yet classifiedGeorge Finlaynot yet classifiedMoses I. Finleynot yet classifiedPercy Hethrington Fitzgeraldnot yet classifiedRobin Lane Foxnot yet classifiedJames Anthony Froudenot yet classifiedFrancis Aidan Cardinal Gasquetnot yet classifiedGeoffrey the Bakernot yet classifiedEdward GibbonStartMartin Gilbertnot yet classifiedRobert Gildeanot yet classifiedMary Anne Everett Greennot yet classifiedVivian H. H. Greennot yet classifiedHenry Melvill Gwatkinnot yet classifiedE. E. Y. Halesnot yet classifiedEdward Hallnot yet classifiedHenry Hallamnot yet classifiedJohn Hardyngnot yet classifiedEdward Hastednot yet classifiedPeter Hennessynot yet classifiedHenry of Huntingdonnot yet classifiedChristopher Hibbertnot yet classifiedAndrew Hignellnot yet classifiedChristopher Hill (historian)not yet classifiedHarry Hinsleynot yet classifiedPatricia Hollis, Baroness Hollis of Heighamnot yet classifiedJ. C. Holtnot yet classifiedW. G. Hoskinsnot yet classifiedWilliam Howittnot yet classifiedBettany Hughesnot yet classifiedWilliam Hutton (Birmingham historian)not yet classifiedDavid Irvingnot yet classifiedCatherine Jacksonnot yet classifiedJohn Heneage Jessenot yet classifiedJohn S. Conwaynot yet classifiedJohn of Hexhamnot yet classifiedJohn Jortinnot yet classifiedJohn Keaynot yet classifiedIan Kershawnot yet classifiedAlexander William Kinglakenot yet classifiedHenry Knightonnot yet classifiedRichard Knollesnot yet classifiedPeter Laslettnot yet classifiedBernard Lewisnot yet classifiedJohn Lingardnot yet classifiedCatherine Macaulaynot yet classifiedThomas Babington Macaulay, 1st Baron Macaulaynot yet classifiedDiarmaid MacCullochnot yet classifiedJohn Maddicottnot yet classifiedHenry James Sumner Mainenot yet classifiedFrederic William Maitlandnot yet classifiedNoel Malcolmnot yet classifiedGeorge Bruce Mallesonnot yet classifiedTheodore Augustine Mannnot yet classifiedThomas Maynot yet classifiedCharles Merivalenot yet classifiedWilliam Nassau Molesworthnot yet classifiedPhilip Morantnot yet classifiedJames Augustus Cotter Morisonnot yet classifiedLewis Bernstein Namiernot yet classifiedJohn Julius Norwichnot yet classifiedDimitri Obolenskynot yet classifiedRichard Ollardnot yet classifiedRobin Osbornenot yet classifiedHenry Nutcombe Oxenhamnot yet classifiedFrancis Palgravenot yet classifiedMatthew Parisnot yet classifiedC. Northcote Parkinsonnot yet classifiedMichael Pearsonnot yet classifiedLiza Picardnot yet classifiedCharles Plummernot yet classifiedAlbert Pollardnot yet classifiedFrederick York Powellnot yet classifiedF. M. Powickenot yet classifiedJohn Prebblenot yet classifiedH. F. M. Prescottnot yet classifiedAnthony Preston (naval historian)not yet classifiedJames Rennellnot yet classifiedRicardian (Richard III)not yet classifiedRichard of Hexhamnot yet classifiedAndrew Robertsnot yet classifiedMichael Roberts (historian)not yet classifiedJohn C. G. Röhlnot yet classifiedFrederick Rolfenot yet classifiedJohn Holland Rosenot yet classifiedEmma Georgina Rothschildnot yet classifiedMichael Ernest Sadlernot yet classifiedJohn Saltmarshnot yet classifiedDominic Sandbrooknot yet classifiedNigel Saulnot yet classifiedSimon Schamanot yet classifiedJohn Robert Seeleynot yet classifiedMartin Sharp (journalist)not yet classifiedJane Shawnot yet classifiedWalter Sichelnot yet classifiedRaleigh Ashlin Skeltonnot yet classifiedDavid Smith (historian)not yet classifiedRichard Southernnot yet classifiedGeorge Speaightnot yet classifiedJohn Spelmannot yet classifiedDavid Starkeynot yet classifiedLawrence Stonenot yet classifiedAgnes Stricklandnot yet classifiedJohn Strypenot yet classifiedWilliam Stubbsnot yet classifiedRichard Talbertnot yet classifiedWilliam Woodthorpe Tarnnot yet classifiedAlasdair and Hettie Taylernot yet classifiedA. J. P. Taylornot yet classifiedArnold Fitz Thedmarnot yet classifiedConnop Thirlwallnot yet classifiedThomas Wykesnot yet classifiedE. P. Thompsonnot yet classifiedEmma Elizabeth Thoytsnot yet classifiedH. W. Timperleynot yet classifiedHugh Tootellnot yet classifiedJoshua Toulminnot yet classifiedMichael Trappes-Lomaxnot yet classifiedG. M. Trevelyannot yet classifiedSir George Trevelyan, 2nd Baronetnot yet classifiedHugh Trevor-Roper, Baron Dacre of Glantonnot yet classifiedAndrew White Tuernot yet classifiedSharon Turnernot yet classifiedKenneth Turpinnot yet classifiedRobert Vaughannot yet classifiedOrderic Vitalisnot yet classifiedAndrew Wallace-Hadrillnot yet classifiedSpencer Walpolenot yet classifiedAdolphus William Wardnot yet classifiedVeronica Wedgwoodnot yet classifiedJohn Wheeler-Bennettnot yet classifiedThomas Abingtonnot yet classifiedArthur Agardenot yet classifiedJohn Yonge Akermannot yet classifiedAnthony Allennot yet classifiedJohn Anstisnot yet classifiedJohn Anstis, youngernot yet classifiedElias Ashmolenot yet classifiedJohn Aubreynot yet classifiedJoseph Ayloffenot yet classifiedThomas Baker (antiquarian)not yet classifiedChristopher Barkernot yet classifiedDaines Barringtonnot yet classifiedJohn Thomas Blightnot yet classifiedMatthew Bloxamnot yet classifiedWilliam Copeland Borlasenot yet classifiedJohn Brandnot yet classifiedEdward Wedlake Brayleynot yet classifiedWilliam Bright, D.D.not yet classifiedJohn Britton (antiquary)not yet classifiedGeorge Bucknot yet classifiedWilliam Bullock (collector)not yet classifiedRichard Burnnot yet classifiedRichard Carewnot yet classifiedRichard Chandlernot yet classifiedSimonds d'Ewesnot yet classifiedJohn Evans (archaeologist)not yet classifiedLewis Evans (collector)not yet classifiedFrederick William Fairholtnot yet classifiedThomas Dudley Fosbrokenot yet classifiedAugustus Wollaston Franksnot yet classifiedJohn Frerenot yet classifiedRichard Gough (antiquarian)not yet classifiedEdwin Guestnot yet classifiedJohn Guillimnot yet classifiedRobert Stephen Hawkernot yet classifiedThomas Hearnenot yet classifiedJoseph Hunternot yet classifiedKenneth Hamilton Jenkinnot yet classifiedJohn Battelynot yet classifiedWilliam Lambardenot yet classifiedAshton Levernot yet classifiedCharles Herbert Mayonot yet classifiedWilliam Nicolsonnot yet classifiedWilliam Oldysnot yet classifiedFrancis Pecknot yet classifiedMargaret Bentinck, Duchess of Portlandnot yet classifiedJames Prinsepnot yet classifiedGerald Henry Rendallnot yet classifiedJoseph Ritsonnot yet classifiedJohn Seldennot yet classifiedCharles Hamilton SmithStubHenry Spelmannot yet classifiedJohn Stownot yet classifiedWilliam Stukeleynot yet classifiedMerlin Hanbury-Tracy, 7th Baron Sudeleynot yet classifiedJohn Timbsnot yet classifiedRoger Twysdennot yet classifiedGeorge Vertuenot yet classifiedJohn Weevernot yet classifiedAnthony Woodnot yet classifiedThomas Wrightnot yet classifiedJohn Aylmer (English constitutionalist)not yet classifiedWalter Bagehotnot yet classifiedA. V. Diceynot yet classifiedGeoffrey Rudolph Eltonnot yet classifiedStephen Gardinernot yet classifiedJohn Hooker (English constitutionalist)not yet classifiedJames I of Englandnot yet classifiedErskine May, 1st Baron Farnboroughnot yet classifiedWilliam Stoughton (English constitutionalist)not yet classifiedEdward Aglionbynot yet classifiedEdward Bellasisnot yet classifiedWalter Blountnot yet classifiedJohn Brooke-Littlenot yet classifiedWilliam Brugesnot yet classifiedSamuel Egerton Brydgesnot yet classifiedBernard Burkenot yet classifiedAlfred Butlernot yet classifiedClive Cheesmannot yet classifiedPeter Wilson Coldhamnot yet classifiedRodney Dennysnot yet classifiedGilbert Dethicknot yet classifiedWilliam Dethicknot yet classifiedAlan Dickinsnot yet classifiedPatric Laurence Dickinsonnot yet classifiedArthur Charles Fox-Daviesnot yet classifiedJames Frerenot yet classifiedRichard Graham-Viviannot yet classifiedEverard Greennot yet classifiedPeter Gwynn-Jonesnot yet classifiedIsaac Heardnot yet classifiedCecil Humphery-Smithnot yet classifiedWilliam Hunt (officer of arms)not yet classifiedThomas Joseph-Watkinnot yet classifiedGregory Kingnot yet classifiedHenry Lane (officer of arms)not yet classifiedEdmund Lodgenot yet classifiedRoger Machado (officer of arms)not yet classifiedMichael Maclagannot yet classifiedHenry Robert Charles Martinnot yet classifiedRobin de la Lanne-Mirrleesnot yet classifiedNicholas Harris Nicolasnot yet classifiedPeter O'Donoghuenot yet classifiedHenry Paston-Bedingfeldnot yet classifiedJohn Philipotnot yet classifiedLeslie Pinenot yet classifiedJames Planchénot yet classifiedArchibald Russellnot yet classifiedAlfred Scott-Gattynot yet classifiedWilfrid Scott-Gilesnot yet classifiedRichard St Georgenot yet classifiedFrancis Thynnenot yet classifiedAubrey Toppinnot yet classifiedCharles Townley (officer of arms)not yet classifiedWilliam Barclay Turnbullnot yet classifiedArthur Vicarsnot yet classifiedAnthony Wagnernot yet classifiedJohn Walker (officer of arms)not yet classifiedJohn Warburton (officer of arms)not yet classifiedDavid White (officer of arms)not yet classifiedCharles Wriothesleynot yet classifiedThomas Wriothesleynot yet classifiedJohn Writhenot yet classifiedLionel Barnettnot yet classifiedRichard Francis Burtonnot yet classifiedJoseph Dacre Carlylenot yet classifiedBasil Hall Chamberlainnot yet classifiedDuncan Forbesnot yet classifiedNathaniel Brassey Halhednot yet classifiedThomas Hydenot yet classifiedWilliam Jones (philologist)not yet classifiedEdward William Lanenot yet classifiedSamuel Leenot yet classifiedWilliam Marsden (orientalist)not yet classifiedReynold A. Nicholsonnot yet classifiedE. A. Wallis Budgenot yet classifiedCharles Wilkinsnot yet classifiedEdit by PockBot (on behalf of PocklingtonDan)"]}, {"page": "Rookhope", "response": ["The Rookhope Ride  is a border ballad rescued and noted down by Joseph Ritson from the chanting of George Collingwood of Boltsburn near Rookhope about 1785. The date of the action (a raid) is precise: 6 December 1569, when robbers from Tynedale made a foray into Weardale."]}, {"page": "Broadside ballad", "response": ["Most of the knowledge of broadsides in England comes from the fact that several significant figures chose to collect them, including Samuel Pepys (1633–1703), Robert Harley, 1st Earl of Oxford and Mortimer (1661–1724), in what became  Roxburghe Ballads.B. Sweers, Electric Folk: The Changing Face of English Traditional Music (Oxford University Press, 2005), p. 45. In the eighteenth century there were several printed collections, including Thomas D'Urfey's Wit and Mirth: or, Pills to Purge Melancholy (1719–20), Bishop Thomas Percy's Reliques of Ancient English Poetry (1765), and Joseph Ritson's, The Bishopric Garland (1784). In Scotland similar work was undertaken by figures including Robert Burns and Walter Scott in Minstrelsy of the Scottish Border (1802–03). One of the largest collections was made by Sir Frederick Madden who collected some 30,000 songs now in the 'Madden Collection' in the Cambridge University Library Publisher’s Introduction: Madden Ballads From Cambridge University Library. Contemporary broadside ballad singers are Tom Paxton, Pete Seeger, Leonard Cohen, Graeme Allwright, and Phil Ochs.Ochs, Phil (August 12, 1967). \"It Ain't Me, Babe\". The Village Voice."]}, {"page": "Reliques of Ancient English Poetry", "response": ["Percy did not treat the folio nor the texts in it with the scrupulous care expected of a modern editor of manuscripts.  He wrote his own notes directly on the folio pages, emended the rhymes and even pulled pages out of the document to give to the printer without making copies.W.P. Ker, in The Cambridge History of English Literature, vol. 10, 1913:232ff.  He was criticised for these actions even at the time, most notably by Joseph Ritson, a fellow antiquary.  The folio he worked from seems to have been written by a single copyist and errors such as pan and wale for wan and pale needed correcting."]}, {"page": "There was an Old Woman Who Lived in a Shoe", "response": ["The earliest printed version in Joseph Ritson's Gammer Gurton's Garland in 1794 has the coarser last line:"]}, {"page": "The Fox (folk song)", "response": ["In Joseph Ritson's Gammer Gurton's Garland (1810), the song is recorded (under the name \"Dame Widdle Waddle\") thus:"]}, {"page": "Minstrelsy of the Scottish Border", "response": ["James Hogg's mother Margaret was outraged by the Minstrelsy, and is said to have told him that the ballads she had recited for him \"war made for singing an' no for reading; but ye hae broken the charm now, an' they'll never be sung mair\".  But others saw the book very differently.  Scott received congratulatory letters from delighted literary figures such as George Ellis, Anna Seward, and George Chalmers, and even from the notoriously prickly antiquaries John Pinkerton and Joseph Ritson.  Reviews of the Minstrelsy were also in general enthusiastic.  The Scots Magazine said that it would \"attract the attention of men of literature, not only in Scotland, but in every country which has preserved a taste for poetical antiquities, and popular poetry\".  It admired the notes, and ranked the work alongside Percy's Reliques.  The British Critic praised the \"taste and learning\" displayed in this \"elegant collection\".  The Edinburgh Review thought the Minstrelsy \"highly interesting and important to literature\", and found much to praise in Scott's notes, not to mention Ballantyne's printing.  Poetical merit, it judged, \"is here attained in a very eminent degree\", while warning that \"We are not...to view these poems as...highly-polished and elaborate specimens of art; but as exhibiting the true sparks and flashes of individual nature\".  Only the critic in the Monthly Review dissented.  He had little time for rude and unpolished Scottish ballads, protested that \"the taste of the age calls for models more correct and refined\", and lamented that \"it was decreed that Mr. Scott should publish these volumes, and that Reviewers should be doomed to read them\".  But even he admired the section of Imitations, praised the \"fidelity, taste and learning\" displayed in the editing, and admitted that the notes throw some light on the country's history."]}, {"page": "1795 in poetry", "response": ["* Joseph Ritson, editor, Robin Hood: A Collection of all the Ancient Poems"]}, {"page": "1803 in poetry", "response": ["* September 23 – Joseph Ritson (born 1752), English antiquary and anthologist"]}, {"page": "1802 in poetry", "response": ["* Joseph Ritson, Ancient English Metrical Romances"]}, {"page": "I syng of a mayden", "response": ["In 1836, Thomas Wright suggested that, although his fellow antiquarian Joseph Ritson had dated the manuscript from the reign of Henry V of England (1387–1422), he personally felt that although \"its greatest antiquity must be included within the fifteenth century\", some lyrics contained within may be of an earlier origin.Thomas Wright, Songs and carols printed from a manuscript in the Sloane collection in the British museum (London: W. Pickering, 1836), vi Wright speculated, on the basis of the dialect of Middle English, that the lyrics probably originated in Warwickshire, and suggested that a number of the songs were intended for use in mystery plays. More recent analysis of the manuscript places the dialect as being of East Anglian original and more specifically Norfolk; two further carol MSS from the county contain duplicates from Sloane 2593.Palti, K.R.; (2008) ‘Synge we now alle and sum’: three Fifteenth-Century collections of communal song: a study of British Library, Sloane MS 2593; Bodleian Library, MS Eng. poet. e.1; and St John’s College, Cambridge, MS S.54. Doctoral thesis, UCL (University College London), 104  However, \"I syng of a mayden\" is a unique instance of this lyric."]}, {"page": "1794 in poetry", "response": ["* Joseph Ritson, Scottish Song, anthology"]}, {"page": "1793 in poetry", "response": ["* Joseph Ritson, The English Anthology, anthology"]}, {"page": "1783 in poetry", "response": ["* Joseph Ritson, editor, A Select Collection of English Songs, anthology"]}, {"page": "List of nursery rhymes", "response": ["The term \"nursery rhyme\" emerged in the third decade of the nineteenth century although this type of children's literature previously existed with different names such as Tommy Thumb Songs and Mother Goose Songs. The first known book containing a collection of these texts was Tommy Thumb's Pretty Song Book, which was written by H. Cooper and was published in 1744. The works of several scholars and collectors helped document and preserve these oral traditions as well as their histories. These include Iona and Peter Opie, Joseph Ritson, James Orchard Halliwell, and Sir Walter Scott."]}, {"page": "1752 in poetry", "response": ["* October 2 – Joseph Ritson (died 1803), English writer and antiquary"]}, {"page": "Vita Merlini", "response": ["By the beginning of the 19th century the Vita Merlini had been rediscovered by the antiquary Joseph Ritson, who sent his own manuscript copy of the poem to Walter Scott and planned to produce an edition of it himself.  This project never came to fruition, but Scott's friend George Ellis included a thirteen-page detailed synopsis of the Vita in his Specimens of Early English Metrical Romances (1805).  The published editions are as follows:"]}, {"page": "History of vegetarianism", "response": ["In 1802, Joseph Ritson authored An Essay on Abstinence from Animal Food, as a Moral Duty.Spencer, Colin. (1995). The Heretic's Feast: A History of Vegetarianism. University Press of New England. pp. 233-234.  Reverend William Cowherd founded the Bible Christian Church in 1809. He advocated vegetarianism as a form of temperance, and his organisation was one of the philosophical forerunners of the Vegetarian Society. Martha Brotherton authored Vegetable Cookery, the first vegetarian cookbook, in 1812.Antrobus, Derek. (1997). A Guiltless Feast: The Salford Bible Christian Church and the Rise of the Modern Vegetarian Movement. City of Salford Education and Leisure. p. 72. Phelps, Norm. (2007). The Longest Struggle: Animal Advocacy from Pythagoras to PETA. Lantern Books. p. 149. "]}, {"page": "1795 in Great Britain", "response": ["* Joseph Ritson's edition Robin Hood: a collection of all the ancient poems, songs and ballads now extant, relative to that celebrated outlaw."]}]}}