{"wiki_id": "http://www.wikidata.org/entity/Q6281389", "itemLabel": "Joseph Batten", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Batten", "wikipedia_page": {"main": "Joseph Hallet Batten FRS (25 August 1778, Penzance – 11 October 1837, Brighton) was principal of the East India Company College.The Batten family were for some time the leading merchants of Penzance. Batten was educated at St Paul's School in London, Truro Grammar School, and Trinity College, Cambridge. He became a fellow of Trinity in 1801.Batten became Professor of Classical Literature at the East India Company College on its opening in 1805. He married Catherine Maxwell on 4 July 1807. They lived at Hertingfordbury with their children, until Batten was appointed Principal (Master) of the college on 18 January 1815. Soon afterwards, he was made Doctor of Divinity by royal mandate. He was elected a Fellow of the Royal Society in 1816.\nHe lived with his family at the Master's Lodge of the college, until he became disabled shortly before his death.\n\n", "link_mentions": [{"page": "1778", "response": ["* August 25 – Joseph Batten, British college principal (d. 1837)"]}, {"page": "East India Company College", "response": ["*1815–1837: Joseph Batten ", "* Death record of Joseph Batten"]}, {"page": "Strachey", "response": ["******John Strachey (civil servant) (1823–1907), fifth son of Edward Strachey (1774–1832) and younger brother of the 3rd baronet; served as an administrator in India. He married Katherine, daughter of Joseph Batten, principal of the East India Company College and had eight children, including:"]}, {"page": "John Strachey (civil servant)", "response": ["Strachey married Katherine Batten, daughter of Joseph Batten, Principal of the East India Company College, on 9 October 1856,Descent and Alliances of Croslegh et. al. by Charles Croslegh, privately printed at The De La More Press, London, 1904 pp.330–3  and they had eight children. They included Sir Arthur Strachey (1858–1901), judge in India. Their daughter Winifred married Hugh Shakespear Barnes."]}, {"page": "Batten (surname)", "response": ["* Joseph Batten, English academic administrator."]}, {"page": "Truro Cathedral School", "response": ["*Joseph Batten DD FRS (1778–1837), principal of the East India Company CollegePatricia James, Population Malthus: his life and times (2006), p. 229"]}, {"page": "Henry Walter (antiquary)", "response": ["On 7 May 1821 Walter was instituted as rector of Hazelbury Bryan in Dorset, on the presentation of the Duke of Northumberland. He held his two positions together until 1830. Michael Pakenham Edgeworth, a pupil at the College right at the end of Walter's time there, reported home in letters that Walter had the nickname \"Bobby\". He also found him anti-Catholic, as were colleagues including Joseph Batten and Charles Webb Le Bas."]}, {"page": "Joseph Hallet Batten", "response": ["#REDIRECT Joseph Batten"]}, {"page": "Joseph Hallett Batten", "response": ["#REDIRECT Joseph Batten"]}, {"page": "Batten, Joseph", "response": ["#redirectJoseph Batten"]}]}}