{"wiki_id": "http://www.wikidata.org/entity/Q6290114", "itemLabel": "Joshua Parlby", "itemDescription": "English football manager", "wikipedia_url": "https://en.wikipedia.org/wiki/Joshua_Parlby", "wikipedia_page": {"main": "Joshua Parlby (1855 in Longton, Staffordshire – ?) was an English football manager who managed Manchester City in the 1890s.\nDetails of Parlby's life before he moved to Manchester are unclear, though some sources indicate he played for Stoke in the pre-professional era. Parlby moved to Manchester to run a public house. His links with the brewing trade led to a role on the committee of Ardwick Association Football Club, who used a public house, the Hyde Road Hotel, as their headquarters. Parlby advocated employing a full-time secretary-manager, and in 1893 became the club's first paid secretary. A larger than life character, Parlby had a reputation for wrangling the club out of financial trouble by whatever means possible. Contemporary accounts tell of him sneaking players onto trains when the club struggled to afford travel expenses for away matchesAt the end of Parlby's first season as manager Ardwick finished thirteenth in the Second Division, and were required to seek re-election to the league. Believing the club needed to establish an identity capable of appealing to all Mancunians, Parlby was an influential figure in the reformation of Ardwick as Manchester City in 1894, and the subsequent success in achieving re-election to the league.Parlby managed the club for one more season, in which they finished ninth. He returned to the pub trade in 1895, but retained a role on the club committee for several years.", "link_mentions": [{"page": "Billy Meredith", "response": ["Meredith's performances for Northwich gained the attention of several other clubs in the Football League. Bolton Wanderers full-back Di Jones, a former Chirk player, spoke with him about a possible move, but Bolton secretary J.J. Bentley felt Meredith was too inexperienced and his frame too slight. Lawrence Furniss, an official at Ardwick, had first noticed him while refereeing a Northwich match. Meredith also played in both meetings between the clubs that season. Later in 1894, Ardwick, by then known as Manchester City, vigorously pursued Meredith's signature. Two club officials travelled to Wales to meet the player. One was secretary-manager Joshua Parlby, the other either Furniss or chairman John Chapman. The pair were met with suspicion. Anecdotes by contemporary figures suggest they were initially chased away by locals, and were only allowed to speak to Meredith after they bought drinks for his mining colleagues. Meredith did not wish to abandon life in Chirk. His mother was particularly against the idea: \"It is all very well for you gentlemen to leave your big cities and come to our villages to steal our boys away ... Our boys are happy and healthy, satisfied with their work and innocent amusements ... if Billy takes my advice he will stick to his work and play football for his own amusement when work is finished.\" Meredith did eventually sign for Manchester City, but as an amateur. He continued to work at the pit for at least a year, commuting back and forth for matches."]}, {"page": "List of Manchester City F.C. managers", "response": ["In the era before league football, the position of manager involved many secretarial duties, such as arranging fixtures and the upkeep of the club's ground. Few accounts of the club's off-field affairs in the 1880s survive, and it is unclear who managed the club (then known as West Gorton (St. Marks)) between 1882 and 1884. p233 The club's earliest managers were also players; the first three known managers (Frederick Hopkinson, Edward Kitchen and Walter Chew) all played in West Gorton's first recorded match in 1880.Manchester City – The Complete Record, p20 By 1889 the club had moved to Hyde Road and renamed itself Ardwick A.F.C. Under the management of Lawrence Furniss, the club joined the Football League in 1892 as founder members of the Second Division. Furniss became chairman a year later, and he and his successor as secretary-manager Joshua Parlby were responsible for Ardwick reforming as Manchester City F.C. in 1894.Manchester City – The Complete Record, p234"]}, {"page": "Sam Ormerod", "response": ["In 1895 Ormerod was appointed manager of Manchester City, succeeding Joshua Parlby. In his first season in charge the club finished second in the Second Division, qualifying for the Test Matches, a nineteenth-century equivalent of the promotion play-offs. p235-6 The club won only one of their four test matches, and failed to gain promotion. The following season was less successful with a sixth-place finish for the club."]}, {"page": "Jos Parlby", "response": ["#REDIRECT Joshua Parlby"]}, {"page": "Josh Parlby", "response": ["#REDIRECT Joshua Parlby"]}]}}