{"wiki_id": "http://www.wikidata.org/entity/Q6290431", "itemLabel": "Josiah Boydell", "itemDescription": "with his uncle John he commissioned paintings (1752-1817)", "wikipedia_url": "https://en.wikipedia.org/wiki/Josiah_Boydell", "wikipedia_page": {"main": "Josiah Boydell (18 January 1752 – 27 March 1817) was a British publisher and painter, whose main achievement was the establishment of the Boydell Shakespeare Gallery with his uncle, John Boydell.", "link_mentions": [{"page": "John Boydell", "response": ["Boydell's business flourished and he soon hired his nephew, Josiah Boydell, to assist him. Boydell's biographer, Sven Bruntjen, hypothesizes that one of the reasons for Boydell's early and phenomenal success was his specialisation.  Unlike \"his competitors [who sold manuals, atlases and other assorted books] ... his [business had an] almost exclusive concentration on the sale of reproductive prints\".Bruntjen, 29–30. Bruntjen argues that \"despite the extensive sales of varied types of reproductive prints, it was the contemporary history print which accounted for the major part of Boydell's success as a print dealer\". Most notable among these was the Death of General Wolfe a 1770 painting by Benjamin West, engraved by Woollett for Boydell in 1776. As early as 1767, Boydell had stopped engraving prints himself and began exclusively relying on commissions and trades and it was from these that he profited.", "The idea of a grand Shakespeare edition was conceived at a dinner at Josiah Boydell's home in November 1786. The guest list itself is evidence of Boydell's extensive connections in the artistic world: Benjamin West, painter to King George III; George Romney, a renowned painter; George Nicol, bookseller to the king and painter; William Hayley, a poet; John Hoole, a scholar and translator of Tasso and Aristotle; and Daniel Braithwaite, an engineer. Most sources also list the painter Paul Sandby. Although the initial idea for the edition was probably not Boydell's, he was the one to seize and pursue it. He wanted to use the edition to facilitate the development of a British school of history painting.\"Preface\", Collection of Prints; see Friedman, 4–5; Merchant, 69.", "To illustrate the edition and to provide images for the folio, Boydell obtained the assistance of the most eminent painters and engravers of the day. Artists included Richard Westall, Thomas Stothard, George Romney, Henry Fuseli, Benjamin West, Angelica Kauffman, Robert Smirke, John Opie, and Boydell's nephew and business partner, Josiah Boydell. Among the engravers were Francesco Bartolozzi and Thomas Kirk.Pall Mall, North Side, Past Buildings. Boydell's relationships with his artists, particularly his illustrators, was generally congenial. James Northcote praised Boydell's liberal payments. He wrote in an 1821 letter that Boydell \"did more for the advancement of the arts in England than the whole mass of the nobility put together!  He paid me more nobly than any other person has done; and his memory I shall every hold in reverence\".Quoted in Hartmann, 61.", "Boydell's nephew and business partner, Josiah Boydell, continued his uncle's business for some time at 90 Cheapside, but by 1818, the business was wound up by Jane Boydell, and the assets purchased by Hurst, Robinson, and Co.", "*Collection of Prints, From Pictures Painted for the Purpose of Illustrating the Dramatic Works of Shakspeare, by the Artists of Great-Britain. London: John and Josiah Boydell, 1805."]}, {"page": "1817 in art", "response": ["*March 27 – Josiah Boydell, publisher and painter (born 1752)"]}, {"page": "1752 in art", "response": ["* January 18 – Josiah Boydell, British publisher and painter (died 1817)"]}, {"page": "1810s in Wales", "response": ["**27 March - Josiah Boydell, artist (b. 1752)"]}, {"page": "1752 in Great Britain", "response": ["**Josiah Boydell, painter and publisher (died 1817)"]}, {"page": "1750s in Wales", "response": ["*18 January - Josiah Boydell, painter (d. 1817)"]}, {"page": "1817 in Wales", "response": ["*27 March - Josiah Boydell, artist, 65Fagan, L.A., rev. Vivienne W. Painting. \"Josiah Boydell (1752–1817)\". Oxford Dictionary of National Biography. Oxford University Press. 2004. Retrieved on 17 January 2008. "]}, {"page": "George Nicol (bookseller)", "response": ["In 1787, Nicol moved his operations west to Pall Mall, purchasing 51 Pall Mall on 26 February 1787 and 58 Pall Mall the same year. He appears to have used No. 51 as his house, and No. 58 as his bookshop. (Later in 1787, John and Josiah Boydell took a lease on 52 Pall Mall for their Shakespeare Gallery.) In 1800, the business was renamed George and William Nicol, presumably to reflect the involvement of George's son. In about 1821, the business operations moved from 58 to 51 Pall Mall. After his father retired in 1825, William continued the business under both names until 1837, and under the name William Nicol alone from 1838 to 1855. From 1839 to 1855, William's business operated from premises at 60 Pall Mall.", "Nicol was married twice. Little is known of his first marriage, except that it produced a son, William. By the mid-1780s Nicol had developed a close friendship with the family of the engraver and publisher John Boydell. In November 1786, Nicol and John Boydell were among the dinner guests at the West Hampstead home of the engraver's nephew Josiah Boydell. This dinner was the genesis for the Boydells' Shakespeare Gallery project, in which Nicol became heavily involved. By Nicol's account (published many years later) the idea of an illustrated Shakespeare edition was at least partly his own, and something he had proposed unsuccessfully in his youth to David Garrick. Others, including the painter George Romney also later claimed to have proposed the idea.", "As well as Nicol's substantial involvement with Boydell's developing Shakespeare Gallery, he also embarked on a romance with Mary Boydell, niece of John and sister of the painter Josiah Boydell. Mary had previously toured Europe with her uncle and written an illustrated memoir of the trip. She was described as a beauty at the time and was sought after by several suitors."]}, {"page": "The Death of Nelson, 21 October 1805", "response": ["Only a month after Trafalgar, on 22 November, a press advert by the publisher Josiah Boydell announced he would give a prize of 500 guineas for the best \"Death of Nelson\" painting, which he would then engrave.  Devis and Benjamin West were the two most notable entrants.  Devis was released from debtors' prison to produce such a painting, in order to pay off his debts, and – possibly with the help of Alexander Davison (Nelson's banker and one of Devis's patrons) – was allowed to spend a week on board  off Portsmouth after her return from Trafalgar.Devis's Death of Nelson at the National Maritime Museum There he made sketches, a model of the place Nelson died, notes and studies for the individual portrait heads (including a sketch of Nelson's body and the bullet that had killed him, during the autopsy on 11 December by Dr William Beatty, the ship's surgeon, as the ship sailed from Portsmouth to the Nore for Nelson's lying-in-state), as well as a separate portrait of Dr Beatty.  Beatty also commissioned Devis to produce a half-length painting of Nelson as vice-admiral from the autopsy sketches, which he lent to Emma Hamilton (who later lost it in an accident whilst travelling), and illustrations for his Narratives."]}, {"page": "Boydell", "response": ["* Josiah Boydell (1752–1817), British publisher and painter"]}, {"page": "Boydell (name)", "response": ["* Josiah Boydell (1752–1817), English publisher and painter"]}, {"page": "Boydell Shakespeare Gallery", "response": ["The idea of a grand Shakespeare edition was conceived during a dinner at the home of Josiah Boydell (John's nephew) in late 1786.West, \"John Boydell\".  Five important accounts of the occasion survive.\"Preface\", Collection of Prints by Josiah Boydell; \"Advertisement\" for the illustrated edition by George Nicol; court documents after the collapse of the venture by Josiah Boydell; Joseph Farington's diary entry; biography of George Romney written by his son. For an analysis of the relative reliability of these sources, see Friedman. From these, a guest list and a reconstruction of the conversation have been assembled.  The guest list reflects the range of Boydell's contacts in the artistic world: it included Benjamin West, painter to King George III; George Romney, a renowned portrait painter; George Nicol, bookseller to the king; William Hayley, a poet; John Hoole, a scholar and translator of Tasso and Aristotle; and Daniel Braithwaite, secretary to the postmaster general and a patron of artists such as Romney and Angelica Kauffman. Most accounts also place the painter Paul Sandby at the gathering.Santaniello, 7.", "Boydell sought out the most eminent painters and engravers of the day to contribute paintings for the gallery, engravings for the folio, and illustrations for the edition. Artists included Richard Westall, Thomas Stothard, George Romney, Henry Fuseli, Benjamin West, Angelica Kauffman, Robert Smirke, James Durno, John Opie, Francesco Bartolozzi, Thomas Kirk, Henry Thomson, and Boydell's nephew and business partner, Josiah Boydell.", "Although the Boydells ended with 1,384 subscriptions,Lennox-Boyd, 46. the rate of subscriptions dropped, and remaining subscriptions were also increasingly in doubt.  Like many businesses at the time, the Boydell firm kept few records. Only the customers knew what they had purchased.Friedman, 68.  This caused numerous difficulties with debtors who claimed they had never subscribed or had subscribed for less.  Many subscribers also defaulted, and Josiah Boydell spent years after John's death attempting to force them to pay.", "| 41 || Josiah Boydell || Othello || 5.2 ||  ||", "| 115 || Josiah Boydell || Henry IV, Part 2 || 4.4 ||  ||", "| 117 || Josiah Boydell || Henry IV, Part 2 || 4.4 ||  ||", "| 119 || Josiah Boydell || Henry VI, Part 1 || 2.4 ||  ||", "| 146 || Josiah Boydell || Henry VI, Part 3 || 2.5 ||  ||", "| 150 || Josiah Boydell || Othello || 5.2 ||  ||", "| 165 || Josiah Boydell || Othello || 1.3 ||  ||", "* Henry IV, part 2, Act IV, scene 4 by Robert Thew after Josiah Boydell – Prince Henry Taking the Crown", "* Henry IV, part 2, Act IV, scene 4 by Robert Thew after Josiah Boydell – Prince Henry's Apology", "* Henry VI, part 1, Act II, scene 4 by John Ogborne after Josiah Boydell", "* Henry VI, part 3, Act II, scene 5 by John Ogborne after Josiah Boydell", "* Desdemona in Bed Asleep from Othello, Act V, scene 2, by William Satchwell Leney after Josiah Boydell", "* Act II, scene 4 by John Ogborne after Josiah Boydell", "* Desdemona Asleep (Act V, scene 2) by Andrew Michel after Josiah Boydell", "* —. Collection of Prints, From Pictures Painted for the Purpose of Illustrating the Dramatic Works of Shakspeare, by the Artists of Great-Britain. London: John and Josiah Boydell, 1805.", "* Shakespeare, William, The Dramatic Works of Shakespeare. Ed. George Steevens. London: Shakespeare Printing Office, for John and Josiah Boydell and George W. Nicol, 1802."]}, {"page": "1752 in Wales", "response": ["** Josiah Boydell, painter (died 1817)"]}, {"page": "John Browne (artist)", "response": ["Browne sat for two portraits, one when he was a boy, by William Woollett, later owned by Browne's family and the other, an exact likeness painted a few years before his death by American artist Gilbert Stuart and afterwards acquired by Misters Boydell, engraver and print-seller, John Boydell mentioned above and his nephew artist and publisher Josiah Boydell."]}, {"page": "Josiah (given name)", "response": ["*Josiah Boydell (1752–1817), British publisher"]}, {"page": "The Captive (painting)", "response": ["The first painting was made into a stipple engraving by Thomas Ryder in 1779 and it was published by John and Josiah Boydell in 1786.Room 4: Gothic Gloom , The Tate, London However an earlier mezzotint engraving by John Raphael Smith of the later 1778 painting had been commissioned by John Milnes after he bought the painting at a Royal Academy show. Milnes obtained a print of every Wright painting that he could, but the print that he commissioned of his own painting was limited to just twenty copies before the plate was destroyed. This engraving is now exceptionally rare and is only available in a small number of British institutions and none abroad."]}, {"page": "John Landseer", "response": ["In 1806, he delivered a series of lectures on engraving at the Royal Institution, in which he defended engraving its status as an independent art, and criticised the issuing of inferior plates by commercially minded publishers. The series was  terminated after the sixth lecture, following protests by Josiah Boydell, who claimed that Landseer had unfairly criticised his uncle John Boydell, the leading publisher of engravings, who had died in 1804. He published the lectures in 1807, with added comments reinforcing his criticism of Boydell.Manson (1902), pp.13–4"]}, {"page": "George Noble (engraver)", "response": ["* \"Desdemona in bed asleep\", after Josiah Boydell, from Othello; and \"Cleopatra, Guards, ...\", after Henry Tresham, from Antony and Cleopatra."]}, {"page": "The Seven Ages of Man (painting series)", "response": ["The set of paintings are in pen and ink and oil on panel, and measure: height: 381 mm (15 in); width: 505 mm (19.88 in).  They are now in the Yale Center for British Art, though usually not on display.  In 1796, Robert Smirke agreed to paint William Shakespeare's The Seven Ages of Man for John and Josiah Boydell's Shakespeare Gallery."]}]}}