{"wiki_id": "http://www.wikidata.org/entity/Q6290605", "itemLabel": "Josiah Rees", "itemDescription": "British hymnwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Josiah_Rees", "wikipedia_page": {"main": "Josiah Rees (2 October 1744 – 20 September 1804) was a Welsh Unitarian minister.", "link_mentions": [{"page": "Thomas Rees (Unitarian)", "response": ["He was born in Gelligron, Glamorgan, the son of Josiah Rees; George Owen Rees was his nephew. He started in the bookselling business, but on the advice of Abraham Rees (no relation), he was educated for the ministry (1799–1801) at Carmarthen College."]}, {"page": "1800s in Wales", "response": ["**20 September - Josiah Rees, Unitarian minister (b. 1744)"]}, {"page": "1804 in Wales", "response": ["*20 September - Josiah Rees, Unitarian minister, 59"]}, {"page": "1802 in Wales", "response": ["*8 October - A Unitarian Association is formed in South Wales, with Josiah Rees and Iolo Morganwg among its leaders."]}, {"page": "Josiah (given name)", "response": ["*Josiah Rees (1744–1804), Welsh minister", "*Josiah Rees (judge) (1821–1899), Bermudian judge"]}, {"page": "Charles Lloyd (minister)", "response": ["The third son of David Lloyd, Presbyterian minister at Llwyn-rhyd-owen, Cardiganshire, he was born there on 18 December 1766. On his father's death (4 February 1779, aged 54) his education for the ministry was undertaken by his uncle, John Lloyd of Coed-lanau; but that support provided only for schooling (1779–84) under David Davis, who had been his father's colleague. In the autumn of 1784 he entered with an exhibition the Presbyterian academy, then at Swansea, under Solomon Harries (1726–1785), who was succeeded in 1785 by Josiah Rees and Thomas Lloyd, a first cousin. William Howell became theological tutor in 1786; and when the other tutors established a grammar school, preparatory to the academy, Lloyd was appointed afternoon teacher. Among his fellow-students was Lewis Loyd, father of Samuel Jones Loyd."]}, {"page": "Gellionnen Chapel", "response": ["==== Josiah Rees and Iolo Morganwg ====", "In 1764, Reverend Josiah Rees became minister at Gellionnen Chapel and oversaw its transition towards Unitarianism and the re-building of the chapel in 1801–02. Josiah was the son of Reverend Owen Rees of Hen dy Cwrdd Trecynon (The Old Meeting House, Trecynon) in Aberdare. Josiah was a progressive thinker and studied under Solomon Harries in Swansea and Samuel Thomas, a liberal tutor at Carmarthen.", "Around 1785, Josiah Rees opened a school, having declined the position of principal of the Presbyterian College, Swansea. Rees was the editor of the second-ever Welsh language magazine, Trysorfa Gwybodaeth or Yr Eurgrawn (1776), and was a respected scholar, writing many booklets on his faith. He worked with Iolo Morganwg and Tomos Glyn Cothi (Thomas Evans), Rees studied, collected and copied rare Welsh manuscripts, building an impressive library at his home at Gelligron. Under Rees' influence, Gellionnen's congregation became 'Arminian, Arian and Semi-Unitarian'. In 1802, the Welsh Unitarian Society was founded during a meeting at Gellionnen Chapel, attended by Iolo Morganwg. That year, the chapel was opened after being re-built. Josiah Rees travelled to London to raise funds for the chapel and died shortly after returning from one such trip in 1804. In one of his final letters, Rees praised the congregation for fundraising and claimed (perhaps with exaggeration) that 700 people had attended a recent service.", "Josiah Rees was succeeded by his son, Dr Thomas Rees (1805–06). Thomas Rees wrote a history of Unitarianism and translated the Racovian Catechism and was an important Unitarian minister in London. His brother, Owen Rees, was a co-founder of Longman's publishing firm.", "* Josiah Rees (1764–1804)"]}]}}