{"wiki_id": "http://www.wikidata.org/entity/Q6303576", "itemLabel": "Judith Miller", "itemDescription": "British antiques expert", "wikipedia_url": "https://en.wikipedia.org/wiki/Judith_Miller_(antiques_expert)", "wikipedia_page": {"main": "Judith Miller (born 16 September 1951) is an antiques expert, writer, and broadcaster based in the UK.", "link_mentions": [{"page": "Galashiels", "response": ["*Judith Miller (born 1951), antiques expert"]}, {"page": "Antiques Roadshow", "response": ["* Judith Miller"]}, {"page": "Judith Miller (disambiguation)", "response": ["Judith Miller (born 1948) is an American journalist.", "Judith Miller may also refer to:", "*Judith Miller (philosopher) (1941–2017), French philosopher", "*Judith Miller (antiques expert) (born 1951), TV presenter and writer"]}, {"page": "Peak Literary Festival", "response": ["Previous festival authors included Clare Short, Tariq Ali, Matthew Parris, Gervase Phinn, Brian Turner, the Dowager Duchess of Devonshire, Clive Aslet (Country Life editor), James Geary (editor of Time Magazine), Roger Protz (editor of the Campaign for Real Ale (CAMRA), Jane Fearnley Whittingstall, Colin Tudge, David Rothenberg, David and Ben Crystal, Martin Gurdon, Mark Gwynne Jones, E. A. Markham, Meg Hutchinson, Wendy Holden, Dugald Steer, Martyn Ware (The Human League), Russel Senior and Nick Banks (Pulp), Mark Waddington (CEO of Warchild), Nick Temple (editor of Global Ideas Bank), Susanne Garnett (Director of Village Aid), Ann Widdecombe, Anne Fine, Gary Younge, Stuart Mcleane, Jeanette Orrey, Sue Cowley, Margaret Dickinson, Moazzam Begg, Edwina Currie, Don Shaw, Immaculee Ilibagiza. Speakers at previous Countrybookshop events include Ellen MacArthur, Joe Simpson, Simon Yates, Roy Hattersley, Richard Whiteley and Judith Miller."]}, {"page": "Eileen Rose Busby", "response": ["Busby's book Cottage Ware is referenced in collector Judith Miller's book Buy, Sell, or Keep, and she is listed in Kovels' Yellow Pages.Listing, Kovels' Yellow Pages"]}, {"page": "Judith (given name)", "response": ["* Judith Miller, American journalist and writer", "* Judith Miller (antiques expert), British antiques expert"]}, {"page": "List of Antiques Roadshow episodes", "response": ["| 34/118 September 2011 || Manchester Town HallManchester || Fiona Bruce & Jon BaddeleyEric KnowlesElaine BinningDavid BattieWill FarmerJustin CroftRupert MaasLars TharpJohn BenjaminGraham LayAndy McConnellJohn FosterJudith MillerSteven MooreMark HillJohn AxfordDuncan Campbell || ", "| 34/32/10/2011 || Lulworth CastleLulworth CoveDorset || Fiona Bruce &Hilary KayPaul AtterburyNicholas MitchellGrant FordJudith MillerRichard PriceDavid BattieElaine BinningRupert MaasJohn SandonJoanna HardyHenry SandonJohn Foster ||  "]}, {"page": "List of antiques experts", "response": ["* Judith Miller"]}, {"page": "Mark Hill (antiques expert)", "response": ["He has contributed to DK Collectables Price Guide (by Judith Miller) and was the co-author of the annual Miller's Collectables Price Guide from 2009 to 2017. He has also contributed to a number of other titles in association with Miller including Buy, Keep or Sell? for the Reader's Digest, Decorative Arts and DK Collectors' Guide: 20thC Glass."]}, {"page": "Lennox Cato", "response": ["He joined the BBC's Antiques Roadshow as a furniture specialist in 2004, and has appeared on the programme regularly ever since. This was not Cato’s first foray into television; he has also appeared in Going for a Song with Michael Parkinson; in a televised interview with Judith Miller at the Edenbridge premises and featured on ITV’s Tales from the Country. In 2011 Cato became a member of the Company of Art Scholars and in 2013 received the Freedom of the City. In 2002 Cato and his wife started the ‘Antique Dealers V Auctioneers Charity Football Match’, to raise money for The Haven, Breast Cancer Support Centres. Over the nine years he ran it Cato raised over £40,000. The event is still going strong and the winners now receive the Lennox Cato Cup."]}]}}