{"wiki_id": "http://www.wikidata.org/entity/Q6305961", "itemLabel": "Jules Maxwell", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Jules_Maxwell", "wikipedia_page": {"main": "Jules Maxwell (born 28 October 1965 in Bangor, Northern Ireland) is a songwriter, and composer. He is currently keyboard player for Dead Can Dance. His composition work for dance and theatre draws upon minimalism and is often recorded, incorporating strong melodic montages of sampled sound influenced by the work of Gavin Bryars.", "link_mentions": [{"page": "Soft Ices", "response": ["Soft Ices is an arts project by the artist Mark Storer and composer Jules Maxwell. Mark and Jules have been travelling around Jaywick in an ice cream van, which has been given a new lease of life as a recording studio, persuading local people to literally ‘sing for their supper’. In return for their songs, they are rewarded with free ice creams. Samples of their songs will be transformed into a piece of music which will be broadcast at the Tower’s opening. All those who recorded a song will be invited to collect their book, and anyone else who attends the event will also receive a book."]}, {"page": "Daryl Bamonte", "response": ["Bamonte is the Managing Director of Schubert Music Publishing UK and the head of the Atlantic Curve record label.  Since forming in 2020, Atlantic Curve has released albums by critically-acclaimed artists such as I Like Trains, Laura Carbone and the Burn album by Lisa Gerrard & Jules Maxwell from Dead Can Dance, which was produced by James Chapman from  Maps (musician). Schubert Music UK also publishes an eclectic list of artists including Polly Scattergood, Vita & The Woolf and Sheila Simmenes.", "Bamonte was an Executive Producer for The Cure's live Trilogy film from 2003,  and their self-titled album from 2004. He fulfilled the same role for Roger O'Donnell's 2 Ravens album, Lisa Gerrard & Jules Maxwell's Burn album  and Maxwell's Nocturnes album, which Bamonte released on his newly-formed Archangelo Recordings label in 2021. Bamonte is still very active as an artist manager, and also as a speaker at international conferences and consulting contributor to workshops and seminars.", "Bamonte formed Archangelo Music in 2021 to release Jules Maxwell's Nocturnes album  on the Archangelo Recordings label. The album received great praise from some of Maxwell's contemporaries such as  Roger O'Donnell  from The Cure, Lisa Gerrard & Brendan Perry from Dead Can Dance, James Chapman from MAPS and Foy Vance."]}, {"page": "Foy Vance", "response": ["On 21 July 2007, Vance's debut album, Hope, was self-released via Wurdamouth Records. The album obtained some critical acclaim within the UK with the album track \"Two Shades of Hope\", which contains a hidden recording of Vance's daughter, Ella, singing \"You Are My Sunshine\" at the end. His pianist is London based composer Jules Maxwell."]}, {"page": "1966 in Northern Ireland", "response": ["*28 October - Jules Maxwell, songwriter and composer."]}, {"page": "Love the Sinner", "response": ["Love the Sinner is a play by Drew Pautz. It received its world premiere at the Royal National's Cottesloe Theatre on 11 May 2010. The production was directed by Matthew Dunster, with music by Jules Maxwell and sound design by Paul Arditti. The show played its final performance at the Cottesloe Theatre on 10 July 2010.National Theatre Website"]}, {"page": "Deleyaman", "response": ["In October 2018, Deleyaman & Jules Maxwell toured Ireland and the UK playing in Limerick, Galway, Lisdoonvarna, Carlow, Dublin, Dundalk and Portaferry and guesting on BBC Radio Ulster’s John Toal show.", "A new album Sentinel, including contributions from Brendan Perry and Jules Maxwell, was released on January 17, 2020. They collaborated with French actress Fanny Ardant for a night of poetry and music in 2021  and 2022."]}]}}