{"wiki_id": "http://www.wikidata.org/entity/Q6306424", "itemLabel": "Julia Fox", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Julia_Fox_(author)", "wikipedia_page": {"main": "Julia Fox is an author and historical researcher, and a former teacher. She lives in London with her husband, the Tudor historian, John Guy. Her first book was Jane Boleyn: The Infamous Lady Rochford, a study of the lady-in-waiting at the court of Henry VIII of England and the sister-in-law of Anne Boleyn.", "link_mentions": [{"page": "Catherine of Aragon", "response": [" In recent years, the historian Alison Weir covered her life extensively in her biography The Six Wives of Henry VIII, first published in 1991. Antonia Fraser did the same in her own 1992 biography of the same title; as did the British historian David Starkey in his 2003 book Six Wives: The Queens of Henry VIII. Giles Tremlett's biography Catherine of Aragon: The Spanish Queen of Henry VIII came out in 2010, and Julia Fox's 2011 dual biography Sister Queens: The Noble, Tragic Lives of Katherine of Aragon and Juana, Queen of Castile."]}, {"page": "Jane Boleyn, Viscountess Rochford", "response": ["Although it has long been supposed that nothing is recorded of Jane's appearance (and there is no surviving portrait that can be identified as her), her biographer Julia Fox, in Jane Boleyn: The Infamous Lady Rochford, suggests that there is a very remote chance that a Holbein painting represents a likeness of Jane (pp. 317–319). She was probably considered attractive in her day, given that she was chosen to appear as one of the lead actresses/dancers in the prestigious \"Château Vert\" masquerade at Court in 1522. The seven performers were selected from the ladies of court in large part for their attractiveness. Two of the other performers included Jane's future sisters-in-law, Anne and Mary Boleyn.", "Traditionally, George and Jane's marriage has been portrayed as an unhappy one. One modern historian has suggested that George was homosexual. British historian Alison Weir concludes that the marriage was unhappy, principally because of George, although she concludes that the exact nature of his sexuality is difficult to ascertain: \"[A] talented young man ... he was very good-looking and very promiscuous. In fact, according to George Cavendish, he lived in 'bestial' fashion, forcing widows, deflowering virgins ... [and] it has been suggested he indulged in homosexual activity too, but there is no evidence for this, although he may well have committed buggery with female partners.\" Julia Fox, Jane's most recent biographer, disagrees with both arguments, concluding that the exact nature of the marriage is unclear but suggesting that it was by no means unhappy.", "This negative view of Jane was rejected nearly 500 years later by her biographer, Julia Fox, who believes that Jane actually enjoyed a warm and supportive relationship with Queen Anne and that terror of the palace coup against the Boleyns in 1536 provoked Jane's testimony, which in any case was twisted by the family's enemies. In her 2007 book, Fox writes:", "George Boleyn was beheaded on Tower Hill on 17 May 1536 before a large crowd. His final speech was chiefly concerned with promoting his new-found Protestant faith. Four other men, one of them a commoner, were executed alongside him, also accused of having been Anne's lovers. Only the commoner, Mark Smeaton, a musician, had confessed, and it was reported that he had been savagely tortured into doing so. (Members of the aristocracy and gentry could not legally be tortured.) Anne was executed two days later, beheaded by a French swordsman, within the walls of the Tower of London. Anne's poise and courage at the scaffold were much commented upon, and public opinion in the weeks and months after often \"made of Anne a persecuted heroine, bright with promise and goodness as a young woman, beautiful and elegant.\" It is not known whether Jane witnessed the execution of either her husband or her sister-in-law, but the posthumous sympathy Anne aroused in many meant that many of those linked to her fall were cast in the roles of villains. According to Julia Fox, this mindset explains how Jane's actions were construed as being those of a cruel and jealous intriguer."]}, {"page": "John Guy (historian)", "response": ["He is married to author Julia Fox, a former history teacher, who wrote Jane Boleyn: The Infamous Lady Rochford."]}, {"page": "Boleyn family", "response": ["*Julia Fox, Jane Boleyn: The Infamous Lady Rochford"]}, {"page": "Claire Ridgway", "response": ["Through her website, Ridgway was involved in running historical tours through her company History Tours of Britain. The first tour was in 2010, with subsequent tours until 2012. These tours were based around Hever Castle in Kent, with notable guest speakers such as Eric Ives, John Guy, Julia Fox and Elizabeth Norton. The company was closed due to Ridgway wanting to focus on her writing.UK Company No. 07576296"]}, {"page": "Julia Fox", "response": ["Julia Fox may refer to:", "* Julia Fox (actress), American actress best known for her appearance in the film Uncut Gems", "* Julia Fox (author), British author of two books about 16th-century European female royalty"]}]}}