{"wiki_id": "http://www.wikidata.org/entity/Q6306035", "itemLabel": "Jules Sylvester", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jules_Sylvester", "wikipedia_page": {"main": "Jules Sylvester (born Julian Richard Sylvester; 13 November 1950) is a wild animal trainer, actor, television presenter and snake wrangler who works in films as well as television.", "link_mentions": [{"page": "1950 in television", "response": ["|Jules Sylvester"]}, {"page": "1987 in film", "response": ["| Project X || 20th Century Fox || Jonathan Kaplan (director); Lawrence Lasker, Stanley Weiser (screenplay); Matthew Broderick, Helen Hunt, William Sadler, Jonathan Stark, Johnny Ray McGhee, Robin Gammell, Stephen Lang, Jean Smart, Daniel Roebuck, Marvin J. McIntyre, Harry Northup, Michael Eric Kramer, Dick Miller, Jules Sylvester, Richard Cummings Jr., Robert Lee Minor, Ken Lerner, Michael McGrady, Deborah Offner, Lance E. Nichols, Ken Sagoes, Richard Paul || Comedy, Drama, Sci-Fi || Live action"]}, {"page": "1993 in film", "response": ["| Hard Target || Universal Pictures || John Woo (director); Chuck Pfarrer (screenplay); Jean-Claude Van Damme, Lance Henriksen, Yancy Butler, Arnold Vosloo, Wilford Brimley, Kasi Lemmons, Chuck Pfarrer, Willie C. Carpenter, Sven-Ole Thorsen, Jules Sylvester, Marco St. John, Joe Warfield || Action || Live action"]}, {"page": "1950 in film", "response": ["*November 13 – Jules Sylvester, British wild animal trainer, actor and television presenter"]}, {"page": "The Bernie Mac Show", "response": ["Mac's character's celebrity worked as a plot device allowing other celebrities to appear on the show as themselves, including Neve Campbell, Don Cheadle, Halle Berry, Serena Williams, Courteney Cox, Chris Rock, Ashton Kutcher, Dom DeLuise, Natasha Lyonne, Billy Crystal, Carl Reiner, Don Rickles, Parker Posey, Angela Bassett, Ellen DeGeneres, Ice Cube, Isaac Hayes, Flavor Flav, Lucy Lawless, Stone Cold Steve Austin, Triple H, Matt Damon, Wesley Snipes, Charles Barkley, Jon Garland, Jules Sylvester, Sugar Ray Leonard, India Arie, Shaquille O'Neal, Sugar Shane Mosley, Hugh Hefner, and Phil McGraw, and Marcus Allen have all appeared as themselves over the course of the show."]}, {"page": "Project X (1987 film)", "response": ["* Jules Sylvester as Airman"]}, {"page": "Hard Target", "response": ["In New Orleans, a homeless veteran named Douglas Binder (Chuck Pfarrer) is the target of a hunt. He is given a belt containing $10,000 and told that he must reach the other side of the town to win the money and his life. Pursuing him is the hunt organizer Emil Fouchon (Lance Henriksen), his lieutenant Pik van Cleef (Arnold Vosloo), a businessman named Mr. Lopacki - Fouchon's client who has paid $500,000 for the opportunity to hunt a human, and mercenaries including Stephan (Sven-Ole Thorsen) and Peterson (Jules Sylvester). Binder fails to reach his destination and is killed by three crossbow bolts. Van Cleef retrieves the money belt.", "* Jules Sylvester as Peterson, Fouchon's mercenary snake bites him on the cheek."]}, {"page": "Snakes on a Plane", "response": ["During a July 21, 2006 panel discussion at the Comic-Con Convention in San Diego, California, a preview clip from the film was shown to a crowd of more than 6,500 people. The panel included actors Samuel L. Jackson and Kenan Thompson, director David R. Ellis, and snake-handler Jules Sylvester."]}, {"page": "List of Jackass cast members", "response": ["* Jules Sylvester"]}, {"page": "Shelter (2010 film)", "response": ["* Jules Sylvester as Snake Milker"]}, {"page": "1950", "response": ["* November 13 – Jules Sylvester, British wild animal trainer, actor and television presenter"]}, {"page": "List of Kenyan European people", "response": ["*Jules Sylvester – animal wrangler, TV presenter (emigrated to the United States) "]}, {"page": "Jackass Forever", "response": ["* Jules Sylvester"]}, {"page": "The Guy for This", "response": ["The show opens and closes on scenes involving a mass of ants swarming over an ice cream cone that Jimmy dropped when he was picked up by Nacho in \"50% Off\". The shots were made with about two thousand live red harvester ants, collected from and returned to the wild by animal trainer Jules Sylvester. They used an ice cream-like substance that would not be toxic to the ants but still draw them to swarm across it as to get the shots they wanted."]}]}}