{"wiki_id": "http://www.wikidata.org/entity/Q6304510", "itemLabel": "Judy Loe", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Judy_Loe", "wikipedia_page": {"main": "Judith Margaret Loe (born 6 March 1947) is an English actress. She was married to actor Richard Beckinsale until his death in 1979, and later married director Roy Battersby. She is the mother of actress Kate Beckinsale, and the step-mother of Kate's half-sister, Samantha.", "link_mentions": [{"page": "Mary of Teck", "response": ["Actresses who have portrayed Queen Mary include Dame Flora Robson (in A King's Story, 1965), Dame Wendy Hiller (on the London stage in Crown Matrimonial, 1972), Greer Garson (in the television production of Crown Matrimonial, 1974), Judy Loe (in Edward the Seventh, 1975), Dame Peggy Ashcroft (in Edward & Mrs. Simpson, 1978), Phyllis Calvert (in The Woman He Loved, 1988), Gaye Brown (in All the King's Men, 1999), Miranda Richardson (in The Lost Prince, 2003), Margaret Tyzack (in Wallis & Edward, 2005), Claire Bloom (in The King's Speech, 2010), Judy Parfitt (in W.E., 2011), Valerie Dane (in the television version of Downton Abbey, 2013), Dame Eileen Atkins (in Bertie and Elizabeth, 2002 and The Crown, 2016), and Geraldine James (in the film version of Downton Abbey, 2019)."]}, {"page": "1983 in film", "response": ["| Monty Python's The Meaning of Life || Universal Pictures || Terry Jones (director); Monty Python (screenplay); Graham Chapman, John Cleese, Terry Gilliam, Eric Idle, Terry Jones, Michael Palin, Carol Cleveland, Simon Jones, Patricia Quinn, Judy Loe, Matt Frewer, John Scott Martin, Andrew Bicknell, Mark Holmes, Valerie Whittington || Musical, Comedy || Live action"]}, {"page": "Monty Python's The Meaning of Life", "response": ["* Judy Loe"]}, {"page": "University of Birmingham", "response": ["Alumni in the creative industries include actors Madeleine Carroll, Tim Curry, Tamsin Greig, Matthew Goode, Nigel Lindsay, Elliot Cowan, Geoffrey Hutchings, Judy Loe, Jane Wymark, Mariah Gale, Hadley Fraser, Elizabeth Henstridge, and Norman Painting; actors and comedians Victoria Wood and Chris Addison; dancer/choreographer and co-creator of 'Riverdance' Jean Butler, social media influencer and YouTuber Hannah Witton, children's author and scholar Fawzia Gilani-Williams, musicians Simon Le Bon of Duran Duran and Christine McVie of Fleetwood Mac, and travel writer Alan Booth."]}, {"page": "Kate Beckinsale", "response": ["Beckinsale was born on 26 July 1973 in the Chiswick district of London,  the only child of actors Richard Beckinsale and Judy Loe. She has an older paternal half-sister, actress Samantha Beckinsale, but they are not in regular contact. Her father was partly of Burmese descent. Her parents did not marry until 1977, prior to Beckinsale starting nursery school, when she made her first television appearance at age four, in an episode of This Is Your Life dedicated to her father. When she was five, her 31-year-old father died instantly of a heart attack; she was deeply traumatised by the loss and \"started expecting bad things to happen.\" Her widowed mother moved in with director Roy Battersby when Beckinsale was nine, and she was brought up alongside his four sons and daughter. She has a close relationship with her stepfather, who was a member of the Workers Revolutionary Party during her youth. She helped to sell The News Line, a Trotskyist newspaper, as a little girl and has said the household phone was tapped following Battersby's blacklisting by the BBC. Family friends included Ken Loach and Vanessa Redgrave."]}, {"page": "Ace of Wands (TV series)", "response": ["In the first two series, Tarot is assisted by Sam Maxstead (Tony Selby), a reformed convict, and by the orphan Lillian \"Lulli\" Palmer (Judy Loe). Lulli shares a telepathic link with Tarot, which enables them to communicate over great distances. After having to leave the programme because of prior commitments, in the final series, this pair were replaced by brother and sister Chas (Roy Holder), a photographer, and Mikki (Petra Markham), a journalist, who had similar roles in the series. She also shared a telepathic link with Tarot. A character named Mr Sweet (Donald Layne-Smith) who runs an antiquarian bookshop often has the answer to Tarot's questions. Sweet is based in a university for the last series.", "* Judy Loe as Lulli Palmer"]}, {"page": "Richard Beckinsale", "response": ["Beckinsale met actress Judy Loe in 1968 at Crewe repertory. They soon began dating and lived together for years. Their daughter, actress Kate Beckinsale, was born on 26 July 1973. They finally married in 1977, prior to Kate starting nursery school.", "A week before he died, Beckinsale complained to his wife Judy Loe of feeling unwell and said he was unable to take her to hospital. At the time, they both put it down to nerves; she was due to have an operation to increase the couple's chances of having another child. Loe underwent the operation on Wednesday 14 March and while she remained in the hospital recuperating, Beckinsale continued to work on Bloody Kids and resumed work on the sixth episode of Bloomers, commuting between London by day and Southend-on-Sea by night.", "When Beckinsale's book of poetry, With Love was published in 1980, Judy Loe, Ronnie Barker, and Richard Briers appeared on The Russell Harty Show to talk about the book and recite some of the poetry.The Russell Harty Show, 28 October 1980, BBC.", "In 2000, 21 years after his death, a documentary was broadcast on ITV in tribute, called The Unforgettable Richard Beckinsale. It featured interviews with his widow, the actress Judy Loe, as well as his father, sister, closest school friend and two daughters. Also contributing were his co-stars, Ronnie Barker of Porridge and Don Warrington of Rising Damp. Barker, remembering Beckinsale's premature death, said: \"He was so loved. He hadn't done much but he was so loved that there was a universal sort of grief that went on.\"", "In 2007, Alan Davies nominated Beckinsale as his chosen subject for the BBC Radio 4 series Great Lives.  Judy Loe and Stephen Frears participated in the discussion of Beckinsale's life and career.", "In 2013, a blue plaque in Beckinsale's memory was unveiled at his former school, College House Junior School in Chilwell.  Kate Beckinsale, Judy Loe, David Walliams, and Michael Sheen attended the ceremony.", "Channel 4 aired a three-part documentary in 2014 called Porridge: Inside Out, in celebration of Porridge's 40th anniversary. During this series, there was a memorial segment dedicated to Beckinsale, in which Judy Loe and Kate Beckinsale took part."]}, {"page": "Bloomers (TV series)", "response": ["Beckinsale's widow, Judy Loe, gave her approval for the five completed episodes to be broadcast. Bloomers aired from 27 September 1979 to 25 October 1979 on BBC2. Four of the episodes were given a repeat viewing the following year on BBC1 from 6 August 1980 to 27 August 1980. The show also aired in 1983 on ABC in Australia and the only publicly available recordings of Bloomers are from these broadcasts. Poor quality transfers of the five episodes are available to view on YouTube. Bloomers has never been aired again by the BBC, nor has there been any official release of the series."]}, {"page": "Roger Rees", "response": ["Rees began to work in television during the 1980s, appearing opposite Laurence Olivier in The Ebony Tower (1984). That same year, Rees portrayed Fred Hollywell in A Christmas Carol, which he also narrated, starring George C. Scott as Scrooge. In 1986, he played William Tyndale in God's Outlaw. From 1988 to 1991 he starred in the British sitcom Singles, with co-star Judy Loe. From 1989 to 1991 and in 1993, he also appeared intermittently on the long-running American television series Cheers as the English business tycoon Robin Colcord, a love interest for Rebecca Howe (Kirstie Alley). He played British Ambassador Lord John Marbury in several episodes of The West Wing from 2000 to 2005. His later television appearances also include My So-Called Life as substitute teacher Mr. Racine, and James MacPherson on Warehouse 13. His film career began in the 1980s. Rees played the Sheriff of Rottingham in the Mel Brooks movie, Robin Hood: Men in Tights (1993). Rees' later film appearances include Frida (2002), The Prestige (2006), and The Pink Panther (2006)."]}, {"page": "Urmston", "response": ["Suzanne Charlton, BBC weather presenter and daughter of Bobby Charlton, was born in Urmston, as was Judy Loe, actress mother of Kate Beckinsale and wife of the late Richard Beckinsale."]}, {"page": "When the Boat Comes In", "response": ["*Judy Loe as Tania Corley (1981 / Series 4 / 3 episodes)"]}, {"page": "Samantha Beckinsale", "response": ["She is the only daughter of Richard Beckinsale and his first wife Margaret Bradley. A stepdaughter of Judy Loe, and half-sister of Kate Beckinsale."]}, {"page": "Trevor Peacock", "response": ["* Class K with Judy Loe, Colin Prockter and Rosalind Knight (1985)"]}, {"page": "Urmston Grammar", "response": ["* Judy Loe, actress & mother of Kate Beckinsale"]}, {"page": "Edward the Seventh", "response": ["*Judy Loe as Princess Mary of Teck, later Queen Mary (episodes 9–13)"]}, {"page": "Hammer House of Mystery and Suspense", "response": ["| Carol Lynley, Christopher Cazenove, Judy Loe, David Healy, Bernard Kay, Brendan Price, John D. Collins"]}, {"page": "Space Island One", "response": ["Space Island One (or Raumstation Unity in German) is a British/German science fiction television series that ran for 26 episodes beginning in 1998.  A co-production between the UK's Sky One channel and the German Vox channel, it starred Judy Loe as Kathryn McTiernan, the commander of the multinational crew of the space station Unity.", "*Judy Loe as Commander Kathryn MacTiernan"]}, {"page": "Singles (TV series)", "response": ["*Judy Loe as Pamela"]}, {"page": "Lyceum Theatre, Crewe", "response": ["The theatre stands on the site of a former Roman Catholic Church that had been built to serve Irish immigrants working on the local railway.  In 1876 the congregation moved into a larger church in the town.  The site was acquired by Thomas Cliffe, a local farmer, and he gave permission for Henry Taylor, a local printer, to convert the church into a theatre.  Taylor wanted to have a \"proper\" theatre on the site and later built the New Lyceum Theatre, which opened on 21 November 1887. It cost £5,000 () and seated 1,250 people.  It was re-fitted in 1908 and changed its name to the Opera House.  On 11 March 1910 the theatre was destroyed in a fire, and it was decided to rebuild it on the same site. The new theatre was designed by Albert Winstanley, it seated 850, and opened on 6 October 1911.  In the early 1930s it was acquired by Terence Byron, who also owned theatres elsewhere in the country.  It was bought in 1955 by Crewe Borough Council who formed a management trust in 1964. It operated, with a varying degree of success, as a repertory theatre.  During this time actors and actresses who later achieved fame gained experience in the theatre; these included Glenda Jackson, Richard Beckinsale, Judy Loe, and Lynda Bellingham.  In 1982 the management of the theatre moved back from the trust to the Crewe and Nantwich Borough Council.  The council redecorated the theatre in 1992, and installed new seating, and in 1994 £1.5 million was spent in rebuilding the facilities in the front of the house and remodelling the gallery."]}, {"page": "List of British actors", "response": ["* Judy Loe (born 1947)"]}, {"page": "Casualty (series 16)", "response": ["*Judy Loe as Jan Goddard (episodes 3−40)"]}, {"page": "Casualty (series 17)", "response": ["*Judy Loe as Jan Goddard (episodes 9)"]}, {"page": "Roy Battersby", "response": ["He is married to actress Judy Loe and is the stepfather of actress Kate Beckinsale. Battersby was a Trotskyist for some years,Sanjiv Bhattacharya \"Kate Beckinsale\", GQ Magazine, February 2006, as reproduced on Bhattacharya's website. becoming a full-time organiser for the now defunct Workers Revolutionary Party.Stephen Lacey Tony Garnett, Manchester: Manchester University Press, 2007, p.76 The association had ended by 1981,Roy Battersby Obituary: Nicholas Palmer, The Independent, but the connection led to his being blacklisted by the BBC.Mark Hollingsworth and Richard Norton-Taylor Blacklist: The Inside Story of Political Vetting, London: Hogarth Press, p.116-17 (Chapter 5 \"MI5 and the BBC: Stamping the ‘Christmas Tree’ Files\")"]}, {"page": "The Chief (TV series)", "response": ["* Judy Loe as Dr. Elizabeth Stafford (Series 1–3)"]}, {"page": "Revelations (1994 TV series)", "response": ["Revelations was a late-night soap opera created by Russell T Davies, Brian B. Thompson, and Tony Wood, produced by Granada and starring Judy Loe and Paul Shelley. It aired in the Granada, Central and Carlton ITV regions between 1994 and 1996. The series is family drama about the family of the priest Edward Rattigan (Shelley) and his wife Jessica (Loe). It follows and critiques the organisational structure of the Anglican Church at the turn of the millennium."]}, {"page": "Yesterday's Dreams (TV series)", "response": ["Yesterday's Dreams is a British romantic drama television series produced by Central Television for ITV. The series was written by Peter Gibbs and starred Paul Freeman and Judy Loe. Freeman and Loe play divorced couple Martin and Diane Daniels who rekindle their relationship after Diane begins a temping job at Martin's firm. Much of the series filmed in Tideswell, Derbyshire.", "*Judy Loe as Diane Daniels"]}, {"page": "Judy (given name)", "response": ["*Judy Loe (born 1947), English actress"]}, {"page": "Goodnight and God Bless", "response": ["* Judy Loe as Celia Kemp"]}]}}