{"wiki_id": "http://www.wikidata.org/entity/Q6303471", "itemLabel": "Judith Humphreys", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Judith_Humphreys", "wikipedia_page": {"main": "Judith Humphreys is a Welsh actress who appeared in the films Hedd Wyn and The Storms of August.\nShe has also worked with charities Christian Aid and Cofis Bach. In 2014 she founded Codi'r To, a Welsh organisation similar to that of El Sistema.", "link_mentions": [{"page": "Cymuned", "response": ["The chief executive of Cymuned was Aran Jones, who had learnt  Welsh as a second language. Other notable members included the poet and musician, Twm Morys (who won the chair at the 2003 national eisteddfod), Dr Simon Brooks, former editor of the Welsh language current affairs magazine Barn, Judith Humphreys, a Welsh actress and Dr Jerry Hunter, an American Harvard graduate who moved to Wales to learn Welsh and has remained in Wales ever since, working in academic posts at the University of Wales."]}, {"page": "Hedd Wyn (film)", "response": ["On a train, Ellis encounters Jini Owen (Judith Humphreys), a young woman who admires his poetry. Noticing her interest in him, Ellis asks for Jini's address and sends her a letter. Soon the two are deeply in love. Simultaneously, Ellis develops a close friendship with Mary Catherine Hughes (Nia Dryhurst), the young woman who is his sister's teacher. He explains to her that, whenever a poem is lacking, he will cast it into the river, and that it will always return to him stronger. On a railway journey with Jini, Ellis encounters two hideously disfigured war veterans. Despite his sympathy for their plight, the soldiers accuse Ellis of cowardice for remaining a civilian. As he and Jini depart, one of the soldiers threatens to mail him a white feather. Ellis quips, \"You don't have any wings, let alone feathers.\""]}, {"page": "List of Pobol y Cwm characters", "response": ["|Rachel Price || Judith Humphreys || 1995–1998"]}, {"page": "List of Welsh women", "response": ["*Judith Humphreys (born 1988), actress"]}]}}