{"wiki_id": "http://www.wikidata.org/entity/Q6306472", "itemLabel": "Julia Hills", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Julia_Hills", "wikipedia_page": {"main": "Julia Hills (born 3 April 1957) is an English actress, known for portraying the role of Rona in eight series of the BBC sitcom 2point4 Children. She also portrayed various roles in Channel 4's first late night satirical sketch show Who Dares Wins, Beryl in two series of the sitcom Dad and Caroline Joyner in Casualty.", "link_mentions": [{"page": "The Archers", "response": ["! scope=\"row\" |Julia Hills"]}, {"page": "Dad (TV series)", "response": ["Toby Ross-Bryant played Alan's son Vincent, and Julia Hills played Alan's wife Beryl. It was written by Andrew Marshall, who was best known for his popular sitcom 2point4 Children. The title of each episode was a pun on the word 'Dad'.", "* Julia Hills as Beryl Hook", "Initially, due to Julia Hills being in 2point4 Children, which was still running come the transmission of 'Dad', the BBC didn't want her to be in it. However, after her audition, any fears and doubts were quickly quashed."]}, {"page": "2point4 Children", "response": ["* Rona Harris (Julia Hills)"]}, {"page": "Saturday Night Fry", "response": ["Hosted by Stephen Fry—accompanied each week by a selection of guests including Jim Broadbent, Emma Thompson, Phyllida Law, Robert Bathurst, Julia Hills, Alison Steadman and long-time collaborator Hugh Laurie—the show took the form of a round table discussion and sketches which veered tangentially from the sublime to the ridiculous. Parodies of television and radio formats were common ('Fat Man on a Bicycle', and so on)."]}, {"page": "Revolting People", "response": ["*Sophie ThompsonSeries 1 / Jan RavensSeries 2 and 3 / Julia HillsSeries 4Mary Oliphant"]}, {"page": "Who Dares Wins (TV series)", "response": ["Who Dares Wins is a British television comedy sketch show, an adaptation of  BBC Radio 4's Injury Time, broadcast between 1983 and 1988, featuring Jimmy Mulville, Rory McGrath, Philip Pope, Julia Hills and Tony Robinson. It was one of the first TV outlets for alternative comedy and was broadcast by Channel 4 late at night in a first attempt at \"Post-Pub television\" (the opening title sequence shows a man staggering home from the pub to get to the television in time for the programme). It was eventually aired by the Playboy Channel in cable television outlets in the United States."]}, {"page": "Poppy (1982 musical)", "response": ["| Sally Forth, a schoolmistress || Julia Hills"]}, {"page": "List of former EastEnders characters", "response": ["| Morag Morgan || Julia Hills || 2018"]}, {"page": "The Mystery of Edwin Drood (musical)", "response": ["| style=\"text-align:center;\"| Julia Hills"]}, {"page": "The Long Hot Satsuma", "response": ["The Long Hot Satsuma is a radio comedy sketch show from 1989 featuring Graeme Garden, Barry Cryer, Alison Steadman, Paul B. Davies and Julia Hills.  The show was produced by Dirk Maggs."]}, {"page": "Casualty@Holby City", "response": ["In the four-part Halloween crossover, James Gaddas guest-stars as Carl O'Leary, the headmaster of a failing school. James Pearson plays Adrian Lucas, a pupil who puts acid in the water used in apple bobbing. Jason Maza appears as Kris Burrows, whose girlfriend Emma Blakely (Kate Scott) is burned by the acid, and Red Madrell plays Shania Campbell, Emma's best friend who is also burned. Ade Sapara appears as Edgar Muzenda, a poet and political refugee involved in a car accident, and Nikki Amuka-Bird plays his pregnant wife Moji. Louis Mahoney appears as their friend Raymond Opoku. The December 2005 crossover features Iain Fletcher as fire officer Iain Bain, Julia Hills as Woody's mother Caroline Joyner, Fiona Glascott as Tara Doyle, a girl trapped when a tunnel collapses, and Gary Whelan as Tara's father Bernie."]}, {"page": "1957 in the United Kingdom", "response": ["* 3 April – Julia Hills, actress"]}, {"page": "Walton High School, Stafford", "response": ["* Julia Hills, actress"]}, {"page": "List of The Archers characters", "response": ["Matt Crawford (born 7 August 1947) (Kim Durham) He threw his weight around and become more hated by all. He was for some years the chairman of Borchester Land, a property development company. An outsider by birth, Matt often inveigled himself into positions of power, such as the parish council, but many villagers were suspicious of his motives. For example, when local vet Alistair owed him a gambling debt, Matt said that he would reduce the amount he owed in exchange for the administration of performance-enhancing drugs to one of his racehorses. Alistair refused, and Crawford increased the pressure, forcing Alistair and Shula to take out a mortgage on the stables, which they already owned. Many years later this caused a rift between Alistair and his by then business partner Anisha Patel. In 2005, Matt divorced his wife Yvette and moved in with his new partner Lilian Bellamy (née Archer, daughter of Peggy Woolley). In this romance she calls him \"Tiger\" and he calls her \"Pussy-cat\". In early 2008, Crawford and Lilian were briefly separated when she suspected him of having an affair with a Borchester Land board member Annabelle Scrivener (Julia Hills). The following year Crawford was indicted for fraud, having made a business guarantee he knew was false. He was persuaded to co-operate with the authorities (in contrast with his less scrupulous colleague Stephen \"Chalkie\" Chalkman), but on practically the eve of the trial he fled in panic to Costa Rica, planning to live there as a fugitive. However, Lilian's unhappiness in prospective exile persuaded him to return, and he served an 18-month prison sentence. Upon his release on probation he created a new property development company, created with Lilian as director to circumvent his disqualification. Lillian took a more active role than he expected which caused some friction. Matt and Lilian's relationship ultimately came to an end in early 2015. Subsequent to Lilian having a brief affair with Matt's estranged brother Paul, (which she did not find out Matt knew about until later),  Lilian arrived home from a holiday to discover that he had emptied out all of their joint holdings, ransacked their house of valuables and fled to Costa Rica. In April 2017, Matt made a surprise re-appearance, claiming to have returned to Ambridge in order to repay his debt to Lillian."]}, {"page": "Laurence Olivier Award for Best Actress in a Musical", "response": ["| Julia Hills"]}, {"page": "List of 2point4 Children characters", "response": ["Rona Harris (Julia Hills) is Bill's best friend. In series 1 she works with Bill at a bakery until they both resign due to sexual harassment. From series 2 she runs a catering company with Bill. From series 3 she begins a relationship with DJ Tony. The later series focus on her attempts to have children, and, after considering adoption, Rona announces she is pregnant in the final episode."]}, {"page": "Calendar Girls (play)", "response": ["After a successful try-out at the Chichester Festival Theatre in September 2008 and a lengthy national tour, a stage adaptation of the film started previewing  on 4 April 2009 at the Noël Coward Theatre in the West End, opening on 20 April. The original cast included Lynda Bellingham, Patricia Hodge, Siân Phillips, Gaynor Faye, Brigit Forsyth, Julia Hills and Elaine C. Smith.", "* Julia Hills as Ruth", "*Debbie Chazen as Ruth (withdrew during run, replaced by Julia Hills)", "*Julia Hills as Annie"]}, {"page": "Paul Clarkson", "response": ["He is married to actress Julia Hills; the couple have three children."]}, {"page": "Casualty (series 18)", "response": ["*Julia Hills as Caroline Miller (episodes 40−42)"]}, {"page": "Casualty (series 19)", "response": ["*Julia Hills as Caroline Joyner (episode 14, episodes 26−29)"]}, {"page": "Casualty (series 20)", "response": ["*Julia Hills as Caroline Joyner (episode 18)"]}, {"page": "Dusty Answer", "response": ["*In 2010 by Lavinia Greenlawbbc.co.uk for Woman's Hour Drama, narrated by Julia Hills.bbc.co.uk"]}, {"page": "Hills (surname)", "response": ["* Julia Hills (born 1957), British actress"]}, {"page": "1984 Laurence Olivier Awards", "response": ["** Julia Hills as Emily Tallentire in The Hired Man – Astoria"]}, {"page": "Revunions", "response": ["*Julia Hills"]}, {"page": "Calendar Girls (musical)", "response": ["Julia Hills"]}, {"page": "List of EastEnders characters (2018)", "response": ["Morag Morgan is played by Julia Hills. She first appears in episode 5816, first broadcast on 22 November 2018, and departs in episode 5830, first shown on 17 December 2018. She appears in eight episodes."]}, {"page": "Ladies in Charge", "response": ["* Julia Hills as Babs Palmer"]}]}}