{"wiki_id": "http://www.wikidata.org/entity/Q6306749", "itemLabel": "Julia Somerville", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Julia_Somerville", "wikipedia_page": {"main": "Julia Mary Fownes Somerville,  (born 14 July 1947) is an English television news reader and reporter who has worked for the BBC and ITN.\n\n", "link_mentions": [{"page": "Wells, Somerset", "response": ["* Julia Somerville OBE – born in Wells 1947, newsreader and journalist who is working with BBC and ITN and co-presenter of Rip Off Britain"]}, {"page": "Gloria Hunniford", "response": ["Since 2009, Hunniford has co-presented Rip Off Britain, a consumer complaints programme on BBC One with Angela Rippon and, for the first two series, Jennie Bond,\"Angela Rippon Rip Off Britain\" 14 November 2010, TV Choice Magazine and then, for the third series, with Julia Somerville replacing Bond. Together, the trio of Hunniford, Rippon and Somerville also presented Charlie's Consumer Angels."]}, {"page": "Jon Snow (journalist)", "response": ["By 1978, he was working as a correspondent for ITN, and in November of that year was sent on a mission to Vietnam to report on the plight of the boat people.Jon Snow, Shooting History: A Personal Journey (Harper Collins, 2017), pp. 1–3. He served as ITN's Washington correspondent (1983–1986) and as diplomatic editor (1986–1989) before becoming the main presenter of Channel 4 News in 1989. In 1992, he was the main anchor for ITN's election night programme, broadcast on ITV; he presented the programme alongside Robin Day, Alastair Stewart and Julia Somerville. (Previously ITN's programme had typically been presented by Alastair Burnet, who left ITN in 1991. The 1992 election night programme was the only one hosted by Snow. He was replaced by Jonathan Dimbleby from 1997 onwards.) Snow has won several RTS Awards – two for reports from El Salvador, one for his reporting of the Kegworth air disaster as well as the 1995 Award for Best Male Presenter and the 1980 Award for TV Journalist of the Year for his coverage of Afghanistan, Iran and the Middle East."]}, {"page": "Angela Rippon", "response": ["Since 2009, she has co-presented the BBC consumer show Rip Off Britain with Gloria Hunniford and Julia Somerville and since 2013, she has co-hosted Holiday Hit Squad on the BBC alongside Helen Skelton and Joe Crowley."]}, {"page": "BBC Nine O'Clock News", "response": ["Other notable presenters have included John Edmunds, Peter Woods, Richard Whitmore, Angela Rippon, Jan Leeming, John Humphrys, John Simpson, Sue Lawley, Julia Somerville, Andrew Harvey,  Moira Stuart, Nicholas Witchell, Martyn Lewis, Michael Buerk, Peter Sissons and George Alagiah."]}, {"page": "James Somerville", "response": ["In 1913, Somerville married Mary Main; they had a daughter and a son. The news reader Julia Somerville is one of their granddaughters.Morris, p. 33"]}, {"page": "ITV News", "response": ["First Report was moved to 13:00 and retitled News at One in 1976; Leonard Parkin and Peter Sissons alternated in the presenter's chair. Michael Nicholson continued as main newscaster of the News at 545, with Martyn Lewis replacing Parkin as the relief presenter. In 1986, Nicholson left newscasting to return to war reporting and was replaced by Alastair Stewart. Leonard Parkin retired in 1987, and Peter Sissons became a main newscaster for ITN's Channel 4 News (before moving to the BBC in 1989) – it was at this point that the programme revamped. It was moved to 12:30, and appropriately became the News at 12:30. Julia Somerville joined ITN from the BBC's Nine O'Clock News to host the new programme, with John Suchet and Jon Snow acting as relief presenters. In 1988, the programme returned to its original slot and once again became the News at One; the presenting line-up remained unchanged. In 1989, Somerville left the programme to become a main presenter of News at Ten, leaving Suchet to become the main lunchtime newscaster – the programme was revamped once more. In 1991, the programme moved back to the 12:30 slot, but retained the studio setting. In 1993, graphics were relaunched to bring it in line with other ITN news bulletins.", "ITN's regular newscasting team in the 1980s included Alastair Burnet, Sandy Gall, Leonard Parkin, Alastair Stewart, Trevor McDonald, Julia Somerville, Carol Barnes, Fiona Armstrong, John Suchet, Nicholas Owen, and a host of well-known reporters and correspondents.", "In 1991, ITN moved into its new building at Gray's Inn Road, London (previously owned by The Sunday Times). From this year, ITN news programmes revamped and moved to be presented from the ITV newsroom, foremostly to show the impressive atrium in the newly purchased headquarters – with the exception of the lunchtime programme which continued with its own studio and music, but took on elements of the new revamp – such as the serif font style newly introduced for ITN bulletins. The News at 12:30 bulletin itself was renamed the Lunchtime News in 1992. The main lunchtime newscasters between 1992 and 1995 were Nicholas Owen and Carol Barnes. Dermot Murnaghan, Sonia Ruseler and Julia Somerville acted as relief newscasters until 1995, when Murnaghan and Somerville became the bulletin's regular newscasters.", "News at Ten underwent a revamp on 9 November 1992 after the departures of newscasters Alastair Burnet (in August 1991) and Sandy Gall (in early 1992, though he did remain at ITN filing special war reports for News at Ten). A new set was created for the programme, featuring television monitors, a large video screen, and a curved desk with \"News at Ten\" inscribed into it. Trevor McDonald became the sole newscaster of the programme. John Suchet, Dermot Murnaghan, and Julia Somerville were relief presenters for the bulletin. Initially, the new-look News at Ten was presented from the same studio as the Early Evening News, adjacent to the ITV newsroom.", "The team of Alastair Burnet and Peter Sissons provided many memorable election night programmes on ITV, including the 1984 European elections and Election 87, but by 1992 the faces of ITV's political coverage had changed somewhat. Election 92 was anchored by Jon Snow, with Alastair Stewart providing graphical commentary and Julia Somerville assisting with regular news summaries. Stewart and Somerville were again present for ITV's 1997 coverage of the John Major-Tony Blair election – aptly titled Election 97 – with Jonathan Dimbleby as the anchor. Dimbleby returned for Election 2001 and Election 2005, aided both times by ITV News' political editors John Sergeant (in 2001) and Nick Robinson (in 2005) and a team of correspondents and newscasters around the country at polling stations."]}, {"page": "ITV News at Ten", "response": ["Burnet retired from ITN in 1991 after several clashes with the ITV companies over the future of the news organisation. In November 1992, News at Ten was given its first major relaunch, in part to address the criticism it had attracted over the last few years. In a bid to regain the personal touch that had been lost, the programme dispensed with the dual-presentation team in favour of a sole newscaster, Trevor McDonald, who subsequently became one of the most well-known newscasters in the UK. Julia Somerville, John Suchet and Dermot Murnaghan each presented News at Ten when McDonald was absent. The bulletin carried this format until March 1999.", "*Julia Somerville (1990–1999)"]}, {"page": "ITV Evening News", "response": ["*Julia Somerville (1999–2000)"]}, {"page": "ITV Lunchtime News", "response": ["On 20 July 1987, the bulletin was relaunched as News at 12:30. Jon Snow and former BBC newsreader Julia Somerville fronted alternate editions of the programme. On 7 March 1988, ITV's daytime programming was rejigged and the bulletin was moved back to its 1:00pm timeslot. News at One later relaunched on 16 October 1989 with John Suchet as its lead presenter. On 7 January 1991, the programme moved this time to 12:30pm.", "On 2 March 1992, News at 12:30 was relaunched as the Lunchtime News with a dual-presenting team comprising Nicholas Owen and Carol Barnes. On 6 March 1995, ITN's news bulletins were relaunched with a cohesive identity. The Lunchtime News on air team was revamped, this time with a returning Julia Somerville alongside Dermot Murnaghan. Owen and Barnes remained as relief presenters.", "*Julia Somerville (1987–2000)"]}, {"page": "BBC Breakfast", "response": ["* Julia Somerville (2010)"]}, {"page": "Headington School", "response": ["*Julia Somerville, former BBC News and ITV News presenter"]}, {"page": "List of people with brain tumors", "response": ["| Julia Somerville"]}, {"page": "MasterChef (British TV series)", "response": ["* 2017: Angellica Bell, Rebecca Adlington, Abdullah Afzal, Kate Bottley, Patti Boulaye, Brian Bovell, Tyger Drew-Honey, Lesley Garrett, Dev Griffin, Barney Harwood, Stephen Hendry, Jaymi Hensley, Ulrika Jonsson, Henri Leconte, Debbie McGee, Aasmah Mir, Jim Moir, Nick Moran, Julia Somerville and Rachel Stevens."]}, {"page": "Dinder", "response": ["The crest of the Somerville Family (Admiral of the Fleet James Somerville, author and poet Christopher Somerville and newsreader Julia Somerville) features a dragon and wheel."]}, {"page": "ITV Weekend News", "response": ["*Julia Somerville (1984–1985)"]}, {"page": "Sarah Lockett", "response": ["In January 2000 a 30-year-old man was jailed for 30 months for stalking Lockett. He wrote some 80 letters, stalked the Meridian studios, and tried to find out her home address. He told Lockett: \"Every celebrity needs a stalker.\"BBC NEWS | UK | Lonely fans who target celebrities The court case preceded cases involving Emily Maitlis and Julia Somerville."]}, {"page": "The Queen (2006 film)", "response": ["The film utilizes archival footage of Diana, Princess of Wales, Camilla Parker Bowles, Nicholas Owen, Julia Somerville, Martyn Lewis, Trevor McDonald and John Suchet."]}, {"page": "List of former BBC newsreaders and journalists", "response": ["* Angela Rippon – the first female newsreader of the BBC Nine O'Clock News when she was appointed in 1975. Later joined TV AM and presented many other shows, including Masterteam, What's My Line? and Crufts. She now co-presents the BBC's Rip Off Britain alongside Gloria Hunniford and Julia Somerville.", "*Julia Somerville – former BBC journalist, Labour Affairs Correspondent and newsreader, who frequently presented the BBC Nine O'Clock News during the 1980s.  She later moved to ITN, and subsequently returned to the BBC to co-host Rip Off Britain."]}, {"page": "Category talk:British journalists", "response": ["Julia Somervillenot yet classified"]}, {"page": "ITN World News", "response": ["*Julia Somerville – Special Presenter [Gulf War Coverage], 1991"]}, {"page": "Somerville (surname)", "response": ["*Julia Somerville (b. 1947), ITN newsreader"]}, {"page": "List of ITV journalists and newsreaders", "response": ["* Julia Somerville – joined ITN in 1987 to co-present the Lunchtime News; presenter of ITV News at Ten until it ended in 1999; remained at ITN until October 2001, presenting the ITV News at 1:30 and was the launch newscaster for the ITN News Channel"]}, {"page": "Paedophile Unit", "response": ["In 1995, newsreader Julia Somerville and her partner were arrested by the unit after they took nude pictures of Somerville's daughter in the bath for development at Boots. They were later released without charge as no crime had been committed."]}, {"page": "BBC Weekend News", "response": ["*Julia Somerville (2011–2012)"]}, {"page": "List of news presenters", "response": ["* Julia Somerville, ex-ITV News, now BBC News relief"]}, {"page": "Celebrity Mastermind", "response": ["| Julia Somerville || Winnie-the-Pooh"]}, {"page": "1992 in British television", "response": ["*9 November – ITV's News at Ten was given its first major relaunch, in part to address the criticism it had attracted over the last few years. In a bid to regain the personal touch that had been lost, the programme dispensed with the dual-presentation team in favour of a sole newscaster, Trevor McDonald, who subsequently became one of the most well-known newscasters in the UK. Julia Somerville, John Suchet and Dermot Murnaghan each presented News at Ten when McDonald was absent. The bulletin carried this format until 5 March 1999."]}, {"page": "1947 in British television", "response": ["* 14 July – Julia Somerville, journalist and newsreader"]}, {"page": "List of ITV News on air staff", "response": ["*Julia Somerville (1987–2001)"]}, {"page": "2010 in British television", "response": ["|Fiona Armstrong and Julia Somerville join the BBC News Channel as regular presenters. They will be joined by Zeinab Badawi and Carole Walker as the BBC seeks to fight accusations that it has an ageist policy."]}, {"page": "Rip Off Britain (TV programme)", "response": ["Rip Off Britain is a BBC One series which exposes Britain's rip-offs and helps consumers. It began on 30 November 2009, presented by former news journalists Angela Rippon, Gloria Hunniford and Jennie Bond. Newsreader Julia Somerville replaced Bond from series three. It has two spin-off series, Rip Off Britain Food and Rip Off Britain: Holidays. Rip Off Britain Live is shown for a week twice a year."]}]}}