{"wiki_id": "http://www.wikidata.org/entity/Q6307513", "itemLabel": "Julian Roberts", "itemDescription": "businessperson", "wikipedia_url": "https://en.wikipedia.org/wiki/Julian_Roberts_(businessman)", "wikipedia_page": {"main": "Julian Victor Frow Roberts (born 7 June 1957) is a British businessman. He was the chief executive of Old Mutual plc, an international long-term savings group until October 2015.", "link_mentions": [{"page": "Julian Roberts", "response": ["Richard Julian Roberts FSA (18 May 1930 – 20 October 2010) was a British librarian, bibliographer, and scholar.Obituary: Julian Roberts, The Times, 17 November 2010.", "Jointly with Andrew Watson in the early 1970s, Roberts edited John Dee's Library Catalogue. John Dee (1527–1608/9) was a consultant to Queen Elizabeth I who devoted much of his life to the study of alchemy and divination.R. Julian Roberts, Dee, John (1527–1609), Oxford Dictionary of National Biography, Oxford University Press, September 2004; online edition, May 2006. They published a new edition in 1990Julian Roberts and Andrew G. Watson (editors), John Dee’s Library Catalogue (Oxford University Press, 1990). . and continued to provide amendments and corrections.Julian Roberts and Andrew G. Watson, John Dee's Library Catalogue: additions and corrections , Bibliographical Society, UK. Roberts also contributed to the planning of the New Cambridge Bibliography of English Literature, with his colleague Ian Willison.Frederick Wilse Bateson (editor), New Cambridge Bibliography of English Literature (Cambridge University Press, 1974). . He provided much of the poetry section."]}, {"page": "List of people with surname Roberts", "response": ["*Julian Roberts, English librarian and bibliographer", "*Julian Roberts (businessman), Chief Executive of Old Mutual plc"]}, {"page": "Bruce Hemphill", "response": ["Jonathan Bruce Hemphill (born June 1963) is a South African businessman. He is the chief executive of Old Mutual, an international long-term savings group and FTSE 100 company, since 1 November 2015, succeeding Julian Roberts."]}]}}