{"wiki_id": "http://www.wikidata.org/entity/Q6303401", "itemLabel": "Judith Flanders", "itemDescription": "British historian and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Judith_Flanders", "wikipedia_page": {"main": "Judith Flanders (born 1959) is a historian, journalist and author, who has settled in London, England. Her writings centre on the Victorian period.", "link_mentions": [{"page": "List of historians", "response": ["*Judith Flanders (born 1959), Victorian British social"]}, {"page": "The Postman Always Rings Twice (novel)", "response": ["The historian Judith Flanders, however, has interpreted the title as a reference to postal customs in the Victorian era. When mail (post) was delivered, the postman knocked once to let the household know it was there: no reply was needed. When there was a telegram, however, which had to be handed over personally, he knocked twice so that the household would know to answer the door. Telegrams were expensive and usually the bringers of bad news: so a postman knocking (later, ringing) twice signaled trouble was on the way.Flanders, Judith (2003). The Victorian House: Daily Life from Childbirth to Deathbed. London: HarperCollins. p. 106. ."]}, {"page": "Red Barn Murder", "response": ["Corder was easily discovered, as Ayres, the constable in Polstead, was able to obtain his old address from a friend. Ayres was assisted by James Lea, an officer of the London police who later led the investigation into \"Spring-heeled Jack\". They tracked Corder to Everley Grove House, a boarding house for ladies in Brentford. He was running the boarding house with his new wife Mary Moore, whom he had met through a lonely hearts advertisement that he had placed in The Times (which had received more than 100 replies).Maclaren p. 250 Judith Flanders states in her 2011 book that Corder had also placed advertisements in the Morning Herald and The Sunday Times.Flanders p. 47 He received more than forty replies from the Morning Herald and 53 from The Sunday Times that he never picked up.Flanders p. 48 These letters were subsequently published by George Foster in 1828.Anon published 1828 by George Foster"]}, {"page": "Alice Kipling", "response": ["Alice Kipling features in the 2002 biography A Circle of Sisters: Alice Kipling, Georgiana Burne-Jones, Agnes Poynter and Louisa Baldwin by Judith Flanders."]}, {"page": "List of Skidmore College people", "response": ["*Judith Flanders, author and historian (Class of 1980)Snyderman, Peri (Spring 2009). \"Class Notes 1980\". Skidmore Scope. Retrieved October 31, 2018."]}, {"page": "At Home: A Short History of Private Life", "response": ["The review in The Guardian noted that the book is not really about home, but a venue for Bryson to present each of a series of historical events as a \"well-turned story, a mildly humorous aside, a colourful anecdote\". Historian Judith Flanders said that \"occasionally the book seems to have better jokes than it does a sense of history\" but still called the book a \"treasure\"."]}, {"page": "Ruth the Betrayer", "response": ["Ruth the Betrayer; or, The Female Spy, by Edward Ellis was the first fictional female detective story., Barry Ono Collections, shelfmark:C.140.c.41/Mic.C.12114: its primacy is demonstrated in a paper given by Judith Flanders in July 2010 to the Second Annual Conference of the Victorian Popular Fiction Association at Senate House, London, and published in the Times Literary Supplement of 18 June 2010, pp. 14-15 under the title \"The Hanky-Panky Way: Creators of the first female detectives – a mystery solved\". It was published as a penny dreadful in 52 parts in 1862-63 by John Dicks, and the British Library's single-volume compilation copy was acquired on 28 February 1863.British Library acquisition stamp It therefore predates Andrew Forrester's The Female Detective and W.S. Hayward's The Revelations of a Lady Detective, both of 1863/4. Flanders, 2011, and see also Edward Ellis, Ruth the Betrayer: or, The Female Spy (Valancourt, 2019), especially the introduction by Dagni Bredesen."]}, {"page": "Flanders (surname)", "response": ["* Judith Flanders (born 1959), British historian and author"]}, {"page": "Historiography of the United Kingdom", "response": ["* Judith Flanders (born 1959), Victorian social"]}, {"page": "Festival Musikdorf Ernen", "response": ["* Literature Seminars – led by Donna Leon and Judith Flanders; previous lecturers have been Richard Powers, Tom Holland and Elisabeth Bronfen "]}, {"page": "Dance of Death: Du Lac & Fey", "response": ["The original idea for the game was a simpler story of a man and his dog, but this changed due to the creative director Jessica Saunders' fascination with Arthurian mythology and its evolution over the time, including during the Victorian era. The fantasy premise and elements aside, the game is to be as historically accurate as possible. In that task the team was aided by historian Judith Flanders, who had previously worked on Assassin's Creed Syndicate; Rhianna Pratchett is also credited as story consultant.The game's end credits. The game's art style was inspired by the works of 19th-century painters John Atkinson Grimshaw and James Abbot McNeill Whistler."]}, {"page": "List of Private Passions episodes (2000–2004)", "response": ["|rowspan=\"8\"|Judith Flanders"]}]}}