{"wiki_id": "http://www.wikidata.org/entity/Q6312372", "itemLabel": "June Miles-Kingston", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/June_Miles-Kingston", "wikipedia_page": {"main": "June Miles-Kingston is a British singer and drummer, best known for her work with various successful bands and singers in the 1980s. She was a founding member of the post-punk group The Mo-dettes, which lasted from 1979 to 1982, and later became a session drummer and backing vocalist for a variety of British post-punk, new wave, and pop artists.", "link_mentions": [{"page": "Jimmy Somerville", "response": ["The Communards split in 1988; Somerville began a solo career the following year. He released his debut solo album Read My Lips in November 1989, which contained three UK Top 30 hits, including a hit cover of Sylvester's disco classic \"You Make Me Feel (Mighty Real)\" and a cover of \"Comment te dire adieu?\", a duet with June Miles-Kingston, which reached number 14 in the UK Singles chart. He also sang on the second Band Aid project at the end of 1989."]}, {"page": "The Communards", "response": ["* June Miles-Kingston"]}, {"page": "The Seer (Big Country album)", "response": ["*June Miles-Kingston - backing vocals on \"Eiledon\" and \"Remembrance Day\""]}, {"page": "Tenpole Tudor", "response": ["Ed-Tudor Pole and Dick Crippen appeared onstage together for the first time in over 35 years in September 2016 in support of charities Rhythmix and Heads On. Bob Kingston is the brother of the former The Mo-dettes drummer June Miles-Kingston. Since 1988, Crippen has owned and operated the Panther Recording Studio in Surrey, producing many rock, punk and garage bands such as Chelsea and Johnny Moped. He also plays guitar in The Weird Things."]}, {"page": "Our Lips Are Sealed", "response": ["The following year, co-writer Terry Hall re-recorded the song with his own band, Fun Boy Three. It was included on their second album Waiting and reached number seven on the UK Singles Chart, and was the last single to chart in the UK before their split later in 1983. Backing vocals were provided by Mo-dettes drummer June Miles-Kingston, who also played drums on the single and the Waiting LP."]}, {"page": "The Lover Speaks", "response": ["In July 1986, the band released their debut single, \"No More \"I Love You's\"\", which peaked at No. 58 in the UK. In August, the band's self-titled debut album, The Lover Speaks, was released. Produced by Iovine, and featuring contributions from Stewart, June Miles-Kingston and Nils Lofgren among others, the album was a commercial failure. In September, the album's second single, \"Tremble Dancing\", also failed to enter the charts. The third and final single, \"Every Lover's Sign\", was released in October, and in December peaked at No. 6 on the US Billboard Dance Club Songs chart. Following the release of the album, the band opened for Eurythmics during their Revenge World Tour."]}, {"page": "Love Not Money", "response": ["Love Not Money is EBTG's \"most overtly politicised\" album. Besides Thorn and Watt, notable performers on the album include June Miles-Kingston, Phil Moxham, Neil Scott and B.J. Cole. The tracks \"When All's Well\" and \"Angel\" were released as singles in the UK.  Love Not Money was reissued in 2012 as a remastered two-disc deluxe set by Edsel Records.", "*June Miles-Kingston – drums, backing vocals"]}, {"page": "Waiting (Fun Boy Three album)", "response": ["*June Miles-Kingston - drums, vocals"]}, {"page": "List of performances on Top of the Pops", "response": ["* Jimmy Somerville & June Miles-Kingston – \"Comment te dire adieu?\""]}, {"page": "Comment te dire adieu", "response": ["The song was covered in 1989 by former Bronski Beat and Communards singer Jimmy Somerville, as a duet with June Miles-Kingston. It was a hit in the UK, reaching number 14 on the UK singles chart, helping Somerville's solo career take off."]}, {"page": "No More \"I Love You's\"", "response": ["\"No More 'I Love You's had been the first song written by Freeman and Hughes as The Lover Speaks. It was demoed on a portastudio during a rehearsal studio session, featuring Robert Farrell (guitar), Barry Gilbert (keyboards) and Pete King (drums). It was then demoed again with the same line-up at Pathway Studios. Hughes' ex-girlfriend and singer June Miles-Kingston provided backing vocals. This demo was used as a guide when recording the studio version for their debut album. The recording of the song with Iovine used backing vocals from Freeman (sped-up to increase the pitch), Miles-Kingston and Alex Brown."]}, {"page": "Mo-dettes", "response": ["Mo-dettes was an English all-female post-punk band, formed in 1979 by guitarist Kate Korris, an original member of The Slits and brief member of The Raincoats, and bassist Jane Crockford, former member of Bank of Dresden. Ramona Carlier (vocals) - and June Miles-Kingston (drums) completed the line-up.", "Bassist Jane Crockford was married in 1980 to Daniel Woodgate of the ska band Madness; the marriage lasted for 15 years. June Miles-Kingston first returned to the studio when she played drums and sang backing vocals on Fun Boy Three's \"Our Lips Are Sealed\", and in the late 1980s as the drummer for The Communards. During this period, she also worked with Thompson Twins, and Everything but the Girl.  Miles-Kingston is the sister of the former Tenpole Tudor guitarist Bob Kingston.", "* June Miles-Kingston – drums"]}, {"page": "June Miles Kingston", "response": ["#REDIRECT June Miles-Kingston"]}, {"page": "Fern Britton Meets...", "response": ["|Will Coles (Brother) Lorna Gradden (Manager, The Communards) Helen Fielding (Author, Bridget Jones's Diary) June Miles-Kingston (Drummer, The Communards) Annajoy David (Friend) Ian Hislop (Private Eye) Revd Kate Bottley (Gogglebox Vicar and Friend) Sarah Jane Morris (Singer, The Communards) Rev Giles Fraser (Friend) Sara Maitland (Religious Author and Friend) Chris Evans (Broadcaster)"]}, {"page": "Everything but the Girl (album)", "response": ["*June Miles-Kingston – drums, vocals"]}, {"page": "For a Friend: The Best of Bronski Beat, The Communards & Jimmy Somerville", "response": ["* Featuring June Miles-Kingston"]}, {"page": "Red (The Communards album)", "response": ["* June Miles-Kingston – drums, mixing, backing vocals"]}, {"page": "List of female drummers", "response": ["* June Miles-Kingston (Everything But The Girl)"]}, {"page": "Jimmy Somerville discography", "response": ["|align=\"left\"|\"Comment te dire adieu?\" with June Miles-Kingston"]}, {"page": "Read My Lips (Jimmy Somerville album)", "response": ["#\"Comment te dire adieu\" featuring June Miles-Kingston (Jack Gold, Arnold Goland, Serge Gainsbourg) - 3:37 \t", "#\"Comment te dire adieu\" (featuring June Miles-Kingston) - 3:39 \t", "#\"Comment te dire adieu\" (featuring June Miles-Kingston)", "|\"Comment te dire adieu\"featuring June Miles-Kingston"]}, {"page": "Women in punk rock", "response": ["* June Miles-Kingston"]}, {"page": "The Story So Far (Mo-dettes album)", "response": ["*June Miles-Kingston - drums"]}, {"page": "Wooden Foot Cops on the Highway", "response": ["*June Miles-Kingston, Mark Lussana Tunkara - additional vocals"]}, {"page": "The Lover Speaks (album)", "response": ["* June Miles-Kingston, Alex Brown, Lynn Davis – backing vocals"]}, {"page": "Every Lover's Sign", "response": ["* June Miles-Kingston, Alex Brown, Lynn Davis – backing vocals"]}]}}