{"wiki_id": "http://www.wikidata.org/entity/Q6312799", "itemLabel": "Jungle Drummer", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Jungle_Drummer", "wikipedia_page": {"main": "Chris Polglase (born 12 January 1978, in Newcastle), known professionally as The Jungle Drummer, is an electronic music session drummer. He is most noted for his work with DJ Fu (who mixed and scratched while Polglase performed) and live drum and bass act London Elektricity.\n\n", "link_mentions": [{"page": "London Elektricity", "response": ["In 2002, Chris Goss departed to concentrate on managing Hospital Records, leaving it a solo project of Tony Colman. The second album Billion Dollar Gravy was released in 2003. During the making of the album, the session musicians began to coalesce into a band, and Colman decided to take the band live. The line-up included Colman, Andy Waterworth, Landslide, MC Wrec, the Jungle Drummer, Liane Carroll and Robert Owens, amongst others. In 2004 they released a live DVD entitled London Elektricity: Live Gravy, which was recorded in October 2003 at the Jazz Café."]}, {"page": "Exit (festival)", "response": ["|Bjesovi, Block Out, Blue States, Brenda Russel, Van Gogh, Veliki Prezir, Will Saul, Goran Bare, Grooverider, Darren Emerson, Darkwood Dub, Darko Rundek, David Morales, Del Arno Band, Derrick Carter, DJ Hype, Eva Braun, Asian Dub Foundation, Električni Orgazam, Andy C, Zion Train, Impact, Jarboli, Krafty Kuts, Cubismo, KUD Idijoti, Let 3, Love Hunters, Marshall Jeferson, Manchild, Nicky Blackmarket, Novembar, Obojeni program, Orthodox Celts, Partibrejkers, Plump DJs, Psihomodo Pop, Rambo Amadeus, Ritam Nereda, Robert Owens, Smoke City, Télépopmusik, Transglobal Underground, Faze Action, High Contrast, Hladno pivo, Horace Andy, Jungle Drummer, Johnny Clarke, Celloman, Džukele"]}, {"page": "Stamina MC", "response": ["He was also part of the original line up for the London Elektricity LIVE band (alongside Andy Waterworth, Jungle Drummer, Lianne Carroll, Tim Landslide and Robert Owens), touring the country with them and featuring on the 'Live Gravy' DVD, filmed at the Jazz Café in October 2003 and released on Hospital Records. Further live exploits came in the form of 'CPF Live' - an act put together by Craggz and Parallel Forces to support their album release on Valve Recordings entitled 'Northern Soul'."]}, {"page": "The Jungle Drummer", "response": ["#REDIRECT Jungle Drummer"]}, {"page": "Billion Dollar Gravy", "response": ["Billion Dollar Gravy is the second studio album by drum n bass act London Elektricity, released in 2003. The album is known for its usage of live musicians, such as the Jungle Drummer (drums), Liane Carroll (jazz vocals), Andy Waterworth (upright bass), Robert Owens (vocals), and others, much like London Elektricity's debut, Pull the Plug.Performers on \"Billion Dollar Gravy\"Jungle Drummer's appearances  "]}, {"page": "Keleketla!", "response": ["*Chris \"The Jungle Drummer\" Polglase – drums (track 6)"]}]}}