{"wiki_id": "http://www.wikidata.org/entity/Q63184", "itemLabel": "Bill Brandt", "itemDescription": "German-British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_Brandt", "wikipedia_page": {"main": "Bill Brandt (born Hermann Wilhelm Brandt; 2 May 1904 – 20 December 1983): 14  was a British photographer and photojournalist. Born in Germany, Brandt moved to England, where he became known for his images of British society for such magazine as Lilliput and Picture Post, later he made distorted nudes, portraits of famous artists and landscapes. He is widely considered to be one of the most important British photographers of the 20th century.", "link_mentions": [{"page": "May 2", "response": ["*1904 – Bill Brandt, German-English photographer and journalist (d. 1983)"]}, {"page": "1983", "response": ["** Bill Brandt, German-British photographer and photojournalist(b. 1904)"]}, {"page": "List of photographers", "response": ["* Bill Brandt (1904–1983)"]}, {"page": "Victoria and Albert Museum", "response": ["The collection includes the work of many photographers from Fox Talbot, Julia Margaret Cameron, Viscountess Clementina Hawarden, Gustave Le Gray, Benjamin Brecknell Turner, Frederick Hollyer, Samuel Bourne, Roger Fenton, Man Ray, Henri Cartier-Bresson, Ilse Bing, Bill Brandt, Cecil Beaton (there are more than 8000 of his negatives), Don McCullin, David Bailey, Jim Lee and Helen Chadwick to the present day."]}, {"page": "Diane Arbus", "response": ["Arbus received her first camera, a Graflex, from Allan shortly after they married. Shortly thereafter, she enrolled in classes with photographer Berenice Abbott. The Arbuses' interests in photography led them, in 1941, to visit the gallery of Alfred Stieglitz, and learn about the photographers Mathew Brady, Timothy O'Sullivan, Paul Strand, Bill Brandt, and Eugène Atget.Diane Arbus: Revelations. New York: Random House, 2003. .Ronnen, Meir. \"The Velazquez of New York\".  The Jerusalem Post, October 10, 2003. Retrieved February 12, 2010. In the early 1940s, Diane's father employed them to take photographs for the department store's advertisements. Allan was a photographer for the U.S. Army Signal Corps in World War II."]}, {"page": "Imperial War Museum", "response": ["The museum's Photograph Archive preserves photographs by official, amateur and professional photographers. The collection includes the official British photographic record of the two world wars; the First World War collection includes the work of photographers such as Ernest Brooks and John Warwick Brooke. The archive also holds 150,000 British aerial photographs from the First World War, the largest collection of its kind. The Second World War collection includes the work of photographers such as Bill Brandt, Cecil Beaton'Beaton's record of war revived', The Times, 7 October 1981, Issue 61049, page 7 column C and Bert Hardy. Like the Film Archive, the Photograph Archive is an official repository under the 1958 Public Records Act, and as such continues to receive material from the Ministry of Defence. In 2012 the museum reported the size of its photographic holdings as approximately 11 million images in 17,263 collections."]}, {"page": "1904 in art", "response": ["* 2 May – Bill Brandt, German-born British photographer and photojournalist (d. 1983)."]}, {"page": "Getty Images", "response": ["Since its formation, Getty Images has pursued an aggressive programme of acquisition, buying up many privately owned agencies that had built up the stock photography industry, from small family-run firms to larger agencies. By 1999, it had acquired one of the largest agencies, Tony Stone Images; the online art seller Art.com; the sports photography agency Allsport; the market leader in the Benelux and Scandinavia: Word View (1996, from Mr. Bert Blokhuis, four offices, for undisclosed sum); journalistic specialists Liaison Agency; Newsmakers, the first digital news photo agency; Online USA, a specialist in celebrity shots; and the Hulton Press Library, the former archive of the British photojournalistic magazine Picture Post. The Hulton collection was sold by the BBC to Brian Deutsch in 1988, when it was renamed Hulton Deutsch. In 1996, the Hulton collection was sold on once more, this time purchased by Getty Images and renamed Hulton Getty. With the acquisition of the Hulton library, Getty Images took ownership of the rights to some 15 million photographs from British press archives dating back to the nineteenth century. Hulton Getty also included photographs from the Keystone Collection, as well as images by notable photographers such as Bert Hardy, Bill Brandt, Weegee and Ernst Haas. (archived on the Web Archive)"]}, {"page": "W. Eugene Smith", "response": ["In late 1949, Smith was sent to the UK to cover the General Election, when the Labour Party, under Clement Attlee, was re-elected with a tiny majority.Smith, W. Eugene. Let Truth be the Prejudice: W. Eugene Smith, His Life and Photographs. New York: Aperture, 1985. p.39  Smith also travelled to Wales where a he photographed a series of studies of miners in South Wales Valleys. Critics have compared Smith's work to similar studies made by Bill Brandt. In a documentary made by BBC Wales, Dai Smith located a miner who described how he and two colleagues had met Smith on their way home from work at the pit and had been instructed on how to pose for one of the photographs published in Life."]}, {"page": "Robert Frank", "response": ["Inspired by fellow Swiss Jakob Tuggener's 1943 filmic book Fabrik, Bill Brandt's The English at Home (1936), and Walker Evans's American Photographs (1938),Tom Maloney U. S. Camera 1958. U. S. Camera Publishing, New York, 1957, p.115 and on the recommendation of Evans (a previous recipient), Alexey Brodovitch, Alexander Leiberman, Edward Steichen, and Meyer Schapiro, Frank secured a Guggenheim Fellowship from the John Simon Guggenheim Memorial Foundation in 1955 to travel across the United States and photograph all strata of its society. Cities he visited included Detroit and Dearborn, Michigan; Savannah, Georgia; Miami Beach and St. Petersburg, Florida; New Orleans, Louisiana; Houston, Texas; Los Angeles, California; Reno, Nevada; Salt Lake City, Utah; Butte, Montana; and Chicago, Illinois. He took his family along with him for part of his series of road trips over the next two years, during which time he took 28,000 shots. 83 of these were selected by him for publication in The Americans."]}, {"page": "The Americans (photography)", "response": ["Inspired by fellow Swiss Tuggener's book, Bill Brandt's The English at Home (1936), and Walker Evans American Photographs (1938),Tom Maloney U. S. Camera 1958. U. S. Camera Publishing, New York, 1957, p.115 and on the recommendation of Evans (a previous recipient), Alexey Brodovitch, Alexander Liberman, Edward Steichen, and Meyer Schapiro, Frank secured a Guggenheim Fellowship from the John Simon Guggenheim Memorial Foundation in 1955 to travel across the United States and photograph all strata of its society. He took his family along with him for part of his series of road trips over the next two years, during which time he took 28,000 shots. Only 83 of those were finally selected by him for publication in The Americans."]}, {"page": "Air raid shelter", "response": ["Artists and photographers such as Henry Moore and Bill Brandt were employed as war artists to document life in London's shelters during the Second World War."]}]}}