{"wiki_id": "http://www.wikidata.org/entity/Q6312280", "itemLabel": "June Flewett", "itemDescription": "British actor and theatre director", "wikipedia_url": "https://en.wikipedia.org/wiki/June_Flewett", "wikipedia_page": {"main": "June Beatrice Freud, Lady Freud (née Flewett; born 22 June 1927),  is a British actress and theatre director. She is also known by her stage-name Jill Raymond, and was usually known as Jill Freud after her marriage to Clement Freud.\nAs a war-time teenager, she was evacuated to C.S. Lewis's house in Oxford and she is said to have been the inspiration for Lucy Pevensie in the Chronicles of Narnia.", "link_mentions": [{"page": "Sigmund Freud", "response": ["Mark St. Germain's 2009 play Freud's Last Session imagines a meeting between C. S. Lewis, aged 40, and Freud, aged 83, at Freud's house in Hampstead, London, in 1939, as the Second World War is about to break out. The play is focused on the two men discussing religion and whether it should be seen as a sign of neurosis. The play is inspired by the 2003 non-fiction book The Question of God: C.S. Lewis and Sigmund Freud Debate God, Love, Sex, and the Meaning of Life by Armand Nicholi which also inspired a four-part non-fiction PBS series. (Although, no such meeting took place, June Flewett, who as a teenager stayed with C.S. Lewis and his brother during the wartime London air-raids, later married Freud's grandson Clement Freud.)Nigel Farndale, 'I was sure that children would not want to be told that this old lady was Lucy', Telegraph Co. UK, 11 December 2005"]}, {"page": "Clement Freud", "response": ["During the war Freud joined the Royal Ulster Rifles and served in the ranks. He acted as an aide to Field Marshal Montgomery. He worked at the Nuremberg Trials and in 1947 was commissioned as an officer. He married June Flewett (the inspiration for Lucy Pevensie in C. S. Lewis's children's series The Chronicles of Narnia)'I was sure that children would not want to be told that this old lady was Lucy' , The Daily Telegraph (London), 11 December 2005. in 1950, and the couple had five children. Flewett had taken the stage name Jill Raymond in 1944, and after her husband's knighthood, has been known as Lady Freud. Freud became an Anglican at the time of his marriage."]}, {"page": "List of show business families", "response": ["* Late politician, broadcaster and writer Sir Clement Freud, grandson of Sigmund Freud, was married to director and actress June Flewett and had five children, including public relations executive Matthew and broadcaster and presenter Emma Freud. Sir Clement's niece, novelist and screenwriter Esther Freud, is married to actor David Morrissey."]}, {"page": "Emma Freud", "response": ["Emma Freud was born in London on 25 January 1962 and is the daughter of politician and broadcaster Sir Clement Freud (1924–2009) and June Flewett, known as the actress Jill Freud. She is the great-granddaughter of psychoanalyst Sigmund Freud. Her younger brother is Matthew Freud, and her uncle was the painter Lucian Freud. Her father's family were Jewish refugees."]}, {"page": "Lucy Pevensie", "response": ["The character of Lucy Pevensie was inspired by June Flewett,The Daily Telegraph, 11 December 2005. a devout Catholic London girl evacuated by her convent to The Kilns, Lewis' country home in 1942, and named after Lewis' goddaughter Lucy Barfield, to whom he dedicated The Lion, The Witch and the Wardrobe. Lucy is described in the book as being fair-haired: \"But as for Lucy, she was always gay and golden-haired, and all princes in those parts desired her to be their Queen, and her people called her Queen Lucy the Valiant.\"Lewis, C.S. \"The Lion, the Witch, and the Wardrobe\", p. 201"]}, {"page": "Matthew Freud", "response": ["Freud is the son of the actress June Flewett and the writer and politician Sir Clement Freud. His sister is television interviewer Emma Freud. His great-grandfather was Sigmund Freud. He is the nephew of the late artist Lucian Freud and (by former marriage) of the late writer Lady Caroline Blackwood, and his cousins include fashion designer Bella Freud, and novelists Susie Boyt and Esther Freud."]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*June Flewett (Acting Diploma 1947)"]}, {"page": "Freud family", "response": ["##Clemens Rafael Freud (1924–2009, later Sir Clement Raphael Freud) married June Flewett (stage name Jill Raymond) in 1950 and had 5 children:"]}, {"page": "Jill Raymond", "response": ["#REDIRECTJune Flewett"]}, {"page": "Timeline of Oxford", "response": ["** September: C. S. Lewis first narrates stories which will form The Chronicles of Narnia to child evacuees sharing his home at The Kilns; June Flewett is a housekeeper."]}, {"page": "Jill Freud", "response": ["#REDIRECTJune Flewett"]}]}}