{"wiki_id": "http://www.wikidata.org/entity/Q633115", "itemLabel": "Archibald Dalzel", "itemDescription": "British adventurer and Governor of the Gold Coast (1740-1811)", "wikipedia_url": "https://en.wikipedia.org/wiki/Archibald_Dalzel", "wikipedia_page": {"main": "Archibald Dalzel (1740–1812) was a British adventurer and Governor of the Gold Coast (now Ghana).\n\n", "link_mentions": [{"page": "Atlantic slave trade", "response": ["No scholars dispute the harm done to the enslaved people but the effect of the trade on African societies is much debated, due to the apparent influx of goods to Africans. Proponents of the slave trade, such as Archibald Dalzel, argued that African societies were robust and not much affected by the trade. In the 19th century, European abolitionists, most prominently Dr. David Livingstone, took the opposite view, arguing that the fragile local economy and societies were being severely harmed by the trade."]}, {"page": "Fon people", "response": ["While references and documented history about the Fon people are scant before the 17th century, there are abundant documents on them from the 17th century, particularly written by European travelers and traders to West African coasts. These memoirs mention such cities as Ouidah and Abomey. Among the most circulated texts are those of Archibald Dalzel, a slave trader who in 1793 wrote the legends, history and slave trading practices of the Fon people in a book titled the History of Dahomey.I. A. Akinjogbin (1966), Archibald Dalzel: Slave Trader and Historian of Dahomey, The Journal of African History, Cambridge University Press, Vol. 7, No. 1 (1966), pages 67-78 Modern era scholars have questioned the objectivity and accuracy of Dalzel, and to what extent his pioneering book on Fon people was a polemic or dispassionate scholarship."]}, {"page": "List of governors of the Gold Coast", "response": ["* Archibald Dalzel, 31 March 1792 – 16 December 1798, first time", "* Archibald Dalzel, 28 April 1800 – 30 September 1802, second time"]}, {"page": "List of English people", "response": ["* Archibald Dalzel (1740–1811), Governor of the Gold Coast"]}, {"page": "History of the Kingdom of Dahomey", "response": ["European historiography of Dahomey has been significant for its use in debates about the morality of the slave trade and for its importance to fields outside African history.  Many of the early histories and descriptions were written by slave traders and the conclusions were that the slave trade was a process of freeing the population from the highly militarized, very brutal, and despotic Kingdom of Dahomey. William Snelgrave and Archibald Dalzel wrote key histories and memoirs of Dahomey presenting the case for the slave trade to save the population from human sacrifice. Abolitionist historians, in contrast, argued that the brutality of the Dahomey state was the result of the slave trade itself.  Dahomey was thus portrayed with a host of very negative stereotypes, with significant exaggeration, by European historians in the 18th and 19th century.  With increasing debates about the morality or immorality of the slave trade, Dahomey became a key aspect of the debate with significant attention."]}, {"page": "Panyarring", "response": ["Both Europeans and Africans began using panyarring as an extension of political and economic policies in the region and for a range of purported offenses. For example, in 1709 British slave traders were upset with an African slave trader who allegedly sold them a \"mad\" slave. When the dispute increased, the African slave traders panyarred the British captain and held him until both sides negotiated an outcome.  Similarly, in 1797 Archibald Dalzel, the British governor of the Gold Coast, panyarred a Fante priest in Anomabo when members of the village had refused to repay debts to British officers because those officers had died. Dalzel held the priest at the Cape Coast Castle for a week until the chief of Anomabo agreed to repay the debts. "]}, {"page": "Sir John Tobin", "response": ["In 1798 George Case & Co. made Tobin master of the Molly privateer, and he voyaged to Angola. He took as prize a Spanish ship from Cadiz bound for the River Plate in South America. He returned with Archibald Dalzel as passenger."]}]}}