{"wiki_id": "http://www.wikidata.org/entity/Q633167", "itemLabel": "Archibald Geikie", "itemDescription": "Scottish geologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Archibald_Geikie", "wikipedia_page": {"main": "Sir Archibald Geikie  (28 December 1835 – 10 November 1924) was a Scottish geologist and writer.", "link_mentions": [{"page": "Joseph Lister", "response": ["He served as a trustee on the Royal Society council between 1881 and 1883. Ten years later, in November 1893 Lister was elected for two years, to the position of foreign secretary of the society, succeeding the Scottish geologist Sir Archibald Geikie. In 1895 he was elected president of the Royal Society succeeding Lord Kelvin. He held the position until 1900."]}, {"page": "Thomas Henry Huxley", "response": ["The letters of Alfred Newton include one to his brother giving an eyewitness account of the debate, and written less than a month afterwards.Wollaston AFR 1921. Life of Alfred Newton: late Professor of Comparative Anatomy, Cambridge University 1866–1907, with a Preface by Sir Archibald Geikie OM. Dutton, NY. pp. 118–120. Other eyewitnesses, with one or two exceptions (Hooker especially thought he had made the best points), give similar accounts, at varying dates after the event.Jensen, J. Vernon 1991. Thomas Henry Huxley: communicating for science. U. of Delaware Press, Newark. [Chapter 3 is an excellent survey, and its notes gives references to all the eyewitness accounts except Newton: see notes 61, 66, 67, 78, 79, 80, 81, 84, 86, 87, 89, 90, 93, 95: pp. 208–211] The general view was and still is that Huxley got much the better of the exchange, though Wilberforce himself thought he had done quite well. In the absence of a verbatim report, differing perceptions are difficult to judge fairly; Huxley wrote a detailed account for Darwin, a letter which does not survive; however, a letter to his friend Frederick Daniel Dyster does survive with an account just three months after the event.Huxley to Dr FD Dyster, 9 September 1860, Huxley Papers 15.117. p. 118. Chapter 14"]}, {"page": "1924", "response": ["** Sir Archibald Geikie, British geologist (b. 1835)"]}, {"page": "1835", "response": ["* December 28 – Sir Archibald Geikie, Scottish geologist (d. 1924)"]}, {"page": "Dál Riata", "response": ["The Dalradian geological series, a term coined by Archibald Geikie in 1891, was named after Dál Riata because its outcrop has a similar geographical reach to that of the former kingdom."]}, {"page": "List of geologists", "response": ["* Archibald Geikie (1835–1924), Scottish, geologist, President of the Royal Society"]}, {"page": "Danggu Gorge National Park", "response": ["The gorge was originally named in honour of Sir Archibald Geikie, the Director General of Geological Survey for Great Britain and Ireland when it was given its European name in 1883. Sir Archibald never visited the gorge and the National Park is progressively being officially changed to the Bunuba traditional owners name of Danggu. It is part of the  Balili (Devonian Reef) Conservation Park."]}, {"page": "Baddeleyite", "response": ["It was named for Joseph Baddeley. The mineral was discovered in Rakwana, Ceylon, now known as Sri Lanka. Baddeley was a superintendent of a railroad project in Rakwana. As redacted by J. J. H. Teall, Director of the British Geological Survey in the early 1900s, Baddeleyite was discovered thanks to the discovery of Geikielite. Baddeley happened to send specimens of several pebbles to the Museum of Practical Geology in London, where Mr. Pringle examined them and attempted to classify them. According to Teall, the specimens were submitted to him by Pringle after he failed to assign them and compare them to other species, such as spinel, ilmenite, and so on. After analyzing the specimens, Teall concluded that the mineral was mainly composed of titanic acid and magnesia, with a very small percentage of protoxide of iron. Geikielite has the composition of MgTiO3. Concluding the various analyses, Teall and Pringle decided to name the new mineral Geikielite, taking the name after the Director General of the Geological Survey, Sir Archibald Geikie. Baddeley then decided to send more specimens to Teall in order to determine a proper specimen to be put in display at the Museum of Practical Geology. While trying to find the best specimen for display, as Teall relates, he noticed that one of the specimens was different from the rest. This new mineral as described was black in color, with a submetallic lustre and a hardness of 6.5. After analyzing the mineral, it was determined that its composition was not MgTiO3, as geikielite's, but it was ZrO2. Teall proposed that the new mineral should be named baddeleyite, after Joseph Baddeley to honor the man who brought two new minerals to notice."]}, {"page": "Wollaston Medal", "response": ["*1895 Archibald Geikie"]}, {"page": "Haslemere", "response": ["* Archibald Geikie (1834-1924) – geologist, retired to Haslemere in 1913"]}, {"page": "James Croll", "response": ["This led to a position in the Edinburgh office of the Geological Survey of Scotland, as keeper of maps and correspondence, where the director, Sir Archibald Geikie, encouraged his research.  "]}, {"page": "British Science Association", "response": ["* 1892: Sir Archibald Geikie, geologist"]}, {"page": "Geological Society of London", "response": ["The society counts many famous geologists amongst its past presidents. These include pioneers of geology William Buckland, Adam Sedgwick, Roderick Impey Murchison, Charles Lyell, Henry Thomas De la Beche, T.H.Huxley, Joseph Prestwich, Archibald Geikie, Jethro Teall, and Charles Lapworth. Later well-known names include Alfred Harker, Arthur Trueman, H.H.Read, and Frederick Shotton, and Janet Watson."]}]}}