{"wiki_id": "http://www.wikidata.org/entity/Q633823", "itemLabel": "Archie Goldie", "itemDescription": "Scottish footballer (1874-1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Archie_Goldie", "wikipedia_page": {"main": "Archibald Goldie (5 January 1874 – 7 April 1953) was a Scottish footballer who played as a right back for Liverpool, New Brighton Tower and Small Heath in the Football League in the 1890s and 1900s.", "link_mentions": [{"page": "Archibald Goldie", "response": ["#REDIRECT Archie Goldie"]}, {"page": "Walter Bunch", "response": ["He moved to Walsall in the 1899 close season, and played regularly, making 61 appearances in two seasons. At the end of his second season, Walsall failed to gain re-election to the Football League, so he signed for a third Midlands club, Small Heath, in September 1901. He played three times in the 1901–02 season, deputising for established full-backs Archie Goldie and Arthur Archer,Matthews (1995), p. 148. but was forced to retire in 1902, his career cut short by illness and injury."]}, {"page": "1902–03 Small Heath F.C. season", "response": ["Twenty-two players made at least one appearance in nationally organised first-team competition, and there were eleven different goalscorers. Archie Goldie was ever-present over the 35-match season, his full-back partner Harold Wassell missed only one match, and six other players made at least 30 appearances. Arthur Leonard was leading scorer with 16 goals, all of which came in the league. The 12–0 defeat of Doncaster Rovers in April equalled the club record highest win.\"Birmingham City: Records\" . Statto Organisation. Retrieved 23 May 2012."]}, {"page": "1901–02 Small Heath F.C. season", "response": ["Twenty-six players made at least one appearance in nationally organised first-team competition, and there were eleven different goalscorers. Goalkeeper Nat Robinson was ever-present over the 35-match season; full-back Archie Goldie and half-back Alex Leake each missed only one match. Bob McRoberts was leading scorer with 24 goals, of which 19 came in the league."]}, {"page": "Goldie (surname)", "response": ["*Archie Goldie (1874–1953), Scottish footballer"]}]}}