{"wiki_id": "http://www.wikidata.org/entity/Q6345345", "itemLabel": "Kadeem Harris", "itemDescription": "English association football player (born 1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kadeem_Harris", "wikipedia_page": {"main": "Kadeem Raymond Mathurin-Harris (born 8 June 1993), known as Kadeem Harris, is an English footballer who plays as a midfielder. He currently plays for Metalist Kharkiv in the Ukrainian First League.", "link_mentions": [{"page": "EFL Awards", "response": ["|| Kadeem Harris (Wycombe Wanderers)"]}, {"page": "Severnside derby", "response": ["|Anthony Pilkington Kadeem Harris "]}, {"page": "2009–10 Wycombe Wanderers F.C. season", "response": ["|align=\"left\"|30||align=\"left\"|MF||align=\"left\"| Kadeem Harris"]}, {"page": "2010–11 Wycombe Wanderers F.C. season", "response": ["|align=\"left\"|30||align=\"left\"|MF||align=\"left\"| Kadeem Harris"]}, {"page": "Kadeem", "response": ["*Kadeem Harris, English footballer"]}, {"page": "Stuart Dallas", "response": ["After making 3 cup appearances for Brentford in the 2013–14 season, Dallas signed for League Two side Northampton Town on a month's loan on 5 October 2013 and went straight into the squad for the Cobblers' match that day against AFC Wimbledon. After replacing Chris Hackett in the 57th minute, he scored Northampton's second goal in a 2–0 victory. He bagged his second Northampton goal in his third match for the club, following up fellow Brentford loanee Luke Norris' opener in a 3–2 defeat to Rochdale on 22 October. On 5 November, Dallas' loan was extended until 1 January 2014. He scored the only goal of the game against Accrington Stanley on 30 November. An injury suffered to Brentford's on-loan Cardiff City winger Kadeem Harris meant that Dallas was recalled early from his loan on 23 December. He made 12 appearances for Northampton and scored three goals. Of his time at Northampton, Dallas said \"on a personal note my loan spell was OK. I was playing every week. It was a good experience but results did not go our way and it was hard, when you are at the bottom everything seems to go against you\". He also remarked that the training was less intense than he was used to at Brentford. Dallas signed a new two-year contract at Brentford on 13 November, which would have kept him at Griffin Park until the end of the 2015–16 season. Dallas found his minutes on the pitch limited during the early months of 2014, but he broke into the starting lineup in April, starting in six of the Bees' final seven games of the season. Dallas scored his first Brentford goal with what turned out to be a consolation in a 4–1 defeat to Colchester United on 26 April. He made it two in two games when he scored the opener in a 2–0 win over Stevenage on the final day. Dallas made 21 appearances and scored two goals in a season in which Brentford secured automatic promotion to the Championship."]}, {"page": "2011–12 Cardiff City F.C. season", "response": ["In the closing days of the winter transfer window, Cardiff completed their second transfer, signing winger Kadeem Harris from League Two side Wycombe Wanderers for an undisclosed fee and allowed Hungarian defender Gábor Gyepes to leave the club after his contract was cancelled by mutual consent. Jon Parkin left the club for a third time during the season on loan, joining Scunthorpe United, and Solomon Taiwo completed a loan move to Leyton Orient.", "|Kadeem Harris"]}, {"page": "Sammy Ameobi", "response": ["On 7 July 2015, Ameobi joined Championship team Cardiff City on a season-long loan. He made his debut for the Bluebirds on the opening day of the 2015–16 season as a substitute in place of Alex Revell during a 1–1 draw with Fulham, before being handed his first start three days later in the first round of the Football League Cup, playing 73 minutes in a 1–0 victory over AFC Wimbledon before being replaced by Kadeem Harris. His only goal of the loan spell came in the third league game of the season, a 2–0 victory over Wolverhampton Wanderers."]}, {"page": "2011–12 Wycombe Wanderers F.C. season", "response": ["| Kadeem Harris"]}, {"page": "2012–13 Cardiff City F.C. season", "response": ["|19||Kadeem Harris||LW/RW||||Westminster||||–||–||–||–||Wycombe Wanderers||30 January 2012||£150,000||30 June 2015", "|20||10 April||Barnet||A||3–1||Rhys Healey (59), Kadeem Harris (68), Etien Velikonja (82)||A Robertson (5)||Report"]}, {"page": "2013–14 Cardiff City F.C. season", "response": ["|40||Kadeem Harris||RW||||Westminster||||1||0||30 January 2012||2015"]}, {"page": "2013–14 Brentford F.C. season", "response": ["Brentford slumped to their 4th league defeat of the season following a 2–1 defeat at Stevenage which saw Jonathan Douglas return to the team after injury. Donaldson put Brentford ahead in the 13th minute to score his 5th of the campaign, but Stevenage responded swiftly through François Zoko. Zoko doubled his tally 11 minutes later which was enough to secure victory for the Boro and leave the Bees 11th place in the table. After going a goal down against Colchester United a third straight league defeat seemed to be on the cards before three goals in eleven minutes turned the game. Marcello Trotta levelled the score in the 76th minute before George Saville netted his first league goal to put the Bees ahead. Kadeem Harris scored the third goal on his club debut following his loan from Cardiff City, and guaranteed the points and the win.", "The next game away to Bristol City saw Richard Lee return to the starting line up in goal for Brentford. City started strong and had the better of the first half, but the second half introduction of Sam Saunders for Kadeem Harris changed the game for the visitors as he became both scorer and provider. Saunders' 79th minute shot was deflected past the City keeper to put the Bees ahead and seven minutes later Clayton Donaldson was on hand to volley in a corner from the substitute. Marlon Harewood scored an injury-time consolation goal but was unable to prevent the extension of City's winless streak to 21 games. A crowd of 9,783 descended on Griffin Park to watch Brentford beat Shrewsbury Town and move up to 5th place in the league table. Marcello Trotta volleyed home the only goal of the game in the 18th minute giving the team their third win in eight days.", "Brentford began November with an away win at Crawley Town. Kyle McFadzean tripped Kadeem Harris in the Crawley box to concede a penalty which Adam Forshaw converted to score his third goal of the season. Ex-Bee Marcus Gayle's Staines Town were Brentford's opponents in the first round of the 2013–14 FA Cup. Ben Nugent started in place of the suspended Harlee Dean and goals from Alan McCormack, Jake Reeves, Kadeem Harris, Marcello Trotta and Clayton Donaldson sealed a 5–0 win for the Bees. Crewe Alexandra were the next visitors to Griffin Park and they departed on the wrong end of another 5–0 scoreline. Crewe defended well until the deadlock was broken on the 43rd minute by Marcello Trotta with a long range header. Brentford came out for the second half strong and immediately added a second through Forshaw. George Saville increased the lead in the 58th minute before Donaldson netted twice bringing his league goal tally to eight.", "* 18 October Kadeem Harris signs on loan from Cardiff City until 5 January 2014. Luke Norris is loaned out to Northampton Town until 16 November", "|Kadeem Harris", "| style=\"text-align:left;\" |Kadeem Harris", "| Kadeem Harris"]}, {"page": "2014–15 Cardiff City F.C. season", "response": ["|40||Kadeem Harris||LW||||Westminster||||19||2||Wycombe Wanderers||30 January 2012||£150,000||2017", "|40||MF|| Kadeem Harris                            ||1||1||0||2", "|40||MF|| Kadeem Harris                                   ||2||1||0||0||0||0||2||1", "|14 March||3||Kadeem Harris|| vs Brentford||Bournemouth (H), Birmingham (H), Reading (A)"]}, {"page": "2015–16 Cardiff City F.C. season", "response": ["|24||Kadeem Harris||LW||||Westminster||||23||2||Wycombe Wanderers||30 January 2012||£150,000||2017", "| 22 August 2015 || LW ||  || Kadeem Harris || Barnsley || 21 August 2015 || Cardiff City F.C."]}, {"page": "2015–16 Barnsley F.C. season", "response": ["|27||MF|| Kadeem Harris                                    ||1||0||0||0||0||0||0||0||0||0||1||0", "| 22 August 2015 || MF ||  || Kadeem Harris || Cardiff City || 23 November 2015 || "]}, {"page": "Harry White (footballer, born 1994)", "response": ["He was signed by League One side Barnsley on a 2-year deal for an undisclosed fee in September 2015. He made his debut for the \"Tykes\" on 6 October, coming on for Kadeem Harris 65 minutes into a 2–1 victory over Bradford City in the Football League Trophy. After a very successful goalscoring spell in Barnsley's U21s White made two first team appearances and 13 on the Barnsley bench, before he was loaned out to Kidderminster Harriers."]}, {"page": "2016–17 Cardiff City F.C. season", "response": ["|24||Kadeem Harris||LW||||Westminster||||61||6||Wycombe Wanderers||30 January 2012||£150,000||2019", "|24||||LW||Kadeem Harris                                        ||4||0||0||4", "|24||||LW||Kadeem Harris                                         ||5||0||0||0||0||0||0||0||0||5||0||0", "|16 June 2017||LW||||Kadeem Harris||Signed||2 years||June 2019||"]}, {"page": "2017–18 Cardiff City F.C. season", "response": ["|11||Kadeem Harris||LW||||Westminster||||64||6||Wycombe Wanderers||30 January 2012||£150,000||2019"]}]}}