{"wiki_id": "http://www.wikidata.org/entity/Q6369615", "itemLabel": "Karen Dunnell", "itemDescription": "British national statistician", "wikipedia_url": "https://en.wikipedia.org/wiki/Karen_Dunnell", "wikipedia_page": {"main": "Dame Karen Hope Dunnell, DCB, FAcSS (née Williamson; born 16 June 1946) is an American-born British medical sociologist and civil servant. She was National Statistician and Chief Executive of the Office for National Statistics of the United Kingdom and head of the Government Statistical Service from 1 September 2005 until retiring on 28 August 2009. Since its inception in 2008, she was also the Chief Executive of the UK Statistics Authority. She now has a range of non-executive roles including membership of Pricewaterhouse Coopers Public Interest Body, Trustee of National Heart Forum, member of the Court of Governors, University of Westminster.", "link_mentions": [{"page": "June 16", "response": ["*  1946   – Karen Dunnell, English statistician and academic"]}, {"page": "Office for National Statistics", "response": ["The then National Statistician, Dame Karen Dunnell, stated that legislation would help improve public trust in official statistics\"National Statistician welcomes Statistics and Registration Service Bill\" , news release from ONS website. (although the ONS already acted independently, as per its own published guidelines, the National Statistics Code of Practice,\"National Statistics Code of Practice\" ONS website which set out the key principles and standards that official statisticians, including those in other parts of the government statistical service, were expected to follow and uphold).", "Since its establishment, ONS has had five Directors: Professor Tim Holt; Len Cook; Karen Dunnell; Jil Matheson; and, from October 2012, Glen Watson. Len Cook was the first Director to hold the newly created role of National Statistician.  The roles of Director of ONS and National Statistician were combined until 2012 when Jil Matheson continued as National Statistician while Glen Watson became Director of the ONS. John Pullinger replaced Jil Matheson as National Statistician (and Chief Executive of the UK Statistics Authority) in July 2014. Pullinger retired in June 2019 and in October 2019 Professor Sir Ian Diamond assumed the role of National Statistician.", "The ONS asserted that recruitment and training of quality staff in South Wales, where data collection and analysis already took place, would ensure that there was no risk to the quality of its services and that it managed the risks associated with the changes.\"Stats staff 'quitting' over move\", news report from the BBC website, 14 May 2007. However the plan to discontinue statistical activity in London proved controversial amid claims that the shift of functions from London and the closure of the London office would have serious implications for the future of certain sets of statistics. These include health statistics, National Accounts, Retail and Consumer Prices and Labour Market Statistics. These risks were stated to derive from the fact that few of the experienced staff working in these highly technical areas were expected to relocate to Newport, resulting in a substantial loss of expertise and a consequent threat to the continued quality of the statistics.Debate on the Statistics and Registration Service Bill in the House of Lords, 24 April 2007, Hansard, Column 597. In a submission to the Parliamentary Treasury Sub Committee, the Bank of England expressed concern over the relocation of the ONS to Newport, saying, that \"the relocation programme poses serious risks to the maintenance of the quality of macroeconomic data. If substantial numbers of ONS staff are unwilling to relocate, the loss of skilled individuals could have a severe impact on a range of statistics.\"\"Bank of England comments on recent ONS performance\", a submission made by the Bank of England to the Treasury Sub-Committee inquiry into progress on the efficiency programme in the Chancellor's departments, May 2007.\"Bank warns on ONS move to Wales\", news report from the BBC website, 10 May 2007. The director of ONS at the time vigorously defended the implementation of government policy on civil service relocation and the decision to concentrate staff in the three locations outside London.\"Statistics officers get the measure of relocation\", article by Karen Dunnell, Financial Times, 4 June 2007. Retrieved 7 June 2007."]}, {"page": "Young Foundation", "response": ["* Karen Dunnell"]}, {"page": "Len Cook", "response": ["Cook took up the post of National Statistician and Director of the Office for National Statistics at the end of May 2000. He was the second head of the ONS but the first to have the title of National Statistician. He returned to New Zealand and was succeeded by Karen Dunnell in September 2005.\"National Statistician - Director Office for National Statistics\" , 10 Downing Street press release, 4 August 2005. Retrieved 21 June 2007."]}, {"page": "National Statistician", "response": ["* He was succeeded by Dame Karen Dunnell on 1 September 2005.", "* Jil Matheson succeeded Karen Dunnell on 1 September 2009.Appointment of the National Statistician Official announcement  6-Aug-09"]}, {"page": "Ann Cartwright", "response": ["The Institute produced numerous books and reports for the Department of Health which explored issues with the use and perception of primary medical care in Britain. One report (Medicine Takers, Prescribers & Hoarders, 1972) was written with Karen Dunnell, now the UK's National Statistician. Others included Patients & Their Doctors (1967), Parent & Family Planning Services (1970), Life Before Death (1973, with Hockey & Anderson and The Role of Residential and Nursing Homes in the Last Year of People's Lives (1988)."]}, {"page": "St Thomas's Hospital Medical School", "response": ["* Karen Dunnell (b. 1946) - UK National Statistician"]}, {"page": "Dunnell", "response": ["* Karen Dunnell (born 1946), British medical sociologist and civil servant"]}, {"page": "Maidstone Grammar School for Girls", "response": ["* Dame Karen Dunnell, National Statistician & Registrar-General, Office for National Statistics"]}, {"page": "Royal Holloway, University of London", "response": ["* Dame Karen Dunnell (born 1946), medical sociologist"]}, {"page": "UK Statistics Authority", "response": ["Gordon Brown, then Chancellor of the Exchequer, announced on 28 November 2005, that the government intended to publish plans in early 2006 to legislate to render the Office for National Statistics (ONS) and the statistics it generates independent of government on a model based on the independence of the Monetary Policy Committee of the Bank of England. This was originally a 1997 Labour Party manifesto commitment and was also the policy of the Liberal Democrat and Conservative parties. Such independence was also sought by the Royal Statistical Society and the Statistics Commission. The National Statistician, who is the chief executive of the ONS, would be directly accountable to Parliament through a widely constituted independent governing Statistics Board. The ONS would be a non-ministerial government department so that the staff, including the Director, would remain as civil servants but without being under direct ministerial control. The National Statistician at the time, Karen Dunnell, stated that the legislation would help improve public trust in official statistics although the ONS already acts independently according to its own published guidelines, the National Statistics Code of Practice, which sets out the key principles and standards that official statisticians, including those in other parts of the Government Statistical Service, are expected to follow and uphold."]}, {"page": "2009 Birthday Honours", "response": ["* Karen Dunnell, National Statistician and Registrar General for England and Wales, Office for National Statistics."]}, {"page": "Jil Matheson", "response": ["Matheson succeeded Dame Karen Dunnell as National Statistician on 1 September 2009, and Chief Executive of the UK Statistics Authority (and the Office for National Statistics)."]}, {"page": "List of women in statistics", "response": ["* Karen Dunnell (born 1946), Chief Executive of the UK Office for National Statistics and head of the Government Statistical Service"]}, {"page": "Knights and Dames Commander of the Order of the Bath appointed by Elizabeth II (since 2003)", "response": ["|Karen Dunnell"]}, {"page": "Department of Community Medicine, St Thomas's Hospital Medical School, London", "response": ["* Karen Dunnell: UK National Statistician"]}, {"page": "Karen Hope Dunnell", "response": ["#REDIRECT Karen Dunnell"]}]}}