{"wiki_id": "http://www.wikidata.org/entity/Q6369588", "itemLabel": "Karen Darke", "itemDescription": "Paralympic cyclist", "wikipedia_url": "https://en.wikipedia.org/wiki/Karen_Darke", "wikipedia_page": {"main": "Karen Darke, , FRSGS (born 25 June 1971) is a British paralympic cyclist, paratriathlete, adventurer and author. She  at the 2016 Rio Paralympics winning Gold in the Women's road time trial, following her success in the 2012 London Paralympics winning a silver medal in the Women's road time trial H1-2.Darke was born in Halifax, Yorkshire. She is paralysed from the chest down following an accident, aged 21, whilst sea cliff climbing. In 1996 she first hand-cycled across the Himalaya from Kazakhstan to Pakistan, through the Indian Himalaya in 2005 and 2018, and across the Tibetan Plateau in 2014. In 2002 she was part of a team sea kayaking from Canada to Alaska (Vancouver to Juneau, 10 weeks kayaking). In 2006, she took part in an expedition which crossed Greenland's ice cap whilst sitting on skis using her arms and poles to cover the 372-mile crossing. She has also climbed Mont Blanc, Matterhorn and El Capitan and hand-cycled, skied and kayaked the length of Japan. In 2009, she was a bronze medal winner in the Para-Cycling World Cup after which, in 2010, she became a member of the British Para-Cycling team. She has won two silver medals in the women's H2 road race and time trial events at the 2011 Para-Cycling World Cup which took place in Sydney.At the 2012 Summer Paralympics, on 5 September 2012, she won a silver medal in the Women's road time trial H1–2 finishing second to Marianna Davis in a time of 33:16.09. In the Women's road race H1-3 competition, on 7 September 2012, Darke finished fourth. After crossing the finishing line holding hands with teammate Rachel Morris, both in a time of 1:43:08, Morris was awarded the bronze medal.In October 2012, she competed in her first ITU Paratriathlon World Championships. She won the gold medal in her TRI-1 classification. She went on to compete for Scotland in the 2018 Commonwealth Games, Gold Coast, Australia, finishing 4th.\nIn 2014 Darke took a silver medal in the UCI Para-Cycling Road World Championships in South Carolina in the H3 time-trial, following it up with a bronze in the H3 road race.On 14 September 2016 Darke won the gold medal in the Women's time trial H1-3 at the Rio Paralympics in a time of 33:44:93.Darke was appointed Member of the Order of the British Empire (MBE) in the 2017 New Year Honours for services to sport.", "link_mentions": [{"page": "June 25", "response": ["*1971 – Karen Darke, English cyclist and author"]}, {"page": "Wellington College, Berkshire", "response": ["Wellington College's online television channel, WTV., was founded in 2011.Vimeo - WTV The channel is operated entirely by students and produces student-related episode-based content every few weeks as well as one-off short films. WTV debuted at the 2011 Round Square International Conference, where it interviewed former King Constantine II of Greece, Karen Darke, Colin Jackson and Jasmine Whitbread.RSIC Tuesday"]}, {"page": "List of British cyclists", "response": ["* Karen Darke"]}, {"page": "Berghaus", "response": ["*Hand biker Karen Darke"]}, {"page": "Royal Scottish Geographical Society", "response": ["Between 1904 and 1905, Sir Ernest Shackleton worked as the secretary of the society before starting his career as an antarctic explorer. Sir Edmund Hillary, Neil Armstrong, Sir Ranulph Fiennes, Dame Freya Stark, Sir David Attenborough, Mary Robinson and Karen Darke have all received RSGS medals. Naomi Klein, James Cameron and the Dalai Lama, among others, have written for their magazine.", "* Karen Darke (2016)"]}, {"page": "List of honorary graduates of the University of Leeds", "response": ["* Karen Darke (LLD)"]}, {"page": "Great Britain at the 2012 Summer Paralympics", "response": ["In the women's H1-3 road race, Karen Darke and Rachel Morris finished together in the same time holding hands. Although the two wanted to share the bronze, Morris was awarded the medal having crossed the line slightly ahead.", "|rowspan=\"2\"|Karen Darke"]}, {"page": "Rachel Morris (cyclist)", "response": ["Morris was selected to compete for Great Britain at the 2012 Summer Paralympics, where she was aiming to defend her title in the time trial and also to compete in the road race. In July 2012 her participation at the Games was placed in doubt after she was hit by a car during a time trial near her home in Farnham, Surrey. The incident left her with whiplash and shoulder injuries. In addition to her physical injuries Morris' handcycle was damaged in the crash, meaning she had to use her competition bike for training and order a new one for use in the Paralympics. She recovered in time to compete in her first event at the Games on 5 September. In the H1-3 road race at the Games, Morris and team-mate Karen Darke crossed the line together whilst holding hands in order to tie for third place and share the bronze medal: however the photo finish revealed that Morris arrived at the line first, so she alone was awarded third."]}, {"page": "Cycling at the 2012 Summer Paralympics – Women's road time trial H1–2", "response": ["| Karen Darke"]}, {"page": "Cycling at the 2012 Summer Paralympics – Women's road race H1–3", "response": ["Rachel Morris and Karen Darke chose to finish together, and crossed the finish line holding hands. A photo finish showed Morris's front wheel crossed the line first, so she was awarded the bronze medal.", "| Karen Darke"]}, {"page": "National Diversity Awards", "response": ["Other celebrities to give public backing towards the National Diversity Awards include Brian Blessed, Katie Piper, Trevor Nelson, Meera Syal, Gareth Thomas, Javine Hylton, Gina Yashere, Saira Choudhry, Lemar, Ross Adams, Philip Olivier, Tessa Sanderson, Chris Boardman, Ade Adepitan, Danny Crates, Karen Darke, Sarah Storey, Barney Storey Lenny Henry, Tom Daley, Ashley Walters, Letitia Hector, Alex Beresford and Amal Fashanu."]}, {"page": "Great Britain at the 2016 Summer Paralympics", "response": ["|rowspan=\"2\"|Karen Darke"]}, {"page": "Cosmopolitan Ultimate Women of the Year Awards", "response": ["* Ultimate Fearless Females: Karen Darke"]}, {"page": "Stephen Bate", "response": ["Bate was introduced to the ideas of para-cycling by friend and Great Britain team member Karen Darke; both of whom have conquered El Capitan in Yosemite National Park. Bate has climbed the rock face 3 times including a solo ascent of Zodiac, becoming the first visually impaired person to achieve this. In 2013 he was accepted onto British Cycling’s Paralympic Development Programme and, was teamed up with sight piloted Adam Duggleby. In December 2014, after became the British road and time trial national champion, Bate was advanced from the development programme to the Paralympic Podium Programme, for athletes who British Cycling believe have medal potential at Paralympic level. The next year he made his World Championship debut, competing at the 2015 Championships in Apeldoorn."]}, {"page": "Cycling at the 2016 Summer Paralympics – Women's road time trial H1–3", "response": ["|| Karen Darke"]}, {"page": "Cycling at the 2016 Summer Paralympics – Women's road race H1–4", "response": ["|| Karen Darke"]}, {"page": "2017 New Year Honours", "response": ["*Karen Darke. For services to sport, particularly cycling and triathlon."]}, {"page": "Scotland at the 2018 Commonwealth Games", "response": ["|align=left|Karen Darke"]}, {"page": "Alicia Dana", "response": ["In 2014, Dana became the fastest woman's H3 Para-cyclist in the world after winning gold at the UCI Para-cycling Road World Championships, beating Karen Darke and Renata Kaluza. The following year, she won two gold medals in the time trial and the road race at the Union Cycliste Internationale Para-cycling Road World Cup and two silver medals at the UCI Para-cycling Road World Championships. In her gold medal races, she was the only athlete representing the United States amongst 13 other competitors in her class. On January 3, 2016, Dana was among the 27 athletes named to Team USAs Paralympics Cycling National Team for the 2016 Summer Paralympics in Rio. In order to train for the event, Dana worked out six days a week year-round including at the gym or on a stationary trainer in her garage. She also communicated with her national team trainer Rick Babington in southern California and biked on paved roads to test her endurance. During the Games, Dana earned her first Paralympic silver medal as she placed second behind Darke in the H1-3 category with a time of 12.55 seconds. She also competed in the Women's Road Race H1-4 where she ranked fourth."]}]}}