{"wiki_id": "http://www.wikidata.org/entity/Q6369698", "itemLabel": "Karen Henthorn", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Karen_Henthorn", "wikipedia_page": {"main": "Karen Henthorn (born 1963) is a British character actress who portrayed the role of Teresa Bryant in the long-running British soap opera Coronation Street. She appeared in the role briefly in 2007 and became a regular character in 2008. Her character was involved in major story lines. In late 2008, she left the show but returned on 13 April 2009. She then departed the show in 2010.\nHenthorn was born in Oldham, Lancashire. Her roles before Coronation Street included parts in series such as The Booze Cruise, in which she played Cath Bolton, Doctors and Heartbeat. She also played Julie Haye in EastEnders in 1997–1998 and Marissa Platting (Series 2 Social Worker) in the television series Shameless.She currently teaches screen acting on the BA (Hons) Acting course at Italia Conti Academy in Clapham and Manchester School of Theatre.\nShe has most recently appeared on Sky One's comedy series Trollied. She also played a school’s inspector in the 2010s CBBC series Young Dracula, and plays Janet Macy on the BBC Three series In the Flesh.\nIn 2013 she appeared in the touring National Theatre production of War Horse.", "link_mentions": [{"page": "EastEnders theme tune", "response": ["| 23 || 30 April 1998 || Nigel Bates (Paul Bradley), his stepdaughter Clare Bates (Gemma Bissix), Julie Haye (Karen Henthorn) and Josh Saunders (Jon Lee) leave Walford to live in Scotland."]}, {"page": "Weatherfield", "response": ["The shop was a DIY store owned by Sally Webster (Sally Dynevor), then a Bakery owned by Diggory Compton (Eric Potts), before becoming a Kebab shop opened by Jerry Morton (Michael Starke). The shop focuses around the Morton family from its opening in 2007 until 2009, when Darryl Morton (Jonathan Dixon) leaves for Spain and sells it to Dev. Jerry, Darryl, Mel Morton (Emma Edmondson), Jodie Morton (Samantha Seager) and Teresa Bryant (Karen Henthorn) all work here between 2007 and 2009."]}, {"page": "List of former EastEnders characters", "response": ["|Julie Haye || Karen Henthorn || 1997–1998"]}, {"page": "Italia Conti Academy of Theatre Arts", "response": ["The BA (Hons) Acting Programme, validated by the University of East London and accredited by the Federation of Drama Schools, is a three-year full-time professional actor's training for students aged 18+. It is based in Italia Conti's Avondale Building in Clapham, London. The programme is run by Chris White (also the Head of School of Acting), with staff and directors including Kate Williams, Paulette Randall, Karen Henthorn, Dugald Bruce-Lockhart, Lawrence Evans, John Gillett and Anna Jordan. Graduates of this programme populate the performance industries and include Karla Crome, Mark Ebulué, Jess Ellis, Karen Gillan, Aisling Jarrett-Gavin, Matt Lapinskas, Carla Langley, Bethany Muir, James Nelson-Joyce, Racheal Ofori, Gemma Salter, Lucie Shorthouse, Fiona Skinner, Gary Trainor, Nina Toussaint-White, and Dwane Walcott."]}, {"page": "Nigel Bates", "response": ["Following a long period of mourning, Nigel grows close to Lorraine Wicks (Jacqueline Leonard) and attempts to ignite a relationship. This goes awry as Lorraine does not return Nigel's romantic feelings and is instead attracted to Grant, which deeply hurts Nigel. In 1997, he meets Julie Haye (Karen Henthorn), Clare's school teacher, who occasionally dropped into Nigel's video shop to rent French films. Their friendship blossoms into romance but Nigel remains reticent believing he is tarnishing Debbie's honour. He almost loses Julie after she announces she is moving to Scotland, but on the night of her departure, Nigel sees sense and pledges his love for Julie and in April 1998, he and Clare leave Walford for Scotland to be with Julie and her son, Josh Saunders (Jon Lee).", "The character remains on-screen until April 1998 and was given a \"happy ending\", leaving to begin a new life with a newfound love Julie Haye (Karen Henthorn), allowing for a future return. Henthorn has suggested that because Nigel was \"such a popular character\", and because he had such an unsuccessful love life throughout the course of the show, the producers of EastEnders felt that the viewing public would not want him to have anything other than a \"happy ending\"."]}, {"page": "Clare Bates", "response": ["In 1997, Clare starts socialising with a bad crowd at school, and subsequently begins bullying her friend, Sonia, leading to her being reprimanded by her teacher, Julie Haye (Karen Henthorn). Nigel takes her to his old school to show her the pain that bullies inflict on their victims, making her see sense so she makes peace with Sonia. She then falls for a boy at her school, Josh Saunders (Jon Lee), who rescues Clare from her old gang after they turn on her for leaving their clique. They start dating — despite Nigel's objections — though their romance hits a brief setback when Clare discovers that his mother is also her teacher, Julie. Despite her initial upset, Clare comes round and she is happy when Nigel and Julie begin dating. When Julie gets a job in Scotland, Nigel and Clare decide to join her and Josh, leaving Walford in April 1998.", "Clare's introductory storyline focused upon domestic violence—her father Liam's physical abuse of her mother—and being caught between her feuding parents. Later storylines involved the death of her mother, who was killed in a hit-and-run accident in 1995, and a subsequent custody battle between her father and stepfather, which ultimately led to Nigel being given custody of Clare. After six years in the serial, the character was written out in 1998 as a result of Paul Bradley's decision to leave, reportedly for fear of being typecast in the role of Nigel the \"nerd\". The writers of EastEnders wanted to give Nigel a happy ending, so a character named Julie Haye (Karen Henthorn) was invented to be a love interest for Nigel, whilst her son, Josh Saunders (Jon Lee), was invented to be a love interest for Clare. In the storyline, Nigel fell for Julie, Clare's teacher, as they tried to sort out Clare's problematic behaviour at school. Simultaneously, Clare fell for Julie's son Josh, and when the storyline reached its climax in April 1998, the Bates family relocated to Scotland to begin a new life with Julie and Josh. Since her initial departure, actress Gemma Bissix has commented on her character's exit from the soap: “it was the right time for the character to go. Besides, when you get to 15 and haven't been able to cut your hair for six years, you want a change.”"]}, {"page": "The Booze Cruise", "response": ["Events involving their wives and families back home also form a large part of the plot. Clive's wife Ruth is enthusiastically planning a lavish wedding for her daughter Chloe (Louise Callaghan) and Daniel. Later on, Dave's wife Cath (Karen Henthorn) tries to console Ruth, after she finds out that her husband's business has gone bankrupt, and then finds Chloe in bed with the wedding photographer, Dominic (Jalaal Hartley). Meanwhile, Maurice's wife Grace (Anne Reid) and Leone (Claire Skinner) reconcile over their garden fence, and end up really enjoying each other's company, in the absence of their husbands. After they have lunch, and get drunk on wine, Grace tries to cut down the overgrown trees in her garden. This goes wrong, as one of the trees falls on, and destroys, Rob's beloved shed... So Maurice returns home to find his wife drunk and his beloved trees chopped up on the front drive, whilst Rob discovers that his shed has vanished!", "*Karen Henthorn - Cath Bolton"]}, {"page": "Lloyd Mullaney", "response": ["When Jodie's father, Jerry (Michael Starke) has a heart attack, Lloyd helps him and his family while he is in hospital. When Jerry's ex-wife Teresa Bryant (Karen Henthorn) arrives on the street on hearing about Jerry's plight, it is revealed that she and Lloyd had once had a fling. Teresa takes advantage of this—as well as Finlay's fondness of Lloyd—to con Lloyd into believing he is Finlay's biological father. Lloyd believes her and trying to do the decent thing, offers money to help look after him that she pocketed herself. Teresa's con is eventually revealed when WPC Mel (Emma Edmondson), Finlay's older half-sister gets suspicious and it is revealed that Finlay is not Lloyd's son."]}, {"page": "Raining Stones", "response": ["* Karen Henthorn – Young Mother"]}, {"page": "Darryl Morton", "response": ["Originally, Darryl was supposed to be leaving with the rest of the Morton clan. However, in an interview with the Liverpool Echo, Michael Starke who plays his father Jerry revealed they had kept Darryl's character on because of \"his character links in with David Platt\". Jerry collapses on 27 August 2008 and goes into care on 31 August, where Darryl and the rest of the family were told that Jerry is still alive and has a high chance of staying that way, but also that he may die. Jerry makes a full recovery but discovers that wife Teresa Bryant (Karen Henthorn) has been poisoning him. Darryl, along with his siblings order Teresa out of the family home as a result. Amber Kalirai (Nikki Patel) becomes close to Darryl and they subsequently start a relationship."]}, {"page": "List of Dalziel and Pascoe cast members", "response": ["*Karen Henthorn "]}, {"page": "Teresa Bryant", "response": ["Teresa Bryant (also Morton) is a fictional character from the British ITV soap opera, Coronation Street. Portrayed by Karen Henthorn. The character first appeared onscreen during the episode airing on 28 March 2007. She made her final appearance on 14 May 2010, when she leaves Weatherfield after a failed relationship with Lloyd Mullaney (Craig Charles)."]}, {"page": "Julie Haye", "response": ["Julie Haye is a fictional character in the BBC soap opera EastEnders played by Karen Henthorn between 15 September 1997 and 30 April 1998. Julie was a love interest for the popular character Nigel Bates (Paul Bradley). After \"a whirlwind affair\", the couple leave the soap together for a new life in Scotland.", "Julie Haye was introduced in September 1997 as a love interest for the character Nigel Bates (played by Paul Bradley). Actress Karen Henthorn was cast in the role. Henthorn had previously auditioned to play the minor role of a pregnancy counsellor for the character Bianca Jackson (Patsy Palmer). She was not offered the part, but she was instead asked to audition for the much bigger role of Julie. Having been called back to Elstree Studios to discuss the role with the casting director, Henthorn was told that EastEnders were creating a new \"semi-regular\" character, Julie Haye, specifically as a love interest for Nigel Bates. Actor Paul Bradley, who played Nigel, had decided to leave the serial the following year, reportedly for fear of being typecast. As Nigel was \"such a popular character\", and because he had such an unsuccessful love live throughout the course of the show, the producers of EastEnders felt that the viewing public would not want him to have anything other than a \"happy ending\". \"So Julie was being introduced as a vehicle for Nigel’s exit\". Because the character Julie was in the process of being conceptualised, the casting director asked Henthorn to read through scenes from previous episodes of EastEnders between Nigel and his deceased wife, Debbie. The audition proved successful and they re-called Henthorn to read through some new scenes, which she had to learn for a screen test. Henthorn has commented, \"this meeting was with the same director and two casting directors and took place on the Friday morning. I was offered the job that lunchtime!\"", "Actress Karen Henthorn has since reflected on her time in EastEnders: \"I tried to keep an open mind regarding any expectations of the job. To be honest, I hadn’t got a clue what to expect. All I did know was that, because up until then, I, like the majority of actors, had spent years in and out of work (but mostly out). I had been struggling financially and creatively, had waited on more tables and pulled more pints than I care to remember. I was absolutely, without a shadow of a doubt, going to appreciate every single second, enjoy the whole experience. Which I did—whilst I was actually at work. But when I was away from the working environment, getting recognised in the street everywhere I went, being followed, pointed at, photographed, this was something I didn’t expect. And it happened overnight—one day, you can’t get anyone’s assistance in the supermarket, the next, they’re queuing up to carry your shopping home! Fame didn’t change me—it changed people round me. It was a very ‘interesting’ experience which took quite a while to get used to.\""]}, {"page": "List of EastEnders characters (1997)", "response": ["Julie Haye, played by Karen Henthorn, is the teacher of Clare Bates (Gemma Bissix). Julie falls in love with Clare's adoptive father, Nigel (Paul Bradley), whilst they are trying to sort the problematic youngster. A slow on/off romance develops between Nigel and Julie, but Nigel initially struggles with the guilt of moving on following the death of his wife a few years earlier. Faced with Nigel's uncertainty, Julie makes plans to leave Walford for a teaching job in Scotland; however, moments before she leaves, Nigel chooses to move to Scotland with her. They leave with Clare in April 1998.", "Josh was introduced as part of a storyline to aid the departure of the long-running characters, Nigel and Clare Bates (played by Paul Bradley and Gemma Bissix). Actor Paul Bradley had decided to leave the serial, reportedly for fear of being typecast. The writers of EastEnders wanted to give Nigel a happy ending, so a character named Julie Haye (Karen Henthorn) was invented to be a love interest for Nigel, whilst her son, Josh, was invented to be a love interest for Nigel's daughter, Clare."]}, {"page": "List of EastEnders characters (1998)", "response": ["Eliot Saunders, played by Lawrence Lambert, is the father of Josh Saunders (Jon Lee) and former husband of Julie Haye (Karen Henthorn). Eliot is angry about Julie taking Josh to live in Scotland. As Eliot is Jewish, Josh is obliged to have a Bar Mitzvah to appease his father before he leaves for Scotland. Josh is initially opposed to this, as he is not remotely interested in religion. He starts missing his Bar Mitzvah tutorials, which does not please Eliot who says he and his family will not support Josh in his life if he does not go through with it. Josh ultimately decides to go ahead with the Bar Mitzvah. It takes place in March 1998."]}, {"page": "Liz McDonald", "response": ["Liz' storylines have seen her embark on a series of failed romances, including marriages to Jim McDonald (Charles Lawson), which became abusive, and Vernon Tomlin (Ian Reddington). She has also had many feuds, notably with son Steve's (Simon Gregson) wives Karen Philips (Suranne Jones) and Becky Granger (Katherine Kelly). Her other feuds include Teresa Bryant (Karen Henthorn), Jenny Bradley (Sally Ann Matthews), Tracy Barlow (Kate Ford), Pat Phelan (Connor McIntyre) and Peter Barlow (Chris Gascoyne). Liz's emotional affair with Johnny Connor (Richard Hawley) eventually leads to Johnny's wife, Jenny, hitting Liz with her car in a hit-and-run storyline over Christmas 2018. Callard has claimed Liz's unique fashion sense stems from Alec Gilroy (Roy Barraclough) telling her that she could \"aerate the space under her chin a bit more\" in an episode early on in Liz's time on the Street."]}, {"page": "List of former Coronation Street characters", "response": ["|Teresa Bryant || Karen Henthorn || 2007–2010"]}, {"page": "Graeme Proctor", "response": ["During Teresa Bryant's (Karen Henthorn) Vicars and Tarts party, Graeme arrives dressed like Liz McDonald (Beverley Callard). He expresses a lot of interest in dressing that way and particularly enjoys the \"freedom\" in wearing a skirt. Liz is then upset after seeing Graeme, realizing that Teresa asked guests to dress in her style."]}, {"page": "List of Coronation Street characters (2007)", "response": ["Finlay Bryant, portrayed by Ramone Quinn is the son of Teresa Bryant (Karen Henthorn), ex-wife of Jerry Morton (Michael Starke). In April 2007, Jerry discovers that Teresa has gone on holiday, leaving their daughter Kayleigh (Jessica Barden) and her half-brother Finlay on their own. Jerry takes the children back home with him, so Finlay remains with the rest of the Mortons at No 6 Coronation Street. In June 2008, Teresa briefly cons Lloyd Mullaney (Craig Charles) into thinking Finlay is his son so that she can get money out of him. In April 2008, it was reported by The Manchester Evening News that the character would depart later in the year with the rest of the Morton family and was confirmed the following week."]}, {"page": "List of Coronation Street characters (2009)", "response": ["Umed took pity on Teresa Bryant (Karen Henthorn) after Dev fired and evicted her, allowing her to make curry in Prima Doner, and managing to patch things up between her and Lloyd Mullaney (Craig Charles). When Dev found out about the curry business, Umed confessed to having lost his own business through a gambling addiction. He decided to return to India on 16 October 2009, giving Dev a hug goodbye."]}, {"page": "Trevor Dean", "response": ["In January 2010, whilst working, Trevor refuses to empty Janice Battersby's (Vicky Entwistle) wheelie bin as the lid is not down. Janice is annoyed but is smitten with Trevor when he responds to her advertisement for a lodger, needing somewhere to live after splitting up with his ex-girlfriend. Trevor enjoys living with Janice but does not realize that she is attracted to him. When he takes in two stray cats, Janice puts up with them despite being allergic. In February, Trevor is looking for Janice and finds her boss, Carla Connor (Alison King), cleaning so he thinks she is the cleaner. When he later sees her at The Rovers, they exchange numbers and agree to a date until Trevor sees Underworld's real cleaner, Teresa Bryant (Karen Henthorn), and Carla getting out of her expensive car. Rather than being angry at Carla's deception, Trevor is bemused, and he and Carla go on to have an enjoyable first date. From then on, their romance blossoms."]}, {"page": "List of Doctors characters (2000)", "response": ["Dr. Caroline Powers, portrayed by Jacqueline Leonard, first appeared on 26 March 2000, and made her last appearance on 1 June 2001. An experienced doctor, Caroline is involved in many cases, such as when Noel Kenworth (Anthony Edridge) has a vasectomy, however his wife, Karen (Karen Henthorn), still wants children. In May 2001, Caroline's mother, Jane (Stefanie Powers) arrives from America, with her soon to be husband David Wilde (Darren Day) arriving shortly after. Caroline starts to have feelings for David, and the two have sex. On Jane and David's wedding day, Caroline runs away with David.", "| The husband of Amanda (Karen Henthorn), who has been trying to conceive a baby for two years. When Amanda's doctor Caroline Powers (Jacqueline Leonard) learns that he had a vasectomy nine years prior to meeting his wife, she persuades him to tell her."]}, {"page": "White Heat (TV series)", "response": ["* Val – Karen Henthorn"]}, {"page": "In the Flesh (TV series)", "response": ["* Karen Henthorn as Janet Macy, Bill's wife and Rick's mother. She is very accepting of Rick's return and tries to convince her husband that Rick really has PDS and that his return albeit far from ideal is a blessing."]}, {"page": "Henthorn", "response": ["*Karen Henthorn (born 1963), English actress"]}, {"page": "The Trouble with Maggie Cole", "response": ["* Karen Henthorn as Jenny Myer"]}]}}