{"wiki_id": "http://www.wikidata.org/entity/Q6375506", "itemLabel": "Kate Gerbeau", "itemDescription": "British television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Kate_Gerbeau", "wikipedia_page": {"main": "Kate Gerbeau (née Sanderson; born 9 August 1968 in Sutton Coldfield, Birmingham) is an English television presenter and news reader, currently on British Forces News.", "link_mentions": [{"page": "1971 in television", "response": ["| Kate Gerbeau"]}, {"page": "Sutton Coldfield", "response": ["*Kate Gerbeau (née Sanderson) – television presenter"]}, {"page": "Record Breakers", "response": ["Other hosts included Dilys Morgan (1973), Fiona Kennedy (1983–86), Julian Farino (1985–86), Mark Curry (1995) and Ronald Reagan Jr. (1996–97).screenonline: Record Breakers (1973-2001) After Castle died in 1994, the show was hosted by Baker and Akabusi, then Linford Christie took over in 1998 with co-presenters Jack Lattimer, Jez Edwards (1998–2001), Kate Gerbeau  (1998), Sally Gray (1999–2000). Fearne Cotton was the host for the final series in 2001 with Edwards and Shovell."]}, {"page": "Newsround", "response": ["Shortly before Craven's departure, the show was renamed Newsround, and was then presented by a rotating team including Juliet Morris, Krishnan Guru-Murthy, Julie Etchingham, Chris Rogers, Kate Gerbeau, Matthew Price and Becky Jago. Regular reporters on the programme, who have also presented it, included Paul Welsh, Lizo Mzimba and Terry Baddoo.", "| 1997–2001 || Kate Gerbeau  || 4 years"]}, {"page": "Nicky Campbell", "response": ["In 2001, Campbell began presenting the BBC consumer affairs programme Watchdog. He presented the show alongside Kate Gerbeau until 2004 and then alongside Julia Bradbury from 2004 until 2009, when it was revealed that Anne Robinson would replace Campbell and Bradbury for the next series of Watchdog, which began airing in September 2009.", "| With Kate Gerbeau  and Julia Bradbury"]}, {"page": "Watchdog (TV programme)", "response": ["For the 1993 series, the BBC decided upon assigning Anne Robinson as the new host of Watchdog. This decision had a change in style brought about by Robinson's style of presenting, including her approach to interviews with notable figures from within the companies featured in investigations on the programme. For her first series, she was teamed up with Simon Walton and Alice Beer, the latter having been an assistant producer until she was brought on as a co-presenter, assigned with being a link between the consumers (on the phone in earlier years, and e-mail in later years) and the main presenter. Walton left after the first series, while Beer remained until 1999, whereupon she was replaced by Charlotte Hudson, who remained until 2001. Because of her workload requiring her to be present with hosting the British and American versions of The Weakest Link, Robinson also left the programme that same year. Following Robinson's departure, the BBC replaced her with Nicky Campbell as the programme's main presenter, with Paul Heiney joining a year later as a regular co-presenter of his team; additional co-presenters in the team were changed during Campbell's tenure, and included Ashley Blake, Saima Mohsin, Nick Lawrence, and Dan Penteado. Between 2001 and 2004, Campbell was joined by Kate Gerbeau as the other main presenter of the programme, while between 2005 and 2009, he was joined by Julia Bradbury, who was temporarily replaced during her last series in 2009 by Anita Rani between 6 February and 20 April;\"Asian journalist Anita Rani replaces Julia Bradbury as Watchdog host\" Thaindian News, 3 March 2009 Rani was retained as a reporter following this, taking the place of Mohsin.", "| 2001–02 || rowspan=\"3\" | Nicky Campbell and Kate Gerbeau || ", "| 10 || 4 June 2001 || 16 July 2001 || Kate Gerbeau"]}, {"page": "Pierre-Yves Gerbeau", "response": ["He is married to Kate Gerbeau (née Sanderson), a British television presenter, and has a daughter (Clémence)Cole Moreton P-Y Gerbeau: Zut alors! The Gerbil wants to be Napoleon The Independent, 2 December 2007 from another relationship. He also has a daughter with Kate."]}, {"page": "5 News", "response": ["| 2004–2008 || Kate Gerbeau"]}, {"page": "The Heaven and Earth Show", "response": ["The programme had a magazine format, with guests of all backgrounds talking about various ethical, spiritual and cultural issues. The programme also featured phone-ins, email and text readouts. Commonly a celebrity guest would be interviewed about their career with a particular focus on religious belief or spirituality; some later guests included Jermaine Jackson, Al Green, Alexei Sayle and Vic Reeves. Heaven and Earth was notably different from traditional \"God slot\" (Sunday morning/afternoon) programming in that it concentrated on a wide range of beliefs rather than just Christianity — for example, features on the ethics of halal meat or \"New Age\" concepts of spirituality. It included prominent figures from the Church and Islamic, Jewish, Hindu and secular communities and would also contain reports on topical religious issues, with notable reporters including Toyah Willcox, John Walters, Ed Stourton, Myleene Klass, Kate Silverton and Kate Gerbeau."]}, {"page": "List of former BBC newsreaders and journalists", "response": ["* Kate Gerbeau  – read the headlines on BBC Breakfast until she moved to Five News in 2005."]}, {"page": "1971 in the United Kingdom", "response": ["* 9 August – Kate Gerbeau, television presenter and newsreader"]}, {"page": "Category talk:British journalists", "response": ["Kate Gerbeaunot yet classified"]}, {"page": "Kate (given name)", "response": ["* Kate Gerbeau (born 1968), English television presenter and newsreader"]}, {"page": "Sanderson (surname)", "response": ["* Kate Sanderson, married name Kate Gerbeau (born 1968), English television broadcaster"]}, {"page": "Tiggywinkles", "response": ["Beginning in July 2008, Tiggywinkles was the setting for Wild Animal ER, a 20-part, half-hour documentary TV series presented by Kate Gerbeau, and shown on Channel Five in the UK."]}, {"page": "1968 in British television", "response": ["**Kate Gerbeau, television presenter and newsreader"]}]}}