{"wiki_id": "http://www.wikidata.org/entity/Q6377120", "itemLabel": "Kathryn Sarah Scott", "itemDescription": "singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Kathryn_Sarah_Scott", "wikipedia_page": {"main": "Kathryn Sarah Scott (born 29 September 1974) is a contemporary worship music songwriter and worship leader from Northern Ireland. She has written songs such as \"Hungry\", \"At the Foot of the Cross\", and \"Search Me\" for the worshipping church. She released her first album, Satisfy, in 2004, and followed it up with I Belong in 2007 and We Still Believe in 2010. She returned in 2020 with Speak to Me, released in partnership with Watershed Music Group. The worship experience was recorded live at Causeway Coast Vineyard in Northern Ireland, which was produced by Martin Smith (Integrity Music) and features, both, Martin and his daughter Elle Limebear (Provident Label Group). Scott was born in Eastbourne, England and was brought up in Northern Ireland in a Christian environment. She discovered her talents for not only piano playing but also for singing at an early age. After getting married in 1996, Scott met and began to be mentored by Brian Doerksen, then a mentor of worship leaders from Vineyard Churches UK and Ireland, and as a result, Scott's songs feature on many of the Vineyard Records UK albums, including Hungry, Surrender and Come, Now is the Time.\nScott was one of the leading contributors to Hungry, one of the most influential albums in international contemporary worship music. Released in 1999 by Vineyard Records UK, it contains two of her self-penned songs (including the title track) and another with her writing credits. Scott, one of five worship leaders on the album, sings on seven of the songs, two alongside another of the worship leaders on the album.\nHer first solo album Satisfy, contains a dozen songs; seven of which Scott penned. It was recorded in 2003 and released on 21 May 2004 by Vertical Records.She and her husband, Alan, serve as pastors of Anaheim Vineyard, a church in California.", "link_mentions": [{"page": "Kathryn", "response": ["* Kathryn Sarah Scott (b. 1974), a singer-songwriter of Contemporary Christian music Northern Ireland"]}, {"page": "List of Christian worship music artists", "response": ["* Kathryn Sarah Scott"]}, {"page": "Brian Doerksen", "response": ["* Celtic Worship Live From Ireland: Hope of the Nations, \"Hallelujah (Your Love Is Amazing)\", \"You Surround Me\", \"You Shine\", \"Faithful One\" with Kathryn Sarah Scott, \"It Is Well\" (Integrity, 2007)"]}, {"page": "Satisfy (Kathryn Scott album)", "response": ["#REDIRECT Kathryn Sarah Scott", "Category:Kathryn Sarah Scott albums"]}, {"page": "A Greater Song", "response": ["* Kathryn Sarah Scott – vocal soloist (5, 10, 11)"]}, {"page": "Katherine Scott", "response": ["*Kathryn Sarah Scott (born 1974), Irish Christian songwriter"]}, {"page": "Sarah Brusco", "response": ["Her music recording career commenced in 2014, with the album, The Woven Whisper, and it was released by herself alongside Vineyard Music on August 13, 2014, after a crowdfunding campaign project on Kickstarter. The album's title came from a tapestry she inherited from her grandmother-in-law that was made by her sister, Marie Kelly, and it's now hung in the couples living room. It was meant to convey the \"idea of God speaking to us in our dreams as well.\" She claims her recent musical influences to be Julianna Barwick, Jónsi, and Sigur Rós. Brusco spent some time in Northern Ireland, with Christian songwriter, Kathryn Sarah Scott, as her intern learning her craft of songwriting."]}, {"page": "Satisfy", "response": ["*Satisfy, an album by Kathryn Sarah Scott, 2004"]}, {"page": "There Is a Redeemer", "response": ["The song has been covered by various artists such as Robin Mark, David Nevue, Kathryn Sarah Scott, Selah, Kathy Troccoli, Michelle Tumes, Matthew Ward, and Kelly Willard. It appears in twenty hymnals and has been described as a 'classic.'"]}]}}