{"wiki_id": "http://www.wikidata.org/entity/Q6370369", "itemLabel": "Kari Herbert", "itemDescription": "British travel writer, photographer and television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Kari_Herbert", "wikipedia_page": {"main": "Kari Herbert (born 17 September 1970) is a British travel writer, photographer, polar explorer and television presenter.", "link_mentions": [{"page": "Wally Herbert", "response": ["When he returned to London in 1969 he married Marie Herbert. Together they lived with the Inuit and Saami in Greenland, Norway and Sweden. They had two daughters who travelled with them; their elder daughter is Kari Herbert."]}, {"page": "Frank Wild", "response": ["* Huw Lewis-Jones and Kari Herbert (2011). In Search of the South Pole. Conway, 192 pages. ."]}, {"page": "Huw Lewis-Jones", "response": ["Lewis-Jones and his partner, writer and photographer Kari Herbert, divided their time between Cambridge and London.  they live with daughter Nell by the sea in Cornwall.", "*In Search of the South Pole, Kari Herbert and Huw Lewis-Jones, Conway, 2011. ", "*Entscheidung am Sudpol, Kari Herbert and Huw Lewis-Jones, Theiss, 2011. ", "*Carnets d'explorateurs, Huw-Lewis-Jones et Kari Herbert, éditions Paulsen, 2016", "*Carnets de marins, Huw-Lewis-Jones et Kari Herbert, éditions Paulsen, 2019"]}, {"page": "A Short Walk in the Hindu Kush", "response": ["Kari Herbert noted in The Guardian's list of travel writer's favourite travel books that she had inherited a \"well-loved copy\" of the book from her father, the English polar explorer Wally Herbert. \"Like Newby, I was in a soulless job, desperate for change and adventure. Reading A Short Walk was a revelation. The superbly crafted, eccentric and evocative story of his Afghan travels was like a call to arms.\" Outside magazine includes A Short Walk among its \"25 essential books for the well-read explorer\", while Salon.com has the book in its list of \"top 10 travel books of the [20th] century\". The Daily Telegraph too enjoyed the English humour of the book, including it in a list of favourite travel books, and describing Newby and Carless's meeting with the explorer Wilfred Thesiger as a \"hilarious segment\". It quotes \"We started to blow up our air-beds. 'God, you must be a couple of pansies,' said Thesiger.\" The Swedish journalist and travel writer  noted that the meeting with Thesiger represented, in Newby's exaggerated account, a collision between two generations of travel writers who travelled, wrote, and related to strangers quite differently."]}]}}