{"wiki_id": "http://www.wikidata.org/entity/Q6375346", "itemLabel": "Kate Baines", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Kate_Baines", "wikipedia_page": {"main": "Kate Baines (born 18 July 1978) is an English actress, born in Doncaster. She has appeared in the Channel 4 British soap opera's Hollyoaks (as Beth Morgan #2), Coronation Street and Emmerdale (as Joanne). Kate has also appeared in dramas including At Home with the Braithwaites, Peak Practice and City Central. In June 2020, she appeared in an episode of the BBC soap opera Doctors as Claire Mortimer.Baines trained at Bretton Hall College and gained a BA (Hons) in Performing Arts (1996–1999). She has also appeared in many stage plays and regularly performs for the Hull Truck Theatre Company.", "link_mentions": [{"page": "List of former Hollyoaks characters", "response": ["|rowspan=\"2\"| Beth Morgan || Kate Baines || rowspan=\"2\"| 1999–2002"]}, {"page": "Zara Morgan", "response": ["Zara's sister Beth Morgan (Kate Baines) is raped by ex-footballer Scott Anderson (Daniel Hyde) during Jason Cunliffe‘s (Alex Reid) party in November 2001. Supporting Beth, Zara is incensed when Steph starts dating Scott. Steph refuses to listen to Zara, even mocking Zara about the rape, to which Zara attacks her. Their friendship is left in tatters until Steph is allowed back into the friendship group after the group worry that she has been murdered by Toby Mills (Henry Luxemburg) in July 2002. Sue and Andy ended up reconciling and marry in October 2002. When Beth is released from prison for running over Scott with her car, Sue and Andy decide to move to France with her and Zara. Zara is infuriated that she was not given a choice like Luke and Adam were, but Abby invites her to stay with her, her brother Ben Davies (Marcus Patric) and their father Will Davies (Barny Clevely), which Zara accepts. Steph, who had taken charge of the friend group, begins pushing Zara, Abby, Lisa and her brother Lee Hunter (Alex Carter) to extremes. Steph starts a \"rumour club\", which proved to be the final straw, and the club is dissolved. Steph's reaction leads to her being kicked out of the group."]}, {"page": "Baines", "response": ["* Kate Baines (born 1978), English actress"]}, {"page": "Scott Anderson (Hollyoaks)", "response": ["The character was introduced in a spin-off episode released on DVD. Scott is a footballer and is accused of raping Beth Morgan (Kate Baines). Hyde then joined the main cast of Hollyoaks. The Daily Record's Lee-Ann Fullerton summed up his storylines: \"he has bedded a 16-year-old, tried to seduce his rape accuser's best mate and been a suspected serial killer not bad for two year's work.\""]}, {"page": "Luke Morgan", "response": ["Luke arrives with his family: parents Andy Morgan (Ross Davidson) and Sue Morgan (Eve White); brother Adam Morgan (David Brown); and sisters Beth Morgan (Elizabeth O'Grady, Kate Baines) and Zara Morgan (Kelly Greenwood). He begins a friendship with Darren Osborne (Ashley Taylor Dawson) and a relationship with Mandy Richardson (Sarah Jayne Dunn). During a game of football, Luke tackles Mark Gibbs (Colin Parry) which ends Mark's chances of becoming a professional footballer and leads to Mark resenting Luke and bullying him. When Luke stands up to Mark, he becomes annoyed and beats him up, before raping him. Luke remains silent about the rape, afraid of the consequences and his relationship with Mandy deteriorates as a result. They separate and she begins a relationship with Darren, aware it will upset Luke. When he tries to tell Mandy about the rape, she ignores him and tries to punish him for their separation."]}, {"page": "List of former Emmerdale characters", "response": ["|Joanne || Kate Baines || 1999"]}, {"page": "List of British actors", "response": ["* Kate Baines (born 1978)"]}, {"page": "List of Hollyoaks characters (1999)", "response": ["Sue Morgan, (also Smith) played by Eve White from 1999 to 2002, made her first appearance in April 1999 as part of the Morgan family. Along with her husband Andy and daughter Beth Morgan (Kate Baines) she left to move to France after her daughter was raped and went to prison for reckless driving.", "Beth Morgan, played by Elizabeth O'Grady between 1999 and 2000 and Kate Baines between 2001 and 2002, made her first on screen appearance on 10 May 1999. Beth is introduced as part of the Morgan family, consisting of parents Andy Morgan (Ross Davidson) and Sue Morgan (Eve White) and children Beth, Adam Morgan (David Brown), Luke Morgan (Gary Lucy) and Zara Morgan (Kelly Greenwood)."]}, {"page": "List of Doctors characters (2020)", "response": ["| A teenager who argues with her mother, Claire Mortimer (Kate Baines). When Claire has a brain  haemorrhage, Jessie thinks she is in hospital because of her, until Rob Hollins (Chris Walker) informs her of what happened.", "| Kate Baines"]}]}}