{"wiki_id": "http://www.wikidata.org/entity/Q6378988", "itemLabel": "Kav Sandhu", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Kav_Sandhu", "wikipedia_page": {"main": "KAV (Kavin Sandhu) is a British musician from Leicester, England, now based in Los Angeles. Sandhu played guitar with British band Happy Mondays for four years after helping reform the band with frontman Shaun Ryder in 2004. He launched his solo project under moniker \"KAV\" in 2008 with long-time friend and drummer Jim (James) Portas. His solo material has been compared by the media to Iggy & The Stooges, Black Rebel Motorcycle Club, Primal Scream, Kasabian, The Rolling Stones and Bob Dylan. He uses a full band is used for live performances, which sometimes features guest musicians from various bands.", "link_mentions": [{"page": "Happy Mondays", "response": ["2004 saw another re-formation, comprising original members Bez, Whelan and Shaun Ryder along with another group of musicians. Shaun Ryder recruited Kav Sandhu to join on guitar & bring in a new group of musicians. Kav brought on-board bassist Mikey Shine, keyboard player Dave Parkinson & guitarist Jonn Dunn. Dave Parkinson was later replaced by Dan Broad. Backing singers on the first tour were Angie Brown and Ron Carroll. from 2004 to 2006 the band were managed by Danny Newman, MD at London Club Turnmills brother of London Club DJ Tall Paul. Rowetta's backing vocal role was now being performed by Julie E. Gordon who toured with the band until 2010. Paul Ryder was not present, having sworn to never perform with his brother again following the 2000 break-up, and formed his own band Big Arm. That year, the Mondays released a live DVD of a show in Barcelona. The Mondays played a variety of festival dates in 2005 (including Global Gathering), capping it off with a concert at the Manchester Arena.", "* Kav Sandhu – guitar, keyboards  (2004–2008)", "  bar:Kav   text:Kav Sandhu"]}, {"page": "Howard Marks", "response": ["In the music world, he appeared as a guest on the BBC music quiz show Never Mind the Buzzcocks. He also collaborated with Welsh group Super Furry Animals on their album Fuzzy Logic (released May 1996), which features a track entitled \"Hangin' With Howard Marks\", and also worked on their singles \"The Man Don't Give a Fuck\" and \"Ice Hockey Hair\". He featured on the album Angel Headed Hip Hop (2009) with Lee Harris and River Styx. He also worked with former Happy Mondays guitarist Kav Sandhu, and appeared at numerous British music festivals, including: (Glastonbury 2009 and 2011), Beautiful Days, RockNess, Camp Bestival, Kendal Calling, and the Sonisphere Festival. He was featured on the Reverend & The Makers track \"MDMAzing\" on their third album @Reverend Makers (2012)."]}, {"page": "Kavin", "response": ["*Kav Sandhu (born 1979), British musician"]}, {"page": "Kav happy mondays", "response": ["#REDIRECT Kav Sandhu"]}, {"page": "KAV", "response": ["#REDIRECT Kav Sandhu"]}, {"page": "Blitz Vega", "response": ["Blitz Vega is a band based between New York City and Los Angeles featuring Andy Rourke bassist of The Smiths and frontman and guitarist Kav Sandhu. The band debuted their first single \"Hey Christo\" on April 16, 2019. It was described as 'a rager that springs from the Primal Scream/Kasabian/Black Rebel Motorcycle Club family tree' by Buzz Bands LA."]}]}}