{"wiki_id": "http://www.wikidata.org/entity/Q6375384", "itemLabel": "Kate Bracken", "itemDescription": "Scottish actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Kate_Bracken", "wikipedia_page": {"main": "Kate Bracken (born 12 June 1990) is a Scottish actress. Bracken is best known for her role as Alex Millar in Being Human.", "link_mentions": [{"page": "Lochaber High School", "response": ["*Kate Bracken - actress, gest appearances in Inspector George Gently, New Tricks and playing female lead, Alex, in BBC3's Being Human"]}, {"page": "Motherwell College", "response": ["*Kate Bracken"]}, {"page": "List of Scottish actors", "response": ["*Kate Bracken (born 1990)"]}, {"page": "Being Human (British TV series)", "response": ["Two of the main cast were replaced in the series by Aidan Turner (Mitchell) and Lenora Crichlow (Annie). Russell Tovey was the only original main cast member. In the third series, Sinead Keenan became part of the main cast as Nina Pickering (a werewolf). In the fourth series, the ensemble was joined by Michael Socha as Tom McNair (a werewolf) and Damien Molony as Hal Yorke (a vampire). The fifth series added Kate Bracken as Alex Millar (a ghost). The first two series were set in Totterdown, Bristol, and the third series onwards relocated , across the River Severn, to Barry, Wales.", "On 26 March 2012, the day following the Series 4 finale, it was revealed that Series 5 of Being Human would air in 2013 and comprise six episodes. Michael Socha and Damien Molony were announced to be reprising their roles as Tom and Hal respectively. Lenora Crichlow did not return for Series 5 as the production team felt her storyline had reached a natural conclusion. Kate Bracken confirmed her return to the show in an interview before the series started shooting. The BBC referred to Alex (Kate) as \"our new ghost\", implying that Alex would become a main character in Series 5.", "| Alex Millar || Kate Bracken || colspan=\"3\"  ||  || "]}, {"page": "Bracken (disambiguation)", "response": ["* Kate Bracken"]}, {"page": "Misfits (TV series)", "response": ["| Kate Bracken"]}, {"page": "List of Being Human (British TV series) characters", "response": ["This is a list of fictional characters in the British supernatural comedy drama television series, Being Human. The story follows a vampire, a werewolf and a ghost as they try to live together in modern day Britain. Actors Lenora Crichlow, Russell Tovey and Aidan Turner composed the original cast of the programme's first three seasons with Sinead Keenan joining the main cast in season 3. The original cast changed slightly in season 4 however the fifth season featured an entirely new werewolf, vampire and ghost trio played by Michael Socha, Damien Molony and Kate Bracken.", "| Alex Millar|| Kate Bracken||Alex Millar is a young woman who first appears in the series 4 episode Puppy Love. She is a determined tomboy, the only woman in a family otherwise consisting of her father and three younger brothers, since her mother walked out on the family when she was seventeen. She wanted to be a concert pianist in life, and was generally a 'tomboy', rarely dressing in a feminine manner.", "On holiday in Barry with her family (only one of whom has appeared onscreen so far), Alex encounters Hal at the cafe and becomes romantically involved with him. She initially (and unintentionally) bewilders and intimidates Hal, who cannot understand her attitude and initially shakes her off when she attempts to flirt with him: but Alex remains sufficiently interested to return to the cafe and leave her number for him. Alex lster is captured and subsequently killed, fatally drained of blood as part of the vampire Cutler's plot to both seduce and punish Hal. Although Alex dies, she returns as a ghost. While Kate Bracken's return as Alex in series five was not stated by the BBC in press releases concerning Series 5, she stated in an interview that she would indeed be returning."]}, {"page": "Hal Yorke", "response": ["According to Kate Bracken Hal and Alex become close mates throughout the series. However, Damien Molony adds that Alex also represents the bad in Hal that he has been running from. On one hand he fancies her on the other hand their meeting up is the reason for the death of Alex and for her to become a ghost. So he feels responsible for this which is also painful for him. Because Hal is reminded of his bad side Hal finds it easier to push her away in order to cope with his guilt of what he’s done to her. Kate Bracken adds that Alex sees her relationship with Hal as complicated. She realises how hard it is for Hal to resist his bloodlust. She knows that it is like an illness which he can not control. So she is quite forgiving, but for her it is a battle of emotions when it comes to Hal."]}, {"page": "Being Human (British series 5)", "response": ["* Kate Bracken as Alex Millar"]}, {"page": "Shetland (TV series)", "response": ["* Kate Bracken as Lynda Morton\t"]}, {"page": "List of British films of 2016", "response": ["|| Director: Max McGill  Cast: MyAnna Buring, Tom Rhys-Harries, Ella Smith, Sam Phillips, Kate Bracken"]}, {"page": "Sarah Dollard", "response": ["Dollard wrote the fifth episode of the fifth season of Toby Whithouse's popular BBC Three series Being Human, featuring guest star Kathryn Prescott, of Skins fame. Digital Spy called the episode, titled No Care, All Responsibility, \"the latest in a string of knockout episodes – sweet and chilling in equal measure\". Dollard also penned the webisodes that accompanied Being Human season five, focusing on the character of Alex Millar, played by Kate Bracken."]}, {"page": "One of Us (TV series)", "response": ["* Kate Bracken as (adult) Grace Douglas"]}, {"page": "Alex Millar (Being Human)", "response": ["Alex Millar (short for Alexandra Millar )  is a fictional character in the comedy-drama TV series Being Human, portrayed by Kate Bracken. Alex Millar started as a recurring character in the fourth series of the show and became a lead character in the fifth series of the show.", "According to Damien Molony Alex and Hal fancied each other and go onto a date only short time later Alex is murdered. Hal feels responsible for this and Alex reminds him of his monstrous side and his evil capabilities. So he sometimes tries to push her away, because he does not want to deal with the guilt of what he has done to her. Kate Bracken adds that for Alex their relationship is never easy, especially when Hal gives into his darker side too much. She tries to see past this but eventually gets to a point where she can’t deal with it any more. A huge part of her however is still not able to let go of Hal. Alex realises that it is such a big struggle for Hal to abstain from blood, that for him it is like an illness which he can not control. She is quite forgiving when it comes to Hal.", "According to Kate Bracken Alex tries to create a new family because she has lost her own family since returning as a ghost. She sees Tom as a brother and is always there for him. She also tries to teach him things like to be a bit cooler around girls.", "According to Kate Bracken Alex is very close to her father Brendan and her three brothers Derek, Ryan and Decky (short for Declan). When she loses her family she grieves over them.", "Bracken got a call from her agent who told her that he had a meeting for her with the casting director, director and producer for the part of playing Alex in the TV series Being Human. By this time Bracken had planned to move from Scotland to London. However, she hadn’t done the big move yet. So she decided to move down earlier than she had planned to  get to this audition. A week later she got a recall, but then she heard nothing for a long time. When she already thought that she didn’t get the part, she received a phone call and was told that she would be playing Alex. When Kate Bracken was cast as Alex it was only for three episodes. During the filming actress Kate Bracken heard some hints that her character might stay, but she did not think much more about it.  Then production team asked Bracken to sign up for the next series, with Alex becoming a lead character. For Bracken, it was a pleasure to come back so she agreed.", "Mark Oakley from Den of Geek believes that Kate Bracken has a great screen presence. He adds that Bracken's performances as Alex have been fantastic, providing her character with real grit and determination. Caroline Preece from Den of Geek thinks that Kate Bracken complements the already-established dynamic between Michael Socha and Damien Molony beautifully. According to her Alex is charming and ballsy and refreshing in her big difference from Annie’s character.", "According to Martyn from Badwilf.com Kate Bracken \"is brilliant as Alex and is a million miles away from Annie.\" Nick Bryan from thedigitalfix.com liked that Alex is a \"less whiny ghost\" than Annie.", "Dan Martin from The Guardian enjoyed the arrival of Kate Bracken as Alex, as the \"don't mess big-sister ghost figure\". After she joined the series he doesn't even miss the former ghost Annie.", "According to the SFX magazine Kate Bracken is giving a \"spirited performance\" as Being Human's new ghost.SFX Magazine (2010): Star Turn. Edition: April 2013. Page:17"]}, {"page": "Calibre (film)", "response": ["* Kate Bracken as Iona"]}]}}