{"wiki_id": "http://www.wikidata.org/entity/Q63758949", "itemLabel": "Sammy Nicholls", "itemDescription": "English football player (1870-1912)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sammy_Nicholls", "wikipedia_page": {"main": "Samuel Nicholls (1870–1912) was an English footballer who played in the Football League for West Bromwich Albion where he won the 1892 FA Cup Final, scoring in a 3–0 win against Aston Villa.", "link_mentions": [{"page": "1892 FA Cup Final", "response": ["The 1892 FA Cup Final was contested by West Bromwich Albion and Aston Villa at the Kennington Oval.  This was the last FA Cup Final to be played at Kennington Oval due to the Surrey Cricket authorities becoming increasingly alarmed at the large crowds now being attracted to the main game in the footballing calendar.  Albions form throughout the league season had been erratic and Villa supporters felt that all they had to do was turn up and the cup was theirs for the taking.Taken from 'West Bromwich Albion: A Complete Record by Tony Matthews (1993)  West Bromwich Albion won 3–0, with goals by Alfred Geddes, Sammy Nicholls and Jack Reynolds.  Villa began brightly on a warm, sunny day which helped swell the attendance to almost 33,000, but Albion had an early surprise in store and after just 4 minutes took the lead.  Villa fought back hard but they found the Albion keeper Joe Reader in tremendous form.  Albion then made it 2-0 on the 27 minute mark and 10 minutes into the 2nd half, Villa's last hopes disappeared when Albion went 3 up.  Albion defended resolutely to see out the game with a clean-sheet and return with the cup to their Stoney Lane home.West Bromwich Albion: A Complete Record by Tony Matthews (1993) This was the first FA Cup Final in which goal-nets were used.", "|FW || 9 ||Sammy Nicholls"]}, {"page": "Roddy McLeod", "response": ["He started the following season with two goals in the opening match against Everton, but the remainder of the league season was again disappointing as Albion finished 12th (out of 14). In the FA Cup, however, Albion enjoyed great success reaching the final after a drawn out semi-final against Nottingham Forest which went to three matches, with the second replay (won 6–2) taking place in a snowstorm. In the Final against Aston Villa, played at Kennington Oval on 19 March 1892, Albion's Cup experience proved the difference between the two Midlands sides. McLeod's cross to Jasper Geddes set up Albion's first goal, and Albion finished 3–0 victors, with the other goals coming from Sammy Nicholls and Jack Reynolds."]}]}}