{"wiki_id": "http://www.wikidata.org/entity/Q6375332", "itemLabel": "Kate Allen", "itemDescription": "director of Amnesty International UK", "wikipedia_url": "https://en.wikipedia.org/wiki/Kate_Allen_(Amnesty_International)", "wikipedia_page": {"main": "Katherine Allen (born 25 January 1955) is the Director of Amnesty International UK (AIUK).", "link_mentions": [{"page": "Brasenose College, Oxford", "response": ["Among the best known living Brasenose alumni are former Prime Minister David Cameron, former Prime Minister of Australia Malcolm Turnbull, actor/comedian Mark Williams, actor/comedian Michael Palin, and Jessie Burton, author of The Miniaturist, as well as Duncan Campbell, journalist and co-founder of the charity Stonewall, Dominic Barton, former managing director of McKinsey and the Canadian ambassador to China, author David Langford, Bruce Kent, active in the Campaign for Nuclear Disarmament, J. Michael Kosterlitz, Nobel laureate in Physics in 2016, Kate Allen director of Amnesty International UK, and George Monbiot, environmental and political activist."]}, {"page": "Daily Mail", "response": ["Following the November 2015 Paris attacks, a cartoon in the Daily Mail by Stanley McMurtry (\"Mac\") linked the European migrant crisis (with a focus on Syria in particular) to the terrorist attacks, and criticised the European Union immigration laws for allowing Islamist radicals to gain easy access into the United Kingdom. Despite being compared to Nazi propaganda , and criticised as \"reckless xenophobia,\" and racist, the cartoon received praise on the Mail Online website. A Daily Mail spokesperson told The Independent: \"We are not going to dignify these absurd comments which wilfully misrepresent this cartoon apart from to say that we have not received a single complaint from any reader\".  Kate Allen, director of Amnesty International UK, wrote that \"The Daily Mails cartoon is precisely the sort of reckless xenophobia that fuels the self-same fear and hate loved by those responsible for atrocities in Paris, Beirut, Ankara and elsewhere. Now more than ever is the time to stand together in defiance of the perpetrators of violence with all of their victims and reject this disturbing lack of compassion\"."]}, {"page": "Vernon Bogdanor", "response": ["In addition to David Cameron, Bogdanor's former students include Kate Allen, Camilla Cavendish, Diane Coyle, Guy Spier, Toby Young."]}, {"page": "Mordechai Vanunu", "response": ["In 2006, Amnesty International's British branch chief, Kate Allen, wrote that Microsoft handed over the details of Vanunu's Hotmail email account at the demand of Israeli authorities while that country investigated whether he was communicating with foreign journalists. The hand-over happened before a court order had been obtained."]}, {"page": "Taking Liberties (film)", "response": ["* Kate Allen – Director, Amnesty Internartional"]}, {"page": "Amnesty International UK Media Awards", "response": ["The Amnesty International Media Awards are a unique set of awards which pay tribute to the best human rights journalism in the UK. Kate Allen, Amnesty International UK’s director, said that the awards recognise the \"pivotal role of the UK media industry in informing and shaping public opinion\" and pays tribute to their \"often dangerous work\". The awards acknowledge the creativity, skills and sheer determination that it takes to get the news out in an educational and engaging way."]}, {"page": "Ken Livingstone", "response": ["Inspired by the Bennites, Livingstone planned a GLC take-over; on 18 October 1979, he called a meeting of Labour leftists entitled \"Taking over the GLC\", beginning publication of monthly newsletter the London Labour Briefing. Focused on increasing leftist power in the London Labour Party, he urged socialists to stand as candidates in the upcoming GLC election. When the time came to choose who would lead London Labour in that election, Livingstone put his name down, but was challenged by the moderate Andrew McIntosh; in the April 1980 vote, McIntosh beat Livingstone by 14 votes to 13. In September 1980, Livingstone separated from his wife Christine, though they remained amicable. Moving into a small flat at 195 Randolph Avenue, Maida Vale with his pet reptiles and amphibians, he divorced in October 1982 and began a relationship with Kate Allen, chair of Camden Council Women's Committee.", "Livingstone's relationship with Kate Allen ended in November 2001, although they remained friends. He then started a relationship with Emma Beal, together having two children, Thomas (born December 2002) and Mia (born March 2004). At a May 2002 party in Tufnell Park, Livingstone got into an argument with Beal's friend Robin Hedges, a reporter for the Evening Standard. Hedges subsequently fell from a wall, bruised his ribs and went to hospital; the press claimed that Livingstone had pushed him, although he insisted that he did not. Liberal Democrats on the London Assembly referred the matter to the Standards Board for England, who ruled that there was no evidence for any wrongdoing on Livingstone's behalf.", "Livingstone married Christine Pamela Chapman in 1973; the marriage ended in divorce in 1982. Around that time he became involved with Kate Allen, now director of Amnesty International in the UK; the couple separated in November 2001. He then entered a relationship with his office manager, Emma Beal; they have a son (Thomas) and a daughter together. Livingstone and Beal married on 26 September 2009 in the Mappin Pavilion of London Zoo. They live in North London.", "Livingstone had also fathered three children prior to 2000; a boy by one mother and two girls by another. The children were born to two different women while Livingstone was involved with Kate Allen, according to an article by Decca Aitkenhead:Decca Aitkenhead, \"Ken Livingstone: 'It's an autobiography, not porn'\", The Guardian, 21 October 2011. Retrieved 5 May 2012."]}, {"page": "Kate Allen", "response": ["*Kate Allen (Amnesty International) (born 1955), director of Amnesty International UK", "*Kate Allen (triathlete) (born 1970), Australian triathlete", "*Kate Slatter (born 1971), Australian rower whose married name is Kate Allen"]}, {"page": "Kate Allen (Amnesty International UK)", "response": ["#REDIRECT Kate Allen (Amnesty International)"]}, {"page": "List of Question Time episodes", "response": ["|Estelle Morris, Andrew Lansley, Greg Dyke, Matthew Parris, Kate Allen"]}, {"page": "Iron Fist Campaign", "response": ["News of the campaign did not make major headlines outside of local newspapers. He Yafu, an independent expert on family planning in China, suggested that the central government made an effort to conceal the results of the campaign because Chinese law specifically prohibited the means used to enforce it. Provincial officials have reported that the local Puning authorities will be investigated to determine the legality of their actions. Kate Allen of Amnesty International described the campaign as \"appalling\" and voiced her opinion that \"authorities must condemn this practice immediately\". "]}, {"page": "Prostitution in Kosovo", "response": ["Amnesty International UK Director Kate Allen is quoted as saying \"Women and girls as young as 11 are being sold into sexual slavery in Kosovo and international peacekeepers are not only failing to stop it they are actively fuelling this despicable trade by themselves paying for sex from trafficked women.\""]}, {"page": "The Student Journals", "response": ["The website has interviewed important personalities including the Director of Amnesty International UK, Kate Allen, Foreign Correspondent for The Independent, Robert Fisk and the editor of the Hurriyet Daily News, Mustafa Akyol."]}, {"page": "History of Brasenose College, Oxford", "response": ["Brasenose's reputation for law remained, under firstly Ron Maudsley – a Tutorial Fellow in the Stallybrass mould – and Roman and Civil law lecturer and tutor Barry Nicholas,  then Peter Birks, another Roman lawyer and sometime Regius Professor of Civil Law at All Souls, Harry Lawson, the first Professor of Comparative Law, and Sir Otto Kahn-Freund, an employment law specialist.Crook (2008). pp. 388–389. There was also a growing reputation for English literature – staff Ian Jack and Alastair Fowler among them. Other notable staff included Robert Shackleton, tutor in French, sometime librarian and Senior Dean; Sir Ronald Syme, Camden Professor of Ancient History (the chair previously held by Last, with whom he would continue a personal dispute).Crook (2008). pp. 390–392. It would all mean the Brasenose's fellows in 1970 were dominated by Britain's top academic minds, however disjunct from academic success that would become. One subject to develop after 1970, however, was Politics, Philosophy and Economics (PPE). Bogdanor continued to lead a formidable group of fellows and undergraduates: Peter J.N. Sinclair, Michael Woods, John Foster, and Tony Courakis; Lord Robin Janvrin, Kate Allen, Catharine Hill, and British Prime Minister David Cameron.Crook (2008). pp. 430–431."]}, {"page": "Greater London Council leadership of Ken Livingstone", "response": ["Inspired by the Bennites, Livingstone planned a GLC take-over; on 18 October 1979, he called a meeting of Labour leftists entitled \"Taking over the GLC\", beginning publication of monthly newsletter, the London Labour Briefing. Focused on increasing leftist power in the London Labour Party, he urged socialists to stand as candidates in the upcoming GLC election. When the time came to choose who would lead London Labour in that election, Livingstone put his name down, but was challenged by the moderate Andrew McIntosh; in the 28 April 1980 vote, McIntosh beat Livingstone by 14 votes to 13.Livingstone 1987. pp. 90, 92–94, 107–113.Hosken 2008. pp. 72–77. In September 1980, Livingstone separated from his wife Christine; they remained amicable, holidaying in the Far East together. Moving into a small flat at 195 Randolph Avenue, Maida Vale with his pet reptiles and amphibians, he divorced in October 1982 and began a relationship with Kate Allen, chair of Camden Council Women's Committee.Carvel 1984. pp. 87, 91, 105.Hosken 2008. pp. 96, 98."]}, {"page": "Radical: My Journey out of Islamist Extremism", "response": ["Former UK Prime Minister Tony Blair described it as \"a book for our times\", and notes that such a book could only be written by someone who has lived the experience of going in and out of extremism. Tina Brown, editor-in-chief of Newsweek termed it one of the essential books to understanding the path to radicalism. According to former Islamist and co-founder of Quilliam, Ed Husain, this book is more powerful than US drone strikes because it helps to suppress the ideas on which terrorism is built. According to Kate Allen, the director of Amnesty International UK, the book charts a redemptive journey from innocence, to bigotry, to radicalism, and back."]}, {"page": "Public Investment Fund", "response": ["In April 2021, Saudi crown prince Mohammed bin Salman reportedly asked British Prime Minister Boris Johnson to intervene so that the Premier League would approved PIF's takeover of Newcastle. The attempted takeover was \"a blatant example of Saudi sportswashing\", according to Kate Allen of Amnesty International UK. The British government blocked details of its talks with the Premier League regarding the Saudi takeover, saying the disclosure could \"harm\" relations with Saudi Arabia. The other 19 Premier League clubs condemned the takeover, saying it damaged the Premier League's brand."]}, {"page": "Nazanin Zaghari-Ratcliffe", "response": ["On 17 March, she was temporarily freed for two weeks, which was later extended indefinitely. After her new trial was postponed in September, the Foreign Office called for her to be permanently released. Kate Allen, director of Amnesty International UK, called it nonsense that the trial had been moved, saying she had already faced an unjust trial. She accused the Iranian government of playing cruel political games on her and asked the British government to work harder for her release."]}, {"page": "Sportswashing", "response": ["* The purchase of Newcastle United F.C., 80% financing provided by Saudi Arabia Public Investment Fund, this was \"a blatant example of Saudi sportswashing\", according to Kate Allen of Amnesty International UK."]}]}}