{"wiki_id": "http://www.wikidata.org/entity/Q6376999", "itemLabel": "Kathron Sturrock", "itemDescription": "British pianist", "wikipedia_url": "https://en.wikipedia.org/wiki/Kathron_Sturrock", "wikipedia_page": {"main": "Kathron Sturrock is a British pianist who studied with Cyril Smith, Joan Trimble, Alfred Brendel and Rostropovich, and worked with Elisabeth Schwarzkopf.She is a professor at the Royal College of Music and has recorded for Hyperion, Chandos, Pickwick, Sain, Gamut, ASV, Naxos and Black Box Records. Sturrock is the artistic director of the Fibonacci Sequence. She is also the only pianist to have twice won the prize for the best accompanist at the Sofia International Opera Competition.She recorded a series of albums with the double bassist Duncan McTier.\nShe has performed in most countries in Europe, North America, India and Australia, performs regularly in the London concert halls, and records frequently for BBC Radio 3.\n\n", "link_mentions": [{"page": "Flute Sonata (Poulenc)", "response": ["The American premiere was recorded, as was the composer's Paris performance with Rampal.Caré, pp. 39–40 There have been many subsequent recordings of the sonata. Among the earlier ones are those by Michel Debost with Jacques Fevrier and Rampal with Veyron-Lacroix. Later recordings include those by Julius Baker with Lisa Logan and Mathieu Dufour with Éric Le Sage. Among recordings singled out in a BBC Radio 3 survey in 2015 are those by  William Bennett with Clifford Benson; Sharon Bezaly with Ronald Brautigam; Patrick Gallois with Pascal Rogé; Emmanuel Pahud with Le Sage; Ileana Ruhemann with Kathron Sturrock; and Adam Walker with James Baillieu."]}, {"page": "Sturrock", "response": ["*Kathron Sturrock, British pianist"]}, {"page": "Cyril Smith (pianist)", "response": ["Kathron Sturrock,"]}, {"page": "Albert Ferber", "response": ["Alongside his performing work, Ferber had an active teaching career, gaining early experience in Italy where he deputised for his former teacher Karl Leimer. After settling in England, he was employed as piano teacher (and concert manager) at the James Ching Pianoforte School. Later in life he gave many masterclasses in both the UK and Europe for organisations such as the European Piano Teachers Association (EPTA), but it is as a private teacher that he is probably best remembered. Robert Finley recalls that his teacher was an advocate of the Alexander Technique and that \"he emphasised relaxation … and avoiding the build up of muscular tension and stress\". Kathron Sturrock commends Ferber's \"gentle and helpful wisdom\" which saw her \"through many a dark moment\", whilst Penelope Thwaites describes him as an \"exceptional teacher … interested in drawing out the individuality of his pupils; believing in that individuality and conveying confidence: a rare gift\". She also states that he was \"much loved by all his pupils\"."]}, {"page": "Duncan McTier", "response": ["He recorded a series of albums with the pianist Kathron Sturrock."]}, {"page": "Fibonacci Sequence (ensemble)", "response": ["Pianist Kathron Sturrock is the artistic director. Other musicians include double bassist Duncan McTier and violist Yuko Inoue."]}]}}