{"wiki_id": "http://www.wikidata.org/entity/Q6376455", "itemLabel": "Katherine Langrish", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Katherine_Langrish", "wikipedia_page": {"main": "Katherine Langrish is a British author of fantasy for children and young adults. She was brought up in Yorkshire and Herefordshire, and wanted to be a writer from a young age.  She was encouraged by her parents, and by the fact that her grandmother was a Yorkshire novelist and playwright of the 1930s, Leonora Thornber.", "link_mentions": [{"page": "List of children's literature writers", "response": ["*Katherine Langrish – Troll Fell, Troll Mill, Troll Blood"]}, {"page": "Lubber fiend", "response": ["It also appears in Lob Lie-By-The-Fire by Juliana H. Ewing, Troll Fell by Katherine Langrish, Abbeychurch by Charlotte M. Yonge and Dear Brutus by J. M. Barrie (as \"Lob, the ancient Puck\")."]}, {"page": "Troll Fell", "response": ["Troll Fell is a children's fantasy novel written by Katherine Langrish, the first in the Troll Trilogy which comprises Troll Fell, Troll Mill and Troll Blood. It is set in Viking Scandinavia and is centred about the eponymous mountain, which is infested with trolls."]}, {"page": "Troll Mill", "response": ["Troll Mill is a children's fantasy novel written by Katherine Langrish, the second in the Troll Trilogy. It follows the events of Troll Fell, but takes place three years later."]}, {"page": "Skipton Girls' High School", "response": ["* Katherine Langrish – fantasy writer"]}, {"page": "List of alumni of King's College London", "response": ["*Katherine Langrish – author"]}, {"page": "Troll Blood", "response": ["Troll Blood is a children's fantasy novel, the third  volume of the Troll Trilogy written by Katherine Langrish. It follows the events of Troll Fell and Troll Mill."]}, {"page": "Charles Felix Harris", "response": ["Each year the University of London awards in his honour the Sir Charles Harris Prize for the best results achieved in the final examinations by an external student of English. Previous winners of the award include the British author, Katherine Langrish."]}]}}