{"wiki_id": "http://www.wikidata.org/entity/Q6377452", "itemLabel": "Katie Green", "itemDescription": "British model", "wikipedia_url": "https://en.wikipedia.org/wiki/Katie_Green", "wikipedia_page": {"main": "Katie Green (born 28 August 1987) is an English model from Chichester, West Sussex. She was first given an opportunity to model when a Surrey photographer arranged a test-shoot for her at Image Park Studio in West Sussex. Green was originally signed to represent Wonderbra in July 2008, but her agency required her to lose weight, and she refused, ending her contract. Green is unusual among models because of her weight for someone her size and her refusal to lose weight to conform to the norms agencies expect of models. She initiated a campaign against size zero models with the Liberal Democrat MP Lembit Öpik. Green continues to model and has appeared in numerous publications and campaigns.\n\n", "link_mentions": [{"page": "Page 3", "response": ["* Katie Green"]}, {"page": "Size zero", "response": ["thumb|right|Katie Green, who initiated a campaign against size zero modeling", "The use of size 0 in advertisements and products of the clothing industry has been met with some media attention. In July 2009, Katie Green won a competition to represent Wonderbra. They referred her to the Premier Model Management agency for representation. Green reported that \"one of the guys from the PR agency from Wonderbra\" insisted that she lose weight, that it wasn't normal for models to be a (UK) size 8. \"Unless I could drop down to that weight, they wouldn't be willing to get me more work.\" Green at first complied, but then quit the agency. She then, with Liberal Democrat MP Lembit Öpik, launched a campaign titled \"Say No to Size Zero\". They began a petition drive with the goal to put an end to size zero and underweight models on the catwalk or working in the fashion industry. They set a goal to obtain 20,000 signatures and plan to present it to the UK Prime Minister and Parliament. They are campaigning for legislation that would require regular health checkups for all models before undertaking any assignments."]}, {"page": "Green (surname)", "response": ["*Katie Green (born 1987), English model"]}, {"page": "Katie green", "response": ["#REDIRECT Katie Green"]}, {"page": "List of glamour models", "response": ["*Katie Green"]}, {"page": "Katherine Green", "response": ["* Katie Green (born 1987), English model"]}, {"page": "Katy Green", "response": ["*Katie Green (born 1987), British model"]}]}}