{"wiki_id": "http://www.wikidata.org/entity/Q6379219", "itemLabel": "Kavi Raz", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Kavi_Raz", "wikipedia_page": {"main": "Kavi Raz (born 1 January 1953) is an Indian-born British actor, writer, director and producer.  Born in Punjab, Raz left India at a young age for the United Kingdom, where he grew up.", "link_mentions": [{"page": "1989 in film", "response": ["| Pet Sematary || Paramount Pictures || Mary Lambert (director); Stephen King (screenplay); Dale Midkiff, Fred Gwynne, Denise Crosby, Brad Greenquist, Michael Lombard, Miko Hughes, Blaze Berdahl, Susan Blommaert, Kavi Raz, Mary Louise Wilson, Andrew Hubatsek, Stephen King, Chuck Courtney, Matthew August Ferrell, Richard Collier, Elizabeth Ureneck || Horror || Live action"]}, {"page": "Kavi", "response": ["* Kavi Raz (born 1953), Indian-born British actor, writer, director and producer"]}, {"page": "St. Elsewhere", "response": ["*Kavi Raz as Dr. Vijay Kochar (1982–1987, recurring: 1987–1988)"]}, {"page": "List of fictional doctors", "response": ["|St. Elsewhere || Dr. Wendy ArmstrongDr. Daniel AuschlanderDr. Elliot AxelrodDr. Hugh BealeDr. Robert CaldwellDr. Annie CavaneroDr. Phillip ChandlerDr. Mark CraigDr. Victor EhrlichDr. Wayne FiscusDr. John GideonDr. Seth GriffinDr. Emily HumesDr. Paulette KiemDr. V. J. KocharDr. Cathy MartinDr. Jack MorrisonDr. Carol NovinoDr. Alan PoeDr. Michael RidleyDr. Ben SamuelsDr. Roxanne TurnerDr. Jaqueline WadeDr. Donald WestphallDr. Peter White || Kim MiyoriNorman LloydStephen FurstG.W. BaileyMark HarmonCynthia SikesDenzel WashingtonWilliam DanielsEd Begley, Jr.Howie MandelRonny CoxBruce GreenwoodJudith HansenFrance NuyenKavi RazBarbara WhinneryDavid MorseCindy PickettBrian TochiPaul SandDavid BirneyAlfre WoodardSagan LewisEd FlandersTerence Knox"]}, {"page": "Duleep Singh", "response": ["A 2017 film, The Black Prince, by the Indian-born film director Kavi Raz told the story of Duleep and his relationship with Queen Victoria."]}, {"page": "Lonely Among Us", "response": ["The ship suddenly begins to malfunction and Captain Picard sends Assistant Engineer Singh (Kavi Raz) to investigate the cause. Singh is later found dead near a computer link, and Picard orders a murder investigation, considering the alien delegates to be prime suspects. Data investigates the murder in the manner of fictional detective Sherlock Holmes, and determines that the delegates were not responsible. Meanwhile, Counselor Deanna Troi (Marina Sirtis) uses hypnosis on both Worf and Crusher, finding that both recall being invaded by some entity during their blackouts. The ship suddenly drops again out of warp, and as Picard investigates the readouts at a bridge console, the strange energy transfers into him. The bridge crew becomes suspicious of Picard's actions after noting that all Enterprise systems are back to normal and that Picard has ordered them to return to the cloud.", "Colm Meaney made his second appearance in The Next Generation after he originally appeared in the pilot, \"Encounter at Farpoint\", as a conn ensign on the bridge. In this episode he played a security ensign, as it was not until season two that he began to play the recurring character of Miles O'Brien, who would later become a series regular on Star Trek: Deep Space Nine. Another Deep Space Nine actor who made his first Trek appearance in this episode was Marc Alaimo, who played an Antican who was unnamed on screen, but referred to in the script as Badar N'D'D. Alaimo went on to play several other roles in The Next Generation including as the Cardassian Gul Macet in \"The Wounded\", before being cast as Gul Dukat in DS9. John Durbin appeared as the Selay leader, and would also go on to appear as a Cardassian later in the series, as Gul Lemec in \"Chain of Command\". Kavi Raz played Assistant Engineer Singh, although as he was unavailable for a re-shoot, in one scene he was replaced by a wig on a chair."]}, {"page": "Edmonton International Film Festival", "response": ["|Kavi Raz"]}, {"page": "Terror Squad (film)", "response": ["* Kavi Raz as Yassir"]}, {"page": "Pet Sematary (1989 film)", "response": ["* Kavi Raz as Steve Masterton"]}, {"page": "Terminal Entry", "response": ["*Kavi Raz as Mahadi"]}, {"page": "Kavi raz", "response": ["#REDIRECT Kavi Raz "]}, {"page": "East Side Story (Ugly Betty)", "response": ["*Kavi Raz (Clerk)"]}, {"page": "Roger Christian (filmmaker)", "response": ["|Kavi Raz"]}, {"page": "The Night Train to Kathmandu", "response": ["* Kavi Raz as Prof. Dewan Godbothe"]}, {"page": "Family/Affair", "response": ["*Kavi Raz as the clerk "]}, {"page": "Warning Sign (film)", "response": ["* Kavi Raz as Dr. Ramesh Kapoor"]}, {"page": "Mehr Hassan", "response": ["|Kavi Raz", "|Kavi Raz"]}, {"page": "List of St. Elsewhere characters", "response": ["Portrayed by Kavi Raz (main cast, 1982–1984; recurring appearances, 1984–1988)"]}, {"page": "List of Bollywood films of 2011", "response": ["| I Am Singh || Action/Crime/Drama || Puneet Issar || Gulzar Inder Chahal, Rizwan Haider, Amy Rasimas, Puneet Issar, Brooke Johnston, Tulip Joshi, Mike Singh, Yusuf Hussain, Neetha Mohindra, Kavi Raz, Donny Kapoor ||"]}, {"page": "List of fictional doctors in television", "response": ["|St. Elsewhere || Dr. Wendy ArmstrongDr. Daniel AuschlanderDr. Elliot AxelrodDr. Hugh BealeDr. Robert CaldwellDr. Annie CavaneroDr. Phillip ChandlerDr. Mark CraigDr. Victor EhrlichDr. Wayne FiscusDr. John GideonDr. Seth GriffinDr. Emily HumesDr. Paulette KiemDr. V. J. KocharDr. Cathy MartinDr. Jack MorrisonDr. Carol NovinoDr. Alan PoeDr. Michael RidleyDr. Ben SamuelsDr. Roxanne TurnerDr. Jaqueline WadeDr. Donald WestphallDr. Peter White || Kim MiyoriNorman LloydStephen FurstG.W. BaileyMark HarmonCynthia SikesDenzel WashingtonWilliam DanielsEd Begley, Jr.Howie MandelRonny CoxBruce GreenwoodJudith HansenFrance NuyenKavi RazBarbara WhinneryDavid MorseCindy PickettBrian TochiPaul SandDavid BirneyAlfre WoodardSagan LewisEd FlandersTerence Knox"]}, {"page": "I Am Singh", "response": ["*Kavi Raz as Ranjit Singh, Ranveer's father"]}, {"page": "Atsushi Funahashi", "response": ["Funahashi directed Echoes in 2002. He returned with the 2005 road movie, Big River, starring Joe Odagiri, Chloe Snyder, and Kavi Raz."]}, {"page": "Raz (surname)", "response": ["* Kavi Raz, Indian-British actor"]}, {"page": "Suraag (1982 film)", "response": ["* Kavi Raz - Raju, Khanna's henchman (uncredited)"]}, {"page": "List of Punjabi films of 2011", "response": ["|13||I Am Singh||Puneet Issar ||Gulzar Inder Singh Chahal, Tulip Joshi, Mika Singh, Sunita Dhir, Puneet Issar, Kavi Raz Puneet Issar || ||2 December 2011 || Monty Sharma, Daler Mehndi, Sukhwinder Singh, Sudhakar datt Sharma"]}, {"page": "List of Punjabi films of 2017", "response": ["|The Black Prince || Kavi Raz || Satinder Sartaj, Jason Flemyng, Amanda Root, Shabana Azmi || Historical drama ||Brillstein Entertainment Partners, Firdaus Production"]}, {"page": "The Black Prince (film)", "response": ["The Black Prince is a 2017 international historical drama film directed by Kavi Raz and featuring the acting debut of Satinder Sartaaj. It tells the story of Duleep Singh, the last Maharajah of the Sikh Empire and the Punjab area, and his relationship with Queen Victoria.", "Written and directed by Los Angeles-based Indian filmmaker Kavi Raz, The Black Prince stars the singer Satinder Sartaaj in his acting debut."]}, {"page": "8th Jagran Film Festival", "response": ["*The Black Prince by Kavi Raz"]}, {"page": "List of Punjabi films of 2018", "response": ["|Kande || Kavi Raz || Yograj Singh, B.N. Sharma, Sunita Dhir, Jeet Rudka || || ||"]}, {"page": "List of British films of 2017", "response": ["|| Director: Kavi Raz  Cast: Satinder Sartaj, Amanda Root, Jason Flemyng, Atul Sharma, Rup Magon"]}, {"page": "Kande (film)", "response": ["Kande is an Indian Punjabi-language romantic action comedy movie directed by Kavi Raz and produced by VRV Production. It stars Preet Baath opposite Kamal Virk. The movie opened worldwide on 11 May 2018."]}]}}