{"wiki_id": "http://www.wikidata.org/entity/Q6375522", "itemLabel": "Kate Harbour", "itemDescription": "voice actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Kate_Harbour", "wikipedia_page": {"main": "Kate Harbour (born 15 April 1971) is an English voice actress who provides many voices for the television series Bob the Builder, including Wendy, Dizzy, Mrs. Potts, Mrs. Broadbent, Mrs. Percival, and Pilchard.", "link_mentions": [{"page": "The Goodies", "response": ["The final time that The Goodies collaborated on a commercially available project was a single, hour-long audiobook created for Audible UK, entitled The Big Ben Theory. Scripted by Gareth Gwynn and John-Luke Roberts, along with Graeme Garden and Bill Oddie, and recorded in front of a highly-appreciative live audience, the cast comprised Tim, Bill, (an indisposed Graeme was replaced at the last minute by the project’s originator and producer, Barnaby Eaton-Jones), Joanna Lumley, Philip Pope, Jon Culshaw, and Kate Harbour, with direction from Dirk Maggs. Graeme Garden’s own description reads ‘As Parliament falls apart and sinister dictators threaten the world, Tim, Graeme and Bill must save the day. They defeated Kitten Kong! They stuffed the Funky Gibbon! They invented Ecky Thump! Can they save Parliament as well? 52% say yes. 48% say no. But you just can't rely on statistics, can you?!’ The audiobook, released by Audible on 9 October 2019, was intended to be the pilot for a forthcoming series of new episodes to be written and recorded in 2020; however, the project ended with Tim Brooke-Taylor’s death from complications from COVID-19 on April 12 that year in Cookham, Berkshire, aged 79."]}, {"page": "1971 in film", "response": ["**Kate Harbour, English voice actress"]}, {"page": "The Faraway Tree", "response": ["The voice cast were Roy Hudd, Richard Pearce, Kate Harbour, John Baddeley, Jimmy Hibbert, Janet James and David Holt."]}, {"page": "Bob the Builder", "response": ["Voice actors who have contributed to the original British version include Neil Morrissey, Rob Rackstraw, Kate Harbour, Rupert Degas, Colin McFarlane, Maria Darling, Emma Tate, Richard Briers, and June Whitfield."]}, {"page": "Fimbles", "response": ["* Florrie - A blue Fimble with purple stripes. She likes to sing songs and is normally seen with a doll that resembles a Fimble called \"Little One\". She is operated by Jenny Hutchinson, Leah Green and Holli Hoffman and voiced by Shelley Longworth (Season 1) and Kate Harbour (Season 2)."]}, {"page": "The Big Knights", "response": ["* Kate Harbour as Mindy"]}, {"page": "Mambo No. 5", "response": ["On 3 September 2001, BBC Records released a novelty version of the song sung by British actor Neil Morrissey, who provided the voice of Bob for children's television show Bob the Builder. It features background vocals from Rob Rackstraw and Kate Harbour, who voiced several other characters on the show. This cover radically changed the lyrics to fit the theme of the show, making numerous references to construction, repairs and roadway maintenance, as well as the show's characters. The female names from Bega's version are also replaced with types of construction supplies and building tasks, e.g., timber, saw, waterproofing and tiling."]}, {"page": "Yoko! Jakamoko! Toto!", "response": ["* Alistair McGowan, Kate Harbour, Moya O'Shea, Alan Marriott, Colin McFarlane and Maria Darling - Additional voices"]}, {"page": "Lavender Castle", "response": ["* Walking Stick: Captain Thrice's talking, sentient walking stick, who was given life when Thrice previously came across Lavender Castle. She maintains a link with the castle, and at desperate moments, she can produce a lavender ray to neutralise even the toughest of opponents. Voiced by Kate Harbour.", "* Lyca: The Paradox 's Floran doctor, a medical student, a talented healer, and an adept of herbal medicine, who joined the crew after being freed from Short Fred Ledd along with Roger. Lyca is a very sweet and gentle soul, but she is also far removed from the classic Damsel in Distress stereotype, being on the contrary quite brave and adventurous. She is very protective of Sproggle and tends to see him as a little brother. Voiced by Kate Harbour.", "* The Nice Old Lady: A disguise often used by Dr. Agon in order to get the crew's attention. She is easily identifiable as one of Agon's disguises due to her purple clothing. Voiced by Kate Harbour."]}, {"page": "Shaun the Sheep", "response": ["*Timmy's Mother, Shaun's aunt, wears curlers in her topknot and is a bit careless about maternal duties, even using Timmy once as a makeshift paintbrush. But when her offspring goes astray, she is inconsolable until he is safely back in her care, Her vocal effects are performed by Kate Harbour."]}, {"page": "John Bowe (actor)", "response": ["Bowe has been married three times.  His son from his first marriage is fellow actor Joseph Kennedy.  His third marriage is to actress Emma Bowe, daughter of Michael N. Harbour and sister of Kate Harbour."]}, {"page": "Spook's", "response": ["Audiobook versions of the series (unabridged) have been released in both the UK and the U.S.. The UK audiobooks were produced by Random House Audio. Jamie Glover read Book 1 and Will Thorp read Book 2. Thomas Judd read Books 3 through 8 and Book 10. Gabrielle Glaister read Book 9, Toby Longworth and Kate Harbour jointly read Book 11, and Annie Hemingway read Book 12. Random House Audio also produced an abridged version of The Spook's Apprentice which is read by Daniel Weyman."]}, {"page": "Boo! (TV series)", "response": ["*Laughing Duck (voiced by Kate Harbour) - a yellow duck, who laughs when \"found\". She has a red-orange bill that matches her legs and has abilities to fly and swim. In some episodes, she meets some people who happen to be employees. In the hospital, she has been found sad because her laugh is lost, but it is regained when Boo tickles her flipper."]}, {"page": "1971 in the United Kingdom", "response": ["* 15 April – Kate Harbour, voice actress"]}, {"page": "The Secret Show", "response": ["*Anita Knight: Is one of the two main protagonists; with blonde hair that ends in a cute little curl, wearing a purple jumpsuit and headband, and riding a green skybike, she is partnered with Victor Volt. Somewhat more intelligent than Victor, she often has to save the day when Victor lands them in a sticky situation. She is allergic to sea water, but when in sea water, she grows a mermaid tail (for reasons unknown.) Voice: Kate Harbour", "*Agent Kowalski: Is the only other female U.Z.Z agent seen in The Secret Show, besides Anita. Little is known about her, except that she is the rank of a standard U.Z.Z agent, she is an American, and is new to U.Z.Z. Voice: Kate Harbour", "*The World Leader: Is, as the name implies, the democratically elected leader of the entire world, and is a target for many villains. Her speech appears to be nothing but gibberish; her husband is able to interpret her supposed babbling. However, the official site implies that the World Leader is speaking ancient Aztec language, though in a very discordant manner. Voice: Kate Harbour", "*Stacey Stern: Is a news reporter, often seen reporting the mission currently being investigated by U.Z.Z.  Her catch-phrase sign-off is 'You may be you, but I'm Stacy Stern!', lampooning a common TV news reporter style of self-introduction. Voice: Kate Harbour", "*Sweet Little Granny: Is the host of The Fluffy Bunny Show, played before The Secret Show \"steals\" its time slot for television. She is married to Sweet Old Grandpa, who once hosted The Fluffy Bunny Show when Sweet Little Granny was having a hip replacement operation. When she made her debut on The Fluffy Bunny Show, she used to be known as Sweet Little Girl and, on her debut day, Changed Daily led a team of U.Z.Z. agents to steal the time slot just like Special Agent Ray currently does. Voice: Kate Harbour", "*Doctor Doctor: Is the main antagonist of The Secret Show and head of the evil organization, T.H.E.M - The Horrible Evil Menace. Intent on taking over the world, she is the cause of many of U.Z.Z.'s problems, but always fails. She is also known for her bad eyesight and bad teeth that seem to vibrate whenever she talks above a whisper. Voice: Kate Harbour"]}, {"page": "Vampires, Pirates & Aliens", "response": ["* Kate Harbour"]}, {"page": "Bob the Builder: The Album", "response": ["*Kate Harbour - backing vocals, voices of Wendy, Dizzy, Mrs. Potts, Mrs. Percival and Pilchard"]}, {"page": "1971 in British television", "response": ["* 15 April – Kate Harbour, voice actress"]}, {"page": "List of Bob the Builder characters", "response": ["*Wendy is Bob's business partner who runs the office and keeps the business in order, and often organizes tools and equipment. She is also seen doing construction work in many episodes. Wendy is often worried about Bob's cat, Pilchard, as shown in the episode Pilchard in a Pickle and in the song Find That Cat. In the original series, she is voiced by Kate Harbour in the UK and by Lorelei King in the US. In the reboot series, she is voiced by Joanne Froggatt in the UK and the US.", "*Mrs. Barbara Bentley is Mr. Bentley's wife and a friend of Bob and the team. She is voiced by Kate Harbour in the UK and by Lorelei King in the US.", "*Mrs. Gill Percival is Bobsville's local school headteacher. She is voiced by Kate Harbour in the UK and Lorelei King in the US.", "*Mrs. Faye Potts is a Bobsville resident and the owner of Tommy the Tortoise. She is voiced by Kate Harbour in the UK and Lorelei King in the US.", "*Meg is a dairy farmer, Piper's aunt and Dodger's owner. She is voiced by Kate Harbour in the UK and the US.", "*Jenny is Wendy's sister. She is voiced by Kate Harbour in the UK and Lorelei King in the US.", "*Mrs. Bridget Beasley is Mr. Beasley's wife. She is voiced by Kate Harbour in the UK and Lorelei King in the US.", "*Spaghetti is Bob's pet cat. She knows how to not get into trouble. She is voiced by Kate Harbour in the UK and the US.", "*Bird is Roley's friend. He is voiced by Kate Harbour in the UK and the US.", "*Fox Cub is a fox Roley befriends. He is voiced by Kate Harbour.", "*Stripy is a female tiger shark pup who becomes Scoop's pet in \"Scoop's Pet Shark\". She is voiced by Kate Harbour.", "*Dizzy is an orange tilting drum cement mixer and the youngest member of the team. She is eager, curious, and easily excitable. Her catchphrase is \"Brilliant!\" in the original series, and \"Pour to perfection\" in the reboot series. In the original series, she is voiced by Kate Harbour in the UK and by Maria Darling and Emma Tate in the US. In the reboot series, she is voiced by Sarah Hadland in the UK and by Claire Corlett in the US.", "*Scratch is a small light blue digger who is the third youngest of the team. He is curious, eager, a bit childish and very naive, and still has a lot to learn such as learning to stand up for himself and asking for help. He is voiced by Kate Harbour in the UK and by Jo Wyatt in the US.", "*Sumsy is a maroon forklift with yellow stripes who belongs to Farmer Pickles and works at his sunflower factory. She looks identical to Trix. Her catchphrase is \"I can pack 'em, I can stack 'em!\" She is voiced by Kate Harbour in the UK and by Lorelei King in the US."]}, {"page": "Percy the Park Keeper", "response": ["*Rabbits – (male rabbits voiced by David Holt and Girl Rabbit voiced by Kate Harbour) – An excitable sort who easily gets timid at anything remotely scary.", "*Squirrels – (Mr Squirrel voiced by Enn Reitel and David Holt and Mrs Squirrel voiced by Kate Harbour) – An irritable sort who often buries nuts and acorns and cannot always remember where they really are.  ", "*The Mice – (male mice voiced by David Holt and female mice voiced by Kate Harbour) – Playful sorts who are always happy to join in various challenges.", "*The Ducks – (Mr Duck voiced by David Holt and Mrs Duck voiced by Kate Harbour) – Quarrelsome sorts who normally play at the duck pond and migrate when Winter comes.", "*Owl – (voiced by Kate Harbour) – A female wise sort who never hunts at night, like an ordinary owl. She is active during the daytime and forgets things very easily."]}, {"page": "David Morley (writer)", "response": ["*Puckoon an adaptation of the novel by Spike Milligan by Ian Billings. It starred Ed Byrne and Pauline McLynn and featured Barry Cryer as the narrator. It also starred Spike's daughter Jane Milligan, Kate Harbour Wilf Scolding and David Shaw-Parker. It was directed by Dirk Maggs BBC Radio 4.</ref>"]}, {"page": "PB Bear and Friends", "response": ["*Kate Harbour as the narrator"]}, {"page": "Meghana Erande", "response": ["| Bob the Builder || Kate Harbour (U.K.)Maria Darling (U.S) || Dizzy || Hindi || English || 199 || 1998-2003 || ||"]}, {"page": "Shaun the Sheep Movie", "response": ["*Kate Harbour as Timmy's Mum"]}, {"page": "Everything's Rosie (TV series)", "response": ["*Saffy is a Cedar of Lebanon and sits in a dip beside Will and Holly's house. She is voiced by Kate Harbour"]}, {"page": "Shaun the Sheep: The Farmer's Llamas", "response": ["* Kate Harbour as Timmy's Mum"]}, {"page": "List of Wallace and Gromit characters", "response": ["| Kate Harbour", "| rowspan=\"4\" | Kate Harbour", "| Kate Harbour"]}, {"page": "List of British films of 2019", "response": ["|| Director: Richard Starzak  Cast: Justin Fletcher, John Sparkes, Kate Harbour, Richard Webber, Simon Greenall, Emma Tate, Andy Nyman"]}, {"page": "A Shaun the Sheep Movie: Farmageddon", "response": ["A Shaun the Sheep Movie: Farmageddon is a 2019 British stop-motion animated science fiction comedy film produced by Aardman Animations. The film is directed by Richard Phelan and Will Becher (in their feature directorial debuts) and written by Mark Burton and Jon Brown, based on an idea by Richard Starzak. It is a stand-alone sequel to Shaun the Sheep Movie (2015) and is based on the claymation television series Shaun the Sheep, a spinoff from the Wallace and Gromit short film A Close Shave. It's the first sequel ever made by Aardman and in stop-motion in general. The film stars Justin Fletcher, John Sparkes, Kate Harbour, and Rich Webber reprising their voice roles from the series and the previous film, whilst new cast members include Amalia Vitale, David Holt and Chris Morrell. In the film, Shaun and the flock encounter a cute alien with extraordinary powers, who crash-lands near Mossy Bottom Farm. They have to find a way to return her home in order to prevent her falling into the hands of the Ministry for Alien Detection.", "* Kate Harbour as Timmy's Mum, Shaun's aunt."]}, {"page": "Chip and Potato", "response": ["* Little Momma Pug (voiced by Briana Buckmaster; Kate Harbour in the UK dub) is Chip's mother. Formerly a receptionist, she is now a stay at home mother after having her third puglet, Totsy Tot."]}]}}