{"wiki_id": "http://www.wikidata.org/entity/Q6377214", "itemLabel": "Kathy Diamond", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Kathy_Diamond", "wikipedia_page": {"main": "Kathy Diamond is a funk/disco house singer-songwriter from London, United Kingdom. She was born in Sheffield in the north of England. Her love for soul and disco started at an early age, gaining inspiration from Donna Summer.In 1993 Diamond decided to write and sing herself, collaborating different bands, DJs and producers. In 2002 she wrote a Balearic song with house producers SWAG called \"Miracles Just Might.\" After SWAG did not include it on their album Diamond decided to release the song herself. She pressed up a limited amount of white labels and distributed it. DJ Magazine said of the track, \"If you like sweet beauty in your house music keep your eyes peeled because it's only going to get a limited release.\" Within a month another 12\" single \"Sunshine\" was released, this time on the Idjut Boys' Cottage label with producer Maurice Fulton.", "link_mentions": [{"page": "Aeroplane (musician)", "response": ["|Whispers (featuring Kathy Diamond)"]}, {"page": "On a Mission (Katy B album)", "response": ["On a Mission is an album structured in the electronic dance music genre, incorporating its subgenres, including dubstep, UK garage, UK funky, house, rave, and drum and bass. The album also takes subtle influences of Contemporary R&B and 90s dance music. The album most notably showcases Katy B's warm, natural vocals with a feel of hostility and flirtatiousness emanating through the songs. The music on the album has been compared to notable acts in the United Kingdom like the Sugababes in the early stages of their careers, Basement Jaxx, Kathy Diamond, and Lily Allen. The songs are rich in melodies, hooks and on-point lyrics. The lyrical content is centered on themes of relationships turning bitter and envious, boy troubles, and clubbing in London, noted by many critics, from a rare genuine and frank perspective."]}]}}