{"wiki_id": "http://www.wikidata.org/entity/Q6377194", "itemLabel": "Kathy Butler", "itemDescription": "long-distance runner", "wikipedia_url": "https://en.wikipedia.org/wiki/Kathy_Butler", "wikipedia_page": {"main": "Kathy Butler (born 22 October 1973) is a long-distance runner who competes in the 10,000 metres and marathon, as well as cross country running and road running. Born in Scotland, she has competed internationally for both Great Britain and Canada.", "link_mentions": [{"page": "Nederland, Colorado", "response": ["*Kathy Butler, Olympian runner for Great Britain and Canada"]}, {"page": "Paula Radcliffe", "response": ["Radcliffe has frequently made high-profile condemnations of the use of performance-enhancing drugs in athletics. Radcliffe and teammate Hayley Tullett caused controversy when, in the heats of the 5,000 metres at the 2001 World Athletics Championships in Edmonton, they held up a sign protesting against the reinstatement of Russian athlete Olga Yegorova after Yegorova had tested positive for the banned substance EPO. The sign was made by Radcliffe's husband and read 'EPO Cheats Out'. It was eventually taken off them by the stadium officials, but not before it was streamed around the world. After Radcliffe and Tullett's initial protest, teammates Kathy Butler and Hayley Yelling – who both missed out on a place in the final – protested alongside coaches Mark Rowland and Alan Storey, wearing Radcliffe masks and holding up banners with mocking slogans including one which read 'Free Paula'. Radcliffe vowed to continue her fight against drugs in sport after her high-profile actions in Edmonton. Since the 1999 European Cup, Radcliffe wears a red ribbon when competing to show her support for blood testing as a method of catching drug cheats."]}, {"page": "Athletics at the 2004 Summer Olympics – Women's 10,000 metres", "response": ["| 12 ||align=\"left\"| Kathy Butler ||align=left|  || 31:41.13 || "]}, {"page": "Great Britain at the 2004 Summer Olympics", "response": ["|align=left|Kathy Butler"]}]}}