{"wiki_id": "http://www.wikidata.org/entity/Q6388190", "itemLabel": "Ken Morrison", "itemDescription": "British businessman (1931-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_Morrison", "wikipedia_page": {"main": "Sir Kenneth Duncan Morrison CBE (20 October 1931 – 1 February 2017) was an English businessman, Life President, and former chairman of Morrisons (Wm Morrison Supermarkets PLC), the fourth largest supermarket group in the United Kingdom. He was the son of William Morrison, who founded the company.", "link_mentions": [{"page": "October 20", "response": ["*  1931   – Ken Morrison, English businessman (d. 2017)"]}, {"page": "Morrisons", "response": ["His son Ken Morrison took over the company in 1952, aged 21. In 1958, Morrisons opened a small shop in the city centre. It was the first self-service store in Bradford, the first store to have prices on its products, and it had three checkouts. The company opened its first supermarket, \"Victoria\", in the Girlington district of Bradford in 1961.", "===Retirement of Sir Ken Morrison===", "On 13 March 2008 Sir Ken Morrison retired as chairman after 55 years at the company and was made Honorary President.", "In February 2014, it emerged that younger members of the founding Morrison family, who own 10% of the company and who are thought to include two of Honorary President Sir Ken Morrison's children, William Morrison Junior and Andrea Shelley, along with Sir Ken Morrison's niece and her husband, Susan and Nigel Pritchard, had approached a number of private equity firms about taking the company private. They were said to be extremely unhappy about the company's disastrous financial performance, and the corporate strategy being undertaken by Dalton Philips.", "Following a new three-year corporate strategy revealed in March 2014 aimed at recovering sales and market share, at Morrisons Annual General Meeting in June 2014, Morrisons former chairman Sir Ken Morrison blasted Dalton Philips and his new board of directors for destroying the company he inherited from his father; Morrison remarked on Philips's strategy to save the failing supermarket from the pressures of Aldi and other discounter stores, stating \"When I left work and started working as a hobby, I chose to raise cattle. I have something like 1,000 bullocks and, having listened to your presentation, Dalton, you've got a lot more bull **** than me.\""]}, {"page": "Yorkshire Society", "response": ["The Society's award category is the Yorkshire Lifetime Achievement Award. To date recipients have included Lawrence Batley, Ken Morrison, Victor Watson, Lord Harewood, Roy Mason, Baron Mason of Barnsley, Professor Tom Kilburn, Brian Rix, Lord Rix, Michael Parkinson, Barry Cryer, Brian Turner and Ashley Jackson."]}, {"page": "William Morrison (businessman)", "response": ["His son Ken Morrison took over as Chairman in 1956 following William's death."]}, {"page": "Sir Ken Morrison", "response": ["#redirectKen Morrison"]}, {"page": "Myton-on-Swale", "response": ["The village was home to Sir Ken Morrison CBE (20 October 1931 –  February 2017) who was the executive chairman of Wm Morrison Supermarkets plc, the supermarket group. He held the office of President of Wm Morrison Supermarkets plc."]}, {"page": "1986 Memorial Cup", "response": ["Kamloops offense was led by Rob Brown, who scored 58 goals and 173 points in 69 games to lead the league in scoring, winning the Bob Clarke Trophy. Brown was awarded the Most Valuable Player Award for the West Division. In the post-season, Brown scored 18 goals and 46 points in 16 games, leading the Blazers in playoff scoring. Mike Nottingham scored 61 goals and 131 points in 70 games, finishing eight in WHL scoring. Ken Morrison was acquired by the Blazers from the Prince Albert Raiders early in the season. In 57 games with Kamloops, Morrison scored 69 goals and 123 points. Overall, Morrison scored a league high 83 goals for both the Raiders and Blazers during the season. Morrison was named the Most Sportsmanlike Player in the WHL. Greg Evtushevski returned to Kamloops during the season after beginning the year with the Maine Mariners of the American Hockey League. In 34 games with Kamloops, Evtushevski scored 29 goals and 76 points. On defense, Greg Hawgood scored 34 goals and 119 points in 71 games, leading the blue line in scoring. Ron Shudra scored 10 goals and 50 points in 72 games, and was named a co-winner of the Jim Piggott Memorial Trophy as WHL Rookie of the Year. In goal, Rob McKinley was the Blazers starting goaltender, as in 54 games, he posted a GAA of 3.92."]}, {"page": "Ken (given name)", "response": ["* Ken Morrison (born 1931), English supermarket CEO"]}, {"page": "Bradford Grammar School", "response": ["*Sir Ken Morrison (1931–2017), Executive Chairman of Morrisons"]}, {"page": "Morrison (surname)", "response": ["*Ken Morrison (1931–2017), English businessman", "*Ken Morrison (producer) (born 1957), American television producer"]}, {"page": "Dalton Philips", "response": ["After Morrisons CEO Marc Bolland announced his departure to Marks and Spencers in December 2009, Philips was appointed in a surprise move as his replacement in January 2010. However, Leighton worked with Morrisons chairman Sir Ian Gibson during his tenure at Asda, and is good friends with founder Sir Ken Morrison. ", "At Morrisons annual AGM in June 2014, Morrisons former chairman Sir Ken Morrison blasted Phillips and his new board of directors for their running of the company Morrison inherited from his father. Morrison's comments were backed up by his nephew Chris Blundell, who controls most of the remaining family stake in the supermarket, also told the board it needed rescuing, and welcomed the decision by chairman Sir Ian Gibson to leave the business next year after months of pressure."]}, {"page": "2017 in the United Kingdom", "response": ["**Ken Morrison, 85, businessman and president of the Morrisons supermarket chain."]}, {"page": "Deaths in February 2017", "response": ["*Sir Ken Morrison, 85, British businessman, president of Morrisons. Supermarket boss Sir Ken Morrison dies"]}, {"page": "Longley Farm", "response": ["The company was founded in 1948 by Joseph and Edgar Dickinson after they inherited a  farm near to Holmfirth in the West Riding of Yorkshire. Initially just having a few head of cattle, they farmed the land and with their herd of Jersey cows they first started producing cream in 1954 after wartime food rationing had ended. In the early days of the venture, Joseph Dickinson would deliver products to the Morrisons market stall run by Ken Morrison in Bradford."]}]}}