{"wiki_id": "http://www.wikidata.org/entity/Q6387719", "itemLabel": "Ken Gunn", "itemDescription": "Footballer (1909-1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_Gunn", "wikipedia_page": {"main": "Kenneth Gunn (9 April 1909 – 15 August 1991) was a Scottish footballer who played as a midfielder for Swansea Town, Port Vale, and Northampton Town.", "link_mentions": [{"page": "1991–92 in English football", "response": ["* 15 August 1991 - Ken Gunn, 82, played at wing-half for Swansea Town, Port Vale and Northampton in the 1930s."]}, {"page": "Tom Holford", "response": ["He signed players such as Trevor Rhodes, Jack Vickers, Ken Gunn, and Billy Tabram, the result of which was an eighth-place finish in 1933–34 – then a record best for the \"Valiants\". However \"the end of an era\" followed, as players such as Bill Cope, Sydney Dickinson, Len Armitage, Billy Tabram, Fred Mills, George Poyser, and Jimmy McGrath departed."]}, {"page": "Kenneth Gunn", "response": ["#REDIRECT Ken Gunn"]}, {"page": "History of Port Vale F.C.", "response": ["Vale suffered relegation in 1935–36. The pre-season consisted of selling top striker Tom Nolan to Bradford Park Avenue and manager Holford talking of a 'young players policy'. The season finished in a second-from-bottom finish and another plea for donations to survive financially. Warney Cresswell was appointed as manager for the club's 1936–37 campaign, with the aim of promotion. Tom Nolan was also brought back from Bradford. After a mid-table finish Creswell left the club. A young Eric Hayward was transferred to Blackpool, Ken Gunn moved onto Northampton Town and Allan Todd went to Nottingham Forest. Roger Jones also ended his fourteen-year association with the club. In December 1937 Tom Morgan was reinstated as manager. He was unable to prevent the 1937–38 season being another story of mid-table mediocrity. Jack Roberts impressive tally of 28 goals was the only ray of hope for escaping the division. At the end of the season roughly half the team were transferred or let go. Notable new faces for the 1938–39 campaign were goalkeeper Arthur Jepson, defender George Collin and right-half George Hannah. The club was also transferred to the Third Division South, good news as the league saw higher gate receipts. The club failed to have any impact on the division though, and were fighting to avoid a re-election battle rather than achieve promotion, as injuries hit the squad."]}, {"page": "Billy Tabram", "response": ["Tabram played for Crown Mission before having a trial with Preston North End and joining Swansea Town. He joined Port Vale, along with Ken Gunn, for £400 in March 1933. He played 35 Second Division games in the 1933–34 season, and scored one goal in a 3–0 win over Bury at Gigg Lane on 11 September. He left The Old Recreation Ground when he was sold to Hull City in May 1934, and later played for South Shields."]}, {"page": "1933–34 Port Vale F.C. season", "response": ["The pre-season saw the arrival of ten new professionals, six of which were forwards. The most significant newcomers were Trevor Rhodes (Bradford Park Avenue), Jack Vickers (Charlton Athletic), as well as Ken Gunn and Billy Tabram (both from Swansea Town).", "|align=\"left\"|MF||align=\"left\"| Ken Gunn", "|3||MF||||Ken Gunn||8||0||8", "| May 1933 || MF ||  || Ken Gunn || Swansea Town || £400 || "]}, {"page": "1934–35 Port Vale F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Ken Gunn", "|10||MF||||Ken Gunn||1||0||1"]}, {"page": "1935–36 Port Vale F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Ken Gunn", "|9||MF||||Ken Gunn||1||0||1"]}, {"page": "1936–37 Port Vale F.C. season", "response": ["On the financial side, a profit of £401 was made, though £1,923 of income came through the Shilling Fund. Gate receipts had tailed off by another £1,065; whilst the wage bill was trimmed to £5,656 and a transfer credit of £465 was made. Fourteen players departed at the season's end, including: Ken Gunn (sold to Creswell's Northampton Town); Eric Hayward (sold to Blackpool); goalkeeper Allan Todd (refused terms and was transferred to Nottingham Forest); fourteen year club veteran Roger Jones (retirement); and Gerry Kelly (signed with Southampton). The club also petitioned the Football League for a switch to the Third Division South, where gates were believed to be higher, however the League replied that circumstance and not applications determined where club's were placed – despite this Mansfield Town were the ones transferred, Mansfield being a town some forty miles north of Stoke-on-Trent.", "|align=\"left\"|MF||align=\"left\"| Ken Gunn", "| May 1937 || MF ||  || Ken Gunn || Northampton Town || Free transfer || "]}]}}