{"wiki_id": "http://www.wikidata.org/entity/Q6380285", "itemLabel": "Kay Stonham", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Kay_Stonham", "wikipedia_page": {"main": "Kay Stonham is a British actress, writer and academic.", "link_mentions": [{"page": "Paul Whitehouse", "response": ["| 1995 || Writers' Guild of Great Britain Award || TV – Light EntertainmentShared with Harry Enfield, Simon Greenall, Ian Hislop, Geoffrey Perkins, Nick Newman, Harry Thompson & Kay Stonham || Harry Enfield & Chums || "]}, {"page": "Mockumentary", "response": ["The BBC series People Like Us was first produced for radio in 1995 before a television version was made in 1999. Kay Stonham's Audio Diaries was a similarly short-lived radio mockumentary that premiered the year after People Like Us's run on Radio 4 ended."]}, {"page": "A Very Peculiar Practice", "response": ["|Kay Stonham||Daphne Buzzard||colspan=3 "]}, {"page": "London Film Academy", "response": ["Amongst the academy's tutors are cinematographer Andrew Speller, director David Pope, and screenwriter Kay Stonham."]}, {"page": "Buddy (TV series)", "response": ["| Kay Stonham || Carol Clark"]}, {"page": "Simon Greenall", "response": ["| 1995 || Writers' Guild of Great Britain Awards || TV - Light EntertainmentShared with Harry Enfield, Geoffrey Perkins, Harry Thompson, Paul Whitehouse, Ian Hislop, Nick Newman and Kay Stonham || Harry Enfield's Television Programme ||  || "]}, {"page": "Robin and Wendy's Wet Weekends", "response": ["Robin and Wendy's Wet Weekends is a BBC Radio 4 comedy series written by and starring Kay Stonham and Simon Greenall, which ran from 2001 to 2005. It revolves around the mundane lives of Robin and Wendy Mayfield who live on an anonymous estate in Stevenage. Robin tends to be self-centred, demanding and controlling in his relationships. Wendy, however, always seems to see the positive side of any situation, and, while often frustrated, copes with Robin admirably. Both Robin and Wendy have relatively meaningless bureaucratic jobs.  Robin manages shipping and receiving for a warehouse, and Wendy works in local government.", "The first series was broadcast on BBC Radio 4 in 2001.  Four series and one special, a total of 19 episodes, have been broadcast up to the end of 2005. Early episodes were co-written by Kay Stonham, who also plays Wendy, and Simon Greenall who played Robin. In the third and fourth series Robin was played by Brian Capron and Kay Stonham was the sole credited writer."]}, {"page": "Audio Diaries", "response": ["Audio Diaries was a short-lived radio program that aired from 1998–2001.  There were 15 half-hour episodes and it was broadcast on BBC Radio 4.  It was written by Kay Stonham and produced by Jane Berthoud."]}, {"page": "Home Sweet Home (1982 film)", "response": ["Home Sweet Home is a 1982 television film devised and directed by Mike Leigh, for the BBC, 'about postmen, parenthood, social workers and sex.'Michael Coveney, The World according to Mike Leigh, p. 152 It was Leigh's second collaboration with Play for Today producer Louis Marks, and cinematographer Remi Adefarasin, (after Grown-Ups), and with composer Carl Davis – the musical score featured a quartet of basses – (Davis had also provided the music for 1977s The Kiss of Death). It stars Timothy Spall (working with Leigh for the first time), Eric Richard, Tim Barker, Kay Stonham, Su Elliot, Frances Barber, Sheila Kelley, and Lorraine Brunning. It was first broadcast on 16 March 1982. The film was shot on location in Hitchin, Hertfordshire and has a 90 minutes duration.", "The story of three postmen; \"Gordon Leach (Timothy Spall), a slothful couch potato who is in permanent dispute with his svelte wife Hazel (Kay Stonham), who has lost four stone,\" and who \"is offering to entertain ... postman Stan (Eric Richard), when his shifts don't coincide with Gordon's.\"  \"Stan's wife ran off with another man when their daughter, Tina, was six. She is now fourteen. As the film progresses, Stan and his domestic arrangements assume a pivotal importance.\" The third postman Harold Fish (Tim Barker) and his wife June (Su Elliott), have a dead marriage. Stan is having an affair with June Fish.Synopsis derives from Coveney, p.160-161"]}, {"page": "Mr. Love", "response": ["* Kay Stonham as Maggie Capstick"]}, {"page": "Stonham", "response": ["*Kay Stonham, British actress, writer and academic"]}, {"page": "BBC Radio Comedy Writers Bursary", "response": ["* 1995: Will Ing, Kay Stonham"]}]}}