{"wiki_id": "http://www.wikidata.org/entity/Q6385792", "itemLabel": "Kellie Bright", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Kellie_Bright", "wikipedia_page": {"main": "Kellie Denise Bright (born 1 July 1976) is an English actress. Her roles include Linda Carter in the BBC soap opera EastEnders, for which she won the 2015 British Soap Award for Best Actress and Best Dramatic Performance, Julie in Ali G Indahouse, Joanna Burrows in The Upper Hand (1990–1996), Cassie Tyler in Bad Girls (2002) and Joan Trotter in Rock & Chips (2010–2011). In 2015, she was the runner-up in the 13th series of the BBC One show Strictly Come Dancing.", "link_mentions": [{"page": "EastEnders", "response": ["The show often includes strong, brassy, long-suffering women who exhibit diva-like behaviour and stoically battle through an array of tragedy and misfortune. Such characters include Angie Watts (Anita Dobson), Kathy Beale (Gillian Taylforth), Sharon Watts (Letitia Dean), Pat Butcher (Pam St Clement), Kat Slater (Jessie Wallace), Denise Fox (Diane Parish), Tanya Branning (Jo Joyner) and Linda Carter (Kellie Bright). Conversely there are female characters who handle tragedy less well, depicted as eternal victims and endless sufferers, who include Ronnie Mitchell (Samantha Womack), Little Mo Mitchell (Kacey Ainsworth), Laura Beale (Hannah Waterman), Sue Osman (Sandy Ratcliff), Lisa Fowler (Lucy Benjamin) and Mel Owen (Tamzin Outhwaite). The 'tart with a heart' is another recurring character. Often their promiscuity masks a hidden vulnerability and a desire to be loved. Such characters have included Pat Butcher (Pam St Clement) (though in her latter years, this changed), Tiffany Mitchell (Martine McCutcheon), Kat Slater (Jessie Wallace), Stacey Slater (Lacey Turner), Dawn Swann (Kara Tointon), Roxy Mitchell (Rita Simons), Whitney Dean (Shona McGarty) and Lauren Branning (Jacqueline Jossa).", "In October 2014, the BBC defended a storyline, after receiving 278 complaints about 6 October 2014 episode where pub landlady Linda Carter (Kellie Bright) was raped by Dean Wicks (Matt Di Angelo). On 17 November 2014 it was announced that Ofcom will investigate over the storyline. On 5 January 2015, the investigation was cleared by Ofcom. A spokesman of Ofcom said: \"After carefully investigating complaints about this scene, Ofcom found the BBC took appropriate steps to limit offence to viewers. This included a warning before the episode and implying the assault, rather than depicting it. Ofcom also took into account the programme's role in presenting sometimes challenging or distressing social issues.\""]}, {"page": "1976", "response": ["** Kellie Bright, English actress"]}, {"page": "2002 in film", "response": ["| Ali G Indahouse || Universal Pictures / StudioCanal / Working Title Films || Mark Mylod (director); Sacha Baron Cohen, Dan Mazer (screenplay); Sacha Baron Cohen, Martin Freeman, Michael Gambon, Charles Dance, Kellie Bright, Rhona Mitra, Barbara New, Ray Panthaki, Emilio Rivera, Paul Clayton, Olegar Fedoro, Tony Way, Eileen Essell, Daniela Lavender, Capri Ashby, John Scott Martin, Graham McTavish, Naomi Campbell, Nabil Elouahabi, Bruce Jamieson || Comedy || Live Action"]}, {"page": "Maid Marian and Her Merry Men", "response": ["* \"Little Girl\" (Kellie Bright): often found close to Gladys in the first series."]}, {"page": "Ali G Indahouse", "response": ["* Kellie Bright as Me Julie (credited as Kelly Bright) "]}, {"page": "The Grove Family", "response": ["In 1991 during a special day of programming on BBC2 to commemorate the closing of Lime Grove, a new edition of the programme was shown, a modern production of one of the original scripts with the roles filled by popular television soap opera actors of the time including Leslie Grantham, Anna Wing, Sue Johnston, Nick Berry, Sally Ann Matthews, Paul Parris and Kellie Bright."]}, {"page": "Sharon Watts", "response": ["In December 2013, Sharon reunites with Phil and moves back in with him. Sharon's trust in Phil is tested when he confesses his part in Dennis' fatal altercation with Johnny in 2005, but she nevertheless remains with him and together they buy a new bar: The Albert. Phil grows resentful of Sharon's preoccupation with The Albert. To re-assert his authority and demonstrate Sharon's vulnerability, Phil hires two men to vandalise the bar, but his plan goes awry when Sharon dismisses the bouncers Phil employs to intercept the vandalising. Sharon confronts the vandals alone and they critically injure her; she is hospitalised with a ruptured spleen. Guilt-ridden, Phil confides in his ex-lover Shirley Carter (Linda Henry), mother-in-law of Sharon's new friend, Queen Vic landlady, Linda Carter (Kellie Bright), who helps conceal his botched plan. When Shirley confesses she still loves Phil, he spurns her advances and instead proposes marriage to Sharon after she regains consciousness, which she accepts. Upon release from the hospital, Sharon fears being attacked again. She steals Ronnie's gun for protection but is horrified when Dennis almost finds it. While attempting to dispose of the gun, she overhears Shirley reprimanding Phil for arranging the attack on her. She vows revenge and recruits Phil's former lawyer, Marcus Christie (Stephen Churchett), to help fleece Phil. She later recants when she sees Phil's caring side but, unbeknownst to her, Phil has already discovered her deception. He confides in Shirley who convinces him Sharon hates him and they begin an affair. Phil vows to humiliate Sharon by dumping her at their wedding so he can be with Shirley. On the wedding day, however, Phil cannot go through with this and after he and Sharon confront each other about their respective deceptions, they agree to marry. Enraged at Phil's rejection and unable to stop the marriage going ahead, Shirley declares at the post-wedding dinner that she and Phil had sex. Distraught and humiliated, Sharon attempts to flee but Phil persuades her that he loves her. He suggests that sleeping with Shirley sickens him and, when Sharon forces him to say this to Shirley's face, Shirley threatens to shoot him with Sharon's gun. Phil dismisses her threats but, in a tussle between the women, Shirley fires the gun and Phil is shot. Sharon is distraught at nearly losing Phil and when he regains consciousness, he persuades her to put her anger aside and give their marriage a try."]}, {"page": "Royal Exchange, Manchester", "response": ["* Snake in Fridge by Brad Fraser (MEN Award). World premiere directed by Braham Murray (MEN Award) with Adam Sims (MEN Award) and Kellie Bright (2000)"]}, {"page": "Strictly Come Dancing", "response": ["| style=\"background:silver;\"|Kellie Bright", "|Georgia May Foote & Giovanni Pernice, Kellie Bright & Kevin Clifton", "| Kellie Bright", "| Rachel Stevens Ali Bastian Harry Judd Jason Donovan Denise Van Outen Abbey Clancy Kellie Bright Ore Oduba Debbie McGeeKelvin Fletcher Maisie SmithJohn Whaite", "| Jason Donovan & Kristina Rihanoff Denise van Outen & James Jordan Louis Smith & Flavia Cacace Natalie Gumede & Artem Chigvintsev Caroline Flack & Pasha KovalevKellie Bright & Kevin Clifton Ore Oduba & Joanne CliftonDanny Mac & Oti MabuseAshley Roberts & Pasha Kovalev Faye Tozer & Giovanni PerniceKelvin Fletcher & Oti MabuseBill Bailey & Oti Mabuse Maisie Smith & Gorka MárquezRose Ayling-Ellis & Giovanni Pernice John Whaite & Johannes Radebe", "| Kimberley Walsh & Pasha KovalevKellie Bright & Kevin CliftonDebbie McGee & Giovanni PerniceRose Ayling-Ellis & Giovanni Pernice"]}, {"page": "Bad Girls (TV series)", "response": ["* Kellie Bright as Cassie Tyler (Series 4)"]}, {"page": "Mary Barton", "response": ["In 2016 Rona Munro wrote a 2-act version, which premiered at the Royal Exchange, Manchester. It was directed by Sarah Frankcom and designed by Liz Ascroft, and featured Kellie Bright in the lead role."]}, {"page": "The Upper Hand (TV series)", "response": ["Down on his luck, former footballer Charlie Burrows (Joe McGann) moves from a deprived area of London to leafy Henley-on-Thames in Oxfordshire to make a better life for his daughter Joanna (Kellie Bright), by taking a job as housekeeper for well-off advertising executive Caroline Wheatley (Diana Weston). Although Caroline is unsure about employing him, her man-eating mother Laura West (Honor Blackman) talks her into it. Soon the two become friends, Caroline's son Tom (William Puttock) comes to see Charlie as a father figure, and Joanna enjoys having a female influence in her life.", "*Joanna Burrows (Kellie Bright) - Charlie's daughter; an outgoing, confident girl who is something of a tomboy in early episodes, but becomes more typically \"girly\" as she reaches her teens. She initially resents Caroline, finding her stuck-up, but comes to appreciate having a woman around as she goes through puberty. Just as Caroline is influenced by Charlie, Jo's confidence rubs off on Tom."]}, {"page": "T-Bag", "response": ["Each series (apart from the last) followed a similar format, T-Bag (after reuniting with T-Shirt, either through grovelling or putting him under her power) would attempt to increase her power and there would only be one thing that could stop her. The components that made the item work would be scattered across time and space, and the girl of the series was required to travel and collect them all before T-Bag could get her hands on any of them. Debbie Carter, played by Jennie Stallwood, was the heroine of the first three series. Diana Barrand took over for the fourth as child television presenter Holly Anna Jones. Kellie Bright, who later appeared in The Upper Hand, The Archers and EastEnders, played Sally Simpkins in series five and six, plus a Christmas special. In T-Bag and the Rings of Olympus, the heroine is the Goddess Athena's handmaiden, Polyzena, or Polly, played by Natalie Wood. In T-Bag and the Sunstones of Montezuma, archaeologist's daughter, heroine Penny Hunt was played by Evelyn Sweeney. Typically, each episode also features two non-regular cast members to enliven the story."]}, {"page": "1976 in British television", "response": ["* 1 July – Kellie Bright, actress* 7 July — Natasha Collins, actress and model (died 2008)"]}, {"page": "Kat Slater", "response": ["Kat begins to have second thoughts about the divorce after Pam Coker (Lin Blakley) gives a speech about love and family. Stacey reveals to Alfie that their rent is increasing and Kat is struggling with money. Alfie then invites Kat to his flat for lunch and they reminisce about their relationship. The next day, Kat lashes out at Alfie for leaving leftovers for the children, but at the urging of Stacey, she agrees to be his date to Ian and Jane's wedding if he makes more effort for making up for the fire. On the wedding day, she gets heavily drunk, and during the reception, shoves Sonia Jackson's (Natalie Cassidy) head into the wedding cake. When the nursery raise their rates, Kat is forced to leave the children in Mo's care to work her shift at the market, but ends up having drinks with Kim Fox-Hubbard (Tameka Empson). When Mo brings the children over to the pub, they misbehave and Kat is thrown out of the pub. Undeterred, Kat and Kim continue drinking and sneak into the pub to steal another bottle of wine. Linda Carter (Kellie Bright), catches them, and while Kim leaves to find the cash to pay for it, Linda prepares to call social services to tell them of Kat's irresponsibility as a mother, but Kat snatches Linda's phone and throws it across the ground. When Kim returns with Shirley Carter (Linda Henry), she confesses her fears about being a bad mother, resulting in the other three women sharing their experiences of motherhood and reassuring her. Kat also tells Linda to speak to Mick about her fears that the baby may not be his. Linda then realises that the phone call was still connected, and promises to fix things to make sure social services do not know about what happened, however Kat receives a call from a social worker requesting to visit her. Kat is surprised when a lawyer visits her about Harry telling her about a compensation case with four other women also raped by Harry."]}, {"page": "Ian Beale", "response": ["Ian develops feelings for Sharon and he uses Max's money to buy The Queen Vic for her. However, his feelings are not reciprocated. He steals money from a charity set up by Bobby in order to try and frame Max for fraud. Ian is attacked in The Vic by Phil who was asked to do so after Sharon learns about Ian's role in Dennis’ death. Sharon and Kathy rush him to hospital where they learn he has a bleed on his brain. Fearing he is going to die, Ian proposes to Sharon who accepts his proposal. Kathy asks Sharon to get the marriage annulled, but she disagrees and vows to be there for Ian. After Phil fails to kill Ian because of Phil saying that Ian will always be family, Sharon mixes lithium into Ian's Christmas pudding to poison him. Later, Phil changes his mind and agrees to help Sharon murder Ian and they plan to make it look as if Ian has committed suicide, with Phil buying cocaine for Sharon to mix into his dinner after planning a romantic evening. However, Ian finds out the truth and confronts Sharon about her plan to kill him, just before he is about to eat her poisoned pasta. Sharon reveals she knows about his part in Dennis' death and calls him weak and cowardly. She adds that Ian is a hated man and that he deserves to die. A devastated Ian agrees and starts to eat the poisoned food. Willing to let him die at first, Sharon has a change of heart and makes Ian throw up the food, thereby saving his life. She ends her marriage to him and goes to Phil, telling him if he wants Ian dead so desperately, he will have to kill Ian himself. By the time Phil reaches The Vic, Ian has left the Square. Off-screen, Ian later sends Sharon an annulment and makes her the sole owner of the pub, although Sharon returns the Vic to Mick and Linda Carter (Kellie Bright) a few days later."]}, {"page": "The Queen Victoria", "response": ["Again, fire destroys The Queen Vic and Peggy transfers ownership to Phil before she leaves Walford. Phil renovates the pub and rents it to Alfie Moon and his wife Kat (Jessie Wallace). Kat is away temporarily in 2012 when Roxy again is landlady but upon Kat's return, The Queen Vic is forced to close down due to an outbreak of bed bugs, the source of which was thought to be Shirley Carter (Linda Henry), who has been staying. Instead, it was found that the source was the flat where Kat was meeting her lover Derek Branning (Jamie Foreman). The Queen Vic returns to Phil when Kat and Alfie fail to pay rent and Roxy is again made manager. However, Phil has a change of mind about Kat and Alfie when he finds out from Kat about her affair and subsequent attempt to save her marriage, all the while leaving Roxy as manager. During Christmas 2012, Alfie finds out about the affair, they separate and Roxy and Amy move back to The Queen Vic. Roxy replaces Kat as the joint licensee of the pub with Alfie, but leaves after Alfie reunites with Kat on the day of his and Roxy's wedding. As an act of revenge against the Moons, Phil decides to sell the pub and Alfie and Kat are forced to move out. Janine initially tries to buy the pub, but is arrested for murder before paying Phil. Mick Carter (Danny Dyer) buys The Queen Victoria on Christmas Day, 2013, and the following day moves into the pub with his wife Linda Carter (Kellie Bright) and son Johnny Carter (Sam Strike). Phil is surprised to discover that Mick is Shirley's brother. When Shirley persuades their estranged father into giving them £10,000 to repair the rising damp in the cellar, Mick and Linda give Shirley a 10% stake in the pub.", "* 2014: Dean Wicks (Matt Di Angelo) rapes Linda Carter (Kellie Bright) on the kitchen table.", "* 2014: After learning that Linda Carter (Kellie Bright) was raped by Dean Wicks (Matt Di Angelo), Mick Carter (Danny Dyer) destroys the interior of the pub.", "* 2015: Linda Carter (Kellie Bright) falls down the stairs whilst pregnant.", "* 2018: After he attempts to rape Linda Carter (Kellie Bright), Stuart Highway (Ricky Champ), unaware that he is being recorded, confesses to Linda that he shot himself.", "* 2019: Linda Carter (Kellie Bright), Mick Carter (Danny Dyer), Mel Owen (Tamzin Outhwaite) and Jack Branning (Scott Maslen) are taken hostage by Hunter Owen (Charlie Winter). Ben Mitchell (Max Bowden) and Keanu Taylor (Danny Walters) are shot and Hunter is killed by a police marksman.", "* 2020: While drunk, Linda Carter (Kellie Bright) tells Mick Carter (Danny Dyer) that she wants to divorce him.", "* 2020: After Linda Carter (Kellie Bright) insults Mick, she and Shirley Carter (Linda Henry) have a fight.", "* 2021: Mick Carter (Danny Dyer) tells Linda Carter (Kellie Bright) that he is going to report Katy Lewis (Simone Lahbib) to the police for child abuse.", "* 2021: Rainie Highway (Tanya Franks) reveals that the father of Linda Carter’s (Kellie Bright) baby is Max Branning (Jake Wood)"]}, {"page": "Angie Watts", "response": ["Kellie Bright has said that she has based her portrayal of Linda Carter on Angie."]}, {"page": "Sylvia Young Theatre School", "response": ["*Kellie Bright"]}, {"page": "Maria Friedman", "response": ["In 2010, Friedman appeared as a soloist in the BBC Proms tribute to Stephen Sondheim at the Royal Albert Hall, London. She sang the role of Mrs. Lovett in Sweeney Todd opposite Bryn Terfel. In October 2014, Friedman joined the cast of EastEnders as Elaine Peacock, the mother of established character Linda Carter (Kellie Bright).\"Eastenders Casts Maria Friedman as Linda Carter’s Mum\" tellytoday, 18 September 2014 She has since appeared in December 2014 and February to March 2015 to date, before returning for a three-month stint in September 2015."]}, {"page": "Mel Owen", "response": ["Hunter is arrested and Mel enters a lengthy legal battle to release her son from prison, though to no avail; he is imprisoned and Mel visits him. She becomes more reclusive and stressed without Hunter and tries to avenge Hunter's imprisonment by blaming Jack. Mel is informed by the police that Hunter will be transferred to a prison in the North of England for his safety, before being told that during a crash involving the prison van escorting him, he has escaped. Hunter eventually returns to Walford, and she conceals him in a derelict flat, where she tries to treat his wounds sustained in the crash. She plans to obtain fake passports and return to Portugal for a fresh start. When Hunter is healed, Mel smuggles him in the boot of her car and prepares to leave when Lisa returns, wanting Mel's help to smuggle Louise and her fiancé, Keanu Taylor (Danny Walters), out of the country; they agree for the five of them to move to Portugal. Mel learns that Hunter has escaped the car and taken her gun, Mel becomes panicked and tries to find him. In her search, she tries Jack's house, since Hunter wanted revenge on him for his imprisonment, and finds Jack's partner, Denise Fox (Diane Parish), unconscious on the floor after Hunter attacks her. She alerts the paramedics and goes to find Jack in The Queen Vic; she sees landlady Linda Carter (Kellie Bright) escorting him to the barrel store and realises that Hunter has ordered Linda to bring him there. Mel then cajoles Hunter in handing her the gun and they try to sneak him out of the pub unseen. When he is spotted, Hunter holds the pub hostage and shoots Ben Mitchell (Max Bowden); Mel tries to talk to him with no success and he takes Louise (Tilly Keeper) hostage in Albert Square with armed police surrounding them. Hunter shoots Keanu and Mel urges him to stop his actions; Hunter threatens Louise's life; he is then shot dead by a police marksman and Mel cradles his body, devastated."]}, {"page": "Janine Butcher", "response": ["She later gets a job as bar manager at The Queen Vic and becomes close with married landlord Mick Carter (Danny Dyer), much to the annoyance of Mick's mother and her former nemesis Shirley Carter (Linda Henry). His daughter Nancy (Maddy Hill) becomes suspicious of Janine when she moves into The Queen Vic after Honey evicts her. She later plans to seduce Mick, but he rebuffs her advances and orders her to leave, as he plans to rekindle his relationship with his alcoholic wife Linda Carter (Kellie Bright). Janine interrupts Mick's plans by visiting Linda, pretending she is called Judith Bernstein and manipulates her into drinking, upsetting Mick. Nancy remains suspicious of Janine and confronts her, leading to a fight. Janine decides to leave and moves in with former friend Sonia, in an attempt to gain Mick’s attention."]}, {"page": "EastEnders theme tune", "response": ["|1 January 2016 || \"Being Alive\" (performed by Alice Fearn, who played a wedding singer in the episode) was played up to and over the credits following the wedding of Mick Carter (Danny Dyer) and Linda Carter (Kellie Bright). The credits began rolling over the ending shot of Mick and Linda at the altar as it faded to black.", "|19 December 2016 || A cover of \"All I Want for Christmas Is You\" by Lady A plays up to and over the credits as Mick Carter (Danny Dyer) and Linda Carter (Kellie Bright) celebrate their son Ollie's (Charlie Harrington) first steps. The credits roll over a shot of Albert Square's gardens.", "| As Linda Carter (Kellie Bright), Mick Carter (Danny Dyer), Shirley Carter (Linda Henry) and Tina Carter (Luisa Bradshaw-White) head off to the Spice World – 2019 Tour, \"Who Do You Think You Are\" by the Spice Girls accompanies the regular theme tune."]}, {"page": "Dean Wicks", "response": ["Dropping his former nickname, Dean returns to the UK and develops a relationship with his maternal grandfather, Stan Carter (Timothy West). He follows Stan back to Walford, opening a salon there named Blades, funded by Stan, and briefly dating Lauren Branning (Jacqueline Jossa). He acquaints himself with his mother's family, who now own The Queen Vic, but is unkind towards Shirley, verbally abusing her for her poor parenting, leading to Mick Carter (Danny Dyer) punching him. Dean slowly bonds with his mother and begins to integrate into his newfound family. He is attracted to, then, later, obsessed with Mick's partner, Linda Carter (Kellie Bright), who maternally hugs him after Shirley hurts him by stealing from him because she owes Phil Mitchell (Steve McFadden). Dean breaks into Phil's house, reclaiming the money. Dean also gropes Linda's buttocks during a photoshoot at Blades. Although Dean helps clean Shirley up after she shoots Phil, Shirley's aunt Babe Smith (Annette Badland) refuses to let Shirley take Dean with them as she flees from the police, leaving Dean distraught. Linda comforts him and Dean attempts to have sex with her. When Linda protests, Dean rapes her. Linda tells no one about the ordeal but is mentally traumatized, more so when she discovers she is pregnant and fears that the baby is Dean's. Dean continues as if nothing has happened and begins dating Stacey after she moves into a flat shared with him. Stacey, herself a victim of rape, starts to notice Linda flinch whenever Dean is present and works out what has happened. She ends her relationship with Dean, throwing him out and refusing to believe his version of events; that sex with Linda had been consensual and that Linda's reaction stems from guilt. Stacey persuades Linda to tell Mick, which she finally does on Christmas Day 2014. Mick responds by pummelling Dean and is only stopped by Shirley's confession that Mick and Dean are, in fact, brothers. It transpires that Shirley is Mick's mother, not his sister, as he has grown up believing.", "During his time on the square, he formed a sexual relationship with Lauren Branning (Jacqueline Jossa) and performed sperm donation for Fiona \"Tosh\" Mackintosh (Rebecca Scroggs). On 31 August 2014, it was revealed that Dean would rape Linda Carter (Kellie Bright), after having developed an obsession for her in the months following his return. EastEnders bosses worked with charity Rape Crisis to develop the storyline, which took place in the week commencing on 6 October 2014. Dean's father Buster Briggs, played by Karl Howman, was introduced in mid November."]}, {"page": "Jane Beale", "response": ["Brett was nominated for \"Best Actress\" at The British Soap Awards 2015, but lost to co-star, Kellie Bright, who portrays Linda Carter. However, she won \"Best On-screen Partnership\" alongside Woodyatt."]}, {"page": "Stacey Slater", "response": ["Kat sees Stacey walking into a salon, from the top deck of a bus in London. Kat finds out where she lives and visits, where she meets Lily (Aine Garvey) and Stacey's boyfriend, Luke Riley (Matt Willis). Luke believes that Stacey's name is \"Jenny Smith\" and is unaware of her criminal history. Stacey sees Kat leaving and confronts her in Albert Square. Kat later tells Luke \"Jenny\" is really Stacey so he ends their relationship. Kat visits Janine in prison to ask her to withdraw the statement she made accusing Stacey of stabbing her. Janine agrees so Stacey returns to Albert Square. Luke visits Stacey, but leaves, after discovering that she killed Archie. Stacey decides to finally clear Bradley's name and calls the police, telling them that she killed Archie. She is arrested and later sentenced to five years in prison. After realising how much Lily is missing her, she decides to appeal her sentence on grounds of diminished responsibility, because of her bipolar disorder and is successful. Stacey returns to Walford, moving in with Kat and Alfie. As part of an insurance scheme, Alfie commits arson, destroying the home. Stacey works for Dean Wicks (Matt Di Angelo) at his salon, Blades, and they start dating. She and Lily move into Dean's flat and Stacey discovers that Alfie caused the fire. Stacey is disgusted when she discovers that Dean raped Linda Carter (Kellie Bright) and ends their relationship."]}, {"page": "Jericho (British TV series)", "response": ["* Kellie Bright as WPC Penny Collins "]}, {"page": "Kellie", "response": ["*Kellie Bright (born 1976), English actress"]}, {"page": "The British Soap Awards", "response": ["| \"Best On-Screen Partnership\"Presented by Marvin and Rochelle Humes|| David Neilson & Julie Hesmondhalgh (Roy & Hayley Cropper in Coronation Street) || Danielle Henry & Lu Corfield (Mandy Marquez & Lois Wilson in Doctors)Danny Dyer & Kellie Bright (Mick & Linda Carter in EastEnders)Chris Chittell & Charlie Hardwick (Eric & Val Pollard in Emmerdale)Joseph Thompson & Jennifer Metcalfe (Dr. Paul & Mercedes Browning in Hollyoaks)", "| \"Best Actress\"Presented by Phil Davis|| Kellie Bright (Linda Carter in EastEnders) || Alison King (Carla Connor in Coronation Street)Laurie Brett (Jane Beale in EastEnders)Natalie Anderson (Alicia Metcalfe in Emmerdale)Nikki Sanderson (Maxine Minniver in Hollyoaks)", "| \"Best Dramatic Performance\"Presented by Anita Dobson|| Kellie Bright (Linda Carter in EastEnders) || Simon Gregson (Steve McDonald in Coronation Street)Lorna Laidlaw (Mrs Tembe in Doctors)Natalie Anderson (Alicia Metcalfe in Emmerdale)Keith Rice (Finn O'Connor in Hollyoaks)", "| \"Best On-Screen Partnership\"Presented by Dom and Steph Parker|| Joe Duttine & Sally Dynevor (Tim & Sally Metcalfe in Coronation Street) || Ian Kelsey & Dido Miles (Howard Bellamy & Emma Reid in Doctors)Danny Dyer & Kellie Bright (Mick & Linda Carter in EastEnders)Danny Miller & Ryan Hawley (Aaron Livesy & Robert Sugden in Emmerdale)Ashley Taylor Dawson & Jessica Fox (Darren & Nancy Osborne in Hollyoaks)"]}, {"page": "Denise Fox", "response": ["On New Year's Eve, a pregnant Kim surprises Denise and accuses Ian of ruining Denise's life. The next day, Kim finds bruises on Patrick's arms and realises Denise had beaten him and confronts her. At the pub, Denise gets drunk, and after hearing of Emma Summerhayes' (Anna Acton) death, drunkenly slurs that Lucy's killer would be jailed if Emma had done her job properly. In anger of Denise's disrespectfulness, Ian says that despite what Kim said, Denise has been ruining her own life. On arriving home, she tells Kim she cannot be Patrick's carer any more. After an argument with Denise in The Queen Victoria public house, Kim goes into labour and gives birth to a daughter named Pearl. Although she disowns Denise, they eventually reconcile the next day. After Pearl's christening, she tells Denise that her husband doesn't exist and she made him up because of fear of being alone. However, Kim's confessions to Shirley, Kat Moon (Jessie Wallace), Linda Carter (Kellie Bright) and Patrick reveal that her husband does exist but she left him when she found out that he was a criminal. Eventually, when her husband Vincent Hubbard (Richard Blackwood) tracks her down in Walford, Kim works up the courage to tell Denise the truth about him and explains her experience when she went to tell him she was pregnant. Denise and Patrick soon become wary of Vincent's intentions."]}, {"page": "Ben Mitchell (EastEnders)", "response": ["Phil, who was told by Louise's mother Lisa Fowler (Lucy Benjamin) that Sharon's unborn child is not his, coerces Ben and Keanu to kidnap Jack, who he thinks is the father of the baby. After several hours of interrogation, Phil has a bloodied and bruised Jack released and Ben takes him home, witnessed by Halfway, who becomes suspicious. Ben tries to reason with Phil, who wants to kill the father, but relents and agrees to help Phil. A few days later, Halfway questions Ben about his encounter with Jack and where their relationship is going. To protect Halfway from the Mitchells, Ben breaks up with Halfway, claiming that he does not love him. On Christmas Eve, after hearing identical stories from Keanu and Sharon about a hotel, Phil works out that Keanu is the father and Ben vows to have him killed. On Christmas Day, Ben orders Martin to kill Keanu. However, a hungover Linda Carter (Kellie Bright), who on Christmas Eve had drunkenly fallen asleep in the back of the van Martin uses to kidnap Keanu, saves Keanu's life and helps Martin fake the recording of Keanu's \"murder\" later shown to Ben. Unaware of this, Ben begins to feel guilty about causing Keanu's \"death\" and when Halfway returns and proclaims he wants him back, Ben admits his part in having Keanu killed, causing a stunned Halfway to storm out on him."]}, {"page": "Max Branning", "response": ["Many of Max's storylines focus on his relationships, including his marriages to Tanya Branning (Jo Joyner), Kirsty Branning (Kierston Wareing) and Rainie Cross (Tanya Franks), and relationships with Gemma Clewes (Natalie J. Robb), Stacey Slater (Lacey Turner), Vanessa Gold (Zöe Lucker), Lucy Beale (Hetti Bywater), Emma Summerhayes (Anna Acton), Karin Smart (Denise van Outen), Carmel Kazemi (Bonnie Langford), Fi Browning (Lisa Faulkner), Ruby Allen (Louisa Lytton) and Linda Carter (Kellie Bright), many of which are extramarital affairs. Max has also embarked on feuds with his father Jim Branning (John Bardon), brothers Jack Branning (Scott Maslen) and Derek Branning (Jamie Foreman), as well as Sean Slater (Robert Kazinsky), Harry Gold (Linal Haft), Janine Butcher (Charlie Brooks), Phil Mitchell (Steve McFadden), Cora Cross (Ann Mitchell), Jay Brown (Jamie Borthwick), Carl White (Daniel Coonan), Charlie Cotton (Declan Bennett), Ben Mitchell (Harry Reid/Max Bowden), Ian Beale (Adam Woodyatt), Jane Beale (Laurie Brett), Steven Beale (Aaron Sidwell), Mick Carter (Danny Dyer), Martin Fowler (James Bye), Stuart Highway (Ricky Champ) and Kathy Beale (Gillian Taylforth).", "After developing a friendship during lockdown, Max supports Linda Carter (Kellie Bright) when he catches her having a drink, despite battling an alcohol addiction. Linda's friend Sharon Watts (Letitia Dean) tells Max to leave Linda alone, but after a heart to heart, Max and Linda kiss. A guilty Linda tells Mick, who angrily warns Max off. However, Linda's marriage continues to fall apart as Mick pushes her away, and she and Max kiss again. Max uses Linda as an alibi after Ian is attacked by an unknown assailant and left for dead. Mick tells Linda to stay away from him, and, hurt, she goes to stay with Max and the pair have sex. Linda becomes suspicious when Max starts to behave secretively, and it is revealed that Max had disposed of Linda's award from the Lucy Beale Foundation, assuming that Linda had attacked Ian. Max decides to join Lauren and Louie in New Zealand and asks Linda to follow him but she says no and leaves Abi in the care of Rainie and her husband Stuart Highway (Ricky Champ) and leaves the square alone. Several months later, Jack takes Abi to visit Max in France but returns without Abi and confirms to Denise Fox (Diane Parish) that Max has fled and taken Abi with him."]}, {"page": "John Altman (actor)", "response": ["In February 2015, he appeared as a guest on The Graham Norton Show as part of an EastEnders special episode alongside June Brown, Adam Woodyatt, Letitia Dean, Danny Dyer, Kellie Bright, Shane Richie, Jessie Wallace and Pam St. Clement."]}, {"page": "Sparkleshark", "response": ["*Carol - Kellie Bright"]}, {"page": "Abi Branning", "response": ["Abi gets her job back at The Queen Vic and celebrates with Lauren and Whitney Dean (Shona McGarty), Lee's pregnant fiancée. Abi drunkenly confesses to Lauren about her one-night stand with Lee, so she urges Abi to confess to Whitney, as Whitney has caught chlamydia from Lee. Abi does so but this results in much resentment. Babe emotionally blackmails Abi, forcing her to resign. Abi exposes Babe's secrets to the pub's landlord, Mick Carter (Danny Dyer) with Whitney defending her, so he tells Abi that she can keep her job, but this causes tension when she is later threatened by Babe. However, Abi struggles to work on her own and so Linda Carter (Kellie Bright) is forced to ask Babe back to help her. Abi then persistently bickers about an order and lack of hygiene so blames it on Babe. Angry with Abi's behaviour, Linda sacks her. Abi locks Babe in the kitchen freezer room as an act of revenge, although Babe frames her sister Sylvie Carter (Linda Marlowe) who she strongly dislikes and has Alzheimer's disease. Abi is then reinstated at the Vic by a seemingly apologetic Babe but her behaviour, when alone in the kitchen with Abi, is threatening. Babe later leaves Walford after being thrown out by her family, so Abi runs the kitchen alone. Abi forms a friendship with Donna Yates (Lisa Hammond) when she moves in with Ben and Jay, and Donna convinces Abi to move in as well, though she feels bad about leaving Dot on her own, but Dot gives her blessing when Donna reveals that Abi wants to move out. Abi is inwardly resentful of Lauren's success and, following Lauren's secret abortion of which Abi was made aware, Abi tells Lauren's boyfriend, Steven Beale (Aaron Sidwell) that they would make a good couple during a heart-to-heart, but he tells her she is too young to be a mother. On Father's Day, feeling second best to Lauren and wound up during an argument with Steven, Abi reveals the abortion. At Abi's 21st birthday party, Lauren is jealous when her boss, Josh Hemmings (Eddie Eyre), flirts with Abi, which leads to an argument, with Abi throwing a drink over her sister and then evicting her from the party. Later, the tension simmering between Abi and Steven leads to them having sex, even though he warns her it will mean nothing. Abi and Steven continue an affair and Abi learns that Steven is lying about having a brain tumour so that Lauren will not leave him. Despite being against the idea, Abi does not tell Lauren as Steven promises Abi he is planning to leave Lauren to be with her. Then Abi is stunned by Steven's public marriage proposal to Lauren. Jane overhears Abi and Steven talking about their relationship and confronts them. Abi then discovers she is pregnant by Steven. Abi helps Steven keep up the lie by giving him a brain scan from a dog and animal medication that will give him symptoms of an illness, and helping to keep Lauren away from doctor's appointments that Steven has invented."]}, {"page": "Lauren Branning", "response": ["Several months later, Ian agrees to babysit Louie while Lauren and Peter patch up their relationship. Shortly afterwards, Kathy calls Ian to tell Lauren and Peter that Bobby is being released from prison. However, Ian tells her that Lauren is refusing to forgive Bobby for ruining her relationship with her dad and causing Abi's death. In February 2020, Jack reveals to Max that Lauren and Peter have split up again and he has been aiding Lauren with money. In November 2020, Lauren's house in New Zealand burns down and she asks Peter, who is back in Walford, to send over money. Later, Max makes plans to visit Lauren with his lover Linda Carter (Kellie Bright), but eventually leaves for New Zealand alone when Linda rejects him."]}]}}