{"wiki_id": "http://www.wikidata.org/entity/Q6384548", "itemLabel": "Keith Jebb", "itemDescription": "British poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Jebb", "wikipedia_page": {"main": "Keith Jebb is a contemporary English poet and critic. He attended St Catharine's College, Cambridge, and is the current Head Lecturer of Creative Writing at the University of Bedfordshire, Luton. He is also the author of A. E. Housman (Seren Press), a work commended by Harold Bloom in the introduction to his A. E. Housman.", "link_mentions": [{"page": "British Poetry Revival", "response": ["Into the 1990s and beyond poets such as Johan de Wit (poet), Sean Bonney, Jeff Hilson, and Piers Hugill have surfaced after direct involvement in the Cobbing-led Writers Forum workshop.  An interesting sub-development of the workshop was the instigation of the Foro De Escritores workshop, in Santiago Chile, run on similar aesthetic principles. This workshop has contributed to the development of Martin Gubbins, Andreas Aandwandter, and Martin Bakero, to name but few. Those associated with the Barque Press (most obviously Andrea Brady and Keston Sutherland), and more recently Bad Press (in particular, Marianne Morris and Jow Lindsay), have made a similar impact via the Cambridge scene. Perdika Press in North London has been instrumental in bringing to wider attention contemporary Modernist writers such as Nicholas Potamitis, Mario Petrucci, Robert Vas Dias and Peter Brennan; the press was also responsible for the first publication in Britain of Bill Berkson. From Scotland, Peter Manson, who had co-edited the magazine Object Permanence in the mid-1990s, Drew Milne, editor of Parataxis, David Kinloch and Richard Price (previously editors of Verse and Southfields) also emerged more fully as poets in their own right. New writings have arisen from the involvement of cris cheek, Bridgid Mcleer, and Alaric Sumner, under the direction of Caroline Bergvall and John Hall through the Performance Writing programme at Dartington College of Arts including Kirsten Lavers, Andy Smith, and Chris Paul; from the involvement of Redell Olsen in the MA in Poetic Practice at Royal Holloway, University of London, including Becky Cremin, Frances Kruk, Ryan Ormond, Sophie Robinson, John Sparrow and Stephen Willey; and through Keith Jebb at University of Bedfordshire's Creative Writing programme, including Alyson Torns and Allison Boast."]}, {"page": "Jebb", "response": ["*Keith Jebb, English poet and critic"]}, {"page": "Tom Rawling", "response": ["From 1979, Rawling took over the workshop established by Stevenson at the Old Fire Station Arts Centre, George Street, Oxford. Poets associated with this group included Anne Born, Pauline Stainer, Peter Forbes, Helen Kidd, W.N. Herbert, Elizabeth Garrett, Martyn Crucefix and Keith Jebb."]}]}}