{"wiki_id": "http://www.wikidata.org/entity/Q6385049", "itemLabel": "Keith Speed", "itemDescription": "British politician (1934-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Speed", "wikipedia_page": {"main": "Sir Herbert Keith Speed  (11 March 1934 – 12 January 2018) was a British Conservative politician and former Member of Parliament. He was a descendant of cartographer and historian John Speed.", "link_mentions": [{"page": "February 1974 United Kingdom general election", "response": ["*Keith Speed  (Meriden)"]}, {"page": "Royal Naval Reserve", "response": ["* Lt Cdr Sir Keith Speed RD RNR – Conservative Member of Parliament 1968–97 and Navy Minister 1979–81, sacked by Thatcher when refused reductions in RN strength prior to Falklands"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Keith Speed"]}, {"page": "Damian Green", "response": ["Green stood against Labour's Ken Livingstone in Brent East at the 1992 general election, but lost by 5,971 votes. He was elected to the House of Commons for the Kent seat of Ashford at the 1997 general election following the retirement of Tory MP Keith Speed. Green held the seat with a majority of 5,345 and has remained the constituency's MP. He made his maiden speech on 20 May 1997."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Keith Speed"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Keith Speed"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|Keith Speed"]}, {"page": "List of MPs elected in the October 1974 United Kingdom general election", "response": ["|Keith Speed"]}, {"page": "List of ministers under Margaret Thatcher", "response": ["!scope=row|Keith Speed"]}, {"page": "Ashford (UK Parliament constituency)", "response": ["| Keith Speed"]}, {"page": "Meriden (UK Parliament constituency)", "response": ["| Keith Speed", "Until 1983 the seat was a Labour-Conservative marginal, covering the coal mining areas of northern Warwickshire and the more affluent area near Solihull.  It changed hands between the two parties several times, including in a by-election in 1968, which was won by Keith Speed of the Conservatives."]}, {"page": "William Harvey Hospital", "response": ["In 1978, Keith Speed, MP for Ashford, criticised proposals that some services would require patients to be bussed back to the old hospital when William Harvey Hospital opened."]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| Keith Speed"]}, {"page": "Robin Squire", "response": ["At an early stage, he demonstrated a political position on the left of the Conservative Party. At the Conservative Party Conference in 1973 he was booed when he opposed a motion calling on the Government to recognise the white minority regime in Rhodesia.The Times, 12 October 1973 At the Conservative Local Government Conference in 1977, Squire was one of five council leaders who spoke against plans advanced by Keith Speed (then Conservative local government spokesman) to abolish the domestic rating system. Squire warned that abolition of the rating system without a widely accepted alternative to put in its place might be highly damaging.The Times, 28 February 1977"]}, {"page": "Lord Lieutenant of Kent", "response": ["* Sir Keith Speed"]}, {"page": "List of United Kingdom MPs: S", "response": ["*Keith Speed"]}, {"page": "Heath ministry", "response": ["|Keith Speed||8 November 1971 – 21 September 1973|| ", "|Keith Speed||7 April 1972 – 4 March 1974|| "]}, {"page": "List of United Kingdom by-elections (1950–1979)", "response": ["|Keith Speed"]}, {"page": "Herbert Keith Speed", "response": ["#REDIRECT Keith Speed"]}, {"page": "John Tomlinson, Baron Tomlinson", "response": ["Tomlinson stood for Parliament without success in 1966 at Bridlington and in 1970 at Walthamstow East. He was elected to the House of Commons as Labour Member of Parliament for Meriden in the February 1974 general election, defeating the sitting Conservative MP Keith Speed. In the October 1974 General Election he retained the seat, defeating a new Conservative candidate, the former  Chairman of the Highway Planning Committee in the London Borough of Hammersmith, and Chairman of the Hyde Park Tories (the Conservative Party's open air speakers) Christopher Horne. He lost his seat in the 1979 general election to the Conservative candidate, Iain Mills."]}, {"page": "Speed (name)", "response": ["* Keith Speed (1934–2018), English politician"]}, {"page": "United Kingdom general election records", "response": ["* October 1974: Donald Anderson, Jeremy Bray, Gwynfor Evans, Robert Hicks, Evan Luard, John Mackintosh, Fergus Montgomery, Enoch Powell, Nicholas Scott, Keith Speed"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Keith Speed"]}, {"page": "List of Lords Commissioners of the Treasury", "response": ["**Keith Speed"]}, {"page": "Portway, Bristol", "response": ["Traffic levels increased substantially on the Portway when the M5 motorway was extended past Cribbs Causeway to meet it in 1971, as it provided a convenient way of avoiding the congested road network around north-west Bristol. Although this was only intended to be a stopgap measure until the Avonmouth Bridge was completed, construction of the bridge was repeatedly delayed. Transport Minister Keith Speed proposed a temporary solution of signing all Midlands – South West traffic via the Portway, followed by either the A369 from Bristol to Portishead northbound, or local roads southbound. The scheme required minor upgrading to junctions along the Portway. The Avonmouth Bridge opened in May 1974, making the scheme redundant."]}, {"page": "1968 Meriden by-election", "response": ["The Meriden by-election, 1968 was a by-election held for the British House of Commons constituency of Meriden in Warwickshire on 28 March 1968.  It was won by the Conservative Party candidate Keith Speed."]}, {"page": "First Thatcher ministry", "response": ["|Under-Secretary of State for the Navy||Keith Speed||6 May 1979 – 18 May 1981||Office abolished 29 May 1981"]}, {"page": "Aftermath of the Falklands War", "response": ["In 1980, low funding caused many ships to be in harbour for months due to lack of spare parts and fuel. The largest cut in the Royal Navy's conventional forces led to the resignation of the Navy Minister Keith Speed in 1981. Sea battles, mass convoys, amphibious landings, and coastal bombardments were considered obsolete in the second half of the 20th century. The head of the admiralty, First Sea Lord Admiral Sir Henry Leach, was still fighting the cuts in the Ministry of Defence together with the Chief of Defence Staff, who by chance, was also a naval officer – Admiral of the Fleet Sir Terence Lewin."]}, {"page": "Castaways' Club", "response": ["*Lieutenant Commander Sir Keith Speed RD"]}, {"page": "1992 Birthday Honours", "response": ["* Herbert Keith Speed, . For political service."]}, {"page": "Jeffery John Mumford Speed", "response": ["Jeffery Speed is the brother of Sir Herbert Keith Speed and a direct descendant of John Speed."]}, {"page": "List of Old Bedford Modernians", "response": ["* Sir Keith Speed DL (1934-2018), Conservative MP. Undersecretary of State for Defence (1979–81)Obituary in The Times, February 19, 2018"]}]}}