{"wiki_id": "http://www.wikidata.org/entity/Q6384297", "itemLabel": "Keith Dyson", "itemDescription": "English footballer (born 1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Dyson", "wikipedia_page": {"main": "Keith Dyson (born 10 February 1950) is an English former professional footballer. He played as a forward.\nDyson began his career with Newcastle United in 1968. In three years at St James' Park, he made 76 league appearances and scored 22 goals.\nIn October 1971, he joined Blackpool in a deal that took Tony Green to Tyneside for a then-club record fee. Dyson went on to score thirty goals in 94 appearances during his five-year Bloomfield Road career. He was advised to retire from the professional game as a result of a knee injury.His final club was Lancaster City, though after playing his testimonial game, he went to America on holiday in the summer of 1978 and met up with friend Jackie Mudie. The former Blackpool great was coaching the Cleveland Cobras and convinced Dyson to play for the second half of the season with remarkable results.\nHe returned to the UK and managed Lancaster City between 1979 and 1982.", "link_mentions": [{"page": "Lancaster City F.C.", "response": ["|Keith Dyson||1980||1982"]}, {"page": "Alan Suddick", "response": ["On 31 December 1976, he moved to Stoke City for a fee of £12,000. Injury restricted him to just nine matches for Stoke in the 1976–77 season, he did score once which came in a defeat away at West Bromwich Albion. In August 1977 he joined Fourth Division club Southport on loan, playing six games. Then in September he joined Third Division club Bury, before ending his league career at the end of the 1977–78 season. After spending a time coaching with Blackpool, in August 1978 he moved into non-league football with Barrow who were then in the Northern Premier League, where he played 38 games, scoring three goals. He also became the club's part-time player-manager, balancing a role as a hotel manager at the same time. On 2 November 1979 he joined Northern Premier League club Lancaster City teaming up at Giant Axe with former Blackpool teammate Keith Dyson."]}, {"page": "Tony Green (footballer)", "response": ["In the month of his 25th birthday, October 1971\"Tony Green\", Sporting Heroes after him putting in a transfer request, Newcastle United took Blackpool's Scottish internationalist back to England's top tier. Newcastle made a £150,000 offer in a part-exchange deal involving Keith Dyson. Green became Newcastle's second most expensive signing, after Malcolm Macdonald who had signed in May the same year from Luton Town for £180,000. Green's debut was away at Everton\"Newcastle United Tony Green\" Replay Football on 30 October 1971. The 1–0 defeat put Newcastle bottom of England's top tier at that time after what had been their fifth consecutive defeat. Green scored though in the next game, a 3–1 home win against Southampton. Newcastle's revival for that season was under way to start an unbeaten run of five wins and two draws. The Geordies climbed the table to finish eleventh.\"Newcastle United Results Fixtures 1971/1972\" football.co.uk Macdonald with 30 goals from 52 games was the primary beneficiary of the team's attacking skills. Green was the brains and drive of the team. In a 2–0 victory at Manchester United, Green was instrumental in creating both goals. The first was a precision chip over a defender to release Stewart Barrowclough to centre for John Tudor to score. The second was a box to box solo run that left George Best on the deck in Green's wake. Green crossed for Barrowclough to score.\"12/02/1972 Manchester United v Newcastle United\" youtube.com"]}, {"page": "Glyn James", "response": ["Bob Stokoe, who succeeded Les Shannon during the previous term, moved James to the forward line for the first third of the 1971–72 season. James scored six goals in those fifteen games (including four in the first two games), but a combination of the team's losing by single goals here and there and the arrival of Keith Dyson, he was moved back into defence, and Blackpool went on to finish sixth. James scored a goal in Blackpool's 5–0 whitewash of Charlton Athletic at Bloomfield Road on the final day of the season – a result that relegated the Londoners."]}, {"page": "1969–70 Football League", "response": ["|32||align=left|  Keith Dyson ||align=left| Newcastle United ||12||0||0||2||12"]}, {"page": "History of Blackpool F.C. (1962–present)", "response": ["New faces included goalkeepers John \"Budgie\" Burridge and George Wood, Chris Simpkin and Dave Lennard, and finally Keith Dyson. Dyson came in a part-exchange deal that took Tony Green to Tyneside and boosted Blackpool's finances to the tune of £150,000."]}]}}