{"wiki_id": "http://www.wikidata.org/entity/Q6384155", "itemLabel": "Keith Butler", "itemDescription": "English cricketer (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Butler_(English_cricketer)", "wikipedia_page": {"main": "Keith Andrew Butler (born 20 January 1971) is a former English cricketer.  Butler was a right-handed batsman who bowled right-arm medium pace.  He was born in Camden Town, London.\nButler made his one and only first-class appearance for Essex in 1989 against Cambridge University.  In his match he scored an unbeaten 10 runs.Butler made his List A debut for Essex in the same season against Somerset.  From 1989 to 1992, he represented the county in 4 List A matches, the last of which came against Gloucestershire.  At the end of the 1992 season he was released by Essex.\nThe following season the joined Suffolk.  During that season he played his final List A match in his only appearance in that format for Suffolk, which came against Essex in the 1993 NatWest Trophy.  In his career total of 5 List A matches, he scored 23 runs at a batting average of 11.50, with a high score of 17.  In the field he took 2 catches.\nIt was during the 1993 season that he made his Minor Counties Championship debut against Bedfordshire.  During the 1993 season he represented the county in 8 Championship matches, the last of which came against Northumberland.  He made a single MCCA Knockout Trophy appearance for the county in the same season against Cambridgeshire.  The 1993 season was his only season with Suffolk.", "link_mentions": [{"page": "Keith Butler", "response": ["Keith Butler may refer to:", "*Keith Butler (American football) (born 1956), current NFL assistant", "*Keith Butler (baseball) (born 1989), American baseball player", "*Keith Butler (basketball) (born 1983), basketball player formerly in the NBA D-League, see 2008 NBA Development League Draft", "*Keith Butler (English cricketer) (born 1971), former English cricketer", "*Keith Butler (New Zealand cricketer) (born 1933), New Zealand cricketer", "*Keith Butler (cyclist) (born 1938), former British cycling champion", "*Keith Butler (Michigan politician), American pastor and Republican politician from Michigan", "*Keith Butler (author) (born 1948), Indian Australian writer", "*Keith Butler (Ontario politician) (1920–1977), Canadian politician"]}, {"page": "Keith Butler (cyclist)", "response": ["Keith Butler (2 September 1938 – 13 March 2019) was a British cycling champion who raced as a professional in Belgium and France and who later organised cycle races in England.", "His father, Stan Butler, was a significant time-triallist in Britain in an era when the country had only velodrome racing and dawn competitions on the road against the clock. Stan Butler also rode the Olympic Games. Keith Butler's son, Gethin Butler, was a prominent amateur rider in Britain during the 1990s."]}]}}