{"wiki_id": "http://www.wikidata.org/entity/Q6388654", "itemLabel": "Ken Wagstaff", "itemDescription": "English footballer (born 1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_Wagstaff", "wikipedia_page": {"main": "Kenneth Wagstaff (born 24 November 1942) is an English former footballer noted for his playing career at Mansfield Town and Hull City football clubs. In 2000, club fans of both Mansfield Town and Hull City voted Wagstaff their club's player of the century – the only player to be named by two football league clubs. During club centenary celebrations in 2004 he was voted \"The greatest player to play for Hull City AFC\" by supporters. He was voted for by both Mansfield and Hull City fans as \"all-time favourite player\" in 2007.", "link_mentions": [{"page": "Oggy Oggy Oggy", "response": ["Several variations of the \"Oggy\" chant have arisen as its cultural significance and recognition has grown. In the mid 1960s Hull City A.F.C. fans adapted it to \"Waggy,\" to cheer for Ken Wagstaff and in the 1970s, Chelsea F.C. football fans changed it to \"Ozzie,\" in honour of Peter Osgood, the footballer and speedway fans in the 70's and early 80's would chant \"Ollie Ollie Ollie to cheer on Danish rider Ole Olsen. When Margaret Thatcher came to power in Britain in 1979 a variation of the chant (\"Maggie Maggie Maggie, Out Out Out!\") was adopted by some of her opponents."]}, {"page": "Omar Sharif", "response": ["Sharif became friends with Peter O'Toole during the making of Lawrence of Arabia. They appeared in several other films together and remained close friends. He was also good friends with Egyptologist Zahi Hawass. Actor and friend Tom Courtenay revealed in an interview for the 19 July 2008 edition of BBC Radio's Test Match Special that Sharif supported Hull City Association Football Club and in the 1970s he would telephone their automated scoreline from his home in Paris for score updates. Sharif was given an honorary degree by the University of Hull in 2010 and he used the occasion to meet Hull City football player Ken Wagstaff. Sharif also had an interest in horse racing spanning more than 50 years. He was often seen at French racecourses, with Deauville-La Touques Racecourse being his favourite. Sharif's horses won a number of important races and he had his best successes with Don Bosco, who won the Prix Gontaut-Biron, Prix Perth and Prix du Muguet. He also wrote for a French horse racing magazine."]}, {"page": "Cliff Britton", "response": ["In 1961 he became manager of Hull City. Again he relied on youth rather than the transfer market until an injection of cash in 1964 allowed him to bring in new players such as Ken Wagstaff. Consequently, Hull eventually won the Third Division championship in the 1965–66 season. He continued to trust the same group of players instead of bringing in new talent and so Hull's challenge for promotion to the First Division faltered. He became general manager of Hull City in 1970 and was instrumental in the recruitment of Terry Neill as his successor."]}, {"page": "Bridlington Town A.F.C.", "response": ["|align=\"left\"| Ken Wagstaff||align=centre|Manager||align=centre|1978||align=centre|1980"]}, {"page": "Caroline Springs George Cross FC", "response": ["*  Ken Wagstaff"]}, {"page": "1964–65 in English football", "response": ["*Ken Wagstaff (Mansfield Town and Hull City) – 35 goals"]}, {"page": "1962–63 in English football", "response": ["*Ken Wagstaff (Mansfield Town) – 34 goals"]}, {"page": "Wagstaff", "response": ["* Ken Wagstaff (born 1942), English professional footballer"]}]}}