{"wiki_id": "http://www.wikidata.org/entity/Q6384673", "itemLabel": "Keith M. Ashman", "itemDescription": "British theoretical astrophysicist", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_M._Ashman", "wikipedia_page": {"main": "Keith M. Ashman (born 13 December 1963) is a British theoretical astrophysicist, educated at St Albans School, Hertfordshire, and  Queen Mary College (Bachelor's), University of London (PhD).  He was a professor at the University of Missouri-Kansas City, and has worked as a professor at the University of Kansas, and Baker University. He is the coauthor with Stephen E. Zepf of Globular Cluster Systems, and was one of three scientists (the others being François Schweizer and Steve Zepf) to suggest the formation of young globular clusters by colliding spirals might explain the large number of globular clusters present in elliptical galaxies. This was later supported by the findings of the Hubble Space Telescope.He is also the author of \"After the Science Wars,\" a text on the philosophy of science, and was a bass guitarist in the Lawrence, KS based band \"The Hefners.\"\nIn December 2007 Ashman left his tenureship at University of Missouri-Kansas City in order to pursue a career as a professional poker player.", "link_mentions": [{"page": "Science wars", "response": ["In the first few years after the 'Science Wars' edition of Social Text, the seriousness and volume of discussion increased significantly, much of it focused on reconciling the 'warring' camps of postmodernists and scientists.  One significant event was the 'Science and Its Critics' conference in early 1997; it brought together scientists and scholars who study science, and featured Alan Sokal and Steve Fuller as keynote speakers.  The conference generated the final wave of substantial press coverage (in both news media and scientific journals), though by no means resolved the fundamental issues of social construction and objectivity in science.Baringer, Philip S. (2001). \"Introduction: 'the science wars'\", from After the Science Wars, eds. Keith M. Ashman and Philip S. Baringer. New York: Routledge, p. 2."]}, {"page": "St Albans School, Hertfordshire", "response": ["* Keith M. Ashman (b. 1963), theoretical physicist and globular clusters expert"]}, {"page": "Ashman", "response": ["*Keith M. Ashman (born 1963), British theoretical astrophysicist"]}, {"page": "Keith Ashman", "response": ["#redirect Keith M. Ashman"]}]}}