{"wiki_id": "http://www.wikidata.org/entity/Q6384607", "itemLabel": "Keith Knox", "itemDescription": "Scottish footballer (born 1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Knox", "wikipedia_page": {"main": "Keith Knox (born 6 August 1964 in Stranraer) is a Scottish former football player and was the manager of Creetown F.C. until his resignation in September 2017.", "link_mentions": [{"page": "Stranraer", "response": ["*Keith Knox, footballer"]}, {"page": "Clyde F.C.", "response": ["* Keith Knox (2016)"]}, {"page": "Mail carrier", "response": ["* Keith Knox, a Scottish footballer who also worked as a postman throughout his 25-year career"]}, {"page": "Stranraer F.C.", "response": ["On 21 January 2009, club chairman Nigel Redhead stated that Stranraer owed £250,000, and had a 50–50 chance of survival to the end of the season. In response, on 22 January 2009, a small consortium launched the Friends of Stranraer F.C. to try to secure the club's future through donations from the football community at www.savestranraerfc.com. On 23 January 2009, as part of efforts to reduce costs to a manageable level, key player Gregory Tade transferred to Clyde. On 24 January 2009, Stirling Albion defeated Stranraer 8–2. Shortly after the game, Stranraer and team manager Derek Ferguson parted company by mutual consent and Keith Knox took over the reins. On 4 April 2009, after a 3–0 loss to Raith Rovers, Stranraer's relegation to Division Three was confirmed, meaning the club had played in a different division for each of their last eight seasons."]}, {"page": "2008–09 Scottish Second Division", "response": ["|  Keith Knox"]}, {"page": "2008–09 in Scottish football", "response": ["|   Keith Knox"]}, {"page": "Scottish Football League monthly awards", "response": ["| Keith Knox"]}, {"page": "Stephen Aitken", "response": ["Aitken played for Greenock Morton, Stranraer, Stenhousemuir and Junior side Arthurlie. He rejoined Stranraer in 2009 as assistant manager to Keith Knox. Aitken retired as a player in 2011, and he has since managed Stranraer and Dumbarton."]}, {"page": "2001 Scottish Challenge Cup Final", "response": ["|DF ||5|| Keith Knox || "]}, {"page": "Knox (surname)", "response": ["* Keith Knox (born 1964), Scottish football player and manager", "* Keith Knox (boxer), Scottish boxer of the 1990s and 2000s"]}, {"page": "2011–12 Scottish Third Division", "response": ["| Keith Knox"]}, {"page": "2012–13 Stranraer F.C. season", "response": ["Stranraer began the season under the management of Keith Knox. On 22 October 2012, Knox was sacked by the club following unacceptable results, with Knox's assistant Stephen Aitken taking over as interim manager following his departure. After the Forfar Athletic match on 27 October 2012, Aitken was given the manager's job on a permanent basis."]}]}}