{"wiki_id": "http://www.wikidata.org/entity/Q6387559", "itemLabel": "Ken Early", "itemDescription": "Irish broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_Early", "wikipedia_page": {"main": "Kenneth Early (born 4 February 1979) is an Irish journalist and broadcaster. He is currently a director of Second Captains and is a host of both Second Captains @ The Irish Times and the television show Second Captains Live on RTE 2.  He is also a columnist with The Irish Times. He is a Shamrock Rovers fan who started supporting them in the 1980s.\nHe was Chief Football Correspondent for Newstalk and was a key member of the station's Off The Ball football show.Early was present on the show from its inception until its cessation in March 2013 following a dispute with radio management.The eldest of four children, Early was raised in (Templeogue, by Greenhills Park) and graduated from Trinity College, Dublin in 2000. During his time at the University, he served as the editor of TCD Miscellany, and was also an active member of the University Philosophical Society. One of his earliest exposures to sport was as a member of the Templeogue Swimming Club.Not only did he co-present Off The Ball for Newstalk, he has also fronted the Arts show Culture Shock on the same radio station. He has also presented the early Saturday morning political programme Saturday Edition.", "link_mentions": [{"page": "University Philosophical Society", "response": ["* Ken Early, journalist and sports broadcaster. Steward, 1998–99."]}, {"page": "List of Trinity College Dublin people", "response": ["*Ken Early, soccer journalist "]}, {"page": "St Mac Dara's Community College", "response": ["*Ken Early, sports journalist"]}, {"page": "Second Captains Live", "response": ["Each week Irish sports stars join the presenters to discuss their careers and the week's major sports stories. The show is filmed before a live studio audience and is the television debut of the award-winning team behind the Off The Ball sports programme on Newstalk, Eoin McDevitt, Ken Early, Ciarán Murphy, Simon Hick and Mark Horgan."]}, {"page": "Second Captains", "response": ["Second Captains is an Irish media company set up in March 2013 by Eoin McDevitt, Ken Early, Mark Horgan, Ciarán Murphy and Simon Hick. Their independent, member-led, commercial-free platform called The Second Captains World Service is now the 4th biggest podcast in the world on Patreon.The company specialises in television, radio and online production and currently broadcasts from their studios in Dublin daily on secondcaptains.com. Second Captains were the first major radio show to move from traditional programming to podcasting in Ireland and remain the most-popular podcast ever produced in Ireland.", "Second Captains expanded its online shows in February 2017 and launched The Second Captains World Service podcast feed available only to Second Captains' members. The Player's Chair Podcast hosted Richie Sadlier and Ken Early's Political Podcast were added to the roster of programming. The commercial-free, subscriber-based model had over 10k members after 12 months.", "The name Second Captains comes from a press conference exchange Ken Early once had with then-Ireland football manager Steve Staunton. Commenting on the return of experienced goalkeeper Shay Given to the starting team, Early asked Staunton if it was \"almost like having a second captain on the team.\"  Staunton paused for a moment and then said - \"Pffft... second captain, first captain, whatever.\""]}, {"page": "Off the Ball (media company)", "response": ["In 2006, presenter Ger Gilroy moved to the morning breakfast show alongside Claire Byrne,\"The breakfast battle and the return of Byrne\", The Irish Times, 2 December 2006, (Retrieved 10 January 2018) with Eoin McDevitt joining Ken Early and Ciaran Murphy as the core weeknight presenting team. In March 2013, McDevitt, Early and Murphy resigned, along with producers Mark Horgan and Simon Hick,Byrne, Cormac \"Entire Newstalk’s Off the Ball team resigns\", The Irish Independent, 4 March 2013, (Retrieved 10 January 2018) eventually joining The Irish Times under the name of Second Captains.O'Dwyer, Davin \"Second Captains find a new pitch\", The Irish Times, 7 September 2013, (10 January 2018) Presenters Joe Molloy and Dave McIntyre increased their presence on weekday programming, while Adrian Barry and Colm Parkinson joined the team shortly afterwardsCrowe, Marie; \"Off The Ball's new-look crew back on right wavelength\" The Irish Independent,11 August 2013 (Retrieved 10 January 18)"]}]}}