{"wiki_id": "http://www.wikidata.org/entity/Q6389864", "itemLabel": "Kenneth Berrill", "itemDescription": "English economist and public servant", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenneth_Berrill", "wikipedia_page": {"main": "Sir Kenneth Berrill  (28 August 1920 – 30 April 2009) was an English economist and public servant.", "link_mentions": [{"page": "List of people associated with the London School of Economics", "response": ["* Sir Kenneth Berrill, chief economic adviser to the Treasury; Head of the Central Policy Review Staff"]}, {"page": "National Institute of Economic and Social Research", "response": ["There have been chairs of council since the Institute was created. The first was Lord Stamp, from 1937 to 1942. He was succeeded by Sir Henry Clay, who held the position from 1942 until 1949. Subsequent chairs included Humphrey Mynors, Sir Austin Robinson, Sir John Woods, Sir Robert Hall, Sir Hugh Week, Sir Donald MacDougall, and Sir Kenneth Berrill. Diane Coyle became the first woman to hold the position in the history of the Institute, taking over the position from Sir Tim Besley. Since November 2018, Professor Nicholas Crafts CBE has held the position."]}, {"page": "Abi Gamin", "response": ["Abi Gamin was climbed for the first time in 1950 by a small Anglo-Swiss Expedition comprising Alfred Tissierès, R. Dittert, and G. Chevalley (all Swiss), and Englishman Kenneth Berrill. They approached from the north side through Tibet, reached over the Mana Pass. Their NE ridge route was the same route the Schlagintweit's had tried nearly a century earlier! The summit was reached by the three Swiss members: they may have been accompanied by Sherpa Dawa Thondup.Himalayan Journal 17, p.80Toni Hiebeler,Himalaja und Karakorum"]}, {"page": "List of Knights Grand Cross of the Order of the British Empire", "response": ["*1988: Kenneth Berrill, Christopher Collett, Taher al-Masri (honorary), Caspar Weinberger (honorary)"]}, {"page": "Central Policy Review Staff", "response": ["It had four directors over its 12-year lifetime; Lord Rothschild (1971–1974), Sir Kenneth Berrill (1974–1980), Sir Robin Ibbs (1980–1982) and John Sparrow (1982–1983).", "The concept of the review was initiated by the CPRS in late 1975 and was taken up by the Foreign Secretary, James Callaghan, who asked for the review to be extended to the BBC and the British Council. Callaghan also asked the CPRS to undertake the review. However, according to Joe Haines (Press Secretary to Prime Minister Harold Wilson) even before the proposals were shown to Callaghan the Foreign Office intervened: \"the document he eventually saw, and approved, was modified – or doctored – on the way to his desk. The original proposals were not acceptable to senior F.C.O. officials, and the head of the C.P.R.S., Sir Kenneth Berrill, was asked to make deletions before it was put to the Secretary of State. That was agreed. The document placed before Jim Callaghan was not the original one.\"Joe Haines (1977) The Politics of Power  p37"]}, {"page": "1988 Birthday Honours", "response": ["*Sir Kenneth Berrill, K.C.B., lately Chairman, Securities and Investments Board."]}, {"page": "Berrill", "response": ["*Sir Kenneth Berrill (1920–2009), English economist and public servant."]}, {"page": "Vickers, da Costa", "response": ["Sir Kenneth Berrill, the former head of the Think Tank, succeeded him as chairman in 1981."]}, {"page": "Kenneth Ernest Berrill", "response": ["#REDIRECT Kenneth Berrill"]}]}}