{"wiki_id": "http://www.wikidata.org/entity/Q6384088", "itemLabel": "Keith Bowen", "itemDescription": "Welsh footballer (born 1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Bowen", "wikipedia_page": {"main": "Keith Bryn Bowen (born 26 February 1958) is an English retired professional footballer who made over 230 appearances as a forward in the Football League for Colchester United, Northampton Town and Brentford.", "link_mentions": [{"page": "Bowen (surname)", "response": ["* Keith Bowen (born 1958), English footballer"]}, {"page": "List of Northampton Town F.C. seasons", "response": ["|align=left| Keith Bowen || 12"]}, {"page": "1985–86 Colchester United F.C. season", "response": ["Lea struggled to find a strike partner for Tony Adcock following a car crash that ended Keith Bowen's playing career. The side were otherwise free scoring, and despite a good record, Lea was sacked three weeks ahead of the end of the campaign and replaced by Reserve team coach Mike Walker. Walker, initially in a caretaker capacity, took the U's on an unbeaten run for their final eight games of the season, winning five. This left the club in sixth position in the table, nine points shy of promotion.", "|Keith Bowen", "|align=\"left\"|Keith Bowen", "|align=\"left\"|Keith Bowen"]}, {"page": "1984–85 Colchester United F.C. season", "response": ["|Keith Bowen||FW|||| Northampton||||68||22|| Brentford||25 March 1983||£10,000", "|align=\"left\"|Keith Bowen", "|align=\"left\"|Keith Bowen"]}, {"page": "1983–84 Colchester United F.C. season", "response": ["|Keith Bowen||FW|||| Northampton||||13||4|| Brentford||25 March 1983||£10,000", "|align=\"left\"|Keith Bowen"]}, {"page": "1982–83 Colchester United F.C. season", "response": ["|Keith Bowen||FW|||| Northampton||||0||0|| Brentford||25 March 1983||£10,000", "|Keith Bowen", "|Keith Bowen", "|align=\"left\"|Keith Bowen", "|Keith Bowen", "|Keith Bowen"]}, {"page": "History of Colchester United F.C.", "response": ["Topping the table in October 1985, the U's imploded, suffering six successive League defeats, four without scoring. Lea couldn't find a strike partner for Adcock following Keith Bowen's career-ending car crash. The manager had a good record and produced a free-scoring side but could not get the club over the promotion finishing line and three weeks from the end of the season he was sacked."]}, {"page": "Craig Oldfield", "response": ["Born in Warley, Oldfield was signed to Colchester United from Stowmarket Town at the beginning of the 1982–83 season. In the opening game of the season between Colchester reserves and Stowmarket, Oldfield was listed in the match programme for both teams, playing and scoring for Stowmarket in a 1–1 draw at Layer Road before switching to Colchester on non-contract terms. He featured regularly in the U's reserves but was unable to force his way into the first-team picture, with the club already possessing a number of attacking players, including Tony Adcock, Keith Bowen, Perry Groves and Ian Allinson. He went on to eventually make his debut on 3 September 1983 in a 2–1 win at Layer Road over Blackpool, coming on as a substitute for Groves. He made three league appearances for the club, all from the substitutes bench. He played his last game for the club on 21 February 1984 in a 2–1 Associate Members Cup win against Wimbledon, on this occasion coming on for Les Mutrie."]}, {"page": "1981–82 Brentford F.C. season", "response": ["Despite going unbeaten in the first four Third Division matches of the season, a bad run of results in September and October 1981 dropped the club to just above the relegation places. Manager Callaghan acted swiftly in the transfer market, signing midfielders Stan Bowles, Chris Kamara and finally bolstering the forward line with the acquisition of Keith Bowen. The upturn in form was immediate and seven wins and one draw from a 10-match spell lifted the Bees from 18th place on 17 October to 4th on 28 December. The run included five consecutive away league wins, which equalled the club record.", "|Keith Bowen", "| style=\"text-align:left;\" |Keith Bowen", "| style=\"text-align:left;\" |Keith Bowen", "|Top scorer (league) ||8, Keith Bowen, Gary Johnson, Gary Roberts", "|Top scorer (all competitions) ||10, Keith Bowen", "| Keith Bowen"]}, {"page": "1982–83 Brentford F.C. season", "response": ["|Keith Bowen", "| style=\"text-align:left;\" |Keith Bowen", "| style=\"text-align:left;\" |Keith Bowen", "| Keith Bowen", "| Keith Bowen"]}, {"page": "1976–77 Northampton Town F.C. season", "response": ["|Keith Bowen||FW||||Northampton||||1||0||Apprentice||Summer 1976||N/A", "| FW || style=\"text-align:left;\" |  Keith Bowen"]}]}}