{"wiki_id": "http://www.wikidata.org/entity/Q6387289", "itemLabel": "Ken Barrie", "itemDescription": "British actor and musician (1943-2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_Barrie", "wikipedia_page": {"main": "Leslie Hulme (9 January 1933 – 29 July 2016), known professionally as Ken Barrie, was an English voice actor and singer best known for singing the theme tune of the BBC television programmes Hi-de-Hi!, Postman Pat and Charlie Chalk; He also narrated the latter two. He was also known for providing the voices of several of the series' characters.\n\n", "link_mentions": [{"page": "Postman Pat", "response": ["In the first series Ken Barrie voiced all the characters and narrated the series. In Series 2 Carole Boyd joined to voice all the female characters and child characters except Granny Dryden who was still voiced by Barrie. In Series 3 Kulvinder Ghir, Janet James, and Archie Panjabi joined to voice the new characters and the child characters while Boyd continued to voice the adult females, Charlie and Sarah, Melissa Sinden and Jimmy Hibbert also joined to perform the animal characters' vocal effects and Angela Griffin joined in Series 5 to voice a new character. In Series 6 Lewis MacLeod replaced Barrie as Pat. In Series 7 Barrie left completely and MacLeod, Bradley Clarkson, and Dan Milne took over the rest of Barrie's characters. Joe Trill joined in Series 8 to voice a new character.", "* Ken Barrie as Patrick \"Pat\" Clifton (series 1–5), Matt Clifton, Mrs. Goggins (series 1), Ted Glen (series 1–6), Alf Thompson (series 1–6), Dorothy Thompson (series 1), Bill Thompson (series 1), Reverend Peter Timms (series 1–6), Julia Pottage (series 1), Katy Pottage (series 1), Tom Pottage (series 1), PC Arthur Selby (series 2–6), Lucy Selby (series 1), Sylvia Gilbertson (series 1), Sarah Gilbertson (series 1), Jeff Pringle, Charlie Pringle (series 1), Rebecca Hubbard (series 1), Sam Waldron, Granny Dryden, Peter Fogg, Major Forbes, George Lancaster, Santa Claus, Train Inspector, Pumpkin Wrigglesworth, Narrator, Radio Greendale Speaker, John, George, Countdown Sequence Voice", "Music for the original 1981 series was by Bryan Daly, who wrote a number of songs including the well-known theme tune. For the 2003 series, pop writer Simon Woodgate scored the show and wrote new songs, including a new closing theme \"What's in His Bag?\". The theme tune \"Postman Pat &  His Black and White Cat\" was sung by Ken Barrie for the original series in the 1980s and '90s. An extended version of the tune was released as a single in the UK where it reached number 44 in the charts in July 1982.", "DVD releases of classic Postman Pat were limited in availability in various regions. In the UK, only one volume with three episodes from Series 2 was released by Universal Studios Home Video and Right Entertainment in 2004 under the title Postman Pat in a Muddle. The same year saw the entire original series released on DVD in Spain, featuring both English and Spanish audio options. Unfortunately, however, for Series 1, the original opening titles which featured Pat driving in the original version of his van with a crown logo (which Pat used until Pat's Thirsty Day) was replaced with an edited version of the shot for shot remake of the original intro (which had Pat driving the Royal Mail Van) as used when the show aired in countries like France and Australia. The edits made to the intro on the DVD involved some shots being replaced by scenes from Pat's Difficult Day, Pat Takes A Message and Pat's Foggy Day. This edited intro was also used when CBeebies reran the show. No further releases were seen in the UK until 2011 when Classic Media issued all four specials from 1991 to 1994 on the DVD Happy Birthday Postman Pat. On 3 February 2014, the first and second series were made available in their entirety for the first time in the UK, However the titles are both season 2 with the season 3 theme which came under scrutiny from classic fans and also credits Carole Boyd as doing voices in series 1, despite it being only Ken Barrie."]}, {"page": "Captain Scarlet and the Mysterons", "response": ["Two versions of the closing theme – \"Captain Scarlet\" – were recorded. The first version, used on the first 14 episodes, was mostly instrumental with the words \"Captain Scarlet!\" sung at intervals by a group of vocalists including Ken Barrie; each instance was followed by vocoded repetition supplied by Gray himself.Bentley 2017, p. 99. It was later reworked as a song with lyrics performed by The Spectrum, a London boy band who happened to share their name with the fictional Spectrum Organisation. Originally formed in 1960, at the time of their involvement with Captain Scarlet the group were signed to RCA Victor and being promoted as an English imitation of The Monkees.Archer and Hearn, p. 157. They were brought to the Andersons' attention by Gerry's chauffeur, who had heard them on pirate radio, and signed a contract with Century 21 worth £100,000.Bentley 2017, p. 102."]}, {"page": "1933 in film", "response": ["**Ken Barrie, English voice actor and singer (d. 2016)"]}, {"page": "Barry Gray", "response": ["*Space Age Nursery Rhymes (Mini-EP, Century 21. Comical updates of nursery rhymes sung by Ken Barrie and Eula Parker; \"Three Refined Mice\" sung by Gray.)"]}, {"page": "My Family and Other Animals", "response": ["In 1987, the book was made into a ten-part BBC television series, My Family and Other Animals, written by Charles Wood and directed by Peter Barber-Fleming. It starred Hannah Gordon as Louisa Durrell and Brian Blessed as Spiro Amerikanos, with Darren Redmayne playing the young Gerry. Nigel Marven of the Natural History Unit, Bristol was responsible for the animals side of the production; Denis McKeown, then PhD student in Psychology University of Sussex, did the training of the famous pigeon Quasimodo in the series. The whistling for the theme tune was provided by Ken Barrie, who was the original voice of the children's television character Postman Pat."]}, {"page": "Peter Kay", "response": ["In 2007, Kay followed up the success of \"(Is This the Way to) Amarillo\" with a cover version of \"I'm Gonna Be (500 Miles)\", originally by the Proclaimers, also for Comic Relief. In 2009, Kay released \"The Official BBC Children in Need Medley\", an animation featuring over 100 characters including Thomas the Tank Engine, Bob the Builder and Paddington Bear. It also featured some of the characters' original voice artists including Bernard Cribbins, Neil Morrissey, Ken Barrie and Ringo Starr. The video was premiered on BBC1 on 20 November 2009."]}, {"page": "Hi-de-Hi!", "response": ["Hi-de-Hi! had a rock and roll style theme tune called \"Holiday Rock\". Sung by Ken Barrie, who would later provide the voice of Postman Pat, on the series opening titles,Ken Barrie: Postman Pat voice actor dies, BBC News, 29 July 2016 the song was later released as a single with the main vocal part sung by Paul Shane and the Yellowcoats (it featured several members of the cast on backing vocals).Hi-De-Hi (Holiday Rock), BBC Music It became a UK Top 40 hit in May 1981 and Shane and members of the cast performed the song on Top of the Pops that month."]}, {"page": "Peter Sallis", "response": ["Sallis also narrated a few stories of the children's television series Postman Pat for audio cassettes when the original voice actor Ken Barrie wasn't available at the time and also voiced Hugo in the animated series Victor and Hugo: Bunglers in Crime (filling in for The Wind in the Willows co-star David Jason who was the usual voice of Hugo, although Jason's voice of Hugo can still be heard in the opening and closing theme songs) for audio cassettes as well."]}, {"page": "Embassy Records", "response": ["Mike Redway, who had been a singer with the Oscar Rabin Band, recorded for Embassy under the pseudonym Redd Wayne, in addition to appearing on many of the Typhoons, Jaybirds and Starlings recordings for the label between 1962 and 1965. Redway later sang the vocal version of the \"Casino Royale Theme\" over the closing credits of the 1967 Casino Royale film. Ken Barrie, who later became the voice of Postman Pat, recorded for Embassy under the name of Les Carle."]}, {"page": "Tunstall, Staffordshire", "response": ["* Leslie Hulme, known as Ken Barrie (1933–2016) was the voice of Postman Pat"]}, {"page": "September 1981", "response": ["* A New Children’s TV Show About A Postman Who Delivers Mail Played By Ken Barrie And Created By John Cunliffe(Author) Postman Pat Was First Aired On BBC One And BBC Two It Shows On 15 September 1981"]}, {"page": "Charlie Chalk", "response": ["* Ken Barrie as Song vocals"]}, {"page": "Anita Kerr", "response": ["Kerr moved to Switzerland in 1970. Her recording sessions held in London, she launched the Anita Kerr Singers anew with UK talent: Anne Simmons, Ken Barrie (Postman Pat narrator & singer), and Danny Street. In 1971, the Singers recorded the LP A Tribute to Simon and Garfunkel. That same year, Kerr wrote original music and lyrics for the Ampex album A Christmas Story, and she felt privileged to conduct the Royal Philharmonic Orchestra during the recording sessions. Grob and Kerr bought Mountain Studios in Montreux, Switzerland.\"Anita Kerr\" – Billboard, April 28, 1979 They sold it, in 1979, to the rock band Queen."]}, {"page": "Carole Boyd", "response": ["Boyd trained at the Birmingham School of Speech and Drama, where she won the principal national prize for voice and in 1966 joined the Radio Drama Company by winning the Carleton Hobbs Bursary. She is primarily recognised for her work in television, with her portrayals of Hetty Wainthrop Investigates, Virtual Murder and Mrs Melly in Bodger and Badger among her appearances. Boyd has also performed multiple vocal roles for the BBC children's programme Postman Pat. Since 1991, she has voiced every woman and child in the franchise - including Sara Clifton, Dr Gilbertson, Mrs Goggins, Miss Hubbard, Mrs Pottage, Dorothy Thompson, Lucy Selby, Tom and Katy Pottage, Charlie Pringle, and Julian Clifton, among others (with the exception of Granny Dryden, who continued to be voiced by Ken Barrie prior to his death in 2016). In 2006, she played Esther Hartlieb in the film The Thief Lord."]}, {"page": "The Cham-Cham", "response": ["Filmed in late 1965, \"The Cham-Cham\" has a show business theme and was written in the style of classic Hollywood musicals. It features several innovations in APF's use of marionette puppets. One scene features the Penelope character performing a slow dance, which was a challenge to film due to the difficulty in moving Supermarionation puppets convincingly. \"The Cham-Cham\" is also the first episode of any Supermarionation series to show characters skiing. \"Dangerous Game\", the focus of the episode's soundtrack, was devised as a Latin rhythm by series composer Barry Gray. Singer Ken Barrie recorded a lyrical version but this is not heard in the finished episode.", "Composer Barry Gray devised \"Dangerous Game\" as a Latin rhythm. Originally all performances by the Cass Carnaby Five were to have been a lyrical version sung by Ken Barrie, but for the finished episode this was replaced with a variety of instrumental versions. Sylvia Anderson based her singing voice on that of Marlene Dietrich. The shots of Penelope and Tin-Tin skiing to Olsen's chalet are accompanied by an incidental track called \"Happy Flying\" that was originally composed for the Supercar episode \"Amazonian Adventure\"."]}, {"page": "Ricochet (Thunderbirds)", "response": ["Tunes played by KLA include the theme from the Thunderbirds Series One episode \"The Man from MI.5\" and an instrumental version of \"I've Got Something to Shout About\" from the Stingray episode \"Titan Goes Pop\". The closing scene is accompanied by the song \"Flying High\"; performed by Gary Miller with a group of backing vocalists that included Ken Barrie, this was intended to be the series' ending theme until it was replaced with \"The Thunderbirds March\" two weeks before the premiere of the first episode."]}, {"page": "Ken (given name)", "response": ["* Ken Barrie (born 1933 - 29th July 2016) Singer And The Voice Of The Children’s Character Postman Pat."]}, {"page": "List of television theme music", "response": ["*Hi-de-Hi! (\"Holiday Rock\") - composed by Jimmy Perry, performed by Ken Barrie"]}, {"page": "Lewis MacLeod (actor)", "response": ["He is currently the voice of Postman Pat, replacing Ken Barrie, who died in July 2016."]}, {"page": "Barrie (name)", "response": ["* Ken Barrie (1933–2016), professional name of Leslie Hulme, British voice actor, narrator of Postman Pat"]}, {"page": "List of recurring characters in Postman Pat", "response": ["* Alf Thompson (Series 1-present)— Farmer, working with his wife, Dorothy in his farm to make sure his sheep doesn't get into trouble. Voiced by Ken Barrie from Series 1-6 and Lewis MacLeod from Series 7-present. Darren Richardson voiced him in Postman Pat: The Movie", "*Bill Thompson (Series 1-present) — Black-haired ten-year-old schoolchild and the son of Alf and Dorothy.Voiced by Ken Barrie in Series 1, Carole Boyd in Series 2 and Kulvinder Ghir from Series 3-present. Steven Kynman voiced him in Postman Pat: The Movie  ", "*Charlie Pringle [Series 1-present) — Seven years old and very clever; loves science. In some ways he looks similar to Patrick, because he has a long nose and glasses. Voiced by Ken Barrie in Series 1 and Carole Boyd from Series 2-present.Charloe Woodward voiced him in Postman Pat: The Movie ", "*Constable Arthur Selby(Series 2-present) — The black-haired policeman with a moustache, he patrols in Greendale and Pencaster. The father of Lucy Selby. He is highly incompetent but still takes his business very seriously. Voiced by Ken Barrie from Seies 2-6 and Bradley Clarkson from Series 7-present.Enn Reitel voiced him in Postman Pat: The Movie ", "*Dorothy Thompson (Series 1-present)— A blonde farmer's wife, Dorothy runs Thompson Ground with Alf Thompson. Voiced by Ken Barrie in Series 1 and Carole Boyd from Series 2-present. Olivia Poulet voiced her in Postman Pat: The Movie ", "*George — Is a lazy man who lives in Greendale. In Postman Pat and the Robot, he most surprised to see Ted's robot postman come bursting through his front door, roll right through his house and back out through the back door.He is voiced by Ken Barrie ", "*George Lancaster (Series 1–2) — A farmer at Intake Farm. Voiced by Ken Barrie. Jacob Witkin voiced him in Postman Pat: The Movie ", "*Granny Dryden — (Series 1–2) Granny Dryden is a friendly old lady who lives in a cottage in the Greendale countryside. She is mildly infirm, hence her asking Pat to help her with assorted household jobs. She is also hard of hearing, begetting the need for Pat to talk loudly to her. She has many old belongings, many of which she has given to Pat and others. Voiced by Ken Barrie.", "*Jeff Pringle (Series 2–5) — School teacher and father of Charlie. Voiced by Ken Barrie", "*John is the weatherman for Radio Greendale. He is heard him giving out the weather forecast on Pat's radio in Postman Pat has the Best Village. Voiced by Ken Barrie.", "*Julia Pottage (Series 1–5) — Black-haired orchard farmer, mother of Katy and Tom. Voiced by Ken Barrie in Series 1 and Carole Bod in Series 2–5.", "*Katy Pottage — (Series 1–5) Blonde girl with twin brother Tom. Daughter of Julia Pottage. Voiced by Ken Barrie in Series 1, Carole Boyd in Series 2 and Archie Panjabi in Series 3,4 and 5.", "*Lucy Selby (Series 1-present) — Brunette schoolchild and the seven-year-old daughter of PC Selby. Voiced by Ken Barrie in Series 1, Carole Boyd in Series 2, Janet James from Series 2-present and Teresa Gallagher in Postman Pat: The Movie ", "*Major Forbes (Series 2, Postman Pat: The Movie) Major Forbes is an old, deerstalker and says things such as \"Eh what?\" \"Old chap” “Jolly Good Show!” and \"good man.\" He lives at Garner Hall and is a retired army major. He is voiced by Ken Barrie in Series 2 and Jacob Witkin in Postman Pat: The Movie", "*Matthew Clifton — Patrick's American cousin and Julian's uncle and since he hid the Greendale cup years ago when he was young. He came to Greendale to find it with the help from Pat, Meera and Julian in time for the Flower Show. Voiced by Ken Barrie", "*Mrs. Goggins (Series 1-present) — The village postmistress in Greendale, Mrs Goggins came to Greendale from Scotland and has a small West Highland Terrier, Bonnie. Voiced by Ken Barrie in Series 1, Carole Boyd in Series 2-present and Jane Carr in Postman Pat: The Movie", "*Narrator (Series 1–2) — The narrator of Series 1 & 2. Voiced by Ken Barrie. There was occasionally a second additional female narrator voiced by Carole Boyd during Series 2", "*Patrick Clifton (Series 1-present) — Postman, main character and primary protagonist; husband of Sara and father of Julian. He always manages to land himself in difficult and amusing situations, and is friends with almost everyone in Greendale and the surrounding countryside of whom he meets on his rounds. Voiced by Ken Barrie from Series 1–5, Lewis MacLeod from Series 6-present, Stephen Mangan and Ronan Keating in Postman Pat: The Movie. Bradley Clarkson has also voiced the character in various stage productions.", "*Peter Fogg (Series 1–2) — Peter is another farmer who works at Greendale Farm with the Pottages and lives with his wife Jenny. He plays the guitar and rides a motorcycle. He is voiced by Ken Barrie", "*Reverend Peter Timms (Series 1-present) — The white-haired local Vicar. He was voiced by Ken Barrie from Series 1-6 and Dan Milne from Series 6-present", "*Miss Rebecca Hubbard (Series 1–2) —  Miss Hubbard is a friend of Pat who also lives in a cottage in the countryside. She has her own bike and always likes to go to choir practice and organise events. She was voiced by Ken Barrie in Series 1, Carole Boyd in Series 2 and Jean Gilpin in Postman Pat: The Movie", "*Sam Waldron (Series 1-2) — Sam Waldron is the owner of a mobile shop. He is a good old friend of Pat; they once assisted each other by delivering together. Pat often picks up the odd pack of biscuits or cough medicine from the shop. He was voiced by Ken Barrie", "*Santa Claus (Series 3) — Helping Pat on his delivering letters and parcels before Christmas. He made a Brief cameo in Postman Pat: The Movie. He was voiced by Ken Barrie", "*Sarah Gilbertson (Series 1-present) — Brunette wide-haired schoolchild, daughter of Dr. Sylvia Gilbertson. She can be very bossy and full of herself, sometimes with explosive results, but is good friends with all the local children. Voiced by Ken Barrie in Series 1 and Carole Boyd p from Series 2-present ", "*Sylvia Gilbertson (Series 1-present) — Greendale's blonde Welsh doctor and mother of Sarah Gilbertson. PC Selby has a crush on her. Voiced by Ken Barrie in Series 1, Carole Boyd from Series 2-present and Anastasia Griffith in Postman Pat: The Movie ", "*Ted Glen (Series 1-present) The local handyman and can just about fix anything one would ever need to mend. Ted is something of an inventor and enjoys inventing strange contraptions; he mostly occupies himself with general pottering about in his workshop or fixing his ageing Land-Rover lorry (full-sized pick-up truck). He is Pat's best friend. He was voiced by Ken Barrie from Series 1–6, Bradley Clarkson from Series 7-present and Dan Hildebrand in  Postman Pat: The Movie  ", "*Tom Pottage — (Series 1–5) A timid blond boy and twin brother of Katy. He was voiced by Ken Barrie in Series 1, Carole Boyd in Series 2 and Kulvinder Ghir in Series 4,4 and 5."]}, {"page": "1981 in British television", "response": ["*16 September – Debut of a children's stop motion series about a rural postman with a black and white cat written and created by John Cunliffe and voiced and narrated by Ken Barrie, Postman Pat on BBC One. Episode 8 introduces a more authentic look to the Royal Mail and Post Office Ltd logos and more storybooks produced after 13 episodes being broadcast repeating on BBC1 and BBC2 make the programme (Postman Pat) more popular than usually expected to be (starting from Christmas 1981 along with Pigeon Street)."]}, {"page": "Sharks' Treasure", "response": ["The opening theme song \"Money, Money\" was written by Wilde (under the pseudonym Jefferson Pascal) and sung by British musician and voice of the much-loved children’s character Postman Pat, Ken Barrie."]}, {"page": "List of songs recorded by Blur", "response": ["| \"Postman Pat Theme\" || Starshaped || 1993 || Ken Barrie || Bryan Daly"]}, {"page": "Carle", "response": ["*Les Carle, the first stage name of English voice actor Ken Barrie (1933-2016)"]}, {"page": "Thunderbirds (TV series)", "response": ["The score was composed by Gray, who served as musical director for all of the Anderson productions up to the first series of Space: 1999. In response to Gerry Anderson's request that the main theme have a \"military feel\", Gray produced a brass-dominated piece titled \"The Thunderbirds March\", which was recorded in December 1964 at Olympic Studios in London. The end titles were originally to have been accompanied by \"Flying High\", a lyrical track sung by Gary Miller with backing by Ken Barrie. Ultimately, a variation of the march was used instead. Incidental music was recorded over nine months between March and December 1965. As most of the music budget was spent on the series' earlier episodes, later instalments drew heavily on APF's ever-expanding music library."]}, {"page": "List of people who performed on Beatles recordings", "response": ["*Ken Barrie—vocalist; session musician and member of the Mike Sammes Singers. Contributed vocals to \"Good Night\""]}, {"page": "List of British films of 2016", "response": ["| style=\"text-align:center;\" | 29 || Ken Barrie || style=\"text-align:center;\" | 83 || style=\"text-align:center;\" | English  || style=\"text-align:center;\" | Actor and singer || "]}, {"page": "Les Carle", "response": ["#redirect Ken Barrie"]}, {"page": "2016 in the United Kingdom", "response": ["*29 July – Ken Barrie, 83, voice actor (Postman Pat) and singer."]}, {"page": "2016 in British television", "response": ["|Ken Barrie"]}, {"page": "2016 in British music", "response": ["*29 July – Ken Barrie, voice actor and singer, 83"]}, {"page": "Deaths in July 2016", "response": ["*Ken Barrie, 83, British voice actor (Postman Pat) and singer, liver cancer.Postman Pat voice actor Ken Barrie dies"]}, {"page": "Leslie Hulme", "response": ["#REDIRECT Ken Barrie"]}]}}