{"wiki_id": "http://www.wikidata.org/entity/Q6384015", "itemLabel": "Keith Ball", "itemDescription": "Footballer (born 1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Ball", "wikipedia_page": {"main": "Keith Ball (born 26 October 1940) is an English former footballer. He was a short but agile goalkeeper who made 145 league and cup appearances for Port Vale and enjoyed three spells with Walsall. He also played non-league football for Worcester City, Stourport, Darlaston, Nuneaton Borough, and Kidderminster Harriers. He was a squad player as Walsall won back-to-back promotions in 1959–60 and 1960–61, and was an ever-present for Port Vale as they won promotion out of the Fourth Division in 1968–69.", "link_mentions": [{"page": "Gordon Lee (footballer)", "response": ["The club were a poor outfit Fourth Division when he took charge, and to boost the squad he signed 'tenacious' wing-half John King and Wales international winger Graham Williams from Tranmere Rovers, as well as Walsall's teenage Bobby Gough. With goalkeeper Stuart Sharratt out injured, he brought in Geoff Hickson on loan from Crewe Alexandra. Despite inconsistent results, fans threw their support behind Lee after witnessing consistent improvements in the Vale's performances. He solved his goalkeeping problems by signing Keith Ball from Walsall for 'a small fee', and his side put together a five-game unbeaten run in November. He adopted a more 'hit and run' style in March, and his side ended the campaign in 13th place with 46 points from their 46 games, scoring 46 and conceding 46 goals.", "He did not retain the services of four players for the 1972–73 season: Mick Morris, Keith Ball, Stuart Sharratt, and John Flowers. Lee made some key signings however, bringing in Stafford Rangers goal-machine Ray Williams for £3,000, midfielder Freddie Goodwin (Southport), 'controversial' goalkeeper Alan Boswell (Bolton Wanderers), young midfielder Colin Tartt, and trialist goalkeeper Reg Edwards (Nuneaton Borough). Six wins were gained from the opening eight league games, though low attendances caused Lee to remark that \"the people here are not genuinely interested in league football\". Offered the management position at Shrewsbury Town, he rejected the offer as he believed the club \"lacked potential\" and that he had a \"feeling of loyalty towards the [Vale] players\". In mid-season he sold John James to Chester for £5,000, Ray Harford to Colchester United for £1,750, and Keith Lindsey to Gillingham for £750, whilst spending £2,250 to bring 'pacey' striker John Woodward in from Walsall. Lee's team was criticized for foul play, particularly on 10 March, when Blackburn Rovers manager Ken Furphy branded them \"a brutal and physical side\". In the FA Cup, West Ham United manager Ron Greenwood claimed that the Vale players attempted \"the most blatant calculated intimidation I have ever seen anywhere in the world\". Vale finished in sixth spot with 53 points, four short of promoted Notts County. The 69 goals conceded tally was higher than that of all but the bottom two clubs."]}, {"page": "Clint Boulton", "response": ["Boulton was born in Stoke-on-Trent and began his career as an apprentice with local Football League club Port Vale in July 1963. He chose to begin his career at Vale rather than Potteries derby rivals Stoke City as he reasoned he had a better chance of breaking into the first team for the lower ranked Vale. He made his debut on Boxing day 1964, in a 3–0 defeat to Hull City at Vale Park, having been tasked with marking Ken Wagstaff. At the age of 16 years and 354 days, he became the youngest player in the club's history. He played five games of the 1964–65 season, as the \"Valiants\" were relegated out of the Third Division under Jackie Mudie. Boulton scored on the last day of the season, in a 2–1 home win over Walsall. This made him the youngest goalscorer in the club's history. He turned professional in August 1965 at the age of 17, and made 20 appearances in 1965–66. He became a mainstay of the defence by 1966–67, featuring 39 times, scoring three goals. He played 42 games under Stanley Matthews, however he \"gave away two needless penalties\" in a defeat to Portsmouth at Fratton Park in the FA Cup, and The FA also charged the club with paying Boulton and Gordon Logan illegal bonuses. Matthews made him club captain at the age of 18. He remained at the club under new boss Gordon Lee, and made 46 appearances in 1968–69. He was then an ever-present in the 52 game 1969–70 season, also scoring six goals, as Vale were promoted out of the Fourth Division after securing a fourth-place finish; he played consistently alongside defenders Ron Wilson and Roy Sproson, and goalkeeper Keith Ball. He played 47 games in 1970–71, scoring two goals. Sixteen games into the 1971–72 season, in November 1971, he was sold on to Torquay United for a fee of £10,000. He played a total of 267 games for Port Vale in all competitions, scoring 12 times."]}, {"page": "Ron Wilson (footballer, born 1941)", "response": ["The club won promotion in fourth place in the 1969–70 season, with Wilson playing fifty games in an extremely consistent defence along with Sproson, Clint Boulton, and goalkeeper Keith Ball. Wilson opened the 1970–71 campaign by scoring the first goal of a 2–0 win over Swansea City at Vetch Field. He made a further sixteen appearances before December 1970, when he emigrated to South Africa due to his son's ill health."]}, {"page": "History of Port Vale F.C.", "response": ["Long serving players Mick Morris and Keith Ball were released, as was John Flowers. Numerous new signings were made for 1972–73, most notable Ray Williams. After a 7–0 thrashing by Rotherham United – blamed largely on Alan Boswell, the side went on a run of five wins. Lee continued to bemoan the fans, saying 'the people here are not genuinely interested in league football', though he turned down a job offer at Shrewsbury Town out 'of loyalty to the players'. Vale went out of the FA Cup 1–0 to West Ham United in the third round, Ron Greenwood claimed 'we were lucky to come out alive' after Vale gave a physical display, though Lee defended his players 'enthusiasm'. What was indefensible however was the violence of a minority of supporters, leaving two Londoners nursing stab wounds. In January John James went to Chester for £5,000. They finished the season in sixth, four points away from promotion."]}, {"page": "Stuart Sharratt", "response": ["Stuart played for Ball Haye Green, Padgate Teacher Training College, West Bromwich Albion, Nantwich Town and Oswestry Town, before joining Jackie Mudie's Port Vale for £2,000 in March 1966. He was favoured ahead of the ageing Jimmy O'Neill and the inexperienced David Ikin, and played 15 Fourth Division games at the end of the 1965–66 season. He played 49 of the club's 50 games in the 1966–67 campaign, beating off competition from young hopeful Billy McNulty. Sharrat was an ever-present during the 49 game 1967–68 season. In March 1968, manager Stanley Matthews arranged a £15,000 transfer to Huddersfield Town, however Sharratt refused the move. However injury struck on 14 August 1968 as he cracked a kneecap in a 2–0 defeat at Wrexham in the first round of the League Cup, later contracting a virus in his blood. Upon his recovery he became a part-time player and barely got a game, though he did play instead of Keith Ball in 18 Third Division games in the 1970–71 season, and went on to feature 18 times in the 1971–72 season. His contract was terminated by manager Gordon Lee in May 1972 because he was unable to get release from his work as a college lecturer to play in a testimonial game. He appealed and the club were forced by the Football League to honour his contract to 30 June 1972."]}, {"page": "1968–69 Port Vale F.C. season", "response": ["The season opened with four Roy Chapman goals in four games, though only three points were won in the first six encounters. With Sharratt out injured, in came 'part-time, pipe-smoking civil servant' Geoff Hickson on loan from Crewe Alexandra. Lee quickly earned the respect of the Vale fans despite his team lying bottom of the table in mid-September. A new club mascot was unveiled at this time – 'Prince Val'. Some good home performances lifted the club off the bottom of the table, including a 4–1 thumping of Scunthorpe United and a stylish back-heeled goal from Roy Sproson in a 1–1 draw with Lincoln City. Chapman then developed sciatica and had to be rested until December. An excellent defence helped the club then to achieve a five-game unbeaten run in the league. In November, goalkeeper Keith Ball was signed from Walsall for 'a small fee' and Graham Newton joined on trial after leaving the Atlanta Chiefs. On Boxing day, Vale travelled to Sincil Bank, where they beat second-placed Lincoln 1–0 in front of 12,208 spectators. Soon after Bill Asprey retired as a player to coach at Sheffield Wednesday.", "|align=\"left\"|GK||align=\"left\"| Keith Ball", "| November 1968 || GK ||  || Keith Ball || Walsall || 'small' || "]}, {"page": "1969–70 Port Vale F.C. season", "response": ["|align=\"left\"|GK||align=\"left\"| Keith Ball"]}, {"page": "1970–71 Port Vale F.C. season", "response": ["|align=\"left\"|GK||align=\"left\"| Keith Ball"]}, {"page": "1971–72 Port Vale F.C. season", "response": ["On the financial side, a drop in average home attendance of over a thousand failed to prevent a profit of £596. This profit was due to a £10,000 transfer credit and £13,967 worth of donations from the Sportsmen's Association and the Development Fund. The club's total debt stood at £100,130. Four players were let go at the end of the campaign: Mick Morris (Stafford Rangers), Keith Ball (Stourport), Stuart Sharratt (retired), and John Flowers (Eastwood). Sproson also retired as a player, but stayed on as a scout and coach.", "|align=\"left\"|GK||align=\"left\"| Keith Ball", "| May 1972 || GK ||  || Keith Ball || Stourport || Free transfer || "]}, {"page": "Keith Martin Ball", "response": ["Keith Ball's research is in the fields of functional analysis, high-dimensional and discrete geometry and information theory. He is the author of Strange Curves, Counting Rabbits, & Other Mathematical Explorations."]}]}}