{"wiki_id": "http://www.wikidata.org/entity/Q6388351", "itemLabel": "Ken Reid", "itemDescription": "Comic creator (1919-1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_Reid_(comics)", "wikipedia_page": {"main": "Ken Reid (1919–1987) was a British comic artist and writer, best known as the co-creator of Roger the Dodger and Jonah for The Beano and Faceache for Jet (later appeared in Buster).", "link_mentions": [{"page": "Roger the Dodger", "response": ["Ken Reid was recommended to DC Thomson by his brother-in-law Bill Holroyd, who illustrated for The Beano. Reid travelled to Dundee and was first tasked to design comic strip panels for a new character: a boy who did anything to evade responsibilities and favours.", "Unlike most Beano characters, Dawson does not intentionally cause chaos and mayhem, despite his attempts at dodging responsibilities and punishments often creating it. Ken Reid's early stories frequently had Dawson get caught by his family members, that do not hesitate with the cruelty of their vengeance. Reid's final panels would show Dawson being forced to do his chore (or clean up after his antics create more damage than intended) as a family member (usually his father) supervises with a smirk.", "He first appeared in issue 561, dated 18 April 1953. His appearance is vaguely similar to that of Dennis the Menace from the same magazine: he wears a black-and-red chequered jumper and black trousers, but takes better care of his hair than his equally mischievous counterpart. He also used to have a white tie, but it seems to have disappeared. Originally drawn by Ken Reid, Gordon Bell took over in 1959, but Roger dodged his way out of the Beano in 1960. He returned, drawn by Bob McGrath, in April 1961. Ken Reid was re-commissioned to draw the strip in 1962, and Robert Nixon when Reid left D. C. Thomson & Co. in 1964. When Nixon left in 1973, Tom Lavery began drawing the strip, who was then followed by Frank McDiarmid in 1976.", "18 April 1953: Roger The Dodger made his debut in issue 561, drawn by Ken Reid."]}, {"page": "Grandpa (comics)", "response": ["Grandpa was a British comic strip which originally appeared in the magazine The Beano from 1955 to 1957, drawn by Ken Reid. It was later revived from 1971 until 1984, but this time by Robert Nixon and afterwards Jimmy Glen.", "Grandpa was first published in issue 680, illustrated by Ken Reid.  It was a gag-a-day comic about a mischievous old bearded man. "]}]}}