{"wiki_id": "http://www.wikidata.org/entity/Q6387445", "itemLabel": "Ken Chisholm", "itemDescription": "Scottish footballer and manager (1925-1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_Chisholm", "wikipedia_page": {"main": "Kenneth McTaggart Chisholm (12 April 1925 – 30 April 1990) was a Scottish footballer, who played for a number of teams in The Football League and the Scottish Football League as a forward.", "link_mentions": [{"page": "Glentoran F.C.", "response": ["* Ken Chisholm (1958)"]}, {"page": "1949 FA Cup Final", "response": ["| ||10|| Ken Chisholm"]}, {"page": "Wilf Grant", "response": ["He spent two further seasons with Cardiff in the First Division where, jointly with Ken Chisholm, he was again top scorer in 1953–54 with 12 goals as Cardiff reached tenth place in the league table. After four and a half seasons at Cardiff City, Grant was sold to Ipswich Town in October 1954 for a fee of £7,500. In his career at Cardiff, Grant made a total of 159 league and FA Cup appearances scoring 67 goals."]}, {"page": "History of Coventry City F.C.", "response": ["The 1949–50 season started very badly for Coventry, with just one win in the first twelve games and conceding large numbers of goals. The signing of defender Martin McDonnell led to a temporary improvement, but another poor run in the new year left the club facing relegation. Once again, the club had to spend their way out of danger; the signing of Bryn Allen and Ken Chisholm inspired a successful last eight games and a mid-table finish. By contrast, the following season started very well and the club were top of Division Two table at Christmas. They made several expensive signings, including full-back Terry Springthorpe and striker Tommy Briggs, but these players had no impact at the club and a run of poor performance in the new year ended their promotion hopes. Despite a reasonable start to the 1951–52 season, this poor form resumed from September as an ageing City team – the average was 31 years – faced almost certain relegation by February. Despite several signings, the club were relegated back to Division Three South with a final-day defeat at Leeds United."]}, {"page": "List of Sunderland A.F.C. seasons", "response": ["|align=left|Ken Chisholm"]}, {"page": "List of Coventry City F.C. seasons", "response": ["|align=left| Ken Chisholm"]}, {"page": "Chisholm (surname)", "response": ["* Ken Chisholm (1925–1990), Scottish footballer"]}, {"page": "Hugh Kelly (footballer, born 1919)", "response": ["By the end of the season, Kelly had fallen out of favour with the Southampton manager, Sid Cann, following disciplinary problems after a match at Leicester in April 1951. After the match, the team stayed in the Midlands to play a friendly match at Boston. Kelly returned to the team hotel with Ken Chisholm of Coventry City and two young ladies. When the Southampton trainer, Jimmy Easson, tried to get the ladies to leave, he and Kelly had an argument which culminated in Kelly giving the trainer a black eye. As a result, Kelly was immediately placed on the transfer-list, with John Christie taking over from him in goal for the last two matches of the season. By now completely out of favour, Kelly was fifth choice 'keeper behind Fred Kiernan, Christie, Len Stansbridge and Eddie Thomas and was unable even to get a match in the reserves, spending the whole of 1951–52 on the sidelines, with some time back in Ireland."]}, {"page": "Jimmy Easson", "response": ["In 1951, he took up a coaching position at local rivals, Southampton, where he remained until February 1953. In April 1951, Easson was involved in an altercation with Southampton's Irish international goalkeeper, Hugh Kelly after a defeat at Leicester City. After the match, the team stayed in the Midlands to play a friendly match at Boston. Kelly returned to the team hotel with Ken Chisholm of Coventry City and two young ladies. When Easson tried to get the ladies to leave, he and Kelly had an argument which culminated in Kelly giving the trainer a black eye. As a result, Kelly was immediately placed on the transfer-list and never played for the \"Saints\" again."]}]}}