{"wiki_id": "http://www.wikidata.org/entity/Q6387389", "itemLabel": "Ken Brown", "itemDescription": "British guitarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_Brown_(musician)", "wikipedia_page": {"main": "Kenneth Brown (born 20 August 1940, Enfield, Middlesex – c. 9 June 2010, Essex) was a British guitarist with The Quarrymen, a precursor to The Beatles.", "link_mentions": [{"page": "June 9", "response": ["*2010 – Ken Brown, British Guitarist who was a member of The Quarrymen (born 1940)"]}, {"page": "Pete Best", "response": ["Best's family lived for a short time at the family home, \"Ellerslie\" in West Derby, until Best's mother fell out with her sister-in-law, Edna, who resented her brother's choice of wife. The family then moved to a small flat on Cases Street, Liverpool, but Mona Best was always looking for a large house—as she had been used to in India—instead of one of the smaller semi-detached houses prevalent in the area. After moving to 17 Queenscourt Road in 1948 where the Bests lived for nine years, Rory Best saw a large Victorian house for sale at 8 Hayman's Green in 1957 and told Mona about it.17 Queenscourt Road , beatlestours.co.uk – Retrieved 1 December 2007 The Best family claim that Mona then pawned all her jewellery to place a bet on Never Say Die, a horse that was ridden by Lester Piggott in the 1954 Epsom Derby; it won at 33–1 and she used her winnings to buy the house in 1957. The house had previously been owned by the West Derby Conservative Club and was unlike many other family houses in Liverpool as the house (built around 1860) was set back from the road and had 15 bedrooms and an acre of land. All the rooms were painted dark green or brown and the garden was totally overgrown.Photos of The Casbah Club at SamLeach.com. Retrieved 10 October 2007   Mona later opened The Casbah Coffee Club in its large cellar. The idea for the club first came from Best, as he asked his mother for somewhere his friends could meet and listen to the popular music of the day. As The Quarrymen, John Lennon, Paul McCartney, George Harrison, and Ken Brown played at the club after helping Mona to finish painting the walls.Anthology Zero: The Beatles at their Best YouTube.", "Best passed the eleven plus exam at Blackmoor Park primary school in West Derby, and was studying at the Liverpool Collegiate Grammar School in Shaw Street when he decided he wanted to be in a music group. Mona bought him a drum kit from Blackler's music store and Best formed his own band, the Black Jacks. Chas Newby and Bill Barlow joined the group, as did Ken Brown, but only after he had left the Quarrymen. The Black Jacks later became the resident group at the Casbah, after the Quarrymen cancelled their residency because of an argument about money.Lennon, Cynthia. John, 2006, p.44."]}, {"page": "The Quarrymen", "response": ["In the summer of 1959, Mona Best decided to open a club in her cellar, and offered the Les Stewart Quartet a residency if they would help convert the cellar. Harrison and fellow Quartet guitarist Ken Brown, however, missed a show, causing Les Stewart to fire the two and drop the residency. This caused distress to Best, but Harrison offered a solution: he recruited Lennon and McCartney to play, and they returned to calling themselves the Quarrymen. After helping Best finish converting the cellar, the new four guitarist line-up of the Quarrymen (Lennon, McCartney, Harrison, and Brown) opened the Casbah Coffee Club on 29 August 1959. The opening night performance was attended by about 300 local teenagers, but as the cellar had no air conditioning and people were dancing, the temperature rose until it became hard to breathe. The Quarrymen were afforded the use of Brown's three input amplifier (which, along with McCartney's Elpico, meant that all four guitarists were electric), and sang through one microphone connected to the club's small PA system.", "* Ken Brown – guitar (1959–60; died 2010)", "  bar:Ken    text:\"Ken Brown †\""]}, {"page": "Ken Brown", "response": ["Ken Brown or Kenny Brown may refer to:", "*Ken Brown (filmmaker) (born 1944), American filmmaker, photographer, cartoonist, and designer", "*Ken Brown (footballer) (born 1934), England and West Ham United football player, later Norwich City manager", "*Ken Brown (golfer) (born 1957), Scottish golfer and BBC golf broadcaster", "*Ken Brown (ice hockey) (born 1948), Canadian ice hockey player", "*Ken Brown (musician) (1940–2010), English guitarist for The Quarrymen", "*Ken Brown (linebacker) (born 1971), American football player", "*Ken Brown (wide receiver) (born 1965), American football player", "*Ken Brown (running back) (1945–2001), American football running back", "*Ken Brown (offensive lineman) (born 1954), American football offensive lineman", "*Ken Brown (basketball) (born 1989), American basketball player", "*Bundy K. Brown, also known as Ken Brown, American multi-instrumentalist and founding member of Tortoise"]}, {"page": "List of members of bands featuring members of the Beatles", "response": ["* Ken Brown – rhythm guitar", "* Ken Brown – rhythm guitar", "* Ken Brown – guitar", "  bar:Ken    text:\"Ken Brown\""]}, {"page": "Casbah Coffee Club", "response": ["The Quarrymen—John Lennon, Paul McCartney, George Harrison, and Ken Brown—went to the club to arrange their first booking, to which Mona agreed, but said she needed to finish painting the club first. All four took up brushes and helped Mona to finish painting the walls with spiders, dragons, rainbows and stars. In addition to the four boys' artistic contributions, Cynthia Powell, later to become Cynthia Lennon, painted a silhouette of John on the wall, which can still be seen today. The group often played at the Casbah as other venues, like The Cavern Club, had a jazz-only policy at that time. The cellar—with its original decoration—still exists.", "Mona came up with the idea of the club after watching a TV report about The 2i's Coffee Bar in London's Soho, where several singers had been discovered. She decided to open the club, which was located in her cellar, on 29 August 1959, for her sons, their friends and young people to meet and listen to the popular music of the day, unlike The Cavern Club, which had a jazz-only policy at that time. Mona charged half a crown annually for membership—to \"keep out the rough elements\"—and served soft drinks, snacks, cakes, and coffee from an espresso machine, which no other club had at that time. Records were played on a small Dansette record player, which amplified them through a 3\" speaker. Mona had booked the Les Stewart Quartet to play the opening night with Harrison on guitar, but they cancelled the booking after Stewart and Ken Brown had a quarrel. Stewart was angry that Brown had missed a rehearsal, because Brown was helping Mona to decorate the club. As 300 membership cards had already been sold, Harrison said that he had two friends in a band called The Quarrymen who would play instead. Lennon, McCartney and Harrison went to the club to arrange the booking, to which Mona agreed, but said she needed to finish painting the club first. All four took up brushes and helped Mona to finish painting the walls with spiders, dragons, rainbows and stars, but as Lennon was short-sighted, he mistook gloss for emulsion paint, which took a long time to dry in the dark, damp cellar. Cynthia Powell, later the wife of Lennon, painted a silhouette of him on the wall, which is also still there.", "Pete Best was studying at the Collegiate Grammar School when he decided he wanted to be in a music group, so Mona bought him a drum kit from Blacklers music store and Best formed his own band; The Black Jacks, who later played in the Casbah. Chas Newby joined the group, as did Ken Brown, but only after he had left The Quarrymen. The reason for Brown's exit from the group was that he turned up on the seventh Saturday night of The Quarrymen residency at the Casbah with the flu, so Mona ordered him upstairs to the Best's living room to rest. This caused a massive quarrel with the rest of the group when Mona came to pay them, as they wanted Brown's money to be shared amongst the three of them, as Brown had not played. Mona refused, so The Quarrymen angrily cancelled their residency and stormed out."]}, {"page": "Deaths in June 2010", "response": ["*Ken Brown, 70, British guitarist (The Quarrymen)."]}]}}