{"wiki_id": "http://www.wikidata.org/entity/Q6384444", "itemLabel": "Keith Hampshire", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Hampshire", "wikipedia_page": {"main": "Keith Hampshire (born 23 November 1945) is an English-born popular singer of the 1970s. He recorded three songs which were top ten hits in Canada, and hosted the CBC Television show Keith Hampshire's Music Machine.  His voice has been compared to David Clayton-Thomas. In the United States his highest charting single,\"Daytime Night-time\", reached No. 51 on Hot 100.", "link_mentions": [{"page": "Toronto Blue Jays", "response": ["During the seventh-inning stretch of home games, before singing \"Take Me Out to the Ball Game\", Blue Jay fans sing and clap to \"OK Blue Jays\" by Keith Hampshire and The Bat Boys, which was released in 1983. The song was remixed in 2003, and since then, the new, shortened version is played at home games."]}, {"page": "Cat Stevens", "response": ["His December 1967 album New Masters failed to chart in the United Kingdom. The album is now most notable for his song \"The First Cut Is the Deepest\", a song he sold for £30 () to P. P. Arnold that became a massive hit for her and an international hit for Keith Hampshire, Rod Stewart, James Morrison, and Sheryl Crow. Forty years after he recorded the first demo of the song, it earned him back-to-back ASCAP \"Songwriter of the Year\" awards, in 2005 and 2006."]}, {"page": "Klaatu (band)", "response": ["The band, initially a studio-only duo of Woloschuk and Long, released the singles \"Anus of Uranus/Sub-Rosa Subway\" and \"Dr. Marvello/For You Girl\" on GRT Records, in 1973, before being taken under the wing of Daffodil Records and its president Frank Davies. With Terry Draper added to the line-up, the singles \"California Jam\" and \"True Life Hero\" followed. These early singles credited Dee Long as a writer of several tunes; the others (including \"Sub-Rosa Subway\", \"Dr. Marvello\" and the hit single \"California Jam\") were credited to \"Chip Dale,\" a collective pseudonym for Woloschuk and frequent co-writer Dino Tome. \"California Jam\" hit the Canadian Top 40, peaking at No. 36, and Klaatu, though they played no live dates, promoted their music by making a television appearance in Canada on the Keith Hampshire-hosted show Music Machine. By 1975, Davies, along with producer Terry Brown, landed the band a deal with Capitol Records in the United States."]}, {"page": "1990 in film", "response": ["| The Nutcracker Prince || Warner Bros. Pictures / Lacewood Productions || Paul Schibli (director); Patricia Watson (screenplay); Kiefer Sutherland, Megan Follows, Peter Boretski, Phyllis Diller, Mike MacDonald, Peter O'Toole, Lynne Gorman, George Merner, Stephanie Morgenstern, Christopher Owens, Diane Stapley, Mona Waserman, Noam Zylberman, Len Carlson, Marvin Goldhar, Keith Hampshire, Elizabeth Hanna, Susan Roman, Theresa Sears || Romance, Fantasy || Animation"]}, {"page": "1987 in film", "response": ["| The Care Bears Adventure in Wonderland || Cineplex Odeon Films / Nelvana || Raymond Jafelice (director); Peter Sauder, Susan Snooks, John de Klein (screenplay); Bob Dermer, Eva Almos, Dan Hennessey, Jim Henshaw, Marla Lukofsky, Luba Goy, Keith Knight, Tracey Moore, Colin Fox, John Stocker, Don McManus, Elizabeth Hanna, Alan Fawcett, Keith Hampshire, Alyson Court || Animation, Fantasy || Animation", "* The Care Bears Adventure in Wonderland, directed by Raymond Jafelice, starring Bob Dermer, Eva Almos, Dan Hennessey, Jim Henshaw, Marla Lukofsky, Luba Goy, Keith Knight, Tracey Moore, Colin Fox, John Stocker, Don McManus, Elizabeth Hanna, Alan Fawcett, Keith Hampshire, and Alyson Court (Canada)"]}, {"page": "Wayne and Shuster", "response": ["Wayne and Shuster's skits often employed large casts of characters, and supporting players included Canadian actors Don Cullen, Jack Duffy, Tom Harvey, Bill Kemp, Paul Kligman, Ben Lennick, Sylvia Lennick, Peggi Loder, Les Rubie, Eric Christmas, Joe Austin, Larry Mann, Paul Soles, Marilyn Stuart, Roy Wordsworth, John Davies, Carol Robinson, Lou Pitoscia, Peggy Mahon, Don Ewer and Keith Hampshire. For many years, their music director was Canadian jazz artist Norman Amadio."]}, {"page": "Beetlejuice (TV series)", "response": ["* Keith Hampshire – Doomie"]}, {"page": "The Raccoons", "response": ["* The Pigs (voiced by Nick Nichols (Pig One (special 3-episode 50; 58)), Keith Hampshire (Pig One (episode 51–60)), Len Carlson (Pigs Two and Three (series)) and Fred Little (Pig Three (special 3) – Cyril's three bumbling henchmen and assistants. They are almost never referred to by name, as they are simply listed as Pig One, Two and Three in the credits, although they occasionally refer to one another as \"Lloyd\". Fans of the show have referred Pig One as \"Lloyd\" and the other two as \"Boyd\" and \"Floyd\" ", "* Keith Hampshire – Lloyd (Pig One) (1990–1991)"]}, {"page": "New Masters", "response": ["\"The First Cut Is the Deepest\" has been covered successfully by several artists. Prior to the release of New Masters, Stevens had sold the song for £30 to P. P. Arnold (formerly of the Ike and Tina Turner Revue) which gave the former Ikette her first UK hit. In the decades to come it would also be a hit for Rod Stewart, Sheryl Crow, James Morrison and Keith Hampshire. Hampshire's version reached no. 1 on the Canadian charts in 1973. Other versions have been rendered by singer Barbara Jones, Colm Wilkinson of Les Misérables and Jesus Christ Superstar fame, Duffy and the Jools Holland Rhythm & Blues Orchestra."]}, {"page": "The Adventures of Tintin (TV series)", "response": ["* Keith Hampshire as additional voices"]}, {"page": "The Care Bears Adventure in Wonderland", "response": ["| Keith Hampshire || Mad Hatter / Jabberwocky (\"Stan\")", "| \"Mad About Hats\" || John Sebastian || Keith Hampshire || John SebastianDavid Greene"]}, {"page": "Juno Award for Artist of the Year", "response": ["* Keith Hampshire"]}, {"page": "Oh What a Feeling: A Vital Collection of Canadian Music", "response": ["#Keith Hampshire, \"The First Cut Is the Deepest\" (1973)"]}, {"page": "Rock & Rule", "response": ["* Keith Hampshire voices other computers."]}, {"page": "Pecola", "response": ["* Keith Hampshire as Mayor Papazoni"]}, {"page": "Madballs", "response": ["* Horn Head: A cyclops face with a horn. He is the strongest member of the group. He was voiced by Keith Hampshire."]}, {"page": "Festival of Family Classics", "response": ["* Keith Hampshire"]}, {"page": "The First Cut Is the Deepest", "response": ["The song has been widely recorded and has become a hit single for six different artists: P. P. Arnold (1967), Keith Hampshire (1973), Rod Stewart (1977), Dawn Penn (1994), Papa Dee (1995) and Sheryl Crow (2003).", "Stevens made a demo recording of \"The First Cut Is the Deepest\" in 1965, while hoping to become a songwriter. He wrote the song earlier to promote his songs to other artists, but did not record it as his own performance until early October 1967 with guitarist Big Jim Sullivan, and it did not appear until his second album, New Masters, was released in December 1967. He sold the song for £30 to P. P. Arnold, and it became a huge hit for her. Over decades, it also became an international hit for Keith Hampshire, Rod Stewart, and Sheryl Crow. The song has won Stevens songwriting awards, including two consecutive ASCAP songwriting awards for \"Songwriter of the Year\" in 2005 and 2006.", "==Keith Hampshire version==", "Keith Hampshire had the first chart-topping hit of the song when his recording of it became a number-one hit in Canada in 1973, reaching the top of the RPM 100 national singles chart on 12 May of that year. It also topped the Canadian Adult Contemporary chart and charted in the United States, albeit outside the top 40."]}, {"page": "Care Bears Nutcracker Suite", "response": ["| Keith Hampshire || Rumble"]}, {"page": "Radio Caroline", "response": ["Radio Caroline's first programme, on 28 March 1964, was presented by Chris Moore. Presenters Tony Blackburn, Roger Gale, Ray Teret, Roger Day, Simon Dee, Tony Prince, Spangles Muldoon, Keith Skues, Johnnie Walker, Robbie Dale, Dave Lee Travis, Tommy Vance, Tom Edwards, Paul Noble, Bob Stewart and Andy Archer became well known. Some DJs from the USA and Commonwealth countries, such as Graham Webb, Emperor Rosko and Keith Hampshire were also heard. DJ Jack Spector, of the WMCA \"Good Guys\" in New York, regularly recorded for Radio Caroline. Syndicated shows from the US and recorded religious programmes were also broadcast. BBC Radio 2 newsreader Colin Berry started his career reading the news on Radio Caroline South."]}, {"page": "Juno Awards of 1974", "response": ["* Keith Hampshire"]}, {"page": "Bigfoot Presents: Meteor and the Mighty Monster Trucks", "response": ["* Buck Haymaker (voiced by Keith Hampshire) – A tractor-styled monster truck. He is Pony's father and Duke's uncle."]}, {"page": "The Nutcracker Prince", "response": ["* Keith Hampshire as Mouse, Guest, Second Guard, Contestant, Spectator and Soldier"]}, {"page": "Operation Steinbock", "response": ["| No. 456 Squadron RAAF || Mosquito || RAF Fairwood Common and RAF Ford || Led by Wing commander Keith Hampshire, the squadron's leading night fighter pilot. 456 was a Royal Australian Air Force unit, formed in June 1941 and deactivated in June 1945.|| 20 claims against Steinbock operations", "The Germans lost 17 aircraft this night on operations and a further three on non-operational flights; two from KG 6 and one from KG 30. Of the operational casualties four are known to have been caused by ground-fire and a further two were shot down by night fighters—Wing Commander Keith Hampshire (CO of 456 Sqn RAAF) shot down a 6./KG 6 Ju 88 and Flying Officer E. Hedgecoe accounted for a Ju 88S-1 from 1./KG 66. Three were lost due to engine fires, technical issues or fuel starvation. The fate of the remaining 10 are unknown for certain. German aircrew losses amounted to 21 killed, three wounded, 25 missing and five captured.Mackay 2011, pp. 265–269.", "The Luftwaffe groups reported the loss of 14 aircraft and one damaged. Four belonged to KG 54 and four to KG 6. KG 2, 30 and 66 lost two aircraft each. Six were known to have been shot down by an assortment of Beaufighter and Mosquito night fighters. 68, 456, 406 and 219 Squadron pilots were credited with enemy aircraft this night. Two bombers were shot down by ground fire, the remainder failed to return for unknown reasons. Fighter Command made three further claims not attributable to a particular loss. A further claim was made by an anti-aircraft battery at Portland. German casualties amounted to 13 killed, one wounded, 16 missing and 19 captured. Wing Commander Keith Hampshire, commanding 456 Squadron RAAF accounted for two enemy aircraft this night—he achieved three successes during Steinbock.Mackay 2011, pp. 267, 281, 283."]}, {"page": "List of number-one singles of 1973 (Canada)", "response": ["| 19:13 || 12 May || \"The First Cut Is the Deepest\" || Keith Hampshire "]}, {"page": "Copperpenny", "response": ["1975 saw them sign on with Capitol Records. They made several appearances on television shows such as \"Keith Hampshire's Music Machine\".  Copperpenny even had a short-lived variety show that launched the career of a then unknown magician named Doug Henning."]}, {"page": "List of Canadian radio personalities", "response": ["*Keith Hampshire"]}, {"page": "OK Blue Jays", "response": ["\"OK Blue Jays\" is a baseball song played during the seventh-inning stretch of home games of the Toronto Blue Jays, a Major League Baseball team based in the city of Toronto, Ontario, Canada. The song includes references to the team's roster and events from the 1980s. It was released in 1983 and charted 47th on RPM's singles list. It was written by Jack Lenz and Tony Kosinec and is performed by Keith Hampshire and \"The Bat Boys\". The song was remixed by Rob Wells and Chris Anderson in 2003.", "* Keith Hampshire – lead and background vocals", "*Behind The Vinyl: \"OK Blue Jays\" with Keith Hampshire at YouTube"]}, {"page": "Axe Records", "response": ["The label's major recording success was with Gary and Dave.  The label also released records by Thundermug, Fergus, The Sattalites, Rain (with Charity Brown), Keith Hampshire, Major Hoople's Boarding House, Steel River, Tom Northcott and Walter Ostanek, among others.Uncredited, List of Releases by Axe Records; Rate Your Music.  Retrieved 2013-05-25."]}, {"page": "Sitting in the Park (song)", "response": ["*In 1973, Keith Hampshire released a version of the song as a single in Germany."]}, {"page": "The Care Bears Family", "response": ["* Keith Hampshire", "* Keith Hampshire – Songfellow Strum"]}]}}