{"wiki_id": "http://www.wikidata.org/entity/Q6384186", "itemLabel": "Keith Chadwick", "itemDescription": "British footballer (born 1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Chadwick", "wikipedia_page": {"main": "Keith Michael Chadwick (born 10 March 1953) is an English former footballer who played as a midfielder. After impressing at non-league Nantwich Town, he joined Third Division side Port Vale via Crewe Alexandra in August 1972. In five years he played 46 games in league and cup, scoring seven goals, before he was forced to retire due to injury. He later coached at Port Vale, H. & R. Johnson, Alsager Town, and Stoke City, and took up a career at Rolls-Royce Motors in August 1977. He worked for the company for 22 years, before he was appointed as Managing Director at Radshape Sheet Metal in March 2005.", "link_mentions": [{"page": "Gordon Lee (footballer)", "response": ["Lee released Freddie Goodwin, and sold Sammy Morgan to Aston Villa for £22,222. He built for the 1973–74 campaign by drafting in tall young players David Harris and John Ridley from the youth set-up, as well as versatile Keith Chadwick from Crewe Alexandra. After a spate of injuries, he signed Keith Leonard on loan from Aston Villa, and bought left-back Neil Griffiths from Chester for a £5,000 fee. Seemingly taking the club as far as he could, he left Burslem in January 1974 for a club with a much bigger potential. Vale finished the campaign one place and seven points above the relegation zone under the management of Roy Sproson."]}, {"page": "History of Port Vale F.C.", "response": ["Before 1973–74 was under way, Sammy Morgan was sold to Aston Villa for just over £20,000. The defence was strengthened with the signings of David Harris, Keith Chadwick and John Ridley. In January, Lee took the job at Blackburn Rovers. The appointment of Roy Sproson as his replacement marked a great change for the dressing room atmosphere, as Sproson was more relaxed and insisted upon a more 'entertaining' style of play. Ill discipline on the pitch caused Sproson to arrange a lecture by a local referee to calm his players down and avoid bookings. The club finished poorly, though avoided relegation. New signings for 1974–75 included Terry Bailey, Frank Sharp and John Connaughton. The club pushed for promotion, but registered another sixth-place finish, again four points from promotion. This time it was their away form that cost them."]}, {"page": "Keith Michael Chadwick", "response": ["#REDIRECT Keith Chadwick"]}, {"page": "1973–74 Port Vale F.C. season", "response": ["The pre-season saw Sammy Morgan sold to Aston Villa for £22,222 (plus top-up fees). Gordon Lee drafted in tall young players David Harris and John Ridley from the youth set-up, as well as versatile Keith Chadwick from Crewe Alexandra. The club also erected a 2.5 feet high steel fence around the Bycars End to help combat hooliganism.", "|align=\"left\"|MF||align=\"left\"| Keith Chadwick", "| July 1973 || MF ||  || Keith Chadwick || Crewe Alexandra || Free transfer || "]}, {"page": "1974–75 Port Vale F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Keith Chadwick", "|4||MF||||Keith Chadwick||5||0||0||5"]}, {"page": "1975–76 Port Vale F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Keith Chadwick", "|7||MF||||Keith Chadwick||2||0||0||2"]}, {"page": "1976–77 Port Vale F.C. season", "response": ["Vale's form tailed off, though Terry Alcock returned briefly to play a handful of games. Thomson also returned to the US, Ray Williams was transferred to Northwich Victoria for 'a small fee', and Colin Tartt was sold to Chesterfield for £15,000. In their places were new signings Alan Lamb (£5,000 from Preston North End) and Peter Sutcliffe (£3,000 from Stockport County), whilst a fit again Cullerton was like a new signing. The club had drifted into the bottom four, but a six match unbeaten run with a prolific Cullerton took them to safety. In the background was an ongoing power struggle in the boardroom. In late-March they then received a 6–2 beating at Wrexham and then a 4–0 beating from Chesterfield at Saltergate. The club suffered an injury crisis in April, with both Keith Chadwick and John Brodie having been forced to retire through injury. Relegation was avoided however with six points from the final five games. The final game of the season was against Rotherham United, who needed a six-goal win margin to gain promotion. The match saw three penalties, three bookings and crowd trouble, though United were four goals ahead they failed to find the remaining two, and instead the \"Valiants\" scored a late goal.", "| March 1977 || MF ||  || Keith Chadwick || colspan=\"2\"| Retired || "]}]}}