{"wiki_id": "http://www.wikidata.org/entity/Q6388645", "itemLabel": "Ken Veysey", "itemDescription": "English footballer (born 1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_Veysey", "wikipedia_page": {"main": "Kenneth James Veysey (born 8 June 1967) is an English former professional football goalkeeper and is currently goalkeeping coach at Torquay United. He was born in Hackney, London.\nIn June 2007, Veysey again became Torquay United's goalkeeping coach.", "link_mentions": [{"page": "Paul Crichton", "response": ["Crichton started his career as a trainee at Nottingham Forest club, turning professional in May 1986. While at Forest he was loaned out to six different clubs to gain experience, although he was never given an opportunity at Forest. The first of these loans, was with neighbours Notts County, which gave Crichton his league debut in September 1986. This was followed by further loans to Darlington in (January) and Peterborough United in (March). In September 1987 he rejoined Darlington, with further loans at Swindon Town in December 1987, and Rotherham United in March 1988. He joined Torquay United on loan in August 1988, playing 13 games at the start of the season, keeping Ken Veysey out of the side. He played well enough to attract attention from other clubs, and moved from Forest to Peterborough United in November on a free transfer."]}, {"page": "Kenny Allen (footballer)", "response": ["He moved on to recently relegated Newport County, but as Newport folded and failed to complete their Conference season, he returned to Torquay for a third time in April 1989 to cover for the injured Ken Veysey and played at Wembley in the Associate Members' Cup Final as Torquay's only other professional keeper Mark Coombe was cup-tied. He retired from football in June 1989 to work for the Post Office."]}, {"page": "Matt Gregg", "response": ["He played for Gloucester Primary Schools alongside future Torquay United teammate Wayne Thomas. He began his senior career as an apprentice with Torquay United, making his debut while still aged only 16 in the 1–1 draw with Wigan Athletic on 16 September 1995. He then returned to the reserves and his apprenticeship, appearing once more, in the last match of the 1996–97 season away to Doncaster Rovers, before turning professional in July 1997. He played another 30 times for Torquay, including the 1997–98 play-off final due to regular keeper Ken Veysey being suspended, before moving to Crystal Palace in October 1998 for a fee of £400,000."]}, {"page": "Chris Myers (footballer)", "response": ["Myers' father, Cliff was a professional footballer and in 2014, Myers' son Spencer signed a scholarship deal with Premier League side Everton. At one point outside of football, Myers ran a golf shop with former Torquay United teammate Ken Veysey. He has also worked as a firefighter for the Lancashire Fire and Rescue Service."]}, {"page": "Kenneth James Veysey", "response": ["#REDIRECT Ken Veysey"]}, {"page": "1998 Football League Third Division play-off Final", "response": ["The referee for the match was Mick Fletcher.  The match had been brought forward from the traditional Saturday afternoon fixture in order to accommodate the friendly between England and Saudi Arabia.  Torquay's goalkeeper Ken Veysey was suspended for the final so 19-year-old Matt Gregg, who had last started a game on 31 January, was selected in his place.  Colchester's Neil and David Gregory became the first brothers to appear in a play-off final together.  Colchester adopted a 4–3–3 formation while Torquay played as a 3–5–2."]}, {"page": "1999–2000 Plymouth Argyle F.C. season", "response": ["| 25|| || GK|| Ken Veysey|| 8|| 1|| 0"]}]}}