{"wiki_id": "http://www.wikidata.org/entity/Q6388193", "itemLabel": "Ken Morton", "itemDescription": "English footballer (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_Morton", "wikipedia_page": {"main": "Ken Morton (born 19 May 1947) is an English former professional footballer who played as a left winger. Morton made a total of 14 appearances in the Football League, scoring two goals. After retiring as a player, Morton later became active as a coach.", "link_mentions": [{"page": "SHB Da Nang FC", "response": ["| Ken Morton"]}, {"page": "Launceston United SC", "response": ["* Ken Morton"]}, {"page": "Tasmanian A-League bid", "response": ["Following the success of the A-League, a Tasmanian football task force headed by Hobart-based businessman John McGirr was given the task of finding funding for a Tasmanian-based A-League side.Tasmanian national soccer team push – ABC Grandstand Sport – ABC News (Australian Broadcasting Corporation) The taskforce has registered the name \"Tasmania United FC\" and is submitting a bid for the 2011–12 season.http://www.news.com.au/mercury/story/0,22884,24080405-13222,00.html In September 2008 McGirr Announced the adoption of an official club logo for the proposed club and announced that the taskforce was on target \"to present an extremely strong business case to both FFA and the Tasmanian community and intend to be ready to put a formal proposal for an A-League licence by mid-2009\".Tassie Push For A-League Boost – Australia News – Australian FourFourTwo – The Ultimate Football Website Tasmanian Football Taskforce official Ken Morton has stated that should Tasmania United FC be awarded an A-League licence then the competition would become \"a far more 'national' competition than rivals AFL and NRL, which are based in Melbourne and Sydney respectively. Indeed, the AFL has consistently refused Tasmania's push to have its own team, with economic factors being brought into play. We have a good cricket team down there who compete well at national level and we believe we can do the same in the A-League.\"Tassie would make A-League national | A-League | Fox Sports In February 2008, Ken Morton stated \"we meet the criteria but we require an owner.\"", "The Tasmanian task force, which has the backing of the state government, has scheduled the launch of Tasmania United FC for 25 November, and that a deal with a major sponsor is close at hand.Licence edge to Tassie Sport – The Mercury – The Voice of Tasmania Ken Morton states that \"we had good news regarding the major investor and once that is finalised in the next few days I think you will see our bid progress very aggressively.\"", "On 12 February 2009, the task force announced it was \"still in the mix\" and \"working harder than ever of late to entice investors and sponsors, as well as being in regular contact with the FFA\". The Taskforce was unable to complete a formal proposal in time for the early expansion, although the Taskforce continued operating with the intention of obtaining a future A-league licence. Ken Morton has since stated that he believes Tasmania United FC's chance of entering the A-League to be \"100%. I believe the A-League want us, the Tasmanian community want us and for this reason I believe it will become reality.\"", "During the bidding process, although there were no plans to sign players until the granting of an A-League licence, Ken Morton stated that he already had in mind \"2 Dutch Under 21 stars who I think would do very well and they would be great acquisitions for the A-League. Both played in Under 21 European Championships for Holland.\" However, with a delay to submission of the bid these acquisitions did not eventuate.", "While no firm decisions have been made Ken states that he is establishing scouting networks \"through existing scouts in Brazil, the UK and Asia.\" and intends to look at recruiting both locally and from \"Asia, Africa and Europe.\" When asked if he would be prepared to apply for the senior coach position once an A-League licence was granted, Ken Morton stated \"Yes, without a doubt.\"", "Following the successful friendly matches played between a Tasmanian Youth Side and National Youth League squads Ken Morton has stated that \"given a chance our youngsters can compete at this level\" and that \"the passion shown by these boys was tremendous.\""]}, {"page": "Ken Norton (disambiguation)", "response": ["*Ken Morton (born 1947), English footballer"]}, {"page": "2013 National Premier Leagues Grand Final", "response": ["|colspan=4| Ken Morton"]}]}}