{"wiki_id": "http://www.wikidata.org/entity/Q6386679", "itemLabel": "Kelvin Holdsworth", "itemDescription": "British minister (born 1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kelvin_Holdsworth", "wikipedia_page": {"main": "Kelvin Holdsworth (born 21 October 1966) is a British priest of the Scottish Episcopal Church. Since 2006, he has served as Rector and Provost of the St Mary's Cathedral, Glasgow.", "link_mentions": [{"page": "St Mary's Cathedral, Glasgow", "response": ["The twin roles of rector of the congregation and provost of the cathedral are carried out by one person. The candidate for the post of rector and provost is nominated as rector by the vestry on behalf of the congregation and elected as provost by the bishop meeting in chapter.  Frederic Llewellyn Deane was the first provost in 1908, four years after becoming rector. His successor, Ambrose Lethbridge, became provost in 1918, a year after being installed as rector. Following the sudden death of Bishop Goldie in October 1980, the installation of Malcolm Grant as rector and provost was delayed until after the enthronement of Bishop Rawcliffe in spring 1981. Kelvin Holdsworth was installed as rector and provost on 31 May 2006, the Feast of the Visitation."]}, {"page": "Diocese of Glasgow and Galloway", "response": ["*Provost: Kelvin Holdsworth"]}, {"page": "Kelvin (given name)", "response": ["*Kelvin Holdsworth, Scottish clergyman"]}, {"page": "Same-sex marriage in Scotland", "response": ["In January 2009, a petition was drawn up by Nick Henderson, director of the LGBT Network, to be submitted to the Scottish Parliament. The petition called for a change to the law that disallowed two people of the same sex from getting married, by amending the Marriage (Scotland) Act 1977. The petition also called for allowing same-sex marriage ceremonies to be performed by faith groups, but only if the religious institution gives consent. As well as political support from the leader of the Labour Party in the European Parliament, Glenis Willmott, and MEP and veteran gay rights activist Michael Cashman, the petition drew the signatures and support of Celia Kitzinger and Sue Wilkinson and of eight church leaders, both Episcopalian and the Church of Scotland. The Very Reverend Kelvin Holdsworth, Provost of the Scottish Episcopal St Mary's Cathedral in Glasgow, has often spoken of his willingness and desire to perform valid same-sex marriages in his church, and was a key supporter of the petition. It also attracted high-profile support from Labour MSP George Foulkes. The petition closed on 6 March, having gathered 1,007 signatures."]}, {"page": "Holdsworth (surname)", "response": ["*Kelvin Holdsworth (born 1966), Scottish Episcopalian clergyman"]}]}}