{"wiki_id": "http://www.wikidata.org/entity/Q6387287", "itemLabel": "Ken Barnes", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_Barnes_(writer)", "wikipedia_page": {"main": "Kenneth Valentine Barnes (14 February 1933 – 4 August 2015) was a British writer, record producer, broadcaster, musicologist, film historian, film maker, songwriter and music publisher.\nBorn in Middlesbrough, Barnes was educated in Redcar, and did his National Service in the Royal Corps of Signals. He trained as a draughtsman after leaving the army, but his interest in jazz, swing and the Great American Songbook led him to London in the 1960s, where he worked in marketing for Polydor and Decca Records before becoming a record producer.In the 1970s, Barnes worked with Bing Crosby, Peter Sellers, Frankie Laine, Peggy Lee and Fred Astaire. In 1974, he convinced Johnny Mercer to record a two-disk collection of Mercer singing Mercer, with Johnny selecting his own favourites. These were the last recordings made by Mercer before his death in 1976.Barnes also published several books, contributed liner notes for reissue albums, and wrote comedy scripts for BBC TV. For BBC Radio and TV, he wrote over 90 scripts, as well as special material for Parkinson. He also wrote for comedians including Roy Hudd and Les Dawson. In America, Barnes wrote special material for Crosby, Fred Astaire, Gene Kelly and Peter Sellers, amongst others.Barnes was the founder and CEO of The Laureate Company, a music and movie restoration company.  He wrote and delivered the DVD audio commentary on Citizen Kane (1941) and Holiday Inn (1942), starring Astaire and Crosby. The DVD also featured a supplementary documentary, A Couple of Song and Dance Men, in which he appears with Astaire's daughter, Ava Astaire-MacKenzie.\nBarnes died in 2015, aged 82, after a long battle with diabetes. He was married to Anne.", "link_mentions": [{"page": "Bing Crosby", "response": ["# \"That's What Life is All About\" (1975), with Ken Barnes, Peter Dacre, and Les Reed, US, AC chart, no. 35; UK, no. 41", "*  Includes a chapter on Crosby's involvement in the making of \"White Christmas\" and an interview with record producer Ken Barnes."]}, {"page": "Glam rock", "response": ["Glam rock emerged from the English psychedelic and art rock scenes of the late 1960s and can be seen as both an extension of, and a reaction against, those trends.R. Shuker, Popular Music: the Key Concepts (Abingdon: Routledge, 2nd edn., 2005), , pp. 124-5. Its origins are associated with Marc Bolan, who had renamed his acoustic duo T. Rex and taken up electric instruments by the end of the 1960s. Bolan was, in the words of music critic Ken Barnes, \"the man who started it all\". Often cited as the moment of inception is Bolan's appearance on the BBC music show Top of the Pops in March 1971 wearing glitter and satins, to perform what would be his second UK Top 10 hit (and first UK Number 1 hit), \"Hot Love\".Mark Paytress, Bolan – The Rise And Fall of a 20th Century Superstar (Omnibus Press 2002) , pp. 180–181. The Independent states that Bolan's appearance on Top of the Pops \"permitted a generation of teeny-boppers to begin playing with the idea of androgyny\".\"Box-set billed as the definitive guide to Seventies music genre has further ostracised its disgraced former star\". The Independent. Retrieved 15 September 2017 T. Rex's 1971 album Electric Warrior received critical acclaim as a pioneering glam rock album. In 1973, a few months after the release of the album Tanx, Bolan captured the front cover of Melody Maker magazine with the declaration \"Glam rock is dead!\""]}, {"page": "Marc Bolan", "response": ["In the late 1960s, he rose to fame as the founder and leader of the psychedelic folk band Tyrannosaurus Rex, with whom he released four critically acclaimed albums and had one minor hit \"Debora\". Bolan had started as an acoustic singer-writer before heading into electric music prior to the recording T. Rex's first single \"Ride a White Swan\" which went to number two in the UK singles chart. Bolan's March 1971 appearance on the BBC's music show Top of the Pops, wearing glitter on the face for the UK chart topper \"Hot Love\", is cited as the beginning of the glam rock movement.Petridis, Alexis. \"Why Marc Bolan was 'the perfect pop star', by Elton John, U2 and more\". The Guardian. 4 September 2020. Retrieved 5 February 2021. Music critic Ken Barnes called Bolan \"the man who started it all\". T. Rex's 1971 album Electric Warrior, with all songs written by Bolan, has been described by AllMusic as \"the album that essentially kick-started the UK glam rock craze.\" Producer Tony Visconti, who worked with Bolan during his heyday, stated: \"What I saw in Marc Bolan had nothing to do with strings, or very high standards of artistry; what I saw in him was raw talent. I saw genius. I saw a potential rock star in Marc – right from the minute, the hour I met him.\"\"Tony Visconti: 'What I saw in Marc Bolan was raw talent. I saw genius'. The Guardian. Retrieved 3 February 2019 From 1973, he started marrying rock with other influences, including funk, soul, gospel, disco and R&B."]}, {"page": "Holiday Inn (film)", "response": ["In 2006 it was released as a single-disc \"Special Edition\" featuring a commentary by Ken Barnes, with interspersed archival comments by Crosby and Astaire. It also included A Couple of Song and Dance Men, a documentary on Astaire and Crosby; All-Singing All-Dancing, a featurette on audio recording of movie musicals; and a reissue theatrical trailer."]}, {"page": "Let's Do It, Let's Fall in Love", "response": ["* A duet version was recorded by Scottish singers Todd Gordon and Eddi Reader accompanied by The Royal Air Force Squadronaires big band (2012), produced by Ken Barnes"]}, {"page": "Meet John Doe", "response": ["Poor quality copies of Meet John Doe have proliferated on home video for years, sourced from inferior quality prints, while the restored LoC print remains in storage. In 2001 Ken Barnes' Laureate Presentations undertook a digital restoration of the best available European print. This was released on DVD by Sanctuary in the UK and by VCI in the US.\"Meet John Doe: 70th Anniversary Ultimate Collector's Edition.\"  VCIEntertainment.com. Retrieved: January 11, 2014. To date these are the best quality commercially available releases.\"Meet John Doe: Worldwide DVD Comparisons.\" DVDCompare.net. Retrieved: January 11, 2014."]}, {"page": "Evergreen (Love Theme from A Star Is Born)", "response": ["Scottish singer Todd Gordon recorded a big band version with the Royal Air Force Squadronaires for the album Helping the Heroes (2012) produced by Ken Barnes."]}, {"page": "Le Bing: Song Hits of Paris", "response": ["Record producer, Ken Barnes, wrote: \"According to the discographical information, this remarkable album was recorded in a single day. The orchestrations and conducting are uncredited (although it sounds like John Scott Trotter's work). Unfortunately, the string sound is a little thin and the intonation of the violins is somewhat insecure on one or two tracks - notably on 'Embrasse-moi bien'. But the same can never be said of Mr Crosby whose pitching is unerringly accurate throughout all eight titles. Of his French accent, Bing remarked at the time that any complaints should be sent 'to the back door of the United Nations'.\""]}, {"page": "Some Fine Old Chestnuts", "response": ["Record producer Ken Barnes wrote, \"Bing is in excellent voice — thanks to an intelligent choice of keys — and accompanied only by the Buddy Cole Trio (piano, bass and drums). The recording quality is truly superb. The only criticism is an alarming sameness in the presentation of each song (first chorus slow, second chorus fast — or, at least, moderately bright). But perhaps this is being churlish when the standard of performance is so high. Apart from Bing's glorious vocals (his performance of 'Sleepy Time Gal' is absolutely definitive), there is Buddy Cole's dazzling piano work.\""]}, {"page": "Bing Sings Whilst Bregman Swings", "response": ["Record producer Ken Barnes, wrote, \"This popular album has been re-issued many times on various labels over the years. As an example of Crosby's art it is something of an enigma. On the one hand the choice of songs is impeccable – beautifully written standards like 'They All Laughed,' 'The Song Is You,' 'Have You Met Miss Jones', and 'September in the Rain' and Bing's singing, for the most part, is exemplary. But, on the other hand, it is very difficult to accept Buddy Bregman seriously as a reliable orchestral accompanist. His writing can be reasonably tasteful on tracks like 'They All Laughed,' 'Mountain Greenery', and 'The Blue Room', but his brass scoring is ham–fisted and bitterly distracting in 'Cheek to Cheek' and 'I've Got Five Dollars'. And one wonders how Bing ever managed to stay on pitch in the middle of 'Heat Wave' where Bregman has the orchestra playing suspect chords. Despite all these faults, it was refreshing at the time to hear Crosby with a modern-sounding orchestra and while this album is no match for Sinatra's 'Songs for Swingin' Lovers' classic LP, it was a step – albeit a hesitant one – in the right direction.\""]}, {"page": "Bing with a Beat", "response": ["Record producer, Ken Barnes, wrote, \"After his high-powered outing with Buddy Bregman, Bing probably felt a desire to get back to the roots of his singing style and this pleasantly swinging album with Bob Scobey's Frisco Jazz Band was probably the best artistic therapy for him at this point in his career. Bing always responded enthusiastically to a Dixie-style backing and with songs like 'Some Sunny Day', 'Whispering' and 'Mama Loves Papa' he is in top-notch form. Scobey plays some tasty trumpet and there are telling solos from others in the band - notably Ralph Sutton on piano. The cleanly crisp arrangements are by Matty Matlock and the album is almost a total joy from beginning to end. The only mild disappointment is a rather lack-lustre version of 'Mack the Knife' which should have been a standout."]}, {"page": "New Tricks (album)", "response": ["Record producer, Ken Barnes, wrote: \"While Bing broke no new ground with this album of oldies—accompanied by Buddy Cole’s trio—it was clearly something he enjoyed doing. The songs are all good—‘When I Take My Sugar to Tea’, ‘Avalon’, ‘Chicago’ and an outstanding ‘On the Alamo’ to name but four, and Bing puts it all across with great style. Cole plays his customary tasteful piano—his occasional excursions on to organ, however, only serve to point out how much better electronic organs sound today. This is a pity, because Cole had a considerable technique. Not a classic Crosby album by any means but a pleasant one, certainly."]}, {"page": "That Travelin' Two-Beat", "response": ["Record producer, Ken Barnes, wrote: \"This second album, teaming Bing with the delightful Rosemary Clooney, is far less sophisticated than the 1958 classic Fancy Meeting You Here (RCA), but it is enjoyable nonetheless. Like the previous album, Crosby and Clooney have decided to retain the “travel” theme—with songs like “Poor People of Paris,” “Roamin’ in the Gloamin’,” and a clever, up-dated variation of Strauss’s “New Vienna Woods.” The only shortcoming—and with twelve songs it is a considerable one—is that everything is tied to a two-beat Dixieland format. Despite these limitations, Billy May's tongue-in-cheek backings raise a smile or two. The adaptations and lyrics by Jay Livingston and Ray Evans are very effective. Miss Clooney responds happily to Bing's bouncy phrasing. If the treatments had been a little more varied and the sound balancing a shade more sympathetic to the voices, this could have been just as good as Fancy.\""]}, {"page": "Rain or Shine (Dick Haymes album)", "response": ["*The booklet of the CD collection: The Complete Capitol Collection, written by Ruth Prigozy and Ken Barnes."]}, {"page": "Moondreams (Dick Haymes album)", "response": ["*The booklet of the CD collection: The Complete Capitol Collection, written by Ruth Prigozy and Ken Barnes."]}, {"page": "The Complete Capitol Collection (Dick Haymes album)", "response": ["*The booklet of the CD collection: The Complete Capitol Collection, written by Ruth Prigozy and Ken Barnes."]}, {"page": "The Pillbugs", "response": ["August 2007: USA Today music editor Ken Barnes chooses The Pillbugs \"All in Good Time\" in his \"Pick of the Week\" column.", "September 2007: USA Today music editor Ken Barnes chooses The Pillbugs \"4 sec Nightmare in a 5 sec Dream\" in his \"Pick of the Week\" column."]}, {"page": "Live in London (Peggy Lee album)", "response": ["Record producer Ken Barnes and Peggy Lee signed a contract with Polydor Records for two albums, one in the studio and one \"live\". The studio album was Peggy and this was the live album and it was taken from the two performances at the London Palladium on March 13, 1977.", "Peggy Lee (ldr), Ken Barnes (pdr), Steve Taylor (eng), Peter Moore, Jack Parnell (con), The Jack Parnell Orchestra (acc), Bob Burns (as), Duncan Lamont, Tommy Whittle (ts), Kenny Baker (t), Richard Edwards, Don Lusher (tb), Tony Fisher (fh), Judd Proctor (g), Unknown (str), Ronnie Price (key), Ronnie Verrell (d), Peggy Lee (v)", "Category:Albums produced by Ken Barnes (writer)"]}, {"page": "Peggy (album)", "response": ["#\"Switchin' Channels\" (Ken Barnes, Moore) - 3:15", "*Producer – Ken Barnes", "Category:Albums produced by Ken Barnes (writer)"]}, {"page": "Seasons (Bing Crosby album)", "response": ["Seasons is a 1977 album by Bing Crosby which was issued by Polydor Records under catalogue No. 2442 151. The album is particularly significant in that it was the final studio album completed before Crosby's death on October 14, 1977; it was released posthumously, and was marketed with the tagline \"The Closing Chapter\". Crosby was backed by Pete Moore and his Orchestra and the Johnny Evans Singers. Moore also did all the arrangements for the album, which was recorded at CBS Studios, Whitfield Street, London on September 12,13 & 14 1977 - except for one song \"Spring Will Be a Little Late This Year\" which was recorded at United Western Recorders, Sunset Boulevard, Hollywood on January 19, 1976.  This song was also produced by Ken Barnes and arranged by Pete Moore.", "Category:Albums produced by Ken Barnes (writer)"]}, {"page": "A Couple of Song and Dance Men", "response": ["Fred Astaire had agreed to producer Ken Barnes' request to make recordings for two long-playing albums in London. When it was found that Astaire's visit would coincide with Bing Crosby's stay in the UK, Barnes obtained the agreement of both artists to make an album together. In three morning sessions, held on consecutive days, they recorded thirteen tracks of which eleven were duets and two were solos in which they each sang a number famously associated with the other.", "Billboard summed it up by saying: \"Enjoyable set from two of the finer singers of our time, cut in London, produced by Ken Barnes and featuring the Pete Moore Orchestra. Lots of cuts from movies the two have appeared in with material from Berlin, Mercer, Carmichael and Scott Joplin. All standards well done, with the pair singing together or taking solos.\"", "* Ken Barnes – producer", "Category:Albums produced by Ken Barnes (writer)"]}, {"page": "Bing Crosby filmography", "response": ["* Nanny McPhee and the Big Bang (2010) – The  soundtrack features Crosby singing \"The Best Things in Life Are Free\". It is the first use in a film of a Ken Barnes session recording. Bing was in London to record the song in 1975."]}, {"page": "Ken Barnes", "response": ["*Ken Barnes (writer) (1933–2015), British writer, record producer and film historian", "*Ken Barnes (English footballer) (1929–2010), English footballer", "*Ken Barnes (soldier) (1935–2009), Jamaican soldier, politician, and footballer", "*Ken Barnes (Australian footballer) (born 1941), Australian rules footballer"]}, {"page": "Ken Barnes (producer)", "response": ["#REDIRECT Ken Barnes (writer)"]}, {"page": "Pete Moore (composer)", "response": ["Beginning in 1958, he worked with such greats as Bing Crosby, Fred Astaire, Gene Kelly, Peggy Lee, Frankie Laine, Connie Francis and Peter Sellers, amongst others, on all manner of broadcasts and recordings. He frequently collaborated with record producer Ken Barnes. ", "Ken Barnes gave Moore the following appraisal: \"A quiet, soft-spoken and unassuming man, cockney-raised and academy-trained, Pete Moore usually declined to do interviews because he was always 'too busy.' In fact, it would seem that he never actively sought work, it just came to him. Which is why he was often referred to as 'The Invisible Genius.' As a person and as a musician, he was liked and admired by everyone who knew him. While he may not be a household name, Pete Moore's music remains alive and well. As it has for the past half-century.\""]}, {"page": "Aggro-Phobia", "response": ["The song \"Tear Me Apart\" reached No. 27 on the UK singles chart in October 1977. Writing for Bomp!, music critic Ken Barnes called it \"excellent\" and \"superior to [her] earlier hits\"."]}, {"page": "Red River Valley (album)", "response": ["Category:Albums produced by Ken Barnes (writer)"]}, {"page": "That's What Life Is All About", "response": ["\"That's What Life Is All About\" is a 1975 song recorded by Bing Crosby. It was originally written by Peter Dacre (lyrics) and Les Reed (music). Later, Crosby re-wrote the lyrics with Ken Barnes.", "Crosby recorded the song on February 19, 1975 at Chappells in London with the Pete Moore Orchestra. The session was produced by Ken Barnes. It was included on the album That's What Life Is All About."]}, {"page": "Devonshire Sound Studios", "response": ["In October and November, 1976, Bing Crosby recorded tracks at the studios under the direction of Ken Barnes for the album Beautiful Memories."]}, {"page": "Sinatra: London", "response": ["Sinatra: London is a 3CD & 1DVD Frank Sinatra box set released on November 25, 2014. It is the third in a series of city-themed box sets following Vegas and New York. The set includes the 1962 album Sinatra Sings Great Songs from Great Britain as recorded in London, as well as unreleased outtake material from those sessions and spoken introductions for each song intended for a BBC radio special. The live material consists of a 1953 session from BBC Radio's The Show Band Show, a full concert recorded in 1984 at the Royal Albert Hall, and two concerts on the DVD, both recorded at the Royal Festival Hall in 1962 and 1970. The liner notes are written by Ken Barnes."]}, {"page": "2015 in the United Kingdom", "response": ["**Ken Barnes, 82, writer and record producer."]}, {"page": "Bing Crosby's record labels after 1955", "response": ["That's What Life Is All About. The first album for Ken Barnes.", "A Couple of Song and Dance Men. Another one for Ken Barnes, this time with Fred Astaire.", "At My Time of Life. Another Ken Barnes production. Mainly show tunes.", "Bing Crosby Live at the London Palladium. Live recording of the show put on by Bing Crosby, Rosemary Clooney, Kathryn Crosby and Ted Rogers at the London Palladium from June 21 to July 4, 1976. Produced by Ken Barnes.", "Beautiful Memories. Another Ken Barnes production.", "Seasons. Bing's last album. Again produced by Ken Barnes."]}, {"page": "Deaths in August 2015", "response": ["*Ken Barnes, 82, British writer and record producer.Ken Barnes, writer and record producer - obituary"]}, {"page": "International Club Crosby", "response": ["Representatives of Club Crosby and the International Crosby Circle came together under the leadership of Wig Wiggins to make substantial contributions to a major conference titled Bing! Crosby and American Culture held at Hofstra University in Hempstead, New York on November 14–16, 2002. Many of the papers presented are contained in the book Going My Way - Bing Crosby and American Culture. Some notable panellists at the conference included Kathryn Crosby, Ken Barnes, Buddy Bregman, Will Friedwald, Gary Giddins, Nick Perito, Margaret Whiting, Ervin Drake, Joe Bushkin, Skitch Henderson and Joe Franklin.", "The two clubs also played a prominent part in the centenary celebrations of Crosby's birth held at Gonzaga University in May 2003. This event was attended by Kathryn Crosby, Ken Barnes, Buddy Bregman, Will Friedwald, Gary Giddins, Rich Little, Frank Sinatra, Jr. and many members of the Crosby family."]}, {"page": "A Southern Memoir", "response": ["Record producer, Ken Barnes, wrote: \"This collection of “Southern-cum-mammy” type songs was a pet project of Bing’s and his affection for the material reveals itself time and again throughout each of the twelve songs. The small-band backings arranged by pianist-conductor Paul Smith are beautifully written and very well played. Bing sings with greater spirit and drive than on his album with Basie and some of the tracks, notably “Carolina in the Morning,” “Swanee,” and “Sailing Down the Chesapeake Bay” stand comparison with some of his best-ever up-tempo performances.\""]}, {"page": "That's What Life Is All About (album)", "response": ["In January 1974, Crosby was seriously ill and after two weeks of tests, he underwent three and a half hours of major surgery. Two-fifths of his left lung and an abscess the size of a small orange were removed. The tumor was a rare fungus called nocardia. There were concerns initially that he would not be able to sing again and his recuperation took many months. Record producer Ken Barnes later heard that Crosby was thinking of recording again and he quickly presented his credentials and eventually met Crosby on September 9, 1974 at the singer’s home. Arrangements were soon made for two albums to be made in London. As a prelude, two songs were recorded with Johnny Mercer and a rhythm section at Mercer’s own “Heritage” recording studio at Oak Street in Burbank, California on October 17, 1974. Orchestra was added in February 1975.", "Category:Albums produced by Ken Barnes (writer)"]}, {"page": "At My Time of Life", "response": ["In January 1974, Crosby was seriously ill and after two weeks of tests, he underwent three and a half hours of major surgery. Two-fifths of his left lung and an abscess the size of a small orange were removed. The tumor was a rare fungus called nocardia. There were concerns initially that he would not be able to sing again and his recuperation took many months. Record producer, Ken Barnes, later heard that Bing was thinking of recording again and he quickly presented his credentials and eventually met Crosby on September 9, 1974 at the singer’s home. Arrangements were soon made for two albums to be made in London. Bing flew to London on February 18, 1975 and that afternoon visited the Chappells recording studio. He was shown the vocal booth where he would be singing but said that he did not want to work in that way. He wanted to be with the band and said, “I didn’t come seven thousand miles to sing to a pane of glass.” This worried sound engineer John Timperley who was concerned about separation problems because of the large orchestra which was to be used. Crosby was adamant however and, in the event, he successfully overcame the problems of recording in front of a full orchestra.", "The UK magazine The Gramophone reviewed the album saying: \"The arrival for review of “At My Time of Life” by Bing Crosby coincided with his outstanding triumph at the London Palladium heading a bill shared by members of his family and Rosemary Clooney…Crosby brings his special brand of affable authority to all fourteen numbers, aided and embellished by Pete Moore’s arrangements and orchestrations which incorporate some deft modern touches without jeopardizing the essential nostalgia of much of this material. The sympathetic and totally aware production work of Ken Barnes also asserts itself in a practical but unobtrusive fashion, and this album is a genuine piece of popular music history of inestimable value.", "Category:Albums produced by Ken Barnes (writer)"]}, {"page": "Bingo Viejo", "response": ["Record producer, Ken Barnes, felt that the album was a less successful effort than A Southern Memoir and he considered that the \"main fault lies in the choice of some of the songs—notably ‘The Breeze and I’ and especially ‘Spanish Eyes’ which were clearly too rangy for any septuagenarian to sing, although sing them he does.\""]}, {"page": "Beautiful Memories (album)", "response": ["Category:Albums produced by Ken Barnes (writer)"]}, {"page": "Bing Crosby Live at the London Palladium", "response": ["The performances on June 25 and 26 were recorded by Ken Barnes and issued as a double album by K-Tel International under licence from United Artists Records. ", "Bing Crosby had been tempted back into the recording studios by producer Ken Barnes and quickly made three albums with him in London. He also made two LPs which he financed himself and during an extended stay in the U.K. in the summer of 1975, he made many appearances on radio and television shows. His appetite for show business seemed to have returned and then he decided to give a series of concerts to celebrate his fifty years as an entertainer. Starting in California, and then coming across to the London Palladium for a two-week stint, his performances were a revelation to many and Crosby was clearly enjoying himself.", "Category:Albums produced by Ken Barnes (writer)"]}, {"page": "Fusion (music magazine)", "response": ["Among the writers whose work appeared in Fusion are the following: Ben Edmonds, Loyd Grossman, Lenny Kaye, Danny Goldberg, Nick Tosches, Keith Altham, Michael Lydon, Robert Greenfield, Charlie Gillett, Greg Shaw, Geoffrey Cannon, Jon Tiven, Al Aronowitz, Lester Bangs, Gene Sculatti, Ken Barnes, Metal Mike Saunders, Mitchell Cohen and Keith Maillard. The magazine also published pieces by Barry Miles and David Walley."]}]}}