{"wiki_id": "http://www.wikidata.org/entity/Q6387673", "itemLabel": "Ken Gill", "itemDescription": "English rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_Gill_(rugby_league)", "wikipedia_page": {"main": "Kenneth Gill (2 April 1948) is an English former professional rugby league footballer who played in the 1970s and 1980s. He played at representative level for Great Britain and England, and at club level for Salford (two spells), Widnes and Barrow, as a stand-off.", "link_mentions": [{"page": "1975 Rugby League World Cup", "response": ["English stand-off Ken Gill ran in three tries.", "*  Ken Gill"]}, {"page": "1977 Rugby League World Cup", "response": ["|IC ||14|| Ken Gill", "The Lions then hit back with a try under the posts to replacement back Ken Gill which was converted by Fairbairn to bring the scores to 13–12. After Kolc was penalised for using an elbow on Roger Millward who was chasing his own chip-kick, Fairbairn then had a late chance to give Great Britain the lead with a penalty goal from 45 metres out, though his went just to the right of the posts into the waiting arms of Australian fullback Graham Eadie who took full advantage of the Lions defence line still being near halfway to run the ball back outside the Australian quarter line.1977 World Cup Final highlights", "*  Ken Gill"]}, {"page": "Ken Gill", "response": ["Ken Gill (30 August 1927 – 23 May 2009Reuters, 23 May 2009, Former trade union leader Ken Gill dies) was a British trade union leader. He was the General Secretary of the Technical, Administrative and Supervisory Section (TASS), from 1974 to 1988, when it merged with ASTMS to form the Manufacturing, Science and Finance Union (MSF). He was General Secretary of the MSF, 1988–1992, initially jointly with Clive Jenkins. A committed Communist, he was elected to the TUC General Council in 1974, and was a prominent figure in the militant industrial relations of the 1970s. From 1981 to 1987 he was a member of the Commission for Racial Equality.", "Ken Gill was born in Melksham, Wiltshire, in 1927.Green, John, and Boncza, Michal (eds, 2009), Hung, drawn and quartered – the caricatures of Ken Gill  Gill was politicised when young, having experienced poverty in his childhood during the Great Depression. He attended a grammar school and was offered officer training during the Second World War, but refused this owing to a political opposition to the officer class. In 1943, aged 15, he became an apprentice draughtsman. During the war his family took in a lodger, a cobbler and communist who convinced the young Gill of the cause of socialism. In 1945 he was a prominent campaigner for the local Labour candidate, who was elected as the first local Labour MP.", "Gill became the General Secretary of TASS in 1974, and that same year was the third communist to be elected on to the TUC General Council,Daily Telegraph, 24 May 2009, Ken Gill with over 7 million votes. With the support of other left-wingers on the Council he helped lead a militant broad left grouping, which played a key role in the ideological and economic battles of the time. He was a leading member of the 'awkward squad' of trade union leaders which made the industrial relations of the nineteen seventies so difficult for successive governments, not least by consistently opposing an enforced incomes policy. He was a leading figure in union opposition to Barbara Castle's contentious 1969 bill on industrial relations, In Place of Strife.The Guardian, 24 May 2009, Ken Gill: One of the militant trade union leaders of the 1970s, he headed Tass and MSF", "After his retirement, Gill continued campaigning, including against the 2003 Iraq war. He also played a key role in the 1993 founding of the Cuba Solidarity Campaign in the UK, becoming its first chair, only stepping down in 2008.The Times, 26 May 2009, Ken Gill: Communist trade union leader", "* Ken Gill (Author), John Green and Michal Boncza (Editors), 2009 – Hung, Drawn and Quartered, Artery Publications, . The book is a selection of Gill's caricatures.", "==The Ken Gill Memorial Fund==", "* The Ken Gill Memorial Fund"]}, {"page": "List of Great Britain national rugby league team players", "response": ["* Ken Gill circa-1974", "*Ken Gill"]}]}}