{"wiki_id": "http://www.wikidata.org/entity/Q6384121", "itemLabel": "Keith Brown", "itemDescription": "cricketer (born 1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Brown_(cricketer)", "wikipedia_page": {"main": "Keith Robert Brown (born 18 March 1963 Edmonton, Middlesex, England) is a former English first-class cricketer.\nKeith Brown was educated at the Chace Comprehensive School, Enfield and he represented Middlesex and Marylebone Cricket Club (MCC) as a right-handed batsman, wicket-keeper and occasional right-arm slow-medium bowler in 247 first-class matches between 1984 and 1998, scoring 10,487 runs (average 35.19; highest score 200 not out) with 499 dismissals (466 catches and 33 stumpings). He was the county's sixth most prolific wicket-keeper.\nHe also scored 4,749 runs in 248 List A matches (average 29.31; highest score 114) with 217 dismissals (168 catches and 49 stumpings).\nHe was awarded his county cap in 1990 and a benefit in 1998. He also served as vice-captain under the Middlesex captain Mark Ramprakash. Upon his retirement from first-class cricket in 1998, he became a gamesmaster and form tutor at Bramdean School, Exeter Devon.\n\n", "link_mentions": [{"page": "Middlesex County Cricket Club", "response": ["* 7th – 132 Keith Brown & N. F. Williams v. Somerset, Lord's, 1988"]}, {"page": "Keith Brown", "response": ["Keith Brown may refer to:", "*Keith Brown (American football) (born 1983), American football wide receiver", "*Keith Brown (baseball) (born 1964), American baseball pitcher", "*Keith Brown (basketball), coach in 2010–11 NCAA Division I men's basketball season", "*Keith Brown (cricketer) (born 1963), English cricketer", "*Keith Brown (ice hockey) (born 1960), Canadian ice hockey player", "*Keith Brown (footballer, born 1954), English footballer (Grimsby Town)", "*Keith Brown (footballer, born 1979), Scottish footballer (Barnsley FC, Oxford United, Falkirk FC)", "*Keith Brown (pole vaulter) (1913–1991), American athlete and politician", "*Keith Brown (Ontario politician) (1926–2015), retired businessperson and politician", "*Keith Brown (pole vaulter) (1913–1991), American politician and athlete", "*Keith Brown (Scottish politician) (born 1961), Deputy Leader of the Scottish National Party (SNP) and former Scottish government minister", "*Keith Brown (New York politician) (born 1968), member of the New York State Assembly ", "*Keith Brown, former stage manager of the piano group The 5 Browns", "*Keith Brown (author) (born 1967), technical and security author", "*Keith Brown (linguist), British linguist"]}, {"page": "Paul Farbrace", "response": ["Farbrace played for Kent between 1987 and 1989 and for Middlesex from 1990 to 1995. His peak season in county cricket was 1991, when he played 20 first-class matches, made 54 dismissals, but he only averaged 14.81 with the bat. With an overall career batting average of 18.23 he only made another four appearances in first-class cricket, all of which were matches against universities, rather than County Championship matches. He was replaced as wicket-keeper by longstanding Middlesex player Keith Brown, who had played as a specialist batsman while Farbrace was in the side."]}, {"page": "Bramdean School", "response": ["Bramdean School was a non-selective mixed independent school of up to 200 pupils located in Heavitree, Exeter, Devon. Sporting coaches include Javier Martin Cortes, former La Liga Barcelona FC Academy coach, Keith Brown, former vice-captain MCCC Lords and Jill Stone, former junior Wimbledon player, and development coach of the Lawn Tennis Association. The school motto \"Tenax et Fortis\" translates as \"steadfast and courageous\"."]}, {"page": "Andrew Williams (Shropshire cricketer)", "response": ["His only List Aappearance was against Middlesex at St George's Cricket Ground, Telford in the NatWest Trophy on the 24th June 1992. Centuries from Desmond Haynes (101) and Mike Roseberry  (112) enabled Middlesex to set a target of 294 from 60 overs. Opening the batting against Angus Fraser and Dean Headley, Williams was caught behind by wicketkeeper Keith Brown for 6 with Shropshire being bowled out for 149 runs and losing the game by 145 runs.Engel, Matthew Wisden Cricket Almanack 1993. Nat West Bank Trophy First Round match Shropshire v Middlesex p 611 & 612. "]}, {"page": "List of Marylebone Cricket Club players (1978–)", "response": ["*  Keith Brown (1990) : K. R. Brown (Middlesex)\t"]}]}}