{"wiki_id": "http://www.wikidata.org/entity/Q6389871", "itemLabel": "Kenneth Bloomfield", "itemDescription": "British civil servant (born 1931)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenneth_Bloomfield", "wikipedia_page": {"main": "Sir Kenneth Percy Bloomfield KCB (born 15 April 1931) is a former Head of the Northern Ireland Civil Service who was later a member of the Independent Commission for the Location of Victims' Remains and for a time Northern Ireland Victims Commissioner. In addition to this, he has held a variety of public sector posts in Northern Ireland and elsewhere.", "link_mentions": [{"page": "April 15", "response": ["*1931 – Kenneth Bloomfield, Northern Irish civil servant"]}, {"page": "St Peter's College, Oxford", "response": ["* Kenneth Bloomfield, Head of the Northern Ireland Civil Service and member of the Independent Commission for the Location of Victims' Remains "]}, {"page": "1969 Ulster Unionist Party leadership election", "response": ["It had initially been assumed that Faulkner would win the contest, however many within the Parliamentary Party were determined that a hardliner such as Faulkner should not be leader.  Jack Andrews, leader of the Senate, came under pressure from many including O'Neill, to stand, however he refused.  In His memoirs, Kenneth Bloomfield suggests that Chichester-Clark's resignation from the cabinet which precipitated O'Neill's own resignation, had been a ploy to deprive Faulkner.  In his own memoirs, Faulkner claims that it was a matter of class distinction, where the upper classes had conspired to keep the Premiership out of middle class hands.  Following his headline grabbing resignation, and O'Neill's endorsement in the absence of Andrews candidature, Chichester-Clark was expected to win by a clear margin and the close result came as a great surprise.  O'Neill voted for his distant cousin, and also used his casting vote in his favour. It has been said that he favoured Chichester-Clark not due to their distant family links, but as Faulkner had been stabbing him in the back for longer.Walker, G, A History of the Ulster Unionist Party, 2004)"]}, {"page": "Independent Commission for the Location of Victims' Remains", "response": ["The current commissioners are Sir Kenneth Bloomfield, former head of the Northern Ireland Civil Service and former Northern Ireland Victims Commissioner, and Mr Frank Murray, former Secretary to the Government (Cabinet Secretary) and former Chairman of the Irish Public Appointments Service,ICLVR website who took over from John Wilson.Appointment of Commissioner of the Independent Commission for the Location of Victims' Remains Irish Govt. Justice, Equality and Law Reform websiteNew appointment to the Independent Commission for the Location of Victims' Remains  British Govt. NIO website  The appointment of Rosalie Flanagan as the new Commissioner was announced on 13 January 2021.Secretary of State announces appointment of new Commissioner for The Independent Commission for the Location of Victims Remains GOV.UK"]}, {"page": "1931 in Northern Ireland", "response": ["*15 April – Sir Kenneth Bloomfield, head of the Northern Ireland Civil Service and member of the Northern Ireland Victims Commission and the Independent Commission for the Location of Victims' Remains."]}, {"page": "Chronology of Provisional Irish Republican Army actions (1980–1989)", "response": ["* 12 September: the house of Sir Kenneth Bloomfield, the top civilian servant in Northern Ireland, located at Helen's Bay, County Down, was heavily damaged by two bombs planted by the IRA. Bloomfield, his wife and children were treated for shock.'Ulster hit by more bombs', United Press International, 12 September 1988"]}, {"page": "Neill's Hill railway station", "response": ["Sir Kenneth Bloomfield, former Head of the NI Civil Service quotes in his autobiography, \"Stormont in Crisis, A Memoir\" - \"... There too, 'the railway path' led alongside the line of the old Belfast and County Down Railway to the small station at Neill's Hill, a halt straight out of The Railway Children with level-crossing gates, stationmaster's house with neat beds of nasturtiums, and a malodorous subway in which early sexual encounters took place.\"  "]}, {"page": "Bloomfield (surname)", "response": ["* Kenneth Bloomfield (born 1931), former head of the Northern Ireland Civil Service"]}, {"page": "List of Honorary Fellows of St Peter's College, Oxford", "response": ["* Sir Kenneth Bloomfield KCB"]}, {"page": "Head of the Northern Ireland Civil Service", "response": ["* 1984–1991: Sir Kenneth Bloomfield"]}, {"page": "Kenneth Percy Bloomfield", "response": ["#REDIRECT Kenneth Bloomfield"]}]}}