{"wiki_id": "http://www.wikidata.org/entity/Q6386962", "itemLabel": "Kemistry", "itemDescription": "Drum and bass DJ, record producer (1963-1999)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kemistry", "wikipedia_page": {"main": "Valerie Olukemi A \"Kemi\" Olusanya (13 October 1963 – 25 April 1999), commonly known by her stage name Kemistry,  was a leading English drum and bass DJ of the early 1990s, half of duo Kemistry & Storm, and co-founder of the Metalheadz record label.", "link_mentions": [{"page": "Goldie", "response": ["By 1991, Price had become fascinated by the British breakbeat music scene when his girlfriend, DJ Kemistry, introduced him to the pioneering jungle and drum and bass producers Dennis \"Dego\" McFarlane and Mark \"Marc Mac\" Clair, known as 4hero. He went on to execute some design and A&R work for 4hero's Reinforced Records label.", "In the early 1990s, Price had a relationship with drum and bass artist Kemistry, who died in a car accident in 1999.Alister Morgan, \"Obituary: Kemi Olusanya\", The Independent, 6 May 1999. He was romantically involved with singer Björk for several years until their break-up in September 1996.", "* \"Kemistry V.I.P. / Your Sound\" (Remixes) (Razors Edge, 1997)"]}, {"page": "1999 in music", "response": ["**Kemi Olusanya (35), British drum and bass duo Kemistry & Storm (freak highway accident)"]}, {"page": "1963 in music", "response": ["*October 13 – Kemi Olusanya, English drum-and-bass musician (Kemistry & Storm) (d. 1999)"]}, {"page": "M3 motorway (Great Britain)", "response": ["*In the early morning of 25 April 1999, the drum and bass DJ and record producer known as Kemistry was killed on the M3 near Winchester by the steel body of a cat's eye, which had been dislodged by a van and flew through the windscreen of the following car in which she was a passenger. The coroner recorded a verdict of accidental death. A question was asked in the House of Lords about the safety of cat's eyes in light of the highly unusual incident, and Highways England conducted an investigation into the \"long-term integrity and performance\" of various types of road stud."]}, {"page": "List of people who died in traffic collisions", "response": ["|align=\"left\"| Kemistry"]}, {"page": "List of jungle and drum and bass artists", "response": ["* Kemistry", "* Kemistry & Storm"]}, {"page": "Cat's eye (road)", "response": ["On the morning of 25 April 1999 on the M3 motorway in Hampshire, England, a van dislodged the steel body of a cat's eye which flew through the windscreen of a following car and hit a passenger (the drum and bass DJ known as Kemistry) in the face, killing her instantly. The coroner recorded a verdict of accidental death. Investigators acknowledged that the cat's eye bodies occasionally came loose, but added that such an accident was previously unheard of. A question was asked in the House of Lords about the safety of cat's eyes in light of the incident, and the Highways Agency conducted an investigation into the \"long-term integrity and performance\" of various types of road stud."]}, {"page": "List of unusual deaths", "response": ["!Kemistry"]}, {"page": "List of female electronic musicians", "response": ["* Valerie Olukemi A \"Kemi\" Olusanya (Kemistry)"]}, {"page": "Kemi Olusanya", "response": ["#REDIRECT Kemistry"]}, {"page": "Kemistry & Storm", "response": ["Kemistry & Storm were an English drum and bass DJ and recording duo, composed of Kemistry (Valerie Olukemi A \"Kemi\" Olusanya) and Storm (Jayne Conneely). They were active in the 1990s. Along with Goldie, they founded the Metalheadz label in 1994.", "Appearing mainly on the club scene, recordings by the act include the mix album DJ-Kicks: Kemistry & Storm (1999). They were recognized for being \"some of the first women DJs to have a widely distributed album\" in a \"male-dominated genre of music\".", "Both Kemistry and Storm grew up in Kettering, where they met and became friends. They kept in touch as their lives diverged over the coming years, working as a make-up artist and in radiography respectively, and gave up their careers to begin DJing when both found themselves living in London in the early 1990s. They first started out on London pirate radio stations Touchdown and Defection FM.", "Along with Goldie, whom Kemistry had introduced to the drum and bass scene in the early years of the decade, they founded the Metalheadz record label in 1994. With Goldie, they led Metalheadz for two-and-a-half years before leaving the label. The success of their DJ-Kicks album brought them opportunities to DJ internationally and has been described as \"paving the way for other, younger, female DJs\".", "The duo's collaboration came to an end with the death of Kemistry in a traffic accident in the early morning of 25 April 1999, while returning from a Kemistry & Storm gig in Southampton. Jayne Conneely continued performing as DJ Storm."]}, {"page": "DJ Kemistry", "response": ["#REDIRECT Kemistry"]}, {"page": "The Queen's Award for Enterprise: International Trade (Export) (2005)", "response": ["*Kemistry of London EC2 for Broadcast design."]}, {"page": "Popular music of Birmingham", "response": ["Goldie was the first recognisable star of the genre of drum and bass, the first indigenously British form of dance music. Born to the north of Birmingham in Walsall and brought up in foster homes and local authority institutions across the West Midlands county, he spent his early adult life in various cities including Birmingham, London, New York City and Miami. He first built his reputation as a producer with a series of groundbreaking darkcore tracks in the early 1990s, including 1992's \"Terminator\", arguably the pivotal track of the entire scene. In 1992 he founded Metalheadz with fellow Birmingham-born DJ Kemistry and the following year released \"Angel\", the track which marked the start of the demise of the dark sound he had earlier epitomised, incorporating samples from Brian Eno and David Byrne and becoming the first track to successfully take hardcore in a more musical direction without losing its essence. In 1995 he took this fusion approach to its ultimate conclusion with the release of his debut album Timeless: an \"archive of overlapping sounds from Goldie's past: Jamaican dub, Brit-soul, Detroit techno, hip-hop, and developments in jungle/drum 'n' bass\", with Goldie himself crediting these eclectic musical tastes to his rootless Midlands upbringing: \"in one room a kid would be playing Steel Pulse, while through the wall someone else had a Japan record on and another guy would be spinning Human League.\" Timeless was the first drum and bass record to achieve substantial mainstream success. Moving the genre from hardcore's low-brow populism into more progressive musical territory, it was \"almost universally hailed as a masterpiece upon release\" and left Goldie as the genre's unofficial figurehead, for the first time establishing an English figure with a profile that could match that of the stars of American hip-hop."]}, {"page": "Deaths in April 1999", "response": ["*Kemistry, 35, English drum and bass DJ and co-founder of record label Metalheadz, road accident."]}, {"page": "List of deaths in rock and roll (1990s)", "response": ["| Kemistry Kemistry & Storm || style=\"text-align:center;\"|35 || April 25, 1999 || Winchester, Hampshire, England || Traffic accident"]}]}}