{"wiki_id": "http://www.wikidata.org/entity/Q6390179", "itemLabel": "Kenneth Hamilton", "itemDescription": "British pianist", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenneth_Hamilton", "wikipedia_page": {"main": "Kenneth Hamilton (born 1963) is a Scottish pianist and writer, known for virtuoso performances of Romantic music, especially Liszt, Alkan and Busoni.  Hamilton's playing is characterized by spontaneity, technical assurance, and a wide variety of keyboard colour. He was a student of Alexa Maxwell, Lawrence Glover and the Scottish composer-pianist Ronald Stevenson, whose music he champions.Hamilton lectures on music. He was awarded a doctorate by Balliol College, Oxford, for a dissertation on the music of Liszt. He is the author of Liszt: Sonata in B-minor (Cambridge University Press, 1996) and the editor of The Cambridge Companion to Liszt (Cambridge University Press, 2005). His widely publicised latest book, After the Golden Age: Romantic Pianism and Modern Performance (Oxford University Press, 2008) discusses the differences between the past and the present in concert life and playing styles. Its conclusions have stimulated extensive debate in the musical world.", "link_mentions": [{"page": "Frédéric Chopin", "response": ["The preludes, many of which are very brief (some consisting of simple statements and developments of a single theme or figure), were described by Schumann as \"the beginnings of studies\". Inspired by J.S. Bach's The Well-Tempered Clavier, Chopin's preludes move up the circle of fifths (rather than Bach's chromatic scale sequence) to create a prelude in each major and minor tonality. The preludes were perhaps not intended to be played as a group, and may even have been used by him and later pianists as generic preludes to others of his pieces, or even to music by other composers. This is suggested by Kenneth Hamilton, who has noted a 1922 recording by Ferruccio Busoni in which the Prelude Op. 28 No. 7 is followed by the Étude Op. 10 No. 5."]}, {"page": "Ferruccio Busoni", "response": ["These transcriptions go beyond literal reproduction of the music for piano and often involve substantial recreation, although never straying from the original rhythmic outlines, melody notes and harmony.Leichentritt (1914), p. 88. This is in line with Busoni's own concept that the performing artist should be free to intuit and communicate his divination of the composer's intentions.Busoni (1907), p. 11. Busoni adds tempo markings, articulation and phrase markings, dynamics and metronome markings to the originals, as well as extensive performance suggestions. In his edition of Bach's Goldberg Variations (BV B 35), for example, he suggests cutting eight of the variations for a \"concert performance\", as well as substantially rewriting many sections. Kenneth Hamilton comments that \"the last four variations are rewritten as a free fantasy in a pianistic style which owes far more to Busoni than to Bach.\"Hamilton (1998), pp. 66–67."]}, {"page": "Charles-Valentin Alkan", "response": ["thumb|upright=1|Extract from the second movement of the sonata Les quatre âges Op. 33, displaying one of Alkan's most complex musical textures \"Like ... Chopin\", writes pianist and academic Kenneth Hamilton, \"Alkan's musical output was centred almost exclusively on the piano\".Hamilton, Kenneth, \"Alkan, (Charles-)Valentin[Valentin Morhange\"], Oxford Companion to Music online, accessed 20 July 2013.  Some of his music requires extreme technical virtuosity, clearly reflecting his own abilities, often calling for great velocity, enormous leaps at speed, long stretches of fast repeated notes, and the maintenance of widely spaced contrapuntal lines.Smith (2000) II, 17, 245. The illustration (right) from the Grande sonate is analysed by Smith as \"six parts in invertible counterpoint, plus two extra voices and three doublings – eleven parts in all.\"Smith (2000) II,75. Some typical musical devices, such as a sudden explosive final chord following a quiet passage, were established at an early stage in Alkan's compositions.Smith (2000) II, 18.", "In the same year appeared the Sonate de concert, Op. 47, for cello and piano, \"among the most difficult and ambitious in the romantic repertoire ... anticipating Mahler in its juxtaposition of the sublime and the trivial\". In the opinion of the musicologist Brigitte François-Sappey, its four movements again show an anticipation of progressive tonality, each ascending by a major third.Francois-Sappey and Luguenot (2013), 45 (quotation translated from the original French). Other anticipations of Mahler (who was born in 1860) can be found in the two \"military\" Op. 50 piano studies of 1859 Capriccio alla soldatesca and Le tambour bat aux champs (The drum beats the retreat),Francois-Sappey and Luguenot (2013), 50. as well as in certain of the miniatures of the 1861 Esquisses, Op. 63.Smith (2000) II, 47. The bizarre and unclassifiable Marcia funebre, sulla morte d'un Pappagallo (Funeral march on the death of a parrot, 1859), for three oboes, bassoon and voices, described by Kenneth Hamilton as \"Monty-Pythonesque\",Liang, Chang Tou, \"Kenneth Hamilton on the Cult of Alkan (Part 1)\", Pianomania, accessed 15 May 2013. is also of this period."]}, {"page": "Fantasy on Themes from Mozart's Figaro and Don Giovanni", "response": ["Kenneth Hamilton, in his review of Howard's later edition, notes that \"for reasons of personal psychology that we can only guess at, [Busoni] chose to give the impression in his preface that he had expanded, rather than drastically cut, Liszt's manuscript.\"Hamilton 1998, p. 316. By contrast, the Busoni scholar Larry Sitsky maintains that it is not certain that Liszt intended to perform the music from the two operas together. Instead, since the manuscript pages are unnumbered, it is possible that pages from two separate works were at some point in time placed together in the Weimar holdings. \"Since the transition to and from the Don Giovanni music is in C major, the 15 pages of manuscript can be played or omitted without any damage to the harmonic scheme. The Don Giovanni paraphrase begins on a fresh page and at no time are motives from both operas seen on the same page of Liszt's manuscript.\"Sitsky 2009, p. 238.", "It was not until much later in the twentieth century that anyone compared Busoni's version to the manuscript. In 1991 the Scottish pianist and writer Kenneth Hamilton was the first to publish the results of such a comparison.Hamilton 1991. Later, after learning of Hamilton's findings, the Australian-born pianist, and noted performer of Liszt's music, Leslie Howard, attempted to reconstruct the work as he believed Liszt intended, recording, and in 1997 publishing, the newly-recast work. His intention was to \"publish... the whole of Liszt's Fantasy with an authenticity of text, supplying and clearly indicating the few bars... which are necessary to render the work performable.\"Howard 1997, p. IV."]}, {"page": "Grande sonate 'Les quatre âges'", "response": ["The originality of this work, together with some structural similarities such as those referred to above, have led writers such as Ronald Smith, Kenneth Hamilton and Jack Gibbons\"Alkan Illustrated\", accessed 24 November 2013. to surmise that Liszt may have known this work before writing his own Sonata in B minor. However, there is no evidence that Liszt (or Alkan himself, for that matter) ever played the 'Grande sonate'Smith believes he himself gave the first complete public performance, at York University in August 1973. Smith (2000),67. in public or private, although the two pianists certainly knew each other in Paris and were aware of each other's work. However, the publication of the 'Grande sonate' was unfortunate in its timing; in early 1848 the revolution emptied the capital of musical life, and Alkan's failure to obtain a professorship at the Paris Conservatoire later in the year led to his withdrawal from the concert scene. Liszt also left Paris for Weimar. For these reasons, consideration of Alkan's influence on Liszt's Sonata must remain speculative."]}, {"page": "Hamilton (name)", "response": ["*Kenneth Hamilton Scottish pianist"]}, {"page": "Fantasy and Fugue on the chorale \"Ad nos, ad salutarem undam\"", "response": ["Ferruccio Busoni prepared a piano arrangement which was published in 1897 by Breitkopf & Härtel.Kenneth Hamilton: The Cambridge Companion to Liszt, 2005. Page 77. Alan Walker, Liszt's biographer, said that it \"represents one of the pinnacles of twentieth-century virtuosity.\"Alan Walker: Franz Liszt, 1987. Volume 2. Page 161. Liszt at least once performed his own piano transcription, of which Walter Bache, his student, made an account in 1862. Liszt never seems to have notated such a version."]}, {"page": "Walter Bache", "response": ["* Baker, James M., \"A Survey of the Late Piano Works.\" In The Cambridge Companion to Liszt, ed. Kenneth Hamilton (Cambridge and New York: Cambridge University Press, 2005).  (paperback)."]}, {"page": "Hamilton, Kenneth", "response": ["#REDIRECT Kenneth Hamilton "]}, {"page": "List of Cambridge Companions to Music", "response": ["| data-sort-value=\"Hamilton, Kenneth\" | Kenneth Hamilton, Katharine Ellis, Alexander Rehding, James Deaville, James M. Baker, Anna Celenza, Monika Hennemann, Reeves Shulstad, Dolores Pesce", "|data-sort-value=\"Rowland, David\" | David Rowland, Kenneth Hamilton, Robert Philip, Bernard Richardson, Dorothy de Val, Cyril Ehrlich, J. Barrie Jones, Mervyn Cooke, Brian Priestley"]}, {"page": "Three-hand effect", "response": ["Kenneth Hamilton comments that \"[Thalberg's] inheritance is still with us today, as anyone will testify who has ever heard a cocktail pianist wreath a slow popular tune in elegant arpeggios.\""]}, {"page": "Lauren Zhang", "response": ["Born in Albuquerque, New Mexico, Lauren Zhang started to play the piano under Madeline Ignazito when she was four years old, and the violin under Terry Coulton at the age of six in Illinois. In 2010, when their family moved to England, Lauren Zhang joined the Junior Department at the Royal Birmingham Conservatoire and initially studied piano with Rebeca Omordia. Since 2011, she has been studying the piano under Dr Robert Markham who was a finalist at the Tchaikovsky International Competition in Moscow in 1994, and the piano class winner of the BBC Young Musician of the Year Competition in 1986. Zhang has also studied the violin at the Conservatoire under Sam Mason. In addition, Lauren Zhang has received advice and participated in masterclasses with Kenneth Hamilton, Lan Mi, Fabio Bidini, Peter Donohoe, Kalman Drafi, Philip Martin, Pascal Nemirovski, Menahem Pressler and John Thwaites. Lauren also receives guidance from Christopher Elton. She achieved her fellowship diploma in piano performance at the age of 13, having completed her licentiate diploma the year before. She also achieved her licentiate diploma in violin at the age of 12. Interested in chamber music, she plays in ensembles."]}]}}