{"wiki_id": "http://www.wikidata.org/entity/Q6396445", "itemLabel": "Kevin Harper", "itemDescription": "football (soccer) player", "wikipedia_url": "https://en.wikipedia.org/wiki/Kevin_Harper", "wikipedia_page": {"main": "Kevin Patrick Harper (born 15 January 1976) is a Scottish football player and coach. Harper played as a winger for Hibernian, Derby County, Walsall, Portsmouth, Norwich City, Leicester City, Stoke City, Carlisle United and Dunfermline Athletic. He managed Scottish League Two side Albion Rovers from November 2018 to May 2020.", "link_mentions": [{"page": "Albion Rovers F.C.", "response": ["Rovers currently play in Scottish League Two. In recent seasons they have flirted with slipping into the League Two play-offs; they made a remarkable escape under manager Kevin Harper in 2018–19 and were again in 9th place (one place above the play-off drop zone) when football was suspended in March 2020 due to Covid 19. Harper left the club after two years in May 2020 and was replaced by Brain Reid, whose playing career covered Morton, Rangers, Burnley, Blackpool, Dunfermline, Queen Of the South and Ayr United. He also won two caps for Scotland Under 21s.", "*Kevin Harper (2018–2020)"]}, {"page": "Possilpark", "response": ["*Kevin Harper, footballer"]}, {"page": "Mark Rivers", "response": ["Four goals in four league games at the start of the 2003-04 season established him as the Canaries' leading scorer until injury again forced him out of the side. When fit, he could not displace either loan signing Kevin Harper or youngster Ian Henderson. Rumours from Carrow Road also suggested a bust-up between Rivers and manager Nigel Worthington. Unable to get a first team place, Rivers made it clear that he needed first team football. Crewe offered to take him on loan in January 2004 but Norwich refused and he returned to the Norwich team in the 1–0 defeat to Bradford on 10 January 2004, albeit as a substitute."]}, {"page": "Harper (name)", "response": ["*Kevin Harper (born 1976), Scottish footballer"]}, {"page": "2007–08 Dunfermline Athletic F.C. season", "response": ["|rowspan=\"3\"|3||MF||||Kevin Harper||4||4||0||0||0||0", "| Kevin Harper "]}, {"page": "Gary Mackay", "response": ["Kevin Harper alleged that he had been racially abused by Mackay during a match in November 1996. The Scottish Football Association failed to investigate the incident.Ideally suited to face up to racism Why the boy from Possil is mystified over Scots gameAccentuate the negative; The head-in-the-sand attitude of Scottish Mackay has since been involved in work for 'Show Racism the Red Card' which primarily aims to prevent racism in football.Show Racism the Red Card ."]}, {"page": "Black Scottish people", "response": ["*Kevin Harper"]}, {"page": "2007–08 Stoke City F.C. season", "response": ["| Kevin Harper"]}, {"page": "2009–10 Dunfermline Athletic F.C. season", "response": ["At the end of the 2008–09 season, the Pars decided to allow 3 of their most senior players to leave the club. Scott Wilson teamed up with former Dunfermline captain and manager of North Queensland Fury Ian Ferguson in Australia, Greg Shields moved to America to join USL First Division side Carolina RailHawks and captain Scott Thomson was released on a free transfer. Goalkeeper Paul Gallacher was allowed to move up a division to the SPL to join St Mirren for an undisclosed fee. Kevin Harper, Stuart Dearden, Calum Reidford and Iain Williamson were all released from their contracts."]}, {"page": "1993–94 MetJHL season", "response": ["*Rd 10 #250\tKevin Harper -\tSt. Louis Blues\t(Wexford Raiders)"]}, {"page": "2004–05 Stoke City F.C. season", "response": ["|align=\"left\"|11||align=\"left\"|MF||align=\"left\"| Kevin Harper"]}, {"page": "2005–06 Stoke City F.C. season", "response": ["|align=\"left\"|11||align=\"left\"|MF||align=\"left\"| Kevin Harper"]}]}}