{"wiki_id": "http://www.wikidata.org/entity/Q6397663", "itemLabel": "Kevin Tully", "itemDescription": "British footballer (born 1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kevin_Tully", "wikipedia_page": {"main": "Kevin Francis Tully (born 18 December 1952) is an English former footballer. A Left winger, he made 164 league appearances in a nine-year career in the Football League.\nHe began his career with non-league Prestwich Heys, before signing with Blackpool in 1972. He transferred to Cambridge United the following year, before joining Crewe Alexandra in 1975. After three seasons with the \"Railwaymen\" he was traded to Port Vale in a player-exchange deal in October 1978. He left the club in February 1980, and then joined Bury via Chorley, before heading into non-league football with Barrow and Witton Albion in 1981.", "link_mentions": [{"page": "Dennis Butler", "response": ["Following his retirement as a player, he coached at Rochdale and Bury. He was made assistant manager at Port Vale under Bobby Smith in November 1977. After Smith's departure to Swindon Town, he became manager for the 1978–79 season. The \"Valiants\" finished 16th in the Fourth Division and later he left by mutual consent in August 1979. He had signed popular player Bernie Wright from Bradford City for £9,000, however most of his big money signings had torrid times at Vale Park. He signed right-back Neil Wilkinson (free), Ken Todd (a club-record £37,000 signing despite only having made a handful of appearances for Wolverhampton Wanderers), Gerry Keenan (£15,000), Felix Healy (£8,000), Kevin Tully (£3,000 plus Neil Wilkinson), Andy Proudlove (£1,000), Peter Farrell (breaking the club-record again at £40,000), and Bob Delgado (£30,000). To finance these signings, he sold John Froggatt (£8,000), Mick Moore (£2,000), Terry Bailey (£2,000), Ken Beamish (£35,000), and John Ridley (£55,000). After his team were booed he called the fans 'a bunch of yobs'. Vale recorded a £52,000 loss despite a remarkable £225,000 income from the club's commercial department. Butler's transfer dealings had lost the club £36,000, whilst wages more than doubled from £113,000 to £259,000. After leaving Burslem, Butler then reunited with Bobby Smith at Swindon, becoming the first team coach before retiring from football in 1980."]}, {"page": "Neil Wilkinson (footballer)", "response": ["Wilkinson began his career with Blackburn Rovers, beginning his apprenticeship in August 1971. He made his first-team debut in the FA Cup at Lincoln City on 18 November 1972. He turned professional in February 1973. Blackburn finished third in the Third Division in 1972–73 under the stewardship of Ken Furphy. They dropped to 13th in 1973–74, before new boss Gordon Lee guided them to promotion as champions in 1974–75. Jim Smith then took charge at Ewood Park, as Rovers retained their Second Division status with mid-table finishes in 1975–76 and 1976–77. Wilkinson was only a first-team regular for part of the 1975–76 season when Mick Heaton was out injured and was behind Derek Fazackerley and Kevin Hird in the pecking order during the 1976–77 campaign. Wilkinson then spent a brief time in South Africa, before he returned to England to join Fourth Division club Port Vale in June 1978. He played nine competitive games for Dennis Butler's \"Valiants\" in 1978–79, before being transferred to Warwick Rimmer's Crewe Alexandra, along with £3,000, in exchange for Kevin Tully in October 1978. The \"Railwaymen\" finished bottom of the Football League in 1978–79, and under Tony Waddington's stewardship had to re-apply for re-election again in 1979–80, before rising to 18th place in 1980–81."]}, {"page": "Kevin Francis Tully", "response": ["#REDIRECT Kevin Tully"]}, {"page": "List of people with surname Tully", "response": ["* Kevin Tully (born 1952), English footballer"]}, {"page": "1978–79 Port Vale F.C. season", "response": ["The season opened with just two victories in eleven league games, as both Todd and keeper John Connaughton were sidelined with injuries. The two wins came away from home, 5–1 over rivals Crewe Alexandra at Gresty Road (Wright scoring a hat-trick) and 3–1 at Doncaster Rovers at the Keepmoat Stadium. Butler then threw himself into the transfer market, selling John Froggatt to Northampton Town for £8,000, and then Mick Moore and Terry Bailey to Wigan Athletic and Northwich Victoria respectively, both for £2,000. Another 'shrewd piece of business' came when star forward Ken Beamish was sold to Bury for £35,000, whilst Gerry Keenan moved the other way for £15,000. In October, Felix Healy was signed from Finn Harps for £8,000, and Neil Wilkinson and £3,000 were traded to Crewe in exchange for outside-right Kevin Tully. Winning five games in a sequence of eight, Todd was still a disappointment to fans, who began getting 'on his back'. Butler's signings did not stop however, and instead he sold John Ridley to Leicester City for a club-record £55,000. He then signed Andy Proudlove from Buxton for £1,000 – despite interest from Stafford Rangers. Then in came midfielder Peter Farrell from Bury for a new club-record £40,000. They ended their club-record streaks of 42 away games without keeping a clean sheet on 30 September, and of twelve home games without a win on 21 October.", "|align=\"left\"|MF||align=\"left\"| Kevin Tully", "|12||MF||||Kevin Tully||1||0||0||1", "| October 1978 || MF ||  || Kevin Tully || Crewe Alexandra || Exchange || "]}, {"page": "1979–80 Port Vale F.C. season", "response": ["On the financial side, a loss of £82,069 was recorded. The financial picture led Chairman Arthur McPherson to describe 1979–80 as 'probably the worst season in the club's history'. Leaving the club at the end of the season were: Bernie Wright (Kidderminster Harriers); Bill Bentley (Stafford Rangers); Terry Owen (Northwich Victoria); Bob Delgado (Miami Americans); and Kevin Tully (Chorley). Several players remained in Burslem on virtue of having extended contracts.", "|align=\"left\"|MF||align=\"left\"| Kevin Tully", "|–||MF||||Kevin Tully||1||0||0||1", "| February 1980 || MF ||  || Kevin Tully || Chorley || Released || "]}, {"page": "1974–75 Cambridge United F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Kevin Tully"]}]}}