{"wiki_id": "http://www.wikidata.org/entity/Q6390649", "itemLabel": "Kenneth Rowntree", "itemDescription": "British artist (1915-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenneth_Rowntree", "wikipedia_page": {"main": "Kenneth Rowntree (14 March 1915 – 21 February 1997) was a British artist.", "link_mentions": [{"page": "Alan Hodgkin", "response": ["Alan started his education at The Downs School where his contemporaries included future scientists Frederick Sanger, Alec Bangham, \"neither outstandingly brilliant at school\" according to Hodgkin, as well as future artists Lawrence Gowing and Kenneth Rowntree. After the Downs School, he went on to Gresham's School where he overlapped with future composer Benjamin Britten as well as Maury Meiklejohn. He ended up receiving a scholarship at Trinity College, Cambridge in Botany, Zoology and Chemistry."]}, {"page": "Rowntree", "response": ["*Kenneth Rowntree (1915–1997), British artist"]}, {"page": "Maurice Feild", "response": ["He began his career at the Downs School in 1928.  He was a colleague and friend of W. H. Auden in the early 1930s. In 1937 he was an early supporter of the Euston Road School. He encouraged his pupils to paint with direct sincerity in the open air, and the many English painters who learned from him included Kenneth Rowntree, Lawrence Gowing, Andrew Forge, Patrick George, Anthony Hill, Anthony Fry, and Francis Hoyland."]}, {"page": "Fry Art Gallery", "response": ["The Fry Art Gallery is home to the North West Essex Collection, a set of more than 3,000 works by diverse, nationally important artists who have lived or worked in the area. The collection includes paintings, prints, books, artists' scrapbooks, ceramics, wallpapers and decorative designs. There is an emphasis on artists who worked in and around Great Bardfield in the middle of the twentieth century, including Edward Bawden, Eric Ravilious, Tirzah Garwood, John Aldridge, Sheila Robinson, Bernard Cheese, Walter Hoyle, Michael Rothenstein, Kenneth Rowntree, George Chapman and Marianne Straub. Artists in the collection with a connection to the wider area include Michael Ayrton, John Bellany, Robert Colquhoun, Robert MacBryde, Grayson Perry and Keith Vaughan."]}, {"page": "Great Bardfield Artists", "response": ["The principal artists who lived there between 1930 and 1970 were John Aldridge RA, Edward Bawden, George Chapman, Stanley Clifford-Smith, Audrey Cruddas, Walter Hoyle,  Eric Ravilious,  Sheila Robinson, Michael Rothenstein, Kenneth Rowntree and Marianne Straub. Other artists associated with the group include Duffy Ayers, John Bolam, Bernard Cheese, Tirzah Garwood, Joan Glass, David Low and Laurence Scarfe. Great Bardfield Artists were diverse in style but shared a love for figurative art, making the group distinct from the better known St Ives School of artists in St Ives, Cornwall, who, after the war, were chiefly dominated by abstractionists. "]}, {"page": "Michael Rothenstein", "response": ["At Great Bardfield there was a small resident art community that included John Aldridge, Edward Bawden and Kenneth Rowntree. In the early 1950s several more artists (including George Chapman, Stanley Clifford-Smith, Audrey Cruddas and Marianne Straub) moved to the village making it one of the most artistically creative spots in Britain. Rothenstein took an important role in organising the Great Bardfield Artists exhibitions during the 1950s. Thanks to his contacts in the art world (his older brother, Sir John Rothenstein, was the current head of the Tate Gallery) these exhibitions became nationally known and attracted thousands of visitors."]}, {"page": "Peter Yates (architect)", "response": ["Peter's main influences were Le Corbusier and Berthold Lubetkin. Other influences were though his friendships with Austin Wright, Kenneth Rowntree and Diana Rowntree, Dennis Flanders and others."]}, {"page": "John Elwyn", "response": ["In 1953 he moved to Winchester, where he taught at the Winchester School of Art. In the same year he made his first illustrations for the Radio Times. Paintings of farm life in Cardiganshire occupied him between 1955 and 1960. In 1956 he was awarded the Gold Medal for Fine Art at the National Eisteddfod in Aberdare. His illustrations for Shell Guides, commissioned by Kenneth Rowntree, were published in 1958."]}, {"page": "War Artists' Advisory Committee", "response": ["* Kenneth Rowntree "]}, {"page": "James Bateman (artist)", "response": ["At the start of the Second World War Bateman worked as a Camouflage Officer at the Civil Defence Camouflage Establishment for the Ministry of Home Security in Leamington Spa. He was unhappy with the work and resigned, in March 1940, when offered a commission for four paintings on land work subjects by the War Artists' Advisory Committee. For the commission he visited farms in Cambridge, St. Albans and Reading and he completed three pictures, including one on the Women's Land Army, and was offered a further commission for two production subjects at Shoeburyness but he declined due to other commitments and the commission went to Kenneth Rowntree."]}, {"page": "Diana Rowntree", "response": ["Her husband was painter Kenneth Rowntree, whom she married 1939."]}, {"page": "Deaths in February 1997", "response": ["*Kenneth Rowntree, 81, British artist."]}, {"page": "Scarborough Art Gallery", "response": ["The idea that the Scarborough Art Gallery should become a repository for the Printmakers Council archive was first proposed in the early 1990s and the first deposition arrived in 1992. In December 2016 the Printmakers Council agreed to deposit new material on a biennial basis. The range of modern prints includes works by John Piper, Elizabeth Blackadder, Ossip Zadkine and Kenneth Rowntree. The collection also contains posters centred on the town of Scarborough, designed by a variety of artists for the London and North Eastern Railway."]}]}}