{"wiki_id": "http://www.wikidata.org/entity/Q6396380", "itemLabel": "Kevin Gorman", "itemDescription": "British DJ", "wikipedia_url": "https://en.wikipedia.org/wiki/Kevin_Gorman", "wikipedia_page": {"main": "Kevin Gorman is a British DJ, musician and remixer best known as Adesse Versions. His music has appeared on labels Ostgut Ton, Numbers, Ninja Tunes, Cocoon Recordings, Ed Banger and others.  His remix credits include the 1991 classic R&S release \"Vamp\" by Outlander, Leftfield for their Leftism album, Blossoms and Dita Von Teese.  From 2015 to 2016 Gorman ran an Adesse Versions show monthly on London's Rinse FMGorman, originally from Chester, England, first came to attention with a 2006 demo for DJ Hell, featuring track DMX, which featured heavy usage of the Beat Repeat feature of Ableton Live. This signing led DJ Hell to request a full album from Gorman for International Deejay Gigolo Records.In March 2009 he launched his project 'Elements', a series of singles featuring the unique aspect of releasing all the component samples of the music alongside the original tracks, as well as a large collection of DJ tools, loops and alternate mixes. The project was released on Mikrowave, Gorman's own imprint. Also on Mikrowave, Gorman released the single \"Seven Eight Nine\", featuring a live version from the Berlin club the Berghain.In 2010, Gorman provided music for the soundtrack to the film Shiver, a documentary concerning the controversial practice of shark finning. These Steve Reich inspired pieces became Frequency Phase Parts 1–3, released in 2012 on the Stroboscopic Artefacts label.", "link_mentions": [{"page": "International DeeJay Gigolo Records", "response": ["*Kevin Gorman"]}, {"page": "Chemistry Lock", "response": ["Chemistry Lock is the debut album by English electronic musician Kevin Gorman. The music combines elements of techno and house and, as Gorman describes it, he takes most inspiration from the raw, groove led music of Chicago, New York and Detroit.Official Kevin Gorman Myspace site The album was released in December 2007 on International DJ Gigolo."]}]}}