{"wiki_id": "http://www.wikidata.org/entity/Q6390369", "itemLabel": "Kenneth Leech", "itemDescription": "British priest", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenneth_Leech", "wikipedia_page": {"main": "Kenneth Leech (15 June 1939 – 12 September 2015), also known as Ken Leech, was an English Anglican priest and Christian socialist in the Anglo-Catholic tradition.", "link_mentions": [{"page": "Julian of Norwich", "response": ["According to several commentators, including Santha Bhattacharji in the Oxford Dictionary of National Biography, Julian's discussion of the maternal nature of God suggests that she knew of motherhood from her own experience of bringing up children. As plague epidemics were rampant during the 14th century, it has been suggested that Julian may have lost her own family as a result. By becoming an anchoress she would have been kept in quarantine away from the rest of the population of Norwich. However, nothing in Julian's writings provides any indication of the plagues, religious conflict, or civil insurrection that occurred in the city during her lifetime. Kenneth Leech and Sister Benedicta Ward, the joint authors of Julian Reconsidered (1988), concluded that she was a young widowed mother and never a nun. They based their opinion on a dearth of references about her occupation in life and a lack of evidence to connect her with Carrow Abbey, which would have honoured her and buried her in the grounds had she been strongly connected with the priory."]}, {"page": "Rowan Williams", "response": ["His interest in and involvement with social issues is longstanding. While chaplain of Clare College, Cambridge, Williams took part in anti-nuclear demonstrations at United States bases. In 1985, he was arrested for singing psalms as part of a protest organised by the Campaign for Nuclear Disarmament at Lakenheath, an American air base in Suffolk; his fine was paid by his college. At this time he was a member of the left-wing Anglo-Catholic Jubilee Group headed by Kenneth Leech and he collaborated with Leech in a number of publications including the anthology of essays to commemorate the 150th anniversary of the Oxford Movement entitled Essays Catholic and Radical in 1983."]}, {"page": "Christian socialism", "response": ["* Kenneth Leech, English Anglican priest and theologian"]}, {"page": "St Stephen's House, Oxford", "response": ["* Kenneth Leech – priest and Christian socialist"]}, {"page": "Runnymede Trust", "response": ["* Kenneth Leech, 1987–1991"]}, {"page": "Stewart Headlam", "response": ["In spite of Headlam's resistance to the term, scholars characterise the Guild of St Matthew as \"socialist\". Kenneth Leech says that the Guild was \"the first explicitly socialist group in Britain\" and Peter d'Alroy Jones describes the Guild as \"the pioneer Christian socialist society of the revival period in Britain.\""]}, {"page": "St Anne's Church, Soho", "response": ["Despite the lack of a building at that time, from 1941 to 1958 the St. Anne Society under Father Patrick McLaughlin encouraged links between the literary world and the Church of England, with members such as Fr Gilbert Shaw, J. C. Winnington-Ingram, Charles Williams, Agatha Christie, T. S. Eliot, Fr Max Petitpierre, Dom Gregory Dix, Arnold Bennett, C. S. Lewis and the churchwarden Rose Macaulay. Continuing the work of the church's 18th and 19th century philanthropic rectors, in the 20th and 21st centuries the \"Vestry of St Anne's\" (now called the Parochial Church Council) has been active in social work with London's poor and homeless (Kenneth Leech founded the charity Centrepoint in St. Anne's House's basement in December 1969 whilst he was assistant priest at St Anne's and it remains based at the church). The Church is currently thriving as a church community and as venue for many local community and charitable events and meetings; it also houses the Soho Society, the archives of MoSoho (the Museum of Soho) and (from June 2016) anti-homophobic bullying charity Diversity Role Models. To celebrate the 25th anniversary of the rebuilding of the church a redesigned entrance on Dean Street was unrevealed on 8 December 2016."]}, {"page": "Centrepoint (charity)", "response": ["The charity was founded by the Anglo-Catholic socialist priest Kenneth Leech and set up its first shelter in a Soho church on 16 December 1969."]}, {"page": "Kenneth leech", "response": ["#REDIRECT Kenneth Leech "]}, {"page": "List of people associated with the University of London", "response": ["* Kenneth Leech – priest (KCL)"]}, {"page": "David Nicholls (theologian)", "response": ["*David Nicholls, 'The Politics of Dr Norman', in Kenneth Leech, ed., Christianity Reinterpreted (London: n.p., 1979)", "*David Nicholls, 'Stepping out of Babylon: Sin, Salvation & Social Transformation in Christian Tradition' and 'Great Expectations: Christian Hope and Marxist Hope', in Kenneth Leech and Rowan Williams, eds, Essays Catholic and Radical: a Jubilee Group Symposium for the 150th Anniversary of the Beginning of the Oxford Movement 1833-1983 (London: Bowerdean Press, 1983)"]}, {"page": "Anglican doctrine", "response": ["* Kenneth Leech"]}, {"page": "List of alumni of King's College London", "response": ["*Kenneth Leech – priest"]}, {"page": "1981 England riots", "response": ["The first disturbances began in Brixton over the weekend of 10–12 April 1981, and were followed in July by a series of similar disturbances in more than 35 cities and towns, especially Liverpool. In London, these included Dalston, Stoke Newington, Clapham, Hounslow and Acton. Kenneth Leech, the Race Relations Field Officer of the Church of England's Board for Social Responsibility, noted \"Here these were not race riots – riots between races. Rather the conflict was with police as symbols of white authority, with state racism and criminalisation of black communities\".Kenneth Leech Struggle in Babylon (Sheldon Press, 1988)."]}, {"page": "Centre for Theology and Public Issues", "response": ["* The Radical Anglo-Catholic Social Vision, Kenneth Leech, 1989. (Google Books)"]}, {"page": "Stephen Abrams", "response": ["SOMA was an informal organization when the advertisement appeared. Later, it was incorporated as the Soma Research Association, Ltd. Apart from Abrams, directors included Francis Crick, four psychiatrists: Professor Norman Zinberg of Harvard, Dr. Anthony Storr, Dr. R. D. Laing,  and  Dr. David Cooper. Other directors were The Revd. Kenneth Leech, of the Church of England; and anthropologist Francis Huxley."]}, {"page": "St Matthew's, Bethnal Green", "response": ["*1974-79 Kenneth Leech"]}, {"page": "2015 in the United Kingdom", "response": ["**Kenneth Leech, 76, Anglican priest and theologian, founded Centrepoint."]}, {"page": "Guild of St Matthew", "response": ["The Guild of St Matthew was an English high-church Christian socialist association led by Stewart Headlam from its establishment in Bethnal Green on 29 June 1877 when Headlam was Curate at St Matthew's to its dissolution in 1909. While the guild never had a membership of more than about 400 people, it was \"the pioneer Christian socialist society of the revival period in Britain\", breaking the ground for other Christian socialist organisations yet to come, such as the Christian Social Union. Kenneth Leech described it as \"the first explicitly socialist group in Britain\". For many years, it published the periodical The Church Reformer."]}, {"page": "Deaths in September 2015", "response": ["*Kenneth Leech, 76, British Anglican priest and theologian, founded Centrepoint.In Memoriam Kenneth Leech"]}, {"page": "Leech (surname)", "response": ["* Kenneth Leech (born 1939), Anglican priest and Christian socialist"]}, {"page": "John Groser", "response": ["St John Beverley Groser  (23 June 1890 – 19 March 1966) was an English Anglican priest and prominent Christian socialist. Hannen Swaffer described him as \"the best-known priest in the East End [of London]\" and Kenneth Leech wrote that he was \"one of the most significant Christian socialist figures in twentieth-century Britain\"."]}, {"page": "St Clement's Church, Notting Dale", "response": ["* Kenneth Leech, honorary assistant curate from 1982 to 1988'LEECH, Rev. Kenneth', Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2016; online edn, Oxford University Press, 2016; online edn, April 2016 accessed 14 June 2017"]}, {"page": "Ken Leech", "response": ["#REDIRECT Kenneth Leech"]}, {"page": "Subversive Orthodoxy", "response": ["#REDIRECT Kenneth Leech"]}]}}