{"wiki_id": "http://www.wikidata.org/entity/Q6397559", "itemLabel": "Kevin Stoney", "itemDescription": "British actor (1921-2008)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kevin_Stoney", "wikipedia_page": {"main": "Kevin Stoney (22 January 1921 – 22 January 2008) was an English actor. He was best known for his television roles, in which he became familiar for his \"portrayal of establishment types\".During the Second World War, Stoney served with the Royal Air Force. On television, he appeared in three serials of the science fiction series Doctor Who over a period of ten years, playing Mavic Chen in The Daleks' Master Plan (1965), Tobias Vaughn in The Invasion (1968) and Tyrum in Revenge of the Cybermen (1975). Stoney also appeared in two episodes of another BBC science fiction series, Blake's 7, playing Councillor Joban in the episode Hostage and Ardus in the episode Animals. He also played the astrologer Thrasyllus in the 1976 BBC adaptation of I, Claudius, a role he had earlier played in Granada Television's 1969 series The Caesars.Other credits include: The Adventures of Robin Hood, The Saint, Danger Man, The Avengers, Dr. Finlay's Casebook, The Prisoner, Softly, Softly, Man in a Suitcase, The Troubleshooters, Doomwatch, Freewheelers, Z-Cars, The Tomorrow People, Ace of Wands, Special Branch, The Onedin Line, Fall of Eagles, Space: 1999, The New Avengers, Quatermass, Hammer House of Horror, Bergerac, All Creatures Great and Small, The Bill and in the highest-rated episode of Inspector Morse.In 1985, it was reported in the Doctor Who fan magazine DWB that Stoney had died at the age of 64, but in 1987 he made an appearance at a Doctor Who convention to prove he was very much alive, to the shock of the fans.  He retired in 1993. Stoney died on his 87th birthday, 22 January 2008, in Chiswick, after a long battle with skin cancer.", "link_mentions": [{"page": "The Prisoner", "response": ["* Kevin Stoney"]}, {"page": "1985 in film", "response": ["| Ordeal by Innocence || Cannon Films || Desmond Davis (director); Alexander Stuart (screenplay); Donald Sutherland, Faye Dunaway, Christopher Plummer, Sarah Miles, Ian McShane, Diana Quick, Annette Crosbie, Michael Elphick, George Innes, Valerie Whittington, Phoebe Nicholls, Michael Maloney, Cassie Stuart, Anita Carey, Ron Pember, Kevin Stoney, Brian Glover || Mystery || Live action"]}, {"page": "1983 in film", "response": ["| The Dresser || Columbia Pictures || Peter Yates (director); Ronald Harwood (screenplay); Albert Finney, Tom Courtenay, Edward Fox, Zena Walker, Eileen Atkins, Michael Gough, Cathryn Harrison, Betty Marsden, Sheila Reid, Lockwood West, Donald Eccles, Llewellyn Rees, Guy Manning, Anne Mannion, Kevin Stoney, Ann Way, John Sharp, Kathy Staff, Roger Avon || Drama || Live action"]}, {"page": "Cyberman", "response": ["The Cybermen next appeared in The Moonbase (1967) opposite the Second Doctor. In 2070, the Cybermen attempt to remotely destroy the Earth by affecting its weather patterns with a device called the Gravitron. However, the Gravitron is used against them, hurling them into space. Later in the same television season, The Tomb of the Cybermen saw a 25th Century human expedition discover sarcophagi containing hibernating Cybermen on the planet Telos, where the creatures arise and attack. This episode introduced the cybermats, small mechanical scouts used by the Cybermen, as well as the Cyber Controller. In the following season, in The Wheel in Space (1968), the Doctor and his crew face off against the Cybermen on a marooned Earth space station in the 21st Century. This episode introduces the Cyber-Planner, an immobile unit which directs the Cybermen. The Cybermen plan to take over the space station, after which their fleet will invade Earth. The Doctor uses an x-ray laser to destroy the Cybermen. In the next season, The Invasion has the Doctor and his companions visit late 20th century England, where he discovers an army of Cybermen are hidden on Earth and working with magnate Tobias Vaughn (Kevin Stoney) to invade Earth. Their invasion is defeated by the Doctor and the military support of the newly formed United Nations Intelligence Taskforce."]}, {"page": "The Adventures of Robin Hood (TV series)", "response": ["A number of actors appeared in supporting roles in most episodes: in series 1 these included: Victor Woolf, Willoughby Gray, and John Longden, and for later series included: Paul Hansard, Morris Barry, Nigel Davenport, Kevin Stoney, Ronald Hines, and Max Faulkner, who also did stunt/double work. Frank Maher (later Patrick McGoohan's stunt double) played many small non-speaking parts, and stuntman Terry Yorke, who doubled for Richard Greene, played many small roles throughout all four series. In Series 3, Paul Eddington played a different character in many episodes, before settling down to Will Scarlett."]}, {"page": "Ace of Wands (TV series)", "response": ["2 episodes. A bank robbery leads to a villain with delusions of grandeur in a houseboat filled with computers and Nazis. With Christopher Benjamin as Falk, Kevin Stoney as a bank Manager, Tim Curry as a cashier, Ray Barron as Macready, Alan Tucker as Gaston and Billy Cornelius as a Guard."]}, {"page": "1921 in the United Kingdom", "response": ["** Kevin Stoney, actor (died 2008)"]}, {"page": "Doomwatch", "response": ["Cast: John Paul as Dr Spencer Quist, Simon Oates as Dr John Ridge, Robert Powell as Tobias Wren, Joby Blanshard as Colin Bradley, Wendy Hall as Pat Hunnisett, Gracie Luck as First Stewardess, Tony Sibbald as First Captain, Richardson Morgan as First Engineer, Monty Brown as First Co-Pilot, John Barron as The Minister, Christopher Hodge as Commissionaire, Jennifer Wilson as Miss Willis, Michael Hawkins as Jim Bennett, Kevin Stoney as Hal Symmonds, Pat Wallen as Second Stewardess, Caroline Rogers as Third Stewardess, John Lee as Second Captain, Eric Corrie as Second Co-Pilot, Edward Dentith as Second Engineer, Andreas Malandrinos, Mike Lewin, Pat Beckett, Toba Laurence, Cynthia Bizeray, Peter Thompson, Michael Earl and Tony Haydon as Passengers."]}, {"page": "Quatermass (TV serial)", "response": ["Quatermass also featured many familiar faces from British television and film in supporting roles, including Margaret Tyzack, Bruce Purchase, James Ottaway, Brenda Fricker, David Yip, Kevin Stoney, Gretchen Franklin, Brian Croucher and Chris Quinten, as well as the singer (and later television presenter) Toyah Willcox."]}, {"page": "The Wednesday Play", "response": ["| David HemmingsDelphi LawrenceKevin StoneyJanice DinnenKatherine SchofieldJonathan BurnGertan Klauber", "| Dudley FosterIsobel BlackNorman RodwayMichael GuestDavid DodimeadJohn BryansGeoffrey HinsliffKevin StoneyHoward Charlton", "| Dudley FosterAlan BrowningColin BakerBryan PringleJohn WoodvineRalph WatsonKevin StoneyJames Garbutt"]}, {"page": "Theatre 625", "response": ["|Alan Dobie,Doris Wellings,Eve Pearce,Eileen Winterton,Derek Benfield,André Morell,Sian Davies,John Dearth,Reginald Barratt,Donald Eccles,Frazer Hines,Harry Littlewood,Kevin Stoney,Brian Peck,Jeremy Spenser,David Valla,Malcolm Taylor,Michael Davis"]}, {"page": "Dreamwatch", "response": ["The publication began life in July 1983 as an amateur fanzine dedicated to the popular science-fiction television series Doctor Who, and was published under the title Doctor Who Bulletin. In this form, it became well known for taking a generally critical tone towards the later seasons of the programme, particularly the work of producer John Nathan-Turner, who was subjected to several personal attacks in its pages. However, it became popular with some fans due to its frequent reporting of news concerning the show before it was released through official sources, and as an alternative viewpoint to the officially sanctioned Doctor Who Magazine or Celestial Toyroom, the newsletter of the Doctor Who Appreciation Society. There were, however, occasional embarrassing errors, such as the printing of an obituary for actor Kevin Stoney in 1986, who was still alive and after the article's appearance would happily sign copies for fans at conventions. The fanzine also gained a reputation for being sometimes too willing to report rumour as fact."]}, {"page": "2008 in film", "response": ["| style=\"text-align:center;\"| 22 || Kevin Stoney || style=\"text-align:center;\"| 87 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor|| "]}, {"page": "Hammer House of Horror", "response": ["Ruth and Andrew investigate and find that the corpses are being replaced by mannequins for burial, and that the funeral directors are secretly taking the dismembered carcasses to Chesterton Clinic. Ruth gets permission from her editor (Dinah Sheridan) to expose the racket and advance her career. Ruth gets admitted to the clinic as a patient with a feigned diagnosis of peripheral vascular disease, using her doctor friend's help. She prowls around late at night and finds a room with several carcasses being stored like an abattoir. She sees the clinic director Jack Rothwell (Kevin Stoney) taking one of the dismembered corpses in his car and follows him to a country mansion."]}, {"page": "The Daleks' Master Plan", "response": ["Kevin Stoney would return as Tobias Vaughn, another villain working with an alien force – the Cybermen — against the Earth, in the Second Doctor serial The Invasion (1968). Additionally, Stoney also played Tyrum in the Fourth Doctor serial Revenge of the Cybermen (1975)."]}, {"page": "Revenge of the Cybermen", "response": ["Kevin Stoney appeared in The Daleks' Master Plan and The Invasion (1968). Michael Wisher was in The Ambassadors of Death, Terror of the Autons, Carnival of Monsters, Frontier in Space, Planet of the Daleks, Death to the Daleks, Genesis of the Daleks and Planet of Evil. Ronald Leigh-Hunt previously appeared in The Seeds of Death. William Marlowe appeared in The Mind of Evil. David Collings would later return in Mawdryn Undead and The Robots of Death."]}, {"page": "Pope John Paul II (film)", "response": ["* Kevin Stoney as Bishop Dygat"]}, {"page": "Play of the Month", "response": ["|Rex Harrison,Patsy Byrne,Siân Phillips,Clive Revill,Donald Eccles,Geoffrey Bayldon,Willoughby Goddard,Stacey Tendeter,John Gill,Kevin Stoney,Neil McCarthy"]}, {"page": "Thrasyllus of Mendes", "response": ["In the TV miniseries adaptation of the novels, Thrasyllus was played by Kevin Stoney, who had previously played him in the 1968 ITV series The Caesars."]}, {"page": "The Invasion (Doctor Who)", "response": ["In the serial, the megalomaniac Tobias Vaughn (Kevin Stoney), the head of the hugely successful electronics company International Electromatics, forms an alliance with the Cybermen to take control of Earth.", "Kevin Stoney previously played Mavic Chen in The Daleks' Master Plan (1965–66) and would later play Tyrum in Revenge of the Cybermen (1975). Peter Halliday, who plays Packer, also supplied the voice of the Cyber-Director in all eight episodes of the serial, in addition to the Cybermen voices in the last four episodes. In addition, Halliday went on to do several other roles (both voice and acting) in several later serials in the series. Edward Burnham also portrays Professor Kettlewell in the Tom Baker serial, Robot (1974–75). Clifford Earl previously played the station sergeant in The Daleks' Master Plan. Sheila Dunn previously played Blossom Lefavre in The Daleks' Master Plan and would later play Petra Williams in Inferno. Sally Faulkner later played Miss Tremayne in the audio play Winter for the Adept. Ian Fairbairn had previously played Questa in The Macra Terror (1967) and would later play Bromley in Inferno (1970) and Doctor Chester in The Seeds of Doom (1976), both stories directed by Camfield."]}, {"page": "The Chimes of Big Ben", "response": ["* Kevin Stoney . . . Colonel J."]}, {"page": "Fall of Eagles", "response": ["*Kevin Stoney – Father John"]}, {"page": "Freewheelers", "response": ["Initially Geoffrey Toone played the resident villain Karl von Gelb, a former high-ranking SS officer. To avoid prejudicing potential sales of the programme to West Germany, references to the character's Nazi past were dropped in series 3. From series 4, the character was replaced by a succession of similarly crazed criminal masterminds, such as Jerome Willis as Professor Nero and Commander Caine played by Kevin Stoney. The criminals were aided by various henchmen, perhaps most memorably by Ryan (Richard Shaw) and the beret-wearing Burke (Michael Ripper) in series 5 and 6."]}, {"page": "The New Avengers (TV series)", "response": ["| Vladek Sheybal, Basil Dignam, Peter Copley, Kevin Stoney, Hugh Walters, Brian Jackson, Gordon Rollings, Andy Bradford"]}, {"page": "Sword of Freedom", "response": ["* Kevin Stoney as Niccolo the innkeeper"]}, {"page": "Murder at the Gallop", "response": ["* Kevin Stoney as Doctor Markwell"]}, {"page": "The First Churchills", "response": ["*Archbishop Sancroft: Kevin Stoney"]}, {"page": "The Blood Beast Terror", "response": ["The two latest victims were students of the renowned entomology professor Dr. Carl Mallinger (Robert Flemying), who lives nearby with his beautiful daughter Clare (Wanda Ventham) and their scar-faced butler, Granger (Kevin Stoney). When Quennell brings the scales to Mallinger for identification, Mallinger behaves suspiciously and tries to take all of them. Quennell describes his theory about a killer eagle, but Mallinger dismisses it outright. Quennell is unaware that the entomologist has a pet eagle, which is tormented by the sadistic Granger.", "* Kevin Stoney as Granger"]}, {"page": "The Nightmare Fair", "response": ["*In the text of the novel, the character Kevin is given the surname Stoney. Kevin Stoney is the name of an actor who appeared in earlier stories in the televised series."]}, {"page": "List of Bergerac episodes", "response": ["| Dandy Nichols, Phil Davis, Norman Jones, Kevin Stoney", "| Norman Wisdom, Michael Attwell, Sheila Ruskin, Elvi Hale, Jeff Rawle, Kevin Stoney, David Quilter, Penelope Lee, Roy Spencer", "| Jeremy Child, Alibe Parsons, Kevin Stoney, Maya Woolfe, Peter Craze, Nicolas Chagrin"]}, {"page": "The Caesars (TV series)", "response": ["* Kevin Stoney as Thrasyllus of Mendes"]}, {"page": "Lost in Time (Doctor Who)", "response": ["* 021 (The Daleks' Master Plan): Episodes 2, 5 and 10, plus mute film sequences from episodes 1 & 2, plus clips from episodes 3 & 4. Episode 2 has a commentary option featuring actors Peter Purves and Kevin Stoney, and designer Raymond Cusick."]}, {"page": "I, Claudius (TV series)", "response": ["* Kevin Stoney as Thrasyllus of Mendes"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Kevin Stoney"]}, {"page": "List of Bergerac cast members", "response": ["*Kevin Stoney"]}, {"page": "The Adventures of Don Quick", "response": ["#The Benefits of Earth. The pair land on a planet with two extremely different races. One is technologically advanced and is warlike, addicted to human sacrifices. The others are beings of peace and sensitively, living in a dream world. Quick decides to reform them. Kevin Stoney as Betuchuk, Anouska Hempel as Marvana, Thorley Walters as Chief Dreamer. Written by Peter Wildeblood."]}]}}