{"wiki_id": "http://www.wikidata.org/entity/Q6390042", "itemLabel": "Kenneth Dobson", "itemDescription": "English cricketer (1900-1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenneth_Dobson", "wikipedia_page": {"main": "Kenneth William Cecil Dobson (28 August 1900 – 6 March 1960) was an English cricketer. He was a right-handed batsman and a right-arm medium-pace bowler who played for Derbyshire and Warwickshire.\nDobson was born in Barrow upon Trent, Derbyshire, the son of Frederick William Dobson and his wife Agnes Eadie. He played three County Cricket matches for Derbyshire in May 1920. In the first game against Yorkshire, he was stumped for a duck in his first innings and bowled by two-time Test cricketer Abe Waddington in the second. In 1923 he played a minor counties game for Staffordshire. Finally he played two games in the 1925 season, for Warwickshire. Dobson was a tailend batsman and an occasional bowler.\nDobson died in Torquay aged 59. His uncles John Eadie and William Eadie also represented Derbyshire in County Cricket.", "link_mentions": [{"page": "Dobson (surname)", "response": ["*Kenneth Dobson (1900–1960), English cricketer"]}, {"page": "Ken Dobson", "response": ["#REDIRECT Kenneth Dobson"]}, {"page": "John Eadie (cricketer)", "response": ["Eadie's brother, William Eadie and nephew Kenneth Dobson both played first-class cricket for Derbyshire."]}, {"page": "William Eadie (cricketer)", "response": ["His brother, John Eadie and nephew Kenneth Dobson both played first-class cricket for Derbyshire."]}, {"page": "Derbyshire County Cricket Club in 1920", "response": ["Fifteen players made their debut in the season, half of them playing three or fewer matches. The most significant additions to the side were Harry Storer and wicket keeper Harry Elliott both of whom had long careers with the club and were members of the 1936 championship winning team. Newcomers Wilfred Carter, Jim Hutchinson, William Tomlinson, Anthony Jackson and Robert Bestwick played in several subsequent seasons. Those who only appeared in 1920 were Henry Radford, Kenneth Dobson and Douglas Linathan with three appearances, Albert Woodland and Allen Turner  with two appearances and Geoffrey Brooke-Taylor, Timothy Boden and John Davis who only played one game each."]}, {"page": "List of Warwickshire County Cricket Club players", "response": ["* Kenneth Dobson (1925) : K. W. C. Dobson (2)"]}]}}