{"wiki_id": "http://www.wikidata.org/entity/Q6390436", "itemLabel": "Kenneth Macpherson", "itemDescription": "British painter", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenneth_Macpherson", "wikipedia_page": {"main": "Kenneth Macpherson  (27 March 1902 – 14 June 1971) was a Scottish-born novelist, photographer, critic, and film-maker, the son of Scottish painter John 'Pop' Macpherson and Clara Macpherson, and descended from six generations of artists. It is only in recent years that Macpherson's contribution to cinematography has come to be recognised with the re-discovery of his work, which, though limited in output, was far ahead of its time, both in subject matter and cinematic technique. In his work with the Pool Group (1927–1933), which he co-founded with Bryher and HD, Macpherson also established the influential film journal Close Up.", "link_mentions": [{"page": "Silent film", "response": ["* Borderline, Kenneth Macpherson, 1930"]}, {"page": "1971 in film", "response": ["| style=\"text-align:center;\"| 14 || Kenneth Macpherson || style=\"text-align:center;\"| 69 || style=\"text-align:center;\"| Scotland-Italy || style=\"text-align:center;\"| Film-maker || "]}, {"page": "1902 in film", "response": ["*March 27 – Kenneth Macpherson, Scottish-born avant-garde film-maker (d. 1971)"]}, {"page": "Bryher (novelist)", "response": ["She was a major figure of the international set in Paris in the 1920s, using her fortune to help many struggling writers. With her lover Hilda Doolittle (H.D.) and the Scottish writer Kenneth Macpherson, she launched the film magazine Close Up, which introduced Sergei Eisenstein’s work to British viewers. From her home in Switzerland, she helped to evacuate Jews from Hitler's Germany, and then became a popular historical novelist.", "That same year she married Kenneth Macpherson, a writer who shared her interest in film and who was at the same time H.D.'s lover.  In Burier, Switzerland, overlooking Lake Geneva, the couple built a Bauhaus-style structure that doubled as a home and film studio, which they named Kenwin.  They formally adopted H.D.'s young daughter, Perdita. In 1928, H.D. became pregnant with Macpherson's child, but chose to abort the pregnancy. Bryher divorced MacPherson in 1947; she and Doolittle no longer lived together after 1946, but continued their relationship until Doolittle's death in 1961."]}, {"page": "List of Criterion Collection releases", "response": ["| align=left|Saul J. TurellOscar MicheauxKenneth MacphersonZoltan KordaThornton FreelandPen TennysonLeo HurwitzPaul Strand", "| align=left|Kenneth Macpherson"]}, {"page": "Oswell Blakeston", "response": ["Blakeston joined the staff of Close Up, the magazine of the Pool Group, in August 1927. While at Close Up, he very much became a protégé of Kenneth Macpherson, the publication’s editor, and contributed more articles than any other single writer—a total of 84; he contributed to all but four of the journal's issues. While writing for Close Up, he worked in a variety of capacities in the British film industry and was for a time an assistant cameraman at Gaumont Studios.Close up, 1927–1933: Cinema and Modernism, James Donald, Anne Friedberg, Laura Marcus"]}, {"page": "Robert Herring (poet)", "response": ["Early in his career, Herring worked for the publisher Allen & Unwin.Herring to Bryher, Bryher Papers GEN MSS 97 Series I, Writings Box 19, Folder 719, 21 March 1936. He was assistant editor of The London Mercury from 1925 to 1928 and a regular contributor, particularly of film criticism, until the journal was sold to new owners in 1934 and J.C. Squire ceased to be editor.Herring to Bryher, Bryher Papers GEN MSS 97 Series I, Writings Box 19, Folder 711, 3 September 1934. At the same time he contributed film criticism regularly to the magazine Drawing and Design: The Magazine of Taste, up to 1929. He became film critic at The Manchester Guardian in mid 1928, being one of the newspaper's best paid freelance contributors for several years. From 1932 onwards he reviewed ballet for the newspaper. He also became London Correspondent for the film magazine Close Up, contributing 38 feature articles between late 1927 and 1933, making him the journal's third most prolific contributor behind the editor Kenneth Macpherson and Oswell Blakeston. He was a regular contributor of talks about the cinema for the BBC and was published several times in The Listener, including two specially commissioned pieces, which were rare in a journal whose content had to be almost wholly the transcripts of earlier broadcasts.BBC Memorandum 14 January 1929, BBC Written Archives, Publications. The Listener. Policy 1929-1953. R43/67. On several occasions the BBC considered hiring Herring as its contracted film correspondent.Hilda Matheson to Lionel Fielden, BBC Internal Circulating Memo, 5 July 1929, BBC Written Archives, Talks. Film Talks 1929-37, R51/173/1.; Norman Luker, BBC Internal Circulating Memo, ‘Cinema Talks’, 29 November 1937, BBC Written Archives, Talks. Film Talks 1929-37, R51/173/1. In 1938 he became film critic of the Glasgow Herald. Herring also delivered what was almost certainly the first official lecture on cinema at Cambridge University, on 13 August 1934.Herring to Bryher, Bryher Papers GEN MSS 97 Series I, Writings Box 19, Folder 711, 14 August 1934.", "He took over editorship of Life and Letters in 1935, when it was purchased by Bryher's Brendin Publishing Company for £1200.Herring to Bryher, 10 March 1939, Bryher Papers GEN MSS 97 Series I, Writings Box 19, Folder 731. He held the post for about 15 years, working initially with Dorothea Petrie Townsend, an old school friend of Bryher's who was a highly experienced editor with commercial magazines.Dorothea Petrie Carew, Anything Once (Penzance: Wordens, 1971) The magazine's title was modified to Life and Letters To-day, the content of the magazine changed radically, with a large film section being included, directly under Herring's control, and the circulation expanded. The first issue Louis Silverstein's H.D. Chronology featured articles by Mary Butts, Murray Constantine, H. D., Havelock Ellis, Kenneth Macpherson, Lotte Reiniger, and Gertrude Stein, besides contributions by Sergei M. Eisenstein, André Gide, Horace Gregory, Osbert Sitwell and Eric Walter White. White's essay was probably the first substantial critique of Bertolt Brecht published in English. It continued to publish major figures, including Henry Miller and Dylan Thomas and was the first British magazine to publish emerging young American poets such as Elizabeth Bishop and Muriel Rukeyser. Life and Letters To-day was not a typical modernist \"little magazine\". The initial circulation as a quarterly was nearly 3000 per issue, and the magazine was stocked by major retailers such as W.H. Smith and Menzies. When the title switched to monthly publication in autumn 1938, Smith's alone increased their order by 1000 copies an issue. In March 1939 Brendin purchased the failing London Mercury and Bookman titles and incorporated them to the journal. The magazine reverted to its pre-Bryher title, Life and Letters later in World War II.", "Herring became close friends of the Pool Group (H.D., Bryher and Kenneth Macpherson), having associated with them since their interest in experimental film in the late 1920s.Close-Up 1927-1933: Cinema and Modernism, co-edited by Anne Friedberg, James Donald and Laura Marcus (Princeton University Press, 1998) Bryher paid for Herring's psychoanalysis in London with the Freudian analyst Walter Schmideberg between 1935 and 1939.Herring to Bryher, 31 July 1939, Bryher Papers GEN MSS 97 Series I, Writings Box 19, Folder 733."]}, {"page": "Dreams That Money Can Buy", "response": ["The film was produced by Kenneth Macpherson and Peggy Guggenheim.‘Hans Richter – Senses Of Cinema, Great Directors Issue 49"]}, {"page": "Borderline (1930 film)", "response": ["Borderline is a 1930 film, written and directed by Kenneth Macpherson and produced by the Pool Group in Territet, Switzerland. The silent film, with English inter-titles, is primarily noted for its handling of the contentious issue of inter-racial relationships, using avant-garde experimental film-making techniques, and is today very much part of the curriculum of the study of modern cinematography."]}, {"page": "List of avant-garde films of the 1930s", "response": ["|Borderline||Kenneth Macpherson||Paul Robeson, Hilda Doolittle||United Kingdom||Pool film; silent"]}, {"page": "Pool Group", "response": ["The Pool Group were a trio of interwar period artists, filmmakers and poets consisting of Hilda Doolittle, Kenneth Macpherson and Bryher (Annie Winifred Ellerman). Their work has been studied by  poetry and film historians as well as by scholars of mysticism, feminism, psychoanalysis and LGBT history. They are perhaps best known for creating what is their only surviving film, the silent avant garde classic from 1930, Borderline featuring the African American activist and entertainer Paul Robeson in the lead role. They also published a progressive and opinionated film journal called Close Up. The Pool Group were virtually forgotten for more than half a century after they broke up in the mid-1930s until the early 1980s when they were rediscovered by historians of 20th century arts and cinemaMarlowe, Albert. \"\". The Rediscovery of Pool. Retrieved on February 14, 2009.", "The Pool Group was launched in 1927, from Riant Chateau, Territet, Switzerland and consisted of Bryher, Kenneth Macpherson and Hilda Doolittle (better known by her initials, H.D.). Macpherson designed the Pool Group’s logo, which served as the cover of its catalog, showing concentric ripples in water.", "The relationship was an open one, with both taking other partners. In 1921 Bryher entered into a marriage of convenience with the American author Robert McAlmon, whom she divorced in 1927. In 1928, H.D. became pregnant by Kenneth Macpherson, but the pregnancy was terminated later the same year. The complexities of H.D.'s relationships led her to consult the pioneer sexologist Havelock Ellis and to develop a deep interest in psychoanalysis: in the 1930s, she was to be analyzed by Freud, and her interest deeply marked her poems and other writings.", "===Kenneth Macpherson===", "In 1927, Bryher  married Kenneth Macpherson, a writer who shared her interest in film and who was at the same time H.D.'s lover. Macpherson, was a young Scottish painter with a passion for film. H.D. seems to have fallen in love with him though Macpherson was evidently exclusively homosexual. In Burier, Switzerland, overlooking Lake Geneva, the couple, along with Doolittle, built a Bauhaus-style structure that doubled as a home and film studio, which they named Kenwin. Bryher and Macpherson also formally adopted H.D.'s young daughter, Perdita, whose name they officially registered as Frances Perdita Macpherson.H.D. Chronology - Louis Silverstein's", "Kenneth Macpherson wrote of his views on world cinema in an editorial from the first issue of Close Up that encompassed many of the Pool Group's views,", "As well as acting in this film, H.D. with Kenneth Macpherson, wrote an explanatory pamphlet to accompany it and to distribute to the audience, a piece later published in Close Up.Mandel, Charlotte. \"Garbo/Helen: The self-projection of beauty by H.D.\". Women's Studies 7, 1980. 127–35. Retrieved on February 14, 2009.Paul Robeson is the only professional actor in the film and his desire to connect to a like-minded set of individuals in Europe allegedly led him to play the role of Pete for no fee."]}, {"page": "Voodoo Macbeth", "response": ["File:Macbeth-Opening-Audience-1.jpg|Lloyd Thomas, Kenneth Macpherson and Jimmie Daniels"]}, {"page": "Kenneth MacPherson", "response": ["#REDIRECT Kenneth Macpherson "]}, {"page": "Close Up (magazine)", "response": ["Close Up was an influential literary magazine devoted to film, published by the Pool Group between 1927 and 1933. \"It was the brain child of Kenneth Macpherson, a young man of independent means, not a little talent, and quite a lot of personal charm\".  The monthly magazine, founded at the group's 'headquarters' in Territet, Switzerland would be dedicated to \"independent cinema and cinema from around the world\". The first issue of Close Up, describing itself on the front cover as an \"international magazine devoted to film art\", appeared in July, 1927. Macpherson was editor-in-chief, with Bryher as assistant editor, and Hilda Doolittle (\"H.D.\") and Oswell Blakeston making regular contributions."]}, {"page": "Algernon Islay de Courcy Lyons", "response": ["Lyons was the friend of the film-maker, Kenneth Macpherson, both of them living in the ‘Villa Tuoro’ on Capri, where Norman Douglas was their constant companion during the last years of Douglas’s life. Both Macpherson and  Lyons were at Norman Douglas’s bedside when he died.H.D. Chronology - Louis Silverstein", "Part of  Lyons’s inheritance to his fostered Thai son, Manop Charoensuk, was a large quantity of photos, books, and letters relating to the life of Baron Jacques d'Adelswärd-Fersen, the novelist and poet. It is believed that Fersen bequeathed the inheritance to Norman Douglas, who bequeathed it to Kenneth Macpherson. On Macpherson’s death, Lyons inherited the estate. Charoensuk sold it to an American millionaire. In 2002, the complete collection was offered by Sotheby’s in London to the American antiquarian bookseller David Deiss, but it was eventually bought by an unknown British dealer.Frère Jacques: A Shrine to Love and Sorrow - Will H.L. Ogrinc (2006) It is probable, although unconfirmed, that most, if not all, of this inheritance, is what the Beinecke acquired in 2008 and now forms part of the 'Norman Douglas Collection.", "*Islay Lyons - Photographs. Introduced by William Warren Privately Printed: Éditions Didier Millet (1996). (Photographs of Graham Greene, Harold Acton, Bryher, Noël Coward, Janet Flanner, Peggy Guggenheim, Sybille Bedford, Margot Fonteyn, Kenneth Macpherson and many others. Also included are landscapes and Italian cityscapes).", "*Omnes Eodem Cogimur: Some Notes Following the Death of Norman Douglas. (Kenneth Macpherson) Privately Printed: [Turin] (1953). A memorial album with twenty-five photographs by Islay Lyons of Douglas and his friends, including Nancy Cunard, Graham Greene, Somerset Maugham and many others."]}, {"page": "1902 in Scotland", "response": ["* 27 March – Kenneth Macpherson, cinematographer (died 1971 in Tuscany)"]}, {"page": "Hans Rehfisch", "response": ["He was co-writer of an experimental American film called Dreams That Money Can Buy. A 1947 feature in colour, it was directed by surrealist artist and dada film-theorist Hans Richter, and produced by Kenneth Macpherson and Peggy Guggenheim. Collaborators included Max Ernst, Marcel Duchamp, Man Ray, Alexander Calder, Darius Milhaud and Fernand Léger. The film won the Award for the Best Original Contribution to the Progress of Cinematography at the 1947 Venice Film Festival."]}, {"page": "Jimmie Daniels", "response": ["Later Daniels was in a relationship with Kenneth Macpherson, filmmaker who was married with wealthy English heiress Annie Winifred Ellerman, also known as Bryher. Bryher commissioned Richmond Barthé to make a bust of Daniels.", "Macbeth-Opening-Audience-1 (cropped).jpg|Kenneth Macpherson (left foreground) and Daniels at the opening of the Federal Theatre Project's production of Macbeth, April14, 1936"]}, {"page": "Films about race", "response": ["| style=\"width:40px; text-align:center;\"| 1930 || Borderline || Kenneth Macpherson|| An African American couple played by Paul and Eslanda Robeson stay at a hotel in Europe with group of hedonists. An interracial love triangle shocks the townsfolk"]}, {"page": "Féral Benga", "response": ["Back in Manhattan, Benga was a gay icon. He moved in the Harlem Renaissance circles and had also a brief affair with Kenneth Macpherson, who was at the time in a relationship with an African-American singer, Jimmie Daniels. In 1938 Benga was painted by Pavel Tchelitchew, and the painting, Deposition was owned by Lincoln Kirstein."]}, {"page": "Mary Chadwick", "response": ["In 1930 Chadwick befriended the poet H.D., the novelist Bryher and the filmmaker Kenneth Macpherson. H.D., Bryher and MacPherson collaborated in film production as the Pool Group, and Chadwick wrote for their magazine, Close Up, in 1931. Bryher paid for both Kenneth Macpherson and H.D. to go into analysis with Chadwick. H.D. saw Chadwick for 24 sessions, from April to July 1931, before ending analysis abruptly. She found Chadwick's mixing of analysis and friendship distressing, and seems to have associated her with 'sadism'. By comparison with Hanns Sachs, with whom H.D. entered analysis at the end of the year, H.D. also felt Chadwick was hampered by an English moralism:"]}]}}