{"wiki_id": "http://www.wikidata.org/entity/Q6396688", "itemLabel": "Kevin Kewley", "itemDescription": "English footballer and manager (born 1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kevin_Kewley", "wikipedia_page": {"main": "Kevin Kewley (born 2 March 1955) is an English former professional football  player and coach.\nActive in England and the United States, he played as a midfielder and made over 450 career appearances, scoring over 120 goals. After retiring as a player he was active as a coach at both professional and college-level.", "link_mentions": [{"page": "Dallas Tornado", "response": ["* Kevin Kewley (1976–79) "]}, {"page": "Wichita Wings", "response": ["Becker hired Roy Turner as head coach and brought in Ward Lawrence to help oversee operations. Tom Marshall became the Wings’ general manager. On November 23, 1979, with only a week to go before the opening game, Marshall ceased to be a part of the Wings organization. The Wings and Marshall disagreed on the details of the separation, but it was to be permanent. Ward Lawrence took over as general manager and Becker brought in Ray Denton to help run day-to-day operations. Mike Ivanow was to be the first signing, but the paperwork sent to his home misspelled his name. The delay resulted in Norman Piper becoming the first Wichita Wing. Piper was joined by the former Dallas Tornado and Liverpool player Kevin Kewley, who became the team's captain. Former Manchester United forward Jimmy Ryan and Argentinian phenom Omar Gomez anchored the team's offense. Roy Turner brought on George Ley as a player-coach. Later in the season, the team added former Manchester United winger Willie Anderson and forward Andy Chapman. Chapman had signed with Arsenal at age 16 and would become a fan favorite in Wichita, becoming the fifth leading scorer in Wings history. Ivanow would be joined in goal by Keith Van Eron. Though Ivanow had US Olympic experience, Van Eron would end up playing more time in goal.", "In 1987-88, the Wings brought in Nenad \"Ziggy\" Zigante to replace Seamus McDonagh in goal. Former US Olympian Jean Willrich and longtime indoor pro Mike Stankovic also joined the squad in Charlie Cooke's second year. But it was a season that Cooke himself would not finish. On January 30, 1988, Cooke and assistant coach Norman Piper were fired after starting the year 11-16. Former Wing Terry Nicholl would take over as head coach, with Kevin Kewley adding \"assistant coach\" to his duties on the field. Though the Wings would have their worst ever season, finishing 23-33, two Wings would end up leading the MISL. Erik Rasmussen became the scoring champion and league MVP, while Zigante was named the league's Newcomer of the Year.", "|Kevin Kewley", "|Kevin Kewley", "| Kevin Kewley", "|Kevin Kewley"]}, {"page": "Wichita Blue", "response": ["* Kevin Kewley 1994"]}, {"page": "1977–78 Liverpool F.C. season", "response": ["*  Kevin Kewley"]}, {"page": "Kewley", "response": ["*Kevin Kewley (born 1955), English retired professional footballer who played in both England and the United States"]}, {"page": "1972–73 Liverpool F.C. season", "response": ["*  Kevin Kewley"]}, {"page": "1973–74 Liverpool F.C. season", "response": ["*  Kevin Kewley"]}, {"page": "1974–75 Liverpool F.C. season", "response": ["*  Kevin Kewley"]}, {"page": "1975–76 Liverpool F.C. season", "response": ["*  Kevin Kewley"]}, {"page": "1976–77 Liverpool F.C. season", "response": ["*  Kevin Kewley"]}]}}