{"wiki_id": "http://www.wikidata.org/entity/Q6391227", "itemLabel": "Kenny Thomas", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenny_Thomas_(singer)", "wikipedia_page": {"main": "Kenny Thomas (born 12 September 1968, Islington, London) is an English soul singer who had a successful solo career in the 1990s with eight UK top 40 singles and two UK top ten albums.", "link_mentions": [{"page": "1991 in music", "response": ["*Voices – Kenny Thomas"]}, {"page": "Force MDs", "response": ["One of their songs \"Tender Love\" was covered by Jordan Knight, Kenny Thomas, Backstreet Boys, Usher, Uncle Sam, Alicia Keys and Meshell Ndegeocello."]}, {"page": "Cooltempo Records", "response": ["Cooltempo, the dance music imprint of Chrysalis Records, was revived in May 2018.  The label released albums by artists such as Kenny Thomas, Milli Vanilli, Adeva, Shara Nelson, Mica Paris and Innocence.", "*Kenny Thomas: Wait For Me"]}, {"page": "Hit Me, Baby, One More Time (TV series)", "response": ["| Kenny Thomas || \"Thinking About Your Love\" || \"Don't Know Why\" by Norah Jones"]}, {"page": "The Chart Show", "response": ["* 1991 - Kenny Thomas - Outstanding"]}, {"page": "Absolute (production team)", "response": ["* \"Piece by Piece\" (Kenny Thomas single)"]}, {"page": "Tripping on Your Love", "response": ["Stewart Mason from AllMusic said the song \"is actually pretty good.\" Larry Flick from Billboard described it as a \"percolating dance ditty\", noting its \"impressive remixes\" by George Michael and Steve \"Silk\" Hurley. He added that \"it's a winner\". Andy Kastanas from The Charlotte Observer wrote, \"This particular cut has an island flair coupled with some riveting male reggae-rap vocals. Nevertheless, the main influence here is the psychedelic sound of the '70s. Sound like an unusual combo? Check it out.\"Kastanas, Andy (1991-12-04). \"Sounds of Progress\". p. 10. The Charlotte Observer. Kenny Thomas reviewed the song for Smash Hits, commenting, \"I like the Indian sitar sound at the beginning and the reggae toasting bit. That was quite innovative and then it went straight into Bananarama.\""]}, {"page": "Living in a Box", "response": ["Living in a Box is a British band founded in 1985. They are best known for their eponymous debut single, produced by Richard James Burgess. The group currently consists of founding members Anthony \"Tich\" Critchlow (drums) and Marcus Vere (keyboards, synthesizers) along with vocalist Kenny Thomas.", "In 2016, Living in a Box reformed with British soul singer Kenny Thomas replacing Darbyshire. Since then the band has appeared at live festival events in the UK such as Let's Rock, Rewind and Flashback throughout the summer of 2016 and through 2017.", "*Kenny Thomas – vocals (2016–present)"]}, {"page": "Kenneth Thomas", "response": ["Kenneth, Ken or Kenny Thomas may refer to:", "* Kenny Thomas (basketball) (born 1977), American basketball player", "* Kenny Thomas (singer) (born 1968), British dance music singer"]}, {"page": "Outstanding", "response": ["The song was later covered by British singer Kenny Thomas in 1990. It reached number 12 in the UK Singles Chart. In 1999, footballer Andy Cole signed to WEA/Warner Music and also released a cover of \"Outstanding\". Cole's version reached number 68 in the Official Charts Company singles chart.https://www.officialcharts.com/artist/8244/andy-cole/", "Category:Kenny Thomas (singer) songs"]}, {"page": "Orphy Robinson", "response": ["Robinson has worked with Lester Bowie, Don Cherry, Neneh Cherry, Junior Giscombe, Kate Havnevik, Imagination, Lionel Loueke, Wynton Marsalis, Hugh Masekela, Jean-Paul \"Bluey\" Maunick, Joe McPhee, Thurston Moore, Butch Morris, David Murray, Sunny Murray, Mica Paris, Robert Plant, Wadada Leo Smith, Spring Heel Jack, Joss Stone, Jamaaladeen Tacuma, John Tchicai, Kenny Thomas and Nana Vasconcelos."]}, {"page": "List of performances on Top of the Pops", "response": ["* Kenny Thomas – \"Outstanding\", \"Thinking About Your Love\""]}, {"page": "Cardinal Pole Catholic School", "response": ["*Kenny Thomas"]}, {"page": "Thomas (surname)", "response": ["*Ken, Keni, Kenn, Kenneth and Kenny Thomas (disambiguation), multiple people", "******Kenny Thomas (singer) (born 1968), British dance music singer", "******Kenny Thomas (basketball) (born 1977), American basketball player"]}, {"page": "The Best Dance Album in the World... Ever!", "response": ["#Kenny Thomas – \"Thinking About Your Love\""]}, {"page": "Nigel Hitchcock", "response": ["*Kenny Thomas / Wait for me – Cooltempo 7243 8 27209 2 8 – 1993"]}, {"page": "Eliot Kennedy", "response": ["Kennedy began writing songs with his brother at the age of thirteen and started a band at his school in Rotherham,  Dinnington High School, but he was interested in composing and studio work more than performing. He apprenticed as an audio engineer, and after collecting insurance for an automobile accident, he purchased equipment and began working as an engineer on a freelance basis, which eventually led to production work. The first major band that Kennedy was in was World Still Turns, a studio band in Sheffield, along with former gospel singer John Taylor and Tom Chester; they received huge interest from all the major record companies. His first success as a producer was the hit single \"Independence\", the title song of the 1993 album by Lulu, which led to projects with Pauline Henry, Dannii Minogue, Kenny Thomas, and Take That.John Dingwall, 'Scream Test; Exclusive: Take That producer Eliot Kennedy rates the new boy bands bidding to rule the charts', Daily Record (Glasgow), 25 April 1996."]}, {"page": "You Can't Hide Love", "response": ["The artists who have covered \"You Can't Hide Love\" include Victor Wooten, Nancy Wilson, Saul Williams and Wayman Tisdale, as well as  Najee, Jaye P. Morgan, Dionne Warwick, John Tropea, Kenny Thomas, Bobby Tench with Hummingbird and Carmen McRae and D'Angelo."]}, {"page": "The Hits Album (15)", "response": ["#Kenny Thomas - \"Thinking About Your Love\""]}, {"page": "List of UK top-ten singles in 1991", "response": ["|Kenny Thomas", "|align=\"left\"|Kenny Thomas"]}, {"page": "Richard Beck (music manager)", "response": ["Two years later he went on to become the youngest ever National Radio Promotions Executive when he joined the in-house promotions department at Chrysalis Records. Beck worked with acts including Sinéad O'Connor, Billy Idol, Monie Love, Debbie Harry and Kenny Thomas, and helped secure the Number One spot for Chesney Hawkes with the single \"The One and Only\".  Beck then joined UK concert & events promoter MCP as press and marketing manager, working with major names such as INXS, Guns N’ Roses, R.E.M., Oasis, Bon Jovi, Metallica, U2, Crowded House and Simply Red."]}, {"page": "Tender Love", "response": ["\"Tender Love\" has been covered by numerous artists. The most widely known version was by Kenny Thomas who reached number 23 in the UK chart in 1991.", "Category:Kenny Thomas (singer) songs"]}, {"page": "Tony Fennell", "response": ["After moving to the US permanently in the late 1980s, Fennell co-wrote with David Frank (The System) the track \"If You Believe\" for soul singer Kenny Thomas' 1991 Platinum album Voices."]}, {"page": "List of Stars in Their Eyes episodes", "response": ["| Kenny Thomas"]}, {"page": "Brit Award for British Male Solo Artist", "response": ["* Kenny Thomas"]}, {"page": "Brit Award for Best New Artist", "response": ["* Kenny Thomas"]}, {"page": "Louise Golbey", "response": ["She has worked on tracks with Example and Newham Generals and has shared the stage with Ed Sheeran, Jessie J, Anthony David, Roy Ayers, Katy B, Paloma Faith, Mr Hudson, Lianne La Havas, Omar, Alexander O'Neal, Heatwave (band) Kenny Thomas,  En Vogue, Dexter Wansel and Eric Benet."]}, {"page": "The Best of You", "response": ["The Booker T. Jones song was given a new audience in 1991 when the song was covered by English singer Kenny Thomas, titled \"Best of You\", from his debut album Voices. The Thomas version reached No. 11 in the UK and also charted in Ireland, the Netherlands, France, Germany and New Zealand.Pace magazine 1994 p.61 \"\"I'm three years older and my music reflects the changes I have inevitably gone through,\" says Kenny Thomas. ... in 1991, unleashed such monster hit singles as Outstanding, Thinking About Your Love, [The] Best of You and Tender Love.\"British Hit Singles and Albums -2005 p 100 BEST Of YOU - Kenny THOMAS", "Category:Kenny Thomas (singer) songs"]}, {"page": "12th Brit Awards", "response": ["** Kenny Thomas", "** Kenny Thomas", "|Kenny Thomas"]}, {"page": "M&S (production team)", "response": ["Ricky Morrison and Fran Sidoli formed M&S Productions in London, England, in 1994. The pair had attended school together, after which Morrison worked as a record shop assistant as well as a garage DJ. M&S recorded remixes for such artists as Urban Discharge, Kenny Thomas, Beverly Brown, and Soul Corporation. The duo, also going by names including Street Sense, The Balls of London, State of Mind, and Visual, recorded singles for MCA Records, Todd Terry's Freeze imprint, and Strictly Rhythm, among other labels. Morrison and Sidoli established their own dance label, 1001 Records, in 1996."]}, {"page": "Voices (Kenny Thomas album)", "response": ["Voices is the debut album by English soul singer Kenny Thomas, released in 1991. It features the hit singles \"Thinking About Your Love\", \"The Best of You\", \"Outstanding\" and \"Tender Love\", all of which reached the UK top 40. The album reached No. 3 on the UK Albums Chart.", "Thomas was signed to Cooltempo Records in 1990, releasing a cover of the Gap Band's \"Outstanding\" as his first single. Produced by Glen Gunner, the song entered the UK Singles Chart and eventually peaked at No. 12 when re-released in early 1991. A few months later, the singer scored his biggest hit with \"Thinking About Your Love\" which reached No. 4 and remained on the charts for three months. Unlike the rest of the songs on the album, this was produced by ex-Dead or Alive members Tim Lever and Mike Percy.  A third single, \"Best of You\" (another top 20 hit) heralded the release of Voices in October 1991. The album peaked at No. 3 on the UK Albums Chart and was certified platinum a month later for sales of over 300,000. A fourth and final single, \"Tender Love\" was released in the run up to Christmas, peaking at No. 26. The album also reached the charts in New Zealand, where Thomas had scored a top 10 hit with \"Outstanding\", peaking at No. 45.Austriancharts - Voices - Kenny Thomas", "# \"Were We Ever in Love\" (Ian Green, Kenny Thomas) – 3:55", "# \"Will I Ever See Your Face\" (Ian Green, Kenny Thomas) – 5:02", "# \"Voices\" (Ian Green, Kenny Nicholas, Kenny Thomas, Trevor Jacobs) – 4:19", "# \"Will I Ever See Your Face\" (reprise) (Ian Green, Kenny Thomas) – 0:53", "* Kenny Thomas – keyboards, primary artist, vocals, background vocals"]}, {"page": "Bpoplive", "response": ["On 1 June 2016, Leave.EU announced \"Bpop Live version 3.0\", with a line-up comprising Cheryl Baker, Mike Nolan, Jay Aston and Bobby McVay performing as \"Formerly of Bucks Fizz\"The rights to the name \"Bucks Fizz\" remain with Bobby G, whose group was not booked to perform at Bpoplive. and an Elvis impersonator, Gordon Hendricks. R&B singer Alexander O'Neal and soul singer Kenny Thomas were subsequently added.. Formerly of Bucks Fizz confirmed on their Twitter account that they were playing but did not endorse either Leave or Remain. In the following days, Ray Lewis of The Drifters was added to the line-up, and the ticket price was reduced to £5."]}, {"page": "Gary Barnacle discography", "response": ["* 1995 Given You All by Kenny Thomas (Prod. Simon Law)"]}, {"page": "Bumi Thomas", "response": ["Thomas is known for songs such as \"Free As a Bird\", which she has performed live on BBC Radio, \"My Baby (Hole in the Sky)\", \"Walk with Me\" and \"Don't Lie to Me\". Her songs tend to be centred around themes of \"journey and expression\". She has performed with the likes of Kenny Thomas, Muntu Valdo, Nneka, Shingai Shoniwa of the Noisettes, Keziah Jones and Tony Allen, and is often found performing in cafes, bars and jazz clubs in London, though as appeared on the stage in the Royal Opera House. Her debut EP, Feather Pearl, was released in November 2014."]}, {"page": "Thinking About Your Love (Kenny Thomas song)", "response": ["\"Thinking About Your Love\" is a song by English soul singer Kenny Thomas, from his debut album Voices. It was produced by former Dead or Alive members Mike Percy and Tim Lever, known as the production duo One World Productions. The song was released as a single in 1991, and was a top ten hit, peaking at number four on the UK Singles Chart. It is Thomas' highest charting single in the UK. In Sweden, the song peaked at number 22, and was his only single to chart there.", "Category:Kenny Thomas (singer) songs"]}, {"page": "List of UK top-ten albums in 1991", "response": ["| align=\"left\"|Kenny Thomas"]}, {"page": "List of UK top-ten albums in 1993", "response": ["| align=\"left\"|Kenny Thomas"]}]}}