{"wiki_id": "http://www.wikidata.org/entity/Q6397072", "itemLabel": "Kevin Nancekivell", "itemDescription": "English footballer (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kevin_Nancekivell", "wikipedia_page": {"main": "Kevin Nancekivell (born 22 October 1971) is a former semi-professional footballer who is currently a first team coach at Plymouth Argyle.\nAs a player, he was an attacking midfielder. He mainly competed at a semi-professional level, spending most of his career at Tiverton Town, although he did have a short stint as a pro at Argyle.", "link_mentions": [{"page": "Plymouth Argyle F.C.", "response": ["|First Team Coach:|| Kevin Nancekivell|| English"]}, {"page": "Craig Brewster", "response": ["Brewster left Argyle at the end of the 2017-18 season, after a hip operation he had undergone in January 2018 had seen him not feature on the sidelines for Argyle for the back-end of the season. He was replaced as assistant by Paul Wotton, with Kevin Nancekivell stepping up to the first team coaching team. Brewster later expressed his sadness and surprise at being released by the club."]}, {"page": "Nankivell", "response": ["*Kevin Nancekivell, English footballer"]}, {"page": "2000–01 Plymouth Argyle F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Kevin Nancekivell                                    ||6 ||1 ||0||0||1||0||0||0||7 ||1"]}, {"page": "History of Plymouth Argyle F.C.", "response": ["On the field, it took Argyle until their 12th league game to secure their first win of the 2018–19 season, a 1–0 victory over AFC Wimbledon. The form of top goalscorer Freddie Ladapo was the shining light in a disappointing first half of the season, with a stand-out low point of a 5–1 defeat away to Luton Town. The turn of the new year saw Argyle pick up form, winning 6 of their first 9 games of 2019, and losing just 2 of the first 12, culminating in a 5–1 win over Rochdale on 23 February. This run coincided with the return of Kyle Letheren in between the sticks in place of Matt Macey. An injury to Letheren and a stop–start March followed with Argyle winning late on against Shrewsbury Town at home, before giving away a 2–1 and then a 2–0 lead to Bristol Rovers and then Blackpool in the dying minutes to draw both matches. What was seemingly 6 points dropped to 2 proved costly as Argyle's league form dipped, losing every single game in April, and following a 5–1 defeat to Accrington Stanley which left the club in the EFL League One relegation zone with just one match of the season left to play, Derek Adams and his assistant Paul Wotton were relieved of their duties. Kevin Nancekivell took over as caretaker manager for the final game of the season, and despite winning 3–2 against Scunthorpe United, results elsewhere at games involving Southend United and AFC Wimbledon saw Argyle relegated to the EFL League Two."]}, {"page": "2011–12 Plymouth Argyle F.C. season", "response": ["On the 2nd, Argyle hosted local Devon rivals Torquay United in front of 12,836 at Home Park, which at the time was the highest League Two attendance of the season. The Gulls scored two second half goals through Billy Bodin and Lee Mansell, meaning that Luke Young's first Argyle goal was nothing but a consolation in a 2–1 defeat. With the January transfer window now open, Argyle confirmed the permanent signings of Nick Chadwick and Darren Purse, who had previously only been on loan from Stockport County and Millwall respectively, as well as signing former youth goalkeeper Ollie Chenoweth from Bideford. Crewe Alexandra won all three points when Argyle travelled to Gresty Road, a brace from Luke Murphy and a penalty scored by Ashley Westwood meant that Simon Walton's penalty and Matt Lecointe's second goal of the season were once again, nothing but consolations. Conor Hourihane was sent off late on in the game for two bookable offences, which was Argyle's tenth and final red card of the season, whilst first team coach Kevin Nancekivell was sent to the stands."]}, {"page": "2018–19 EFL League One", "response": ["|  Kevin Nancekivell"]}, {"page": "2019–20 in English football", "response": ["|  Kevin Nancekivell"]}, {"page": "2019–20 EFL League Two", "response": ["|  Kevin Nancekivell"]}]}}