{"wiki_id": "http://www.wikidata.org/entity/Q6390212", "itemLabel": "Kenneth Holmes", "itemDescription": "British scientist", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenneth_Holmes", "wikipedia_page": {"main": "Kenneth Charles Holmes FRS (1934 – 2 November 2021) was a British molecular biologist.\nHe was born in Hammersmith, London. He was a former colleague of Rosalind Franklin at Birkbeck College with Aaron Klug and John Finch and moved to the Laboratory of Molecular Biology, Cambridge in 1962. From 1975 and 1976 he was acting Head of Outstation, EMBL Synchrotron Radiation Laboratory at DESY, Hamburg. He worked at the Max Planck Institute for Medical Research as an \"Emeritus Scientific Member\".\nIn 1981, he was elected a Fellow of the Royal Society, and was awarded their 1997 Gabor Medal which is of silver gilt and then accompanied by 1,000 pounds \"in recognition of his achievements in molecular biology, in particular his pioneering analyses of biological structures and viruses, and his development of the use of synchrotron radiation for X-ray diffraction experiments, now a widely used technique not only in molecular biology but in physics and materials science\".He was awarded both the European Latsis Prize worth 100,000 Swiss Francs in 2000 based on his work on \"Molecular Structure\", and the Gregori Aminoff Prize of the Royal Swedish Academy of Sciences in 2001.His scientific biography of Sir Aaron Klug, \"Aaron Klug - A Long Way from Durban: A Biography\" \nwas published in 2017 by Cambridge University Press.\nIn 2021, he received the Lennart Philipson Award.Holmes died on 2 November 2021, at the age of 86.", "link_mentions": [{"page": "Rosalind Franklin", "response": ["Despite the parting words of Bernal to stop her interest in nucleic acids, she helped Gosling to finish his thesis, although she was no longer his official supervisor. Together they published the first evidence of double helix in the A form of DNA in the 25 July issue of Nature. At the end of 1954, Bernal secured funding for Franklin from the Agricultural Research Council (ARC), which enabled her to work as a senior scientist supervising her own research group.Maddox, p. 235.Brown, pp. 356–357. John Finch, a physics student from King's College London, subsequently joined Franklin's group, followed by Kenneth Holmes, a Cambridge graduate, in July 1955. Despite the ARC funding, Franklin wrote to Bernal that the existing facilities remained highly unsuited for conducting research \"...my desk and lab are on the fourth floor, my X-ray tube in the basement, and I am responsible for the work of four people distributed over the basement, first and second floors on two different staircases.\""]}, {"page": "European Latsis Prize", "response": ["|Kenneth Holmes"]}, {"page": "Holmes (surname)", "response": ["* Kenneth Holmes (1934–2021), British scientist"]}, {"page": "Kenneth Charles Holmes", "response": ["#REDIRECTKenneth Holmes"]}, {"page": "List of people associated with Birkbeck, University of London", "response": ["* Kenneth Holmes, crystallographer"]}, {"page": "Sliding filament theory", "response": ["In spite of strong evidence, the sliding filament theory did not gain any support for several years to come. Szent-Györgyi himself refused to believe that myosin filaments were confined to the thick filament (A band). F.O. Schmitt, whose electron microscope provided the best data, also remained sceptical of the original images. There were also immediate arguments as to the organisation of the filaments, whether the two sets (myosin and actin) of filaments were merely overlapping or continuous. It was only with the new electron microscope that Hugh Huxley confirmed the overlapping nature of the filaments in 1957. It was also from this publication that the existence of actin-myosin linkage (now called cross-bridge) was clearly shown. But he took another five years to provide evidence that the cross-bridge was a dynamic interaction between actin and myosin filaments. He obtained the actual molecular arrangement of the filaments using X-ray crystallography by teaming up with Kenneth Holmes, who was trained by Rosalind Franklin, in 1965. It was only after a conference in 1972 at Cold Spring Harbor Laboratory, where the theory and its evidence were deliberated, that it became generally accepted. At the conference, as Koscak Maruyama later recalled, Hanson had to answer the criticisms by shouting, \"I know I cannot explain the mechanism yet, but the sliding is a fact.\" The factual proofs came in the early 1980s when it could be demonstrated the actual sliding motion using novel sophisticated tools by different researchers."]}]}}