{"wiki_id": "http://www.wikidata.org/entity/Q6391248", "itemLabel": "Kenny Wharton", "itemDescription": "English footballer (born 1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenny_Wharton", "wikipedia_page": {"main": "Kenneth Wharton (born 28 November 1960) is an English former professional footballer, who is currently the manager of Newcastle Blue Star FC.", "link_mentions": [{"page": "November 28", "response": ["*  1960   – Kenny Wharton, English footballer and coach"]}, {"page": "Neale McDermott", "response": ["McDermott started his career at Newcastle United. As a youth team player, McDermott and his team mates James Beaumont and Ross Gardner lodged a complaint against academy Peter Beardsley and academy director Kenny Wharton accusing the pair of bullying.  Wharton and Beardsley were cleared after an inquiry from The FA. Gardner and Beaumount left the club shortly after to join Nottingham Forest while McDermott joined Fulham on the January transfer deadline day in 2003. While at Fulham, McDermott had two loan spells at Swindon Town and Darlington."]}, {"page": "Peter Ramage", "response": ["Ramage played in the same youth team as Taylor, Michael Chopra and Adam Rundle under Alan Irvine, before later being coached by former Newcastle players Kenny Wharton and Peter Beardsley. He would later partner Taylor in central defence when they broke into the first team. In the reserve team he was coached by another former United player, Tommy Craig. In March 2003, Ramage won the Jackie Milburn Trophy, given each year to the rising star of north-east football. He worked his way through Newcastle's youth system and captained the Newcastle reserve side before making his breakthrough to the first team squad."]}, {"page": "Bill McGarry", "response": ["He headed abroad and replaced Ferenc Puskás as coach of the Saudi Arabian national team, but soon returned to England. Port Vale tried to hire him after sacking Roy Sproson in October 1977, but he rejected their terms. He was appointed as manager of Newcastle United the following month, after Richard Dinnis's brief and unsuccessful reign at St James' Park. He gave Kenny Wharton his first professional contract, who would go on to play for the club for eleven years. He also signed Peter Withe, Alan Shoulder, and Bobby Shinton. He could not stop the \"Magpies\" suffering relegation out of the First Division in the 1977–78 season. He could only take United to two mid-table finishes in the Second Division in 1978–79 and 1979–80, before he was fired just weeks into the 1980–81 season after his team were knocked out of the League Cup by Third Division club Bury. Arthur Cox was appointed as his successor."]}, {"page": "List of Newcastle United F.C. players", "response": ["|align=\"left\"|Kenny Wharton||||LM/LB||1978–1989||290||26||"]}, {"page": "List of Bradford City A.F.C. players (1–49 league appearances)", "response": ["|Kenny Wharton||||1989–1990||5||0||"]}, {"page": "1987–88 Newcastle United F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Kenny Wharton"]}, {"page": "1984–85 Newcastle United F.C. season", "response": ["Kevin Carr; Malcolm Brown, Jeff Clarke/John Anderson, Glenn Roeder, Wes Saunders/Kenny Wharton; Neil McDonald, David McCreery, Pat Heard, Kenny Wharton/Chris Waddle; Peter Beardsley and Chris Waddle/George Reilly"]}, {"page": "1988–89 Newcastle United F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Kenny Wharton"]}, {"page": "1983–84 Newcastle United F.C. season", "response": ["Martin Thomas; John Anderson, Steve Carney, Glenn Roeder, John Ryan\\Kenny Wharton; Terry McDermott, David McCreery, Kenny Wharton/John Trewick; Peter Beardsley, Kevin Keegan and Chris Waddle"]}, {"page": "Wharton (name)", "response": ["* Kenny Wharton (born 1960), English footballer"]}]}}