{"wiki_id": "http://www.wikidata.org/entity/Q6394451", "itemLabel": "Kerry Anne Mullaney", "itemDescription": "British film director, writer and producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Kerry_Anne_Mullaney", "wikipedia_page": {"main": "Kerry Anne Mullaney is a Scottish film director, writer and producer. She won the 2009 Best Director (Silver Unicorn) award at the 10th Estepona International Horror and Fantasy Film Festival for her 2008 triller/horror film The Dead Outside. She was also nominated for the 2009 BAFTA Scotland awards in the Best Director, Writer and New Work categories.\nShe runs the New Abbey, Scotland based film production company Mothcatcher along with producer Kris Bird. She was born in Dumfries and is a graduate of Edinburgh College of Art.\n\n", "link_mentions": [{"page": "List of zombie films", "response": ["| The Dead Outside || Kerry Anne Mullaney || 2008 || || "]}, {"page": "Edinburgh College of Art", "response": ["* Kerry Anne Mullaney, film director"]}, {"page": "London FrightFest Film Festival", "response": ["Monday: The Dead Outside with Dir. Kerry Anne Mullaney and Prod/co-writer Kris Bird, the Film4 FrightFest short film showcase (The Chest, The Amazing Trousers, Homework, is anyone there, Psycho Hillbilly Massacre, Total Fury), Norman J. Warren introduced a separate compendium of shorts, Preview footage from Into the Dark: Exploring the Horror Film introduced by Prod. Paul McEvoy, preview footage from Dead Set with Charlie Brooker, The Disappeared with Dir. Johnny Kevorkian, preview footage from Lesbian Vampire Killers with actress MyAnna Buring, Mirrors, trailer for Friday the 13th remake, Death Race."]}, {"page": "Mullaney", "response": ["* Kerry Anne Mullaney (born 1975), Scottish film director"]}, {"page": "The Dead Outside", "response": ["The Dead Outside is a 2008 Scottish horror/thriller film, the feature debut of director Kerry Anne Mullaney (who also co-wrote the film), produced independently by Mothcatcher Films."]}, {"page": "Kerry anne mullaney", "response": ["#REDIRECT Kerry Anne Mullaney"]}]}}