{"wiki_id": "http://www.wikidata.org/entity/Q6396226", "itemLabel": "Kevin Ellis", "itemDescription": "Welsh rugby union and rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Kevin_Ellis_(rugby)", "wikipedia_page": {"main": "Kevin Ellis (born 29 May 1965) is a Welsh former professional rugby league and rugby union footballer who played in the 1980s, 1990s and 2000s. A Great Britain and Wales national representative. He played club level rugby union (RU) for Bridgend RFC, Maesteg RFC (two spells), Treorchy RFC, Sale Sharks, London Irish, Cardiff RFC, Pontypool RFC and Ebbw Vale RFC, at representative level rugby league (RL) for Wales, and at club level for Warrington Wolves, Workington Town, Gold Coast Chargers, Bridgend Blue Bulls and Celtic Crusaders, as a stand-off, scrum-half, or loose forward, i.e. number 6, 7, or 13.Ellis won caps for Wales (RL) while at Warrington in 1991 against Papua New Guinea, in 1992 against France, England, and France, in 1993 against New Zealand, in 1994 against France, and Australia, in 1995 against England, and France, in the 1995 Rugby League World Cup against France, Western Samoa, and England, while at Bridgend Blue Bulls in 2003 against Russia, and Australia, and in 2004 against Ireland, and won a cap for Great Britain while at Warrington in 1991 against France. He was selected to go on the 1992 Great Britain Lions tour of Australia and New Zealand.\nEllis played scrum-half in Warrington's 12-2 victory over Bradford Northern in the 1990–91 Regal Trophy Final during the 1990–91 season at Headingley Rugby Stadium, Leeds on Saturday 12 January 1991.\nIn May 2010 he announced that he would be returning to rugby at the age of 45 for the club that he was coach for, Maesteg RFC in the SWALEC Final.\nEllis also became a patron of Healing the Wounds, a British charity launched in December 2009 to help provide support and care for British servicemen and women suffering from Post Traumatic Stress Disorder.", "link_mentions": [{"page": "1995 Rugby League World Cup", "response": ["*  Kevin Ellis"]}, {"page": "Iestyn Harris", "response": ["While still playing for Bradford, Harris was appointed Wales Assistant Coach on 18 June 2008. On 22 September 2009, Harris was appointed Wales's rugby league head coach, succeeding John Dixon. Appointed alongside Harris were the more experienced Kevin Ellis and Clive Griffiths, and the trio's first match was against England on 17 October, which they lost 48–12."]}, {"page": "Crusaders Rugby League", "response": ["The rest of 2005 was spent preparing for the upcoming season.The Guardian – Crusaders Looking Up. Retrieved 29 August 2010. On 13 November, Kevin Ellis was appointed Assistant Coach and a few days later on 16 November Anthony Seibold was appointed Fitness and Conditioning Coach. By the end of November coach John Dixon had completed his squad, drawn heavily from Bridgend Blue Bulls and Aberavon Fighting Irish clubs.", "Progress was made off the pitch too. David Thompson announced that he had negotiated a deal between the Crusaders, Sky TV, the RFL, and S4C whereby Sky would surrender its rugby league exclusivity allowing S4C to televise live Crusader games. S4C commissioned Y Clwb Rygbi 13 programme in June, firstly covering the Crusaders versus Barrow match liveWestern Mail – S4C Tries Rugby League. Retrieved 3 September 2010.League Unlimited – Crusaders To Be Screened Live . Retrieved 3 September 2010. and then continuing to broadcast nine matches overall in 2007 and 2008.S4C – Y Clwb Rygbi 13. Retrieved 30 August 2010.S4C – A Crusade For Super League . Retrieved 30 August 2010. In August the foundations were laid for an Academy side for the 2008 season with the best players from the Welsh Conference league being picked for the team.Crusaders RL – August 2007 . Retrieved 30 August 2010. Housebuilder Redrow Homes renewed their shirt sponsorship dealCrusaders RL – October 2007 . Retrieved 30 August 2010. whilst a new branding of the club's logo, badge and jersey was announced on 3 December promoting a more progressive and modern image. After achieving promotion the team were nominated for the BBC Wales Sports Team of the Year award, but lost out to the New Saints.BBC Sport – Calzaghe Claims Award. Retrieved 30 August 2010. After leaving for Queensland at the end of the 2006 season, former coach Anthony Seibold returned to the club as Assistant Coach, operating alongside Kevin Ellis.Crusaders RL – December 2007 . Retrieved 30 August 2010."]}, {"page": "Gold Coast Chargers", "response": ["*    Kevin Ellis (1996)"]}, {"page": "Pontypool RFC", "response": ["*  Kevin Ellis"]}, {"page": "Keighley Cougars", "response": ["* Kevin Ellis"]}, {"page": "Workington Town", "response": ["* Kevin Ellis won caps for Wales while at Warrington, Workington Town, and Bridgend Blue Bulls 1991...2004 14(15?)-caps + 1-cap (sub) 2(5?)-tries (1-drop-goal?) 13(21?)-points", "* Kevin Ellis, 1994–95, former Great Britain & Wales international."]}, {"page": "Bridgend Ravens", "response": ["*  Kevin Ellis"]}, {"page": "1994 Kangaroo tour of Great Britain and France", "response": ["The Kangaroos played an international tour match against Wales at Ninian Park in Cardiff on 30 October wearing their non-Test Australian jumpers for the game (for the first time in Kangaroo Tour history, the Kangaroos non-Test jumpers included yellow hoops around the waist leaving the traditional jumper to be used only in the Tests). In the first meeting of the two nations since the 1982 Kangaroo tour, the Australians ran in eight tries to one in a 46–4 win, played on a heavy ground and in driving rain before 8,729 fans. The match proved to be spiteful and produced two dark spots. Welsh dual international John Devereux suffered a badly broken jaw after he accidentally collided with Mal Meninga's left shoulder when attempting to tackle the Australian captain. Later an all-in-brawl erupted after Kangaroos second-rower Paul Sironen reacted to a high tackle from Welsh halfback Kevin Ellis on Kangaroo halfback Allan Langer.", "|SH ||7|| Kevin Ellis", "Although they were also without their superstar and inspirational captain Jonathan Davies who had dislocated his right shoulder in the first Ashes Test just 8 days earlier at Wembley, the Welsh team still boasted plenty of international rugby league experience with players like Phil Ford, Anthony Sullivan, John Devereux, Kevin Ellis, Jonathan Griffiths, Paul Moriarty and Rowland Phillips. In Davies' absence, the Dragons were captained by front row forward Dai Young. For the Australian's, only Greg Florimo had yet to play test football."]}, {"page": "List of North Queensland Cowboys representatives", "response": ["*    Kevin Ellis (1995)"]}, {"page": "Kevin Ellis", "response": ["Kevin Ellis may refer to:", "* Kevin Ellis (rugby) (born 1965), Welsh rugby league and rugby union footballer", "* Sir Kevin Ellis (politician) (1908–1975), Liberal member of the New South Wales Legislative Assembly", "* Kevin Ellis (skeleton racer) (born 1973), American skeleton racer", "* Kevin Ellis (Australian rules footballer) (born 1944), Australian footballer", "* Kevin Ellis (footballer, born 1977), English footballer", "* Kevin Ellis (soccer, born 1991), American soccer player", "* Kevin Ellis (True Blood)"]}, {"page": "Treorchy RFC", "response": ["*  Kevin Ellis "]}, {"page": "Bridgend Blue Bulls", "response": ["*Kevin Ellis won caps for Wales while at Warrington in 1991 against Papua New Guinea, in 1992 against France, England, and France, in 1993 against New Zealand, in 1994 against France, and Australia, in 1995 against England, and France, in the 1995 Rugby League World Cup against France, Western Samoa, and England, while at Bridgend Blue Bulls in 2003 against Russia, and Australia, and in 2004 against Ireland, and won a cap for Great Britain while at Warrington in 1991 against France", "*Kevin Ellis - Wales & Great Britain RL, Wales RU (status - retired)"]}, {"page": "1995 North Queensland Cowboys season", "response": ["Former Eastern Suburbs Roosters prop Wayne Sing, who played 20 games, was named Player of the Year and Players' Player at the end of the season. The Cowboys would also have three players participate in the 1995 Rugby League World Cup. Jonathan Davies (a former Welsh rugby union international) and Kevin Ellis (who spent the entire season in reserve grade) both represented Wales, while Robert Piva (a recruit from Wakefield Trinity) represented Western Samoa.", "| Kevin Ellis || Warrington Wolves", "|Kevin Ellis|| Wales "]}, {"page": "1996 North Queensland Cowboys season", "response": ["| Kevin Ellis || Gold Coast Chargers"]}, {"page": "Brynteg School", "response": ["* Kevin Ellis (Warrington Wolves), Wales, 15 caps 1991-2004, Great Britain, 1 cap 1991"]}, {"page": "1990 Kangaroo tour of Great Britain and France", "response": ["|SH ||7||Kevin Ellis"]}, {"page": "2003 Kangaroo tour of Great Britain and France", "response": ["|align=\"center\"|Kevin Ellis||align=\"center\" style=\"background: #eeeeee\"|LF||align=\"center\"|Luke Ricketson"]}, {"page": "2006 Celtic Crusaders season", "response": ["|Kevin Ellis || 29/5/65 || 3 || 1 || 0 || 0 || 4", "|30/4/06 || Barrow || A || Lost || 32-16 || 20-0 || Duggan (57), Morgan (70), Simm (79) || Quinn 2/3 || N/A || 979 || Tony Duggan, Lenny Woodard, Dean Scully, Geraint Davies, Paul Morgan, Luke Young, Damien Quinn, Ryan Barton, Michael Hook, Phil Cushion, Karl Hocking, Shawn Van Rensburg, David Simm || Kevin Ellis, Hywel Davies, Matt Jobson, Anthony Seibold ||-", "|19/3/06 || Group 1 || Hemel Hempstead || H || Won || 72-14 || 36-0 || Barton (8), Morgan (27), K. Ellis (31), Hocking (34,48,73), Epton (37), G. Davies (43,53,72), De Chenu (55), O'Connor (66), O'Kelly (70) || Johnston 10/13 || N/A || 476 || Carl De Chenu, Grant Epton, Geraint Davies, Lenny Woodard, Paul Morgan, Richard Johnston, Kevin Ellis, Ryan Barton, Scott O'Kelly, Phil Cushion, Gareth James, Dean Scully, David Simm || Andy Llewellyn, Marcus Sainsbury, Karl Hocking, Lloyd O'Connor ||- ", "|26/3/06 || Group 1 || St Albans || H || Won || 62-0 || 40-0 || De Chenu (1), Johnston (3,32), Dixon (22,36), Hocking (26), Epton (30,44), G. Davies (41), Fitzgerald (49), Williams (78) || Hook 6/7, Johnston 3/4 || N/A || 263 || Richard Johnston, Carl De Chenu, Neil Dixon, Lenny Woodard, Grant Epton, Micheal Hook, Kevin Ellis, Andy Llewellyn, Scott O'Kelly, Karl Hocking, Dean Scully, Geraint Davies, David Simm || Dean Fitzgerald, Marcus Sainsbury, Carle Ellis, Lee Williams ||-"]}, {"page": "Kevin Ellis (rugby league)", "response": ["#REDIRECT Kevin Ellis (rugby)"]}, {"page": "List of Great Britain national rugby league team players", "response": ["* Kevin Ellis circa-1991", "*Kevin Ellis"]}]}}