{"wiki_id": "http://www.wikidata.org/entity/Q6390004", "itemLabel": "Kenneth Crawford", "itemDescription": "British Army general (1895-1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenneth_Crawford", "wikipedia_page": {"main": "General Sir Kenneth Noel Crawford,   (25 June 1895 – 5 March 1961) was a British Army officer who reached high office in the 1940s.", "link_mentions": [{"page": "Bernard Montgomery", "response": ["However, Montgomery was barely on speaking terms with his fellow service chiefs, sending his deputy Kenneth Crawford to attend their meetings and he clashed particularly with Sir Arthur Tedder, who was by now Chief of the Air Staff (CAS)."]}, {"page": "Neil Ritchie", "response": ["Having gained a Regular commission in 1914, Ritchie remained in the army throughout the difficult interwar period. He served as adjutant to the 2nd Battalion, Black Watch until 28 February 1921 and, from 18 July 1923 until 30 September 1927, was a General Staff Officer Grade 3 (GSO3) at the War Office. He attended the Staff College, Camberley as a student from 1929 to 1930. Among his fellow students there included several future general officers, such as George Erskine, Hugh Stable, Herbert Lumsden, Ivor Hughes, Neil McKicking, Harold Freeman-Attwood, James Elliott, Harold Redman, Reginald Denning, Kenneth Crawford, Kenneth Strong, Temple Gurdon, Philip Balfour, Hugh Russell, John Edwards, Bernard Campbell Fletcher, John Winterton and Henry Vulliamy."]}, {"page": "Chief Royal Engineer", "response": ["*1958–1961: Sir Kenneth Crawford"]}, {"page": "Crawford (name)", "response": ["*Kenneth Crawford (1895–1961), British army officer"]}, {"page": "List of British Army full generals", "response": ["| Sir Kenneth Crawford"]}, {"page": "Ken Crawford", "response": ["* Sir Kenneth Crawford (1895–1961), British Army general"]}, {"page": "Deputy Chief of the General Staff (United Kingdom)", "response": ["* Lieutenant-General Sir Kenneth Crawford 1947–1949"]}, {"page": "Ivor Hughes", "response": ["Remaining in the army during the interwar period, Hughes was posted to the 2nd Battalion, Queen's in 1919 and, by now a lieutenant, went with the battalion to India, where he became the battalion's assistant adjutant. During his time serving on the North-West Frontier he was mentioned in despatches and awarded the Indian General Service Medal. Hughes was appointed as adjutant to the battalion in 1925 and returned with the battalion to England in 1927. Hughes, by now a captain, then attended the Staff College, Camberley from 1929 to 1930, where his fellow students included numerous future general officers, such as Neil Ritchie, Herbert Lumsden and George Erskine, Reginald Denning, Hugh Stable, Kenneth Crawford, Temple Gurdon, Neil McMicking, I. S. O. Playfair, Harold Redman, James Elliott and Harold Freeman-Attwood."]}]}}