{"wiki_id": "http://www.wikidata.org/entity/Q6396294", "itemLabel": "Kevin Fong", "itemDescription": "British doctor", "wikipedia_url": "https://en.wikipedia.org/wiki/Kevin_Fong", "wikipedia_page": {"main": "Kevin Jeremy Fong  (born 21 May 1971) is a British doctor and television presenter. He is a consultant anaesthetist and anaesthetic lead for Major Incident Planning at UCL Hospitals. He is an Honorary Senior lecturer in physiology at UCL where he organises and runs an undergraduate course Extreme Environment Physiology. \nFong also flies as a prehospital doctor with Air Ambulance Kent Surrey Sussex. In addition, he is an expert on space medicine in the UK and is the co-director of the Centre for Aviation Space and Extreme Environment Medicine (CASE Medicine), University College London (UCL).\nFong is best known for his television appearances, particularly as an occasional presenter of the long-running BBC2 science programme, Horizon. He presented the 2012 Channel 4 series Extreme A&E where he visited trauma centres all over the world. In 2015, he presented the Royal Institution Christmas Lectures, an annual series of lectures in front of a live audience of schoolchildren, and broadcast on BBC Four, with the subject 'How to Survive in Space'.", "link_mentions": [{"page": "Apollo 13", "response": ["In 2020, the BBC World Service began airing 13 Minutes to the Moon, radio programs which draw on NASA audio from the mission, as well as archival and recent interviews with participants. Episodes began airing for Season 2 starting on March 8, 2020, with episode 1, \"Time bomb: Apollo 13\", explaining the launch and the explosion. Episode 2 details Mission Control's denial and disbelief of the accident, with other episodes covering other aspects of the mission. The seventh and final episode was delayed due to the COVID-19 pandemic. In \"Delay to Episode 7\", the BBC explained that the presenter of the series, medical doctor Kevin Fong, had been called into service.13 minutes to the moon, season 2, BBC podcast accessed April 14, 202013 Minutes to the moon accessed April 13, 2020."]}, {"page": "Chris Hadfield", "response": ["In 2017, Hadfield hosted the BBC show Astronauts: Do You Have What It Takes? alongside Kevin Fong and Iya Whiteley, where 12 contestants compete to earn Hadfield's approval and recommendation as a candidate for future applications to become an astronaut. The challenges involved replicated real tests carried out by the different Space Agencies at facilities in Europe and America, including hypoxia and centrifuge training, with contestants eliminated each week. "]}, {"page": "Propellerheads", "response": ["Their version of \"On Her Majesty's Secret Service\" featured as a choice of Horizon presenter Kevin Fong on Desert Island Discs, as this was the track he played every morning when driving to the Kennedy Space Center while working with NASA."]}, {"page": "List of overseas Chinese", "response": ["*Kevin Fong, space physiologist, United Kingdom"]}, {"page": "Fong", "response": ["*Kevin Fong (born 1971)"]}, {"page": "Royal Institution Christmas Lectures", "response": ["In 1994, Professor Susan Greenfield became the first female scientist to present the Christmas Lectures. The first non-white science lecturer was Kevin Fong in 2015, and in August 2020 it was announced that Professor Christopher Jackson would jointly present the 2020 lecture series, thus becoming the first black scientist to do so.", "| Kevin Fong"]}, {"page": "Christopher Riley", "response": ["He produced Kevin Fong's 2011 portrait of the Space Shuttle for BBC Two and Produced and Directed a 2012 film presented by Dallas Campbell which celebrated thirty-five years of NASA's Voyager Program for BBC Four.  The same year Riley collaborated with Neil Armstrong's family to produce and direct the biopic First Man on the Moon, which premiered on BBC Two at the end of 2012 and on PBS Nova in December 2014.  The film included interviews with Armstrong's sister June, brother Dean, and childhood friend Kocho Solacoff. – Neil Armstrong: First Man on the Moon (2012 TV Movie) Full Cast & Crew, IMDB"]}, {"page": "Shaken and Stirred: The David Arnold James Bond Project", "response": ["The Propellerheads version of On Her Majesty's Secret Service featured as a choice of Horizon presenter Kevin Fong on Desert Island Discs as this was the track he played every morning when driving to the Kennedy Space Center while working with NASA."]}, {"page": "The Museum of Curiosity", "response": ["|Kevin Fong"]}, {"page": "List of British Chinese people", "response": ["* Kevin Fong, professor of medicine, UCL academic."]}, {"page": "Ellison–Cliffe Lecture", "response": ["* 2012 Kevin Fong, on Medicine for Mars"]}, {"page": "Dr Kevin Fong", "response": ["#REDIRECT Kevin Fong"]}, {"page": "Dr. Kevin Fong", "response": ["#REDIRECT Kevin Fong"]}, {"page": "Stargazing Live", "response": ["After a two-year hiatus, Stargazing Live returns for a one-off live special on BBC Two to air on Monday July 15, 2019 from 9.00pm - 10.30pm. To celebrate the 50th anniversary of the Apollo 11 moon landing, Dara O'Briain and Professor Brian Cox travelled to Cape Canaveral, Florida where the historic Apollo 11 mission began. They heard first hand from Apollo 16 astronaut Charlie Duke on what it was like to guide Neil Armstrong and Buzz Aldrin to the surface of the Moon in the Lunar Lander, and how Duke followed in their footsteps three years later. They also look at the most exciting new developments and, with privileged access, they broadcast from the top of launch tower that is being prepared for crewed missions and from the assembly line of a spacecraft factory. They are joined by astrophysicist and medic Dr Kevin Fong and mathematician Dr Hannah Fry, who explored the latest developments in human space flight - from cutting-edge spacewalk technology to a future Mars buggy."]}, {"page": "Extreme A&E", "response": ["Extreme A&E is a British medical documentary set in various trauma centres across the world. It follows Kevin Fong as he visits world-renowned trauma centres. It aims to show trauma medicine through the eyes of a doctor."]}, {"page": "Dr Kevin J Fong", "response": ["#redirect Kevin Fong"]}, {"page": "It's Not Rocket Science", "response": ["It's Not Rocket Science is a British television show that aired on ITV in 2016. It was presented by Rachel Riley, Ben Miller, and Romesh Ranganathan. The resident scientist was Kevin Fong."]}, {"page": "Nahum (artist)", "response": ["Some KOSMICA participants have included Kevin Fong, Tomás Saraceno, Ariel Guzik, Aleksandra Mir, Empress Stah, Yuri Suzuki, Honor Harger, Roger Malina, Marko Peljhan, Nelly Ben Hayoun, Katie Paterson, Agnes Meyer-Brandis, Kapwani Kiwanga, Bompas & Parr, Frederik De Wilde, Nicola Triscott, Anais Toneur, Carey Young, Christopher Riley, Dragan Živadinov, Sarah Jane Pell and Tania Candiani. \"KOSMICA created an open, affable environment where the topics ranged from philosophy to the social importance of Star Trek.\""]}, {"page": "KOSMICA", "response": ["KOSMICA activities have put together an international network of artists, cultural practitioners and space professionals. Among the 180 participants are Kevin Fong, Tomás Saraceno, Ariel Guzik, Aleksandra Mir, Empress Stah, Yuri Suzuki, Honor Harger, Roger Malina, Marko Peljhan, Nelly Ben Hayoun, Katie Paterson, Agnes Meyer-Brandis, Kapwani Kiwanga, Bompas & Parr, Frederik De Wilde, Nicola Triscott, Anais Toneur, Carey Young, Christopher Riley, Dragan Živadinov, Sarah Jane Pell, Semiconductor, Angelo Vermaulen (Seeker), Richard Clar, Patricio Guzmán, Tania Candiani and Nahum."]}]}}