{"wiki_id": "http://www.wikidata.org/entity/Q6390541", "itemLabel": "Kenneth Noye", "itemDescription": "English criminal (brinks-mat thief, road rage killer)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenneth_Noye", "wikipedia_page": {"main": "Kenneth James Noye (born 24 May 1947) is an English criminal who was sentenced to life imprisonment for murdering Stephen Cameron in a road rage incident while on licence from prison in 1996. He was arrested in Spain two years later and convicted of the crime four years after it occurred.\nA former police informant, Noye was acquitted in 1985 for the murder of a police officer on the grounds of his home, and was convicted in 1986 of handling stolen goods from the Brink's-Mat robbery, serving eight years in prison of a 14-year sentence.\nNoye was released on parole in 2019.", "link_mentions": [{"page": "GCHQ", "response": ["Operations that used GCHQ's intelligence-gathering capabilities in the 1990s included the monitoring of communications of Iraqi soldiers in the Gulf War, of dissident republican terrorists and the Real IRA, of the various factions involved in the Yugoslav Wars, and of the criminal Kenneth Noye. In the mid 1990s GCHQ began to assist in the investigation of cybercrime."]}, {"page": "M25 motorway", "response": ["In 1996, Kenneth Noye murdered Stephen Cameron in a road rage incident while stopped at traffic lights on an M25 junction in Kent. He was convicted in 2000 and sentenced to life imprisonment. He was released in June 2019."]}, {"page": "Bexleyheath", "response": ["* Kenneth Noye (1947–), gangster and convicted murderer, born on Lavernock Road"]}, {"page": "Michael Mansfield", "response": ["As well as representing those wrongly convicted of the IRA's Guildford and Birmingham pub bombings, Mansfield has represented: the Angry Brigade; Dolours and Marian Price; Brian Keenan; the Orgreave miners; Mahmood Hussein Mattan, Ruth Ellis and James Hanratty (in posthumous appeals); those involved in the Israeli Embassy bombing; Frank Crichlow, owner of the Mangrove restaurant; Stephen Lawrence's family; Michael Barrymore at the Stuart Lubbock inquest; Barry George at the inquest into the death of Jill Dando; the gangster Kenneth Noye; the Bloody Sunday families; Arthur Scargill; Angela Cannings; Fatmir Limaj, a Kosovo-Albanian leader prosecuted in the Hague; Mohamed al-Fayed in the inquest into the deaths of his son Dodi al-Fayed and Diana, Princess of Wales; and the families of Jean Charles de Menezes and Mark Duggan. "]}, {"page": "List of gangsters by city", "response": ["*Kenneth Noye"]}, {"page": "Brink's-Mat robbery", "response": ["Micky McAvoy had entrusted part of his share to associates Brian Perry and George Francis. Perry recruited Kenneth Noye, who was an expert in his field, to dispose of the gold. Noye melted down the bullion and recast it for sale, mixing in copper coins to disguise the source. However, the sudden movement of large amounts of money through a Bristol bank came to the notice of the Bank of England, which informed the police."]}, {"page": "List of British gangsters", "response": ["|Kenneth Noye"]}, {"page": "Clerkenwell crime syndicate", "response": ["Tommy Adams was charged with involvement in the handling of Brink's-MAT gold bullion but in 1985 was cleared of involvement in the laundering of the proceeds during a high-profile Old Bailey trial with co-defendant Kenneth Noye.", "The Adams family have long been connected to the Brink's-Mat robbery and other individuals who helped sell the stolen gold, including Kenneth Noye."]}, {"page": "2000 in the United Kingdom", "response": ["** Kenneth Noye, the so-called \"M25 killer\", is sentenced to life imprisonment."]}, {"page": "Bexleyheath Academy", "response": ["* Kenneth Noye, notorious criminal"]}, {"page": "Noyes", "response": ["* Kenneth Noye, British criminal"]}, {"page": "Kenny Noye", "response": ["#REDIRECT Kenneth Noye"]}, {"page": "HM Prison Blantyre House", "response": ["In 2000 a large raid (named Operation Swinford) at Blantyre House caused controversy amongst the press and politicians. Prison authorities claimed the raid was needed to expose potential deep-rooted corruption at the prison. The Prison Service claimed that investigations stretched back to the original allegations in 1996, and involved Kenneth Noye allegedly placing a prisoner at Blantyre House as part of a fraud plot. The following year Blantyre House was singled out as having the best community relations of any prison in the UK along with one of the lowest re-offending rates."]}, {"page": "HM Prison Standford Hill", "response": ["* Kenneth Noye"]}, {"page": "HM Prison Swaleside", "response": ["*Kenneth Noye"]}, {"page": "Crimewatch", "response": ["Despite initial police concerns about involvement (only three forces out of more than 40 agreed to participate initially), Crimewatch developed a special status with police and was credited with an expertise of its own, notably through Nick Ross' long experience with public appeals. Unlike the American equivalent, America's Most Wanted, Crimewatch itself usually appeals for unsolved cases inviting viewers to be armchair detectives. According to the producers, about a third of its cases are solved, half of those as a direct result of viewers' calls. Its successes have included some of Britain's most notorious crimes, including the kidnap of Stephanie Slater and murder of Julie Dart, the M25 rapist, the road-rage killing by Kenneth Noye, and the capture of two boys for the abduction and murder of James Bulger.", "|Kenneth Noye||Murderer||"]}, {"page": "List of people from the London Borough of Bexley", "response": ["*Kenneth Noye (1947–), gangster and convicted murderer, born on Lavernock Road, Bexleyheath, attended Bexleyheath School."]}, {"page": "2000 in England", "response": ["* 14 April – Kenneth Noye, the so-called \"M25 killer\", sentenced to life imprisonment."]}, {"page": "List of Freemasons (E–Z)", "response": ["* Kenneth Noye, British criminal; Hammersmith LodgeNoye's tangled web of corruption , Independent on Sunday, 14 April 2000"]}, {"page": "British firms (organised crime)", "response": ["*  Kenneth Noye firm"]}, {"page": "Noye (surname)", "response": ["#REDIRECT Kenneth Noye"]}, {"page": "Noye (disambiguation)", "response": ["* Kenneth Noye (born 1947), British criminal"]}, {"page": "Crimes That Shook Britain", "response": ["#The Murder of Stephen Cameron; a 21-year-old man who was stabbed to death by another motorist on the M25 in a \"road rage\" incident, in front of his 17-year-old girlfriend. Kenneth Noye is found guilty of the murder."]}]}}