{"wiki_id": "http://www.wikidata.org/entity/Q6399577", "itemLabel": "Khalid Sheldrake", "itemDescription": "Pickle manufacturer, self-proclaimed King of Islamistan", "wikipedia_url": "https://en.wikipedia.org/wiki/Khalid_Sheldrake", "wikipedia_page": {"main": "Khalid Sheldrake, born Bertie William Sheldrake, (1888–1947) was an English pickle manufacturer who converted to Islam and in 1934 was briefly declared king of Islamistan in the Xinjiang region of China in the Warlord era.", "link_mentions": [{"page": "Sheldrake", "response": ["*Khalid Sheldrake, British pickle manufacturer and self-proclaimed \"King of Islamistan\""]}, {"page": "Fazl Mosque, London", "response": ["The Fazl Mosque (English: The Grace Mosque) also known as The London Mosque, is the first purpose-built mosque in London, England. It was opened on 23 October 1926 in Southfields, Wandsworth. At a cost of £6,223, the construction of the mosque and the purchase of the land on which it stands, was financed by the donations of Ahmadi Muslim women in Qadian, Punjab, British India,Marzia Balzani.'An ethnographer among the Ahmadis: Learning Islam in the suburbs' in Gabriele Marranci (ed.) Studying Islam in Practice. Routledge, 2014, p.111.B. A. Jacobsen et al.'The Ahmadiyya Mission to the Nordic Countries' in J. R. Lewis & I. B. Tøllefsen (eds.) Handbook of Nordic New Religions. Brill, 2015, p.367. with support from the British Muslim convert Khalid Sheldrake. Between 1984 and 2019 the Fazl Mosque was the residence of the caliphs of the Ahmadiyya Muslim Community, and therefore its de facto international headquarters. The administrative headquarters now lies at the site of the Islamabad, Tilford. "]}, {"page": "Review of Religions", "response": ["Although the articles were initially intended to feature translations of Ghulam Ahmad's lectures, the Review soon extended its range to include the writings of prominent followers as well as lectures and articles by Western converts to Islam. British subscribers who contributed articles to the Review included converts such as the Irish Peer Baron Lord Headley, Yahya Nasser Parkinson and Khalid Sheldrake. Contact between the British Muslim converts and Qadian grew through the Review under the leadership of Hakim Nur-ud-Din the first Ahmadi caliph, as did their literary contributions towards the magazine; something which may have conveyed the urgency of establishing an Islamic mission in Britain for the Ahmadis in India following Quilliam's departure from England."]}, {"page": "Gladys Milton Palmer", "response": ["In 1932 Palmer converted from Christianity to Islam. Stating that she wished her \"conversion to be performed on no earthly territory\", she chartered an Imperial Airways 42-seat airliner to fly from Croydon Airport to Paris. Another British Muslim convert, Khalid Sheldrake, conducted the ceremony over the English Channel. Sheldrake gave her the Arabic name \"Khair-ul-Nissa\" (\"fairest of women\") or \"Khair un-nisa binti 'Abdu'llah\"."]}, {"page": "Bertram Sheldrake", "response": ["#REDIRECT Khalid Sheldrake"]}]}}