{"wiki_id": "http://www.wikidata.org/entity/Q6395786", "itemLabel": "Kevin Barrett", "itemDescription": "Welsh cricketer (born 1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kevin_Barrett_(cricketer)", "wikipedia_page": {"main": "Kevin Barrett (born 16 November 1975) was a Welsh cricketer. He was a left-handed batsman and right-arm medium-pace bowler who played for Devon. He was born in Swansea.\nBarrett began his career playing with Glamorgan Colts and Glamorgan Under-19s between 1992 and 1993, and played for the Second XIs of Essex, Surrey, and Somerset between 1995 and 2000. This included spending two seasons (1999 and 2000) on the Surrey C.C.C. playing staff. Chin up Nick Cole.\nBarrett's debut List A appearance came in the 1998 NatWest Trophy against Yorkshire, against whom he scored three runs.\nBarrett made his second and final List A appearance four years later, in the 2002 C&G Trophy, against Yorkshire, in which he scored 6 runs.", "link_mentions": [{"page": "List of Devon County Cricket Club List A players", "response": ["In their thirty-three List A matches, 101 players have represented Devon. Andrew Pugh has appeared the most times for the county, playing in eighteen matches, closely followed by Nick Folland, who made sixteen appearances. Robert Dawson recorded the highest score in List A cricket for Devon, scoring 139 runs against Cumberland in 2002. Dawson, who played 64 first-class matches for Gloucestershire is Devons's leading run-scorer, having scored 492 runs in his thirteen appearances for the county. Andrew Procter's fourteen wickets for the county is the most by any player, but Robert Healey has the best bowling figures, having taken six wickets against Hertfordshire in his only match in 1969. Andrew Hele, who appeared for Devon on six occasions, has claimed the most dismissals as wicket-keeper, taking eight catches and making two stumpings. Ten non-English players have appeared for Devon; Australia's Braddon Green and Stuart MacGill, Malaysia's Arul Suppiah, New Zealand's Roger Twose, Pakistan's Agha Zahid and Aqeel Ahmed, South Africa's JP Duminy and Vernon Philander and Wales' Kevin Barrett and Steve Tomlinson."]}, {"page": "Kevin Barrett", "response": ["Kevin Barrett may refer to:", "* Kevin Barrett (rugby union) (born 1980), English rugby union player", "* Kevin Barrett (footballer) (1915–1984), Australian rules footballer", "* Kevin Barrett (game designer), role-playing game designer", "* Kevin Barrett (cricketer) (born 1975), Welsh cricketer"]}]}}