{"wiki_id": "http://www.wikidata.org/entity/Q6390955", "itemLabel": "Kenny Allen", "itemDescription": "Footballer (born 1948)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenny_Allen_(footballer)", "wikipedia_page": {"main": "Kenneth Richard Allen (born 12 January 1948) is an English retired professional football goalkeeper.\nKenny Allen began his career as an amateur with Hartlepool, who he joined in August 1968 from non-league Tow Law Town, a side later to produce Chris Waddle. He played only 7 league games for Hartlepool, before leaving, turning up next at South African side Hellenic. In December 1972 he returned to England, signing for West Bromwich Albion, but left without appearing in their league side.\nHe had a spell with Workington before joining Bath City in July 1973. He made nearly 300 appearances for Bath over the next five years.\nIn August 1978, Allen joined AFC Bournemouth, where he was to make 152 league appearances. In 1983, he signed for Bury on non-contract terms, but failed to make the first team, and in December 1983 he joined Peterborough United, playing only once in the Associate Members' Cup at home to Wrexham. Peterborough proved to be an unhappy place for Allen a couple years later when, as a Torquay player, he was attacked on the pitch by Peterborough 'fans'.\nFrom Peterborough, he moved to Sweden, playing for Halmstads BK, before joining Torquay United on a free transfer in March 1984, taking over from John Turner as first choice goalkeeper, making his début in a 2–1 defeat away to Hartlepool United on 17 March.\nIn September 1985, he left Plainmoor to join Swindon Town again on a free transfer. He played 40 league games the following season as Swindon won the Fourth Division title, but early the following season he lost his place to Fraser Digby, only playing a further 5 league games, before being transferred back to Torquay in December 1986 as a replacement for John Smeulders.\nBy now his grey hair and moustache made him instantly recognisable and he helped Torquay to remain in league football, playing in the first great escape when Torquay drew 2–2 with Crewe Alexandra at Plainmoor thanks to a late equaliser from Paul Dobson and help from the police dog Bryn biting Jim McNichol ensuring that injury time would be required. The following season, he was an ever-present as Cyril Knowles' side made the play-offs, but was released in the summer, joining Bath City in July 1988. He began the season as a regular, but after only nine games, broke his leg while conceding a penalty against Dorchester Town. He regained his fitness, but was released in February 1989.He moved on to recently relegated Newport County, but as Newport folded and failed to complete their Conference season, he returned to Torquay for a third time in April 1989 to cover for the injured Ken Veysey and played at Wembley in the Associate Members' Cup Final as Torquay's only other professional keeper Mark Coombe was cup-tied. He retired from football in June 1989 to work for the Post Office.\nIn May 2001, the Torquay Herald Express reported that Allen was living in Paignton, captaining Chudleigh cricket team and working as an ambulance driver for the South & West Devon Health Authority", "link_mentions": [{"page": "January 12", "response": ["*1948 – Kenny Allen, English footballer"]}, {"page": "1948", "response": ["** Kenny Allen, English footballer"]}, {"page": "Torquay United F.C.", "response": ["During this time Lew Pope had taken over as chairman from Tony Boyce, and in February 1984 former Chelsea favourite Dave Webb took charge of the club. Webb brought in ex-Bournemouth players Derek Dawkins and goalkeeper Kenny Allen to strengthen the squad, and also attracted the former internationals Eddie Kelly and Tony Currie to the club, United would go on to finish the season in a strong 9th place."]}, {"page": "1948 in the United Kingdom", "response": ["** Kenny Allen, footballer"]}, {"page": "Kenneth Allen", "response": ["Kenneth or Kenny Allen may refer to:", "* Kenny Allen (archer) (born 1969), British Paralympic archer", "* Kenny Allen (racing driver) (born 1956), former driver in the Craftsman Truck Series", "* Kenny Allen (footballer) (born 1948), retired English professional football goalkeeper", "* Kenny Allen (American football) (born 1994), American football punter and placekicker"]}, {"page": "Moturoa AFC", "response": ["AFC Bournemouth toured New Zealand and in early June played a Taranaki Invitation XI at Pukekura Park in front of 750 spectators in blustery weather and slippery conditions. At the time of the tour AFC Bournemouth had just won promotion to Football League Third Division. The AFC Bournemouth team included; Ian Leigh, John Impey, Brian Mundee, Chris Sulley, Milton Graham, Nigel Spackman, Keith Williams, Howard Goddard and Derek Dawkins. Injuries would see Bournemouth's coach Harry Redknapp and manager David Webb take the field for the English side playing its seventh game in fifteen days around the North Island. AFC Bournemouth, who scored 27 goals on the tour, had conceded only two before the match in New Plymouth, one against the Franklin County XI from Frank Verheyen and the other against Napier City Rovers scored by Graeme Hill. On Bournemouth's team list were also Brian O'Donnell, Andy Crawford, Richard Donovan, Tommy Heffernan, Phil Brignull and keeper Kenny Allen. Taranaki, playing in a gold coloured strip, won the match 2–1. It would be the only loss the Cherries would experience on their eight match national tour. Coached by Don Harris and assistant Chris MacIntosh, the Taranaki XI included captain Barry Cooper, Dan Hook and Wayne Gould from Moturoa-Spotswood AFC, keeper Hugh Davidson and Peter Burmester from Old Boys, Hawera's Peter Bodnar, City's Peter Dolan, Taranaki United's John Russell, Steve Lazarus, Schane Manley, Mick Mayhew and reserve keeper Wayne Martin with two guest players from Manurewa AFC, Kevin Birch and Mark Donaghue."]}, {"page": "Ian Leigh", "response": ["Leigh began his career in non-League football with Swaythling, leaving them as a seventeen-year-old in October 1979 to join Football League team Bournemouth. Leigh made his professional debut for Bournemouth in 1981 after replacing the injured Kenny Allen in an away game against Peterborough United, a game in which Bournemouth lost 1–0. Over the next five seasons, Leigh made 123 appearances in the Football League for Bournemouth. While playing in the FA Cup against defending champions Manchester United in January 1984, Leigh kept a clean sheet in a 2–0 victory, and was rewarded with a  lifetime supply of pizzas from a local Italian restaurant. The deal stayed in place for over a year, until Bournemouth's then manager Harry Redknapp bought the restaurant, citing the fact that Leigh was getting, \"a bit fat, a little bit lumpy.\" He also played as Bournemouth won the inaugural Associate Members' Cup by beating Hull City in the final. Towards the end of his Bournemouth career, Leigh spent brief loan spells at Bristol City and Torquay United, making one and four appearances respectively. After Leigh left Bournemouth in 1986, he briefly played non-League football for Bashley, before moving to Malta to play with Hamrun Spartans, where he spent a further six seasons. Leigh was renowned for his powerful long shots, and became Ħamrun Spartans' penalty taker."]}, {"page": "Ken Allen (footballer)", "response": ["#REDIRECT Kenny Allen (footballer)"]}, {"page": "1989 Associate Members' Cup Final", "response": ["| || ||Kenny Allen"]}]}}