{"wiki_id": "http://www.wikidata.org/entity/Q6396118", "itemLabel": "Kevin Davy", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Kevin_Davy", "wikipedia_page": {"main": "Kevin G. Davy (born 29 October 1961, Nottingham, UK) is a British jazz trumpeter/flugelhorn player, composer, arranger and bandleader. He has recorded with and toured with Finley Quaye, Lamb, Adam F and Lemn Sissay's Secret Society. He has led the Kevin Davy Quartet (KDQ), D’Semble, and Kevin Davy's Monster Jam . In 1992 Davy was given the Manchester Jazz Musician of the Year Award by BBC Radio Manchester show The People.Relocating to Manchester in 1986, Davy studied at the Manchester Metropolitan University, attaining a Bachelor of Arts Degree (B.A) in General Arts (Humanities) in 1990. While enrolled there he attended the weekly jazz improvisation workshops organized by Colin Stansfield in the nearby All Saints College, subsumed into the campus of Manchester Metropolitan University.", "link_mentions": [{"page": "Last Amendment", "response": ["* Savage Utopia – featuring Eve Libertine, Christine Tobin, A-Soma, Louise Elliot, Kevin Davy, Phil Robson, Liam Noble, Davide Mantovani, Matt Black (of Coldcut) performing work by Penny Rimbaud (Babel Label/Exitstencil, 2004)"]}, {"page": "Hulme", "response": ["Morrissey, lead singer of the Smiths, spent his childhood in Hulme and neighbouring Stretford. Jazz trumpeter Kevin Davy lived in Hulme during his time as a student at Manchester Polytechnic. Poet and BBC Radio 4 presenter Lemn Sissay spent the first 17 years of his life in care, in Hulme and its surrounding areas. Musician, author and TV presenter John Robb lives in Hulme. Billy Duffy (guitarist with The Cult) grew up in Hulme."]}, {"page": "Lamb (electronic band)", "response": ["* Kevin Davy - trumpet, flugelhorn, pocket trumpet (1996-2000, 2004, 2017–present)"]}, {"page": "Fear of Fours", "response": ["* Kevin Davy – trumpet"]}, {"page": "Cultureshock at the 2002 Commonwealth Games", "response": ["*27 July – Kevin Davy's Commonwealth Jam, Band on the Wall"]}, {"page": "Lunacy (album)", "response": ["*Kevin Davy – trumpet on \"Kiss\""]}, {"page": "Doudou Gouirand", "response": ["With the very successful Nino Rota/Fellini album (Deux Z/Harmonia Mundi, 1995), acclaimed arrangement and composition work done around Nino Rota's film music, he explored a more European and typically Mediterranean idiom, while keeping a lot of improvisation. Between 1996 and 1998, he toured in France and Switzerland with \"Third Dimension\", a trio with Mal Waldron and vocalist Jeanne Lee. The group did not release any recordings. His album Passages (June 1999, distributed by Harmonia Mundi) features Rita Marcotulli, JJ Avenel, J. Allouche, plus Elise Caron (vocals) and Kevin Davy (trumpet).", "* Passages (1999, Deux Z), with Rita Marcotulli, Jean-Jacques Avenel, Joël Allouche, Kevin Davy and Elise Caron", "* Indigo Song - Les Racines du Ciel (2002, RDC/Plume/BMG), with Cheikh Tidiane Seck, Baptiste Trotignon, G. Pansanel, Hadja Kouyate, Yakhouba Sissoko, Ali Boulo Santo, Moriba Koita, A. Wague, S. Everett, J.J. Avenel, Kevin Davy, Pinise Saul, Pibo Marques, Marcia Escoffery, Samir Toukour"]}]}}