{"wiki_id": "http://www.wikidata.org/entity/Q6405436", "itemLabel": "Kieran Murphy", "itemDescription": "Footballer (born 1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kieran_Murphy_(footballer)", "wikipedia_page": {"main": "Kieran Thomas Murphy (born 21 December 1987) is an English professional footballer, who plays for Hemel Hempstead Town.\nPreviously at Milton Keynes Dons where he made his professional debut away to Brighton & Hove Albion, Murphy then got the chance to study at Loughborough University and stopped playing professional football. He joined Ilkeston Town F.C. before the start of the 2008–09 season and had a magnificent first year at the club, picking up two separate player of the year awards and is currently team captain. Murphy also currently plays for the first XI for the Loughborough Students Football Team in the Midland Football Combination. He played in the Universiade for Great Britain in 2011 and captained them in 2013.", "link_mentions": [{"page": "Walton & Hersham F.C.", "response": ["*  Kieran Murphy"]}, {"page": "Kieran Murphy", "response": ["Kieran Murphy may refer to:", "* Kieran Murphy (rugby union) (born 1988), Welsh rugby union player", "* Kieran Murphy (Sarsfields hurler) (born 1983), Irish hurler for Sarsfields and Cork", "* Kieran Murphy (Erin's Own hurler), Irish hurler for Erin's Own and Cork", "* Kieran Murphy (footballer) (born 1987), Irish footballer", "* Kieran Murphy (cyclist), Australian Paralympic tandem cyclist"]}, {"page": "Kieron Murphy", "response": ["#REDIRECT Kieran Murphy (footballer)"]}, {"page": "Football at the 2013 Summer Universiade", "response": ["| James Aldred James Baldwin James Belshaw Alex Dyer Luke Graham Timothy Horn Joe Lolley Sammy MacVicar Gavin Malin Thomas McCready Craig Moses Kieran Murphy George Nash Marc Newsham Jake Parrott Nicholas Platt Michael Rae Simon Richman George Williams Jack Winter"]}, {"page": "Great Britain at the 2013 Summer Universiade", "response": ["| Kieran Murphy || St. Mary's University College"]}, {"page": "2007–08 Milton Keynes Dons F.C. season", "response": ["As a result of their promotion the Milton Keynes Dons returned to Football League One after two seasons in League Two. Prior to the club's return to League One, the MK Dons released Drewe Broughton, Matt Carbon, Sam Collins, Liam Kelly, Jake Livermore and Kieran Murphy, while Mustapha Carayol, Lloyd Dyer and Gareth Edds left on their own accord for Torquay United, Leicester City and Tranmere Rovers. New players to join were midfielders Flavien Belson from FC Metz, Peter Leven from Chesterfield and Florian Sturm from FC Vaduz.", "| 16 November 2007 || DF ||  Kieran Murphy || "]}]}}