{"wiki_id": "http://www.wikidata.org/entity/Q6404493", "itemLabel": "Kid Harpoon", "itemDescription": "English singer, songwriter, musician and record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Kid_Harpoon", "wikipedia_page": {"main": "Thomas Edward Percy Hull (born 20 April 1982), known professionally as Kid Harpoon, is an English singer, songwriter, musician and record producer.", "link_mentions": [{"page": "Chatham, Kent", "response": ["Recent Medway artists of note include Kid Harpoon, Crybaby Special and The Monsters, Red Light, Underground Heroes, Tyrannosaurus Alan, Pete Molinari, Lupen Crook, Brigadier Ambrose, Stuart Turner and Theatre Royal.", "*Kid Harpoon, singer, songwriter, musician and record producer. Born and lived in Chatham. Working with award-winning artists including Jessie Ware, Shaun Mendes, Harry Styles, Florence and The Machine, Haim and Year & Years."]}, {"page": "Milkmaid", "response": ["* Kid Harpoon has a song called \"Milkmaid\"; the music video features actress Juno Temple."]}, {"page": "Mystery Jets", "response": ["The band's debut UK album, Making Dens, was released on 6 March 2006. On 18 September 2006, the band put on a tribute show to Syd Barrett, one of their biggest influences. The show was put on at the Union Chapel in Islington, London. Performers were Kid Harpoon, Lupen Crook, Kate Nash, Dan Treacy and the Television Personalities, Drew from Babyshambles, Ben from SixToes, Lucas from the Cazals and Mystery Jets. The groups created a special fanzine made for the show with entries from all the performers and artwork by the bands."]}, {"page": "Harpoon (disambiguation)", "response": ["*Kid Harpoon (born 1982), English singer"]}, {"page": "The Joe Strummer Foundation", "response": ["A cover of The Clash's \"Janie Jones\", retitled as \"Janie Jones (Strummerville)\", was released by B-Unique Records in October 2006 as a charity single for Strummerville.  The record was nominally credited to \"Babyshambles and Friends\" – in addition to the band Babyshambles, performers included Jamie T, Jeremy Warmsley, Kid Harpoon, Laura Marling, and Lisa Moorish, as well as members of Cazals, Dirty Pretty Things, GoodBooks, Guillemots, The Kooks, Larrikin Love, The Libertines, Macabees, Mystery Jets, Noisettes, The Paddingtons, The Rakes, and We Are Scientists. It reached No. 17 on the UK Single Chart. "]}, {"page": "Medway scene", "response": ["*Kid Harpoon"]}, {"page": "The Holloways", "response": ["They toured with Babyshambles, The Pogues, The Kooks, The Rakes, The Wombats, The Pigeon Detectives and CSS, as well as helping launch careers of Frank Turner, Kid Harpoon and Johnny Lloyd of Tribes inviting them to support on their numerous UK tours."]}, {"page": "Perfect Songs", "response": ["In recent years, Perfect has signed David Jordan (singer) (whose 2007 debut album, Set The Mood, has sold over 150,000 copies), singer-songwriter Kid Harpoon, Alistair Griffin, and Tim Hutton (whose recent co-writes include Ian Brown and Sugardaddy, a partnership with Tom Findlay from Groove Armada).", "* Kid Harpoon - \"Her Body Sways\""]}, {"page": "Juno Temple", "response": ["Temple has also appeared in the music videos for Kid Harpoon's \"Milkmaid\" and Plushgun's \"Just Impolite\"."]}, {"page": "Underage Festival", "response": ["The Horrors were originally scheduled to play the Main Stage, but had to pull out due to recording commitments. They were replaced by Dizzee Rascal. Mystery Jets were also scheduled to open the festival with a set on the Main Stage, but pulled out just a few days before due to their lead singer Blaine Harrison being in hospital. They were replaced with Kid Harpoon."]}, {"page": "Janie Jones (song)", "response": ["* Kid Harpoon"]}, {"page": "Konk (album)", "response": ["After initially promoting the album with Logan until September 2008, bass duties for the remainder of the album cycle were taken over by Pete Denton, who had also previously filled in for Rafferty and would eventually become a full member of the band. Drummer Paul Garred would also be forced to abandon touring for three months in mid-2008 due to an injury to his left arm; he was initially replaced on tour by Nick Millard (formerly of Crackout)https://mobile.onmilwaukee.com/music/articles/kooksreview.html before returning. Garred then left again in late 2009, and Chris Prendergast, who had been the drummer for Kooks tourmate Kid Harpoon, joined in 2010 as both live drummer and band member during initial sessions for the next album.http://www.sentimentalistmag.com/2011/09/07/the-kooks-the-future-sounds-like-sunshine/"]}, {"page": "Electric Gardens", "response": ["*Kid Harpoon", "*Kid Harpoon"]}, {"page": "Lounge On The Farm", "response": ["*Kid Harpoon"]}, {"page": "Florence and the Machine", "response": ["The first demo session occurred in January 2010 with Welch and Paul Epworth at a small London studio. Numerous producers expressed an interest in working on the album but Welch rejected the offers because she wanted Ceremonials to be a better version of Lungs with a \"more dark, more heavy, bigger drum sounds, bigger bass, but with more of a whole sound\". For the rest of the year work on the album continued only intermittently as the band concentrated on an extensive tour of the US, where Lungs had become popular. The majority of the writing for the album was done between January and April 2011, with recording taking place in April at Abbey Road Studios. Refinement took place at Epworth's own London studios while Welch recorded vocal tracks in various US studios, during days off from touring. The final recording session took place in July at Epworth's studio. Epworth co-wrote seven tracks. Several other British writers share credits on the album, including Summers, Kid Harpoon, James Ford and composer Eg White."]}, {"page": "Florence Welch", "response": ["! scope=\"row\"| \"Riverside\"(Kid Harpoon and Florence Welch (backing vocals))"]}, {"page": "Jeff Bhasker", "response": ["| Kid Harpoon, Alex Salibian, Tyler Johnson", "| Kid Harpoon, Alex Salibian, Tyler Johnson"]}, {"page": "Pukkelpop 2008", "response": ["*Kid Harpoon"]}, {"page": "Field Day (festival)", "response": ["The inaugural Field Day festival took place on 11 August 2007, with the first Underage Festival taking place the same weekend. Over fifty artists featured across four stages, as well as a musical bandstand. Artists included the 1990s, Absentee, Adem, Alberta Cross, Andrew Weatherall, Archie Bronson Outfit, Bat for Lashes, Battles, Caribou, Casper C, The Cock N Bull Kid, Crispin Dior, El Plate, Electrelane, Erol Alkan, Euros Childs, Fanfarlo, Filthy Dukes, Florence and the Machine, Foals, Four Tet, Fridge, GoodBooks, Gruff Rhys, Hannah Holland, James Yorkston, Jo Jo de Freq, Justice, Kid Harpoon, Late of the Pier, Laura Marling, Liars, Matt Walsh, Matthew Dear, Miss Odd Kidd, Mystery Jets, Nadia Ksaiba, Patchwork Pirates, The Pictish Trail, Pull Tiger Tail, Skull Juice, The Aliens, The Concretes, The Earlies, The Lovely Jonjo, Vetiver, Warboy, White Rabbits, Young Turks and Zombie Disco Squad. Originally being billed as a capacity of 6,000, the amount was increased to 10,000 shortly before the festival."]}, {"page": "Skrillex discography", "response": ["! scope=\"row\"| \"Fire Away\"(featuring Kid Harpoon)"]}, {"page": "Thomas Hull", "response": ["*Kid Harpoon, stage name of Tom Hull (born 1982), English singer-songwriter"]}, {"page": "Never Let Me Go (Florence and the Machine song)", "response": ["\"Never Let Me Go\" was written by Florence Welch, Paul Epworth and Kid Harpoon while production was handled by Epworth. Florence and the Machine premiered \"Never Let Me Go\" along with two other songs from the album, \"Spectrum\" and \"Heartlines\" as part of their set list at New York's Creators Project on 15 October 2011, two weeks before the release of the album.Sources talking about the premiere of \"Never Let Me Go\", \"Spectrum\" and \"Heartlines\" on 15 October 2011 during the band's set list at New York's Creators Project before the release of Ceremonials:", "Category:Songs written by Kid Harpoon"]}, {"page": "Devotion (Jessie Ware album)", "response": ["Devotion is the debut studio album by British singer-songwriter Jessie Ware. It was released in the United Kingdom on 20 August 2012 through PMR Records and Island, and later on 16 April 2013 through Cherrytree and Interscope in the United States. Production for the album came primarily from Dave Okumu of alternative rock band The Invisible, alongside house Record producer Julio Bashmore and Kid Harpoon with contribution from Wilma Archer, fellow UK musician and collaborator Sampha and Hassan Hamandi, while Ware co-wrote most of the album tracks' lyrics. ", "Except for the fifth track \"No to Love\", which was written and produced solely by Okumu, Ware co-wrote most of the album tracks' lyrics. Production for Devotion came primarily from Dave Okumu of alternative rock band The Invisible, whom produced twelve out of fourteen original recordings used for the album. Fellow British house record producer Julio Bashmore and singer Kid Harpoon also co-produced along with Okumu, with Bashmore handling solely the production of \"110%\" and Wilma Archer co-producing the eleventh track \"Something Inside\". Fellow UK musician and collaborator Sampha and Hassan Hamandi also contributed to two songs from the deluxe edition of the album, namely \"Strangest Feeling\" and \"What You Won't Do for Love\", with the former being released digitally on 14 October 2011 and the latter being premiered on 22 May 2012. Sampha was also credited as a collaborator on \"Valentine\", a song released previously on 14 February 2011 with Ware. The song was partly inspired by James Blake's song \"The Wilhelm Scream\" and based on both Ware and Sampha's own personal experiences in love.", "Devotion opens with the eponymous album track, a \"dark and dense\" song that hints at \"passion's underbelly\" with deep bass hit that portraits sonic signature by Okumu. The second track \"Wildest Moments\" is a \"boomy, earthy beats\" epic ballad that sings about the strength of friendship, with lyrics such as \"From the outside/Everyone's always wondering why we fight/Why do we fight?\" and Ware's vocal being a \"balancing act\" between \"gorgeous, bell-like\" synths and chiming piano chords. The song was among the \"most festival-ready songs-- big hooks, bigger drums\" produced by Kid Harpoon for the album. It was followed by the first single \"Running\", which saw Ware \"slinks and sighs\" over a yacht-rock groove, \"explodes at a key moment, then backs off again for an affecting conclusion\", gaining comparisons to that of Sade for her \"poised and pure\" voice over \"drums echo\" and \"repeated guitar lick\" which gave the song a \"lovely, sultry\" sound. The eight track of the album \"Sweet Talk\" is hailed as the record's most classically \"pop\" song, which finds Ware pleading \"Don't keep me with the kisses, there's never any there when I need,\" and hints at a \"Whitney Houston-like belt, but keeps it constrained\" within the song's \"chilly\" synths line, \"stuttering\" drum machine shuffle and \"gentle, neon-lit\" Rhodes piano riff. Meanwhile, the album's fourth track \"Still Love Me\" contains \"growing loop\" of effects and instruments that recalled the work of her previous collaborator SBKTRT, while \"No to Love\" is a song that contains \"grungy guitar loops, ADD beats, and rap verse from a Flight of the Conchords sound-alike\" ", "*Kid Harpoon – guitar, percussion, keyboards", "*Kid Harpoon – composer, programming, producer, engineer"]}, {"page": "Sweet Nothing", "response": ["\"Sweet Nothing\" was written by Calvin Harris, Florence Welch and Kid Harpoon, while production was handled by Harris. He also serves as the arranger and plays all instruments of the track. The song was recorded by Harpoon and mastered by Simon Dave. Welch, from the band Florence and the Machine, is the vocalist of the track. It is an electronic dance music song, following the familiar pattern of taking love-strung vocals and layering them over a bouncy, ever-building beat. The tale of \"Sweet Nothing\" is a romance with no depth. It addresses a relationship: \"You took my heart and you held it in your mouth/ And with a word all my love came rushing out/ And every whisper, it's the worst, emptied out by a single word,\" Welch begins the track.", "Category:Songs written by Kid Harpoon"]}, {"page": "18 Months", "response": ["* Kid Harpoon – vocal recording "]}, {"page": "Wildest Moments", "response": ["Category:Songs written by Kid Harpoon"]}, {"page": "Justin Young (singer, born 1987)", "response": ["Arriving in London for University, Young began playing solo and performed regularly under the stage name Jay Jay Pistolet, appearing on bills with Florence & The Machine, Kid Harpoon and Frank Turner."]}, {"page": "Night Light (song)", "response": ["\"Night Light\" is a song by British singer Jessie Ware from her debut studio album, Devotion. The song was released in the United Kingdom as a digital download on 25 September 2012. The song was written by Jessie Ware, Kid Harpoon and Dave Okumu. The song peaked at number 95 on the UK Singles Chart.", "* Lyrics – Jessie Ware, Kid Harpoon, Dave Okumu", "Category:Songs written by Kid Harpoon"]}, {"page": "Charlie Hugall", "response": ["| Kid Harpoon"]}, {"page": "Over the Love", "response": ["Category:Songs written by Kid Harpoon"]}, {"page": "Are You Getting Enough?", "response": ["\"Are You Getting Enough?\" is a song by British rapper Professor Green, featuring singer Miles Kane. It was released on 21 July 2013 and it only appears on the deluxe version of Growing Up in Public. The track features vocals from the British singer Miles Kane. The song was written by Professor Green, Miles Kane and Kid Harpoon, and produced by Kid Harpoon.", "Category:Songs written by Kid Harpoon"]}]}}