{"wiki_id": "http://www.wikidata.org/entity/Q640187", "itemLabel": "Kristian Thomas", "itemDescription": "British gymnast", "wikipedia_url": "https://en.wikipedia.org/wiki/Kristian_Thomas", "wikipedia_page": {"main": "Kristian James Thomas (born 14 February 1989 in Wolverhampton) is a British former artistic gymnast. A long-standing member of both the England and Great Britain men's teams, he was a member of the British team that won gold in the 2012 European Championships team event, and a historic bronze in the same event at the 2012 Summer Olympics. He won his first global individual medal in the 2013 World Championships, a bronze in vault; it was also the first global medal ever won in vault by a British male gymnast. In 2015 he won his first major international title, gold in the floor exercise at the 2015 European Artistic Gymnastics Championships.\nThomas was coached by Michelle Bradley and Alexei Popov, and is a member of the Earls gymnastics club. He was born in Wolverhampton.\nOn 19 October 2017 Kristian announced his retirement from gymnastics.", "link_mentions": [{"page": "February 14", "response": ["*  1989   – Kristian Thomas, English gymnast"]}, {"page": "List of Olympic medalists in gymnastics (men)", "response": ["|Sam OldhamDaniel PurvisLouis SmithKristian ThomasMax Whitlock "]}, {"page": "Wednesfield", "response": ["* Kristian Thomas – Olympic gymnast"]}, {"page": "Gymnastics at the 2006 Commonwealth Games", "response": ["| || ||Kristian Thomas||13.750||13.350||13.250||16.000||13.350||13.650||83.350"]}, {"page": "Thomas (surname)", "response": ["*Kristian Thomas (born 1989), British Olympic gymnast"]}, {"page": "List of people from Wolverhampton", "response": ["* Kristian Thomas (born 1989) – British artistic gymnast; member of the Earls gymnastics club; educated at St Edmund's Catholic School, Wolverhampton"]}, {"page": "Christian Thomas", "response": ["*Kristian Thomas (born 1989), British gymnast"]}, {"page": "World Artistic Gymnastics Championships – Men's team all-around", "response": ["| Brinn BevanJames Hall*Daniel PurvisLouis SmithKristian ThomasMax WhitlockNile Wilson"]}, {"page": "World Artistic Gymnastics Championships – Men's vault", "response": ["|  Kristian Thomas"]}, {"page": "2008 European Men's Artistic Gymnastics Championships", "response": ["| Youngest || Kristian Thomas || United Kingdom || 14/02/89 || 19 years"]}, {"page": "2010 European Men's Artistic Gymnastics Championships", "response": ["| align=\"left\" | Kristian Thomas"]}, {"page": "2010 World Artistic Gymnastics Championships", "response": ["| style=\"text-align:left;\"| Kristian Thomas", "In all 299 men competed in the qualifying round. Of these 164 complete all six apparatus. Each nation had up to six entrants, but were limited to two qualifiers for the 24-man final. Steven Legendre of the US, Kenya Kobayashi of Japan and Kristian Thomas of Great Britain ended 15th, 16th and 17th respectively, but were their nation's third best and did not progress to the final. Ruslan Paneleymonov (Britain, 19th) and Andrey Cherkasov (Russia, 21st) were the others affected by this policy. Kōhei Uchimura was the highest qualifier, more than two points ahead of Philipp Boy."]}, {"page": "Great Britain at the 2012 Summer Olympics", "response": ["| style=\"text-align:left;\" | Kristian Thomas", "| style=\"text-align:left;\" rowspan=\"2\"|Kristian Thomas"]}, {"page": "Sam Oldham", "response": ["Oldham was named as Great Britain's reserve gymnast to participate at the 2010 senior world championships in Rotterdam. He was the youngest member of the British men's team. The British team qualified for the final and finished seventh in the team all-around, although Oldham did not ultimately take part in the competition. In 2011, Oldham was included along with Samuel Hunter, Daniel Purvis, Theo Seager, Louis Smith and Kristian Thomas in the British squad travelling to Berlin, Germany for the 2011 European Artistic Gymnastics Championships from 6 to 10 April, again as the youngest member of the delegation representing Great Britain. Oldham qualified as the second reserve for the parallel bars final and in fourth place for the final on the horizontal bar.  He came fourth in the horizontal bar final, which was his first major senior final.", "On 19–25 May 2014, at the 2014 European Championships in Sofia. Oldham along with his teammates (Daniel Keatings, Daniel Purvis, Max Whitlock, Kristian Thomas) won Team Great Britain the silver medal behind Russia with a total score of 262.087 points. In event finals, Oldham won the silver medal in high bar (14.866) behind 2012 Olympic champion Epke Zonderland."]}, {"page": "Max Whitlock", "response": ["Whitlock competed as part of the British men's team for the 2015 World Artistic Gymnastics Championships in Glasgow, Scotland. After some minor mistakes in the qualification rounds, he tied for a place in the final with teammate Nile Wilson, but with the tiebreaker rules applied, Whitlock won the place to the individual all-around final. The men's team, which included team captain Kristian Thomas, Daniel Purvis, Louis Smith, Brinn Bevan, Nile Wilson and alternate James Hall, became the first British men's team to win a medal in the all-around team competition at a World Championships, winning a silver behind Japan. Whitlock and Purvis competed well in the Individual All-Round final. A fall on the High Bar kept Whitlock out of the medals, but he finished strongly on the Floor to gain a place in the top 8. He also posted the highest score on the pommel horse out of all the competitors - 16.100. On 31 October Whitlock competed in the Floor and pommel horse finals. He won the silver medal on floor behind world champion Kenzo Shirai, and later in the afternoon became the first British man ever to win a World Championship gold medal, with a score of 16.133 on the pommel horse. His teammate Louis Smith won the silver medal with a score of 16.033.", "On 12 July 2016, Whitlock was selected for Great Britain's 2016 Olympic gymnastic team, along with Louis Smith, Nile Wilson, Kristian Thomas and Brinn Bevan. He won a bronze medal in the all-round gymnastics event, Great Britain's first in this Olympic event for 108 years. He later went on to win the gold in the individual floor exercise, becoming the first British gymnast to win an individual gold. Within two hours he won a second gold in the individual pommel horse."]}, {"page": "Daniel Purvis", "response": ["Due to the British men's team failing to qualify for the Olympics at the World Championships in Tokyo, they were able to send a team to the Olympic Test event in London in January. Once again, Purvis gave a strong performance to help the team to qualify to the Olympics. Their qualifying score of 358.227 would have put them in 4th place going into team finals had they given the same performance in Tokyo. Purvis also got the highest all-around score at the event, with teammates Kristian Thomas and Daniel Keatings taking 2nd and 3rd place respectively.FIG Test Men's Results Summary – Retrieved 11 Jan 2012 In the apparatus finals he tied with Tomás González for victory in the floor.British Gymnastics London Prepares test event – Apparatus finals day one In May, Purvis led the British team in qualifications for the European Championships in Montpelier, despite having been ill with food poisoning the previous night. After only 3 hours sleep he started the competition on vault and fell into a judge's lap. Echoing a performance given by US gymnast Paul Hamm at the 2004 Summer Olympics he rallied, and went on to qualify with the highest all-around score. The team went on to win Britain's first team Gold in the finals. Although Purvis made the floor finals, it was decided by the team coaches that he would not compete to give him a rest after having been ill earlier in the week.British Gymnastics: MAG Euros day five – apparatus finals 27 May 2012 In June 2012, Purvis won the British Artistic Gymnastics Championships for the third consecutive time.", "At the London Olympics, Purvis was part of the bronze medal-winning GB men's team, competing on 30 July 2012 at the North Greenwich Arena, and competed in the all-around competition with teammate Kristian Thomas.", "On 19–25 May 2014, at the 2014 European Championships in Sofia. Purvis along with his teammates (Daniel Keatings, Sam Oldham, Max Whitlock, Kristian Thomas) won Team Great Britain the silver medal behind Russia with a total score of 262.087 points. In event finals, Purvis won the bronze medal in floor (15.400). At the 2014 Commonwealth Games, he won gold in the parallel bars and bronze in the rings, and helped Scotland win silver in the men's team event.", "In 2015 Purvis was given a berth to compete for Great Britain at the World Gymnastics Championships. Performing solid routines on all six events, Daniel helped the team qualify for a spot at the 2016 Olympic Games. He also qualified in 3rd for the men's all-around final ahead of British teammates Max Whitlock and Nile Wilson. On 29 October the British team went through all 18 routines without any falls, with Purvis and Whitlock anchoring the team's final score with magnificent performances on the floor. Purvis, Whitlock, Wilson, Kristian Thomas, Brinn Bevan and Louis Smith became the first British men's team to finish on podium at a World Championships securing the silver medal with a score of 270.345, ahead of reigning World and Olympic Champion team China (269.959) and behind the new World Champions, Japan (270.818). Two days later Purvis competed in the all-around final and finished in 7th. On 31 October he competed in the floor final, where he finished in 5th."]}, {"page": "2009 World Artistic Gymnastics Championships – Men's qualification", "response": ["|  style=\"height:30px; text-align:left;\"|Kristian Thomas|| style=\"text-align:left;\"|||14.050||14.050||14.225||16.075||13.850||14.550||86.800||Q"]}, {"page": "Gymnastics at the 2012 Summer Olympics", "response": ["|Sam OldhamDaniel PurvisLouis SmithKristian ThomasMax Whitlock "]}, {"page": "Steven Legendre", "response": ["Legendre joined the Senior National Team in 2009 where he was chosen to compete in the 2009 World Artistic Gymnastics Championships in London, England. He made the floor final where he placed 8th. The following year he traveled to Melbourne where he was part of the gold medal team in the Pacific Rim Championships, also winning the bronze medal for the floor exercise. Later he traveled to the 2010 World Artistic Gymnastics Championships in Rotterdam where he helped the team to a 4th-place finish in the team competition and again came 8th in the floor finals. In 2011 he was part of the bronze medal winning team at the 2011 World Artistic Gymnastics Championships. He again competed in the floor final, where he managed to improve on his previous rankings at past world competitions, finishing in 5th place behind bronze medalists Alexander Shatilov and Diego Hypólito. In 2013, he competed at the 2013 World Artistic Gymnastics Championships in Antwerp, Belgium. He tied with Hypolito for 5th place once again in the floor final and earned his first individual world medal, a silver on the vault behind Yang Hak Seon and ahead of Kristian Thomas."]}]}}