{"wiki_id": "http://www.wikidata.org/entity/Q6415495", "itemLabel": "Kirk Millar", "itemDescription": "Northern Ireland footballer (born 1992)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kirk_Millar", "wikipedia_page": {"main": "Kirk Steven Millar (born 7 July 1992) is a Northern Irish footballer who plays for NIFL Premiership side Linfield.", "link_mentions": [{"page": "2011 UEFA European Under-21 Championship qualification Group 5", "response": ["*Kirk Millar"]}, {"page": "2009–10 Oldham Athletic A.F.C. season", "response": [" | align=left|27 || align=left|FW || align=left|Kirk Millar"]}, {"page": "Carl Winchester", "response": ["In June 2011 he received his first call-up to the Northern Ireland under-20s team, alongside teammate Kirk Millar for July's Milk Cup tournament."]}, {"page": "2011–12 Oldham Athletic A.F.C. season", "response": ["|align=\"right\"|21||||MF||align=\"left\"|Kirk Millar"]}, {"page": "2012–13 Oldham Athletic A.F.C. season", "response": ["| Kirk Millar ", "| width=50px|21 || width=50px|MF || width=300px|Kirk Millar || width=50px|14 || width=50px|2 || width=50px|12 || width=50px|12 || width=50px|2 || width=50px|10 || width=50px|1 || width=50px|0 || width=50px|1 || width=50px|0 || width=50px|0 || width=50px|0 || width=50px|1 || width=50px|0 || width=50px|1", "| MF ||  || Kirk Millar || 1 || 0 || 0 || 0 ||  1"]}, {"page": "Sean Shields", "response": ["Shields was born in the London Borough of Enfield, but qualifies to play for Northern Ireland through his father, who was brought up in the country. In May 2013, the Irish Football Association got in touch with Dagenham & Redbridge about a possible call-up for Shields to the under-21 squad. In May 2013, Shields was called up for the 2015 UEFA European Under-21 Championship qualifier against Cyprus in Nicosia, after impressing in a three-day training camp. Shields made his debut in the 3–0 defeat, replacing Jude Winchester as a substitute. His second appearance came in September 2013, a 1–0 defeat to Belgium, where he again featured, this time replacing Kirk Millar as a half-time substitute."]}, {"page": "2013–14 Oldham Athletic A.F.C. season", "response": ["The Latics faced a summer of rebuilding on and off the pitch as 18 players were out of contract from the 2012–13 season and work finally recommenced on the demolition of the old Broadway Stand in preparation for its replacement by the new North Stand. Dean Bouzanis, Robbie Simpson, Connor Hughes, Liam Jacob, Alex Cisak, Lee Croft and Dan Taylor were all released at the end of the 2012–13 season with new contracts handed to Glenn Belezika, Cliff Byrne, Connor Brown, David Mellor, James Tarkowski and Kirk Millar as well as youngsters Joe Cooper, Chris Sutherland, Luke Simpson and Danny Gosset. Matt Smith opted to join Leeds United after his impressive run of goals during the 2012-13 FA Cup while Dean Furman joined former manager Paul Dickov at Doncaster Rovers and Jean-Yves Mvoto joined Barnsley.", "| Kirk Millar", "| width=50px|21 || width=50px|FW || width=300px|Kirk Millar || width=50px|8 || width=50px|2 || width=50px|6 || width=50px|5 || width=50px|2 || width=50px|3 || width=50px|1 || width=50px|0 || width=50px|1 || width=50px|1 || width=50px|0 || width=50px|1 || width=50px|1 || width=50px|0 || width=50px|1"]}, {"page": "2014–15 Oldham Athletic A.F.C. season", "response": ["Six of the first team squad who finished the 2013–14 season left the club after their contracts' expired: Jonathan Grounds, James Wesolowski, Terry Dunfield, Anton Rodgers, Charlie MacDonald and Kirk Millar. The club captain Korey Smith was sold to Bristol City. In Smith's place, Johnson signed  midfielders Liam Kelly from Bristol City and Mike Jones from Crawley Town. Joseph Mills, who had spent three months on loan during the 2013–14 season, was signed on a two-year contract. In addition, Johnson brought in defenders Brian Wilson and George Elokobi, midfielder Timothée Dieng and forwards Willy Gros, Amari Morgan-Smith and Jonathan Forte before the first game of the new season."]}]}}