{"wiki_id": "http://www.wikidata.org/entity/Q6417461", "itemLabel": "Kit Martin", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Kit_Martin", "wikipedia_page": {"main": "Kit Martin CBE (born 6 May 1947) is a British architectural designer and country house property developer.\nMartin is the son of Sir Leslie Martin, Professor of Architecture at the University of Cambridge. Since the 1970s Martin has specialised in the saving and restoration of country houses, by dividing them into smaller dwellings and apartments. He is an advisor to the Prince of Wales on the safeguarding of major historic buildings and remains an advisor to The Prince's Regeneration Trust (previously being a director of The Phoenix Trust), a trustee of Save Europe's Heritage, and a former member of the Historic Buildings Council for Scotland (now the Historic Environment Advisory Council for Scotland). Martin has restored and converted around twelve houses, eight in England and four in Scotland, as well as other types of historic building. He has used the company name Kit Martin (Historic Houses Rescue) Limited since 1974, and Historic Houses Rescue Limited from 1996. From 2004 to 2007 Martin was an advisor to Save Britain's Heritage on the proposed purchase of Dumfries House in Scotland. At his home, Gunton Park, Martin also restored the historic designed landscape, winning the Country Life Genius of the Place Award for 2007.Martin was appointed Commander of the Order of the British Empire (CBE) in the 2012 Birthday Honours for services to conservation.", "link_mentions": [{"page": "Cullen, Moray", "response": ["The main part of Cullen House dates from 1543. An east wing was added in 1711, and there were alterations by David Bryce in 1858. The House and estate buildings were converted into 14 dwellings in 1983 by Kit Martin. Prior to the use of Cullen House by the Earls of Seafield, the castle of Findlater, now a ruin, on a rocky coastal outcrop approximately  to the east, was the Earl's seat."]}, {"page": "Maristow House", "response": ["Maristow House in the parish of Bickleigh (formerly Tamerton Foliot),Risdon, Tristram (d.1640), Survey of Devon, 1811 edition, London, 1811, with 1810 Additions, p.402 Devon, England, is a large country house set in landscaped parkland, on the River Tavy to the north of Plymouth. It was built in about 1560, rebuilt in the mid-18th century and further remodelled in the early 20th century. Between 1798 and 1938 it was the residence of the Lopes family, Barons Roborough. The house was ruined by fire after World War II, but was restored and converted into apartments in the late 1990s by Kit Martin. It is a grade II* listed building, having been so designated on 29 March 1960."]}, {"page": "Burley, Rutland", "response": ["The mansion was converted into six dwellings by Kit Martin in 1993–98, with a further 22 dwellings on the estate. Previously the estate had been purchased by Asil Nadir in 1991."]}, {"page": "1947 in the United Kingdom", "response": ["* 6 May – Kit Martin, architect and author"]}, {"page": "Callaly Castle", "response": ["In 1987 it was divided into residential wings by the architect Kit Martin."]}, {"page": "Barlaston Hall", "response": ["It was bought by the Wedgwood pottery company in 1937,Marcus Binney and Kit Martin, The country house: to be or not to be (London, Save Britain's Heritage, 1982), p.105 but disrepair and subsidence due to coal mining brought the hall close to demolition in the early 1980s.  It was bought for £1 by a trust set up by Save Britain's Heritage and restored.  It has returned to use as a private residence.  The hall is a Grade I listed building.", "By the early 1980s, the hall was in a parlous state of decay, with few repairs for many years, water ingress, and a serious threat of subsidence having been undermined by coal workings.  Floorboards had been removed, most of the staircase had collapsed, and ceilings and plasterwork had fallen through to the basement.  Wedgwood made two applications to have the Grade 1 listed building demolished, and a public inquiry was convened. Save Britain's Heritage, with Kit Martin, architect Bob Weighton and engineering firm Peter Dann & Partners, formulated a plan to restore and protect the house.  The National Coal Board said that it would pay for the subsidence damage and preventative works to construct a raft under the building, so, early on 29 September 1981, Wedgwood offered to sell Barlaston Hall to Save Britain's Heritage for £1, on condition that the restoration was completed within five years, in default of which Wedgwood retained an option to repurchase the hall for £1."]}, {"page": "Stoneleigh Abbey", "response": ["In 1996 Lord Leigh transferred the ownership of Stoneleigh Abbey and its  grounds to a charitable trust, the Stoneleigh Abbey Preservation Trust, of which he himself was the Trustee.  Between 1996 and 2000 it was extensively renovated with the help of grants including a £7.3 million grant from the Heritage Lottery Fund and additional grants of more than £3 million from English Heritage fund and the European Union.Mark Thomas Product Series 2, Episode 5 on Channel 4 More than 1,000 tonnes of Grinshill stone were used to restore the exterior of the West Wing and up to 45 stonemasons were employed during the main stage of the work. The upstairs floors were initially converted into flats by Kit Martin and houses and apartments were established in the West Wing, South Wing and East Wing. The money received by the original Preservation charitable trust was the subject of an episode of The Mark Thomas Comedy Product, which proved that some of the trust's debts were paid using the National Lottery money earmarked for restoration, as well as paying for private development. With the failure of the preservation trust under Lord Leigh, a new independent charitable trust was set up to safeguard the future of the Abbey. With the ties to Lord Leigh severed, the new charitable trust acquired a new chairman, local business man Tony Bird OBE. In the early 2000s Charles Church built two groups of houses in the grounds of Stoneleigh Abbey, named The Cunnery and Grovehurst Park."]}, {"page": "Dingley, Northamptonshire", "response": ["The Hall continued as a family home until 1936. During World War II it was used as a nursing home. Although the estate was sold in 1958, the house was left to deteriorate until it was gutted in 1972. In 1978, it was bought by the architect Kit Martin who divided it into seven houses and three flats. Nothing is left of the original interiors."]}, {"page": "Tyninghame House", "response": ["On the death of the 9th Earl in 1858, the estate was inherited by a cousin, George Baillie of Mellerstain. His son, the 11th Earl, carried out further plantings in the 1880s, including the Walled Gardens. Formal gardens, including Lady Haddington's Secret Garden, were established by the 12th Earl and his wife in the 20th century. The house was featured in Country Life on 7 August 1975, and in Scottish Field in August 1953. After the 12th Earl died in 1986, the 13th Earl chose to retain Mellerstain House near Duns, Scottish Borders as his main residence, and Tyninghame was sold the following year. The bulk of the contents were auctioned by Sotheby's in a two-day sale at the house, on 28–29 September 1987. The house was then divided into apartments by country house developer Kit Martin."]}, {"page": "Country house conversion to apartments", "response": ["* Gunton Hall, Norfolk – 1980 by Kit Martin, estate into 20 dwellings.", "* Hazells Hall, Bedfordshire – 1981–82 by Kit Martin, into 8 houses and 4 apartments.", "* Dingley Hall, Northamptonshire – early 1980s by Kit Martin, into 7 houses and 3 apartments.", "* Callaly Castle, Northumberland – 1986–87 by Kit Martin.", "* Burley On The Hill, Rutland – 1993–98 by Kit Martin, into 6 apartments, estate into 22 dwellings.", "* Stoneleigh Abbey, Stoneleigh, Warwickshire – 1996–2000 by Kit Martin, into 53 dwellings.", "* Maristow House, Devon – 1996–2000 by Kit Martin."]}, {"page": "Formakin House", "response": ["When Holms died in debt in 1938, Formakin was sold to the Bradford-born entrepreneur Albert Ernest Pickard, owner of the Britannia Panopticon among other Glasgow ventures. It was requisitioned by the military during the Second World War, and maintenance began to decline. By the 1970s the buildings and grounds were derelict. After the Pickards died, a proposal was put forward to develop 195 houses on the estate, but planning permission was refused. Renfrew District Council campaigned to save the estate, eventually purchasing it in 1984 with funding from the National Heritage Memorial Fund. Formakin was operated as a visitor attraction for a time, and plans were made to redevelop the buildings and grounds. The venture was not successful, and Formakin was sold to developer Kit Martin, a specialist in country house restoration. Between 1988 and 1999 the estate buildings were restored and converted into 17 private dwellings."]}, {"page": "Gorzanów Castle", "response": ["* Marcus Binney, Kit Martin & Wojciech Wagner, Silesia: The Land of Dying Country Houses, London, Save Europe's Heritage, 2009. , ."]}, {"page": "Gunton Hall", "response": ["The estate belonged to the Gunton family in the 12th century, to the Berney family in the 16th century and later to the Jermyn family. The current house was built for Sir William Harbord, 1st Baronet in the 1740s by the architect Matthew Brettingham. In 1775 Harbord Harbord, 1st Baron Suffield, Member of Parliament for Norwich, commissioned James Wyatt to make significant additions to the house. The grounds were developed by Charles Harbord, 5th Baron Suffield, employing William Milford Teulon as the landscaper. However, the hall was almost destroyed by fire in 1882 and lay derelict for nearly a century before Kit Martin, an architect, bought the hall in 1980 and converted it into individual houses. It is surrounded by a 1,000 acre deer park. The boathouse was rebuilt as a studio by the artist Gerard Stamp in 2004."]}, {"page": "Cullen House", "response": ["Cullen House was inherited by Nina Ogilvie-Grant-Studley-Herbert, the 12th Countess of Seafield, in 1915. She did not use it as her primary residence, nor did her son Ian Ogilvie-Grant, who inherited it on her death in 1969. By the time it was designated a listed building three years later it had become dilapidated, and its contents were auctioned off shortly afterwards. In 1982, it was purchased by Kit Martin, a specialist in saving historic buildings. Martin worked with the local architect Douglas Forrest to convert the house into fourteen individual dwellings, retaining much of the original interior of the building. The house was badly damaged by fire in 1987, after which it underwent an extensive two-year programme of restoration. The subdivided house is still in use today as domestic accommodation.", "In 1982 the house was purchased by Kit Martin, an architectural designer who specialises in saving derelict historic buildings. He and the local architect Douglas Forrest set about repairing and restoring the structure, and together they converted it into fourteen separate private homes. On 17 June 1987, two years after the renovations had been completed, a fire broke out in the south wing which was being fitted out for new owners. Firefighters fought to contain the blaze, and although they managed to put it out within three hours, severe damage was caused to the south-east corner and the west wing. Restoration work was carried out over the course of the next two years, using photographic records and material recovered from the fire to restore the external masonry to its original appearance. Specialist joiners and plasterers were brought in to work on the interiors, but some of the building's internal features including an early seventeenth-century painted ceiling in the second salon were irreparably damaged. The subdivided house remains in use as privately owned domestic accommodation ."]}, {"page": "Douglas Forrest", "response": ["Forrest worked with architectural designer Kit Martin on the renovation of Cullen House between 1982 and 1989. He also oversaw the restoration of the clock and steeple of the former church in the nearby town of Cullen, Moray in 1986. He has worked on a project to save Wardhouse, an abandoned Palladian mansion near Insch, and on a scheme to convert the ruins of New Slains Castle into holiday accommodation."]}]}}