{"wiki_id": "http://www.wikidata.org/entity/Q6417293", "itemLabel": "Kissy Sell Out", "itemDescription": "DJ, producer and graphic designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Kissy_Sell_Out", "wikipedia_page": {"main": "Kissy Sell Out (born Thomas Bisdee on 18 June 1984 in Huntingdon, Cambridgeshire, England) is a British/Canadian DJ, producer, graphic designer, label manager of San City High Records and Stepper Man, part-time astrophysicist and science columnist for Sick Chirpse. Kissy Sell Out gained notability in 2006 for his electro music productions and energetic DJ style. In 2009 Mixmag described him as \"one of the most exciting, charismatic and entertaining DJs of the decade\".In addition to his DJ work, he has released six albums – Youth, Wild Romance, Introducing Kissy Sell Out, San City High All Stars Vol. 1 & 2, Style From The Westside – and composed official music for the 2012 Olympics ceremonies held in London.", "link_mentions": [{"page": "Cambridge Union", "response": ["On 9 May 2011, the Union launched its online public video service CUS-Connect, whereby recordings of past events and interviews were uploaded for free viewing. These have since been transferred the Union's YouTube channel titled 'The Cambridge Union'. Before 2014, the Union only occasionally live-streamed popular events, with the first ever live stream held on 12 May 2011, in which Stephen Fry debated Radio 1 DJ Kissy Sell Out on the motion: \"This House believes that classical music is irrelevant to today's youth\"."]}, {"page": "Exit (festival)", "response": ["|Sasha b2b John Digweed, Richie Hawtin b2b Dubfire, Steve Lawler b2b Lee Burridge, Eric Prydz b2b Adam Beyer, Carl Cox b2b Green Velvet, James Zabiela b2b Nic Fanciulli, Steve Angello b2b Sebastian Ingrosso, Sander Kleinenberg b2b Darren Emerson, Kissy Sell Out b2b Alex Metric, Patti Smith, Grandmaster Flash, Roots Manuva, Fucked Up, Ebony Bones, Loco Dice b2b Magda, The Herbaliser, Majke, Partibrejkers, E-Play, Max Romeo, Hladno pivo, Delinquent Habits, Baloji, Mando Diao, Buzzcocks, Atheist Rap, Buraka Som Sistema, Addictive TV, Trio Mocotó, Cibelle, Amon Tobin, Death Angel, Kataklysm, Keep of Kalessin, The Stone, Anathema, My Dying Bride, Deathstars, Sabaton, Comeback Kid, Walls of Jericho, Hatcha, Fake Blood (cancelled), Surkin, Orgasmic, DJ Marky with MC Dynamite, Heidi b2b Justin Martin, Gui Boratto, Marko Nastić b2b Valentino Kanzyani, Paul Woolford b2b Yousef, Japanese Popstars, Darkwood Dub, Sub Focus, Caspa, Rusko, Overdrive, Andy C, Fabio, Grooverider, Obojeni program, Kenny Kenn, Skibadee, Chase & Status, MC Rage, Takura, Plan B, Dark Angel, Orthodox Celts, Bernays Propaganda, Lollobrigida, Dubioza Kolektiv, zZz, Stalingrad Cowgirls, Jarboli, DJ Marfox, Marčelo, Nežni Dalibor, Vuneny, Love Hunters"]}, {"page": "Angie Brown", "response": ["In 2014 Brown was approached by British/Canadian DJ Kissy Sell Out, co-writing and singing on the San City Record/Vicious Vinyl and Carrillo Music release called \"Deeper In Love\"."]}, {"page": "Kissy", "response": ["* Kissy Sell Out (born 1984), English DJ"]}, {"page": "Glastonbury Festival line-ups", "response": ["* Kissy Sell Out"]}, {"page": "BBC Radio 1's Big Weekend", "response": ["| || || Kissy Sell Out ||", "| Ne-Yo || Gossip || Kissy Sell Out", "| Pixie Lott || || Yr Ods || Kissy Sell Out", "Kissy Sell Out"]}, {"page": "Evolution Festival", "response": ["*Kissy Sell Out"]}, {"page": "Uffie", "response": ["During an interview on February 12, 2010 on Kissy Sell Out's BBC Radio 1 radio show, Uffie premiered a new track called \"Illusion of Love\", which features guest vocals from Mattie Safer, formerly of the band The Rapture. She explained that \"Illusion of Love\" is much more mature than her previous work and is by far the slowest track she has ever made."]}, {"page": "Marrakesh Records", "response": ["*Kissy Sell Out"]}, {"page": "Bolt Action Five", "response": ["The band split on 26 March 2008 and are working on new projects. Ian William Galloway, Tobias Hughes and Mark Murphy went on to form the band Fables, and Dan Murtha performs as Danimal Kingdom, and performs live with Kissy Sell Out."]}, {"page": "Stop Me If You Think You've Heard This One Before", "response": ["A slightly shorter edited version (where the lyrics start at the first verse) was released to mainstream radio in October 2007.Mainstream Radio Promo Only, October 2007 A remix by Kissy Sell Out features on Ministry of Sound 2008 compilation The Annual. Trance DJ Paul Oakenfold also remixed the song exclusively for his 2007 compilation album Greatest Hits & Remixes. After the win and performance of Ronson at the 2008 edition of the Brit Awards, \"Stop Me\" climbed as high as number 31 on the iTunes Top 100 and re-entered the UK Top 75 Singles chart at number 51. The song featured prominently in the opening scenes of the premiere of the second half of Nip/Tuck's fifth season. The song featured on the 2013 show reel for Seattle-based b-boy crew, Art of Movement, uploaded by Korean-American singer and member of the crew, Jay Park."]}, {"page": "Wild in the Country (festival)", "response": ["*Kissy Sell Out"]}, {"page": "Hadouken! (band)", "response": ["* Declaration of War - Hadouken! vs. Kissy Sell Out Remix 3:02"]}, {"page": "New Ideas", "response": ["The track was re-recorded and then re-released on 9 April 2007. A new video for the track was also made. The track was released on CD with new acoustic track \"Safe\", a remix of \"New Ideas\" by dance act Kissy Sell Out (another signing of Lavolta) titled \"New Ideas [Kissy Sell Out Crude Oasis]\" and the video to their previous release, \"Waiting For Go\". Two 7-inch singles were released, containing B-sides \"Layers\" and \"Simplify\", alongside various other remixes. The re-released version peaked at number 54 on the UK Singles Chart for one week and number two in the band's native Scotland. Their next single, \"Clean Up Your Eyes\", would top the Scottish Singles Chart.", "# \"New Ideas [Kissy Sell Out Crude Oasis]\""]}, {"page": "Ali Love", "response": ["| Harder|| 2013 || Kissy Sell Out"]}, {"page": "Jersey Live", "response": ["* Kissy Sell Out"]}, {"page": "Wakestock (Wales)", "response": ["<BR> Kissy Sell Out", "* Kissy Sell Out", "* Kissy Sell Out"]}, {"page": "Way Out West (festival)", "response": ["*Kissy Sell Out"]}, {"page": "The Things That Dreams Are Made Of", "response": ["In 2007, Martin Rushent's newly resurrected Genetic Recordings label released a limited edition EP of the song containing the 'More of Mix' and 'Justus Köncke Vocal Mix Edit'. Concurrently Hooj Choons issued a remix of the song by DJ/producer Tommy Bisdee aka 'Kissy Sell Out'. Realising that the song had commercial selling power Hooj Choons then released a full commercial version on 21 January 2008.Hooj"]}, {"page": "Declaration of War (song)", "response": ["ecl# \"Declaration of War\" (Hadouken! vs. Kissy Sell Out Remix)", "# \"Declaration of War\" (Hadouken! Vs. Kissy Sell Out Remix)"]}, {"page": "The Penelopes", "response": ["Echoing the success of their 2013 remix of David Bowie’s “Let’s Dance”, The Penelopes most recent remix of The Cure's “Just Like Heaven” became an underground hit with support from the likes of Rob da Bank at BBC Radio 1, Kissy Sell Out, Eddy Temple Morris at XFM, Tensnake, Little Boots and Hot Chip."]}, {"page": "Linda's Nephew", "response": ["The song 'Michael Barrymore' was played by Kissy Sell Out in the summer of 2008 on his 'In New DJs We Trust' on Radio 1 and the band were named Unsigned Band of the Month for June."]}, {"page": "Jack Beats", "response": ["Jack Beats has been heavily championed on the electro scene by British disc jockeys Kissy Sell Out and Hervé. They perform regularly at club nights throughout the world, as well as at many popular festivals, including Coachella, Fuji Rock Festival, Glastonbury, EDC, and Sónar. Additionally, they have released music on labels including OWSLA, Rinse, Night Bass, and Columbia Records.", "|Kissy Sell Out"]}, {"page": "Glastonbury Festival 2009", "response": ["Calvin HarrisMr. ScruffV V BrownRob da BankFrankmusikWonky Pop DJsKissy Sell OutWonky Pop DJsOu EstChris Coco"]}, {"page": "Invaders Must Die", "response": ["Invaders Must Die was released as a CD, CD/DVD set, double-vinyl, digital download and a luxury-like 7-inch vinyl box set that includes five 7-inches, CD/DVD, bonus CD, poster, stickers and stencils. To coincide with the release of the album, the band embarked on a nine date UK arena tour, with support from Dizzee Rascal, Noisia, Herve and DJ Kissy Sell Out. The \"Warrior's Dance\" video aired on Channel 4 on 28 March at 12:00 am."]}, {"page": "Oxegen 2009", "response": ["*Kissy Sell Out"]}, {"page": "List of Essential Mix episodes", "response": ["| 6 March || Kissy Sell Out, Alex Metric || In New Music We Trust Live", "|Jaymo, Andy George & Kissy Sell Out", "| 26 April || Kissy Sell Out & Jaymo & Andy George"]}, {"page": "Better Off as Two", "response": ["# Better Off As Two (Kissy Sell Out Remix)", "# Better Off As Two (Kissy Sell Out Says Relax)"]}, {"page": "The Aston Shuffle", "response": ["*Kissy Sell Out – \"Garden Friends\" (The Aston Shuffle Remix)"]}, {"page": "RockNess 2007", "response": ["*Kissy Sell Out"]}, {"page": "RockNess 2009", "response": ["*Kissy Sell Out"]}, {"page": "Red Nose Day 2011", "response": ["| Fri 00:00 – 02:00|| Kissy Sell Out || Patrick KieltyThandie NewtonKaty Perry || Dave took a break ||"]}, {"page": "Field Day (Sydney festival)", "response": ["*Kissy Sell Out"]}, {"page": "Glastonbury Festival 2010", "response": ["Kissy Sell Out"]}, {"page": "Girls Le Disko", "response": ["# \"Ricochet! (Kissy Sell Out Mix)\" – 4:48", "* Kissy Sell Out"]}, {"page": "So Sweet Records", "response": ["*Kissy Sell Out"]}, {"page": "Kissy Sellout", "response": ["#REDIRECT Kissy Sell Out"]}]}}