{"wiki_id": "http://www.wikidata.org/entity/Q6416169", "itemLabel": "Kirsty Hume", "itemDescription": "British model", "wikipedia_url": "https://en.wikipedia.org/wiki/Kirsty_Hume", "wikipedia_page": {"main": "Kirsty Hume (born 4 September 1976) is a Scottish model who came to prominence in the 1990s.", "link_mentions": [{"page": "List of Scots", "response": ["* Kirsty Hume (born 1976), model"]}, {"page": "H&M", "response": ["For fall 2010, the company collaborated with French fashion house Lanvin. In March 2011, the brand's clothing was featured in an interactive fashion art film by Imagine Fashion called \"Decadent Control\", starring Roberto Cavalli, Kirsty Hume, Eva Herzigová and Brad Kroenig. For Spring/Summer 2011, the company collaborated with fashion blogger Elin Kling, which was available at select stores only."]}, {"page": "Bruce Weber (photographer)", "response": ["| 1998 Calendar, starring: Patricia Arquette • Georgina Grenville • Daryl Hannah • Shalom Harlow • Eva Herzigova • Kirsty Hume • Elaine Irwin Mellencamp • Milla Jovovich •Kiara Kabukuru • Tanga Moreau • Carolyn Murphy • Rachel Roberts • Stella Tennant"]}, {"page": "Donovan Leitch (actor)", "response": ["He married Scottish model Kirsty Hume on September 23, 1997. Their daughter, Violet Jean Leitch, was born March 21, 2004 at home in Los Angeles."]}, {"page": "Jodie Kidd", "response": ["In 2014, Kidd was the face of Jaeger's AW/14 campaign. She was one of three iconic British models who were photographed with their mothers, alongside Jasmine Guinness and Kirsty Hume."]}, {"page": "Pirelli Calendar", "response": ["|| Tanga Moreau, Stella Tennant, Milla Jovovich, Carolyn Murphy, Eva Herzigová, Patricia Arquette, Kirsty Hume, ShalomHarlow, Elaine Irwin Mellencamp, Kiara Kabukuru, Georgina Grenville, Rachel Roberts, Daryl Hannah"]}, {"page": "1990s in fashion", "response": ["* Throughout the 1990s, supermodels dominated the fashion industry.Supermodels of the 90s The top models of the 1990s were Linda Evangelista, Cindy Crawford, Naomi Campbell, Tatjana Patitz, Eva Herzigova, Nadja Auermann, Christie Brinkley, Christy Turlington, Kate Moss, Carla Bruni, Tatiana Sorookko, Helena Christensen, Claudia Schiffer, Karen Mulder, Yasmin Le Bon, Nadège, Yasmeen Ghauri, Stephanie Seymour, Carolyn Murphy, Amber Valletta, Shalom Harlow, Kirsten Owen, Kristen McMenamy, Guinevere Van Seenus, Alek Wek, Karen Elson, Michele Hicks, Stella Tennant, Audrey Marnay, Amy Wesson, Maggie Rizer, Erin O'Connor, Kirsty Hume, Bridget Hall, Milla Jovovich and Tyra Banks.15 sexiest supermodels"]}, {"page": "Johan Renck", "response": ["In addition, Renck directed a fashion art film called Decadent Control for Imagine Fashion that premiered in March 2011. It starred Roberto Cavalli, Eva Herzigová, Kirsty Hume and Brad Kroenig and used fashion from Agent Provocateur and H&M."]}, {"page": "Jasmine Guinness", "response": ["2014 marked a revival of Guinness' modelling career as she led Jaeger's AW14 campaign alongside her mother Liz and fellow models Kirsty Hume and Jodie Kidd. Her range largely included knitwear; including cardigans, skirts and sweater dresses."]}, {"page": "VIVA Model Management", "response": ["VIVA Model Management is a model agency based in Paris, London and Barcelona.  The agency was founded in Paris in 1988 by director Cyril BruleModels.com and focuses on high-fashion editorial and catwalk work.  VIVA's board features notable models, including Natalia Vodianova, Doutzen Kroes, Kirsty Hume, Raquel Zimmerman, Stella Tennant and Kaia Gerber.http://viva-paris.com", "*Kirsty Hume"]}]}}