{"wiki_id": "http://www.wikidata.org/entity/Q6417427", "itemLabel": "Kit Downes", "itemDescription": "British jazz pianist", "wikipedia_url": "https://en.wikipedia.org/wiki/Kit_Downes", "wikipedia_page": {"main": "Kit Downes is a BBC Jazz Award winning, Mercury Music Award nominated, solo recording artist for ECM Records. \nHe has toured the world playing piano, church organ and harmonium with his own bands ('ENEMY', 'Troyka', 'Elt' and 'Vyamanikal') as well as artists such as Squarepusher, Thomas Strønen and Django Bates. He has written commissions for Cheltenham Music Festival, London Contemporary Orchestra, Stavanger Konserthus, Rewire Festival, Cologne Philharmonie, BBC Radio 3 and the Wellcome Trust, as well as collaborating with film-makers, video game developers and classical composers.\nDownes performs solo pipe organ and solo piano. He also plays in collaborations with saxophonist Tom Challenger, cellist Lucy Railton, composer Shiva Feshareki and with the band 'ENEMY'. He is also currently working with fiddle-player Aidan O'Rourke, composer Max de Wardener, Oli Stiedle's 'Killing Popes' and with singer/photographer Paula Rae Gibson. He teaches piano and composition at the Royal Academy of Music where in 2019 he was awarded a Fellowship. He used to teach at the Purcell School of Music and is also a patron of the ‘Musical Keys’ charity.", "link_mentions": [{"page": "Mercury Prize", "response": ["* Kit Downes Trio – Golden"]}, {"page": "Dave McKean", "response": ["An Ape's Progress  was a commission by the Manchester Literature/Jazz Festivals in 2015, and was created by poet Matthew Sweeney, composer/saxophone player Iain Ballamy, cellist Matthew Sharp, singer Emilia Martensson, accordionist Stian Carstensen, and pianist Kit Downes, with McKean providing film projections and keyboards. A book of the work accompanied the show."]}, {"page": "Troika", "response": ["* Troyka, a British jazz band featuring pianist Kit Downes"]}, {"page": "BBC Jazz Awards", "response": ["* Rising Star: Kit Downes"]}, {"page": "Cheltenham Jazz Festival", "response": ["Jamie Cullum, Paloma Faith, Elaine Paige, Eric Bibb, Imelda May, Liane Carroll, Sir Michael Parkinson, Kit Downes and Mark Sanders Cuong Vu Trio"]}, {"page": "Vaimānika Shāstra", "response": ["* In 2016, 'Vyamanika' is a duo album recorded by Kit Downes on church organ and Tom Challenger  on saxophone in five Suffolk churches on the slipimprint recording label."]}, {"page": "Downes (surname)", "response": ["* Kit Downes (born before 2007), British jazz pianist"]}, {"page": "Bolton Children's Book Award", "response": ["**Zal and Zara and the Great Race of Azamed by Kit Downes"]}, {"page": "Clark Tracey", "response": ["He has led his own ensembles since the early 1980s; in these combos he has played with Django Bates, Iain Ballamy, Guy Barker, Jamie Talbot, Mark Nightingale, Dave O'Higgins, Steve Melling, Nigel Hitchcock, Gerard Presencer, Mornington Lockett, Simon Allen, Kit Downes, Zoe Rahman and Alan Barnes.  As a bandleader he has had two tours of the Far East, Yugoslavia, France, Gibraltar and Finland as well as many national UK tours.  His current sextet includes Mark Armstrong, Tom Ridout, James Wade Sired, Gareth Williams and James Owston. Clark has worked steadily as a freelance musician and has appeared mostly in the groups of Alan Barnes."]}, {"page": "1986 in jazz", "response": ["* 26 – Kit Downes, British pianist and composeer."]}, {"page": "Golden (Kit Downes Trio album)", "response": ["Golden is the debut album by the acoustic jazz Kit Downes Trio. It was released in 2009 by Basho Records and was shortlisted for the 2010 Mercury Prize.", "The trio of pianist Kit Downes, bassist Calum Gourlay and drummer James Maddren had been together since 2005, when they were studying at the Royal Academy of Music. This was their first recording together.Jazz breaking news: Kit Downes Trio Nominated For The Mercury Seven of the tracks were written by Downes; Gourlay composed \"Roots\".", "Golden was released in 2009 by Basho Records. The AllAboutJazz reviewer concluded that \"The quality of writing and performance on this album so soon after the players' graduation demonstrates their huge potential and ensures that the album itself is one of the finest debut recordings of 2009.\" Critic John Fordham wrote: \"Kit Downes, formerly of Empirical, is beginning to get the kind of enthusiastic attention Gwilym Simcock did on his emergence a few years before. [...] Downes is more of a choosy, patient storyteller, and if one of his distinctive original themes only requires a handful of notes and a lot of spaces, he leaves it like that.\"", "*Kit Downes – piano", "Category:Kit Downes Trio albums"]}, {"page": "Sarah Gillespie", "response": ["Sarah Gillespie is a British American singer songwriter and writer based in London. She has four albums, known for combining poetic lyrics with folk, blues and elements of jazz. Her debut collection of poetry, Queen Ithaca Blues, was published by Albion Beatnik Press. Gillespie's fourth album, Wishbones, was arranged and co-produced by Mercury nominated pianist and composer Kit Downes. Her band features Kit Downes - organ and piano, James Maddren - drums, Ruth Goller - bass, Chris Montague - guitar and special guest Laura Jurd - trumpet. Wishbones was launched at the Southbank Centre's Purcell Room on October 29, 2018."]}, {"page": "List of ECM Records albums", "response": ["|Kit Downes", "|Kit Downes"]}, {"page": "List of Old Norvicensians", "response": ["* Kit Downes, jazz pianistJazz musician Kit Downes to perform in Norwich for Young Norfolk Arts Festival"]}, {"page": "Alexander Hawkins", "response": ["|As Alexander Hawkins Ensemble. Sextet, with Otto Fischer (electric guitar), Dominic Lash (bass), Hannah Marshall (cello), Orphy Robinson (marimba), Javier Carmona (drums, percussion). Guest Kit Downes (Hammond organ) on one track"]}, {"page": "Edition Records", "response": ["Edition has released albums by Ant Law, Josh Arcoleo, Julian Argüelles, The Bad Plus, Tom Barford, Blue-Eyed Hawk, Jeff Ballard, Denys Baptiste, Bourne/Davis/Kane, Cellophony, Curios, Dinosaur, Eyolf Dale, Danish Radio Big Band, Kit Downes, Geoff Eales, Anton Eger, Kurt Elling, Enemy (band), André Fernandes, Kevin Figes, Martin France, Elliot Galvin, Paula Gardiner, Tim Garland, Girls In Airports, Thomas Gould, Jim Hart, Kevin Hays, Pablo Held, Daniel Herskedal, Jasper Høiby, Gary Husband, Per Oddvar Johansen, Laura Jurd, Kairos 4Tet, Mika Kallio, Dave Kane, Kneebody, Nicolas Kummert, Mário Laginha, Helge Lien, Mark Lockheart, Olavi Louhivuori, Lionel Loueke, Rob Luft, Malija, Stuart McCallum, McCormack & Yarde Duo, Fergus McCreadie, Robert Mitchell's Panacea, Misha Mullov-Abbado, Ivo Neame, Neon Quartet, Marius Neset, Helge Norbakken, Oddarrang, Gretchen Parlato, Phronesis, Verneri Pohjola, Tineke Postma, Chris Potter, Jason Rebello, Aki Rissanen, André Roligheten, Roller Trio, Roger Sayer, Morten Schantz, Slowly Rolling Camera, Snowpoet, Spin Marvel, Dave Stapleton, John Taylor, Keith Tippett Tapestry Orchestra, Troyka, Alexi Tuomarila, Ben Wendel, Kenny Wheeler, Norma Winstone, and Neil Yates."]}, {"page": "Corrie Dick", "response": ["Corrie also plays improvised solo drum concerts and frequently collaborates with artists such as Martin Speake, Mark Lockheart, Jacob Collier, Bobby Wellins, Brian Kellock, Leafcutter John, Tom Herbert, Pete Wareham, Kit Downes, Jasper Høiby, Jim Mullen and many other notable musicians."]}, {"page": "Rewire Festival", "response": ["Actress & Young Paint / Adam Harper / Alex Zhang Hungtai / All Sounds Considered / Anat Spiegel / Andrea Belfi & Valerio Tricoli / Angel Bat Dawid / Angel-Ho / Animistic Beliefs / Anna Mikkola / Annelies Monseré / Ash Koosha / Astrid Sonne / Aurélie Nyirabikali Lierman & But What About / Bamba Pana & Makaveli / Bill Orcutt / Bob Sturm / CCL / Chris Corsano & Bill Orcutt / Clara! Y Maoupa / Creative Sound Lab / CTM / CURL / De Methode / Diamanda Dramm / Dianne Verdonk / Doon Kanda / Elaine Mitchener / Eli Keszler / Emmanuel Biard / Enrique Manjavacas / Federico Campagna / Flohio / Foodman / Free Fall Improvisers Orchestra / Geomancer / Giant Swan / Haron & Anne Veinberg / Henry Vega & Jan Willem Troost / Iona Fortune & NYX / Ipek Gorgun / Jasmín / Jason Sharp / Jennifer Walshe & Memo Akten / Jesse Osborne-Lanthier / Jessica Pratt / Jessica Sligter / Jlin & Company Wayne McGregor / John Bence / Julia Holter Duo / Justin Bennett / Kampire / Kelly Moran / Kit Downes & Ensemble Klang / Lafawndah / Laura Agnusdei / Laurel Halo / Lotic / Low / Lucrecia Dalt & Alessandra Leone / Maria W Horn / Mark Fell / Mark IJzerman / Maurice Louca Elephantine Band / Mette Henriette / Mick Grierson / Mohammad Reza Mortazavi / Nicolás Jaar & Group / Nicolás Jaar presents Free 2 Move / Niels Broos & Jamie Peet / No history in a room filled with people with funny names 5 / Nosedrip / Obol Le / Otim Alpha / Party on the CAPS / Patrick Higgins / Pierre Bastien & Tomaga / Puce Mary / RAFF / Rebecca Fiebrink / Red Brut / Refree / Rian Treanor / Róisín Loughran / Sébastien Robert / Sega Bodega / Sinjin Hawke & Zora Jones / Sosena Gebre Eyesus / Sote / Spekki Webu / Spinifex / Stekkerdoos / Tanya Tagaq / Tashi Wada Group / Thor Magnusson / Tim Hecker & Konoyo Ensemble / Tirzah / upsammy / Violet / vtgnike / Walled Unwalled / William Basinski & Lawrence English / Xiu Xiu / YEK: Mohammad Reza Mortazavi & Burnt Friedman / Yona ft. Ash Koosha / Yves Tumor / Zeno van den Broek / Zoe Reddy"]}, {"page": "Yamaha Music London", "response": ["The Piano Hall has regularly been used as an intimate concert venue and has held concerts by Jamie Cullum, The Kit Downes Trio and other Yamaha-linked artists, often in conjunction with UK charity Centrepoint. Likewise, the basement features a stage for instore gigs and product demonstrations. The store was officially launched on 29 January 2015. "]}, {"page": "Diatribe Records", "response": ["Artists and composers released on the label include Gilad Atzmon, Gerald Barry, Ed Bennett, John Buckley, Elliott Carter, Ben Davis, Donnacha Dennehy, Kit Downes, Roger Doyle, Colin Dunne, Benjamin Dwyer, Róisín Elsafty, Julie Feeney, Zohar Fresco, Mamoru Fujieda, Ronan Guilfoyle, Izumi Kimura, Stefano Landi, Cora Venus Lunny, Tarquinio Merula, Akira Miyoshi, Claudio Monteverdi, Mike Nielsen, Iarla Ó Lionáird, Caoimhín Ó Raghallaigh, Nick Roth, Matthew Schellhorn, Laura Sheeran, Duke Special, Barbara Strozzi, Thought-Fox, Francesco Turrisi, Niall Vallely, Ian Wilson, Takashi Yoshimatsu, Yurodny, and John Zorn."]}, {"page": "Pablo Held", "response": ["Pianist Kit Downes observed that Held \"has developed a way of performing with his trio where all 3 of them know each others parts for every tune – so anyone can cue any part of any tune by just playing a small part of it (even if it's in the middle of another tune) – so that they then seamlessly link in other material to the mix\".Downes, Kit (28 November 2013) \"Preview: Kit Downes Writes About Pablo Held. Double Bill with Both Trios – Pizza Express. 5th December\". London Jazz News."]}, {"page": "2016 in jazz", "response": ["| Kit Downes & Tom Challenger"]}, {"page": "List of years in jazz", "response": ["* 1986 in jazz, deaths of Alan Branscombe, Arthur Rosebery, Bea Booze, Benny Goodman, Billy Taylor, Christer Boustedt, Cliff Leeman, Cliff Townshend, Curley Russell, Don Wilkerson, Dorothy Ashby, Eddie Davis, Everett Barksdale, Fred Hunt, Fred Stone, Hank Mobley, Jimmy Lyons, Joe Farrell, Johnny Dyani, Karel Vlach, Ken Moule, Knocky Parker, Marky Markowitz, Murray Kane, Paul Bascomb, Pepper Adams, Raymond Burke, Svein Øvergaard, Teddy Kotick, Teddy Wilson, Thad Jones, Thorgeir Stubø, and Walter Wanderley; births of Adam Bałdych, Adrián Carrio, Ayumi Tanaka, Ellen Andrea Wang, Emilie Stoesen Christensen, Ivan Blomqvist, Jakop Janssønn Hauan, Jon Audun Baar, Jon Batiste, Jonas Kilmork Vemøy, Julia Kadel, Justin Kauflin, Kit Downes, Lars Ove Fossheim, Laura Mvula, Nikola Rachelle, Philip Schjetlein, Rebecca Ferguson, Romano Ricciardi, Roxy Coss, Sasha Masakowski, Takashi Matsunaga, Tal Wilkenfeld, and Theo Jackson."]}, {"page": "2018 in jazz", "response": ["| Kit Downes"]}, {"page": "Lauren Kinsella", "response": ["Kinsella moved to London in 2010, where she earned her master's degree at the Royal Academy of Music in London. After singing in a duo with Sarah Buechi (Sessile Oak, 2009) she started working on the British jazz scene with Laura Jurds Chaos Orchestra (Island Mentality) and in the band Thought-Fox, among others.Tom Lord The Jazz Discography (online. Retrieved 20 October 2016 In 2012 she co-produced All This Talk About (Wide Ear Records) with Alex Huber. She also played in duo with saxophonist Tom Challenger and in the sextet Abhra led by the French saxophonist Julien Pontivanne. In addition, she appeared in the project Somewhere in Between on the Birmingham Literature Festival with the actor Peter Campion. She also worked with Ian Wilson (I Burn for You) and in the theater project t The Last Siren. Currently (2018) she works in a duo Snowpoet with the pianist Kit Downes."]}, {"page": "Milton Mermikides", "response": ["Kit Downes"]}, {"page": "Calum Gourlay", "response": ["The son of a music teacher, Gourlay grew up in Glasgow. At the age of ten he began learning the cello, then four years later started playing double bass. He heard Scottish jazz musicians at workshops taught by his father on Saturday mornings. He moved from Glasgow to Dunfermline, participating in the Fife Youth Jazz Orchestra and the Strathclyde Youth Jazz Orchestra. He played in a youth band led by Tommy Smith until 2004 when he traveled to London to attend the Royal Academy of Music. At the school he met three people who would become bandmates: Trish Clowes, Kit Downes, and Freddie Gavita. Gourlay has taught at the Royal Academy and Trinity Laban Conservatoire of Music and Dance", "With Kit Downes"]}]}}