{"wiki_id": "http://www.wikidata.org/entity/Q6416185", "itemLabel": "Kirsty Wark", "itemDescription": "British journalist and television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Kirsty_Wark", "wikipedia_page": {"main": "Kirsteen Anne \"Kirsty\" Wark FRSE (born 3 February 1955) is a Scottish journalist, newsreader, and television presenter, best known for fronting BBC Two's news and current affairs programme Newsnight since 1993, and its weekly arts spin-off Newsnight Review (later The Review Show) from 2002 to 2014.", "link_mentions": [{"page": "List of Scots", "response": ["* Kirsty Wark (born 1955), journalist"]}, {"page": "Iain Banks", "response": ["His final interview was with Kirsty Wark, broadcast on BBC2 Scotland as Iain Banks: Raw Spirit 12 June 2013."]}, {"page": "1955", "response": ["** Kirsty Wark, Scottish television presenter"]}, {"page": "Absolutely Fabulous", "response": ["*Kirsty Wark"]}, {"page": "Stratford-upon-Avon", "response": ["Stratford has one library, located in Henley Street within a medieval building. Since 2008, Stratford has hosted the Stratford-upon-Avon Literary Festival, which holds two literary events a year, with one event in spring and a shorter festival in autumn. The festival has talks from celebrity guests, workshops and educational programmes and has become one of the most noted literary festivals in the country, with speakers including: Kirsty Wark, Alan Johnson MP, Baroness Shirley Williams, Tom Kerridge, Sir Tim Rice, John McCarthy, Michael Rosen, Howard Jacobson, Jeffrey Archer, Michael Palin, Jeremy Paxman, Alastair Campbell and Paul Merton."]}, {"page": "Deborah Cavendish, Duchess of Devonshire", "response": ["In 2010, the BBC journalist Kirsty Wark interviewed the Duchess for Newsnight. In it, the Duchess talked about life in the 1930s and 1940s, Hitler, the Chatsworth estate, and the marginalisation of the upper classes. She was also interviewed on 23 December by Charlie Rose for PBS."]}, {"page": "Dumfries", "response": ["BBC Broadcaster Kirsty Wark was born in the town as was fellow broadcaster Stephen Jardine. Neil Oliver (archaeologist, historian, author and broadcaster), grew up in Ayr and Dumfries. Author and earth scientist Dougal Dixon is from Dumfries. Hunter Davies (author, journalist and broadcaster) lived in Dumfries for four years as a boy. James Hannay as well as being a novelist and journalist spent the last five years of his life as the British consul in Barcelona. John Mayne was born in Dumfries in 1759 and contributed in the field of poetry. World War I poet William Hamilton was another born in Dumfries. Archibald Gracie, shipping magnate and business tycoon in USA, was from Dumfries. John McFarlane, CEO of Australia and New Zealand Banking Group Limited (ANZ) originates from the town, as does William (\"Bill\") Nelson (ADFP) who was also with the ANZ (formerly AXA, AMP and Westpac) and also father of the great Alice Nelson, now CEO of Centurion Wealth Advisers. The architect George Corson who worked mainly in Leeds, England, was born in Dumfries and articled to Walter Newall in the town."]}, {"page": "Castle Douglas", "response": ["* Kirsty Wark, journalist and television presenter, born in Dumfries, lived in Castle Douglas in infancy before the family moved back to Kilmarnock. Ayrshire."]}, {"page": "Cromarty", "response": ["The small community is also known for being a hub of creative activity, with several arts venues, local artists and a small cinema. The Cromarty Arts Trust, which restored several buildings in the town, including the Brewery and the Stables, organises a programme of arts and music events, including concerts and gigs, an annual Crime and Thrillers weekend, a Harp Weekend and stone letter carving and silver working courses, while the Cromarty Group of artists hold an annual exhibition of their work. Other local community groups include the Cromarty History Society, which holds regular lectures, and the Cromarty and Resolis Film Society, which organises a Film Festival every December. Guests of the 2008 festival included Kirsty Wark and Alan Clements, Donald Shaw and Karen Matheson, Janice Forsyth, David Mackenzie and Michael Caton-Jones. Each guest selected five of their favourite films, one of which was shown during the weekend. In addition to the Favourite Films, there is an outdoor screening on a Gable End, Scottish Gaelic Short films, Animation workshop, photographic exhibition and late night Pizza and Film screenings."]}, {"page": "Tracey Emin", "response": ["Emin was interviewed about the Venice Biennale by the BBC's Kirsty Wark in November 2006. Emin showed Wark some work-in-progress, which included large-scale canvases with paintings of Emin's legs and vagina. Starting with the Purple Virgin (2004) acrylic watercolour series with their strong purple brush strokes depicting Emin's naked open legs, leading to Emin's paintings in 2005-6 such as Asleep Alone With Legs Open (2005), the Reincarnation (2005) series and Masturbating (2006) amongst others, these works were a significant new development in her artistic output."]}, {"page": "Jan Ravens", "response": ["Ravens has regularly imitated Newsnight host Kirsty Wark, Charlotte Green formerly of BBC Radio 4 (with double entendres), Ellen MacArthur (who regularly bursts into tears), Nigella Lawson (with double entendres), Ann Widdecombe (narrating fanciful racy storylines in her novels), Patricia Routledge's Hyacinth Bucket, Queen Elizabeth II, a chirpy Sandi Toksvig, a stern-faced Gillian McKeith, Sophie Raworth (with a bemused school-girl grin) and Fiona Bruce (with barely concealed filthy invitations) of BBC News, Anne Robinson of The Weakest Link, Lesley Garrett (often referring to her generous cleavage), Hillary Clinton, Theresa May and the Geordie-accented Ruth Archer from the BBC Radio 4 series The Archers.  She also appeared as the then Prime Minister Margaret Thatcher in an episode of Are You Being Served? although only her voice is heard."]}, {"page": "Newsnight", "response": ["During the COVID-19 pandemic, Newsnight reverted to a 10:45pm start time from 30 March 2020. This was due to Newsnight temporarily sharing a studio with BBC News at Ten during the pandemic to cut footfall in Broadcasting House and allow turnover in the studio, with News at Ten not finishing until 10:35. Further, during the pandemic, some editions presented by Kirsty Wark have been presented from BBC Scotland's Pacific Quay headquarters in Glasgow. However, Wark still travelled to London during weeks she presented more episodes of the show (e.g. when main presenter Emily Maitlis was on holiday). It is expected that Newsnight will return to the normal scheduling when social distancing rules have been eased.", "From 2000 until December 2009, on Friday evenings Newsnight gave way at 11:00pm to Newsnight Review, a 35-minute consumer survey of the week's artistic and cultural highlights. Mark Lawson was the programme's main presenter in its Late Review incarnation, which began life as a strand of The Late Show. He continued to chair the panel of guest reviewers when it reincarnated as Newsnight Review in 2000, up until December 2005. The programme was presented by Kirsty Wark, Martha Kearney, John Wilson, Tim Marlow, Kwame Kwei-Armah and Hardeep Singh Kohli. Regular reviewers included Mark Kermode, Tom Paulin, Ekow Eshun and Germaine Greer.", "As part of the BBC's commitment to moving programmes out of London, Newsnight Review finished on 18 December 2009 with a special hour-long edition. The programme was replaced by The Review Show, produced from Glasgow, which started on 22 January 2010. It had the same producer as Newsnight Review and was still presented by Kirsty Wark and Martha Kearney.", "In an early day motion of 3 November 2016, as a celebration of the \"Brexit\" vote for UK withdrawal from the European Union, right-wing Conservative Party MP Andrew Rosindell argued for a return to the broadcasting of \"God Save the Queen\" at the end of BBC One transmissions each day. The practice was dropped in 1997 (ostensibly due to BBC One adopting 24-hour broadcasting by simulcasting BBC News 24 overnight, rendering closedown obsolete). That evening, Newsnight ended its broadcast with host of that night Kirsty Wark saying that they were \"incredibly happy to oblige\" Rosindell's request, before playing out to the video of the Sex Pistols' punk song of the same name, much to Rosindell's discontent.", "| style=\"text-align:center\"|Kirsty Wark"]}, {"page": "The News Quiz", "response": ["* Kirsty Wark"]}, {"page": "Andrew Rosindell", "response": ["In an Early day motion of 3 November 2016, as a celebration of the Brexit vote and Britain withdrawing from the European Union, Rosindell argued for a return to the broadcasting of \"God Save the Queen\" at the end of BBC One transmissions each day. The practice was dropped in 1997 (ostensibly due to BBC One adopting 24-hour broadcasting by simulcasting BBC News 24 overnight, rendering closedown obsolete). That evening, BBC Two's Newsnight programme ended its nightly broadcast with host Kirsty Wark saying that they were \"incredibly happy to oblige\" Rosindell's request, before ending with a clip of the Sex Pistols performing the punk song of the same name (an anti-monarchist song), much to Rosindell's discontent."]}, {"page": "Kilmarnock", "response": ["*Kirsty Wark; TV news journalist and presenter of Newsnight "]}, {"page": "God Save the Queen (Sex Pistols song)", "response": ["On 3 November 2016, Andrew Rosindell, a Conservative MP, argued in an early day motion for a return to the broadcasting of the national anthem (named \"God Save the Queen\") at the end of BBC One transmissions each day (The practice was dropped in 1997, ostensibly due to BBC One adopting 24-hour broadcasting by simulcasting BBC News 24 overnight, rendering closedown obsolete), to commemorate the Brexit vote and Britain's subsequent withdrawing from the European Union. At the evening of the same day, BBC Two's Newsnight programme ended its nightly broadcast with host of that night Kirsty Wark saying that they were \"incredibly happy to oblige\" Rosindell's request, and then played a clip of the Sex Pistols' similarly named song, much to Rosindell's discontent."]}, {"page": "List of game show hosts", "response": ["| Kirsty Wark || United Kingdom || The Book Quiz (2008)"]}, {"page": "List of Have I Got News for You episodes", "response": ["|Kirsty Wark", "|Kirsty Wark", "|Kirsty Wark", "|Kirsty Wark", "|Kirsty Wark"]}, {"page": "George Reid (Scottish politician)", "response": ["After leaving Westminster he briefly returned to journalism. For BBC Scotland, he presented Agenda, which was produced by Kirsty Wark. He was producer of the famous reportage by Michael Buerk of the Ethiopian famine of 1984 that inspired the Band Aid and Live Aid charity campaigns, which led him to be headhunted by the International Red Cross and Red Crescent. He was part of an international disaster team that responded to the 1988 Armenian earthquake. He was Director of Public Affairs of the International Red Cross and Red Crescent for 12 years, based in Geneva, Switzerland, but working worldwide in conflict and disaster zones."]}, {"page": "Start the Week", "response": ["Andrew Marr took over as the programme's presenter in 2002. Occasional stand-in presenters in recent years have included David Baddiel and Sue MacGregor. In January 2013, Marr suffered a stroke and went on sabbatical from the show, though he did chair a one-off episode in November and several episodes in December 2013. He thereafter returned as the presenter of the show, but not on a full-time basis. Since 2013, he has alternated with various presenters, currently Tom Sutcliffe, Kirsty Wark and Amol Rajan."]}, {"page": "Absolute Power (radio and TV series)", "response": ["*Kirsty Wark"]}, {"page": "Phil Vickery (rugby union)", "response": ["Vickery won the 2011 series of Celebrity Masterchef beating Kirsty Wark and Nick Pickard in the final."]}, {"page": "John Banville", "response": ["At the award ceremony, BBC Two's Kirsty Wark quizzed Financial Times arts editor Jan Dalley, the Independent on Sunday literary editor Suzi Feay and The Observer literary editor Robert McCrum. Banville, Barry and Ali Smith were dismissed outright and much of the discussion focused on Barnes, Ishiguro and Zadie Smith. In the end, the judges' vote was split between Banville and Ishiguro, with Rick Gekoski one of those favouring Banville. It fell to Sutherland to cast the winning vote; he did so in favour of Banville. Banville later said: \"I have not been the most popular person in London literary circles over the past half-year. And I think it was very large of Sutherland to cast the winning vote in my favour\"."]}, {"page": "Question Time (TV programme)", "response": ["In December 2018, the BBC announced that Fiona Bruce would succeed Dimbleby as moderator. Bruce—along with Samira Ahmed, Victoria Derbyshire, Emily Maitlis, Nick Robinson, and Kirsty Wark—attended October 2018 auditions at London's James Allen's Girls' School. She presented her first Question Time in January 2019.", "* In 1994, BBC Scotland launched their own local debate show called Words with Wark which was broadcast on BBC One Scotland usually on the first Thursday of every month and this was presented by Kirsty Wark. The programme was axed in 1998."]}, {"page": "Reporting Scotland", "response": ["*Kirsty Wark (1981–1989, now with Newsnight)"]}, {"page": "Maggie's Centres", "response": ["Patrons of the charity include Frank Gehry, Jon Snow, Kirsty Wark, and Sarah Brown, wife of former British prime minister Gordon Brown. The charity's chief executive officer is Laura Lee, who was Maggie's cancer nurse. The President of the charity is Camilla, Duchess of Cornwall."]}, {"page": "Timothy Bell, Baron Bell", "response": ["During a live Newsnight interview on 4 September 2017, Lord Bell mentioned that he was the most senior director at the several hour long initial meeting with the Guptas. Bell explained to Kirsty Wark that upon his return to London he told Bell Pottinger CEO James Henderson, \"it's a very interesting piece of business but we can't handle it because there's a conflict of interest\". Wark then read Bell his own email, dated 26 January 2016, stating, \"The trip was a great success and we will put forward a deal whereby we will earn £100,000 per month plus costs and I will oversee this and make further reports.\" Wark asserted that the email was in \"direct conflict with what you just said\". Bell went on to deny this on the basis the email was sent before his return to London. Rather than oversee the deal, Bell claimed that upon his return \"I did absolutely nothing\", but Bell Pottinger \"submitted a [fee] proposal\". Bell went on to deny Wark's assertion that he is the senior figure working on the Gupta account, but rather he is a \"father figure of the meeting\". Wark asked that when Bell, as the founder of the company, stated that there was a conflict of interest, \"nobody listens? Really?\". Bell responded, \"Nobody listens to me. That's why I left the company\". Wark then produced a further Bell-authored email, dated 3 months later (April 2016), in which Bell offered further advice regarding the account. Bell retorted, \"You can attack me all you like but I had nothing to do with getting this account.\""]}, {"page": "Fi Glover", "response": ["In addition to winning silver at the 2017 British Podcast awards, Fortunately also won Funniest Show at the 2018 ARIAS, and Bronze in the Spotlight Award at the British Podcast Awards 2019. Guests on the show include Ian Wright, Anne Tyler, Monty Don, Ruth Jones, Will Young, Sara Cox, Claudia Winkleman, Miriam Margolyes, Will Self, Jeremy Vine, Ken Bruce, Tracey Thorn, Emily Maitlis, and Kirsty Wark."]}, {"page": "Breakfast News", "response": ["*Kirsty Wark"]}, {"page": "The World at One", "response": ["Many reporters and producers have spent some time working on the programme including Sue MacGregor, Kirsty Wark, Luke Jones, Charlie Lee-Potter, Ted Harrison, Jonathan Dimbleby, Roger Cook, George Alagiah, Jenny Abramsky, Roger Hearing, Sian Williams, Sandra Harris, Nicholas Barrett, "]}, {"page": "Emily Maitlis", "response": ["Maitlis is one of the main presenters of Newsnight on BBC Two, alongside Kirsty Wark and Emma Barnett. She first joined the programme as a relief presenter in 2006, working her way up to be lead anchor of the programme following the departure of Evan Davis in 2018. After each show, before bed, she answers emails from viewers and in April 2019 published a book Airhead: The Imperfect Art of Making News, describing how television news is produced."]}, {"page": "West Kirby Grammar School", "response": ["* Jan Ravens, from Dead Ringers, noted for her impersonations of Ruth Archer (ohh nohhh) from The Archers, and Kirsty Wark from Newsnight"]}, {"page": "BBC Breakfast", "response": ["Ron Neil, the programme's first editor,See for example: Ian Jones, Morning Glory: A history of British breakfast television. Kelly, 2004; especially pp. 17–18, 22–29.   departed from the programme and on 10 November 1986 a more conventional news focus was introduced featuring a news desk, presenters in suits and a shortened broadcast that began at 7:00am and ended any time between 8:30am and 8:55am. Presenters included Kirsty Wark, John Stapleton, Jeremy Paxman and Sally Magnusson."]}, {"page": "Muriel Gray", "response": ["She started her own production company in 1989, originally named Gallus Besom (besom being a Scots Language term of contempt for a surly or purposely awkward woman by a process of synecdocheBesom: WorldWideWords definition and gallus bold or cheeky in Scots),Definition of 'Gallus' in LiteralBarrage then renamed to Ideal World in 1993. It merged in 2004 with Wark Clements, the company co-owned by Kirsty Wark and her husband Alan Clements, to form IWC Media. The partners then sold the new company in 2005 to media company RDF Media for an estimated £12 million."]}, {"page": "2000 Today", "response": ["** Kirsty Wark"]}, {"page": "The Late Show (British TV programme)", "response": ["*Kirsty Wark"]}, {"page": "Never Mind the Full Stops", "response": ["| Kirsty Wark & Rob Deering", "| Kirsty Wark & Mark Steel"]}, {"page": "MasterChef (British TV series)", "response": ["* 2011: Phil Vickery, Kirsty Wark, Nick Pickard, Darren Campbell, Linda Lusardi, Michelle Mone, Ruth Goodman, Aggie MacKenzie, Ricky Groves, Margi Clarke, Colin McAllister, Justin Ryan, Shobu Kapoor, Sharon Maughan, Tim Lovejoy and Danny Goffey."]}, {"page": "Only an Excuse?", "response": ["Figures from Scottish entertainment regularly appeared, as themselves. These included Hazel Irvine, Kelly Dalglish, Gordon Brewer, Catriona Shearer, Reevel Alderson, Jackie Bird, Cathy MacDonald, Chris Hoy, Kirsty Wark, Judy Murray, Muriel Gray, Michelle McManus and Judith Ralston."]}, {"page": "The Young Person's Guide to Becoming a Rock Star", "response": ["The series also includes cameo appearances from Noel Gallagher, Chrissie Hynde, Jay Kay, 'Big' John Duncan, Denise van Outen, Sara Cox, Kirsty Wark, Samantha Fox, Edward Tudor-Pole, Keith Chegwin and Timmy Mallett."]}, {"page": "Married (radio series)", "response": ["Famous people in our universe are re-imagined for satirical effect.  Tony Blair is the leader of the Conservative Party which is currently out of power, the government being in the hands of the Liberal Democrats.   Stephen Fry is a Royal Biographer, and Newsnight presenter Kirsty Wark is a homeless waif who sets fire to telephone boxes.  Art critic Brian Sewell is the celebrated designer and manufacturer of ultra-modern \"S-plan\" furniture.  TV presenter John Humphrys is an outrageous performance artist who likes to perform naked. "]}, {"page": "Breakfast Time (British TV programme)", "response": ["On Monday 10th November 1986, Breakfast Time was relaunched with a news desk and presenters in suits. Hardened journalists such as Jeremy Paxman and Kirsty Wark joined the team as the programme shifted its tone to analysis of the morning's news stories, especially politics. The new look programme also started later, running from 7:00 am and ended any time between 8:30am and 8:55am."]}, {"page": "List of Room 101 episodes", "response": ["|James AcasterHeston BlumenthalKirsty Wark"]}]}}