{"wiki_id": "http://www.wikidata.org/entity/Q6432344", "itemLabel": "Korky Paul", "itemDescription": "British children's illustrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Korky_Paul", "wikipedia_page": {"main": "Hamish Vigne Christie \"Korky\" Paul (born 1951) is a British illustrator of children's books. He was born and raised in Rhodesia but now lives in Oxford, England. His work, characteristically executed with bright watercolour paint and pen and ink, is recognisable by an anarchic yet detailed style and for its \"wild characterisation\". He is most known for his illustration of the series Winnie the Witch.", "link_mentions": [{"page": "Kate Greenaway Medal", "response": ["* Korky Paul, The Duck That Had No Luck (Bodley Head), by Jonathan Long"]}, {"page": "List of California Institute of the Arts people", "response": ["* Korky Paul (Experimental Animation)"]}, {"page": "The Story Museum", "response": ["In 2017 The Story Museum ran an exhibition called Wild About Colour featuring a number of pieces by Brian Wildsmith alongside works by contemporary illustrators who had been influenced by his use of colour. The exhibition was curated by Helen Cooper and displayed the work of Shaun Tan and Korky Paul amongst others."]}, {"page": "Red House Children's Book Award", "response": ["** Picture Book: The Rascally Cake by Jeanne Willis, illus. Korky Paul (Andersen Press)", "*Winnie the Witch by Valerie Thomas, illus.  Korky Paul (Oxford University Press)"]}, {"page": "Winnie the Witch", "response": ["Winnie the Witch (also known as Winnie and Wilbur since 2016) is a series of nineteen picture books, written by Valerie Thomas and illustrated by Korky Paul. More than seven million books have been sold of the series, and it has been translated into more than 10 languages.", "Following on from the success of the picture books, a series of 'young fiction' Winnie the Witch books were written by Laura Owen, also illustrated by Korky Paul. An animated series based on the books was initially produced for Milkshake!, but only two episodes aired as specials.", "Valerie Thomas has worked for many years in education, teaching in schools in Australia and the UK. Korky Paul is an illustrator of children's books. In 1986, he illustrated his first book for Oxford University Press, Winnie the Witch, which won the Red House Children's Book AwardList of Children's Book Award winners from 1981 - 1989 in 1988."]}, {"page": "Brian Wildsmith", "response": ["In 2017 The Story Museum, UK, ran an exhibition called Wild About Colour featuring a number of pieces by Wildsmith alongside works by contemporary illustrators who had been influenced by his use of colour. The exhibition was curated by Helen Cooper and displayed the work of Shaun Tan and Korky Paul amongst others."]}, {"page": "The Prison Phoenix Trust", "response": ["* Freeing the Spirit through Meditation and Yoga by Sandy Chubb, Korky Paul and Sister Elaine MacInnes – published 2005 by the PPT  for inmates with basic reading skills", "* Yoga Without Words by Sandy Chubb, Korky Paul and Jo Child, 2008, The Prison Phoenix Trust "]}, {"page": "Estcourt High School", "response": ["*Korky Paul - Illustrator of children's books."]}, {"page": "Peter Carter (author)", "response": ["*  Captain Teachum's Buried Treasure (1989), illus. Korky Paul, who made the Greenaway Medal shortlist"]}, {"page": "List of World Book Day books", "response": ["*Flip book containing Winnie to the Rescue! by Laura Owen and Korky Paul (Oxford University Press) and Yuck's Rotten Joke by Matt and Dave (Simon & Schuster Children's Books)", "*  Winnie Flies Again a Winnie the Witch story by Valerie Thomas and Korky Paul (Oxford University Press)"]}]}}