{"wiki_id": "http://www.wikidata.org/entity/Q6430434", "itemLabel": "Konx-Om-Pax", "itemDescription": "Scottish electronic musician and graphical artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Konx-Om-Pax", "wikipedia_page": {"main": "Konx-om-Pax (born Tom Scholefield) is a Scottish electronic musician and graphical artist from Glasgow.Scholefield has done graphic design and animation for musicians and record labels, the latter including Brainfeeder, Hyperdub, and LuckyMe. Musicians for whom he has done animations include Hudson Mohawke, Lone, Mogwai, Jamie Lidell, and Martyn; his sleeve designs have been used by Oneohtrix Point Never, Rustie, and King Midas Sound.As Konx-om-Pax, Scholefield released a full-length album, Regional Surrealism, on the label Planet Mu in 2012. Stuart Braithwaite of Mogwai makes an appearance on the record. A second full-length album, Caramel, was released in 2016, also on Planet Mu. Scholefield released the EP Refresher in 2017.In 2019, he released his third album, Ways of Seeing, following it with an EP of remixes, Return to Cascada, in 2020.", "link_mentions": [{"page": "List of Scottish musicians", "response": ["*Konx-Om-Pax, electronic musician"]}, {"page": "The Blue Notebooks", "response": ["On 11 May 2018, Deutsche Grammophon released a two-disc fifteenth-anniversary edition of The Blue Notebooks which includes re-recordings, alternate arrangements, and remixes by Jlin, and Konx-Om-Pax."]}, {"page": "Butter (album)", "response": ["In 2009, Hudson Mohawke signed to Warp Records, despite a very limited track record of official releases; in fact, the bulk of his releases were unofficial tracks and DJ mixes circulated on the Internet. Butter is his debut album and second release on Warp following the 2008 Polyfolk Dance EP. The album’s artwork was designed by Birchard’s friend Tom Scholefield (a.k.a. Konx-Om-Pax), with both working from a folder of influences they wanted to incorporate. The album features collaborations with Dam-Funk, Nadsroic, and Olivier Daysoul, the latter an American singer who contributes to two tracks.", "*Konx-Om-Pax - design"]}, {"page": "Scottish Album of the Year Award", "response": ["* Konx-Om-Pax – Caramel"]}, {"page": "Regional Surrealism", "response": ["#REDIRECT Konx-Om-Pax"]}, {"page": "Caramel (Konx-Om-Pax album)", "response": ["#REDIRECT Konx-Om-Pax"]}, {"page": "Refresher (EP)", "response": ["#REDIRECT Konx-Om-Pax"]}, {"page": "Refresher EP", "response": ["#REDIRECT Konx-Om-Pax"]}]}}