{"wiki_id": "http://www.wikidata.org/entity/Q644595", "itemLabel": "Hubert von Herkomer", "itemDescription": "British artist (1849-1914)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hubert_von_Herkomer", "wikipedia_page": {"main": "Sir Hubert von Herkomer  (born as Hubert Herkomer; 26 May 1849 – 31 March 1914) was a Bavarian-born British painter, pioneering film-director, and composer. Though a very successful portrait artist, especially of men, he is mainly remembered for his earlier works that took a realistic approach to the conditions of life of the poor. Hard Times (1885; Manchester Art Gallery) showing the distraught family of a travelling day-labourer at the side of a road, is one of his best-known works.\n\n", "link_mentions": [{"page": "1914 in music", "response": ["*March 31 – Hubert von Herkomer, painter, film director and composer (b. 1849)"]}, {"page": "John Couch Adams", "response": ["**Hubert von Herkomer in Pembroke College;"]}, {"page": "1849 in music", "response": ["*May 26 – Hubert von Herkomer, artist and composer (d. 1914)"]}, {"page": "Social realism", "response": ["Social realism traces back to 19th-century European Realism, including the art of Honoré Daumier, Gustave Courbet and Jean-François Millet. Britain's Industrial Revolution aroused concern for the urban poor, and in the 1870s the work of artists such as Luke Fildes, Hubert von Herkomer, Frank Holl, and William Small were widely reproduced in The Graphic.", "In Belgium, early representatives of social realism are found in the work of 19th century artists such as Constantin Meunier and Charles de Groux.Constantin Meunier at the Britannica In Britain, artists such as the American James Abbott McNeill Whistler, as well as English artists Hubert von Herkomer and Luke Fildes had great success with realist paintings dealing with social issues and depictions of the \"real\" world. Artists in Western Europe also embraced social realism in the early 20th century, including Italian painter and illustrator Bruno Caruso, German artists Käthe Kollwitz (Raped Woman), George Grosz (Teutonic Day), Otto Dix, and Max Beckmann; Swedish artist Torsten Billman; Dutch artists Charley Toorop (The Friends’ Meal) and Pyke Koch; French artists Maurice de Vlaminck, Roger de La Fresnaye, Jean Fautrier, and Francis Gruber and Belgian artists Eugène Laermans and Constant Permeke."]}, {"page": "Pour le Mérite", "response": ["Later recipients included Theodor Mommsen (1868), Charles Darwin (1868), Thomas Carlyle (1874), William Thomson, Lord Kelvin (1884), Joseph Lister (1885) Johannes Brahms (1887), Giuseppe Verdi (1887), Hubert von Herkomer (1899), Camille Saint-Saëns (1901), John Singer Sargent (1908), Ferdinand von Zeppelin (1910), Wilhelm Conrad Röntgen (1911), Sir William Ramsay (1911), and Max Planck (1915)."]}, {"page": "Hubert", "response": ["*Hubert von Herkomer (1849–1914), German-born British painter, film-director and composer"]}, {"page": "William Nicholson (artist)", "response": ["William Nicholson was born in Newark-on-Trent on 5 February 1872, the youngest son of William Newzam Nicholson, an industrialist and Conservative MP of Newark, and his wife Annie Elizabeth Prior, the daughter of Joseph Prior and Elizabeth (née Mallam) of Woodstock, Oxon. From the age of 9 he attended Magnus Grammar School, first as a weekly boarder, later as a day-boy. He had art lessons from the painter, politician and art-master William Cubley of Newark-on-Trent, who had been a pupil of Sir William Beechey, in turn a pupil of Sir Joshua Reynolds. He was briefly a student at Hubert von Herkomer's art school, where he met his future wife Mabel Pryde (1871–1918), who introduced him to her brother James Pryde (1866–1941). From the autumn of 1891 he attended the Académie Julian in Paris, but after six months returned to Newark."]}, {"page": "Budleigh Salterton", "response": ["*The German-born English painter Hubert von Herkomer died here in 1914."]}, {"page": "Henry Hobson Richardson", "response": ["* 1886 Lululaund or the Sir Hubert von Herkomer House – Bushey, Hertfordshire, England"]}, {"page": "1894 in architecture", "response": ["* Lululaund, a house for Hubert von Herkomer at Bushey, England, based on a design by Henry Hobson Richardson (d. 1886) (demolished 1939)."]}, {"page": "Bushey", "response": ["Hubert Herkomer was a poor immigrant from Bavaria, who moved to Bushey in 1874, and ended life in 1914 as Sir Hubert von Herkomer RA CVO. Herkomer had visited a friend who lived in Bushey in 1873, and returned to rent a pair of cottages and a studio near Melbourne Road. He founded Herkomer's Art School at Bushey in 1883, which, in its 21-year life, attracted some 500 students to the area, some of whom stayed after establishing their own studios. Their paintings are on display in the Bushey Museum. A street, Herkomer Road, was named in his memory.", "*Hubert von Herkomer, artist, owner of Lululaund"]}, {"page": "Lady Lever Art Gallery", "response": ["File:Hubert von Herkomer 1875 - The last Muster.jpg|The last Muster, Hubert von Herkomer (1875)"]}, {"page": "Archdruid", "response": ["The Archdruid's regalia, devised by the early revivers of the eisteddfod during the early 19th century, includes a crown, a sceptre, and a breastplate in the form of a torc. These were redesigned in 1896 by Hubert von Herkomer, to be made of gold and decorated with oak leaves, symbolising the sacred groves associated with druidry. (The Welsh word for \"oak\" is \"derw\" from which \"druid\" is thought to be derived.) A special ring of office was also introduced. The current sceptre has been in use since 1910, and a stola or cape was first worn in 1911 by the Archdruid \"Dyfed\"."]}, {"page": "Edward Onslow Ford", "response": ["Much of Ford's early success came in portraiture. His portrait busts are extremely refined and show his subjects at their best.  He sculpted many portrait busts which are noted for their tasteful conception, delicate modelling, and verisimilitude. The best, perhaps, are the heads of John Everett Millais, Thomas Huxley, Herbert Spencer, Sir WQ Orchardson, Matthew Ridley Corbet, the duke of Norfolk, Briton Rivière, Sir Lawrence Alma-Tadema, Sir Walter Armstrong, Sir Hubert von Herkomer, Arthur Hacker (1894), and M. Dagnan-Bouveret. Those in bronze of his fellow-artist Arthur Hacker (1894) and of the politician Arthur Balfour are striking likenesses, as is the marble statue of Sir Frederick Bramwell for the Royal Institution."]}, {"page": "1875 in art", "response": ["* Hubert von Herkomer – The Last Muster"]}, {"page": "1896 in art", "response": ["* Hubert von Herkomer is made a knight in the United Kingdom."]}, {"page": "Art of the United Kingdom", "response": ["Larger paintings concerned with the social conditions of the poor tended to concentrate on rural scenes, so that the misery of the human figures was at least offset by a landscape.  Painters of these included Frederick Walker, Luke Fildes (although he made his name in 1874 with Applicants for Admission to a Casual Ward- see above), Frank Holl, George Clausen, and the German Hubert von Herkomer.Wilson, 89-91; Rosenthal, 144, 160–162; Reitlinger, 156–157"]}, {"page": "Hubert Herkomer", "response": ["#redirectHubert von Herkomer"]}, {"page": "The Graphic", "response": ["The influence of The Graphic within the art world was immense, its many admirers included Vincent van Gogh, and Hubert von Herkomer.Mark Bills, \"Thomas, William Luson (1830–1900)\", Oxford Dictionary of National Biography, Oxford University Press, 2004", "When it began in 1869, the newspaper was printed in a rented house. By 1882, the company owned three buildings and twenty printing presses, and employed more than 1,000 people. The first editor was Henry Sutherland Edwards. A successful artist himself, the founder Thomas recruited gifted artists including Luke Fildes, Hubert von Herkomer, Frank Holl, and John Everett Millais."]}, {"page": "1891 in art", "response": ["* Hubert von Herkomer"]}, {"page": "1878 in art", "response": ["* Hubert von Herkomer – Eventide: A Scene in the Westminster Union"]}, {"page": "Luke Fildes", "response": ["At the age of 17, Fildes became a student at the Warrington School of Art. Fildes moved to the South Kensington Art School where he met Hubert von Herkomer and Frank Holl. All three men became influenced by the work of Frederick Walker, the leader of the social realist movement in Britain."]}, {"page": "1914 in art", "response": ["* May 4 – Suffragette Mary Wood attacks John Singer Sargent's portrait of Henry James at the Royal Academy Summer Exhibition in London with a meat cleaver. At the same exhibition on May 12, Gertrude Mary Ansell attacks the recently-deceased Hubert von Herkomer's portrait of the Duke of Wellington, and on May 26 'Mary Spencer' (Maude Kate Smith) attacks George Clausen's painting Primavera."]}, {"page": "1885 in art", "response": ["* Hubert von Herkomer – Hard Times"]}, {"page": "Royal Society of Portrait Painters", "response": ["The first exhibition of the Society was held in 1891.  The catalogue of that exhibition shows that its committee then consisted of Archibald Stuart-Wortley (Chairman), Hon. John Collier, Arthur Hacker, G. P. Jacomb-Hood, S.J. Solomon, James Jebusa Shannon and Hubert Vos.  The other members listed were Percy Bigland, C. A. Furse, Glazebrook, John McLure Hamilton, Heywood Hardy, Hubert von Herkomer, Henry J. Hudson, Louise Jopling, T. B. Kennington, W. Llewellyn, W. M. Loudan, Arthur Melville, Anna Lea Merritt, F. M. Skipworth, Mrs Annie Swynnerton, W. R. Symonds, Mary Waller, Edwin A. Ward, Leslie Ward (better known as \"Spy\"), and T. Blake Wirgman."]}]}}