{"wiki_id": "http://www.wikidata.org/entity/Q644208", "itemLabel": "Liz Smith", "itemDescription": "Scottish Conservative Party politician (born 1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Liz_Smith_(politician)", "wikipedia_page": {"main": "Elizabeth Jane Smith (born 27 February 1960) is a Scottish politician who has been Member of the Scottish Parliament (MSP) for Mid Scotland and Fife since 2007. A member of the Scottish Conservative Party, she has served as Shadow Cabinet Secretary for Finance and the Economy since 2021.\nBefore entering parliament, Smith was a schoolteacher and political researcher, as well as an amateur sportswoman, representing the Scottish women's cricket team. She was first elected in 2007 and re-elected in 2011 and 2016, having earlier stood unsuccessfully for the Parliament of the United Kingdom at the 2001 general election in the Perth constituency, where she missed out to the SNP by just 48 votes. She stood as a constituency candidate in the Perth constituency at the Scottish Parliament in 2007 and again in the newly established Perthshire South and Kinross-shire constituency in both 2011 and 2016, missing out by 1,422 votes in 2016. Smith served as Shadow Cabinet Secretary for Education and Skills from 2016 to 2020 and as Shadow Cabinet Secretary for Environment, Climate Change and Land Reform from 2020 to 2021.", "link_mentions": [{"page": "John Swinney", "response": ["In March 2020, after the results of Scottish students dropped in maths and science in the international PISA rankings for education, Swinney admitted, \"There is progress to be made in maths and science.\" Scottish Conservative education spokeswoman Liz Smith said: \"These two areas are so critical to the success of much of Scotland's modern economy. We should be doing so much better.\""]}, {"page": "Mid Scotland and Fife (Scottish Parliament electoral region)", "response": ["|rowspan=\"5\"|Liz Smith(Conservative)"]}, {"page": "Liz Smith", "response": ["Liz Smith may refer to:", "* Liz Smith (actress) (1921–2016), English character actress", "* Liz Smith (journalist) (1923–2017), American gossip columnist", "* Liz Smith (soccer) (born 1975), Canadian soccer player", "* Liz Smith (politician) (born 1960), Scottish Conservative Party politician"]}, {"page": "Gordon Banks (politician)", "response": ["Banks was elected in the new constituency of Ochil and South Perthshire at the 2005 general election, defeating both Annabelle Ewing and Liz Smith."]}, {"page": "Perth (Scottish Parliament constituency)", "response": ["The constituency's successor seat of Perthshire South and Kinross-shire, established by the 2011 First Periodic Review of Scottish Parliamentary constituencies, was comfortably held by the SNP's Roseanna Cunningham at the 2011 Scottish Parliamentary election, who polled ahead of Conservative challenger Liz Smith by 22.96% of the vote. At the 2016 Scottish Parliamentary election there was a 9.5% swing in the constituency from the SNP to the Conservatives, with Elizabeth Smith missing out by just 3.93% of the vote."]}, {"page": "Scottish Conservatives", "response": ["|Liz Smith ||Mid Scotland and Fife||2007 || Shadow Cabinet Secretary for Finance and Economy"]}, {"page": "Scottish Parliamentary Corporate Body", "response": ["| Liz Smith || Replaced Scanlon"]}, {"page": "List of sportsperson-politicians", "response": ["|data-sort-value=\"Smith,Liz\"| Liz Smith || Cricket || MSP for Mid Scotland and Fife (2007-)"]}, {"page": "Jackson Carlaw", "response": ["On 6 January 2020, Carlaw confirmed his candidacy for the February 2020 Scottish Conservative Party leadership election and launched his campaign in Edinburgh on 15 January. He received support from Ruth Davidson, Murdo Fraser, Adam Tomkins, Liz Smith, Annie Wells and Jamie Greene. This gave Carlaw the position of favourite over his opponent Michelle Ballantyne. He centred his campaign around how he could beat Nicola Sturgeon and the SNP in the next Scottish Parliament election and the local elections in 2022. He also promised to make the Scottish Conservatives more for the middle and working classes and continue to maintain the Scottish Conservatives as the main party of the Union. Carlaw won the election with 4,917 votes in his favour, as opposed to 1,581 for Ballantyne. He promised to provide a \"clear, focused and ambitious alternative to the SNP\"."]}, {"page": "Opposition Shadow Cabinets of the Scottish Parliament", "response": ["|Liz Smith", "|Liz Smith", "|Liz Smith", "|Liz Smith"]}, {"page": "Elizabeth Smith", "response": ["*Liz Smith (politician) (born 1960), Scottish Conservative Party politician", "*Liz Smith (journalist) (1923–2017), American gossip columnist", "*Liz Smith (actress) (1921–2016), English actress", "*Liz Smith (disambiguation)"]}, {"page": "Sunday Express Dunblane controversy", "response": ["Liz Smith, a Member of Scottish Parliament, was also criticised for describing the contents of some blogs as \"in bad taste\", a comment that was implied by the article to apply to those of the Dunblane survivors. She later claimed that her comments were quoted out of context, and were directed at teenage bloggers in general — a claim disputed by the Scottish Sunday Express editor Derek Lambie."]}, {"page": "2001 United Kingdom general election in Scotland", "response": ["Although Conservatives once again a Scottish MP, their vote actually share fell compared with 1997 and in vote share terms the fell to fourth place. On top of this they failed to win several target seats including Edinburgh Pentlands where former MP Malcolm Rifkind failed to regain the seat and Eastwood where Labour incumbent Jim Murphy substantial increased his majority over the Scottish Conservative Chairman Raymond Robertson. The Conservatives did  come close to gaining  Perth where Liz Smith came within 50 votes of taking the seat from the SNP. David McLetchie, the Scottish Conservative leader, said that one seat was \"better than nothing\"."]}, {"page": "2011 Scottish Conservatives leadership election", "response": ["*Liz Smith", "29 Aug – Struan Stevenson MEP, Alex Johnstone MSP, Alex Fergusson MSP and Liz Smith MSP endorse Murdo Fraser.", "30 Aug – Liz Smith is declared as Murdo Fraser's campaign manager."]}, {"page": "Liz Smith (Scottish politician)", "response": ["#REDIRECT Liz Smith (politician)"]}, {"page": "A977 road", "response": ["The new Clackmannanshire Bridge has led to an increase in heavy traffic using the A977 to reach the M90 motorway providing a quicker route for North East traffic from Glasgow and the west. The road has also become a favourable route for many UK and European hauliers in recent years seeking an alternative route to avoid DSVA enforcement activities on the M9 at Stirling.  This has caused to concern among people who live in communities on the road. MSP Liz Smith raised the matter in the Scottish Parliament but was told that this was a council matter.  She has since raised the matter with Perth and Kinross Council."]}, {"page": "List of people educated at George Watson's College", "response": ["* Liz Smith, MSP"]}, {"page": "List of female members of the Scottish Parliament", "response": ["|data-sort-value=\"Smith, Elizabeth\"|Liz Smith"]}, {"page": "Liz Smith (cricketer)", "response": ["#REDIRECT Liz Smith (politician)"]}, {"page": "Elizabeth Smith (cricketer)", "response": ["#REDIRECT Liz Smith (politician)"]}]}}