{"wiki_id": "http://www.wikidata.org/entity/Q6456493", "itemLabel": "L. Hugh Newman", "itemDescription": "British entomologist", "wikipedia_url": "https://en.wikipedia.org/wiki/L._Hugh_Newman", "wikipedia_page": {"main": "Leonard Hugh Newman, (3 February 1909 - 23 January 1993) always known as L. Hugh Newman, was a British entomologist, author and broadcaster.  He wrote many popular books on insects, especially butterflies and moths.  With Peter Scott and James Fisher, he was a resident member of the team who presented \"Nature Parliament\" on BBC radio's Children's Hour in the 1950s.  He ran a butterfly farm in Kent (which he inherited from his father), supplying among others Sir Winston Churchill, who bought many butterflies for his house at Chartwell.  A collection of Newman's entomological photographs is held by the library of the Natural History Museum in London", "link_mentions": [{"page": "Nymphalis antiopa", "response": ["In several European countries with Germanic languages, other than Britain, the name for this butterfly literally translates to \"mourning cloak\", such as German \"Trauermantel\", Dutch \"rouwmantel\", Swedish \"sorgmantel\", Finnish \"suruvaippa\" and Norwegian \"sørgekåpe\". This suggests it is a name which came with Scandinavian or German rather than with British settlers, for whom this species would be considerably less familiar. Other common names include: Czech \"Černokábátník\" . \"Babočka osiková\". Polish \"Rusałka żałobnik\". Russian \"Траурница\" . Japanese \"キベリタテハ\" . Chinese \"黄縁立羽\". L. Hugh Newman likened the butterfly's pattern to a girl who, disliking having to be in mourning, defiantly let a few inches of a bright dress show below her mourning dress.", "Migrants arrive in Great Britain most years during summer and autumn, but numbers are usually very low. There is no evidence that the species breeds in Britain; it is thought that mild, wet winters prevent them from surviving there for very long. The 'Butterfly Farmer' L. Hugh Newman raised thousands for release at his 'farm' in Bexley, but none were seen the following spring. Specimens stored in his refrigerator for the winter, however, survived. In a book he said that Camberwell Beauty catches in England were suspiciously concentrated around London, Hull and Harwich, all these being ports in the timber trade with Scandinavia, and theorized that they had hibernated in stacks of timber which was then shipped to England, and had not traveled naturally."]}, {"page": "List of Desert Island Discs episodes (1961–1970)", "response": ["|||L. Hugh Newman||Plays and Prefaces by George Bernard Shaw||Bed|| more"]}, {"page": "Stephen Dalton (photographer)", "response": ["Dalton's first published article was in Geographical, the magazine of the Royal Geographical Society.  He went on to supply images to the Natural History Picture Agency (NHPA) run by the entomologist L. Hugh Newman, whom he had met one day while out chasing wildlife with his camera. Later, when Newman retired, Dalton bought the business, and his NHPA became the UK's premier nature photography library. Dalton sold the agency in 2006.", "* 1967  Ants from Close-up (with L. Hugh Newman)"]}]}}