{"wiki_id": "http://www.wikidata.org/entity/Q64591", "itemLabel": "Freddie Dixon", "itemDescription": "English motorcycle racer and racing car driver (1892-1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Freddie_Dixon", "wikipedia_page": {"main": "Frederick William Dixon (21 April 1892 – 4 November 1956) was an English motorcycle racer and racing car driver. The designer of the motorcycle and banking sidecar system, he was also one of the few motorsport competitors to have been successful on two, three and four wheels. He was twice awarded the BRDC Gold Star for car racing. Dixon, who had the nickname \"Flying Freddie\", was born at Stockton-on-Tees, County Durham, England, one of eight children of John and Martha Dixon (née Agar).\nAfter leaving school at the age of thirteen he was employed in a cycle shop but soon moved on to work in a local garage. He acquired his first motorcycle in 1909 and within a year was competing in speed and hill climb events. His first Isle of Man TT race was in 1912 on a \"Cleveland Precision\" motorcycle but the machine was not up to the challenge.\nDuring World War I Dixon spent four years in the Army Service Corps and finished with the rank of staff sergeant.\nAfter war service he went into business for himself at Park Garage, Linthorpe Road, Middlesbrough. During this time he gained many placings in the Isle of Man TT races in various categories throughout 1921, 1923, 1924, 1926 and 1927.Dixon was quite an expert at motorcycle and sidecar racing, culminating in first place in the 1923 Isle on Man TT with passenger Thomas Walter Denney on a Douglas fitted with his banking sidecar system and three-wheel disc brakes. His design leaned the sidecar following the motorcycle direction around the race circuit bends, and was operated by the passenger moving a large lever attached to the sidecar chassis, as was the sidecar brake.His victory in 1927 was on an HRD Machine as a factory rider, becoming the first man to win both a sidecar and solo race at the Isle of Man TT. He retired from motorcycle racing in 1928.\nIn 1932 he appeared on the car racing scene and quickly became renowned for his independently prepared Riley cars. His achievements in racing cars are as impressive as those on motorcycles. First place in the 1934 BRDC 500-mile handicap race at Brooklands and in the same year he won third place at Le Mans with Cyril Paul in a Riley 12/6 (1.5L) MPH Racing. In 1935 he won the BRDC Empire Trophy at Brooklands and also the RAC Tourist Trophy race at Ards circuit Belfast. In 1936 he won the Brooklands 500 mile race and with Charles Dodson the RAC Tourist Trophy at Ards, for the second time. His record as the only man to lap Brooklands at 130 mph in a car of less than 2 litres was never broken.\nIn 1948 he was contacted by the Douglas motorcycle company to help in the development of their T35 motorcycle which was one of the first real new British post war designs, he redesigned the top half of the engine and these modifications resulted in the new mark 3 Douglas machine.\nBritish Racing Drivers Club gold star winner twice: in 1934 and 1935.  In January 1926 he married Margaret Thew at St. Barnabas Church, Middlesbrough. They had one daughter, Jean. He died at Reigate, Surrey age 64.", "link_mentions": [{"page": "April 21", "response": ["*1892 – Freddie Dixon, English motorcycle racer and racing driver (d. 1956)"]}, {"page": "November 4", "response": ["*1956 – Freddie Dixon, English motorcycle racer and race car driver (b. 1892)"]}, {"page": "Isle of Man TT", "response": ["The 1923 TT was the first time the Sidecar TT race was run, over three laps () of the Mountain Course and was won by Freddie Dixon and passenger Walter Denny with a Douglas and special banking-sidecar at an average race speed of . For the 1926 event the Sidecar and Ultra-Lightweight TT classes were dropped due to lack of entries.", "| Fergus Anderson, Hugh Anderson, Manliff Barrington, Artie Bell, Geoff Bell, Lowry Burton, Kel Carruthers, Bernard Codd, Charlie Collier, Keith Cornbill, Mark Cox, Steve Cull, Pat Cushnahan, Howard R Davies, Freddie Dixon, Charlie Dodson, Cameron Donald, Iain Duffus, Karl Ellison, Bob Foster, Dick Greasley, Manfred Grunwald, Hermann Hahn, Craig Hallam, Shaun Harris, John Hartle, Pete Hill, Fritz Hillebrand, Mac Hobson, Gary Hocking, John Holden, Josef Huber, Tim Hunt, Bill Ivy, Gary Johnson, Alistair King, Con Law, Eddie Laycock, Ivan Lintin, Bill Lomas, Nick Long, Graeme McGregor, Trevor Nation, Gary Padgett, Steve Plater, Jock Porter, Nick Roche, Cecil Sandford, Dave Saville, Tom Sheard, Edwin Twemlow, Malcolm Uphill, Dave Wells, Eric Williams, Paul Williams, Andrew Winkle, Michael Wynn,"]}, {"page": "Brooklands", "response": ["*Freddie Dixon (racing driver)"]}, {"page": "TVR", "response": ["Despite the lack of success at Sebring, the company continued to enter international motor racing events in 1962, including the Dutch Tulip Rally in May, and the 24 Hours of Le Mans in June. The Tulip Rally resulted in one car finishing third in its class, but the Le Mans outing was fraught with unfortunate events for the TVR team. In the time leading up to the race, two of the cars slated to compete were crashed in different incidents and hastily rebuilt. The single car that started the race would badly overheat and retire during the third lap. David Hives described the event as a \"fiasco\", and noted that \"it cost TVR a small fortune\". TVR cars were driven to greater success by World War II flying ace Tommy Entwistle, who, in 1962 and 1964, finished as runner-up in the Freddie Dixon Challenge Trophy race series. Entwistle won the series in 1963, 1965, and 1966. The car was maintained by David Hives throughout this time. After this racing success, Entwistle stopped racing for a period of time and sold the car to Gerry Sagerman."]}, {"page": "1933 in sports", "response": ["|  Freddie Dixon"]}, {"page": "Stockton-on-Tees", "response": ["* Freddie Dixon, motorcycle and car racing driver"]}, {"page": "Riley Motor", "response": ["Introduced in 1926 in a humble but innovatively designed fabric bodied saloon, Percy Riley's ground-breaking Riley 9 engine- a small capacity, high revving unit- was ahead of its time in many respects. Having hemispherical combustion chambers and inclined overhead valves, it has been called the most significant engine development of the 1920s. With twin camshafts set high in the cylinder block and valves operated by short pushrods, it provided power and efficiency without the servicing complexity of an OHC (overhead camshaft) layout. It soon attracted the attention of tuners and builders of 'specials' intended for sporting purposes. One such was engineer/driver J.G. Parry-Thomas, who conceived the Riley 'Brooklands' (initially called the '9' Speed Model) in his workshops at the banked Surrey circuit. After Parry-Thomas was killed during a land speed record attempt in 1927, his close collaborator Reid Railton stepped in to finish the job. Officially backed by Riley, the Brooklands, along with later developments and variations such as the 'Ulster' Imp, MPH, and Sprite, proved some of the most successful works and privateer racing cars of the late 1920s and early 1930s. At Le Mans in 1934, Rileys finished 2nd, 3rd, 5th, 6th and 12th, winning the Rudge-Whitworth Cup, the Team Prize, two class awards, and the Ladies' Prize. Rileys also distinguished themselves at the Ulster TT, at Brooklands itself, and at smaller events like hill climbs, while providing a platform for the success of motorsports' first women racing drivers such as Kay Petre, Dorothy Champney and Joan Richmond.Collection Explorer, National Museum of Australia- Joan Richmond collectionsearch.nma.gov.au, accessed 11 July 2019 Another engineer/driver, Freddie Dixon, was responsible for  extensive improvements to engine and chassis tuning, creating a number of 'specials' that exploited the basic Riley design still further, and contributed greatly to its success on the track."]}, {"page": "Ferguson Research", "response": ["In the 1930s, racing driver Freddie Dixon     began to develop the idea of producing a super-safe family car, with four-wheel drive and four -wheel steering. When Dixon was racing in the Ulster TT, he met Harry Ferguson, who garaged his car for him. Ferguson had developed the Ferguson System of tractor implements for reasons of safety and Dixon's ideas interested him. Army officer and racing driver  Tony Rolt,  who had engaged Dixon to maintain his ERA racing car became interested in Dixon's ideas and between them formed Dixon-Rolt Developments Ltd."]}, {"page": "Tony Rolt", "response": ["After the war Rolt resumed racing with an Alfa Romeo Bimotore, in which he took a fine second place in the 1948 Zandvoort GP. Between 1949 and 1952, he begun a close association with Freddie Dixon and Rob Walker, setting an engineering partnership with the former and racing Walker’s 1926 Delage and Delahaye. In 1950 and 1951, he shared a Nash-Healey, with Duncan Hamilton, on both occasions, finishing fourth and sixth at Le Mans. From 1952 to 1955, Rolt raced Walker’s dark-blue Connaughts in which he was tremendously successful in English national events, winning numerous Formula Two, Formula Libre and handicap races. Unfortunately, his business obliged him to restrict his racing. Also, in 1952 came the most significant move of his racing career; he was invited to join the Jaguar team, ”I’d proved quite competitive at Dundrod where I actually lapped the C-Type faster than Stirling [Moss]. Then they asked me who I’d like as my co-driver and I said Duncan. They said \"Duncan, you must be mad!” but he joined me in the team for 1952 and we always drove in long distance races together\". . Their first Le Mans together for Jaguar was a disaster, which resulted in a head gasket failure and an early retirement. ", "After the war, Rolt returned to form part of Rolt Dixon Research, with his mechanic, Freddie Dixon, to work on an idea that they had considered before the war: four-wheel drive. The company they formed also pioneered the viscous coupling. This eventually led to backing from tractor magnate Harry Ferguson and gave rise to the development of the Ferguson P99 four-wheel drive F1 car. Rolt subsequently built Indianapolis 500 track-racing 4WD cars for the American STP Corporation, and Ferguson transmissions appeared in the Lotus 56, Novi-Ferguson and STP-Paxton Turbocar Indy Cars of 1964 to 1969. With the technical director Claude Hill and the project engineer Derek Gardner, Rolt was among the unsung backroom heroes of British racing development. When Ferguson Development closed, Rolt founded FF Developments in 1971, converting cars, vans and ambulances to four-wheel drive. During the 1980s, major automotive manufacturers finally saw advantages in all-wheel drive technology, and the company became a major technology partner of Ford, Chrysler, Audi, Fiat and General Motors."]}, {"page": "Viscous coupling unit", "response": ["Tony Rolt is often credited with the original idea and development as applied to automatic couplings in vehicle transmission systems, particularly four-wheel drive, working with Freddie Dixon at the time. Ferguson Research and FF Developments were companies formed in the 1970s to commercialize much early work into 4WD systems and devices. "]}, {"page": "Frederick Dixon", "response": ["* Freddie Dixon (Frederick William Dixon, 1892–1956), English motorcycle racer and racing car driver"]}, {"page": "HRD Motorcycles", "response": ["In 1927 Freddie Dixon took first place in the Junior TT, and sixth in the Senior for HRD. Despite this victory, the financial situation worsened."]}, {"page": "1920 Isle of Man TT", "response": ["| align=\"left\"| Freddie Dixon"]}, {"page": "1921 Isle of Man TT", "response": ["|valign=\"top\"|  Freddie Dixon, Indian", "More drama was to follow in the Senior event as the race-lead changed every lap between Alec Bennett riding a Sunbeam, Freddie W.Dixon riding an Indian, and Freddie Edmond riding a Triumph who set a new lap record of 40 minutes and 8 seconds, an average speed of . The Senior race was eventually won by Howard Davies riding a 350 cc Junior race motorcycle, by a margin of 2 minutes and 3 seconds from Freddie Dixon and Bert Le Vack in 4 hours, 9 minutes and 22 seconds, at an average race speed of .", "| align=\"left\"| Freddie Dixon"]}, {"page": "FF Developments", "response": ["FF (Ferguson Formula) Developments Limited (FFD) was a British company founded by Major A.P.R. (Tony) Rolt to exploit the 4WD technology begun originally at Dixon-Rolt Developments in partnership with Freddie Dixon and, from 1950 at Harry Ferguson Research. Rolt became Technical Director at Harry Ferguson Research until 1971, when the company was closed down.", "The company was founded in Coventry in 1971 by Tony Rolt.  to exploit the 4WD technology begun originally at Dixon-Rolt Developments in partnership with Freddie Dixon and, from 1950 at Harry Ferguson Research. "]}, {"page": "Bernard Unett", "response": ["He began motor racing in 1961. After competing and crashing in a disastrous Club rally, Rootes competition manager Mike Parkes encouraged Unett to attend a race meeting at the Goodwood Circuit, leading him to buy his first racing car,Doug Nye Sportscar magazine, Oct 1966 a prototype from the Alpine development programme registration number XRW 302.Alpine the classic Sunbeam by Chris McGovern After developing it for racing it was in this car that Unett won his first trophy in 1964, the 'Freddie Dixon Challenge Trophy', one of the biggest prizes in motor club racing at the time.Doug Nye, Sportscar magazine Oct 1966 The history of this surviving prototype can be found here. The site also has a film and pictorial history of Bernard Unett's career."]}, {"page": "Douglas (motorcycles)", "response": ["Douglas had some success in motorcycle racing and trials events. Twelve Douglas motorcycles were entered in both the Junior TT and Senior TT, and another three were in the Sidecar race during the 1923 TT. This gave Douglas their first senior Isle of Man TT victories. However Douglas had previously won the Junior TT in 1912. Tom Sheard won the 500 cc Senior TT and they won the first ever Isle of Man Sidecar race with Freddie Dixon while Jim Whalley had the fastest lap in the Senior TT with a time of just under  during a wet race. A Douglas also placed third in the Junior TT that year. Later in 1923 Jim Whalley won the French Grand Prix, a distance of , and another Douglas won the 1923 Durban-Johannesberg Marathon race; a remarkable achievement by Percy Flook on a 2.75 hp machine with an average  for . 1923 also saw Jim Whalley win the Spanish 12-hour race and Alec Bennett won the 1923 Welsh TT race. The late twenties saw success in Austria (1929 Austrian TT was won by Rudolph Runtsch)  Post war the factory had little road racing success however a Mark 3 did win an outstanding victory in the 1950 Bemsee 'Silverstone Saturday' beating all the Velocettes, Nortons and BSA Gold Stars"]}, {"page": "1923 Isle of Man TT", "response": ["|valign=\"top\"|  Freddie Dixon, Douglas  Walter Denny ", "|valign=\"top\"|  Freddie Dixon, Indian", "The 1923 Isle of Man Tourist Trophy saw the introduction of the first Sidecar TT race over 3 laps, won by Freddie Dixon and passenger Walter Denney using a special Douglas motorcycle with a banking-sidecar in a time of 2 hours, 7 minutes and 48 seconds, at an average speed of . The fastest Sidecar lap was by Harry Langman on a Scott at .", "| align=\"left\"| Freddie Dixon ", "| align=\"left\"| Freddie Dixon "]}, {"page": "1924 Isle of Man TT", "response": ["|valign=\"top\"|  Freddie Dixon  43min. 32sec. 53.23 mph ", "|valign=\"top\"|  Freddie Dixon, Douglas", "|valign=\"top\"|  Freddie Dixon  35min. 31sec. 63.75 mph New record", "| 3 ||  Freddie Dixon || Douglas || 3.45.46.4 || 60.17 || 6", "| align=\"left\"| Freddie Dixon", "|colspan=14| Fastest lap: Freddie Dixon, 43min. 32sec. 53.23mphThe Isle of Man Examiner, Friday 27 June 1924"]}, {"page": "1936 Isle of Man TT", "response": ["* Wal Handley crashes a Riley belonging to Freddie Dixon at Brooklands during the British Empire Trophy and breaks an arm.Isle of Man Weekly Times dated 2 May 1936."]}, {"page": "1927 Isle of Man TT", "response": ["| 6 ||  Freddie Dixon || HRD || 64.32 || 4.06.26", "| 1 ||  Freddie Dixon || HRD ||  || 3.55.54"]}, {"page": "1926 Isle of Man TT", "response": ["|| Freddie Dixon"]}, {"page": "1925 Isle of Man TT", "response": ["|valign=\"top\"|  Freddie Dixon  39min. 36sec. 57.18 mph New record", "| align=\"left\"| Freddie Dixon", "|colspan=14| Fastest lap: Freddie Dixon, 39min. 36sec. 57.18mphThe Isle of Man Examiner, Friday 19 June 1925"]}, {"page": "Howard R. Davies", "response": ["He became involved in TT machine development, and by early 1921 the TT machinery was much improved. The 1921 AJS team obtained 1st, 2nd, 3rd, 4th, 6th and 8th places in the Junior 1921 TT event. The winner was Eric Williams. Davies finished in second place, even after having a puncture in the second lap. He finished first in the Senior TT on a 350, a full two minutes ahead of the runner-up, Freddie Dixon on an 'Indian'. This was the first time a 350 cc motorcycle won the Senior."]}, {"page": "Junior TT", "response": ["|  Freddie Dixon"]}, {"page": "Wal Handley", "response": ["He took up car racing in 1934, becoming a member of George Eyston's MG team.  His car racing ability was soon remarked upon at Brooklands and also drew favourable comment in the Isle of Man 'Round the Houses' contests. He also raced cars at Donington and in the RAC International TT on the Ards circuit in Northern Ireland, but he had no success and, after MG exited motor racing, he teamed up with Freddie Dixon.  In 1935 he became Dixon's co-driver and together they raced the Dixon Riley at Brooklands, where Walter shared in their gaining the Race Team Award in the 1935 500-mile race.  It was at Donington in the British Empire Trophy Race of 1936 that Wal suffered serious injuries when the Riley somersaulted at the Hairpin Bend.  A major factor causing this spectacular crash was due to the fact that Dixon had decided to experiment by locking the differential on the eve of the race and there had been no time to practise.Handley, John None More Brave Aspect Design p. 302 No sooner had Wal recovered from his injuries than he was looking for another opportunity to race when war came.", "In 1935 he co-drove Freddie Dixon's Riley at Brooklands in the 500 Miles race, but the conrod holed the crankcase when he was competing for third place.Light Car 27 September 1935", "In 1936 Handley had a bad crash at the 1936 British Empire Trophy after taking over Freddie Dixon's third placed Riley and suffered serious injuries to his spine and ribs.Handley, John None More Brave (2014) 2nd Ed, pp300-04"]}, {"page": "Sidecar TT", "response": ["The 1923 races was the first time the Sidecar TT race was run, over 3 laps (113 miles) of the Mountain Course won by Freddie Dixon and passenger T.W.Denney with a special Douglas banking-sidecar at an average race speed of 53.15 mph. For the 1926 races the Sidecar TT and Ultra-Lightweight TT were dropped due to lack of entries.", "| Steve Abbott, Georg Auerbacher, Florian Camathias,  Freddie Dixon, M. Hamblin, Roy Hanks, Conrad Harrison, Helmut Fath, Heinz Luthringshauser, George O'Dell, Eric Oliver*, Les Parker, C. Prichard, Tim Reeves, Nigel Rollason, Fritz Scheidegger, George H. Tucker, Chris Vincent, Terry Vinicombe || 1"]}, {"page": "1933 Grand Prix season", "response": ["|  Freddie Dixon"]}, {"page": "Tom Sheard", "response": ["In 1923, Douglas had their first Senior TT race victory with Sheard winning on a 500 cc machine. Sheard was one of only five riders in the world to trial disc brakes on a Douglas motorcycle. Other riders to trial the disc-braked Douglas were Freddie Dixon and Sydney Ollerhead. "]}, {"page": "Belgian motorcycle Grand Prix", "response": ["|  Freddie Dixon"]}, {"page": "Brough Superior SS100", "response": ["The SS100 engineering was developed through competition and wins in over 50 events in the early 1920s, and Bert le Vack, who worked with Brough on development, was the holder of seven world records.  In 1927 George Brough and Freddie Dixon both achieved a record  for the kilometre on the SS100 and in 1928 Brough broke his own record with .  In 1932 Ronald Storey achieved 81.08 mph for the standing half-mile at Brighton and in 1939 Noel Pope secured an all time Brooklands track record lap time of   on an SS100."]}, {"page": "Douglas Mark III", "response": ["In 1948, the company developed a series of motorcycles based on the T35. Designed by George Halliday, these featured Douglas \"Radialraulic\" forks with the front wheel spindle carried on short leading links pivoted at the rear of the fork stanchions – with springs and a damping mechanism inside the stanchions. Although the frame and suspension were innovative, the engine was essentially a generator, designed to run for long periods at a steady speed and it did not cope well with the varying engine speeds of motorcycling. There was also a tendency to sideways shaking at low engine speeds which was a feature of the horizontally opposed engine. Douglas hired former Sunbeam motorcycles designer Erling Poppe as Technical Director, Freddie Dixon as their specialist engine tuner and Walter Moore (who designed the Norton CS1) as Works Superintendent. The result was the 1949 Douglas Mark III, which had improved performance through an uprated cylinder head, combustion chambers, and pistons. Douglas also produced a Mark III \"De Luxe\", a Mark III Sports, and a rigid-framed motorcycle trials Competition version with high-level exhausts and a less deeply valanced front mudguard. There never was a Douglas Mark II, and the Mark IV was short-lived, so the end of the line of development was the Mark V produced between 1951 and 1954, when it was replaced by the Douglas Dragonfly."]}, {"page": "Cleveland motorcycle", "response": ["*Cleveland motorcycles, using Precision engines, made by Cleveland Motors, Douglas Street, Middlesbrough (includes the former Cleveland), England, (1911–1914) ridden by Freddie Dixon."]}, {"page": "1934 Mannin Moar", "response": ["|7|| Freddie Dixon||F.W. Dixon||Riley 2000/6||rowspan=\"6\"|", "|2||Freddie Dixon||Riley", "|7||Freddie Dixon||Riley||+30 laps (DNF - bearings)"]}, {"page": "British Empire Trophy", "response": ["|  Freddie Dixon"]}, {"page": "Kop Hill Climb", "response": ["The fastest time recorded for a car was in 1922 when Count Zborowski driving a Ballot GP achieved 26.8 seconds, and the fastest motorcycle was in 1925 with Freddie Dixon achieving a time of 22.8 seconds with a 736 cc Douglas at an average of ."]}, {"page": "History of the Isle of Man TT Races 1920–1929", "response": ["The 1920 Junior TT race included for the first time a new Lightweight class for motorcycles of 250 cc engine capacity. The Lightweight class of the 1920 Junior TT was won by Ronald Clarke, riding a Levis. He might have won the event overall, but crashed at the 33rd Milestone on the last lap, finishing fourth overall. The 1921 Senior TT race was won by Howard Davies on a 350 cc Junior TT AJS by a margin of 2 minutes and 3 seconds from Freddie Dixon and Hubert Le Vack. For 1922 the ACU introduced a Lightweight TT race for 250 cc motorcycles, and the first winner was Geoff S Davison riding a Levis at an average race speed of 49.89. The 1922 Junior TT Race was won by local Isle of Man competitor Tom Sheard riding an AJS at an average race speed of 54.75 mph. Despite crashing twice, a broken exhaust and a fire in the pits, Stanley Woods, riding a Cotton, finished 5th in the 1922 Junior TT race. In the 1922 Senior TT race, Alex Bennett riding a Sunbeam led all 6 laps from start to finish to win from Walter Brandish riding a Triumph.", "More changes to the course followed in 1923 with the adoption of a private road between Parliament Square and May Hill in Ramsey. The course had previously negotiated Albert Road and Tower Road. The course length was then  (revised to 37.733 miles in 1938).Official TT Guide 1992 pp 45 Mannin Media Publication/Isle of Man Department of Tourism Brandish Corner, between Creg-ny-Baa and Hillberry, was named after Walter Brandish who crashed there and broke a leg. The first Sidecar TT race, held in 1923 over 3 laps (113 miles), was won by Freddie Dixon and passenger Walter Denny with a Douglas and special banking-sidecar at an average race speed of . The Senior TT race of 1923 was held in poor weather, and local course knowledge allowed local Manx competitor Tom Sheard, on a Douglas, to win his second TT race, in addition to his first win in the 1922 Junior TT on an AJS. Another first-time winner of a TT race in 1923 was Stanley Woods in the Junior race on a Cotton."]}, {"page": "Motorcycle braking systems", "response": ["Douglas motorcycles were available with Research Association disc brakes front and rear on their 1923 RA model, sometimes called TT model, with Freddie Dixon's 1923 sidecar TT-winning machine of that type also having a passenger-operated disc brake for the sidecar wheel.Wilson, Hugo. (1993) The Ultimate Motor-Cycle Book p.51 Douglas and banking sidecar. Dorling Kindersley  Accessed and added 2015-11-25More vintage racing Douglas Vintagent, 30 January 2007, Retrieved 2015-11-25"]}]}}