{"wiki_id": "http://www.wikidata.org/entity/Q645423", "itemLabel": "John Duttine", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Duttine", "wikipedia_page": {"main": "John Arthur Duttine (born 15 March 1949) is an English actor noted for his roles on stage, films and television. He is well known for his role as Sgt George Miller in Heartbeat and also Bill Masen in the TV series The Day of the Triffids.", "link_mentions": [{"page": "Rosencrantz and Guildenstern Are Dead", "response": ["A 1983 radio adaptation was broadcast on the BBC World Service on 17 October directed by Gordon House, with Nigel Anthony as Rosencrantz, Nicky Henson as Guildenstern, Jack May as The Player, John Duttine as Hamlet, Peter Vaughan as Claudius, Marcia Warren as Gertrude, Eileen Tully as Ophelia, Cyril Shaps as Polonius and Alex Jennings as a Tragedian."]}, {"page": "The Day of the Triffids", "response": ["* A 6x30 minute episode television serial version was produced by the BBC in 1981 and repeated first on UKGold in the early 1990s (as 3x50 minute episodes, as it was edited for international sales) then on BBC Four in 2006, 2007, 2009 and 2014. It starred John Duttine as Bill Masen and was fairly faithful to the novel, albeit moving the timeline to a then-contemporary setting."]}, {"page": "R. F. Delderfield", "response": ["British TV has made five series based on Delderfield's books. Nigel Havers played Paul Craddock in BBC TV's A Horseman Riding By (1978), adapted from the eponymous novel.A Horseman Riding By, British Film Institute, London, Undated.Accessed: 09-03-2008. John Duttine played David Powlett-Jones in BBC TV's To Serve Them All My Days (1980), adapted by Andrew DaviesR. F. Delderfield, BFI Screen Online, Undated.Accessed: 09-03-2008. from the eponymous novel R.F. Delderfield, TV.com, Undated, Undated.Accessed: 09-03-2008. and Archie Carver in London Weekend Television's  People Like Us (1977), adapted from the Avenue novels. John Duttine Biography (1949–) Film Reference, Undated.Accessed: 09-03-2008. Diana was adapted in 1984 into a BBC miniseries starring Jenny Seagrove in the title role and Patsy Kensit as her younger self. Come Home Charlie, and Face Them was adapted as a mini-series by London Weekend Television in 1990.'Come Home Charlie and Face Them', Internet Movie Database.Accessed:30-05-2013."]}, {"page": "1977 in film", "response": ["| Jesus of Nazareth || ITC Entertainment / RAI / NBC || Franco Zeffirelli (director/screenplay); Anthony Burgess, Suso Cecchi d'Amico (screenplay); Robert Powell, Anne Bancroft, Ernest Borgnine, Laurence Olivier, Christopher Plummer, Anthony Quinn, Rod Steiger, James Earl Jones, Peter Ustinov, Claudia Cardinale, Valentina Cortese, James Farentino, Stacy Keach, Tony Lo Bianco, James Mason, Ian McShane, Donald Pleasence, Fernando Rey, Ralph Richardson, Michael York, Olivia Hussey, Cyril Cusack, Ian Holm, Yorgo Voyagis, Ian Bannen, Marina Berti, Regina Bianchi, Maria Carta, Lee Montague, Renato Rascel, Oliver Tobias, Norman Bowler, Robert Beatty, John Phillips, Ken Jones, Nancy Nevinson, Renato Terra, Roy Holder, Jonathan Adams, Oliver Smith, Murray Salem, Tony Vogel, Michael Cronin, Derek Godfrey, Renato Montalbano, John Duttine, Keith Skinner, Cyril Shaps, John Tordoff, Francis de Wolff, Mark Eden, Bruno Barnabe, Simon MacCorkindale, Forbes Collins, Martin Benson, Carl Forgione, Donald Sumpter, Pino Colizzi, Robert Brown, Harold Bennett, Abdelmajid Lakhal || Epic, Drama || Live Action"]}, {"page": "The Browning Version (play)", "response": ["The Royalty Theatre produced the play in the West End of London with its counterpart Harlequinade in 1988, starring Paul Eddington and Dorothy Tutin as Andrew and Millie Crocker Harris, with a stellar supporting cast including Jean Anderson, John Duttine, Daniel Beales, Jack Watling and Simon Shepherd. It was directed by Tim Luscombe"]}, {"page": "Jesus of Nazareth (TV series)", "response": ["* John Duttine as John"]}, {"page": "Les Dennis", "response": ["Dennis' stage work includes Amos Hart in Chicago and Bill Snibson in Me and My Girl in the West End. He has starred in Skylight at the Water Mill Theatre in Newbury, Mr Wonderful at the Gateway Theatre in Chester, and Misery at the Coliseum Theatre in Oldham. He also appeared in Just Between Ourselves and co-starred alongside Janet Suzman in Cherished Disappointments in Love at London's Soho Theatre. He co-starred with Christopher Cazenove and John Duttine in a national tour of 'Art' and as Norman Bartholomew in Anthony Shaffer's dark comedy Murderer at London's Menier Chocolate Factory. He later starred in a hit season of Neville's Island at the Birmingham Repertory Theatre."]}, {"page": "Touching Evil", "response": ["*John Duttine as Michael Hawkins (4 episodes)"]}, {"page": "Viv Nicholson", "response": ["In 1978, Nicholson co-wrote an autobiography with Stephen Smith titled Spend, Spend, Spend[https://www.theguardian.com/uk-news/2015/apr/14/viv-nicholson Viv Nicholson obituary, The Guardian, 14 April 2015 that was dramatised for the BBC's Play for Today series by Jack Rosenthal. Spend, Spend, Spend (1977) was directed by John Goldschmidt (who won a BAFTA award for the filmed play) and stars Susan Littler and John Duttine."]}, {"page": "Colin Pitchfork", "response": ["The killings features in a 2002 episode of Real Crime \"Cracking the Killer's Code\".  Pitchfork was played by John Duttine."]}, {"page": "Catherine Cookson", "response": ["* The Mallens (1979–1980) with John Hallam, John Duttine, David Rintoul and Juliet Stevenson"]}, {"page": "Edith Thompson and Frederick Bywaters", "response": ["In 1934, F. Tennyson Jesse published A Pin to See the Peepshow, \"a fictional account of the Thompson-Bywaters case despite the usual disclaimer at the front that all the characters are imaginary. The title refers to the children's entertainment at which (she) first met her lover-to-be\". This was dramatised on TV in 1973 with Francesca Annis, John Duttine and Bernard Hepton playing characters based on Edith Thompson, Bywaters and Percy Thompson respectively. Annis received a nomination for British Academy Television Award for Best Actress."]}, {"page": "Taggart", "response": ["* John Duttine (Episode: Devil's Advocate)"]}, {"page": "Matthew Waterhouse", "response": ["Adric was a companion of Tom Baker and Peter Davison's Doctors from 1980 to 1982. Waterhouse was the youngest actor to play a companion and Doctor Who was only his second professional acting role. He played the schoolboy Briarley in the BBC2 adaptation of To Serve Them All My Days with John Duttine, and it was only shortly before he filmed his appearance on the miniseries that he found out he had secured the role of Adric."]}, {"page": "Pob's Programme", "response": ["Over 28 celebrity visitors appeared on Pob's Programme like Nigel Hayes, some appearing twice. The visitors, many of them well known as actors, included Roy Castle, Jan Francis, Charlie Williams, Madhur Jaffrey, Brian Blessed, Brian Patten, Hannah Gordon, Su Pollard, Kathy Staff, John Duttine, Ross Davidson, Spike Milligan, Toyah Willcox. Bill Pertwee, Anni Domingo, Josette Simon, Tony Armatrading, Rupert Frazer, Kjartan Poskitt, Bernard Hepton, Peter Howitt, Cheryl Campbell, Susan Gilmore, Pat Coombs and Patricia Hodge. One episode was filmed on location at Birmingham Children's Hospital with Barry Foy as a patient."]}, {"page": "Who Dares Wins (film)", "response": ["* John Duttine as Rod Walker"]}, {"page": "The Jury (TV serial)", "response": ["*John Duttine as Mark Waters"]}, {"page": "Simon Gipps-Kent", "response": ["Gipps-Kent headlined in two Southern Television serials based on books written by British children's authors; Midnight is a Place (1977), by Joan Aiken, and Noah's Castle (1980), by John Rowe Townsend. As \"Chad Boyer\", he reunited with Devil's Crown actor John Duttine in his BBC series To Serve Them All My Days (1980), based on the R. F. Delderfield novel. Also in 1980, his appearance in Jill Gascoine's ITV series The Gentle Touch paired him with soon-to-be pop star Limahl."]}, {"page": "Lame Ducks (TV series)", "response": ["The series starred John Duttine as Brian Drake, a man who, no longer able to work due to a serious injury after being hit by a truck, decides to head off to live as a hermit. As he goes along, he is joined by various other outcasts, including a woman called Angie (played by Lorraine Chase). The group eventually settle at a derelict railway station.", "*John Duttine as Brian Drake"]}, {"page": "Dangerfield (TV series)", "response": ["A number of famous actors appeared as guest stars: they included Keith Allen, Robin Ellis, Edward Hardwicke, Anita Dobson, Brigit Forsyth, Brendan Coyle, Richard Hawley, Michael Elphick, Rachel Davies, Helen Baxendale, David Daker, Stephen Moore, Roberta Taylor, Corin Redgrave, Hilda Braid, Jean Marsh, Denys Hawthorne, John Duttine, Owen Teale, Andrew Lancel, Jim Carter, Mary Healey, Tom Bell, Joe McGann, Haydn Gwynne, Simon Williams, Michelle Holmes, Phyllida Law, Miles Anderson, Robert Pugh, Elizabeth Bennett, Roger Brierley, Colin Baker and Richard Lumsden. Some future stars who also appeared included Kevin Bishop, Adrian Bower, Hannah Waterman and Daniel Ryan. In addition, Alan Towers, the former main anchor on the local news programme Midlands Today, appeared as a local television reporter in a few episodes."]}, {"page": "A Tale of Two Cities", "response": ["*In June 1989, BBC Radio 4 produced a seven-hour drama adapted for radio by Nick McCarty and directed by Ian Cotterell. This adaptation has been occasionally repeated by BBC Radio 7 and later BBC Radio 4 Extra (most recently in 2009). The cast included Charles Dance as Sydney Carton, Maurice Denham as Dr Manette, Richard Pasco as Mr Lorry, John Moffatt as Marquis St. Evrémonde, Charlotte Attenborough as Lucie Manette, John Duttine as Darnay, Aubrey Woods as Mr Stryver and Barbara Leigh-Hunt as Miss Pross."]}, {"page": "The Day of the Triffids (1981 TV series)", "response": ["The series takes place in late 20th century Britain. A spectacular meteorite shower unexpectedly renders most of humanity blind, leading to the breakdown of society overnight. Unaware of this, Bill Masen (John Duttine) has retained his sight by virtue of being in hospital with his eyes bandaged at the time of the shower. Bill works on a Triffid farm, where the mobile and carnivorous plants are cultivated for their oil with their deadly stings retained, which improves the oil quality. Prior to the story he was stung by a plant and even though he was wearing protective clothing, some of the poison got into his eyes.  In the hospital he tentatively removes the bandages and gradually discovers the catastrophe around him.", "* John Duttine as Bill Masen", "The British Film Institute's Screenonline wrote, \"This remains a compelling and understated thriller. As with the same year's classic The Nightmare Man (BBC), it represents serious and unsentimental science fiction with John Duttine, in particular, excelling as the battling and bewildered protagonist, struggling to survive in a blind, brutal world. Critic David Pringle termed the original novel \"a very enjoyable catastrophe\", and to the production team's credit the same can be said of this involving and intelligent adaptation.\""]}, {"page": "Time and the Conways", "response": ["A BBC Radio 4 adaptation was directed by Sue Wilson and broadcast on 12 August 1994 (later re-broadcast on 23 May 2010 over BBC Radio 7). The cast included Marcia Warren as Mrs. Conway, Belinda Sinclair as Kay, John Duttine as Alan, Toby Stephens as Robin, Emma Fielding as Carol, Stella Gonet as Madge, Amanda Redman as Hazel, John McArdle as Ernest and Christopher Scott as Gerald."]}, {"page": "Ain't Misbehavin' (TV series)", "response": ["*John Duttine – Dave Drysdale"]}, {"page": "List of Heartbeat cast members", "response": ["| John Duttine || Sgt George Miller || colspan=\"13\"  || colspan=\"5\" "]}, {"page": "Mel Martin", "response": ["Martin was married to Paul Ridley from 1980 to 1982. Her second marriage is to actor John Duttine, whom she met while filming the TV adaptation of Ruth Rendell's Talking to Strange Men."]}, {"page": "List of Dalziel and Pascoe cast members", "response": ["*John Duttine"]}, {"page": "Exotron & Urban Myths", "response": ["*Hector — John Duttine"]}, {"page": "Sweet Revenge (British TV series)", "response": ["* John Duttine as DI Briars"]}, {"page": "Any Other Business", "response": ["Any Other Business was a radio program that aired from May 1995 to July 1995.  There were six 35-minute episodes and it was broadcast on BBC Radio 4.  It starred John Duttine, Jan Ravens, June Whitfield, James Grout, and Toby Longworth.  It was written by Lucy Flannery and produced by Liz Ansty."]}, {"page": "A Woman of Substance (TV series)", "response": ["* John Duttine as Joe Lowther"]}, {"page": "Cultural depictions of John, King of England", "response": ["*Paul Spurrier (as a boy) and John Duttine (as an adult) in the BBC TV drama series The Devil's Crown (1978), which dramatised his reign and those of his father and brother"]}, {"page": "The Devil's Crown", "response": ["* John Duttine as John, King of England"]}, {"page": "The Mallens", "response": ["The pivotal character is a ruthless 19th century Northumberland Squire, Thomas Mallen (played by John Hallam) of High Banks Hall, who has a genetic white streak (Poliosis) in his hair and fathers numerous illegitimate children, who all inherit the white streak and live disastrous lives. One of them is Donald Radlet (John Duttine), who stars in both The Mallen Streak and The Mallen Girls. Thomas Mallen, penniless, mortgages his farming estate to make ends meet; he attempts to get his only legitimate son, Richard Mallen (David Rintoul) married to Fanny Armstrong, an unattractive girl with a rich father. Richard struggles to get Fanny to marry him, since they dislike each other, but her dowry would save Richard and Thomas from losing their big house and property. However, the plan fails due to a servant unintentionally revealing that Richard was only marrying Fanny for her money and that he didn't like her, and Richard losing his temper. He shoots and kills a visiting bailiff in the process, causing Thomas Mallen to be declared bankrupt and to lose everything. This forces Thomas to move into a small cottage, with his late wife's nieces Barbara (Pippa Guard) and Constance (Julia Chambers) and their Governess Anna Brigmore (Caroline Blakiston), who starts an affair with the now bankrupt Squire. Some time after this, Donald and his half brother Matthew Radlet (Ian Saynor) come to the cottage to visit Donald's father (their mother, whom Thomas raped in order to conceive Donald, is now married to Matthew's father, a stern farmer). Donald and Matthew then take a romantic interest in Barbara and Constance. While Donald is courting Barbara, he is also secretly trying to take Constance away from Matthew, who is in love with her (though his parents do not wish either brother to marry, since Matthew is consumptive and the family farm is not prosperous enough to support extra family members). Donald eventually achieves this aim, winning Constance and leaving both Matthew and Barbara in the lurch."]}]}}