{"wiki_id": "http://www.wikidata.org/entity/Q6469941", "itemLabel": "Lady Annabel Goldsmith", "itemDescription": "English socialite and memoirist", "wikipedia_url": "https://en.wikipedia.org/wiki/Lady_Annabel_Goldsmith", "wikipedia_page": {"main": "Lady Annabel Goldsmith (née Vane-Tempest-Stewart, formerly Birley; born 11 June 1934) is an English socialite and the eponym for a London nightclub of the late 20th century, Annabel's. She was first married for two decades to entrepreneur Mark Birley, the creator of Annabel's, her husband's inaugural members-only Mayfair club.\nA London society hostess, during the 1960s and the 1970s, she gained notoriety in gossip columns for her extramarital affair with Anglo-French financier James Goldsmith, member of the wealthy banking Goldschmidt family of German-Jewish origin, who later became her second husband. A descendant and heiress of the Londonderry family, her primary occupation has been as a mother of six children whose births span 25 years. She is also an author and founder of the Democracy Movement, a Eurosceptic political advocacy group. Among her children are the journalist and film producer Jemima Goldsmith and Zac Goldsmith, the former Conservative MP for Richmond Park.", "link_mentions": [{"page": "1934 in literature", "response": ["*June 11 – Lady Annabel Goldsmith, English memoirist and socialite"]}, {"page": "List of political families in the United Kingdom", "response": ["**Lady Annabel Goldsmith (1934–), president of Democracy Movement. Spouse of James."]}, {"page": "Democracy Movement", "response": ["Sir James's widow, Lady Annabel Goldsmith became its president and Sykes became its chairman until he stepped down in 2000 on re-joining the Conservative Party. Lady Annabel's son, the businessman Robin Birley, took over as the organisation's chairman, serving until 2004."]}, {"page": "Annabel Vane Tempest Stewart", "response": ["#REDIRECT Lady Annabel Goldsmith"]}, {"page": "Lady Annabel Vane-Tempest-Stewart", "response": ["#REDIRECT Lady Annabel Goldsmith"]}, {"page": "Annabel Goldsmith", "response": ["#REDIRECT Lady Annabel Goldsmith"]}, {"page": "Annabel Vane-Tempest-Stewart", "response": ["#REDIRECT Lady Annabel Goldsmith"]}, {"page": "Paul Sykes (businessman)", "response": ["In the 1997 general election he selectively funded eurosceptic Conservative candidates, and in 1998 pledged to \"use every means possible\" to persuade British voters to say no in a referendum on the single currency, saying he would \"raise hellfire to get the message across\". The following year he began making large donations to the cross-party Democracy Movement, founded by Lady Annabel Goldsmith as a successor to the Referendum Party. He also donated £500,000 to Denmark's successful anti-euro campaign and £65,000 to the successful Irish No to the Lisbon Treaty campaign."]}, {"page": "Goldsmith (surname)", "response": ["* Lady Annabel Goldsmith (born 1934), English socialite"]}, {"page": "Robin Vane-Tempest-Stewart, 8th Marquess of Londonderry", "response": ["\"Daddy changed, literally overnight, into a complete drunk,\" Lady Annabel Goldsmith, his daughter, recalled. \"It was awful. He would collapse while making speeches to the cricket club, that kind of thing. He was on the bottle night and day.\"Langley, William. 'Profile: Lady Annabel Goldsmith', The Sunday Telegraph, 6 October 2007. Accessed 25 March 2008."]}, {"page": "Ham, London", "response": ["Several notable period houses in Ham cluster around the Common including the Cassel Hospital, Langham House and Ormeley Lodge, which is currently owned by Lady Annabel Goldsmith. Victorian buildings include Latchmere House. Beaufort House in Ham Street, dating from 18C, is Grade II listed and was the home of Lady Juliana Penn from 1795 to her death in 1801. In the grounds of Grey Court School is the Georgian, grade II listed Grey Court House, now called Newman House after Cardinal Newman, who lived there as a child in the early 19th century.", "*Lady Annabel Goldsmith lives in Ormeley Lodge, a Georgian mansion on the edge of Richmond Park where she brought up the three children she had by Sir James Goldsmith: Jemima Khan, writer and campaigner; Zac Goldsmith, life peer and MP for Richmond Park; and Ben Goldsmith, financier and environmentalist."]}, {"page": "Lucy Birley", "response": ["In October 2006, she married Robin Birley, son of Mark Birley and Lady Annabel Goldsmith."]}, {"page": "Patrick Plunket, 7th Baron Plunket", "response": ["Lord Plunket was born into an old Anglo-Irish aristocratic family on his father's side. His mother, Dorothé Mabel Lewis, was the illegitimate daughter of the actress Fannie Ward and The 7th Marquess of Londonderry.Dorothé Lewis's paternity has been revealed by the 7th Marquess's granddaughter Lady Annabel Goldsmith in her memoirs. She specifically discusses the Marquess's reaction to the death of his illegitimate daughter's first husband, and the effective treatment of her boys by Plunket as first cousins. Exact page reference not yet available. Briefly married to Capt. Jack Barnato, who died during World War I, she married as her second husband The 6th Baron Plunket."]}, {"page": "Ben Goldsmith", "response": ["Benjamin James Goldsmith (born 28 October 1980) is an English financier and environmentalist. The son of financier James Goldsmith and Lady Annabel Goldsmith he is founder and CEO of London-listed investment firm Menhaden, which focuses on the theme of energy and resource efficiency. Previously he co-founded the sustainability-focused investment firm WHEB, whose private equity business split away in 2014 and now trades under the name Alpina Partners.  He has used his personal wealth to support both philanthropic and political projects in the area of the environment and sustainability."]}, {"page": "Dominick Elwes", "response": ["* Lady Annabel Goldsmith"]}, {"page": "Amschel Rothschild", "response": ["*Kate Emma Rothschild (born 1982) who married Ben Goldsmith, a son of the late billionaire Sir James Goldsmith and Lady Annabel Goldsmith), in 2003 at St. Mary's Church in Bury St. Edmunds. They have three children. In 2012, the couple announced they were divorcing after it was alleged Kate had an affair with American rapper Jay Electronica."]}, {"page": "Robin Birley (businessman)", "response": ["Robin Marcus Birley (born 19 February 1958) is an English businessman, entrepreneur and political donor. He is the son of Lady Annabel Goldsmith and the night club owner Mark Birley. He had a brother, Rupert, who disappeared and is presumed deceased, and has a sister, India Jane Birley. His half-brother is the former MP, now Lord, Zac Goldsmith."]}, {"page": "Max Rayne", "response": ["Rayne and his wife divorced in 1960 and on 2 June 1965, he married Lady Jane Vane-Tempest-Stewart (a daughter of the 8th Marquess of Londonderry and sister of Lady Annabel Goldsmith) and they had four children:"]}, {"page": "1934 in the United Kingdom", "response": ["* 11 June – Lady Annabel Goldsmith, socialite "]}, {"page": "Ormeley Lodge", "response": ["Ormeley Lodge is a Grade II* listed  early 18th-century Georgian house, set in  on the edge of  Ham Common, near to Richmond Park in Ham, London. It is owned by Lady Annabel Goldsmith.", "Ormeley Lodge was subsequently purchased by Sir James Goldsmith in the mid-1970s, and, with Lady Annabel Goldsmith, it became home for their family of five children, the elder three from Annabel's first marriage; Rupert, Robin and India, Jemima and Zac, and a sixth, Ben, being born after the move."]}, {"page": "Conspiracy theories about the death of Diana, Princess of Wales", "response": ["More revealing was the statement given by Diana's eldest sister, Lady Sarah McCorquodale, who testified that in a phone conversation with Diana on Friday 29 August, Diana spoke about Dodi Fayed in a manner that gave her sister the impression the relationship was on \"stony ground\".Operation Paget Report, page 26 Statements from other friends and confidantes Diana spoke to in the week before her death, including her butler Paul Burrell, her friend Lady Annabel Goldsmith, and her spiritual adviser Rita Rogers, were unanimous that she was firm about not wanting to get engaged or married to anyone at that point in her life. A week before she died, the princess had told Goldsmith: \"I need marriage like a rash on my face.\""]}, {"page": "Jemima Goldsmith", "response": ["On 22 June 2004, it was announced that the couple had divorced ending the nine-year marriage because it was \"difficult for Jemima to adapt to the political life of Imran Khan in Pakistan\". The marriage ended amicably. Khan has said the six months leading to the divorce and the six months after were the hardest year of his life. After the divorce, Goldsmith returned to Britain with the former couple's two sons. According to the divorce settlement, Khan's boys visit him in Pakistan during their school holidays, and when he comes to London to see them he stays with his former mother-in-law, Lady Annabel Goldsmith. According to Jemima Goldsmith, she and Khan remain on good terms. While she was married, she was described as being shy, but also modest, stylish and levelheaded."]}, {"page": "Southover Manor School", "response": ["*Lady Annabel Goldsmith (born 1934)", "*Lady Annabel Goldsmith (born 1934)Annabel Goldsmith, No Invitation Required (2008), Chapter 1: Pelham Cottage"]}]}}