{"wiki_id": "http://www.wikidata.org/entity/Q6470022", "itemLabel": "Lady Catherine de Bourgh", "itemDescription": "character from Pride and Prejudice by Jane Austen", "wikipedia_url": "https://en.wikipedia.org/wiki/Lady_Catherine_de_Bourgh", "wikipedia_page": {"main": "Lady Catherine de Bourgh (née Fitzwilliam) is a character in the 1813 novel Pride and Prejudice by Jane Austen. According to Janet Todd, Lady Catherine can be seen as a foil to the novel's protagonist Elizabeth Bennet.", "link_mentions": [{"page": "Pride and Prejudice", "response": ["In the spring, Elizabeth visits Charlotte and Mr. Collins in Kent. Elizabeth and her hosts are invited to Rosings Park, the imposing home of Lady Catherine de Bourgh, imperious patroness of Mr. Collins and Mr. Darcy's wealthy aunt. Lady Catherine expects Mr. Darcy to marry her daughter, as planned in his childhood by his aunt and mother. Mr. Darcy and his cousin, Colonel Fitzwilliam, are also visiting at Rosings Park. Fitzwilliam tells Elizabeth how Mr. Darcy recently saved a friend, presumably Bingley, from an undesirable match. Elizabeth realises that the prevented engagement was to Jane and is horrified that Mr. Darcy interfered. Later, Mr. Darcy proposes to Elizabeth, declaring his love for her despite her low social connections. She rejects him angrily, firmly stating that he is the last person she would ever marry and saying she could never love a man who caused her sister such unhappiness; she further accuses him of treating Wickham unjustly. Mr. Darcy brags about his success in separating Bingley and Jane and suggests that he had been kinder to Bingley than to himself. He dismisses the accusation regarding Wickham sarcastically but does not address it.", "* Mr William Collins – Mr Collins is Mr Bennet's distant second cousin, a clergyman, and the current heir presumptive to his estate of Longbourn House. He is an obsequious and pompous man, prone to making long and tedious speeches, who is excessively devoted to his patroness, Lady Catherine de Bourgh.", "* Lady Catherine de Bourgh – the overbearing aunt of Mr Darcy. Lady Catherine is the wealthy owner of Rosings Park, where she resides with her daughter Anne and is fawned upon by her rector, Mr Collins. She is haughty, pompous, domineering, and condescending, and has long planned to marry off her sickly daughter to Darcy, to 'unite their two great estates', claiming it to be the dearest wish of both her and her late sister, Lady Anne Darcy (née Fitzwilliam).", "* Colonel Fitzwilliam – Colonel Fitzwilliam is the younger son of an earl and the nephew of Lady Catherine de Bourgh and Lady Anne Darcy; this makes him the cousin of Anne de Bourgh and the Darcy siblings, Fitzwilliam and Georgiana. He is about 30 years old at the beginning of the novel. He is the co-guardian of Miss Georgiana Darcy, along with his cousin, Mr Darcy.  According to Colonel Fitzwilliam, as a younger son, he cannot marry without thought to his prospective bride's dowry; Elizabeth Bennet joked that, as the son of an Earl, Colonel Fitzwilliam wouldn't be able to settle for a bride with a dowry lower than £50,000 (which suggests that Colonel Fitzwilliam's living allowance is about £2,000 to £2,500 per-year).", "An undercurrent of the old Anglo-Norman upper class is hinted at in the story, as suggested by the names of Fitzwilliam Darcy and his aunt, Lady Catherine de Bourgh; Fitzwilliam, D'Arcy, de Bourgh (Burke), and even Bennet, are traditional Norman surnames."]}, {"page": "Judi Dench", "response": ["A major hit for Dench came with Joe Wright's Pride & Prejudice, a 2005 adaptation of the novel by Jane Austen, starring Keira Knightley and Donald Sutherland. Wright persuaded Dench to join the cast as Lady Catherine de Bourgh by writing her a letter that read: \"I love it when you play a bitch. Please come and be a bitch for me.\" Dench had only one week available to shoot her scenes, forcing Wright to make them his first days of filming. With both a worldwide gross of over US$121 million and several Academy Award and Golden Globe nominations, the film became a critical and commercial success."]}, {"page": "Pride and Prejudice (1995 TV series)", "response": ["Episode 3: Elizabeth is stunned and appalled to learn that Charlotte Lucas has accepted Mr Collins' marriage proposal. When the Netherfield party departs for London in autumn, Jane stays with her modest London relatives, the Gardiners, but she soon notices that the Bingleys ignore her. After befriending Mr Wickham, Elizabeth departs for the Collins' home in Kent in the spring to visit Charlotte. They live near Rosings, the estate of the formidable Lady Catherine de Bourgh, Darcy's aunt. Elizabeth meets Darcy several times. Elizabeth learns of Darcy's direct responsibility for Jane and Bingley's separation. Soon after, Darcy unexpectedly tells her that he admires her and loves her, so much that in spite of her greatly inferior social standing, he proposes marriage. Elizabeth flatly rejects him, noting his arrogant, disagreeable, and proud character, and for his part in her sister's failed romance and Mr Wickham's misfortune.", "Episode 6: After Lydia carelessly mentions Darcy's involvement in her wedding, Mrs Gardiner enlightens Elizabeth: Darcy found the errant couple and paid for everything, including a large payoff to Wickham. When Bingley and Darcy return to Netherfield in the autumn, Darcy apologises to Bingley for interfering in his relationship with Jane and gives his blessing for the couple to wed. Lady Catherine de Bourgh, who intends for Darcy to marry her sickly daughter, Anne, has heard rumours of an engagement between Darcy and Elizabeth. She calls on Elizabeth, demanding that she deny the engagement and renounce Darcy forever. Elizabeth verifies there is no engagement, but refuses any pledge for the future. When Elizabeth thanks Darcy for his role in Lydia's marriage, Lady Catherine's story had encouraged Darcy to reconfirm his feelings for Elizabeth. Elizabeth admits the complete transformation of her feelings and agrees to an engagement, taking her family by surprise. The series ends with a double winter wedding: Jane to Bingley, and Elizabeth to Darcy.", "* Barbara Leigh-Hunt as Lady Catherine de Bourgh", "The producers found Crispin Bonham-Carter to have the best physical contrast to Firth's Darcy and gave him his first major television role as the good-natured and wealthy Mr Charles Bingley. Bonham-Carter had originally auditioned for the part of Mr George Wickham, a handsome militia lieutenant whose charm conceals his licentiousness and greed, but Adrian Lukis was cast instead. Anna Chancellor, of Four Weddings and a Funeral fame, played Mr Bingley's sister Caroline Bingley. (Chancellor is also Jane Austen's six-times-great-niece) Mr Bingley's other sister and his brother-in-law were played by Lucy Robinson (Louisa Hurst) and Rupert Vansittart (Mr Hurst). Casting the role of Darcy's young sister, Georgiana, proved hard as the producers were looking for a young actress who appeared innocent, proud and yet shy, had class and could also play the piano. After auditioning over 70 actresses, Simon Langton suggested Emilia Fox, the real-life daughter of Joanna David (Mrs Gardiner), for the part. Barbara Leigh-Hunt was cast as Darcy's meddling aunt, Lady Catherine de Bourgh, without auditions or screen tests.", "The producers found Belton House in Grantham, Lincolnshire the best match for Rosings, Lady Catherine de Bourgh's estate, which needed to appear \"over-the-top\" to reflect her disagreeableness. Old Rectory at Teigh in Rutland was chosen as Hunsford parsonage, Mr Collins's modest home. Edgcote House in south-west Northamptonshire served as the interior and exterior of Bingley's Netherfield, along with Brocket Hall in Welwyn Garden City, Hertfordshire as the Netherfield ballroom. The London streets were filmed in Lord Leycester Hospital in Warwick, Warwickshire. Wickham's and Georgiana's planned elopement in Ramsgate was filmed in the English seaside resort Weston-super-Mare in Somerset. Wickham's wedding takes place in St Paul's in Deptford, London.", "Because Pride and Prejudice was a period drama, the design required more research than contemporary films. The personality and wealth of the characters were reflected in their costumes; the wealthy Bingley sisters were never shown in print dresses and they wore big feathers in their hair. As the BBC's stock of early 19th century costumes was limited, costume designer Dinah Collin designed most of the costumes, visiting museums for inspiration while trying to make the clothes attractive to a modern audience (although some costumes, mostly worn by extras, were re-used from earlier BBC productions or hired). Elizabeth's clothes had earthy tones and were fitted to allow easy and natural movements in line with the character's activity and liveliness. In contrast, Collin chose pale or creamy white colours for the clothes of the other Bennet girls to highlight their innocence and simplicity and richer colours for Bingley's sisters and Lady Catherine de Bourgh. Colin Firth participated in the wardrobe decisions and wanted his character to wear darker colours, leaving the warmer colours for Bingley.Birtwistle and Conklin 1995, pp. 47–60."]}, {"page": "Lena Headey", "response": ["In the historical action comedy Pride and Prejudice and Zombies, Headey appeared as Lady Catherine de Bourgh, with her former Game of Thrones, Century and The Contractor co-star Charles Dance. Andrew Barker, of Variety, found her to be \"excessively diverting\" in what he considered a \"tolerable, but not handsome enough\" film. In 2017, Headey appeared as a \"predictably hard-boiled boss\" in the crime thriller Thumper, which premiered at the Tribeca Film Festival, and provided the voiceover for Mercedes A-Class television advertisement and Morgana in Trollhunters."]}, {"page": "Pride & Prejudice (2005 film)", "response": ["Months later, Elizabeth visits Charlotte and Mr. Collins, who reside on Lady Catherine de Bourgh's estate. Elizabeth unexpectedly meets Darcy, who is Lady Catherine's nephew, and is visiting with his cousin, Colonel Fitzwilliam. Unaware that Jane is Elizabeth's sister, Fitzwilliam mentions that Darcy recently untangled Bingley from an imprudent match with an \"unsuitable\" family.", "Donald Sutherland reminded Wright of his own father and was cast as the Bennet patriarch; Wright thought the actor possessed the \"strength to handle those six women\". Brenda Blethyn was hired to play Mrs Bennet, whom Moggach believed to be the unsung heroine of the film; Wright explained that it was \"a tricky part [to fill], as she can be very annoying; you want to stop her chattering and shrieking. But Brenda has the humour and the heart to show the amount of love and care Mrs Bennet has for her daughters.\" Wright convinced veteran actress Judi Dench to join the cast as Lady Catherine de Bourgh by writing her a letter that read \"I love it when you play a bitch. Please come and be a bitch for me.\" Dench had only one week available to shoot her scenes, forcing Wright to make them his first days of filming."]}, {"page": "Elizabeth Bennet", "response": ["Her father is a landowner, but his daughters cannot inherit because the estate is entailed upon the male line (it can only be inherited by male relatives). Upon Mr Bennet's death, Longbourn will therefore be inherited by his cousin and nearest male relation, Mr William Collins, a clergyman for the Rosings Estate in Kent owned by Lady Catherine de Bourgh. This future provides the cause of Mrs Bennet's eagerness to marry her daughters off to wealthy men.", "After seeing Pemberley, Elizabeth realizes Darcy's good character, and as a chance to become part of society without compromising her values.Duckworth, Alistair \"Social moderation and the middle wary\", pp. 42-51 (46–47), in Readings on Pride and Prejudice, ed. Clarice Swisher, San Diego: Greenhaven Press, 1999. At Pemberley, Elizabeth sees the \"whole scene\" from one viewpoint and then sees the \"objects were taking different positions\" from another viewpoint while remaining beautiful, which is a metaphor for her subjectivity had influenced her view of the world.Duckworth, Alistair \"Social moderation and the middle wary\", pp. 42–51 (48–49) in Readings on Pride and Prejudice, ed. Clarice Swisher, San Diego: Greenhaven Press, 1999. Like other Austen heroines, Elizabeth likes to escape into the gardens and nature in general when under pressure.Sulloway, Alison \"The Significance of Gardens and Pastoral Scenes\", pp. 119–127 (120–21), in Readings on Pride and Prejudice, ed. Clarice Swisher, San Diego: Greenhaven Press, 1999. For Austen, gardens were not only places of reflection and relaxation, but also symbols of femininity and of England.Sulloway, Alison \"The Significance of Gardens and Pastoral Scenes\", pp. 119–127 (119–20), in Readings on Pride and Prejudice, ed. Clarice Swisher, San Diego: Greenhaven Press, 1999. The American scholar Alison Sulloway wrote: \"Austen had seen and suffered enough causal exploitation so that she took the pastoral world under her tender but unobtrusive fictional protection, just as she felt protective towards human figures under the threat of abuse or neglect\".Sulloway, Alison \"The Significance of Gardens and Pastoral Scenes\", pp. 119-127 (120), in Readings on Pride and Prejudice ed. by Clarice Swisher, San Diego: Greenhaven Press, 1999. Beyond that, Napoleon had often talked of desire to make England's fair gardens and fields his own, speaking if England \"...was a mere woman, ripe for his exploitation\", so for Austen, the beauty of the English countryside served as a symbol of the England her brothers serving in the Royal Navy were fighting to protect. Elizabeth's connection with nature leads to appreciate the beauty of Pemberley, which allows hers to see the good in Darcy.Sulloway, Alison \"The Significance of Gardens and Pastoral Scenes\", pp. 119–127 (125), in Readings on Pride and Prejudice, ed. Clarice Swisher, San Diego: Greenhaven Press, 1999. Notably, Elizabeth is not guided by financial considerations, and refuses to seek favour with the wealthy aristocrat Lady Catherine de Bourgh.Ross, Josephine Jane Austen A Companion, New Brunswick: Rutgers University Press, 2002, p. 200. Despite Mr Darcy's wealth, Elizabeth turns down his first marriage proposal and only accepts him after she realises that she loves him.Ross, Josephine Jane Austen A Companion, London: John Murray, 2002, pp. 199–200. Johnson wrote that given the values of Regency England that it was inevitable and expected that a young woman should be married, but Elizabeth makes it clear that what she wants to marry a man she loves, not just to be married to somebody, which was a quietly subversive message for the time.Johnson, Claudia Jane Austen, Chicago: University of Chicago Press, 1988, pp. 89-90."]}, {"page": "Pride and Prejudice (1940 film)", "response": ["Elizabeth visits Charlotte in her new home. She is introduced to Lady Catherine de Bourgh (Edna May Oliver), Mr. Collins' \"patroness\", and during her visit she also encounters Mr. Darcy once again. At Charlotte's insistence, Elizabeth sees Darcy who asks her to marry him, but she refuses, partly because of the story Wickham had told her about Darcy, partly because he broke up the romance between Mr. Bingley and Jane, and partly because of his \"character\". They get into a heated argument and he leaves.", "* Edna May Oliver as Lady Catherine de Bourgh", "The Motion Picture Production Code prompted some changes in the film as well. Because Mr. Collins, a ridiculous clergyman in the novel, could not seem to criticize men of the cloth, the character was changed to a librarian. Some scenes were altered significantly. For example, Mr. Wickham was introduced at the beginning of the movie. The archery scene was a figment of the filmmakers’ imagination. In the confrontation between Lady Catherine de Bourgh and Elizabeth Bennet, near the film's end, the former's haughty demand that Elizabeth promise never to marry Darcy was changed to a hoax to test the mettle and sincerity of Elizabeth's love. (In the novel, the confrontation is an authentic demand, motivated by Lady Catherine's snobbery and her ardent desire that Darcy marry her own daughter.)"]}, {"page": "Pride and Prejudice (1980 TV series)", "response": ["* Judy Parfitt as Lady Catherine de Bourgh"]}, {"page": "Mr. Darcy", "response": ["Mr. Darcy is a proud and arrogant man, particularly to those that he considers of lower social status. It is suggested that he is  a member of the old Anglo-Norman aristocracy, as indicated by his own name as well as that of his aunt, Lady Catherine de Bourgh.Doody, Margaret (14 April 2015). Jane Austen's Names: Riddles, Persons, Places. University of Chicago Press. p. 72. . Retrieved 27 January 2018. At the dance, he does not dance with any ladies outside of his own party because he believes them to be beneath him in class and beauty. He does, however, mention later on to Elizabeth that he does not find it easy to make new acquaintances and finds it hard to converse with people he does not know. This shows a sort of shy, perhaps even reclusive nature in Darcy that is not illustrated before this point in the book. After receiving Mr. Darcy's letter of explanation, Elizabeth notes: that she has never \"seen anything that betrayed him to be unprincipled or unjust—anything that spoke him of irreligious or immoral habits; that among his own connections he was esteemed and valued\". For example, his behaviour with Bingley is more than brotherly as he rescues him from a bad marriage and is a constant companion at his side. Through Elizabeth, he learns to be less boastful and arrogant because he realizes that his actions have deeply affected others. This arrogance is seen in his first proposal to Elizabeth whereby he acts with more pride rather than in a loving manner. Despite the way in which Elizabeth often mocks him, she is surprised by his \"gallantry\" as he persists in pursuing her.Brower, Reuben Arthur \"Irony Reveals Character and Advances the Drama\" page 144-152 from Readings on Pride and Prejudice edited by Clarice Swisher, San Diego: Greenhaven Press, 1999 page 149."]}, {"page": "Barbara Leigh-Hunt", "response": ["Leigh-Hunt played Jean Lawrence in the controversial BBC drama Tumbledown (1988), and Lady Catherine de Bourgh in Pride and Prejudice (1995), and provided the voices of the farmer's wife in The Plague Dogs (1982), and Captain Mildred and Mary the Hover Fairy in the 1987 Children's BBC series Charlie Chalk. In 1999, Leigh starred as Lady Cumnor in BBC's four-part series adaptation of the novel Wives and Daughters (1999). More recently she has appeared in such films as Paper Mask (1990), Keep the Aspidistra Flying (1997), Billy Elliot (2000), The Martins (2001) and Vanity Fair (2004), and has had much work on television, mainly in guest character parts.", "*Pride and Prejudice (1995) - Lady Catherine de Bourgh"]}, {"page": "These Three Remain", "response": ["The novel is set in the later chapters of Pride and Prejudice. After a series of unpleasant experiences while visiting Norwycke Castle (as depicted in the previous novel in the sequence) Fitzwilliam Darcy accompanies his cousin, Colonel Richard Fitzwilliam, to the home of their aunt, Lady Catherine de Bourgh. Although not looking forward to spending time with his self-impressed aunt, Darcy has resolved to use the time to forget what he views as his unacceptable desire for Elizabeth Bennet. Much to his surprise and chagrin, however, she is also in the area visiting her cousin, the pompous clergyman Mr Collins and his new wife (and her close friend) Charlotte, who are frequent visitors to Lady Catherine. Darcy is therefore thrown daily into Elizabeth's company, and finds himself unable to further resist her charms. Driven to jealousy by the developing friendship between Elizabeth and Colonel Fitzwilliam, Darcy finally accepts the strength of his love for her and, after weighing the consideration of her lowly social standing and its possible effect on his future status, decides  to propose marriage to her."]}, {"page": "Jane Austen in popular culture", "response": ["The largest market for Austen's books are in India and Pakistan, where the themes of \"marrying off\" young women to rid families of the burdens of supporting them, the importance of the family as a social unit, dowries as a factor in marriage negotiations and inheritance laws that favor males all address issues that are relevant in both India and Pakistan. Both India and Pakistan have large Austen societies with the Pakistani Austen Society hosting events for \"Jovial Janeites\"  that feature \"Austentatious tea parties\" and \"chai and chatter\". Laaleen Sukhera, the founder of the Jane Austen Society of Pakistan, told The Economist that Austen is relevant in the Indian subcontinent because society in South Asia is full of \"disapproving Lady Catherine de Bourgh-esque society aunties, rakish Wickhams and Willoughbys, pretentious Mrs Eltons and holier-than thou Mr Collins types\". Bloomsbury published Austenistan, edited by Laaleen Sukhera, in 2018.  \"Inspired by Jane Austen and set in contemporary Pakistan, Austenistan is a collection of seven stories; romantic, uplifting, witty, and heartbreaking by turn, which pay homage to the world's favourite author in their own uniquely local way. Heiress Kamila Mughal is humiliated when her brother's best friend snubs her to marry a social climbing nobody from Islamabad. Roya discovers her fiancé has been cheating on her and ends up on a blind date on her wedding day. Beautiful young widow Begum Saira Qadir has mourned her husband, but is she finally ready to start following her own desires?\" Austenistan's contributors are Nida Elley, Saniyya Gauhar, Mahlia S. Lone, Mishayl Naek, Sonya Rehman, Laaleen Sukhera, and Gayathri Warnasuriya."]}, {"page": "Lost in Austen", "response": ["Wickham encourages Amanda to visit Jane, and, though at first reluctant, Jane gratefully accepts Amanda's apology and offer to renew their friendship. Mr Collins refuses to allow Amanda to dinner at Rosings, the home of his patroness Lady Catherine de Bourgh, but Amanda claims to have a message from Wickham's fictional nobles. Lady Catherine, not wanting to appear ignorant and unconnected, goes along with the ploy, pretending to know the nobles, and allowing Amanda to dine with them.", "* Lindsay Duncan as Lady Catherine de Bourgh"]}, {"page": "De Burgh", "response": ["* Lady Catherine de Bourgh (character from Jane Austen's novel, Pride and Prejudice.  "]}, {"page": "Lady Catherine De Bourgh", "response": ["#REDIRECT Lady Catherine de Bourgh"]}, {"page": "Mr William Collins", "response": ["Austen writes that before his entry into the novel, his circumstances in early life, and the 'subjection' in which his father had brought him up, had \"originally given him great humility of manner\".  However, this characteristic has been \"now a good deal counteracted by the self-conceit of a weak head, living in retirement\", altered greatly and been replaced with arrogance and vanity due to \"early and unexpected prosperity\". This early prosperity came, by chance, at the hands of Lady Catherine de Bourgh, when a vacancy arose for the living of the Hunsford parish, \"and the respect which he felt for her high rank and his veneration for her as his patroness, mingling with a very good opinion of himself, of his authority as a clergyman, and his rights as a rector, made him altogether a mixture of pride and obsequiousness, self-importance and humility\".  He has a ridiculously high regard for Lady Catherine de Bourgh and her daughter, of whom he is \"eloquent in their praise\"."]}, {"page": "Phyllis Neilson-Terry", "response": ["* Pride and Prejudice (1958, TV series) as Lady Catherine de Bourgh"]}, {"page": "The Lizzie Bennet Diaries", "response": ["*Catherine de Bourgh (Lady Catherine de Bourgh in the novel) is Darcy's aunt and an extremely wealthy venture capitalist who is the primary investor in Collins & Collins, the new media firm run by Mr. Collins, where Charlotte accepts a job offer after Lizzie rejected it. Catherine is very attached to her sickly dog who she calls Annie Kins. She is quick with her opinions and judgements. Charlotte said that Catherine is \"on Team Caroline,\" meaning that she wants her nephew to be with Caroline. She is impersonated by Lizzie, and Ashley Clements says her impression is a combination of Julia Child, Miranda Priestly and Dolores Umbridge."]}, {"page": "Lady Catherine De Bourgh (character)", "response": ["#REDIRECT Lady Catherine de Bourgh "]}, {"page": "Bennet family", "response": ["Mr. Gardiner and Mrs. Philips contribute significantly to the progress and outcome of the story, but at a level and in a different register reflecting their respective social belonging. Collins's character serves as a link between the gentry of Hertfordshire, to which the Bennets belong, and the large property owners Lady Catherine de Bourgh and Mr. Darcy who later married Elizabeth."]}, {"page": "Death Comes to Pemberley (TV series)", "response": ["* Penelope Keith as Lady Catherine de Bourgh"]}, {"page": "Pride and Prejudice (1967 TV series)", "response": ["* Sylvia Coleridge as Lady Catherine de Bourgh"]}, {"page": "Lady Catherine de Bourgh (character)", "response": ["#REDIRECT Lady Catherine de Bourgh"]}]}}