{"wiki_id": "http://www.wikidata.org/entity/Q6470403", "itemLabel": "Lady Margaret Sackville", "itemDescription": "British poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Lady_Margaret_Sackville", "wikipedia_page": {"main": "Lady Margaret Sackville (24 December 1881 – 18 April 1963) was an English poet and children's author.\nBorn at 60 Grosvenor Street, Mayfair, Sackville was the youngest child of Reginald Windsor Sackville, 7th Earl De La Warr. She was a second cousin of Vita Sackville-West.", "link_mentions": [{"page": "Ramsay MacDonald", "response": ["Ramsay MacDonald married Margaret Ethel Gladstone (no relation to Prime Minister William Gladstone) in 1896. The marriage was a very happy one, and they had six children, including Malcolm MacDonald (1901–81), who had a distinguished career as a politician, colonial governor and diplomat, and Ishbel MacDonald (1903–82), who was very close to her father. Another son, Alister Gladstone MacDonald (1898–1993) was a conscientious objector in the First World War, serving in the Friends' Ambulance Unit; he became a prominent architect who worked on promoting the planning policies of his father's government, and specialised in cinema design. MacDonald was devastated by Margaret's death from blood poisoning in 1911, and had few significant personal relationships after that time, apart from with Ishbel, who acted as his consort while he was Prime Minister and cared for him for the rest of his life. Following his wife's death, MacDonald commenced a relationship with Lady Margaret Sackville."]}, {"page": "Earl De La Warr", "response": ["Notable 20th-century descendants of George Sackville-West, 5th Earl De La Warr include the authors Lady Margaret Sackville, Vita Sackville-West, Nigel Nicolson and Adam Nicolson."]}, {"page": "Poems of Today", "response": ["A. E. - Herbert Asquith - Maurice Baring - Hilaire Belloc - Laurence Binyon - Edmund Blunden - F. S. Boas - Eva Gore-Booth - Gordon Bottomley - F. W. Bourdillon - Robert Bridges - Rupert Brooke - T. E. Brown - A. H. Bullen - E. K. Chambers - G. K. Chesterton - Padraic Colum - The Marquess of Crewe - Walter De la Mare - Geoffrey Dearmer - John Drinkwater - V. L. Edminson - Michael Field - J. E. Flecker - John Freeman - Margaret C. Furse - John Galsworthy - Wilfred Wilson Gibson - Julian Grenfell - Thomas Hardy - F. W. Harvey - Ralph Hodgson - W. N. Hodgson - A. E. Housman - Aldous Huxley - Violet Jacob - Francis Ledwidge - Winifred M. Letts - Sidney Royse Lysaght - Rose Macaulay - Alasdair MacGregor - E. A. Mackintosh - John Masefield - Beatrice Mayor - Charlotte Mew - Alice Meynell - Harold Monro - T. Sturge Moore - F. W. Moorman - Gilbert Murray - Sir Henry Newbolt - Robert Nichols - Madeleine Nightingale - Moira O'Neill - Seamus O'Sullivan - Joseph M. Plunkett - Madeleine Caron Rock - Lady Margaret Sackville - Siegfried Sassoon - Edward Shanks - Charles Hamilton Sorley - Sir Cecil Spring Rice - James Stephens - Edward Wyndham Tennant - Edward Thomas - Francis Thompson - Herbert Trench - W. J. Turner - Evelyn Underhill - Lucy Whitmell - T. P. Cameron Wilson - W. B. Yeats"]}, {"page": "Thomas Moult", "response": ["A. E. - Conrad Aiken - Margaret Emerson Bailey - T. O. Beachcroft - William Rose Benét - Anthony Bertram - Edmund Blunden - Kay Boyle - Nancy Campbell - Thomas Caldecott Chubb - Elizabeth Coatsworth - Robert P. Tristram Coffin - Jane Culver - W. H. Davies - John Gould Fletcher - John Galsworthy - Viola Gerard Garvin - Stella Gibbons - Wilfrid Gibson - G. Rostrevor Hamilton - Ernest Hartsock - F. R. Higgins - John Lee Higgins - Robert Hillyer - Thomas Hornsby Ferril - Helen Hoyt - Julian Huxley - Leslie Nelson Jennings - Geoffrey Johnson - Frank Kendon - Stanley Kimmel - Alfred Kreymborg - Ruth Lechlitner - Marie Luhrs - Sylvia Lynd - Alister Mackenzie - E. H. W. Meyerstein - Harold Monro - Virginia Moore - David Morton - Edwin Muir - Robert Nichols - Jessica Nelson North - Alfred Noyes - Doris Pailthorpe - Herbert E. Palmer - Dorothy Parker - Laurence Powys - Frederic Prokosch - Lizette Woodworth Reese - Sarah-Elizabeth Rodger - Robert L. Roe - James Rorty - A. Wolseley Russell - Lady Margaret Sackville - Anderson M. Scruggs - Leonora Speyer - J. C. Squire - L. Steni - L. A. G. Strong - Sara Teasdale - Katharine Tynan - A. R. Ubsdell - Marie de L. Welch - John Hall Wheelock - Mary Brent Whiteside - Humbert Wolfe - Barbara Young"]}, {"page": "Oxford period poetry anthologies", "response": ["Lascelles Abercrombie – Percy Addleshaw – Douglas Ainslie – Thomas Bailie Aldrich – William Alexander – William Allingham – Sir Edwin Arnold – Matthew Arnold – Thomas Ashe – Alfred Austin – William Edmonstoune Aytoun – Philip James Bailey – Richard Harris Barham – Maurice Baring – George Barlow – Jane Barlow – William Barnes – Benjamin Disraeli, 1st Earl of Beaconsfield – Thomas Lovell Beddoes – Henry Charles Beeching – Charles Dent Bell – Hilaire Belloc – Arthur Christopher Benson – Laurence Binyon – John Stuart Blackie – Richard Doddridge Blackmore – Mathilde Blind – Wilfrid Scawen Blunt – George Henry Boker – Gordon Bottomley – Francis William Bourdillon – Robert Bridges – Emily Brontë – Rupert Brooke – Robert Barnabas Brough – Oliver Madox Brown – Thomas Edward Brown – Elizabeth Barrett Browning – Robert Browning – William Cullen Bryant – Robert Buchanan – Arthur Gray Butler – Wathen Mark Wilks Call – Thomas Carlyle – Bliss Carman – John Clare – Caroline Clive – Arthur Hugh Clough – Hartley Coleridge – Mary E. Coleridge – Sara Coleridge – Mortimer Collins – Frances Cornford – William Cory – Frances Burdett Money Coutts – Dinah Maria Craik – Walter Crane – Marquess of Crewe – Arthur Shearly Cripps – Henry Cust – George Darley – John Davidson – William H. Davies – Thomas Osborne Davis – William James Dawson – Walter De la Mare – Lord De Tabley – Sir Aubrey De Vere – Aubrey De Vere – Emily Dickinson – Richard Watson Dixon – Bertram Dobell – Sydney Dobell – Austin Dobson – Alfred Domett – Lord Alfred Douglas – Edward Dowden – Ernest Dowson – Sir Francis Hastings Doyle – John Drinkwater – Agnes Mary Frances Duclaux – Helen, Lady Dufferin – George Louis Palmella Busson du Maurier – Matilda Betham Edwards – George Eliot – Ebenezer Elliott – Henry Ellison – Ralph Waldo Emerson – Frederick William Faber – Sir Samuel Ferguson – Michale Field – Edward Fitzgerald – James Elroy Flecker – Alice Furlong – Norman Gale – Richard Garnett – Wilfrid Wilson Gibson – Adam Lindsay Gordon – Edmund Gosse – Charles Granville – David Gray – Dora Greenwell – Gerald Griffin – Louise Imogen Guiney – Fitz-Greene Halleck – Thomas Hardy – Bret Harte – Robert Stephen Hawker – William Ernest Henley – Maurice Hewlett – Emily Henrietta Hickey – Katharine Tynan Hinkson – Oliver Wendell Holmes – Thomas Hood – George Hookham – Gerard Manley Hopkins – Richard Henry Horne – Lord Houghton – Laurence Housman – Julia Ward Howe – William Dean Howells – Leigh Hunt – Douglas Hyde – Jean Ingelow – Lionel Johnson – Ebenezer Jones – Ernest Charles Jones – James Joyce – John Keble – Frances Anne Kemble – Henry Clarence Kendall – John Kenyon – Charles Kingsley – Henry Kingsley – Rudyard Kipling – Walter Savage Landor – Andrew Lang – Emily Lawless – Eugene Lee-Hamilton – Edward Cracroft Lefroy – Richard Le Gallienne – Amy Levy – William James Linton – Frederick Locker-Lampson – John Gibson Lockhart – Henry Wadsworth Longfellow – James Russell Lowell – Henry Dawson Lowry – Sir Alfred Comyn Lyall – Thomas Toke Lynch – Sidney Royse Lysaght – Earl of Lytton – Lord Lytton – Lord Macaulay – Denis Florence MacCarthy – George MacDonald – Charles Mackay – H. C. Compton Mackenzie – Francis Mahony – James Clarence Mangan – Philip Bourke Marston – Theophile Marzials – John Masefield – Gerald Massey – Annie Matheson – George Meredith – Herman Charles Merivale – Alice Meynell – Richard Middleton – William Cosmo Monkhouse – Harold Monro – Mary Montgomerie – T. Sturge Moore – Sir Lewis Morris – William Morris – Neil Munro – Ernest Myers – Frederic William Henry Myers – John Mason Neale – Henry Newbolt – John Henry Newman – John Nicol – Roden Berkeley Wriothesley Noel – Caroline Elizabeth Sarah Norton – Alfred Noyes – Moira O'Neill – John Boyle O'Reilly – Arthur William Edgar O'Shaughnessy – Francis Turner Palgrave – Sir Gilbert Parker – Fanny Parnell – Coventry Patmore – John Payne – John Swinnerton Phillimore – Stephen Phillips – Eden Phillpotts – William Philpot – Edgar Allan Poe – Walter Herries Pollock – Ezra Pound – Winthrop Mackworth Praed – May Probyn – Adelaide Anne Procter – Bryan Waller Procter – Sir Arthur Quiller-Couch – Ernest Radford – William Brighty Rands – Hardwick Drummond Rawnsley – Ernest Rhys – James Logie Robertson – Sir James Rennell Rodd – Samuel Rogers – T. W. Rolleston – William Caldwell Roscoe – William Stanley Roscoe – Christina Georgina Rossetti – Dante Gabriel Rossetti – Earl of Rosslyn – John Ruskin – George William Russell – Lady Margaret Sackville – George Santayana – William Bell Scott – John Campbell Shairp – William Sharp – Dora Sigerson Shorter – Joseph Skipsey – Douglas Brook Wheelton Sladen – Menella Bute Smedley – Alexander Smith – Walter C. Smith – James Stephens – Robert Louis Stevenson – Charles Swain – Elinor Sweetman – Algernon Charles Swinburne – John Addington Symonds – Arthur Symons – John M. Synge – Sir Henry Taylor – Rachel Annand Taylor – Frederick Tennyson – Lord Tennyson – William Makepeace Thackeray – Francis Thompson – Edward William Thomson – James Thomson (B.V.) – Henry David Thoreau – Wilfrid Thorley – Walter Thornbury – John Todhunter – Archbishop Trench – Herbert Trench – Charles Tennyson Turner – Samuel Waddington – Thomas Wade – Edward Walsh – Thomas Herbert Warren – Rosamund Marriott Watson – William Watson – Theodore Watts-Dunton – Augusta Webster – Thomas Westwood – Charles Whitehead – Walt Whitman – John Greenleaf Whittier – Oscar Wilde – Sarah Williams – Nathaniel Parker Lewis – Margaret L. Woods – Thomas Woolner – William Butler Yeats"]}, {"page": "Margaret Sackville", "response": ["#REDIRECT Lady Margaret Sackville"]}, {"page": "1900 in poetry", "response": ["* Lady Margaret Sackville, Floral Symphony"]}, {"page": "1963 in poetry", "response": ["* April 18 – Lady Margaret Sackville, 81, English poet and children's author"]}, {"page": "1939 in poetry", "response": ["* Lady Margaret Sackville, Collected Poems"]}, {"page": "1916 in poetry", "response": ["* Lady Margaret Sackville, The Pageant of War"]}, {"page": "1910 in poetry", "response": ["* Lady Margaret Sackville, editor, A Book of Verse by Living Women"]}, {"page": "1901 in poetry", "response": ["* Lady Margaret Sackville, Poems"]}, {"page": "1881 in poetry", "response": ["* December 24 – Lady Margaret Sackville (died 1963), English poet and children's author"]}, {"page": "British nobility", "response": ["File:Lady Margaret Sackville.jpg|Lady Margaret Sackville"]}, {"page": "The Englishwoman's Review", "response": ["*Lady Margaret Sackville"]}, {"page": "Eva Dobell", "response": ["After the war, she continued to write; in all, she published half a dozen books of poetry, a verse drama, and edited a book of poems by Lady Margaret Sackville.", "*Margaret Sackville. A Poet's Return: Some Later Poems of Lady Margaret Sackville. Cheltenham: Burrow's Press, 1940."]}, {"page": "Regent Terrace", "response": ["The painter Sir George Harvey lived at 21 Regent Terrace from 1854 to 1876. Sir George was one of the founders of the Royal Scottish Academy, was elected president in 1864 and was knighted in 1867.  The influential Scottish minister and author the Reverend Dr. Maxwell Nicholson lived at 3 Regent Terrace for most of his later life until 1874. The architect Duncan Menzies lived at 31 Regent Terrace from about 1891-1910.Sir James Puckering Gibson 1st Baronet of Regent Terrace was Lord Provost of Edinburgh from 1906 to 1909 and represented Edinburgh East in the House of Commons as a Liberal between 1909 and 1912.  He lived at 33 Regent Terrace from 1880 and was created in the Baronetage of the United Kingdom on 23 November 1909.The Baronetage of England, Ireland, Nova Scotia, Great Britain and the United Kingdom, Leigh Rayment  Accessed 2009-09-07  Sir James had no children so when he died in 1812 his title became extinct. Professor Sir Thomas Hudson Beare was Professor of Engineering Heriot-Watt University, Edinburgh, and University College, London.  He was also  Regius Professor of Engineering in Edinburgh University and lived at 10 Regent Terrace from 1901. The architect William Gordon Dey was born at 9 Regent Terrace in 1911 and went to the Royal High School which was close by.  A Regius Professor of English at Edinburgh University Sir H. J. C. Grierson lived at 12 Regent Terrace from 1913-1933. His daughter Janet (married name Janet Teissier du Cros) was an author who later wrote Divided Loyalties about her years as a Scottish woman in the Cevennes in occupied France during the war when the French resistance was active.  The painter Francis Cadell, one of the Scottish Colourists, lived in 30 Regent Terrace from 1930-1935.Painting \"30 Regent Terrace\"  by Frances Cadell (1934) Accessed 2009-08-06  Lady Margaret Sackville, daughter of Reginald Windsor Sackville, 7th Earl De La Warr, and second cousin of Vita Sackville-West lived at 30 Regent Terrace from 1930-1932. Sir George Dick-Lauder, 10th Baronet, an Indian Civil Service Administrator, lived at 16 Regent Terrace and died there in 1936.\"Scottish Baronet Dead  Sir George Dick-Lauder\", The Scotsman, 1936-05-08\"Executry Notice - All persons having claims against the estate of the late Sir George William Dalrymple Dick Lauder, Bart., who resided at 16 Regent Terrace..\", The Scotsman, 1936-05-20  Queen Mary used to visit Sir Hew Hamilton Dalrymple KCVO at Number 24.  Sir Hew, brother of the Earl of Stair, Member of Parliament for Wigtownshire and Captain of the Royal Company of Archers, the King's Bodyguard for Scotland, lived there until he died in 1945.  John Murray, 9th Earl of Dunmore lived at 14 Regent Terrace until his death in 1980.John Murray, 9th Earl of Dunmore Accessed 2009-08-09Dunmore Family papers Accessed 2009-09-07 In 1993 Peter Fraser, Baron Fraser of Carmyllie,  then Minister of State at the Scottish Office, was living in Regent Terrace.", "*30 - Lady Margaret Sackville (1930–1932), Francis Cadell (1930–1935)"]}, {"page": "Ronald Campbell Macfie", "response": ["*Lady Margaret Sackville"]}, {"page": "British women's literature of World War I", "response": ["There are numerous female poets that remain popular today. Dissimilar to the idea that their writings would be overshadowed by war stories told by men, these poets have many publications. Vera Brittain has written poems and stories about the Great War. Not only was Brittain a writer, she was a nurse in the Voluntary Aid Detachment. This shows the support women had for the war and the importance they played in a non-combative manner. In addition, Lady Margaret Sackville refers to the women during the Great War as life-savers.Khan, 1988, p.86 More specifically, Sackville believes that women are supporting a war that is unnecessary in her poem The Pageant of War.Khan, 1988, p.33 Rupert Brooke attributed women with more credit than had previously been given in his poem There’s Wisdom in Women which he published in 1914 & Other Poems.Brooke, Rupert. 1914 & Other Poems. London: JM Classics Edition, 2007, p. 30"]}, {"page": "Sackville (surname)", "response": ["*** Lady Margaret Sackville (1562–1591), wife of the 2nd earl", "*** Lady Margaret Sackville (1881–1963), English poet and children's author, daughter of the 7th earl"]}, {"page": "1922 in Scotland", "response": ["*Lady Margaret Sackville's A Masque of Edinburgh is published and performed at the Music Hall, George Street, Edinburgh."]}, {"page": "List of Scottish poets", "response": ["*Lady Margaret Sackville"]}, {"page": "Frederick Noel Hamilton Wills", "response": ["Wills also developed strong creative interests including painting, music (playing cellist and singing tenor), design, and writing. He also rode, hunted, played polo, and fished. In 1909, he started a monthly magazine of poetry with Walter Jerrold, which included contributions from Walter de la Mare, Quiller-Couch, Lady Margaret Sackville and Edward Thomas.  "]}, {"page": "Lady Margaret Sackville (1562–1591)", "response": ["Lady Margaret Sackville (1562 – 19 August 1591), formerly Lady Margaret Howard, was the wife of Robert Sackville, 2nd Earl of Dorset."]}, {"page": "Eric Chappelow", "response": ["Later in life, Chappelow \"wrote poetry on classical themes\", and \"contributed several Assyriological articles to the Journal of the Royal Asiatic Society and the Journal of the Transactions of The Victoria Institute in the 1930s\". Chappelow and his brother Archibald were both elected Fellows of the Royal Society of Arts in 1937.Journal of the Royal Society of Arts, Vol. 107, No. 5040 (November 1959), p. 18. OCLC 8096729. His 1945 poetry volume, Salute to the Muse garnered several positive reviews, being described by The Library World as \"sensitive and accomplished verse\", and by The Poetry Review as \"lavish in romantic splendours, both in style and substance\". For one offering in this collection, Chappelow won the British Annual of Literature award for the best short poem.Stephen Phillips, Galloway Kyle, The Poetry Review, Vol. 37-38 (1946), p. 525. OCLC 1184161151. The British Annual of Literature wrote of the volume that \"Mr. Chappelow can write charmingly of little things\", and that \"[i]t is rare to find a poet writing during the War so untouched by it as the author of this accomplished volume\".The British Annual of Literature, Vol. 3 (1946), p. 83. OCLC 845018111. Chappelow's last work was his 1957 The Tale of Perseus, with a foreword by Lady Margaret Sackville.Stephen Phillips, Galloway Kyle, The Poetry Review (1958), p. 79. OCLC 1184161151. Chappelow died in Stepney, London, on 28 November 1957, at the age of 67."]}]}}