{"wiki_id": "http://www.wikidata.org/entity/Q6470159", "itemLabel": "Frances Balfour", "itemDescription": "British aristocrat and suffragist (1858-1931)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frances_Balfour", "wikipedia_page": {"main": "Lady Frances Balfour (née Campbell; 22 February 1858 – 25 February 1931) was one of the highest-ranking members of the British aristocracy to assume a leadership role in the Women's suffrage campaign in the United Kingdom. Balfour was a member of the Executive Committee of the National Society for Women's Suffrage from 1896 to 1919. As a non-violent suffragist, she was opposed to the militant actions of the Women's Social and Political Union, whose members were called the suffragettes.", "link_mentions": [{"page": "George Campbell, 8th Duke of Argyll", "response": ["*Lady Frances Balfour (22 February 1858 – 25 February 1931), married Eustace Balfour on 12 May 1879. They had five children."]}, {"page": "James Maitland Balfour", "response": ["*Colonel Eustace James Anthony Balfour (1854–1911), an architect who served as ADC to King Edward VII. His wife Lady Frances Balfour was a leading suffragist."]}, {"page": "List of suffragists and suffragettes", "response": ["* Frances Balfour (1858–1931) – president of the National Society for Women's Suffrage"]}, {"page": "Whittingehame", "response": ["* The Seven Ages of an East Lothian Parish - Whittingehame, by the Rev. Marshall B Lang, T.D., B.D., Minister of Whittingehame, with a Foreword by Lady Frances Balfour, (1858–1931), Edinburgh, 1929."]}, {"page": "Charles Frederic Moberly Bell", "response": ["Enid  Moberly Bell (1881–1967)  wrote several other books, including biographies of the journalist Flora Shaw and the social reformers Octavia Hill and Josephine Butler. Enid was first head-mistress at Lady Margaret School in Parsons Green, and vice-chair (to Lady Frances Balfour, former president of the National Society for Women's Suffrage) of the Lyceum Club for female artists and writers.Dictionary of British Women's Organisations: 1825 – 1960 by Peter Gordon"]}, {"page": "Mud March (suffragists)", "response": ["On the morning of 9 February, large numbers of women converged on the march's starting point, the statue of Achilles near Hyde Park Corner. Between three and four thousand women were assembled, from all ages and strata of society, in appalling weather with incessant rain; \"mud, mud, mud\" was the dominant feature of the day, wrote Fawcett. The marchers included Lady Frances Balfour, sister-in-law of Arthur Balfour, the former Conservative prime minister; Rosalind Howard, the Countess of Carlisle, of the Women's Liberal Federation; the poet and trade unionist Eva Gore-Booth; and the veteran campaigner Emily Davies. The march's aristocratic representation was matched by numbers of professional women – doctors, schoolmistresses, artists – and large contingents of working women from northern and other provincial cities, marching under banners that proclaimed their varied trades: bank-and-bobbin winders, cigar makers, clay-pipe finishers, power-loom weavers, shirt makers.", "By around 2:30 pm the march had formed a line that stretched far down Rotten Row. It set off in the drenching rain, with a brass band leading and Lady Frances Balfour, Millicent Fawcett and Lady Jane Strachey at the head of the column. The procession was followed by a phalanx of carriages and motor cars, many of which carried flags bearing the letters \"WS\", red and white banners and bouquets of red and white flowers.  Around 7,000 red and white rosettes had been provided for the marchers by the manufacturing company of Maud Arncliffe-Sennett, an actor and leader among the London Society for Women's Suffrage and the Actresses Franchise League."]}, {"page": "Herbert Gladstone, 1st Viscount Gladstone", "response": ["The following year the King rebuked Gladstone for appointing two women, Lady Frances Balfour and May Tennant, to serve on a Royal Commission on reforming Divorce Law – the King thought divorce could not be discussed with \"delicacy or even decency\" before ladies. Philip Magnus suggests that Gladstone may have become a whipping-boy for the King's general irritation with the Liberal Government."]}, {"page": "Lady Frances Balfour, (1858-1931)", "response": ["#REDIRECT Frances Balfour "]}, {"page": "Lady Frances Balfour, (1858–1931)", "response": ["#REDIRECT Frances Balfour"]}, {"page": "Church League for Women's Suffrage", "response": ["Notable members included Frances Balfour and Louise Creighton and the more militant Muriel Matters, Florence Canning, the outstanding Maude Royden, Lady Constance Lytton and Katherine Harley. Emily Wilding Davison, who died under the King's horse at Epsom, was a member, and her funeral was held at St George's, Bloomsbury, led by its vicar, Charles Baumgarten (also a member of the League), Claude Hinscliff, and Charles Escreet, Archdeacon of Lewisham."]}, {"page": "Lady Frances Balfour (1858–1931)", "response": ["#REDIRECT Frances Balfour"]}, {"page": "Lady Frances Balfour", "response": ["#redirect Frances Balfour"]}, {"page": "Lady Victoria Campbell", "response": ["In 1882, Lady Victoria experienced a \"second consecration\" and dedicated the rest of her life to helping those who lived on the islands throughout Argyll. She frequently visited the island of Tiree, where she championed social and religious organisations, and moved there in 1891. She also anonymously promoted the island, sending details of the plight of islanders in regular letters to the British press. In 1911 Victoria's sister Frances Balfour published a posthumous biography of her.", "At the age of five Lady Victoria contracted poliomyelitis, which caused paralysis and required her to wear leg braces for the remainder of her life. From 1859 to 1868, her health required her to spend most of the year in London and Brighton, near her orthopaedist Matthias Roth. Victoria was often separated from her immediate family during these periods, though she was looked after by her unmarried aunt Emily MacNeill and her lifelong servant and companion Elizabeth Knowles. Despite this separation, Victoria was particularly close to her sister Frances Balfour, who in 1868 described Victoria's bedroom as \"the centre of the fun and mischief that was going on in the family circle\"."]}, {"page": "Eustace Balfour", "response": ["Balfour had a strong sense of social class, and Frances Balfour later described the 1st Duke of Westminster as having run the estate \"not as today on commercial lines, but more as a Principality\".", "Eustace and Frances Balfour had five children:", "Knox confirms this view, noting that neither Blanche Dugdale's memoirs nor Frances Balfour's autobiography write much about their relationship with Eustace, and that Frances wrote at length about his brother Arthur whom she \"far preferred to Eustace\"."]}, {"page": "Ne obliviscaris", "response": ["*Ne Obliviscaris: Dinna Forget, memoirs of Lady Frances Balfour 2 vols. 1930"]}, {"page": "National Council of Women of Great Britain", "response": [":1921: Frances Balfour"]}, {"page": "Lady Frances Balfour (1858-1931)", "response": ["#REDIRECT :Frances Balfour"]}, {"page": "Constance Smedley", "response": ["Jessie Trimble proposed that the new club be called the Lyceum Club and the new committee arranged for Smedley to meet Lady Frances Balfour. By now the committee had decided to extend their net for new members from writers to professional women and even the daughters or wives of prominent men. Balfour agreed to lead the new club and served as chair for 15 years.History, Lyceum Club, Retrieved 21 June 2016"]}]}}