{"wiki_id": "http://www.wikidata.org/entity/Q6470585", "itemLabel": "Lady Victoria Leatham", "itemDescription": "British antiques expert", "wikipedia_url": "https://en.wikipedia.org/wiki/Lady_Victoria_Leatham", "wikipedia_page": {"main": "Lady Victoria Diana Leatham MBE (née Cecil; born 28 June 1947) is an antiques expert and television personality. She was the chatelaine of Burghley House from 1982 to 2007.", "link_mentions": [{"page": "Worshipful Company of Drapers", "response": ["Queen Elizabeth II of the United Kingdom (who was elected to the Court of Assistants in 2017, on the occasion of the 70th anniversary of her membership of the Company), King Harald V of Norway, The Prince of Wales, The Duchess of Gloucester, Admiral Lord Boyce, and Lady Victoria Leatham (who was elected the first female Master of the company in 2012) are among the many distinguished current members of the company."]}, {"page": "Burghley House", "response": ["Lady Victoria Leatham, antiques expert and television personality, followed her father, Olympic gold-medal winning athlete, IAAF President and MP, David Cecil, the 6th Marquess, by running the house from 1982 to 2007. The Olympic corridor commemorates her father. Her daughter, Miranda Rock, is now the most active live-in trustee. at Burghley's web site However, the Marquessate passed it in 1988 to Victoria's uncle, Martin Cecil, 7th Marquess of Exeter, and then to his son, William Michael Anthony Cecil, both Canadian ranchers on land originally bought by the 5th Marquess, who have not lived at Burghley.", "The residents of the house since 2007 were Miranda Rock, director of the Burghley House Preservation Trust, granddaughter of the 6th Marquess of Exeter and daughter of Lady Victoria LeathamThe Guardians of Burghley House with Orlando Rock (chairman of Christie’s UK) and their family. Data before the COVID-19 pandemic in the United Kingdom indicated that the number of visitors to the site each year had almost doubled during Miranda Rock's tenure, to 110,000.Burghley House: The 500-year story of one of the very greatest houses in Britain As of early July 2020, only the gardens had reopened to visitors, with advance booking; because social distancing would not be practical indoors, the House was not expected to reopen until March 2021.COVID-19 (Coronavirus) Update"]}, {"page": "158 Regiment RLC", "response": ["*Lady Victoria Leatham DL (1996 to 5 April 2003)"]}, {"page": "Help for Heroes", "response": ["*Lady Victoria Leatham – daughter of David Cecil, 6th Marquess of Exeter, she was Honorary Colonel of 158th (Royal Anglian) Transport Regiment from 1996 until 2003.  She was the chatelaine of Burghley House from 1982 until her retirement in 2007, and is also one of the experts on the BBC television show, Antiques Roadshow.;"]}, {"page": "Jonathan Myles-Lea", "response": ["*Burghley House (1996) (commissioned by Simon and Lady Victoria Leatham)"]}, {"page": "Victoria Leatham", "response": ["#redirectLady Victoria Leatham"]}, {"page": "Leatham", "response": ["*Lady Victoria Leatham (born 1947), antiques expert and television personality"]}]}}