{"wiki_id": "http://www.wikidata.org/entity/Q6483489", "itemLabel": "Lance Newnham", "itemDescription": "British Army colonel", "wikipedia_url": "https://en.wikipedia.org/wiki/Lance_Newnham", "wikipedia_page": {"main": "Temporary Colonel Lanceray Arthur Newnham  (3 August 1889 – 18 December 1943), known as Lance or Lan Newnham, was a British Army officer. He was posthumously awarded the George Cross for the gallantry he showed in resisting Japanese torture during the Second World War.", "link_mentions": [{"page": "Battle of Hong Kong", "response": ["* Colonel Lance Newnham, Captain Douglas Ford and Flight Lieutenant Hector Bertram Gray were awarded the George Cross for the gallantry they showed in resisting Japanese torture in the immediate aftermath of the battle. The men had been captured and were in the process of planning a mass escape by British forces. Their plan was discovered but they refused to disclose information under torture and were shot by firing squad."]}, {"page": "Stanley Military Cemetery", "response": ["Another notable group of personnel that were buried or commemorated there are those who served in the British Army Aid Group, which helped POWs in Hong Kong or other Japanese occupied zones to escape to China, and arranged military needs for resistance in those zones. Among them was Captain M.A. Ansari, who was originally in the 5/7th Rajput Regiment but from Ma Tau Chung POW Camp co-ordinated with the British Army Aid Group after the surrender. He was also a posthumous recipient of the George Cross. Also Colonel Lance Newnham of the Middlesex Regiment, John Alexander Fraser of the British Army Aid Group, Captain Douglas Ford of the Royal Scots and Flight Lieutenant Hector Gray of Royal Air Force were also a posthumous recipient of the George Cross for the same reason too."]}, {"page": "Lanceray Arthur Newnham", "response": ["#REDIRECT Lance Newnham"]}, {"page": "Lanceray Newnham", "response": ["#REDIRECT Lance Newnham"]}, {"page": "Lan Newnham", "response": ["#REDIRECT Lance Newnham"]}, {"page": "Newnham (surname)", "response": ["* Lance Newnham (1889–1943), British soldier"]}]}}