{"wiki_id": "http://www.wikidata.org/entity/Q6498674", "itemLabel": "Laura Beatty", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Laura_Beatty", "wikipedia_page": {"main": "Laura Mary Catherine Beatty (née Keen; born 1 May 1963) is a writer awarded the Authors' Club First Novel Award for her 2008 novel Pollard, also shortlisted for the Ondaatje Prize.She has also written two biographies, the first about Lillie Langtry which contained the first publication of correspondence between Lillie and her lover Arthur Jones.", "link_mentions": [{"page": "Lillie Langtry", "response": ["In July 1879, Langtry began an affair with the Earl of Shrewsbury; in January 1880, Langtry and the earl were planning to run away together.Laura Beatty, Lillie Langtry: Manners, Masks and Morals (London, 1999), pp. 164–65.  In the autumn of 1879, scandal-mongering journalist Adolphus Rosenberg wrote in Town Talk of rumours that her husband would divorce her and cite, among others, the Prince of Wales as co-respondent. Rosenberg also wrote about Patsy Cornwallis-West, whose husband sued him for libel. At this point, the Prince of Wales instructed his solicitor George Lewis to sue also. Rosenberg pleaded guilty to both charges and was sentenced to two years in prison.", "The discovery in 1978 of Langtry's passionate letters to Arthur Jones and their publication by Laura Beatty in 1999 support the idea that Jones was the father of Langtry's daughter.Beatty, op. cit. Prince Louis' son, Earl Mountbatten of Burma, however, had always maintained that his father was the father of Jeanne Marie.Daily Telegraph, 27 September 1978; Evening News, 23 October 1978."]}, {"page": "Beatty", "response": ["* Laura Beatty (born 1963), English author"]}, {"page": "Alice Oswald", "response": ["Oswald is the daughter of Charles William Lyle Keen and Lady Priscilla Mary Rose Curzon, daughter of Edward Curzon, 6th Earl Howe.Burke's Peerage, Baronetage and Knightage, 107th edition, vol. 2, Burke's Peerage, Ltd, 2003, p. 1987Debrett's Peerage and Baronetage, 148th edition, Debrett's Peerage Ltd, 2011, p. 799 Oswald read Classics at New College, Oxford. She then trained as a gardener and worked at such sites as Chelsea Physic Garden, Wisley and Clovelly Court Gardens. She currently lives on the Dartington Estate in Devon with her husband, the playwright Peter Oswald (also a trained classicist), and her three children. Alice Oswald is the sister of actor Will Keen and writer Laura Beatty and the aunt of Keen's daughter Dafne.The Daily TelegraphThe Daily Telegraph"]}, {"page": "Authors' Club Best First Novel Award", "response": ["*2009 - Laura Beatty - Pollard"]}, {"page": "Will Keen", "response": ["Keen was born in Oxford, the son of Charles William Lyle Keen and Lady Priscilla Mary Rose Curzon, daughter of Edward Curzon, 6th Earl Howe.Burke's Peerage, Baronetage and Knightage, 107th edition, vol. 2, Burke's Peerage, Ltd, 2003, p. 1987 His sisters are poet Alice Oswald and Laura Beatty. He studied at Eton College and has a first class degree in English literature from Oxford University. He is married to Galician actress, theatre director, and writer Maria Fernandez Ache with whom he has a daughter, Dafne Keen, who is also an actress."]}, {"page": "Pollard (novel)", "response": ["Pollard is the debut novel of Laura Beatty, first published in hardback in 2008 by Chatto & Windus and the following year in paperback by Vintage Books. This was her first novel though she had previously written biographies. It won the Authors' Club First Novel Award and was shortlisted for the Ondaatje Prizehttp://www.stabroeknews.com/2009/stories/05/14/ian-mcdonald%E2%80%99s-selected-poems-short-listed-for-ondaatje-prize/"]}, {"page": "Dafne Keen", "response": ["Keen was born in Madrid. She is the daughter of British actor Will Keen, and Spanish actress, theatre director, and writer María Fernández Ache. Her paternal great-grandfather was Edward Curzon, 6th Earl Howe;Burke's Peerage, Baronetage and Knightage, 107th edition, vol. 2, Burke's Peerage, Ltd, 2003, p. 1987Debrett's Peerage and Baronetage, 148th edition, Debrett's Peerage Ltd, 2011, p. 799 her aunts are poet Alice Oswald and writer Laura Beatty."]}, {"page": "Lost Property (Beatty novel)", "response": ["Lost Property is the third novel of Laura Beatty, first published in 2019 by Atlantic Books.", "*Laura Beatty: Insight and wonder"]}]}}