{"wiki_id": "http://www.wikidata.org/entity/Q6499049", "itemLabel": "Laura Janner-Klausner", "itemDescription": "British rabbi", "wikipedia_url": "https://en.wikipedia.org/wiki/Laura_Janner-Klausner", "wikipedia_page": {"main": "Laura Naomi Janner-Klausner (Hebrew: לוֹרָה ג׳אָנֶר-קלְוֹזנֶר, born 1 August 1963) is a British rabbi and Inclusion and Development Coach who served as the Senior Rabbi to Reform Judaism. Janner-Klausner grew up in London before studying theology at the University of Cambridge and moving to Israel in 1985, living in Jerusalem for 15 years. She returned to Britain in 1999 and was ordained at Leo Baeck College, serving as rabbi at Alyth Synagogue (North Western Reform Synagogue) until 2011, when she became the inaugural Senior Rabbi. She stepped down from this position in September 2020.Janner-Klausner represents a progressive Jewish voice to British Jewry and the wider public, speaking on affairs including Israel-Palestine, social justice, same-sex marriage and interfaith relations. Janner-Klausner is a regular broadcaster on programmes such as BBC Radio 4’s Thought for the Day, BBC Radio 2’s Pause for Thought and BBC One’s The Big Questions and Sunday Morning Live. In November 2014, The Huffington Post reported that Janner-Klausner was \"fast becoming the most high-profile Jewish leader in the country\" and described her as \"wildly likeable, emphatic, intense, and outspoken\". In 2018 she featured in The Progress 1000 list of London's most influential people. She has written a book on the theme of resilience, Bitesize Resilience: A Crisis Survival Guide, which was launched on 7 May 2020. She is Co-Chair of the Global Interfaith Commission on LGBT+ Lives and an honorary fellow of The Edward Cadbury Centre for the Public Understanding of Religion at the University of Birmingham. She is also a fellow of the Royal Society of Arts.", "link_mentions": [{"page": "Greville Janner", "response": ["Lord Janner's younger daughter is Rabbi Laura Janner-Klausner, who was appointed Senior Rabbi to Reform Judaism in 2011. She is married to a brother of the Israeli writer Amos Oz. Marion Janner, his other daughter, was appointed Officer of the Order of the British Empire (OBE) for services to mental health in 2010.Robyn Rosen \"Marion Janner (and Buddy) collect OBE\", The Jewish Chronicle, 12 February 2010 Daniel Janner, his son, is a barrister and QC.Frances Gibb \"Tax barrister stands for BNP\", The Times (Law Central blog), 23 March 2010", "Janner's daughter, Rabbi Laura Janner-Klausner, said \"We have a system where people are believed instantly before the evidence is examined instead of being listened to compassionately and the allegations properly investigated. People were able to accuse (my father) without a shred of evidence and were believed straight away.\""]}, {"page": "List of British Jews", "response": ["* Laura Janner-Klausner, Senior Rabbi of the Movement for Reform Judaism"]}, {"page": "Movement for Reform Judaism", "response": ["* Rabbi Laura Janner-Klausner (born 1963),  broadcaster and former Senior Rabbi to the Movement for Reform Judaism (2011–20)"]}, {"page": "Human Appeal", "response": ["UK Labour Party leader Sir Keir Starmer, Rabbi Laura Janner-Klausner, Anna Soubry, MP Kate Green, MP Shabana Mahmood, and Sir Graham Brady have all supported Human Appeal in the past."]}, {"page": "1963 in the United Kingdom", "response": ["* 1 August – Laura Janner-Klausner, Reform rabbi"]}, {"page": "British Jews", "response": ["In May 2018, the community was described by one of its most prominent figures, Rabbi Laura Janner-Klausner, as being “on the path to self-destruction” due to divisions over how to respond to conflict in Israel."]}, {"page": "North Western Reform Synagogue", "response": ["* 2003–11 Rabbi Laura Janner-Klausner, later to become Senior Rabbi at the Movement for Reform Judaism"]}, {"page": "The Big Questions", "response": ["Panellists have included notable atheist Richard Dawkins, convert to Roman Catholicism Ann Widdecombe, Imam Ibrahim Mogra, Muslim commentator Mohammed Ansar, Rabbi Laura Janner-Klausner, Scottish philosopher John Joseph Haldane, Bible scholar Francesca Stavrakopoulou, Lord Carey, Jonathan Bartley, Peter Hitchens, Alexander Goldberg, Ian McMillan, Andrew Pinsent, Stephen Law, Tommy Robinson, Michael Nazir-Ali, Samuel Westrop, Peter Tatchell and Decca Aitkenhead."]}, {"page": "Tzipi Hotovely", "response": ["Several senior members of the British Jewish community criticized her appointment as Ambassador of Israel to the United Kingdom, mainly because of her \"ultra-right-wing\" opinions, including Melanie Phillips, Jenni Frazer, Laura Janner-Klausner, and Lord Beecham, who stated: \"The appointment of an ultra-right-wing ambassador, while typical of the present government of Israel, will do nothing to win friends in the UK – or indeed any other reasonable country.\" A petition within the British Jewish community calling for the UK government to reject her nomination as ambassador received hundreds of signatures."]}, {"page": "Janner (surname)", "response": ["* Laura Janner-Klausner (born 1963), British rabbi"]}, {"page": "Klausner", "response": ["*Laura Janner-Klausner (born 1963), British rabbi"]}, {"page": "Beth Shalom Reform Synagogue (Cambridge)", "response": ["Beth Shalom Reform Synagogue is a synagogue in the City of Cambridge. Founded in 1981, it held services in hired premises until 2015 when the community opened a new synagogue on a site on Auckland Road,  the first Reform synagogue in Cambridge. The new building includes a prayer hall for at least 200 people. The building was dedicated on 6 September 2015 at a service led by Fiona Karet Frankl and addressed by Rabbi Laura Janner-Klausner, senior rabbi to the Movement for Reform Judaism."]}, {"page": "Ecumenical Accompaniment Programme in Palestine and Israel", "response": ["EAPPI responded to the criticism by making changes to the programme to ensure that volunteers would spend time in Jewish houses and hear other sides. Rabbi Laura Janner-Klausner, who chairs the UK branch of Rabbis for Human Rights, said the move would “counterbalance some of the initial discord between Jews and Christians that came as a result between of the Synod vote and reaction to it.”"]}, {"page": "Ephraim Mirvis", "response": ["His appointment was welcomed by the Conference of European Rabbis. Jeremy Newmark, chief executive of the Jewish Leadership Council in the UK, called the appointment “immensely popular.” Laura Janner-Klausner, the head rabbi of the Movement for Reform Judaism in Great Britain, said: \"I welcome the appointment of Mirvis as another powerful voice for British Jewry. I look forward to working closely with him as a partner on areas of common interests to the Jewish and wider community.\" The Orthodox Union in the United States also welcomed Mirvis’ selection as the Chief Rabbi."]}]}}