{"wiki_id": "http://www.wikidata.org/entity/Q649280", "itemLabel": "Geoffrey Hill", "itemDescription": "English poet (1932–2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Geoffrey_Hill", "wikipedia_page": {"main": "Sir Geoffrey William Hill, FRSL (18 June 1932 – 30 June 2016) was an English poet, professor emeritus of English literature and religion, and former co-director of the Editorial Institute, at Boston University. Hill has been considered to be among the most distinguished poets of his generation and was called the \"greatest living poet in the English language.\" \nFrom 2010 to 2015 he held the position of Professor of Poetry in the University of Oxford. Following his receiving the Truman Capote Award for Literary Criticism in 2009 for his Collected Critical Writings, and the publication of Broken Hierarchies (Poems 1952–2012), Hill is recognised as one of the principal contributors to poetry and criticism in the 20th and 21st centuries.\n\n", "link_mentions": [{"page": "List of English-language poets", "response": ["*Geoffrey Hill (1932–2016, E/US)"]}, {"page": "June 18", "response": ["*  1932   – Geoffrey Hill, English poet and academic (d. 2016)"]}, {"page": "Jonathan Meades", "response": ["Preferring to be thought of as a performer rather than as a presenter, Meades has described his style as \"heavy entertainment\"; \"staged essays\" which seek to combine \"lecture hall\" and \"music hall\", Geoffrey Hill and Benny Hill."]}, {"page": "Sonnet", "response": ["Half-rhymed, unrhymed, and even unmetrical sonnets have been very popular since 1950; perhaps the best works in the genre are Seamus Heaney's Glanmore Sonnets and Clearances, both of which use half rhymes, and Geoffrey Hill's mid-period sequence \"An Apology for the Revival of Christian Architecture in England\". Without a doubt, the most ambitious sonnet project of the late 20th century is Vikram Seth's The Golden Gate (1986), a comic celebration of life in San Francisco in the early 1980s in nearly 600 sonnets (even the acknowledgements and table of contents are sonnets)."]}, {"page": "T. S. Eliot", "response": ["Eliot influenced many poets, novelists, and songwriters, including Seán Ó Ríordáin, Máirtín Ó Díreáin, Virginia Woolf, Ezra Pound, Bob Dylan, Hart Crane, William Gaddis, Allen Tate, Andrew Lloyd Webber, Trevor Nunn, Ted Hughes, Geoffrey Hill, Seamus Heaney, Russell Kirk, George Seferis (who in 1936 published a modern Greek translation of The Waste Land) and James Joyce. T. S. Eliot was a strong influence on 20th-century Caribbean poetry written in English, including the epic Omeros (1990) by Nobel laureate Derek Walcott, and Islands (1969) by Barbadian Kamau Brathwaite."]}, {"page": "Trimalchio", "response": ["* In The Triumph of Love by Geoffrey Hill (1998), Trimalchio appears throughout the poem as one of its many personae."]}, {"page": "Battle of Towton", "response": ["The Battle of Towton was re-examined by Geoffrey Hill in his poem \"Funeral Music\" (1968). Hill presents the historical event through the voices of its combatants, looking at the turmoil of the era through their eyes. The common soldiers grouse about their physical discomforts and the sacrifices that they had made for the ideas glorified by their leaders. They share their superiors' determination to seek the destruction of their opponents, even at the cost of their lives. Hill depicts the participants' belief that the event was pre-destined and of utmost importance as a farce; the world went about its business regardless of the Battle of Towton."]}, {"page": "Boston University", "response": ["In 1986, literary critic Christopher Ricks, whom W. H. Auden called \"exactly the kind of critic every poet dreams of finding\", joined the university's faculty and founded the Editorial Institute with Geoffrey Hill. Controversial historian Howard Zinn taught in the political science department for many years. Journalist Thomas B. Edsall and playwright Eliza Wyatt graduated from Boston University. Paul Beatty, who earned bachelor's and master's degrees in psychology at BU, won the National Book Critics Circle Award and the Man Booker Prize for his novel The Sellout. He is the first writer from the United States honored with the Man Booker. The bestselling author Casey Sherman graduated from BU in 1992."]}, {"page": "List of poets", "response": ["*Geoffrey Hill (1932–2016), English poet and professor"]}, {"page": "John Ruskin", "response": ["Notable Ruskin enthusiasts include the writers Geoffrey Hill and Charles Tomlinson, and the politicians Patrick Cormack, Frank Judd, Frank FieldFrank Field spoke at the Art Workers Guild on Ruskin, 6 February 2010. Stuart Eagles,  The Economic Symposium. John Ruskin and the Modern World: Art and Economics, 1860–2010 in The Companion no. 10 (2010), pp. 7–10. and Tony Benn.Omnibus. Ruskin: The Last Visionary , tx. BBC1, 13 March 2000. In 2006, Chris Smith, Baron Smith of Finsbury, Raficq Abdulla, Jonathon Porritt and Nicholas Wright were among those to contribute to the symposium, There is no wealth but life: Ruskin in the 21st Century.Robert Hewison (ed.) There is no wealth but life: Ruskin in the 21st Century (Ruskin To-Day, 2006). Jonathan Glancey at The Guardian and Andrew Hill at the Financial Times have both written about Ruskin,Andrew Hill, Introduction in John Ruskin, Unto This Last (Pallas Athene, 2010), pp. 9–16. as has the broadcaster Melvyn Bragg.Melvyn Bragg, Foreword in John Ruskin, On Genius (Hesperus, 2011), pp. vii–xiv. He also appeared on an edition of Broadcasting House on BBC Radio 4 on 20 January 2019. In 2015, inspired by Ruskin's philosophy of education, Marc Turtletaub founded Meristem in Fair Oaks, California. The centre educates adolescents with developmental differences using Ruskin's \"land and craft\" ideals, transitioning them so they will succeed as adults in an evolving post-industrial society."]}, {"page": "White Ship", "response": ["* Geoffrey Hill, \"The White Ship\". In his first book, For the Unfallen, 1959."]}, {"page": "Simon Armitage", "response": ["Simon Robert Armitage  (born 26 May 1963) is famous for walking and is an English poet, playwright and novelist who was appointed Poet Laureate on 10 May 2019. He is also professor of poetry at the University of Leeds and succeeded Geoffrey Hill as Oxford Professor of Poetry when he was elected to the four-year part-time appointment from 2015 to 2019."]}, {"page": "English poetry", "response": ["Some consider the late Geoffrey Hill to have been the finest English poet of recent years.William Logan, \"Stouthearted Men\", The New Criterion, June 2004. The last three decades of the 20th century saw a number of short-lived poetic groupings, including the Martians, along with a general trend towards what has been termed 'Poeclectics',\"Making Voices: Identity, Poeclectics and the Contemporary British Poet\", New Writing, The International Journal for the Practice and Theory of Creative Writing; Volume 3 (1); pp 66–77. namely an intensification within individual poets' oeuvres of \"all kinds of style, subject, voice, register and form\". There has also been a growth in interest in women's writing, and in poetry from England's minorities, especially the West Indian community. Performance poetry including poetry slam continues to be active. Some poets who emerged in this period include Carol Ann Duffy, Andrew Motion, Craig Raine, Wendy Cope, James Fenton, Blake Morrison, Liz Lochhead, George Szirtes, Linton Kwesi Johnson, Benjamin Zephaniah. Mark Ford is an example of a poet influenced by New York School.Helen Vendler compared him with John Ashbery. "]}, {"page": "1999 in literature", "response": ["*Cholmondeley Award: Vicki Feaver, Geoffrey Hill, Elma Mitchell, Sheenagh Pugh"]}, {"page": "1932 in literature", "response": ["*June 18 – Geoffrey Hill, English poet (died 2016)"]}, {"page": "William Kempe", "response": ["*Kempe's Jig is referenced in Geoffrey Hill's poem \"After Reading Children of Albion (1969)\" from his A Treatise of Civil Power, published in 2007."]}, {"page": "1971 in literature", "response": ["*October 20 – The Destiny Waltz by Gerda Charles wins the U.K.'s first Whitbread Novel of the Year Award. Geoffrey Hill wins the poetry prize for Mercian Hymns and Michael Meyer the biography category for Henrik Ibsen."]}, {"page": "The Times Literary Supplement", "response": ["The TLS has included essays, reviews and poems by John Ashbery, Italo Calvino, Patricia Highsmith, Milan Kundera, Philip Larkin, Mario Vargas Llosa, Joseph Brodsky, Gore Vidal, Orhan Pamuk, Geoffrey Hill and Seamus Heaney, among others.TLS writers past and present, Times of London, n.d. "]}, {"page": "1961 in literature", "response": ["*Eric Gregory Award: Adrian Mitchell, Geoffrey Hill"]}, {"page": "William de la Pole, 1st Duke of Suffolk", "response": ["*Suffolk is one of the three dedicatees of Geoffrey Hill's sonnet sequence, \"Funeral Music\" (first published in Stand magazine; collected in King Log, Andre Deutsch 1968). Hill speculates about him in the essay appended to the poems."]}, {"page": "Palgrave's Golden Treasury", "response": ["Dannie Abse – Fleur Adcock – William Alexander, Earl of Stirling – Kingsley Amis – Simon Armitage – Matthew Arnold – W. H. Auden – Francis Bacon, Lord Verulam – Anna Laetitia Barbauld – George Barker – Richard Barnfield – Francis Beaumont – Patricia Beer – John Betjeman – Laurence Binyon – Thomas Blackburn – Edmund Blunden – Eavan Boland – Ronald Bottrall – Robert Bridges – George Mackay Brown – Elizabeth Barrett Browning – Robert Browning – Alan Brownjohn – Robert Burns – George Gordon Noel, Lord Byron – Norman Cameron – Roy Campbell – Thomas Campbell – Thomas Campion – Thomas Carew – Henry Carey – Lewis Carroll – Charles Causley – Colley Cibber – John Clare – Austin Clarke – Jack Clemo – Arthur Hugh Clough – Hartley Coleridge – Samuel Taylor Coleridge – John Collins – William Collins – Tony Connor – Henry Constable – David Constantine – Abraham Cowley – William Cowper – Richard Crashaw – Robert Crawford – Allan Cunningham – Samuel Daniel – George Darley – Donald Davie – W. H. Davies – Dick Davis – Thomas Dekker – Walter de la Mare – Lord De Tabley – Richard Watson Dixon – Keith Douglas – Ernest Dowson – Michael Drayton – William Drummond – John Dryden – Carol Ann Duffy – Helen Dunmore – Douglas Dunn – Lawrence Durrell – Thomas Stearns Eliot – Alistair Elliot – Jean Elliot – William Empson – D. J. Enright – Gavin Ewart – James Fenton – Roy Fisher – Edward FitzGerald – John Fletcher – Veronica Forrest-Thomson – John Fuller – Roy Fuller – Elizabeth Garrett – David Gascoyne – John Gay – Oliver Goldsmith – Robert Graham – Robert Graves – Thomas Gray – Thom Gunn – Michael Hamburger – Ian Hamilton – Thomas Hardy – Tony Harrison – Seamus Heaney – John Heath-Stubbs – George Herbert – Robert Herrick – Thomas Heywood – Geoffrey Hill – Ralph Hodgson – David Holbrook – Molly Holden – Thomas Hood – Gerard Manley Hopkins – A. E. Housman – Ted Hughes – T. E. Hulme – Elizabeth Jennings – Lionel Johnson – Ben Jonson – Patrick Kavanagh – John Keats – Sidney Keyes – Thomas Kinsella – Rudyard Kipling – James Kirkup – Charles Lamb – Walter Savage Landor – Philip Larkin – D. H. Lawrence – Edward Lear – Laurie Lee – Alun Lewis – Cecil Day-Lewis – Lady Anne Lindsay – Thomas Lodge – John Logan – Michael Longley – Richard Lovelace – Edward Lowbury – John Lyly – George MacBeth – Norman MacCaig – Hugh MacDiarmid – Louis MacNeice – Derek Mahon – Christopher Marlowe – Andrew Marvell – John Masefield – George Meredith – William Julius Mickle – John Milton – Thomas Moore – William Morris – Andrew Motion – Edwin Muir – Paul Muldoon – Carolina, Lady Nairne – Thomas Nash – Robert Nichols – Norman Nicholson – Bernard O'Donoghue – Wilfred Owen – Coventry Patmore – Tom Paulin – Ambrose Philips – Alexander Pope – Peter Porter – Jonathan Price – F. T. Prince – Matthew Prior – Craig Raine – Peter Redgrove – Henry Reed – Anne Ridler – Michael Riviere – W. R. Rodgers – Samuel Rogers – Isaac Rosenberg – Alan Ross – Christina Georgina Rossetti – Dante Gabriel Rossetti – Carol Rumens – Lawrence Sail – Siegfried Sassoon – Vernon Scannell – Sir Walter Scott – Peter Scupham – Sir Charles Sedley – George Sewell – William Shakespeare – Percy Bysshe Shelley – James Shirley – Sir Philip Sidney – Jon Silkin – C. H. Sisson – Edith Sitwell – Iain Crichton Smith – Stevie Smith – Robert Southey – Bernard Spencer – Stephen Spender – Edmund Spenser – Jon Stallworthy – Anne Stevenson – Sir John Suckling – Algernon Charles Swinburne – Joshua Sylvester – Alfred, Lord Tennyson – Dylan Thomas – Edward Thomas – R. S. Thomas – Francis Thompson – James Thomson (The Seasons) – James Thomson (B.V.) – Anthony Thwaite – Terence Tiller – Charles Tomlinson – The Shepherd Tony – Henry Vaughan – Edward Vere, Earl of Oxford – John Wain – Ted Walker – Edmund Waller – Vernon Watkins – John Webster – Robert Wells – Lawrence Whistler – Hugo Williams – George Wither – Charles Wolfe – William Wordsworth – Sir Henry Wotton – David Wright – Kit Wright – Sir Thomas Wyat – William Butler Yeats – Andrew Young"]}, {"page": "British literature", "response": ["Geoffrey Hill (1932–2016) has been considered to be among the most distinguished English poets of his generation,Harold Bloom, ed. Geoffrey Hill (Bloom's Modern Critical Views), Infobase Publishing, 1986. Charles Tomlinson (1927–2015) is another important English poet of an older generation, though \"since his first publication in 1951, has built a career that has seen more notice in the international scene than in his native England."]}, {"page": "Charles Péguy", "response": ["English poet Geoffrey Hill published a book-length poem in 1983 in homage to Péguy, entitled The Mystery of the Charity of Charles Péguy.Hill, Geoffrey (1985). Notes – Collected Poems. London: Penguin Books."]}, {"page": "Antonio Machado", "response": ["Poet Geoffrey Hill has hailed him as Montale's 'grand equal'.CXXXIV, The Triumph of Love (London, 1998), p.73. His phrase \"the two Spains\"—one that dies and one that yawns—referring to the left-right political divisions that led to the Civil War, has passed into Spanish and other languages."]}, {"page": "Ern Malley hoax", "response": ["I think it was the first summer I was at Harvard as a student, and I discovered a wonderful bookstore there where I could get modern poetry – which I'd never been able to lay my hands on very much until then – and they had the original edition of The Darkening Ecliptic with the Sidney Nolan cover. [...] I always had a taste for sort of wild experimental poetry – of which there really wasn't very much in English in America at the time – and this poet suited me very well. [...] I am obliged to give a final examination in my poetry writing course [at Brooklyn College, NY], which I'm always rather hard put to do, since we haven't really studied anything. The students have been writing poems of varying degrees of merit, and though I give them reading lists they tend to ignore them, after first demanding them. And the way the course is set up there is no way of examining them on their reading. And anyway they shouldn't have to pass an examination because they're poets who are writing poetry, and I don't like the idea of grading poems. So in order to pass the examination time I had to think of various subterfuges, and one of them is to use one of Malley's poems and another forbiddingly modern poem – frequently one of Geoffrey Hill's 'Mercian Hymns'. And asking them if they can guess which one is the real poem by a respected contemporary poet, and which one is a put-on intended to ridicule modern poetry, and what are their reasons. And I think they are right about fifty per cent of the time, identifying the fraud... [the] fraudulent poem."]}, {"page": "Bromsgrove", "response": ["* Geoffrey Hill (1932–2016) poet."]}, {"page": "Duff Cooper Prize", "response": ["*1979 – Geoffrey Hill, Tenebrae"]}, {"page": "Oxford Book of Contemporary Verse", "response": ["*Geoffrey Hill"]}, {"page": "The New Poetry", "response": ["*Geoffrey Hill"]}, {"page": "Anthology of Twentieth-Century British and Irish Poetry", "response": ["* Geoffrey Hill"]}, {"page": "The Harvill Book of Twentieth-Century Poetry in English", "response": ["*Geoffrey Hill"]}, {"page": "New Poets of England and America", "response": ["Kingsley Amis - William Bell - Robert Bly - Philip Booth - Edgar Bowers - Charles Causley - Henri Coulette - Donald Davie - Catherine Davis - Keith Douglas - Donald Finkel - W. S. Graham - Charles Gullans - Thom Gunn - Donald Hall - Michael Hamburger - Elizabeth R. Harrod - John Heath-Stubbs - Anthony Hecht - Geoffrey Hill - John Hollander - John Holloway - Elizabeth Jennings - Donald Justice - Ellen de Young Kay - Melvin Walker La Follette - Joseph Langland - Philip Larkin - Robert Layzer - Robert Lowell - William Matchett - Thomas McGrath - William Meredith - James Merrill - W. S. Merwin - Robert Mezey - Vassar Miller - Howard Moss - Howard Nemerov - Robert Pack - Alastair Reid - Adrienne Cecile Rich - Jon Silkin - Louis Simpson - William Jay Smith - W. D. Snodgrass - May Swenson - Wesley Trimpi - Jon Manchip White - Reed Whittemore - Richard Wilbur - James Wright"]}, {"page": "Faber Book of Modern Verse", "response": ["Conrad Aiken - W. H. Auden - George Barker - John Berryman - Robert Bly - Hart Crane - E. E. Cummings - Donald Davie - James Dickey - H. D. - Keith Douglas - Richard Eberhart - T. S. Eliot - William Empson - David Gascoyne - W. S. Graham - Robert Graves - Thom Gunn - John Heath-Stubbs - Geoffrey Hill - Gerard Manley Hopkins - Ted Hughes - T. E. Hulme - David Jones - Philip Larkin - D. H. Lawrence - Denise Levertov - C. Day Lewis - Robert Lowell - Norman MacCaig - Hugh MacDiarmid - Louis MacNeice - Charles Madge - W. S. Merwin - Christopher Middleton - Harold Monro - Marianne Moore - Edwin Muir - Howard Nemerov - Charles Olson - Wilfred Owen - Sylvia Plath - Ezra Pound - F. T. Prince - Kathleen Raine - John Crowe Ransom - Herbert Read - Laura Riding - Anne Ridler - Michael Roberts - Theodore Roethke - Isaac Rosenberg - Louis Simpson - Edith Sitwell - W. D. Snodgrass - Stephen Spender - Wallace Stevens - Allen Tate - Dylan Thomas - R. S. Thomas - Charles Tomlinson - Vernon Watkins - Richard Wilbur - William Carlos Williams - James Wright - W. B. Yeats"]}, {"page": "Penguin Modern Poets", "response": ["#Edwin Brock, Geoffrey Hill, Stevie Smith", "#Toby Martinez de las Rivas, Geoffrey Hill, Rowan Evans (These Hard and Shining Things, 2018)"]}, {"page": "British Poetry since 1945", "response": ["A. Alvarez - Kingsley Amis - George Barker - Patricia Beer - Martin Bell - Francis Berry - John Betjeman - D. M. Black - Thomas Blackburn - Alan Bold - Alan Brownjohn - Basil Bunting - Miles Burrows - Charles Causley - Barry Cole - Tony Connor - Iain Crichton Smith - Peter Dale - Donald Davie - Lawrence Durrell - D. J. Enright - Paul Evans - Ian Hamilton Finlay - Roy Fisher - John Fuller - Roy Fuller - Robert Garioch - David Gascoyne - Karen Gershon - Henry Graham - W. S. Graham - Robert Graves - Harry Guest - Thom Gunn - Michael Hamburger - Ian Hamilton Finlay - Lee Harwood - Spike Hawkins - Seamus Heaney - John Heath-Stubbs - Adrian Henri - Geoffrey Hill - Philip Hobsbaum - Anselm Hollo - Ted Hughes - Elizabeth Jennings - Brian Jones - David Jones - Philip Larkin - Peter Levi - Christopher Logue - Edward Lucie-Smith - George MacBeth - Norman MacCaig - Hugh MacDiarmid - Roger McGough - George Mackay Brown - Louis MacNeice - Barry MacSweeney - Derek Mahon - Matthew Mead - Christopher Middleton - Adrian Mitchell - Dom Moraes - Edwin Morgan - Edwin Muir - Jeff Nuttall - Stewart Parker - Brian Patten - Sylvia Plath - Peter Porter - Tom Raworth - Peter Redgrove - Jon Silkin - Stevie Smith - Bernard Spencer - Jon Stallworthy - Nathaniel Tarn - Dylan Thomas - D. M. Thomas - Anthony Thwaite - Charles Tomlinson - Rosemary Tonks - Gael Turnbull - Vernon Watkins - David Wevill"]}, {"page": "1971 Whitbread Awards", "response": ["*Geoffrey Hill, Mercian Hymns"]}, {"page": "George Sutherland Fraser", "response": ["A. Alvarez - Kingsley Amis - W. G. Archer - Patricia Avis - Bernard Bergonzi - Thomas Blackburn - Arthur Boyars - Alan Brownjohn - George Bruce - Charles Causley - Robert Conquest - Hilary Corke - Maurice James Craig - Donald Davie - Paul Dehn - Keith Douglas - Lawrence Durrell - D. J. Enright - Iain Fletcher - Roy Fuller - Robert Garioch - David Gascoyne - W. S. Graham - Thom Gunn - J. C. Hall - Michael Hamburger - Jacquetta Hawkes - John Heath-Stubbs - Geoffrey Hill - John Holloway - Elizabeth Jennings - Peter Johnson - Sidney Keyes - Thomas Kinsella - James Kirkup - Philip Larkin - Laurie Lee - Alun Lewis - Christopher Logue - Rob Lyle - George MacBeth - Norman MacCaig - Mairi MacInnes - Ewart Milne - Richard Murphy - Norman Nicholson - Kathleen Nott - Philip Oakes - Jonathan Price - F. T. Prince - Henry Reed - Anne Ridler - W. R. Rodgers - Alan Ross - E. J. Scovell - Tom Scott - Martin Seymour-Smith - John Short - Jon Silkin - Burns Singer - Robin Skelton - Sydney Goodsir Smith - Bernard Spencer - R. S. Thomas - Terence Tiller - Charles Tomlinson - Constantine Trypanis - John Wain - John Waller - Vernon Watkins - Gordon Wharton - Sheila Wingfield - Diana Witherby - David Wright"]}, {"page": "Professor of Poetry", "response": ["Some commentators in Britain supported Padel, attributing the smear campaign in the media to misogyny and networking. \"The old boys have closed in on her\", the poet Jackie Kay stated. On Newsnight Review the poet Simon Armitage and poetry writer Josephine Hart expressed regret about Padel's resignation. \"Ruth's a good person\", Armitage said. \"She dipped a toe in the media whirlpool and it dragged her down. I don't think she should have resigned, she would have been good.\" The election was for a post beginning the first day of Michaelmas Term 2009 hence Padel did not take up office. In the 2010 election she supported Geoffrey Hill.", "On 7 May 2010, the university, having changed its system of voting to embrace online voters, confirmed that Paula Claire, Geoffrey Hill, Michael Horovitz, Steve Larkin, Chris Mann and seven others had been nominated as candidates for the position.", "On 18 June, Geoffrey Hill was declared elected. He received 1,156 votes; the next highest number, 353, went to Michael Horovitz.", "On 19 June 2015, Simon Armitage was elected as Geoffrey Hill’s successor.", "| 44 || bgcolor=\"darkblue\"|- || Geoffrey Hill(1932–2016) || 2010 || 2015 "]}, {"page": "Penguin poetry anthologies", "response": ["Dannie Abse - Drummond Allison - J. C. Ashby - W. H. Auden - George Barker - William Bell - John Betjeman - Thomas Blackburn - Norman Cameron - Roy Campbell - Maurice Carpenter - Charles Causley - Anthony Cronin - Donald Davie - Keith Douglas - Lawrence Durrell - William Empson - Roy Fuller - David Gascoyne - W. S. Graham - Robert Graves - Thom Gunn - Michael Hamburger - John Heath-Stubbs - Brian Higgins - Geoffrey Hill - Ted Hughes - Elizabeth Jennings - Patrick Kavanagh - Sidney Keyes - Philip Larkin - Christopher Logue - Hugh MacDiarmid - Louis MacNeice - Dom Moraes - Edwin Muir - William Plomer - F. T. Prince - Martin Seymour-Smith - C. H. Sisson - Stevie Smith - Dylan Thomas - Anthony Thwaite - Charles Tomlinson - Vernon Watkins", "Kenneth Allott - A. Alvarez - Kingsley Amis - W. H. Auden - George Barker - Patricia Beer - William Bell - John Betjeman - Laurence Binyon - Thomas Blackburn - Edmund Blunden - Norman Cameron - Roy Campbell - Robert Conquest - Hilary Corke - Donald Davie - Cecil Day-Lewis - Walter de la Mare - Lawrence Durrell - T. S. Eliot - William Empson - D. J. Enright - Christopher Fry - Roy Fuller - David Gascoyne - W. S. Graham - Robert Graves - Thom Gunn - John Heath-Stubbs - Geoffrey Hill - John Holloway - Ted Hughes - Aldous Huxley - Elizabeth Jennings - James Joyce - Sidney Keyes - Thomas Kinsella - James Kirkup - Philip Larkin - D. H. Lawrence - Laurie Lee - John Lehmann - Peter Levi - Alun Lewis - Wyndham Lewis - Norman MacCaig - Louis MacNeice - Charles Madge - Jon Manchip White - Harold Monro - Edwin Muir - Norman Nicholson - Wilfred Owen - Sylvia Plath - William Plomer - F. T. Prince - Peter Quennell - Kathleen Raine - Herbert Read - Henry Reed - James Reeves - Anne Ridler - Michael Roberts - W. R. Rodgers - Isaac Rosenberg - Siegfried Sassoon - Francis Scarfe - E. J. Scovell - Jon Silkin - Sacheverell Sitwell - Bernard Spencer - Stephen Spender - Dylan Thomas - Edward Thomas - R. S. Thomas - Anthony Thwaite - Terence Tiller - Charles Tomlinson - Henry Treece - John Wain - Arthur Waley - Rex Warner - Vernon Watkins - Charles Williams - W. B. Yeats - Andrew Young", "Francesco Petrarca - Geoffrey Chaucer - Thomas Wyatt - Henry Howard, Earl of Surrey - Anne Locke - George Gascoigne - Edmund Spenser - Fulke Greville - Philip Sidney - Walter Ralegh - George Chapman - Henry Constable - Mark Alexander Boyd - Samuel Daniel - Michael Drayton - John Davies of Hereford - Charles Best - William Shakespeare - John Davies - John Donne - Ben Jonson - Lord Herbert of Cherbury - William Drummond of Hawthornden - Mary Wroth - Robert Herrick - George Herbert - John Milton - Charles Cotton - Thomas Gray - Charlotte Turner Smith - William Blake - Robert Burns - William Wordsworth - Samuel Taylor Coleridge - Robert Southey - Mary F. Johnson - Leigh Hunt - George Gordon, Lord Byron - Percy Bysshe Shelley - John Clare - John Keats - Hartley Coleridge - Thomas Lovell Beddoes - Elizabeth Barrett Browning - Henry Wadsworth Longfellow - Charles Tennyson Turner - Edgar Allan Poe - Alfred, Lord Tennyson - Robert Browning - Aubrey Thomas de Vere - George Eliot - Frederick Goddard Tuckerman - Matthew Arnold - George Meredith - Dante Gabriel Rossetti - Christina Rossetti - Algernon Charles Swinburne - Thomas Hardy - Robert Bridges - Gerard Manley Hopkins - Emma Lazarus - Oscar Wilde - W. B. Yeats - Ernest Dowson - Edwin Arlington Robinson - Trumbull Stickney - Rupert Brooke - Alice Dunbar-Nelson - Robert Frost - Edward Thomas - Ezra Pound - Elinor Wylie - Siegfried Sassoon - Robinson Jeffers - Marianne Moore - Edwin Muir - T. S. Eliot - John Crowe Ransom - Claude McKay - Archibald MacLeish - Edna St. Vincent Millay - Wilfred Owen - Dorothy Parker - E. E. Cummings - Jean Toomer - Robert Graves - Edmund Blunden - Louise Bogan - Hart Crane - Roy Campbell - Countee Cullen - Patrick Kavanagh - W. H. Auden - Louis MacNeice - Malcolm Lowry - Stephen Spender - Elizabeth Bishop - George Barker - Robert Hayden - John Berryman - Weldon Kees - Dylan Thomas - Margaret Walker - Gwendolyn Brooks - Charles Causley - Robert Lowell - William Meredith - Amy Clampitt - Howard Nemerov - Hayden Carruth - Marie Ponsot - Richard Wilbur - Philip Larkin - Anthony Hecht - Jane Cooper - Donald Justice - James K. Baxter - James Merrill - John Ashbery - W. S. Merwin - James Wright - Donald Hall - Thom Gunn - John Hollander - Adrienne Rich - Derek Walcott - Geoffrey Hill - Sylvia Plath - John Updike - Jean Valentine - Robert Mezey - Grace Schulman - Charles Wright - June Jordan - Judith Rodriguez - Frederick Seidel - John Fuller - Tony Harrison - Les Murray - Charles Simic - Frank Bidart - Seamus Heaney - Stanley Plumly - Billy Collins - Douglas Dunn - Marilyn Hacker - David Huddle - Charles Martin - William Matthews - Louise Glück - Ellen Bryant Voigt - Eavan Boland - J. D. McClatchy - Leon Stokesbury - Star Black - Marilyn Nelson - Bruce Smith - Molly Peacock - Hugh Seidman - Rachel Hadas - Denis Johnson - Sherod Santos - Julia Alvarez - Dana Gioia - Medbh McGuckian - Paul Muldoon - Rita Dove - Mark Jarman - Elizabeth Macklin - Tom Sleigh - Rosanna Warren - David Baker - Phillis Levin - John Burnside - Carol Ann Duffy - Robin Robertson - Karl Kirchwey - Deborah Laser - Jacqueline Osherow - James Lasdun - Kate Light - Joe Bolton - Rafael Campo - Mike Nelson - Daniel Gutstein - Beth Ann Fennelly - Jason Schneiderman"]}, {"page": "Oxford poetry anthologies", "response": ["Thomas Wyatt - Henry Howard, Earl of Surrey - Giles Fletcher - Edmund Spenser - Walter Ralegh - Fulke Greville - Philip Sidney - Arthur Gorges - George Chapman - Henry Constable - Samuel Daniel - Michael Drayton - Joshua Sylvester - William Shakespeare - John Davies of Hereford - Thomas Campion - William Alabaster - Barnabe Barnes - John Davies - John Donne - Richard Barnfield - Lord Herbert of Cherbury - William Drummond - Mary Wroth - William Browne - George Herbert - Thomas Carew - William Habington - Edmund Waller - John Milton - Charles Cotton - Philip Ayres - Aphra Behn - Thomas Edwards - Thomas Gray - Thomas Warton - William Cowper - Anna Seward - Charlotte Turner Smith - John Bampfylde - Mary Robinson - William Lisle Bowles - Helen Maria Williams - Thomas Russell - William Wordsworth - Samuel Taylor Coleridge - Mary Tighe - Robert Southey - Charles Lamb - Walter Savage Landor - Ebenezer Elliott - James Henry Leigh Hunt - George Gordon, Lord Byron - John Keble - Percy Bysshe Shelley - John Clare - George Darley - John Keats - Hartley Coleridge - Thomas Hood - William Barnes - Thomas Lovell Beddoes - Elizabeth Barrett Browning - Henry Wadsworth Longfellow - John Greenleaf Whittier - Charles Tennyson Turner - Edgar Allan Poe - Alfred Tennyson, Lord Tennyson - William Bell Scott - Robert Browning - William Edmondstoune Aytoun - Arthur Hugh Clough - Frederick Goddard Tuckerman - Matthew Arnold - William Cory - William Allingham - Sydney Dobell - George Meredith - Dante Gabriel Rossetti - Christina Rossetti - Samuel Butler - John Leicester Warren - Algernon Charles Swinburne - Augusta Webster - Wilfrid Scawen Blunt - Thomas Hardy - Robert Buchanan - Edward Dowden - Robert Bridges - Ada Cambridge - Gerard Manley Hopkins - Louisa Sarah Bevington - Michael Field - Alice Meynell - Digby Mackworth Dolben - William Ernest Henley - Philip Bourke Marston - Robert Louis Stevenson - Oscar Wilde - Agnes Mary Frances Robinson - Francis Thompson - Mary Coleridge - Laurence Hope - Rudyard Kipling - Arthur Symons - William Butler Yeats - Edwin Arlington Robinson - Robert Frost - Edward Thomas - Siegfried Sassoon - Rupert Brooke - Elizabeth Daryush - Robinson Jeffers - Edwin Muir - John Crowe Ransom - Kenneth Leslie - Archibald MacLeish - Edna St. Vincent Millay - Wilfred Owen - Sylvia Townsend Warner - Aldous Huxley - Robert Graves - Charles Hamilton Sorley - Edgell Rickword - Roy Campbell - Kenneth Slessor - Merrill Moore - Patrick Kavanagh - Norman Cameron - William Empson - W. H. Auden - Alec Derwent Hope - Paul Engle - Malcolm Lowry - Roy Fuller - George Barker - Weldon Kees - Dylan Thomas - Gavin Ewart - Charles Causley - Robert Lowell - John Heath-Stubbs - William Meredith - Edwin Morgan - Richard Wilbur - Donald Davie - Philip Larkin - Louis Simpson - James Merrill - Richard Murphy - Peter Porter - Anthony Thwaite - Derek Walcott - Alan Brownjohn - Alistair Elliott - Geoffrey Hill - George MacBeth - Fleur Adcock - Seamus Heaney - Michael Longley - Derek Mahon - Douglas Dunn - Eavan Boland - Susan Wicks - Christopher Reid - Paul Muldoon - Jane Draycott - Carol Ann Duffy - Alan Jenkins - Jamie McKendrick - Simon Armitage - Alice Oswald", "Joseph Addison – Richard Aldington – Kenneth Allott – Aneirin – Guillaume Apollinaire – Louis Aragon – Matthew Arnold – Herbert Asquith – Margaret Atwood – W. H. Auden – William Edmonstoune Aytoun – Joel Barlow – O. Bernard – Sir John Betjeman – Laurence Binyon – John Peale Bishop – Edmund Blunden – William Lisle Bowles – Rupert Brooke – Robert Browning – George Gordon Noel, Lord Byron – Norman Cameron – Thomas Campbell – May Wedderburn Cannan – Charles Causley – Geoffrey Chaucer – G. K. Chesterton – Joseph P. Clancy – Samuel Taylor Coleridge – John Cornford – Stephen Crane – T. W. H. Crosland – Kevin Crossley-Holland – E. E. Cummings – R. N. Currey – Samuel Daniel – Elizabeth Daryush – Sir William Davenant – Donald Davie – C. Day-Lewis – Daniel Defoe – Paul Dehn – James Dickey – Emily Dickinson – John Donne – Hilda Doolittle – Keith Douglas – Michael Drayton – John Dryden – Douglas Dunn – Richard Eberhart – T. S. Eliot – Ralph Waldo Emerson – Gavin Ewart – James Fenton – Robert Fitzgerald – Ephim Fogel – Carolyn Forché – Robert Frost – Roy Fuller – George Gascoigne – David Gascoyne – Allen Ginsberg – Robert Graves – Julian Grenfell – Thom Gunn – Ivor Gurney – Thomas Hardy – Seamus Heaney – Anthony Hecht – Geoffrey Hill – Homer – Horace – A. E. Housman – Henry Howard, Earl of Surrey – Julia Ward Howe – Ted Hughes – Victor Hugo – Randall Jarrell – Samuel Johnson – David Jones – Sidney Keyes – Galway Kinnell – Rudyard Kipling – Lincoln Kirstein – Stanley Kunitz – Philip Larkin – Laurie Lee – J. B. Leishman – Denise Levertov – Alun Lewis – Sir Richard Lovelace – James Russell Lowell – Robert Lowell – Thomas Babington, Lord Macaulay – George MacBeth – John McCrae – Hugh MacDiarmid – Archibald MacLeish – Louis MacNeice – Allen Mandelbaum – Andrew Marvell – Herman Melville – Robert Mezey – James Michie – Adam Mickiewicz – John Milton – Adrian Mitchell – Marianne Moore – Howard Nemerov – Sir Henry Newbolt – George Orwell – Wilfred Owen – George Peele – Benjamin Perét – Peter Porter – Ezra Pound – F. T. Prince – John Pudney – Herbert Read – Henry Reed – Edgell Rickword – Rihaku – Rainer Maria Rilke – Arthur Rimbaud – T. W. Rolleston – Isaac Rosenberg – Alan Ross – Charles Sackville – Carl Sandburg – Siegfried Sassoon – Dorothy L. Sayers – Vernon Scannell – John Scott – Karl Shapiro – Percy Bysshe Shelley – Simonides – Louis Simpson – Edith Sitwell – W. D. Snodgrass – Charles Sorley – Robert Southey – Bernard Spencer – Stephen Spender – Edmund Spenser – William Stafford – Jon Stallworthy – Wallace Stevens – Allen Tate – James Tate – Alfred, Lord Tennyson – William Makepeace Thackeray – Dylan Thomas – Edward Thomas – James Thomson – Charles Tomlinson – William Tyndale – Fyodor Tyutchev – Virgil – Andrei Voznesensky – Arthur Waley – Edgar Wallace – Sylvia Townsend Warner – Walt Whitman – Richard Wilbur – Charles Wolfe – William Wordsworth – W. B. Yeats"]}, {"page": "List of University of Cambridge people", "response": ["*Geoffrey Hill (Emmanuel)"]}, {"page": "Epanalepsis", "response": ["* Last things first; the slow haul to forgive them ... a telling figure out of rhetoric, | epanalepsis, the same word first and last. — Geoffrey Hill, The Triumph of Love, Section X"]}, {"page": "Christopher Ricks", "response": ["He is known as a champion of Victorian poetry; an enthusiast of Bob Dylan, whose lyrics he has analysed at book length;Michael Gray (2006), The Bob Dylan Encyclopedia, p. 571. a trenchant reviewerA collection is in Reviewery. of writers he considers pretentious (Marshall McLuhan, Christopher Norris, Geoffrey Hartman, Stanley Fish); and a warm reviewer of those he thinks humane or humorous (F. R. Leavis, W. K. Wimsatt, Christina Stead). Hugh Kenner praised his \"intent eloquence\",Hugh Kenner, A Sinking Island: The Modern English Writers, Knopf, New York 1988, p. 245 and Geoffrey Hill his \"unrivalled critical intelligence\".Geoffrey Hill, Collected Critical Writings, OUP, Oxford 2008, p. 379 W. H. Auden described Ricks as \"exactly the kind of critic every poet dreams of finding\".Oxford Book of English Verse, ed. Ricks, OUP 1999 John Carey calls him the \"greatest living critic\".John Carey in conversation with Clive James .", "*Geoffrey Hill and the Tongue's Atrocities (1978)", "* True Friendship: Geoffrey Hill, Anthony Hecht and Robert Lowell Under the Sign of Eliot and Pound (2010)"]}, {"page": "T. S. Eliot Prize", "response": ["*Geoffrey Hill, The Orchards of Syon", "*Geoffrey Hill – Speech! Speech!"]}]}}