{"wiki_id": "http://www.wikidata.org/entity/Q6499384", "itemLabel": "Laura Rossi", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Laura_Rossi", "wikipedia_page": {"main": "Laura Rossi is a British composer of film and concert works. Originally from Devon, she graduated with a master's degree from The London College of Music, having previously studied at the University of Liverpool.", "link_mentions": [{"page": "The Battle of the Somme (film)", "response": ["On 22 October 2006, after a restoration project, a refined version of the film was screened at the Queen Elizabeth Hall in London, accompanied by the Philharmonia Orchestra performing an original orchestral score by Laura Rossi. The restoration was later nominated for an Archive Restoration or Preservation Project award by the Federation of Commercial Audiovisual Libraries. In November 2008, the restored film was released on DVD, to mark the 90th anniversary of the Armistice with Germany in 1918. The DVD included the score by Laura Rossi, an accompanying 1916 musical medley, a commentary by Roger Smither, a film archivist at the Imperial War Museum and interviews with Smither, Rossi, Toby Haggith (film archivist) and Stephen Horne (silent film musician) on the reconstruction of the contemporary medley; film fragments and missing scenes were also included in the DVD.", "* Screenings of the film in 2012 with live soundtrack of Laura Rossi's score"]}, {"page": "Alastair King", "response": ["|Laura Rossi"]}, {"page": "List of women film score composers", "response": ["* Laura Rossi, British"]}, {"page": "Teignmouth Community School", "response": ["* Laura Rossi, composer http://www.laurarossi.com/"]}, {"page": "North Sea Radio Orchestra", "response": ["Despite this, North Sea Radio Orchestra performed several concerts in 2009. On 29 May they performed a free concert in Brixton Library, London, as part of Lambeth Readers and Writers Festival. On 11 July they performed at the 'Les Tombees de la Nuit' Festival in the Opera House in Rennes, Brittany. On 22 October they played at the Union Chapel, London, as part of the Marginalise Concert Series organised by the Arctic Circle label, performing the music of one of their leading influences, Vernon Elliot (arranged by Craig Fortnam and fellow composer Laura Rossi). The playlist featured music from the animated television series The Clangers, Ivor the Engine and Pogles Wood."]}, {"page": "2006 in British music", "response": ["*Laura Rossi - London to Brighton"]}, {"page": "Song for Marion", "response": ["The score was composed by Laura Rossi. Lost In The Multiplex's Soundtrek section deemed Rossi's score \"lovely\", but opined that the OAP'Z songs \"aren't particularly funny, they're not that fun to listen to either.\""]}]}}