{"wiki_id": "http://www.wikidata.org/entity/Q6503936", "itemLabel": "Lawrence Conrad", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Lawrence_Conrad", "wikipedia_page": {"main": "Lawrence Irvin Conrad (born 1949), is a historian of Near Eastern Medicine.", "link_mentions": [{"page": "Heraclius", "response": ["In Muslim tradition he is seen as a just ruler of great piety, who had direct contact with the emerging Islamic forces. The 14th-century scholar Ibn Kathir (d. 1373) went even further, stating that \"Heraclius was one of the wisest men and among the most resolute, shrewd, deep and opinionated of kings. He ruled the Romans with great leadership and splendor.\" Historians such as Nadia Maria El-Cheikh and Lawrence Conrad note that Islamic histories even go so far as claiming that Heraclius recognized Islam as the true faith and Muhammad as its prophet, by comparing Islam to Christianity."]}, {"page": "Medieval medicine of Western Europe", "response": ["The Western medical tradition often traces its roots directly to the early Greek civilization, much like the foundation of all of Western society. The Greeks certainly laid the foundation for Western medical practice but much more of Western medicine can be traced to the Middle East, Germanic, and Celtic cultures. The Greek medical foundation comes from a collection of writings known today as the Hippocratic Corpus.Lawrence Conrad, Michael Neve, Vivian Nutton, Roy Porter, Andrew Wear. The Western Medical Tradition 800 BC to AD 1800. Cambridge University Press, New York, 1995, p16–17 Remnants of the Hippocratic Corpus survive in modern medicine in forms like the \"Hippocratic Oath\" as in to \"Do No Harm\".Nutton, The Western Medical Tradition, p19"]}, {"page": "Sophronius of Jerusalem", "response": ["In his Christmas sermon of 634, Sophronius was more concerned with keeping the clergy in line with the Chalcedonian view of God, giving only the most conventional of warnings of the Saracen advance on Palestine, commenting that the Saracens already controlled Bethlehem. Sophronius, who viewed the Saracen control of Palestine as \"unwitting representatives of God's inevitable chastisement of weak and wavering Christians\",Averil Cameron and Lawrence Conrad died soon after the fall of Jerusalem to the caliph Umar I in 637, but not before he had negotiated the recognition of civil and religious liberty for Christians in exchange for tribute - an agreement known as Umari Treaty. The caliph himself came to Jerusalem, and met with the patriarch at the Church of the Holy Sepulchre. Sophronius invited Umar to pray there, but Umar declined, fearing to endanger the Church's status as a Christian temple.Steven Runciman, A History of the Crusades, vol. 1 The First Crusade (Cambridge: Cambridge University Press, 1987), 3-4."]}, {"page": "Historiography of early Islam", "response": ["In their study of the traditional Islamic accounts of the early conquest of different cities—Damascus and Caesarea in Syria, Babilyn/al-Fusat and Alexandria in Egypt, Tustar in Khuzistan and Cordoba in Spain—scholars Albrecht Noth and Lawrence Conrad find a suspicious pattern whereby the cities \"are all described as having fallen into the hands of the Muslims in precisely the same fashion\". There is a \"traitor who, ... points out a weak spot in the city's fortification to the Muslim besiegers; a celebration in the city which diverts the attention of the besieged; then a few assault troops who scale the walls, ... a shout of Allahu akbar! ... from the assault troops as a sign that they have entered the town; the opening of one of the gates from inside, and the onslaught of the entire army.\" They conclude these accounts can not be \"the reporting of history\" but are instead stereotyped story tales with little historical value. cited in  "]}, {"page": "Plague of Amwas", "response": ["The heavy toll on the indigenous Christian population and increased emigration from Syria as a result of the plague of Amwas may have been a contributing factor in the increased settlement of Syria by the Arabs and their penetration of local society during Umayyad rule (640s–750). According to the historian Lawrence Conrad, the Arabs, relying on revenue from the poll tax collected from the non-Arabs in the conquered regions, may not have intended to settle Syria, but were forced to repopulate the deserted countryside in the aftermath of the plague. The policy of settling Arab tribesmen on the land proved exceptional; in other conquered areas, such as Iraq, early Arab settlement was mostly confined to newly built garrison cities."]}, {"page": "Modern usage of al-Qādisiyyah", "response": ["* Noth, Albrecht (in collaboration with Lawrence Conrad). The Early Arabic historical tradition: A Source-critical study. Translated from German by Michael Bonner. Studies in late antiquity and early Islam, 3. 2nd edition. Princeton: Darwin Press, 1994."]}, {"page": "Wellcome Collection", "response": ["The building foyer and public areas usually include a 1950 work by Pablo Picasso (originally on a wall in John Desmond Bernal's flat in Torrington Square) and one by Anthony Gormley. A figure by Marc Quinn was originally lying unprotected on the stone floor, then moved inside a glass case, and is also not currently on view. The collection includes 17,500 magic-medical amulets, talismans and charms picked up by Henry Wellcome in Islamic North Africa and elsewhere in the world. (citing an article of Lawrence Conrad)."]}, {"page": "Ihsan Abbas", "response": ["Ihsan Abbas (December 2, 1920 – January 29, 2003) was a Palestinian professor at the American University of Beirut,Samir Kassir, Beirut, p. 472. Berkeley: University of California Press, 2010.  and was considered a premier figure of Arabic and Islamic studies in the East and West during the 20th century.\"Eight scholars from around world to be awarded honorary degrees\". The University of Chicago Chronicle, Vol. 13, No. 4, October 14, 1993. The \"author of over one hundred books\",Einboden, J. \"\"Call me Ismā'īl\": The Arabic Moby-Dick of Iḥsān 'Abbās.\" Leviathan, vol. 12 no. 1, 2010, p. 4 during his career, Abbas was renowned as one of the foremost scholars of Arabic language and literature and was a respected literary critic.Suheil Bushrui, \"Jubran Khalil Jubran.\" Taken from \"Essays in Arabic Literary Biography: 1850–1950,\" p. 184. Vol. 3 of Essays in Arabic Literary Biography, Band 17. Eds. Roger M. A. Allen, Joseph Edmund Lowry and Devin J. Stewart. Wiesbaden: Harrassowitz Verlag, 2010.  Upon his death, Abbas was eulogized by University College London historian Lawrence Conrad as a custodian of Arabic heritage and culture, and a figure whose scholarship had dominated the Middle East's intellectual and cultural life for decades.Lawrence Conrad, \"Ihsan Abbas: Custodian of Arabic Heritage and Culture.\" Al-Qantara, vol. xxvi, iss. #1, pp. 5–17. 2005."]}, {"page": "Conrad, Lawrence", "response": ["#redirectLawrence Conrad"]}, {"page": "Lawrence Irvin Conrad", "response": ["#REDIRECT Lawrence Conrad"]}, {"page": "Lawrence I. Conrad", "response": ["#REDIRECT Lawrence Conrad"]}, {"page": "Junada ibn Abi Umayya al-Azdi", "response": ["Junada was held by al-Tabari to have established a permanent Arab garrison in Rhodes, but the colony was frequently blockaded and harassed by Byzantine ships. The garrison remained on the island until the accession of Mu'awiya I's son and successor, Yazid I (), who ordered the Arabs' withdrawal to Syria. The modern historian Lawrence Conrad has dismissed the 670s Arab occupation of Rhodes as a literary artifice by the early Islamic tradition. C. E. Bosworth has also dismissed the episode, in particular the implication that Junada continuously resided on the island during the supposed seven-year duration of the Arab presence as he is mentioned leading land and sea campaigns against Byzantine Anatolia throughout the 670s. The historian Marek Jankowiak has argued that \"there are no grounds to reject\" Junada's occupation of Rhodes."]}]}}