{"wiki_id": "http://www.wikidata.org/entity/Q6503600", "itemLabel": "Lawford Davidson", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Lawford_Davidson", "wikipedia_page": {"main": "Lawford Davidson (1 January 1890 –1964) was a British film actor.He was born Charles Lawford Davidson in London and died in Bedford, Bedfordshire, England, at age 74. He was the first actor to dub another actor's voice, for Hungarian actor Paul Lukas in The Wolf of Wall Street (1929).", "link_mentions": [{"page": "The Patent Leather Kid", "response": ["The Patent Leather Kid is a 1927 American silent drama film which tells the story of a boxer who scoffs at fighting outside the ring...  particularly for the United States once it enters World War I. Eventually, he is drafted, is shipped overseas, and performs a heroic act, which results in his being severely wounded. It stars Richard Barthelmess, Molly O'Day, Lawford Davidson, Matthew Betz, and Arthur Stone.", "* Lawford Davidson as Lt. Hugo Breen"]}, {"page": "James Oliver Curwood", "response": ["* The Country Beyond (1926), a Fox Film Co. production directed by Irving Cummings. Starred Olive Borden, Ralph Graves, Gertrude Astor, J. Farrell MacDonald, Evelyn Selbie, Fred Kohler, Lawford Davidson, Alfred Fisher and Lottie Williams. Based on the Curwood's book of the same title."]}, {"page": "The Mysterious Dr. Fu Manchu", "response": ["*Lawford Davidson as Clarkson (uncredited)"]}, {"page": "Lawford (disambiguation)", "response": ["* Lawford Davidson (1890–1964), British film actor"]}, {"page": "The Vagabond King (1930 film)", "response": ["* Lawford Davidson as Tristan"]}, {"page": "List of American films of 1924", "response": ["|Miami || Alan Crosland || Betty Compson, Lawford Davidson || Drama || Independent"]}, {"page": "List of adventure films of the 1920s", "response": ["|Through Fire and Water||Thomas Bentley||Clive Brook, Flora Le Breton, Lawford Davidson||United Kingdom||Sea adventure"]}, {"page": "A Little Journey", "response": ["* Lawford Davidson as Alfred Demis"]}, {"page": "The Golden Web", "response": ["* Lawford Davidson as George Sisk"]}, {"page": "Ladies Love Brutes", "response": ["*Lawford Davidson as George Winham, Joe Forziati's lawyer"]}, {"page": "The Starlit Garden", "response": ["The Starlit Garden is a 1923 British silent romantic film directed by Guy Newall and starring Newall, Ivy Duke, Lawford Davidson and Mary Rorke. The film is set in Italy and concerns a doomed romance between a ward and her guardian.BFI.org It was made at Beaconsfield Studios.Warren p.11", "* Lawford Davidson as Silas Grangerson "]}, {"page": "Bright Lights (1925 film)", "response": ["* Lawford Davidson as Marty Loftus"]}, {"page": "The Glorious Adventure (1922 film)", "response": ["* Lawford Davidson as Lord Fitzroy "]}, {"page": "The Persistent Lovers", "response": ["* Lawford Davidson - Honorable Ivor Jocelyn"]}, {"page": "The Crimson Circle (1922 film)", "response": ["* Lawford Davidson as Raphael Willings "]}, {"page": "The Lure of Crooning Water", "response": ["* Lawford Davidson as Frank Howard "]}, {"page": "The Garden of Resurrection", "response": ["* Lawford Davidson as Fennell "]}, {"page": "Wildfire (1925 film)", "response": ["*Lawford Davidson as John Duffy"]}, {"page": "Miami (1924 film)", "response": ["* Lawford Davidson as Ransom Tate"]}, {"page": "The Grass Orphan", "response": ["* Lawford Davidson"]}, {"page": "Through Fire and Water", "response": ["Through Fire and Water is a 1923 British silent adventure film directed by Thomas Bentley and starring Clive Brook, Flora le Breton and Lawford Davidson.BFI.org It was based on the 1922 novel Greensea Island by Victor Bridges.", "* Lawford Davidson - Dr. Manning"]}, {"page": "The Great Well", "response": ["The Great Well is a 1924 British silent drama film directed by Henry Kolker and starring Thurston Hall, Seena Owen and Lawford Davidson. It was based on the 1923 play The Great Well by Alfred Sutro.", "* Lawford Davidson - Major Dereth"]}, {"page": "Testimony (1920 film)", "response": ["* Lawford Davidson as Cecil Coram "]}, {"page": "List of British films of 1922", "response": ["| Half a Truth || Sinclair Hill || Lawford Davidson, Miles Mander || Crime ||", "|Running Water||Maurice Elvey||Madge Stuart, Lawford Davidson||Drama||"]}, {"page": "List of British films of 1923", "response": ["|The Little Door Into the World || George Dewhurst || Lawford Davidson, Olaf Hytten || Drama ||"]}, {"page": "The Overland Telegraph", "response": ["The Overland Telegraph is a 1929 American Western silent film directed by John Waters and written by Harry Sinclair Drago, George C. Hull and Edward J. Meagher. The film stars Tim McCoy, Dorothy Janis, Frank Rice, Lawford Davidson, Clarence Geldart and Chief John Big Tree. The film was released on March 2, 1929, by Metro-Goldwyn-Mayer.", "*Lawford Davidson as Briggs"]}, {"page": "The Love Doctor", "response": ["The Love Doctor is a 1929 American comedy film directed by Melville W. Brown and written by Guy Bolton, Herman J. Mankiewicz, and J. Walter Ruben based upon a play by Victor Mapes and Winchell Smith. The film stars Richard Dix, June Collyer, Morgan Farley, Miriam Seegar, Winifred Harris, and Lawford Davidson. The film was released on October 5, 1929, by Paramount Pictures.", "*Lawford Davidson as Preston DeWitt"]}, {"page": "Half a Truth", "response": ["Half a Truth is a 1922 British silent crime film directed by Sinclair Hill and starring Margaret Hope, Lawford Davidson and Miles Mander.Murphy p.294 It was based on a 1911 novel by Eliza Humphreys writing as Rita.", "* Lawford Davidson as Chris Kennaway "]}, {"page": "Running Water (film)", "response": ["Running Water is a 1922 British silent drama film directed by Maurice Elvey and starring Madge Stuart, Lawford Davidson and Julian Royce. The film is an adaptation of A.E.W. Mason's 1906 novel Running Water.Low p.441", "* Lawford Davidson as Capt. Hilary Cheyne  "]}, {"page": "The Truants (film)", "response": ["* Lawford Davidson as Lionel Callam "]}, {"page": "Daredevil's Reward", "response": ["Daredevil's Reward is a 1928 American silent Western film directed by Eugene Forde and written by John Stone. The film stars Tom Mix, Natalie Joyce, Lawford Davidson, Billy Bletcher, Harry Cording, and William Welsh. The film was released on January 15, 1928, by Fox Film Corporation.", "*Lawford Davidson as Foster"]}, {"page": "Blood Will Tell (1927 film)", "response": ["Blood Will Tell is a 1927 American silent Western film directed by Ray Flynn and written by Paul Gangelin. The film stars Buck Jones, Katherine Perry, Lawford Davidson, Bob Kortman, Harry Gripp and Austen Jewell. The film was released on November 13, 1927, by Fox Film Corporation.", "*Lawford Davidson as Jim Cowen"]}, {"page": "Constant Hot Water (film)", "response": ["Constant Hot Water is a 1923 British silent comedy film directed by George A. Cooper and starring Gladys Jennings, John Stuart and Lawford Davidson.Murphy p.121", "* Lawford Davidson as Man  "]}, {"page": "Her Private Affair", "response": ["*Lawford Davidson - Arnold Hartmann"]}, {"page": "Three-Ring Marriage", "response": ["Three-Ring Marriage also known as 3-Ring Marriage is a lostThree Ring Marriage at Lost Film Files: Lost First National films - 1928The Library of Congress / FIAF  American Silent Feature Film Survival Catalog: Three Ring Marriage 1928 American silent drama film directed by Marshall Neilan and starring Mary Astor, Lloyd Hughes, and Lawford Davidson.Lowe p.1850 The AFI Catalog of Feature Films: Three Ring Marriage", "* Lawford Davidson as Souvane  "]}, {"page": "Duke's Son", "response": ["* Lawford Davidson as Charles Denbeigh-Smith  "]}, {"page": "The Little Door Into the World", "response": ["The Little Door Into the World is a 1923 British silent drama film directed by George Dewhurst and starring Lawford Davidson, Nancy Beard and Olaf Hytten.Paietta p.88", "* Lawford Davidson as Lefarge  "]}, {"page": "Burning Daylight (1928 film)", "response": ["*Lawford Davidson as Morton"]}, {"page": "A Rogue in Love", "response": ["* Lawford Davidson as Ray Carrell  "]}, {"page": "Tony Runs Wild", "response": ["Tony Runs Wild is a 1926 American silent Western film directed by Tom Buckingham and starring Tom Mix, Tony the Horse, Jacqueline Logan, Lawford Davidson, Duke R. Lee, and Vivien Oakland. The film was released by Fox Film Corporation on April 18, 1926.", "* Lawford Davidson as Slade"]}, {"page": "Marriage (1927 film)", "response": ["Marriage is a 1927 American drama film directed by Roy William Neill and written by Gertrude Orr and Elizabeth Pickett Chevalier. It is based on the 1912 novel Marriage by H. G. Wells. The film stars Virginia Valli, Allan Durant, Gladys McConnell, Lawford Davidson, Donald Stuart and Frank Dunn. The film was released on February 13, 1927, by Fox Film Corporation.", "*Lawford Davidson as Sir Roderick Dover"]}, {"page": "One Increasing Purpose", "response": ["One Increasing Purpose is a 1927 American drama film directed by Harry Beaumont and written by Bradley King. It is based on the 1925 novel One Increasing Purpose by A. S. M. Hutchinson. The film stars Edmund Lowe, Lila Lee, Holmes Herbert, May Allison, Huntley Gordon and Lawford Davidson. The film was released on January 2, 1927, by Fox Film Corporation.", "*Lawford Davidson as Dr. Byrne"]}, {"page": "The Country Beyond (1926 film)", "response": ["* Lawford Davidson as Henry Harland"]}, {"page": "The Golden Strain", "response": ["The Golden Strain is a 1925 American silent Western film directed by Victor Schertzinger and written by Eve Unsell. The film stars Hobart Bosworth, Kenneth Harlan, Madge Bellamy, Lawford Davidson, Ann Pennington, and Frank Beal. The film was released on December 27, 1925, by Fox Film Corporation.Progressive Silent Film List: The Golden Strain at silentera.com"]}, {"page": "The Sky Raider", "response": ["A mechanic with the French Air Force, Gregg Vanesse (Lawford Davidson) sabotages the aircraft of Capt. Charles Nungesser (Charles Nungesser), France's \"Flying Fiend\", by stuffing the flying insignia from Paul Willard (Walter Miller in the intake manifold. Paul is arrested, put on trial and sentenced to 20 years in a military prison. ", "* Lawford Davidson as Gregg Vanesse "]}, {"page": "Back to Life (1925 film)", "response": ["Back to Life is a 1925 American silent war drama film directed by Whitman Bennett and starring Patsy Ruth Miller, David Powell, and Lawford Davidson.Progressive Silent Film List: Back to Life at silentera.comMunden p. 34"]}, {"page": "The Passionate Friends (1922 film)", "response": ["* Lawford Davidson as Guy Ladislaw "]}]}}