{"wiki_id": "http://www.wikidata.org/entity/Q650815", "itemLabel": "Brandon Hurst", "itemDescription": "English actor (1866-1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Brandon_Hurst", "wikipedia_page": {"main": "Brandon Hurst (30 November 1866 – 15 July 1947) was an English stage and film actor.\n\n", "link_mentions": [{"page": "1947", "response": ["** Brandon Hurst, American stage, screen veteran (b. 1866)"]}, {"page": "The House of Rothschild", "response": ["* Brandon Hurst as Stock Trader"]}, {"page": "Franz Liszt", "response": ["Liszt's character was portrayed by Claudio Arrau in Dreams of Love (1935); by Brandon Hurst in the 1938 film Suez; by Fritz Leiber in the 1943 film Phantom of the Opera; by Stephen Bekassy in the 1945 film A Song to Remember; by Henry Daniell in the 1947 film Song of Love; by Sviatoslav Richter in the 1952 film Glinka – The Composer; by Will Quadflieg in Max Ophüls's 1955 film Lola Montès; by Carlos Thompson in the 1955 film Magic Fire; by Dirk Bogarde in the 1960 film Song Without End; by Jeremy Irons in the 1974 BBC Television series Notorious Woman; by Roger Daltrey in the 1975 Ken Russell film Lisztomania; by Anton Diffring in the 1986 Franco-German film Wahnfried directed by Peter Patzak; and by Julian Sands in the 1991 British-American film Impromptu.Mitchell, Charles P. The Great Composers on Film, 1913 through 2002. Jefferson, North Carolina: McFarland, 2004, pp. 57, 293."]}, {"page": "Road to Morocco", "response": ["* Brandon Hurst as English announcer"]}, {"page": "The Thief of Bagdad (1924 film)", "response": ["* Brandon Hurst as The Caliph"]}, {"page": "Mrs. Parkington", "response": ["* Brandon Hurst as Footman (uncredited)"]}, {"page": "List of fictional doctors", "response": ["|House of Frankenstein || Dr. Gustav NiemannDr. Geissler || Boris KarloffBrandon Hurst"]}, {"page": "Bright Eyes (1934 film)", "response": ["* Brandon Hurst as Higgins, the Smythes' butler "]}, {"page": "White Zombie (film)", "response": ["White Zombie is a 1932 American pre-Code horror film independently produced by Edward Halperin and directed by Victor Halperin. The screenplay by Garnett Weston, based on The Magic Island by William Seabrook, is about a young woman's transformation into a zombie at the hands of an evil voodoo master. Bela Lugosi stars as the zombie master \"Murder\" Legendre, with Madge Bellamy appearing as his victim. Other cast members include Joseph Cawthorn, Robert W. Frazer, John Harron, Brandon Hurst, and George Burr MacAnnan.Staff (August 6, 1932) Variety. p.15Billing order per film opening credits", "* Brandon Hurst as Silver, Beaumont's butler"]}, {"page": "The Hunchback of Notre Dame (1923 film)", "response": ["The Hunchback of Notre Dame is a 1923 American drama film starring Lon Chaney, directed by Wallace Worsley, and produced by Carl Laemmle and Irving Thalberg. The supporting cast includes Patsy Ruth Miller, Norman Kerry, Nigel de Brulier, and Brandon Hurst. The film was Universal's \"Super Jewel\" of 1923 and was their most successful silent film, grossing $3.5 million."]}, {"page": "Claude Frollo", "response": ["Victor Hugo's novel has been adapted to film on numerous occasions. Due to policy of the NAMPI Thirteen Points, the filmmakers of the 1923 film adaptation would not portray a member of the Roman Catholic Church in a negative and controversial light. As a result, Claude Frollo (played by Nigel de Brulier) is not the villain, but instead a good-hearted archdeacon of Notre Dame, and the villain of the film is actually his younger brother Jehan (played by Brandon Hurst). The 1939 film had a similar change for the same reason due to policy of the Hays Production Code; the only difference is that Jehan (played by Sir Cedric Hardwicke) is portrayed as King Louis XI's Chief Justice of Paris, and Claude (played by Walter Hampden) is portrayed as the Archbishop of Paris. In Disney's 1996 animated film, Claude Frollo (voiced by Tony Jay) is Paris' judge/Minister of Justice and the villain as in the novel, the Archdeacon of Notre Dame is a separate character entirely (and voiced by David Ogden Stiers), and the character of Jehan is omitted."]}, {"page": "The Adventures of Mark Twain (1944 film)", "response": ["* Brandon Hurst as Ralph Waldo Emerson (uncredited) "]}, {"page": "Kidnapped (1938 film)", "response": ["* Brandon Hurst as Doomster "]}, {"page": "Jane Eyre (1943 film)", "response": ["* Brandon Hurst as Trustee"]}, {"page": "Dr. Jekyll and Mr. Hyde (1920 Paramount film)", "response": ["Henry Jekyll (John Barrymore) is a doctor of medicine living and working in London in the late 1880s. When he is not treating the poor in his free clinic, he is in his laboratory experimenting. Sir George Carew (Brandon Hurst), the father of Jekyll’s fiancé Millicent (Martha Mansfield), is suspicious of the young doctor’s intentions and often irritated by his tardiness and highmindedness. \"No man\", Carew observes, \"could be as good as he looks.\"Quotations of dialogue in this page's summary of the plot are transcribed from the 1920 film's intertitles. Following dinner one evening, Carew taunts his prospective son-in-law in front of their mutual friends and debates with him about the causes and effects of a person's personality, insisting that every man is fundamentally composed of two \"selves\" who are in continual conflict. \"A man cannot destroy the savage in him by denying its impulses\", instructs Carew. \"The only way to get rid of a temptation is to yield to it.\"", "* Brandon Hurst as Sir George Carewe"]}, {"page": "Cavalcade (1933 film)", "response": ["* Brandon Hurst as Actor (uncredited)"]}, {"page": "The Blue Bird (1940 film)", "response": ["* Herbert Evans and Brandon Hurst as Footmen"]}, {"page": "Stanley and Livingstone", "response": ["*Brandon Hurst as Sir Henry Forrester"]}, {"page": "Annie Laurie (1927 film)", "response": ["* Brandon Hurst as The Campbell Chieftain"]}, {"page": "List of actors who have played multiple roles in the same film", "response": ["* Brandon Hurst as Merlin and Doctor in Mansion in A Connecticut Yankee (1931)"]}, {"page": "The Great John L.", "response": ["*Brandon Hurst as Valet (uncredited)"]}, {"page": "The Lost Patrol (1934 film)", "response": ["* Brandon Hurst as Corporal Bell"]}, {"page": "Sherlock Holmes (1932 film)", "response": ["*Brandon Hurst - Secretary to Erskine"]}, {"page": "The Man Who Laughs (1928 film)", "response": ["* Brandon Hurst as Barkilphedro"]}, {"page": "High Society Blues", "response": ["*Brandon Hurst as Jowles"]}, {"page": "Love (1927 American film)", "response": ["* Brandon Hurst as Senator Alexei Karenin"]}, {"page": "John Ford Stock Company", "response": ["Brandon Hurst – 7 films"]}, {"page": "The Man in Half Moon Street", "response": ["* Brandon Hurst as Simpson-Butler"]}, {"page": "The Woman in Red (1935 film)", "response": ["* Brandon Hurst as Uncle Emlen Wyatt"]}, {"page": "The Green Years (film)", "response": ["*Brandon Hurst as Bookseller"]}, {"page": "Annie Oakley (1935 film)", "response": ["* Brandon Hurst as Doctor (uncredited)"]}, {"page": "Wee Willie Winkie (film)", "response": ["* Brandon Hurst as Bagby"]}, {"page": "The Princess and the Pirate", "response": ["* Brandon Hurst as Mr Pelly"]}, {"page": "Lightnin' (1925 film)", "response": ["* Brandon Hurst as Everett Hammond"]}, {"page": "The Shamrock Handicap", "response": ["* Brandon Hurst as The Procurer of Taxes (uncredited)"]}, {"page": "Suez (film)", "response": ["*Brandon Hurst as Franz Liszt"]}, {"page": "Rhythm on the River", "response": ["*Brandon Hurst as Bates"]}, {"page": "List of incomplete or partially lost films", "response": ["|| The Lady || Frank Borzage || Norma Talmadge, Wallace MacDonald, Brandon Hurst || Reel two (of eight) is missing from the Library of Congress archive. ||"]}]}}