{"wiki_id": "http://www.wikidata.org/entity/Q6502705", "itemLabel": "Lavington Glyde", "itemDescription": "Australian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Lavington_Glyde", "wikipedia_page": {"main": "Lavington Glyde (24 April 1823 – 31 July 1890)\n \nwas a Treasurer of South Australia.Glyde was born on 24 April 1823 in Exeter, Devon. England, and emigrated to South Australia in 1847. Ten years later he entered the South Australian Legislative Assembly, in which he sat in every parliament from the first to the tenth inclusive. From 1857 to 1860 he represented East Torrens, from March 1860 to May 1875 Yatala, and from May 1877 to April 1884 Victoria. He was Treasurer in the Francis Dutton Ministry in July 1863, and Minister of Lands on four occasions: from July 1863, to July 1864, October to November 1865, May 1867 to September 1868, and October to November 1868, in the first Henry Ayers, the first John Hart, and the fourth and fifth Ayers Ministries respectively. Mr. Glyde was Treasurer in Arthur Blyth's Government from July 1873 to May 1875, and again in John Bray's Government from June 1881 to April 1884.Glyde subsequently retired from public life, and in October 1885 accepted the Accountancy to the Court of Insolvency, a position he held till his death, which took place at Kensington, Adelaide on 31 July 1890. With the one exception of Sir Arthur Blyth, Mr. Glyde had been a Minister of the Crown for a longer term of years than any other South Australian politician. He was a singularly able debater, and his Budget speeches and financial addresses generally were models of clearness.", "link_mentions": [{"page": "Marryatville, South Australia", "response": ["The Kensington line was the first of several trams in Adelaide, firstly horse-drawn (1878) and later electrified. There was a tram terminus in Marryatville, near the home of state Treasurer Lavington Glyde, who often travelled home with fellow politicians Wentworth Cavenagh and Sir Edwin Smith."]}, {"page": "Lavington", "response": ["*Lavington Glyde (1825–1890), Treasurer of South Australia"]}, {"page": "Glyde", "response": ["* Lavington Glyde (1825–1890), South Australian politician, perhaps not related to Samuel and William"]}, {"page": "Members of the South Australian House of Assembly, 1857–1860", "response": ["| Lavington Glyde won the resulting by-election on 6 October 1857."]}, {"page": "Members of the South Australian House of Assembly, 1862–1865", "response": ["|| Lavington Glyde || Yatala || 1857–1875, 1877–1884"]}, {"page": "Members of the South Australian House of Assembly, 1865–1868", "response": ["|| Lavington Glyde || Yatala || 1857–1875, 1877–1884"]}, {"page": "Members of the South Australian House of Assembly, 1868–1870", "response": ["|| Lavington Glyde || Yatala || 1857–1875, 1877–1884"]}, {"page": "Members of the South Australian House of Assembly, 1870–71", "response": ["|| Lavington Glyde || Yatala || 1857–1875, 1877–1884"]}, {"page": "Members of the South Australian House of Assembly, 1871–1875", "response": ["|| Lavington Glyde || Yatala || 1857–1875, 1877–1884"]}, {"page": "Members of the South Australian House of Assembly, 1875–1878", "response": ["|| Lavington Glyde   || Yatala, Victoria || 1857–1875, 1877–1884", ": The two members for Yatala, Wentworth Cavenagh and Lavington Glyde, both resigned on 6 May 1875. Both men recontested the resulting by-election, which saw Cavenagh returned but Glyde defeated by Thomas Cowan.", ": Victoria MHA John Ingleby resigned on 11 April 1877. Lavington Glyde won the resulting by-election on 17 May."]}, {"page": "List of people from Exeter", "response": ["*Lavington Glyde (1824-1890), South Australian politician and accountant"]}, {"page": "List of South Australian House of Assembly by-elections", "response": ["|Lavington Glyde", "|Lavington Glyde", "|Lavington Glyde"]}, {"page": "Treasurer of South Australia", "response": ["|align=center|  || data-sort-value=\"Glyde\" | Lavington Glyde ||  || 4 Jul 1863 || 15 Jul 1863", "|align=center|  || data-sort-value=\"Glyde\" | Lavington Glyde ||  || 22 Jul 1873 || 25 May 1875", "|align=center|  || data-sort-value=\"Glyde\" | Lavington Glyde ||  || 24 Jun 1881 || 23 Apr 1884"]}, {"page": "Political families of South Australia", "response": ["Any relation to Lavington Glyde (1825–1890) MHA for East Torrens 1857–1860, Yatala 1860–1875, Victoria 1877–1884 ?"]}, {"page": "William Everard (South Australian politician)", "response": ["*associated with Lavington Glyde, Abraham Abrahams, and other gentlemen in working the well-known Talisker Mine", "*From 22 July 1873 to 3 June 1875, Everard was Commissioner of Crown Lands and Immigration in the Arthur Blyth Ministry. His other colleagues in that Ministry, at various times, were the Crown Solicitor (Hon. C. Mann, Q.C.), Mr. Justice Bundey, and the Hons. J. C. Bray, G. C. Hawker, H. E. Bright, and Lavington Glyde."]}, {"page": "Electoral district of Victoria", "response": ["| rowspan=2 | Lavington Glyde"]}, {"page": "Thomas Cowan (South Australian politician)", "response": ["In 1875, Cowan nominated and was elected to the Electoral district of Yatala.  However, the result was ruled invalid when his nomination papers were declared informal.  However, he was subsequently elected along with Wentworth Cavenagh in a re-election triggered by the resignation of one of the sitting members, the Hon. Lavington Glyde.'The Nominations', The South Australian Advertiser (Adelaide, SA ), Friday 14 May 1875, page 3, , retrieved 30/08/2012.'Abstract of News', South Australian Register (Adelaide, SA), Thursday 20 May 1875, page 6, , retrieved 30/08/2012.   Cowan did not re-stand for election in 1878.'The representation of Gumeracha', The South Australian Advertiser (Adelaide, SA), Thursday 28 March 1878, page 6, , retrieved 30/08/2012."]}, {"page": "Electoral district of Yatala", "response": ["| rowspan=2|Lavington Glyde "]}, {"page": "Electoral district of East Torrens", "response": ["| rowspan=2|Lavington Glyde"]}, {"page": "Members of the South Australian House of Assembly, 1878–1881", "response": ["|| Lavington Glyde || Victoria || 1857–1875, 1877–1884"]}, {"page": "Members of the South Australian House of Assembly, 1881–1884", "response": ["|| Lavington Glyde || Victoria || 1857–1875, 1877–1884"]}, {"page": "John Ingleby (Australian politician)", "response": ["He was elected to the House of Assembly at the 1875 election, but resigned after only two years, stating that he preferred to focus on campaigning for the division of pastoral lands into smaller properties than carrying out the duties of a member of parliament. His brother Rupert nominated for the resulting by-election, but was very narrowly defeated by Lavington Glyde."]}, {"page": "Robert Kay (librarian)", "response": ["On 1 June 1859 he has appointed secretary to the Board of Governors of the South Australian Institute (which then consisted of (later Sir) Samuel Davenport, the Rev. Dean Farrell, John Howard Clark and (later the Hon.) Lavington Glyde). With 200 books he instituted what became the Adelaide Circulating Library, exchanging boxes of books with the various Institutes in the suburbs and districts further out. This system was soon adopted by the other States of Australia and overseas."]}, {"page": "William Dening Glyde", "response": ["William Dening Glyde married ; they lived at the corner of Ruthven Street (now Glyde Street, named for him) and Howard Street,Warburton, Elizabeth, The Paddocks Beneath, p. 255. (Glyde Street, Glen Osmond was named for the possibly unrelated Lavington Glyde). North Kensington. Their family included:", "W. D Glyde's newspaper obituary mentions that \"(they) landed in January, 1867, and were welcomed by relatives\". It is possible Lavington Glyde was such a relation."]}, {"page": "First Dutton Ministry", "response": ["|| Lavington Glyde MHA"]}, {"page": "First Ayers Ministry", "response": ["|| Lavington Glyde MHA"]}, {"page": "Hundred of Glyde (Northern Territory)", "response": ["The Hundred of Glyde was named after Lavington Glyde, a parliamentarian in South Australia. The Hundred also includes Fog Bay, Northern Territory."]}, {"page": "Glyde Point, Northern Territory", "response": ["Glyde Point is located on land on the south coast of the  Clarence Strait which overlooks the Vernon Islands.  This locality is named after the point of the same name which was named in the 1860s possibly after Lavington Glyde, a former member of the South Australian Parliament.  Its boundaries and name were gazetted on 4 April 2007."]}, {"page": "J. D. Woods", "response": ["Woods was dismissed from the service in March 1861 by Commissioner Hay, who appointed Benjamin Boothby in his place. Several MPs, notably Lavington Glyde, demanded to see the documents relating to his sacking and, having them tabled, moved in June that the House find the reasons given (unproven allegations of dishonest collusion between England and Woods to benefit contractor Gouge, and Woods' \"pert\" response to the accusation) as insufficient for such action. The motion was lost on party lines."]}]}}