{"wiki_id": "http://www.wikidata.org/entity/Q6504215", "itemLabel": "Lawrence James Baker", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Lawrence_James_Baker", "wikipedia_page": {"main": "Lawrence James Baker (4 January 1827 – 10 June 1921) was an English stockbroker and a Liberal politician who sat in the House of Commons from 1885 to 1886.\nBaker was born in London, a son of Capt John Law Baker of the Madras Army, and his wife Caroline Elizabeth Browne. Privately educated he became a stockjobber.  By 1855 he was senior partner of Baker & Sturdy of Copthall House, EC., and by appointment to Queen Victoria.  He was made a trustee of the London Stock Exchange. Expert in foreign bond dealings, he sat on the Peruvian Bondholder's Committee with Liberal colleague, and former cabinet minister, George Shaw-Lefevre.  The City of London was responsible for the funds of several Latin American emerging economies; their decisions saved several governments from anarchy and bankruptcy.  Baker was a generous benefactor: a donor to charity, a supporter of early free Council houses, and a free trade national liberal, cutting taxes for the poor, free education, disestablishment of the Church of England, and reform of the House of Lords.\nBaker was living at Haydon Hall in Eastcote but bought Ottershaw Park in 1885.Baker was a candidate at least twice at Guildford and Worcester, before being chosen for Frome at short notice in September 1885, on the retirement through illness of Sir Henry Samuelson.  In the 1885 general election, Baker was elected Member of Parliament for Frome.  In the Liberal Unionist furore with Joseph Chamberlain's group, he lost his selection for Frome, replaced by G B Samuelson, a local candidate.  But the son, G B Samuelson lost the seat in the 1886 general election to the  Conservative Party candidate Lord Weymouth. He later stood for parliament unsuccessfully in Chertsey. At by-elections in 1892 he lost to Charles Harvey Combe. When Combe resigned, Baker stood again in 1897. This time Henry Currie Leigh-Bennett was victorious. In 1898 he became High Sheriff of Surrey.  He built cottages in Bonsey's Lane at Ottershaw but sold the estate in 1910, after he had  put it up for auction unsuccessfully in 1907. He moved for three years to Brantridge Park, Balcome, West Sussex.  In 1910 he settled at Brambridge Park, Twyford, Hampshire where he died at the age of ninety-four.\nBaker married firstly Ellen Catherine Thompson in 1857. His second wife Susan Taylor he married in 1871 at All Saints Church, Kensington, SW. Lawrence had fourteen children, seven by each marriage.", "link_mentions": [{"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| Lawrence James Baker"]}, {"page": "Frome (UK Parliament constituency)", "response": ["| Lawrence James Baker"]}, {"page": "Laurence Baker", "response": ["* Lawrence James Baker (1827–1921), Queen Victoria' Stock-jobber"]}, {"page": "Baker (surname)", "response": ["*Lawrence James Baker (1827–1921), Queen Victoria's Stock-jobber"]}, {"page": "Haydon Hall", "response": ["Under the ownership of Lawrence James Baker from 1864, the house was expanded with two wings, and several cottages for workers were built within the grounds. Baker also had Eastcote Lodge built within the estate, which his son and daughter-in-law moved into after their marriage.", "Lawrence James Baker of the London Stock Exchange bought the house and grounds in 1864 and had two additional wings added. Baker had several new cottages built for workers within the grounds, designed by Harold Ainsworth Peto of Eastcote House and Ernest George. Peto's sister, Helen Agnes Peto, married Baker's son, Lawrence Ingham Baker. The newly married couple moved into Eastcote Lodge, built within the grounds and designed by Peto and George.Bowlt 1994, p.34", "After Lawrence James Baker moved to Ottershaw Park in Chertsey in the 1880s, he let out Haydon Hall to Captain Bennett-Edwards from 1886. Captain Bennett-Edwards and his wife, a novelist, opened the grounds for flower shows, and established a cricket ground for the Eastcote Cricket Club. The house was later bought by Mrs Bennett-Edwards. After her death in 1936, the Ruislip-Northwood Urban District Council and Middlesex County Council bought the house and grounds, intending to make it the new civic centre. The outbreak of the Second World War delayed the conversion work, and following a long period of deterioration, the house was eventually demolished in 1967.Bowlt 1994, p.35 The grounds were retained for the public and continue to be used by Eastcote Cricket Club.Ruislip, Northwood and Eastcote Local History Society 1984, p.20"]}]}}