{"wiki_id": "http://www.wikidata.org/entity/Q6506961", "itemLabel": "Le Gendre Starkie", "itemDescription": "British politician (1799-1865)", "wikipedia_url": "https://en.wikipedia.org/wiki/Le_Gendre_Starkie_(1799%E2%80%931865)", "wikipedia_page": {"main": "Le Gendre Nicholas Starkie (1 December 1799 – 15 May 1865 (Padiham)) was an English landowner and politician who sat in the House of Commons from 1826 to 1830.\nStarkie was the son of Le Gendre Piers Starkie (1760–1807) and his wife Charlotte Preedy, daughter of Rev. Benjamin Preedy, Rector of Brington, Northamptonshire. He was educated at Brasenose College, Oxford.\nHe inherited a large amount of land in central Lancashire, including Huntroyde Hall, after the early death of his elder brother. He was a J.P. for Lancaster and Yorkshire and Deputy Lieutenant for the Palatine of Lancaster. He was a Captain in the Craven Legion.In 1826 Starkie was elected Member of Parliament for Pontefract. He held the seat until 1830. He was Provincial Grand Master and Grand Superintendent of the Freemasons of West Lancashire from 1827 till his death. He bought Ashton Hall from the Dukes of Hamilton in 1853.\nStarkie died at Huntroyde Hall, Padiham, Lancashire, at the age of 65. He had married Anne Chamberlain, daughter of Abraham Chamberlain of Rylstone, Yorkshire at Burnley in February 1827. Their son Le Gendre inherited the Huntroyde estate and was later MP for Clitheroe, and John inherited the Ashton estate and was MP for Lancashire North East.", "link_mentions": [{"page": "Padiham", "response": ["*Le Gendre Starkie (1799–1865) and Le Gendre Starkie (1828–1899), landowners at Huntroyde"]}, {"page": "Pontefract (UK Parliament constituency)", "response": ["| Le Gendre Starkie || Tory"]}, {"page": "Huntroyde Hall", "response": ["The plan documents the major building program commenced for Le Gendre Starkie (c.1735–1792). In 1777 a wing was constructed extending  west from the south-west corner of the building. It was constructed in the Georgian style in ashlar sandstone with sash windows and a hipped roof. Alterations were made to the west end of the old hall to connect it to the new. Around 1789 the old outbuildings were replaced with a servants' wing, fully enclosing that side of the courtyard. The exterior was given ornamental battlements and sash windows replacements. In early 19th century images of the hall is another wing extending west from the 1777 extension. It mirrors the old hall and added balance when viewed from the south. This wing was replaced in 1850. The new building contained a library, entrance hall supported by marble pillars and a smoking room.", "Piers expanded the family's landholdings further with the estates of Rogerstead in the Heaton area of Bolton (1726), Shuttleworth in Hapton (1734), Snydale, Westhoughton (1744), Coldcoats, Pendleton, Sunderland, Balderstone (1756), Lovely, Salesbury (1757), and (Great) Mearley in Mearley (1758). However he died childless in 1760 and left the estate to his cousin's son Le Gendre Starkie (c.1735–1792), after which is passed to Le Gendre's son, Le Gendre Piers Starkie (1760–1807), who was High Sheriff of Lancashire in 1806. The Starkie's were major landowners in Heyhouses (now part of Sabden) from at least 1787 and in 1801 Le Gendre Piers Starkie purchased the remaining portion.  Over Pendleton Moor, Little Pendleton was purchased in 1807 and Wymondhouses in two lots in 1809 and 1811. Both these estates neighbour Coldcoats.", "The estate was then inherited by the latter's son Le Gendre Starkie (1790–1822), High Sheriff in 1815 and after his early death by his younger brother Le Gendre Nicholas Starkie (1799–1865), Member of Parliament for Pontefract from 1826 to 1832 and a prominent Freemason, being Provincial Grand Master for the Western Division of Lancashire. His son, Le Gendre Nicholas Starkie (1828–1899), was High Sheriff in 1868 and MP for Clitheroe from 1853 to 1856. Also a prominent Freemason, he was Provincial Grand Master for the Eastern Division of Lancashire from 1870 to 1899.The History of the Provincial Grand Lodge of East Lancashire In 1876 Kempnough Hall was sold to the Bridgewater Trustees. Rogerstead was sold to the Bolton Corporation in 1879, becoming one of the town's cemeteries. Hall i' th' Wood was sold in 1899, becoming a museum.", "He left the estate to his son Edmund Arthur Le Gendre Starkie (1871–1958). Edmund served as Captain in the Boer War and was a local promoter of the Red Cross and St John's Ambulance Brigade and by 1914 had developed parts of the Huntroyde grounds into a major tree plantation. He allowed Huntroyd to be used as a hospital for convalescent soldiers during the First World War. After Edmund's death in 1958, the estate passed to his nephew, Guy Le Gendre Starkie (1909–1985). ", "* Le Gendre Starkie (1799–1865)", "* Le Gendre Starkie (1828–1899)"]}, {"page": "Le Gendre Starkie (1799-1865)", "response": ["#REDIRECT Le Gendre Starkie (1799–1865) "]}, {"page": "Le Gendre Starkie", "response": ["Le Gendre Starkie  may refer to:", "* Le Gendre Starkie (1799–1865), MP for Pontefract 1826–1830", "* Le Gendre Starkie (1828–1899), MP for Clitheroe 1853–1857"]}, {"page": "Ashton Hall", "response": ["In 1853, the hall was sold by the Dukes of Hamilton to Le Gendre Nicholas Starkie of the wealthy Starkie family of Huntroyde Hall and in 1856 was largely rebuilt to a design by William Le Gendre Starkie. The only part of the 14th century structure that still remains is the tower that now forms the southern wing of the hall.", "After Le Gendre Starkie's death Ashton passed to his younger son, John Piers Chamberlain Starkie who passed it in turn to his eldest son Edward Arthur Le Gendre Starkie. He sold it in 1884 to James Williamson, the linoleum manufacturer, who owned the hall until his death in 1930, but lived elsewhere. Williamson was High Sheriff of Lancashire for 1885 and on his elevation to the peerage took his title Baron Ashton of Ashton. After his death in 1931 the major portion of the estate was purchased by William Pye and his sons."]}]}}