{"wiki_id": "http://www.wikidata.org/entity/Q6500514", "itemLabel": "Laurence Calvert", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/Laurence_Calvert", "wikipedia_page": {"main": "Laurence Calvert  (16 February 1892 – 6 July 1964) was an English recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.\nCalvert was 26 years old, and a sergeant in the 5th Battalion, King's Own Yorkshire Light Infantry, British Army during the First World War when, on 12 September 1918 at Havrincourt, France at the Battle of Havrincourt, the following deed took place for which he was awarded the VC.  The full citation was published in a supplement to the London Gazette of 12 November 1918 (dated 15 November 1918):\nWar Office, 15th November, 1918.\nHis Majesty the KING has been graciously pleased to approve of the award of the Victoria Cross to the undermentioned Officers, Noncommissioned Officers and Men: —\n[...]\nNo. 240194 Sgt. Laurence Calvert, M.M.. K.O.Y.L.I. (Conisbro').\nFor most conspicuous bravery and devotion to duty in attack when the success of the operation was rendered doubtful owing, to severe enfilade machine-gun fire. Alone and single-handed Sjt. Calvert, rushing forward against the machine-gun team, bayoneted three and shot four.\n\nHis valour and determination in capturing single-handed two machine guns and killing the crews thereof enabled the ultimate objective to be won. His personal gallantry inspired all ranks.\nHe was also awarded the Military Medal (MM), and the Belgian Order of Leopold (with palm), in the grade of Chevalier.", "link_mentions": [{"page": "List of English Victoria Cross recipients", "response": ["| Laurence Calvert || British Army || 1918 || First World War || Havrincourt"]}, {"page": "Battle of Havrincourt", "response": ["Sergeant Laurence Calvert was awarded the Victoria Cross for his actions during the battle."]}, {"page": "King's Own Yorkshire Light Infantry", "response": ["The 1/4th and 1/5th Battalions landed at Boulogne-sur-Mer as part of the 3rd West Riding Brigade in the West Riding Division in April 1915 for service on the Western Front. The 2/4th and 2/5th Battalions landed at Le Havre as part of the 187th Brigade in the 62nd (2nd West Riding) Division in January 1917 also for service on the Western Front. Lt-Col Oliver Watson commanding 5th KOYLI was awarded the Victoria Cross (VC) posthumously for his actions at Rossignol Wood on 27 March 1918, and Sergeant Laurence Calvert of the same battalion was awarded the VC for actions at the Battle of Havrincourt (2 September 1918).Laurie Magnus, The West Riding Territorials in the Great War, London: Keegan Paul, Trench, Trubner, 1920//Uckfield: Naval & Military Press, 2004, , pp. 215–6. Corporal Ernest Hayes, who was awarded three Military Medals in 1918 for acts of bravery on the Western Front, served with the 2/4th Battalion."]}, {"page": "List of people from Leeds", "response": ["* Laurence Calvert VC, MM - recipient of the Victoria Cross in 1918"]}, {"page": "Calvert (name)", "response": ["* Laurence Calvert (1892–1964), English recipient of the Victoria Cross"]}, {"page": "5th Battalion, King's Own Yorkshire Light Infantry", "response": ["The division then reverted to British command for the Allied Hundred Days Offensive, beginning with the Second Battle of Bapaume, when it effectively exploited a pre-dawn attack by 2nd Division on 25 August. 5th Battalion KOYLI was prominent in driving the Germans out of Mory, taking many prisoners. The division then attacked again in the afternoon of 29 August behind a creeping barrage.Blaxland, p. 208.Griffiths, Table 9, p. 146.Magnus, p. 212. It continued with the Battle of the Drocourt-Quéant Line (2 September) and then advanced to the Hindenburg Line to participate in the Battle of Havrincourt on 12 September. 187 Brigade attacked on the right of the division, supported by heavy artillery, and within an hour of zero was sending back batches of prisoners. Four officers and 80 men had been captured at a strongpoint by Sergeant Laurence Calvert, MM, of 5th KOYLI, who had rushed the enemy machine gun teams single-handed, bayonetting three and shooting four. Calvert was also awarded the VC.Blaxland, p. 223.Magnus, pp. 215–6.", "* Sgt Laurence Calvert at Havrincourt, 12 September 1918"]}]}}