{"wiki_id": "http://www.wikidata.org/entity/Q6515286", "itemLabel": "Lee Thorpe", "itemDescription": "English footballer (born 1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lee_Thorpe", "wikipedia_page": {"main": "Lee Anthony Thorpe (born 14 December 1975) is an English former professional footballer and youth development coach for Blackpool.\nAs a player he was a forward from 1994 to 2011. He made over 400 appearances, in a career spanning 18 years, in the Football League with Blackpool, Lincoln City, Leyton Orient, Grimsby Town, Bristol Rovers, Swansea City, Peterborough United, Torquay United, Rochdale and Darlington. Whilst with Blackpool, he also had a loan spell with Northern Irish top-flight club Bangor, and finished his career in non-league football with Fleetwood Town and AFC Fylde.", "link_mentions": [{"page": "Keith Alexander (footballer)", "response": ["On 3 May 2002 Lincoln successfully petitioned to go into administration but the financial crisis would leave the first team squad bereft of players as the day saw five senior players – Jason Barnett, Grant Brown, David Cameron, Steve Holmes and Justin Walker – released at the end of their contracts with a sixth, Lee Thorpe, departing for Leyton Orient. A hectic day finished with confirmation of Alexander's official appointment as team manager. Three other senior players, Tony Battersby, Kingsley Black, and Ian Hamilton, would later leave the club by mutual consent as their contracts, including appearance money, had made them too expensive for Alexander's plans."]}, {"page": "Scott Wiseman", "response": ["Wiseman made his Rochdale debut, where he made his first start and played for 75 minutes, in a 0–0 draw against Grimsby Town in the opening game of the season. In a match against Luton Town on 22 November 2008, he set up a goal for Lee Thorpe to score the opener, in a 2–0 win. With seventeen appearances made so far, Wiseman was rewarded with a contract extension, keeping until the end of the season. After missing a game, due to an injury, Wiseman made his return, only to be sent-off, just 31 minutes to the game, in a 4–1 loss against Exeter City on 20 December 2008. Despite suffering an injury as the season came to an end, he finished his first season at the club, making thirty-four appearances in all competition. At the end of the 2008–09 season, Wiseman was released by the club."]}, {"page": "List of Grimsby Town F.C. players", "response": ["|align=\"left\"|Lee Thorpe||||FW||2004||6||0"]}, {"page": "Craig Pead", "response": ["Pead's father worked as a kit man at Coventry City. Whilst players at Brentford, Pead shared a flat in Feltham with Lee Thorpe. After his retirement from football in 2009, Pead returned to the West Midlands and opened Soccer Rockz, a youth football coaching school. He later worked as Business Development Manager for BPMpro, as a personal trainer and as an FA-registered intermediary."]}, {"page": "Dean Oliver (footballer)", "response": ["Oliver was born in Derby and joined Sheffield United as a trainee. He was released by Derby County when he was a youngster prior to signing with Sheffield United. Whilst at United he was in need of first team experience and was loaned, first to Hednesford Town in January 2007 and then to Torquay United on 1 March 2007. His league debut came on 10 March 2007 when he replaced Lee Thorpe as a late substitute in the 3–0 win at home to Wycombe Wanderers. However, this was his only appearance for Torquay before being recalled by Sheffield United on 24 April 2007, with Torquay already relegated to the Conference National."]}, {"page": "Ross Montague", "response": ["After spells away on loan at Conference South clubs Sutton United and Welling United, Montague made his first appearance of the 2007–08 season as a 71st-minute substitute for Lee Thorpe during a 1–0 win over Lincoln City on 27 October 2007. He replaced Thorpe in the starting lineup under new manager Andy Scott in December 2007 and held onto his place until the end of January 2008. Montague scored his only senior goal for the club in a 3–0 win over Chester City on 29 December 2007. Despite suffering a season-ending back injury in February 2008, the one-year option on Montague's contract was taken up in April 2008. After returning to fitness in August 2008, he managed just two appearances during the early months of the 2008–09 season, before suffering a season-ending cruciate ligament injury while training in December 2008. Montague's contract expired in June 2009, but he was invited to train with the club during the 2009–10 pre-season and prove he was fit enough to be awarded a new contract. Montague elected to leave the club in late August 2009 and made 16 appearances and scored one goal during just over two years as a first team player at Griffin Park."]}, {"page": "Gavin Gordon (footballer)", "response": ["A youth player at Hull City, Gordon became the second youngest player to ever play for them when he came on as a substitute against Coventry City in the Football League Cup. But he struggled to ever establish himself at Hull and was allowed to leave and join Lincoln City for £30,000 in November 1997 where he formed a very effective strike partnership with Lee Thorpe. His scoring feats at Lincoln lead Cardiff City\"Gordon signs for Cardiff\" BBC Sport Retrieved on 9 January 2008 to pay £550,000 for him in December 2000, with the amount due to rise depending on appearances\"Gordon deal depends on Jamaica\" BBC Sport Retrieved on 9 January 2008 but he never reached the required amount. He made his debut for the Bluebirds on New Year's Day and found the net with a header during a 6–1 victory over Exeter City, but the rest of his season was spent on the treatment table with persistent back problems. The same injury ruled him out of a large part of the following year, although one of the matches he did manage to play in was a Football League Trophy match against Rushden & Diamonds which ended in a 7–1 victory for Cardiff with Gordon finding the net five times."]}, {"page": "2006–07 Torquay United F.C. season", "response": ["* 28 June: Striker Lee Thorpe has his contract terminated by mutual consent and joins Brentford five days later"]}, {"page": "2003–04 Grimsby Town F.C. season", "response": ["|33 ||  Lee Thorpe || Leyton Orient || 26 || Loan"]}]}}