{"wiki_id": "http://www.wikidata.org/entity/Q6519848", "itemLabel": "Leila Berg", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Leila_Berg", "wikipedia_page": {"main": "Leila Berg (12 November 1917 – 17 April 2012) was an English children's author. She was also known as a journalist and a writer on education and children's rights. Berg was a recipient of the Eleanor Farjeon Award.", "link_mentions": [{"page": "April 17", "response": ["*2012 – Leila Berg, English journalist and author (b. 1917)"]}, {"page": "List of children's literature writers", "response": ["*Leila Berg (1917–2012) – Nippers series"]}, {"page": "1917 in literature", "response": ["*November 12 – Leila Berg, English children's author and education writer (died 2015)"]}, {"page": "1950 in literature", "response": ["*Leila Berg – The Adventures of Chunky (first in the Chunky series)"]}, {"page": "Wivenhoe", "response": ["Wivenhoe was also the home of actress Joan Hickson (1906–1998) who played Miss Marple in the BBC adaptations of Agatha Christie's novels and  children's author, journalist, and writer Leila Berg (1917–2012). Berg was an advocate for the empowerment of children, particularly through literature, which prompted her to devise and launch the 'Nippers' series of early readers books published by Macmillan in 1968, which sought to address the exclusion of working-class and ethnic minority lives from children's books."]}, {"page": "Education Otherwise", "response": ["*Leila Berg"]}, {"page": "1917 in the United Kingdom", "response": ["* 12 November – Leila Berg, children's author (died 2012)"]}, {"page": "Eleanor Farjeon Award", "response": ["* 1974, Leila Berg"]}, {"page": "Michael Duane", "response": ["The case became well known largely due to the publication of, Risinghill: Death of a Comprehensive School by Leila Berg in 1968.", "*Risinghill: Death of a Comprehensive School, Leila Berg, Penguin Books ", "*Leila Berg - Journalist and a writer on education and children's rights"]}, {"page": "Risinghill School", "response": ["The school's methods prompted criticism in the media and disputes with the London County Council. The school was closed down in 1965, ostensibly because it had become unpopular with parents.Risinghall Revisited - Michael Duane (1915 – 1997)Risinghill: Death of a Comprehensive School, Leila Berg, Penguin Books ", "A book chronicling the school's demise made publishing history in 1968 by becoming the UK's first non-fiction best-seller. Risinghill: Death of a Comprehensive School catapulted the author, Leila Berg, to fame, along with Risinghill's progressive headmaster, Michael Duane. "]}, {"page": "Jewish Quarterly-Wingate Prize", "response": ["*Leila Berg, Flickerbook (Granta)"]}, {"page": "2012 in literature", "response": ["*April 17 – Leila Berg, English children's writer and activist (born 1917)"]}, {"page": "2012 in the United Kingdom", "response": ["* 17 April – Leila Berg, children's author (born 1917)"]}, {"page": "Gerald Rose", "response": ["* The Little Car by Leila Berg, Methuen, 1972)"]}, {"page": "Deaths in April 2012", "response": ["*Leila Berg, 94, British children's author."]}, {"page": "List of early Puffin Story Books", "response": ["|PS 124||Little Pete Stories||Leila Berg||Henrietta Garland||1959||", "|PS 148||Four Feet and Two: An Anthology of Verse||Leila Berg (ed.)|| Shirley Burke and Marvin Bileck||1960|| "]}, {"page": "Communist Party of Great Britain", "response": ["* Leila Berg"]}, {"page": "Penguin Education", "response": ["The series also included titles about schooling in Britain, such as The Pre-School Years, Juniors, Education for a Change, Learner Teacher, Young Teachers and Reluctant Learners and The Multi-Racial School. There were books about radical experiments such as R.F. Mackenzie's State School, Leila Berg's Look at Kids, David Wills’ Spare the Child, David Head's Free Way to Learning and  Neill and Summerhill: A Man and His Work: A Pictorial Study by John Walmsley; and others on controversial topics such as Peter Newell's  A Last Resort? Corporal Punishment in Schools."]}, {"page": "List of Jackanory episodes", "response": ["|990|| My Dog Sunday || Leila Berg || Jim Dale || 08-Sep-70"]}, {"page": "Olive Kendon", "response": ["Olive Miriam Kendon (1897–1977) was an English educator and social activist, founder of the Children's House Society. She is known as one of the pioneers of the experimental concept of children's communities. Leila Berg wrote in 1971 \"I remember Olive Kendon beaming when someone in a conference coffee-bar happily described her as 'an elderly juvenile delinquent'.\""]}, {"page": "Nippers (book series)", "response": ["Nippers was a children's book series for early readers established by Leila Berg and published by Macmillan Educational in the United Kingdom from 1968 to 1983. The series deliberately featured working-class characters and settings.", "* Leila Berg, A Day Out. 1968. Nippers - Red ; Level 1. Illustrated by Ferelith Eccles Williams. ", "* Leila Berg, Bouncing. 1971. Nippers - Red ; Level 1. Illustrated by Margaret Belsky. ", "* Leila Berg, Finding a Key. 1968. Nippers - Red ; Level 1. Illustrated by Jenny Williams. ", "* Leila Berg, Fish and Chips for Supper. 1968. Nippers - Red ; Level 1. Illustrated by Richard Rose. ", "* Leila Berg, Grandad’s Clock. 1976. Nippers - Red ; Level 1. Illustrated by Joan Beales. ", "* Leila Berg, Jimmy’s Story. 1968. Nippers - Orange ; Level 2. Illustrated by Richard Rose. ", "* Leila Berg, Julie’s Story. 1970. Nippers - Orange ; Level 2. Illustrated by Richard Rose. ", "* Leila Berg, Lesley’s Story. 1970. Nippers - Orange ; Level 2. Illustrated by Richard Rose. ", "* Leila Berg, Letters. 1970. Nippers - Red ; Level 1. ", "* Leila Berg, Paul’s Story. 1970. Nippers - Orange ; Level 2. Illustrated by Richard Rose. ", "* Leila Berg, Plenty of Room. 1975. Nippers - Red ; Level 1. Illustrated by Joan Beales. ", "* Leila Berg, Robert’s Story. 1970. Nippers - Orange ; Level 2. Illustrated by Richard Rose. ", "* Leila Berg, Susan’s Story. 1970. Nippers - Orange ; Level 2. Illustrated by Richard Rose. ", "* Leila Berg, The Jumble Sale. 1968. Nippers - Red ; Level 1. Illustrated by George Craig. ", "* Leila Berg, Tracy’s Story. 1972. Nippers - Orange ; Level 2. Illustrated by Richard Rose.", "* Leila Berg, The Doctor. 1972. Little Nippers Book 8. Illustrated by Biro. ", "* Leila Berg, Doing the Pools. 1972. Little Nippers Book 2. Illustrated by Richard Rose. ", "* Leila Berg, Hospital Day. 1972. Illustrated by Shirley Hughes. ", "* Leila Berg, Knitting. 1972. Illustrated by George Him. 0333131223", "* Leila Berg, My Brother. 1972. Illustrated by Linda Birch. Little Nippers Book 6. ", "* Leila Berg, Put the Kettle On!. 1972. Illustrated by John Dyke. Little Nippers Book 4. ", "* Leila Berg, That Baby!. 1972. Little Nippers Book 1. Illustrated by Margaret Belsky. ", "* Leila Berg, Well I Never!. 1972. Little Nippers Book 3. Illustrated by George Him. ", "* Leila Berg, A Band in School. 1975. Illustrated by John Dyke. ", "* Nippers | Leila Berg, author & story-teller", "* Little Nippers books written and edited by Leila Berg"]}]}}