{"wiki_id": "http://www.wikidata.org/entity/Q6513054", "itemLabel": "Lee Bell", "itemDescription": "British footballer (born 1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lee_Bell", "wikipedia_page": {"main": "Lee Bell (born 26 January 1983) is an English former professional footballer who last played as a midfielder for Macclesfield Town, on loan from Burton Albion.\nHe began his career at Crewe Alexandra, also representing Burton Albion, Mansfield Town and Macclesfield Town, before returning in succession to Crewe, Burton Albion and latterly Macclesfield Town on loan from Burton. Bell retired from playing in the summer of 2015, aged 32, and rejoined Crewe as under-18s coach, later (January 2017) becoming under-18s manager.", "link_mentions": [{"page": "Crewe Alexandra F.C.", "response": ["| Lee Bell"]}, {"page": "Alsager", "response": ["* Lee Bell (born 1983 in Alsager) is an English former professional footballerSoccerBase Database  retrieved December 2017 who last played as a midfielder for Macclesfield Town, on loan from Burton Albion."]}, {"page": "Burton Albion F.C.", "response": ["* 2013   Lee Bell"]}, {"page": "Michael O'Connor (footballer, born 1987)", "response": ["O'Connor was spotted by Crewe Alexandra scouts as a young teenager playing youth football in Northern Ireland. In 2004, shortly after he turned 16, he signed scholarship terms. He was a prominent member of the Alexandra youth team that reached the semi-final of the 2004 FA Youth Cup and he later captained the side.Mixu ponders Hibs bid for Crewe star O'Connor Scotsman.com, 24 April 2009 In July 2005 he signed a three-year professional contract. On 25 February 2006, aged 18, he made his Championship debut at Gresty Road when he came on as a late substitute for Gareth Taylor in a 2–1 win over Brighton & Hove Albion. He made his second senior appearance for the \"Railwaymen\" in the club's final game of the 2005–06 season against Millwall on 30 April 2006, replacing Lee Bell at half-time he went on to set up two goals and hit the post with his one shot. He began the 2006–07 season as a regular first team player for Crewe, now in League One, under manager Dario Gradi. He scored his first senior goal on 22 August, in the League Cup, with a \"fierce shot\" from 18-yards in a 3–0 victory over Grimsby Town. In all he made 34 appearances during the campaign."]}, {"page": "David Artell", "response": ["In June 2010, Artell signed a two-year contract with Crewe Alexandra after joining on a free transfer. He said that the chance to work closely with manager Dario Gradi excited him, and that Gradi's status as a renowned coach convinced him to join the club. Artell was immediately appointed as co-captain, alongside Lee Bell and Ashley Westwood. In March 2011, he had a minor bust-up with Gradi after he was substituted during a home win over Chesterfield."]}, {"page": "Alsager School", "response": ["* Lee Bell, footballer"]}, {"page": "Jacques Maghoma", "response": ["He was the club's top scorer for the season, with 18 goals from 50 appearances, became the first Burton Albion player to be named in the PFA League Two Team of the Year, placed sixth in the poll of League Two managers to choose the division's player of the year, received the club's Players' Player of the Season award, and was runner-up to Lee Bell as Supporters' Player of the Season. With his contract due to expire and interest reported from Championship clubs, it became clear that Maghoma would be leaving. Manager Gary Rowett said he and his ability to \"[come] up with a little bit of magic more often than not\" would be a big loss."]}]}}