{"wiki_id": "http://www.wikidata.org/entity/Q6514122", "itemLabel": "Lee Jamieson", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Lee_Jamieson", "wikipedia_page": {"main": "Lee Jamieson (born 14 December 1977) is an English author, journalist and lecturer.\n\n", "link_mentions": [{"page": "Peter Brook", "response": [":– Lee Jamieson, Antonin Artaud: From Theory to Practice, Greenwich Exchange, 2007"]}, {"page": "Theatre of Cruelty", "response": ["Similarly, cruelty does not refer to an act of emotional or physical violence. According to scholar Nathan Gorelick, Cruelty is, more profoundly, the unrelenting agitation of a life that has become unnecessary, lazy, or removed from a compelling force. The Theatre of Cruelty gives expression to everything that is ‘crime, love, war, or madness' in order to ‘unforgettably root within us the ideas of perpetual conflict, a spasm in which life is continually lacerated, in which everything in creation rises up and asserts itself against our appointed rank.For Artaud, cruelty is not exclusively sadism or causing pain, but just as often a violent, physical determination to shatter a false reality. He believed that text had been a tyrant over meaning, and advocated, instead, for a theatre made up of a unique language, halfway between thought and gesture. Artaud described the spiritual in physical terms, and believed that all theatre is physical expression in space.Evidently, Artaud's various uses of the term cruelty must be examined to fully understand his ideas. Lee Jamieson has identified four ways in which Artaud used the term cruelty. First, it is employed metaphorically to describe the essence of human existence.Artaud's second use of the term (according to Jamieson), is as a form of discipline. Although Artaud wanted to \"reject form and incite chaos\" (Jamieson, p. 22), he also promoted strict discipline and rigor in his performance techniques. A third use of the term was 'cruelty as theatrical presentation'. The Theatre of Cruelty aimed to hurl the spectator into the centre of the action, forcing them to engage with the performance on an instinctive level. For Artaud, this was a cruel, yet necessary act upon the spectator, designed to shock them out of their complacency:Artaud wanted to put the audience in the middle of the 'spectacle' (his term for the play), so they would be 'engulfed and physically affected by it'. He referred to this layout as being like a 'vortex' – a constantly shifting shape – 'to be trapped and powerless'. He also placed a great emphasis on sound rather than words or dialogue, by incorporating loud cries, screams, eerie sounds, or noises causing the audience to become uncomfortable. Words were an insufficient medium of expression."]}, {"page": "The Seashell and the Clergyman", "response": ["Although accounts differ, it seems that Artaud disapproved of Dulac's treatment of his scenario. The film was overshadowed by Un chien andalou (An Andalusian Dog, 1929), written and directed by Luis Buñuel and Salvador Dalí. Un chien andalou is considered the first surrealist film, but its foundations in The Seashell and the Clergyman have been all but overlooked. However, the iconic techniques associated with surrealist cinema are all borrowed from this early film. In Lee Jamieson's analysis of the film, the surrealist treatment of the image is clear. He writes: The Seashell and the Clergyman penetrates the skin of material reality and plunges the viewer into an unstable landscape where the image cannot be trusted. Remarkably, Artaud not only subverts the physical, surface image, but also its interconnection with other images. The result is a complex, multi-layered film, so semiotically unstable that images dissolve into one another both visually and 'semantically', truly investing in film's ability to act upon the subconscious.\"Lee Jamieson \"The Lost Prophet of Cinema: The Film Theory of Antonin Artaud\" in Senses of Cinema, Issue 44, July 2007"]}, {"page": "Closet screenplay", "response": ["Lee Jamieson's article \"The Lost Prophet of Cinema: The Film Theory of Antonin Artaud\"Jamieson, Lee. “The Lost Prophet of Cinema: The Film Theory of Antonin Artaud\" Senses of Cinema 44 (27 August 2007). discusses Artaud's three Lesescenarios (listed below) in the context of his \"revolutionary film theory.\" And in French Film Theory and Criticism: 1907–1939,Abel, Richard. French Film Theory and Criticism: 1907–1939 (Princeton UP, 1993) Richard Abel lists the following critical treatments of several of the Surrealist \"published scenario texts\" (36) listed in the example section below:"]}, {"page": "Lee jamieson", "response": ["#REDIRECT Lee Jamieson"]}]}}