{"wiki_id": "http://www.wikidata.org/entity/Q6514407", "itemLabel": "Lee Lawrence", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Lee_Lawrence", "wikipedia_page": {"main": "Lee Lawrence (born Julius Leon Sirota, 1 September 1920 – 25 February 1961) was a British singer who was popular in the 1950s.\nHe was born in Salford.  Both his parents sang with the Carl Rosa Opera Company, and at the age of 16 he went to Italy to study opera for three years.  After returning to England, he enlisted in the Royal Tank Regiment and sang with the Entertainments National Service Association (ENSA), where he was noticed after the end of the war by BBC radio producer Roy Spear.  He sang on Spear's programme Beginners Please, and made many appearances with other bands including those of Stanley Black, Sydney Lipton, and Cyril Stapleton.He made his first recordings for Decca Records in the late 1940s. His songs included \"How Can You Buy Killarney\", \"Song of Capri\", \"So Ends My Search For My Dream\", all in 1949; \"The World is Mine Tonight\" (his theme song) in 1950; \"With These Hands\", \"A Beggar in Love\", and \"Vanity\" in 1951; \"At Last, At Last\" and \"The Man in the Black Sombrero\" in 1952; \"Crying in the Chapel\" in 1953; and \"Suddenly There's a Valley\" in 1955.  By late 1951, he was being promoted as \"Britain's outstanding singing star\", and topped the bill at the Shepherds Bush Empire above radio comedian Peter Sellers and (at the foot of the bill) Morecambe and Wise.  According to the official UK Singles Chart, which started in 1953, his only chart hits were \"Crying in the Chapel\" (No.7 in 1953) and \"Suddenly There's a Valley\" (No.14 in 1955).He was a popular attraction on the British variety circuit in the early and mid 1950s, and had his own series on Radio Luxembourg in 1955.   After losing popularity to rock and roll performers in Britain, and failing to have a hit with the song \"Rock'n'Roll Opera\" which parodied such singers as Elvis Presley, Gene Vincent and Tommy Steele, he moved in 1957 to the US, where he performed cabaret shows in the Catskills \"Borscht Belt\".  He died in February 1961 of a heart attack at the age of 40, while touring in the West Indies.", "link_mentions": [{"page": "Here in My Heart", "response": ["Prior to Martino's recording reaching number one on the UK Singles Chart, the song had already become a number one hit on the UK's sheet music sales chart. It spent eight weeks at the top of this chart, beginning on October 25, 1952. The song had first charted on September 6, with Martino's recording, issued in July, being the first one available in the UK. Subsequent cover versions available in the UK were mostly recorded by British artists: Issy Bonn (with Eddie Calvert on trumpet), Larry Day, Dennis Lotis, David Hughes, Victor Silvester and his Ballroom Orchestra, Lee Lawrence, Eve Boswell and Harry Secombe. The only other American recording available in the UK was by Dick Haymes and The Andrews Sisters."]}, {"page": "Suddenly There's a Valley", "response": ["*In the United Kingdom, a 1955 version by Petula Clark became a Top Ten hit in the UK Singles Chart. It was her third hit single. It competed in the chart with a version by Lee Lawrence, which peaked at No. 14."]}, {"page": "List of Decca Records artists", "response": ["* Lee Lawrence"]}, {"page": "Crying in the Chapel", "response": ["\"Crying in the Chapel\" is a song written by Artie Glenn for his son Darrell to sing. According to Cliff Glenn, Artie Glenn's oldest grandson, Artie had written the song in 1951 but left it in a drawer for two years, until Darrell recorded it while still in high school in 1953, along with Artie's band the Rhythm Riders. The song was rejected by Hill and Range Songs and Acuff-Rose Music. The song was eventually published by Valley Publishers which also released the single featuring Darrell Glenn. It became a local hit and then it went nationwide. The original version of the song (Valley V-11) was issued in June 1953.Coming Up in the Trade. Country & Western. Billboard, May 23, 1953, p. 138  Darrell Glenn's original recording reached number one on the Cash Box chart (where all versions were amalgamated) and number six on Billboard. Glenn's version also hit number six on the Billboard pop singles chart and number four on the Billboard country and western chart, Rex Allen's number eight, The Orioles' number 11, Ella Fitzgerald number 15, and Art Lund reached number 23.Joel Whitburn's Pop Memories 1890-1954  Lee Lawrence took his version to number 7 in the United Kingdom.", "* Lee Lawrence recorded a version which peaked at No. 7 in the UK Singles Chart in 1953."]}, {"page": "List of contestants from the UK national selection for the Eurovision Song Contest", "response": ["| Lee Lawrence"]}, {"page": "List of UK top-ten singles in 1953", "response": ["|Lee Lawrence", "|align=\"left\"|Lee Lawrence"]}, {"page": "List of songs about Paris", "response": ["* \"Lights of Paris\" by Lee Lawrence"]}, {"page": "1961 in British music", "response": ["*26 February – Lee Lawrence, singer, 40 (heart attack)"]}, {"page": "List of UK top-ten singles in 1954", "response": ["|align=\"left\"|Lee Lawrence"]}, {"page": "With These Hands (song)", "response": ["*Lee Lawrence featuring Bruce Campbell and His Orchestra, on his 1983 album Fascination"]}]}}