{"wiki_id": "http://www.wikidata.org/entity/Q6513423", "itemLabel": "Lee Daggett", "itemDescription": "English cricketer (born 1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lee_Daggett", "wikipedia_page": {"main": "Lee Daggett (born 1 October 1982, Bury) is an English former cricketer who played for Warwickshire, Leicestershire and Northants as a  right-arm medium-pace bowler and a right-handed batsman.", "link_mentions": [{"page": "List of Durham University people", "response": ["* Lee Daggett – Cricketer"]}, {"page": "2006 English cricket season", "response": ["The next week included seven Championship matches, with leaders Sussex taking on third-placed Lancashire at Old Trafford. Lancashire, with a game in hand, were trailing by 30 points before this, but closed the gap to 14 after taking advantage of a first-innings lead of 99. Sajid Mahmood then took five of Sussex' ten wickets as they were bowled out for 166, and Lancashire took a nine-wicket win inside two days.Lancashire v Sussex in 2006, scorecard from CricketArchive, retrieved 16 June 2006 However, due to Hampshire's 299-run win over Nottinghamshire, Lancashire remained third, but still with a game in hand over the two teams ahead. Warwickshire came back from a 151-run first innings deficit against Durham,  with Trevor Frost and Heath Streak putting on 119 for the ninth wicket and then Frost adding a further 20 with Lee Daggett. Those stands upped the target to 159, and Daggett then took six for 30 as Durham were bowled out for 141.Warwickshire v Durham in 2006, scorecard from CricketArchive, retrieved 16 June 2006 The final game in Division One saw Middlesex get out of the relegation zone temporarily, as they bowled Yorkshire out for 130 in the third innings of the game and then chased down the target with eight wickets in hand.Middlesex v Yorkshire in 2006, scorecard from CricketArchive, retrieved 16 June 2006"]}, {"page": "Adam Soilleux", "response": ["While studying for his degree in Banking Finance and Management at Loughborough University, Soilleux made his first-class debut for Loughborough MCCU against Northamptonshire in 2011.  In this match, he was dismissed for three runs in Loughborough's first-innings by David Lucas, while in their second-innings he scored six runs, before being dismissed by Lee Daggett. With the ball, he took the wickets of Niall O'Brien and Alex Wakely in Northamptonshire's first and only innings, in what was a drawn match.  This remains his only first-class appearance."]}, {"page": "Lewis Hill (cricketer, born 1990)", "response": ["Educated at Hastings High School and John Cleveland College in Hinckley, Hill has played Second XI cricket for Leicestershire since 2009. During the 2012 season, Hill was selected as part of the Unicorns squad for the 2012 Clydesdale Bank 40. He made his List A debut during the competition against Northamptonshire at Sir Paul Getty's Ground, Wormsley. He was dismissed for a golden duck in the match by Lee Daggett, with Northamptonshire winning by 8 wickets. However in his next outing for the Unicorns against Warwickshire he made an impressive 35 before being dismissed by Chris Wright. "]}, {"page": "List of Warwickshire County Cricket Club players", "response": ["* Lee Daggett (2006–2008) : L. M. Daggett (12)"]}]}}