{"wiki_id": "http://www.wikidata.org/entity/Q6514503", "itemLabel": "Lee McEvilly", "itemDescription": "Professional footballer (born 1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lee_McEvilly", "wikipedia_page": {"main": "Lee Richard McEvilly (born 15 April 1982) is a footballer who plays as a striker. Although born in England, he won one cap for the Northern Ireland national team in 2002 and also played for Northern Ireland at under-21 and under-23 levels.\nMcEvilly had a  journeyman career, starting with non-League side Burscough, rising through their youth ranks to the senior side, where he made 49 league appearances, scoring 28 goals. In December 2001, Third Division club Rochdale signed him for £20,000. From 2004 to 2009 he had spells in the Conference National and League Two with Accrington Stanley, Cambridge United and Wrexham. Since 2009, McEvilly has struggled with injuries and has had brief spells at numerous non-league clubs in England and Wales, as well as a brief period at League of Ireland side Sligo Rovers in 2010, which was also cut short due to injury. Since 2013, McEvilly has continued playing for amateur and semi-professional teams in the lower levels of non-league.", "link_mentions": [{"page": "Denis Smith (footballer, born 1947)", "response": ["Smith turned down the managerial role at Blackpool to remain in place at Wrexham for 2005–06. He signed goalkeeper Michael Ingham, defenders David Bayliss and Lee Roche, and strikers Lee McEvilly and Jonathan Walters, whilst blooding brothers Marc and Mike Williams. However, Wrexham struggled in the league, despite on loan striker Matt Derbyshire scoring 10 goals in 16 appearances. They finished the season 13th in League Two, having won only one of their last nine matches. The last match of the season was a 1–1 draw with former club Oxford, which hastened Oxford's relegation out of the Football League."]}, {"page": "Burscough F.C.", "response": ["During this period the club had a youth development programme game and one graduate, 19-year-old Lee McEvilly, signed for Rochdale in December 2001 for a club record £20,000 fee. Within 116 days of signing McEvilly had won full international honours for Northern Ireland against Spain.", "* Lee McEvilly"]}, {"page": "Portal talk:Northern Ireland", "response": ["9 Lee McEvilly"]}, {"page": "Northern Ireland national under-21 football team", "response": ["|style=\"text-align:left;\"|Lee McEvilly"]}, {"page": "Rory Patterson", "response": ["Patterson played junior football in his native Northern Ireland before becoming a trainee with Rochdale. Turning professional in the 2002 close season, Patterson's first team debut came in October 2002 as an 86th-minute substitute for Gareth Griffiths as Rochdale lost 1–0 at home to Bury in the Football League Trophy. He made his league debut the following month, again as a substitute, this time in the 64th minute for Lee McEvilly, as Rochdale lost 2–0 away to Oxford United. He made a further seven appearances, all in the Football League that season. Nine first team appearances came the following season, with Patterson released by Rochdale, despite being voted their 'Young Player of the Year'."]}, {"page": "2004–05 Football Conference", "response": ["|10||align=left| Lee McEvilly ||align=left| Accrington Stanley ||15|| 0 || 0 || 2 || 0 || 17"]}, {"page": "2008 Conference Premier play-off Final", "response": ["|CF ||28||Lee McEvilly"]}, {"page": "2009–10 Stevenage Borough F.C. season", "response": ["Stevenage faced Barrow in the final on 8 May 2010. Stevenage lost the match 2–1 after extra–time. Despite taking an early lead through Andy Drury's curling effort, Stevenage were faced with an uphill task after having David Bridges sent–off midway through the first half. Barrow pressed for an equaliser; and subsequently scored ten minutes from time – substitute Lee McEvilly heading the ball home unmarked in the area. Jason Walker scored the winner in extra–time with a curling strike."]}, {"page": "David Hamilton (footballer)", "response": ["Hamilton's first coaching job came in the 1994–95 season, when Eric Whalley appointed him team coach at Accrington Stanley. In late January 1995, he moved to become a coach at Preston North End. After leaving Preston, he was handed the role of player-assistant manager at Great Harwood Town. However, he left in 1996 when the manager was sacked as the club struggled in the league. In 1997, after a playing spell with Mossley, he was appointed youth team manager at Rochdale. He stayed at Rochdale for five years, during which time he was promoted to the position of assistant manager and had two spells as caretaker manager of the side; in 1999, following the departure of Graham Barrow, and in 2001 after Jamie Hoyland left. He managed Rochdale for eight matches in total, winning two matches, losing two and drawing four. While at Rochdale he uncovered Northern Ireland international Lee McEvilly, who was playing for Burscough part-time while working at McDonald's."]}, {"page": "2008–09 Cambridge United F.C. season", "response": ["|Lee McEvilly"]}, {"page": "2010 FA Trophy Final", "response": ["Barrow began the second-half brightly, creating plenty of chances; Stevenage had a few chances, however Barrow seemed to apply more and more pressure. On 79 minutes, substitute Lee McEvilly placed a header into the bottom right corner of Chris Day's net. Barrow exerted more and more pressure from then onwards, until 90 minutes when Borough keeper Day suffered an injury and was replaced by Ashley Bayes. Deep into added time when extra time seemed likely, Robin Hulbert went in for a challenge with his elbow, meaning the referee had no choice but to show red. Stevenage substitute Charlie Griffin had a huge amount of blood coming from his face, there was no way he could continue. They had already used all three subs, meaning the extra time was played 10 against 9 (Barrow 10 players, Stevenage 9).", "|FW ||10|| Lee McEvilly || || "]}, {"page": "2008–09 Rochdale A.F.C. season", "response": ["|  Lee McEvilly || Cambridge United || Undisclosed || 05-01-2009 || align=\"center\"|"]}, {"page": "2004 UEFA European Under-21 Championship qualification Group 6", "response": ["* Lee McEvilly"]}, {"page": "McEvilly", "response": ["*Lee McEvilly (born 1982), English footballer"]}, {"page": "2005–06 Wrexham F.C. season", "response": ["|align=\"left\"|11||align=\"left\"|FW||align=\"left\"| Lee McEvilly"]}]}}