{"wiki_id": "http://www.wikidata.org/entity/Q6513676", "itemLabel": "Lee Gilmour", "itemDescription": "English rugby league footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Lee_Gilmour", "wikipedia_page": {"main": "Lee Andrew Gilmour (born 12 March 1978) is an English assistant coach at Wakefield Trinity in the Super League and a former professional rugby league footballer. He played in the Super League for the Wigan Warriors (Heritage № 911) (with whom he won 1998's Super League III), the Bradford Bulls, St Helens (Heritage № 1135) (with whom he won 2006's Super League XI), the Huddersfield Giants, Wakefield Trinity Wildcats and the Castleford Tigers (Heritage № 935). Gilmour represented Great Britain and Scotland at international level.", "link_mentions": [{"page": "2000 Rugby League World Cup", "response": ["Scotland: 1. Lee Penny, 2. Matt Daylight, 3. Graham Mackay, 4. Geoff Bell, 5. Lee Gilmour, 6. Andrew Purcell, 7. Richard Horne8. Heckenberg, 9. Danny Russell (Captain), 10. Laughton, 11. Scott Logan, 12. Cram, 13. Adrian Vowles.Substitutes: David Maiden, Matt Crowther, Wayne McDonald, Shaw.Coach: Shaun McRae", "Scotland: 1. Danny Arnold, 2. Matt Daylight, 3. Lee Gilmour, 4. Bell, 5. Matt Crowther, 6. Horne, 7. Scott Rhodes8. Heckenberg, 9. Russell, 10. Laughton, 11. Logan, 12. Cram, 13. Adrian Vowles.Substitutes: Maiden, Graham, McDonald, Shaw."]}, {"page": "Rugby League Tri-Nations", "response": ["|1||Louis Anderson (NZ), Shaun Berrigan (Aus), Petero Civoniceva (Aus), Alex Chan (NZ), Paul Deacon (GB), David Faiumu (NZ), Andy Farrell (GB), Lee Gilmour (GB), Martin Gleeson (GB), Iestyn Harris (GB), Justin Hodges (Aus), Richard Horne (GB), Andrew Johns (Aus), Matthew Johns (Aus), Stephen Kearney (NZ), Brett Kimmorley (Aus), Matt King (Aus), Ali Lauiti'iti (NZ), Jamie Lowrie (NZ), Francis Meli (NZ), Adrian Morley (GB), Danny McGuire (GB), Robbie Paul (NZ), Jamie Peacock (GB), Frank Pritchard (NZ), Paul Rauhihi (NZ), Robert Richardson (Aus), Jerome Ropati (NZ), Matthew Rua (NZ), Matt Sing (Aus), Jason Smith (Aus), Willie Talau (NZ), Anthony Tupou (Aus), Joe Vagana (NZ), Lesley Vainikolo (NZ), Chev Walker (GB), Paul Whatuira (NZ), Ruben Wiki (NZ), Sonny Bill Williams (NZ)"]}, {"page": "Bradford Bulls", "response": ["|||14||Lee Gilmour"]}, {"page": "2006 Rugby League Tri-Nations", "response": ["|St Helens R.F.C.||Lee Gilmour, Leon Pryce, James Roby, Paul Wellens, Jon Wilkin, Sean Long", "|16 Brent Kite || Bench ||16 Lee Gilmour", "|}During the first minutes of the match Australian forward Willie Mason punched Stuart Fielden, breaking his nose and sparking a brawl, and later took Sean Long out after kicking, leading with an elbow which left Long's head bloodied and bandaged for the rest of the match. He was later charged for his punch on Fielden and had to face a Rugby League International Federation disciplinary committee the following Monday, where he was fined AUD$5000 and suspended for one game.BBC SPORT | Rugby League | Mason gets one-game ban for punch After almost thirty minutes the Australians opened the scoring when, defending within their own ten-metre line, their scrum-half back Ben Hornby intercepted a pass and ran twenty metres before giving the ball on to winger Greg Inglis to run the remaining seventy to the line and score under the posts. Lockyer converted the try so it was 6 - 0 in favour of the Kangaroos. A few minutes later Irish winger Brian Carney left the field with a hamstring injury and was replaced by Lee Gilmour. Then Great Britain struck back with scrum-half-back Sean Long dummying his way through the defence thirty-five metres from the line then passing back inside to fullback Paul Wellens to score. Long then converted the try, so the scores were level at 6 all at the break.", "On the other side of half-time, the Lions scored after about two minutes from close range when forward Jamie Peacock barged his way through the defence and over the line. The video referee gave the try 'benefit of the doubt' and Sean Long's kick didn't miss, so the score was 12 - 6 in favour of Great Britain. The Australians hit back with another long range try, the ball being moved out to Inglis on the left wing to make a break down the sideline before passing back inside to five-eighth Darren Lockyer to finish the run to the line and touch down behind the uprights. Lockyer then converted, levelling the score at 12 - 12. About ten minutes later the British struck back when Lee Gilmour hit a gap twenty metres out and ran through to dive over beneath the sticks. Sean Long converted so the Lions regained the lead at 18 - 12. With just over ten minutes remaining Great Britain got an opportunity to put themselves in front by more than a converted try when they were awarded a penalty, but Long's kick missed. Shortly after he got a chance to make amends with a drop goal but missed. However, with less than five minutes remaining he helped seal the match when he kicked a loose pass fifteen metres from his own goal-line downfield and chased after it, regathering and running just over the half-way line before passing it James Roby in support who couldn't outrun Nathan Hindmarsh. From the play-the-ball twenty metres away from Australia's goal-line, the British moved the ball through the hands out to the other side of the field to winger Gareth Raynor who dived over in the corner. Long's conversion attempt struck the post and missed, but he later kicked a field goal in the final minutes to make it a 23 - 12 victory, Great Britain's first in Australia since their 1992 tour."]}, {"page": "2006 Challenge Cup", "response": ["Subs: Lee Gilmour, James Roby, James Graham, Maurie Fa'asavalu Coach: Daniel Anderson"]}]}}