{"wiki_id": "http://www.wikidata.org/entity/Q6514722", "itemLabel": "Lee Phillips", "itemDescription": "British footballer (born 1980)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lee_Phillips_(footballer,_born_1980)", "wikipedia_page": {"main": "Lee Paul Phillips (born 16 September 1980) is an English semi-professional footballer", "link_mentions": [{"page": "Torquay United F.C.", "response": ["With goals from club captain Chris Hargreaves and leading scorer Tim Sills Torquay triumphed 2–0 over Cambridge in an entertaining match watched by over 35,000 fans. Lee Phillips played for Cambridge that day, and set a record (for a non-league player) of losing at Wembley three times in three years with three clubs."]}, {"page": "Bath City F.C.", "response": ["| Lee Phillips"]}, {"page": "List of Exeter City F.C. seasons", "response": ["|Lee Phillips"]}, {"page": "Adam Stansfield", "response": ["He scored nine times in 40 league games in his first season, including two in a 2–1 home win over relegated Southport on 28 April 2007 in order to seal a play-off place. Eleven days later, in the second leg of the play-off semi-final away to Oxford United, he scored a goal which took the match to extra time and eventually a penalty shootout which his side won. In the final on 20 May at Wembley Stadium, he came on as a 36th-minute substitute for goalscorer Lee Phillips in a 1–2 loss to Morecambe."]}, {"page": "2007 Conference National play-off Final", "response": ["|FW ||11||Lee Phillips || || "]}, {"page": "2005–06 Football Conference", "response": ["|= ||align=left| Lee Phillips ||align=left| Exeter City ||13||0||0||3||1||17"]}, {"page": "2007–08 FA Trophy", "response": ["Torquay United; 21 Martin Rice, 3 Kevin Nicholson, 4 Steve Woods (c), 6 Chris Todd, 7 Lee Mansell, 8 Tim Sills, (11 Kevin Hill 89mins) 10 Lee Phillips (19 Danny Stevens 46mins) 14 Chris Hargreaves, 20 Roscoe D'Sane (9 Elliot Benyon 66mins) 24 Steve Adams, 26 Chris Zebroski."]}, {"page": "2009 Conference Premier play-off Final", "response": ["|CF ||27||Lee Phillips"]}, {"page": "History of Rushden & Diamonds F.C.", "response": ["During the summer, Hill brought in a plethora of new faces; including former Lincoln City shot stopper Alan Marriott and former Cambridge midfielder Rob Wolleaston. Hill also brought to the club Dean McDonald, Lee Phillips, Sagi Burton, Jamie McGuiness, Gareth Jelleyman and Daryl Clare from Conference National rivals Burton Albion. Leon Knight was also later brought in, a major coup. On paper, and according to the bookies, Rushden were considered one of the best teams in the league, and were joint-favourites to win the Conference."]}, {"page": "2000–01 Plymouth Argyle F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Lee Phillips                 ||6 ||0 ||0||0||1||0||1||0||8 ||0"]}, {"page": "Lee Phillips", "response": ["Lee Phillips may refer to the following people:", "*Lee Phillips (footballer, born 1979), Welsh-born footballer", "*Lee Phillips (footballer, born 1980), English footballer", "*L. Lee Phillips, entertainment lawyer with Manatt, Phelps & Phillips", "*Grant-Lee Phillips (born 1963), American singer-songwriter "]}, {"page": "Jon Challinor", "response": ["Challinor was targeted by fellow Conference National club Grays Athletic in December 2006, but after remaining at Exeter he was offered a new contract at the club in February 2007, which he did not sign. He played for Exeter in the 2007 Conference National play-off Final on 20 May 2007, the first Conference play-off final to be played at the newly rebuilt Wembley Stadium. He assisted Lee Phillips' ninth-minute opening goal for Exeter, although the team went on to lose 2–1 to Morecambe. Challinor made 48 appearances and scored 10 goals for Exeter in 2006–07."]}, {"page": "Lee Phillips (footballer born 1980)", "response": ["#REDIRECT Lee Phillips (footballer, born 1980)"]}, {"page": "1999–2000 Plymouth Argyle F.C. season", "response": ["| 12|| || MF|| Lee Phillips|| 4|| 15|| 0"]}]}}