{"wiki_id": "http://www.wikidata.org/entity/Q6519656", "itemLabel": "Leigh Palin", "itemDescription": "professional footballer (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Leigh_Palin", "wikipedia_page": {"main": "Leigh Granville Palin (born 12 September 1965) is an English former footballer who played in the Football League for Bradford City, Burnley, Hull City, Rochdale, Shrewsbury Town and Stoke City. His father, Granville, was also a professional footballer.", "link_mentions": [{"page": "Alan Ball Jr.", "response": ["The following month he joined Colchester United as assistant to Jock Wallace and in October 1989 took up a similar post under Mick Mills at Stoke City. However, Mills was sacked two weeks later and Ball was promoted to the manager's seat. He came to the conclusion that the squad he had inherited was simply not good enough and out went Chris Kamara, Dave Bamber, Leigh Palin, Carl Saunders, Gary Hackett and Nicky Morgan. Into the side came Tony Ellis, Lee Sandford, Tony Kelly, Dave Kevan, Paul Barnes and Noel Blake. It was a big gamble by Ball to change so much of the squad so quickly, and it did not pay off. Stoke stayed rooted to the bottom of the table and was relegated to the Third Division for the first time in 63 years."]}, {"page": "List of Bradford City A.F.C. players", "response": ["|Leigh Palin||||1986–1989||71||10||"]}, {"page": "Palin", "response": ["* Leigh Palin (born 1965), English footballer"]}, {"page": "1987–88 Bradford City A.F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Leigh Palin"]}, {"page": "1989–90 Stoke City F.C. season", "response": ["Injuries, refereeing decisions and a spate of draws saw Stoke hit bottom spot in November after collecting just two wins in 19. With the club heading towards the third tier for the first time since 1927 Mills paid the price for his failure and was dismissed. Into Mills' place came Alan Ball, a former World Cup winner with England, whose previous job was with Portsmouth. Ball was appointed as Mills' assistant two months earlier. He made an instant impact as Stoke beat Newcastle United on Boxing Day. But injury to Ian Cranson against Bournemouth in March put a dent in any hopes of a revival. Ball chose to wheel and deal in the transfer market in an effort to halt the club's slide. He had come to the conclusion that the squad he had inherited was simply not good enough and out went Chris Kamara, Dave Bamber, Leigh Palin, Carl Saunders, Gary Hackett and Nicky Morgan. Into the side came Tony Ellis, Lee Sandford, Tony Kelly, Dave Kevan, Paul Barnes and Noel Blake.", "|align=\"left\"|MF||align=\"left\"| Leigh Palin"]}, {"page": "1992–93 Burnley F.C. season", "response": ["||MF|| Leigh Palin || Hull City || Free || September 1993"]}, {"page": "List of Rochdale A.F.C. players (1–24 appearances)", "response": ["|Leigh Palin"]}]}}