{"wiki_id": "http://www.wikidata.org/entity/Q6513136", "itemLabel": "Lee Brennan", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Lee_Brennan", "wikipedia_page": {"main": "Lee Anthony Brennan (born 27 September 1973) is an English singer, songwriter, dancer and actor. He is the lead vocalist of boy band 911.", "link_mentions": [{"page": "Emma Bunton", "response": ["In 1997, Bunton dated British singer Lee Brennan. In the same year, she was briefly linked to American actor Leonardo DiCaprio. In 1998, she began dating British singer Jade Jones, from the group Damage, but they split for the first time in May 1999. From September 1999 to September 2000, Bunton was in a relationship with the England footballer Rio Ferdinand, who was introduced by her friends David Beckham and Victoria Beckham. In November 2000, she returned to Jones, but they split for the second time in March 2002, when Bunton decided to work again with Simon Fuller; Jones was against this decision. In 2003, she was briefly linked to American singer Justin Timberlake."]}, {"page": "Gareth Gates", "response": ["In 2016, Gates starred as Willard in a national tour of Footloose. He took several breaks during the tour, and during his absences his part was played by Lee Brennan."]}, {"page": "Brennan (surname)", "response": ["*Lee Brennan (born 1973), singer"]}, {"page": "List of show business families", "response": ["** B*Witched bandmate and actress, Lindsay Armaou, was married to 911 lead singer, Lee Brennan."]}, {"page": "911 (English group)", "response": ["911 (pronounced \"nine one one\") are an English pop group consisting of Lee Brennan, Jimmy Constable and Simon \"Spike\" Dawbarn. They were formed in London in 1995 and released their debut single \"Night to Remember\" in May 1996. This was followed by their debut album The Journey in March 1997, which was certified Gold by the BPI in November 1997. 911 released two more Silver-certified albums, Moving On and There It Is, in 1998 and 1999, respectively. There It Is also produced their only UK number-one single, a cover of \"A Little Bit More\", which topped the UK Singles Chart in January 1999.", "Dancers Jimmy Constable and Simon \"Spike\" Dawbarn were introduced to each other in the early 1990s by another dancer called Clive. Before long, Constable and Dawbarn were both chosen to work as dancers on the late-night ITV music show The Hit Man and Her. In 1995, after seeing how successful Jason Orange, who used to be a dancer on the show, had been with boy band Take That (and having also become more popular than the acts they were dancing for), Constable and Dawbarn decided to put their own group together. At Carlisle's radio station CFM Radio, they found Steve Gilmour, who had previously managed PJ & Duncan and Boyzone, and asked him to be their manager a few months later. Gilmour initially turned them down as he did not know anything about management, but as time went on, Constable and Dawbarn continued to gain more and more fans. Every time their paths crossed, Constable would show Gilmour the fanmail they were receiving and they were also one of the seven acts to be booked at the Sands Centre in Carlisle, again for CFM. Gilmour had finally become convinced and he decided to manage them but they were short of a singer. Lee Brennan, who had been a fan of Dawbarn and Constable on The Hit Man and Her, was recruited following recommendation by Gilmour. After moving into Gilmour's three-bedroom flat in the south side of Glasgow, 911 embarked on a massive tour of schools and under-18 clubs all over the UK in order to build up their growing army of teenage followers, and fast became crowd favourites on road shows during the Summer of 1995. Despite their immense popularity, they were turned down by every record company they turned to."]}, {"page": "All Rise (Blue album)", "response": ["The third single, released was \"If You Come Back\", it was released in November 2001. The single peaked at No. 1 on the UK Singles Chart. The song was produced by multi-platinum producer Ray Ruffin & co-written by Nicole Formescu, Ray Ruffin, Lee Brennan and Ian Hope. The song has received a Silver sales status certification for sales of over 200,000 copies in the UK. \"Fly By II\" ws chosen as the fourth and final single, it was released in March 2002. The single peaked at No. 6 on the UK Singles Chart, at No. 9 in New Zealand, No. 16 in Ireland, and No. 23 in Belgium. The song has received a Silver sales status certification for sales of over 200,000 copies in the UK. The song \"Best in Me\" was released as a single exclusively in Australia, New Zealand and Philippines in August 2002. The single peaked at No. 10 on the New Zealand Singles Chart, becoming one of Blue's most successful singles in the region. A music video was recorded and was later used to promote the group's compilation album, Best of Blue."]}, {"page": "Lindsay Armaou", "response": ["Armaou married 911's Lee Brennan in September 2006, but they split up in 2011."]}, {"page": "Lee brennan", "response": ["#REDIRECT Lee Brennan "]}, {"page": "Spike Dawbarn", "response": ["Dawbarn went on to become a dancer on the ITV late night dance show The Hit Man and Her. In this role he worked alongside 'talents' such as Jimmy Constable and Jason Orange. In 1995, Dawbarn and Constable formed a partnership and teamed up with frontman Lee Brennan to form 911. Their first hit got to number 38 on the UK Singles Chart, with subsequent releases rising higher. Dawbarn choreographed a number of the band's dance routines."]}, {"page": "If You Come Back", "response": ["\"If You Come Back\" is a song by English boy band Blue, released as the third single from their debut studio album, All Rise (2001). It was written by Ray Ruffin, Nicole Formescu, Ian Hope, and Lee Brennan of boy band 911. The song topped the UK charts for one week becoming their second consecutive number one single release and has received a silver sales status certification for sales of over 200,000 copies in the UK."]}, {"page": "Jimmy Constable", "response": ["Whilst on the show, Constable met Simon \"Spike\" Dawbarn and Jason Orange. Having seen how successful the latter went on to become with his band Take That, Constable and Dawbarn (who had become even more popular than the acts they were dancing for) decided to put their own band together, and 911 was born. Lee Brennan, who was a fan of both the boys and The Hit Man and Her, agreed to join Constable and Dawbarn and they became a trio."]}, {"page": "Lee Brennan (911)", "response": ["#REDIRECT Lee Brennan"]}, {"page": "Trinity School, Carlisle", "response": ["* Lee Brennan — former member of 911."]}, {"page": "List of people from Carlisle", "response": ["*Lee Brennan, member of the boy band 911"]}, {"page": "1973 in British music", "response": ["*27 September - Lee Brennan, singer (911)"]}, {"page": "The Journey (911 album)", "response": ["* Lee Brennan – composer, vocalist"]}, {"page": "Moving On (911 album)", "response": ["* Lee Brennan - vocals, composer"]}, {"page": "List of songs recorded by 911 (English group)", "response": ["|Eliot Kennedy  John McLaughlin  Lee Brennan  Jimmy Constable  Spike Dawbarn", "|Eliot Kennedy  Lee Brennan", "|John McLaughlin  Lee Brennan", "|John McLaughlin  Graham Goudie  Lee Brennan  Jimmy Constable  Spike Dawbarn", "|John McLaughlin  Lee Brennan  Jimmy Constable  Spike Dawbarn  Jon Douglas", "|John McLaughlin  Lee Brennan  Jimmy Constable  Spike Dawbarn  Mike Percy  Tim Lever", "|John McLaughlin  Lee Brennan  Jimmy Constable  Spike Dawbarn", "|John McLaughlin  Lee Brennan  Jimmy Constable  Spike Dawbarn  Jon Douglas", "|John McLaughlin  Lee Brennan  Jimmy Constable  Spike Dawbarn  Mike Percy  Tim Lever  Eliot Kennedy", "|John McLaughlin  Lee Brennan", "|John McLaughlin  Lee Brennan  Jimmy Constable  Spike Dawbarn  Phil Harding  Ian Curnow", "|Christian Ballard  Russ Ballard  Andrew Murray  Lee Brennan", "|Christian Ballard  Russ Ballard  Andrew Murray  Lee Brennan  Jimmy Constable  Spike Dawbarn", "|John McLaughlin  Lee Brennan  Jimmy Constable  Jud Mahoney  Natalie DeLucia  David Thomas", "|John McLaughlin  Lee Brennan  Jimmy Constable  David Thomas", "|John McLaughlin  Lee Brennan  Jimmy Constable  Jud Mahoney  Natalie DeLucia", "|John McLaughlin  Lee Brennan  Jimmy Constable  Jud Mahoney  Natalie DeLucia", "| Lee Brennan  Andrew Murray", "| John McLaughlin  Lee Brennan  Jimmy Constable  Jud Mahoney  Natalie DeLucia", "| John McLaughlin  Lee Brennan  Jimmy Constable  Jud Mahoney  Natalie DeLucia", "|John McLaughlin  Lee Brennan  Jimmy Constable  Spike Dawbarn", "|John McLaughlinGraham Goudie  Lee Brennan  Jimmy Constable", "|John McLaughlin  Lee Brennan  Paul Masterson", "|Lee Brennan  Nicky Graham  Deni Lew", "|John McLaughlin  Lee Brennan  Jimmy Constable  Spike Dawbarn", "|Lee Brennan  Gary Bromham  Terry Ronald", "|Lee Brennan  Juliette Jaimes  Jaimes Welton", "|John McLaughlin  Graham Goudie  Lee Brennan  Jimmy Constable", "|Lee Brennan  Dion  Jacques", "|Lee Brennan  Andrew Murray", "|Lee Brennan  Juliette Jaimes  Jaimes Welton  Sheppard Solomon", "|\"Turn It Around\"  (Later released as Lee Brennan's debut solo single in 2002. 911 version remains unreleased)", "|Christian Ballard  Russ Ballard  Andrew Murray  Lee Brennan", "|Lee Brennan  Dion  Jacques", "|Christian Ballard  John McLaughlin  Andrew Murray  Lee Brennan"]}, {"page": "List of songs recorded written and produced by Russ Ballard", "response": ["| Turn It Around (Later released as Lee Brennan's debut solo single in 2002. 911 version remains unreleased)  || ?", "| ? ||  ||  co-written with Christian Ballard, Andrew Murray, Lee Brennan ", "| 1999 ||  ||  co-written with Christian Ballard, Andrew Murray, Lee Brennan"]}]}}