{"wiki_id": "http://www.wikidata.org/entity/Q6514656", "itemLabel": "Lee Nicholls", "itemDescription": "British footballer (born 1992)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lee_Nicholls", "wikipedia_page": {"main": "Lee Anthony Nicholls (born 5 October 1992) is an English professional footballer who plays as a goalkeeper for EFL Championship club Huddersfield Town.", "link_mentions": [{"page": "Sean Murdoch", "response": ["Murdoch signed for Football League Two club Accrington Stanley on a one-year deal in July 2011. He made his debut on 6 August 2011, in the opening game playing against Northampton Town, where he kept a clean sheet. Murdoch went on to become the first choice goalkeeper in the club's first twelve matches to the start of the season. However, Murodch lost his first choice role with the arrival of Lee Nicholls and the returning of Ian Dunbavin. After eight months at the club, Murdoch walked away from his contract in March 2012, due to a lack of payment."]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Lee Nicholls||||2021–||27||0||0||0||2||0||0||0||0||0||29||0"]}, {"page": "Callum McManaman", "response": ["In June 2011, McManaman, along with teammate Lee Nicholls, was included in the England under-20s squad for the 2011 FIFA U-20 World Cup, the first time a Wigan Athletic player has been involved in the tournament. He made his debut in a group match – a 0–0 draw against North Korea, and went on to play in all of England's games during the tournament before the team were knocked out by Nigeria."]}, {"page": "2010–11 Wigan Athletic F.C. season", "response": ["|  Lee Nicholls ||  Hartlepool United || 9 Nov 2010 || 8 Dec 2010 || align=\"center\"|", "|  Lee Nicholls ||  Shrewsbury Town || 31 Jan 2011 || 28 Feb 2011 || align=\"center\"|", "|  Lee Nicholls ||  Sheffield Wednesday || 24 Mar 2011 || 27 Apr 2011 || align=\"center\"|"]}, {"page": "2011–12 Wigan Athletic F.C. season", "response": ["| Lee Nicholls"]}, {"page": "2011–12 Accrington Stanley F.C. season", "response": ["| Lee Nicholls"]}, {"page": "2012–13 Bradford City A.F.C. season", "response": ["The final marked the second time that Bradford City had been to Wembley Stadium this season, after the 2013 Football League Cup Final. Last time, they went to enjoy the occasion as nobody expected them to win, but this time they went to get promoted. The play-off final would also mark the fifth time that Bradford faced Northampton Town during the season after playing them twice in the league and twice in the FA Cup. The writing was on the wall early doors as the Bantams dominated everything in the early stages of the game and Bradford scored first in the 15th minute after James Meredith's cross found Garry Thompson on the right hand side, Thompson then chipped the ball back across the face of the goal and James Hanson delicately headed the ball over Northampton keeper Lee Nicholls to give Bradford a 1–0 lead. The Bantams continued to press forward and their dominance was once again rewarded as Kyel Reid found Nathan Doyle from a cross who in turn put his own cross into the box for Rory McArdle to power a header into the back of the net to give the Bantams a 2–0 lead in the 19th minute. Once again Reid crossed the ball to find the in form Thompson who headed it back across the face of the goal, this time it was Nahki Wells who got on the end of it and blasted the ball into the goal to put the Bantams 3–0 up after only 28 minutes. Northampton brought on top scorer Adebayo Akinfenwa just after half-time but even he couldn't provide Northampton with a goal. The 3–0 win gave Bradford City their first promotion in 14 years and also lifted them out of League Two after seven consecutive years in the Football League's bottom divisions."]}, {"page": "2013 FA Community Shield", "response": ["|GK ||13|| Lee Nicholls"]}, {"page": "2012–13 Wigan Athletic F.C. season", "response": ["| Lee Nicholls"]}, {"page": "Lee Nichols", "response": ["* Lee Nicholls, footballer"]}, {"page": "2012–13 Northampton Town F.C. season", "response": ["| 21 || GK || style=\"text-align:left;\" |  Lee Nicholls", "| 6 August 2012 || GK ||  || Lee Nicholls || Wigan Athletic || 30 June 2013 || "]}, {"page": "2013 Football League Two play-off Final", "response": ["The match was refereed by Keith Stroud in front of a crowd of 47,127. In the 15th minute of play, Bradford took the lead after James Hanson headed in a pass from Garry Thompson after James Meredith's cross. Four minutes later, the lead was doubled when Rory McArdle's strong header from a Nathan Doyle cross went low into Northampton's goal.  Nahki Wells then volleyed past Lee Nicholls from close range just under the half-hour mark in the first half to make it 3–0 to Bradford. Northampton failed to make a shot on target and the match ended 3–0 to see Bradford promoted to League One.", "Northampton Town faced Cheltenham Town in the other play-off semi-final with the first leg being played at Sixfields Stadium in Northampton on 2 May 2013.  Roy O'Donovan scored in the 27th minute to put Northampton into the lead from a Chris Hackett cross; almost immediately, Paul Benson missed a chance to equalise after shooting wide of the post.  Both sides had chances to add to the scoreline but the match finished 1–0.  The second leg took place three days later at Whaddon Road in Cheltenham.  In the 15th minute, Ben Tozer was deemed to have fouled Russell Penn and the referee awarded a penalty:  Marlon Pack took the spot kick but it was saved by Lee Nicholls. Before half-time, Luke Guttridge's volley put Northampton into the lead which they did not relinquish.  An aggregate score of 2–0 meant that Northampton progressed to the final.", "|GK ||21 ||Lee Nicholls"]}, {"page": "2013–14 Wigan Athletic F.C. season", "response": ["| Lee Nicholls", "|align=\"left\"|13||GK||Lee Nicholls"]}]}}