{"wiki_id": "http://www.wikidata.org/entity/Q6519648", "itemLabel": "Leigh Mills", "itemDescription": "English footballer (born 1988)", "wikipedia_url": "https://en.wikipedia.org/wiki/Leigh_Mills", "wikipedia_page": {"main": "Leigh Mills (born 8 February 1988) is an English former professional footballer who was signed to Tottenham Hotspur between 2004 and 2009.", "link_mentions": [{"page": "Mark Yeates", "response": ["Yeates started his career at Tottenham Hotspur, but first played professional football in loan spells with Brighton & Hove Albion and Swindon Town during the 2003–04 season. Loaned to Swindon as part of the transfer to Spurs of Swindon player Leigh Mills, Yeates only played four games before being returned to White Hart Lane after a disagreement with then manager Andy King. He made his Spurs debut against Wolves on the final day of the 2003–04 Premier League season, setting up a goal for Robbie Keane. He made three first team appearances for Spurs."]}, {"page": "Tottenham Hotspur F.C. Under-23s and Academy", "response": ["Spurs also loaned out Tomas Pekhart to Southampton, Troy Archibald-Henville to Norwich City, Simon Dawkins to Leyton Orient, David Button to Grays Athletic, and Andrew Barcham, Leigh Mills & Charlie Daniels went on loan to Gillingham."]}, {"page": "2008–09 Tottenham Hotspur F.C. season", "response": ["|9 February 2009 || Leigh Mills||Unattached||Released", "|8 August 2008|| Leigh Mills||Gillingham||1 January 2009"]}, {"page": "Swindon Town F.C. Reserves and Academy", "response": ["* Player of the Tournament Award - Leigh Mills (2003)"]}, {"page": "2008–09 Gillingham F.C. season", "response": ["|align=\"left\"| Leigh Mills|| 6 (1) || 1 || – || – || – || – || 1 || 0 || 7 (1) || 1"]}, {"page": "2007 HKFC International Soccer Sevens", "response": ["* Tottenham Hotspur: Tommy Forecast, Troy Archibald-Henville, Philip Ifil, Leigh Mills, Jacques Maghoma, Jamie O'Hara, Charlie Daniels, David Hutton, Andy Barcham, Lee Barnard"]}, {"page": "2008–09 Brentford F.C. season", "response": ["| Leigh Mills"]}]}}