{"wiki_id": "http://www.wikidata.org/entity/Q6521230", "itemLabel": "Lemn Sissay", "itemDescription": "British poet, author and broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Lemn_Sissay", "wikipedia_page": {"main": "Lemn Sissay  (born 21 May 1967) is a British author and broadcaster. Sissay was the official poet of the 2012 London Olympics, has been chancellor of the University of Manchester since 2015, and joined the Foundling Museum's board of trustees two years later, having previously been appointed one of the museum's fellows. He was awarded the 2019 PEN Pinter Prize. He has written a number of books and plays.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Lemn Sissay (born 1967, E)"]}, {"page": "Harlem", "response": ["In 1938, jazz bandleader and singer Cab Calloway published the first dictionary by an African-American, Cab Calloway's Cat-ologue: A \"Hepster's\" Dictionary, which became the official jive language reference book of the New York Public Library. In 1939, Calloway published an accompanying book titled Professor Cab Calloway’s Swingformation Bureau, which instructed readers how to apply the words and phrases from the dictionary. He released several editions until 1944, the last being The New Cab Calloway’s Hepsters Dictionary: Language of Jive. Poet Lemn Sissay observed that \"Cab Calloway was taking ownership of language for a people who, just a few generations before, had their own languages taken away.\" "]}, {"page": "List of poets", "response": ["*Lemn Sissay (born 1967), English author and broadcaster"]}, {"page": "List of British comedians", "response": ["*Lemn Sissay"]}, {"page": "List of winners and shortlisted authors of the Booker Prize", "response": ["*Lemn Sissay"]}, {"page": "Countdown (game show)", "response": ["!scope=row|Lemn Sissay"]}, {"page": "Cab Calloway", "response": ["In 1938, Calloway released Cab Calloway's Cat-ologue: A \"Hepster's\" Dictionary, the first dictionary published by an African American. It became the official jive language reference book of the New York Public Library. A revised version of the book was released with Professor Cab Calloway's Swingformation Bureau in 1939. He released the last edition, The New Cab Calloway's Hepsters Dictionary: Language of Jive, in 1944. On a BBC Radio documentary about the dictionary in 2014, Poet Lemn Sissay stated, \"Cab Calloway was taking ownership of language for a people who, just a few generations before, had their own languages taken away.\""]}, {"page": "The Last Poets", "response": ["In 2014, Last Poet Jalaluddin Mansur Nuriddin came to London and also performed at The Jazz Cafe with Jazz Warriors the first ever live performance in 40 years of the now iconic \"Hustlers Convention\". The event was produced by Fore-Word Press and featured Liverpool poet Malik Al Nasir with his band Malik & the O.G's featuring Cleveland Watkiss, Orphy Robinson and Tony Remy. The event was filmed as part of a documentary on the \"Hustlers Convention\" by Manchester film maker Mike Todd and Riverhorse Communications. The executive producer was Public Enemy's Chuck D. As part of the event Charly Records re-issued a special limited edition of the vinyl version of Hustlers Convention to celebrate their 40th anniversary. The event was MC'd by poet Lemn Sissay and the DJ was Shiftless Shuffle's Perry Louis."]}, {"page": "Gil Scott-Heron", "response": ["In April 2009, on BBC Radio 4, poet Lemn Sissay presented a half-hour documentary on Gil Scott-Heron entitled Pieces of a Man, having interviewed Gil Scott-Heron in New York a month earlier. Pieces of a Man was the first UK announcement from Scott-Heron of his forthcoming album and return to form. In November 2009, the BBC's Newsnight interviewed Scott-Heron for a feature titled The Legendary Godfather of Rap Returns. In 2009, a new Gil Scott-Heron website, gilscottheron.net, was launched with a new track \"Where Did the Night Go\" made available as a free download from the site."]}, {"page": "Performance poetry", "response": ["Apples and Snakes, a collective promoting performance poetry in pubs and at festivals, was started by Mandy Williams, PR Murry and Jane Addison in London in 1982 inspired by the work of New Variety/CAST. They worked with 'ranting poets' such as Attila the Stockbroker and Seething Wells and other poets and musicians with a political message such as Billy Bragg. Apples and Snakes continues today, 31 years later, as a national organisation. In the 90s, however, in big cities like Manchester and London, a different style emerged that was influenced more by hip hop with much less emphasis on comedy in the manner of Def Poets in the United States. Well-known writers from this evolution include Lemn Sissay and the late Dike Omeje from the Manchester scene and Roger Robinson and El Crisis  from the London circuit."]}, {"page": "List of performance poets", "response": ["*Lemn Sissay"]}, {"page": "Jalal Mansur Nuriddin", "response": ["Nuriddin returned to the UK in 2014 to perform live the seminal solo album Hustlers Convention, credited as being the first ever rap albumGraeme Thomson, \"Hustlers Convention: rap's great lost album\", The Guardian, January 30, 2014. live at the Jazz Café in Camden Town, London. The event was produced by Fore-Word Press for Riverhorse Communications who filmed it as part of a documentary on the forgotten roots of rap called Hustlers Convention. The executive producer is Public Enemy's front man Chuck D. The film Hustlers Convention,Hustlers Convention directed by Mike Todd, premiered at Docfest in Sheffield UK in 2015, with its London premiere at the Institute of Contemporary Arts, on June 14, 2015. The Hustlers Convention Live featured The Jazz Warriors International Collective, Malik & the O.G's and poet Lemn Sissay. The UK DVD release of the historical Hustlers Convention was in 2015. After the film premiered in the UK at Docfest 2015 it went on general release through Hustlers Convention Feature Documentary UK Release 2014Kaleidoscope and premiered in New York at TriBeca Film Festival 2015 for its USA cinema release. Nuriddin screened the film also in Canada in 2016 as part of a tour with UK poet Malik Al Nasir called \"The Revolution Will Be Live\" comprising seminars, poetry performances, school visits, workshops and joint screenings of Al Nasir's film also featuring Nuriddin, called Word-Up."]}, {"page": "Leigh, Greater Manchester", "response": ["Sir John Lennard-Jones, Sir Peter Maxwell Davies, Sir Alan R. Battersby, Roger Hunt and Pete Shelley were pupils of Leigh Grammar School. Conservative politician, and MP for Morecambe and Lunesdale, David Morris was born in Leigh. Rhythm and blues singer and musician Georgie Fame was born in Leigh in 1943. Thomas Burke, operatic tenor, was born in 1890 and attended St Joseph's School. The author of \"Goodbye, Mr Chips\", James Hilton was also born in Leigh. The sculptor Mary Pownall, daughter of James Pownall the silk manufacturer, was born and raised in the town. The journalist Paul Mason was also born and educated in Leigh. The poet and Chancellor of the University of Manchester Lemn Sissay lived in children's homes in and around Leigh and attended Leigh Church of England Secondary school, now closed."]}, {"page": "List of Have I Got News for You episodes", "response": ["|Lemn Sissay"]}, {"page": "List of chancellors and vice-chancellors of British universities", "response": ["| Lemn Sissay"]}, {"page": "List of African writers by country", "response": ["* Lemn Sissay (1967–)"]}, {"page": "Charles Causley", "response": ["Subsequently, Festivals have taken place in and around the town for varying periods of up to a full week or more. Over the years, poets such as Sir Andrew Motion (former Poet Laureate, and patron of the Causley Trust), Carol Ann Duffy, Brian Patten and Lemn Sissay, novelists like Patrick Gale, journalists such as George Alagiah, and illustrators like John Lawrence have been headliners. There have also been events with historians, academics and even scientists like Professor James Lovelock (of Gaia Theory fame, and who lives in the district).", "1st prize – Elena Croitoru, 'Tower Block Twelve'. Judge: Lemn Sissay"]}, {"page": "University of Huddersfield", "response": ["A notable feature of the University of Huddersfield in recent years has been the amount of building work taking place on the Queensgate campus. The Creative Arts Building opened in 2008, and it has since been adorned by a large piece of public art in the form of the poem Let There Be Peace, by Lemn Sissay. The new £17 million Business School opened in 2010, followed by the £3 million Buckley Innovation Centre in 2012, the £22.5 million Student Central building in 2014, and the £27.5 million Oastler Building for Law and the School of Music, Humanities and Media, in 2017. Redevelopments of existing buildings include the creation of the £1 million Holocaust Centre, opened in 2018."]}, {"page": "Shlomo (beatboxer)", "response": ["SK Shlomo has performed at every Glastonbury Festival since 2005. At Glastonbury in 2007, SK Shlomo performed as part of Africa Express and beatboxed on a live version of A Message to You, Rudy accompanying Terry Hall and Lynval Golding from The Specials with Damon Albarn on piano. Emily Eavis then invited SK Shlomo to return to Glastonbury in 2008 to curate and perform in a special 2-hour \"Music Through Unconventional Means\" set, with a host of guests including Martha Wainwright, Ed Harcourt, DJ Yoda, Reverend and the Makers, Portico Quartet, Lemn Sissay, and Martina Topley Bird."]}, {"page": "Leftism (album)", "response": ["Barnes chose the guest vocalists who were not associated with dance music, as he \"love[s] taking people with nothing to do with dance music, like Toni, or Danny Red, and putting them in a different environment, It's getting back to the original ethic of remixing, taking anything and turning it into dance music.\" Barnes was a fan of the group Curve, and had Toni Halliday from Curve to come in and work on the song \"Original\". \"Open Up\" features John Lydon on vocals. Neil Barnes stated he had known Lydon since he was 19 years old through a mutual friend. Leftfield wanted to do a track with Lydon for about two years but were held up as \"it took all that time to get him to commit to doing it and to get the track good enough.\" Two reggae vocalists are featured on the album, including Danny Red on \"Inspection\" and Earl Sixteen on \"Release the Pressure\". Lemn Sissay guests on \"21st Century Poem\".", "* Earl Sixteen, Cheshire Cat, Papa Dee, Djum Djum, Toni Halliday, Danny Red, John Lydon, Lemn Sissay – vocals"]}, {"page": "Hulme", "response": ["Morrissey, lead singer of the Smiths, spent his childhood in Hulme and neighbouring Stretford. Jazz trumpeter Kevin Davy lived in Hulme during his time as a student at Manchester Polytechnic. Poet and BBC Radio 4 presenter Lemn Sissay spent the first 17 years of his life in care, in Hulme and its surrounding areas. Musician, author and TV presenter John Robb lives in Hulme. Billy Duffy (guitarist with The Cult) grew up in Hulme."]}, {"page": "Julie Hesmondhalgh", "response": ["On 30 April 2017, Hesmondhalgh starred in a one-off performance at the Royal Court Theatre, of Lemn Sissay's The Report, directed by John E. McGrath."]}, {"page": "Grumpy Old Men (TV series)", "response": ["Regular contributors include Jeremy Clarkson, Bob Geldof, John Humphrys, A. A. Gill, Nigel Havers, Tony Hawks, Simon Hoggart, John O'Farrell, Rory McGrath, Bill Nighy, Matthew Parris, John Peel, Will Self, Arthur Smith, Tim Rice, Rick Stein, Tony Slattery, Rick Wakeman, Lemn Sissay, Don Warrington, Des Lynam, Gerry Robinson,. The narrator is Geoffrey Palmer."]}, {"page": "Lee Child", "response": ["In 2020 Child joined the Booker Prize judging panel, alongside Margaret Busby (chair), Sameer Rahim, Lemn Sissay and Emily Wilson."]}, {"page": "Society of Authors", "response": ["Well known contemporary members include Philip Pullman (SoA president since 2013), Malorie Blackman, Neil Gaiman, Philip Gross, Judith Kerr, Hilary Mantel, J. K. Rowling and Lemn Sissay.\"Council & President\", The Society of Authors."]}, {"page": "Old Trafford (area)", "response": ["Ayres Road and its environs are the heart of modern-day Old Trafford and a walk down this road gives a real flavour of the multi-cultural nature of the neighbourhood, with its variety of grocers' shops selling food stuffs from Europe, the Caribbean and Southeast Asia; its Catholic church, St. Alphonsus, frequented by a predominantly Irish congregation, the vibrant and busy St John's Community Centre and Shizhan House, the Chinese Medicine Centre, on the site of the old Vimto offices. Something of this atmosphere is evoked by Manchester poet Lemn Sissay in his poem Ayres Road."]}, {"page": "Off the Shelf Festival", "response": ["*Lemn Sissay"]}, {"page": "Meltdown (festival)", "response": ["| Antony and the Johnsons, Balanescu Quartet, Bert Jansch, Beth Orton, Billy Bragg, Black Rebel Motorcycle Club, Brian Jonestown Massacre, Carbon/Silicon, Cat Power, Ed Harcourt, Eels, Flea, Fred Frith, Hank Williams III, Janet Hamill, Jeff Beck, Joanna Newsom, John Cale, John Frusciante, Johnny Marr and Robyn Hitchcock, Kevin Shields, Kristin Hersh, Lemn Sissay, Lenny Kaye, Loso, Martha Wainwright, Marc Almond, Rachid Taha, Richard Hell, Roy Harper, Sinéad O'Connor, Steve Earle, Television, Tinariwen, Tori Amos, Yat-Kha, Yoko Ono"]}, {"page": "28 Acts in 28 Minutes", "response": ["* Lemn Sissay"]}, {"page": "Black British people", "response": ["Jackie Kay, since 2016, has been Scots Makar, the national poet laureate of Scotland, poets Roger Robinson (won the prestigious T. S. Eliot Prize 2019), Benjamin Zephaniah, Linton Kwesi Johnson, Lemn Sissay, Salena Godden, Warsan Shire and Patience Agbabi, playwrights Mustapha Matura, Kwame Kwei-Armah, Roy Williams, Winsome Pinnock, Patricia Cumper and Bola Agbaje, journalists such as Gary Younge, Afua Hirsch and Ekow Eshun, and Children's Laureate Malorie Blackman. Onyeka Nubia is the author of fictional trilogy Waiting to Explode, The Black Prince, and The Phoenix, for which he won the 2009 African Achievers award for Communication and Media. Blackamoores: Africans in Tudor England, their Presence, Status and Origins is his latest book, published by Narrative Eye in 2013, in which he proves that Black people in Tudor England had free status and were not slaves. Blackamoores was runner-up in the 2013/14 People's Book Prize."]}, {"page": "Brighton Festival", "response": ["*2020: Cancelled due to the COVID-19 pandemic; Lemn Sissay was to direct", "*2021: Lemn Sissay"]}, {"page": "Cultureshock at the 2002 Commonwealth Games", "response": ["*13 April – \"Storm\", a new play by Lemn Sissay, Contact Theatre"]}, {"page": "Never Mind the Full Stops", "response": ["| Susie Dent & Lemn Sissay"]}, {"page": "Kevin Davy", "response": ["Kevin G. Davy (born 29 October 1961, Nottingham, UK) is a British jazz trumpeter/flugelhorn player, composer, arranger and bandleader. He has recorded with and toured with Finley Quaye, Lamb, Adam F and Lemn Sissay's Secret Society. He has led the Kevin Davy Quartet (KDQ), D’Semble, and Kevin Davy's Monster Jam . In 1992 Davy was given the Manchester Jazz Musician of the Year Award by BBC Radio Manchester show The People."]}, {"page": "Imtiaz Dharker", "response": ["An accomplished artist, she has had 11 solo exhibitions of pen-and-ink drawings in India, Hong Kong, USA, UK, and France. All her poetry collections contain her drawings. She was one of the poet/artists featured in the Poet Slash Artist exhibition curated by poet Lemn Sissay and the art guru Hans Ulrich Obrist for Manchester International Festival 2021, along with Tracy Emin, Lubaina Himid, Precious Okoyomon, Inua Ellams, Jay Bernard, Adonis, Etel Adnan, Anne Boyer, Jimmie Durham,  Ibrahim El-Salahi, Renee Gladman, Sky Hopinka, Friederike Mayröcker, Xu Bing, and Gozo Yoshimasu.", "\"In classical Chinese, Arabic and Persian poetry, calligraphy connects the verbal and visual in ways that make poetry and art practically the same thing. That way of seeing words is remade for today by Imtiaz Dharker in her captivating drawing My Breath. Stripes flow magically out of her body into space. The lines continue their journey through a second picture, then in the third become words, lines of poetry repeated, repeated, repeated through entire blocks of text. It is a perfect illustration of the subtle and mysterious relationship between writing and drawing, seeing and reading. Poet Slash Artist, curated by the poet Lemn Sissay and the art guru Hans Ulrich Obrist, probes the mystery of that borderland, and finds what can only be called spirituality. The soul, even... This exhibition is a manifesto for a new culture, where the hubbub and hype are silenced, and at last we can hear one another think.\""]}, {"page": "Manchester Arndale", "response": ["As a shopping centre Manchester Arndale was outstandingly successful, and the critics' opinions were not universally held – especially by its owners.Williams (2003), p. 127. By 1996 the Arndale was fully let, raised £20 m a year in rents,Williams (2003), pp. 172–4. was the seventh busiest shopping area in the UK in terms of sales, and was visited by 750,000 people a week. The poet Lemn Sissay wrote"]}, {"page": "1988 in poetry", "response": ["* Lemn Sissay, Tender Fingers in a Clenched Fist"]}, {"page": "Peepal Tree Press", "response": ["Peepal Tree Press has published, in various forms, such writers as T. S. Eliot Prize-winner Roger Robinson, Booker Prize-winner Bernardine Evaristo, Anthony Kellman, Emmy Award-winner Kwame Dawes, his father Neville Dawes, Aldeburgh Poetry Prize-winner and Forward Poetry Prize-nominee Christian Campbell, Jhalak Prize-winner Jacob Ross, Christine Craig, Opal Palmer Adisa, Angela Barry, Ishion Hutchinson, Dorothea Smartt, Alecia McKenzie, Una Marson, Shivanee Ramlochan, Jack Mapanje, Patience Agbabi, Linton Kwesi Johnson, Daljit Nagra, Grace Nichols, Lemn Sissay, John Agard, Vahni Capildeo, Raymond Antrobus, Keith Jarrett, Rishi Dastidar, Gemma Weekes, Pete Kalu, Maggie Harris, Courttia Newland, Jackie Kay, Jan Shinebourne, and Kamau Brathwaite."]}, {"page": "Great Lives", "response": ["|Lemn Sissay, author & broadcaster"]}, {"page": "Malvern Fringe Festival", "response": ["*Lemn Sissay"]}, {"page": "Aïda Muluneh", "response": ["*The World is 9. Johannesburg: David Krut, 2016. . Includes \"A stronger light\" by Lemn Sissay. In English with subtitles also in Amharic."]}, {"page": "Hipster (1940s subculture)", "response": ["The words hep and hip are of uncertain origin, with numerous competing theories being proposed. In the early days of jazz, musicians were using the hep variant to describe anybody who was \"in the know\" about an emerging culture, mostly black, which revolved around jazz. They and their fans were known as hepcats. In 1938, the word hepster was used by bandleader Cab Calloway in the title of his dictionary, Cab Calloway's Cat-ologue: A \"Hepster's\" Dictionary, which defines hep cat as \"a guy who knows all the answers, understands jive\". Poet Lemn Sissay remarked that \"Cab Calloway was taking ownership of language for a people who, just a few generations before, had their own languages taken away.\" "]}]}}