{"wiki_id": "http://www.wikidata.org/entity/Q6525382", "itemLabel": "Leonard Hollands", "itemDescription": "British Army engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Leonard_Hollands", "wikipedia_page": {"main": "Leonard Clarence Charles Hollands GM (9 May 1919 – 1971) was a British soldier, a Sergeant in the Royal Engineers, who was awarded the George Medal for gallantry in bomb disposal work during World War IIThe award was announced in the London Gazette on 19 November 1943 with the citation dated on 16 November. The citation for gallantry reads:\n\"Sergeant Hollands was engaged continuously from the 14 to 22 June 1943, on intensive bomb disposal operations following the enemy air raid on Grimsby and Cleethorpes on the morning of the 14 June 1943. During the period of operations Sergeant Hollands dealt with 56 fully armed 2 Kilogram anti-personnel bombs, most of which were in unstable positions and difficult of access, and fuzed to detonate on the slightest movement. He performed his work as leader of a disposal party, tirelessly, efficiently, and with great personal courage and resource. He was responsible for the introduction of original methods which effected considerable reduction of damage to property. On 16 June 1943, a bomb in the circle of a cinema had been covered with sandbags by wardens in misinterpretation of their instructions. Although risk of denotation was involved, it was necessary to remove the sandbags in order to deal with the bomb, and Sergeant Hollands attempted to do this by remote control by means of tackle. The friction on the tackle was too great and Sergeant Hollands entered the false roof over the bomb to pull from a nearer position. On his first pull the bomb detonated and he only escaped possible fatal injury through the screening effect of the sandbags. On 17 June 1943, a bomb was balanced on the edge of the gutter of a school. In order to place a demolition charge Sergeant Hollands crawled along the sloping roof at considerable risk of slipping on to the bomb or of dislodging a slate which would have caused detonation. Four other bombs fell on the Tramway Depot Wharf. This wharf is constructed of old rotting and rocky sleepers. In order to minimise damage to nearby buildings, Sergeant Hollands built sandbag screening walls. This was an extremely hazardous task as one false step on a rocking rafter could have caused detonation of one or more bombs. Sergeant Hollands successfully laid charges and detonated the bombs, the total resultant damage being only two broken windows.\"", "link_mentions": [{"page": "Leonard Charles Clarence Hollands", "response": ["#REDIRECT Leonard Hollands"]}, {"page": "Hollands, Leonard", "response": ["#redirectLeonard Hollands"]}]}}