{"wiki_id": "http://www.wikidata.org/entity/Q6525194", "itemLabel": "Leonard Cottrell", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Leonard_Cottrell", "wikipedia_page": {"main": "Leonard Eric Cottrell (21 May 1913 – 6 October 1974) was a British author and journalist.  Many of his books were popularisations of the archaeology of ancient Egypt.\nHis book about the Carthaginian general, Hannibal: Enemy of Rome, is notable in its preparation: Cottrell traveled the ostensible path Hannibal took across the Alps into the Po River valley and incorporated his personal findings with his research in the book's narrative.", "link_mentions": [{"page": "Howard Carter", "response": ["*In the BBC Radio play The Tomb of Tutankhamen, written by Leonard Cottrell and first broadcast in 1949, he is voiced by Jack Hawkins. "]}, {"page": "Battle of the Trebia", "response": ["There is debate among modern historians as to the Roman losses. Dexter Hoyos states that the only Roman survivors were the infantry who broke through the Carthaginian centre. Richard Miles says that \"many\" not in this group were killed; although Nigel Bagnall writes that this was only a minority of the Roman cavalry. Adrian Goldsworthy states that the Romans \"suffered heavily\", but that \"numbers of soldiers\" straggled into Placentia or one of their camps in addition to the formed group of 10,000; while John Lazenby argues that in addition outside of the 10,000, \"few\" infantry escaped, although \"most\" of the cavalry did; as does Leonard Cottrell. According to Paul Erdkamp, the Romans lost 20,000 killed during the battle, half of their force; this excludes those captured."]}, {"page": "Cottrell", "response": ["*Leonard Cottrell, British writer and archaeologist"]}, {"page": "Battle of Ager Falernus", "response": ["The battle itself was smaller in scale when compared to the Battle of Ticinus. Although Fabius was not duped by Hannibal’s moves, his blocking force at the pass was. Leonard Cottrell, in his book “Hannibal: Enemy of Rome\", wrote that the trick was designed to be recognized by Fabius as a trick. Hannibal had studied the mind of his opponent, and devised a plan to make him do exactly what Hannibal needed him to do. Fabius thought Hannibal was trying to get him to fight a night action over broken, uneven ground, where Roman infantry would lose their greatest advantages of discipline and teamwork, as their formations would become disorganized. Since Hannibal was choosing the battle ground and the hour, he might have sprung other surprises to gain further advantages on the Romans. Fabius predictably did what Hannibal had anticipated: nothing. The Romans guarding the pass, with no Fabius to keep them in check, thought they were doing their job when they rushed out, preventing a Carthaginian escape. Again, they acted as Hannibal had anticipated, and the Carthaginians took advantage of their actions to escape."]}, {"page": "List of people from Wolverhampton", "response": ["* Leonard Cottrell (1913–1974) – author and journalist"]}, {"page": "List of Desert Island Discs episodes (1961–1970)", "response": ["|||Leonard Cottrell||Collected works by Homer||Bronze statue of Poseidon||more"]}, {"page": "Laurence Gilliam", "response": ["Throughout the post-war period—the ‘golden age of radio’—Gilliam did more than anyone in the BBC to recruit and encourage poets and writers to contribute work for the BBC features department. He showed a gift for leadership which inspired devoted loyalty in a group of the most talented writers and producers in radio history, including Louis MacNeice, Douglas Cleverdon, Leonard Cottrell, Jennifer Wayne, Christopher Sykes, W. R. Rodgers, Francis Dillon, Nesta Pain, Wynford Vaughan Thomas, Alan Burgess, and D. G. Bridson."]}, {"page": "Literature of Birmingham", "response": ["* Leonard Cottrell was a Brummie author, archaeologist, commentator, and producer for the British Broadcasting Corporation.  He also worked as a war correspondent for the Royal Air Force, and later wrote many work on ancient history became the editor of the Concise Encyclopaedia of Archaeology (1965).See a list of these on Google Books"]}, {"page": "Cottrell, Leonard", "response": ["#redirectLeonard Cottrell"]}]}}