{"wiki_id": "http://www.wikidata.org/entity/Q6525615", "itemLabel": "Leonard Parkin", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Leonard_Parkin", "wikipedia_page": {"main": "Leonard Parkin (2 June 1929 – 20 September 1993) was a British television journalist and newscaster who worked for both the BBC and ITN.\nBorn in Thurnscoe, West Riding of Yorkshire, he was educated at Hemsworth Grammar School, Yorkshire. He worked as a reporter on the BBC's Panorama for many years before joining ITN, initially as a reporter but later as a newscaster for ITV's main early evening bulletins in the 1970s. In November 1963, he was deputy correspondent for the BBC in Washington and his Radio Newsreel report on the assassination of John F. Kennedy is a historic recording. Between 1976 and 1987 he was, along with Peter Sissons, one of the main presenters for ITN's News at One, and often hosted the News at 5:45 in the late 1970s and early 1980s. He regularly presented News at Ten from October 1967, shortly after its launch, until January 1976.\nParkin was one of the most popular newsreaders ever to work for ITN, and, like his former co-host of the News at 5:45 Michael Nicholson, he became renowned for his cheerful and friendly disposition. He always began the News at One by saying \"hello, good afternoon..\" then reading the headlines. During school holidays, he would also make a point of welcoming younger viewers at the start of the News at One. When he presented News at 5:45 on 24 October 1979, he was the first ITN newscaster to be seen on ITV following the conclusion of the ITV strike of August–October 1979.\nDuring the Falklands War of 1982, Parkin temporarily replaced Michael Nicholson as main presenter of the News at 5:45, and broke to the UK the news that the General Belgrano had been sunk in a controversial incident during the Falklands War. He and Nicholson provided a detailed report of this incident. He left ITN in 1987, returning to his native Yorkshire to make a series of documentaries about the county for Yorkshire Television, entitled Pieces of Parkin.\nA Freemason, he was a member of a Lodge which met at The Cloisters in Letchworth Garden City.\nParkin died of cancer of the spine, in Scarborough, on 20 September 1993.", "link_mentions": [{"page": "Peter Sissons", "response": ["Sissons joined ITN in 1964, working his way up to the role of journalist. He was wounded by gunfire whilst covering the Biafran War in 1968, sustaining severe nerve damage in his left leg. After recovering from his injuries, he became ITN's Industrial Editor, covering many high-profile disputes during the 1970s. On 6 September 1976, Sissons joined the list of presenters of ITN's lunchtime ITN News at One bulletin, alternating with Leonard Parkin. He also co-presented ITN's 1983 General Election Night programmes (with Sir Alastair Burnet and Martyn Lewis) and in 1987 (with Burnet and Alastair Stewart)."]}, {"page": "Thurnscoe", "response": ["*Leonard Parkin (1929-1993), Journalist and newscaster on ITN’s News at One and News at 5:45. Originally with the BBC."]}, {"page": "ITV News", "response": ["On 16 October 1972, a twenty-minute lunchtime bulletin was introduced into the ITV schedule – First Report, which was hosted by Robert Kee and ran from 12:40 to 13:00. This was followed on 6 September 1976 by the introduction of a new evening bulletin, the News at 545, which ran from 17:45 to 18:00; Michael Nicholson and Leonard Parkin alternated in the newscaster chair. By this time, with three regular ITN bulletins throughout the day – and each having their own look and specially composed music – the original ITN Non-Stop theme music was only seen on generic summaries and weekend bulletins. In 1982, it was finally replaced with a synthesised alternative.", "First Report was moved to 13:00 and retitled News at One in 1976; Leonard Parkin and Peter Sissons alternated in the presenter's chair. Michael Nicholson continued as main newscaster of the News at 545, with Martyn Lewis replacing Parkin as the relief presenter. In 1986, Nicholson left newscasting to return to war reporting and was replaced by Alastair Stewart. Leonard Parkin retired in 1987, and Peter Sissons became a main newscaster for ITN's Channel 4 News (before moving to the BBC in 1989) – it was at this point that the programme revamped. It was moved to 12:30, and appropriately became the News at 12:30. Julia Somerville joined ITN from the BBC's Nine O'Clock News to host the new programme, with John Suchet and Jon Snow acting as relief presenters. In 1988, the programme returned to its original slot and once again became the News at One; the presenting line-up remained unchanged. In 1989, Somerville left the programme to become a main presenter of News at Ten, leaving Suchet to become the main lunchtime newscaster – the programme was revamped once more. In 1991, the programme moved back to the 12:30 slot, but retained the studio setting. In 1993, graphics were relaunched to bring it in line with other ITN news bulletins.", "ITN's regular newscasting team in the 1980s included Alastair Burnet, Sandy Gall, Leonard Parkin, Alastair Stewart, Trevor McDonald, Julia Somerville, Carol Barnes, Fiona Armstrong, John Suchet, Nicholas Owen, and a host of well-known reporters and correspondents."]}, {"page": "Reginald Bosanquet", "response": ["Bosanquet was on the staff of ITN from its earliest days, initially as a sub-editor. He later reported from many parts of the world and was diplomatic correspondent for four years, before becoming one of its lead anchors during the late 1960s and 1970s, often working alongside Andrew Gardner, Leonard Parkin, Sandy Gall and, mostly late in his tenure, Alastair Burnet."]}, {"page": "ITV News at Ten", "response": ["The arrival of the new 30-minute programme allowed ITN to give a more in-depth and detailed treatment of serious news for the first time on British television, as well as coverage of populist stories and issues that would attract the viewing audience. The programme built on these concepts by introducing reporter packages, not the norm then but now a staple of television news, and a team of two newscasters taking turns to read stories instead of a sole presenter: a two-man team would inject personality into television news, as well as allow breaking news to be handed to the newscaster not in vision. The original newscasting team included Alastair Burnet, Andrew Gardner, Reginald Bosanquet, George Ffitch and Leonard Parkin. News at Ten also employed several other distinctive features which proved popular with viewers: the use of Big Ben's chimes (or \"bongs\") to separate the news headlines being read in the opening sequence, and the \"… And Finally\" report – a quirky and often humorous end piece designed to send the viewing audience to bed \"on a high note\" after 30 minutes of hard news coverage.", "*Leonard Parkin (1968–1976)"]}, {"page": "ITV Evening News", "response": ["Alastair Burnet was the original presenter of the News at 545. Michael Nicholson fronted the bulletin on Fridays, and was also a relief presenter. Immediately after the animated visual 'roll' and electronic theme music at the beginning, an announcer intoned in a hushed tone: \"The news at 5:45, with Alastair Burnett/Michael Nicholson\". Other relief presenters in the late 1970s included Leonard Parkin, who at the time also regularly hosted the News at One, and Martyn Lewis. In March 1980, when Burnet departed the 545 to present News at Ten, Nicholson replaced him as lead presenter, with Carol Barnes taking over as relief presenter. In September 1986, Nicholson left the 545 to return to war reporting, and was replaced by Alastair Stewart.", "*Leonard Parkin (1976–1987)"]}, {"page": "ITV Lunchtime News", "response": ["The programme was first broadcast on 16 October 1972 as First Report, a twenty-minute bulletin presented by Robert Kee at 12:40pm. The bulletin was moved to 1:00pm on 7 September 1974 and retitled as News at One on 6 September 1976. Leonard Parkin and Peter Sissons alternated as the programme's lead presenters in the same year after Kee's departure.", "*Leonard Parkin (1976–1987)"]}, {"page": "History of ITV", "response": ["* 5.45pm  ITN News at 5.45 with Leonard Parkin "]}, {"page": "ITV Weekend News", "response": ["*Leonard Parkin (1976–1987)"]}, {"page": "Michael Nicholson", "response": ["Nicholson also had a sporadic decade-long stint as a television newscaster, becoming known as a presenter on ITN's early evening News at 545. Initially hosting the bulletin on Fridays from its introduction in September 1976 (due to the inclusion of a World News segment on that day), and as a relief newscaster, he began alternating with Leonard Parkin as the regular host of the 545 from 1980 until 1982, when as aforementioned he was recalled as a war reporter to cover the Falklands War, providing a memorable report from Argentina about the sinking of the ARA General Belgrano during the conflict."]}, {"page": "The Cloisters (Letchworth)", "response": ["* Leonard Parkin, ITN newscaster"]}, {"page": "Parkin (surname)", "response": ["* Leonard Parkin (1929–1993), British television and news presenter"]}, {"page": "List of ITV journalists and newsreaders", "response": ["* Leonard Parkin – reporter and newscaster with ITN from circa 1973 to 1987; between 1976 and 1987 he was one of the main presenters for ITN's News at One; often hosted the News at 5:45 in the early 1980s; occasionally presented News at Ten; and retired in 1987; subsequently presented documentaries for Yorkshire Television until his death in 1993."]}, {"page": "List of news presenters", "response": ["* Leonard Parkin, ITN newsreader in the 1970s and 1980s"]}, {"page": "1993 in British television", "response": ["|Leonard Parkin"]}, {"page": "1987 in British television", "response": ["*17 July - ITN's News at One airs for the last time, it also marks Leonard Parkin's retirement from newsreading."]}, {"page": "List of ITV News on air staff", "response": ["*Leonard Parkin (1967–1987)"]}, {"page": "Outwood Academy Hemsworth", "response": ["* Leonard Parkin, journalist at ITN in the 1970s and 1980s on the News at Ten and 5.45 News"]}, {"page": "Parkin, Leonard", "response": ["#redirectLeonard Parkin"]}]}}