{"wiki_id": "http://www.wikidata.org/entity/Q6529443", "itemLabel": "Les Dyl", "itemDescription": "English rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Les_Dyl", "wikipedia_page": {"main": "Leslie \"Les\" P. Dyl (born 1 December 1952) is an English former professional rugby league footballer who played in the 1970s and 1980s. He played at representative level for Great Britain and England, and at club level for Leeds and Bramley, as a wing or centre, i.e. number 2 or 5, or, 3 or 4.", "link_mentions": [{"page": "1977 Rugby League World Cup", "response": ["|LC ||4|| Les Dyl", "The Australian's opened the scoring through Allan McMahon who scored in the Paddington corner. Michael Cronin kicked the sideline conversion and Australia led 5–0. Great Britain soon his back with a try to Steve Pitchford. George Fairbairn converted the try to lock the scores at 5–5. The match was then highlighted by a 60-metre try to Australian centre Russel Gartner who pounced on a dropped ball from Lions fullback Fairbairn after a Great Britain scrum win to race away and score. Only converging defence from Gartner's opposite number Les Dyl kept him from scoring closer to the posts, giving Cronin a difficult conversion from midway between the posts and the touch line. Cronin missed the attempt and the Australian's led 8–5. Fairbairn then kicked a penalty goal to make the scores 8–7 closing in on half time.", "*  Les Dyl"]}, {"page": "Leeds Rhinos", "response": ["!  Les Dyl"]}, {"page": "1972–73 Northern Rugby Football League season", "response": ["A second try from Mike Stephenson on 44 minutes extended Dewsbury's lead and though Leeds hit back with tries by Graham Eccles, Phil Cookson and Les Dyl, it was not to be with Nigel Stephenson converting his own try to complete a resounding 22-13 success. Leading journalist Jack Winstanley wrote at the time: \"Dewsbury's win sprung from a superb team effort that paid ample tribute to the coaching and inspiration of (coach) Tommy Smales. They bewildered a jaded Leeds outfit with a series of scissors moves and dummy passes that might have looked grossly over-elaborate had they not worked to such perfection.\" The Harry Sunderland Trophy for man-of-the-match went to Mike Stephenson. Greg Ashcroft, Jeff Grayshon and Alan Bates also played in the champion Dewsbury side."]}, {"page": "1982 Kangaroo tour of Great Britain and France", "response": ["|CE ||4||Les Dyl", "|CE ||4|| Les Dyl", "In his test debut for Australia, back row forward Wayne Pearce was judged as the Man of the Match thanks to his defensive work and having a hand in a number of tries as well as backing up a break by Max Krilich and Craig Young to race away and score a 45-metre try with only French referee Julien Rascagneres anywhere near him. Centre Mal Meninga, playing his 4th test and the first of what would eventually be a record 17 Ashes tests against Great Britain, scored the opening try of the game after good lead up work by Peter Sterling and Pearce, then easily palming off Les Dyl and outpacing fullback George Fairbairn to score in the corner. Meninga also kicked 8 of 10 goals for a personal haul of 19 points. His 8 goals also broke the record number of goals for an Australian in a test in England, the old record of 7 had been set by Graeme Langlands in the second test of the 1963–64 Kangaroo tour (the famous \"Swinton Massacre\" test). It also equaled the most goals for an Australian in an Ashes test, the record was previously the sole property of Noel Pidding who kicked 8 in the first test of the 1954 series at the Sydney Cricket Ground."]}]}}