{"wiki_id": "http://www.wikidata.org/entity/Q6524049", "itemLabel": "Leo McKinstry", "itemDescription": "British journalist and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Leo_McKinstry", "wikipedia_page": {"main": "Leo McKinstry (born 1962) is a British journalist, historian and author.", "link_mentions": [{"page": "Archibald Primrose, 5th Earl of Rosebery", "response": ["Robert Rhodes James, who wrote a biography of Rosebery in 1963 (when homosexuality was still illegal in Britain), makes no mention of homosexual relationships at all, while for Leo McKinstry, who was writing in 2005, the evidence that Rosebery was homosexual is circumstantial. Michael Bloch, in 2015, has, however, no doubt that Rosebery was at least romantically interested in men, making him one of the four figures presented in the first chapter of his book on homosexual and bisexual British politicians of the 20th century. In his view, any remaining evidence (of which he gives a long list) can only be circumstantial in any case, considering Rosebery's paranoid taste for secrecy."]}, {"page": "Jack Hobbs", "response": ["While qualifying, Hobbs played for Surrey's Colts side and for the Club and Ground Eleven, both of which were teams for young cricketers. Although he made some substantial scores, according to his biographer, Leo McKinstry, \"just as he had done for much of his early life, [Hobbs] performed satisfactorily without doing anything startling\".McKinstry, p. 48. In the 1903 season he scored 480 runs at an average of 34.29, as well as taking 19 wickets as his bowling improved.McKinstry, p. 49. The following season, Hobbs played only for the Club and Ground, increased his average to 43.90, and impressed people connected with the Surrey county side. His sudden improvement brought about a temporary return to the Cambridgeshire team, for which he remained qualified by birth. His batting was praised, particularly when he scored 195 and 129 in two matches against Hertfordshire. In total, he scored 696 runs in 13 innings for Cambridgeshire, averaging 58.00.McKinstry, pp. 49–50."]}, {"page": "Lord Randolph Churchill", "response": ["In October 1867, Churchill matriculated at Merton College, Oxford. At Oxford, Primrose – now with his own courtesy title of Lord Dalmeny – was along with Churchill a member of the Bullingdon Club, and joined him at the club's champagne-fuelled parties.Frank Harris, My Life and Loves, 1922–27; p. 483 Randolph was frequently in trouble with the university authorities for drunkenness, smoking in academic dress, and smashing windows at the Randolph Hotel. His rowdy behaviour was infectious, rubbing off on friends and contemporaries; he gained a reputation as an enfant terrible.Leo McKinstry, Rosebery: Statesman in Turmoil, pp. 23, 33 He had a liking for hunting, but was also a well-read historian. He gained a second-class degree in jurisprudence and modern history in 1870.", "Churchill experienced no early doubts but made many mistakes, as alluded to in Rosebery's biography.Rosebery, Ld Randolph, (1906);Leo McKinstry, Rosebery: Statesman in Turmoil, p. 58 He never regretted being an early friend and admirer of the Disraelis. His behaviour was, however, the later cause of dissension in his relations with a colder, more aloof, disciplinarian Salisbury. In 1871 Churchill and his elder brother George were initiated into the rites of Freemasonry, as later his son Winston would be."]}, {"page": "Daily Express", "response": ["* Leo McKinstry, journalist, historian and author."]}, {"page": "Geoffrey Boycott", "response": ["On 3 October 1983 the friction between Boycott and the committee culminated in a unanimous decision not to offer Boycott a contract for the next season. This generated much protest from Boycott supporters, who rallied, calling for his reinstatement at a meeting on 9 October in Ossett, Yorkshire. Bill Athey left the club at this time, and while Boycott in his biography maintained that he had no reason to believe that his actions had caused Athey's departure, Athey later stated to biographer Leo McKinstry that \"Boycott's attitude and the atmosphere he created had everything to do with my decision to leave Yorkshire.\" The \"Members 84 Group\", consisting of strong supporters of Boycott, met regularly to clamour for the batsman's reinstatement.McKinstry, pp. 240–241. Their leader, Peter Briggs, stated \"Geoffrey Boycott is a giant playing among pygmies.\"Hopps, p. 241.", "In early 2008, there was speculation that Boycott would be given a role on the England coaching staff, pertaining in particular to the coaching of Andrew Flintoff back from injury. On 8 May 2008, however, the ECB revealed that Boycott would not hold such a position. The two had been involved in the past, and while Flintoff is an admirer of Boycott, the ECB stressed any coaching relationship would only be informal. Boycott, however, used to give informal talks to younger cricket players during his career, and the media speculated that he might find a place coaching the England U19s. Boycott continued in his commentating career for TMS, criticising the England team's approach to the ODI matches under Pietersen in India in November 2008. Also in November, Leo McKinstry published a new biography of Boycott."]}, {"page": "Alf Ramsey", "response": ["After the outbreak of the Second World War in 1939, Ramsey was conscripted into the British Army on 24 June 1940. He was assigned to the Duke of Cornwall's Light Infantry and underwent his initial training in Truro, where he and other recruits were housed in a hotel commandeered by the army. Ramsey found the experience a thrilling adventure. \"Until I travelled to Cornwall, the longest journey I had undertaken was a trip to Brighton by train\", he recalled. \"It was the first time I had ever been into a hotel! Even with us sleeping twelve to a room, on straw mattresses, could not end for me the awe of living in a swagger hotel.\" \"That set the tone for Alf's war\", Leo McKinstry suggests in his 2010 biography; attached to his regiment's 6th Battalion, Ramsey spent the entire war in Britain on home defence duties. The training was still physically demanding though, and, in Ramsey's words, made him \"a fitter young fellow than when I reported for duty as a grocery apprentice from Dagenham.\"", "It is alleged that some of the FA's officials had long held grudges against Ramsey. The British journalist and author Leo McKinstry said \"England's most successful manager would have had a legacy fit for a hero had it not been for the malevolence of the FA chief Harold Thompson\". Alan Ball described the treatment of Ramsey as \"the most incredible thing that ever happened in English football\"."]}, {"page": "Robert Crewe-Milnes, 1st Marquess of Crewe", "response": ["He did not much like public speaking, but that was probably because he contrasted sharply with Lloyd George's firebrand delivery and populist demagogy.Pope-Hennesey, p.150David, pp. 120–1. Crewe himself tended to hesitate too long time with \"pregnant pauses\", as his speech became stilted. He was above all fastidious in the royal tradition of Charles I.Pope-Hennessey, p. X. Edwin Montagu claimed, somewhat sardonically, that one of his female constituents died of boredom listening to the Marquess. His father-in-law, Lord Rosebery, had been Liberal Leader six years before he himself became Leader in the House of Lords of that party. Rosebery thought Crewe a reliable politician but a poor speaker. When it was announced to him that his daughter, the Marchioness of Crewe, was in labour, Rosebery is said to have quipped \"I hope that her delivery is not as slow as Crewe's\".Leo McKinstry, Rosebery; Statesman in Turmoil. Always at ease in London High Society, Crewe hosted the dinner party at which Winston Churchill met Clementine Hozier."]}, {"page": "Strategic bombing during World War II", "response": ["* The Revenger's Tragedy by Leo McKinstry (in New Statesman)"]}, {"page": "Portora Royal School", "response": ["*Leo McKinstry, journalist and author"]}, {"page": "Harold Warris Thompson", "response": ["British journalist and author Leo McKinstry wrote that \"England's most successful manager would have had a legacy fit for a hero had it not been for the malevolence of the FA chief Harold Thompson.\""]}, {"page": "Michael Crick", "response": ["After the Archer documentary,Andrew Anthony \"Teacups, hairdryers, European Cups...\", The Observer, 12 May 2002 Crick began work on his biography of Sir Alex Ferguson which was published in 2002. Reporting \"utterly misplaced\" speculation that Crick would not be objective because of his lifelong support of Manchester United, Leo McKinstry wrote for the Daily Telegraph that Ferguson \"has found a worthy, if hardly compliant, biographer\".Leo McKinstry \"He shouts, he swears, they score\", The Daily Telegraph (London), 19 2002"]}, {"page": "Dominic Sandbrook", "response": ["The sequel, White Heat, covering the years 1964–70 and the rise and fall of Harold Wilson's Labour government, was published in August 2006. \"Sandbrook's book could hardly be more impressive in its scope\", wrote Leo McKinstry in The Times. \"He writes with authority and an eye for telling detail.\" In November 2009, it was named by the Telegraph as \"one of the books that defined the Noughties\"."]}, {"page": "English independence", "response": ["* Leo McKinstry, journalist, historian and author"]}, {"page": "1895 vote of no confidence in the Rosebery ministry", "response": ["Archibald Primrose, 5th Earl of Rosebery had become Prime Minister in March 1894, following William Ewart Gladstone's resignation, being the personal choice of Queen Victoria. Rosebery was told by the Queen's emissary (her physician, Sir James Reid) that he was \"the only man of your party she likes and trusts\".Leo McKinstry, \"Rosebery: Statesman in Turmoil\", John Murray, 2005, p. 293. His choice over several other men with larger followings in the party, particularly Sir William Harcourt and John Morley led to inevitable tension, and Harcourt in particular did nothing to help the Government out of its difficulties. The Government was dependent on the Irish Parliamentary Party for its majority in the House of Commons, but could offer them little towards their goals as Gladstone's Second Home Rule Bill had been defeated by the House of Lords in 1893.", "Cordite was a new form of explosive which had only come into use a few years before 1895, and the Army was in the process of equipping with it. In the Army Estimates for 1895, Secretary of State for War Henry Campbell-Bannerman reported that new barrels for the Army's .303 rifles which were suitable for cordite bullets were being fitted, but that \"it is unnecessary at present to provide for more than a liberally estimated supply for one year\".\"The Army Estimates\", The Times, 8 March 1895, p. 8. The Conservative frontbench had been assured privately that there were adequate supplies, and cordite could be manufactured quickly,Leo McKinstry, \"Rosebery: Statesman in Turmoil\", John Murray, 2005, p. 379. but the party chose to raise the issue in the House of Commons on 21 June when the Army Estimates came up for debate."]}, {"page": "Criticism of multiculturalism", "response": ["The British columnist Leo McKinstry has persistently criticized multiculturalism, stating that \"Britain is now governed by a suicide cult bent on wiping out any last vestige of nationhood\" and called multiculturalism a \"profoundly disturbing social experiment\"."]}, {"page": "People's Pledge", "response": ["The campaign is credited with having had a key role in bringing about the United Kingdom European Union membership referendum, held in June 2016. Prominent Conservative MEP Daniel Hannan wrote in his 2016 book What Next? that \"The People's Pledge was the most effective popular campaign I have ever been involved with, and must be reckoned one of the most successful pressure groups in British history.\" James Forsyth, writing in The Spectator, said that the campaign's recruitment of Boris Johnson as a supporter had made an EU referendum almost certain: \"Boris Johnson's decision while campaigning last month to sign up to the campaign for an in/out referendum on EU membership could be a key moment in the history of the Conservative party – the moment when the party's balance of power tipped decisively in favour of a referendum.\" Along with Forsyth, Paul Goodman of ConservativeHome and Leo McKinstry of the Daily Express have cited the success of the campaign as a main reason why a referendum became a possibility.Could George Osborne's leadership ambitions deliver a referendum, ConservativeHome, 11 May 2012.David Cameron, Ed Miliband, Nick Clegg: We demand our EU referendum, The Daily Express, 14 May 2012."]}, {"page": "McKinstry", "response": ["*Leo McKinstry (born 1962), Northern Irish writer and journalist"]}, {"page": "Early life of Jack Hobbs", "response": ["While qualifying, Hobbs played for Surrey's Colts side and for the \"Club and Ground\" Eleven, both of which were teams for young Surrey cricketers. He made some substantial scores, including 86 runs in his first match for the Club and Ground, but according to Hobbs' biographer, Leo McKinstry, \"Just as he had done for much of his early life, [Hobbs] performed satisfactorily without doing anything startling\".McKinstry, p. 48. He scored 480 runs at an average of 34.29, as well as taking 19 wickets as his bowling improved.McKinstry, p. 49. The following season, Hobbs played only for the Club and Ground, increased his average to 43.90, and impressed people connected with Surrey. Hobbs' sudden improvement brought about his return to the Cambridgeshire team. He impressed many critics with his batting, particularly when he scored 195 and 129 in two matches against Hertfordshire. In total, he scored 696 runs in 13 innings for Cambridgeshire, averaging 58.00.McKinstry, pp. 49–50. Wisden Cricketers' Almanack, in its review of Cambridgeshire's season, commented: \"A new player in Hobbs rendered fine services as a batsman and came out with a remarkable average.\"Quoted in McKinstry, p. 50."]}, {"page": "List of cricketers' biographies and autobiographies", "response": ["| 2011 || Jack Hobbs: England's Greatest Cricketer || Jack Hobbs || Leo McKinstry"]}, {"page": "British Sports Book Awards", "response": ["*2003 \tJack & Bobby: Story of Brothers in Conflict – Leo McKinstry (Collins Willow)", "*2007 \tSir Alf – Leo McKinstry (HarperSport)"]}, {"page": "List of international cricket five-wicket hauls by Richie Benaud", "response": ["In cricket, a five-wicket haul (also known as a \"five–for\" or \"fifer\") refers to a bowler taking five or more wickets in a single innings. This is regarded as a notable achievement, and as of December 2015 only 45 bowlers have taken at least 15 five-wicket hauls at international level in their cricketing careers. Richie Benaud, a leg spinner and former captain of the Australia cricket team, played 63 Tests for his country between 1952 and 1964. He took 248 wickets at an average of 27.03, including 16 five-wicket hauls. The cricket almanack Wisden named him one of their Cricketers of the Year in 1962. He was inducted into the Australian Cricket Hall of Fame in 2007, and into the ICC Cricket Hall of Fame as one of the inaugural members in January 2009. Leo McKinstry, a cricket writer, in 1998 described Benaud as \"one of cricket's greatest legends\" and \"one of the great all-rounders\", and further noted him being the first to take 200 wickets and make 2,000 runs in Tests."]}, {"page": "Ken: The Ups and Downs of Ken Livingstone", "response": ["Leo McKinstry, for The Spectator, wrote:BBC reporter Andrew Hosken has certainly done a thorough job, conducting over 200 interviews for the book and mastering the alphabet soup of hard-Left-wing sectarian politics in London. His labours have unearthed some intriguing material, including the revelation that Livingstone has fathered five children by three different women... More disturbing is the account of Livingstone's long-term involvement with the loathsome Workers Revolutionary Party, whose leader Gerry Healy was a vile demagogue, bully, liar, rapist, drunk and fraudster. Through diligent research, Hosken provides damning evidence that Livingstone's radical newsletter of the early Eighties, Labour Herald, was printed by the WRP when the group was bankrolled by the Libyan regime of Colonel Gadaffi... But such revelations cannot disguise the somewhat pedestrian tone of the book."]}, {"page": "McKinstry, Leo", "response": ["#REDIRECT Leo McKinstry"]}, {"page": "Felt Hatters' and Trimmers' Unions of Great Britain", "response": ["During World War II, the union was one of a handful of organisations specifically listed in the Nazi Black Book as dangerously Marxist.Leo McKinstry, Operation Sealion  In 1939, the unions began admitting unskilled workers in the industry.  By 1943, the men's union had a membership of 8,747, and the women's union had 2,833 members.H. A. Silverman, Studies in Industrial Organization, p.167  However, this proved a peak, and by 1980, memberships had fallen to 526 and 627 respectively."]}]}}