{"wiki_id": "http://www.wikidata.org/entity/Q6529837", "itemLabel": "Les Parry", "itemDescription": "English footballer (born 1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Les_Parry_(footballer)", "wikipedia_page": {"main": "Les Parry (born 3 November 1953) is an English former footballer. He played for Tranmere Rovers as a centre back over 250 times between 1975 and 1983.\nHe made his debut for Tranmere in an away fixture against Brentford, a 2–0 loss on 9 October 1972. His first career goal came against Chesterfield in 2–1 home win in April 1977.During the 1977–78 season, Tranmere manager John King selected the same Tranmere Rovers team for 28 consecutive league games – their birthplaces are in brackets: Dickie Johnson (Huyton), Ray Mathias (Liverpool), Eddie Flood (Liverpool), Les Parry (Wallasey), Dave Philpotts (Wirral), Clive Evans (Wirral), Steve Peplow (Liverpool), Mark Palios (Liverpool), Ronnie Moore (Huyton), Bobby Tynan (Liverpool) and Russell Allen (Smethwick). It's considered to be one of the most 'local' teams in Football League history as all players bar one were born within 10 miles of Prenton Park.In Parry's testimonial year, he was sent off twice. He broke his leg, meaning that he would miss his own testimonial through injury. It took place against Derby County F.C.His last game for Tranmere was a 1–0 loss against Darlington on 1 December 1983.", "link_mentions": [{"page": "Les Parry", "response": ["Parry was appointed as physiotherapist at Accrington Stanley until the end of the 2011–12 seasonLiverpool Echo, Former Tranmere Rovers FC manager Les Parry lands physio role at Accrington Stanley, 30 March 2012.  Accessed 16 April 2012 and stayed there until joining Manchester United on 1 January 2013 to work with the development and academy squads in Athletic Development. In October 2014, Parry was awarded the prestigious Fabrice Muamba Award for Medical and Science Professional of the Year.http://fcbusiness.co.uk/news/article/newsitem=3564/title=sterling,+dyche,+dalglish+-+big+winners+at+mbna+northwest+football+awards+2014"]}, {"page": "Les Parry (football player)", "response": ["#REDIRECT Les Parry (footballer)"]}]}}