{"wiki_id": "http://www.wikidata.org/entity/Q6529231", "itemLabel": "Les Bennett", "itemDescription": "English footballer (1918-1999)", "wikipedia_url": "https://en.wikipedia.org/wiki/Les_Bennett", "wikipedia_page": {"main": "Leslie Donald Bennett (10 January 1918 – 29 April 1999) was an English professional footballer who played as an inside forward for Tottenham Hotspur and West Ham United.", "link_mentions": [{"page": "January 10", "response": ["*1918 – Les Bennett, English footballer and manager (d. 1999)"]}, {"page": "1998–99 in English football", "response": ["*29 April 1999: Les Bennett, 81, played 272 league games at inside-forward for Tottenham Hotspur between 1946 and 1954, and was a key player in the title winning side of 1951. He completed his senior career with West Ham United before playing for a further five years at non-league level, finally hanging up his boots in 1960 at the age of 42."]}, {"page": "Peter Murphy (footballer, born 1922)", "response": ["Manager Arthur Rowe took him to Tottenham Hotspur in June 1950 for a fee of £18,500. Murphy scored on his debut in a 4-1 victory over Bolton Wanderers at Burnden Park in August 1950. He played as an inside forward, deputising for the injured Les Bennett in the \"push and run\" side that won the League championship in 1950–51. On Bennett's return to fitness, Murphy found himself being played out of position on the left wing, so when Birmingham City bid £20,000 for him in January 1952 he was willing enough to drop down a division to return to the Midlands."]}, {"page": "Bennett (name)", "response": ["*Les Bennett (1918–1999) Footballer for Tottenham Hotspur and West Ham United"]}, {"page": "List of Tottenham Hotspur F.C. seasons", "response": ["|Les Bennett", "|Les Bennett"]}, {"page": "History of Tottenham Hotspur F.C.", "response": ["On 3 September 1939 Neville Chamberlain declared war, and league football was abandoned with only three games played.  Nevertheless, matches continued to be arranged and played during the Second World War. The London clubs first played in the Wartime League and Football League War Cup, and Spurs won the Regional League South 'C' in 1940. After a reorganisation in 1941, they also competed in the Football League South. Owing to the difficult wartime conditions, Spurs along with other London clubs refused to travel long distances for the matches drawn up by the Football League and decided to run their own competitions: London War League and London War Cup. They (eleven London clubs and five other clubs from the south) were temporarily expelled from the Football League; after paying a £10 fine they were readmitted, but they played in the Football League South in the way the London clubs had suggested. McWilliam went back to the North during the war and the team was managed by Arthur Turner; under him Spurs won the regional league twice. Charles Robert who had been chairman since 1898 died in 1943, and he was replaced by Fred Bearman. As it was difficult to field a full squad in the war years, many young players, among them Sonny Walters, Les Medley, Les Bennett and Arthur Willis, gained their first playing experience for the club in this period.  Spurs also shared White Hart Lane with Arsenal when Highbury was requisitioned by the government and used as an Air Raid Precautions centre."]}]}}