{"wiki_id": "http://www.wikidata.org/entity/Q6523797", "itemLabel": "Leo Green", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Leo_Green", "wikipedia_page": {"main": "Leo Green (born 30 August 1972) is a British musician and broadcaster.", "link_mentions": [{"page": "Ella Fitzgerald", "response": ["On April 25, 2017, the centenary of her birth, UK's BBC Radio 2 broadcast three programmes as part of an \"Ella at 100\" celebration: Ella Fitzgerald Night introduced by Jamie Cullum, Remembering Ella introduced by Leo Green and Ella Fitzgerald – the First Lady of Song introduced by Petula Clark."]}, {"page": "Benny Green (saxophonist)", "response": ["Benny Green married Antoinette Kanal in 1962, and had three sons and one daughter. One son, Dominic Green, is a guitarist who has published a book about his father; Benny Green Words and Music (2003). Another, Leo Green, has followed in his father's footsteps as a highly regarded saxophonist and, more recently, Radio 2 broadcaster."]}, {"page": "Crazy Legs (album)", "response": ["* Leo Green  -  tenor saxophone on \"Say Mama\""]}, {"page": "Out of Season (Beth Gibbons and Rustin Man album)", "response": ["*Leo Green – Horn Section"]}, {"page": "Aldenham School", "response": ["*Leo Green (b. 1972), British musician and broadcaster"]}, {"page": "Mose Allison", "response": ["|With Van Morrison (vocals, harmonica), Georgie Fame (vocals, Hammond organ), Ben Sidran (vocals, piano), Alec Dankworth (bass), Ralph Salmins (drums), Guy Barker (trumpet), Pee Wee Ellis (tenor sax), Leo Green (tenor sax), Robin Aspland (Wurlitzer piano)"]}, {"page": "Days Like This (Van Morrison album)", "response": ["*Leo Green — tenor saxophone"]}, {"page": "How Long Has This Been Going On (Van Morrison album)", "response": ["Pee Wee Ellis played saxophone and also served as arranger, along with Fame, Morrison and saxophonist Leo Green. There were more cover songs on this album than usual with Morrison's albums. Annie Ross appeared on  \"Blues Backstage\" and also on the song, \"Centerpiece\". This song is also featured on the 2007 compilation album, The Best of Van Morrison Volume 3, along with \"Moondance\" and \"That's Life\".  \"Heathrow Shuffle\" is an instrumental composition from the 70's that was brought back on this album.  Morrison had performed this song when he played at the Montreux Jazz Festival in 1974, and it is included on his 2006 DVD, Live at Montreux 1980/1974.", "*Track 1 arranged by Leo Green.", "*Leo Green – tenor saxophone"]}, {"page": "Tell Me Something: The Songs of Mose Allison", "response": ["*Leo Green – tenor saxophone"]}, {"page": "The Healing Game", "response": ["The title song \"The Healing Game\" is about the tradition of Belfast street singing.  Van Morrison in Q magazine said, \"People find it incredible when I tell them that people used to sing and play music in the street.  I think there's a whole oral tradition that's disappeared.\" The song, \"Rough God Goes Riding\" is taken from a W. B. Yeats poem \"The Second Coming\" with its figure from the Apocalypse \"rough beast\".  Leo Green's saxophone follows Morrison's voice like a twin brother.  In \"Waiting Game\" he is \"the brother of the snake\" which Brian Hinton says refers to both his lost friend Jim Morrison (known for writing about \"The Lizard King\"), and the Garden of Eden. \"Piper at the Gates of Dawn\"  follows the children's book, The Wind in the Willows closely and Paddy Moloney plays uillean pipes with Phil Coulter on piano.  On \"Burning Ground\" the singer relives a common scene from his childhood when jute was shipped to Belfast from India.Hinton, Celtic Crossroads, p.333-336", "*Leo Green – tenor saxophone, background vocals"]}, {"page": "Back on Top (Van Morrison album)", "response": ["*Leo Green - tenor saxophone (2008 reissue)"]}, {"page": "Beverley Knight", "response": ["In 2019, Knight celebrated 25 years in music with the release of the live album BK25 which was recorded with the Leo Green Orchestra.", "On 8 November 2019, Knight released a live album, BK25 which was recorded in May 2019 at the Royal Festival Hall in London with the Leo Green Orchestra. The albums celebrates Knight's 25 years of music."]}, {"page": "Beverley Knight discography", "response": ["|align=\"left\"| BK25: Beverley Knight with the Leo Green Orchestra - Live at the Royal Festival Hall"]}, {"page": "Dominic Green (writer and musician)", "response": ["Green is the son of the saxophonist and writer Benny Green and actress Toni Kanal, and the brother of saxophonist and BBC Radio presenter Leo Green. He read English Literature at St John's College, Oxford. Subsequently, he read for an AM in Jewish Studies at Harvard University, and a PhD in Comparative History at Brandeis University, where he was the Mandel Fellow in the Humanities."]}, {"page": "Branscombe", "response": ["July 2013 saw the inaugural Branscombe Music Festival, hosted by BBC Radio 3 presenter Petroc Trelawny. Performers included the Carducci String Quartet, Philip Higham (cello), Ailyn Pérez and Stephen Costello with Iain Burnside (piano), the Leo Green Experience jazz band and the Trelights Brass Quintet."]}, {"page": "Sounds of the 60s", "response": ["For several years in the 1990s and a couple of years in the 2010s, Radio 2 carried a complementary show of music from the 1950s, Sounds of the 50s, which was presented by singer and entertainer Ronnie Hilton and later by Leo Green. In the 2000s, there was also Sounds of the 70s, a title first used in 1970 for a daily late-night show of \"progressive\" music on Radio 1. Radio 2's version of Sounds of the 70s was presented by singer-songwriter Steve Harley and now by Johnnie Walker. Sounds of the 80s was launched on Radio 2 on 5 October 2013, was presented by Sara Cox and now by Gary Davies. Sounds of the 90s was launched on 19 March 2020 and is presented by Fearne Cotton."]}, {"page": "Mike Sanchez", "response": ["In February 1992 Lopez left and Leo Green joined on tenor saxophone followed a short time later by Nick Lunt on baritone. In March 1992 another jam session with Jeff Beck led to Beck asking the Big Town Playboys to help him to record Crazy Legs as a tribute to Cliff Gallup. Stuart Colman was brought in as the producer, and the tracks were recorded in July 1992 at the Townhouse Studios in London."]}, {"page": "Days Like This (Van Morrison song)", "response": ["*Leo Green – tenor saxophone"]}, {"page": "Sometimes We Cry", "response": ["*Leo Green – tenor saxophone"]}, {"page": "The Healing Game (song)", "response": ["*Leo Green – tenor saxophone, backing vocals", "*Horns arranged by – Leo Green and Matt Holland"]}, {"page": "Perfect Fit (song)", "response": ["*Leo Green – tenor saxophone"]}, {"page": "Rough God Goes Riding", "response": ["*Leo Green – tenor saxophone"]}, {"page": "Swing: Original Motion Picture Soundtrack", "response": ["*Leo Green - saxophone"]}, {"page": "Tara McDonald", "response": ["McDonald performed with the \"Leo Green experience\" as a guest vocalist at jazz venues in the UK like Ronnie Scott's. She performed at a 2008 show for the charity Childline Rocks at O2 Indigo, London. In 2011 McDonald performed at the festival 24hrs of Burning House at Smederevo Fortress, Serbia."]}, {"page": "Burning Ground", "response": ["*Leo Green – tenor saxophone", "*Horns arranged by – Pee Wee Ellis and Leo Green"]}, {"page": "BBC Radio 2 Country", "response": ["| || Michael Ball || Leo Green"]}, {"page": "BBC Music Jazz", "response": ["* Leo Green"]}, {"page": "BBC Radio 2 50s", "response": ["* Leo Green"]}, {"page": "2021 in British radio", "response": ["*22 January – Broadcaster Leo Green announces plans to launch LGRADIO.ONLINE, an online subscription station catering for listeners who feel they are not served by popular mainstream music stations. The station will feature music from the 1950s and 1960s, as well as Motown, Jazz and Soul, and will also include archive programmes made by his father, Benny Green."]}, {"page": "Turning to Crime", "response": ["*Leo Green – tenor sax, horns arrangement"]}]}}