{"wiki_id": "http://www.wikidata.org/entity/Q6529549", "itemLabel": "Les Green", "itemDescription": "English footballer and manager (1941-2012)", "wikipedia_url": "https://en.wikipedia.org/wiki/Les_Green", "wikipedia_page": {"main": "Leslie Green (17 October 1941 – 30 July 2012) was an English footballer and manager.", "link_mentions": [{"page": "July 30", "response": ["*  2012   – Les Green, English footballer and manager (b. 1941)"]}, {"page": "Brian Clough", "response": ["On 15 November 1966, the then chairman, Ernest Ord, who was known for playing mind games with managers, sacked Clough's assistant Peter Taylor saying he couldn't afford to pay him anymore. Clough refused to accept it so Ord sacked him as well. However, there was a boardroom coup where they refused to ratify the two sackings and which instead saw Ord ousted as chairman. Both Clough and Taylor were reinstated. Hartlepools' fortunes gradually improved and the club finished in a creditable eighth place in 1966–67. Their Hartlepools team featured two players who would play for Clough and Taylor at other clubs in the future: Les Green, who would be goalkeeper in Derby's promotion-winning side of 1969, and a 16-year-old John McGovern, who would later be signed by Clough at Derby County, Leeds United and Nottingham Forest, winning several major trophies in the process. In May 1967, the duo then joined Second Division side Derby County as manager and assistant manager. In the following season, Hartlepools were promoted for the first time in their history.", "In Clough's first season, the club finished one place lower than in the previous season, but he had started to lay the foundations for his future success by signing several new players, among them Roy McFarland, John O'Hare, John McGovern, Alan Hinton and Les Green. Of the inherited squad, 11 players departed and only four were retained: Kevin Hector, Alan Durban, Ron Webster and Colin Boulton. Clough also sacked the club secretary, the groundsman and the chief scout, along with two tea ladies he caught laughing after a Derby defeat. With the additional signings of Dave Mackay and Willie Carlin in 1968, Clough and Taylor's management led Derby to become champions of Division Two, establishing the club record of 22 matches without defeat on the way."]}, {"page": "Atherstone", "response": ["125px|thumb|Les Green, 2010", "* Les Green (1941–2012) an English footballer and manager"]}, {"page": "Peter Taylor (footballer, born 1928)", "response": ["Before their arrival, Hartlepools had been forced to apply for re-election to the Football League five times in the previous six years, and Taylor stated that the squad were all free transfer signings and some of the players struggled with \"drink, debt or abandoned wives\". The two gradually turned around the club's fortunes, and started by painting Victoria Park. Taylor had little chance to show his skills in the transfer market as the club only had £7,500 to spend, £4,000 of which went on centre-half Johnny Gill. Other signings included two of Taylor's former players at Burton, defender Tony Parry and goalkeeper Les Green; Parry would go on to win the club's Player of the Year award. The pair went on to lead the club to an eighth-place finish in the Fourth Division in 1966–67 after replacing most of the playing staff, an improvement on 1965–66 when the pair had only managed an 18th-place finish. Clough had initially wanted to quit the club numerous times due to interference from chairman Ernest Ord, but Taylor insisted that they stay as they could not walk out on their first job in management. After Ord resigned as chairman Clough wanted to remain at Hartlepools, but Taylor persuaded him to take the offer to manage Derby."]}, {"page": "Colin Boulton", "response": ["Boulton was born in Cheltenham. His career began at Charlton Kings, then he played for Gloucester Police. Boulton was actually a Police Cadet in Cheltenham when he was noticed by Rams manager Tim Ward. Boulton arrived at the Baseball Ground in August 1964. His course to the first team was not always a smooth one, and it must have seemed to him that he was being overlooked as Brian Clough signed Rochdale keeper Les Green in 1968.  It took another three seasons for Boulton to get his chance in the first team. Boulton kept 23 clean sheets during the Championship-winning 1971–72 season. He was also ever present in the team that won the First Division in 1975."]}, {"page": "Brian Palgrave", "response": ["Palgrave played for Alvechurch (Southern League), before joining Walsall. Alan Buckley's \"Saddlers\" finished 11th in the Third Division in 1984–85, and then sixth in 1985–86. New boss Tommy Coakley took the club to eighth spot in 1986–87. He scored one goal in eight league games during his time at Fellows Park. He joined John Rudge's Third Division Port Vale on trial in October 1987. His only appearance at Vale Park was as a substitute in a 2–1 win over Exeter City in a preliminary round Football League Trophy match on 26 October. He was released in January 1988 and moved on to Nuneaton Borough, who were struggling near the foot of the Southern League Premier Division; manager Chris Wright signed Bedworth United defender Floyd Peltier on the same day. He made his debut at Manor Park on 16 January, in a 2–1 win over former club Alvechurch. He scored his first goal for \"Boro\" on 6 February, in a 4–1 home win over Chelmsford City. He scored nine goals from 23 appearances in the second half of the 1987–88 season, but was unable to help the club to keep out of the relegation zone. He scored eight goals from 47 matches in the 1988–89 season, which saw Nuneaton post a fifth-place finish in the Midland Division. He then went the first seven games of the 1989–90 season without scoring and was moved on to Premier Division club Bromsgrove Rovers for a \"small fee\" after new manager Les Green instigated a clear our of the playing staff. He later played for Stafford Rangers (Conference)."]}]}}