{"wiki_id": "http://www.wikidata.org/entity/Q6529634", "itemLabel": "Les Jackson", "itemDescription": "English Test and County cricketer (1921-2007)", "wikipedia_url": "https://en.wikipedia.org/wiki/Les_Jackson_(cricketer)", "wikipedia_page": {"main": "Herbert Leslie Jackson (5 April 1921 – 25 April 2007), known as Les Jackson, was an English professional cricketer. A fast or fast-medium bowler renowned for his accurate bowling and particular hostility on uncovered wickets, he played county cricket for Derbyshire from 1947 to 1963, and was regularly at, or near the top of, the English bowling averages. He played in only two Test matches for England, one in 1949 and a second in 1961. Jackson's absence from Test cricket was largely because his batting was so underdeveloped: his highest first-class score was 39 not out, and he reached 30 on only two other occasions. Between July 1949 and August 1950, Jackson indeed played fifty-one innings without reaching double figures, a number known to be exceeded only by Jem Shaw, Nobby Clark, Eric Hollies (twice), Brian Boshier and Mark Robinson. His leading competitors like Trueman, Tyson, and even teammate Gladwin were far better batsmen.\nCricket writer, Colin Bateman, noted, \"it is one of cricket’s great crimes that Les Jackson, a most respected fast bowler on the circuit throughout the 1950s, played only twice for England.  It is said that his slingy, hostile action and his blunt opinions did not please the Marylebone Cricket Club (MCC) but in an era when Alec Bedser carried England‘s attack on his own, Jackson’s omission was a scandalous loss\". Bateman added that Jackson, \"...was as feared as Truemen and Tyson in county cricket\".", "link_mentions": [{"page": "Jim Laker", "response": ["In 1949, Laker played in only one of the four Tests against New Zealand even though he took 122 wickets in the season. In this series, England chose Eric Hollies, a leg spinner, in all the matches and Laker's only selection was in the final Test at The Oval when he replaced Les Jackson, a pace bowler, as an extra spinner for the venue. The match was drawn and Laker, bowling well, took 4/78 in New Zealand's second innings. England had no overseas tour in the winter of 1949–50."]}, {"page": "Wisden Cricketers of the Year", "response": ["|  Les Jackson"]}, {"page": "1921 in the United Kingdom", "response": ["** Les Jackson, English cricketer (died 2007)"]}, {"page": "Bart King", "response": ["King toured England with the Philadelphians a third time in 1908. This tour included both first-class matches and more minor ones. The first match that was played was against South Wales in Cardiff. The Philadelphians won by 36 behind the bowling of King and Ranji Hordern. The pair took all 20 wickets of the Welsh side. After this, the first-class matches began with Worcestershire on July 9. Again the Philadelphians won and again Hordern and King took most of the wickets. This trend continued throughout the tour. In the first-class matches that King played, the Philadelphians recorded four wins and six losses. Although he was already 35 years old, King had posted extraordinary numbers in his bowling. He topped the bowling averages for the entire 1908 English cricket season at 11.01. This mark was not bettered until 1958, when Les Jackson of Derbyshire posted an average of 10.99."]}, {"page": "Whitwell, Derbyshire", "response": ["Les Jackson, England cricketer and Wisden Cricketer of the YearLes Jackson at CricketArchive.com in 1959, played for Whitwell Cricket Club and came to watch their games on a Saturday afternoon until his death in 2007."]}, {"page": "Gubby Allen", "response": ["Allen served as chairman from 1955 to 1961; under him were three other selectors, who varied throughout his period as chairman, and the serving England captain.Swanton, p. 255. Among Allen's priorities were to promote attacking batsmanship, good fielding, and for the team to bowl overs more quickly.Swanton, pp. 256–57. While looking for new batting talent, Allen often promoted young amateur batsmen; several emerged in this period, including Ted Dexter and Colin Cowdrey, who had successful careers and were part of a strong English batting line-up.Marshall, pp. 185–86. At least one member of the England team, Jim Laker, resented the preference of amateurs, whom he believed were paid more for playing than the professionals.Marshall, 253–54. Many professional cricketers thought that Allen was a snob who preferred to keep them in their place; critics believed that he deliberately restricted the career of Les Jackson for reasons of class. Allen also played the role of disciplinarian. Several of the England players enjoyed a hectic social life; it was often left to Allen to issue warnings when they transgressed.Marshall, pp. 193–96. He played an active role in home Test matches, generally attending at least three of the five days of every game, discussing tactics with the captain,Marshall, p. 201. and speaking to the press. In his first season, Allen was involved in the appointment of a new captain; Len Hutton, the serving captain, retired from the team with injury. In his place, the selectors appointed May, who served until 1959 and again in 1961; he and Allen established a good working relationship.Swanton, pp. 257–58. When May was absent from the team with illness during parts of 1960 and 1961, Cowdrey replaced him.Swanton, pp. 269–70."]}, {"page": "Brian Statham", "response": ["Statham's next chance of a Test appearance was in the 1953 Ashes series. With 101 wickets at 16.33 in the season, he was third in the national averages behind Les Jackson and Tony Lock, but even this good form could not secure a regular England selection. He played in only of the five Tests against Australia, the second one at Lord's where England played three pace bowlers and one spinner whereas they normally attacked with two seamers (always Bedser and Bailey) and two spinners. Statham was twelfth man twice in the series."]}, {"page": "Derbyshire County Cricket Club", "response": ["There have been more downs than ups in post-war years. Though runs came regularly from Arnold Hamer and less consistently from the West Indian Laurie Johnson and captain Donald Carr, the batting remained the weak point right up to the beginning of covered pitches in the 1980s. However, a series of seam bowlers served England as well as Derbyshire. The list began with Copson and continued with Cliff Gladwin, Les Jackson, Harold Rhodes, Alan Ward, Mike Hendrick and, most recently, Devon Malcolm and Dominic Cork. Spin was in short supply apart from the steady work of Edwin Smith and the under-rated all-rounder Geoff Miller, the current national selector of the England team and noted after-dinner speaker. The signing of Eddie Barlow, the famous South African, in 1976 and the lengthy period under the captaincy of Kim Barnett, starting in 1983, meant the side were rarely uncompetitive.", "|Les Jackson|| 1,670"]}, {"page": "Cliff Gladwin", "response": ["A tall right-arm medium-fast seam bowler of great accuracy and consistency, Gladwin formed, with Les Jackson, the most feared new ball attack in the English first-class game for a dozen years after World War II. Gladwin was both penetrative and mean, with around a third of his overs being maidens, and in thirteen full seasons he took 100 or more wickets twelve times, usually at an average of under 20 runs per wicket."]}, {"page": "List of Test cricketers", "response": ["Les Jackson ·"]}, {"page": "Harold Rhodes (cricketer)", "response": ["Rhodes was born at Hadfield, Derbyshire, the son of the Derbyshire all-rounder, Albert \"Dusty\" Rhodes. He made his first appearance for Derbyshire Club and Ground in 1951 and played one match for the Derbyshire second eleven in 1952. He made his first-class debut for Derbyshire in the 1953 season when he played a single match against Oxford University, but began appearing regularly in the second eleven. Although his father played for the Derbyshire in 1953, they never played in the same first-class match. Rhodes was initially an off spin bowler. He played a single first-class fixture against Scotland in the 1954 season and played four first-class matches in the 1955 season. In the 1956 season he played four matches and took his first five wicket innings against Yorkshire. He played three matches in the 1957 season. He developed to become a fast seam bowler. In the 1958 season he played a full first-class season taking 67 wickets and two five wicket innings. He began opening the county bowling with Les Jackson in the 1959 season after the retirement of Cliff Gladwin. In that season, he played two Tests against India, taking nine wickets. He took 60 wickets for Derbyshire but with one five wicket over."]}, {"page": "Fred Ridgway", "response": ["Though in 1948 he was badly affected by injury, 1949 proved to be Ridgway's best year, for he took 105 wickets for 22.88 runs each, which ranked him as the fourth-best pace bowler in the country after Bedser, Gladwin and Les Jackson. Ridgway's most notable performance was on the featherbed Trent Bridge wicket, where he took six for 79 in the first innings, and paved the way for an easy Kent victory. Apart from teammate Doug Wright in the second innings, no visiting bowler at Trent Bridge bettered those figures all year, but Ridgway's most notable feat that year was his striking consistency: with only one haul of eight or more in a match he still took 90 wickets in 20 county games. Moreover, playing against Sussex,Cricketarchive.com Ridgway \"shared in a record partnership of 161 for the ninth wicket\" with Brian Edrich.Cricketarchive.com This partnership, just under half the total of 379, was made in a losing cause."]}, {"page": "Pat Pocock", "response": ["He then took 6 for 79 against Australia in the first Test at Old Trafford, Manchester, in 1968, and was then immediately dropped and replaced by Derek Underwood. Pocock was not selected again in the series, and appeared only sporadically thereafter. His next two home Tests were against the West Indies in 1976, but his final recall was some eight years and 86 Tests later; only Derek Shackleton (103 Tests) and Les Jackson (96 Tests) had previously missed more matches between Test appearances. Pocock finished his Test career on a happy note, under the captaincy of David Gower, and in a successful partnership with Phil Edmonds on England's 1984–85 tour of India."]}, {"page": "Bradford Premier League", "response": ["* Les Jackson (England)"]}, {"page": "George Dawkes", "response": ["Dawkes' reliability as a wicketkeeper was commented on in many editions of Wisden across the 1950s, but his season figures were rarely spectacular, Derbyshire relying heavily on a fast bowling attack consisting for the bulk of Dawkes' career of Les Jackson and Cliff Gladwin, which gave a lot of chances to slip fielders such as Donald Carr, as well as behind the wicket. But he achieved, on behalf of Jackson, a hat-trick of catches in the match against Worcestershire at Kidderminster in 1958."]}, {"page": "Philadelphian cricket team", "response": ["In 1908 the Philadelphians undertook their third and final tour of England. They played ten first-class games on this tour, winning four and losing six. The tour was highlighted by Bart King, who took 87 wickets and topped the England bowling averages with the figure of 11.01. This was not bettered until 1958 when Les Jackson of Derbyshire posted an average of 10.99. They played three first-class games in Jamaica in 1908–09, their only tour of a country other than England."]}, {"page": "1947 English cricket season", "response": ["Derbyshire was the most improved team of the year, rising ten places from fifteenth in 1946 to fifth in 1947. They were a strong bowling side with pacemen Bill Copson, Cliff Gladwin and George Pope all playing for England. Dusty Rhodes, bowling mainly leg break, and left-armer Eric Marsh provided support. Derbyshire, captained for the first time by Edward Gothard, played attacking cricket and were involved in several close finishes. The batting was weakened by injuries to Stan Worthington, in his final season, and Denis Smith. Charlie Elliott and Arnold Townsend topped 1,000 runs but Playfair noted that the presence of one really top-class batsman would have made an enormous difference to Derbyshire's batting. John Eggar, who topped the county averages, might have filled that gap but his teaching career enabled him to play only in August. Smith was seconded to keep wicket for most of the season until George Dawkes, formerly of Leicestershire, was able to join the team. Dawkes went on to become one of the greatest English wicketkeepers. Another notable debutant was fast bowler Les Jackson. Other players included Albert Alderman, 55-year-old Harry Elliott in his final season, Alan Revill and Pat Vaulkhard.Playfair, pp. 91–92."]}, {"page": "1953 English cricket season", "response": [" || Les Jackson ||align=\"right\"| 4450 ||align=\"right\"| 230 ||align=\"right\"| 1574 ||align=\"right\"| 103 || 15.28"]}, {"page": "1958 English cricket season", "response": ["*Wisden Cricketers of the Year (awarded in the 1959 Wisden Cricketers' Almanack) – Les Jackson, Roy Marshall, Arthur Milton, John Reid, Derek Shackleton", "Les Jackson topped the bowling averages with 143 wickets taken at a bowling average of 10.99 runs per wicket."]}, {"page": "2007 in the United Kingdom", "response": ["** Les Jackson, cricketer (Derbyshire) (born 1921)"]}, {"page": "Playfair Cricket Annual", "response": ["* 1955: Bob Appleyard, Denis Compton, Bruce Dooland, Les Jackson, Don Kenyon, Jim Laker, Peter Loader, Tony Lock, Fazal Mahmood, Brian Statham, Alan Watkins", "* 1959: Dennis Brookes, Godfrey Evans, Colin Ingleby-Mackenzie, Les Jackson, Tony Lock, Roy Marshall, Peter May, Arthur Milton, Derek Shackleton, Raman Subba Row, Willie Watson"]}, {"page": "History of United States cricket", "response": ["The Philadelphians again took King and his teammates to England in 1903. On this tour, the team rarely found itself outmatched. By the end of the tour, some English observers were comparing the Philadelphian team to some of the Australian sides that they had seen.Melville, Tom. Cricket for Americans: Playing and Understanding the Game. (Bowling Green, Ohio: Bowling Green States University Popular Press, 1993), 82. One of the highlights of the tour was the win over Gloucestershire by an innings and 26 runs. This was the worst defeat ever by an American side over an English county side.Melville, Tom. Cricket for Americans: Playing and Understanding the Game. (Bowling Green, Ohio: Bowling Green States University Popular Press, 1993), 96. The Americans back home believed that this was the country's chance to burst onto the world cricket stage.The New York Times. (16 August 1903), 12. Unfortunately, this was followed by a relatively poor showing in 1908. The only bright spot of this tour was Bart King's capture of the season bowling record. His record of 11.01 was not bettered until 1958 when Les Jackson of Derbyshire posted an average of 10.99."]}, {"page": "Commonwealth XI cricket team in India and Ceylon in 1950–51", "response": ["The team was nominally captained by Les Ames but he had injury problems and often had to hand over to his deputy Frank Worrell. The team was judged to be stronger than the England team which was concurrently (and disastrously) touring Australia. There were numerous problems with health and injury issues which caused early withdrawals but it included Jim Laker, Sonny Ramadhin, Derek Shackleton, Jack Ikin, Harold Gimblett, Fred Ridgway, Dick Spooner, George Tribe, Les Jackson, Bruce Dooland, George Emmett, Laurie Fishlock, Harold Stephenson, Ken Grieves, Ray Dovey and Billy Sutcliffe."]}, {"page": "Charles Lee (cricketer)", "response": ["Lee's new start was initially impeded by a broken leg, suffered while playing football, but he soon established himself in the team in the 1954 season and was awarded his cap in the 1956 season. A canny right-hander, he made 1,000 runs for eight successive seasons, nudging the ball into the gaps without often dominating the bowling. He cut loose in the occasional run chase, hitting five sixes off Jim McConnon at Swansea in the 1958 season and five more at Lord's in the 1961 season. In the 1963 season, he became county captain but, with their fast bowler Les Jackson in decline, he had little ammunition to work with. Derbyshire took the wooden spoon in his first season at the helm, but recovered to 12th in the 1964 season under his genial leadership before he decided to return to teaching."]}, {"page": "Deaths in April 2007", "response": ["*Les Jackson, 86, British cricketer, fast-medium bowler for Derbyshire and England."]}, {"page": "List of Derbyshire first-class cricket records", "response": ["| Most career wickets for Derbyshire || 1,670 ||  Les Jackson || 1947 - 1963"]}, {"page": "H.L. Jackson", "response": ["#REDIRECT Les Jackson (cricketer)"]}, {"page": "HL Jackson", "response": ["#REDIRECT Les Jackson (cricketer)"]}, {"page": "Jackson (name)", "response": ["*Les Jackson (cricketer) (1921–2007), English cricketer", "*Les Jackson (ice hockey) (born 1952), Canadian hockey executive"]}, {"page": "Golden age of cricket", "response": ["The period also saw the brief flowering of Philadelphian cricket. Three tours were undertaken to England during which the side played on level terms with the leading counties.https://philadelphiaencyclopedia.org/archive/cricket/ The Philadelphians played ten first-class games on their final tour in 1908, winning four and losing six. This tour was notable for the outstanding bowling of Bart King, who took 87 wickets and topped the England bowling averages with 11.01 runs per wicket. This was not bettered until 1958 when Les Jackson of Derbyshire posted an average of 10.99."]}, {"page": "Raymond Morris (cricketer)", "response": [" In the same match, he was the second wicket in a hat-trick by the Derbyshire fast bowler Les Jackson in which all three wickets were catches by wicketkeeper George Dawkes."]}, {"page": "List of Derbyshire County Cricket Club seasons", "response": ["|1956|| 30 || 7|| 7 || 16 || 12 ||Donald Carr || Charles Lee ||Les Jackson || George Dawkes", "| 1957||30 || 11|| 9 || 10 || 4 || Donald Carr|| Arnold Hamer || Les Jackson || George Dawkes", "| 1958|| 30 || 10 || 9 ||11 || 5 ||Donald Carr || Charles Lee || Les Jackson  || George Dawkes", "|1959|| 30 || 13 || 6 || 11 || 7 ||Donald Carr || Donald Carr ||Les Jackson || George Dawkes", "| 1960|| 31|| 10|| 10 || 11 || 5 ||Donald Carr || Laurie Johnson || Les Jackson || George Dawkes", "| 1962|| 30 || 9 || 6 || 15 || 7 ||Donald Carr || Laurie Johnson || Les Jackson  || Bob Taylor"]}, {"page": "Derbyshire County Cricket Club in 1956", "response": ["Derbyshire played 28 games in the County Championship, and one match against Oxford University, and one against the touring Australians. They won seven matches altogether, but a large number of matches were drawn. Donald Carr was in his third season  as captain. Charles Lee was top scorer and Les Jackson took most wickets with 114. "]}, {"page": "Derbyshire County Cricket Club in 1959", "response": ["Derbyshire played 28 games in the County Championship,  one match against Cambridge University, and one against the touring Indians . Despite winning thirteen matches altogether, they ended seventh in the County Championship. Donald Carr was in his fifth season  as captain and was  top scorer. His 2165 runs was a  record for most runs in a season for Derbyshire and he scored two centuries in a match against Kent. He was also Wisden Cricketer of the Year.  Les Jackson  took most wickets with 117 and achieved 9 for 17 against Cambridge University. Harold Rhodes played for England during the season."]}, {"page": "Derbyshire County Cricket Club in 1958", "response": ["Donald Carr was in his fourth season  as captain. Charles Lee was  top scorer. Les Jackson  took most wickets for Derbyshire and topped the national bowler list with 143 wickets. His bowling average of 10.99 has not been exceeded since. Hampshire's score of 23 in the match at the Ind Coope ground remains the record for lowest runs in a match against  Derbyshire "]}, {"page": "Derbyshire County Cricket Club in 1957", "response": ["Derbyshire played 28 games in the County Championship, and one match against Cambridge University, and one against the touring West Indians. They won ten matches in the Championship and the match against Cambridge University. Donald Carr was in his third season  as captain. Arnold Hamer was top scorer and Les Jackson took most wickets with 129. "]}, {"page": "Derbyshire County Cricket Club in 1948", "response": ["Edward Gothard was in his second season as captain and took the wicket of Sir Donald Bradman at Derby.  Under his leadership, the club maintained the form of the previous season. Charlie Elliott was top scorer but George Pope who played fewer matches was a close second and achieved the best batting average. C Gladwin took most wickets and again in a powerful all-rounder performance Pope came close second, although the Australians declared that only two bowlers in England moved the ball away from the bat as much as Les JacksonW.T. Taylor History of Derbyshire cricket Wisden 1953"]}]}}