{"wiki_id": "http://www.wikidata.org/entity/Q6525109", "itemLabel": "Leonard Barnes", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Leonard_Barnes", "wikipedia_page": {"main": "Leonard John Barnes MC and Bar (1895–1977) was a British anti-colonialist writer, journalist and educationalist. Educated at St Paul's School, he was awarded the Military Cross and Bar during World War I while serving with the King's Royal Rifle Corps and then attended University College, Oxford, before travelling to South Africa to work as a farmer and journalist.He wrote The New Boer War (1932) and Empire or Democracy (1939) on colonial and development issues.\nBarnes made two significant contributions to studies of youth work in 1948, with two notable reports for the  Jubilee Trust, on the nature and objectives of youth work. \nBarnes was head of what is now the Department of Social Policy and Intervention, University of Oxford.", "link_mentions": [{"page": "Up the Line to Death", "response": ["Richard Aldington - Martin Armstrong - Herbert Asquith - Maurice Baring - Leonard Barnes - Paul Bewsher - Laurence Binyon - John Peale Bishop - Edmund Blunden - Rupert Brooke - Leslie Coulson - E. E. Cummings - Jeffery Day - Geoffrey Dearmer - John Drinkwater - Lord Dunsany - J. Griffyth Fairfax - Gilbert Frankau - John Freeman - Crosbie Garstin - Wilfrid Gibson - Robert Graves - Julian Grenfell - Wyn Griffith - Thomas Hardy - F. W. Harvey - A. P. Herbert - W. N. Hodgson - A. E. Housman - Philip Johnstone - David Jones - T. M. Kettle - Rudyard Kipling - Francis Ledwidge - P. H. B. Lyon - D. S. MacColl - John McCrae - Patrick MacGill - E. A. Mackintosh - R. B. Marriott-Watson - A. A. Milne - Harold Monro - Sir Henry Newbolt - Robert Nichols - Wilfred Owen - Nowell Oxland - Robert Palmer - Max Plowman - Herbert Read - Edgell Rickword - Isaac Rosenberg - Siegfried Sassoon - R. H. Sauter - Alan Seeger - Robert W. Service - Edward Shanks - Patrick Shaw-Stewart - Osbert Sitwell - C. H. Sorley - Edward de Stein - E. W. Tennant - Edward Thomas - Edward Thompson - W. J. Turner - R. E. Vernède - Alec Waugh - Willoughby Weaving - I. A. Williams - T. P. Cameron Wilson - W. B. Yeats - E. Hilton Young - Francis Brett Young"]}, {"page": "Leonard barnes", "response": ["#REDIRECT Leonard Barnes "]}, {"page": "List of Old Paulines", "response": ["*Leonard Barnes (1895–1977); anticolonialist writer and educationalist"]}, {"page": "Norman Leys", "response": ["Kenya (1924), with an introduction by Gilbert Murray, was reprinted in 1925 and 1926. Disappointed by the East African policies of the first and second Labour governments, Leys resigned from the Advisory Committee to the Labour Party in April 1931. In 1938, with Leonard Barnes and Julius Lewin, he founded a socialist journal, Empire, subsequently taken over by the Fabian Colonial Bureau. In February 1939 Leys drafted a memorandum for the Labour Party arguing against the colour bar: the memo was incorporated into a draft by Leonard Woolf which became an official Labour Party document in 1943."]}, {"page": "Department of Social Policy and Intervention", "response": ["Notable former heads of department have included Leonard Barnes, A. H. Halsey, Stein Ringen, Martin Seeleib-Kaiser and Rebecca Surender."]}, {"page": "Barnes, Leonard", "response": ["#redirectLeonard Barnes"]}]}}