{"wiki_id": "http://www.wikidata.org/entity/Q6537547", "itemLabel": "Lex Gold", "itemDescription": "Scottish footballer (born 1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lex_Gold", "wikipedia_page": {"main": "Lex Gold CBE (born 14 December 1940) is a Scottish administrator and former footballer who was a director of Caledonian MacBrayne as of 2012.Gold was born in Lanark, and played professional football as a teenager, including an 18-month spell with Rangers. He was a civil servant for over thirty years.Gold was chairman of Hibernian until he resigned after the club was relegated in 1998. In 1998, he was invited to deliver the Marlow (Scotland) Lecture to the Institution of Engineers and Shipbuilders in Scotland. Gold was also on the boards of NHS Lanarkshire, Scottish Enterprise, the Scottish Chamber of Commerce and the Confederation of British Industry in Scotland. Until October 2009 Gold was the executive chairman of the SPL.", "link_mentions": [{"page": "December 14", "response": ["*1940 – Lex Gold, Scottish footballer and civil servant"]}, {"page": "Phil O'Donnell (footballer)", "response": ["Motherwell and other fans laid flowers, scarves, strips and other mementos at the gates of Fir Park. The club's scheduled SPL game against Hibs at Easter Road the following Wednesday was postponed along with the club's home game with Celtic the following Sunday out of respect. Scottish Premier League chairman Lex Gold said: \"We understand from Phil's family that they would appreciate it if the Motherwell v Celtic game scheduled for 6 January 2008 could be postponed. Both clubs are happy to meet the request and we have called the game off.\" On 31 December the SPL postponed the Celtic v Rangers fixture scheduled for 2 January 2008, following a request by O'Donnell's former club Celtic, which was agreed by Rangers. These postponements contributed to fixture congestion at the end of the 2007–08 season, which required the 2007–08 Scottish Premier League season to be extended when Rangers reached the 2008 UEFA Cup Final."]}, {"page": "Famine Song", "response": ["The song was first sung publicly by Rangers fans at a match at Celtic Park in April 2008. Lex Gold, the Scottish Premier League (SPL) chief executive at the time, said that football clubs could be deducted points if fans continue to sing such songs:"]}, {"page": "Gold (surname)", "response": ["* Lex Gold (born 1940), football administrator"]}]}}