{"wiki_id": "http://www.wikidata.org/entity/Q6532583", "itemLabel": "Neil Martin", "itemDescription": "English Formula One strategist", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_Martin_(motorsport)", "wikipedia_page": {"main": "Neil Martin (born 3 September 1972) is an English Formula One strategist, the former head of strategy at Scuderia Ferrari.\nAfter studying mathematics and computer science at the University of Southampton, Martin continued at Southampton to read Operational Research (OR) for his MSc. Originally intending to seek a job in the City of London, he managed to convince McLaren Racing, to sponsor his idea for a Race Strategy project.  On completion McLaren offered him a job.In 1998 Martin pioneered the use of Game Theory and Monte Carlo techniques in Formula 1 race strategy, which embraced risk and random events to deliver more awareness of the likely race outcomes.  These stochastic techniques allowed for the modelling of uncertain events e.g. future traffic patterns, the likelihood of overtakes and what to do under a Safety Car, which gave better insight than the previous deterministic algorithms and therefore allowed for more informed decisions under risk events.\nMartin was responsible at McLaren for the direction of strategic development of technology and race strategies, developing software to provide instant access to data on specific car components while on track. His role came to public prominence at the 2005 Monaco Grand Prix, when he helped Kimi Räikkönen win the race by making a key strategic call during a safety car incident, by sending an email from McLaren's Woking base to stay out rather than pit.Headhunted by Red Bull Racing in May 2006, he joined the team as Chief Strategist in January 2007.  An anti-intuitive, but correct, strategy call at the 2009 Chinese grand prix, staying out with both cars in bad weather at the start of the race, when Alonso in second place and other contenders pitted for fuel behind the safety car, facilitated Red Bull Racing’s first historic win, which was also a 1-2 finish.In January 2011, after Ferrari made a poor strategic call during the 2010 Abu Dhabi Grand Prix, which lost driver Fernando Alonso the 2010 World Championship to Red Bull's Sebastian Vettel, Martin joined Ferrari alongside ex-McLaren engineer Pat Fry in a revamped Ferrari race operations and engineering team. He left Ferrari at 2015 in the team’s organizational restructuring. In 2016, Martin led an engineering team for Mercedes-affiliated HWA and was engaged in the team’s Formula E plan along with Steve Clark.In 2019, Martin joined venture builder Equals Collective as Non-Executive Director.Martin is also a keynote speaker in Mark Gallagher’s F1 talents team, working alongside ex-F1 drivers David Coulthard, Mika Häkkinen and Jacques Villeneuve.", "link_mentions": [{"page": "Kimi Räikkönen", "response": ["Räikkönen then achieved three consecutive poles in San Marino, Spain, and a win after a safety car strategy call by Neil Martin at Monaco. An almost certain win was denied at Imola after a driveshaft failure, but he won the other two races, putting him within 22 points of leader Alonso. He registered strong, comfortable wins at Barcelona, beating Alonso, and at Monte Carlo, never dropping his lead in both races. At the , Räikkönen flat-spotted his right front tyre while lapping Jacques Villeneuve. The resultant vibrations caused his suspension to fail while he led on the final lap, sending him into the tyre wall and handing a further ten points to his rival Alonso. Changing a tyre would have given him a relatively safe third place. However, tyre changes were only allowed in 2005 in cases where a \"punctured or damaged tyre\" could be changed for \"clear and genuine safety reasons\" and there was no precedent for whether the stewards would consider a flat-spotted tyre dangerous enough. This incident, in part, resulted in a rules clarification allowing teams to change a flat-spotted tyre without punishment."]}]}}