{"wiki_id": "http://www.wikidata.org/entity/Q653086", "itemLabel": "Passenger", "itemDescription": "British singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Passenger_(singer)", "wikipedia_page": {"main": "Michael David Rosenberg (born 17 May 1984), better known by his stage name Passenger, is an English singer-songwriter and musician. Previously the main vocalist and songwriter of Passenger, Rosenberg opted to keep the band's name for his solo work after the band dissolved in 2009. In 2012, he released the song \"Let Her Go\" which topped the charts in 16 countries. In 2014, the song was nominated for the Brit Award for British Single of the Year, and he received the British Academy's Ivor Novello Award for Most Performed Work.\n\n", "link_mentions": [{"page": "May 17", "response": ["*  1984   – Passenger, English singer-songwriter and musician "]}, {"page": "1984", "response": ["** Passenger, English singer and songwriter"]}, {"page": "New Jersey Turnpike", "response": ["*Passenger's song \"Riding to New York\" describes a man riding a bike from Minnesota to New York, and includes the lyrics \"And fly through Pennsylvania and the Jersey turnpike tolls.\""]}, {"page": "List of one-hit wonders in the United States", "response": ["*Passenger — \"Let Her Go\" (2014)"]}, {"page": "1984 in music", "response": ["*May 17 – Passenger, English singer-songwriter "]}, {"page": "List of folk musicians", "response": ["*Passenger", "*Passenger"]}, {"page": "List of singer-songwriters", "response": ["*Passenger"]}, {"page": "List of one-word stage names", "response": ["* Passenger (born 1984), British singer-songwriter and indie pop/folk/rock singer"]}, {"page": "Mike", "response": ["*Mike Rosenberg, better known by his stage name, Passenger (singer), English singer-songwriter and musician"]}, {"page": "Pinkpop Festival", "response": ["| - La Pegatina- Passenger- The Opposites- Thirty Seconds to Mars- Kings of Leon", "| - Seasick Steve  - Guus Meeuwis  - Passenger  - Live  - Kings Of Leon"]}, {"page": "List of best-selling singles in the United States", "response": ["|Passenger"]}, {"page": "Within Temptation", "response": ["In order to celebrate the band's 15th anniversary, the Belgian radio station Q-music invited the band to make 15 covers of famous songs. Later, the band released The Q-Music Sessions album, another divergent genre variation from their original sound. The album featured reworked covers of several famous pop songs, such as \"Titanium\" by David Guetta featuring Sia, \"Grenade\" by Bruno Mars, \"The Power of Love\" by Frankie Goes to Hollywood and also some indie and folk rock songs as The Who's \"Behind Blue Eyes\" and Passenger's \"Let Her Go\"."]}, {"page": "Nettwerk", "response": ["Nettwerk has on its label, management and publishing rosters Perfume Genius, The Veils, fun., Passenger, Christina Perri, Guster, Family of the Year, Beta Radio, and Ólafur Arnalds."]}, {"page": "Gillette Stadium", "response": ["| September 25, 2015 || Ed Sheeran || PassengerChristina Perri || The x Tour || 51,996 / 54,000 || $3,234,377 || "]}, {"page": "Newport Folk Festival", "response": ["* 2018: Mumford & Sons, Sturgill Simpson, Jason Isbell & The 400 Unit with David Crosby, Jon Batiste and The Dap-Kings, St. Vincent, Margo Price, Cheech & Chong, Courtney Barnett, Ben Harper and Charlie Musselwhite, Brandi Carlile, Jenny Lewis, Glen Hansard, Gary Clark Jr., Passenger, Lucius, Langhorne Slim, Nels Cline, Hamilton Leithauser and Rostam, Phoebe Bridgers, Lukas Nelson & Promise of the Real,  Toots and the Maytals, Nicole Atkins, Fantastic Negrito, Low Cut Connie, Valerie June, The Lone Bellow, Preservation Hall Jazz Band, Amanda Shires, Hiss Golden Messenger, JD McPherson, Shakey Graves, Moses Sumney, Tank and the Bangas, Jen Cloher, Tuck & Patti, This Is the Kit, Curtis Harding."]}, {"page": "Johnnie Walker", "response": ["A number of singers and songwriters have referenced Johnnie Walker in their works, from Amanda Marshall to ZZ Top. Elliott Smith's Oscar-nominated \"Miss Misery\" has the narrator \"[making] it through the day with some help from Johnnie Walker Red.\" Heavy metal band Black Label Society was named after Johnnie Walker Black Label whisky, as Zakk Wylde was very fond of the drink. George Thorogood name checks “Johnny Walker and his brothers Black and Red” in \"I Drink Alone\".The name appears also in the song \"Remember to Forget\" by Passenger."]}, {"page": "Rock Werchter", "response": ["|BastilleTom OdellPassengerAsaf AvidanJake Bugg", "|KuromaParquet CourtsAngus & Julia StonePassengerFoalsMGMTInterpol", "Passenger"]}, {"page": "Sleeper hit", "response": ["\"Let Her Go\" by Passenger was released in July 2012, but did not reach the top 20 until November 2013, and peaked at"]}, {"page": "Cambridge Folk Festival", "response": ["In 2015, Joan Baez, Joan Armatrading, Wilko Johnson, and Passenger headlined the festival.\"Cambridge Folk Festival Cherry Hinton, Cambridge\". Music News, 4 August 2015 Rob and Carole Joyce"]}, {"page": "Winnipeg Folk Festival", "response": ["The festival showcases several genres every summer. Past performers include Bahamas, Joan Baez, Barenaked Ladies, Blue Rodeo, Oscar Brand, Brandi Carlile, Bruce Cockburn, City and Colour, Courtney Barnett, Ray Davies, Death Cab for Cutie, Elle King, Mimi Farina, Feist, Stephane Grappelli, Great Big Sea, Arlo Guthrie, Half Moon Run, Emmylou Harris, Levon Helm, John Hiatt, Jason Mraz, Kacey Musgraves, k.d. lang, K'naan, Lyle Lovett, Nick Lowe, Natalie MacMaster, Odetta, Passenger, Pete Seeger, Sheryl Crow, The Shins, Stan Rogers and The Strumbellas, Jeff Tweedy, Townes van Zandt, Kurt Vile, and Wilco. "]}, {"page": "Byron Bay Bluesfest", "response": ["* Passenger"]}, {"page": "Passenger (disambiguation)", "response": ["Passenger(s) or The Passenger(s) may also refer to:", "* Passenger (Posmysz novel), a 1962 novel by Zofia Posmysz; basis for the 1963 film and the 1968 opera", "* \"Passengers\" (short story), a 1968 story by Robert Silverberg", "* \"The Passenger\" (short story), a 1927 story by Vladimir Nabokov", "* The Passenger, a 2006 novel by Chris Petit", "* The Passenger, an unpublished novel by Cormac McCarthy", "* \"The Passenger\", a 2012 horror story by Arinn Dembo", "* The Passenger (Boschwitz novel), a 1938 novel", "* The Passenger (1928 film), a French silent film by Jacques de Baroncelli", "* The Passenger (1949 film), a French comedy by Jacques Daroy", "* Passenger (1963 film), a Polish drama by Andrzej Munk", "* The Passenger (1975 film), a drama by Michelangelo Antonioni", "* The Passengers (1977 film), a French film by Serge Leroy", "* The Passenger – Welcome to Germany, a 1988 drama by Thomas Brasch", "* The Passengers (1999 film), a French film by Jean-Claude Guiguet", "* Passengers (2003 film), an Indian documentary by Akanksha Damini Joshi", "* The Passenger (2005 Éric Caravaca film), a French film", "* The Passenger (2005 François Rotger film), a French-Canadian-Japanese film", "* Passengers (2008 film), an American-Canadian thriller by Rodrigo Garcia", "* Passenger (2009 film), an Indian Malayalam thriller by Ranjit Shankar", "* Passengers (2016 film), an American science fiction film", "* The Passenger (TV series), a 1979 Hong Kong drama series", "* Passengers (TV series), a mid-1990s and early-2000s British series about youth culture", "* \"Chapter 10: The Passenger\", an episode of The Mandalorian", "* \"The Passenger\" (Star Trek: Deep Space Nine), an episode", "* \"The Passenger\" (Westworld), an episode", "* Tulip Olsen, or The Passenger, a character in the television series Infinity Train", "* Passenger Records, a New York-based record label", "* The Passenger (opera), by Mieczysław Weinberg, 1968", "* Passenger (singer) (born 1984), British folk-rock singer-songwriter Mike Rosenberg", "** Passenger (British band), a folk-rock band previously fronted by Mike Rosenberg", "* Passenger (Swedish band), a metal band", "* Passenger, a pseudonym used by Tiësto for the 1997 single \"Blackspin\"; see Tiësto discography#Singles", "* Passengers (side project), a side project formed by Brian Eno and U2 for the 1995 album Original Soundtracks 1", "* Passengers (Italian band), a 1980s italo disco band", "* The Passengers (band), a 1970s Belgian new wave band", "* The Passengers, a 1980s Australian band led by Angie Pepper", "* Passenger (Lisa Hannigan album) or the title song, 2011", "* Passenger (Nico Touches the Walls album) or the title song, 2011", "* Passenger (Mnemic album), 2007", "* Passenger (Passenger album), 2003", "* Passenger (Tara MacLean album) or the title song, 2000", "* Passengers (Gary Burton album), 1977", "* Passengers (soundtrack), from the 2008 film", "* Passengers, by Mostly Autumn, 2003", "* \"Passenger\" (Powderfinger song), 1999", "* \"The Passenger\" (song), by Iggy Pop, 1977", "* \"Passengers\" (Elton John song), 1984", "* \"Passenger\", by Britney Spears from Britney Jean, 2013", "* \"Passenger\", by Deftones from White Pony, 2000", "* \"Passenger\", by DY, 2009", "* \"Passenger\", by Hippo Campus from Bambi, 2018", "* \"Passenger\", by Trapt from DNA, 2016", "* \"Passengers\", by Starflyer 59 from Old, 2003", "* The Passenger (moth) or Dysgonia algira, a moth species", "* The Passenger (Sapphire & Steel), a 2005 audio drama", "* Phusion Passenger, a free web server and application server"]}, {"page": "Sziget Festival", "response": ["* Passenger"]}, {"page": "Cooking Vinyl", "response": ["In 2016, Passenger claimed the UK No. 1 album with Young As The Morning, Old As The Sea. This year also saw singer-songwriter Nina Nesbitt sign a global artist services deal with Cooking Vinyl.", "As of December 2021, other artists signed to Cooking Vinyl include Alison Moyet, Eliza & The Delusionals, Lissie, Nina Nesbitt, The Orb, Will Young, Passenger, The Waterboys, BABYMETAL, Fickle Friends, Lucy Spraggan, Rumer, Sophie Ellis-Bextor, The Darkness, The Psychedelic Furs, Billy Bragg, Del Amitri, Kiefer Sutherland, Reverend And The Makers, Suzanne Vega, The Fratellis, The Rifles, and Willy Mason", "*Passenger"]}, {"page": "Brushfire Fairytales", "response": ["In a retrospective review by The Quietus, reviewer David Bennun credits Brushfire Fairytales with helping to popularize a strain of \"sensitive [and] authentic... indie-folk\" that would later lead to artists such as Ed Sheeran, Passenger, and Mumford & Sons."]}, {"page": "Southside Festival", "response": ["*Passenger (singer)"]}, {"page": "Nova Rock Festival", "response": ["|Hellyeah||Amaranthe||Passenger||Gallows||Ohrbooten||Caliban", "|Passenger"]}, {"page": "Andy Burrows", "response": ["Burrows played drums on the Arthur soundtrack produced by Mark Ronson One of the songs is currently the theme tune to the ITV chat show, The Jonathan Ross Show. His drumming also features on the Ilan Eshkeri soundtrack to Johnny English Reborn. \"Nice Try\" from his I Am Arrows album features in the film Friends with Benefits. In 2012, Burrows was approached by the production company Lupus Films to work on The Snowman and The Snowdog, the follow up to the 1982 classic animated film The Snowman. Collaborating with Eshkeri, Burrows co-wrote the soundtrack to the new film as well as writing and performing the official single from the film, \"Light the Night\". The flying-home sequence also uses an orchestral version of Burrows' track \"Hometown\" from his solo album Company. The score was nominated for a BAFTA craft award in April 2013. In early 2015, Burrows featured on a re-recording of Kate Miller-Heidke's song \"Share Your Air\", replacing the vocals of Passenger."]}, {"page": "Heart of Gold (Neil Young song)", "response": ["* Passenger covered the song on his covers album Sunday Night Sessions, released in 2017"]}, {"page": "Allsång på Skansen", "response": ["* 25 June: Gyllene Tider, Zara Larsson, Passenger, Carola, and Eric Ericsons Kammarkör."]}, {"page": "Fast Car", "response": ["The song has been covered many times, including by Khalid, Justin Bieber, The Flying Pickets, Hundred Reasons, Xiu Xiu, Vertical Horizon, Darwin's Waiting Room, Amazing Transparent Man, MYMP, Mutya Buena, Kristian Leontiou, Wayne Wonder, David Usher, Linda Pritchard, Boyce Avenue (featuring Kina Grannis), Christian Kane, Jim O'Rourke, Mark Wilkinson, Elizabeth Gillies, Hitomi Yaida, Ryan Montbleau (featuring Tall Heights), Passenger, and Jess Moskaluke (with W.G. Snuffy Walden)."]}, {"page": "No Diggity", "response": ["* In March 2013, Ed Sheeran and Passenger performed a live acoustic cover of \"No Diggity\" during several live performances, one of them notably being mashed up with \"Thrift Shop\" by Macklemore & Ryan Lewis."]}, {"page": "VH1 Top 20 Video Countdown", "response": ["*\"Let Her Go\" - Passenger"]}, {"page": "Magic (TV channel)", "response": ["| Pharrell Williams, Bruno Mars, George Ezra, Magic!, Scissor Sisters, Bill Medley & Jennifer Warnes, Billy Joel, Olly Murs feat Travie McCoy, Ella Henderson, Justin Timberlake, John Legend, Paloma Faith, P!nk feat Nate Ruess, Labrinth feat Emeli Sandé, Kelly Clarkson, Whitney Houston, Ben Haenow, Robbie Williams, George Michael & Elton John, Take That, One Direction, Alicia Keys, Ellie Goulding, Dido, Christina Aguilera, Annie Lennox, R.E.M., The Script, Passenger, Will Young, Natalie Imbruglia, Sarah McLachlan, Des'ree, Tom Odell, Mr. Probz, The Tony Rich Project, Eva Cassidy, Sophie B. Hawkins, Rumer, Gary Barlow, A-ha, Fleetwood Mac, Culture Club, Philip Oakey & Giorgio Moroder, Cyndi Lauper, Mr. Mister, Starship, The Bangles, Luther Vandross, ABBA, Nik Kershaw, Boy George, Feargal Sharkey, Phyllis Nelson, Belinda Carlisle, Dee C. Lee, Alison Moyet, Stereophonics"]}, {"page": "Josh Pyke", "response": ["In October 2011, Pyke toured the UK, this time on a co-headline tour with friend and occasional collaborator Mike Rosenberg AKA Passenger. While touring, the pair collaborated on new material, which resulted in Passenger having writing credits on \"Leeward Side\" and Josh having writing credits on \"27\". At the ARIA Music Awards of 2011, Only Sparrows was nominated for three awards. "]}, {"page": "Cities 97 Sampler", "response": ["#Passenger – \"Let Her Go\""]}, {"page": "List of artists who reached number one on the Australian singles chart", "response": ["*Passenger"]}, {"page": "Vitamin String Quartet", "response": ["* String Quartet Tribute to Passenger (singer)'s Let Her Go"]}, {"page": "Plymouth Pavilions", "response": ["| Tom Odell, Passenger, Massive Attack, Rudimental, Joe Bonamassa, Bastille, Catfish and the Bottlemen, Deacon Blue, Jools Holland, WWE NXT, Greg Porter, Jack Garrett, Ed Sheeran, Jess Glynne, Leona Lewis, Joss Stone, The Levellers, Peter Andre, Ronan Keating, Wet Wet Wet, Shane Filan of Westlife || 2016"]}, {"page": "Caribana Festival (Switzerland)", "response": ["Evanescence, Good Charlotte, P.M.T, The Passengers, Piers Faccini, Myband, The Servant, Patti Smith, Aloan, Babet, Under The Influence of Giants, Macy Gray, Israel Vibration, Sally Nyolo, Lunik, Solo dos", "Main stage : Ska-P, Pixies, Kodaline, Miles Kane, Queens of the Stone Age, Youssoupha, Jessie J, IAM, Bastian Baker, Passenger, Tom Odell"]}, {"page": "List of people from Brighton and Hove", "response": ["*Passenger, real name Mike Rosenberg, singer, is originally from Brighton"]}, {"page": "List of music artists and bands from England", "response": ["**Passenger"]}, {"page": "List of songs recorded by Keane", "response": ["*\"Is It Any Wonder?\" - Passenger , Fritts"]}, {"page": "Cenzo Townshend", "response": ["| Passenger", "| Passenger"]}, {"page": "List of Live Lounge cover versions", "response": ["|Birdy ||\"The A Team\" by Ed Sheeran\"Let Her Go\" by Passenger\"Firestone\" by Kygo feat Conrad Sewell\"Fast Car\" by Tracy Chapman || 19 July 201118 September 2013"]}]}}