{"wiki_id": "http://www.wikidata.org/entity/Q6536794", "itemLabel": "Lewis Linford", "itemDescription": "Secondary School", "wikipedia_url": "https://en.wikipedia.org/wiki/Lewis_Linford", "wikipedia_page": {"main": "Lewis Smales (stage name Linford) (born 1987) is a British actor. A native of Swanland, East Riding of Yorkshire, England. Smales is probably best known for playing the character of gamekeeper Lee Naylor in the British television soap Emmerdale.\nIn 2010 Smales appeared in the 3rd Series of \"The Inbetweeners\".\nHe began his career playing the part of Wayne Broody in John Godber's BAFTA award-winning BBC drama \"Oddsquad\".\nSmales has appeared on stage at the Hull Truck Theatre in John Godber's play Up 'n' Under.", "link_mentions": [{"page": "Abi Titmuss", "response": ["In 2009, Titmuss was cast in the 25th anniversary production of John Godber's play Up 'n' Under at the newly refurbished Hull Truck Theatre, Hull. Titmuss played Hazel, the fitness instructor, starring alongside James Crossley (formerly the Gladiator \"Hunter\" in the British version of Gladiators) and soap actor Lewis Linford (\"Lee Naylor\" in Emmerdale). She also had a part in the BBC TV series Hotel Babylon, playing a nun."]}, {"page": "Andy Sugden", "response": ["Victoria (now played by Isabel Hodgins) begins looking for answers to the cause of Sarah Sr's death. In an attempt to force a confession, she douses the furniture in petrol and demands the truth; Andy confesses but a fire soon ignites.  In January 2008 he is sentenced to three years imprisonment for manslaughter.  Andy and Jo marry on 19 February 2008 in prison. Jack, Victoria, Daz, and Laurel are their guests and Ashley presides over the service. During Andy's incarceration, Debbie gets closer to Sarah and changes her mind about Jo adopting her. When Andy is released, he is angry to learn that Debbie has been allowed access and begins lashing out at Jo. The abuse continues for months and culminates in Andy getting seriously injured during a confrontation in a barn. Andy's family do not believe Jo initially but Daz and Victoria eventually see for themselves. After a suicide threat, Diane intervenes and arranges for Andy to get psychiatric treatment. Jo eventually leaves after Lee Naylor (Lewis Linford) helps her sell the farm equipment to fund her escape as Jo herself divorces from Andy off-screen."]}, {"page": "Katie Sugden", "response": ["When she reappears at Home Farm in January 2009, Katie is escorted off the premises by security. New owners, Mark (Maxwell Caulfield) and Natasha Wylde (Amanda Donohoe), arrive and allow Katie to keep her business at Home Farm. Mark and Katie soon become friends but Natasha is wary until Katie starts dating gamekeeper Lee Naylor (Lewis Linford), unaware that Nathan Wylde (Lyndon Ogbourne) is attracted to her. He uses his position at Home Farm to manipulate them as Katie prefers Lee. After an argument, Nathan and Katie spend a night together but he makes it clear that he doesn't want a relationship with her. However, he objects when she asks Lee to move in. This doesn't last when Katie realizes that Lee repeated things that she told him in confidence so she ends things with Nathan and asks Lee to move out. After Faye (Kim Thomson) and Ryan Lamb (James Sutton) move to the village, she gets to know Ryan and they start dating, despite his mother's objections. Mark tells Faye that Katie is a nice girl that can be trusted but Gennie Walker (Sian Reese-Williams) tells Faye about Katie being a surrogate mother so Faye invites her to dinner and questions her about her past, much to Ryan's embarrassment. He insists Faye apologize and Ryan and Katie are happy until Ryan discovers he has feelings for Maisie Wylde (Alice Coulthard). Not wanting to cheat on Katie, he ends the relationship and starts dating Maisie. However, they reconcile after Maisie and Ryan learn that they are half-siblings. Nathan, however, tells Katie about Ryan and Maisie's \"inappropriate\" relationship, leading Katie to end things with Ryan again. Andy and Katie later become close once more when she discovers that he is suffering from anger issues which ended his relationship with Adele Allfrey (Tanya Vital). When Andy crashes his landrover, he begs Katie for help and she convinces him to see a counselor. Andy later blames Katie and her affair with Robert for his anger issues and when she defends herself, he smashes a mug against the wall, witnessed by Sarah. He later apologizes and he and Katie sleep together again but Katie insists that it was a mistake and they should stay friends."]}, {"page": "List of Emmerdale characters (2008)", "response": ["Lee Naylor played by Lewis Linford is the grandson of Mick Naylor. He appeared from 2008 to 2009."]}, {"page": "Nathan Wylde", "response": ["Nathan and his sister, Maisie, arrive in the village for their father's 50th birthday party. Nathan is immediately attracted to Katie Sugden (Sammy Winward), and when he hears that she has a date with Lee Naylor (Lewis Linford), Nathan delays him with questions about his work. Nathan - who attended agricultural college - is tasked with running the estate by his parents.  Nathan continues pursuing Katie, causing trouble between her and Lee by successfully manipulating them both. Following a row with Lee, Katie invites Nathan to spend the night with her. The next day, however, she catches him sneaking out and he admits to not wanting a serious relationship until he sees her reconcile with Lee."]}, {"page": "List of The Inbetweeners characters", "response": ["* Played by Lewis Linford, Jack Brear and Daniel Kirrane"]}, {"page": "Lewis Linford(actor)", "response": ["#REDIRECT Lewis Linford"]}, {"page": "Linford", "response": ["*Lewis Linford (born 1987), British actor"]}, {"page": "Lewis Linford (actor)", "response": ["#REDIRECT Lewis Linford"]}, {"page": "Sugden family", "response": ["Victoria began looking for answers to the cause of Sarah Sr's death. She tracked down Richie who told her to ask Jack. In an attempt to force a confession, she doused the furniture in petrol and demanded the truth, Andy confessed but a fire soon ignited. Following Andy's confession, he was sentenced to three years imprisonment in January 2008 after confessing to manslaughter. Andy and Jo married on 19 February 2008 in prison. When Andy was released, he was not pleased to find that things had changed. He  began lashing out at Jo, giving her a black eye in one instance. The abuse continued for months and culminated in Andy getting seriously injured during a confrontation in a barn. Jo eventually left after Lee Naylor (Lewis Linford) helped her sell the farm equipment to fund her escape."]}]}}