{"wiki_id": "http://www.wikidata.org/entity/Q6530643", "itemLabel": "Leslie Benzies", "itemDescription": "Scottish computer programmer and businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Leslie_Benzies", "wikipedia_page": {"main": "Leslie Peter Benzies (born 17 January 1971) is a Scottish video game producer and the former president of Rockstar North, a subsidiary of Rockstar Games. He was the lead developer on the Grand Theft Auto series, taking responsibility from Grand Theft Auto III to Grand Theft Auto V (including Grand Theft Auto Online). Benzies is no longer working for Rockstar, and was in a lawsuit with its parent company, Take-Two Interactive, over unpaid royalties from April 2016 to February 2019.", "link_mentions": [{"page": "Aberdeen", "response": ["* Leslie Benzies, Former president of Rockstar North, creators of the critically acclaimed Grand Theft Auto series."]}, {"page": "Grand Theft Auto: Vice City", "response": ["The game is set in 1986 in fictional Vice City, which is based heavily on the city of Miami. Vice City previously appeared in the original Grand Theft Auto (1997); the development team decided to reuse the location and incorporate ideas from within the studio and the fanbase. They wanted to satirise a location that was not contemporary, unlike Grand Theft Auto IIIs Liberty City. The team wanted to choose a location that had various similarities and differences to New York City—the inspiration of Liberty City—eventually leading them to Miami, which producer Leslie Benzies describes as \"a party town, all sun and sea and sex, but with that same dark edge underneath\". Sam Houser called it \"the grooviest era of crime because it didn't even feel like it was crime ... it was a totally topsy-turvy back-to-front period of time\". The team intended to make Vice City a \"living, breathing city\", for the player to feel like \"life still goes on\" while the character is inside a building.", "Category:Video games produced by Leslie Benzies"]}, {"page": "British Academy Games Awards", "response": ["* Special Award (Games) – Sam Houser & Leslie Benzies"]}, {"page": "Elgin, Moray", "response": ["* Leslie Benzies (born 17 January 1971), video game designer and producer "]}, {"page": "Take-Two Interactive", "response": ["In December 2013, former Marvel editor-in-chief Bill Jemas announced that he had joined Take-Two to start a \"graphic fiction imprint\". The imprint, Double Take Comics, was launched in October 2014, but ultimately was not successful and was shuttered in November 2016. Leslie Benzies, former President of Rockstar North, took sabbatical leave from Rockstar on September 1, 2014. In January 2016 it was announced that he had left the company. On April 12, 2016, Benzies started legal action against Rockstar and Take-Two claiming $150 million in unpaid royalties. Take-Two had invested into mobile-game developer Scopely in July 2016. On February 1, 2017, the company acquired social and mobile game developer Social Point for about  to enter into the mobile gaming industry."]}, {"page": "Grand Theft Auto III", "response": ["The core development team of Grand Theft Auto III consisted of about 23 people at DMA Design in Edinburgh, who worked closely with publisher Rockstar Games in New York City. The original prototype for the game was created on the Dreamcast around the end of development on the previous game Grand Theft Auto 2 (1999), which led to it being greenlit. By early 2001, the team had designed the city, cars and some weapons. An online multiplayer mode was initially planned for the game, but was ultimately dropped due to time and resource limitations. Producer Leslie Benzies described Grand Theft Auto III as a \"crime simulation game\". Rockstar originally offered it to Microsoft Game Studios as an Xbox exclusive, but Microsoft declined due to the game's adult nature and its poorly-performing predecessors. The game was released for the PlayStation 2 on 23 October 2001 in North America. When porting the game to Microsoft Windows, the team delayed it from the PlayStation 2 release in order to ensure quality, citing issues with the simultaneous platform release of previous games in the series.", "Prior to and since the release of Grand Theft Auto III, the game generated several controversies. GameSpy awarded it with the title of \"Most Offensive Game of the Year\", calling it \"absolutely reprehensible\". They wrote that the game rewards players for \"causing mayhem\" and \"killing innocent people by the dozen\", ultimately questioning its appropriateness within the industry. The notoriety of Grand Theft Auto III resulted in American retailer Wal-Mart's decision to check the identification of purchasers who appeared to be under the age of 17 when purchasing mature titles. In an essay, assistant professor Shira Chess identified the lack of conclusion to player violence, due to the ability to respawn upon death or incarceration, and found that it denies the \"reality of mortality and simultaneously [forces] it on players\". When speaking about the game's depiction of violence, producer Leslie Benzies claimed that is intended to be comedic, and that the game is \"not meant to be taken seriously\". Producer Dan Houser stated that the team was conscious of the offence that the game would attract, but \"never marketed it in a way that exploited that\".", "Category:Video games produced by Leslie Benzies"]}, {"page": "Robert Gordon University", "response": ["* Leslie Benzies, Video Game Producer (Doctor of Design 2015)"]}, {"page": "Dufftown", "response": ["* Leslie Benzies the former president of Rockstar North, which produces the famous Grand Theft Auto game series amongst other games, was born in Aberdeen and grew up in Dufftown."]}, {"page": "Rockstar North", "response": ["In 1997, DMA released Grand Theft Auto, which was a huge success; the game sparked a successful series. The company was soon acquired by Gremlin Interactive. Following the release of Grand Theft Auto 2, Gremlin was acquired by Infogrames. After the Infogrames acquisition, the DMA Design assets were sold to Take-Two Interactive. In 2001, after the release of Grand Theft Auto III, DMA Design was ultimately renamed Rockstar North and became part of the Rockstar Games label. After the shift, the company worked on new titles, including Manhunt, provided support to other Rockstar games such as Red Dead Redemption and Max Payne 3, and continued the Grand Theft Auto franchise with Grand Theft Auto IV (2008) and Grand Theft Auto V (2013). Both games are considered to be among the best video games made, and Grand Theft Auto V became the second-best-selling game of all time. Leslie Benzies headed the studio since the Take-Two acquisition until his departure in 2016.", "Following the acquisition, it was announced that DMA Design would continue developing Grand Theft Auto games, including GTA3D and Grand Theft Auto: Online Crime World; the former was compared to the gameplay of Quake, while the latter was set to have worldwide servers allowing players to compete with others in local cities. The company received various staffing changes following the acquisition: Jones left the company and founded Realtime Worlds, while DMA Design was headed by Leslie Benzies and Andrew Semple, among others. The studio had about 25 employees at the time of the changeover. Under new management from Rockstar Games and Take-Two Interactive, DMA Design developed Grand Theft Auto III, which was released for PlayStation 2 in October 2001. In March 2002, DMA Design became Rockstar Studios, being integrated into Rockstar Games, and renamed to Rockstar North in May 2002.", "Following the release of Grand Theft Auto V, studio president and producer Leslie Benzies went on sabbatical on 1 September 2014, and left the company in January 2016; art directors Aaron Garbut and Rob Nelson took over Benzies' responsibilities at Rockstar North. Nelson later became co-studio head alongside Andrew Semple."]}, {"page": "Grand Theft Auto: San Andreas", "response": ["Category:Video games produced by Leslie Benzies"]}, {"page": "Manhunt (video game)", "response": ["Category:Video games produced by Leslie Benzies"]}, {"page": "Grand Theft Auto", "response": ["Grand Theft Auto (GTA) is a series of action-adventure games created by David Jones and Mike Dailly. Later titles were developed under the oversight of brothers Dan and Sam Houser, Leslie Benzies and Aaron Garbut. It is primarily developed by British development house Rockstar North (formerly DMA Design), and published by its parent company, Rockstar Games. The name of the series references the term \"grand theft auto\", used in the United States for motor vehicle theft."]}, {"page": "List of Aberdonians", "response": ["*Leslie Benzies, video game producer and President of Rockstar North, creators of the critically acclaimed Grand Theft Auto series"]}, {"page": "Grand Theft Auto: Liberty City Stories", "response": ["Category:Video games produced by Leslie Benzies"]}, {"page": "Grand Theft Auto IV", "response": ["Preliminary work on Grand Theft Auto IV began in November 2004, a month after the release of Grand Theft Auto: San Andreas. Rockstar president Sam Houser felt that following up San Andreas was \"a nightmare\". Rockstar North, the core 220-person team behind the game, co-opted studios owned by parent company Rockstar Games to facilitate development between a full team of over 1,000, including 50 employees at Rockstar NYC, 40 at Rockstar Lincoln, 10 at Rockstar San Diego, and around 600–700 working part-time internally and externally. Some key members of the development team worked 12-hour days during production, often without holidays. The team decided to continue the numbering scheme absent from the previous two main games to represent the same leap in production as Grand Theft Auto 2 (1999) to Grand Theft Auto III (2001). Development of Grand Theft Auto IV ceased by 21 April 2008 when the game was submitted for manufacturing. Producer Leslie Benzies estimated that the budget of the development efforts exceeded , making Grand Theft Auto IV one of the most expensive video game ever made.", "Category:Video games produced by Leslie Benzies"]}, {"page": "Space Station Silicon Valley", "response": ["The game's humour and style were shaped by hardware limitations; when the hardware rendered the character models in soft focus, the team noted that they resembled Plasticine models, and continued to create the game with a look and style akin to Wallace and Gromit. The game was presented with \"distinctive 'British' humour\" to distinguish it from other games; lead programmer Leslie Benzies and artist Aaron Garbut often presented the team with other Nintendo 64 games, such as Super Mario 64 (1996), to identify the differences. The team ensured that each level felt distinct, while maintaining a coherent style. This diversity was achieved using the development tools, which allowed various members of the team to experiment in creating designs. Manual text writer Brian Baglow said that the game's music provided freedom to the team, as it \"doesn't necessarily have to fit the action on the screen\". He explained that the audio was designed to fit with the \"cheesy, slightly twisted B-movies animation kind of feel\". Baglow found that creating the music on a cartridge instead of a CD prompted the team to discover new techniques of working within the boundaries of the former, stating that \"people who are doing music for CD-based systems get very, very lazy\"."]}, {"page": "Stockbridge, Edinburgh", "response": ["*Leslie Benzies, video game producer and former Rockstar North president"]}, {"page": "Grand Theft Auto: Vice City Stories", "response": ["Category:Video games produced by Leslie Benzies"]}]}}