{"wiki_id": "http://www.wikidata.org/entity/Q6536181", "itemLabel": "Lewin Bentham Bowring", "itemDescription": "British colonial administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Lewin_Bentham_Bowring", "wikipedia_page": {"main": "Lewin Bentham Bowring (1824–1910) was a British civil servant in India who served as commissioner of Mysore between 1862 and 1870. He was also an author and man of letters.", "link_mentions": [{"page": "Arthur Wellesley, 1st Duke of Wellington", "response": ["Lewin Bentham Bowring gives this alternative account:"]}, {"page": "John Bowring", "response": ["*Lewin Bentham Bowring was a member of the Bengal Civil Service. He served as private secretary in India to Lord Canning and Lord Elgin, and later as commissioner of Mysore."]}, {"page": "Raj Bhavan, Bangalore", "response": ["Situated at the highest point in Bangalore, High Grounds (3031 feet above sea level), it was built by Sir Mark Cubbon between 1840 and 1842 when he was the Commissioner of Mysore territories of the British. After Cubbon left in 1861, the bungalow was put up for sale and purchased by the succeeding commissioner, Lewin Bentham Bowring, using government funds, and became the official residence of the Commissioner."]}, {"page": "Kodachadri", "response": ["Kodachadri seems to have attracted the attention of humankind since early prehistory. Several monolithic structures or menhirs were built here in prehistoric times. Rocks with dimensions greater than 12 feet were used in their construction. These large structure can be found just 20 Kilometers outside of Nagara-Nilsakal. A temple dedicated to the Ancient Mother Goddess Mookambika is located near the top of the peak. The temple is a popular destination for Hindu pilgrims and it is said to stand where thousands of years ago Mookambika fought and killed the demon Mookasura. In Historic times, people used to trek from Nagara state, a nearby place and Europeans trekked to the peak during the 19th century. Lewin Bentham Bowring, who served as Commissioner of Mysore between 1862 and 1870, records that Kodachadri is \"clothed with splendid forests, and the ascent is very steep indeed in one place near foot....The view from the top of the hill, which has a bluff appearance from the distance, though it is as sharp as a knife in reality, is very fine, commanding a long stretch of great Ghat range, a considerable portion of Canara (Kanara), and a wide view over Malnad\". He further records that, Kodachadri is visible from Merti Peak near Sringeri."]}, {"page": "Tumakuru district", "response": ["The district was formed in 1832 during the days of British commissioner of Mysuru Sir Mark Cubbon as Chitaldroog Division including the area of present Chitradurga and Tumakuru districts headquartered at Tumakuru, Major General Richard Stewart Dobbs was the first collector of the district (term of office 1835–1861), who was key responsible for the establishment of Munro system of administration. In the year 1862 Chitaldroog division was abolished and Tumakuru (Nandidroog division) and Chitradurga (Nagar Division) established as separate districts by Lewin Bentham Bowring.http://www.tumkur.nic.in Tumakuru District Gazetteer The district occupies an area of 10,598 km² and had a population of 2,678,980, of which 19.62% were urban as of 2011. The district is known for the production of coconuts, called as 'Kalpataru Nadu'. It is the only discontiguous district in Karnataka (Pavagada Taluk has no geographical continuity with the rest of the district)."]}, {"page": "T. Madhava Rao", "response": ["Many British civil servants in India who held positions within Indian princely states were disgusted by the total arbitrary power and laws of the Maharajas and Nawabs. In 1872, the retired chief commissioner of Mysore, Lewin Bentham Bowring had written in his memoir, Eastern Experience, that those  Rao included this in his writing to the Viceroy, Francis Napier in March 1872, about the need for the implementation of a written constitution in princely states requesting “a system of fundamental principles, derived from the advanced political wisdom of Europe” while “carefully adapted to the conditions of the Native society” for the princely states."]}, {"page": "Bowring", "response": ["*Lewin Bentham Bowring (1824–1910), son of John Bowring"]}, {"page": "Francis Cunningham (Indian Army officer)", "response": ["When Cubbon retired and left Bangalore in 1861, Cunningham stayed on in a private capacity but his health declined, lobbying on behalf of the deposed Maharaja Krishna Rajendra Wodeyar III, arguing that he should be allowed to adopt an heir and that the kingdom should be restored to him. As Cunningham was an extremely effective writer, this caused endless headaches for the next Chief Commissioner, Lewin Bentham Bowring. Bowring writes: 'During many years, the secretary of the commission was Captain F. Cunningham, a son of the poet Allan Cunningham, and a brother of the well known archaeologist General A. Cunningham, and of Major J.D. Cunningham who wrote the 'History of the Sikhs.' He wielded a ready and incisive pen, his official letters showing great command of language, in which was often a vein of irony and humour that was unpalatable to the recipients. He had left the commission before I joined, but had taken service with the Raja at Mysore, his principal duty being to compose the despatches which His Highness sent to the Government about his claims, a task which his literary qualifications enabled him to perform exceedingly well, although his presence at the capital and the encouragement given by him to intriguing parties were a source of some embarrassment to me...'British Library - Bowring Collection"]}, {"page": "Infrastructure in Bangalore", "response": ["The South Parade, today known as M.G. Road, became a fashionable area with bars, and restaurants. In his book Bangalore: Scenes from an Indian City, M. N. Srinivas opines that the reasons leading to the haphazard development of narrow, winding roads around the civilian areas around the cantonment was because the British chose to ignore the development of these areas, which were normally reserved for non-European labourers. The first railway lines between Bangalore and Jolarpet were laid in 1864 under the directives of Cubbon. His successor, Lewin Bentham Bowring (1862–1870) established the first organised law enforcement units in the city as well the sewerage system and the department of Survey and Settlement. In 1862, the Town Municipality of Bangalore was constituted under Act No. XXVI of 1850. The municipality board, comprising two European officials, four local officials and two non-officials met biweekly to discuss matters on the city's sanitation and improvement. The jurisdiction of the municipality included Balepet, Manavarthpet and Halsurpet. The first project of the municipality was the construction of a moat around the ramparts of the old Bangalore fort. In 1866, the municipality installed kerosene lamps on principal streets. A parallel municipality was established in the Bangalore Cantonment in 1862 with Rs. 37,509. The jurisdiction of the cantonment municipality included the Ulsoor division, Southern division, East General Bazaar division, West General Bazaar division, Cleveland Town division and High Ground division. Though the Bangalore town and the Cantonment had separate municipal bodies, they both reported to the President of Bangalore Town Municipality. Despite the establishment of municipal bodies, civic infrastructure in the city did not see considerable improvement. Uncovered drains, some between  deep by  wide, were common in the town. Contractors of the municipality subordinated farmers for the removal of filth in the cantonment, which they in turn, used as manure. The efficacy of this agreement was minimal during agricultural seasons. Contractors engaged in building construction employing more than 10 labourers, were required to maintain a latrine for their use and clean it daily."]}, {"page": "John Charles Bowring", "response": ["He was the eldest son of Sir John Bowring (1792–1872), of Exeter, Devon, Governor of Hong Kong, and accompanied him on some of his travels. He was brother of Lewin Bentham Bowring and Edgar Alfred Bowring."]}, {"page": "Edgar Alfred Bowring", "response": ["He was the youngest son of Sir John Bowring (1792–1872), of Exeter, Devon, Governor of Hong Kong and also a traveller and translator of literary works,  and was brother of John Charles Bowring and Lewin Bentham Bowring."]}, {"page": "List of chief commissioners of Coorg Province", "response": ["|Lewin Bentham Bowring"]}, {"page": "Administration of the Kingdom of Mysore", "response": ["Following Tipu's death in 1799, the kingdom came under direct British rule in 1831. Lushington, Briggs and Morrison, the early commissioners, were followed by Mark Cubbon and Lewin Bentham Bowring.Kamath (2001), p251 Mark Cubbon took charge in 1834 and is known for his excellent handling of the kingdom. He made Bangalore the capital and divided the princely state into 4 divisions, each under a British superintendent. The state was further divided into 120 taluks with 85 taluk courts, with all lower level administration in the Kannada language. The Amildar was in charge of a taluk to whom a Hoblidar, the caretaker of a Hobli comprising a few villages, reported. The office of the commissioner had eight departments; revenue, post, police, cavalry, public works, medical, the animal husbandry, judiciary and education. The judiciary was hierarchical with the commissioners' court at the apex, followed by the Huzur Adalat, four superintending courts and eight Sadar Munsiff courts at the lowest level. Mark Cubbon is credited with the construction of over one thousand miles of roads, hundreds of dams, coffee production and improvements in the tax and revenue systems.Kamath (2001), p252"]}, {"page": "Ulsoor Lake", "response": ["Ulsoor Lake' or Halasuru Lake, one of the biggest lakes in Bangalore, is located on the eastern side of the city. It derives its name from the name of the locality it is situated, namely, Halasuru, close to M G Road. It is spread over ) and has several islands. Even though the lake is dated to Kempegowdas' time, the present lake was created by Sir Lewin Bentham Bowring, the then Commissioner of Bangalore. A part of the lake is controlled by the Madras Engineer Group, and the rest by the Bruhat Bengaluru Mahanagara Palike"]}, {"page": "Mark Cubbon", "response": ["An equestrian statue by Baron Marochetti was unveiled on 16 March 1866 in a large gathering and addressed by Lewin Bentham Bowring, Cubbon's successor as Commissioner of Mysore. The statue was initially placed in the parade ground at Bangalore but moved later in front of the main government buildings (the Attara Kacheri now housing the Karnataka High Court). When the statue was unveiled the forehead was marked with the three lines of ash, symbols of Brahminism, a prank by some young soldiers that was referred to in \"The Painting of the Statue\" in the \"Lays of Ind\" by W.S. Yeldham writing under the pen name of \"Aliph Cheem\". "]}, {"page": "Captivity of Mangalorean Catholics at Seringapatam", "response": ["One English prisoner related that two risalas (regiments of soldiers) arrived daily in Seringapatam to select girls they could take as prizes to join their harems. Often when girls were seized, their young men would offer resistance and smash their dhoolies (palanquin). Officers would capture the attackers and administer five hundred strokes with whips and canes, from whose effects many men died. Historian Lewin Bentham Bowring reports that, \"Tipu demanded the surrender of the daughters of some of these Christians in order to have them placed in his seraglio, and that, on the refusal of their parents, the latter had their noses, ears and upper lips cut off, and were paraded through the streets on asses, with their faces towards the tails of the animals.\""]}, {"page": "MediaWiki talk:Spam-whitelist/Archives/2010/07", "response": [":Guy did bring up a good point.  I am concerned about WP:LINKVIO.  Some of the material has obviously had its copyright expire (Lewin Bentham Bowring died in 1910.  The American Civil War ended in 1865.  Those items have expired copyrights).  The problem is with certain articles that still appear to be copyrighted, such as those by Peter Hofschröer, George Gush and others.  There is no indication on those pages that these people have released their works into the public domain.  Are you able to provide evidence that they have allowed your site to host their material?  152.16.16.75 (talk) 11:08, 27 February 2010 (UTC)"]}, {"page": "L. B. Bowring", "response": ["#REDIRECT Lewin Bentham Bowring"]}, {"page": "Bowring Institute", "response": ["Bowring Institute is a Private members' club in Bangalore, India. It was founded in 1868 by Benjamin Lewis Rice.https://www.bowringinstitute.in/history It is named after Lewin Bentham Bowring. It is best known for its tennis facilities, but also has what is probably the largest library in Bangalore."]}, {"page": "Attara Kacheri", "response": ["When the secretariat shifted to the building, which was called the Public Offices, in 1868, the building itself began to be called Attara Kacheri. The building was also called 'Bowring Buildings' and 'Bowring Attara Kacheri', after the British commissioner of Mysore, Lewin Bentham Bowring, who ordered its construction.", "Plans for a new building housing all offices under one roof were drawn up in 1857, but the project could not proceed because of the Indian Rebellion that year. Further plans were drawn up later, in 1860, but were rejected by the Government of India. A revised plan by Richard Sankey, the chief engineer of Mysore, was accepted, and the Commissioner of Mysore, Lewin Bentham Bowring, ordered the construction of the new building."]}]}}