{"wiki_id": "http://www.wikidata.org/entity/Q653472", "itemLabel": "John Mayhew", "itemDescription": "British musician (1947-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Mayhew_(musician)", "wikipedia_page": {"main": "John Mayhew (27 March 1947 – 26 March 2009) was an English musician, best known for his brief tenure as the drummer of the progressive rock band Genesis. He replaced the band's previous drummer, John Silver, in August 1969, and was himself replaced in August 1970 by Phil Collins. Mayhew appears on the album Trespass, as well as the Genesis Archive 1967-75 and Genesis 1970–1975 box sets.", "link_mentions": [{"page": "Genesis (band)", "response": ["After the album was recorded, the band went their separate ways for a year; Gabriel and Phillips stayed at Charterhouse to finish exams, Banks enrolled at Sussex University, and Rutherford studied at Farnborough College of Technology. They regrouped in mid-1969 to discuss their future, for their offers in further education might result in the group splitting up. Phillips and Rutherford decided to make music their full-time career, for they were starting to write more complex music than their earlier songs with King. After Banks and Gabriel decided to follow suit, the four returned to Regent Sound in August 1969 and recorded four more demos with Silver: \"Family\" (later known as \"Dusk\"), \"White Mountain\", \"Going Out to Get You\", and \"Pacidy\". The tape was rejected by each record label that heard it. Silver then left the group to study leisure management in the United States. His replacement, drummer and carpenter John Mayhew, was found when Mayhew looked for work and left his phone number \"with people all over London\".", "*John Mayhew – drums, percussion, backing vocals (1969–1970; died 2009)"]}, {"page": "Phil Collins", "response": ["In mid-1970, the rock band Genesis had decided to become a full time band and following the departures of drummer John Mayhew and guitarist Anthony Phillips, advertised for a drummer \"sensitive to acoustic music\" and a \"12-string acoustic guitarist\".Coleman, p. 61.[ \"Genesis\" Biography], Billboard. Retrieved 16 January 2006. Collins recognised Charisma Records owner Tony Stratton-Smith's name in the advert; he and Caryl decided to audition for the roles. The audition took place at the home of the parents of singer Peter Gabriel in Chobham, Surrey. They arrived early; Collins took a swim in the pool and memorised the pieces before his audition.Coleman, p. 63. He recalled: \"They put on Trespass, and my initial impression was of a very soft and round music, not edgy, with vocal harmonies, and I came away thinking Crosby, Stills and Nash.\"Banks, Tony; Collins, Phil; Gabriel, Peter; Hackett, Steve; Rutherford, Mike (2007). Dodd, Philipp, ed. Genesis. Chapter and Verse. Weidenfeld & Nicolson. Collins was successful and joined the group in August 1970. The group then took a two-week holiday, during which Collins earned money as an exterior decorator. Mike Rutherford thought Caryl was not a good fit; the group enlisted Steve Hackett in 1971."]}, {"page": "List of drummers", "response": ["* John Mayhew (Genesis)"]}, {"page": "Trespass (album)", "response": ["Trespass is the second studio album by the English rock band Genesis. It was released in October 1970 on Charisma Records, and is their last album with guitarist Anthony Phillips and their only one with drummer John Mayhew.", "In September, Genesis played their first live shows as a professional band, touring the local club and university circuit, with new drummer John Mayhew. Mayhew – the oldest and most experienced musician – came from a different background to the rest of the band. Phillips recalled that, despite their efforts to make him feel comfortable, the drummer was unsure of his playing. In early 1970, they secured a six-week residency at Ronnie Scott's jazz club in Soho, London, during which they were spotted by Charisma Records producer John Anthony. He persuaded label boss Tony Stratton-Smith to sign them. The group wanted to branch out from their earlier pop-oriented style, and write and perform songs that were unlike any other band at the time. Rutherford later said that gigging was \"tough, but a good way of getting the music into shape\". Two songs that made it to the next album, \"Looking for Someone\" and \"Stagnation\", were recorded for a BBC session in February 1970.", "*John Mayhew – drums, percussion, vocals"]}, {"page": "Nursery Cryme", "response": ["Genesis recorded their first album as a professional outfit, Trespass in June 1970, but immediately afterwards, founding member and guitarist Anthony Phillips quit owing to increased stress and unhappiness in touring. The other founders, singer Peter Gabriel, keyboardist Tony Banks and bassist/guitarist Mike Rutherford almost split up the group, but decided to carry on and replace drummer John Mayhew with someone who was of equal stature to the others and who could write."]}, {"page": "From Genesis to Revelation", "response": ["When the album failed to become a success, the group decided to split and resume education. This marked the end of their association with King, who had grown increasingly dissatisfied with the band directing their material away from mainstream pop. In addition, Genesis had fulfilled their contractual obligation with Decca with the release of \"Where the Sour Turns to Sweet\", and neither they nor King were interested in renewing the deal. In September 1969, Gabriel, Banks, Rutherford, and Phillips decided to make Genesis a full-time band and write on their own musical terms which had developed to what Phillips described as \"original and dramatic\".They replaced Silver with drummer John Mayhew, and toured England for six months. Their residency at Ronnie Scott's club in Soho, London caught the attention of Tony Stratton-Smith who signed them to his label, Charisma Records. Genesis began formulating the music that would be recorded on their next album, Trespass."]}, {"page": "John Silver (musician)", "response": ["Jonathan \"John\" Silver (born 1950) was the second drummer for the English rock band Genesis.  He replaced Chris Stewart in the summer of 1968 and appears on their first full-length album, From Genesis to Revelation, and on the Genesis Archive 1967-75 box set.  He left the band in August 1969 and was replaced by John Mayhew after leaving to study at Cornell University."]}, {"page": "Genesis Archive 1967–75", "response": ["Discs three and four contain previously unreleased live tracks from 1973, demos, single edits, and a BBC radio session from 1970, the latter featuring the band's early drummers John Silver and John Mayhew. The set is packaged with an 80-page booklet and extensive liner notes.", "*John Mayhew: drums (Disc 4, tracks 3–6)"]}, {"page": "Turn It On Again: The Hits", "response": ["*John Mayhew - drums on \"The Knife\""]}, {"page": "Platinum Collection (Genesis album)", "response": ["*John Mayhew - drums on disc 3 track 9"]}]}}