{"wiki_id": "http://www.wikidata.org/entity/Q6531133", "itemLabel": "Leslie Seymour", "itemDescription": "British politician (1900-1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Leslie_Seymour", "wikipedia_page": {"main": "Leslie George Seymour, JP (1 November 1900 – 15 April 1976) was a British company director and politician from the city of Birmingham.\nEducated at Solihull Grammar School, Seymour left school at the age of 14 to work in a laboratory at a technical school. He then went into manufacturing industries, and became Managing Director of Improved Metallic Appliances Ltd. He was also involved in Conservative Party politics and was elected to Birmingham City Council from Small Heath ward in 1937. After losing his seat in 1946, he returned to the council from Rotton Park Ward in 1947 for two further terms before again being defeated in 1954. He specialised in the more mundane aspects of local government such as rating and valuation, although he was chair of the Civil Defence Committee in 1944.\nSeymour was Conservative candidate in the safe Labour seat of Birmingham Ladywood at the 1951 general election. At the 1959 general election, he fought Birmingham Sparkbrook: the Labour incumbent Percy Shurmer had died shortly before polling day, and Seymour managed to defeat his underprepared successor as candidate.\nA low-profile MP, Seymour was an instinctive right-winger and at the 1964 general election he called for legal restrictions on coloured immigration in overcrowded areas such as Sparkbrook. The Labour Party candidate Roy Hattersley was strongly opposed to racialism and regained the seat. After failing to regain his seat at the 1966 general election, Seymour retired. In 1974 he was made an Honorary Alderman of Birmingham.", "link_mentions": [{"page": "1964 United Kingdom general election", "response": ["*Leslie Seymour (Birmingham Sparkbrook)"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| Leslie Seymour"]}, {"page": "Birmingham Sparkbrook (UK Parliament constituency)", "response": ["|| 1959 || Leslie Seymour || Conservative"]}, {"page": "Leslie George Seymour", "response": ["#REDIRECT Leslie Seymour"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Leslie Seymour"]}, {"page": "King's Norton Boys' School", "response": ["* Leslie Seymour, Conservative MP from 1959–64 for Birmingham Sparkbrook"]}]}}