{"wiki_id": "http://www.wikidata.org/entity/Q6536575", "itemLabel": "Lewis Ganson", "itemDescription": "English magician", "wikipedia_url": "https://en.wikipedia.org/wiki/Lewis_Ganson", "wikipedia_page": {"main": "Lewis Jack Ganson (1913 – 22 December 1980) was an English magician who became one of the most prolific writers in magic, going on to write more than sixty books on the subject.", "link_mentions": [{"page": "Waterlooville", "response": ["* Lewis Ganson, one of the most prolific writers in magic"]}, {"page": "Rovi (magician)", "response": ["Ivor Parry  (known as Rovi) (29 November 1919 - 8 June 1996) was a Welsh magician. He was a Gold Star Medalist of the Inner Magic Circle, was known amongst magicians as The Welsh Wizard and  was called 'a British legend' by Opus Magazine. Specialising in card magic, his original creations were published in 'Rovi Reveals' as part of the Supreme Magic Teach-in Series by Lewis Ganson. The Rovi Trophy is presented annually for the best card trick at the International Brotherhood of Magicians' British Ring Convention.British Ring Website Parry was born in Caernarfon.Biography on visitcaernarfon.com", "* 'Rovi Reveals', Lewis Ganson, Supreme Magic Publication, 1980"]}, {"page": "Portsmouth and District Magic Circle", "response": ["The society was founded in 1938 at a meeting in the Talbot Hotel in Portsmouth. Amongst its founding members were the close-up magician Lewis Ganson and the master illusionist Will Ayling, author of The Art of Illusion and Oriental Conjuring and Magic.Windsor, John (27 February 1993). \"Going, going . . . gone\". The IndependentColeman, Earle Jerome (1987). Magic: A Reference Guide, p. Greenwood Press.  Another early member was the engineer and illusionist Donald Stevenson who worked for the American magician William Ellsworth Robinson and created mechanical illusions in a workshop he shared with Robinson.Portsmouth News (8 January 2010). \"The search is on to find Houdini's plane\" In the 1950s, Stevenson wrote articles about his memories of Robinson for the PDMC's magazine, Top Hat, extracts of which are reproduced in The Glorious Deception: The Double Life of William Robinson.. See pp. 293-294 and 324-325 of Steinmeyer, Jim (2006). The Glorious Deception: The Double Life of William Robinson, aka Chung Ling Soo, the \"Marvelous Chinese Conjurer\". Da Capo Press. "]}, {"page": "Ganson", "response": ["*Lewis Ganson (1913–1980), English magician"]}, {"page": "List of Academy of Magical Arts Award Winners", "response": ["|Lewis Ganson"]}]}}