{"wiki_id": "http://www.wikidata.org/entity/Q6535532", "itemLabel": "Levi Tafari", "itemDescription": "British poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Levi_Tafari", "wikipedia_page": {"main": "Levi Tafari was born and raised in the city of Liverpool by his Jamaican parents. He attended catering college, where he studied classical French cuisine and graduated with distinction. In the early 1980s, while working as a caterer, he started attending the Liverpool 8 Writers Workshop and decided to become a performance poet. Tafari was a firm member of the Rastafari movement and although his early performances were in that community, he saw it as his duty to reach a wider audience and began performing overseas.\nTafari self-identifies as an Urban Griot (the griot being the traditional consciousness raiser, storyteller, newscaster and political agitator). He has four collections of poetry, Duboetry (1987), Liverpool Experience (1989), Rhyme Don’t Pay (1998) and From the Page to the Stage (2006). His plays have been performed at the Blackheath Theater in Stafford and the Unity Theatre, Liverpool. He was also the first person to use the term \"duboetry.\" Several of his musical tracks can be found on compilation albums and he has recorded poetry, which has been released on audiocassette.\nTafari often runs creative writing workshops at schools, colleges, universities and prisons. Most recently he has applied his work to working with the British Council, undertaking tours to the Czech Republic, Jordan, Portugal, Germany and Singapore. He was Writer in Residence at Charles University in Prague. He has also appeared in many television programs including Blue Peter and Grange Hill. He also made a film about Rastafari for BBC television's Everyman program.\nIn 2001, Tafari toured with scrap recycle band, Urban Strawberry Lunch. He has also worked with the Ghanaian drum and dance ensemble Delado, the Liverpool Philharmonic Orchestra, jazz musician Dennis Rollins, and his own reggae band, Ministry of Love. Currently, Tafari is preparing a new collection of poems, experimenting in the recording studio with new sounds along with guitarist Eiko Falckenberg and he continues to perform his work in venues across the globe.\nIn early 2009, Tafari worked with children from Elmgrove Primary School in Belfast for their live performance in St George's Market. He attended the performance on 2 April 2009.", "link_mentions": [{"page": "List of bands and artists from Merseyside", "response": ["*Levi Tafari"]}, {"page": "Elmgrove Primary School", "response": ["In 2009, Elmgrove stated that a new production was in the works with Dance United NI. The show was later named Over the Halfpenny Bridge. It was about the History of Belfast and starred the P7 pupils of that year, and Elderly members from nearby nursing homes, Elmgrove Manor and Greenville Court. 'I am staggered by the range and the quality of what has been produced this evening,' said school principal David Hutchinson. 'The children have acquired so many new skills by working with this terrific company and, through them, all of our minds have been opened.' The children worked with Writer Ruth Carr, Rastafarian poet Levi Tafari, printmaker Robin Cordiner, musicians Nikki Such, Patrick and Bronagh Davey and Irish, Greek and Indian dancers. On 2 April 2009, the show was performed live in St George's Market, Belfast.Dance United NI"]}, {"page": "Positive Vibration", "response": ["* 2016: Mad Professor, Don Letts, Trojan Records Sound System, DJ Vadim, Levi Tafari, Cut Capers, Shanty, Backbeat Sound System, Solko, Kioko, Rumjig", "* 2017: The Selecter, Jah Shaka, Scientist, Channel One Sound System, Don Letts, Reggae Roast, Aba Shanti-I, Earl Gateshead, MC Brother Culture, Prince Fatty, Horseman, Vibronics, Dennis Bovell, Saxon Sound System, Sir Coxsone Outernational Sound System, Dubmatix, Soul Jazz Records Sound System, DJ Andy Smith, Hempolics, Mykaell Riley, John Robb, Levi Tafari, Sinai Sound System, I-mitri CounterAction, New Town Kings, Backbeat Sound System, Ras Kwame, Mount Nakara, One A Penny Sound System, Western Promise, Golty Farabeau", "* 2018: Lee \"Scratch\" Perry + Subatomic Sound System, Roni Size, Macka B, Sister Nancy + Legal Shot Sound System, Adrian Sherwood + Creation Rebel, Mungo's Hi Fi + Eva Lazarus, Dub Pistols, Channel One Sound System, Dreadzone, Iration Steppas w/ Murray Man, Misty in Roots, Capital Letters, Brukout feat. Rory Stone Love + Seani B, Carroll Thompson, Horseman, King Lorenzo, The Upper Cut Band, Don Letts, Blacker Dread, Manudigital, Parly B, Dubkasm, Solo Banton, Radikal Guru, Echo Ranks, Cian Finn, Sinai Sound System, Resonators, Tru Thoughts Records w/ Rodney P + DJ Skitz, Wrongtom, Levi Tafari, John Robb, Samson Sounds, Dr Les Henry, Count Skylarkin, The Majestic, Baked A La Ska, Ruff Trade", "*2021: Asian Dub Foundation, The Twinkle Brothers, Mad Professor Ft. Sister Aisha, Gentleman's Dub Club, Dawn Penn, Hollie Cook, Zion Train, Tippa Irie, Congo Natty Ft. Congo Dubz & Iron Dread, General Levy & Joe Ariwa, Don Letts, Channel One, Horseman & The Upper Cut Band, Mungo's Hi Fi Ft. Charlie P, Benjamin Zephaniah & The Revolutionary Minds, Ruts DC, Kiko Bun, From the Specials - Neville Staple Band, Krafty Kuts Ft. Dynamite MC, Jah Wobble & The Invaders of the Heart, Iration Steppas Ft. Murray Man, The Nextmen Ft. Gardna, DJ Vadim Ft. Jman, O.B.F Ft. Sr. WIlson, Sinai Sound System, KIOKO, Aleighcia Scott, Future Dub Orchestra, Oxman, Adam Prescott, Dub Link Up Ft. MC Mad-X, Count Skylarkin', Kingston Express, Levi Tafari, Rubber Dub"]}, {"page": "Tafari", "response": ["*Levi Tafari, British actor and poet"]}]}}