{"wiki_id": "http://www.wikidata.org/entity/Q6530089", "itemLabel": "Les Warner", "itemDescription": "English drummer", "wikipedia_url": "https://en.wikipedia.org/wiki/Les_Warner", "wikipedia_page": {"main": "Les Warner (also known as Lez Warner) is a British born musician and producer, primarily a drummer best known for his work with The Cult. On the reverse of the Electric album, he is in the far right picture. He currently resides in Las Vegas, Nevada and performs at the New York-New York Hotel & Casino as part of the Celtic Rockers.Lez is currently playing drums with Godmother of Soul, a Las Vegas-based band featuring Tomi Rae Brown (widow of singer, James Brown), bassist Kelly Garni (founding member of Quiet Riot), guitarist Raven Storm, and Jason Edwards on keyboards.\nLes also currently plays bass for the Las Vegas- based all-star tribute band, Petty and the Heartshakers.", "link_mentions": [{"page": "The Cult", "response": ["From late September 1985 to June 1986, the band went on a worldwide tour with new drummer Les Warner (who had played with Julian Lennon and Johnny Thunders). Two more singles from the Love album followed; \"Rain\" (charting in the UK at No. 17) and \"Revolution\" (charting in the UK at No. 30). Neither charted in the US. Another single, \"Nirvana\", was issued only in Poland. The album version of \"Rain\", as well as the remix \"(Here Comes the) Rain\", were used in the Italian horror film Dèmoni 2. Once back in England, the band booked themselves into the Manor Studios in Oxfordshire, with producer Steve Brown (who had produced Love), and recorded over a dozen new songs. The band were unhappy with the sound of their new album, titled Peace, and they decided to go to New York so producer Rick Rubin could remix the first single, \"Love Removal Machine\"."]}, {"page": "Electric (The Cult album)", "response": ["*Les Warner – drums"]}, {"page": "Pure Cult: The Singles 1984–1995", "response": ["*Les Warner – drums, tracks 3, 7, 13"]}, {"page": "Cheetah Chrome", "response": ["In the Fall of 2009, Chrome got together with old friend Sylvain Sylvain to record an EP on the suggestion of SmogVeil Records head Frank Mauceri. They recruited Thommy Price and Enzo Pennizotto from the Blackhearts as a rhythm section, naming themselves the Batusis after the dance from the hit 60s TV show \"Batman\".  They performed two shows at SXSW 2010; Price and Penizzotto were unable to do live shows with the Batusis, due to their schedule with Joan Jett, and were replaced by Chuck Garric of Alice Cooper's band on bass, and Les Warner, formerly of The Cult, on drums. The four song (\"Big Cat Stomp/What You Lack in Brains/Bury You Alive/ Blues Theme\") EP was released in May 2010.  A UK tour had to be cancelled due to a volcanic eruption in Iceland, but they toured the US extensively through December 2010 with Warner on drums and another former Blackheart, Sean Koos, on bass. "]}]}}