{"wiki_id": "http://www.wikidata.org/entity/Q6536955", "itemLabel": "Lewis Payn Dawnay", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Lewis_Payn_Dawnay", "wikipedia_page": {"main": "Lewis Payn Dawnay (1 April 1846 – 30 July 1910) was an English Conservative Party politician who sat in the House of Commons from 1880 to 1892.\nDawnay was the second son of William Dawnay, 7th Viscount Downe  and his wife Mary Isabel Bagot, daughter of the Bishop of Bath and Wells. He was educated at Eton College and joined the Coldstream Guards, reaching the rank of Colonel.In 1874 Dawnay stood unsuccessfully for parliament at York. At the 1880 general election he was elected as the Member of Parliament (MP) for Thirsk, and held that seat until it was replaced under the Redistribution of Seats Act 1885. He was then elected as MP for the replacement constituency of Thirsk and Malton, and held the seat until he stood down in 1892.\nAt this time, he acquired various family properties at Newton-on-Ouse.Dawnay died at the age of 64\nDawnay married Victoria Alexandria Elizabeth Grey 1877. His brother Hugh was an army general and cricketer.", "link_mentions": [{"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| Lewis Payn Dawnay"]}, {"page": "List of MPs elected in the 1886 United Kingdom general election", "response": ["| Lewis Payn Dawnay"]}, {"page": "Charles Grey (British Army officer)", "response": ["* Victoria Alexandrina Elizabeth Grey (1853 - 1922), married Lewis Payn Dawnay, son of William Dawnay, 7th Viscount Downe"]}, {"page": "Thirsk (UK Parliament constituency)", "response": ["||1880 || Hon. Lewis Payn Dawnay ||Conservative"]}, {"page": "List of MPs elected in the 1880 United Kingdom general election", "response": ["| Lewis Payn Dawnay"]}, {"page": "Hugh Dawnay, 8th Viscount Downe", "response": ["Dawnay was the second son of William Dawnay, 7th Viscount Downe and his wife Mary Isabel Bagot, daughter of Richard Bagot, Bishop of Bath and Wells. His younger brother, Lewis Payn Dawnay, was MP for Thirsk."]}, {"page": "William Dawnay, 7th Viscount Downe", "response": ["* Lt.-Col. Hon. Lewis Payn Dawnay (1 April 1846 – 30 July 1910), Coldstream Guards, inherited Beningbrough Hall from his uncle Payan in 1891"]}, {"page": "List of UK Parliamentary election petitions", "response": ["| 1880 || Thirsk || Samuel Bradley Wilcock, Robert Skilbeck, Thomas Humphrey, and David Meek || Colonel Hon. Lewis Payn Dawnay || Bribery, etc. || Duly elected || The petitioners brought evidence of corrupt dealings by a man called Wright but the judge found all the allegations had failed; it seemed that Wright had no connection to Dawnay. || 3 O'M & H 113; HCP 1880 337 p. 83"]}, {"page": "Thirsk and Malton (UK Parliament constituency 1885–1983)", "response": ["| Lewis Payn Dawnay"]}]}}