{"wiki_id": "http://www.wikidata.org/entity/Q6539552", "itemLabel": "Liam Davis", "itemDescription": "Footballer (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Liam_Davis_(footballer,_born_1986)", "wikipedia_page": {"main": "Liam Lloyd Davis (born 23 November 1986) is an English professional footballer who most recently played for National League club Torquay United.", "link_mentions": [{"page": "Zoumana Bakayogo", "response": ["On 17 January 2014, Bakayogo joined Yeovil Town on a month-long loan deal as cover for the injured Liam Davis. Bakayogo made his Yeovil debut against Birmingham City, on 18 January 2014, in a 2–0 win but ruptured his anterior cruciate ligament after just 37 minutes and returned to parent club Leicester City."]}, {"page": "2006–07 Coventry City F.C. season", "response": ["| Liam Davis || Peterborough United || 14 September 2006 || 17 December 2006"]}, {"page": "2008–09 Coventry City F.C. season", "response": ["| Liam Davis || Northampton Town || 6 June 2008 || Free"]}, {"page": "Liam Davis", "response": ["Liam Davis may refer to:", "*Liam Davis (footballer, born 1986), English footballer for Torquay United F.C.", "*Liam Davis (footballer, born 1990), English footballer for Cleethorpes Town F.C.", "*Liam Davis (cricketer) (born 1984), Australian cricketer", "*Liam Davis (swimmer) (born 2000), Zimbabwean swimmer"]}, {"page": "2009–10 Northampton Town F.C. season", "response": ["| 14 || LM || style=\"text-align:left;\" |  Liam Davis"]}, {"page": "2010–11 Birmingham City F.C. season", "response": ["Back on home soil, Birmingham continued their good form at Pride Park, where they beat a Derby County side featuring former Blues midfielder Robbie Savage. The following day, a Birmingham XI including first-team players rested for the match against Derby drew 2–2 against Northampton Town, conceding a late header from Liam Davis. Birmingham came from two goals down to beat Milton Keynes Dons. James McFadden missed a first-half penalty, but two second-half goals from Cameron Jerome and an 88th-minute winner from O'Connor were enough to see off the League One opposition. Mallorca, the visitors for the only home friendly of the 2010 pre-season, inflicted Birmingham's only defeat with a goal from Emilio Nsue. Craig Gardner played in an unfamiliar right-back position with both Stephen Carr and Stuart Parnaby injured."]}, {"page": "2010–11 Northampton Town F.C. season", "response": ["| Liam Davis", "| 23 || LB || style=\"text-align:left;\" |  Liam Davis"]}, {"page": "2011–12 Stevenage F.C. season", "response": [" New signing Phil Edwards had missed a second-half penalty for Stevenage, firing wide after Byron Harrison was fouled in the area. Manager Graham Westley again took the opportunity to look at a number of trialists — with Welling United's Jack Parkinson featuring in the first half of the match, whilst former Northampton Town midfielder Liam Davis played 79 minutes. Robin Shroot, who had featured in Stevenage's first two pre-season fixtures, played the whole match. Another defeat followed four days later as Stevenage lost 1–0 to an Arsenal XI side at Broadhall Way, a Chuks Aneke goal in the second-half separating the teams. Trialist Rohan Ricketts played 45 minutes for Stevenage, while Robin Shroot again featured as a second-half substitute — with the latter signing a two-year contract three days later. Stevenage lost their third consecutive pre-season friendly, again by a 1–0 scoreline, when they travelled to Conference South side Hampton & Richmond Borough on 26 July."]}, {"page": "2011–12 Oxford United F.C. season", "response": ["|10 ||MF || ||26 ||Liam Davis || 2 || 0 || 0 || 0 || 2", "|26 || ||MF ||Liam Davis || 4 || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 4 || 1", "| Liam Davis"]}, {"page": "2011–12 Northampton Town F.C. season", "response": ["| Liam Davis"]}, {"page": "2012–13 Oxford United F.C. season", "response": ["|= ||MF || ||26 ||Liam Davis || 1 || 0 || 0 || 0 || 1", "|26 || ||MF ||Liam Davis || 1 || 0 || 1 || 0 || 0 || 0 || 0 || 0 || 2 || 0"]}, {"page": "2013–14 Yeovil Town F.C. season", "response": ["On 12 July, the club embarked short pre-season bonding trip to southern Portugal, with the club confirming only one trialist was present on the trip former Northampton defender Seth Nana Twumasi. The following day the club played an unofficial friendly match against Portuguese Segunda Liga side SC Farense, taking place at the Browns Leisure Complex in Quarteira where the Glovers had been training. Yeovil lost the friendly 2–0 and had to play part of the second half with 10-men following the sending off of Chelsea loanee Billy Clifford for a second bookable offence. Yeovil returned home to play Torquay United in a friendly, on 16 July, where their squad included former Southampton defender Danny Seaborne. Despite dominating the game in terms of possession and chances two late Torquay goals condemned the Glovers to a second consecutive 2–0 defeat. A third consecutive defeat without scoring followed with a 5–0 defeat against Premier League side Swansea City in the club's first home friendly. After the game the club confirmed the signing of former Southampton defender Seaborne on a two-year contract. On 23 July, Yeovil confirmed the signing of Swansea City defender Alan Tate on loan until 2 January 2014, the club made the announcement of the signing by producing a mocked-up picture of an easel outside Huish Park following the arrival of the Duke and Duchess of Cambridge's son the day before. Tate made his debut that evening in a 2–1 friendly victory over Exeter City courtesy of goals from Ed Upson and Paddy Madden. The players who didn't feature prominently in the club's final home friendly played a Bristol City U21 side, on 25 July. The Yeovil XI won the match 3–1 thanks to a brace from Sam Hoskins and a goal from Liverpool loanee Michael Ngoo. Yeovil then travelled to Home Park to play Plymouth Argyle on 27 July, Yeovil's side featured a new trialist in the shape of former Port Vale midfielder Ryan Burge. The Glovers won the match 2–1 with first half goals from Madden and Hayter. Yeovil's final game of pre-season was a trip to The New Lawn to play Forest Green Rovers. A weakened Yeovil side featuring three new trialists, Swansea City full back Curtis Obeng, former Oxford United left sided players Liam Davis and midfielder Ben Long, won the match 5–3 with two goals from Michael Ngoo, a goal each from Sam Hoskins and trialist Ben Long and an own goal. Yeovil's pre-season preparation featured nine matches in all with six victories and three defeats Yeovil scoring 22 goals and conceding 16. The following day the club announced the signing of Liam Davis on a two-year contract, and at the club's photocall confirmed that Nathan Ralph and Lewis Young both agreed new short-term deals with the club as well as former Northampton Town defender Seth Nana Twumasi.", "The new month saw Yeovil face Leicester City at home and lost the match 2–1 but grabbed their first home league goal of the season through a James Hayter penalty. On 5 October, Yeovil travelled to the Riverside Stadium to face Middlesbrough, despite taking an early lead through Liam Davis Yeovil lost the match 4–1. A strong Yeovil reserves side faced Radstock Town in the Somerset Premier Cup, Yeovil won the game 8–0 with a first half hat trick from Paddy Madden. On 9 October, the club confirmed that Liverpool loanee Michael Ngoo his loan had been cancelled by mutual consent after dropping down the pecking order with Yeovil and returned to his parent club. On 15 October, Yeovil played local side Wincanton Town to formally switch on the club's new floodlights. The Glovers won the friendly 8–0. Scottish under-21 midfielder Fraser Fyvie arrived on loan from Wigan Athletic on loan until 1 January. Yeovil returned to Championship action, on 19 October, with a home match against Brighton & Hove Albion and picked up their first home point of the season with a 0–0 draw. New loan player Fyvie's debut only lasted 22 minutes after suffering a \"grade two shoulder injury\" keeping him out of action for around a month. In midweek Yeovil faced Conference South side Dorchester Town, Yeovil beating the Dorset club 6–0 in a friendly. On 25 October, the club announced that Wolves keeper Hennessey had extended his loan for a final month until 17 November. The following day Yeovil faced high flying Nottingham Forest at Huish Park. An eighth-minute opener from Ed Upson set Yeovil on their way before Forest's Simon Cox had a penalty saved by Wayne Hennessey. Upson completed his brace with a goal from 25 yards, and although Forest immediately replied through Nathaniel Chalobah, Yeovil extended their lead just before half time when Byron Webster headed in from an Upson corner. Yeovil held on to win their first home league game of the season. On 31 October, the club announced the extension of Everton defender Shane Duffy's loan by a further month.", "Heavy rain over Christmas and New Year saw Yeovil's New Years Day home game against Watford postponed because of a waterlogged pitch. The opening of the transfer window saw Yeovil confirm the permanent signing of Liverpool striker Adam Morgan on a two-and-a-half-year contract, and the extension of Everton midfielder John Lundstram's loan until the end of the season. On 2 January, Yeovil completed their second signing of the transfer window Italian former Oldham Athletic defender Matteo Lanzoni joining on an eighteen-month contract. On 4 January, Yeovil faced Football League One side Leyton Orient in the FA Cup third round. Yeovil ended a three-game losing run with a convincing 4–0 victory thanks to a brace from James Hayter and a goal each from Joel Grant and Kieffer Moore. The following day saw Yeovil, through to the FA Cup fourth round for just the third time in their history, drawn away against Premier League side Southampton. After being on the transfer list for six weeks, on 10 January last season's top goalscorer Paddy Madden joined Football League Two side Scunthorpe United for an undisclosed fee, believed to be £300,000. On 11 January, Yeovil announced they had agreed to extend the loan of Cardiff City midfielder Joe Ralls until the end of the season. The same day Yeovil faced Burnley at Huish Park, goals from Danny Ings and Sam Vokes consigned Yeovil to a 2–1 defeat despite Kieffer Moore's first Championship goal. Defender Danny Seaborne joined Coventry City on a free transfer on 14 January having initially joined the League One side on loan in November. On 17 January, Yeovil confirmed the signing of Leicester City left-back Zoumana Bakayogo on a month-long loan deal to cover an injury to Liam Davis. Bakayogo made his debut the following day away at Birmingham City, and thanks to a first-half brace from James Hayter Yeovil won the match 2–0. Bakayogo's loan spell lasted just 37 minutes after he ruptured his anterior cruciate ligament and returned to Leicester City. On 23 January, Nottingham Forest striker Ishmael Miller rejoined on loan until the end of the season. Yeovil's FA Cup fourth round tie, on 25 January, against Southampton saw the club take over 3,000 away fans but the Premier League side won the match 2–0. On 28 January, Yeovil traveled to Derby County despite leading 2–0 at half time thanks to goals from John Lundstram and Ishmael Miller a second half collapse saw Yeovil lose the match 3–2 to fall to the bottom of the Championship table."]}, {"page": "2013–14 Oxford United F.C. season", "response": ["|Liam Davis"]}, {"page": "2014–15 Yeovil Town F.C. season", "response": ["On 27 July, Yeovil suffered their first pre-season defeat losing 4–1 at home to Championship side Cardiff City despite leading 1–0 at half-time thanks to another Leitch-Smith goal. The club bounced back from their defeat with a 2–1 victory away at League Two side Plymouth Argyle with goals from Liam Davis and Sam Hoskins. Prior to their friendly victory the club announced their squad numbers for the new season and included former non-contract defender Calvin Brooks indicating that he had been offered a contract for the new season. The 1 August, saw Yeovil announce local taxi firm Radio Cabs as the new sponsor for the Away Stand at Huish Park. Following a brief training camp in Cornwall, Yeovil's penultimate friendly saw them face Truro City as part of the Cornish club's 125th Anniversary celebrations. Goals from trialist Simon Gillett and former Truro forward Kieffer Moore earned Yeovil a 2–1 victory. Yeovil completed their pre-season with a visit to Dorchester Town on 4 August. Hat-tricks from James Hayter and Sam Hoskins along with goals from Seth Nana Twumasi, Matteo Lanzoni and Sam Foley saw Yeovil run out 9–0 victors. On 7 August, the club confirmed the signing of former Nottingham Forest midfielder Simon Gillett on a two-year contract, and the following day confirmed that defender Nathan Ralph had signed a six-month contract extension. Forward Adam Morgan, on 8 August, signed for Scottish Premiership side St Johnstone on a five-month loan deal until mid-January 2015. On the same day manager Gary Johnson announced versatile midfielder Joe Edwards as his captain for the forthcoming season.", "The end of the season saw new manager Paul Sturrock perform a major clear out of the Yeovil squad, with eleven players released including Fergus Bell, Liam Davis, Craig Eastmond, Joel Grant, James Hayter, Sam Hoskins, Kieffer Moore, Nathan Ralph, Alex Smith, Seth Nana Twumasi and Gozie Ugwu. Club captain Joe Edwards rejected an offer of a new contract and left the club, while midfielder Kevin Dawson and Sam Foley were also offered new contracts and goalkeeper Chris Weale was offered a fresh contract. In addition the club made offers to terminate the contracts of A-Jay Leitch-Smith, James Berrett, Adam Morgan and Artur Krysiak. Morgan was the first of the four to agree to terminate his contract to join Accrington Stanley on a one-year deal, midfielder Berrett left for York City, while Krysiak decided to remain at the club. On 26 May, the Sturrock agreed a new two-year contract with the club having been working with the club informally since April. On 18 June, midfielder Sam Foley rejected the club's offer of a new contract to sign a two-year deal with Port Vale, while the following day Kevin Dawson signed a new two-year contract with the club."]}, {"page": "2008–09 Northampton Town F.C. season", "response": ["| 14 || LM || style=\"text-align:left;\" |  Liam Davis"]}, {"page": "2015–16 Yeovil Town F.C. season", "response": ["The end of the season saw new manager Paul Sturrock perform a major clear out of the Yeovil squad, with eleven players released including Fergus Bell, Liam Davis, Craig Eastmond, Joel Grant, James Hayter, Sam Hoskins, Kieffer Moore, Nathan Ralph, Alex Smith, Seth Nana Twumasi and Gozie Ugwu, while club captain Joe Edwards and midfielder Sam Foley both rejected offers of new contracts. A further four players were offered deals to terminate their contracts early with both James Berrett and Adam Morgan agreeing to leave the club in the close season. Finally midfielder Kevin Dawson signed a new two-year contract with the club."]}, {"page": "2016–17 Luton Town F.C. season", "response": ["Luton drew 1–1 away to Wycombe Wanderers, taking the lead on 56 minutes when Scott Cuthbert scored a header before the home team equalised through Adebayo Akinfenwa with a powerful header past goalkeeper Walton in the 82nd minute. Verney's loan at Kings Langley was extended until the end of the season. Luton moved up to fourth place in the table after a 2–0 victory at home to Cambridge United, and took the lead in the 33rd minute through Vassell, before Cook doubled the lead on 82 minutes with a penalty after Vassell was fouled by Leon Legge in the penalty area. Striker Geo Craig joined Isthmian League Premier Division club Hendon on loan until the end of the season. Mackail-Smith joined League One club Peterborough United on loan until the end of the season, before Freddie Hinds joined Championship club Bristol City for an undisclosed fee. Walton was recalled by Brighton & Hove Albion, and was immediately replaced by goalkeepers Stuart Moore and Matt Macey, who joined on loan until the end of 2016–17 from Reading and Arsenal respectively, while striker Ollie Palmer also signed on loan until the end of the season from Leyton Orient. Nathan Doyle's contract with Luton was terminated by mutual consent. Luton lost 3–2 at home to Cheltenham Town, who took the lead in the fifth minute through Will Boyle after a goalkeeping error from Moore. The visitors made it 2–0 in the 28th minute through Jack Barthram, before Vassell brought Luton back into the match four minutes before half-time with a powerful shot. Cheltenham restored their two-goal advantage through Billy Waters in the second half, before Luton recorded a consolation goal after Liam Davis scored an own goal from Lee's free kick on 72 minutes."]}, {"page": "2016–17 Cheltenham Town F.C. season", "response": ["| 30 January 2017 || LB ||  || Liam Davis || GAIS || Free transfer || "]}]}}