{"wiki_id": "http://www.wikidata.org/entity/Q6530009", "itemLabel": "Les Strong", "itemDescription": "English footballer (born 1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Les_Strong", "wikipedia_page": {"main": "Leslie Strong (born 3 July 1953) is a former English association football player. He spent the majority of his career playing at left back for Fulham F.C., where he began as a youth player in 1969 under the guidance of World Cup winner George Cohen. Between 1972 and 1983, Strong made 427 appearances, including 373 League games, putting him 10th in the all time Fulham appearance list. After appearing in all 57 regular-season games, Strong missed the 1975 FA Cup Final against West Ham United due to injury.In the 1981–82 season, manager Malcolm Macdonald made Strong the Fulham club captain and under his leadership,Fulham were promoted to the Second Division. In 1981, Strong was granted a testimonial season, for his 10 years service, culminating in a match versus England. After a brief loan to Brentford F.C. and single seasons at Crystal Palace and Rochdale, Strong retired in 1985. He went on to manage the Anguilla national football team and Petite Rivière Noire FC of the Mauritian League. Under his management, they won the Mauritian Cup for the first time in 2007, thus qualifying for the African cup winners cup.Strong is currently a popular match day host in Fulham's hospitality lounges.", "link_mentions": [{"page": "1953", "response": ["** Les Strong, English association footballer"]}, {"page": "Molesey", "response": ["*Les Strong, professional footballer who played for Crystal Palace and Fulham"]}, {"page": "West London derby", "response": ["* Les Strong – loaned to Brentford."]}, {"page": "John Fraser (footballer, born 1953)", "response": ["After being spotted playing for his school team, Fraser entered the youth system at First Division club Fulham at the age of 14 in 1967. He began his career as a midfielder, but switched to full back under reserve team manager George Cohen and signed his first professional contract in 1971. He made his senior debut during the 1971–72 Second Division season and gradually built on his appearance record year-by-year to play 25 games during the 1974–75 season. An injury to Les Strong allowed him a place in the starting lineup for the 1975 FA Cup Final, which was lost 2–0 to West Ham United. Fraser fell out of favour with manager Alec Stock during the 1975–76 pre-season and departed the club at the end of the season. He made 65 appearances and scored one goal as a first team player at Craven Cottage."]}, {"page": "1982–83 Brentford F.C. season", "response": ["|Les Strong", "| style=\"text-align:left;\" |Les Strong", "| Les Strong"]}, {"page": "List of Rochdale A.F.C. players (1–24 appearances)", "response": ["|Les Strong"]}]}}