{"wiki_id": "http://www.wikidata.org/entity/Q6530806", "itemLabel": "Leslie Fielding", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/Leslie_Fielding", "wikipedia_page": {"main": "Sir Leslie Fielding  (29 July 1932 – 4 March 2021) was a British diplomat. In the Diplomatic Service, he spent time in the Foreign Office in London before serving as the European Commission Ambassador to Tokyo between 1978 and 1982. He was Director-General for external relations at the European Commission from 1982 to 1987.", "link_mentions": [{"page": "July 29", "response": ["*1932 – Leslie Fielding, English diplomat (d. 2021)"]}, {"page": "University of Sussex", "response": ["|Leslie Fielding"]}, {"page": "SOAS University of London", "response": ["* In government, alumni include Dharma Vira, who served as 8th Cabinet Secretary of India, Johnnie Carson, former US Ambassador to Kenya, Zimbabwe and Uganda, Hassan Taqizadeh, Iranian Ambassador to the UK, Sir Shridath Ramphal, Secretary-General of the Commonwealth, Sir Leslie Fielding, British diplomat and former European Commission Ambassador to Tokyo, Sir David Warren, former UK Ambassador to Japan, Quinton Quayle, UK Ambassador to Thailand and Lao, Sir Robin McLaren, UK Ambassador to China and the Philippines,\"Sir Robin McLaren\"  (obituary), The Telegraph, 29 July 2010. Retrieved 17 July 2013. Sir Michael Weir, UK Ambassador to Egypt, Jemima Khan, UK Ambassador to UNICEF, Hugh Carless, UK Ambassador to Venezuela,\"Hugh Carless\"  (obituary). The Telegraph, 21 December 2011. Retrieved 17 July 2013. Francis K. Butagira, Ambassador and Permanent Representative, Mission of the Republic of Uganda to the United Nations, Gunapala Malalasekera, Sri Lankan Ambassador to UK, Canada and Soviet Union, Michael C Williams, UN Special Coordinator for Lebanon, Guillaume Long, former Foreign Minister of Ecuador, Haifa al-Mogrin - Saudi Arabia's delegate to UNESCO."]}, {"page": "Society of King Charles the Martyr", "response": ["The patrons of the society are Lord Nicholas Windsor, Sir Leslie Fielding, and Arthur Middleton, a former canon of Durham."]}, {"page": "List of ambassadors of the United Kingdom to Cambodia", "response": ["*1964–1966: Leslie Fielding"]}, {"page": "List of School of Oriental and African Studies people", "response": ["*Sir Leslie Fielding, former British diplomat"]}, {"page": "1988 New Year Honours", "response": ["*Leslie Fielding, lately Director-General for External Relations, Commission of the European Communities, Brussels."]}, {"page": "List of Honorary Fellows of Emmanuel College, Cambridge", "response": ["* Sir Leslie Fielding"]}, {"page": "Fielding (surname)", "response": ["*Sir Leslie Fielding (born 1932), British former ambassador"]}, {"page": "Deaths in March 2021", "response": ["*Sir Leslie Fielding, 88, British diplomat.Fielding"]}]}}