{"wiki_id": "http://www.wikidata.org/entity/Q6548603", "itemLabel": "Lily van den Broecke", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Lily_van_den_Broecke", "wikipedia_page": {"main": "Lily Jacoba van den Broecke  (born 8 January 1992) is a British rower who competed at the 2012 Summer Paralympics as the coxswain in the mixed coxed four for Great Britain, and won the gold medal.", "link_mentions": [{"page": "List of Durham University people", "response": ["* Lily van den Broecke (Castle)"]}, {"page": "Headington School", "response": ["*Lily van den Broecke, Great Britain Rowing Paralympian: Gold London 2012"]}, {"page": "Durham University Boat Club", "response": ["The first Durham rower to make the GB Olympic squad was Simon Hobbs (King's College, now Newcastle University) who was spare man in 1952. In recent years, Durham representation had included Wade Hall-Craggs, Roger Brown, Kim Thomas and Philippa Cross (1992); Roger Brown (M8+), Philippa Cross (W2-) and Suzie Ellis (W8+) (1996); Ian Lawson (M1x) and Tracy Langlands (LW2x) (2004); Steve Rowbotham (bronze; M2x), James Clarke (LM4- ) Alice Freeman (W8+) and Louisa Reeve (W8+ and W2-) (2008); and Sophie Hosking (gold; LW2x) and Louisa Reeve (W8+) (2012). Lily van den Broecke coxed the mixed 4+ to gold in the 2012 Paralympics."]}, {"page": "Lily (name)", "response": ["* Lily van den Broecke (born 1992), British rower"]}, {"page": "2011 World Rowing Championships", "response": ["| Pam RelphNaomi RichesDavid SmithJames RoeLily van den Broecke|| 3:27.10"]}, {"page": "Great Britain at the 2012 Summer Paralympics", "response": ["|  || Naomi RichesDavid SmithJames RoeLily van den Broecke (cox) || Rowing || Mixed coxed four LTAMix4+ || 2 September", " The mixed coxed four of Naomi Riches, Pam Relph, David Smith, James Roe and cox Lily van den Broecke, who won gold at the 2011 World Rowing Championships, were also selected. Britain's only medal of the regatta was a gold won by the mixed coxed four crew. Nick Beighton and Sam Scowen came fourth in the mixed double sculls, missing out on bronze in a photo finish. Tom Aggar finished in fourth place in the final of the men's single sculls, his first defeat in five years of international racing.", "|Lily van den Broecke (cox)Naomi RichesPam RelphJames RoeDavid Smith"]}, {"page": "Van den Broeck", "response": ["*Lily van den Broecke (b. 1992), British rower"]}, {"page": "September 2011 in sports", "response": ["***Mixed coxed fours (LTAMix4+):   (Pam Relph, Naomi Riches, David Smith, James Roe, Lily van den Broecke) 3:27.10   (Anthony Theriault, David Blair, Victoria Nolan, Meghan Montgomery, Laura Comeau) 3:31.84   (Anke Molkenthin, Christiane Quirin, Martin Lossau, Michael Schulz, Katrin Splitt) 3:33.27"]}, {"page": "Rowing at the 2012 Summer Paralympics", "response": ["|Pam RelphNaomi RichesDavid SmithJames RoeLily van den Broecke (Cox)"]}, {"page": "Pam Relph", "response": ["In 2011, she competed at the World Rowing Championships held at Lake Bled, Bled, Slovenia. She won the gold medal in the Legs Trunk and Arms mixed Coxed Four (LTAMix4+) event alongside crewmates Naomi Riches, David Smith, James Roe and Lily van den Broecke, the cox. They completed the one kilometre course in a time of three minutes, 27.10 seconds, finishing nearly five seconds ahead of the second placed Canadian boat. The result meant that Great Britain qualified a boat for the 2012 Summer Paralympics in London. The crew repeated their gold medal result at the Munich World Cup event in 2012."]}, {"page": "Naomi Riches", "response": ["In 2011, she competed at the World Rowing Championships held at Lake Bled, Bled, Slovenia. She won the gold medal in the LTAMix4+ event alongside crewmates Pam Relph, David Smith, James Roe and Lily van den Broecke, the cox. They completed the one kilometre course in a time of three minutes, 27.10 seconds, finishing nearly five seconds ahead of the second placed Canadian boat. The result qualified a boat for Great Britain into the 2012 Summer Paralympics in London. The crew repeated their gold medal result at the Munich World Cup event in 2012."]}, {"page": "James Roe (rower)", "response": ["In 2011 he competed at the World Rowing Championships held at Lake Bled, Bled, Slovenia. He won the gold medal in the LTAMix4+ event alongside crewmates Pam Relph, Naomi Riches, David Smith and cox, Lily van den Broecke. They completed the one kilometre course in a time of three minutes, 27.10 seconds, finishing nearly five seconds ahead of runners-up Canada. The result qualified a boat for Great Britain into the 2012 Summer Paralympics in London. The crew repeated their gold medal result at the Munich World Cup event in 2012."]}, {"page": "David Smith (rower)", "response": ["In 2011 he competed at the World Rowing Championships held at Lake Bled, Bled, Slovenia. He won the gold medal in the LTAMix4+ event alongside crewmates Pam Relph, Naomi Riches, James Roe and cox, Lily van den Broecke. They completed the one kilometre course in a time of three minutes, 27.10 seconds, finishing nearly five seconds ahead of runners-up Canada. The result qualified a boat for Great Britain into the 2012 Summer Paralympics in London. The crew repeated their gold medal result at the Munich World Cup event in 2012."]}, {"page": "Lily Van Den Broecke", "response": ["#REDIRECT Lily van den Broecke "]}, {"page": "Rowing at the 2012 Summer Paralympics – Mixed coxed four", "response": ["| align=\"center\" | 1 ||  || Pam Relph || Naomi Riches || David Smith || James Roe || Lily van den Broecke"]}, {"page": "List of 2012 Summer Paralympics medal winners", "response": ["|Pam RelphNaomi RichesDavid SmithJames RoeLily van den Broecke (Cox)"]}, {"page": "Divinity Road", "response": ["Lily van den Broecke, a gold medalist in the mixed coxed fours event on Dorney Lake at the 2012 Summer Paralympic Games, was a resident of the road in 2012, so a post box in the road was painted gold in her honour.", "File:Lily van den Broecke's gold post box in Oxford.jpg|Gold post box for Lily van den Broecke, gold medalist for rowing (mixed coxed fours) at the 2012 Summer Paralympic Games."]}, {"page": "List of Paralympic medalists in rowing", "response": ["| Pamela RelphNaomi RichesJames RoeDavid SmithLily van den Broecke (coxswain)"]}]}}