{"wiki_id": "http://www.wikidata.org/entity/Q6548214", "itemLabel": "Lillian Spender", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Lillian_Spender", "wikipedia_page": {"main": "Lillian Spender (usually known as Mrs. John Kent Spender; 22 February 1835 – 4 May 1895) was an English writer. She contributed to major English reviews and turned later to novel-writing.", "link_mentions": [{"page": "1895 in literature", "response": ["*May 4 – Lillian Spender (née Headland), English novelist (born 1835)"]}, {"page": "1835 in literature", "response": ["*February 22 – Lillian Spender (née Headland), English novelist (died 1895)"]}, {"page": "Monk Gibbon", "response": ["In 1928, he married Mabel Dingwall, daughter of Walter Molyneux Dingwall of Bonchurch and Mabel Sophia Spender, a daughter of Edward Spender of Bath, Somerset. They were the parents of six children. Mrs Gibbon's father, Edward Spender, was a strong supporter of the Women's Suffrage movement in which his sister, the novelist Emily Spender played a leading role as a member of the executive committee of the Central Committee of the National Society for Women's Suffrage. Edward Spender was a cousin of the diarist Henry Crabb Robinson, and a brother-in-law of the novelist Lillian Spender and the liberal politician William Saunders, with whom he founded the Central News Agency (London). Mrs Gibbon's mother was a first cousin of John Alfred Spender, uncle of the poet Sir Stephen Spender."]}, {"page": "Her Brother's Keeper", "response": ["*Her Brother's Keeper, a novel by Lillian Spender"]}, {"page": "J. A. Spender", "response": ["Spender was the eldest of four sons born to John Kent Spender, a doctor, and his wife, the novelist Lillian Spender. He was educated at Bath College and Balliol College, Oxford, where he did well in his studies but missed a first in Greats because of illness."]}, {"page": "Harold Spender", "response": ["He was the son of Dr John Kent Spender and his wife Lillian Spender, and John Alfred Spender was his brother. He was educated at Bath College where he was Head Boy from 1882–83. Exhibitioner of University College, Oxford. 1st in Mods. 1884; 1st. in Lit. Hum. 1887; MA. Harold was a friend of David Lloyd George, with whom he went hiking, and travelled to Germany. He married, in 1904, Violet Hilda Schuster. They had three sons, Michael, Stephen, Humphrey and one daughter, Christine. His wife died in 1921.‘SPENDER, E. Harold’, Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2007; online edn, Oxford University Press, Dec 2007 accessed 29 Dec 2013 After his death Stephen and Christine were raised in Hampstead by a governess."]}, {"page": "Lily Spender", "response": ["#REDIRECT Lillian Spender"]}, {"page": "Mrs. John Kent Spender", "response": ["#REDIRECT Lillian Spender"]}, {"page": "Lillian Headland", "response": ["#REDIRECT Lillian Spender"]}, {"page": "Lily Headland", "response": ["#REDIRECT Lillian Spender"]}, {"page": "Spender (surname)", "response": ["*Lillian Spender (1835–1895), English novelist"]}]}}