{"wiki_id": "http://www.wikidata.org/entity/Q6557938", "itemLabel": "Lisa Diveney", "itemDescription": "actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Lisa_Diveney", "wikipedia_page": {"main": "Lisa Ann Diveney (born 1984) is a British actress, best known for playing Beth in the Only Fools and Horses spin-off The Green Green Grass. She has also appeared in an episode of BBC drama Call the Midwife.", "link_mentions": [{"page": "The Green Green Grass", "response": ["The departure of Lisa Diveney as Beth was then filled with the arrival of Samantha Sutherland, who played Sara, Tyler's new girlfriend. Boycie fell in fear of the Driscoll brothers once more when they turned up at The Grange and machine gunned his front door down when he refused to answer it. Also, paranormal experts investigate the house, Boycie decides to take some old items to the Antiques Roadshow and Boycie and Marlene decide to renew their vows for their fortieth wedding anniversary, but realise they might not be legally married at all.", "| Lisa Diveney || Beth || colspan=\"3\"  || colspan=\"1\"  || 15", "Beth (Lisa Diveney) – Beth is Tyler's girlfriend until the end of the third series. She is clever, attractive and vegetarian. Over the three years she spent as Tyler's girlfriend, she had her patience put to the test. First, Tyler showed no interest in supporting her horse racing protests, then he put meat before her, and, to top things off, she peers through the window to see Boycie completely naked, thanks to Earl, in Mother Earth."]}, {"page": "One Flew Over the Cuckoo Clock", "response": ["| Lisa Diveney"]}, {"page": "From Here to Paternity", "response": ["| Lisa Diveney"]}, {"page": "Pillow Talk (The Green Green Grass)", "response": ["| Lisa Diveney"]}, {"page": "Sex and the Country", "response": ["| Lisa Diveney"]}, {"page": "Testing Times", "response": ["| Lisa Diveney"]}, {"page": "Here's to You, Mrs Boyce", "response": ["| Lisa Diveney"]}, {"page": "Mother Earth (The Green Green Grass)", "response": ["| Lisa Diveney"]}, {"page": "Schoolboy French", "response": ["| Lisa Diveney"]}, {"page": "More Questions Than Answers", "response": ["| Lisa Diveney"]}, {"page": "But is it Art?", "response": ["| Lisa Diveney"]}, {"page": "If You Go Down to the Woods", "response": ["| Lisa Diveney"]}, {"page": "Sweet Sorrow (The Green Green Grass)", "response": ["| Lisa Diveney"]}, {"page": "Fifteen Minutes (The Green Green Grass)", "response": ["| Lisa Diveney"]}, {"page": "The Final Curtain (The Green Green Grass)", "response": ["| Lisa Diveney"]}, {"page": "The Special Relationship (The Green Green Grass)", "response": ["| Lisa Diveney"]}, {"page": "List of The Green Green Grass characters", "response": ["Other regulars in the series include Beth as played by Lisa Diveney, Llewellyn as played by Alan David, Ray as played by Nigel Harrison and Sara as played by Samantha Sutherland. Dora as played by June Whitfield and The Driscoll Brothers as played by Roy Marsden and Christopher Ryan have all made three appearances in The Green Green Grass.", "|colspan=\"3\"| Lisa Diveney", "Bethany (Lisa Diveney) – Beth is Tyler's Welsh girlfriend until the end of the third series. She is intelligent, pretty and a practicing vegetarian, but also intolerant of people who do not share her views. In the episode \"Mother Earth,\" Beth's patience with Tyler and the family was put to its ultimate test. Among other things, she got upset with Tyler's lack of interest in her horse-racing protests and his decision to choose eating meat over a relationship with her, and is later traumatised when she peers through the window of their home to see Boycie completely naked, thanks to Earl."]}, {"page": "The Green Green Grass (series 1)", "response": ["Lisa Diveney's character, Beth, who was Tyler's girlfriend, became a regular from the episode \"Pillow Talk\"."]}, {"page": "The Green Green Grass (series 2)", "response": ["Lisa Diveney's character, Beth, who was Tyler's girlfriend, was regular throughout the series, as was Llewellyn (Alan David) and Ray (Nigel Harrison)."]}, {"page": "The Green Green Grass (series 3)", "response": ["Lisa Diveney's character, Beth, who was Tyler's girlfriend, was regular throughout the series before leaving the series after the special. Llewellyn (Alan David) and Ray (Nigel Harrison) were also regulars throughout the series."]}, {"page": "A Thousand Stars Explode in the Sky", "response": ["Lisa Diveney"]}, {"page": "Injustice (British TV series)", "response": ["* Lisa Diveney as Kate Travers"]}]}}