{"wiki_id": "http://www.wikidata.org/entity/Q6552887", "itemLabel": "Lindsey Hughes", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Lindsey_Hughes", "wikipedia_page": {"main": "Lindsey Hughes (4 May 1949 – 26 April 2007) was a British historian who studied seventeenth- and eighteenth-century Russia, especially the reign of Peter the Great. She wrote biographies of Peter and his predecessor Sophia Alekseyevna, as well as a more general work, Russia in the Age of Peter the Great. She also wrote prolifically on art history.", "link_mentions": [{"page": "Peter the Great", "response": ["A clerical career was not a route chosen by upper-class society. Most parish priests were sons of priests, were very poorly educated, and very poorly paid. The monks in the monasteries had a slightly higher status; they were not allowed to marry. Politically, the church was impotent.Lindsey Hughes, Russia in the Age of Peter the Great (1998) pp. 332–56.", "Peter's legacy has always been a major concern of Russian intellectuals. Riasanovsky points to a \"paradoxical dichotomy\" in the black and white images such as God/Antichrist, educator/ignoramus, architect of Russia's greatness/destroyer of national culture, father of his country/scourge of the common man. Voltaire's 1759 biography gave 18th-century Russians a man of the Enlightenment, while Alexander Pushkin's \"The Bronze Horseman\" poem of 1833 gave a powerful romantic image of a creator-god.Nicholas Riasanovsky, The Image of Peter the Great in Russian History and Thought (1985) pp. 57, 84, 279, 283.A. Lenton, \"Voltaire and Peter the Great\" History Today (1968) 18#10 onlineKathleen Scollins, \"Cursing at the Whirlwind: The Old Testament Landscape of The Bronze Horseman.\" Pushkin Review 16.1 (2014): 205-231 online. Slavophiles in mid-19th century deplored Peter's westernization of Russia. Western writers and political analysts recounted \"The Testimony\" or secret will of Peter the Great. It supposedly revealed his grand evil plot for Russia to control the world via conquest of Constantinople, Afghanistan and India. It was a forgery made in Paris at Napoleon's command when he started his invasion of Russia in 1812. Nevertheless it is still quoted in foreign policy circles.Albert Resis, \"Russophobia and the 'Testament' of Peter the Great, 1812-1980 Slavic Review 44#4 (1985), pp. 681-693 online The Communists executed the last Romanovs, and their historians such as Mikhail Pokrovsky presented strongly negative views of the entire dynasty. Stalin however admired how Peter strengthened the state, and wartime, diplomacy, industry, higher education, and government administration. Stalin wrote in 1928, \"when Peter the Great, who had to deal with more developed countries in the West, feverishly built works in factories for supplying the army and strengthening the country's defenses, this was an original attempt to leap out of the framework of backwardness.\"Lindsey Hughes, Russia in the Age of Peter the Great (1998) p 464. As a result Soviet historiography emphasizes both the positive achievement and the negative factor of oppressing the common people.Riasanovsky, p. 305.", "Peter has been featured in many histories, novels, plays, films, monuments and paintings.Nicholas V. Riasanovsky, The Image of Peter the Great in Russian History and Thought (1985).Lindsey Hughes, \"'What manner of man did we lose?': Death-bed images of Peter the Great.\" Russian History 35.1-2 (2008): 45-61. They include the poems The Bronze Horseman, Poltava and the unfinished novel The Moor of Peter the Great, all by Alexander Pushkin. The former dealt with The Bronze Horseman, an equestrian statue raised in Peter's honour. Aleksey Nikolayevich Tolstoy wrote a biographical historical novel about him, named Pëtr I, in the 1930s."]}, {"page": "List of historians by area of study", "response": ["* Lindsey Hughes (1949–2007) - C17th and C18th"]}, {"page": "Darwin College, Cambridge", "response": ["|Lindsey Hughes"]}, {"page": "UCL School of Slavonic and East European Studies", "response": ["*Lindsey Hughes (Reader then Professor of Russian History, 1987–2007)"]}, {"page": "2007 in the United Kingdom", "response": ["* 26 April – Lindsey Hughes, historian of Russia (born 1949)"]}, {"page": "1949 in the United Kingdom", "response": ["* 4 May – Lindsey Hughes, historian (died 2007)"]}, {"page": "Deaths in April 2007", "response": ["*Lindsey Hughes, 57, British professor of Russian History at University College London, cancer."]}, {"page": "Hughes (surname)", "response": ["*Lindsey Hughes (1949–2007), British historian"]}, {"page": "Lindsay (name)", "response": ["*Lindsey Hughes, historian"]}, {"page": "Russian Empire", "response": ["As part of Peter's reorganisation, he also enacted a church reform. The Russian Orthodox Church was partially incorporated into the country's administrative structure, in effect making it a tool of the state. Peter abolished the patriarchate and replaced it with a collective body, the Holy Synod, which was led by a government official.Lindsey Hughes, Russia in the Age of Peter the Great (1998)"]}, {"page": "Nikita Zotov", "response": ["Count Nikita Moiseevich Zotov () (1644 – December 1717) was a childhood tutor and lifelong friend of Russian Tsar Peter the Great. Historians disagree on the quality of Zotov's tutoring. Robert K. Massie, for example, praises his efforts, but Lindsey Hughes criticizes the education that he gave to the future tsar.", "Zotov became one of Peter's first friends, and the two remained close throughout Zotov's life. Lindsey Hughes, a 20th-century historian, has criticized Zotov for giving Peter an education that did not teach what a future tsar ought to know. Her contemporary, Robert K. Massie, has argued that the education was the best possible one for a curious boy like Peter, because it was unlikely that he would ever become tsar, as his half-brother, Ivan V, was before him in the line of succession. According to Massie, although Zotov may have not taught Peter at the highest possible level, he delivered \"the best education for a mind like Peter's\", as it \"stimulated [Peter's] curiosity\" and allowed him to become \"in large part, a self-taught man\". Zotov's closeness to the Tsar later became a source of worry to others in government, many of whom—including even the powerful Menshikov—feared his influence.", "According to Robert K. Massie and Lindsey Hughes, Peter told Zotov in October 1713 that he intended to have him marry a second time, to Anna Pashkova, a widow 50 years Zotov's junior, despite Zotov's wish to spend his final years in a monastery. However, the Brockhaus and Efron Encyclopedic Dictionary and Sergey Solovyov say that Zotov came up with the idea to marry Pashkova in 1714, and that his plan to become a monk was merely a joke."]}, {"page": "UCL Faculty of Social and Historical Sciences", "response": ["In May 2003, a team from the Department of Anthropology published a major piece of research on the possible link between the amount of food that a mother has to eat and the gender of her children. In May 2006 a report co-authored by James Banks of the Department of Economics was published which concluded that rates of diseases such as diabetes, lung cancer and high-blood pressure were up to twice as high among Americans aged between 55 and 64 as among English people of the same age group. Between 1997 and 2007 Lindsey Hughes was a Professor of Russian History at the School of Slavonic and East European Studies. In May 2009 a major report on the health risks posed by global warming co-authored by Mark Maslin, the Director of the Environment Institute, was published. In January 2010 Simon Corcoran and Benet Salway of the History Department discovered fragments of the Gregorian Codex, an important Roman law code that previously had been thought lost forever."]}, {"page": "Jodocus Crull", "response": ["Jodocus Crull, M.D., FRS (1660–1713) was a late 17th-century and early 18th-century \"miscellaneous writer\" on historical subjects, with political and sociological insights. Though his life remains somewhat of a mystery, his works are still consulted by academic and popular history writers today.For example, The Antient and Present State of Muscovy was used by Lindsey Hughes for his Sophia, Regent of Russia: 1657-1704 (New Haven: Yale University Press, 1990. ) and by Robert K. Massie for his Pulitzer Prize winning biography Peter the Great: His Life and World (New York: Ballantine Books, 1981. )"]}]}}