{"wiki_id": "http://www.wikidata.org/entity/Q655213", "itemLabel": "Leigh Hunt", "itemDescription": "English critic, essayist, poet and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Leigh_Hunt", "wikipedia_page": {"main": "James Henry Leigh Hunt (19 October 1784 – 28 August 1859), best known as Leigh Hunt, was an English critic, essayist and poet.\nHunt co-founded The Examiner, a leading intellectual journal expounding radical principles. He was the centre of the Hampstead-based group that included William Hazlitt and Charles Lamb, known as the \"Hunt circle\". Hunt also introduced John Keats, Percy Bysshe Shelley, Robert Browning and Alfred Tennyson to the public.\nHunt's presence at Shelley's funeral on the beach near Viareggio was immortalised in the painting by Louis Édouard Fournier, although in reality Hunt did not stand by the pyre, as portrayed. Hunt inspired aspects of the Harold Skimpole character in Charles Dickens' novel Bleak House.", "link_mentions": [{"page": "John Keats", "response": ["However, Keats's training took up increasing amounts of his writing time and he became increasingly ambivalent about it. He felt he was facing a stark choice.Motion (1998), p. 98. He had written his first extant poem, \"An Imitation of Spenser,\" in 1814, when he was 19. Now, strongly drawn by ambition, inspired by fellow poets such as Leigh Hunt and Lord Byron, and beleaguered by family financial crises, he suffered periods of depression. His brother George wrote that John \"feared that he should never be a poet, & if he was not he would destroy himself.\"Motion (1997), p. 94. In 1816, Keats received his apothecary's licence, which made him eligible to practise as an apothecary, physician and surgeon, but before the end of the year he had informed his guardian that he resolved to be a poet, not a surgeon.", "While continuing to work and train at Guy's, Keats spent more and more time studying literature and experimenting with verse forms, particularly the sonnet. In May 1816, Leigh Hunt agreed to publish the sonnet \"O Solitude\" in his magazine The Examiner, a leading liberal magazine of the day.Hirsch, Edward (2001) This was the first appearance of Keats's poetry in print; Charles Cowden Clarke called it his friend's red letter day,Colvin (2006), p. 35. the first proof that his ambitions could be achieved. Among his poems of 1816 was To My Brothers. That summer, Keats went with Clarke to the seaside town of Margate to write. There he began \"Calidore\" and initiated a great period of letter-writing. On returning to London, he took lodgings at 8 Dean Street, Southwark, and braced himself to study further for membership of the Royal College of Surgeons.Motion (1998), pp. 104–105.", "In October 1816, Clarke introduced Keats to the influential Leigh Hunt, a close friend of Byron and Shelley. Five months later came the publication of Poems, the first volume of Keats's verse, which included \"I stood tiptoe\" and \"Sleep and Poetry,\" both strongly influenced by Hunt. The book was a critical failure, arousing little interest, although Reynolds reviewed it favourably in The Champion. Clarke commented that the book \"might have emerged in Timbuctoo.\" Keats's publishers, Charles and James Ollier, felt ashamed of it. Keats immediately changed publishers to Taylor and Hessey in Fleet Street.Motion proposes that the Olliers suggested Keats leave their publishing lists. See Motion (1997) p. 156. Unlike the Olliers, Keats's new publishers were enthusiastic about his work. Within a month of the publication of Poems they were planning a new Keats volume and had paid him an advance. Hessey became a steady friend to Keats and made the company's rooms available for young writers to meet. Their publishing lists came to include Coleridge, Hazlitt, Clare, Hogg, Carlyle and Lamb.Motion (1997), p. 156.", "None of Keats's biographies were written by people who had known him. Shortly after his death, his publishers announced they would speedily publish The memoirs and remains of John Keats but his friends refused to cooperate and argued with each other to such an extent that the project was abandoned. Leigh Hunt's Lord Byron and some of his Contemporaries (1828) gives the first biographical account, strongly emphasising Keats's supposedly humble origins, a misconception which still continues. Given that he was becoming a significant figure within artistic circles, a succession of other publications followed, including anthologies of his many notes, chapters and letters.Gittings (1968), p. 3. However, early accounts often gave contradictory or biased versions of events and were subject to dispute. His friends Brown, Severn, Dilke, Shelley and his guardian Richard Abbey, his publisher Taylor, Fanny Brawne and many others issued posthumous commentary on Keats's life. These early writings coloured all subsequent biography and have become embedded in a body of Keats legend.Gittings (1968), p. 5."]}, {"page": "Kubla Khan", "response": ["More positive appraisals of the poem began to emerge when Coleridge's contemporaries evaluated his body of work overall. In October 1821, Leigh Hunt wrote a piece on Coleridge as part of his \"Sketches of the Living Poets\" series which singled out Kubla Khan as one of Coleridge's best works: Every lover of books, scholar or not...ought to be in possession of Mr. Coleridge's poems, if it is only for 'Christabel', 'Kubla Khan', and the 'Ancient Mariner'.\"Jackson 1970 qtd. p. 475 Hunt praised the poem's evocative, dreamlike beauty:\"[Kubla Khan] is a voice and a vision, an everlasting tune in our mouths, a dream fit for Cambuscan and all his poets, a dance of pictures such as Giotto or Cimabue, revived and re-inspired, would have made for a Storie of Old Tartarie, a piece of the invisible world made visible by a sun at midnight and sliding before our eyes...Justly is it thought that to be able to present such images as these to the mind, is to realise the world they speak of. We could repeat such verses as the following down a green glade, a whole summer's morning.\"Jackson 1970 qtd. pp. 475–476 An 1830 review of Coleridge's Poetical Works similarly praised for its \"melodious versification,\" describing it as \"perfect music.\" An 1834 review, published shortly after Coleridge's death, also praised Kubla Khan's musicality. These three later assessments of Kubla Khan responded more positively to Coleridge's description of composing the poem in a dream, as an additional facet of the poetry."]}, {"page": "Ozymandias", "response": ["The banker and political writer Horace Smith spent the Christmas season of 1817–1818 with Percy Bysshe Shelley and Mary Shelley. At this time, members of the Shelleys' literary circle would sometimes challenge each other to write competing sonnets on a common subject: Shelley, John Keats and Leigh Hunt wrote competing sonnets about the Nile around the same time. Shelley and Smith both chose a passage from the writings of the Greek historian Diodorus Siculus  in Bibliotheca historica, which described a massive Egyptian statue and quoted its inscription: \"King of Kings Ozymandias am I. If any want to know how great I am and where I lie, let him outdo me in my work.\" In Shelley's poem, Diodorus becomes \"a traveller from an antique land.\"See footnote 10 at the following source, for reference to the Loeb Classical Library translation of this inscription, by C.H. Oldfather: http://rpo.library.utoronto.ca/poems/ozymandias, accessed 12 April 2014.See section/verse 1.47.4 at the following presentation of the 1933 version of the Loeb Classics translation, which also matches the translation appearing here:  http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Diodorus_Siculus/1C*.html, accessed 12 April 2014.For the original Greek, see:  At the Perseus Project."]}, {"page": "October 19", "response": ["*1784 – Leigh Hunt, English poet and critic (d. 1859)"]}, {"page": "1859", "response": ["** Leigh Hunt, British critic, essayist (b. 1784)"]}, {"page": "1784", "response": ["** Leigh Hunt, British critic, essayist (d. 1859)"]}, {"page": "Edmund Blunden", "response": ["Blunden's next book of poems, The Shepherd, published in 1922 won the Hawthornden Prize, but his poetry, though well reviewed, did not provide enough to live on. In 1924, he accepted the post of Professor of English at the University of Tokyo. In December 1925, he dedicated a poem « UP!UP! » to the rugby men of the University and this became the anthem of the Tokyo University RFC. He returned to England in 1927, and was literary editor of the Nation for a year. In 1927, he published a short book, On the Poems of Henry Vaughan, Characteristics and Intimations, with his principal Latin poems carefully translated into English verse (London: H. Cobden-Sanderson, 1927), expanding and revising an essay that he had published, in November 1926, in the London Mercury. In 1931, he returned to Oxford as a Fellow of Merton College, where he was highly regarded as a tutor. During his years in Oxford, Blunden published extensively: several collections of poetry including Choice or Chance (1934) and Shells by a Stream (1944), prose works on Charles Lamb; Edward Gibbon; Leigh Hunt; Percy Bysshe Shelley (Shelley: A Life Story); John Taylor; and Thomas Hardy; and a book about a game he loved, Cricket Country (1944). He returned to full-time writing in 1944, becoming assistant editor of The Times Literary Supplement. In 1947, he returned to Japan as a member of the British liaison mission in Tokyo. In 1953, after three years back in England he accepted the post of Professor of English Literature at the University of Hong Kong.", "His books of poetry included Poems 1913 and 1914 (1914); Poems Translated from the French (1914); Three Poems (1916); The Barn (1916); The Silver Bird of Herndyke Mill; Stane Street; The Gods of the World Beneath, (1916); The Harbingers (1916); Pastorals (1916); The Waggoner and Other Poems (1920); The Shepherd, and Other Poems of Peace and War (1922); Old Homes (1922); To Nature: New Poems (1923); Dead Letters (1923); Masks of Time: A New Collection of Poems Principally Meditative (1925); Japanese Garland (1928); Retreat (1928); Winter Nights: A Reminiscence (1928); Near and Far: New Poems (1929); A Summer's Fancy (1930); To Themis: Poems on Famous Trials (1931); Constantia and Francis: An Autumn Evening, (1931); Halfway House: A Miscellany of New Poems, (1932); Choice or Chance: New Poems (1934); Verses: To H. R. H. The Duke of Windsor, (1936); An Elegy and Other Poems (1937); On Several Occasions (1938); Poems, 1930–1940 (1940); Shells by a Stream (1944); After the Bombing, and Other Short Poems (1949); Eastward: A Selection of Verses Original and Translated (1950); Records of Friendship (1950); A Hong Kong House (1959); Poems on Japan (1967); as well as biographical books on romantic figures: Leigh Hunt's 'Examiner' Examined (1928); Leigh Hunt. A Biography (1930); Charles Lamb and his Contemporaries (1933); Edward Gibbon and his Age (1935); Keat's Publisher. A Memoir (1936); Thomas Hardy (1941); and Shelley. A Life Story (1946) with strong evidence on pp. 278 and 290 that Shelley was murdered."]}]}}