{"wiki_id": "http://www.wikidata.org/entity/Q6552872", "itemLabel": "Lindsey Coulson", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Lindsey_Coulson", "wikipedia_page": {"main": "Lindsey Coulson (born June 1960) is an English actress, known for her role as Carol Jackson in the BBC soap opera EastEnders. For this role, she won the 2000 British Soap Award for Best Dramatic Performance. Coulson is also well known for her roles in Clocking Off (2001), Murder Investigation Team (2003–2005), The Street (2006), as Sarah Tanner in Bulletproof (2018–2021) and as Penny Armstrong in The Bay  (2019–2021). She has appeared in the films AKA (2003) and Funny Cow (2017).", "link_mentions": [{"page": "Coulson", "response": ["*Lindsey Coulson (born 1960), British actress"]}, {"page": "Patsy Palmer", "response": ["Palmer is close friends with Sid Owen (Ricky Butcher) and Danniella Westbrook (Sam Mitchell).EastEnders – Interview – Patsy Palmer and Sid Owen – Digital Spy Palmer has been married twice and has four children: Charley (born 1992) (from Palmer's relationship with boxer Alfie Rothwell), Fenton (born 2000), Emilia (born 2001), and Bertie (born 2010). For 10 years, starting in 2004, she lived with her husband and children in Western Terrace and then Kemptown, Brighton, England. Her brother, Harry Harris, is married to Lindsey Coulson, the actress who played her on-screen mother Carol Jackson in EastEnders. In April 2014, Palmer and most of her family moved to Malibu, California, near Los Angeles. Since then she made friends with the likes of Camille Grammer and Cindy Crawford while settling down."]}, {"page": "Ian Beale", "response": ["Ian is pessimistic when Lucy decides to set up her own property business and later becomes concerned about her when he discovers she is sleeping with Lee Carter (Danny-Boy Hatchard) and is taking cocaine. He confronts her and admits she is the child he is most proud of, but this is overheard by Peter, resulting in Lucy storming out. Ian tries to contact her when she does not return home that night, but is later informed by DC Emma Summerhayes (Anna Acton) and DS Cameron Bryant (Glen Wallace) that Lucy has been found dead. He identifies her body and then shares his devastating news with Jane, Denise, Cindy, Bobby and finally Peter. Struggling with their grief, Ian and Jane share a passionate encounter, giving Ian hope that they might reunite. When Jane dashes his hopes, Ian takes his anger out on Bobby and Jane decides it would be best if she take Bobby away for a while. Cindy also leaves the Square to return to Devon with her aunt, Gina Williams. Increasingly alone, Ian leans on Phil for support and questions how he can move on from his daughter's death. With Peter's help, he stages an opening for the new and improved restaurant, but during opening night Summerhayes reveals that Lucy's body has been released for burial. Ian leaves early with Peter to see her, but is unable due to his grief. He wants to organise the funeral for as soon as possible but discovers that Max and Lucy were together; Ian angrily attacks Max as he carries Lucy's coffin down the aisle of the church and it is clear that Ian is not coping. Worried, Sharon believes that he is relying on pills to numb the pain of his grief and she and Carol Jackson (Lindsey Coulson) comfort him."]}, {"page": "Pat Butcher", "response": ["Pat embarked on numerous relationships. She had flings with Den Watts (Leslie Grantham) and Kenny Beale (Michael Attwell)—both restless men, unwilling to settle down with her. Kenny's younger brother Pete (Peter Dean) proved more reliable; he married Pat when he thought she was pregnant by him—a false alarm which his mother Lou (Anna Wing) believed was Pat's ploy to trap her son. While they were together, Pat had two sons, David (Michael French) and Simon (Nick Berry), who Pete believed to be his. Yet Pat could not settle down and embarked on an affair with Brian Wicks (Leslie Schofield). Pete eventually left her and they divorced. Soon after, Pat married Brian and he took on responsibility of her two sons. They left Walford due to David's feud with fellow schoolboy Derek Branning (Terence Beesley; Jamie Foreman) - who terrorized the entire family because his sister Carol (Lindsey Coulson) had a relationship with David to the point where he got her pregnant. They moved to Romford and Pat stayed with Brian until 1986, when he started physically abusing her.EastEnders books, The EastEnders Handbook by Hilary Kingsley, ", "It was later confirmed that EastEnders would air a special tribute episode to Pat after her funeral episode on 13 January 2012. An EastEnders insider commented: \"Pat is EastEnders - she was the heart and soul of the show and bosses have pulled out all the stops for her funeral. Not only is the episode extra long, with plenty of nods to the iconic lady, it really is the end of the earring. We are hoping that everyone dons their biggest and tackiest earrings to mark one of the saddest days in the history of Walford.\" Co-star Lindsey Coulson said that Pat's departure was a \"real-loss\". She told This Morning: \"They were really difficult scenes to play, because we didn't want Pam to leave,\" Coulson explained. \"So apart from not wanting to lose the wonderful character of Pat, we were mourning the loss of Pam. \"You don't see everybody all the time [at EastEnders] at all, and sometimes you can go for months without seeing somebody. And most of the time you're on this big wheel and when people leave, you go, 'Oh, that's really sad', but you get back on. But actually Pam is a real loss up there.\""]}, {"page": "The Queen Victoria", "response": ["* 1999: Bianca Butcher (Patsy Palmer) and Dan Sullivan's (Craig Fairbrass) affair is blurted out by Carol Jackson (Lindsey Coulson) which results in Carol having an abortion and Bianca's departure."]}, {"page": "Clocking Off", "response": ["* Lindsey Coulson as Bev Aindow"]}, {"page": "Jim Branning", "response": ["Jim first appears when his daughter April is supposed to marry her fiancé Nikos (Yorgos Glastras). When Nikos jilts April at the altar, Jim's second daughter Carol (Lindsey Coulson) marries her boyfriend Alan Jackson (Howard Antony) instead. Jim is racist and therefore is against Carol marrying a black man. He storms out, refusing to give her away. Three years later, Carol visits him in Southend, and later that year, Jim moves to Walford following Reenie's death and it does not take him long to chase after an eligible widow on Albert Square, Dot Cotton (June Brown). She becomes his second wife, marrying him in 2002 after a proposal in the London Eye. After a mishap with viagra, Dot decides that their marriage should remain purely platonic. Jim also has to fight off attention from several spinsters, including Maureen Carter (Diana Coupland) and Doris Moisey (Marcia Ashton), the latter nearly causing the Brannings' separation."]}, {"page": "Sonia Fowler", "response": ["Sonia Fowler (also Jackson)\"Helpdesk\", BBC'.' Retrieved 3 March 2007. is a fictional character from the BBC soap opera, EastEnders, played by Natalie Cassidy. Her first appearance was on  and she departed on  She returned brieflyNatalie: I left over lesbian plot  MSN TV UK in 2010 along with other members of the Jackson family, and re-appeared in the soap from  and again in January 2011. Sonia returned as a permanent character on , as part of a storyline that saw her mother Carol (Lindsey Coulson) develop breast cancer. Cassidy took maternity leave in 2016 and Sonia left on 20 September 2016 for her dream job in Kettering. Cassidy made two guest stints during her maternity leave, on 25 December 2016 via webcam and for a three episode arc from 14 to 18 April 2017. She returned full-time on 27 June 2017. On 29 December 2020 it was announced that Cassidy took an extended break from the show with Sonia set to leave the square but returned in spring 2021. She departed on 8 January and returned on 16 April.", "Sonia and her family move to Albert Square. She is the third of Carol Jackson's (Lindsey Coulson) four children and the result of her mother's relationship with Terry Cant, whom Sonia never knew and who was violent towards Carol. During her childhood, she becomes close friends with Clare Tyler (Gemma Bissix) and the two are inseparable until Clare falls in with the wrong crowd at school and starts bullying Sonia but they reconcile before Clare leaves in 1998. Sonia has sex with Martin Fowler (James Alexandrou) but starts dating Jamie Mitchell (Jack Ryder). Not knowing she is pregnant, Sonia goes into labour and gives birth to Martin's daughter. Baby Chloe is subsequently given up for adoption and renamed Rebecca, despite protests from Martin's mother Pauline Fowler (Wendy Richard). However, Sonia becomes obsessed with her daughter and abducts her, locking herself in her house with the baby. Despite pleas from Rebecca's adoptive parents, it is Sonia's step-grandmother, Dot Cotton (June Brown), who persuades Sonia to return the baby.", "1994 was a \"historic\" year for EastEnders, as in April, a third weekly episode was introduced. Due to the programme's increased frequency, a number of new characters were introduced to the regular cast in the latter part of 1993 and early 1994. Among them were the Jackson family: mother Carol (Lindsey Coulson), her four children, Bianca (Patsy Palmer), Robbie (Dean Gaffney), Sonia (Natalie Cassidy), and Billie (Devon Anderson), as well as Carol's partner Alan Jackson (Howard Antony). Though Carol and Alan were not initially married in the serial, and though Alan was only the biological father of Billie, the whole family took on Alan's surname. The family was created by writer Tony McHale."]}, {"page": "Phil Mitchell", "response": ["To distract himself, Phil gets involved in a protection racket with Annie Palmer (Nadia Sawalha), who he is also having casual sex with, but grows tired of being bossed around by her and quits.  He starts seeing Lisa Shaw (Lucy Benjamin), but the relationship stalls when Kathy returns briefly in 1999 and sleeps with Grant. Before Kathy returns to South Africa, she asks Phil to go with her but he declines as Grant has planned an armed robbery and Phil refuses to let him do the job alone. Infuriated by Phil's loyalty to Grant, Kathy reveals their recent tryst, leading to Phil confronting Grant and Grant's confession that he slept with Kathy as revenge for Phil's affair with Sharon. While trying to escape, Phil pulls out a gun and shoots at the dashboard, causing Grant to crash into the River Thames. Phil is rescued, but Grant isn't found and is presumed dead. However, it is soon revealed that Grant is alive and he escapes to Brazil – though not before sending Phil and their mother Peggy (Barbara Windsor) the deeds for his half of The Queen Vic. Though Phil is entrusted by his mother to protect Grant's share of The Queen Vic, he ends up selling it to his business partner Dan Sullivan (Craig Fairbrass) for £5 to spite Peggy due to her favouritism towards Grant. By then, Phil and Dan have become best-friends; with Phil being the only person to defend Dan after the latter is revealed to have cheated on his girlfriend Carol Jackson (Lindsey Coulson) by having an affair with her daughter Bianca (Patsy Palmer), the wife of Frank's son Ricky (Sid Owen) – whom Phil has frequently clashed with overtime."]}, {"page": "Janine Butcher", "response": ["Janine's former stepbrother David Wicks (Michael French) suspects that Janine is guilty of the murder, so he manipulates her into allowing him to stay at her house, and then into admitting that she killed Michael. David promises to keep her secret, but has secretly recorded the confession on his phone. Meanwhile, Janine is planning to buy The Queen Vic, and sells her share of R&R and her car to do so. David then reveals the recording to Janine and blackmails her into giving him the £250,000 she has raised. Janine panics, and tries to kill David by hitting him with a car. However, he suffers only minor injuries. After she hands over the cash, he threatens to call the police anyway. She convinces him to give her a day to get away, but Carol Jackson (Lindsey Coulson) finds David's phone and plays the confession. She gives the phone to Joey, who calls the police and Janine is arrested for Michael's murder, and is dragged away by the police, sobbing hysterically."]}, {"page": "EastEnders theme tune", "response": ["| 57 || 30 May 2014 || David Wicks (Michael French) finally leaves Walford after his relationship with Carol Jackson (Lindsey Coulson) comes to an end, ending their love story.", "| 60 || 2 October 2015 || Carol Jackson (Lindsey Coulson) leaves Walford on a motorbike for a fresh start."]}, {"page": "David Wicks", "response": ["David Wicks is a fictional character from the BBC TV soap opera EastEnders, played by Michael French. David originally appeared from 23 December 1993 to 21 November 1996. He returned to the show on 1 January 2012 and departed two weeks later on 13th January. French returned to the role on 26th September 2013. David has been involved in various storylines, such as his troubled and dysfunctional reconciliation with his biological children Bianca Jackson (Patsy Palmer) and Joe Wicks (Paul Nicholls), —his volatile and equally dysfunctional relationship with his mother Pat Butcher (Pam St Clement), an affair with his sister-in-law Cindy Beale (Michelle Collins), reuniting with Carol Jackson (Lindsey Coulson) and struggling to cope with her diagnosis of breast cancer. On 17 May 2014, it was announced that French had once again decided to leave the show. David last appeared on 30 May 2014, after his relationship with Carol broke down.", "During his teenage years, David got his girlfriend Carol Branning (Lindsey Coulson) pregnant at the age of 14. David and the rest of the Branning family tried to persuade Carol to have an abortion and Carol's brother Derek Branning (Terence Beesley, later Jamie Foreman) severely beat David up. The Wicks family left Walford, due to Derek's aggression so David never knew if Carol had the abortion or not. For the next few years, David, his mother and brother, suffered at the violent hands of his abusive stepfather, Brian. Pat also proved to be a negligent mother due to her alcoholism and constant promiscuity. In 1979, the 17-year-old David moved to live with his girlfriend, Lorraine Foster (Jacqueline Leonard), and she quickly becomes pregnant. They married in a quick wedding ceremony, before the birth of their son Joe (Paul Nicholls) in 1980, when David was 18. This was followed by a daughter, Karen, in 1982. David was a restless man, feeling tied down and after several affairs, he left his wife and children in 1988.", " French returned to EastEnders as David Wicks in 2012 after more than 15 years away for the departure of Pam St Clement, who played his on-screen mother, Pat Butcher. His return was aired on New Year's Day 2012 and he again departed the soap on 13 January 2012. In All About Soap Awards 2012, Michael French won the Best Comeback award for his brief return as David Wicks. David and Carol reconcile. Coulson explained \"Carol thinks, 'Why not?' David makes her feel good and she's not thinking very far ahead. She's in the moment. It's not just a sex thing, it's about having somebody love her again.\"Daniel Kilkelly (6 January 2012) \"'EastEnders' Lindsey Coulson ponders Carol, David plot future. Digital Spy. Retrieved 26 October 2012. She continued: \"Carol will be very brittle if she loses David after this. She'll put up all her defences and think, 'That's it - nobody is going to destroy me again'.\" However, David tries to make peace with Derek but it fails and the plan backfires.Kilkelly Daniel (10 January 2012) \"POTD: 'EastEnders' David plan backfires. Digital Spy. Retrieved 23 October 2012."]}, {"page": "Jane Beale", "response": ["The Beales discover the police have a new suspect for Lucy's murder: Ben (now played by Harry Reid). Jane brings Lucy's effects up from under the floorboards, telling Ian she kept them as security, and she is seemingly happy to allow Ben to take the blame. Ian tells her to put the items back; she does so but they go missing, as Bobby has overheard the conversation, and he takes them to the police station. Phil prevents Bobby from turning in the evidence but it is clear that Jane is not coping, as she begins to behave erratically, suggests that the Beales flee Walford and ultimately confesses the truth to family friend Sharon Mitchell (Letitia Dean), who has found out after watching Cindy's video message meant for Bobby. Ian pleads with Sharon and she agrees not to tell the truth. Max is arrested and charged for Lucy's murder, leaving Jane racked with guilt. Ian and Bobby leave Walford on the eve of Max's trial, without telling Jane, who is distraught. Seeing Sharon comforting Jane, Phil works out that Jane knows Max is innocent, and confronts her. She admits she is covering for Bobby, and he decides to keep quiet, as Jane promises that she will keep Ben well out of this. She meets with Max's lawyer Marcus Christie (Stephen Churchett) and together they fabricate an alibi for Max on the night Lucy was killed, as she claims she had sex with him after turning to him for advice about Lucy. However, both the prosecution and her neighbours, including Max's sister Carol Jackson (Lindsey Coulson), are sceptical of her story."]}, {"page": "List of former EastEnders characters", "response": ["|Carol Jackson || Lindsey Coulson || 1993–1997, 1999, 2010–2015"]}, {"page": "Robbie Jackson", "response": ["Robbie Jackson is a fictional character from the BBC soap opera EastEnders, played by Dean Gaffney. The character was introduced in 1993, but axed in 2003 by executive producer Louise Berridge. He made brief returns in 2004 and 2010 for two family weddings and again on 22 September 2015 to tie in with the exit of his on-screen mother, Carol Jackson (Lindsey Coulson) on 2 October 2015. The character's reintroduction was announced on 17 April 2017 and he returned permanently on 26 June 2017. The character left the series on 19 September 2019, which was confirmed as a permanent departure the following month due to concerns over Gaffney's off-set behaviour.", "Robbie arrives in Albert Square in 1993 with the rest of the Jackson family: mother Carol Jackson (Lindsey Coulson), her partner Alan Jackson (Howard Antony), and his half-siblings, Bianca Jackson (Patsy Palmer), Sonia Jackson (Natalie Cassidy) and Billie Jackson (Devon Anderson). Initially a troublesome teen, Robbie has little success at school and is frequently in trouble for his behaviour, along with his friend Kevin (John Pickard). In November 1994, the pair find a dog which Robbie names Wellard. Robbie manages to persuade the dog's owner to relinquish care to him, after he discovers that Wellard was being neglected, and Wellard then becomes Robbie's pet. As he ages, Robbie becomes more responsible, but has little success in anything he chooses to do. He has several careers in Albert Square including radio control for the Evans' mini cab company, a job as manager in the local video rental store, and is hoping to return to the video shop ", "1994 was a \"historic\" year for EastEnders, as in April, a third weekly episode was introduced. Due to the programme's increased frequency, a number of new characters were introduced to the regular cast in the latter part of 1993 and early 1994. Among them were the Jackson family: mother Carol (Lindsey Coulson), her four children, Bianca (Patsy Palmer), Robbie (Dean Gaffney), Sonia (Natalie Cassidy), and Billie (Devon Anderson), as well as Carol's partner Alan Jackson (Howard Antony). Though Carol and Alan were not initially married in the serial, and though Alan was only the biological father of Billie, the whole family took on Alan's surname."]}, {"page": "Liam Butcher", "response": ["Liam returns to Walford with his mother and siblings, Tiffany Dean (Maisie Smith), Morgan Jackson-King (Devon Higgs) and Whitney Dean (Shona McGarty), in April 2008 after they are evicted by their landlord. He and his siblings spend a week in care due to the police finding them homeless and Bianca assaulting a police officer, Liam settles back in Walford, living with Bianca, Ricky and his great-grandmother Pat Evans (Pam St. Clement). Later that year, Liam begins skipping school, feigning illness and it is subsequently revealed that he is dyslexic, explaining his inferior grades and repeated absences. Ricky takes an active role in Liam's schooling, helping to improve his grades. With secondary school approaching, Liam is denied a place at Walford High and is offered a place at King Edward V, which Bianca and Ricky think is too far away. Their appeal is unsuccessful so Bianca decides to homeschool Liam instead. However, when Bianca and her mother Carol (Lindsey Coulson) argue, Liam says he will go to King Edward V and will work hard. However, before he starts there, he worries that none of his old friends will be there and sneaks out to the park, where Carol's date Lewis Daley (Deka Walmsley) gives him encouragement and tells him that life is never easy.", "Palmer and Lindsey Coulson, who portrays Liam's grandmother Carol Jackson, took a break from the series for six months in 2012. Producers wrote out Liam, Tiffany and Morgan in conjunction with their break. They departed in April 2012."]}, {"page": "The British Soap Awards", "response": ["| \"Best Dramatic Performance\" || Lindsey Coulson (Carol Jackson in EastEnders)", "| \"Best Dramatic Performance\" || Jane Danson (Leanne Battersby in Coronation Street) || Lindsey Coulson (Carol Jackson in EastEnders)Danny Miller (Aaron Livesy in Emmerdale)Claire Cooper (Jacqui McQueen in Hollyoaks)", "| \"Best Actress\"Presented by Colin Salmon|| Julie Hesmondhalgh (Hayley Cropper in Coronation Street) || Lacey Turner (Stacey Branning in EastEnders)Lindsey Coulson (Carol Jackson in EastEnders)Stephanie Davis (Sinead Roscoe in Hollyoaks)Nikki Sanderson (Maxine Minniver in Hollyoaks)", "| \"Best Dramatic Performance\"Presented by Lesley Nicol and Roger Allam|| David Neilson (Roy Cropper in Coronation Street) || Chris Walker (Rob Hollins in Doctors)Lindsey Coulson (Carol Jackson in EastEnders)Charley Webb (Debbie Dingle in Emmerdale)Stephanie Davis (Sinead Roscoe in Hollyoaks)"]}, {"page": "Ricky Butcher", "response": ["Despite a one-night stand with Mandy Salter (Nicola Stapleton) in January 1994, Ricky does not enter into another serious relationship until August, when he begins dating Bianca Jackson (Patsy Palmer). They move in together, but when Bianca begins to treat Ricky badly, he begins an affair with her best friend Natalie Price (Lucy Speed), in 1995. Natalie falls in love with Ricky and sets it up so that Bianca catches them kissing. Furious, Bianca finishes with Ricky, cutting up all his clothes and, after Ricky rejects Natalie, she flees Walford. Bianca eventually forgives Ricky and they reunite. Bianca strays with Lenny Wallace (Des Coleman), but immediately realises her mistake and marries Ricky on 17 April 1997. Later that year Bianca falls pregnant, but a prenatal scan reveals her unborn baby has both spina bifida and hydrocephalus; the Butchers decide to terminate the pregnancy. The trauma devastates them both, but it does bring them closer and in September 1998 Bianca discovers she has fallen pregnant again, resulting in her prematurely giving birth to their son Liam on Christmas Day 1998. The following year, Ricky becomes acquainted with Bianca's mother Carol Jackson (Lindsey Coulson) and her boyfriend Dan Sullivan (Craig Fairbrass). He quickly gets along with the pair, but this changes when Carol tells him that Bianca and Dan have embarked on an affair - as the pair had previously had a relationship prior to Dan falling in love with Carol. When the affair becomes public knowledge, the Butchers' marriage ends and Bianca departs with Liam for Manchester. Ricky, devastated by his marriage breakdown, begins to clash with Dan when the latter taunts him - as well as becoming unhappy with his own life and work. This escalates when Ricky learns that Phil has recently befriended Dan, who later tells Ricky that Phil and Frank have been working together on a motor scam. In response, Ricky confronts Phil and the two have an argument as Ricky attempts to leave Walford. Phil apologizes to Ricky for hurting him and promises that he'll deal with Dan for him. Ricky initially agrees to return to Walford, but secretly leaves without Phil's consent."]}, {"page": "Max Branning", "response": ["Max is stunned when Stacey's cousin, Kat Moon (Jessie Wallace), spots Stacey from a bus in London. He helps track Stacey down, but decides he cannot be involved when he realises he may still have feelings for Stacey. Stacey later turns to Max for help, but they end up in a passionate kiss, and Stacey later leaves Walford with Lily to stay with her mother Jean. Max later starts a sexual relationship with his daughter Lauren's best friend, Lucy Beale (Hetti Bywater), which they manage to keep a secret for several weeks. Somebody eventually finds out about Max and Lucy's affair, and e-mails him an image of the pair kissing. Max confronts Lucy, believing it is her trying to blackmail him, but it is revealed it is not. Eventually, Lucy ends her affair with Max due to her new relationship with Lee Carter (Danny-Boy Hatchard), which infuriates Max. A physical struggle ensues, which ends when Lucy falls over and hits her head on a chair. Max and Lucy have an explosive argument outside of the car lot, which sees Max grab Lucy violently by her arm. Later that night, Lucy is murdered by an unknown assailant (see Who Killed Lucy Beale?). Max becomes prime suspect after the police discover that Lucy was having an affair, and Max reveals all to David Wicks (Michael French). David initially tries to encourage Max to confess to the Beales and the police, but he refuses, and David threatens to tell the police everything. After Max's sister Carol Jackson (Lindsey Coulson) collapses and is rushed to hospital, David realises he must protect Max for her so gets rid of all of the evidence of Max and Lucy's fight."]}, {"page": "Dan Sullivan (EastEnders)", "response": ["The character originally appeared in Albert Square as the new boyfriend of local resident Carol Jackson (Lindsey Coulson), but it quickly transpired that Dan had previously had a relationship with her daughter Bianca (Patsy Palmer); he soon embarked on an affair with Bianca until her mother eventually found out about it and Carol thereupon exposed this to Bianca's husband Ricky Butcher (Sid Owen) — which later resulted in the latter being written out of the programme alongside both Bianca and Carol. Soon afterwards, Dan established an intense feud with Ricky's stepbrother Phil Mitchell (Steve McFadden); they started out as best-friends when Phil's brother Grant (Ross Kemp) left the square and even went into business partnership at The Queen Victoria public house, but ended up becoming archenemies after Phil conned Dan's ownership of the pub in retribution for Dan reporting Phil to the police about his motor scam with both Ricky's father Frank (Mike Reid) and his longtime companion Roy Evans (Tony Caunter). The ensuing rivalry between Dan and Phil continued to escalate in one of the show's greatest and most memorable storylines in soap history, Who Shot Phil?; wherein Dan becomes a prime suspect after Phil gets shot on the night their ex-lover Mel Healy (Tamzin Outhwaite) married the duo's fellow nemesis Steve Owen (Martin Kemp).", "Dan Sullivan arrives in Walford — a fictionalized borough in East London — on 7 June 1999, appearing as the latest boyfriend of local café manager Carol Jackson (Lindsey Coulson). They soon move to Walford's local community, Albert Square, where the couple plan to get married after Dan learns that Carol is expecting his child. Their wedding plans surprise Carol's daughter Bianca (Patsy Palmer), as she and Dan had a fling when she was a teenager on holiday many years before. After the pair find themselves secretly reacquainted with each other, Dan and Bianca start an affair — even though she is married to local resident Ricky Butcher (Sid Owen), who ends up befriending Dan. Eventually, Carol discovers the affair and publicly exposes it in front of Ricky and their neighbors. She then disowns Bianca, breaks-up with Dan by chucking him out of her house, and later aborts their child before leaving Walford. Bianca subsequently departs the square after she and Dan are unable to resume their relationship. Shortly afterwards, Dan and Ricky begin to clash after Ricky blames Dan for ruining his life and marriage with Bianca. The hostility between them escalates when Dan begins to flirt with Ricky's sister Janine (Charlie Brooks), which promptly sparks a conflict between the siblings' father Frank (Mike Reid) and Dan himself. One such incident between them involves Frank punching Dan for making remarks on how he brought up his children. This eventually becomes too much for Ricky, who ends up leaving the square in April 2000.", "Dan was introduced as a new love interest for the returning Carol Jackson (Lindsey Coulson), following her separation from her husband, Alan Jackson (Howard Antony)."]}, {"page": "AKA (film)", "response": ["* Lindsey Coulson as Georgie"]}, {"page": "Bianca Jackson", "response": ["Bianca Jackson first arrived with her family; including mother Carol Jackson (Lindsey Coulson), her love interest Alan Jackson (Howard Antony), and Bianca's three half-siblings Robbie Jackson (Dean Gaffney), Sonia Jackson (Natalie Cassidy) and Billie Jackson (Devon Anderson).  She initially works at her uncle Ian Beale's (Adam Woodyatt) fish and chip shop before becoming the market assistant of Sanjay Kapoor (Deepak Verma). Later she runs her own clothing stall on Bridge Street market. Bianca has a short relationship with an older man, Richard Cole (Ian Reddington), but he swiftly dumps her when he grows bored and Bianca gets revenge by harassing him with pranks and stealing his credit card. David Wicks (Michael French) then enjoys mutual flirtation with Bianca until Carol informs David that Bianca is his daughter. Horrified, David promptly keeps his distance, and Bianca remains unaware of their biological relationship. Bianca enters into a relationship with Ricky Butcher (Sid Owen) and they move into a bedsit together. Bianca spends much time clubbing with her childhood friend Tiffany Raymond (Martine McCutcheon) and Ricky starts an affair with Bianca's other childhood friend Natalie Price (Lucy Speed). When Bianca discovers the affair, she breaks up with Ricky and drives Natalie from Walford. One night an intoxicated Bianca is nearly assaulted. She is rescued by David and when she tries to kiss him, he confesses that he is her father. Bianca is left stunned and humiliated. Initially she feels hostile and resentful over David's absence for the majority of her life. Eventually, Bianca has a change of heart and comes to accept David as her father, becoming keen to bond with him. The relationship is further complicated, when during July 1995 David confides in the Samaritans charity (unbeknownst to any of his family) that he still feels sexually attracted to Bianca despite the knowledge that he is her biological father. A case of GSA, this was one of EastEnders most controversial and daring storylines at this point in the show's history. There is further tension when Bianca makes David uncomfortable by reconciling with and dating his stepbrother Ricky again. Bianca is confused by David's unexplained strange and occasionally hostile behaviour. David never admits to Bianca the truth behind his initial feelings towards her, but she and David eventually bond naturally as a father and daughter.", "In his book EastEnders: The First 10 Years: A Celebration, EastEnders scriptwriter Colin Brake describes 1994 as a \"historic\" year for EastEnders, as in April, a third weekly episode was introduced. Due to the programme's increased frequency, a number of new characters were introduced to the regular cast in the latter part of 1993 and early 1994. Among them were the Jackson family, created by Tony McHale: mother Carol (Lindsey Coulson), her four children, Bianca (Patsy Palmer), Robbie (Dean Gaffney), Sonia (Natalie Cassidy), and Billie (Devon Anderson), as well as Carol's partner Alan Jackson (Howard Antony). Though Carol and Alan were not initially married in the serial, and though Alan was only the biological father of Billie, the whole family took on Alan's surname. It later transpired that David Wicks (Michael French) was Bianca's father.", "Bianca's exit storyline revolved on an extramarital affair with her mother's new boyfriend Dan Sullivan (Craig Fairbrass). Lindsey Coulson, who played Bianca's mother Carol, returned to the serial especially to facilitate Palmer's exit. Carol had last been seen on-screen in 1997. When the affair was uncovered, Bianca was disowned by Carol, and her marriage to Ricky ended after Carol forced her to confess the affair to him too. Bianca's exit week was spread out over five episodes, beginning with an hour-long special on Sunday 5 September 1999 (at the time the typical weekly broadcast was 3 episodes a week). Mal Young, BBC's Controller of Continuing Drama Series, described the revelatory hour-long Bianca special as a Play For Today, and Kathryn Flett of The Guardian described the week's episodes as a \"bravura, edge-of-the-sofa, five-night performance\". Commenting on her exit in 1999, Palmer said, \"It was really sad. We were all crying our eyes out – the crew as well as the cast. The tears you see on screen are real.\""]}, {"page": "Joe Wicks (EastEnders)", "response": ["While in Walford, Joe gets engaged to Sarah Hills (Daniela Denby-Ashe) but has a one-night stand with his second cousin, Mary Flaherty (Melanie Clark Pullen). This makes him realise that he is too young to get married, so he calls off the engagement. He and his mother, Lorraine, leave in 1997, returning to Bolton although Joe reportedly reconciles with Sarah many years later. In 2012, when David visits his  mother, Pat (Pam St. Clement), he tells her that Joe has a girlfriend who has children and that he stayed with them for a while but it did not work out. However, when David is arguing with Carol Jackson (Lindsey Coulson), it is revealed that Joe and David have lost contact and he has no address for his son."]}, {"page": "Carol Jackson", "response": ["Carol Jackson  is a fictional character from the BBC soap opera EastEnders, played by Lindsey Coulson. The character was introduced in 1993 as the mother of the Jackson family. Coulson decided to quit the role in 1997, but she returned temporarily in 1999 within a storyline that contributed to both the introduction of her boyfriend Dan Sullivan (Craig Fairbrass) and the departure of her daughter Bianca (Patsy Palmer); in the storyline, Carol discovers that Bianca had previously had a relationship with Dan and they resumed their affair - which prompted her to end her relationship with Dan, disown Bianca, and leave the square on her own.", "1994 was a historic year for EastEnders, as in April, a third weekly episode was introduced. Due to the programme's increased frequency, a number of new characters were introduced to the regular cast in the latter part of 1993 and early 1994. Among them were the Jackson family: mother Carol (Lindsey Coulson), her four children, Bianca (Patsy Palmer), Robbie (Dean Gaffney), Sonia (Natalie Cassidy), and Billie (Devon Anderson), as well as Carol's partner Alan Jackson (Howard Antony). Though Carol and Alan were not initially married in the serial, and though Alan was only the biological father of Billie, the whole family took on Alan's surname. The family was created by writer Tony McHale. None of the actors cast as the Jackson family were matched for appearance or screen compatibility. Cassidy has commented, \"it was all decided without doing that. I don't think it particularly mattered that none of us Jackson kids looked like each other because all our characters had different dads!\" Carol was Coulson's first major television role.", "On 24 November 2013, it was announced that EastEnders would feature breast cancer in December, with Carol finding a lump in her breast. Carol's daughter Sonia will return as the storyline begins. Coulson said, \"This is a very important storyline as breast cancer is something that affects so many people. Through Carol's story I hope we can raise awareness of the impact of breast cancer on the people that have it and their families.\" Executive producer Dominic Treadwell-Collins said: \"EastEnders has a long tradition of dealing with social issues and breast cancer is one that the majority of people have been affected by in some way. And this is not just a story about breast cancer. This is a story about women, about mothers and daughters, and ultimately about family. And with Lindsey Coulson, Michael French, Patsy Palmer and Natalie Cassidy giving powerhouse performances at its centre, this is a storyline that will inform, move, and shake up the audience as it shakes up the Jackson family.\" Producers worked with charities such as Macmillan Cancer Support, whose Head of Health and Social Care, Jacqui Graves, congratulated the show \"for helping to raise awareness of the condition.\"", "In March 1995, a reporter from Inside Soap said \"The Square's toughest mum, and David's ex-girlfriend Carol Jackson, has got a few secrets of her own, considering she's had four children by four different men.\" They predicted that it would not be long before Carol's past caught up with her. In July 2015, Gary Gillatt of Inside Soap praised Coulson's acting as Carol came to terms with her mental and physical scars following her mastectomy, \"Wasn't Lindsey Coulson amazing in EastEnders this week? The script was uncompromising, the acting first rate. Bravo EastEnders!\""]}, {"page": "Blossom Jackson", "response": ["On screen, she comes to live with Alan and his common-law wife Carol (Lindsey Coulson) at number 25 Albert Square in 1994 after her flat in Wapping is burgled. Blossom is great-grandmother to Billie Jackson (Devon Anderson) and although she is not blood-related to the other Jackson children, Bianca (Patsy Palmer), Robbie (Dean Gaffney) and Sonia (Natalie Cassidy), she loves them as if she were. Blossom is a great support to Carol during her time living in Albert Square, often providing a sympathetic ear when she needs a shoulder to cry on. She works in Kathy Beale's (Gillian Taylforth) café and has a brief romance with Walford lothario Jules Tavernier (Tommy Eytle), even moving in with him temporarily when the Jacksons' house is damaged in a gas explosion. However, their relationship does not progress into anything serious."]}, {"page": "Murder Investigation Team (TV series)", "response": ["Murder Investigation Team is a British police procedural drama/cop thriller series produced by the ITV network as a spin-off from the long-running series, The Bill. The series recounts the activities of the Metropolitan Police's Murder Investigation Team, who are led by D.I. Vivien Friend (Samantha Spiro) and D.S. Rosie MacManus (Lindsey Coulson). The series, also starring Diane Parish and Michael McKell, produced 12 episodes between 2003 and 2005. In September 2005, The Sun reported that ITV would not be commissioning a third series.thebillbios.co.uk", "* Lindsey Coulson as Sergeant Rosie MacManus (series 1–2), an M.I.T. detective. MacManus has two children, and must balance work and family life. It is for this reason that she remained a D.C. for much of her career. Four months prior to the start of series 2, she is promoted to D.S. at the behest of newly appointed D.C.I. Wishart, who wants to rid M.I.T. of its \"old boy's network\" mentality. In series 1, she is partnered with D.I. Friend, while in series 2 she is assigned by Hands to oversee the work of Eva Sharpe. "]}, {"page": "Gianni di Marco", "response": ["By then, Gianni has found himself drawn in an ongoing feud between Beppe and his sworn enemy Grant Mitchell (Ross Kemp. This continues when Grant's brother Phil (Steve McFadden) gets involved in the conflict, whereupon the two groups of brothers appear to have a rivalry over several interests. At one point in The Queen Victoria public house, Gianni grows irritated when he finds Teresa romancing with Phil's best-friend Dan Sullivan (Craig Fairbrass) - not long after he was revealed to have cheated on his girlfriend Carol Jackson (Lindsey Coulson) with her daughter Bianca (Patsy Palmer); the mother-and-duo consequently left the square on their own alongside Bianca's beloved husband Ricky Butcher (Sid Owen). When Gianni confronts Dan to warn him in staying away from Teresa over threatening circumstances, Dan rebuffs him until Gianni throws a drink at him. The pair nearly brawl until Gianni is forced to leave the pub."]}, {"page": "Cindy Williams (EastEnders)", "response": ["When Ian and Jane leave for their honeymoon, they take Beth with them to allow Cindy some time to herself. Cindy continues to see Liam and confides in him that she misses her teenage life before she became a mother. After Ian and Jane return, Cindy is unable to bond properly with her daughter feels stressed. Cindy abandons Beth in the park but when she returns to collect her, Beth is not there. A panicked Cindy later finds her with Liam, and fearing that she will be unable to be a good mother, decides to put her up for adoption. When Ian and Jane suggest they adopt Beth, Cindy threatens to leave. After Ian admits that he is using Beth as a distraction from all the pain he endured in losing Lucy, Cindy changes her mind and realises that she does not want Beth to be adopted by strangers. Wanting her daughter to grow up with her family, she agrees to let the Beales adopt Beth. She soon has second thoughts about the decision, worried that she might still be responsible for Beth and that living in the same house as her will remind her of her failure as a mother. Soon, she gives the Beales an ultimatum: either they let her give Beth up or she will tell everyone that Bobby killed Lucy. When Ian confronts her about her ultimatum the next day, Jane decides to have Beth live with TJ but regrets it at the same time. When Cindy tries to make things better for them, Ian declares that it will not work and forces her to leave. After learning that Cindy has spent the night at Liam's house, Jane goes there to apologise to her on Ian's behalf, but Liam explains that Cindy has left Walford to stay with friends in Devon and may not be coming back. Two weeks later, Liam's grandmother, Carol Jackson (Lindsey Coulson), discovers that Cindy is sleeping underneath Liam's bed. When she refuses to go back to the Beales' house, Carol lets her stay after Jane secretly pays her. Ian accidentally tells Cindy this on the night of her prom. Feeling unwanted, she goes to a bar and asks two older men to buy her drinks. She ignores Liam's warnings and gets into a car with them, but when she decides to leave, they refuse to let her. She returns later and tells Jane how she managed to escape; the men did not harm her. She contemplates leaving Walford for good due to feeling nobody wants her, but Liam convinces her to go home and reunite with her family.", "After Carol Jackson (Lindsey Coulson) discovers an abandoned pregnancy test in January 2014, she was seen to inquire with family members - possible owners included Carol's daughter Bianca (Patsy Palmer) and Peter's ex-girlfriend Lauren Branning (Jacqueline Jossa). A week later, the test was revealed to belong to Cindy when she was seen to go for an abortion. She had fallen pregnant with TJ Spraggan's baby after a one-night stand, but afterwards decided to keep the baby, before the truth was revealed to their two families. The storyline subsequently received minor negativity from fans, with the Metro's Amy Duncan revealing that some viewers were outraged by what had been deemed as a \"gross underage pregnancy storyline\". Several EastEnders fans then commented on Twitter to voice their displeasure over the episodes: one said they \"[couldn't] be arsed with Cindy being pregnant in Eastenders [...] She has a 5 min cameo every month how is she gonna cope with this storyline?\", whilst another felt that the storyline was \"just promoting underage pregnancies tbh\" rather than actually raising awareness about the issue. Despite this, Keene went on to be nominated in 2014 in the category of \"Best Young Performance\" at the British Soap Awards for her portrayal of Cindy, but lost to Hollyoaks child actor Ellis Hollins. Anna Howell of Unreality TV praised Keene's birth scenes in an article on who they thought had given the best performances of 2014, with Cindy giving birth to baby Beth rated third on their list for EastEnders. Howell branded Keene's performance as \"one of the most powerful, and convincing labour scenes [Unreality TV] have ever seen\", and stated that whilst many women had portrayed childbirth in the soaps over the years, given Keene's age and limited experience in soap acting, felt it was worth \"a massive mention at just how well this young girl handled something quite as dramatic as the birth of her on-screen daughter.\""]}, {"page": "Abi Branning", "response": ["After her break up with Jay, Abi becomes a much nastier and bitter person. She begins a relationship with Ben (now played by Harry Reid), which is discovered by Emma Summerhayes (Anna Acton) who informs Max of the relationship. Max demands that Abi does not see Ben any more, which Abi refuses to do. Abi later discovers that Max used Ben to sign over part of Phil's businesses to him. In February 2015, Abi is accused by Max of killing Lucy. Abi did not kill Lucy, but it is revealed that on the night Lucy died, Abi had a confrontation with Lucy about her affair with Max, which resulted in Abi slapping Lucy. After Max tells her that Tanya would like her to move to Devon with her, Abi refuses and instead moves in with Ben and his family. and Abi believes she finally has a stable home life. After she moves in, Ben reveals to her that he might still be gay and is worried he will never get over his homosexuality but Abi assures him that they will make things work. She continuously mocks Jay and accuses him of being jealous of her relationship with Ben. Jay tries to make Abi see that Ben is not interested in her, but she pretends not to care about what Jay says. Abi discovers a letter from Sharon's birth mother and Sharon says that she intends on meeting her birth father after discovering that her mother has died. When Paul Coker (Jonny Labey) arrives in Walford, Abi suspects Ben of cheating on her with Paul. She and Ben have sex, so Ben can convince her he is not gay. Following Ben's arrest for Lucy's murder, Abi tells Phil that Max assaulted Lucy to get Ben off. Despite being innocent, Max turns himself in and is formally charged while Ben is released. Stacey visits Max, who tells her that he thinks Abi killed Lucy. Stacey confronts Abi, who attacks Stacey, blaming her for her parents' split and Bradley's death, and later vents to her aunt Carol Jackson (Lindsey Coulson) that she does not think Max cares about her. Carol visits Max in prison, where he informs her that the reason he thinks Abi killed Lucy is because she attacked and beat her on the night of the murder. After confronting Abi on this, Carol agrees that she has been out of control lately and advises her to call Tanya for moral support. During the phone call, Abi finds out that not only is Oscar ill, but Cora had apparently not stayed with Tanya at her house as she had earlier said. Abi, Carol and Jane Beale (Laurie Brett) find Cora living rough and bring her home. She reveals she saw Max and Abi cleaning the car lot after Lucy was killed, forcing Abi to admit that Max and Lucy had argued there and she was helping Max clean Lucy's blood. Abi then gives a statement to the police. Max is later found guilty of the murder."]}, {"page": "Lindsay Coulson", "response": ["#REDIRECT Lindsey Coulson"]}, {"page": "Alan Jackson (EastEnders)", "response": ["Alan was 20, single and a plumber when he met Carol Branning (Lindsey Coulson). He came to her council flat to unblock her sink and they started dating each other soon after. Carol had gone through a lifetime of struggle and heartache. In the past, the fathers of her three children, Bianca (Patsy Palmer), Robbie (Dean Gaffney) and Sonia (Natalie Cassidy), had all deserted her, but Alan was different and he stuck around, giving the family real stability. Soon he had added to her collection of children, fathering Billie (Devon Anderson) in 1988. Even though Alan and Carol were not married initially, the whole family took Alan's surname. They were later joined by Alan's grandmother, Blossom (Mona Hammond).", "1994 was a historic year for EastEnders, as in April, a third weekly episode was introduced. Due to the programme's increased frequency, a number of new characters were introduced to the regular cast in the latter part of 1993 and early 1994. Among them were the Jackson family: mother Carol Jackson (Lindsey Coulson), her four children, Bianca (Patsy Palmer), Robbie (Dean Gaffney), Sonia (Natalie Cassidy), and Billie (Devon Anderson), as well as Carol's partner Alan Jackson (Howard Antony). Though Carol and Alan were not initially married in the serial, and though Alan was only the biological father of Billie, the whole family took on Alan's surname. The family was created by writer Tony McHale. None of the actors cast as the Jackson family were matched for appearance or screen compatibility. Cassidy has commented, \"it was all decided without doing that. I don't think it particularly mattered that none of us Jackson kids looked like each other because all our characters had different dads!\"", "In 1997, Lindsey Coulson quit her role as Carol, and the majority of the Jackson clan were written out of the serial to facilitate her desire to leave. This was only temporary however, and many of the Jacksons returned shortly after. Antony opted not to re-new his contract. At the time it was reported that he had grown disillusioned with the storylines his character had been given, in particular an affair Alan had with home-wrecker Frankie Pierre (Syan Blake). Antony is quoted saying \"There are those above me who make decisions for my character and they're not always ones I like. There were certain aspects of the Frankie story I didn't like. I was frustrated with Alan taking so much nonsense. I thought 'Why are you investing time in Frankie when the woman you've been with for nine years [Carol] wants you back? As an actor it was a difficult pill to swallow. I've had a great time in EastEnders, but the future looks bright.\""]}, {"page": "Billie Jackson", "response": ["1994 was a \"historic\" year for EastEnders, as in April, a third weekly episode was introduced. Due to the programme's increased frequency, a number of new characters were introduced to the regular cast in the latter part of 1993 and early 1994. Among them were the Jackson family: mother Carol (Lindsey Coulson), her four children, Bianca (Patsy Palmer), Robbie (Dean Gaffney), Sonia (Natalie Cassidy), and Billy (Devon Anderson), as well as Carol's partner Alan Jackson (Howard Antony). Though Carol and Alan were not initially married in the serial, and though Alan was only the biological father of Billy, the whole family took on Alan's surname. The family was created by writer Tony McHale. None of the actors cast as the Jackson family were matched for appearance or screen compatibility. Cassidy has commented, \"it was all decided without doing that. I don't think it particularly mattered that none of us Jackson kids looked like each other because all our characters had different dads!\"", "In a 2000 book, author Kate Lock described Billy as \"angelic\" and a \"cheeky, curly-haired cherub whose principal dramatic function seemed to be to generate angst in the bosom of his family\". His most notable storyline in his initial stint was also his exit storyline. Following Lindsey Coulson's decision to quit her role as Carol, the Jackson family were written out of the soap in 1997. In the storyline, Billy was kidnapped after witnessing an armed robbery and the whole family was relocated under a witness protection programme until Billy testified in court."]}, {"page": "April Branning", "response": ["April Branning is a fictional character from the BBC soap opera EastEnders, played by Debbie Arnold. April is the eldest daughter of Jim (John Bardon) and Reenie Branning (Joy Graham). April  is originally introduced as the sister of established character Carol Jackson (Lindsey Coulson), and later Derek (Terence Beesley/Jamie Foreman), Suzy Branning (Julie Christian-Young/Maggie O'Neill), Max (Jake Wood) and Jack (Scott Maslen).", "The character of April Branning, played by Debbie Arnold, is introduced in December 1995 as the \"fun-loving\" sister of Carol Jackson (Lindsey Coulson). Her entrance storyline is part of a plot that leads to the marriage of Carol and her boyfriend Alan (Howard Antony) - when April is jilted at the altar, Carol and Alan marry in her place. The character was turned into a regular in 1996, moving to the soap's setting of Albert Square."]}, {"page": "Lauren Branning", "response": ["Lauren (now played by Jacqueline Jossa) returns from America earlier than expected, after being expelled from school for smoking cannabis. She reveals that she has a new boyfriend, Edward Brooks (Luke Striffler), but they split up because of the distance. Lauren attends her cousin Billie Jackson's (Devon Anderson) birthday party and as a present, she gives him alcohol and he is found dead of alcohol poisoning the next morning. Billie's mother, Carol (Lindsey Coulson) attacks Lauren, blaming her for encouraging Billie to drink. Lauren suspects that Max killed Archie after he tells her that Bradley was not the culprit and she notes his violent tendencies when he confronts Jay Brown (Jamie Borthwick) for making crude sexual remarks after she rejects his attempt to proposition her. Lauren confronts Max and he tells her that he is not the killer but knows who is; after seeing Max and Stacey together, Lauren realises that Stacey is the killer and tricks a confession out of her, which she records on her mobile phone. Lauren threatens to go the police, but agrees to keep quiet after discovering that Archie raped Stacey. However, on Christmas Day, Lauren hands Janine Butcher (Charlie Brooks) the recording and Stacey flees after Janine exposes her. Lauren develops a crush on Whitney's half-brother, Ryan Malloy (Neil McDermott), and they begin an affair. However, the relationship is threatened when Tanya finds out and the relationship ends when he flees after killing Rob Grayson (Jody Latham), who had been sexually exploiting Whitney for financial gain."]}, {"page": "The Stretford Wives", "response": ["The film revolves around the lives of three sisters – played by Fay Ripley, Claire Rushbrook, and Lindsey Coulson – who live in Stretford, Greater Manchester, England.", "* Lindsey Coulson as Lynda Massey Richards"]}, {"page": "Shirley Carter", "response": ["Shirley learns from Dean he has a seven-year-old daughter and confronts the child's mother, Shabnam Masood (Rakhee Thakrar), who continues to lie. Shirley is upset when Linda forbids her from seeing Ollie. Masood Ahmed (Nitin Ganatra) gives Shirley the address of Dean's daughter, verifying the child, Jade Green (Amaya Edward), previously Roya, is alive. Shirley finds Jade but discovers she has cystic fibrosis. After Dean decides that Jade is better off without him and Shirley warns that she will fight for custody, eventually gaining Shabnam and Dean's support. When Shirley finds a bra behind her settee, she assumes Buster had sex with Carol Jackson (Lindsey Coulson), which Carol does not deny. Shirley nearly throws Buster out and starts considering adopting Jade alone but Carol admits that nothing happened and Shirley helps her come to terms with her mastectomy. Shirley and Buster are awarded custody of Jade after a grieving Shabnam does not contest it. Shirley prevents Dean from raping Roxy Mitchell (Rita Simons) and, finally believing that he is a rapist, tries to drown him in the bath but he recovers and strikes her as Linda enters. Dean then admits that he raped Linda and goes into hiding. Dean confronts Shirley at Mick and Linda's wedding and attempts to drown her. Mick saves her and Dean, who is then arrested over Roxy. Shirley then encourages Mick and Linda to get married and helps Nancy and Lee run the pub while Mick and Linda are on their honeymoon and has Jade help out to give her some work experience. She is furious when Shabnam turns up overprotective of Jade outside of her visiting hours, but after Masood tells her that Shabnam is unlikely to have any more children, she grows sympathetic and allows Jade to spend more time with Shabnam."]}, {"page": "Mountview Academy of Theatre Arts", "response": ["*Lindsey Coulson"]}, {"page": "List of EastEnders two-hander episodes", "response": ["Sonia becomes inconsolable. Dot tries to reassure her that everything will be alright, she just needs some inner strength. Sonia becomes angry with Dot for living her life by the Bible and Dot is mortified as Sonia throws the holy book across the room. Sonia wonders why Dot was so willing to help her criminal son Nick Cotton (John Altman), but will not help her. Dot explains that she helped Nick because she had something to make up for; she had an abortion when she was 21 years old. Her husband Charlie Cotton (Christopher Hancock) had forced her to terminate the pregnancy against her wishes. Dot describes how guilty she felt after the abortion. She thought she had put it all behind her until the christening gown was found buried in the garden of Mark Fowler's (Todd Carty) house. She wishes she had kept the baby, and is now left feeling cold and empty. Sonia wonders whether she should have been a single mother like her own mother Carol Jackson (Lindsey Coulson). She relays that Carol is furious about the adoption, but Dot reassures her that Rebecca will have a good life with the Millers."]}, {"page": "The Eustace Bros.", "response": ["* Lindsey Coulson as Claire Eustace "]}, {"page": "List of Dalziel and Pascoe cast members", "response": ["*Lindsey Coulson"]}, {"page": "List of EastEnders characters (2007)", "response": ["Jack Branning, played by Scott Maslen, is the son of Jim Branning (John Bardon) and brother of Carol Jackson (Lindsey Coulson) and Max Branning (Jake Wood). Soon after his arrival in Walford Jack begins an on-off relationship with Ronnie Mitchell (Samantha Womack), but he betrays her by having sex with her sister Roxy (Rita Simons), and getting her pregnant. Jack also has a brief fling with Sam Mitchell (Danniella Westbrook), resulting in another baby. He goes on to reunite with Ronnie, however their child, James dies of sudden infant death syndrome. Jack then has a relationship with Sharon Rickman (Letitia Dean), but he jilts her moments before they are due to marry. Maslen departed from the show on 15 October 2013 after six years on the show, but later returned full time at Christmas 2015."]}, {"page": "Branning family", "response": ["The Branning family, together with the Jackson family are a fictional, extended family in the BBC soap opera EastEnders. Introduced in 1993 were the Jackson family, consisting of Carol Jackson (Lindsey Coulson), her partner (later husband) Alan Jackson (Howard Antony), and Carol's four children, Bianca Jackson (Patsy Palmer), Sonia Jackson (Natalie Cassidy), Robbie Jackson (Dean Gaffney), and Billie Jackson (Devon Anderson). Billie is the only child fathered by Alan, while Bianca is the daughter of David Wicks (Michael French), Sonia's father is Terry Cant (Brian Conley) and Robbie's is Gary Bolton (Bruce Byron). The family becomes a more dominating presence in the early 2000s, when Carol's father Jim Branning (John Bardon) moves to Walford following the death of his wife Reenie (Joy Graham) to cancer. Since then, all six of Jim's children have appeared, many of them with family.", "Carol, Sonia, Robbie and Billie returned in February 2010 for Bianca's second wedding to Ricky. The show's executive producer, Diederick Santer, described the wedding as \"the perfect opportunity\" to bring the characters back to the show. He told entertainment website Digital Spy: \"By the middle of February, the Branning-Jacksons become the biggest family on the Square. They're huge. Billie's an interesting character. He's a troubled soul, torn between being a good son to his mother and trying to have an exciting London life. And when your mother's Carol Jackson, that's quite a feat. I'm so pleased we have Lindsey Coulson back, too — she's such a fabulous actress.\""]}, {"page": "The Street (British TV series)", "response": ["* Lindsey Coulson as Ann Peterson"]}]}}