{"wiki_id": "http://www.wikidata.org/entity/Q6551892", "itemLabel": "Linda Perham", "itemDescription": "British politician (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Linda_Perham", "wikipedia_page": {"main": "Linda Perham (born 29 June 1947) is a Labour politician in the United Kingdom.", "link_mentions": [{"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Linda Perham", "| Linda Perham"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Linda Perham"]}, {"page": "Ilford North (UK Parliament constituency)", "response": ["|| 1997 || Linda Perham || Labour "]}, {"page": "Nimal Mendis", "response": ["The devastation of the 2004 tsunami moved Mendis, leading him to compose a song to aid the victims. This was recorded in Australia, Sri Lanka and the United Kingdom, and was commended by the British Parliament in early day motion 638, sponsored by MP Linda Perham."]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Ilford North || Lee Scott || Conservative || Linda Perham || Labour"]}, {"page": "Lee Scott (politician)", "response": ["In the 2005 general election, Scott gained the Ilford North seat, a key Conservative target that election, defeating the sitting Labour MP Linda Perham. He has a special interest in autism and presented a Private Member's Bill to Parliament dealing with the care of autistic children once they reached adulthood. He was a member of the select committee on transport and was on the select committee on health."]}, {"page": "2005 United Kingdom general election", "response": ["|Linda Perham"]}, {"page": "List of United Kingdom MPs: P", "response": ["*Linda Perham"]}, {"page": "Vivian Bendall", "response": ["At the 1997 general election Bendall was defeated in Ilford North by Labour candidate Linda Perham. He attempted to win the seat back at the 2001 general election, arranging for his picture to be taken with former Prime Minister Margaret Thatcher. Bendall told reporters that \"I have always been an admirer of Lady Thatcher. I intend to use the picture in a press release during the campaign. Other candidates are planning to use them in their addresses. She still plays well on the doorstep.\"David Hencke, \"Worried Tory candidates turn to Thatcher\", The Guardian, 9 March 2001, p. 1. However, Perham was re-elected with a majority reduced to 2,115. In August 2001, during the Conservative leadership election, Bendall's name headed a letter from seven former Conservative MPs expressing \"our concern for the unity and electability of the Conservative Party\" if Kenneth Clarke were to win, and endorsed Iain Duncan Smith.\"Implications of a Clarke victory\", The Times, 20 August 2001, p. 13."]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Linda Perham, Ilford North, 1997–2005"]}, {"page": "Perham", "response": ["* Linda Perham (born 1947), English politician"]}, {"page": "Blair Babe", "response": ["| 78. || Linda Perham || Ilford North || 1997 || 2005 || Lost seat to Conservative Lee Scott"]}, {"page": "List of MPs who lost their seat in the 1997 United Kingdom general election", "response": ["|Linda Perham"]}]}}