{"wiki_id": "http://www.wikidata.org/entity/Q6551404", "itemLabel": "Linda Bennett", "itemDescription": "English-Icelandic clothing designer and entrepreneur", "wikipedia_url": "https://en.wikipedia.org/wiki/Linda_Bennett", "wikipedia_page": {"main": "Linda Kristin Bennett  (born 8 September 1962) is an English clothing designer and entrepreneur, best known for founding the fashion retailer L.K.Bennett.", "link_mentions": [{"page": "List of fashion designers", "response": ["* Linda Bennett"]}, {"page": "Haberdashers' School for Girls", "response": ["*Linda Bennett OBE, fashion designer and entrepreneur (Class of 1981)"]}, {"page": "Salt Publishing", "response": ["In 1999 John Kinsella, Clive Newman and Chris Hamilton-Emery formed a partnership to develop Salt Publishing. When Newman left in 2002 and the original partnership was dissolved, Jen Hamilton-Emery, a senior manager in the National Health Service, joined Chris Hamilton-Emery to take over the ownership of Salt, relaunching the business in the UK. Since that time Salt has rapidly expanded its size and the range of its publishing programme.  In November 2004, Salt was incorporated in the UK and Linda Bennett (ex-Waterstone's) joined as a director. In July 2005 John Skelton joined as a director."]}, {"page": "Fitzroy Square", "response": ["* Until recently the clothing designer Linda Bennett owned a Grade I listed house in the Square."]}, {"page": "Veuve Clicquot", "response": ["Past winners include Françoise Nyssen, Ruth Rasmussen, Patty Dedominic, Anne Oian, Ray Kawakubo, Carolyn McCall, Linda Bennett, Anya Hindmarch, Anita Roddick and Zaha Hadid."]}, {"page": "L.K.Bennett", "response": ["Linda Bennett set up the first LK Bennett shop in Wimbledon Village in 1990, with a goal to produce \"something in-between the designer footwear you find in Bond Street and those on the high street\". The company’s success led Bennett to earn the nickname \"Queen of the Kitten Heel.”", "In April 2017 the brand announced that Linda Bennett would be returning to its helm with a focus on product and brand development. In September 2017 she bought out the company."]}, {"page": "Icelandic diaspora", "response": ["* Linda Bennett, an English-Icelandic clothing designer and entrepreneur."]}, {"page": "Moccas Court", "response": ["In late 2014, the house and estate of circa 200 acres was sold, for an undisclosed price, to Linda Bennett, founder of the LK Bennett shoes and fashion brand. It is believed her husband was brought up in the locality.Sales Brochure by Frank Knight"]}, {"page": "List of University of Reading alumni", "response": ["* Linda Bennett OBE - English-Icelandic clothing designer and entrepreneur"]}]}}