{"wiki_id": "http://www.wikidata.org/entity/Q655477", "itemLabel": "Denis Wakeling", "itemDescription": "British bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Denis_Wakeling", "wikipedia_page": {"main": "John Denis Wakeling MC (12 December 1918 – 10 October 2004) was an Anglican bishop in the Church of England.\nHe was born in Leicester and was educated at St Michael's Limpsfield, a Church Missionary Society school in Surrey. He studied classics at St Catharine's College, Cambridge and served in the Royal Marines in World War II. He was awarded an MC in 1945 for his part in operations in Yugoslavia.\nHe prepared for the ministry at Ridley Hall, Cambridge and was ordained in 1948. He was chaplain at Clare College, Cambridge, then vicar of Emmanuel, Plymouth from 1952 to 1959 and of Barking, Essex from 1959 to 1965 when he was appointed the Archdeacon of West Ham.\nHis appointment as the Bishop of Southwell in Nottinghamshire followed in 1970; he was consecrated at York Minster on Michaelmas day (29 September) 1970. He was chairman of the Archbishops’ Council on Evangelism from 1976 to 1979.\nWakeling retired to Salisbury in 1984. He married Josephine Broomhall in 1941; they had two sons.", "link_mentions": [{"page": "Bishop of Southwell and Nottingham", "response": ["|Denis Wakeling"]}, {"page": "Archdeacon of West Ham", "response": ["*1965–1970 (res.) Denis WakelingThe Telegraph, Obituary – Denis WakelingThe Independent, Obituary – Denis Wakeling"]}, {"page": "John Denis Wakeling", "response": ["#REDIRECT Denis Wakeling"]}, {"page": "Deaths in October 2004", "response": ["*Denis Wakeling, 85, British Anglican prelate, Bishop of Southwell (1970–1985)."]}, {"page": "Wakeling", "response": ["*Denis Wakeling (1918–2004), Anglican bishop"]}, {"page": "Peter Hill (bishop)", "response": ["Hill was made a deacon at Petertide 1983 (3 July) and ordained a priest the Petertide next (1 July 1984) — both times by Denis Wakeling, Bishop of Southwell, at Southwell Minster."]}, {"page": "St Margaret's Church, Barking", "response": ["* 1959–1965: Denis Wakeling; later Bishop of Southwell "]}]}}