{"wiki_id": "http://www.wikidata.org/entity/Q65665546", "itemLabel": "Elinor Hallé", "itemDescription": "British sculptor and inventor", "wikipedia_url": "https://en.wikipedia.org/wiki/Elinor_Hall%C3%A9", "wikipedia_page": {"main": "Elinor Jessie Marie Hallé CBE (1856 – 18 May 1926) was a British sculptor and inventor. She is known for her work on medals and for devising the idea of creating plaster casts as splints for broken limbs during World War One.", "link_mentions": [{"page": "Charles Hallé", "response": ["He was twice married: first, on 11 November 1841, to Desirée Smith de Rilieu, who died in 1866; and, secondly, on 26 July 1888, to Madame Wilma Neruda, the distinguished violinist. Charles Edward Hallé, his son by his first wife, became a painter and gallery manager whilst his daughter, Elinor Hallé CBE, was a sculptor and inventor."]}, {"page": "Alphonse Legros", "response": ["The Slade Girls attracted commissions from a range of societies and organisations due to the beauty and skill of their work. Pupils of note include the Casella sisters (Ella and Nelia), Jessie Mothersole, Fedora Gleichen, Lilian Swainson  (later Hamilton) and Elinor Hallé."]}, {"page": "Orthopedic cast", "response": ["*Anne Acheson, British-Irish sculptor who, together with Elinor Hallé, invented and developed orthopedic plaster casts"]}, {"page": "Anne Acheson", "response": ["Anne Crawford Acheson  (5 August 1882 – 13 March 1962) was a British-Irish sculptor. She and Elinor Hallé invented plaster casts for soldier's broken limbs.  Acheson exhibited at the Royal Academy and internationally. She was awarded the CBE in 1919. During the First World War she worked for the Surgical Requisites Association at Mulberry Walk in Chelsea, London. Acheson received the Gleichen Memorial Award in 1938. She divided her time between London and Glenavy, County Antrim, Northern Ireland.", "During the First World War she volunteered with the Surgical Requisites Association. The association supplied medical dressings and had been created by Queen Mary's Needlework Guild. Acheson and Elinor Hallé were both sculptors and they witnessed soldiers returning from the front with broken limbs held together with only wooden splints and basic bandages, Acheson suggested taking a plaster cast of the limb and when the cast had hardened, wrapping papier-mache over it, and placing it over the broken limb to support it whilst healing. This was inspired by the plaster of Paris she used in her sculptural work. The anatomically correct papier-mache splint reduced the healing time while properly supporting the broken limb. The idea of using plaster of Paris was adopted and refined over the years and is still in use today by the medical profession. When she completed her studies, Acheson taught at a school in London and continued to live in that city until "]}, {"page": "Halle (name)", "response": ["* Elinor Hallé (1856–1926), English sculptor and inventor"]}]}}