{"wiki_id": "http://www.wikidata.org/entity/Q656655", "itemLabel": "Michael Deeley", "itemDescription": "British film producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Deeley", "wikipedia_page": {"main": "Michael Deeley (born 6 August 1932) is an Academy Award-winning British film producer known for such motion pictures as The Italian Job (1969), The Deer Hunter (1978), and Blade Runner (1982). He is also a founding member and Honorary President of British Screen Forum.", "link_mentions": [{"page": "August 6", "response": ["*1932 – Michael Deeley, English screenwriter and producer"]}, {"page": "Blade Runner", "response": ["The screenplay by Hampton Fancher was optioned in 1977. Producer Michael Deeley became interested in Fancher's draft and convinced director Ridley Scott to film it. Scott had previously declined the project, but after leaving the slow production of Dune, wanted a faster-paced project to take his mind off his older brother's recent death. He joined the project on February 21, 1980, and managed to push up the promised Filmways financing from US$13 million to $15 million. Fancher's script focused more on environmental issues and less on issues of humanity and religion, which are prominent in the novel and Scott wanted changes. Fancher found a cinema treatment by William S. Burroughs for Alan E. Nourse's novel The Bladerunner (1974), titled Blade Runner (a movie). Scott liked the name, so Deeley obtained the rights to the titles.Abraham Riesman,", "The question of whether Deckard is intended to be a human or a replicant has been an ongoing controversy since the film's release. Both Michael Deeley and Harrison Ford wanted Deckard to be human, while Hampton Fancher preferred ambiguity. Ridley Scott has stated that in his vision, Deckard is a replicant. Deckard's unicorn-dream sequence, inserted into Scott's Director's Cut and concomitant with Gaff's parting gift of an origami unicorn, is seen by many as showing that Deckard is a replicant – because Gaff could have retrieved Deckard's implanted memories. The interpretation that Deckard is a replicant is challenged by others who believe the unicorn imagery shows that the characters, whether human or replicant, share the same dreams and recognize their affinity,Brooker, Peter \"Imagining the Real: Blade Runner and Discourses on the Postmetropolis\" in . or that the absence of a decisive answer is crucial to the film's main theme. The film's inherent ambiguity and uncertainty, as well as its textual richness, have permitted multiple interpretations.Hills, Matt \"Academic Textual Poachers: Blade Runner as Cult Canonical Film\" in ."]}, {"page": "The Wicker Man", "response": ["By the time of the film's completion the studio had been bought by EMI, and British Lion was managed by Michael Deeley. The DVD commentary track states that studio executives suggested a more \"upbeat\" ending to the film, in which a sudden rain puts the flames of the wicker man out and spares Howie's life, but this suggestion was refused. Hardy subsequently had to remove about 20 minutes of scenes on the mainland, early investigations, and (to Lee's disappointment) some of Lord Summerisle's initial meeting with Howie."]}, {"page": "Academy Award for Best Picture", "response": ["| Barry Spikings, Michael Deeley, Michael Cimino, and John Peverall"]}, {"page": "The Deer Hunter", "response": ["The film was based in part on an unproduced screenplay called The Man Who Came to Play by Louis A. Garfinkle and Quinn K. Redeker, about Las Vegas and Russian roulette. Producer Michael Deeley, who bought the script, hired writer/director Michael Cimino who, with Deric Washburn, rewrote the script, taking the Russian roulette element and placing it in the Vietnam War. The film went over-budget and over-schedule, and ended up costing $15 million. The scenes depicting Russian roulette were highly controversial after the film's release. EMI Films, who produced the film, released the film internationally while Universal Pictures handled its distribution in North America.", "There has been considerable debate, controversy, and conflicting stories about how The Deer Hunter was initially developed and written. Director and co-writer Michael Cimino, writer Deric Washburn, and producers Barry Spikings and Michael Deeley all have different versions of how the film came to be. ", "In 1968, the record company EMI formed a new company called EMI Films, headed by producers Barry Spikings and Michael Deeley. Deeley purchased the first draft of a spec script called The Man Who Came to Play, written by Louis A. Garfinkle and Quinn K. Redeker, for $19,000. The spec script was about people who go to Las Vegas to play Russian roulette. \"The screenplay had struck me as brilliant,\" wrote Deeley, \"but it wasn't complete. The trick would be to find a way to turn a very clever piece of writing into a practical, realizable film.\"Deeley, p. 163 When the movie was being planned during the mid-1970s, Vietnam was still a taboo subject with all major Hollywood studios.Deeley, p. 2 According to producer Michael Deeley, the standard response was \"no American would want to see a picture about Vietnam\".", "| 4. Best Picture, Barry Spikings, Michael Deeley, Michael Cimino, John Peverall", "| Barry Spikings, Michael Deeley, Michael Cimino and John Peverall"]}, {"page": "National Science and Media Museum", "response": ["Guests at Bradford International Film Festival included Riz Ahmed, Jenny Agutter, Michael Apted, David Arnold, Thomas Arslan, Ken Annakin, Olivier Assayas, Richard Attenborough, Simon Beaufoy, Alan Bennett, James Benning, Claire Bloom, Kenneth Branagh, Adam Buxton, Jack Cardiff, Ian Carmichael, Gurinder Chadha, Tom Courtenay, Mark Cousins, Alex Cox, Brian Cox, Benedict Cumberbatch, Terence Davies, Michael Deeley, Denis Dercourt, The Dodge Brothers, James Ellis, Mike Figgis, Freddie Francis, Terry Gilliam, Stephen Graham, Richard Griffiths, Ronald Harwood, Mike Hodges, Joanna Hogg, John Hurt, Derek Jacobi, Gualtiero Jacopetti, Terry Jones, Patrick Keiller, Mark Kermode, Mike Leigh, Euan Lloyd, Ken Loach, Malcolm McDowell, Virginia McKenna, Fernando Meirelles, Kay Mellor, Metamono, Chris Morris, Barry Norman, Michael Palin, Pawel Pawlikowski, Christian Petzold, Sally Potter, Godfrey Reggio, Menelik Shabazz, John Shuttleworth, Jean Simmons, Timothy Spall, Imelda Staunton, Eric Sykes, Julien Temple, Alex Thomson, Richard Todd, Danny Trejo, Roy Ward Baker, Peter Whitehead, Michael G. Wilson, Barbara Windsor, Ray Winstone, Stephen Woolley, Thierry Zéno and many independent filmmakers from around the world."]}, {"page": "The Adventures of Robin Hood (TV series)", "response": ["* Dubbing Editors – Harry Booth and Michael Deeley (series 1), Freddie Cook (series 2)"]}, {"page": "Michael Cimino", "response": ["In writing about his experience working on  The Sicilian, producer Bruce McNall described Cimino as \"one part artistic genius and one part infantile egomaniac.\"McNalll & D'Antonio, p. 103 In his book, Blade Runners, Deer Hunters and Blowing the Bloody Doors Off, producer Michael Deeley described his experience with Cimino on Deer Hunter as a \"travail\",Deeley, p. 3 adding \"the only flaw I find in my Oscar [for The Deer Hunter] is that Cimino's name is also engraved on it.\"Deeley, p. 5 Deeley criticized Cimino for lack of professional respect and standards: \"Cimino was selfish. ... Selfishness, in itself, is not necessarily a flaw in a director, unless it swells into ruthless self-indulgence combined with a total disregard for the terms in which the production has been set.\"Deeley, p. 178. Cinematographer Vilmos Zsigmond reported that Cimino was hard to work with but extremely talented visually.Shooting The Deer Hunter: An interview with Vilmos Zsigmond. [DVD & Blu-ray]. Blue Underground. Interview with the cinematographer, located on The Deer Hunter, UK Region 2 DVD and StudioCanal Blu-ray.", "|Director  Co-story writer (with Deric Washburn, Louis Garfinkle and Quinn K. Redeker)  Co-producer (with Barry Spikings, Michael Deeley and John Peverall)"]}, {"page": "Murphy's War", "response": ["Paramount Pictures agreed to provide half the finance of the film in exchange for world distribution rights.\"Notes: Murphy's War.\" Turner Classic Movies. Retrieved: 19 August 2013. The other half of the budget came from London Screenplays, a finance company.Deeley 2011, p. 83. Michael Deeley says that he and Peter Yates turned down the chance to make The Godfather (1972) to make this film.Deeley 2011, p. 82."]}, {"page": "BAFTA Award for Best Film", "response": ["| The Deer Hunter || Michael Cimino || Michael Cimino, Michael Deeley, John Peverall, Barry Spikings ||  United States"]}, {"page": "Stanley Baker", "response": ["Baker formed the production company Oakhurst Productions with Michael Deeley. Its first cinema film was Robbery (1967), a heist film with Baker in the lead role. It was a solid success in Britain and launched the Hollywood career of director Peter Yates. Baker announced he would make another film for Levine, A Nice Girl Like Me acting opposite Hayley Mills who would play a girl who constantly gets pregnant.\"They Seek Out Saul Bellow: 'MAF BOYS' STRANGER\" DUE ON THE RUN\" by A.H. WEILER. New York Times 28 May 1967: D9. The film would be made by Levine, but not with Baker or Mills. He was also going to film the John Roeburt novel The Climate of Hell with James Goldstone.\"MOVIE CALL SHEET: Roth Organizes Company\" Martin, Betty. Los Angeles Times 16 Oct 1967: c28. and the Norman Lewis novel Everyman's Brother.\"Tisha Sterling in Space Film\" Martin, Betty. Los Angeles Times 8 July 1968: f15. He appeared in The Girl with the Pistol (1968), an Italian comedy, then worked as a producer only on two films for Oakhurst: The Other People (1968), which was never released, and The Italian Job (1969) a heist comedy with Michael Caine, a big hit. He was also part of the consortium which set up Harlech Television. At the end of 1968 exhibitors voted him the ninth biggest star in Britain, after John Wayne, Julie Christie, Steve McQueen, Tommy Steele, Paul Newman, Sean Connery, Clint Eastwood and Julie Andrews.\"John Wayne-money-spinner\" The Guardian; London (UK) 31 Dec 1968: 3.", "With Michael Deeley and Barry Spikings, he formed 'Great Western Enterprises', which was involved in a number of projects in the entertainment field, notably music concerts, and in the late 1960s it bought Alembic House (now called Peninsula Heights) on the Albert Embankment, where Baker occupied the penthouse apartment for a number of years. Baker, Deeley, and Spikings were also part of a consortium that bought British Lion Films and Shepperton Studios, selling Alembic House to finance it. Baker said in 1972 that:", "According to Michael Deeley, the financiers of British Lion Films were reluctant for Baker to be involved in the management of the company because they felt his focus was more on his acting career.Michael Deeley, Blade Runners, Deer Hunters and Blowing the Bloody Doors Off: My Life in Cult Movies, Pegasus Books, 2009 p 109"]}, {"page": "Stowe School", "response": ["* Michael Deeley, (born 1932), Academy-Award-winning film producer"]}, {"page": "Thunderbolt and Lightfoot", "response": ["As a result of this film and Cimino's TV commercial work, producer Michael Deeley would approach Cimino to direct and co-write the Oscar-winning The Deer Hunter (1978).Deeley, p. 163Deeley, p. 164"]}, {"page": "Don't Look Now", "response": ["The sex scene remained controversial for some years after the film's release. The BBC cut it altogether when Don't Look Now premiered on UK television, causing a flood of complaints from viewers. The intimacy of the scene led to rumours that Christie and Sutherland had unsimulated sex which have persisted for years, and that outtakes from the scene were doing the rounds in screening rooms. Michael Deeley, who oversaw the film's UK distribution, claimed on BBC Radio 4's Desert Island Discs that Warren Beatty had flown to London and demanded that the sex scene—featuring then girlfriend Julie Christie—be cut from the film. The rumours were seemingly confirmed in 2011 by former Variety editor Peter Bart, who was a Paramount executive at the time. In his book,  Infamous Players: A Tale of Movies, the Mob, (and Sex), Bart says he was on set on the day the scene was filmed and could clearly see Sutherland's penis \"moving in and out of\" Christie. Bart also reiterated Warren Beatty's discontent, noting that Beatty had contacted him to complain about what he perceived to be Roeg's exploitation of Christie, and insisting that he be allowed to help edit the film. Sutherland subsequently issued a statement through his publicist stating that the claims were not true, and that Bart did not witness the scene being filmed. Peter Katz, the film's producer, corroborated Sutherland's account that the sex was entirely simulated.", "The film was among the top British titles at the UK box-office in 1974, second only to Confessions of a Window Cleaner, and ranking in the top twenty of the year overall. Michael Deeley, who was managing director of British Lion Films at the time of the film's release, claimed that the film's US reception was hurt by Paramount Pictures rushing the film into cinemas too early, due to the unexpected failure of Jonathan Livingston Seagull; despite its mismanaged distribution, Peter Bart—from his time at Paramount—recalls it performing \"fairly well\" at the box office. The film had recouped most of its expenses before it was even released, with its $1.1 million budget offset by the fee Paramount paid for the US distribution rights."]}, {"page": "Barry Spikings", "response": ["*1975: Conduct Unbecoming (producer with Michael Deeley and Andrew Donally)", "*1976: The Man Who Fell to Earth (producer with Michael Deeley)", "*1978: The Deer Hunter (producer with Michael Deeley, Michael Cimino, and John Peverall)"]}, {"page": "Convoy (1978 film)", "response": ["After seeing Peckinpah's rough cut, EMI and their executive producer Michael Deeley fired him and Craven from the film and hired another editor, Graeme Clifford, to drastically reduce the running time and emphasise aspects that would play well to Smokey and the Bandit's audience; Hal Needham's comedy had been a huge hit a year earlier. Peckinpah essentially disowned the released version. Garner Simmons, author of Peckinpah: A Portrait in Montage, said that EMI and Clifford's version of Convoy \"cut the guts out of it\".If They Move . . . Kill 'Em!: The Life and Times of Sam PeckinpahPassion & PoetrySam's Trucker Movie (2013)"]}, {"page": "Hampton Fancher", "response": ["After trying to option Philip K. Dick's 1968 science fiction novel Do Androids Dream of Electric Sheep? in 1975, when the rights were not available, Fancher sent his friend Brian Kelly, a prospective film producer, to negotiate with Dick. Dick agreed, and Fancher was brought on to write a screenplay before Kelly would later enlist the support of producer Michael Deeley. This made Fancher the executive producer, which led to disagreements with eventual director Ridley Scott, who then brought in David Peoples to continue reworking the script. Scott and Fancher had already clashed concerning the movie, as Scott felt the original script did not sufficiently explore the world of the movie, choosing instead to focus on the interior drama. Fancher's rewriting process was too slow for the production crew, which nicknamed him \"Happen Faster\". The movie was ultimately filmed and released as Blade Runner (1982)."]}, {"page": "Douglas Slocombe", "response": ["For The Italian Job (1969), Slocombe was hired by producer Michael Deeley because \"he tended to do very moody work, and he was very efficient\". Slocombe later remembered shooting inside Kilmainham Gaol, a genuine closed prison, and finding the experience unpleasant: \"the real thing, there is something quite terrifying about it. One knows hundreds and hundreds of people have suffered here...although this was a comedy, all this was still in the back of one's mind\"."]}, {"page": "EMI Films", "response": ["=== Michael Deeley and Barry Spikings ===", "In May 1976, the company purchased British Lion Films and the two men who ran British Lion, Michael Deeley and Barry Spikings, became joint managing directors of EMI Distributors, with Nat Cohen remaining as chairman and chief executive. They also joined the EMI board, headed by Bernard Delfont.", "Michael Deeley left EMI in 1979 but Barry Spikings remained in charge of film production.", "=== Michael Deeley and Barry Spikings regime ==="]}, {"page": "Robbery (1967 film)", "response": ["Robbery is a 1967 British crime film directed by Peter Yates and starring Stanley Baker. The story is a heavily fictionalised version of the 1963 Great Train Robbery. The film was produced by Stanley Baker and Michael Deeley, for Baker's company Oakhurst Productions.", "Michael Deeley bought the rights to Peta Fordham's book based on the 'Great Train Robbery' of 1963. He and director Peter Yates offered the project to Woodfall Film Productions, where Deeley worked, but the company did not want to make it. Deeley and Yates then approached Stanley Baker to star in the film. Baker had a good relationship with Joseph E. Levine, whose Embassy Pictures agreed to fund the movie.Deeley p35", "According to Michael Deeley the film did \"good business\" on release.Deeley p39 It was not a big hit in the US; Peter Yates called it \"very poorly exploited\". The film won the best original British screenplay award (for Edward Boyd, Peter Yates, and George Markstein) from the Writers Guild of Great Britain."]}, {"page": "Warlords of Atlantis", "response": ["The film was the fourth action-fantasy collaboration between Kevin Connor and Doug McClure. The first three were made by Amicus Productions, which had since wound up: this movie was made EMI Films, then run by Michael Deeley and Barry Spikings, and Columbia Pictures.Ed. Allan Bryce, Amicus: The Studio That Dripped Blood, Stray Cat Publishing, 2000 p 152Can Rank say they 'proudly' present this film? Barker, Dennis. The Guardian 26 Nov 1977: 17."]}, {"page": "Peter Yates", "response": ["Yates had seen the original Royal Court production of N.F. Simpson's play One Way Pendulum and got the job of making the film version released in 1964. It was produced by Michael Deeley. The movie was not widely seen.Michael Deeley, Blade Runners, Deer Hunters and Blowing the Bloody Doors Off: My Life in Cult Movies, Pegasus Books, 2009 p 27-29Engel Will 'Move' Burma to Thailand: Beatty Slips Self 'Mickey'; Richardson Sets Pendulum Scheuer, Philip K. Los Angeles Times 11 March 1964: D15."]}, {"page": "Rémy Julienne", "response": ["After Delamare's tragic death during a stunt in 1966, Julienne stepped-in and agreed to fulfill contracts Delamare had signed with various film studios. Julienne's scientific approach which created spectacular on-screen images garnered him admiration within the industry in an age before computer modelling. Working initially in French film and TV, and occasional Hollywood films shot in Europe, his developing reputation led to his employment on the British film The Italian Job. Producer Michael Deeley later commented that “During our initial meeting with Rémy, Peter Collinson [the film’s director] and I were delighted to discover that he was prepared to take the chase sequence even further than we had envisaged, suggesting a different range of hair-raising stunts that could be written into the script.” Julienne planned and co-ordinated all of the vehicle sequences, including the epic Mini chase sequence through the streets and roof tops of Turin."]}, {"page": "Peter Collinson (film director)", "response": ["Collinson directed two films for Paramount, both produced by Michael Deeley: The Long Day's Dying (1968), a low-budget war film, and The Italian Job (1969), a caper movie starring Michael Caine and Noël Coward. Dino De Laurentiis said he was to direct a film about Ned Kelly in Australia, The Iron Outlaw, but it was never made. Instead, Collinson went to Turkey where he directed Tony Curtis and Charles Bronson in You Can't Win 'Em All (1970). He clashed with Curtis during filming. He was meant to helm a biopic of Robert Capa, but it was never made."]}, {"page": "The Man Who Fell to Earth", "response": ["The Man Who Fell to Earth is a 1976 British science fiction film directed by Nicolas Roeg and written by Paul Mayersberg. Based on Walter Tevis's 1963 novel of the same name, the film follows an extraterrestrial who crash lands on Earth seeking a way to ship water to his planet, which is suffering from a severe drought, but finds himself at the mercy of human vices and corruption. It stars David Bowie, Candy Clark, Buck Henry, and Rip Torn. It was produced by Michael Deeley and Barry Spikings. The same novel was later adapted as a television film in 1987.", "Paramount Pictures had distributed Roeg's previous film, Don't Look Now (1973) and agreed to pay $1.5 million for the US rights. Michael Deeley used this guarantee to raise finance to make the film. Roeg originally considered casting author Michael Crichton and actor Peter O'Toole in the role of Thomas before Bowie.", "According to Michael Deeley, when Barry Diller of Paramount saw the finished film he refused to pay for it, claiming it was different from the film the studio wanted. British Lion sued Paramount and received a small settlement. The film obtained a small release in the United States through Cinema V in exchange for $850,000 and due to foreign sales the film's budget was just recouped."]}, {"page": "51st Academy Awards", "response": ["*The Deer Hunter – Barry Spikings, Michael Deeley, Michael Cimino and John Peverall, producers"]}, {"page": "Nat Cohen", "response": ["In 1976, EMI bought out British Lion and their management wound up running EMI. Michael Deeley and Barry Spikings became managing directors of EMI Films while Cohen became executive chairman. He retired from this position at the end of 1977 to become a consultant.", "Cohen stayed at EMI for several more years, a period he described as \"an awkward stage... not quite sure where I was supposed to be; and rarely finding people available when I wanted to consult them. A delicate situation.\"Walker 1985 p 207 During this time, EMI made some expensive failures including Honky Tonk Freeway and Can't Stop the Music, none of which involved Cohen. \"I suppose you could sum it up this way\", he said later, \"I was very fortunate that as these costly deals were being made, I seemed to be losing control of picture making in the company.\" Michael Deeley, however, claimed that Cohen committed $1 million of EMI's money for the flop Roar.Michael Deeley Blade Runners, Deer Hunters and Blowing the Bloody Doors Off: My Life in Cult Movies, Pegasus Books 2009, p 142 Deeley said Cohen was \"quite a different\" type of executive to him and Spikings. \"His style was defined by great lies\", according to Deeley.p 114"]}, {"page": "Death on the Nile (1978 film)", "response": ["EMI Films had scored a huge success in 1974 with a film version of Murder on the Orient Express, and wanted a follow-up. The movie was made during a period of expansion for EMI Films under Michael Deeley and Barry Spikings, who were increasingly aiming at the international market with films like The Deer Hunter and Convoy. Death on the Nile was a more traditionally British film."]}, {"page": "The Driver", "response": ["In the late 1970s, Britain's EMI Films came under the stewardship of Michael Deeley and Barry Spikings. They began co-financing movies shot in Hollywood in association with major US studios that were aimed at the international market, such as Convoy, The Deer Hunter and The Driver. They were interested in financing The Driver provided a suitable star could be found for the lead."]}, {"page": "The Case of the Mukkinese Battle-Horn", "response": ["The budget of £4,500 was raised from Archway Film Distributors (£1,500); Peter Weingreen, who worked with Michael Deeley and Harry Booth on The Adventures of Robin Hood (£1,500); and Joseph Sterling, who wanted to direct (£1,500). Peter Sellers was paid £900.", "The film was unable to secure a release in the US but screened widely as a supporting short in British cinemas. Michael Deeley says it remains the most profitable film he was ever associated with, returning its cost ten times over."]}, {"page": "Where's Jack?", "response": ["Financing was provided by Paramount. According to producer Michael Deeley, this was obtained after a pitch Martin Baum, Stanley Baker's agent did to Charles Bludhorn, owner of Paramount. Baum described the film was being written by the writers of Point Blank (1967), produced by the maker of Zulu (1963) and directed by the man who made To Sir, with Love (1967) which made a combined profit of $45 million. Divided by four that meant a profit of over $10 million after $3 million cost was deducted. The pitch was successful and Deeley says it remains one of his happiest memories in getting a film funded.", "Where's Jack? turned out to be a box office flop.Michael Deeley, Blade Runners, Deer Hunters and Blowing the Bloody Doors Off: My Life in Cult Movies, Pegasus Books, 2009 p 43-44 The film was not even released in the USA after performing poorly in Europe.Hollywood Skeletons Haunt Studio Vaults"]}, {"page": "British Lion Films", "response": ["Barry Spikings and Michael Deeley were entrepreneurs with experience in filmmaking. They had a company with actor Stanley Baker Greater Western Investments (GWI) and wanted to sell their main asset, a building, but wanted to avoid the high tax rate that came with real estate development. They decided to swap their shares in the company for shares in Lion International, the company that owned British Lion Films, Shepperton Studios, Pearl & Dean cinema advertisers, and Mills and Allen outdoor advertising. This would enable Lion to sell the building for cash, offsetting the profit against existing losses incurred by some of its subsidiaries.Deeley p 96-97"]}, {"page": "The Internecine Project", "response": ["The film was made by British Lion, then run by Michael Deeley. Deeley wrote in his memoirs that it and another movie, Who? were financed the same way: half the costs coming from a US deal with Allied Artists, the other half coming from a German tax shelter deal. \"In terms of cinema history, neither film is important,\" wrote Deeley, but he took pride in how they were financed saying \"such clever means were the only way to keep British Lion alive.\""]}, {"page": "Darwin among the Machines", "response": ["*Do Androids Dream of Electric Sheep? - Philip K. Dick (1968), adapted by Michael Deeley, Hampton Fancher, and David Peoples for the movie Blade Runner (1982)"]}, {"page": "The Italian Job", "response": ["The Italian Job is a 1969 British comedy caper film, written by Troy Kennedy Martin, produced by Michael Deeley and directed by Peter Collinson. It tells the story of Charlie Croker (Michael Caine), the leader of a cockney criminal gang released from prison with the intention of doing a \"big job\" in Italy to steal gold bullion from an armoured security truck."]}, {"page": "Ransom (1974 film)", "response": ["According to Michael Deeley, managing director of British Lion Films, the film was put together by British producer Peter Rawley. He arranged the script and engaged Sean Connery and Ian MacShane, then went to British Lion, who agreed to provide the $1.5 million budget. They sold US and Canadian rights to 20th Century Fox for $800,000, and sold the rights for the rest of the world for $1 million, making a comfortable profit."]}, {"page": "Conduct Unbecoming (1975 film)", "response": ["The film was greenlit by Michael Deeley who had recently become managing director of British Lion Films, and was part financed through a US tax deal. Deeley said there had been a number of screenplays written, including one by Terence Rattigan which Deeley says cost £250,000. He said all of them \"failed to crack the adaptation\" but there was \"a very simple solution, which was to go back to the stage play and strip out as much extraneous dialogue as possible. Robert Enders delivered a perfect screenplay by these means.\"Deeley p 107"]}, {"page": "The Long Day's Dying", "response": ["According to Michael Deeley, he and Peter Yates worked on the first draft of the script but were denied credit. He claims he gave Collinson the job partly to see if he was up to the task of directing The Italian Job (1969)."]}, {"page": "Robert De Niro", "response": ["For De Niro's sole project of 1977, he starred in Scorsese's musical drama New York, New York opposite Liza Minnelli. De Niro learned to play the saxophone from musician Georgie Auld, to portray saxophonist Jimmy, who falls in love with a pop singer (Minnelli). The film received generally mixed reception, although critics were kinder to De Niro. The film was nominated for four Golden Globe awards including Best Actor in a Motion Picture Musical or Comedy for De Niro. In 1978, De Niro starred in Michael Cimino's epic war film The Deer Hunter, in which he played a steelworker whose life was changed after serving in the Vietnam War. He co-starred with Christopher Walken, John Savage, John Cazale, Meryl Streep, and George Dzundza. The story takes place in Clairton, Pennsylvania, a working-class town on the Monongahela River south of Pittsburgh, and in Vietnam. Producer Michael Deeley pursued De Niro for the role, because the fame of his previous films would help make a \"gruesome-sounding storyline and a barely known director\" marketable. De Niro, impressed by the script and director's preparation, was among the first to sign on to the film. Reviews for The Deer Hunter were generally positive, and the cast attracted strong praise for their performances. The film received nominations at the Academy Awards, Golden Globes and British Academy Film Awards (BAFTAs), and earned De Niro a nomination for Best Actor at the Academy Awards. In 2007, the American Film Institute ranked it as the 53rd-greatest American film of all time in their 10th Anniversary Edition of the AFI's 100 Years...100 Movies list."]}, {"page": "British Screen Forum", "response": ["Richard Attenborough served as Honorary President until his death in 2014. Founder Member and long standing Board Member Michael Deeley was subsequently appointed to this post."]}]}}