{"wiki_id": "http://www.wikidata.org/entity/Q65648", "itemLabel": "Charles Hallé", "itemDescription": "pianist and conductor, founder of the Hallé orchestra", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Hall%C3%A9", "wikipedia_page": {"main": "Sir Charles Hallé (born Karl Halle; 11 April 1819 – 25 October 1895) was an Anglo-German pianist and conductor, and founder of The Hallé orchestra in 1858.", "link_mentions": [{"page": "April 11", "response": ["*1819 – Charles Hallé, German-English pianist and conductor (d. 1895)"]}, {"page": "Frédéric Chopin", "response": ["From 1842 onwards Chopin showed signs of serious illness. After a solo recital in Paris on 21 February 1842, he wrote to Grzymała: \"I have to lie in bed all day long, my mouth and tonsils are aching so much.\" He was forced by illness to decline a written invitation from Alkan to participate in a repeat performance of the Beethoven 7th Symphony arrangement at Érard's on 1 March 1843. Late in 1844, Charles Hallé visited Chopin and found him \"hardly able to move, bent like a half-opened penknife and evidently in great pain\", although his spirits returned when he started to play the piano for his visitor. Chopin's health continued to deteriorate, particularly from this time onwards. Modern research suggests that apart from any other illnesses, he may also have suffered from temporal lobe epilepsy.Sara Reardon, \"Chopin's hallucinations may have been caused by epilepsy\", The Washington Post, 31 January 2011, accessed 10 January 2014."]}, {"page": "October 25", "response": ["*1895 – Charles Hallé, German-English pianist and conductor (b. 1819)"]}, {"page": "1895", "response": ["* October 25 – Sir Charles Hallé, German-born pianist, conductor (b. 1819)"]}, {"page": "1819", "response": ["* April 11 – Charles Hallé, German pianist, conductor (d. 1895)"]}, {"page": "Elizabeth Gaskell", "response": ["In 1850 the Gaskells moved to a villa at 84 Plymouth Grove.Uglow J. Elizabeth Gaskell: A Habit of Stories (Faber and Faber; 1993) () She took her cow with her. For exercise, she would happily walk three miles to help another person in distress.  In Manchester, Elizabeth wrote her remaining literary works, while her husband held welfare committees and tutored the poor in his study. The Gaskells' social circle included writers, journalists, religious dissenters, and social reformers such as William and Mary Howitt and Harriet Martineau. Poets, patrons of literature and writers such as  Lord Houghton,  Charles Dickens and John Ruskin visited Plymouth Grove, as did the American writers Harriet Beecher Stowe and Charles Eliot Norton, while the conductor Charles Hallé, who lived close by, taught piano to one of their daughters. Elizabeth's friend Charlotte Brontë stayed there three times, and on one occasion hid behind the drawing room curtains as she was too shy to meet the Gaskells' other visitors."]}, {"page": "William Walton", "response": ["Walton was born into a musical family in Oldham, Lancashire, the second son in a family of three boys and a girl. His father, Charles Alexander Walton, was a musician who had trained at the Royal Manchester College of Music under Charles Hallé, and made a living as a singing teacher and church organist. Charles's wife, Louisa Maria (née Turner), had been a singer before their marriage.Kennedy, p. 5 William Walton's musical talents were spotted when he was still a young boy, and he took piano and violin lessons, though he never mastered either instrument. He was more successful as a singer:Greenfield, Edward. \"Behind the Façade – Walton on Walton\", Gramophone, February 2002, p. 93 he and his elder brother sang in their father's choir, taking part in performances of large-scale works by Handel, Haydn, Mendelssohn and others.Kennedy, p. 6"]}, {"page": "John Barbirolli", "response": ["From 1953 onwards, Barbirolli and the Hallé appeared regularly at the Henry Wood Promenade Concerts at the Royal Albert Hall in London. As well as major works from the mainstream repertory they gave an annual concert of music by Viennese composers, including Franz Lehár and Johann Strauss, which, like Sir Malcolm Sargent's annual Gilbert and Sullivan nights, rapidly became a firm favourite with the promenaders.Cox, p. 163 At one 1958 promenade concert Barbirolli and the Hallé played a replica of Charles Hallé's first concert with the orchestra in 1858.Cox, p. 178"]}, {"page": "Royal Liverpool Philharmonic", "response": ["In 1844 the society appointed the Liverpool architect John Cunningham to prepare plans for a concert hall to be situated at the junction of Hope Street and Myrtle Street.  It was to contain an audience of 2,100 and an orchestra of 250.  To raise money for its building, shares were issued and members of Liverpool society were invited to buy seats in the boxes to be included in the hall.  The foundation stone was laid in 1846 and construction began the following year.  In 1847 the society invited Felix Mendelssohn to compose a cantata based on words from Milton's Comus to celebrate the opening of the hall.  Mendelssohn died before this could be carried out. The hall cost £30,000 (£ as of ) and was formally opened on 27 August 1849.  The first concert was performed by an orchestra of 96 and a choir of over 200; performers at the concert included three future conductors of the orchestra, Alfred Mellon, Julius Benedict and Charles Hallé.  The organist was W. T. Best. The hall was not full for the first performance; this was attributed to two factors, the high price of admission, and the fear that the building, without central supporting pillars, was unsafe.", "Problems soon arose.  In 1850 the choir formed the Liverpool Philharmonic Auxiliary Society and were in conflict with their conductor.  Herrmann offered his resignation, which was not accepted.  By 1852 the financial problems of the society were deteriorating.  Membership was exclusive and not all the seats on offer had been taken up.  Suggestions that the conditions for membership should be relaxed were refused. In 1852 the society widened its activities from music by arranging theatrical performances, including Charles Dickens' company and an appearance by William Makepeace Thackeray. In 1855 it was discovered that William Sudlow, the Honorary Secretary had been stealing money from the society; an amount of more than £2,424 (£ as of ) had been embezzled.  Sudlow resigned from the society.  He was replaced by a paid secretary; the post was given to Henry Sudlow, a distant relative of William.  Henry was to serve the society for some 30 years with no similar problem. Prominent performers appearing for the society in 1856 were Jenny Lind, Clara Schumann and Charles Hallé. Dickens returned in 1858 and during that year the society was able to pay off the mortgage on the hall.", "By 1865 Hermann's health was deteriorating and a new principal conductor, Alfred Mellon, was appointed in September.  Mellon died only 18 months later, and was replaced by Julius Benedict, who remained in post until 1880, when his eyesight was deteriorating.  While Benedict was principal conductor, the society flourished both artistically and financially. This did not continue during the tenure of the next principal conductor, despite his later fame. Max Bruch was appointed on 23 February 1880 and served for less than three years.  During this time he experienced conflict with the committee of the society and complained about the behaviour of the audience.  He resigned in January 1883 at which time the standards of the orchestra and the choir had deteriorated, and members of the committee were disagreeing with each other. The person appointed to sort this out was Charles Hallé who had by this time established the Hallé Orchestra in Manchester.  Hallé continued as principal conductor until his death in 1895.  During this time the orchestra and choir flourished.  Those who appeared with the society during this time included Paderewski, Hubert Parry, Nellie Melba, and Clara Butt.  In 1883 the secretary, Henry Sudlow, died; he was replaced by George Broadbent."]}, {"page": "1895 in music", "response": ["*October 25 – Charles Hallé, pianist and conductor (born 1819)"]}, {"page": "Royal College of Music", "response": ["Under Sullivan, a reluctant and ineffectual principal, the NTSM failed to provide a satisfactory alternative to the Royal Academy and, by 1880, a  committee of examiners comprising Charles Hallé, Sir Julius Benedict, Sir Michael Costa, Henry Leslie and Otto Goldschmidt reported that the school lacked \"executive cohesion\". The following year Sullivan resigned and was replaced by John Stainer. In his 2005 study of the NTSM, Wright comments:"]}, {"page": "Hagen", "response": ["* Sir Karl Halle, also known as Sir Charles Hallé (1819-1895), pianist, composer and orchestra conductor"]}, {"page": "1862 in music", "response": ["**Stephen Heller and Charles Hallé perform Mozart's E-flat concerto for two pianos at The Crystal Palace in London."]}, {"page": "Charles Halle", "response": ["#REDIRECT Charles Hallé"]}, {"page": "1858 in music", "response": ["*January 30 – Hallé Orchestra founded by Charles Hallé in Manchester, England."]}, {"page": "1848 in music", "response": ["*Charles Hallé moves from Paris to Britain due to the French Revolution of 1848 and is invited to Manchester in September."]}, {"page": "1819 in music", "response": ["*April 11 – Sir Charles Hallé, pianist and conductor (d. 1895)"]}, {"page": "Princess Helena of the United Kingdom", "response": ["Music was one of her passions; in her youth she played the piano with Charles Hallé, Jenny Lind and Clara Butt were among her personal friends, and she was amongst the first members of the Bach Choir of London, founded by Lind's husband (and Helena's former piano teacher) Otto Goldschmidt. Her determination to carry out a wide range of public duties won her widespread popularity.Chomet, p. 40Keen, Basil, The Bach Choir: The First Hundred Years, p.24  She twice represented her mother at Drawing Rooms, attendance at which was considered equivalent to being presented to the Queen herself."]}, {"page": "Free Trade Hall", "response": ["After Sir Charles Hallé founded the Hallé Orchestra in 1858, its home was the Free Trade Hall until the hall was damaged in the Manchester Blitz. The Hallé performed at the reopening in 1951 with the Orchestra's musical director and conductor, Sir John Barbirolli who remained until 1970. The final concert there was in 1996."]}, {"page": "Royal Northern College of Music", "response": ["The RNCM has a rich history, dating back to the late 19th century and the establishment of the Royal Manchester College of Music (RMCM). In 1858, Sir Charles Hallé founded the Hallé orchestra in Manchester, and by the early 1890s had raised the idea of a music college in the city. Following an appeal for support, a building on Ducie Street was secured, Hallé was appointed Principal and Queen Victoria conferred the Royal title. The RMCM opened its doors to 80 students in 1893, rising to 117 by the end of the first year. Less than four decades later, in 1920, the Northern School of Music was established (initially as a branch of the Matthay School of Music), and for many years the two institutions peacefully coexisted. It wasn't until 1955 that NSM Principal, Hilda Collens, in recognising the importance of performance in training students, met with RMCM Principal, Frederic Cox, to raise the question of merging. Discussions continued until September 1967 when a Joint Committee was formed to oversee plans to combine the two colleges. The RNCM was formed in 1972, moving to its purpose-built home on Oxford Road in 1973. 2013 marked the 40th anniversary year of the RNCM."]}, {"page": "Stephen Heller", "response": ["In 1849 Heller performed in England, where in 1850 he was the subject of a long serial article (that is divided between many issues) devoted to his music in the British Musical World. In 1862 he performed Mozart's E-flat concerto for two pianos with Charles Hallé at The Crystal Palace."]}, {"page": "Blind Tom Wiggins", "response": ["The Emancipation Proclamation in 1862 freed all slaves in the Confederate states; all US slaves were not freed until the Thirteenth Amendment passed in December 1865. In 1866, at age 16, Tom was taken on a European concert tour by General Bethune, who collected testimonials about Tom's natural talents from composer-pianist Ignaz Moscheles and pianist-conductor Charles Hallé. These were printed in a booklet, \"The Marvelous Musical Prodigy Blind Tom\", and used to bolster Tom's international reputation."]}, {"page": "Chorlton-on-Medlock", "response": ["*Charles Hallé, musician, lived at Greenheys for a time"]}, {"page": "Adelaide Kemble", "response": ["Her son, the singer Algernon Charles Frederick Sartoris, married Nellie Grant, the daughter of the famous American general and president Ulysses S. Grant, on 21 May 1874 in the East Room of the White House. Their son, Algernon Edward Sartoris, married the granddaughter of the conductor Sir Charles Hallé."]}, {"page": "Charles Santley", "response": ["After an audition with Michael Costa, he sang in Mendelssohn's St. Paul in Manchester under Charles Hallé,  and in March 1858 he first sang Mendelssohn's Elijah (at Exeter Hall, Liverpool), of which he became a leading interpreterWilliam Ludwig's conception of Elijah was considered nobler by some, see Henry Wood, My Life of Music, p. 17. for over 50 years. From the first, he was given firm encouragement by Sims Reeves and Clara Novello, and by Mario and Grisi, with whom he sang on various occasions. At the inauguration of the original Leeds Festival of autumn 1858 he was the star performer (with Willoughby Weiss) in Rossini's Stabat Mater . In the autumn of 1859 he was singing items from St Paul, Judas Maccabaeus and Messiah at the Bradford Festival, shortly before embarking on his initial operatic season.", "In the first years after his return to England, Santley used often to sing buffo duets (for example 'Che l'antipatica vostra figura' from Ricci's Chiara di Rosemberg) with Giorgio Ronconi and Giovanni Belletti, at parties held by the influential critic H. F. Chorley.  In 1859 he made his debut at Covent Garden as Hoel in Meyerbeer's opera Dinorah.C. Santley, 'The Art of Singing and Vocal Declamation' (Macmillan and Co., London 1908), pp. 15-17. In the same season he sang in the English Il trovatore (Di Luna), The Rose of Castille, Satanella, La sonnambula, and as Rhineberg in Wallace's Lurline, with William Harrison and Louisa Pyne. Wallace transcribed the latter role (originally for bass) to suit his higher register, and composed the character's part in the final act expressly for him.Santley, 'The Art of Singing' (1908), pp. 17-18. Dinorah also received a royal command performance before Queen Victoria and Prince Albert. He was also able to fit in performances of Gluck's Iphigénie en Tauride in Manchester, with Sims Reeves and Catherine Hayes, for Charles Hallé. These were twice repeated at the residence of Lord Ward in Park Lane, London.", "Santley appeared in English opera for Mapleson at Her Majesty's Theatre in the 1860–61 season. Mapleson mounted a new opera, George Alexander Macfarren's Robin Hood, featuring a cast led by Sims Reeves and stage-debutante Helen Lemmens-Sherrington, under the direction of Charles Hallé. In the same season Santley sang (for Pyne and Harrison) Fra Diavolo, La Reine Topaze, The Bohemian Girl (with Mme Parepa), Il trovatore and Wallace's The Amber Witch, which later transferred to Drury Lane.Santley 1892, 171–72: J. H. Mapleson, The Mapleson Memoirs (Belford, Clarke & Co, Chicago & New York 1888), I, 28. He was announced to sing in Verdi's Macbeth with Giulia Grisi in 1861, but the promotion collapsed."]}, {"page": "British Rail Class 86", "response": ["|valign=\"top\" bgcolor=#eaecf0|Sir Charles Hallé"]}, {"page": "Hamilton Harty", "response": ["In his career as a conductor, which began in 1904, Harty was particularly noted as an interpreter of the music of Berlioz. From 1920 to 1933 he was the chief conductor of the Hallé Orchestra in Manchester, which he returned to the high standards and critical acclaim that it had enjoyed under its founder, Charles Hallé. His last permanent post was with the London Symphony Orchestra, but it lasted only two years, from 1932 to 1934. During his conducting career, Harty made some recordings with his orchestras. Shortly after his dismissal by the LSO, Harty began to suffer the symptoms of a brain tumour. After surgery, he resumed his career until 1940, but the tumour returned to cause his death at the age of 61.", "Harty was appointed permanent conductor of the Hallé in 1920. Under his baton, the Hallé recovered the eminence it had previously enjoyed under the conductorship of its founder, Charles Hallé, and his successor, Hans Richter. Kennedy writes that under Harty it was probably the best orchestra in England. Harty's skill as a piano accompanist developed into a similar talent for conducting concertos. Writing of his skill as in accompanying either as a pianist or as a conductor, John F. Russell wrote in 1941, \"Anybody who heard Harty in his capacity as accompanist could never forget his extraordinary grasp of every nuance and expressive device. There was no question of a solo with accompaniment: unless the soloist was a very great artist the chances were that he would be submerged by the artistry of the accompanist.\"Russell, John F. \"Hamilton Harty\", Music & Letters, vol. 22, no. 3 (July 1941), pp. 216-224  Wilhelm Backhaus and others wished they could take the Hallé with them on their international travels.Hutchings, Arthur. \"Hamilton Harty: His Life and Music\", Music & Letters, vol. 61, no. 1 (January 1980), pp. 76–77 . During a Brahms concerto, Artur Schnabel accidentally skipped two bars, but Harty's rapport with and control of the Hallé was such that he kept up seamlessly with the soloist. Schnabel said afterward that he had never experienced such magnificent accompaniment, but tactlessly added that the Hallé was \"almost as good as the Berlin Philharmonic\"; Harty corrected him: the Hallé was \"better by two bars\"."]}, {"page": "Longsight", "response": ["thumb|Former First Church of Christ, Scientist by Edgar Wood thumb|right|Slade HallThe area of Longsight contains many of the notable buildings of Victoria Park. Daisy Bank Road is a particularly good example, featuring Edgar Wood's Grade I listed First Church of Christ, Scientist and the Edwardian art nouveau Chadlington House, as well as the residences of Charles Hallé and Emmeline Pankhurst. Pankhurst's family house is also situated on the edge of Longsight at Plymouth Grove.", "3 Addison Terrace, on the north side of Daisy Bank Road, Victoria Park, was the home of Charles Hallé, the founder of the Hallé Orchestra, in 1848. The pre-raphaelite artist Ford Madox Brown lived at the same address from 1883 to 1887."]}, {"page": "Almack's", "response": ["Besides balls, the rooms were let for public meetings, dramatic readings, concerts, and for dinners. Saturday 11 February 1792 saw the first of Samuel Harrison and Charles Knyvett's Vocal Concerts, a series that would continue until 1821. Between 1845 and 1858, John Ella's Musical Union gave eight concerts a year of chamber music in the rooms. Hector Berlioz was on the podium at the rooms on 7 April 1848 when he conducted his \"Hungarian March\" from La damnation de Faust at a concert of the Amateur Musical Society. And the Quartet Association (which included the 'cellist Alfredo Piatti and the pianist/conductors Charles Hallé and Sterndale Bennett) gave concerts at the Rooms between 1852 and 1855 in an attempt to popularise chamber music."]}, {"page": "Sir Charles Hallé", "response": ["#redirectCharles Hallé"]}]}}