{"wiki_id": "http://www.wikidata.org/entity/Q657039", "itemLabel": "Frank Sinclair", "itemDescription": "Jamaican footballer (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Sinclair", "wikipedia_page": {"main": "Frank Mohammed Sinclair (born 3 December 1971) is an English-born Jamaican former professional football player and manager and current assistant manager at Doncaster Rovers.\nHe made 756 league and cup appearances in a 25-year playing career, scoring 27 goals. A defender, he began his career at Chelsea, turning professional in May 1990 and then making his debut in the Football League in April 1991. He played on loan at West Bromwich Albion from December 1991 and March 1992. He established himself in the first-team back at Chelsea during the 1992–93 Premier League campaign and went on to be named as the club's Player of the Year for 1993. He played on the losing side in the 1994 FA Cup final, before picking up a winners medal after Chelsea beat Middlesbrough 2–0 in the 1997 final. Chelsea also won the League Cup by beating Middlesbrough 2–0 in the final the following year, and Sinclair scored the opening goal in extra-time. Chelsea also won the UEFA Cup Winners' Cup in 1998, though Sinclair was ruled out of the final due to injury.\nHe was sold on to Leicester City in August 1998 for a fee of £2 million. He won his second League Cup final in 2000, as Leicester defeated Tranmere Rovers 2–1. He spent a total of six seasons at Leicester, five of which were spent in the Premier League, the exception being the 2002–03 First Division promotion campaign. He joined Championship club Burnley on a free transfer in June 2004 and served as club captain from January 2005 to summer 2006. He joined League One side Huddersfield Town on an emergency loan in February 2007, which became a permanent transfer in the summer. He dropped into League Two to join Lincoln City in July 2008, who loaned him out to Wycombe Wanderers in March 2009; he helped Wycombe to win promotion out of League Two at the end of the 2008–09 season. He then spent the next two seasons in the Conference with Wrexham, before playing for Hendon in November 2011 and Colwyn Bay in January 2012.\nBorn in England, he was called up to represent Jamaica at the 1998 CONCACAF Gold Cup, and played five games as the team finished in fourth-place after losing to Brazil in the third-place play-off match. He also played all three of his country's games at the 1998 FIFA World Cup. He went on to feature twice in the 2000 CONCACAF Gold Cup and ended his international career in October 2003 after a total of 28 caps.\nSinclair was appointed as player-manager at Colwyn Bay in February 2013 and was named as Conference North Manager of the Month in April and December 2013. He went on to serve Brackley Town as caretaker-manager in October 2015 and served as Hednesford Town manager from December 2015 to April 2016. He later spent time as a coach at Stoke City, Radcliffe, Port Vale and Doncaster Rovers. He is the father of fellow professional footballer Tyrese Sinclair.\nHe was appointed assistant manager at Doncaster Rovers on 30th December 2021.", "link_mentions": [{"page": "Chelsea F.C.", "response": ["|1993|| Frank Sinclair"]}, {"page": "December 3", "response": ["*  1971   – Frank Sinclair, English-Jamaican footballer and manager"]}, {"page": "1971", "response": ["* December 3 – Frank Sinclair, Jamaican footballer"]}, {"page": "Leicester City F.C.", "response": ["*  Frank Sinclair (17 Caps, 26 May 1999)"]}, {"page": "John Terry", "response": ["In 2002, Terry was involved in an altercation with a bouncer at a West London nightclub with Chelsea teammate Jody Morris and Wimbledon's Des Byrne, which led to him being charged with assault and affray. In August 2002, Terry was acquitted of the charges in court. During the affair, he was given a temporary ban from the English national team by The Football Association. Previously, along with Chelsea teammates Frank Lampard, Jody Morris, Eiður Guðjohnsen and former teammate Frank Sinclair, in September 2001 Terry was fined two weeks wages by Chelsea after drunkenly harassing grieving American tourists in the immediate aftermath of the September 11 attacks. During his early days at Chelsea, Terry shared a flat with Andrew Crofts."]}, {"page": "Doncaster Rovers F.C.", "response": ["|Assistant Manager || Frank Sinclair"]}, {"page": "Dennis Wise", "response": ["Wise captained the Chelsea team that defeated Middlesbrough 2–0 in the 1997 FA Cup Final, only the club's second FA Cup triumph and Wise's first trophy as Chelsea captain. Chelsea's success would continue in the 1997–98 season as Wise first led Chelsea to victory in the League Cup, another 2–0 win against Middlesbrough, the midfielder's cross for Frank Sinclair's opener capping a superb display. Wise also made a decisive contribution in the Cup Winners' Cup final, a dinked pass over the Stuttgart defence setting up Gianfranco Zola to score the winner, moments after coming on as a substitute."]}, {"page": "2003–04 in English football", "response": ["*5 March 2004: Three Leicester City players – Paul Dickov, Keith Gillespie and Frank Sinclair – were charged with sexual assault while on a training camp in La Manga, Spain."]}, {"page": "Association football culture", "response": ["In 2004, the Leicester City trio of Paul Dickov, Frank Sinclair and Keith Gillespie spent a week in prison after being accused of sexual assault while on a training break at the La Manga resort in Spain with their team. However, the case was dropped after forensic evidence showed the accusations to be baseless. Although the players accused were ultimately innocent, the scandal led to a media outcry about footballers and their behaviour, especially with regard to children who look up to them."]}, {"page": "Neil Shipperley", "response": ["Shipperley got his break in football at the age of 15, when playing for Spartan League side Brook House in the Middlesex Charity Cup. The tournament's patron, celebrity astrologer Russell Grant, was friends with Chelsea chairman Ken Bates, whose club sent a team to the tournament. Shipperley bettered Chelsea centre-back Frank Sinclair for strength and pace, and was scouted by the club. An article in The Independent in January 1994 predicted that Shipperley could become Chelsea's first homegrown star striker since Peter Osgood in the 1960s."]}, {"page": "Eiður Guðjohnsen", "response": ["In September 2001, Eiður, Chelsea teammates John Terry, Frank Lampard and Jody Morris, and Leicester City's Frank Sinclair, were drunk and unruly in a Heathrow Airport hotel containing many Americans left stranded by the September 11 attacks. The Chelsea quartet were each fined two weeks' wages, totalling around £100,000, which was donated to the 9/11 relief efforts."]}, {"page": "Paul Dickov", "response": ["In March 2004, Dickov, along with Leicester City teammates Keith Gillespie and Frank Sinclair, was falsely accused of sexual assault while at a training camp in La Manga, Spain. All three were subsequently cleared when forensic tests showed the allegations were false. Dickov would later describe it as the \"darkest period\" of his footballing career."]}, {"page": "Micky Adams", "response": ["He was in charge for the first game at the Walkers Stadium. Despite a good start to their campaign, the club fell into the relegation zone in the new year. Adams was clearly resentful of lucrative long-term contracts dealt out to his less talented players by previous managers, which restricted his ability to bring in fresh faces to boost their campaign. Leicester slipped back down again in 2003–04 to 18th place, bracketed together with the two other relegated sides — Leeds United and Wolverhampton Wanderers — whose goal difference was inferior to Leicester's. The \"Foxes\" were becoming a \"yo-yo club\" and Adams blamed this on a lack of investment. During March 2004 nine Leicester players were arrested for various offences related to a drunken outing that ended with an alleged sexual assault on three German tourists, with three players being charged: Paul Dickov, Frank Sinclair and Keith Gillespie. The three faced up to fourteen years in prison if found guilty of rape, and the trio's bail totalled £196,500. The club had already been rocked by various incidents on overseas tours over years, with Stan Collymore arrested for setting off a fire extinguisher in 2000, and Dennis Wise breaking Callum Davidson's jaw in a row over a card game in 2002. Adams had previously initiated a crackdown in club discipline, going so far as to enforce random breathalyser tests. Adams said that \"in a lot of people's eyes, the players are guilty before they have had a fair trial – which is not the case\". The incident also cast doubt over Adams' future at the club, as reports surfaced that he planned to quit the club. He did in fact offer his resignation, which was rejected by the club. However, he kept faith in his players' innocence, and claimed \"if they are guilty of anything it is of being unprofessional – of being drunk to excess\". His faith was later vindicated when it transpired that all allegations against the players were false."]}, {"page": "Richmond Park (football ground)", "response": ["|Frank Sinclair"]}, {"page": "Jody Morris", "response": ["In September 2001, Morris, Chelsea teammates John Terry, Frank Lampard and Eiður Guðjohnsen, and Leicester City's Frank Sinclair, were drunk and unruly in a Heathrow Airport hotel containing many Americans left stranded by the September 11 attacks. The Chelsea quartet were each fined two weeks' wages, totalling around £100,000, which was donated to the 9/11 relief efforts."]}]}}