{"wiki_id": "http://www.wikidata.org/entity/Q658826", "itemLabel": "Martin Smith", "itemDescription": "English musician, born 1970", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Smith_(English_musician)", "wikipedia_page": {"main": "Martin James Smith (born 6 July 1970) is an English vocalist, guitarist, songwriter, and producer. Smith was the front man of the Christian rock and worship band Delirious?. When Delirious? disbanded in 2009, Smith became a solo artist.", "link_mentions": [{"page": "Keith Green", "response": ["At the 20th anniversary of Green's death, Sparrow Records released another tribute album, Your Love Broke Through: The Worship Songs of Keith Green. The 2002 album contains re-recordings by Rebecca St. James, Michelle Tumes, Chris Tomlin, Twila Paris, Darlene Zschech, Jason Upton, Martin Smith, Charlie Hall, Joanne Hogg, Matt Redman, Paul Oakley, and Sarah Sadler. The album contains contemporary Christian and mainstream artist Michael W. Smith's version of the song \"There Is One\", an unfinished work by Green. Composition of the song was completed by Smith, along with British songwriter and Christian music artist Martin Smith."]}, {"page": "Delirious?", "response": ["Delirious? (formerly known as The Cutting Edge Band) were an English contemporary Christian band. For the majority of their career, the lineup featured Martin Smith on vocals and guitar, Stu G (full name Stuart Garrard) on guitar and backing vocals, Jon Thatcher on bass guitar, Tim Jupp on keys and piano, and Stew Smith on drums and percussion. During their final two years, drumming duties were assumed by Paul Evans.", "In the final years of their career, Delirious? began to place a strong focus on humanitarian issues in their music. Both Martin Smith and Stu G started charities. Drummer Stew Smith left the band at the end of April 2008, and it was announced via a press release on in July of the same year that Delirious? would soon embark on an indefinite and probably permanent hiatus from recording and touring in order to focus on these new projects. On 29 November 2009 they gave their final performance for a sold-out crowd at London's Hammersmith Apollo and have now officially disbanded.", "The origins of Delirious? stretch back to 1992. The band began life as a collection of musicians, known simply as 'The Cutting Edge Band'. The group's function was to be a Christian worship band for a youth outreach event called \"Cutting Edge\", instigated by the Arun Community Church in Littlehampton, West Sussex. The first members were Tim Jupp and Martin Smith, who became friends while working together at a recording studio. There they decided to form a band. Jupp had previously released an instrumental album titled \"Hooked On Ishmael\". Originally, Jupp fronted the band, which also contained youth worker and drummer Stew Smith. Several different musicians filled the role of guitarist and bass player. The events became popular via word-of-mouth, leading the band to play at other 'Cutting Edge' events along the south coast of England – monthly events in Portsmouth and Southampton. The events in Portsmouth only lasted a year but the events in Central Hall, Southampton were to run for three years, the duration of the Cutting Edge events. The group remained as the house band for Cutting Edge for several years, and they began to record and release the 'Cutting Edge' cassette tapes. The turnout at the events grew so much that the regular venue (a local school hall) had to be replaced with the school's sports hall, whilst the organizers had to charge a small fee to control the numbers attending. Similar challenges took place at the Central Hall in Southampton where up to 1200 people would gather each month. In 1996, an event was held in the open air, on the green next to Littlehampton's beach. An estimated 4000 people attended, while Channel 4 filmed it for a documentary.", "The band were able to release their increasingly popular material thanks to lead singer Martin Smith and keyboardist Tim Jupp's roles as recording engineers and producers at a local recording studio. During this period, the lineup of the band began to take shape. Permanent guitar duties were taken up by Stu G shortly after the release of the band's first EP, whilst Jon Thatcher became permanent bassist for the band's fourth release, 'Cutting Edge Fore'. In total, four EPs were released under the \"Cutting Edge\" name, in addition to a solo EP from guitarist Stu Garrard, which featured the entire band. Many of the band's most famous songs were written and recorded during this time, including possibly their most famous: 'I Could Sing Of Your Love Forever.' Others included 'The Happy Song', 'Lord, You Have My Heart', 'Thank You For Saving Me', 'Did You Feel The Mountains Tremble?', 'I've Found Jesus', 'I'm Not Ashamed', 'Find Me In The River', 'Shout To The North', 'All I Want Is You' and 'Obsession'. The music became well known in Christian circles, and demand grew for recordings. By 1996, they had sold over seventy thousand EPs by mail order. These EPs were later released as two albums in the UK, and one double album in the US. A similar composite edition of Cutting Edge was released to retail and achieved 'Gold' status in Canada.", "thumb|right|upright|Frontman Martin Smith performing in 2006", "Away from the band, many of the members have started work on, or announced, future projects that they intended to pursue after the band ended in November 2009. Lead singer Martin Smith intends pursuing the Compassionart project, the decision that triggered the split. Smith has written an autobiography titled 'Delirious', providing a detailed account of his life and time with the band. It was released in February 2011, alongside a similar autobiography from his wife Anna, which provides an alternative perspective on the band's history. Smith has also been writing songs and leading worship at conferences around the world. A new website, launched to coincide with the autobiography, hints at future plans to 'record' and 'tour'.", "However, in spite of all of these new projects, Martin Smith has hinted that the band may reunite some day.", "* Martin Smith – lead vocals, rhythm guitar (1992–2009)", " bar:Martin    text:Martin Smith"]}, {"page": "Audio Lessonover?", "response": ["The album's lyrical content differs somewhat from previous albums, including several love songs. Martin Smith said of the first single, \"Waiting for the Summer\", \"The song came about because we were travelling to Brighton everyday and in usual style it was raining... We thought we'd write a song about waiting for the summer because we used to say to each other, 'I can't wait for summer'. It's a love song about being with my lady in summer, laughing and dancing around.\" Another track, \"There is an Angel\", was written by Smith about \"waking up one night and seeing my wife asleep in bed next to me and just thinking, God, I could mess this up if I'm not careful. She's the angel you've put in my life and I need to protect what you've given me.\" Smith has said that the song is his all-time favourite.", "# \"Waiting for the Summer\" (Martin Smith, Stuart Garrard) – 3:25"]}, {"page": "World Service (Delirious? album)", "response": ["# \"Grace Like a River\" (Stuart Garrard, Martin Smith) – 4:06"]}, {"page": "Touch (Delirious? album)", "response": ["# \"Touch\" (Martin Smith, Stuart Garrard) – 4:58"]}, {"page": "Matt Redman", "response": ["Matt recorded his first album, Wake Up My Soul, at ICC studios in January and February 1994. The album had an impressive line-up of Christian musicians including Iona's Mike Haughton, percussionist Martin Neil, Split Level's Adrian Thompson, Helen Burgess and Les Moir on bass, and was produced by Martin Smith."]}, {"page": "King of Majesty", "response": ["# \"Did You Feel The Mountains Tremble?\" (Martin Smith) - 04:58"]}, {"page": "King of Fools (album)", "response": ["Delirious? were originally known as \"The Cutting Edge Band\" before 1996. They played regularly at the \"Cutting Edge\" Christian events held in their hometown of Littlehampton. In August 1995, a major car accident involving lead singer Martin Smith, his wife, and bassist Jon Thatcher, left the former was badly injured. The song \"August 30th\" was inspired by these events. Smith went through a period of depression,Interview With Martin Smith https://www.youtube.com/watch?v=NCXgBRVCwnE before being partly inspired by Bill Flanagan's book U2: At the End of the World, which he read in hospital, to take the band full-time. The members of the band decided to resign from their respective jobs and become professional musicians. Delirious? soon began working on songs for their first full studio album.", "*Martin Smith – lead vocals, guitar"]}, {"page": "UP: Unified Praise", "response": ["# \"I Could Sing Of Your Love Forever\"/\"God's Romance\" (Martin Smith) — 08:13"]}, {"page": "Youth Conference (Christian)", "response": ["* Martin Smith"]}, {"page": "Kevin & Perry Go Large", "response": ["* Dominic Glynn & Martin Smith – \"Onslaught\""]}, {"page": "Mezzamorphis", "response": ["Following their breakthrough 1997 album King of Fools, Delirious? started recording Mezzamorphis in February 1998, and continued to record throughout that year, interspersed with summer tours throughout the US and UK. The band began recording with roughly half the songs already written, and continued writing as they recorded. Most of the recording took place in an old school in West Sussex. In the words of lead vocalist Martin Smith, \"We turned a classroom into a control room, and there were some wooden rooms where students used to dine, in which we set up a drum kit with different mike positions. We did the bulk of it there for the first six months in between touring. In the end, we went to a smaller studio in Ford just to finish it off.\" (delirious.org.uk mirror) The band used movable drapes to experiment with different drum sounds and reverbs; most of the drums on the album are thus natural and unprocessed.", "In the United States, the Virgin marketed version omitted two songs (\"Kiss Your Feet\" and \"Jesus' Blood\") that were included on the Sparrow version. Each of these contained explicit faith references. Additionally, the album caused some controversy in the US Christian music scene due to the lyric \"she's as pretty as hell\" in the song \"It's OK\". The band had left the song off promotional copies of the album, and Sparrow Records had considered leaving the song off the album; (delirious.org.uk mirror) several Christian retailers dropped the album amongst the complaints. Smith wrote a response to the controversy on the band's website; (delirious.org.uk mirror) however, many fans continued to believe that the band had left Christian rock for the secular industry. The band also received criticism for the lack of the word \"Jesus\" on the album. \"We recognise the ultimate validity of the criticisms leveled against us,\" responded lead singer Martin Smith, \"and we feel as a band that this just speaks to the spiritual and intellectual maturity of our listening audience and Christians in general, for that matter.\"", "# \"Mezzanine Floor\" (Martin Smith, Stuart Garrard) – 3:44", "* Martin Smith - vocals, guitar, recording of sounds to tape"]}, {"page": "Tim Hughes", "response": ["He is a member of Compassionart, a charity founded by musician Martin Smith, the front man of Delirious?.", "On 11 March 2011, a fourth studio album was released, Love Shine Through. The recording was produced by Martin Smith and featured musicians Marc James, Michael Guy Chislet and members of Northern Irish band, Rend Collective Experiment.", "On 17 July 2015 Hughes released his fifth studio album, Pocketful of Faith. The album was produced by Nathan Nockels and includes songwriting collaborations with Martin Smith, Matt Redman, Reuben Morgan, Phil Wickham, Jonas Myrin and Tim's Worship Central teammates Nick Herbert, Luke Hellebronth and Ben Cantelon."]}, {"page": "Access:d", "response": ["# \"Access:d Part 1 (Touch)\" (Martin Smith, Stuart Garrard) – 1:44"]}, {"page": "D tour 1997 Live at Southampton", "response": ["# \"Sanctify\" – (Martin Smith)", "* Martin Smith – vocals, guitar"]}, {"page": "Intimacy (Matt Redman album)", "response": ["* Martin Smith – acoustic guitars, lead and backing vocals (8)"]}, {"page": "The Friendship and the Fear", "response": ["* Martin Smith – guitars "]}, {"page": "Passion for Your Name", "response": ["The album was recorded at West Park Studios in Littlehampton, England with audio engineer Martin Smith.", "#\"It's Rising Up\" (Redman, Martin Smith) – 7:12", "* Martin Smith – mandolin, backing vocals, group vocals", "* Martin Smith – producer, recording, mixing  "]}, {"page": "List of Christian worship music artists", "response": ["* Martin Smith"]}, {"page": "Redemption Songs", "response": ["The band enlists vocals of friends including The Blind Boys of Alabama (\"Nothing But the Blood,\" \"On Jordan's Stormy River Banks I Stand\"), Sarah Kelly (\"I'll Fly Away\") and Martin Smith (\"Let Us Love and Sing and Wonder\"). Recorded at Jars' Nashville-based Sputnik Studio, Redemption Songs is co-produced by band members and long-time collaborator, Mitch Dane.", "* Martin Smith – vocals"]}, {"page": "Martin Smith", "response": ["Martin Smith may refer to:", "*Martin Smith (drummer) (1946–1997), British drummer for Gentle Giant and Simon Dupree and the Big Sound", "*Martin Smith (potter) (born 1950), English potter and professor of ceramics and glass", "*Martin Smith (entertainer) (1957–1994), British actor, singer and composer", "*Martin Smith (documentarian) (born 1949), American filmmaker for the series Frontline", "*Martin Smith (English musician) (born 1970), English vocalist, guitarist and songwriter, previously front man of Delirious?", "*Martin Smith (film maker), Scottish BAFTA winning writer/director of Tracks", "*Martin Smith (activist) (born 1963), British political activist", "*Martin Smith (swimmer) (born 1958), British swimmer", "*Martin Smith (footballer, born 1974), British former professional footballer", "*Martin Smith (snooker player) (born 1961), British snooker player", "*Martin Smith (footballer, born 1995), British footballer", "*Martin Smith (figure skater) (born 1968), Canadian ice dancer", "*Martin Smith (academic), British Professor of Robotics at Middlesex University, and President of the Cybernetics Society, London, UK", "*Martin Smith (designer) (born 1949), British automobile designer", "*Martin Smith (Royal Marines officer) (born 1962), Commandant General Royal Marines"]}, {"page": "Deeper (Delirious? song)", "response": ["Category:Songs written by Martin Smith (English musician)"]}, {"page": "Grace Like Rain", "response": ["#\"Only One Thing\" (Agnew, Collins, Martin Smith) – 4:03"]}, {"page": "I Could Sing of Your Love Forever", "response": ["\"I Could Sing of Your Love Forever\" is a popular Christian rock and worship song by the English contemporary Christian band Delirious?. The song's popularity has reached far beyond the band's; CCLI places the song among the 30 most-sung worship songs in the United StatesWord Music Now - CCLI Top 100 chart and has been called a \"modern worship classic\". According to Martin Smith, the author of the song:", ":\"That song just wrote itself in about five minutes. The same chords the whole way through the song. I mean that's embarrassing really! It was just a little ditty. Did it at church. It was good but I don't think it really blew anybody away. It wasn't like, 'Oh Martin's written the most amazing song!' I still don't really think it is. But yes, that song, that moment changed our lives really. It's been one of the most sung songs in America and around the world. It's crazy really, this little ditty that we don't really do anymore. It's been great.\"Delirious?: Martin Smith gives his most revealing interview ever; Cross Rhythms; Retrieved March 26, 2008", "Category:Songs written by Martin Smith (English musician)"]}, {"page": "Stu G", "response": ["He served as the lead guitarist, backing vocalist, and secondary songwriter for the rock band Delirious? from 1994 until 2009. His song writing credits for the band include \"Come Like You Promise\", \"Metamorphis\", and \"Pursuit of Happiness\". His most famous work is probably \"Majesty (Here I Am)\" (written with Delirious? lead singer Martin Smith). Stu G has also produced his own solo material, and released his first album in 1995. He is also a member of the songwriter's charity CompassionArt.", "In a documentary coinciding with the Delirious? live DVD Now is the Time, Martin Smith claimed of Stu G that he \"can't think of many guitarists that are better than him\".", "In 1996, Delirious? became a full-time band. During the writing sessions for their first album King of Fools, Stu G was the primary songwriter for the title track and the song 'All The Way', both of which he wrote with Martin Smith. He also served as the secondary songwriter on many other tracks on the album, including the bands international hit single \"Deeper\". Later in the year, the band embarked upon their first full UK tour. During this time, the band regularly played 'Come Like You Promise', the opening track from his 1995 solo album.", "Stu G wrote many popular songs for the band throughout the rest of their career. For their third album Glo, the band recorded  'Awaken The Dawn', a track which he had written in 1994 during his time as a solo recording artist. He shared lead vocals with Smith in 2001 on the Audio Lessonover? track 'Fire', something he later repeated on their European hit single 'Inside Outside' in 2003. In 2007, he wrote his first book, 'I Could Sing Of Your Love Forever', with Martin Smith, chronicling their times during the band.http://www.delirious.org.uk/features/icouldsingbook.html", "2007 - I Could Sing Of Your Love Forever - with Martin Smith", "Have You Heard? was recorded and released by Furious? Records in 1995. It features many members of Delirious? as guest musicians, whilst the lead singer of the band, Martin Smith, served as producer. It received a fairly positive review from Cross Rhythms. \"Like You Promise\" was later restyled as \"Come Like You Promise\", and released on the band's 1996 live album Live & In the Can, 1998 live album d:tour, 2001 single \"It's OK\", and 2002 compilation album Deeper. \"Absolutely Absolute\" was also released as a b-side to the band's 1997 single \"White Ribbon Day\"."]}, {"page": "History Maker", "response": ["The song is greatly extended live, generally featuring the \"Holy is the Lord\" bridge of \"God's Romance\" and an extemporaneous speech by Martin Smith. The guitar solo is also occasionally extended (up to 40 bars), and the chorus of the song \"Obsession\" is often included after the \"God's Romance\" section. Martin Smith often announces this song with the sentence \"This song is for all the history makers\" at live concerts.", "All profits generated from the single will go towards the charity CompassionArt a charity set up by Martin Smith the lead singer of the band which creates freedom from poverty.", "Category:Songs written by Martin Smith (English musician)"]}, {"page": "Paint the Town Red", "response": ["Category:Songs written by Martin Smith (English musician)"]}, {"page": "Inside Outside (Delirious? song)", "response": ["Category:Songs written by Martin Smith (English musician)"]}, {"page": "See the Star", "response": ["Category:Songs written by Martin Smith (English musician)"]}, {"page": "Covenant Awards", "response": ["* Special Events/Compilation Album of the Year: Sea to Sea: Filled With Your Glory, Producer Martin Smith", "* Special Events/Compilation Album of the Year: Sea to Sea: I See The Cross - Producer Martin Smith", "* Special Events/Compilation Album of the Year: Sea to Sea: For Endless Days - Producer Martin Smith", "* Special Events/Compilation Album of the Year: GMA Canada presents 30th Anniversary Collection - Producer Martin Smith", "* Special Events/Compilation of the Year: Sea to Sea: Christmas - Producer Martin Smith", "* Lifetime Achievement Award: Martin Smith"]}, {"page": "30th GMA Dove Awards", "response": ["* \"Deeper\"; Martin Smith, Stuart Gerrard; Curious Music (UK), Birdwing Music"]}, {"page": "Cutting Edge (recordings)", "response": ["At the time of recording, the band only consisted of lead singer and recording engineer Martin Smith, his friend and colleague Tim Jupp (who played keyboards) and drummer Stew Smith, who did youth work for the Cutting Edge events. Additional musicians were Dave Clifton (lead guitar), Jim Bryan (bass guitar), Martin Neil (percussion), along with backing vocals by Vanessa Gibbs, Helen Burgess and Andy Piercy. At the time, future bassist Jon Thatcher worked selling the tapes at the Cutting Edge events.", "All songs written by Martin Smith"]}, {"page": "List of Hillsong songs", "response": ["| rowspan=\"2\" | Did You Feel the Mountains Tremble? || rowspan=\"2\" | Martin Smith || King of Majesty (1) || 11", "| rowspan=\"2\" | History Maker || rowspan=\"2\" | Martin Smith || UP: Unified Praise || 11", "| I Could Sing of Your Love Forever/ God's Romance || Martin Smith || UP: Unified Praise || 5", "| Jesus' Blood || Martin Smith || More Than Life || 12", "| rowspan=\"2\" | Majesty || rowspan=\"2\" | Martin Smith  Stuart Garrard || More Than Life (1) || 6", "| Rain Down || Martin Smith  Stuart Garrard || UP: Unified Praise || 8", "| What a Friend I've Found || Martin Smith || UP: Unified Praise || 10"]}, {"page": "White Ribbon Day (song)", "response": ["Lead singer, Martin Smith wrote the song after being inspired by a news report from Northern Ireland that he had seen in early 1996. The report informed about casualties in the area. It mentioned a group of people who had adopted white ribbons as a symbol of hope. The report included the phrase \"The people pray for white ribbon day\". This line was included in the lyrics of the song.", "In light of the events of 11 September 2001, the song was released as a free download on the band's website.  Martin Smith remarked that it was \"not an attempt to gain popularity in light of the terrible events, but rather a change in the band's short-term plans.\"", "Category:Songs written by Martin Smith (English musician)"]}, {"page": "32nd GMA Dove Awards", "response": ["* \"I Could Sing of Your Love Forever\"; Martin Smith; Curious Music (BMI)", "* Martin Smith"]}, {"page": "Now Is the Time (Delirious? album)", "response": ["# \"Here I Am Send Me\" (Martin Smith, Stu Garrard, Jon Thatcher, Stewart Smith, Tim Jupp)"]}]}}