{"wiki_id": "http://www.wikidata.org/entity/Q660917", "itemLabel": "Walter Crane", "itemDescription": "British artist (1845-1915)", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Crane", "wikipedia_page": {"main": "Walter Crane (15 August 1845 – 14 March 1915) was a British artist and book illustrator. He is considered to be the most influential, and among the most prolific, children's book creators of his generation and, along with Randolph Caldecott and Kate Greenaway, one of the strongest contributors to the child's nursery motif that the genre of English children's illustrated literature would exhibit in its developmental stages in the later 19th century.\nCrane's work featured some of the more colourful and detailed beginnings of the child-in-the-garden motifs that would characterize many nursery rhymes and children's stories for decades to come. He was part of the Arts and Crafts movement and produced an array of paintings, illustrations, children's books, ceramic tiles, wallpapers and other decorative arts. Crane is also remembered for his creation of a number of iconic images associated with the international Socialist movement.\n\n", "link_mentions": [{"page": "August 15", "response": ["*1845 – Walter Crane, English artist and book illustrator (d. 1915)"]}, {"page": "Beatrix Potter", "response": ["Potter's artistic and literary interests were deeply influenced by fairy tales and fantasy. She was a student of the classic fairy tales of Western Europe. As well as stories from the Old Testament, John Bunyan's The Pilgrim's Progress and Harriet Beecher Stowe's Uncle Tom's Cabin, she grew up with Aesop's Fables, the fairy tales of the Brothers Grimm and Hans Christian Andersen, Charles Kingsley's The Water Babies,Lear 2007, pp. 30–1 the folk tales and mythology of Scotland, the German Romantics, Shakespeare,Lear 2007, p. 95. She liked to memorise his plays by heart. and the romances of Sir Walter Scott.Lear 2007, p. 35. Beatrix said she learnt to read \"on\" Scott As a young child, before the age of eight, Edward Lear's A Book of Nonsense, including the much loved The Owl and the Pussycat, and Lewis Carroll's Alice in Wonderland had made their impression, although she later said of Alice that she was more interested in Tenniel's illustrations than what they were about.Lear 2007, p. 34 The Brer Rabbit stories of Joel Chandler Harris had been family favourites, and she later studied his Uncle Remus stories and illustrated them.Lear 2007, p.131. She began eight Uncle Remus drawings in the same year 1893 she began writing the Peter Rabbit picture letters to Noel Moore, completing the last in 1896. She studied book illustration from a young age and developed her own tastes, but the work of the picture book triumvirate Walter Crane, Kate Greenaway and Randolph Caldecott, the last an illustrator whose work was later collected by her father, was a great influence.Lear 2007, p. 33 When she started to illustrate, she chose first the traditional rhymes and stories, \"Cinderella\", \"Sleeping Beauty\", \"Ali Baba and the Forty Thieves\", \"Puss-in-boots\", and \"Red Riding Hood\".Lear 2007, pp. 127–8 However, most often her illustrations were fantasies featuring her own pets: mice, rabbits, kittens, and guinea pigs.Taylor, et al., The Artist and her World, pp. 49–70;  Potter, Journal, 1884–1897; Humphrey Carpenter (1985), Secret Gardens: The Golden Age of Children's Literature."]}, {"page": "Pandora", "response": ["But an alternative interpretation of Pandora’s curiosity makes it merely an extension of childish innocence. This comes out in portrayals of Pandora as a young girl, as in Walter Crane’s “Little Pandora” spilling buttons while encumbered by the doll she is carrying,Victoria & Albert Museum in Arthur Rackham’s book illustrationWikimedia and Frederick Stuart Church’s etching of an adolescent girl taken aback by the contents of the ornamental box she has opened.Art of the Print The same innocence informs Odilon Redon’s 1910/12 clothed figure carrying a box and merging into a landscape suffused with light, and even more the 1914 version of a naked Pandora surrounded by flowers, a primaeval Eve in the Garden of Eden.Metropolitan Museum Such innocence, “naked and without alarm” in the words of an earlier French poet, portrays Pandora more as victim of a conflict outside her comprehension than as temptress.", "Henry Wadsworth Longfellow’s The Masque of Pandora dates from 1876. It begins with her creation, her refusal by Prometheus and acceptance by Epimetheus. Then in the latter’s house an “oaken chest, Carven with figures and embossed with gold” attracts her curiosity. After she eventually gives in to temptation and opens it, she collapses in despair and a storm destroys the garden outside. When Epimetheus returns, she begs him to kill her but he accepts joint responsibility.The Masque of Pandora and Other Poems, Boston 1876,  pp.3-54 The work was twice used as the basis for operas by Alfred Cellier in 1881 and by Eleanor Everest Freer in 1933.Margaret Ross Griffel, Operas in English: A Dictionary, Scarecrow Press 2013, p.309 Iconographical elements from the masque also figure in Walter Crane's large watercolour of Pandora of 1885. She is pictured as sprawled over a carved wooden chest on which are embossed golden designs of the three fates who figure as a chorus in Longfellow's scene 3. Outside the palace, a high wind is bending the trees. But on the front of the chest, a medallion showing the serpent wound about the tree of knowledge recalls the old interpretation of Pandora as a type of Eve.Wikimedia"]}, {"page": "Brothers Grimm", "response": ["In Germany,  was also released in a \"popular poster-sized  (broadsides)\" format and in single story formats for the more popular tales, such as \"Hansel and Gretel\". The stories were often added to collections by other authors without respect to copyright as the tales became a focus of interest for children's book illustrators, with well-known artists such as Arthur Rackham, Walter Crane, and Edmund Dulac illustrating the tales. A popular edition that sold well was released in the mid-19th century and included elaborate etchings by George Cruikshank. At the deaths of the brothers, the copyright went to Hermann Grimm (Wilhelm's son) who continued the practice of printing the volumes in expensive and complete editions. However, the copyright lapsed after 1893 and various publishers began to print the stories in many formats and editions. In the 21st century,  is a universally recognized text, commonly called Grimms' Fairy Tales in English. Jacob and Wilhelm's collection of stories has been translated to more than 160 languages with 120 different editions of the text available for sale in the US alone."]}, {"page": "One Thousand and One Nights", "response": ["Famous illustrators for British editions include: Arthur Boyd Houghton, John Tenniel, John Everett Millais and George John Pinwell for Dalziel's Illustrated Arabian Nights Entertainments, published in 1865; Walter Crane for Aladdin's Picture Book (1876); Frank Brangwyn for the 1896 edition of Lane's translation; Albert Letchford for the 1897 edition of Burton's translation; Edmund Dulac for Stories from the Arabian Nights (1907), Princess Badoura (1913) and Sindbad the Sailor & Other Tales from the Arabian Nights (1914). Others artists include John D. Batten, (Fairy Tales From The Arabian Nights, 1893), Kay Nielsen, Eric Fraser, Errol le Cain, Maxfield Parrish, W. Heath Robinson and Arthur Szyk (1954)."]}, {"page": "Arts and Crafts movement", "response": ["Morris and his followers believed the division of labour on which modern industry depended was undesirable, but the extent to which every design should be carried out by the designer was a matter for debate and disagreement. Not all Arts and Crafts artists carried out every stage in the making of goods themselves, and it was only in the twentieth century that that became essential to the definition of craftsmanship. Although Morris was famous for getting hands-on experience himself of many crafts (including weaving, dying, printing, calligraphy and embroidery), he did not regard the separation of designer and executant in his factory as problematic. Walter Crane, a close political associate of Morris's, took an unsympathetic view of the division of labour on both moral and artistic grounds, and strongly advocated that designing and making should come from the same hand. Lewis Foreman Day, a friend and contemporary of Crane's, as unstinting as Crane in his admiration of Morris, disagreed strongly with Crane. He thought that the separation of design and execution was not only inevitable in the modern world, but also that only that sort of specialisation allowed the best in design and the best in making.Designer and Executant: An Argument Between Walter Crane and Lewis Foreman Day  Few of the founders of the Arts and Crafts Exhibition Society insisted that the designer should also be the maker. Peter Floud, writing in the 1950s, said that \"The founders of the Society ... never executed their own designs, but invariably turned them over to commercial firms.\"Peter Floud, \"The crafts then and now\", The Studio, 1953, p.127 The idea that the designer should be the maker and the maker the designer derived \"not from Morris or early Arts and Crafts teaching, but rather from the second-generation elaboration doctrine worked out in the first decade of [the twentieth] century by men such as W. R. Lethaby\".", "Many of the Arts and Crafts movement designers were socialists, including Morris, T. J. Cobden Sanderson, Walter Crane, C.R. Ashbee, Philip Webb, Charles Faulkner, and A. H. Mackmurdo. In the early 1880s, Morris was spending more of his time on promoting socialism than on designing and making. Ashbee established a community of craftsmen called the Guild of Handicraft in east London, later moving to Chipping Campden. Those adherents who were not socialists, such as Alfred Hoare Powell, advocated a more humane and personal relationship between employer and employee. Lewis Foreman Day was another successful and influential Arts and Crafts designer who was not a socialist, despite his long friendship with Crane.", "In 1887 the Arts and Crafts Exhibition Society, which gave its name to the movement, was formed with Walter Crane as president, holding its first exhibition in the New Gallery, London, in November 1888.Parry, Linda, William Morris and the Arts and Crafts Movement: A Sourcebook, New York, Portland House, 1989  It was the first show of contemporary decorative arts in London since the Grosvenor Gallery's Winter Exhibition of 1881. Morris & Co. was well represented in the exhibition with furniture, fabrics, carpets and embroideries. Edward Burne-Jones observed, \"here for the first time one can measure a bit the change that has happened in the last twenty years\". The society still exists as the Society of Designer Craftsmen.", "-- Walter Crane, \"Of The Revival of Design and Handicraft\", in Arts and Crafts Essays, by Members of the Arts and Crafts Exhibition Society, 1893", "Arts and Crafts practitioners in Britain were critical of the government system of art education based on design in the abstract with little teaching of practical craft. This lack of craft training also caused concern in industrial and official circles, and in 1884 a Royal Commission (accepting the advice of William Morris) recommended that art education should pay more attention to the suitability of design to the material in which it was to be executed.Charles Harvey and Jon Press, \"William Morris and the Royal Commission on Technical Instruction\", Journal of the William Morris Society  11.1, August 1994, pp. 31-34  The first school to make this change was the Birmingham School of Arts and Crafts, which \"led the way in introducing executed design to the teaching of art and design nationally (working in the material for which the design was intended rather than designing on paper). In his external examiner's report of 1889, Walter Crane praised Birmingham School of Art in that it 'considered design in relationship to materials and usage.'\"\"Birmingham Institute of Art and Design\" fineart.ac.uk Under the direction of Edward Taylor, its headmaster from 1877 to 1903, and with the help of Henry Payne and Joseph Southall, the Birmingham School became a leading Arts-and-Crafts centre.", "Other local authority schools also began to introduce more practical teaching of crafts, and by the 1890s Arts and Crafts ideals were being disseminated by members of the Art Workers Guild into art schools throughout the country. Members of the Guild held influential positions: Walter Crane was director of the Manchester School of Art and subsequently the Royal College of Art; F.M. Simpson, Robert Anning Bell and C.J.Allen were respectively professor of architecture, instructor in painting and design, and instructor in sculpture at Liverpool School of Art; Robert Catterson-Smith, the headmaster of the Birmingham Art School from 1902 to 1920, was also an AWG member; W. R. Lethaby and George Frampton were inspectors and advisors to the London County Council's (LCC) education board and in 1896, largely as a result of their work, the LCC set up the Central School of Arts and Crafts and made them joint principals. Until the formation of the Bauhaus in Germany, the Central School was regarded as the most progressive art school in Europe. Shortly after its foundation, the Camberwell School of Arts and Crafts was set up on Arts and Crafts lines by the local borough council."]}, {"page": "Children's literature", "response": ["Rudyard Kipling published The Jungle Book in 1894. A major theme in the book is abandonment followed by fostering, as in the life of Mowgli, echoing Kipling's own childhood. In the latter years of the 19th century, precursors of the modern picture book were illustrated books of poems and short stories produced by English illustrators Randolph Caldecott, Walter Crane, and Kate Greenaway. These had a larger proportion of pictures to words than earlier books, and many of their pictures were in colour. Some British artists made their living illustrating novels and children's books, among them Arthur Rackham, Cicely Mary Barker, W. Heath Robinson, Henry J. Ford, John Leech, and George Cruikshank. In the 1890s, some of the best known fairy tales from England were compiled in Joseph Jacobs' English Fairy Tales, including Jack and the Beanstalk, Goldilocks and the Three Bears, The Three Little Pigs, Jack the Giant Killer and Tom Thumb.", "Early children's books, such as Orbis Pictus, were illustrated by woodcut, and many times the same image was repeated in a number of books regardless of how appropriate the illustration was for the story. Newer processes, including copper and steel engraving were first used in the 1830s. One of the first uses of Chromolithography (a way of making multi-colored prints) in a children's book was demonstrated in Struwwelpeter, published in Germany in 1845. English illustrator Walter Crane refined its use in children's books in the late 19th century. "]}, {"page": "Art Nouveau", "response": ["File:Swan and Rush and Iris wallpaper Walter Crane.jpg|Swan, rush and iris wallpaper design by Walter Crane (1883)", "The new art movement had its roots in Britain, in the floral designs of William Morris, and in the Arts and Crafts movement founded by the pupils of Morris. Early prototypes of the style include the Red House with interiors by Morris and architecture by Philip Webb (1859), and the lavish Peacock Room by James Abbott McNeill Whistler. The new movement was also strongly influenced by the Pre-Raphaelite painters, including Dante Gabriel Rossetti and Edward Burne-Jones, and especially by British graphic artists of the 1880s, including Selwyn Image, Heywood Sumner, Walter Crane, Alfred Gilbert, and especially Aubrey Beardsley.Bouillon, Jean-Paul, Journal de l'Art Nouveau (1985), p. 6 The chair designed by Arthur Mackmurdo has been recognized as a precursor of Art Nouveau design.https://collections.vam.ac.uk/item/O7926/chair-mackmurdo-arthur-heygate/", "Other important innovators in Britain included the graphic designers Aubrey Beardsley whose drawings featured the curved lines that became the most recognizable feature of the style. Free-flowing wrought iron from the 1880s could also be adduced, or some flat floral textile designs, most of which owed some impetus to patterns of 19th century design. Other British graphic artists who had an important place in the style included Walter Crane and Charles Ashbee."]}, {"page": "The Faerie Queene", "response": ["The Edwardian era was particularly rich in adaptation for children, and the works richly illustrated, with contributing artists including A. G. Walker, Gertrude Demain Hammond, T. H. Robinson, Frank C. Papé, Brinsley Le Fanu and H. J. Ford. Additionally, Walter Crane illustrated a six-volume collection of the complete work, published 1897, considered a great example of the Arts and Crafts movement.", "*, in six volumes illustrated by Walter Crane"]}, {"page": "Golders Green Crematorium", "response": ["* Walter Crane, English artist and book illustrator"]}, {"page": "Woodcut", "response": ["A number of different methods of colour printing using woodcut (technically Chromoxylography) were developed in Europe in the 19th century. In 1835, George Baxter patented a method using an intaglio line plate (or occasionally a lithograph), printed in black or a dark colour, and then overprinted with up to twenty different colours from woodblocks. Edmund Evans used relief and wood throughout, with up to eleven different colours, and latterly specialized in illustrations for children's books, using fewer blocks but overprinting non-solid areas of colour to achieve blended colours. Artists such as Randolph Caldecott, Walter Crane and Kate Greenaway were influenced by the Japanese prints now available and fashionable in Europe to create a suitable style, with flat areas of colour."]}, {"page": "Kate Greenaway", "response": ["The headmaster at the Royal Female School of Art was Richard Burchett, whom Elizabeth Thompson described as a \"bearded, velvet-skull-capped and cold-searching-eyed man.\" Greenaway was quite shy and thought of herself as plain and unattractive compared to the other students. Yet she became friends with the much more popular Thompson, with whom she shared a studio.Spielmann, 43 The two young women worked diligently in their studio to perfect their skills. At this point she was allowed to draw human figures, at first from plaster casts and then from models dressed in historical or ornamental costumes, skills she applied during the summers in Rolleston. However she was unable to fully master human anatomy;Carpenter, 226 frustrated that nude models were not permitted in the women's classes, she enrolled in night classes at Heatherley School of Fine Art where she met Edward Burne-Jones, Edward Poynter and Walter Crane.", "Greenaway's paintings were reproduced by chromoxylography, by which the colours were printed from hand-engraved wood blocks by the firm of Edmund Evans.Color Printing in the 19th century. University of Delaware.Retrieved September 18, 2017 Through the 1880s and 1890s, her only rivals in popularity in children's book illustration were Walter Crane and Randolph Caldecott.", "*'Quiver of Love, a Collection of Valentines' (with Walter Crane), Marcus Ward, 1876."]}, {"page": "Picture book", "response": ["Toy books were introduced in the latter half of the 19th century, small paper bound books with art dominating the text. These had a larger proportion of pictures to words than earlier books, and many of their pictures were in color. The best of these were illustrated by the triumvirate of English illustrators Randolph Caldecott, Walter Crane, and Kate Greenaway whose association with colour printer and wood engraver Edmund Evans produced books of great quality.Hunt, p. 674 In the late 19th and early 20th century a small number of American and British artists made their living illustrating children's books, like Rose O'Neill, Arthur Rackham, Cicely Mary Barker, Willy Pogany, Edmund Dulac, W. Heath Robinson, Howard Pyle, or Charles Robinson. Generally, these illustrated books had eight to twelve pages of illustrated pictures or plates accompanying a classic children's storybook."]}, {"page": "1893 in literature", "response": ["*Walter Crane – Columbia's Courtship"]}, {"page": "Austin Osman Spare", "response": ["In 1900, Spare left St. Agnes School and gained employment at Sir Joseph Causton and Sons, a company that focused on the design of posters. Not wanting the commitment of an apprenticeship, after nine months he quit this job and instead began working as a designer at Powell's glass-working business in Whitefriars Street, which had links to the Arts and Crafts movement and William Morris. In the evenings he attended the Lambeth School of Art. Two visitors to Powell's, Sir William Blake Richmond and FH Richmond RBA, came across some of Spare's drawings, and impressed, they recommended him for a scholarship to the Royal College of Art (RCA) in South Kensington.Baker 2011. pp. 16–17. He achieved further attention when his drawings were exhibited in the British Art Section of the St. Louis Exposition and the Paris International Exhibition, and in 1903 he won a silver medal at the National Competition of Schools of Art, where the judges, who included Walter Crane and Byam Shaw, praised his \"remarkable sense of colour and great vigour of conception.\"Baker 2011. p. 17."]}, {"page": "Hypnerotomachia Poliphili", "response": ["The psychologist Carl Jung admired the book, believing the dream images presaged his theory of archetypes. The style of the woodcut illustrations had a great influence on late nineteenth century English illustrators, such as Aubrey Beardsley, Walter Crane, and Robert Anning Bell."]}, {"page": "Big Bad Wolf", "response": ["File:Walter Crane26.jpg|\"The better to see you with\": woodcut by Walter Crane "]}, {"page": "The Yellow Book", "response": ["The Yellow Book brilliant colour immediately associated the periodical with illicit French novels - an anticipation, many thought, of the scurrilous content inside. The article 'A Defence of Cosmetics' by Max Beerbohm appeared in the first volume, causing something of a sensation and establishing his reputation. Yet generally The Yellow Book first list of contributors bespoke a non-radical, typically conservative collection of authors: Edmund Gosse, Walter Crane, Frederick Leighton, and Henry James among others."]}]}}