{"wiki_id": "http://www.wikidata.org/entity/Q6612761", "itemLabel": "R. F. Patrick Cronin", "itemDescription": "British cardiologist (1926-2007)", "wikipedia_url": "https://en.wikipedia.org/wiki/R._F._Patrick_Cronin", "wikipedia_page": {"main": "Robert Francis Patrick Cronin FRCPC FACP FRCP (1 September 1926 – 13 January 2007) was a cardiologist, researcher, professor, and healthcare consultant, who served as Dean of the Faculty of Medicine at McGill University from 1972 to 1977.\nCronin was born in London, the son of the celebrated Scottish writer and doctor, A.J. Cronin, and May Gibson, also a physician. His family moved to the United States at the outbreak of World War II, eventually moving to Greenwich, Connecticut. He had been a boarder at Ampleforth College in England, and upon moving to the U.S., he attended Portsmouth Abbey School.  One of his classmates there was Robert F. Kennedy, and Cronin later dated Ethel Skakel before her marriage to Kennedy.\nHaving skipped a few grades, he enrolled at Princeton University at the age of sixteen, though he interrupted his study when he enlisted in the Royal Canadian Air Force in 1943, training as a tail gunner at the Borden Base.  He transferred to the British Army between 1945 and 1947, where he helped with demilitarization and reconstruction in England. In January 1948, Cronin re-enrolled at Princeton and finished two more years before attending medical school at McGill and earning his MD in 1953.  He received his MRCP in 1955 and went to London to train at Hammersmith Hospital and the Brompton Hospital. Upon his return to Canada, he worked at the Montreal General Hospital as a cardiologist, an internist, and a researcher.\nCronin became widely recognized for his work in developing countries.  In the early 1960s, he initiated an exchange program between McGill and local doctors in Nairobi, Kenya, and he later worked for the Osler Medical Aid Foundation, now known as the McGill International Health Initiative. Additionally, he collaborated with the Canadian International Development Agency to set up student exchange programs with Kenya, Kuwait, Bahrain, Qatar, Ethiopia, Pakistan and Tunisia. Known for his eye for logistics, Cronin was recruited by the Aga Khan in 1976, in an advisory capacity, to help set up a teaching hospital in Karachi.  For the next fifteen years, he continued to work for the Aga Khan Health Services, overseeing the construction and operation of hospitals and healthcare facilities in Tanzania, Pakistan, and Nairobi, as well as setting up their curriculum for educating medical personnel.\nCronin later learned that he had not received his wartime equivalency degree at Princeton, as these were only conferred upon American students. Not having his undergraduate degree always bothered him, so in 1999, at the age of seventy-three, he enrolled once again at Princeton in order to resume the Bachelor of Arts degree which he had begun fifty years earlier. He took three courses, wrote his senior thesis, and was finally awarded his degree on 30 May 2000. He received an A.B. in history after completing a 73-page long senior thesis, titled \"Tainted Blood: A Brief History of Blood Transfusion from the 17th Century Onwards\", under the supervision of Angela Creager. In 2005, having taken 89 years and 111 days to earn this degree, he received a citation in the Guinness Book of World Records as the student who had spent the longest time in an undergraduate program.\nIn 1954, Cronin married a Canadian, Sis Robertson, and they had three children. He died of pneumonia on 13 January 2007, in Territet, Montreux, Switzerland.", "link_mentions": [{"page": "Cronin", "response": ["* R. F. Patrick Cronin (1926–2007), dean of the Faculty of Medicine at McGill University and healthcare consultant"]}, {"page": "Royal Brompton Hospital", "response": ["*R. F. Patrick Cronin Cardiologist"]}, {"page": "List of McGill University people", "response": ["* R. F. Patrick Cronin (MD 1953) – cardiologist; Dean of the Faculty of Medicine at McGill (1972–1977); healthcare consultant"]}, {"page": "Portsmouth Abbey School", "response": ["* R. F. Patrick Cronin, 1942, dean of faculty of medicine at McGill University (1972–1977)."]}, {"page": "Index of World War II articles (R)", "response": ["# R. F. Patrick Cronin"]}]}}