{"wiki_id": "http://www.wikidata.org/entity/Q66124085", "itemLabel": "David Wallace", "itemDescription": "Scottish surgeon (1862-1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Wallace_(surgeon)", "wikipedia_page": {"main": "Sir David Wallace, KBE, CBE, CMG., LL.D, FRCSEd. (14 July 1862 – 21 April 1952) was a Scottish surgeon working in Edinburgh, with a particular interest in urological surgery. During the Boer War he was in charge of the Edinburgh South African Hospital, an experience which impressed upon him the importance of the Red Cross movement in reducing and mitigating the horrors of war. Becoming active in the British Red Cross Society, he was instrumental in forming the Edinburgh branch and was its Chairman for over 30 years.  He was knighted in 1920 and elected President of the Royal College of Surgeons of Edinburgh in 1921.", "link_mentions": [{"page": "Dean Cemetery", "response": ["* Sir David Wallace (1862–1952) urologist"]}, {"page": "David Wallace", "response": ["* David Wallace (American actor) (born 1958), American actor", "* David Wallace (Scottish actor), Scottish actor and theatre director", "* David Wallace (The Office), fictional CEO of Dunder Mifflin on the US TV series The Office", "* David Wallace (composer) (born 1982), Irish composer and conductor", "* David Wallace (Indiana politician) (1799–1859), American politician, governor of the state of Indiana", "* David Wallace (catcher) (born 1979), American professional baseball player", "* David Wallace (footballer), New Zealand international football (soccer) player", "* David Wallace (rugby union) (born 1976), Irish rugby union player", "* David Wallace (executive) (1908–1974), Ford executive", "* Sir David Wallace (physicist) (born 1945), British physicist and Master of Churchill College, Cambridge", "* Sir David Wallace (surgeon) (1862–1952), Scottish surgeon", "* David Wallace (medievalist), British scholar of medieval literature", "*David Wallace-Wells,  American journalist"]}, {"page": "Dollar Academy", "response": ["* 1923 Sir David Wallace, FP ", "*Sir David Wallace, CMG, FRCSEd, Surgeon"]}, {"page": "Thomas Clouston", "response": ["He died in Edinburgh on 19 April 1915. He is buried in Dean Cemetery in Edinburgh with his wife Dame Harriet Secur Storer (1835-1917). The grave lies on the obscured southern terrace. His daughter, Augusta Maud Clouston CBE (1871-1960) lies to the side, with her husband Sir David Wallace (1862-1952)."]}, {"page": "List of presidents of the Royal College of Surgeons of Edinburgh", "response": ["*1921–23 Sir David Wallace"]}]}}