{"wiki_id": "http://www.wikidata.org/entity/Q6615528", "itemLabel": "William Maynard", "itemDescription": "English footballer (1853-1921)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Maynard_(footballer)", "wikipedia_page": {"main": "William John Maynard (18 March 1853 – 2 September 1921)  was an English footballer who played for England, firstly as a forward and later in goal, in the first international match against Scotland.", "link_mentions": [{"page": "1850s in association football", "response": ["* 18 March – William Maynard (d. 1921), England international in 1872 who played in the first official international match."]}, {"page": "Alexander Morten", "response": ["The Football Association secretary, Charles Alcock, wanted to field Morten as goalkeeper in the international match against Scotland in 1872, but injury prevented this, with the result that England played the first international with Robert Barker in goal for the first half, being replaced by William Maynard at some point in the second half."]}, {"page": "1872 Scotland v England football match", "response": ["At half-time, both teams rotated the goalkeeping duties among their players: England from Robert Barker to William Maynard, and Scotland from Gardner to Robert Smith.", "|FW ||||William Maynard", "William Maynard (1st Surrey Rifles)"]}, {"page": "Robert Barker (footballer)", "response": ["He was selected to play in goal for England's first ever international match against Scotland on 30 November 1872. The original selection for goalkeeper, Alexander Morten, was unavailable and, according to Graham Betts in \"England – Player by player\", \"Barker was chosen (to play in goal) because he was the biggest and slowest player in the England team and because his rugby experience and handling of the ball would come in useful\" Barker kept a clean sheet for the first half and at some point in the game he switched places with William Maynard. At 25 years, 165 days Barker was the oldest player in the England line-up."]}, {"page": "William Maynard", "response": ["William Maynard may refer to:", "*William Maynard, 1st Baron Maynard (1586–1640)", "*William Maynard, 2nd Baron Maynard (1620s–1689)", "*William Maynard (footballer) (1853–1921), English football player", "*Sir William Maynard, 1st Baronet (1641–1685), English MP for Essex 1685", "*Sir William Maynard, 4th Baronet (1721–1772), English MP for Essex 1759–1772"]}, {"page": "Alfred Maynard", "response": ["Alfred Frederick Maynard (23 March 1894 – 13 November 1916) was an English rugby union player.  He was the son of William Maynard, former international association footballer.  He won 3 caps as a hooker in the 1914 Five Nations Championship.  He was killed at Beaumont Hamel in the First World War when serving as a lieutenant in the Royal Naval Division and is commemorated on the Thiepval Memorial."]}]}}