{"wiki_id": "http://www.wikidata.org/entity/Q6655820", "itemLabel": "Marie de St Pol", "itemDescription": "Foundress of Pembroke College, Cambridge", "wikipedia_url": "https://en.wikipedia.org/wiki/Marie_de_St_Pol", "wikipedia_page": {"main": "Marie de St Pol, Countess of Pembroke (c. 1303 – 1377) was the second wife of Franco-English nobleman Aymer de Valence, 2nd Earl of Pembroke, and is best known as the foundress of Pembroke College, Cambridge.", "link_mentions": [{"page": "Pembroke College, Cambridge", "response": ["Marie de St Pol, Countess of Pembroke (1303–1377), a member of the de Châtillon family of France, founded Pembroke College, Cambridge. On Christmas Eve 1347, Edward III granted Marie de St Pol, widow of the Earl of Pembroke, the licence for the foundation of a new educational establishment in the young university at Cambridge. The Hall of Valence Mary (\"Custos & Scolares Aule Valence Marie in Cantebrigg'\"), as it was originally known, was thus founded to house a body of students and fellows. The statutes were notable in that they both gave preference to students born in France who had already studied elsewhere in England, and that they required students to report fellow students if they indulged in excessive drinking or visited disreputable houses."]}, {"page": "1347", "response": ["* December 24 – Pembroke College in the University of Cambridge, England, is founded by Marie de St Pol, Countess of Pembroke, as the Hall of Valence Marie."]}, {"page": "1377", "response": ["* March 16 or March 17 – Marie de St Pol, Countess of Pembroke and Foundress of Pembroke College, Cambridge (b. c.1303)"]}, {"page": "Isabella of France", "response": ["As the years went by, Isabella became very close to her daughter Joan, especially after Joan left her unfaithful husband, King David II of Scotland, who was imprisoned by her brother in the Tower of London at the time where she visited him once.Doherty, p. 175. Joan also nursed her just before she died. She doted on her grandchildren, including Edward, the Black Prince. She became increasingly interested in religion as she grew older, visiting a number of shrines.Doherty, pp. 175–6. She remained, however, a gregarious member of the court, receiving constant visitors; amongst them appear to have been her friend Marie de St Pol, Countess of Pembroke, and her cousin Henry of Grosmont, Duke of Lancaster.Doherty, p. 177. King Edward and his children often visited her as well. She remained interested in Arthurian legends and jewellery; in 1358 she appeared at the St George's Day celebrations at Windsor wearing a dress made of silk, silver, 300 rubies, 1800 pearls and a circlet of gold. She may also have developed an interest in astrology or geometry towards the end of her life, receiving various presents relating to these disciplines.Weir 2006, p. 371."]}, {"page": "Earl of Pembroke", "response": ["William's eldest surviving son, Aymer (c. 12751324), succeeded to his father's estates, but was not formally recognized as Earl of Pembroke until after the death of his mother Joan in 1307. He was appointed guardian of Scotland in 1306, but with the accession of Edward II to the throne and the consequent rise of Piers Gaveston to power, his influence declined. He became prominent among the discontented nobles, but in 1312, after the Earl of Warwick betrayed him by executing the captured Gaveston, he left the allied lords and joined the King. Valence was present at Bannockburn in 1314, and later helped King Edward defeat Thomas of Lancaster. However, by his death in 1324, he was again marginalized at court, and in financial trouble as well. His wife, Marie de St Pol, a descendant of King Henry III, was the founder of Pembroke College, Cambridge.", "Pembroke College, Cambridge, established in 1347, is named for its founder, Marie de St Pol, Countess of Pembroke, (1303-1377), wife of Aymer de Valence, 2nd Earl of Pembroke of the third creation."]}, {"page": "Elizabeth de Clare", "response": ["Elizabeth's brother-in-law, Hugh Despenser the younger, lord of Glamorgan, became a particular favourite of King Edward II. With the support of the king he began to take over the adjacent lordships in south Wales, with the aim to consolidate a huge landholding by fair means or foul. He concentrated on the lordships held by his sisters-in law and their husbands: Margaret and Hugh D'Audley (lordship of Gwynllwg or Newport), and Elizabeth and Roger Damory (lordship of Usk). Faced with this threat, the Marcher lords of south Wales, led by Damory, rose up against Despenser in May 1321 capturing his castles at Caerphilly and Cardiff. Their success contributed to the king's banishment of Hugh and his father on 14 August that year. This success was only short-lived as the king recalled the Despensers in October 1321 and launched a counter-offensive against the Marcher lords and their allies. Elizabeth was taken prisoner at Usk Castle in January 1322, and imprisoned in Barking Abbey, London, with her husband dying two months later. Elizabeth was forced by the king to exchange her lordship of Usk with Despenser's less-valuable lordship of Gower. The rebellion of Queen Isabella and her lover Roger Mortimer, saw King Edward II and Hugh Despenser flee to south Wales in October 1326. By this date Elizabeth seems to have been back in residence at Usk Castle, and she regained this lordship after Despenser's execution. She held a very elaborate Christmas feast that year in Usk Castle, perhaps partly in celebration of her adversary's death, for which the long list of food and drink survives (see the National Archives PRO E101/91/14). She also undertook building works at Usk and nearby Llangibby Castles, where she would entertain her friends, Marie de St Pol, countess of Pembroke, first amongst these. She stayed at Usk from October 1348 until April 1350, perhaps to escape the Black Death."]}, {"page": "Saint-Pol-sur-Ternoise", "response": ["Saint-Pol-sur-Ternoise was the birthplace of Marie de St Pol (c1303-1377), foundress of Pembroke College, Cambridge."]}, {"page": "Aymer de Valence, 2nd Earl of Pembroke", "response": ["Though earlier historians saw Pembroke as the head of a \"middle party\", between the extremes of Lancaster and the king, the modern consensus is that he remained essentially loyal to Edward throughout most of his career. Pembroke was married twice, and left no legitimate issue, though he did have a bastard son. He is today remembered primarily through his wife Marie de St Pol's foundation of Pembroke College, Cambridge, and for his splendid tomb that can still be seen in Westminster Abbey. He was also an important figure in the wars surrounding the attempted English occupation of Scotland.", "William de Valence died in 1296, and Aymer inherited his father's French lands, but had to wait until his mother died in 1307 to succeed to the Earldom. In 1320, his first wife Béatrice de Clermont died. In 1321, Aymer married his second wife Marie de St Pol. Through inheritance and marriages his lands consisted ofapart from the county palatine in Pembrokeshireproperty spread out across England primarily in a strip from Gloucestershire to East Anglia, in south-east Ireland (Wexford), and French lands in the Poitou and Calais areas.", "Aymer married twice; his first marriage, before 1295, was to Beatrice, daughter of Raoul de Clermont, Lord of Nesle in Picardy and Constable of France. Beatrice died in 1320, and in 1321 he married Marie de St Pol, daughter of Guy de Châtillon, Count of St Pol and Butler of France. He never had any legitimate children, but he had an illegitimate son, Henry de Valence, whose mother is unknown. Pembroke's most lasting legacy is probably through his second wife, who in 1347 founded Pembroke College, Cambridge.Jennifer C. Ward, 'St Pol, Mary de, countess of Pembroke (c.1304–1377)', Oxford Dictionary of National Biography (Oxford, 2004). The family arms are still represented on the dexter side of the college arms. Aymer de Valence was buried in Westminster Abbey, where his tomb effigy can still be seen as a splendid example of late gothic architecture, elaborating on the design of the nearby tomb of Edmund Crouchback, Earl of Lancaster.P. Binski, Westminster Abbey and the Plantagenets: Kingship and the Representation of Power, 1200–1400 (New Haven 1995), pp. 118–9, 176–7; M. Prestwich, Plantagenet England 1225–1360 (Oxford, 2005), p. 565."]}, {"page": "William de Valence, 1st Earl of Pembroke", "response": ["* Aymer de Valence, 2nd Earl of Pembroke and Wexford in 1296 (c. 127023 June 1324), married first to Beatrice de Clermont and second to Marie de Châtillon-sur-Marne (Also known as Marie de St Pol). He left no legitimate issue. "]}, {"page": "Joan of England (died 1348)", "response": ["Joan of England (19 December 1333 or 28 January 1334 – 1 July 1348)Mortimer, I. The Perfect King: The Life of Edward III Father of the English Nation. Vintage Books London, 2006. was a daughter of Edward III and his wife, Philippa of Hainault. Joan, also known as Joanna, was born in the Tower of London. As a child she was placed in the care of Marie de St Pol, wife of Aymer de Valence and foundress of Pembroke College, Cambridge. She grew up with her sister Isabella, her brother Edward, and their cousin Joan of Kent, and she died in the Black Death that struck Europe in 1348."]}, {"page": "1340s in England", "response": ["** 24 December – Pembroke College in the University of Cambridge is founded by Marie de St Pol, Countess of Pembroke, as the Hall of Valence Marie."]}, {"page": "House of Châtillon", "response": ["*Marie de St Pol (c.1303–1377), foundress of Pembroke College, Cambridge"]}, {"page": "Marie of Saint-Pol", "response": ["#redirect Marie de St Pol"]}, {"page": "Fotheringhay Castle", "response": ["During the Second Barons' War, Fotheringhay and Chester Castle were taken by Robert de Ferrers, 6th Earl of Derby. He held them from 1264 to 1265. Edward II granted Fotheringhay Castle to John of Brittany, Earl of Richmond. When John died in 1334, his niece Marie de St Pol, the widowed countess of Pembroke, inherited Fotheringhay Castle. She died in 1377, and Edward III gave her property over to his son, Edmund Langley. In 1385, he was made Duke of York by the king and Fotheringhay Castle became his principal seat. According to John Leland writing in 1540, Langley spent a great deal on Fotheringhay Castle., n. 10 Langley died in 1402 and was succeeded by his eldest son, Edward. He died without children of his own in 1415, so his property passed to his nephew Richard."]}, {"page": "John de St Paul", "response": ["The St Paul family  are  thought to have come to Yorkshire from Guienne.Ball, F. Elrington The Judges in Ireland 1221–1921 John Murray London 1926 Vol. 1 p. 80 They  may have had  a family connection to the Counts of Saint-Pol, since Marie de St Pol, Countess of Pembroke, often employed  John as her attorney.Carlyle p.173"]}, {"page": "Walter Devereux (died 1402)", "response": ["On 10 November 1388 Walter Devereux witnessed John de Cornewaile of Kinlet’s grant of warranty for life to Cornewaile's mother of two thirds of the manor of Ashton, Herefordshire, if she should outlive his father, Sir Brian. On 28 June 1390 he was place on a commission of Oyer and terminer in addition to his role as Justice of the Peace for Herefordshire. On 15 July Devereux was on the commission conducting the inquiry post-mortem of John Hastings, 3rd Earl of Pembroke, who had died before coming of age. He was directed to inquire what lands had been held in dower at the death of the earl's widowed mother, Anne Manny, on 3 April 1384, and the widow of Aymer de Valence, 2nd Earl of Pembroke, Marie de St Pol, on her death 16 March 1377. On 27 October 1391 there were adjustments to the rent of the lordship of Bergevenny based on his findings."]}, {"page": "Mary de St Pol", "response": ["#REDIRECT Marie de St Pol"]}, {"page": "Marie de St. Pol", "response": ["#REDIRECT Marie de St Pol"]}]}}