{"wiki_id": "http://www.wikidata.org/entity/Q6667154", "itemLabel": "Logan Scott-Bowden", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Logan_Scott-Bowden", "wikipedia_page": {"main": "Major General Logan Scott-Bowden,  (21 February 1920 – 9 February 2014) was a British army officer.  A Royal Engineers officer during World War II, he was the first commander of the Ulster Defence Regiment.  Retiring as a Major General in 1974, he served as the Colonel-Commandant of the Royal Engineers from 1975 to 1980.", "link_mentions": [{"page": "February 9", "response": ["*  2014   – Logan Scott-Bowden, English general (b. 1920)"]}, {"page": "Omaha Beach", "response": ["When General Omar Bradley expressed concern about Omaha Beach in January, a Royal Engineers team of Captain Logan Scott-Bowden and Sergeant Bruce Ogden-Smith showed him a sample of sand from the beach. They had swum ashore in Normandy from midget submarines over thirty times, to obtain sand samples to see whether the beaches would support tanks. Scott-Bowden said to him \"Sir, I hope you don't mind me saying it, but this beach is a very formidable proposition indeed and there are bound to be tremendous casualties.\" Bradley put his hand on Scott-Bowden's shoulder and replied, \"I know, my boy. I know.\"\t"]}, {"page": "Operation Gambit", "response": ["A similar operation had been offered to the US landing forces to mark their beaches but this was declined. The team of Captain Logan Scott-Bowden and Sergeant Bruce Ogden-Smith did investigate Omaha Beach for General Omar Bradley, returning with a sand sample. The submarines were at some risk of damage due to friendly fire and to avoid this, Lieutenant George Honour the captain of X23 flew a White Ensign of the size more normally used by capital ships."]}, {"page": "Ulster Defence Regiment", "response": ["General Sir John Anderson GCB, KCB DSO (5th Royal Inniskilling Dragoon Guards) was appointed as the first Colonel Commandant. He came to be known as the \"Father of the Regiment\".Ryder p70 The first regimental commander was a WW2 veteran of some distinction, Brigadier Logan Scott-Bowden CBE DSO MC & Bar.", "* Brigadier Logan Scott-Bowden CBE DSO MC and Bar; Royal Engineers (first Commander UDR) * (1970–1971)"]}, {"page": "1920 in the United Kingdom", "response": ["* 21 February – Logan Scott-Bowden, army general (died 2014)"]}, {"page": "Operation Postage Able", "response": ["On New Year's Eve 1943/4, under the leadership of Major Logan Scott-Bowden of the Royal Engineers, a unit set out in motor torpedo boats to survey Luc-sur-Mer. Transferring to a hydrographical survey craft, they moved closer to shore where Major Logan Scott-Bowden and Sgt Bruce Ogden-Smith swam to the beaches. Collecting samples at designated points, they were careful not to leave behind evidence of their visit, and returned to England the next morning."]}, {"page": "Major General Logan Scott-Bowden", "response": ["#REDIRECT Logan Scott-Bowden"]}, {"page": "List of Old Malvernians", "response": ["* Major General Logan Scott-Bowden"]}, {"page": "1972 New Year Honours", "response": ["* Major-General (Acting) Logan Scott-Bowden, , (95182), late Corps of Royal Engineers."]}, {"page": "1964 Birthday Honours", "response": ["* Lieutenant-Colonel (now Colonel (temporary)) Logan Scott-Bowden,  (95182), Corps of Royal Engineers."]}, {"page": "2014 in the United Kingdom", "response": ["**Logan Scott-Bowden, 93, army general, first commander of the Ulster Defence Regiment (1970–1971)."]}, {"page": "Deaths in February 2014", "response": ["*Logan Scott-Bowden, 93, British military officer, first commander of the Ulster Defence Regiment (1970–1971).SCOTT-BOWDEN."]}, {"page": "General Scott", "response": ["*Logan Scott-Bowden (1920–2014), British Army major general"]}, {"page": "Scott-Bowden, Logan", "response": ["#redirectLogan Scott-Bowden"]}]}}