{"wiki_id": "http://www.wikidata.org/entity/Q6662798", "itemLabel": "Lloyd Wade", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Lloyd_Wade", "wikipedia_page": {"main": "Lloyd Wade  is an English gospel and soul singer and pop vocal coach from South London. He achieved some fame in the UK Christian music scene performing with his brothers Denis, Derek and David in the group the Wades in the 1990s, including a set at Champion of the World in Wembley Stadium in 1997.\nHe was working as a vocal coach and teacher of social behaviour in an inclusion (education) department when he appeared as a contestant in the 2004 series of The X Factor, and made the final 5 of the \"over 25\" category, which was mentored by Simon Cowell.\n\n", "link_mentions": [{"page": "The X Factor (British series 1)", "response": ["| Odis Palmer, Lloyd Wade"]}, {"page": "Beautiful World Tour 2007", "response": ["# \"Relight My Fire\" (contains elements of \"Vertigo\" and \"Crazy\") (featuring Lloyd Wade) ", "# \"Relight My Fire\" (contains elements of \"Vertigo\" and \"Crazy\") (featuring Lloyd Wade) "]}, {"page": "The Wades", "response": ["Current members of the band include brothers Derek, David and Lloyd Wade. A fourth brother Denis appeared on their debut album A Touch of Heaven, released in 1994. The four brothers were instrumental in the recording of the debut album which they all co-produced and co-wrote under the musical direction of Lloyd."]}, {"page": "Pack Up", "response": ["\"Pack Up\" is the second single by British recording artist Eliza Doolittle, taken from her debut album, Eliza Doolittle. It was released on 5 July 2010. The song lyrics contain the title of the 1915 song \"Pack Up Your Troubles in Your Old Kit-Bag\". The music contains elements of the 1963 ska song \"Wash Your Troubles Away\" by Prince Buster. Lloyd Wade sings the main hook with Eliza. The single was Eliza's debut in most European countries.", "In the video the Lloyd Wade \"pack up\" main hook line appears to be voiced first by an elderly keeper of a drapers' shop and later by the bass player of the dance band."]}, {"page": "Eliza Doolittle (album)", "response": ["* \"Pack Up\" features uncredited vocals from Lloyd Wade and contains elements of \"Pack Up Your Troubles in Your Old Kit-Bag\"", "*Lloyd Wade – vocals"]}, {"page": "Wade (surname)", "response": ["*Lloyd Wade, English gospel and soul singer, vocal coach"]}, {"page": "List of UK Independent Singles Breakers Chart number ones of the 2020s", "response": ["|Owen Westlake featuring Lloyd Wade"]}]}}