{"wiki_id": "http://www.wikidata.org/entity/Q6660732", "itemLabel": "Lizzie Mickery", "itemDescription": "British actor and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Lizzie_Mickery", "wikipedia_page": {"main": "Elizabeth Mickery is a British writer and former actress. She was known for her role as Maggie Thorpe in the BBC television drama series Tenko, roles in Emmerdale Farm, Juliet Bravo, Lovejoy, Heartbeat, Woof!, The Merryhill Millionaires, Dogfood Dan and the Carmarthen Cowboy and Holby City.", "link_mentions": [{"page": "The Thirty-Nine Steps", "response": ["The BBC commissioned a new television adaptation of the novel, scripted by Lizzie Mickery and produced by BBC Scotland's drama unit. The 90-minute film stars Rupert Penry-Jones, Lydia Leonard, Patrick Malahide and Eddie Marsan, and was first broadcast on 28 December 2008 A romantic subplot was added to the story, featuring Lydia Leonard. The storyline only very tenuously follows that of the book, many characters being renamed, or omitted altogether. The film ends with a scene involving a submarine in a Scottish loch, rather than the original setting off the Kent coast, and the apparent death of one character."]}, {"page": "Lizzie", "response": ["* Elizabeth Lizzie Mickery, British writer and former actress"]}, {"page": "Messiah (British TV series)", "response": ["Messiah I is the only series to be directly adapted from the novel, and deals with a serial killer who sets out to commit twelve murders in the same vein as the Apostles. The screenplay was written by Lizzie Mickery, who also wrote Messiah II and Messiah III. The series was broadcast over a May bank holiday weekend in 2001, on 26 (Saturday) and 27 (Sunday) May respectively. The series does have some major differences to the novel it was adapted from. For example; the final scenes in the novel take place at Easter 1999, traditionally the time when Judas Iscariot hanged himself. However, the events of the final scenes in the series take place on New Year's Eve 2000. In the novel, Red is seen crashing to the floor with his killer before crucifying them, similar to the death of Jesus Christ. However, in the series, Red's killer tries to hang him from his staircase, before Red and his wife manage to overpower him and he falls to his death from a great height. The way in which the killer falls to their death results in them lying on the floor in the shape of a cross. Red meanwhile manages to pull himself to safety. In the novel, Red hands himself in to the police having committed murder, is interviewed by DS Beauchamp and is subsequently sent to jail. However, in the series, Red is seen simply being taken away in a police car to give his side of the story as to how his killer died. Subsequently, he is found to have been at no fault, thus paving the way for the further serials. The novel also shows Red's marriage to his wife, Susan, falling apart and their subsequent split; however, in the series, this does not occur, and Susan appears in two further sequels. Also, it can be noted that the character of Susan is not deaf in the book, but is in the series.", "Messiah II was the first original screenplay written for the series, again written by Lizzie Mickery. The plot deals with a serial killer who murders all those implicated in the wrongful imprisonment of their father. The serial was originally scheduled for broadcast on the August bank holiday weekend of 2002, 24 and 25 August respectively, but was pulled at the last moment because of the Soham Murders; it was eventually broadcast in 2003, on 11 and 12 January respectively. Carl Orff's Fortune plango vulnera and O Fortuna were used as trailer music for the series.", "Messiah III was again written by Lizzie Mickery. The plot deals with a prison riot, during which a member of Red's team is held hostage and almost killed. A killer then begins to pick off everyone who threatened or harmed that officer. The series was again broadcast across an August bank holiday weekend, being broadcast on 30 and 31 August 2004 respectively. The first two pieces of Orff's Carmina Burana are used in the trailer for the series."]}, {"page": "List of Brookside characters", "response": ["|Angela Hobbs || Lizzie Mickery || 1982"]}, {"page": "Dirty War (film)", "response": ["Dirty War is a single British television drama film, co-written by Lizzie Mickery and Daniel Percival and directed by Percival, that first broadcast on BBC One on 26 September 2004. The film, produced in association with HBO Films, follows a terrorist attack on Central London where a \"dirty bomb\" is deployed. Principal cast members for the film include Louise Delamere, Alastair Galbraith, William El-Gardi, Martin Savage, Koel Purie, Helen Schlesinger, Ewan Stewart and Paul Antony-Barber."]}, {"page": "The State Within", "response": ["The State Within is a six-part British television political thriller series, written and created by Lizzie Mickery and Daniel Percival, that was broadcast on BBC One in the United Kingdom from Thursday, 2 November 2006. The series, directed by Percival and Michael Offer and produced by Grainne Marmion, is a joint production between BBC Films and BBC America that follows Sir Mark Brydon (Jason Isaacs), the British Ambassador to Washington, who is caught in the centre of a political conspiracy threatening to depose Western governments. As such, he must prevent a war, all whilst facing his own personal dilemmas."]}, {"page": "List of time travel works of fiction", "response": ["| Lizzie Mickery"]}, {"page": "Mike Bullen", "response": ["He worked on other projects at the same time as Cold Feet: After watching the 1997 docusoap Holiday Reps, he became interested in what happens in the personal lives of holiday representatives while in foreign countries. Out of this idea he developed Sunburn for BBC One.Rees, Jasper (17 January 1999). \"Sun, sea, sand and … Cyprus \". The Independent (Independent News & Media): p. 8 (Television section). Sunburn starred Michelle Collins and was broadcast for two series from 1999 to 2000. Bullen shared writing duties with Lizzie Mickery and Sally Wainwright. His inspiration from American television continued; following the premiere of The West Wing in 1999, he began outlining a British version, The Firm, that would be set in Buckingham Palace. The project never moved beyond planning stages because Bullen believed that British political issues such as \"cod wars with Spain\" are not as \"sexy\" as the issues covered in The West Wing.Bedell, Geraldine (17 March 2002). \"The affairs of state\". The Observer (Guardian News & Media): p. 10 (Observer Review supplement)."]}, {"page": "The Beggar Bride", "response": ["*Lizzie Mickery as Sandra Baines", "*Script: Lizzie Mickery and Gillian White (novel)"]}, {"page": "List of former Emmerdale characters", "response": ["|Liz MacDonald || Lizzie Mickery || 1977, 1984–1986, 1988, 1990"]}, {"page": "Sunburn (TV series)", "response": ["Sunburn was a British television series that followed the lives of a group of British holiday reps. It was broadcast on BBC One between 16 January 1999 and 1 May 2000, running for two series of six and eight episodes respectively. The first was set and filmed in Cyprus and the second in Algarve. The cast included Michelle Collins, Rebecca Callard, Sharon Small, George Layton and Sean Maguire, with Paul Nicholas joining later. The series was created by Mike Bullen, who was interested in the behind-the-scenes lives of holiday reps after watching the docusoap Holiday Reps.  Bullen wrote most of the first series but scaled back his involvement in the second; most of that series' episodes were written by Lizzie Mickery."]}, {"page": "Elizabeth Mickery", "response": ["#REDIRECT Lizzie Mickery"]}, {"page": "The 39 Steps (2008 film)", "response": ["The 39 Steps is a 2008 British television adventure thriller feature-length adaptation of the 1915 John Buchan novel The Thirty-Nine Steps produced by the BBC. It was written by Lizzie Mickery, directed by James Hawes, and filmed on location in Scotland, starring Rupert Penry-Jones, Lydia Leonard, David Haig, Eddie Marsan, and Patrick Malahide. Following three screen versions of the novel and the 1952 and 1977 television adaptations of The Three Hostages, Penry-Jones became the sixth actor to portray Hannay on screen. This adaptation is set on the eve of the First World War and sees mining engineer Richard Hannay caught up in an espionage conspiracy following the death of a British spy in his flat.", "Announced by the BBC in August 2008, filming began in September 2008 for a first broadcast at Christmas. Penry-Jones, who had previously worked on the spy drama Spooks, took the lead role, with the screenplay written by Lizzie Mickery (co-writer of the dramas The State Within and Messiah), produced by Lynn Horsford (Boy A, The Mark of Cain) and directed by James Hawes (Fanny Hill, Merlin, Doctor Who). Penry-Jones became the fifth actor to play Hannay on screen, preceded by Robert Donat, Kenneth More, Barry Foster, and Robert Powell."]}, {"page": "Paradox (British TV series)", "response": ["Paradox is a 2009 British science fiction police drama, starring Tamzin Outhwaite as Detective Inspector Rebecca Flint. Written by Lizzie Mickery and produced by Clerkenwell Films for the BBC, it was filmed and set in Manchester, England.", "Murray Ferguson, chief executive of Clerkenwell Films, said that they were looking for something \"different from the traditional formula of investigating a crime that has already taken place\" and premise for the series, the police having knowledge of future incidents, was developed. Lizzie Mickery (The 39 Steps, The State Within) was chosen to write the series. She said she has \"always been interested in the decisions you're not aware you are making\". The series was based on the \"moral and emotional implications of having the ability to change the future\". The series was then commissioned by Ben Stephenson and Jay Hunt for BBC One with executive producers Patrick Spence, for BBC Northern Ireland, and Ferguson. The series was produced by Marcus Wilson and directed by Simon Cellan Jones and Omar Madha. Filming began in Greater Manchester, England in June 2009, with the majority of filming in the Northern Quarter district of the City of Manchester. The Imperial War Museum North is used as the backdrop for Dr King's place of employment, Prometheus Labs."]}, {"page": "Bradford Girls' Grammar School", "response": ["* Lizzie Mickery, British writer and former actress."]}, {"page": "Instinct (TV serial)", "response": ["Instinct is a two-part drama serial which premièred on ITV on 26 February 2007. It was created and written by Lizzie Mickery, and produced by Tightrope Pictures for ITV. The serial follows Detective Chief Inspector Thomas Flynn, played by Anthony Flanagan, as he hunts a serial killer in the Lancashire Pennines, while dealing with a troubled personal life."]}, {"page": "List of Emmerdale Farm characters (1988)", "response": ["| The daughter of Jock (Drew Dawson) and Liz MacDonald (Lizzie Mickery). When Jock and Liz separate, Judy goes to live with her mother."]}, {"page": "The Right Stuff (TV series)", "response": ["On February 10, 2019, it was announced during the Television Critics Association's annual winter press tour that National Geographic had given the production a series order. David Nutter was expected to direct the premiere episode. Additional executive producers were set to include Mark Lafferty and Lizzie Mickery with Lafferty also serving as showrunner."]}]}}