{"wiki_id": "http://www.wikidata.org/entity/Q666955", "itemLabel": "Francis Hemming", "itemDescription": "English entomologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Hemming", "wikipedia_page": {"main": "Arthur Francis Hemming (9 February 1893 – 22 February 1964) was an English entomologist who specialised in Lepidoptera. He was mostly known, both professionally and socially, by his middle-name as Francis Hemming.\nHemming was a British civil servant and amateur lepidopterist. An expert in biological nomenclature, he served from 1937 to 1958 as Secretary to the International Commission on Zoological Nomenclature and was founder and editor of the Bulletin of Zoological Nomenclature. Over his lifetime he published more than 1,000 scientific papers on Lepidoptera. His manuscripts and other papers are deposited in the Natural History Museum in London and at the Bodleian Library, Oxford.\nHemming was educated at Rugby School, and Corpus Christi College, Oxford. During World War I he was severely wounded in 1916, and in 1918 he joined the British Civil Service. He was private secretary to several ministers and was granted the C.M.G. and C.B.E. for his services, especially in the revision of the International Code of Zoological Nomenclature (often jokingly referred to as the Hemming Code) that was officially adopted in 1958.\nThe genus Nabokovia (Lycaenidae) was named by Hemming in 1960, in honor of the novelist and entomologist Vladimir Nabokov, whose earlier generic name was found by Hemming to be a junior homonym. Nabokov invited Hemming to provide the substitute name.First married to Vera Montague Murray in 1924 (marriage dissolved in 1932) with whom he had one son, Christopher Francis Hemming. Second marriage to novelist Marjorie McLean Firminger (Jam To-Day, 1930) on 1 June 1933, third marriage in 1947 to Margaret Francis Waley Joseph (b. April 29, 1910), with whom he had two daughters, Rachel Cecilia Waley Hemming (b. 1947) and Judith Frances Waley Hemming (b. 1948).\nHemming won international recognition for his decades of dedicated service to zoological nomenclature and to entomology.\n\n", "link_mentions": [{"page": "Passenger pigeon", "response": ["In 1827 William John Swainson moved the passenger pigeon from the genus Columba to the new monotypic genus Ectopistes, due in part to the length of the wings and the wedge shape of the tail. In 1906 Outram Bangs suggested that because Linnaeus had wholly copied Catesby's text when coining C. macroura, this name should apply to the passenger pigeon, as E. macroura. In 1918 Harry C. Oberholser suggested that C. canadensis should take precedence over C. migratoria (as E. canadensis), as it appeared on an earlier page in Linnaeus' book. In 1952 Francis Hemming proposed that the International Commission on Zoological Nomenclature (ICZN) secure the specific name macroura for the mourning dove, and the name migratorius for the passenger pigeon, since this was the intended use by the authors on whose work Linnaeus had based his description. This was accepted by the ICZN, which used its plenary powers to designate the species for the respective names in 1955."]}, {"page": "Mourning dove", "response": ["To resolve the confusion over the binomial names of the two species, Francis Hemming proposed in 1952 that the International Commission on Zoological Nomenclature (ICZN) secure the specific name macroura for the mourning dove and migratorius for the passenger pigeon, since this was the intended use by the authors on whose work Linnaeus had based his description. This was accepted by the ICZN, which used its plenary powers to designate the species for the respective names in 1955."]}, {"page": "Acropolis thalia", "response": ["Acropolis is a monotypic butterfly genus from the subfamily Satyrinae in the family Nymphalidae. The one species in the genus, Acropolis thalia, is distributed in western subtropical China. The genus was erected by Francis Hemming in 1934 based on a species described by John Henry Leech in 1891.", "Category:Taxa named by Francis Hemming"]}, {"page": "Hypermnestra helios", "response": ["According to Francis Hemming, Édouard Ménétries proposed the name Hypermnestra in 1846 as a replacement name for Ismene Nickerl, 1846, which is an invalid junior homonym of Ismene Savigny, 1816 and Ismene Swainson, 1820. However, the introduction of this name by Ménétriés was overlooked for a long time, and Hypermnestra was attributed either to Heydenreich 1851 or to Westwood, [1852]."]}, {"page": "Panoquina", "response": ["Category:Taxa named by Francis Hemming"]}, {"page": "Franz Anton Gottfried Frölich", "response": ["He is not to be confused with Josef Aloys Frölich, his father, also an entomologist but specialising in Coleoptera. Franz Anton Gottfried Frölich wrote several supplements to the works of Jacob Hubner — See Francis Hemming, \"Hübner: A bibliographical and systematic account of the entomological works of Jacob Hübner, and of the supplements thereto by Carl Geyer, Gottfried Franz von Frölich, and Gottlieb August Wilhelm Herrich-Schäffer\". London: Royal Entomological Society of London, 1937. 2 volumes.Google Books Hübner: A Bibliographical and Systematic Account of the Entomological Works, etc."]}, {"page": "Pistoria", "response": ["Category:Taxa named by Francis Hemming"]}, {"page": "Vindula", "response": ["Category:Taxa named by Francis Hemming"]}, {"page": "Arthur Francis Hemming", "response": ["#REDIRECT Francis Hemming"]}, {"page": "Baeotus", "response": ["Category:Taxa named by Francis Hemming"]}, {"page": "Bematistes", "response": ["Category:Taxa named by Francis Hemming"]}, {"page": "Higginsius", "response": ["Category:Taxa named by Francis Hemming"]}, {"page": "Bebearia", "response": ["Category:Taxa named by Francis Hemming"]}, {"page": "Polyommatus anthea", "response": ["Polyommatus anthea is a butterfly in the family Lycaenidae. It was described by Francis Hemming in 1932. It is found in Kurdistan and the Levant."]}, {"page": "Papilio ajax", "response": ["The zoological congress of 1948 in Paris entailed a lot of work for the commission, and processing of the application was delayed. Corbet died in May 1948. In 1950 Francis Hemming, secretary to the commission, issued a supplementary note on procedural problems. Its main issue was a second possible solution to the problem, seemingly overlooked by Corbet, that would secure nomenclatural stability. Other than suppressing the name ajax, it would also be possible to select a new type for the name, which would preserve the name for the Nearctic species to which it had been applied for some time. Corbet's application and Hemming's note were published at the same time in 1951 in The Bulletin of Zoological Nomenclature volume 2: 26-29 en 29-30. (1951). Proposed use of the Plenary Powers to suppress the trivial name ajax Linnaeus, 1758 (as published in the binominal combination Papilio ajax) commonly but incorrectly applied to the species named Papilio marcellus by Cramer in 1777 (Class Insecta, Order Lepidoptera). The Bulletin of Zoological Nomenclature 2(1): 26-29. (1951). On the proposal that the trivial name ajax Linnaeus, 1758 (as published in the binominal combination Papilio ajax) should be suppressed by the International Commission on Zoological Nomenclature under its Plenary Powers. The Bulletin of Zoological Nomenclature 2(1): 29-30."]}, {"page": "Celastrina gigas", "response": ["Celastrina gigas, the silvery hedge blue, is a small butterfly found in India that belongs to the lycaenids or blues family. The species was first described by Francis Hemming in 1928."]}]}}