{"wiki_id": "http://www.wikidata.org/entity/Q6662812", "itemLabel": "Lloyd White", "itemDescription": "Welsh rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Lloyd_White_(rugby_league)", "wikipedia_page": {"main": "Lloyd White (born 9 August 1988) is a Welsh international rugby league footballer who plays as a hooker for Toulouse Olympique in the Betfred Championship. \nHe has previously played for Crusaders RL and spent time playing for the South Wales Scorpions. He played as a stand-off earlier in his career.", "link_mentions": [{"page": "Wales national rugby league team", "response": ["| Lloyd White"]}, {"page": "2013 Rugby League World Cup", "response": ["* Lloyd White"]}, {"page": "Quota players", "response": ["|  Widnes Vikings ||  Chris Houston, Charly Runciman Hep Cahill, Aaron Heremaia ||  Macgraff Leuluai () Stanton Albert, Wellington Albert Lloyd White ||  Patrick Ah Van, Krisnan Inu ()"]}, {"page": "RLIF Awards", "response": ["| Lloyd White"]}, {"page": "Rumney RFC", "response": ["* Lloyd White - Crusaders & Wales rugby league international"]}, {"page": "Phil Ford (rugby)", "response": ["His brother Steve Ford was a Wales national rugby union team footballer, who was suspended for a period for having played a rugby league trial with Leeds. His nephew is Wales rugby league international Lloyd White."]}, {"page": "Rhys Hanbury", "response": ["His 2011 season did not go to plan however. Plagued with injuries, he made just ten appearances with four tries. It was announced that he would move to Widnes for the 2012 season alongside team mates Lloyd White and Frank Winterstein after the Welsh club's withdrawal from Super League."]}, {"page": "2009 European Cup", "response": ["|Celtic Crusaders||Ashley Bateman, Chris Beasley, Neil Budworth, Geraint Davies, Gil Dudson, Ben Flower (Captain), Jordan James, Elliot Kear, Lewis Mills, Ross Wardle, Lloyd White and Lee Williams"]}, {"page": "2010 European Cup", "response": ["|  Crusaders || Anthony Blackwood, Ben Flower, Chris Davies, Dafydd Carter, Elliot Kear, Gareth Thomas, Gil Dudson, Jack Pring, Jamie Murphy, Jordan James, Lee Williams, Lewis Mills, Lloyd White, Luke Dyer, Rhodri Lloyd"]}, {"page": "2010 Crusaders Rugby League season", "response": ["The preseason saw the Crusaders make a number of changes firstly the Crusaders changed their name from Celtic Crusaders to Crusaders Rugby League then they got rid of previous coach John Dixon and was replaced by Brian Noble as well as gaining Nobles services Iestyn Harris and Jon Sharp joined as assistant coaches. The preseason also saw Wales take part in the 2009 European Cup which they ended up winning against Scotland 28–16, from the Crusaders 2010 Squad Jordan James, Ben Flower, Elliot Kear, Lewis Mills and Lloyd White were all named in the Wales squad. The Crusaders also confirmed Wrexhams Racecourse Ground as their new home ground for 2010 they originally planned to play at Newports Rodney Parade but unfortunately they couldn't which meant they had to move their South Wales base 200 miles to North Wales. The Crusaders made a number of high-profile signings during the off season with players such as former Great Britain internationals Jamie Thackray and Gareth Raynor joining the club as well as former NRL player Michael Witt returning to the 13-man code after a -year stint with the Otago rugby union club."]}]}}