{"wiki_id": "http://www.wikidata.org/entity/Q666843", "itemLabel": "Neville Henderson", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/Nevile_Henderson", "wikipedia_page": {"main": "Sir Nevile Meyrick Henderson  (10 June 1882 – 30 December 1942) was a British diplomat who served as the ambassador of the United Kingdom to Nazi Germany from 1937 to 1939.", "link_mentions": [{"page": "Noel Mason-MacFarlane", "response": ["From October 1938 – February 1939, Henderson was in London being treated for the cancer which was to kill him in 1942. During this time, the chargé d'affaires, Sir George Ogilvie-Forbes was in charge of the British embassy in Berlin, and used his position to \"educate\" the British cabinet about Germany. In this period, Mason-MacFarlane became an ally against the ambassador, Sir Nevile Henderson, whose views about the Nazi regime were not shared by either men. On the night of 9 November 1938, Mason-MacFarlane witnessed the Kristallnacht (\"night of broken glass\") pogrom in Berlin, where the homes and businesses of Jews were looted and vandalised while Jews were beaten up and sometimes killed.Butler, E.N. Mason-Mac, London: Macmillan, 1972 p.88-89 Kristallnacht repulsed and disgusted him, adding to his dislike of the Nazi regime. On 2 January 1939, Ogilvie-Forbes very strongly endorsed a report from Mason-MacFarlane stating that the German economy was being organised for \"total war\" and Hitler would almost certainly invade one of his neighbours in 1939.Strang, Bruce. \"Two Unequal Tempers: Sir George Ogilvie-Forbes, Sir Neville Henderson and British Foreign Policy, 1938–39\" from Diplomacy and Statecraft, Issue 1, March 1994 p.122 Mason-MacFarlane stated the German economy was on \"full throttle\" for war and Hitler would probably invade an Eastern European state in 1939, through he also stated there was a strong possibility of Hitler attacking a Western European state. Mason-MacFarlane dismissed the possibility of an internal revolt toppling Hitler, saying that there were many brave Germans opposed to the Nazi dictatorship, but unfortunately the Nazi regime was an effective police state together with the loyalty of the majority of the Wehrmacht to Hitler meant that there was no hope of him being overthrown. William Strang of the Foreign Office called this dispatch \"excellent\".Strang, Bruce. \"Two Unequal Tempers: Sir George Ogilvie-Forbes, Sir Neville Henderson and British Foreign Policy, 1938–39\" from Diplomacy and Statecraft, Issue 1, March 1994 p.123 The possibility of Hitler attacking the Low Countries and/or France that Mason-MacFarlane had warned about had more impact on the British cabinet than did his warnings of aggression in Eastern Europe, and changed Britain's policies towards France.Strang, Bruce. \"Two Unequal Tempers: Sir George Ogilvie-Forbes, Sir Neville Henderson and British Foreign Policy, 1938–39\" from Diplomacy and Statecraft, Issue 1, March 1994 p.127 Henderson upon his return to the British Embassy on 13 February 1939 stated that henceforward all dispatches from Berlin had to conform to his views. In protest, Mason-MacFarlane wrote: \"we remained in disagreement with his views on Hitler and on the course which Nazi Germany was likely to pursue\". On 3 March 1939, Mason-MacFarlane first reported to London that he heard reports that the Wehrmacht had started stockpiling supplies in areas near the Polish border with the order that these be completed by 28 March."]}, {"page": "Birger Dahlerus", "response": ["On 29 August, at a meeting with the German Foreign Minister, Joachim von Ribbentrop, Henderson had been presented with a document containing sixteen points that Germany demanded agreement by Poland. Henderson saidFailure of a Mission, Neville Henderson. that they were spoken too fast for him to understand and that he was denied a written copy. On the following day, Dahlerus was given a copy of the 16 points by Göring and took them to Henderson, who dispatched him to Józef Lipski, the Polish ambassador, who had never heard of Dahlerus. As one of the 16 points was that a Polish negotiator with full plenipotentiary powers should appear in Berlin before 1 September, the Polish government deemed the proposals unreasonable."]}]}}