{"wiki_id": "http://www.wikidata.org/entity/Q6668917", "itemLabel": "Lolita Chakrabarti", "itemDescription": "English actress and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Lolita_Chakrabarti", "wikipedia_page": {"main": "Lolita Chakrabarti  (born 1 June 1969) is a British actress and writer.", "link_mentions": [{"page": "Royal Academy of Dramatic Art", "response": ["* Lolita Chakrabarti – (Red Velvet, Jekyll & Hyde)"]}, {"page": "Life of Pi", "response": ["A new adaptation by Lolita Chakrabarti was produced at the Crucible Theatre, Sheffield in June 2019. It was directed by Max Webster, with puppetry and movement directed by Finn Caldwell. It was well reviewed unanimously by critics  and opened in the West End, at Wyndham's Theatre, in November 2021."]}, {"page": "Evening Standard Theatre Awards", "response": ["* 2012 – Lolita Chakrabarti for Red Velvet"]}, {"page": "Critics' Circle Theatre Award", "response": ["|Lolita Chakrabarti"]}, {"page": "Kiln Theatre", "response": ["The theatre has produced original work by playwrights such as Lynn Nottage, Patrick Barlow, Richard Bean, David Edgar, Stephen Jeffreys, Abi Morgan, Simon Stephens, Roy Williams, Lolita Chakrabarti, Moira Buffini, Alexi Kaye Campbell, Florian Zeller and Ayad Akhtar.", "*Red Velvet, a world premiere of a play by Lolita Chakrabarti based on the true story of Ira Aldridge, the first black actor to play Othello on a London stage in 1833 (played 11 October – 24 November 2012; revived 23 January 2014 – 15 March 2014; transferred to New York 25 March – 20 April 2014). The production received awards for Most Promising Playwright and Best Actor at the Evening Standard Award and Critics' Circle Theatre Awards, and transferred to the West End in 2016 as part of the Kenneth Branagh season at the Garrick."]}, {"page": "Ira Aldridge", "response": ["* His life was the subject of a play, Red Velvet, by Lolita Chakrabarti and starring Adrian Lester, produced at the Tricycle Theatre in London in 2012."]}, {"page": "Adrian Lester", "response": ["In 2012, Lester appeared as Ira Aldridge in the play Red Velvet, written by his wife Lolita Chakrabarti.", "In 2021, Lester appeared in the live-streamed production of Hymn written by his wife Lolita Chakrabarti for the Almeida Theatre. The play co-starred Danny Sapani and was performed with social distancing in place in accordance with COVID-19 restrictions.", "In 2010, Lester appeared in the documentary When Romeo Met Juliet together with his wife Lolita Chakrabarti as acting mentors to the pupils of two Coventry schools involved in a production of Romeo and Juliet.", "In 1997 Lester married actress and writer Lolita Chakrabarti, whom he met while they were both students at RADA. They live in south east London with their two daughters, Lila and Jasmine."]}, {"page": "Chakraborty", "response": ["*Lolita Chakrabarti (born 1969), British actor and writer"]}, {"page": "The Homecoming", "response": ["The Homecoming was revived at the Almeida Theatre, London, from 31 January through 22 March 2008.  The cast included Kenneth Cranham, Neil Dudgeon, Danny Dyer, Jenny Jules, and Nigel Lindsay.The Homecoming at the Almeida Theatre (official webpage), accessed 11 March 2014. Dan Wooller photographed the first-night \"post-show party at the Almeida, including Harold Pinter, Peter Hall, and several \"other first-night guests.\"\"1st Night Photos: Hall & Pinter at The Homecoming\", What's on Stage, Almeida Theatre, London, 8 February 2008.  (\"For 1st Night Photos, our Whatsonstage.com photographer Dan Wooller was on hand for the post-show party at the Almeida along with the company, Harold Pinter, Peter Hall and other first-night guests including Jonathan Pryce, Kate Fahy, Rula Lenska, Lindsay Posner, Anthony Page, Will Tuckett, Lolita Chakrabarti, Indhu Rubasingham, Douglas Henshall, Ralph Brown and Croatian playwright Tena Stivicic.\")"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Lolita Chakrabarti (Acting Diploma 1990)"]}, {"page": "List of The Bill characters", "response": ["| Jamila Blake || Lolita Chakrabarti || 1996-1999 || style=\"text-align:center;\"|82 || P.C."]}, {"page": "Soho Theatre", "response": ["The 2020 award is judged by a panel of industry experts including former Soho writers Phoebe Waller-Bridge, Arinzé Kene and Laura Wade, screenwriter Russell T Davies, actress and playwright Lolita Chakrabarti and Character 7's Stephen Garrett."]}, {"page": "Venus (2006 film)", "response": ["* Lolita Chakrabarti as Health Centre Nurse"]}, {"page": "A Masculine Ending", "response": ["*Lolita Chakrabarti - Sue"]}, {"page": "Numbertime", "response": ["Numbertime is a BBC educational numeracy television series for primary schools that was aired on BBC Two from 20 September 1993 to 3 December 2001. For its first four series, it was presented by Lolita Chakrabarti. El Nombre, an animated character used throughout the series, eventually became the concept for his own educational BBC children's television program; his name means \"The Name\" in Spanish, and not \"The Number\", which would be \"El Número\". The third line of his opening song and his farewell catchphrase were also changed several times during the series' run, to reflect their focus - however, the original ones (\"Writing numbers in the desert sand\" which was also used for the seventh series, and \"Adios amigos, and keep counting\" which was also used for the fourth, sixth, seventh, eighth and ninth series) remain the most famous."]}, {"page": "The Bill (series 12)", "response": ["There was also an exit for PC Donna Harris, as the role of collator was replaced by a computerised system. Two other characters departed, with Robert Perkins leaving his role as Sergeant Ray Steele after almost three years, with WPC June Ackland taking the role of Sergeant after six months as an Acting Sergeant. Tom Cotcher also left the role of DC Alan Woods, being replaced by WDC Liz Rawton, with actress Libby Davison joining the show permanently just four months after making a guest appearance as Briony Richards. Rawton's arrival to CID was preceded by that of DS Geoff Daly in June, portrayed by Ray Ashcroft. WPC Jamila Blake arrived at the end of the year to replace WPC Marshall, Lolita Chakrabarti taking on the role after two guest appearances earlier in the series as Dr. Sally Vole."]}, {"page": "Lolita (given name)", "response": ["*Lolita Chakrabarti (born 1969), British actress"]}, {"page": "Fortysomething (TV series)", "response": ["| Dr. Surinder Dhillon || Lolita Chakrabarti"]}, {"page": "Bernardine Evaristo", "response": ["* 2020: First, Do No Harm, a poetic monologue, Old Vic Theatre online, directed by Adrian Lester and produced by Lolita Chakrabarti – starring Sharon D. Clarke."]}, {"page": "Intruders (2011 film)", "response": ["* Lolita Chakrabarti as Dr. Roy"]}, {"page": "Thorne (TV series)", "response": ["* Lolita Chakrabarti as Seema Khera"]}, {"page": "2012 in literature", "response": ["*Lolita Chakrabarti – Red Velvet"]}, {"page": "My Mad Fat Diary", "response": ["*Lolita Chakrabarti as Dr Juliet Allen (series 3), Kester’s replacement."]}, {"page": "Amnesia (TV series)", "response": ["* Lolita Chakrabarti as Parminder Kelsey"]}, {"page": "Indhu Rubasingham", "response": ["During her time as Artistic Director, her production of Red Velvet by Lolita Chakrabarti transferred to the West End’s Garrick Theatre and St Ann’s Warehouse Theater in New York. Her production of Moira Buffini’s Handbagged transferred to the West End’s Vaudeville Theatre prior to a UK tour before playing at 59e59 in New York and Washington DC’s Round House Theatre.", "|Red Velvet by Lolita Chakrabarti"]}, {"page": "2012 Evening Standard Theatre Awards", "response": ["*  Lolita Chakrabarti, Red Velvet (Tricycle)"]}, {"page": "Danny Sapani", "response": ["In 2021 he played alongside Adrian Lester in the streamed version of Lolita Chakrabarti's Hymn from the Almeida theatre in London. Their performances were described as 'captivating, delicately picking out the nuances of two men who are simultaneously complete and broken'. "]}, {"page": "Red Velvet (play)", "response": ["Red Velvet is a 2012 play by Lolita Chakrabarti, dealing with the biography of the 19th century actor Ira Aldridge and his taking the role of Othello. It premiered at the Tricycle Theatre, London (directed by its new artistic director Indhu Rubasingham) from 11 October to 24 November 2012, with Aldridge played by Adrian Lester.  It has since been produced by several theatres in the United States."]}, {"page": "San Francisco Playhouse", "response": ["| 2016/05 || Red Velvet || Lolita Chakrabarti || Margo Hall "]}, {"page": "The Casual Vacancy (miniseries)", "response": ["*Lolita Chakrabarti as Parminder Jawanda"]}, {"page": "Beowulf: Return to the Shieldlands", "response": ["* Lolita Chakrabarti as Lila"]}, {"page": "Jekyll and Hyde (TV series)", "response": ["*Lolita Chakrabarti Gurinder Najaran, Vishal's wife, Ravi's mother and Robert Jekyll's foster-mother in Ceylon. She is killed by the forces of Tenebrae while they try to learn more about Robert."]}, {"page": "Born to Kill (TV series)", "response": ["* Lolita Chakrabarti as Helen Deverill, a psychologist who represents Jenny during Peter's parole hearing"]}, {"page": "Natasha Gordon", "response": ["* Red Velvet by Lolita Chakrabarti (2012), The Tricycle"]}, {"page": "The Wheel of Time (TV series)", "response": ["* Lolita Chakrabarti as Marin al'Vere"]}]}}