{"wiki_id": "http://www.wikidata.org/entity/Q6679068", "itemLabel": "Lord Charles Townshend", "itemDescription": "British politician (1785-1853)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lord_Charles_Townshend_(1785%E2%80%931853)", "wikipedia_page": {"main": "Lord Charles Vere Ferrers Townshend (16 September 1785 – 5 November 1853), was a British politician.\nTownshend was the second son of George Townshend, 2nd Marquess Townshend, and his wife Charlotte (née Loftus). He was returned to Parliament as one of two representatives for Tamworth in 1812, a seat he held until 1818, and again between 1820 and 1835.  He was initially elected in the family interest, when his family owned Tamworth Castle, but could not expect to continue in 1818 after the Townshend trustees had sold the castle, but was defeated when Sir Robert Peel, 1st Baronet, the owner of Drayton Manor in nearby Drayton Bassett and his son William canvassed against him.  However he was re-elected unopposed in 1820.Townshend died in November 1853, aged 68, having previously repurchased Tamworth Castle.", "link_mentions": [{"page": "Marquess Townshend", "response": ["Several other members of the Townshend family have also gained distinction. Charles Townshend, second son of the third Viscount, was a prominent statesman and orator and served as Chancellor of the Exchequer from 1766 to 1767. The politician Thomas Townshend, 1st Viscount Sydney, after whom the town of Sydney, Australia, was named, was the son of the Hon. Thomas Townshend, second son of the second Viscount. Sydney's grandson was the Liberal politician John Townshend, 1st Earl Sydney. Charles Townshend, 1st Baron Bayning, was the son of the Hon. William Townshend, third son of the second Viscount. See also Roger Townshend, Admiral George Townshend, Lord Charles Townshend, Lord John Townshend, Lord Charles Townshend, Lord James Townshend, Charles Fox Townshend and Major-General Sir Charles Vere Ferrers Townshend."]}, {"page": "Tamworth (UK Parliament constituency)", "response": ["|Lord Charles Townshend  ", "|rowspan=\"3\"|Lord Charles Townshend  "]}, {"page": "George Townshend, 2nd Marquess Townshend", "response": ["Townshend was the eldest son of George Townshend, 1st Marquess Townshend, by his first wife Charlotte Compton, 16th Baroness Ferrers of Chartley and 7th Baroness Compton. He was the elder brother of Lord John Townshend and Lord Charles Townshend and the nephew of Charles Townshend. He succeeded to the titles held by his mother on her death in 1774 and became known as the Lord Ferrers of Chartley. He was educated at Eton and St John's College, Cambridge,  and served for a few years in the Army, achieving the ranks of Cornet, Lieutenant, and finally Captain in 1774."]}, {"page": "George Townshend, 3rd Marquess Townshend", "response": ["Alarmed at the pretensions of Sarah and her children, Townshend's younger brother Lord Charles Townshend (1785–1853) (who would inherit if Townshend had no legitimate sons) petitioned Parliament in May 1842 to have Sarah's children de-legitimized. Townshend supported the petition, and all the children were duly declared illegitimate by a private Act of Parliament in 1843Francois Velde (2007) \"Genetically Challenged\" Queen message from alt.talk.royalty, posted 30 May 2007. The message says in part: \"The Townshend peerage case was one where marquis Townshend (then called Lord Chartley) married Sarah Dunn Gardner in 1807; a year later she left her husband, sued in Ecclesiastical court to have the marriage annulled because of his impotence but dropped the suit and eloped with a brewer of St. Ives. Their children initially bore the brewer's name (Margetts) but from 1823 took the name Townshend, and one took the style of Earl of Leicester. The marquis took no steps to dissolve the marriage, and his brother had no means to dispute the legitimacy of the so-called Earl of Leicester, because no property depended on the title. As time went by and witnesses died off, it seemed the imposture might not be preventable. So the brother and heir presumptive petitioned the house of Lords for inquiry respecting the descent of these honours in May 1842. The next year the marquis himself also petitioned the House.", "Townshend died in Genoa in December 1855, aged 77, without issue. His only brother Lord Charles Townshend, the petitioner in the legitimacy case, had predeceased him and left no sons. Therefore, the Earldom of Leicester became extinct, while the baronies of Ferrers of Chartley and Compton fell into abeyance between his nephew (his middle sister's son) and his youngest sister, and remain in abeyance today. He was succeeded in the Marquessate of Townshend by his first cousin John Townshend, 4th Marquess Townshend."]}, {"page": "Charles Townshend (disambiguation)", "response": ["*Lord Charles Townshend (1769–1796), son of the 1st Marquess Townshend, British MP for Great Yarmouth", "*Lord Charles Townshend (1785–1853), son of the 2nd Marquess Townshend, British MP for Tamworth"]}, {"page": "Lord Charles Vere Ferrers Townshend", "response": ["#REDIRECT Lord Charles Townshend (1785–1853)"]}, {"page": "Lord Charles Townshend (1785-1853)", "response": ["#REDIRECT Lord Charles Townshend (1785–1853)"]}, {"page": "List of MPs elected in the 1830 United Kingdom general election", "response": ["|Lord Charles Townshend||"]}, {"page": "List of MPs elected in the 1831 United Kingdom general election", "response": ["|Lord Charles Townshend||"]}, {"page": "List of MPs elected in the 1826 United Kingdom general election", "response": ["|Lord Charles Townshend||"]}, {"page": "Britomart Redeems Faire Amoret", "response": ["Following its exhibition at the 1833 Summer Exhibition, it was exhibited in August of the same year at the Royal Manchester Institution. It was sold at this second exhibition for £157 (about £ in today's terms) to an anonymous collector listed in Etty's records only as \"Mr. L., Manchester\". It was one of 133 Etty paintings exhibited in a major retrospective exhibition of his work at the Royal Society of Arts in June–August 1849; during this exhibition it was sold on to Lord Charles Townshend for a sum of 520 guineas (about £ in today's terms)."]}, {"page": "List of MPs elected in the 1820 United Kingdom general election", "response": ["|rowspan=\"2\"|Tamworth(two members) || Lord Charles Townshend||"]}, {"page": "List of MPs elected in the 1812 United Kingdom general election", "response": ["| Lord Charles Townshend"]}, {"page": "Morston Hall", "response": ["The Tithe Map of 1838 reveals that Lord Charles Townshend was the owner of Morston Hall and George Wood was the tenant. The Wood family were residents of the Hall for about one hundred years."]}]}}