{"wiki_id": "http://www.wikidata.org/entity/Q6678929", "itemLabel": "Lord Arthur Russell", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Lord_Arthur_Russell", "wikipedia_page": {"main": "Lord Arthur John Edward Russell (13 June 1825 – 4 April 1892) was a British Liberal Party politician.\nHe was born in London on 13 June 1825. He was the second of three sons of Major-General Lord George William Russell and Elizabeth Anne Rawdon, daughter of the Hon. John Theophilus Rawdon, himself second son of the 1st Earl of Moira. His elder brother was Francis, later 9th Duke of Bedford and his younger brother was Odo, later 1st Baron Ampthill.\nHe was educated in Germany. From 1849 to 1854 he was private Secretary to his uncle, the Liberal Prime Minister Lord John Russell. Between 1857 and 1885, he sat as Member of Parliament (MP) for Tavistock. He only spoke rarely in the Commons, once in reply to an attack on his brother, Odo.\nOn 25 September 1865, Russell married Laura de Peyronnet, daughter of Paul Louis Jules, Vicomte de Peyronnet. Together they had six children, Harold Russell, Flora Russell, the diplomat Sir Claud Russell, Caroline Russell, Major Gilbert Russell and Conrad Russell.\nHe was raised to the rank of a Duke's son on 25 June 1872 and was then known as Lord Arthur Russell.\nHe was a great clubman and belonged to Brooks's, the Athenaeum, the Cosmopolitan, Grillion's, THE CLUB, and the Metaphysical Society. He was involved in the Senate of the University of London, serving on this body from 1875 until before his death.\nRussell died on 4 April 1892, at 2 Audley Square, London and was buried in Brompton Cemetery, London. There is a memorial to him in the 'Bedford Chapel' at St. Michael's Church, Chenies.\nThe ideological gulf between Britain and the new German Empire was stressed by Lord Russell in 1872:\n\nPrussia now represents all that is most antagonistic to the liberal and democratic ideas of the age; military despotism, the rule of the sword, contempt for sentimental talk, indifference to human suffering, imprisonment of independent opinion, transfer by force of unwilling populations to a hateful yoke, disregard of European opinion, total want of greatness and generosity, etc., etc.\"", "link_mentions": {}}}