{"wiki_id": "http://www.wikidata.org/entity/Q66747532", "itemLabel": "George Marten", "itemDescription": "English cricketer (1840-1905)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Marten_(cricketer,_born_1840)", "wikipedia_page": {"main": "George Nisbet Marten  (20 June 1840 – 25 August 1905) was an English first-class cricketer.\nThe son Thomas Powney Marten, he was born in British India at Ghazeepoor. He was educated in England at Harrow School, before going up to Pembroke College, Oxford. While studying at Oxford, Marten was commissioned as a lieutenant in the Hertfordshire Militia in March 1861. A year after graduating from Oxford in 1863, Marten made his debut in first-class cricket for the Marylebone Cricket Club against Middlesex at Lord's, while in 1865 he appeared for the Gentlemen of England against the Gentlemen of Middlesex. Four years later in 1869, he made two final appearances in first-class cricket for the MCC against Oxford University at Lord's, and Hampshire at Southampton. Marten scored 50 runs in his four matches, with a high score of 26. He was promoted to the rank of captain in the Hertfordshire Militia in March 1866.By 1872 he had emigrated to Australia, where he lived on the Branscombe Plantation near Mackay, Queensland. He later returned to England with his wife, Annie. He was a justice of the peace, and was by profession a banker. Marten died at Crowborough in June 1905. His uncle, George Marten, was also a first-class cricketer.\n\n", "link_mentions": [{"page": "Ghazipur", "response": ["* George Marten, cricketer"]}, {"page": "List of Old Harrovians", "response": ["*George Marten (1840–1905), English first-class cricketerHarrow, 1800–1911, p. 265"]}, {"page": "George Marten (cricketer, born 1801)", "response": ["Marten was educated at Westminster School and Trinity College, Cambridge. He became a banker, a partner in Messrs Call, Marten & Co. with Sir William Call, 2nd Baronet and his son. Their bank was taken over in 1865 by Messrs Herries, Farquhar & Co., later acquired by Lloyds Bank. His nephew, George Marten, was also a first-class cricketer."]}, {"page": "List of Marylebone Cricket Club players (1864–1894)", "response": ["* George Marten (1864–1869) : G. N. Marten (Gentlemen of England)"]}, {"page": "George Marten", "response": ["George Marten may refer to:", "* George Marten (priest) (1876–1966), Anglican priest", "* George Marten (cricketer, born 1801) (1801–1876), English cricketer", "* George Marten (cricketer, born 1840) (1840–1905), English cricketer"]}]}}