{"wiki_id": "http://www.wikidata.org/entity/Q6678913", "itemLabel": "Lord Alwyne Compton", "itemDescription": "British bishop (1825-1906)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lord_Alwyne_Compton_(bishop)", "wikipedia_page": {"main": "Lord Alwyne Compton (18 July 1825 – 4 April 1906) was an Anglican bishop in the late 19th and early 20th centuries.", "link_mentions": [{"page": "Marquess of Northampton", "response": ["Several other members of the Compton family have gained distinction. Henry Compton, sixth son of the second Earl of Northampton, was Bishop of London. Spencer Compton, 1st Earl of Wilmington, Prime Minister of Great Britain from 1742 to 1743, was the third son of the third Earl. Catherine Compton, daughter of the Hon. Charles Compton, third son of the fourth Earl, was created Baroness Arden in 1770. She was the wife of John Perceval, 2nd Earl of Egmont, and the mother of another Prime Minister, Spencer Perceval. Lord Alwyne Compton, fourth son of the second Marquess, was Bishop of Ely. Lord Alwyne Compton, third son of the fourth Marquess, was a Unionist politician. He was the father of Captain Edward Robert Francis Compton. The latter married as his first wife Sylvia, daughter of Alexander Haldane Farquharson. Their son Alwyne Arthur Compton was officially recognised by warrant of the Lord Lyon in the surname of Farquharson of Invercauld and as Chief of Clan Farquharson in 1949."]}, {"page": "John Shore, 1st Baron Teignmouth", "response": ["Teignmouth had three sons and six daughters by his wife, who died on 13 July 1834. He was succeeded in the title by his eldest son, Charles John Shore. His second son, Frederick John married in 1830 Charlotte Mary Cornish of Devonshire.La Belle Assemblee London, February 1830. The second daughter Anna Maria married Thomas Noel Hill, who had fought at the Battle of Waterloo. His daughter Caroline Dorothea married Rev. Robert Anderson (their eldest daughter, Florence Caroline, married Lord Alwyne Compton). Shore was great-uncle to the poet Louisa Catherine Shore."]}, {"page": "Spencer Compton, 2nd Marquess of Northampton", "response": ["*Lord Alwyne Compton (1825–1906), successively Dean of Worcester and Bishop of Ely"]}, {"page": "Royal Almonry", "response": ["* 1882–1906: Lord Alwyne Compton, Bishop of Ely"]}, {"page": "Bishop of Ely", "response": ["| 60px Lord Alwyne Compton"]}, {"page": "List of Anglo-Catholic churches", "response": ["| A proprietary chapel in the Church of England. Dedicated on 30 June 1890 to St Peter by the Bishop of Ely, Lord Alwyne Compton (bishop)."]}]}}