{"wiki_id": "http://www.wikidata.org/entity/Q6679346", "itemLabel": "Lord Henry Paulet", "itemDescription": "Royal Navy officer during the American War of Independence, French Revolutionary Wars and Napoleonic Wars, later an Admiral", "wikipedia_url": "https://en.wikipedia.org/wiki/Lord_Henry_Paulet", "wikipedia_page": {"main": "Lord Henry Paulet KCB (31 March 1767 – 28 January 1832) was an officer in the Royal Navy who saw service in the American War of Independence, the French Revolutionary and Napoleonic Wars. Born into the British nobility as a younger son of the Marquess of Winchester, he rose through the ranks and had gained his own command by the early stages of the French Revolutionary Wars. He was involved in a number of famous engagements during his career, such as the capture of the French frigate Gloire in 1795, though he narrowly missed out on seeing direct action at two of the most significant naval battles of the wars with the French. The first was the Battle of Cape St Vincent, where he had left Jervis's fleet a few days previously, the second was the Battle of Copenhagen, where he remained with Sir Hyde Parker's reserve squadron. He nevertheless rose through the ranks to reach vice-admiral, despite an incident that saw him court-martialled and dismissed, only to be reinstated by the intervention of the King; and a tendency to eccentricity. He married towards the end of the wars with France, and had several children. Paulet served as one of the Lords Commissioners of the Admiralty from 1813, and was installed as a Knight Commander of the Bath in 1815, but ill-health forced his retirement from active service shortly afterwards, and he would die of cancer in 1832.", "link_mentions": [{"page": "HMS Defence (1763)", "response": ["In 1801, Defence sailed to the Baltic under Captain Lord Henry Paulet with Admiral Hyde Parker's fleet. She was present at the Battle of Copenhagen, but did not see action as she was part of the reserve under Parker."]}, {"page": "List of Lords Commissioners of the Admiralty", "response": ["**Lord Henry Paulet, Naval Lord", "**Lord Henry Paulet, Naval Lord", "**Lord Henry Paulet, Naval Lord"]}, {"page": "Alexander Wilmot Schomberg", "response": ["He entered the Navy in April 1785 as a first-class volunteer aboard , the official yacht of the Lord Lieutenant of Ireland, commanded by his father in the Irish Sea. He later served as a midshipman aboard , under the command of Captain Lambert Brabazon, for about 2½ years, before joining the 98-gun , flagship of Sir Richard Bickerton at Plymouth, late in 1789. He went on to serve aboard the frigate , Captain Edmund Dodd, attached to the Channel Fleet, and then in the 50-gun , flagship of Sir John Laforey on the West Indies Station. There he was promoted to lieutenant on 26 July 1793, to serve aboard the sloop , Captain Lord Henry Paulet, and then the frigate , Captain William Hancock Kelly."]}, {"page": "Order of battle in the Atlantic campaign of 1806", "response": ["| align= left | Captain Lord Henry Paulet", "| align= left | Captain Lord Henry Paulet"]}, {"page": "Richard Darton Thomas", "response": ["On 1 January 1793 France declared war on Great Britain, and for the next two years Thomas served aboard Nautilus in the West Indies under the Captains Lord Henry Paulet, James Carpenter, Henry William Bayntun, and William Gordon Rutherford, while taking part in operations against the French islands of Tobago, Saint Lucia, and Martinique, where he commanded a boat in the attack on Fort Royal, landing and escalading the walls simultaneously with Captain Robert Faulknor of the sloop .", "On 15 January 1797 Thomas was commissioned as a lieutenant aboard the 74-gun , commanded by Captain Cuthbert Collingwood, and took part in the Battle of Cape St Vincent on 14 February. In June 1798 he moved into the frigate Thalia, under Captain Lord Henry Paulet, rejoining him in the 74-gun  in February 1799 after three months on half-pay. From December 1799 until the signing of the Treaty of Amiens in March 1802 brought a temporary peace, Thomas served as flag lieutenant to Collingwood in the  and Barfleur on the Channel Station. From June 1802 he served aboard the  and , the flagships of Sir Andrew Mitchell, Commander-in-Chief on the North American Station, based at Halifax, Nova Scotia. In early June 1803 Thomas finally received notification of his promotion to commander of the fifth-rate , dated 18 January."]}, {"page": "Henry Paulet", "response": ["#REDIRECT Lord Henry Paulet"]}, {"page": "Paulet baronets", "response": ["The Paulet Baronetcy, of West Hill Lodge in the County of Southampton, was a title in the Baronetage of the United Kingdom. It was created on 18 March 1836 for the 21-year-old Henry Paulet, in honour of his late father, Vice-Admiral Lord Henry Paulet, younger son of the twelfth Marquess of Winchester. The title became extinct on his death in 1886."]}, {"page": "George Paulet, 12th Marquess of Winchester", "response": ["George was the eighth and youngest son of Norton Powlett or Paulet (d. 1741), of Amport. Norton was the grandson of Lord Henry Paulet, of Amport, and the great-grandson of William Paulet, 4th Marquess of Winchester.", "*Lord Henry Paulet (1767–1832), a Vice Admiral who saw service in the American War of Independence, the French Revolutionary and Napoleonic Wars"]}, {"page": "Espoir (ship)", "response": ["*HMS Thalia, under Captain Lord Henry Paulet, captured the French navy brig Espoir in the Mediterranean on 18 September 1797. Espoir was armed with sixteen 6-pounder guns and had a crew of 96 men. She had sailed from Cayenne and earlier had been in company with another French corvette, which had, however been captured by an English frigate on 20 July. The Admiralty took her into the Royal Navy as . Later, Thalia shared the prize money with  and ."]}, {"page": "Action of 10 April 1795", "response": ["Seeing that his ships were in danger of being caught by the much larger British ships of the line, Captain Beenst gave orders for the squadron to separate. Gentille and Fraternité splitting from Gloire to the west with the ships of the line HMS Hannibal and HMS Robust in close pursuit while Gloire swung northwest, eluding most of the British squadron except for the 32-gun frigate HMS Astraea under Captain Lord Henry Paulet, which managed to stay in contact throughout the afternoon."]}, {"page": "Order of battle in the Biscay campaign of June 1795", "response": ["| align= left | Captain Lord Henry Paulet"]}, {"page": "Order of battle in the Croisière de Bruix", "response": ["| align= left | Captain Lord Henry Paulet"]}, {"page": "HMS Caroline (1795)", "response": ["This began a small string of successes for Caroline, with her boats destroying the 1-gun privateer L'Esperance at Tenerife on 16 October and four days later taking the 10-gun privateer Le Baret at the same location, again with Flora. The ship also shared in the capture of the merchants Nostra Senora de Misericordia and San Joseph on 20 October. In November command of the ship briefly transferred to Captain Lord Henry Paulet.Clarke, Naval Chronicle Vol 3, p. 544 On 21 November Caroline and Flora took the Spanish merchant El Bolante off Madeira, and then on 23 November the 10-gun French privateer La Garonne.Clarke, Naval Chronicle Vol 1, p. 337 In December Paulet was replaced by Captain William Bowen; Caroline took the 12-gun privateer brig Le Ferailleur on 4 December by tricking her into believing the frigate and two small prizes with her were a merchant convoy.Clarke, Naval Chronicle Vol 1, p. 434 Caroline continued on station off Lisbon throughout 1799 as well.Clarke, Naval Chronicle Vol 1, p. 570 On 27 January the frigate recaptured the British letter of marque Jane which she had been chasing since Janes captor, the privateer L'Intrepide, had been taken and disclosed her location on 25 January.Clarke, Naval Chronicle Vol 2, p.626 In the same month Drie Vrienden Hoy and the brig Nymph were also recaptured. With continuing success, Caroline and Flora retook Six Sisters, which had been captured by a French privateer, in early February and captured the French privateers L'Aventure on 14 February and La Legere on 19 April.Clarke, Naval Chronicle Vol 1, p. 264 On 24 June the frigate followed and reported the position of Admiral Étienne Eustache Bruix's escaped French fleet to Rear-Admiral Sir Charles Cotton, assisting Cotton in his hunt for Bruix that saw him chase the French from Brest to the Mediterranean.Krajeski, Flags around the Peninsula, p. 75 On 31 August Caroline took the privateer La Resolve and then on 26 December El Fleche and La Voiture."]}]}}