{"wiki_id": "http://www.wikidata.org/entity/Q6680023", "itemLabel": "Lord William Cecil", "itemDescription": "British noble; (1854-1943)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lord_William_Cecil_(courtier)", "wikipedia_page": {"main": "Colonel Lord William Cecil  (2 November 1854 – 16 April 1943) was a British army officer and royal courtier.", "link_mentions": [{"page": "William Cecil", "response": ["* Lord William Cecil (courtier) (1854–1943), British royal courtier", "* Lord William Cecil (bishop) (1863–1936), Bishop of Exeter, 1916–1936"]}, {"page": "Marquess of Exeter", "response": ["Another member of the Cecil family was the naval commander Edward Cecil, 1st Viscount Wimbledon (a title which became extinct on his death in 1638). He was the third son of the first Earl of Exeter. Also, Lord William Cecil, third son of the third Marquess, married Mary, 2nd Baroness Amherst of Hackney. Their grandson William succeeded in the barony in 1919. Another member of this branch of the family is Vice-Admiral Sir Nigel Cecil. The champion racehorse trainer Sir Henry Cecil was the son of Henry Cecil, a younger brother of the third Baron. Lord John Joicey-Cecil, fourth son of the third Marquess, was Conservative Member of Parliament for Stamford.", "****Lord William Cecil (1854–1943)"]}, {"page": "Baron Amherst of Hackney", "response": ["Baron Amherst of Hackney (), in the County of London, is a title in the Peerage of the United Kingdom. It was created on 26 August 1892 for the former Conservative Member of Parliament William Tyssen-Amherst, with remainder, in default of male issue, to his eldest daughter Mary and her issue male. Tyssen-Amherst had previously represented West Norfolk and South West Norfolk in the House of Commons. He was succeeded according to the special remainder by his daughter Mary. She was the wife of Colonel Lord William Cecil, third son of William Cecil, 3rd Marquess of Exeter.  the title is held by their great-great-grandson, the fifth Baron, who succeeded his father in 2009. As a male-line descendant of the third Marquess of Exeter he is also in remainder to this peerage and its subsidiary titles the earldom of Exeter and barony of Burghley.", "Rear Admiral Sir Nigel Cecil was the son of Hon. Henry Mitford Amherst Cecil, fourth son of the second Baroness and Lord William Cecil. The champion racehorse trainer Sir Henry Cecil was the son of Henry Cecil, a younger brother of the third Baron.Daily Telegraph, Obituary"]}, {"page": "William Cecil, 3rd Marquess of Exeter", "response": ["*Lord William Cecil (1854–1943), married (1) Mary Tyssen-Amherst, Baroness Amherst, (2) Violet Freer."]}, {"page": "Peter G. Gerry", "response": ["On October 22, 1925, Gerry married Edith Stuyvesant Dresser (1873–1958), the widow of George Washington Vanderbilt II (1862–1914).After his death in 1914, she inherited his $50,000,000 estate and later sold the land around the Biltmore Estate to the United States Forest Service. This became part of the Pisgah National Forest. Edith, a daughter of Maj. George Warren Dresser, was the mother of Cornelia Stuyvesant Vanderbilt (1900–1976), who married John Francis Amherst Cecil, son of Lord William Cecil and Mary Rothes Margaret Tyssen-Amherst, 2nd Baroness Amherst of Hackney."]}, {"page": "Edith Stuyvesant Gerry", "response": ["On June 1, 1898, she married George Washington Vanderbilt II (1862–1914), the owner of the Biltmore Estate in Asheville, North Carolina. Together, they had one daughter Cornelia Stuyvesant Vanderbilt (1900–1976), who married John Francis Amherst Cecil (1890–1954), son of Lord William Cecil and Mary Rothes Margaret Tyssen-Amherst, 2nd Baroness Amherst of Hackney."]}, {"page": "Nigel Cecil", "response": ["Oswald Nigel Amherst Cecil was born 11 November 1925 to Commander Hon. Henry Mitford Amherst Cecil (1893–1963) and Hon. Yvonne Cornwallis (1896–1983).  Cecil is a paternal grandson of Lord William Cecil (1854–1943) and the 2nd Baroness Amherst of Hackney (1857–1919) and a maternal grandson of the 1st Baron Cornwallis (1864–1935). He was educated at Ludgrove School and the Royal Naval College, Dartmouth."]}, {"page": "Lord Cecil", "response": ["* Lord William Cecil (courtier) (1854–1943), British royal courtier", "* Lord William Cecil (bishop) (1863–1936), Bishop of Exeter, 1916–1936"]}, {"page": "Brownlow Cecil, 4th Marquess of Exeter", "response": ["Exeter was the eldest son of William Cecil, 3rd Marquess of Exeter, and Lady Georgiana Sophia, daughter of Thomas Pakenham, 2nd Earl of Longford. Lord William Cecil and Lord John Joicey-Cecil were his younger brothers."]}, {"page": "List of Gentlemen Ushers", "response": ["*11 February 1911 – 3 November 1924: Lord William Cecil (replacing Cuffe)", "*3 November 1924 – 1937: Lord William Cecil", "*11 June 1909 – 11 February 1911: Lord William Cecil"]}, {"page": "George Henry Vanderbilt Cecil", "response": ["Cecil was a direct descendant of both William Henry Vanderbilt and, on his father's side, William Cecil, the chief adviser to Queen Elizabeth I in the 16th century, through his grandparents, Lord William Cecil and Mary Rothes Margaret Cecil, Baroness Amherst of Hackney."]}, {"page": "Lord John Joicey-Cecil", "response": ["Joicey-Cecil was the fourth son of William Cecil, 3rd Marquess of Exeter, and his wife Lady Georgina Sophia, daughter of Thomas Pakenham, 2nd Earl of Longford. Brownlow Cecil, 4th Marquess of Exeter and  Lord William Cecil  were his elder brothers."]}, {"page": "Lord William Cecil", "response": ["Lord William Cecil may refer to:", "* Lord William Cecil (courtier) (1854–1943), British royal courtier", "* Lord William Cecil (bishop) (1863–1936), Bishop of Exeter, 1916–1936"]}, {"page": "Groom in Waiting", "response": ["|21 May 1892 || rowspan=7| Colonel Lord William Cecil"]}, {"page": "John Nicholas Brown II", "response": ["His mother was the great-niece of Hamilton Fish (1808–1893), a U.S. Secretary of State, U.S. Senator, and New York Governor. Through the Fish family, he was a descendant of Peter Stuyvesant, the first governor of Dutch colonial New York through Hamilton Fish's mother, Elizabeth Stuyvesant, Peter Stuyvesant's 2x great-granddaughter.Corning (1918), pp. 12-15.  His maternal uncle was D. LeRoy Dresser (1862–1915), his maternal aunt was Edith Stuyvesant Dresser (1873–1958), the wife of George Washington Vanderbilt II (builder of the Biltmore Estate) and later Sen. Peter Goelet Gerry. His first cousin was Cornelia Stuyvesant Vanderbilt (1900–1976), who married John Francis Amherst Cecil (1890–1954), son of Lord William Cecil and Mary Rothes Margaret Tyssen-Amherst, 2nd Baroness Amherst of Hackney."]}, {"page": "Cornelia Stuyvesant Vanderbilt", "response": ["On April 29, 1924, Cornelia was married to a British aristocrat who was then the first secretary of the British Embassy in Washington, Hon. John Francis Amherst Cecil (1890–1954), the son of Lord William Cecil and Mary Cecil, Baroness Amherst of Hackney. The Cecils were descendants of William Cecil. The nationally-renowned organist from St. Louis Charles Henry Galloway played organ at the wedding. They divorced in 1934."]}, {"page": "Robert Myddelton Biddulph (1805–1872)", "response": ["His grandchildren included Agnes Mary Myddelton Biddulph (d. 1920), Catherine Myddelton Biddulph (d. 1889), Colonel Robert Edward Myddelton (1866-1949), and Algernon Hugh Myddelton Biddulph (1872-1906). Agnes married Hedworth Trelawny Barclay, son of Alexander Charles Barclay, and was the mother of Vera Agnes Barclay who married Captain Honourable Thomas James Amherst Cecil (1887–1955), son of Lord William Cecil, the younger son of William Cecil, 3rd Marquess of Exeter."]}, {"page": "1909 Birthday Honours", "response": ["*Colonel The Lord William Cecil, M.V.O., Gentleman Usher to His Majesty, and Comptroller to Her Royal Highness Princess Beatrice (Princess Henry of Battenberg)."]}, {"page": "Vivian Francis Bulkeley-Johnson", "response": ["On 13 October 1949, he married the divorced American heiress, Cornelia Stuyvesant Vanderbilt in a brief ceremony at the Kensington registry office in London, and remained married to her until his death.  Cornelia was the daughter of George Washington Vanderbilt II and Edith Stuyvesant Dresser and the mother of George Henry Vanderbilt Cecil and William Amherst Vanderbilt Cecil from her previous marriage to John Francis Amherst Cecil, the first secretary of the British Embassy in Washington, who was the son of Lord William Cecil and Mary Cecil, Baroness Amherst of Hackney."]}, {"page": "John Francis Amherst Cecil", "response": ["John Francis Amherst Cecil was born on 30 June 1890 in London, England.  He was the third son of Lord William Cecil (1854–1943) and Mary Rothes Margaret Tyssen-Amherst, 2nd Baroness Amherst of Hackney (1857–1919).  After the death of his mother in 1919, his father remarried to Violet Maud (née Freer) Collyer.  As his eldest brother, Capt. Hon. William Amherst Cecil, predeceased their mother, William's eldest son, succeeded their mother as the 3rd Baron Amherst of Hackney."]}, {"page": "Mary Cecil, 2nd Baroness Amherst of Hackney", "response": ["On 2 September 1885, May married Colonel Lord William Cecil (1854–1943), son of the 3rd Marquess of Exeter. The couple had four sons:"]}, {"page": "List of Grand Crosses of the Order of St John", "response": ["|Colonel The Lord William Cecil CVO||||||"]}, {"page": "George Warren Dresser", "response": ["Through his daughter Edith, he was posthumously a grandfather of Cornelia Stuyvesant Vanderbilt (1900–1976), who married John Francis Amherst Cecil, son of Lord William Cecil and Mary Tyssen-Amherst, 2nd Baroness Amherst of Hackney."]}]}}