{"wiki_id": "http://www.wikidata.org/entity/Q6681365", "itemLabel": "Lorna Laidlaw", "itemDescription": "actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Lorna_Laidlaw", "wikipedia_page": {"main": "Lorna Laidlaw (born 1 February 1963) is an English actress and presenter. She has appeared on television as Mrs Tembe in the BBC medical soap opera Doctors and Aggie Bailey in the ITV soap opera, Coronation Street. Laidlaw won the Royal Television Society award for Best Actress and Best Daytime Star at the Inside Soap Awards for her role in Doctors.", "link_mentions": [{"page": "Doctors (2000 TV series)", "response": ["In 2005, Holby City actor Adrian Lewis Morgan was cast in the role of Jimmi Clay. Appearing continuously since, he has become the longest serving actor on Doctors. Also during the 2000s, numerous other longstanding characters were introduced, including: Daniel Granger (Matthew Chambers), Heston Carter (Owen Brenman), Lily Hassan (Seeta Indrani) and Zara Carmichael (Elisabeth Dermot Walsh). 2009 saw the introduction of the Hollins family; Karen (Jan Pearson), Rob (Chris Walker), Imogen (Charlie Clemmow) and Jack Hollins (Nicolas Woodman). Mrs Tembe (Lorna Laidlaw) was introduced as a receptionist at the Mill in 2011, who eventually became the practice manager. In 2012, several regular characters were introduced into the series, including general practitioner Mandy Marquez (Danielle Henry), practice manager Howard Bellamy (Ian Kelsey), police surgeon Jas Khella (Vineeta Rishi), general practitioner and police surgeon Emma Reid (Dido Miles), receptionist Valerie Pitman (Sarah Moyle) and general practitioner Al Haskey (Ian Midlane). Practice nurse Ayesha Lee (Laura Rollins) made her debut appearance in 2014. Midwife Ruhma Hanif (Bharti Patel) and general practitioner Sid Vere (Ashley Rice) were introduced in 2015. After the departure of Mrs Tembe, Ali Bastian was cast as practice manager Becky Clarke in 2019. Later in 2019, Bastian left Doctors after becoming pregnant, and in the programme, she is replaced by business manager Bear Sylvester (Dex Lee). Nurse Luca McIntyre (Ross McLaren) joined the series in 2021."]}, {"page": "List of people from Birmingham", "response": ["*Lorna Laidlaw – Actress"]}, {"page": "Tikkabilla", "response": ["The show features two different presenters and a small dragon puppet named Tamba, who resembles Spyro the Dragon in colouration. Tamba serves as the programme's naive child; the programme's educational content is introduced as the presenters explain things to Tamba. Whilst Tamba appears in every episode, a team of presenters take it in turns to pair-up in each show. These presenters include Justin Fletcher, Sarah-Jane Honeywell, Simon Davies, Lorna Laidlaw, Paul Ewing, Veejay Kaur (series 3–4), Toni Fruitin and Amit Sharma (both series 4 only) and Beverly Hills (series 1–2 only). Tamba is performed by puppeteers Sue Eves (series 1 to 4) who created the voice for Tamba; Alison McGowan (series 2 and 3) and Katherine Smee (series 4). Sue Eves has also written many scripts for the programme."]}, {"page": "Weatherfield", "response": ["Roy's Rolls is a café, situated on Victoria Street, which is owned by Roy Cropper (David Neilson). Hayley Cropper (Julie Hesmondhalgh), Roy's wife, was co-owner until her death in 2014. It was managed by Anna Windass (Debbie Rush) until she went to prison in 2017. Mary Taylor (Patti Clare) is a stand-in waitress here. Roy's fiancée Cathy Matthews (Melanie Hill) worked here until they separated in 2016. Shona Ramsey (Julia Goulding) and Aggie Bailey (Lorna Laidlaw) are currently employed at the café. It was formally located at 12 Rosamund Street before Roy bought Gail out of the business and moved to the current premises in 1999."]}, {"page": "Irene Roberts (Home and Away)", "response": ["For her portrayal of Irene, McGranger was nominated for \"Best Supporting Actress\" and Irene for \"Biggest Laugh in Soap\" at the 1997 Inside Soap Awards. At the 2007 Inside Soap Awards she was nominated in the category of \"Funniest Performance\" for her portrayal. Irene and Leah's friendship won the 2015 TV Week and Soap Extra #OMGAward for Best BFFs. In August 2017, McGranger was longlisted for Best Daytime Star at the Inside Soap Awards. She made the viewer-voted shortlist, but lost out to Lorna Laidlaw, who portrays Mrs Tembe in Doctors."]}, {"page": "The British Soap Awards", "response": ["| \"Best Dramatic Performance\"Presented by Anita Dobson|| Kellie Bright (Linda Carter in EastEnders) || Simon Gregson (Steve McDonald in Coronation Street)Lorna Laidlaw (Mrs Tembe in Doctors)Natalie Anderson (Alicia Metcalfe in Emmerdale)Keith Rice (Finn O'Connor in Hollyoaks)"]}, {"page": "Paul Robinson (Neighbours)", "response": ["Dennis has earned various award nominations for his role as Paul. At the 2007 Inside Soap Awards, Dennis was nominated for Best Actor and Best Bad Boy. The following year, Dennis was again nominated for Best Actor and Best Bad Boy. 2009 saw Dennis nominated for Best Actor and Best Bad Boy once again. In 2010, Dennis was nominated for the very first Best Daytime Star award. He received a nomination in the same category in 2015 and 2017. He progressed to the viewer-voted shortlist in 2017, but lost out to Lorna Laidlaw, who portrays Mrs Tembe on Doctors. At the first Digital Spy Soap Awards ceremony, Dennis was nominated for Villain of the Year. Dennis was nominated for Best Soap Actor (Male) at the 2018 Digital Spy Reader Awards; he came in joint ninth place with 3.9% of the total votes."]}, {"page": "Toadie Rebecchi", "response": ["For his portrayal of Toadie, Moloney was nominated for a Rose d'Or award for Best Actor in a Soap in 2004. In 2010, Moloney won the very first Best Daytime Star award at the Inside Soap Awards. Moloney won the award for a second and third time in 2011 and 2012 respectively. He was nominated in the same category at the 2017 Inside Soap Awards. He progressed to the viewer-voted shortlist, but lost out to Lorna Laidlaw, who portrays Mrs Tembe on Doctors. In 2019, Moloney received a nomination for the Logie Award for Most Popular Actor, and he won the Inside Soap Best Daytime Star Award for a fourth time."]}, {"page": "Inside Soap Awards", "response": ["| Lorna Laidlaw (Mrs. Tembe in Doctors)Lynne McGranger (Irene Roberts in Home and Away)Bonnie Sveen (Ricky Sharpe in Home and Away)", "| Lorna Laidlaw (Mrs Tembe in (Doctors)"]}, {"page": "Birmingham Youth Theatre", "response": ["* Lorna Laidlaw, Doctors (2000 TV series)"]}, {"page": "List of Coronation Street characters", "response": ["| Lorna Laidlaw"]}, {"page": "Grandpa in My Pocket", "response": ["* Lorna Laidlaw as Miss Smiley", "* Miss Smiley (Lorna Laidlaw): The happy-go-lucky owner of the Sunnysands cafe."]}, {"page": "Imogen Hollins", "response": ["Imogen is sentenced to community service. Due to her criminal record, Imogen finds it difficult to find a job. Karen manages to persuade Julia Parsons (Diane Keen) to give Imogen a part time job as a receptionist while Mrs Tembe (Lorna Laidlaw), the receptionist of the Mill Health Centre, is away on holiday. Imogen leaves but returns for the wedding of her parents. She later returns to Letherbridge, where she pursues a relationship with Sid Vere (Ashley Rice). At first, her parents disapprove of Imogen seeing Sid, but they later come round to their relationship. While having sex, Sid notices a lump on Imogen's breast and suggests getting it looked at. When she has a private consultation, the lump is revealed to be benign, leaving her relieved. Imogen moves to London to pursue her art career, making sporadic home visits. On one occasion, Imogen returns to Letherbridge and reveals to her parents that her art project has lost all funding and that her relationship has ended."]}, {"page": "List of Doctors characters", "response": ["| Lorna Laidlaw"]}, {"page": "Mrs Tembe", "response": ["Winifred Clements (also Tembe) is a fictional character from the BBC soap opera Doctors, portrayed by Lorna Laidlaw. She is introduced on 5 January 2011 as a new receptionist at The Mill, as a replacement for Ruth Pearce (Selina Chilton). Despite initially being introduced as Mrs Tembe, she later reveals her forename to be Winifred. In April 2016, Mrs Tembe's role within Doctors changed, as she becomes the Practice Manager. On 8 January 2019, it was announced that Laidlaw was to leave Doctors after 8 years. Mrs Tembe's exit storyline saw her move away with Gordon Clement (Steven Elder) to Newcastle after accepting a new job working as a manager for a children's charity. Laidlaw's final scenes aired on 13 February 2019."]}, {"page": "List of Doctors characters (2011)", "response": ["Doctors is a British medical soap opera which began broadcasting on BBC One on 26 March 2000. Set in the fictional West Midlands town of Letherbridge, the soap follows the lives of the staff and patients of the Mill Health Centre, a fictional NHS doctor's surgery, as well as its sister surgery located at a nearby university campus. The following is a list of characters that first appeared in Doctors in 2011, by order of first appearance. All characters are introduced by the programme's executive producer, Will Trotter. Mrs Tembe (Lorna Laidlaw) arrived in January as a receptionist, with lecturer Lucy Vaughn (Joanne Farrell) began appearing in February, as well Angie Briggs (Den Woods). Dafydd Llewellyn (Richard Corgan) appeared in March as a friend of Jimmi Clay's (Adrian Lewis Morgan), as well as security guard Ryan Murphy (Kaine Barr). General practitioners Freya Wilson (Lu Corfield) and Kevin Tyler (Simon Rivers) made their debuts in May. Receptionist Lauren Porter (Alexis Peterman) debuts in August, as well as forensics specialist Harrison Kellor (James Larkin). Marina Bonnaire (Marian McLoughlin) began appearing in August as a love interest for Heston Carter (Owen Brenman).", "Winifred Clements (also Tembe), portrayed by Lorna Laidlaw, made her first appearance on 5 January 2011 as a new receptionist at The Mill, as a replacement for Ruth Pearce (Selina Chilton). Despite initially being introduced as Mrs Tembe, she later reveals her forename to be Winifred. In April 2016, Mrs Tembe's role within Doctors changed, as she becomes the Practice Manager. On 8 January 2019, it was announced that Laidlaw was to leave Doctors after 8 years. Mrs Tembe's exit storyline saw her move away with Gordon Clement (Steven Elder) to Newcastle after accepting a new job working as a manager for a children's charity. Laidlaw's final scenes aired on 13 February 2019. Laidlaw was named Best Actress at the 2012 RTS Midlands Awards. In August 2017, Laidlaw was longlisted for Best Daytime Star at the Inside Soap Awards. She made the viewer-voted shortlist. On 6 November 2017, Laidlaw won the Best Daytime Star accolade, which is the first Inside Soap Award to be won by Doctors.", "After Mrs. Tembe (Lorna Laidlaw) leaves on holiday, Julia Parsons (Diane Keen) contacts a daughter of an old friend, Lauren. On her first day, she immediately attracts the attention of all the staff, particularly Kevin Tyler (Simon Rivers), but only disdain from Dr. Freya Wilson (Lu Corfield). Kevin instantly takes interest in Lauren, and tries to win her over by offering her dinner, but she turns him down. In August 2011, a patient waiting to see Jimmi Clay (Adrian Lewis Morgan) brings her pet rat to the surgery for comfort, which scares Kevin away. Lauren agrees to look after the patient's rat, placing it in a box, feeding it bread. Later, Lauren catches a homeless man named Dennis (Andy Devine) washing his hands and feet in the toilets at The Mill. Freya has words with Lauren after she makes a stereotypical judgement of Dennis. Lauren later agrees to see if Dennis has checked into a homeless shelter Freya recommended. However, she goes home and later tells Freya that Dennis hadn't followed her advice. Lauren continued to bully Imogen Hollins (Charlie Clemmow), annoy Kevin and clash with Imogen's mother Karen (Jan Pearson) when she finally confronted her over her antics. But her lover, Harrison Kellor (James Larkin), was furious when she gleefully admits that she has been cheating on him, and eventually murdered Lauren in a rage by strangling her to death with a tea towel.", "It was announced in spring 2011 that a new health visitor was to join the cast later on in the year. In August, it was confirmed that McLoughlin was to play the role. She was introduced to be the love interest of long-standing regular, Dr. Heston Carter (Owen Brenman). Marina is well-liked by most staff, especially Heston whom she is in a relationship with. Because of her relationship with Heston, receptionist Mrs. Tembe (Lorna Laidlaw) becomes jealous of her, as she too has feelings for Heston. In November 2011, she moved into Heston's house, to her son's disapproval."]}, {"page": "List of Doctors characters (2012)", "response": ["Akono appears when the church asks Mrs Tembe (Lorna Laidlaw) if she would give Akono a home whilst he studies at Letherbridge University. She welcomes Akono staying, as they are both Christians. He is given a tour of the university by Jack Hollins (Nicolas Woodman), though begins to question whether he wants to stay in England when he sees Jack's friend Sarah Trevllin (Kate Malyon) drunk. He begins to question his beliefs as he learns of Sarah's history of rape and that she is missing her university lectures, and considers returning to Nigeria. Akono begins to develop feelings for Mrs Tembe, though she does not feel the same way about him. Later on, Akono kisses her. Mrs Tembe is shocked by this, and asks Akono to move out."]}, {"page": "Howard Bellamy (Doctors)", "response": ["Howard first appears when he is introduced by Heston Carter (Owen Brenman) as the new replacement of Julia Parsons (Diane Keen) as the new Practice Manager of The Mill. Howard is a last minute applicant for the job, and asks for a big salary in comparison to the other candidate, Mrs Tembe (Lorna Laidlaw). However, Howard is chosen as there is a re-accreditation at the Mill, needing someone to take charge throughout this. Howard divides opinion between the team, as Kevin Tyler (Simon Rivers) begins to like him, however Freya Wilson (Lu Corfield), Zara Carmichael (Elisabeth Dermot-Walsh) and Elaine Cassidy (Janet Dibley) dislike him in contrast to Julia. After Howard learns that Gary Lucas (Iain Fletcher), a former acquaintance from his military days, is planning to open a rival clinic nearby the Mill, Howard develops bulimia. He purchases a large amount of food, and binges all of it upon returning home, then forces himself to vomit what he ate. Colleague Emma Reid (Dido Miles) discovers Howard's eating disorder and attempts to get him help, but he makes her promise to keep it a secret if he stops."]}, {"page": "List of awards and nominations received by Doctors", "response": ["Doctors is nominated annually at the Inside Soap Awards. Lorna Laidlaw won the award for Best Daytime Star for her role as Mrs Tembe in 2017, while the soap itself won Best Daytime Soap the following year. The soap also receives annual longlist nominations from the National Television Awards, with Elisabeth Dermot Walsh having received two nominations for her role as Zara Carmichael. At the RTS Midlands Awards, Dido Miles has won the award for Acting Performance of the Year for her portrayal of Emma Reid twice, in 2013 and 2017. Doctors has also won the Drama award three times at the ceremony. In 2017, the Writers' Guild of Great Britain awarded the soap for Best Long Running TV Series.", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)", "| Lorna Laidlaw (Mrs Tembe)"]}, {"page": "Valerie Pitman", "response": ["Valerie Pitman is a fictional character from the BBC soap opera Doctors, portrayed by Sarah Moyle. Valerie is introduced as a temporary receptionist at the Mill, and made her first appearance on 15 October 2012. It was first announced that Moyle was to play a new recurring character on her official credits in 2012. She departed on 3 December 2012 but made brief returns in 2013 and 2014. Moyle was promoted to the regular cast in 2016. Valerie's storylines in the programme have included a life-threatening battle against Hodgkin's lymphoma, fighting against Mrs. Tembe's (Lorna Laidlaw) new ideas for The Mill, attempting to sue Al Haskey (Ian Midlane) for malpractice and being falsely accused of murder.", "Valerie first appears when Howard Bellamy (Ian Kelsey) phones her, needing her to be a temporary receptionist at The Mill, whilst Mrs Tembe (Lorna Laidlaw) and Karen Hollins (Jan Pearson) are on holiday. She agrees to this, and starts work four days later, offending both Mrs Tembe and Karen before they leave. Valerie finds her distant relatives by Mill medical records; Trudy (Judy Flynn) and Ellie Benedict (Eleanor Wyld). Valerie meets them, wanting them to be part of her life. However, after meeting them, she realises that they do not want to have a relationship with her. Valerie returns in October 2015 and gets interested in Cooks Heaven and holds a party at Karen's house, inviting Mrs Tembe, Ruhma Carter (Bharti Patel), Emma Reid (Dido Miles), Niamh Donoghue (Jessica Regan) and Ayesha Lee (Laura Rollins) but it is a disaster, as Karen burns herself and she accidentally cuts Mrs Tembe. A few episodes later, she announces her and Ashley's relationship is over, and he later storms into the surgery and starts shouting at Valerie."]}, {"page": "Laidlaw (surname)", "response": ["*Lorna Laidlaw (born 1963), English actress and television presenter"]}, {"page": "Niamh Donoghue", "response": ["For her portrayal of Niamh, Regan won Best Female Acting Performance at the RTS Midlands Awards. She then won Best Newcomer at the 2015 British Soap Awards. Regan's win marked the first time Doctors had won an award at the event in six years. Of her win, Regan commented, \"I really was in complete shock, I wasn't pretending. I'm not that good an actress! I was delighted, especially as Doctors hadn't won for so long.\" Speaking to Digital Spy about the result, Lorna Laidlaw who plays Mrs Tembe commented: \"We were all ecstatic. Beforehand we were like, 'It's ridiculous, what's the point of us turning up here every year?!' So it was time – it always is time.\" Regan was also nominated for Best Actress and Best On-Screen Partnership with Midlane. Later in 2015, she was longlisted for the Inside Soap Award for Best Daytime Star."]}, {"page": "List of Coronation Street characters (2019)", "response": ["Coronation Street is a British soap opera first broadcast on 9 December 1960. The following is a list of characters introduced in 2019, by order of first appearance. All characters are introduced by series producer Iain MacLeod. The first character to be introduced is Natalie Watkins (Cassie Bradley), an acquaintance of Nick Tilsley (Ben Price), in January, followed by the birth of Bertie Osbourne, the son of Daniel Osbourne (Rob Mallard) and Sinead Tinker (Katie McGlynn) and Andrea Abruzzi (Luca Malacrino) a hairdresser who applies for a job at Trim Up North. Jan Lozinski (Piotr Baumann), a builder working for Gary Windass (Mikey North), first appears in March, followed by Alina Pop (Ruxandra Porojnicu), a love interest for Seb Franklin (Harry Visinoni), in April. The Bailey family - consisting of brothers James Bailey (Nathan Graham) and Michael Bailey (Ryan Russell), their father Ed Bailey (Trevor Michael Georges) and mother Aggie Bailey (Lorna Laidlaw) - are introduced in June, as well as Kelly Neelan (Millie Gibson), the daughter of Rick Neelan (Greg Wood). Ray Crosby (Mark Frost) arrives in July, as well as Bernie Winter (Jane Hazlegrove), the mother of Gemma Winter (Dolly-Rose Campbell) and Paul Foreman (Peter Ash). Gary's client Derek Milligan (Craige Els) first appeared in August. Bernie's ex-boyfriend Kel Hinchley (Joseph Alessi) and Hope Stape's (Isabella Flanagan) teaching assistant Jade Rowan (Lottie Henshall) arrive in September. Gemma's quadruplets Aled, Bryn, Carys and Llio Winter-Brown are born in October. Nina Lucas (Mollie Gallagher), the long-lost niece of Roy Cropper (David Neilson), arrives in November. Additionally, multiple other characters appear throughout the year.", "James Bailey, played by Nathan Graham, first appears in episode 9776, first broadcast on 22 May 2019. Details about the character and Graham's casting were announced on 6 April 2019. James is introduced as a member of the Bailey family, consisting of brothers James and Michael (Ryan Russell), and their parents, Ed (Trevor Michael Georges) and Aggie Bailey (Lorna Laidlaw). The family are introduced when they move into No 3 Coronation Street. The family are the first black family to appear on the soap since 2013. Producer Iain MacLeod called the family \"funny, warm and will pull together through thick and thin\", expressing his joy at their castings, while adding that the actors work well together. Graham also shared his delight at joining the cast and becoming part of the Bailey family.", "Ed Bailey, played by Trevor Michael Georges, first appears in episode 9790, first broadcast on 10 June 2019. The character and Georges' casting details were announced on 6 April 2019. Edison is introduced as a member of the Bailey family, consisting of brothers Michael (Ryan Russell) and James Bailey (Nathan Graham), and their parents, Ed and Aggie Bailey (Lorna Laidlaw). The family are introduced when they move into 3 Coronation Street and purchase the local construction yard. The family are the first black family to appear on the soap since 2013. Producer Iain MacLeod called the family \"funny, warm and will pull together through thick and thin\" and expressed his joy at their castings, adding that the actors work well together. Russell expressed his disbelief at joining the soap having watched the show as a child. He found it \"humbling\" to be featured in a script with the longest-serving character Ken Barlow (William Roache).", "Michael Bailey, played by Ryan Russell, first appears in episode 9792, first broadcast on 12 June 2019. Details about the character and Russell's casting details were announced on 6 April 2019. Michael is introduced as a member of the Bailey family, consisting of brothers Michael and James Bailey (Nathan Graham), and their parents, Ed (Trevor Michael Georges) and Aggie Bailey (Lorna Laidlaw). The family are introduced when they move into 3 Coronation Street and purchase the local builder's yard. The family are the first Black family to appear on the soap since 2013. Producer Iain MacLeod called the family \"funny, warm and will pull together through thick and thin\" and expressed his joy at their castings, adding that the actors work well together. Russell expressed his delight at joining the cast and portraying Michael, who he deemed to be a \"challenge\".", "Aggie Bailey, played by Lorna Laidlaw, first appears in episode 9793, first broadcast on 12 June 2019. The character and Laidlaw's casting details were announced on 6 April 2019. Aggie is introduced as a member of the Bailey family, consisting of brothers Michael (Ryan Russell) and James Bailey (Nathan Graham), and their parents, Aggie and Ed Bailey (Trevor Michael Georges). The family are introduced when they move into 3 Coronation Street and purchase the local construction yard. The family are the first black family to appear on the soap since 2013. Producer Iain MacLeod called the family \"funny, warm and will pull together through thick and thin\" and expressed his joy at their castings, adding that the actors work well together. Laidlaw expressed her excitement at joining the soap, which she called \"a staple\" of British television. Laidlaw was highly publicised for playing Mrs Tembe in the BBC soap opera Doctors, a role she played until leaving in February 2019. The actress was concerned about transferring from one soap to another, but thought the characters varied enough. She also revealed that she was surprised to be offered the role of Aggie."]}, {"page": "List of Doctors characters (2019)", "response": ["Becky Clarke, portrayed by Ali Bastian, first appeared on 5 February 2019, and made her last appearance on 6 November 2019. Mrs Tembe (Lorna Laidlaw) meets Becky at a Women in Business meeting, and scouts her to be the new Practice Manager at The Mill. When Mrs Tembe leaves The Mill, Becky begins working at The Mill. Becky gets off to a rough start when Karen Hollins (Jan Pearson) disagrees with her ways of running the practice. After a few weeks, the two begin to work well with each other. She is happy when boyfriend Tam Campbell (Sean Ward) arrives in Letherbridge from Scotland, but is shocked to hear he has lost his job. Becky helps Tam to find a job and instructs him on tasks to do around the house while she is at work, which causes an argument between the two. The pair make up, and Becky introduces him to her colleagues. Tam later tells Becky that he has been offered a job in London, and asks her if she wants to join him there. She explains that she wants to explore her life in Letherbridge, and the two break up. Becky has a short-lived relationship with cleaner Enzo D'Agostino (Jack Derges), and the pair are nearly caught when they have sex in Becky's office. A few months later, Becky enters a relationship with colleague Daniel Granger, and falls pregnant. However, she miscarries the baby. Daniel uses the opportunity to tell her that he does not want more children, and that he slept with Zara Carmichael (Elisabeth Dermot Walsh). Disgusted with the way Daniel treated her, Becky finds a new job and leaves The Mill with immediate effect on 6 November 2019."]}, {"page": "Ruhma Carter", "response": ["Ruhma is introduced as a sonographer for Emma Reid (Dido Miles) and Howard Bellamy (Ian Kelsey) and it is explained that her and Emma are former colleagues. Mrs Tembe (Lorna Laidlaw) calls her into the Mill, where Valerie Pitman (Sarah Moyle) insists that there is no record of her meeting. While she argues with Valerie, a pregnant patient of Sid Vere's (Ashley Rice) begins to feel ill, so she treats her. Valerie later calls her and apologises and Ruhma is called in for another meeting. When Jimmi Clay (Adrian Lewis Morgan) and Heston Carter (Owen Brenman) hear of Ruhma's potential hiring, they disagree, insisting that the Mill does not need a residential midwife. However, Mrs Tembe disagrees and appoints Ruhma as a midwife. Ruhma and Heston attend the theatre together, after which Ruhma asks Karen Hollins (Jan Pearson) if Heston is single; he later takes her on a date to a restaurant. Heston asks Ruhma to his house for dinner, where she explains her housing difficulties. Heston offers to allow her to stay with him and tries to kiss him; she backs away. Ruhma is evicted from her house, so Heston invites Ruhma and her children, Shak (Sunjay Midda) and Alia (Mandy Thandi), to live with him."]}, {"page": "List of Doctors characters (2015)", "response": ["Anthony Harker, portrayed by Adam Astill, first appeared on 18 December 2015, and made his final appearance on 20 April 2016. Anthony is introduced as a potential choice for practice manager of the Mill, and he is chosen instead of Mrs Tembe (Lorna Laidlaw), his only other competition for the role. He takes a dislike to Mrs Tembe, and encourages her to work at another practice, which he achieves. When a merger between the Mill and King's Green, another local surgery, is suggested, Anthony is supportive. He calls a meeting between himself and the partners at the Mill; Jimmi Clay (Adrian Lewis Morgan), Daniel Granger (Matthew Chambers) and Zara Carmichael (Elisabeth Dermot Walsh), he tries to convince them that the merger would benefit all of them. Daniel is later shocked when he hears Anthony talking about bribery in order to achieve the merger. Daniel and Zara attend a dinner at Anthony's house, where they meet his wife Trish (Kim Tiddy). They bond over their plans for the Mill, but when the pair talk badly about Mrs Tembe, Zara jumps to her defence. Days later, Anthony calls a meeting to finalise the merger of the surgeries. He is excited to reveal his plans of becoming a partner, expecting the other three partners to be supportive, but he is shocked when the three of them vote against the idea. Daniel then provides evidence of Anthony's bribery, and the partners then dismiss Anthony from the Mill."]}, {"page": "List of Doctors characters (2018)", "response": ["Ben Galadima, portrayed by Michael Fatogun, first appeared on 18 January 2018, and made his final appearance on 9 March 2018. Ben is brought in as a temporary Practice Manager at The Mill while Mrs Tembe (Lorna Laidlaw) is on holiday. When Zara Carmichael (Elisabeth Dermot Walsh) learns that Ben's previous experience involves working in a supermarket, she attempts to embarrass him, nicknaming him Bargain Basement Ben. However, everyone supports him when he explains to everyone how his experience helps him as a manager. Ben begins dating Jimmi Clay's (Adrian Lewis Morgan) nephew Will Hurran (Robin Morrissey), and the pair get along well until Will accidentally outs Ben to his mother. Will ends their relationship as he does not want to be with someone who is ashamed of their sexuality. After their breakup, Ben decides to come out to the staff at The Mill, but is surprised when none of his colleagues are bothered or shocked. When Mrs Tembe returns, Ben gets another job.", "Su Turtle, portrayed by Sam Battersea, first appeared on 12 April 2018. Su is introduced when the staff members at The Mill are sent to a conflict course, which Su is leading. Su nicknames herself Su without an E, due to the spelling of her name. Due to Zara Carmichael (Elisabeth Dermot Walsh) and Al Haskey (Ian Midlane) not wanting to participate in the activities, Su becomes stressed. On the second day of the course, Su turns up late, and the attendees wonder where she is, and become agitated. Su arrives in an upbeat mood, and sets everyone into pairs and instructs them to fill out a questionnaire about each other, and to make a sculpture out of pipe cleaners. However, every single pair begin arguing. Su takes the attendees to lunch, but gets stressed when they want to drink wine rather than non-alcoholic beverages. She breaks into tears, and Mrs Tembe (Lorna Laidlaw) insists that the staff apologise to Su for their behaviour. Eventually, Su instructs the staff to compliment each other, which brings them together. Over a year later, Su arrives at The Mill as Becky Clarke's (Ali Bastian) replacement as Practice Manager. Zara and Emma Reid (Dido Miles) both become disgruntled with Su, who keeps asking questions and giving them advice. Emma is shocked when Su arrives at her house, as a guest at Emma's home B&B. Su crashes Emma's night in with Zara, and continuously talks about her ex, Dave, who cheated on her. The next day, Su accompanies Emma to an art class, and when Su starts talking about Dave, Emma shouts at her and the pair have an argument in front of the class. Su leaves The Mill when Becky returns from her break. A year later, now calling herself Susan Mallard, she meets Emma a radio show. Emma belittles Su's theories about homeopathy, and the pair argue on air, thinking the show has ended. Realising the producers are pitting them against each other for listeners, they agree to be civil on air. After the show, Su comforts Frank Matthews (Ben Crowe) in the hospital.", "Mr. Jeremy Smail, portrayed by Neil Grainger, first appeared on 18 September 2018, and made his final appearance on 26 September 2018. Mr. Smail is the Practice Manager of the Sutton Vale surgery. When Mrs Tembe (Lorna Laidlaw) learns that The Mill are losing patients to Sutton Vale, she sends Sid Vere (Ashley Rice) to a job interview with Jeremy. Mr. Smail offers Sid an official job, to their surprise. Sid reveals that he is considering accepting Mr. Smail's job offer. Mr. Smail smugly calls Mrs Tembe for a job reference, and annoyed, she snaps at Ayesha Lee (Laura Rollins). When Mr. Smail learns of Ayesha's upset with Mrs Tembe, he offers her a job. Unsure, she says she will think about the job, and when a patient has an epileptic fit in Sutton Vale, she saves them, and impressed, Mr. Smail offers her a higher salary. Mrs Tembe arranges a meeting with Mr. Smail to come to an agreement, but when he is busy on the phone, she snoops through his office and finds dodgy financial records. Mrs Tembe and Emma Reid (Dido Miles) meet with his investor, and they expose him for trying to poach The Mill's staff and his untrustworthy financial methods."]}, {"page": "List of Doctors characters (2017)", "response": ["Doctors is a British medical soap opera which began broadcasting on BBC One on 26 March 2000. Set in the fictional West Midlands town of Letherbridge, the soap follows the lives of the staff and patients of the Mill Health Centre, a fictional NHS doctor's surgery, as well as its sister surgery located at a nearby university campus. The following is a list of characters that first appeared in Doctors in 2017, by order of first appearance. All characters are introduced by the programme's executive producer, Mike Hobson. JJ Kenwright (Neal Barry) was introduced as a love interest for Mrs Tembe (Lorna Laidlaw) in February. Eve Haskey (Rachel Bell), the mother of Al Haskey (Ian Midlane), began appearing in March. March also sees the arrival of Karl Lee (Jimmy Roye-Dunne), the brother of Ayesha Lee (Laura Rollins). Psychiatrist Megan Sharma (Ritu Arya) is introduced in April as a love interest for Sid Vere (Ashley Rice). Besa Kotti (Aruhan Galieva) also began appearing in December. Additionally, multiple other characters appear throughout the year.", "JJ Kenwright, portrayed by Neal Barry, first appeared on 17 February 2017, and made his last appearance on 30 May 2017. JJ was introduced as a love interest for established character Mrs Tembe (Lorna Laidlaw), when the two meet at a pheromone dating event. When their scents match, Mrs Tembe meets JJ but refuses to talk to him. After their date, Mrs Tembe collapses, she wakes up in hospital and is surprised to see JJ by her bedside, as he is a porter at St Phils. As she dislikes the hospital food, Mrs Tembe persuades JJ to buy her cooking ingredients and take her to the hospital kitchen, where the pair cook and bond. They bond over a shared love of literature, but JJ is dismayed to find out that Mrs Tembe is romantically involved with Charles Gupta (Amerjit Deu). He is later shocked to find out that she has ended her relationship with Charles, and the pair arrange a first date, where they kiss. The pair introduce each other to their friends, and Mrs Tembe is furious when Stevie Cocks (Brett Allen) jokes around about JJ's womanising ways. Mrs Tembe buys a bike for JJ, and on the way back from the showroom, they see Zara Carmichael (Elisabeth Dermot Walsh); Mrs Tembe introduces JJ as her friend, which he is upset by. To make it up to JJ, she introduces him to all of her colleagues at The Mill. The pair go on a holiday together, and when they return, they find Rob Hollins (Chris Walker) waiting on their doorstep. He asks to take JJ to the station, and asks for his whereabouts on 4 April. Mrs Tembe explains that they were having a meal at The Icon on that day, and brushes the interaction off. ", "Dr. Megan Sharma, portrayed by Ritu Arya, first appeared on 18 April 2017, and made her last appearance on 14 September 2017. Megan is a psychiatrist, and a friend of Ruhma Carter's (Bharti Patel). Megan tells Ruhma that she would like to be introduced to the management of The Mill, and she asks if she would be able to work there. While there to meet Mrs Tembe (Lorna Laidlaw), Jimmi Clay (Adrian Lewis Morgan) accidentally splashes milk over Megan's feet. Mrs Tembe is impressed with Megan, and offers her a job at The Mill. Megan asks Jimmi out for a drink, and afterwards, he asks her out for a meal. Jimmi mentions to Megan that he is interested in becoming a therapist, and she recommends him a course. When he asks her out for another meal, she tells him that she is not interested in him romantically.", "| A doctor who used to work with Heston Carter (Owen Brenman). Charles begins a relationship with Mrs Tembe (Lorna Laidlaw), but it is ended when she chooses to be with JJ Kenwright (Neal Barry).", "| JJ Kenwright's (Neal Barry) friend. He tells Mrs Tembe (Lorna Laidlaw) about JJ's bad history of relationships."]}, {"page": "List of Coronation Street characters (2021)", "response": ["Ronnie's estranged wife Kat Bailey (Melissa Bailey) arrives in Weatherfield, due to him ignoring her phone calls. He explains that he wants to stay in Weatherfield since he needs to know if Michael (Ryan Russell) is his son or his nephew. Morgan explained that after Ronnie keeping the secret for over three decades, it is the actions of Kat that motivate him to find out the truth. He explains that prior to Aggie (Lorna Laidlaw) meeting Ed, she had a relationship with Ronnie, and the timeline of Michael's birth means that Ronnie could be Ronnie's father. Morgan states that due to being 50 and having no children, Ronnie is \"yearning for fatherhood\", and that if Michael is his son, it \"would mean everything to him\". He also hinted that if this were the case, Ronnie would not have an issue with telling Ed, since he is \"slightly arrogant\"."]}]}}