{"wiki_id": "http://www.wikidata.org/entity/Q6688559", "itemLabel": "Louisa Reeve", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Louisa_Reeve", "wikipedia_page": {"main": "Louisa Reeve (born 16 May 1984 in London) is a British rower who competed at the 2008 Summer Olympics and 2012 Summer Olympics.", "link_mentions": [{"page": "Hatfield College, Durham", "response": ["Notable former members of the club include Alice Freeman, Louisa Reeve, Angus Groom, and Simon Barr.", "The sporting alumni of Hatfield College may be the most famous, among them former England rugby union captain Will Carling, 2003 Rugby World Cup winner Will Greenwood, and former England cricket team captain Andrew Strauss. Fast bowler Frank Tyson and top order batsman Nick Compton and Tim Curtis are three other cricketing former students who made test match appearances for England. In rowing, Simon Barr, Alice Freeman, Angus Groom, Louisa Reeve, and Emily Taylor have all achieved success at international level. Athletes Jon Solly and Mark Hudspith medalled at the 1986 Commonwealth Games and 1994 Commonwealth Games respectively. Katharine Ford is the only Briton to ride an indoor velodrome for 12 hours or more."]}, {"page": "List of Durham University people", "response": ["* Louisa Reeve (Hatfield)"]}, {"page": "Durham University Boat Club", "response": ["The first Durham rower to make the GB Olympic squad was Simon Hobbs (King's College, now Newcastle University) who was spare man in 1952. In recent years, Durham representation had included Wade Hall-Craggs, Roger Brown, Kim Thomas and Philippa Cross (1992); Roger Brown (M8+), Philippa Cross (W2-) and Suzie Ellis (W8+) (1996); Ian Lawson (M1x) and Tracy Langlands (LW2x) (2004); Steve Rowbotham (bronze; M2x), James Clarke (LM4- ) Alice Freeman (W8+) and Louisa Reeve (W8+ and W2-) (2008); and Sophie Hosking (gold; LW2x) and Louisa Reeve (W8+) (2012). Lily van den Broecke coxed the mixed 4+ to gold in the 2012 Paralympics."]}, {"page": "Rowing at the 2008 Summer Olympics – Qualification", "response": ["| 10 || || Final Continental || 2 || Olivia Whitlam, Louisa Reeve"]}, {"page": "2007 World Rowing Championships", "response": ["|   Carla Ashford (b)Baz Moffat (2)Alice Freeman (3)Louisa Reeve (4)Natasha Howard (5)Alison Knowles (6)Catherine Greves (7)Jessica Eddie (s)Caroline O'Connor (c) || 6:19.66"]}, {"page": "Great Britain at the 2008 Summer Olympics", "response": ["|align=left|Louisa Reeve Olivia Whitlam", "* Substitutes in final because of illness: Louisa Reeve for Howard and Alice Freeman for Knowles"]}, {"page": "Rowing at the 2008 Summer Olympics – Women's coxless pair", "response": ["|Louisa Reeve, Olivia Whitlam ", "|Louisa Reeve, Olivia Whitlam ", "|Louisa Reeve, Olivia Whitlam "]}, {"page": "Olivia Whitlam", "response": ["Olivia Rose Whitlam (born 16 September 1985) is a female rower from Daresbury, near Warrington, England. She became the Under-23 World Champion in 2007 in the pairs with partner Heather Stanning. She competed in the 2008 Summer Olympics with new partner Louisa Reeve, paired together only three months before the games began. As the newest pair on the 2008 British Olympic Rowing team, they were uncertain what their expectations should be, but Olivia and Louisa surprised everyone by placing third in their heat, holding off a strong challenge by the Americans. They then made the final by placing second in the repechage ahead of Australia and France."]}, {"page": "2011 World Rowing Championships", "response": ["| Alison KnowlesJo CookJessica EddieLouisa ReeveNatasha PageLindsey MaguireKatie GrevesVictoria ThornleyCaroline O'Connor||  6:06.03"]}, {"page": "Great Britain at the 2012 Summer Olympics", "response": ["| style=\"text-align:left;\" | Jessica EddieKatie GrevesLindsey MaguireNatasha PageLouisa ReeveVictoria ThornleyAnnabel VernonOlivia WhitlamCaroline O'Connor (cox)"]}, {"page": "Natasha Page", "response": ["She was part of the British squad that topped the medal table at the 2011 World Rowing Championships in Bled, where she won a bronze medal as part of the eight with Alison Knowles, Jo Cook, Jessica Eddie, Louisa Reeve, Lindsey Maguire, Katie Greves, Victoria Thornley and Caroline O'Connor."]}, {"page": "Jessica Eddie", "response": ["She was part of the British squad that topped the medal table at the 2011 World Rowing Championships in Bled, where she won a bronze medal as part of the eight with Alison Knowles, Jo Cook, Louisa Reeve, Natasha Page, Lindsey Maguire, Katie Greves, Victoria Thornley and Caroline O'Connor.", "On 19 April 2015 Eddie and Louisa Reeve finished second in women's pair at the British rowing trials at Caversham, behind  Helen Glover and Heather Stanning. They were followed by Katie Greves & Zoe Lee.British Rowing, 19 April 2015, Gregory and Sbihi win star-studded GB Rowing Team men's pair final"]}, {"page": "Katie Greves", "response": ["She was part of the British squad that topped the medal table at the 2011 World Rowing Championships in Bled, where she won a bronze medal as part of the eight with Alison Knowles, Jo Cook, Jessica Eddie, Louisa Reeve, Natasha Page, Lindsey Maguire, Victoria Thornley and Caroline O'Connor."]}, {"page": "Caroline O'Connor (rowing)", "response": ["She was part of the British squad that topped the medal table at the 2011 World Rowing Championships in Bled, where she won a bronze medal as part of the eight with Alison Knowles, Jo Cook, Jessica Eddie, Louisa Reeve, Natasha Page, Lindsey Maguire, Katie Greves and Victoria Thornley."]}, {"page": "Alison Knowles (rower)", "response": ["She was part of the British squad that topped the medal table at the 2011 World Rowing Championships in Bled, where she won a bronze medal as part of the eight with Jo Cook, Jessica Eddie, Louisa Reeve, Natasha Page, Lindsey Maguire, Katie Greves, Victoria Thornley and Caroline O'Connor."]}, {"page": "September 2011 in sports", "response": ["***Eights (W8+):   (Esther Lofgren, Susan Francia, Meghan Musnicki, Taylor Ritzel, Jamie Redman, Amanda Polk, Caroline Lind, Elle Logan, Mary Whipple) 6:03.65   (Janine Hanson, Rachelle Viinberg, Natalie Mastracci, Cristy Nurse, Krista Guloien, Ashley Brzozowicz, Darcy Marquardt, Andréanne Morin, Lesley Thompson) 6:04.39   (Alison Knowles, Jo Cook, Jessica Eddie, Louisa Reeve, Natasha Page, Lindsey Maguire, Katie Solesbury, Victoria Thornley, Caroline O'Connor) 6:06.03"]}, {"page": "Lindsey Maguire", "response": ["She was part of the British squad that topped the medal table at the 2011 World Rowing Championships in Bled, where she won a bronze medal as part of the eight with Alison Knowles, Jo Cook, Jessica Eddie, Louisa Reeve, Natasha Page, Katie Greves, Victoria Thornley and Caroline O'Connor."]}, {"page": "Victoria Thornley", "response": ["She was part of the British squad that topped the medal table at the 2011 World Rowing Championships in Bled, where she won a bronze medal as part of the eight with Alison Knowles, Jo Cook, Jessica Eddie, Louisa Reeve, Natasha Page, Lindsey Maguire, Katie Greves and Caroline O'Connor."]}, {"page": "2014 European Rowing Championships", "response": ["|Rosamund BradburyOlivia Carnegie-BrownCatherine GrevesDonna EtiebetJessica EddieZoe LeeCaragh McMurtryLouisa ReeveZoe de Toledo || 6:18.32"]}, {"page": "2014 British Rowing Senior Championships", "response": ["|Women 4-    || Army / London / Imperial College / Minerva Bath Zoe Lee, Jessica Eddie, Heather Stanning, Helen Glover||Leander ARosamund Bradbury, Louisa Reeve, Katie Greves, Polly Swann||Leander BKaren Bennett, Pippa Whittaker, Monica Relph, Katherine Douglas", "|Women 8+    || LeanderRosamund Bradbury, Katherine Douglas, Monica Relph, Karen Bennett, Pippa Whittaker, Louisa Reeve, Katie Greves, Polly Swann, Zoe de Toledo (cox)||Imperial College Donna Etiebet, Georgia Francis, Nicola Mason, Sara Parfett, Joanna Thom, Michelle Vezie, Isabell von Loga, Helen Wood, Christopher Au (cox)|| Newcastle UniversitySarah Fabes, Natasha Harris-White, Martha Dixon, Katherine Bulmer, Helen O'Riordan, Bridget Stratford, Emily Ford, Grace Hockenhull, Sasha Adwani (cox)"]}, {"page": "2013 British Rowing Senior Championships", "response": ["|Women 4-    || Leander Caragh McMurtry, Louisa Reeve, Lucinda Gooderham, Polly Swann||Imperial College / Oxford Brookes University / Minerva Bath Zoe Lee, Helen Wood, Olivia Carnegie-Brown, Helen Glover||Molesey  Ruth Walczak, Gabby Rodriguez, Karen Bennett, Samantha Fowler", "|Women 8+    || LeanderCaragh McMurtry, Louisa Reeve, Victoria Meyer-Laker, Pippa Whittaker, Frances Houghton, Polly Swann, Katie Greves, Victoria Thornley, Zoe de Toledo (cox)  || CompositeImogen Walsh, Melanie Wilson, Georgia Francis, Helen Wood, Beth Rodford, Zoe Lee, Helen Glover, Olivia Carnegie-Brown, Morgan Bayham-Williams (cox)||Cambridge UniversityJillian Tovey, Caroline Reid, Kate Ashley, Isabella Vyvyan, Claire Watkins, Melissa Wilson, Holly Game, Emily Day, Esther Monmcilovic (cox)"]}, {"page": "Jo Cook", "response": ["She was part of the British squad that topped the medal table at the 2011 World Rowing Championships in Bled, where she won a bronze medal as part of the eight with Alison Knowles, Jessica Eddie, Louisa Reeve, Natasha Page, Lindsey Maguire, Katie Greves, Victoria Thornley and Caroline O'Connor."]}]}}