{"wiki_id": "http://www.wikidata.org/entity/Q6688683", "itemLabel": "Louise Cordet", "itemDescription": "English pop singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Louise_Cordet", "wikipedia_page": {"main": "Louise Cordet (born Louise Boisot, 8 February 1945, England) is an English pop singer who also sang in French, best known as a one-hit wonder for her 1962 single, \"I'm Just a Baby\".", "link_mentions": [{"page": "Wraysbury", "response": ["* Louise Cordet, pop singer"]}, {"page": "Tony Meehan", "response": ["*Louise Cordet – \"I'm Just a Baby\" / \"In a Matter of Moments\" – 1962 (Decca)", "*Louise Cordet - \"Don't Let the Sun Catch You Crying\" / \"Loving Baby\" - 1964 (Decca)"]}, {"page": "Alexi Murdoch", "response": ["Murdoch was born in London to a Greek father and Louise Cordet, a Scottish-French singer, and lived in Greece until he was ten, when his family settled in Scotland.Hoard, Christian (21 September 2006), \"Alexi Murdoch\".  Rolling Stone. (1009):24Wise, Catherine (6 June 2003), \"A New Reason To Say No.\" Entertainment Weekly. (713):78"]}, {"page": "Every Time", "response": ["* \"Everytime\", a 1962 song by Louise Cordet"]}, {"page": "Jerry Lordan", "response": ["Lordan gave up singing for full-time writing. He wrote the Shadows' UK number one hit \"Wonderful Land\" (1962) and their hits \"Atlantis\" (which reached number two in 1963) and \"Mary Anne\" (a rare vocal single from the group). He achieved a further number one, \"Diamonds\" for the ex-Shadows' Jet Harris and Tony Meehan in 1963. Harris and Meehan also recorded his song \"Scarlett O'Hara\" taking it to number two in the same chart. He wrote other hits for Cliff Richard (\"A Girl Like You\"), Shane Fenton and Louise Cordet (\"I'm Just a Baby\")."]}, {"page": "Two Lovers (Mary Wells song)", "response": ["*Louise Cordet covered the song in 1964 in a Decca session with Jimmy Page."]}, {"page": "Don't Let the Sun Catch You Crying", "response": ["\"Don't Let the Sun Catch You Crying\" is a song written by Gerry Marsden, Freddie Marsden, Les Chadwick and Les Maguire, the members of British beat group Gerry and the Pacemakers.  It was first recorded and issued as a single by Louise Cordet in February 1964.  Shortly after Cordet's version failed to chart, the song was recorded by Gerry and The Pacemakers themselves in April 1964.  The Gerry and The Pacemakers recording became an international hit, and remains one of their best known singles.", "The song was given first to Louise Cordet, a singer who had previously toured with the group as well as with The Beatles.  Her version was produced by Tony Meehan and released on Decca Records in February 1964.  The group then decided to issue their own version. Biography of Louise Cordet by Bruce Eder, Allmusic.com. Accessed 14 November 2012 The record, like the group's earlier releases, was produced by George Martin."]}, {"page": "Just for Fun (film)", "response": ["*Louise Cordet"]}, {"page": "Roy Orbison/The Beatles Tour", "response": ["The Roy Orbison/The Beatles Tour was a 1963 concert tour of the United Kingdom by Roy Orbison and the Beatles. Other acts on the tour included Gerry and the Pacemakers, David MacBeth, Louise Cordet, Tony Marsh, Terry Young Six, Erkey Grant, and Ian Crawford. It was Orbison's first, and the Beatles' third nationwide tour of the UK. Although Orbison was originally intended to be the headlining act, the reaction to the Beatles on the tour caused them to be promoted to co-headliners, with the Beatles closing the set in the traditional headlining spot."]}, {"page": "Disk-O-Tek Holiday", "response": ["*Louise Cordet"]}, {"page": "David MacBeth", "response": ["In mid-1962, MacBeth represented Britain at the European Knokke Festival in Belgium. In July that year he switched to Piccadilly Records, who released his version of Bobby Vinton's US number one hit, \"Roses Are Red (My Love)\". The B-side of the single was \"Little Heart\", which had been written by Les Vandyke. Over this period, MacBeth was the compere on three separate occasions at the London Palladium. On 20 May 1963, the third date of the Roy Orbison/The Beatles Tour, MacBeth performed at the Gaumont Cinema, Southampton. Also on the bill were Gerry and the Pacemakers, Louise Cordet, Tony Marsh, Terry Young Six, Erkey Grant and Ian Crawford. The round Britain tour took in 42 locations on successive evenings. His subsequent single releases continued to flop and he turned to the cabaret circuit, before taking up work as a music agent in 1965. He had married a model, Margaret, in the meantime and they relocated to the south of England, before returning to Tyneside a few years later."]}]}}