{"wiki_id": "http://www.wikidata.org/entity/Q6680031", "itemLabel": "William Paget", "itemDescription": "British politician (1803-1873)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lord_William_Paget", "wikipedia_page": {"main": "Captain Lord William Paget (1 March 1803 – 17 May 1873) was a British naval commander and Whig politician.\nPaget was the second son of Field Marshal Henry Paget, 1st Marquess of Anglesey, by his first wife Lady Caroline Elizabeth, daughter of George Villiers, 4th Earl of Jersey, and Frances Villiers, Countess of Jersey. He was the brother of Henry Paget, 2nd Marquess of Anglesey and the half-brother of Lord Clarence Paget, Lord Alfred Paget and Lord George Paget. Paget served in the Royal Navy and achieved the rank of Captain. He also served as the Member of Parliament (MP) for Carnarvon from 1826 to 1830 (succeeding his uncle Sir Charles Paget) and Andover from 1841 to 1847.He was made a post captain, in the Royal Navy on 18 Oct0ber 1826, and was appointed captain of the vice-regal yacht HMS Royal Charlotte in November 1827 on a salary of £1,200, by the duke of Clarence for the duration of Paget's fathers, Irish lord lieutenancy.In 1828 he spoke in the House of Commons on the subject of Roman Catholic emancipation.Paget married Frances, daughter of Lieutenant-General Francis de Rottenburg, Baron de Rottenburg, in 1827. They had several children, including William Henry Paget, a Major-General in the Indian Army. Paget died in May 1873, aged 70. Lady William Paget survived him by two years and died in May 1875.", "link_mentions": [{"page": "Henry Paget, 1st Marquess of Anglesey", "response": ["Henry William Paget, 1st Marquess of Anglesey,  (17 May 1768 – 29 April 1854), styled Lord Paget between 1784 and 1812 and known as the Earl of Uxbridge between 1812 and 1815, was a British Army officer and politician. After serving as a Member of Parliament for Carnarvon and then for Milborne Port, he took part in the Flanders Campaign and then commanded the cavalry for Sir John Moore's army in Spain during the Peninsular War; his cavalry showed distinct superiority over their French counterparts at the Battle of Sahagún and at the Battle of Benavente, where he defeated the elite chasseurs of the French Imperial Guard. During the Hundred Days he led the charge of the heavy cavalry against Comte d'Erlon's column at the Battle of Waterloo. At the end of the battle he lost part of one leg to a cannonball. In later life he served twice as Master-General of the Ordnance and twice as Lord Lieutenant of Ireland.", "thumb|alt=Field Marshall Henry William Paget, 1st Marquis of Anglesey|The Marquess of Anglesey, 1840", "*Captain Lord William Paget RN (1 March 1803 – 17 May 1873); married Frances de Rottenburg, daughter of Francis de Rottenburg", "thumb|Caricature of Henry William Paget"]}, {"page": "William Paget", "response": ["William Paget may refer to:", "*William Paget, 1st Baron Paget (1506–1563), English statesman", "*William Paget, 4th Baron Paget de Beaudesert (1572–1629), English colonist", "*William Paget, 5th Baron Paget (1609–1678), English peer", "*William Paget, 6th Baron Paget (1637–1713), English peer and ambassador", "*William Paget (MP) (1769–1794), MP for Anglesey, 1790–1794", "*Lord William Paget (1803–1873), British naval commander and politician", "*William Paget (actor), 18th-century English actor and author"]}, {"page": "Marquess of Anglesey", "response": ["thumb|200px|William Paget, 1st Baron Paget.", "The Paget family descends from Sir William Paget, a close adviser to Henry VIII, who in 1553 was summoned to Parliament as Lord Paget de Beaudesert. His younger son, the third Baron, was a Catholic opponent of Elizabeth I. In 1589, he was attainted and his title forfeited. However, his son, the fourth Baron, was restored to the title in 1604. In contrast to his father he was a prominent Protestant. He was succeeded by his son, the fifth Baron. He was Lord Lieutenant of Buckinghamshire for the parliamentarians between 1641 and 1642, when he joined the Royalists and was dismissed. His son, the sixth Baron, was Ambassador to both Austria and the Ottoman Empire. On his death the title passed to his son, the seventh Baron. He had already been created Baron Burton, of Burton-on-Trent in the County of Stafford, in 1711, prior to succeeding to the barony of Paget in 1713. In 1714 he was further honoured when he was made Earl of Uxbridge, in the County of Middlesex. However, the earldom and barony of Burton became extinct on the death of his grandson, the second Earl (son of Thomas Catesby Paget, Lord Paget), in 1769.", "The barony of Paget, which could be passed on through the female line, devolved on his cousin Henry Bayly, who became the ninth Baron. He was the son of Sir Nicholas Bayly, 2nd Baronet, of Plas Newydd, and Caroline, Lady Bayly (d. 1766), daughter of Thomas Paget and granddaughter of the Hon. Henry Paget, second son of William Paget, 5th Baron Paget. In 1770 Henry Bayly assumed the surname and arms of Paget only. Twelve years later, in 1782, he succeeded his father in the baronetcy, and in 1784 the earldom of Uxbridge was revived for him, when he was made Earl of Uxbridge, in the County of Middlesex. He was succeeded by his eldest son, the second Earl. He was a prominent military commander who gained fame at the Battle of Waterloo, where he lost his leg. A few weeks after the battle he was made Marquess of Anglesey.", "The first Earl of the 1784 creation was especially prolific in notable offspring. His second son, William Paget, was a Captain in the Royal Navy and Member of Parliament. His third son, Sir Arthur Paget, was a diplomat and politician. (His son Sir Augustus Berkeley Paget was a diplomat. His second son Sir Ralph Paget was also a diplomat. Arthur Paget (1839–1924), son of Stewart Paget, eldest son of Sir Arthur Paget, was a vice-admiral in the Royal Navy.) ", "The first Marquess also had several notable descendants. His second son, Lord William Paget, was a naval commander and politician. His fourth son, Lord Clarence Paget, was a naval commander, politician and sculptor. His fifth son, Lord Alfred Paget, was a soldier, politician and courtier. (He was the father of (1) Sir Arthur Paget, a general in the Army; (2) Sydney Paget, a racehorse owner; and (3) Almeric Paget, a politician who was created Baron Queenborough in 1918 and who was the father of Dorothy Paget, a racehorse owner, and Olive Paget, a landowner and hostess.) His sixth son, Lord George Paget, was a general in the Army. Lord Alfred Paget is a descendant, and he was a prominent courtier and politician during the reign of Queen Victoria.", "*William Paget, 1st Baron Paget (c. 1506–1563) ", "*William Paget, 4th Baron Paget (1572–1628) (restored 1604)", "*William Paget, 5th Baron Paget (1609–1678)", "*William Paget, 6th Baron Paget (1637–1713)", "*Henry William Paget, 2nd Earl of Uxbridge (created Marquess of Anglesey in 1815)", "*Henry William Paget, 1st Marquess of Anglesey (1768–1854)"]}, {"page": "Lord Alfred Paget", "response": ["Paget was the sixth son of William Paget, the 1st Marquess of Anglesey and the former Hon. Charlotte Cadogan. Among his siblings were Lady Emily Paget (wife of John Townshend, 1st Earl Sydney), Lord Clarence Paget, Lady Mary Paget (wife of John Montagu, 7th Earl of Sandwich), Lord George Paget, and Lady Adelaide Paget (wife of Frederick William Cadogan).", "From his father's first marriage to Lady Caroline Villiers (a daughter of George Villiers, 4th Earl of Jersey and later, Duchess of Argyll), he had several older half-siblings, including Lady Caroline Paget (wife of Charles Gordon-Lennox, 5th Duke of Richmond), Henry Paget, 2nd Marquess of Anglesey, Lady Jane Paget (wife of Francis Conyngham, 2nd Marquess Conyngham), Lady Georgina Paget (wife of Edward Crofton, 2nd Baron Crofton), Lady Augusta Paget (wife of Arthur Chichester, 1st Baron Templemore), Lord William Paget, Lady Agnes Paget (wife of George Byng, 2nd Earl of Strafford). From his mother's first marriage to Henry Wellesley, 1st Baron Cowley, he had four half-siblings, including Henry Wellesley, 1st Earl Cowley, William Henry George Wellesley, Hon. Charlotte Wellesley (wife of Robert Grosvenor, 1st Baron Ebury), and Gerald Valerian Wellesley."]}, {"page": "Caernarfon (UK Parliament constituency)", "response": ["| Lord William Paget"]}, {"page": "Andover (UK Parliament constituency)", "response": ["| Lord William Paget  "]}, {"page": "1873 in Wales", "response": ["*17 May – Lord William Paget, soldier and politician, 70 "]}, {"page": "William Tollemache, Lord Huntingtower (1820–1872)", "response": ["At the cost of £3,500, Huntingtower succeeded in having himself returned as a Member of Parliament for Andover in the election of 1841; but lacking two days of his majority at the time of the election, was replaced by Lord William Paget."]}, {"page": "Lord George Paget", "response": ["His parents were both previously married, and divorced; his father to Lady Caroline Villiers (later the Duchess of Argyll), and his mother to Henry Wellesley (later 1st Baron Cowley). From his mother's previous marriage, his elder half-siblings included Hon. Charlotte Wellesley (wife of Robert Grosvenor, 1st Baron Ebury), Henry Wellesley, 1st Earl Cowley, and the Very Rev. Hon. Gerald Valerian Wellesley. From his father's previous marriage, his elder half-siblings included Lady Caroline Paget (wife of Charles Gordon-Lennox, 5th Duke of Richmond), Henry Paget, 2nd Marquess of Anglesey, Lady Jane Paget (wife of Francis Conyngham, 2nd Marquess Conyngham), Lady Georgina Paget (wife of Edward Crofton, 2nd Baron Crofton), Lady Augusta Paget (wife of Arthur Chichester, 1st Baron Templemore), Lord William Paget, and Lady Agnes Paget (wife of George Byng, 2nd Earl of Strafford)."]}, {"page": "List of MPs elected in the 1826 United Kingdom general election", "response": ["|Caernarvon||Lord William Paget||Whig"]}, {"page": "HMS Royal Charlotte (1824)", "response": ["Lord William Paget son of the marquess Anglesey was appointed captain of the vice-regal yacht, in November 1827 on a salary of £1,200, by the duke of Clarence for the duration of Paget's fathers, Irish lord lieutenancy."]}, {"page": "Caroline Campbell, Duchess of Argyll", "response": ["*Captain Lord William Paget RN (1 March 1803 – 17 May 1873), who married Frances de Rottenburg, daughter of Francis de Rottenburg"]}]}}