{"wiki_id": "http://www.wikidata.org/entity/Q6688784", "itemLabel": "Louise Henderson", "itemDescription": "British burlesque performer", "wikipedia_url": "https://en.wikipedia.org/wiki/Louise_Henderson_(burlesque)", "wikipedia_page": {"main": "Louise Henderson was an  English musical burlesque actress.  She appeared in productions at the Gaiety Theatre, London and at the Opera Comique in London.  She is described as a leading lady by W. J. MacQueen-Pope.", "link_mentions": [{"page": "Louise Henderson", "response": ["In 1952, at Weeks's urging, and with her husband's support, Louise Henderson returned to Paris for a year to improve her knowledge of modern painting. She studied there under Cubist artist and theorist Jean Metzinger. On her return to Auckland she was recognised as one of the leading Modernist painters. An exhibition of Henderson's adaptations of the cubist style was held at the Auckland City Art Gallery shortly after she returned from Paris in 1952. This show combined with exhibitions over following years in both Auckland and Wellington established her reputation as a modern artist of note.", "*2019-2020: Louise Henderson: From Life, a posthumous exhibition of Henderson's lifetime of work, at the Auckland Art Gallery.", "* Louise Henderson in the collection of the Museum of New Zealand Te Papa Tongarewa", "*Elizabeth Grierson: Louise Henderson. Art New Zealand, vol 46, pp77, Autumn 1988.", "*Louise Henderson, 'Embroidery as a Living Art', Art New Zealand, vol 14, pp37–38, September 1941.", "*Colin McCahon, 'Louise Henderson: Colin McCahon discusses the painter's work which was recently exhibited in Auckland', Home and Building, 1 February 1954.", "*E.H. McCormick, 'The Louise Henderson Exhibition – A Note in Retrospect', Landfall, pp54–55, March 1954.", "*Felicity Milburn, Lara Strongman, Julia Waite, Louise Henderson: from life. Auckland Art Gallery Toi o Tāmaki / Christchurch Art Gallery Te Puna o Waiwhetū, 2020.", "*Francis Pound, 'Louise Henderson – The Cubist Years: 1946–58', Art New Zealand, vol 61, pp62–67, Summer 1991."]}, {"page": "Miss Louise Henderson", "response": ["#REDIRECT Louise Henderson (burlesque)"]}, {"page": "List of female dancers", "response": ["* Louise Henderson (burlesque) (dates unknown)"]}]}}