{"wiki_id": "http://www.wikidata.org/entity/Q6680033", "itemLabel": "Lord William Stuart", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Lord_William_Stuart", "wikipedia_page": {"main": "Captain Lord William Stuart (18 November 1778 – 25 July 1814), was a British naval commander and Tory politician.", "link_mentions": [{"page": "1778", "response": ["* November 18 – Lord William Stuart, British politician (d. 1814)"]}, {"page": "Marquess of Bute", "response": ["Lord William Stuart, fourth son of the first Marquess, was a captain in the Royal Navy and Member of Parliament. Lord George Stuart (1780–1841), fifth son of the first Marquess, was a rear-admiral in the Royal Navy. Lord Dudley Stuart, sixth son of the first Marquess (and eldest from his second marriage), was a member of parliament. Lord Patrick Crichton-Stuart, second son of Lord Mount Stuart, eldest son of the first Marquess, was Member of Parliament for Cardiff. His eldest son James Crichton-Stuart also represented this constituency in Parliament. Lord Ninian Crichton-Stuart, second son of the third Marquess, was also Member of Parliament for Cardiff before his early death in the First World War. Lord Colum Crichton-Stuart, third and youngest son of the third Marquess, sat as Member of Parliament for Northwich for many years. Lord Robert Crichton-Stuart, second son of the fourth Marquess, was Lord-Lieutenant of Buteshire. Lord Rhidian Crichton-Stuart, fifth and youngest son of the fourth Marquess, was a British member of the International Legislative Assembly of the Tangier International Zone."]}, {"page": "John Stuart, 1st Marquess of Bute", "response": ["*Captain Lord William Stuart (18 November 1778 – 28 July 1814)"]}, {"page": "HMS Euryalus (1803)", "response": ["On 30 July 1809, a British force of 39,000 men landed on Walcheren, initiating the Walcheren Campaign. Euryalus joined the squadron under Captain Lord William Stuart in  that on 11 August forced the passage of the Scheldt between the batteries at Flushing and Cadsand. Euryalus herself had no casualties although the British lost two men killed and nine wounded in other ships.James (1837), Vol. 5, p. 136. Although the Walcheren Expedition, which ended on 9 August 1809, was notably unsuccessful, Euryalus was among the myriad vessels sharing in the prize money form the campaign."]}, {"page": "Cardiff (UK Parliament constituency)", "response": ["| Lord William Stuart"]}, {"page": "Lord Evelyn Stuart", "response": ["Stuart was elected to the House of Commons in February 1794, succeeding his deceased elder brother Lord Mount Stuart as the member for Cardiff Boroughs, but was not allowed to take his seat in Parliament until his twenty-first birthday in June that year. He continued to represent the constituency until 1802, when he was replaced by his younger brother Lord William Stuart. On the latter's death, Stuart was elected to resume his representation on 7 November 1814, holding the seat until 23 June 1818. He was then replaced by another member of the family, his nephew Lord Patrick Crichton-Stuart.http://hansard.millbanksystems.com/commons/1815/mar/08/petitions-respecting-the-corn-laws"]}, {"page": "William Stuart", "response": ["* Lord William Stuart (1778–1814), naval commander, MP for Cardiff (1802–14); nephew of William Stuart (1755–1822)"]}, {"page": "Alexander Thomas Emeric Vidal", "response": ["Vidal was born in 1792, the youngest of four children of Emeric Vidal, who served in the Royal Navy.  Alexander followed his father, embarking on a naval career in December 1803 when he joined  as a 1st class volunteer. He served alternately under Sir Charles Hamilton, Michael Seymour and W. Shield. He initially served in the English Channel, off the north coast of Spain and in the West Indies, until November 1805. He later joined the Royal Naval College at Portsmouth, before joining  in November 1809. Here he served under Lord William Stuart, and George Digby. He spent three years aboard the Lavinia at the rank of midshipman, and saw service in the Mediterranean and West Indies, and at Cadiz and Lisbon."]}, {"page": "Barrington Dacres", "response": ["Barrington Dacres took command of the newly converted bomb vessel  in 1799. He remained in command until 27 February 1801, when he put into the Italian port of Ancona, unaware that it had been captured by the French. The French seized the Bulldog.  Captain Thomas Rogers of   attempted to recapture the Bulldog by cutting her out of the port.  Although Rogers was nearly successful, the British were forced to abandon her again. She was finally retaken off Gallipoli on 16 September 1801 by Lord William Stuart's . Dacres's career does not appear to have been particularly adversely affected by the accidental loss of his ship. He was promoted to Post-Captain on 29 April 1802. He took command of the 74-gun third rate  in May 1803, and recommissioned her in July that year. On 5 June, he captured the Petronelle. By September, he was cruising in the English Channel as part of Sir Edward Pellew's squadron, when the French 74-gun Duguay-Trouin was spotted sailing in company with the 38-gun frigate Guerrière. The two had already been engaged by , under Captain John Maitland, but the French ships had driven her off and were now bound for Corunna. Dacres took the Culloden in pursuit, eventually closing the distance and opening fire. The Duguay-Trouin was first to reach the safety of the port, but Dacres continued to engage the Guerrière until he was almost under the guns of the shore batteries. He eventually veered away, having inflicted considerable damage and several casualties. Dacres remained in command of Culloden until being succeeded by Captain George Reynolds in February 1804."]}, {"page": "William Stuart (Cardiff)", "response": ["#REDIRECT Lord William Stuart"]}, {"page": "HMS Venus (1758)", "response": ["Between March and May 1809 she was fitted for Baltic service. Captain Hood Hanway Christian recommissioned Heroine in March and commanded her until November 1809. Heroine participated in the reduction of Flushing in 1809 during the Walcheren Campaign. In this engagement Heroine was part of a squadron of ten frigates under the command of Captain Lord William Stuart."]}, {"page": "List of United Kingdom by-elections (1806–1818)", "response": ["|7 November 1814||Cardiff Boroughs||u||Lord William Stuart||Lord Evelyn James Stuart||Death"]}, {"page": "Hood Hanway Christian", "response": ["Christian commanded HMS Heroine (formerly ) from March to November 1809. In this 32-gun frigate he participated in the reduction of Flushing in 1809 during the Walcheren Campaign. The Heroine was part of a squadron of ten frigates under the command of Captain Lord William Stuart. On 11 August 1809 this squadron sailed up the Western Scheldt under a light wind, suffering minor damage from the shore batteries of Flushing and Cadzand.  Two men were wounded on the Heroine. On 13 August seven 74-gun line-of-battle ships under Rear-Admiral Sir Richard Strachan entered the  river and began an intense bombardment of Flushing that lasted until the town surrendered on 15 August."]}, {"page": "HMS Crescent (1784)", "response": ["Captain Lennox Thompson took command of Crescent in July 1802 and in June the following year, Crescent was recommissioned under Lord William Stuart."]}, {"page": "List of children of prime ministers of the United Kingdom", "response": ["*Capt. Lord William Stuart – MP for 12 years"]}, {"page": "List of MPs elected in the 1806 United Kingdom general election", "response": ["| Lord William Stuart"]}, {"page": "List of MPs elected in the 1802 United Kingdom general election", "response": ["| Lord William Stuart"]}, {"page": "List of MPs elected in the 1807 United Kingdom general election", "response": ["| Lord William Stuart"]}, {"page": "List of MPs elected in the 1812 United Kingdom general election", "response": ["| Lord William Stuart – died Replaced by Lord Evelyn James Stuart 1814"]}, {"page": "HMS Lavinia", "response": ["Lavinia was first commissioned in February 1806 under Lord William Stuart and once finished, began her service in the Channel. On 15 August 1807, she arrived in Plymouth from Rochefort with despatches for Admiral Alan Gardner from Rear-Admiral Richard Strachan. She sailed for the Mediterranean on 30 January 1808, where she joined a fleet under Vice Admiral Cuthbert Collingwood. "]}]}}