{"wiki_id": "http://www.wikidata.org/entity/Q6688384", "itemLabel": "Louis William Desanges", "itemDescription": "British painter (1822-1906)", "wikipedia_url": "https://en.wikipedia.org/wiki/Louis_William_Desanges", "wikipedia_page": {"main": "Louis William Desanges; Chevalier Desanges (1822–1905) was an English artist of French background, known today for his paintings of Victoria Cross winners.", "link_mentions": [{"page": "Wantage", "response": ["In the 19th century, Lord Wantage became a notable local and national benefactor. He was very involved in founding the British Red Cross Society. In 1877 he paid for a marble statue of King Alfred by Count Gleichen to be erected in Wantage market place, where it still stands today. He also donated the Victoria Cross Gallery to the town. This contained paintings by Louis William Desanges depicting deeds which led to the award of a number of VCs, including his own gained during the Crimean War. It is now a shopping arcade. Wantage is home to the Community of Saint Mary the Virgin, founded by the vicar of Wantage William John Butler in 1848; it was once one of the largest communities of Anglican nuns in the world. Wantage once had two breweries which were taken over by Morlands of Abingdon.  In 1988 the town was thrust into the headlines after a Brass Tacks programme entitled \"Shire Wars\" exposed the drunken violence that plagued the town and surrounding villages at that time."]}, {"page": "Robert Loyd-Lindsay, 1st Baron Wantage", "response": ["Loyd-Lindsay became a notable local and national benefactor, with a number of donations made to the town of Wantage (the nearest town to Loyd-Lindsay's home). In 1877 he paid for a marble statue of King Alfred by Count Gleichen to be erected in Wantage market place, where it still stands today. He also donated the Victoria Cross Gallery to the town. This contained paintings by Louis William Desanges depicting deeds which led to the award of a number of VCs, including his own gained during the Crimean War."]}, {"page": "Charlotte Spencer, Countess Spencer", "response": ["Lord and Lady Spencer had no children. She died on 31 October 1903, and was buried at the parish church of St Mary the Virgin in Great Brington, Northamptonshire. Her husband died on 13 August 1910 and was buried beside her. He was succeeded by his half-brother Charles as the next Earl Spencer. During her lifetime, Lady Spencer was the subject of many paintings, including one by the French artist Louis William Desanges that was painted at Althorp. In 1907, her memoirs were published."]}, {"page": "Victoria Cross", "response": ["The subject of soldiers earning the VC has been popular with artists since the medal's inception. Notable are the fifty paintings by Louis William Desanges that were painted in the late 1850s and early 1860s. Many of these were exhibited at the Egyptian Gallery in Piccadilly, but in 1900, they were brought together by Lord Wantage as the Victoria Cross Gallery and exhibited in the town of Wantage, at that time in Berkshire. Later, the collection was broken up and many of the paintings were sent to the various regiments depicted. Some were damaged or destroyed.See Sally Whipple. (2001). Catalogue of the Series of Historical Pictures by Chevalier L. W. Desanges. (Wantage, 2000). This was the catalogue to an exhibition of photographic reproductions of many of the paintings held in Wantage to honour the Millennium. A number of the acts were also portrayed in a Second World War propaganda pamphlet, and the images commissioned by the Ministry of Information are presented in an online gallery available on the website of The National Archives. In 2016, portrait photographer Rory Lewis was commissioned by the Victoria Cross and George Cross Association to hold portrait sittings with all living recipients of the Victoria Cross and the George Cross."]}, {"page": "James Dafforne", "response": ["|Louis William Desanges"]}, {"page": "Desanges", "response": ["*Louis William Desanges (1822–1905), English artist of French background"]}]}}