{"wiki_id": "http://www.wikidata.org/entity/Q6686796", "itemLabel": "Louis Briscoe", "itemDescription": "British footballer (born 1988)", "wikipedia_url": "https://en.wikipedia.org/wiki/Louis_Briscoe", "wikipedia_page": {"main": "Louis Andrew Briscoe (born 2 April 1988) is an English professional footballer who plays for United Counties League Premier Division North side Gresley. His playing position is primarily on the right wing, although he can play as a striker or on the left wing.\nHe started his career with Football League side Port Vale in 2005, but failed to make an impact and moved on to non-league Leek Town two years later. After brief spells with Hednesford Town, Gresley Rovers, Stafford Rangers, and Ilkeston Town, he won a move to Conference club Mansfield Town in 2009. He helped the club to an FA Trophy final and was named in the Conference Team of the Year in 2010–11. He then won the Conference Premier title with Mansfield in 2012–13. He was loaned out to Nuneaton Town in October 2013, before ending his five-year stay at Mansfield in May 2014. In June 2014 he signed for Torquay United. He joined Wrexham in January 2016, before moving on to Tamworth five months later. He joined Boston United on loan in March 2017, before a permanent move to Stafford Rangers in June 2017. He switched to Sutton Coldfield Town and Mickleover Sports briefly in January 2018, before returning to Stafford Rangers in the summer. He rejoined former club Gresley in January 2020.", "link_mentions": [{"page": "Mansfield Town F.C.", "response": ["Caretaker manager Duncan Russell led Mansfield to an FA Trophy final appearance in 2010–11, Louis Briscoe scoring a late extra-time winner against Luton in the semi-final second leg. The Stags lost 1–0 to Darlington at Wembley Stadium after a 120th-minute extra-time goal by Chris Senior. A league position of 12th was not good enough for Russell to keep his job; Paul Hall replaced him as interim manager during the close season."]}, {"page": "England national football C team", "response": ["|Louis Briscoe"]}, {"page": "Kyle Nix", "response": ["Nix has appeared for various England youth international teams including under 16s, under 18s and under 20s. He scored twice for the under 17s, in a 4–0 victory over Faroe Islands and another in a 2–1 victory over Norway, during the Nordic International Tournament in 2002. After moving to Mansfield Town in 2009, he was eligible to play for the England C team, which is the team which represents England at non-league level. He was one of three Mansfield players, along with Louis Briscoe and Scott Garner, to play in a 1–1 with Hungary on 15 September 2009. He was called back up for the England C team by manager Paul Fairclough a year later."]}, {"page": "Louis Andrew Briscoe", "response": ["#REDIRECT Louis Briscoe"]}, {"page": "2005–06 Port Vale F.C. season", "response": ["|align=\"left\"|MF||35||align=\"left\"| Louis Briscoe"]}, {"page": "2006–07 Port Vale F.C. season", "response": ["The season started with Vale in fine form, winning their first four games. His four goals meant Constantine was named the division's Player of the Month for August.Coca-cola Manager of the Month 2006-07  Football League.co.uk. Retrieved on 24 March 2007 This run came to a halt with four defeats in the next five games, Vale scoring just three goals. In November, Ross Gardner was signed on loan from Nottingham Forest, and would join permanently in the January transfer window. Foyle also signed defender Clayton Fortune on a season long loan for a second time, this time from Leyton Orient. Heading into December with just three wins in fifteen league games, they won their first four games, with Constantine hitting five of Vale's nine goals. In January, Foyle splashed out £30,000 on Crewe Alexandra striker Luke Rodgers. He also signed former teammate Paul Musselwhite as an emergency back-up goalkeeper following an injury to Mark Goodlad, as well as Cardiff City midfielder Malvin Kamara. He also turned down an offer from Barnsley of £200,000 (plus Marc Richards) for Constantine, who claimed to be happy at Vale Park. However he did sell skilful winger Jeff Smith to Carlisle United for £60,000. Also leaving Burslem was Louis Briscoe, who was allowed to join Leek Town. Vale's form had left them once again, as they failed to pick up a win in a sequence of seven games. In February, defender Rhys Weston joined on a short-term contract, having left Norwegian club Viking FK. On 10 March, Vale travelled to the Don Valley Stadium, and Sodje managed to hit four goals past the Rotherham United defence to give Vale a 5–1 win. This gave Vale fans a sliver of hope of reaching the play-offs, but Vale failed to string two wins together in their final nine games, despite a 3–0 win over nearby Crewe Alexandra.", "|align=\"left\"|MF||24||align=\"left\"| Louis Briscoe", "| January 2007 || FW ||  || Louis Briscoe || Leek Town || Released || "]}, {"page": "2011 FA Trophy Final", "response": ["The game was a particularly even affair with both sides carving out early chances. Darlington goalkeeper Sam Russell had to be alert early on to clear an Adam Murray pass which had sent Duncan Russell clean through on goal. At the other end, Alan Marriott did well to punch away a corner from Aaron Brown before Liam Hatch could get his head on it. In the 18th minute, a Mansfield corner was met by the head of former Darlington captain Steve Foster, but the ball sailed well over the bar. On 32 minutes, Gary Smith broke into the Mansfield, where he appeared to be brought down by Louis Briscoe. Referee Stuart Attwell, who was well placed, waved away the penalty appeals. Darlington suffered a blow on 38 minutes when Smith, who had been lively in midfield, limped off to be replaced by Aman Verma. The first half of the match concluded with the score at 0–0.", "|FW ||7|| Louis Briscoe"]}]}}