{"wiki_id": "http://www.wikidata.org/entity/Q6696603", "itemLabel": "Luci Shaw", "itemDescription": "British poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Luci_Shaw", "wikipedia_page": {"main": "Luci Shaw (born December 29, 1928) is a Christian writer of poetry and essays.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Luci Shaw (born 1928, E/US)"]}, {"page": "List of poets", "response": ["*Luci Shaw (born 1928), English-born Christian poet"]}, {"page": "Madeleine L'Engle", "response": ["* Wintersong: Christmas Readings (1996, with Luci Shaw) ", "* Friends for the Journey (1997, with Luci Shaw) ", "* A Prayerbook for Spiritual Friends (1999, with Luci Shaw) "]}, {"page": "Regent College", "response": ["At present, Regent College employs 17 full-time faculty. Notable faculty emeriti include Eugene Peterson, Maxine Hancock, Loren Wilkinson, Gordon T. Smith, Paul Stevens, Gordon Fee, J.I. Packer and Bruce Waltke. Summer school classes are often taught by some notable Christian thinkers, including N.T. Wright, Andrew Walls, Luci Shaw, Richard Mouw, Alister McGrath, Malcolm Guite, George Marsden and Mark Noll."]}, {"page": "Luci", "response": ["* Luci Shaw (b. 1928), English poet living in the United States"]}, {"page": "New College Berkeley", "response": ["* Luci Shaw, poet"]}, {"page": "List of Wheaton College (Illinois) alumni", "response": ["* Luci Shaw, BA English Literature/New Testament Greek, magna cum laude, poet"]}, {"page": "List of Regent College alumni and faculty", "response": ["* Luci Shaw, poet, remains a writer-in-residence at Regent College"]}, {"page": "Wordfarm", "response": ["Rane Arroyo, Stacy Barton, David Caplan, Steven Cramer, Debra Kang Dean, Bryan D. Dietrich, Forrest Gander, Ruth Goring, Mark Halliday, Jerry Harp, H. L. Hix, Mark Irwin, Erin Keane, Sarah Kennedy, John Leax, Eric Pankey, Alan Michael Parker, Kevin Prufer, Debra Rienstra, Tania Runyan, Lynda Rutledge, Luci Shaw, Lisa Russ Spaar, Michael Theune, Jeanie Thompson, Jonathan Weinert, Paul J. Willis, Matthew Zapruder and James A. Zoller."]}]}}