{"wiki_id": "http://www.wikidata.org/entity/Q6697393", "itemLabel": "Lucinda Roy", "itemDescription": "British novelist, poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Lucinda_Roy", "wikipedia_page": {"main": "Lucinda Roy (born December 19, 1955) is an American-based British novelist, educator and poet.", "link_mentions": [{"page": "Virginia Tech shooting", "response": ["Novelist Lucinda Roy, the former chair of Virginia Tech's English department, was also critical of the way the university treated Cho as a student. In her book No Right to Remain Silent: The Tragedy of Virginia Tech, Roy recounts how she worked with Cho one-on-one in a poetry tutorial and felt he didn't get the help that he needed."]}, {"page": "Seung-Hui Cho", "response": ["Nikki Giovanni says she taught Cho in a poetry class in the fall of 2005; she says she had him removed from her class because she found his behavior \"menacing.\" She recalled that Cho had a \"mean streak\" and described his writing as \"intimidating.\" Giovanni reports that Cho wore sunglasses in class and that when she tried to get him to participate in class discussion, Cho remained silent. In Giovanni's class, Cho had intimidated female classmates by photographing their legs under their desks and by writing violent and obscene poetry. In the fall of 2005, Giovanni told the then-department head Lucinda Roy she \"was willing to resign before [she] was going to continue with [Cho].\" After this, Roy removed Cho from the class.Fernandez, M. & Santora, M. (April 18, 2007). Gunman Showed Signs of Anger. The New York Times. Retrieved April 19, 2007.", "Roy says that since she found Cho's writings to be very disturbing, she asked for help to the police and the university administration; however, Roy states that the police had \"difficulty\" since Cho did not make any explicit threat. After Giovanni was informed of the massacre, she remarked that she \"knew when it happened that that's probably who it was,\" and \"would have been shocked if it wasn't.\" Roy had taught Cho in Introduction to Poetry the previous year. She described him as \"actually quite arrogant and could be quite obnoxious, and was also deeply, it seemed, insecure\"Acosta, J. (April 17, 2007). Disturbing writings: Video interview with Lucinda Roy. CNN. Retrieved April 17, 2007. and that she told him numerous times to go to counseling. She said that Cho resisted speaking in class and took cell phone pictures of her. After Roy became concerned with Cho's behavior and the themes in his writings, she started meeting with Cho to work with him one-on-one. However, she soon became concerned for her safety, and told her assistant that she would use the name of a dead professor as a duress code, in order to alert the assistant to call security. After Roy notified authorities of Cho's behavior, she urged Cho to seek counseling, but to her knowledge, Cho never followed through with the request. Roy described Cho as seeming \"extraordinarily lonely\" and said that Cho \"said to me once he was lonely and didn't have friends.\"", "According to the Virginia Tech report, Cho \"seemed to enjoy the idea of writing, especially poetry. His sister noticed that he would bring home stacks of books on literature and poetry and books on how to become a writer. Writing seemed to have become a passion, and his family was thrilled that he found something he could be truly excited about. He would spend hours at his computer writing, but when his sister asked to see his work, he would refuse. On one rare occasion, she did get to read a story he wrote about a boy and his imaginary friend, which she thought was somewhat strange, but nothing too odd.\"While in college, Cho wrote to Lucinda Roy, the chairwoman of the English department, to ask her for the names of a publisher or agent who could help get him published. He wrote her: \"My novel is relative[ly] short ... sort of like Tom Sawyer except that it's really silly and pathetic, depending on how you look at it.\" Cho submitted his idea to a publisher from New York, which rejected his book proposal in 2004. This refusal greatly reduced Cho's drive for writing."]}, {"page": "Lucinda roy", "response": ["#REDIRECT Lucinda Roy "]}, {"page": "Timeline of the Virginia Tech shooting", "response": ["* Lucinda Roy, co-director of the creative writing program removed Cho from Professor Giovanni's class and tutored him one-on-one. When Cho refused to go to counseling, Roy notified the Division of Student Affairs, the Cook Counseling Center, the Schiffert Health Center, the Virginia Tech police and the College of Liberal Arts and Human Sciences."]}, {"page": "Template talk:Virginia Tech shooting", "response": ["==Nikki Giovanni and Lucinda Roy==", ":: Update: I've changed the template to emphasize its function as a link to related articles. Only articles containing the template are listed, just as in other navboxes. No \"identifiers\"—such as \"Victims\", or \"Perpetrator\"—are included. I kept the piped versions of the article names for the Media Coverage and Timeline, as the actual article names are so long they would require two lines or widen the box unnecessarily. As an aside, I went through the articles yesterday that were using the box and removed it from those where it didn't belong, notably Lucinda Roy and Charles Steger.—D'Ranged 1 VTalk 17:34, 6 July 2014 (UTC)", ": I think you have a different definition of \"poignant\" than I do. You also are interpreting WP:Undue in a new and different way; that requires consensus. (You again used it as a reason for your removal of the links to specific articles at :Virginia Tech massacre; however, what you replaced the links with was an improvement. Having the links there didn't violate WP:Undue.) The logic behind including the articles in the navbox is that the massacre was an event; the listed articles all are connected to the event. The articles for people are for victims of, or participants in, the event itself. There's nothing contradictory about my logic.(Update for most recent edit.) I have added Goddard's article to the list of links; he is an injured survivor, therefore, a participant. Again, the logic I'm employing doesn't warrant including Lucinda Roy or Charles Steger in the links, nor should this template be on their article pages. (It isn't currently.) Thanks!—D'Ranged 1 VTalk 19:20, 9 July 2014 (UTC)"]}, {"page": "List of alumni of King's College London", "response": ["*Lucinda Roy – literary scholar"]}, {"page": "Virginia Tech commencement speakers", "response": ["|Lucinda Roy, Gloria D. Smith Professor of Black Studies, Virginia Tech"]}, {"page": "Virginia Tech College of Liberal Arts and Human Sciences", "response": ["*Lucinda Roy, an Alumni Distinguished Professor of English, is a novelist, educator, and poet. Currently, she teaches graduate classes in the college's Creative Writing M.F.A. program."]}, {"page": "Daughters of Africa", "response": ["* Lucinda Roy"]}, {"page": "Bogle-L'Ouverture Publications", "response": ["Among other notable titles on the BLP list are Linton Kwesi Johnson's Dread Beat and Blood, Beryl Gilroy's Black Teacher, several books by Andrew Salkey (a director and long-time supporter of BLP),\"Bogle-L’Ouverture: A story in Black publishing\", Guyana Chronicle, 8 January 2012. (Extract from an interview with Rickford Benjamin-Huntley, Georgetown, Guyana, December 2011.) Journey to an Illusion: The West Indian in Britain by Donald Hinds, and poetry collections by Valerie Bloom, Sam Greenlee, Lemn Sissay,Lemn Sissay has said: \"Holding that first book in my young hands – I was 21 – was one of the most life affirming experiences of my existence to date. It was a gift bestowed by two incredible people, Jessica and Eric Huntley, at a small important publishing house in Ealing West London called Bogle-L'Ouverture.\" \"Meet the 2014 Authors – Lemn Sissay\", Emirates Airline Festival of Literature, 9 February 2014. Lucinda Roy, Imruh Bakari and John Lyons.\"Selected Bogle-L'Ouverture Publications\", in Andrews (2014), pp. 179–181. "]}, {"page": "Namba Roy", "response": ["Namba Roy (25 April 1910 – 16 June 1961)Mervyn Morris, \"'Strange Picni': Namba Roy's Black Albino\", Jamaica Journal, Vol. 17, No. 1, February 1984 (pp. 24–27), p. 25. Via University of Florida George A. Smathers Libraries.Yvonne Roy, \"The Maker of Madonnas\", The Guardian, 15 September 1961 (Women's Page, p. 8).\"Namba ROY (JAMAÏQUE/1910–1961)\", Association ASCODELA, 9 March 2011 (in French). was a Jamaican novelist and artist. He was the father of writer and educator Lucinda Roy.", "Roy and his English wife Yvonne (née Shelley), an actress,\"Lucinda Roy\", The Literary Encyclopedia. who met in 1950, had three children: Tamba, Jacqueline and Lucinda.\"Namba Roy (1910-1961)\", PetrineArcher.com."]}, {"page": "List of women writers (M–Z)", "response": ["*Lucinda Roy (b. 1955, United States/England), nv."]}]}}