{"wiki_id": "http://www.wikidata.org/entity/Q6696635", "itemLabel": "Lucia Elizabeth Vestris", "itemDescription": "British actress, theatre manager and contralto", "wikipedia_url": "https://en.wikipedia.org/wiki/Lucia_Elizabeth_Vestris", "wikipedia_page": {"main": "Lucia Elizabeth Vestris (née Elizabetta Lucia Bartolozzi; 3 March 1797 – 8 August 1856) was an English actress and a contralto opera singer, appearing in works by, among others, Mozart and Rossini. While popular in her time, she was more notable as a theatre producer and manager. After accumulating a fortune from her performances, she leased the Olympic Theatre in London and produced a series of burlesques and extravaganzas, especially popular works by James Planché, for which the house became famous. She also produced his work at other theatres she managed.\n\n", "link_mentions": [{"page": "Squire Bancroft", "response": ["The Bancroft management at the Prince of Wales's Theatre constituted a new era in the development of the English stage and had the effect of reviving the London interest in modern drama.  They were also responsible for making fashionable the \"box set\", which Lucia Elizabeth Vestris had first used at the Olympic Theatre in the 1830s – this consisted of rooms on stage which were dressed with sofas, curtains, chairs, and carpets on the stage floor.  They also provided their actors with salaries and wardrobes.  Also, the Bancrofts redesigned their theatre to suit the increasingly upscale audience: \"The cheap benches near the stage, where the rowdiest elements of the audience used to sit were replaced by comfortable padded seats, carpets were laid in the aisles, and the pit was renamed the stalls.\"Information about Cup and Saucer realism  (PeoplePlay UK)"]}, {"page": "Gaétan Vestris", "response": ["Auguste made his debut at 12 with the Paris Opéra and was the company's leading dancer for 36 years. Auguste's son, Auguste Armand Vestris (1788–1825), husband of Lucia Elizabeth Vestris, took to the same profession and made his debut at the opera in 1800, but left Paris for England, Italy and Vienna never reappearing in France. Gaetano's brother, Angiolo Vestris (1730–1809), formerly a dancer and later an actor at the Comédie-Italienne, married Marie Rose Gourgaud, the sister of the actor Dugazon. Gaetano and Angiolo's sister, Thérèse (1726-1808), was also a dancer."]}, {"page": "William Farren", "response": ["In fall of 1837, he joined the troupe run by Lucia Elizabeth Vestris at the Olympic Theatre, and he stayed with Vestris during her management of Covent Garden, ending in 1842. His most notable new role during this period was as Sir Harcourt Courtly in Dion Boucicault's London Assurance.Walsh 24."]}, {"page": "1856 in music", "response": ["*August 8 – Lucia Elizabeth Vestris, actress and singer (d. 1797)"]}, {"page": "Madame Vestris", "response": ["*Lucia Elizabeth Vestris (born Lucia Elizabeth Bartolozzi, 1797–1856), English singer, actress and theatre producer and manager, married to the French dancer, Armand Vestris"]}, {"page": "Lyceum Theatre, London", "response": ["The Lyceum was later managed by Madame Lucia Elizabeth Vestris and Charles James Mathews from 1847–55, who produced James Planché's \"[fairy] extravaganzas\" featuring spectacular stage effects.  Their first big success was John Maddison Morton's Box and Cox.  Tom Taylor's adaptation of A Tale of Two Cities, with Dickens himself as consultant, played in 1860, shortly after end of its serialisation and volume publication.  Charles Fechter, who managed the theatre from 1863–67 also favored spectacular productions. In 1866, Dion Boucicault's The Long Strike (his adaptation of Elizabeth Gaskell's Manchester novels Mary Barton and Lizzie Leigh) was produced here.  Ethel Lavenu, the mother and grandmother of actors Tyrone Power Sr. and Tyrone Power performed in a number pieces at the theatre in the 1860s.  W. S. Gilbert produced three plays here. In 1863, his first professional play, Uncle Baby, premièred.Crowther (2011), p. 45  In 1867, he presented his Christmas pantomime, called Harlequin Cock Robin and Jenny Wren, and in 1884, he produced the drama Comedy and Tragedy.\"Lyceum Theatre\", The Times, 27 December 1867; Howarth, Paul. \"Comedy and Tragedy\", Gilbert and Sullivan Archive, 14 August 2011, accessed 4 October 2016"]}, {"page": "Auguste Vestris", "response": ["Auguste Vestris is not to be confused with his son, Armand Vestris, who married the English actress-manager Lucia Elizabeth Vestris in 1813. Both Armand and a cousin Charles Vestris, son of a brother of Auguste's, were also dancers.Philip H. Highfill et al, A biographical dictionary of actors, actresses, musicians, dancers, managers & other stage personnel in London, 1660–1800, Carbondale (USA), Southern Illinois University Press, 1993, XV, pp. 149–150, ; Henry Sutherland Edwards, History of the Opera, from its Origin in Italy to the present Time, Londra, Allen, 1862, I, p. 302 (accessible for free online at Google Books)."]}, {"page": "Lucia Elizabeth (Bartolozzi) Vestris", "response": ["#REDIRECTLucia Elizabeth Vestris"]}, {"page": "Effie Bancroft", "response": ["The Bancrofts were also responsible for making fashionable the 'box set', which Lucia Elizabeth Vestris had first used at the Olympic Theatre in the 1830s – this consisted of rooms on stage which were dressed with sofas, curtains, chairs, and carpets on the stage floor.  They also provided their actors with salaries and wardrobes.  Also, the Bancrofts redesigned their theatre to suit the increasingly upscale audience: \"The cheap benches near the stage, where the rowdiest elements of the audience used to sit were replaced by comfortable padded seats, carpets were laid in the aisles, and the pit was renamed the stalls.\"Information about Cup and Saucer realism  (PeoplePlay UK)"]}, {"page": "Olympic Theatre", "response": ["In 1830, Lucia Elizabeth Vestris (1787–1856) leased the house,Pearce, Charles E. Madame Vestris and her times, New York, Brentano's, pp. 161–63 becoming the first female actor-manager in the history of London theatre. She had already made her fortune as a singer, a dancer (of some repute) and an actor. Together with her business partner, Maria Foote, and later with her husband, the actor Charles James Mathews,  who joined the company in 1835, Madame Vestris initiated several theatrical innovations, such as the use of historically correct costumes and more elaborate scenery, including a box set with ceiling, which she is said to have introduced in Britain. Her stewardship began with a programme of four pieces including Olympic Revels,Theatre Museum (PeoplePlay), accessed 23 March 2007. and under her management the theatre continued to feature light comedies including music, which were legally styled burlettas and whose licence she had been granted by the Lord Chamberlain.Bratton, Jacky. \"Vestris, Lucia Elizabeth (1797–1856)\", Oxford Dictionary of National Biography, Oxford University Press, 2004, accessed 12 March 2014  Many were written by J. R. Planché and Charles Dance, featuring Vestris in breeches roles, and the popular comedian of the day, John Liston. The plays often burlesqued classical themes: My Great Aunt – or, Relations and Friends; The Loan of a Lover; The Court Beauties; The Garrick Fever; Faint Heart Never Won Fair Lady; Olympic Revels – or Prometheus and Pandora; Olympic Devils – or Orpheus and Eurydice; The Paphian Bower – or Venus and Adonis; Telemachus – or The Island of Calypso.Victorian Plays, accessed 23 March 2007. While Vestris' licence only allowed the performance of extravaganzas and burlesques, the quality of the performance was paramount, with much time spent on rehearsal and selection of the company."]}, {"page": "Vestris", "response": ["* Lucia Elizabeth Vestris (Elizabetta Lucia Bartolozzi, 1797–1856), English singer and actress-manager, wife of Auguste Armand Vestris, called on stage Madame Vestris as well as her great-aunt-in law."]}, {"page": "Lucia Vestris", "response": ["#REDIRECT Lucia Elizabeth Vestris"]}]}}