{"wiki_id": "http://www.wikidata.org/entity/Q6708535", "itemLabel": "Lynda Bryans", "itemDescription": "British journalist and television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Lynda_Bryans", "wikipedia_page": {"main": "Lynda Bryans (born May 1962) is a Belfast-born television presenter and journalist from Northern Ireland.", "link_mentions": [{"page": "BBC Newsline", "response": ["The current Newsline brand was introduced on 12 February 1996 when the main evening programme returned to a 6.30pm timeslot.  Although Noel ThompsonBelfast Telegraph: \"Present twists on Newsline's presentation\", dated 6 May 1996; accessed 17 June 2008Belfast Telegraph: \"Beeb's Noel wins hearts and minds of Breakfast bosses\"; dated 10 August 1998; accessed 17 June 2008 and Lynda Bryans were the original choice of presenters, Thompson was later dropped causing Bryans to resign and move to UTV. The programme's first presenters were political editor Jim Dougal and reporter Yvette Shapiro. Dougal was replaced as anchor by Conor Bradford after two months.Belfast Telegraph: \"TV faces flock to Kincora book launch\", dated 23 April 1996; accessed 17 June 2008"]}, {"page": "Saintfield", "response": ["* Lynda Bryans, Television Presenter, from Saintfield."]}, {"page": "Belfast Metropolitan College", "response": ["* Lynda Bryans, television presenter"]}, {"page": "UTV Live", "response": ["*Lynda Bryans – presenter (1996–2010)\"Lynda Bryans makes dignified farewell to UTV\", Belfast Telegraph, 1 July 2010; accessed 23 July 2010"]}, {"page": "Mike Nesbitt", "response": ["Nesbitt worked as a sports reporter at BBC Northern Ireland and progressed to presenting Good Morning Ulster on BBC Radio Ulster from 1986 to 1990.\"Nesbitt quits UTV over contracts row\" Belfast Telegraph, 2 February 2006, accessed 5 April 2009 Nesbitt joined UTV as a presenter and reporter in 1992, being joined by his wife Lynda Bryans to co-present evening news programme UTV Live in 1996.Lynda Bryans' profile on u.tv WebArchive.org, 11 July 2002, accessed 5 April 2009", "*Mike Nesbitt and Lynda Bryans' media services website"]}, {"page": "Category talk:British journalists", "response": ["Lynda Bryansnot yet classified"]}, {"page": "List of ITV journalists and newsreaders", "response": ["* Lynda Bryans – weekend newscaster on UTV Live, 2001–2005"]}, {"page": "Lynda", "response": ["* Lynda Bryans (born 1962), Northern Irish television presenter and journalist"]}, {"page": "Bryans", "response": ["* Lynda Bryans, living Northern Irish television news personality"]}]}}