{"wiki_id": "http://www.wikidata.org/entity/Q6709514", "itemLabel": "Lynton Lamb", "itemDescription": "English artist and illustrator (1907–1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lynton_Lamb", "wikipedia_page": {"main": "Lynton Lamb RDI, FSRA, FSIA (15 April 1907 – 4 September 1977) was an English artist-designer, author, lithographer and illustrator who was notable for his book jacket, poster, architectural decoration and postage stamp designs.", "link_mentions": [{"page": "Kingswood School", "response": ["*Lynton Lamb (Illustrator)"]}, {"page": "Royal Designers for Industry", "response": ["* Lynton Lamb, Book design & illustration, 1974"]}, {"page": "Lark Rise", "response": ["Lark Rise is a 1939 semi-autobiographical novel by the English author Flora Thompson. It was illustrated by Lynton Lamb."]}, {"page": "1977 in the United Kingdom", "response": ["*4 September – Lynton Lamb, illustrator and stamp designer (born 1907)"]}, {"page": "Ariel Poems (Faber)", "response": ["# Sirmione Peninsula by Stephen Sender, drawings by Lynton Lamb"]}, {"page": "1907 in the United Kingdom", "response": ["* 15 April – Lynton Lamb, illustrator and stamp designer (died 1977)"]}, {"page": "Castle series stamps", "response": ["The first series, designed by Lynton Lamb was issued in September 1955. The second, created from pictures taken by Prince Andrew, Duke of York, the Queen's second son, was issued in October 1988.", "In January 1954, Lynton Lamb's scenery, known as \"broken grotto\", was chosen:The First Elizabeth II Castle High Value Definitives, 2005, page 8. the castle is in the reader's sight through a hole in an old stone wall, next to which is standing the Queen's portrait. Under the guidance and requirements of officials, Lamb continued his work on the drawings of the castles during 1954, visiting in person Edinburgh and Windsor.The First Elizabeth II Castle High Value Definitives, 2005, pages 8-11."]}, {"page": "A Grass Rope", "response": ["A Grass Rope is a children's novel by William Mayne, first published by Oxford in 1957 with illustrations by Lynton Lamb. Mayne won the annual Carnegie Medal recognising the year's best children's book by a British subject."]}, {"page": "Storran Gallery", "response": ["Lynton Lamb, Joan Souter-Robinson,"]}, {"page": "Michael Sandle", "response": ["After attending evening classes at Chester College of Art, he studied printmaking in London at the Slade School of Fine Art from 1956 to 1959, where he was taught etching by Anthony Gross, Lynton Lamb, and Ceri Richards. He was also taught by Andrew Forge, Lucian Freud, and Claude Rogers. After travelling to Italy and Paris, Sandle taught at various British art schools in the 1960s. Originally a painter and draughtsman, in the 1960s, he gravitated towards sculpture."]}, {"page": "Warner Textile Archive", "response": ["Warner & Sons was a leading manufacturer of silk and velvet, as well as producing a wide range of other woven fabrics. Notably, it created the Queen's coronation robes and silk hangings used in Westminster Abbey during the coronation ceremony. Representing two centuries of UK textile manufacturing history, the archive features work by artists/designers such as Augustus Pugin, William Morris, Vanessa Bell, Marianne Straub, Hans Tisdall, Lynton Lamb and Graham Sutherland. The Warner archive was conserved for many years by the wallpaper and fabric company Walker Greenbank which sold the collection to Braintree in 2004."]}, {"page": "Warner & Sons", "response": ["Designs in the archive span two centuries and, alongside the work of Marianne Straub, Frank Davies and Alec Hunter, it includes work by artists such as Augustus Pugin, William Morris, Walter Crane, Vanessa Bell, Howard Hodgkin, Edward Bawden, Hans Tisdall, Graham Sutherland and Lynton Lamb."]}, {"page": "Oxford Children's Library", "response": ["| 46|| Bosco, Henri || 1967 || The Boy and the River. Translated by Gerald Hopkins || Lynton Lamb"]}, {"page": "Faith Jaques", "response": ["Though Jaques had illustrated a variety of material from 1950, she concentrated on illustrating children's books from the mid 1960s, working mainly in black and white. She acknowledged Edward Ardizzone as a significant influence, while demonstrating a closer visual alliance to Lynton Lamb.  She illustrated the first British edition of Roald Dahl’s Charlie and the Chocolate Factory  published in 1967 following controversy over the depiction of the Oompa-Loompas in the US edition of the book."]}, {"page": "Signature (typography journal)", "response": ["Many of Signature's articles were the first ever authoritative essays on subjects, for example on the books published by Ambroise Vollard, and the first hand-list of books illustrated by Picasso, which the artist himself corrected.  Simon, O. (1956) Printer and Playground, London: Faber & Faber ,  pp. 132-4.  The growing influence before World War II of William Blake on many artists shone through. The excavation and rehabilitation of the artistic reputations of artists well known and appreciated today such as Samuel Palmer and Henry Fuseli began in Signature and have been said to stand out as 'moments when a change of direction in art can be discerned'. Powers, A. (2008), Art and Print: The Curwen Story, London: Tate ,   p. 54.  Essays and/or artwork by artists such as Edward Ardizzone, Edward Bawden, Barnett Freedman, Lynton Lamb, Enid Marx, and Paul Nash also featured regularly."]}]}}