{"wiki_id": "http://www.wikidata.org/entity/Q6702019", "itemLabel": "Luke Hamilton", "itemDescription": "rugby player", "wikipedia_url": "https://en.wikipedia.org/wiki/Luke_Hamilton", "wikipedia_page": {"main": "Luke John Hamilton (born 7 January 1992) is a Scottish international rugby union player who plays back row for Oyonnax. He has previously played for Cardiff Blues and Edinburgh in the Pro14, Agen in France's Top 14 and Leicester Tigers in Premiership Rugby.", "link_mentions": [{"page": "Luke (given name)", "response": ["*Luke Hamilton (born 1992), Scottish rugby league footballer"]}, {"page": "Pembroke, Pembrokeshire", "response": ["Pembroke Rugby Club is on Upper Lamphey Road. The ground is called Crickmarren. The club plays in WRU Division Five West. Pembroke's main game of the season is often the local derby with rivals the Pembroke Dock Harlequins. Pembroke produced Ospreys and Welsh international Jonathan Thomas, Welsh international Dominic Day and Scotland international Luke Hamilton."]}, {"page": "Edinburgh Rugby", "response": ["During his tenure, several Edinburgh players have made their international debuts for Scotland, including props Simon Berghan, Darryl Marfo and Murray McCallum, lock Lewis Carmichael, wing Darcy Graham, full-back Blair Kinghorn, hooker David Cherry, flankers Luke Hamilton and Jamie Ritchie, and former Edinburgh players Phil Burleigh, Cornell du Preez and George Turner, flanker Luke Crosbie, centres Chris Dean and James Johnstone, and scrum-halves Nathan Fowles, Sean Kennedy and Charlie Shiel were named in Scotland squads. "]}, {"page": "SU Agen Lot-et-Garonne", "response": ["*  Luke Hamilton"]}, {"page": "Pembroke RFC", "response": ["*  Luke Hamilton"]}, {"page": "List of Scotland national rugby union players", "response": ["|1087||HamiltonLuke Hamilton||style=\"text-align:center; background:#82C860;\"|(Flanker)||2017-11-18|| v New Zealand at Murrayfield"]}, {"page": "Judgement Day (rugby union)", "response": ["|N8 ||8 || Luke Hamilton || || "]}, {"page": "List of 2014–15 Pro12 transfers", "response": ["* Luke Hamilton to  SU Agen"]}, {"page": "Ellis Jenkins", "response": ["He was a Wales under-20 international, captaining the side at the 2012 and 2013 Junior World Cup where Wales finished as runners up. Jenkins captained team consisting of a number of future Wales senior internationals: in the 2012 championship he captained the side which became the first side from any country to defeat New Zealand at that level. His team-mates that day included future senior Wales regulars Rob Evans and Samson Lee as well as several other players who would go on to earn senior Wales caps including Tom Prydie, Dan Baker, Eli Walker and Matthew Morgan, as well as future Scotland international Luke Hamilton. In 2013, Jenkins would captain the side which finished runners-up, Wales' best performance at U20 level to date. "]}, {"page": "List of 2016–17 Premiership Rugby transfers", "response": ["* Luke Hamilton from  Agen"]}, {"page": "2016–17 Anglo-Welsh Cup", "response": ["|FL ||20|| Luke Hamilton", "| rowspan=2| 4 ||  Luke Hamilton || Leicester Tigers || 4 || 3"]}, {"page": "List of Leicester Tigers players selected for international rugby", "response": ["|141||Luke Hamilton||(Flanker)||||2017-11-18||"]}, {"page": "2017 end-of-year rugby union internationals", "response": ["|FL ||20||Luke Hamilton || ||  || ", "* Luke Hamilton and Byron McGuigan (both Scotland) made their international debuts."]}, {"page": "Leicester Tigers in cup finals", "response": ["|FL ||20|| Luke Hamilton"]}, {"page": "List of 2018–19 Pro14 transfers", "response": ["* Luke Hamilton from  Leicester Tigers"]}, {"page": "List of 2018–19 Premiership Rugby transfers", "response": ["* Luke Hamilton to  Edinburgh"]}, {"page": "2018 June rugby union tests", "response": ["|FL ||20||Luke Hamilton || || ", "|OF ||7 ||Luke Hamilton || || "]}, {"page": "List of 2019–20 Pro14 transfers", "response": ["* Luke Hamilton to  NTT DoCoMo Red Hurricanes"]}]}}