{"wiki_id": "http://www.wikidata.org/entity/Q6708432", "itemLabel": "Lynch Maydon", "itemDescription": "British politician (1913-1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lynch_Maydon", "wikipedia_page": {"main": "Lieutenant-Commander Stephen Lynch Conway Maydon  (15 December 1913 – 2 March 1971) was a British Navy officer and politician who had a brief career in government.\nMaydon's father John, after whom Maydon Wharf in Durban is named, was a member of the Natal Legislative Assembly and he was born there (in Pietermaritzburg). He however moved to Britain at the age of 4 after the death of his father and was brought up in Britain and schooled at Twyford School near Winchester. He showed an early interest in the Royal Navy, enlisting in 1931, and studied at the Royal Naval College in Dartmouth. During the Second World War Maydon commanded submarines HMS L26, HMS Umbra and HMS Tradewind. Commanding Tradewind, he torpedoed 14 Japanese vessels, none of which were warships. One of these, torpedoed on 18 September 1944, was Jun'yō Maru, on its way from Java to Sumatra, carrying 1,450 mostly Dutch prisoner of war slave laborers and 4,200 Javanese slave laborers. 5,620 of those on board died, making this the biggest single action friendly loss of life in history and the highest death count in history from a single British action. Maydon was married to Joan (née Baker) until his death.\nAt the 1950 general election, Maydon fought Bristol South, a safe Labour constituency. He was then chosen for the safe Conservative seat of Wells, which he won in the 1951 election. Peter Thorneycroft, then President of the Board of Trade, named him as his Parliamentary Private Secretary in 1952; he served for only a year.\nAfter the 1959 general election, Maydon was Chairman of the Conservative Parliamentary Party Defence Committee for two years. Harold Macmillan brought him into government as Joint Parliamentary Secretary to the Ministry of Pensions and National Insurance from July 1962, where he served alongside Margaret Thatcher. He retained this office under Sir Alec Douglas-Home.\nMaydon was a right-winger who supported the use of corporal punishment, arguing that it was an effective sentence as a last resort. He opposed sanctions against Rhodesia and voted against the Race Relations Act 1968 (which made it illegal to refuse housing, employment, or public services to a person on the grounds of colour, race, ethnic or national origins) and also opposed House of Lords Reform. In 1968 he declared to the House of Commons that he was '[...] one of the few—I believe perhaps the only—Member of this House who supports and believes in apartheid.' He retired at the 1970 general election, and died less than a year later.\n\n", "link_mentions": [{"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|Lynch Maydon"]}, {"page": "HMS Tradewind (P329)", "response": ["Her most infamous sinking was of the Japanese army cargo ship Junyō Maru which was headed for Sumatra, on 18 September 1944.  Unbeknown to the Commanding Officer of Tradewind, Lt.Cdr. Lynch Maydon, the Japanese ship was carrying 4,200 Javanese slave labourers and 2,300 Allied prisoners of war from Batavia to Padang. 5,620 lives were lost in the sinking.HMS Tradewind, Uboat.net"]}, {"page": "Wells (UK Parliament constituency)", "response": ["| Lynch Maydon"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| Lynch Maydon"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| Lynch Maydon"]}, {"page": "List of MPs elected in the 1964 United Kingdom general election", "response": ["| Lynch Maydon"]}, {"page": "List of MPs elected in the 1966 United Kingdom general election", "response": ["| Lynch Maydon"]}, {"page": "Conservative government, 1957–1964", "response": ["|Lynch Maydon||16 July 1962 – 16 October 1964|| "]}, {"page": "Parliamentary Secretary to the Minister for Pensions", "response": ["|Margaret Thatcher  and Lynch Maydon || 16 July 1962 || 16 October 1964 "]}, {"page": "Twyford School", "response": ["*Lynch Maydon (1913–1971), naval officer and politician "]}, {"page": "Stephen Maydon", "response": ["#REDIRECT Lynch Maydon"]}, {"page": "Stephen Lynch Conway Maydon", "response": ["#REDIRECT Lynch Maydon"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Lynch Maydon; MP for Wells (1951–1970)"]}, {"page": "List of friendly fire incidents", "response": ["*18 September – The Japanese cargo ship  was packed with 1,377 Dutch, 64 British and Australian, and 8 American prisoners of war along with 4,200 Javanese slave labourers (Romushas) bound for work on a railway line being built in Sumatra when she was attacked and sunk by British submarine , whose commander, Lt. Cdr Lynch Maydon, did not know there were Allied prisoners of war on board.HMS Tradewind, Uboot.net At that time it was the world's greatest sea disaster with 5,620 dead\"Major Sinkings of POW Hell-Ships\". Center for Research — Allied POWS Under the Japanese. as well as the worst single friendly fire loss (surpassed by the Cap Arcona disaster next year) and highest death toll inflicted in a single action by British forces. 680 survivors were rescued, the prisoners of whom went on to their intended destination."]}]}}