{"wiki_id": "http://www.wikidata.org/entity/Q6708993", "itemLabel": "Lynn Dalby", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Lynn_Dalby", "wikipedia_page": {"main": "Lynn Dalby (born 17 February 1947) is an English actress.\nDalby was born in Harrogate, West Riding of Yorkshire, England.", "link_mentions": [{"page": "Budgie (TV series)", "response": ["The story begins with Ronald Bird (nicknamed \"Budgie\") being released from an open prison and trying to find a living in whatever way possible. He meets Charlie Endell in a bar with a 15 year old stripper (Adrienne Posta) and Endell asks Budgie to look after her for a week. Budgie asks his part-time actress girlfriend Hazel Fletcher (Lynn Dalby) to help.", "The only other regular member of the cast was Lynn Dalby as Budgie's girlfriend, Hazel Fletcher. Stella Tanner had a semi-regular role as her mother, Mrs Fletcher. Rio Fanning appeared three times as Budgie's gullible criminal Irish pal, Grogan. Guest stars included Georgina Hale as Budgie's wife Jean, George Tovey as his father, Jack Bird, and Adrienne Posta as a stripper. John Rhys-Davies had an early semi-regular role as a corpulent gangster working for Endell, with the name of Laughing Spam Fritter."]}, {"page": "Return of the Saint", "response": ["| 1–24 || 11 March 1979 || \"The Diplomat's Daughter\" || Lynn Dalby, Karl Held, Murray Head, David Garth, Graeme Eton, Stacy Davies, Stanley McGeagh"]}, {"page": "Ray Lonnen", "response": ["Lonnen was first married to Jean Conyers and then to the actress Lynn Dalby, with whom he had three children. His third wife was the actress Tara Ward."]}, {"page": "The Gnomes of Dulwich", "response": ["The Gnomes of Dulwich is a United Kingdom television sitcom originally shown in six episodes from 12 May 1969 to 16 June 1969.The Gnomes of Dulwich, The British Comedy Guide, UK.The Gnomes of Dulwich, Television Heaven, UK. Written by Jimmy Perry, the show starred Terry Scott, Hugh Lloyd, John Clive, Leon Thau, Anne de Vigier and Lynn Dalby as garden gnomes living at 25 Telegraph Road, Dulwich, London, England. The title is a reference to the term \"Gnomes of Zürich\".", "*Lynn Dalby – Rita"]}, {"page": "Pat Sugden", "response": ["Patricia Ruth \"Pat\" Sugden (also Harker and Merrick) is a fictional character from the British soap opera Emmerdale, played by actresses Lynn Dalby and Helen Weir."]}, {"page": "Legend of the Werewolf", "response": ["* Lynn Dalby as Christine"]}, {"page": "List of former Emmerdale characters", "response": ["|Lynn Dalby"]}, {"page": "Tusitala (miniseries)", "response": ["*Lynn Dalby as Almelia Clarke \t"]}]}}