{"wiki_id": "http://www.wikidata.org/entity/Q6708671", "itemLabel": "Lyndhurst Winslow", "itemDescription": "English cricketer (1855-1915)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lyndhurst_Winslow", "wikipedia_page": {"main": "Lyndhurst Winslow (10 January 1855 – 6 February 1915) was an English cricketer. Winslow was a right-handed batsman. The son of evangelical preacher Octavius Winslow and Hannah Ann Ring, he was born at Leamington, Warwickshire.\nWinslow made his first-class debut for Sussex against Gloucestershire in 1875 at the County Ground, Hove. He scored a century in his maiden innings, making 124 runs. His second first-class appearance came shortly after this match, for the Marylebone Cricket Club against Cambridge University at Lord's. Immediately following this match, he made a two first-class appearances in quick succession, for the Gentlemen of the South against the Players of the South at The Oval, and for the South against the North at Trent Bridge. He made four further first-class appearances in 1875, all for Sussex, with his final appearance coming against Gloucestershire at the College Ground, Cheltenham. In total, Winslow made eight first-class appearances, scoring 337 runs at an average of 30.63.He later emigrated to South Africa. In 1891 he was runner-up at the inaugural South African Championships tennis tournament in Port Elizabeth. Winslow died in Johannesburg on 6 February 1915. His son, Charles, was a three time Olympic tennis medalist. He won two gold medals, once each in the men's singles and doubles at the 1912 Summer Olympics in Stockholm. Eight years later, in Antwerp, he won a bronze medal in the men's singles event. Charles' son and Lyndhurst's grandson, Paul, would play Test cricket for South Africa. Winslow's cousin, Octavius Winslow, was also a first-class cricketer.", "link_mentions": [{"page": "Charles Winslow", "response": ["Charles Lyndhurst Winslow (1 August 1888 – 15 September 1963) was a three-time Olympic tennis medalist from South Africa. He won two gold medals: Men's Singles and Doubles at the 1912 Summer Olympics in Stockholm. Eight years later, in Antwerp, Winslow won a bronze medal in the Men's Singles event.", "Winslow's father Lyndhurst Winslow played first-class cricket for Sussex County Cricket Club, scoring a century on debut against Gloucestershire County Cricket Club,Overson, p. 9. while Winslow's son Paul played Test cricket for South Africa.Overson, p. 10."]}, {"page": "Paul Winslow (cricketer)", "response": ["Paul Lyndhurst Winslow (21 May 1929 – 24 May 2011) was a South African cricketer who played in five Tests from 1950 to 1955.  He was born in Johannesburg, Transvaal and died in Parktown in the same city. ", "Winslow's father Charles was a leading tennis player, winning two gold medals at the 1912 Summer Olympics and a bronze in 1920,Overson, p. 10. and Winslow's grandfather Lyndhurst Winslow played first-class cricket for Sussex County Cricket Club, scoring a century on debut against Gloucestershire County Cricket Club.Overson, p. 9. "]}, {"page": "South African Open (tennis)", "response": ["| 1891 ||  Lionel Richardson ||  Lyndhurst Winslow || 6–2, 10–8, 6–2"]}, {"page": "List of Rhodesian representative cricketers", "response": ["|  || 1956/57 || 1961/62 || 20 || - || - ||- || Son of Charles Winslow and grandson of Lyndhurst Winslow."]}, {"page": "List of Marylebone Cricket Club players (1864–1894)", "response": ["* Lyndhurst Winslow (1875) : L. Winslow (Sussex)"]}]}}