{"wiki_id": "http://www.wikidata.org/entity/Q6702240", "itemLabel": "Luke Parker", "itemDescription": "cricketer (born 1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Luke_Parker_(cricketer)", "wikipedia_page": {"main": "Luke Parker (born 27 September 1983) is an English cricketer. He is a right-handed batsman and a right-arm medium-pace bowler.\nBorn in Coventry, and having previously played for Oxford UCCE and British Universities, he has come through the ranks to play for Warwickshire, for whom he is soon hoping to make an impact in the side.", "link_mentions": [{"page": "Warwickshire County Cricket Club in 2005", "response": ["An eventful match at Edgbaston looked to give Nottinghamshire the lead in the County Championship, as they swept aside Warwickshire with few problems. The Warwickshire batting line-up sorely missed Ian Bell, who was on Test match duty for England, and after an opening partnership of 101 between Nic Knight and Ian Westwood, an implosion followed. Warwickshire faltered to 168 for 8, and only 21-year-old Luke Parker, playing his seventh first-class match, saved them from a sub-200 score as he made an unbeaten 34.", "Ben Hutton and Owais Shah looked to set a massive target on day three, however, pairing up for 151 to add to Middlesex' 51-run first innings lead – but again Ntini came to the rescue for Warwickshire, as only Shah got the ball off the square and Middlesex whimpered from 281 for 3 to 330 all out. Shah finished not out, having hit 15 fours and two sixes in a five-hour 156. Peter Trego then took two wickets with two balls as Warwickshire fell to six for two, but Jamie Troughton smacked four sixes and twelve fours in a quickfire 119 as Warwickshire forced their way to 221 for 3 at stumps, with Nick Knight not out overnight on 67, leaving the match poised with 161 to win and seven wickets in hand. Knight was dismissed for 75 by the Australian Clark, who also removed Neil Carter for 15, but Alex Loudon proved too difficult to get out. His unbeaten 95, along with 27 not out from Luke Parker, saw Warwickshire pass the target with three wickets to spare, despite Middlesex' slow over rate, which caused them to be deducted half a point."]}, {"page": "Oxford UCCE and Oxford University in 2005", "response": ["On the second day, after Derbyshire moved to 246 all out, Luke Parker, a Warwickshire signing, scored 89 to help Oxford to 245 for 5, just one run behind Derbyshire. The third day saw Oxford UCCE consolidate their lead, and they were finally all out for 372, a lead of 126. The student bowlers were not up to the task of dismissing Derbyshire a second time in the 53 overs that remained. Indeed, they fared poorly, as Jonathan Moss scored 109 not out, with the game ending when the visitors declared on 226 for 2. (Cricinfo scorecard)"]}, {"page": "MCC University matches in 2005", "response": ["On the second day, after Derbyshire moved to 246 all out, Luke Parker, a Warwickshire signing, scored 89 to help Oxford to 245 for 5, just one run behind Derbyshire. The third day saw Oxford UCCE consolidate their lead, and they were finally all out for 372, a lead of 126. The student bowlers were not up to the task of dismissing Derbyshire a second time in the 53 overs that remained. Indeed, they fared poorly, as Jonathan Moss scored 109 not out, with the game ending when the visitors declared on 226 for 2. (Cricinfo scorecard)", "The Bangladeshis started their tour of England with an easy warm-up game against British Universities. The Bangladeshis batted first at a chilly Fenner's, but with an unbeaten century from Javed Omar they finished the rain-affected first day on a comfortable 238 for 3, after being reduced to 99 for 3. The second day was also a successful one for the tourists. Omar finished on 167 and Mohammad Ashraful scored 102 as the Bangladeshis finished on 381. In reply, British Universities stuttered to 82 for 5, before Luke Parker and Josh Knappett steadied the ship, leaving the students on 190 for 5 at close, with a draw the most likely result on the third day."]}, {"page": "Nottinghamshire County Cricket Club in 2005", "response": ["An eventful match at Edgbaston looked to give Nottinghamshire the lead in the County Championship, as they swept aside Warwickshire with few problems. The Warwickshire batting line-up sorely missed Ian Bell, who was on Test match duty for England, and after an opening partnership of 101 between Nic Knight and Ian Westwood, an implosion followed. Warwickshire faltered to 168 for 8, and only 21-year-old Luke Parker, playing his seventh first-class match, saved them from a sub-200 score as he made an unbeaten 34."]}, {"page": "Derbyshire County Cricket Club in 2005", "response": ["On the second day, after Derbyshire moved to 246 all out, Luke Parker, a Warwickshire signing, scored 89 to help Oxford to 245 for 5, just one run behind Derbyshire. The third day saw Oxford UCCE consolidate their lead, and they were finally all out for 372, a lead of 126. The student bowlers were not up to the task of dismissing Derbyshire a second time in the 53 overs that remained, but Jonathan Moss scored 109 not out, with the game ending when the visitors declared on 226 for 2. (Cricinfo scorecard)"]}, {"page": "Bangladeshi cricket team in England in 2005", "response": ["The Bangladeshis started their tour of England with an easy warm-up game against British Universities. The Bangladeshis batted first at a chilly Fenner's, but with an unbeaten century from Javed Omar they finished the rain-affected first day on a comfortable 238 for 3, after being reduced to 99 for 3. The second day was also a successful one for the tourists. Omar finished on 167 and Mohammad Ashraful scored 102 as the Bangladeshis finished on 381. In reply, British Universities stuttered to 82 for 5, before Luke Parker and Josh Knappett steadied the ship, leaving the students on 190 for 5 at close, with a draw the most likely result on the third day."]}, {"page": "Luke Parker", "response": ["Luke Parker may refer to:", "* Luke Parker (cricketer) (born 1983), English cricketer", "* Luke Parker (footballer) (born 1992), Australian rules footballer", "* Luke Parker (cyclist) (born 1993), Australian cyclist"]}, {"page": "List of Warwickshire County Cricket Club players", "response": ["* Luke Parker (2005–2008) : L. C. Parker (17)"]}, {"page": "List of Marylebone Cricket Club players (1978–)", "response": ["* Luke Parker (2006) : L. C. Parker (MCC)\t"]}, {"page": "List of Warwickshire Cricket Board List A players", "response": ["*Luke Parker (2001–2002): LC Parker"]}]}}