{"wiki_id": "http://www.wikidata.org/entity/Q6701903", "itemLabel": "Luke Daley", "itemDescription": "English footballer (born 1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Luke_Daley", "wikipedia_page": {"main": "Luke Aaron Daley (born 10 November 1989) is an English former professional footballer who played as a winger. He previously played for Norwich City, Stevenage, Plymouth Argyle, Lincoln City, Braintree Town, Dartford and  Chelmsford City.", "link_mentions": [{"page": "November 10", "response": ["*  1989   – Luke Daley, English footballer"]}, {"page": "2010–11 Stevenage F.C. season", "response": ["|FW|| Luke Daley || Norwich City|| 21 January 2011 || 23 February 2011 ||"]}, {"page": "2010–11 Norwich City F.C. season", "response": ["|align=\"left\"|25||align=\"left\"|FW||align=\"left\"| Luke Daley", "|Luke Daley"]}, {"page": "2011–12 Plymouth Argyle F.C. season", "response": ["The squad returned for pre-season training on 4 July. They were joined by defenders Durrell Berry and Robbie Williams, who agreed to join the club having been released by Aston Villa and Rochdale respectively at the end of last season, and two trialists; former Oldham Athletic forward Andy Crompton and Norwich City player Luke Daley. Later that day, defender Bondz N'Gala completed a transfer to Yeovil Town. Liam Dickinson, a former Barnsley striker, joined the squad on 5 July after agreeing to join the club on a free transfer. On 10 July, forward Joe Mason joined Cardiff City for an undisclosed fee. Two more trialists took part in training the next day; goalkeeper Jake Cole and French defender Ladjie Soukouna, while youngsters Jamie Richards and Luke Young signed their first professional contracts. Reid chose against pursuing his interest in Crompton. Argyle began their schedule of nine pre-season friendlies by defeating South West Peninsula League side Torpoint Athletic by two goals to one on 12 July. Winger Jed Harper-Penman scored both goals for a young Argyle team.", "|align=\"left\"|Luke Daley", "|Luke Daley"]}, {"page": "Daley, Luke", "response": ["#redirectLuke Daley"]}]}}