{"wiki_id": "http://www.wikidata.org/entity/Q6702374", "itemLabel": "Luke Sutton", "itemDescription": "English cricketer (born 1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Luke_Sutton", "wikipedia_page": {"main": "Luke David Sutton (born 4 October 1976) is an English former cricketer. A former right-handed batsman and wicketkeeper, he won the NBC Denis Compton Award in 2000, 2001 and 2002, and has also played List A and Twenty20 cricket.", "link_mentions": [{"page": "Luke (given name)", "response": ["*Luke Sutton (born 1976), English cricketer"]}, {"page": "Keynsham", "response": ["Several notable people have been born or lived in Keynsham. The comedian Bill Bailey was raised in the town. Another entertainer Neil Forrester, who was a research assistant and became known as a cast member on The Real World: London was also a local. Celebrated children's author Mimi Thebo has been resident since 2002. Sports players from Keynsham include Mark Regan a professional rugby player and a former player at Keynsham Rugby Football Club, Luke Sutton of Lancashire County Cricket Club who played as both a wicket-keeper and batsman, Marcus Trescothick, the Somerset and England cricketer.Marcus Trescothick biography , Cricinfo. Retrieved on 10 June 2007. and Judd Trump, a professional snooker player."]}, {"page": "Essex County Cricket Club in 2005", "response": ["Essex came back from a 120-run first innings deficit, after Derbyshire had used a day and a half for their first innings at The County Ground, Derby. Derbyshire struck runs at a rate of 2.75 an over, but four batsmen still made fifties, and especially Luke Sutton took his time at the crease. His 88 took five hours, and he faced 241 deliveries. However, Derbyshire's tactic of attrition seemed to work – after making 426, all while Danish Kaneria was bowling (the Pakistani leg spinner bowled 60.1 overs, taking six for 111), Derbyshire immediately got breakthroughs with the ball. Essex were 18 for 3 before the Flower brothers – Grant and Andy – put on 60 for the fourth wicket to help close the gap. By stumps, Essex were 113 for 4 from 50 overs.", "After run rates of just above 2.5 on the first two days, the third day gave the spectators nearly 400 runs while eighteen wickets fell. Graeme Welch took two wickets in consecutive deliveries in the early stages, as Essex were 128 for 6, but Ronnie Irani made a four-hour 99 and also had support from James Middlebrook (42) and Darren Gough – the latter registering 51 off just 38 deliveries. Welch finished with figures of five for 68, his second five-for of the season, as Essex finished on 306. Then, Essex' bowlers got wickets at a much more rapid rate than in the first innings, where Derbyshire had made 206 for the first four. In the second, they managed 34, as Ravinder Bopara got two wickets and Danish and Graham Napier dug out one each. Another three-hour effort from Luke Sutton and a 91-ball 74 from Jonathan Moss saw Derbyshire to stumps with a lead of 314 with eight down – Sutton still not out with 38. A further 22 runs were added on the second day, while Danish dismissed Jake Needham to complete his second five-for of the match – Sutton was left stranded on 46 not out, setting Essex 337 to win. As Alastair Cook (14), Grant Flower (11-ball duck) and Bopara (10) were dismissed in succession, Essex lost their first three wickets for 82, but William Jefferson made 83 to set them back on track, and a 177-run partnership between Andy Flower and Ronnie Irani left Essex with 33 to hit with five wickets to spare. Ronnie Irani and James Foster made it with five wickets to spare, and Derbyshire's run of matches without a win continued."]}, {"page": "Somerset County Cricket Club in 2005", "response": ["However, on the fourth day, 426 runs were hit and enough wickets fell to get a result. Blackwell smacked 88 not out in 85 balls as Somerset added 184 in the first fifty overs of the day before declaring, which set Derbyshire 268 to win in 50 overs - a good one-day total. Derbyshire attempted the chase, Jon Moss slashing 106 and adding runs with Luke Sutton, and at 247 for 4, Derbyshire looked to have a good chance at winning it. However, two run-outs and two wickets each for Blackwell and Caddick saw Derbyshire lose their last six men for 15 runs, and Somerset snatched a five-run win.", "Half-centuries from James Hildreth and James Francis took Somerset to 259 in 64.5 overs at their home ground at Taunton. Hildreth's 84 included 15 fours, while Francis hit ten fours in his 54. For Derbyshire, all-rounder Graeme Welch took three early wickets for 42, while 19-year-old Wayne White, who had made his first class debut with match figures of one for 123 a week earlier against Yorkshire, ended with four wickets for 77 in just under 13 overs. Chris Bassano and Steve Stubbings then added 87 for the first wicket, and Derbyshire closed on 126 for 1. On the second day, Stubbings continued with Hassan Adnan, and both earned career best scores - Stubbings with 151 and Adnan with 191 not out. Gareth Andrew was the only Somerset bowler to take more than one wicket, ending with four for 134, but Derbyshire made 707 for 7 - a county record  - declaring when Luke Sutton fell for 53, leaving Graeme Welch stranded on 99 not out."]}, {"page": "Kent County Cricket Club in 2005", "response": ["Derbyshire, playing for the first time as the \"Phantoms\" lost the toss and were put in to bat at Derby. Opener Jonathan Moss made free at the start of the innings with 79 off 81 balls before he was bowled by Rob Ferley. His team-mates struggled, with only captain Luke Sutton, with 46, adding much to the score. Derbyshire scored 197 for 8 in their 45 overs. Only 5 overs of Kent Spitfires' innings were possible, in which time they made 9 for no loss. Rain then meant the match was abandoned. (BBC scorecard)"]}, {"page": "Nottinghamshire County Cricket Club in 2005", "response": ["Derbyshire Phantoms needed to win to have a chance of qualifying for the quarter-finals - and did it, in a thriller finish. Nottinghamshire Outlaws batted first, and Will Smith and Chris Read made 51 and 44 not out respectively. The pair where the only two Nottinghamshire batsmen to pass 20, their contributions lifted the hosts to 147 for 8. Michael di Venuto and Luke Sutton took Derbyshire to 92 for 1 before economical bowling chipped away at Derbyshire's batting. However, captain Sutton kept a cool head, anchoring the chase with 61 not out in 54 balls as Derbyshire won with two balls to spare."]}, {"page": "Durham County Cricket Club in 2005", "response": ["Derbyshire medium pacer Ian Hunter, formerly of Durham, got career-best bowling figures of five for 63 as Derbyshire - the only winless team in the Championship so far this season - came three runs away from recording a win at Riverside Ground against the table-toppers from Durham. In Durham's first innings, where Hunter got his five-for, nine batsmen reached double figures, yet only two passed 30 and no one made it to fifty, as Dale Benkenstein top-scored with 49. Liam Plunkett dug out one wicket in the first evening and one on the second morning, as Derbyshire lost their first four for 64, but a 231-minute partnership between Jon Moss (92 runs) and Chris Bassano (87) yielded 148 runs to take Derbyshire within 18 of Durham's first-innings total of 230. Luke Sutton hit 55 off 119 balls, and Derbyshire made their way to 326 in 112.4 overs."]}, {"page": "Leicestershire County Cricket Club in 2005", "response": ["Derbyshire Phantoms beat last year's champions Leicestershire Foxes at The County Ground, Derby to be the only side with two victories in the North Division of the Twenty20 Cup. Bowling first turned out to be a stroke of genius, as the Leicestershire batsmen were tied down by Ian Hunter (three for 32) and Andre Botha (two for 19), and wickets were spread out as Leicestershire's last man, Claude Henderson, was caught on the last ball - all out for 137. Derbyshire's reply was shortened by rain, and they only got 14 overs to hit 103, and two wickets from David Masters set them back to 44 for 3. However, 42 from Luke Sutton ensured that Derbyshire made it to the target with seven balls to spare."]}, {"page": "Lancashire County Cricket Club in 2005", "response": ["Derbyshire batted first at Old Trafford, but fared poorly, being dismissed for 215, with Luke Sutton top-scoring with 95. No one else passed 40, however. James Anderson took 4 for 62, and was the pick of the Lancashire bowlers. In reply, Lancashire made 65 for no loss at stumps on the first day."]}, {"page": "Yorkshire County Cricket Club in 2005", "response": ["Yorkshire Phoenix won the toss and chose to bat, and immediately lost both openers at Derby. That set the pace of the innings, and seven maiden overs were bowled out of the total of 45. Jonathan Moss got the best bowling figures for the hosting Derbyshire Phantoms, removing Richard Pyrah and Simon Guy in successive balls and ending with bowling figures of 9–2–27–3. Moss' two wickets set Yorkshire back to 66 for 7, and only a rearguard between Joe Sayers, who made 54 not out in two hours, and David Lucas saw them bat out the allotted overs. The pair added 65 for the ninth wicket as Yorkshire closed on 171 for 9. Derbyshire lost Michael Di Venuto for 1 early on, but despite Anthony McGrath removing Hassan Adnan for 57 and Luke Sutton for 34, Derbyshire made it to the target with fourteen balls. Extras were the second-highest scorer, with 43, including 31 wides."]}, {"page": "Derbyshire County Cricket Club in 2005", "response": ["Derbyshire, playing for the first time as the \"Phantoms\" lost the toss and were put in to bat at Derby. Opener Jonathan Moss made free at the start of the innings with 79 off 81 balls before he was bowled by Robert Ferley. His teammates struggled, with only captain Luke Sutton, with 46, adding any significant amount to the score, and Derbyshire scored 197 for 8 in their 45 overs. Only 5 overs of Kent Spitfires' innings were possible, in which time they made 9 for no loss. Rain then meant the match was abandoned. (BBC scorecard)", "Derbyshire, who had replaced pace bowler Kevin Dean with Andy Gray, batted first at Old Trafford, and were dismissed for 215, with Luke Sutton top-scoring with 95. No one else passed 40, however. James Anderson took 4 for 62, and was the pick of the Lancashire bowlers. In reply, Lancashire made 65 for no loss at stumps on the first day.", "Derbyshire Phantoms beat last year's champions Leicestershire Foxes at The County Ground, Derby to be the only side with two victories in the North Division of the Twenty20 Cup. Leicestershire lost their first two wickets for 15, and after HD Ackerman and Joe Sadler had added 54, the Leicestershire batsmen were removed Ian Hunter (three for 32), Ant Botha (two for 19) and Andy Gray (two for 21). Leicestershire's last man, Claude Henderson, was caught on the last ball, and his team all out for 137. Derbyshire's reply was shortened by rain, and they only got 14 overs to hit 103, and two wickets from David Masters set them back to 44 for 3. However, 42 from Luke Sutton in a 61-run stand with Botha ensured that Derbyshire made it to the target with seven balls to spare.", "Derbyshire Phantoms needed to win to have a chance of qualifying for the quarter-finals – and did it, in a last-over finish. Nottinghamshire Outlaws batted first, and Will Smith and Chris Read made 51 and 44 not out respectively. The two where the only two Nottinghamshire batsmen to pass 20, and their contributions lifted the hosts to 147 for 8. Michael di Venuto and Luke Sutton took Derbyshire to 92 for 1 before Mark Ealham and Samit Patel chipped away at Derbyshire's batting. Four of Nottinghamshire's bowlers conceded less than 7 an over – which would have been good enough. However, Greg Smith conceded 40 runs, captain Sutton anchored the chase with 61 not out in 54 balls as Derbyshire won with two balls to spare.", "After a third day with 281 runs and four wickets, the fourth day yielded 426 runs and enough wickets fell to get a result. Blackwell hit 88 not out in 85 balls as Somerset added 184 in the first fifty overs of the day before declaring, which set Derbyshire 268 to win in 50 overs – a one-day chase. Derbyshire attempted the chase, Jonathan Moss hitting 106 off 88 balls and adding runs with Luke Sutton (19), Steve Stubbings (55) and Hassan Adnan (48), as Derbyshire made their way to 247 for 4. However, two run-outs and two wickets each for Blackwell and Caddick saw Derbyshire lose their last six men for 15 runs, and Somerset t a five-run win.", "Essex came back from a 120-run first innings deficit, after Derbyshire had used a day and a half for their first innings at The County Ground, Derby. Derbyshire struck runs at a rate of 2.75 an over, but four batsmen still made fifties, and especially Luke Sutton took his time at the crease. His 88 took five hours, and he faced 241 deliveries. However, Derbyshire's tactic of attrition seemed to work – after making 426, all while Danish Kaneria was bowling (the Pakistani leg spinner bowled 60.1 overs, taking six for 111), Derbyshire immediately got breakthroughs with the ball. Essex were 18 for 3 before the Flower brothers – Grant and Andy – put on 60 for the fourth wicket to help close the gap. By stumps, Essex were 113 for 4 from 50 overs.", "After run rates of just above 2.5 on the first two days, the third day gave the spectators nearly 400 runs while eighteen wickets fell. Graeme Welch took two wickets in consecutive deliveries in the early stages, as Essex were 128 for 6, but Ronnie Irani made a four-hour 99 and also had support from James Middlebrook (42) and Darren Gough – the latter registering 51 off just 38 deliveries. Welch finished with figures of five for 68, his second five-for of the season, as Essex finished on 306. Then, Essex' bowlers got wickets at a much more rapid rate than in the first innings, where Derbyshire had made 206 for the first four. In the second, they managed 34, as Ravinder Bopara got two wickets and Danihs and Graham Napier dug out one each. Another three-hour effort from Luke Sutton and a 91-ball 74 from Jonathan Moss saw Derbyshire to stumps with a lead of 314 with eight down – Sutton still not out with 38. A further 22 runs were added on the second day, while Danish dismissed Jake Needham to complete his second five-for of the match – Sutton was left stranded on 46 not out, setting Essex 337 to win. As Alastair Cook (14), Grant Flower (11-ball duck) and Bopara (10) were dismissed in succession, Essex lost their first three wickets for 82, but William Jefferson made 83 to set them back on track, and a 177-run partnership between Andy Flower and Ronnie Irani left Essex with 33 to hit with five wickets to spare. Ronnie Irani and James Foster made it with five wickets to spare, and Derbyshire's run of matches without a win continued.", "The Scottish Saltires were defeated by Derbyshire Phantoms at The Grange, despite three wickets from Ryan Watson and an unbeaten 71 from Fraser Watts. Scotland had been put in to bat by Derbyshire captain Luke Sutton, and were 42 for 4 after two wickets from new-ball bowler Graeme Welch, but Watts paired up well with the lower middle order before rain set in. Seven overs were cut off the Scottish innings, leaving them with 38 overs to play, and 27 off 19 balls from Pakistani all-rounder Yasir Arafat lifted them to 179 for 7. More rain cut Derbyshire's innings to 32 overs, and under the Duckworth-Lewis method they were set 161 to win. They were 120 for 2 after Steve Stubbings had put on 70 with Sutton, but Watson then got three wickets and Cedric English two, as the visitors lost their next five wickets for 27, but Stubbings, still at the crease, went on to make 75 not out to guide Derbyshire past the target with three balls to spare.", "Derbyshire medium pacer Ian Hunter, formerly of Durham, got career-best bowling figures of five for 63 as Derbyshire – the only winless team in the Championship so far this season – came three runs away from recording a win at Riverside Ground against the table-toppers from Durham. In Durham's first innings, where Hunter got his five-for, nine batsmen reached double figures, yet only two passed 30 and no one made it to fifty, as Dale Benkenstein top-scored with 49. Liam Plunkett dug out one wicket in the first evening and one on the second morning, as Derbyshire lost their first four for 64, but a 231-minute partnership between Jon Moss (92 runs) and Chris Bassano (87) yielded 148 runs to take Derbyshire within 18 of Durham's first-innings total of 230. Luke Sutton hit 55 off 119 balls, and Derbyshire made their way to 326 in 112.4 overs.", "Yorkshire Phoenix won the toss and chose to bat, and immediately lost both openers at Derby. That set the pace of the innings, and seven maiden overs were bowled out of the total of 45. Jonathan Moss got the best bowling figures for the hosting Derbyshire Phantoms, removing Richard Pyrah and Simon Guy in successive balls and ending with bowling figures of 9–2–27–3. Moss' two wickets set Yorkshire back to 66 for 7, and only a rearguard between Joe Sayers, who made 54 not out in two hours, and David Lucas saw them bat out the allotted overs. The pair added 65 for the ninth wicket as Yorkshire closed on 171 for 9. Derbyshire lost Michael di Venuto for 1 early on, but despite Anthony McGrath removing Hassan Adnan for 57 and Luke Sutton for 34, Derbyshire made it to the target with fourteen balls. Extras were the second-highest scorer, with 43, including 31 wides.", "Half-centuries from James Hildreth and James Francis took Somerset to 259 in 64.5 overs at their home ground at Taunton. Hildreth's 84 included 15 fours, while Francis hit ten fours in his 54. For Derbyshire, all-rounder Graeme Welch took three early wickets for 42, while 19-year-old Wayne White, who had made his first class debut with match figures of one for 123 a week earlier against Yorkshire, ended with four wickets for 77 in just under 13 overs. Chris Bassano and Steve Stubbings then added 87 for the first wicket, and Derbyshire closed on 126 for 1. On the second day, Stubbings continued with Hassan Adnan, and both earned career best scores – Stubbings with 151 and Adnan with 191 not out. Gareth Andrew was the only Somerset bowler to take more than one wicket, ending with four for 134, but Derbyshire made 707 for 7 – a county recordhttps://cricketarchive.com/Archive/Records/England/Firstclass/Derbyshire/Team_Records/Highest_Team_Total_For.html – declaring when Luke Sutton fell for 53, leaving Graeme Welch stranded on 99 not out.", "||Luke Sutton || 17 || 29 || 4 || 833 || 95 || 0 || 4 || 33.32", "||Luke Sutton || 21 || 21 || 4 || 411 || 63* || 0 || 1 || 24.17", "Luke Sutton"]}, {"page": "National League Division Two in 2005", "response": ["Derbyshire, playing for the first time as the \"Phantoms\" lost the toss and were put in to bat at Derby. Opener Jonathan Moss made free at the start of the innings with 79 off 81 balls before he was bowled by Robert Ferley. His team-mates struggled, with only captain Luke Sutton, with 46, adding much to the score. Derbyshire scored 197 for 8 in their 45 overs. Only 5 overs of Kent Spitfires' innings were possible, in which time they made 9 for no loss. Rain then meant the match was abandoned. (BBC scorecard)", "The Scottish Saltires gave Derbyshire Phantoms a good fight at The Grange, but despite three wickets from Ryan Watson and an unbeaten 71 from Fraser Watts Derbyshire still came out on top. Scotland had been put in to bat by Derbyshire captain Luke Sutton, and crashed to 42 for 4 after two wickets from new-ball bowler Graeme Welch, but Watts paired up well with the lower middle order before rain set in. Seven overs were cut off the Scottish innings, leaving them with 38 overs to play, and a bit of hard hitting from Pakistani all-rounder Yasir Arafat lifted them to 179 for 7. More rain cut Derbyshire's chase to 32 overs, and under the Duckworth–Lewis method they were set 161 to win. They looked to be cruising at 120 for 2 after Steve Stubbings had put on 70 with Sutton. Watson then got three wickets and Cedric English two, as the visitors collapsed to 147 for 7, but Stubbings, still at the crease, held his head calm and ended on 75 not out to guide Derbyshire past the target with three balls to spare.", "Yorkshire Phoenix won the toss and chose to bat, and immediately lost both openers at Derby. That set the pace of the innings, and seven maiden overs were bowled out of the total of 45. Jonathan Moss got the best bowling figures for the hosting Derbyshire Phantoms, removing Richard Pyrah and Simon Guy in successive balls and ending with bowling figures of 9–2–27–3. Moss' two wickets set Yorkshire back to 66 for 7, and only a rearguard between Joe Sayers, who made 54 not out in two hours, and David Lucas saw them bat out the allotted overs. The pair added 65 for the ninth wicket as Yorkshire closed on 171 for 9. Derbyshire lost Michael Di Venuto for 1 early on, but despite Anthony McGrath removing Hassan Adnan for 57 and Luke Sutton for 34, Derbyshire made it to the target with fourteen balls. Extras were the second-highest scorer, with 43, including 31 wides."]}, {"page": "Scottish Saltires in 2005", "response": ["The Scottish Saltires gave Derbyshire Phantoms a good fight at The Grange, but despite three wickets from Ryan Watson and an unbeaten 71 from Fraser Watts Derbyshire still came out on top. Scotland had been put in to bat by Derbyshire captain Luke Sutton, and crashed to 42 for 4 after two wickets from new-ball bowler Graeme Welch, but Watts paired up well with the lower middle order before rain set in. Seven overs were cut off the Scottish innings, leaving them with 38 overs to play, and a bit of hard hitting from Pakistani all-rounder Yasir Arafat lifted them to 179 for 7. More rain cut Derbyshire's chase to 32 overs, and under the Duckworth-Lewis method they were set 161 to win. They looked to be cruising at 120 for 2 after Steve Stubbings had put on 70 with Sutton. Watson then got three wickets and Cedric English two, as the visitors collapsed to 147 for 7, but Stubbings, still at the crease, held his head calm and ended on 75 not out to guide Derbyshire past the target with three balls to spare."]}, {"page": "Twenty20 in England in 2005", "response": ["Derbyshire Phantoms beat last year's champions Leicestershire Foxes at The County Ground, Derby to be the only side with two victories in the North Division of the Twenty20 Cup. Bowling first turned out to be a stroke of genius, as the Leicestershire batsmen were tied down by Ian Hunter (three for 32) and Andre Botha (two for 19), and wickets were spread out as Leicestershire's last man, Claude Henderson, was caught on the last ball – all out for 137. Derbyshire's reply was shortened by rain, and they only got 14 overs to hit 103, and two wickets from David Masters set them back to 44 for 3. However, 42 from Luke Sutton ensured that Derbyshire made it to the target with seven balls to spare.", "Derbyshire Phantoms needed to win to have a chance of qualifying for the quarter-finals – and did it, in a thriller finish. Nottinghamshire Outlaws batted first, and Will Smith and Chris Read made 51 and 44 not out respectively. The pair where the only two Nottinghamshire batsmen to pass 20, their contributions lifted the hosts to 147 for 8. Michael Di Venuto and Luke Sutton took Derbyshire to 92 for 1 before economical bowling chipped away at Derbyshire's batting. However, captain Sutton kept a cool head, anchoring the chase with 61 not out in 54 balls as Derbyshire won with two balls to spare."]}, {"page": "Stuart Law", "response": ["During his first season with Lancashire, Law was awarded his county cap. Apart from an enforced absence through injury for part of the 2004 season, Law continued to pile up the runs for his new team, scoring 1,820 in 2003 at an exceptional average of 91, and after hitting 1,277 championship runs in 2007, signed a new one-year deal with the club.\"Law Commits To Lancs\", 2 November 2007, www.ecb.co.uk  Following Mark Chilton's resignation as captain at the end of the 2007 season, Law was appointed Lancashire captain ahead of players such as Dominic Cork, Glen Chapple and Luke Sutton. He was released in October 2008 to be replaced by Glen Chapple as captain for the 2009 season, before signing a contract to play for Derbyshire in limited overs cricket in 2009. "]}, {"page": "Graeme Welch", "response": ["Graeme Welch was appointed captain of Derbyshire for the 2006 season following the departure of Luke Sutton to Lancashire. In his Derbyshire career he has taken 50 wickets each season except one where he was injured for most of it, therefore it shows why he has taken 685 wickets at all top cricket levels and has also shown promise with the bat, scoring 7089 runs at all professional levels. When he played for Warwickshire he was part of the famous team including Shaun Pollock, Brian Lara and Dermot Reeve. He left Warwickshire at the end of the 2000 season, and joined Derbyshire for the 2001 campaign. Following six years of service for Derbyshire, Welsh was awarded a benefit year in 2007. However, in June 2007, he was forced to retire from the game due to injury. "]}, {"page": "NBC Denis Compton Award", "response": ["*Derbyshire – Luke Sutton", "*Derbyshire – Luke Sutton", "*Derbyshire – Luke Sutton"]}, {"page": "Steven Griffiths (cricketer)", "response": ["Griffiths was released in 1999 and replaced by Luke Sutton."]}, {"page": "List of Somerset County Cricket Club players", "response": ["* Luke Sutton (1997–1998) 3 matches CA"]}, {"page": "Gareth Cross", "response": ["Cross briefly started his cricket at Roe Green Cricket Club in Worsley, before moving to Clifton Salford. Cross made his first-class debut in 2005. Lancashire's stalwart wicketkeeper Warren Hegg retired at the end of the season, and the signing of Luke Sutton in the off-season limited Cross' first-team opportunities. Despite the competition he established himself as a regular in the one-day side, although he struggled to break into the County Championship team.", "Having graduated from Lancashire's Academy, 2005 was Cross' first year with the senior squad. Lancashire's veteran wicket-keeper Hegg was impressed by Cross, and said \"He has a really good work ethic, and he listens when you talk about the game. He's the one in line to take over from me.\" Cross made his first-class debut on 25 May 2005, along with Steven Croft and Tom Smith in a match against Oxford University. He batted just once in the match, scoring two runs, although he dismissed five batsmen, one by stumping and four caught. His second opportunity to play first-class cricket came in the last match of the season; with Lancashire's stalwart Warren Hegg injured, Cross was given the responsibility of taking over as wicket-keeper. Playing in the County Championship for the  first time, according to The Wisden Cricketer Cross \"showed enough pure technique to deserve his chance to develop\". Although Hegg retired at the end of the season, Lancashire quickly signed experienced wicket-keeper Luke Sutton from Derbyshire, hampering Cross' chances to regularly play first-team cricket. In the 2005/06 Australian cricket season, Cross travelled to the southern hemisphere to play for St Kilda Cricket Club in the Victorian Premier Cricket. He spent most of the season playing for the club's second team.", "Having won the second division title in 2005, for the 2006 season Lancashire were playing in the first division of the County Championship. A successful first season for Suttonin which he broke the record for highest score by a Lancashire 'keeper and had a batting average of 61meant that Cross spent most of 2006 playing for the Second XI. However, he was given a chance in the first team when Luke Sutton broke his thumb in July. Cross played three Championship matches before Sutton returned, managing half-centuries against Kent and Sussex. This was the season that Cross made his Twenty20 (T20) debut; he played eight matches for Lancashire, scoring 61 runs at an average of 8.71 with a highest score of 36. Lancashire were runners-up in the Championship and C&G Trophy, although went out in the first round of the T20 Cup.", "Two years after he last played a first-class match, Cross returned to the County Championship team in July 2010. With Luke Sutton acting as wicket-keeper and batting at seven, Cross played as a specialist batsman. Playing against Hampshire, he batted at six; he scored his maiden century, beating his previous best score of 70, to help Lancashire draw. Cross was reprimanded in August for showing dissent in a second XI match. Sutton left the club towards the end of the season, and Cross was expected to take the position of Lancashire's first-choice wicketkeeper."]}, {"page": "List of Derbyshire County Cricket Club seasons", "response": ["| 2003|| 17|| 2 || 11  || 4 || 2/9  || 18 ||8 || 8|| 2|| 2/6||SF ||Grp ||Dominic Cork || Michael Di Venuto|| Graeme Welch|| Luke Sutton", "| 2004 || 18 || 2 || 7 || 9 || 2/8 ||18 ||5 ||12 ||1 ||2/9 ||R2 ||Grp ||Luke Sutton || Hassan Adnan ||Graeme Welch || Luke Sutton", "| 2005|| 17|| 1|| 8 || 8|| 2/9 ||18 || 9 || 7 || 2 || 2/5 || R2 ||QF|| Luke Sutton || Michael di Venuto ||Graeme Welch || Luke Sutton", "| 2011|| 16 || 5 || 6 || 5 || 2/5 || 16 || 6 ||5 ||1 ||2/3 || Grp || Luke Sutton || Wes Durston ||Tim Groenewald  || Luke Sutton"]}, {"page": "Derbyshire County Cricket Club in 2003", "response": ["Luke Sutton "]}]}}