{"wiki_id": "http://www.wikidata.org/entity/Q6712583", "itemLabel": "M. G. Harris", "itemDescription": "British-Mexican writer", "wikipedia_url": "https://en.wikipedia.org/wiki/M._G._Harris", "wikipedia_page": {"main": "Maria Guadalupe Harris (born August 1966) is the author of the successful children's book series, The Joshua Files. She also worked with the estate of deceased author Gerry Anderson to bring his planned book series Gemini Force One into reality.", "link_mentions": [{"page": "St Cross College, Oxford", "response": ["* M. G. Harris, children's author"]}, {"page": "Peter Cox (author)", "response": ["Cox gradually started working with authors, developing their book proposals and initially selling them through an external literary agency.  This arrangement was superseded when Cox established his own agency.  Clients include the worldwide bestselling children's author Michelle Paver, US Senator Orrin Hatch, Nicholas Booth, television journalist and former MP Martin Bell OBE, science writer Brian Clegg, children's authors Joe Donnelly, M. G. Harris and Amanda Lees, and former editor of The Sun newspaper David Yelland.  Cox is now managing director of Redhammer Management, a literary agency recognized by the Association of Authors’ Agents."]}, {"page": "The Joshua Files", "response": ["The Joshua Files is a thriller book series aimed at pre-teens/teenagers written by British author M. G. Harris. The mythology of the series includes a fictional prophecy of the ancient Maya of a catastrophic event that will occur in December 2012."]}, {"page": "M.G Harris", "response": ["#REDIRECT M. G. Harris"]}, {"page": "M. G Harris", "response": ["#REDIRECT M. G. Harris"]}, {"page": "GF1", "response": ["* Gemini Force One, a novel by Gerry Anderson and M. G. Harris"]}, {"page": "Gerry Anderson's Gemini Force One", "response": ["Gerry Anderson's Gemini Force One or simply Gemini Force One is a series of science fiction books developed by television producer and writer Gerry Anderson before his death in 2012. The project was announced on the official Gerry Anderson website in July 2013, and the books were completed by author M. G. Harris based on Anderson’s own notes and outlines.", "After Gerry Anderson died in December 2012, his son Jamie Anderson approached children's book author M. G. Harris (known for The Joshua Files children's book series) to help finish his started book series. Using the crowdfunding platform Kickstarter, the book project was launched on 5 September 2013, with a set goal of £24,350 (about $39,000). On 5 October 2013, the deadline was reached, and the project had exceeded its goal, gathering £33,463 (about $53,000). With the collected funds, Harris' agent Robert Kirby was able to negotiate a publishing deal with Orion Publishing Group, with the first book entitled Black Horizon announced for release by Orion Children's Books in 2015. Designer/illustrator Andrew Probert was also brought on board to design the various craft of the Gemini Force fleet."]}, {"page": "List of Mexican women writers", "response": ["*M. G. Harris, Mexican-born British children's writer, author of The Joshua Files (2008)"]}, {"page": "List of women writers (A–L)", "response": ["*M. G. Harris (b. 1966, Mexico/England), ch. wr."]}]}}