{"wiki_id": "http://www.wikidata.org/entity/Q6715049", "itemLabel": "MC Duke", "itemDescription": "British rapper", "wikipedia_url": "https://en.wikipedia.org/wiki/MC_Duke", "wikipedia_page": {"main": "MC Duke (later just Duke) was a British rapper from the East End of London, who recorded with DJ Leader 1. He was one of the pioneers of the early British hardcore sound and later went on to record as IC3.\n\n", "link_mentions": [{"page": "Music of the United Kingdom (1980s)", "response": ["A British hip hop scene emerged in the early 1980s, largely based on American hip hop music at parties and club nights, In this period some pop records dabbled with rap – such as Adam and the Ants' \"Ant Rap\" (1981), Wham!'s \"Wham Rap! (Enjoy What You Do)\" (1982) and Malcolm McLaren's \"Buffalo Gals\" (1982). More serious British artists were rapping live or recording amateur tapes in the early 1980s, but the first British hip hop tune released on record was \"London Bridge\" by Newtrament in 1984. Over the next few years, more UK hip hop and electro was released: Street Sounds Electro UK (1984), which was produced by Greg Wilson and featured an early appearance from MC Kermit, who later went on to form the Wilson produced Ruthless Rap Assassins; The Rapologists' \"Kids Rap/Party Rap\" (1984), but releases and national publicity were still rare. Mainstream radio did play British hip hop on occasion, and instrumental in giving the scene wider recognition were DJs such as Dave Pearce, Tim Westwood, and John Peel, but in this period it made very little impact on the mainstream charts. The scene remained predominantly underground depending on word of mouth and the patronage of pirate radio stations. The first UK record label devoted to releasing UK hip hop acts was Simon Harris' Music of Life label, founded in 1986. It was home to Derek B, the first UK rapper to achieve chart success. Music of Life went on to sign groups such as Hijack, the Demon Boyz, Hardnoise (later Son of Noise) and MC Duke. Other acts and styles developed from the hip hop scene, resulting in new genres to describe them – for example Massive Attack with trip hop, or Galliano with acid jazz. Hip Hop Connection, the first major British hip hop magazine, was founded in 1989 and by the early 1990s the British hip hop scene seemed to be thriving. Not only was there a firm base of rappers in London –  such as Blade, Black Radical Mk II and Overlord X – but many distinct scenes developed nationally."]}, {"page": "Duke (disambiguation)", "response": ["* MC Duke, a British rapper"]}, {"page": "British hip hop", "response": ["Building on Derek B's success, Music of Life went on to sign groups such as Hijack, the Demon Boyz, Hardnoise (later Son of Noise) and MC Duke. Their Hard as Hell series mixed homegrown talent like Thrashpack and the She Rockers with US artists such as Professor Griff. Music of Life was swiftly followed by other labels such as Mango Records and Kold Sweat. Another successful British hip-hop artist that emerged from Music of Life was Asher D, whose Jamaican origins showed through in his vocal style.thumb|259x259px|Slick Rick is a rapper."]}, {"page": "Hip hop", "response": ["By 1984, youth worldwide were embracing the hip hop culture. The hip hop artwork and \"slang\" of U.S. urban communities quickly found its way to Europe, as the culture's global appeal took root. This was especially notable in the United Kingdom, where British hip hop grew its own voice and style from the 1980s, with rappers such as She Rockers, MC Duke, and Derek B, followed by Silver Bullet, Monie Love, Caveman, and London Posse. "]}, {"page": "Music of Life", "response": ["*MC Duke & DJ Leader 1"]}, {"page": "Simon Harris (musician)", "response": ["Within a short time, Froggy left to pursue other projects and Music of Life became one of the UK's first rap/hip-hop labels, initially licensing US products, and then with Harris producing many British rap artists including Derek B (the label's A&R executive), followed by Daddy Freddy, MC Duke, Tenor Fly, Hijack, Demon Boyz (Million Dan), and Einstein. Sister label 'Living Beat' releases include Samantha Fox (A Song for Europe), Rolf Harris (BBC TV), Dina Carroll, Jocelyn Brown and Joyce Sims. Also, via Germany's Edel Group, Harris remixed \"The Most Beautiful Girl in the World\" by Prince."]}, {"page": "DJ Leader 1", "response": ["#Redirect MC Duke"]}, {"page": "DJ Leader One", "response": ["#Redirect MC Duke"]}, {"page": "Hip Hop Connection", "response": ["Best British Artist: MC Duke •"]}, {"page": "Overlord X", "response": ["The album's success led to some strange ventures: one of the tracks, \"Visa To Rock\", was re-recorded by Overlord X with new lyrics relating to chess for a BBC documentary about the game fronted by a young Stephen Fry. A clip of the documentary, featuring Overlord X's re-recorded tune, was shown when Fry was a guest on Jonathan Ross' BBC chat show in 2005. His success also led to a long-running feud with fellow rapper MC Duke, which culminated in X recording the diss tune \"Die Hard\" about the rapper on his \"You Oughta Get Rushed\" (Mango, 1990) single. Overlord X then went on to perform for The Late Show in 1991, with huge success."]}, {"page": "List of Peel sessions", "response": ["* MC Duke: (1 session, 1987)"]}, {"page": "M.C. Duke", "response": ["#redirectMC Duke"]}, {"page": "Trip II the Moon", "response": ["*\"Freestyle Part 1\" by MC Duke and Merlin (1989)"]}]}}