{"wiki_id": "http://www.wikidata.org/entity/Q6721533", "itemLabel": "Mabel Tylecote", "itemDescription": "British politician, activist, educationist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mabel_Tylecote", "wikipedia_page": {"main": "Dame Mabel Tylecote  (née Phythian; 4 February 1896 – 31 January 1987) was a British Labour Party politician, activist, humanitarian, and educationist from Manchester, England.", "link_mentions": [{"page": "Manchester Metropolitan University", "response": ["The Faculty of Humanities, Languages and Social Science was split between the Geoffrey Manton and Mabel Tylecote buildings. The Geoffrey Manton Building accommodates the English, History and Economic History, Information and Communications, Politics and Philosophy, and Sociology departments. The Languages department was housed in the Mabel Tylecote Building until this was demolished in 2017 to make way for a new Arts and Humanities building on the site."]}, {"page": "List of people from Manchester", "response": ["* Mabel Tylecote DBE adult educationnist"]}, {"page": "Victoria Park, Manchester", "response": ["In 1836, a unique enterprise was undertaken by Richard Lane and Partners, architects. This was to establish a residential area to the east of Wilmslow Road, an \"estate\" of substantial houses in spacious grounds, where prosperous business and professional families could live. Lane was already noted for his public work in the neo-classical style, for example his town hall building at Chorlton on Medlock. The facade of this building remains on the Manchester Metropolitan University All Saints' Campus and formed part of the Mabel Tylecote Building."]}, {"page": "Middleton and Prestwich (UK Parliament constituency)", "response": ["*Labour: Mabel TylecoteReport of the Annual Conference of the Labour Party, 1939"]}, {"page": "List of Dames Commander of the Order of the British Empire", "response": ["*1966: Elsie Abbot, Margaret Drummond, Felicity Hill, Leah Manning, Ngaio Marsh, Anne McEwen, Ruth Railton, Grace Tebbutt, Mabel Tylecote"]}, {"page": "St Chrysostom's Church, Victoria Park", "response": ["In 1836, a unique enterprise was undertaken by Richard Lane and Partners, architects, to establish a residential area to the east of Wilmslow Road, an \"estate\" of substantial houses in spacious grounds, where prosperous business and professional families could live. Lane was noted for his public work in the neo-classical style, for example his Chorlton-on-Medlock Town Hall. The facade of this building remains on the Manchester Metropolitan University All Saints Campus and now forms part of the Mabel Tylecote Building. "]}, {"page": "Frank Edward Tylecote", "response": ["He was made a Commander of the Order of the British Empire in 1956, and served as a City Councillor as a Conservative from 1931, becoming a Justice of the Peace in 1934 and an Alderman in 1949. During part of this time he was Chairman of the city's Public Health Committee. His second wife was the Labour Party politician, activist and adult educationalist Dame Mabel Tylecote."]}, {"page": "Tylecote family", "response": ["* Mabel Tylecote (1896–1987), British politician and educationist"]}, {"page": "1966 Birthday Honours", "response": ["* Mabel Tylecote. For political and public services in Manchester."]}, {"page": "Listed buildings in Manchester-M15", "response": ["|The façade is all that remains of Chorlton-on-Medlock Town Hall, and it forms the front of the Mabel Tylecote Building.  It was designed by Richard Lane in Greek Revival style.  The building is in sandstone, and has two storeys and a symmetrical front of nine bays, the outer bays projecting slightly.  The ground floor is rusticated, the end bays have pilasters, and there is an entablature with a frieze, a cornice and a parapet.  In the centre is a tetrastyle portico of fluted Doric columns with four paterae on the frieze.  There are three doorways with moulded architraves, and the windows are sashes."]}, {"page": "Chorlton-on-Medlock Town Hall", "response": ["The building was remodelled in the early 1970s, with the façade retained but the interior of the building demolished to create a new refectory for the School of Art, which by that time had become part of the new Manchester Polytechnic. The Mabel Tylecote Building, named after the Labour politician, Dame Mabel Tylecote, was built on an adjacent site to the northeast and was completed in 1973. Manchester Metropolitan University, which evolved from Manchester Polytechnic after a rebranding in 1992, decided to redevelop the site with a proposed new arts and humanities building in 2018. The construction work, which was carried out by Morgan Sindall to a design by Allies and Morrison, involved the demolition of both the 1970s building behind the town hall façade and the Mabel Tylecote Building: the work, which also included the restoration and cleaning of the town hall façade, was completed and the complex re-opened in December 2020. The project was highly commended in North West Project of the Year category for Constructing Excellence in 2020."]}]}}