{"wiki_id": "http://www.wikidata.org/entity/Q6728744", "itemLabel": "Madsen Pirie", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Madsen_Pirie", "wikipedia_page": {"main": "Duncan Madsen Pirie (born 24 August 1940) is a British researcher and author.  He is a co-founder and current President of the Adam Smith Institute, a UK neoliberal think tank which has been in operation since 1978.", "link_mentions": [{"page": "August 24", "response": ["*1940 – Madsen Pirie, British academic, President and co-founder of the Adam Smith Institute"]}, {"page": "Kingsley Amis", "response": ["Amis eventually moved further right, a development he discussed in the essay \"Why Lucky Jim Turned Right\" (1967); his conservatism and anti-communism can be seen in works like the dystopian novel Russian Hide and Seek (1980).Neal Ascherson, \"Red Souls\", London Review of Books, Vol. 2, No. 10, May 1980. Retrieved 20 June 2019. In 1967, Amis, Robert Conquest, John Braine and several other authors signed a letter to The Times entitled \"Backing for U.S. Policies in Vietnam\", supporting the US government in the Vietnam War.John Wakeman, World Authors 1950–1970: A Companion Volume to Twentieth Century Authors. New York: H. W. Wilson Company, 1975, pp. 448–448 . He spoke at the Adam Smith Institute, arguing against government subsidy to the arts.Madsen Pirie, Think Tank: The Story of the Adam Smith Institute, Biteback Publishing, 2012, p. 140."]}, {"page": "Poll tax", "response": ["The Community Charge, popularly dubbed the \"poll tax\", was a tax to fund local government, instituted in 1989 by the government of Margaret Thatcher. It replaced the rates that were based on the notional rental value of a house. The abolition of rates was in the Conservative Party manifesto for the 1979 general election; the replacement was proposed in the Green Paper of 1986, Paying for Local Government based on ideas developed by Dr. Madsen Pirie and Douglas Mason of the Adam Smith Institute. It was a fixed tax per adult resident, but there was a reduction for those with lower household income. Each person was to pay for the services provided in their community. This proposal was contained in the Conservative Party manifesto for the 1987 general election. The new tax replaced the rates in Scotland from the start of the 1989/90 financial year and in England and Wales from the start of the 1990/91 financial year."]}, {"page": "Tax Freedom Day", "response": ["The concept of Tax Freedom Day was developed in 1948 by Florida businessman Dallas Hostetler, who trademarked the phrase \"Tax Freedom Day\" and calculated it each year for the next two decades.Madsen Pirie, Think Tank: A Story of the Adam Smith Institute, Biteback Publishing, 2012, p. 168 In 1971, Hostetler retired and transferred the trademark to the Tax Foundation.U.S. Patent and Trademark Office, \"Tax Freedom Day\" The Tax Foundation has calculated Tax Freedom Day for the United States ever since, using it as a tool for illustrating the proportion of national income diverted to fund the annual cost of government programs. In 1990, the Tax Foundation began calculating the specific Tax Freedom Day for each individual state."]}, {"page": "University of St Andrews", "response": ["Other notable alumni include 'father of the poll tax' Douglas Mason, founders of the Adam Smith Institute, Madsen Pirie and Eamonn Butler, former Lord Justice General Lord Cullen, two currently sitting members of the Inner House, Lord Eassie and Baroness Clark of Calton, one of the leading figures in the formation of the United States Golf Association Charles B. Macdonald, the captain of Tottenham Hotspur F.C. during its double-winning season Danny Blanchflower, and the wildlife conservationist Saba Douglas-Hamilton."]}, {"page": "Hillsdale College", "response": ["* Madsen Pirie, British researcher, author, and educator", "* Madsen Pirie, British researcher and former visitor in philosophy and logic"]}, {"page": "Adam Smith Institute", "response": ["The Adam Smith Institute (ASI) is a neoliberal (formerly libertarian) think tank and lobbying group based in the United Kingdom and named after Adam Smith, a Scottish moral philosopher and classical economist. The libertarian label was officially changed to neoliberal on 10 October 2016. The Institute advocates free market and classical liberal ideas, primarily via the formation of policy options with regard to public choice theory, which political decision makers seek to develop upon. ASI President Madsen Pirie has sought to describe the activity of the organisation as \"[w]e propose things which people regard as being on the edge of lunacy. The next thing you know, they're on the edge of policy\".", "Madsen Pirie and brothers Eamonn and Stuart Butler were students together at the University of St Andrews in Scotland.Denham, Andrew and Garnett, Mark (1998). British Thinktanks and the Climate of Opinion, London: UCL Press, p. 155 Pirie left in 1974 to work for the Republican Study Committee in Washington D.C. and then took up a professorship in Philosophy at Hillsdale College.  He was joined there by Stuart Butler while Eamonn Butler went to work with Edwin Feulner, who became co-founder and director of the free-market think tank The Heritage Foundation.", "After their experience in the United States, they returned to the United Kingdom in 1977 to found their own think tank, called the Adam Smith Institute.  After a year, Stuart Butler returned to the United States as Vice President of the Heritage in charge of domestic policy while Eamonn Butler remained with Madsen Pirie as co-directors of the Institute.", "The Margaret Thatcher era saw the think tank movement come of age and achieve influence and with the Centre for Policy Studies (CPS) and the Institute of Economic Affairs (IEA) and the ASI was one of three relied upon by the Thatcher government for policy. Unlike the CPS, which had been established by Thatcher and Keith Joseph; and the IEA, which focused on more theoretical matters, the ASI was well-placed to produce bold and direct policies. Despite this role, the Institute developed an iconoclastic reputation, cynical about politicians, but enthusiastic to engage with them. The Institute's relationship with Thatcher was not without troubles. Although Madsen Pirie was the architect of much of the privatisation policy, he had no emotional ties to Thatcher, nor did the ASI propose policies on a range of social issues despite its Thatcherite reputation.", "The ejection of the Conservative government in 1997 did not have as dramatic an effect on the ASI as some had anticipated. The Institute praised the government's welfare-to-work programmes, describing it as \"the most successful policy initiative of this century\". The ASI publicly welcomed the news that Labour had implemented the long-held ASI aim of an independent Bank of England, Madsen Pirie gave it a nine out of ten for performance. Eamonn Butler has ascribed this flexibility to who is in power to their role not being \"to be political or shout slogans\", but to be \"policy engineers\".", "In 1992, the Institute founded a consulting company, Adam Smith International Ltd, which was \"charged with overseeing the overseas work of the institute [in] an attempt to capitalise on the growing international trend towards economic liberalization and marketization\".Denham and Garnett (1998), p. 153 While Eamonn Butler and Madsen Pirie were as of 1998 members of the management board of both organisations, the management teams of Adam Smith International and the Institute are now separate.", "* Economy and Local Government, Eamonn Butler & Madsen Pirie, 1981 ", "* Aid by Enterprise, Eamonn Butler & Madsen Pirie, 1984 ", "* Micropolitics: Creation of a Successful Policy, Madsen Pirie, 1988 ", "* Blueprint for a Revolution, Madsen Pirie, 1993 ", "* Vision: Targets for Britain, Madsen Pirie, 1994 ", "* The End of the Welfare State, Eamonn Butler & Madsen Pirie, 1994 ", "* Freedom 101, Madsen Pirie, 2008 ", "* Economics Made Simple, Madsen Pirie 2012 ", "* Think Tank, Madsen Pirie 2012 "]}, {"page": "Christopher Chope", "response": ["Michael Forsyth, and was influenced by Madsen Pirie. He finished his education at the Inns of Court School of Law. Chope was called to the bar at the Inner Temple in 1972."]}, {"page": "Mont Pelerin Society", "response": ["* Madsen Pirie"]}, {"page": "Federation of Conservative Students", "response": ["The Libertarian faction (the \"Libs\") was closely linked to the Libertarian Alliance run by Chris Tame, and the Adam Smith Institute, run by Madsen Pirie."]}, {"page": "False precision", "response": ["Madsen Pirie defines the term \"false precision\" in a more general way: when exact numbers are used for notions that cannot be expressed in exact terms. For example, \"We know that 90% of the difficulty in writing is getting started.\" Often false precision is abused to produce an unwarranted confidence in the claim: \"our mouthwash is twice as good as our competitor's\"."]}, {"page": "List of philosophers born in the 20th century", "response": ["* Madsen Pirie (born 1940)"]}, {"page": "Eamonn Butler", "response": ["He co-founded the Adam Smith Institute in London with his brother Stuart and Madsen Pirie, both graduates from the University of St Andrews. He now serves as its Director.Profile: Eamonn Butler, The Guardian", "*Fortune Account, Eamonn Butler & Madsen Pirie, 1995", "*The End of the Welfare State, Eamonn Butler & Madsen Pirie, 1994", "*The Health Alternatives, Eamonn Butler & Madsen Pirie, 1988", "*Aid by Enterprise, Eamonn Butler & Madsen Pirie, 1984", "*Free Ports, Eamonn Butler & Madsen Pirie, 1983", "*Economy and Local Government, Eamonn Butler & Madsen Pirie, 1981"]}, {"page": "The Trap (British TV series)", "response": ["* Madsen Pirie, founder of the Adam Smith Institute"]}, {"page": "Stars and planetary systems in fiction", "response": ["* The Waters of Andros (2007), novel by Madsen Pirie. Pirie writes, \"Andros is a beautiful and perfectly formed blue jewel of a planet, sparkling in the blackness of space. It is far away, circling the distant [89 ly] star Beta Eridani.\""]}, {"page": "Douglas Mason", "response": ["He did his most influential work for Adam Smith Institute, run by fellow St Andrews alumni Dr Madsen Pirie and Eamonn Butler who founded the institute in 1977. Mason became one of its regular authors. In 1982, he led the Adam Smith Institute's \"Omega Project\" report on Local Government Policy. There he argued for the compulsory contracting-out of most local services such as refuse collection, proposed scrapping the existing local-government tax, in favour of a per-capita charge. Other policy recommendations included the privatisation of the Royal Mail The Last Post (1991); the privatisation of free British reading Ex Libris (1986); the privatisation of the Forestry Commission the complete removal of arts subsidies Expounding The Arts (1987), abolition of restrictions on drinking Time To Call Time (1986), and ending free reading in public libraries Ex Libris (1986)."]}, {"page": "List of Mensans", "response": ["* Madsen Pirie – philosopher and economist"]}, {"page": "Matthew Humberstone School", "response": ["*Madsen Pirie, President of the Adam Smith Institute think tank."]}, {"page": "List of Question Time episodes", "response": ["|Grey Gowrie, Kate Hoey, William McCarthy, Madsen Pirie", "|David Blunkett, Patrick Jenkin, Madsen Pirie, Nancy Seear", "|Margaret Beckett, Kenneth Clarke, Dr Madsen Pirie, Nina Temple"]}, {"page": "Graduate tax", "response": ["In 2017, Dr Madsen Pirie of the free-market think tank Adam Smith Institute proposed a graduate tax in the Institute's A Millennial Manifesto publication: it suggested a tax of 5% levied on graduates earning over £22,500 in income, rising to 8% for those earning over £30,000. It also suggested that there should be no interest charged, instead indexing the amount each year in line with inflation.https://www.adamsmith.org/s/A-Millenial-Manifesto-nyeh.pdf#page=6 ", "Madsen Pirie of the free-market Adam Smith Institute, writing in The Daily Telegraph, argues that it is wrong for talented graduates to face higher taxes under a form of progressive taxation and that such a proposal might make emigration more appealing to graduates. A loan can also be paid off early whereas a tax would continue to be charged for a longer period of time."]}, {"page": "Pirie", "response": ["* Madsen Pirie (born 1940), British researcher, author and educator"]}, {"page": "Madsen (surname)", "response": ["* Madsen Pirie"]}, {"page": "GCE Ordinary Level (United Kingdom)", "response": ["Madsen Pirie argued that the O-level was unfairly biased to boys because of the emphasis on exam-based learning, and therefore girls were placed at a disadvantage. Pirie also observes that the GCSE focus on coursework has now disadvantaged boys, and has reversed the gender gap in attainment to the level where, in all subjects, girls outperform boys."]}]}}