{"wiki_id": "http://www.wikidata.org/entity/Q6722312", "itemLabel": "Mac MacLeod", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Mac_MacLeod", "wikipedia_page": {"main": "Keith MacLeod (popularly known as \"Mac\" MacLeod) (9 July 1941 – 16 November 2020), was an English musician who was a part of the Hertfordshire folk and blues scene from 1959 onwards. He played in St Albans alongside Mick Softley and Maddy Prior and toured with John Renbourn. Influences include Softley, Ramblin' Jack Elliott, Derroll Adams, Jesse Fuller, Big Bill Broonzy, Snooks Eaglin, Reverend Gary Davis and Davey Graham.\nMacLeod was an early influence on Donovan, and was the bassist for the original line-up of Hurdy Gurdy which also inspired the Donovan song \"The Hurdy Gurdy Man\". MacLeod has also worked with Argent. Other bands MacLeod formed of note include Soft Cloud, Loud Earth with Mick Softley and the acoustic-based band Amber.", "link_mentions": [{"page": "July 9", "response": ["*1941 – Mac MacLeod, English musician (d. 2020)"]}, {"page": "Donovan", "response": ["Returning to Hatfield, Donovan spent several months playing in local clubs, absorbing the folk scene around his home in St Albans, learning the crosspicking guitar technique from local players such as Mac MacLeod and Mick Softley and writing his first songs. In 1964, he travelled to Manchester with Gypsy Dave, then spent the summer in Torquay, Devon. In Torquay he stayed with Mac MacLeod and took up busking, studying the guitar, and learning traditional folk and blues.", "In early 1968 he was part of the group that traveled to the ashram of Maharishi Mahesh Yogi in Rishikesh. The visit gained worldwide attention thanks to the presence of all four Beatles as well as Beach Boys lead singer Mike Love, as well as actress Mia Farrow and her sister Prudence (who inspired Lennon to write \"Dear Prudence\"). According to a 1968 Paul McCartney interview with Radio Luxembourg, it was during this time that Donovan taught Lennon and McCartney finger-picking guitar styles including the clawhammer, which he had learned from Mac MacLeod. Lennon used this technique on songs including \"Dear Prudence\", \"Julia\", \"Happiness is a Warm Gun\" and \"Look at Me\", and McCartney with \"Blackbird\" and \"Mother Nature's Son\".", "Donovan's next single, in May 1968, was the psychedelic \"Hurdy Gurdy Man\". The liner notes from EMI's reissues say the song was intended for Mac MacLeod, who had a heavy rock band called Hurdy Gurdy. After hearing MacLeod's version, Donovan considered giving it to Jimi Hendrix, but when Most heard it, he convinced Donovan to record it himself. Donovan tried to get Hendrix to play, but he was on tour. Jimmy Page played electric guitar in some studio sessions and is credited with playing on the song.Liner notes, Troubadour: The Definitive Collection 1964–1976, Sony Music Entertainment, 1992. (\"Hurdy Gurdy Man\" recording in London, England, 1968, crediting Donovan on vocal, acoustic guitar and tambura, Allan Holdsworth and Jimmy Page on electric guitars, John Paul Jones on bass, John Bonham and \"Clem Clatini\" (a misspelling of Clem Cattini) on drums, produced by Most, arrangement by John Paul Jones, Epic LP BN 25420, Epic single 5-10345.)DeCurtis, A., \"Donovan's Calling\", essay released in liner notes of Try for the Sun: The Journey of Donovan 2005 limited-edition boxed set compilation by Sony BMG Music Entertainment Legacy Recordings. Alternatively, it is credited to Alan Parker.", "In November 2003, the University of Hertfordshire awarded Donovan an honorary Doctor of Letters degree. He was nominated by Sara Loveridge (a student at the university who had interviewed and reviewed Donovan for the university paper in 2001–2002); Andrew Morris, Sara's partner and Donovan researcher/writer; and Mac MacLeod."]}, {"page": "Boz Scaggs", "response": ["Leaving school, Scaggs briefly joined the burgeoning R&B scene in London, then traveled on to Sweden as a solo performer, and in 1965 recorded his solo debut album, Boz, which failed commercially. He also had a brief stint with the band the Other Side with Mac MacLeod and Jack Downing."]}, {"page": "John Renbourn", "response": ["In the 1960s, the new craze in popular music was Rhythm and Blues, also the impact of Davey Graham was being felt. In 1961, Renbourn toured the South West with Mac MacLeod and repeated the tour in 1963. On returning from the South West Renbourn and MacLeod recorded a demo tape together. Renbourn briefly played in an R&B band while studying at the Kingston College of Art in London. Although the British folk revival was underway, most folk clubs were biased towards traditional, unaccompanied folk songs, and guitar players were not always welcome. However, the Roundhouse in London had a more tolerant attitude and here, John Renbourn joined blues and gospel singer Dorris Henderson, playing backing guitar and recording two albums with her."]}, {"page": "Maddy Prior", "response": ["Madelaine Edith Prior MBE (born 14 August 1947) is an English folk singer, best known as the lead vocalist of Steeleye Span.The Times, 28 January 2000; interview with Maddy Prior She was born in Blackpool and moved to St Albans in her teens. Her father, Allan Prior, was co-creator of the police drama Z-Cars. She was married to Steeleye bass guitarist Rick Kemp and their daughter, Rose Kemp, is also a singer. Their son, Alex Kemp, is, like his father, a guitarist and has deputised for his father playing bass guitar for Steeleye Span. She was part of the singing duo 'Mac & Maddy', with Mac MacLeod. She then performed with Tim Hart and recorded two albums with him, before they helped to found the group Steeleye Span, in 1969. She left Steeleye Span in 1997, but returned in 2002, and has toured with them since. With June Tabor she was the singing duo Silly Sisters. She toured with the Carnival Band, in 2007, and with Giles Lewin and Hannah James, in 2012 and 2013. She has released singles and albums as a solo artist, with these bands and in several collaborations. She runs an Arts Centre called Stones Barn, in Bewcastle, in Cumbria, which offers residential courses.", "Born in Blackpool, Prior moved in her teens to St Albans, where she befriended the young Donovan Leitch and Mac MacLeod in The Cock pub. She later formed a duo with MacLeod called 'Mac & Maddy'. She became a roadie for visiting American musicians, including Reverend Gary Davis. They gave her useful advice about singing English folk songs instead of American songs.  Her father, Allan Prior, was co-creator of the police drama Z-Cars, and wrote Stookie, a 6-part series for television, about a boy with his arm in a sling. Maddy sang the title song, which was released as a single in 1985. It reappeared on the Steeleye Span album A Rare Collection 1972 – 1996.", "After a brief stint with Mac MacLeod in 'Mac & Maddy' (another act formed at The Cock pub), by 1966 she began performing with Tim Hart, another St Albans resident, and together they recorded two albums before becoming founding members of Steeleye Span in 1969. They were the backbone of the group until the early 1980s when ill-health forced Hart into semi-retirement. Prior plays the tambourine, spoons and ukulele, and always gives a sprightly performance of her individual dances. In 1974 Ralph McTell wrote \"Maddy Dances\" in her honour, included on his album Easy."]}, {"page": "Terrastock", "response": ["Bardo Pond, Man, Green Pajamas, Lucky Bishops, Windy and Carl, Freed Unit, Spaceheads, The Azusa Plane, Pat Orchard, Air Traffic Controllers, The Bevis Frond, Alchemysts + Simeon, Damon and Naomi, Tom Rapp, Spacious Mind, Warser Gate, The Lothars, Kirk Lake, Pop Off Tuesday, Bablicon, Mac MacLeod, Abunai!, Hood, Broken Dog, My Drug Hell, White Hotel, Piano Magic, Arco, The Autumn Leaves, Green Ray"]}, {"page": "Argent (band)", "response": ["The first three demos from Argent, recorded in the autumn of 1968 featured Mac MacLeod on bass guitar, though he would not become a member of the group. Rod Argent, Chris White (former Zombies bassist, producer, songwriter) and Russ Ballard were the group's songwriters."]}, {"page": "Hurdy Gurdy (band)", "response": ["Hurdy Gurdy emerged from the Danish group Peter Belli and the Boom Boom Brothers (aka The B.B. Brothers) in June 1967, when three members of the B.B. Brothers, guitarist Claus Bøhling, drummer Jens Otzen and British vocalist and bassist Mac MacLeod formed the power trio. Inspired by Cream but with more psychedelic leanings, they split from Peter Belli and MacLeod named the band 'Hurdy Gurdy'. They had considerable success in Scandinavia, breaking many attendance records for their live shows. The band moved to England in early 1968, after MacLeod had been deported from Denmark.", "While they were in the UK, they did some recordings produced by Chris White and Rod Argent of The Zombies. Two tracks by the MacLeod era of Hurdy Gurdy, \"Tick Tock Man\" and \"Neo Camel\", are on the Mac MacLeod anthology The Incredible Musical Odyssey of the Original Hurdy Gurdy Man and showcase the free-flowing power trio psychedelic rock sound."]}, {"page": "Amber (band)", "response": ["#REDIRECT Mac MacLeod"]}, {"page": "Hurdy Gurdy Man", "response": ["According to some sources, the song was written for the band Hurdy Gurdy (which included Donovan's old friend and guitar mentor Mac MacLeod(15 June 1968). Donovan's More Down to Earth, New Musical Express.Altham, Keith (December 1968). Coming Down From the Clouds, Hit Parader.) with Donovan intending to be the producer, but the collaboration was cancelled due to creative disagreements, leading Donovan to record the song himself.(6 July 1968). Don Wants to Spin a Film Legend, Melody Maker. In the chapter dedicated to the song in Donovan's autobiography, he says that he originally wanted it to be recorded by Jimi Hendrix."]}, {"page": "Mick Softley", "response": ["Michael Softley (26 September 1939 – 1 September 2017) was an English singer-songwriter and guitarist. A figurehead during the British folk scene, Softley set up his own folk club, released three albums and worked with performers such as Mac MacLeod, Donovan, and Maddy Prior. Donovan covered two of Softley's songs (\"Goldwatch Blues\" and \"The War Drags On\") in 1965. Dave Berry also covered two of Softley's songs (\"Walk Walk Talk Talk\" and \"I Love You Baby\") in 1966.", "After his absence, Softley returned with an electric group, Soft Cloud, Loud Earth. The group was soon trimmed down to a duo consisting of Softley and Mac MacLeod called Soft Cloud. They only performed a few times before they split up and Softley went on to pursue a solo career. Meeting Donovan again, he was persuaded to record for a second time. This time  Tony Cox was on board for production and Softley claimed that \"everybody all along the line was really good. Totally different to what I'd been through five years before – No-one was trying to make a fast penny out of me, and they were prepared to let me do everything exactly how I wanted to\". Softley recorded three albums during this period, which have a different tone from the first album, due to the variety of instruments and styles showcased on these albums, from upbeat rock (\"Can You Hear Me Now?\") and folk (\"Goldwatch Blues\") to eastern-inspired sitar pieces (\"Love Colours\") and skiffle (\"Ragtime Mama\"). In 1971 he performed on French television programme Grande Affiche.\"Paris\", Billboard, 23 January 1971, p. 60. Retrieved 6 November 2013"]}, {"page": "Gyp Mills", "response": ["In late 1964 Donovan had been signed up to a record label and asked Mills to accompany him on his first tour with his other friends Mac MacLeod and John Lock. Donovan wrote \"To Try for the Sun\" and \"Hey Gyp (Dig the Slowness)\" about his time with Mills. Mills was tour manager for Donovan for many years, and appeared alongside Donovan in the TV film, A Boy Called Donovan. ", "\"Gyp was Donovan's right hand man and a great job he did of it too\" – Mac MacLeod talking about Donovan's first tour in 1965 from KFOK-LP radio interview on 14 June 2005."]}, {"page": "List of psychedelic rock artists", "response": ["*Mac MacLeod"]}, {"page": "Keith MacLeod (musician)", "response": ["#REDIRECT Mac MacLeod "]}]}}