{"wiki_id": "http://www.wikidata.org/entity/Q6721039", "itemLabel": "Maajid Nawaz", "itemDescription": "British activist (born 1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/Maajid_Nawaz", "wikipedia_page": {"main": "Maajid Usman Nawaz (Urdu: [ˈmaːdʒɪd̪ nəwaːz]; born 2 November 1977) is a British activist and radio presenter. He was the founding chairman of Quilliam, a counter-extremism think tank that sought to challenge the narratives of Islamist extremists and, until January 2022, was the host of an LBC radio show on Saturdays and Sundays. \nBorn in Southend-on-Sea, Essex, to a British Pakistani family, Nawaz is a former member of the Islamist group Hizb ut-Tahrir, an association that led to his December 2001 arrest in Egypt, where he remained imprisoned until 2006. Reading books on human rights and interacting with Amnesty International—who adopted him as a prisoner of conscience—resulted in a change of heart: he left Hizb-ut-Tahrir in 2007, renounced his Islamist past, and called for a \"secular Islam\". After his turnaround, Nawaz co-founded Quilliam with former Islamists, including Ed Husain. He wrote an autobiography, Radical (2012) and has since become a prominent critic of Islamism in the United Kingdom.\nHe is a weekly columnist for The Daily Beast, and his writings have been published in various international newspapers; he appears frequently on television; and has delivered lectures including at the UK Defence Academy and Marshall Center for Security Studies. His second book, Islam and the Future of Tolerance (2015), co-authored with atheist author Sam Harris, was published in October 2015. He was the Liberal Democrat parliamentary candidate for London's Hampstead and Kilburn constituency in the 2015 general election.", "link_mentions": [{"page": "Islamism", "response": ["* \"a theocratic ideology that seeks to impose any version of Islam over society by law\". (Maajid Nawaz, a former Islamist turned critic). Subsequently, clarified as \"the desire to impose any given interpretation of Islam on society\".Maajid Nawaz and Sam Harris. Islam and the Future of Tolerance: A Dialogue. Harvard University Press. Cambridge, Massachusetts. London. (2015). Kindle Edition, Location 167 of 1580."]}, {"page": "LGBT in Islam", "response": ["* The Muslim Debate Initiative (MDI) made up of Muslims \"with experience in public speaking, apologetics, polemics, research and community work.\" One of its aims is \"to support, encourage and promote debate that contrasts Islam against other intellectual and political discourses for the purpose of the pursuit of truth, intellectual scrutiny with respect, and the clarifying accurate understandings of other worldviews between people of different cultures, beliefs and political persuasions.\" One of its broadcasts was on BBC3's \"Free Speech\" program on 25 March 2014. The debate was between Maajid Nawaz and Abdullah al Andalusi on the question \"Can you be Gay and Muslim?\" It is on YouTube at \"Gay and Muslim?\"."]}, {"page": "Southern Poverty Law Center", "response": ["In October 2016, the SPLC published its \"Field Guide to Anti-Muslim Extremists\", which listed the British activist Maajid Nawaz and a nonprofit group he founded, the Quilliam Foundation. Nawaz, who identifies as a \"liberal, reform Muslim\", denounced the listing as a \"smear\", saying that the SPLC listing had made him a target of jihadists.Nawaz: Southern Poverty Law Center put a target on my head, Fox News, June 26, 2017Maajid Nawaz Interview Real Time with Bill Maher (HBO) In June 2018, the SPLC issued an apology, stating:", "Along with the apology, the SPLC paid US$3.375 million to Nawaz and the Quilliam Foundation in a settlement. Nawaz said about the settlement that Quilliam \"will continue to combat extremists by defying Muslim stereotypes, calling out fundamentalism in our own communities, and speaking out against anti-Muslim hate.\"\"Southern Poverty Law Center, Inc. Admits It Was Wrong, Apologizes to Quilliam and Maajid Nawaz for Field Guide to Anti-Muslim Extremists, and Agrees to Pay $3.375 Million Settlement\" , Quilliam websiteSPLC to pay $3.4 million to British group it called anti-Muslim extremists. Associated Press, June 18, 2018 The SPLC ultimately removed the Field Guide from its website."]}, {"page": "1977", "response": ["* November 2 – Maajid Nawaz, British-Pakistani activist and radio presenter "]}, {"page": "Islamophobia", "response": ["Muslim reformist Maajid Nawaz, a former member of the Islamist Hizb ut-Tahrir group and founder of the counter-extremism Quilliam think-tank has criticized the term \"Islamophobia\" on several occasions, stating in 2020 it conflates racism with blasphemy and \"there's a huge difference in being critical of an idea and critical of a person because of their political or religious identity.\" Nawaz argues that \"anti-Muslim bigotry\" is a more accurate phrase to use instead of Islamophobia when addressing prejudice faced by people of Muslim origin."]}, {"page": "Daniel Pipes", "response": ["Pipes was included in the Southern Poverty Law Center (SPLC) Field Guide to Anti-Muslim Extremists that was removed from the SPLC website after Maajid Nawaz filed a lawsuit. However, on the SPLC website he is still considered a \"anti-Muslim mainstay figure\" and \"anti-Muslim activist\" in many Hatewatch and Intelligence Report articles."]}, {"page": "Southend-on-Sea", "response": ["* Maajid Nawaz, former Islamist activist who now campaigns against extremism"]}, {"page": "Qutbism", "response": ["Critics (such as Maajid Nawaz) protest that Qutb's complaint about both American racism and the \"primitive inclinations\" of the \"Negro\" are contradictory and hypocritical. There is also doubt as to whether the sentiment that \"sexual relations\" has no \"ethical element\" would have been representative of American public opinion at the height of the sexual revolution 30 years later, let alone at the time of Qutb's visit to America in the late 1940s."]}, {"page": "Islamic Human Rights Commission", "response": ["In March 2015, IHRC gave the French satirical magazine Charlie Hebdo their \"International Islamophobe of the Year\" award, less than two months after 12 members of staff at the magazine had been killed by Islamist extremists. The group was also criticised for giving counter extremism campaigner and Muslim Maajid Nawaz its \"UK Islamophobe of the Year\" award."]}, {"page": "Islamic terrorism", "response": ["The motivation of Islamic terrorists has been disputed. Some (such as Maajid Nawaz, Graeme Wood, and Ibn Warraq) attribute it to extremist interpretations of Islam;  others (Mehdi Hasan) to some combination of political grievance and social-psychological maladjustment;  and still others (such as James L. Payne and  Michael Scheuer) to a struggle against \"U.S./Western/Jewish aggression, oppression, and exploitation of Muslim lands and peoples\".", "Maajid Nawaz and Sam Harris argue that in many cases there is simply no connection between acts of Islamic extremism and Western intervention in Muslim lands."]}, {"page": "Omar Bakri Muhammad", "response": ["In the UK, Bakri worked for ten years helping to build up Hizb ut-Tahrir. According to ex-Hizb ut-Tahrir associate Maajid Nawaz, Bakri encouraged its members to engage in vigilantism against non-Muslims and Muslim women: \"We were encouraged by Omar Bakri to operate like street gangs and we did, prowling London, fighting Indian Sikhs in the west and African Christians in the east. We intimidated Muslim women until they wore the hijab and we thought we were invincible.\"\"I was a radical Islamist who hated all of you\", news.com.au; accessed 25 October 2015.", "Bakri is, or was, married to Hanah and has seven children. According to ex-Hizb ut-Tahrir member Maajid Nawaz, Bakhri's daughter, Yasmin Fostok, \"grew so disillusioned with her father's rhetoric that in one monumental act of defiance she left home and became a stripper\".Maajid Nawaz, Radical (London: W.H. Allen, 2012), p. 328."]}, {"page": "Hizb ut-Tahrir", "response": ["Researchers Houriya Ahmed and Hannah Stuart quote another HT critic (and former member of HTB's national executive committee Maajid Nawaz), as saying that HT differs from some other Islamist jihadist groups in that rather than creating its own army for jihad, HT plans to \"use pre-existing militaries\".Ahmed & Stuart, Hizb Ut-Tahrir, 2009: p.46 An August 2008 HT conference in London ended its presentation with the statistic that the Islamic world has, \"4.7 million armed personnel – more than the USA, Europe and India combined.\"Kadri, Heaven on Earth, 2012: p.275 (Some (Zeyno Baran) have expressed skepticism of the HT doctrine that Muslim governments would be overthrown non-violently to create a new caliphate, given government officials natural desire to stay in power and out of prison (or a firing squad), and the force of arms at their disposal to fight coup attempts.Baran, Hizb ut-Tahrir: Islam’s Political Insurgency, 2004:22 In the late 1960s and early 1970s, several unsuccessful military coups by pro-HT factions were attempted in countries in the Middle East,Sageman, Marc, Understanding Terror Networks by Marc Sageman, University of Pennsylvania Press, 2004, p.28 and at least one involved fatalities.)", "HT opened a branch in Denmark in 2000 with the help of British HT members.Maajid Nawaz helped establish HT Denmark. See ‘Defectors from Hizb ut-Tahrir’, Tidende Berlingske (Denmark), 28 October", "Radical: My Journey out of Islamist Extremism is Maajid Nawaz's autobiography. It partly recounts his time as a recruiter for Hizb ut-Tahrir, his imprisonment in Egypt from 2002 to 2006, and his release after being cited as a \"prisoner of conscience\" by Amnesty International. In 2007, he left HT and co-founded the Quilliam Foundation with Ed Husain, an organization focused on countering extremism in the Muslim World. Radical was released in the UK in 2012; a US edition was published by Lyons Press in October 2013 with a preface for US readers and an updated epilogue.", "* Maajid Nawaz – former member, current founder of Quilliam Foundation"]}, {"page": "Ayaan Hirsi Ali", "response": ["In October 2016, the Southern Poverty Law Center accused Ayaan, and the Muslim activist Maajid Nawaz, of being \"anti-Muslim extremists\", which caused protests in several prominent newspapers. The Lantos Foundation for Human Rights & Justice wrote a public letter to the SPLC asking them to retract the listings.", "In a 2007 article in Reason, Hirsi Ali said that Islam, the religion, must be defeated and that \"we are at war with Islam. And there's no middle ground in wars.\" She said, \"Islam, period. Once it's defeated, it can mutate into something peaceful. It's very difficult to even talk about peace now. They're not interested in peace ... There comes a moment when you crush your enemy. ... and if you don't do that, then you have to live with the consequence of being crushed.\" Adding: \"the Christian powers have accepted the separation of the worldly and the divine. We don't interfere with their religion, and they don't interfere with the state. That hasn't happened in Islam.\" She reiterated her position that the problem isn't just a few \"rotten apples\" in the Islamic community but \"I'm saying it's the entire basket.\" She stated that the majority of Muslims aren't \"moderates\" and they must radically alter their religion. Max Rodenbeck, writing in The New York Review of Books, noted that Ali now narrowly criticizes what she calls \"Medina Muslims\", meaning the fundamentalists who envision a regime based on sharia, and who ignore the more inclusive passages of Muhammad's Meccan period, a small minority of Muslims, who are, nevertheless, quite influential among young Muslims, according to Hirsi Ali: \"These men, I find them to be far more influential in inspiring and mobilising young men to see the religion of Islam the way they see it, than the way either Imam Faisal says he sees it, or Maajid Nawaz says he sees it.\" Ayaan Hirsi Ali stated that, in her opinion, \"The Christian extremists here, in the United States, who take the Bible and use it to kill people and hurt people, they are the fringe, but unfortunately, what we are seeing in Muslim countries is that the people who feel they should be governed under the Sharia Law, are not a fringe. ... Islam can become a religion of peace, if politics is divorced from religion\", and she stated that: \"The individual that wants to kill me because I am an apostate of Islam, is inspired to do that from the scripture of Islam, the example of the prophet Mohammed, the clergy that preached to him, and the reward that he will get in the hereafter.\" Although Hirsi Ali has previously described Islam as beyond reform, she has stated that the Arab spring and growing visibility of women's rights activists within Muslim societies has demonstrated to her that a liberal reformation of Islam is possible and outlines how this could be achieved in her book Heretic by supporting reformist Muslims."]}, {"page": "Mahmoud al-Zahar", "response": ["During the 2008–2009 Gaza War, al-Zahar, during a television broadcast, was reported to have said that the Israelis \"have legitimised the murder of their own children by killing the children of Palestine... They have legitimised the killing of their people all over the world by killing our people.\" This remark was widely reported as advocating the \"murder\" of Jewish children worldwide. Maajid Nawaz condemned the remarks as \"depraved\" and \"perverse Al-Qaeda logic,\" writing that, as opposed to Hamas, \"Israel does not have an active policy of deliberately capturing children to murder them, or even deliberately murdering civilians for that matter.\" Basim Naim, the minister of health in the Hamas government in Gaza, said Zahar's statements had been misquoted and mistranslated, and that what he did was to \"warn that by carrying out these barbaric massacres of children and women, and by destroying our mosques, the Zionists are creating the conditions for people to believe it is justified or legitimate to take revenge....Dr Zahar did not even mention 'Jews' in his comments\"."]}, {"page": "Islam in Australia", "response": ["During an interview on ABC Lateline program, the authors of a book entitled Islam and the Future of Tolerance, Sam Harris, an atheist and neuroscientist, and Maajid Nawaz, a former Hizb-ut-Tahrir member, argued that Islam has failed to modernise.  Harris said, \"We have a task ahead of us, a monumental task ahead of us, and that is to begin the process of adapting, reinterpreting our scriptures for the modern day and age.\" Politician Andrew Hastie has said, \"Modern Islam needs to cohere with the Australian way of life, our values and institutions. In so far as it doesn’t, it needs reform.\" Former federal Treasurer, Peter Costello has said, \"Islamic scholars need to tell would-be jihadis, why these difficult sections of the Koran and the Hadiths,\" which may have been acceptable in the 7th century, \"are not to be taken literally and not to be followed today\"."]}, {"page": "Sadiq Khan", "response": ["* Represented Maajid Nawaz, Reza Pankhurst and Ian Nisbet in Egyptian court when they were arrested on charges of trying to revive Hizb ut-Tahrir."]}, {"page": "Ron Dermer", "response": ["In December 2016 he was criticized for accepting an award from the controversial Center for Security Policy, a conservative think tank led by Frank Gaffney, which was designated as a hate group by the SPLC.Israel’s U.S. Ambassador Cozies Up to Muslim-haters, but Won’t Meet (Pro-peace) Israel-lovers Haaretz, 13 December 2016 The SPLC encouraged Dermer to decline the award because it \"not only further legitimizes this organization, but could be read as an endorsement of anti-Muslim hate by the Israeli government.\"  For his part, in his acceptance speech, Dermer criticized the SPLC for calling Gaffney, Daniel Pipes, Maajid Nawaz, Ayaan Hirsi Ali  and others anti-Muslim extremists. During his speech Dermer described \"militant Islam\" as a \"virulent ideology now ascendant in the Muslim world\"."]}, {"page": "Sam Harris", "response": ["Harris's first book, The End of Faith (2004), won the PEN/Martha Albrand Award for First Nonfiction and remained on The New York Times Best Seller list for 33 weeks. Harris has since written six additional books: Letter to a Christian Nation in 2006, The Moral Landscape: How Science Can Determine Human Values in 2010, the long-form essay Lying in 2011, the short book Free Will in 2012, Waking Up: A Guide to Spirituality Without Religion in 2014, and (with British writer Maajid Nawaz) Islam and the Future of Tolerance: A Dialogue in 2015. Harris's work has been translated into over 20 languages.", "In 2006, Harris described Islam as \"all fringe and no center,\" and wrote in The End of Faith that \"the doctrine of Islam [...] represents a unique danger to all of us\", arguing that the War on terror is really a war against Islam. In 2014, Harris said he considers Islam to be \"especially belligerent and inimical to the norms of civil discourse\", as it involves what Harris considers to be \"bad ideas, held for bad reasons, leading to bad behavior.\" In 2015 Harris and secular Islamic activist Maajid Nawaz cowrote  Islam and the Future of Tolerance. In this book, Harris argues that the word Islamophobia is a \"pernicious meme\", a label which prevents discussion about the threat of Islam. Harris has been described in 2020 by Jonathan Matusitz, Associate Professor at the University of Central Florida, as \"a champion of the counter-jihad left\".", "Harris's dialogue on Islam with Maajid Nawaz received a combination of positive reviews and mixed reviews. Irshad Manji wrote: \"Their back-and-forth clarifies multiple confusions that plague the public conversation about Islam.\" Of Harris specifically, she said \"[he] is right that liberals must end their silence about the religious motives behind much Islamist terror. At the same time, he ought to call out another double standard that feeds the liberal reflex to excuse Islamists: Atheists do not make nearly enough noise about hatred toward Muslims.\""]}, {"page": "List of people associated with the London School of Economics", "response": ["* Maajid Nawaz, author and activist"]}, {"page": "Muslim Public Affairs Committee UK", "response": ["Maajid Nawaz, a former radical Islamist turned liberal activist and chairman of the anti-extremist foundation Quilliam, said in an interview with the BBC that there is an unhealthy anti-Semitic strand to MPAC's thinking. People who disagree with MPACUK or criticize them are described as \"... pro-Zionist stooges, or neoconservatives, or Uncle Toms.\""]}, {"page": "Jihadism", "response": ["Maajid Nawaz, founder and chairman of the anti-extremism think tank Quilliam, defines jihadism as a violent subset of Islamism: \"Islamism [is] the desire to impose any version of Islam over any society. Jihadism is the attempt to do so by force.\""]}, {"page": "Asghar Bukhari", "response": ["Various memes cropped up mocking Bukhari's allegations, but his shoe also became the subject of a Twitter account and a jokey Change.org petition demanding its return which was signed by several hundred people. Israel's ambassador to South Africa, Arthur Lenk, tweeted: \"We have your shoe, @AsgharBukhari. Call me.\" Maajid Nawaz, a former radical Islamist turned liberal activist and chairman of the anti-extremist Quilliam think-tank said in an interview with the BBC that there is an unhealthy anti-Semitic strand to Bukhari's thinking. People who disagree with Bukhari or criticise him such as making fun of his shoe loss theory are described as \"pro-Zionist stooges, or neoconservatives, or Uncle Toms.\""]}, {"page": "The Daily Beast", "response": ["*Maajid Nawaz"]}, {"page": "Burkini", "response": ["The bans and their enforcement prompted criticism and ridicule abroad, particularly in English-speaking countries. A The New York Times editorial called French politicians' \"paternalistic pronouncements on the republic's duty to save Muslim women from enslavement\" bigotry and hypocritical. Liberal British Muslim activist Maajid Nawaz offered a critique of both the swimsuit and its ban: \"Burkini is sad symbol of Islam today going backwards on gender issues. Banning it is sad symbol of liberalism today going backwards in reply.\" Other Muslim commentators, particularly Muslim women, have argued that the burkini gives women who do not wish to expose their body for religious or other reasons the freedom to enjoy the beach."]}, {"page": "Jesus and Mo", "response": ["Muslim Liberal Democrat politician Maajid Nawaz tweeted a picture of one of the Jesus and Mo T-shirts, after the cartoon came up in a discussion on a BBC programme The Big Questions. On the programme, the production team stopped participants from being shown wearing T-shirts with the cartoon, which depicted Jesus saying \"Hey\" and \"Mo\" saying \"How ya doing?\"Nick Cohen \"The Liberal Democrats face a true test of liberty\" , The Observer, 25 January 2014 The BBC had feared a hostile response from some Muslims. On Twitter, Nawaz later wrote that he did not find the T-shirts offensive and that he received death threats for this stance.Keith Perry \"Lib Dem candidate receives death threats for tweeting Prophet Mohammed cartoon\"  Daily Telegraph 21 January 2014"]}, {"page": "The Islamist", "response": ["* Maajid Nawaz"]}, {"page": "World-Check", "response": ["===Maajid Nawaz===", "Quilliam founder Maajid Nawaz was found to have been listed as a terrorist in World-Check following an investigation by Vice. Thomson Reuters subsequently removed his name from the list, apologised and paid an undisclosed amount in damages as part of the settlement following the threat of a lawsuit by Nawaz."]}, {"page": "Council of Ex-Muslims of Britain", "response": ["Several other prominent activists such as atheism advocate professor Richard Dawkins and Muslim reformist Maajid Nawaz sided with CEMB as well. 8 months later, Pride organisers met with CEMB and agreed to let them participate again in future Pride marches."]}, {"page": "Majid Nawaz", "response": ["#redirect Maajid Nawaz"]}, {"page": "Maajid Nawaaz", "response": ["#redirect Maajid Nawaz"]}, {"page": "Criticism of Islamism", "response": ["Among those authors and scholars who have criticized Islamism, or some element of it, include Maajid Nawaz, Reza Aslan,Aslan, Reza, No God but God: The Origins, Evolution, and Future of Islam, Random House, 2005.   Abdelwahab Meddeb,Meddeb, Abelwahab (2003). The Malady of Islam. Basic Books Muhammad Sa'id al-'Ashmawi,Fluehr-Lobban, Carolyn ed., Against Islamic Extremism: The Writings of Muhammad Sa'id al-Ashmawy, Gainesville: University Press of Florida, (1998)"]}, {"page": "Muslim supporters of Israel", "response": ["Ed Husain a former radical Islamist and author of The Islamist, a book about Islamic fundamentalism and an account of his five years as a radical Islamist activist. Husain also cofounded, with Maajid Nawaz, the counter-extremism organisation the Quilliam Foundation. He is currently senior fellow at the Council on Foreign Relations in New York City. Husain supports a two-state solution to end the Israel-Palestinian conflict. Husain has condemned suicide bombing of Israeli civilians as well as the \"killing of Palestinian civilians by the Hamas-led Gazan government\". He is opposed to the international boycott of Israel by activists, stating in The New York Times that:"]}, {"page": "Lent Talks", "response": ["The Lent Talks for 2010 began on 24 February with Will Self giving a talk on religion and the arts, and the spiritual sense that one can feel in church buildings. Maajid Nawaz, the director of the Quilliam Foundation, gave the Lent Talks on 10 March 2010. Alister McGrath presented the Lent Talks on 24 March 2010, on the relationship between religion and science - he mentioned Karl Popper, Peter Medawar and Sir Isaac Newton."]}]}}