{"wiki_id": "http://www.wikidata.org/entity/Q672533", "itemLabel": "Mike Kellie", "itemDescription": "English rock drummer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Kellie", "wikipedia_page": {"main": "Michael Alexander Kellie (24 March 1947 – 18 January 2017) was an English musician, composer and record producer.\nIn a career that spanned more than 50 years, Kellie was a member of the rock bands the V.I.P.s, Spooky Tooth and the Only Ones. He was also a prolific session musician and worked with the Who on the film soundtrack of Tommy, Joe Cocker, Traffic, George Harrison, Jerry Lee Lewis, Peter Frampton, the Bee Gees's Maurice Gibb, Gary Wright, Johnny Thunders, Luther Grosvenor, Neil Innes, Steve Gibbons, Chris Jagger, Nanette Workman, Sean Tyla, Jim Capaldi, Pat Travers and Andy Fraser.\nIn 2014, Kellie released his debut solo album Music from The Hidden, while still a member of the Only Ones. He died on 18 January 2017, following a short illness.", "link_mentions": [{"page": "1947", "response": ["** Mike Kellie, English rock musician (d. 2017)"]}, {"page": "1947 in music", "response": ["*March 24 – Mike Kellie, drummer (Spooky Tooth) (d. 2017)"]}, {"page": "List of drummers", "response": ["* Mike Kellie (Spooky Tooth, The Only Ones)"]}, {"page": "List of people from Birmingham", "response": ["*Mike Kellie – Musician, Spooky Tooth, The Only Ones"]}, {"page": "Spooky Tooth", "response": ["Prior to Spooky Tooth, four of the band's five founding members had performed in the band Art (formerly known as The V.I.P.'s). Following the dissolution of Art, the members of that band's final line-up (guitarist Luther Grosvenor, vocalist Mike Harrison, drummer Mike Kellie and bassist Greg Ridley) joined forces with American keyboardist/vocalist Gary Wright in October 1967 and formed Spooky Tooth. Wright was introduced to the members of Art by Chris Blackwell, founder of Island Records.", "For their next album, Witness (November 1973), original drummer Mike Kellie returned in place of Bryson Graham. Gary Wright remained the dominant songwriter at this stage of the band's history. But co-lead singer Harrison left following the album's release and Mike Patto was the new vocalist, alongside Wright, when they recorded The Mirror (October 1974), which also included new bass player Val Burke and Bryson Graham back on drums. But the album's failure led to Wright leaving once again for a solo career and the group disbanding in November 1974.", "In 2012, Mike Kellie started work on a solo album. Kellie died on 18 January 2017 at the age of 69 after a short illness, and Mike Harrison died on 25 March 2018 at the age of 72.", "*Mike Kellie - drums (1967–70, 1973–74, 1998–99, 2004, 2008–09; died 2017)", "* Mike Kellie – drums", "* Mike Kellie – drums", "* Mike Kellie – drums", "* Mike Kellie – drums", "* Mike Kellie – drums", "* Mike Kellie – drums", "* Mike Kellie – drums", "* Mike Kellie – drums"]}, {"page": "Naturally (Three Dog Night album)", "response": ["#\"I've Got Enough Heartache\" (Mike Kellie, Gary Wright) – 3:59"]}, {"page": "Luther Grosvenor", "response": ["In 1995, he recorded two tracks for Viceroy Music's tribute to Peter Green along with former Spooky Tooth drummer Mike Kellie. These songs led to Grosvenor signing a deal with the New York City based Brilliant Recording Company and produced the Floodgates album. It was released on 15 August 1996. The album again featured Mike Kellie on drums and featured Jess Roden singing vocals on two tracks, Grosvenor did the vocals on the rest of the album. The album was produced by Grosvenor and Mick Dolan."]}, {"page": "Gary Wright", "response": ["Blackwell invited Wright to London, where he joined English singer and pianist Mike Harrison and drummer Mike Kellie in their band Art (formerly the VIPs).The New Rolling Stone Encyclopedia of Rock & Roll, p. 938. The group soon changed its name to Spooky Tooth, with Wright as joint lead vocalist and Hammond organ player.Leng, pp. 90, 91. While noting the band's lack of significant commercial success over its career, The New Rolling Stone Encyclopedia of Rock & Roll describes Spooky Tooth as \"a bastion of Britain's hard-rock scene\".", "The band released a follow-up, Witness, in November 1973, by which point Graham had departed, with Mike Kellie returning on drums. By February 1974, Stewart and Harrison had also left. In January that year, Wright accompanied George Harrison to India,Wright, pp. 120–21, 123. where they journeyed to Varanasi (Benares), the Hindu spiritual capital of India, and home to Harrison's friend Ravi Shankar.Olivia Harrison, p. 258. The visit would influence the spiritual quality of Wright's lyrics when he returned to his solo career."]}, {"page": "Peter Perrett", "response": ["After the Only Ones performed in Japan in 2014 without their drummer Mike Kellie, a press release announced that Perrett would play a one-off solo date at the Trades Club in Hebden Bridge, West Yorkshire in January 2015. Perrett played the gig to good reviews with his two sons performing as the backing band."]}, {"page": "The Low Spark of High Heeled Boys", "response": ["The Low Spark of High Heeled Boys is the fifth studio album by English rock band Traffic, released in 1971. It was their first studio album to feature percussionist Rebop Kwaku Baah, and the only studio appearance of drummer Jim Gordon and bassist Ric Grech. Grech had previously worked with Traffic singer/multi-instrumentalist Steve Winwood in the short-lived supergroup Blind Faith while Gordon had played with another former Blind Faith member, Eric Clapton, in the similarly short-lived Derek and the Dominos. Drums on the track 'Rainmaker' are played by Only Ones drummer Mike Kellie.", "* Mike Kellie – drums (6)"]}, {"page": "The Only Ones (album)", "response": ["*Mike Kellie – drums"]}, {"page": "Remains (The Only Ones album)", "response": ["*Mike Kellie — drums"]}, {"page": "Chris Wood (rock musician)", "response": ["Born in Quinton,Stephanie Wood a suburb of Birmingham, Chris Wood had an interest in music and painting from early childhood. Self-taught on flute and saxophone, which he began playing at the age of 15, he began to play locally with other Birmingham musicians who would later find international fame in music: Christine Perfect (later Christine McVie), Carl Palmer, Stan Webb, and Mike Kellie. Wood played with Perfect in 1964 in the band Shades of Blue and with Kellie during 1965–1966 in the band Locomotive.Biography of Locomotive; www.brumbeat.net."]}, {"page": "Special View", "response": ["*Mike Kellie – drums"]}, {"page": "So Alone (album)", "response": ["*Mike Kellie – drums"]}, {"page": "Baby's Got a Gun", "response": ["*Mike Kellie – drums"]}, {"page": "Kellie", "response": ["*Mike Kellie (1947–2017), English drummer with Spooky Tooth and The Only Ones"]}, {"page": "With a Little Help from My Friends (Joe Cocker album)", "response": ["*Mike Kellie – drums (tracks 3, 6 & 10)"]}, {"page": "Jackie Lomax", "response": ["After leaving Apple, Lomax joined a band called Heavy Jelly. The band began as a hoax review in Time Out magazine. Guitarist John Morshead from The Aynsley Dunbar Retaliation and three ringers had posed for the \"group's\" photo in the magazine, so to cash in on the buzz Morshead and drummer Carlo Little released a single on promoter John Curd's Head Records (\"Chewn In\"/\"Time Out\", Head HDS4001, 1969). They were beaten to the punch however by the group Skip Bifferty who released their own single as Heavy Jelly, \"I Keep Singing That Same Old Song\" b/w \"Blue\", on Island Records. The A-side became fairly well known at the time from its inclusion on the Island sampler album, Nice Enough To Eat. Curd owned the rights to the name however, and stopped Island from releasing any other Heavy Jelly productions. Guitarist Morshead, along with his former Aynsley Dunbar mate bassist Alex Dmochowski, formed another version of Heavy Jelly with Jackie Lomax. Mike Kellie from Spooky Tooth drummed on some sessions but was later replaced by Barry Jenkins, formerly of The Animals. Also helping out were the tragic Badfinger duo of Pete Ham and Tom Evans on backing vocals and \"horn section to the stars\" Bobby Keys and Jim Price."]}, {"page": "Even Serpents Shine", "response": ["Reviewing the album for BBC Music, Chris Jones wrote, \"Musically the band were always a step ahead of the pack. Mike Kellie and Alan Mair – both seasoned pros on drums and bass – never falter, allowing John Perry's guitar to fly; while John 'Rabbit' Bundrick's organ adds just the right dollop of Al Kooper-isms.\"", "*Mike Kellie – drums"]}, {"page": "1947 in the United Kingdom", "response": ["** Mike Kellie, rock musician (died 2017)"]}, {"page": "Wind of Change (album)", "response": ["Peter Frampton decided to remain with Humble Pie's U.S. label A&M, and assembled an impressive supporting cast including Ringo Starr, Billy Preston, Spooky Tooth members Mick Jones and Mike Kellie, and former Herd member Andy Bown, for his first solo effort following his departure from Humble Pie in 1971.", "*Mike Kellie – drum, percussion"]}, {"page": "Frampton's Camel", "response": ["Frampton's original drummer Mike Kellie decided to leave the band because of differences with Frampton."]}, {"page": "The Big Sleep (album)", "response": ["*Mike Kellie - drums"]}, {"page": "The Only Ones", "response": ["The Only Ones were an English rock band formed in London in 1976, whose original band members are Peter Perrett, Alan Mair, John Perry and Mike Kellie, they first disbanded in 1982. They were associated with punk rock, yet straddled the musical territory in between punk, power pop and hard rock, with noticeable influences from psychedelia.", "The Only Ones were originally formed in August 1976 in South London by Peter Perrett. Perrett had been recording demos since 1972, and in late 1975 he was looking for a bass player. He was introduced to John Perry as a possible candidate, but Perry wanted to concentrate on playing guitar instead. By August 1976, Perry and Perrett had found drummer Mike Kellie (ex-Spooky Tooth) and bass guitarist Alan Mair, who previously had huge success with the Scottish band The Beatstalkers. Their first single, \"Lovers of Today\", self-released on the Vengeance record label, was immediately made \"record of the week\" by three of the four main music papers. A year later they signed to CBS. Their next single \"Another Girl, Another Planet\" became a popular and influential song, and remains the band's best-known song. It is often featured on various musical box-sets featuring a punk rock or new wave theme. After its inclusion on the 1991 compilation album The Sound of the Suburbs, it was re-released as a single and reached no. 57 in the UK singles chart.", "In late 2014, the Only Ones (minus Mike Kellie) played some gigs in Tokyo, co-headlining with the Flamin' Groovies. In August 2014, Perrett began playing solo shows (Felipop festival, Spain) using his sons' band Strangefruit, followed by more dates in 2015 (Hebden Bridge, Bristol, London etc.) with the same formation. The band ceased activity after the death of drummer Mike Kellie, but Perrett, Mair and Perry reunited to play a three-song set in summer 2019 "]}, {"page": "Alan Mair", "response": ["After a five-year spell in the fashion world Mair was drawn back to the music business. He joined the Al Matthews Band. who had a couple of hit records. When The Al Matthews band split, Mair answered an advert in Melody Maker and went for an audition with Roger Chapman’s band “Streetwalkers” at Mano’s Studios in Lots Road. During a break he wandered into the studio next door and found himself watching The Only Ones rehearse. On leaving the studio Mike Kellie enquired who Alan was and found out he was a bass player. Without hearing him play Kellie said he felt a spiritual connection and that he was the bass player they were looking for. He joined The Only Ones in August 1976. They signed to CBS and recorded 3 studio albums, of which their first album “The Only Ones and “Even Serpents Shine” received critical acclaim.  The Only Ones included lead vocalist Peter Perrett, guitarist John Perry and drummer and ex-Spooky Tooth member Mike Kellie. Their first single, \"Lovers of Today\", was self-released on the Vengeance record label, and a year later they signed to CBS. Their next single \"Another Girl, Another Planet\" became the band's best-known song. The band released The Only Ones in 1978, which was well received. The next year they released Even Serpents Shine, and a year later, they released their final studio album, Baby's Got a Gun. In the summer of 1980, they supported the Who on their tour of the United States. In 1982, the band officially disbanded. In subsequent years, The Only Ones gained a cult following, and compilation albums now outnumber their official studio albums."]}, {"page": "Supernatural Fairy Tales", "response": ["Except where noted, all songs written by Luther Grosvenor, Mike Harrison, Mike Kellie and Greg Ridley.", "*Mike Kellie – drums"]}, {"page": "The V.I.P.'s (band)", "response": ["The band members at various times were: Mike Harrison (lead vocals) (ex Dino and the Danubes, The Dakotas, The Ramrods); Greg Ridley (bass guitar) (ex Dino and the Danubes, The Dakotas); Frank Kenyon (rhythm guitar) (1963–67) (born 12 October 1945, Carlisle) (ex The Teenages, The Ramrods); Jimmy Henshaw (lead guitar) (1963–67) (born James Henshaw, 20 October 1941, in Newarthill, near Motherwell, North Lanarkshire, Scotland died 1 May 2007, Carlisle) (ex The Ramrods); Keith Emerson (organ) (ex-Gary Farr & The T-Bones) (1966–1967); Luther Grosvenor (lead guitar) (1967); Walter Johnstone (drummer) (1963–67) (born 11 March 1943, Carlisle) (ex The Teenages, The Ramrods); and Mike Kellie (drummer) (1967).", "They also participated in a psychedelic album entitled Featuring The Human Host And The Heavy Metal Kids by a collective known as Hapshash and the Coloured Coat, formed by Guy Stevens and an influential British graphic design and avant-garde musical partnership between Michael English and Nigel Waymouth. The musicians involved in that project were Mike Harrison on keys and vocals, Luther Grosvenor on guitars, Greg Ridley on bass and Mike Kellie on drums, as well as Stevens, English and Waymouth. It was the first time that the term 'heavy metal' was ever used in music, even though that album had nothing to do with heavy metal music, being closer to psychedelic music. The album was issued in 1967 by Liberty Records, and contained only five songs from two minutes to more than 15 minutes of psychedelic and almost meditative state kind of music."]}, {"page": "Mike Harrison (musician)", "response": ["Mike Harrison began his musical career with the Ramrods a band originating from Carlisle that was then Cumberland, the northern part of the now English county of Cumbria. This was to develop the foundations of a career that led to him being notable as the lead singer of Spooky Tooth, a band that he initially co-founded, with Mike Kellie, Luther Grosvenor and Greg Ridley and which Gary Wright then joined.  Harrison, Grosvenor, Ridley and Kellie had previously been in a Carlisle-based band called The V.I.P.'s, which also included Keith Emerson.  When Emerson left in early 1967 to co-found The Nice, the remaining band members changed the band's name to Art and released one album in late 1967 on Island Records.  Label owner Chris Blackwell took an interest in the band, encouraging them to work with Gary Wright and arranging for Jimmy Miller to be the band's producer.Jim Farber, What Happened to Spooky Tooth?.  Music Aficionado, 2017.  Retrieved 2017-12-08.  With the addition of Wright, the band became known as Spooky Tooth, releasing four albums between 1968 and 1970, before breaking up for the first time, and three more albums during their reformation and final breakup in the 1972-1974 period.  The band's sound was considered to be particularly unique in that it involved two keyboard players, Harrison and Wright, whose singing style often involved alternating vocals, similar to the Righteous Brothers or Hall and Oates.", "Harrison developed a renewed interest in music as of the 1990s, resulting in the recording of three songs with original members Mike Kellie, Luther Grosvenor and Greg Ridley in 1997.  Recording continued in 1998, resulting in the release of Cross Purpose in 1999, the first Spooky Tooth album in twenty-five years, following the 1974 release of The Mirror, in which Harrison had not participated.  He had left the band in 1973, following the release of Witness.  Cross Purpose was also the first Spooky Tooth album to feature four of the five original members since Spooky Two, released in 1969.", "Harrison's return to music during the 1997-1999 period was followed by a 2004 reunion and tour with original Spooky Tooth members Gary Wright and Mike Kellie, which resulted in the release of the concert DVD Nomad Poets in 2007.  In 2006, Harrison's fourth solo album, Late Starter, was released."]}]}}