{"wiki_id": "http://www.wikidata.org/entity/Q6735137", "itemLabel": "Mai Jones", "itemDescription": "British songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Mai_Jones", "wikipedia_page": {"main": "Mai Jones (6 February 1899 – 7 May 1960), was a Welsh songwriter, entertainer and radio producer.", "link_mentions": [{"page": "Live at Drury Lane", "response": ["# We'll Keep A Welcome (Mai Jones, Lyn Joshua & James Harper)"]}, {"page": "Merthyr Vale", "response": ["* Thomas Henry Morgan (1898-1957), who composed the music to \"We'll Keep a Welcome\" (given by Idloes Owen to Mai Jones who premiered it in 1940) was born in Merthyr Vale, 8 Station Terrace."]}, {"page": "List of The Goon Show cast members and characters", "response": ["Secombe also played various Welshmen (e.g. a lorry driver in Wings Over Dagenham,  and a navvy in The Scarlet Capsule ). Members of the newsgroup  alt.fan.goons refer to most of these characters as \"Secombe Bach.\" In the beginning of the episode The Thing on the Mountain, all three Goons (with Milligan as Adolphus Spriggs and one line as Singhiz Thingz) imitate Welshmen. In Wings Over Dagenham, Secombe's Welsh character is named \"Dai\". In The Mighty Wurlitzer, the first part of the story is set in Wales. Secombe (himself a Welshman in the role of Seagoon), Milligan (playing a cat) and Sellers (à la Mai Jones) end virtually every sentence with the Welsh word \"bach\" (which means 'small' – occasionally, a Welshman will refer to his 'butty bach', roughly translated 'my little friend'). Secombe dryly remarks after Milligan's lines, \"That's the first time I've heard a cat bark.\""]}, {"page": "1960 in Wales", "response": ["*7 May – Mai Jones, songwriter, 61"]}, {"page": "1951 in Wales", "response": ["*Mai Jones – \"Rhondda Rhapsody\" (theme from the radio programme, Welsh Rarebit)"]}, {"page": "1940 in Wales", "response": ["*Mai Jones & Lyn Joshua - \"We'll Keep a Welcome\" (performed for the first time in the forces' variety show, Welsh Rarebit on 29 February)"]}, {"page": "1927 in Wales", "response": ["*Mai Jones - \"Wondering if you remember\" (song)"]}, {"page": "1925 in Wales", "response": ["*Mai Jones - \"Blackbirds\""]}, {"page": "1960 in British music", "response": ["*7 May – Mai Jones, songwriter, 61"]}, {"page": "Radio in Wales", "response": ["By the late 1930s the BBC had increased its staff in Wales, and a pool of bilingual Welsh writers, broadcasters and producers were brought into the corporations to meet the demands of the new region. Seen as the best of Welsh-speaking intelligentsia, they included poet Alun Llewellyn Williams, producer Sam Jones and historian Geraint Dyfnallt Owen. Although the team were joined by those who were not fluent in the language, such as Mai Jones and Philip Burton, the preponderance of Welsh-speaking producers caused resentment among the non-Welsh-speaking staff.", "In 1939, after war was declared, the BBC was forced to transmit a unified service across the United Kingdom; due partly to release wavelengths for military use, partly from the fear of the enemy using wireless beams as a point of target, but mostly to create a unified centralization required during states of war. Despite this fact there was still some Welsh-language output, transmitted to all of the United Kingdom, including a daily news bulletin at 5pm. There were murmurs of disapproval in England to being forced to listen to Welsh broadcasts, but some productions made by the Welsh Region proved very popular, including Mai Jones' Welsh Rarebit. Another consequence of the war for Welsh radio was the relocation of much of the BBCs  department to the Bangor Studio, due to the risks of air raids on the cities of London and Bristol. This decision saw some of the biggest names in British entertainment arriving in north Wales, including Tommy Handley, Arthur Askey and Charlie Chester. The most successful show produced at Bangor during this period was Handley's It's That Man Again, which became the best-loved of all wartime programmes in Britain."]}, {"page": "List of people from Newport", "response": ["* Mai Jones (songwriter, entertainer and radio producer)"]}, {"page": "Gladys Morgan", "response": ["Morgan's big break came when she auditioned for the popular BBC radio variety show Welsh Rarebit. As the show was for Welsh performers only, producer Mai Jones was reluctant to cast her, as Morgan was well known for her Lancashire accent. A week performing at the Town Hall, Pontypridd using her natural accent was enough to convince Mai that Morgan was indeed Welsh, and she was given a two-minute spot on the show.Roy Hudd's Cavalcade of Variety Acts. p. 126 Robson Books, 1998,  Her great friend, comedian Wyn Calvin, is reported to have said, \"Her maniacal laugh created such a furore it practically filled the two minutes.\" Morgan became resident comedienne on the show, sharing top billing with a rising young star, Harry Secombe."]}, {"page": "Welsh Rarebit (radio programme)", "response": ["Billed as \"a programme of variety and topicalities\", it began life as a monthly 30-minute feature in the BBC's wartime Forces Programme, and was designed for the entertainment of armed forces personnel, in particular for those whose home was in Wales, but quickly became popular generally, and from June 1941 – when production was taken over by Mai Jones, who was also responsible for such other entertainment shows as Saturday Starlight – Welsh Rarebit also featured from time to time in the schedules of the BBC Home Service."]}, {"page": "Idloes Owen", "response": ["He later moved to Cardiff and became a composer, arranger and conductor, and performed with the pre-war Lyrian Singers in Cardiff. He was considered at this time to be one of the finest singing teachers in Wales; Geraint Evans was one of his pupils. Amongst his musical arrangements were \"Down Among The Dead Men\", based on an old English melody for a male chorus, \"The Lord's Prayer\", and a Welsh piece \"I Toriad Y Wawr\" (The Break Of Dawn). During the early part of the war in the 1940s he was instrumental in providing Mai Jones, who was working for the BBC in Cardiff with a musical score, composed initially by a friend and fellow Lyrian singer Thomas Morgan.  It was (the now famous Welsh Standard) \"We'll Keep a Welcome\". Later conducting the Lyrian singers in 1951 he achieved the Melody Maker song charts with the same song, narrated by Tom Jones."]}, {"page": "1960 in British radio", "response": ["* 7 May – Mai Jones, Welsh songwriter and radio producer (born 1899)"]}, {"page": "We'll Keep a Welcome (album)", "response": ["# \"We'll Keep a Welcome\" (Mai Jones, James Harper, Lyn Joshua) – 3:11"]}, {"page": "We'll Keep a Welcome", "response": ["#REDIRECTMai Jones"]}, {"page": "List of Welsh women", "response": ["*Mai Jones (1899–1960) songwriter, entertainer and radio producer"]}, {"page": "1925 in British music", "response": ["*Mai Jones – \"Blackbirds\""]}, {"page": "Music of Newport", "response": ["* Mai Jones"]}, {"page": "1940 in British radio", "response": ["* 29 February – Welsh Rarebit first broadcast by the BBC from its Cardiff studio; the resident 25-strong male voice choir, the Lyrian Singers, premieres the song \"We'll Keep a Welcome\" with lyrics by the programme's producer Mai Jones."]}, {"page": "We'll Keep a Welcome (song)", "response": ["#REDIRECT Mai Jones"]}]}}