{"wiki_id": "http://www.wikidata.org/entity/Q6735113", "itemLabel": "Mai Davies", "itemDescription": "British journalist and television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Mai_Davies", "wikipedia_page": {"main": "Mai Davies (born 1964) is a Welsh journalist and television presenter.\nBorn in Carmarthen, South Wales, she started her career at HTV Wales in Cardiff as a reporter and presenter on Wales at 6. She then moved within the regional ITV network to TVS where she became one of the main presenters of its nightly news programme, Coast to Coast, often alongside Fred Dinenage. From the start of 1993, Meridian Television took over the ITV franchise for southern England, and she transferred to the new company, becoming the main anchor for its new news programme from Newbury, serving the northern part of the region. During this time, the programme won the Royal Television Society award for the best Regional News Magazine programme.After becoming freelance, she presented across a series of channels, including ITV Wales's political programme Waterfront until the end of 2009, but also including Channel 5, BBC Radio 4, BBC 5 Live, and the BBC World Service. In 2009 Davies, widely regarded as \"ITV’s face of Welsh politics\", was replaced as the host of Wales This Week by Jonathan Hill. She then moved to become a daytime anchor at Sky News.\nShe is currently a regular presenter of the BBC Radio Wales daily news magazine programmes Good Morning Wales and Good Evening Wales.", "link_mentions": [{"page": "Fred Dinenage", "response": ["Dinenage transferred from Southern to TVS in January 1982, chiefly as a sports presenter and reporter, working on Coast to Coast, Sportshow and The Saturday Match. The following year, he took over from Khalid Aziz as the main anchor for the South edition of Coast to Coast, co-presenting alongside Christopher Peacock, Fern Britton, Debbie Thrower and Mai Davies."]}, {"page": "Coast to Coast (British TV series)", "response": ["Other presenters for the South edition included newsreaders James Montgomery, John Doyle, Debbie Thrower, Jane Wyatt, Keith Akehurst, Mai Davies and Debbie Middleton, sports presenters David Bobin & Gareth Evans and weather presenters Anne Purvis and Carl Tyler.", "The final editions of the programme were aired as an hour-long special on 31 December 1992. In the South, Fred Dinenage and Mai Davies presented a regular edition featuring the last part of a feature series looking back at the past eleven years of news coverage provided by TVS. Meanwhile, in the South East, Mike Debens and Liz Wickham presented a more retrospective programme featuring an invited studio audience.", "| <Center>December 1992</center> || Mai Davies"]}]}}