{"wiki_id": "http://www.wikidata.org/entity/Q6742645", "itemLabel": "Malcolm St Clair", "itemDescription": "landowner and Conservative politician (1927-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Malcolm_St_Clair_(politician)", "wikipedia_page": {"main": "Malcolm Archibald James St Clair (pronounced \"Sinclair\"; 16 February 1927 – 1 February 2004) was a British Conservative Party politician and Army officer.", "link_mentions": [{"page": "Tony Benn", "response": ["In November 1960, Lord Stansgate died. Benn automatically became a peer, preventing him from sitting in the House of Commons. The Speaker of the Commons, Sir Harry Hylton-Foster, did not allow him to deliver a speech from the bar of the House of Commons in April 1961 when the by-election was being called.Tony Benn and Peter Kellner \"Tony Benn's Finest Speech\" , The Huffington Post, 14 March 2014. Continuing to maintain his right to abandon his peerage, Benn fought to retain his seat in a by-election caused by his succession on 4 May 1961. Although he was disqualified from taking his seat, he was re-elected. An election court found that the voters were fully aware that Benn was disqualified, and declared the seat won by the Conservative runner-up, Malcolm St Clair, who was at the time also the heir presumptive to a peerage.Re Parliamentary Election for Bristol South East [1964] 2 Q.B. 257, [1961] 3 W.L.R. 577."]}, {"page": "List of United Kingdom by-elections (1950–1979)", "response": ["|20 August 1963Tony Benn won the most votes but was disqualified by virtue of his Peerage; the Election Court declared Malcolm St Clair duly elected. St Clair undertook that if the law was changed to allow Benn to disclaim his hereditary peerage, he would resign and create a by-election. The law was changed by the Peerage Act 1963 and St Clair duly resigned, allowing Benn to return to the Commons in 1963.", "|Malcolm St Clair", "|Malcolm St Clair"]}, {"page": "Bristol South East (UK Parliament constituency)", "response": ["|| 1961(on petition) || Malcolm St Clair || Conservative"]}, {"page": "Malcolm Archibald James St. Clair", "response": ["#REDIRECT Malcolm St Clair (politician)"]}, {"page": "Malcolm Archibald James St Clair", "response": ["#REDIRECT Malcolm St Clair (politician)"]}, {"page": "Malcolm St. Clair", "response": ["*Malcolm St Clair (politician) (1927–2004), British farmer and Conservative Member of Parliament 1961–1963"]}, {"page": "Malcolm St.Clair (UK politician)", "response": ["#REDIRECT Malcolm St Clair (politician)"]}, {"page": "1961 Bristol South East by-election", "response": ["Benn stood in the by-election anyway, but due to his ineligibility, the Conservative Party candidate Malcolm St Clair was declared the winner."]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Malcolm St Clair; MP for Bristol South East (1961–1963)"]}, {"page": "Malcolm St. Clair (UK politician)", "response": ["#REDIRECT Malcolm St Clair (politician)"]}, {"page": "Chesham Place", "response": ["* 28 Chesham Place, former home of the Conservative MP Malcolm St Clair."]}, {"page": "Re Bristol South-East Parliamentary Election", "response": ["Re Bristol South-East Parliamentary Election ([1961] 3 All ER 354) is a 1961 United Kingdom election court case brought about by an election petition by Malcolm St Clair against Tony Benn, the winner of the 1961 Bristol South-East by-election where Benn had won the most votes but was disqualified from taking his seat in the House of Commons as he had inherited a hereditary peerage as 2nd Viscount Stansgate. Benn argued that as he had not applied for a writ of summons, he was not a member of the House of Lords and that the voters had the right to choose who they wanted to represent them.", "The court made a ruling of undue election because the voters were aware that Benn was legally disqualified from sitting in the House of Commons, their votes had to be counted as being \"thrown away\" and Malcolm St Clair as the runner-up would take the seat instead.", "Anthony Wedgwood Benn had been elected as the MP for Bristol South East since 1950 as a Labour Party candidate. During that time he was heir to the Viscount Stansgate title held by his father William Wedgwood Benn, 1st Viscount Stansgate, which Benn tried several times to renounce his right to. When his father died in 1961, Benn called the Speaker of the House of Commons to inform him of this. The Speaker told Benn that because he was now legally a peer, he was disqualified from sitting and speaking in the House of Commons. A by-election was called and Benn decided to fight it anyway. The Conservative Party candidate, Malcolm St Clair, ran several adverts in local papers telling voters that there was no point in voting for Benn as he was disqualified from sitting in the House of Commons as he was a hereditary peer. Despite this, Benn won the election and went to the door of the House of Commons to take his oath of allegiance. However the doorkeeper of the House had been told by the Speaker to not allow Benn access, specifically authorising the use of force to prevent him entering, because he was not legally allowed in the Commons as a hereditary peer."]}, {"page": "List of United Kingdom MPs who died in the 2000s", "response": ["|Malcolm St Clair"]}]}}