{"wiki_id": "http://www.wikidata.org/entity/Q6742537", "itemLabel": "Malcolm Ogilvie", "itemDescription": "British ornithologist and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Malcolm_Ogilvie", "wikipedia_page": {"main": "Dr Malcolm Alexander Ogilvie is a British ornithologist and freelance natural history author and consultant. One of his areas of expertise is wildfowl.\nOgilvie was a research scientist with the Wildfowl and Wetlands Trust from 1960 to 1986, also editing their journal, Wildfowl, from 1966  to 1986. Until 1997 he was a member of the British Birds editorial board and a member of the editorial board of the handbook The Birds of the Western Palearctic.  He has been a fully qualified bird ringer since 1958. He is a past regional representative for the British Trust for Ornithology, and is the vice-county plant recorder for South Ebudes for the Botanical Society of Britain and Ireland.\nOgilvie has been resident on the island of Islay since 1986.  He is married to Carol and has two daughters, Isla and Heather.\n\n", "link_mentions": [{"page": "Wildfowl & Wetlands Trust", "response": ["* Malcolm Ogilvie"]}, {"page": "M. A. Ogilvie", "response": ["#redirectMalcolm Ogilvie"]}, {"page": "Philip Hollom", "response": ["In March 1951 he became a member of the editorial board of British Birds magazine under the senior editorship of Max Nicholson, whom he succeeded in 1960. Nicholson, who had remained on the editorial board, and Hollom stood down in 1972 and were replaced on the board by Ian Wallace and Malcolm Ogilvie.A history of British Birds, Malcolm Ogilvie, James Ferguson-Lees and Richard Chandler, British Birds 100 (2007) 3-15"]}, {"page": "Rare Breeding Birds Panel", "response": ["* Malcolm Ogilvie (Secretary, 1993–2006)"]}, {"page": "Chris Rose (artist)", "response": ["Rose has illustrated several books about birds and other wildlife, including Robins and Chats (2015 by Rose and Clement) - an identification guide covering the 175 species of this family, A Handbook to the Swallows and Martins of the World (1989 by Angela Turner), Grebes of the World (2002 by Malcolm Ogilvie), and In a Natural Light, a book of his paintings with personal commentary on his own work (2005 by Rose). In addition he was among the illustrators of the Handbook of the Birds of the World, including volume 4, volume 6 to volume 12, volume 14, volume 16 and the special volume New Species and Global Index."]}, {"page": "Ogilvie (name)", "response": ["* Malcolm Ogilvie, British ornithologist"]}]}}