{"wiki_id": "http://www.wikidata.org/entity/Q674031", "itemLabel": "Arthur Cruttenden Mace", "itemDescription": "British Egyptologist (1874-1928)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Cruttenden_Mace", "wikipedia_page": {"main": "Arthur Cruttenden Mace (17 July 1874 – 6 April 1928) was a Tasmanian-born English archaeologist and Egyptologist. He is best known for his work for the New York Metropolitan Museum, and as a part of Howard Carter's team during the excavation of Tutankhamun's tomb. \n\n", "link_mentions": [{"page": "Flinders Petrie", "response": ["From 1889-99 Petrie directed a team excavating over 17 cemeteries containing numerous graves between Hu and Abadiya, Egypt. The dig team included Beatrice Orme, David Randall-MacIver, Arthur Cruttenden Mace, Henrietta Lawes and Hilda Petrie. Predynastic, Old Kingdom, Middle Kingdom and Roman graves were excavated and published at 'Diospolis Parva'."]}, {"page": "List of Egyptologists", "response": ["*Arthur Cruttenden Mace (British, 1874–1928)"]}, {"page": "Book of Abraham", "response": ["Since its publication in 1842, the Book of Abraham has been a source of controversy. Non-Mormon Egyptologists, beginning in the late 19th century, have disagreed with Joseph Smith's explanations of the facsimiles. They have also asserted that damaged portions of the papyri have been reconstructed incorrectly. In 1912, a letter about the Book of Abraham was published by Arthur Cruttenden Mace, Assistant Curator in the Department of Egyptian Art in New York's Metropolitan Museum of Art. He wrote:"]}, {"page": "Robin Orr", "response": ["He returned to Cambridge in 1965 as Professor of Music, a post he held until his retirement in 1976 (later Emeritus).Kemp, Ian. 'Robin Orr at 90', in The Musical Times, Spring 1990, pp. 11-17 He was made a CBE in 1972.Obituary, Daily Telegraph, 15 May 2006 Robin Orr married Margaret Mace, the daughter of Egyptologist Arthur Cruttenden Mace, in December 1937. They had three children. In 1979 they divorced and Orr married again, to Doris Winny-Meyer.McLeod, John. 'Orr, Robert Kemsley [Robin'] in The Oxford Dictionary of National Biography An \"entertaining if somewhat personally reticent\" autobiography, Musical Chairs, was published in 1999.Obituary, The Times, 17 April 2006WorldCat "]}, {"page": "Mace (surname)", "response": ["* Arthur Cruttenden Mace (1874–1928), British Egyptologist"]}, {"page": "Index of ancient Egypt–related articles", "response": ["* Arthur Cruttenden Mace"]}, {"page": "Abadiyeh, Egypt", "response": ["Abadiyeh is a place in Egypt situated about a dozen miles west of Dendera.from page 1 of Diospolis Parva: The Cemeteries of Abadiyeh and Hu, 1898-9 by William Matthew Flinders Petrie, Arthur Cruttenden Mace(1901) retrieved approx 17:30 30.9.11", "W. M. Flinders Petrie was assisted with excavations by David Randall-MacIver and Arthur Cruttenden Mace, these having been done on the behalf of the Egyptian Exploration Fund (EEF). The excavations, considered in totality, consisted of sites  along the west bank of the Nile in the Hiw region, found to contain artifacts of a Predynastic type.article HIW (PREDYNASTIC) written by Thomas Hikade-UCLA Encyclopedia of Egyptology Department of Near Eastern Languages and Cultures, UC Los Angeles(with 18 referenced sources)(12-23-2010 retrieved 21:35GMT 30.9.11)UC Los Angeles Prehistoric cemeteries were found at Abadiyas and Hu (Diospolis Parva). from page 2 of Diospolis Parva: The Cemeteries of Abadiyeh and Hu, 1898-9 by William Matthew Flinders Petrie, Arthur Cruttenden Mace(1901) retrieved approx 17:42 30.9.11 Museum of Classical Archaeology, Memorial Tower Building , University of Natal (Durban)  retrieved approx' 17;49 30.9.11"]}, {"page": "Arthur Mace", "response": ["#REDIRECT Arthur Cruttenden Mace"]}, {"page": "A. C. Mace", "response": ["#REDIRECT Arthur Cruttenden Mace"]}, {"page": "Cruttenden", "response": ["* Arthur Cruttenden Mace (1874–1928), English Egyptologist"]}]}}