{"wiki_id": "http://www.wikidata.org/entity/Q6742294", "itemLabel": "Malcolm Eden", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Malcolm_Eden", "wikipedia_page": {"main": "Malcolm Eden (born 1 September 1963, Ilford, Essex, England) was the vocalist and guitarist in the indie pop group McCarthy between 1985 and 1990. Eden wrote the far left leaning lyrics of the band.Eden cited the election of Margaret Thatcher as Prime Minister in 1979, and his dislike of her, as the key event in starting his interest in Marxism. Eden explained the approach to songwriting in McCarthy: \"Gary did the drums, although Tim and I used to give him suggestions. I put the lyrics on last. Some of the songs I wrote on my own, like ‘Frans Hals’\", also saying, \"almost all of the McCarthy songs are sung by a 'character', like a character in a play. I often don’t agree with the sentiments expressed in the song, quite the reverse\".He later formed the short-lived Herzfeld, who released an EP and a 10-inch album on the Duophonic label. In 2005, he contributed vocals to two tracks, \"Where You Are\", and \"True Light\", to That Summer's Clear album.", "link_mentions": [{"page": "I Am a Wallet", "response": ["*Malcolm Eden – Voice and guitar"]}, {"page": "Barking Abbey School", "response": ["* Malcolm Eden, member of indie pop band McCarthy"]}, {"page": "McCarthy (band)", "response": ["McCarthy were a British indie pop band, formed in Barking, Greater London, England in 1984 by schoolmates Malcolm Eden (voice and guitar) and Tim Gane (lead guitar) with John Williamson (bass guitar) and Gary Baker (drums). Lætitia Sadier later joined the band on vocals for their final studio album.Sutton, Michael, [ \"McCarthy Biography\"], Allmusic, retrieved 27 March 2008", "Malcolm Eden, Tim Gane and John Williamson met at Barking Abbey Comprehensive School. Gane was originally a drummer, but was initially taught to play guitar by Eden, who also taught Williamson to play bass. Eden and Gane were fans of punk groups such as the Sex Pistols, The Clash, and Buzzcocks, and they covered their songs in small gigs as teenagers. Baker joined in 1984, and with the new line-up deciding on the name McCarthy (a reference to American politician Joe McCarthy), they released a self-financed first single, \"In Purgatory\" in 1985. The band were signed by the Pink Label, releasing two further singles \"Red Sleeping Beauty\" and \"Frans Hals\". The band had a track included on the NME C86 album (\"Celestial City\")."]}, {"page": "The Enraged Will Inherit the Earth", "response": ["*Malcolm Eden – Voice and Guitar"]}, {"page": "Banking, Violence and the Inner Life Today", "response": ["*Malcolm Eden – Voice and Guitar"]}, {"page": "Red Sleeping Beauty", "response": ["Category:Songs written by Malcolm Eden"]}, {"page": "Frans Hals (song)", "response": ["Category:Songs written by Malcolm Eden"]}, {"page": "Should the Bible Be Banned", "response": ["Category:Songs written by Malcolm Eden"]}, {"page": "Herzfeld (band)", "response": ["#REDIRECT Malcolm Eden"]}]}}