{"wiki_id": "http://www.wikidata.org/entity/Q6742242", "itemLabel": "Malcolm Cecil", "itemDescription": "English musician and record producer (1937-2021)", "wikipedia_url": "https://en.wikipedia.org/wiki/Malcolm_Cecil", "wikipedia_page": {"main": "Malcolm Cecil (9 January 1937 – 28 March 2021) was a British jazz bassist, record producer, engineer and electronic musician. He was a founding member of a leading UK jazz quintet of the late 1950s, the Jazz Couriers, before going on to join a number of British jazz combos led by Dick Morrissey, Tony Crombie and Ronnie Scott in the late 1950s and early 1960s.  He later joined Cyril Davies and Alexis Korner to form the original line-up of Blues Incorporated.  Cecil subsequently collaborated with Robert Margouleff to form the duo TONTO's Expanding Head Band, a project based on a unique combination of synthesizers which led to them collaborating on and co-producing several of Stevie Wonder's Grammy-winning albums of the early 1970s. The TONTO synthesizer was described by Rolling Stone as \"revolutionary\".", "link_mentions": [{"page": "Stevie Wonder", "response": ["During this period, he independently recorded two albums and signed a new contract with Motown Records. The 120-page contract was a precedent at Motown and gave Wonder a much higher royalty rate. He returned to Motown in March 1972 with Music of My Mind. Unlike most previous albums on Motown, which usually consisted of a collection of singles, B-sides and covers, Music of My Mind was a full-length artistic statement with songs flowing together thematically. Wonder's lyrics dealt with social, political, and mystical themes as well as standard romantic ones, while musically he began exploring overdubbing and recording most of the instrumental parts himself. Music of My Mind marked the beginning of a long collaboration with Tonto's Expanding Head Band (Robert Margouleff and Malcolm Cecil), and with lyricist Yvonne Wright."]}, {"page": "Pete Townshend", "response": ["Although he grew up in a household with jazz musicians, Townshend absorbed many of his ideas about performance and rock music themes during art school. Townshend's roommate at Ealing Art College, Tom Wright, had a large record collection, and Townshend listened to and became influenced by R&B and rock & roll artists like Howlin' Wolf, John Lee Hooker, Bo Diddley, Booker T. & the MGs, Little Walter, and Chuck Berry. He was also strongly influenced by cellist Malcolm Cecil, who often damaged his cello during performances, along with Gustav Metzger, pioneer of auto-destructive art. In light of these influences, guitar smashing became not just an expression of youthful angst, but also a means of conveying ideas through musical performance. \"We advanced a new concept\", he writes. \"Destruction is art when set to music.\""]}, {"page": "Gil Scott-Heron", "response": ["A live album, It's Your World, followed in 1976 and a recording of spoken poetry, The Mind of Gil Scott-Heron, was released in 1978. Another success followed with the hit single \"Angel Dust\", which he recorded as a single with producer Malcolm Cecil. \"Angel Dust\" peaked at No. 15 on the R&B charts in 1978."]}, {"page": "16th Annual Grammy Awards", "response": ["**Malcolm Cecil & Robert Margouleff (engineers) for Innervisions performed by Stevie Wonder "]}, {"page": "List of jazz bassists", "response": ["*Malcolm Cecil (1937–2021)"]}, {"page": "Grammy Award for Best Engineered Album, Non-Classical", "response": ["| Malcolm Cecil & Robert Margouleff, engineers"]}, {"page": "Talking Book", "response": ["Released after Wonder toured with The Rolling Stones in 1972, Talking Book became a major hit, peaking at number three on the Pop Albums chart in February 1973, and became the first album by Wonder to top the Top R&B Albums chart, where it remained for three weeks. The popular appeal of the recording helped destroy the myth that R&B artists were incapable of creating music that could be appreciated by rock audiences, and marked a unique period for R&B artists (especially Motown artists). Wonder won three awards for Talking Book at the 1974 Grammys: Best Male Pop Vocal Performance for \"You Are the Sunshine of My Life\", and both Best Male R&B Vocal Performance and Best R&B Song for \"Superstition\". Incidentally, at the same ceremony, Wonder's next album, Innervisions, won Album of the Year and Talking Books associate producershttps://cdn.discogs.com/ofvTaRQttmX09WDhkEkGfAbLmi4=/fit-in/600x600/filters:strip_icc%28%29:format%28jpeg%29:mode_rgb%28%29:quality%2896%29/discogs-images/R-174477-1261227531.jpeg.jpg Malcolm Cecil and Robert Margouleff won the Best Engineered Album, Non-Classical award for their work on that album.", "* Malcolm Cecil – programming, engineer, Associate producer ", "Category:Albums produced by Malcolm Cecil"]}, {"page": "In the Pocket (James Taylor album)", "response": ["* Malcolm Cecil – Moog synthesizer programming"]}, {"page": "Innervisions", "response": ["Innervisions is the sixteenth studio album by American singer, songwriter and musician Stevie Wonder, released August 3, 1973, on the Tamla label for Motown Records, a landmark recording of his \"classic period\".Some observers count six classic albums, some count five, and others count four. It is also regarded as Wonder's transition from Little Stevie Wonder and romantic ballads to a more musically mature, conscious and grown-up artist. With Wonder being the first major artist to experiment with the revolutionary TONTO (The Original New Timbral Orchestra) synth, developed by Malcolm Cecil and Robert Margouleff, and the ARP synthesizer on a large scale, Innervisions became hugely influential on the subsequent future of commercial soul and black music.", "*T.O.N.T.O. Synthesizer inventors and programmers – Robert Margouleff, Malcolm Cecil", "Category:Albums produced by Malcolm Cecil"]}, {"page": "The Captain and Me", "response": ["Synthesizers and strings were brought in to record The Captain and Me. Synth programmers Malcolm Cecil and Robert Margouleff were brought in to engineer the opening track, \"Natural Thing\". Striving for a synthesized sound like that of The Beatles' \"Being for the Benefit of Mr. Kite!\", they would overdub individual notes to create chords for the song's bridge.", "* Malcolm Cecil, Robert Margouleff – ARP synthesizer programming on \"Natural Thing\", \"Clear as the Driven Snow\", \"South City Midnight Lady\" and \"Ukiah\""]}, {"page": "Ronnie Scott", "response": [":Ronnie Scott (tenor sax), Stan Tracey (piano), Malcolm Cecil (double bass), Jackie Dougan (drums)"]}, {"page": "Diamonds & Rust", "response": ["*Malcolm Cecil – Synthesisers"]}, {"page": "Electronic Sound", "response": ["Hartford Courant music critic Roger Catlin has said that the album's appeal is limited to aficionados of \"early synthesizer experiments\". Malcolm Cecil, who went on to become a leading synthesizer proponent as the co-creator of TONTO, recalls that when he first encountered a Moog 3P, his immediate thought was: \"Geez, this is the [instrument] that George Harrison made that record on. I'm looking at it, and I saw it has filters, envelope generator – what the hell is all this stuff?\" Tom Rowlands of the Chemical Brothers has cited Electronic Sound as an influence. In his introduction to the 2014 CD booklet, he recalls discovering a rare copy of the LP in a Tokyo record shop in the 1990s and says that the sleeve \"now hangs on the wall of my studio, just next to my own Moog modular, beaming inspiration straight to my brain\"."]}, {"page": "Dixie Chicken (album)", "response": ["*Malcolm Cecil – synthesizer"]}, {"page": "Music of My Mind", "response": ["Music of My Mind is the fourteenth studio album by American soul musician Stevie Wonder. It was released on March 3, 1972, by Tamla Records, and was Wonder's first to be recorded under his new contract with Motown which allowed him full artistic control. For the album, Wonder recruited electronic music pioneers Malcolm Cecil and Robert Margouleff as co-producers, employing their custom TONTO synthesizer on several tracks. It was a modest commercial success, but critics found the record representative of Wonder's artistic growth, and is generally considered by contemporary critics to be the first album of his classic period.", "Wonder played all of the instruments on this album except trombone by Art Baron and guitar by Howard \"Buzz\" Feiten. This is the first of a set of collaborations between Wonder and his co-producers Robert Margouleff and Malcolm Cecil; they would work with Wonder on three further albums.", "*Malcolm Cecil – Moog programming, associate producer, engineering", "Category:Albums produced by Malcolm Cecil"]}, {"page": "...That's the Way It Is", "response": ["* Malcolm Cecil – synthesizer"]}, {"page": "Good Old Boys (Randy Newman album)", "response": ["All tracks were written and arranged by Randy Newman (with the exception of Every Man a King); strings arranged by Nick DeCaro on \"Marie\" and \"Rollin'\"; Moog and ARP synthesizers programmed by Malcolm Cecil and Robert Margouleff.", "*Malcolm Cecil, Robert Margouleff - ARP, synthesizer, programming"]}, {"page": "T-Neck Records", "response": ["The Isleys released their first T-Neck/CBS release with the 3+3 album in 1973. The album boasted the hit singles \"That Lady\", \"What It Comes Down To\" and \"Summer Breeze\", the latter song becoming a top ten hit in the UK, their first top ten hit over there since their Motown releases including \"This Old Heart\" had reached the top ten. 3+3 was the group's first album to be certified platinum and was recorded with the same associate producers that had helped to make Stevie Wonder's recordings during this time become a success - Robert Margouleff and Malcolm Cecil. The brothers' 1974 album, Live It Up, went gold on the basis of the dance singles such as the title track and \"Midnight Sky\" while their ballad version of Todd Rundgren's \"Hello It's Me\" became an instant Isley Brothers favorite."]}, {"page": "Gulf Winds", "response": ["*Malcolm Cecil – synthesizer"]}, {"page": "Tonto's Expanding Head Band", "response": ["Tonto's Expanding Head Band was a British-American electronic music duo consisting of Malcolm Cecil and Robert Margouleff.  Despite releasing only two albums in the early 1970s, the duo were (and still remain) influential because of their session and production work for other musicians (most notably Stevie Wonder) and extensive commercial advertising work.", "TONTO is an acronym for \"The Original New Timbral Orchestra\", the first, and still the largest, multitimbral polyphonic analog synthesizer in the world, designed and constructed over several years by Malcolm Cecil.  TONTO started as a Moog modular synthesizer Series III owned by record producer Robert Margouleff.  Later a second Moog III was added, then four Oberheim SEMs, two ARP 2600s, modules from Serge with Moog-like panels, EMS, Roland, Yamaha, etc. plus several custom modules designed by Serge Tcherepnin and Cecil himself - who has an electrical engineering background. Later, digital sound-generation circuitry and a collection of sequencers were added, along with MIDI control. All of these are housed in a semi-circle of curving wooden cabinets,  in diameter and  tall.", "TONTO was owned by Malcolm Cecil since he acquired Robert Margouleff's share in 1975. In the mid-1990s TONTO was moved to Mutato Muzika studios, the headquarters of Mark Mothersbaugh and Devo, leading to widespread rumors that Mothersbaugh had purchased TONTO but this was not true.  TONTO eventually made its way back to Cecil's home in Saugerties, New York. In late 2013 TONTO was purchased by the National Music Centre in Calgary, Alberta.  The NMC had long desired to acquire TONTO and upon moving it to Calgary, placed it on exhibit. In late 2017, John Leimseider completed a multi-year restoration on TONTO, replacing worn out jacks and repairing broken connections. TONTO is now playable, and is a part of the living collection of the National Music Centre. Synth artists can once again record with TONTO in NMC's recording studios. ", "Malcolm Cecil and his son, Milton aka DJ Moonpup, performed at the Big Chill Festival on 5 August 2006, a three-day event held at Eastnor Castle in  Herefordshire in the UK. Due to TONTO being too large and expensive to ship for a one-hour performance, Cecil created a \"Virtual TONTO\" and played live over pre-recorded backing tracks and Malcolm playing an Arp 2600 live with Moonpup adding some DJ loops and samples. It was  accompanied by a specially prepared visual show by Liz Searle with hundreds of pictures of TONTO and Poli Cecil's art pieces.", "*2006: Tonto's Expanding Head Band (Malcolm Cecil, limited edition CD) (remastered CD of Tonto Rides Again, with a bonus track)''", "(see also Robert Margouleff Discography Malcolm Cecil Discography)"]}, {"page": "Fulfillingness' First Finale", "response": ["*Robert Margouleff and Malcolm Cecil – synthesizers", "Category:Albums produced by Malcolm Cecil"]}, {"page": "3 + 3", "response": ["The Isley Brothers recorded 3 + 3 in the Record Plant at the same time as Stevie Wonder was recording Innervisions (1973). In fact, they walked in on him recording \"Don't You Worry 'bout a Thing\". Both Chris Jasper of the Isley Brothers and Stevie Wonder were users of the ARP synthesizer and both worked with visionary engineers Robert Margouleff and Malcolm Cecil.", "*Malcolm Cecil, Robert Margouleff – recording engineers"]}, {"page": "It's My Pleasure", "response": ["*Malcolm Cecil, Robert Margouleff (TONTO: The Original New Timbral Orchestra) – synthesizers", "Category:Albums produced by Malcolm Cecil"]}, {"page": "Billy Preston (album)", "response": ["*Malcolm Cecil - synthesizer programming "]}, {"page": "Manassas (album)", "response": ["*Malcolm Cecil  - Expanded Series III Moog Synthesizer programming"]}, {"page": "Jungle Fever (soundtrack)", "response": ["* Malcolm Cecil — additional engineering and additional programming"]}, {"page": "Dick Morrissey", "response": [" he appeared regularly at the Marquee Club from August 1960, and recorded his first solo album at the age of 21, It’s Morrissey, Man! (1961) for Fontana, featuring Stan Jones on piano, Colin Barnes on drums, and The Jazz Couriers founding member Malcolm Cecil on bass. He spent most of 1962 in Calcutta, India as part of the Ashley Kozak Quartet, playing three two-hour sessions seven days a week, before returning to the UK and forming his quartet with Harry South – who had also been in the quartet in Calcutta – on piano. They were joined by former The Jazz Couriers bassist Phil Bates and variously, another ex-The Jazz Couriers member, Bill Eyden, Jackie Dougan or Phil Seamen on drums. The Dick Morrissey Quartet recorded three LPs, Have You Heard? (1963); the live recording Storm Warning! (1965) on Mercury; and Here and Now and Sounding Good! (1966). The quartet, played regular London gigs at The Bull's Head, Barnes and at Ronnie Scott's, whose manager, Pete King, once said that Ronnie's was kept going in those days due to the crowds Dick Morrissey pulled in. During this time he also played extensively in bands led by Ian Hamer and Harry South, including The Six Sounds, featuring Ken Wray and Dick Morrissey, a band which by 1966 had developed into the Ian Hamer Sextet featuring South, Dick Morrissey, Keith Christie, Kenny Napper and Bill Eyden, among other leading UK-based jazz musicians."]}, {"page": "Clang of the Yankee Reaper", "response": ["*Malcolm Cecil - synthesizer"]}, {"page": "Live It Up (Isley Brothers album)", "response": ["Like their previous recording, their breakthrough 1973 album, 3 + 3, the album was assisted by the team of Malcolm Cecil and Robert Margouleff. The album also continued their growing trademark of funky dance songs mixed with softer soul ballads, which set the precedent for their landmark 1975 release, The Heat Is On."]}, {"page": "The Heat Is On (album)", "response": ["Recording sessions for the album took place in 1975 at Kendun Recorders in Burbank, California.Track listing and credits as per liner notes for The Heat Is On CD reissue It was mixed at Westlake Audio in Los Angeles, California and mastered by engineer Kent Duncan. The album was entirely written and produced by the Isley Brothers. The group utilised many acoustic and electric instruments during its recording, including guitar, piano, and the ARP synthesizer, which was programmed by engineers Malcolm Cecil and Robert Margouleff. The Heat Is On is the fourth album recorded by the Isley Brothers with keyboardist Chris Jasper, bassist Marvin Isley, and guitarist Ernie Isley.", "* Malcolm Cecil – associate producer, engineering, electronic music programming"]}, {"page": "Harvest for the World", "response": ["*Malcolm Cecil - recording engineer (1-8), producer, music programming "]}, {"page": "Go for Your Guns", "response": ["After four records that were assisted by producers Malcolm Cecil and Robert Margouleff, the Isley Brothers decided to stay in the East Coast choosing to record at upstate New York's Bearsville Studios, not too far from the brothers' T-Neck label in neighboring New Jersey. The album was engineered by John Holbrook assisted by Tom Mark. It was mixed at Mediasound in New York City with Holbrook as mix engineer."]}, {"page": "Where Would I Be?", "response": ["AllMusic awarded the album 3 stars and its review by Scott Yanow states \"Although the rhythm section was more \"modern\" than he usually used (keyboardist Benny Aronov, bassist Malcolm Cecil, and Airto Moreira on drums and percussion), guitarist Jim Hall (who always had a harmonically advanced style anyway) has little difficulty adapting to the fresh setting\".", "*Malcolm Cecil - bass (tracks 1-5, 7 & 8)"]}, {"page": "1937 in the United Kingdom", "response": ["** Malcolm Cecil, jazz bassist and record producer (died 2021)Malcolm Cecil, influential producer and Stevie Wonder collaborator, has died"]}, {"page": "Footsteps in the Dark", "response": ["Written, composed and arranged by The Isley BrothersCo-produced by The Isley Brothers, Malcolm Cecil and Robert MargouleffThe Isley Brothers. Go for Your Guns (Album notes). T-Neck / Epic. 1977"]}, {"page": "Ealing Jazz Club", "response": ["The regular musicians at the Saturday night blues sessions during 1962-65 included Jack Bruce, Ginger Baker, Eric Clapton, Charlie Watts, Graham Bond, Long John Baldry, Rod Stewart, Malcolm Cecil, Dick Taylor, Dick Heckstall-Smith and Paul Jones. Manfred Mann (originally the Mann-Hugg Blues Brothers) also played there. The Who appeared there early on in their career, when they were known as the Detours. Eric Burdon, lead singer of the Animals and John McLaughlin also frequented the club. ", "The future TONTO's Expanding Head Band synthesizer pioneer and Stevie Wonder producer Malcolm Cecil who played double bass with Blues Incorporated recalled: “A young Mick Jagger would sit in sometimes when we played at the blues club in Ealing. On one memorable occasion, Mick asked Cyril if he could bend notes on guitar and Cyril quipped If you gimme some pliers, man.”"]}, {"page": "Laurie Z", "response": ["During the 80s, before going solo, Laurie recorded for Malcolm Cecil – inventor of the unique TONTO synthesizer – who had a company, EMPH Inc., \"Electronic Music Publishing House.\" EMPH, Inc. released the very first MIDI recording and playback software (MIDIPLAY) for the now obsolete Atari 1040 computer. Laurie recorded MIDI versions of songs for that program which were sold as \"Musidiscs.\" Only three Musidiscs were ever released - Beatles songs, Christmas music and some Grammy winning songs from 1986, and Laurie Z. recorded on all of them."]}, {"page": "Serge synthesizer", "response": ["Serge synthesizers have been used by composers such as Michael Stearns and Kevin Braheny (who owned a 15-panel system dubbed The Mighty Serge). Serge synthesizers are known for their flexibility, audio quality and relative compactness. Other well-known musicians using Serge synthesizers include: Malcolm Cecil, whose studio was used in Stevie Wonder albums; Gary Chang, movie composer; Roger Powell, keyboard player for Todd Rundgren; John Adams, composer; Ingram Marshall, composer; Ivan Tcherepnin, composer; and many experimental and electronic musicians such as Jim O'Rourke, Thomas Ankersmit, Sarah Davachi, R. Luke DuBois, Keith Fullerton Whitman and Paolo Tofani of the italian free-jazz and experimental group Area.", "As well as working on the modular range Serge worked with others.  He designed and built custom modules for Malcolm Cecil and Robert Margouleff's TONTO system (as used on several Stevie Wonder albums), and worked with Frank Eventoff on his Sonica and Rainmaker instruments."]}, {"page": "Alexis Korner's Blues Incorporated", "response": ["Alexis Korner's Blues Incorporated, or simply Blues Incorporated, were an English blues band formed in London in 1961, led by Alexis Korner and including at various times Jack Bruce, Charlie Watts, Terry Cox, Davy Graham, Ginger Baker, Art Wood, Long John Baldry, Ronnie Jones, Danny Thompson, Graham Bond, Cyril Davies, Malcolm Cecil, Dick Heckstall-Smith and Mick Jagger."]}, {"page": "It's Morrissey, Man!", "response": ["* Malcolm Cecil - bass"]}, {"page": "The Jazz Couriers", "response": ["The quintet's first line-up consisted of Tubby Hayes and Ronnie Scott on tenor saxophones,Ronnie Scott discography at David Taylor's British jazz web site  with Terry Shannon (piano), Malcolm Cecil (bass) and Bill Eyden (drums) and made their debut on the opening night at the new Flamingo Club in Wardour Street, Soho. They shared the gig with Tony Kinsey's Quintet featuring Joe Harriott.The Jazz Couriers at David Taylor's British jazz web site  The Jazz Couriers were chosen by the National Jazz Federation to play the opening sets when the Dave Brubeck Quartet made their first tour of the UK in February 1958."]}, {"page": "Perfect Angel", "response": ["With associate producers Malcolm Cecil and Robert Margouleff on hand engineering and programming the synthesizers, Riperton and company recorded Perfect Angel at the Record Plant in LA, Stevie Wonder's choice of studio on the West Coast. Perfect Angel was a musical romp through rock (“Reasons”), easy-going pop (“Seeing You This Way”) with a wonderful message song that closed out side one (“On The Edge Of a Dream” – written in honor of Martin Luther King Jr.). Wonder wrote the title tune as well as “Take a Little Trip”.", "*Malcolm Cecil – engineer, associate producer"]}]}}