{"wiki_id": "http://www.wikidata.org/entity/Q6742603", "itemLabel": "Malcolm Ross", "itemDescription": "Scottish guitarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Malcolm_Ross_(musician)", "wikipedia_page": {"main": "Malcolm Ross (born 31 July 1960 in Blantyre, Malawi) is a Scottish guitarist. His musical career started when he played guitar in the Scottish band Josef K.  They released a string of singles and an album, The Only Fun in Town, on Postcard Records in the early 1980s.\nAfter the demise of Josef K, Ross joined Edwyn Collins in the group Orange Juice, playing and writing songs for both the Rip it Up and Texas Fever albums. After Orange Juice, Ross joined Roddy Frame in Aztec Camera as the second guitarist, and recorded and toured the Mark Knopfler produced Knife album. Next, Ross embarked on other projects such as the High Bees with his wife, Syuzen Buckley, and Dave Ruffy (formerly with The Ruts).\nIn the mid-1980s and throughout the 1990s, Ross worked with many artists such as former Josef K bandmate Paul Haig, Momus, Edwyn Collins, Dave Graney and The Coral Snakes, Blancmange and Barry Adamson (ex-Magazine and The Bad Seeds). He was also hired as musical consultant on The Beatles biographical film Backbeat (1993), and contributed to the original musical score of the film Chocolat (2000), playing guitar alongside Johnny Depp.\nRoss appeared on ex-Fire Engine Davy Henderson's band The Nectarine No. 9's last album: I Love Total Destruction (2004) and is currently working with another ex-Fire Engine, [[Russell Burn] in their new band: Stac Lee. Ross continues to play with wife Syuzen in the group: Buckley's Chance mostly around Edinburgh, Scotland. He has also worked in various one-off projects including The Lonely Crowd with Bassist Billy Buckley, (his brother-in-law) Drummer Chris McArthur and New York songwriter Spike Priggen.\nRoss' solo career includes two solo albums on the German label Marina Records: Low Shot (1995) and: Happy Boy (1998). A compilation of Ross' work was released on Re-Action Recordings in 2006 and he recently was performing as a member of Barry Adamson's live band. Future collaborations for Ross with: Hulk Hogan and Lenny Henry are eminent.\nRoss appeared prominently in the 2015 history of Scotland's post-punk scene: Big Gold Dream.", "link_mentions": [{"page": "Orange Juice (band)", "response": ["Edwyn Collins pursued a successful solo career following the band's split, whilst other members James Kirk, David McClymont, Malcolm Ross and Zeke Manyika have had lower-profile solo releases. The original line-up of the band reunited once in 2008 to be honoured for their influence on Scottish music, but the band has never reformed.", "Shortly after Duncan's departure, one of Collins' colleagues in the Glasgow Parks Department, David McClymont, joined the band on bass, and the band was rechristened as Orange Juice. Collins, Kirk, McLymont and Daly's first gig as Orange Juice occurred in April 1979 in the Glasgow School of Art refectory. At another early gig at Teviot Row House at the University of Edinburgh was recorded by Malcolm Ross of Josef K, and one track from this (Kirk's \"Felicity\") was pressed as a flexi-disc to be distributed with a planned fanzine to be called Strawberry Swtichblade, a name later adopted for a band formed by friends of Alan Horne, the manager of Postcard Records, which he started with Collins in 1979 primarily as a conduit to release Orange Juice's music. In the event, the fanzine never appeared, though some copies of the flexi were given away the \"Ten Commandments\" fanzine run by Robert Hodgens (of The Bluebells).", "Daly left shortly after the Teviot Row gig, joining local punk act Fun 4, who released the controversial single 'Singing in the Showers' in November 1979 (the lyrics referring to Nazi gas chambers). Daly was replaced in Orange Juice by Chris Gordon on drums, but was persuaded back to record the band's debut single Falling and Laughing for Postcard records after Gordon suffered from stage fright at a number of gigs. The debut single was recorded in December 1979 in Strathaven, with Malcolm Ross co-producing and adding guitar to both the a-side and the playful b-side \"Moscow', the latter recorded as a tentative 'theme tune' for the coming 1980 Moscow Olympics. Fewer than 1,000 copies of Falling and Laughing were pressed, and most included copies of the Felicity flexi: 200 also included a postcard of the band. The wrap-round cover and amateur packaging established Postcard's home-spun aesthetic, with the label's  \"Sound of Young Scotland\" tagline marking it out as something of a reaction to much of the seriousness and angst of post-punk. Released in February 1980, Falling and Laughing was Postcard's signature tune: lyrically and musically, it celebrated the innocence of youth and was very much at odds with much contemporary independent music, combining a disco bass-line purloined from an ELO song with jangly guitars reminiscent of the Velvet Underground.", "Debut album You Can't Hide Your Love Forever was not released until February 1982, and received mixed reviews, with the use of backing singers and synthesizers anathema to some of the band's long-term fans. Retrospectively, however, the album is often cited as a classic of the era  and a key influence on the C86 generation and beyond. By the stage the album was released, the band in any case had a new line-up: in August 1981, Josef K split up, with Collins asking guitarist Malcolm Ross to join the band, making it a five-piece. This caused some ructions, with Daly and Kirk reportedly feeling the band was losing its original sound (Daly in particularly having publicly objected to the first Polydor single L-O-V-E (Love), a cover of the Al Green classic, released in October 1981). Collins was reported in the press as siding with Kirk and Daly before deciding to leave with Malcolm Ross and bass player David McLymont. Collins, Ross and McLymont performed as a three-piece, with stand-in drummers, on a couple of Autumn 1981 gigs before Zeke Manyika made his live debut in January 1982 at the London Venue. As such, the line-up that promoted You Can't Hide Your Love Forever on tour in early 1982 was not the line-up that recorded it: ignoring older material penned by James Kirk (e.g. \"Felicity\", \"Wan Light\", \"You Old Eccentric\", \"Three Cheers for Out Side\") the band often used dates to debut new songs that overtly more pop in style, including a cover of The Staple Singers \"I'll take you there\", future single \"I Can't Help Myself\" (with its telling reference to The Four Tops), and \"In spite of it all\", later renamed and issued as the single \"Two Hearts Together\" in the summer of 1982. The latter single was backed by \"Hokoyo\", a song co-written by Zeke Manyika and featuring lyrics in Shona, showing the band moving away from its original guitar-based sound towards a more varied and eclectic musical palette.", "Edwyn Collins continues to perform Orange Juice songs at his live shows. Though Malcolm Ross was initially part of Collins' live band, and Kirk, Manyika, and McLymont continue to record and perform intermittently, the band has never reformed. To date, the original line-up of the band has reunited publicly just once, in 2008, when they were honoured for their influence on Scottish music by the Nordoff Robbins musical trust."]}, {"page": "Aztec Camera", "response": ["After High Land Hard Rain, Bernie Clarke left the band, and was replaced by Malcolm Ross on second guitar and backing vocals.  Aztec Camera changed record labels once again for the release of their second album, Knife, which was released through WEA (Warner Music Group).", "**Malcolm Ross (1984)", "Frame changed the band's line-up numerous times over the course of its existence and, in a 1988 interview, Frame explained that the changes were underpinned by a desire to continually improve the quality of their music; however, he differentiated this desire from \"blind ambition\", whereby popular success is constantly sought after. Early members included Owens (bass) and Mulholland (drums). Gannon was a member from 1983 to 1984 before joining The Smiths, while guitarist Malcolm Ross (formerly of Josef K and Orange Juice) joined the band in 1984 and played on the Knife album.", "*Malcolm Ross – guitars", "*Malcolm Ross – guitars"]}, {"page": "Josef K (band)", "response": ["The band was formed in 1979 originally as TV Art by Paul Haig (vocals, guitar) and Ronnie Torrance (drums), later joined by Malcolm Ross (guitar, keyboards), with Gary McCormack added on bass guitar, who soon left (later joining The Exploited) with David Weddell replacing him.Larkin, Colin (1998) The Virgin Encyclopedia of Indie & New Wave, Virgin Books, , p. 232Reynolds, Simon (2005) Rip It Up and Start Again: postpunk 1978–1984, Faber & Faber, , p. 349 After recording a ten-track demo, their first release was the \"Romance\"/\"Chance Meeting\" single on Orange Juice drummer Steven Daly's Absolute label in December that year.Strong, Martin C. (2003) The Great Indie Discography, Canongate, , p. 386 They were then signed to Postcard Records, the label founded by Daly and Alan Horne, releasing a string of critically acclaimed singles in 1980 and 1981. The band recorded their debut album, Sorry for Laughing, in 1981 at Castle Sound Studios in Pencaitland, but it was shelved, with the band unhappy with the clean, polished production, Haig describing it as sounding \"flat and disinfected\", with only a few copies being released.Kellman, Andy \"Sorry For Laughing Review\", Allmusic, retrieved 27 May 2011 They returned to the studio in Belgium to record The Only Fun in Town, opting for a more 'live' sound and recording the whole album in two days, Haig later expressing a measure of regret that \"we decided to make an almost unlistenable record with the vocals mixed down really low\". It was their only album release while together, and while it placed well on the UK Independent Chart, it received a poor critical reception. Their earlier unreleased Sorry For Laughing album was eventually issued on a 1990 CD reissue of The Only Fun in Town and subsequently as its own vinyl LP in 2012 accompanied by a CD of TV Art's early demos. ", "The band split prior to the release of the 1982 single, \"The Farewell Single\" through Les Disques du Crépuscule, which included the Peel session track, \"The Missionary\", Haig deciding to call an end to the band while they were at a creative peak. Torrance joined Boots for Dancing and later (with Weddell) formed The Happy Family with Nick Currie (aka Momus). Haig embarked on a long solo career, releasing a string of albums on his own Rhythm of Life label between 1984 and 2008, while Malcolm Ross joined Orange Juice and then played with Aztec Camera and Blancmange before embarking on a solo career. Ross and Weddell later reunited in Magic Clan.", "Several notable labels have reissued Josef K albums and compilations, including Creation, Domino and LTM Recordings. In 2014 Les Disques du Crépuscule issued remastered vinyl and CD editions of The Only Fun in Town. The history of Josef K is covered in 2015 documentary film Big Gold Dream, with Malcolm Ross featuring prominently as an interviewee.", "* Malcolm Ross – guitar, violin", "All of their songs were written by either Paul Haig or Paul Haig/Malcolm Ross."]}, {"page": "Heroes and Villains", "response": ["* 2000 – Malcolm Ross, Caroline Now!"]}, {"page": "The Moodists", "response": ["The group released two EPs on the TIM label in 1986; these were co-produced by the band with Van Vugt. McFarlane opined that they \"had toned down somewhat, the band had lost none of its ability to craft unique and compelling songs.\" By that time, Walsh had returned to Australia, and been replaced by David McClymont, previously a member of Scottish band Orange Juice. The Moodists' final gig was in London, with the line-up of Graney, Miller, Moore and McClymont, joined by Malcolm Ross, like McClymont also formerly of Orange Juice, on guitar."]}, {"page": "Dave Graney", "response": ["In late 1986, The Moodists ground to a halt and after taking a break Dave Graney and Clare Moore formed Dave Graney 'n' the Coral Snakes (also seen as Dave Graney with the Coral Snakes) in late 1987 and played in London pubs and clubs. Other members were Gordy Blair on bass guitar, Malcolm Ross (ex-Orange Juice, The Moodists) on guitar and Louis Vause on piano and keyboards. In 1988, with Barry Adamson (former member of Magazine, Nick Cave and the Bad Seeds) producing, they recorded enough material for an extended play, \"At His Stone Beach\" released in September on the Fire label. The cover had ornate Edwardian lettering by UK illustrator Dave Western. By 1989, Graney and Moore were ordered out of the country by UK immigration authorities. The four tracks, \"World Full of Daughters\", \"Listen to Her Lovers Sing\", \"A Deal Made for Somebody Else\" and \"The Greatest Show in Town\", were later included on CD version of the Dave Graney with the White Buffaloes album, \"My Life on the Plains\".", "Dave Graney and the mistLY played an ATP Festival in Prestatyn, Wales, curated by comedian Stewart Lee, a long time supporter of their activities. They joined up with former guitarist Malcolm Ross and played shows in Edinburgh, Glasgow, Manchester (including a  BBC6 session with dj Marc Riley) and continued on to dates in France, Holland, Belgium and London.", "2020 digital album #2 - Dave Graney and ClareMoore 2020 digital album with Georgio \"the dove\" Valentino and Malcolm Ross.", "* with Malcolm Ross and Georgio \"the Dove\" Valentino – Cockaigne (2020)"]}, {"page": "Paul Haig", "response": ["Haig was born in Edinburgh, Scotland, and grew up in middle class Oxgangs.  His father was an owner of a fiberglass factory and his mother a secretary for a dental practice. Though not from a musical family, his father bought him his first guitar at age 12. Haig attended nearby Firrhill High School along with future Josef K bandmates Malcolm Ross, Ronnie Torrance and original bassist Gary McCormack.", "The media hype around Haig paved the way for a licensing deal with Island Records. At the close of 1982, Haig recorded his first album in New York with Alex Sadkin producing. Featuring a host of crack session players (including Bernie Worrell, Anton Fier and Jack Waldman), his new direction – polished club pop – sounded radically different from Josef K. The first single released from the album, \"Heaven Sent\" (a dance remake of an earlier Josef K song) stalled at No. 74 on the UK Singles Chart, and failed to provide Haig with the hit many had confidently predicted. The Rhythm of Life album appeared in October 1983 and was accompanied by a short seven date UK tour. Haig's touring group included Malcolm Ross on guitar, together with bassist David McClymont (also fresh from Orange Juice), drummer James Locke and former Associate Alan Rankine."]}, {"page": "List of Scottish musicians", "response": ["*Malcolm Ross, guitarist"]}, {"page": "Rip It Up (Orange Juice album)", "response": ["#\"Rip It Up\" – 5:19 (Edwyn Collins, David McClymont, Malcolm Ross, Zeke Manyika)", "* Malcolm Ross – guitar, vocals, keyboards, songwriting"]}, {"page": "Texas Fever", "response": ["# \"Punch Drunk\" (Malcolm Ross) – 3:34", "* Malcolm Ross – guitar, vocals, keyboards, songwriting"]}, {"page": "List of white Africans of European ancestry", "response": ["* Malcolm Ross, guitarist"]}, {"page": "Malcolm Ross", "response": ["Malcolm Ross may refer to:", "* Malcolm Ross (balloonist) (1919–1985), American record-setting balloonist", "* Malcolm Ross (courtier) (1943–2019), Lord Prior of the Most Venerable Order of the Hospital of Saint John of Jerusalem", "* Malcolm Ross (journalist) (1862–1930), New Zealand journalist, mountaineer, and war correspondent", "* Malcolm Ross (linguist) (born 1942), Australian specialist in Austronesian and Papuan linguistics", "* Malcolm Ross (literary critic) (1911–2002), Canadian literary critic", "* Malcolm Ross (musician) (born 1960), Scottish musician in band Josef K", "* Malcolm Ross (school teacher) (born 1946), Canadian Holocaust-denier"]}, {"page": "Knife (album)", "response": ["* Malcolm Ross – guitar, backing vocals"]}, {"page": "July 31", "response": ["*  1960   – Malcolm Ross, Scottish guitarist and songwriter "]}]}}