{"wiki_id": "http://www.wikidata.org/entity/Q6742494", "itemLabel": "Malcolm McGowan", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Malcolm_McGowan", "wikipedia_page": {"main": "Malcolm R. McGowan (born 24 October 1955) is a British rower who competed in the 1980 Summer Olympics and in the 1984 Summer Olympics.\nHe was born in London in 1955 and attended Emanuel School.\nIn 1980 he was a crew member of the British boat which won the silver medal in the eights event. In 1981, he won a silver medal at the World Rowing Championships in Munich. He finished fifth with the British eight in the 1984 Olympics.", "link_mentions": [{"page": "Rowing at the 1980 Summer Olympics", "response": ["| Duncan McDougallAllan WhitwellHenry ClayChris MahoneyAndrew JusticeJohn PritchardMalcolm McGowanRichard StanhopeColin Moynihan (cox)"]}, {"page": "Great Britain at the 1980 Summer Olympics", "response": ["* Henry Clay, Andrew Justice, Chris Mahoney, Duncan McDougall, Malcolm McGowan, Colin Moynihan, John Pritchard, Richard Stanhope, and Allan Whitwell — Rowing, Men's Eights", "* Henry Clay, Andrew Justice, Chris Mahoney, Duncan McDougall, Malcolm McGowan, John Pritchard, Richard Stanhope, Allan Whitwell, Colin Moynihan"]}, {"page": "Great Britain at the 1984 Summer Olympics", "response": ["* Clive Roberts, Adam Clift, Salih Hassan, Chris Mahoney, Duncan McDougall, Malcolm McGowan, John Pritchard, Allan Whitwell, Colin Moynihan"]}, {"page": "List of Olympic medalists in rowing (men)", "response": ["|Duncan McDougallAllan WhitwellHenry ClayChris MahoneyAndrew JusticeJohn PritchardMalcolm McGowanRichard StanhopeColin Moynihan"]}, {"page": "1981 World Rowing Championships", "response": ["|   Mark Andrews (b)John Bland (2)Colin Seymour (3)Christopher Mahoney (4)Andrew Justice (5)John Pritchard (6)Malcolm McGowan (7)Richard Stanhope (s)Colin Moynihan (c) || 6:04.31"]}, {"page": "List of Old Emanuels", "response": ["* Malcolm McGowan – Great Britain Olympic oarsman 1980; silver medalist Men's Coxed Eights & 1984 Finalist"]}, {"page": "1978 World Rowing Championships", "response": ["| Lenny Robertson, Allan Whitwell, Henry Clay, Malcolm McGowan, Campbell, Gordon Rankine, Robert Milligan, Colin Seymour, Robert Lee (cox)"]}]}}