{"wiki_id": "http://www.wikidata.org/entity/Q6758539", "itemLabel": "Marcus Wight", "itemDescription": "cricketer (born 1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Marcus_Wight", "wikipedia_page": {"main": "Robert Marcus Wight (born 12 September 1969) is a former English cricketer. Wight was a right-handed batsman who bowled right-arm off break. He was born in Kensington, London and later undertook further education at Exeter University, before attending Cambridge University.While studying at Cambridge, Wight made his first-class debut for Cambridge University Cricket Club against Leicestershire in 1992. He made eight further first-class appearances for the university in that season, the last of which came against Oxford University at Lord's. In his nine first-class appearances for the university, he scored 366 runs at an average of 28.15, with a high score of 62 not out. This score, which was one of two fifties he made for the university, came against Oxford University. With the ball, he took 18 wickets at a bowling average of 37.61, with best figures of 3/65. He also made a single first-class appearance for a combined Oxford and Cambridge Universities team against the touring Pakistanis in that season.Following his studies, he joined Gloucestershire for the 1993 season, making his debut for the county against Northamptonshire in the 1993 County Championship. He made eight further first-class appearances for the county, the last of which came against the touring New Zealanders. In his nine first-class appearances for Gloucestershire, he scored a total of 205 runs at an average of 17.08, with a high score of 54. This score, which was his only first-class half century for Gloucestershire, came against Leicestershire in 1993. In his debut season with Gloucestershire, he also made his List A debut against Kent in the AXA Equity & Law League. Wight made eleven further List A appearances, the last of which came against Hampshire in the 1994 AXA Equity & Law League. In his twelve List A appearances, he scored 51 runs at an average of 7.28, with a high score of 18. With the ball, he took 9 wickets at an average of 31.00, with best figures of 2/28. He left Gloucestershire at the end of the 1994 season.", "link_mentions": [{"page": "List of Gloucestershire County Cricket Club players", "response": ["* Marcus Wight (1993–1994) : R. M. Wight"]}]}}