{"wiki_id": "http://www.wikidata.org/entity/Q6759746", "itemLabel": "Margaret Mountford", "itemDescription": "British lawyer, businesswoman and television personality", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaret_Mountford", "wikipedia_page": {"main": "Margaret Rose Mountford (née Swale, born 24 November 1951) is a Northern Irish lawyer, businesswoman and television personality best known for her role in The Apprentice.", "link_mentions": [{"page": "November 24", "response": ["*  1951   – Margaret Mountford, Northern Irish-British lawyer and businesswoman"]}, {"page": "Holywood", "response": ["* Margaret Mountford, lawyer, businesswoman and advisor to Alan Sugar."]}, {"page": "The Apprentice (British TV series)", "response": ["| Margaret Mountford || style=\"text-align:center; background:lightblue;\"| || || || || || colspan=4 style=\"text-align:center; background:lightblue;\"| || || || || || ||", "* Margaret Mountford (Series 1 to 5) – Alongside recruiting Hewer to work with him on the programme, Alan Sugar also recruited Margaret as his second adviser, having worked with her since she first met him while working as a partner for the law firm Herbert Smith, until March 1999. She remained with the show until she announced in her column for the Daily Telegraph on 1 June 2009, that the fifth series would be her last, citing that her departure would allow her to devote more time to her studies, with the decision fully confirmed during her appearance on You're Hired, after the final episode of Series 5. Despite departing from the role, she remained with the show for Series 6–9, acting as an interviewer for the Interviews stage of the competition.", "* Karren Brady (Series 6–present) – Following Margaret Mountford's departure from the role, Alan Sugar assigned Karren as his new adviser. A notable businesswoman in her own right, she had previously appeared on the show as an interviewer in the fourth and fifth series, and as a team leader for Comic Relief Does The Apprentice in 2007, where she led the team of celebrity women to victory while raising over £1,000,000 for charity on the spin-off programme. Her first appearance in the role was on Young Apprentice before the sixth series of the main show, and she regularly appears as a guest panellist on You're Fired!.", "Prior to the start of filming for the series, Adam Freeman, one of the lucky sixteen that had made it onto the fifth series, was forced to pull out; it was stated that his reasons for doing so were due to a \"family matters\". This meant that when the series began on 25 March 2009, viewers got to see fifteen candidates vying for the prize, with Margaret Mountford announcing her decision to stand down as a participant of the show during its broadcast, officially confirming it on You're Fired.Margaret Mountford quits 'The Apprentice' Digital Spy, 6 June 2009 The series was won by Yasmina Siadatan.", "The first series of the programme began on 12 May 2010, under the title of Junior Apprentice, consisted of 10 candidates split evenly between gender, and ran for a total of six episodes. It also marked the debut of Karren Brady as Margaret Mountford's replacement, after she left the main show following the fifth series; Brady would later begin her first appearance on The Apprentice at the start of its sixth series. The spin-off later led to the BBC commissioning two more series, though with a few changes – the show was renamed as Young Apprentice, with the number of candidates increased to twelve and the number of episodes increased to eight. The second series began airing on 24 October 2011, while the third began on 1 November 2012."]}, {"page": "Karren Brady", "response": ["On 30 August 2009, she was revealed as Sugar's new assistant in the sixth series of The Apprentice, replacing Margaret Mountford, who had left the series (and who returned in series 6, 7, 8 and 9 as a guest interviewer, the same role that Brady had fulfilled in her first appearance in the main UK apprentice series)."]}, {"page": "The Apprentice (British series 2)", "response": ["Following favourable ratings and viewing figures for the first series, the BBC commissioned additional episodes of The Apprentice, with Alan Sugar, Nick Hewer and Margaret Mountford returning to assume their roles within the programme and aid in production of the second series. One request made of production staff by the broadcaster was that a companion discussion show be created to air alongside it. This led to the creation of The Apprentice: You're Fired!, a sister show that would air on BBC Three and operate within a similar format to spin-off sister shows like Big Brother's Little Brother and Strictly Come Dancing: It Takes Two. The search for a host for this programme led to chief football presenter Adrian Chiles being offered the role, with his acceptance revealed prior to the second series' premiere episode."]}, {"page": "The Apprentice (British series 1)", "response": ["Work on the series began in Autumn 2004, after the BBC successfully secured the rights to creating a British version of the American original, followed by the broadcaster receiving an agreement of acceptance from Alan Sugar to be at the head of the new programme. Involved in development of the format, Sugar worked with the production staff to determine what tasks would be faced by those participating in the series, and how he would be given feedback on these. Amongst the discussions undertaken with him, it was decided that two of Sugar's close business associates, Nick Hewer and Margaret Mountford, would star alongside him in the role of his aides, and that one of the tasks would focus on interviewing candidates who reached the penultimate stage of the process, with both Hewer and Mountford overseeing this, alongside other business associates of Sugar – Paul Kemsley, Claude Littner, and Bordan Tkachuk."]}, {"page": "Strathearn School", "response": ["* Margaret Mountford, businesswoman"]}, {"page": "Nick Hewer", "response": ["He also presented two BBC One series, The Town that Never Retired and We All Pay Your Benefits with Margaret Mountford.", "In July 2014, Hewer co-presented a BBC One documentary series with Margaret Mountford called Nick and Margaret: Too many Immigrants? which researched the impact of and attitudes towards immigrants in the UK."]}, {"page": "Pompeii in popular culture", "response": ["* Pompeii: The Mystery of the People Frozen in Time (2013), a BBC One drama documentary presented by Dr. Margaret Mountford."]}, {"page": "Society for the Promotion of Hellenic Studies", "response": [":Hon. Secretary: Dr Margaret Mountford"]}, {"page": "Pompeii", "response": ["* Pompeii: The Mystery of the People Frozen in Time (2013), a BBC One drama documentary presented by Dr. Margaret Mountford."]}, {"page": "Herculaneum", "response": ["* \"Pompeii: The Mystery of the People Frozen in Time\"Pompeii: The Mystery of the People Frozen in Time is a 2013 BBC One drama documentary presented by Dr. Margaret Mountford."]}, {"page": "Red Nose Day 2009", "response": ["* Margaret Mountford"]}, {"page": "The Apprentice (British series 5)", "response": ["The fifth series of British reality television series The Apprentice (UK) was broadcast in the UK on BBC One, from 25 March to 7 June 2009; because of ITV's live coverage of a 2010 FIFA World Cup qualification match involving England, the final episode was broadcast three days earlier to avoid clashing with this. It is the last series to feature Margaret Mountford as one of Alan Sugar's aides, after deciding to leave following the conclusion of the fifth series to focus on her education, although she would retain a place in the programme until the end of the ninth series. Alongside the standard twelve episodes, two specials were aired alongside this series – \"The Final Five\" on 3 June; and \"Why I Fired Them\" on 5 June.", "Following the previous series, Sugar deemed it unwise to continue using exotic locations abroad for the setting of tasks in the wake of the global economic recession that had begun in 2007. His decision led to the production staff arranging for filming of any tasks set abroad to be done within countries of the EU, until production of the ninth series of The Apprentice would begin in 2012. Another change for the show was the departure of Paul Kemsley, who chose not to return as an interviewer for the fifth series, leading to him being replaced by Sugar with Alan Watts. One of the significant events to occur within the series came during its broadcast, when Margaret Mountford decided to leave the programme after having committed five years towards its production. Her decision to leave was due to her desire to refocus her attention back towards continuing her educational studies. After discussing with Sugar about her intended plans, her decision to depart was announced in her column for the Daily Telegraph on 1 June 2009, with it officially confirmed by both Mountford and Sugar during their appearance on You're Fired following the series finale."]}, {"page": "Adam and Joe (radio show)", "response": ["| \"Song for Margaret Mountford\""]}, {"page": "1951 in British television", "response": ["* 24 November – Margaret Mountford, lawyer, businesswoman and television personality"]}, {"page": "The Apprentice (British series 6)", "response": ["The sixth series is last to offer a six-figure job as a prize, before this particular area of the programme's format was changed for subsequent series at the request of Sugar. It is also the first series to feature Karren Brady as Margaret Mountford's successor to the role of Sugar's aide in the programme, after her initial appearance in this role for the first series of Young Apprentice. Despite announcing the previous year she was leaving the programme, Mountford retained a role within The Apprentice by taking over Brady's role as an interviewer in the Interviews stage. Alongside the standard twelve episodes, two specials were aired alongside this series – \"The Final Five\" on 9 December; and \"Why I Fired Them\" on 16 December.", "Upon receiving applications from potential participants, production staff held regional auditions and interviews throughout July 2009, followed by a second round of interviews and assessments in London to determine the final selection of sixteen candidates. Prior to work beginning on the series, Alan Sugar was required to appoint a successor to Margaret Mountford, following her decision to quit her role in the show earlier that year, leading to Karren Brady, one of his interviewers, agreeing to the offer of becoming his new aide on the show. Her appointment was given a trial run during the production and broadcast of the first series of Young Apprentice, before it was finalised. Meanwhile, Mountford agreed to remain on the show, despite her educational studies, taking over Brady's role as an interviewer in the Interviews stage."]}, {"page": "2010 in British television", "response": ["|Junior Apprentice makes its debut on BBC One. The first episode sees Karren Brady succeed Margaret Mountford as a member of Lord Sugar's board room."]}, {"page": "Dirk Obbink", "response": ["In March 2010, Obbink appeared in Channel 4's series Alexandria: The Greatest City, presented by Bettany Hughes. In the programme he talked about the ancient Library of Alexandria. He also featured briefly in the 2015 BBC documentary Love and Life on Lesbos with Margaret Mountford, in which he showed Mountford a papyrus brought to him by an anonymous private collector in 2012 and that is now believed to be a manuscript copy, executed in about A.D. 200, of a poem written by Sappho in c. 600 B.C."]}, {"page": "Young Apprentice", "response": ["Young Apprentice is a British reality television programme and a spin off of The Apprentice, in which a group of young people compete against each other in a series of business related challenges to win a £25,000 investment from British business magnate Lord Sugar. In addition to Sugar, he was also joined by his adviser Nick Hewer, and new adviser Karren Brady, prior to her debut on the main show, upon Margaret Mountford's departure from the role in 2009.", "A few months later, Sugar's appointment to be the Labour Party's Enterprise Tsar on 5 June 2009, accompanied by a peerage, led to concerns by the BBC over a conflict of interest in regards to the corporation's political impartiality; while it was decreed that he would continue to appear on The Apprentice and related programming, following discussions on the matter, it was decided to push back the premiere of the spin-off show, dubbed Junior Apprentice, along with the sixth series of the main show, until after the 2010 general election on 6 May 2010. In addition to this, Margaret Mountford's departure from the role of an adviser in The Apprentice, led to Sugar appointing Karren Brady as her replacement, with the decision that she would make her debut in the spin-off. On 3 May 2010, the BBC finally announced the premiere date for the show, which began airing its first series on 12 May 2010."]}, {"page": "That Sunday Night Show", "response": ["|2 || Frank Skinner, Margaret Mountford, Julie Hesmondhalgh ||  ", "|5 || Clive Anderson, Margaret Mountford, Tinchy Stryder || 23 October 2011"]}, {"page": "List of alumni of Girton College, Cambridge", "response": ["|Margaret Mountford"]}, {"page": "Mountford", "response": ["*Margaret Mountford, a British lawyer, businesswoman and TV personality known for her role in The Apprentice"]}, {"page": "Dr Margaret Mountford", "response": ["#redirectMargaret Mountford"]}]}}