{"wiki_id": "http://www.wikidata.org/entity/Q6759863", "itemLabel": "Margaret Rutherford", "itemDescription": "cricketer (born 1935)", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaret_Rutherford_(cricketer)", "wikipedia_page": {"main": "Sheila Margaret Rutherford (born 15 June 1935) is an English former cricketer who played primarily as a bowler. She appeared in four Test matches for England in 1960 and 1961, all against South Africa. She played domestic cricket for various North of England composite XIs, as well as her home county of Northumberland.", "link_mentions": [{"page": "Margaret Rutherford", "response": ["Margaret Rutherford was educated at Wimbledon High School (where a theatre space, the Rutherford Centre, is now named after her) and, from the age of about 13, at Raven's Croft School, a boarding school in Sutton Avenue, Seaford. While she was there, she developed an interest in the theatre and performed in amateur dramatics. After she left school, her aunt paid for her to have private acting lessons. When her aunt died, she left a legacy which allowed Rutherford to secure entry to the Old Vic School. In her autobiography, Rutherford called her Aunt Bessie her \"adoptive mother and one of the saints of the world\".", "In 1941 Noël Coward's Blithe Spirit opened on the London stage at the Piccadilly Theatre, with Coward directing. Rutherford received rave reviews from audiences and critics alike for her lusty portrayal of the bumbling medium Madame Arcati, a role which Coward had envisaged for her. Theatre critic Kenneth Tynan once said of her performances: \"The unique thing about Margaret Rutherford is that she can act with her chin alone.\" Rutherford's quirky, energetic stage presence was such that she could deftly steal a scene even when playing relatively minor roles.", "In the early 1960s, she appeared as Miss Jane Marple in a series of four George Pollock films loosely based on the novels of Agatha Christie. The films depicted Marple as a colourful character, respectable but bossy and eccentric. Authors Marion Shaw and Sabine Vanacker in their book Reflecting on Miss Marple (1991) complained that the emphasis on the \"dotty element in the character\" missed entirely \"the quietness and sharpness\" that was admired in the novels. The actress, then aged in her 70s, insisted on wearing her own clothes for the part and having her husband appear alongside her. In 1963 Christie dedicated her novel The Mirror Crack'd from Side to Side \"To Margaret Rutherford in admiration\", though the novelist too was critical of the films for diverging from her original plots and playing dramatic scenes for laughs. Rutherford reprised the role of Miss Marple in a very brief, uncredited cameo in the 1965 film The Alphabet Murders.", "Rutherford and Davis (who died in 1973) are interred at the graveyard of St. James's Church, Gerrards Cross, Buckinghamshire. \"A Blithe Spirit\" is inscribed on the base of Margaret Rutherford's memorial stone, a reference to the Noël Coward play that helped to make her name.", "thumb|right|Margaret Rutherford honour plaque in London", "For One Night Only: Margaret Rutherford. Margaret Rutherford (Timothy Spall in drag) tells her life story in cabaret form before an audience. Without Walls TV Series (UK) 5 October 1993."]}, {"page": "Northumberland Women cricket team", "response": ["* Margaret Rutherford (1960)"]}]}}