{"wiki_id": "http://www.wikidata.org/entity/Q675763", "itemLabel": "Gareth Morris", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Gareth_Morris", "wikipedia_page": {"main": "Gareth Charles Walter Morris (13 May 1920 – 14 February 2007) was a British flautist.  He was the principal flautist of a number of London orchestras including the Boyd Neel Orchestra before joining the Philharmonia Orchestra.  He was the principal flautist of this orchestra for 24 years and Professor of the Flute at the Royal Academy of Music from 1945 to 1985. Morris was known for using a wooden flute, at a time when most other players had switched to using metal flutes.\nGareth Morris was born in Clevedon, Somerset, England and was educated at Bristol Cathedral Choir School.  He began to play the flute when he was aged 12, and subsequently studied privately with Robert Murchie. At 18 he won a scholarship to the Royal Academy of Music where his main teacher was Charles Stainer.  At the Academy he met Dennis Brain and became his lifelong friend. Morris was best man for Brain's wedding. Morris's Wigmore Hall debut was in 1939 and he played in chamber music groups, including the Dennis Brain Wind Ensemble and the London Wind Quintet.  During the Second World War he joined the Royal Air Force and was principal flute in the RAF Symphony Orchestra.\nMorris succeeded Arthur Gleghorn as principal flute in the Philharmonia Orchestra in 1948. \nHe played at Queen Elizabeth II's Coronation in 1953. The Philharmonia Orchestra had been founded by Walter Legge in 1945 but in 1964 Legge announced that he intended to disband it.  However the members dissented from this and agreed that the orchestra should continue, that it should be self-governing, and that it should be renamed the New Philharmonia Orchestra.  In 1966 Morris became chairman of this orchestra with Otto Klemperer as the principal conductor.  Morris had a close and deeply respectful relationship with Klemperer, but his relationship with Karajan has been described as \"at best cordial, but he respected the conductor's talent\".Klemperer retired in 1971 when he was aged 87, and was succeeded by Lorin Maazel followed by Riccardo Muti.  Morris retired shortly afterwards from the orchestra.  The press release at the time spoke of \"irreconcilable artistic differences\" which had contributed to his resignation.  However, there was another, possibly more important, factor.  While on tour with the orchestra in New York City, Morris was mugged and seriously injured.  Amongst these injuries, a nerve in his mouth had been damaged and as a result, he had to completely give up playing the flute.Morris's flute was originally a Rudall-Carte with open G-sharp and vented D, and later in his career he performed on an instrument bequeathed to him by Robert Murchie.  His style was of the English school, with a tight embouchure and he produced a very solid and powerful tone which was also capable of incredible delicacy. He eschewed the use of excessive vibrato. He was said to be \"at the forefront of English flute playing for more than half a century\".  Many composers wrote works for him, including Gordon Jacob and Alan Rawsthorne.  During his career he gave the first British performance of Poulenc's Flute Sonata in 1958.\nMorris married first, in 1954, Joy Hazelrigg of Kentucky and they had a daughter, Emily.  Following a divorce, in 1975 he married Patricia Murray, with whom he had three children, Thomas, Mary and Catharine.Morris retired to Bristol and there continued to teach.  In 1991 he published a tutorial entitled Flute Technique.  His other activities included being an adjudicator, an orchestral coach and a lecturer.  He frequently taught at the Dartington Summer School.  His siblings are Christopher, a music publisher at the Oxford University Press, and Jan Morris, the travel writer.  A photographic portrait taken in 1968 by Godfrey Argent is held by the National Portrait Gallery.\n\n", "link_mentions": [{"page": "February 14", "response": ["*  2007   – Gareth Morris, English flute player and educator (b. 1920)"]}, {"page": "May 13", "response": ["*1920 – Gareth Morris, English flute player (d. 2007)"]}, {"page": "Canonbury", "response": ["* Gareth Morris, principal flute, Philharmonia and New Philharmonia Orchestras (1948-1972) also principal flute professor of Royal Academy of Music (1945-1985), resident of 4, Alwyne Place from 1945 to 1987"]}, {"page": "Philharmonia Orchestra", "response": ["Although few agreed with him, Legge contended that the quality of the orchestra was declining. Looking back in 1975 at the heyday of his orchestra, he singled out for particular mention not only Brain and Civil, Kell and Bradshaw, but also Clement Lawton (tuba), Arthur Gleghorn (piccolo), Gareth Morris (flute), Sidney (\"Jock\") Sutcliffe (oboe), Frederick Thurston and Bernard Walton (clarinets), Gwydion Brooke (bassoon), and two leaders, Manoug Parikian and Hugh Bean. Legge maintained retrospectively that in the absence of enough recording work to attract the finest new orchestral players to follow such stars he had no alternative to disbanding the Philharmonia.", "Leading players of the early 1970s included Raymond Cohen, Desmond Bradley, Carlos Villa (violins), Herbert Downes (viola), Gareth Morris (flute), John McCaw (clarinet), Gwydion Brooke (bassoon) and Nicholas Busch (horn). The Philharmonia was ahead of some of its London rivals in admitting female players. By 1972, seventeen of the sixty-six string players were women, although the other three sections remained exclusively male, except for the veteran harpist, Sidonie Goossens.New Philharmonia programme booklet, Royal Festival Hall, 17 February 1972"]}, {"page": "1920 in music", "response": ["*May 13 – Gareth Morris, flautist (d. 2007)"]}, {"page": "1920 in the United Kingdom", "response": ["* 13 May – Gareth Morris, flautist (died 2007)"]}, {"page": "Flute Sonata (Poulenc)", "response": ["Poulenc considered giving the American premiere together with Rampal during a planned US tour, but the tour did not take place and Rampal gave the American premiere in February 1958 with his regular accompanist Robert Veyron-Lacroix.Schmidt (2002), p. 464 Poulenc was pleased to accompany other flautists in the sonata. In January 1959 he accompanied Gareth Morris in the British premiere, in an all-Poulenc programme that included the world premiere of his Élégie in memory of Dennis Brain for horn and piano.Third Programme\", Radio Times, 14 February 1959, p. 31 Later in that year Poulenc played the piano part with Maxence Larrieu in Avignon, Rampal in Paris and Christian Lardé in Menton. in 2015, the pianist and scholar David Owen Norris called the sonata \"probably the world's most played piece for flute and piano\".\"Building a Library\", BBC Radio 3, 14 November 2015. Statement made at 1 minute from start. The survey is reported in the BBC's Music Magazine at \"The best recordings of Poulenc's Flute Sonata\", BBC. Retrieved 7 April 2020"]}, {"page": "York Bowen", "response": ["Many of Bowen's instrumental works were dedicated to and premiered by renowned musicians.  In 1910 Fritz Kreisler performed the Suite in D minor for Violin and Piano, Op. 28, and many other renowned violinists of the time later gave performances of the work, including Joseph Szigeti, Michael Zacharewitsch and Efrem Zimbalist. The celebrated violinist Marjorie Hayward performed Bowen's Violin Concerto in E minor, Op. 33, at the Proms in 1920 and the first performances of Sonata for Horn and Piano, Op. 101, and Concerto for Horn, Strings and Timpani, Op. 150, were given by Aubrey Brain and Dennis Brain respectively. Bowen also composed works for many of his other contemporaries including Carl Dolmetsch, Léon Goossens, Beatrice Harrison, Pauline Juler and Gareth Morris."]}, {"page": "2007 in the United Kingdom", "response": ["** Gareth Morris, flautist and music teacher (born 1920)"]}, {"page": "1920 in Wales", "response": ["*13 May – Gareth Morris, flautist, brother of Jan Morris (d. 2007)"]}, {"page": "Deaths in February 2007", "response": ["*Gareth Morris, 86, British flautist and music teacher."]}, {"page": "Morris (surname)", "response": ["* Gareth Morris (1920–2007), British flautist"]}, {"page": "Royal Air Force Music Services", "response": ["During the 1930s RAF music became well established and in the lead up to World War II there was a large expansion of Music Services. Additional military bands were provided on a Command basis, with the RAF Symphony Orchestra and the famous 'Squadronaires' Dance Band being established. The Central Band included some of the country's finest musicians such as Dennis Brain, Norman Del Mar and Gareth Morris."]}, {"page": "Bernard Walton", "response": ["After leaving the orchestra in April 1966, Walton rejoined the London Philharmonic, and devoted more time to chamber music, forming the Music Group of London with Hugh Bean, Eileen Croxford, and David Parkhouse. Along with the other leaders of the woodwind section of the Philharmonia – Gareth Morris, Herbert (\"Jock\") Sutcliffe, and Gwydion Brooke – Walton formed what Legge liked to call \"Legge's Royal Flush\".Legge, Walter. \"The birth of the Philharmonia\", The Times, 27 December 1975, p. 4 In addition to his work as a performer, Walton was professor of clarinet at the Royal College of Music from 1954 until his death."]}, {"page": "List of English people", "response": ["* Gareth Morris (1920–2007), flautist"]}, {"page": "2007 in British music", "response": ["*14 February – Gareth Morris, flute player and educator, 86"]}, {"page": "List of people associated with the Royal Academy of Music", "response": ["* Gareth Morris (flautist)"]}, {"page": "Cecil James", "response": ["Cecil studied with his father, won a scholarship to the Royal College of Music. There, in 1933, he performed the Mozart Concerto with Orchestra and shortly after was appointed to the London Symphony Orchestra. It was there he met oboist Natalie Caine whom he married in 1938. During the war, he played with the Royal Air Force Central Band alongside Gareth Morris, Leonard Brain, Dennis Brain, Norman Del Mar, Harry Blech, Fred Grinke, Leonard Hirsch, Jim Merrett and James Whitehead.", "*Biography  Gareth Morris for The Double Reed"]}, {"page": "List of flautists", "response": ["*Gareth Morris"]}, {"page": "May 1920", "response": ["*Born: Gareth Morris, British flute player, in Clevedon, Somerset (d. 2007)"]}, {"page": "Gareth Morrison", "response": ["Gareth Morrison (born 6 December 1981) is Scottish actor, screenwriter and film producer. Morrison appears primarily in horror, thriller and dramatic movies. He is known for his role as a student-demonstrator in TV series Taggart and for playing the sniper Potrovsky in a horror movie Outpost: Rise of the Spetsnaz.", "* Gareth Morris – British flautist"]}, {"page": "1920 in British music", "response": ["*13 May – Gareth Morris, flautist (died 2007)"]}, {"page": "List of leaders of dependent territories in 2019", "response": ["***# Gareth Morris, Acting Administrator of Ascension Island (for Steven Chandler) (2019)"]}, {"page": "Sidney Sutcliffe", "response": ["In 1949 after turning him down once, Sutcliffe accepted Walter Legge's invitation to join the Philharmonia. The orchestra was gaining a reputation as the best in Britain except for its woodwind section, where Sir Thomas Beecham's celebrated \"Royal Family\" of wind players in the Royal Philharmonic was the most admired.Melville-Mason, Graham. \"Gwydion Brooke – Bassoonist in Sir Thomas Beecham's 'Royal Family'\" , The Independent, 5 April 2005\"Geoffrey Gilbert\", The Times, 22 May 1989, p. 20 Legge aimed to rival it with what he called his \"royal flush\", comprising Sutcliffe, Bernard Walton (clarinet), Gareth Morris (flute) and (from 1951) Cecil James (bassoon].Schwarzkopf, p. 114 In 1964 Sutcliffe moved to the BBC Symphony Orchestra, where he remained for seven years. "]}, {"page": "Robert Murchie", "response": ["He was a very successful teacher; his students included Gareth Morris, (to whom he bequeathed his Rudall Carte flute), Richard Adeney, Alfred John Ellory, John Francis, Arliss Marriott, Edgar Hunt, Harold Clarke, Leonard Hopkinson, Muriel Dawn, John Braddock and Alexander Douglas Murray."]}, {"page": "Musicians at the Edinburgh International Festival, 1947 to 1957", "response": ["| Léon Goossens, Guilhermina Suggia, Jacqueline Blancard, Rudolf Serkin, Adolf Busch, Ginette Neveu,  Monique de la Bruchollerie, Frederick Thurston, Dennis Brain, James Merrett, Ivor Newton, Gerald Moore, Alan Richardson, Gareth Morris, Frederick Thurston, Geoffrey Gilbert, Henri Honegger, Jean Neveu, Corinne Lacomblé, Paul Draper, Waldo Channon, Ailie Cullen, Marie Korchinska, Irene Richards, Thornton Lofthouse, Margot Stebbing, John Walton, Kinloch Anderson, Harold Clarke "]}]}}