{"wiki_id": "http://www.wikidata.org/entity/Q6759288", "itemLabel": "Margaret Cole", "itemDescription": "English socialist politician (1893-1980)", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaret_Cole", "wikipedia_page": {"main": "Dame Margaret Isabel Cole  (née Postgate; 6 May 1893 – 7 May 1980) was an English socialist politician, writer and poet. She wrote several detective stories jointly with her husband, G. D. H. Cole. She went on to hold important posts in London government after the Second World War.", "link_mentions": [{"page": "George Bernard Shaw", "response": ["In January 1893, as a Fabian delegate, Shaw attended the Bradford conference which led to the foundation of the Independent Labour Party. He was sceptical about the new party, and scorned the likelihood that it could switch the allegiance of the working class from sport to politics. He persuaded the conference to adopt resolutions abolishing indirect taxation, and taxing unearned income \"to extinction\". Back in London, Shaw produced what Margaret Cole, in her Fabian history, terms a \"grand philippic\" against the minority Liberal administration that had taken power in 1892. To Your Tents, O Israel excoriated the government for ignoring social issues and concentrating solely on Irish Home Rule, a matter Shaw declared of no relevance to socialism. In 1894 the Fabian Society received a substantial bequest from a sympathiser, Henry Hunt Hutchinson—Holroyd mentions £10,000. Webb, who chaired the board of trustees appointed to supervise the legacy, proposed to use most of it to found a school of economics and politics. Shaw demurred; he thought such a venture was contrary to the specified purpose of the legacy. He was eventually persuaded to support the proposal, and the London School of Economics and Political Science (LSE) opened in the summer of 1895.", "The substance of Shaw's political legacy is uncertain. In 1921 Shaw's erstwhile collaborator William Archer, in a letter to the playwright, wrote: \"I doubt if there is any case of a man so widely read, heard, seen, and known as yourself, who has produced so little effect on his generation.\" Margaret Cole, who considered Shaw the greatest writer of his age, professed never to have understood him. She thought he worked \"immensely hard\" at politics, but essentially, she surmises, it was for fun—\"the fun of a brilliant artist\". After Shaw's death, Pearson wrote: \"No one since the time of Tom Paine has had so definite an influence on the social and political life of his time and country as Bernard Shaw.\""]}, {"page": "Hugh Gaitskell", "response": ["In 1927–28 Gaitskell lectured in economics for the Workers' Educational Association to miners in Nottinghamshire. His essay on Chartism was published as a WEA booklet in 1928. This was his first experience of interaction with the working class.Campbell 2010, p198 Gaitskell eventually came to oppose both Cole's Guild Socialism and Syndicalism and to feel that the General Strike had been the last failed spasm of a strategy - attempting to seize power through direct trade union action - which had already been tried in the abortive Triple Alliance Strike of 1921. It is unclear whether Gaitskell was ever sympathetic to Oswald Mosley, then seen as a future leader of the Labour Party. Gaitskell's wife later insisted that he never had been, but Margaret Cole, Evan Durbin's wife and Noel Hall believed that he was, although as an opponent of factional splits he was not tempted to join Mosley's New Party in 1931.Williams 1985, p43"]}, {"page": "Beatrice Webb", "response": ["*Our Partnership by Beatrice Webb (1948), Longmans, Green & Co: London, New York, edited by Barbara Drake & Margaret Cole at the request of Sidney Webb. Covers the period from 1892 up to 1911.", "*\"The Diary of Beatrice Webb, 1873–1943\", complete typescript and manuscript on microfiche, and Index to the Diary of Beatrice Webb 1873-1943 with preface by Matthew Anderson, \"The text of the Diary\" by Geoffrey Allen, \"Historical Introduction\" by Dame Margaret Cole DBE, \"The Diary as Literature\" by Norman Mackenzie, Chronology. (1978), Chadwyck-Healey Ltd. Bishops Stortford "]}, {"page": "List of years in literature", "response": ["*1931 in literature – Ilf and Petrov's The Little Golden Calf; Pearl S. Buck's The Good Earth; Georges Simenon's The Strange Case of Peter the Lett (first Jules Maigret novel); Agatha Christie's The Sittaford Mystery; The Floating Admiral (collaborative novel by 13 writers of the Detection Club: Victor Whitechurch, G. D. H. Cole and Margaret Cole, Henry Wade, Agatha Christie, John Rhode, Milward Kennedy, Dorothy L. Sayers, Ronald Knox, Freeman Wills Crofts, Edgar Jepson, Clemence Dane and Anthony Berkeley. Prologue written by G. K. Chesterton.);Charles Osborne, The Life and Crimes of Agatha Christie, London, 1982. H. P. Lovecraft's The Whisperer in Darkness"]}, {"page": "1980 in literature", "response": ["*May 7 – Margaret Cole, English political writer, biographer and activist (born 1893)"]}, {"page": "1893 in literature", "response": ["*May 6 – Margaret Cole (Margaret Postgate), English political writer, biographer and activist (died 1980)"]}, {"page": "The Floating Admiral", "response": ["The Floating Admiral is a collaborative detective novel written by fourteen members of the Detection Club in 1931.  The twelve chapters of the story were each written by a different author, in the following sequence: Canon Victor Whitechurch, G. D. H. Cole and Margaret Cole, Henry Wade, Agatha Christie, John Rhode, Milward Kennedy,  Dorothy L. Sayers, Ronald Knox, Freeman Wills Crofts, Edgar Jepson, Clemence Dane and Anthony Berkeley. G. K. Chesterton contributed a Prologue, which was written after the novel had been completed.Charles Osborne, The Life and Crimes of Agatha Christie, London, 1982."]}, {"page": "G. D. H. Cole", "response": ["Cole wrote at least seven books for the Left Book Club, all of which were published by Victor Gollancz Ltd. They are marked with LBC in the list of his books given below. He and his wife, Margaret Cole, together wrote 29 popular detective stories,Marc Stears, ‘Cole , Dame Margaret Isabel (1893–1980)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 7 May 2017 featuring the investigators Superintendent Wilson, Everard Blatchington and Dr. Tancred. Cole and his wife created a partnership but not a marriage. Cole took little interest in sex and he regarded women as a distraction for men. Margaret documented that comprehensively in a biography she wrote of her husband after his death.", "* The Intelligent Man's Review of Europe Today (1933) [with Margaret Cole]", "* The Condition of Britain (Left Book Club, 1937) [with Margaret Cole]", "====G D H and Margaret Cole====", "* Margaret Cole, The Life of G. D. H. Cole, Macmillan/St. Martin's (1971) "]}, {"page": "Police procedural", "response": ["It is difficult to disentangle the early roots of the procedural from its forebear, the traditional detective novel, which often featured a police officer as protagonist. By and large, the better known novelists such as Ngaio Marsh produced work that falls more squarely into the province of the traditional or \"cozy\" detective novel. Nevertheless, some of the work of authors less well known today, like Freeman Wills Crofts's novels about Inspector French or some of the work of the prolific team of G.D.H. and Margaret Cole, might be considered as the antecedents of today's police procedural. British mystery novelist and critic Julian Symons, in his 1972 history of crime fiction, Bloody Murder, labeled these proto-procedurals \"humdrums,\" because of their emphasis on the plodding nature of the investigators."]}, {"page": "Margaret Postgate", "response": ["#redirectMargaret Cole"]}, {"page": "John Percival Postgate", "response": ["He married his graduate student Edith Allen and they had six children among whom were Raymond Postgate (a journalist, historian, novelist and food writer), and Margaret Cole (a Fabian politician); he was grandfather to the animator and puppeteer Oliver Postgate, and the microbiologist John Postgate FRS (1922–2014), "]}, {"page": "Detection Club", "response": ["The Detection Club was formed in 1930 by a group of British mystery writers, including Agatha Christie, Dorothy L. Sayers, Ronald Knox, Freeman Wills Crofts, Arthur Morrison, Hugh Walpole, John Rhode, Jessie Rickard, Baroness Emma Orczy, R. Austin Freeman, G. D. H. Cole, Margaret Cole, E. C. Bentley, Henry Wade, Constance Lindsay Taylor and H. C. Bailey. Anthony Berkeley was instrumental in setting up the club, and the first president was G. K. Chesterton. There was a fanciful initiation ritual with an oath probably written by either Chesterton or Sayers, and the club held regular dinner meetings in London."]}]}}