{"wiki_id": "http://www.wikidata.org/entity/Q6758040", "itemLabel": "Marcus Bignot", "itemDescription": "English footballer (born 1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Marcus_Bignot", "wikipedia_page": {"main": "Marcus Bignot (born 22 August 1974) is an English football manager and former professional player. He is currently joint manager of National League North side Guiseley and assistant coach of the England U19s.\nBignot's playing career spanned nearly 20 years, primarily as a right back, but he has also been used in a midfield role. He began his career at Telford United in 1992 where he spent 4 years in the Football Conference there. He then joined Kidderminster Harriers, he was part of the team that won the Conference League Cup, also in the 1996–97 season the \"Harriers\" came runners-up in the Football Conference. First Division side Crewe Alexandra paid 100K for him in the summer of 1997, he went on to be the player of the year in the 1997–98 season. Contractual disputes ended with a switch to Second Division side Bristol Rovers taking him on a free transfer for the 2000–2001 season. Management change made way for a move to First Division side Queens Park Rangers in March 2001 under his previous manager. A successful 2-year spell at Rushden & Diamonds where he helped them gain promotion to the Second Division in the 2002–03 season as Champions. A move back to QPR in March 2004 where he helped them gain promotion to the Championship. Further spells at Millwall, Oldham Athletic before ending his playing career in 2012 at Solihull Moors.\nA former England semi-pro  international, he was capped in May 1997 for the England C national football team against the Scottish Highland Football League at Cove Rangers FC, near Aberdeen, where the England C Team won 5-0, with Lee Hughes, a team mate of Bignot's with Kidderminster at that time, and Barry Hayles of Stevenage, both to go on to play in the Premier League, in the England C team that Saturday afternoon in the North of Scotland.\nBignot enjoyed a successful 7 year management career, when he took over at Birmingham City Ladies from 1998, winning the Midland Combination League, AXA Northern Premier League and Runners-up of the FA Women's Premier League Cup. Bignot having managed Solihull Moors for 5 years, he got them promoted as champions of the National League North and the Birmingham Senior Cup champions in 2016, for the first time in their entire history.", "link_mentions": [{"page": "Rushden & Diamonds F.C.", "response": ["The 2003–04 season in Division Two proved to be one of difficulty for Rushden & Diamonds. Despite a promising early start, a run of bad results over the winter period saw the club slip down the table, and in March 2004 Brian Talbot left the club after seven years as manager. The transfer window saw star players Paul Underwood, Onandi Lowe, Paul Hall and Marcus Bignot all depart as off the pitch problems mounted, and the club severely struggled for the remainder of the season. Barry Hunter took over as caretaker player-manager but they were relegated in 22nd place after losing their last three games of the season."]}, {"page": "Grimsby Town F.C.", "response": ["After promotion, manager, Paul Hurst, released a number of players, many of whom were pivotal to the previous season's promotion push. On 24 October 2016, Paul Hurst was appointed as Shrewsbury Town manager, Chris Doig also left Grimsby and made Hurst's assistant at Shrewsbury, thus leaving Dave Moore and Stuart Watkiss as caretaker managers. On 7 November 2016, Marcus Bignot, then manager of non-League side, Solihull Moors, was officially announced as the new Grimsby Town manager, along with the appointment of Micky Moore as his assistant. During the January Transfer Window, Bignot brought in a total of 6 players permanently, including Solihull Moors midfielder, Jamey Osborne, and Gateshead midfielder, Sam Jones. Omar Bogle, Grimsby's top scorer at that point in the season, left the club for Wigan Athletic. On 10 April 2017, Marcus Bignot was relieved of his duties from the club. His replacement was Russell Slade, who joined the club for the second time as manager on 12 April 2017. Slade's assistant was former Grimsby player, Paul Wilkinson. The Mariners would finish 14th, with a total of 62 points.  Slade was sacked on 11 February 2018 after seeing the team fail to win in 12 league games, with eight losses, he left the team 17th in League Two. Paul Wilkinson took over as caretaker manager following the sacking. During this time, Grimsby faced further defeats against Cambridge United and Exeter City. Michael Jolley was appointed as the new manager on 2 March 2018 and twice secured Grimsby's Football League status as well as securing cup runs that culminated in an FA Cup tie away at Crystal Palace and a League Cup tie at Chelsea. Jolley left the club by mutual agreement and was replaced on a temporary basis by assistant manager Anthony Limbrick.", "| Marcus Bignot"]}, {"page": "Danny Collins (footballer)", "response": ["Having been a free agent for over a month, Collins was snapped up by League Two side Grimsby Town on 12 September 2016 on a 6-month contract. He made his full debut with Grimsby on 24 September 2016, in their 1–0 win at Mansfield Town. He scored his first goal for the club on 19 November 2016 from a corner, he placed a header from close range to take the lead in their 3–0 victory at Plymouth Argyle. Having been ever-present under Paul Hurst and new manager Marcus Bignot, Collins agreed to extend his contract until the end of the season."]}, {"page": "Birmingham City W.F.C.", "response": ["The club's high-profile manager of the time, Marcus Bignot, signed big name players including Rachel Yankey and Alex Scott for the 2004–05 season and Birmingham finished fourth. The club ran into financial problems when Karren Brady of Birmingham City's men reneged on a letter of intent to provide funding. The female club had to let major players go before the start of the 2005–06 season, which they finished in sixth position. They were only able to continue after a player's parent donated £10,000.", "* Coach: Marcus Bignot"]}, {"page": "Emma Byrne", "response": ["She previously worked in the Football Association of Ireland (FAI) ticket office and was later employed as a coach in Arsenal's academy. She married former professional footballer Marcus Bignot in June 2013. Emma and Marcus Bignot have since divorced."]}, {"page": "Ray Jones (footballer, born 1988)", "response": ["Jones had his first professional start on 12 August 2006, in a 2–0 win over Southend United at Loftus Road. He assisted Nick Ward's goal in the 41st minute, which gave QPR their first win of the new season. Brian Glanville of The Sunday Times opined that Jones and fellow youngster Dexter Blackstock combined in the forward line \"as though they had been playing together for years\". Ten days later in the second round of the Football League Cup at home to Northampton Town, Jones came on for Marc Bircham in the 84th minute, and three minutes later headed Marcus Bignot's cross for his first career goal, winning the match 3–2."]}, {"page": "Keith Bertschin", "response": ["Bertschin replaced Marcus Bignot as manager of Solihull Moors on 9 November 2016."]}, {"page": "Eniola Aluko", "response": ["Aluko started her career at Leafield Athletic Ladies and subsequently played for Birmingham City Ladies' youth team under manager Marcus Bignot with future England teammate, Karen Carney. She scored on her Birmingham team debut against Leeds United, aged 14."]}, {"page": "Gary Roberts (footballer, born 1987)", "response": ["Roberts signed with National League North club Southport in July 2017, who were managed by former Floriana boss Alan Lewer. He scored four goals in 14 matches for the \"Sandgrounders\", before his contract was cancelled by mutual consent in December 2017. On 9 January 2018, he signed a short-term contract with his hometown club, Chester, who were playing in the National League. Mark Maguire, CEO of the \"Seals\", said that: \"What happens next will be largely down to Gary and will either be seen as a stroke of genius or madness. It certainly won't be boring!\". Roberts was sent off ten minutes into his debut in an FA Trophy loss at East Thurrock United, leaving him with a three-game suspension, though the club's Community Trust and Exiles supporters group stepped in to fund his wages for another month after the expiry of his initial contract. Chester were relegated at the end of the 2017–18 season, though Roberts said that departing manager Marcus Bignot was \"one of the best, if not the best manager I've worked under\". Roberts scored four goals in 34 National League North appearances in the 2018–19 season. He had aimed to help the club reach the play-offs after signing a one-year contract at the start of the campaign, though they ended up finishing two places and three points short of this target."]}]}}