{"wiki_id": "http://www.wikidata.org/entity/Q6759960", "itemLabel": "Margaret Thomas", "itemDescription": "Australian writer, painter and sculptor (1842–1929)", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaret_Thomas", "wikipedia_page": {"main": "Margaret Thomas (23 December 1842 – 24 December 1929) was an English-born Australian travel writer, poet and artist. Thomas was born at Croydon, Surrey, England, daughter of Thomas Cook, shipowner. Her date of birth is often cited incorrectly as 1843 and she was herself inconsistent about both her age and date of birth. It has also been discovered that she was originally named Margaret Cook and only later changed her surname to her father's first name.", "link_mentions": [{"page": "New English Art Club", "response": ["*Margaret Thomas"]}, {"page": "List of Australian artists", "response": ["* Margaret Thomas (1842–1929): English-born Australian travel writer, poet and artist"]}, {"page": "Douglas Sladen", "response": ["Educated at Temple Grove School, East Sheen,Current Opinion, vol. 6 (1891), p. 23 Cheltenham College, and Trinity College, Oxford, in 1879 Sladen migrated to Australia, where he became the first professor of history in the new University of Sydney.  Subsequently he traveled much and settled in London as a writer.  Poems by Margaret Thomas were included in a work in the 1880s."]}, {"page": "Charles Summers", "response": ["Summers was a regular exhibitor at Royal Academy exhibitions; more than 40 of his works were shown between 1849 and 1876. He was a competent sculptor in a dull and uninspiring period of English art, and comparatively little of his work has lasting qualities. His 'Burke and Wills group' at Melbourne is a sound and dignified piece of work, his frieze of putti on the old Bank of New South Wales building, now in the University of Melbourne grounds, is charming, and the recumbent figure of Lady Macleay at Godstone, Surrey, is also meritorious. Personally Summers was modest, and his willingness to see ability in the work of other artists was a good influence in the early time of art in Victoria. Several examples of his work together with his portrait of Margaret Thomas are in the historical collection at the National Gallery of Victoria, Melbourne. Summers is also represented in the Adelaide gallery and at the Mitchell Library, Sydney. Summers married when a young man; his son, Charles Francis Summers, who survived him, was also a sculptor.", "* NGV: Portrait of the artist as hero: Margaret Thomas’s portraits of Charles Summers"]}, {"page": "Thomas (surname)", "response": ["*Margaret Thomas (disambiguation), multiple people", "**Margaret Thomas (1842–1929), British-born Australian travel writer, poet and artist", "**Margaret Thomas (hymnwriter) (born 1779), Welsh hymnwriter", "**Margaret Thomas (painter) (1916–2016), British artist", "**Margaret Thomas (sport shooter) (born 1953), British sport shooter"]}, {"page": "Ingram Collection of Modern British Art", "response": ["*Margaret Thomas"]}, {"page": "English Female Artists", "response": ["Maria Burt, Grace Cruickshank, Annie Dixon, Charlotte Grace Dixon, Ellen Hill, Ellen Montalba, Margaret Tekusch, Margaret Thomas"]}, {"page": "List of Australian women artists", "response": ["*Margaret Thomas (1842–1929), painter, writer"]}, {"page": "List of Australian women writers", "response": ["*Margaret Thomas (1843–1929), travel writer, poet and artist"]}, {"page": "Margaret Thomas (painter)", "response": ["Margaret Thomas (26 September 1916 – 27 March 2016) was a British painter. She is remembered in particular for her still lifes and her flower paintings which received considerable acclaim, and are in numerous UK public collections.", "Thomas was born in London, England on 26 September 1916.  When she was 12 years old she was introduced to Ethel Walker, and other women artists, by her governess.  Thomas would later exhibit pieces in the same shows as Walker.  In 1934 Thomas began her studies at Sidcup School of Art. She continued, having won a scholarship, at the Slade School of Fine Art in London. For her final year, she studied at the Royal Academy Schools under Thomas Monnington and Ernest Jackson. Her works were being noticed as early as 1938: commenting on an exhibition of The Women Artists, The Observer noted that \"most of the outstanding pieces are contributed by the non-members such as ... 'Flu' by Margaret Thomas ...\"", "*Works by Margaret Thomas on Artnet"]}, {"page": "Margaret Thomas (disambiguation)", "response": ["Margaret Thomas (1842–1929) was an English-born Australian travel writer, poet and artist.", "Margaret Thomas may also refer to:", "*Margaret Murie (1902–2003), American conservationist born Margaret Thomas", "*Margaret Thomas (hymnwriter) (born 1779), Welsh hymnwriter", "*Margaret Thomas (painter) (1916–2016), British artist", "*Margaret Thomas (sport shooter) (born 1953), British sport shooter", "*Margaret Thomas-Neale (born 1931), British gymnast"]}, {"page": "List of bazaars and souks", "response": ["File:Syria THE FRUIT BAZAAR. DAMASCUS. 1908. Old Vintage Color Print..JPG|The Fruit Bazaar, Damascus, painting by Margaret Thomas and reproduced in John E. Kelman, From Damascus to Palmyra, 1908"]}, {"page": "List of women writers (M–Z)", "response": ["*Margaret Thomas (1843–1929, Australia), travel wr., poet & artist"]}]}}