{"wiki_id": "http://www.wikidata.org/entity/Q6755936", "itemLabel": "Marc Vaux", "itemDescription": "(1932 - ) British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Marc_Vaux", "wikipedia_page": {"main": "Marc Vaux (born 29 November 1932, Swindon) is a British artist who rose to prominence in the 1960s. His work was included in the seminal Situation exhibition of 1960 alongside Robyn Denny, William Turnbull and Bernard Cohen among others. This exhibition was a direct reaction by British abstract artists to the recent exhibitions in London of the American Abstract Expressionists in particular the Tate's 1959 exhibition The New American Painting.  Although originally headed for a career in Chemistry, Vaux eventually studied at the Slade School of Fine Art from 1957 to 1960 where he was awarded a Boise traveling scholarship which allowed him to travel in Italy, and later to work at the Jean Ponsa lithographic printing studio in Paris.\nIn 1986, after a long teaching career he was appointed Head of Painting at the Central/St Martins College of Art and Design in London where he stayed until he retired in 1989 to concentrate full-time on painting.\nVaux's work has variously been described as minimalist and constructivist although since his primary interest is in colour and light he has more in common with the American west coast artists than the New York minimalists.\nMarc Vaux said: It [colour] is known to have a direct effect upon the central nervous system/human sensibility, arguably the most effective modifiers of human response, over sound and touch. It is dynamic - dependent on degree of colour, light, surrounding colours. Given the facts it is surprising it has taken so long to come to the position of recognising the effective power of colour alone – the endless potential of colour alone to communicate, affect and modify response.. it can be a pure visual experience equivalent to any other (experience). The nearest equivalent would be the sound of music. I see no reason why colour can't equate with melody and be as memorable. After all Albers wrote poems to equate with his paintings.A monograph Marc Vaux was written by Vaux's long term supporter Norbert Lynton and published by 21 Publishing in 2005 (ISBN 1872784313).\nThe Tate Gallery holds a good collection of Vaux's work from 1959 to the present day.Vaux's first commercial gallery exhibition was at the Grabowski Gallery in London with his then wife Tess Jaray. He was subsequently represented by the Axiom Gallery, Anderson O'Day and then the Redfern Gallery, since 1998 Marc Vaux has been represented by the London art dealer Bernard Jacobson and has had regular exhibitions there.", "link_mentions": [{"page": "November 29", "response": ["*  1932   – Marc Vaux, English painter"]}, {"page": "List of British painters", "response": ["*Marc Vaux (born 1932)"]}, {"page": "List of modern artists", "response": ["*Marc Vaux"]}, {"page": "List of contemporary artists", "response": ["*Marc Vaux (born 1932), conceptual, painter, sculptor"]}, {"page": "Vaux", "response": ["*Marc Vaux (born 1932), British artist who rose to prominence in the 1960s"]}, {"page": "List of British artists", "response": ["* Marc Vaux (born 1932)"]}, {"page": "Jasia Reichardt", "response": ["* Marc Vaux/Tess Jaray. London: Grabowski Gallery. 1963. ASIN: B0016702SG"]}, {"page": "Jorge Lewinski", "response": ["In 1966, having developed a name for himself through the portraiture of artists, he became the pre-eminent photographer of artists in Britain. Subjects included Francis Bacon, LS Lowry, David Hockney, Henry Moore, Marcel Duchamp, Peter Blake, Pauline Boty, Gilbert and George, Barbara Hepworth, Barry Kay, William Pye, Bill Redgrave, Peter Lanyon, Marc Vaux, Albert Irvin, Maggi Hambling, Kenneth Martin, Sean Scully, Bridget Riley, Reg Butler, Anthony Gormley, Julian Trevelyan, Sheila Fell, Allen Jones, Richard Wilson, and more."]}, {"page": "Eric Butcher", "response": ["For the Material Witness exhibition at Toomey Tourell gallery in 2010, Butcher exhibited fourteen of his painted aluminium extrusions.Baker, Kenneth (March 13, 2010). “Butcher Shines at Toomey Tourell”. San Francisco Chronicle, p.E-1. Hung vertically and spaced asymmetrically with a measured and careful distance between one another, the display articulated Butcher's increasing awareness of, and preoccupation with, ‘installation’ in creating a total cohesive experience rather than an isolated object. As Kenneth Baker, in his San Francisco Chronicle review, wrote of the work's interaction with the space it occupied, ‘to walk this piece is to compose and recompose it through observation. Its geometry and built-in illusionism dictate that it cannot be seen whole’. This can also be said of Butcher's curatorial practice, where, as in the Definite Article exhibition curated by the artist himself,”Definite Article, Objects and Surfaces, Eric Butcher”, p.3. Vertigo Gallery, London, . he deals with the scale and arrangement of works by Roger Ackling, Marc Vaux and Cathy Wade, as well as his own. Butcher's attempts within his own works in that exhibition to, ‘engage the space around the painted surface’ were similarly factors that he encountered in his curation of the exhibition as a whole, ‘each of the artists… employs a range of techniques to encourage the viewer to engage with the work physically’.", "Eric Butcher has participated in many group shows including \"The Waterlilly Foundation\", Cambridge Guildhall (1994), \"The Genitals Are Beauty\", The House of William Blake, London (1995), \"The Art Experience\", The Atrium Gallery, London (1997), \"Wall to Wall\", Sarah Myerscough Fine Art, London (2002), \"Paperwork\" and \"30 x 30\", Vertigo Gallery, London (2003), \"Surface\", Vertigo Gallery (2004), the touring exhibition \"Definite Article\" with Roger Ackling, Marc Vaux and Cathy Wade, Vertigo gallery, London and Toomey-Tourell gallery, San Francisco, USA (2005/6), \"Meeting Place - Contemporary Art and the Museum Collection\", Russell-Cotes Art Gallery & Museum, Bournemouth and the Arts Institute at Bournemouth (curated by Stephanie James & Jackie Serafopoulos) (2007), \"Underground\", Shoreditch Town Hall basement, London (three-person with Roger Ackling and Simón Granell) (2007), \"Ten\", Toomey-Tourell gallery, San Francisco, USA (2008), \"Über Flächen\", Galerie Robert Drees, Hannover, Germany (2010), \"Raw\", Pertwee, Anderson & Gold, London, (2011), \"Beyond the Commission\", The Gallery, Arts University College Bournemouth (2011), \"One Thing Leads to Another\", Portland House, Malvern (2011), \"The Devil Finds Work for Idle Hands\", Toomey-Tourell gallery, San Francisco, USA (2012), \"ReGroup\", Red Space, London (2012)."]}, {"page": "Margarete Lauter", "response": ["The first gallery space was located in Mannheim, Bismarckstrasse at the square L 15, 7–9, near the main train station, from 1963 to 1967. Today's city plan of Mannheim is based on a horseshoe-shaped grid of squares referring to Mannheim Castle, starting with A 1 and ending with U 16. The planning of this network goes back to Elector Frederick IV of the Palatinate from 1606 and has been preserved until today. This unique structure can only be compared to the later founding of Manhattan. Galerie Margarete Lauter opened on November 21, 1963, with an exhibition that took place in close collaboration with the Galerie Paul Facchetti, Paris, presenting works of the artists Ger Lataster, Ung-No Lee, Georges Noël, Rudi Baerwind, and Zoltan Kemeny, and objects of traditional African art. The guests were welcomed at the opening of the exhibition by the mayor of the city of Mannheim and friend of Margarete Lauter, Hans Reschke. Dietrich Mahlow, director of the Kunsthalle Baden-Baden, made an introduction to the exhibition. Paul Facchetti from Paris in conversation with the artist Rudi Baerwind. Heinz Fuchs, director of the Kunsthalle Mannheim, a friend of the Lauter family for a long time, chats with the artists. In other exhibitions Lauter has shown works by: Uwe Lausen (1964–1965), Magie du banal (1965),The exhibition Magie im Alltag / Magie du banal: with works by Royston Adzak, François Arnal, Eduardo Arroyo, Victor Brauner, René Bro, Aristide Caillaud, Dado, François Dufrêne, Yolande Fièvre, Peter Foldes, Klaus Geissler, Domenico Gnoli, Habbah, Horst Egon Kalinowski, Peter Klasen, Harry Kramer, Michel Lablais, Maurice Lemaître, Pavlos (Pavlos Dionyssopoulos), Jean-Claude Quilici, Bernard Rancillac, Robert Rauschenberg, Martial Raysse, Antonio Recalcati, Niki de Saint-Phalle, Peter Saul, Bernard Schultze, Ursula Schultze-Bluhm, Harold Stevenson, Jacques de la Villeglé has been realised in collaboration with Rudi Baerwind, Claude Rivière, Wolfgang Sauré and Gerald Gassiot-Talabot as well as with the support of the galleries Iris Clert, Galerie Breteau, Alexandre Iolas, Galerie «J», Claude Levin, André Schoeller and Galerie Stadler all from Paris. It was a demonstration of young international contemporary art in Germany long before the first Art Fair took place in Germany and Switzerland and many of the artists shown here exhibited only later in Documenta Kassel and Biennale di Venezia. Zoran Antonio Mušič (1965), Natalia Dumitresco (1965, 1971), Rudi Baerwind and Georges Noël (1965), Pierre Clerc (1965–1966) together with art and cult objects from Africa (1965–1966, 1968), Syn: Bernd Berner, Rolf Gunter Dienst, Klaus Jürgen-Fischer, Eduard Micus, Marc Vaux (1966), Alexandre Istrati (1966, 1975), Karl Fred Dahmen (1966, 1969, 1972) Luciano Lattanzi and Werner Schreib (1966, 1974, 1988), Divergenzen 66: Otmar Alt, Francisco Cuadrado, Jean-Luc Guerin, Dieter Krieg, Jobst Meyer, Manfred Mohr, Walter Montel, , Marcel Robelin, Georg Meistermann (1967), Jaroslav Serpan (1967)."]}]}}