{"wiki_id": "http://www.wikidata.org/entity/Q6759357", "itemLabel": "Margaret Dryburgh", "itemDescription": "Teacher, Nurse and Missionary", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaret_Dryburgh", "wikipedia_page": {"main": "Margaret Dryburgh (24 February 1890 – 21 April 1945) was an English teacher and missionary. Born in Sunderland, England, she later became a missionary in Singapore, where she was captured in the Second World War. The plight of Dryburgh and her fellow inmates such as Betty Jeffrey in a Japanese prisoner of war camp inspired the 1996 film Paradise Road. She wrote The Captives' Hymn while imprisoned.", "link_mentions": [{"page": "A Town Like Alice", "response": ["*Margaret Dryburgh – an English missionary held captive by the Japanese in World War II"]}, {"page": "Vivian Bullwinkel", "response": ["Bullwinkel was reunited with survivors of the Vyner Brooke. She told them of the massacre, but none spoke of it again until after the war lest it put Bullwinkel, as witness to the massacre, in danger. Bullwinkel spent three and half years in captivity, together with Betty Jeffrey, Wilma Oram and Margaret Dryburgh; Dryburgh, the eldest, died in captivity around the age of 55. Another surviving nurse was Pat Darling, who died in 2007.Sydney Morning Herald, 12 December 2007"]}, {"page": "Index of Singapore-related articles", "response": ["* Margaret Dryburgh"]}, {"page": "Paradise Road (1997 film)", "response": ["Paradise Road is a 1997 Australian war film that tells the story of a group of English, American, Dutch and Australian women who are imprisoned by the Japanese in Sumatra during World War II. It was directed by Bruce Beresford and stars Glenn Close as Adrienne Pargiter, (based on Norah Chambers), Frances McDormand as the brash Dr. Verstak, Pauline Collins as missionary Margaret Drummond (based on missionary Margaret Dryburgh), Julianna Margulies as U.S. socialite Topsy Merritt, Jennifer Ehle as British doyenne and model Rosemary Leighton Jones, Cate Blanchett as Australian nurse Susan McCarthy and Elizabeth Spriggs as dowager Imogene Roberts.", "* Pauline Collins as Daisy \"Margaret Drummond (based on Margaret Dryburgh)"]}, {"page": "Betty Jeffrey", "response": [".  Margaret Dryburgh, Vivian Bullwinkel and Wilma Oram were fellow internees with Jeffrey."]}, {"page": "Swalwell", "response": ["*Margaret Dryburgh – a school teacher and missionary who was interned by the Japanese in World War II"]}, {"page": "Angels of Bataan", "response": ["*Margaret Dryburgh (UK nurse and missionary imprisoned in Singapore, author of \"The Captive's Hymn\")"]}, {"page": "Peninsula Women's Chorus", "response": ["When Mrs Rawlins left in 1975, the members, by then increased to over 50, appointed 25-year-old Patricia (Patty) Hennings as their new director. Under her leadership the choir, soon rechristened the Peninsula Women's Chorus to emphasize its inclusive recruiting policy (though it maintained an association with Foothill College), continued to increase its standards, andPeninsula Women's Chorus Turns 40!  Palo Alto CA, Peninsula Women's Chorus newsletter (Fall 2006) in 1982 was selected by Stanford University for a project to record vocal scores written from memory in a Second World War prison camp on Sumatra by Margaret Dryburgh and Norah Chambers, as recorded in the TV documentary Song of Survival.Roger Emanuels Song of Survival KUSP Review, vol.4, no.5 (Dec. 1983) This was such a success that the Chorus performed in Europe in 1984."]}, {"page": "Dryburgh (surname)", "response": ["*Margaret Dryburgh (1890–1945), missionary"]}, {"page": "Women's Vocal Orchestra of Sumatra", "response": ["The Women's Vocal Orchestra came into being because of the collaborative efforts of Margaret Dryburgh and Norah Chambers. Chambers served as primary conductor for the Vocal Orchestra.Betty Jeffrey, White Coolies. (Sydney: Angus and Robertson, 1954), 86.  Prior to life in the camp, Chambers attended school at the Royal Academy of Music in London.  At the school, she played in the orchestra and learned many of the skills which enabled her to arrange the pieces of music for 4-part women's chorus.Helen Colijn, Song of Survival: Women Interred. (Ashland, OR: White Cloud Press, 1995), 134.  She is also credited with the idea for performing and learning pieces originally scored for piano and orchestra.Helen Colijn, Song of Survival: Women Interred, (Ashland, OR: White Cloud Press, (1995), 144.", "While Chambers acted as arranger and conductor, Margaret Dryburgh, a missionary POW, would write down the piano and orchestral scores from memory.Andy Priestner, \"The History of the Vocal Orchestra\", www.singingtosurvive.com, accessed November 2014.  It is not inherently clear where Dryburgh obtained the ability to recall large works from memory. She studied piano as a small child and received a Bachelor of Arts at Newcastle College, then a part of Durham University. She also spent a great deal of time teaching music to small churches during the course of her missionary work.Helen Colijn, Song of Survival: Women Interred, (Ashland, OR: White Cloud Press, (1995), 199.", "The music has been performed by numerous choirs across the world. Most recently, in October 2013 a 70th anniversary concert was performed by a British choir. The concert also featured accounts of the lives of Norah Chambers and Margaret Dryburgh. Another similar concert featuring of the Women's Vocal Orchestra of Sumatra featured Peninsula's Women's Chorus conducted by Patricia Hennings in 1985.Patricia F. Hennings, \"'Song of Survival': Performing Instrumental Music Vocally,\" The Choral Journal 27 (1987), 26."]}, {"page": "Norah Chambers", "response": ["Chambers married engineer John Lawrence Chambers in 1930 Malaya and they had a daughter Sally in 1933. She taught violin locally. After the Japanese invasion, Chambers travelled for five days through the jungle from Malaya to Singapore and succeeded in getting her daughter evacuated to Perth in Australia. She was also evacuated but the Vyner Brooke, her ship, was bombed and destroyed. She was interned in a Japanese prisoner of war camp, her husband sent to another. In 1943 she founded a vocal orchestra with Margaret Dryburgh, writing out the music from memory. Chambers was reunited with her family and returned to Malaya. She retired in 1952 to Jersey where she composed music for, and directed the St. Mark's Church choir in St. Helier. After the war the music produced in the camps was performed widely. Her work and time in the camp was the inspiration for the film Paradise Road."]}]}}