{"wiki_id": "http://www.wikidata.org/entity/Q675591", "itemLabel": "Eric Bristow", "itemDescription": "English darts player", "wikipedia_url": "https://en.wikipedia.org/wiki/Eric_Bristow", "wikipedia_page": {"main": "Eric John Bristow,  (25 April 1957 – 5 April 2018), nicknamed \"The Crafty Cockney\", was an English professional darts player.\nHe was ranked World No. 1 by the World Darts Federation a record five times, in 1980, 1981 and 1983–1985. He was a five-time World Champion, a five-time World Masters Champion a four-time World Cup singles champion and 2-time champion of the News of the World Darts Championship. He won 22 WDF and BDO Major titles, he won 62 individual career titles, added to 20 titles in team events, winning 82 overall. In the 1980s, Bristow's skill and personality helped turn darts into a worldwide spectator sport.\nIn 1993, Bristow was one of sixteen top players who broke away from the British Darts Organisation (BDO) to form their own organisation, which became the Professional Darts Corporation (PDC).\nHe retired from competitive darts in 2007 and subsequently worked as a commentator and pundit on Sky Sports darts coverage.", "link_mentions": [{"page": "1957", "response": ["** Eric Bristow, English darts player (d. 2018)"]}, {"page": "Cockney", "response": ["*Eric Bristow, darts champion, born in Hackney, nicknamed the \"Crafty Cockney\""]}, {"page": "2018", "response": ["** Eric Bristow, English darts player (b. 1957)"]}, {"page": "Stoke Newington", "response": ["* Eric Bristow (1957–2018), five times world professional darts champion—born in Stoke Newington and lived at 97 Milton Grove."]}, {"page": "Leek, Staffordshire", "response": ["Amongst sports people associated with the town, the best known person is former five-time world professional darts champion Eric BristowEric Bristow's profile and stats on Darts Database retrieved 6 March 2018 who used to live in the town. Anna Watkins, British Rowing, Profile retrieved 6 March 2018 born in Leek, won a gold medal for rowing in the 2012 Olympics. Footballer Arthur Hulme (1877–1916) Playing record: Arthur Hulme, Swindon-Town-FC.co.uk retrieved 6 March 2018 was born in Leek. Former England test cricketer Kim Barnett ESPN cricinfo Database retrieved 6 March 2018 was born and lives in Leek."]}, {"page": "Culture of the United Kingdom", "response": ["A great number of major sports originated in the United Kingdom, including association football, golf, tennis, boxing, rugby league, rugby union, cricket, field hockey, snooker, darts, billiards, squash, curling and badminton, all of which are popular in Britain. Another sport invented in the UK was baseball, and its early form rounders is popular among children in Britain.Rounders (English game) Britannica Online Encyclopedia Snooker and darts are popular indoor games: Stephen Hendry is the seven time world snooker champion, Phil Taylor is the 16 time world darts champion. Snooker player Alex Higgins (nicknamed The Hurricane) and darts player Eric Bristow (nicknamed The Crafty Cockney) are credited with popularising each sport."]}, {"page": "List of sports announcers", "response": ["* Eric Bristow – ITV Sport 1999, Sky Sports 1993–2016"]}, {"page": "Darts", "response": ["| Eric Bristow (1)", "| Eric Bristow (2)", "| Eric Bristow (3)", "| Eric Bristow (4)", "| Eric Bristow (5)", ": 5 Eric Bristow The Crafty Cockney"]}, {"page": "Phil Taylor (darts player)", "response": ["Taylor was born to Doug and Liz Taylor on 13 August 1960 in Burslem, Stoke-on-Trent. He left school at the age of 16, and after holding a few jobs including as a sheet metal worker, he would spend most of his early working days making ceramic toilet roll handles, for which he earned £52 a week.  Although he liked to play darts and football as a child, he never took up the games seriously until 1986 when he moved into a terraced house in Burslem, living near to Eric Bristow's pub the Crafty Cockney.", "Taylor's first title came at the Canadian Open in 1988, defeating then World Champion Bob Anderson in the final. After reaching the quarter-final of the British Open and the semi-final of the Winmau World Masters in 1989, he qualified for the World Championship for the first time in 1990. Although he had achieved some success in Open events, he went into the 1990 World Championship as a 125–1 unseeded outsider. He beat number six seed Russell Stewart 3–1 in the first round, Dennis Hickling 3–0 in the second round, Ronnie Sharp 4–2 in the quarter finals and Cliff Lazarenko 5–0 to reach the final. He would then meet his mentor, Eric Bristow.", "The finals of 1996, 1997 and 1998 would all feature Taylor and Priestley in a repeat of the inaugural final in 1994. Priestley achieved the first 100 average in a final in 1996 but still lost 6–4. The 1997 final saw Taylor recover from 0–2 down to win the title 6–3, and the 1998 final saw Taylor lose just two legs in the entire match en route to a 6–0 win and an average of 103.98. Taylor's victory and sixth title in 1998 meant that he had surpassed his mentor Eric Bristow's haul of five World Championships.", "Taylor then won the Gibraltar Darts Trophy. He dropped just seven legs in the six matches he played which concluded with a 6–1 victory over Jamie Lewis in the final. However, Taylor's win in Gibraltar was later the subject of controversy as footage emerged showing him winning a leg and retrieving his dart when he had actually missed the double. Neither referee Russ Bray nor his opponent Dean Winstanley noticed the error and Taylor went on to win the match 6–1. Taylor insisted that he had not realised that the dart had missed and offered to replay the match and forfeit his prize money. The PDC released a statement blaming the incident on human error. The incident led to a feud with Taylor's old mentor Eric Bristow who stated: \"The player knows if it's not in the bed and has to declare it. You don't want cheats in the game\". Taylor responded by claiming that Bristow's comments were \"hurtful\" and that he would not be talking to Bristow again.", "Taylor had the nickname \"The Crafty Potter\" in the early 1990s, reflecting his status as the protégé of Eric Bristow (who was nicknamed \"The Crafty Cockney\") and his job in the ceramic industry. However, Taylor soon achieved success in his own right. In July 1995, Taylor was given the nickname \"The Power\" by Sky Sports production manager, Peter Judge, during the 1995 World Matchplay in Blackpool. Judge told Taylor that he should have a nickname and \"The Power\" became the serendipitous choice after Judge stepped on an empty CD case of Snap!'s \"The Power\".", "*1990: Winner (beat Eric Bristow 6–1)"]}, {"page": "World Professional Darts Championship", "response": ["|  Eric Bristow", "|  Eric Bristow", "|  Eric Bristow", "|  Eric Bristow", "|  Eric Bristow", "|  Eric Bristow", "|  Eric Bristow", "|  Eric Bristow", "|  Eric Bristow", "|  Eric Bristow", "|  Eric Bristow||5||5||–"]}, {"page": "GamesMaster", "response": ["*Episode 4 – Eric Bristow – 28 January 1992 "]}, {"page": "Bullseye (British game show)", "response": ["From series 5, the entire set was essentially inverted. The studio audience would now be seen in shot throughout the show, and the viewers would see all darts being thrown to the left.  From the studio audience's point of view, everybody continued to throw to the right. Series 5 also saw Bully driving the team bus in the opening titles and ejecting himself from the driver's seat to ride a flying dart. These titles also featured cartoon depictions of Bowen at the front of the coach, and Eric Bristow, John Lowe, Dave Whitcombe, Keith Deller, Cliff Lazarenko, Bob Anderson, Jocky Wilson and Mike Gregory at the back.Episode 12 of series 9 of Bullseye, mentioned in Jim Bowen's opening remarks This same title sequence was used for the revived series, but featuring depictions of presenter Dave Spikey at the front of the coach and professional darts players of the 2000s at the back.", "*1989–90: Eric Bristow", "| Eric Bristow ", "In 2005, it was announced that programme creator Andrew Wood had signed a contract with Granada Media for Granada to produce a one-hour long celebrity special Bullseye show to be hosted by Ant & Dec. This special was part of Ant & Dec's Gameshow Marathon, in turn part of ITV's 50th anniversary celebrations, and was aired on ITV on 22 October 2005. Vernon Kay and Coronation Street star William Roache were the contestants, accompanied by professional darts players Eric Bristow and Andy Fordham, while Tony Green reprised his role as co-host."]}, {"page": "Leighton Rees", "response": ["It is because of this that he is credited alongside the likes of Lowe, Eric Bristow, Bob Anderson, Jocky Wilson, Cliff Lazarenko and now Phil Taylor as bringing darts to the masses via the television screens. He had a good record on Bullseye, scoring more than 301 with nine darts on at least six appearances in eight and thus having his charity money doubled.", "In 1980, Rees married Debbie Ryle, a Californian, in Las Vegas while he was competing in a tournament there.  Eric Bristow was best man. Despite being the first world champion, it could be argued that Rees missed out on darts' glory years. The prize for his title was £3,000 and as the prize money rose and tournaments began to spring up all over UK television channels, Rees' form began to slide and by the 1980s he never managed to match the continued success of Lowe, Bristow and Wilson. Rees was forced to make his living from playing exhibition matches with his compatriot and great friend Alan Evans.", "* 1990: 1st Round (lost to Eric Bristow 0–3)"]}, {"page": "John Lowe", "response": ["John Lowe  (born 21 July 1945) is an English former professional darts player. Along with Eric Bristow and Jocky Wilson, he was known for dominating darts during the 1980s. Lowe was world champion on three occasions, in 1979, 1987 and 1993. He was also a two-time winner of the Winmau World Masters and a two-time World Cup singles champion. In total, Lowe won 15 BDO and WDF majors. He held the World No. 1 ranking on four occasions. In October 1984, he became the first player to hit a televised nine-dart finish. ", "Lowe won the World Championship title in three different decades – 1979, 1987 and 1993. He met Eric Bristow six times in the World Championship in various semi-finals and finals, and it was not until his fourth attempt (in the 1987 final) that he managed to overcome his rival. His record against Bristow in majors was three wins and six defeats.", "Lowe gained credit for his decorum and sportsmanship at the oche, often in contrast to Eric Bristow. Lowe was also probably unique in darts in that he looked after his health, never developing the weight difficulties associated with darts players, though he did consume alcohol onstage alongside other players when it was still permitted during matches.", "*1981: Runner-up (lost to Eric Bristow 3–5)", "*1984: Semi-finals (lost to Eric Bristow 0–6)", "*1985: Runner-up (lost to Eric Bristow 2–6)", "*1987: Winner (beat Eric Bristow 6–4)", "*1989: Semi-finals (lost to Eric Bristow 1–5)", "|  Eric Bristow", "|  Eric Bristow ", "|  Eric Bristow", "|  Eric Bristow", "|  Eric Bristow", "|  Eric Bristow", "|  Eric Bristow", "|  Eric Bristow"]}, {"page": "Jocky Wilson", "response": ["A contemporary and rival of Eric Bristow, Bob Anderson and John Lowe, Wilson's ungainly appearance and rough-hewn lifestyle belied his prowess in the sport. He was dogged by health problems, however, and suddenly retired from the game in December 1995. He withdrew from public life, and was rarely seen in public or gave interviews before his death in March 2012.", "In 1981, Wilson beat world number one Eric Bristow and Cliff Lazarenko of England in the BDO Nations Cup final. His Scotland teammates in the 5–4 win were captain Rab Smith and Angus Ross.", "In the television documentary, Eric Bristow: Sports Life Stories, Bristow described various psychological ploys he used against his opponents to \"scramble their heads\". He added that in response the only two opponents who would look him in the eye at the handshake at the start of a game were Wilson and Lowe, saying that like himself they had \"no fear\". He also referred to Wilson's unorthodox style such as a tendency to jerk his shoulder on throwing the third dart. Bristow commented that it seemed to have no detrimental effect on the accuracy, describing Wilson as \"a one off\". Bristow stated though that Wilson's sporting demise was due to the increasing volumes of alcoholic spirits Wilson would consume remarking, 'At the end he was doing a 40 oz bottle'.Eric Bristow: Sports Life Stories Tuesday 3 December at 10pm on ITV4", "A heavy smoker for 40 years, in November 2009 it was announced that Wilson had been diagnosed with chronic obstructive pulmonary disease. Reports stated that he had smoked up to 50 cigarettes a day for most of his life. He died just after 9 p.m. on 24 March 2012 at his home in Kirkcaldy, at the age of 62. His funeral was held on 2 April at Kirkcaldy Crematorium; his rival Eric Bristow and sports presenter Helen Chamberlain were among the estimated 400 mourners.", "* 1980: Quarter-final (lost to Eric Bristow 0–3)", "* 1988: Quarter-final (lost to Eric Bristow 2–4)", "* 1989: Winner (beat Eric Bristow 6–4)"]}, {"page": "Raymond van Barneveld", "response": ["From January to June 2008, he was the world's number one ranked player. His victory over Phil Taylor in the 2007 PDC World Championship final, added to his four previous BDO World Championships brought him level with Eric Bristow as a five-time world champion; he is one of only three players in darts history to achieve this.", "He successfully defended the trophy the year later by the same winning margin as the previous year, this time against Ronnie Baxter. This made him only the second player in the tournament's history to have launched a successful defence of his title; the other being Eric Bristow. Martin Adams and Glen Durrant would later also achieve this feat. In November 1999, Van Barneveld, the then 2-time reigning Lakeside World Champion, took on Phil Taylor, the then 7-time World Champion and reigning PDC world champion, at the Wembley Conference Centre. It was a legs match with a 60-minute clock ticking down to zero, with a short break at around the halfway stage. Van Barneveld lost the match 21–10."]}, {"page": "Professional Darts Corporation", "response": ["John Gwynne has covered all PDC events from the inaugural 1992 competition until his retirement in 2013. Dave Lanning covered all events up until December 2010, when he retired. Contrary to popular belief, long-time BBC darts commentator Sid Waddell did not switch allegiances to Sky until after the 1994 BDO World Championship. He brought his own unique brand of commentary to the game, and was a cult figure amongst darts fans and sport fans alike. He continued to commentate until his death in 2012. The current commentators on Sky include Nigel Pearson, Rod Studd, Stuart Pyke and former players Rod Harrington, Wayne Mardle, and three time World Champion John Part. Former BBC commentator and now Sky F1 commentator David Croft presents when Dave Clark is unavailable and also occasionally provides commentary. Jeff Stelling was the original presenter of Sky Sports' darts coverage, but most of the events are now presented by Clark. In addition, the 2005 Premier League was fronted by Gary Newbon.  Five-time world champion Eric Bristow was sacked in December 2016 by Sky Sports.", "Eric Bristow, the most successful player in the first few years of the World Championship, had his nickname \"The Crafty Cockney\" emblazoned on the back of his shirt. Very few dart players had their own nicknames until the Professional Darts Corporation circuit made it almost customary for every player to acquire a nickname. This helps to create a new generation of characters with which its audience could identify.", "The first two inductees were Eric Bristow and John Lowe, great rivals throughout the eighties and early nineties – at least one of these two players managed to reach the World Championship Final each year for the first 14 incarnations of the World Professional Darts Championship, from 1978 to 1991, with three being played against each other.", "|Eric Bristow"]}, {"page": "John Part", "response": ["Part's first Championship was the second time a non-seeded player won the BDO World Darts Championship, and one of the few times where a player only lost one set in the entire tournament. His nine-year gap between his first and second World Championships is tied with Ted Hankey for the longest gap between World Championships, and his third triumph in 2008 saw him become the first player in history to win a world title in three different venues, and the first to win at the Alexandra Palace. His 2008 win saw him join Phil Taylor, Eric Bristow, Raymond van Barneveld and John Lowe as the only players with three or more World Championships, and become only the second player (after Taylor) to win multiple PDC titles.", "By 1993, Part was Canada's highest ranked player and was competing in prestigious events sanctioned by the British Darts Organisation. A significant win soon came in the 1993 WDF World Cup, where he and Carl Mercer won the Pairs Championship for Canada. Nevertheless, when he qualified for the 1994 BDO World Championship, he was still a relative unknown. This was the first BDO World Championship since the acrimonious split in darts, and, as a result, the field included many newcomers and debutants, including Part himself. In the first round Part defeated second seed Ronnie Baxter in straight sets, and thereafter swept through to the final beating Paul Lim, Steve McCollum and Ronnie Sharp dropping only one set en route. He faced the charismatic  veteran Bobby George in the final and won 6–0 in sets.  Little over six years after receiving his first dartboard, Part had won a World Championship; he was the first non-British player to do so, and he is one of the few players to win the tournament on their debut. Part's achievement of dropping only one set in winning a World Championship is only matched by Eric Bristow from the 1984 BDO World Darts Championship, and later by Phil Taylor in the 2001 PDC World Darts Championship.", "In a tournament where the contemporary superpowers of the game had faltered – Taylor had lost 5–4 to Wayne Mardle in the quarter-finals and reigning champion van Barneveld had been eliminated by Painter in the third round – it was perhaps not such a great surprise to see a 500–1 rank outsider facing Part in the final. Debutant Kirk Shepherd, a 21-year-old qualifier and the sport's youngest ever world-finalist, was Part's opponent. In a sense, Part's career had come full circle; the matchup recalled his 1994 final, though Part had moved from novice to established veteran and Shepherd, this time, was the young debutant. But Part was not to suffer the same fate as Bobby George had. While Shepherd had shown remarkable guile, moxie and perhaps good fortune in defeating stalwarts of the PDC's top 10, including Mardle, Peter Manley, and Terry Jenkins, the experience of Part proved a step too far. The Canadian raced into a 4–0 lead and though Shepherd brought the match back to 5–2, Part closed out the match before the comeback could become troubling, winning the final two sets for a 7–2 victory and a third world championship. Victory ensured he joined Taylor, van Barneveld, Eric Bristow and John Lowe as the fifth player to have won more than two world championships. With this win he also became the second player to have won the PDC World Championship more than once, after Taylor. Part also set a new record in becoming the first player to win the world championship in three different venues – having won the 1994 BDO World Championship at the Lakeside, the 2003 PDC title at the Circus Tavern and in 2008 at Alexandra Palace."]}, {"page": "Helen Chamberlain", "response": ["A pub-league level darts player when she was younger, Chamberlain claims to have once beaten Eric Bristow in a game of darts-cricket."]}, {"page": "Glossary of darts", "response": [":; Bucket (or bag) of nails: Landing all three darts in the 1.  This is also known as \"The Eric Bristow\", who once scored three 1s in a televised tournament."]}, {"page": "Super Gran", "response": ["The young actors were all local children from the Newcastle area, and the Scunner's two toughies (Alan Snell and Brian Lewis) were local stand-up comics who performed in clubs at night. Many guest stars appeared on the programme, including George Best, Spike Milligan, Eric Bristow, Roy Kinnear and Geoff Capes. It was Patrick Troughton and Charles Hawtrey's final screen appearances."]}, {"page": "Kevin Kenny", "response": ["Other notable achievements was twice being on the winning team in the Champions Cup, a darts event which yearly finds the best pub darts team in the land. The fact that he and teams from Liverpool won it twice was quite special due to the size of darts in the city at the time, compared to places with more darting pedigree like Lancashire, Yorkshire, and London. Secondly winning the county men's individual averages twice, a feat which at the time had only been equalled by five-time World Champion Eric Bristow (who became great friends with Kenny and also represented Merseyside with him as well).", "* 1991: Semi-finals (lost to Eric Bristow 2–5)"]}, {"page": "List of sports rivalries", "response": ["| Jocky Wilson (1978–1996) ||  Eric Bristow (1976–2007) || 1980–1989 ||", "| John Lowe (1976–2007) ||  Eric Bristow (1976–2007) || 1978–1993 ||"]}, {"page": "Wayne Mardle", "response": ["Mardle made his commentating debut for the PDC at the 2011 PDC World Darts Championship, working alongside Sid Waddell in a few matches. He also co-presented some of the event with Dave Clark and predicting some of the match results with Rod Harrington and Eric Bristow. Mardle continued his analyzing and commentary career at the 2011 Premier League Darts apart from weeks 3, 5, 9, 10, 11 and 14.", "Mardle has been a keen advocate for the support of players suffering from Dartitis. In 2013, Mardle spoke about former 5 Time World Champion Eric Bristow and outlined that Dartitis was \"the fear of throwing the dart\" and emphasised how it \"must've been awful\" for Bristow. In 2017, Mardle supported Berry van Peer following a severe case of Dartitis during the Grand Slam of Darts in Wolverhampton. Despite this setback Mardle has outlined that Van Peer has \"bounce back-ability\" and has the potential to be a future World Champion."]}, {"page": "Las Vegas Desert Classic", "response": ["* Eric Bristow (2002–2005)"]}, {"page": "Russ Bray", "response": ["Bray was a county player for Hertfordshire and subsequently played on the pro circuit. He teamed up with Eric Bristow to win the Norway and Finland pairs."]}, {"page": "Celebrity Poker Club", "response": ["* Eric Bristow"]}, {"page": "You Bet!", "response": ["|bgcolor=\"ddffdd\"| Eric Bristow"]}, {"page": "January 1985", "response": ["*The Embassy World Darts Championship, held at the Jollees Cabaret Club in Stoke-on-Trent, England, is won by Eric Bristow, his fifth world title."]}, {"page": "Hackney Downs School", "response": ["* Eric Bristow, world champion darts player"]}, {"page": "Dennis Priestley", "response": ["Shortly after becoming a newsagent, Priestley won the 1991 Embassy World Championship, after beating Eric Bristow 6–0 in the final. He had defeated defending champion Taylor in his quarter-finals and 1988 champion Bob Anderson in his semi-final. He won the 1992 Winmau World Masters and also picked up many BDO Open events between 1991 and 1993.", "*1991: Winner (beat Eric Bristow 6–0)", "|  Eric Bristow "]}, {"page": "Bob Anderson (darts player)", "response": ["In 2008, Anderson decided to take part in the BetFred League of Legends which was shown live on Setanta Sports and play along with the likes of Eric Bristow, Keith Deller, John Lowe and Dave Whitcombe. However, in doing so, he was forced to resign from the PDC to take part in the league.   He does, however, remain a lifetime member of the PDPA, granted to him because he was a founder member of the WDC (now PDC). Anderson went on the capture the League of Legends title, beating Keith Deller in the final.", "*1997: Group Stage (lost to Eric Bristow 1–3) & (beat Gary Mawson 3–1)", "Bob married Sally Attwater on 8 April 2004 – he chose former World Champion dart player Eric Bristow as his best man. Anderson has two children, Jennie and David. He lists his hobbies as golf – with a handicap of six, and trout fishing. Anderson's sporting hero is golf legend Jack Nicklaus. Anderson lives in the Somerset sea-side resort town of Clevedon."]}, {"page": "Yips", "response": ["The yips also affects players in other sports.  Examples include Markelle Fultz and Chuck Hayes's respective free throw shots in basketball and Guillermo Coria. In tennis, yips seems to particularly manifest itself in the form of the player all of a sudden consistently failing to execute a serve, leading to a torrent of consecutive double faults. This afflicted Elena Dementieva and Sara Errani. In darts, the yips are known as dartitis, with five-time world champion Eric Bristow an example of a sufferer. In the National Football League (NFL), a normally reliable placekicker who starts struggling is also said to have the yips."]}, {"page": "Bobby George", "response": ["George took up darts at the age of 30, and quickly improved, winning the first tournament he entered and making his first appearance at the World Masters less than a year later. He has won several major tournaments, including the News of the World Championship in 1979 and 1986, the Butlins Grand Masters in 1979 and 1980, the North American Open in 1978 and the Nations Cup in 1980, as part of an England triples team with Tony Brown and John Lowe. And he was WDF Europe Cup champion in 1982 beating Eric Bristow in the final. George's News of the World victory in 1979 came without dropping a single leg, the only player to do so.", "George has reached the final of the BDO World Darts Championship twice. His first final in 1980 was his first appearance in a BDO World Darts Championship: after beating Dave Whitcombe, Leighton Rees and Cliff Lazarenko, he lost to Eric Bristow. George reached his second world final in 1994. After beating Russell Stewart and Martin Phillips, he broke his back when celebrating winning a set during his quarter final match against Kevin Kenny. George got through that match against Kenny by 4–2 in sets, having damaged his back when celebrating going 3–2 up. In his semi final match against Magnus Caris, George went two sets up, but then lost the next four sets and the opening two legs of the seventh set. When Caris missed a dart at double 18 to win the match, George responded by winning nine legs in a row to win the match 5–4 in sets. Competing in the final against doctor's advice, Wearing a steel corset, George lost 0–6 to John Part playing in extreme pain. ", "*1980: Runner Up (lost to Eric Bristow 3–5)", "|  Eric Bristow", "|  Eric Bristow"]}, {"page": "Mark Selby", "response": ["Selby has been a fan of Leicester City F.C. since childhood. His 2014 World Championship victory happened on the day that Leicester City celebrated their promotion to the Premier League with an open-top bus parade. Two years later, he won his second world title just 13 minutes after the team sealed their first Premier League title. Selby is also a fan of darts and has played in exhibition matches at Ibstock in Leicestershire, beating Eric Bristow in 2007 and taking on Raymond van Barneveld in 2009."]}, {"page": "Anastasia Dobromyslova", "response": ["In December, she went into the 2008 World Masters as the number one ranked ladies' darts player, and reached the final, where she lost to Hoenselaar. Just a few hours later, however, it was announced that Dobromyslova had left the WDF/BDO circuit, and had joined the PDC on a full-time basis, after she was awarded a wildcard entry into the 2009 PDC World Darts Championship following the withdrawal of an unnamed Indian qualifier, a decision that was publicly criticised by five-time world champion Eric Bristow.http://news.bbc.co.uk/sport1/hi/other_sports/darts/7790293.stm Russian wildcard angers Bristow"]}, {"page": "Sid Waddell", "response": ["In 2007, Waddell and Eric Bristow recorded a series of Bellies and Bullseyes darts programmes about the World Darts Championship from 1978 until 1990 for ESPN Classic, which were later broadcast on the channel in December 2007."]}, {"page": "Adrian Lewis", "response": ["During the first set of the match, Lewis became the first player to throw a nine dart finish in a World Championship final. Lewis went on to win the match 7–5 and with it the championship, guaranteeing him a place in the 2011 Premier League. He had also risen to his highest ranking of No. 2. In addition, at 25 years old Lewis became the fifth youngest player to win a World Championship, behind Jelle Klaasen (21 in 2006), Eric Bristow (22 in 1980), Keith Deller (23 in 1983), and Mark Webster (24 in 2008), as well as the youngest ever PDC World Champion.", "Lewis became the third player, after Eric Bristow and Raymond van Barneveld, to successfully defend their first World Championship title in the 2012 PDC World Championship, by beating Andy Hamilton 7–3 in the Final."]}, {"page": "Martin Adams", "response": ["At the 2009 World Championship, he reached the semifinal for the fifth successive year, where he was narrowly defeated by eventual champion Ted Hankey. Later that year, he won his second successive Masters title, once again by a 7–6 scoreline in the final, over Robbie Green after Green led by 6–3 and had a dart for the title. This win made Adams the first man to retain the Masters title since Bob Anderson in 1988. Adams joined Eric Bristow, Richie Burnett, Bob Anderson and John Walton as the fifth player to win them in the same season."]}, {"page": "Winning streak", "response": ["3 consecutive titles at BDO World Darts Championship – Eric Bristow"]}, {"page": "Quicksilva", "response": ["The company continued to publish licensed products, including the first official home computer conversion of Atari's Battlezone, Eric Bristow's Pro Darts, two different games based on Strontium Dog from the 2000 AD comic and Fantastic Voyage (an official licence from the 1966 film),"]}]}}