{"wiki_id": "http://www.wikidata.org/entity/Q6767631", "itemLabel": "Mark Florman", "itemDescription": "British business leader and philanthropist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Florman", "wikipedia_page": {"main": "Carl Alan Mark Florman (born 2 November 1958) is a British businessman and entrepreneur. He is a co-founder and former CEO of the merchant banking group, Maizels, Westerberg & Co. and Time Partners Limited.", "link_mentions": [{"page": "Doughty Hanson & Co", "response": ["*Mark Florman - founder and former CEO of Maizels, Westerberg & Co."]}, {"page": "List of organisations associated with the Conservative Party (UK)", "response": ["Think tank co-founded in 2004 by Iain Duncan Smith, Tim Montgomerie, Mark Florman and Philippa Stroud."]}, {"page": "Centre for Social Justice", "response": ["The Centre for Social Justice (CSJ) is an independent centre-right think tank based in the United Kingdom, co-founded in 2004 by Iain Duncan Smith, Tim Montgomerie, Mark Florman and Philippa Stroud."]}, {"page": "BBC Trust", "response": ["*Mark Florman – the Trustee for England; co-founder and former CEO of the merchant banking group Maizels, Westerberg & Co."]}, {"page": "Build Africa", "response": ["Build Africa has a number of patrons who support the charity's work, including: Clive Myrie, Tamzin Merchant, Shiulie Ghosh and Mark Florman."]}, {"page": "Maizels, Westerberg & Co.", "response": ["The firm was established by six former employees of Enskilda Secusrities: Spencer Maizels, Sten Westerberg, Mark Florman, Peter Wikström, Tomas Söderström & Jonas de Verdier. Sten Westerberg had been under-secretary of state at the Ministry of Finance (Sweden) and had strong government connections. Spencer Maizels was the company's first CEO, but died aged just 43 in 1995. He was succeeded by Mark Florman, who had been one of the driving forces behind the establishment of the firm.", "At the end of 1999, Maizels, Westerberg & Co. was bought by the Finnish-Swedish bank Merita Nordbanken (now Nordea). The resulting investment bank was named Maizels Merita Nordbanken and grew from 30 to 70 employees. The joint chief executives were Mark Florman and executive vice-president of Merita Nordbanken, Björn Carlsson. Nordbanken's M&A advisory team was demerged from the bank's Stockholm office and moved into Maizel's new office."]}, {"page": "Swedes in the United Kingdom", "response": ["*Mark Florman: businessman and entrepreneur. He is a co-founder and former CEO of the merchant banking group Maizels, Westerberg & Co., Swedish descent."]}, {"page": "Florman, Mark", "response": ["#redirectMark Florman"]}, {"page": "Florman", "response": ["*Mark Florman (born 1958), British businessman"]}]}}