{"wiki_id": "http://www.wikidata.org/entity/Q6769755", "itemLabel": "Mark Sloan", "itemDescription": "British professional wrestler", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Sloan_(wrestler)", "wikipedia_page": {"main": "Mark Sloan (born 7 July 1978) is a British professional wrestler. Sloan is best known for his work with the Frontier Wrestling Alliance due to founding the promotion and being head trainer in the company's training academy, FWA Academy.", "link_mentions": [{"page": "1978", "response": ["** Mark Sloan, British professional wrestler"]}, {"page": "Frontier Wrestling Alliance", "response": ["The FWA initially started out as the Fratton Wrestling Association in 1993 by Mark Sloan in an attempt to create a forum for serious wrestling training and performance based in Portsmouth. Renaming the promotion to the Fratton Wrestling Alliance 1999, it experienced a renovation that geared it towards national expansion and promoted its first show in February of that year, changing to Frontier Wrestling Alliance by the second show in June. The promotion (now being co-run by Mark Sloan and film and TV producer Elisar Cabrera) soon produced a regional television programme (\"Frontier Wrestling\") in Portsmouth as well as founding a training academy to create its own talent. The emphasis on new wrestlers organically led to an early storyline of new, internationally influenced wrestling clashing with traditional British wrestling with some veterans brought in to help promote FWA's own performers.", "|Mark Sloan & Ollie Burns", "|Mark Sloan & Ollie Burns"]}, {"page": "British Heavyweight Championship (XWA)", "response": ["The first Champion was Mark Sloan, who defeated Paul Glory in a tournament final on 11 July 1999. Jody Fleisch was the first person to win the belt twice after being stripped of it, while American wrestler Christopher Daniels was the first non-British person to win the belt and go on to defend it on foreign soil.", "|Mark Sloan", "|| Mark Sloan || 231"]}, {"page": "All-England Championship", "response": ["|Mark Sloan || 1 || 203"]}, {"page": "Paul Burchill", "response": ["Birchall is a former primary school teacher from Surrey, but got into professional wrestling in 2001 after walking into the Frontier Wrestling Alliance's (FWA) Academy and quickly impressing the man running the camp, Mark Sloan."]}, {"page": "Andrew Simmons", "response": ["After time away in the independent circuit, Simmons returned to the FWA Academy in 2003. During Simmons' time in the academy he wrestled against many of the up-and-coming British stars like James Tighe, Raj Ghosh, Mark Sloan, and Paul Burchill. Simmons also took part in the final TWA tour facing British wrestling superstars \"The Anarchist\" Doug Williams, Jody Fleisch, and Robbie Brookside."]}, {"page": "Mark (given name)", "response": ["*Mark Sloan (wrestler), British wrestler", "*Mark Sloan (disambiguation)"]}, {"page": "Roy Bevis", "response": ["Bevis' most high-profile work in the UK was for the W.A.W.; he made his Frontier Wrestling Alliance (FWA) debut in 2002 winning a four-way match against Paul Trevell, Scotty Rock, and Mark Sloan at FWA Carpe Diem for an FWA All-England title match a few weeks later, a title he won. Throughout 2002 and 2003, Bevis traded FWA's All-England title back and forth with many of FWA's stars, but when Bevis vacated the belt due to injury on 18 October 2003, Hade Vansen won a provisional championship match against Flash Barker. On 26 March 2004, Bevis made his return in a last effort to win back the title in an undisputed FWA All England Championship match, but Vasen walked out of this match still the champion."]}, {"page": "Joel Redman", "response": ["Redman's feud with Aviv Mayaan would not just be contained to VPW. After becoming an alumnus of the training school, Redman went on to train in the FWA Academy where he would face off with Mayaan once again, touring a Title tournament this time coming on the losing end of the match. After dominating several opponents throughout the end of 2006 in FWA:A, Redman would team up with FWA:A Champion LT Summers to defeat Mark Sloan and Ollie Burns for the FWA:A Tag Team Championships.", "The Thrillers returned to International Pro Wrestling: United Kingdom on 4 May triumphant with tag team gold in the form of RQW Tag Team Championship only to lose the championship The Kartel (Sha Samuels & Terry Frazier) in a championship unification match which also involved IPW:UK Tag Team Championship. The team debuted for One Pro Wrestling losing to BritRage (Mark Sloan & Wade Fitzgerald). However they would beat The Kartel on 28 September for the Unified British Tag Team Championship. The Thrillers would then debuted for Westside Xtreme Wrestling at the beginning of 2009 and won a wXw Tag Team Championship contendership match defeating Adam Polak and Lazio Fe. With that win, they challenged Doug Williams and Martin Stone for the wXw Tag Team Championship the following month, but were unable to win the title."]}, {"page": "Global Professional Wrestling Alliance", "response": ["| Mark Sloan"]}, {"page": "Drew McIntyre", "response": ["Galloway began training as a wrestler at the Frontier Wrestling Alliance's Academy at the age of 15 after his family moved to England and settled in Portsmouth. In the FWA Academy, while he was trained by the promotion's operator Mark Sloan along with Justin Richards and James Tighe, he also cites the promotion's established wrestlers helping out with training, including Doug Williams, Paul Burchill and Alex Shane."]}, {"page": "Marty Scurll", "response": ["Scurll would go on to appear for Premier Promotions and this would be the place where he would meet Phil Powers, who he ended up wrestling many times in the summer season on the holiday camps circuit. During the rest of the year, Scurll debuted for the likes of IPW:UK and RQW, wrestling Jonny Storm, Taiji Ishimori, Bubblegum and many others. On 5 June 2007, Marty made his debut for All Star Wrestling by defeating Jimmy Starr at Gravesend. Marty competed regularly for All Star, including main eventing Fairfield Halls, Croydon against Pro Wrestling NOAH's Shuhei Taniguchi and Tsutomu Hirayanagi. In IPW:UK, Marty would reform his tag team with Zack Sabre Jr., but under the name The Leaders of the New School. They then feuded with BritRage (Mark Sloan and Wade Flitzgerald) and The Kartel. Scurll wrestled and lost to Doug Williams in IPW:UK's British National Championship Tournament.IPW:UK :: International Pro Wrestling :: British National Championship "]}, {"page": "PJ Black", "response": ["Lloyd spent five years in the United Kingdom, where he trained with Frontier Wrestling Alliance. He was trained by Alex Shane and Mark Sloan. In 2003 he made his FWA debut. He also made an appearance in International Pro Wrestling: United Kingdom."]}, {"page": "Mark Sloan", "response": ["Mark Sloan may refer to:", "*Mark Sloan (curator) (born 1957), American artist, curator and museum director", "*Mark Sloan (wrestler) (born 1978), British professional wrestler", "*Mark Sloan (Diagnosis: Murder), lead character in U.S. TV series Diagnosis: Murder, played by Dick Van Dyke", "*Mark Sloan (Grey's Anatomy), character in U.S. TV series Grey's Anatomy, played by Eric Dane"]}, {"page": "List of professional wrestling promotions in Great Britain and Ireland", "response": ["|Elisar Cabrera, Mark Sloan, Alex Shane, Tony Simpson"]}, {"page": "Mark Haskins", "response": ["Haskins debuted on 22 July 2006 for FWA Academy by teaming up with Tom Langford defeated Mark Sloan and Ollie Burns. He was involved in his first cage match just days after his debut losing to Mark Sloan and Ollie Burns. He debuted for Premier Promotions on 7 September 2006. Haskins would go on to wrestle many matches for Premier Promotions over the years in mostly British Rules matches. He was part of FWA Academy Championship Number One Contendership tournament and got to the semi-finals before being eliminated by Max Voltage. His last match for FWA Academy came at the beginning of 2007 by teaming with Tommy Langford and defeating Doug Williams and Jake McCluskey.", "On 6 April 2009 Haskins and Mark Sloan won in the PWF Tag Team Championship Tournament for the vacant PWF Tag Team Championship by defeating Roy Knight and Zak Zodiac.", "The Thrillers returned to IPW: UK on 4 May 2008, triumphant with tag team gold in the form of RQW Tag Team Championship only to lose the championship to The Kartel (Sha Samuels & Terry Frazier) in a championship unification match which also involved IPW:UK Tag Team Championship. The team debuted for One Pro Wrestling losing to BritRage (Mark Sloan & Wade Fitzgerald). However they would beat The Kartel on 28 September 2008, for the Unified British Tag Team Championship. The Thrillers would then debuted for Westside Xtreme Wrestling at the beginning of 2009 and won a wXw Tag Team Championship contendership match defeating Adam Polak and Lazio Fe. With that win, they challenged Doug Williams and Martin Stone for the wXw Tag Team Championship the following month, but were unable to win the title.", "**PWF Tag Team Championship (1 time) – with Mark Sloan", "**Tag Team Championship Tournament (2009) – with Mark Sloan"]}, {"page": "Genba Hirayanagi", "response": ["The summer of 2007 saw Hirayanagi venture to the United Kingdom to perform in 6 matches on the British independent circuit. His UK debut came in a July 20 loss to Noah compatriot Shuhei Taniguchi for 3 Count Wrestling. 8 days later, the two teamed up to challenge the 4 Front Wrestling Tag Team Champions Mark Sloan and Wade Fitzgerald. In IPW:UK's Debut In Sittingbourne show he was defeated by James Tighe, which was followed by a loss to veteran Johnny Kidd on a Premier Promotions card before concluding his tour by teaming with Dan Head to gain victory over Mark Haskins and Harry Mills."]}, {"page": "List of people from Hampshire", "response": ["*Mark Sloan, wrestler, was born in Portsmouth"]}, {"page": "Eddie Ryan", "response": ["Rubio started his professional wrestling career in 2008 by training at the 4 Front Wrestling (4FW) Training School. He had his first professional match in January of the following year at 4FW New Year’s Wrestlution under the name of Eddie Reyes, with the gimmick of a Spanish wrestler. Rubio competed in a five-way ladder match Money in the bank, featuring Mark Sloan, Wade Fitzgerald, Mark Haskins and won by Dave Sharp. Rubio wrestled predominantly for 4FW during his first year, but made his debut for Pro Evolution Wrestling (Pro EVW) in July with a loss to Jack Dynamo. He gained his first championship match by the end of the year in a battle royale at the 4FW Halloween Spectacular 2009, but lost the match for the 4FW Heavyweight Championship again to Jack Dynamo a full year after his debut in January 2010."]}]}}