{"wiki_id": "http://www.wikidata.org/entity/Q6769022", "itemLabel": "Mark Nicholas", "itemDescription": "English cricketer (born 1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Nicholas", "wikipedia_page": {"main": "Mark Charles Jefford Nicholas (born 29 September 1957) is an English cricket commentator and former cricketer and broadcaster. He played for Hampshire from 1978 to 1995, captaining them from 1985 to his retirement.\nNicholas was born in Westminster, London. A grandson of Fred Nicholas, he was educated at Bradfield College where he was coached in cricket by John Harvey.", "link_mentions": [{"page": "Muttiah Muralitharan", "response": ["He bowls marathon spells, yet he is usually on the attack. His unique bowling action begins with a short run-up, and culminates with an open-chested extremely wristy release from a partly supinated forearm which had him mistaken for a leg-spinner early in his career by Allan Border. Aside from his stock delivery, the off-break, of which he claimed to have two variations (during a recorded television 'doosra' show off with Mark Nicholas from Channel 4 in 2004), his main deliveries are a fast topspinner which lands on the seam and usually goes straight on, and the doosra, a surprise delivery which turns from leg to off (the opposite direction of his stock delivery) with no easily discernible change of action. Additionally, he would occasionally use one of his several unnamed novelties. His super-flexible wrist makes him especially potent and guarantees him turn on any surface.", "TV presenter Mark Nicholas who tried the brace himself, confirmed that \"There is no way an arm can be bent, or flexed, when it is in this brace.\" All three balls reacted in the same way as when bowled without the brace. They were not bowled quite so fast because the weight of the brace restricts the speed of Muralitharan's shoulder rotation, but the spin was still there."]}, {"page": "September 29", "response": ["*  1957   – Mark Nicholas, English cricketer and sportscaster"]}, {"page": "Survivor (franchise)", "response": ["Mark Nicholas (2)"]}, {"page": "List of sports announcers", "response": ["* Mark Nicholas – Sky Sports 1995–1999, Channel 4 1999–2005, talksport 2002–2003, Nine Network 2003–2018, Channel 5 2006–2019, ITV Sport 2010–2011"]}, {"page": "Geoffrey Boycott", "response": ["Boycott worked on Cricket on Five with Mark Nicholas and Simon Hughes as co-commentators, and was a member of the BBC Cricket Team for commentary on the 2006/7 Ashes series. His role, as in his other commentary-related work, was to contribute to discussion of the main talking points. During England's 5–0 whitewash by Australia, Boycott stated that the team were undeserving of their MBEs and that he felt \"so bad about mine I'm going to tie it round my cat. It doesn't mean anything any more. It's a joke\"."]}, {"page": "Talksport", "response": ["The new line-up involved a number of presenters and commentators, including Alan Brazil, Mark Nicholas, Chris Cowdrey, Geoffrey Boycott, Mike Parry, Peter Shilton, Brian Moore, Brough Scott, Tom Watt, Gary Newbon, Ian Darke, Tony Banks, and Alvin Martin."]}, {"page": "Martin Crowe", "response": ["Upon his death, Crowe was eulogised in The Guardian as \"not just one of New Zealand’s greatest ever cricketers, but one of the most elegant batsmen the world has yet seen\". A 2012 article by Mark Nicholas described him as \"upright, orthodox and immensely strong\" at the wicket, and praised the \"speed and grace of the footwork\" and \"perfect head position\". Nicholas thought the elegance of Crowe's batting was at odds with his physical size – he was \"a big man in a small man's game\". Writing in his retirement, Crowe emphasised the importance of instinct in batting, and the need to avoid premeditating a shot."]}, {"page": "The Twelfth Man", "response": ["In addition to Richie Benaud himself, Bill Lawry, Ian Chappell and Tony Greig, the 12th Man features various other Australian commentators from throughout Channel Nine's line-up. They include Max Walker, Mark \"Tubby\" Taylor, Ian's brother Greg Chappell, Michael \"Slats\" Slater, Englishman Mark Nicholas and West Indian Michael Holding."]}, {"page": "List of cricket commentators", "response": ["|  Mark Nicholas"]}, {"page": "Malcolm Marshall", "response": ["Marshall's final appearances for West Indies came in One Day International cricket – the 1992 World Cup. However, in his five matches in the tournament, he took just two wickets, both in the penultimate game against South Africa at Christchurch. This was the only time Marshall played for West Indies against South Africa in his career, though he played provincial cricket for Natal in both 1992/93 and 1993/94. Whilst playing at Natal, his experience was invaluable, and his guidance was an influential spark in the early career of Shaun Pollock. Today, Shaun Pollock attributes much of his success to his mentor, Marshall.Shaun Pollock enhanced his family name Mark Nicholas, The Daily Telegraph, 14 January 2008.", "His former Hampshire captain, Mark Nicholas, wrote a moving tribute to him."]}, {"page": "Steve Harmison", "response": ["In summer 2005 Harmison was part of the England team that regained The Ashes from Australia. He started the series well, with a hostile opening spell on the first day of the 1st Test in which he cut Ricky Ponting's face with a short ball and took five wickets, including that of Ponting.England v Australia at Lord's, 2005 Although later outshone by Flintoff and Jones, he exerted pressure and claimed important wickets throughout. His most important and dazzling wicket, some might say, was the slower-ball yorker with which he bowled Michael Clarke, described by Mark Nicholas, commentating for Channel 4, as \"one of the great balls\". Marcus Trescothick and Andrew Flintoff believed he had the second-worst split-fingered slower ball in the squad, after Flintoff.Andrew Flintoff's top three moments from the 2005 Ashes"]}, {"page": "Tony Greig", "response": ["Greig began to have severe bouts of coughing in May 2012; initially, bronchitis was diagnosed. After undergoing tests, a small but malignant lesion was found in his right lung. He was diagnosed with lung cancer in October 2012.  He underwent an operation for the cancer in November, and the same month he told fellow commentator Mark Nicholas during an interview broadcast by the Nine Network that \"It's not good. The truth is I've got lung cancer. It's now just a question of what they can do.\""]}, {"page": "Billy Birmingham", "response": ["* Mark Nicholas"]}, {"page": "2005 Ashes series", "response": ["An extra half-hour of play was allowed, as a result was nearing, but Warne and Clarke defied the English. Warne \"took the attacking approach\", and took on Giles for 12 in one over. He ended on 20 not out overnight, as Warne and Clarke batted together for 40 minutes before Harmison, bowling his third spell of the day, brought the third day's proceedings to an end with a slower ball that was not read correctly by Clarke, who missed the ball completely to be bowled. Mark Nicholas, in live commentary, described the delivery as \"...one of the great balls. Given the moment, given the batsman and given the match, that is a staggering gamble that has paid off for Harmison. He bowled it perfectly.\" England now needed two wickets on the fourth day, while Australia needed 107 runs for the victory.", "At Trafalgar Square, the crowd was treated to a victory celebration for both England teams, and before the ceremony closed the square broke into a rendition of \"Jerusalem\", which had become an unofficial hymn for the team during the 5th Test. Interviews were carried out with all members of the men's team and Clare Connor, the captain of the women's team, by David Gower and Mark Nicholas, while the ceremony was broadcast live in the UK on BBC One, Channel 4 and Sky Sports News and around the world. Afterwards, the side was entertained by the Prime Minister as guests of honour at 10 Downing Street, then returned the urn to its sacred home at Lord's for safekeeping."]}, {"page": "SuperSport (South African broadcaster)", "response": ["SuperSport Cricket primarily shows Cricket. All international cricket involving the South African national cricket team, as well as certain domestic cricket, is shown on this channel. The presentation and commentary team who cover South African home games include Mark Nicholas, Mike Haysman, Pommie Mbangwa, Michael Holding, Shaun Pollock, Makhaya Ntini, JP Duminy and guest pundits from the opposition team."]}, {"page": "Broadhalfpenny Down", "response": ["Patrons of the Trust include Dr Ali Bacher, JRT Barclay DL, David English, David Gower OBE, Lord Maclaurin of Knebworth DL, The Rt Hon Sir John Major KG CH, Mark Nicholas, The Hon Sir Oliver Popplewell, Sir Tim Rice, Sir Garfield Sobers, Richard Stilgoe OBE DL, Raman Subba Row CBE, John Woodcock OBE"]}, {"page": "Mary Nightingale", "response": ["In April 2011, she took over from Mark NicholasBritain's Best Dish - ITV1, 5pm and Great British Menu - BBC2, 6.30pm Daily Mirror, 4 April 2011 as the host of the ITV daytime cookery programme Britain's Best Dish.Britain's Best Dish  ITV Press Centre, 24 March 2011"]}, {"page": "The Cricket Society", "response": ["* 2017: A Beautiful Game: My Love Affair with Cricket by Mark Nicholas"]}, {"page": "Fred Nicholas", "response": ["The cricketer and broadcaster Mark Nicholas is his grandson."]}, {"page": "Simon Hughes (cricketer)", "response": ["He is perhaps best known for his work as The Analyst on Channel 4's cricket coverage (from 1999 to 2005), winning the Royal Television Society's Sports pundit of the Year award in 2002, where he spent matches in a VT trailer, watching replays and drawing viewers' attention to particular details. Channel 4's cricket coverage won 28 awards in its seven-year span, including six Baftas. He was a commentator/analyst on Cricket on 5 with Sir Geoffrey Boycott and Mark Nicholas (with whom he worked on Channel 4). He originally signed up for the programme from 2006 to 2010 when the deal expired, with the ECB."]}, {"page": "Nine's Wide World of Sports", "response": ["* Mark Nicholas", "* Mark Nicholas, (host/commentator, 2004–2018)"]}]}}