{"wiki_id": "http://www.wikidata.org/entity/Q676375", "itemLabel": "Alan Clark", "itemDescription": "English keyboardist", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Clark_(keyboardist)", "wikipedia_page": {"main": "Alan Clark (born 5 March 1952) is an English musician who was the first keyboardist and co-producer of the rock band Dire Straits. In 2018, Clark was inducted into the Rock and Roll Hall of Fame as a significant member of Dire Straits.\n\n", "link_mentions": [{"page": "Synclavier", "response": ["* Mark Knopfler: Used on the scores for the films The Princess Bride (1987) and Last Exit to Brooklyn (1989), in which all sounds except guitar (and in the latter case, violins)  were produced by the Synclavier. The Synclavier is also heard on the Dire Straits albums Love over Gold (1982, played by Alan Clark), Brothers in Arms (1985, played by Guy Fletcher), and On Every Street (1991)."]}, {"page": "List of Rock and Roll Hall of Fame inductees", "response": ["| Alan Clark, Guy Fletcher, John Illsley, David Knopfler, Mark Knopfler and Pick Withers"]}, {"page": "Dire Straits", "response": ["In 1980, Dire Straits were nominated for two Grammy Awards for Best New Artist and Best Rock Vocal Performance by a Duo or Group for \"Sultans of Swing\". In July 1980, the band started recording tracks for their third album. Produced by Jimmy Iovine, with Mark Knopfler also sharing credit, Making Movies was released in October 1980. During the recording sessions, tension between Mark and David Knopfler took its toll on the band, and David Knopfler left over creative differences with his brother to pursue a solo career; he was uncredited on the album. The sessions continued with Sid McGinnis on rhythm guitar and keyboardist Roy Bittan from Bruce Springsteen's E Street Band. After the recording sessions were completed, keyboardist Alan Clark and Californian guitarist Hal Lindes joined Dire Straits as full-time members for tours of Europe, North America, and Oceania.", "Dire Straits' fourth studio album Love Over Gold, an album of songs filled with lengthy passages that featured Alan Clark's piano and keyboard work, was well received when it was released in September 1982, going gold in America and spending four weeks at number one in the United Kingdom. The title was inspired by graffiti seen from the window of Knopfler's old council flat in London. The phrase was taken from the sleeve of an album by Captain Beefheart. Love Over Gold was the first Dire Straits album produced solely by Mark Knopfler, and its main chart hit, \"Private Investigations\", gave Dire Straits their first top 5 hit single in the United Kingdom, where it reached the number 2 position, despite its almost seven-minute length, and became another of the band's most popular live songs.International who's who in popular music, p. 282. Routledge, 2002.", "During 1983 and 1984, Mark Knopfler was also involved in other projects outside of the band. He wrote the music scores for the films Local Hero, which extensively featured Alan Clark's keyboards, and Cal, which were also released as albums.Local Hero (Original Soundtrack) – Mark Knopfler AllMusic Retrieved: 30 December 2010. The final track of Local Hero, \"Going Home (Theme Of The Local Hero)\", is played before every home game of Newcastle United, Knopfler's local team.Anthony Bateman (2008). Sporting Sounds: Relationships Between Sport and Music. p. 186. Routledge Also, during this time Knopfler produced Bob Dylan's Infidels which also featured Straits' member Alan Clark, as well as Aztec Camera and Willy DeVille. Also in 1984, John Illsley released his first solo album, Never Told a Soul, to which Mark Knopfler, Alan Clark and Terry Williams contributed.", "Mark Knopfler announced the dissolution of Dire Straits in September 1988. He told Rob Tannenbaum in Rolling Stone: \"A lot of press reports were saying we were the biggest band in the world. There's not an accent then on the music, there's an accent on popularity. I needed a rest.\" The tremendous success of the Brothers in Arms album and the tour that went with it left the band members under a significant amount of stress, and Knopfler announced that he wanted to work on more personal projects. A best of / greatest hits compilation Money for Nothing, was released in October 1988 and reached number one in the UK. The group's first hit single \"Sultans of Swing\" was re-released as a single in the UK to promote the album. Also in 1988, John Illsley released his second solo album, Glass, which featured Mark Knopfler, Alan Clark, Guy Fletcher and Chris White. During this period, Alan Clark joined Eric Clapton's band for three years, during which time Knopfler also briefly joined Eric's band.", "The album was produced by Mark Knopfler, Alan Clark, and Guy Fletcher. Several singles were released from the album, some of which achieved success in Europe, Australasia and the United States; however, none were successful in the UK.“Dire Straits”. Official Charts Company. Retrieved 16 March 2021 An edited version of the opening track \"Calling Elvis\" was the first single released from the album. With a video based on the 1960s television show Thunderbirds, the track charted at number 21 on its first week in the UK Singles Chart but dropped out of the charts within four weeks. The track fared much better elsewhere however, reaching the top 10 in Australia, New Zealand and throughout Europe, peaking as high as the number 2 position in several countries, including Denmark and Switzerland, and number 1 in Italy.", "Knopfler, John Illsley, Alan Clark, and Guy Fletcher reunited for one last time on 19 June 1999, with Ed Bicknell on drums, playing five songs, including a performance of Chuck Berry's \"Nadine\" for Illsley's wedding.  In 2002, Mark Knopfler was joined by John Illsley, Guy Fletcher, Danny Cummings and Chris White for four charity concerts. Brendan Croker joined Knopfler during the first half, playing mainly material composed with The Notting Hillbillies. Illsley came on for a Dire Straits session, toward the end of which, at a Shepherd's Bush concert, Jimmy Nail came on to provide backing vocals for Knopfler's solo composition, \"Why Aye Man\". The song appears in the 2002 album The Ragpicker's Dream, an album that contains numerous other references to Knopfler's home area in North East England.", "In December 2009, the band were commemorated with a Heritage Award from PRS for Music. A plaque was placed on a block of flats in Deptford, London, the location where Dire Straits played their first gig.UK Music Heritage Plaque award . Markknopfler.com In 2011, Alan Clark, Chris White, and Phil Palmer, along with Tom Petty and the Heartbreakers' drummer Steve Ferrone, formed a new band, the Straits, to perform at a charity show at the Royal Albert Hall in London. On 13 December 2017, Dire Straits were announced as inductees into the Rock and Roll Hall of Fame for 2018. Speaking to Billboard magazine, John Illsley stated, \"It fills me with a lot of pleasure to be recognized and to be included in the thing that we love doing best, which is making music and playing rock n' roll.\" On a possible reunion performance, he added, \"Mark is quite sort of restrained about things like this. We have spoken about [the induction], and we just said, 'Oh, that's nice.' I think it would probably be important if Mark and I were there. I'll definitely be there, and I'll definitely talk Mark into coming as well. It's essentially up to him if he wants to do anything, and I completely respect his feelings about it. He doesn't want too much white light.\"  Knopfler did not appear at the ceremony, with Illsley stating, \"I'll assure you it's a personal thing. Let's just leave it at that.\" The Rock and Roll Hall of Fame recognised John Illsley, David & Mark Knopfler, Pick Withers, Alan Clark and Guy Fletcher as \"significant members\" of the band. Only Clark, Fletcher and Illsley turned up for the ceremony.", "* Alan Clark: keyboards, producer (1980–1995)"]}, {"page": "Private Dancer", "response": ["* Alan Clark – keyboards (5, 8), percussion (5)"]}, {"page": "Mark Knopfler", "response": ["There were frequent personnel changes within Dire Straits after Making Movies, with Mark Knopfler, Illsley and keyboard player Alan Clark the only constant members.", "In 1990, Knopfler, John Illsley, and Alan Clark performed as Dire Straits at Knebworth, joined by Eric Clapton, Ray Cooper, and guitarist Phil Palmer (who was at that time part of Eric Clapton's touring band), and in January the following year, Knopfler, John Illsley and manager Ed Bicknell decided to reform Dire Straits. Knopfler, Illsley, Alan Clark, and Guy Fletcher set about recording what turned out to be their final studio album accompanied by sidemen Phil Palmer, pedal steel guitarist Paul Franklin, percussionist Danny Cummings and Toto drummer Jeff Porcaro.", "In 2018, the band was inducted into the Rock and Roll Hall of Fame. Knopfler did not attend the induction ceremony, however remaining members John Illsley, Guy Fletcher and Alan Clark were in attendance to accept the award on behalf of the band. Dire Straits remains one of the most popular popular British rock bands as well as one of the world's most commercially successful bands, with worldwide album sales of more than 120 million."]}, {"page": "Brothers in Arms (album)", "response": ["Before arriving at Montserrat, Knopfler had written all the songs and rehearsed them with the band. The studio lineup included Knopfler (guitar), John Illsley (bass), Alan Clark (piano, Hammond B-3 organ and synthesisers) and Guy Fletcher, who was new to the band, playing a synth rig that consisted of a huge new Yamaha DX1, a couple of Roland synthesizers and a Synclavier. The band’s then drummer Terry Williams was present at the start of the sessions before being temporarily replaced. The band's second guitarist Hal Lindes was either fired or quit at the start of the sessions (Lindes was formally replaced in December 1984 by Jack Sonni, a New York-based guitarist and longstanding friend of Knopfler's, although Sonni's contribution to the album was minimal). ", "* Alan Clark – keyboards"]}, {"page": "Making Movies", "response": ["David Knopfler left Dire Straits in August 1980 during the recording of the album, following heated arguments with his brother.  His guitar tracks were almost complete for the album, but were re-recorded by Mark. David appears on video playing \"Solid Rock\" and \"Les Boys\" live in concert, but these performances preceded the recording. The album sessions continued with Sid McGinnis on rhythm guitar, although he was uncredited on the album. Dire Straits expanded into a quintet when keyboard player Alan Clark and Californian guitarist Hal Lindes were recruited as full-time group members shortly after the album's release in October 1980.", "With new group members Alan Clark and Hal Lindes on board, Dire Straits embarked on tours of Europe, North America, and Oceania from October 1980 until July 1981 to promote the album."]}, {"page": "On Every Street", "response": ["By this time, the band comprised Knopfler, John Illsley, Alan Clark and Guy Fletcher, and the album features session musicians including Paul Franklin, Phil Palmer, Danny Cummings and American drummer Jeff Porcaro from Toto.", "*Alan Clark – organ, piano, synthesizers, production", "Category:Albums produced by Alan Clark (keyboardist)"]}, {"page": "Journeyman (album)", "response": ["* Alan Clark – synth horns (1), Hammond organ (1, 4), sequenced bass (1), keyboards (3), synthesizers (8), synth strings (9)"]}, {"page": "Love over Gold", "response": ["Following the end of the On Location Tour on 6 July 1981 in Luxembourg, Mark Knopfler began writing songs for Dire Straits' next album. Alan Clark (keyboards) and Hal Lindes (guitar), who joined the band for the On Location Tour, would also be involved with the new album. This was also the last album to feature drummer Pick Withers.", "* Alan Clark – piano, organ, synthesizers"]}, {"page": "Alchemy: Dire Straits Live", "response": ["* Alan Clark – keyboards"]}, {"page": "Alan Clark (disambiguation)", "response": ["Alan Clark (1928–1999) was a British politician.", "*Alan Clark (bishop) (1919–2002), Bishop of East Anglia", "*Alan Clark (keyboardist) (born 1952), British keyboardist with Dire Straits", "*Alan Clark (television executive) (born 1949), Canadian television executive ", "*Alan Clark (businessman) (born 1959), South African businessman", "*Alan Clark (Arkansas politician) (born 1960), member of the Arkansas State Senate", "*Alan Clarke (1935–1990), British film director", "*Alan Clarke (sports commentator) (1920–1969), BBC sports commentator", "*Alan Clarke (footballer, born 1962), Irish football midfielder"]}, {"page": "Lindisfarne (band)", "response": ["On 19 November 2005, the friends and colleagues of Alan Hull held a memorial concert at Newcastle City Hall and included Alan Clark, Brendan Healy, Tim Healy, Ian McCallum, The Motorettes, Jimmy Nail, Tom Pickard, Prelude, Paul Smith and Kathryn Tickell. Proceeds from the concert were donated to The North East Young Musicians Fund. The Alan Hull Award for young musicians in the North East was set up a year later in response to the success of the concert."]}, {"page": "Most Haunted", "response": ["Most Haunted's music was originally composed to picture by Alan Clark, using his own original sounds and samples and including some from the Spectrasonics sample libraries Distorted Reality, Metamorphosis and Biazzare Guitar. As of series 12, Clark's music has been supplemented with additional stock music which was also used on the now defunct Unexplained Channel programme, Rest in Peace. Living TV also released a CD featuring Clark's music remixed and original material written and produced by composer and producer Steve Deakin-Davies (The Official Most Haunted soundtrack Vol 1 The Ambition Company/Solo MH104)"]}, {"page": "Infidels (Bob Dylan album)", "response": ["Knopfler suggested Alan Clark for keyboards as well as engineer Neil Dorfsman, both of whom were hired. According to Knopfler, it was Dylan's idea to recruit Robbie Shakespeare and Sly Dunbar as the rhythm section. Best known as Sly & Robbie, Shakespeare and Dunbar were famed reggae producers as well as recording artists signed to Island Records.", "*Alan Clark – keyboards"]}, {"page": "Bob Dylan discography", "response": ["| \"Don't Fall Apart on Me Tonight (Version 2)\" || rowspan=\"2\" |Albert and David Maysles|| rowspan=\"2\" |Feat. Mark Knopfler, Mick Taylor, Sly Dunbar, Robbie Shakespeare and Alan Clark"]}, {"page": "Stocksfield", "response": ["*Alan Clark (born 1952), ex Dire Straits keyboard player "]}, {"page": "1952 in British music", "response": ["*5 March – Alan Clark, keyboard player"]}, {"page": "List of keyboardists", "response": ["*Alan Clark (Dire Straits, Eric Clapton)"]}, {"page": "Down in the Groove", "response": ["*Alan Clark – keyboards"]}, {"page": "The Bootleg Series Volumes 1–3 (Rare & Unreleased) 1961–1991", "response": ["* Alan Clark — keyboards (disc 3, tracks 10–12), organ (disc 3, track 13)"]}, {"page": "ExtendedancEPlay", "response": ["* Alan Clark – piano, Hammond organ, synthesizer"]}, {"page": "Clapton Chronicles: The Best of Eric Clapton", "response": ["*Alan Clark – bass, organ, sequencing, synthesizer horn"]}]}}