{"wiki_id": "http://www.wikidata.org/entity/Q6769912", "itemLabel": "Mark Sutcliffe", "itemDescription": "British activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Sutcliffe", "wikipedia_page": {"main": "Mark Sutcliffe MBE (born 29 July 1979) was educated at Sawtry Community College before joining the British Army in 1997 aged 17, enlisting into the 2nd Battalion, The Royal Anglian Regiment The Poachers, initially joining C (Northamptonshire) Company. In 1999 he also served with the 1st Battalion The Royal Anglian Regiment part way through their 2-year tour of Londonderry, Northern Ireland. On return Sgt Sutcliffe was selected to join the Close Reconnaissance Platoon (Recce Platoon), over the next 9 years Sgt Sutcliffe served with the Battalion in UK, Cyprus, Jordon, Belize, Northern Ireland, Afghanistan, and Iraq.\nEarly 2003 2 R ANGLIAN attended RAF Manson MOD Fire Services Central Training Establishment, undertaking the emergency breathing apparatus course lasting six weeks. This led to a deployment to Northern Ireland to provide firefighting cover for the UK firefighter dispute 2002–2003.\nIn May 2003 2 R ANGLAIN deployed to Afghanistan as part of  OP FINGAL securing the capital Kabul and surrounding provinces \nIn spring 2006 2 R ANGLIAN deployed to Iraq as part of OP TELIC 8 forming Basra City South Battle group. On 18 July 2006, the Recce Platoon were conducting offensive operations around the area of Al-Hadi and 5-mile market within the city confines of Basra. The patrol was initially contacted by a rocket-propelled grenade (RPG), directly hitting Sgt Sutcliffe on the leg. The blunt trauma was severe, taking his leg off at the point of impact, although, having failed to detonate, continued on its flight path, injuring a young Iraqi child.\nDespite massive blood loss, Sgt Sutcliffe's life was saved by the quick thinking, bravery and true grit of the patrol commander and the soldiers under his command.\n\nSgt Sutcliffe was flown to the British Field Hospital located within Shaibah Logistics Base and underwent immediate surgery, then evacuated by the Tactical Medical Wing (TMW) Royal Air Force to the United Kingdom for further treatment. In November 2006 he took his first steps using a prosthesis whilst posted to DMRC Headley Court.\nSgt Mark Sutcliffe is one of the Hero patrons of Help for Heroes, a member of Blesma and was one of four Military Liaison Officers posted to Selly Oak Hospital, looking after the needs of injured soldiers and their families. Sgt Sutcliffe spent 4 years in this post and was awarded an MBE for his charitable work and as a Military Liaison Officer in the 2012 Queens Birthday Honours List.Sgt Mark Sutcliffe left the British Army late 2013 and took up the post of General Manager at the disabled children's charity:  Reach Out Plus He then joined another disabled children's charity FamiliesUnitedNetwork as their managing director. In 2015 he was appointed as Chief Executive Citizens Advice Beds & District.\nAn avid veteran leader, disability rights campaigner, in particular veteran disablement as a result of service on operations.", "link_mentions": [{"page": "Caravan (magazine)", "response": ["Contributors and industry experts appearing in the magazine have included Mike Cazalet, Mark Sutcliffe, Andrew Ditton, John Chapman, Lindsay Porter, John Wickersham, Nick Harding, Natalie Cumming and Stuart Craig."]}, {"page": "Sgt Mark Sutcliffe", "response": ["#REDIRECT Mark Sutcliffe"]}, {"page": "Mark Sutcliffe (disambiguation)", "response": ["Mark Sutcliffe (born 1979) is a British Army soldier.", "Mark Sutcliffe may also refer to:", "*Mark Sutcliffe, singer and guitarist in the English band Trespass", "*Mark Sutcliffe, goalkeeper for the New Zealand Rangers A.F.C.", "*Mark Sutcliffe, CEO of Hong Kong Football Association"]}, {"page": "Mark Sutcliffe (British Army soldier)", "response": ["#REDIRECT Mark Sutcliffe"]}, {"page": "Mark Sutcliffe MBE", "response": ["#REDIRECT Mark Sutcliffe"]}, {"page": "Sutcliffe, Mark", "response": ["#redirectMark Sutcliffe"]}]}}