{"wiki_id": "http://www.wikidata.org/entity/Q6767176", "itemLabel": "Mark Cousins", "itemDescription": "English association football player (born 1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Cousins_(footballer)", "wikipedia_page": {"main": "Mark Richard Cousins (born 9 January 1987) is an English footballer who plays as a goalkeeper for Bromley.", "link_mentions": [{"page": "Ademola Bankole", "response": ["Bankole left MK Dons in early 2008, joining Nuneaton Borough before being signed by Colchester United as goalkeeper cover for Aidan Davison following Mark Cousins being taken ill with appendicitis, also signing as a temporary coach for the club. Bankole did not make an appearance for Colchester, but was named as permanent goalkeeping coach at the club following Davison's retirement and subsequent move to the United States."]}, {"page": "Mark Cousins", "response": ["Mark Cousins may refer to:", "* Mark Cousins (filmmaker) (born 1965), Northern Irish writer, director and producer", "* Mark Cousins (footballer) (born 1987), goalkeeper", "* Mark Cousins (writer) (1947-2020), British intellectual"]}, {"page": "Cousins (surname)", "response": ["* Mark Cousins (footballer)"]}, {"page": "John Sullivan (English footballer)", "response": ["The next season, Sullivan was told by manager Chris Powell he will be loaned out, to earn more playing time. Eventually on 9 November 2012, he signed on a one-month loan to League One side Colchester United He joined Colchester United for the replacement for Mark Cousins, who is being on the sidelines. After making his debut against Crewe, Sullivan says joined the club, citing playing time as the main reason. His loan spell at Colchester United had come to an end, following a conclusion to his loan spell, but willing to return to the club."]}, {"page": "2009–10 Colchester United F.C. season", "response": ["|12||Mark Cousins||GK||||Chelmsford||||15||0||Youth team||1 August 2004||Free transfer"]}, {"page": "2010–11 Colchester United F.C. season", "response": ["On 24 August, in the League Cup second round, Premier League Sunderland hosted Colchester at the Stadium of Light. Two first-half errors from Mark Cousins handed Sunderland victory, with Darren Bent capitalising on both occasions.", "Pat Baldwin was ruled out with an ankle injury for the remainder of the season, prompting Ward to sign Huddersfield's Nathan Clarke on loan, while Mark Cousins replaced Williams in goal following another injury.", "|12||Mark Cousins||GK||||Chelmsford||||17||0||Youth team||1 August 2004||Free transfer", "|align=\"left\"|Mark Cousins"]}, {"page": "Andy Bond (footballer)", "response": ["Bond signed for League One club Colchester United on 30 June 2010 on a two-year contract. Manager John Ward  described him as \"a marauding midfield player with a lot of energy and running work in him.\" He made his Football League debut on 7 August when starting in a 2–2 draw away to Exeter City. On 26 July 2011, Bond was involved in a nasty clash of heads with goalkeeper Mark Cousins during a friendly against local rivals Ipswich Town. With medical treatment required at the stadium, the match was abandoned by the match officials, with Bond then taken straight to hospital. He was released from hospital the following day. He went on to make 43 appearances in the 2011–12 season, scoring 4 goals. Bond joined his former club Crewe Alexandra, now in League One, on 28 September 2012 on a one-month loan."]}, {"page": "2008–09 Colchester United F.C. season", "response": ["|23||Mark Cousins||GK||||Chelmsford||||2||0||Youth team||1 August 2004||Free transfer", "|align=\"left\"|Mark Cousins"]}, {"page": "2007–08 Colchester United F.C. season", "response": ["|23||Mark Cousins||GK||||Chelmsford||||0||0||Youth team||1 August 2004||Free transfer", "|Mark Cousins"]}, {"page": "2006–07 Colchester United F.C. season", "response": ["|23||Mark Cousins||GK||||Chelmsford||||0||0||Youth team||1 August 2004||Free transfer", "|Mark Cousins"]}, {"page": "2005–06 Colchester United F.C. season", "response": ["|23||Mark Cousins||GK||||Chelmsford||||0||0||Youth team||1 August 2004||Free transfer"]}, {"page": "2004–05 Colchester United F.C. season", "response": ["|35||Mark Cousins||GK||||Chelmsford||||0||0||Youth team||1 August 2004||Free transfer", "|Mark Cousins"]}, {"page": "2011–12 Colchester United F.C. season", "response": ["|12||Mark Cousins||GK||||Chelmsford||||33||0||Youth team||1 August 2004||Free transfer"]}, {"page": "Chris Bush (English footballer)", "response": ["He moved to Bromley in May 2019. On 28 September 2019, following an injury to goalkeeper Mark Cousins, Bush played in goal for the rest of the match against Yeovil Town as there was no substitute goalkeeper. He allowed three goals in a 3–1 loss."]}, {"page": "2012–13 Colchester United F.C. season", "response": ["Colchester's league campaign kicked off on 18 August with a 0–0 draw at Preston North End, with Mark Cousins producing a string of saves in the U's goal to preserve an opening day point. Colchester then held Portsmouth to a 2–2 draw at the Community Stadium, with a first U's goal for Michael Rose and Magnus Okuonghae scoring the other. Jordan Obita struck late on to earn a point for the away team.", "|1||Mark Cousins||GK||||Chelmsford||||44||0||Youth team||1 August 2004||Free transfer", "|align=\"left\"|Mark Cousins"]}, {"page": "2013–14 Colchester United F.C. season", "response": ["Colchester's development squad was bolstered first by the signing of Milton Keynes Dons youth-team product Mason Spence, and the news that young striker Freddie Ladapo had signed a new one-year contract to remain with the club. Goalkeeper Mark Cousins also extended his stay at the club, agreeing a new one-year contract on 14 June.", "|1||Mark Cousins||GK||||Chelmsford||||70||0||Youth team||1 August 2004||Free transfer", "|Mark Cousins"]}, {"page": "2014–15 Colchester United F.C. season", "response": ["Long-serving goalkeeper Mark Cousins decided to end his ten-year association with the club to instead sign for Dagenham & Redbridge on 23 June.", "|Mark Cousins"]}, {"page": "2014–15 Dagenham & Redbridge F.C. season", "response": ["!scope=\"row\"|Mark Cousins"]}, {"page": "2015–16 Dagenham & Redbridge F.C. season", "response": ["!scope=\"row\"|Mark Cousins"]}]}}