{"wiki_id": "http://www.wikidata.org/entity/Q6762213", "itemLabel": "Marianne Elliott", "itemDescription": "Irish historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Marianne_Elliott_(historian)", "wikipedia_page": {"main": "Marianne Elliott  (born 1948) is an Irish historian who was appointed OBE in the 2000 Birthday Honours.", "link_mentions": [{"page": "May 25", "response": ["*  1948   – Marianne Elliott, Northern Irish historian, author, and academic "]}, {"page": "Christopher Ewart-Biggs Memorial Prize", "response": ["*2015–17: Special Award, Marianne Elliott (for her achievement in advancing the understanding of Irish history in Britain)"]}, {"page": "Plantation of Ulster", "response": ["Since 1606, there had been substantial lowland Scots settlement on disinhabited land in north Down, led by Hugh Montgomery and James Hamilton.A.T.Q. Stewart: The Narrow Ground: The Roots of Conflict in Ulster. London, Faber and Faber Ltd. New Edition, 1989. Page 38. Cyril Falls: The Birth of Ulster. London, Constable and Company Ltd. 1996. Pages 156–157. M. Perceval-Maxwell: The Scottish Migration to Ulster in the Reign of James 1. Belfast, Ulster Historical Foundation. 1999. Page 55. In 1607 Sir Randall MacDonnell settled 300 Presbyterian Scots families on his land in Antrim.Marianne Elliott: The Catholics of Ulster: A History. New York, Basic Books. 2001. Page 88.", "Despite the fact that the Plantation had decreed that the Irish population be displaced, this did not generally happen in practice. Firstly, some 300 native landowners who had taken the English side in the Nine Years' War were rewarded with land grants.Lenihan p 46 Secondly, the majority of the Gaelic Irish remained in their native areas, but were now only allowed worse land than before the plantation. They usually lived close to and even in the same townlands as the settlers and the land they had farmed previously.Marianne Elliott. \"Personal Perspective\", BBC.  A.T.Q. Stewart: Pages 24–25. J. Bardon: A History of Ulster. P 131. Cyril Falls: The Birth of Ulster Page 221. M. Perceval-Maxwell: The Scottish Migration to Ulster in the Reign of James 1 P 66. Marianne Elliott: P 88. P. Robinson The Plantation of Ulster. Page 100. The main reason for this was that Undertakers could not import enough English or Scottish tenants to fill their agricultural workforce and had to fall back on Irish tenants.Canny, p 233–235 However, in a few heavily populated lowland areas (such as parts of north Armagh) it is likely that some population displacement occurred.Elliott, p 93.", "The attempted conversion of the Irish to Protestantism was generally a failure. One problem was language difference. The Protestant clerics imported were usually all monoglot English speakers, whereas the native population were usually monoglot Irish speakers. However, ministers chosen to serve in the plantation were required to take a course in the Irish language before ordination, and nearly 10% of those who took up their preferments spoke it fluently.Padraig O Snodaigh. Nevertheless, conversion was rare, despite the fact that, after 1621, Gaelic Irish natives could be officially classed as British if they converted to Protestantism.Lenihan p 49 Of those Catholics who did convert to Protestantism, many made their choice for social and political reasons.Marianne Elliott.", "By the 1630s it is suggested that the plantation was settling down with \"tacit religious tolerance\", and in every county Old Irish were serving as royal officials and members of the Irish Parliament.Marianne Elliott: The Catholics of Ulster: A History. New York, Basic Books. 2001. Page 97. However, in the 1640s, the Ulster Plantation was thrown into turmoil by civil wars that raged in Ireland, England and Scotland. The wars saw Irish rebellion against the planters, twelve years of bloody war, and ultimately the re-conquest of the province by the English parliamentary New Model Army that confirmed English and Protestant dominance in the province.Canny p577-578", "On 23 October 1641, the Ulster Catholics staged a rebellion. The mobilised natives turned on the British colonists, massacring about 4000 and expelling about 8,000 more. Marianne Elliott believes that \"1641 destroyed the Ulster Plantation as a mixed settlement\".Marianne Elliott: The Catholics of Ulster: A History. New York, Basic Books. 2001. Page 102. The initial leader of the rebellion, Felim O'Neill, had actually been a beneficiary of the Plantation land grants. Most of his supporters' families had been dispossessed and were likely motivated by the desire to recover their ancestral lands.  Many colonists who survived rushed to the seaports and went back to Great Britain.Brian MacCuarta,Age of Atrocity p155, Canny p177", "* Marianne Elliott, Catholics of Ulster: A History"]}, {"page": "Irish Rebellion of 1798", "response": ["Contemporary estimates put the death toll from 20,000 (Dublin Castle) to as many as 50,000 of which 2,000 were military and 1,000 loyalist civilians.Richard Musgrave \"Memoirs of the different rebellions in Ireland\" (1801) (see Appendices) Some modern research argues that these figures may be too high. Firstly, a list of British soldiers killed, compiled for a fund to aid the families of dead soldiers, listed just 530 names. Secondly, professor Louis Cullen, through an examination of depletion of the population in County Wexford between 1798 and 1820, put the fatalities in that county due to the rebellion at 6,000. Historian Thomas Bartlett therefore argues, \"a death toll of 10,000 for the entire island would seem to be in order\".Bartlett in Smyth, ed, p100 Other modern historians believe that the death toll may be even higher than contemporary estimates suggest as the widespread fear of repression among relatives of slain rebels led to mass concealment of casualties.Marianne Elliott, \"Rebellion, a Television history of 1798\" (RTÉ 1998)"]}, {"page": "List of Irish historians", "response": ["* Marianne Elliott"]}, {"page": "Plantations of Ireland", "response": ["The Plantation of Ulster was a mixed success for the English. By the 1630s, there were 20,000 adult male English and Scottish settlers in Ulster, which meant that the total settler population could have been as high as 80,000 to 150,000. They formed local majorities of the population in the Finn and Foyle valleys (around modern Derry and east Donegal), north Armagh and east Tyrone. Planters had achieved substantial settlement on unofficially planted lands in north Down, led by James Hamilton and Hugh Montgomery,A. T. Q. Stewart: The Narrow Ground: The Roots of Conflict in Ulster. London, Faber and Faber Ltd. New Edition, 1989. p. 38. Cyril Falls: The Birth of Ulster. London, Constable and Company Ltd. 1996. pp. 156–157. M. Perceval-Maxwell: The Scottish Migration to Ulster in the Reign of James 1. Belfast: Ulster Historical Foundation. 1999. p. 55. and in south Antrim under Sir Randall MacDonnell.Marianne Elliott: The Catholics of Ulster: A History. New York: Basic Books. 2001. p. 88. The settler population increased rapidly, as just under half of the migrants were women – a very high ratio compared, for instance, to contemporary Spanish settlement in Latin America or English settlement in Virginia. New England attracted more families, but still was predominately male in its early years.Lenihan, Consolidating Conquest, p. 54Lenihan, Confederate Catholics at War, p. 7"]}, {"page": "France–United Kingdom relations", "response": ["In 1798 French forces invaded Ireland to assist the United Irishmen who had launched a rebellion. Although the French joined by thousands of rebels, they were defeated by British and Irish loyalist forces. The fear of further attempts to create a French satellite in Ireland led to the Act of Union, merging the Kingdom of Great Britain and Kingdom of Ireland to create the United Kingdom in 1801. Ireland now lost its last vestiges of independence.Marianne Elliott, Partners in Revolution: The United Irishmen and France (Yale UP, 1982)"]}, {"page": "Dominican College, Fortwilliam", "response": ["* Marianne Elliott (b. 1948) - academic historian."]}, {"page": "1948 in Northern Ireland", "response": ["**Marianne Elliott, historian and academic."]}, {"page": "Hedge school", "response": ["* Marianne Elliott, The Catholics of Ulster, Penguin 2001, at pp. 179–181."]}, {"page": "Ford Lectures", "response": ["* 2004–05 Marianne Elliott, Religion and Ireland"]}, {"page": "Brian McGurk", "response": ["Brian McGurk was Dean of Armagh for forty years and parish priest of Termonmagurk 1660-1672, arrested five times under the penal law statute, but who out-witted the courts with his knowledge of canon and civil laws yet dying at ninety-one in Armagh gaol. He is still revered as a 'white martyr' in Termonmagurk where both churches, Catholic and Protestant are under the patronage of St. Columcille, the McGurks being the saint's coarbs and erenaghs in that parish.The Catholics of Ulster: A History. Marianne Elliott. Allen Lane: The Penguin Press. [pound]25.00. 642 pp. ."]}, {"page": "Elliot", "response": ["*Marianne Elliott (historian) (1948-), British historian of Ireland", "*Marianne Elliott (director) (1966-), British theatrical director"]}, {"page": "Battle of Tory Island", "response": ["Savary's return to port marked the end of the last attempt by a continental nation to land troops in Ireland. French losses in the operation were so severe that a repeat effort was never seriously contemplated. Similarly, the huge Irish losses during the rebellion, combined with British reprisals against the Irish populace, ended any hopes of reigniting the uprising in the near future. Most serious of all for the United Irishmen was the arrest of Wolfe Tone himself, who was discovered among the prisoners taken from Hoche at Buncrana. Tone was charged with treason and sentenced to death, though he committed suicide in Dublin before the sentence could be carried out.Tone, (Theobald) Wolfe, Oxford Dictionary of National Biography, Marianne Elliott, (subscription required), Retrieved on 6 March 2008."]}, {"page": "Order of battle at the Battle of Tory Island", "response": ["The delay caused by the pursuit of Bompart by the frigates under George Countess allowed the British to dispatch a more substantial squadron under Warren to the Donegal coast. Thus when Bompart arrived in the lee of Tory Island, he soon found himself threatened on all sides by a superior British force. Despite the damage his ships had suffered in the heavy weather conditions, Bompart attempted to escape but was swiftly run down and defeated in battle, his flagship and four frigates being captured and towed into Lough Swilly.Gardiner, p. 114 Among the prisoners seized on board the flagship was Theobald Wolfe Tone, leader of the United Irishmen, whose capture and subsequent death signified the end of the rebellion.Tone, (Theobald) Wolfe, Oxford Dictionary of National Biography, Marianne Elliott, Retrieved 6 March 2008 Over the next week, the scattered French survivors desperately attempted to reach the safety of French harbours in the face of dozens of British warships cruising along their homeward route. Only three made it, three others being hunted down and captured, one just a few miles from the entrance to Brest.James, p. 135 The French never again attempted an invasion of Ireland."]}, {"page": "2000 Birthday Honours", "response": ["* Professor Marianne Elliott, Professor of Modern History, University of Liverpool. For services to Irish Studies and to the Northern Ireland Peace Process."]}, {"page": "1886 Belfast riots", "response": ["In the late 19th century, Catholics began to migrate in large numbers to the prosperous city of Belfast in search of work.Marianne Elliott, (2000), The Catholics of Ulster: A History, London: Penguin, p. 322. By the time of the riots, Catholics made up over one-third of the population of the city.Elliott (2000), p. 323. This migration brought with it sectarian tensions as Catholics and Protestants competed for jobs. As the minority, Catholics found themselves discriminated against in this area and were kept at the lower end of the labour market.Elliott (2000), p. 324."]}, {"page": "Leo Gershoy Award", "response": ["*1983 — Marianne Elliott,  Partners in Revolution: The United Irishmen and France "]}, {"page": "List of Irish women writers", "response": ["*Marianne Elliott (born 1948), historian"]}, {"page": "Gilbert McIlveen", "response": ["* Marianne Elliott 2012, Wolfe Tone Second edition, Liverpool University Press"]}, {"page": "Thomas McCabe (United Irishmen)", "response": ["* Marianne Elliott 2012, Wolfe Tone Second edition, Liverpool University Press"]}, {"page": "Trevor Elliott (geoscientist)", "response": ["He was married to Marianne Elliott, director of Liverpool University's Institute of Irish Studies."]}, {"page": "Elliott, Marianne", "response": ["#REDIRECT Marianne Elliott (historian)"]}, {"page": "Revisionism (Ireland)", "response": ["* Marianne Elliott"]}, {"page": "Dublin Review of Books", "response": ["*Marianne Elliott, historian"]}, {"page": "Marianne Elliott", "response": ["Marianne Elliott may refer to:", "* Marianne Elliott (director) (born 1966), British theatre director", "* Marianne Elliott (historian) (born 1948), Irish historian"]}, {"page": "List of women writers (A–L)", "response": ["*Marianne Elliott (living, Ireland/England), historian"]}]}}