{"wiki_id": "http://www.wikidata.org/entity/Q6769461", "itemLabel": "Mark Roberts", "itemDescription": "English association football player (1983-)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Roberts_(footballer,_born_1983)", "wikipedia_page": {"main": "Mark Alan Roberts (born 16 October 1983) is an English footballer who plays as a defender for Northern Premier League Premier Division club Warrington Town.\nRoberts started his career at Crewe Alexandra at the age of 11, and progressed through the club's academy; signing a professional contract at the age of 19. He played six times during his seven years for Crewe's first team, and was sent out on loan six times during his spell at the club. Following a loan spell at his hometown club, Northwich Victoria, he joined the club on a permanent basis in 2007. Roberts played 20 games for the Cheshire club during the second half of the 2006–07 season, before returning to the Football League with Accrington Stanley in summer 2007. He played 37 games for the club, before being loaned back to Northwich Victoria, a move which was later made permanent.\nDuring the 2008–09 season, Roberts joined Stevenage on an initial one-month loan agreement, before signing permanently in January 2009 for an undisclosed fee. That season, he was part of the team that won the FA Trophy in May 2009. Roberts was made team captain ahead of the 2009–10 season, a season in which Roberts would help lead the team to the Football League for the first time in the club's history. The following season, the club earned back-to-back promotions following their sixth-place finish and subsequent League Two play-off victory in May 2011. He also spent two spells as caretaker manager of the club, once in January 2012 and again in March 2013.\nAfter a successful four-and-a-half-year spell at Stevenage, Roberts joined Fleetwood Town on a free transfer in July 2013. He captained Fleetwood to promotion via the play-offs during his first season with the club. After two seasons at Fleetwood, Roberts joined League Two club Cambridge United in May 2015, where he spent two seasons. He subsequently spent the 2017–18 season at fellow League Two club Forest Green Rovers, before signing for Warrington Town of the Northern Premier League in August 2018.", "link_mentions": [{"page": "Northwich", "response": ["thumb|140px|Mark Roberts, 2009", "* Mark Roberts (born 1983 in Northwich) is an English professional footballer played in 440 matches"]}, {"page": "Professional Footballers' Association", "response": ["*Mark Roberts (Warrington Town, Northern Premier League)"]}, {"page": "Stevenage F.C.", "response": ["* 2009   Mark Roberts", "* 2012   Mark Roberts"]}, {"page": "Chris Beardsley", "response": ["Beardsley played as a striker, and was described by his Stevenage teammate Mark Roberts as the \"perfect man to lead the line\", because of his work ethic."]}, {"page": "Scott Laird", "response": ["Laird continued to be the club's first-choice left-back throughout the 2009–10 season. He scored his first goal of the season in a 2–0 victory over Histon at Bridge Road on 31 August 2009. He also scored the winning goal with an 85th-minute strike against local rivals Luton Town, securing a 1–0 victory at Kenilworth Road in the first ever league meeting between the two clubs.  His second-half penalty gave Stevenage a 1–0 victory over second-placed Oxford United on 30 March 2010; meaning Stevenage moved eight points clear of Oxford at the top of the Conference Premier league table. Laird made 53 appearances as Stevenage won promotion to the Football League for the first time in their history. The appearance tally was more than any other player for the club during the season, scoring six goals. He was voted as Stevenage's Player of the Year at the end of the season. Upon the conclusion of the season, Laird signed a new two-year contract extension with the Hertfordshire club in May 2010. He was voted as the 2009–10 Young Player of the Year at the National Game Awards. At the Football Conference's Annual Presentation Dinner, Laird was also named in the Team of the Year, alongside fellow Stevenage defenders Ronnie Henry and Mark Roberts."]}, {"page": "Mark Roberts", "response": ["Mark Roberts may refer to:", "* Mark Roberts (actor) (1921–2006), American stage, film and television actor", "* Mark Roberts (archaeologist) (born 1961), English archaeologist", "* Mark Roberts (Australian footballer) (born 1965), Australian rules footballer", "* Mark Roberts (businessman), Welsh businessman", "* Mark Roberts (footballer, born 1975), Scottish footballer, currently playing for Hurlford United", "* Mark Roberts (footballer, born 1983), English footballer, currently playing for Forest Green Rovers", "* Mark Roberts (TV producer) (born 1961), American television producer, actor, writer", "* Mark Roberts (musician) (born 1967), Welsh singer with Catatonia", "* Mark Roberts (streaker) (born 1964), British streaker", "* Mark Roberts (rugby league, born 1982), Welsh rugby league player", "* Mark Robertson (disambiguation)"]}, {"page": "Chris Robertson (footballer, born 1986)", "response": ["Robertson was born in Dundee, but moved to Nottingham with his family at the age of two. He joined Sheffield United as a trainee before he signed professional forms with the \"Blades\" in July 2005. Prior to this, manager Neil Warnock sent Robertson to join Leigh RMI of the Conference on loan in the 2004–05 season, and he went on to make five appearances for the \"Leythers\" under the management of Phil Starbuck. Robertson joined League Two side Chester City on loan on 1 February 2006, making his league debut as a half-time substitute for Mark Roberts in a 5–0 defeat to Carlisle United at Brunton Park three days later. However Chester manager Keith Curle cancelled his loan spell after a week, along with the loan spells of Wayne Corden, Mark Roberts, and Evan Horwood."]}, {"page": "Ronnie Henry", "response": ["The following season, Henry continued to be the club's first choice right-back, and he scored his third goal for Stevenage in a 2–0 victory over Eastbourne Borough on 8 September 2009. The season proved to be a successful one both individually and collectively for Henry and Stevenage, playing 48 times, scoring once, as the club earned promotion to the Football League for the first time in the club's history after winning the Conference Premier title. At the Football Conference's Annual Presentation Dinner, Henry was named in the Conference Premier Team of the Year, alongside fellow Stevenage defenders Scott Laird and Mark Roberts. A month into the 2010–11 season, Henry made his 250th appearance for Stevenage in a 0–0 draw at home to Torquay United, the club's first clean sheet of the season. After the match, manager Graham Westley said \"he's a stalwart. He's been a tremendous servant for the club over the years. He's helped the club from where it was all the way in to the Football League\". Henry played 51 games during the club's first ever season in the Football League, as they earned promotion to League One after winning the 2010–11 League Two play-offs, with Stevenage having the best defensive record in the division."]}, {"page": "Jon Ashton", "response": ["He remained at Stevenage for the 2012–13 season, with the club stating that they had rejected several transfer bids for him in the summer, along with fellow centre-back Mark Roberts, from Doncaster Rovers. Ashton made his first appearance of the new season in the club's 1–0 away victory over Leyton Orient on 21 August 2012, and played in eight further matches as Stevenage remained unbeaten in the league during the first two months of the season. He suffered an achilles injury during Stevenage's 2–2 draw with Bury at Broadhall Way on 29 September 2012, which turned out to be his final game of the season. Although he returned to first-team training in January 2013, he ruptured his achilles in a training session, ultimately ruling him out for the remainder of the season. Following the departure of manager Gary Smith in March 2013, Ashton was named as part of the club's coaching staff while the board appointed a new manager. At the end of the season, with Ashton's contract expiring in June 2013, he signed a new two-year deal with Stevenage, thus keeping him contracted to the club until the summer of 2015.", "Ahead of the 2013–14 season, Ashton was appointed club captain following the departure of his predecessor, Mark Roberts. On appointing Ashton as captain, Stevenage manager Graham Westley described him as \"the ideal man to lead our team forward. He has a great history at the club, he wins football matches and he leads men. As one fantastic captain departs, so another one is born. He symbolises the desire to succeed that is at the heart of Stevenage and his ambition is stronger than ever\". He made 48 appearances in all competitions during the season, as Stevenage were relegated back to League Two after finishing in last place in the League One standings. He signed a new contract on 17 May 2014. Ashton played 21 times during the 2014–15 campaign, including an appearance in the League Two play-offs as Stevenage were unable to make an immediate return to League One after losing at the semi-final stage. He left Stevenage upon the expiry of his contract in July 2015. During his six years at Stevenage, Ashton made 234 appearances, which ranks him in ninth in the club's all-time appearance records."]}, {"page": "Graham Westley", "response": ["Stevenage started the season poorly, losing three out of their first four games and conceding thirteen goals in the process, including a 5–0 defeat to Wrexham on the first day of the season. The club secured its first victory of the season on 30 August 2008, a 3–1 win away at Barrow, before winning four consecutive matches throughout September. Through the first half of the club's 2008–09 campaign, Westley's team were suffering from the same inconsistency that was common in his first spell as manager of the Hertfordshire club, losing three consecutive matches in November, the last of which was a 2–1 home defeat to Wrexham; it was to be Stevenage's last defeat at Broadhall Way in the league for 18 months. Westley brought in former player, Dino Maamria as first-team coach at the club. This, coupled with signings during the season, such as Chris Day, Mark Roberts, and Jon Ashton, meant that Stevenage improved during the second half of the season. A club record 24-game unbeaten run lasting from December 2008 to April 2009 meant that the club made the Conference Premier play-offs, finishing in the last play-off place. Despite taking a 3–1 lead into the second leg, Stevenage lost 4–3 on aggregate to Cambridge United. The club won the FA Trophy that season, beating York City 2–0 in the Final at Wembley Stadium. The FA Trophy success was Westley's first managerial honours won as manager of Stevenage. After the game, Westley signed a one-year contract extension."]}, {"page": "Dino Maamria", "response": ["Maamria subsequently rejoined former club Stevenage as part of Graham Westley's coaching team in November 2008, appointed as the club's first-team coach. Shortly after joining, Maamria recommended Stevenage sign Mark Roberts, who he had previously managed at Northwich, with Roberts stating he joined the club because of Maamria's belief and desire. Maamria's appointment, alongside a number of new signings such as Roberts and Jon Ashton, coincided with an upturn in form for Stevenage, with the club going on a club record 24-game unbeaten run stretching from December 2008 to April 2009. During the season, he was also included as part of the playing squad, helping the club to its first ever Herts Senior Cup title in April 2009, scoring twice in the final against Cheshunt in a 2–1 victory. Later that month, he made a 90th-minute appearance in Stevenage's 1–0 victory over Ebbsfleet United, in what turned out to be his last professional appearance. Maamria earned his first piece of silverware as first-team coach when the club won the FA Trophy at Wembley Stadium, defeating York City 2–0 in the final on 9 May 2009."]}, {"page": "2009–10 Football Conference", "response": ["|Mark Roberts"]}, {"page": "2009–10 Stevenage Borough F.C. season", "response": ["| Mark Roberts (c)", "The Hertfordshire outfit made it 10 games unbeaten with a 4–0 victory over Hayes & Yeading. Striker Charlie Griffin scored twice in the first-half, and completed his hat-trick from the penalty spot in the 70th minute. Michael Bostwick added a fourth in injury-time. Another victory followed a week later, as Stevenage beat Salisbury City 3–1 at Broadhall Way. Mark Roberts scored his first goal of the season on his 50th appearance for the club just before the interval, before the visitors levelled through substitute Chris Flood after half-time. Charlie Griffin scored his fourth goal in two games to give the Hertfordshire outfit the lead, before Chris Beardsley added a third with his first touch after good work from Yemi Odubade. Three days later, the side drew 0–0 with Wrexham at Broadhall Way. Another draw followed 10 days later, as Stevenage drew 1–1 with Kettering Town at Rockingham Road. Joel Byrom gave Borough the lead courtesy of a second-minute free-kick. The home side equalised in the latter stages of the first-half through Moses Ashikodi to ensure a share of the spoils. After a two-week break from the league, Stevenage got back to winning ways with a 5–3 win over Gateshead at Broadhall Way. The visitors took the lead seven minutes before half-time, Charlie Griffin heading into his own net following Craig Baxter's dangerous free-kick. Two minutes later Griffin atoned for his error by finishing neatly over Paul Farman. Stevenage took the lead five minutes later; Mitchell Cole providing Yemi Odubade with a simple tap-in; his first goal at Broadhall Way. On the stroke of half-time Griffin headed in Scott Laird's inviting cross to ensure a two-goal lead going into the break. However, the away side pulled a goal back through Daryl Clare, before Griffin completed his hat-trick with a drilled free-kick that went in off the post. Clare pounced on a fumbled free-kick to make it 4–3, before Michael Bostwick scored his fifth goal of the season to make it 5–3. Stevenage then travelled to The New Lawn to face Forest Green Rovers a week later. Lee Boylan's fourth-minute goal ultimately proved to be the winner as Borough ran out 1–0 winners.", "This was followed up with a 2–0 mid-week victory over Chester City at Broadhall Way. In what was a comfortable, but unspectacular, game, Stevenage took the lead through Yemi Odubade, who fired in following Mark Roberts' knock down just before half-time. Borough doubled their lead on the hour mark, with Mark Roberts firing home with his back to goal in the box. Four days later, Stevenage won their fourth consecutive league game with a 1–0 win away at Salisbury City, with Charlie Griffin scoring just before half-time. Borough suffered a second league defeat at the hands of Ebbsfleet United at Stonebridge Road. Stevenage took the lead through a deflected effort from Yemi Odubade, but two second-half strikes from Stefan Bailey secured the home side a valuable victory. Four days later, Stevenage returned to winning ways with a 2–0 victory over Kidderminster Harriers at Broadhall Way, with goals from Jon Ashton and Mitchell Cole.", "A week later, at the beginning of March, Stevenage won their second away game on the bounce; beating Eastbourne Borough 6–0. Captain Mark Roberts gave Stevenage the lead just before the break, following a well-worked free-kick involving both Joel Byrom and Scott Laird. After the interval, Stevenage doubled their lead when David Bridges headed in Joel Byrom's cross. It was three shortly after following a mistake from Eastbourne goalkeeper Danny Knowles, Chris Beardsley blocked the goalkeepers clearance and slid the ball into an empty net. It got worse for the home side ten minutes from time when Beardsley chased a long through ball and was hauled down by Darren Baker just inside the area – the defender being shown a straight red. Substitute Mitchell Cole slotted the penalty home, before adding another after good work from Eddie Odhiambo. Cole completed his hat-trick moments later slotting home Stacy Long's through ball. A third successive victory followed in a 2–0 win at home to Crawley Town. In a tight game, Stevenage took the lead just after the interval thanks to a rasping effort from Michael Bostwick after a well-worked corner. A second goal came deep into injury-time, Chris Beardsley countering and setting up Lee Boylan to slide the ball into the net. Three days later, Stevenage beat Barrow 4–0 to ensure a fourth consecutive win. In a tight first half, the home side took the lead through Yemi Odubade. Borough doubled their lead shortly before the interval; left-back Scott Laird firing the ball home. Odubade then scored his second after countering a Barrow corner, and subsequently completed his hat-trick late on with an effort drilled high into the net. Stevenage recorded their fifth straight win, beating Histon 1–0 at Broadhall Way. Jon Ashton scored the only goal of the game when he swept home Stacy Long's corner.", "A week later, Stevenage travelled to Essex to play Grays Athletic. The game ended 2–1 to Stevenage, despite the home side leading at the interval through a Jamie Guy strike. Stevenage turned it around in the second half, with goals from Michael Bostwick and Charlie Griffin. Stevenage followed this up with another away win four days later at Crawley Town; winning the match 3–0. Stevenage started brightly and scored within the first five minutes; Yemi Odubade latching onto David Bridges through ball to slot home. The visitors doubled their lead on the half hour mark, this time Tim Sills was the provider, as Odubade scored his second. Joel Byrom scored Stevenage's third in the second half, picking up the ball a yard inside the Crawley half and chipped Simon Rayner in goal. Stevenage then followed this up with an eighth consecutive victory, beating Oxford United 1–0 at Broadhall Way. The only goal of the game came seven minutes into the second half, David Bridges was fouled in the area by Chris Hargreaves; Scott Laird stepped up and subsequently scored to ensure the home side earned three points. Four days later, Stevenage lost 1–0 to Luton Town thanks to a Matthew Barnes-Homer goal in the second half. Stevenage bounced back just two days later on Easter Monday, with a 3–0 victory over AFC Wimbledon at Kingsmeadow. The away side took the lead in the ninth minute; Mark Roberts bundling home a Joel Byrom corner after Tim Sills had knocked the ball down. Just two minutes later, Stevenage doubled their lead, again Byrom was the provider, and his lofted ball was met on the half-volley by Lawrie Wilson, who lashed the ball home – making his first start since breaking his leg in August. Stevenage rounded off the victory in injury-time, substitute Eddie Odhiambo slotting the ball home from Charlie Griffin's cross. Stevenage then faced Forest Green Rovers at Broadhall Way five days later; the game ended 2–0 to Stevenage. The home side took the lead in the tenth minute; Tim Sills broke the offside trap and set up Joel Byrom to lash the ball home. Stevenage doubled their lead in the second half when substitute David Bridges was brought down in the area. Scott Laird calmly stepped up and stroked the ball into the net. A third win followed four days later, when Stevenage beat Altrincham 1–0 in a tight encounter at Moss Lane. Substitute Charlie Griffin scored the only goal of the game in the 83rd minute; Altrincham goalkeeper Russell Saunders fumbled the ball into the path of Griffin who placed his shot in-between the goalkeeper and the post to ensure a valuable three points to the visitors.", "The draw for the second round of the FA Trophy was made on 14 December 2009, with Stevenage being handed another home tie, this time against Conference North side Vauxhall Motors. Stevenage won the match 6–0. First half goals from Mark Roberts and Lee Boylan gave Borough a two-goal lead going into the interval. After the break, David Bridges scored twice in quick succession, before Andy Drury hit a swerving drive from 25 yards and Stacy Long scored his first goal in Borough colours with a neat chip. The victory means Stevenage face Conference South outfit Dover Athletic at Broadhall Way on 30 January. Stevenage won the match 4–1. The visitors took the lead midway through the first-half courtesy of Shaun Welford's close range effort. Shortly after, Borough equalised through Tim Sills, his first goal for the Hertfordshire side, who threw himself at Chris Beardsley's cross to restore parity. Just before half-time, Stevenage were ahead; Chris Beardsley slotting home after a mistake from Dover's Ollie Schulz. Michael Bostwick made it three just after, before substitute Yemi Odubade added a fourth; volleying home Stacy Long's cross."]}, {"page": "List of Stevenage F.C. players", "response": ["The list also includes those who have won the Stevenage Player of the Year. The Stevenage Player of the Year award is voted for annually by Stevenage's supporters in recognition of the best overall performance by an individual player throughout the football season. Three players have won the award twice; Mark Smith in 1995 and 2001, Jason Goodliffe in 2002 and 2003 and most recently Mark Roberts, in 2009 and 2012. "]}, {"page": "2010–11 Stevenage F.C. season", "response": ["| Mark Roberts (c)", "In June 2010, Stevenage announced that their pre–season campaign would consist of eight friendlies to open the 2010–11 season. Stevenage's proposed friendly against Peterborough United on 27 July was cancelled and was subsequently replaced with a home fixture against local Championship side Watford. Stevenage were due to face Dover Athletic in late July, but the friendly was cancelled at the request of Dover. The first-team squad reported back for pre–season training on 27 June. Stevenage played League One side Yeovil Town in a \"behind closed doors\" match on 13 July in a fixture \"played away from the club's Broadhall Way base\". Stevenage won the match 1–0 courtesy of an 82nd-minute strike from Tim Sills. The following day, Stevenage beat Conference National outfit Histon 2–0 at Bridge Road, with goals in either half from Yemi Odubade and Scott Laird. Trialists Chris Dickson, Warren McBean, and Omer Riza also featured in the match. Two days later, Stevenage travelled to Conference South side Chelmsford City for their third pre–season fixture; with the game ending 1–1. Chelmsford took the lead early in the second–half, before Charlie Griffin equalised for the visitors with ten minutes remaining. Both Dickson and McBean trialled once more, while another trialist, John Grant, also played 45 minutes of the match. Stevenage's fourth pre–season fixture against Championship side Norwich City ended in a 0–0 draw, with Scott Laird missing a penalty in the second half for the hosts. Striker Bas Savage also trialled for Stevenage, coming on as a 50th-minute substitute in the match. Stevenage then entertained another Championship side in the form of newly promoted Millwall, with Stevenage winning the match 2–1. Former Millwall player Peter Vincenti opened the scoring in the first-half, and the lead was doubled early on in the second-half courtesy of new signing Peter Winn. Millwall pulled a goal back with ten minutes remaining through former Stevenage striker Steve Morison. Three days later, Stevenage lost 2–0 to Watford at Broadhall Way, the club's first defeat of the pre–season campaign. The following day, Stevenage beat Corby Town 1–0, with Chris Beardsley's first-half strike proving to be the decider. After the match, it was announced that Stevenage would add another friendly to their schedule, playing local side Hitchin Town on 2 August. In the club's penultimate game of the pre–season campaign, Stevenage lost 1–0 to Conference National side Newport County at Spytty Park. Stevenage won their final pre–season fixture 4–0 against Hitchin Town. Charlie Griffin, Mark Roberts, and Michael Bostwick gave Stevenage a three-goal lead going into the interval, and Chris Beardsley added a fourth in the second half to complete the scoring.", "Stevenage made the short journey to Hertfordshire rivals Barnet in early November. Stevenage won the match 3–0, their third away win of the season. John Mousinho opened the scoring after half an hour, hitting a \"rasping shot\" that found the bottom corner of the goal. The lead was doubled just six minutes later, Mark Roberts sliding in from close range after Michael Bostwick had headed the ball across goal. Mousinho added a third from the penalty spot with ten minutes remaining.", "Stevenage returned to action on 1 January, losing 1–0 to Gillingham at Priestfield courtesy of a first-half strike from Adebayo Akinfenwa. Just hours before the match, Stevenage announced the signing of Byron Harrison from Carshalton Athletic. Harrison started the match, playing 61 minutes before being substituted. Just two days later, Stevenage entertained Barnet at Broadhall Way. Former Stevenage manager Paul Fairclough took caretaker charge of the Barnet side for the game. The game ended 4–2 in Stevenage's favour. The hosts were 2–0 up after just eight minutes, thanks to a Luke Foster strike and a Grant Basey own goal. Stevenage's third came just before the half-hour mark, Chris Beardsley and Rob Sinclair exchanged passes, before Sinclair sent a looping cross into the box that was met on the volley by the arriving Stacy Long. Captain Mark Roberts added a fourth shortly after the interval, his second goal of the season – his first also coming against Barnet. Barnet added two consolation goals in the space of three second-half minutes through Izale McLeod and Mark Marshall. The win meant that Stevenage had secured their first three points since early November. Stevenage then fell to another away defeat, this time losing 1–0 at Chesterfield at the B2net Stadium, with Chesterfield scoring just before the interval. A week later, Stevenage secured their second consecutive home victory with a 2–0 win against Morecambe at Broadhall Way. Both of the goals came in the first ten minutes of the match – Scott Laird scored the first goal, turning John Mousinho's cross into the net after just five minutes. Four minutes later, Laird's cross was sliced into the net by Morecambe defender Kieran Charnock. Stevenage then followed this up with another home victory three days later, this time winning 3–0 against Rotherham United. Peter Winn opened the scoring just before the interval, cutting inside from the right wing and lashing a shot that beat Rotherham goalkeeper Andy Warrington at his near post. Substitute Byron Harrison scored his first goal for the club just three minutes after coming off the bench, scoring from close range after Rob Sinclair's right wing cross. Scott Laird then added a third in injury-time, collecting Lawrie Wilson's pass and curling the ball into the top right hand corner of the goal.", "February began with Stevenage playing their third consecutive home league game, entertaining Gillingham at Broadhall Way, with the game ending 2–2. Stevenage opened the scoring midway through the first-half, Byron Harrison, starting only his second game for the club, heading in Lawrie Wilson's deep cross. Gillingham equalised in first-half injury time, Cody McDonald scoring from close range. The visitors took the lead just after the interval, Adebayo Akinfenwa, who also scored for Gillingham in the reverse fixture, scored from six yards out following good work by Joe Martin. Stevenage manager Graham Westley made two second-half changes, bringing on Ben May and Peter Winn, the latter supplying the cross for Harrison to score his second with fifteen minutes remaining to restore parity. Another 2–2 draw followed three days later, this time against Accrington Stanley. Stevenage had a two-goal lead courtesy of strikes from Byron Harrison and Lawrie Wilson, but two late Accrington goals meant that the points were shared. Three days after the draw with Accrington, Stevenage travelled to Gigg Lane for their first ever game against Bury. The game ended 3–0 to Bury, courtesy of goals from Andy Bishop, ex-Stevenage defender Efe Sodje, and Ryan Lowe. Stevenage fell to their fifth consecutive away defeat just four days later, losing 1–0 at Shrewsbury Town courtesy of a first-half Nicky Wroe strike. The club made it five league games without victory on 15 February, drawing 0–0 at home to Oxford United. Four days after the stalemate with Oxford, Stevenage secured their first away win in four months, winning 1–0 at Crewe Alexandra courtesy of an 87th-minute goal from Byron Harrison – Stevenage's first away goal in the league since 2 November 2010. This was followed up with another away win three days later, this time securing three points against Port Vale at Vale Park, winning the match 3–1. Stevenage took the lead fifteen minutes before the interval when Anthony Griffith's 30-yard backpass took a bobble and rolled over Port Vale goalkeeper Chris Martin's foot. The visitors doubled their lead seven minutes later when Peter Winn scored a low drilled effort. Port Vale got a goal back through Sam Morsy, but David Bridges restored Stevenage's two-goal lead after Byron Harrison's cross had ricocheted off the goalkeeper and fell to the feet of Bridges. Stevenage's last game of February was a home game against Cheltenham Town, with Stevenage securing their third consecutive league victory, winning the game 4–0. Goals from Mark Roberts and Byron Harrison had given Stevenage a two-goal lead going into half-time. Michael Bostwick added a third in the 52nd minute, lashing the ball across goal from just inside the area after a tidy interchange with Byron Harrison. Two minutes later, Harrison then added his second of the game, and Stevenage's fourth, when he headed in Lawrie Wilson's right wing cross.", "Two second-half Torquay United goals ended Stevenage's four match unbeaten run, with the game ending 2–0 to the home side. Torquay substitute Danny Stevens gave the home side the lead just a minute after half-time. Stevenage captain Mark Roberts was given a straight red card with twenty minutes remaining for bringing down Chris Zebroski in the area, with the latter missing the subsequent penalty. Torquay doubled their lead with five minutes remaining through Jake Robinson. This was followed up with another defeat three days later, this time a 1–0 loss to Hereford United at Broadhall Way. Four days later, on 12 March, Stevenage beat Wycombe Wanderers 1–0 at Adams Park. John Mousinho scored the only goal of the game just after half-time, scoring against his former club with a goal from 30 yards out. Stevenage had to play with ten men for the last thirty minutes of the match after Scott Laird was sent-off for two bookable offences. Another away victory followed three days later as Stevenage beat Oxford United 2–1 at the Kassam Stadium. Stevenage took the lead midway through the first half when Harry Worley deflected Darius Charles' header into his own goal. Oxford equalised in first-half injury-time, Tom Craddock scoring from the penalty spot after Peter Winn was adjudged to have fouled Josh Payne in the area. Just three minutes after half-time, Stevenage striker Craig Reid scored his first goal for the club after good work from Rob Sinclair – the goal gave the visitors their fifth win in their last seven outings. Stevenage secured their third consecutive victory with a 2–1 home win against Lincoln City on 19 March 2011. Lincoln striker Ashley Grimes scored from the penalty spot after Scott Laird had handled in the area. The home side equalised four minutes later, John Mousinho's shot was saved by Lincoln goalkeeper Trevor Carson, but Lawrie Wilson was on hand to score the rebound. Wilson doubled his goal tally for the day on the hour mark, lashing a shot past Carson from 25 yards after a neat interchange with Mousinho. A fourth straight win followed three days later, with two John Mousinho goals securing a 2–0 victory against Burton Albion at the Pirelli Stadium. Stevenage secured their fifth straight victory four days later, comprehensively beating Macclesfield Town 4–0 at Moss Rose. The away side took the lead on the half-hour mark, captain Mark Roberts scoring from close range after Darius Charles' shot was driven across the face of goal. Rob Sinclair doubled Stevenage's lead five minutes later, scoring his first goal for the club. Roberts was on hand to head home his second of the game just after the interval, and Sinclair made it four following good work from Charles.", "A sixth straight win followed on 2 April 2011, when Stevenage beat Bradford City 2–1 at Broadhall Way. The home side took the lead with ten minutes remaining of the first-half, Stacy Long was fouled in the area and referee Brendan Malone pointed to the spot. John Mousinho stepped up to score the penalty, his seventh goal of the season. Bradford equalised with just twenty minutes remaining – the Stevenage defence failed to deal with a ball into the area, and Bradford midfielder Dave Syers was on hand to poke the ball into the net. Stevenage responded within five minutes, Mousinho fed Craig Reid down the left, who squared the ball to Darius Charles, who subsequently drilled the ball low past goalkeeper Jon McLaughlin to give Stevenage all three points. Stevenage drew their following game 2–2 at Stockport County. The away side took the lead ten minutes after half-time through Mark Roberts. However, two quick-fire Stockport goals within the space of three second-half minutes gave Stockport the lead. Lawrie Wilson popped up in injury-time to secure Stevenage a point. Another 2–2 draw followed, this time at home to Aldershot Town. Stevenage took the lead after ten minutes, Darius Charles scoring from John Mousinho's lofted free-kick. Aldershot equalised just before half-time, Alex Rodman lashing the ball home after Stevenage had failed to clear the ball. Rodman scored again just after the break, cutting in from the left channel and scoring from just outside the area. The home side restored parity for twenty minutes remaining; Mousinho's corner arrived to Luke Foster at the back post, who rifled his shot through a body of players to earn Stevenage a valuable point. Stevenage's eight game unbeaten run ended on 22 April 2011, following a 1–0 defeat to Southend United at Roots Hall. Stevenage were reduced to ten men in the first-half, after Peter Winn was dismissed for a challenge on Sean Clohessy. The visitors were awarded a second-half penalty after Southend defender Bilel Mohsni fouled Byron Harrison, but John Mousinho's subsequent penalty was saved. Barry Corr scored what proved to be the winner ten minutes from time. Stevenage recorded a win just three days later, beating play-off rivals Port Vale 1–0 at Broadhall Way thanks to a goal from Lawrie Wilson with twenty minutes remaining. The club fell to their second successive away defeat on 30 April, losing 2–0 at Northampton Town at Sixfields Stadium. Both Luke Foster and John Mousinho were sent-off for Stevenage."]}, {"page": "Josh Morris (footballer, born 1991)", "response": ["On 25 February 2014, Morris joined League Two club Fleetwood Town on a one-month loan. On the same day he made his Fleetwood debut, coming on as a substitute for Mark Roberts in the 64th minute in a 4–0 loss against Plymouth. After making seven appearances, it was announced on 27 March 2014, Morris agreed to stay with Fleetwood until the end of the 2013–14 season. Morris then scored two goals in two matches against Cheltenham Town and Wycombe Wanderers. His performances in April saw Morris being awarded for Sky Bet League 2 Player of the Month for April. Morris was also involved in three matches in the play-offs, including the final, where he started, as Fleetwood won 1–0 against Burton Albion on 26 May, which won promotion to League One. Following this, Morris made his return to his parent club, with manager Gary Bowyer considered using Morris next season."]}, {"page": "2011 Football League Two play-off Final", "response": ["The scheduled 3p.m. kick off was delayed following a road traffic accident on the M6 motorway which held up the arrival of travelling supporters.  The match finally got under way at 3:16p.m. on 28 May 2011 and was refereed by Darren Deadman.  Stevenage started the final the stronger side and after six minutes had the first opportunity to score.  Darius Charles passed the ball in-field to Craig Reid but his shot from  was blocked by Torquay United's Guy Branston.  Three minutes later, both Billy Kee and then Lee Mansell shot at the Stevenage goal but the ball was eventually cleared by Mark Roberts.  Charles' pass then found John Mousinho on the edge of the Torquay United penalty area but his low shot was held by Bevan.  Torquay United began to assert some pressure on Stevenage with a series of crosses, but failed to convert any of their opportunities to score.  On the half-hour mark, Lawrie Wilson made a break and after Bevan failed to clear his cross, Charles struck the ball over the Torquay United crossbar.  Two minutes later, Reid's low shot was gathered by Bevan which was followed by a Stevenage free kick which was caught by the Torquay United goalkeeper.  Tomlin was clear in the Stevenage box in the 37th minute but was tackled by Roberts, then Charles headed Long's cross into the ground and over the Torquay United bar.  In the 41st minute, Stevenage took the lead when Charles passed to Mousinho whose strike from  flew into the bottom corner of the Torquay United goal.  Branston then headed a corner just wide for Torquay United and after one minute of stoppage time, the half was brought to a close.", "|DF ||14 ||Mark Roberts (c)"]}, {"page": "Mitch Rose", "response": ["On 20 January 2017, Rose agreed a free transfer to League Two side Newport County until the end of season. He made his debut for Newport on 28 January 2017 in a 3–1 home win versus Hartlepool United. Rose was sent off in the 3–2 away defeat at Cambridge United on 18 February 2017, for what seemed to be a foul on Luke Berry in the box in stoppage time; Rose, annoyed at the decision, knocked the card out of referee Trevor Kettle's hand. Joe Day saved George Maris' spot kick, but Mark Roberts bundled home the rebound. Rose faced an automatic one-match ban, but two days later this was overturned on appeal. Rose was later handed a five-match ban and charged by the FA with misconduct; he was also fined £1,000 and Newport were fined £2,500 for failing to control one of their players."]}, {"page": "2013–14 Fleetwood Town F.C. season", "response": ["|5||Mark Roberts||CB||||Northwich||||1||1||–||–||Stevenage||3 July 2013||Free||Undisclosed", "|5||DF||Mark Roberts||1||0||0||0||1", "|5||DF||Mark Roberts||1||0||0||0||0||0||0||0||1||0"]}]}}