{"wiki_id": "http://www.wikidata.org/entity/Q6761551", "itemLabel": "Maria Rubia", "itemDescription": "British musician and model", "wikipedia_url": "https://en.wikipedia.org/wiki/Maria_Rubia", "wikipedia_page": {"main": "Maria Rubia (born 20 December 1977), is an English model, actress, TV presenter and singer-songwriter. She debuted as the vocalist on Fragma's dance song, \"Everytime You Need Me\", which remained on the UK Singles Chart for 11 weeks, and the sales thereof earned her a silver disc.", "link_mentions": [{"page": "Fragma", "response": ["In 1999, a mash-up, \"Toca's Miracle\" was produced by DJ Vimto, taking the music of Fragma's \"Toca Me\" and placing the vocals from Coco Star's 1996 song \"I Need a Miracle\" (written for Coco Star by Rob Davis and Victor Imbres) over the instrumental. Originally released on Orbit Records in Germany, \"Toca's Miracle\" was licensed in the UK by Positiva Records. It went straight to number one in the UK chart, and was popular in Australia and Ireland. \"Toca's Miracle\" was described as a \"song that was never really meant to be\" by Billboards Michael Paoletta. An album was released in 2001; Toca, as well as two other singles; \"Everytime You Need Me\" (UK No. 3), which featured vocals by Maria Rubia, and \"You Are Alive\" (UK No. 4) with vocals by Damae.", "|Maria Rubia"]}, {"page": "List of performances on Top of the Pops", "response": ["* Fragma – \"Everytime You Need Me\" (feat. Maria Rubia), \"Toca's Miracle\" (feat. Coco Star)"]}, {"page": "Now Dance 2002", "response": ["#Fragma feat. Maria Rubia : \"Everytime You Need Me\" 3:31"]}, {"page": "2001 in British music charts", "response": ["| Fragma featuring Maria Rubia"]}, {"page": "Scottish Singles and Albums Charts", "response": ["| 21 January || \"Everytime You Need Me\" || Fragma featuring Maria Rubia || rowspan=\"2\"|Chocolate Starfish and the Hot Dog Flavored Water || rowspan=\"2\"|Limp Bizkit"]}, {"page": "List of UK top-ten singles in 2001", "response": ["|Maria Rubia", "|align=\"left\"|Fragma featuring Maria Rubia"]}, {"page": "Everytime You Need Me", "response": ["\"Everytime You Need Me\" is a song by the German trance group Fragma and featuring Maria Rubia. It was released in January 2001 as the third single from their debut album, Toca (2001). The single peaked at number three on the UK Singles Chart and in Finland while also becoming a top-10 hit in Ireland and Norway."]}, {"page": "Rubia, Maria", "response": ["#redirectMaria Rubia"]}, {"page": "Say It (Maria Rubia song)", "response": ["#REDIRECT Maria Rubia"]}]}}