{"wiki_id": "http://www.wikidata.org/entity/Q6768645", "itemLabel": "Mark Lowen", "itemDescription": "television journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Lowen", "wikipedia_page": {"main": "Mark Lowen is a British journalist. He is the BBC News Southern Europe Correspondent, based in Rome. He was previously based in Turkey, Greece and Serbia. He moved to Rome in 2019 and is often deployed elsewhere on major stories.", "link_mentions": [{"page": "Hijab and burka controversies in Europe", "response": ["The Ministry of Education, Science, and Technology constructed this prohibition of Islamic headscarves.United States. Congress. House. The 2011 International Religious Freedom Report: Hearing before the Subcommittee on Africa, Global Health, and Human Rights of the Committee on Foreign Affairs, House of Representatives, One Hundred Twelfth Congress, First Session, November 17, 2011. Washington: U.S. G.P.O., 2011. The Ministry of Education, Science, and Technology received ample support within the government; when interviewed by Mark Lowen from BBC News, Kosovo's Deputy Foreign Minister, Vlora Citaku explained: \"The scarf in Kosovo is not an element of our identity. It's a sign of submission of female to male, rather than a sign of choice. I don't think a 16 or 17-year-old, let alone a five-year-old, can take the conscious decision to wear a scarf\"."]}, {"page": "King's College School", "response": ["*Mark Lowen, BBC news correspondent"]}, {"page": "List of current BBC newsreaders and reporters", "response": ["*Mark Lowen – Rome"]}, {"page": "Natalia Karp", "response": ["In 1943, after the death of her husband in a bomb raid, Karp was sent to the Kraków-Płaszów concentration camp where she came into contact with Amon Göth. On his birthday, Göth ordered her to play for him and was impressed enough with her performance to spare not only her life but that of her sister as well. She chose to play Chopin's Nocturne in C-sharp minor, and would in later years be known for her interpretations of his pieces. Eventually, she and her sister were sent to Auschwitz, but both survived the war. Her grandson, Mark Lowen, a BBC journalist (and BBC Turkey Correspondent), wrote her story in 2011. He talks of Natalia and ties the story to Jamila Kolonomos of Republic of Macedonia, which lost 98% of its Jewish population. Jamila also survived the war by hiding and then joining Tito's partisan resistance. 18 of her relatives were murdered."]}, {"page": "Television Blong Vanuatu", "response": ["Telsat Pacific is a locally owned DVB-T2 UHF Pay TV service that also broadcasts Free-to-Air local channels such as 1NOMO (Project of Telsat Pacific) and KAM TV (Community Akses Media produced by Mark Lowen) which can be received by any Australian or New Zealand standard Digital TV. (www.telsat.vu)"]}, {"page": "Malcolm Brabant", "response": ["In 2011, Brabant became seriously ill following a routine inoculation against yellow fever. Asked to report from Ivory Coast by UNICEF, Brabant was administered the yellow fever vaccine Stamaril made by Sanofi Pasteur in April 2011, at the Vaccination Centre East Attica in Pallini, Athens. An adverse reaction led to three psychotic episodes, during which Brabant spent more than three months in the intensive care units of psychiatric hospitals in three countries. He was replaced for a time by the BBC's then-Balkans Correspondent, Mark Lowen, but eventually recovered and resumed his work for PBS."]}, {"page": "2014 Kobanî protests", "response": ["After on the 7 October Recep Tayyip Erdoğan said Kobanî would fall to ISIL, the protests took up force. On the same day, there were reports that a 28-year-old Kurdish woman activist had been shot in the head by Turkish soldiers on the Turkish side of the border near Kobanî. She was reportedly part of a peaceful group of demonstrators who wanted the Turkish government to allow volunteers from Turkey to join the fight against ISIL in Kobanî. According to a witness' interview with Amnesty International the Justice and Development Party (AKP) led Municipality's bodyguards attacked protestors in Siirt on the 7 October 2014.\"Kobani Protests in Turkey\" Amnesty International (2015), p.8 The same day, several members of the Islamist Hüda Par party were killed in Bağlar, Diyarbakır.\"Kobani Protests in Turkey\". Amnesty International. 2015, p.7 On the 8 October Mark Lowen from the BBC reported that 19 people shall have died and that the Turkish authorities imposed curfews in several cities with a majorly Kurdish population. Protesters were met with tear gas and water cannons, and initially 12 people were killed. A total of 31 people were subsequent rioting up to 14 October. The protests came to an end after Abdullah Öcalan called for their termination from his prison on Imrali island. "]}, {"page": "December 2016 Istanbul bombings", "response": ["According to Mark Lowen, the BBC's correspondent in Turkey, Kurdish militant groups were implicated by the fact that the police were targeted. Deputy Prime Minister Numan Kurtulmuş said that signs were suggesting that the Kurdistan Workers' Party (PKK) might have carried out the attack. Later, the Kurdistan Freedom Hawks (TAK) claimed responsibility for the bombings. By December 12, 235 were detained in an anti-terror raid, in which 200 of those detained were members of the Peoples' Democratic Party (HDP). They were charged on 11 counts of terrorism and spreading terrorist propaganda on social media. The attack was condemned by ruling AKP and 2 opposition parties in the parliament, the Republican People's Party (CHP) and the Nationalist Movement Party (MHP), in a mutual declaration."]}, {"page": "Lowen, Mark", "response": ["#redirectMark Lowen"]}]}}