{"wiki_id": "http://www.wikidata.org/entity/Q6767294", "itemLabel": "Mark Davis", "itemDescription": "former professional cricketer, born 1962", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Davis_(English_cricketer)", "wikipedia_page": {"main": "Mark Richard Davis (born 26 February 1962 in Kilve, Somerset) is a former professional cricketer, who represented Somerset County Cricket Club in 77 first-class matches and 59 List A matches between 1982 and 1987.  A left arm fast-medium bowler and left-handed batsmen, his ability was brought to the attention of Somerset after winning a competition in a local newspaper. Before making his full debut for Somerset he represented Wiltshire, a minor county side.  During his career he took 149 first-class wickets at an average of 35.62 and a best performance of 7 for 55. He averaged 14.60 with the bat with a solitary first-class fifty, 60 not out.After retiring in 1989 he became a builder for a short period before training to become a cricket coach. In 1996 he joined Millfield School and has remained as the head coach there working alongside Richard Ellison. Recently he has joined the cricket commentary team on BBC Radio Bristol and works as the on-air analyst.", "link_mentions": [{"page": "Mark Davis", "response": ["Mark Davis may refer to:", "*Mark Davis (talk show host), American radio talk show host", "*Mark Davis, American bassist and founding member for the band Emmure", "*Mark Davis (actor) (born 1965), English adult film actor", "*Mark Davis (Canadian musician), Canadian alternative country and indie rock musician", "*Mark Davis (American football) (born 1954/1955), American principal owner of the NFL's Las Vegas Raiders and WNBA's Las Vegas Aces", "*Mark Davis (pitcher) (born 1960), American Major League Baseball player", "*Mark Davis (outfielder) (born 1964), American Major League Baseball player", "*Mark Davis (basketball, born 1960), former player in the Australian National Basketball League", "*Mark Davis (basketball, born 1973), American former National Basketball Association player", "*Mark Davis (basketball, born 1963), American former National Basketball Association player", "*Mark Davis (snooker player) (born 1972), English snooker player", "*Mark Davis (golfer) (born 1964), English golfer", "*Mark Davis (English cricketer) (born 1962), English cricketer, played for Somerset and Wiltshire", "*Mark Davis (South African cricketer) (born 1971), South African former cricketer, played for Northern Transvaal and then in England for MCC and Sussex", "*Mark Davis (fisherman) (born 1963), American bass fisher", "*Mark Davis (boxer) (born 1987), American lightweight boxer", "*Mark Davis (footballer) (born 1969), English footballer", "*Mark Davis (journalist), Australian journalist for Dateline", "*Mark Davis (Unicode) (born 1952), American co-founder and president of the Unicode Consortium", "*Mark Davis Pro Bass Challenge", "*Mark Davis' The Fishing Master"]}, {"page": "Mark Davis - Professional cricketer", "response": ["#REDIRECT Mark Davis (English cricketer)"]}, {"page": "List of Somerset County Cricket Club players", "response": ["* Mark Davis (1982–1987) 77 matches CA"]}, {"page": "Craig Kieswetter", "response": ["Kieswetter was born in Johannesburg to an Afrikaner father, Wayne, and Scottish mother, Belinda. He studied at Diocesan College in Cape Town, and played cricket for Western Province junior teams between the ages of 13 and 18. Kieswetter was disappointed when he was asked to play club cricket for two or three seasons before returning to play for the senior team; he never received an explanation and decided instead to pursue a cricket career in England, where he moved at the age of 18. He studied for his A-levels for a year at Millfield, where Mark Davis, a former Somerset bowler, spotted him. He was quickly signed by Somerset. At the 2006 Under-19s World Cup in Sri Lanka, he represented South Africa and won a Man of the Match award in a game against the United States for his innings of 80 off 66 balls."]}, {"page": "List of Somerset County Cricket Club seasons", "response": ["|align=left|Mark Davis"]}, {"page": "Mark Davis (cricketer, born 1962)", "response": ["#REDIRECT Mark Davis (English cricketer)"]}, {"page": "Mark Richard Davis", "response": ["#REDIRECT Mark Davis (English cricketer)"]}]}}