{"wiki_id": "http://www.wikidata.org/entity/Q6768245", "itemLabel": "Mark Jenkins", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Jenkins_(musician)", "wikipedia_page": {"main": "Mark Jenkins (born 1960) is a Welsh musician and music writer. He has written interviews and instrument reviews for UK and international magazines including Melody Maker, New Musical Express, Music Week, International Musician, Keyboard (US), and Mac Format, and has also written a book, Analog Synthesizers, 2nd Edition 2019. He currently writes for the US magazine, Synth & Software.Jenkins studied a Combined Arts course at university; he worked in the university television and electronic music studios to create his first live performances. Graduating with a BA Honours degree, he became Music Editor of the magazine Electronics & Music Maker. Working on other publications he interviewed artists including Philip Glass, Depeche Mode, Isao Tomita, Karlheinz Stockhausen and Duran Duran and reviewed instruments from Moog Music, Yamaha, Roland, Sequential Circuits and others. Many of these features have been archived by the Muzines website. He gave further live performances at London Olympia, the London Planetarium and the Queen Elizabeth Hall among other venues.\nJenkins formed the label AMP Music in 1983. He has performed with David Vorhaus as White Noise at venues including the Bochum Planetarium, Germany, and the All Tomorrow's Parties festival. He also performed at the Peter Harrison Planetarium at The Royal Observatory in 2009. In 2012 Taylor & Francis published a new book by Jenkins, iPad Music following his release of the world's first all-iPad CD album in October 2010, and the Analog Synthesizers book was revised and updated interviewing artists such as Suzanne Ciani, Paul Haslinger, Hans Zimmer and the composers of Stranger Things in 2019. \nIn 2020 Mark Jenkins launched the ZyXyZ Books imprint with the matching volumes \"Tangerine Dream: 50 Years - The Ultimate Discography\", \"Klaus Schulze: 50 Years - The Ultimate Discography\" and \"Kraftwerk: 50 Years - The Ultimate Discography\". All three books were sold around the world through Amazon.\nMark Jenkins lives in London and performs worldwide.", "link_mentions": [{"page": "Eric B.", "response": ["Eric B. is noted for his spare production style; a New York Times review of Follow the Leader described him as a \"minimalist virtuoso.\"Watrous, Peter (September 9, 1988). Review: Follow the Leader. The New York Times. Retrieved on 2009-10-19. Jonathan Gold of the Los Angeles Times has described Eric B.'s beats as \"chill\" and \"understated\", while AllMusic describes them as \"stripped-down.\" In a more critical appraisal, Mark Jenkins of The Washington Post described Eric B.'s work on Paid in Full as \"monotonous\"."]}, {"page": "White Noise (band)", "response": ["* Mark Jenkins (2005–2011)", "* Myspace site of Mark Jenkins"]}, {"page": "Paid in Full (album)", "response": ["In a contemporary review for The Washington Post, Mark Jenkins highlighted the single \"Eric B. Is President\" but was unimpressed by the rest of Paid in Full: \"Its beats are monotonous, and the attempts to take 'jazz and the quiet storm' and 'convert into hip-hop form' fall flat.\" Robert Christgau from The Village Voice said it has \"four groundbreaking masterworks\" in \"I Ain't No Joke\", \"I Know You Got Soul\", \"Paid in Full\", and \"Eric B. Is President\", but was less enthusiastic about the other six songs: \"They're pure, innovative, in-your-face—no doubt. But they're also turntablism with spoken decoration, of small use to anyone who hasn't internalized the 'real' hip hop aesthetic.\" In the newspaper's annual Pazz & Jop critics poll, it was named the 27th best album of 1987."]}, {"page": "Mark Jenkins (Musician)", "response": ["#REDIRECT Mark Jenkins (musician) "]}, {"page": "Voyeur (Saint Motel album)", "response": ["Mark Jenkins of The Washington Post reviewed the album, \"Channeling British glam-pop as only a Los Angeles band can, Saint Motel makes chic and sprightly music with hints of ironic malevolence.\"Jenkins, Mark. \"Saint Motel album review: 'Voyeur. The Washington Post. 2012. Retrieved September 13, 2012 from HighBeam Research: http://www.highbeam.com/doc/1P2-33289493.html He also said, \"At times, the music can be almost too ecstatic, threatening to leave the listener behind.\""]}, {"page": "September Songs – The Music of Kurt Weill", "response": ["September Songs – The Music of Kurt Weill is a music video of 94 minutes recorded on VHS in 1994 for Rhombus Media and ZDF.September Songs – The Music of Kurt Weill  It was produced and directed by Larry Weinstein, and written by Weinstein and David Mortin. Hal Willner was the music supervisor who conceived this film as a follow-up to the album Lost in the Stars: The Music of Kurt Weill which he had produced.\"A Primal Tribute to Iggy Pop\" by Mark Jenkins, The Washington Post, 24 September 1997 The film was nominated for the 1995 Emmy Award for Outstanding Cultural Program.Emmy nomination"]}, {"page": "Mark Jenkins", "response": ["Mark Jenkins may refer to:", "* Mark Jenkins (artist) (born 1970), American artist", "* Mark Jenkins (musician) (born 1960), British musician and music writer", "* Mark Jenkins (actor) (born 1943), American actor"]}, {"page": "Switched-On Rock", "response": ["The idea for Switched-On Rock was conceived by Columbia Records marketing executive Russell \"Russ\" Barnard. Barnard assigned the project to three men: Dolph supervised the album and he tuned the Moog modular synthesizer, and his associates jazz pianist Kenneth \"Kenny\" Ascher and arranger Alan Foust played the keyboards and wrote the song arrangements, respectively. An attempt was made to synthesize drum sounds for the songs, but Dolph felt that the results sounded \"kind of mechanical and ricky-tick.\" Instead, a rock drum kit was played by session drummer Leon Rix.Dolph, Norman; Ballard, Russ. (1969) Switched-On Rock liner notes. Partially reproduced in Mark Jenkins (2009), Analog Synthesizers: Understanding, Performing, Buying – From the Legacy of Moog to Software Synthesis. CRC Books, page 143. "]}]}}