{"wiki_id": "http://www.wikidata.org/entity/Q6769188", "itemLabel": "Mark Pearce", "itemDescription": "actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Pearce_(actor)", "wikipedia_page": {"main": "Mark Pearce (born 1976 in Coventry) is an English actor.\nAt the age of 12 Pearce made his professional stage debut in Cinderella at Belgrade Theatre Coventry.He went on to study English and Drama at University College of St. Martin's Lancaster before heading to London to study acting at the Central School of Speech and Drama.\nNotable credits include his portrayal of ‘Fletcher’ originally played by Ronnie Barker, in the stage adaptation of the BBC sitcom Porridge at The Lowry Manchester, written by the original writers Dick Clement and Ian La Frenais.Pearce created the role of Uncle Mamaji in the world premiere of Yann Martel’s Life of Pi in 2007.In 2009 he performed in a UK tour of Allo Allo.\nRecent West-End appearances include Thénardier in Les Misérables at Sondheim Theatre Jake Blues in The Music Of The Blues Brothers - A Tribute at The Arts Theatre and Champagne Charlie at Wilton's Music Hall.\nHe originated the role of \"Hospital Ghost\" in the original world premiere production of Ghost the Musical in Manchester.Pearce was cast as Wild Thing in Carnaby Street - The Musical, directed by Bob Tomson. It toured the UK throughout 2013.", "link_mentions": [{"page": "Life of Pi", "response": ["This novel has also been adapted as a play by Keith Robinson, artistic director of the youth-oriented Twisting Yarn Theatre Company. Andy Rashleigh wrote the adaptation, which was directed by Keith Robinson. The premier/original cast contained only six actors – Tony Hasnath (Pi), Taresh Solanki (Richard Parker), Melody Brown (Mother), Conor Alexander (Father), Sanjay Shalat (Brother) and Mark Pearce (Uncle). The play was produced at the Alhambra Theatre in Bradford, England, in 2003. The company toured England and Ireland with the play in 2004 and 2007."]}, {"page": "The Lark (2007 film)", "response": ["Niamh starts talking to her friend Doc (Phil Jacobs), they talk about Sean and she asks him to re-set the traps. She doesn't acknowledge that he is not dressed in a boiler suit and he seems matter-of-fact about the situation, but Niamh is tense. As she goes to search for more respirators she starts imagining strange images and noises. We see an old style film recording of Niamh in normal clothes having a picnic. It abruptly cuts back to Niamh presently. A while later she hears a noise coming from the main door. Doc notes that he thought Niamh had set the traps. As Niamh turns to respond Doc has vanished. She goes to investigate. Two people are now inside the building also wearing boiler suits and carrying torches. Niamh follows them and eventually corners them in a small room demanding to know how they have been walking outside without respirators and what they are doing here. The man \"Jackson\" (Mark Pearce) and the woman \"Siobhan\" (Helen Rule) claim they are looking for Sean. Niamh stops interrogating them and asks them to follow her. They seem bewildered at Niamh's obsession with the strangely marked maps on the wall and eventually they end up in another room where Niamh informs Jackson that he will be sleeping there. He doesn't seem keen on being split up from Siobhan and Niamh asks her if they sleep together. Siobhan laughs at this and says the fact Jackson will be in the small room on his own serves as 'poetic justice'. Niamh seems puzzled at this comment but does not ask any questions. Siobhan remarks to Jackson that Niamh knows her name. She then leads Siobhan on another journey to her room where Siobhan tenderly asks Niamh how she can sleep in a place like this. Niamh rejects Siobhan's kindness and leaves her alone in the room. Later on Niamh catches Jackson and Siobhan looking for respirators, Siobhan shows Niamh some sweets she had found claiming they know they belong to Sean. Niamh takes to some of her maps and asks them to make all the maps 'right'. She tells them they either do it or go. ", "* Mark Pearce - Jackson"]}, {"page": "Mark Pearce", "response": ["Mark Pearce may refer to:", "* Mark Pearce (actor) (born 1976), English actor", "* Mark Pearce (runner) (born 1996), English steeplechaser"]}]}}