{"wiki_id": "http://www.wikidata.org/entity/Q6769998", "itemLabel": "Mark Tildesley", "itemDescription": "British film designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Tildesley_(production_designer)", "wikipedia_page": {"main": "Mark Tildesley (born 1963) is a British production designer. Tildesley has collaborated with film directors Danny Boyle, Michael Winterbottom, Mike Leigh, Roger Michell, Paul Thomas Anderson and Cary Fukunaga. He studied theatre design at Wimbledon School of Art in the 1980s before transitioning to film work. In 1998, he won a BAFTA Cymru award for best production design for his work on House of America. He also worked with Danny Boyle as a designer for the 2012 Summer Olympics opening ceremony Isle of Wonder for which he won an Emmy Award for best art direction. In 2020, he replaced Dennis Gassner as the set designer for the 25th James Bond film No Time to Die.", "link_mentions": [{"page": "Frank Cottrell-Boyce", "response": ["Cottrell-Boyce was the writer of the 2012 Summer Olympics opening ceremony, whose storyline he based on Shakespeare's The Tempest. He collaborated with director Danny Boyle and other members of the creative team, including designer Mark Tildesley, in the development of the story and themes, and wrote \"short documents that told the story of each segment\" to provide context for choreographers, builders and other participants. He also wrote the brochure, the stadium announcements and the media guide for presenter Huw Edwards."]}, {"page": "British Independent Film Awards 2004", "response": ["*Mark Tildesley - Code 46 (for production design)"]}, {"page": "British Independent Film Awards 2007", "response": ["* Mark Tildesley - Sunshine (for production design)"]}, {"page": "Art Directors Guild Award for Excellence in Production Design for a Contemporary Film", "response": ["| The Constant Gardener || Mark Tildesley"]}, {"page": "2012 Summer Olympics opening ceremony", "response": ["In July 2010, Boyle started brainstorming ideas with designer Mark Tildesley, writer Frank Cottrell-Boyce and costume designer Suttirat Anne Larlarb. They considered \"what was essentially British\", with the non-British Larlarb able to offer a view of what the world thought Britain meant. Cottrell-Boyce had given Boyle a copy of Pandaemonium, (named after the capital of Hell in Paradise Lost) by Humphrey Jennings, which collated contemporary reports from the industrial revolution. It had become traditional during the opening ceremony to 'produce' the Olympic rings in a spectacular manner. Cottrell-Boyce commented \"Danny had a very clear idea that in the first 15 minutes you had to have a great, startling image that could go around the world; it had to climax with something that made people go 'Oh my God!'\".  Boyle decided that \"the journey from the pastoral to the industrial, ending with the forging of the Olympic rings\" would be that image.", "*Designers: Suttirat Anne Larlarb and Mark Tildesley", "| Mark Tildesley, Suttirat Anne Larlarb, Danny Boyle"]}, {"page": "Suttirat Anne Larlarb", "response": ["Larlarb was Designer of the 2012 Summer Olympics opening ceremony, together with Mark Tildesley. She also designed the costumes and the 'dove bikes'.", "* National Portrait Gallery video interview with Larlarb and Mark Tildesley about the London 2012 Olympics opening ceremony"]}, {"page": "2011 Evening Standard Theatre Awards", "response": ["* Mark Tildesley, Frankenstein (National's Olivier)"]}, {"page": "British Independent Film Awards 2002", "response": ["*Mark Tildesley - Twenty Four Hour Party People"]}, {"page": "Murder of Mark Tildesley", "response": ["===Mark Tildesley===", "Bailey claimed he did not know where Cooke had buried the body.Final tribute to murdered schoolboy Mark Tildesley Cooke has indicated he knows where the body is buried, but refuses to tell the police, or the boy's family, the exact location. Following the confession by Bailey to the murder, the police dug up \"The Moors\" field in Evendons Lane in March 1991, but they did not find anything.", "In 2012, a fragment of human skull, discovered near Evendons Lane, was found not to be Tildesley's.Human skull found in Wokingham is not Mark Tildesley", "When Mrs Tildesley died in 2011, a second name plate was put on the bench, with her name on it, on the plank of wood directly beneath the one with the boy's name plate on, in remembrance of her.Final tribute to murdered schoolboy Mark Tildesley"]}, {"page": "Tildesley", "response": ["*Mark Tildesley (production designer) (born 1963), British designer and director", "*Murder of Mark Tildesley 1984 unsolved murder case"]}, {"page": "London Film Critics Circle Awards 2016", "response": ["*High-Rise – Mark Tildesley, production design"]}, {"page": "St. Louis Gateway Film Critics Association Awards 2017", "response": ["* Phantom Thread - Mark Tildesley"]}, {"page": "Set Decorators Society of America Awards 2021", "response": ["* No Time to Die – Véronique Melery (Set Decoration); Mark Tildesley (Production Design)"]}, {"page": "Art Directors Guild Awards 2021", "response": ["*No Time to Die – Mark Tildesley"]}]}}