{"wiki_id": "http://www.wikidata.org/entity/Q6766985", "itemLabel": "Mark Canning", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Canning_(diplomat)", "wikipedia_page": {"main": "Mark Canning  (born 15 December 1954) is a British former diplomat and was British Ambassador to Indonesia between August 2011 and 2014, before being succeeded by Moazzam Malik. He served concurrently as British Ambassador to the Association of South East Asian Nations (ASEAN) and to Timor Leste. He is a career member of the UK Foreign Service and has occupied a series of challenging and sensitive senior diplomatic appointments. Prior to his current position he served as Britain's Ambassador to Zimbabwe (2009–2011) and to Myanmar (Burma) (2006–2009). Prior to his three ambassadorial assignments, he served as a Deputy High Commissioner at the British High Commission in Kuala Lumpur, Malaysia.\nCanning was educated at Downside School and University College London. He holds also a Masters in Business Administration. He joined the British Foreign and Commonwealth Office (FCO) in 1974 and has served in a wide variety of diplomatic roles, both at home and overseas. His appointments at the Foreign Office in London included significant exposure to counter-terrorism, security and other foreign policy issues. His overseas postings have had a strong focus on the emerging markets of the Asia Pacific and support to UK business, but he has also served in Africa, the US and Latin America. He is an experienced media operator, who has made frequent appearances in the broadcast and print media. As a noted expert on the politics and economics of the nations of South East Asia, Canning has also lectured at a range of academic and other institutions including the Royal College of Defence Studies.\nCanning was appointed Companion of the Order of St Michael and St George (CMG) in The Queen's 2009 New Year Honours list. He is married with one daughter.\nSince leaving the British Diplomatic Service in 2014 he has acted as an advisor to a range of companies active in Southeast Asia and elsewhere.", "link_mentions": [{"page": "Canning (disambiguation)", "response": ["* Mark Canning (diplomat) (born 1954), British Ambassador to Indonesia 2011–present"]}, {"page": "List of ambassadors of the United Kingdom to Indonesia", "response": ["*2011–2014: Mark CanningChange of Ambassador to the Republic of Indonesia, 30 March 2011"]}, {"page": "List of ambassadors of the United Kingdom to Myanmar", "response": ["*2006–2009: Mark Canning"]}, {"page": "Saffron Revolution", "response": ["The Premier of the People's Republic of China, Wen Jiabao, announced: \"China hopes all parties concerned in Myanmar show restraint, resume stability through peaceful means as soon as possible, promote domestic reconciliation and achieve democracy and development\". Javier Solana, the European Union's foreign policy chief, urged China to lean harder on Myanmar. Mark Canning, the United Kingdom's ambassador in Myanmar, told the BBC of the deep underlying political and economic reasons for the demonstrations, which he said would not go away easily; \"The cork has been put in the bottle, but the pressures are still there.\"China appeals for calm in Burma BBC News, 30 September 2007.", "Mark Canning, the British ambassador to Myanmar, said that China was pushing hard for Gambari's mission to be as long and as far-reaching as possible.UN envoy still waiting to see Myanmar's military chief Radio New Zealand News 1 October 2007. "]}, {"page": "International reactions to the Saffron Revolution", "response": [" - The UK Ambassador, Mark Canning, commented that the Burmese leaders were now in uncharted territory, and was concerned about any possible crackdown by the junta, saying:"]}, {"page": "Mark Canning", "response": ["Mark Canning may refer to:", "* Mark Canning (footballer) (born 1983), Scottish footballer for Albion Rovers", "* Mark Canning (diplomat) (born 1954), UK ambassador to Indonesia"]}, {"page": "Timeline of the Saffron Revolution", "response": ["Following telephone talks with the UK Prime Minister Gordon Brown, the Premier of the People's Republic of China, Wen Jiabao, announced: \"China hopes all parties concerned in Myanmar show restraint, resume stability through peaceful means as soon as possible, promote domestic reconciliation and achieve democracy and development\". Javier Solana, the European Union's foreign policy chief, urged China to lean harder on Myanmar. Mark Canning, the United Kingdom's ambassador in Myanmar, told the BBC of the deep underlying political and economic reasons for the demonstrations, which he said would not go away easily; \"The cork has been put in the bottle, but the pressures are still there.\"China appeals for calm in Burma BBC News, September 30, 2007.", "The United Nations envoy Ibrahim Gambari is still waiting to see Myanmar's military junta chief, Than Shwe; it is not clear why he has not yet been granted an audience. Mark Canning, the British ambassador to Myanmar, says China is pushing hard for Gambari's mission to be as long and as far-reaching as possible.UN envoy still waiting to see Myanmar's military chief  Radio New Zealand News October 1, 2007."]}, {"page": "List of ambassadors of the United Kingdom to Zimbabwe", "response": ["*2009–2011: Mark Canning"]}, {"page": "2009 New Year Honours", "response": ["* Mark Canning. HM Ambassador, Rangoon."]}, {"page": "Christy Zakarias", "response": ["Christy Zakarias (born 19 July 1998; 23 years old), also known as Christy Zee, is an Indonesian humanitarian public figure from Bekasi, Indonesia. She was the first Indonesian to receive the International Diana Memorial Award in 2013. Zakarias was awarded by former British Prime Minister David Cameron and British diplomat Mark Canning for co-founding and leading Riveria, a charity that teaches underprivileged Indonesian children English, when she was an eighth grader. She has since then appeared on various media, schools, and universities as a guest speaker and motivator."]}, {"page": "Moazzam Malik (diplomat)", "response": ["Malik was previously Director-General for Country Programmes at the UK Department for International Development (October 2019 to September 2020).  He was the United Kingdom Ambassador to Indonesia, ASEAN and Timor-Leste from October 2014 to July 2019, succeeding Mark Canning. He learned Indonesian in London and Yogyakarta before taking up his assignment. He is the first Muslim British Ambassador to Indonesia."]}]}}