{"wiki_id": "http://www.wikidata.org/entity/Q6767283", "itemLabel": "Mark Davies", "itemDescription": "cricketer (born 1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Davies_(cricketer,_born_1962)", "wikipedia_page": {"main": "Mark Robert Davies (born 24 September 1962) is a former English cricketer.  Davies was a right-handed batsman who bowled right-arm medium pace.  He was born in Shrewsbury, Shropshire and educated at the Priory School, Shrewsbury.Davies made his debut for Shropshire in the 1982 Minor Counties Championship against Durham.  Davies played Minor counties cricket for Shropshire from 1982 to 2002, which included 136 Minor Counties Championship appearances and 41 MCCA Knockout Trophy appearances.  He made his List A debut against Northamptonshire in the 1985 NatWest Trophy.  He made 9 further List A appearances, the last of which came against the Surrey Cricket Board in the 2000 NatWest Trophy.  In his 10 List A matches, he scored 199 runs at an average of 19.90, with a high score of 89.  This score, which was his only List A half century, came against Leicestershire in the 1989 NatWest Trophy.He served as Shropshire County Cricket Club's Captain from 1993 to 1997 and played at club level for Newport and St George's as well as factory based clubs Perkins in Shrewsbury and Audley of Newport. Outside Shropshire, he also played for the Worcestershire Second XI team.Davidson was also a professional footballer who has played for Worcester City, Dudley Town and Oswestry Town.\n\n", "link_mentions": [{"page": "Mark Davies", "response": ["*Mark Davies (athlete) (1960–2011), Australian Paralympic athlete", "*Mark Davies (footballer, born 1988), English footballer with Bolton Wanderers", "*Mark Davies (South African soccer)", "*Mark Davies (rugby union) (born 1958), Wales international rugby union player", "*Mark Davies (cricketer, born 1980), former English cricketer", "*Mark Davies (cricketer, born 1959), former Welsh cricketer", "*Mark Davies (cricketer, born 1969), former Welsh cricketer", "*Mark Davies (cricketer, born 1962), former English cricketer", "*Mark Davies (bishop of Middleton) (born 1962), British Anglican bishop", "*Mark Davies (bishop of Shrewsbury) (born 1959), British Roman Catholic bishop", "*Mark Davies (linguist) (born 1963), professor of linguistics at Brigham Young University"]}, {"page": "The Priory School, Shrewsbury", "response": ["* Mark Davies, cricketer"]}, {"page": "List of Shropshire County Cricket Club List A players", "response": ["*Mark Davies (cricketer, born 1962)"]}]}}