{"wiki_id": "http://www.wikidata.org/entity/Q6768884", "itemLabel": "Mark Millar", "itemDescription": "Scottish association football player (born 1988)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Millar_(footballer)", "wikipedia_page": {"main": "Mark Millar (born 23 February 1988) is a Scottish footballer who plays as a central midfielder for East Stirlingshire.Millar started his career with Scottish Premier League club Celtic, spending a six-month spell on loan at Újpest in Hungary. Millar then moved to Scottish First Division club Falkirk. In June 2012 Millar signed a three-year deal with Dundee United. Millar returned to Falkirk on loan for the majority of the 2013–14 season before being released from his contract at Tannadice in May 2014. Millar has since had spells with Peterhead and Queen of the South, before moving to the West Lothian club, Livingston.\nMillar has been capped at both under-19 and under-21 level for Scotland.", "link_mentions": [{"page": "Mark Millar", "response": ["Mark Millar  (; born 24 December 1969) is a Scottish comic book writer, known for his work on The Authority, Swamp Thing, the Ultimates, Marvel Knights Spider-Man, Ultimate Fantastic Four, Civil War, Kingsman: The Secret Service, Wanted, Chrononauts, Superior and Kick-Ass, the latter seven of which have been, or are planned to be, adapted into feature films.", "Millar was born 24 December 1969Brissenden, Rachelle (Editor) (May 2000). \"Voice of Authority\", The Authority, p 23. WildStorm/DC Comics (La Jolla, California). in Coatbridge, Scotland. His parents were also born in Coatbridge, and Millar spent the first half of his life in the town's Townhead area, attending St Ambrose High. He has four older brothers,\"The Third Degree: Mark Millar\". Jupiter's Legacy #1 (April 2013). p. 27 Image Comics. and one older sister, who are 22, 20, 18, 16 and 14 years older than him, respectively. His brother Bobby, who as of 2010 worked at a special needs school, introduced him to comics at age 4 while attending university by taking him to shops and purchasing them for him. Still learning to read, Millar's first comic was the seminal The Amazing Spider-Man #121 (1973), which featured the death of Gwen Stacy. He purchased a Superman comic that day as well. Black and white reprinted comics purchased by his brothers for him would follow, cementing his interest in the medium so much that Millar drew a spider web across his face with indelible marker that his parents were unable to scrub off in time for his First Communion photo a week later. Millar has named Alan Moore and Frank Miller as the two biggest influences on his career, characterising them as \"my Mum and Dad.\" Other writers he names as influences include Dave Sim,Millar, Mark. \"HARDtalk Virtual Tour Stop #1\", Millar World, 17 September 2012 Grant Morrison, Peter Milligan, Warren Ellis and Garth Ennis. More recent writers that have impressed him include Jason Aaron and Scott Snyder.", "Millar announced his resignation from DC in 2001, though his miniseries Superman: Red Son was printed in 2003.Cowsill, Alan \"2000s\" in Dolan, p. 309: \"Mark Millar was never a writer to shy away from a controversial topic or from taking a unique concept to its shocking conclusion. With Superman: Red Son, he did both by presenting Superman as a communist and giving the conclusion a surprise twist.\"", "In 2001, Millar launched Ultimate X-Men for Marvel Comics' Ultimate Marvel imprint. The following year he collaborated with illustrator Bryan Hitch on The Ultimates, the Ultimate imprint's equivalent of The Avengers.Manning \"2000s\" in Gilbert (2008), p. 311: \"With Ultimate Spider-Man and Ultimate X-Men serving as two of Marvel's most consecutive best seller, it was only a matter of time before the decision was made to reinvent one of the most popular teams of heroes, the Avengers, into this fresh new universe. And writer Mark Millar and artist Bryan Hitch were up to the challenge.\" Millar's work on The Ultimates was later adapted into two Marvel Animated Features and the subsequent 2012 Hollywood box office smash Marvel's The Avengers.\"Assembling 'The Avengers' for the Big Screen: Interview with Screenwriter Zak Penn\". Script. 18 May 2012.", "In 2006, Millar, joined by artist Steve McNiven, began writing Civil War, a seven-issue miniseries revolving around the passing of Superhuman Registration Act as a result of the death and destruction unintentionally caused by superheroes. The series, which was the central book in a company-wide crossover storyline, saw Captain America and Iron Man on opposing sides of that schism.Manning \"2000s\" in Gilbert (2008), p. 332: \"Writer Mark Millar and artist Steve McNiven unleashed Civil War on the public, an epic seven-issue limited series that sparked some of the most heated fan debate in the history of Marvel Comics.\" The story inspired the 2016 film Captain America: Civil War. In 2009, Millar wrote the dystopian \"Old Man Logan\" storyline, which appeared in the Wolverine series. The story was set in a possible dystopian future in which Wolverine, having been traumatised by how Mysterio tricked him into killing X-Men, became a recluse, living in the Southwest United States after the government collapsed, and various supervillain enclaves controlled the country. Needing rent money for his family's farm, Wolverine comes out of retirement when called upon by Hawkeye to assistant him on a dangerous job. Elements from the story inspired the 2017 20th Century Fox film Logan.", "**The Flash by Grant Morrison and Mark Millar (collects #130–141, tpb, 334 pages, 2016, )", "*** Superman by Mark Millar (includes #52, tpb, 280 pages, 2018, )", "**Wolverine by Mark Millar Omnibus (collects #20–32, 66–72 and the Giant-Size Wolverine: Old Man Logan one-shot special, hc, 576 pages, 2013, )", "|+Film adaptations of Mark Millar comics"]}, {"page": "Mark Miller", "response": ["*Mark Millar (born 1969), Scottish comic book writer", "*Mark Millar (footballer) (born 1988), Scottish footballer"]}, {"page": "Millar", "response": ["*Mark Millar (born 1969), Scottish comic book writer", "*Mark Millar (footballer) (born 1988), Scottish footballer"]}, {"page": "Rory Loy", "response": ["Throughout the season he became renowned for his hard work and composed finishing, and this helped him build a strong rapport with The Bairns faithful. Loy was nominated along with Peter MacDonald, Anthony Andreu and Kane Hemmings for the PFA Championship Player of the Year for season 2013–14, but lost out to Hemmings. However, on 27 April 2014, he was awarded the Falkirk Supporters Player of the Year, along with the Players Player of the Year, capping an overall superb campaign. He was also handed the Falkirk Herald's Starshot award for the season, previously won by fan favourites Michael McGovern, Mark Millar, Ryan Flynn and Scott Arfield. Loy would add to his awards when he was named in the 2013–14 Scottish Championship team of year. Throughout the season he was also named as Falkirk's player of the month for September, February and March by the club's supporters."]}, {"page": "Celtic F.C. Under-20s and Academy", "response": ["* Mark Millar"]}, {"page": "2010–11 Celtic F.C. season", "response": ["|11 June 2010 ||  Mark Millar ||  Falkirk ||08 Free"]}, {"page": "2009 HKFC International Soccer Sevens", "response": ["* Glasgow Celtic: Daniel Lafferty, Mark Millar, Ryan Conroy, Niall McGinn, Krisjanis Vallers, Paul McGowan, Gillian Sheridan, Andrew Kennedy, Mark Misum, Anton Kurakins (Managers: Danny McGrain/Willie McStay)"]}, {"page": "2011–12 Falkirk F.C. season", "response": ["||| MF||Mark Millar"]}, {"page": "2012 Scottish Challenge Cup Final", "response": ["The semi-final draw paired Falkirk with high flying Annan Athletic of the Third Division. Annan Athletic had played 12 games and won 10 in all competitions leading up to the semi-final tie and had knocked out First Division club Ayr United in the previous round. However, three first half goals, one from Mark Millar and two from Farid El Alagui\"Annan Athletic 0-3 Falkirk\", BBC Sport. 2011-10-09. Retrieved 2011-10-13. saw off Annan Athletic in front of a record official attendance of 1,575 at Galabank.\"Annan Athletic 0 - 3 Falkirk\" , Annan Athletic F.C.. 2011-10-09. Retrieved 2011-10-13.\"Record day at Annan\", Scottish Football League. 2011-10-12. Retrieved 2011-10-13.", "|MF||8|| Mark Millar"]}, {"page": "2012–13 Falkirk F.C. season", "response": ["|  Mark Millar"]}, {"page": "2012–13 Dundee United F.C. season", "response": ["| 14||||MF||Mark Millar", "|  Mark Millar"]}]}}