{"wiki_id": "http://www.wikidata.org/entity/Q676318", "itemLabel": "Bob Crompton", "itemDescription": "English footballer (1879-1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bob_Crompton", "wikipedia_page": {"main": "Robert Crompton (26 September 1879 – 16 March 1941) was an English professional footballer. He spent the entirety of his career with his hometown club, Blackburn Rovers. He also represented England on 41 occasions, captaining them 22 times.", "link_mentions": [{"page": "Billy Wright (footballer, born 1924)", "response": ["His performances for club saw him earn a call-up to the England team. He made his international debut on 19 January 1946 in a 2–0 win over Belgium in a (post-war) 'Victory International'. His full debut came on 28 September 1946 in a thumping 7–2 win against Ireland. He was made captain in 1948, a role he held for 90 games until his retirement (an all-time record shared subsequently with Bobby Moore). In 1952, with his 42nd cap, he surpassed Bob Crompton's appearance record for England, which had stood since 1914. In total, he made  70 consecutive full international appearances with 105 in all, scoring three times. He was also the first football player in the world to earn 100 caps, and it was more than a decade before his record was broken by another player, Bobby Charlton. As of present, Wright remains the ninth most capped player ever to have played for England being in possession of more caps than players such as Bryan Robson, Kenny Sansom, John Barnes, Martin Peters, Ray Wilkins, Kevin Keegan and Alan Shearer."]}, {"page": "Ian Wright", "response": ["Wright started seven matches and was used as a substitute on six occasions under Hoddle, who was manager for 28 matches. He made his first appearance under Hoddle aged 33 and his final appearance under him aged 35. England went on to qualify for Euro 2000 in Belgium and the Netherlands, by which time, Wright was approaching his 37th birthday and retired from club football shortly after the tournament. Only Mick Channon played more times for England without being selected for a World Cup or European Championships squad. However, during Channon's England career, which spanned the years 1972–1977, England failed to qualify for either of these tournaments, while during Wright's they qualified for two European Championships and one World Cup.Additionally, Bob Crompton had 41 England caps but all were gained long before the foundation of either tournament."]}, {"page": "Blackburn Rovers F.C.", "response": ["The 1890–91 season saw Blackburn Rovers win the FA Cup for the fifth time against Notts County with a 3–1 victory. During the 1897–98 season the club stayed in the first division only as the result of a decision to increase the number of teams from 16 to 18. The season did, however, mark the beginning of Bob Crompton's 45-year association with the club, both as a player and eventually as an FA Cup winning manager.", "| Bob Crompton", "| Bob Crompton", "Bob Crompton, 40 yrs and 150 days against Bradford, Division 1, 23 February 1920"]}, {"page": "AFC Bournemouth", "response": ["*  Bob Crompton"]}]}}