{"wiki_id": "http://www.wikidata.org/entity/Q6760327", "itemLabel": "Marghanita Laski", "itemDescription": "English journalist, radio panellist and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Marghanita_Laski", "wikipedia_page": {"main": "Marghanita Laski (24 October 1915 – 6 February 1988) was an English journalist, radio panellist and novelist. She also wrote literary biography, plays and short stories, and contributed about 250,000 additions to the Oxford English Dictionary.", "link_mentions": [{"page": "October 24", "response": ["*  1915   – Marghanita Laski, English journalist and author (d. 1988)"]}, {"page": "Received Pronunciation", "response": ["In her book Kipling's English History (1974) Marghanita Laski refers to this accent as \"gentry\". \"What the Producer and I tried to do was to have each poem spoken in the dialect that was, so far as we could tell, ringing in Kipling's ears when he wrote it. Sometimes the dialect is most appropriately, Gentry. More often, it isn't.\"Laski, M., comp. (1974) Kipling's English History. London: BBC; pp. 7, 12 &c."]}, {"page": "Georgette Heyer", "response": ["Although the British Regency lasted only from 1811 to 1820, Heyer's romances were set between 1752 and 1825. According to the literary critic Kay Mussell, the books revolved around a \"structured social ritual – the marriage market represented by the London season\" where \"all are in danger of ostracism for inappropriate behavior\".Mussell (1984), p. 413. Her Regency romances were inspired by the writings of Jane Austen, whose novels were set in the same era. Austen's works, however, were contemporary novels, describing the times in which she lived. According to Pamela Regis in her work A Natural History of the Romance Novel, because Heyer's stories took place amidst events that had occurred more than 100 years earlier, she had to include more detail on the period in order for her readers to understand it.Regis (2003), pp. 125–126. Whilst Austen could ignore the \"minutiae of dress and decor\", Heyer included those details \"to invest the novels ... with 'the tone of the time'\".Robinson (1978), p. 323. Later reviewers, such as Lillian Robinson, criticized Heyer's \"passion for the specific fact without concern for its significance\",Robinson (1978), p. 326. and Marghanita Laski wrote that \"these aspects on which Heyer is so dependent for her creation of atmosphere are just those which Jane Austen ... referred to only when she wanted to show that a character was vulgar or ridiculous\".Laski (1970), p. 284. Others, including A.S. Byatt, believe that Heyer's \"awareness of this atmosphere – both of the minute details of the social pursuits of her leisured classes and of the emotional structure behind the fiction it produced – is her greatest asset\".Byatt (1969), p. 275."]}, {"page": "Religious ecstasy", "response": ["Although the experience is usually brief in time,Marghanita Laski, Ecstasy. A Study of Some Secular and Religious Experiences. The Cresset Press, London, 1961. p. 57 there are records of such experiences lasting several days or even more, and of recurring experiences of ecstasy during one's lifetime.", "The adjective \"religious\" means that the experience occurs in connection with religious activities or is interpreted in context of a religion. Journalist Marghanita Laski writes in her study \"Ecstasy in Religious and Secular Experiences\", first published in 1961:"]}, {"page": "1915 in literature", "response": ["*October 24 – Marghanita Laski, English biographer, novelist and broadcaster (died 1988)"]}, {"page": "1988 in literature", "response": ["*February 6 – Marghanita Laski, English biographer, novelist and broadcaster (born 1915)"]}, {"page": "1949 in literature", "response": ["*Marghanita Laski – Little Boy Lost"]}, {"page": "Isobel Barnett", "response": ["In 1953 Lady Barnett arrived on BBC television as one of the panel of What's My Line?, which made her a household name. She appeared on the programme for ten years but was not an original panelist, her seat having been previously occupied by Marghanita Laski."]}, {"page": "The Jungle Book", "response": ["The novelist Marghanita Laski argued that the purpose of the stories was not to teach about animals but to create human archetypes through the animal characters, with lessons of respect for authority. She noted that Kipling was a friend of the founder of the Scout Movement, Robert Baden-Powell, who based the junior scout \"Wolf Cubs\" on the stories, and that Kipling admired the movement. Ricketts wrote that Kipling was obsessed by rules, a theme running throughout the stories and named explicitly as \"the law of the jungle\". Part of this, Ricketts supposed, was Mrs Holloway's evangelicalism, suitably transformed. The rules required obedience and \"knowing your place\", but also provided social relationships and \"freedom to move between different worlds\". Sandra Kemp observed that the law may be highly codified, but that the energies are also lawless, embodying the part of human nature which is \"floating, irresponsible and self-absorbed\". There is a duality between the two worlds of the village and the jungle, but Mowgli, like Mang the bat, can travel between the two."]}, {"page": "Fanny Hill", "response": ["Luxor Press published a 9/6 edition in January 1964, using text \"exactly the same as that employed for the de-luxe edition\" in 1963. The back cover features praise from The Daily Telegraph and from the author and critic Marghanita Laski. It went through many reprints in the first couple of years."]}, {"page": "On Her Majesty's Secret Service (novel)", "response": ["Raymond Mortimer, writing for The Sunday Times, said that \"James Bond is what every man would like to be, and what every woman would like between her sheets\"; meanwhile the critic for The Times considered that after The Spy Who Loved Me, \"On Her Majesty's Secret Service constitutes a substantial, if not quite a complete, recovery.\" In the view of the reviewer, it was enough of a recovery for them to point out that \"it is time, perhaps, to forget the much exaggerated things which have been said about sex, sadism and snobbery, and return to the simple, indisputable fact that Mr. Fleming is a most compelling story-teller.\" Marghanita Laski, writing in The Times Literary Supplement, thought that \"the new James Bond we've been meeting of late [is] somehow gentler, more sentimental, less dirty.\" However, she considered that \"it really is time to stop treating Ian Fleming as a Significant Portent, and to accept him as a good, if rather vulgar thriller-writer, well suited to his times and to us his readers.\""]}, {"page": "New Worlds (magazine)", "response": ["In July 1966 Roberts & Vinter's distributor, Thorpe & Porter, went bankrupt, owing Roberts & Vinter a substantial sum. The resulting financial pressure led Roberts & Vinter to focus on their more profitable magazines, and they made plans to close down both Science Fantasy and New Worlds.  After hearing of these plans, Moorcock and Warburton began to consider forming a separate company to continue publishing New Worlds, and Brian Aldiss contacted well-known literary figures such as J.B. Priestley, Kingsley Amis, Marghanita Laski, and Angus Wilson to gain support for an application for a grant from the British Arts Council in late 1966.  In early January 1967 Aldiss discovered that the grant application would be successful, and that New Worlds would be awarded £150 per issue, though in the event the grant certification was delayed until at least May.Greenland, Entropy Exhibition, pp. 19–20.  The grant was enough to enable the magazine to continue, though it would not cover all costs.  A publisher still had to be found, and both Fontana and Panther Books expressed an interest, but the promise of the money and the prestige of an Arts Council grant convinced Warburton to stay involved personally.  While these negotiations were going on, two more issues were assembled from backfile material and donated stories.  Roberts & Vinter had ceased to exist by this time, so a sister company, Gold Star Publications, became the publisher for both these issues, with Warburton and Aldiss providing Gold Star with personal financial guarantees.Ashley, Transformations, pp. 245–248.  These two issues appeared in March and April 1967, but the latter was mistakenly also dated March in the indicia.  Science Fantasy, which by this time had been retitled SF Impulse, was not continued but was merged with New Worlds as of the first Gold Star issue, though nothing of SF Impulses design or content was visible in New Worlds."]}, {"page": "Sheila Kaye-Smith", "response": ["Kaye-Smith's later books increasingly reflected her personal religious preoccupations, featuring characters tussling with spiritual crises and conversions within subtle discussions of the differences among Anglicanism, Anglo-Catholicism, and Catholicism. Her plots (e.g. in The Lardners and the Laurelwoods, A Valiant Woman, and Mrs Gailey) continued to reflect pre- and post-WW2 preoccupations of women's \"middle-brow\" fiction of the time. She explored national anxieties about social class, divorce, and women's \"role\", within a mainly rural but rapidly modernising milieu (Pearce, 2004, 2005). Her books share similarities with contemporary writers such as Barbara Pym, Marghanita Laski and H. E. Bates. Her descriptions of farming practices and economics, and village vernacular, are noted as particularly detailed and accurate for this genre (Cavalliero, 1977)."]}, {"page": "Licence Renewed", "response": ["Listener crime critic Marghanita Laski, a long-time admirer of Gardner's books, said Licence Renewed \"is competent and has its funny moments. But this fine thriller-writer can't perfectly adjust down to the simpler genre, and the world-destructive plot is a waste of Gardner, without ever really convincing as Bond.\""]}, {"page": "Icebreaker (novel)", "response": ["Long-time Gardner admirer and Listener crime critic Marghanita Laski believed Icebreaker \"is one of his best yet in his 007 mode.\" She especially admired the book's Finnish setting which she said \"has been good thriller value since Gavin Lyall introduced it.\""]}, {"page": "Role of Honour", "response": ["Long-time Gardner admirer and Listener crime critic Marghanita Laski said \"John Gardner has gradually worked himself into his own role as owner-creator of James Bond, but his Bond is more intelligent, more sensitive than the original.\""]}, {"page": "James Bond, The Spy Who Loved Me", "response": ["Critical reception of the novel were mixed, though most praised Wood's skill as a writer. Marghanita Laski, writing in The Listener, called Wood \"an apparently promising thriller writer struggling to emerge from obligatory bits of set-piece nastiness.\" Former Bond author Kingsley Amis wrote in The New Statesman that, despite several reservations, \"Mr Wood has bravely tackled his formidable task, that of turning a typical late Bond film, which must be basically facetious, into a novel after Ian Fleming, which must be basically serious. ... the descriptions are adequate and the action writing excellent.\""]}, {"page": "Little Boy Lost (1953 film)", "response": ["Little Boy Lost is a 1953 American drama film directed by George Seaton and starring Bing Crosby, Claude Dauphin, and Christian Fourcade. Based on the novel Little Boy Lost by Marghanita Laski, the film is about a war correspondent stationed in Paris during World War II and once married to a young Frenchwoman who was murdered by the Nazis. Following the war, he returns to France trying to find his son, whom he lost during a bombing raid but has been told is living in an orphanage in Paris.", "The reviewer for Variety commented: \"Based on the Marghanita Laski story of a father’s search for the young son from whom he had become separated because of the war, the film doesn’t come off with the tremendous heart impact of the original, or of the television version seen only a season or two back, although it does have sufficient moving moments to be satisfactory family filmfare\""]}, {"page": "Mary Louisa Molesworth", "response": ["* Marghanita Laski, (1950) Mrs Ewing, Mrs Molesworth and Mrs Hodgson Burnett. Folcroft Library Editions (1976) "]}, {"page": "Abbots Langley", "response": ["*Marghanita Laski (1915–88), journalist and novelist, lived at Abbots House 1937–45."]}, {"page": "St Paul's Girls' School", "response": ["* Marghanita Laski – author"]}, {"page": "Little Boy Lost (novel)", "response": ["Little Boy Lost is a dramatic novel by Marghanita Laski that was published in 1949. It was republished in 2001 by Persephone Books."]}, {"page": "Lady Barn House School", "response": ["*Marghanita Laski (1915–1988), writer"]}, {"page": "Moses Gaster", "response": ["Moses Gaster (17 September 1856 – 5 March 1939) was a Romanian, later British scholar, the Hakham of the Spanish and Portuguese Jewish congregation, London, and a Hebrew and Romanian linguist. Moses Gaster was an active Zionist in Romania as well as in England, where in 1899 he helped establish the English Zionist Federation.\"Moses Gaster Projects\", University of Manchester He was the father of Jack and Theodor Gaster and the grandfather of Marghanita Laski. He was also son-in-law to Michael Friedländer and father-in-law to Neville Laski."]}, {"page": "Annan Committee", "response": ["* Marghanita Laski"]}, {"page": "The Brains Trust", "response": ["The original three members of the broadcasting team were C. E. M. Joad (philosopher and psychologist), Julian Huxley (biologist) and Commander A. B. Campbell (retired naval officer). The chairman was Donald McCullough. Later participants included: Edward Andrade, Noel Annan, A. J. Ayer, Michael Ayrton, Isaiah Berlin, Robert Boothby, Jacob Bronowski, Collin Brooks, Violet Bonham Carter, Alan Bullock, Anthony Chenevix-Trench, Kenneth Clark, Margery Fry, Commander Rupert Gould, Gilbert Harding (as chairman), Herbert Hart, Will Hay, Bishop Joost de Blank, Marghanita Laski, C. S. Lewis, John Maud, Malcolm Muggeridge (chairman), Anna Neagle, Egon Ronay, Bertrand Russell, Sir Malcolm Sargent, Hannen Swaffer, Gwyn Thomas (novelist), Geoffrey Crowther (as chairman), Lord Dunsany, Sir Ivone Kirkpatrick, Walter Elliot,Archived at Ghostarchive and the Wayback Machine:  Jennie Lee, Ellen Wilkinson, Aldous Huxley, A. J. P. Taylor, Harold Nicolson, Barbara Ward Jackson, Philip Guedalla and Tom Wintringham."]}, {"page": "Emyr Humphreys", "response": ["His papers, held by the National Library of Wales, include correspondence with writers, performers and other public figures, such as Dannie Abse, Philip Burton, Hywel Teifi Edwards, T. S. Eliot, Gwynfor Evans, Patrick Heron, Marghanita Laski and R. S. Thomas."]}, {"page": "List of apocalyptic and post-apocalyptic fiction", "response": ["|Play by Marghanita Laski", "|A TV adaptation of a play by Marghanita Laski.Apocalyptic and End of the World Fiction, Film and TV at EmptyWorld . Empty-world.com. Retrieved on 2009-02-13."]}, {"page": "Category talk:British journalists", "response": ["Marghanita Laskinot yet classified"]}, {"page": "Neville Laski", "response": ["Laski came from a distinguished family. His father was Nathan Laski (1863-1941), a Lithuanian Jewish Manchester cotton merchant and a leader of British Jewry; his mother, Sarah Frankenstein, had married Nathan Laski in 1889.Frangopulo, N. J., ed. (1962) Rich Inheritance. Manchester: Education Committee; pp. 157-58 His younger brother was Harold Laski. He married Phina Emily, eldest daughter of Moses Gaster; he had four children, including Marghanita Laski."]}, {"page": "List of British Jewish writers", "response": ["* Marghanita Laski, writer"]}, {"page": "Anti-nuclear movement in the United Kingdom", "response": ["*Marghanita Laski"]}, {"page": "List of atheist authors", "response": ["* Marghanita Laski (1915–1988): English journalist and novelist, also writing literary biography, plays and short stories.\"In view of the enduring influence of Moses Gaster it is a mark of Marghanita Laski's true independence of mind that, while remaining proud of her Jewishness, she renounced her faith even before she went up to Oxford and declared herself to be an atheist.\" R. W. Burchfield, 'Laski, Marghanita (1915–1988)', rev. Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, May 2007 (accessed May 1, 2008)."]}, {"page": "Eric Till", "response": ["Films he has directed include; Hot Millions, A Fan's Notes, It Shouldn't Happen to a Vet, Bethune, Wild Horse Hank, Improper Channels, Voices from Within (also known as Silhouette), Bonhoeffer - Agent of Grace, Luther and the Muppet television series and specials Fraggle Rock, The Christmas Toy and A Muppet Family Christmas. His work for the Canadian Broadcasting Corporation (CBC) included some of the following: the mini-series of Pierre Berton's The National Dream, a movie of Brian Friel's Freedom of the City, Katherine Anne Porter's Pale Horse, Pale Rider, Marghanita Laski's The Offshore Island, John Hopkins's Talking to a Stranger, the television films Shocktrauma, Turning to Stone and Win, Again!, and the mini-series Glory Enough for All about the discoverers of insulin."]}, {"page": "William Garner (novelist)", "response": ["Marghanita Laski writing in The Listener, called Garner \"Our cleverest thriller writer\".Review of Rats' Alley, quoted on 1985 Methuen paperback edition. The Observer believed Garner was \"A novelist of stature who leaves his own distinctive imprint on the le Carré scene.\"Review of Paper Chase, quoted on 1987 Methuen paperback edition. The Crime Writers' Association short-listed Rat's Alley for their Gold Dagger award.Sobin, Roger. The Essential Mystery Lists: For Readers, Collectors, and Librarians. Poisoned Pen Press: 2007."]}, {"page": "Robert Roberts (author)", "response": ["The book was widely acclaimed on its release. Marghanita Laski in The Times called it the \"direct, personally-reminiscent examination we would always wish to have of life in any class\".  Reviewing the book for The Daily Telegraph, Michael Kennedy praised the \"vivid, moving, funny, unsentimental\" first-hand descriptions, arguing that it \"may well be a classic book\";  in The Sunday Telegraph, J. M. W. Thompson praised the way Roberts mixed together personal reminisces with social history.  Keith Dewhurst for The Guardian commended Roberts's richly textured account and the wealth of information he included.  Its usefulness as a source was also praised in an anonymous review for The Guardian, which lauded the inclusion of photographs of Edwardian Salford by Samuel Coulthurst. "]}]}}