{"wiki_id": "http://www.wikidata.org/entity/Q6768475", "itemLabel": "Mark Lamont", "itemDescription": "British footballer (born 1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Lamont", "wikipedia_page": {"main": "Mark Lamont (born 4 February 1993) is a Scottish footballer who is currently last played for Dumbarton. He previously played for St Mirren, Dumbarton, Petershill, Stirling Albion, East Fife and Stranraer. Lamont, who is a midfielder, has also played for his country at youth international level.", "link_mentions": [{"page": "2011–12 St Mirren F.C. season", "response": ["|  Mark Lamont"]}, {"page": "2011–12 Dumbarton F.C. season", "response": ["||| MF|| Mark Lamont"]}, {"page": "2012–13 St Mirren F.C. season", "response": ["| 24|||| MF|| Mark Lamont", "| Mark Lamont", "| Mark Lamont"]}, {"page": "2012–13 Dumbarton F.C. season", "response": ["|||MF||Mark Lamont", "|  Mark Lamont", "| Mark Lamont"]}, {"page": "2013–14 Dumbarton F.C. season", "response": ["|  Mark Lamont"]}, {"page": "Lamont, Mark", "response": ["#redirectMark Lamont"]}, {"page": "2021–22 Dumbarton F.C. season", "response": ["The Sons' final pre-season friendly ended in a 1-0 victory against local rivals Clydebank thanks to Joe McKee's goal. The same day Carlo Pignatiello became the club's latest new recruit - joining on a season long loan from Livingston. He was followed in arriving by Norwegian forward Kristoffer Syvertsen and former Hibernian midfielder Callum Wilson. A positive Covid-19 test saw the Sons' first Scottish League Cup tie with St Mirren forfeited on July 10. On July 12 defender Sam Muir became the club's 15th new signing of the summer. Joining from Motherwell. He was followed by 16-year-old Kirk McKnight who joined on a loan deal from Kilmarnock. Able to name just two outfield substitutes, the Sons lost 2-1 to Scottish League Two Stenhousemuir in their first League Cup tie - with Ross MacLean on the scoresheet. Midfielder Evan Maley joined the club on amateur terms on July 16 - with four players still self-isolating. The following day Sons lost 5-1 to Dunfermline Athletic with Maclean again on the scoresheet. On Monday July 19 midfielder Mark Lamont became the club's latest new addition. Joining after two years out of football. The League Cup campaign ended with a 2-0 loss to Championship side Partick Thistle on July 20. On July 31 Sons started their league campaign with a 3-0 victory against Clyde at Broadwood Stadium. A Conrad Balatoni own goal was added to by strikes from Ross MacLean and Conner Duthie.", "|Mark Lamont", "|Mark Lamont", "| MF|| style=\"text-align:left\" | Mark Lamont||0|| 1 || 1 ||0||0||0"]}]}}