{"wiki_id": "http://www.wikidata.org/entity/Q6761425", "itemLabel": "Maria McErlane", "itemDescription": "British actor and comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Maria_McErlane", "wikipedia_page": {"main": "Maria McErlane (born 9 December 1957, in Buckinghamshire, England) is a British actress and presenter specialising in comedy. She has been acting since 1984.  She has appeared in several TV series, including The Fast Show, Gimme Gimme Gimme, Thin Ice and Happiness, \"straight\" roles in The Bill and Holby City and as the narrator for Antoine de Caunes and Jean-Paul Gaultier's Eurotrash.Starting on the comedy circuit in the 1990s, under the name 'Maria Callous', she has also guested on shows such as Have I Got News for You, If I Ruled the World and Just a Minute on Radio 4. She also is part of the murder panel show Foul Play, alongside Lee Simpson.\nIn June 1984, she appeared in 'Out of Order' (a revue by Christopher Middleton and Jonathan Kydd) at the Finborough Theatre.McErlane co-presented the ITV quiz show Carnal Knowledge with her friend Graham Norton in the mid 1990s. She co-presented the \"Grill Graham\" agony aunt feature with Norton on his BBC Radio 2 Saturday morning show throughout its run and on his departure for Virgin Radio UK in January 2021, joined him as co-presenter for his weekend shows. Whilst on Radio 2, she also stood in when he was ill in 2013 and when he failed to turn up on 28 June 2014. In 2016, McErlane caused offence when she referred to the Irish Olympic medal winning O'Donovan brothers (Paul and Gary) as embodying an Irish stereotype: “Very good at rowing but not that great at talking” .McErlane is a friend of Nigella Lawson and appeared on 16 episodes of Nigella Lawson's ITV chat show Nigella.\nShe has had regular columns in The Sunday Times Style and Esquire Magazine.", "link_mentions": [{"page": "Graham Norton", "response": ["In 1992, Norton's stand-up comedy drag act as a tea-towel-clad Mother Teresa of Calcutta in the Edinburgh Festival Fringe made the press when Scottish Television's religious affairs department mistakenly thought he represented the real Mother Teresa. His first appearances in broadcasting were in the UK, where he had a spot as a regular comedian and panellist on the BBC Radio 4 show Loose Ends in the early 1990s, when the show ran on Saturday mornings. He was one of the early successes of Channel 5, winning an award as stand-in host of a late-night TV talk show usually presented by Jack Docherty. This was followed by a comic quiz show on Channel 5 called Bring Me the Head of Light Entertainment, which was not well received as a programme but enhanced Norton's reputation as a comic and host. In 1996, he co-hosted the late-night quiz show Carnal Knowledge on ITV with Maria McErlane.", "On 2 October 2010, Norton began presenting a Saturday morning show on BBC Radio 2, which he took over from Jonathan Ross. Norton co-hosted with Maria McErlane who featured as an \"agony aunt\" on the segment \"Grill Graham\".  \"Tune with a Tale\" is where a listener suggests playing a song with a plot, summarising the story it contains, and \"I Can't Believe It's Not Better\" is a feature where a listener requests a song that was previously a hit, but might be considered particularly bad now. In January 2012, Norton asked listeners to his Radio 2 show to help find his car, shortly after it was stolen.  He called it \"The Great Car Hunt\" and told listeners to"]}, {"page": "List of Have I Got News for You episodes", "response": ["|Maria McErlane"]}, {"page": "The Mark Steel Solution", "response": ["Many of the arguments are illustrated by miniature sketches, featuring Mark Steel, Pete Sinclair, Maria McErlane, and Kim Wall. It was produced by Phil Clark, and was written by Mark Steel and Pete Sinclair."]}, {"page": "Iris Wildthyme", "response": ["Iris regenerates at the end of The Scarlet Empress (into a form resembling Jane Fonda in Barbarella), and is known to have at least six other incarnations. One of these, Bianca (voiced by Maria McErlane), appears in the Big Finish Productions audio play The Wormery and is similar to the Doctor's villainous Valeyard incarnation. Iris has also apparently worked for UNIT as a Scientific Advisor, and for the Ministry of Incursions and Ontological Wonders (MIAOW)."]}, {"page": "The Wormery", "response": ["*Bianca — Maria McErlane"]}, {"page": "Eurotrash (TV series)", "response": ["The show was conceived in Paris for London-based Rapido Television by producer and director Peter Stuart, son of American film director Mel Stuart. Rapido Television makes over 100 programme titles, mostly for Channel 4, and was originally launched with backing by Richard Branson. The first Eurotrash series were presented by Antoine de Caunes and Jean-Paul Gaultier, with narrative voiceovers by British comic actress Maria McErlane. Gaultier left at the end of series 7 and de Caunes then co-presented with a range of guest presenters for the remainder of the run.", "In 2009, digital channel Living TV began airing a series of new compilation episodes under the title Eurotrash: The Sexy Bits. These included new voiceovers from original narrator Maria McErlane.", "The series was voiced by Maria McErlane (who had also appeared in The Fast Show, a sketch show famous for its 'channel 9' segments, a spoof of European TV channels). Davina McCall provided English voice translations in series 1. In later years Kate Robbins provided voiceovers for the strange continental \"stars\", which she performed in Yorkshire and other British regional accents and similar quirky anglicised effects. Johnny Daukes, former singer and writer with the indie Band FIN in the 1990s, provided male voices in a similar fashion throughout the series."]}, {"page": "Coach Trip", "response": ["On 13 September 2012, Sheerin announced in an interview that he had signed a deal to host a new dating show for Channel 4, titled 'Brendan's Love Boat'. The other replacement show (produced by Optomen) was aired in December 2013, after being commissioned for a 20-episode series. The series, renamed Brendan's Love Cruise, began on 2 December on More4 in the 9:20am slot, narrated by Maria McErlane."]}, {"page": "Room 101 (radio series)", "response": ["*Maria McErlane (22 October 1993)"]}, {"page": "Maria Callous", "response": ["#REDIRECT Maria McErlane"]}, {"page": "Win, Lose or Draw (British game show)", "response": ["*Week 13 - Maria McErlane, Michaela Strachan, Jim Bowen, Tim Vincent", "*Week 3 - Isla Fisher, John Regis, Maria McErlane, Glenn Hugill"]}, {"page": "If I Ruled the World (game show)", "response": ["|Maria McErlane"]}, {"page": "Celebrity Mastermind", "response": ["| Maria McErlane || Unity Mitford || 2nd"]}, {"page": "Just a Minute", "response": ["*Maria McErlane", "In 1999, the BBC televised the show, with 20 episodes recorded during a single week in Birmingham. Nicholas Parsons was again the chairman. There were no regular panellists but those appearing were Pam Ayres, Clare Balding, Isla Blair, Jo Brand, Gyles Brandreth, Ken Bruce, Michael Cashman, Barry Cryer, Stephen Frost, Liza Goddard, Tony Hawks, Peter Jones, Maria McErlane, Richard Morton, Tom O'Connor, Su Pollard, Steve Punt, Wendy Richard, John Sergeant, Brian Sewell, Linda Smith, Richard Vranch and Gary Wilmot. The series was produced by Helena Taylor."]}, {"page": "Carpool (web series)", "response": ["| Maria McErlane"]}, {"page": "The Fast Show", "response": ["The Fast Show, known as Brilliant in the US, is a BBC comedy sketch show that ran from 1994 to 1997, with specials in 2000 and 2014. The show's central performers were Paul Whitehouse, Charlie Higson, Simon Day, Mark Williams, John Thomson, Arabella Weir and Caroline Aherne. Other significant cast members included Felix Dexter, Paul Shearer, Rhys Thomas, Jeff Harding, Maria McErlane, Eryl Maynard, Colin McFarlane and Donna Ewin.", "* I'm not Pissed, a family – mother (Maria McErlane), father (Williams) and son (Day) – who regularly point out that they are not drunk despite the fact they are taking regular sly swigs from gin bottles, beer cans, and the like hidden throughout the house. (series 2)"]}, {"page": "Year Zero (audio drama)", "response": ["*Matka - Maria McErlane"]}, {"page": "Dead Man's Switch (audio drama)", "response": ["*Matka - Maria McErlane"]}, {"page": "McErlane", "response": ["*Maria McErlane (born 1957), British actor and comedian"]}, {"page": "Love Shaft", "response": ["Love Shaft is a British speed-dating game show broadcast on E4.TV highlights 21/5/2012 Guardian preview It is presented by Will Best and narrated by Maria McErlane."]}, {"page": "Love in the Afternoon (TV series)", "response": ["Love in the Afternoon is a short-lived game show, presented by Antoine de Caunes, Carolyn Marshall and Maria McErlane, which ran for only one series and 16 episodes from 30 October 1995 to 14 February 1996."]}, {"page": "Carnal Knowledge (game show)", "response": ["Each edition featured two different couples being asked personal questions by Maria McErlane about their sex lives. Graham Norton acted as the assistant.  One of his roles was keeping the scores."]}, {"page": "BBC Radio 2 Eurovision", "response": ["* Maria McErlane"]}, {"page": "Virgin Radio UK", "response": ["* Maria McErlane"]}, {"page": "McErlane, Maria", "response": ["#redirectMaria McErlane"]}, {"page": "1957 in British radio", "response": ["* 9 December – Maria McErlane, comedy actress"]}]}}