{"wiki_id": "http://www.wikidata.org/entity/Q6766638", "itemLabel": "Mark Bailey", "itemDescription": "soccer player (born 1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Bailey_(footballer)", "wikipedia_page": {"main": "Mark Bailey (born 12 August 1976) is an English former professional footballer who played as a defender.\nHe notably played in the Football League for Rochdale, Lincoln City and Macclesfield Town as well as spells with Stoke City and Peterborough United that yielded no appearances. He also spent time in Non-league football with Winsford United, Lancaster City, Northwich Victoria and Stafford Rangers.", "link_mentions": [{"page": "Brian Horton", "response": ["Linked with the management position at Swansea City, Horton was instead appointed as manager of struggling Third Division club Macclesfield Town at the start of April 2004, replacing John Askey, who stayed on as a coach. This was initially until the end of the season, but Horton was given the job on a permanent basis in May. He rejuvenated a demoralised side and kept them in the Football League, as they finished seven points clear of the relegation zone in 2003–04. Over the summer he signed Iraqi international Jassim Swadi, experienced striker Mike Sheron, veteran defender Tony Barras, left-back Mark Bailey, and Tommy Rooney. He allowed Martin Carruthers to leave, though extended Tommy Widdrington's contract, and offered fresh deals to six others. He later added to his squad by signing Mark Boyd and Simon Weaver; whilst transfer listing Tommy Widdrington and Michael Welch. Many pundits were tipping the \"Silkmen\" to slip out of the newly named League Two at the end of the 2004–05 season, but Horton proved the observers wrong as his side were in the top-seven of the division virtually all season long. Horton celebrated his 1000th game as a manager on 3 November 2004, as Macclesfield beat Mansfield 4–0 in the Football League Trophy. He also won the League Two Manager of the Month award for February. Macclesfield qualified for the play-offs in sixth place, but their promotion challenge was finally ended by Lincoln City in the semi-finals, following a 2–1 aggregate defeat. At the end of the season, Horton released nine players, including club captain Matthew Tipton. In the place of these nine players he signed Kevin Sandwith, Kevin Townson, Martin Bullock, and David Beresford."]}, {"page": "Keith Alexander (footballer)", "response": ["Remaining at the club were former Tottenham Hotspur youngsters Alan Marriott and Peter Gain, Northern Ireland B international centre-back Paul Morgan along with midfielders Adam Buckley, Mark Camm and Ben Sedgemore and wing-backs Mark Bailey and Stuart Bimson and Alexander complemented their talents with a series of signings from outside of the Football League. After just one week in the job, Alexander completed his first two signings bringing Ben Futcher and Dene Cropper to the club on initial one-year contracts. One week later, Alexander made a second double swoop with Simon Weaver and Simon Yeo joining the ranks."]}, {"page": "Bailey (surname)", "response": ["* Mark Bailey (disambiguation), multiple people", "** Mark Bailey (diplomat) (born 1951), Canadian diplomat", "** Mark Bailey (rugby union) (born 1960), English rugby player, headmaster and professor of Medieval History", "** Mark Bailey (baseball) (born 1961), American baseball catcher", "** Mark Bailey (conductor) (born 1962), American conductor and composer of Slavic sacred music", "** Mark Bailey (cricketer) (born 1970), New Zealand cricketer", "** Mark Bailey (footballer) (born 1976), English footballer", "** Mark Bailey (politician) (born 19??), Australian politician"]}, {"page": "Mark Bailey", "response": ["Mark Bailey may refer to:", "*Mark Bailey (diplomat) (born 1951), Canadian diplomat", "*Mark Bailey (rugby union) (born 1960), English rugby player, headmaster and professor of Later Medieval History", "*Mark Bailey (baseball) (born 1961), former catcher in Major League Baseball", "*Mark Bailey (conductor) (born 1962), conductor and composer of Slavic sacred music", "*Mark Bailey (cricketer) (born 1970), New Zealand cricketer", "*Mark Bailey (footballer) (born 1976), former professional football defender", "*Mark Bailey (politician), Australian politician", "*Mark Bailey (writer) (born 1968),  American writer", "*Bill Bailey (born 1965), real name Mark Bailey, British comedian", "*Mark Bailey, a personal trainer on the British TV series The Biggest Loser"]}, {"page": "Chris Ward (footballer)", "response": ["In October 2002, Ward returned to the Football League signing for Lincoln City where he linked up with sometime Lancaster City teammate Mark Bailey. He made his Football League debut for the club as a 74th-minute replacement for Adie Mike in the 0–0 draw at Darlington on 2 November, and scored his first goal for the club on his full league debut against Carlisle United on 4 February 2003, but he struggled to establish himself at Sincil Bank and was released at the end of the season."]}, {"page": "Terry Bailey", "response": ["Terence Bailey (born 18 December 1947) is an English former footballer who played as a midfielder. His son Mark Bailey also played professional football."]}, {"page": "2004 Football League Third Division play-off Final", "response": ["Huddersfield Town's opposition for their semi-final were Lincoln City and the first leg was held at Sincil Bank in Lincoln on 15 May 2004. Iffy Onuora put the visiting side ahead after five minutes with a close-range header from a Rob Edwards corner.  In the 51st minute, Lincoln equalised: a long throw-in from Kevin Ellison eventually found Simon Yeo whose volley was saved by Paul Rachubka but the rebound was scored by Gary Fletcher.  Huddersfield regained the lead through David Mirfin: Andy Holdsworth's corner was headed goalward by Andy Booth and saved by Alan Marriott but the ball fell to Mirfin who scored from a tight angle, ending the match 2–1 to Huddersfield.  The second leg was played four days later at the McAlpine Stadium in Huddersfield.  Richard Butcher scored in the 38th minute after a defensive mix-up between Rachubka and Efe Sodje to give Lincoln a 1–0 lead before Mark Bailey doubled the lead with a shot from the edge of the Huddersfield penalty area.  In the 60th minute, Lincoln's Jamie McCombe fouled Booth to concede a penalty which Danny Schofield converted.  Late in the match, Edwards scored from the edge of the Lincoln box to make it 2–2 and give Huddersfield a 4–3 aggregate victory."]}, {"page": "1994–95 Stoke City F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Mark Bailey"]}, {"page": "List of people from Stoke-on-Trent", "response": ["*Mark Bailey (born 1961), played for Rochdale and Lincoln City."]}, {"page": "2003 Football League Third Division play-off Final", "response": ["The final kicked off around 3p.m. in front of a crowd of 32,148 and was refereed by Alan Kaye.   In the 29th minute, Bournemouth took the lead through Steve Fletcher with a volley past Alan Marriott, the Lincoln goalkeeper.  Ben Futcher equalised six minutes later from close range from a corner but one minute into first-half stoppage time, Carl Fletcher scored with a header to make it 2–1 to Bournemouth.  Eleven minutes into the second half, Bournemouth scored after a counter-attack when Stephen Purches volleyed in a cross from Wade Elliott.  Four minutes later Garreth O'Connor made it 4–1. In the 75th minute, Lincoln scored through Mark Bailey but just over a minute later, Fletcher scored his second, a header from O'Connor's free kick, to make the score 5–2 to Bournemouth, the final score.", "Neither side made any changes to their personnel during the interval and eleven minutes into the second half, Bournemouth extended their lead.  Neil Moss, the Bournemouth goalkeeper, punched the ball clear which enabled his side to counter-attack and Elliott's cross was volleyed into the Lincoln goal by Purches.  Four minutes later it was 4–1 after O'Connor ran onto Steve Fletcher's pass, beat Futcher and struck the ball past Marriott.  In the 75th minute, Lincoln reduced the deficit when second-half substitute Chris Cornelly's cross was headed into the Bournemouth net by Mark Bailey.  Just over a minute later, Fletcher scored with a header from O'Connor's free kick to make the score 5–2 to Bournemouth, which it remained to the final whistle.", "|RB ||2||Mark Bailey"]}, {"page": "Eden Bailey", "response": ["His grandfather, Terry Bailey, played professionally for Port Vale in the 1970s and his father, Mark Bailey, played professionally for Rochdale, Lincoln City and Macclesfield Town."]}, {"page": "List of Rochdale A.F.C. players (25–99 appearances)", "response": ["|Mark Bailey"]}]}}