{"wiki_id": "http://www.wikidata.org/entity/Q6760687", "itemLabel": "Margot Lumb", "itemDescription": "British squash and tennis player", "wikipedia_url": "https://en.wikipedia.org/wiki/Margot_Lumb", "wikipedia_page": {"main": "Margot Lumb (1 July 1912 - 3 January 1998) was a left-handed English squash and tennis player.Margarita Evelyn Lumb was born in London in 1912 to Charles Fletcher Lumb and Margarita Johnson. Her father was a businessman and inventor; her mother was from Cuba. She was one of five children.As a squash player she won the British Open five times in a row from 1935-39. She won all five finals in straight sets. She was also the runner-up at the championship in 1934, when she lost to Susan Noel.Lumb also won the United States Hardball National Championship in 1935.As a tennis player, Lumb participated in the British Wightman Cup team in 1937 and 1938. She was a finalist in the 1937 All England Plate tournament, a tennis competition held at the Wimbledon Championships which consisted of players who were defeated in the first or second rounds of the singles competition. She lost the final in straight sets to Freda James. Lumb was the runner-up at the 1938 German Championships singles event, losing the final in straight sets to defending champion Hilde Sperling.Margot also competed in the main draw of the women's doubles at Wimbledon alongside her sister Berenice (Bernice) from 1937 to 1939, reaching the quarter finals in 1939.Following her marriage in 1944 to W H L (Bill) Gordon, Margot Lumb continued playing both squash and tennis using her married name: either Margot Gordon or Mrs W H Gordon.", "link_mentions": [{"page": "Squash (sport)", "response": ["The women's championship started in 1921, and has been dominated by relatively few players: Joyce Cave, Nancy Cave, Cecily Fenwick (England) in the 1920s; Margot Lumb and Susan Noel (England) 1930s; Janet Morgan (England) 1950s; Heather McKay (Australia) 1960s and 1970s; Vicki Cardwell (Australia) and Susan Devoy (New Zealand) 1980s; Michelle Martin and Sarah Fitz-Gerald (Australia) 1990s and Nicol David (Malaysia) 2000s."]}, {"page": "Helen Wills", "response": ["Wills did not play any competitive singles tennis in 1936 and 1937 and traveled to England in late April 1938. In May she entered the North London Hard Court Tournament, her first singles competition in three years, and won the event by defeating Yvonne Law in the final. She also won the following Surrey Grass Court Championships against Margot Lumb in the final. Wills was persuaded by Hazel Wightman to participate in the Wightman Cup for the first time since 1932. On June 10 and 11 she won her singles matches against Margaret Scriven and Kay Stammers, contributing to the eighth consecutive cup win for the United States. At the Queen's Club Championships she lost in the semifinal to Hilde Sperling. In 1938 she again defeated her rival Helen Jacobs in two sets to win her eighth and last Wimbledon title before retiring permanently from playing in singles. In the following years she did occasionally compete in doubles or mixed doubles events. In a 1994 interview with Inside Tennis, she revealed that a dog bite, which happened in January 1943, ended her career:"]}, {"page": "Margot", "response": ["* Margot Lumb, British squash player"]}, {"page": "German Open (WTA)", "response": ["|  Margot Lumb"]}, {"page": "British Open Squash Championships", "response": ["| 1934 ||  Susan Noel ||  Margot Lumb || 9–7, 9–0, 9–6", "| 1935 ||  Margot Lumb ||  Anne Lytton-Milbanke || 9–4, 9–0, 9–1", "| 1936 ||  Margot Lumb ||  Anne Lytton-Milbanke || 9–5, 9–5, 9–4", "| 1937 ||  Margot Lumb ||  Sheila McKechnie || 9–3, 9–2, 9–0", "| 1938 ||  Margot Lumb ||  Sheila McKechnie || 9–3, 9–2, 9–1", "| 1939 ||  Margot Lumb ||  Susan Noel || 9–6, 9–1, 9–7", "|6||  Margot Lumb || 5 || 1 || 6"]}, {"page": "Pacific Coast Championships", "response": ["|1937|| Anita Lizana || Margot Lumb ||6–2, 6–2 "]}, {"page": "Susan Noel", "response": ["Noel won the British Open three times in a row from 1932 to 1934. She won the final in straight sets on all three occasions. She was also the runner-up at the championship in 1939 when she lost to Margot Lumb.British Open Men's and Women's Champions British Open Hall of Fame "]}, {"page": "Lumb", "response": ["*Margot Lumb (1912–1998, English professional squash player"]}, {"page": "Women's National Champions (squash)", "response": ["| Margot Lumb || 1935"]}, {"page": "Surrey Championships", "response": ["| 1938 ||  Helen Wills ||  Margot Lumb || 6–3 6–4", "| 1939 ||  Mary Hardwick ||  Margot Lumb || 6–4, 6–4"]}]}}