{"wiki_id": "http://www.wikidata.org/entity/Q6760666", "itemLabel": "Margot Boyd", "itemDescription": "British actress (1913-2008)", "wikipedia_url": "https://en.wikipedia.org/wiki/Margot_Boyd", "wikipedia_page": {"main": "Margot Boyd (born Beryl Billings, 24 September 1913 – 20 May 2008) was an English stage, television and radio actress. She grew up in Bath and trained as an actor at the Royal Academy of Dramatic Art (RADA). Here Boyd acted in a production supervised by George Bernard Shaw.\n\n", "link_mentions": [{"page": "The Ladykillers", "response": ["*A radio adaptation of the film, by Bruce Bedford, was first broadcast on BBC Radio 4 on 13 January 1996 starring Edward Petherbridge and Margot Boyd."]}, {"page": "Boyd (surname)", "response": ["*Margot Boyd, (1913-2008) British actor"]}, {"page": "Lady Constance Keeble", "response": ["* In the 1985–1992 Blandings radio series, she was voiced in different episodes by Margot Boyd, Elizabeth Spriggs, and Joan Sanderson."]}, {"page": "List of stage names", "response": ["Margot Boyd – Beryl Billings"]}, {"page": "2008 in British television", "response": ["|Margot Boyd"]}, {"page": "List of The Archers characters", "response": ["Marjorie Antrobus - Archers' creator Edward J Mason had a real-life neighbour with that name - (Margot Boyd) was from a colonial background in Kenya; she was the widow of Teddy. She gave a talk to the Ambridge Women's Institute in 1984 and moved into Nightingale Farm in 1985. A breeder of Afghan hounds, Marjorie let out her flat at Nightingale Farm to Ruth and later to Roy and Hayley. She was an occasionally bossy, but well-meaning, do-gooder in the village. After moving to The Laurels retirement home she was a silent character for several years before her death was finally mentioned on 13 August 2008. (Margot Boyd died on 20 May 2008.)"]}, {"page": "Denville Hall", "response": ["*Margot Boyd"]}, {"page": "Deaths in May 2008", "response": ["*Margot Boyd, 94, British actress (The Archers)."]}, {"page": "List of longest-serving soap opera actors", "response": ["| Margot Boyd || Marjorie Antrobus || The Archers || 1984–2004 ||  years || "]}, {"page": "Waiting in the Wings (play)", "response": ["*Miss Archie – Margot Boyd"]}, {"page": "2008 in British radio", "response": ["*20 May – Margot Boyd, 94, actress"]}, {"page": "Arnold Peters (actor)", "response": ["Peters made many appearances on TV, including a regular role in Swizzlewick (1964), which also featured Philip Garston-Jones, whom he replaced as Jack Woolley, and Margot Boyd, also known for her work in The Archers. He also appeared in Jude the Obscure (1971), London Belongs to Me (Thames, 1977), Dennis Potter's Pennies from Heaven (1978)Marcus Williamson \"Arnold Peters: The voice of Jack Woolley in The Archers\", The Independent, 15 May 2013 and an episode of Only Fools and Horses called \"A Royal Flush\" (1986). In the 1990s, Peters appeared in television advertisements for Werther's Original Toffees."]}, {"page": "Our Miss Pemberton", "response": ["It starred Margot Boyd, James Clifton, Aimée Delamain, Vincent Goodman and Terence Soall."]}, {"page": "The Fruits of Love", "response": ["* Margot Boyd (Lady Spennilove)"]}, {"page": "Blandings (radio series)", "response": ["* Lady Constance Keeble – Margot Boyd (short stories), Elizabeth Spriggs (Summer Lightning, Heavy Weather), Joan Sanderson (Pigs Have Wings)"]}, {"page": "Rumpole of the Bailey (radio series)", "response": ["The first series consisted of a single season of 13 episodes.  It was broadcast in 1980. It starred Maurice Denham as Horace Rumpole and Margot Boyd as Hilda Rumpole."]}, {"page": "The Happiest Days of Your Life (play)", "response": ["A month after the run at the Apollo ended, the BBC televised the play for the third time, on 11 October 1949; Hermione Baddeley played Miss Whitchurch and Denys Blakelock played Pond. Other cast members included Digby Wolfe (Tassell), Alan Wheatley (Billings) and Isabel Dean (Joyce Harper).\"The Happiest Days of Your Life\", BBC Genome. Retrieved 22 June 2020 Radio adaptations were made in 1952 with Winifred Oughton and Cecil Trouncer as Miss Whitchurch and Pond, 1965 with Marjorie Westbury and Carleton Hobbs, and in 1979 with Roger Hammond and Margot Boyd. A television version was broadcast in 1962 with Fabia Drake and Eric Barker.\"The Happiest Days of Your Life\", BBC Genome. Retrieved 20 June 2020"]}]}}