{"wiki_id": "http://www.wikidata.org/entity/Q6769585", "itemLabel": "Mark Santer", "itemDescription": "Anglican bishop (born 1936)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Santer", "wikipedia_page": {"main": "Mark Santer (born 29 December 1936) is a retired Anglican bishop. He is the father of television producer Diederick Santer.", "link_mentions": [{"page": "Anglican Diocese of Birmingham", "response": ["*2003–present: Mark Santer is a retired diocesan Bishop of Birmingham living in Moseley."]}, {"page": "West Midlands Serious Crime Squad", "response": ["The Civil Liberties Trust funded Birmingham University legal academic Tim Kaye to lead an independent inquiry, backed by an advisory panel including Clare Short and the Bishop of Birmingham Mark Santer. It reported in 1991, three years before the official inquiry, and presented evidence of systemic malpractice and patterns of fabrication of evidence and other procedural abuses by specific officers."]}, {"page": "Santer", "response": ["*Mark Santer (born 1936), Anglican bishop"]}, {"page": "Winterval", "response": ["Church of England leaders in Birmingham criticised the 1998 \"Winterval\" concept. Mark Santer, then Bishop of Birmingham, said in a message to his parishes that he \"laughed out loud\" when he learned of the concept of Winterval, which he considered to be \"a way of not talking about Christmas\" and \"a well-meaning attempt not to offend\". He wondered whether Christianity had been censored. The Archdeacon of Aston called it \"a totally unnecessary example of political correctness to avoid sensitivities people simply do not have\". The council responded that \"Christmas is the very heart of Winterval\", saying that Christmas-themed events were prominent among those included in Winterval, and that Christmas-related words and symbols were prominent in its publicity material. While the Winterval season was longer than the Christmas season, Christmas was the focus of the relevant portion of Winterval, and a statement from Birmingham Council explained:"]}, {"page": "Anglican Diocese of Worcester", "response": ["*2002–present: Mark Santer, a retired former diocesan Bishop of Birmingham living in Moseley in the neighbouring Birmingham diocese."]}, {"page": "Anglican–Roman Catholic International Commission", "response": ["The second phase was conducted by the Second Anglican–Roman Catholic International Commission (ARCIC II) from 1983 to 2006. The second phase co-chairs were the Anglican bishops Mark Santer, Frank Griswold, and Peter Carnley; and the Roman Catholic bishops Cormac Murphy-O'Connor, and Alexander Joseph Brunett. A number of Anglican and Roman Catholic clerics served as co-secretaries."]}, {"page": "Bishop of Kensington", "response": ["|align=\"center\"| 1981 ||align=\"center\"| 1987 || Mark Santer || (b. 1936). Translated to Birmingham "]}, {"page": "Bishop of Birmingham", "response": ["| 60px Mark Santer"]}, {"page": "Diederick Santer", "response": ["He is the son of the retired Anglican Bishop Mark Santer."]}, {"page": "Westcott House, Cambridge", "response": ["*1972-1981: Mark Santer"]}, {"page": "List of Old Marlburians", "response": ["* Mark Santer, Bishop of Birmingham 1987-2002"]}, {"page": "James Langstaff (bishop)", "response": ["Langstaff was made a deacon at Petertide 1981 (28 June) and ordained a priest the Petertide following (27 June 1982) — both times by David Brown, Bishop of Guildford, at Guildford Cathedral. He began his ordained ministry with a curacy at St Peter's Farnborough, Hampshire, after which he was Vicar of St Matthew's Church, Duddeston and Nechells and St Clement's Church, Nechells. He was then chaplain to Mark Santer, Bishop of Birmingham, and Area Dean of Sutton Coldfield."]}, {"page": "Life in Christ (document)", "response": ["The text, which is signed by Cormac Murphy O'Connor on the Catholic side and Mark Santer on the Anglican side, also gives a valuable portrait of Catholic teaching surrounding marriage, and why it is regarded as indissoluble.Anglican – Roman Catholic International Commission: Life in Christ: Morals, Communion and the Church  "]}, {"page": "Trevor Mwamba", "response": ["He was made a deacon at Petertide 1984 (1 July) by Mark Santer, Bishop of Kensington (by letters dimissory from Leonard Mwenda, Bishop of Lusaka), at St Luke's, Chelsea, Greater London and served briefly as curate of All Saints, Notting Hill. He left the UK in 1985 to become Rector of Luanshya and Vocations Director for Central Zambia, and was ordained a priest that year."]}, {"page": "List of Honorary Fellows of Queens' College, Cambridge", "response": ["* Mark Santer"]}, {"page": "Ian Jagger", "response": ["Jagger was ordained in the Church of England: made a deacon on Michaelmas Day (29 September 1982) at St Mary's Church, Twickenham (his title church) by Mark Santer, Bishop of Kensington, and ordained a priest at Petertide (26 June) 1983 at St Paul's Cathedral by Graham Leonard, Bishop of London. After a curacy at Twickenham, he was Team Vicar at Willen from 1985 to 1994. He was Team Rector of Fareham from 1994 to 1998; and Rural Dean of Fareham from 1996 to 1998. He was a Canon Residentiary of Portsmouth Cathedral from 1998 to 2001."]}, {"page": "Church of All Saints, Cuddesdon", "response": ["* Mark Santer, later Principal of Westcott House, Cambridge, Bishop of Kensington, and Bishop of Birmingham, served his curacy here from 1963 to 1967"]}, {"page": "Santer, Mark", "response": ["#redirectMark Santer"]}]}}