{"wiki_id": "http://www.wikidata.org/entity/Q6765958", "itemLabel": "Marius Kahan", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Marius_Kahan", "wikipedia_page": {"main": "Marius Kahan (born October 25, 1955, London, England) is an English crossover jazz / funk / Latin electric violinist and composer.\nClassically trained at Trinity College London, he was attracted to jazz at a time when notable figures of the genre were developing new means of expression through the use of electric instruments and alternative rhythms borrowed from rock, funk and Latin styles of music. Key influences on his direction included violinist Jean-Luc Ponty, Santana, Herbie Hancock, Chick Corea and Frank Zappa.\nIn the early 1980s, along with guitarist Richard Scarfe and percussionist / vibesman Mike Turtle, he founded acid jazz group Shinara, a five-piece combo with an unusual line-up and musically diverse style that was well received by audiences.\nOn a visit to California to promote recordings made in his Bracknell studio, Kahan met and signed with Los Angeles based record producer and impresario Lee Magid, a music business veteran responsible for steering numerous artists to success including Lou Rawls, Della Reese and violinist Papa John Creach.\nShinara's self-released album The View From Here, based on the Bracknell sessions, was completed in 1984, but the group folded shortly after due to financial pressure on individual members and few copies saw the light of day.\nDuring the 1990s, under Magid's guidance, Kahan produced his solo debut Tomorrow’s Memories, released on independent label DJC Records in 1998. Featuring prominent players from London’s session scene, including guitarist Mark Jaimes, keyboard players Simon Carter and Jason Wright, and bassists Winston Blissett and Dale Davis, Tomorrow's Memories attracted critical acclaim and enjoyed extensive airplay on 102.2 Jazz FM and Solar Radio in the UK, as well as being playlisted as far afield as Moscow and Budapest across the U.S.\nMagid's deteriorating health prevented him from effectively promoting the release in the US and he died in 2007. Despite lacking representation, Kahan's reputation continued to spread via jazz podcasts.", "link_mentions": [{"page": "Lee Magid", "response": ["In addition to his work as producer and manager, Magid also worked as a club owner, music publisher, and lyricist, and was involved in the careers of T-Bone Walker, Marian McPartland, O.C. Smith, Eddie “Cleanhead” Vinson, and Marlena Shaw, among others.  During the 1980s and 1990s he was the manager of gospel star Tramaine Hawkins and jazz crossover electric violinist Marius Kahan."]}]}}