{"wiki_id": "http://www.wikidata.org/entity/Q6767807", "itemLabel": "Mark Greaves", "itemDescription": "British footballer (born 1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Greaves", "wikipedia_page": {"main": "Mark Andrew Greaves (born 22 January 1975) is an English former professional footballer who played as a defender. \nDuring his career he most notably played in the Football League for Hull City where he played from 1996 until 2002, he then joined Boston United during their time in professional football and managed to chalk up a combined total of 335 games for both teams. Greaves dropped in to Non-League football when he joined Burton Albion in 2007 and went on to feature for York City and Gainsborough Trinity before initially retiring with North Ferriby United in 2011. During the 2015–16 season he briefly came out of retirement and played for  Hull United.", "link_mentions": [{"page": "Hull City A.F.C.", "response": ["|1999–2000|| Mark Greaves"]}, {"page": "Daniel Parslow", "response": ["Parslow started his career with Cardiff City in their youth system, before signing a professional contract in 2005. He signed for Conference National club York City a year later after being released by Cardiff. He did not establish himself in the team in the 2006–07 season, but played in their play-off semi-final defeat by Morecambe. He became a regular starter during 2007–08 under the management of Colin Walker, and during 2008–09 assumed the captaincy from Mark Greaves. In this season, he was named Clubman of the Year and led the team to the 2009 FA Trophy Final, in which York were beaten 2–0 by Stevenage Borough. Parslow was replaced as captain by Michael Ingham during 2009–10, and was an unused substitute in York's 3–1 defeat by Oxford United in the 2010 Conference Premier play-off Final. He won his second Clubman of the Year award in 2010–11, having appeared in all of York's matches that season.", "He signed a new contract with York in September 2008 that contracted him to the club until June 2010. He took over the captaincy when club captain Mark Greaves and vice-captain McGurk were out of the team, starting on 27 January 2009 for a 1–1 draw away to Altrincham. Having \"led by example\" after attaining the captaincy, he was voted by supporters as York's Clubman of the Year for 2008–09, being presented the award before their penultimate home match against Eastbourne Borough on 18 April 2009. He started in the 2009 FA Trophy Final at Wembley Stadium on 9 May 2009, which York lost 2–0 to Stevenage Borough. Ahead of the Trophy final, he was rested for the final league match away to Lewes on 26 April 2009; this was the only match he missed in 2008–09, which he finished with 57 appearances."]}, {"page": "2008–09 York City F.C. season", "response": ["Jimmy Beadle, Richard Brodie, Craig Farrell, Josh Mimms, Daniel Parslow, Ben Purkiss, Mark Robinson and Onome Sodje signed new contracts ahead of 2008–09. York signed seven players before the season started; they were goalkeepers Michael Ingham from Hereford United and Artur Krysiak on a one-month loan from Birmingham City, defender Mark Greaves from Burton Albion, midfielders Niall Henderson from Raith Rovers, Steven Hogg from Gretna and Ben Wilkinson from Hull City, and striker Daniel McBreen from St Johnstone. Professional contracts were handed to three youth-team players, those being defenders Andy McWilliams and Josh Radcliffe and winger Liam Shepherd. Greaves was named as York's club captain for the season.", "|Mark Greaves", "|Mark Greaves", "!scope=row|Mark Greaves"]}, {"page": "2009–10 York City F.C. season", "response": ["Colin Walker was dismissed as manager of York City early into the 2008–09 season, and his successor was former Port Vale manager Martin Foyle. The team finished the season in 17th-place in the Conference Premier table, and were defeated 2–0 by Stevenage Borough in the 2009 FA Trophy Final at Wembley Stadium. Mark Greaves, Steven Hogg, Daniel McBreen, Shaun Pejic, Josh Radcliffe, Mark Robinson, Simon Rusk, Liam Shepherd and Christian Smith and Ben Wilkinson were released by York after the season ended. Adam Boyes, Craig Farrell, Darren Kelly and Onome Sodje left for Scunthorpe United, Rushden & Diamonds, Portadown and Barnsley respectively."]}, {"page": "2009 FA Trophy Final", "response": ["|CM ||8|| Mark Greaves || || "]}, {"page": "2001 Football League Third Division play-off Final", "response": ["In the second semi-final, Leyton Orient faced Hull City and the first match was played at Boothferry Park, Hull's home ground, on 13 May 2001.  The first half ended goalless with the best chance coming when a flick-on from Kevin Francis found Mark Greaves whose shot struck the Leyton Orient crossbar.  John Eyer came on as a substitute for Francis midway through the second half and within minutes had put Hull ahead.  Leyton Orient failed to clear a Hull corner and Eyre's shot from the edge of the penalty area beat Ashley Bayes to make it 1–0.  The second leg took place three days later at Brisbane Road in Leyton.  The home side took the lead a minute before half-time when Steve Watts headed in a cross from Scott Houghton from around .  Leyton Orient dominated the game and doubled their lead midway through the second half when Matt Lockwood scored from  direct from a free kick.  It gave them a 2–1 aggregate victory and saw them progress to the final."]}, {"page": "1999–2000 Hull City A.F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Mark Greaves"]}]}}