{"wiki_id": "http://www.wikidata.org/entity/Q6769870", "itemLabel": "Mark Stone", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Stone_(baritone)", "wikipedia_page": {"main": "Mark Stone (born 12 June 1969) is a British baritone appearing in concerts, recitals, and opera.", "link_mentions": [{"page": "War Requiem", "response": ["* Challenge Classics: Evelina Dobracheva, Anthony Dean Griffey, Mark Stone; Netherlands Radio Philharmonic Orchestra; Netherlands Radio Choir, Netherlands Children's Choir; Jaap van Zweden, Reinbert de Leeuw conductors (2011)"]}, {"page": "William Tell (opera)", "response": ["In 2010 there was an important revival of the opera, when it opened the Accademia Nazionale di Santa Cecilia's season, under Antonio Pappano.\"Report from Santa Cecilia\", 3 September 2010, on santacecilias.it This performance was of the French version, with some cuts to particularly the fourth act (which Pappano noted had been approved by Rossini himself).Pappano, Antonio, (15 July 2011), \"Proms take a bite of William Tell\", The Guardian (London) A live recording of this concert performance was released in 2011, and the production was transferred to The Proms in July of that year, with Michele Pertusi taking on the title role, Patricia BardonPatricia Bardon on Opera Rara as Hedwige, Nicolas Courjal as Gessler, and Mark Stone as Leuthold. The performance was very well reviewed, and marked the first full performance of the work in the history of the Proms.Seckerson, Edward, (17 July 2011), \"Prom 2: Rossini – William Tell, Royal Albert Hall, London\", The Independent (London)."]}, {"page": "Gramophone Classical Music Awards", "response": ["*Contemporary: Thomas Adès: Piano Concerto / Totentanz Kirill Gerstein; Mark Stone; Christianne Stotijn; Boston Symphony Orchestra / Thomas Adès  (Deutsche Grammophon)"]}, {"page": "Gloriana", "response": ["The Royal Opera House in London presented a performance in June–July 2013 to celebrate both the 60th anniversary of the opera, and the centenary of Britten's birth. The performance starred Susan Bullock, Toby Spence, Patricia Bardon and Mark Stone.Rupert Christiansen, Gloriana: Britten's problem opera\", The Telegraph (London), 16 June 2013. Retrieved 20 July 2013Susan Bullock,  \"Pomp and circumstances: Britten's Gloriana, The Guardian (London), 19 June 2013. Retrieved 20 July 2013"]}, {"page": "Choir of King's College, Cambridge", "response": ["* Mark Stone (choral scholar) – baritone"]}, {"page": "Stone (surname)", "response": ["*Mark Stone (disambiguation), several people including", ":*Mark Stone, real name Mark Kennedy (police officer) (born 1969), undercover Metropolitan Police officer in the UK", ":*Mark Stone (baritone) (born 1969), British baritone", ":*Mark Stone (ice hockey) (born 1992), Canadian ice hockey player", ":*Mark Stone (journalist), Asia Correspondent of Sky News, from 2012", ":*Mark Stone (politician), California politician"]}, {"page": "Kirill Gerstein", "response": ["with the Boston Symphony Orchestra and Thomas Adès, conductor; Mark Stone, baritone; Christianne Stotijn, mezzo-soprano"]}, {"page": "Guy Johnston", "response": ["Johnston recorded the Duruflé Requiem with Christine Rice (mezzo-soprano), Mark Stone (baritone), Tristan Mitchard (organ), The Choir of Somerville College, Oxford, and David Crown (conductor), released on the Stone Records label in 2012."]}, {"page": "La straniera", "response": ["A complete concert performance was given in November 2007 in London, with Patrizia Ciofi as Alaide, Dario Schmunck as Arturo, and Mark Stone as (Valdeburgo) in the principal roles, conducted by David Parry with the London Philharmonic Orchestra and a complete studio recording was made with this cast the same week.London Philharmonic Orchestra programme book, 3 November 2007.", "|Patrizia Ciofi,Roland Wood,,Dario Schmunck,Mark Stone"]}, {"page": "Mark Stone", "response": ["Mark Stone may refer to:", "* Mark Kennedy (police officer) (born 1969), former Metropolitan Police officer in the UK, known undercover as Mark Stone", "* Mark Stone (baritone) (born 1969), British baritone", "* Mark Stone (ice hockey) (born 1992), Canadian ice hockey player", "* Mark Stone (journalist) (born 1979), Middle East correspondent of Sky News, 2019-", "* Mark Stone (politician) (born 1957), California politician", "* Mark Stone (EastEnders), fictional character", "* Mark Stone: MIA Hunter, a series of men's adventure novels", "* Mark Stone, original bassist of rock band Van Halen"]}, {"page": "British Youth Opera", "response": ["British Youth Opera was started by Denis Coe, MP in 1987, to give high-standard performance opportunities to singers straight out of music college. Denis was a member of the board of the National Youth Theatre and had seen that the practical experience participants were receiving was greatly enhancing their opportunity for entering the profession. In the days before the opera companies had young artists’ programmes, British Youth Opera was conceived as a ‘bridge’ organisation, to offer young singers performance opportunities in a fully professional but nurturing environment, in which they could train on the job and perform before a paying audience of the public, and before industry professionals whose influence could help them in their ongoing careers. Alumni have gone on to advanced training courses at the Royal Opera House and the National Opera Studio, and to professional careers. Alumni include Peter Auty, Lucy Crowe, Rosemary Joshua, Katarina Karnéus, Sally Matthews, Christopher Maltman, Claire Rutter, Nicky Spence, Matthew Stiff, and Mark Stone."]}, {"page": "Bath Bach Choir", "response": ["The Bath Bach Choir's biggest recent challenge – supported by the combined forces of Exeter Festival Chorus and The Wellensian Consort– was arguably staging two performances of The Saint John Passion, an exceptionally demanding contemporary piece composed by Sir James MacMillan CBE and sung in his presence. Performances took place at Wells Cathedral and then Exeter Cathedral in March 2013, with soloist Mark Stone as Christus, and Alexander Hohenthal leading Southern Sinfonia. The baroque performance of the Messiah (Handel), accompanied by Music for Awhile, with Leader Margaret Faultless, a musician within the Orchestra of the Age of Enlightenment went down especially well with the packed audience. Consequent upon Coronavirus (COVID-19) in 2020, and UK Government restrictions on live concerts, the choir produced three ‘virtual performances’ of singular works. The choir returned to Bath Abbey for a live concert, socially distanced, presented to a restricted but most appreciative audience of 150 people on 3 July 2021; judging by the request for an encore!", "|St John Passion – Christus Mark Stone (baritone): City of Bath Bach Choir, Exeter Festival Chorus, Wellensian Consort, Southern Sinfonia, Leader Alexander Hohenthal", "|St John Passion – Christus Mark Stone (baritone): City of Bath Bach Choir, Exeter Festival Chorus, Wellensian Consort, Southern Sinfonia, Leader Alexander Hohenthal. In the presence of the composer James MacMillan"]}, {"page": "Stone Records", "response": ["Stone Records was founded in 2008 by opera singer Mark Stone to produce his own recordings. He began by making CDs of English song, but the label soon attracted other artists interested in releasing independent recordings. As such its repertoire has widened to include instrumental, choral and orchestral works. The artist list has grown steadily over the first few years and includes important collaborations with the Oxford Lieder Festival, contemporary composers such as Ronald Corp and Paul Carr, and chamber ensembles the Lendvai String Trio and the Phoenix Piano Trio."]}, {"page": "Opera North: history and repertoire, seasons 2004–", "response": ["|2007–08 || A MidsummerNight's Dream ||  Britten ||  James Laing (Oberon), Jeni Bern (Tytania), Henry Waddington (Bottom), Peter Wedd (Lysander), Elizabeth Atherton (Helena), Frances Bourne (Hermia), Mark Stone (Demetrius) ||  Stuart Stratford ||  Martin Duncan ||  Johan Engels/AshleyMartin-Davis", "|2008–09 || Skin Deep(world premiere) ||  Sawer ||  Geoffrey Dolton (Needlemeier), Janis Kelly (Lania), Heather Shipp (Donna), Amy Freston (Elsa), Andrew Tortise (Robert), Mark Stone/Riccardo Simonetti (Luke), Gwendoline Christie (Susannah) ||  Richard Farnes ||  Richard Jones ||  Stewart Laing"]}, {"page": "Gavin Carr", "response": ["In 2014 Carr conducted Un Ballo in Maschera for Dorset Opera, in a cast featuring Svetlana Kasyan, Luis Chapa, and Dame Rosalind Plowright. These performances led to an engagement for 2015 to conduct Eugene Onegin, with a cast including Mark Stone, Anna Patalong, Diana Mpntague, David Rendall and Brindley Sherratt.", "*Paul Carr: Requiem for an Angel (with Sophie Bevan – soprano, Mark Stone – baritone, Chorus Angelorum and the Bath Philharmonia), Stone Records (2010)"]}, {"page": "Mark Stone (opera singer)", "response": ["#REDIRECT Mark Stone (baritone)"]}, {"page": "Elena Langer", "response": ["Welsh National Opera commissioned a sequel to The Barber of Seville and The Marriage of Figaro, to be performed together as a trilogy in the company's Spring 2016 programme. The libretto of Figaro Gets a Divorce was written by David Pountney, and the opera was premiered in Cardiff in February 2016, with designs by Ralph Koltai and conducted by Justin Brown. The main roles were sung by Marie Arnet (Susanna), Elizabeth Watts (Countess Almaviva), Mark Stone (Count Almaviva) and Alan Oke (The Major). The opera subsequently toured around the UK and in 2017 was performed at the Teatr Wielki in Poznań and at the Grand Théâtre, Geneva, with a live stream on the Arte Channel in Switzerland. The opera is scheduled for performances at Theater Magdeburg  from 22 January 2022."]}, {"page": "List of operas performed at the Santa Fe Opera", "response": ["|2007 || Così fan tutte || Wolfgang Amadeus Mozart || Italian || 1790 || William Lacey || James Robinson || Allen Moyer,David C. Woolard,Duane Schuler || Norman Reinhardt,Mark Stone,Susanna Phillips,Katharine Goeldner,Dale Travis,Susanne Mentzer"]}, {"page": "Figaro Gets a Divorce", "response": ["|Count ||baritone||Mark Stone"]}, {"page": "Vert-Vert", "response": ["Complete recording with dialogue : Thora Einarsdottir (Mimi), Ann Taylor (Emma), Lucy Crowe (Bathilde), Toby Spence (Valentin), Mark Le Brocq (Binet), Mark Stone (Le Comte d'Arlange), Anne-Marie Owens (Mademoiselle Paturelle), Franck Leguérinel (Baladon), Loïc Félix (Chevalier de Bergerac), Jennifer Larmore (La Corilla), Sébastien Droy (Bellecour), Franck Lopez (Maniquet),  Geoffrey Mitchell Choir, Philharmonia Orchestra, David Parry – Opera Rara, 2010"]}, {"page": "Choir of Somerville College, Oxford", "response": ["In 2010/2011 the choir performed Bach's St John Passion and recorded its first commercial CD, under David Crown's directorship: 'Requiem æternam' (Maurice Duruflé's Requiem and Robin Milford's Mass for Five Voices), which was released by Stone Records in 2012. The album features Guy Johnston (cello), Christine Rice (mezzo-soprano) and Mark Stone (baritone)."]}, {"page": "Alice's Adventures Under Ground (opera)", "response": ["|White Knight/Cheshire Cat/Soldier/Bottle 3Cake 3/Baby 3/Oyster 3/Passenger 5/Daisy 3||baritone||Mark Stone", "|Stephen Richardson / Mark Stone"]}]}}