{"wiki_id": "http://www.wikidata.org/entity/Q6769179", "itemLabel": "Mark Patton", "itemDescription": "Jersey archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Patton_(archaeologist)", "wikipedia_page": {"main": "Mark Patton (born 7 January 1965 in Jersey) is a British archaeologist and novelist known for his work on the prehistory of the Channel Islands and North-Western France, particularly the archaeology of megaliths, as well as the prehistory of the Mediterranean islands, the theory of island biogeography and the history of European archaeology. He is also the author of three historical novels, Undreamed Shores (2012), An Accidental King(2013) and Omphalos (2014).", "link_mentions": [{"page": "Amesbury Archer", "response": ["The character of Arthmael in Mark Patton's novel Undreamed Shores is based on the Archer."]}, {"page": "Tiberius Claudius Cogidubnus", "response": ["He is also the central character in Mark Patton's novel, An Accidental King,Mark Patton, An Accidental King,  and a minor character in Douglas Jackson's novel, Claudius.Douglas Jackson, Claudius, "]}, {"page": "Boscombe Bowmen", "response": ["The bowmen feature as characters in Mark Patton's novel Undreamed Shores,Patton, M. A. 2012 Undreamed Shores, Edinburgh, Crooked Cat Publications. ; . and part of the storyline is based on the circumstances of their burial."]}, {"page": "Mark Patton", "response": ["Mark Patton (born September 22, 1959) is an American interior designer and actor.  Beginning his professional acting career in 1982, Patton is perhaps best known for his feature film roles as Joe Qualley in the dramatic film Come Back to the Five and Dime, Jimmy Dean, Jimmy Dean and as Jesse Walsh in the 1985 horror film A Nightmare on Elm Street 2: Freddy's Revenge, a role for which he is touted as the first male scream queen in modern cinema."]}, {"page": "Jersey dolmens", "response": ["But with the dolmens, as Mark Patton has pointed out, the human remains found are few in number, and sometimes (as La Sergenté) non-existent. This is also the case in Brittany, where animal bones can be found, and not human bones, suggesting that these \"passage graves\" were never intended for burials, and certainly not for burials of chieftains. On the most prominent Jersey site,  he comments: “the bones are scattered in the passage and chamber with no apparent organisation, as at La Hougue Bie, Jersey”..", "So if these sites were not tombs, what were they for? Mark Patton suggest that a useful analogy is that of churches and cathedrals. He argues: \"If one were to excavate Westminster Abbey, one would find human bones, as in most cathedrals and churches, yet Westminster Abbey, although it contains burials, would not in itself be described as a tomb or mausoleum\", and suggests that we look at the dolmens in this light. The historian Ronald Hutton comes to much the same conclusion, that these sites were mainly used as religious centres, and each would have been a \"focus for a group of scattered farms or a settlement, bonded as a clan or family\" - very much a precursor to the idea of a \"parish\".", "So how are to understand the dolmens. Mark Patton suggests that we can imagine the tribes coming together, for various significant times of the year, to celebrate in ritual the passage of the seasons.", "Mark Patton (1987) noted that there was a considerable degree of variation in terms of funerary practices and how the dead were treated. In  Mont Grantez,(Nicolle et al. 1913) \"seven articulated skeletons were found (six were in flexed positions in the chamber, the seventh was apparently placed in a seated position in the chamber). Disarticulated remains, however, are more usual, suggesting prior exposure or burial of the corpse.\"", "Mark Patton noted that the corbelled vault required a rock such as schist, which fractures to give long, flat slabs, and in Jersey, the available rock was not suitable. Consequently, while La Sergenté is the earliest passage grave in Jersey, it collapsed soon after its construction, because of the unsuitable building materials available, and was not repeated elsewhere in the Islands.(Patton 1987a).", "Mark Patton comments: “There are three passage graves in Jersey (Le Mont de la Ville, Faldouet and La Hougue des Géonnais) which have large, open chambers. The chambers of these monuments cannot have been roofed with capstones (the uprights are too small to have supported capstones large enough to span the chambers), and corbelled vaulting would be impractical given the character of the available stone. It is conceivable that these chambers had wooden roofs, but recent excavations at La Hougue des Géonnais (Forrest and Rault forthcoming) provided no evidence for this. Assuming that the chambers were open, the cairns of these monuments cannot have covered the chambers whilst they were in use, and must rather have formed a sort of platform around an open ‘arena’.”", "Mark Patton comments: “Recent researchRenouf and Urry 1986, Patton 1987a and in press has demonstrated the existence of an axe production centre at Le Pinacle, Jersey, and ‘Type P’ dolerite axes produced at Le Pinacle have been identified in assemblages from Guernsey, Sark and Alderney as well as Jersey. Axes of Type P dolerite, however, seem not to be found on the Armorican mainland. “", "But many historians and archaeologists now believe that the Beaker people did not exist as a group; as Mark Patton explains, the beakers and related artefacts that are attributed to the Beaker people may well indicate the migration of a \"beaker culture\" rather than a \"beaker people\". This is most succinctly summed up by Ronald Hutton:", "*Jersey in Prehistory, Mark Patton, 1987", "*Statements in Stone: Monuments and Society in Neolithic Brittany, Mark Patton, 1993", "*Hougue Bie, Mark Patton, Warwick Rodwell, Olga Finch, 1999"]}, {"page": "La Hougue Bie", "response": ["*La Hougue Bie, Jersey – A Study of the Neolithic Tomb, Medieval Chapel and Prince's Tower, Including an Account of the 1991–94 Excavations., Mark Patton, Warwick Rodwell, Olga Finch, 1999. ."]}, {"page": "Mark patton (archaeologist)", "response": ["#REDIRECT Mark Patton (archaeologist) "]}, {"page": "Bibliography of Jersey", "response": ["*Jersey in Pre-history – Mark Patton, 1987 (750)"]}]}}