{"wiki_id": "http://www.wikidata.org/entity/Q6767716", "itemLabel": "Mark Gardiner", "itemDescription": "English footballer and manager (born 1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Gardiner", "wikipedia_page": {"main": "Mark Christopher Gardiner (born 25 December 1966 in Cirencester) is an English former professional footballer who made 262 appearances in the Football League. He could play effectively at either left-back or left-wing.\nGardiner began his career as an apprentice with Swindon Town, making his league debut while still an apprentice in a 1–1 draw against Mansfield Town at the County Ground in April 1984. He turned professional in September 1984, making 10 league appearances, scoring 1 goal for the Robins.\nHe joined Torquay United on a free transfer in February 1987 (as part of the deal taking Phil King to Swindon_ and was plunged straight into the relegation battle, which would eventually see Torquay survive on the last day of the season and Lincoln City relegated to the Conference. The following season, Gardiner remained a regular in the resurgent Torquay side, scoring a spectacular winner away to Bolton Wanderers (only to be given a roasting by then manager Cyril Knowles as he was supposed to have aimed for the corner-flag as Torquay held on for a draw).\nIn August 1988 Gardiner left for Crewe Alexandra, again on a free transfer, after making 49 league appearances for the Gulls, scoring 4 goals in the process. At Crewe he helped the Railwaymen to promotion from the bottom flight in both 1989 and 1994. After a spell on loan to Chester City in March 1995, in which he played 3 league games, he left Crewe for a short spell in Norway with Fredrikstad F.K., returning to the UK to become a postman in Crewe.\nHe joined Macclesfield Town in October 1995, where he continued to fit in his postal duties with full-time training. Gardiner was a member of the team that helped Macclesfield to promotion to the Football League, though he only made 7 league appearances, scoring twice, in that debut season. In December 1997, he moved to Northwich Victoria, scoring the winning goal on his Conference debut against Stalybridge Celtic on 25 December. In November 1998, Northwich manager Phil Wilson was sacked with the Vics in 12th place in the Conference. Gardiner took over as caretaker manager, his first game in charge bringing a 3–0 home win over Welling United. He was confirmed as manager that December, and led Northwich to 7th in the Conference and to the last eight of the FA Trophy.\nThe following season was a struggle, Northwich flirted with relegation, finally finishing 18th, and were knocked out of the FA Trophy by Runcorn in the 2nd Round. On 3 October 2000, with Northwich bottom of the Conference with only 9 points from 12 games, Gardiner was sacked, joining Leek Town as a player, making his debut in a draw at Altrincham. Within a fortnight of Gardiner signing for Leek, Andy Holmes was sacked as Leek manager and on 3 November 2000, Gardiner was given his job. However, with Leek desperately short of money and struggling in the league, it was never going to be an easy task. In January 2001, Gardiner was told to cut the wage bill after having his budget cut and promptly resigned. He almost immediately joined Nantwich Town as a player, making his debut at left-back in a 2–0 win over Ramsbottom United. He was still playing for Nantwich in 2004.\nIn 2006 Gardiner had a brief spell in the TC Exiles squad which played in the Cirencester District Division 2. He led them to a final in which they ran out 2–1 to a last minute winner. Exiles soon folded and, with a string of injuries, Gardiner called it a day.", "link_mentions": [{"page": "Mark Gardner", "response": ["*Mark Gardiner (born 1966), English footballer", "*Mark Gardiner (gamer) (born 1983), Scottish semi-professional video gamer"]}, {"page": "Phil King (footballer)", "response": ["Born in Bristol, King began his career as an apprentice with Exeter City, turning professional in January 1985, and making his league debut the same season. After 27 games for the Grecians, he moved to Torquay United in July 1986 for a fee of £3,000 instantly fitting in as a regular in Stuart Morgan's struggling side. However, in February 1987, after 24 league games in which he scored 3 times, he was sold to Swindon Town for £25,000 with United desperately short of players and with no money to spend, Mark Gardiner and Charlie Henry (on loan) coming in the opposite direction."]}, {"page": "Mark Bailey (footballer)", "response": ["Bailey began his career as a trainee with his home town club Stoke City before moving to Rochdale on a free transfer in October 1996. He made his Football League debut for the club in the 1–0 away victory over Torquay United on 3 December 1996 and by the end of March had secured a regular birth in the first team. The 1997–98 season saw Bailey maintain his presence in the team, making 24 league starts with a further nine appearances from the substitutes bench. He began the 1998–99 season as a regular member of the first team but dropped to the bench at the beginning of October and drifted out of the first team picture in mid-December. In January 1999, he attracted the attention of Northwich Victoria's manager Mark Gardiner but a proposed loan move was thwarted by Bailey sustaining a minor hamstring injury. He managed to break back into the Rochdale team in March 1999, making his first league start in nearly four months in the 0–0 home draw with Barnet on 20 March 1999. However, he made only three further appearances before being released by the club at the end of the season.", "Bailey continued to attract the attention of Northwich Victoria's manager Mark Gardiner and having turned down one offer to join the Vics to remain at the Giant Axe, Gardiner came back with an improved pay offer which coupled with the lure of moving nearer to home in the Stoke area proved too much for Bailey and he departed Lancaster City in January 2000. He made his Football Conference debut for the club in the 2–0 defeat at Altrincham on 3 January 2000 scoring his first goal for the club in the 3–1 victory at Welling United on 8 January 2000."]}, {"page": "Colin West", "response": ["West signed with Rushden & Diamonds permanently for the 1998–99 season, and helped the club to another fourth-place finish. He moved on to Mark Gardiner's Conference strugglers Northwich Victoria in the 1999–2000 campaign, before ending his career at Hartlepool United, where he made just a single appearance in 1999–2000."]}, {"page": "Northwich Victoria F.C.", "response": ["|  Mark Gardiner"]}]}}