{"wiki_id": "http://www.wikidata.org/entity/Q6769174", "itemLabel": "Mark Patterson", "itemDescription": "English footballer and manager (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Patterson_(footballer,_born_1965)", "wikipedia_page": {"main": "Mark Patterson (born 24 May 1965) is an English former footballer who made nearly 500 appearances in the Football League playing as a midfielder for Blackburn Rovers, Preston North End, Bury, Bolton Wanderers, Sheffield United, Southend United and Blackpool. He went on to play, and then to manage, in non-League football.", "link_mentions": [{"page": "Darwen", "response": ["*Mark Patterson, Premiership football player for Blackburn Rovers, Bolton Wanderers. Born 1965"]}, {"page": "Neil Redfearn", "response": ["Redfearn spent the better part of two years at Boston, before finishing his Football League career at Rochdale in the spring of 2004. Rochdale did not offer him a new contract at the end of the season, meaning he finished his Football League career with 790 appearances and so being fifth in the all-time list of most Football League appearances. His last league appearance for Rochdale took his total to . after which Redfearn dropped down to the Conference, where he became player-coach at Scarborough, managed at the time by his former Oldham teammate Nick Henry. He signed a new contract with Scarborough in April 2005. When Henry was dismissed on 24 October 2005 Redfearn was named caretaker manager, before being appointed permanently on 1 November while remaining registered as a player. Redfearn resigned on 6 July 2006 after Mark Patterson was brought in as assistant manager. He subsequently signed with Northern Premier League First Division side Bradford Park Avenue later that month. He made his 1,000th competitive appearance on 4 November 2006, when Bradford Park Avenue faced Solihull Borough in the second qualifying round of the FA Trophy."]}, {"page": "Martyn Lancaster", "response": ["In January 2003, Lancaster signed for Conference club Leigh RMI. On 18 January, he made his debut in the win against Burton Albion at Eton Park. He scored his first goal for the club in the win against Forest Green Rovers on 29 March. A week later he was sent off in the defeat at Stevenage Borough. On 16 April, he played 61 minutes as RMI beat Kendal Town to win the Lancashire FA Challenge Trophy. Lancaster ended his first season at Leigh with 13 league appearances and one goal as RMI avoided relegation. Manager Mark Patterson persuaded him to sign on at Leigh for another season despite having offers from other clubs."]}, {"page": "1995 Football League Cup Final", "response": ["|MF ||12|| Mark Patterson"]}, {"page": "Mark Patterson (footballer, born 1968)", "response": ["Mark Patterson (born 13 September 1968 in Leeds) is an English former professional footballer. He played over 300 Football League matches for Carlisle United, Derby County, Plymouth Argyle and Gillingham between 1986 and 2002."]}, {"page": "Mark Patterson", "response": ["Mark Patterson may refer to:", "* Mark Patterson (Australian cricketer) (born 1966), Australian cricketer", "* Mark Patterson (Irish cricketer) (born 1974), former Irish cricketer", "* Mark Patterson (field hockey) (born 1969), Indian Olympic hockey player", "* Mark Patterson (footballer, born 1965), former Bolton Wanderers, Blackburn Rovers, Preston North End and Bury player, later manager of Scarborough", "* Mark Patterson (footballer, born 1968), former Plymouth Argyle and Gillingham player", "* Mark Patterson (investor), private equity and hedge fund investor who co-founded MatlinPatterson Global Advisors, and a racing driver", "* Mark Patterson (Idaho politician), American politician in the Idaho House of Representatives", "* Mark Patterson (New Zealand politician), member of the New Zealand House of Representatives"]}, {"page": "Eric Winstanley", "response": ["Winstanley became technical director of the Saint Kitts and Nevis national team in 2001, before leaving in February 2004.  He worked as youth-team coach at Doncaster Rovers during the 2004–05 season. Winstanley was brought into the Scarborough coaching staff as assistant manager in October 2005. He left the position in July 2006 following Mark Patterson's arrival onto the coaching staff and became the York City head of youth development in October. He worked in this role along with being Colin Walker's assistant since November 2007 until being appointed head coach following Neil Redfearn's arrival as youth-team coach in February 2008. He was dismissed as head coach alongside manager Walker on 21 November 2008."]}, {"page": "1989 Football League Third Division play-off Final", "response": ["Port Vale's opponents for the play-off semi-final were Preston North End, managed by John Rudge's predecessor John McGrath, and the first leg was played on the plastic pitch at Deepdale in Preston on 22 May. Port Vale sold their 3,500 allocation for the game in three days. Preston's Nigel Jemson put the home side in front on 16 minutes, before Robbie Earle levelled the score at 1–1 after a John Jeffers cross was flicked on by Darren Beckford. There was a pitch invasion by the Preston fans after a fire erupted under the wooden slats of their stands.  Joan Walley, Member of parliament (MP) for the Stoke-on-Trent North constituency, called for an enquiry at Parliament, but none was made. The return leg was held at Vale Park three days later. Beckford opened the scoring on 11 minutes after latching on to a Ron Futcher flick on, only for Mark Patterson to again level the tie just two minutes later. Futcher had the chance to take the lead with a penalty, only to hit the bar, before Beckford scored two goals in quick succession to claim a hat-trick and secure a 4–2 aggregate victory."]}, {"page": "1995 Football League First Division play-off Final", "response": ["Bolton's team was struck with several injuries: David Lee had broken three bones in his foot in the second leg of the play-off semi-final, while Mark Patterson, Richard Sneekes and Coleman were also ruled out. Alan Stubbs was receiving treatment for a thigh injury, but secured a place in Bolton's starting eleven.  Neil McDonald was also back in the squad, having served a suspension.  Reading's Adrian Williams was available for selection following his recovery from an ankle injury sustained in the semi-final at Elm Park.  Simon Osborn was a doubt with a knee ligament injury, but delayed an operation in order to play. "]}, {"page": "Mark Patterson (footballer born 1965)", "response": ["#REDIRECT Mark Patterson (footballer, born 1965)"]}, {"page": "1998–99 Southend United F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Mark Patterson"]}]}}