{"wiki_id": "http://www.wikidata.org/entity/Q6767285", "itemLabel": "Mark Davies", "itemDescription": "English cricketer (born 1980)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Davies_(cricketer,_born_1980)", "wikipedia_page": {"main": "Mark Davies (born Anthony Mark Davies, 4 October 1980) is an English former first-class cricketer who played for Durham County Cricket Club and, briefly, Kent County Cricket Club. He bowled right-arm medium-pace and batted in the tail.\nIn December 2009, he was called up from the England Lions into the full England squad, to cover for injuries to other bowlers during the tour of South Africa. Davies suffered many injuries during his career. In September 2014, he was forced to retire from all forms of cricket after failing to recover from a shoulder injury picked up in a pre-season fixture.", "link_mentions": [{"page": "Essex County Cricket Club in 2005", "response": ["Durham continued their run of unbeaten matches in the 2005 season by defeating Essex in just three days at Chester-le-Street. Durham batted first, and made a total of 505 in the first innings, with Gordon Muchall and stand-in captain Dale Benkenstein both making centuries and ten batsmen made it into double figures. The Durham bowlers then backed up the batsmen's efforts by seeing off the Essex batsmen in just 55 overs to leave them all out for 106, Ashley Noffke and Mark Davies taking four wickets each. Essex followed on 399 behind, and were 140 for 6 after three wickets from Davies, despite nightwatchman Dale Steyn making 82. However, number nine Andre Adams made 103, James Foster added 78, and Essex made it to 366 for 7 – before Davies grabbed two wickets, and Neil Killeen dismissed Foster to give Durham an innings win despite lacking internationals Paul Collingwood, Steve Harmison and Mike Hussey. They did have New Zealand international Nathan Astle in the side – he contributed with 15 runs and no wicket for 24. (BBC scorecard)", "Essex needed 299 to win, and had four sessions to do it. They lost Ravinder Bopara after 12 minutes, caught off Liam Plunkett, but Andy Flower and Alastair Cook forged a 72-run partnership before Durham medium-pacer Mark Davies struck and had Cook caught behind. At stumps on day three, Essex were 129 for 2. Lewis and Gareth Breese did a lot of bowling for Durham on the fourth day, totalling 65.1 of Durham's total of 100.1 overs, and after Ronnie Irani departed for 48, Durham limited the Essex partnerships to no more than 25. Andy Flower stood tall, however, spending six and a half hours at the crease to end with 132 not out – and his eighth-wicket partnership of 25 saw Essex cut the target to 10. Palladino hung in there with Flower, contributing a single, and Essex won by two wickets."]}, {"page": "Somerset County Cricket Club in 2005", "response": ["In reply, Durham struggled with playing Andrew Caddick, as he removed four Durham batsmen for single-figure scores. Only Liam Plunkett (74 not out) and Mark Davies (62) managed to play Caddick with some success, and that was on the second day - at stumps on day one, Caddick had taken five wickets and reduced Durham to 141/7. Plunkett and Davies, batting at 8 and 10 respectively, saved the innings to 298 all out and a lead of 46 runs - while Caddick was taken around to end with six for 106."]}, {"page": "Durham County Cricket Club in 2005", "response": ["*  Mark Davies", "Worcestershire won the toss at Chester-le-Street and chose to bat first, and Stephen Peters and Stephen Moore started them off with a 75-run opening stand. Then Mark Davies, who played 12 of 17 matches in 2005, took six wickets for 32 to reduce them to 120, before Steve Harmison (three wickets) and Paul Collingwood (one wicket) finished off the tail to bowl Worcestershire out for 171. Collingwood then returned with the bat and got to 88 not out, to leave Durham 32 behind with eight wickets in hand at the close of play.", "Somerset's bowling was spearheaded by Caddick, who he removed four Durham batsmen for single-figure scores, and at stumps on day one, Caddick had taken five wickets and reduced Durham to 141 for 7. On day two, however, Liam Plunkett made 74 and Mark Davies 62, batting at 8 and 10 respectively, and lifted Durham to 298 all out and a lead of 46 runs - while Caddick got one more wicket, ending with six for 106.", "Durham continued their run of unbeaten matches in the 2005 season by defeating Essex in just three days at Chester-le-Street. Durham batted first, and made a total of 505 in the first innings, with Gordon Muchall and stand-in captain Dale Benkenstein both making centuries and ten batsmen made it into double figures. The Durham bowlers then backed up the batsmen's efforts by seeing off the Essex batsmen in just 55 overs to leave them all out for 106, Ashley Noffke and Mark Davies taking four wickets each. Essex followed on 399 behind, and were 140 for 6 after three wickets from Davies, despite nightwatchman Dale Steyn making 82. However, number nine Andre Adams made 103, James Foster added 78, and Essex made it to 366 for 7 - before Davies grabbed two wickets, and Neil Killeen dismissed Foster to give Durham an innings win despite lacking internationals Paul Collingwood, Steve Harmison and Mike Hussey. They did have New Zealand international Nathan Astle in the side - he contributed with 15 runs and no wicket for 24. (BBC scorecard)", "Paul Collingwood made a first-innings 190 - 52% of the Durham total - on his return to County Championship cricket following his stint with the England ODI team in the NatWest Series. However, Derbyshire's second highest score of the season, and rain cutting off about 80 overs of the match, resulted in the match in a draw. The hosts had taken three early Durham wickets for 59 after being put in the field, but Collingwood and skipper Dale Benkenstein lifted Durham with a 250-run partnership - to 309 for 4. However, Derbyshire did get some kind of revenge - five wickets fell for nine runs by the end of the day, as Durham were 363 for 9 at stumps, and only eight runs were taken before the last wicket fell on the second day. Durham took wickets as well, though, as Mark Davies got three wickets for four runs, including Michael di Venuto for 32, and Liam Plunkett also took three wickets as Derbyshire made 161 in 41.1 overs.", "Essex needed 299 to win, and had four sessions to do it. They lost Ravinder Bopara after 12 minutes, caught off Liam Plunkett, but Andy Flower and Alastair Cook forged a 72-run partnership before Durham medium-pacer Mark Davies struck and had Cook caught behind. At stumps on day three, Essex were 129 for 2. Lewis and Gareth Breese did a lot of bowling for Durham on the fourth day, totalling 65.1 of Durham's total of 100.1 overs, and after Ronnie Irani departed for 48, Durham limited the Essex partnerships to no more than 25. Andy Flower stood tall, however, spending six and a half hours at the crease to end with 132 not out - and his eighth-wicket partnership of 25 saw Essex cut the target to 10. Palladino hung in there with Flower, contributing a single, and Essex won by two wickets.", "||Mark Davies || 296.4 || 94 || 810 || 49 || 6-32 || 16.53 || 36.3 || 2.73"]}, {"page": "Worcestershire County Cricket Club in 2005", "response": ["Worcestershire won the toss at Chester-le-Street and chose to bat first. Stephen Peters and Stephen Moore started them off well as they moved to 75 without loss. Then Mark Davies, who is fighting for his first-team place, took six wickets to reduce them to 120, before Steve Harmison (3 wickets) and Paul Collingwood (1 wicket) finished off the tail to reduce Worcestershire to 171 all out. Collingwood then returned with the bat and got to 88 not out, to leave Durham well-placed on 139 for 2 at close."]}, {"page": "Derbyshire County Cricket Club in 2005", "response": ["Paul Collingwood made a first-innings 190 – 52% of the Durham total – on his return to County Championship cricket following his stint with the England ODI team in the NatWest Series. However, Derbyshire's second highest score of the season, and rain cutting off about 80 overs of the match, resulted in the match in a draw. The hosts had taken three early Durham wickets for 59 after being put in the field, but Collingwood and skipper Dale Benkenstein lifted Durham with a 250-run partnership – to 309 for 4. However, Derbyshire did get some kind of revenge – five wickets fell for nine runs by the end of the day, as Durham were 363 for 9 at stumps, and only eight runs were taken before the last wicket fell on the second day. Durham took wickets as well, though, as Mark Davies got three wickets for four runs, including Michael di Venuto for 32, and Liam Plunkett also took three wickets as Derbyshire made 161 in 41.1 overs."]}, {"page": "Northfield School & Sports College", "response": ["*Mark Davies, former Durham County and England Lions cricket player"]}, {"page": "List of Durham List A cricket records", "response": ["| 9th || 62* ||  Graeme Bridge Mark Davies || v Leicestershire || Leicester || 2002"]}, {"page": "Anthony Davies (disambiguation)", "response": ["*Anthony Mark Davies (cricketer, born 1980)"]}, {"page": "Mark Davies", "response": ["*Mark Davies (athlete) (1960–2011), Australian Paralympic athlete", "*Mark Davies (footballer, born 1988), English footballer with Bolton Wanderers", "*Mark Davies (South African soccer)", "*Mark Davies (rugby union) (born 1958), Wales international rugby union player", "*Mark Davies (cricketer, born 1980), former English cricketer", "*Mark Davies (cricketer, born 1959), former Welsh cricketer", "*Mark Davies (cricketer, born 1969), former Welsh cricketer", "*Mark Davies (cricketer, born 1962), former English cricketer", "*Mark Davies (bishop of Middleton) (born 1962), British Anglican bishop", "*Mark Davies (bishop of Shrewsbury) (born 1959), British Roman Catholic bishop", "*Mark Davies (linguist) (born 1963), professor of linguistics at Brigham Young University"]}, {"page": "List of Durham County Cricket Club seasons", "response": ["|align=left|Mark Davies"]}, {"page": "English cricket team in South Africa in 2009–10", "response": ["* Mark Davies"]}, {"page": "Charles Legget", "response": ["While studying for his degree at Durham University, Legget made his first-class debut for Durham UCCE against Durham in 2008.  In his only first-class appearance for the university, he was dismissed for 4 runs in the university's first-innings by Graham Onions, with the university being bowled out for 76.  In Durham's only innings, he took the wickets of Phil Mustard and Mark Davies for the cost of 43 runs from 10 overs."]}, {"page": "List of Durham County Cricket Club players", "response": ["* Mark Davies (1998–2010) : A. M. Davies"]}, {"page": "Kent County Cricket Club in 2014", "response": ["Bowler Mark Davies was forced to retire from playing in September after failing to recover from a shoulder injury. At the end of the season, and having lost his place in the first team to Sam Billings, former England wicket-keeper Geraint Jones left the county to join Gloucestershire as four-day captain after 15 seasons with Kent.", "|style=\"text-align:center\"|31 || Mark Davies ||  ||  || Right-handed || Right arm medium ||"]}, {"page": "Kent County Cricket Club in 2013", "response": ["|style=\"text-align:center\"|31 || Mark Davies ||  ||  || Right-handed || Right arm medium ||", "|align=\"left\"|Mark Davies", "|align=\"left\"|Mark Davies", "|align=\"left\"|Mark Davies", "|align=\"left\"|Mark Davies", "|align=\"left\"|Mark Davies", "|align=\"left\"|Mark Davies"]}, {"page": "Kent County Cricket Club in 2012", "response": ["|Mark Davies ||  ||  || Right-handed || Right arm medium ||", "|align=\"left\"|Mark Davies", "|align=\"left\"|Mark Davies", "|align=\"left\"|Mark Davies", "|align=\"left\"|Mark Davies", "|align=\"left\"|Mark Davies", "|align=\"left\"|Mark Davies"]}, {"page": "List of Durham Cricket Board List A players", "response": ["*Mark Davies (2000–2001): AM Davies"]}]}}