{"wiki_id": "http://www.wikidata.org/entity/Q6767624", "itemLabel": "Mark Flanagan", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Flanagan_(musician)", "wikipedia_page": {"main": "Mark Flanagan (born in Liverpool) is a blues guitarist who plays with Jools Holland's band, The Rhythm and Blues Orchestra. He also fronts the trio \"Flanagan\", which currently includes himself, Adam Double and George Double. He is also fronting the band The Fields.\nHe is also a frequent session musician for live television appearances, having worked with Chaka Khan, Paul Weller, Barry White, Eric Clapton and George Harrison.", "link_mentions": [{"page": "Brainwashed (George Harrison album)", "response": ["*Mark Flanagan – acoustic lead guitar (10)"]}, {"page": "Bluecoat Aspley Academy", "response": ["* Mark Flanagan (musician)"]}, {"page": "Flanagan", "response": ["* Flanagan, a band fronted by Mark Flanagan (musician)"]}, {"page": "Jim Jiminee", "response": ["Delphi Newman and guitarist Paul Greendale formed the band World Without Tigers in 1998. In 2002, she sang on Mark Flanagan's album The Chosen Few."]}, {"page": "Mark Flanagan", "response": ["Mark Flanagan may refer to:", "* Mark Flanagan (actor), Welsh television actor", "* Mark Flanagan (boxer) (born 1990), Australian boxer", "* Mark Flanagan (chef), head chef to the royal household of the UK", "* Mark Flanagan (communications), former head of strategic communications at 10 Downing Street, now a partner at Portland Communications", "* Mark Flanagan (musician), British blues guitarist", "* Mark Flanagan (rugby league) (born 1987), English rugby league player", "* Mark Flanagan (rugby union) (born 1989), Irish rugby union player", "* Mark Flanagan, owner of the Largo nightclub in Los Angeles"]}, {"page": "Chosen Few", "response": ["*The Chosen Few, a solo album by blues guitarist Mark Flanagan"]}, {"page": "List of Later... with Jools Holland episodes", "response": ["| Bryan Ferry / Van Morrison / Jamiroquai / Chrissie Hynde / Ronnie Wood / Electra Strings / Skin / Chris Difford / Travis / Lonnie Donegan. (Studio guests include; Harry Enfield, Alan Davies, Paul Whitehouse, Charlie Higson, Rowland Rivron, John Thomson, Michael Eavis, Bella Freud, Bill Paterson, Joe Absolom, Tamzin Outhwaite, John Sessions, Meera Syal, Kulvinder Ghir, Nina Wadia, Sanjeev Bhaskar, Jo Wood, John Gordon Sinclair, Clare Grogan, Holly Johnson, Natasha Little, Ralf Little, Angela Griffin, Lisa Faulkner, Nicola Stephenson, Mark Flanagan, Simon Pegg and Jessica Stevenson.)"]}, {"page": "Jools Holland's Rhythm and Blues Orchestra", "response": ["*Mark Flanagan — guitar, backing vocals"]}]}}