{"wiki_id": "http://www.wikidata.org/entity/Q6766807", "itemLabel": "Mark Boyd", "itemDescription": "footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Boyd_(footballer)", "wikipedia_page": {"main": "Mark Edward Boyd (born 22 October 1981) is an English former football player and manager. He scored 19 goals in 298 league and cup appearances in an 11-year career in the English Football League, Scottish Football League and Conference, and also later spent six years playing non-League football below the Conference level.\nBeginning his career as midfielder with Newcastle United, he never made the first team and instead signed with Port Vale in 2002. After two years with the Vale he moved north to Scottish side Gretna via Carlisle United. Failing to make an impact he returned to the Football League with a Macclesfield Town loan in 2005. After a short spell with Accrington Stanley in 2006, he joined non-League side Southport. He joined Irish club Sligo Rovers in 2007, before turning to the English non-League scene with Barrow the following year. He joined Workington via Droylsden in 2011, before switching to Celtic Nation in June 2013. He helped Celtic Nation to a second-place finish in the Northern League in 2013–14, before taking up the management position for the 2014–15 season, after which the club was folded. He later played for Penrith and Carlisle City.", "link_mentions": [{"page": "Brian Horton", "response": ["The club entered a financial crisis following the collapse of ITV Digital, which cost the club £400,000 in revenue. This meant Horton had to build his squad for the 2001–02 season entirely on free transfers, the most influential proving to be former Coventry City striker Stephen McPhee. Vale beat rivals Stoke City, but ended the season in 14th-place. Horton was named as Manager of the Month after his team earned 13 points from a possible 18 in February. Horton signed Jon McCarthy, Brett Angell, Ian Brightwell, Phil Charnock, Sam Collins, and Mark Boyd for the 2002–03 campaign. Four straight defeats were followed by five consecutive victories, as he supplemented his squad with the additions of Lee Ashcroft, Peter Clarke and Adrian Littlejohn. Though relegation was avoided, Horton still remained unpopular with some sections of the Vale's supporters. However the season was dominated by off-the-field issues, as Vale entered administration, and were taken over by Bill Bratt's fan-based consortium.", "Linked with the management position at Swansea City, Horton was instead appointed as manager of struggling Third Division club Macclesfield Town at the start of April 2004, replacing John Askey, who stayed on as a coach. This was initially until the end of the season, but Horton was given the job on a permanent basis in May. He rejuvenated a demoralised side and kept them in the Football League, as they finished seven points clear of the relegation zone in 2003–04. Over the summer he signed Iraqi international Jassim Swadi, experienced striker Mike Sheron, veteran defender Tony Barras, left-back Mark Bailey, and Tommy Rooney. He allowed Martin Carruthers to leave, though extended Tommy Widdrington's contract, and offered fresh deals to six others. He later added to his squad by signing Mark Boyd and Simon Weaver; whilst transfer listing Tommy Widdrington and Michael Welch. Many pundits were tipping the \"Silkmen\" to slip out of the newly named League Two at the end of the 2004–05 season, but Horton proved the observers wrong as his side were in the top-seven of the division virtually all season long. Horton celebrated his 1000th game as a manager on 3 November 2004, as Macclesfield beat Mansfield 4–0 in the Football League Trophy. He also won the League Two Manager of the Month award for February. Macclesfield qualified for the play-offs in sixth place, but their promotion challenge was finally ended by Lincoln City in the semi-finals, following a 2–1 aggregate defeat. At the end of the season, Horton released nine players, including club captain Matthew Tipton. In the place of these nine players he signed Kevin Sandwith, Kevin Townson, Martin Bullock, and David Beresford."]}, {"page": "Mark Edward Boyd", "response": ["#REDIRECT Mark Boyd (footballer)"]}, {"page": "2010 FA Trophy Final", "response": ["|MF ||8|| Mark Boyd || || "]}, {"page": "2002–03 Newcastle United F.C. season", "response": ["|  Mark Boyd"]}, {"page": "2002–03 Port Vale F.C. season", "response": ["The pre-season saw Brian Horton make several free signings: Jon McCarthy (Birmingham City); Brett Angell (Rushden & Diamonds); Ian Brightwell (Walsall); Phil Charnock (Crewe Alexandra); Sam Collins (Bury); and Mark Boyd (Newcastle United). Midfielder Dean Keates had a trial at the club over the summer, but was not offered a contract.", "|align=\"left\"|MF||14||align=\"left\"| Mark Boyd", "|–||MF||||14||Mark Boyd||3||1||0||0||4", "| May 2002 || MF ||  || Mark Boyd || Newcastle United || Free transfer || "]}, {"page": "2003–04 Port Vale F.C. season", "response": ["The season opened with seven wins in eleven games, earning Brian Horton the Manager of the Month award. Though this was followed by a sequence of five defeats in eight games as the goals dried up, this run included a 5–1 thumping at home to Plymouth Argyle. In November, back-up keeper Dean Delany joined Macclesfield Town on a two-month loan. Vale then were in patchy form until March, though the side managed to do the double over Sheffield Wednesday. Brian Horton resigned in February, with the club in the play-offs. His replacement was former Vale legend Martin Foyle, whose only previous experience was in the club's youth set-up. As his assistant he appointed former teammate, Dean Glover, another club legend. In March, Foyle made his first signing, bringing defender Craig James on loan from Sunderland, and after a few weeks he signed him permanently. Mark Boyd headed out of the club however, and was allowed to sign with Carlisle United. Vale lost just two of their final twelve games, and ran close to a play-off place, only losing out due to their inferior goal difference.", "|align=\"left\"|MF||14||align=\"left\"| Mark Boyd", "| March 2004 || MF ||  || Mark Boyd || Carlisle United || Free transfer || "]}, {"page": "Mark Boyd", "response": ["Mark Boyd may refer to:", "* Mark Boyd (footballer) (born 1981), English football midfielder", "* Mark Boyd (author) (1805–1879), English author"]}, {"page": "Will Vaulks", "response": ["In August 2012, Vaulks joined Workington of the Conference North. initially on a one-month loan. He made his senior debut on 22 August in a 1–0 loss at Chester, as a 65th-minute substitute for Mark Boyd. His loan was subsequently extended twice, before he signed a permanent deal with Workington at the start of December 2012. He made 24 appearances in all competitions for the Cumbrian club, scoring the equaliser in a 2–1 win over Droylsden at Borough Park."]}]}}