{"wiki_id": "http://www.wikidata.org/entity/Q6760317", "itemLabel": "Margery de Burgh", "itemDescription": "Medieval Irish noblewoman", "wikipedia_url": "https://en.wikipedia.org/wiki/Margery_de_Burgh", "wikipedia_page": {"main": "Margery de Burgh, was a Norman- Irish noblewoman and the wife of Theobald Le Botiller.", "link_mentions": [{"page": "1224", "response": ["* Margery de Burgh, Norman noblewoman (d. 1252)"]}, {"page": "Richard Mór de Burgh, 1st Baron of Connaught", "response": ["* Margery de Burgh (d. after March 1253) married Theobald Butler, 3rd Chief Butler of Ireland."]}, {"page": "William Óg de Burgh", "response": ["**** Margery de Burgh"]}, {"page": "Burke Civil War", "response": ["**** Margery de Burgh"]}, {"page": "Uilleag de Burgh", "response": ["**** Margery de Burgh"]}, {"page": "Clanricarde", "response": ["**** Margery de Burgh"]}, {"page": "Theobald le Botiller, 2nd Chief Butler of Ireland", "response": ["* Theobald Butler, 3rd Chief Butler of Ireland (1224-1248). His son married Margery de Burgh, daughter of Richard Mor de Burgh and Egidia de Lacy"]}, {"page": "James Butler, 1st Earl of Ormond", "response": ["James Butler was the son of Edmund Butler, Earl of Carrick, (126813 September 1321), Justiciar of Ireland and Joan FitzGerald, Countess of Carrick. His paternal grandparents were Theobald le Botiller (1242–1285), (the son of Theobald le Botiller and Margery de Burgh) and Joan FitzJohn (FitzGeffrey) (d. 4 April 1303), who was the daughter of John FitzGeoffrey, Lord of Shere, Justiciar of Ireland and Isabel Bigod. His maternal grandfather was John FitzThomas FitzGerald, 1st Earl of Kildare,  who married Blanche de la Roche."]}, {"page": "Maud le Vavasour, Baroness Butler", "response": ["* Theobald le Botiller, chief Butler of Ireland (by 1199 – 19 July 1230), who married firstly Joan du Marais, daughter of Geoffrey du Marais and Eva de Bermingham, and had a son, Theobald Butler (1224–1248), who married Margery de Burgh, daughter of Richard Mor de Burgh, Lord of Connacht, and Egidia de Lacy (daughter of Walter de Lacy and Margaret de Braose), and from whom descended the Earls of Ormond. Theobald, chief Butler of Ireland married, secondly, after 4 September 1225, Roesia de Verdun (1205 – 10 February 1247), daughter of Nicholas de Verdun and Clementia, by whom he had a son and daughter: John le Botiller de Verdon, Lord of Westmeath (1226–1274), who married Margery de Lacy (1229 – after 10 June 1276), by whom he had issue, and Maud le Botiller de Verdon, who married John Fitzalan, Lord of Oswestry and Clun."]}, {"page": "Egidia de Lacy, Lady of Connacht", "response": ["* Margery de Burgh (died after 1 March 1253), married Theobald le Botiller, son of Theobald le Botiller, chief Butler of Ireland and Joan du Marais, by whom she had issue. They were ancestors of the Butler Earls of Ormond."]}, {"page": "Theobald Butler, 4th Chief Butler of Ireland", "response": ["Theobald Butler, 4th Chief Butler of Ireland (1242 – 26 September 1285) was the son of Theobald Butler, 3rd Chief Butler of Ireland and Margery de Burgh, daughter of Richard Mor de Burgh, 1st Lord of Connacht. He assisted King Edward I of England in his wars in Scotland. He died at the castle of Arklow, County Wicklow, Ireland, and was buried at Arklow Monastery.Lodge, John The Peerage of Ireland or, A Genealogical History Of The Present Nobility Of That Kingdom, 1789, Vol IV, p 5."]}, {"page": "Theobald Butler, 3rd Chief Butler of Ireland", "response": ["He married Margery de Burgh, in 1242, daughter of Justiciar of Ireland Richard Mór de Burgh, 1st Lord of Connacht. With his wife he had, besides other lands, the manors of Ardmaile and Killmorarkill. Their children were:   "]}, {"page": "Mac William Íochtar", "response": ["**** Margery de Burgh"]}, {"page": "Margery (disambiguation)", "response": ["* Margery de Burgh, 13th century Norman-Irish noblewoman"]}]}}