{"wiki_id": "http://www.wikidata.org/entity/Q6766604", "itemLabel": "Mark Ashton", "itemDescription": "British gay rights activist (1960-1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Ashton", "wikipedia_page": {"main": "Mark Christian Ashton ((1960-05-19)19 May 1960 – (1987-02-11)11 February 1987) was a British gay rights activist and co-founder of the Lesbians and Gays Support the Miners (LGSM) support group. He was a member of the Communist Party of Great Britain and general secretary of the Young Communist League.", "link_mentions": [{"page": "1960", "response": ["** Mark Ashton, British gay rights activist (d. 1987) "]}, {"page": "1987", "response": ["* February 11 – Mark Ashton, Irish gay rights activist (b. 1960)"]}, {"page": "Old Left", "response": ["* Mark Ashton (founder of Lesbians and Gays Support the Miners and LGBT rights advocate) – member of the Communist Party of Great Britain"]}, {"page": "Elephant and Castle", "response": ["* During the 1980s, Mark Ashton lived in a council flat in Claydon House on the Heygate Estate, which is where he formed with his friend Mike Jackson the group Lesbians and Gays Support the Miners in 1984."]}, {"page": "Portrush", "response": ["* Mark Ashton, LGBT activist, lived in Portrush"]}, {"page": "LGBT History Month", "response": ["* 2021: Lily Parr, Mark Ashton, Maya Angelou, Michael Dillon and Mark Weston"]}, {"page": "List of gay, lesbian or bisexual people: A", "response": ["| Mark Ashton"]}, {"page": "List of biographical films", "response": ["||Mark Ashton"]}, {"page": "Gay's the Word (bookshop)", "response": ["Lesbians and Gays Support the Miners used to meet at the bookshop and collect money for the striking miners in 1984/85. When the meetings grew too large for the space they moved their meetings to the Fallen Angel pub. The 2014 film Pride, directed by Matthew Warchus, featured the group as they campaigned and raised money for striking Welsh miners and depicts the shop being a target for several instances of homophobic aggression and vandalism. Filming actually took place in a building on Kingsgate Road, West Hampstead. In 2017 a blue plaque was unveiled above the bookshop in honour of Mark Ashton, gay rights activist and co-founder of LGSM."]}, {"page": "Lesbians and Gays Support the Miners", "response": ["During the strike, the Thatcher administration sequestered the funds of the National Union of Mineworkers (NUM), meaning that it was pointless for supporters of the strike to send donations to the national union. Instead, support groups throughout the UK were encouraged to \"twin\" directly with the various mining communities in England, Scotland and Wales. Among these organisations, the LGSM was formed by Communist Party of Great Britain activist Mark Ashton, and his friends, after the two men collected donations for the miners at the 1984 Lesbian and Gay Pride march in London. The London LGSM group met and fundraised in numerous locations, including the Gay's the Word bookshop. The group grew rapidly and moved out of Gay's The Word to a larger venue: The Fallen Angel, a gay pub in Graham Street, Islington. The London group was twinned with the Neath, Dulais and Swansea Valleys Miners Support Groups.", "In 2015, following the film's release, the surviving members of the organisation held a 30th anniversary reunion to raise funds for the Mark Ashton Fund, an HIV/AIDS charitable fund administered by the Terrence Higgins Trust. The group was chosen to lead the 2015 Birmingham Pride parade, in recognition of their historic status. They were also slated to lead the 2015 Pride in London parade, but withdrew in favour of marching further back in the parade after organisers refused to allow other affiliated groups, such as trade union contingents, to march immediately alongside the LGSM. They also accepted invitations to 2015 Pride marches in Derry, Doncaster, Newcastle upon Tyne, Sunderland, Norwich, Liverpool Pride, Belfast and Leeds Pride."]}, {"page": "Communism and LGBT rights", "response": ["* Mark Ashton (founder of Lesbians and Gays Support the Miners and LGBT rights advocate) – member of the Communist Party of Great Britain.", "The Communist Party of Great Britain (CPGB) viewed the working-class as male and heterosexually masculine. The accounts of gay party members show that homosexuality was widely seen as incompatible with a working-class identity during this era, despite Mark Ashton (founder of Lesbians and Gays Support the Miners) being General Secretary of the Young Communist League (the youth wing of the CPGB) \"without compromising the politics of their sexuality\".", "|Mark Ashton"]}, {"page": "Ashton (surname)", "response": ["*Mark Ashton (1960–1987), British gay rights activist and general secretary of Young Communist League"]}, {"page": "BIFA Award for Best Supporting Actor", "response": ["| Mark Ashton"]}, {"page": "Red (The Communards album)", "response": ["The last cut on the original vinyl side one is an emotional ballad. It was written in memory of Mark Ashton a friend of Somerville and Richard Coles who died of HIV/AIDS. Mark Hooper of The Rough Guide to Rock writes that this cut may be Somerville's \"most impassioned moment\". It was among the first pop songs to address AIDS. \"For a Friend\" reached number 28 on the British charts. It was featured in the soundtrack of the 2014 film Pride. It was also one of the songs played at Burberry’s February 2018 show, marking Christopher Bailey’s final outing for the brand."]}, {"page": "Constantine Giannaris", "response": ["| director; writer; short film, 40 minutes, dedicated to Mark Ashton"]}, {"page": "Young Communist League (Great Britain)", "response": ["In 1985, Mark Ashton became General Secretary of the YCL, having co-founded Lesbians and Gays Support the Miners to raise funds supporting the National Union of Mineworkers during the year-long strike of 1984–1985. By the end of the strike, eleven different LGSM groups had emerged throughout the UK, with the London group alone raising £22,500 by 1985 (equivalent to £69,000 in 2019) in support. The events of Mark Ashton and LGSM have since been dramatised in the 2014 film Pride.", "|Mark Ashton"]}, {"page": "Communist Party of Great Britain", "response": ["During the mass migration of British African-Caribbean people, known as the Windrush Generation, the CPGB dedicated much of its political activity to opposing racism, inspiring many leading black rights activists to join the CPGB, including Trevor Carter, Charlie Hutchison, Dorothy Kuya, Billy Strachan, Peter Blackman, Henry Gunter, and Len Johnson. The most famous of these black CPGB activists, Claudia Jones, created Britain's first major black newspaper and founded London's Notting Hill Carnival, the world's second-largest annual carnival. In 1956 the CPGB experienced a significant loss of members due to its support of the Soviet military intervention in Hungary, and the party took nearly a decade to recover its lost membership. During the 1960s, CPGB activists raised money and equipment to donate to Vietnamese communists fighting in the Vietnam War. In 1984, the leader of the CPGB's youth wing Mark Ashton founded Lesbians and Gays Support the Miners, recognised as a turning point for the recognition of LGBT people in the UK.", "* Mark Ashton"]}, {"page": "Ben Schnetzer", "response": ["In 2010, Schnetzer appeared in an episode of Law & Order and co-starred on the series Happy Town. He played Max Vandenburg in the film adaptation of The Book Thief (2013). He played Mark Ashton in the movie Pride, released in 2014, and his performance drew positive reviews. Charlotte O'Sullivan, writing for the London Evening Standard, said: \"Schnetzer is a New Yorker with an unpromising CV (he was one of the few good things about The Book Thief) and he's fantastic here.\"", "|Mark Ashton"]}, {"page": "Pride (2014 film)", "response": ["Upon watching the news about the miners' strike, gay activist Mark Ashton realises that the police have stopped harassing the gay community because their attention is elsewhere. He spontaneously arranges a bucket collection for the miners during the Gay Pride Parade in London. Encouraged by the success, he founds \"Lesbians and Gays Support the Miners\". Among its first members are 20-year-old closeted student Joe Cooper and an older gay couple Gethin and Jonathan, whose bookshop (called Gay's the Word) they use as headquarters.", "On the morning of the 1985 Gay Pride Parade, Mark returns to the group and apologises for abandoning the cause. He leads LGSM to the Parade, where they are joined by hundreds of miners in a show of solidarity. The closing scenes reveal that the Labour Party incorporated rights for gays and lesbians in their party programme under pressure from the National Union of Mineworkers, that  was later elected to Parliament and that Mark Ashton died of AIDS two years later.", "* Ben Schnetzer as Mark Ashton, founder of LGSM", "The absence of any mention of Mark Ashton's communist beliefs in the film, despite his position as the leader of the  youth branch of the Communist Party of Great Britain's (CPGB), has become a point of contention for his surviving friends. Fellow communist activist and a close friend of Mark Ashton, Lorraine Douglas, accused the film of having \"glossed over Mark's politics and said nothing about the fact he subsequently became General Secretary of the YCL\", the youth wing of the CPGB.", "Peter Bradshaw, reviewing for The Guardian, described the film as \"impassioned and lovable\". Bradshaw praised performances of the cast, including Bill Nighy's \"taciturn shyness\" in his portrayal as Cliff and the \"dignified and intelligent performance\" from Paddy Considine as Dai. Imelda Staunton's performance as Hefina Headon, who died in October 2013, was met with positive reviews by critics. Geoffrey Macnab said Staunton's performance as the matriarchal Hefina was \"part Mother Courage and part Hilda Ogden\". Ben Schnetzer's performance as Mark Ashton drew positive reviews. Charlotte O'Sullivan, writing for the London Evening Standard, said: \"Schnetzer is a New Yorker with an unpromising CV (he was one of the few good things about The Book Thief) and he's fantastic here\"."]}, {"page": "For a Friend", "response": ["The song is an emotional ballad and was written in the memory of Mark Ashton, a friend of Jimmy Somerville and Richard Coles. Mark Hooper of The Rough Guide to Rock writes that this cut may be Somerville's \"most impassioned moment\". \"For a Friend\" reached number 28 on the British charts."]}, {"page": "Framed Youth: The Revenge of the Teenage Perverts", "response": ["** Mark Ashton"]}, {"page": "Ashton, Mark", "response": ["#redirectMark Ashton"]}, {"page": "Hôtel-Lamoignon - Mark Ashton Garden", "response": ["The garden takes its name after young British LGBT-activist and Young Communist League general secretary Mark Ashton (1960–1987), by vote of the Council of Paris..", "* Mark Ashton"]}, {"page": "Jessie Eden", "response": ["*Mark Ashton"]}, {"page": "British Independent Film Award for Breakthrough Performance", "response": ["| Mark Ashton"]}]}}