{"wiki_id": "http://www.wikidata.org/entity/Q6767732", "itemLabel": "Mark Gavin", "itemDescription": "Scottish footballer (born 1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Gavin", "wikipedia_page": {"main": "Mark Wilson Gavin (born 10 December 1963) is a Scottish former footballer who played as a winger. He made over 290 Football League appearances in the 1980s and 1990s.", "link_mentions": [{"page": "Wayne Allison", "response": ["Allison joined Watford for £250,000 in July 1989, one of three players signed by Steve Harrison from Halifax during his tenure. At Watford he made only 7 appearances, scoring no goals. In July 1990 Watford signed Mark Gavin from Bristol City for a fee for £250,000 and Allison, who was valued at £150,000, went to City in exchange. He was more successful in Bristol, netting 57 goals in 225 games over a five-year spell at the club."]}, {"page": "Gavin", "response": ["* Mark Gavin (born 1963), Scottish footballer"]}, {"page": "John Borland", "response": ["Borland was placed on the transfer list by Burnley manager Adrian Heath in the summer of 1996 and subsequently joined Third Division outfit Scunthorpe United on a free transfer. He made his debut for the side on 14 September, coming on as a substitute for Mark Gavin in the 0–1 loss against Cardiff City. Borland again struggled to break into the first team and played only once more for Scunthorpe before being released at the end of the season. A career in non-league football followed; he signed for Accrington Stanley ahead of the 1997–98 season and spent 18 months with the club before being released after the arrival of new manager Wayne Harrison in January 1999. After spending several months without a club, Borland joined North West Counties League side Rossendale United along with fellow former Accrington players Glenn Little and Paul Daughtry. Borland was a regular starter for Rossendale during his first year at the club, but then suffered a back injury which limited his appearances and eventually forced him to announce his retirement from football in November 2001."]}, {"page": "2012 UEFA European Under-17 Championship", "response": ["* Mark Gavin"]}, {"page": "1986 Associate Members' Cup Final", "response": ["| || ||Mark Gavin"]}, {"page": "Gavin, Mark", "response": ["#redirectMark Gavin"]}, {"page": "List of Rochdale A.F.C. players (25–99 appearances)", "response": ["|Mark Gavin"]}]}}