{"wiki_id": "http://www.wikidata.org/entity/Q6769057", "itemLabel": "Mark Noyce", "itemDescription": "martial artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Noyce", "wikipedia_page": {"main": "Mark Noyce (born 3 March 1974) is an English actor, writer, film director and producer.", "link_mentions": [{"page": "Ben Dover", "response": ["In 2016 Honey was cast by film producer Mark Noyce as Rubber John in the comedy film The Blazing Cannons."]}, {"page": "Game of Death", "response": ["* In the 2011 British comedy film On the Ropes, writer and director Mark Noyce added a scene in homage to his idol Bruce Lee which featured Mick Western (played by Ben Shockley) wearing a yellow tracksuit."]}, {"page": "Queen Katharine Academy", "response": ["* Mark Noyce - actor, writer, director and producer"]}, {"page": "Peterborough College", "response": ["*Mark Noyce"]}, {"page": "Noyce", "response": ["* Mark Noyce, English actor and film director"]}, {"page": "Pelé Reid", "response": ["In 2010, Reid was offered a role in the British comedy film On the Ropes. Director Mark Noyce chose Reid to fight Steve Coleman in a scene set at a martial arts competition."]}, {"page": "Steve Coleman (Wushu)", "response": ["In the 2011 film On The Ropes, Coleman appeared alongside Mark Noyce, Ben Shockley and others in a mockumentary style film about martial arts culture in the UK.On The Ropes cast & crew, ontheropes-themovie.com; accessed 26 December 2014."]}, {"page": "On the Ropes (2011 film)", "response": ["On the Ropes is a 2011 British mockumentary film written and directed by Mark Noyce. It follows the fictional character of martial arts instructor Keith Kraft and his rivalry with boxing gym owner Big Joe, played by actor and former boxer Joe Egan. The cast also includes Ben Shockley, Lindsay Honey, Raymond Griffiths, Sean Byrne and Alex Vincent.", "* Mark Noyce as Keith Kraft", "Britflicks critic Zachary Cooke gave the film a favourable review saying “There may not be an obvious category to put On the Ropes into, but it’s really just a great film that tips its hat to documentaries, dramas and the egos of those that are part of reality TV.” He was also complimentary about the quality of the acting and commented that “Both lead actors Mark Noyce and Ben Shockley are very convincing in their roles”.", "Richard Cross of A Full Tank of Gas stated “Thankfully, while On the Ropes is highly derivative of The Office - particularly in the performance of leading man Mark Noyce, who also wrote and directed - it generates a surprising amount of good will on the part of the viewer thanks largely to likeable performances and a refusal to take itself too seriously.” However he went on to write that “While Noyce gives an enjoyable performance as Kraft, his mannerisms and speech patterns are so closely modelled on those of The Office’s David Brent that his performance draws unnecessary - and unfavourable - comparisons, which is a shame because it diminishes his achievements in other departments”.", "The British Comedy Guide editor Mark Boosey wrote “this mockumentary gets off to a faltering start as it struggles to focus on anything in particular.”  but felt “things improve when the movie does settle down on the idea of following around and focusing on karate instructor Keith Kraft. This monstrous egocentric 'plonker' carries many of the film's best lines and set pieces, and is played very well by the film's creator, Mark Noyce.”", "* Interview with Mark Noyce", "* Mark Noyce in the Evening Telegraph"]}, {"page": "Ben Shockley", "response": ["Ink Pixel Films released a video in July 2012 featuring Shockley and British director Mark Noyce. During the discussion it was revealed that filming had begun on the comedy This is Jade (AKA The One Hit Wonder). It was also revealed that the two were collaborating on The Blazing Cannon's."]}, {"page": "List of British films of 2011", "response": ["|| Directors: Mark Noyce, Hamdy Taha   Cast: Joe Egan, Mark Noyce, Ben Shockley"]}, {"page": "Ink Pixel Films", "response": ["|Mark Noyce, Hamdy Taha", "| Hamdy Taha, Jennifer Young, Mark Noyce", "|Mark Noyce, Shaun Williamson, Hamdy Taha"]}, {"page": "Tim Selberg", "response": ["It was reported on June 2017 that Selberg was working with British film director Mark Noyce on the horror film Sammy."]}, {"page": "This Is Jayde: The One Hit Wonder", "response": ["This Is Jayde: The One Hit Wonder is a 2014 British comedy film directed by Jennifer Young and written by and starring Mark Noyce and Shaun Williamson. The film follows Jayde, a former 90's popstar desperate for a return to the limelight, that places all his hopes on a TV talent show hosted by Williamson's character Shaun.", "* Mark Noyce as Jayde", "* Interview with Mark Noyce in the Digital Filmmaker magazine", "* Mark Noyce and Shaun Williamson in the Fenland Citizen"]}, {"page": "The Blazing Cannons", "response": ["#REDIRECT Mark Noyce#Filmography"]}, {"page": "Happy Pup Films", "response": ["#REDIRECT Mark Noyce#Happy Pup Films"]}, {"page": "Keeping It Up", "response": ["#REDIRECT Mark Noyce#Filmography"]}, {"page": "Noyce, Mark", "response": ["#redirectMark Noyce"]}]}}