{"wiki_id": "http://www.wikidata.org/entity/Q6768221", "itemLabel": "Mark Jackson", "itemDescription": "British drummer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Jackson_(musician)", "wikipedia_page": {"main": "Mark Jackson is a drummer, electronic percussionist, and keyboard player, formerly a member of futurepop act VNV Nation. He is also an established professional club DJ and remix artist. In November 2017, it was announced that he was leaving VNV Nation to pursue other projects.\nIn addition to his work with VNV Nation, Mark has been involved in numerous artistic collaborations with other musicians and producers in the electronic music scenes.  Notably including vocal work with Rotersand, Reaper, Oliver Huntemann, and The Parallel Project, as well as live work and guest appearances with acts including Combichrist, Straftanz, Apoptygma Berzerk, and Kloq.\nMark originates from Essex, England and worked as a software developer, internet programmer, and web designer for CompuServe, MSN, and Microsoft. He played drums and keyboards as part of the electronic duo Manzero (1991–1993) and was vocalist and frontman for Faith Regime (1993–1995) before becoming a full-time musician with VNV Nation in 1996. He now lives in southwest France in the Basque Country region.\nA hobby of his is raising tarantulas.", "link_mentions": [{"page": "VNV Nation", "response": ["On 16 November 2017 in was announced that Mark Jackson, who had participated as live drummer at concerts since the mid-1990s, had left VNV Nation."]}, {"page": "University of Greenwich", "response": ["* Mark Jackson, musician (VNV Nation)"]}, {"page": "Donny Osmond", "response": ["In the 1980s, all of the Osmonds abandoned their earlier image that had originally been crafted to appeal to young viewers, hoping to reach a more adult audience. While his brothers moved toward country music to modest success, Donny was able to revive his career in popular music. He made an unlikely appearance as one of several celebrities and unknowns auditioning to sing for guitarist Jeff Beck in the video for Beck's 1985 single \"Ambitious\" – which was produced by Paul Flattery and directed by Jim Yukich – followed in 1986 by an equally unlikely cameo in the animated Luis Cardenas music video \"Runaway\". He spent several years as a performer, before hiring the services of music and entertainment guru Steven Machat, who got Osmond together with English singer-songwriter Peter Gabriel to see whether Machat and Gabriel could turn the TV Osmond's image into a contemporary young pop act.  They succeeded, returning Osmond to the US charts in 1989 with the Billboard Hot 100 No. 2 song \"Soldier of Love\" (originally announced on radio stations as \"from a mystery singer\") and its top twenty follow-up \"Sacred Emotion\". Launching an extensive tour in support of the Eyes Don't Lie record, he enlisted Earth Wind & Fire and Kenny Loggins guitarist Dick Smith along with keyboardist Mark Jackson."]}, {"page": "Mark Jackson (disambiguation)", "response": ["Mark Jackson (born 1965) is an American former basketball guard and former head coach of the Golden State Warriors.", "*Mark Jackson (R&B musician), American musician, member of the 1950s R&B group The Crows", "*Mark Jackson (musician) (born 1970), English musician, member of VNV Nation", "*Mark Jackson (actor) (born 1982), English actor known for his appearance as Isaac on The Orville", "*Mark Jackson (quarterback) (born 1954), American football player", "*Mark Jackson (wide receiver) (born 1963), American football player", "*Mark Jackson (athletic director) (born 1972), American football coach/administrator", "*Mark Jackson (Australian footballer) (born 1959), Australian rules footballer and actor", "*Mark Jackson (hurdler) (born 1969), Canadian track and field athlete", "*Mark Jackson (footballer, born 1977), English footballer", "*Mark Jackson (speed skater) (born 1980), New Zealand Olympic speed skater", "*Mark Jackson (curator) (born 1976), American British curator"]}, {"page": "Ronan Harris", "response": ["In 1988, Harris moved from Dublin, Ireland to London, England. He began recording music as VNV Nation in 1990 and moved to Toronto, Canada later that year. In 1994, Harris moved back to Europe where he soon met up with Mark Jackson, who joined VNV Nation as the drummer for live shows. Since 1995, Harris has released ten studio albums as VNV Nation.", "*Mark Jackson"]}, {"page": "Mark Jackson (vnv nation)", "response": ["#REDIRECT Mark Jackson (musician)"]}, {"page": "Rotersand", "response": ["The band has toured Europe with Assemblage 23 and both Europe and the US with Covenant, it played at Dark City Festival and was one of the headlining acts at Infest 2006. Mark Jackson of VNV Nation joined them on stage at the M'era Luna Festival in Hildesheim Germany in August 2006, and the band appeared twice at the Wave Gotik Treffen."]}, {"page": "List of musicians who play left-handed", "response": ["*Mark Jackson (VNV Nation)"]}, {"page": "Jackson (name)", "response": ["*Mark Jackson (musician) (born 1970), English musician", "*Mark Jackson (athlete) (born 1969), Canadian track and field athlete", "*Mark Jackson (basketball) (born 1965), American basketball player", "*Mark Jackson (footballer, born 1977), English footballer", "*Mark Jackson (wide receiver) (born 1963), American football player", "*Mark Jackson (American football coach) (born 1972), American football coach"]}, {"page": "Dave Eggar", "response": ["A virtuoso in many styles on both piano and cello, Eggar has performed, recorded, and arranged for artists in many genres including Phillip Phillips, Tony Bennett, Lindsey Stirling, Andrea Bocelli, Frank Ocean, Talib Kweli, Evanescence, Chromeo, RJD2, Fall Out Boy, Patti Smith, Michael Brecker, Chris Potter, Dave Sanborn, John Pattitucci, Mark Jackson, Amy Winehouse, Foreigner, Harry Belafonte, Meryl Streep, Lonnie Holley, Paul Simon, James Taylor, O.A.R., Beyoncé, Imagine Dragons, Nate Ruess, Gavin DeGraw, John Legend, Taylor Swift, Coldplay, Brett Eldredge, Ingrid Michaelson, Zayn Malik, Rachel Platten, A Great Big World, Breaking Benjamin, Five for Fighting, The Manhattan Transfer, Richard Bona, Roberta Flack, David Foster, Josh Groban, Trans-Siberian Orchestra, Grace VanderWaal, King Princess, H.E.R., Fiona Apple, King Princess, Bon Jovi, Roberta Flack, Abbey Lincoln, Joshua Bell, Wynton Marsalis, Carly Simon, DJ Spooky, Pete Seeger, Ralph Stanley, Robin and Linda Williams, Amber Rubarth, Gil Goldstein, Lucia Micarelli, Jukebox the Ghost, Martín Zarzar, Dina Fanai, and Esperanza Spalding."]}, {"page": "List of electronic drum performers", "response": ["* Mark Jackson - ex-VNV Nation"]}]}}