{"wiki_id": "http://www.wikidata.org/entity/Q6779906", "itemLabel": "Mary Jarred", "itemDescription": "British opera singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Jarred", "wikipedia_page": {"main": "Mary Jarred (9 October 1899 – 12 December 1993) was an English opera singer of the mid-twentieth century.  She is sometimes classed as a mezzo-soprano and sometimes as a contralto.", "link_mentions": [{"page": "1899 in music", "response": ["*October 9 – Mary Jarred, opera singer (died 1993)"]}, {"page": "Roy Henderson (baritone)", "response": ["He recorded the first complete Purcell Dido and Aeneas with Nancy Evans and the Boyd Neel ensemble conducted by Clarence Raybould before 1936.Also with Mary Hamlin, Mary Jarred and Dr Sydney Northcote, with Bernhard Ord (continuo), Charles Kennedy Scott's A Capella singers, and directed by Hubert J. Foss, Decca, for the Purcell Club by subscription, X 101-107 (14 sides)). cf. Darrell 1936, 371. In 1938, Henderson was one of the original 16 soloists in Vaughan Williams's Serenade to Music (his is the solo line to the words 'Nor is not moved with concord of sweet sounds'). In March 1940, he was involved in the Glyndebourne Company revival of The Beggar's Opera, directed by John Gielgud, at the Haymarket Theatre in London."]}, {"page": "Sea Pictures", "response": ["*Mary Jarred, contralto; The BBC Orchestra, Section F; Clarence Raybould, conductor Elgar's Interpreters on Record, Volume 5: Broadcasts from the Leech Collection at the British Library (1935–1950) Elgar Society EECD003-005 (\"Sea Slumber Song\" complete, \"Sabbath Morning at Sea\" to bar 84, \"The Swimmer\" bars between 74 and 107 are missing)"]}, {"page": "Margaret Balfour", "response": ["She was also recorded by HMV singing Bach's Mass in B Minor with Elisabeth Schumann and the London Symphony Orchestra conducted by Albert Coates in sessions in 1929 at Kingsway Hall, London. She sang in the St Matthew Passion in November 1929 (with Keith Falkner and Elsie Suddaby) at Westminster with the Bach Cantata Club under Charles Kennedy Scott. She sang Beethoven's Symphony No. 9 with the BBC Choral Society and the BBC Symphony Orchestra conducted by Arturo Toscanini at the Queen's Hall, London, on 22 May 1939.Not to be confused with the published Toscanini 1937 performance with the BBC Choral Society and the BBC Symphony Orchestra, for which his contralto soloist was Mary Jarred.  She was a soloist at the Handel Festival conducted by Henry Wood at Alexandra Palace in 1939."]}, {"page": "Serenade to Music", "response": ["|Muriel Brunskill, Astra Desmond, Mary Jarred, Margaret Balfour", "|Mary Jarred", "|Mary Jarred"]}, {"page": "Muriel Brunskill", "response": ["Her other recordings include Gounod's Faust, with Harold Williams, Robert Carr, and Robert Easton, conducted by Clarence Raybould; Vaughan Williams's Serenade to Music, with Lilian Stiles-Allen, Isobel Baillie, Elsie Suddaby, Eva Turner, Margaret Balfour, Astra Desmond, Mary Jarred, Parry Jones, Heddle Nash, Frank Titterton, Walter Widdop, Roy Henderson, Norman Allin, Robert Easton, Harold Williams, the Queen's Hall Orchestra, the BBC Symphony Orchestra, conducted by Sir Henry Wood; and John Toré's Golden City, original cast recording, with Edmund Purdom, Eleanor Summerfield and Emile Belcourt."]}, {"page": "Der fliegende Holländer discography", "response": ["|Herbert JanssenKirsten FlagstadLudwig WeberMax LorenzBen WilliamsMary Jarred "]}, {"page": "Dido and Aeneas discography", "response": ["|Nancy EvansMary HamlinRoy HendersonMary Jarred"]}, {"page": "Charles Kennedy Scott", "response": ["*Purcell: Dido and Aeneas (first complete): Nancy Evans (Dido), Mary Hamlin (Belinda), Roy Henderson (Aeneas), Mary Jarred (Sorceress), Olive Dyer (Spirit), Dr Sydney Northcote (Sailor), Gladys Currie (Second woman), Gwen Catley and Gladys Currie (Witches), Charles Kennedy Scott's A Cappella Singers, Boyd Neel String Orchestra, Boris Ord (continuo), Clarence Raybould (conductor), Hubert J. Foss (Musical director). (Decca Records, X 101–107, 7 12\" 78rpm records, by subscription only for the Purcell Society).R. D. Darrell, The Gramophone Shop Encyclopedia of Recorded Music (Gramophone Shop, New York 1936).For a full-length review of this recording see The Gramophone, December 1935, p. 19 ff."]}, {"page": "Clarence Raybould", "response": ["* Elgar Sea Pictures, excerpts.   Clarence Raybould (conductor), Mary Jarred (contralto) and BBC Symphony Orchestra"]}, {"page": "Leslie Baily", "response": ["During the Second World War Baily gave the Scrapbook series a new look as Everybody's Scrapbook, designed to proyide a link with the Empire; the formula pleased Canada and Australia as much as Britain. Another long-running series was Travellers' Tales, \"Adventures and misadventures, songs and stories from lands overseas, told by world-wide travellers\". After the war the Scrapbook series continued, and in 1947 \"Gilbert and Sullivan\" was first broadcast. It was billed as \"a radio biography in six parts\", and featured Carleton Hobbs as narrator, with D. A. Clarke-Smith as W. S. Gilbert and Ivan Samson as Arthur Sullivan; the music was performed by singers including Gwen Catley, Sylvia Cecil, Mary Jarred, Winifred Lawson, Charles Heslop and Richard Lewis, conducted by Stanford Robinson. In preparing the script Baily had many conversations with people who had known Gilbert and Sullivan, including Nancy McIntosh, Rupert D'Oyly Carte, and Newman Flower.\"Gilbert and Sullivan\", Radio Times, 19 September 1947, pp. 3 and 6 The series was remade in 1949, with Charles Groves succeeding Robinson as conductor. The last Scrapbook researched by Baily – for the year 1917 – was broadcast in August 1973."]}]}}